{
  "name": "Puwei Wang",
  "homepage": "http://iir.ruc.edu.cn/~pwwang",
  "status": "success",
  "content": "Puwei Wang's HomePage ççå· ä¸­æç Doctor Puwei WANG, Assistant Professor Database & Intelligent Information Retrieval Lab Renmin University of China Email: wangpuwei[at]ruc.edu.cn I obtained a Master degree in Computer Science from Wuhan University in 2004. I was conferred a Doctor degree in Computer Science at Institute of Computing Technology of Chinese Academy of Sciences in 2008. Now, I am an assistant professor of Key Laboratory of Data Engineering and Knowledge Engineering of Ministry of Education (Renmin University of China). Research Interests: Semantic Web, Web Serivces and Knowledge Management. News We receive the support from National Natural Science Foundation China (NSFC) about \"Environment Knowlege-based Active Web Service Composition\". I am invited to be program committee member for International Workshop on Knowledge and Data Engineering in Web-based Learning 2010. Selected Publications Puwei Wang, Zhi Jin, Lin Liu, et al., Specifying and Composing Web Services with an Environment Ontology-based Approach, International Journal of Web Services Research, 7(3):73-92, 2010. Puwei Wang, Zhi Jin, Hongyan Liu, Capability Description and Discovery of Internetware Entity, Science China: Information Sciences, 53(4): 685-703, 2010. Puwei Wang, Zhi Jin, Lin Liu, et al., Building Towards Capability Specification of Web Services Based on an Environment Ontology, IEEE Transactions on Knowledge and Data Engineering, 20(4):547-561, 2008. Puwei Wang, Zhi Jin and Lin Liu, On Constructing Environment Ontology for Semantic Web Services, In: International Conference on Knowledge Science, Engineering and Management (KSEM 2006), LNAI 4092, pp.490-503, 2006, Guilin, China. Puwei Wang, Zhi Jin, Lin Liu, An Approach for Specifying Capability of Web Services based on Environment Ontology, In: International Conference on Web Services (ICWS 2006), pp.365-372, 2006, Chicago, USA. Puwei Wang, Zhi Jin and Lin Liu, Environment Ontology-based Capability Specification for Web Service Discovery, In: International Conference on Formal Engineering Method (ICFEM 2006), LNCS 4260, pp.185-205, 2006, Macao, China. Puwei Wang, Zhi Jin, Web Service Composition: An Approach Using Effect-based Reasoning, In: International Workshop on Engineering Service-Oriented Applications: Design and Composition (WESOA 2006), LNCS 4652, pp.62-73, Chicago, USA. Ronghua Ye, Zhi Jin, Puwei Wang, et al., Approach for Autonomous Web Service Aggregation Driven by Requirement, Journal of Software, 21(6):1181-1195, 2010. Wei-Tek Tsai, Zhi Jin, Puwei Wang, et al., Requirement Engineering in Service-Oriented System Engineering. In: IEEE International Conference on e-Business Engineering (ICEBE 2007), pp.661-668, 2007, Hong Kong, China. Anjian Ren, Xiaoyong Du, Puwei Wang, Ontology-Based Categorization of Web Search Results Using YAGO, In: International joint Conference on Computational Sciences and Optimization (CSO 2009), pp.800-804, 2009, Sanya, China. Courses Database Technology and Application, Undergraduate Common Course Introduction to the Theory of Computation, Lecture Notes Projects \"Environment Knowledge-based Active Web Service Composition\", National Natural Science Foundation of China (Grant No. 61003084) \"Personalized Management of Domain Ontology\", Foundation for Open Projects of Key Laboratory of Data Engineering and Knowlege Engineering of Ministry of Education (Remin Univeristy of China) (Grant No. KF2009004). \"Environment Ontology-based Dynamic Web Services Composition\", Scientific Research Fund of Renmin University of China (Grant No. 22382075) Copyright Â© 2010, Ruc, IIR Lab, All rights Reserved.",
  "content_length": 3635,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:25"
}