{
  "name": "Qanita Bani Baker",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=qmbanibaker",
  "status": "success",
  "content": "Qanita Mohamad Bani baker × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content qanita mohamad bani baker • Department of Computer Science - Faculty Member • Department of Software Engineering - Faculty Member --- --- Department of Computer Science qmbanibaker@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from The University of Utah, 2015 Book Baker, Qanita Bani, Computational modeling to study disease development: Applications to breast cancer and an in vitro model of macular degeneration, Utah State University, 2015 Publications Baker, Qanita Bani and Shatnawi, Farah and Rawashdeh, Saif and Al-Smadi, Mohammad and Jararweh, Yaser, \"Detecting Epidemic Diseases Using Sentiment Analysis of Arabic Tweets.,\" J. Univers. Comput. Sci., vol. 26, no. , pp. 50-70, 2020 Al-Smadi, Mohammed and Hammad, Mahmoud and Baker, Qanita Bani and Tawalbeh, Saja Khaled and Al-Zboon, Sa?ad A, \"Transfer deep learning approach for detecting coronavirus disease in X-ray images.,\" International Journal of Electrical \\& Computer Engineering (2088-8708), vol. 11, no. , pp. 0-0, 2021 Ibrahim, Anwar and Al-Rababah, Amneh Ibrahim and Baker, Qanita Bani, \"Integrating virtual reality technology into architecture education: the case of architectural history courses,\" Open House International, vol. , no. , pp. 0-0, 2021, Emerald Publishing Limited Hammad, Mahmoud and Al-Smadi, Mohammed and Baker, Qanita Bani and Al-Zboon, Sa'ad A, \"Using deep learning models for learning semantic text similarity of Arabic questions.,\" International Journal of Electrical \\& Computer Engineering (2088-8708), vol. 11, no. , pp. 0-0, 2021 Al-Smadi, Mohammed and Hammad, Mahmoud and Baker, Qanita Bani and Al-Zboon, Sa'ad A, \"A transfer learning with deep neural network approach for diabetic retinopathy classification.,\" International Journal of Electrical \\& Computer Engineering (2088-8708), vol. 11, no. , pp. 0-0, 2021 Bani Baker, Qanita and Alsmirat, Mohammad A and Balhaf, Khaled and Shehab, Mohammed A, \"Accelerating white blood cells image segmentation using gpus,\" Concurrency and Computation: Practice and Experience, vol. 33, no. , pp. 0-0, 2021, Wiley Online Library Alasal, Sanaa Abu and Alsmirat, Mohammad and Al-Mnayyis, Asma' and Al-Ayyoub, Mahmoud and others, \"Improving radiologists' and orthopedists' QoE in diagnosing lumbar disk herniation using 3D modeling.,\" International Journal of Electrical \\& Computer Engineering (2088-8708), vol. 11, no. , pp. 0-0, 2021 Baker, Qanita Bani and Hammad, Mahmoud and Al-Rashdan, Wesam and Jararweh, Yaser and Mohammad, AL-Smadi and Al-Zinati, Mohammad, \"Comprehensive comparison of cloud-based ngs data analysis and alignment tools,\" Informatics in Medicine Unlocked, vol. 18, no. , pp. 0-0, 2020, Elsevier Hammad, Mahmoud M and Al-Smadi, Mohammad and Baker, Qanita Bani and Al-Asa'd, Muntaha and Al-Khdour, Nour and Younes, Mutaz Bni and Khwaileh, Enas, \"Question to Question Similarity Analysis Using Morphological, Syntactic, Semantic, and Lexical Features.,\" J. Univers. Comput. Sci., vol. 26, no. , pp. 671-697, 2020 Baker, Qanita Bani and Podgorski, Gregory J and Vargis, Elizabeth and Flann, Nicholas S, \"A computational study of VEGF production by patterned retinal epithelial cell colonies as a model for neovascular macular degeneration,\" Journal of biological engineering, vol. 11, no. , pp. 1-8, 2017, BioMed Central Baker, Qanita Bani and Samarneh, Alaa, \"Feature selection for IoT botnet detection using equilibrium and Battle Royale Optimization,\" Computers \\& Security, vol. 147, no. , pp. 0-0, 2024, Elsevier Bani Baker, Qanita and Hammad, Mahmoud and Al-Smadi, Mohammed and Al-Jarrah, Heba and Al-Hamouri, Rahaf and Al-Zboon, Sa?ad A, \"Enhanced COVID-19 Detection from X-ray Images with Convolutional Neural Network and Transfer Learning,\" Journal of Imaging, vol. 10, no. , pp. 0-0, 2024, MDPI Bani Baker, Qanita and Al-Hussien, Ruba A and Al-Ayyoub, Mahmoud, \"Accelerating Multiple Sequence Alignments Using Parallel Computing,\" Computation, vol. 12, no. , pp. 0-0, 2024, MDPI Bani Baker, Qanita and Alqudah, Nour and Alsmadi, Tibra and Awawdeh, Rasha, \"Image-Based Arabic Sign Language Recognition System Using Transfer Deep Learning Models,\" Applied Computational Intelligence and Soft Computing, vol. 2023, no. , pp. 0-0, 2023, Wiley Online Library Hammad, Mahmoud and Baker, Qanita Bani and Al-Smadi, Mohammed and Alrashdan, Wesam, \"Towards enhancing the user experience of ChIP-Seq data analysis web tools.,\" International Journal of Electrical \\& Computer Engineering (2088-8708), vol. 12, no. , pp. 0-0, 2022 Baker, Qanita Bani and Shatnawi, Farah and Rawashdeh, Saif, \"Forecasting epidemic diseases with Arabic Twitter data and WHO reports using machine learning techniques,\" Bulletin of Electrical Engineering and Informatics, vol. 11, no. , pp. 739-749, 2022 Bani Baker, Qanita and Nuser, Maryam S, \"Design Bioinformatics Curriculum Guidelines: Perspectives,\" Your Passport to a Career in Bioinformatics, vol. , no. , pp. 91-102, 2021, Springer Baker, Qanita Bani and Faraj, Dalya and Alguzo, Alanoud, \"Forecasting Dengue Fever Using Machine Learning Regression Techniques,\" , 2021, pp. 157-163, IEEE Baker, Qanita Bani and Gharaibeh, Maram and Al-Harahsheh, Yara, \"Predicting Lung Cancer Survival Time Using Deep Learning Techniques,\" , 2021, pp. 177-181, IEEE Baker, Qanita Bani and Al-Rashdan, Wesam and Jararweh, Yaser, \"Cloud-based tools for next-generation sequencing data analysis,\" , 2018, pp. 99-105, IEEE Baker, Qanita Bani and Balhaf, Khaled, \"Exploiting GPUs to accelerate white blood cells segmentation in microscopic blood images,\" , 2017, pp. 136-140, IEEE Baker, Qanita Bani and Banat, Sajda and Eaydat, Eman and Alsmirat, Mohammad and others, \"Automated detection of benign and malignant in breast histopathology images,\" , 2018, pp. 1-5, IEEE Yassein, Muneer O Bani and Hmeidi, Ismail and Shehadeh, Haneen and Yaseen, Waed Bani and Esra'a Masa'deh and Mardini, Wail and Khamayseh, Yaser M and Baker, Qanita Bani, \"Performance Evaluation of\" Dynamic Double Trickle Timer Algorithm\" in RPL for Internet of Things (IoT).,\" , 2019, pp. 430-437 Baker, Qanita Bani and Gharaibeh, Maram and Al-Harahsheh, Yara, \"Predicting Lung Cancer Survival Time Using Deep Learning Techniques,\" , 2021, pp. 177-181, IEEE Baker, Qanita Bani and Swedat, Safa and Aleesa, Kefah, \"Automatic Disease Diagnosis System Using Deep Q-Network Reinforcement Learning,\" , 2023, pp. 1-6, IEEE Bani Baker, Qanita and Alajlouni, Moayyad F, \"Comparative Analysis of Feature Selection Techniques with Metaheuristic Grasshopper Optimization Algorithm,\" , 2023, pp. 159-169, Springer Ismail, Qusai and Massadeh, Mariam and Baker, Qanita Bani, \"Predicting COVID-19 Related Tweets Using Ensemble of Transformers Models,\" , 2022, pp. 1-7, IEEE Baker, Qanita Bani and Aqouleh, Ayah Abu and Altiti, Ola, \"Sentimental analysis for studying and analyzing the spreading of covid-19 from twitter data,\" , 2021, pp. 1-8, IEEE Alasal, Sanaa Abu and Alsmirat, Mohammad and Baker, Qanita Bani and Jararweh, Yaser, \"Improving passive 3D model reconstruction using image enhancement,\" , 2018, pp. 1-7, IEEE Yassein, Muneer O Bani and Hmeidi, Ismail and Shehadeh, Haneen and Yaseen, Waed Bani and Esra'a Masa'deh and Mardini, Wail and Khamayseh, Yaser M and Baker, Qanita Bani, \"Performance Evaluation of\" Dynamic Double Trickle Timer Algorithm\" in RPL for Internet of Things (IoT).,\" , 2019, pp. 430-437 Baker, Qanita Bani and others, \"Evaluation of histopathological images segmentation techniques for breast cancer detection,\" , 2021, pp. 134-139, IEEE Al-Hussien, Ruba A and Baker, Qanita Bani and Al-Ayyoub, Mahmoud, \"Fast exact sequence alignment using parallel computing,\" , 2018, pp. 187-191, IEEE Baker, Qanita Bani and Podgorski, Gregory J and Johnson, Christopher D and Vargis, Elizabeth and Flann, Nicholas S, \"Bridging the multiscale gap: Identifying cellular parameters from multicellular data,\" , 2015, pp. 1-7, IEEE Baker, Qanita Bani and Al-Bataineh, Manar K, \"Genetic algorithm for optimizing global alignment of protein-protein interaction network,\" , 2019, pp. 1-6, IEEE Baker, Qanita Bani and Khwaileh, Enas and Alharbi, Marwa and Jararweh, Yaser, \"Lung Cancer Survival Time Prediction Using Machine Learning and Deep Learning Techniques,\" , 2023, pp. 35-42, IEEE Singh, Sakshi and Baker, Qanita Bani and Singh, Dev Bukhsh, Molecular docking and molecular dynamics simulation, Bioinformatics, Elsevier, 2022 Bani Baker, Qanita and Nuser, Maryam S, Design Bioinformatics Curriculum Guidelines: Perspectives, Your Passport to a Career in Bioinformatics, Springer, 2021 \"Activation fingerprints and allosteric modulation at the free fatty acid receptor 1 (FFAR1) revealed by molecular dynamics simulation\", Archives of Biochemistry and Biophysics Rufaida Mahmoud Abdel Aziz Al Zoubi, Samah Hussein Abdel Latif Sokkar, Israa Hani Asad Isawi, Qanita Mohamad Mousa Bani Baker 21/05/2025 \"Researching public health datasets in the era of deep learning: a systematic literature review\", Health Informatics Journal Izzat Alsmadi, Qanita Mohamad Mousa Bani Baker 11/01/2025 \"Enhanced COVID-19 Detection from X-ray Images with Convolutional Neural Network and Transfer Learning\", Journal of Imaging Qanita Mohamad Mousa Bani Baker, Mahmoud Mohammed Khair Faiq Hammad 13/10/2024 \"Enhanced COVID-19 Detection from X-ray Images with Convolutional Neural Network and Transfer Learning\", Journal of Imaging Qanita Mohamad Mousa Bani Baker, Mahmoud Mohammed Khair Faiq Hammad, Mohammed Al-Smadi, Hebah Ata Rasheed Al Jarrah, Rahaf Mohammad Mahmoud Al Hammouri, Saad Ali Sulaiman Al-Zboon 13/10/2024 \"Feature selection for IoT botnet detection using equilibrium and Battle Royale Optimization\", Computers & Security Qanita Mohamad Mousa Bani Baker, Ala' Abdelhakeem Moh'D Alsamarneh 30/08/2024 \"Accelerating Multiple Sequence Alignments Using Parallel Computing\"",
  "content_length": 13692,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:31"
}