{
  "name": "Qi Alfred Chen",
  "homepage": "https://www.ics.uci.edu/~alfchen",
  "status": "success",
  "content": "Alfred Chen's Homepage Alfred Chen Assistant Professor Department of Computer Science, University of California, Irvine Office: ICS1 420 (inside ICS1 418), Inner Ring Rd Email: alfchen at uci dot edu CV  Google Scholar (cite: 6000+, h-index: 40, i10-index: 81) I am incredibly grateful to be surrounded by so many talented students, encouraging colleagues, and world-class collaborators --- every day of mine is a true joy because of you! The Second ISOC Symposium on Vehicle Security & Privacy (VehicleSec'24) happened with NDSS at San Diego on Feb 26, 2024!/a> Follow @vehiclesec_conf Tweet to @vehiclesec_conf [Final Program] [Awards] [Accepted Papers, Demos/Posters, Lightning Talks] [CFP] Check out the above for 2 keynotes (academia+industry), 31 papers + 20 demos/posters on latest research on vehicle security & privacy, 5 lightning talks, 5 types of awards, community reception, 5 industry exibition tables, on-site souvenirs, and more! Research positions available for self-motivated students interested in computer security, especially AI/systems/network security in exciting emerging CPS/IoT systems such as autonomous cars/drones/robots (link1, link2), intelligent transportation (link1, link2), and smart home (link1, link2). » [New] PhD applicants: Fall-2026 PhD Positions at CS@UC Irvine (AI/System/Network Security Focus) « BS/MS students: Please fill out this form if looking for research experience in my group. Come here for latest security research in Autonomous Vehicle (AV) & intelligent transportation technologies? Collection of our latest efforts is at our AV & IoAT Security Website and YouTube channel » (2024) [CVPR'24] First study of the natural adversarial AI attack capabilities of GenAI: You can generate effective black-box adversarial AI attacks on commercial AV (e.g., a Tesla) with a single prompt! « » (2024) [NDSS'24] First large-scale meansurement study of LiDAR-spoofing attack capabilities, on 9 commercial LiDARs! « » (2024) [NDSS'24] Infrared Laser Reflection (ILR) Attack: First human-invisible attack on traffic sign recognition « » (2024) [Conference] Second ISOC Symposium on Vehicle Security & Privacy (VehicleSec 2024) Follow @vehiclesec_conf « » (2023) [ICCV'23] SysAdv: First system-level attack effect measurement of existing physical-world adversarial AI attacks (and how to make them really matter to autonomous driving) « » (2023) [Conference] Inaugural ISOC Symposium on Vehicle Security & Privacy (VehicleSec 2023) Follow @vehiclesec_conf « »  (2022) [NDSS'22] PlanFuzz: First automated method to discover security vulnerabilities specific to AD planning (semantic DoS) « »  (2022) [Workshop] AutoSec (Automotive & Autonomous Vehicle Security) @NDSS'22 (15 papers+15 demos)@autosec_conf « »  (2022) [Contest] 2nd AutoDriving CTF @ DEFCON (one of world's largest & most notable hacker conventions)Follow @autodrivingctf « »  (2021) [Usenix Sec'21] DRP attack: Seemingly-benign dirty road pattern can attack self-driving & cause lane departure in 1 sec « » (2021) [Contest] 1st AutoDriving CTF @ DEFCON (one of world's largest & most notable hacker conventions) « »  (2021) [IEEE S&P'21] MSF-ADV attack: Fundamentally challenge sensor fusion based AD perception in practical settings « » (2021) [Workshop] AutoSec (Automotive & Autonomous Vehicle Security) @NDSS'21 (17 papers+10 demos) « »  (2020) [Usenix Sec'20] FusionRipper: First security analysis of fusion based AD localization, discover strategic GPS spoofing to break fusion « »  (2020) [Usenix Sec'20] First general adversarial sensor attack & defense for LiDAR-based perception in autonomous driving « »  (2019) [ACM CCS'19] First security analysis & adversarial sensor attack design for LiDAR-based perception in autonomous driving « »  (2018) [NDSS'18] First security analysis & congestion attack design for CV/V2X-based intelligent traffic light control « I am teaching the undergraduate security course at Fall'25: CS134: Computer and Network Security! Note: The news below are NOT the latest for research works. For the lastest research updates, please check out our AV & IoAT Security Website! [News] (2023) [Award] Thrilled to learn that our CARMEN+ Tier 1 UTC proposal is awarded by USDOT! Excited to leverage this award to keep exploring and addressing cybersecurity challenges in autonomous driving and intelligent transportation systems. [News] (2023) Excited to be invited by the IEEE Intelligent Transportation Systems Society to serve on the IEEE Emerging Transportation Technology Testing (ET3) Technical Committee! Will leverage this opportunity to contribute to the emerging transportation technology testing methods development and standardization from the security/privacy angles. [News] (2023) [Award] Huge congratulations to my student Takami Sato for winning the Graduate Deanâs Dissertation Fellowship! This is one of UCI's most distinguished fellowships and only awarded to the top 1-2 students per school. Well deserved and very proud of you! [News] (2023) [Award] Huge congratulations to my student Takami Sato for winning the Public Impact Fellowship! This is a highly prestigious fellowship at UCI that is only awarded to top 15 students across all schools. Due to the emphasis on public/societal impacts, it is especially rare for CS student to win it. Very proud of you! [News] (2022) [Award] Thrilled to annouce that I just received the NSF CAREER award! Excited to leverage this award to keep exploring AI security in the emerging Internet of Autonomous Things (IoAT) such as autonomous cars, drones, and robots. [News] (2022) Excited to be invited by NIST to serve on the AI panel & focused group on standards & performance metrics development for on-road autonomous vehicles! I am the only invitee on AI security from academia and will leverage this opportunity to contribute to the standard and metric design discussions from the security/privacy angles. [News] (2021) [Award] Congratulations to Kanglan Tang, an undergraduate student in my group, for receiving the prestigous UCI Chancellorâs Award for Excellence in Undergraduate Research! This award is given to only 1 student per school. Kanglan is extremely excellent with a 1st-author paper published, presented herself, and accepted for demos at multiple academic venues, and also awarded multiple travel grants to top-tier security venues. Look forward to her continued success at UC Berkeley! [News] (2021) [Award] Our undergrad cyberseucrity team Cyber@UCI finished 5st place nation-wide at National CCDC, out of 168+ university/college teams in US! Absolutely a huge achievement for the first time at National. Can't wait for next year :)>> News coverage: UCI Finishes in Top 5 at National Collegiate Cyber Defense Competition>> News coverage by Irvine Standard (local news paper): UCI's cybersecurity club makes history [News] (2021) [Award] Our undergrad cyberseucrity team Cyber@UCI won the 1st place (Gold Medal) at CCDC Western Regional, and advanced to National CCDC for the first time! We beat many strong rivals such as Stanford, UCSD, ASU, and UCR. Super proud of the team!>> News coverage: UCI advances to national cyber defense competition following âhistoricâ regionals win [News] More... Introduction I am an Assistant Professor in the Department of Computer Science (CS) at the University of California, Irvine. I am also affiliated with the Department of Electrical Engineering and Computer Science (EECS), the Institute of Transportation Studies at UC Irvine (ITS-Irvine), the Center for Embedded and Cyber-physical Systems (CECS), the Institute for Software Research (ISR), and the UC Irvine Cybersecurity Policy & Research Institute (CPRI). Before coming to UCI, I received my Ph.D. degree from Computer Science and Engineering at the University of Michigan, Ann Arbor in 2018. My research interest broadly lies in the security and privacy of computer technologies that are of high criticality to our daily life and society. So far, my focus has been mainly on the security/privacy issues in emerging AI/systems/network technologies, especially the latest ones with high societal impacts such as those powering the emerging AI-enabled autonomous vehicles and intelligent transportation systems. The major theme of my research is to proactively address security challenges through systematic problem analysis and design, leveraging techniques such as optimization, static/dynamic program analysis, formal methods, defense principles, and data-driven methods. My research has developed such approaches to systematically discover, analyze, detect, and fix security vulnerabilities in a wide range of important computer systems and components such as the AI/software stack in emering autonomous cars/drones/robots, intelligent traffic light, smartphone systems, critical network protocols (e.g., TCP), DNS, GUI systems, access control systems, etc. Current Students: Fayzah Alshammari (Ph.D.), Shaoyuan Xie (Ph.D.), Sam Der (B.S.), Chi Zhang (B.S.). Alumni (in part): Junjie Shen (Ph.D., first job at Meta), Takami Sato (Ph.D., Kaggle Grandmaster, first job at Uber), Ningfei Wang (Ph.D., first job at Meta), Ziwen Wan (Ph.D., first job at Uber), Kanglan Tang (B.S., now at UC Berkeley), Christopher Joseph Dipalma (B.S., now at Intel), Newman Cheng (B.S., now at Columbia), Kyle Bartz (B.S., now at Amazon), Zeyuan Chen (B.S., now at CMU), Nanze Chen (B.S., now at U of Cambridge), Han Wang (B.S., now at UPenn), Chen Wang (B.S., now at UC Berkeley). Jalen Chuang (B.S., now at Georgia Tech), Wentao Chen (B.S., now at UCLA). Selected Publications (Full list) [NDSS'25] Revisiting Physical-World Adversarial Attack on Traffic Sign Recognition: A Commercial Systems Perspective Ningfei Wang, Shaoyuan Xie, Takami Sato, Yunpeng Luo, Kaidi Xu, and Qi Alfred Chen ISOC Network and Distributed System Security Symposium (NDSS) 2025. (acceptance rate TBA) [PDF] [Project website] [NDSS'25] On the Realism of LiDAR Spoofing Attacks against Autonomous Driving Vehicle at H",
  "content_length": 19872,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:29"
}