{
  "name": "Qi Cao 0002",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/qicao",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Qi Cao Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Qi CaoMr Ethan KellyZhen Tian Dr Qi Cao Associate Professor (Singapore: Computing Science) Associate Professor (School of Computing Science) email: Qi.Cao@glasgow.ac.uk Import to contacts https://orcid.org/0000-0003-3243-5693 Biography Dr Qi Cao is an Associate Professor with the School of Computing Science, University of Glasgow. He obtained his PhD degree from Nanyang Technological University (NTU), Singapore in 2007. He obtained his Bachelor of Engineering degree from HuaZhong University of Science & Technology (HUST), Wuhan China in 2000. He has been with several organizations for many years research experiences, and as the first inventor of 2 granted US patents. Associate Professor, School of Computing Science, University of Glasgow, (2024 - Present). Assistant Professor, School of Computing Science, University of Glasgow, (2019 - 2024). Senior Manager, Government Technology Agency, (2018 - 2019). Assistant Director/Joint Program Manager, Nanyang Technological University (NTU), Singapore, (2013 - 2018). Senior Technical Professional, Halliburton, (2011 - 2013). Research Scientist, Agency for Science, Technology and Research (A*STAR), (2009 - 2011). Senior Engineer, ST Electronics, (2007 - 2009). Engineer, Seagate Technology, (2005 - 2007). Awards: (1). IEEE MultiMedia 2020 Best Paper Award Runner-Up. Our paper, \"PGAN: Part-Based Nondirect Coupling Embedded GAN for Person Reidentification,\" has been recognized as the runner-up for the 2020 Best Paper Award from IEEE MultiMedia by the IEEE Computer Society Publications Board. An announcement can be found online here: https://www.computer.org/publications/best-paper-awards-archive Welcome to cite our paper: Y. Zhang, Y. Jin, J. Chen, S. Kan, Y. Cen and Q. Cao, \"PGAN: Part-Based Nondirect Coupling Embedded GAN for Person Reidentification\", IEEE MultiMedia, vol. 27, no. 3, pp. 23-33, July-Sept. 2020. https://doi.org/10.1109/mmul.2020.2999445. (2). Best Application Paper Award, for our paper as follows: E. M. Y. Chan, C. K. Seow, E. S. W. Tan, M. Wang, P. C. Y. Yau, Qi Cao, “SketchBoard: Sketch-Guided Storyboard Generation for Game Characters in the Game Industry,” 22nd IEEE International Conference on Industrial Informatics, Beijing, China, 2024. (https://doi.org/10.1109/INDIN58382.2024.10774282). Source codes for our published papers: (1). Source codes for our paper titled \"Dynamic Portfolio Rebalancing through Reinforcement Learning\" published at Neural Computing and Application journal (IF 5.130): https://github.com/cao-q/Dynamic-portfolio-rebalancing-through-RL Welcome to cite our paper: Q. Y. E. Lim, Q. Cao, and C. Quek, \"Dynamic portfolio rebalancing through reinforcement learning,\" Neural Computing and Applications, vol. 34, no. 9, pp. 7125-7139, 2022. (https://doi.org/10.1007/s00521-021-06853-3). (2). Source codes for our paper titled \"Dynamic Portfolio Rebalancing with Lag-Optimised Trading Indicators using SeroFAM and Genetic Algorithms\" published at Expert Systems with Applications journal (IF 8.665): https://github.com/cao-q/Dynamic-portfolio-rebalancing-with-lag-optimised-trading-indicators Welcome to cite our paper: L. L. X. Yeo, Q. Cao, and C. Quek, \"Dynamic portfolio rebalancing with lag-optimised trading indicators using SeroFAM and genetic algorithms,\" Expert Systems with Applications, vol. 216, 2022. (https://doi.org/10.1016/j.eswa.2022.119440). (3). Source codes for our paper titled \"Object-based illumination transferring and rendering for applications of mixed reality\" published at the Visual Computer journal (IF 2.302): https://github.com/cao-q/Object-based-illumination-transferring-and-rendering-for-MR.git Welcome to cite our paper: D. Xu, Z. Li, and Q. Cao, \"Object-based illumination transferring and rendering for applications of mixed reality,\" The Visual Computer, vol. 38, no. 12, pp. 4251-4265, 2022. (https://doi.org/10.1007/s00371-021-02292-2). Research interests His research interests include Computational Intelligence for Financial Data Analytics, Technology Enhanced Learning with Virtual Reality (VR) and Augmented Reality (AR), Computing Science Education, and Software Engineering Education. Research groupsEducation & Practice Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2017 | 2013 | 2009 | 2007 | 2006 | 2005 | 2004Number of items: 91.2025 Gan, Chian Min, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410, Keoh, Sye Loong, Yao, Dezhong, Cen, Yigang, Cai, Yiyu, Jain, Nisha and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2025) ConfMan Web 3.0: Decentralized Academic Conference Management System with Rust and Web 3.0. In: 2025 IEEE 49th Annual Computers, Software, and Applications Conference (COMPSAC), Toronto, ON, Canada, 08-11 July 2025, pp. 1746-1751. ISBN 9798331574345 (doi: 10.1109/COMPSAC65507.2025.00237) Iskandar Bin Mohamed Hanafiah, Muhammad, Kiat Desmond Loy, Yong, Long Rayson Ng, Wen, Ning Ang, Yan, Wang, Yifei, Jian Xavier Ong, Yu, Yau, Peter ChunYu ORCID: https://orcid.org/0000-0001-8431-2770, Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693, Wong, Dennis and Cheong, Ngai (2025) Integration of SGD Elements in Surveyed Design of Portable Assessment Apps to Foster Inclusive and Equitable Learning and Teaching Quality Education. In: 6th International Conference on Modern Educational Technology (ICMET '24), Tokyo, Japan, 13-15 Dec 2024, pp. 40-47. ISBN 9798400712630 (doi: 10.1145/3729434.3729455) Ang, Eng Choon, Cai, Yiyu, Wang, Min and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2025) Educational metaverse for learning of CPU scheduling algorithms in operating systems. In: Cai, Y., Ramnarain, U. and Jieqiong Chen, J. (eds.) Virtual and Augmented Reality Technology-Enhanced Learning. Series: Gaming media and social effects. Springer: Singapore, pp. 211-229. ISBN 9789819623310 (doi: 10.1007/978-981-96-2332-7_8) Tan, Zhen Xuan, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410, Cai, Yiyu and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2025) Tree pruning simulation and tree growth modelling. In: Cai, Y., Ramnarain, U. and Jieqiong Chen, J. (eds.) Virtual and Augmented Reality Technology-Enhanced Learning. Series: Gaming media and social effects. Springer: Singapore, pp. 189-210. ISBN 9789819623310 (doi: 10.1007/978-981-96-2332-7_7) Cheng, Joy Yee Shing, Pang, Zi Jian Adrian, Lim, Elias Isaac Huai-En, Chan, Sean Weng Hin, Sim, Lionel Wei Xian, Koko, Moreno, Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 and Keoh, Sye Loong ORCID: https://orcid.org/0000-0003-3640-5010 (2025) Strategies and Implications of Peer Assessment in Software Engineering Education. In: IEEE Frontiers in Education Conference 2024 (FIE 2024), Washington, DC, USA, 13-16 October 2024, ISBN 9798350351507 (doi: 10.1109/FIE61694.2024.10892827) Mohamed Riduwan, Mohammad Rizqullah Hafizh bin, Beng, Jung Zen Mark, Oh, Jia Wei Darien, Ng, Jun Hong, Loh, Chloe Rayn, Ong, Shi Ya, Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 and Yau, Peter C.Y. ORCID: https://orcid.org/0000-0001-8431-2770 (2025) Exploring Peer Evaluation Methods in Group Projects of Software Engineering Education. In: IEEE Frontiers in Education Conference 2024 (FIE 2024), Washington DC, USA, 13-16 October 2024, ISBN 9798350351507 (doi: 10.1109/FIE61694.2024.10893587) Maguire, Joseph ORCID: https://orcid.org/0000-0002-3718-7679, English, Rosanne, Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 and Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410 (2025) Themes in the Declared Use of Generative Artificial Intelligence in Assessment. In: 9th Conference on Computing Education Practice (CEP 2025), Durham, UK, 07 Jan 2025, pp. 17-20. ISBN 9798400711725 (doi: 10.1145/3702212.3702217) Liow, Hui Jia Karin, Yau, Peter ChunYu ORCID: https://orcid.org/0000-0001-8431-2770, Tang, Lai Meng ORCID: https://orcid.org/0000-0001-6016-9797, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410 and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2025) Peer-Assessed (Evaluated) Automated Grading System. In: International Conference on Artificial Intelligence and Teacher Education (ICAITE '24), Beijing, 12-14 October 2025, pp. 91-96. (doi: 10.1145/3702386.3702404) Lua, Zhi Zhan, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410, Chan, Raymond Ching Bon, Cai, Yiyu and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2025) Automated Bitcoin trading dApp using price prediction from a deep learning model. Risks, 13(1), 17. (doi: 10.3390/risks13010017) Huang, Ke-Wei, Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 and Su, Ruidan (Eds.) (2025) Financial Technology: 5th International Conference, ICFT 2024, Singapore, September 23–25, 2024, Proceedings. Series: Communications in computer and information science. Springer: Singapore. ISBN 9789819638109 2024 Yi Chan, Elicia Min, Seow, Chee Kiat ORCID: https://orcid.org/0000-0002-6499-9410, Wee Tan, Esther Su, Wang, Min, Yau, Peter Chunyu ORCID: https://orcid.org/0000-0001-8431-2770 and Cao, Qi ORCID: https://orcid.org/0000-0003-3243-5693 (2024) SketchBoard: Sketch-Guided Storyboard Generation for Game Characters in the G",
  "content_length": 79022,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:28"
}