{
  "name": "Qi Han 0001",
  "homepage": "http://inside.mines.edu/~qhan",
  "status": "success",
  "content": "Qi Han | Colorado School of Mines Qi ([‘Chee]) Han ProfessorDepartment of Computer ScienceColorado School of Mines1610 Illinois St.Golden, CO 80401 Office: CTLM 255Phone: 303-273-3849Fax: 303-273-3602Email: qhan@mines.edu Short Bio I started the tenure-track assistant professor position here right after I got my Ph.D. in Computer Science from the University of California-Irvine in August 2005.  I am currently a tenured full professor.  Broadly speaking, I work on networked systems research. More specific research areas include networked robotic systems, cyber physical systems (CPS), Internet of Things (IoT), and mobile sensing. I design algorithms, develop techniques, and build systems to enable emerging pervasive and mobile computing applications, where mobile robots, stationary sensors, and humans collaborate to accomplish a certain mission. In addition, I apply my expertise into interdisciplinary research by using wireless sensor systems, mobile devices, and mobile robots for a variety of applications such as space missions, underground safety, smart and connected communities, adaptive irrigation, environmental monitoring, energy efficient homes, and oil refinery inspection. I’m an IEEE senior member, ACM senior member, and ACM Distinguished Lecturer. Research Opportunities Ph.D. students I’m regularly looking for motivated Ph.D. students with strong algorithms background and implementation skills to work on research areas of Internet of Things, cyber physical systems, mobile sensing, and networked robotic systems. Master’s students MS thesis topics and project topics are available. Please contact me for more information. Undergraduate students There are several ways to get involved in research: Mines Undergraduate ResearchFellowship, Independent Study, Research Honor’s Thesis. Research ↗ Teaching CSCI 598 (Autonomous Robotic Exploration System Design): Fall 2018, Spring 2019 CSCI 576 (Wireless Sensor Systems): Fall 2007, Spring 2010 CSCI 572 (Computer Networks II): Fall 2014, Fall 2016, Fall 2019, Fall 2021 CSCI 565 (Distributed Computing Systems): Fall 2013, Fall 2015, Fall 2020, Fall 2022 CSCI 560 online (Fundamentals of Computer Networks): Fall 2019, Fall 2021 CSCI 341 (Computer Organization): Fall 2006 – Spring 2010, Fall 2011, Fall 2012, Fall 2013-Spring 2018, Spring 2021, Spring 2022 CSCI 274 (Introduction to Linux): Fall 2012 MACS 598 (Middleware Support for Distributed Sensor Applications): Spring 2006 MACS 498/598 (Multimedia Systems and Applications): Fall 2006 MACS 471 (Computer Networks I): Fall 2005 MACS 462 (Senior Seminar): Spring 2006 Professional Activities General Co-chair SMARTCOMP 2020 Program Chair/Co-chair UIC 2018 PerCom 2017 SMARTCOMP 2016 PerCom 2016 PhD Forum MobiSPC 2014 SRDS2012 PhD Forum IQ2S 2010 MDS 2007 DSS 2007 PerSeNS 2007 Publicity Co-chair PerCom 2009 WoWMoM 2009 WoWMoM 2008 MASS 2007 PerSeNS 2007 MDC 2006 Workshop Co-Chair UIC 2015, PerCom 2023 Finance Chair SRDS 2015 Poster Chair Mobiquitous 2009 Demo Co-Chair PerCom 2010 Technical Program Committee Member 2022: PerCom, INFOCOM, ICCPS 2021: PerCom, INFOCOM 2020: PerCom, INFOCOM 2019: PerCom, INFOCOM, LCN 2018: PerCom, INFOCOM, LCN 2017: PerCom, INFOCOM, LCN 2016: PerCom, INFOCOM, LCN 2015: PerCom, MASS, LCN, SRDS, IQ2S 2014: PerCom, MASS, LCN, CCNC, BuildSys, MobiCASE, ICC, WiMAN, IWCMC 2013: PerCom, MASS, LCN 2012: PerCom, LCN, ICCCN, PerSeNS 2011: PerCom, LCN, Mobiquitous, CCNC, EuroPar, PerSeNS 2010: PerCom, ICDCS, Middleware, ICC, ICCCN, ComoRea, PerSeNS 2009: WoWMoM, PerCom, Middleware, PerSeNS, ICC, LCN, ICCCN, EUC, Mobiquitous, WWASN, LOCALGOS 2008: WoWMoM, PerCom, Middleware, MASS, SANET, VTC, WWASN, MiNEMA 2007: WoWMoM, PerSeNS, MASS, SANET, LCN, MidSens, WASA 2006: WoWMoM, Multimedia, MDC Journal Paper Reviewer ACM Computing Surveys ACM Transactions on Autonomous and Adaptive Systems Elsevier Pervasive and Mobile Computing Journal Elsevier Journal of Software System Elsevier Journal of Ad-hoc Networks Elsevier Journal of Parallel and Distributed Computing Elsevier Information Fusion IEEE Transactions on Parallel and Distributed Systems IEEE Transactions on Mobile Computing IEEE Transactions on Computers IEEE Transactions on Vehicular Technology IEEE Software International Journal of Communication Systems Elsevier Journal of Software Systems NSF Review Panelist 2009, 2012, 2014, 2016, 2020, 2021",
  "content_length": 4376,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:33"
}