{
  "name": "Qi Rose Yu",
  "homepage": "http://roseyu.com",
  "status": "success",
  "content": "Rose Yu Homepage Rose Yu is an associate professor at UC San Diego department of Computer Science and Engineering and Amazon Scholar. She is a primary faculty with the AI Group. Her research interests lie primarily in machine learning, especially for large-scale spatiotemporal data. She is particularly excited about AI for scientific discovery. She has won Presidential Early Career Award for Scientists and Engineers (PECASE), DARPA Young Faculty Award, ECASE Award, NSF CAREER Award, Hellman Fellowship, Faculty Awards from Sony, JP Morgan, Meta, Google, Amazon, and Adobe, several Best Paper Awards, Best Dissertation Award at USC. She was named as MIT Technology Review Innovators Under 35 in AI. For more details, see Curriculum Vitae. Contact Info E-mail: roseyu [at] ucsd [dot] edu Phone: (858) 246-4724 Office: CSE 4216 Address: 9500 Gilman Drive, Mail Code 0404, La Jolla, CA 92093 News Nov 2025: NeurIPS 2025: Elucidated Rolling Diffusion Models and Conformal Prediction! Nov 2025: Invited talk at NeurIPS 2025: UniReps 2025 and AI for Science. Sep 2025: Awarded 2025 Samsung AI Researcher of the Year! See UCSD news. Old News Aug 2025: Invited Talk at Agentic AI Summit Frontier Stage! May 2025: ICML 2025: Grounding LLMs, Local symmetry discovery and more! April 2025: Featured by Quanta Magazing! See interview article ! Mar 2025: Invited Talk at USC Symposium on the Future of computing ! Feb 2025: We are organizing Generative AI Summit ! Jan 2025: ICLR 2025: LLMs for Anomaly Detection and Climate Q&A! Jan 2025: Honored to receive the PECASE Award, see News! Dec 2024: Awarded the Google Academic Research Award, see News! Oct 2024: NeurIPS 2024:Spherical Dyffusion and Symmetry-Informed Equation Discovery! Sep 2024: Honored to be named as 2024 MIT Technology Review Innovators Under 35 ! news. Aug 2024: Serving as the program chair of ICLR 2025! July 2024: Spherical Dyffusion won the Best Paper Award! See news. June 2024: Honored to receive DARPA Young Faculty Award! May 2024: ICML 2024: Causal Discovery, Symmetry Discovery and Neural Processes ! April 2024: Invited Talk on Automatic Symmetry Discovery from Data! Feb 2024: Awarded DARPA Scientific Foundation Models project, see our Postdoc Opening! Feb 2024: AISTATS 2024: Learning Granger Causality and High Order Graph Transformers! Jan 2024: ICLR 2024: Copula conformal forecasting and Parameter space symmetry! Dec 2023: Honored to receive NeurIPS Outstanding Datasets and Benchmarks Paper Award! Nov 2023: Awarded by CDC Insight Net to advance National Outbreak Analytics & Disease Modeling! Oct 2023: Excited to advance AI/ML for Fusion Research, see our Postdoc Opening! Sep 2023: NeurIPS 2023:Dynamics-Informed diffusion model and Spatiotemporal Point Processes! Sep 2023: Honored to receive Army Early Career Award, see UCSD News! Aug 2023: KDD 2023: deep Bayesian active learning, Keynotes on UQ and DS for Social Good! May 2023: Featured by UCSD Today on AI for Climate Action! April 2023: ICML 2023: Symmetry Discovery, Graph Transformer and Bayesian Active Learning! Mar 2022: L4DC 2023: Neural Point Process and Probabilistic Symmetry! Mar 2023: We are organzing a Scientific Machine Learning Symposium! Jan 2022: ICLR 2023: Koopman Neural Forecaster and Gradien Flow Dynamics! Dec 2022: Invited talk at NeurIPS Tackling Climate Change with ML and Deep Learning and Differential Equations! Nov 2022: Apply to the Schmidt AI in Science Postdoctoral Fellowship! Sep 2022: NeurIPS 2022: Meta-Learning Dynamics and Symmetry Optimization! June 2022: Honored to receive the NSF CAREER award! June 2022: Invited talk at Flatiron Institute! May 2022: ICML 2022:Approximate Equivariant Networks and Molecular Generative Models! May 2022: Honored to be awarded Hellman Fellowship! Mar 2022: L4DC 2022 Neural Spatiotemporal Point Process! Jan 2022: Invited Talk at 2022 TRIPODS Winter School! Dec 2021: Keynote speaker at NeurIPS Machine Learning for Autonomous Driving workshop! Nov 2021: Invited talk at KITP Machine Learning for Climate! Oct 2021: NeurIPS 2021 Automatic Symmetry Discovery! Sep 2021: Award from DOE on Data Intensive Scientific Machine Learning, see project website! Aug 2021: Interview by This Week in Machine Learning & AI (podcast), see TWIML Site! Aug 2021: Give a tutorial at KDD on Physics-Guided AI for Spatiotemporal Data! July 2021: Selected as Outstanding Faculty Researcher by JPMorgan Faculty Research Awards Program! June 2021: Honored to receive Facebook Research Award! June 2021: Consider submit to our ICML 2021 Time Series workshop! May 2021: KDD 2021: Uncertainty Quantification in Deep Spatiotemporal Forecasting! April 2021: Featured speaker at NVIDIA GTC 2021! Mar 2021: L4DC 2021: Learning Dynamical Systems and Vehicle-to-Vehicle Communication Feb 2021: Honored to receive Amazon Machine Learning Research Award! Jan 2021: ICLR 2021: Equivariant Trajectory Prediction and Symmetry in Deep Dynamics Models ! Nov 2020: Best paper award at NeurIPS2020 ML for Public Health! Sep 2020: NeurIPS 2020: Learning Disentangled Video Representation and Deep Imitation Learning ! Sep 2020: UCSD-NEU team on CDC COVID-19 Forecasting, see UCSD News and KPBS News! Nov 2020: Give an invited talk at AAAI Symposium ! Oct 2020: New paper on: Dynamic Neural Relational Inference and Equivariant Continuous Convolution! Aug 2020: Consider submit to our NeurIPS2020 Machine Learning for Engineering workshop! June 2020: ICML 2020: Multiresolution Tensor Learning ! May 2020: KDD 2020: Physics-informed Deep Learning for Turbulent Flow Prediction ! Mar 2020: Honored to serve as an Area Chair at NeurIPS 2020 ! Mar 2020: Selected for Adobe Data Science Research Award ! Feb 2020: Honored to receive Google Faculty Research Award, see Khoury News ! Feb 2020: New papers on Incorporating symmetry into Dynamics and Multiresolution Tensor Learning! Jan 2020: Give an invited talk at Physics Informed Machine Learning ! Nov 2019: Honored to serve as an Area Chair at ICML 2020 ! Oct 2019: Oral presentation on Physics-Informed Deep Learning for Turbulence Flow at NeurIPS ML4PS ! Sep 2019: Give a plenary talk at European Research Network on System Identification ! Sep 2019: NeurIPS 2019: Understanding graph neural networks and Multiresolution Sequence Imputation ! Aug 2019: Give an invited talk at KDD 2019 tensor methods workshop ! Jan 2019: ICRA 2019: Neural Lander: Stable Drone Landing Control using Learned Dynamics! Nov 2018: Our paper on Neural-Lander was highlighted by ImportAI ! Mar 2019: Consider submit to our ICML 2019 Time Series workshop! Feb 2019: Co-organize KITP Conference: At the Crossroad of Physics and Machine Learning! Jan 2019: New paper on Multiresolution Sequence Imputation ! Oct 2018: New paper on Learning Tensor Latent Features ! Sep 2018: Give a keynote talk at NCAR Climate Informatics workshop ! August 2018: Give a talk at MIT Henry L. Pierce Laboratory Seminar Series ! July 2018: Give talks at Japan RIKEN Center for Advanced Intelligence Project (AIP)! May 2018: Won best dissertation award at USC Computer Science! April 2018: Co-organize KITP Conference: At the Crossroad of Physics and Machine Learning! Feb 2018: New paper on Multi-resolution Tensor Learning! Jan 2018: ICLR 2018 Diffusion Convolutional RNN! Dec 2017: AISTATS 2018 Tensor regression meets Gaussian Processes! Dec 2017: Won best poster award for Long-term Forecasting using Tensor-Train RNNs at NIPS TSW! Nov 2017: New paper on Diffusion Convolutional RNN selected for oral at NIPS TSW! Nov 2017: New paper on Long-term Forecasting using Tensor-Train RNNs! Oct 2017: Give talks at DOLCIT seminar ! August 2017: Starting post-doc at Caltech CMS ! July 2017: Give talks at Peking University, DiDi Chuxing, JiaoTong University and Zhejiang University ! June 2017: Co-organize time series workshop at ICML 2017, please submit! May 2017: New paper on Graph Convolutional Recurrent Neural Network for Spatiotemporal Forecasting! April 2017: SDM Best paper runner-up for Deep Learning for Traffic Forecasting! April 2017: Won ACM scholarship for Turing Award Celebration! March 2017: Giving a talk at Brown University! Feb 2017: Giving a talk at Georgia Tech! Dec 2016: Co-organizing NIPS workshop on Learning with Tensors: Why Now and How? (Tensor-Learn 2016)! Sep 2016: Invited Speaker at AI With The Best! August 2016: Visiting Prof. Christopher R‌é 's group at Stanford! May 2016: Papers accepted in ICML and KDD 2016! April 2016: Co-organizing Women in Machine Learning Workshop (WiML 2016) in Barcelona, Spain! Research Grounding Large Language Models with Physical Laws Multimodal LLM agents for accelerating scientific discovery Deep neural networks are the backbones of large language models (LLMs). However, there is no guarantee that the model’s predictions are scientifically valid or physically meaningful. We aim develop novel AI approaches that can effectively ground large language models (LLMs) with physical laws, making them trustworthy tools for scientists. Read More Adapting While Learning: Grounding LLMs for Scientific Problems with Intelligent Tool Usage Adaptation Bohan Lyu, Yadi Cao, Duncan Watson-Parris, Leon Bergen, Taylor Berg-Kirkpatrick, Rose Yu International Conference on Machine Learning (ICML), 2025 [Paper] [Code] ClimaQA: An Automated Evaluation Framework for Climate Foundation Models Veeramakali Vignesh Manivannan, Yasaman Jafari, Srikar Eranky, Spencer Ho, Rose Yu, Duncan Watson-Parris, Yian Ma, Leon Bergen, Taylor Berg-Kirkpatrick International Conference on Learning Representations (ICLR), 2025 [Paper] [Code] Scalable Deep Spatiotemporal Point Processes Learning dynamics and detecting anomalies in spatiotemporal events Accurate modeling of spatiotemporal events is critical for disaster response, logistic optimization and human mobility. We research efficient techniques to model spatiotemporal events by integrating deep learning with point processes, with the goal to improve forecasting and anomaly detection. Read More Automatic Integrat",
  "content_length": 30412,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:30"
}