{
  "name": "Qi Sun 0003",
  "homepage": "http://qisun.me",
  "status": "success",
  "content": "Qi Sun Home Lab Research Press Teaching Qi Sun Contact: qisun [AT] nyu [DOT] edu | qisun0 [AT] gmail [DOT] com www.immersivecomputinglab.org [Curriculum Vitae] | [Google Scholar] Qi Sun is an assistant professor at New York University. Before joining NYU, he was a research scientist at Adobe Research. He received his PhD at Stony Brook University. His research interests lie in VR/AR, perceptual computer graphics, computational display, and applied perception. He is a recipient of the IEEE Virtual Reality Best Dissertation Award. With colleagues, his research has been recognized as several best paper and honorable mention awards at ACM SIGGRAPH, IEEE ISMAR, IEEE VR, IEEE VIS, and ACM SAP. Awarded Papers Best Paper Award, GazeFusion: Saliency-guided Image Generation, ACM Symposium on Applied Perception (SAP) 2024 Best Paper Honorable Mention Award, PEA-PODs: Perceptual Evaluation of Algorithms for Power Optimization in XR Displays, ACM SIGGRAPH 2024 Best Paper Honorable Mention Award, Modeling the Impact of Head-Body Rotations on Audio-Visual Spatial Perception for Virtual Reality Applications, IEEE VR 2024 Best Paper Honorable Mention, ARGUS: Visualization of AI-assisted Task Guidance in AR, VIS 2023 Best Paper Award, FoV-NeRF: Foveated Neural Radiance Fields for Virtual Reality, IEEE ISMAR 2022 Best Paper Honorable Mention Award, Joint Neural Phase Retrieval and Compression for Energy- and Computation-efficient Holography on the Edge, ACM SIGGRAPH 2022 Best Paper Award, Image Features Influence Reaction Time: A Learned Probabilistic Perceptual Model for Saccade Latency, ACM SIGGRAPH 2022 Prospective students. I always actively recruit research interns, PhD students, and postdoctoral researchers. We are particularly interested in candidates with backgrounds in neural rendering, generative models. Please visit my group website for our research: www.immersivecomputinglab.org Postdoctoral/visiting applicants: contact me with your resume. PhD applicants: you are always welcome to apply to the NYU CS program and list me as a potential advisor: I will be able to see your package. Generally, we prefer a pre-application research collaboration.",
  "content_length": 2172,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:30"
}