{
  "name": "Qi Tang 0001",
  "homepage": "https://tangqi.github.io",
  "status": "success",
  "content": "Qi Tang Toggle navigation Qi Tang News Team Research High-performance computing Scientific computing and simulation Scientific machine learning Publications CV Teaching Spring 2025 Fall 2025 Spring 2026 Qi Tang Assistant Professor School of Computational Science and Engineering Georgia Institute of Technology Guest Scientist Los Alamos National Laboratory Email: qtang@gatech.edu and qtang@lanl.gov Office: Coda at Tech Square, S1373B I am an Assistant Professor in CSE at Georgia Institute of Technology. Prior to joining Georgia Tech, I was a Scientist in the Applied Mathematics and Plasma Physics Group (T-5) within the Theoretical Division at Los Alamos National Laboratory (LANL). I am a computational scientist and applied mathematician by training, with a strong interest in physics. My research focuses on applying modern computational tools to advance physics applications, particularly in fusion energy and plasma physics. I rely on open-source libraries such as MFEM, PETSc, p4est, Overture, and hypre to develop scalable, high-performance simulation codes. I am also exploring scientific machine learning (SciML) to enhance traditional numerical methods. My group’s work has been supported by the DOE Office of Science (ASCR, FES, and their joint SciDAC program), NNSA, LANL and SNL LDRD programs, NSF, NASA, and Georgia Tech. I have several PhD student positions in Fall 2026. The Ph.D. projects can involve one or multiple areas from the research interests listed below. Some of the positions will be co-advised with Brown Unversity, Courant Institute, and Michigan State. If there is sufficient interest, students can undertake a summer internship at one of the DOE national labs. If you are interested in joining my group, please email me with your CV. Please note that Ph.D. students in the CSE program can have a home unit in a different school. Therefore, I am also interested in accepting students in mathematics, physics, and engineering. However, students must first be admitted by their respective home units. Therefore, if you are strongly interested in working with me, I encourage you to select CSE as your home unit. Research interests High-performance computing: high-order schemes, particle-in-cell, scalable iterative solvers, preconditioning, adaptive mesh refinement, GPU accelerations Scientific computing and simulations: multiscale and multiphysics problems, fusion whole device modeling, computational plasma physics AI/ML and data science: structure-preserving ML, dynamical system learning, scale bridging, ML-based surrogates, denoising, Bayesian inference Partnership [Update‼️] 📢 I am part of a new NNSA PSAAP VI FIC - Center for High Order Plasma Turbulence Modeling for Z-Pinch (HighZ) [Update‼️] 📢 I am part of a new NNSA PSAAP VI FIC - Center for Information Geometric Mechanics and Optimization (CIGMO) I am part of the DOE ASCR MMICC Center for Hierarchical and Robust Modeling of Non-Equilibrium Transport (CHaRMNET). I was the lead PI for a DOE ASCR SciML team involving LANL, ANL, IIT, John Hopkins, and Penn State. I was part of the DOE FES Tokamak Disruption Simulation SciDAC center (TDS).",
  "content_length": 3145,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:30"
}