{
  "name": "Qi Zhang 0041",
  "homepage": "https://zqyq.github.io",
  "status": "success",
  "content": "Qi ZHANG's Homepage Hi there, I'm ZHANG Qi (张琦)! August 2022-Now, Assistant Professor (tenure-track) with Visual Computing Research Center (led by Prof. Hui Huang), College of Computer Science and Software Engineering, Shenzhen University (VCC, CSSE, SZU). From May 2021-April 2022, I was a Post-doc researcher at VISAL, Department of Computer Science, City University of Hong Kong, supervised by Prof. Antoni Chan. I earned my Ph.D. degree from the same lab in 2021. My research interests include Crowd Analysis and Simulation, 3D Reconstruction and Generation, Autonomous Driving, and Large-scene Point Cloud Analysis. Read more about me. Selected Publications Qi Zhang, Kaiyi Zhang, Antoni B. Chan, and Hui Huang*. Mahalanobis Distance-based Multi-view Optimal Transport for Multi-view Crowd Localization. ECCV 2024. [Project & Code] Qi Zhang and Antoni B. Chan. 3D Crowd Counting via Geometric Attention-guided Multi-View Fusion. International Journal of Computer Vision (IJCV), 130:3123–3139, 2022.[Project Page] Qi Zhang and Antoni B. Chan. Wide-Area Crowd Counting: Multi-View Fusion Networks for Counting in Large Scenes. International Journal of Computer Vision (IJCV), 130:1938-1960, 2022.[Project Page]. Qi Zhang, Wei Lin, and Antoni B. Chan. Cross-View Cross-Scene Multi-View Crowd Counting. In: IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR):557-567, Jun 2021. [Project Page][Dataset]. Qi Zhang and Antoni B. Chan. Wide-Area Crowd Counting via Ground-Plane Density Maps and Multi-View Fusion CNNs. In: IEEE/CVF Conf. on Computer Vision and Pattern Recognition (CVPR), Long Beach, June 2019. [Project Page]. Professional Service CVPR (2020-), AAAI (2021-2026), ICCV (2021, 2023, 2025), ACM MM (2021, 2024, 2025), ECCV (2022, 2024), NeurIPS (2023，2025), EUROGRAPHICS (2024), ICLR (2024-2025), ICML (2024-2025), IJCAI (2024, 2025), SIGGRAPH (2025), ICPR (2020, 2022), ACCV (2020, 2022, 2024), WACV (2021-2026), ICME (2023), 3DV (2022), CVM (2023-2025), CGI (2023-2025), ACM MMAsia (2025) PC/Reviewer; CVM 2023 Image & Video Processing Session Chair. International Journal of Computer Vision (IJCV), IEEE Transactions on Image Processing (IEEE TIP), IEEE Transactions on Neural Networks and Learning Systems (IEEE TNNLS), IEEE Transactions on Multimedia (IEEE TMM), IEEE Transactions on Circuits and Systems for Video Technology (IEEE TCSVT), Information Fusion, Journal of Computer Science and Technology (JCST), IEEE Internet of Things Journal (IoT), Computer Animation & Virtual Worlds (CAVW), IEEE Transactions on Consumer Electronics (IEEE TCE), Scientific Reports, International Journal of Machine Learning and Cybernetics, IEEE Access, IET Computer Vision, IET Electronics Letters, Frontiers of Computer Science, Vicinagearth, Journal of Visual Communication and Image Representation (JVCI), Neurocomputing, Pattern Recognition Letters, Pattern Recognition, and Computer Vision and Image Understanding (CVIU) Reviewer.",
  "content_length": 2957,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:31"
}