{
  "name": "Qiang Zhu 0001",
  "homepage": "https://www-personal.umd.umich.edu/~qzhu",
  "status": "success",
  "content": "Dr. Qiang Zhu's Home Page Dr. Qiang Zhu Professor Department of Computer and Information Science University of Michigan - Dearborn Dearborn, MI 48128, USA Office: 209 CIS Office Phone: (313) 593-4998 Brief Biography Dr. Qiang Zhu is a Professor of the Department of Computer and Information Science at the University of Michigan - Dearborn. He served as Chair of the Department from 2017 to 2024. He was honored with the prestigious title of the William E. Stirton Professor at the University (2017). He was also honored as an ACM Distinguished Scientist (2013) and an IBM CAS Faculty Fellow (2003). He is the founding director of the Data Science/Management Research Laboratory. He is also an affiliated faculty member of the Michigan Institute for Data Science (MIDAS) at the University of Michigan. He joined the university in 1995 after he received his Ph.D. in computer science from the University of Waterloo (Canada). He also holds an M.Sc. from the McMaster University (Canada) and an M.Eng. and a B.Sc. from the Southeast University (China). Dr. Zhu has many years research experience in data science/management and related applications. He has led and carried out research projects in various areas, including query optimization for emerging databases, multidimenstional indexing, big data analytics, k-nearest neighbor search, spatio-temporal data processing, streaming data processing, self-managing databases, distributed databases, data security and privacy, data mining, bioinformatics, and vehicular data management and applications (telematics and infotainment). His research has been funded by highly competitive external and internal sources, including NSF, IBM, Ford, OVPR, Rackham, REEDF, and CEEP. He was a recipient of numerous distinguished awards/honors including 2025 Springer Nature Editor of Distinction Award, 2013 ACM Distinguished Scientist Award, 2004 IBM Faculty Award, 2003 IBM Faculty Award, 2001 UMD Distinguished Faculty Research Award, 1999 IBM University Partnership Research Award, and 1988 Scientific Progress Award of PRC Education Commission, as well as a number of best paper awards including 2008 Wilkes Award from The British Computer Society, recognizing excellence of his research. He has published over 130 research papers in various journals and conference proceedings including ACM Transactions on Database Systems (TODS), ACM Transactions on Information Systems (TOIS), IEEE Transactions on Knowledge and Data Engineering (TKDE), The VLDB Journal (VLDBJ), Information Systems (IS), Data & Knowledge Engineering (DKE), IEEE Transactions on Parallel and Distributed Systems (TPDS), IEEE Transactions on Computers (TC), IEEE Transactions on Intelligent Transportation Systems (TITS), IEEE/ACM Transactions on Networking (TON), and Proceedings of the VLDB Endowment (PVLDB). His research work has been cited by numerous research papers and included in several well-known research/text books. Dr. Zhu was invited to give research talks at many universities and industrial research centers/labs. He has served as an Editor-in-Chief, Associate Editor, and Editorial Board member for a number of international technical journals including Information Sciences (Elsevier), Journal of Big Data (Springer), and IEEE Transactions on Intelligent Transportation Systems (IEEE). He also served as a program/organizing committee member for over 250 international research conferences. He was a referee for numerous journals, conferences, and research grant proposals. Main Research Interests query optimization for emerging databases multidimensional indexing big data processing and analytics k-nearest neighbor search data/information integration self-managing database systems Web information systems spatio-temporal database streaming data processing data security and privacy data mining bioinformatics vehicular data analytics intelligent transportation systems Useful Links ACM SIGMOD home page Database research information page of ACM SIGMOD. VLDB home page Information page of the VLDB Endowment. Data Engineering Bulletins IEEE Computer Society, Bulletin of the Technical Committee on Data Engineering. DB World Archival store of DBWorld. Databases and Logic Programming resources Extensive and authoritative DB bibliography, with links to important DB conferences and journals. CiteSeerX Publication citation search. UM Library Search Search books and literature.",
  "content_length": 4411,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:39"
}