{
  "name": "Qian Yang",
  "homepage": "https://www.qianyanglab.com",
  "status": "success",
  "content": "Qian Yang | University of Connecticut Qian Yang Home Research Projects Publications Talks Teaching CSE 5095 Past Courses Misc Podcast Qian Yang Qian Yang Assistant Professor Computer Science and Engineering Department University of Connecticut, Storrs 371 Fairfield Way, Unit 4155 Storrs, CT 06269 Office: ITE 259 Tel:\t(860) 486-5472 Email:\tqyang _ at _ uconn dot edu Bio My research lies at the intersection of computational science and the physical sciences, with an emphasis on machine learning for materials, physics, and chemistry applications. I completed my Ph.D. from the Institute for Computational and Mathematical Engineering at Stanford University, and hold a B.A. in applied mathematics/computer science from Harvard College. Before joining UConn, I was a postdoctoral scholar in the Materials Computation and Theory group at Stanford University. News Feb 2019: Journal paper, Transferable Kinetic Monte Carlo Models with Thousands of Reactions Learned from Molecular Dynamics Simulations, accepted to The Journal of Physical Chemistry A. Nov 2018: Book chapter in Computational Approaches for Chemistry Under Extreme Conditions in production, webpage here. Aug 2018: Started position as Assistant Professor in the Computer Science & Engineering Department at the University of Connecticut, Storrs. Materials and Megabytes Podcast Check out our podcast exploring the development of machine learning for materials science, physics, and chemistry applications! Each episode features conversations with researchers at the forefront of this growing interdisciplinary field. In collaboration with the Stanford Materials Computation and Theory Group. Currently available on iTunes, via RSS feed and here. Visit each episode's webpage for links to papers and additional materials. Season 2 Episodes: Professor Gábor Csányi (University of Cambridge) Professor Anatole von Lilienfeld (University of Basel) Dr. Patrick Riley (Google Accelerated Science)",
  "content_length": 1956,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:35"
}