{
  "name": "Qian Zhang 0001",
  "homepage": "https://home.cse.ust.hk/~qianzh",
  "status": "success",
  "content": "Homepage of Qian Zhang - Qian Zhang Qian Zhang Tencent Professor of Engineering, Chair Professor of Department of CSE, HKUST, Fellow of IEEE, Fellow of the Hong Kong Academy of Engineering Sciences (HKAES), Changjiang Chair Professor, Huazhong University of Science and Technology (2012-2015), Director of HKUST MOE/MSRA Information Technology Key Laboratory, Director, Digital Life Research Center, HKUST, HKUST IAS Senior Fellow Follow Clear Water Bay,    Hong Kong,    Room 3544,    (via Lift 25-26),    Academic Building 852-23588766 Email Google Scholar Homepage of Qian Zhang Dr. Zhang joined Hong Kong University of Science and Technology in Sept. 2005 where she is now the acting head of Division of Integrative System and Design (ISD) as well as Tencent Professor of Engineering and Chair Professor of the Department of Computer Science and Engineering (CSE). She is also serving as the Director of HKUST MOE/MSRA Information Technology Key Laboratory and the Director of Digital Life Research Center of HKUST. Before that, she was in Microsoft Research Asia, Beijing, from July 1999, where she was the research manager of the Wireless and Networking Group. Dr. Zhang has published more than 400 refereed papers in international leading journals and key conferences. She is the inventor of more than 50 granted and 20 pending International patents. Her current research interests include Internet of Things (IoT), smart health, mobile computing and sensing, wireless networking, as well as cyber security. She is a Fellow of the IEEE and the Hong Kong Academy of Engineering (HKAE). Dr. Zhang received Hong Kong RGC (Research Grant Council) Senior Research Fellow Award in 2024. Dr. Zhang has received MIT TR100 (MIT Technology Review) worldâs top young innovator award. She also received the Best Asia Pacific (AP) Young Researcher Award elected by IEEE Communication Society in year 2004. She received the Best Paper Award in Multimedia Technical Committee (MMTC) of IEEE Communication Society in 2005 and Best Paper Award for QShine 2006, IEEE Globecom 2007, IEEE ICDCS 2008, IEEE ICC 2010, IEEE Globecom 2012, and IEEE ICC 2019. She received the Oversea Young Investigator Award from the National Natural Science Foundation of China (NSFC) in 2006. She held the Cheung Kong Chair Professor (é¿æ±è®²åº§ææ) in Huazhong University of Science and Technology (2012-2015). She has been elected as IEEE Communication Society Distinguished Lecture from Jan. 2010 to Dec. 2011. She also participated many activities in the IETF ROHC (Robust Header Compression) WG group for TCP/IP header compression. Dr. Zhang was served as Editor-in-Chief of IEEE Trans. on Mobile Computing (TMC) from Jan. 2020 to Dec. 2022. She is a member of Steering Committee of IEEE Infocom and IEEE Trans. on Games. She is the Editorial Board Member of ACM Transactions on Computing for Healthcare, IEEE Transactions in Cognitive Communications and Networking, IEEE Wireless Communications Magazine, Elsevier Computer Communications, and Elsevier Computer Networks. She was also served as the Associate Editor for IEEE Transactions on Wireless Communications, IEEE Transactions on Vehicular Technologies, IEEE Transactions on Mobile Computing, and IEEE Communications Surveys and Tutorials. She served as Guest Editor for quite some special issues. Dr. Zhang was a Members-at-Large (2016-2018) of IEEE Communications Society (ComSoc) and the Director of Technical Services (2016-2017) of IEEE ComSoc. She was the Chair of the Multimedia Communication Technical Committee of the IEEE Communications Society from 2008 to 2010. Dr. Zhang received the B.S., M.S., and Ph.D. degrees from Wuhan University, China, in 1994, 1996, and 1999, respectively, all in computer science. You can find more about qian's group link.",
  "content_length": 3801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:34"
}