{
  "name": "Qiang Li 0008",
  "homepage": "https://ccst.jlu.edu.cn/info/1367/19705.htm",
  "status": "success",
  "content": "ï»¿ æå¼º-åæå¤§å­¦è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢ åæå¤§å­¦ é¦é¡µ å­¦é¢æ¦åµ å­¦é¢ç®ä» é¢é¿å¯è¯­ ç°ä»»é¢å¯¼ åå²æ²¿é© æºæè®¾ç½® å­¦ç§å»ºè®¾ ä¸»è¦ç ç©¶æ¹å å­¦ä½å§åä¼ å­¦æ¯å§åä¼ æå­¦å§åä¼ å¸èµéä¼ åæåºå­¦è ææ å¯ææ è®²å¸ åèé¿èæå¸ é¼æ°å­¦è æç å®¤ è£ä¼æå¸ ç§å­¦ç ç©¶ å­¦æ¯å¨æ ç§ç éç¥ å½é äº¤æµ éç¹å®éªå®¤åç ç©¶ä¸­å¿ ç ç©¶æ èµæå®¤ èµæä¸è½½ äººæå¹å » ç ç©¶çæè² æ¬ç§çæè² æäººæè² å®éªä¸­å¿ å½å®¶çº§è®¡ç®æºå®éªæå­¦ç¤ºèä¸­å¿ å½å®¶çº§ç©èç½èæä»¿çå®éªæå­¦ä¸­å¿ å å»ºå·¥ä½ å æå å¾½ å çç« ç¨ ç»ç»ç»æ å·¥ä½æºæ ç®¡çè§ç« æå¸ææ¿ éç¥æ¥é ç»æå·¥ä½ ä¹¦è®°ä¿¡ç®± å¹¿çº³è±æ å ¬ç¤ºæ  å¸èµéä¼ åæåºå­¦è ææ å¯ææ è®²å¸ åèé¿èæå¸ é¼æ°å­¦è æç å®¤ è£ä¼æå¸ æ¨å½åä½ç½®ï¼ é¦é¡µ > å¸èµéä¼ > ææ > æ­£æ ææ æå¼º åºæ¬æ åµï¼ æå¼º ææ åå ¬çµè¯ï¼0431-85168187 Emailï¼li_qiang@jlu.edu.cn ç ç©¶æ¹åï¼éç§ä¿æ¤ï¼å®å ¨è®¡ç®ï¼äººå·¥æºè½å®å ¨ï¼ç½ç»æ»å»æ£æµ è®²æè¯¾ç¨ï¼Linuxç¼ç¨ï¼ç½ç»ç©ºé´å®å ¨å¯¼è®º æè²ç»åï¼ 1994/09ï¼1998/06ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ç³»è®¡ç®æºååºç¨ä¸ä¸,å­¦å£«å­¦ä½ 1998/09ï¼2001/06ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢è®¡ç®æºç³»ç»ç»æä¸ä¸ï¼ç¡å£«å­¦ä½ï¼å¯¼å¸ï¼é ä¹æ»¨ææï¼ 2001/09-2005/06ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢è®¡ç®æºè½¯ä»¶ä¸çè®ºä¸ä¸ï¼åå£«å­¦ä½ï¼å¯¼å¸ï¼é ä¹æ»¨ææï¼ å·¥ä½ç»åï¼ 2001/06-2004/12ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢ï¼å©æ 2004/12-2008/09ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢ï¼è®²å¸ 2008/09-2018/02ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢ï¼å¯ææ 2017/08-2018/02ï¼Muroran Institute of Technologyï¼æ¥æ¬å½ç«å®¤è­å·¥æ¥­å¤§å­¦ï¼è®¿é®å­¦è ï¼åä½å¯¼å¸ï¼è£åéï¼ 2017/11-ç°å¨ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢ï¼åå£«çå¯¼å¸ 2018/02-ç°å¨ï¼åæå¤§å­¦ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢ï¼ææ åè¡¨è®ºæï¼ Yuxin Yang; Qiang Li; Yuede Ji; Binghui Wang, A Secret Sharing-Inspired Robust Distributed Backdoor Attack to Federated Learning. ACM Transactions on Privacy and Security, 2025. Guohao Li; Lu Zhou; Jiale Lian; Siyi Liu; Li Yang; Yantao Zhong; Qiang Li, Efficient Sharing of Energy Consumption Data: A Privacy-Preserving Threshold Aggregation Approach. IEEE Internet of Things Journal, 2025. Lu Zhou, Ruoxu Yang, Lichuan Ma, Guoxing Chen, Haojin Zhu, Yang, Qingqi Pei, Qiang Li, The Feasibility of Location Anonymity: An Empirical Study towards a Real-world Location Privacy Protection System in Takeout Services, IEEE INFOCOM, 2025. Yuxin Yang, Qiang Li, Jinyuan Jia, Yuan Hong, Binghui Wang. Distributed Backdoor Attacks on Federated Graph Learning and Certified Defenses. ACM CCS 2024.(CCF-A) Yuxin Yang, Qiang Li, Yuan Hong, Binghui Wang. FedGMark: Certifiably Robust Watermarking for Federated Graph Learning. NeurIPS 2024.(CCF-A) Yuxin Yang, Qiang Li, Chenfei Nei, Yuan Hong, Binghui Wang. Breaking State-of-the-Art Poisoning Defenses to Federated Learning: An Optimization-Based Attack Framework. CIKM 2024. (CCF-B) Yu Li, Zhang Yi, Zimu Zhou, Qiang Li. DeCoCDR: Deployable Cloud-Device Collaboration for Cross-Domain Recommendation. SIGIR 2024.(CCF-A) Chenfei Nie, Zhipeng Zhou, Mianxiong Dong, Kaoru Ota, Qiang Li. EPIDL: Towards efficient and privacy-preserving inference in deep learning. Concurrency Computat Pract Exper. 2024.(CCF-C) Yu Li, Zhang Yi, He Chang, Qiang Li. Injecting Revenue-Awareness Into Cold-Start Recommendation: The Case of Online Insurance, ICPADS 2023.(CCF-C) Yu Li, Yi Zhang, Weijia Wu, Zimu Zhou, and Qiang Li. POSGen: Personalized Opening Sentence Generation for Online Insurance Sales, IEEE BigData 2022. Zhipeng Zhou, Qiang Fu, Qianjun Wei and Qiang Li, LEGO: A Hybrid Toolkit for Efficient 2PC-based Privacy-Preserving Machine Learning, Computers & Security, 2022. (CCF-B) Ming Li, Qiang Li, Guangzhe Xuan, Dong Guo, Identifying Compromised Hosts Under APT Using DNS Request Sequences, Journal of Parallel and Distributed Computing, 2021. (CCF-B) Longkang Shang, Dong Guo, Yuede Ji, Qiang Li, Discovering unknown advanced persistent threat using shared features mined by neural networks, Computer Networks, 2021. (CCF-B) Yu Li, Yi Zhang, Lu Gan, GengWei Hong, Zimu Zhou, Qiang Li, RevMan: Revenue-aware Multi-task Online Insurance Recommendation, AAAI, 2021. (CCF-A) Qianjun Wei, Qiang Li, Zhipeng Zhou, ZhengQiang Ge and Yonggang Zhang, Privacy-preserving two-parties logistic regression on vertically partitioned data using asynchronous gradient sharing, Peer-to-Peer Networking and Applications, 2021. (CCF-C) Chaoxian Wei, Qiang Li, Dong Guo, Xiangyu Meng, Toward Identifying APT Malware through API System Calls, Security and Communication Networks, vol. 2021. (CCF-C) Zhengqiang Ge, Xinyu Liu, Qiang Li, Yu Li, Dong Guo, PrivItem2Vec: A privacy-preserving algorithm for top-N recommendation, International Journal of Distributed Sensor Networks, 2021. Qi Wu, Qiang Li, Dong Guo, Xiangyu Meng, Exploring the vulnerability in the inference phase of advanced persistent threats, International Journal of Distributed Sensor Networks, 2022. Zongyuan Xiang, Dong Guo, Qiang Li, Detecting Mobile Advanced Persistent Threats Based on Large-scale DNS Logs. Computers & Security, Volume 96, 2020.(CCF-B) Guanghua Yan, Qiang Li, Dong Guo, Xiangyu Meng, Discovering Suspicious APT Behaviors by Analyzing DNS Activities. Sensors 20(3), 2020. Bo Feng, Qiang Li, Yuede Ji, Dong Guo and Xiangyu Meng, Stopping the Cyber Attack in the Early Stage Assessing the Security Risks of Social Network Users , Security and Communication Networks, 2019. (CCF-C) Guanghua Yan, Qiang Li, Dong Guo and Bing Li, AULD: Large Scale Suspicious DNS Activities Detection via Unsupervised Learning in Advanced Persistent Threats, Sensors, 19(14), 2019. Xinyang Jiang, Qiang Li, Zhen Ma, Mianxiong Dong, Jun Wu, Dong Guo. QuickSquad: A new single-machine graph computing framework for detecting fake accounts in large-scale social networks. Peer-to-Peer Networking and Applications, 12(5): 1385-1402, 2019. (CCF-C) Zhen Ma, Qiang Li, Xiangyu Meng. Discovering Suspicious APT Families through A Large-scale Domain Graph in Information-centric IoT, IEEE Access, vol. 7, pp. 13917-13926, 2019. Jianwen XU, Kaoru OTA, Mianxiong DONG, Anfeng LIU, Qiang LI. SIoTFog: Byzantine-resilient IoT fog networking. Frontiers of Information Technology & Electronic Engineering, 2018, 19(12), 1546-1557. S. Chang, C. Li, H. Zhu, T. Lu and Q. Li. Revealing Privacy Vulnerabilities of Anonymous Trajectories, IEEE Transactions on Vehicular Technology, vol. 67, no. 12, pp. 12061-12071, Dec. 2018. Bo Feng, Qiang Fu, Mianxiong Dong, Dong Guo and Qiang Li, Multistage and Elastic Spam Detection in Mobile Social Networks through Deep Learning. IEEE Network, July/August 2018. Jiahao Zhang, Qiang Li, Xiaoqi Wang, Bo Feng, Dong Guo. Towards fast and lightweight spam account detection in mobile social networks through fog computing, Peer-to-Peer Networking and Applications,11(4):778-792, 2018.(CCF-C) Qiang Fu, Bo Feng, Dong Guo, Qiang Li. Combating the Evolving Spammers in Online Social Networks. Computers & Security, 2018(72C)60-73.(CCF-B) Jian Cao, Qiang Fu, Qiang Li, Dong Guo. Discovering Hidden Suspicious Accounts in Online Social Networks. Information Sciences, 2017(394)123â140.(CCF-B) çæçª,æå¼º,é«å¹¿å,çå å²,é­ä¸.é«çº§æç»­æ§å¨èä¸­éè½å¯çDNSè¡ä¸ºçæ£æµ. è®¡ç®æºç ç©¶ä¸åå±, 2017(10). Bo Feng, Qiang Li, Xiaowen Pan, Jiahao Zhang, Dong Guo, GroupFound: An Effective Approach to Detect Suspicious Accounts in Online Social Networks, International Journal of Distributed Sensor Networks, 2017, 13(7). Yukun He, Qiang Li, Jian Cao, Yuede Ji, Dong Guo, Understanding socialbot behavior on end hosts, International Journal of Distributed Sensor Networks, 2017, 13(2). Yuede Ji, Yukun He, Xinyang Jiang, Jian Cao, Qiang Li: Combating the Evasion Mechanisms of Social Bots. Computers & Security. 2016(58)230-249. (CCF-B) Yukun He, Guangyan Zhang, Jie Wu, Qiang Li: Understanding a Prospective Approach to Designing Malicious Social Bots. Security and Communication Networks, 9(13): 2157-2172, 2016. (CCF-C) Jian Cao, Qiang Li, Yuede Ji, Yukun He, Dong Guo: Detection of Forwarding-Based Malicious URLs in Online Social Networks. International Journal of Parallel Programming 44(1): 163-180, 2016 (Best Paper Award of NPC 2014) Dong Guo, Jian Cao, Xiaoqi Wang, Qiang Fu, Qiang Li: Combating Code-Based Compromised Accounts in Mobile Social Networks. Sensors 2016, 16(9), 1522. æç¥¥æ¥ , å¼ å¹¿è³, æå¼º, éçº¬æ°. åºæçéµåæå»ºæ¹æ³ç ç©¶ç»¼è¿°. è®¡ç®æºç ç©¶ä¸åå±. 2016, 53 (9):1893-1905. Yuede Ji, Qiang Li, Yukun He, Dong Guo: BotCatch: leveraging signature and behavior for bot detection. Security and Communication Networks 8(6): 952-969, 2015 (CCF-C) Yuede Ji, Qiang Li, Yukun He, Dong Guo: Overhead Analysis and Evaluation of Approaches to Host-Based Bot Detection, International Journal of Distributed Sensor Networks Volume 2015, Article ID 524627, 1-17. Jian Cao, Qiang Fu, Qiang Li, Dong Guo: Leveraging Behavior Diversity to Detect Spammers in Online Social Networks. 15th International Conference on Algorithms and Architectures for Parallel Processing, 2015: 323-336. LNCS 9530, Springer. (CCF-C) Yuede Ji, Yukun He, Xinyang Jiang, Qiang Li: Towards social botnet behavior detecting in the end host. 20th IEEE International Conference on Parallel and Distributed Systems, ICPADS 2014: 320-327, Hsinchu, Taiwan, December 16-19, 2014. (CCF-C) Yuede Ji, Yukun He, Dewei Zhu, Qiang Li, Dong Guo: A Mulitiprocess Mechanism of Evading Behavior-Based Bot Detection Approaches. 10th International Conference on Information Security Practice and Experience, ISPEC 2014: 75-89, Fuzhou, China, May 5-8, 2014. LNCS 8434, Springer. ä½æ¯é,æå¼º,åµè·å",
  "content_length": 10965,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:35"
}