{
  "name": "Qian Lou",
  "homepage": "https://qlou.org",
  "status": "success",
  "content": "Qian Lou Qian Lou Director of Unbounded AI Lab at UCF and Assistant Professor Computer Science, Cyber Security and Privacy Cluster, University of Central Florida Email: qian.lou@ucf.edu, Office: HS2 234 Publications | Research Group | Teaching | Google Scholar | Patents Qian Lou is the director of the Unbounded AI Lab at the University of Central Florida, where he is a tenure-track assistant professor in the Department of Computer Science and a member of the Cybersecurity and Privacy Cluster. He brings both industry and academic experience, having earned his Ph.D. from Indiana University Bloomington and served as a senior research scientist at Samsung Research America. At UCF, he leads the Unbounded AI Lab with the mission of overcoming the bounds imposed by privacy, trust, and performance constraints on AI infrastructure and systems, enabling Confidential, Verifiable, and Efficient AI Computing at Scale. Developing effective approaches requires a confluence of disciplines: AI infrastructure, Secure computing, Efficient Intelligent Systems, etc: Secure AI Computing via Applied Cryptography and Trusted Hardware [NeurIPS'19, NeurIPS'20a, NeurIPS'20b, NeurIPS'20c, ICML'21, ICLR'21, US Patent, EMNLP'21, DAC'22, DAC'23, CCS'24 WAHC, CCS'24 LAMPS, S&P'25 (Oakland), NeurIPS'24 ] AI Infrastructure: Data, Models, Algorithms, and Hardware [ICCAD'18, DATE'19, ICLR'20, ASP-DAC'20, DATE'20, PACT'20 (Best Paper Nomination), IJCAI'21, ICLR'22a, CVPR'22, EMNLP'22, DATE'22, DAC'22, NANOARCH'22, ISQED'23 Invitation, PACT'24, MICRO'24 , US Patent, US Patent, US Patent ] Secure and Safe Large Language Models [CVPR'23, ICLR'23, NeurIPS'23, NAACL'24 , ECCV'24, ACL'24 , EMNLP'24a, EMNLP'24b, NeurIPS'24 ] News 09 / 2025 Our federated learning with encrypted aggregation (less than 2x overhead) is accepted by NeurIPS 2025, Congrats to Jiaqi. 08 / 2025 Our privacy-preserving data synthesis based on private computing is funded by NSF SaTC Crosscutting. 08 / 2025 Two papers are accepted by EMNLP 2026. Congratulations to Rochana and Mansour! 04 / 2025 Our LLM Application Security Testing (LAST) Framework is funded by DoD Pathfinder Program. 03 / 2025 Our system support for secure computing is funded by NSF CISE Core. 02 / 2025 One paper is accepted by DAC 2025. 01 / 2025 One paper is accepted by ICLR 2025. 10 / 2024 One paper is accepted by NeurIPS 2024. 09 / 2024 Two papers about Jailbreaking and Fairness Backdoor are accepted by EMNLP 2024. 09 / 2024 DataSeal is accepted by IEEE S&P 2025. 07 / 2024 One paper is accepted by MICRO 2024. 07 / 2024 WBP is accepted by ECCV 2024. 07 / 2024 SSL-Cleanse is accepted by ECCV 2024. 06 / 2024 BoostCom is accepted by PACT 2024. 05 / 2024 Congratulations to Jiaqi Xue and Yancheng Zhang, who started their internships at Samsung Research America. 05 / 2024 CR-UTP is accepted by ACL 2024. 03 / 2024 TrojFSP is accepted by NAACL 2024 (Oral in the main conference). 09 / 2023 TrojLLM is accepted by NeurIPS 2023. 02 / 2023 TrojViT is accepted by CVPR 2023. 02 / 2023 Primer is accepted by DAC 2023. 01 / 2023 TrojText is accepted by ICLR 2023. 10 / 2022 Weighted value decomposition on language model is accepted by EMNLP 2022. 03 / 2022 LITE-MDETR is accepted by CVPR 2022. 02 / 2022 MATCHA is accepted by DAC 2022. 01 / 2022 Language Model Compression is accepted by ICLR 2022. 01 / 2022 DictFormer is accepted by ICLR 2022. 08 / 2021 CryptoGRU is accepted by EMNLP 2021. 05 / 2021 HEMET is accepted by ICML 2021. 05 / 2021 Qian received a Luddy Outstanding Research Award. 09 / 2020 Three papers were accepted by NeurIPS 2020. Research Group Our research is driven by a talented, collaborative team. Ph.D. Students Mansour Al Ghanim (2021 Fall -) Jiaqi Xue (2023 Spring-) Rochana Prih Hastuti (2023 Fall-) Mayank Kumar (2024 Fall-) Hedong Zhang (2024 Fall-) Yifei Zhao (2024 Fall-) Prospective Students: We are recruiting two Ph.D. students and one postdoctoral researcher to join the Unbounded AI Lab at UCF. Interested applicants should email qian.lou@ucf.edu with the subject line:“2026 Prospective Member – Unbounded AI Lab at UCF”. Please include your CV and a summary of your research experience, interests, and notable accomplishments. We especially welcome applications from candidates in the United States and local regions. International applicants should also provide English proficiency scores (TOEFL/IELTS) and GRE results if required by UCF’s admission policies. For application details, please apply through the CS department and include my name as a possible advisor in your application. Have questions? Check out my answers to the PhD Advisor Guide. Recent Community Services NSF: Panelist ICLR 2026: Area Chair NeurIPS 2025: Area Chair CCS 2026: Program Committee NDSS 2026: Program Committee GLSVLSI 2025: Track Chair ISCA: Program Committee DAC: Technical Program Committee ISCA 2023: Local Area Chair Tiny and Fair ML Design Contest Organizer at ESWEEK 2023 IEEE Transactions on Information Forensics and Security: Reviewer AI for Content Creation (AI4CC) Workshop @ CVPR 2024: Area Chair AAAI: Senior Program Committee NeurIPS: Reviewer ICML: Reviewer ACL/NAACL: Reviewer ICLR: Reviewer CVPR: Reviewer ECCV: Reviewer Teaching 2022 Fall: CDA 5106 Advanced Computer Architecture 2023 Spring: CAP 6614 Current Topics in Machine Learning 2023 Fall: CDA 5106 Advanced Computer Architecture 2024 Spring: CAP 6614 Current Topics in Machine Learning 2025 Spring: CAP 6614 Current Topics in Machine Learning Publications Publications at UCF * indicates students and staff under my supervision [DAC 25] zkVC: Fast Zero-Knowledge Proof for Private and Verifiable Computing Yancheng Zhang*, Mengxin Zheng, Xun Chen, Jingtong Hu, Weidong Shi, Lei Ju, Yan Solihin, Qian Lou The Design Automation Conference (DAC), 2025 [Paper (PDF)] [Code] [ICLR 25] CipherPrune: Efficient and Scalable Private Transformer Inference Yancheng Zhang*, Jiaqi Xue*, Mengxin Zheng, Mimi Xie, Mingzhe Zhang, Lei Jiang, Qian Lou The Thirteenth International Conference on Learning Representations [Paper (PDF)] [Code] [S&P 25] DataSeal: Ensuring the Verifiability of Private Computation on Encrypted Data Muhammad Husni Santriaji*, Jiaqi Xue*, Yancheng Zhang*, Qian Lou, Yan Solihin 2025 IEEE Symposium on Security and Privacy (SP) [Paper (PDF)] [NeurIPS 24] HEPrune: Fast Private Training of Deep Neural Networks With Encrypted Data Pruning Yancheng Zhang*, Mengxin Zheng, Yuzhang Shang, Xun Chen, Qian Lou The Thirty-eighth Annual Conference on Neural Information Processing Systems [Paper (PDF)] [Code] [EMNLP 24] BadFair: Backdoored Fairness Attacks with Group-conditioned Triggers Jiaqi Xue*, Qian Lou, Mengxin Zheng Conference on Empirical Methods in Natural Language Processing (EMNLP),2024 [Paper (PDF)] [EMNLP 24] Jailbreaking LLMs with Arabic Transliteration and Arabizi Mansour Al Ghanim*, Saleh Almohaimeed, Mengxin Zheng, Yan Solihin, Qian Lou Conference on Empirical Methods in Natural Language Processing (EMNLP),2024 [Paper (PDF)] [Code] [MICRO 24] Trinity: A General Purpose FHE Accelerator Xianglong Deng, Shengyu Fan, Zhicheng Hu, Zhuoyu Tian, Zihao Yang, Jiangrui Yu, Dingyuan Cao, Dan Meng, Rui Hou, Meng Li, Qian Lou, Mingzhe Zhang IEEE/ACM International Symposium on Microarchitecture (MICRO), 2024 [Paper (PDF)] [CCS-WAHC 24] HEBridge: Connecting Arithmetic and Logic Operations in FV-style HE Schemes Yancheng Zhang*, Xun Chen, Qian Lou WAHC'24: Proceedings of the 12th Workshop on Encrypted Computing & Applied Homomorphic Cryptography [Paper (PDF)] [CCS-LAMPS 24] TrojFair: Trojan Fairness Attacks Jiaqi Xue*, Mengxin Zheng, Yi Sheng, Lei Yang, Qian Lou, Lei Jiang 1 st ACM Workshop on Large AI Systems and Models with Privacy and Safety Analysis (LAMPS), 2024 [Paper (PDF)] [CCS-LAMPS 24] CryptoTrain: Fast Secure Training on Encrypted Data Jiaqi Xue*, Yancheng Zhang*, Yanshan Wang, Xueqiang Wang, Hao Zheng, Qian Lou 1 st ACM Workshop on Large AI Systems and Models with Privacy and Safety Analysis (LAMPS), 2024 [Paper (PDF)] [ACL 24] CR-UTP: Certified Robustness against Universal Text Perturbations on Large Language Models Qian Lou, Xin Liang*, Jiaqi Xue*, Yancheng Zhang*, Rui Xie, Mengxin Zheng Findings of the Association for Computational Linguistics (ACL), 2024 [Paper (PDF)][Code] [ISLPED 24] OFHE: An Electro-Optical Accelerator for Discretized TFHE Mengxin Zheng, Cheng Chu, Qian Lou, Nathan Youngblood, Mo Li, Sajjad Moazeni, Lei Jiang Proceedings of the 29th ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED), 2024 [Paper (PDF)] [PACT 24] BoostCom: Towards Efficient Universal Fully Homomorphic Encryption by Boosting the Word-wise Comparisons Ardhi Wiratama Baskara Yudha*, Jiaqi Xue*, Qian Lou, Huiyang Zhou, Yan Solihin The International Conference on Parallel Architectures and Compilation Techniques (PACT), 2024 [Paper (PDF)] [ECCV 24] WBP: Training-time Backdoor Attacks through Weight Bit Poisoning. Kunbei Cai, Zhenkai Zhang, Qian Lou, Fan Yao The 18th European Conference on Computer Vision (ECCV), 2024 [Paper (PDF)] [Code] [ECCV 24] SSL-Cleanse: Trojan detection and mitigation in self-supervised learning. Mengxin Zheng, Jiaqi Xue, Zihao Wang, Xun Chen, Qian Lou, Lei Jiang, Xiaofeng Wang The 18th European Conference on Computer Vision (ECCV), 2024 [Paper (PDF)] [Code] [Mathematics 24] Unveiling Fall Triggers in Older Adults: A Machine Learning Graphical Model Analysis Tho Nguyen, Ladda Thiamwong, Qian Lou, Rui Xie Mathematics, 2024 [Paper (PDF)] [NAACL 24] TrojFSP: Trojan Insertion in Few-shot Prompt Tuning Mengxin Zheng, Jiaqi Xue*, Xun Chen, Yanshan Wang, Qian Lou, Lei Jiang Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL), 2024 [Paper (PDF)] [Code] [NeurIPS 23] Trojllm: A black-box trojan prompt attack on large language models Jiaqi Xue*, Mengxin Zheng, Ting Hua, Yilin Shen, Yepeng Liu*, Ladislau Bölöni, Qian Lou 37th Conference on Neural Information Processing Systems (NeurIPS",
  "content_length": 17568,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:35"
}