{
  "name": "Qian Zhang 0020",
  "homepage": "https://www.cs.ucr.edu/~qzhang",
  "status": "success",
  "content": "About Me I am a Tenure-Track Assistant Professor in Computer Science and Engineering at UC Riverside and a member of the RIPLE research group. Previously, I was a postdoctoral researcher at UCLA working with Prof. Miryung Kim, and I received my Ph.D. from CUHK advised by Prof. Johnny Xu. I build AI-native software systems that keep intelligent applications dependable and accessible. I have been selected as one of the eight MIT EECS rising stars in Systems (broadly defined) in 2021. I have received awards such as ACM SIGSOFT Research Highlights, Regents Faculty Fellowship, and GHC Faculty Scholarship. My research is funded by NSF, Cisco, UCR Senate, and SoCal OASIS. Recent News Oct 2025: Serving on the ICSME 2026 Organizing Committee. Sep 2025: Our paper on robust vision language models has been accepted to ICCV SafeMM-AI 2025. Aug 2025: I am serving on the ASPLOS 2026 program committee. Please consider submiting a paper. Jul 2025: Received Omnibus Research and Travel Awards. Jul 2025: GRAphRef accepted to ICSME 2025 as a registered report. Congrats to Zhaorui. Mar 2025: SynToken accepted to FSE 2025 (FSE-IVR). Congrats to Yuxin. Jan 2025: Thank you OASIS, for funding our project on failure-guided testing for autonomous vehicles. Congrats to Yuxin. Jan 2025: Our paper on delta debugging for MLIR compilers has been accepted to FSE 2025. Congrats to Jiyuan and Yuxin. Jan 2025: Congrats to Tony for receiving the Undergrad Minigrant Award. Dec 2024: Our work on automated performance benchmark generation for big data analytics is available here. Aug 2024: Our tool paper on finding similar Github Repositories is accepted ICSME'24. Congrats to Masud. July 2024: Our research on Collaborative Research: SHF: Small: Software Developer Tools for Enabling Heterogeneous Computing was funded! We will be investigating SE techniques in the domain of heterogeneous computing with our collaborators from UCLA. July 2024: Our research paper on leveraging LLMs in code tasks is accepted to ISSTA'24. Congrats to Yuxin. July 2024: Proud to announce that I received a UCR Senate Award. June 2024: I am serving on the FSE 2025 program committee! Please consider submiting a paper! Jan 2024: Congrats to Yuxin for receiving the Outstanding Teaching Assistant Award. April 2024: Proud to announce that I received a Cisco Research Award. April 2024: Our short paper on graph-based test generation is accepted to FSE'24. Congrats to Zhaorui. Mar 2024: Our paper on understanding Malware software repositories is accepted to theWebConf'24 (formerly known as WWW.) Congrats to Nishat and Masud. Jan 2024: Congrats to Zhaorui for getting the ICSE Travel Award. Dec 2023: Our work on augmenting greybox fuzzing with generative AI is available on Arxiv. Nov 2023: I am serving as the Publications chair for SPLASH 2024. Oct 2023: I am serving on the ICSME 2024 program committee! Please consider submitting a paper! July 2023: I was awarded a Regents Faculty Fellowship grant 2023-2024! July 2023: I am serving on the FSE 2024 program committee. Please consider submitting a paper! June 2023: I was selected as a GHC Faculty Scholarship! May 2023: Our paper HFuzz accepted to FSE 2023! Congrats to Jiyuan and all collaborators! Other news Students Current Students Yuxin Qiu (MS/PhD), 2022. Zhaorui Yang (MS/PhD), 2023. Abhijit Kulkarni (MS/PhD), 2024. Zhaoling Chen (MS/PhD), 2025. Graduated Advisees former students at UCLA and CUHK Teaching CS 182 Software Testing and Verification (Fall2022, Fall2023，Fall2024) CS 180 Introduction to Software Engineering (Winter2023, Winter2024, Spring2025) CS 260 Advanced Topics in Software Engineering (Spring2023) CS 206 Advanced Software Testing and Analysis (Winter2025) Professional Service Publication Chair: SPLASH, 2024 Session Chair: ICSME Research Track, Smell/Debt session, 2021 Program Committee: ASPLOS Research Track, 2026 ISSTA Research Track, 2025 FSE Research Track, 2025 ICSME Research Track, 2024 ISSTA Research Track, 2024 FSE Research Track, 2024 FSE Artifact Evaluation Track, 2024 ICSE Research Track, first round 2024, second round 2024 ISSTA Research Track, 2024 FSE Tool Demonstration Track, 2022, 2023 ASE Tool Demonstration Track, 2023 ISSTA Artifact Evaluation Track, 2023 ICSME Research Track, 2022 FUZZING, 2022, 2023 ICSME Research Track, 2021 SIGDA Student Research Forum at ASP-DAC, 2020, 2021, 2022 Journal Reviewer: IEEE Transactions on Software Engineering and Methodology (TOSEM), 2021, 2022, 2023, 2024 IEEE Transactions on Software Engineering (TSE), 2022, 2024 IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2019, 2020, 2021, 2022, 2023 IEEE Transactions on Computers (TC), 2019 IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2019 External Reviewer: ICFPT'2013, ICCD'2013, ICCD'2014, AC'2016, DFT'2017",
  "content_length": 4844,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:35"
}