{
  "name": "Qiang Zeng 0001",
  "homepage": "https://cs.gmu.edu/~qzeng2",
  "status": "success",
  "content": "Qiang Zeng - Publications Home Students Research Publications Teaching I am Qiang Zeng, an Associate Professor in the Department of Computer Science at George Mason University. I received my Ph.D. from Penn State University, and my bachelor's and master's degrees from Beihang University. I am the recipient of an NSF CAREER Award. The easiest way to contact me is through email at zeng (at) gmu.edu. I am broadly interested in Systems, Software, and AI Security. IoT Security and Privacy Software Testing, Vulnerability Discovery, Fuzzing Adversarial Machine Learning, Trustworthy AI Our lab is actively recruiting PhD students Services (selected): General Chair: Information Security Conference (ISC), 2024 Associate Editor: Journal of Computer Security (2023-- ) PC Member: CCS'24, USENIX Security'23, USENIX Security'22, NDSS'22, USENIX Security'21, NDSS'21 News: 10/07/25 We introduce a novel secure IoT pairing protocol that achieves zero information loss. The paper is accepted to IEEE Transactions on Dependable and Secure Computing (TDSC). 08/13/25 Proud to announce that our nRootTag attack, which turns a Bluetooth device into an \"AirTag\" tracker, has been widely covered by the media and has won a Distinguished Artifact Award at USENIX Security’25. 07/28/25 Congratulations to my PhD student, Chuxiong Wu, on successfully defending his dissertation. He will join Southern Illinois University (an R1 college) as a tenure-track Assistant Professor. 06/25/25 Our SoleFlip work introduces a single-bit-flip attack against quantized models. The paper is accepted to ICCV’25. 06/11/25 Our OneFlip attack flips a single bit to implant a stealthy backdoor in a DNN. The attack has been covered by dozens of media outlets, and the paper has been accepted to USENIX Security 25. 01/23/25 We introduce a terrifying attack that can turn your computer into an \"AirTag\" to track you. The vulnerability and attack have been acknowledged by Apple, and the paper is accepted to USENIX Security'25. 05/29/24 Our fuzzer that leverages an LLM to discover 147 new bugs in Matter IoT devices is accepted to USENIX Security'24. 04/04/24 Our work, which enhances the security of QR code payments used by billions of users, has been accepted to USENIX Security'24. 03/01/24 A highly usable system, which authenticates drones using their noises without collecting any fingerprints, is to appear in IEEE Transactions on Mobile Computing. 06/01/23 We propose a new direction for NLP-inspired binary analysis. It is accepted to USENIX Security'23. 02/27/23 Our IoT fuzzing work that found over twenty zero-day vulnerabilities (six CVEs assigned) will be presented at MobiSys'23. 02/06/23 We build the first system that detects IoT interaction threats caused by voice commands. It is also the first to detect cross-platform interaction threats and to provide threat-tailored handling. The paper is accepted to USENIX Security’23. 11/09/22 I receive tenure at George Mason University. 08/22/22 I join the Department of Computer Science at George Mason University as an Associate Professor. 07/11/22 We spent over three years building an AI-based implicit authentication system for everyday objects (such as doors, cabinets, and guns). It is the first of its kind in the literature. Today, it is accepted to UbiComp'22. 06/24/22 I am promoted to be a Tenured Associate Professor at University of South Carolina (effective 8/16/22). 06/09/22 Our paper that presents innovative drone authentication through a Smile is accepted to MobiCom'22. 05/11/22 I received the Junior Researcher (Assistant or Associate Professor) Award of our department.",
  "content_length": 3622,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:38"
}