{
  "name": "Qianni Deng",
  "homepage": "http://english.seiee.sjtu.edu.cn/english/detail/841_689.htm",
  "status": "success",
  "content": "﻿ 上海交通大学-电子信息与电气工程学院-English 中文 Home About Us Dean's Message Overview Leadership History Globalization Visit SEIEE Administration Contact Us Students Future Students Programs Graduate Students Undergraduate Students Exchange Students More Information Academics Departments Discipline Structure Cooperation Research Direction Key Laboratories Research Achievements Faculty Electrical Engineering Automation Computer Science & Engineering Electronic Engineering Instrument Science and Engineering Micro-Nano Electronics School of Software Academy of Information Technology and Electrical Engineering School of Cyber Security Electrical and Electronic Experimental Teaching Center Center for Advanced Electronic Materials and Devices Cooperative Medianet Innovation Center Alumni Events Announcement Publications Notable Alumni Give to SEIEE Networks and Connections Positions Forum Faculty Electrical Enginee... Automation Computer Science &... Electronic Enginee... Instrument Science... Micro-Nano Electro... School of Software Academy of Informa... School of Cyber Se... Electrical and Ele... Center for Advance... Cooperative Median... Computer Science & Engineering Name：Weng Huiyu Title：Associate Professor Office：3-402 Office Phone：34204397 Email：weng-hy@cs.sjtu.edu.cn Website： Research Field Information Retrieval System,Library automation,Chinese Information Processing Education 1996.9-2000.1: Dept. of Electronic Engineering, Shanghai Jiao Tong University, Ph.D. in Communication and Information system. 1982.8-1984.12: Department of Computer Science, Shanghai Jiao Tong University, MS in Computer Science.1978.8-1982.7: Department of Computer Science, Shanghai Jiao Tong University, BS in Computer Science Work experience 1998.9-present: Department of Computer Science, Shanghai Jiao Tong University,Associated Professor,1992.12-1998.9: Computer Center, Shanghai, Shanghai Jiao Tong University, Associated Professor,1987.12-1992.12: Computer Center, Shanghai, Shanghai Jiao Tong University, Lecturer.1992.4-1993.2: Computer Center, Shanghai, Shanghai Jiao Tong University, Assistant Teacher Research 1998.9-present:\\r Department of Computer Science, Shanghai Jiao Tong University.\\rResearch Project: Study on the End-to-end QoS Control of Internet\\rLocal Area Networks testing.\\r Research Area: Computer networks\\r Electronic Commerce\\r1985.1-1998.8:\\r Computer Center, Shanghai, Shanghai Jiao Tong University,\\rResearch Project: Information Retrieval Networks for Shanghai inter-university.\\r Information Retrieval Networks for Shanghai\\r Reservation System of Shanghai Airline.\\r Computerized System of New Shanghai Library\\r Keywords Extraction system for Chinese Characters\\r MIS of Shanghai Petrol-chemical Factory Awards and Honors Teaching Courses Taught in the Current Term:1. Computer Networks2. Modern data communication networks3. Introduction to Computing Publications 1)\\tClassified Intserv/RSVP(CRSVP), Journal of Shanghai Jiaotong University, No.9, 2001.2)\\tADM: A New Approach of Resource Allocation for Guaranteed Quality of Services in Internet, Journal of Shanghai Jiaotong University, No.6, 20003)\\tStudy on the simulation of computer networks protocal, Journal of system simulation, vol 13, no 3, 20014)\\tQoS Control Policy of Mobile Internet, Journal of Shanghai Jiaotong University, No.7, 20005)\\tData distributed policy of a centralized-distributed OLTP system, Computer Engineering and Application, vol 33 no 1, 19976)\\tPriority Queuing system and communication networks, Computer application and research, no 12, 19987)\\tComputer, Networks and Information Society, Data Communication, no 1, 19998)\\tLayer 3 Switching – Study on IP switch, Communication Technolegy, no 1, 19999)\\tNew generation router – routing switcher, Data Communication, no 2, 1999Research status of Networks Search Engine. Journal of Information, 1999 Others Qianni Deng, Xugang Wang， Dehua Zang , Monitoring MPI Program Running Nodes Status for Load Balance, The 4th International Conference on Grid and Cooperative Computing (GCC2005). 2005.12Deng Qianni , Lu Xinda, Chen Li , Li Minglu. Search by Shortcuts in P2P Scientific Collaboration System. High Tech. Letter. 2005. 3 Deng Qianni，Lu Xinda, Group Clustering Mechanism for P2P Large Scale Data Sharing Collaboration, Chinese Journal Electronics. 2005.1Xugang Wang, Qianni Deng. VIP: a P2P communication Platform for NAT traversal, Third International Symposium on Parallel and Distributed Processing and Applications in 2005 (ISPA2005)Xugang Wang, Qianni Deng , Xinda Lu , Dehua zang An Enhanced XMPI for Load Balance In Cluster Environment, National Open Distributed and Parallel Computing Symposium in 2005. Chen Fangrong, Deng Qianni. A Special Naming and Resolving Mechanism for Peer-to-Peer Systems. SKG2005---1st International Conference on Semantics, Knowledge and Grid.Hongbo Wan, Qianni Deng, Xinhua Lin, Xinda Lu, Minglu Li. The Design and Implementation of Service Adapter in ShanghaiGrid Core. International Workshop on Service Grid Computing and Applications (SGCA 2005)Changxi Zheng, Guobin Shen, Shipeng Li, Qianni Deng: Joint Sender/Receiver Optimization Algorithm for Multi-Path Video Streaming Using High Rate Erasure Resilient Code. ICME 2005: 1258-1261Kai Chen; Qianni Deng. Legitimate Peer-to-Peer Content Distribution Network. Fifth International Conference on Grid and Cooperative Computing，NGI Workshops, 2006 Page(s):129-132. Kai X. Miao, Henning Schulzrinne, Vishal Kumar Singh, Qianni Deng: Distributed Self Fault-Diagnosis for SIP Multimedia Applications. MMNS 2007: 187-190Qianni Deng, Hao Lv. Analyzing unstructured peer-to-peer search networks with QIL. Proceedings of 2004 IEEE International Conference on Services Computing, SCC 2004, p 547-550Qianni Deng. A Generic Simulator for Unstructured Decentralized P2P File Sharing Networks. Proceedings of High Performance Computing and Applications (HPCA2004) Shanghai, China, August 8 th -10 th , 2004.Qianni Deng, Xinda Lu. Grid service Framework：Supporting Multi-Models Parallel Grid Programming. Journal of Shanghai Jiaotong Univ.(Science)，Vol.E-9,No.1 Mar.2004. 56-59.Li Chen, Hong Deng, Qianni Deng. A research of grid manufacturing and its application in custom artificial joint. Proceedings of International Conference of Computer Science 2004(ICCS 2004). Chuliang Weng, Xinda Lu, Guangtao Xue, Qianni Deng, Minglu Li. A Double Auction Mechanism for Resource Allocation on Grid Computing Systems. Proceedings of the 2nd International Conference on Grid and Cooperative Computing(GCC2004), October 2004, Wuhan, China, Lecture Notes in Computer Science, Vol. 3251, pp. 269-276, Springer-Verlag Heidelberg.Qianni Deng, Xinda Lu, Li Chen ,Minglu Li. A Resource Model for Large-Scale Non-Hierarchy Grid System. Proceeding of The Second International Workshop on Grid and Cooperative Computing (GCC2003) LNCS3033.669-676Xinhua Lin, Qianni Deng, Xinda Lu Information Grid Toolkit: Infrastructure of Shanghai Information Grid. Proceeding of The Second International Workshop on Grid and Cooperative Computing (GCC2003) LNCS3032-3033Li Chen, Hong Deng, Qianni Deng, Wu Zhenyu, A research on the framework of grid manufacturing, Proceeding of The Second International Workshop on Grid and Cooperative Computing (GCC2003) LNCS3032-3033Chuliang Weng, Xinda Lu, Qianni Deng. Formalizing Service Publication and Discovery in Grid Computing Systems. Proceeding of The Second International Workshop on Grid and Cooperative Computing (GCC2003) LNCS3032-3033Chuliang Weng, Xinda Lu, Qianni Deng. A Distributed Approach for Resource Pricing in Grid Environments.Proceeding of The Second International Workshop on Grid and Cooperative Computing (GCC2003) LNCS3032-3033Li Chen, Hong Deng, Qianni Deng. Framework for grid manufacturing, Tsinghua Science and Technology, v 9, n 3, June, 2004, p 327-330 Qianni Deng, Xinda Lu. GSF: A problems solving environment supporting multi-models parallel grid programming. International Conference on Computational Science (ICCS 2003), JUN 02-04, 2003 . COMPUTATIONAL SCIENCE - ICCS 2003, PT IV, PROCEEDINGS ,LNCS2660 413-419, 2003 Xinhua Lin, Yang Qi, Jing Zhao, Xinda Lu, Hong Liu, Qianni Deng. Building CFD Grid Application Platform on CGSP. Proceedings of High Performance Computing and Applications (HPCA2004) Shanghai, China, August 8 th -10 th , 2004Xinhua Lin, Xili Sun, Xinda Lu, Qianni Deng, Minglu Li. Recent Advances in CFD Grid Application Platform.The 2004 IEEE International Conference on Services Computing (SCC 2004), Shanghai, China, September 15-18, 2004.Xinhua Lin, Xinda Lu, Hong Liu, Qianni Deng, Lei Chen. Service Domain-based CFD Grid Application Platform. Proceedings of the Advances on Computer Architecture, (ACA\\04) Students Available Programs Undergraduate Application Graduate Application Exchange Application Current Graduates Current Undergraduates Current Exchange SJTU Intl' Students SJTU Exchange Students Academic Calendar Faculty/Staff Research Self-Development Go Abroad Job Oppotunities Application Procesure SEIEE Faculty SJTU Life Downloads SEIEE HR Department SJTU HR Department Alumni Events Groups Images History Overseas Sourvenir Celebrities Pulication Homecoming Find Connection Vistors Getting Here Campus-bus Schedule Bookstores Lodging Campus Map Food Services Hospitals About SJTU About Shanghai Travel Around Quick Links SJTU SIE Graduate School Undergraduate School Int'l Coop.Division Library Museum SJTU Alumni Association Zizhu Hi-Tech Park U.S. Consulate Weibo 人人网 Wechat",
  "content_length": 9568,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:37"
}