{
  "name": "Qiang Xu 0001",
  "homepage": "http://www.cse.cuhk.edu.hk/~qxu",
  "status": "success",
  "content": "Welcome to Qiang Xu's Homepage Qiang XuDepartment of Computer Science & Engineering The Chinese University of Hong Kong Shatin, N.T., Hong Kong Email: Phone:Fax:  Office: qxu AT cse.cuhk.edu.hk+852.3943.8436 +852.2603.5024 Room 1008, Ho Sin Hang Building Home Research@CURE Teaching Publications Professional Activities Vacancy Qiang Xu is an Associate Professor of Computer Science & Engineering at The Chinese University of Hong Kong. He received his B.E. and M.E. degrees in Telecommunication Engineering from Beijing University of Posts & Telecommunications, China, in 1997 and 2000, respectively. After working at a start-up integrated circuit design house for one and a half years, he continued his graduate study and received his Ph.D. degree in Electrical & Computer Engineering from McMaster University, Canada, in 2005, and then joined CUHK. Dr. Xu leads the CUhk REliable computing laboratory (CURE Lab.) and CUHK MakerLab. His research interests include fault-tolerant computing, trusted computing and smart hardware design. He received the Best Paper Award in 2004 IEEE/ACM Design, Automation and Test in Europe (DATE). He has five other papers nominated for best paper award at prestigious conferences (e.g., DAC and ICCAD). Dr. Xu is currently serving as an associate editor for IEEE Design&Test. He has also served as technical program committee members for a number of conferences on VLSI design and testing, including DAC, ITC, ICCAD, and DATE. Looking for graduate students/RAs to participate the following projects: (i). IoT security; (ii). Approximate computing for error-resilient applications (e.g., pattern recognition, data mining and synthesis); (iii) Smart hardware design. CUHK CS&E students supervised by Prof. Xu won Championship in Huawei Cup and it comes with the grand prize of 15,000 RMB, at the annual smart design collegiate competition in the Great China area, 2015. [link] CUHK CS&E students supervised by Prof. Xu won the first prize at Hong Kong Challenge Cup and rank #1 in the IT category, 2015. [link] Yannan's paper was nominated for Best Paper Award at ACM/IEEE Design Automation Conference (DAC), 2015. There are only 5 out of 789 submissions nominated! [link] Call for papers in IEEE Design & Test Special Issue on Approximate Computing. Dr. Li JIANG won the first place in the semi-final of IEEE TTTC Doctoral Thesis Award held at Asian Test Symposium, Nov. 2014, and advanced to the final to be held at IEEE International Test Conference, Oct. 2015. Dr. Xiao LIU won EDAA Outstanding Dissertation Award 2012, which comes with 1000Euro prize and the offer to publish his Ph.D. thesis with Springer! CUHK CS&E students supervised by Prof. Xu won Championship in Intel Cup 2012! [link1 link2 link3] This site was last updated 09/14/15",
  "content_length": 2780,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:36"
}