{
  "name": "Qiang Ni",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/qiang-ni",
  "status": "success",
  "content": "Qiang Ni - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Qiang Ni Professor Research Overview Prof Qiang Ni's interests are Wireless Networks/Communications, IoT, Cyber Security, AI, Machine Learning, Digital Twins techniques, including 5G/6G, Intelligent Communication Techniques, Green Communications, Cognitive Radio Networks, SDN, Edge/Fog/Cloud Computing, Data Analytics, AI, Machine Learning, IoT, Cyber Security, Smart City, Smart Grids, Sensor Networks, Vehicular Networks, THz, Quantum Communication, Quantum Machine Learning, Positioning. Prof Ni is an IEEE 1932.1 standard Voting Member. He is a Vice Chair of Big Data with Computational Intelligence SIG, IEEE Technical Committee on Big Data. He was an IEEE 802.11 Wireless LAN standard Voting Member. China CSC PhD applicants/visitors are very welcome! Show more… Profile Prof Qiang Ni is a Professor in Communications and Networking at School of Computing and Communications and he is with Data Science Institute and Security Lancaster Center at Lancaster University. He is the Head of Communication Systems Research Group and the School's Director of International Partnership (previously was School's Director of Postgraduate Studies and School's Deputy Director of Research). Prof Ni is a Fellow of IET, Fellow of Higher Education Academy and Senior Member of IEEE. China CSC PhD or visitors are very welcome! Professional Role IEEE Communications Society Distinguished Lecturer, 2021-2022; Journal Editor/AE: Editor of IEEE Transactions on Green Communications and Networks; Editor of IEEE Journal on Selected Areas in Communications (JSAC) - Machine Learning in Communications and Networks Series; IEEE Access Journal; Wiley Journal of Security and Communication Networks; KSII Transactions on Internet and Information Systems; IEEK Transactions on Smart Processing & Computing; Elsevier Journal Computer Communications Special Issue on “Secure Artificial Intelligence in Mobile Edge Computing”, 2020; Elsevier Journal Internet of Things Special Issue on “Towards Smart Vehicles: Emerging Marriage Applications via Internet of Things and Deep Learning Technologies”, 2019; IEEE Communications Magazine Special Issue on “Orchestration of Ultra-Dense 5G Networks”, 2018; IEEE Access Journal Special Issue on “Fairness in Futuristic Wireless Networks: Applications, Implementation, Issues, and Opportunities”, 2019; Wiley Transactions on Emerging Telecommunications Technologies Journal Special Issue on “Data-Driven Intelligence in Wireless Networks: Issues, Challenges, and Solution”, 2018; Springer Journal of Ambient Intelligent and Humanized Computing Special Issue on “Towards Enhancement of Communication Systems, Networks and Applications for Smart Environment”, 2017; International Journal of Distributed Sensor Networks Special Issue on \"A Step Towards 5G: Lightweight IoTs and Energy Efficient Sensor Networking\", 2016. IEEE Access Journal Special Issue on “Artificial Intelligence Enabled Networking (AI-enabled Networking)”, 2015; IET Network Journal Special Issue on “A Smarter Environment through the Advancements of Communication Systems, Networks and Applications”, 2015; Conference Chair: Chairing various IEEE conferences, including IEEE ICC 2021, Cognitive Radio & AI-Enabled Networks Symposia, IEEE ICC 2020 workshop on ULMC6G networks Executive Committee, IEEE CPSCom 2017, mmWave5G 2016, IEEE ICUMT’ 2014/13/11/10/09, IUCC 12, CIT 10. Senior Program Committee Member of AAAI-26 (AAAI Conference on Artificial Intelligence 2026). TPC committee member of over 100 international conferences, including regulary for IEEE Globecom, ICC. Keynote Speaker at conferences such as IEEE GreenCom-2017, I-SPAN 2017. Research Grants Principal Investigator, \"CRDT-Port: Developing a Crisis and Resilience Digital Twin for UK Port-centric Transport Systems\", UKRI EPSRC funded Project, 2025-2028.Principal Investigator, \"INTACT: Integrated software toolbox for secure IoT-to-Cloud computing\", Horizon Europe Cyber Security and UKRI funded Project, 2024-2027.Principal Investigator, \"CoGNETs: Continuums Of Game NETs: swarm intelligence as information processing\", Horizon Europe and UKRI funded Project, 2024-2027.Principal Investigator, \"SustainAIRA6G: Energy-Efficient Sustainable AI-driven Resource Allocation for 6G-empowered Edge-Fog-Cloud Continuum\", UK EPSRC funded Project, 2024-2025.Principal Investigator, \"ONE WORD: Open Networks Ecosystem Western Open RAN (O-RAN) Deployment\", UK Department for Science, Innovation and Technology (DSIT) Open Networks Ecosystem Competition Research funded Project, 2023-2025.Co Investigator, \"TRACE-V2X: Smart and Proactive Multi-RAT Traffic Steering for V2X\", Horizon Europe and UKRI funded Project, 2024-2028.Principal Investigator, \"SANCUS: Analysis software scheme of uniform statistical sampling, audit and defence processes\", EU H2020 SU-ICT Cyber Security RIA funded Project on 5G Security and Privacy Issues, 2020-2023.Principal Investigator, \"Developing Novel Quantum Machine Learning Algorithms\", HIRP funded Project, 2018-2020.Principal Investigator, \"iCASE: Intelligent Remote Monitoring Systems for Digital Healthcare\", UK EPSRC funded Project, 2019-2023.Co Investigator, \"DLINK: D-band Wireless Link With Fibre Data Rate\", UK EPSRC funded Project, 2019-2021.Principal Investigator, \"Effective cooperative multicast towards 5G non-orthogonal multiple access systems\", UK Royal Society funded Project, 2018-2020.Co Investigator, \"TERALINKS: TERAhertz high power LINKS using photonic devices, tube aplifiers and smart antennas\", EU Chist-ERA and UK EPSRC funded THz Wireless Project, 2017-2019.Co Investigator, \"Simultaneously Wireless InFormation and energy Transfer (SWIFT)\", UK EPSRC funded Project, 2015-2019.Principal Investigator, \"Cognitive Resources Scheduling Designs towards Green Wireless Systems (CogGreen)\", UK EPSRC funded Project, 2013-2016.Principal Investigator, \"Cross-Layer Research on Green Cooperative Cognitive Radio Networks and Services (CROWN)\", EU FP7 funded Project, 2014-2018.Co Investigator, \"5G Wireless Heterogeneous Millimetre Wave Communications (TWEETHER)\", EU Horizon 2020 funded Project, 2015-2018.Principal Investigator, Smart ICT Technology for Smart City: Big Video Data Analytics Research, International Cooperation funded Project, 2015-2018. Current Teaching SCC160 Fundamentals of Communication Systems SCC406 Broadband Communications My Role Networks Security Research Areas Lead, Security Lancaster Centre. Group Lead, Communication Systems Group, School of Computing and Communications. Director of International Partnership, School of Computing and Communications. Theme Lead (Security and Defence) of the Lancaster Intelligent, Robotic and Autonomous systems (LIRA) Research Centre at Lancaster PhD Supervision Interests You are welcome to contact me if you are interested in doing your PhD in Wireless/Mobile Communications, Networking, IoT, Big Data Analytics, Security, AI, Machine Learning, Digital Twins techniques. Please email me your CV, academic transcripts and a draft PhD research plan/proposal. China CSC PhD applicants or visitors are very welcome. Show less Publications Projects PhD Students Research Groups Selected Publications Show all 338 publications Nash Bargaining Game Theoretic Scheduling for Joint Channel and Power Allocation in Cognitive Radio SystemsNi, Q., Zarakovitis, C.C. 01/2012 In: IEEE Journal on Selected Areas in Communications. 30, 1, p. 70-81. 12 p.Journal article Effective capacity maximization with statistical delay and effective energy efficiency requirementsMusavian, L., Ni, Q. 07/2015 In: IEEE Transactions on Wireless Communications. 14, 7, p. 3824-3835. 12 p.Journal article On the spectral-energy efficiency and rate fairness tradeoff in relay-aided cooperative OFDMA systemsSong, Z., Ni, Q., Navaie, K., Hou, S., Wu, S. 09/2016 In: IEEE Transactions on Wireless Communications. 15, 9, p. 6342-6355. 14 p.Journal article Energy efficient green wireless communication systems with imperfect CSI and data outageZarakovitis, C.C., Ni, Q., Spiliotis, J. 12/2016 In: IEEE Journal on Selected Areas in Communications. 34, 12, p. 3108-3126. 19 p.Journal article An evolving graph-based reliable routing scheme for VANETsEiza, M.H., Ni, Q. 05/2013 In: IEEE Transactions on Vehicular Technology. 62, 4, p. 1493-1504. 12 p.Journal article Tradeoff analysis and joint optimization of link-layer energy efficiency and effective capacity toward green communicationsYu, W., Musavian, L., Ni, Q. 05/2016 In: IEEE Transactions on Wireless Communications. 15, 5, p. 3339-3353. 15 p.Journal article Aggregation with fragment retransmission for very high-speed WLANsLi, T., Ni, Q., Malone, D., Leith, D., Xiao, Y., Turletti, T. 04/2009 In: IEEE/ACM Transactions on Networking . 17, 2, p. 591-604. 14 p.Journal article Power-Efficient Cross-Layer Design for OFDMA Systems With Heterogeneous QoS, Imperfect CSI, and Outage ConsiderationsC. Zarakovitis, C., Ni, Q., Skordoulis, D.E., Hadjinicolaou, M.G. 02/2012 In: IEEE Transactions on Vehicular Technology. 61, 2, p. 781-798. 18 p.Journal article Capacity analysis of reservation-based random access for broadband wireless access networksVinel, A., Ni, Q., Staehle, D., Turlikov, A. 02/2009 In: IEEE Journal on Selected Areas in Communications. 27, 2, p. 172-181. 10 p.Journal article Performance Analysis of Contention Based Bandwidth Request Mechanisms in WiMAX NetworksNi, Q., Hu, L., Vinel, A., Xiao, Y., Hadjinicolaou, M. 12/2010 In: IEEE Systems Journal. 4, 4, p. 477-486. 10 p.Journal article Secure and robust multi-constrained QoS aware routing algorithm for VANETsHashem Eiza, M., Owens, T., Ni, Q. 01/2016 In: IEEE Transactions on Dependable and Secure Computing. 13,",
  "content_length": 13934,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:36"
}