{
  "name": "Qiang Guan",
  "homepage": "http://www.cs.kent.edu/~qguan",
  "status": "success",
  "content": "Associate Professor Director of GUANS Lab Department of Computer Science, Kent State University, Kent, OH Kent State University Kent, OH. Office: MSB 208 Lab: MSB160 Email: qguan at cs.kent.edu or qguan at kent.edu Dr. Qiang Guan is an associate professor in Department of Computer Science at Kent State University, Kent, Ohio . Dr. Qiang Guan is the director of GUANS Lab . He is also a guest scientist of Los Alamos National Laboratory. He was a scientist in Data Science at Scale Team, at Los Alamos National Laboratory. He was mentored by Dr. Nathan DeBardeleben, Sean Blanchard and Dr. James Ahrens. He was the technical lead of BEE (Build and Execution Environment) project at Los Alamos National Laboratory. He obtained the Ph.D. degree in Computer Science and Engineering from University of North Texas, Denton, Texas, in 2014 (Ph.D. advisor : Dr. Song Fu . ). He received the M.S. degree in Information Engineering from Myongji University, Seoul, South Korea , in 2008 and B.S. degree in Communication Engineering from Northeastern University, Shenyang, China, in 2005. Dr. Guan received the NSF Early Career Award in 2023. Current Research Interests: Quantum Computing, Noise Mitigation, Quantum Cloud. High Performance Computing, HPC-Cloud. Resilience and Power. AR/VR, Holographic, Visualization Deep Learning Workflow and Application. Check the lab page GUANS Lab for more details Awards NSF CAREER Award, 2023 Best Paper Award, IEEE Quantum Week(QCE) , 2023 DoE EMSL Exploratory Award, 2023 Outstanding Research and Scholarship Award (ORSA), Kent State University, 2023 Grants Elements: QuAIM: A Quantum Cyberinfrastructure with Automated Implementation Toolkits for Scientific Discover , PI, NSF, $219K, 2025-2028 OAC Core: An Integrated Framework for Enabling Temporal-Reliable Quantum Learning on NISQ-era Devices , PI, NSF, $270K, 2023-2026 CAREER: The Research of Noise-Aware Scheduling for Noisy Intermediate-Scale Quantum Systems , PI, NSF, $578K, 2023-2028 CyberTraining: Implementation: Small: Interactive and Integrated Training for Quantum Application Developers across Platforms , PI, NSF, $510K, 2022-2026 OAC Core: Interpretable Resilience Analysis Platform for Scientific Workflow Applications, PI, NSF, $584K, 2022-2026 Designing A Machine Learning Tool To Assess Children’s Fraction Arithmetic , Co-PI, ASSISTments, $100K 2023-2024 PPoSS: Planning: Software Stack for Scalable Heterogeneous NISQ Cluster, PI, NSF, 2022-2023 PPoSS: Planning: Efficient and Scalable Learning and Management of Distributed Probabilistic Graphs, Co-PI, NSF, 2022-2023 Design and Implementation of Immersive Representations of Practice, Co-PI, NSF, 2019-2023 Develop, Improve and Perform Research with the Open-Sourced Tool PFSEFI Related to Error Propagation, PI, DoE Subaward, 2018-2021 Publications Google Scholar DBLP Available Ph.D. Positions I have mutiple RA positions available to apply. You could choose the below research topics (but not limited to) High Performance Computing and Cloud Computing Quantum Computing Deep Learning Visualization, VR/AR Last updated on 2/14/2023;",
  "content_length": 3095,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:37"
}