{
  "name": "Qiaozhu Mei",
  "homepage": "http://www-personal.umich.edu/~qmei",
  "status": "success",
  "content": "Qiaozhu Mei Qiaozhu Mei Professor, Associate Dean for Research and Innovation School of Information Professor, Department of Electrical Engineering and Computer Science (by courtesy) University of Michigan Office: 3348 North Quad, 105 S. State St., Ann Arbor, MI 48109 Phone: (734)-763-0076 Email: qmei AT umich DOT edu I am a professor at the University of Michigan, where I serve as the Associate Dean for Research and Innovation at the School of Information. Before that I served as the founding director of the Master of Applied Data Science program, one of the first online degree programs at the University of Michigan. Prior to joining Michigan, I received my PhD degree from the Department of Computer Science at the University of Illinois at Urbana-Champaign and my Bachelor's degree from Peking University. Research My research spans multiple subareas of AI, including data mining, information retrieval, machine learning, and natural language processing. I develop novel models and techniques for analyzing large-scale text, networks, and behavioral data. These techniques are applied to solving problems in Web search, social networks, scientific discovery, healthcare, and other domains with the aim to generate a positive impact on everyone’s daily life. Research Group: The Foreseer Group Publications Google Scholar DBLP Honors and Awards Faculty Recognition Award , University of Michigan, 2020. Best Full Paper Award, WWW 2019. Michael D. Cohen Outstanding Service Award, University of Michigan School of Informaiton, 2018. Recognition of Service Award (for Co-Chairing SIGIR 2018), Association for Computing Machinery (ACM), 2018. ACM Distinguished Member, 2017. Best Paper Award, WSDM 2016. Best Paper Nomination, WWW 2016. Best Paper Award, ICML 2014. Distinguished Paper Award, AMIA 2014. Best Paper Selection, IMIA Yearbook of Medical Informatics 2012. NSF CAREER Award, National Science Foundation, 2011. Project Site Certificate of Recognition, 2010 SIGKDD Doctoral Dissertation Award 2007-2008 Yahoo! PhD Student Fellowship Best Student Paper Award, Runner-Up, KDD 2007 C. L. and Jane Liu Award, University of Illinois at Urbana-Champaign, 2007 Best Student Paper Award, Runner-Up, KDD 2006 Selected Services Action Editor: Journal of Machine Learning Research (JMLR) Associate Editor: ACM Transactions on the Web (TWEB) Associate Editor: IEEE Transactions on the Big Data (TBD) Associate Editor: ACM Transactions on Information Systems (TOIS), 2015-2019 General Co-Chair: SIGIR 2018 Teaching SI601 Data Manipulation SI650/EECS549 Information Retrieval SI699 Big Data Analytics SI301 Models of Social Information Processing SI544 Introduction to Statistics and Data Analysis SI608 Networks: Theory and Application SI671/721 Data Mining: Methods and Applications SIADS532 Data Mining I SIADS632 Data Mining II SIADS685 Search and Recommender Systems SIADS696 Milestone II SIADS699 Capstone Last Updated: Summer 2024",
  "content_length": 2940,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:40"
}