{
  "name": "Qiaochu Chen",
  "homepage": "https://thelyad.github.io",
  "status": "success",
  "content": "Jocelyn Q. Chen Jocelyn Qiaochu Chen Email: qc1127 [at] cs.nyu.edu | Office: 60 5th Ave, Room 418 | Twitter | Google Scholar | ORCID I am currently a Faculty Fellow/Assistant Professor at NYU Courant. I am also an incoming Assistant Professor (currently an Adjuct Professor) at the University of Alberta and an Amii fellow. I obtained my PhD at the University of Texas at Austin with Isil Dillig and Greg Durrett. Prior to that, I did my Bachelor at the Univeristy of Wisconsin - Madison. My research areas include programming languages, formal methods, and natural language processing. More specifically, I do research on program synthesis and neurosymbolic programming. I am recruiting MS/PhD students at the University of Alberta. I am open to working with (undergrad/grad) research interns if there is a strong match. Please take a look at my research interests below and Notes to Prospective Students if any of these questions interests you as well. Research Interests My current research interests revolve around the following key questions in AI-assisted programming: How can we leverage state-of-the-art machine learning models to create new programming abstractions? How can we leverage symbolic and neural techniques to synthesize programs in a correct, scalable, user-friendly way? What are the right abstractions for programming tasks involving Large Language Model (LLM) invocations? How can we effectively integrate programming interfaces with program synthesizers? Preprints Publications CRUST-Bench: A Comprehensive Benchmark for C-to-safe-Rust Transpilation. Anirudh Khatry, Robert Zhang, Jia Pan, Ziteng Wang, Jocelyn Chen, Greg Durrett, Isil Dillig. COLM 2025. Automated Discovery of Tactic Libraries for Interactive Theorem Proving. Maxine Xin, Jimmy Xin, Gabriel Poesia, Noah Goodman, Jocelyn Chen, Isil Dillig. OOPSLA 2025. Active Learning for Neurosymbolic Program Synthesis. Celeste Barnaby, Jocelyn Chen, Ramya Ramanlingam, Osbert Bastani, Isil Dillig. OOPSLA 2025. PhotoScout: Synthesis-Powered Multi-Modal Image Search. Celeste Barnaby, Jocelyn Chen, Chenglong Wang, Isil Dillig. CHI 2024. Satisfiability-Aided Language Models Using Declarative Prompting. Xi Ye, Jocelyn Chen, Isil Dillig, Greg Durrett. Neurips 2023. Code Data Extraction via Semantic Regular Expression Synthesis. Jocelyn Chen, Arko Banerjee, Çağatay Demiralp, Greg Durrett, Isil Dillig. OOPSLA 2023. Code ImageEye: Batch Image Processing Using Program Synthesis. Celeste Barnaby, Jocelyn Chen, Roopsha Samanta, Isil Dillig. PLDI 2023. Code Type-Directed Synthesis of Visualizations from Natural Language Queries. Jocelyn Chen, Shankara Pailoor, Celeste Barnaby, Abby Criswell, Chenglong Wang, Greg Durrett, Isil Dillig. OOPSLA 2022. Code Optimal Neural Program Synthesis from Multimodal Specifications. Xi Ye, Jocelyn Chen, Isil Dillig, Greg Durrett. Findings of EMNLP 2021.Code Web Question Answering with Neurosymbolic Program Synthesis. Jocelyn Chen, Aaron Lamoreaux, Xinyu Wang, Greg Durrett, Osbert Bastani, Isil Dillig. PLDI 2021. Code.Presentation Sketch-driven Regular Expression Generation from Natural Language and Examples. Xi Ye, Jocelyn Chen, Xinyu Wang, Isil Dillig, Greg Durrett. TACL 2020. Code Benchmarking Multimodal Regex Synthesis with Complex Structures. Xi Ye, Jocelyn Chen, Isil Dillig, Greg Durrett. ACL 2020. Code Multi-modal Synthesis of Regular Expressions. Jocelyn Chen, Xinyu Wang, Xi Ye, Greg Durrett, Isil Dillig. PLDI 2020. Code.Presentation Teaching I am NOT looking for graders/tutors/teaching assistants for my courses. Fall 2025: CSCI-UA.0202(-003): Operating Systems Spring 2025: CSCI-UA.0202(-003): Operating Systems Fall 2024: CSCI-UA.0202(-003): Operating Systems Service 2026: ICSE 2026, OOPSLA 2026, PLDI 2026, PLDI 2026 (Web co-chair) 2025: CAV 2025, VerifAI Workshop (@ICLR 2025), LMPL Workshop (@SPLASH 2025), PLDI 2025 (Web co-chair) Students Avani Tiwari (MS, co-supervising with Levi Lelis) Haozhi Wang (MS, started Fall 2025) Quang Hieu Pham (MS, co-supervising with Xi Ye) Notes to Prospective Students If you're interested in working with me, please send an email with the subject line \"Prospective Student\", and include your CV and transcript. Please note that I may not be able to respond to all individual inquiries about research opportunities or admissions. Scheduling To make scheduling easier, my availability can be viewed on my public calendar. Important: Please refrain from scheduling a meeting unless we have mutually agreed to meet beforehand. This ensures efficient use of our time and prevents any misunderstandings. Personal I am originally from Nanjing, China. I go by Jocelyn, though my publications appear under Qiaochu Chen (written as 陈翘楚 in Chinese).",
  "content_length": 4719,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:38"
}