{
  "name": "Qihua Zhou",
  "homepage": "https://qihuazhou.github.io",
  "status": "success",
  "content": "Qihua Zhou (周祺華) Distinguished Professor College of Computer Science and Software Engineering Shenzhen University Shenzhen 518060, Guangdong, P.R.China Office: Room 618-1, Zhiteng Building, Yuehai Campus, SZU I was fortunate to have been supervised by Professor Song Guo at PolyU and HKUST, and by Professor Yanfei Sun at NJUPT. qihuazhou[at]szu.edu.cn | Google Scholar | GitHub | 中文主页   About Qihua Zhou is a Distinguished Professor with the College of Computer Science and Software Engineering at Shenzhen University. He is a co-founder of Hong Kong DrBody Co., Limited. He works closely with Prof. Laizhong Cui at SZU and Prof. Song Guo at HKUST. He received his Ph.D. degree in the Department of Computing, Hong Kong Polytechnic University, advised by Prof. Song Guo (now HKUST). Before that, he received a Ph.D. degree in the College of Automation and College of Artificial Intelligence, Nanjing University of Posts and Telecommunications, advised by Prof. Yanfei Sun. He aims at developing edge-native AI/ML systems that empower ubiquitous intelligent services, particularly in resource-constrained environments, to enrich human life in diverse aspects.   Research Statement He focus on the design, optimization and deployment of highly-efficient Edge Embodied AI Systems, covering the research intersection of Efficient AI Computing, Efficient MoE/LLM Serving, Diffusion Generative and VLA Models, Tiny/On-Device Machine Learning, Neural Video Codecs, and AI for Healthcare. He recognize the importance of optimizing the completed life-cycle of intelligent tasks, from data sensing to knowledge-aware analytics and cross-entity interaction. Embracing this closed-loop design philosophy, his vision is to extend the boundary of modern learning paradigms and present new research prospects for enhancing system-level performance.   Recent News 11/2025: [Paper] DeNC++ has been accepted by AAAI’26 (CCF-A, Oral). 12/2024: [Paper] D2MoE has been accepted by ACM MobiCom’25 (CCF-A). 12/2024: [Paper] DeNC has been accepted by AAAI’25 (CCF-A). 12/2024: [Paper] Mjölnir has been accepted by AAAI’25 (CCF-A). 12/2024: [Paper] FedFoA has been accepted by IEEE TNNLS’24 (JCR-Q1, CCF-B). 09/2024: [Paper] pNAS has been accepted by IEEE TC’24. 09/2024: [Paper] pFedC has been accepted by IEEE TMC’24. 07/2024: [Paper] FreePIH has been accepted by ACM Multimedia’24 (CCF-A, Oral). 04/2024: [Paper] ParsNets has been accepted by IJCAI’24. 01/2024: [Paper] PASS has been accepted by IEEE TPAMI’24 (CCF-A). 01/2024: [Paper] Chiron has been accepted by IEEE TMC’24 (CCF-A).",
  "content_length": 2563,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:39"
}