{
  "name": "Qijun Zhao",
  "homepage": "http://www.scubrl.org",
  "status": "success",
  "content": "BRL Biometrics for a Secure, Comfortable & Healthy Life Biometrics Research Laboratory College of Computer Science, Sichuan University About Who We Are This is a group photo of our laboratory members. Young and active, we are full of passion and energy, enjoy the works we do, love the laboratory we live. Research Highlights We focus on the research of theories, algorithms, and systems of biometrics, with applications to video surveillance, identity management, mobile and cyber security, and smart healthcare. 3D Biometrics 3D Face Reconstruction 3D/RGB-D Face Processing & Recognition 3D Fingerprint Modeling & Recognition 3D Biometric Data Quality & Individuality Face Perception 2D/3D Face Detection & Alignment Facial Attribute Analysis Deep Face Representations Face Anti-Spoofing Fingerprint Modeling & Recognition Statistical Fingerprint Feature Models Latent/Partial Fingerprint Processing & Recognition Fingerprint Quality Assessments Fingerprint Liveness Detection Video Object Detection & Analysis Pedestrian Detection & Re-Identification Long-distance Object Detection & Classification Action & Event Recognition Affective Computing Facial Expression Recognition Multi-Modality-Based Emotion Recognition Welcome to BRL BRL Institute of Image & Graphics, Sichuan University, No.24 South Section 1, Yihuan Road, Chengdu , China +8628 85417865 Projects Multi-Dim Dataset A RGB-Depth face dataset with multiple poses, lighting and expressions. Detaills Anti-spoofing for Securing Biometric Systems Most existing biometric systems are fragile to spoofing attacks with fake biometric data. We seek for effective appearance features to distinguish fake from real biometric data via image analysis and machine learning methods. Learning-based Fingerprint Analysis and Processing Robust fingerprint image processing is critical to reliable and accurate automated fingerprint recognition. We apply statistical and deep learning methods to model fingerprint featrues and pre-process fingerprint images. All Recent Projects Face Fingerprints Affective Computing Publications Point in, Box out: Beyond Counting Persons in Crowds Modern crowd counting methods usually employ deep neural networks (DNN) to estimate crowd counts via density regression. Despite their significant improvements, the regression-based methods are incapable of providing the detection of individuals in crowds. The detection-based methods, on the other hand, have not been largely explored in recent trends of crowd counting due to the needs for expensive bounding box annotations. In this work, we instead propose a new deep detection network with only point supervision required. It can simultaneously detect the size and ... Joint Face Alignment and 3D Face Reconstruction with Application to Face Recognition.\" IEEE transactions on pattern analysis and machine intelligence Face alignment and 3D face reconstruction are traditionally accomplished as separated tasks. By exploring the strong correlation between 2D landmarks and 3D shapes, in contrast, we propose a joint face alignment and 3D face reconstruction method to simultaneously solve these two problems for 2D face images of arbitrary poses and expressions. This method, based on a summation model of 3D faces and cascaded regression in 2D and 3D shape spaces, ... Multi-Dim: A Multi-Dimensional Face Database Towards the Application of 3D Technology in Real-World Scenarios Three-dimensional (3D) faces are increasingly utilized in many face-related tasks. Despite the promising improvement achieved by 3D face technology, it is still hard to thoroughly evaluate the performance and effect of 3D face technology in real-world applications where variations frequently occur in pose, illumination, expression and many other factors. This is due to the lack of benchmark databases that contain both high precision full-view 3D faces and their 2D face images/videos under different conditions. In this paper, we present such a multi-dimensional face database (namely Multi-Dim) of ... All Recent Publications Face Fingerprints Affective Computing People Faculty Students Alumni News Brl-Life All",
  "content_length": 4134,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:39"
}