{
  "name": "Qilin Sun 0001",
  "homepage": "https://sds.cuhk.edu.cn/en/teacher/489",
  "status": "success",
  "content": "SUN, Qilin | School of Data Science SEARCH SDSÂ Portal Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes SDSÂ Portal CUHK-Shenzhen ç®ä½ä¸­æ SUN, Qilin Assistant Professor Education Background M.S./Ph.D. in Electrical and Computer Engineering, King Abdullah University of Science and Technology (2015-2021) Diploma of Optical and Electronic Information, Huazhong University of Science and Technology (2011-2015) Academic Area Computer Science, Machine Learning and Artificial Intelligence, Computer Vision and Computer Graphics Research Field End-to-end Computational photography, Underwater Imaging, Depth/Transient imaging, Gated Imagingï¼Meta/Diffractive Optics Personal Website https://www.x-mol.com/groups/sun_qilin_imaging Email sunqilin@cuhk.edu.cn Office Room 507a, Daoyuan Building Biography Prof. Qilin Sun is an Assistant Professor at the School of Data Science, the Chinese University of Hong Kong, Shenzhen. He is a member of the Chinese Society and the founder of Point Spread Technology. He was awarded the Shenzhen Artificial Intelligence Award in 2022 and was recognized as the Chunshen Pyramid Outstanding Talent. His research focuses on end-to-end computational imaging camera design, computational imaging, optics, SPAD array imaging, underwater imaging, and scattering medium lidar. During his doctoral studies, he published several first-author papers in top conferences and journals such as ACM TOG, SIGGRAPH, Siggraph Aisa, and CVPR (oral), and served as a reviewer long-termly. He serves as a member of various committees including CAAI Youth Commission, 3DV Committee, Intelligent Unmanned System Modeling and Simulation Special Committee, GAMES Executive Committee, and FOE Youth Editorial Board. He is also the founder of Point Spread Technology which is dedicated to building an end-to-end computational optical platform and providing integrated imaging solutions. He led the mass production of high-speed and high-precision car-grade industrial RGBD cameras for real-time 3D reconstruction (100FPS software clock multiple machine alignment). This achievement enabled small-area, low-power, fully parallel heterogeneous 4KRAW domain BM3D video and ultra-low latency ISP. PERSONAL WEBSITE https://www.x-mol.com/groups/sun_qilin_imaging For long-term recruitment of masters, doctors, postdoctoral fellows, and RAs, please refer to the website above for details. OpenCourseWare GAMES204: Computational Imaging https://games-cn.org/GAMES204/ Academic Publications Haoyu Chen, Zhihua Wang, Yang Yang, Qilin Sun, Kede Ma âLearning a Deep Color Difference Metric for Photographic Imagesâ In Proc. Computer Vision and Pattern Recognition (CVPR), IEEE, 2023. Xiong Dun, Qiang Fu, Haotian Li, Tiancheng Sun, Jian Wang, Qilin Sun* âRecent progress in computational imagingâ ãè®¡ç®æååæ²¿è¿å±ã, å¾åå¾å½¢å­¦åå±å¹´åº¦æ¥åï¼Journal of Image and Graphics, 2022 Xuanyu Zhang, Yongbing Zhang, Ruiqin Xiong, Qilin Sun, Jian Zhang âHerosnet: Hyperspectral explicable reconstruction and optimal sampling deep network for snapshot compressive imagingâ  In Proc. Computer Vision and Pattern Recognition (CVPR), IEEE, 2022. Qilin Sun, C Wang, Q. Fu, X Dun, W Heidrich, âEnd-to-end Complex Lens Design with Differentiable Ray-Tracingâ ACM Transactions on Graphics (Proc. SIGGRAPH), 2021 Qilin Sun, E Tseng, Q. Fu, W Heidrich, F Heide âLearning Rank-1 Diffractive Optics for Single-shot High Dynamic Range Imagingâ In Proc. Computer Vision and Pattern Recognition (CVPR oral), IEEE, 2020. Qilin Sun, J. Zhang, X. Dun, B. Ghanem, Y. Peng and W. Heidrich â End-to-End Learned, Optically Coded Super- resolution SPAD Camera.â ACM Transactions on Graphicsï¼2020 Qilin Sun, X Dun, Y Peng, W Heidrich âOptical coding of SPAD array and its application in compressive depth and transient imagingâ Optoelectronic Imaging and Multimedia Technology, 2019 Y. Peng*, Qilin Sun*, X. Dun*, G. Wetzstein, W. Heidrich and F. Heide (*Joint first authors) â Learned Large Field-of-View Imaging With Thin-Plate Optics.â ACM Transactions on Graphics (Proc. SIGGRAPH Asia), 2019 Qilin Sun, X. Dun, Y. Peng and W. Heidrich âDepth and Transient Imaging with Compressive SPAD Array Cameras.â In Proc. Computer Vision and Pattern Recognition (CVPR), IEEE, 2018. Y. Peng, X. Dun, Qilin Sun, F. Heide and W. Heidrich âFocal sweep imaging with multi-focal diffractive optics.â Internal Conference on Computational Photography (ICCP), IEEE, 2018. Y. Peng, X. Dun, Qilin Sun and W. Heidrich âMix-and-match holography.â ACM Transactions on Graphics (Proc.SIGGRAPH Asia), 2017. Address: 3 - 6 Floor, Dao Yuan Building, 2001 Longxiang Road, Longgang District, ShenzhenE-mail: sds@cuhk.edu.cnWechat Account: cuhksz-sdssds.cuhk.edu.cnCopyright Â© CUHK-Shenzhen School of Data Science",
  "content_length": 7266,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:40"
}