{
  "name": "Qiming Hou",
  "homepage": "http://www.houqiming.net",
  "status": "success",
  "content": "Qiming Hou's Homepage 侯启明 HOU Qiming hqm03ster (at) gmail.com I'm currently an Associate Professor in the Graphics and Parallel Systems Lab, Zhejiang University. I received my BS degree in Academic Talent Program and PhD degree in computer science, both from Tsinghua University. As a part of my PhD program, I spent four years in Microsoft Research Asia as an intern researcher. I've been working on GPGPU programming languages and tools, rendering systems and GPGPU applications. My current research interest is vector graphics rendering, face-tracking, and light transport simulation. Projects QPad, a free text editor Updated SPAP package (7/20/2012) My memory allocator Pre-PG2010 BSGP talk slides (Chinese) Publications Unbiased Photon Gathering for Light Transport Simulation Hao Qin, Xin Sun, Qiming Hou, Baining Guo, Kun Zhou. ACM Transactions on Graphics (SIGGRAPH Asia), 2015, Displaced Dynamic Expression Regression for Real-time Facial Tracking and Animation Chen Cao, Qiming Hou, Kun Zhou. ACM Transactions on Graphics (SIGGRAPH), 2014, Cone Tracing for Furry Object Rendering Hao Qin, Menglei Chai, Qiming Hou, Zhong Ren, Kun Zhou. IEEE TVCG, 2014, Real-time Facial Animation on Mobile Devices Yanlin Weng, Chen Cao, Qiming Hou, Kun Zhou. Graphical Models, 76(3): 172-179, 2014, Scalable Programmable Motion Effects on GPUs Xuezhen Huang, Qiming Hou, Zhong Ren, Kun Zhou. Pacific Graphics 2012 (Computer Graphics Forum) A Shading Reuse Method for Efficient Micropolygon Ray Tracing Qiming Hou, Kun Zhou. ACM Transactions on Graphics (SIGGRAPH Asia 2011) [Preprint] Micropolygon Ray Tracing with Defocus and Motion Blur Qiming Hou, Hao Qin, Wenyao Li, Baining Guo, Kun Zhou. ACM Transactions on Graphics (SIGGRAPH 2010) [Preprint] RenderAnts: Interactive Reyes Rendering on GPUs Kun Zhou, Qiming Hou, Zhong Ren, Minmin Gong, Xin Sun, Baining Guo. ACM Transactions on Graphics (SIGGRAPH Asia 2009), SPAP: A Programming Language for Heterogeneous Many-Core Systems Qiming Hou, Kun Zhou, Baining Guo. Technical Report, Jan, 2010 [Tech Report] Debugging GPU Stream Programs Through Automatic Dataflow Recording and Visualization Qiming Hou, Kun Zhou, Baining Guo. ACM Transactions on Graphics (SIGGRAPH Asia 2009) BSGP: Bulk-Synchronous GPU Programming Qiming Hou, Kun Zhou, Baining Guo. ACM Transactions on Graphics (SIGGRAPH 2008) Radiance Transfer Biclustering for Real-time All-frequency Bi-scale Rendering Xin Sun, Qiming Hou, Zhong Ren, Kun Zhou, Baining Guo. IEEE Transactions on Visualization and Computer Graphics, 2010. Memory-Scalable GPU Spatial Hierarchy Construction Qiming Hou, Xin Sun, Kun Zhou, Christian Lauterbach, Dinesh Manocha, Baining Guo. Technical Report, August, 2009 Real-Time KD-Tree Construction on Graphics Hardware Kun Zhou, Qiming Hou, Rui Wang, Baining Guo. ACM Transactions on Graphics (SIGGRAPH Asia 2008) Fogshop: Real-Time Design and Rendering of Inhomogeneous, Single-Scattering Media Kun Zhou, Qiming Hou, Minmin Gong, John Snyder, Baining Guo, Heung-Yeung Shum. Pacific Graphics 2007, 116-125",
  "content_length": 3048,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:41"
}