{
  "name": "Qin Lin",
  "homepage": "https://qinlincmu.github.io",
  "status": "success",
  "content": "Qin Lin, 林勤 Technology Building, T2 304C, 4230 MLK Blvd., Houston, TX 77204-4021 I am a tenure-track assistant professor and the director of the Assured and Intelligent Robotics (AIR) Lab at the Cullen College of Engineering, University of Houston. I completed my postdoctoral training at the Robotics Institute of Carnegie Mellon University, where my advisor was Prof. John M. Dolan. I earned my Ph.D. degree from Delft University of Technology, the Netherlands under the supervision of Prof. Sicco Verwer and Prof. Jan van den Berg. My research interests lie at the intersection of machine learning, control theory, and formal verification, with the goal of enhancing the reliability of autonomous systems. This website will no longer be updated. Please visit our group’s new website at UH. news Sep 1, 2024 My team has moved to the University of Houston to start a new chapter. Jun 4, 2024 One paper accepted to IEEE CASE 2024. May 10, 2024 Received CSU Faculty Merit Recognition Award, AY 2023-2024. May 3, 2024 After the triumph of our first senior design team last year, my second supervised senior design team secured second place in this year’s engineering school’s annual competition. Their project is building an autonomous delivery cart from scratch. May 1, 2024 One paper accepted to the IEEE Control Systems Letters (L-CSS). Apr 8, 2024 I’m serving as an Associate Editor for IROS 2024. Jan 29, 2024 One paper accepted to ICRA 2024. Jan 10, 2024 I have been invited to serve on an NSF panel. Nov 27, 2023 One paper accepted to IEEE Trans. on Intelligent Transportation Systems. Sep 14, 2023 I will serve as an Associate Editor for IEEE Transactions on Vehicular Technology (TVT). Jul 12, 2023 One paper accepted to CDC 2023. May 26, 2023 I have received a grant award from NSF (“ERI: Operator-Automation Shared Protection for Security and Safety Assured Industrial Control Systems: Learning, Detection, and Recovery Control”, sole-PI, $200,000, 2023-2025, link). May 5, 2023 My very first supervised senior design team secured the top spot in our engineering school’s annual competition. Their project is “Autonomous Nursery Cart”. You will enjoy watching their inspiring story unfold! Mar 3, 2023 One paper accepted to IFAC 2023. Jan 24, 2023 Received a $10,000 subaward from Ohio Cyber Range Institute for cybersecurity research of industrial control systems. Jan 21, 2023 I will serve as an Associate Editor for IROS2023. Jan 19, 2023 One paper accepted to ACC. Dec 28, 2022 I will serve as an Associate Editor for IEEE Robotics and Automation Letters (RA-L). Dec 13, 2022 Our team (PI: Dr. Yongxin Tao, co-PIs: Dr. Qin Lin, Dr. Wenbing Zhao, Dr. Navid Goudarzi) received a grant award ($1M, 2023-2025) from the Department of Education (ED). Jun 30, 2022 Two papers accepted to IROS. Apr 10, 2022 One paper accepted to IV, oral presentation, selection rate: ~10%. Sep 19, 2021 Our team (Shivesh Khaitan, John M. Dolan, and myself) is the winner in the Competition for Motion Planning of Autonomous Vehicles (ITSC 2021), see the announcement and the leaderboard. selected publications Adaptive Planning and Control with Time-Varying Tire Models for Autonomous Racing Using Extreme Learning Machine Dvij Kalaria*, Qin Lin, and John M. Dolan IEEE International Conference on Robotics and Automation, ICRA 2024 [abstract] [video] [link] Autonomous racing is a challenging problem, as the vehicle needs to operate at the friction or handling limits in order to achieve minimum lap times. Autonomous race cars require highly accurate perception, state estimation, planning and precise application of controls. What makes it even more challenging is the accurate identification of vehicle model parameters that dictate the effects of the lateral tire slip, which may change over time, for example, due to wear and tear of the tires. Current works either propose model identification offline or need good parameters to start with (within 15-20% of actual vacdclue), which is not enough to account for major changes in tire model that occur during actual races when driving at the control limits. We propose a unified framework which learns the tire model online from the collected data, as well as adjusts the model based on environmental changes even if the model parameters change by a higher margin. We demonstrate our approach in numeric and high-fidelity simulators for a 1:43 scale race car and a full-size car. Towards Safety Assured End-to-End Vision-Based Control for Autonomous Racing Dvij Kalaria*, Qin Lin, and John M. Dolan IFAC World Congress 2023 [abstract] [video] Autonomous car racing is a challenging task, as it requires precise applications of control while the vehicle is operating at cornering speeds. Traditional autonomous pipelines require accurate pre-mapping, localization, and planning which make the task computationally expensive and environment-dependent. Recent works propose use of imitation and reinforcement learning to train end-to-end deep neural networks and have shown promising results for high-speed racing. However, the end-to-end models may be dangerous to be deployed on real systems, as the neural networks are treated as black-box models devoid of any provable safety guarantees. In this work we propose a decoupled approach where an optimal end-to-end controller and a state prediction end-to-end model are learned together, and the predicted state of the vehicle is used to formulate a control barrier function for safeguarding the vehicle to stay within lane boundaries. We validate our algorithm both on a high-fidelity Carla driving simulator and a 1/10-scale RC car on a real track. The evaluation results suggest that using an explicit safety controller helps to learn the task safely with fewer iterations and makes it possible to safely navigate the vehicle on the track along the more challenging racing line. Delay-aware Robust Control for Safe Autonomous Driving and Racing Dvij Kalaria*, Qin Lin, and John M. Dolan IEEE Transactions on Intelligent Transportation Systems 2023 [abstract] [video] [link] Delays endanger safety of autonomous systems operating in a rapidly changing environment, such as nondeterministic surrounding traffic participants in autonomous driving and high-speed racing. Unfortunately, delays are typically not considered during the conventional controller design or learning-enabled controller training phases prior to deployment in the physical world. In this paper, the computation delay from nonlinear optimization for motion planning and control, as well as other unavoidable delays caused by actuators, are addressed systematically and unifiedly. To deal with all these delays, in our framework: 1) we propose a new filtering approach with no prior knowledge of dynamics and disturbance distribution to adaptively and safely estimate the time-variant computation delay; 2) we model actuation dynamics for steering delay; 3) all the constrained optimization is realized in a robust tube model predictive controller. For the application merits, we demonstrate that our approach is suitable for both autonomous driving and autonomous racing. Our approach is a novel design for a standalone delay compensation controller. In addition, in the case that a learning-enabled controller assuming no delay works as a primary controller, our approach serves as the primary controller’s safety guard. The video demonstration is available online. Motion Planning by Search in Derivative Space and Convex Optimization with Enlarged Solution Space Jialun Li*, Xiaojia Xie, Qin Lin, Jianping He, and John M. Dolan IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2022 [abstract] [video] [link] To efficiently generate safe trajectories for an autonomous vehicle in dynamic environments, a layered motion planning method with decoupled path and speed planning is widely used. This paper studies speed planning, which mainly deals with dynamic obstacle avoidance given a planned path. The main challenges lie in the optimization in a non-convex space and the trade-off between safety, comfort, and efficiency. First, this work proposes to conduct a search in second-order derivative space for generating a comfort-optimal reference trajectory. Second, by combining abstraction and refinement, an algorithm is proposed to construct a convex feasible space for optimization. Finally, a piecewise B ́ezier polynomial optimization approach with trapezoidal corridors is presented, which theoretically guarantees safety and significantly enlarges the solution space compared with the existing rectangular corridors-based approach. We validate the efficiency and effectiveness of the proposed approach in simulations Online Adaptive Compensation for Model Uncertainty Using Extreme Learning Machine-based Control Barrier Functions Emanuel Munoz Panduro*, Dvij Kalaria, Qin Lin, and John M. Dolan IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2022 [abstract] [video] [link] A control barrier functions-based quadratic programming (CBF-QP) method has emerged as a controller synthesis tool to assure safety of autonomous systems owing to the appealing safe forward invariant set. However, the provable safety relies on a precisely described dynamic model, which is not always available in practice. Recent works leverage learning to compensate model uncertainty for a CBF controller. However, these approaches based on reinforcement learning or episodic learning are limited to dealing with time-invariant uncertainty. Also, the reinforcement learning approach learns the uncertainty offline, while episodic learning only updates the controller after a batch of data is available by the end of an episode. Instead, we propose a novel tuning extreme learning machine (tELM)-based CBF controller that can compensate time-variant and time-invariant model uncertainty adaptively in an online manner. We validate our approach’s effectiveness in a simulation of an Adaptive Cruis",
  "content_length": 10023,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:40"
}