{
  "name": "Qing Charles Cao",
  "homepage": "http://web.eecs.utk.edu/~qcao1",
  "status": "success",
  "content": "Charles Qing Cao - Home Charles Qing Cao Home Publications Projects Associate Professor Department of Electrical Engineering and Computer Science University of Tennessee 430 Min Kao Building 1520 Middle Drive Knoxville, TN 37996 Email: cao {at} utk.edu Research Interest AI for Cyber-Physical and IoT Systems Networking and Distributed Systems Cyber Security Recent Talks GenAI and Agricultural Innovations, at Tennessee State University, April 2024. Integrating Edge AI and Blockchain in Precision Dairy Farming: Towards Sustainable and Smart Agricultural Practices, at FEWSUS Conference, 2024. LLM-Assisted Modeling and Simulations for Public Sector Decision-Making: Bridging Climate Data and Policy Insights, at AAAI-2024 Workshop on Public Sector LLMs: Algorithmic and Sociotechnical Design, Feb 2024. Blockchain-based Runtime Attestation against Physical Fault Injection Attacks on Edge Devices, at ACM/IEEE Symposium on Edge Computing (SEC), December 2023. Parity Shadow Stack: Dynamic Instrumentation based Control Flow Security for IoT Devices, at IEEE IPCCC, November 2023. Probabilistic Error Reasoning on IoT Edge Devices, at IEEE International Conference on Edge Computing (EDGE), July 2023. Harnessing Foundation Models for Cybersecurity and Networking Challenges: Bridging the Gap Between AI and Systems, at ORNL, July 2023. Recent Publications 2024 Quality of Surveillance Analysis of LEO Satellite Constellations for Orbital Edge Computing in Precision Agriculture and Climate Monitoring Charles Cao, Jie Zhuang, Joshua Fu, Wenjun Zhou. IEEE IWQoS 2024. LLM-Assisted Modeling and Simulations for Public Sector Decision-Making: Bridging Climate Data and Policy Insights Charles Cao, Jie Zhuang, Qiang He. AAAI-2024 Workshop on Public Sector LLMs: Algorithmic and Sociotechnical Design, 2024. Artificial intelligence and the National Violent Death Reporting System: A Rapid Review. Lisa Lindley, Christina Policastro, Brianne Dosch, Baco Ortiz, Joshua Gabriel, Charles Cao. CIN: Computers, Informatics, Nursing, 2024. 2023 Blockchain-based Runtime Attestation against Physical Fault Injection Attacks on Edge Devices Charles Cao, Jayne Wu, Hairong Qi, Shigetoshi Eda. ACM/IEEE Symposium on Edge Computing (SEC), 2023. Parity Shadow Stack: Dynamic Instrumentation based Control Flow Security for IoT Devices Charles Cao. IEEE IPCCC, November 2023. Probabilistic Error Reasoning on IoT Edge Devices Qing Cao, Yunhe Feng. IEEE International Conference on Edge Computing (EDGE), 2023. More Effective Centrality-Based Attacks on Weighted Networks Mr. Balume S Mburano, Weisheng Si, Qing Cao and Weixing Zheng IEEE International Conference on Communications (ICC), 2023.",
  "content_length": 2678,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:43"
}