{
  "name": "Qing Wang 0002",
  "homepage": "http://users.cecs.anu.edu.au/~u5170295",
  "status": "success",
  "content": "Qing Wang Qing Wang Associate Professor Email: Office:Building 145, Room 4.26 (map) Mail:School of ComputingHanna Neumann Building 145The Australian National UniversityCanberra, ACT 0200Australia Phone:+61 (0)2 6125 4625 Fax:+61 (0)2 6125 0010 Graph Research Lab:(https://graphlabanu.github.io/website/) Home | Education | Student Supervision | Resources for Students | About me Areas of Research I lead the Graph Research Lab at the School of Computing, ANU. My research group primarily works in the following areas: Graph algorithms; Graph machine learning; Data management and analysis; We are seeking self-motivated, enthusiastic doctoral students. Potential applicants may contact me with your CV and academic transcripts. The scholarship is a tax-free allowance of AUD 28,854 per year, tenable for a maximum of 3.5 years. Some Recent Work Fast Fully Dynamic Labelling For Distance Queries M. Farhan, Q. Wang, Y. Lin and B. McKay The VLDB Journal, 2021. ( Paper link ) A Regularized Wasserstein Framework for Graph Kernels A. Wijesinghe, Q. Wang and S. Gould IEEE International Conference on Data Mining (ICDM), 2021. ( Paper link ) Beyond Low-Pass Filters: Adaptive Feature Propagation on Graphs S. Li, D. Kim and Q. Wang The European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML-PKDD), 2021. ( Paper link ) Efficient Maintenance of Distance Labelling for Incremental Updates in Large Dynamic Graphs M. Farhan and Q. Wang The 24th International Conference on Extending Database Technology (EDBT), 2021. ( Paper link | slides ) Query-by-Sketch: Scaling Shortest Path Graph Queries on Very Large Networks Y. Wang, Q. Wang, H. Koehler, and Y. Lin The ACM Special Interest Group on Management of Data (SIGMOD), 2021. ( Preprint | slides ) dK-Projection: Publishing Graph Joint Degree Distribution with Node Differential Privacy M. Iftikhar and Q. Wang The 25th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2021. ( Preprint | slides ) ErGAN: Generative Adversarial Networks for Entity Resolution J. Shao, Q. Wang, A. Wijesinghe, and E. Rahm IEEE International Conference on Data Mining (ICDM), 2020. ( Preprint | Extended Version ) Dynamic Chunkwise CNN for Distantly Supervised Relation Extraction F. Liu and Q. Wang IEEE International Conference on Big Data (IEEE BigData), 2020. ( Paper link ) dK-Microaggregation: Anonymizing Graphs with Differential Privacy Guarantees M. Iftikhar, Q. Wang, and Y. Lin The 24th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2020. ( Preprint | slides ) DFNets: Spectral CNNs for Graphs with Feedback-Looped Filters A. Wijesinghe and Q. Wang Thirty-third Annual Conference on Neural Information Processing Systems (NeurIPS), 2019. ( Preprint | Github Code | Poster ) Learning to Sample: an Active Learning Framework J. Shao, Q. Wang and F. Liu IEEE International Conference on Data Mining (ICDM), 2019. ( Preprint ) CoCoOn: Cloud Computing Ontology for IaaS Price and Performance Comparison Q. Zhang, A. Haller and Q. Wang The 18th International Semantic Web Conference (ISWC), 2019. ( Preprint ) Skyblocking for Entity Resolution J. Shao, Q. Wang and Y. Lin Information Systems, Volume 85, November 2019 (https://doi.org/10.1016/j.is.2019.06.003). ( PDF | Preprint ) Knowledge Tracing with Sequential Key-Value Memory Networks G. Abdelrahman and Q. Wang The 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR), 2019. ( PDF | Preprint ) A Highly Scalable Labelling Approach for Exact Distance Queries in Complex Networks M. Farhan, Q. Wang, Y. Lin, and B. McKay The 22nd International Conference on Extending Database Technology (EDBT), 2019. ( PDF | Preprint | Github Code ) Publishing Differentially Private Datasets via Stable Microaggregation (short paper) M. Iftikhar, Q. Wang, and Y. Lin The 22nd International Conference on Extending Database Technology (EDBT), 2019. ( Preprint ) Repairing of Record Linkage: Turing Errors into Insight (short paper) Q. Bui-Nguyen, Q. Wang, J. Shao, and D. Vatsalan The 22nd International Conference on Extending Database Technology (EDBT), 2019. ( Preprint ) FACH: Fast Algorithm for Detecting Cohesive Hierarchies of Communities in Large Networks M. Rezvani, Q. Wang, and W. Liang The 11th ACM International Conference on Web Search and Data Mining (WSDM), 2018. ( PDF | Preprint ) Attentive Graph-based Recursive Neural Network for Collective Vertex Classification Q. Xu, Q. Wang, C. Xu and L. Qu The 26th ACM International Conference on Information and Knowledge Management (CIKM), 2017. ( PDF ) A Complete Logic for Database Abstract State Machines F. Ferrarotti, K.-D. Schewe, L. Tec, and Q. Wang Logic Journal of the IGPL, 2017. ( PDF ) Flower: A Data Analytics Flow Elasticity Manager A. Khoshkbarforoushha, R. Ranjan, Q. Wang and C. Friedrich The 43rd International Conference on Very Large Data Bases (VLDB), demo paper, 2017. ( PDF ) Improving Temporal Record Linkage using Regression Classification Y. Hu, Q. Wang, D. Vatsalan, and P. Christen The 21st Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2017. ( Abstract | PDF ) Temporal Group Linkage and Evolution Analysis for Census Data V. Christen, A. Groβ, J. Fisher, Q. Wang, P. Christen and E. Rahm The 20th International Conference on Extending Database Technology (EDBT), 2017. ( Abstract | PDF ) Semantic-Aware LSH Blocking for Entity Resolution Q. Wang, M. Cui and H. Liang IEEE Transactions on Knowledge and Data Engineering (TKDE), vol 28(1), 2016. ( Abstract | PDF ) Rogas: A Declarative Framework for Network Analytics M. Liu and Q. Wang The 42nd International Conference on Very Large Data Bases (VLDB), demo paper, 2016. ( Abstract | PDF ) Population Informatics using Big Data (tutorial) P. Christen, H-C. Kum, Q. Wang and D. Vatsalan The 20th Pacific Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2016. ( Slides ) A New Thesis concerning Synchronised Parallel Computing - Simplified Parallel ASM Thesis F. Ferrarotti, K.-D. Schewe, L. Tec and Q. Wang. Theoretical Computer Science (TCS), 2016. ( Abstract | PDF ) A Clustering-based Framework to Control Block Size for Entity Resolution J. Fisher, P. Christen, Q. Wang and E. Rahm Proceedings of the 21st ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2015. ( Abstract | PDF ) Efficient Entity Resolution with Adaptive and Interactive Training Data Selection P. Christen, D. Vatsalan and Q. Wang. IEEE International Conference on Data Mining (ICDM), 2015. ( Abstract | PDF ) Efficient Interactive Training Selection for Large-scale Entity Resolution Q. Wang, D. Vatsalan and P. Christen. The 19th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2015. ( Abstract | PDF | Slides ) A Theoretical Framework for Knowledge-based Entity Resolution K.-D. Schewe and Q. Wang Theoretical Computer Science (TCS), 2014. ( Abstract | PDF ) Network Analytics ER Model:Towards a Conceptual View of Network Analytics Q. Wang The 33rd International Conference on Conceptual Modeling (ER), 2014 (Best Paper Award). ( Abstract | PDF | Slides ) Data Migration: A Theoretical Perspective B. Thalheim and Q. Wang Data and Knowledge Engineering (DKE), Engineering, vol. 87, 260-278, 2013. ( Abstract | PDF )",
  "content_length": 7335,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:44"
}