{
  "name": "Qingming Huang",
  "homepage": "http://people.ucas.edu.cn/~0003060?language=en",
  "status": "success",
  "content": "黄庆明-中国科学院大学-UCAS [中文] [English] Education Experience Publications Research Interests Collaboration General Qingming HuangChair Professor, IEEE FellowSchool of Computer Science and TechnologyUniversity of Chinese Academy of SciencesNo. 19A Yuquan Road, Shijingshan DistrictBeijing 100019, ChinaTel/Fax: +86-10-62600548Email: qmhuang@ucas.ac.cn Research Areas Multimedia Computing, Image/Video Processing, Pattern Recognition, Computer Vision Education 09/1984-07/1988, Harbin Institute of Technology, Computer Science, B.S. 09/1988-08/1994, Harbin Institute of Technology, Computer Engineering, Ph.D. Experience Work Experience 08/1994-05/1995, Harbin Institute of Technology, Lecturer 05/1995-11/1996, National University of Singapore, Postdoctoral Fellow 11/1996-05/2002, Institute for Infocomm Research, Singapore, Member Research Staff 06/2002-05/2003, Vislog Technology Pte Ltd, Singapore, Principal Engineer 05/2003-present, University of Chinese Academy of Sciences, Professor Teaching Experience Pattern RocognitionPattern Rocognition and Machine Learning Pattern Recognition in Image and Video AnalysisVisual Information Learning and Analysis Publications Papers Published more than 400 academic papers in prestigued international journals such as IEEE Trans. on Image Processing, IEEE Trans. on Multimedia, IEEE Trans. on CSVT, and top level international conferences including ACM Multimedia, ICCV, CVPR, ECCV, etc.[1] Xu, Qianqian, Xiong, Jiechao, Cao, Xiaochun, Huang, Qingming, Yao, Yuan. Evaluating Visual Properties via Robust HodgeRank. INTERNATIONAL JOURNAL OF COMPUTER VISION[J]. 2021, 129(5): 1732-1753.[2] Yang, Yifan, Li, Guorong, Du, Dawei, Huang, Qingming, Sebe, Nicu. Embedding Perspective Analysis Into Multi-Column Convolutional Neural Network for Crowd Counting. IEEE TRANSACTIONS ON IMAGE PROCESSING[J]. 2021, 30: 1395-1407.[3] Xu, Kai, Wen, Longyin, Li, Guorong, Qi, Honggang, Bo, Liefeng, Huang, Qingming. Learning Self-Supervised Space-Time CNN for Fast Video Style Transfer. IEEE TRANSACTIONS ON IMAGE PROCESSING[J]. 2021, 30: 2501-2512.[4] Teng, Shangzhi, Zhang, Shiliang, Huang, Qingming, Sebe, Nicu. Viewpoint and Scale Consistency Reinforcement for UAV Vehicle Re-Identification. INTERNATIONAL JOURNAL OF COMPUTER VISION[J]. 2021, 129(3): 719-735.[5] Wu, Yiling, Wang, Shuhui, Song, Guoli, Huang, Qingming. Augmented Adversarial Training for Cross-Modal Retrieval. IEEE TRANSACTIONS ON MULTIMEDIA[J]. 2021, 23: 559-571.[6] Song, Guoli, Wang, Shuhui, Huang, Qingming, Tian, Qi. Harmonized Multimodal Learning with Gaussian Process Latent Variable Models. IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE[J]. 2021, 43(3): 858-872.[7] Teng, Shangzhi, Zhang, Shiliang, Huang, Qingming, Sebe, Nicu. Multi-View Spatial Attention Embedding for Vehicle Re-Identification. IEEE TRANSACTIONS ON CIRCUITS AND SYSTEMS FOR VIDEO TECHNOLOGY[J]. 2021, 31(2): 816-827.[8] Meng, Dechao, Li, Liang, Liu, Xuejing, Li, Yadong, Yang, Shijie, Zha, ZhengJun, Gao, Xingyu, Wang, Shuhui, Huang, Qingming, IEEE. Parsing-based View-aware Embedding Network for Vehicle Re-Identification. 2020 IEEE/CVF CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION (CVPR). 2020, 7101-7110.[9] Yang, Yifan, Li, Guorong, Wu, Zhe, Su, Li, Huang, Qingming, Sebe, Nicu, IEEE. Reverse Perspective Network for Perspective-Aware Object Counting. 2020 IEEE/CVF CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION (CVPR). 2020, 4373-4382.[10] Cui, Shuhao, Wang, Shuhui, Zhuo, Junbao, Li, Liang, Huang, Qingming, Tian, Qi, IEEE. Towards Discriminability and Diversity: Batch Nuclear-norm Maximization under Label Insufficient Situations. 2020 IEEE/CVF CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION (CVPR). 2020, 3940-3949.[11] Wu, Yiling, Wang, Shuhui, Huang, Qingming. Online Fast Adaptive Low-Rank Similarity Learning for Cross-Modal Retrieval. IEEE TRANSACTIONS ON MULTIMEDIA[J]. 2020, 22(5): 1310-1322.[12] Duan, Kaiwen, Du, Dawei, Qi, Honggang, Huang, Qingming. Detecting Small Objects Using a Channel-Aware Deconvolutional Network. IEEE TRANSACTIONS ON CIRCUITS AND SYSTEMS FOR VIDEO TECHNOLOGY[J]. 2020, 30(6): 1639-1652.[13] Yu, Hongyang, Li, Guorong, Zhang, Weigang, Huang, Qingming, Du, Dawei, Tian, Qi, Sebe, Nicu. The Unmanned Aerial Vehicle Benchmark: Object Detection, Tracking and Baseline. INTERNATIONAL JOURNAL OF COMPUTER VISION[J]. 2020, 128(5): 1141-1159.[14] Li, Liang, Zhu, Xinge, Hao, Yiming, Wang, Shuhui, Gao, Xingyu, Huang, Qingming. A Hierarchical CNN-RNN Approach for Visual Emotion Classification. ACM TRANSACTIONS ON MULTIMEDIA COMPUTING COMMUNICATIONS AND APPLICATIONS[J]. 2019, 15(3).[15] Bao, Shilong, Xu, Qianqian, Ma, Ke, Yang, Zhiyong, Cao, Xiaochun, Huang, Qingming, ACM. Collaborative Preference Embedding against Sparse Labels. PROCEEDINGS OF THE 27TH ACM INTERNATIONAL CONFERENCE ON MULTIMEDIA (MM'19). 2019, 2079-2087.[16] Xu, Qianqian, Sun, Xinwei, Yang, Zhiyong, Cao, Xiaochun, Huang, Qingming, Yao, Yuan, Wallach, H, Larochelle, H, Beygelzimer, A, dAlcheBuc, F, Fox, E, Garnett, R. iSplit LBI: Individualized Partial Ranking with Ties via Split LBI. ADVANCES IN NEURAL INFORMATION PROCESSING SYSTEMS 32 (NIPS 2019). 2019.[17] Xu, Qianqian, Yang, Zhiyong, Jiang, Yangbangyan, Cao, Xiaochun, Huang, Qingming, Yao, Yuan, IEEE Comp Soc. Deep Robust Subjective Visual Property Prediction in Crowdsourcing. 2019 IEEE/CVF CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION (CVPR 2019). 2019, 8985-8993.[18] Wu, Zhe, Su, Li, Huang, Qingming. Learning Coupled Convolutional Networks Fusion for Video Saliency Prediction. IEEE TRANSACTIONS ON CIRCUITS AND SYSTEMS FOR VIDEO TECHNOLOGY[J]. 2019, 29(10): 2960-2971.[19] Zhang, Peng, Su, Li, Li, Liang, Bao, BingKun, Cosman, Pamela, Li, GuoRong, Huang, Qingming, ACM. Training Efficient Saliency Prediction Models with Knowledge Distillation. PROCEEDINGS OF THE 27TH ACM INTERNATIONAL CONFERENCE ON MULTIMEDIA (MM'19). 2019, 512-520.[20] Xu, Kai, Wen, Longyin, Li, Guorong, Bo, Liefeng, Huang, Qingming, IEEE Comp Soc. Spatiotemporal CNN for Video Object Segmentation. 2019 IEEE/CVF CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION (CVPR 2019). 2019, 1379-1388. [21] Zhuo, Junbao, Wang, Shuhui, Cui, Shuhao, Huang, Qingming, IEEE Comp Soc. Unsupervised Open Domain Recognition by Semantic Discrepancy Minimization. 2019 IEEE/CVF CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION (CVPR 2019). 2019, 750-759.[22] Liu, Xuejing, Li, Liang, Wang, Shuhui, Zha, ZhengJun, Meng, Dechao, Huang, Qingming, IEEE. Adaptive Reconstruction Network for Weakly Supervised Referring Expression Grounding. 2019 IEEE/CVF INTERNATIONAL CONFERENCE ON COMPUTER VISION (ICCV 2019). 2019, 2611-2620. [23] Wu, Zhe, Su, Li, Huang, Qingming, IEEE Comp Soc. Cascaded Partial Decoder for Fast and Accurate Salient Object Detection. 2019 IEEE/CVF CONFERENCE ON COMPUTER VISION AND PATTERN RECOGNITION (CVPR 2019). 2019, 3902-3911. [24] Yang, Zhiyong, Xu, Qianqian, Zhang, Weigang, Cao, Xiaochun, Huang, Qingming. Split Multiplicative Multi-View Subspace Clustering. IEEE TRANSACTIONS ON IMAGE PROCESSING[J]. 2019, 28(10): 5147-5160.[25] Cong, Runmin, Lei, Jianjun, Fu, Huazhu, Porikli, Fatih, Huang, Qingming, Hou, Chunping. Video Saliency Detection via Sparsity-Based Reconstruction and Propagation. IEEE TRANSACTIONS ON IMAGE PROCESSING[J]. 2019, 28(10): 4819-4831.[26] Xu, Qianqian, Xiong, Jiechao, Cao, Xiaochun, Huang, Qingming, Yao, Yuan. From Social to Individuals: A Parsimonious Path of Multi-Level Models for Crowdsourced Preference Aggregation. IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE[J]. 2019, 41(4): 844-856.[27] Yang, Shijie, Li, Liang, Wang, Shuhui, Zhang, Weigang, Huang, Qingming, Tian, Qi. SkeletonNet: A Hybrid Network With a Skeleton-Embedding Process for Multi-View Image Representation Learning. IEEE TRANSACTIONS ON MULTIMEDIA[J]. 2019, 21(11): 2916-2929.[28] Wu, Zhe, Su, Li, Huang, Qingming, IEEE. Stacked Cross Refinement Network for Edge-Aware Salient Object Detection. 2019 IEEE/CVF INTERNATIONAL CONFERENCE ON COMPUTER VISION (ICCV 2019). 2019, 7263-7272. [29] Wu, Yiling, Wang, Shuhui, Song, Guoli, Huang, Qingming. Online Asymmetric Metric Learning With Multi-Layer Similarity Aggregation for Cross-Modal Retrieval. IEEE TRANSACTIONS ON IMAGE PROCESSING[J]. 2019, 28(9): 4299-4312.[30] Yang, Zhiyong, Xu, Qianqian, Jiang, Yangbangyan, Cao, Xiaochun, Huang, Qingming, Wallach, H, Larochelle, H, Beygelzimer, A, dAlcheBuc, F, Fox, E, Garnett, R. Generalized Block-Diagonal Structure Pursuit: Learning Soft Latent Task Assignment against Negative Transfer. ADVANCES IN NEURAL INFORMATION PROCESSING SYSTEMS 32 (NIPS 2019). 2019, 32. [31] Qi, Yuankai, Zhang, Shengping, Zhang, Weigang, Su, Li, Huang, Qingming, Yang, MingHsuan, AAAI. Learning Attribute-Specific Representations for Visual Tracking. THIRTY-THIRD AAAI CONFERENCE ON ARTIFICIAL INTELLIGENCE. 2019, 8835-8842.[32] Jiang, Yangbangyan, Xu, Qianqian, Yang, Zhiyong, Cao, Xiaochun, Huang, Qingming, ACM. Duet Robust Deep Subspace Clustering. PROCEEDINGS OF THE 27TH ACM INTERNATIONAL CONFERENCE ON MULTIMEDIA (MM'19). 2019, 1596-1604.[33] Jiang, Yangbangyan, Xu, Qianqian, Yang, Zhiyong, Cao, Xiaochun, Huang, Qingming, Wallach, H, Larochelle, H, Beygelzimer, A, dAlcheBuc, F, Fox, E, Garnett, R. DM2C: Deep Mixed-Modal Clustering. ADVANCES IN NEURAL INFORMATION PROCESSING SYSTEMS 32 (NIPS 2019). 2019, 32. [34] Cong, Runmin, Lei, Jianjun, Fu, Huazhu, Cheng, MingMing, Lin, Weisi, Huang, Qingming. Review of Visual Saliency Detection With Comprehensive Information. IEEE TRANSACTIONS ON CIRCUITS AND SYSTEMS FOR VIDEO TECHNOLOGY. 2019, 29(10): 2941-2959.[35] Qi, Yuankai, Zhang, Shengping, Qin, Lei, Huang, Qingming, Yao, Hongxun, Lim, Jongwoo, Yang, MingHsuan. Hedging Deep Features for Visual Tracking. IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE[J]. 2019, 41(5): 1116-1130.[36] Wang, Zitai, Xu, Qianqian, Ma, Ke, Jiang, Yangbangyan, Cao, Xiaochun, Huang, Qingming, ACM. Adversarial Preference ",
  "content_length": 24937,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:44"
}