{
  "name": "Qing Chen 0001",
  "homepage": "https://tjdi.tongji.edu.cn/TeacherDetail.do?id=5056&lang=en",
  "status": "success",
  "content": "同济大学设计创意学院 Site Menu About D&I Message from the DeanMission and VisionCollege ManifestoDevelopment / OverviewManagement TeamStructureFacilities News Study at D&I Educational FrameworkUndergraduate ProgramsMaster ProgramsDoctoral ProgramsExchange ProgrammesLifelong Learning Faculty Alumni & Corporate Partners University-Enterprise CooperationAlumni Research Research Centers/LabsJournal International Cooperation International Network and Partners Contact Us Contact us Join Us CN Faculty CHEN Qing Associate Professor Brief IntroductionQing CHEN is currently an associate professor at Tongji University, entitled in the Shanghai Oversea Talent Program. She received her B.Eng degree and PhD degree from Zhejiang University and Hong Kong University of Science and Technology respectively. After graduation, she worked as a postdoc researcher at INRIA and Ecole Polytechnique. Her research interests lie in information visualization, big data visual analytics, human-computer interaction, generative AI and their applications in education, healthcare, design, and business intelligence, having published extensively on these subjects. She works as the committee member of various top conferences and the community chair for IEEE VIS 2022-2023. She received several awards including CSIG (China Society of Image and Graphics) Natural Science Award, HongKong ICT Best Innovation Silver Award, Asia Pacific ICT Awards. She is the principal investigator of several National Natural Science Funds and a couple of University-Industry Collaboration projects. Research Information VisualizationHuman Computer InteractionGenerative AIBig Data Analytics, and their applications in Online Education, Intelligent Design, AI-powered Healthcare, Business Intelligence. TeachingUndergraduate: Programming Fundamentals for Designers, Information Interaction Design, Information VisualizationGraduate: Introduction to Big Data Visual Analytics, Design Studio 1, Design Studio 2 Academic and social Post2024  IEEE VIS Fast Forward Chair2023-present  Computer Science Review Guest Editor2020-present  CCF Human-Computer Interaction Committee Member2022-2023  IEEE VIS Community Chair2020-present  IEEE VIS/PacificVis/ChinaVis Program Committee Member2020-present  CSIG Visualization and Visual Analytics Committee Member2020-present  CCF YOCSEF Shanghai Academic AC2019  IEEE VIS Session Chair2015-present  ACM CHI, IEEE TVCG, IEEE InfoVis, IEEE VAST, IEEE EuroVis, IEEE PacificVis, ACM TIST, IEEE TLT, ACM IUI Reviewer2015-2018  ACM-W HKUST Chapter Activity Chair Education Background2013.08-2018.08  Ph.D. in Computer Science and Engineering, Hong Kong University of Science and Technology2018.04-2018.06  Visiting Scholar, Inria Saclay2009.09-2013.06  B.Eng in Digital Media Technology, School of Computer Science, Zhejiang University2011.08-2012.04  Exchange Student, School of Interactive Arts and Technology, School of Computer Science, Simon Fraser University Work Experience2023.12-present  Associate Professor, Tongji University2020.02-2023.12  Assistant Professor, Tongji University2018.10-2019.12  Postdoc Researcher, Inria & École Polytechnique2014.08-2018.08  Teaching/Research Assistant, Hong Kong University of Science and Technology Design[1] 2025-2026  Research on LLM-Based Generative UI, supported by Alibaba[2] 2025-2026  AI+Design Knowledge Graph on Design Disciplines, Tongji University[3] 2024-2027  Research on Mixed-Initiative Intelligent Visualization Methods and Techniques, NSF[4] 2023-2026  Information Communication Design for Data Intelligence, NSF Shanghai[5] 2022-2024  Tencent Technology Tree Project, supported by OUTPUT/Tencent[6] 2022-2023  University-Industry Collaborative Education Program, The Ministry of Education[7] 2022-2023  Self-service Analytics System Design for Business Intelligence Applications, supported by AntV[8] 2022-2023  ChenGuang Project, supported by Shanghai Education Development Foundation[9] 2021-2023  Automatic Information Visualization Generation Techniques, NSF[10] 2021-2023  Visual Analytics of Complex Sequence Data, NSF[11] 2021-2023  Visual Analytics of Self-regulated Learning from Online Learning Behavior Data, NSF[12] 2020-2021  AI-based Automatic Visualization Generation, supported by AntV[13] 2018-2020  Dynamic representation of large volumes of care pathways (collaboration with France government CNAMS)[14] 2018-2020  An Open Learning Design, Data Analytics and Visualization Framework for E-Learning ITS/388/17FP[15] 2016-2018  An Open Learning Design, Data Analytics and Visualization Framework for E-Learning ITS/306/15FP[16] 2014-2018  VisMOOC: A Visualization Tool for MOOC F0532-CSE03[17] 2014-2017  Visual Analysis of Customer Loyalty RGC/GRF16208514 Publications[1] He, Y., Xu, K., Cao, S., Shi, Y., Chen, Q., and Cao, N., (2025). Leveraging Foundation Models for Crafting Narrative Visualization: A Survey. IEEE Transactions on Visualization and Computer Graphics.[2] Chen, Q., Chen, Y., Zou R., Shuai, W., Guo Y., Wang J., & Cao, N. (2025). Chart2Vec: A Universal Embedding of Context-Aware Visualizations. IEEE Transactions on Visualization and Computer Graphics, 31(4), 2167-2181.[3] Chen, Q., Shuai, W., Zhang, J., Sun, Z., & Cao, N. (2024). Beyond Numbers: Creating Aalogies to Enhance Data Comprehension and Communication with Generative AI. In Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems.[4] Guo, Y., Shi, D., Guo, M., Wu, Y., Cao, N. * & Chen, Q.* (2024). Talk2Data: A Natural Language Interface for Exploratory Visual Analysis via Question Decomposition. ACM Transactions on Interactive Intelligent Systems.[5] Chen, Q., Chen, N., Shuai, W., Wu, G., Xu, Z., Tong, H., & Cao, N. (2024). Calliope-Net: Automatic Generation of Graph Data Facts via Annotated Node-link Diagrams. IEEE Transactions on Visualization and Computer Graphics, 30(1), 562-572.[6] Guo, Y., Cao, N.*, Cai, L., Wu, Y., Weiskopf, D., Shi, D., & Chen, Q.* (2023). Datamator: An Authoring Tool for Creating Datamations via Data Query Decomposition. Applied Sciences, 13(17), p.9709.[7] Guo, Y., Cao, N., Qi X., Li, H., Shi, D., Zhang J., Chen Q., Daniel Weiskopf. (2023). Enhancing Natural Language-Based Data Exploration with Analysis Pipeline Illustration. IEEE VIS.[8] Chen, Q., Cao, S., Wang, J., & Cao, N. (2023). How Does Automation Shape the Process of Narrative Visualization: A Survey of Tools. IEEE Transactions on Visualization and Computer Graphics.[9] Li, Y., Qi, Y., Shi, Y., Chen, Q., Cao, N., & Chen, S. (2022). Diverse Interaction Recommendation for Public Users Exploring Multi-view Visualization using Deep Learning. IEEE Transactions on Visualization and Computer Graphics, 29(1), 95-105.[10] Lan, X., Wu, Y., Shi, Y., Chen, Q., & Cao, N. (2022, April). Negative emotions, positive outcomes? exploring the communication of negativity in serious data stories. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (pp. 1-14).[11] Chen, Q., Sun, F., Xu, X., Chen, Z., Wang, J., & Cao, N. (2022). Vizlinter: A linter and fixer framework for data visualization. IEEE transactions on visualization and computer graphics, 28(1), 206-216.[12] Guo, S., Jin, Z., Chen, Q., Gotz, D., Zha, H., & Cao, N. (2021). Interpretable anomaly detection in event sequences via sequence matching and visual comparison. IEEE Transactions on Visualization and Computer Graphics, 28(12), 4531-4545.[13] Chen, Q., Yue, X., Plantaz, X., Chen, Y., Shi, C., Pong, T. C., & Qu, H. (2020). ViSeq: Visual Analytics of Learning Sequence in Massive Open Online Courses. IEEE transactions on visualization and computer graphics. 26 (3), 1622-1636.[14] Qu, H., Shi, C., Fu, S., & Chen, Q. (2020). Method and system for analyzing user activities related to a video. U.S. Patent No. 10,616,626. Washington, DC: U.S. Patent and Trademark Office.[15] Guo, S., Jin, Z., Chen, Q., Gotz. D., Zha. H., Cao. N. (2019, December). Visual Anomaly Detection in Event Sequence Data. IEEE BigData 2019.[16] Fekete, J. D., Chen, Q., Feng, Y., & Renault, J. (2019, October). Practical Use Cases for Progressive Visual Analytics. IEEE VIS DISA 2019.[17] Chen, Q., Li, Z., Pong, T. C., & Qu, H. (2019, April). Designing Narrative Slideshows for Learning Analytics. In 2019 IEEE Pacific Visualization Symposium (PacificVis) (pp. 237-246). IEEE.[18] Mu, X., Xu, K., Chen, Q., Du, F., Wang, Y., & Qu, H. (2019). MOOCad: Visual Analysis of Anomalous Learning Activities in Massive Open Online Courses. IEEE EuroVis 2019.[19] Xia, M., Sun, M., Wei, H., Chen, Q., Wang, Y., Shi, L., ... & Ma, X. (2019, April). PeerLens: Peer-inspired Interactive Learning Path Planning in Online Question Pool. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (p. 634). ACM.[20] Chen, Y., Chen, Q., Zhao, M., Boyer, S., Veeramachaneni, K., & Qu, H. (2016, October). DropoutSeer: Visualizing learning patterns in Massive Open Online Courses for dropout reasoning and prediction. In 2016 IEEE Conference on Visual Analytics Science and Technology (VAST) (pp. 111-120). IEEE.[21] Chen, Q., Chen, Y., Liu, D., Shi, C., Wu, Y., & Qu, H. (2015). Peakvizor: Visual analytics of peaks in video clickstreams from massive open online courses. IEEE transactions on visualization and computer graphics, 22(10), 2315-2330.[22] Qu, H., & Chen, Q. (2015). Visual analytics for MOOC data. IEEE computer graphics and applications, 35(6), 69-75.[23] Shi, C., Fu, S., Chen, Q., & Qu, H. (2015, April). VisMOOC: Visualizing video clickstream data from massive open online courses. In 2015 IEEE Pacific visualization symposium (PacificVis) (pp. 159-166). IEEE. Honors and Awards[1] 2025  Visual Data Storytelling Contest Winner[2] 2024  Visual Data Storytelling Contest Honorable Mention[3] 2024  China Data Content Conference – Data Content of the Year[4] 2023  IEEE VIS Best Poster Award[5] 2023  Tongji University Excellent Head Teacher Award[6] 2022  CSIG (China Society of Image and Graphics) Natural Science Award[7] 2022  China Data",
  "content_length": 12431,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:42"
}