{
  "name": "Qing He 0003",
  "homepage": "http://people.ucas.edu.cn/~0000964?language=en",
  "status": "success",
  "content": "何清-中国科学院大学-UCAS [中文] [English] Education Experience Honors & Distinctions Publications Collaboration General Qing He, Male, Chinese, Professor, Ph. D. Supervisor,The Key Laboratory of Intelligent Information Processing,Institute of Computting Technology,Chinese Academay of Sciences,Beijing,China100190Email: heqing@ict.ac.cnTelephone: 8610-62600543Address: Kexueyuan Nan Road No.6, Haidian District, Beijing,ChinaWebpage: http://mldm.ict.ac.cn/ Research Areas Machine Learning; Data Mining Based Cloud Computing; Web Mining;  Artificial Intelligence Education Date Degree University Mayjor 1981.9-1985.7 Bachelor Hebei Normal University Mathematics 1985.8-1987.7 Master Zhengzhou University Mathematics 1997.8-2000.7 Ph. D. Beijing Normal University Fuzzy Mathematics and Artificial Intelligent 2000.8-2002.8 Post Ph. D. Institute of Computing and Technology, CAS Computer Software and Theory St. Petersburg Institute for Informatics and Automation of the Russian Academy of Sciences, Visiting Professor , 2001.11 University of Technology, SydneyUniversity of Technology, Sydney, Visiting Professor, 2003.10 Experience Work Experience Qing He is a Professor at the Institute of Computing Technology, Chinese Academy of Sciences(CAS), and he is a Professor of University of Chinese Academy of Sciences (UCAS). He is also the Vice Secretary of Chinese Association for Artificial Intelligence, the Member of China Computer Federation Artificial Intelligence and Pattern Recognition Committee, the Member of Chinese Insititue of Electronics and Clouding Computing  and Big Data Experts Committee. He received the B.S. degree from Hebei Normal University, Shijiazhuang, P. R. C., in 1985, and the M.S. degree from Zhengzhou University, Zhengzhou, P. R. C., in 1987, both in Mathematics. He received the Ph.D. degree in 2000 from Beijing Normal University in Fuzzy Mathematics and Artificial and Intelligence, Beijing, P. R. C. Since 1987 to 1997, he had been teaching at Hebei University of Science and Technology. He is currently a doctoral supervisor at the Institute of Computing and Technology, CAS. His interests include data mining, machine learning, classification, fuzzy clustering,cloud computing,big data. A series of achievements have been gained in fuzzy information processing, fuzzy clustering, knowledge representation, text information processing, and in big data mining based on cluoud computing. More than 100 papers have been published in journals, 40 of which are SCI Indexed, 66 of which are EI Indexed. Multi-strategy data mining platform MSMiner, Web Intelligent Information Processing software GHunt, Hypersurface Classifier HSC, have been organized and developed. Recently, in cloud computing and big data mining applications, Qing He led his machine learning and data mining team (http://mldm.ict.ac.cn/Home.html), commissioned by the China Mobile Research Institute, developed cloud-based parallel data mining platform by the end of 2008 for mining TB level actual data and achieving high-performance, low-cost data mining. Through this innovation, the country received a proprietary cloud-based data mining techniques. Assembly invited he made a technical report in the second, third, sixth China Cloud Computing Conference. He has presided and completed a number of relevant data mining project supported by the National Natural Science Foundation and 863 projects. Moreover, the projects were rated excellent. He proposed a series of effective data mining algorithms and multiple parallel machine learning algorithms. He organized his team developing forty parallel machine learning algorithms. Multiple big data mining software such as PDMiner,COMS,CWMS and WMCS developed by his team have gotten the software copyright and practical applying to telecommunications, electricity, information security, environmental protection, the financial insurance, and dozens of companies, enterprises with the considerable economic and social benefits. Teaching Experience Professor of  Graduate of Chinese Academey of Sciences Course: Fuzzy Mathematics and Application in Computing Honors & Distinctions 2015 Wenjun Wu Artificial Intelligence Innovation Award2006 Beijing Science Technology Award Publications Papers 一、Conference paper list[1].\tDongbo Xi, Bowen Song, Fuzhen Zhuang, Yongchun Zhu, Shuai Chen, Tianyi Zhang, Yuan Qi, Qing He: Modeling the Field Value Variations and Field Interactions Simultaneously for Fraud Detection. AAAI 2021，virtually February 2-9, 2021.[2].\tFeiyang Pan, Haoming Li, Xiang Ao, Wei Wang, Yanrong Kang, Ao Tan, Qing He.  GuideBoot: Guided Bootstrap for Deep Contextual Bandits in Online Advertising, WWW21，April 12-16, 2021，Ljubljana,Slovenia[3].\tGuoxin Yu, Xiang Ao, Ling Luo, Min Yang, Xiaofei Sun, Jiwei Li and Qing He. Making Flexible Use of Subtasks: A Multiplex Interaction Network for Unified Aspect-based Sentiment Analysis. ACL 2021, findings, virtually August 1-6, 2021, Bangkok, Thailand.[4].\tHaoming Li, Feiyang Pan, Xiang Ao, Zhao Yang, Min Lu, Junwei Pan, Dapeng Liu, Lei Xiao, Qing He. Follow the Prophet: Accurate Online Conversion Rate Prediction In the Face of Delayed Feedback，SIGIR’21，Online，July 11-15, 2021 [5].\tRunchuan Wang, Zhao Zhang, Fuzhen Zhuang, Dehong Gao, Yi Wei, Qing He, Adversarial Domain Adaptation for Cross-lingual Information Retrieval with Multilingual BERT, CIKM’21, November 1–5, 2021, Virtual Event, Australia.[6].\tTianxin Wang,Fuzhen Zhuang,zhiqiang Zhang,Daixin Wang, Jun Zhou,Qing He. Low-dimensional Alignment for Cross-Domain Recommendation, CIKM’21, November 1–5, 2021, Virtual Event, Australia.[7].\tXiang Ao, Xiting Wang，Ling Luo, Ying Qiao, Qing He and Xing Xie. PENS: A Dataset and Generic Framework for Personalized News Headline Generation ， ACL-IJCNLP 2021 main conference，82-92[8].\tYang Liu, Xiang Ao, Zidi Qin, Jianfeng Chi, Jinghua Feng, Hao Yang and Qing He. Pick and Choose: A GNN-based Imbalanced Learning Approach for Fraud Detection, WWW21，April 12-16, 2021，Ljubljana,Slovenia[9].\tYing Sun, Fuzhen Zhuang, Hengshu Zhu, Qing He and Hui Xiong. Cost-Effective and Interpretable Job Skill Recommendation with Deep Reinforcement Learning, WWW21，April 12-16, 2021，Ljubljana, Slovenia[10].\tYing Sun, Hengshu Zhu;_, Chuan Qin, Fuzhen Zhuang, Qing He, Hui Xiong. Discerning Decision-Making Process of Deep Neural Networks with Hierarchical Voting Transformation accepted for a poster presentation at NeurIPS 2021.[11].\tYongchun Zhu, Kaikai Ge, Fuzhen Zhuang, Ruobing Xie, Dongbo Xi, Xu Zhang, Leyu Lin and Qing He. Transfer-Meta Framework for Cross-domain Recommendation to Cold-Start Users，SIGIR’21，Online，July 11-15, 2021[13].\tDongbo Xi, Fuzhen Zhuang, Bowen Song, Yongchun Zhu, Shuai Chen, Dan Hong, Tao Chen, Xi Gu, Qing He. Neural Hierarchical Factorization Machines for User's Event Sequence Analysis. SIGIR20 short paper, July 25-30, 2020, Xi'an, China. [14].\tDongbo Xi, Fuzhen Zhuang, Ganbin Zhou, Xiaohu Cheng, Fen Lin, Qing He. Domain Adaptation with Category Attention Network for Deep Sentiment Analysis. WWW’20, April 20–24, 2020, Taipei，pp.: 3133-3139.[15].\tFeiyang Pan, Xiang Ao, Pingzhong Tang, Min Lu, Dapeng Liu, Lei Xiao and Qing He. Field-aware calibration: a simple and empirically strong method for reliable probabilistic predictions. WWW’20, April 20–24, 2020, Taipei[16].\tQiwei Zhong，Yang Liu，Xiang Ao，Binbin Hu，Jinghua Feng，Jiayu Tang，Qing He. Financial Defaulter Detection on Online Credit Payment via Multi-view Attributed Heterogeneous Information Network，WWW’20, April 20–24, 2020, Taipei[17].\tYongchun Zhu, Dongbo Xi, Bowen Song, Fuzhen Zhuang, Shuai Chen, Gu Xi, and Qing He. Modeling Users’ Behavior Sequences with Hierarchical Explainable Network for Cross-domain Fraud Detection. Proceedings of the Web Conference 2020. pp.: 928-938. WWW’20, April 20–24, 2020, Taipei[18].\tZhao Zhang, Fuzhen Zhuang*, Hengshu Zhu, Zhiping Shi, Hui Xiong, Qing He, Relational Graph Neural Network with Hierarchical Attention for Knowledge Graph Completion. AAAI 2020, Feb.7-12,Newyork USA.[19].\tDongbo Xi, Fuzhen Zhuang, Yanchi Liu, Jingjing Gu, Hui Xiong, Qing He. Modeling Users’ Behavior Sequences with Hierarchical Explainable Network for Cross-domain Fraud Detection, WWW’20, April 20–24, 2020, Taipei[20].\tDongbo Xi, Fuzhen Zhuang*, Yanchi Liu, Jingjing Gu, Hui Xiong, Qing He: Modelling of Bi-directional Spatio-Temporal Dependence and Users' Dynamic Preferences for Missing POI Check-in Identification. AAAI 2019.[21].\tFeiyang Pan, Qingpeng Cai, An-Xiang Zeng, Chun-Xiang Pan, Qing Da, Hualin He, Qing He, Pingzhong Tang. Policy Optimization with Model-based Explorations. AAAI 2019.[22].\tFeiyang Pan, Shuokai Li, Xiang Ao, Pingzhong Tang, Qing He. Warm Up Cold-start Advertisements : Improving  CTR Predictions via Learning to Learn ID Embeddings. To appear in the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2019). [23].\tPan feiyang, Cai, Qi,Tang, Pingzhong, Zhuang, Fuzhen., He, Qing. Policy gradients for contextual recommendations, WWW2019[24].\tYing Sun, Fuzhen Zhuang, Hengshu Zhu, Xin Song, Qing He, Hui Xiong. A Structure-Aware Convolutional Neural Network Approach, KDD2019[25].\tLing Luo, Xiang Ao,Yan Song,Jinyao Li,Xiaopeng Yang,Qing He,Dong Yu, Unsupervised Neural Aspect Extraction with Sememes,IJCAI2019[26].\tYing Sun, Hengshu Zhu, Fuzhen Zhuang, Jingjing Gu and Qing He Exploring the Urban Region-of-Interest through the Analysis of Online Map Search Queries，KDD2018[27].\tGanbin Zhou, Ping Luo, Rongyu Cao, Yijun Xiao, Fen Lin, Bo Chen, Qing He. Tree-Structured Neural Machine for Linguistics-Aware Sentence Generation，The Thirty-Second AAAI Conference on Artificial Intelligence (AAAI-18) ，February 2–7, 2018，New Orleans, Lousiana, USA[28].\tGanbin Zhou, Ping Luo, Yijun Xiao, Fen Lin, Bo Chen, Qing He. Elastic Responding Machine for Dialog Generation with Mechanism Dynamically Selecting，The Thirty-Second AAAI Conference on Artificial Intelligence (AAAI-18) ，February 2–7, 2018，New Orleans, Lousi",
  "content_length": 33010,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:41"
}