{
  "name": "Qingkai Shi",
  "homepage": "https://qingkaishi.github.io",
  "status": "success",
  "content": "Qingkai Shi's Homepage Qingkai Shi, Ph.D. Associate Professor Email Google Scholar DBLP ORCID Twitter Github Publications Teaching CVE Students Services CV (en/Zh) DoCATor Welcome to Qingkai's Homepage Publications | Google Scholar | CVE | Teaching | Students | Services | Curriculum Vitae (en/Zh) Please consider submitting papers to OOPSLA'26, CCS'26, where Qingkai serves on the program committee. 2025/09: Congrats to Jielun for having his work on privacy-preserving static analysis accepted at ASE 2025 and receiving a national postgraduate scholarship. (Paper) 2025/05: Congrats to Bing and Yufan for having their work on securing routing protocols via topology synthesis accepted at CCS 2025. (Paper, Website) 2025/04: Our work on securing network protocol parsers has been accepted at ISSTA 2025. A good demonstration of LLM4SE, reviewers commented. (Paper, More) 2024/11: Our work on language-agnostic static analysis has been accepted at ICSE 2025; the artifact supports 11 programming languages and has been open-sourced at Github. (Paper) 2024/10: Our work received the ACM SIGPLAN and SIGSOFT Distinguished Paper Awards at OOPSLA 2024 (Paper) and ASE 2024 (Paper), respectively. More News… Short Bio Qingkai Shi is an associate professor in the School of Computer Science at Nanjing University. His research focuses on the use of compiler techniques, especially formal program analysis, to rigorously ensure software and network security. He has published extensively at premium venues of programming languages (e.g., PLDI, OOPSLA), cybersecurity (e.g., SP, CCS), and software engineering (e.g., ICSE, ESEC/FSE). His research has received four ACM SIGPLAN or SIGSOFT Distinguished Paper Awards, one Google Research Paper Award, and the Hong Kong Ph.D. Fellowship. Qingkai obtained his Ph.D. from the Hong Kong University of Science and Technology. He co-founded Sourcebrella LLC, where his research was commercialized. He then moved to Ant Group, which acquired Sourcebrella. Qingkai also enjoyed a wonderful period as a postdoctoral researcher at Purdue University, West Lafayette, the United States. Software Security Analysis Static bug scanners automatically detect coding errors and security flaws in software systems before execution. Pinpoint, an industrial-strength bug scanner developed by the group, has found numerous vulnerabilities with many CVEs in mature systems . It was successfully commercialized at Sourcebrella LLC, which was acquired by Ant Group for improving the quality of many products such as Alipay, a digital payment app with over a billion monthly active users. Interested readers can refer to Qingkai's doctoral dissertation and follow-up works, particularly, on path-sensitive sparse dataflow analysis (PLDI'18, ICSE'20a, ICSE'20b, ISSTA'20a, PLDI'21, OOPSLA'22a, TOSEM'23, ICSE'24, PLDI'24, …) as well as approaches to detecting specific bug types (ICSE'19, ISSTA'20b, ISSTA'20c, OOPSLA'21, OOPSLA'22b, ICSE'22, ESEC/FSE'22, TSE'24, SP'24, ICSE'25, OOPSLA'25, SP'26, …). Two ACM Distinguished Paper Awards were awarded for these studies. Keywords: path-sensitive and sparse analysis, memory safety analysis, taint analysis. Network Security Analysis Ensuring network security is vital to safeguarding network systems and preventing cyberattacks. On the foundation of program-analysis-powered fuzz testing (TSE'16, TR'16, ISSTA'20, SP'20, ESEC/FSE'21, ISSTA'21, SP'22, TDSC'23, ASE'24, TOSEM'24, ISSTA'24, …) and binary reverse engineering (SP'23, ESEC/FSE'23, ISSTA'23, ASE'25, …), the research group deeply explores the security aspects of diverse network protocols, including but not limited to communication protocols like TCP and routing protocols like OSPF (CCS'23, SEC'23, OOPSLA'24, ISSTA'25, CCS'25, …). Related techniques from the group have detected both general memory safety issues , such as memory leaks and buffer overruns, and, in particular, silent domain-specific network breaches that do not cause apparent symptoms at runtime . Two ACM Distinguished Paper Awards and a Google Research Paper Award, were received for these studies. Keywords: network protocols, fuzzing, reverse engineering, automated validation. Copyright 2025 Qingkai Shi. Last modified: 2025.10. Edit page | Edit resume | Upload files | Create new page",
  "content_length": 4284,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:45"
}