{
  "name": "Qing Yang 0003",
  "homepage": "https://facultyinfo.unt.edu/faculty-profile?profile=qy0022",
  "status": "success",
  "content": "Faculty Profile | Faculty Information System Skip to main content Faculty Name Search By: Faculty Name Courses Search Qing Yang Title: Associate Professor Department: Computer Science and Engineering College: College of Engineering Discovery Park Building F253 Qing.Yang@unt.edu (940) 565-4899 (Office) (940) 565-2767 (Department) http://cse.unt.edu/~qingyang/ General Information Previous Courses Publications Research Curriculum Vitae Curriculum Vitae Link Education PhD, Auburn University, 2011 Major: Computer Science & Software Engineering Dissertation: Adaptive Connectivity Aware Routing Protocol for Wireless Vehicular Networks Current Scheduled Teaching CSCE 6950.910Doctoral DissertationSpring 2026 CSCE 5520.001Wireless Networks and ProtocolsSpring 2026 CSCE 5520.600Wireless Networks and ProtocolsSpring 2026 CSCE 6950.810Doctoral DissertationFall 2025 CSCE 6940.810Individual ResearchFall 2025 CSCE 4535.401Introduction to Network AdministrationFall 2025 Syllabus Texas Education Code 51.974 (HB 2504) requires each institution of higher education to make available to the public, a syllabus for undergraduate lecture courses offered for credit by the institution. Previous Scheduled Teaching CSCE 6950.910Doctoral DissertationSpring 2025 CSCE 6940.910Individual ResearchSpring 2025 CSCE 4535.001Introduction to Network AdministrationSpring 2025 Syllabus SPOT CSCE 6950.810Doctoral DissertationFall 2024 CSCE 6940.810Individual ResearchFall 2024 CSCE 4520.001Wireless Networks and ProtocolsFall 2024 Syllabus SPOT CSCE 5520.002Wireless Networks and ProtocolsFall 2024 SPOT CSCE 5934.810Directed StudySpring 2024 CSCE 6950.910Doctoral DissertationSpring 2024 CSCE 6940.910Individual ResearchSpring 2024 CSCE 6950.810Doctoral DissertationFall 2023 CSCE 6940.810Individual ResearchFall 2023 CSCE 4520.001Wireless Networks and ProtocolsFall 2023 Syllabus SPOT CSCE 5520.002Wireless Networks and ProtocolsFall 2023 SPOT CSCE 5934.810Directed StudySpring 2023 CSCE 6950.710Doctoral DissertationSpring 2023 CSCE 6940.710Individual ResearchSpring 2023 CSCE 6940.810Individual ResearchSpring 8W2 2023 CSCE 5900.810Special ProblemsSpring 2023 CSCE 5520.001Wireless Networks and ProtocolsSpring 2023 SPOT CSCE 5520.600Wireless Networks and ProtocolsSpring 2023 SPOT CSCE 6950.810Doctoral DissertationFall 2022 CSCE 6940.810Individual ResearchFall 2022 CSCE 3530.001Introduction to Computer NetworksFall 2022 Syllabus SPOT CSCE 5934.710Directed StudySpring 2022 CSCE 6950.710Doctoral DissertationSpring 2022 CSCE 6940.710Individual ResearchSpring 2022 CSCE 5520.001Wireless Networks and ProtocolsSpring 2022 SPOT CSCE 6950.710Doctoral DissertationFall 2021 CSCE 6940.710Individual ResearchFall 2021 CSCE 3530.001Introduction to Computer NetworksFall 2021 Syllabus SPOT CSCE 4999.710Senior ThesisFall 2021 CSCE 6950.710Doctoral DissertationSpring 2021 CSCE 6940.710Individual ResearchSpring 2021 CSCE 3600.002Principles of Systems ProgrammingSpring 2021 Syllabus SPOT CSCE 6933.002Advanced Topics in Computer Science and EngineeringFall 2020 SPOT CSCE 6950.710Doctoral DissertationFall 2020 CSCE 6940.710Individual ResearchFall 2020 CSCE 5950.710Master's ThesisFall 2020 CSCE 3600.002Principles of Systems ProgrammingFall 2020 Syllabus SPOT CSCE 3600.005Principles of Systems ProgrammingFall 2020 Syllabus SPOT CSCE 3600.201Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.202Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.203Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.204Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.205Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.206Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.207Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.208Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.221Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.224Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.235Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.273Principles of Systems ProgrammingFall 2020 SPOT CSCE 3600.285Principles of Systems ProgrammingFall 2020 SPOT CSCE 6950.710Doctoral DissertationSummer 10W 2020 CSCE 6940.710Individual ResearchSummer 5W2 2020 CSCE 5934.710Directed StudySpring 2020 CSCE 6950.710Doctoral DissertationSpring 2020 CSCE 6940.710Individual ResearchSpring 2020 CSCE 4510.001Introduction to Wireless CommunicationsSpring 2020 Syllabus CSCE 5950.710Master's ThesisSpring 2020 CSCE 4999.710Senior ThesisSpring 2020 CSCE 5510.001Wireless CommunicationSpring 2020 CSCE 6950.710Doctoral DissertationFall 2019 CSCE 3530.001Introduction to Computer NetworksFall 2019 Syllabus SPOT CSCE 4890.710Directed StudySpring 2019 CSCE 6940.710Individual ResearchSpring 2019 CSCE 4510.001Introduction to Wireless CommunicationsSpring 2019 Syllabus SPOT CSCE 4999.710Senior ThesisSpring 2019 CSCE 6900.710Special ProblemsSpring 2019 CSCE 5510.001Wireless CommunicationSpring 2019 SPOT CSCE 5510.600Wireless CommunicationSpring 2019 CSCE 6933.710Advanced Topics in Computer Science and EngineeringFall 2018 SPOT CSCE 6940.710Individual ResearchFall 2018 CSCE 6900.710Special ProblemsFall 2018 INFO 6900.703Special ProblemsFall 2018 CSCE 6940.710Individual ResearchSpring 2018 CSCE 4510.001Introduction to Wireless CommunicationsSpring 2018 Syllabus SPOT CSCE 5510.001Wireless CommunicationSpring 2018 SPOT CSCE 5510.600Wireless CommunicationSpring 2018 SPOT CSCE 6940.715Individual ResearchFall 2017 CSCE 6900.715Special ProblemsFall 2017 CSCE 4520.001Wireless Networks and ProtocolsFall 2017 Syllabus SPOT CSCE 5520.001Wireless Networks and ProtocolsFall 2017 SPOT Texas Education Code 51.974 (HB 2504) requires each institution of higher education to make available to the public, a syllabus for undergraduate lecture courses offered for credit by the institution. Published Intellectual Contributions Conference Proceeding Dong, S., Feng, Y., Liang, J., Yang, Q., Lin, Y., Fan, H. (2025). Efficient and Accurate Low-Resolution Transformer Tracking. IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). Song, L., Valentine, W., Yang, Q., Wang, H., Fang, H., Liu, Y. (2024). BB-Align: A Lightweight Pose Recovery Framework for Vehicle-to-Vehicle Cooperative Perception. 2024 IEEE 44th International Conference on Distributed Computing Systems (ICDCS). 1016--1026. Dong, S., Feng, Y., Yang, Q., Huang, Y., Liu, D., Fan, H. (2024). Efficient multimodal semantic segmentation via dual-prompt learning. 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 14196--14203. Qu, D., Carrillo, D., Dhakal, S., Tezerjani, M.D., Qiu, C., Yang, Q. (2024). Location Privacy Protection and 911 Task Allocation in Vehicle-Based via Differential Privacy. 2024 IEEE 100th Vehicular Technology Conference (VTC2024-Fall). 1--5. Mitayeegiri, J., Dong, S., Qiu, C., Yang, Q., Li, X., Fan, H., Huang, Y. (2024). Radio Map Estimation (RME) with Deep Progressive Network. 2024 IEEE 7th International Conference on Multimedia Information Processing and Retrieval (MIPR). Qu, D., Chen, Q., Bai, T., Lu, H., Fan, H., Zhang, H., Fu, S., Yang, Q. (2024). SiCP: Simultaneous Individual and Cooperative Perception for 3D Object Detection in Connected and Automated Vehicles. 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 8905--8912. Gao, D., Ou, L., Chen, Y., Liu, Y., Yang, Q. (2024). ZigRa: Physical-Layer Cross-Technology Communication from ZigBee to LoRa. International Conference on Wireless Artificial Intelligent Computing Systems and Applications. 114--123. Yadav, S., Le, T., Dong, S., Fan, H., Yang, Q., Qiu, C., Huang, Y. (2024). A New Simulation Platform For Learning-Empowered Distributed Sensing. SPIE Defense + Commercial Sensing 2024. Zhu, Y., Liu, N., Yang, Q. A New Approximation Algorithm for Genomic Scaffold Filling Based on Contig. IEEE International Conference on E-health Networking, Application & Services. Liu, W., Liu, Y., Yang, Q., Dong, L. AntiNoise: A Collaborative Sensing Network for Simultaneous Noise Pollution Monitoring and E-Health Management. IEEE International Conference on E-health Networking, Application & Services. Dong, J., Chen, Q., Qu, D., Lu, H., Ganlath, A., Yang, Q., Chen, S., Labi, S. (2023). LiDAR-based Cooperative Relative Localization. 2023 IEEE Intelligent Vehicles Symposium (IV). 1--8. Jiang, B., Cheng, X., Li, Y., Fu, S., Yang, Q., Liu, M., Olvera, A. (2023). Output-Directed Dynamic Quantization for DNN Acceleration. 645-654. International Conference on Parallel Processing (ICPP). Bai, T., Shao, D., He, Y., Fu, S., Yang, Q. (2023). P3: A Privacy-Preserving Perception Framework for Building Vehicle-Edge Perception Networks Protecting Data Privacy. 2023 32nd International Conference on Computer Communications and Networks (ICCCN). 1--10. Tang, S., Wang, S., Fu, S., Yang, Q. (2023). Perception Workload Characterization and Prediction on the Edges with Memory Contention for Connected Autonomous Vehicles. 2023 IEEE International Conference on Edge Computing and Communications (EDGE). 104--114. Liu, X., Liu, X., Yi, Z., Zhou, X., Le, T., Zhang, L., Huang, Y., Yang, Q., Fan, H. (2023). PlanarTrack: A Large-scale Challenging Benchmark for Planar Object Tracking. International Conference on Computer Vision (ICCV). Dhakal, S., Chen, Q., Qu, D., Carillo, D., Yang, Q., Fu, S. (2023). Sniffer Faster R-CNN: A Joint Camera-LiDAR Object Detection Framework with Proposal Refinement. 2023 IEEE International Conference on Mobility, Operations, Services and Technologies (MOST). 1--10. Liu, X., Lin, Y., Yang, Q., Fan, H. (2023). Transferable Adversarial Attack on 3D Object Tracking in Point Cloud. International Conference on Multimedia Modeling (MMM). Tang, S., Whitney, K., Wang, B., Fu, S., Yang, Q. (2022). Characterization of Real-Time Object Detection Workloads on Vehicular Edge. 2022 Fifth International Conference on Connected and Autonomous Driving (MetroCAD). 30--38. Bai, T., Wang, H., Guo, J., Ma, X., Talasila, M., Ta",
  "content_length": 35226,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:44"
}