{
  "name": "Qing Li 0001",
  "homepage": "https://www.comp.polyu.edu.hk/en-us/staffs/detail/7394",
  "status": "success",
  "content": "Home | Department of Computing Skip to main content People Open / close back People Academic and Teaching Staff Emeritus, Honorary, Adjunct and Visiting Appointments Scheme and Programme Leaders Supporting Staff Research Staff and Students Shining Alumni Study Open / close back Study Undergraduate Programmes Open / close menu Bachelor of Science (Hons) in Computer Science Bachelor of Science (Hons) in Enterprise Information Systems Secondary Major in Artificial Intelligence and Data Analytics (AIDA) Student Development and Support Open / close menu Exchange Programmes International Learning Training/ Certification Programme (TCP) Academic Advising System Service-Learning Scholarships and Financial Assistance Taught Postgraduate Programme Open / close menu Master of Science in Blockchain Technology Master of Science in Cybersecurity Master of Science in Metaverse Technology Master of Science in Information Technology Master of Science in Information Systems in Xian Research Postgraduate Programme Open / close menu PhD and MPhil in Computing Hong Kong PhD Fellowship Scheme Joint PhD Programme Subject Offerings IT Facilities Research Open / close back Research Research Groups Research Centres and Labs Projects Highlight External Research Grants Research Postgraduate Study Achievements and Recognitions Open / close back Achievements and Recognitions Competition Awards Best Paper Awards Research Awards Teaching Awards Prestigious Honours Academic Services Collaborations and Services Open / close back Collaborations and Services Joint Laboratory Industrial Collaboration Academic Collaboration Community Services News and Events Open / close back News and Events News COMP 50th Anniversary Open / close menu 50th Anniversary Booklet 50th Anniversary Song Celebration Events & Highlights Corporate Video Logo Design Competition 高中Python程式設計比賽 (Senior Secondary Python Programming Contest) COMP 50 Digital Time Capsule 數碼時光膠囊 Research Seminars and Conferences COMP e-Newsletter Open / close menu Share Your Stories Media Coverage Events About COMP Open / close back About COMP Message from Head Vision, Mission and Core Values World Ranking Departmental Organisation Academic Advisor and Advisory Committee Job Openings Contact Us Quick Access Start main content PolyU Department of Computing Ranks Top100 in the World Rankings PolyU ranked 1st in CoinDesk’s Best Universities for Blockchain 2022 (JUPAS Code: JS3868) Bachelor of Science (Hons) Scheme in Computing and AI (PhD / MPhil) Research Postgraduate Programme Keep abreast of our latest development COMP Newsletter Connect with us on Social Media Distinguished Seminar Series on Data Science & Artificial Intelligence The Power and Vulnerability of Multimodal LLMs Date:14 Nov 2025 (Fri) Time: 11:00 - 12:00 (HKT) Mode: Hybrid* *Seat priority will be given to COMP students and staff first. More Outstanding Alumni Award of PolyU Department of Computing 2025 - Result More COMP e-Newsletter Share Your Stories COMP students, staff, and alumni are encouraged to share their news with the COMP community! Receive a special souvenir with each submission selected for the Newsletter. More What's New What's New COMP Student’s Collaborative Research Wins Best Paper Award at ACIRA 2025 We are delighted to announce that a collaborative research paper, featuring a COMP undergraduate student, ZHEN Zhang Alex, and our Senior Lecturer, Dr MOHAMMED Aquil Mirza, as co-authors, has received the prestigious Best Paper Award at the 2025 International Conference on Advanced Computing and Intelligent Robotics Applications (ACIRA 2025), held in Guangzhou, China, from 7- 9 November 2025. The paper, titled \"Texture-Based Classifi 24 Nov 2025 HKXRA x PolyU MScMT Best Project Awards cum XR Dialogue Successfully Held at PolyU We collaborated with the Hong Kong Extended Reality Association (HKXRA), proudly co-hosted the “HKXRA x PolyU MScMT Best Project Awards cum XR Dialogue” on 17 November 2025. The event celebrated outstanding student innovation in extended reality (XR) and fostered dialogue on the future of immersive technologies. A highlight of the event was the panel discussion, “Powering the Future of Cultural Tourism Through XR,” featuring distingui 20 Nov 2025 Prof. Zhang Lei and Prof. Cheng Ran Recognised in “Highly Cited Researchers 2025” List by Clarivate Analytics We are proud to announce that two of our esteemed academic staff have been recognised in the prestigious “Highly Cited Researchers 2025” list by Clarivate Analytics. This international accolade highlights their significant contributions and broad influence in the fields of engineering and computer science. Prof. ZHANG Lei, Chair Professor of Computer Vision and Image Analysis Prof. Zhang has been named a Highly Cited Researcher (HCR) i 13 Nov 2025 Prof. WU Yujie Honoured with China Brain-Machine Intelligence Rising Star Award at 2025 World Young Scientist Summit We are proud to announce that Prof. WU Yujie, our Assistant Professor and Presidential Young Scholar, has been honoured with the prestigious Brain-inspired Intelligence Award, a category of the inaugural “China Brain-Machine Intelligence Rising Star Awards.” The award ceremony was held during the 2025 World Young Scientist Summit on 24 October 2025 in Wenzhou, Zhejiang Province. Six outstanding young scientists under the age of 40 were 3 Nov 2025 COMP UG Students Win Best Student Paper Award at IEEE ICNSC 2025 Conference We are proud to announce that a team of undergraduate students from the COMP 4436 course (Artificial Intelligence of Things) has been awarded the Best Student Paper Award at the 22nd IEEE International Conference on Networking, Sensing, and Control (ICNSC), held from October 1–3, 2025 in Oulu, Finland. The winning paper, titled “Energy-Efficient and High-Accuracy AIoT Visual Sensing Using K-Vote, Transfer-Spiking Net, and Reconstructive 31 Oct 2025 PhD Student SHEN Leming received the Distinguished Artifact Reviewer Award Multiple Times in Top-Tier International Conferences (ACM CCS 2025, ACM SenSys 2024, and ACM MobiSys 2024) We are delighted to share that our PhD student, Mr SHEN Leming, has been honoured with the Distinguished Artifact Reviewer Award at the 2025 ACM Conference on Computer and Communications Security (CCS 2025). This prestigious recognition highlights his contributions to ensuring the reproducibility, reliability, and scientific rigor of research artifacts in the computer security community. Mr SHEN conducts research at the intersection of La 21 Oct 2025 Faculty Awards for Outstanding Achievement 2025 We are proud to announce that three distinguished members of our department have been recognised with the Faculty Awards for Outstanding Achievement 2025, presented by the Faculty of Computer and Mathematical Sciences (FCMS), celebrating their exceptional contributions in teaching and research. Award Recipients: Prof. AU Man Ho Allen, Professor and Associate Head (Research and Development) Individual Award in Research and Scholarly A 16 Oct 2025 Prof. Andy Chun Appointed as a Member of Advisory Committee on Development of International Aviation Superhub We are proud to announce that Prof. Andy Chun, our Professor of Practice, has been appointed by the HKSAR Government as a member of the newly established Advisory Committee on Development of International Aviation Superhub (ACDIAS). The ACDIAS, chaired by Ms Mable Chan, Secretary for Transport and Logistics, brings together distinguished leaders from aviation, finance, technology, logistics, academia, and tourism. The Committee will play a p 3 Oct 2025 17 COMP Academic Staff Recognised Among World’s Top 2% Scientists 2025 by Stanford University and Elsevier We are proud to announce that 17 of our academic staff have been named among the World’s Top 2% Scientists 2025, as compiled by Stanford University and Elsevier. This prestigious recognition highlights the outstanding research achievements and global impact of COMP scholars across a wide range of computing disciplines. The Stanford University list identifies the world’s leading researchers, representing approximately 2% of all scientists wor 30 Sep 2025 COMP Showcases Digitalising Cultural Heritage Project with Metaverse and AI Innovation to the Financial Secretary at DELF 2025 COMP proudly participated as a Pioneering Innovation Partner at the Digital Entertainment Leadership Forum (DELF) 2025, organised by Cyberport from 12 to 14 September 2025. The event attracted over 3,800 participants from business, academia, and the wider community, providing a vibrant platform for exchanging ideas and showcasing cutting-edge technologies. During the morning session on 12 Sep, the COMP booth was honoured by the visit of Mr P 16 Sep 2025 HKXRA x PolyU MScMT Best Project Awards cum XR Dialogue Successfully Held at PolyU We collaborated with the Hong Kong Extended Reality Association (HKXRA), proudly co-hosted the “HKXRA x PolyU MScMT Best Project Awards cum XR Dialogue” on 17 November 2025. The event celebrated outstanding student innovation in extended reality (XR) and fostered dialogue on the future of immersive technologies. A highlight of the event was the panel discussion, “Powering the Future of Cultural Tourism Through XR,” featuring distingui 20 Nov 2025 Prof. Zhang Lei and Prof. Cheng Ran Recognised in “Highly Cited Researchers 2025” List by Clarivate Analytics We are proud to announce that two of our esteemed academic staff have been recognised in the prestigious “Highly Cited Researchers 2025” list by Clarivate Analytics. This international accolade highlights their significant contributions and broad influence in the fields of engineering and computer science. Prof. ZHANG Lei, Chair Professor of Computer Vision and Image Analysis Prof. Zhang has been named a Highly Cited Researcher (HCR) i 13 Nov 2025 Prof. WU Yujie Honoured with China Brain-Machine Intelligence Rising Star Award at 2025 World Young Scientist Summit We are proud to announce that Prof.",
  "content_length": 14900,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:42"
}