{
  "name": "Qinggang Meng",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/qinggang-meng",
  "status": "success",
  "content": "Qinggang Meng | Computer Science | Loughborough University Professor Qinggang Meng Fellow of HEA, Senior Member of IEEE, PhD, MSc, BSc Professor of Robotics and Artificial Intelligence Department Director of Research REF2021 UoA11 (Computer Science and Informatics) Submission Lead Theme Leader of Vision, AI, Autonomous and Human Centred Systems Research groups and centres Publications +44 (0) 1509 635 676 Send email Office: N.2.07 (Haslegrave Building) Personal website Biography Research External activities Publications Editorial board I am a Professor of Robotics and Artificial Intelligence in the Department of Computer Science, Loughborough University.  Before joining Loughborough University, I worked as a postdoctoral research associate for 4 years in bio-inspired robotics/developmental robotics in University of Wales, Aberystwyth(UWA), UK. I obtained my PhD from the Department of Computer Science, UWA in the area of AI and robotics. Before I came to the UK, I did one year RA in City University of Hong Kong. Before that, I was working in Intelligent Machine Institute at Tianjin University for several years in the area of intelligent robotics. I have relatively wide research interests in robotics, unmanned aerial vehicles, driverless vehicles, networked systems, ambient assisted living, computer vision, AI and pattern recognition, machine learning and deep learning, both in theory and applications. THREE new Postdoctoral positions available from Summer 2018. Due to several new grants, I need three postdoctoral researchers in robotics, AI, machine learning and image processing. PDRA1 will work on navigation and control of agricultural robots. PDRA2 will work on AI and machine learning for pollution monitoring. PDRA3 will work on image processing and defect detection on patterned textiles. Three industry sponsored EPSRC CDT-EI PhD studentships available to start from Sept 2018 in AI, computer vision, robotics and autonomous systems. Further details may be found at: https://www.lboro-robotics.org NEWS: we will host the EPSRC UK-RAS (Robotics and Autonomous Systems) conference on 24 Jan 2019 at Loughborough, here is the conference link. FIVE postdoctoral researcher (PDRA) positions in AI, machine learning, computer vision and robotics are available in 2019. Three  positions can be found here.  Another two in AI/machine learning for finance risk prediction, AI/computer vision for human movement analysis will be available soon. **** We are recruiting postdoctoral researchers  for various research projects. So if you are interested in joining us to work in the areas of AI, robotics, computer vision and embedded intelligence, please send me your CV *** Grants: \"Neuromorphic memristive circuits to simulate inhibitory and excitatory dynamics of neuron networks: from physiological similarities to deep learning\", (CoI), EPSRC, EP/S032843/1,  £965,567, Jan 2020 - Jan 2023. \"JADE: Joint Academic Data science Endeavour - 2\", (CoI, Loughborough PI), EPSRC, 5,539,933, 01 January 2020-31 December 2023. \"Embedded AI and computer vision for real-time quality monitoring of automatic food processing\", KTP project (PI), £250,451, 2021-2024 (Research Associate needed) \"AI platform for strategic planning and operational decision-making for companies in the fast-moving consumer goods sector\", KTP project, (CoI), 2021-2023, £197,792. \"Connected and intelligent device for personalised diagnostic, treatment and management of sleep breathing disorders\", Innovate UK, Qinggang Meng (PI), Loughborough University, SNOOZEAL LIMITED, £428K in total, from July 2019. One PDRA is available. AI and Machine Learning for Financial Risk Analysis, KTP project from June 2019 for 24 months. Qinggang Meng (PI). One Research Associate available, salary up to £50K p.a. \" Novel real-time algorithms and system architecture for defect detection on patterned textiles\", Qinggang Meng  (PI), Innovate UK, £421,482 in total. Three partners: Loughborough University, Shelton Machines Ltd (SML), Burberry Group Plc, from summer 2018. One PDRA post will be available soon. “Triple-Network Air Quality Monitoring and Carbon Credit Trading Platform for Sustainable Urban Environments”,  PI,  Newton Fund, £470K in total. Four partners: Loughborough University, Satochi Systems Ltd,  Shenzhen Institutes of Advanced Technology (SIAT)-Chinese Academy of Sciences, EEGSmart Intelligent Technology Co. Ltd., from Aug. 2018. One PDRA post will be available soon. “AgriRobot: Autonomous agricultural robot system for precision spraying”, £499,964,  Innovate UK,  PI, April 2018—March 2020, total £840k for the project, Jiangsu-UK Industrial Challenge Programme. Four partners—Loughborough University; Innova Integra Limited; Jiangsu University; Nantong Guangyi Mechanical & Electrical Co. Ltd. One PDRA post is available now. “YOBAN- a companion robot to assist walking, sitting down and standing up for older people”, Qinggang Meng (PI), 1st April 2017-30th March 2019, £380,227 to Loughborough University/Dept. Computer Science, total £1.1M. Newton Fund – China-UK Research and Innovation Bridges. KTP project: ARM and Loughborough University,  Qinggang Meng (Co-I),  3 April 2017 to 02 April 2019, £230,194, to Loughborough University/Dept. Computer Science. “Stabilisation and walking in a bipedal robot based on the Flexmotor”, Qinggang Meng (PI), 1 July 2016-30 June 2020, £40,000 to Loughborough University/Dept. Computer Science, EPSRC CDT-EI and Motion Robotics Ltd. “Video based feature extraction and object tracking”, Qinggang Meng (PI), £70,000,  SUKE INTEL, Sept 2017-Aug 2018. \"Towards more autonomy for unmanned vehicles: situational awareness and decision making under uncertainty\", Qinggang Meng (Co-I), EPSRC, 1 March 2012-31 Dec 2016,  £1,006,188 (£1M).  I led WP bio-inspired multi-vehicle cooperation and decision making. “To optimise the design, implementation and deployment of an intelligent CCTV video forensic tool using multi-core processors”, Qinggang Meng (Co-I),  £121,160,  TSB, KTA, Oct 2011—Sept 2013. Leading  multi-core image/video  processing. “Highly autonomous and safe mining robot”, China State Administration of Foreign Experts Affairs, GDT20163200052, support travel and accommodation for visiting China University of Mining and Technology for total 3 months, 2016-2017. “On objective shooting quality assessment methods for stereo cameras based on stereo camera sources”,  National Natural Science Foundation of China, Qinggang Meng (Co-I), Grant number: 61471260, 850K RMB, 01, 2015-12, 2018. “Developmental robotic writing control driven by enhanced constraint-lifting algorithms”, National Natural Science Foundation of China, Qinggang Meng (Co-I), 220K RMB,  Grant No. 61203336, 01.2013-12, 2015. “Integrative computation for autonomous agents: a novel approach based on the vertebrate brain”, 2005-2010, EPSRC, £1,893,234 (£1.89M) (as a PDRA). “Developmental learning algorithms for embedded agents,” 2002- 2005. EPSRC, £208,307 (As a PDRA). Research areas Biologically and psychologically inspired robotics, developmental robotics Robot learning and adaptation Machine learning, deep learning Verification and validation of autonomous systems Service robotics, assistive robotics Computer vision, human motion analysis and activity recognition Multi-UAV/UGV cooperation, distributed consensus algorithms for networked systems Driver's distraction detection, car active safety Situational awareness and decision making for driverless vehicles Human activity pattern learning and abnormal behaviour detection, ambient assisted living (AAL) Associate editor (AE), 2019 IEEE International Conference on Robotics and Automation (ICRA 2019), May 20-24, 2019 Montreal, Canada.  ICRA is the IEEE Robotics and Automation Society's flagship conference. Associate editor (AE), 2018 IEEE International Conference on Robotics and Automation (ICRA 2018), 21-25 May 2018, Brisbane Associate editor (AE), 2017 IEEE International Conference on Robotics and Automation (ICRA 2017), May 29 to June 3, 2017, Singapore. Associate editor (AE), 2016 IEEE International Conference on Robotics and Automation (ICRA 2016), May 16 - May 21, 2016, Stockholm, Sweden. Associate editor (AE), 2015 IEEE International Conference on Robotics and Automation (ICRA 2015), May 26-30, 2015 at the Washington State Convention Centre in Seattle, WA, USA. Associate editor (AE), 2014 IEEE International Conference on Robotics and Automation (ICRA 2014), May 31 - June 7, 2014  Hong Kong, China Program Chair, 10th International Symposium on Computer Science in Sport (IACSS 2015), September 09-11, 2015, UK. PC member, the 2016 IEEE Conference on Robotics and Biomimetics (ROBIO 2016), December 3-7, 2016 Invited Speaker, the 14th annual Unmanned Aerial Systems, 17th -18th, November 2014, London. PC member, The 2014 IEEE International Conference on Robotics and Biomimetics, IEEE Robio 2014  December 5 to 10, 2014 at Melia Hotel in Hanoi, Vietnam. PC member, 2014 IEEE International Conference on Information and Automation, IEEE ICIA 2014, Hailar, Hulun Buir, Inner Mongolia, China, July 26 - 31, 2014 PC member, 2014 2014 4th IEEE International Conference on Information Science and Technology, 26-28 April, China. PC member, 2013 IEEE international conferences on System, Man, and Cybernetics, Manchester, UK PC member, 2012 the Fifth International Conference on Advanced Computational Intelligence (ICACI2012) PC member, 2012 IEEE International Conference on Robotics and Biomimetics (ROBIO 2012) PC member, 2012 IEEE World Congress on Computational Intelligence , Fuzz-IEEE 2012, IEEE-CEC 2012, IJCNN 2012, Hybrid Special Session on Computational Intelligence for Cognitive Robotics PC member, Workshop on Digital Media and its Application in Museum & Heritage (DMAMH): DMAMH 09,  DMDCM 2010,DMDCM-2011 PC member, IEEE Conference on Automation Science and Engineering,  2008 Technical committee member for FUZZ-IEEE 2008, CEC 2008; Reviewer for Fuzz-IEEE 2010 PC member, Int",
  "content_length": 13391,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:44"
}