{
  "name": "Qing Hu",
  "homepage": "http://www.rle.mit.edu/thz/people/qing-hu",
  "status": "success",
  "content": "Qing Hu Home News People Research Publications and Presentations Courses Contact Millimeter-wave and Terahertz Devices Group Professor Qing Hu Qing Hu - Back to People Listing - Previous Qing Hu Professor of Electrical Engineering qhu@mit.edu | RLE Bio Professor Qing Hu is a principal investigator in the Research Laboratory of Electronics (RLE) at the Massachusetts Institute of Technology (MIT). He received his B.A. from Lanzhow University in 1981 and his Ph.D. in physics from Harvard University in 1987. From 1987 to 1989, he was a postdoctoral associate at University of California, Berkeley. He joined the MIT faculty in 1990 in the Department of Electrical Engineering and Computer Science. He was promoted to full professor in 2002, and was appointed to Distinguished Professor of EECS in 2014. Professor Hu has made significant contributions to physics and device applications over a broad electromagnetic spectrum from millimeter wave, THz, to infrared frequencies. Among those contributions, the most distinctive is his development of high-performance terahertz (THz) quantum cascade lasers (QCLs). Now this breakthrough has already found applications in heterodyne receiver technology and real‐time THz imaging, which was also pioneered by his group. He is a Fellow of the Optical Society of America (OSA), a Fellow of the American Physical Society (APS), a Fellow of the Institute of Electrical and Electronics Engineers (IEEE), and a Fellow of the American Association for the Advancement of Science (AAAS). He is the recipient of 2012 IEEE Photonics Society William Streifer Scientific Achievement Award, 2015 Nick Holonyak Jr. Award from OSA, and 2018 Kenneth J. Button Prize from the International Society of Infrared, Millimeter, and Terahertz Waves. He has been an Associate Editor of Applied Physics Letters during 2006-2014 and a Deputy Editor since 2015, and was the co-chair of 2006 International Workshop on Quantum Cascade Lasers. Professor Hu’s current research interests focus on the development of high-temperature, high-power, high beam-quality, and broadly tunable THz QCLs; THz amplifiers; QCL frequency combs; ultrafast time- and phase-resolved study of dynamics in quantum structures; sensing and real-time imaging THz systems for a variety of applications including remote sensing, biomedical imaging, and security. Home News People Research Publications and Presentations Courses Contact Copyright © Massachusetts Institute of Technology\t- Accessibility",
  "content_length": 2490,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:45"
}