{
  "name": "Qing Wang 0007",
  "homepage": "https://www.st.ewi.tudelft.nl/qing",
  "status": "success",
  "content": "Qing Wang Qing Wang (汪 庆) Associate Professor Coordinator, MSCA-DN Project ANT on Embedded AI Embedded Systems (ES) Group Faculty of Electrical Engineering, Mathematics, and Computer Science (EEMCS) Delft University of Technology (TU Delft) Email: qing.wang [at] tudelft.nl Office: 2.W.700, West 2nd floor, Building 28 Address: Van Mourik Broekmanweg 6, 2628 XE Delft, The Netherlands I am an Associate Professor in the Embedded Systems Group of the Department of Software Technology, EEMCS, TU Delft, The Netherlands. My current research interests include Embedded AI / TinyML Systems, Visible Light Communication, and 6G Networks. I am co-founder of the Delft Embedded AI Lab and Coordinator of the MSCA-DN project ANT on Embedded AI. I co-founded OpenVLC, an open-source research platform for visible light communication and sensing networks. I am a senior member of IEEE, an executive committee member of the IEEE Benelux COM/VT Chapter, a board member of Benelux WIC, a co-chair of the Dutch CompSys \"Systems for AI / AI for Systems\" working group, and a member of ACM. News [11/2025]   One paper conditionally accepted by ACM MobiCom'26 [11/2025]   Paper SMoFi accepted by AAAI'26 [11/2025]   Our proposal/initiative “Systems Meet AI” has received funding from 4TU.NIRICT [09/2025]   Paper Flick accepted by NeurIPS'25 [09/2025]   Invited to serve on the TPC of ACM CoNEXT'26 [08/2025]   Invited to serve on the TPC of ACM MobiCom'26 [06/2025]   Invited to serve as DATE'26 Sub-Track Co-Chair (A6 Applications of AI Systems) [06/2025]   Invited to serve on the TPC of ACM SenSys'26 [03/2025]   Paper NIRF accepted by ACM MobiCom'25 [12/2024]   Promoted to Associate Professor! [11/2024]   Paper SolarML accepted by DATE'25 [06/2024]   Spectrum Painting won the Best Paper Award of IEEE WoWMoM'24 [04/2024]   MSCA DN Project ANT on Embedded AI funded through HORIZON-MSCA-DN-2023 (as Coordinator) [04/2024]   Paper ShuffleFL accepted by ACM IMWUT/UbiComp [02/2024]   Paper EVLeSen (In-Vehicle Sensing) accepted by ACM MobiCom'24 [01/2024]   Paper FedTrans accepted by ICLR'24 [09/2023]   BLoB won the Best Paper Award of EWSN'23 [08/2023]   Two papers (Screen Perturbation and DancingAnt) accepted by ACM MobiCom'23 [05/2023]   MSCA SE project HarmonicAI on privacy-preserving AI funded through HORIZON-MSCA-SE-2022 [05/2023]   TAIS won the Best Paper Award of IEEE ICC'23 (top 16 out of 2778 submissions) [05/2023]   Paper When VLC Meets Under-Screen Camera accepted by ACM MobiSys'23 [03/2023]   MSCA DN Project 6thSense on 6G Networks funded through HORIZON-MSCA-DN-2022 Awards 2024: Best Paper Award, IEEE WoWMoM'24 (1/79) 2023: Best Paper Award, EWSN'23 (1/56) 2023: Best Paper Award, IEEE ICC'23 (16/2778) 2022: Best Paper Award, ACM SenSys'22 (1/208) 2022: Best Paper Award, ACM Morse'22 (1/6) 2022: Best Paper Runner-Up, EWSN'22 (3/46) 2020: Best Paper Runner-Up (Honourable Mention Award), ACM MobiCom'20 (3/384) 2019: Best Paper Award, IEEE COMSNETS'19 (1/105) 2016: Best Paper Runner-Up, ACM CoNEXT'16 (4/196) 2016: First Prize in the 1st China Shenzhen Innovation Competition of International Talents - EU Division (1/155) 2014: Chinese Government Award for Outstanding Self-Financed Students Abroad (Only two recipients in Spain) Services Technical Program Committee 2026: MobiCom'26, SenSys'26, CoNEXT'26, SECON'26 2025: MobiSys'25, CoNEXT'25, INFOCOM'25, DATE'25 2024: MobiCom'24, INFOCOM'24, SECON'24, IoTDI'24 2023: INFOCOM'23, SECON'23, IoTDI'23, ICDCS'23 Organizing Committee 2026: MedComNet'26 (TPC Co-Chair), DATE'26 (Sub-Track TPC Co-Chair) 2025: EWSN'25 (General Co-Chair), ACM MobiSys'25 (Sponsorship Co-Chair) 2024: Benelux SITB'24 (General Co-Chair), ACM MobiSys'24 (Rising Stars Forum Co-Chair), IEEE ICNP'24 (Travel Grant Co-Chair), IEEE MASS'24 (Poster & Demo Co-Chair) 2023: ACM MobiCom'23 (Finance Chair), ACM MobiSys'23 (Rising Stars Forum Co-Chair), WIC Mid-Winter Meeting'23 (Co-Chair), Benelux SITB'23 (General Co-Chair), CompSys'23 (General Co-Chair), IEEE ICNP'23 (Poster & Demo Co-Chair) 2022: ACM SIGCOMM'22 (Student Research Competition Co-Chair), IEEE ICNP'22 (Poster & Demo Co-Chair), ACM EMDL'22 Workshop (Co-Chair), ACM EmergingWireless'22 Workshop (Co-Chair) Short Bio From June 2017 to March 2020, I was an (FWO) Postdoctoral Researcher in the Networked Systems Group at KU Leuven of Belgium. Prior to that, I was a Postdoctoral Researcher in the ENS Group at TU Delft. I received my Ph.D. degree from the IMDEA Networks Institute as well as the University Carlos III of Madrid in 2016, and my B.E. and M.S. degrees from the University of Electronic Science and Technology of China (UESTC) in 2008 and 2011, respectively.",
  "content_length": 4672,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:44"
}