{
  "name": "Qiongkai Xu",
  "homepage": "https://xuqiongkai.github.io",
  "status": "success",
  "content": "Towards Trustworthy AI | Qiongkai Xu Towards Trustworthy AI Dr. Qiongkai Xu is a lecturer at Macquarie University, having earned his PhD from the Australian National University and previously served as a research fellow at the University of Melbourne. His research primarily focuses on Natural Language Processing, Privacy & Security, Machine Learning and Data Mining. Recently, his attention has been directed towards auditing machine learning models, specifically in two areas: 1) identifying and addressing privacy and security issues in ML/NLP models and their applications and 2) developing comprehensive evaluation theory and methods for ML/NLP models from various perspectives. If you’re passionate about these research topics, I would love to hear your thoughts and ideas. Email: qiongkai.xu[at]mq.edu.au Latest News [Oct, 2025] We are grateful to the support from Google Cloud Research Credits Program on our Anti-BAD competition at IEEE SaTML 2026! [Sep, 2025] Congratulations to Zihan and our team on receiving a seed grant from Macquarie University Incubator! [Sep, 2025] I am honored to serve as an Area Chair for ICLR! [Aug, 2025] Four papers on “Patient Claim Evaluation”, “Adversarial RAG Defense”, “LLM Backdoor Defense” and “Privacy-Preserving Text Rewriting” have been accepted to EMNLP 2025! [Jun, 2025] Our paper: “IDT: Dual-Task Adversarial Attacks for Privacy Protection” has been accepted to Computational Linguistics (CL)! Congrats to Pedro and all co-authors! [May, 2025] Three papers on “Data Inversion Attack”, “Embedding Watermark” and “Cross-Lingual Backdoor Attack” have been accepted to ACL 2025! [May, 2025] Big thanks to FSE Travel Funding and looking forward to seeing you in Vienna! [Jan, 2025] One demo paper on Emergency Healthcare has been accepted to WWW 2025! We look forward to discussing the project with you in Sydney! [Dec, 2024] Congratulations to my students, Anudeex and Zihan, granted prestegious scholarships, CIS PhD scholarship and DFCRC scholarship, respectively! [Sep, 2024] “Seeing the Forest through the Trees: Data Leakage from Partial Transformer Gradients” is accepted to EMNLP 2024. Congratulations to Weijun and team! [Sep, 2024] I am fortunate to have won the Research Pitching Session at Macquarie University for the second time! [Sep, 2024] Our paper: “Generative Models are Self-Watermarked: Declaring Model Authentication through Re-Generation” is accepted to Transactions on Machine Learning Research (TMLR)! Congrats to Aditya and all co-authors! Selected Publications Generative Models are Self-Watermarked: Declaring Model Authentication through Re-Generation, Aditya Desu, Xuanli He, Qiongkai Xu, Wei Lu. Transactions on Machine Learning Research (TMLR), Sep 2024. Here’s a Free Lunch: Sanitizing Backdoored Models with Model Merge, Ansh Arora, Xuanli He, Maximilian Mozes, Srinibas Swain, Mark Dras, Qiongkai Xu. In Findings of the Association for Computational Linguistics: ACL 2024 (Findings-ACL), Aug 2024. Security Challenges in Natural Language Processing Models. Qiongkai Xu, Xuanli He. In Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP): Tutorial Abstracts, Dec 2023. Rethinking Round-Trip Translation for Machine Translation Evaluation, Terry Yue Zhuo, Qiongkai Xu, Xuanli He, Trevor Cohn. In Findings of the Association for Computational Linguistics: ACL (Findings-ACL), Jul 2023. Humanly Certifying Superhuman Classifiers, Qiongkai Xu, Christian Walder, Chenchen Xu. In Proceedings of the Eleventh International Conference on Learning Representations (ICLR), May 2023. CATER: Intellectual Property Protection on Text Generation APIs via Conditional Watermarks. Xuanli He, Qiongkai Xu, Yi Zeng, Lingjuan Lyu, Fangzhao Wu, Jiwei Li, Ruoxi Jia. In Proceedings of the 36th Conference on Neural Information Processing Systems (NeurIPS), Nov 2022. Student Surpasses Teacher: Imitation Attack for Black-Box NLP APIs. Qiongkai Xu, Xuanli He, Lingjuan Lyu, Lizhen Qu, Gholamreza Haffari. In Proceedings of the 29th International Conference on Computational Linguistics (COLING), Oct 2022. Personal Information Leakage Detection in Conversations. Qiongkai Xu, Lizhen Qu, Zeyu Gao, Gholamreza Haffari. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), Nov 2020. Adhering, Steering, and Queering: Treatment of Gender in Natural Language Generation, Yolande Strengers, Lizhen Qu, Qiongkai Xu, Jarrod Knibbe In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI), Apr 2020. Deep Neural networks for Learning Graph Representations. Shaosheng Cao, Wei Lu, Qiongkai Xu. In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), Feb 2016. GraRep: Learning Graph Representations with Global Structural Information, Shaosheng Cao, Wei Lu, Qiongkai Xu In Proceedings of the 24th ACM international on conference on information and knowledge management (CIKM), Oct 2015.",
  "content_length": 4971,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:46"
}