{
  "name": "Qiong Zeng",
  "homepage": "https://qiongzn.github.io",
  "status": "success",
  "content": "Dr. Qiong Zeng's homepage Qiong Zeng Associate Researcher School of Computer Science and Technology Shandong University Email: qiong dot zn AT sdu.edu.cn Biography Teaching Publications Research Biography I am currently an Associate Professor in the Interdisciplinary Research Center (IRC) at School of Computer Science and Technology, Shandong University. Prior to this role, I held a postdoctoral position at the same university under the guidance of Prof. Baoquan Chen. I earned my Ph.D. in Software Engineering from Shandong University, supervised by Prof. Changhe Tu. My undergraduate studies were completed at Nanchang University, where I obtained a Bachelor's degree in Digital Media Technology with a minor in Public Relations. My research focuses on fundamental theories in interaction and visualization, aiming to explore human interaction and perception mechanisms and leverage them to design efficient and effective visual representations. Specifically, I am interested in adaptive color computing, data compression and neural representations, and high-quality scientific rendering and visualization. I am actively seeking self-motivated Master's and Ph.D. students to collaborate on research projects such as color perception and cognition for scientific visualization, interactive visual exploration of ocean data and cryo-EM data. Teaching sd01332210 Practices on Big Data Analysis sd01332120\t\tIntroduction to Artificial Intelligence sd01331980 Visualization Techniques Selected Publications Hongxu Liu, Xinyu Chen, Haoyang Zheng, Manyi Li, Zhenfan Liu, Fumeng Yang, Yunhai Wang, Changhe Tu, Qiong Zeng*. Self-Supervised Continuous Colormap Recovery from a 2D Scalar Field Visualization without a Legend. IEEE VIS 2025. [Project Page] Yiming Shao, Chengming Liu, Zhiyuan Meng, Shufan Qian, Peng Jiang, Yunhai Wang, Qiong Zeng*. 2024 IEEE Scientific Visualization Contest Winner: PlumeViz: Interactive Exploration for Multi-Facet Features of Hydrothermal Plumes in Sonar Images. IEEE Computer Graphics and Applications 2025. [Preprint Paper], [Project Page] Zhiyuan Meng, Yunpeng Yang, Qiong Zeng*, Kecheng Lu, Lin Lu, Changhe Tu, Fumeng Yang, Yunhai Wang. Seeing Through the Overlap: The Impact of Color and Opacity on Depth Order Perception in Visualization. ACM CHI 2025. [Project Page] Kecheng Lu, Lihang Zhu, Yunhai Wang*, Qiong Zeng, Weitao Song, Khairi Reda. Color-Name Aware Optimization to Enhance the Perception of Transparent Overlapped Charts. IEEE Tansactions on Visualization and Computer Graphics, 2025. [Project Page] Zhiyi Pan, Peng Jiang*, Qiong Zeng, Ge Li, Changhe Tu. Category-agnostic Semantic Edge Detection by Measuring Neural Representation Randomness. Pattern Recognition, 2024. Qiu Zhou#, Manyi Li#, Qiong Zeng*, Andreas Aristidou, Xiaojing Zhang, Lin Chen, Changhe Tu*. Let's All Dance: Enhancing Amateur Dance Motions. Computational Visual Media, 2023. [paper], [Project Page], [Codes] Qiong Zeng, Yongwei Zhao, Yinqiao Wang, Jian Zhang, Yi Cao, Changhe Tu, Ivan Viola, Yunhai Wang. Data-Driven Colormap Adjustment for Exploring Spatial Variations in 2D Scalar Field. IEEE Tansactions on Visualization and Computer Graphics, 2022. [paper], [Project Page], [Codes] Qiong Zeng, Yinqiao Wang, Jian Zhang, Wenting Zhang, Changhe Tu, Ivan Viola, Yunhai Wang. Data-Driven Colormap Optimization for 2D Scalar Field Visualization. IEEE VIS Short Papers, 2019. [paper], [Project Page] Wenting Zhang, Yinqiao Wang, Qiong Zeng, Yunhai Wang, Guoning Chen, Tao Niu, Changhe Tu, Yi Chen. Visual Analysis of Haze Evolution and Correlation in Beijing. Journal of Visualization (ChinaVis'18), 2019. [paper] Qiong Zeng*, Wenzheng Chen*, Zhuo Han, Mingyi Shi, Yanir Kleiman, Daniel Cohen-Or, Baoquan Chen, Yangyan Li. Group Optimization for Multi-attribute Visual Embedding. Visual Informatics, 2018 . ( * Joint first authors) [paper], [Project Page] Andreas Aristidou, Qiong Zeng, Efstathios Stavrakis, Kangkang Yin, Daniel Cohen-Or, Yiorgos Chrysanthou, Baoquan Chen. Emotion Control of Unstructured Dance Movements. ACM SIGGRAPH/ Eurographics Symposium on Computer Animation, SCA'17. Eurographics Association, 2017. [paper], [project page] Qiong Zeng, Wenzheng Chen, Huan Wang, Changhe Tu, Daniel Cohen-Or, Dani Lischinski, Baoquan Chen. Hallucinating Stereoscopy from a Single Image. Computer Graphics Forum, 34(2), 2015 (Proc.Eurographics 2015). [paper], [project page] Qiong Zeng, Ralph R. Martin, Lu Wang, Jonathan A. Quinn, Yuhong Sun, Changhe Tu. Region-based Bas-relief Generation from a Single Image. Graphical Models, 76(3), pp140-151, 2014. [paper] Research Color Design for Visualization: color is the most extensively used encoding element in visualization. However, color design is often considered as a trial-and-error process, in which designers try different color schemes and select an appropriate one with subjective perceptual decisions. This process is often tedious, time-consuming and hardly to extend. Focusing on those problems, our project aims to explore a quantitative color effectiveness metric and intelligent color design methods with consideration of data, task and user in visualization. We propose a solution composed of task-driven color effectiveness metric, perception-aware automatic color design and interaction-aware adaptive color design. Our research topics include: (1) task-driven color effectiveness metric, building correlations among data, task and color effectiveness; (2) perception-aware automatic color design, building automatic color computing schemes with perceptual constraints; (3) interaction-aware adaptive color design, building adaptive color computing schemes based on interactive constraints in multiscalar and time-series data. [Color Design Survey Browser, paper (Chinese)] Computer Science and Technology, Shandong University, No.72, Binhai Road, Jimo, Qingdao, Shandong, China.",
  "content_length": 5869,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:46"
}