{
  "name": "Qirun Zhang",
  "homepage": "http://helloqirun.github.io",
  "status": "success",
  "content": "Qirun Zhang Qirun Zhang Catherine M. and James E. Allchin Early Career Associate Professor School of Computer ScienceGeorgia Institute of Technology Office: Klaus Advanced Computing Building 2324 Email: qrzhang@gatech.edu [Research Interests] [Publications] [Projects] [Courses] [Service] [Students] [Misc] My group has open positions for Fall 2026. Please drop me an email (with your transcript) if you are interested. I am looking for motivated students to work with. If you are interested, please feel free to contact me. For prospective students, I follow the same principle outlined in Prof. Alex Daglis's note—after many years as next-door office neighbors (and counting), some principles are bound to rub off, even if my research area is different. Research Interests My research interests are in the areas of programming languages and software engineering, specifically focusing on techniques for improving software reliability and security. In particular, I enjoy working on program analysis and compiler optimization problems from perspectives such as computational complexity, analytic combinatorics, graph theory, and formal languages. Publications Cryptonite: Scalable Accelerator Design for Cryptographic Primitives and Algorithms Karthikeya Sharma, Camille Bossut, Andy Wanna, Qirun Zhang, Callie Hao In Proceedings of International Conference on Application-Specific Systems Architectures and Processors (ASAP), 2025. Robustifying Debug Information Updates in LLVM via Control Flow Conformance Analysis Shan Huang, Jingjing Liang, Ting Su, Qirun Zhang In Proceedings of Programming Language Design and Implementation (PLDI), 2025. Fast Constraint Synthesis for C++ Function Templates Shuo Ding, Qirun Zhang In Proceedings of Object Oriented Programming Systems Languages and Applications (OOPSLA), 2025. Retrieving Unknown SMT Formulas via Structural Mutations Shuo Ding, Qirun Zhang In Proceedings of Vivek Sarkar Festschrift Symposium (VIVEKFEST), 2024. The Normalization Barrier Revisited Shuo Ding, Qirun Zhang In Proceedings of Jens Palsberg Festschrift Symposium (JENSFEST), 2024. SMT Theory Arbitrage: Approximating Unbounded Constraints using Bounded Theories Benjamin Mikek, Qirun Zhang In Proceedings of Programming Language Design and Implementation (PLDI), 2024. Context-Free Language Reachability via Skewed Tabulation Yuxiang Lei*, Camille Bossut*, Yulei Sui, Qirun Zhang In Proceedings of Programming Language Design and Implementation (PLDI), 2024. Mutual Refinements of Context-Free Language Reachability Shuo Ding, Qirun Zhang In Proceedings of the International Static Analysis Symposium (SAS), 2023. Speeding up SMT Solving via Compiler Optimization Benjamin Mikek, Qirun Zhang In Proceedings of the Symposium on Foundations of Software Engineering (FSE), 2023. (SIGSOFT Distinguished Paper Award) Recursive State Machine Guided Graph Folding for Context-Free Language Reachability Yuxiang Lei, Yulei Sui, Shin Hwei Tan, Qirun Zhang In Proceedings of Programming Language Design and Implementation (PLDI), 2023. Witnessability of Undecidable Problems Shuo Ding, Qirun Zhang In Proceedings of Symposium on Principles of Programming Languages (POPL), 2023. Single-Source-Single-Target Interleaved-Dyck Reachability via Integer Linear Programming Yuanbo Li, Qirun Zhang, Thomas Reps In Proceedings of Symposium on Principles of Programming Languages (POPL), 2023. Studying and Understanding the Tradeoffs Between Generality and Reduction in Software Debloating Qi Xin, Qirun Zhang, Alex Orso In Proceedings of International Conference on Automated Software Engineering (ASE), 2022. Taming Transitive Redundancy for Context-Free Language Reachability Yuxiang Lei, Yulei Sui, Shuo Ding, Qirun Zhang In Proceedings of Object Oriented Programming Systems Languages and Applications (OOPSLA), 2022. (Distinguished Artifact Award) Static Inference Meets Deep Learning: A Hybrid Type Inference Approach for Python Yun Peng, Cuiyun Gao, Zongjie Li, Bowei Gao, David Lo, Qirun Zhang, Michael Lyu In Proceedings of International Conference on Software Engineering (ICSE), 2022. Fast Graph Simplification for Interleaved Dyck-Reachability. Yuanbo Li, Qirun Zhang, Thomas Reps In ACM Transactions on Programming Languages and Systems (TOPLAS), 2022. Invited Paper. Efficient Algorithms for Dynamic Bidirected Dyck-Reachability Yuanbo Li, Kris Satya, Qirun Zhang In Proceedings of Symposium on Principles of Programming Languages (POPL), 2022. On the Complexity of Bidirected Interleaved Dyck-Reachability Yuanbo Li, Qirun Zhang, Thomas Reps In Proceedings of Symposium on Principles of Programming Languages (POPL), 2021. Subdomain-Based Generality-Aware Debloating Qi Xin, Myeongsoo Kim, Qirun Zhang, Alex Orso In Proceedings of International Conference on Automated Software Engineering (ASE), 2020. Debug Information Validation for Optimized Code Yuanbo Li, Shuo Ding, Qirun Zhang, Davide Italiano In Proceedings of Programming Language Design and Implementation (PLDI), 2020. Fast Graph Simplification for Interleaved Dyck-Reachability. Yuanbo Li, Qirun Zhang, Thomas Reps In Proceedings of Programming Language Design and Implementation (PLDI), 2020. (PLDI Distinguished Paper Award) Invited to ACM TOPLAS. Program Debloating via Stochastic Optimization Qi Xin, Myeongsoo Kim, Qirun Zhang, Alex Orso In Proceedings of International Conference on Software Engineering (ICSE), NIER Paper, 2020. Practical GUI Testing of Android Applications via Model Abstraction and Refinement Tianxiao Gu, Chengnian Sun, Xiaoxing Ma, Chun Cao, Chang Xu, Yuan Yao, Qirun Zhang, Jian Lu and Zhendong Su In Proceedings of International Conference on Software Engineering (ICSE), 2019. Calling-to-Reference Context Translation via Constraint-Guided CFL-Reachability Cheng Cai, Qirun Zhang, Zhiqiang Zuo, Khanh Nguyen, Harry Xu and Zhendong Su In Proceedings of Programming Language Design and Implementation (PLDI), 2018. Perses: Syntax-Guided Program Reduction Chengnian Sun, Yuanbo Li, Qirun Zhang, Tianxiao Gu and Zhendong Su In Proceedings of International Conference on Software Engineering (ICSE), 2018. Skeletal Program Enumeration for Rigorous Compiler Testing Qirun Zhang, Chengnian Sun and Zhendong Su In Proceedings of Programming Language Design and Implementation (PLDI), 2017. Context-Sensitive Data-Dependence Analysis via Linear Conjunctive Language Reachability Qirun Zhang and Zhendong Su In Proceedings of Symposium on Principles of Programming Languages (POPL), 2017. Toward Understanding Compiler Bugs in GCC and LLVM Chengnian Sun, Vu Le, Qirun Zhang, and Zhendong Su In Proceedings of International Symposium on Software Testing and Analysis (ISSTA), 2016. Efficient Subcubic Alias Analysis for C Qirun Zhang, Xiao Xiao, Charles Zhang, Hao Yuan, and Zhendong Su In Proceedings of Object Oriented Programming Systems Languages and Applications (OOPSLA), 2014. Persistent pointer information Xiao Xiao, Qirun Zhang, Jinguo Zhou, and Charles Zhang In Proceedings of Programming Language Design and Implementation (PLDI), 2014. Fast Algorithms for Dyck-CFL-Reachability with Applications to Alias Analysis Qirun Zhang, Michael R. Lyu, Hao Yuan, and Zhendong Su In Proceedings of Programming Language Design and Implementation (PLDI), 2013. Flow-Augmented Call Graph: A New Foundation for Taming API Complexity Qirun Zhang, Wujie Zheng and Michael R. Lyu In Proceedings of Fundamental Approaches to Software Engineering (FASE), 2011. Cross-Library API Recommendation Using Web Search Engines Wujie Zheng, Qirun Zhang, and Michael R. Lyu In Proceedings of the Symposium on Foundations of Software Engineering (FSE), New Ideas Track, 2011. Random Unit-Test Generation with MUT-aware Sequence Recommendation Wujie Zheng, Qirun Zhang, Michael Lyu, and Tao Xie In Proceedings of the International Conference on Automated Software Engineering (ASE), Short Paper, 2010. Projects SLOT: SMT-LLVM Optimizing Translation Refinements of Context-Free Language Reachability Context-Free Language Reachability with Transitive Redundancy Elimination Dynamic Bidirected Dyck-Reachability Debug Information Validation Graph Simplification for Interleaved Dyck-Reachability Syntax-Directed Program Reduction Skeletal Program Enumeration Compiler Bug Study Pestrie RecGen Flow-Augmented Call Graph Courses CS 4240 Compilers and Interpreters (Fall, 2025) CS 4240 Compilers and Interpreters (Spring, 2025) CS 6340 Software Analysis and Test (Fall, 2024) CS 6340 Software Analysis and Test (Summer, 2024) CS 4240 Compilers and Interpreters (Spring, 2024) CS 6340 Software Analysis and Test (Fall, 2023) CS 4240 Compilers and Interpreters (Spring, 2023) CS 6340 Software Analysis and Test (Fall, 2022) CS 4240 Compilers and Interpreters (Spring, 2022) CS 6340 Software Analysis and Test (Fall, 2021) CS 4240 Compilers and Interpreters (Spring, 2021) CS 8803 Topics in Program Analysis (Fall, 2020) CS 8803 Topics in Program Analysis (Fall, 2019) ECS 122A Algorithm Design and Analysis (Summer Session 2, 2017) Service Posters Chair: SPLASH'25 Artifact Evaluation Co-Chair: PLDI'26, PLDI'25 Workshops Co-Chair: SPLASH'24 Program Committee: PLDI'26, POPL'26, SAS'25, ASPLOS'25, SAS'24, FSE'24, PLDI'24, CAV'24, OOPSLA'23, FSE'23, PLDI'22, POPL'22, APLAS'21, ICSE'21, FSE'20, PLDI'20, ISSTA'19, SETTA’17, POPL-SRC’17 External Review Committee: PLDI'19, PLDI'18 Artifact Evaluation Committee: ISSTA’18, PLDI’17, ISSTA’17 Conference Paper Reviewer: POPL'24, TACAS'19, POPL’18, CC’17, ISSTA’17, CAV’17, ICSE’17, ICDT’16, CAV’15, OOPSLA’15, FSE’15, ICSE’14, ISSTA’14, FSE’14, OOPSLA’13, WWW’10 Journal Paper Reviewer: TOPLAS'22, TOSEM'22, TSE'22, SCP'21, TSE'19, JSS'18, TACO'18, TOSEM'18, TOPLAS'18, TSE’18, TACO’16, TOPLAS’15 Students Current Ph.D. students Camille Bossut (2022.2 - ) Benjamin Mikek (2021.8 - ) FSE Distinguished Paper Award, 2023 I am also working with the following student(s) at GT: Jinghao Jiang (MS student, 2024.10 - ) Tejas Joshi (MS student, 2024.8 - ) Graduated Ph.D. Students Shu",
  "content_length": 11518,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:46"
}