{
  "name": "Qizhen Zhang 0001",
  "homepage": "https://qizhenzhang.me",
  "status": "success",
  "content": "Qizhen Zhang's Homepage Research Today's largest data processing workloads are hosted in cloud data centers. Due to unprecedented data growth, these workloads have ballooned to hyperscale level, encompassing billions to trillions of data items and hundreds to thousands of machines per query. Enabling and expanding with these workloads are highly scalable data center networks that connect up to hundreds of thousands of networked servers. At hyperscale, the classic layered designs are no longer sustainable: without knowing how their data is transferred in the network, applications can make egregious decisions in executions; the cloud infrastructure also performs poorly without rethinking the interfaces and services exposed to its applications. Rather than optimize these massive layers in silos, I build systems across them with principled network-centric designs for efficient hyperscale data processing. In current networks, we design data processing systems by adopting network awareness. Considering data center network characteristics in optimizing distributed operations effectively reduces communication cost at hyperscale. We built GraphRex [SIGMOD '19], the first system that systematically adopts network awareness for large-scale graph processing. We also proposed TeShu [CIDR '23], a shuffle layer that encompasses network-aware optimizations and offers them to a variety of distributed data processing systems with templates. For future networks, we improve the interfaces and services that the cloud infrastructure offers to applications and codesign data processing systems to achieve optimal performance. In particular, we have been pioneering the work on data processing in disaggregated data centers (DDCs), a promising new cloud proposal. We opened the topic by rethinking data processing system designs in DDCs [CIDR '20] and, for the first time, investigated the effect of DDCs on production systems [VLDB '20], which opened a broad space of research opportunities. We proposed TELEPORT [SIGMOD '22], a novel compute pushdown feature of DDCs for efficient data processing. To realize DDC benefits in today’s clouds, I developed Redy [VLDB '22] with industry. More recently, we applied disaggregated designs to improve resource efficiency for blockchain workloads with FlexChain [VLDB '23] and proposed Cowbird [SIGCOMM '23] to reduce CPU cost in disaggregating memory. To facilitate network innovation, we must evaluate the performance of network proposals at scale. This, however, is intractable because of network size and complexity. To support our work and that of others, we developed MimicNet [SIGCOMM '21], the first scalable system that provides accurate performance estimates for data center networks. It models network behavior in FatTree topologies with machine learning techniques and composes large-scale simulations with intra- and inter-cluster approximations. I have also worked on other aspects of data processing, including data science application with machine learning [CIKM '17], and data processing cost efficiency [SoCC '17]. Recently, I proposed CompuCache [CIDR '22], a new cloud service that exploits spot VMs for remote caching and memory-intensive compute offloading. Publications * students I advise at FDL SaTE: Low-Latency Traffic Engineering for Satellite Networks Hao Wu, Yizhan Han, Mohit Rajpal, Qizhen Zhang, Jingxian Wang Annual Conference of the ACM Special Interest Group on Data Communication, SIGCOMM 2025, to appear dpBento: Benchmarking DPUs for Data Processing Jiasheng Hu*, Chihan Cui*, Anna Li*, Raahil Vora*, Yuanfan Chen*, Philip A. Bernstein, Jialin Li, Qizhen Zhang arXiv:2504.05536, 2025 An Empirical Study of the Impact of Federated Learning on Machine Learning Model Accuracy Haotian Yang*, Zhuoran Wang*, Benson Chou*, Sophie Xu*, Hao Wang, Jingxian Wang, Qizhen Zhang arXiv:2503.20768, 2025 DPDPU: Data Processing with DPUs [arXiv] Jiasheng Hu*, Philip Bernstein, Jialin Li, Qizhen Zhang Conference on Innovative Data Systems Research, CIDR 2025 DDS: DPU-optimized Disaggregated Storage Qizhen Zhang, Philip Bernstein, Badrish Chandramouli, Jiasheng Hu*, Yiming Zheng* International Conference on Very Large Data Bases, VLDB 2024 Computing in the Era of Large Generative Models: From Cloud-Native to AI-Native Yao Lu, Song Bian, Lequn Chen, Yongjun He, Yulong Hui, Matthew Lentz, Beibin Li, Fei Liu, Jialin Li, Qi Liu, Rui Liu, Xiaoxuan Liu, Lin Ma, Kexin Rong, Jianguo Wang, Yingjun Wu, Yongji Wu, Huanchen Zhang, Minjia Zhang, Qizhen Zhang, Tianyi Zhou, Danyang Zhuo arXiv:2401.12230, 2024 Cowbird: Freeing CPUs to Compute by Offloading the Disaggregation of Memory Xinyi Chen, Liangcheng Yu, Vincent Liu, Qizhen Zhang Annual Conference of the ACM Special Interest Group on Data Communication, SIGCOMM 2023 Disaggregated Database Systems Jianguo Wang, Qizhen Zhang ACM International Conference on Management of Data, SIGMOD 2023 Tutorial FlexChain: An Elastic Disaggregated Blockchain Chenyuan Wu, Mohammad Javad Amiri, Jared Asch, Heena Nagda, Qizhen Zhang, Boon Thau Loo International Conference on Very Large Data Bases, VLDB 2023 Templating Shuffles Qizhen Zhang, Jiacheng Wu, Ang Chen, Vincent Liu, Boon Thau Loo Conference on Innovative Data Systems Research, CIDR 2023 Optimizing Data-intensive Systems in Disaggregated Data Centers with TELEPORT Qizhen Zhang, Xinyi Chen, Sidharth Sankhe, Zhilei Zheng, Ke Zhong, Sebastian Angel, Ang Chen, Vincent Liu, Boon Thau Loo ACM International Conference on Management of Data, SIGMOD 2022 Redy: Remote Dynamic Memory Cache Qizhen Zhang, Philip Bernstein, Daniel Berger, Badrish Chandramouli International Conference on Very Large Data Bases, VLDB 2022 CompuCache: Remote Computable Caching using Spot VMs Qizhen Zhang, Philip Bernstein, Daniel Berger, Badrish Chandramouli, Vincent Liu, Boon Thau Loo Conference on Innovative Data Systems Research, CIDR 2022 MimicNet: Fast Performance Estimates for Data Center Networks with Machine Learning Qizhen Zhang, Kelvin K.W. Ng, Charles W. Kazer, Shen Yan, João Sedoc, Vincent Liu Annual Conference of the ACM Special Interest Group on Data Communication, SIGCOMM 2021 Understanding the Effect of Data Center Resource Disaggregation on Production DBMSs Qizhen Zhang, Yifan Cai, Xinyi Chen, Sebastian Angel, Ang Chen, Vincent Liu, Boon Thau Loo International Conference on Very Large Data Bases, VLDB 2020 Rethinking Data Management Systems for Disaggregated Data Centers Qizhen Zhang, Yifan Cai, Sebastian Angel, Ang Chen, Vincent Liu, Boon Thau Loo Conference on Innovative Data Systems Research, CIDR 2020 Optimizing Declarative Graph Queries at Large Scale Qizhen Zhang, Akash Acharya, Hongzhi Chen, Simran Arora, Ang Chen, Vincent Liu, Boon Thau Loo ACM International Conference on Management of Data, SIGMOD 2019 Predicting Startup Crowdfunding Success through Longitudinal Social Engagement Analysis Qizhen Zhang, Tengyuan Ye, Meryem Essaidi, Shivani Agarwal, Vincent Liu, Boon Thau Loo ACM International Conference on Information and Knowledge Management, CIKM 2017 Architectural Implications on the Performance and Cost of Graph Analytics Systems Qizhen Zhang, Hongzhi Chen, Da Yan, James Cheng, Boon Thau Loo, Purushotham Bangalore ACM Symposium on Cloud Computing, SoCC 2017 Earlier Publications Quegel: A General-Purpose System for Querying Big Graphs Qizhen Zhang, Da Yan, James Cheng Proceedings of the 2016 International Conference on Management of Data, SIGMOD 2016 Demo A General-Purpose Query-Centric Framework for Querying Big Graphs Da Yan, James Cheng, M. Tamer Özsu, Fan Yang, Yi Lu, John C. S. Lui, Qizhen Zhang, Wilfred Ng International Conference on Very Large Data Bases, VLDB 2016 A Shapley Value Approach for Cost Allocation in the Cloud Qizhen Zhang, Haoran Wang, Yang Chen, Tao Qin, Ying Yan, Thomas Moscibroda ACM Symposium on Cloud Computing, SoCC 2015 Poster Teaching CSCC43: Introduction to DatabasesUniversity of Toronto, Winter 2025 CSC2235: Cloud-native Data Management SystemsUniversity of Toronto, Winter 2025 CSCC43: Introduction to DatabasesUniversity of Toronto, Summer 2024 CSC2229: Topics in Computer Networks: Cloud ComputingUniversity of Toronto, Winter 2024 Professional Activities Service Program Committee SIGMOD 2026, VLDB 2026, NSDI 2026, EuroSys 2026 SIGMOD 2025, VLDB 2025, ICDE 2025, WWW 2025, APSys 2025 SIGMOD 2024, EuroSys 2024, EDBT 2024 SoCC 2023, CIKM 2023, ICDE 2023 SoCC 2022, CIKM 2022 Journal Reviewer ACM Transactions on Database Systems 2024 IEEE/ACM Transactions on Networking 2023 IEEE Transactions on Knowledge and Data Engineering 2023 IEEE/ACM Transactions on Networking 2022 IEEE Transactions on Parallel and Distributed Systems 2022 IEEE Transactions on Knowledge and Data Engineering 2022 Talks Data Processing with DPUs Seminar talk, ETH Zürich, Zürich, February 2025 Offloading the Tax of Disaggregation Seminar talk, National University of Singapore, Singapore, March 2024 Memory-disaggregated Database Systems SIGMOD 2023, Seattle, Washington, United States, June 2023 Templating Shuffles Northwest Database Society (NWDS) Annual Meeting 2023, Redmond, Washington, United States, May 2023 Redy: Remote Dynamic Memory Cache VLDB 2022, Virtual, September 2022 Optimizing Data-intensive Systems in Disaggregated Data Centers with TELEPORT SIGMOD 2022, Philadelphia, Pennsylvania, United States, June 2022 Hyperscale Data Processing with Network-centric Designs Job talk, February - April 2022 CMU, HKUST, NUS, Ohio State U., Simon Fraser U., UC Irvine, UIUC, U. Minnesota Twin Cities, U. Toronto, U. Virginia, U. Waterloo CompuCache: Remote Computable Caching using Spot VMs CIDR 2022, Virtual, January 2022 MimicNet: Fast Performance Estimates for Data Center Networks with Machine Learning SIGCOMM 2021, Virtual, August 2021 Understanding the Effect of Data Center Resource Disaggregation on Production DBMSs VLDB 2020, Virtual, September 2020 Microsoft Research, Virtual, August 2020 Rethinking Data Management Systems for Disaggregated Data C",
  "content_length": 11211,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:48"
}