{
  "name": "Quan Chen 0002",
  "homepage": "http://www.cs.sjtu.edu.cn/~chen-quan",
  "status": "success",
  "content": "Dr. Quan Chen's Home Page English ä¸­æ é å ¨ åå£«ãææ è®¡ç®æºç§å­¦ä¸å·¥ç¨ç³» ä¸æµ·äº¤éå¤§å­¦ çµè¯: åå ¬å®¤: å°å: é®ç®±: 021-34207239 çµä¿¡ç¾¤æ¥¼3å·æ¥¼522 ä¸æµ·éµè¡åºä¸å·è·¯800å· chen-quan [AT] sjtu [DOT] edu [DOT] cn Index ç ç©¶å ´è¶£ ä¸ªäººç®ä» æè²èæ¯ å·¥ä½ç»å æå­¦æ åµ å­¦æ¯æå¡ ä¸»è¦è·å¥ å½å®¶é¡¹ç® ä¼ä¸åä½ è¿æåè¡¨ ç ç©¶å ´è¶£ äºè®¡ç®ãè®¡ç®æºç³»ç»ãä½ç³»ç»æãå¹¶è¡è®¡ç® ä¸ªäººç®ä» æ¬äººç®åæ¯ä¸æµ·äº¤éå¤§å­¦è®¡ç®æºç§å­¦ä¸å·¥ç¨ç³»ææï¼å¹¶å å ¥æ°å ´å¹¶è¡è®¡ç®ç ç©¶ä¸­å¿å¢éã æ¬å¢éç®åæ­£å¨æååå£«ç ç©¶çåç¡å£«ç ç©¶çãå¦æä½ å¯¹å¹¶è¡è®¡ç®ãè®¡ç®æºç³»ç»ãè®¡ç®æºä½ç³»ç»ææå ´è¶£ï¼è¯·åæèç³»ã æè²èæ¯ 2013.11 -- 2014.09,    è®¿é®å­¦è ï¼ç¾å½å¥ä¼¦æ¯äºå¤§å­¦ 2009.09 -- 2014.06,    åå£«ï¼       ä¸æµ·äº¤éå¤§å­¦è®¡ç®æºç§å­¦ä¸å·¥ç¨ç³» 2011.03 -- 2011.11,    ç ç©¶å©çï¼æ°è¥¿å °å¥¥å¡å¥å¤§å­¦è®¡ç®æºç³» 2010.06 -- 2010.11,    è®¿é®å­¦è ï¼æ°è¥¿å °å¥¥å¡å¥å¤§å­¦è®¡ç®æºç³» 2007.09 -- 2009.07,    ç¡å£«ï¼       ä¸æµ·äº¤éå¤§å­¦è®¡ç®æºç§å­¦ä¸å·¥ç¨ç³» 2003.09 -- 2007.07,    å­¦å£«ï¼       åæµå¤§å­¦è®¡ç®æºç§å­¦ä¸ææ¯ç³» å·¥ä½ç»å 2021.08 -- è³ä»,         ææï¼        ä¸æµ·äº¤éå¤§å­¦è®¡ç®æºç§å­¦ä¸å·¥ç¨ç³» 2016.07 -- 2021.07,    é¿èæè½¨å¯ææï¼        ä¸æµ·äº¤éå¤§å­¦è®¡ç®æºç§å­¦ä¸å·¥ç¨ç³» 2014.10 -- 2016.04,    åå£«åï¼                å¯è¥¿æ ¹å¤§å­¦å®å¨å ¡åæ ¡è®¡ç®æºç³» 2014.07 -- 2016.06,    æµ·å¤å¸èµåå£«åï¼ä¸æµ·äº¤éå¤§å­¦è½¯ä»¶å­¦é¢ æå­¦æ åµ æ¥å­£å­¦æ Linuxå æ ¸, è¯¾ç¨ç½ç«: http://cc.sjtu.edu.cn/G2S/site/cs353.html æ¥å­£å­¦æ å¹¶è¡ç¼ç¨ ç§å­£å­¦æ é«çº§è®¡ç®æºä½ç³»ç»æï¼è¯¾ç¨ç½ç«ï¼http://cc.sjtu.edu.cn/G2S/site/aca.html å­¦æ¯æå¡ # ç¼å§ï¼Fundamental Research(å½å®¶èªç¶ç§å­¦åºéå§ä¸»å), Parallel Computing, Journal of Computer Science and Technology, Frontier of Computer Science # å½é ä¼è®®ç¨åºå§åä¼ä¸»å¸­ï¼PMAM 2017ï¼PMAM 2018ï¼PMAM 2019, NPC 2019 # å½é ä¼è®®ç¨åºå§åä¼æåï¼PPoPP 2020, ASPLOS 2020, IPDPS 2020, ICDCS 2020, SC 2022, ..., ASPLOS 2024 # Reviewer Boardï¼IEEE Transactions on Parallel and Distributed Systems (2020-2022) ä¸»è¦è·å¥ 2023 ä¸­å½è®¡ç®æºå­¦ä¼CCFææ¯åæä¸ç­å¥ (æå: 1), \"é¢åäºèç½æå¡çäºåçè¿è¡æ¶ç³»ç»å ³é®ææ¯åå ¶åºç¨\" 2023 ä¸­å½è®¡ç®æºå­¦ä¼CCFéå¹´ç§æå¥ (å½å¹´åº¦å ±5äºº) 2020 æè²é¨ç§æè¿æ­¥ä¸ç­å¥ (æå: 3) , \"é¢ååå¸ç²¾ç»åæ²»ççæ°æ®ååå¤çå ³é®ææ¯ååºç¨\" 2019 å½å®¶ææ¯åæäºç­å¥ (æå: 5)ï¼\"é¢åçªååå³°å¼æå¡çäºè®¡ç®å ³é®ææ¯ä¸ç³»ç»\" 2019 é¿ééæ©å¥ (å½å¹´åº¦å ±10äºº) 2018 ä¸æµ·å¸ææ¯åæä¸ç­å¥ (æå: 6) 2017 æè²é¨èªç¶ç§å­¦å¥ä¸ç­å¥ (æå: 3)ï¼\"åå¸å¼ç³»ç»èµæºè°åº¦ä¸ç®¡çççè®ºä¸æ¹æ³\" 2017 IEEE TCSC Award for Excellence (Early Career Researcher) 2017 å¾®è½¯é¸æè®¡å 2016 ä¸æµ·å¸ä¼ç§åå£«å­¦ä½è®ºæå¥ 2015 ä¸­å½è®¡ç®æºå­¦ä¼ä¼ç§åå£«å­¦ä½è®ºæå¥ 2012 CSC-IBM ä¸­å½ä¼ç§å­¦çå¥ 2011 IBM Ph.D fellowship awards å½å®¶é¡¹ç® # è´è´£äººï¼    é¢åå¼æç¡¬ä»¶çäºåçè¿è¡æ¶ç³»ç»ç ç©¶ï¼å½å®¶èªç¶ç§å­¦åºééç¹é¡¹ç®ï¼, 2023-2027 # è´è´£äººï¼    äºèç½æå¡æ°æ®ä¸­å¿èµæºç®¡çï¼å½å®¶èªç¶ç§å­¦åºéä¼ç§éå¹´ç§å­¦åºéé¡¹ç®ï¼, 2021-2023 # è´è´£äººï¼    éé å¼æå å­æ¶æçèªéåºä»»å¡è°åº¦çç ç©¶ï¼å½å®¶èªç¶ç§å­¦åºééå¹´åºéé¡¹ç®ï¼, 2017-2019 # åä¸ï¼        ç½ç»å¹¿åæåçåå¼çè®ºåè®¡ç®æ¹æ³ç ç©¶ï¼å½å®¶èªç¶ç§å­¦åºééç¹é¡¹ç®ï¼, 2017-2021 # é¡¹ç®éª¨å¹²ï¼åå¸å¤§æ°æ®ä¸å ç©ºé´ååè®¡ç®çè®ºä¸æ¹æ³ï¼973è®¡åé¡¹ç®ï¼, 2015-2019 # é¡¹ç®éª¨å¹²ï¼äººæºç©èåçäºè®¡ç®æ¶æä¸å¹³å°ï¼å½å®¶éç¹ç åè®¡åé¡¹ç®ï¼, 2018-2021 ä¼ä¸åä½ # è´è´£äººï¼    å¤§è§æ¨¡å¼æå¤çå¹³å°ææ¯åä½é¡¹ç®ï¼åä¸ºåæ°ç ç©¶è®¡åHIRPï¼, 2017 # è´è´£äººï¼    é¢åå ¬æäºçQoSææé«å©ç¨çæºè½å®¹éè§åï¼é¿éå·´å·´åæ°ç ç©¶è®¡åAIRï¼, 2018 # è´è´£äººï¼    åºäºå®¹å¨çå ¬æäºä¸­æ¶ææ»å»é²æ¤ä¸æºè½å®¹å¨æ¾ç½®ï¼é¿éå·´å·´åæ°ç ç©¶è®¡åAIRï¼, 2019 # è´è´£äººï¼.... è¿æåè¡¨ ä¸è # Quan Chen, Minyi Guo. Task Scheduling for Multi-core and Parallel Architectures - Challenges, Solutions and Perspectives. Springer Nature, 2017. æå¿è®ºæ # [CCCF] èµµæ¶µï¼å´ççï¼éå ¨ï¼è¿ææ. é¢åå¼ææ°æ®ä¸­å¿çæ··åé¨ç½²èµæºç®¡çæ¹æ³. è®¡ç®æºå­¦ä¼éè®¯. 2024. # [CCCF] è¿ææï¼éå ¨ï¼ä¸å®. é«ç§¯äºï¼ä¸ç§é«å¯æ©å±çç´§ååäºè®¡ç®. è®¡ç®æºå­¦ä¼éè®¯. 2020. # [Science] Minyi Guo, Quan Chen. Dynamic Task Scheduling for Modern Large-Scale Parallel Architectures. Science (Pushing the boundaries of scientific research: 120 years of addressing global issues). 26-29, 2016. é¨åä¼è®®è®ºæ # [ASPLOS'24] Yushi Liu, Shixuan Sun, Zijun Li, Quan Chen, Sen Gao, Bingsheng He, Chao Li, Minyi Guo. FaaSGraph: Enabling Scalable, Efficient, and Cost-Effective Graph Processing with Serverless Computing. Conference on Architectural Support for Programming Languages and Operating Systems. 2024 # [ASPLOS'24] Chuhao Xu, Yiyu Liu, Zijun Li, Quan Chen, Han Zhao, Deze Zeng, Qian Peng, Xueqi Wu, Haifeng Zhao, Senbo Fu, Minyi Guo. FaaSMem: Improving Memory Efficiency of Serverless Computing with Memory Pool Architecture. Conference on Architectural Support for Programming Languages and Operating Systems. 2024 # [ASPLOS'24] Zihan Liu, Wentao Ni, Jingwen Leng, Yu Feng, Cong Guo, Quan Chen, Chao Li, Minyi Guo, Yuhao Zhu. JUNO: Optimizing High-Dimensional Approximate Nearest Neighbour Search with Sparsity-Aware Algorithm and Ray-Tracing Core Mapping. Conference on Architectural Support for Programming Languages and Operating Systems. 2024 # [HPCA'24 Distinguished Artifact Runner-Up] Weichuang Zhang, Jieru Zhao, Guan Shen, Quan Chen, Chen Chen, Minyi Guo. An Optimizing Framework on MLIR for Efficient FPGA-based Accelerator Generation. International Symposium on High-Performance Computer Architecture. 2024. # [HPDC'24] Lixian Ma, Haoruo Chen, En Shao, Leping Wang, Quan Chen, Guangming Tan. ElasticRoom: Multi-Tenant DNN Inference Engine via Co-design with Resource-constrained Compilation and Strong Priority Scheduling. International Symposium on High-Performance Parallel and Distributed Computing. 2024. # [ICPADS'23 Best Paper Award] Jiagan Cheng, Yilong Zhao, Zijun Li, Quan Chen, Weihao Cui, Minyi Guo. Microless: Cost-Efficient Hybrid Deployment of Microservices on IaaS VMs and Serverless. International Conference on Parallel and Distributed Systems. 2023. # [ASPLOS'23] Zijun Li, Chuhao Xu, Quan Chen, Jieru Zhao, Chen Chen, Minyi Guo. DataFlower: Exploiting the Data-flow Paradigm for Serverless Workflow Orchestration. Conference on Architectural Support for Programming Languages and Operating Systems. 2023 # [ASPLOS'23] Teng Ma, Shanpei Chen, Yihao Wu, Erwei Deng, Zhuo Song, Quan Chen, Minyi Guo. Efficient Scheduler Live Update for Linux Kernel with Modularization. Conference on Architectural Support for Programming Languages and Operating Systems. 2023 # [SC'23] Kaihua Fu, Quan Chen, Yuzhuo Yang, Jiuchen Shi, Chao Li, Minyi Guo. BLAD: Adaptive Load Balanced Scheduling and Operator Overlap Pipeline For Accelerating The Dynamic GNN Training. International Conference for High Performance Computing, Networking, Storage, and Analysis. 2023 # [ATC'23] Jiuchen Shi, Hang Zhang, Zhixin Tong, Quan Chen, Kaihua Fu, Minyi Guo. Nodens: Enabling Resource Efficient and Fast QoS Recovery of Dynamic Microservice Applications in Datacenters. Usenix Annual Technical Conference. 2023 # [OSDI'23] Weihao Cui, Zhenhua Han, Lingji Ouyang, Yichuan Wang, Ningxin Zheng, Lingxiao Ma, Yuqing Yang, Fan Yang, Jilong Xue, Lili Qiu, Lidong Zhou, Quan Chen, Haisheng Tan, Minyi Guo. Optimizing Dynamic Neural Networks with Brainstorm. USENIX Symposium on Operating Systems Design and Implementation. 2023 # [VLDB'23] Pu Pang, Gang Deng, Kaihao Bai, Quan Chen, Shixuan Sun, Bo Liu, Yu Xu, Hongbo Yao, Zhengheng Wang, Zheng Liu, Zhuo Song, Yong Yang, Tao Ma, Minyi Guo. Async-fork: Mitigating Query Latency Spikes Incurred by the Fork-based Snapshot Mechanism from the OS Level. International Conference on Very Large Data Bases. 2023 # [ICS'23] Pu Pang, Yaoxuan Li, Bo Liu, Quan Chen, Zhou Yu, Zhibin Yu, Deze Zeng, Jingwen Leng, Jieru Zhao, Minyi Guo. PAC: Preference-Aware Co-location Scheduling on Heterogeneous NUMA Architectures To Improve Resource Utilization. International Conference on Supercomputing. 2023 # [SoCC'22] Jiuchen Shi, Kaihua Fu, Quan Chen, Changpeng Yang, Pengfei Huang, Mosong Zhou, Jieru Zhao, Chen Chen, Minyi Guo. Characterizing and Orchestrating VM Reservation in Geo-distributed Clouds to Improve the Resource Efficiency. Symposium on Cloud Computing. 2022 # [SC'22] Kaihua Fu, Jiuchen Shi, Quan Chen, Wei Zhang, Ningxin Zheng, Deze Zeng, Minyi Guo. QoS-Aware Irregular Collaborative Inference for Improving Throughput of DNN Services. SC. 2022 # [ATC'22] Weihao Cui, Han Zhao, Quan Chen, Hao Wei, Zirui Li, Deze Zeng, Chao Li, Minyi Guo. DVABatch: Diversity-aware Multi-Entry Multi-Exit Batching for Efficient Processing of DNN Services on GPUs. Usenix Annual Technical Conference. 2022 # [ATC'22] Wei Zhang, Binghao Chen, Zhenhua Han, Quan Chen, Peng Cheng, Fan Yang, Ran Shu, Yuqing Yang, Minyi Guo. PilotFish: Harvesting Free Cycles of Cloud Gaming with Deep Learning Training. Usenix Annual Technical Conference. 2022 # [ATC'22] Zijun Li, Jiagan Cheng, Quan Chen, Eryu Guan, Zizheng Bian, Yi Tao, Bin Zha, QiangWang, Weidong Han, Minyi Guo. RunD: A Lightweight Secure Container Runtime for High-density Deployment and High-concurrency Startup in Serverless Computing. Usenix Annual Technical Conference. 2022 # [ATC'22] Zijun Li, Linsong Guo, Quan Chen, Jiagan Cheng, Chuhao Xu, Deze Zeng, Z",
  "content_length": 27080,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:49"
}