{
  "name": "Quanxue Gao",
  "homepage": "https://web.xidian.edu.cn/qxgao",
  "status": "success",
  "content": "高全学 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 高全学的留言板 高全学的主页:个人信息科学研究论文成果荣誉奖励科研团队课程教学招生信息 基本信息高全学　博导博士学科：通信与信息系统硕士学科：通信与信息系统　工作单位：通信工程学院联系方式通信地址：西安电子科技大学105信箱电子邮箱：qxgao@xidian.edu.cn办公电话：办公地点：主楼1区137 个人简介博士，教授，博士生导师，省特支领军。1998年、2001年、2005年先后在西安公路交通大学机械系、甘肃工业大学材料学院、西北工业大学自动化学院获得学士、硕士、博士学位。增先后在香港理工大学、美国德州大学阿灵顿分校从事研究助理和访学。2005年11月在西安电子科技大学通信工程学院任教，2008年晋升为副教授，2013年晋升为教授，同年获得博士生导师资格。 主要从事多（跨）模态/多源数据分析、生成式AI、小样本学习、目标识别与检测、图像识别与去噪等领域的基础理论研究工作。主持国家自然科学基金项目、基础加强、省自然科学基础研究重点项目、重点实验开放课题等50余项研究课题，参与国家自然科学基金重点项目一项。获省电子学会自然科学奖一等奖，在国际一流期刊IEEE Transactions on Pattern Analysis and Machine Intelligence, IEEE Transactions on Image Processing, IEEE Transactions on Cybernetics, IEEE Transactions on Neural Networks and Learning Systems, IEEE Transaction on Infomation  Forensics and Security， Pattern Recognition和国际顶级会议（CCF A类）ICML，CVPR，ICCV，NeurIPS,AAAI, IJCAI等处发表论文100余篇，并担任CCF A类会议 AAAI 2023 Session Chair和IJCAI 2019 Session Chair. 2023年、2024年、2025年入选斯坦福大学发布的全球前2%顶尖科学家榜单（终身和年度双影响力）。指导的博士生王前前博士论文获得省级优秀博士论文，夏伟博士论文获得校级优秀博士论文，指导的硕士生卢晗、周倩、杨海洲、吕梓瑜、舒晓窗、徐慧玲、张璞等论文获得优秀硕士论文成果奖。 招生信息：欢迎编程、数学、英语基础较好的优秀学生加入多模态分析与理解实验室 祝贺杨光玉、段昱、刘瑜璇共4篇论文被ICDM 2025录用 祝贺李芳芳论文“Self-Supervised Graph Embedding Clustering”被IEEE Trans. Pattern Anal. Mach. Intell.录用 祝贺王睿论文“Bi-Orthogonal Non-Negative Tensor Tri-Factorization for Tensorized Label Learning”被CCF A类会议ACMMM2025录用 祝贺鲍一晨论文“Multi-view Clustering Based on Probabilistic Tensor Regression”被CCF A类会议ACMMM2025录用 祝贺李广飞论文“Multi-view Collaborative Representation Learning from Noisy Labels for VHR Imagery Classification”被CCF A类会议ACMMM2025录用 祝贺赵博文论文”Attribute-Missing Multi-view Graph Clustering“被CCF A类会议CVPR 2025文录用 祝贺徐海明论文”Deep Fair Multi-View Clustering with Attention KAN“被CCF A类会议CVPR 2025文录用 祝贺赵文慧、李靖两位硕士论文获得西安电子科大学2025年优秀硕士学位论文 祝贺薛星宇、赵文慧论文”Image Clustering With Transition Probabilities Learning“被CCF A类期刊IEEE Trans. Image Processing录用 祝贺薛星宇论文\"ensorized Label Learning Based Fast Fuzzy Clustering\"被CCF A类会议AAAI 2025录用 祝贺李芳芳论文Manifold Based Multi-View K-Means被IEEE Trans. Pattern Anal. Mach. Intell.录用 祝贺李芳芳论文Tensorized Soft Label Learning Based on Orthogonal NMF被IEEE Trans. Neural Networks Learn. Syst.录用 祝贺周倩，卢晗，杨海洲三位硕士论文获得西安电子科大学2024年优秀硕士学位论文 祝贺李靖论文被CCF A类会议ACM SIGKDD（2024）录用 祝贺赵文慧论文被CCF A类会议AAAI（2024）录用 祝贺李靖论文被CCF A类会议AAAI（2024）录用 祝贺赵文慧论文Anchor Graph-Based Feature Selection for One-Step Multi-View Clustering.被IEEE Trans. Multim录用 祝贺周倩论文“unsupervised Discriminative Feature Selection via Contrastive Graph Learning“被 IEEE Trans. Image Process. 录用 祝贺李广飞2篇论文被EEE Trans. Circuits Syst. Video Technol.录用 祝贺周倩，卢晗，赵文慧，梅时坤，章子豪获得2023年国家奖学金 祝贺李靖论文“Orthogonal Non-negative Tensor Factorization based Multi-view Clustering”被NeurIPS2023录用 祝贺章子豪论文被 ACM Multimedia 2023录用 祝贺夏伟博士获得2023年陕西省优秀博士毕业生 祝贺舒晓窗，吕梓俞获得2023年西安电子科技大学优秀硕士学位成果奖 祝贺夏伟，舒晓窗，吕梓俞，朱兆瑞，豆莹，杨海洲获得2022年国家奖学金 祝贺卢晗论文“Centerless Multi-View K-means Based on the Adjacency Matrix”被AAAI 2023录用 祝贺夏伟论文“Tensorized Bipartite Graph Learning for Multi-View Clustering”被IEEE Trans. Pattern Anal. Mach. Intell.录用 祝贺杨海洲论文“Multiview Spectral Clustering With Bipartite Graph”被 IEEE Trans. Image Process. 录用 祝贺张璞论文“Orthogonal Non-negative Tensor Factorization based Multi-view Clustering”被IEEE Trans. Pattern Anal. Mach. Intell.录用 祝贺徐惠玲获得西安电子科技大学优秀硕士学位成果奖 祝贺徐惠玲，万芝祯，赵玉姣获得国家奖学金 主要研究方向多（跨）模态数据表正及分析，小（零）样本学习，目标检测与标注，模式识别与人工智能等基础研究。 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 高全学的留言板 技术支持：电院网络中心陕ICP备05016463号-3© 2025 西安电子科技大学",
  "content_length": 3432,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:49"
}