{
  "name": "Quan Li",
  "homepage": "http://faculty.sist.shanghaitech.edu.cn/liquan",
  "status": "success",
  "content": "Quan Li@ShanghaiTech Office: Room 1A-404B, SIST liquan[at]shanghaitech[dot]edu[dot]cn Tel: (021) 2068 4425 Publications Courses Students Services RECENT NEWS Oct 2025: Received VISxGenAI Challenge Honorable Mention at IEEE VIS 2025 Workshop! Congrat to Junjie. Oct 2025: One full paper was accepted by ICHEC 2025 (Chinese CHI 2025). Congrat to Yuchen, Shizhen, Shengxi, and Ouyang. Oct 2025: Received Wiley China Excellent Author Program Certificate, Jan. - Mar. 2025. Sep 2025: Received a TVCG Reviewer Certificate (2024). August 2025: FashionCook paper was finally accepted by IEEE CG&A 2025. Congrat to Yuheng. August 2025: One demo paper was accepted by ACM UIST 2025. Congrat to Longfei and Shenghan. June/July 2025: One full paper was accepted by IEEE VIS 2025. One short paper was accepted by IEEE VIS 2025. Two full papers were accepted by ACM UIST 2025. Congrat to Haoran, Ouyang, Shaohan, Shenxin and Shizheng. May 2025: One full paper ASight: Fine-tuning Auto-Scheduling Optimizations for Model Deployment via Visual Analytics was accepted by TVCG 2025. Congrat to Laixin, Ruofei, and NetEase Game. Mar. 2025: ClueCart paper received ACM CHI 2025 Best Paper Award. Congrat to Xiyuan and Junjie. Mar. 2025: One paper about Influence Maximization in Temporal Social Networks with a Cold-start Problem was accepted by ICWSM 2025. Congrat to Laixin, Xiyuan, Shenghan, Prof. Haipeng Zhang and NetEase Games. Feb. 2025: Two papers about Designing a Probe for Oral Case Presentation Training with LLM Assistance and Enabling Asynchronous Co-viewing Experiences in Virtual Reality via Danmaku were accepted by CHI 2025 LBW. Congrat to Ouyang and Xiaofeng. Feb. 2025: One paper about Exploring Contextual Support for Digesting Academic Paper Reviews was accepted by CSCW 2025. Congrat to Yuansong, Shuhao, and Shaohan. Feb. 2025: One paper From Requirement to Solution: Unveiling Problem-Driven Design Patterns in Visual Analytics was accepted by TVCG 2025. Congrat to Yuchen, Shenghan, Shizhen, and Xiaofeng. Jan. 2025: One paper MetapathVis: Inspecting the Effect of Metapath in HeterogeneousNetwork Embedding via Visual Analytics was accepted by Computer Graphics Forum (CGF) 2025. Congrat to Yun, Xiyuan, Laixin and WeChat Tencent Team. Jan. 2025: Two full papers were accepted by ACM CHI 2025. Congrat to Yuansong and Xiyuan. Jan. 2025: One poster was accepted by IEEE VR 2025. Congrat to Xiaofeng, Jiahe, and Shuhao. News in 2024 Dec. 2024: Four full papers were accepted by ACM IUI 2025. Congrat to Xiyuan, Ruofei, Qianyu, Shengxi and Longfei. Nov. 2024: Two full papers were accepted by Chinese CHI 2024 and one paper received Best Paper Award. Congrat to Yuchen and Yuansong. Oct. 2024: One full paper Deciphering Explicit and Implicit Features for Reliable, Interpretable, and Actionable User Churn Prediction in Online Video Games was accepted by TVCG 2024. Congrat to Xiyuan, Laixin and NetEase Game. Oct. 2024: One full paper Benchmarking machine learning methods for synthetic lethality prediction in cancer was accepted by Nature Communication. Congrat to He, Yang and Prof. Jie Zheng's team. Aug. 2024: One full paper was accepted by ACM UIST 2024. Congrat to Yang, Leixian, and Yun. July 2024: Two full papers were accepted by IEEE VIS 2024 and Two full papers were recommended to TVCG Fast-Track. One short paper was accepted by IEEE VIS 2024. Congrat to Haoran, Shuhao, Shaohan and Ouyang. Congrat to Prof. Haipeng Zeng's group. May 2024: One full paper - KMTLabeler: An Interactive Knowledge-Assisted Labeling Tool for Medical Text Classification is accepted by TVCG 2024 Congrat to He, Yang, Yuchen, and Fudan University Zhongshan Hospital Team April 2024: One full paper - FMLens: Towards Better Scaffolding the Process of Fund Manager Selection in Fund Investments is accepted by TVCG 2024 Congrat to Longfei, He, Xiyuan, and Prof. Haipeng Zhang and Prof. Suting Hong April 2024: One full paper - MARLens: Understanding Multi-agent Reinforcement Learning for Traffic Signal Control via Visual Analytics is accepted by TVCG 2024 Congrat to Prof. Haipeng Zeng's team April 2024: One full paper - EVCSeer: An Exploratory Study on Electric Vehicle Charging Stations Utilization via Visual Analytics is accepted by IEEE Computer Graphics and Applications 2024 Congrat to Prof. Haipeng Zeng's team News in 2023 Dec 2023: One full paper - BiasEye: A Bias-Aware Real-time Interactive Material Screening System for Impartial Candidate Assessment is accepted by ACM IUI 2024 Congrat to Qianyu, Haoran, Qiushi, and Prof. Peng Sep 2023: One full paper - Exploring Hero Drafting in Professional MOBA Tournaments is accepted by CSCW 2024 Congrat to Shiyi, Ruofei, Chuyi, and Zhenbang August 2023: Get a grant @ National Natural Science Foundation of China (General Program 国家自然科学基金面上项目) August 2023: One CSCW workshop paper is accepted by CSCW workshop - Understanding and Mitigating Cognitive Biases in Human-AI Collaboration Congrat to Qianyu August 2023: ALens: An Adaptive Domain-Oriented Abstract Writing Training Tool for Novice Researchers wins Best Paper Honorable Mention Award @HHME/CHCI 2023 August 2023: One poster paper is accepted by IEEE VIS 2023 Workshop VAHC 2023 Congrat to He and Yang August 2023: Serve as an AC for ACM CHI'24 and CSCW'24 July 2023: One full paper is accepted by HHME/CHCI 2023 Congrat to Chen, Ziang and Prof. Peng July 2023: Two poster papers are accepted by IEEE VIS 2023 Congrat to Laixin, Zixin and Shiyi July 2023: Leveraging Historical Medical Records as a Proxy via Multimodal Modeling and Visualization to Enrich Medical Diagnostic Learning @ IEEE VIS 2023 Congrat to Yang, Yuchen, He, Chenyang, Dr. Furui Cheng, Dr. Chang Jiang, Dr. Lixia Jin, and Dr. Yuanwu Cao from Fudan Zhongshan Hospital July 2023: FSLens: A Visual Analytics Approach to Evaluating and Optimizing the Spatial Layout of Fire Stations @ IEEE VIS 2023 Congrat to Longfei, He, Yang, and Dr. Yang Zhou and Prof. Naiyu Wang from Zhejiang University July 2023: LiveRetro: Visual Analytics for Strategic Retrospect in Livestream E-Commerce @ IEEE VIS 2023 Congrat to Yuchen, Yuansong, Shenghan, Dr. Xingbo Wang, Wenkai, Zhiheng, and Prof. Xiaomeng Fan July 2023: Our students won the 3rd Prize @ Data VIS Challenge Competition, ChinaVis 2023 Congrat to Shenghan, Xiaofeng, Shuhao, and Xiyuan June 2023: Serve as an AC for ACM CHI'24 and CSCW 2024 on the `Visualization' Subcommittee June 2023: One paper was accepted by ChinaVis 2023 Congrat to Longfei, Qianyu, Chenyang, Yangkun, Prof. Peng, Prof. Zeng, Zhida, and Prof. Ma June 2023: Towards Better Modeling With Missing Data: A Contrastive Learning-Based Visual Analytics Perspective was accepted by TVCG Congrat to Laixin, Yang, Longfei, and Ziming June 2023: Three papers were conditionally accepted at IEEE VIS 2023 Feb 2023: Inspecting the Dynamics of Venture Capital Investment Network @ ICDE 2023 workshop on Big Data Analytics in Finance and Commerce Congrat to Yun Jan 2023: Serve as an AC for CSCW2023 and ECAI-23 News in 2022 Sep 2022: VFLens: Co-design the Modeling Process for Efficient Vertical Federated Learning via Visualization @ Chinese CHI 2022 (Honorable Mention Award) Congrat to Yun, He, and Laixin July 2022: PromotionLens: Inspecting Promotion Strategies of Online E-commerce via Visual Analytics @ IEEE VIS 2022 Congrat to Chenyang, Xiyuan, Chuyi, and Yijin July 2022: RISeer: Inspecting the Status and Dynamics of Regional Industrial Structure via Visual Analytics @ IEEE VIS 2022 Congrat to Longfei and Yang July 2022: RankAxis: Towards a Systematic Combination of Projection and Ranking in Multi-Attribute Data Exploration @ IEEE VIS 2022 Congrat to Qiangqiang (and the Tencent Team) July 2022: Our students won the 2nd Prize @ Data Challenge Competition, ChinaVis 2022 Congrat to Ziang, Chen, and Xiyuan June 2022: Three papers were conditionally accepted at IEEE VIS 2022 June 2022: Serve as an AC for ACM CHI'23 on the `Visualization' Subcommittee Feb 2022: Understanding Informal Social Role Changes in MMORPGs @ ACM CHI 2022 Congrat to Laixin and Ziming News in 2021 Dec 2021: A Unified Framework for Ensemble Contour Visualization @ TVCG 2022 Sep 2021: Understanding Players' Interaction Patterns with Mobile Game App UI via Visualizations @ Chinese CHI 2021 (Best Paper Award) July 2021: Inspecting the Process of Bank Credit Rating via Visual Analytics @ IEEE VIS 2021 April 2021: Inspecting the Running Process of Horizontal Federated Learning via Visual Analytics @ TVCG 2021 April 2021: Exploring the \"Double-Edged Sword\" Effect of Auto-Insight Recommendation in Exploratory Data Analysis @ ACM IUI 2021 ESIDA Mar 2021: Join ShanghaiTech as a tenure-track assistant professor News in 2020 Aug 2020: Visual Analytics for Scheduling Customized Shuttle Buses @ IEEE VIS 2020 Short Paper Mar 2020: Fostering Engagement in Technology-Mediated Stress Management via Biofeedback Design @ International Journal of Human-Computer Studies (IJHCS) Feb 2020: Friend Circle as Gatekeeper in WeChat @ Chinese CHI 2020 Dec 2019: MaraVis for Managing Medical Encounters in Urban Marathon @ CHI 2020 Address: School of Information Science and Technology, ShanghaiTech 393 Middle Huaxia Road Pudong, Shanghai, 201210 Quan Li I am a tenure-track assistant professor at School of Information Science and Technology, ShanghaiTech University, also affiliated with Fintech Initiative and HCI Initiative, SIST, ShanghaiTech University. I am serving as the Co-Director (联合中心主任) of Visual and Data Intelligence Center (VDI), SIST, ShanghaiTech University this period. I received my Ph.D. at the Department of Computer Science and Engineering, The Hong Kong University of Science and Technology (HKUST), where my supervisors are Prof. Xiaojuan Ma and Prof. Huamin Qu. Before joining HKUST, I was a senior researcher at NetEase Games, a leading Chinese game operator. I obtained my master's degree from Tsinghua University, supervised by Prof. Li Chen, and bachelor's degree fro",
  "content_length": 42207,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:48"
}