{
  "name": "Quentin Cappart",
  "homepage": "https://qcappart.github.io",
  "status": "success",
  "content": "Welcome to my personal page! - Quentin Cappart Quentin CappartAssociate professor at Polytechnique Montréal Follow Montreal, Canada Website Twitter LinkedIn Github Google ScholarI am Quentin, associate professor at Polytechnique Montréal (engineering school associated to University of Montreal) in the department of computer engineering and software engineering. I am the recipient of 2024 ACP Early Career Researcher Award, a regular member of CIRRELT, member of the association for constraint programming, IVADO researcher, affiliate member of MILA, and researcher at the IMC2 institute. I also lead the CORAIL research group, that I co-founded with Louis-Martin Rousseau.Prior to that, I was a a post-doctoral IVADO fellow at Polytechnique Montréal, where I worked with Louis-Martin Rousseau and as a research intern at ElementAI (acquired later by ServiceNow). I obtained my Ph.D. in 2017 from UCLouvain, and was supervised by Pierre Schaus.Research InterestsMy research interests are in artificial intelligence, particularly in the areas of constraint programming, machine learning, and combinatorial optimization. My goal is to develop decision-making tools able to leverage different aspects of artificial intelligence to perform better decisions. I use these methods to solve real problems arising frequently in various industrial fields such as transportation, logistics, or healthcare.Selected Honors and AwardsEarly career engineer award (Ordre des ingénieurs du Québec - 2025) [link]Early career professor award (Polytechnique Montréal - 2025) [link]Prix Méritas (Polytechnique Montréal - 2025) [link]Early career researcher award (ACP - 2024) [link]Best paper award (machine learning track) (ACP - 2024) [link]Winning approach for 2023 Citylearn challenge (NeurIPS competition - 2023) [link], [paper]Distinguished paper (ACP - 2023) [link], [paper]Prix Méritas (Polytechnique Montréal - 2024) [link]Best paper award (ACP - 2022) [link, paper]Discovery grant (NSERC - 2022) [link]Prix Méritas (Polytechnique Montréal - 2022) [link]Postdoctoral research funding (IVADO - 2018) [link]University laureate of three minutes thesis contest (UCLouvain - 2017) [recording], [interview]Student paper contest third prize (IEEE Region 8 - 2015) [link]Best master thesis in IEEE field (UCLouvain IEEE student branch - 2014) [link]",
  "content_length": 2331,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:50"
}