{
  "name": "Quintin I. Cutts",
  "homepage": "http://www.dcs.gla.ac.uk/~quintin",
  "status": "success",
  "content": "Quintin's Home Page Quintin Cutts Room S141 School of Computing Science University of Glasgow Sir Alwyn Williams Building 18, Lilybank Gardens, G12 8RZ +44 141 330 5619 Quintin.Cutts at glasgow.ac.uk Full Professor in the School of Computing Science. Leading on a two-year, Scottish Government funded project Professional Learning and Networking in Computing Science (PLAN C) for computing science school teachers throughout Scotland CS Education in Schools Teaching and Administrative Duties Research and Scholarship Recent Publications Innovation in Learning and Teaching Esteem Prospective PhD Students Computing Science Education in Schools I am or have been involved in a wide range of initiatives to develop computing science as a rigorous academic discipline in schools in the UK and abroad. Professional Learning and Networking in Computing I am project officer on the Professional Learning and Networking in Computing (PLAN C) project, funded by Scottish Government and administered by BCS, the Chartered Institute for IT.  The goal is to develop a network connecting CS teachers throughout Scotland, thus enabling effective development and sharing of best practice, in line with the Donaldson report.  We have trained around 50 lead teachers initially, who are now running  teacher communities in their local areas, acting as mentors to promote effective sharing of materials and teaching experience as well as introducing new best practice CS pedagogies developed from research from around the world. Scottish Qualifications Authority I have worked with the SQA since 2010 on the Qualification Design Team for the new National, Higher and Advanced Higher qualifications, feeding in results from my and others' recent research on curriculum and assessment techniques.  In particular, more emphasis has been placed on the core philosophy that pupils need to be able to understand and reason about programs.  The Haggis reference language has been developed by me jointly with Professor Greg Michaelson at Heriot Watt University specifically to enable program code to appear in exam papers. Professor Richard Connor at the University of Strathclyde has developed a parser and run-time system for Haggis, found here. Haggis has been adopted by the SQA for use in all Computing Science qualifications for the presentation of code. Education Scotland and Skills Development Scotland I am involved in Education Scotland's evolutionary approach to the development of the Computing Science Broad General Education phase of the Curriculum for Excellence.  This is collaborative work with Professor Richard Connor at Strathclyde University.  Key to this is the incorporation into BGE Levels 1 and 2 of our understanding of how computational thinking skills can be developed in, and be of value to, all pupils. We have funding from the Scottish Government funded Strategic Investment Plan for IT, (administered by Skills Development Scotland) to continue this work. UK Forum for Computing Education I am the Scottish representative on UKForCE, the UK Forum for Computing Education.  This forum was set up and is administered by the Royal Academy of Engineering as a result of the recommendation in the Royal Society's Shutdown or Restart? for a single voice for the needs of computing education in the UK. RSE CS Exemplification Project I am a member of the advisory board for the Royal Society of Edinburgh's exemplification project for computing science. The goal of this project has been the production of high quality teaching materials for the Curriculum for Excellence. Computing at School Scotland co-Chair I am co-chair of CAS Scotland, the teacher association for computing science teachers across Scotland.  When the PLAN C project completes its works of developing an effective network of computing teachers in Scotland, CAS Scotland will be the natural coordinating body for the teacher network, further strengthening its position as the voice for teachers in Scotland. Computing at School I have been involved in CAS since its creation by Simon Peyton Jones in 2008, acting on the Working Group and delivering workshops and talks at the annual CAS conference.  Though CAS, I was involved in developing recommendations for the new English programme of study for computing. I am currently leading a CAS working group exploring assessment issues in computer science. CS Education in the US I spent a sabbatical year in 2010-11 in the University of California San Diego, working with Beth Simon, concentrating on the development and evaluation of a computational thinking skills course for all, as part of the US CS Principles programme.  The course has now been delivered to thousands of UC San Diego students, as well as numerous high schools in the San Diego area and further afield.  The success of the course is largely ascribed to the use of the Peer Instruction pedagogy.  We are working on the incorporation of this discussion-oriented pedagogy into on-line formats to enable large-scale training of teachers. CS Inside This EPSRC funded Partnerships for Public Engagement project, running from 2005-2009, developed a range of lesson-length workshops to be used by computing teachers in their classrooms.  The workshops have been used by hundreds of teachers and experienced by tens of thousands of pupils in Scotland alone, and downloads have been recorded from more than 20 countries worldwide. Back to top Research and Scholarship My primary research focus is on the development of effective pedagogy for initial education in computational thinking and computing science.  Furthermore, the PLAN C project offers a significant opportunity to study effective identification and sharing of pedagogical content knowledge in Computing Science. I am, or have been, a reviewer for the Computer Science Education Journal, ACM SIGCSE Conference, ACM ITiCSE Conference, and the ACM ICER Conference. I have been / am one of the three rolling chairs for ICER 2013, 2014 and 2015.  I was lead organising chair in 2014, in Glasgow, running from 11-13 August, with a Doctoral Consortium and Critical Research Review immediately before and after the main conference. Back to top Selected Publications Cutts, Q., Connor, R., Donaldson, P. and Michaelson, G. (2014) “Code or (not Code) - Separating Formal and Natural Language in CS Education” In Proceedings of WIPSCE 2014, the 9th International Workshop in Primary and Secondary Computing Education, Berlin, Nov. 2014. Simon, B., Esper, S., Porter, L. and Cutts, Q. (2013) “Student Experience in a Student-centered Peer Instruction Classroom” In Proceedings of ICER 13, the 9th International Computing Education Research Conference, San Diego, USA, Aug. 2013. Cutts, Q., Esper, S., Fecho, M., Foster, S. & Simon, B. (2012) “The Abstraction Transition Taxonomy: Developing Desired Learning Outcomes through the Lens of Situated Cognition” In Proceedings of ICER 12, the 8th International Computing Education Research Conference, Auckland, New Zealand, Sept. 2012. Esper, S., Simon, B. and Cutts, Q. (2012) “Exploratory Homeworks: An Active Learning Tool for Textbook Reading” In Proceedings of ICER’12, the 8th International Computing Education Research Conference, Auckland, New Zealand, Sept. 2012 Simon, B. and Cutts, Q. (2012) “Peer Instruction: A Teaching Method to Foster Deep Understanding” Comm. ACM 55(2), pp 27-29. Simon, B. and Cutts, Q. (2012) “How to Implement a Peer Instruction-designed CS Principles Course” ACM Inroads 3(2), pp 72-74 Cutts, Q., Esper, S. and Simon, B. (2011) “Computing as the 4th “R”: a General Education Approach to Computing Education” In Proceedings of ICER’11, the 7th International Computing Education Research Conference, Rhode Island, USA, pp 133-138. Porter, L., Bailey-Lee, C., Simon, B., Zingaro, D. Cutts, Q. (2011) \"Experience Report: A Multi-Classroom Report on the Value of Peer Instruction\" Proceedings of ITiCSE'11, 16th Annual Conference on Innovation and Technology in Computer Science Education, June 2011, Darmstadt, Germany. pp 138-142. Bell, T., Curzon, P., Cutts, Q., Dagiene, V. and Haberman, B. (2011) \"Overcoming Obstacles to CS Education by Using Non-Programming Outreach Programmes\" In Proceedings of ISSEP'11, 5th International Conference on Informatics in Schools: Situation, Evolution and Perspectives, Bratislava, Slovakia, October 2011 Bowskill, N., Lally, V., Brindley, S., Cutts, Q., Draper, S. (2011) “Shared Thinking as Interactionist Theory and Pedagogy for Group Learning”, SASP 2011 Conference, Manly, Australia, 16-18th April, 2011 Cutts, Q., Cutts, E., Draper, S., O'Donnell, P. and Saffrey, P., \"Manipulating mindset to positively influence introductory programming performance\", Proceedings of the 41st ACM SIGCSE symposium, (2010), pp 431-435. Simon, B., Kohanfars, M., Lee, J., Tamayo, K. and Cutts, Q., \"Peer Instruction in Introductory Computing\", Proceedings of the 41st ACM SIGCSE symposium, (2010), pp 341-345 Back to top Teaching and Administrative Duties I am running these courses in session 2014-15. Level 1: CS-1CT.  An introduction to computational thinking and programming for complete beginners using Alice and Python. This is intended both for intending Honours CS students who have done no programming before and also for those not intending to study CS further, but for whom such skills will be of value in their own discipline.        Moodle course page Level 4: Computing Science in the Classroom.  Final year students spend time in local schools acting as ambassadors for Computing Science and learning teaching and communication skills.  Moodle course page. Past courses Unix, C, C++, Programming Language Design and Implementation, Compilers, Databases, Professional Skills and Issues, Persistent Programming Languages, Advanced Java Programming. External I am currently External Examiner for undergraduate programmes at the University of Dundee and Heriot Watt University. Past responsibilities Associate Dean (Learning and Teaching), Faculty of",
  "content_length": 14648,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:53"
}