{
  "name": "Qun Li",
  "homepage": "http://www.cs.wm.edu/~liqun",
  "status": "success",
  "content": "Qun Li's Homepage Qun Li Professor of Computer Science IEEE Fellow Publications    Teaching Program Chair, ACM SEC 2019, Washington, D.C., 11/7-9 Track Chair, IEEE ICDCS 2022, Bologna, Italy, 7/10-13 I am a professor of Department of Computer Science at William & Mary, and served as the graduate director of the department in 2010-2011. I got my PhD from Dartmouth College under the supervision of Daniela Rus. My research focuses on edge computing, operating systems, distributed systems, cyber-physical systems, deep learning, security & privacy. It involves building and simulating prototype systems, and conducting real experiments and measurements. Check out our recent papers here. I am currently working with brilliant PhD students Lele Ma, Zeyi Tao, Qi Xia, and Jindi Wu. I am interested in motivated students who would like to work on operating systems, security and privacy, deep learning in the context of edge computing systems. Recently PhD graduated: Zhengrui Qin, Ed Novak, Nancy Carter, Shanhe Yi, Yutao Tang, Zijiang Hao, Cheng Li. I am the recipient of a NSF Career Award and an IEEE Fellow. I am the Founder and Director of the Edge Computing Laboratory. My publications include more than 100 international journal articles, book chapters,  conference/workshop papers, and technical reports. Many of them are published in prestigious conferences and journals ( ACM CCS18, ICSE'16, Ubicomp'15, NSDI'13, Mobisys'13, Mobisys'12, Ubicomp'13, Pervasive'08, Mobicom'03, Mobicom'01, Mobicom'00, and Infocom'16, 15, 14, 13, 12, 11, 10, 09, 08, 06, 04). I am the general chair of ACM/IEEE Symposium of Edge Computing (SEC'22) and was the program co-chair of ACM/IEEE Symposium on Edge Computing (SEC'19). I was the chair for many other conferences including area chair for IEEE Infocom and track chair for IEEE ICDCS. I was the steering committee chair of IEEE Transactions on Multi-Scale Computing Systems. I also served as TPC member for numerous conferences and workshops and was an Associate Editor of IEEE Transactions on Wireless Communications. Currently I am on the editorial board of IEEE Internet Computing and IEEE Transactions on Computers. To add more information :-),  my Erdös number is 3. My google scholar profile is here. Classes for this semester: Edge Computing Group Publications (by year) Teaching WM facts Qun Li Department of Computer Science McGlothlin-Street Hall College of William and Mary Williamsburg, VA 23187-8795 Tel: 757-221-3478 (O) Fax: 757-221-1717 E-mail: user: liqun domain: cs.wm.edu Direction to WM News: Our undergraduate student Harry Gao has been selected as a Finalist in the Computing Research Association's Outstanding Undergraduate Researcher Award competition for 2011. Congratulations! PhD Alumni:Haodong Wang, Cleveland State University, Associate Professor. Bo Sheng, UMASS Boston, Associate Professor. Chiu C. Tan, Temple University, Associate Professor. Fengyuan Xu, Nanjing University, Professor. Hao Han, Nanjing University of Aeronautics and Astronautics, Professor. Wei Wei, Beijing AOTO, company leader. Yifan Zhang, SUNY Binghamton, Assistant Professor. Zhengrui Qin, Northwest Missouri State University, Assistant Professor.Ed Novak, Franklin and Marshall College, Assistant Professor.Shanhe Yi, VMware Yutao Tang, Walmart TechnologyZijiang Hao, LinkedIn Cheng Li, Google",
  "content_length": 3344,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:52"
}