{
  "name": "R. E. Ellis",
  "homepage": "http://www.cs.queensu.ca/~ellis",
  "status": "success",
  "content": "Randy E Ellis, PhD Randy E Ellis, PhD Home Publications Contact Professor and Queen's Research Chair in Computer-Assisted Surgery School of Computing Department of Mechanical and Materials Engineering Department of Surgery Department of Biomedical and Molecular Sciences Supervisory Statement: I am no longer accepting new students under my supervision. Biographical Sketch: Welcome! I am a Professor at Queen's University at Kingston. My primary Queen's appointment is in the School of Computing; other appointments are as a Professor in the Department of Mechanical and Materials Engineering, in the Department of Surgery, and in the Department of Biomedical and Molecular Sciences. My training and early-career research was in robotics, especially in haptic sensing and haptic interfaces for teleoperated robots. My main research has been in computer-assisted surgery, particularly in orthopedic surgery. My current research is in the use of data analytics and machine learning for mass spectrometry, which is a technique in analytical chemistry. I have had appointments as a Visiting Professor or Visiting Scientist in Bologna, Harvard Medical School, Johns Hopkins, Kyushu, Osaka, St. Francis Xavier, and the Technical University of Munich. I have been a Fellow of the Japan Society for the Promotion of Science and an Honorary Fellow of the Institute for Advanced Studies in Munich. I am currently a Fellow of the American Society for Mechanical Engineering (ASME) and a Fellow of the Institute of Electrical and Electronic Engineers (IEEE). My undergraduate teaching is mainly the theoretical and mathematical foundations for artificial intelligence and machine learning. The lectures for these courses are available through the links below. Current Undergraduate Courses: CISC204: Logic For Computing Science CISC271: Linear Data Analysis CISC371: Nonlinear Data Analysis Queen's University is situated on the territory of the Haudenosaunee and Anishinaabek. Ne Queen's University e’tho nón:we nikanónhsote tsi nón:we ne Haudenosaunee táhnon Anishinaabek tehatihsnonhsáhere ne onhwéntsya. Gimaakwe Gchi-gkinoomaagegamig atemagad Naadowe miinwaa Anishinaabe aking.",
  "content_length": 2171,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:56"
}