{
  "name": "R. Krithika 0001",
  "homepage": "https://www.iitpkd.ac.in/people/krithika",
  "status": "success",
  "content": "krithika | IIT Palakkad Englishहिन्दी A- A A+ 0491 209 2013 (Office) | info@iitpkd.ac.in INDIAN INSTITUTE OF TECHNOLOGY PALAKKAD Kanjikode | Palakkad | Kerala - 678623 0491 209 2001 (Office) | info@iitpkd.ac.in Dr. Krithika RamaswamyAssociate ProfessorComputer Science And EngineeringResearch Area: Graph Theory and Algorithms, Research Area: Parameterized Algorithms, Research Area: Approximation AlgorithmsView Website Biosketch 2018-present: Faculty Member Computer Science and Engineering, IIT Palakkad 2016-18. Post-doctoral Fellow in Theoretical Computer Science Institute of Mathematical Sciences Advisors: Saket Saurabh and Venkatesh Raman 2012-16. PhD in Computer Science and Engineering Indian Institute of Technology Madras Advisor: N. S. Narayanaswamy Thesis: Approximation and Parameterized Algorithms for Finding Hitting Sets 2010-12. MS (by Research) Indian Institute of Technology Madras Advisor: N. S. Narayanaswamy Thesis: r-Partization and Above Guarantee Vertex Cover 2009. System Engineer Temenos India Private Limited, Chennai 2007-08. Programmer Analyst Cognizant Technology Solutions, Chennai 2003-07. B.E in Computer Science and Engineering SSN College of Engineering, Anna University, Chennai Research I work in the broad area of graph theory and algorithms with a focus on designing efficient algorithms for various combinatorial optimization problems on graphs. My current focus is in the areas of parameterized and approximation algorithms for computationally intractable problems. Teaching July-Nov 2024 CS2020 Discrete Mathematics (BTech S3 Core) Jan-May 2024 CS2300  Data Structures and Algorithms (BTech S3 Core) CS5003  Parameterized Algorithms (Elective) July-Nov 2023 CS5009 Algorithms (MCaM S1 Core) Jan-May 2023 CS2040  Design and Analysis of Algorithms (BTech S4 Core) CS2180  Artificial Intelligence Laboratory (BTech S4 Core, jointly with Dr. Krishnamoorthy Dinesh) July-Nov 2022 CS5013 Topics in Discrete Mathematics (MCaM S1 Core) CS6002 Combinatorial Optimization (Elective) Jan-May 2022 CS5010 Graph Theory and Combinatorics (MCaM S2 Core) July-Nov 2021 CS2010 Logic for Computing (BTech S3 Core) CS5009 Algorithms (MCaM S1 Core) Jan-May 2021 CS2020 Discrete Mathematics (BTech S4 Core, jointly with Dr. Deepak Rajendraprasad) CS5003  Parameterized Algorithms (Elective) Jul-Nov 2020 CS2010 Logic for Computing (BTech S3 Core) CS5013 Topics in Discrete Mathematics (MCaM S1 Core) Jan-May 2020 CS2040  Design and Analysis of Algorithms (BTech S4 Core) CS2180  Artificial Intelligence Laboratory (BTech S4 Core, jointly with Dr. Chandra Shekar Lakshminarayanan) Jul-Nov 2019 CS5003  Parameterized Algorithms (Elective) CS2310  Data Structures and Algorithms Laboratory (BTech S3 Core, jointly with Dr. Sahely Bhadra) ID1030  Introduction to Engineering (BTech S1, CSE Coordinator) Jan-May 2019 CS2040  Design and Analysis of Algorithms (BTech S4 Core) CS1020  Introduction to Programming Laboratory (BTech S2 Core, jointly with Dr. Deepak Rajendraprasad and Dr. Jasine Babu) Jul-Nov 2018 CS2300  Data Structures and Algorithms (BTech S3 Core) CS2310  Data Structures and Algorithms Laboratory (BTech S3 Core, jointly with Dr. Albert Sunny) ID1030  Introduction to Engineering (BTech S1, CSE Coordinator) Research Group Dr. Jasine Babu (Assistant Professor) Dr. Deepak Rajendraprasad (Assistant Professor) Ms. Ardra P S (PhD Student) Ms. Kutty Malu V K (PhD Student) Publications Packing arc-disjoint cycles in oriented graphs Jasine Babu, Ajay Saju Jacob, R. Krithika, Deepak RajendraprasadJ. Comput. Syst. Sci. 143 (2024) Balanced Substructures in Bicolored GraphsP. S. Ardra, R. Krithika, Saket Saurabh and Roohani Sharma48th International Conference on Current Trends in Theory and Practice of Computer Science (SOFSEM 2023) (2023) Packing Arc-Disjoint 4-Cycles in Oriented GraphsJasine Babu, R. Krithika and Deepak Rajendraprasad42nd IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science (FSTTCS 2022) (2022) The Complexity of Contracting Bipartite Graphs into Small CyclesR. Krithika, Roohani Sharma and Prafullkumar TaleAccepted in 48th International Workshop on Graph-Theoretic Concepts in Computer Science (2022) Packing Arc-Disjoint Cycles in Tournaments S. Bessy, M. Bougeret, R. Krithika, A. Sahu, A. Saurabh, J. Thiebaut and M. Zehavi Algorithmica (2021) Parameterized and exact algorithms for class domination coloring R. Krithika, Ashutosh Rai, Saket Saurabh and Prafullkumar TaleDiscrete Applied Mathematics 291 286-299 (2021) Vertex deletion on split graphs: Beyond 4-hitting set P. Choudhary, P. Jain, R. Krithika and V. SahlotTheoretical Computer Science 845 21-37 (2020) Quadratic vertex kernel for split vertex deletion A. Agrawal, S. Gupta, P. Jain and R. KrithikaTheoretical Computer Science 833 164-172 (2020) Graph Hamiltonicity Parameterized by Proper Interval Deletion Set P. A. Golovach, R. Krithika, A. Sahu, S. Saurabh and M. ZehaviLATIN 2020: Theoretical Informatics - 14th Latin American Symposium Springer Lecture Notes in Computer Science 12118 104-115 (2020) Packing Arc-Disjoint Cycles in Bipartite Tournaments A. S. Jacob and R. KrithikaWALCOM: Algorithms and Computation - 14th International Conference, WALCOM 2020 Springer Lecture Notes in Computer Science 12049 249-260 (2020) The Parameterized Complexity of Cycle Packing: Indifference is Not an IssueR. Krithika, A. Sahu, S. Saurabh and M. ZehaviAlgorithmica (2019) Packing Arc-Disjoint Cycles in Tournaments S. Bessy, M. Bougeret, R.Krithika, A. Sahu, S. Saurabh, J. Thiebaut and M. Zehavi44th International Symposium on Mathematical Foundations of Computer Science (MFCS 2019) Leibniz International Proceedings in Informatics (LIPIcs) 138 27:1--27:14 (2019) Vertex Deletion on Split Graphs: Beyond 4-Hitting Set P. Choudhary, P. Jain, R. Krithika and V. SahlotInternational Conference on Algorithms and Complexity (CIAC) (2019) Quadratic Vertex Kernel for Split Vertex Deletion A. Agrawal, S. Gupta, P. Jain and R. KrithikaInternational Conference on Algorithms and Complexity (CIAC) (2019) The Parameterized Complexity of Cycle Packing: Indifference is Not an Issue R. Krithika, A. Sahu, S. Saurabh and M. ZehaviLatin American Symposium on Theoretical Informatics (LATIN) LNCS 10807 712-726 (2018) An FPT Algorithm for Contraction to Cactus R. Krithika, P. Misra and P. TaleComputing and Combinatorics (COCOON) LNCS 10976 341-352 (2018) Approximability of Clique Transversal in Perfect Graphs S. Fiorini, R. Krithika, N. S. Narayanaswamy and V. RamanAlgorithmica 80 (8) 2221–2239 (2018) Dynamic Parameterized Problems R. Krithika, A. Sahu and P. TaleAlgorithmica 80 (9) 2637–2655 (2018) Revisiting Connected Vertex Cover: FPT Algorithms and Lossy Kernels R. Krithika, D. Majumdar and V. RamanTheory of Computing Systems 62 (8) 1690–1714 (2018) Parameterized and Exact Algorithms for Class Domination Coloring R. Krithika, A. Rai, S. Saurabh and P. TaleInternational Conference on Current Trends in Theory and Practice of Computer Science (SOFSEM) LNCS 10139 336-349 (2017) On the Parameterized Complexity of Simultaneous Deletion Problems A. Agrawal, R. Krithika, D. Lokshtanov, A. E. Mouawad and M. S. RamanujanFoundations of Software Technology and Theoretical Computer Science (FSTTCS) LIPIcs 93 9:1-9:14 (2017) Lossy Kernels for Graph Contraction Problems R. Krithika, P. Misra, A. Rai and P. TaleFoundations of Software Technology and Theoretical Computer Science (FSTTCS) LIPIcs 65 23:1-23:14 (2016) Dynamic Parameterized Problems R. Krithika, A. Sahu and P. TaleInternational Symposium on Parameterized and Exact Computation (IPEC) LIPIcs 63 19:1--19:14 (2016) LP Approaches to Improved Approximation for Clique Transversal in Perfect Graphs S. Fiorini, R. Krithika, N. S. Narayanaswamy and V. RamanEuropean Symposium on Algorithms (ESA) LNCS 8737 430-442 (2014) A Dirac-type Characterization of k-chordal Graphs R. Krithika, R. Mathew, N. S. Narayanaswamy and N. SadagopanDiscrete Mathematics 313 (24) 2865-2867 (2013) Another Disjoint Compression Algorithm for Odd Cycle Transversal R. Krithika and N. S. NarayanaswamyInformation Processing Letters 113 (22-24) 849-851 (2013) Parameterized Algorithms for (r,l)-Partization R. Krithika and N. S. NarayanaswamyJournal of Graph Algorithms and Applications 17 (2) 129-146 (2013) Generalized Above Guarantee Vertex Cover and r-Partization R. Krithika and N. S. NarayanaswamyInternational Workshop on Algorithms and Computation (WALCOM) LNCS 7157 17-27 (2012) Address Indian Institute of Technology Palakkad Kanjikode | Palakkad Kerala | Pin: 678623 +91 491 209 2001 (Office) | +91 491 2092035 (Academic Section) netadmin@iitpkd.ac.in Copyright ©2023 Indian Institute of Technology Palakkad. All Rights Reserved.",
  "content_length": 8744,
  "method": "requests",
  "crawl_time": "2025-12-01 14:13:59"
}