{
  "name": "R. M. Duwairi",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=rehab",
  "status": "success",
  "content": "Rehab Mustafa Duwairi × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content rehab mustafa duwairi • Computer Information System Department - Faculty Member • Department of Computer Science - Faculty Member 22441 A2 3rd floor- Engineering Building Computer Information System Department rehab@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from University of Wales/Cardiff, 1997 Msc. of Computer Science from University of Wales/Cardiff, 1994 Bsc. of Computer Science from Yarmouk University, 1989 Publications Rehab Duwairi, Mohammad Al-Refai, Natheer Khasawneh , \"Feature Reduction Techniques for Arabic Text Categorization,\" Journal of the American Society for Information Science and Technology (JASIST), vol. 60, no. 11, pp. 2347-2352, 2009 Rehab Duwaiir, Rania Al-Zubaidi , \"A Hierarchical K-NN Classifier for Textual Data,\" International Arab Journal for Information Technology (IAJIT), vol. 8, no. 3, pp. 251-258, 2011 R. M. Duwairi , \"Arabic Text Categorization,\" International Arab Journal for Information Technology (IAJIT), vol. 4, no. 2, pp. 125-132, 2007 R. M. Duwairi , \"Machine Learning for Arabic Text Categorization,\" Journal of the American Society for Information Science and Technology (JASIST), vol. 57, no. 8, pp. 1005-1010, 2006 R. M. Duwairi , \"A Framework for the Computerized Assessment of University Student Essays,\" International Journal of Computers in Human Behavior, vol. 22, no. 3, pp. 381-388, 2006 R. M. Duwairi , \"Clustering Semantically Related Classes in a Heterogeneous Multidatabase System,\" Journal of Information Sciences, vol. 162 , no. , pp. 193-210, 2004 Rehab Duwairi, Mahmoud El-Orfali, \"A Study of the Effects of Preprocessing Strategies on Sentiment Analysis for Arabic Text,\" Journal of Information Science, vol. 40, no. 4, pp. 501-5013, 2014 Rehab Duwairi; Hadeel Ammari, \"An enhanced CBAR algorithm for improving recommendation systems accuracy,\" Simulation Modelling Practice and Theory, vol. 60, no. /, pp. 54-68, 2015 Rehab M Duwairi, Nizar Mahyoub, Saleh Alrefai, , \"Detecting Sentiment Embedded in Arabic Social Media ? A Lexicon-based Approach,\" Journal of Intelligent and Fuzzy Systems, vol. 29, no. 1, pp. 107-117, 2015 Rehab Duwairi, Mohammed Abu Rehmeh, \"A Novel Approach for Initializing the Spherical K-means Clustering Algorithm,\" Journal of Simulation Modelling Practice and Theory, vol. 54, no. , pp. 49-63, 2015 Rehab M. Duwairi, Islam Qarqaz, \"A framework for Arabic sentiment analysis using supervised classification,\" International Journal of Data Mining, Modelling and Management, vol. , no. , pp. 0-0, Rehab Duwairi, Mona Hedaya, \"Automatic Keyphrase Extraction for Arabic News Documents based on KEA System,\" Journal of Intelligent and Fuzzy Systems, vol. 30, no. 4, pp. 2101-2110, 2016 Mostafa Ali, Noor Awad, Ponnuthurai Suganthan, Rehab Duwairi, Robert Reynolds, \"A Novel Hybrid Cultural Algorithms Framework with Trajectory based Search for Global Numerical Optimization,\" Information Sciences, vol. 334?335, no. , pp. 219-249, 2016 Mostafa Ziyad, Noor Awad, Rehab Duwairi, \"Multi-Objective Differential Evolution with a New Improved Mutation Strategy,\" International Journal of Artificial Intelligence, vol. , no. , pp. 0-0, Mohammed Elmadhi, Mark Hasegawa-Johnson, Eiman Mustafawi, Rehab Duwairi, Wolfgang Minker , \"Challenges and techniques for dialectal Arabic speech recognition and machine translation,\" Qatar Foundation Research Forum, Nov 2011, pp. 0-0 Mark Hasegawa-Johnson, Jui-Ting Huang, Rehab Duwairi, Eiman Mustafawi,  Roxana Girju, and Elabbas Benmamoun , \"Learning to Recognize Speech from a Small Number of Labeled Examples,\" Poster presentation. Qatar Foundation Research Forum, Nov 2011, pp. 0-0 Rehab Duwairi , Ebraheem Elhadad, Mohammed Towaiq , \"Coupling Web Usage Mining with Content Mining for Recommendation Systems ,\" The 14th International Conference on Systemics, Cybernetics, and Informatics (WMSCI 2010), Jun 2010, pp. 0-0 Ali Jaoua, Rehab Duwairi, Samir Elloumi and Sadok Ben Yahia , \"Data mining, reasoning and incremental information retrieval through non enlargeable rectangular relation coverage ,\" The 11th International Conference on Relational Methods in Computer Science (RelMiCS) and 6th International Conference on applications of Kleene Algebra (AKA), Nov 2009, pp. 199-210 Monther Aldwairi, W. Alqarqaz, R. Duwairi , \"A Classification System for Predicting RNA Secondary Structure Elements,\" International Joint Conference on Bioinformatics, Systems Biology and Intelligent Computing (IJCBS'09), 2009, pp. 0-0 Rehab Duwairi, Amal Kassawneh , \"A Framework for Predicting Proteins 3D Structures,\" The 6th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA-08), Mar 2008, pp. 0-0 Rehab Duwairi, Mohammad Al-Refai, Natheer Khasawneh , \"Stemming Versus Light Stemming as Feature Selection Techniques for Arabic Text Categorization,\" 4th International Conference on Innovations in Information Technology, Nov 2007, pp. 0-0 R. M. Duwairi, A. Rawashdeh , \"A User Centered Matchmaking and Ranking System,\" The 1st International Conference on Digital Communications and Computer Applications (DCCA2007), 2007, pp. 0-0 R. M. Duwairi, K. Al-Jada’ , \"Enhancing Cluster Quality Using User Browsing Time,\" The International Arab Conference on Information Technology (ACIT), Dec 2006, pp. 0-0 R. M. Duwairi, Fadi Tashtoush , \"LSC-CHAM: a New Algorithm for Intrusion Detection Systems,\" The 4th International Multi-Conference on Computer Science and Information Technology, Apr 2006, pp. 0-0 R. M. Duwairi , \"A Distance-based Classifier for Arabic Text Categorization,\" International Conference on Data Mining (DMIN'05), Jun 2005, pp. 0-0 R. M. Duwairi , \"Auto-grader: A Framework for the Automatic Grading of Essays,\" International Conference on Computer Science and its Applications (ICCSA-2004) , Jun 2004, pp. 0-0 R. M. Duwairi , \"A Framework for Generating and Maintaining Global Schemas in Heterogeneous Multidatabase Systems,\" The 2003 International Conference on Information Reuse and Integration (IRI'03), Oct 2003, pp. 0-0 R. M. Duwairi , \"Discovery of Semantically Relevant Classes in a Heterogeneous Multidatabase System,\" The 2002 International Conference on Software Engineering Research and Practice (SERP'02), Jun 2002, pp. 0-0 Rehab Duwairi, Basil Mahafzah and Abdel-Elah Al-Ayyoub , \"A Framework for Performance Assessment of Parallel Bi-Directional Heuristic Search,\" The 2002 International Conference on Artificial Intelligence (IC-IA), Jun 2002, pp. 0-0 R. M. Duwairi, N. J. Fiddian, W. A. Gray , \"Views for Heterogeneous Object-Oriented Database Integration,\" , Jun 1997, pp. 0-0 R. M. Duwairi, N. J. Fiddian and W. A. Gray , \"Schema Integration Meta-Knowledge Classification and Reuse,\" Proceedings of the 14th BNCOD Conference, 1996, pp. 0-0 R. M. Duwairi, N. J. Fiddian and W. A. Gray , \"A Multiple View Definition System for Supporting Interoperability among Heterogeneous and Autonomous Databases,\" The 10th ECRIM Workshop on Heterogeneous Information Management, Dec 1996, pp. 0-0 Rehab M. Duwairi, Islam Qarqaz, \"Arabic Sentiment Analysis using Supervised Classification,\" The 1st International Workshop on Social Networks Analysis, Management and Security (SNAMS - 2014, Aug 2014, pp. 0-0 Mark Hasegawa-Johnson, Elabbas Benmamoun, Eiman Mustafawi, Mohamed Elmahdy and Rehab Duwairi, \"On the Definition of Word Segmental,\" The 6th International Conference of Speech Prosody SP2012, May 2012, pp. 0-0 Rania Al-Sabbagh, Roxana Girju, Mark Hasegawa-Johnson, Abbas Benmamoun, Rehab Duwairi, Eiman Mustafawi, \"Using Web Mining Techniques to Build a Multi-Dialect Lexicon of Arabic,\" Proceedings of the 3rd Conference on Linguistics in the Gulf, Mar 2011, pp. 0-0 Rehab Duwairi, Mohammad A. Alshboul, \"Negation-aware Framework for Sentiment Analysis in Arabic Reviews,\" The 2nd International Workshop on Social Networks Analysis, Management and Security (SNAMS - 2015) , Aug 2015, pp. 0-0 Rehab Duwairi, Mosab Alfaqeh, \"RUM Extractor: A Facebook Extractor for Data Analysis,\" The 2nd International Workshop on Social Networks Analysis, Management and Security (SNAMS - 2015), Aug 2011, pp. 0-0 Rehab Duwairi, \"Sentiment Analysis for Dialectical Arabic,\" The 6th International Conference on Information and Communication Systems (ICICS), , Apr 2015, pp. 0-0 Mostafa Z. Ali, Noor Awad, Rehab Duwairi, Jafar Albadarneh, Robert G. Reynolds, Ponnuthurai N. Suganthan, \"Cluster-Based Differential Evolution with Heterogeneous Influence for Numerical Optimization,\" 2015 IEEE Congress on Evolutionary Computation, May 2015, pp. 0-0 Muhannad Quwaider, Yaser Jararweh, Mahmoud Al-Alyyoub, Rehab Duwairi, \"Experimental Framework for Mobile Cloud Computing System,\" First International Workshop on Mobile Cloud Computing Systems, Management and Security (MCSMS-2015), May 2015, pp. 0-0 Rehab M. Duwairi, Raed Marji, Narmeen Sha’ban, Sally Rushaidat, \"Sentiment Analysis in Arabic Tweets,\" 5th International Conference on Information and Communication Systems, Apr 2014, pp. 0-0 Noor Awad, Mostafa Ali, Rehab Duwairi, \"Cultural Algorithm with Improved Local Search for Optimization Problems,\" The 2013 IEEE Congress on Evolutionary Computation, , Jun 2013, pp. 0-0 Rehab Duwairi, \"Statistical Feature Selection Techniques for Arabic Text Categorization,\" The Fourth International Conference on Information and Communication Systems (ICICS 2013), Apr 2013, pp. 0-0 Rehab Duwairi, Mosab Alfaqeh, \"Sentiment Analysis for Arabizi Text,\" The 7th International Conference on Information and Communication Systems (ICICS), Apr 2016, pp. 0-0 \"Towards a robust deep learning framework for Arabic sentiment analysis\", Natural Language Engineering (now called: Natural Language Processing) Azzam Galal Mohammed Radman, Rehab Mustafa Mohaamed Duwairi 06/09/2024 \"Neural Arabic singular-to-plural conversion using a pretrained Character-BERT and a fused transfo",
  "content_length": 14547,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:02"
}