{
  "name": "Raanan Fattal",
  "homepage": "http://www.cs.huji.ac.il/~raananf",
  "status": "success",
  "content": "Raanan Fattal Raanan Fattal The Benin School of Computer Science and Engineering The Hebrew University of Jerusalem Edmund Safra Campus Giva't Ram, Jerusalem 91904, Israel Email: Phone (and fax): +972-2-549-4554 Room C429, Rothberg Building Campus tour guide רענן פטאל בית הספר להנדסה ומדעי המחשב ע\"ש בנין האוניברסיטה העברית בירושלים קמפוס אדמונד ספרא גבעת רם ,ירושלים 91904, ישראל :דואר אלקטרוני 02-549-4554 :(טלפון (ופקס בניין ע\"ש רוטברג,C429 חדר חוברתהדרכת סיורים בקמפוס I am a faculty member at the School of Computer Science and Engineering at the Hebrew University of Jerusalem, Israel. I received my PhD from the Hebrew University in 2005, and was a post-doctoral Miller Fellow at the University of California, Berkeley until 2008. Research interests: image processing, computer graphics and vision, and numerical computing. I am co-chairing the ICCP 2014, click here for the conference page Publications Single Image Object Counting and Localizing using Active-Learning, I. Huberman and R. Fattal, IEEE Workshop on Applications of Computer Vision (WACV) 2021 | [project page] Unpaired Learning for High Dynamic Range Image Tone Mapping, Y. Vinker, I. Huberman, and R. Fattal, Computer Vision and Pattern Recognition (CVPR) 2021 | [project page] Deblurring using Analysis-Synthesis Networks Pair, A. Kaufman and R. Fattal, Computer Vision and Pattern Recognition (CVPR) 2020 | [project page] Object Partitioning for Support-Free 3D-Printing, E. Karasik, R. Fattal, and M. Werman, Computer Graphics Forum / Eurographics 2019 | [project page] Detecting Repeating Objects using Patch Correlation Analysis, I. Huberman and R. Fattal, IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2016 | [project page] Reducing Lateral Visual Biases in Displays, I. Huberman and R. Fattal, Computer Graphics Forum 2015 | [project page] Dehazing using Color-Lines, R. Fattal, ACM Transactions on Graphics 2014 | [project page] Automatic Recovery of the Atmospheric Light in Hazy Images, M. Sulami, I. Geltzer, R. Fattal and M. Werman, IEEE Conference on Computational Photography (ICCP 2014) | [project page] Efficient Preconditioning of Laplacian Matrices for Computer Graphics, D. Krishnan, R. Fattal and R. Szeliski, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2013) | [project page] Blur-Kernel Estimation from Spectral Irregularities, A. Goldstein and R. Fattal, European Conference on Computer Vision (ECCV 2012) | [project page] Apparent Resolution Enhancement for Motion Videos, F. Berthouzoz and R. Fattal, ACM Symposium on Applied Preception (SAP 2012) | [project page] Video Stabilization using Epipolar Geometry, A. Goldstein and R. Fattal, ACM Transactions on Graphics 31(5) (pres. in SIGGRAPH Asia 2012) | [project page] Resolution Enhacmenent using Vibrating Displays, F. Berthouzoz and R. Fattal, ACM Transactions on Graphics 31(2) (Proc. ACM SIGGRAPH 2012) | [project page] Convolution Pyramids, Z. Farbman, R. Fattal and D. Lischinski, ACM Transactions on Graphics 31(5) (Proc. ACM SIGGRAPH Asia 2011) | [project page] Blue-Noise Point Sampling using Kernel Density Model, R. Fattal, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2011) | [project page] Image and Video Upscaling from Local Self-Examples, G. Freedman and R. Fattal ACM Transactions on Graphics (ACM Trans. on Graphics 2010, pres. in SIGGRAPH 2011) | [project page] Diffusion maps for edge-aware image editing, Zeev Farbman, Raanan Fattal, and Dani Lischinski, ACM Transactions on Graphics 29(5) (Proc. ACM SIGGRAPH Asia 2010) | [project page] Image Upsampling via Texture Hallucination, Y. HaCohen, R. Fattal and D. Lischinski, IEEE International Conference on Computational Photography (ICCP 2010) | [project page] Improved Unsupervised POS Induction Using Intrinsic Clustering Quality and a Zipfian Constraint, Roi Reichart, Raanan Fattal and Ari Rappoport, Conference on Computational Natural Language Learning (CoNLL 2010) | [paper] Edge-Avoiding Wavelets and their Applications, R. Fattal, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2009) | [project page] NEW C++/Matlab code Edge-Based Image Coarsening, R. Fattal, R. Carroll and M. Agrawala ACM Transactions on Graphics (volume 29, issue 1, 2009) | [project page] Participating Media Illumination using Light Propagation Maps, R. Fattal, ACM Transactions on Graphics (volume 28, issue 1, 2009) | [project page] Single Image Dehazing, R. Fattal, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2008) | [project page] Edge-Preserving Decompositions for Multi-scale Tone and Detail Manipulation, Z. Farbman, R. Fattal, D. Lischinski, and R. Szeliski, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2008) | [project page] Image Upsampling via Imposed Edges Statistics, R. Fattal, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2007) | [project page] Multiscale Shape and Detail Enhancement from Multi-light Image Collections, R. Fattal, M. Agrawala and S. Rusinkiewicz, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2007) | [project page] Efficient Simulation of Inextensible Cloth, R. Goldenthal, D. Harmon, R. Fattal, M. Bercovier and E. Grinspun, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2007) | [project page] Global stability of equilibrium manifolds, and peaking behaviour in quadratic differential systems related to viscoelastic models, R. Fattal, O.H. Hald, H. Katriel, and R. Kupferman, Journal of Non-Newtonian Fluid Mechanics | [paper] Pose Controlled Physically-Based Motion, R. Fattal and D. Lischinski, Computer Graphics Forum (2006) | [paper] Flow of viscoelastic fluids past a cylinder at high Weissenberg number: stabilized simulations using matrix logarithms, M.A. Hulsen, R. Fattal and R. Kupferman, Journal of Non-Newtonian Fluid Mechanics | [paper] Time-dependent simulation of viscoelastic flows at high Weissenberg number using the log-conformation representation, R. Fattal and R. Kupferman, Journal of Non-Newtonian Fluid Mechanics | [paper] Constitutive laws for the matrix-logarithm of the conformation tensor, R. Fattal and R. Kupferman, Journal of Non-Newtonian Fluid Mechanics | [paper] Target-Driven Smoke Animation, R. Fattal and D. Lischinski, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2004) | [project page] Gradient Domain High Dynamic Range Compression, R. Fattal, D. Lischinski and M. Werman, ACM Transactions on Graphics (Proc. ACM SIGGRAPH 2002) | [project page] Variational classification for visualization of 3D ultrasound data, R. Fattal and D. Lischinski, Proceedings of IEEE Visualization 2001 | [project page] Courses and Seminars Introduction to Computer Graphics (67609)| [webepage]. Introduction to Numerical Computing (67549)| [webepage]. Chapters in Scientific Computing (67714) | [webpage]. Advanced Seminar in Computer Graphics (67719) | [webpage]. Seminar in Computer Graphics (67811/67857) | [webpage].",
  "content_length": 6990,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:04"
}