{
  "name": "Rachel Pottinger",
  "homepage": "http://www.cs.ubc.ca/~rap",
  "status": "success",
  "content": "Dr. Rachel Pottinger - The University of British Columbia Dr. Rachel Pottinger | Research Homepage for Rachel Pottinger Search Computer ScienceDr. Rachel Pottinger Home People Teaching Papers Bio CV About Me I am a Professor of Computer Science at the University of British Columbia. My research group is the data management and mining group. Contact Info rap@cs.ubc.ca 345-2366 Main Mall Vancouver, BC V6T 1Z4 604-822-0436 Research Interests My research centres on (1) how to help people understand and explore their data, (2) how to manage data that is currently not well supported by databases, and (3) how data can be managed in situations where there are multiple databases. To that end, my students and I are currently exploring a number of topics, including: Data lakes and open data are not easy to navigate. Trying to improve the ability for users to find the data that they are looking for is important to making the most of data. In this project we are focusing on table annotation and discovery in data lakes. This work is joint work with Jianhao Cao. In many cases where analysis is being performed, a user may have an aggregation query to which she knows what the correct answer should be for one case. Trying to determine why the answer that the user is getting is different from the one provided by the “Oracle” is a frustrating and error-prone process. This project seeks to allow users to get feedback to why their aggregation queries are not providing the answer that they expect. This project begain as joint work with former student Omar AlOmeir and is now continuing with student Carol Huang. When asking queries, it can be useful to try to predict what the next query will be based on queries that have been asked in the past. This is part of a serious of long going project, most of which have used machine learning techniques. Work in this area in the past has been joint with Eugenie Lai, Zainab Zolaktaf, Mostafa Milani, and Omar AlOmeir, and is currently being worked on be Ehsan Soltan Aghai. Home People Teaching Papers Bio CV",
  "content_length": 2060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:06"
}