{
  "name": "Rachee Singh",
  "homepage": "https://www.racheesingh.com",
  "status": "success",
  "content": "Home | Rachee Singh Rachee Singh Students Research Impact Funding Service Talks Teaching Google Scholar CV Email I am an assistant professor of Computer Science at Cornell University where I lead the sysphotonics group. The sysphotonics group develops systems and algorithms for efficient communication on server-scale, rack-scale and long-haul photonic interconnects. We use these systems to improve the performance of important applications like distributed machine learning and general planet-scale cloud workloads. I am also an Amazon Scholar in the SageMaker Hyperpod teams that specialize in large-scale ML infrastructure. News 2025.09: Jonathan and Byungsoo’s work on MoE in a single kernel was accepted to NeurIPS 2025! 2025.09: Eric and Chuhan’s work on photonic rail datacenters was accepted to ACM HotNets 2025! 2025.09: Our work on software managed networks was accepted to ACM HotNets 2025! 2025.08: Arjun’s paper on chasing Shannon’s limit was accepted to ACM IMC 2025! 2025.07: Awarded an NSF grant to achieve efficient collective communication in the cloud! 2025.07: Arjun’s paper on mitigating wavelength-specific faults was accepted to USENIX NSDI 2026! 2025.07: Bhaskar and Howard’s paper on tuning optical WANs was accepted to USENIX NSDI 2026! 2025.03: Thrilled to receive a Cisco Research Award! 2025.01: Our work on efficient preemption of LLM inference will appear at ACM ASPLOS 2025! 2025.01: SRC and DARPA fund my group as part of the JUMP 2.0 program! 2024.12: Atkinson Center for Sustainability funds our work on photonic interconnects! 2024.12: Our work on chip-to-chip photonic interconnects will appear at OFC 2025! 2024.12: Our work on programmable integrated photonics will appear at OFC 2025! 2024.12: Our work on multi-WAN transport got accepted to USENIX NSDI 2025! 2024.08: Received a $1M grant from the NSF on chip-to-chip photonic fabrics for ML! 2024-07: Thrilled to be invited to attend the NSF Ideas Lab on breaking low-latency barriers! 2024.05: Thrilled to receive the PCCW Affinito-Stewart Grant from Cornell! 2024.03: Thrilled to receive the Amazon Research Award! Publications HEDGE: Traffic Engineering with Probabilistic Link Capacities Arjun Devraj, Bill Owens, Umesh Krishnaswamy, Ying Zhang, Rachee Singh USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2026 Learning to Tune Optical WANs: Field Deployment of a Learned Noise Model Bhaskar Kataria, Howard Hua, Bill Owens, Andrea D’Amico, Rachee Singh USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2026 FlashMoE: Fast Distributed MoE in a Single Kernel Jonathan Aimuyo, Byungsoo Oh, Rachee Singh Conference on Neural Information Processing Systems (NeurIPS 2025) Photonic Rails in ML Datacenters Eric Ding, Chuhan Ouyang, Rachee Singh Twenty-Fourth ACM Workshop on Hot Topics in Networks (HotNets 2025) Software Managed Networks via Coarsening Pradeep Dogga, Rachee Singh, Suman Nath, Ravi Netravali, Jens Palsberg, George Varghese Twenty-Fourth ACM Workshop on Hot Topics in Networks (HotNets 2025) The Reality of Chasing Shannon’s Limit in Optical Wide-Area Networks Arjun Devraj, Bill Owens, Rachee Singh ACM Internet Measurement Conferenc (IMC), 2025 Aqua: Network-Accelerated Memory Offloading for LLMs in Scale-Up GPU Domains Abhishek Vijaya Kumar, Gianni Antichi, Rachee Singh ACM International Conference on Architectural Support for Programming Languages and Operating System (ASPLOS), 2025 Chip-to-Chip Photonic Connectivity in Multi-Accelerator Servers for ML Abhishek Vijaya Kumar, Arjun Devraj, Darius Bunandar, Rachee Singh Optical Fiber Communications (OFC), 2025 PipSwitch: A Circuit Switch Using Programmable Integrated Photonics Eric Ding, Rachee Singh Optical Fiber Communications (OFC), 2025 Efficient multi-WAN transport for 5G with OTTER Mary Hogan, Yiming Qiu, Gerry Wan, Sharad Agarwal, Ryan Beckett, Rachee Singh, Victor Bahl USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2025 A case for server-scale photonic connectivity Abhishek Vijaya Kumar, Arjun Devraj, Darius Bunandar, Rachee Singh Twenty-Third ACM Workshop on Hot Topics in Networks (HotNets), 2024 An optical slice of the wide-area network Abhishek Vijaya Kumar, Bill Owens, Nikolaj Bjorner, Binbin Guan, Yawei Yin, Victor Bahl, Rachee Singh USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2024 Teal: Learning-Accelerated Optimization of WAN Traffic Engineering Zhiying Xu, Francis Y. Yan, Rachee Singh, Justin T. Chiu, Alexander M. Rush, Minlan Yu ACM Special Interest Group on Data Communications (SIGCOMM), 2023 OneWAN is better than two: Unifying a split wide-area network architecture Umesh Krishnaswamy, Rachee Singh, Paul Mattes, Paul-Andre C Bissonette, Nikolaj Bjorner, Zahira Nasrin, Sonal Kothari, Prabhakar Reddy, John Abeln, Srikanth Kandula, Himanshu Raj, Luis Irun-Briz, Jamie Gaudette, Erica Lan USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2023 Making Sense of Constellations: Methodology for Understanding Starlink’s Scheduling Algorithms Hammas Bin Tanveer, Mike Puchol, Rachee Singh, Antonio Bianchi, Rishab Nithyanand International Conference on emerging Networking EXperiments and Technologies (ACM CoNEXT), 2023 Glowing in the dark: Uncovering IPv6 address discovery and scanning strategies Hammas Bin Tanveer, Rachee Singh, Paul Pearce, Rishab Nithyanand USENIX Security Symposium (USENIX Security), 2023 TACCL: Guiding Collective Algorithm Synthesis using Communication Sketches Aashaka Shah, Vijay Chidambaram, Meghan Cowan, Saeed Maleki, Madan Musuvathi, Todd Mytkowicz, Jacob Nelson, Olli Saarikivi, Rachee Singh USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2023 Traffic engineering: from ISP to cloud wide-area networks Rachee Singh, Nikolaj Bjorner, Umesh Krishnaswamy ACM SIGCOMM Symposium on SDN Research (SOSR 2022) Decentralized cloud wide-area network traffic engineering with BlastShield Umesh Krishnaswamy, Rachee Singh, Nikolaj Bjorner, Himanshu Raj USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2022 Cost-effective capacity provisioning in wide area networks with Shoofly Rachee Singh, Nikolaj Bjorner, Sharon Shoham, Yawei Yin, John Arnold, Jamie Gaudette ACM Special Interest Group on Data Communications (SIGCOMM), 2021 Press Coverage:APNIC Blog PredictRoute: A Network Path Prediction Toolkit Rachee Singh, David Tench, Phillipa Gill, Andrew McGregor ACM SIGMETRICS, 2021 Surviving switch failures in cloud datacenters Rachee Singh, Muqeet Mukhtar, Ashay Krishna, Aniruddha Parkhi, Jitendra Padhye, David Maltz SIGCOMM Computer Communication Review (CCR), 2021 Press Coverage:The Next Platform Cost-effective Cloud Edge Traffic Engineering with Cascara Rachee Singh, Sharad Agarwal, Matt Calder, Victor Bahl USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2021 Characterizing the performance and deployment of Multi-CDNs Rachee Singh, Arun Dunna, Phillipa Gill ACM Internet Measurement Conference (IMC), 2018 RADWAN: Rate Adaptive Wide Area Network Rachee Singh, Manya Ghobadi, Klaus-Tycho Foerster, Mark Filer, Phillipa Gill ACM Special Interest Group on Data Communications (SIGCOMM), 2018 Run, Walk, Crawl: Towards Dynamic Link Capacities Rachee Singh, Manya Ghobadi, Klaus-Tycho Foerster, Mark Filer, Phillipa Gill ACM Hot Topics in Networking (HotNets), 2017 Community Dialogue: HotNets Dialogue Press Coverage:Microsoft Research Blog, Datacenter Knowledge Characterizing the Nature and Dynamics of Tor Exit Blocking Rachee Singh, Rishab Nithyanand, Sadia Afroz, Paul Pearce, Michael Carl Tschantz, Phillipa Gill, Vern Paxson USENIX Security Symposium (Security), 2017 The Politics of Routing: Investigating the Relationship Between AS Connectivity and Internet Freedom Rachee Singh, Hyungjoon Koo, Najmehalsadat Miramirkhani, Fahimeh Mirhaj, Phillipa Gill, Leman Akoglu USENIX Free and Open Communications on the Internet (FOCI), 2016",
  "content_length": 7973,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:02"
}