{
  "name": "Rachel Menzies",
  "homepage": "https://discovery.dundee.ac.uk/en/persons/rachel-menzies",
  "status": "success",
  "content": "Rachel Menzies - Discovery - the University of Dundee Research Portal View Scopus Profile Menzies, Rachel Dr Senior Lecturer (Teaching and Scholarship), Computing https://orcid.org/0000-0002-3942-130X h-index 424 Citations 10 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20112022 Research activity per year Personal profile Teaching[profile coming soon] see rachelmenzies.co.uk for more information Fingerprint Dive into the research topics where Rachel Menzies is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Accessibility Issues Keyphrases 100% Visual Impairment Computer Science 87% Augmentative Communication Keyphrases 75% Alternative Communication Keyphrases 75% User-Centered Design Computer Science 75% User-centered Design Keyphrases 70% Intellectual Disability Keyphrases 67% Dentists Keyphrases 58% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2011 2011 2013 2014 2015 2018 2019 2020 2022 13 Conference contribution 8 Article 3 Poster 1 Other chapter contribution 1 More 1 Paper Research output per year Research output per year Author Reflections on Creating Accessible Academic PapersMenzies, R., Tigwell, G. W. & Crabb, M., Dec 2022, In: ACM Transactions on Accessible Computing. 15, 4, p. 1-36 36 p., 33.Research output: Contribution to journal › Article › peer-review Open AccessFile Academic Papers 100% Content Element 100% Human-Computer Interaction 33% Conducted Interview 33% Writing Resource 33% 7 Citations (Scopus) 400 Downloads (Pure) Emoji Accessibility for Visually Impaired PeopleTigwell, G. W., Gorman, B. M. & Menzies, R., Apr 2020, CHI '20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. New York: Association for Computing Machinery (ACM), 14 p. 3376267Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Visually Impaired People 100% Visually Impaired 100% Emoji 100% Social Interaction 100% Visual Impairment 100% 33 Citations (Scopus) Professional Communication Tools in Higher Education: A Case Study in Implementing Slack in the CurriculumMenzies, R. & Zarb, M., 4 Dec 2020, 2020 IEEE Frontiers in Education Conference (FIE)- Proceedings. IEEE, 8 p. 9273906Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Higher Education 100% Communication Tools 100% Professional Communication 100% Case Study 100% Communication Tool 100% 16 Citations (Scopus) Reflections on Using Chat-Based Platforms for Online Interviews with Screen-Reader UsersMenzies, R., Gorman, B. M. & Tigwell, G. W., 26 Oct 2020, ASSETS 2020 - 22nd International ACM SIGACCESS Conference on Computers and Accessibility. Guerreiro, T., Nicolau, H. & Moffatt, K. (eds.). Association for Computing Machinery, 4 p. 79Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Screen Reader Users 100% Chat-based 100% Online Interviews 100% Screen Reader User 100% Chat 100% 1 Citation (Scopus) Take a GANDER: Gathering Accessibility Needs by Doing Explorative ResearchCrabb, M. (Lead / Corresponding author), Menzies, R., Tigwell, G., Clarke, D., Lim, S. C. & Henderson, C., 10 Apr 2019. 4 p.Research output: Contribution to conference › Paper › peer-review Digital Space 100% Accessibility Issues 100% Physical World 100% Explorative Research 100% Mobile Phones 100% View all 26 research outputs Activities Activities per year 2011 2011 2012 2013 2014 2015 2018 2018 3 Participation in conference 2 Public engagement and outreach - public lecture/debate/seminar 1 Festival/Exhibition 1 Schools engagement Activities per year Cafe Science Dundee - Virtual Reality: The Future is NowUrch, J. (Organiser), Menzies, R. (Presenter), Vincent, B. (Chair) & Wasim, S. (Organiser)12 Mar 2018Activity: Other activity types › Public engagement and outreach - public lecture/debate/seminar Discovery Days 2015Urch, J. (Organiser), Downes, P. (Chair), Beech, N. (Presenter), Rowland, C. (Presenter), Dowell, J. (Presenter), Kaunert, C. (Member), Paul, J. (Presenter), Zhu, Y. (Presenter), Field, M. (Presenter), Nic Daeid, N. (Presenter), Gartner, A. (Presenter), Parkes, S. (Presenter), Kroll, T. (Presenter), Menzies, R. (Presenter), Scott, M. (Presenter), Illsley, B. (Presenter), Klaes, M. (Presenter), Rogers, J. (Presenter), Allanson, P. (Presenter), Harris, P. (Presenter), Whatley, C. (Presenter), Marra, M. (Presenter), Leslie, A. (Presenter) & Wasim, S. (Organiser)8 Jan 2015 → 9 Jan 2015Activity: Other activity types › Public engagement and outreach - public lecture/debate/seminar 16th Biennial Conference of the International Society for Augmentative and Alternative Communication Menzies, R. (Participant)22 Jul 2014Activity: Participating in or organising an event types › Participation in conference 2014 Strathmore TrophyMenzies, R. (Organiser)23 Jun 2014Activity: Other activity types › Schools engagement 15th ACM SIGACCESS Conference on Computers and AccessibilityMenzies, R. (Participant)21 Oct 2013 → 23 Oct 2013Activity: Participating in or organising an event types › Participation in conference View all 7 activity Press/Media New app relieves patients’ fear of the dentistBlack, R., Waller, A., Menzies, R. & Herron, D.17/06/141 item of Media coveragePress/Media: Research New app relieves patients’ fear of the dentistBlack, R., Waller, A., Menzies, R., Herron, D. & Herron, D.17/06/141 item of Media coveragePress/Media: Research Speech App Helps Disabled People to Communicate at the DentistBlack, R., Waller, A., Menzies, R., Herron, D. & Herron, D.16/06/14 → 17/06/143 items of Media coveragePress/Media: Research",
  "content_length": 6071,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:06"
}