{
  "name": "Rachid Hourizi",
  "homepage": "http://www.bath.ac.uk/cdas/people/associates/rachid-hourizi/index.html",
  "status": "success",
  "content": "Rachid Hourizi - the University of Bath's research portal View Scopus Profile Rachid Hourizi Prof Director of the Institute of Coding (IoC), Department of Computer ScienceCentre for Networks and Collective BehaviourCentre for Death and Society Phone+44 (0) 1225 385934EmailR.Hourizibath.acuk 1 WEST 3.50 Personal profile Research interestsAs Director of the Institute of Coding (IoC), Rachid leads a national Institute announced by the Prime Minister in January 2018. He has broad experience leading the teaching of coding, digital skills and entrepreneurship within the University of Bath, Department of Computer Science at both undergraduate and postgraduate levels. He also led efforts to have the Bath placement scheme professionally certified (the first such certification in the country) and to launch digital Degree apprenticeship provision at the university. For fifteen years prior to his involvement with the IoC, Rachid’s research interests have been in the field of human computer interaction. His research involves knowledge and information exchange between individuals, groups and combinations of the two. This research has involved working closely with industrial and public sector partners in both secure domains e.g. autonomous systems, defence (SEAS DTC I and II) and civilian contexts e.g. emergency response (HASCC), aviation (EPSRC funded Flight Deck Safety Project) and agriculture (the EU funded CLAFIS project). He is not, however, a career academic, having run national and international teams in the financial domain before returning to academia. His ten years of industrial experience took him to France, Switzerland and the USA before taking up his first post at Bath. Fingerprint Dive into the research topics where Rachid Hourizi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Group Collaboration Computer Science 100% Collaborative Systems Computer Science 100% Situation Awareness Computer Science 80% Autonomous System Computer Science 80% Digital Skill Social Sciences 80% Human Computer Interaction Social Sciences 60% Energy Consumption Computer Science 48% Computer Science Social Sciences 48% View full fingerprint Projects 1 Not started 5 Finished Projects per year IAA - VR as a New Direction for Cognitive Rehabilitation: Towards a Service Evaluation Methodology for Assessment and Therapy in a Virtual Environment Tailored to Executive DysfunctionWatts, L. (PI), Lyons, Z. (Researcher) & Hourizi, R. (CoI)Project: Research-related funding CLAFISJohnson, P. (PI) & Hourizi, R. (CoI)European Commission1/11/13 → 31/10/16Project: EU Commission Integrated System 100% Forestry Production 100% Information Systems 100% Seeding 100% Data Management 100% Energy Literacy through an Intelligent Home Energy Advisor ENLITENColey, D. (PI), Brown, M. (CoI), Hourizi, R. (CoI), Jones, S. (CoI), Li, F. (CoI), Natarajan, S. (CoI), O'Neill, E. (CoI), Padget, J. (CoI), Verplanken, B. (CoI) & Walker, I. (CoI)Engineering and Physical Sciences Research Council8/10/12 → 16/12/16Project: Research council Climate Change 100% Climatic Change 100% Renewable Generation 69% Optimal Set 69% Building Performance 69% Distributed Management Coherence EngineHourizi, R. (PI)Innovate UK, Innovate UK Business Connect1/05/12 → 30/08/12Project: Central government, health and local authorities Human-Autonomous Systems Collective CapabilityJohnson, P. (PI) & Hourizi, R. (CoI)Engineering and Physical Sciences Research Council31/03/12 → 30/04/16Project: Research council Autonomous System 100% Hurricane Katrina 42% Case Study 42% Decision-Making 38% Information Systems 28% View all 6 projects Research output 6 Chapter in a published conference proceeding 3 Article 2 Paper 1 Book chapter Research output per year Research output per year The Institute of Coding: A University-Industry Collaboration to Address the UK’s Digital Skills CrisisDavenport, J., Crick, T. & Hourizi, R., 25 Jun 2020, Proceedings of the 2020 IEEE Global Engineering Education Conference, EDUCON 2020. Cardoso, A., Alves, G. R. & Restivo, T. (eds.). IEEE, p. 1400-1408 9 p. 9125272. (IEEE Global Engineering Education Conference, EDUCON; vol. 2020-April).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding UK 100% Digital Skill 100% Industry 100% University - Industry Collaboration 100% Technical Skill 100% 27 Citations (SciVal) The Institute of Coding: Addressing the UK Digital Skills CrisisDavenport, J., Hourizi, R., Hayes, A. & Crick, T., 2019, Proceedings - 3rd Conference on Computing Education Practice, CEP 2019. Association for Computing Machinery, 4 p. (ACM International Conference Proceeding Series).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open AccessFile Context 100% Education 100% Computing 100% Occupational Qualification 100% 5 Citations (SciVal) 198 Downloads (Pure) A little bit of frustration can go a long wayBoulton, A., Hourizi, R., Jefferies, D. & Guy, A., 2017, Advances in Computer Games - 15th International Conferences, ACG 2017, Revised Selected Papers. Springer Verlag, p. 188-200 13 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 10664 ).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding videogame 100% Human-Computer Interaction 50% User Engagement 50% Gamification 50% Gaming Experience 50% 3 Citations (SciVal) How smart do smart meters need to be?Mogles, N., Walker, I., Ramallo Gonzalez, A., Lee, J., Natarajan, S., Padget, J., Gabe-Thomas, E., Lovett, T., Ren, G., Hyniewska, S., O'Neill, E., Hourizi, R. & Coley, D., 15 Nov 2017, In: Building and Environment. 125, p. 439-450 12 p.Research output: Contribution to journal › Article › peer-review Open Access Smart Meter 100% Smart Meters 100% Energy Use 100% Climate Change 50% Smart Metering 50% 66 Citations (SciVal) 13 Downloads (Pure) Innovative Pedagogical Practices in the Craft of ComputingDavenport, J. H., Hayes, A., Hourizi, R. & Crick, T., Nov 2016, Proceedings of the 2016 International Conference on Learning and Teaching in Computing and Engineering (LaTICE). IEEE, p. 115-119 Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open AccessFile Craft 100% Apprentice 100% Pedagogical Practice 100% Academic Subject 50% Faculty 50% 28 Citations (SciVal) 274 Downloads (Pure) View all 12 research outputs Datasets Dataset for 'How smart do smart meters need to be?'Mogles, N. (Creator), Walker, I. (Creator), Ramallo-González, A. (Creator), Lee, J. (Creator), Natarajan, S. (Creator), Padget, J. (Creator), Gabe-Thomas, E. (Creator), Hyniewska, S. (Creator), Lovett, T. (Creator), Ren, G. (Creator), O'Neill, E. (Creator), Hourizi, R. (Creator) & Coley, D. (Creator), University of Bath, 1 Oct 2016DOI: 10.15125/BATH-00256Dataset",
  "content_length": 7094,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:09"
}