{
  "name": "Rachel Kolodny",
  "homepage": "https://cs.haifa.ac.il/~trachel",
  "status": "success",
  "content": "Rachel's papers Rachel Kolodny contact personal papers software A building blocks perspective on protein emergence and evolution A review on this topic with Yishi Ezerzer, Moran Frenkel-Pinter, and Nir Ben-Tal Current Opinions in Structural Biology pdf Predicting gene sequences with AI to study codon usage patterns We study if one can predict codon sequences used by an organism to encode a given amino acid sequence? Codons frequencies vary, a phenomenon known as codon-bias, yet we improve upon frequency-based predictions using contemporary AI tools that learn complex patterns and capture interactions between codons. Because our predictions are tested fairly, on cases not seen during the training process, accurate predictions suggest that these learned patterns are not random, and may be related to the evolutionary process. Our novel AI model for predicting codons is publicly available. That we can better learn codon patterns in high-expression proteins, and in sequences related to housekeeping cellular processes, suggests that the coding sequences of these genes are populated with complex regulatory codes. with Tomer Sidi, Shiri Bahiri-Elitzur, and Tamir Tuller PNAS (2024) pdf, Supplementary_info, code, web-server Reused protein segments linked to functional dynamics with Yigit Kutlu, Gabi Axel, Nir Ben-Tal, and Turkan Haliloglu MB&E (2024) pdf Few-shot prediction of the experimental functional measurements for proteins with single point mutations with Michael Bikman and Rita Osadchy GEM workshop ICLR (2024) pdf What can AlphaFold do for antimicrobial amyloids ? with Peleg Ragonis-Bachar, Gabi Axel, Shahar Blau, Nir Ben-Tal and Meytal Landau Protein Science (2023) pdf Similar protein segments shared between domains of different evolutionary lineages with Kaiyu Qiu and Nir Ben-Tal Protein Science (2022) pdf, Supplementary_data Evidence for the emergence of beta-trefoils by 'peptide budding' from an IgG-like beta-sandwich with Liam Longo and Shawn McGlynn PLOS CB (2022) pdf Adventures on the routes of protein evolution -- in memoriam Dan Salah Tawfik (1955-2021) Danny Tawfik was my colleague and friend. He is missed. with Colin Jackson, Agnes Toth-Petroczy, Florian Hollfelder, Monika Fuxreiter, Shina Caroline Lynn Kamerlin, Nobuhiko Tokuriki JMB (2022) pdf (another rejected cover art) Gram-negative outer-membrane proteins with beta-barrel domains with Ron Solan, Joana Pereira, Andrei Lupas, Nir Ben-Tal, PNAS (2021) supp, pdf How deep learning tools can help protein engineers find good sequences with Rita Osadchy, J.Phys.ChemB (2021) pdf (our rejected cover art) Bridging themes: short protein segments found in different architectures with Sergey Nepomnyachiy, Dan S Tawfik, Nir Ben-Tal, MB&E (2021) pdf Searching protein space for ancient sub-domain segments Curr. Opin. Struct. Bio. (2021)  pdf On the emergence of P-Loop NTPase and Rossmann enzymes from a Beta-Alpha-Beta ancestral fragment with Liam M Longo, Jagoda Jabłońska, Pratik Vyas, Manil Kanade, Nir Ben-Tal, and Dan S Tawfik, eLife (2020) pdf Highlighted by Liam's institution: here Potential Antigenetic Cross-reactivity Between Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) and Dengue Viruses with Yaniv Lustig, Shlomit Keler, Nir Ben-Tal, Danit Atias-Varon, Ekaterina Shlush, Motti Gerlic, Ariel Munitz, Ram Doolman, Keren Asraf, Liran I Shlush, and Asaf Vivante, Clinical Infectious Diseases (2020) pdf Potential In Silico Structural and Biochemical Functional Analysis of a Novel CYP21A2 Pathogenic Variant with Michal Cohen, Emanuele Pignatti, Monica Dines, Adi Mory, Nina Ekhilevitch, Christa E. Flück, and Dov Tiosano, International Journal of Molecular Sciences (2020) pdf (our rejected cover art) On the evolution of protein-adenine binding with Aya Narunsky, Amit Kessel, Ron Solan, Vikram Alva, and Nir Ben-Tal PNAS (2020) pdf To understand how protein-ligand interactions emerged in evolution, we analyzed all protein-adenine complexes of known structure.  All of adenine's hydrogen donors and acceptors may facilitate molecular recognition in various binding modes, indicative of convergent evolution.  Furthermore, adenine often binds to 'themes', segments of amino acids that are commonly found in proteins, and reported earlier. Aya Narusky's presentation of this work@ISMB2020 Won the Best Poster award Evolutionary pathways of repeat protein topology in bacterial outer membrane proteins with Meghan Franklin, Sergey Nepomnyachyi, Ryan Feehan, Nir Ben-Tal, and Joanna Slusky, eLife (2018) pdf Image from Vikas Nanda's review highlighting this work. Outer membrane proteins (OMPs) are the proteins in the surface of Gram-negative bacteria. These proteins have diverse functions but a single topology: the β-barrel. Sequence analysis has suggested that this common fold is a β-hairpin repeat protein, and that amplification of the β-hairpin has resulted in 826-stranded barrels. Using an integrated approach that combines sequence and structural analyses, we find events in which non-amplification diversification also increases barrel strand number. Our network-based analysis reveals strand-number-based evolutionary pathways, including one that progresses from a primordial 8-stranded barrel to 16-strands and further, to 18-strands.  We also find that the evolutionary trace is particularly prominent in the C-terminal half of OMPs, implicating this region in the nucleation of OMP folding. Navigating Among Known Structures in Protein Space with Aya Narunsky and Nir Ben-Tal, Computational methods in protein evolution (2019) pdf Efflux Pumps Represent Possible Evolutionary Convergence onto the β-Barrel Fold with Meghan Whitney-Franklin, Sergey Nepomnyachiy, Ryan Feehan, Nir Ben-Tal, and Joanna S.G.Slusky, Structure (2018) pdf There are around 100 varieties of outer membrane proteins in each Gram-negative bacteria, all with the same up-down β-barrel fold.  Here we suggest that like lysins, β-barrels of efflux pumps have converged on this fold. By grouping structurally solved outer membrane β-barrels (OMBBs) by sequence we find that the membrane environment may have led to convergent evolution of the barrel fold. Specifically, the lack of sequence linkage to other barrels coupled with distinctive structural differences, such as differences in strand tilt and barrel radius, suggest that the outer membrane factor of efflux pumps evolutionarily converged on the barrel. Rather than being related to other OMBBs, sequence and structural similarity in the periplasmic region of the outer membrane factor of efflux pumps suggests an evolutionary link to the periplasmic subunit of the same pump complex. Accompanying web-site is here. A novel geometry-based approach to infer protein interface similarity with Inbal Budowski-Tal and Yael Mandel-Gutfreund, Scientific Reports (2018) pdf We present PatchBag  a geometry based method for efficient comparison of protein surfaces and interfaces. PatchBag is a Bag-Of-Words approach, which represents complex objects as vectors, enabling to search interface similarity efficiently. Complex Evolutionary Footprints Revealed in an Analysis of Reused Protein Segments of Diverse Lengths with Sergey Nepomnyachiy and Nir Ben-Tal, PNAS (2017) pdf F1000 highlighted this contribution. We question a central paradigm: namely, that the protein domain is the \"atomic unit\" of evolution.  In conflict with the current textbook view, our results unequivocally show that duplication of protein segments happen both above and below the domain level among amino acid segments of diverse lengths. Indeed, we show that significant evolutionary information is lost when the protein is approached as a string of domains.  Our finer-grained approach reveals a far more complicated picture, where reused segments often intertwine and overlap with each other.  Our results are consistent with a recursive model of evolution, in which segments of various lengths, typically smaller than domains, \"hop\" between environments.  The fit segments remain, leaving traces that can still be detected. Accompanying (and cool) web site is here Similarity between the Usher Plug and the Repeating Domain of an Ice-adhesin: Evolution via Surface Reshaping with Amit Kessel and Nir Ben-Tal, Israel Journal of Chemistry (2017) pdf The PapC usher and MpAFP ice-adhesin feature Ig-like domains, which are similar in shape and sequence but are engaged in vry different functions.  We explore how evolution reshaped the surfaces of these two domains to fit to their respective functions. ConTemplate Suggests Possible Alternative Conformations for a Query Protein of Known Structure with Aya Narunsky, Sergey Nepomnyachiy, Haim Ashkenazy, and Nir Ben-Tal, Structure (2015) pdf Protein function involves conformational changes, but often, for a given protein, only some of these conformations are known. The missing conformations could be predicted using the wealth of data in the PDB. Most PDB proteins have multiple structures, and proteins sharing one similar conformation often share others as well. The ConTemplate web server http://bental.tau.ac.il/contemplate) exploits these observations to suggest conformations for a query protein with at least one known conformation (or model thereof). We demonstrate ConTemplate on a ribose-binding protein that undergoes significant conformational changes upon substrate binding. Querying ConTemplate with the ligand-free (or bound) structure of the protein produces the ligand-bound (or free) conformation with a root-mean-square deviation of 1.7A (or 2.2A); the models are derived from conformations of other sugar-binding proteins, sharing approximately 30% sequence identity with the query. The calculation also suggests intermediate conformations and a pathway between the bound and free conformations. CyToStruct: Augmenting the Network Visualization of Cytoscape with the Power of Molecular Viewers with Sergey Nepomnyachiy, and Nir Ben-Tal, Structure (2015) pdf It can be informative to",
  "content_length": 26232,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:06"
}