{
  "name": "Rachel Player",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/rachel-player",
  "status": "success",
  "content": "Rachel Player - Royal Holloway Research Portal View Scopus Profile Rachel Player Dr Senior Lecturer, Department of Information Security Phone+44 1784 276872EmailRachel.Playerrhul.acuk TW20 0EX Personal profile Personal profileDr Rachel Player is a Senior Lecturer in the Department of Information Security. Previously, she was a postdoctoral researcher working with Dr Martin R. Albrecht as part of the EU H2020 PROMETHEUS project. In January - May 2019, Rachel was a visiting researcher in the PolSys team of LIP6 at Sorbonne Université in Paris. In 2018, she held a one-year postdoc position in the same team. Rachel obtained her PhD in Information Security from Royal Holloway, where she was supervised by Prof. Carlos Cid and Prof. Sean Murphy. Rachel’s main research interests are in post-quantum cryptography, especially in the design and cryptanalysis of lattice-based cryptographic schemes. Rachel is interested in Privacy Enhancing Technologies and she has worked extensively in the area of applied homomorphic encryption. Recently, Rachel has been interested in the application of quantum algorithms in cryptanalysis. More information can be found at https://rachelplayer.github.io Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 14 Conference contribution 3 Article 2 Working paper 1 Book 3 More 1 Poster 1 Other contribution 1 Doctoral Thesis Research output per year Research output per year Cryptography A Very Short Introduction, Second EditionMurphy, S. & Player, R., 27 Feb 2025, Oxford University Press.Research output: Book/Report › Book Designs for practical SHE schemes based on Ring-LWRBolboceanu, M., Costache, A., Hales, E., Player, R., Rosca, M. & Titiu, R., 8 Apr 2025, In: IACR Communications in Cryptology. 2, 1Research output: Contribution to journal › Article › peer-review Open Access On Algebraic Homomorphic Encryption and its Applications to Doubly-Efficient PIROkada, H., Player, R., Pohmann, S. & Weinert, C., 24 Jan 2025, (Accepted/In press).Research output: Contribution to conference › Poster › peer-review On Algebraic Homomorphic Encryption and its Applications to Doubly-Efficient PIROkada, H., Player, R., Pohmann, S. & Weinert, C., 28 Apr 2025, (E-pub ahead of print) Proceedings of Eurocrypt 2025. Vol. 15606. p. 34-64 31 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 79 Downloads (Pure) Security Guidelines for Implementing Homomorphic EncryptionBossuat, J.-P., Cammarota, R., Chillotti, I., Curtis, B., Dai, W., Gong, H., Hales, E., Kim, D., Kumara, B., Lee, C., Lu, X., Maple, C., Pedrouzo-Ulloa, A., Player, R., Polyakov, Y., Ruiz Lopez, L. A., Song, Y. & Yhee, D., 13 Jan 2025, 4 ed., IACR Communications in Cryptology.Research output: Working paper Open Access View all 23 research outputs Activities 4 Workshop, seminar, course or webinar. 1 Editor of research journal 1 Membership in special-interest organisation Activities per year 8th HomomorphicEncryption.org Standardisation MeetingPlayer, R. (Organiser)23 Mar 2025Activity: Participating in or organising an event › Workshop, seminar, course or webinar. 7th HomomorphicEncryption.org Standards MeetingPlayer, R. (Organiser)13 Oct 2024Activity: Participating in or organising an event › Workshop, seminar, course or webinar. 90th ISO/IEC JTC 1/SC 27/WG 2 MeetingPlayer, R. (Participant) & Weinert, C. (Participant)30 Sept 2024 → 3 Oct 2024Activity: Participating in or organising an event › Workshop, seminar, course or webinar. Designs, Codes and Cryptography (Journal)Player, R. (Editor)Jul 2024 → …Activity: Publication peer-review and editorial work › Editor of research journal 87th ISO/IEC JTC 1/SC 27/WG 2 MeetingMitchell, C. (Organiser), Player, R. (Participant) & Weinert, C. (Participant)8 Apr 2024 → 12 Apr 2024Activity: Participating in or organising an event › Workshop, seminar, course or webinar. View all 6 activities",
  "content_length": 4233,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:06"
}