{
  "name": "Rachel McDonnell",
  "homepage": "https://www.scss.tcd.ie/Rachel.McDonnell",
  "status": "success",
  "content": "Rachel McDonnell HomeWelcome Projects Activities Publications Papers papers! TeachingInfo on Courses Real-Time Animation Introduction to Computer Graphics BlogNews! ContactGet in touch About I am a Professor in Creative Technologies at the School of Computer Science and Statistics at Trinity College Dublin. I am also a Fellow of Trinity College, a Principal Investigator in the ADAPT Research Centre, and head of the Graphics and Vision Discipline. I received my PhD in Computer Graphics in 2006 from TCD. My research interests include computer graphics, character animation, virtual humans, VR, and perception. My main focus is on real-time performance capture and perception of virtual humans. Team Team Members Dr. Alberto Jovane Bharat Vyas Charlotte Dubosc Donal Egan Rachael Schwartz Mauricio Flores Vargas Yuan He Rose Connolly Recent Activities Elected Head of the Discipline of Graphics and Vision, Trinity College Dublin, August 2024 Hosted a lab visit for European Researchers Night 2024 Conference Co-Chair for ACM SAP 2024, Dublin Keynote Speaker for CGVC September 12-31th 2024, London. Talk title \"Digital avatars and agents in Virtual Worlds\" Program Chair for Eurographics State of the Art Reports 2024, Cyprus Showcasing demos at European Researchers Night 2023 Keynote Speaker for ICAT-EGVE December 6-8th 2023, Dublin. Talk title TBD Invited Speaker for GENEA Workshop 2023, Paris. Talk title \"Metaverse Mayhem:Importance of Design in Pervasive Virtual Agents\" Keynote Speaker for ACM Conference on Intelligent Virtual Agents (IVA) 2023, Germany Talk title \"How Should we Represent Virtual Agents in the Metaverse?\" 2nd June 2023: Cited in a feature entitled \"The tech tricks that make computer games look real\" in BBC News New Course for Siggraph 2023 on 'State of the Art in Telepresence' Program Chair for ACM/SIGGRAPH Conference on Motion, Interaction, and Games 2023, France New Tutorial at Eurographics 2023, Germany. Title: \"Effective User Studies in Computer Graphics\" Showcasing demos at Electric Picnic 2023 Invited Speaker for VASC Seminar at CMU Robotics Institute 2023 Talk title \"Motion Matters in the Metaverse\" Invited Speaker for Digital Human Workshop 2022, Japan. Talk title \"Perception of Digital Humans in the Metaverse\" Keynote speaker for ACM Symposium on Computer Animation 2022. Talk title \"Oversharing in Virtual Reality: What does our motion reveal about us?\" Keynote speaker for ACM Symposium on Applied Perception 2022.Talk title \"Motion Matters in the Metaverse\" New Course for Siggraph 2022 on 'State of the Art in Telepresence' Joined the Editorial Board of the Computers and Graphics Journal as Associate Editor. My former PhD student Ylva Ferstl won the best PhD thesis award at Eurographics Eurographics 2022 for pioneering new methods for generating virtual human gestures from speech. Award for best conference paper at IEEE VR 2022! Virtual Human Podcast on Spotify SIGGRAPH Technical Papers Program Committee 2022 7th January 2022: Cited in a feature entitled \"Is the \"uncanny valley\" good for a future metaverse?\" in Kyodo News and The Japan Times 26th November 2021: Article \"A deep learning method to automatically enhance dog animations\" in Tech Xplore 16th October 2021: Invited talk at CV4ARVR entitled \"Should we tread softly across the uncanny valley?\", available here 16th September 2021: Best Paper Nominee at IVA Joined the Eurographics 2022 Advisory Board SIGGRAPH Technical Papers Program Committee 2021 SIGGRAPH ASIA Technical Papers Program Committee 2021 8th July 2021: Keynote at Laval Virtual \"Photorealistic virtual humans have arrived and are here to stay, but do we have a deep enough understanding of how humans perceive them?\" Article \"Future Technologies for Communication\" in Provost's retrospective Review Eurographics Full Papers Program Committee 2021 21st May 2021: Dublin Tech Summit Article Innovation Drives Advances for A New Virtual World ACM Syposium on Applied Perception PC 2021 ACM Conference on Motion, Interaction and Games PC 2021 Recent News Activities Supervision Older News New Eurographics paper 2022 Our paper has just been accepted to Eurographics! The topic is on finding the optimal marker placement for facial motion capture. More details soon... Book chapter I was delighted to co-author a chapter of the Handbook on Socially Interactive Agents with Bilge Mutlu. The chapter is about perception of appearance of agents with virtual and physical embodiments. Article in The Japan Times Recent article in The Japan Times on 'Can the Uncanny Valley help us in a future Metaverse?'. Research Activities Editorial Board: Transactions on Applied Perception Computer Graphics Forum Computers and Graphics Program/Conference Chair: SAP 2024 Conference Co-Chair Eurographics 2024 STARs Program Co-Chair MIG 2023 Program Co-Chair SAP 2012 Program Co-Chair SAP 2011 Conference Co-Chair MIG 2013 Conference Chair Eurographics 2005 Local organising committee SCA 2008 Posters Chair Co-organizer of Workshop on Crowd Simulation 2010 International Program Committee Service: SIGGRAPH 2014 Eurographics 2013 SCA: SIGGRAPH/EUROGRAPHICS Symposium on Computer Animation 2009, 2010, 2011, 2012, 2013, 2014, 2015 SAP: ACM SIGGRAPH Symposium on Applied Perception: 2009, 2010, 2011, 2012, 2013, 2015 CASA: International conference on Computer Graphics and Social Agents: 2012, 2013 CGI: Computer Graphics International: 2013 MIG: ACM SIGGRAPH Motion in Games: 2012, 2015 IEEE VR: 2013 AFFINE: International Workshop on Affective Interaction in Natural Environments: 2013 Eurographics Irish Chapter 2009 Tertiary Reviewer: Siggraph 2009, 2011-2013 Siggraph Asia 2008 Pacific Graphics 2009 IEEE Virtual Reality 2008 IEEE Computer Graphics & Applications 2010 PhD Committee: Andrew Corcoran, Trinity College Dublin, 2013 My Group Postdoc: Dr. Lauren Buck: Embodiment in VR Dr. Alberto Jovane: Motion Editing Dr. Dalila Burin: Embodiment PhD: Mauricio Flores Vargas: Spatial Audio in VR Hugh Jordan: Virtual Humans Yuan He: Conversational agents Darragh Higgins: Virtual Humans Donal Egan: ML for Animation Rachael Schwartz: Cartoon Animation Rose Connolly: Proximity in VR Co-Supervising: Shubhajit Basak (NUIG) Dan Bigioi (NUIG) Vladimir Marochko (TU Dublin) Paola Pena (UCD) Past Students Dr. Pisut Wisessing: Character Animation Dr. Rebecca Fribourg: Virtual Reality (Postdoc) Dr. Ylva Ferstl: Gesture Generation (Postdoc) Dr. Katja Zibrek: Virtual Human Perception (Postdoc) Dr. Eduard Zell: Facial Animation (Postdoc) Dr. Elena Kokkinara: Asymmetric Games (Postdoc) Dr. Emma Carrigan: Real-time Facial Animation (PhD) Dr. Kerstin Ruhland: Eye-Gaze Synthesis (PhD) Dr. Anton Gerdelan: Graphics Optimization (Postdoc) Timothy Costigan: Real-time Facial Animation (Masters) Mathieu Le Muzic (best project award)(IET Masters) John Cooper (IET Masters) Daniel Wilson (IET Masters) Derek Foley (IET Masters) Rowan Hughes (IET Masters) Richard Greene: ML for Animation Sean Thomas (TU Dublin) New TOG paper 2020 Our paper has just been accepted to ACM Transactions on Graphics! We will present it at SIGGRAPH in Washington! More details soon... Best Paper Award at SAP We were delighted to be awarded the Best Paper Award for our work investigating photorealism in VR at the Symposium on Applied Perception in Barcelona, September, 2019! Course at SIGGRAPH 2019 We presented a course at SIGGRAPH in L.A. on \"Perception of Virtual Characters\". Hopper Local Dublin 2019 I gave an invited talk at an event held in Microsoft Dublin focusing on the importance of women holding positions of influence in the tech industry. Science Gallery FAKE 2019 We are currently running an experiment in the Science Gallery FAKE exhibition. The experiment investigates cooperation with a realistic virtual avatar. Keynote at VSI 2018 I gave a keynote on the topic of \"The importance of photorealism in virtual human interactions\" at the 4th Workshop on Virtual Social Interaction in Goldsmiths, University of London in December. New IEEE TVCG Paper 2018 In this paper, we explored how effective non-player character design can be used to influence gameplay. In particular, we focused on abstract virtual characters with few facial features New IEEE Paper 2017 New paper accepted to IEEE CG&A on the topic of using pattern matching to synthesize cartoon facial animations automatically. New Office The GV2 group has moved building. We are now located in Stack B in Custom House Quay. New ACM TAP paper 2017 In this paper, we explored how effective non-player character design can be used to influence gameplay. In particular, we focused on abstract virtual characters with few facial features POPULATE demo at GDC Our EU project POPULATE (POPULate AsymmeTric mobile gamEs) was showcased at GDC 2016 in San Francisco. In collaboration with AMA Romania, and Golaem Crowds we have developed a captivating, collaborative, and interactive prototype game involving crowds using both wearable and mobile devices as controllers. Science Gallery SEEING In the Summer 2016, we ran experiment in the Science Gallery SEEING exhibition. The experiment investigates empathy in virtual reality. New SIGGRAPH ASIA Paper New paper accepted to SIGGRAPH Asia 2015 on the topic of shape and material stylization on the perception of CG characters. Career Development Award I recently received a Career Development Award (CDA) from Science Foundation Ireland for my project: Game Face: Perceptually Optimised Real-Time Facial Animation, which will begin in April 2015. CGF journal paper 2015 New journal paper accepted to Computer Graphics Forum. Topic is on a review of eye gaze in virtual agents, social robots and HCI. We review behaviour generation, user interaction, and perception. Paper accepted to MIG 2014 Mapping the motion of an actor's face to a virtual model is a difficult but important problem. In this paper, we created a system capable of determining this mapping through supervised learning of a small training dataset. Siggraph Technical",
  "content_length": 12267,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:06"
}