{
  "name": "Rachit Agarwal 0001",
  "homepage": "http://www.cs.cornell.edu/~ragarwal",
  "status": "success",
  "content": "Rachit Agarwal Associate Professor, Department of Computer Science, Cornell University. My research interests are in systems and networking. I am also interested in theoretical problems arising out of building practical systems. My research thus spans (and integrates) systems, networks, and theory. ragarwal at cs cornell edu (please read this before sending me an email) CV | Google scholar | Short Bio News 2025 Congratulations to Prof. Dr. Saksham Agarwal for winning the ACM SIGCOMM Doctoral Dissertation award! Congratulations to Prof. Dr. Saksham Agarwal for winning the Cornell Bowers CIS Dissertation award! Tau Beta Pi Professor of the Year award! HostCC wins the IRTF Applied Networking Research Prize 2025! Understanding the Host Network in SIGMETRICS Best-of-the-Rest! Other recent-ish news [2024] PhD #1! Congratulations to Prof. Dr. Saksham Agarwal for defending his PhD thesis and starting as a faculty at UIUC! [2024] PhD #2! Congratulations to Prof. Dr. Qizhe Cai for defending his PhD thesis and starting as a faculty at UVA! [2024] Understanding the Host Network wins Best Student Paper award at SIGCOMM 2024! [2022] Congratulations to Qizhe Cai for winning 2022 Facebook/Meta PhD Fellowship! [2021] James and Mary Tien Teaching Award, the highest teaching award in Cornell College of Engineering. [2021] Sloan Research Fellowship! [2021] NSF CAREER award! [2021] $1M NSF award for work on Pancake! [2020] Pancake wins Distinguished Paper award at Usenix Security'20! [2019] Congratulations to Saksham Agarwal for winning 2019 Google PhD Fellowship! [2018] Sincronia wins Best Student Paper award at SIGCOMM'18! [2017] $3M NSF award for work on Resource Disaggregation! Students Midhul Vuppalapati [SIGCOMM'24 Best Student Paper Award] [Cornell Fellowship] [2x Outstanding TA award] Shreyas Kharbanda [CRA Undergraduate Researcher award Honorable Mention] Omar Eqbal [IIT KGP Gold Medal] Alumni Saksham Agarwal (PhD, 2024) Assistant Professor, UIUC Qizhe Cai (PhD, 2024) Assistant Professor, UVA Sujaya Maiyya (Postdoc, 2022) Assistant Professor, University of Waterloo Mina Tahmasbi Arashloo (Postdoc, 2020-2022) Assistant Professor, University of Waterloo Jaehyun Hwang (Postdoc, 2019-2021) Assistant Professor, Sungkyunkwan University Anurag Khandelwal (Postdoc, 2019) Assistant Professor, Yale University Katie Gioioso (MS, 2021) PhD student, Stanford Current Projects Resource Disaggregation: Shared-nothing architectures provide good data locality and cross-job isolation. However, for modern workloads where peak resource demands can be much higher than the average, shared-nothing architectures beget extreme resource underutilization, high cost and inflexibility. Disaggregating compute from storage has the potential to overcome these limitations! To realize this goal, we are working along several directions: Network Fabric and Stacks for disaggregated architectures [OSDI'16a] [NSDI'19a] [OSDI'24] Storage stack for disaggregated architectures [NSDI'20a] [OSDI'21] Distributed programming frameworks on disaggregated architectures [NSDI'20b] [EuroSys'22] [OSDI'23] $3M award from NSF, Google faculty research award, Open-sourced, Deployed in the real world. Host Architecture: Rapid innovation in host and network fabric interconnects (hosts will soon have Terabit interconnects), coupled with relatively stagnant technology trends for essentially all other host resources (core speeds and counts, memory access latencies, cache sizes, etc.), mark a fundamental shift in how we design and build intra-host architecture. We are building an understanding of this shift, and designing and building host hardware, operating systems, network hardware and network protocols for hosts with terabit interconnects. Understanding the (poor) interplay between processor, memory and peripheral interconnects [SIGCOMM'21] [HotNets'22] [SIGCOMM'24] Rearchitecting Network Stack and protocols [SIGCOMM'22a] [SIGCOMM'23] Rearchitecting Operating Systems [SOSP'24a] [SOSP'24b] ACM SIGCOMM Doctoral Dissertation award, Cornell Bowers CIS Dissertation award, IRTF Applied Networking Research Prize 2025, SIGCOMM'24 Best Student Paper Award, Google Research Scholar award. PANCAKE for Secure (Oblivious) Cloud Storage: One of the core problems in offloading data to the cloud is that, even if data is encrypted, an adversary can launch powerful attacks rendering data encryption ineffective. We are designing systems that build upon strong theoretical foundation to enable secure offload of data even under powerful adversarial attacks. Length Leakage [Security'24a] in oblivious data access under passive persistent adversaries. Attacks against password managers [Security'24b]. Attacks against encrypted cloud backups [Oakland'24]. ShortStack [OSDI'22] for distributed, fault-tolerant, proxy design in oblivious data access. Pancake [Security'20] for efficient oblivious data access under passive persistent adversaries. Obladi [OSDI'18] for transactions on ORAM. $1M NSF Award, Usenix Security'20 distinguished paper award, security mitigations incorporated within Android. Near-optimal Datacenter Design: We are designing and building datacenter transport designs that provide provable worst-case guarantees. Some of the projects include: Congestion-free Datacenter Network Architecture [NSDI'24]; Formal Methods for Network Performance Analysis [NSDI'23]; dcPIM [SIGCOMM'22b], a near-optimal proactive receiver-driven datacenter transport; Oblivious reconfigurable (circuit-switched) networks [STOC'22]; Throughput-optimal Datacenter Network Scheduling [PODC'22]; CodedBulk [NSDI'21] for Inter-datacenter bulk transfers; Sincronia [SIGCOMM'18] for Coflows; Universal Packet Scheduling [NSDI'16a] for flexible packet scheduling; SIGCOMM'18 Best Student Paper Award. Few Past Projects Here are some of the projects that I have worked on in the past: Succinct, a distributed storage system that enables queries directly on compressed data. Succinct [NSDI'15] for random access, substring search, and even regular expression matches directly on semi-structured data; BlowFish [NSDI'16b] that enables a smooth performance-storage tradeoff; ZipG [SIGMOD'17] for graph queries directly on compressed graphs. Open-sourced and deployed in the real-world. Anteater and PathDump, systems for datacenter network data plane monitoring and debugging. Anteater [SIGCOMM'11], one of the first systems that proposed network debugging at the data plane. PathDump [OSDI'16b] for end-hosts based monitoring and debugging; SwitchPointer [NSDI'18] for enabling in-network visibility; Confluo [NSDI'19b] for efficient end-host stacks for low-overhead monitoring and debugging. Laid the foundation for research on network monitoring and debugging at the data plane. Open-sourced. Approximate Distance Oracles and Compact Routing, that introduced new data structures, algorithms and techniques for approximate distance queries on graphs. Linear Space for Stretch 3 and higher [INFOCOM'11]; Stretch 2 [PODC'13]; Stretch Less Than 2 [SODA'13, ESA'14]; Applications to BGP [ToN'14]; This project led to the first improvement over several classical decade-old theory results. Teaching Introduction to Computer Networks [Spring'25] [Fall'22] [Spring'21] [Spring'20] [Spring'19] [Spring'18] Advanced Computer Networks [Spring'23] [Fall'19] [Fall'18] [Fall'17] Operating Systems [Fall'21] [Fall'16] Special Topics: Building Disaggregated Systems [Spring'22] Special Topics: Computer Networks in a Decade from Now [Fall'20] Big Data Systems: Trends and Challenges [Spring'17] Professional Activities Organization NSF Workshop on Long-term Research Directions in Wired Networking [2023] CCC Workshop on Wide-Area Analytics [2019] SIGMETRICS Tutorials Chair [2019] NSDI Poster Chair [2018] HotOS General Chair [2017] Program Committee ISMM [2025] OSDI [2023] [2020] [2018] NSDI [2023] [2021] [2020] [2018] HotNets [2023] SIGCOMM [2020] SIGMETRICS [2020] [2019] [2018] ATC [2020] [2018] [2017] APoCS [2020] SOSR [2017] CoNext [2016] HotCloud [2016] ICDCS [2016]",
  "content_length": 8043,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:09"
}