{
  "name": "Rachid Hamadi",
  "homepage": "https://www.unsw.edu.au/staff/rachid-hamadi",
  "status": "success",
  "content": "Dr Rachid Hamadi Type in a search term Search Follow Follow LinkedIn Facebook Instagram TikTok YouTube Back to Dr Rachid Hamadi Senior Lecturer Ph.D. in Computer Science and Engineering (UNSW), M.Sc. in Computer Science (University of Science and Technology Houari Boumediene (USTHB), Algeria), B.Sc. (with Honours) in Computer Science (USTHB, Algeria) Engineering Computer Science and Engineering Follow me Follow me I am a Senior Lecturer at the School of Computer Science and Engineering (CSE) at the University of New South Wales (UNSW). I received my Ph.D. in Computer Science and Engineering from UNSW. I also hold a M.Sc. and a B.Sc. (with Honours) both in Computer Science from the University of Science and Technology Houari Boumediene (USTHB), Algeria. Prior to joining UNSW, I held Lecturer positions at Federation University, Victoria University, University of New England, Central Queensland University, and USTHB (Algeria). E-mail r.hamadi@unsw.edu.au Location School of Computer Science and Engineering Building K17 Level 4 Room 410 Publications Publications Media Media Grants Grants Awards Awards Research Activities Research Activities Engagement Engagement Teaching and Supervision Teaching and Supervision Books Book Chapters Edited Books Journal Articles Journal articles | 2008 Hamadi R; Benatallah B; Medjahed B, 2008, 'Self-adapting recovery nets for policy-driven exception handling in business processes', Distributed and Parallel Databases, 23, pp. 1 - 44, http://dx.doi.org/10.1007/s10619-007-7020-1 Journal articles | 2002 Benatallah B; Paik H; Hamadi R, 2002, 'Dynamic Restructuring of E-Catalog Communities Based on User Interaction Patterns', International Journal of World Wide Web, pp. 325 - 366 Working Papers Other Preprints | 2025 Hamadi R; Rezgui A; Darejeh A, 2025, From Service-Oriented Computing to Metaverse Services: A Framework for Inclusive and Immersive Learning for Neurodivergent Students, http://dx.doi.org/10.48550/arXiv.2509.15545 Conference Papers | 2019 Robin G; Hintzy AS; Marchaud S; Hamadi R, 2019, 'Verifying evolutions of nuclear power plants analog regulations by using hardware-in-the-loop simulation', in 11th Nuclear Plant Instrumentation Control and Human Machine Interface Technologies Npic and Hmit 2019, pp. 1591 - 1599 Conference Papers | 2017 Dehouck A; Hintzy AS; Reboul-Salze C; Hamadi R, 2017, 'Modelling I&C systems with relays for simulation, adapting CIM standards', in 10th International Topical Meeting on Nuclear Plant Instrumentation Control and Human Machine Interface Technologies Npic and Hmit 2017, pp. 1048 - 1057 Conference Papers | 2007 Hamadi R; Paik H; Benatallah B, 2007, 'Conceptual modeling of privacy-aware web service protocols', in 19th International conference on Advanced information systems engineering (CAiSE 07), Trondheim, Norway, presented at 19th International conference on Advanced information systems engineering (CAiSE 07), Trondheim, Norway Conference Papers | 2005 Hamadi R; Benatallah B, 2005, 'Dynamic restructuring of recovery nets', in 16th Australian database conference (ADC 2005), Newcastle, NSW, pp. 37 - 46, presented at 16th Australian database conference (ADC 2005), Newcastle, NSW Theses / Dissertations | 2005 Hamadi R, 2005, Formal composition and recovery policies in service-based business processes, http://dx.doi.org/10.26190/unsworks/21818 Conference Papers | 2004 Hamadi R; Benatallah B, 2004, 'Recovery Nets: Towards Self-Adaptive Workflow Systems', in International Conference on Web Information Systems Engineering, Brisbane, Qld, presented at International Conference on Web Information Systems Engineering, Brisbane, Qld, 22 November 2004 - 24 November 2004 Reports | 2004 Hamadi R; Benatallah B, 2004, Policy-Based Exception Handling in Business Processes, UNSW-CSE-TR0428, http://dx.doi.org/10.26190/unsworks/31692, https://cgi.cse.unsw.edu.au/~reports/papers/0428.pdf Conference Papers | 2003 Benatallah B; Casati F; Toumani F; Hamadi R, 2003, 'Conceptual Modeling of Web Service Conversations.', in Eder J; Missikoff M (ed.), 15th International Conference in Advanced Information Systems Engineering (CAiSE 2003), Springer Nature, Klagenfurt/Velden, Austria, pp. 449 - 467, presented at 15th International Conference in Advanced Information Systems Engineering (CAiSE`03), Klagenfurt/Velden, Austria, 16 June 2003 - 20 June 2003, http://dx.doi.org/10.1007/3-540-45017-3_31 Conference Papers | 2003 Benatallah B; Chrzastowski-Wachtel P; Hamadi R; O Dell M; Susanto A, 2003, 'HiWorD: A Petri Net-based Hierarchichal Workflow Designer', in Lilius J; Balarin F; Machado RJ (eds.), 3rd International Conference on Application of Concurrency to System Design, Guimares, Portugal, pp. 235 - 236, presented at 3rd International Conference on Application of Concurrency to System Design, Guimares, Portugal Conference Papers | 2003 Benatallah B; Hamadi R; Chrzastowski-Wachtel P; O Dell M; Susanto A, 2003, 'A Top-Down Petri Net-Based Approach for Dynamic Workflow Modeling', in International Conference on Business Process Management (BPM 2003), Eindhoven, The Netherlands, presented at International Conference on Business Process Management (BPM`03), Eindhoven, The Netherlands Conference Papers | 2003 Hamadi R; Benatallah B, 2003, 'A Petri Net-based Model for Web Service Composition', in 14th Australasian Database Conference (ADC 2003), Adelaide, Sth Aust, presented at 14th Australasian Database Conference (ADC 2003), Adelaide, Sth Aust, 04 February 2003 - 07 February 2003 Conference Papers | 2002 Paik H; Benatallah B; Hamadi R, 2002, 'Usage-Centric Adaptation of Dynamic E-Catalogs', in 14th International Conference on Advanced Information Systems Engineering, Toronto Canada, presented at 14th International Conference on Advanced Information Systems Engineering, Toronto Canada, 27 May 2002 - 31 May 2002 Theses / Dissertations | 1995 Hamadi R, 1995, Modèles du vrai parallélisme et bisimulations avant arrière, https://dspace.usthb.dz/handle/123456789/8492 Theses / Dissertations | 1991 Hamadi R; Medjahed B, 1991, Implementation and Comparison of Multiversion Concurrency Control Media My research focuses on formal modeling of business processes, exception handling, analysis and verification, and service-oriented computing. I have published in esteemed international journals and conferences, contributing significantly to these fields. Professional membership: Member, Association for Computing Machinery (ACM) Member, Institute of Electrical and Electronics Engineers (IEEE) Member, Higher Education Research and Development Society of Australasia (HERDSA) Member, Engineers Australia (EA) Member, Australasian Association for Engineering Education (AAEE) AAEE is a technical society of Engineers Australia focused on advancing engineering education. My TeachingMy primary areas of teaching are Programming, Databases, Web Technologies, Software Engineering, and Capstone Projects.",
  "content_length": 6930,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:07"
}