{
  "name": "Rachel Douglas-Jones",
  "homepage": "https://pure.itu.dk/portal/en/persons/rachel-douglasjones(f11b0cc1-ad9f-4b12-b805-65b70e5bcd65).html",
  "status": "success",
  "content": "Rachel Douglas-Jones - IT-University of Copenhagen X Rachel Douglas-Jones Professor, Technologies in Practice https://orcid.org/0000-0001-9562-6572 Emailrdojitudk 20122026 Research activity per year Personal profile KeywordsEthicsBiomedicineValuesQualityGovernanceStandardisationEvaluationDecision-makingTechnologiesResearch ethicsEthics committeesAsia-PacificBodiesScience Fingerprint Dive into the research topics where Rachel Douglas-Jones is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Capacity Building Keyphrases 100% Administrative Structure Social Sciences 95% Ethics Review Committees Keyphrases 82% Ethical Review Keyphrases 73% Ethics Keyphrases 61% Asia Keyphrases 60% Politics Keyphrases 56% Ethics Committees Keyphrases 56% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2012 2017 2021 2024 2026 27 Journal article 9 Book chapter 4 Book 3 Review 12 More 2 Article in proceedings 2 Conference abstract for conference 1 Anthology 1 Report 1 Report chapter 1 Preface/postscript 1 Net publication - Internet publication 1 Other contribution 1 PhD thesis 1 Working paper Research output per year Research output per year Committee Worlds: Governing Medical Research through Ethics in the Asia-PacificDouglas-Jones, R., 27 Jan 2026, Stanford University Press. 310 p. (The Anthropology of Policy).Research output: Book / Anthology / Report › Book › Research › peer-review Drug Trials 100% Trial Data 100% Anthropology of Policy 100% Ethics Standards 100% Global Ethics 100% Data/Logics/China: 6 Conversations on Becoming Green: 数据, 逻辑, 中国 六场关于绿⾊转型的对话Douglas-Jones, R. (Editor) & Wang, C. (Editor), 2025, Copenhagen: RSS Press. 133 p.Research output: Book / Anthology / Report › Book › Research Open AccessFile Flexible access? Digitalisation of Danish healthcare through video consultationsLaursen, C. S., Finken, S. & Douglas-Jones, R., 21 Aug 2025, Digitalization, Data and Welfare: Sociotechnical Approaches to Service Delivery. Galis, V. & Vlassis, V.-S. (eds.). Edward Elgar Publishing, p. 203-217 15 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open Access Danish 100% Digitalization 100% Flexible Access 100% Ethnographic Study 50% Self-Service 50% Smartification from shine to glareDouglas-Jones, R., 2025, The Smartification of Everything: Critical Analyses of a Ubiquitous Reality across social Sciences, Humanities and the Arts. University of Toronto Press, p. 1-4 (Technoscience and Society).Research output: Conference Article in Proceeding or Book/Report chapter › Preface/postscript › Research › peer-review The TiP ZineDouglas-Jones, R. (Editor) & Matsuda, N. (Illustrator), 2025, 15 p.Research output: Other contribution › Research Open AccessFile View all 55 research outputs Projects Projects per year 2014 2014 2016 2017 2019 2020 2022 2024 2025 2027 3 Active 8 Finished Projects per year DDSA Visit GrantDouglas-Jones, R. (PI)01/09/2024 → 01/11/2024Project: Research Data Science 100% Academy of Sciences 100% Anas 100% Technology-in-practice 50% Practice Research 50% Hope and Insufficiency: Capacity Building in Ethnographic ComparisonDouglas-Jones, R. (PI)Wenner-Gren Foundation05/09/2014 → 01/06/2015Project: Research MDMP: Moving Data - Moving People: Reorganizing Trust through China's Social Credit SystemDouglas-Jones, R. (PI), Tao, H. (CoI) & Jiang, Q. (CoI)Independent Research Fund Denmark01/07/2020 → 31/01/2026Project: Research Mobile Peoples 100% Social Credit System 100% China 100% Chinese State 50% Credit Score 50% Controversial Healing: Making sense of medical cannabis debatesDouglas-Jones, R. (CoI), Kjær, K. M. (PI) & Ojala, M. (Collaborator)Carlsberg Foundation01/05/2019 → 30/04/2022Project: Research CRIT: Critical Bestiaries of AI: Reimagining MonstersDouglas-Jones, R. (PI)Minderoo Foundation01/08/2022 → 31/12/2022Project: Research Monster 100% bestiary 100% Artificial Intelligence 100% beast 35% Oxford 23% View all 11 projects Press/Media ITU-FORSKERE MODTAGER BEVILLINGER PÅ OVER 13 MILLIONER KRONERDebois, S., Seidl, C. & Douglas-Jones, R.27/08/20201 Media contributionPress/Media: Press / Media Prisvindende visualiseringer, GDPR-digte og behov for et nyt deep learning-sprogDouglas-Jones, R. & Cohn, M.22/02/20191 Media contributionPress/Media: Press / Media Ny digtsamling om GDPR udkommer i morgenCohn, M. & Douglas-Jones, R.21/02/20191 Media contributionPress/Media: Press / Media Forskere udgiver digtsamling om GDPRDouglas-Jones, R. & Cohn, M.20/02/20191 Media contributionPress/Media: Press / Media Videnskabelig fake news i vild vækstDouglas-Jones, R.22/11/2017 → 03/12/20172 Media contributionsPress/Media: Press / Media View all 8 press/media Prizes Presentation AwardDouglas-Jones, R. (Recipient), 2019Prize: Prizes, scholarships, distinctions University of Copenhagen 100% Code of Conduct 100% Research Integrity 100% Danish 100% Teacher of the YearDouglas-Jones, R. (Recipient), 2016Prize: Prizes, scholarships, distinctions Quality Teaching 100% Activities Activities per year 2014 2014 2015 2016 2017 2024 2025 26 Organisation and participation in workshop, seminar, course 21 Lecture and oral contribution 13 Organisation and participation in conference 8 Membership in review committee 8 More 6 Examination 1 Other 1 Visiting an external academic institution Activities per year (Unen)Durable DecayDouglas-Jones, R. (Speaker)18 Jun 2017 → 20 Jun 2017Activity: Talk or presentation types › Lecture and oral contribution 5th World Conference on Research IntegrityDouglas-Jones, R. (Participant)28 May 2017 → 31 May 2017Activity: Participating in or organising an event types › Organisation and participation in conference A Bestiary of Digital MonstersDouglas-Jones, R. (Speaker), Gad, C. (Speaker) & Hockenhull, M. (Speaker)11 Dec 2018Activity: Talk or presentation types › Lecture and oral contribution Advisory Board Meeting of REGeneration: An Ethnographic Study of Energy, Data and Social Change in Net-Zero BritainDouglas-Jones, R. (Conference Chair)20 Mar 2024Activity: Participating in or organising an event types › Organisation and participation in conference American Anthropological Association Douglas-Jones, R. (Speaker)18 Nov 2015 → 22 Nov 2015Activity: Participating in or organising an event types › Organisation and participation in conference View all 76 activities",
  "content_length": 6790,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:05"
}