{
  "name": "Radim Sára",
  "homepage": "http://cmp.felk.cvut.cz/~sara",
  "status": "success",
  "content": "Radim's home page Radim ©ára  [sha-a-rah] Research fellow Center for Machine Perception Czech Technical University sara@cmp.felk.cvut.cz Phone: +420 2 2435 7203 Fax:     +420 2 2435 7385 office: building G, office No. G103A Department of Cybernetics Faculty of Electrical Engineering Czech Technical University Karlovo namesti 13, Prague 2 mailing address: Department of Cybernetics Faculty of Electrical Engineering Czech Technical University Technicka 2, 166 27 Prague 6 Czech Republic Research Interests Computer vision: structural image recognition, robust matching methods, stereopsis, 3D surface reconstruction, photometric methods in vision. Papers I am interested in robust matching and robust structural image interpretation in computer vision. My profile @ Publons My profile @ ResearchGate My profile @ Google Scholar My own selection of papers Teaching Three-Dimensional Computer Vision (an advanced Master Course, internal access only) Check the Computer Vision and Image Processing Master Programme in Open Informatics at CTU Prague. Running Projects SeMoA: Structural and Semantic Modeling of Architecture as an Image Interpretation Problem, Czech Science Foundation, 2011-2013 InteractIVe: Accident avoidance by active intervention for Intelligent Vehicles. EU 7th Framework Project No. FP7-ICT-246587, 2010-2014 Some Older Projects, Demos & Data eTRIMS: eTraining for Interpreting Images of Man Made Scenes. EU 6th Framework Project No. FP6-IST-027113. 2006-2009 3D Photography. Grant Agency of the Czech Academy of Sciences, Project No. 1ET101210406. 2004-2008 Hashimoto's Thyroiditis Recognition from Sonographic Images of Thyroid Gland (demo) Focusing small depth of field images (demo) 3-D model reconstruction from stereo vision (demo) PennOffice: Room reconstruction project (demo and data) Stairs: Testing stereo matching algorithms at occluding boundaries (data) Telepresence, former collaborative work with UNC at Chapel Hill Other Links Calibration & Test Patterns, etc. Lens Focusing Pattern (PostScript, 1k) (also for quick lens MTF test) HW and Equipment Manufacturers, Vendors, etc. Radim Sara",
  "content_length": 2124,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:14"
}