{
  "name": "Radim Bartos",
  "homepage": "http://www.cs.unh.edu/~rbartos",
  "status": "success",
  "content": "Radim Bartos Radim Bartos Professor and Chair Department of Computer Science University of New Hampshire Kingsbury Hall, Rm. N229 33 Academic Way, Durham, NH 03824-3597, map radim.bartos AT unh.edu, +1 603 862-3792 Office Hours: (Fall'25) M 1-2 pm, W 3:30-4:30 pm, and by appointment Professional Preparation Ph.D. in Mathematics and Computer Science (1997) and MS in Mathematics (1996), Department of Mathematics and Computer Science, University of Denver; MS in Computer Science and Engineering (1987), Department of Computer Science and Engineering, School of Electrical Engineering, Czech Technical University in Prague, Czech Republic. Research My research focuses on communication protocol design and networked computing. Current and past projects include: Precision clock synchronization protocols for networked systems, âDisconnectedâ network protocols for cyber-physical systems, Mobile video delivery and content-centric networks, Communication protocols for autonomous underwater vehicles. My projects have been supported by the following organizations: National Institute of Standards and Technology (NIST), UNH InterOperability Laboratory (UNH-IOL), Lamprey Networks, New Hampshire Innovation Research Center, U.S. Office of Naval Research (ONR), Cisco Systems, Meetinghouse Data Communications (acquired by Cisco Systems), Service Availability Forum, Cooperative Association for Internet Data Analysis (CAIDA), and Ecora. The ONR-funded underwater communications project is carried out in partnership with the Autonomous Undersea Systems Institute and its Autonomous Undersea Vehicle Applications Center program with additional support from Technology Systems, Inc., Falmouth Scientific, Rensselaer Polytechnic Institute, Teledyne Benthos, and Naval Undersea Warfare Center (NUWC) - Division Newport. For more information please see my CV and the list of publications. Professional Service Since 2010 I am serving as a Technical Program Committee co-chair of International IEEE Symposium on Precision Clock Synchronization for Measurement, Control and Communication (ISPCS). The 2025 ISPCS will be held in Ottawa, Canada, October 6-10, 2024. Check the Call for Papers. Teaching Current CS925 Advanced Computer Networks: course outline, list of subjects CS725/825 Computer Networks, IT 725 Network Technology: course outline, list of subjects Past CS980 Special Topics: Computer Networks Research: course outline CS780/880Special Topics: Programming Networked Handheld Devices: 2011 J-Term course outline CS880 Special Topics: Optical Networks: course outline, list of subjects CS416 Intro to Computer Science II: course outline, list of subjects CS415 Intro to Computer Science I: course outline, list of subjects © 2025 Radim Bartos.",
  "content_length": 2752,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:15"
}