{
  "name": "Radu Calinescu",
  "homepage": "https://www-users.cs.york.ac.uk/~raduc",
  "status": "success",
  "content": "Prof Radu Calinescu Radu Calinescu Home Research Publications PhD supervision TASP Research Team Department of Computer Science University of York Deramore Lane York, YO10 5GH UK email: radu.calinescu AT york.ac.uk tel: +44 (0)1904 325166 I am Professor of Computer Science at the University of York, PI on the UKRI Trustworthy Autonomous Systems Node in Resilience, the Assuring Autonomy International Programme Safety of AI Theme Lead, and the lead of the Trustworthy Adaptive and Autonomous Systems and Processes (TASP) Research Team. Prior to joining the University of York in 2012, I was a Lecturer in Computer Science at Aston University (2009-2012); a Senior Researcher on the Verification and Software Engineering research themes at the University of Oxford (2008-2009); a part-time Lecturer on the Software Engineering Programme at the University of Oxford (2005-2009); an Oxford University researcher on UK's CancerGrid research initiative (2005-2007); and the Technical Architect and Senior Development Manager of Sychron Ltd, an Oxford software company specialising in the development of autonomic datacentre management solutions (1999-2005). My University of Oxford DPhil thesis on Autonomic-Independent Loop Parallelisation received a British Computer Society Distinguished Dissertation Award, and is available as a Springer-Verlag book. Research interests My main research interests are in formal modelling, analysis, verification and controller synthesis for autonomous and self-adaptive systems and processes parametric and probabilistic model checking automated and model-driven software engineering and the application of the theories, approaches and techniques specific to the above research areas to robotic, cyber-physical, embedded and service-based systems. I am an active promoter of using formal methods at runtime to improve the resilience, integrity and predictability of autonomous systems used in safety-critical and mission-critical applications. Recent professional activities PC Co-Chair - 19th International Conference on Software Engineering and Formal Methods (SEFM 2021) PC Co-Chair - 15th International Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS 2020) PC Co-Chair - 11th International Workshop on Software Engineering for Resilient Systems (SERENE 2019) Guest Co-Editor - Computing Journal Special Issue on Resilient Software and Software-Controlled Systems Guest Co-Editor - Journal of Systems and Software Special Issue on Software Engineering for Trustworthy Cyber-Physical Systems Founding Member - IEEE Guidelines on the Verification of Autonomous Systems Working Group",
  "content_length": 2649,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:15"
}