{
  "name": "Radu Stoleru",
  "homepage": "http://faculty.cs.tamu.edu/stoleru",
  "status": "success",
  "content": "Radu Stoleru Radu Stoleru Professor Department of Computer Science and Engineering Texas A&M University College Station, TX 77843 Office: 324C L.F. Peterson Building (PETR) Phone: (979) 862-8349 Email: {my-lastname}@cse.tamu.edu Biographical Dr. Radu Stoleru is a full Professor in the Department of Computer Science and Engineering at Texas A&M University, and the head of the Laboratory for Embedded & Networked Sensor Systems (LENSS). Dr. Stoleru's current research interests are in edge/fog computing, cyber physical systems (CPS), Internet-of-Things (IoT), distributed systems, and wireless networking. He is the recipient of the NSF CAREER, a Fulbright Scholar, and several other awards. Dr. Stoleru received his Ph.D. in computer science from the University of Virginia in 2007. While at the University of Virginia, Dr. Stoleru received from the Department of Computer Science the Outstanding Graduate Student Research Award for 2007. He has authored or co-authored over 90 conference and journal papers with over 7,700 citations (Google Scholar). He is currently serving as an editorial board member for 3 international journals and has served as technical program committee member on numerous international conferences. Teaching CSCE 662/438: Distributed Systems: Spring '10, '12, '13, '17, '18, '19, '20, '22 CSCE 664/464: Wireless and Mobile Systems: Fall '10, '11, '12, '13, '15, '21; Spring '16, '17, '19 CSCE 410: Operating Systems: Fall '17 CSCE 313: Introduction to Computer Systems: Spring '09, '10, '16; Fall '10 CSCE 613: Advanced Operating Systems: Spring '14 CSCE 689: Special Topics on Cyber-Physical Systems: Spring '14 CSCE 181: Introduction to Computing: Fall '12 CSCE 689: Special Topics in Wireless Sensor Networks: Fall '07, Spring '08, Fall '08, Fall '09, Spring '11 Publications T. Liu, L. Jin, R. Stoleru, A. Haroon, C. Swanson, K. Feng, \"Robust Rainfall Estimation with Multimodal Sensing for Precision Residential Irrigation,\" in ACM Transactions on Sensor Networks (TOSN), 2025. A. Haroon, L. Jin, R. Stoleru, M. Maurice, R. Blalock, \"EdgeCore: Resource Dependency-Aware Multi-Tenant Orchestration for Mobile Edge Clouds,\" in the 9th IEEE/ACM Symposium on Edge Computing (SEC), 2024. T. Liu, L. Jin, R. Stoleru, A. Haroon, C. Swanson, K. Feng \"ERIC: Estimating rainfall with commodity doorbell camera for precision residential irrigation,\" in the 11th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation (BuildSys), 2024. (Best Paper Award) M. Sagor, A. Haroon, R. Stoleru, S. Bhunia, A. Altaweel, M. Chao, L. Jin, M. Maurice, R. Blalock, \"DistressNet-NG: A Resilient Data Storage and Sharing Framework for Mobile Edge Computing in Cyber-Physical Systems,\" in ACM Transactions on Cyber Physical Systems (T-CPS), 2024. M. Broner, S. Lee, L. Jin, and R. Stoleru, \"5G-MANTRA: Multi-Access Network Testbed for Research on ATSSS,\" in The 3rd ACM Workshop on 5G and Beyond Network Measurements, Modeling, and Use Cases (5G-MeMU), 2023. L. Jin, T. Liu, A. Haroon, R. Stoleru, M. Middleton, Z. Zhu and T. Chaspari, \"EMSAssist  An End-to-End Mobile Voice Assistant at the Edge for Emergency Medical Services,\" in The 20th ACM International Conference on Mobile Systems, Applications, and Services (MobiSys), 2023. L. Jin, T. Liu, A. Haroon, R. Stoleru, M. Middleton, Z. Zhu, T. Chaspari, \"Demo: EMSAssist  An End-to-End Mobile Voice Assistant at the Edge for Emergency Medical Services,\" in The 20th ACM International Conference on Mobile Systems, Applications, and Services (MobiSys), 2023. M. Broner, S. Lee, L. Jin, R. Stoleru, \"Poster: Towards Multi-Radio Access in 5G Networks,\" in The 20th ACM International Conference on Mobile Systems, Applications, and Services (MobiSys), 2023. A. Altaweel, R. Stoleru, G. Gu, A.K. Maity, S. Bhunia, \"On Detecting Route Hijacking Attacks in Opportunistic Mobile Networks,\" in IEEE Transactions on Dependable and Secure Computing (TDSC) , 2022. A. Altaweel, C. Yang, R. Stoleru, S. Bhunia, M. Sagoor, M. Maurice, R. Blalock, \"RSock: A Resilient Routing Protocol for Mobile Fog/Edge Networks ,\" in Ad Hoc Networks (Elsevier), 2022. S. Bhunia, R. Stoleru, A. Haroon, M. Sagor, A. Altaweel, M. Chao, M. Maurice, R. Blalock, \"EdgeKeeper: Resilient and Lightweight Coordination for Mobile Edge Clouds,\" in The 19th IEEE International Conference on Mobile AdHoc and Smart Systems (MASS), 2022. M. Sagor, R. Stoleru, A. Haroon, S. Bhunia, M. Chao, A. Altaweel, M. Maurice, R. Blalock, \"R-Drive: Resilient Data Storage and Sharing for Mobile Edge Clouds,\" in The 19th IEEE International Conference on Mobile AdHoc and Smart Systems (MASS), 2022. (Best Paper Award) S. Bhunia, R. Stoleru, A. Haroon, M. Sagor, A. Altaweel, M. Chao, M. Maurice, R. Blalock, \"Poster: EdgeKeeper  Resilient and Lightweight Coordination for Mobile Edge Computing Systems,\" in The 20th ACM International Conference on Mobile Systems, Applications, and Services (MobiSys), 2022. A. Haroon, M. Sagor, M. Maurice, L. Jin, R. Stoleru, R. Blalock, \"On Edge Coordination in Highly Dynamic Cyber-Physical Systems for Emergency Response,\" in The 1st Workshop on CyberPhysical Systems for Emergency Response (CPS-ER), 2022. M. Chao, R. Stoleru, \"R-MStorm: A Resilient Mobile Stream Processing System for Dynamic Edge Networks,\" in IEEE International Conference on Fog Computing (ICFC), 2020. M. Won, W. Zhang, C.-an Chen, R. Stoleru, \"GROLL: Geographic Routing for Low Power and Lossy IoT Networks,\" in Elsevier Internet of Things - Engineering Cyber Physical Human Systems, 2019. A. Murthy, C. Green, R. Stoleru, S. Bhunia, C. Swanson, T. Caspari \"Machine Learning-based Irrigation Control Optimization,\" in ACM Conference on Systems for Energy-Efficient Buildings, Cities and Transportation (BuildSys), 2019. L. Jin, L. Zhao, Z. Yan, R. Stoleru, \"NanoCommunication-based Impermeable Region Mapping for Oil Reservoir Exploration,\" in 6th ACM International Conference on Nanoscale Computing and Communication (NanoCom), 2019. Y. Zeng, M. Chao, R. Stoleru, \"EmuEdge: A Hybrid Emulator for Reproducible and Realistic Edge Computing Experiments,\" in 2019 IEEE International Conference on Fog Computing (ICFC), 2019. A. Altaweel, R. Stoleru, G. Gu, A. Maity \"CollusiveHijack: A New Route Hijacking Attack and Countermeasures in Opportunistic Networks\" in IEEE Conference on Communications and Network Security (CNS), 2019. (28% acceptance rate) M. Chao, C. Yang, Y. Zeng, R. Stoleru \"F-MStorm: Feedback-Based Online Distributed Mobile Stream Processing\" in IEEE/ACM Symposium on Edge Computing (SEC), 2018. (28% acceptance rate) K. D Ortiz-Lopez, M. A. Suresh, R. Stoleru \"Transmitters location optimization for drug delivery systems\" in th ACM International Conference on Nanoscale Computing and Communication (NanoCom), 2018. A. Altaweel, R. Stoleru, G. Gu, \"EvilDirect: A New Wi-Fi Direct Hijacking Attack and Countermeasures,\" in The 26th International Conference on Computer Communications and Networks (ICCCN), 2017. (25% acceptance rate) W. Zhang, Y. Zhou, R. Stoleru, \"Performance analysis and tuning of coexisting duty cycling WiFi and wireless sensor networks,\" in IEEE International Conference on Sensing, Communication and Networking (SECON), 2017. (26% acceptance rate) J. George, C.-An Chen, R. Stoleru, G. Xie, \"Hadoop MapReduce for Mobile Clouds,\" in IEEE Transactions on Cloud Computing (TCC), 2016 to appear. Y. Feng, R. Stoleru, C.-An Chen, G. Xie, \"A Routing Protocol Independent Caching Framework for Mobile Clouds,\" in IEEE Transactions on Emerging Topics in Computing (TETC), 2016 to appear. C. Yang, R. Stoleru, \"Hybrid Routing in Wireless Networks with Diverse Connectivity,\" in ACM 17th International Symposium on Mobile AdHoc Networking and Computing (MobiHoc) , 2016. (18.5% acceptance rate) C.-An Chen, R. Stoleru, G.Xie \"Energy Efficient and Fault-Tolerant Mobile Cloud Storage,\" in IEEE 5th International Conference on Cloud Networking (CloudNet), 2016. W. Gong, M. Suresh, L. Smith, A. Ostfeld, R. Stoleru, A. Rasekh, M.K. Banks, \"Mobile Sensor Networks for Optimal Leak and Backflow Detection and Localization in Municipal Water Networks,\" in Environmental Modelling and Software, Elsevier, 2016. S. Taheri, D. Hogrefe, R. Stoleru, \"Secure Neighbor Discovery in Mobile AdHoc Networks Through Local Topology Visualization,\" in The 30th IEEE International Conference on Advanced Information Networking and Applications (AINA), 2016. (29% acceptance rate) W. Zhang, M. Suresh, Y. Zhou, R. Veera, R. Stoleru, \"On the Coexistence of 802.11 and 802.15.4 Networks with Delay Constraints,\" in 34th IEEE -- International Performance Computing and Communications Conference (IPCCC), 2015. (29% acceptance rate) C. Yang, R. Stoleru \"On Balancing the Energy Consumption of Routing Protocols for Opportunistic Social Networks,\" in 34th IEEE -- International Performance Computing and Communications Conference (IPCCC), 2015. (29% acceptance rate) A. Altaweel, R. Stoleru, S. Mandal, \"On Secure Shared Key Establishment for Mobile Devices using Contextual Information,\" in 34th IEEE -- International Performance Computing and Communications Conference (IPCCC), 2015. (29% acceptance rate) Q. Ning, C.A. Chen, R. Stoleru, C. Chen, \"Mobile Storm: Distributed Real-time Stream Processing for Mobile Clouds,\" in 4th IEEE -- International Conference on Cloud Networking (CloudNet), 2015. W. Zhang, Y. Zhou, M. Suresh, R. Stoleru, \"On Modeling Single Cell IEEE 802.11 Ad-Hoc Networks with Power Saving Mode,\" in IEEE International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob), 2015. (29% acceptance rate) S. Mandal, C. Yang, A. Altaweel, R. Stoleru, \"An Efficient Pairwise Key Establishment Scheme for Ad-Hoc Mobile Clouds,\" in IEEE International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob), 2015. (29% acceptance rate) M. Won, R. Stoleru, \"A Hybrid Multicast Routing for Large Scale Sensor Networks with Holes,\" in IEEE Transactions on ",
  "content_length": 37334,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:18"
}