{
  "name": "Radu Timofte",
  "homepage": "https://www.informatik.uni-wuerzburg.de/computervision",
  "status": "success",
  "content": "Computer Vision Laboratory - Computer Vision Laboratory Intern Animation stoppen Computer Vision Laboratory We are looking for passionate postdocs, PhD students, and student assistants. Please check ouropen positions. Prof.Dr. Radu Timofte built up a new Computer Vision Laboratory (CVL) within the Center for Artificial Intelligence and Data Science (CAIDAS) and the Institute of Computer Science (IFI) at University of Würzburg. Please check our open positions. Our mission is to explore new ways to equip machines with (super-)human perception capabilities and at the same time to augment the human perception using the developed algorithms and the computational power of the machines. Prof.Dr. Radu Timofte is a Humboldt Professor for Artificial Intelligence and Computer Vision. Prof.Dr. Radu Timofte's past research, an introductory film made by Humboldt Foundation Google Scholar list of our recent research publications. Postal address Universität Würzburg Lehrstuhl für Informatik IV - Computer Vision John Skilton Str. 4a Hubland Nord 97074 Würzburg Germany Our team currently resides at University of Würzburg, Germany. Computer Vision Laboratory and University of Würzburg in general are an exciting environment for research, for independent thinking. Our team is highly international, with people from about 12 countries, and the members have already won awards at top conferences (ICCV, CVPR, ICRA, NeurIPS, ...), founded successful spinoffs, and/or collaborated with industry. Prof. Radu Timofte is a 2022 winner of the prestigious Humboldt Professorship for Artificial Intelligence Award. Prof. Radu Timofte also led the Augmented Perception Group  at ETH Zurich. We are looking for passionate postdocs, PhD students, and student assistants. Please check ouropen positions. You can find contact information at Team Prof. Dr. Radu Timofte Humboldt Professor for AI and Computer Vision radu.timofte@uni-wuerzburg.de Chair for Computer Vision (Computer Science IV) University of Würzburg Faculty of Mathematics and Computer Science CAIDAS Publications (Google Scholar)John Skilton Str. 4a Hubland Nord D-97074 Würzburg Germany Office HI.02.B.01 opening hours: by appointment Sekretariat Monika O'Neill Office opening hours: Monday, Tuesday, Wednesday 9:00-17:00 & by appointment Kontakt Lehrstuhl für Informatik IV (Computer Vision) Campus Hubland Nord John-Skilton-Straße 4a 97074 Würzburg E-Mail Suche Ansprechperson Hubland Nord, John-Skilton-Straße 4 HomeThe UniversityStudying at JMUResearchTeachingInstitutionsInternationalThe UniversityNewsEventsDates and DeadlinesDegree Programmes and SubjectsVacanciesStaff MembersGlossary of Administrative TermsServicesUniversity LibraryIT ServicesUniversity SportAcademic Advisory ServiceExamination OfficeStudent AffairsStudent RepresentationCareer CentreYour JMUWueStudyWueCampusClass ScheduleOnline-EnrolmentLibrary CatalogueContactPhone and Address DirectoryHow to Find UsPressAcademic Advisory ServiceTechnical Maintenance ServiceNeed help quickly? Seitenoptionen Sitemap Bildnachweise Nach oben Letzte Änderung: 14.01.2025 Seite: 182030/793 Bildnachweise ImpressumDatenschutzBarrierefreiheit",
  "content_length": 3156,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:18"
}