{
  "name": "Radu Marculescu",
  "homepage": "https://radum.ece.utexas.edu",
  "status": "success",
  "content": "System Level Design – UT Austin System Level Design Group The story of the SLD Group began in June 2000 at Carnegie Mellon University with an initial focus on system-level design methodologies for integrated circuits and systems. Over the years, our research has expanded significantly. Indeed, the SLD Group has been at the forefront of some of the most important evolutions in computer systems design, e.g., low-power design, communication-centric design, cyber-physical design and, most recently, machine learning and data-driven design. Our research has contributed to advancing some applications with high societal impact, e.g., Internet-of-Things (IoT), social networks, energy and sustainability, and personalized medicine. The SLD group at UT Austin started in January 2020. Our research brings together machine learning, network science, and systems design. Current research topics include machine learning and optimization for edge computing, software-reconfigurable heterogeneous systems on chip, social sensing and epidemics modeling. Our research results are highly visible, widely cited, and consistently funded. NEW! We are actively seeking highly motivated PhD students to join our team starting in Spring or Fall 2026. Join the team and be at the forefront of machine learning, computer vision, efficient computing, healthcare applications, network science, and systems design. JOIN US! Principal Investigator Radu Marculescu Professor Laura Jennings Turner Chair in Engineering The University of Texas at Austin Cockrell School of Engineering Electrical and Computer Engineering Radu Marculescu is a Professor and the Laura Jennings Turner Chair in Engineering in the Department of Electrical and Computer Engineering at The University of Texas at Austin. Between 2000-2019, he was a Professor in the Electrical and Computer Engineering department at Carnegie Mellon University. More about Prof. Marculescu Research Edge AI Would you like to speak with Siri on your iPhone without requiring an internet connection? Would you like to run 2D and 3D object detection models directly on your smartphone? Read more Networks Would you like to predict how a pandemic spreads or when a pandemic will end? Would you like to know how safe your area is based on how people are comply with social distancing?Read more Systems Would you like to know how machine learning techniques can help achieve dynamic power management and energy efficiency in modern manycore systems-on-chip (SoCs) without human intervention? Read more News All/Awards/News/TalksFeatured Publications Munir, Mustafa; Rahman, Md Mostafijur; Marculescu, RaduAdaptViG: Adaptive Vision GNN with Exponential Decay Gating Conference Forthcoming2026 Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV 2026), Forthcoming.Links@conference{AdaptViG_WACV_2026, title = {AdaptViG: Adaptive Vision GNN with Exponential Decay Gating}, author = {Mustafa Munir and Md Mostafijur Rahman and Radu Marculescu}, url = {https://arxiv.org/abs/2511.09942}, year = {2026}, date = {2026-03-02}, booktitle = {2026 Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV 2026)}, keywords = {}, pubstate = {forthcoming}, tppubtype = {conference} } Closehttps://arxiv.org/abs/2511.09942Close Shah, Sahil; Sharan, S P; Goel, Harsh; Choi, Minkyu; Munir, Mustafa; Pasula, Manvik; Marculescu, Radu; Chinchali, SandeepNeuS-QA: Grounding Long-Form Video Understanding in Temporal Logic and Neuro-Symbolic Reasoning Conference ForthcomingAAAI Conference on Artificial Intelligence 2026, Forthcoming.Links@conference{NeuS-QA, title = {NeuS-QA: Grounding Long-Form Video Understanding in Temporal Logic and Neuro-Symbolic Reasoning}, author = {Sahil Shah and S P Sharan and Harsh Goel and Minkyu Choi and Mustafa Munir and Manvik Pasula and Radu Marculescu and Sandeep Chinchali}, url = {https://arxiv.org/abs/2509.18041}, year = {2026}, date = {2026-01-15}, urldate = {2026-01-15}, booktitle = {AAAI Conference on Artificial Intelligence 2026}, keywords = {}, pubstate = {forthcoming}, tppubtype = {conference} } Closehttps://arxiv.org/abs/2509.18041Close Munir, Mustafa; Rahman, Md Mostafijur; Wei, Xiwen; Yang, Yuedong; Marculescu, RaduSearchViG: Optimal Vision GNNs via Ramanujan Spectral Optimization Conference ForthcomingThe Fourth Learning on Graphs Conference (LOG 2025), Forthcoming.Links@conference{SearchViG_LOG_2025, title = {SearchViG: Optimal Vision GNNs via Ramanujan Spectral Optimization}, author = {Mustafa Munir and Md Mostafijur Rahman and Xiwen Wei and Yuedong Yang and Radu Marculescu}, url = {https://openreview.net/pdf?id=cmEzgaYIJC}, year = {2025}, date = {2025-12-15}, booktitle = {The Fourth Learning on Graphs Conference (LOG 2025)}, keywords = {}, pubstate = {forthcoming}, tppubtype = {conference} } Closehttps://openreview.net/pdf?id=cmEzgaYIJCClose System Level Design Group Follow 27 32 ; System Level Design Group @sld_ut20 · 31 Oct 2024 1852060581215223913 Our collaborative research with Dell Med on bio-imaging featured in UT News: AI in the GI @DellMedSchool @utexasece AI in the GIArtificial intelligence is everywhere, and we mean everywhere. Three UT professors are developing AI to help prevent colorectal cancer.news.utexas.edu Reply on Twitter 1852060581215223913 Retweet on Twitter 1852060581215223913 1 Like on Twitter 1852060581215223913 3 X 1852060581215223913 ; System Level Design Group @sld_ut20 · 31 Oct 2024 1852058704792949079 SLD research on Machine Unlearning featured in Politico Newsletters: AI's next challenge: how to forget via @politico AI's next challenge: how to forgetpoliti.co Reply on Twitter 1852058704792949079 Retweet on Twitter 1852058704792949079 1 Like on Twitter 1852058704792949079 3 X 1852058704792949079 Load More MapContact Prof. Radu Marculescu System Level Design Group Electrical and Computer Engineering The University of Texas at Austin radum@utexas.edu Join Us We are actively looking for smart and passionate students like you! Join the team and be at the forefront of machine learning, network science, and systems design. Join Us Scroll to top Scroll to top Scroll to top",
  "content_length": 6166,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:18"
}