{
  "name": "Raef Bassily",
  "homepage": "https://sites.google.com/view/rbassily",
  "status": "success",
  "content": "Raef BassilySearch this siteEmbedded FilesSkip to main contentSkip to navigationAssociate Professor,                                  Computer Science & Engineering, TDAI core faculty,   The Ohio State University                     email: bassily.1@osu.edu                      About meI am an Associate Professor in the Department of Computer Science and Engineering and a core faculty member at the Translational Data Analytics Institute (TDAI) at The Ohio State University.   I am also a part-time visiting scientist at Google. My research interests span several areas such as privacy-preserving data analysis, machine learning, optimization, and information theory. I am broadly interested in studying the tension/harmony between data analysis and machine learning on one hand and other notions of central importance to people and society such as privacy and security. In my work, I enjoy applying various tools from several areas such as learning theory, optimization, statistics, and information theory. My research focuses on tackling current challenges in data analysis and machine learning  especially those of direct impact on society. My recent research effort has been devoted to developing practical algorithms with rigorous guarantees for privacy-preserving data analysis and machine learning. The goal of this area of research is to design highly accurate machine learning and data analysis algorithms that use private, personal data while providing rigorous guarantees of privacy for individuals whose data are collected; that is, to achieve the seemingly paradoxical goal of learning from private data without learning private data! A major part of my research focuses on addressing fundamental questions in machine learning and differential privacy. Before joining OSU, I was a data-science postdoctoral fellow at University of California, San Diego. Prior to this, I was a postdoc in the Department of Computer Science and Engineering at The Pennsylvania State University. I completed my PhD in Electrical and Computer Engineering at University of Maryland, College Park. I am supported by multiple NSF grants, including the NSF CAREER Award, and a  Google Faculty Research Award. I am also a recipient of OSU's 2022 Lumely Faculty Research Award.News: October 2024: Two papers to appear at NeurIPS 2024! (paper 1, paper 2)May 2024: Two papers to appear at ICML 2024! (paper 1, paper 2)December 2023: A paper on private non-convex optimization under KL condition to appear at ALT 2024!May 2023: I am now an Associate Professor with Tenure!April 2023: Two papers to appear at ICML 2023!Ph.D. Students: Current:Xinyu Zhou (PhD): Fall 2020 - PresentConor Snedeker (PhD): Spring 2023 - PresentEhsan Saleh (PhD): Spring 2025 - PresentFormer:   Michael Menart (PhD): Fall 2019 - Summer 2024 (Graduated, currently, postdoc at U. of Toronto, Vector Institute). Anupama  Nandi (PhD): Spring 2018 - Spring 2022 (Graduated, postdoc at Broad Institute, MIT & Harvard (2022-2023); currently, postdoc at Yale U).Joining my groupI am looking for bright, self-motivated PhD students. If you are interested in working with me, feel free to send me a brief email with your background and your resume (and any relevant coursework you have done). If you are not currently admitted to OSU, you are encouraged to apply! Please keep in mind that admissions are decided by the department/university committees.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3454,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:18"
}