{
  "name": "Rafael Dowsley",
  "homepage": "https://research.monash.edu/en/persons/rafael-baiao-dowsley",
  "status": "success",
  "content": "Rafael Baiao Dowsley - Monash University View Scopus Profile Rafael Baiao Dowsley Dr Senior Lecturer, Department of Software Systems & Cybersecurity https://orcid.org/0000-0002-7588-2410 EmailRafael.Dowsleymonashedu Accepting PhD StudentsPhD projectshttps://supervisorconnect.it.monash.edu/projects/research/privacy-preserving-machine-learning 20082025 Research activity per year Personal profile BiographyDr. Rafael Dowsley joined Monash University in 2020. He got his doctoral degree in 2016 from the Karlsruhe Institute of Technology, Germany. His research focuses on cryptography and its abundant intersections with fields such as machine learning, security, privacy and information theory. He has a keen interest on the design of cryptographic protocols to enhance privacy and some of his current investigations are into privacy-preserving machine learning, cryptocurrencies and blockchain technologies. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformatics, Doctor of Natural Sciences, Cryptography Based on Correlated Data: Foundations and PracticeAward Date: 15 Jul 2016 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2022 2023 2027 1 Finished 1 Active Projects per year CSIRO Next Generation Graduates Program: Privacy-Preserving Machine Learning: Technology Development and AdoptionYuan, X. (Primary Chief Investigator (PCI)), Liu, J. (Chief Investigator (CI)), Ge, Z. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Yang, R. (Chief Investigator (CI)), Yi, X. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Fang, Y. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Baiao Dowsley, R. (Associate Investigator (AI)), Du, X. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Han, F. (Associate Investigator (AI)), Wakefield, R. (Associate Investigator (AI)), Abuadbba, S. (Associate Investigator (AI)), Wu, T. (Associate Investigator (AI)) & Liu, X. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Algorand Centre of Excellence (ACE) on Sustainability Informatics for the PacificLiu, J. (Primary Chief Investigator (PCI)), Rudolph, C. (Chief Investigator (CI)), Pink, S. (Chief Investigator (CI)), Yu, J. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Steinfeld, R. (Chief Investigator (CI)), Du, X. (Chief Investigator (CI)), Liebman, A. (Chief Investigator (CI)), Ma, X. (Chief Investigator (CI)), Luebbers, J. (Chief Investigator (CI)), Ince, P. D. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuan, X. (Chief Investigator (CI)), Baiao Dowsley, R. (Chief Investigator (CI)), He, W. (Chief Investigator (CI)), Ko, R. K. L. (Chief Investigator (CI)), Dong, N. (Chief Investigator (CI)), Kuchta, V. (Chief Investigator (CI)), Komarek, A. M. (Chief Investigator (CI)), Radke, A. (Chief Investigator (CI)), Carvalho, G. (Chief Investigator (CI)), Risius, M. (Chief Investigator (CI)), Dargusch, P. J. (Chief Investigator (CI)), Gramoli, V. (Chief Investigator (CI)), Salampasis, D. (Chief Investigator (CI)), Wang, Z. (Chief Investigator (CI)), Au, M. A. (Chief Investigator (CI)), Luo, X. D. (Chief Investigator (CI)), Ali, S. (Chief Investigator (CI)), Sharma, B. (Chief Investigator (CI)), Boorman, J. (Chief Investigator (CI)), Wainwright, T. (Chief Investigator (CI)), Esgin, M. (Chief Investigator (CI)), Cui, S. (Chief Investigator (CI)) & Cui, H. (Chief Investigator (CI))1/08/22 → 1/06/23Project: Research Research output Research output per year 2008 2015 2019 2021 2022 2025 44 Conference Paper 21 Article 2 Review Article 1 Chapter (Book) Research output per year Research output per year SePEnTra: A Secure and Privacy-Preserving Energy Trading Mechanism in the Transactive Energy MarketDasgupta, R., Sakzad, A., Rudolph, C. & Dowsley, R., 2025, Provable and Practical Security - 18th International Conference, ProvSec 2024 Gold Coast, QLD, Australia, September 25–27, 2024 Proceedings, Part II. Liu, J. K., Chen, L., Sun, S.-F. & Liu, X. (eds.). Singapore Singapore: Springer, p. 223-235 13 p. (Lecture Notes in Computer Science; vol. 14904).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) An end-to-end framework for private DGA detection as a serviceMaia, R. J. M., Ray, D., Pentyala, S., Dowsley, R., De Cock, M., Nascimento, A. C. A. & Jacobi, R., 28 Aug 2024, In: PLoS ONE. 19, 8, 24 p., e0304476.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) MUSEN: Aggregatable Key-Evolving Verifiable Random Functions and ApplicationsDavid, B., Dowsley, R., Konring, A. & Larangeira, M., 2024, Security and Cryptography for Networks - 14th International Conference, SCN 2024 Amalfi, Italy, September 11–13, 2024 Proceedings, Part II. Galdi, C. & Phan, D. H. (eds.). Cham Switzerland: Springer, p. 317-337 21 p. (Lecture Notes in Computer Science; vol. 14974).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review A decentralized information marketplace preserving input and output privacyGolob, S., Pentyala, S., Dowsley, R., David, B., Larangeira, M., De Cock, M. & Nascimento, A., 2023, DEC 2023 - Proceedings of the Second ACM Data Economy Workshop. Koutrika, G., Laoutaris, N. & Trevisan, M. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 1-6 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Open AccessFile A Survey on Exotic Signatures for Post-quantum Blockchain: Challenges and Research DirectionsBuser, M., Dowsley, R., Esgin, M., Gritti, C., Kermanshahi, S. K., Kuchta, V., Legrow, J., Liu, J., Phan, R., Sakzad, A., Steinfeld, R. & Yu, J., 2 Mar 2023, In: ACM Computing Surveys. 55, 12, 32 p., 3572771.Research output: Contribution to journal › Review Article › Research › peer-review 30 Citations (Scopus) View all 68 research outputs Prizes Best paper awardFu, S. (Recipient), Yu, J. (Recipient), Baiao Dowsley, R. (Recipient) & Liu, J. (Recipient), 2021Prize: Prize (including medals and awards)",
  "content_length": 6729,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:22"
}