{
  "name": "Rafael Bidarra",
  "homepage": "https://graphics.tudelft.nl/rafael-bidarra",
  "status": "success",
  "content": "Computer Graphics and Visualization Zoeken Sluit zoek Computer Graphics and Visualization We work on many topics in rendering, visualization of (scientific) information and modelling of 3D objects. Our goal is to develop new algorithms to generate, represent, interpret, display and interact with data. In particular, complex and large data sets are in our focus, as they play an increasingly important role in many scientific, medical and engineering applications. Our research currently concentrates on: Game Technology (Procedural Generation, Narrative Worlds, …) Geometry and Animation (Representations, Optimization, Simulation, …) Image processing (Computational photography, Neural Image Generation, …) Immersion, Interaction, and Perception (Virtual/Augmented Reality, Vision models, …) Rendering (Real-time, Offline, Predictive, Neural, …) Visualization (Data, Scientific, BioMedical Visualization, …) We teach several courses and supervise student projects in these and related areas. News Menu openen 09 september 2025 CGV mini symposium on Medical Visualization On September 9, 2025, the CGV group at TU Delft hosted a mini symposium dedicated to advances in Medical Visualization. Lees meer 09 september 2025 PhD Defence of Faizan Siddiqui Faizan Siddiqui successfully completed his thesis defense, which was titled \"Fiber tracking uncertainty visualization for neurosurgery\". Lees meer 18 juni 2025 PhD Defence of Nicolas Chaves de Plaza Nicolas Chaves de Plaza successfully defended his thesis on Visual Analysis of Contour Ensembles in the Context of Radiotherapy. Lees meer 13 maart 2025 PhD Defence of Xuejiao Luo We congratulate Xuejiao Luo on her successful PhD defence on Reconstruction, Generation and Exploration of Digital Content with Deep Neural Features . Lees meer 19 december 2024 Path Tracing Guest Lecture by Dr. Christoph Peters We made recorded versions of two lectures on path tracing prepared by Dr. Christoph Peters available to the general public. They were originally held as guest lectures in the master course IN4152 - 3D Computer Graphics and Animation. Lees meer Je bent op pagina 1 Pagina 2 Pagina 3 Volgende pagina",
  "content_length": 2158,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:23"
}