{
  "name": "Rafael Pasquini",
  "homepage": "http://www.facom.ufu.br/~pasquini",
  "status": "success",
  "content": "Rafael Pasquini Rafael Pasquini Associate Professor - FACOM/UFU Av. João Naves de Ávila, 2.121 - CEP 38400-902 - Uberlândia/MG - Brazil rafael [dot] pasquini [at] ufu [dot] br +55 34 3239 4477 Research Interests Computer Networks System Management Cloud Computing Software-Defined Networks Machine Learning Network Analytics Routing Protocols Vehicular ad hoc Networks Intelligent Transport Systems Smart Cities External Links Education Post-Doctoral - KTH - Stockholm/Sweden 2015 - 2017 Visiting Researcher at NSE (Department of Network and Systems Engineering) within Prof. Rolf Stadler's group. PhD - Unicamp - Campinas/Brazil 2006 - 2011 PhD in Electrical Engineering with emphasis on Computer Engineering. Advisor: Prof. Maurício Ferreira Magalhães. Title in Portuguese: Proposta de Roteamento Plano Baseado em uma Métrica de OU-Exclusivo e Visibilidade Local. Title in English: A Flat Routing Proposal Based on the XOR Metric and Local Visibility MSc - Unicamp - Campinas/Brazil 2004 - 2006 MSc in Electrical Engineering with emphasis on Computer Engineering. Advisor: Prof. Maurício Ferreira Magalhães. Title in Portuguese: Arquitetura e Prototipação de uma UNI Óptica para a Rede GIGA. Title in English: Architecture and Prototype of an Optical UNI for the GIGA Network BSc - Unipinhal - Espírito Santo do Pinhal/Brazil 1999 - 2002 BSc in Computer Science. Research Projects ADMITS: Architecting Distributed Monitoring and Analytics for IoT in Disaster Scenarios 2020 - 2021 The ADMITS project aims to develop algorithms, protocols and architectures to enable a decentralized distributed computing environment to provide support for monitoring, failure detection, and analytics in IoT disaster scenarios. New ICT Services and Infrastructure Models Aligned with the Smart Grids and IoT Scenarios 2019 - 2021 This project aims to research, evaluate and architect new scenarios for the provision of innovative services in concessionaires of energy distribution. The project seeks to employ information and communication technology (ICT) to enable drastic changes in the way concessionaires operate, supporting the emergence of new technologies such as Internet of Things (IoT) and the consolidation of smart grids. Intelligent Orchestrator for Telecom Clouds and Software Defined Networks 2019 - 2021 The popularization of broadband Internet access and portable devices with high computational capacity (for example, smartphones) enabled a significant increase in the use of services and applications available in the cloud. In this scenario, network operators must manage, in addition to the growth in traffic volume, the growing demand from their customers (personal and corporate) in terms of network performance expectation. As the main product of this project we will deploy an intelligent orchestrator to guarantee QoS levels in real time, agnostic to the applications running in the Telecom Cloud. NECOS: Novel Enablers for Cloud Slicing 2017 - 2019 In this project, we consider that computation, storage and networking resources have to be considered as a whole to be allocated to service requests. Each service request has to be satisfied irrespectively of other requests arrived in the past and those that can come in the future. Handling each service as something that is independent of others, but at the same time sharing the same substrate infrastructure, drives us to the concept of virtualization. Virtualization is assumed to be applied to target resources of any type, so that allowing to allocate e-virtual resources to heterogeneous service requests. The set of virtual resources that will enable a service to be deployed fulfilling its specific requirements over time, as it were the only existing one in a given computation and networking infrastructure, gives rise to the Lightweight Slice Defined Cloud (LSDC) concept coined in NECOS. Students/Alumni Post-Doctoral Raquel Fialho de Queiroz Lafetá2018 - 2020 PhD Send me a message to join one of the ongoing projects. Master Ian Resende da Cunha2020 - Current João Carlos Gonçalves2020 - Current Marcus Artiaga Colantoni2019 - Current Gustavo Silveira Marques2018 - Current Aryadne Guardieiro Pereira Rezende2018 - Current Marta Calasans Costa Lacerda2017 - 2020 Fabio Junior Sabai2015 - 2017 Pedro Henrique Amorim Rezende2014 - 2016 Everton Rocha Lira2014 - 2016 Enrique Fynn2013 - 2015 Ederval Pablo Ferreira da Cruz2010 - 2012 Undergrad Current Mateus Ferreira Gonçalves Silvano José da Silva Júnior Miguel Henrique de Brito Pereira 2019 Arthur Fernandess Ribeiro Ian Resende 2018 Juliano Reis 2017 Guilherme Pereira 2015 Vinícius Couto de Souza 2013 Carlos Alberto Horta de Matos de Barros Camacho Pedro Henrique Amorim Rezende Guilherme Borges Oliveira Suelen Cristina Cremonini 2012 Cláudio Douglas Gouveia Linhares Kamylla Florêncio de Almeida Arthur Mari Maia 2011 Eldane Vieira Júnior Marco Paulo Silva 2009 Eduardo Henrique Franco 2008 Jean Marcelo Vergaças Teaching Activities FACOM31802 - Programação para Internet 2017/2 FACOM49010 - Algoritmos e Programação de Computadores 2011/2 - 2012/1 - 2015/1 FACOM49070 - Arquitetura de Redes de Computadores 2017/2 - 2018/1 - 2018/2 - 2019/1 - 2019/2 - Current GBC014 - Programação Procedimental 2011/2 GBC021 - Profissão em Computação e Informática 2012/1 - 2012/2 GBC109 - Tópicos Especiais - Internet do Futuro 2012/1 GSI006 - Estrutura de Dados I 2011/2 GSI009 - Profissão em Sistemas de Informação 2011/2 - 2012/1 GSI019 - Programação para Internet 2012/2 - 2013/1 - 2013/2 - 2014/1 GSI023 - Redes de Computadores 2013/1 - 2013/2 - 2014/1 - 2014/2 - 2018/1 - 2018/2 - 2019/1 - 2019/2 - Current GSI077 - Tópicos Especiais em Redes - Internet do Futuro e Computação em Nuvem 2015/1 GSI081 - Tópicos Especiais - Internet do Futuro 2012/1 PGC003 - Seminários em Sistemas de Computação 2014/1 - 2018/1 PGC308 - Tópicos Especiais - Internet do Futuro 2012/2 - 2014/2 - 2017/2 - Current List of Publications 2020 PASQUINI, R.; BALIOSIAN, J.; SERRAT, J.; GORRICHO, J.; VENANCIO, A.; VERDI, F. \"Inferring Cloud-Network Slice's Requirements from Non-Structured Service Description\". In: 2020 IEEE/IFIP Network Operations and Management Symposium (NOMS 2020), Budapest, Hungary. MEDEIROS, A.; VENANCIO, A.; SAMPAIO, S.; PASQUINI, R.; BALIOSIAN, J. \"Enabling Enhanced Elasticity Control Functions to Cloud-Network Slice-Defined Domains\". In: 2020 IEEE/IFIP Network Operations and Management Symposium (NOMS 2020), Budapest, Hungary. ROCHA, A.; MACIEL, P.; TUSA, F.; CESILA, C.; ESTEVE, C.; PASQUINI, R.; VERDI, F.\"Design and Implementation of an Elastic Monitoring Architecture for Cloud Network Slices\". In: 2020 IEEE/IFIP Network Operations and Management Symposium (NOMS 2020), Budapest, Hungary. 2019 KELLERER, W.; CHEMOUIL, P.; KAMIYAMA, N.; MARTINI, B.; PASQUINI, R.; SCHEMBRA, G.; SCHMID, S.; ZHANI, M.; ZINNER, T. \"Guest Editorial: Special Issue on Latest Developments for the Management of Softwarized Networks\". IEEE Transactions on Network and Service Management, v. 16, p. 1297-1302, 2019. MEDEIROS, A.; VENANCIO, A.; SAMPAIO, S.; PASQUINI, R.; BALIOSIAN, J. \"End-to-End Elasticity Control of Cloud-Network Slices\". Internet Technology Letters, v. 1, p. e106, 2019. KIBALYA, G.; SERRAT, J.; GORRICHO, J.; PASQUINI, R.; YAO, H.; ZHANG, P. \"A Reinforcement Learning Based Approach for 5G Network Slicing Across Multiple Domains\". In: 2019 15th International Conference on Network and Service Management (CNSM). IEEE, 2019. p. 1-5, Halifax, Canada. MARQUES, G.; REZENDE, A.; CUNHA, I.; FIALHO, R.; PASQUINI, R. \"Arcabouço de um Sistema Inteligente de Monitoramento para Cloud Slices\". In: Anais do I Workshop de Teoria, Tecnologias e Aplicações de Slicing para Infraestruturas Softwarizadas. SBC, 2019. p. 56-68, Gramado/RS, Brazil. REZENDE, A.; MARQUES, G.; FIALHO, R.; PASQUINI, R. \"Arcabouço para Orquestração Osmótica de Cloud Slices\". In: Anais do I Workshop de Teoria, Tecnologias e Aplicações de Slicing para Infraestruturas Softwarizadas. SBC, 2019. p. 28-41, Gramado/RS, Brazil. FARIAS, F.; PINHEIRO, B.; ABELÉM, A.; MACIEL, P.; ROCHA, A.; VENANCIO, A.; CORREA, S.; NASCIMENTO, M.; PASQUINI, R.; VERDI, F.; ESTEVE, C. \"Projeto NECOS: Rumo ao Fatiamento Leve de Recursos em Infraestruturas de Nuvens Federadas\". In: Anais do X Workshop de Pesquisa Experimental da Internet do Futuro. SBC, 2019. p. 56-63, Gramado/RS, Brazil. 2018 KELLERER, W.; BOUTABA, R.; CHEMOUIL, P.; PASQUINI, R.; SCHEMBRA, G.; SCHMID, S.; SCOTT-HAYWARD, S.; SHIOMOTO, K. \"Guest Editors' Introduction: Special Section on Novel Techniques for Managing Softwarized Networks\". IEEE Transactions on Network and Service Management, v. 15, p. 1192-1196, 2018. REZENDE, P. H. A.; COELHO, P. R. S. L.; FAINA, L. F.; CAMARGOS, L. J.; PASQUINI, R. \"Analysis of monitoring and multipath support on top of OpenFlow specification\". International Journal of Network Management, 2018. AHMED, J.; JOSEFSSON, T.; JOHNSSON, A.; FLINTA, C.; MORADI, F.; PASQUINI, R.; STADLER, R. \"Automated Diagnostic of Virtualized Service Performance Degradation\". In: NOMS 2018 - 2018 IEEE/IFIP Network Operations and Management Symposium, 2018, Taipei, Taiwan. SILVA, F. S. D.; LEMOS, M. O. O.; MEDEIROS, A.; NETO, A. J. V.; PASQUINI, R.; MOURA, D.; ESTEVE, C.; MAMATAS, L.; CORREA, S. L.; CARDOSO, K. V.; MARCONDES, C. A. C.; ABELEM, A. J. G.; NASCIMENTO, M. R.; GALIS, A.; CONTRERAS, L.; SERRAT, J.; PAPADIMITRIOU, P. \"NECOS Project: Towards Lightweight Slicing of Cloud Federated Infrastructures\". In: IEEE Netsoft 2018 - S4SI, 2018, Montreal, Canada FERNANDES, L. B.; RIBEIRO, P. H.; MARTINS, L.; PASQUINI, R.; FAINA, L. F.; CAMARGOS, L. J. \"Comutador P4 com Suporte a Roteamento Multicaminhos\". In: SBRC 2018 - WPEIF, 2018, Campos do Jordão/SP - Brasil. 2017 STADLER, R.; PASQUINI, R.; FODOR, V. \"Learning from Network Device Statistics\". Journal of Network and Systems Management, 2017. DE TURCK, F.; CHEMOUIL, P.; KELLERER, W.; BOUTABA, R.; SHIOMOTO, K.",
  "content_length": 22195,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:24"
}