{
  "name": "Rafail M. Ostrovsky",
  "homepage": "http://www.cs.ucla.edu/~rafail",
  "status": "success",
  "content": "Rafail Ostrovsky - Homepage Rafail Ostrovsky Norman E. Friedman Chair in Knowledge Sciences Distinguished Professor of Computer Science; Distinguished Professor of Mathematics (by courtesy); Director of Center for Information and Computation Security at Henry Samueli School of Engineering and Applied Science; UCLA, Los Angeles, CA 90095 CV Short Bio Teaching Research Interests Publications by Year Publications by Topic Selected Honors and Awards Professional Activities Recent Invited Talks Students and Postdocs Useful & Fun Links Contact Information Directions to my UCLA office Rafail Ostrovsky holds Norman E. Friedman Chair in Knowledge Sciences at UCLA Samueli School of Engineering. He is a Distinguished Professor of Computer Science and Mathematics at UCLA. He is a Fellow of multiple organizations, including the National Academy of Inventors, the American Association for the Advancement of Science (AAAS), the Association for Computing Machinery (ACM), the Institute of Electrical and Electronics Engineers (IEEE), and the International Association for Cryptologic Research (IACR). Additionally, he is a foreign member of Academia Europaea, with over 360 refereed publications and 16 issued USPTO patents. He was chair of the IEEE Technical Committee on Mathematical Foundations of Computing from 2015 to 2018 and was chair of the IEEE Annual Symposium on Foundations of Computer Science (FOCS) 2011 Program Committee (PC). He also served on over 40 other international conference PC's and is currently serving on the editorial boards of the Journal of ACM and the Algorithmica Journal. He is the recipient of multiple awards and honors including 1993 Henry Taub Prize; the 2017 IEEE Computer Society Edward J. McCluskey Technical Achievement Award; the 2018 RSA Award for Excellence in Mathematics (also known as the RSA Prize); and the 2022 W. Wallace McDowell Award, the highest award given by the IEEE Computer Society. Teaching Fall 2025: Syllabus: CS282A/MATH209A: Foundations of Cryptography 2010 Crypto Lecture Notes Recent courses taught at UCLA: CS183 Introduction to Cryptogaphy; CS282A/M209A Foundatoions of Cryptography; CS282B/M209B Cryptographic Protocols; CS289A Current Topics in Computer Science Theory; CS289A Seminar on Probabilistically Checkable Proofs; CS289A Seminar on Byzantine Agreement; CS180 Introduction to Algorithms and Complexity; Interested in working with me, or becoming my postdoc or visiting? (Please read this BEFORE EMAILING ME). Research Interests I am interested in all aspects of theory of computation, especially in cryptography, network algorithms, and search and classification of large-scale, high-dimensional data. I find these topics fascinating to work on, not only due to their philosophical and theoretical centrality in computer science, but also due to their practical significance. Below, is a more detailed list of topics, with links to papers written on each topic. (You can also search Publications by Year or Google Scholar or DBLP.) Publications by Topic The papers below are also available in a chronological list or organized by topics. More information can be found at DBLP. For additions in 2017-2018, look for the signs. Cryptography: Private Information Retrieval, Privacy-preserving dataminging and searching on encrypted data; Zero Knowledge, Non-Interactive Zero-Knowledge; Secure Two-Party and Multi-Party Computation; Public-Key Encryption with Additional Properties; PKI; Biometric Authentication, Position-based Authentication, Passwords, and Digital Signatures; Hash Functions; Anonymity; Non-Malleable Commitment Protocols and Commitments with additional properties; Cryptographic applications: Secure Voting; Visual crypto; Micropayments; Hardware-based security; Systems Security; Search and Analysis of Large-scale, High-Dimensional Data: Algorithms for Streaming Data; Metric embedding, and Nearest-Neighbor Proximity Problems for High-Dimensional Data; Clustering Algorithms for High-Dimensional Data; Distributed Control Theory, Network Algorithms and Combinatorial Algorithms: Admission Control and Network Routing Algorithms; Distributed Control and Error-Correcting Codes; Distributed Algorithms with severely limited memory per processor; Synchronization in Distributed Networks; Distributed symmetry breaking algorithms; Combinatorial Algorithms. Publications: Cryptography Private Information Retrieval, Privacy-preserving datamining, and Searching on Encrypted Data Eyal Kushilevitz, Steve Lu, Rafail Ostrovsky On the (In)security of Hash-Based Oblivious RAM and a New Balancing Scheme . SODA 2012: 143-156 Brett Hemenway, Rafail Ostrovsky Public-Key Locally-Decodable Codes. CRYPTO 2008: 126-143 Rafail Ostrovsky, William Skeith, Communication Complexity in Algebraic Two-Party Protocols. CRYPTO 2008: 379-396 Dan Boneh, Eyal Kushilevitz, Rafail Ostrovsky, William Skeith, Public Key Encryption That Allows PIR Queries. Appeared in CRYPTO 2007: 50-67 Survey: Rafail Ostrovsky, William Skeith A Survey of Single-Database Private Information Retrieval: Techniques and Applications. Preliminary version (PKC-2007). Full version appeared as a book chapter in \"Homeland Security Technology Challenges From Sensing and Encrypting to Mining a nd Modeling\" Franceschetti and Grossi, (EDT), Artec-House publishers. Rafail Ostrovsky, Omkant Pandey, Amit Sahai Private Locally Decodable Codes. ICALP 2007: 387-398 Reza Curtmola, Juan Garay, Seny Kamara, and Rafail Ostrovsky Searchable Symmetric Encryption: Improved Definitions and Efficient Constructions In Proceedings of the 13th ACM Conference on Computer and Communications Security (CCS 2006). In addition, you can get a powerpoint presentation. Rafail Ostrovsky, William Skeith. Private Searching on Streaming Data, Preliminary version in Proceedings of Advances in Cryptology, (CRYPTO-2005) Springer-Verlag/IACR Lecture Notes in Computer Science. Full version in Journal of Cryptography, 2007. Yuval Ishai, Eyal Kushilevitz, Rafail Ostrovsky Sufficient Conditions for Collision-Resistant Hashing, In Proceedings of Second Theory of Cryptography Conference (TCC-2005)Springer-Verlag Lecture Notes in Computer Science, 2005. Yuval Isahi, Eyal Kushilevitz, Rafail Ostrovsky, Amit Sahai Batch Codes and Their Applications, In Proceedings of the ACM 2004 Symposium on Theory of Computing (STOC-2004). Dan Boneh, Giovanni Di Crescenzo, Rafail Ostrovsky, Guiseppe Persiano Public Key Encryption with Keyword Search, In Proceedings of Advances in Eurocrypt, (EUROCRYPT-2004) Springer-Verlag/IACR Lecture Notes in Computer Science. Eyal Kushilevitz, Rafail Ostrovsky One-way Trapdoor Permutations Are Sufficient for Non-Trivial Single-Server Private Information Retrieval , In Proceedings of Advances in Cryptology (EUROCRYPT-2000) Springer-Verlag Lecture Notes in Computer Science. Giovanni Di Crescenzo, Tal Malkin, and Rafail Ostrovsky Single Database Private Information Retrieval Implies Oblivious Transfer , In Proceedings of Advances in Cryptology (EUROCRYPT-2000) Springer-Verlag Lecture Notes in Computer Science. Giovanni De-Crescenzo, Yuval Ishai, Rafail Ostrovsky Universal Service-Providers for Database Private Information Retrieval , In Proceedings of Seventeenth Annual ACM Symposium on Principles of Distributed Computing (PODC-98). Journal version appears in Journal of Cryptology 14(1): 37-74 (2001). Eyal Kushilevitz, Rafail Ostrovsky Replication Is Not Needed: Single Database, Computationally-Private Information Retrieval , In Proceedings of Thirty-eighth Annual IEEE Symposium on the Foundations of Computer Science (FOCS-97). Rafail Ostrovsky, Victor Shoup Private Information Storage , In Proceedings of The Twenty-Ninth ACM Symposium on Theory of Computing (STOC-97). Rafail Ostrovsky Software Protection and Simulation on Oblivious RAMs. , M.I.T. Ph.D. Thesis, 1992. Preliminary version appeared in Proceedings of 22nd annual ACM Symposium on Theory of Computing (STOC-90) pp. 514-523. Journal version appeared in the Journal of the JACM, Vol. 43, No. 3, May 1996, pp.431-473. written jointly with Oded Goldreich. Zero Knowledge, Non-Interactive Zero-Knowledge, Knowledge Complexity Wutichai Chongchitmate, Rafail Ostrovsky, Ivan Visconti Resettably-Sound Resettable Zero Knowledge in Constant Rounds . TCC (2) 2017: 111-138 Michele Ciampi, Rafail Ostrovsky, Luisa Siniscalchi, Ivan Visconti Delayed-Input Non-Malleable Zero Knowledge and Multi-Party Coin Tossing in Four Rounds . TCC (1) 2017: 711-742 Michele Ciampi, Rafail Ostrovsky, Luisa Siniscalchi, Ivan Visconti Four-Round Concurrent Non-Malleable Commitments from One-Way Functions . CRYPTO (2) 2017: 127-157 Rafail Ostrovsky, Alessandra Scafuro, Muthuramakrishnan Venkitasubramaniam Resettably Sound Zero-Knowledge Arguments from OWFs - The (Semi) Black-Box Way . TCC (1) 2015: 345-374 Rafail Ostrovsky, Giuseppe Persiano, Ivan Visconti On Input Indistinguishable Proof Systems . ICALP (1) 2014: 895-906 Vipul Goyal, Rafail Ostrovsky, Alessandra Scafuro, Ivan Visconti Black-box non-black-box zero knowledge . STOC 2014: 515-524 Claudio Orlandi, Rafail Ostrovsky, Vanishree Rao, Amit Sahai, Ivan Visconti Statistical Concurrent Non-malleable Zero Knowledge . TCC 2014: 167-191 Kai-Min Chung, Rafail Ostrovsky, Rafael Pass, Muthuramakrishnan Venkitasubramaniam, Ivan Visconti 4-Round Resettably-Sound Zero Knowledge . TCC 2014: 192-216 Rafail Ostrovsky, Giuseppe Persiano, Ivan Visconti Impossibility of black-Box simulation Against Leakage Attacks. CRYPTO (2) 2015: 130-149 Vipul Goyal, Abhishek Jain, Rafail Ostrovsky, Silas Richelson, Ivan Visconti Constant-Round Concurrent Zero Knowledge in the Bounded Player Model . ASIACRYPT (1) 2013: 21-40 Kai-Min Chung, Rafail Ostrovsky, Rafael Pass, Ivan Visconti Simultaneous Resettability from One-Way Function . FOCS 2013: 60-69 Vipul Goyal, Abhishek Jain, Rafail Ostrovsky, Silas Richelson, Ivan Visconti Concurrent Zero Knowledge in the Bounded Player Model . TCC 2013: 60-79 Joshua Baron, Rafail Ostrovsky, Ivan Viscon",
  "content_length": 66139,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:27"
}