{
  "name": "Rafael M. Frongillo",
  "homepage": "http://www.cs.colorado.edu/~rafr5066",
  "status": "success",
  "content": "Rafael M. Frongillo My website has moved to https://raf.prof. If you are not redirected within 2 seconds, click here. contact me Hi there, I'm Raf (pronunced r-ah-f). I am an assistant professor of theoretical computer science at CU Boulder, and an affiliate faculty member in applied math. My research is at the interface of theoretical machine learning and economics, with a focus on designing loss functions and information elicitation mechanisms. I also work in dynamical systems. I am grateful to work with a group of amazing students. I am currently recruiting students as well. Before coming to Boulder, I was a postdoc at Microsoft Research NYC, and then at Harvard's CRCS with Yiling Chen and Yaron Singer in the EconCS group. I completed my Ph.D. in theoretical computer science at Berkeley, advised by Christos Papadimitriou and funded by the NDSEG Fellowship. Some news: I will be in Berkeley for the MSRI (SLMath) program, Mathematics and Computer Science of Market and Mechanism Design, for November 2023. I am honored to receive a 2022 Provost's Faculty Achievement Award, one of five given to junior faculty campus-wide Bo and I were the local co-chairs of EC 2022, July 11-15 in Boulder Congrats to Jessie for being awarded an NSF Mathematical Sciences Postdoctoral Research Fellowship! Starting in Fall 2022, she'll in the Harvard Center for Research on Computation and Society (CRCS) working with Yiling Chen. Congrats to Gabe for having his paper chosen for Spotlights Beyond WINE! Bo and I are the local co-chairs of COLT 2021, Aug 15-19 in Boulder. Irene, Aviad, and I organized the EC 2021 Mentoring Workshop. I am incredibly honored to receive an NSF CAREER award! Dave, Bo, and I co-organized the DIMACS Workshop on Forecasting. Matt, Michal, and I organized the EC 2020 Mentoring Workshop. News archive | Useful things Powered by hyde.",
  "content_length": 1861,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:26"
}