{
  "name": "Rafal K. Mantiuk",
  "homepage": "https://www.cl.cam.ac.uk/~rkm38",
  "status": "success",
  "content": "Rafal Mantiuk - University of Cambridge Rafał Mantiuk * Main Projects The team Teaching Laboratory Software Publications Jobs & PhD opportunities HDR images Rafał Mantiuk Professor of Graphics and Displays Department of Computer Science and Technology The Computer Laboratory Rainbow Research Group University of Cambridge Office address University of Cambridge Computer Laboratory William Gates Building 15 JJ Thomson Avenue Cambridge CB3 0FD United Kingdom Room SS22 Phone office: +44 1223 763831 E-mail rafal [dot] mantiuk [at] cl [dot] cam [dot] ac [dot] uk Important: if you have never sent or received e-mail from me, please include the text \"n0t5pam\" somewhere in the subject line, for example \"[n0t5pam] Your subject\". This is to avoid the SPAM filter. If you are contacting me about internship, PhD studentship, or a PostDoc position, please check the \"Jobs\" section first. Tweets by @hdrsci Reserach interest Applied visual perception; high dynamic range imaging; display algorithms; machine learning for image synthesis; tone-mapping; video coding for new display technologies; image and video quality metrics; visibility metrics; virtual reality and low-level perception; computational photography; computational displays; novel display technologies; colour; perception in computer graphics; novel image and video representations (beyond 2D); psychophysics; modeling visual perception with machine learning. Biography Professor of Graphics and Displays, University of Cambridge, Computer Laboratory, UK (from 2023) Professor/Reader of Graphics and Displays, University of Cambridge, Computer Laboratory, UK (2018-2023) Senior Lecturer, University of Cambridge, Computer Laboratory, UK (2015-2018) Lecturer/Senior Lecturer, Bangor University, School of Computer Science, UK (2009-2015) Postdoc Fellow, University of British Columbia, Canada (2008-2009) Postdoc, Max-Planck-Institut for Computer Science, Germany (2007-2008) Internship, Sharp Laboratories of America, Camas WA, USA (2006) PhD (summa cum laude, Computer Science), Max-Planck-Institut for Computer Science, Germany (2006) Msc (Computer Science), Technical University of Szczecin, Poland (2003) Google Scholar LinkedIn profile ORCID Recent projects Resolution Limit of the EyeWe have measured what is the maximum resolution (spatial frequency) the human eye can see and how it translates to the displays resolutions. We can determine the resolution at which we can perceive no improvement in image quality. Supra-threshold Contrast Perception in Augmented RealityIn optical see-through AR displays, image contrast is much lower than traditional displays due to mixed background light, yet images appear sharper than expected. We explain this effect with a model that describes supra-threshold contrast perception across luminance levels, informing better AR display algorithms and hardware design. CameraVDPCameraVDP combines calibrated camera capture with a Visual Difference Predictor to evaluate the visibility of display distortions, such as non-uniformity, color fringing, defective pixels, and others. Our camera calibration employs HDR merging, MTF inversion, vignetting correction, geometric undistortion, homography, and color correction to turn a camera into a measurement instrument. See more projects. Recent papers Resolution limit of the eye - how many pixels can we see?Maliha Ashraf, Alexandre Chapiro, and Rafał K. Mantiuk. In: Nature Communications, 16(9086), 2025 (doi) (project page) (arxiv) (PDF) (code) Supra-threshold Contrast Perception in Augmented RealityDongyeon Kim, Maliha Ashraf, Alexandre Chapiro, Rafał K. Mantiuk. In: Proc. of SIGGRAPH Asia 2025, 2025 (doi) (project page) (PDF) (code) CameraVDP: Perceptual display assessment with uncertainty estimation via camera and visual difference predictionYancheng Cai, Robert Wanat, and Rafał K. Mantiuk. In: Proc. of SIGGRAPH Asia 2025, 2025 (doi) (project page) (PDF) (code) ColorVideoVDP-ML: Visual Difference Predictor with a neural regressor for image and video quality predictionDounia Hammou, Fei Yin, Rafał K. Mantiuk. In: ICME Generalizable HDR & SDR Video Quality Measurement Grand Challenge, 2025The second place in the full reference category of the Grand Challenge. (doi) (project page) (PDF) (code) FaceCraft4D: Animated 3D Facial Avatar Generation from a Single ImageFei Yin, Mallikarjun B R, Chun-Han Yao, Rafał K. Mantiuk, Varun Jampani. In: Proceedings of International Conference on Computer Vision (ICCV'2025), 2025 (arxiv) (PDF) See all papers. Awards and grants ColorVideoVDP-ML was awarded second place in the full reference category of ICME Generalizable HDR & SDR Video Quality Measurement Grand Challenge 2025 HDR-VDP-2 paper received the Test-of-Time Award from SIGGRAPH (2023) for \"a significant and lasting impact on computer graphics and interactive techniques over at least a decade\" HDR-VDP-3 won the 1st place in the HDR Video Quality Measurement Grand Challenge (2023) in the full-reference category Color Imaging Conference 2022 (CIC30) Best Paper Award for the paper Suprathreshold contrast matching between different luminance levels London Imaging Meeting 2022 Best Paper Award for the paper A Comparative Study on the Loss Functions for Image Enhancement Networks ACM SIGGRAPH European Conference on Visual Media Production (CVMP 2022) Best Paper Award for the paper Distilling Style from Image Pairs for Global Forward and Inverse Tone Mapping Color Imaging Conference (CIC28) Best Paper Award for the paper Practical color contrast sensitivity functions for luminance levels up to 10000 cd/m2 Electronic Imaging / Human Vision and Electronic Imaging 2020 Best Paper Award for the paper Predicting visible flicker in temporally changing images The IEEE Virtual Reality 2019 Best Journal Paper - for the paper Temporal Resolution Multiplexing: Exploiting the limitations of spatio-temporal vision for more efficient VR rendering Electronic Imaging / Human Vision and Electronic Imaging 2019 Best Paper Award for the paper A visual model for predicting chromatic banding artifacts ERC Consolidator Grant (2017) - EyeCode: Perceptual encoding of high fidelity light fields MSCA Innovative Training Network (2018) - RealVision: Hyper-realistic Visual Experience EPSRC research grant (2017) - A spatio-chromatic colour appearance model for retargeting high-dynamic-range image appearance across viewing conditions HPC Wales Research and Innovation grant (2013/14) - Video retargeting for delivery to mobile and future display technologies Royal Society Research Grant (2013) - Limiting factors of perceptual image fidelity EPSRC grant EP/I006575/1 (2011) - Quantifying image quality in computer graphics Heinz Billing Award 2006 My contribution to the organization of research networks and conferences can be found here. Last modified: Wed 12 Nov 15:12:37 GMT 2025",
  "content_length": 6849,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:26"
}