{
  "name": "Ragesh Jaiswal",
  "homepage": "http://www.cse.iitd.ernet.in/~rjaiswal",
  "status": "success",
  "content": "Home page of Ragesh Jaiswal Ragesh Jaiswal I am an associate professor in the Department of Computer Science and Engineering at IIT Delhi. I am interested in Algorithms, Complexity, Theoretical Cryptography, and Machine Learning. Office Address: Room 403, SIT Building, IIT Delhi, Hauz Khas, New Delhi India - 110 016 Before joining IIT Delhi, I worked as a Postdoctoral Research Scientist at Columbia University, New York. Before this, I did my PhD under Prof. Russell Impagliazzo from the University of California San Diego. I did my BTech from IIT Kanpur. Email: Book Algorithms: A gentler approach (with Russell Impagliazzo) Teaching [New] ACOL106: Data Structures and Algorithms (Semester I, 2025-26, IITD - Abu Dhabi). [New] AGRL112: Introduction to Computer Science Major (Semester I, 2025-26, IITD - Abu Dhabi). COL863: Quantum Computing (Semester II, 2024-25). COL702: Advanced Data Structures and Algorithms (Semester I, 2024-25). COL866: Quantum Computing (Semester II, 2023-24). COL702: Advanced Data Structures and Algorithms (Semester I, 2023-24). COL758: Advanced Algorithms (Semester II, 2022-23). COL702: Advanced Data Structures and Algorithms (Semester I, 2022-23). COL351: Analysis and Design of Algorithms (Semester II, 2021-22). COL863: Quantum Computing (Semester I, 2021-22). COL100: Introduction to Computer Science (Semester II, 2020-21). COL351: Analysis and Design of Algorithms (Semester I, 2020-21). COL863: Quantum Computing (Semester II, 2018-19). COL202: Discrete Mathematical Structures (Semester I, 2018-19). CSL202: Discrete Mathematical Structures (Semester II, 2017-18). COL866: Foundations of Data Science (Semester I, 2017-18). COL106: Data Structures and Algorithms (Semester II, 2016-17). COL351: Analysis and Design of Algorithms (Semester I, 2016-17). Courses taught at University of California San Diego (Fall-2015, Winter-2016). COL870: Special Topics in Machine Learning (Clustering Algorithms)(Semester II, 2014-15). CSL356: Analysis and Design of Algorithms(Semester I, 2014-15). CSL853: Complexity Theory(Semester II, 2013-14). CSL105: Discrete Mathematical Structures(Semester I, 2013-14). CSL759: Cryptography and Computer Security(Semester II, 2012-13). CSL356: Analysis and Design of Algorithms(Semester I, 2012-13). CSL857: Randomized Algorithms(Semester II, 2011-12). CSL356: Analysis and Design of Algorithms(Semester I, 2011-12). CSL866: Cryptography(Semester II, 2010-11). CSL201: Data Structures(Semester I, 2010-11). Students Anup Bhattacharya (2012-2018) Dishant Goyal (2017-2023, co-advised by Prof. Amit Kumar) Jatin Yadav (2023-present, co-advised by Prof. Amit Kumar) Publications (recent work) Ragesh Jaiswal, Amit Kumar, and Jatin Yadav Robust-Sorting and Applications to Ulam-Median, [ArXiv][ICALP'25 (to appear)] Short Description: We study the \"robust sorting\" problem, where the comparison operator can behave arbitrarily on a subset B of elements. The comparator is consistent with a true ordering as long as the elements in the queried pair do not belong to B. However, it gives an arbitrary (but persistent) answer if even one element of the pair belongs to B. The goal is to find an ordering close to the true ordering in near-linear time. This turned out to be one of those problems that appear simple, but deviously difficult to crack. It took us a long process of trial and error to pin down the right algorithm and the analysis. The problem came up naturally while working on the Ulam k-median problem. The problem may have other applications, such as ranking scenarios where the referees may have a bias for or against some players. Short description: In the first paper, we designed a quantum algorithm for D2-sampling (and through this, the first quantum approximation scheme for k-means with polylogarithmic running time in the Quantum RAM (QRAM) model) only to realise that (to put it bluntly in the words of a reviewer-2) \"there is not much quantum here\". This made us realise that, as with so many other Quantum Machine Learning (QML) algorithms in the QRAM model, our D2-sampling-based quantum clustering algorithms can also be dequantized in the sample-query access model of Ewin Tang (PhD Thesis) to obtain a classical algorithm without much loss in the running time (unlike other QML dequantization results where there is a significant loss). We then realised that the dequantization, results in a fast implementation of k-means++, which has a lot of practical value. This is the second paper. Ragesh Jaiswal, A Quantum Approximation Scheme for k-Means, [arXiv][Poster at TQC'24] Short description: We give the first quantum algorithm with a polylogarithmic running time that gives a provable approximation guarantee of (1+ε) (i.e., an approximation scheme) for the k-means problem. Poojan Shah and Ragesh Jaiswal, Quantum (Inspired) D2-sampling with Applications, [arXiv][ICLR'25] Short description: We give a quantum algorithm for (approximate) D2-sampling in the QRAM model, which results in fast quantum implementations of D2-sampling-based clustering algorithms. We dequantize our quantum algorithm to obtain a quantum-inspired classical implementation of k-means++, which is particularly fast on datasets with a bounded aspect ratio. Ragesh Jaiswal, Amit Kumar, and Jatin Yadav FPT Approximation for Capacitated Sum of Radii, [ArXiv][ITCS'24] Short Description: We improve the state of the art in FPT approximation algorithms for the capacitated sum of radii problem. We also show hardness-of-approximation under ETH. Ragesh Jaiswal and Amit Kumar Universal Weak Coreset, [AAAI'24][A graphic novel presentation (PDF)] Short Description: We extend the idea of a weak coreset to constrained settings while simultaneously breaking the \"log n barrier\" on the size of the coreset in general metric spaces. Ragesh Jaiswal and Amit Kumar Clustering What Matters in Constrained Settings, [arXiv][Slides][ISAAC'23 (best paper award)] Short Description: We give an approximation-preserving, outlier to outlier-free reduction for any constrained k-median/means problem in arbitrary metric spaces, enabling developments in outlier-free versions to be carried over to their outlier counterparts. Dishant Goyal, and Ragesh Jaiswal, Tight FPT Approximation for Constrained k-Center and k-Supplier, [arXiv][Theoretical Computer Science] Short Description: We give tight FPT algorithms for the k-center problem (min. the max. radius of k clusters) under arbitrary constraints on clusters. We show that any bi-criteria approximate solution for the unconstrained k-center problem contains an approximate solution for any constrained version of the k-center problem. This gives simple FPT algorithms (poly-time algorithm assuming k is constant) for a range of constrained k-center clustering problems, including a few recently formulated fair clustering problems. We also show that our result is tight under well-known complexity-theoretic assumptions. Dishant Goyal, and Ragesh Jaiswal, Tight FPT Approximation for Socially Fair Clustering, [arXiv][Information Processing Letters] Short Description: We extend a recent line of work on Socially Fair clustering by giving a tight FPT algorithm. Anup Bhattacharya, Ragesh Jaiswal, and Yoav Freund On the k-means/median cost function. [Information Processing Letters] Short Description: The k-means/median cost decreases as k increases. In this work, we try to understand this behaviour more closely. Anup Bhattacharya, Dishant Goyal, and Ragesh Jaiswal, Hardness of Approximation of Euclidean k-Median. APPROX'21. [arXiv] Short Description: We give a hardness of approximation result for the Euclidean k-median problem assuming the Unique Games Conjecture (UGC). This solves an open question posed in this work. Dishant Goyal, Ragesh Jaiswal, and Amit Kumar, FPT Approximation for Constrained Metric k-Median/Means. IPEC'20. [arXiv][IPEC] Short Description: We give (3+ε)-approximation and (9+ε)-approximation for various constrained versions of k-median and k-means problems, respectively in FPT time. Anup Bhattacharya, Dishant Goyal, Ragesh Jaiswal, Amit Kumar, On Sampling Based Algorithms for k-Means. FSTTCS'20.[FSTTCS] Short Description: This is a combined presentation of the works below. Anup Bhattacharya, Dishant Goyal, Ragesh Jaiswal, and Amit Kumar, Streaming PTAS for Binary ℓ0-Low Rank Approximation. [arXiv] Short Description: We give constant-pass, polylog-space streaming PTAS for the constrained binary k-means problem and the generalised binary ℓ0-rank-r approximation problem. Dishant Goyal, Ragesh Jaiswal, and Amit Kumar, Streaming PTAS for Constrained k-Means. [arXiv] Short Description: We generalise our previous results and use it to obtain constant-pass, logspace streaming PTASs for a variety of constrained k-means problems as well as faster PTAS for k-means under stability. Ragesh Jaiswal and Amit Kumar, Multiplicative Rank-1 Approximation using Length-Squared Sampling. SOSA@SODA'20. [arXiv][Talk] Short Description: We show that the span of Ω(1/ε4) rows of any matrix sampled according to the length-squared distribution contains a rank-1 matrix B that gives a (1+ε) multiplicative approximation under the Frobenius norm. Previous known results gave additive approximation. Ragesh Jaiswal, A note on the relation between XOR and Selective XOR Lemmas. [ Information Processing Letters] [arXiv] Short Description: We give a simple reduction from the Selective XOR lemma to the standard XOR lemma. Nir Ailon, Anup Bhattacharya, Ragesh Jaiswal, Amit Kumar, Approximate Clustering with Same-Cluster Queries. ITCS 2018. [arXiv][Talk] Short Description: In this work, we explore the power and limitation of same-cluster queries in the context of approximate clustering. Ragesh Jaiswal, Sandeep Sen, Approximate Clustering [PDF] Book chapter to appear in Approximation Algorithms and Metaheuristics - Volume II Short Description: Contains a survey on sampling-based clustering algorithms. Russell Impagliazzo, Ragesh Jaiswal, Valentine Kabanets, Br",
  "content_length": 12771,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:28"
}