{
  "name": "Raghavendra Selvan",
  "homepage": "https://raghavian.github.io",
  "status": "success",
  "content": "Bio - Raghavendra Selvan Raghav{endra Selvan}Assistant Professor (TT) @ Machine Learning Section, University of Copenhagen. ELLIS Member. Follow Bangalore/Copenhagen Website Email Twitter Github Google Scholar WordpressRaghavendra Selvan (Raghav) is currently an Assistant Professor (Tenure-track) at the Machine Learning Section, Department of Computer Science, University of Copenhagen. His research spans sustainable machine learning, machine learning for sciences, medical image analysis, and graph neural networks. He holds a PhD from the University of Copenhagen and is affiliated with Pioneer Center for AI (Denmark) and the pan-European AI network ELLIS. Raghav was born in Bangalore, India. RS is the author of the new book “Sustainable AI”.Book Available Now!RS published a book Sustainable AI. Check out the webpage for the book here.HiringCurrent openings:Postdoctoral position to work on ML for Sustainable Food (deadline 15th Jan. 2026, details)If you are interested in joining our team check out the open positions advertised on UCPH Job Portal. And if no positions are currently being advertised by me, feel free to reach out with a short email about what you are interested in and how the projects in my team might be of interest to you. The latter also holds for visiting researchers, and prospective thesis students (enrolled at UCPH).News2025-11: Sustainable AI now published, and available online.2025-11: RS has been recognised at the Department of CS, UCPH for “For sustained excellence in teaching, research and organizational contribution” in 2025.2025-11: RS has been recognised as an “Outstanding Area Chair” at NLDL-2026.2025-07: RS will be part of the AIM@Cancer project contributing with workpackage on resource-efficient ML for radiotherapy applications.2025-07: Paper accepted to IEEE MLSP 2025.2025-06: Paper accepted to Aarhus 2025 Conference on Computing [X] Crisis.2025-05: Paper accepted to ACM Software Engineering Notes.2025-05: Paper accepted to the Journal of Imaging Neuroscience.2025-04: Paper at CHI-2025 received a Special Recognition for Sustainable Practices.2025-03: Paper accepted to be presented at Scandinavian Conference on Image Analysis (SCIA-2025)2025-03: RS will be collaborating with Remko Boom on a new 50M DKK project to revolutionize sustainable plant-based food production.2025-01: RS has started as a partner in a new EU Project: DataPACT to develop compliance tools focused on environmental sustainability of AI.",
  "content_length": 2475,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:28"
}