{
  "name": "Raghavendra Pradyumna Pothukuchi",
  "homepage": "https://www.cs.unc.edu/~raghav",
  "status": "success",
  "content": "Raghav Pothukuchi Home Research Teaching & Mentoring Service Industry Rest of Life Links & Notes Raghavendra Pradyumna Pothukuchi William R. Kenan Jr. Fellow Assistant Professor Dept. of Computer Science The University of North Carolina (UNC) at Chapel Hill ✉ raghav DOT pothukuchi AT unc DOT edu  CV My research is to build computers that can directly talk to the brain, and think like the mind. This includes building brain-computer interfaces (BCIs), classical and quantum platforms for cognitive modeling frameworks, and using inspiration from the brain to design new computers. This work spans computer architecture, systems design, compilers, cognitive modeling, machine learning, control theory, security, and ethics. My research vision is laid out in this seminar I gave at the Athena NSF AI Institute. Here's a short highlight that the NY Academy of Sciences created when I was announced as a laureate of the 2024 Blavatnik Regional Award for Young Scientists. I've received several honors for my work. These include the Alnylam Scientific Excellence Award at the Nucleate Activator Demo Day in New Haven, the Blavatnik Regional Award for Young Scientists by The New York Academy of Sciences in physical science & engineering across New York, New Jersey, and Connecticut, IEEE Micro Top Picks in Computer Architecture in 2024 and 2021, the 2023 ISCA best paper award, NSF/CRA Computing Innovation Fellowship in 2021, young researcher at the Heidelberg Laureate Forum in 2021, a cover feature on IEEE Control Systems in 2020, W. J. Poppelbaum Award at the Dept. of CS, UIUC in 2018, rising star in computer architecture at the Georgia Institute of Technology in 2018, 2017 PACT best paper nomination, Mavis Future Faculty Fellowship by the College of Engineering, UIUC in 2017, an ACM student research competition at PACT 2017, and the university gold medal at BITS Pilani in 2011. I have recently co-organized a CCC visioning workshop on defining the role of computing research in neural interface design, bringing together neuroscientsits, neurosurgeons and neuroengineers, along with hardware and software experts in academia and industry, and federal agencies like the NSF, and NIH, to create a roadmap for computing in BCIs, and spur the creation of new communities in computer science and engineering. I also contributed to the CCC visioning workshop on the next steps in quantum computing. Before my current position, I was at Yale University as an associate research scientist and an NSF/CRA Computing Innovation Fellow with Prof. Abhishek Bhattacharjee and Prof. Jonathan Cohen (Princeton Neuroscience Institute). I received my PhD in CS from the University of Illinois at Urbana-Champaign (UIUC), advised by Prof. Josep Torrellas. My dissertation was on building intelligent systems for security and efficiency. Prior to graduate school, I was an ASIC Design Engineer in the Physical Design Team at Nvidia Graphics, Bangalore, India. Before that, I earned my bachelors degree in Electrical and Electronics Engineering from Birla Institute of Technology & Science (BITS), Pilani, India.",
  "content_length": 3104,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:30"
}