{
  "name": "Ragib Hasan",
  "homepage": "http://ua-birmingham.academia.edu/RagibHasan",
  "status": "success",
  "content": "Ragib Hasan - University of Alabama at Birmingham Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Ragib HasanUniversity of Alabama at Birmingham, Computer and Information Sciences, Faculty MemberJohns Hopkins University, Computer Science, Department MemberaddFollowdoneFollowingFollowers545Following11Co-authors8Public ViewsI am an Assistant Professor at the Department of Computer and Information Sciences at the University of Alabama at Birmingham.In the past, I was a PhD candidate at the Department of Computer Science, University of  Illinois at Urbana-Champaign. My advisor is Prof. Marianne Winslett. I am also co-advised by Prof. Radu Sion of SUNY-StonyBrook.I am primarily interested in Computer Security, Secure Provenance, Trust Management, and Storage Systems research. My PhD dissertation topic is related to protecting the past (secure provenance,) and present (term-immutability) of data.Address: 115 Campbell Hall1300 University Blvd, Birmingham, AL 35294lessRelated Authors Julita VassilevaUniversity of Saskatchewan John F DooleyKnox College David SeamonKansas State University Horst R MarschallGoethe-Universität Frankfurt am Main Roshan ChitrakarNepal College of Information Technology Lev ManovichGraduate Center of the City University of New York PALIMOTE JUSTICERIVERS STATE POLYTECHNIC Changqian MaChina University of Geosciences(Wuhan) Renato RamosUniversidade Federal do Rio de Janeiro (UFRJ) Olubunmi AdeigbeUniversity of Ibadan NigeriaInterests CVUploadsPapers by Ragib HasanAn Interaction Provenance-based Trust Management Scheme For Connected VehiclesConnected vehicles (CVs) have facilitated the development of intelligent transportation system th... more Connected vehicles (CVs) have facilitated the development of intelligent transportation system that supports critical safety information sharing with minimum latency. However, CVs are vulnerable to different external and internal attacks. Though cryptographic techniques can mitigate external attacks, preventing internal attacks imposes challenges due to authorized but malicious entities. Thwarting internal attacks require identifying the trustworthiness of the participating vehicles. This paper proposes a trust management framework for CVs using interaction provenance that ensures privacy, considers both in-vehicle and vehicular network security incidents, and supports flexible security policies. For this purpose, we present an interaction provenance recording and trust management protocol. Different events are extracted from interaction provenance, and trustworthiness is calculated using fuzzy policies based on the events. Securing the Fog using Software-Defined Networking: A Study of Challenges, Approaches, and Open ProblemsFog computing is a new paradigm that provides Cloud-like services to the network edge where the e... more Fog computing is a new paradigm that provides Cloud-like services to the network edge where the end-users reside. It opens up the facilities of Cloud to the edge of the network. It enables a wide range of benefits, including enhanced security, decreased bandwidth, and reduced latency, it is an appropriate paradigm for many IoT services. As the Fog has similarities with the Cloud, it inherits all the security problems of the Cloud as well as faces new security and privacy issues such as authentication at different levels of gateways, trust model, Fog network security, etc. Recent research work shows that Software-Defined Networking (SDN) is very effective in managing network flows. In this study, we explore and provide a systemic analysis of the security and privacy issues of existing Fog-based networks. We present attack surfaces and threat models of Fog computing. We then discuss existing research projects to resolve security issues. We also analyze existing SDN-based solution for Fog networks. Through this study, we find out a set of open problems in existing Fog-based systems and provide a detailed description for each of them. Furthermore, we investigate the possibilities of an SDN-based solution for the Fog-based system. FinderX: A Bluetooth Beacon Based System for Designing Sustainable Green Smart CitiesIEEE Consumer Electronics Magazine, 2021Cities offer extensive facilities to enrich the quality of life by utilizing smart devices and se... more Cities offer extensive facilities to enrich the quality of life by utilizing smart devices and sensors. The Internet of Things and smart sensors connect various city services with the inhabitants. The services should be convenient and accessible to all, especially pedestrians and people with visual impairment. However, the lack of information about service locations often limits their availability and use. To this end, we developed FinderX, a Bluetooth beacon-based system to search for the nearest services and amenities. FinderX identifies the locations of nearby amenities in real time using the signal from attached beacons. The system does not require Internet or other communication infrastructure and can function where the GPS signal is inaccessible. To demonstrate the feasibility of FinderX, we set up a testbed and evaluated the system in an urban environment. We show that FinderX has adequate usability and feasibility and it reduces the time to find the amenities by 18.98% on average. We also demonstrate that Bluetooth beacons have a lower horizontal error compared to GPS in micropositioning (where semi-indoor or surrounding infrastructure limits signal accessibility), which motivates the use of Bluetooth beacons for such applications. Towards a Threat Model and Privacy Analysis for V2P in 5G NetworksIn recent years, pedestrian and bicyclist fatalities have increased while roadway fatalities have... more In recent years, pedestrian and bicyclist fatalities have increased while roadway fatalities have remained relatively consistent. There is an emerging body of research on vehicle-to-pedestrian (V2P) communication to reduce collision. However, the success of the real-life implementation of such a system is limited. Current technology and network spectrum are insufficient to support the fully functional V2P system. Research suggests that the low latency and high bandwidth of 5G technology would improve vehicle-pedestrian communication. Unfortunately, such systems raise security and privacy concerns. It is important to systematically analyze the security and privacy issues of such systems. This paper discusses the security and privacy issues of vehicle-pedestrian communication in 5G technology and analyzes the threat model of such applications using the STRIDE model. Such a threat model can help researchers and practitioners build secure V2P systems running over 5G networks. FogTestBed: A Generic Architecture for Testbed for Fog-based SystemsIn recent years, the growth of the Internet of Things (IoT) has pushed the advancement of computi... more In recent years, the growth of the Internet of Things (IoT) has pushed the advancement of computing service at the network edge. With many connected devices at the user end, applications regarded with IoT need enough computing resource as much as closer to the devices. In this regard, the new paradigm of Fog/Edge computing can significantly benefit these applications. Researchers or developers working in these domains often require various types of IoT devices as well as ample edge services to develop or test their methods and hypotheses. In this paper, we propose FogTestBed - an architecture to implement a Testbed as a service using the Fog node servers located near the users&#39; networks. FogTestBed allows testbed owners to build their testbeds infrastructure at the network edge and provide secure and private access to the clients for running experiment or testing. FogTestBed also contains an incentive model for giving monetary benefits to the testbed owners. Finally, we implemented a prototype of the FogTestBed using laptops as Fog nodes and measure the performance. X-Fidence: Post-Pandemic Wellness By Density Monitoring with Privacy Preservation2022 IEEE 19th Annual Consumer Communications & Networking Conference (CCNC), Jan 8, 2022There is an increasing interest in crowd monitoring as we return to normal life after the Covid-1... more There is an increasing interest in crowd monitoring as we return to normal life after the Covid-19 pandemic. Some major obstacles to implementing a monitoring system are: privacy, scalability, and accuracy. Several entities have developed their own branded safety reassurance programs using the Internet of Things and sensors during the pandemic, and many cities are planning for the post-pandemic era. However, the lack of inclusiveness and the fear of personal information leakage often limit their usage. To this end, we developed X-Fidence, a real-time density monitoring system to avoid crowds which preserves user privacy. X-Fidence anonymously tracks visitors in certain places using Bluetooth technology. The system consists of a signal receiver module, a mobile application, and a monitoring server where the citywide current occupancy data syncs automatically. The mobile application provides density data in real-time and average historic crowds information that helps to make decisions more confidently. The X-Fidence mobile app warns residents if any area experiences more visitors than maximum safe capacity. We also present our results from an experiment to measure the feasibility and accuracy of the system. IGaaS: An IoT Gateway-as-a-Service for On-demand Provisioning of IoT GatewaysThe widespread adoption of the Internet of Things (IoT) devices has increased its popularity and ... more The widespread adoption of the Internet of Things (IoT) devices has increased i",
  "content_length": 16339,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:31"
}