{
  "name": "Ragunathan Raj Rajkumar",
  "homepage": "https://users.ece.cmu.edu/~raj",
  "status": "success",
  "content": "Prof. Raj Rajkumar, Carnegie Mellon Carnegie Mellon Home Cyber-Physical Systems Tartan Racing GM Labs Sensor Andrew Navigation Research Publications Activities & Awards Patents Teaching Miscellaneous The Mars Happening What's in a Name? Prospective Students Media Coverage What's up? Our Autonomous Car took several members of Congress and some from media on autonomous vehicle rides in and around Washington DC. What else? Lots of media coverage happening... please come back. Smart Transportation? The CMU-Penn University Transportation Center is now the USDOT National Univerity Transportation Center on Safety. Prof. Ragunathan \"Raj\" Rajkumar Please click here to watch the videos of the latest demos of our Autonomous Cadillac SRX in urban neighborhood around Capitol Hill, and along the inter-state highways in and around Washington DC. For more information regarding the Sept 4, 2013 autonomous ride from Cranberry, Pa. to the Pittsburgh Int'l Airport, please click here. The ride was 33-miles long through high-traffic suburban thoroughfares and two interstate highways. And the passengers included Bill Shuster, Chairman of the US House Transportation and Infrastructure Committee, and Barry Schoch, Secretary of Pennsylvania Department of Transportation. Welcome to the home-page of Prof. Raj Rajkumar (a.k.a. Ragunathan Rajkumar), George Westinghouse Professor in the Department of Electrical and Computer Engineering at Carnegie Mellon University. I also have a courtesy appointment in the Robotics Institute at Carnegie Mellon. In addition, I serve as: Director, USDOT Mobility21 National University Transportation Center. Director, USDOT Safety21 National University Transportation Center. Director, Metro21: Smart Cities Institute. Director, Real-Time and Multimedia Systems Lab. Office Mailing Address CIC 2309 4720 Forbes Ave Pittsburgh, PA 15213 Phone:   +1 412 268-8707 Fax:       +1 412 268-1124 Professor Raj Rajkumar Electrical & Computer Engg. Dept. Carnegie Mellon University 5000 Forbes Avenue Pittsburgh, PA 15213-3891 USA Where in the World is CIC? The Collaborative Innovation Center (CIC) is located to the West of Hamburg Hall (HbH) along Forbes Avenue on the Carnegie Mellon campus. (For parking only, click here for directions to the CIC parking garage.) Administrative Assistant Ms. Rachel Burress, Phone: +1 412 268-1657, Fax: +1 412 268-2860 E-mail: rburressandrew.cmu.edu, Office: CIC 2105 Maps & directions Carnegie Mellon University",
  "content_length": 2470,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:31"
}