{
  "name": "Rahul Sharma 0003",
  "homepage": "http://researchers.uq.edu.au/researcher/2660",
  "status": "success",
  "content": "Associate Professor Rahul Sharma | UQ Experts Skip to menu Skip to content Skip to footer Associate Professor Rahul Sharma Email: rahul.sharma@uq.edu.au Phone: +61 7 336 57240 Positions Associate Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background I work on control systems and AI for renewable energy, with applications in solar farms, smart grids, and inverter-dominated power systems. My research combines theory, simulation, and field validation, with active collaborations across industry and translational research. I completed my PhD at the University of Melbourne in 2008, focusing on fault diagnosis in power systems, and have been engaged continuously in research and teaching since 2005. Following my PhD, I joined the Mechanical Engineering Department at The University of Melbourne as a research fellow to work on the control system design for a hydrogen fuelled internal combustion engine. I joined UQ in late 2011 and currently hold a Associate Professor role with responsibilities in teaching, research and service. My research spans solar farms, grid-connected inverters, distributed energy resources, and battery storage systems, combining theory, simulation, and real-world experimentation. I have led translational research efforts, most notably SolarisAI, a start-up commercialising solar farm monitoring and underperformance diagnosis. Prospective PhD Students I welcome motivated students interested in control systems, renewable energy, and AI-based optimisation. I am interested in projects with both theoretical and practical impact, including: Solar farm reliability enhancement and fault detection- AI-driven monitoring of utility-scale solar systems. Grid-connected inverter and battery control- advanced control strategies for stable integration of distributed energy resources. Demand-side management and smart grid optimisation- algorithms for efficient load and storage coordination. Digital twins and hybrid modelling- simulating and predicting energy system behaviour. End-of-life PV system management- sustainable logistics and circular economy strategies for solar panels. Interested applicants with strong academic credentials and evidence of research experience are welcome to contact me directly via email with your CV, academic transcripts, and a short statement of research interest to me. Read more Read less Availability Associate Professor Rahul Sharma is: Available for supervision Media expert Research interests Under-performance diagnosis and predictive maintenance for utility-scale solar farms Read more Read less Demand-side management and optimisation in power systems Read more Read less Solar end-of-life logistics analysis management Read more Read less Management of Distributed Energy Resources including battery storage systems in LV distribution networks Read more Read less Works Search Professor Rahul Sharma’s works on UQ eSpace All (107) Book (1) Journal Article (49) Conference Publication (56) Book Chapter (1) 2025 Journal Article Stage-wise modelling of energy, emissions, and economic trade-offs in recycling end-of-life photovoltaic panels for circular economy decision-making Almaghrbi, Fadi, Tushar, Wayes and Sharma, Rahul (2025). Stage-wise modelling of energy, emissions, and economic trade-offs in recycling end-of-life photovoltaic panels for circular economy decision-making. Energy, 336 138210, 138210-336. doi: 10.1016/j.energy.2025.138210 Stage-wise modelling of energy, emissions, and economic trade-offs in recycling end-of-life photovoltaic panels for circular economy decision-making 2025 Journal Article A review on network-aware control of distributed energy resources under the dynamic operating envelopes framework Lankeshwara, Gayan, Sharma, Rahul, Yan, Ruifeng, Tushar, Wayes and Saha, Tapan K. (2025). A review on network-aware control of distributed energy resources under the dynamic operating envelopes framework. Renewable and Sustainable Energy Reviews, 217 115696, 1-27. doi: 10.1016/j.rser.2025.115696 A review on network-aware control of distributed energy resources under the dynamic operating envelopes framework 2025 Journal Article Development and validation of a dynamic operating envelopes-enabled demand response scheme in low-voltage distribution networks Lankeshwara, Gayan, Sharma, Rahul, Alam, M.R., Yan, Ruifeng and Saha, Tapan K. (2025). Development and validation of a dynamic operating envelopes-enabled demand response scheme in low-voltage distribution networks. Applied Energy, 382 125150, 1-16. doi: 10.1016/j.apenergy.2024.125150 Development and validation of a dynamic operating envelopes-enabled demand response scheme in low-voltage distribution networks 2024 Journal Article Advanced condition monitoring for active front end converter LCL filter AC capacitors Matijevic, Edi, Sharma, Rahul, Hemanth, Ajay, Zare, Firuz and Kumar, Dinesh (2024). Advanced condition monitoring for active front end converter LCL filter AC capacitors. IEEE Journal of Emerging and Selected Topics in Power Electronics, 12 (6), 5591-5601. doi: 10.1109/jestpe.2024.3400454 Advanced condition monitoring for active front end converter LCL filter AC capacitors 2024 Conference Publication Assessing the environmental impact of recycling end-of-life solar panels: a case study of the Sunshine Coast solar farm Almaghrbi, Fadi, Tushar, Wayes and Sharma, Rahul (2024). Assessing the environmental impact of recycling end-of-life solar panels: a case study of the Sunshine Coast solar farm. 2024 IEEE 34th Australasian Universities Power Engineering Conference, AUPEC 2024, Sydney, Australia, 20-22 November 2024. Piscataway, NJ, United States: Institute of Electrical and Electronics Engineers. doi: 10.1109/aupec62273.2024.10807636 Assessing the environmental impact of recycling end-of-life solar panels: a case study of the Sunshine Coast solar farm 2024 Journal Article Time-varying operating regions of end-users and feeders in low-voltage distribution networks Lankeshwara, Gayan, Sharma, Rahul, Yan, Ruifeng, Saha, Tapan K. and Milanović, Jovica V. (2024). Time-varying operating regions of end-users and feeders in low-voltage distribution networks. IEEE Transactions on Power Systems, 39 (2), 4600-4611. doi: 10.1109/tpwrs.2023.3302421 Time-varying operating regions of end-users and feeders in low-voltage distribution networks 2024 Journal Article Dynamic operating envelope-enabled P2P trading to maximise financial returns of prosumers Azim, M. Imran, Lankeshwara, Gayan, Tushar, Wayes, Sharma, Rahul, Alam, Mollah R., Saha, Tapan K., Khorasany, Mohsen and Razzaghi, Reza (2024). Dynamic operating envelope-enabled P2P trading to maximise financial returns of prosumers. IEEE Transactions on Smart Grid, 15 (2), 1978-1990. doi: 10.1109/tsg.2023.3297366 Dynamic operating envelope-enabled P2P trading to maximise financial returns of prosumers 2024 Journal Article Robust provision of demand response from thermostatically controllable loads using Lagrangian relaxation Lankeshwara, Gayan and Sharma, Rahul (2024). Robust provision of demand response from thermostatically controllable loads using Lagrangian relaxation. International Journal of Control, 97 (8), 1918-1933. doi: 10.1080/00207179.2023.2241579 Robust provision of demand response from thermostatically controllable loads using Lagrangian relaxation 2024 Journal Article Enhancing active power dispatchability of WTG-BESS through integrated control considering wind forecast error Suboh, S. M., Sharma, R., Tushar, W. and Ahamad, N. B. (2024). Enhancing active power dispatchability of WTG-BESS through integrated control considering wind forecast error. IEEE Access, 12, 2778-2792. doi: 10.1109/access.2023.3348820 Enhancing active power dispatchability of WTG-BESS through integrated control considering wind forecast error 2023 Journal Article Waveform abnormality detection method for distribution system equipment condition monitoring Luo, Junya, Yan, Ruifeng, Saha, Tapan and Sharma, Rahul (2023). Waveform abnormality detection method for distribution system equipment condition monitoring. International Journal of Electrical Power and Energy Systems, 152 109267, 1-8. doi: 10.1016/j.ijepes.2023.109267 Waveform abnormality detection method for distribution system equipment condition monitoring 2023 Journal Article Detailed estimation of grid-side current and its oscillations caused by adjustable speed drive systems Moradi, Arash, Farajizadeh, Farzad, Zare, Firuz, Kumar, Dinesh, Rathnayake, Hansika, Sharma, Rahul and Kroese, Dirk (2023). Detailed estimation of grid-side current and its oscillations caused by adjustable speed drive systems. IEEE Transactions on Industrial Electronics, PP (99), 1-10. doi: 10.1109/tie.2022.3206695 Detailed estimation of grid-side current and its oscillations caused by adjustable speed drive systems 2023 Journal Article Achieving the UN’s sustainable energy targets through dynamic operating limits Tushar, Wayes, Azim, M. Imran, Alam, Mollah Rezaul, Yuen, Chau, Sharma, Rahul, Saha, Tapan and Poor, H. Vincent (2023). Achieving the UN’s sustainable energy targets through dynamic operating limits. iScience, 26 (7) 107194, 107194. doi: 10.1016/j.isci.2023.107194 Achieving the UN’s sustainable energy targets through dynamic operating limits 2023 Book SM Bay City - Sustainability Framework: pathways for achieving sustainability outcomes in Manila Bay Maher, Ray, Ahmad, Mubeen, Fidelman, Pedro, Franks, Daniel, Fuller, Richard, Hyland, Peter, Junior, Patrick, Kenway, Steven, Ly, Leo, Molyneaux, Lynette, Sharma, Rahul, Sipe, Neil, Sochacka, Beata, Sockhill, Nicola and Webster-Mannison, Marci (2023). SM Bay City - Sustainability Framework: pathways for achieving sustainability outcomes in Manila Bay. Manila, The Phillipines: SM Prime. SM Bay City - Sustainability Framework: pathways for achieving sustainability outcomes in Manila Bay 2023 Journal Article A comprehensive r",
  "content_length": 20268,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:40"
}