{
  "name": "Rahul Shah 0001",
  "homepage": "http://www.csc.lsu.edu/~rahul",
  "status": "success",
  "content": "Rahul Shah Roy Paul Daniels Distinguished Professor Division of Computer Science and Engineering School of Electrical Engineering and Computer Science Louisiana State University 3272J Patrick F Taylor Hall Baton Rouge, LA 70810 Email: rahul AT lsu DOT edu BRIEF BIO Rahul Shah is a Professor of Computer Science and Engineering at Louisiana State University. He did PhD in Computer Science from Rutgers University (2002) under the supervision of Dr. Martin Farach-Colton, and B. Tech from Indian Institute of Technology Mumbai (1997). Prior to joining LSU, he was a postdoc at Purdue University under the supervision of Dr. Jeffrey Scott Vitter. He also spent a year as a Research Staff Member at IBM India Research Lab. He served as a Program Director for NSF Algorithmic Foundations from 2015-2019. He is a senior member of ACM. RESEARCH INTERESTS Broadly: Theoretical Computer Science, Algorithms, Data Structures Specifically: Compressed Data Structures, String Matching, I/O-efficient Algorithms Other areas of interests: Computational Biology, Uncertain and Ranked Databases PUBLICATIONS Google Scholar Profile  | CV Selected Recent Publications Note: Copyrights for each of these are with the respective publishers. This is for easy academic dissemination only. ·       Arnab Ganguly, Rahul Shah, Sharma V. Thankachan: Fully Functional Parameterized Suffix Trees in Compact Space. In international colloquium on Automata, Languages, and programming (ICALP) 2022: 65:1-65:18 [Download] ·       Arnab Ganguly, Dhrumil Patel, Rahul Shah, Sharma V. Thankachan: LF Successor: Compact Space Indexing for Order-Isomorphic Pattern Matching. . In international colloquium on Automata, Languages, and programming (ICALP) 2021: 71:1-71:19 [Download] ·       Arnab Ganguly, Rahul Shah, Sharma V. Thankachan: pBWT: Achieving Succinct Data Structures for Parameterized Pattern Matching and Related Problems, In ACM-SIAM Symposium on Discrete Algorithms (SODA), 2017  [Download] ·       Wing-Kai Hon, Rahul Shah, Sharma V. Thankachan, Jeffrey Scott Vitter, Space-Efficient Frameworks for Top-k String Retrieval, Journal of ACM, 2015 [Download] COURSES CSC 7300: Algorithms Design and Analysis CSC 3102: Advance Data Structures and Algorithms Analysis CSC 2262: Numerical Methods CSC 2259: Discrete Structures GRANTS NSF Hecura (2006) NSF Algorithms (2010) NSF Algorithms (2012) NSF Algorithms (2015) NSF Algorithms (2021) SERVICE Selected Conference Committees: SODA, DCC, ISAAC, IWOCA, CPM, SPIRE PHD STUDENTS Past Sharma Thankachan (Phd 2014, Associate Professor at NCSU) Arnab Ganguly (Phd 2017, Associate Professor at Univ. Wisconsin White-Water) Manish Patil (Phd 2014, Research Scientist at Meta) Sudip Biswas (Phd 2016, CTO @CYBERA) Current Lalita Sthapit Provide Website Feedback Accessibility Statement",
  "content_length": 2803,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:49"
}