{
  "name": "Rahul G. Krishnan",
  "homepage": "http://www.cs.toronto.edu/~rahulgk/index.html",
  "status": "success",
  "content": "Rahul G. Krishnan — Home Rahul G. Krishnan Assistant Professor, Computer Science & Laboratory Medicine and Pathobiology Canada CIFAR AI Chair at the Vector Institute Tier II Canada Research Chair in Computational Medicine I will hire a graduate student in Fall 2026. Apply to the DCS graduate program. See more information on the joining page. Research Direction Data collected from natural phenomena characterize computation occurring within complex processes governed by known and unknown laws. Neural networks are powerful tools that can learn to compress computation happening in nature. My group advances fundamental research in machine learning to understand, identify, and create controllable and reliable artificial intelligence systems. We are currently focused on building neural network models that reason causally, and using them to solve problems in healthcare and biology. Students PhD Students Michael Cooper (co-sup w/ Mike Brudno) Vahid Balazadeh-Meresht Jerry Ji (co-sup w/ Anna Goldenberg) Viet Nguyen Lance Chao Yujia Ma (co-sup w/ Chris Maddison) Steven Palayew (sup by Mike Wainberg) Mohammad Adnan (PhD student at the University of Calgary sup. by Yani Ioannou) Postdoctoral Fellows Mohamed Reza Rezaei David Pellow (Schmidt Fellow with Mike Brudno) MSc Students Ethan Choi Aditya Mehrotra Alumni Former alumni from my lab have gone on to graduate (MSc and PhD) programs (NYU, Princeton, CMU, UC Berkeley, Cambridge, Imperial, MILA, ETH, Harvard, Cornell, Waterloo) and research roles in industry (Cerebras Systems, Google Research, Vanguard, Georgian, Scale AI). Tom Ginsberg — MSc (CTO, BeIT Canada) Asic Chen — MSc (Google DeepMind) Ian Shi — PhD (Startup @ YCombinator) Hamidreza Kamkari — MScAC (Layer6; now PhD student at MIT) Changjian Shui — Vector Postdoctoral Fellow (now Assistant Professor, University of Ottawa) Links Bio Joining the Lab Invited Talks & Media Research Grants & Awards Teaching Selected Publications A selected list of representative papers is available below. For a full list, see my Google Scholar profile. CausalPFN: Amortized Causal Effect Estimation via In-Context Learning V. Balazadeh, H. Kamkari, V. Thomas, B. Li, J. Ma, J. Cresswell, R.. Krishnan Neural Information Processing Systems (NeurIPS), 2025 (Spotlight) Paper Code Beyond Masked and Unmasked: Discrete Diffusion Models via Partial Masking. C. Chao, W. Sun, H. Liang, C. Lee, R. Krishnan Neural Information Processing Systems (NeurIPS), 2025 Paper Code Project Page Reliably Detecting Model Failures in Deployment Without Labels V. Nguyen, C. Shui , V. Giri4 , S. Arya , A. Verma , F. Razak, R. Krishnan Neural Information Processing Systems (NeurIPS), 2025 Paper Code Project Page Agentic Medical Knowledge Graphs Enhance Medical Question Answering: Bridging the Gap Between LLMs and Evolving Medical Knowledge M.R. Rezaei, R. Fard, J. Parker, R. Krishnan, M. Lankarany Findings of ACL 2025 Paper Sparse Training from Random Initialization: Aligning Lottery Ticket Masks using Weight Symmetry M. Adnan, R. Jain, E. Sharma, R. Krishnan, Y. Ioannou International Conference on Machine Learning (ICML) 2025 Paper AutoElicit: Using Large Language Models for Expert Prior Elicitation in Predictive Modelling A. Capstick, R. Krishnan, P. Barnaghi International Conference on Machine Learning (ICML) 2025 Paper Code Project Page Diverse Prototypical Ensembles Improve Robustness to Subpopulation Shift N. To, P. Wilson, V. Nguyen, M. Harmanani, M. Cooper, F. Fooladgar, P. Abolmaesumi, P. Mousavi, R. Krishnan International Conference on Machine Learning (ICML) 2025 Paper Code Project Page ExOSITO: Explainable Off-Policy Learning with Side Information for Intensive Care Unit Blood Test Orders J. Ji, A. Amaral, A. Goldenberg, R. Krishnan Conference on Health, Inference and Learning (CHIL), 2025 Paper Code Teaching LLMs How to Learn with Contextual Fine-Tuning Y. Choi, M. Adil Asif, Z. Han, J. Willes, R. Krishnan International Conference on Learning Representations (ICLR), 2025 Paper Project Page End-To-End Causal Effect Estimation from Unstructured Natural Language Data N. Dhawan, L. Cotta, K. Ulrich, R. Krishnan, C. Maddison Neural Information Processing Systems (NeurIPS), 2024 Paper Code Project Page Sequential Decision Making with Expert Demonstrations under Unobserved Heterogeneity V. Balazadeh, K. Chidambaram, V. Nguyen, R. Krishnan*, V. Syrgkanis* Neural Information Processing Systems (NeurIPS), 2024 ( *: equal contribution ) Paper Code Long-Term Allograft Survival in Liver Transplant Recipients X. Gao, M. Cooper, M. Naghibzadeh, A. Azhie, M. Bhat*, R. Krishnan* Machine Learning for Healthcare (MLHC), 2024 Paper Code NeRF-US: Removing Ultrasound Imaging Artifacts from Neural Radiance Fields in the Wild R. Dagli, A. Hibi, R. Krishnan, P. Tyrell Machine Learning for Healthcare (MLHC), 2024 Paper InterpreTabNet: Distilling Predictive Signals from Tabular Data by Salient Feature Interpretation J. Si, W. Cheng*, M. Cooper*, R. Krishnan International Conference on Machine Learning (ICML), 2024 (Spotlight) Paper Code A Geometric Explanation of the Likelihood OOD Detection Paradox H. Kamkari, B. Ross, J. Cresswell, A. Caterini, R. Krishnan, G. Loaiza-Ganem International Conference on Machine Learning (ICML), 2024 Paper Code Structured Neural Networks for Density Estimation and Causal Inference A. Chen*, I. Shi*, X. Gao, R. Baptista*, R. Krishnan* Neural Information Processing Systems (NeurIPS), 2023 Paper Code Copula-Based Deep Survival Models for Dependent Censoring A. Foomani, M. Cooper, R. Grenier, R. Krishnan Uncertainty in Artificial Intelligence (UAI), 2023 Paper Code DuETT: Dual Event Time Transformer for Electronic Health Records A. Labach, A. Pokhrel, X. Huang, S. Zaberi, S. Yi, M. Volkovs, T. Poutanen, R. Krishnan Machine Learning for Healthcare (MLHC), 2023 Paper Code Machine learning in computational histopathology: Challenges and Opportunities M. Cooper, Z. Ji, R. Krishnan Genes Cells and Chromosomes, 2023 Paper A Learning Based Hypothesis Test for Harmful Covariate Shift T. Ginsberg, Z. Liang, R. Krishnan International Conference on Learning Representations (ICLR), 2023 Paper Code Anamnesic Neural Differential Equations with Orthogonal Polynomial Projections E. de-Brouwer, R. Krishnan International Conference on Learning Representations (ICLR), 2023 Paper Code Partial Identification with Implicit Generative Models V. Belazadeh-Meresht, V. Syrgkanis, R. Krishnan Neural Information Processing Systems (NeurIPS), 2022 (Spotlight) Paper Code HiCu: Leveraging Hierarchy for Curriculum Learning in Automated ICD Coding W. Ren, R. Zeng, T. Wu, T. Zhu, R. Krishnan Machine Learning for Healthcare (MLHC), 2022 Paper Code Large Images as Long Documents: Hierarchical ViTs with Self-Supervised Pretraining in Gigapixel Image Pyramids R. Chen, C. Chen, Y. Li, T. Chen, A. Trister, R. Krishnan*, F. Mahmood* Computer Vision and Pattern Recognition (CVPR), 2022 (Oral) Paper Code Hierarchical Optimal Transport for Comparing Histopathology Datasets A. Yeaton, R. Krishnan, R. Mieloszyk, D. Alvarez-Melis, G. Huynh Medical Imaging with Deep Learning (MIDL), 2022 Paper Using Time-Series Privileged Information for Provably Efficient Learning of Prediction Models R. Karlsson, M. Willbo, Z. Hussain, R. Krishnan, D. Sontag, F. Johansson Artificial Intelligence and Statistics (AISTATS), 2022 Paper Code Clustering Interval-Censored Time-Series for Disease Phenotyping I. Chen, R. Krishnan, D. Sontag Association for the Advancement of Artificial Intelligence (AAAI), 2022 Paper Mitigating bias in estimating epidemic severity due to heterogeneity of epidemic on-set and data aggregation R. Krishnan, S. Cenci, L. Bourouiba Annals of Epidemiology (In Press), 2021 Paper Neural Pharmacodynamic State Space Modeling Z. Hussain*, R. Krishnan*, D. Sontag International Conference on Machine Learning (ICML), 2021 Paper Code Max-Margin learning with the Bayes factor R. Krishnan, A. Khandelwal, R. Ranganath, D. Sontag Uncertainty in Artificial Intelligence (UAI), 2018 Paper Representation Learning Approaches to Detect False Arrhythmia Alarms from ECG Dynamics E. Lehman, R. Krishnan, X. Zhao, R. Mark, L. Lehman Machine Learning for Healthcare (MLHC), 2018 Paper Variational Autoencoders for Collaborative Filtering D. Liang, R. Krishnan, M. Hoffman, T. Jebara World Wide Web Conference (WWW), 2018 Paper Code On the challenges of learning with inference networks on sparse, high-dimensional data R. Krishnan, D. Liang, M. Hoffman Artificial Intelligence and Statistics (AISTATS), 2018 Paper Code Structured Inference Networks for Nonlinear State Space Models R. Krishnan, U. Shalit, D. Sontag Association for the Advancement of Artificial Intelligence (AAAI), 2017 (Oral) Paper Code Barrier Frank-Wolfe for Marginal Inference R. Krishnan, S. Lacoste-Julien, D. Sontag Neural Information Processing Systems (NeurIPS), 2015 Paper Code",
  "content_length": 8909,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:32"
}