{
  "name": "Rahul Santhanam",
  "homepage": "https://www.cs.ox.ac.uk/people/rahul.santhanam",
  "status": "success",
  "content": "Rahul Santhanam | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyRahul SanthanamRahul Santhanam Professor Rahul Santhanam Professor of Computer ScienceTutorial Fellow, Magdalen CollegeE: rahul.santhanam@cs.ox.ac.ukT: +44 (0)1865 283519Themes:Algorithms and Complexity TheoryInterestsComputational complexity, algorithms, bounded rationality.BiographyI am a Professor of Computer Science at Oxford, and a Tutorial Fellow at Magdalen College. I obtained a PhD in Computer Science from the University of Chicago in 2005, working under the supervision of Prof. Lance Fortnow and Prof. Janos Simon. After postdoctoral stints at Simon Fraser University and the University of Toronto, I joined the University of Edinburgh as a Lecturer in Computer Science in 2008. I was promoted to Reader in 2013, and moved to Oxford in 2016. In 2013, I was awarded the ERC Consolidator Grant ALUnif on \"Algorithms and Lower Bounds: A Unified Approach\", which I held from March 2014 until August 2019.Selected PublicationsView AllManage publications Fighting Perebor: New and Improved Algorithms for Formula and QBF Satisfiability Rahul Santhanam 2010. Details about Fighting Perebor: New and Improved Algorithms for Formula and QBF Satisfiability | BibTeX data for Fighting Perebor: New and Improved Algorithms for Formula and QBF Satisfiability Infeasibility of Instance Compression and Succinct PCPs for NP Rahul Santhanam and Lance Fortnow 2008. Details about Infeasibility of Instance Compression and Succinct PCPs for NP | BibTeX data for Infeasibility of Instance Compression and Succinct PCPs for NP Circuit Lower Bounds for Merlin−Arthur Classes Rahul Santhanam 2007. Details about Circuit Lower Bounds for Merlin−Arthur Classes | BibTeX data for Circuit Lower Bounds for Merlin−Arthur Classes ActivitiesRandomised AlgorithmsFoundational Issues in Computational LearningExact Algorithms and Fine-Grained ComplexityCircuit ComplexityAlgorithms At Large Current Students Rohan AcharyaMatthew  GrayHanlin Ren Past Students Levente BodnarThomas OrtonNinad RajgopalAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2347,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:36"
}