{
  "name": "Rahul Mangharam",
  "homepage": "http://www.seas.upenn.edu/~rahulm",
  "status": "success",
  "content": "Rahul Mangharam Department of Electrical & Systems Engineering School of Engineering and Applied Science University of Pennsylvania 2023 Research Statement [PDF] 2023 Teaching Statement [PDF] Curriculum Vitae [PDF] Rahul Mangharam is a Professor in the Department of Electrical and Systems Engineering at the University of Pennsylvania. He is a founding member of the PRECISE Center and directs the Safe Autonomous Systems Lab at Penn. His research is at the intersection of formal methods, machine learning and controls for medical devices, energy efficient buildings, & autonomous systems. He is the Penn Director for Safety21 US DoT National University Transportation Center ($20MM), Director of the Autoware Center of Excellence in Autonomous Driving, Board Member in The Autoware Foundation and Leader of the F1Tenth Autonomous Racing Community. Rahul received the 2016 US Presidential Early Career Award (PECASE), the 2014 IEEE Benjamin Franklin Key Award, 2013 NSF CAREER Award, 2012 Intel Early Faculty Career Award and was selected by the National Academy of Engineering for the 2012 and 2018 US Frontiers of Engineering. Rahul's group has won several awards: 2020 2nd Best Paper Prize at ACM SIG Computer Scieicne Education , 2018 IEEE International Conference on Cyber-Physical Systems Best Paper Award, 2017 American Controls Conference Best Paper Award for Energy Systems, 2016 DoE CleanTech Prize (Regional), SRC TECHCON 2015, IPSN 2012, RTAS 2102, Intel Innovators Award 2012, World Embedded Programming Competition 2012 and 2010, Honeywell Industrial Wireless Award 2011, and Google Zeitgeist Award 2011. Rahul received his Ph.D. in Electrical & Computer Engineering from Carnegie Mellon University where he also received his MS and BS. In 2002, he was a member of technical staff in the Ultra-Wide Band Wireless Group at Intel Labs. He was an international scholar in the Wireless Systems Group at IMEC, Belgium in 2003. He has worked on ASIC chip design at FORE Systems (1999) and Gigabit Ethernet at Apple Computer Inc. (2000). He was the Stephen J. Angelo Term Chair Assistant Professor at the University of Pennsylvania from 2008-2013. He holds a secondary appointment in the Department of Computer and Information Sciences. Nov 2023: Collaboration with Penn Dental School wins Best Poster Prize at Harvard AI Symposium Oct 2023: Manghram is the Penn PI for the new $20MM Safety21 DoT National University Transportation Center with CMU. More Oct 2023: Congrats to Jiyue He for defending his PhD dissertation on \"CyberCardia: Patient-specific electrophysiological heart model for assisting left atrium arrhythmia ablation\" More Oct 2023: 31 Teams participated in the 2nd Korean F1Tenth Autonomous Racing Competition. The top prize was $40,000. More Oct 2023: The 14th F1Tenth Autonomous Racing Competion was successful at IROS'23. Two Autoware teams won the 2nd and 3rd place. More Oct 2023: Mangharam co-chairs MAD Games: Multi-Agent Dynamic Games workshop at IROS'23. More Sept 2023: The Autoware Center of Excellence has expanded to 23 international institutions all of which use Autoware AV software in their R&D. More July 2023: Mangharam gives Keynote at Artificial Intelligence of Things Summit at Croucher Advanced Study Institute, Hong Kong. More June 2023: The 13th and 14th F1Tenth Autonomous Racing Competion was successful at CPS'Week'23 and IEE Intelligent Vehicles'23. More May 2023: The AV4EV Autonomous EV Go-Kart won the First Prize in the Autonomous Karting Series in Purdue University. The project is open-source and fully-documented at https://av4ev.org May 2023: The 12th F1/10 Autonomous Racing compettion was successful at ICRA'23. More Jan 2023:Post-doc Johannes Betz joins TU Munich as Assistant Professor December 2022: Mangharm joins Board of The Autoware Foundation, a non-profit consoritum of 70+ companies that develop open-source autonomous vehicle software. More [ All News ] Individualization of atrial tachycardia models for clinical applications: Performance of fiber-independent model. J. He, A. Pertsov, J. Bullinga, R. Mangharam. IEEE Trans. on Biomedical Eng (TBME). 2023. Differentiable Safe Controller Design through Control Barrier Functions.. S. Yang, S. Chen, V. Preciado and R. Mangharam. IEEE Control Systems Letters + IEEE Conf. on Decision & Control, 2023 Fiber Organization has Little Effect on Electrical Activation Patterns during Focal Arrhythmias in the Left Atrium. J. He, A. Pertsov, E. M. Cherry, F. H. Fenton, E. H. Roney, S. A. Niederer, Z. Zang and R. Mangharam. IEEE Transactions on Biomedical Engineering (TBME). 2023. Feature Article Autonomous vehicles on the edge: A survey on autonomous vehicle racing.. J. Betz, H. Zheng, A. Liniger, U. Rosolia, P. Karle, M. Behl, V. Krovi and R. Mangharam IEEE Open Journal of Intelligent Transportation Systems, 2022. Safe Perception-Based Control under Stochastic Sensor Uncertainty using Conformal Prediction.. S. Yang, G. J. Pappas, R. Mangharam, L. Lindemann IEEE Conference on Decision & Control (CDC), 2023. Ensemble Gaussian Processes for Adaptive Autonomous Driving on Multi-friction Surfaces.. T. Nagy, A. Amine, T. X. Nghiem, U. Rosolia, Z. Zang, and R Mangharam 22nd World Congress of the Intl. Federation of Automatic Control (IFAC), 2023. You Don't Know When I Will Arrive: Unpredictable Controller Synthesis for Temporal Logic Tasks.. Y. Chen, S. Yang, R. Mangharam, X Yin 22nd World Congress of the Intl. Federation of Automatic Control (IFAC), 2023. Accelerating Online Reinforcement Learning via Supervisory Safety Systems.. B. Evans, J. Betz, H. Zheng, H. A. Engelbrecht, R. Mangharam and H. W. Jordaan Intl. Conf. on Advanced Robotics (ICAR), 2023. Towards Explainability in Modular Autonomous Vehicle Software.. H. Zheng, Z. Zang, S. Yang and R. Mangharam IEEE Intelligent Vehicles Symposium (IV), 2023. Tachycardia activation pattern predictivity of a fiber-independent left atrium model.. J. He, A. Pertsov, J. Bullinga and R. Mangharam Cardiac Physiome Society. 2023. A Benchmark Comparison of Imitation Learning-based Control Policies for Autonomous Racing.. X. Sun, M. Zhou, Z. Zhuang, S. Yang, J. Betz and R. Mangharam IEEE Intelligent Vehicles Symposium (IV), 2023. Local_INN: Implicit Map Representation and Localization with Invertible Neural Networks.. Z. Zang, H. Zheng, J. Betz, and R. Mangharam Intl. Conf. on Robotics and Automation (ICRA), 2023. MEGA-DAgger: Imitation Learning with Multiple Imperfect Experts.. X. Sun, S. Yang, and R. Mangharam Humans in Cyber-Physical Systems Workshop at CPS-IOT Week, 2023 Physics constrained motion prediction with uncertainty quantification.. N. Tumu, L. Lindemann, T. X. Nghiem and R. Mangharam IEEE Intelligent Vehicles Symposium (IV), 2023. Drive Right: Promoting Autonomous Vehicle Education Through an Integrated Simulation Platform.. Z. Qiao, X. Sun, H. Loeb, and R. Mangharam Humans in Cyber-Physical Systems Workshop at CPS-IOT Week, 2023. Drive Right: Shaping Public's Trust, Understanding, and Preference Towards Autonomous Vehicles Using a Virtual Reality Driving Simulator.. Z. Qiao, X. Sun, H. Loeb, and R. Mangharam IEEE Intelligent Vehicles Symposium (IV), 2023. Real-time atrial tachycardia ablation guidance with a left atrium model.. J. He, A. Pertsov and R. Mangharam Heart Rhythm Society. 2023. [ All Publications ]",
  "content_length": 7332,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:35"
}