{
  "name": "Raimund Dachselt",
  "homepage": "https://mt.inf.tu-dresden.de/~dachselt",
  "status": "success",
  "content": "Raimund Dachselt | Interactive Media Lab Dresden Our TeamProf. Dr.-Ing. Raimund DachseltChair of Multimedia Technology Office: APB/2049 Phone: (+49) 351 / 463 38507 Fax: (+49) 351 / 463 32827 Email: raimund.dachseltThis is a spam protection.tu-dresden.de Website: http://mt.inf.tu-dresden.de/~dachselt/ Since April 2012, Raimund Dachselt is the head of the Interactive Media Lab Dresden (Professorship of Multimedia Technology) at the Faculty of Computer Science of the Technische Universität Dresden. At the end of 2015, he was appointed director of the Institute of Software and Multimedia Technology. For students, Professor Dachselt and his team offer interesting lectures, courses, and seminars. Students can also gain insights into the exciting research work of the group, e.g., by writing their final thesis or working as a student researcher. Our research is focused on interactive data visualization beyond the desktop, interactive surfaces, multimodal human-computer interaction, physical computing, and mixed reality interfaces. Contact Biography Publications Talks Awards Activities Teaching How to get in contact with me and things that you need to know about it: Generally, you can either write me an email or call me. You can also contact me personally. Unfortunately, I receive a far too large number of emails every day, and it is not possible for me to process or even answer all of them in a satisfying way. Therefore, please consider to contact one of my staff members for the following concerns: For questions regarding teaching, my lectures, or general study problems, contact Dr. Annett Mitschick For appointments (e.g., oral examinations) contact Ramona Behling For questions regarding possible student thesis topics or detailed information about research projects directly contact the scientific staff members For short matters, please make an appointment with Ramona Behling for the weekly office hour or feel free to contact me right after a lecture personally. raimund.dachselt@tu-dresden.de +49 (0)351 463 38507 +49 (0)351 463 32827 (telefax) Visitors:Nöthnitzer Str. 46, Room APB/2048,D-01187 Dresden, Germany Prof. Dr.-Ing. Raimund DachseltFaculty of Computer Science,Professorship Multimedia Technology,Technische Universität Dresden,D-01062 Dresden, Germany https://imld.de/~dachselt/ Since April 2012, Raimund Dachselt has been a Full Professor of Computer Science and head of the Interactive Media Lab at the Technische Universität Dresden, Germany. His research interests are natural human computer interaction (HCI), interactive information visualization, and Mixed Reality interaction. He worked extensively in the area of interactive surfaces from smartwatches over tablets and tabletops to wall-sized displays (also combined in multi-display environments) and combined interaction modalities (e.g., multi-touch and pen, tangible displays, gaze-supported interaction, body gestures). He and his team made pioneering contributions to the field of interactive data visualization beyond the desktop including solutions for mobile devices, ultra-large displays, multi-device environments, Augmented Reality and other Immersive Analytics approaches. Significant contributions in the area of physical computing have recently extended the technology spectrum far beyond standard devices. Prof. Dachselt received his PhD in 2004 from TU Dresden and was professor for User Interface & Software Engineering at University of Magdeburg from 2007 to 2012. At the Faculty of Computer Science at TU Dresden he has been elected director of the Institute of Software and Multimedia Technology. From 2016-2018 he served as vice-dean, again from 2021 on. He has published more than 255 peer-reviewed publications, co-authored two major German textbooks on HCI and received seven Best Paper Awards, four Best Paper Honorable Mention Awards, and five Best Demo and Poster Awards at leading international HCI and visualization conferences. For details on publication metrics see his Google Scholar profile. Dachselt is a member of several computer societies, has co-organized 16 international workshops at ACM and IEEE conferences, and was the steering committee chair of ACM ISS until 2022. He repeatedly served as a co-chair (general, program, doctoral symposium, demo, publicity, keynote chair) and PC member for top international HCI conferences and was guest editor of several special journal issues. Between 2010 and 2013 he also served as the European coordinator of the EU-funded transatlantic exchange project LEIF with eight Canadian and European Universities. Since 2019 he is the Dresden spokesperson of the Transregional Collaborative Research Center (SFB/TR 248) Center for Perspicuous Computing (CPEC). Major Books (3)Mobile Data VisualizationLee, B.; Dachselt, R.; Isenberg, P.; Choe, E. (Eds.)346 pages.Chapman and Hall/CRC,2021.ISBN: 9780367534714.10.1201/9781003090823 BibTeX format_quote@book{MobileDataVisualization2021, editor = {Bongshin Lee and Raimund Dachselt and Petra Isenberg and Eun Kyoung Choe}, title = {Mobile Data Visualization}, year = {2021}, month = {12}, isbn = {9780367534714}, numpages = {346}, doi = {10.1201/9781003090823 }, publisher = {Chapman and Hall/CRC} }List of additional materialInteraktive Systeme: Band 2: User Interface Engineering, 3D-Interaktion, Natural User InterfacesPreim, B.; Dachselt, R.774 pages.Springer Vieweg,Apr 2015.ISBN: 978-3-642-45247-5.10.1007/978-3-642-45247-5More material loupeBibTeX format_quote@book{fixme, author = {Bernhard Preim and Raimund Dachselt}, title = {Interaktive Systeme: Band 2: User Interface Engineering, 3D-Interaktion, Natural User Interfaces}, volume = {2}, year = {2015}, month = {4}, isbn = {978-3-642-45247-5}, numpages = {774}, doi = {10.1007/978-3-642-45247-5}, url = {https://dx.doi.org/10.1007/978-3-642-45247-5}, publisher = {Springer Vieweg} }List of additional materialWWW, eBook, AmazonInteraktive Systeme - Band 1: Grundlagen, Graphical User Interfaces, InformationsvisualisierungPreim, B.; Dachselt, R.In 2. Auflage.628 pages.Springer Verlag,2010.ISBN: 978-3-642-05401-3.10.1007/978-3-642-05402-0More material loupeBibTeX format_quote@book{fixme, author = {Bernhard Preim and Raimund Dachselt}, title = {Interaktive Systeme - Band 1: Grundlagen, Graphical User Interfaces, Informationsvisualisierung}, booktitle = {2. Auflage}, year = {2010}, month = {11}, isbn = {978-3-642-05401-3}, numpages = {628}, doi = {10.1007/978-3-642-05402-0}, url = {http://doi.org/10.1007/978-3-642-05402-0}, publisher = {Springer Verlag} }List of additional materialBegleit-Webseite zum Buch Selected Top Publications (12)MARVIS: Combining Mobile Devices and Augmented Reality for Visual Data AnalysisLangner, R.; Satkowski, M.; Büschel, W.; Dachselt, R.In Proceedings of the 2021 ACM Conference on Human Factors in Computing Systems.CHI '21, Yokohama, Japan.ACM,2021.10.1145/3411764.3445593Document articleProject page linkMore material loupeBibTeX format_quote@inproceedings{langner:2021:marvis, author = {Ricardo Langner and Marc Satkowski and Wolfgang B\\\"{u}schel and Raimund Dachselt}, title = {MARVIS: Combining Mobile Devices and Augmented Reality for Visual Data Analysis}, booktitle = {Proceedings of the 2021 ACM Conference on Human Factors in Computing Systems}, year = {2021}, month = {5}, isbn = {978-1-4503-8096-6/21/05}, location = {Yokohama, Japan}, numpages = {17}, doi = {10.1145/3411764.3445593}, publisher = {ACM}, address = {New York, NY, USA}, keywords = {data visualization, mobile devices, head-mounted augmented reality, cross-device interaction, data analysis, mobile data visualization, augmented displays, immersive analytics} }List of additional materialOfficial project website, Supplemental Material, Pre-recorded talk, Full video, 30-seconds preview video, Official record in the ACM DLRapid Iron-On User Interfaces: Hands-on Fabrication of Interactive Textile PrototypesKlamka, K.; Dachselt, R.; Steimle, J.In Proceedings of the 2020 ACM Conference on Human Factors in Computing Systems.CHI '20, Honolulu, Hawaii, USA.ACM,2020.10.1145/3313831.3376220Document articleProject page linkMore material loupeBibTeX format_quote@inproceedings{Klamka2020b, author = {Konstantin Klamka and Raimund Dachselt and J\\\"{u}rgen Steimle}, title = {Rapid Iron-On User Interfaces: Hands-on Fabrication of Interactive Textile Prototypes}, booktitle = {Proceedings of the 2020 ACM Conference on Human Factors in Computing Systems}, year = {2020}, month = {4}, location = {Honolulu, Hawaii, USA}, doi = {10.1145/3313831.3376220}, publisher = {ACM} }List of additional material Video Preview, Recorded Talk, Slides, VideoDesignAR: Immersive 3D-Modeling Combining Augmented Reality with Interactive DisplaysReipschläger, P.; Dachselt, R.In Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces.ISS '19, Daejeon, Republic of Korea.ACM,page 29-42,2019.10.1145/3343055.3359718Document articleProject page linkMore material loupeBibTeX format_quote@inproceedings{Reipschlaeger2019, author = {Patrick Reipschl\\\"{a}ger and Raimund Dachselt}, title = {DesignAR: Immersive 3D-Modeling Combining Augmented Reality with Interactive Displays}, booktitle = {Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces}, series = {ISS '19}, year = {2019}, month = {11}, isbn = {978-1-4503-6891-9}, location = {Daejeon, Republic of Korea}, pages = {29--42}, numpages = {13}, doi = {10.1145/3343055.3359718}, url = { https://doi.org/10.1145/3343055.3359718}, acmid = {3359718}, publisher = {ACM}, address = {New York, NY, USA}, keywords = {Augmented Reality, Interactive Surfaces, Augmented Displays, Touch+Pen Interaction, Design, 3D Modeling} }List of additional material VideoMultiple Coordinated Views at Large Displays for Multiple Users: Empirical Findings on User Behavior, Movements, and DistancesLangner, R.; Kister, U.; Dachselt, R.In IEEE Transactions on Visualization and Computer Graphics (Volume 25, Issue 1).InfoVis '18, B",
  "content_length": 284893,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:43"
}