{
  "name": "Rainer G. Spallek",
  "homepage": "http://forschungsinfo.tu-dresden.de/detail/professur/249",
  "status": "success",
  "content": "Research Portal | TU Dresden Skip to navigation Skip to content Skip to footer English German Colored theme Black and white theme White and black theme Research Portal of the TU Dresden © PantherMedia / Viktor Cap Researchers (public profile) Florian Bieler Units Pixabay / Gerd Altmann Research output Pixabay / Gerd Altmann Projects PantherMedia / kasto Activities Dörte Gerlach Prizes Pixabay / felixioncool Facilities/Equipment Pixabay / goumbik Statistics Welcome to the TUD Research Portal The TU Dresden is a university of excellence and not only one of the strongest research universities in Germany and Europe, but also a transfer-strong university, which makes scientific findings, processes and technologies of its researchers accessible to the economy and society.The research portal offers an overview of the diverse research and transfer activities at the TU Dresden such as research projects, publications, patents and other scientific achievements and activities linked with personal profiles of the researchers and organizational units of the TU Dresden and its partners.PLEASE NOTE: The research portal was recently launched, so you may not be able to find all the information you are looking for here. Please consult the web pages of the TU Dresden, where you will find as usual extensive information about the research and transfer activities at TU Dresden. Questions or suggestions concerning the research portal? Please do not hesitate to contact us at any time at fis@tu-dresden.de. Frank Fitzekfrank.fitzek@tu-dresden.deDeutsche Telekom Chair of Communication NetworksFull ProfessorClusters of Excellence CeTI: Centre for Tactile InternetDirectorDeutsche Telekom Chair of Communication NetworksFull ProfessorClusters of Excellence CeTI: Centre for Tactile InternetDirectorDeutsche Telekom Chair of Communication NetworksFull ProfessorClusters of Excellence CeTI: Centre for Tactile InternetDirectorPerson Read more Otger Campas Rigauotger.campas@tu-dresden.depol@tu-dresden.deChair of Tissue Dynamics (PoL)Full ProfessorClusters of Excellence PoL: Physics of LifeDirectorChair of Tissue Dynamics (PoL)Full ProfessorClusters of Excellence PoL: Physics of LifeDirectorChair of Tissue Dynamics (PoL)Full ProfessorClusters of Excellence PoL: Physics of LifeDirectorPerson Read more Matthias Vojtamatthias.vojta@tu-dresden.deChair of Theoretical Solid State PhysicsFull ProfessorClusters of Excellence ct.qmat: Complexity and Topology in Quantum MatterSpokespersonChair of Theoretical Solid State PhysicsFull ProfessorClusters of Excellence ct.qmat: Complexity and Topology in Quantum MatterSpokespersonPerson Read more Latest Research output PEDANTIC: A Dataset for the Automatic Examination of Definiteness in Patent ClaimsKnappich, V., Friedrich, A., Hätty, A. & Razniewski, S., 2025, 6th Workshop on Patent Text Mining and Semantic Technologies (PatentSemTech) . Vol. 4062. p. 21-38 18 p. (CEUR Workshop Proceedings).Research output: Contribution to book/Conference proceedings/Anthology/Report › Conference contribution › Contributed › peer-reviewWohin mit Kai? Separierung und Inklusion im Design eines flexiblen Klassenraumes in der GrundschuleCzaja, T. & Beier, F., 30 Nov 2025, Transformation im schulischen Kontext: Pädagogisches Handeln zwischen Kontinuität und Wandel. Schauer, G. & Dittrich, A.-K. (eds.). Klinkhardt Verlag, p. 236-248 Research output: Contribution to book/Conference proceedings/Anthology/Report › Chapter in book/Anthology/Report › Invited › peer-reviewInformationsträger Holz: Die Methoden Dendrochronologie und AnthrakologieNeubauer, G., van der Maaten, E. & van der Maaten-Theunissen, M., 13 Nov 2025, Zinn & Sein : Eine archäoloische Spurensuche im Erzgebirge. Hemker, C. & Meißner, B. (eds.). Beier und Beran, Langenweißbach, p. 45-53 8 p.Research output: Contribution to book/Conference proceedings/Anthology/Report › Chapter in book/Anthology/Report › Contributed View all research output Latest projects View all projects Latest activities Bridging Energy Research between Dresden and Oslo : PhD Work on CO2 Adsorption and EISHashim, A. (Speaker)24 Oct 2025Activity: Talk or presentation at external institutions/events › Talk/Presentation › ContributedHydrogeology Journal (Journal)Reimann, T. (Reviewer)1 Jan 2025 → …Activity: Publication peer-review and editorial work › Editorial workGroundwater (Journal)Reimann, T. (Reviewer)1 Jan 2010 → …Activity: Publication peer-review and editorial work › Publication Peer-review View all activities Latest prizes DAAD Projektbezogener Personenaustausch mit IndienHobbie, H.Lorenz, L.Glynos, D., 2024Prize: Fellow/scholarship › MobilityE.ON StipendienfondsHobbie, H., 2018Prize: Fellow/scholarship › Individual Grants PhD/PostdocProfessor Hilbert-Publikationspreis 2023Hobbie, H., 2023Prize: Publication/Conference prize View all prizes",
  "content_length": 4839,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:46"
}