{
  "name": "Rainer Gemulla",
  "homepage": "https://www.uni-mannheim.de/dws/people/professors/prof-dr-rainer-gemulla",
  "status": "success",
  "content": "Prof. Dr. Rainer Gemulla | Universität Mannheim Skip to main navigation Skip to page content Skip to footer Chair of Practical Computer Science I: Data AnalyticsUniversität Mannheim B6, 26, Room B 016 D-68159 MannheimTel.: +49 621 181 2480 My PGP public key (id 0x81405E0B30302532) I am heading the Chair of Practical Computer Science I: Data Analytics at the University of Mannheim. The chair is part of the Data and Web Science Group.Go to: Research Interests, CV, PhD Students, Teaching, Awards, Professional Activities, Data and Software, PublicationsIf you consider applying to our lab, please read:Applications should include CV, transcripts, and a short (!) cover letter or will be ignored.We generally do not offer short interships (3 months or less). Applications for such internships will be ignored.If you are a BSc or MSc student here, have very good transcripts, and are interested in a student job with us, contact me directly. My research interests are mainly in machine learning and data processing. In particular:Machine learning with structured data (such as relational data)Machine learning with semi-structured data (such as multi-relational graphs)Combining the above with unstructured knowledge (such as text)Efficient and scalable methods and systems for data-intensive processing Paper accepted at EMNLP Findings 2023: A Benchmark for Semi-Inductive Link Prediction in Knowledge GraphsThe paper “A Benchmark for Semi-Inductive Link Prediction in Knowledge Graphs” by Adrian Kochsiek and Rainer Gemulla has been accepted at the Findings of the Association for Computational Linguistics: EMNLP 2023. Abstract: Semi-inductive link prediction (LP) in knowledge graphs (KG) is the task ...Paper accepted at CIKM 2023: Good Intentions: Adaptive Parameter Management via Intent SignalingThe paper “Good Intentions: Adaptive Parameter Management via Intent Signaling” by Alexander Renz-Wieland, Andreas Kieslinger, Robert Gericke, Rainer Gemulla, Zoi Kaoudi, and Volker Markl has been accepted at the 2023 CIKM Conference on Information and Knowledge Management. Abstract: Model ...Paper accepted in Repl4NLP 2023: Friendly Neighbors: Contextualized Sequence-to-Sequence Link PredictionThe paper “Friendly Neighbors: Contextualized Sequence-to-Sequence Link Prediction” by Adrian Kochsiek, Apoorv Saxena, Inderjeet Nair, and Rainer Gemulla has been accepted at the 2023 Repl4NLP Workshop on Representation Learning for NLP, hosted by ACL 2023. Abstract: We propose KGT5-context, a ...Paper accepted in ECML-PKDD 2022: Start Small, Think Big: On Hyperparameter Optimization for Large-Scale Knowledge Graph EmbeddingsThe paper “Start Small, Think Big: On Hyperparameter Optimization for Large-Scale Knowledge Graph Embeddings” by Adrian Kochsiek, Fritz Niesel, and Rainer Gemulla has been accepted at the 2022 ECML-PKDD European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in ... Since 2014   W3-Professor for Practical Computer Science I, Universität Mannheim, Germany2010 – 2014   Senior researcher / group leader, Max-Planck-Institut für Informatik, Saarbrücken, Germany2008 – 2010   Postdoctoral researcher, IBM Almaden Research Center, San Jose, CA, USA2004 – 2008   PhD in Computer Science, Technische Universität Dresden, Germany Samuel BroscheitSimon ForbatJulie NaegelenAdrian KochsiekDaniel RuffinelliFormer PhD students Kaustubh Beedkar, Luciano del Corro, Kiril Gashteovski, Stefan Kain, Faraz Makari Manshadi, Alexander Renz-Wieland, Christina Teflioudi, Yanjie Wang If you are interested in writing a seminar, Bachelor or Master thesis with us, please read the following guidelines.If you are within the intranet of University of Mannheim, you can access lecture videos / materials here. If not, ask me.Upcoming semester (FSS26)I will be on sabbatical leave. The course “CS 303: Praktische Informatik II” will be taught by Prof. Frederik Armknecht. The course “IE 678 Deep Learning” will be taught by Prof. Margret Keuper. We will still be offering:SM445/CS 707: Seminar, topic TDB (Bachelor/Master seminar)Data Analytics Team Project: Your Project, Your TeamColloquium (for PhD candidates)Previous semester (HWS 2025)CS 560: Large-Scale Data Management (Master Course)IE 675b: Machine Learning (Master course)SM 445/CS707: Seminar “Machine Learning at Scale”  (Bachelor/Master seminar)Data Analytics Team Project: Your Project, Your TeamColloquium (for PhD candidates)And the one before (FSS 2025)CS 303: Praktische Informatik II (Bachelor course)IE 678: Deep Learning (Master course)SM445/CS 707: Seminar “Machine Learning and Time” (Bachelor/Master seminar)Data Analytics Team Project: Your Project, Your TeamColloquium (for PhD candidates)Previous courses (not taught anymore)Hot Topics in Machine Learning (UMA, MSc, 2016–2017); pre-cursor to IE675b Machine LearningDatabase Systems II (UMA, MSc, 2015); pre-cursor to CS560 Large-Scale Data ManagementAlgorithmen und Datenstrukturen (PDF, 20 MB) (UMA, BSc, 2014)Data Mining and Matrices (PDF, 17 MB) (MPII/UMA, MSc, 2013–2018)Scalable Uncertainty Management (PDF, 10 MB) (MPII, MSc, 2012–2013)Datenbankprogrammierung (PDF, 3 MB) (TUD, Diploma, DB2 certification course, 2005–2007) Distinguished Reviewer Award at SIGMOD, 2025Distinguished PC Member Award at EDBT, 2023Outstanding Reviewer Award at NeurIPS, 2021Named Distinguished PC Member for SIGMOD, 2017Junior-Fellow of the Gesellschaft für Informatik (GI), 2013AWS in Education Research Grant Award, 2013Busy Beaver teaching award (winter term 2012/2013)for Non-Traditional Data Management (NoSQL and more)IBM's 2011 Pat Goldberg Memorial best paper award in CS, EE and Math(for “Large-Scale Matrix Factorization with Distributed Stochastic Gradient Descent” with P. J. Haas, E. Nijkamp, and Y. Sismanis; KDD 2011)Best paper of NIPS 2011 Biglearn workshop(for “Large-Scale Matrix Factorization with Distributed Stochastic Gradient Descent” with P. J. Haas, Y. Sismanis, C. Teflioudi, and F. Makari)Google Focused Research Award 2011: Robust and Scalable Fact Discovery from Web Sources(with G. Weikum and M. Theobald)Research Highlight in Communications of the ACM(for “Distinct-Value Synopses for Multiset Operations” with K. Beyer, P.J. Haas, B. Reinwald, Y. Sismanis)The VLDB Journal, Special Issue: Best Papers of VLDB 2006(for “A Dip in the Reservoir: Maintaining Sample Synopses of Evolving Datasets” with W. Lehner and P.J. Haas) AdministrationHead of examination board: MSc Business Informatics (since 2017)Member of examination board: BSc Business Informatics (since 2017 or earlier), Mannheim Master in Data Science (since 2017)Member of selection commitee: BSc and MSc Business Informatics (since 2017 or earlier), Mannheim Master in Data Science (since 2024)Information officer of the WIM faculty: since 2022Embassador of the German Informatics Society (GI): since 2017CIO of University of Mannheim: 2022–2024Study dean of the WIM faculty: 2016–2019Member of the selection committee: Max Planck International Research School (2010–2014)OrganizerChair of study program at BTW23 and BTW25 conferencesLWDA 2018 conferenceGI Dagstuhl seminar: Informatik@Schule 2016 – Das Verhältnis von informatischer Bildung und “Digitaler Bildung” (2016)GI Dagstuhl seminar: Informatik@Schule – Agenda für informatische Bildung in der Schule (2014)Member of organizing board and head of jury of BTW11's demonstration programYoung academicsOne-day workshop “Machine Learning Systems” at Jugendforum BW 2024Mentor of Junior Professors: Roland Leißa (2021–2025), Margret Keuper (2017–2021), Goran Glavaš (2017–2021)Mentor in the mentoring program of the German Informatics Society (GI, since 2020)Member of task committee and final-round jury of BWINF (since 2010)Member of the board of BWINF (2014–2022)Associate editor / area chairIJCAI: 2025VLDB: 2021, 2019, 2015TKDE: 2015–2018DASP: 2018EDBT: 2017JISA: 2016CIKM: 2014PC member / reviewer (since 2011)2026: EDBT, SIGMOD, VLDB2025: DEEM@SIGMOD, EDBT, ICLR, ICML, LLM+Graph@VLDB,NeurIPS, SIGMOD, STACS, TMLR, VLDB2024: ARR, DAMI, DEEM, ICLR, IJCAI, LLM+KG, NeurIPS, SIGMOD, TMLR, VLDBJ2023: ARR, Artificial Intelligence, BTW, DEEM, EDBT, ICLR, IJCAI, Neural Networks, Repl4NLP, SIGMOD, TMLR, VLDB, VLDBJ2022: Artificial Intelligence, DEEM, EDBT, ICLR, IJCAI, KDML, Machine Learning, Pattern Recognition, SDM, SIGMOD, VLDBJ2021: DEEM, EDBT, ICDM, IJCAI, KDML, NeurIPS, SIGMOD (demo), Repl4NLP2020: AKBC, EDBT, IJCAI, LWDA, Repl4NLP, SUM, TPDS2019: AKBC, BTW, DEEM, IJCAI, INFORMATIK, LWDA, SUM2018: VLDB, EDBT, DEEM2017: SIGMOD, BTW, DEEM, TALG, VLDB, ECML-PKDD2016: SIGMOD, ECML-PKDD2015: BTW, DAMI, GvDB, IS, JODS, JWS, PODS2014: BDDC, BigData, Buda, DMC, JMLR, SIGMOD, VLDB2013: AKBC, BigData, BTW, CIKM, DMC, ICALP, TKDE, TML, VLDB2012: KDD, JMLR, TODS2011: BTW, IS, VLDB, VLDBJ GraSH: Multi-fidelity HPO for graph learningDistKGE: A knowledge graph embedding library for multi-GPU and multi-machine trainingAdaPM: A fully adaptive parameter managerLibKGE: A knowledge graph embedding libraryLapse: A parameter server with dynamic parameter allocationOPIEC: An open information extraction corpusMinIE: Open information extractor (spiritual successor to ClausIE)DSGDpp: Various parallel algorithms for matrix factorization (including DSGD++)DESQ: Frequent sequence mining with subsequence constraintsRounding rank: algorithms for computing rounding-rank decompositionsCORE: Context-aware open relation extraction with factorization machinesFINET: Context-aware fine-grained named entity typingWerdy: Recognition and Disambiguation of Verbs and Verb Phrases with Syntactic and Semantic PruningClausIE: Clause-Based Open Information ExtractionLEMP: Fast Retrieval of Large Entries in a Matrix ProductLASH: Large-Scale Sequence Mining with HierarchiesMG-FSM: Large-Scale Frequent Sequence Mining See also Google Scholar and DBLP. 2023   A. Kochsiek, R. GemullaA Benchmark for Semi-Inductive Link Prediction in Knowledge Graphs [pdf, resources]In EMNLP Findings, 2023 A. Kochsiek, A. ",
  "content_length": 21641,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:45"
}