{
  "name": "Rainer Koschke",
  "homepage": "http://www.informatik.uni-bremen.de/~koschke",
  "status": "success",
  "content": "Rainer Koschke Home Sitemap Contact Group Research Teaching Publications Service Contact Minds, Media, Machines --------------- Home Prof. Dr. rer.nat. Rainer Koschke Fon:Secr.:Email: +49 (421) 218-64481+49 (421) 218-64480 koschke _at_ uni-bremen.de Postal Address: Arbeitsgruppe Softwaretechnik Universität Bremen FB03 Postfach 33 04 40 28334 Bremen Visitor Address: Arbeitsgruppe Softwaretechnik TZI / Universität Bremen FB03 MZH, Room 3070 (3rd floor) Bibliotheksstraße 1 28359 Bremen News My co-author Thilo Mende and I have received the Most Influential Paper Award at the IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER) 2020 for our contribution \"Effort-Aware Defect Prediction Models\", 14th European Conference on Software Maintenance and Reengineering, 2010, pp. 107-116. doi: 10.1109/CSMR.2010.18 [all awards]. Committees and Activities My current list of activities [past]: Vertrauensdozent for University of Bremen for Gesellschaft für Informatik (GI) Steering Committee Member for Embedded Software Engineering Kongress Steering Committee Member for International Workshop on Software Clones (IWSC) Member of the Scientific Committee for International Summer School on Software Engineering in Salerno/Italy. Member of the Editorial Board of Journal of Software Maintenance and Evolution. Member of the Editorial Board of Journal Science of Computer Programming. Member of Technologie-Zentrum Informatik und Informationstechnik I am regularly reviewing research proposals for the Deutsche Forschungsgemeinschaft (DFG), National Sciences and Engineering Research Council of Canada (NSERC), Swiss National Science Foundation (SNSF), Council of Physical Sciences of the Netherlands Organisation for Scientific Research (NOW), Israel Science Foundation (ISF), Österreichische Akademie der Wissenschaften, Agency for Science, Technology and Research of Singapore. Awards Received The list of awards I received can be found here. Conference Program Committees I was PC member in the following conferences: ICSE, FSE, ICSME, MSR, SANER, WCRE, ICPC, SCAM, CSMR, Models, PROMISE, FASE, WICSA, ICSR and many others [full list]. Journal Reviews I am reviewer for the following journals: ACM Transactions on Software Engineering and Methodology ACM Computing Surveys IEEE Transactions on Software Engineering Journal Automated Software Engineering Journal Empirical Software Engineering Journal on Software Maintenance and Evolution Journal Science of Computer Programming Journal Systems and Software Journal Software Practice and Experience Journal Information and Software Technology Software Quality Journal Zeitschrift Informatik Forschung und Entwicklung Journal Information Processing Letter About Rainer Koschke Rainer Koschke is a full professor for software engineering at the University of Bremen in Germany and heading the software engineering group. His research interests are primarily in the fields of software engineering, program analyses, and software visualization. His current research includes program analyses, clone detection, visualization in VR and AR, reverse engineering, architecture recovery, feature location, and security. He is one of the founders of Axivion GmbH (founded in 2006) providing solutions for stopping software erosion. He received a doctoral degree in computer science at the University of Stuttgart, Germany in 1999. SEITENANFANG GroupResearchTeachingPublicationsServiceContactStaffAlumniAbout UsBereicheProjectsPartnersDiplomarbeitenTeaching MaterialBooksJournalsConferencesWorkshopsJobsLinksInternalAddressAnfahrtImpressum",
  "content_length": 3610,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:46"
}