{
  "name": "Rainer Dietmann",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/rainer-dietmann",
  "status": "success",
  "content": "Rainer Dietmann - Royal Holloway Research Portal Rainer Dietmann Professor Professor in Mathematics, Department of MathematicsNumber Theory Phone+44 1784 276582EmailRainer.Dietmannrhul.acuk TW20 0EX Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 42 Article 2 Other contribution 1 Chapter 1 Conference contribution 1 More 1 Working paper Research output per year Research output per year Discriminants of fields generated by polynomials of given heightDietmann, R., Ostafe, A. & Shparlinski, I. E., Apr 2024, In: Israel Journal of Mathematics. 260, 1, p. 73-103 31 p.Research output: Contribution to journal › Article › peer-review Open Access Towards van der Waerden's conjectureChow, S. & Dietmann, R., 24 Jan 2023, (E-pub ahead of print) In: Transactions of the American Mathematical Society. 376, p. 2739-2785 47 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 274 Downloads (Pure) Longer gaps between values of binary quadratic formsDietmann, R., Elsholtz, C., Kalmynin, A., Konyagin, S. & Maynard, J., 30 May 2022, (E-pub ahead of print) In: International Mathematics Research Notices. 37 p., rnac130.Research output: Contribution to journal › Article › peer-review File 86 Downloads (Pure) Enumerative Galois theory for cubics and quarticsChow, S. & Dietmann, R., 7 Oct 2020, In: Advances in Mathematics. 372, p. 1-37 37 p., 107282.Research output: Contribution to journal › Article › peer-review Open Access 3 Downloads (Pure) Rational lines on cubic hypersurfacesBrandes, J. & Dietmann, R., 24 Apr 2020, (E-pub ahead of print) In: Mathematical Proceedings of the Cambridge Philosophical Society. p. 1-14 14 p.Research output: Contribution to journal › Article › peer-review Open Access 15 Downloads (Pure) View all 47 research outputs Projects 2 Finished Projects per year Forms in many variablesDietmann, R. (PI)Eng & Phys Sci Res Council EPSRC1/03/11 → 31/08/12Project: Research Joint meeting of the Korean and American Mathematical SocietyDietmann, R. (PI)Royal Society14/12/09 → 13/01/10Project: Research",
  "content_length": 2384,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:44"
}