{
  "name": "Rainer Groh 0001",
  "homepage": "https://tu-dresden.de/ing/informatik/smt/mg/die-professur/mitarbeiter/prof-dr-ing-habil-rainer-groh",
  "status": "success",
  "content": "Prof. Dr.-Ing. habil. Rainer Groh — Professur für Mediengestaltung — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Professur für Mediengestaltung Lehrstuhlinhaber Name Prof. Dr.-Ing. habil. Rainer Groh E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 2065 Nöthnitzer Str. 46 01187 Dresden work Tel. fax Fax +49 351 463-39261 Sprechzeiten: nach Vereinbarung Forschungsschwerpunkt / Technische Visualistik Der Rechner ist Medium einer umfassenden technischen Revolution und Katalysator eines kulturellen Paradigmenwechsels. Bislang unvorstellbare Möglichkeiten des Kommunizierens, Produzierens und Entwerfens eröffnen sich. Wenn auch aus zeitgenössischer Sicht die Tragweite und eigentliche Effizienz von technischen Innovationen sich immer nur abschätzen läßt, so wird doch mit Blick auf das gestalterische und künstlerische Schaffen eines deutlich: Mit dem Computer kommt eine lange Epoche des bildnerischen Gestaltens, die im 15. Jahrhundert ihren Ausgang nahm, sich als Renaissancekunst manifestierte und in ihren gestalterischen Grundmustern bis heute relativ konstant blieb, zu einem entscheidenden Punkt. Mit dem heutigen Stand der Informationsverarbeitung wird die Bildtechnik der Renaissance im doppelten Sinn vollendet: Es wird ein Wendepunkt der Möglichkeiten und auch ein Zustand der Perfektion markiert. Der eben benannte Wendepunkt ist zusätzlich durch einen technischen Aspekt charakterisiert, der Fragen nach der Visualisierung von rechnergestützten Prozessen mit hoher Aktualität hervorbringt: Die Prozessorleistungen gestatten heute auf einem Personal Computer sowohl die Ver- und Bearbeitung als auch die Wiedergabe sämtlicher Bildmedien in Echtzeit. Quasi erstmals in Geschichte ‘treffen’ sich die Medien tatsächlich; sie stehen zur kompositorischen Arbeit bereit. Während die praktische Nutzung und die Entwicklung der Werkzeuge voranschreitet, wird der Mangel an theoretischen Fundamenten evident, welche die Arbeit mit nunmehr allen Medien absichern. Wie kann Ordnung in der Bilderwelt entstehen im ”Gegensatz zur tosenden, torkelnden Flut der technischen Bilder, die die Zauberlehrlinge der aktuellen Medien auf uns niederströmen lassen“? (NAKE, FRIEDER 1993: Algorithmus und Kunst.) Vita 2004 Habilitation, Otto-von-Guericke-Universität Magdeburg, Fakultät für Informatik seit 2003 Professur für Mediengestaltung an der TU Dresden, Fakultät Informatik 1994-2003 Professur für Entwurf und Produktgestaltung (C3) an der Hochschule für Technik und Wirtschaft Dresden (FH); Aufbau des Fachbereichs Gestaltung 1994 Forschungssemester am Royal College of Art in London im Fachgebiet Computer Related Design seit 1992 Gestaltung des Erzeugnisprogramms der Leitz Messtechnik GmbH Wetzlar (Hexagon Metrology) 1989-1994 wissenschaftlich-künstlerischer Mitarbeiter des Fachgebietes Industrial Design an der Hochschule für Kunst und Design 1989 Promotion an der TH Ilmenau 1981-1989 wissenschaftlich-künstlerischer Mitarbeiter bei Prof. Dr. H. Oehlke an der Hochschule für Kunst und Design, Sektion Designwissenschaften 1981-1984 postgraduales Studium Industrial Design an der Burg Giebichenstein, Hochschule für Kunst und Design in Halle 1975-1979 Studium an der Technischen Hochschule Ilmenau (heute: TU Ilmenau), Sektion Gerätetechnik Publikationen 270 Einträge 2025 Bridging Communication Gaps: Conceptual Enhancements for Video Conferencing with Autistic Users.Walther, J., Schmalfuß-Schwarz, J., Gollasch, D., Engel, C. & Weber, G., 2025, Universal Access in Human-Computer Interaction: 19th International Conference, UAHCI 2025, Held as Part of the 27th HCI International Conference, HCII 2025, Gothenburg, Sweden, June 22–27, 2025, Proceedings, Part I. Antona, M. & Stephanidis, C. (Hrsg.).S. 169-189, 21 S.Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Sonic Scribbles – Constructing Sketch Classes from Visual Associations of the Mental Model for AudioEngeln, L. & Groh, R., 2025, Proceedings of the 20th International Audio Mostly Conference, AM 2025Publikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband 2024 Understanding Visitor Behavior in Museums: A Case Study on the Potential of Interactive Museum InstallationsKielb, M., Hannß, F. & Groh, R., 3 Juni 2024, AVI '24: Proceedings of the 2024 International Conference on Advanced Visual Interfaces. 3 S., 69Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband 2022 Stretching Projection - Projection-Based Visual Control and Support for Sports ExercisesFranke, I. S., Elze, A. & McGinity, M., 4 Sept. 2022, MuC '22: Proceedings of Mensch und Computer 2022. Muhlhauser, M., Reuter, C., Pfleging, B., Kosch, T., Matviienko, A., Gerling, K., Mayer, S., Heuten, W. & Doring, T. (Hrsg.). Association for Computing Machinery, S. 452-456, 5 S.Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Bringing Digital Exhibitions to Life: Simplify User Guidance through the Concept of Aura and white planeHannß, F., Kielb, M. & Groh, R., 6 Juni 2022, Proceedings of the 2022 International Conference on Advanced Visual Interfaces. Bottoni, P. & Panizzi, E. (Hrsg.).16Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Exploring Sketch-based Sound Associations for SonificationEngeln, L. & Keck, M., Juni 2022, AVI 2022 Workshop on Audio-Visual Analytics (WAVA22)Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Sparkle Glyphs: A Glyph Design for the Analysis of Temporal Multivariate Audio FeaturesKeck, M. & Engeln, L., Juni 2022, AVI 2022: Proceedings of the 2022 International Conference on Advanced Visual InterfacesPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Creative Sound Modeling with Signed Distance FieldsMende, T., Engeln, L., McGinity, M. & Groh, R., 2022, Mensch und Computer 2022 - Workshopband. Bonn: Gesellschaft für Informatik e.V.Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband GranularSpectrals - Spectral manipulation for Advanced Granular SynthesisTöpfer, F., Engeln, L. & Groh, R., 2022, Mensch und Computer 2022 - Workshopband. Bonn: Gesellschaft für Informatik e.V.Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Konferenzband Mehr als Effekthascherei: Kompetenzerwerb in der Immobilienwirtschaft mittels Virtual Reality.Dyrna, J., Diab, M., Bohn, T., Liebscher, M., Herchet, M. & Brade, M., 2022, Wettbewerbsband AVRiL 2022. Söbke, H. & Zender, R. (Hrsg.). Bonn: Gesellschaft für Informatik e.V., S. 23-31, 9 S.Elektronische (Volltext-)VersionPublikation: Beitrag in Buch/Konferenzbericht/Sammelband/Gutachten > Beitrag in Buch/Sammelband/Gutachten Seite 1, aktuell ausgewählt 1 2 3 4 5 6 7 8 9 10 27 weiter Diese Informationen werden durch das FIS bereitgestellt. Zu dieser Seite Mandy Keck Letzte Änderung: 17.03.2023 Diese Seite … … auf Facebook teilen … auf Twitter/X teilen … drucken … als E-Mail versenden",
  "content_length": 7511,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:44"
}