{
  "name": "Raissa M. D'Souza",
  "homepage": "http://mae.engr.ucdavis.edu/dsouza",
  "status": "success",
  "content": "Raissa D'Souza homepage Raissa M. D'SouzaAssociate Dean of Research & Professor College of Engineering University of California, Davis Department of Computer Science Department of Mechanical and Aerospace Engineering Graduate Group in Applied Math Graduate Group in Physics Complexity Sciences Center Member, Board of Reviewing Editors, Science Founding Lead Editor, Physical Review Research Fellow, American Association for the Advancement of Science, class of 2024. Fellow, American Physical Society, class of 2016. Fellow, Network Science Society, class of 2019. 2015-18 President, The Network Science Society External Professor, Santa Fe Institute External Professor, Complexity Sciences Hub Vienna Editorial Board, Internet MathematicsEditorial Board, IEEE Trans. Network Science & Eng. (2014-2020) Associate Editor, Journal of Complex Networks (2013-2017) Editorial Board, Scientific Reports (2012-2014) Advisory Board, Quanta Magazine (2018-2020) July 1, 2015 office: 1042 Kemper Hall email: rmdsouza at ucdavis.edu (Curriculum Vitae, May 2025) (Google Scholar) Research interests: Complex networks, percolation, cascades, interdependent complex systems Bio | Pubs | Team | Videos | Grants | Teaching | ECS/MAE 253 | Fun News: • Perspective: Control of complex networks with complex nodes new in Nature Reviews Physics, April 2023. Statistical physics meets control theory. • New in Chaos, April 2022: Sandpile cascades on oscillator networks: The BTW model meets Kuramoto • Lead author, Guga Mikaberidze. • New in Phys Rev Research: Decoupled synchronized states in networks of linearly coupled limit cycle oscillators • Lead author, Anastasiya Salova, is on the postdoc job market! • New in Nature Comm: \"Mutualistic networks emerging from adaptive niche-based interactions\", published Oct 2020. • New in Phys Rev Letter: \"Homophily can impede strutural balance\", published Aug 2020. • Using the multiplex degree sequence as a probability distribution, JCN, April 2020. • \"Susceptible individuals drive active social contagion\", published in PRR, Nov 2019. • \"Competitive percolation strategies for network recovery\", published in Sci. Rep., Aug 2019. • \"Koopman operator and its approximations for systems with symmetries\", published in Chaos, Sep. 2019. • Our 100 page review article: Explosive Phenomena in Complex Networks (full pdf here) is published in Advances in Physics, Aug 2019. Thanks to co-authors Jan Nagler, Jesus Gomez-Gardenes, and Alex Arenas. • Raissa appointed Lead Editor, Physical Review Research, June 2019. • Raissa receives inaugural Euler Award and is elected Fellow of the Network Science Society - UC Davis Press release • New article in Science, March 8 2019: - Exotic states in a simple network of nanoelectromechanical oscillators. - UC Davis Press release - Santa Fe Institute Press release - Quanta Magazine feature April 4 2019. - Wired Magazine, April 7 2019. • Group member Marton Posfai wins the 2019 UC Davis Award for Excellence in Postdoctoral Research • Nov 2018, our paper from FSE 2008, wins the ESEC/FSE 2018 Test of Time award! • Two new papers, Aug 2018: - Self-organization of Dragon King failures, (arxiv). - Talent and experience shape competitive social hierarchies, (arxiv). • Recent Perspective piece in Nov 17, 2017 issue of Science, \"Curtailing cascading failures\". • UC Davis recruitment in Network Theory. (Stay tuned for more news.) . This is part of a broader initiative including Computational Neuroscience, and Data Science! • Raissa is awarded the 2017 College of Engineering, Outstanding Mid-Career Faculty Research Award. • Raissa is elected Fellow of the American Physical Society, Class of 2016. • Attend Mx16, May 20-22, 2016, our interdisciplinary symposium on multi-dimensional networks! • Our review article on Explosive Percolation, Nature Physics, 11(7), 2015. • \"The New Laws of Explosive Networks\" Quanta Magazine, July 14, 2015 & Wired Magazine, Aug 1, 2015. • SFI hosts our MURI working group on control of interdependent networks, June 23-26, 2015. • Inside Science article on our recent work in opinion dynamics with Zealots (Feb, 2015). • Our special issue: \"The Digital Age and the Future of Social Network Science and Engineering\", Proc. IEEE 102 (12) 2014. • Our paper on Targeted Control appears in Nature Communications (Nov 12, 2014) • Read our newest article in PRL on microtransitions and early warning signs for percolation (Apr 18, 2014). • Attend NetSci 2014. I am the General Chair. (Registration information) • PhD Candidate, Charlie Brummitt, wins J. S. McDonnell Postdoctoral Fellowship in Studying Complex Systems, 2014-2016! • Raissa joins the World Economic Forum's Global Agenda Council on Complex Systems. • Our MURI proposal is selected for funding! $6.25million over the next five years. Predicting and Controlling Systems of Interdependent Networks: Exploiting Interdependence for Control UC Davis Press Article • Our new article in PRL (Aug 12, 2013) is chosen as Editor's Suggestion. See the accompanying Viewpoint, \"Getting out of control\", by N. A. M. Araujo. Recent Press: \"The Math of How Crickets, Starlings, and Neurons Sync Up\", Wired Magazine, April 7 2019. \"Scientists Discover Exotic New Patterns of Synchronization\" Quanta Magazine, April 4 2019. \"Exotic states\" California Aggie, April 4 2019. \"The New Laws of Explosive Networks\" Quanta Magazine, July 14, 2014 & Wired Magazine, Aug 1, 2015. \"Zealots Help Sway Popular Opinions\" Inside Science, Feb. 19, 2015. \"The Mathematics of Averting the Next Big Network Failure\", Wired Magazine/Simmons Science News, Mar. 19, 2013. \"When Networks Network\", Science News, Sept 22, 2012. \"Embracing complexity\", FQXi, Nov 6, 2012. Selected publications: (Full publication list) C. D. Brummitt, P. D. H. Hines, I. Dobson, C. Moore, R. M. D'Souza, Transdisciplinary electric power grid science PNAS, (Opinion piece), July 23, 2013. Supplemental Information, including figures and background. C. D. Brummitt, R. M. D'Souza and E. A. Leicht, \"Suppressing casades of load in interdependent networks\" PNAS, Feb 21 2012. Executive summary: 2-page \"Author Summary\" (pdf) Press articles: Computerworld Slashdot UCD College of Engineering News ilsussidiario Wei Chen, Z. Zheng and R. M. D'Souza, \"Deriving an underlying mechanism for discontinuous percolation\", Europhysics Letters, 100 (6), 66006, 2012. W. Chen and R. M. D'Souza, \"Explosive percolation with multiple giant components\", Physical Review Letters, 106, 115701, 2011. (pdf) D. Achlioptas, R. M. D'Souza and J. Spencer, \"Explosive Percolation in Random Networks\", Science, 323 (5920) 1453-1455, 2009. Accompanying Perspective: T. Bohman, \"Emergence of Connectivity in Networks\", Science, 323 (5920) 1438-1439, 2009. Press articles: Eurekalert Press Release New Scientist Article V. Filkov, et. al. \"Modeling and verifying a broad array of network properties\" Europhysics Letters, 86, 28003, 2009. R. M. D'Souza, C. Borgs, J. T. Chayes, N. Berger, and R. Kleinberg, \"Emergence of Tempered Preferential Attachment From Optimization\", PNAS, 104, (15), 6112-6117, 2007, (Cover Story) . Press articles: UCDavis press releaseLa Recherche R. M. D'Souza, \"Coexisting phases and lattice dependence of a cellular automata model for traffic flow\", Physical Review E, 71, 066112, 2005. ( Movie of the elusive intermediate phases). Professional history: 7/2014 onwards, Professor, UC Davis. 2007 - present, External Professor, Santa Fe Institute. 7/2008 - 6/2014, Associate Professor, UC Davis. 2005 - 6/2008, Assistant Professor, UC Davis. Joined GGCS 2005, GGAM 2007. 2002-2005, Postdoctoral Fellow, Microsoft Research: Theory Group. 1999-2002, Postdoctoral Fellow, Bell Labs: Math Center and Theoretical Physics Groups 1999, PhD in Statistical Physics, MIT, for work done jointly in the Lab for Computer Science. Recent honors: Kavli Fellow, National Academy of Sciences USA: 2006, 2007, 2008, 2011. Teaching: Winter 2017 : ECS 20, Discrete Math Spring 2016 : Networks course: ECS253 / MAE 253, Network Theory and Applications Winter 2016 : ENG 105, Thermodynamics Winter 2015 : ECS 15, Introduction to Computers Spring 2014 : Networks course: ECS289 / MAE 298, Network Theory and Applications Winter 2014 : MAE 216, Advanced Thermodynamics Winter 2013 : ECS 15, Introduction to Computers Spring 2012 : MAE 216, Advanced Thermodynamics Fall 2011 : ENG 105, Thermodynamics Fall 2011 : ENG 105, Thermodynamics Winter 2011 : Networks course: ECS289 / MAE 298, Network Theory and Applications Fall 2010 : ECS 20, Discrete Math Fall 2010 : ENG 105, Thermodynamics Spring 2009 : Advanced topics in network theory Fall 2008 : ENG 105, Thermodynamics Fall 2007 : Networks course: NSF VIGRE Research Focus Group on Probability. Spring 2008 : MAE 298, \"Network Theory and Applications\", (2007 version) and (2006 version) Fall 2006. Winter 2006. Spring 2008. ENG 102, \"Dynamics\" Winter 2007 : ENG 105, \"Thermodynamics\" Mathematics Illuminated, (Episodes 7 and 11). Series produced by Annenberg Foundation and Oregon Public Broadcasting. Resources for Summer Internships (a little outdated) Workshop organization: Organizing/Program Cmmts: (I no longer update this since 2016, since I am involved in too many to chronical.) Steering Committee, NetSci-X, 2016, Wroclaw Poland, Jan 11-13, 2016. General Chair, NetSci 2014, June 2-6, 2014. Program Committee, NetSci 2013, June 3-7, 2013. TPC, NetSciCom 2013, April, 2013. Organizer, Graduate Group in Applied Math Mini-conference, UC Davis, Jan 26, 2013. Scientific Steering Committee, Networks Of Networks: Systemic Risk and Infrastructural Interdependencies, Satellite of NetSci 2012, Northwestern University, June 19, 2012. Power Grids as Complex Networks: Formulating problems for useful science and science based engineering, Santa Fe Institute, May 17-19, 2012 TPC, 9th Workshop on Algorithms and Models for the Web Graph (WAW'12). TPC, 6th International Workshop on Self-Organizing Systems (IWSOS 2012), March 15-16, 2012, Delft, The Netherlands. Dynam",
  "content_length": 17772,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:47"
}