{
  "name": "Raiyan Abdul Baten",
  "homepage": "https://www.raiyan-ab.com",
  "status": "success",
  "content": "Raiyan Abdul BatenSearch this siteEmbedded FilesSkip to main contentSkip to navigationRaiyan Abdul BatenI am an Assistant Professor of Computer Science and Engineering at the University of South Florida. I build technology for soft-skills development, particularly for the social development of soft skills. I direct the Computational Social Science and AI Lab at USF.Research Areas: Computational Social Science, Human-Computer Interaction, Network Science, Affective Computing, Data ScienceResearch Interests: Soft skills development, Collective performance in human ensembles, Misinformation in online networksAddress: 4202 E Fowler Avenue, ENG 116, Tampa, FL-33620Email: rbaten@usf.eduNews[September 2025] New preprint out: Beginner’s Charm: Beginner-Heavy Teams Are Associated With High Scientific Disruption.[August 2025] Our paper, MuseScorer: Idea Originality At Scale, just got accepted at the main conference of EMNLP 2025! [May 2025] Our paper, The innovation trade-off: How following superstars shapes academic novelty, just got accepted at Nature Humanities and Social Sciences Communications![May 2025] New preprint out: MuseRAG: Idea Originality Scoring At Scale. We show how judge LLMs are great at scoring people's idea originality.[April 2025] Our paper, Exploring the Role of Randomization on Belief Rigidity in Online Social Networks, just got accepted for a poster presentation at The International Conference for Computational Social Science (IC2S2), 2025. [April 2025] Our paper, The Wisdom of Intellectually Humble Networks, just got accepted at CogSci 2025, the premier cognitive science conference. [Feb 2025] New preprint out: The Wisdom of Intellectually Humble Networks. We explore the social dynamics of intellectual humility using theoretical modeling and simulation.[Oct 2024] New preprint out: AI Can Enhance Creativity. We show in this paper that the creative qualities of people's ideas systematically depend on contextual factors, and AI can nudge those factors to improve idea generation performance.[Sept 2024] I participated in a roundtable on “AI Augmentation: Empowering or Enslaving Humanity?” at the Global AI Summit 2024, Riyadh, Saudi Arabia. The summit was organized by the Saudi Data & AI Authority.[Aug 2024] The Journal of Big Data (IF 8.6, Springer Nature Publishers) has accepted our paper, “Context-aware prediction of active and passive user engagement: Evidence from a large online social platform.” The paper shows that context-aware modeling approaches may offer a holistic yet lightweight and potentially privacy-preserving representation of user engagement on online social platforms. The work was conducted with Snapchat, Columbia Business School, and CMU.[Sept 2023] I won the Outstanding Ph.D. Dissertation Award from the Association for the Advancement in Affective Computing (AAAC), the top professional association for researchers in Affective Computing. Grateful and happy!Older news[Mar 2023] Finally out of the job market! I will join the Department of Computer Science and Engineering at the University of South Florida as a tenure-track assistant professor in Fall'23. [Jan 2023] I am officially a Winter Warrior now! :D I finished Rochester's Winter Warrior Half Marathon today in 2 hours and 45 minutes. My second half-marathon! :D[Dec 2022] I served as a panelist in the Navigating the Mentoring Relationship workshop, organized by the Warner School of Education at the University of Rochester. Mentorship is an under-discussed aspect of academia, and I think these kinds of conversations should be held more widely.[Nov 2022] Our paper \"Novel idea generation in social networks is optimized by exposure to a \"Goldilocks\" level of idea-variability\" just got accepted at PNAS Nexus![Sep 2022] I delivered two guest lectures on quantitative analysis methods in the HCI course at URCS (slides: part 1 and part 2).[Aug 2022] I defended my Ph.D. thesis. Trust me, I'm a doctor![Jul 2022] Our paper \"Predicting Future Location Categories of Users in a Large Social Platform\" just got accepted at ICWSM'23. This work was done as part of my internship with the Computational Social Science group at Snap Inc.[Feb 2022] I served as a judge in the Creative Collision Challenge, organized by the Ain Center for Entrepreneurship at the University of Rochester.[Jun 2021] ResearchGate has covered me in their Researcher Stories series. They have focused on my work and personal journey. Thanks to the RG team for the story![May 2021]  Our paper \"Cues to gender and racial identity reduce creativity in diverse social networks\" got accepted at Scientific Reports! This is my pandemic work and I'm super excited![Feb 2021] Our paper \"Technology-driven alteration of nonverbal cues and its effects on negotiation\" got accepted by the Negotiation Journal. It is a special edition journal by the Harvard Law School.[Nov 2020] Worked as a student volunteer at NeurIPS'20.[Sep 2020] Our paper \"Creativity in Temporal Social Networks: How Divergent Thinking is Impacted by One’s Choice of Peers\" got accepted by the Journal of the Royal Society Interface. Yay![Aug 2020]  I got accepted for the Doctoral Consortium at the International Conference on Computational Creativity (ICCC), 2020![Oct 2019] Represented Hajim College of Engineering and talked about the work we do at the ROC-HCI Lab at the inauguration ceremony of Sarah Mangelsdorf, the 11th president of the University of Rochester.[Sep 2019]  Presented my paper, \"Upskilling together: How peer-interaction influences speaking-skills development online\", at ACII'19! I was also a co-author in a second paper, \"LIWC into the eyes: Using facial features to contextualize linguistic analysis in multimodal communication\". Visiting Cambridge, UK, was a fascinating experience.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5856,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:46"
}