{
  "name": "Raj S. Acharya",
  "homepage": "http://www.cse.psu.edu/~rua1",
  "status": "success",
  "content": "- no title specifiedRAJ ACHARYA Professor & Director School of Electrical Engineering & Computer ScienceFellow: IEEE, ACEMB PhD:  University of Minnesota/Mayo Grad School of Medicine Raj Acharya is Director, School of Electrical Engineering and Computer Science (containing the Departments of Electrical Engineering and Computer Science & Engineering respectively). Prior to this,  he has been Head at Penn State for 14 years. He holds an appointment at Penn State ARL for conducting classified research. He was a Research Scientist at General Electric (Thomson) CSF Laboratory, Paris, France.  He has been a Research Fellow at various NASA and DoD labs. He is on the board of Videomining and Technology Collaborative (a technology-based economic development organization). His main research focus is in the areas of Big Data Mining, Network Sciences & Engineering, and Genomics. The systems he has developed are routinely used in industry and academia. He is Associate Editor of IEEE/ACM Transactions on Computational Biology and Bioinformatics. He is Founding Chair of IAPR Technical Committee on Pattern Recognition in Bioinformatics. He is on the steering committee of the International Conference on Pattern Recognition in Bioinformatics. He is a Fellow of IEEE and AIMBE.  Three of his PhD students are IEEE Fellows. Acharya and his work have been profiled in publications such as Businessweek, Mathematics Calendar, Drug Discovery, Diagnostic Imaging, Environnews, EurekAlert, Science Daily, and The Scientist among others. He is working as part of a multidisciplinary international team on a NSF-United Nations Digital Government Surveillance project involving Hot Spot Bio-Geo Informatics. He has initiated 4 Centers/Institutes of Excellence at Penn State. He has assembled a university-wide multidisciplinary team to secure a NSF Research infrastructure grant. He has initiated a Graduate Certificate in Embedded Systems (jointly with CMU) and a Graduate Certificate in Security.  He has recruited 21 new tenure-track faculty members. All of the eligible junior faculty members have been awarded NSF Career grants. Three junior faculty members were awarded the prestigious NSF PECASE award by President Obama.  During his tenure, Penn State CS research expenditure has moved from 64th (2001) to 8th (2014) in the nation. CS citations ranks 5th in the world. The Department was awarded the $48 Million US Army CRA award (Network security), $10 Million NSF Expedition award, and  $35.5 Million US Army Network Sciences Center recently. During his tenure, Penn State graduate students were hired in tenure track faculty positions at: Carnegie Mellon, Michigan (Ann Arbor), Georgia Tech, UIUC (Illinois Urbana Champaign), Oregon, NC State, Texas A& M, Virginia, Virginia Tech, Nebraska, Rutgers, Johns Hopkins, Florida, amongst others.  Research Interests: Big Data Mining, Network Sciences & Engineering, Genomics. Active Research Support: NSF Award Abstract #1533797 XPS: FULL: DSD: Collaborative Research: Parallelizing and Accelerating Metagenomic Applications, $750K (with Yuan Xie)9/1/15 – 8/31/19 NSF Award Abstract #1421908 III: Small: Reconstructing viral population without using a reference genome, $500K (with Mary Poss, Paul Medvedev), 9/1/14 - 8/31/17. Five Representative Publications:  Manjari Mukhopadhyay, Raunaq Malhotra, Raj Acharya: A generalized lattice model for clustering metagenomic sequences. BCB 2015: 665-672 Prabhakara, R. Malhotra, R. Acharya, M. Poss, Mutant Bin: Unsupervised Haplotype Estimation of Viral Population without Reference Genome, J of Computational Biology, 20(6): 453-463 (2013). R. Rauscher, R. Acharya, Virtual Machine placement in predictable computing clouds, IEEE CLOUD 2014: 975-976. R. Rauscher, R. Acharya, Performance of private clouds in health care organizations, CloudCom (1) 2013: 693-698. S. Prabhakara, R. Acharya, A two way multidimensional mixture model for clustering      Clustering metagenomic sequences, BCB 2011: 191-200.",
  "content_length": 3996,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:50"
}