{
  "name": "Raj Reddy",
  "homepage": "http://www.rr.cs.cmu.edu",
  "status": "success",
  "content": "rrlong Raj Reddy Wean Hall 5325, School of Computer Science, Carnegie Mellon University, Pittsburgh PA 15213-3891 412-999-8765   FAX: Scan and email image to rr@cmu.edu Short version www.rr.cs.cmu.edu/rrshort.html Wikipedia https://en.wikipedia.org/wiki/Raj_Reddy Dr. Raj Reddy is a University Professor of Computer Science and Robotics and Moza Bint Nasser Chair in the School of Computer Science at Carnegie Mellon University.  From 1960-63, Dr. Reddy worked as an Applied Science Representative for IBM Corp. in Australia. He was an Assistant Professor of Computer Science at Stanford from 1966-69. He joined the Carnegie Mellon faculty as an Associate Professor of Computer Science in 1969. He became a Full Professor in 1973, and a University Professor in 1984. He served as the founding Director of the Robotics Institute from 1979 to 1991 and as the Dean of School of Computer Science from 1991 to 1999. Dr. Reddy received a BE degree from the Guindy Engineering College of the University of Madras, India in 1958 and a MTech degree from the University of New South Wales, Australia, in 1960. He received a Ph.D. degree in Computer Science from Stanford University in 1966. He has been active in AI research for over five decades in the areas of AI, Speech Understanding, Image Understanding, Robotics, Multi-sensor Fusion, and Intelligent Agents. Dr. Reddy's current research interests include: Technology in Service of Society, Speech to Speech Translation among Indian Languages, Voice Computing for the 3B semi-literate populations at the bottom of the pyramid, Digital Democracy, Learning Science and Technologies, and KG to PG College in Every Village. His professional honors include: Fellow of the Institute of Electrical and Electronics Engineers, Fellow of the Acoustical Society of America, Fellow of the American Association for Artificial Intelligence, Member of the National Academy of Engineering and Member of the American Academy of Arts and Sciences. He is also a member of Chinese Academy of Engineering, Indian National Science Academy, and India National Academy of Engineering.  He was president of the American Association for Artificial Intelligence from 1987 to 89. In 2011, he was inducted into inaugural IEEE Intelligent Systems' AI's Hall of Fame. Dr. Reddy was awarded the Legion of Honor by President Mitterand of France in 1984 and Padma Bhushan by President of India in 2001. He was awarded the ACM Turing Award in 1994, the Okawa Prize in 2004, the Honda Prize in 2005, and the Vannevar Bush Award in 2006. He served as co-chair of the President's Information Technology Advisory Committee (PITAC) from 1999 to 2001. He has been awarded honorary doctorates (Doctor Honoris Causa) from SV University, Universite Henri-Poincare, University of New South Wales, Jawaharlal Nehru Technological University, University of Massachusetts, University of Warwick, Anna University, Indian Institute for Information Technology (Allahabad), Andhra University, IIT Kharagpur, Hong Kong University of Science and Technology, Rajiv Gandhi University of Knowledge Technologies, and Carnegie Mellon University.  He was a founding member of the International Board of Governors of Peres Center for Peace in Israel. Selected contributions available on the Web Pre 2000 Papers and Talks SPEECH-UNDERSTANDING SYSTEMS: Final Report of a Study Group, Allen Newell et al, CMU CSD report, May 1971 Speech Recognition by Machine: A Review, Proceedings of the IEEE, 64, 501-531, April 1976 Machine Intelligence and Robotics: Report of the NASA Study Group - Executive Summary, Final Report Carl Sagan (chair), Raj Reddy (vice chair) and others, NASA JPL, September 1979 Task-Oriented Architectures, Bisiani, Mauersberg, and Reddy, Proceedings of IEEE, 71, 7, 885-898, July 1983 “Prof honored”, Mitterrand Visit and Legion of Honor Ceremony. Pittsburgh Post-Gazette, OCR corrected copy, original PPG, March 28 1984 “Worlds apart”. Mitterrand Legion of Honor Ceremony, Pittsburgh Post-Gazette, OCR corrected copy, original PPG, March 29 1984 “Fitting Honor for Reddy”, Mitterrand Visit and Legion of Honor Ceremony. Pittsburgh Post-Gazette Editorial, OCR corrected copy, original PPG, March 29 1984 Foundations and Grand Challenges of Artificial Intelligence, AAAI Presidential Address, 1988. To Dream the Possible Dream, Turing Award Lecture presented at ACM CS Conference, March 1, 1995 All Authored Works On-Line : A Global Infrastructure for Universal Access to Information. April 1997, new version 4MB Nov 2003 To Err is Human : Computational Limits to Human Thinking - Implications for the Design of User Interfaces. October 1996; new version June 2004 Towards Teleportation, Time Travel and Immortality, ACM 50th Anniversary Conference, March 1997 A Gigabit National Data Grid/Fiber-to-the-Home Initiative for Computer Mediated Communications. June 1997 2000-2009 Talks Towards a Dependable Self Healing Network, white paper for Congressional Testimony, March 2000 Implications of Infinite Memory and Bandwidth, Talk presented at Newell-Simon Hall Dedication Symposium, October 19, 2000 Computing - The Next 10 years, Talk presented at Georgia Tech 10th Anniversary Convocation, April 6, 2001 Sustainable ICT for Emerging Economies  Talk presented at NSF-UN-World Bank conference on Technologies for Sustainable Development, Bangalore, India, Jan 2004 Speech Recognition – A 50 Year Retrospective, Invited Paper presented at Acoustical Society of America Conf 2004 session in Honor of Contributions of James Flanagan, Nov 15, 2004 PCtvt: a multifunction information appliance for illiterate people  Talk presented at ICT4B  retreat at UC Berkeley, August 26, 2004 (6MB); at Stanford May 11, 2005 A Multifunction Information Appliance for Emerging Economies: Mythology and Reality of the Digital Divide Problem Talk presented at MIT workshop on future platforms Aug 1, 2005 The Role of Information Technology at the Bottom of the Pyramid, talk at CMU Oct 5th and 6th, 2005 Million Book Digital Library Project: Research Issues in Data Mining and Text Mining, with Jaime Carbonell, Talk presented at International Conference on Data Mining, Nov 28, 2005 and MSR India TechVista Symposium, Jan 12, 2006 The Disruptive Future of Telecom, with Rahul Tongia, talk presented at World Telecom Development Conference, WTDC 06, March 7, 2006 Reflections on Early AI and CS at Stanford: 1963 – 1969 and Beyond, Talk presented at Stanford CS40th Anniversary Symposium, March 22, 2006 The New Bill of Rights of Information Society, with Jaime Carbonell, Talk presented at Google, March 23, 2006 Back to The Future: Early Role of EAF in Divining the Future of AI, Talk presented at Edward A. Feigenbaum 70th Festschrift, March 26, 2006 Robotics and Intelligent Systems in Support of Society, IEEE Transactions Intelligent Systems, 21, 3, 24-31, 2006 Spoken Language Systems: The Unfinished Agenda, ICSLP Plenary Speech at the Interspeech 2006, Pittsburgh, Pa. Sep 22, 2006 Creating Rural Wealth using ICT and Wireless, Invited Talk at the Indian Economic Association Annual Conference, Kurukshetra University, India, Dec 28, 2006 Applications of Intelligent Systems and Robotics in Service of Society, Keynote Speech at IJCAI 2007, Hyderabad, India, Jan 10, 2007 Luck favors the Prepared Mind - Reflections on a Scientific Career, Talk at the Journey series at CMU, October 8, 2007 Technology in Service of Society, Talk at Microsoft Research Asia 10th Anniversary symposium, Beijing, November 4, 2008 Alternative Visions for Computer Science, China Computer Science Vision 2020 Talk, Tsinghua University, Beijing, October 13, 2009 2010-2015 Talks Educating a Child Machine: The Unfinished Agenda of Human-Level AI, Microsoft Research Symposium, March 9, 2012 Creating a Child Machine: Reflections on Turing’s Proposal, Talk at ACM Turing Centenary Celebration, San Francisco. June 15-16, 2012 Homo Connecticus: Implications for Life in a Connected Planet, Talk Presented at the Israel Presidential Conference, June 20, 2012 Who Invented the Computer? Babbage, Atanasoff, Zuse, Turing or von Neumann? Talk given at Heidelberg Laureates Forum on Origins of Computing, Sep 23, 2013 Role of Technology Innovation in Creating a Truly Humane Society, Talk presented at Honda Foundation Laureates Symposium, Tokyo, Japan, Nov 14, 2014 Computational Limits to Human Thinking, Talk presented at MSR India 10th Anniversary Symposium, Bangalore, India, Jan 23, 2015 2016-2017 Talks KG to PG Online Micro-University in Every Village, Talk presented to HRD Ministry of AP. July 5, 2016 Anytime, Anywhere Anyone (AAA) Internet Voting in India, Talk presented at Election Commission of India, August 2, 2016 Disruptive Future of Education, Talk presented at VC conference, India, August 11, 2016 The Role of Smart Villages in the 21st Century, Keynote speech, IKCEST symposium, Beijing, Sep 4 2016 RI, NREC, and the Future of Robotics, Invited talk at NREC 25 Anniversary symposium, Pittsburgh, Pa. Sep 8, 2016 Voice Computing and Reaching the 3B People at the Bottom of the Pyramid, Talk presented at Heidelberg Laureate Forum, Sep 20, 2016. Too Much Information and Too Little Time, Talk presented at Heidelberg Laureate Forum, Sep 22, 2016.  Video IoT Intensive Smart Cities Enable Innovative Engineering Industries, Keynote Speech at International Forum on Innovation and Emerging Industries Development (IEID), Shanghai, China, Nov 1, 2016 Internet Enabled AI and Big Data Applications in Service of Society, Talk at 3rd World Internet Conference, Wuzhen China, Nov 17 2016 Preserving Our Past and Present for the Future Generations, Keynote at International Conference on Digital Resources Sharing and Applications, Hangzhou, China, June 15, 2017 Challenges in Ethics of AI, Panel at ACM 50 Years of Turing Awards Conference, June 23, 2017 Creating a Humane Society through Computational Social Science, Keynote Speech at Web Intelligence WI 17 Conference Leipzig Germany, Aug 25, 2017 COGs: Towards Univer",
  "content_length": 15998,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:52"
}