{
  "name": "Raj P. N. Rao",
  "homepage": "https://homes.cs.washington.edu/~rao",
  "status": "success",
  "content": "Rajesh P. N. Rao Rajesh P. N. Rao Home BCI and  Comp Neuroscience Robotic Learning Indus script Rajesh P. N. Rao is the CJ and Elizabeth Hwang Endowed Professor of Computer Science and Engineering and Electrical and Computer Engineering, co-Director of the NSF Center for Neurotechnology, Adjunct Professor in the ECE and BioE departments, and faculty member in the Neuroscience Graduate Program at the University of Washington (UW), Seattle. He received his PhD from the University of Rochester and was an Alfred P. Sloan postdoctoral fellow at the Salk Institute for Biological Studies before joining UW. He is the recipient of a Guggenheim Fellowship, a Fulbright Scholar award, an NSF CAREER award, an ONR Young Investigator Award, a Sloan Faculty Fellowship, and a David and Lucile Packard Fellowship for Science and Engineering. He is the author of the textbook Brain-Computer Interfacing (Cambridge University Press, 2013) and the co-editor of two volumes, Probabilistic Models of the Brain (MIT Press, 2002) and Bayesian Brain (MIT Press, 2007). His research spans the areas of computational neuroscience, artificial intelligence, and brain-computer interfacing. He also works on the 4000-year-old Indus script (on which he has given a TED talk) and studies classical Indian painting. BrainNet: A “Social Network” of Brains (Nature Scientific Reports, 2019) Neural Co-Processors for the Brain (Curr Opinion in Neurobio, 2019) The Indus Script and Economics (book chapter in Walking with the Unicorn, 2018) Textbook on Brain-Computer Interfacing (Website) “MOOC” (massively open online course) on Computational Neuroscience Other Selected Publications: PNAS paper on learning BCIs Curr Opinion Neurobio paper on BCIs for scientific inquiry J Neur Eng paper on probabilistic co-adaptive BCIs First brain-controlled humanoid robot and human brain-to-brain interface NIPS article on how priors influence decision making Review article on predictive coding models of brain function",
  "content_length": 1984,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:47"
}