{
  "name": "Raja Loganantharaj",
  "homepage": "http://louisiana.academia.edu/RasiahLoganantharaj",
  "status": "success",
  "content": "Rasiah Loganantharaj - University of Louisiana at Lafayette Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Rasiah LoganantharajUniversity of Louisiana at Lafayette, The Center for Advanced Computer Studies, CACS, Faculty MemberaddFollowdoneFollowingFollowers12Following13Co-authors4Public ViewsRelated Authors Ruby B. LeePrinceton University Marijke CoetzeeNorth West University Potchefstroom David Pierre LeibovitzCarleton University Ali AhmedUniversity of Liverpool online programme with Laureate Derek AbbottUniversity of Adelaide Harijono DjojodihardjoInstitut Teknologi Bandung Carlos Eduardo Pires de CamargoUniversidade Estadual de Campinas Jose BarataFCT / Universidade Nova de Lisboa Dr. Mohamed GadallaAlabama A&M University Annamaria CacchioneUniversidad Complutense de MadridInterests UploadsPapers by Rasiah LoganantharajA Overview of a Synergetic Combination of Local Search with Evolutionary Learning to Solve Optimization ProblemsIea Aie, 2000ABSTRACT Problem of undergeneralization in EBL and a proposed solutionProceedings of the 7th International Conference on Industrial and Engineering Applications of Artificial Intelligence and Expert Systems, May 31, 1994 Scheduling System Assessment, and Development and Enhancement of Re-engineered Version of GPSSABSTRACT An Overview of a Synergetic Combination of Local Search with Evolutionary Learning to Solve Optimization ProblemsLecture Notes in Computer Science, 2000ABSTRACT Recognizing transcription start site (TSS) of plant promotersInternational Conference on Information Technology: Coding and Computing (ITCC'05) - Volume II, 2005... Raja Loganantharaj Center for Advanced Computer Studies University of Louisiana at Lafayette ... more ... Raja Loganantharaj Center for Advanced Computer Studies University of Louisiana at Lafayette logan@cacs.louisiana.edu ... 0.389 -11.547 -0.477 0.576 -0.0354 Table 3: Position weighted matrix for TATA-less promoter Using the weight matrix given in Table 2, we ran the known ... Qualitative and quantitative time interval constraint networksProceedings of the 19th annual conference on Computer Science - CSC '91, 1991Constraint propagation algorithms are often used in Artificial Intelligence systems to perform in... more Constraint propagation algorithms are often used in Artificial Intelligence systems to perform inference about quantities [5]. On the other hand, many temporal reasoning systems, e.g. Allen&amp;amp;#x27;s interval algebra [1] and Vilain and Kautz&amp;amp;#x27;s point algebra [20], deal only with qualitative relations between time intervals or between time points. In this paper we propose a general framework for representing and reasoning about both qualitative and quantitative temporal constraints over time dependent events. Information about (possibly disjunctions of) qualitative relations between time intervals, e.g. during, meet, start, finish, ..., as in Allen&amp;amp;#x27;s interval algebra [1], or relations between time points, e.g. before, after, and equal, as in Vilain and Kautz&amp;amp;#x27;s point algebra [20], can be expressed. At the same time, quantitative information, in particular, durations of events, references to absolute time, and metric information, can be represented and propagated in this unified framework. The framework called Time Interval Constraint Satisfaction Problem (TICSP) is proposed. TICSP consists of a set of time intervals, and a set of four-ary constraints expressing relationships between any two time intervals (four time points). These constraints are labeled by a set of vectors of open/closed metric bounds. The problem is to make the tightiest possible assertions about the relationships among all time intervals. A strong 3consistency algorithm is derived for the propagation of these temporal constraints. Artificial intelligence (panel)Proceedings of the 1995 ACM 23rd annual conference on Computer science - CSC '95, 1995 PAVIS: a tool for Peak Annotation and VisualizationBioinformatics, 2013We introduce a web-based tool, Peak Annotation and Visualization (PAVIS), for annotating and visu... more We introduce a web-based tool, Peak Annotation and Visualization (PAVIS), for annotating and visualizing ChIP-seq peak data. PAVIS is designed with non-bioinformaticians in mind and presents a straightforward user interface to facilitate biological interpretation of ChIP-seq peak or other genomic enrichment data. PAVIS, through association with annotation, provides relevant genomic context for each peak, such as peak location relative to genomic features including transcription start site, intron, exon or 5 0 /3 0 -untranslated region. PAVIS reports the relative enrichment P-values of peaks in these functionally distinct categories, and provides a summary plot of the relative proportion of peaks in each category. PAVIS, unlike many other resources, provides a peak-oriented annotation and visualization system, allowing dynamic visualization of tens to hundreds of loci from one or more ChIP-seq experiments, simultaneously. PAVIS enables rapid, and easy examination and cross-comparison of the genomic context and potential functions of the underlying genomic elements, thus supporting downstream hypothesis generation. Availability and Implementation: PAVIS is publicly accessed at http://manticore.niehs.nih.gov/pavis.Download Reasoning about networks of temporal relations and its applications to problem solvingApplied Intelligence, 1993An interval algebra (IA) has been proposed as a model for representing and reasoning about qualit... more An interval algebra (IA) has been proposed as a model for representing and reasoning about qualitative temporal relations between time intervals. Unfortunately, reasoning tasks with IA that involve deciding the satisfiability of the temporal constraints, or providing all the satisfying instances of the temporal constraints, are NP-complete. That is, solving these problems are computationally exponential in the \"worst case.\" However, several directions in improving their computational performance are still possible. This paper presents a new backtracking algorithm for finding a solution called consistent scenario. This algorithm has an O(n 3) best-case complexity, compared to O(n 4) of previous known backtrack algorithms, where n denotes the number of intervals. By computational experiments, we tested the performance of different backtrack algorithms on a set of randomly generated networks with the results favoring our proposal. In this paper, we also present a new path consistency algorithm, which has been used for finding approximate solutions towards the minimal labeling networks. The worst-case complexity of the proposed algorithm is still O(n3); however, we are able to improve its performance by eliminating the unnecessary duplicate computation as presented in Allen's original algorithm, and by employing a most-constrained first principle, which ensures a faster convergence. The performance of the proposed scheme is evaluated through a large set of experimental data.Download The effects of shared information on semantic calculations in the gene ontologyby Rasiah Loganantharaj and Paul W BibleComputational and Structural Biotechnology Journal, 2017 Towards recognition of protein function based on its structure using deep convolutional networksby Rasiah Loganantharaj and Arun Kaniymattam2016 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), 2016 An Overview And Comparison of Tools for RNA-Seq AssemblyComputational Methods for Next Generation Sequencing Data Analysis, 2016 Probabilistic Approach for Representing and Reasoning with Repetitive Events Intelligent Problem Solving, Methodologies and Approaches, 13th International Conference on Industrial and Engineering Applications of Artificial Intelligence and Expert Systems, IEA/AIE 2000, New Orleans, Louisiana, USA, June 19-22, 2000, Proceedingsby Rasiah Loganantharaj and Günther PalmIea Aie, 2000... of Paderborn, Germany) 4 An Automatic Configuration System for Handwriting Recognition Proble... more ... of Paderborn, Germany) 4 An Automatic Configuration System for Handwriting Recognition Problems 512 Cara O&amp;amp;amp;amp;amp;amp;amp;#x27;Boyle, Barry Smyth and Franz ... of the 617 Bull Flag Heuristic With Genetic Algorithms and Neural Networks William Leigh, Edwin Odisho, Noemi Paz (University of ... Unified framework to combine time points and intervals Proceedings of the 13th international conference on Industrial and engineering applications of artificial intelligence and expert systems: Intelligent problem solving: methodologies and approaches Temporal Reasoning and Problem Solvingarrow_back_iosarrow_forward_iosDownload Capturing Design Knowledge Parallel deduction of connection graphsAdvances in Logic Programming and Automated Reasoning Volume 1, Jun 1, 1992 Representation of, and Reasoning with, Near-Periodic Recurrent Events ×CloseLog InLog in with GoogleorEmailPasswordRemember me on this computeror reset passwordEnter the email address you signed up with and we'll email you a reset link. Need an account? Click here to sign up AboutPressPapersTopicsAcademia.edu Journals We're Hiring! Help CenterFind new research papers in:PhysicsChemistryBiologyHealth SciencesEcologyEarth SciencesCognitive ScienceMathematicsComputer ScienceTermsPrivacyCopyrightContent PolicyAcademia ©2025",
  "content_length": 9628,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:51"
}