{
  "name": "Rajat Kumar De",
  "homepage": "https://www.isical.ac.in/~rajat",
  "status": "success",
  "content": "Homepage of Dr. Rajat K. De Dr. Rajat Kumar DeProfessor Contact Machine Intelligence Unit Indian Statistical Institute 203 Barrackpore Trunk Road, Kolkata 700108, India. E-mail: rajat@isical.ac.in Telephone: +91-33-25753105 (Office) Biography Rajat K. De is a Professor of the Indian Statistical Institute, Kolkata, India. He obtained his Ph.D. degree from the same institute in the year 2000. He was a Distinguished Postdoctoral Fellow of the Whitaker Biomedical Engineering Institute, the Johns Hopkins University, USA, during 2002-2003. He visited the Department of Medicine, the University of California, San Diego, USA in the years 2017 and 2018, with a Fulbright-Nehru Academic and Professional Excellence Fellowship. He has been working in the area of machine learning, bioinformatics, computational biology, and systems biology. Professor De has about 100 research papers published in international journals, conference proceedings and in edited books, and co-edited three books. Education Ph.D. in the area of Computer Science from the Indian Statistical Institute, India, in the year 2000. The thesis is on neuro-fuzzy computing for feature evaluation, classification and rule generation. Master of Computer Science and Engineering from Jadavpur University, Kolkata, India, in the year 1993 with 1st class. Bachelor of Technology in Computer Science and Engineering from Calcutta University, Kolkata, India, in the year 1990 with 1st class. Bachelor of Science (Honors in Physics) from Calcutta University, Kolkata, India, in the year 1987 with 1st class. Fellowships/Scholarships awarded Fulbright-Nehru Academic and Professional Excellence Fellowship (Flex Award) for visiting the Department of Medicine, University of California, San Diego, U.S.A., during February-April 2017 and February-April 2018. Distinguished Postdoctoral Fellowship by the Whitaker Biomedical Engineering Institute, the Johns Hopkins University, USA, during June 2002 - June 2003. Research Associateship by CSIR to work at the Machine Intelligence Unit, Indian Statistical Institute, Kolkata, during November 1998 - June 1999. Dr. K. S. Krishnan Senior Research Fellowship by the Department of Atomic Energy, Government of India, for doctoral work at the Machine Intelligence Unit, Indian Statistical Institute, Kolkata, during October 1993 - October 1998. List of projects Multi-dimensional Research to Enable Systems Medicine: Acceleration Using a Cluster Approach: During January 2017-July 2022, sponsored by the Department of Biotechnology, Government of India (Investigator) Three Timescale Modeling of Biochemical Pathways: Integration of Signaling, Gene Regulatory and Metabolic Pathways: During April 2019-March 2022, sponsored by Indian Statistical Institute. (Principal Investigator) Understanding the Efficacy of Existing Drug Molecules on COVID-19 and Interactive Pathways: A Deep Learning Model: During July 2020-July 2021, sponsored by SERB, Government of India. (Principal Investigator) Modeling host-pathogen interactions: During April 2016-March 2019, sponsored by Indian Statistical Institute. (Principal Investigator) Development of computational methods for analyzing biochemical pathways as integrated systems: During April 2013-March 2016, sponsored by Indian Statistical Institute. (Principal Investigator) Development of pattern recognition and machine learning tools for solving certain problems in systems biology - II: During April 2010-March 2013, sponsored by Indian Statistical Institute. (Principal Investigator) Development of pattern recognition and machine learning tools for solving certain problems in systems biology: During April 2008-March 2010, sponsored by Indian Statistical Institute. (Principal Investigator) Computational analysis of biochemical pathways related to gene-activity: During April 2005-March 2008, sponsored by Indian Statistical Institute. (Principal Investigator) Hybridization of knowledge-based and case-based reasoning in neuro-fuzzy framework for pattern recognition problems: During April 2000-March 2005, sponsored by Indian Statistical Institute. (Co-Principal investigator) Teaching acivities Teaching the course titled “Neural Networks and Applications” in Master of Technology (Computer Science) since 2003-2004 till date. Taught the course titled “Database Management Systems” in Master of Technology (Computer Science) in 2003 and 2004. Teaching the course titled “Database Management Systems” in Master of Technology (Quality, Reliability and Operations Research). Ph. D. thesis supervised Dr. Anindya Bhattacharya for his Ph. D. thesis titled “Correlation Clustering of Gene Expression Patterns”,(Co-supervisor: Dr. Nirmalya Chowdhury, Jadavpur University). Ph. D. degree awarded by Jadavpur University, Kolkata, India in 2011. Dr. Losiana Nayak for her Ph. D. thesis titled “Computational Methodologies for Modularization of Some Biochemical Pathways: Analysis and Annotation”, Ph. D. degree awarded by University of Calcutta, Kolkata, India in 2013. Dr. Anupam Ghosh for his Ph. D. thesis titled “Soft Computing Methodologies for Identification of Some Possible Genes Mediating the Development of a Disease: Analysis of Microarray Gene Expression Profiles”, (Co-supervisor: Dr. Bibhash C. Dhara, Jadavpur University). Ph. D. degree awarded by Jadavpur University, Kolkata, India in 2013. Dr. Mouli Das for her Ph. D. thesis titled “Certain Optimization Tasks in Biochemical Pathways”, (Joint Supervisor: Professor Subhasis Mukhopadhyay, University of Calcutta), Ph. D. degree awarded by University of Calcutta, Kolkata, India, in 2014. Dr. Namrata Tomar for her Ph. D. thesis titled “Development of In Silico Methods for Analysis of Integrated Biochemical Pathways”,Ph. D. degreeawarded by University of Calcutta, Kolkata, India, in 2015. Dr. Somnath Tagore for his Ph. D. thesis titled “Mining Certain Pathways in Metabolomics”, (Co-supervisor: Dr. Nirmalya Chowdhury, Jadavpur University),Ph. D. degree awarded by Jadavpur University, Kolkata, India, in 2015. Dr. Sanghita Banerjee for her Ph. D. thesis titled tentatively “Deciphering Molecular Evolution of Unstructured Proteins in Light of Gene Regulation”, Ph.D. degree awarded by University of Calcutta, Kolkata, India, in 2019. Dr. Abhijit Dasgupta for his Ph. D. thesis titled “Modeling Control Dynamics of Integrated Biochemical Pathways: A Control Theoretic Approach”,(Co-supervisor: Professor Nirmalya Chowdhury, Jadavpur University), Ph.D. degree awarded by Jadavpur University, Kolkata, India, in 2020. Dr. Rishika Sen for her Ph. D. thesis titled “In silico Modelling of Host-pathogen Interactions: Identification of Pathogenic Toxins and the Analysis of Their Effect on the Host Pathways”; Ph.D. degree awarded by the Indian Statistical Institute, Kolkata, India, in 2021. Mr. Debraj Ghosh for his Ph. D. thesis titled “Development of Stochastic Simulation Algorithms for Modelling Biochemical Pathways”, Ph.D. (Tech.) degree awarded by the University of Calcutta, Kolkata, India, in 2022. Ph. D. thesis supervising Mr. Prasun Dutta for his Ph. D. thesis titled tentatively “On Some Deep Neural Network Models: Applications in Multi-omics Data Integration”, registered in the Indian Statistical Institute, Kolkata, India (Year of registration: 2019). Mr. Ritankar Das for his Ph. D. thesis titled tentatively “Computational Methods for Analysing Different Brain Diseases”, registered in the Department of Biophysics, Molecular Biology and Bioinformatics, University of Calcutta, Kolkata, India (Date of registration: August 28, 2019). Mr. DibyenduBikash Seal for his Ph. D. thesis titled tentatively “On Multi-omics Data Integration and Single-Cell Data Analysis: Machine Learning based Methodology”, registered in the Department of Computer Science and Engineering, University of Calcutta, Kolkata, India (Date of registration: October 25, 2019). Ms. Rituparna Sinha for her Ph. D. thesis titled tentatively “Detection and Analysis of Some Human DNA Alterations: A Root Cause of Cancer”, (Joint Supervisor: Professor Rajat Kumar Pal, University of Calcutta) registered in the Department of Computer Science and Engineering, University of Calcutta, Kolkata, India (Date of registration: December 22, 2020). Books Published A. Ghosh, R. K. De, and S. K. Pal (Eds.), Pattern Recognition and Machine Intelligence, Proc. PReMI’07, Lecture Notes in Computer Science (LNCS), vol. 4815, Springer, Heidelberg, 2007. Download PDF R. K. De, D. P. Mandal, and A. Ghsosh (Eds.), Machine Interpretation of Patterns: Image Analysis and Data Mining, World Scientific, Singapore, 2010. R. K. De and N. Tomar (Eds.), Immunoinformatics: From Biology to Informatics, second edition, under the Series titled Methods in Molecular Biology, by J. Walker (Series Editor), Humana Press, 2014. Articles in the area of Bioengineering / Bioinformatics / Computational Biology / Systems Biology Year : 2007 L. Nayak and R. K. De, “An algorithm for modularization of MAPK and Calcium signaling pathways: Comparative analysis among different species”, Journal of Biomedical Informatics, vol. 40, pp. 726-749, 2007. Download PDF L. Nayak and R. K. De, “Modularized study of human calcium signaling pathway”, Journal of Biosciences, vol. 32, no. 5, pp. 1009-1017, 2007. Download PDF Year : 2008 A. Bhattacharya and R. K. De, “Divisive correlation clustering algorithm (DCCA) for grouping of genes: Detecting varying patterns in expression profiles”, Bioinformatics, vol. 24, 1359 – 1366, 2008. Download PDF R. K. De, M. Das, and S. Mukhopadhyay, “Incorporation of enzyme concentrations into FBA and identification of optimal metabolic pathways”, BMC Systems Biology, 2:65, 2008. Download PDF S. Tagore, V. S. Gomase, and R. K. De, “Pathway modeling: New face of graphical probabilistic analysis”, Journal of Proteomics and Bioinformatics, vol. 1, no. 5, pp. 281-286, 2008. Download PDF Year : 2009 R. K. De and A.",
  "content_length": 36620,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:53"
}