{
  "name": "Rajalakshmi Nandakumar [Tech]",
  "homepage": "https://tech.cornell.edu/people/rajalakshmi-nandakumar",
  "status": "success",
  "content": "Cornell Tech - Rajalakshmi Nandakumar Skip to Main Content People / Jacobs Technion-Cornell Institute Rajalakshmi Nandakumar Assistant Professor Jacobs Cornell Rajalakshmi Nandakumar is an assistant professor of information science at Cornell Tech, the Cornell Ann S. Bowers College of Computing and Information Science, and the Jacobs Technion-Cornell Institute. Nandakumar received her Ph.D. in computer science from the University of Washington in 2020. Her research focuses on developing and deploying computing technologies that can have a real-world impact and improve quality of life. She develops wireless sensing technologies that enable novel applications in various domains, including mobile health, user interfaces, precision agriculture, and Internet of Things (IoT) networks. She developed the first contactless smartphone-based sleep apnea diagnosis system, which was licensed by ResMed Inc. and is now used by millions of users for sleep staging. She was recognized with the University of Washington Medicine Judy Su Clinical Research award, with the Paul Baran Young Scholar award by the Marconi Society, and as a Rising Star in EECS by the Massachusetts Institute of Technology. < Back to People SHARE THIS ON: GET IN TOUCH: Website rajalakshmi.nandakumar@cornell.edu JACOBS TECHNION-CORNELL INSTITUTE About the Jacobs Institute FEATURED COURSE CS 5304/INFO 5304 Data Science in the Wild Credits 3 Massive amounts of data are collected by many companies and organizations and the task of a data scientist is to extract actionable knowledge from the data – for scientific needs, to improve public health, to promote businesses, for social studies and for various other purposes. This course will focus on the practical aspects of the field and will attempt to... Rajalakshmi Nandakumar Assistant Professor",
  "content_length": 1822,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:51"
}