{
  "name": "Rajesh Chitnis",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/chitnis-rajesh.aspx",
  "status": "success",
  "content": "Dr Rajesh Chitnis - School of Computer Science - University of Birmingham Dr Rajesh Chitnis School of Computer ScienceAssociate Professor in Computer Science Contact details Telephone+44 (0) 121 414 2590 Emailr.h.chitnis@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Chitnis received his PhD in Computer Science from University of Maryland, College Park, USA in 2014. Afterwards, he was a postdoctoral fellow at Weizmann Institute of Science, Israel (2014-17) and at the University of Warwick, UK (2017-19) before joining the University of Birmingham in October 2019. Please follow the link below to find out more about Rajesh's work: Dr Rajesh Chitnis-personal homepage PhD in Computer Science, University of Maryland College Park, 2014 MSc in Computer Science, University of Maryland, College Park, 2013 BSc in Mathematics and Computer Science, Chennai Mathematical Institute, India, 2010 Logic and Computation Parameterized Algorithms and Complexity Streaming Algorithms Algorithmic Graph Theory Recent publications Article Chitnis, R 2023, 'A Tight Lower Bound for Edge-Disjoint Paths on Planar DAGs', SIAM Journal on Discrete Mathematics, vol. 37, no. 2, pp. 556-572. https://doi.org/10.1137/21M1395089 Chitnis, R, Feldmann, AE & Manurangsi, P 2021, 'Parameterized Approximation Algorithms for Bidirected Steiner Network Problems', ACM Transactions on Algorithms, vol. 17, no. 2, 12. https://doi.org/10.1145/3447584 Chitnis, R, Feldmann, AE, Hajiaghayi, M & Marx, D 2020, 'Tight bounds for planar strongly connected Steiner subgraph with fixed number of terminals (and extensions)', SIAM Journal on Computing, vol. 49, no. 2, pp. 318–364. https://doi.org/10.1137/18M122371X Chitnis, R, Feldmann, AE & Suchý, O 2019, 'A tight lower bound for planar Steiner Orientation', Algorithmica, vol. 81, no. 8, pp. 3200-3216. https://doi.org/10.1007/s00453-019-00580-x Conference contribution Kurien Alex, K, Chitnis, R & Tempest, A 2025, On the Exact & Approximate Complexity of Strongly Connected Steiner Subgraph On Two Terminals With Demands. in A Jeż & J Otop (eds), Fundamentals of Computation Theory: 25th International Symposium, FCT 2025, Wrocław, Poland, September 15–17, 2025, Proceedings. Lecture Notes in Computer Science, vol. 16106, Springer, pp. 30-44, 25th International Symposium on Fundamentals of Computation Theory, Wrocław, Poland, 15/09/25. https://doi.org/10.1007/978-3-032-04700-7_3 Banerjee, S, Chitnis, R & Lahiri, A 2023, How Does Fairness Affect the Complexity of Gerrymandering? in AAMAS '23: Proceedings of the 2023 International Conference on Autonomous Agents and Multiagent Systems. Proceedings of International Conference on Autonomous Agents and Multiagent Systems, Association for Computing Machinery (ACM), pp. 2869-2871, 22nd International Conference on Autonomous Agents and Multiagent Systems, London, United Kingdom, 29/05/23. https://doi.org/10.5555/3545946.3599106 Chen, X, Chitnis, R, Eades, P & Wirth, A 2023, Sublinear-Space Streaming Algorithms for Estimating Graph Parameters on Sparse Graphs. in P Morin & S Suri (eds), Algorithms and Data Structures: 18th International Symposium, WADS 2023, Montreal, QC, Canada, July 31 – August 2, 2023, Proceedings. Lecture Notes in Computer Science, vol. 14079, Springer, pp. 247-261, 18th Algorithms and Data Structures Symposium, Montreal, Quebec, Canada, 31/07/23. https://doi.org/10.1007/978-3-031-38906-1_17 Chitnis, R 2022, Refined Lower Bounds for Nearest Neighbor Condensation. in S Dasgupta & N Haghtalab (eds), Proceedings of The 33rd International Conference on Algorithmic Learning Theory. Proceedings of Machine Learning Research, vol. 167, Proceedings of Machine Learning Research, pp. 262-281, 33rd International Conference on Algorithmic Learning Theory (ALT 2022), Paris, France, 29/03/22. <https://proceedings.mlr.press/v167/chitnis22a.html> Chitnis, R & Saurabh, N 2022, Tight Lower Bounds for Approximate & Exact k-Center in ℝd. in 38th International Symposium on Computational Geometry (SoCG 2022)., 28, Leibniz International Proceedings in Informatics (LIPIcs), vol. 224, Schloss Dagstuhl, pp. 1-15, 38th International Symposium on Computational Geometry (SoCG 2022), Berlin, Germany, 7/06/22. https://doi.org/10.4230/LIPIcs.SoCG.2022.28 Chitnis, R & Feldmann, AE 2019, FPT inapproximability of directed cut and connectivity problems. in BMP Jansen & JA Telle (eds), 14th International Symposium on Parameterized and Exact Computation, (IPEC 2019)., 8, Leibniz International Proceedings in Informatics, LIPIcs, vol. 148, Schloss Dagstuhl, 14th International Symposium on Parameterized and Exact Computation, IPEC 2019, Munich, Germany, 11/09/19. https://doi.org/10.4230/LIPIcs.IPEC.2019.8 Chitnis, R & Cormode, G 2019, Towards a theory of parameterized streaming algorithms. in BMP Jansen & JA Telle (eds), 14th International Symposium on Parameterized and Exact Computation, (IPEC 2019)., 7, Leibniz International Proceedings in Informatics, LIPIcs, vol. 148, Schloss Dagstuhl, 14th International Symposium on Parameterized and Exact Computation, IPEC 2019, Munich, Germany, 11/09/19. https://doi.org/10.4230/LIPIcs.IPEC.2019.7 Banerjee, S, Bhore, S & Chitnis, R 2018, Algorithms and hardness results for nearest neighbor problems in bicolored point sets. in MA Mosteiro, MA Bender & M Farach-Colton (eds), LATIN 2018 -Theoretical Informatics: 13th Latin American Symposium, Buenos Aires, Argentina, April 16-19, 2018, Proceedings. Lecture Notes in Computer Science , vol. 10807, Springer Verlag, pp. 80-93, 13th International Symposium on Latin American Theoretical Informatics, LATIN 2018, Buenos Aires, Argentina, 16/04/18. https://doi.org/10.1007/978-3-319-77404-6_7 Chitnis, R & Feldmann, AE 2018, A tight lower bound for steiner orientation. in VV Podolskii & FV Fomin (eds), Computer Science - Theory and Applications : 13th International Computer Science Symposium in Russia, CSR 2018, Moscow, Russia, June 6–10, 2018, Proceedings. Lecture Notes in Computer Science , vol. 10846 , Springer Verlag, pp. 65-77, 13th International Computer Science Symposium in Russia, CSR 2018, Moscow, Russian Federation, 6/06/18. https://doi.org/10.1007/978-3-319-90530-3_7 Chitnis, R & Talmon, N 2018, Can we create large k-cores by adding few edges? in VV Podolskii & FV Fomin (eds), Computer Science - Theory and Applications : 13th International Computer Science Symposium in Russia, CSR 2018, Moscow, Russia, June 6–10, 2018, Proceedings. Lecture Notes in Computer Science , vol. 10846, Springer Verlag, pp. 78-89, 13th International Computer Science Symposium in Russia, CSR 2018, Moscow, Russian Federation, 6/06/18. https://doi.org/10.1007/978-3-319-90530-3_8 Chitnis, R, Feldmann, AE & Manurangsi, P 2018, Parameterized approximation algorithms for bidirected steiner network problems. in Y Azar, H Bast & G Herman (eds), 26th European Symposium on Algorithms, (ESA 2018)., 20, Leibniz International Proceedings in Informatics, LIPIcs, vol. 112, Schloss Dagstuhl, 26th European Symposium on Algorithms, ESA 2018, Helsinki, Finland, 20/08/18. https://doi.org/10.4230/LIPIcs.ESA.2018.20 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7334,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:58"
}