{
  "name": "Rajendra Kumar 0002",
  "homepage": "https://k-rajendra.github.io",
  "status": "success",
  "content": "Rajendra Kumar Hello! I am an Assistant Professor in the Department of Computer Science at the Indian Institute of Technology Delhi (IITD). My research interests include fine-grained complexity, quantum computing, and cryptography, with a particular focus on studying lattice problems to analyze the security of lattice-based cryptosystems. I completed my Ph.D. under the Joint degree program of Indian Institute of Technology, Kanpur, and National University of Singapore, advised by Prof. Manindra Agrawal and Prof. Divesh Aggarwal. Before joining IIT Delhi, I was a postdoctoral fellow at Weizmann Institute of Science hosted by Prof. Zvika Brakerski and a research fellow at the Center for Quantum Technologies, NUS. Email: rajendra@cse.iitd.ac.in Office: Room 410, Bharti Building, IIT Delhi Looking for motivated PhD and Master’s students. Please email me with your CV and a short summary of your research interests. Latest News July 25: FSTTCS pre-conference Workshop on \"Quantum Algorithms and Cryptography\" at BITS Goa from Dec 14-15, 2025. Sept 25: Invited talk at TQC2025 on Post-Quantum Security of Lattice-based Cryptosystems. July 25: Summer School and Workshop on \"Computational Challenges in Data Privacy\" at IIT Delhi from July 5-8, 2025. Registration deadline: May 31, 2025. Oct 24: Our paper on \"On Beating 2^n for CVP\" is accepted to SOSA-25. Oct 24: Our paper on Quantum Algorithms for Shortest Vector Problem is accepted to SIAM Journal on Computing (SICOMP). Sept 24: Joined Amar Nath and Shashi Khosla School of Information Technology as an associated Faculty. View All News Publications Fine-Grained Complexity via Quantum Natural Proofs.with Yanlin Chen, Yilei Chen, Subhasree Patro, Florian Speelman. In Submission.[PDF] Lattice Based Crypto Breaks in a Superposition of Spacetimeswith Divesh Aggarwal and Shashwat Agrawal. In Submission. [PDF] On Beating 2^n for CVPwith Amir Abboud. SIAM Symposium on Simplicity in Algorithms 2025 (SOSA25)[PDF] QSETH strikes again: finer quantum lower bound for lattice problem, strong simulation, hitting set problem and more.with Yanlin Chen, Yilei Chen, Subhasree Patro, Florian Speelman. Approximation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, APPROX/RANDOM, 2025.[PDF] Lattice Problems in General Norms: Algorithms with Explicit Constants, Dimension-Preserving Reductions, and More.with Huck Bennett, Yanlin Chen, Zeyong Li, and Spencer Peters. In Submission.[PDF] Why we couldn't prove SETH hardness of the Closest Vector Problem for even norms, and of the Subset Sum Problem!with Divesh Aggarwal. 64th Annual Symposium on Foundations of Computer Science, FOCS, 2023.[PDF] Lattice Problems Beyond Polynomial Time.with Divesh Aggarwal, Huck Bennett, Zvika Brakerski, Alexander Golovnev, Zeyong Li, Spencer Peters, Noah Stephens-Davidowitz, and Vinod Vaikuntanathan.55th ACM Symposium on Theory of Computing, STOC, 2023.[PDF] Covert Authentication from Lattices.with Khoa Nguyen. 20th International Conference on Applied Cryptography and Network Security, ACNS, 2022.[PDF] Improved Classical and Quantum Algorithms for the Shortest Vector Problem via Bounded Distance Decoding.with Divesh Aggarwal, Yanlin Chen, and Yixin Shen. Contributed talk at the 25th Conference on Quantum Information Processing, QIP, 2022.[PDF] [Video] Dimension-Preserving Reductions Between SVP and CVP in Different p-Norms.with Divesh Aggarwal, Yanlin Chen, Zeyong Li and Noah Stephens-Davidowitz. ACM-SIAM Symposium on Discrete Algorithms, SODA, 2021.[PDF] [Video@CQT][Video@SIGTACS, IITK] Improved (Provable) Algorithms for the Shortest Vector Problem via Bounded Distance Decoding.with Divesh Aggarwal, Yanlin Chen and Yixin Shen. 38th International Symposium on Theoretical Aspects of Computer Science, STACS, 2021. Invited to TOCS Special Issue for STACS 2021.[PDF] Hardness of Approximation of (Multi-)LCS over Small Alphabet.with Amey Bhangale and Diptarka Chakraborty. Approximation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, APPROX/RANDOM, 2020.[PDF][Video] Cryptanalysis of 2-round KECCAK-384.with Nikhil Mittal and Shashank Singh. 19th International Conference on Cryptology in India, INDOCRYPT, 2018.[PDF] Cryptanalysis of 1-round KECCAK.with Mahesh Sreekumar Rajasree and Hoda AlKhzaimi. 10th International Conference on Cryptology in Africa, AFRICACRYPT, 2018.[PDF] On the Maximum Distance Sublattice Problem and Closest Vector Problem.with Shashank K Mehta and Mahesh Sreekumar Rajasree. In 26h International Symposium on Symbolic and Numeric Algorithms for Scientific Computing (SYNASC), 2024[PDF] Ph.D. Thesis Exponential Time/Space Algorithms and Reductions for Lattice Problems [PDF] Teaching 2025-26 Sem 2: COL7160: Quantum Computing 2025-26 Sem 1: COL106: Data Structures and Algorithms (co-taught with Prof. Rohit Vaish) 2024-25 Sem 2: COL726: Numerical Algorithms 2024-25 Sem 1: COL872: Lattices in Computer Sciecne 2024-25 Sem 1: COQ303 Students PhD Students Shashwat Agrawal (Aug 2024 - ): joint with Prof. Venkata Koppula. Rupanshu Shah (Aug 2025 - ). Mridul Gupta (Aug 2025 - ) B.Tech. Project Students Mitali Nanda (Aug 2024-Nov 2024). Bhumika Mittal (Ashoka University) (Aug 2024- Jan 2025): joint with Prof. Priyanka Golia. Harshal Singh Sindal (Aug 2025 - ) M.Tech. Project Students Kartik Arora (Aug 2025 - ). Professional Services Reviewed several papers for the following conferences: TCC, CCC, ANTS, EUROCRYPT, ITC, ISIT, CRYPTO, QIP, TQC, ICALP, ESA, QCRYPT, ASIACRYPT, FSTTCS, STOC, FOCS, SODA. Co-organized a workshop on “Fine-grained hardness and Cryptography” with Divesh Aggarwal, Huck Bennett, Sasha Golovnev, and Noah Stephens-Davidowitz, at IIT Madras (part of FSTTCS 22 pre-conference workshops). Co-organized Winter Theory Residency 2024 and Summer Workshop on \"Computational Challenges in Data Privacy\" 2025 at IIT Delhi Contact Feel free to reach out: Email: rajendra@cse.iitd.ac.in Office: Bharti Building, Room 410",
  "content_length": 5973,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:54"
}