{
  "name": "Rajeev Sangal",
  "homepage": "https://www.iiit.ac.in/people/faculty/sangal",
  "status": "success",
  "content": "Adjunct Faculty - IIIT Hyderabad CONTACT Menu Adjunct Faculty Anbumani Subramanian Visit Page Affiliation Intel, Principal Engineer – AI Research Science Research Areas Applied AI, autonomous driving, computer vision, machine learning Research Centre iHub-Data Anil K Jain Visit Page Affiliation University Distinguished Professor, Dept. of Computer Science & Engineering, Michigan State University, USA. Research Areas Pattern recognition, computer vision and biometric recognition. Research Centre Center for Visual Information Technology (CVIT) Arjun Rajasekar Visit Page Affiliation Sr. Research Scientist, RCTS, IIIT-Hyderabad Research Areas Data Science, Computer Vision, Natural Language Processing, and Productising Research Research Centre Raj Reddy Center for Technology and Society (RCTS) Avinash Sharma Visit Page Affiliation Associate Professor Indian Institute of Technology, Jodhpur Research Areas 3D Computer Visition, Applied ML in CogSci/GIS/Robotics Research Centre Center for Visual Information Technology (CVIT) Bharat Ram Ambati Visit Page Affiliation Ph.D In Informatics, University of Edinburgh, UK Research Areas Syntactic Parsing, especially dependency parsing, CCG parsing, Neural Network Models for text processing, Speech Recognition and Text to Speech, Cognitive aspects of language Research Centre Language Technologies Research Center (LTRC) Gopalakrishnan B Visit Page Affiliation Tata Consultancy Services Research Areas Bioinformatics and dtructural Biology: protein Biophysics, NMR of biomolecules receptor-ligand interactions structure/activity/property-based computer-aided drug design functional annotation of genes, protein trafficking in plasmodium falciparum Research Centre Center for Computational Natural Sciences and Bioinformatics (CCNSB) Jay Mookherje Visit Page Affiliation CEO, IHUB-DATA Research Areas Software Engineering Research Centre iHub-Data Kishore S Prahallad Visit Page Affiliation Apple, USA.Ph.D (Carnegie Mellon University, USA) Research Areas Audio, speech and language processing, machine learning, multimedia systems Research Centre Language Technologies Research Center (LTRC) Maitreya Maity Visit Page Affiliation Young Faculty Fellow lHub-Data , lllT Hyderabad. Research Areas Visual Computing, Computer‑Aided Diagnosis, End‑to‑end System Development, IoT Device Integration, Sensors Fusion, Edge Computing, Feature Engineering, Supervised Classification, Software Development (Standalone, Mobile, and Web) Research Centre iHub-Data Manish Gupta Visit Page Affiliation Microsoft, India Research Areas Web Mining, Data Mining, Databases, Algorithms. Research Centre Language Technologies Research Center (LTRC) Monojit Choudhury Visit Page Affiliation Researcher, Microsoft Research India Research Areas Information Retrieval and Natural Language Processing, Artificial Intelligence, Cognition and Music Analysis Research Centre Language Technologies Research Center (LTRC) Padmini Gopalakrishnan Visit Page Affiliation Senior Director, Xilinx Inc, Hyderabad.Ph.D ECE (Carnegie Mellon University, USA) Research Areas EDA tool for FPGAs and compute acceleration on FPGAs (deep learning and computer vision) Research Centre Computer Systems Group (CSG) Peter M Scharf Visit Page Affiliation President, The Sanskrit Library Fellow, Indian Institute of Advanced study, Shimla Research Areas Research in the linguistic, philosophical and vedic traditions of India Research Centre Language Technologies Research Center (LTRC) Prabhakar TV Visit Page Affiliation Professor, Department of Computer Science and Engineering, IIT Kanpur Research Areas Software Architecture, Knowledge Engineering, Web2.0 Research Centre Language Technologies Research Center (LTRC) Rajesh K Pandey P Visit Page Affiliation Principal Scientist, CSIR-IGIB, Mall Road, Delhi, India Research Areas INtegrative GENomics of HOst-PathogEn (INGEN-HOPE), Functional genomics, non-coding RNA Biology, Innovative, cost-effective application of NGS technologies, 3D Organoids as disease models. Research Centre Cognitive Science (CogSci) Sandipan Dandapat Visit Page Affiliation Principal Applied Researcher, Microsoft India Research Areas Natural Language Processing, Large Language Models, Artificial Intelligence Research Centre Language Technologies Research Center (LTRC) Santanu Paul Visit Page Affiliation Raj Reddy Centre for Technology and Society Research Areas Entrepreneurship for Impact, Technology for Social and Public Good Research Centre Raj Reddy Center for Technology and Society (RCTS) Sowmya Vajjala Balakrishna Visit Page Affiliation National Research Council, Canada Research Areas Natural Language Processing, Generative AI Research Centre Language Technologies Research Center (LTRC) Sriram Jayasimha Visit Page Affiliation Signion Systems Pvt. Ltd. Research Areas Satellite Communications Research Centre Signal Processing and Communications Research Center (SPCRC) Sudipta Banerjee Visit Page Affiliation Adjunct Assistant Professor, IIITHPh.D (Michigan State University, United States) Research Areas Biometrics, Digital image forensics, Computer Vision, Cybersecurity. Research Centre Center for Visual Information Technology (CVIT) No posts found 1 2 Copyright © 2024, International Institute of Information Technology Hyderabad. All rights reserved. Copyright © 2024, International Institute of Information Technology, Hyderabad. All rights reserved.",
  "content_length": 5411,
  "method": "requests",
  "crawl_time": "2025-12-01 14:14:56"
}