{
  "name": "Rajiv Bagai",
  "homepage": "https://www.wichita.edu/profiles/academics/engineering/SoC/Bagai-Rajiv.php",
  "status": "success",
  "content": "Rajiv Bagai Rajiv Bagai Professor & PhD Graduate Coordinator College of Engineering School of Computing (316) 978-3915 rajiv.bagai@wichita.edu Office hours: 2:45 - 3:15 p.m. Mondays and Wednesdays Room 215, Jabara Hall Main Campus Overview Dr. Rajiv Bagai was born in New Delhi, India.  He went to school at the Delhi Public School, at Mathura Road, New Delhi, and completed his Bachelor's in Computer Science at the Birla Institute of Technology & Science, Pilani, India.  After a 2-year stint as a Programmer/Analyst at the Tata Engineering & Locomotive Company in Mumbai, India, he went on to obtain a Master's and PhD in Computer Science at the University of Victoria, Canada.  He is currently a Professor of Computer Science at the Wichita State University, USA. He likes to teach a variety of Computer Science courses.  His current research interests are in Data Privacy and Web Anonymity, but in the past he has performed research in Incomplete and/or Inconsistent Databases, Data Models, Deductive Databases, Logic Programming, and Programming Languages. Dr. Bagai enjoys performing joint research with students of all levels, BS, MS, or PhD, and heartily welcomes new students into his research group.  His friendly and hands-off style of student supervision is best suited for student collaborators with a high level of self-motivation to learn and grow.  The \"Publications\" section below shows many of his research publications with current and former students. He has a passion for traveling to new parts of the world, enjoys programming in various languages, playing chess, racquetball and, lately, has even taken to singing on stage! Make sure to check out some of his performance videos in the \"Other Interests\" section below :) Information Academic Interests and Expertise Education Ph.D. Computer ScienceUniversity of Victoria, Victoria, CanadaDissertation Area: Ordinal-Theoretic Properties of Logic ProgramsAdvisor: Prof. Maarten H. van Emden M.S. Computer Science University of Victoria, Victoria, CanadaThesis Area: Compilation of Dataflow LanguagesAdvisors: Prof. R. N. S. Horspool and Prof. W. W. Wadge B.Sc. Computer ScienceBirla Institute of Technology and Science, Pilani, India Higher Secondary (Grade 11)Delhi Public School, New Delhi, India Areas of Research Interest Present & Past Research Areas Data Privacy Web Anonymity Data Models Inconsistent and/or Incomplete Databases Deductive Databases Logic Programming Programming Languages Areas of Teaching Interest Undergraduate Overview of Computer Science Data Structures Discrete Mathematics Introduction to Computer Networking Computer Organization and Architecture Operating Systems Analysis of Algorithms Formal Languages and Automata Theory Concepts of Programming Languages ARM and Intel 80X86 Assembly Programming Programming in C++, Java, Python Graduate Web Programming Compiler Construction Network Programming Introduction to Databases Multimedia Database Systems Database Query Processing and Optimization Theory of Logic Programming Artificial Intelligence Theory of Computation Programming Language Semantics Advanced Algorithm Analysis Publications Refereed Papers * indicates a student co-author B. Parupati*, S. Kshirsagar, R. Bagai, and A. Dutta. Towards Robust Building Damage Detection: Leveraging Augmentation and Domain Adaptation. In Proceedings of the 17th IEEE Green Technologies Conference, Wichita, Kansas, USA, pp. 163-167, 2025. R. Bagai, E. Weber*, and V. Thammanna Gowda*. Data Sanitization for t-Closeness over Multiple Numerical Sensitive Attributes. Transactions on Data Privacy, vol. 16, no. 3, pp. 191-210, 2023. V. Thammanna Gowda* and R. Bagai. Generating t-Closed Partitions of Datasets with Multiple Sensitive Attributes. In Proceedings of the 7th International Conference on Cryptography, Security and Privacy (CSP), Tianjin, China, pp. 107-111, 2023. V. Thammanna Gowda*, R. Bagai, G. Spilinek*, and S. Vitalapura*. Efficient Near-Optimal t-Closeness With Low Information Loss. In Proceedings of the 11th IEEE Conference on Intelligent Data Acquisition and Advanced Computing Systems: Technology and Applications (IDAACS), Cracow, Poland, pp. 494-498, 2021. (Best-Paper Award Winner) R. Bagai, S. Layton*, S. Gampa*, and K. Chandrashekar*. Maximum Diversity in Web Application User Action Privacy. In Proceedings of the 10th IEEE Annual Ubiquitous Computing, Electronics & Mobile Communication Conference (UEMCON), New York, USA, pp. 718-724, 2019. (Best-Paper Award Winner) H. Lu* and R. Bagai. Cache Enhanced Anonymity Systems Against Probabilistic Attacks. Communications in Computer and Information Science, Springer-Verlag, vol. 860, pp. 323-332, 2018. (Proceedings of the 25th International Conference on Computer Networks, Gliwice, Poland, Acceptance: 34 / 90 = 37.8%). R. Bagai, N. Malik*, and M. Jadliwala. Measuring Anonymity of Pseudonymized Data after Probabilistic Background Attacks. IEEE Transactions on Information Forensics and Security, vol. 12, no. 5, pp. 1156-1169, 2017. R. Bagai and H. Lu*. Measuring Client-Server Anonymity. Communications in Computer and Information Science, Springer-Verlag, vol. 608, pp. 96-106, 2016. B. Tang, R. Bagai, and H. Lu*. An Improved Statistical Disclosure Attack. International Journal of Granular Computing, Rough Sets and Intelligent Systems (IJGCRSIS), vol. 4, no. 1, pp. 30-38, 2015. R. Bagai and K. Chandrashekar*. User Privacy Enhancement in Modern Web Applications. In Proceedings of the 7th IEEE International Conference on Computational Intelligence, Communication Systems and Networks (CICSyN-2015), Riga, Latvia, pp. 127-132, 2015. R. Bagai, B. Tang, A. Khan*, and A. Samad*. A System-Wide Anonymity Metric with Message Multiplicities. International Journal of Security and Networks (IJSN), vol. 10, no. 1, pp. 20-31, 2015. B. Tang, R. Bagai, FNU Nilofar*, and M. Yildrim. A Generalized Data Preservation Problem in Sensor Networks - A Network Flow Perspective. In Proceedings of the 8th International Workshop on Wireless Sensor, Actuator and Robot Networks (WiSARN-2014, in conjunction with AdHocNow-2014), Benidorm, Spain, pp. 246-259, 2014. R. Bagai, B. Tang, and E. Kim*. Effectiveness of Probabilistic Attacks on Anonymity of Users Communicating via Multiple Messages. IEEE Systems Journal, vol. 7, no. 2, pp. 199-210, 2013. X. Xue*, X. Hou*, B. Tang, and R. Bagai. Data Preservation in Intermittently Connected Sensor Networks with Data Priority. In Proceedings of the 10th IEEE International Conference on Sensing, Communication and Networking (SECON-2013), New Orleans, USA, pp. 65-73, 2013 (Acceptance: 51 / 280 = 18.2%). R. Bagai and N. Jiang*. Measuring Anonymity by Profiling Probability Distributions. In Proceedings of the 11th IEEE International Conference on Trust, Security and Privacy in Computing and Communications (TRUSTCOM-2012), Liverpool, UK, pp. 366-374, 2012 (Acceptance: 100 / 358 = 27.9%). R. Bagai, H. Lu*, R. Li*, and B. Tang. An Accurate System-Wide Anonymity Metric for Probabilistic Attacks. In Proceedings of the 11th Privacy Enhancing Technologies Symposium (PETS-2011), Waterloo, Canada, pp. 117-133, 2011 (Acceptance: 15 / 61 = 24.6%). N. Jaggi, U. M. Reddy*, and R. Bagai. A Three Dimensional Sender Anonymity Metric. International Journal of Security and Networks (IJSN), vol. 6, nos. 2/3, pp. 77-89, 2011. (Best-Paper Award Winner) R. Bagai and B. Tang. Data Caching for Enhancing Anonymity. In Proceedings of the 25th IEEE International Conference on Advanced Information Networking and Applications (AINA-2011), Singapore, pp. 135-142, 2011 (Acceptance: 106 / 318 = 33.3%). N. Jaggi, U. M. Reddy*, and R. Bagai. A Three-Dimensional Approach Towards Measuring Sender Anonymity. In Proceedings of the 1st IEEE International Workshop on Security in Computers, Networking and Communication (SCNC-2011, in conjunction with IEEE INFOCOM-2011), pp. 1011-1016, Shanghai, China, 2011. R. Bagai, H. Lu*, and B. Tang. On the Sender Cover Traffic Countermeasure against an Improved Statistical Disclosure Attack. In Proceedings of the 8th IEEE/IFIP International Conference on Embedded and Ubiquitous Computing (EUC-2010), Hong Kong, China, pp. 555-560, 2010 (Acceptance: 55 / 139 = 39.6%). R. Bagai. Paraconsistent Database Query Languages. In Proceedings of the 2nd International Conference on Computational Intelligence, San Francisco, USA, pp. 248-253, 2006. R. Bagai. Detecting Infinite SLD-Derivations in Definite Logic Programs. In Proceedings of the 2nd International Conference on Neural Networks and Computational Intelligence, Grindelwald, Switzerland, pp. 79-83, 2004. R. Bagai. Paraconsistent Domain-Relational Calculus. In Proceedings of the International Conference on Neural Networks and Computational Intelligence, Cancun, Mexico, pp. 25-29, 2003. R. Bagai and G. S. Randhawa*. Querying Temporal Paraconsistent Databases. In Proceedings of the International Conference on Artificial and Computational Intelligence, Tokyo, Japan, pp. 148-154, 2002. R. Bagai and S. J. Kelley*. Paraconsistency in Object-Oriented Databases. Lecture Notes in Computer Science, Springer-Verlag, vol. 2311, pp. 141-150, 2002. R. M. Bates and R. Bagai. Text Editing, Syntax-Directed Editing. In Proceedings of the 2nd International Conference on Advances in Infrastructure for E-Business, E-Science and E-Education on the Internet, L'Aquila, Italy, Electronic Proceedings ISBN: 88-85280-61-7, paper no. 197, August 2001. N. Tran and R. Bagai. Efficient Representation and Algebraic Manipulation of Infinite Relations in Paraconsistent Databases. Information Systems, Elsevier Science, vol. 25, no. 8, pp. 491-502, 2000. R. Bagai. Tuple Relational Calculus for Paraconsistent Databases. Lecture Notes in Artificial Intelligence, Springer-Verlag, vol. 1952, pp. 409-416, 2000. N. Tran and R. Bagai. Infinite Relations in Paraconsistent Databases. Lecture Notes in Computer Science, Springer-Verlag, vol. 1691, pp. 275-287, 1999. R. Bagai. A Query Construct for Paraconsistent Databases. I",
  "content_length": 17180,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:00"
}