{
  "name": "Rajit Manohar",
  "homepage": "http://csl.yale.edu/~rajit",
  "status": "success",
  "content": "Rajit Manohar Rajit Manohar B.S., M.S., Ph.D. (1998) Caltech John C. Malone Professor of Electrical and Computer Engineering Professor of Computer Science Computer Systems Lab, Yale Wu-Tsai Institute, Yale Contact Information: 504 Dunham Lab, Yale Engineering 10 Hillhouse Avenue New Haven, CT 06520-8267 Office: (203) 432-7040 Fax: (203) 432-7481 If you are an EECS major at Yale and have questions, please send me an email so that we can find a time to meet. Research: (group, chips) My group is part of the Computer Systems Lab at Yale. We are also members of the Wu-Tsai Institute where we are part of the Neurocomputation and Machine Intelligence center. Asynchronous VLSI tools (docs) I primarily work on asynchronous VLSI design and architecture. I am also interested in a number of other subjects including concurrency, formal methods, programming language semantics, design automation, and cognitive systems. Publications (selected) / News / Bio / CV Teaching: My teaching over the years has been in the general area of computer systems. I will be teaching ECE 4250/ENAS 8750 in Fall 2025. Class project chips! In terms of why I teach classes the way I do, I like some of the opinions in EWD 1305. Prior to joining Yale, I was on the Cornell faculty from 1998 to 2016 where I received the Tau Beta Pi and Cornell Society of Engineers Excellence in Teaching Award (2000), the IEEE Teacher of the Year Award (2001), the Sonny Yau '72 Excellence in Teaching Award (2001), the Michael Tien '72 Excellence in Teaching Award (2004), the Ruth and Joel Spira Excellence in Teaching Award (2005, 2009), the Kenneth A. Goldman '71 Excellence in Teaching Award (2012), and the Cornell Tech Professor of the Year Award (2016). I was named a Stephen H. Weiss Presidential Fellow (2014)—Cornell's highest teaching award—for \"a sustained record of effective, inspiring, and distinguished teaching of undergraduate students.\" For students seeking letters of recommendation For prospective graduate students For prospective summer interns Summer Schools: We have developed open-source design automation tools for the design and implementation of asynchronous circuits and systems. To demonstrate the tools as well as introduce asynchronous design to students/researchers, I have been regularly organizing a summer school on asynchronous design. The content has been archived (slides, video, and demo examples) and is available. 2022: first summer school (content) 2024: second summer school (content) Service: Major service activities at Yale include: Deputy Dean for Innovation and Entrepreneurship, Yale Engineering, 7/2024- Faculty chair, Yale Center for Research Computing Steering Committee, 7/2024- Deputy Dean for Research, Yale Engineering, 1/2023-6/2024 Member, Strategic Planning Committee for Yale Engineering, 2020-2021 Member, FAS Senate (and Executive Committee), 7/2017-6/2019 Started Yale's Computer Systems Lab, 2017 Prior to joining the Yale faculty, I was on the Cornell faculty for 18 years. The following lists some of my major service activities at Cornell. Associate Dean for Research, Cornell Tech, 1/2015-4/2015 Associate Dean for Academic Affairs, Cornell Tech, 11/2012-12/2014 Co-Chair (with David Shmoys), Academic Planning Committee for Cornell Tech, 2/2012-8/2013 Associate Dean for Research and Graduate Studies, College of Engineering, Cornell, 1/2010-6/2010 (interim), 7/2010-6/2012 Member, Technology Transfer Advisory Committee, Cornell, 7/2008-12/2013 Started Cornell's Computer Systems Lab (with Mark Heinrich), 1998 Personal: You can find out a bit about me if you like. Here are some quotations, puzzles, and poems. Some local FreeBSD tweaks. I founded Achronix Semiconductor Corporation, the multi-GHz FPGA company that was based on asynchronous FPGA technology developed by my research group (John Teifel's Ph.D. thesis).",
  "content_length": 3854,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:01"
}