{
  "name": "Raju Halder",
  "homepage": "https://iitp.ac.in/~halder",
  "status": "success",
  "content": "Raju Halder | HomepageYou need to enable JavaScript to run this app.Dr. Raju HalderAssociate ProfessorDepartment of Computer Science & EngineeringIndian Institute of Technology Patna, India halderiitp•ac•inOffice R-406, 4th Floor, Block 3 +91 612 3028009Blockchain & Robotics (PLANR) Lab R-502, 5th Floor, Block 3 +91 612 3028889  •  Publications  •  Tools & Data  •  PLANR Lab  •  GalleryPublicationsTools & DataPLANR LabGallery   •  Research & Publications  •  Education, Awards & Honours  •  Teaching  •  Professional ActivitiesResearch & PublicationsEducation, Awards & HonoursTeachingProfessional ActivitiesNews UpdatesNov 14, 2024 • Congratulation! Arnab Mukherjee has successfully defended his M.Tech. By Research thesis entitled \"Blockchain-enabled ABDM (Ayushman Bharat Digital Mission) with modular and library-agnostic Federated Learning\". Wising him all the best for her new journey ahead!Sept 25, 2024 • Delivered an invited talk entitled \"Security Vulnerabilities in Smart Contracts\" in the FDP organized by G H Raisoni Institute of Engineering and Business Management, Jalgaon (Sept 25, 2024).Aug 6, 2024 • Delivered an invited talk entitled \"Synergizing Machine Learning and Blockchain\" in the AICTE-ATAL sponsored FDP at Gopal Narayan Singh University, Rohtas, Bihar (6th Aug 2024).May 15, 2024 • Congratulation! Swagatika Sahoo has successfully defended her PhD thesis entitled \"Towards Scalable, Interoperable, and Secure Blockchain-based Decentralized Applications\". Wising her all the best for her new journey at KIIT!Mar 10, 2024 • Delivered an invited talk entitled \"Recent Trends in Blockchain Technology\" in the International Conference on Women in Multifaceted Research (ICWMR 2024), organised by Gopal Narayan Singh University, Rohtas, Bihar (March 10, 2024).Mar 1, 2024 • Delivered an invited talk entitled \"Formal Analysis and Verification of Blockchain Smart Contracts\" in the International Symposium on Security Engineering for Trusted Cyberspace (ISSETC 2024), organised by CDAC Patna at Rajgir, Bihar (Mar 1, 2024).Feb 29, 2024 • Congratulation to my Ph.D. student Md. Tauseef Alam for receiving best poster presentation award (CSE) in Research Scholar Day 2024!Jan 27, 2024 • Delivered an invited talk entitled \"Blockchain Technology and Its Role in the Sustainability of Supply Chain Management\" in one day Webinar on \"Recent trend in AI and Blockchain Technology Application in Supply Chain Management to meet Sustainable Development Goals\", organized by Operational Research Society of India Durgapur Chapter (Jan 27, 2024).Nov 27, 2023 • Delivered an invited talk entitled \"Bitcoin Working Principle: Transactions, Validation, and Mining\" in the FDP organized by VIT Vellore (Nov 27, 2023).Oct 11, 2023 • Delivered an invited talk entitled \"Safety and Security Issues in Ethereum Decentralized Application and Possible Preventive Measures\" in the FDP organized by G H Raisoni Institute of Engineering and Business Management, Jalgaon (Oct 11, 2023).July 10, 2023 • Delivered an invited talk entitled \"Introduction to Bitcoin and Blockchain Basics\" in the DST SERB-sponsored workshop organized by Punjab Engineering College Chandigarh (July 10, 2023).July 01, 2023 • Work entitled \"FedRLChain: Secure Federated Deep Reinforcement Learning with BlockChain\" is accepted for publication in \"IEEE Transactions on Services Computing\" (Core Ranking: A*). Congratulation to the team!May 18, 2023 • Delivered an invited talk entitled \"Safety & Security Issues in Ethereum Decentralized Application and Possible Preventive Measures\" in the FDP organized by Tulsiramji Gaikwad - Patil College of Engineering & Technology, Nagpur (May 18, 2023).Apr 3, 2023 • Delivered an invited talk entitled \"Blockchain Technology and Its Applications\" in 3-day workshop on Cyber Crime and Cyber Law organized by Mizorum University (3rd Apr 2023).Feb 15, 2023 • Delivered an invited talk entitled \"Safety and Security issues in Ethereum Decentralized Application and Possible preventive measures\" in FDP organized by NITTTR Chandigarh (15th Feb 2023).Jan 3, 2023 • Delivered an invited talk entitled \"Introduction to Bitcoin consensus\" at Kamaraj College of Engineering and Technology, Tamil Nadu (3rd Jan 2023).Nov 5, 2022 • Happy to share that Mr. Chandra Mohan Kumar (Director, Digital Practice, Financial Services Capgemini India Limited, Bengaluru) has delivered an interesting talk online entitled: \"Metaverse and its Implication in Insurance Industry\" for the students at IITP Patna. (5th Nov 2022).Oct 13, 2022 • Delivered an invited talk entitled \"Blockchain Technology: Bitcoin Vs. Ethereum\" in the AICTE-ATAL sponsored course at Army Institute of Technology, Pune (13th Oct 2022).Sept 21, 2022 • Delivered an invited talk on Blockchain Technology in the AICTE-ATAL sponsored course on \"Blockchain in Smart City: Emerging Technologies for the Next Decade and Beyond\" at NIT Raipur (21 Sept 2022).Sept 10, 2022 • Congratulations to my research team (Oindrila Bhadra, Swagatika Sahoo, and Chandra Mohan Kumar) for receiving BEST PAPER award at ACSS 2022. As reward, e-book gift voucher of 250 Euro from Springer Nature has been received.Aug 2, 2022 • Delighted to serve as an invited speaker in the FDP organized by Ajay Kumar Garg Engineering College, Ghaziabad, UP.July 30, 2022 • Congratulation! Mrs. Sapana Rani has successfully defended her PhD thesis entitled \"Towards Persistency, Distributiveness and Data Format Independency in Database Watermarking\". Wising her all the best for her new journey ahead!July 14, 2022 • Delivered an invited talk entitled \"Blockchain Technology: A Potential Game Changer\" online in the FDP organized by Haldia Institute of Technology, West Bengal.July 10, 2022 • Delivered an invited talk entitled \"Blockchain Revolution: Reshaping the Digital World\" online in the FDP organized by GITA Autonomous College, Bhubaneswar.July 1, 2022 • Successfully concluded online GIAN Course on \"A Proof and Refinement based Development for Cyber-Physical Systems\" at IIT Patna (June 20, 2022 - July 01, 2022).May 31, 2022 • We are going to organize a ten days ONLINE GIAN course on \"A Proof and Refinement based Development for Cyber-Physical Systems\" at IIT Patna from June 20, 2022 - July 01, 2022 sponsored by the Ministry of Education, Govt. of India. The foreign faculty is Dr. Neeraj Kumar Singh, Associate Professor in Computer Science at INPT-ENSEEIHT and member of the ACADIE team at IRIT, France (http://singh.perso.enseeiht.fr).May 4, 2022 • Cyber Jagrookta Diwas (Ministry of Education, Govt. of India): Delivered a talk online on \"Blockchain Technology for Cyber-Security and Safeguarding Electronic Payments\" (4 May 2022).Apr 15, 2022 • Successfully concluded online GIAN Course on \"A Guided Tour to Static Program Analysis: State-of-the-Art Tools and Techniques\" at IIT Patna (4 - 15 Apr 2022).Apr 11, 2022 • Congratulation to my Ph.D. student Md Tauseef Alam for receiving the Prime Minister's Research Fellowship (PMRF) in December 2021 cycle.March 24, 2022 • Congratulation to my Ph.D. student Fajge Akshay Madhukarrao for receiving best poster presentation award (CSE) in Research Scholar Day 2022!Feb 10, 2022 • Delivered an invited talk on ROS in the AICTE-ATAL sponsored course on \"Robotics and Artificial Intelligence\" at LBRCE, Mylavaram, Andhra Pradesh (10 Feb 2022).Dec 30, 2021 • We are going to organize a ten days ONLINE GIAN course on \"A Guided Tour to Static Program Analysis: State-of-the-Art Tools and Techniques\" at IIT Patna from 4 April 2022 - 15 April 2022 sponsored by the Ministry of Education, Govt. of India. The foreign faculty is Prof. Agostino Cortesi, full professor, Ca’ Foscari University of Venice, Italy.Dec 10, 2021 • Delivered invited talks on Blockchain Technology in the AICTE-ATAL sponsored course on \"Blockchain and its Security Perspectives\" at IIITG Guwahati (6-10 Dec 2021).Dec 6, 2021 • Delivered an invited talk on Blockchain Technology in the AICTE-ATAL sponsored course on \"Blockchain Technology and its Applications\" at IIITDM Kancheepuram (6 Dec 2021).Oct 01, 2021 • Congratulation! Md. Imran Alam has successfully defended his PhD thesis entitled \"Formal Analysis and Verification of Database Applications for Safety and Security Properties\". Wising him all the best for his new journey ahead!Sept 23, 2021 • Delivered a lecture on Robot Operating System (ROS) in the AICTE-ATAL sponsored Course on \"Mobile Robotics\" at IITP (23 Sept 2021).Aug 25, 2021 • Delivered an invited talk on \"Blockchain Technology: A Potential Game Changer\" online organized by G. N. S. University, Rohtas, Bihar.July 13, 2021 • Delivererd Keynote Talk on \"Introduction to Blockchain Technology: A Potential Game Changer\" in International Symposium on Blockchain Technology organized by Bharat Institute of Engineering and Technology, Hyderabad (13-15 July 2021).June 18, 2021 • Delivered a lecture on Robot Operating System (ROS) in the AICTE-ATAL sponsored Course on \"Mobile Robotics\" at IITP (18 June 2021).March 16, 2021 • Delighted to serve as invited speaker in QIP Sponsored Short Term Course on \"Blockchain: Business Foundations and Solution Architectures\" conducted by IIT Indore (24-25 March 2021).March 20, 2021 • Congratulation to my Ph.D. student Swagatika Sahoo for receiving best poster presentation award (CSE) in Research Scholar Day 2021!March 16, 2021 • Delighted to serve as invited speaker in AICTE-STTP on \"Security in Decentralized Systems and Smart Contracts\" conducted by NIT Meghalaya (15-16 March 2021).Jan 30, 2021 • Delivered an invited talk on \"Blockchain Technology: A Potential Game Changer\" online organized by Department of Computer Science, Theivanai Ammal College for Women (Autonomous), Villupuram.Jan 18, 2021 • Delivered a lecture on Blockchain Technology in ATAL FDP \"Blockchain Technology - Future of Cyber Security\" conducted by Excel Engineering College, Tamil Nadu (18 Jan 2021).Dec 25, 2020 • Work entitled \"A Deductive Reasoning Approach for Database Applications usin",
  "content_length": 27101,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:04"
}