{
  "name": "Rakibul Hasan 0001",
  "homepage": "https://rakib062.github.io",
  "status": "success",
  "content": "About me - Welcome Rakibul HasanAssistant Professor @ Arizona State University Follow AZ Email Twitter LinkedIn Stackoverflow Google Scholar ORCIDThis site is no longer actively maintained. Please checkout our lab websiteWelcome to my website! I am a Tenure-track Assistant Professor at the School of Computing and Augmented Intelligence in the Arizona State University. I completed my Ph.D. in Computer Science from Indiana University Bloomington, under the supervision of Prof. Apu Kapadia. Prior to that I obtained my bachelor in Computer Science from Bangladesh University of Engineering and Technology in 2012. My resume.Research interestsI conduct multidisciplinary research at the intersection of privacy/security, computational social science, cognitive psychology, machine learning, and statistical frameworks for causal inference.I am looking for PhD/Masters students to join my group from Spring or Fall 2022. Prospective students, please look at my research statement to get an overview of the research projects I will likely focus in the next 2-4 years. If you are interested, please contact me with your resume, transcripts, and a short description of your research interest.Below are some reasons why you might consider coming to ASU:Research is inherently a collaborative process. Being in the right environment among the right people can benefit you immensely to generate, curate, and revise ideas, by incorporating feedback from peers who come from diverse backgrounds. ASU creates such environments through organizations (such as SEFCOM and Global Security Initiative where researchers from within sub-disciplines of CS as well as other disciplines come together and tackle important and timely problems.My research is focused on solving security/privacy issues of technology, but highly multidisciplinary, touching CS, Cognitive Psychology, Computational Social Science, Network Measurement, and HCI. If your research area intersects with this set, there should be a research problem that you would find interesting and engaging, two very important factors for succeeding in a PhD program.Weather is a very important element for good quality of living. Arizona has very pleasant temperatures throughout the year; it does get very hot in the summer, but only for ~2 months. No snow, little rain, always sunshine.Another factor for a good life IMO is access to good food. Being very close to Phoenix (~15 min drive), one of the largest cities in the USA, it provides easy access to international cuisine and grocery stores.Arizona is an incredibly beautiful state, and surrounded by other beautiful states (Utah, Colorado, California). You can visit amazing national parks on the weekends.I consider myself as a proponent of work life balance in academia, and will try my best to make the PhD journey enjoyable and fulfilling to my students.NewsNovember 2021Our research on investigating and mitigating privacy issues of Educational Technologies was accepted at PETS 2022.January 2021Our Oakland'20 paper was a runner-up for the 5th CNIL-INRIA Privacy Award.December 2020Paper accepted at CHI 2021.Septempber 2020Succesfully defended my dissertation!",
  "content_length": 3168,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:06"
}