{
  "name": "Ralf Schlüter",
  "homepage": "http://www-i6.informatik.rwth-aachen.de/~schluter",
  "status": "success",
  "content": "Ralf Schlüter Personal Publications Contact Personal Disclaimer Homepage of Priv.-Doz. Dr. rer. nat. Ralf Schlüter, Academic Director Welcome to the homepage of Ralf Schlüter. Currently I am a senior researcher at the Lehrstuhl Informatik 6 in the Computer Science Department at RWTH Aachen University. Research Interests automatic speech recognition (ASR) end-to-end ASR architectures acoustic and stochastic modeling discriminative training decision theory confidence measures machine learning pattern recognition signal analysis Short CV Ralf Schlüter serves as Academic Director and Lecturer (Privatdozent) in the Department of Computer Science of the Faculty of Computer Science, Mathematics and Natural Sciences at RWTH Aachen University. He leads the Automatic Speech Recognition Group at the Lehrstuhl Informatik 6: Human Language Technology and Pattern Recognition. He studied Physics at RWTH Aachen University and Edinburgh University and received his Diploma in Physics (1995), Dr. rer. nat. in Computer Science (2000) and Habilitation for Computer Science (2019), each at RWTH Aachen University. Dr. Schlüter works on all aspects of automatic speech recognition and has been leading the scientific work of the Lehrstuhl Informatik 6 in the area of automatic speech recognition in many large national and international research projects. Speech Technology Projects For the following projects, the speech recognition research of the Lehrstuhl Informatik 6 at RWTH Aachen University is/was coordinated by Ralf Schlüter. For details on the projects please refer to our projects page. SEQCLAS, EU project (ERC H. Ney) LISTEN, EU project BABEL, US IARPA project Broad Operational Language Translation (BOLT), US DARPA project TransLectures, EU project EU-Bridge, EU Integrated Project (IP) QUAERO, French project funded by OSEO SCALE, EU project JUMAS, EU project Global Autonomous Language Exploitation (GALE), US DARPA project Technology and Corpora for Speech to Speech Translation (TC-STAR), EU Integrated Project (IP) Improving Core Speech Recognition Technology (CORETEX), EU project Verbmobil II, German BMBF project Structured Acoustic Models for Speech Recognition, German DFG project Activities Team leader of the Automatic Speech Recognition working group at Lehrstuhl Informatik 6, RWTH Aachen University Teaching at the Lehrstuhl Informatik 6 - Computer Science Department. Courses given include: proseminar data compression lecture automatic speech recognition lecture advanced methods for automatic speech recognition lecture pattern recognition and neural networks lecture digital processing of speech and image signals seminars in the area of human language technology and pattern recognition Study advisor for the following study programs offered by the Computer Science Department at RWTH Aachen University: Bachelor Computer Science Subject Editor for: Speech Communication, 2013-2018 Reviewed for: Speech Communication IEEE Journal on Audio, Speech, and Language Processing (formerly Speech and Audio Processing) IEEE Journal on Signal Processing IEEE Signal Processing Letters Interspeech IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP) IEEE Automatic Speech Recognition and Understanding Workshop (ASRU) Project reviewer for the European Commission Last modified: June 20, 2018.",
  "content_length": 3342,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:12"
}