{
  "name": "Ralf Martin Zimmer",
  "homepage": "https://www.bio.ifi.lmu.de/mitarbeiter/ralf-zimmer/index.html",
  "status": "success",
  "content": "Prof. Dr. Ralf Zimmer - Lehr- und Forschungseinheit Bioinformatik - LMU München Suche Hinweise zur Datenübertragung bei der Google™ Suche Login Logout Links und Funktionen www.lmu.de Institut für Informatik Studiengang Bioinformatik Sitemap Navigationspfad Startseite MitarbeiterPeople Ralf Zimmer Hauptnavigation AktuellesNews MitarbeiterPeople Caroline Friedel Armin Hadziahmetovic Volker Heun Markus Joppich Samuel Klein Felix Offensperger Katharina Reinisch Evi Sinn Frank Steiner Elena Weiß Ralf Zimmer Alumni StudiumStudies PublikationenPublications ForschungResearch DrittmittelprojekteFunded Projects Software/Services Intern FAQ KontaktContact druckenprint Inhaltsbereich Prof. Dr. Ralf Zimmer E-Mail: Telefon: Phone: +49-89-2180-4052 Fax: +49-89-2180-99-4052 Mobil: Mobile: +49-152-0152-3334 Adresse: Address: Lehr- und Forschungseinheit Bioinformatik Teaching and Research Unit Bioinformatics Institut für Informatik Ludwig-Maximilians-Universität München Amalienstr. 17, 80333 München Munich, Germany Raum: 4-01, 4. Etage Allgemeine Sprechstunde: Office hour: DienstagTuesday, 12:00-13:00 Fachstudienberatung Bioinformatik: Counseling Bioinformatics: DienstagTuesday, 13:00-14:00 Bioinformatik: Studieren und Promovieren Studying and PhD in Bioinformatics Weitere Informationen zu den Münchner Bioinformatik-Studiengängen More Information on the Munich Bioinformatics Programmes Weitere Informationen zum internationalen DFG Graduiertenkolleg RECESS More Information on the DFG International Research Training Group RECESS Forschung Research siehe see Forschung Research Software+Webservices siehe see Software Software LehreTeaching siehe see Regelmäßige Lehrveranstaltungen Regular Teaching Courses aktuelles Semester current term Betreute DoktorarbeitenSupervised PhDs 2018ThesesEvi Berchtold, Methods for explaining biological systems and high-throughput data., PhD Thesis, LMU München, 2018. PDFURLBiBTex 2017ThesesTobias Petri, Expression data analysis and regulatory network inference by means of correlation patterns, PhD Thesis, LMU München, 2017. E-DissBiBTex 2016ThesesRobert Pesch, Cross-Species Network and Transcript Transfer, PhD Thesis, Ludwig-Maximilians-Universität München, 2016. E-DissBiBTex Thomas Bonfert, Context-based RNA-seq mapping, PhD Thesis, LMU München, 2016. E-DissBiBTex Ludwig Geistlinger, Network-based analysis of gene expression data, PhD Thesis, LMU München, 2016. E-DissBiBTex Benjamin Albrecht, Computing Hybridization Networks Using Agreement Forests, PhD Thesis, Ludwig-Maximilians-Universität München, 2016. E-DissBiBTex 2014ThesesFlorian Erhard, Algorithmic Methods for Systems Biology of Herpes-viral microRNAs, PhD Thesis, LMU München, 2014. E-DissBiBTex 2013ThesesLukas Windhager, Modeling of Dynamic Systems with Petri Nets and Fuzzy Logic, PhD Thesis, LMU München, 2013. E-DissBiBTex Gergely Csaba, Context Based Bioinformatics, PhD Thesis, LMU München, 2013. E-DissBiBTex 2012ThesesHaroon Naeem, Activity of microRNAs and transcription factors in Gene Regulatory Networks, PhD Thesis, LMU München, 2012. BiBTex 2009ThesesFabian Birzele, Alternative Splicing and Protein Structure Evolution, PhD Thesis, LMU München, 2009. E-DissertationBiBTex Orland Gonzalez, Reconstruction, Modeling and Analysis of Haloarcheal Metabolic Networks, PhD Thesis, LMU München, 2009. E-DissertationBiBTex Caroline C. Friedel, Analysis of High-Throughput Data - Protein-Protein Interactions, Protein Complexes and RNA Half-life, PhD Thesis, LMU München, 2009. PDFUniversity LibraryBiBTex Luca Chiarabini, Program Development by Proof Transformation, PhD Thesis, LMU München, 2009. E-DissertationBiBTex 2008ThesesSimon W. Ginzinger, Bioinformatics Methods for NMR Chemical Shift Data, PhD Thesis, LMU München, 2008. E-DissertationBiBTex 2007ThesesKatrin Fundel, Text Mining and Gene Expression Analysis - Towards Combined Interpretation of High Throughput Data, PhD Thesis, LMU München, 2007. BiBTex Johannes Fischer, Data Structures for Efficient String Algorithms, PhD Thesis, LMU München, 2007. E-DissertationBiBTex Jan Erik Gewehr, New Methods for the Prediction and Classification of Protein Domains, PhD Thesis, Ludwig-Maximilians-Universität München, 2007. BiBTex 2006ThesesFlorian Sohler, Contextual Analysis of Gene Expression Data, PhD Thesis, LMU München, 2006. BiBTex 2005ThesesNiklas Von Öhsen, Profile-Profile alignment for remote homology and domain detection of proteins, PhD Thesis, Ludwig-Maximilians-Universität München, 2005. BiBTex 2004ThesesDaniel Hanisch, New Analysis Methods for Gene Expression Data via Construction and Incorporation of Biological Networks, PhD Thesis, Ludwig-Maximilians-Universität München, 2004. BiBTex Dorothee Liebich, Packungsprobleme bei Proteinen, PhD Thesis, Friedrich-Wilhelms-Universität Bonn, 2004. BiBTex 2003ThesesAlexander Zien, Computational Methods for Gene Expression Data Analysis, PhD Thesis, Friedrich-Wilhelms-Universität Bonn, 2003. BiBTex Betreute AbschlussarbeitenSupervised Theses 2025ThesesWenjia Zhong, Analysis of Plant microRNAs with Text Mining, Bachelor Thesis, LFE Bioinformatik, LMU München, 2025. BiBTex Alexandra Schubö, Multi-Omics Analysis of Multi-Stage Cell Regulation in Granulopoiesis, Master Thesis, LFE Bioinformatik, LMU München, 2025. BiBTex 2024PapersMoritz Mühlhofer, Felix Offensperger, Sarah Reschke, Georg Wallmann, Gergely Csaba, Evi Berchtold, Maximilian Riedl, Helmut Blum, Martin Haslbeck, Ralf Zimmer, Johannes Buchner, Deletion of the transcription factors Hsf1, Msn2 and Msn4 in yeast uncovers transcriptional reprogramming in response to proteotoxic stress, FEBS Letters, vol. 598, no. 6, pp. 635-657, 2024. DOIURLBiBTex ThesesLeonie Pohl, Beyond One Reference Genome: Pangenomic Variant Calling for Personalized Medicine, Master Thesis, LFE Bioinformatik, LMU München, 2024. BiBTex Aaron Roth, Efficient Read Mapping to a Pangenomic Reference Region with Splice-Graphs, Bachelor Thesis, LFE Bioinformatik, LMU München, 2024. BiBTex 2023ThesesDavid Wagemann, Conserved Binding Sites for Splicing and Alternative Splicing, Bachelor Thesis, LFE Bioinformatik, LMU München, 2023. BiBTex Xiheng He, Annotation and Assessment of AlphaFold2 Structures for Protein Isoforms, Bachelor Thesis, LFE Bioinformatik, LMU München, 2023. BiBTex Lukas Jaeger, Bioinformatic Methods of Individual and Pangenome Variations, Bachelor Thesis, LFE Bioinformatik, LMU München, 2023. BiBTex 2022PapersMarie-Sophie Friedl, Lara Djakovic, Michael Kluge, Thomas Hennig, Adam W. Whisnant, Simone Backes, Lars Dölken, Caroline C. Friedel, HSV-1 and influenza infection induce linear and circular splicing of the long NEAT1 isoform., PloS one, vol. 17, pp. e0276467, 2022. DOIBiBTex ThesesSamuel Klein, Cross Species protein Isoform Alignment (CSI-A), Master Thesis, LFE Bioinformatik, LMU München, 2022. BiBTex 2021ThesesFranziska Koller, Analysis of the role of cis-elements for changes in RNA polymerase II pausing, Bachelor Thesis, LFE Bioinformatik, LMU München, 2021. BiBTex Leonie Pohl, Integrative and Differential Analysis of Gene Expression and Alternative Splicing, Bachelor Thesis, LFE Bioinformatik, LMU München, 2021. BiBTex Alexandra Schubö, Analysis of miRNA-Mediated Virus-Host Interactions in SARS-CoV-2 Infections, Bachelor Thesis, LFE Bioinformatik, LMU München, 2021. BiBTex 2020ThesesArmin Hadziahmetovic, Assessment of Differential Alternative Splicing Methods, Master Thesis, LFE Bioinformatik, LMU München, 2020. BiBTex Elena Weiß, Robustness of Gene Set Enrichment or Dependence on Differential Expression Processing, Master Thesis, LFE Bioinformatik, LMU München, 2020. BiBTex 2018ThesesEvi Berchtold, Methods for explaining biological systems and high-throughput data., PhD Thesis, LMU München, 2018. PDFURLBiBTex Elena Weiß, Analysis of Predicted Mass Spectra and Peptide Identification, Bachelor Thesis, LFE Bioinformatik, LMU München, 2018. BiBTex Armin Hadziahmetovic, Methods for Interactive analysis of Differential Alternative Splicing (MIDAS), Bachelor Thesis, LFE Bioinformatik, LMU München, 2018. BiBTex 2017ThesesTobias Petri, Expression data analysis and regulatory network inference by means of correlation patterns, PhD Thesis, LMU München, 2017. E-DissBiBTex Stefan Weber, Enhanced Suffix Arrays: Analysis of Efficient Implementations in Java, Master Thesis, LFE Bioinformatik, LMU München, 2017. BiBTex 2016ThesesRobert Pesch, Cross-Species Network and Transcript Transfer, PhD Thesis, Ludwig-Maximilians-Universität München, 2016. E-DissBiBTex Thomas Bonfert, Context-based RNA-seq mapping, PhD Thesis, LMU München, 2016. E-DissBiBTex Ludwig Geistlinger, Network-based analysis of gene expression data, PhD Thesis, LMU München, 2016. E-DissBiBTex Daniel Schmitz, Algorithmische Erzeugung von NGS-Panels sowie Berechnung von Allelfrequenzen in der molekulargenetischen Diagnostik, Bachelor Thesis, LFE Bioinformatik, LMU München, 2016. BiBTex Florian Hölzlwimmer, Network-based Analysis of Expression Time Series, Bachelor Thesis, LFE Bioinformatik, LMU, 2016. BiBTex Benjamin Albrecht, Computing Hybridization Networks Using Agreement Forests, PhD Thesis, Ludwig-Maximilians-Universität München, 2016. E-DissBiBTex Marco Lombardi, Implementation and Evaluation of Algorithms for Approximate Tandem Repeats, Master Thesis, LFE Bioinformatik, LMU München, 2016. BiBTex Markus Gruber, Differential Analysis of Different Gene Products, Master Thesis, LFE Bioinformatik, LMU, 2016. BiBTex Alexander Grün, Differential Splicing in TCGA Data, Master Thesis, LFE Bioinformatik, LMU, 2016. BiBTex 2015PapersSabine Hünten, Markus Kaller, Friedel Drepper, Silke Oeljeklaus, Thomas Bonfert, Florian Erhard, Anne Dueck, Norbert Eichner, Caroline C. Friedel, Gunter Meister, Ralf Zimmer, Bettina Warscheid, Heiko Hermeking, p53-regulated networks of protein, mRNA, miRNA and lncRNA expression revealed by integrated pSILAC and NGS analyses., Molecular & cellular proteomics : MCP, 2015. DOIBiBTex ThesesVinicius H. Silva, Metabolic pathways and meat tendern",
  "content_length": 69360,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:13"
}