{
  "name": "Ralf Jung 0002",
  "homepage": "https://research.ralfj.de",
  "status": "success",
  "content": "Ralf Jung I am assistant professor at ETH Zürich, leading the Programming Language Foundations Lab. We are part of the Institute for Programming Languages and Systems in the Department of Computer Science. Previously, I completed my PhD at MPI-SWS and Saarland University in Saarbrücken, Germany; my advisor was Derek Dreyer. I also did a post-doc in the PDOS group at MIT CSAIL. I am looking to hire a post-doc for my group! Please see here for more information. My two main lines of work are about Rust and Iris. On the Rust side, me and my group are working (also in collaboration with the Rust language team) towards a solid formal foundation for the language, including in particular the unsafe parts. As part of this we are developing Miri, a practical tool for detecting Undefined Behavior bugs in unsafe Rust code, which has become a part of the standard toolbox of unsafe code authors. Meanwhile, MiniRust is our work-in-progress proposal for a precise specification of unsafe Rust, that I hope to integrate into an official Rust specification eventually. My long-term goal is to make unsafe Rust just as safe as safe Rust by means of formal verification based on rigorous foundations for all key components of the language. On the Iris side, I am continuing development of its logical foundations. We are making Iris fit for specifying and verifying programming languages at scale using a more modular approach. The long-term goal is for Iris to be able to handle the full scale of complexities that arise when doing foundational verification of real languages. For some more information, check out my research blog and my CV. In my free time, I like to run internet services myself and work on free software. This goes hand-in-hand with my pursuit of defending our privacy rights and our freedom in the digital world. See my personal website for more information.",
  "content_length": 1876,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:08"
}