{
  "name": "Ralf Möller 0001",
  "homepage": "https://www.ifis.uni-luebeck.de/index.php?id=moeller",
  "status": "success",
  "content": "Institute: IFIS | Institute of Information Systems Zur Navigation springenZum Content springenNews | Imprint | Data privacy statement | UnivIS | Quick Links |  Deutsch InstituteCooperationsTeamUmut ÇalıkyılmazTimon DohnkeRebecca von EngelhardtBjörn FilterNils FußgängerJinghua GroppeSven GroppeTobias GrothMattis HartwigNils Wendel HeinrichAkasha KesselHanieh KhorashadizadehMalte LuttermannJörg-Uwe MeyerJeannette MödlhammerNitin NayakSimon PaascheMichael PreisigNele RußwinkelSimon SchiffTim SchulzThomas SieversTobias WinkerAlumniTeachingLecturesThesesResearchGroupsFormer Research GroupsProjectsCompleted ProjectsPublicationsHabilitationenPromotionenPublications 2006-1977JobsContact IFIS | Institute of Information Systems University of Lübeck - IFIS - Institute Human-Aware AI The goal for Human-Aware AI is to develop intelligent systems that can work in synergy with human partners in complex dynamic environments.  When intelligent systems are human aware, this means that the system adapts to the task of the human partner in its variations, the situation in its dynamics and uncertainty and the cognitive state of the human partner in-the-loop. In our research group, dynamic mental models are developed that can, for example, anticipate the human in the interaction or identify intentions of the human partner. Human-Robot Interaction Human-Robot Interaction (HRI) has many facets. Social robots are increasingly coming into contact with people in everyday life. Their task is, for example, to help in education, in the public sector, in shopping centers or elderly people in nursing homes. It is therefore becoming increasingly important for human-robot interactions to find ways to achieve acceptance, good cooperation and collaboration. Quantum and Intelligent Computing In the Quantum and Intelligent Computing (QIC) research group, we deal with topics related to quantum computing, artificial intelligence, data and information science with and without hardware accelerators. This involves software and frameworks, high-level quantum programming languages including simulators and optimizations as well as quantum applications including the acceleration of data management tasks. The Institute of Information Systems (IFIS) is one of the Institutes of Computer Science at the Department of Computer Science and Engineering at the University of Lübeck and was established in 1993 under the leadership of Prof. Dr. Volker Linnemann as the first Computer Science Institute at the University of Lübeck. Prof Dr. Ralf Möller headed the institute from 2014-2024 and Prof. Dr.-Ing. Nele Rußwinkel took over as head of the institute in February 2024. Well-Founded Artificial Intelligence (well-founded AI) is the central object of research at IFIS. Within this framework, we investigate principles that are fundamental to intelligent systems with provable properties. It is not just a matter of somehow experimentally generating a certain impressive functionality (however fragile) with basic models, as is so often attempted at present, but – building on basic models, but also with reference to relational, non-embedded probabilistic or energy-based structures – to derive understandable architectures with formally tangible properties in order to create intelligent systems that are useful for all people. Im Rahmen der KI-Erlebnisausstellung befand sich der IFIS-Stand vom 11.-13. November im EG des Übergangshauses, Königstraße 54-56, in der Lübecker Innenstadt. Für Schulen und die breite Öffentlichkeit war die Ausstellung am Mittwoch, 12.11.2025, 9.00-17.00 Uhr und Donnerstag, 13.11.2025, 9.00-13.00 Uhr geöffnet The International Semantic Intelligence Conference (ISIC 2025) will take place at the Institute of Information Systems from October 6 to 8, 2025. ISIC is an international platform for the Artificial Intelligence, Machine Learning and the Semantic Web communities. It presents a forum to publish cutting edge research results in intelligent applications. 10/09/2025 Conference Orga Prof. Groppe in Program Committee of A*-ranked Conference WWW 2026 Prof. Groppe is member of the program committee of the ACM Web Conference 2026 (formerly the WWW conference). The ACM Web Conference has the highest… 09/10/2025 Conference Orga Workshop at ICSR + AI 2025 SCOPE-HRI: Sensing and COgnitive Principles in Embodied HRI 07/09/2025 Projects FPOplus LaunchLab: Data Meets Reality At the kick-off event of the “FPOplus LaunchLab: Data Meets Reality” in the Gleishalle Oberhafen in Hamburg, all project participants met to discuss… Institut für Informationssysteme Tel:  +49 451 3101 5701 Fax: +49 451 3101 5704 Email: ifis.sekretariat(at)uni-luebeck.de",
  "content_length": 4672,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:10"
}