{
  "name": "Ralf Lämmel",
  "homepage": "http://softlang.wikidot.com/rlaemmel:home",
  "status": "success",
  "content": "Ralf Lämmel (Prof. Dr.) - SOFTLANG Team, Uni Koblenz-Landau SOFTLANG Team, Uni Koblenz-Landau Home Members Activities Teaching Theses Contact News Create account or Sign in Ralf Lämmel (Prof. Dr.) I am Professor in Computer Science at University of Koblenz Landau. I lead the SoftLang team. Currently, I am dean of the faculty. Recently, I was engineer in R&D at Facebook. In the past, I have worked in academia and industry in NL, UK, and USA. Overall, I am interested in: software/data engineering, programming/software/domain-specific/modeling languages, software language engineering, mining software repositories and systems and IT companies, and machine learning, data mining, process mining in all those contexts. Pointers Information about how to get in touch Bio and CV (.pdf) Publications according to DBLP Publications and citations according to Google Scholar My annotated, selective publication list (.pdf) My research statement (.pdf) My teaching summary (.pdf) More pointers I used to blog more often. My Microsoft blog is gone unfortunately, but I remember every word I said. My PhD thesis (.pdf) was about meta-programming. Teaching material used to be more open. page revision: 82, last edited: 01 Jan 2021 17:03 Edit Tags History Files Print Site tools + Options Edit Sections Append Edit Meta Watchers Backlinks Page Source Parent Lock Page Rename Delete Help | Terms of Service | Privacy | Report a bug | Flag as objectionable | Update cookie settings Powered by Wikidot.com Click here to edit contents of this page. Click here to toggle editing of individual sections of the page (if possible). Watch headings for an \"edit\" link when available. Append content without editing the whole page source. Check out how this page has evolved in the past. If you want to discuss contents of this page - this is the easiest way to do it. View and manage file attachments for this page. A few useful tools to manage this Site. See pages that link to and include this page. Change the name (also URL address, possibly the category) of the page. View wiki source for this page without editing. View/set parent page (used for creating breadcrumbs and structured layout). Notify administrators if there is objectionable content in this page. Something does not work as expected? Find out what you can do. General Wikidot.com documentation and help section. Wikidot.com Terms of Service - what you can, what you should not etc. Wikidot.com Privacy Policy.",
  "content_length": 2462,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:08"
}