{
  "name": "Ralf M. Haefner",
  "homepage": "https://www2.bcs.rochester.edu/sites/haefnerlab/index.html",
  "status": "success",
  "content": "Ralf Haefner Lab Home News Research PeopleLab Members Collaborators Publications Resources Contact Recent News New publication: \"Generative adversarial collaborations: a new model of scientific discourse\" New publication (SciReports 2024): \"Causal inference predicts the transition from integration to segmentation in motion perception\" New preprint on how the brain computes with probabilities New publication (NatNeuro 2023): \"Bayesian encoding and decoding as distinct perspectives on neural coding\" New SfN Abstract: \"Noise correlations and choice probabilities during learning and task switching in V4â New NeurIPS workshop paper (pdf): \"A General Method for Testing Bayesian Models using Neural Dataâ Congratulations to lab alumnus Richard Lange, who has become a faculty member at RIT New preprint: \"Hierarchical motion processing as causal inference\" more... Welcome Our primary scientific interest lies in understanding how the brain forms percepts and uses them to make decisions, especially in the visual domain. In particular, we are interested in how the brain's perceptual beliefs about the outside world are represented by the responses of populations of cortical neurons and how their spiking activity gives rise to percepts and decisions. To that end we construct mathematical models that aim to explain neural responses and behavior. Key concepts in the context of our work are perceptual decision-making, probabilistic inference, neural sampling, noise correlations, choice probabilities, population responses, optimal linear read-out, feedforward, recurrent and top-down processing, covert attention, psychophysical kernel, confirmation bias. top Research Probabilistic (causal) inference and neural sampling (ongoing) In order to draw conclusions, or inferences, about the outside world, the brain has to combine sensory information with its learnt knowledge about the structure of the external world. How this is implemented in the brain is still unknown. By generating predictions for classic perceptual tasks, we test the hypothesis that the brain performs probabilistic inference by sampling, i.e. that neuronal activity can be interpreted as samples from a generative model of the world that the brain has previously learnt. Lange & Haefner PLoS Comput Biol. Haefner et al. 2016 (Neuron) Lange & Haefner 2017 (Curr Opin Neurobiol) Lange & Haefner 2022 (PLoS Comput Biol.) Lange et al. 2021 (PLoS Comput Biol.) Lange et al. 2023 (Nature Neuroscience, accepted) Shivkumar et al. 2022 (biorxiv) Test of model predictions using data from macaque V1. Bondy, Haefner & Cumming 2018 (Nature Neuroscience) (pdf) Lange et al. 2023 (JNeurophysiology) Population (de)coding and perceptual decision-making How many sensory neurons contribute to a particular decision, how are they being read out (e.g. optimal or not) and which neurons are they? We have made significant progress recently towards answering these questions by deriving the analytical relationship between noise correlations, choice probabilities and read-out weights. This will allow us to answer two of these questions as soon as multi-electrode recordings from behaving animals become available, i.e. very soon. Nature Neuroscience 16, 235â242 (2013)Â PDF+Code+Bibtex Applying this framework to neural recordings from MT during a dual motion direction and binocular discrimination task while area V2 was being cooled, we could constrain the origin of the noise correlations in MT. Neuron 81(1), 208-219 (2015) Application to MT data allowed us to investigate the neural basis of the psychophysical suppression effect. Liu et al. 2016 (eLife) Chicharro D, Panzeri S, Haefner RM 2021 (elife) Binocular vision Depth perception from binocular images is an exemplary model system for studying how the brain extracts information not explicitly present in its (2D) inputs. We have been particularly interested in understanding what feedforward computations might underlie the observed neurophysiology and how much information different binocular neuron types contain about depth. Neuron 57, vol 1, 147-158 (2008)Â PDF NeurIPS 2008Â PDFÂ NeurIPS 2010Â PDF J Neuroscience, 31(22): 8295-8305 (2011)Â PDFÂ Natural image statistics Understanding the statistics of the natural world is important for understanding the properties of early sensory processing. Traditionally, this argument has been made in the context of efficient coding (Barlow) but what learning principle (objective function) is responsible for the properties of early sensory neurons, e.g. their receptive fields in the case of visual neurons, is still an open question and active field of research. Ultimately, this question is related to what generative model the brain has learnt for its sensory inputs. PLoS Comput Biol 10(3): e1003468 top People Photos from Retreat 2023 VSS 2022 Lab Members Ralf Haefner, PI You need JavaScript to see my email address Biography Shizhao Liu, Graduate Student co-advised by Adam Snyder Anton Pletenev, Graduate Student You need JavaScript to see my email address Xinyi Yuan, Graduate Student 2019 top Alumni Samuel Alvernaz Himanshu Ahuja Garrett Bunce, Undergraduate researcher, now PhD student at U Maryland Ankani Chattoraj, Graduate student, now Data Science Engineer, Autonomous Vehicle Behavior Test Zhen Chen, Graduate student Nicholas Cimaczevski , Undergraduate researcher, now PhD student at MPI/University of Tübingen Matthew Hochberg, Undergraduate researcher Sunny Jin , CVS summer researcher, now Master in Psychology, Istanbul, Turkey Jovan Kemp, CVS summer student, now PhD student at Brown Richard Lange, Graduate student, now faculty member at RIT Gabor Lengyel, Postdoc Ruolan (Leslie) Li, Undergraduate researcher, now PhD student at University of Maryland Joseph Majesky, Undergraduate researcher Katherine Moon, now undergraduate at Yale University Katarina Nichols, now PhD student at University of Rochester Boris Penaloza, Postdoc Yong Soo Ra, now PhD student at Harvard University Sabya Shivkumar, now postdoc at Columbia University Martynas Snarskis, Undergraduate researcher, now lab manager in the lab of David Gallo at University of Chicago Xuan Wen, Undergraduate researcher, now PhD student at Vanderbuilt University Shuchen Wu, now PhD student at MPI Tübingen Linghao Xu, Graduate student, now PhD student in the lab of Ruben Coen-Cagli at Einstein College of Medicine Ziyi Zhu, Undergraduate researcher, now PhD student at Columbia University Collaborators Experimental labs Rick Born Bruce Cumming Greg DeAngelis Jude Mitchell Hendrikje Nienborg Chris Pack John Reynolds Adam Snyder Theoretical labs Matthias Bethge Alex Ecker Jakob Macke Stefano Panzeri Fabian Sinz top Publications Benjamin Peters, Gunnar Blohm, Ralf Haefner, Leyla Isik, Nikolaus Kriegeskorte, Jennifer S. Lieberman, Carlos R. Ponce, Gemma Roig, Megan A.K. Peters. Generative adversarial collaborations: a new model of scientific discourse. Trends in Cognitive Sciences, Volume 29, Issue 1, 2025, Pages 1-4, ISSN 1364-6613, https://doi.org/10.1016/j.tics.2024.10.015. Penaloza B, Shivkumar S, Lengyel G, DeAngelis GC, Haefner RM. Causal inference predicts the transition from integration to segmentation in motion perception. Sci Rep. 2024 Nov 12;14(1):27704. doi: 10.1038/s41598-024-78820-6. PMID: 39533022; PMCID: PMC11558006. Haefner, R.M., Beck, J., Savin, C. et al. How does the brain compute with probabilities? arXiv:2409.02709; doi: https://doi.org/10.48550/arXiv.2409.02709 Lange, R.D., Shivkumar, S., Chattoraj, A. et al. Bayesian encoding and decoding as distinct perspectives on neural coding. Nat Neurosci 26, 2063â2072 (2023). https://doi.org/10.1038/s41593-023-01458-6 Shivkumar S, DeAngelis GC, Haefner RM. Hierarchical motion perception as causal inference. bioRxiv 2023.11.18.567582; doi: https://doi.org/10.1101/2023.11.18.567582 Fu J, Shrinivasan S, Ponder K, Muhammad T, Ding Z, Wang E, Ding Z, Tran DT, Fahey PG, Papadopoulos S, Patel S, Reimer J, Ecker AS, Pitkow X, Haefner RM, Sinz FH, Franke K, Tolias AS. Pattern completion and disruption characterize contextual modulation in mouse visual cortex. bioRxiv [Preprint]. 2023 Mar 14:2023.03.13.532473. doi: 10.1101/2023.03.13.532473. PMID: 36993321; PMCID: PMC10054952. Lange RD, Gomez-Laberge C, Berezovskii VK, Plenetev A, Sherdil A, Hartmann T, Haefner RM, Born RT. Weak Evidence for Neural Correlates of Task-Switching in Macaque V1. J Neurophysiol. 2023 Mar 22. doi: 10.1152/jn.00085.2022. Epub ahead of print. PMID: 36947884. Noel JP, Shivkumar S, Dokka K, Haefner RM, Angelaki DE. Aberrant causal inference and presence of a compensatory mechanism in autism spectrum disorder. Elife. 2022 May 17;11:e71866. doi: 10.7554/eLife.71866. PMID: 35579424; PMCID: PMC9170250. Shivkumar S, Cappelloni MS, Maddox RK, Haefner RM. Inferring sources of suboptimality in perceptual decision making using a causal inference task. bioRxiv 2022.04.28.489925; doi: https://doi.org/10.1101/2022.04.28.489925 Lange RD, Haefner RM. Task-induced neural covariability as a signature of approximate Bayesian learning and inference. PLoS Comput Biol. 2022 Mar 8;18(3):e1009557. doi: 10.1371/journal.pcbi.1009557. Lange RD, Chattoraj A, Beck J, Yates J, Haefner R. A confirmation bias in perceptual decision-making due to hierarchical approximate inference, PLoS Comput Biol. 2021 Nov 29;17(11):e1009517. | pdf Lange, R., Shivkumar, S., Chattoraj, A., and Haefner, R. 2021. Bayesian Encoding and Decoding as Distinct Perspectives on Neural Coding. bioRxiv, p.2020â10. | biorxiv Chattoraj, A., Shivkumar, S., Ra, Y., and Haefner, R. 2021. A confirmation bias due to approximate active inference. In Proceedings of the Annual Meeting of the Cognitive Science Society. | Abstract | pdf Chattoraj, A., Snarskis, M., and Haefner, R. 2021. Relating confidence judgements to temporal biases in perceptual decision-making. In Proceedings of the Annual Meeting of the Cognitive Science Society. | Abstract | pdf Chicharro D, Panzeri S, Haefner RM. Stimulus-depend",
  "content_length": 25602,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:11"
}