{
  "name": "Ralf Küsters",
  "homepage": "https://sec.informatik.uni-stuttgart.de/people/kuesters",
  "status": "success",
  "content": "Prof. Dr. Ralf Küsters | Institute of Information Security | University of Stuttgart jump to content jump to footer back close navigation For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Ralf Küsters Prof. Dr. Head of InstituteInstitute of Information Security Contact +49 711 685 88283 +49 711 685 51096 Email Universitaetsstrasse 38 70569 Stuttgart Germany Room: 2.451 Publications 2026Mayar Elfares, Pascal Reisert, Ralf Küsters, and Andreas Bulling, “Gaze3P: Gaze-Based Prediction of User-Perceived Privacy,” Proceedings on Privacy Enhancing Technologies, 2026. To appear.AbstractBibTeXAbstractPrivacy is a highly subjective concept and perceived variably by different individuals. Previous research on quantifying user-perceived privacy has primarily relied on questionnaires. Furthermore, applying user-perceived privacy to optimise the parameters of privacy-preserving techniques (PPT) remains insufficiently explored. To address these limitations, we introduce Gaze3P -- the first dataset specifically designed to facilitate systematic investigations into user-perceived privacy. Our dataset comprises gaze data from 100 participants and 1,000 stimuli, encompassing a range of private and safe attributes. With Gaze3P, we train a machine learning model to implicitly and dynamically predict perceived privacy from human eye gaze. Through comprehensive experiments, we show that the resulting models achieve high accuracy. Finally, we illustrate how predicted privacy can be used to optimise the parameters of differentially private mechanisms, thereby enhancing their alignment with user expectations.BibTeX@article{ElfaresReisertKuestersBulling-PoPETs-2026, abstract = {Privacy is a highly subjective concept and perceived variably by different individuals. Previous research on quantifying user-perceived privacy has primarily relied on questionnaires. Furthermore, applying user-perceived privacy to optimise the parameters of privacy-preserving techniques (PPT) remains insufficiently explored. To address these limitations, we introduce Gaze3P -- the first dataset specifically designed to facilitate systematic investigations into user-perceived privacy. Our dataset comprises gaze data from 100 participants and 1,000 stimuli, encompassing a range of private and safe attributes. With Gaze3P, we train a machine learning model to implicitly and dynamically predict perceived privacy from human eye gaze. Through comprehensive experiments, we show that the resulting models achieve high accuracy. Finally, we illustrate how predicted privacy can be used to optimise the parameters of differentially private mechanisms, thereby enhancing their alignment with user expectations.}, author = {Elfares, Mayar and Reisert, Pascal and K{\\\"u}sters, Ralf and Bulling, Andreas}, journal = {{Proceedings on Privacy Enhancing Technologies}}, note = {To appear.}, title = {{Gaze3P: Gaze-Based Prediction of User-Perceived Privacy}}, year = 2026 }Pedram Hosseyni, Ralf Küsters, and Tim Würtele, “Audience Injection Attacks: A New Class of Attacks on Web-Based Authorization and Authentication Standards,” in 47th IEEE Symposium on Security and Privacy (S&P 2026), IEEE, 2026, pp. 205–222. To appear.AbstractBibTeXDOIAbstractWe introduce audience injection attacks, a novel class of vulnerabilities that impact widely used Web-based authentication and authorization protocol standards, including OAuth 2.0, OpenID Connect, FAPI, CIBA, the Device Authorization Grant, and various well-established extensions, such as Pushed Authorization Requests, Token Revocation, Token Introspection, and their numerous combinations. These protocols underpin services for billions of users across diverse ecosystems worldwide, spanning low-risk applications like social logins to high-risk domains such as open banking, insurance, and healthcare. Audience injection attacks exploit a critical weakness in a core security mechanism of these standards - the handling of so-called audiences in signature-based client authentication mechanisms. This vulnerability allows attackers to compromise fundamental security objectives whenever these mechanisms are utilized across two or more server endpoints. They enable the attacker to impersonate users and gain unauthorized access to their resources, even in high-security protocol families specifically designed for sensitive applications. We responsibly disclosed these vulnerabilities to the relevant standardization bodies, which recognized their severity. In collaboration with these organizations, we developed fixes and supported a coordinated response, leading to an ongoing effort to update a dozen standards.BibTeX@inproceedings{HosseyniKuestersWuertele-SP-2026, abstract = {We introduce audience injection attacks, a novel class of vulnerabilities that impact widely used Web-based authentication and authorization protocol standards, including OAuth 2.0, OpenID Connect, FAPI, CIBA, the Device Authorization Grant, and various well-established extensions, such as Pushed Authorization Requests, Token Revocation, Token Introspection, and their numerous combinations. These protocols underpin services for billions of users across diverse ecosystems worldwide, spanning low-risk applications like social logins to high-risk domains such as open banking, insurance, and healthcare. Audience injection attacks exploit a critical weakness in a core security mechanism of these standards - the handling of so-called audiences in signature-based client authentication mechanisms. This vulnerability allows attackers to compromise fundamental security objectives whenever these mechanisms are utilized across two or more server endpoints. They enable the attacker to impersonate users and gain unauthorized access to their resources, even in high-security protocol families specifically designed for sensitive applications. We responsibly disclosed these vulnerabilities to the relevant standardization bodies, which recognized their severity. In collaboration with these organizations, we developed fixes and supported a coordinated response, leading to an ongoing effort to update a dozen standards.}, author = {Hosseyni, Pedram and K{\\\"u}sters, Ralf and W{\\\"u}rtele, Tim}, booktitle = {{47th IEEE Symposium on Security and Privacy (S{\\&}P 2026)}}, doi = {10.1109/SP63933.2026.00116}, note = {To appear.}, pages = {205--222}, publisher = {{IEEE}}, title = {{Audience Injection Attacks: A New Class of Attacks on Web-Based Authorization and Authentication Standards}}, year = 2026 }DOI10.1109/SP63933.2026.001162025Mayar Elfares, Pascal Reisert, Ralf Küsters, and Andreas Bulling, “Gaze3P: Gaze-Based Prediction of User-Perceived Privacy,” arXiv, Technical Report 2507.00596, 2025.AbstractBibTeXLinkAbstractPrivacy is a highly subjective concept and perceived variably by different individuals. Previous research on quantifying user-perceived privacy has primarily relied on questionnaires. Furthermore, applying user-perceived privacy to optimise the parameters of privacy-preserving techniques (PPT) remains insufficiently explored. To address these limitations, we introduce Gaze3P -- the first dataset specifically designed to facilitate systematic investigations into user-perceived privacy. Our dataset comprises gaze data from 100 participants and 1,000 stimuli, encompassing a range of private and safe attributes. With Gaze3P, we train a machine learning model to implicitly and dynamically predict perceived privacy from human eye gaze. Through comprehensive experiments, we show that the resulting models achieve high accuracy. Finally, we illustrate how predicted privacy can be used to optimise the parameters of differentially private mechanisms, thereby enhancing their alignment with user expectations.BibTeX@techreport{ElfaresReisertKuestersBulling-arXiV-2025-00596, abstract = {Privacy is a highly subjective concept and perceived variably by different individuals. Previous research on quantifying user-perceived privacy has primarily relied on questionnaires. Furthermore, applying user-perceived privacy to optimise the parameters of privacy-preserving techniques (PPT) remains insufficiently explored. To address these limitations, we introduce Gaze3P -- the first dataset specifically designed to facilitate systematic investigations into user-perceived privacy. Our dataset comprises gaze data from 100 participants and 1,000 stimuli, encompassing a range of private and safe attributes. With Gaze3P, we train a machine learning model to implicitly and dynamically predict perceived privacy from human eye gaze. Through comprehensive experiments, we show that the resulting models achieve high accuracy. Finally, we illustrate how predicted privacy can be used to optimise the parameters of differentially private mechanisms, thereby enhancing their alignment with user expectations.}, author = {Elfares, Mayar and Reisert, Pascal and K{\\\"u}sters, Ralf and Bulling, Andreas}, institution = {arXiv}, number = {2507.00596}, title = {{Gaze3P: Gaze-Based Prediction of User-Perceived Privacy}}, type = {Technical Report}, url = {https://arxiv.org/abs/2507.00596}, year = 2025 }Linkhttps://arxiv.org/abs/2507.00596Sebastian Hasler, Pascal Reisert, and Ralf Küsters, “Pseudorandom Correlation Functions from Ring-LWR,” Cryptology ePrint Archive, Technical Report 2025/1637, 2025.AbstractBibTeXLinkAbstractState-of-the-art actively secure multiparty computation protocols, like SPDZ (Damgård et al., CRYPTO 2012), use correlated randomness, like Beaver triples, to achieve a highly efficient online phase. For a long time, the generation of the correlated randomness in the offline phase relied on classical cryptographic primitives, like somewhat homomorphic encryption or oblivious transfer, that required significant communication. More recently, Boyle et al. (FOCS 2020) defined a new primitive called pseudorandom correlation functions (PCFs) to ge",
  "content_length": 727900,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:13"
}