{
  "name": "Ralf Peeters",
  "homepage": "https://www.maastrichtuniversity.nl/ralf.peeters",
  "status": "success",
  "content": "Prof Dr Ir Ralf Peeters (R.L.M.) - Prof Dr Ir Ralf Peeters (R.L.M.) - Maastricht University Skip to main content Prof Dr Ir Ralf Peeters (R.L.M.) Research Prof Dr Ir Ralf Peeters (R.L.M.) I  graduated in Technical Mathematics at Delft University of Technology (1988) and received my PhD from the Free University, Amsterdam (1994). My core expertise and research interests are in mathematical and AI techniques for Signal and Image Processing, Systems and Control Theory, Mathematical Modelling, Data Science, and Optimization. I’ve supervised 25+ completed PhD projects. I like to engage in applied projects, ranging from the process industry to the health domain.As the vice-dean of research I hold the research portfolio of the Faculty of Science and Engineering, and I am director of the STEM Graduate School. I represent the Mathematics Centre Maastricht at the Dutch Mathematics Platform, and I am a member of the Dutch Institute of Systems and Control. I’m also member of the Advisory Board on Knowledge Security of Maastricht University. Expertises Research interests and expertiseApplied Mathematics, Mathematical Systems and Control Theory, Signal and Image Processing, Mathematical Modelling, Artificial Intelligence, Optimization, Operations Research, Decision Theory, Statistical Parameter Estimation, System Identification, Stability Theory, Wavelet Theory, Recurrence Plots, Data Mining, Pattern Recognition and Feature Extraction, Evolutionary Dynamics, Systems Biology, Biomedical Engineering Applications, Cardiac Modelling, Machine Learning, Big Data, MCTS, Computer Algebra, Algebraic Symbolic Computation Prof Dr Ir Ralf Peeters (R.L.M.) Full professor in Mathematics of Knowledge Engineering at the Department of Advanced Computing Sciences (DACS)Vice-dean of Research of the Faculty of Science and Engineering (FSE)Director of the STEM Graduate Scool at FSEHead of the UM-team affiliated with the inter-university research school DISCCo-Chair of the Mathematics Centre Maastricht For access to my page on Google Scholar, see here. For access to my LinkedIn or ResearchGate page, follow the icons. Applied Mathematics Dept. of Advanced Computing Sciences Faculty of Science and Engineering ORCID ralf.peeters@maastrichtuniversity.nl Linkedin",
  "content_length": 2262,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:11"
}