{
  "name": "Ralph Etienne-Cummings",
  "homepage": "https://engineering.jhu.edu/faculty/ralph-etienne-cummings",
  "status": "success",
  "content": "Ralph Etienne-Cummings - Johns Hopkins Whiting School of Engineering Contact (202) 329-1312 retienne@jhu.edu Location 105 Barton Hall Connect Google Scholar Website A pioneer for the past three decades in mobile robotics and legged locomotion, Ralph Etienne-Cummings’ innovations have the potential to produce computers that can perform recognition tasks as effortlessly and efficiently as humans. He has developed prosthetics that can seamlessly interface with the human body to restore functionality after injury or to overcome disease. Etienne-Cummings is the Julian S. Smith Professor of electrical and computer engineering and is the vice provost for faculty affairs at Johns Hopkins University. He holds a secondary appointment in computer science. He previously served on JHU’s Homewood Academic Council and is the former chair of the department of electrical and computer engineering. Etienne-Cummings’ research includes developing systems and algorithms for biologically inspired and low-power processing, biomorphic robots, closed-loop neural prosthetics, and computer integrated surgical systems and technologies. His contributions to the field are numerous, including helping to develop the first large-scale, neural computer–implemented using very-large-scale integration (VLSI) chips (integrated circuit of, potentially, millions of transistors on a single chip) as a PhD student to publishing the first paper on pulse-based, inter-pixel time of travel motion chip, which was based on the fly’s motion detection. After expanding this research into silicon retinas, Etienne-Cummings worked with the U.S. Air Force Office of Scientific Research and the JHU Applied Physics Lab to study how these chips guide micro, unmanned aerial vehicles. His research lab is the Computational Sensory Motor Systems Laboratory. Etienne-Cummings’ recent work has advanced the understanding of how to interface electronics with the nervous system and how to use biological signals to control biomorphic robots. His demonstration of in vitro control of the spinal circuits responsible for locomotion in lamprey and on a cat’s hind limb were the first examples of artificially generating signals to change the cycle-by-cycle behavior of segmental CPG networks in the spinal cord. Currently, he is working on an implantable device that will perform intra-spinal-micro-stimulation to mitigate spinal cord injuries; an integrated, wireless wearable physiological sensor to track the health of cardiac patients after admission; and ultrasonic imaging systems and actuated catheters for infertility treatment, among other projects. Etienne-Cummings has published more than 230 technical articles, one book, 12 book chapters, and holds 16 patents. In the 2000s, he helped create silicon Central Pattern Generators (CPG) for the control of biped locomotion. This groundbreaking research developed real-time adaptation in response to external perturbations and asymmetries in the motor system, creating smooth and efficient bipedal running, walking, and stepping that is still hard to find in today’s legged robotics systems. This evolved into brain-machine interfaces and neural prosthesis devices to restore function after injury and for human augmentation. In a career spanning academia and industry, Etienne-Cummings is the former and founding director of the JHU Institute of Neuromorphic Engineering and has consulted for numerous technology firms, including Nova Sensors, Inc., Innovative Wireless Technologies, Singular Computing, Panasonic N. American & Corporation, Avago Technologies, Micron Technologies, and others. He has served as an expert witness for law firms across the country and has testified in federal court and in International Trade Commission cases. He was a visiting scientist at Lawrence Livermore National Laboratory, a visiting African scholar at the University of Cape Town in South Africa and an Eminent Visiting Professor at the University of Western Sydney in Australia. He has won numerous awards including being named a Fellow of AIMBE (2021) and receiving multiple JHU Discovery Awards (2019, 2018). He received first place in the research competition at the 5th annual Johns Hopkins Imaging Conference in 2015 and was selected for the “Indispensable Role of African Americans at JHU” honor for his impact in the classroom and lab. In 2012, he was elected Fellow of The Institute of Electrical and Electronics (IEEE). He also participated in DARPA’s Revolutionary Prosthesis project for developing dexterous upper limb prosthesis for amputees. His papers have won several top awards, including the 2012 Most Outstanding Paper of the IEEE Transaction on Neural Systems and Rehabilitation Engineering and 2011 Best Paper Award for IEEE Transactions of Biomedical Circuits and Systems. Additionally, he was recognized as a “ScienceMaker,” as part of the HistoryMakers, an African American history archive. In 2007, Etienne-Cummings was named a Kavli Fellow in Science by the National Academies of Science, received the Trailblazer Award for Top Minorities in Science (2006), the Young Investigators Program Award from the Office of Naval Research (2000), and the NSF’s CAREER Award (1996). He has served on various technical committees including, at present, the IEEE Biomedical Engineering Awards Committee, as well as other prior IEEE committees, the awards committee of the ECEDHA, and the NSF Workshop on the Science of Learning. He lends his expertise to numerous editorial boards, including the Journal of Low-Power Electronics and Applications and Frontiers in Neuromorphic Engineering; was deputy editor-in-chief for the IEEE Transactions on Biomedical Circuits and Systems from 2011-2016, and is a reviewer for numerous organizations. He received his BSc in Physics (1988) from Lincoln University and his MSEE (1990) and PhD (1994) in electrical engineering from the University of Pennsylvania. Related News View All News Ralph Etienne-Cummings elected to the AIMBE College of Fellows Categories Awards and Honors Election to the AIMBE College of Fellows is among the highest professional distinctions accorded to medical and biomedical engineers Site Menu Search Submit Close ﻿",
  "content_length": 6207,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:13"
}