{
  "name": "Ralph Holz",
  "homepage": "https://research.utwente.nl/en/persons/ralph-günther-holz",
  "status": "success",
  "content": "Ralph-Günther Holz - University of Twente Research Information Contact Expert Ralph-Günther Holz Dr Associate Professor, Design and Analysis of Communication SystemsAssociate Professor, Digital Society Institute https://orcid.org/0000-0001-9614-2377 h-index 932 Citations 14 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20082025 Research activity per year Personal profile Fingerprint Dive into the research topics where Ralph-Günther Holz is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Service Computer Science 100% Transport Layer Security Computer Science 97% Application Layer Computer Science 97% Directory Access Protocol Computer Science 97% Application Computer Science 88% Overlay Computer Science 72% Domains Computer Science 61% Server Computer Science 58% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2008 2015 2020 2023 2024 2025 2025 32 Conference contribution 9 Article 3 Preprint 2 Paper 8 More 2 Other contribution 1 Abstract 1 Conference article 1 Editorial 1 Letter 1 PhD Thesis - Research external, graduation external 1 Working paper Research output per year Research output per year A First Look at the Adoption of BGP-based DDoS Scrubbing Services: A 5-year Longitudinal AnalysisKhadka, S. K., Bayhan, S., Holz, R., Shokoohi, S., Barcellos, M. & Hesselman, C. E. W., 28 Aug 2025, (Accepted/In press). 7 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile Distributed Denial of Service Attack 100% Border Gateway Protocol 100% Autonomous System 62% Routing Protocol 25% Attack Traffic 12% 222 Downloads (Pure) Characterizing Hosting and Security Practices for Public-Facing LDAP ServersLuvizotto Cesar, G., Öndarö, G., Kaspereit, J., Ising, F., Schinzel, S., Jonker, M. & Holz, R., 27 Oct 2025, (Accepted/In press) 2025 21st International Conference on Network and Service Management (CNSM).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Security Practice 100% Directory Access Protocol 100% Authentication 11% Personal Information 11% Security Posture 11% Investigating Middlebox Deployment and Characteristics in Dutch Autonomous SystemsUlukapi, B., Sperotto, A. & Holz, R., 31 Oct 2025, (Accepted/In press) 2025 21st International Conference on Network and Service Management (CNSM). IEEEResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile 13 Downloads (Pure) Towards Understanding Middlebox Deployments in Dutch ASes: Impact of IP Sampling SizeUlukapi, B., Sperotto, A. & Holz, R., 22 Jul 2025, ANRW '25: Proceedings of the 2025 Applied Networking Research Workshop. Association for Computing Machinery (ACM), p. 174-176 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Network Element 100% 18 Downloads (Pure) Tracing Vendors: A Middlebox-Centric Study of Network InterferenceUlukapi, B., Sperotto, A. & Holz, R., 2025, 2025 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). Piscataway, NJ: IEEE, p. 176-186 11 p. (Proceedings - 10th IEEE European Symposium on Security and Privacy Workshops, Euro S and PW 2025; vol. 2025).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Network Interference 100% Attack Surface 50% Measurement Methodology 50% Autonomous System 50% Traffic Monitoring 50% View all 54 research outputs",
  "content_length": 3997,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:13"
}