{
  "name": "Raluca Ada Popa",
  "homepage": "http://www.eecs.berkeley.edu/~raluca",
  "status": "success",
  "content": "Raluca Ada Popa's Homepage Raluca Ada Popa Robert E. and Beverly A. Brooks Associate Professor, UC Berkeley Department of Electrical Engineering and Computer Science UC Berkeley Address: 729 Soda Hall, Berkeley, CA, 94720 Email: raluca AT eecs DOT berkeley DOT edu @ralucaadapopa Main Research Students Teaching Awards Service I am an associate professor at UC Berkeley, and I lead the Frontier Security team at Google DeepMind. I am interested in systems security, machine learning security, and applied cryptography. At UC Berkeley, I co-founded and co-direct the RISELab and SkyLab, labs aiming to build secure intelligent systems for the cloud and for the sky of clouds, respectively, and the DARE program for promoting diversity and equity. As faculty, I was awarded the ACM Grace Murray Hopper award, Sloan Research Fellowship, J. Lepreau Best Paper Award, Distinguished Paper Award, J. and D. Gray Award for Excellence in Undergraduate Teaching of Computer Science, Microsoft Research Faculty Fellowship, NSF CAREER, Bakar Faculty Fellowship, and I was selected to the list of 35 innovators under 35 by MIT Technology Review. Starting with 2023, I have been a co-creator and research advisor of the Exocore Restaking Protocol. Starting with 2021, I have been a co-founder of Opaque Systems (and served as its President during 2021-2024). Starting with 2015, I have been a co-founder of PreVeil (and served as its CTO during 2015-2021). Before joining UC Berkeley, I did a one-year postdoc at ETH Zürich in the System Security group led by Srdjan Capkun. Before that, in 2014, I completed my Ph.D. in computer science at MIT, my thesis being about building practical systems that compute on encrypted data. My PhD thesis was awarded a George M. Sprowls Award for best MIT CS doctoral theses. My advisor was Nickolai Zeldovich, and I was also fortunate to work closely with Hari Balakrishnan in systems, and with Shafi Goldwasser, Yael Kalai, and Vinod Vaikuntanathan in cryptography. I earned my Masters of Engineering in Computer Science in 2010 and my two Bachelors in Computer Science and Mathematics in 2009 also from MIT. PhD advisees: Vivian Fang Mayank Rathee Samyukta Yagati, co-advised with Prof. Ion Stoica Deevashwer Rathee, co-advised with Prof. Dawn Song Sijun Tan Darya Kaviani Jinhao Zhu Alumni: PhD advisees: Emma Dauterman (→ faculty at Stanford University) Jean-Luc Watson (→ Research Scientist at NVIDIA) Sam Kumar (→ faculty at UCLA) 2024 ACM SIGSAC Doctoral Dissertation Award Runner-Up David J. Sakrison Memorial Prize, UC Berkeley Wenting Zheng (→ faculty at Carnegie Mellon University) Rishabh Poddar (→ CTO and co-founder of Opaque Systems, Inc.) Pratyush Mishra (→ faculty at University of Pennsylvania and co-founding scientist at Aleo, Inc.) 2022 ACM SIGSAC Doctoral Dissertation Award Runner-Up Weikeng Chen (→ research partner at L2 Iterative) Yuncong Hu (→ faculty at Shanghai Jiao Tong University) Ankur Dave (→ software engineer at Databricks) Michael Andersen (→ CTO and co-founder of True) Justine Sherry [PhD mentee whom I have worked closely with] (→ faculty at Carnegie Mellon University) Postdocs: Katerina Sotiraki (→ faculty at Yale University) Ioannis Demertzis (→ faculty at UC Santa Cruz) Sameer Wagh (→ head of privacy at Devron.ai) Chia-Che Tsai (→ faculty at Texas A&M) In addition, I have been working with a wonderful group of undergraduates and masters students. Papers Jinhao Zhu, Liana Patel, Matei Zaharia, and Raluca Ada Popa. Compass: Encrypted Semantic Search with High Accuracy. To appear in OSDI 2025 (USENIX Symposium on Operating Systems Design and Implementation). Darya Kaviani, Deevashwer Rathee, Bharghv Annem, and Raluca Ada Popa. Myco: Unlocking Polylogarithmic Accesses in Metadata-Private Messaging. To appear in IEEE S&P (Oakland) 2025 (IEEE Symposium of Security and Privacy). Sijun Tan, Siyuan Zhuang, Kyle Montgomery, William Tang, Alejandro Cuadron, Chenguang Wang, Raluca Ada Popa, and Ion Stoica. JudgeBench: A Benchmark for Evaluating LLM-based Judges. ICLR 2025 (The Thirteenth International Conference on Learning Representations). Vivian Fang, Emma Dauterman, Akshay Ravoor, Akshit Dewan, and Raluca Ada Popa. LegoLog: A Configurable Transparency Log. Euro IEEE S&P 2025 (IEEE European Symposium on Security and Privacy). Deevashwer Rathee, Dacheng Li, Ion Stoica, Hao Zhang, and Raluca Ada Popa. MPC-Minimized Secure LLM Inference. ArXiv 2408.03561. Darya Kaviani, Sijun Tan, Pravein Kannan, and Raluca Ada Popa. Flock: A Framework for Deploying On-Demand Distributed Trust. OSDI 2024 (USENIX Symposium on Operating Systems Design and Implementation). Graeme Connell, Vivian Fang, Rolfe Schmidt, Emma Dauterman, and Raluca Ada Popa. Secret Key Recovery in a Global-Scale End-to-End Encryption System. OSDI 2024 (USENIX Symposium on Operating Systems Design and Implementation). Sijun Tan, Xiuyu Li, Shishir G Patil, Ziyang Wu, Tianjun Zhang, Kurt Keutzer, Joseph E. Gonzalez, and Raluca Ada Popa. LLoCO: Learning Long Contexts Offline. EMNLP 2024 (Conference on Empirical Methods in Natural Language Processing). Mayank Rathee, Yuwen Zhang, Henry Corrigan-Gibbs, and Raluca Ada Popa. Private Analytics via Streaming, Sketching, and Silently Verifiable Proofs. IEEE S&P (Oakland) 2024 (IEEE Symposium of Security and Privacy). Jean-Luc Watson, Tess Despres, Alvin Tan, Shishir G. Patil, Prabal Dutta, and Raluca Ada Popa. Nebula: A Privacy-First Platform for Data Backhaul. IEEE S&P (Oakland) 2024 (IEEE Symposium of Security and Privacy). Raluca Ada Popa. Confidential Computing or Cryptographic Computing? ACM Queue 2024. CACM 2024(Communications of the ACM). Jean-Luc Watson, Saharsh Agrawal, Ryan Tsang, Sherry Luo, Raluca Ada Popa, and Prabal Dutta. Retcon: Live Updates for Embedded Event-Driven Applications. IPSN 2024 (ACM/IEEE Intl. Conference on Information Processing in Sensor Networks). Sijun Tan, Weikeng Chen, Ryan Deng, and Raluca Ada Popa. MPCAuth: Multi-factor Authentication for Distributed-trust Systems. IEEE S&P (Oakland) 2023 (IEEE Symposium of Security and Privacy). Mayank Rathee, Conghao Shen, Sameer Wagh, and Raluca Ada Popa. ELSA: Secure Aggregation for Federated Learning with Malicious Actors. IEEE S&P (Oakland) 2023 (IEEE Symposium of Security and Privacy). Ian Chang, Katerina Sotiraki, Weikeng Chen, Murat Kantarcioglu and Raluca Ada Popa. HOLMES: Efficient Distribution Testing for Secure Collaborative Learning. USENIX Security 2023 (USENIX Security Symposium). Emma Dauterman, Vivian Fang, Natacha Crooks, and Raluca Ada Popa. Reflections on trusting distributed trust. HotNets 2022 (ACM Workshop on Hot Topics in Networks). Jean-Luc Watson, Sameer Wagh, and Raluca Ada Popa. Piranha: A GPU Platform for Secure Computation. USENIX Security 2022 (USENIX Security Symposium). Vivian Fang, Lloyd Brown, William Lin, Wenting Zheng, Aurojit Panda, and Raluca Ada Popa. CostCO: An Automatic Cost Modeling Framework for Secure Multi-Party Computation. IEEE EuroS&P 2022 (IEEE European Symposium on Security and Privacy). Distinguished Paper Award. Emma Dauterman, Mayank Rathee, Raluca Ada Popa, and Ion Stoica. Waldo: A Private Time-Series Database from Function Secret-Sharing. IEEE S&P (Oakland) 2022 (IEEE Symposium of Security and Privacy). Daniel Abadi, Anastasia Ailamaki, David Andersen, Peter Bailis, Magdalena Balazinska, Philip A. Bernstein, Peter Boncz, Surajit Chaudhuri, Alvin Cheung, Anhai Doan, Luna Dong, Michael J. Franklin, Juliana Freire, Alon Halevy, Joseph M. Hellerstein, Stratos Idreos, Donald Kossmann, Tim Kraska, Sailesh Krishnamurthy, Volker Markl, Sergey Melnik, Tova Milo, C. Mohan, Thomas Neumann, Beng Chin Ooi, Fatma Ozcan, Jignesh Patel, Andrew Pavlo, Raluca Ada Popa, Raghu Ramakrishnan, Christopher Re, Michael Stonebraker, Dan Suciu. The Seattle Report on Database Research. CACM 2022 (Communications of the ACM). Sarah Chasins, Alvin Cheung, Natacha Crooks, Ali Ghodsi, Ken Goldberg, Joseph E. Gonzalez, Joseph M. Hellerstein, Michael I. Jordan, Anthony D. Joseph, Michael W. Mahoney, Aditya G. Parameswaran, David A. Patterson, Raluca Ada Popa, Koushik Sen, Scott Shenker, Dawn Song, and Ion Stoica. The Sky Above The Clouds. CoRR 2022 abs/2205.07147. Sam Kumar, David Culler, and Raluca Ada Popa. Nearly Zero-Cost Virtual Memory for Secure Computation. OSDI 2021 (USENIX Symposium on Operating Systems Design and Implementation). J. Lepreau Best Paper Award. Emma Dauterman, Vivian Fang, Ioannis Demertzis, Natacha Crooks, and Raluca Ada Popa. Snoopy: Surpassing the Scalability Bottleneck of Oblivious Storage. SOSP 2021 (ACM Symposium on Operating Systems Principles). Yuncong Hu, Kian Hooshmand, Harika Kalidhindi, Seung Jin Yang, and Raluca Ada Popa. Merkle2: A Low-Latency Transparency Log System. IEEE S&P (Oakland) 2021 (IEEE Symposium of Security and Privacy). Ryan Lehmkuhl, Pratyush Mishra, Akshayaram Srinivasan, and Raluca Ada Popa. Muse: Secure Inference Resilient to Malicious Clients. USENIX Security 2021 (USENIX Security Symposium). Wenting Zheng, Ryan Deng, Weikeng Chen, Raluca Ada Popa, Aurojit Panda, and Ion Stoica. Cerebro: A Platform for Multi-Party Cryptographic Collaborative Learning. USENIX Security 2021 (USENIX Security Symposium). Jeongseok Son, Griffin Prechter, Rishabh Poddar, Raluca Ada Popa, and Koushik Sen. ObliCheck: Efficient Verification of Oblivious Algorithms with Unobservable State. USENIX Security 2021 (USENIX Security Symposium). Rishabh Poddar, Sukrit Kalra, Avishay Yanai, Ryan Deng, Raluca Ada Popa, and Joseph M. Hellerstein. Senate: A Maliciously-Secure MPC Platform for Collaborative Analytics. USENIX Security 2021 (USENIX Security Symposium). Johann Schleier-Smith, Vikram Sreekanti, Anurag Khandelwal, Joao Carreira, Neeraja J. Yadwadkar, Raluca Ada Popa, Joseph Gonzalez, Ion Stoica and David A. Patterson. What Serverless Computing Is and Should Become: The Next Phase of Cloud Computing. CACM 2021 (Communications of the ACM). Emma Dauterman, Eric Feng, Ellen Luo, Raluca Ada Popa, an",
  "content_length": 24175,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:16"
}