{
  "name": "Ramazan Aygun",
  "homepage": "http://ua-huntsville.academia.edu/RamazanAygun",
  "status": "success",
  "content": "Ramazan Aygun - University of Alabama in Huntsville Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Ramazan AygunUniversity of Alabama in Huntsville, Computer Science, Faculty MemberaddFollowdoneFollowingFollowers27Following13Co-authors13Public ViewsRelated Authors David SeamonKansas State University Gary FeinmanField Museum Johannes Preiser-KapellerAustrian Academy of Sciences Lev ManovichGraduate Center of the City University of New York Niki NikonanouUNIVERSITY OF THESSALY, GREECE Stefania SavvaUniversity of Leicester ALEXANDRA BOUNIAUniversity of the Aegean Eoghan CaseyUniversity of Lausanne PALIMOTE JUSTICERIVERS STATE POLYTECHNIC Augustine GeorgeInterests UploadsPapers by Ramazan AygunQuality of Service and Performance Evaluation of Congestion Control for Multimedia NetworkingIcomp, 2006Page 1. Quality of Service and Performance Evaluation of Congestion Control for Multimedia Networ... more Page 1. Quality of Service and Performance Evaluation of Congestion Control for Multimedia Networking Khalid Darabkh and Ramazan Aygün, Member, IEEE ABSTRACTThe most important components of multimedia networking are video streaming and synchronization. ... Quality of Service Evaluation of Error Control for TCP/IP-Based Systems in Packet Switching ATM NetworksIcomp, 2006 Unsupervised Speaker Identification For TV NewsIEEE MultiMedia, 2016 Performance Evaluation of Sequential Decoding System for UDP-Based Systems for Wireless Multimedia NetworksIcwn, 2006Sequential decoders are convolutional channel decoders that are characterized by having variable ... more Sequential decoders are convolutional channel decoders that are characterized by having variable decoding complexity in changing channel conditions. They are widely used in wireless packet-switching networks and mobile communications. The major difference of multimedia networks from traditional networks is the deadline to display or (play) the arriving packets. Especially, this is more obvious in realtime video streaming applications. Real-time video streaming applications prefer User Datagram Protocol (UDP) for video packet transfers. The operation of sequential decoding in this paper is applied on wireless multimedia networks. Buffers are usually required by the sequential decoder to store packets if there is an empty space. Geometric/Pareto/1/N queue model is used to describe the behavior of the sequential decoders with finite buffers. In this paper, we present an analytical study on the finite buffer behaviors of the sequential decoding system and provide closed form expression for the blocking probability due to limited buffer capacity, system throughput, and average buffer occupancy. We present also a simulation study to show the average buffer occupancy.Download TCP Traffic Control Evaluation and Reduction over Wireless Networks Using Parallel Sequential Decoding MechanismEURASIP Journal on Wireless Communications and Networking, 2007The assumption of TCP-based protocols that packet error (lost or damaged) is due to network conge... more The assumption of TCP-based protocols that packet error (lost or damaged) is due to network congestion is not true for wireless networks. For wireless networks, it is important to reduce the number of retransmissions to improve the effectiveness of TCP-based protocols. In this paper, we consider improvement at the data link layer for systems that use stop-and-wait ARQ as in IEEE 802.11 standard. We show that increasing the buffer size will not solve the actual problem and moreover it is likely to degrade the quality of delivery (QoD). We firstly study a wireless router system model with a sequential convolutional decoder for error detection and correction in order to investigate QoD of flow and error control. To overcome the problems along with high packet error rate, we propose a wireless router system with parallel sequential decoders. We simulate our systems and provide performance in terms of average buffer occupancy, blocking probability, probability of decoding failure, system throughput, and channel throughput. We have studied these performance metrics for different channel conditions, packet arrival rates, decoding time-out limits, system capacities, and the number of sequential decoders. Our results show that parallel sequential decoders have great impact on the system performance and increase QoD significantly.Download Improving UDP performance using intermediate QoD-aware hop system for wired/wireless multimedia communication systemsInternational Journal of Network Management, 2011ABSTRACT Protein Crystallization Screening Using Associative Experimental DesignLecture Notes in Computer Science, 2015Protein crystallization remains a highly empirical process. The purpose of protein crystallizatio... more Protein crystallization remains a highly empirical process. The purpose of protein crystallization screening is the determination of the main factors of importance leading to protein crystallization. One of the major problems about determining these factors is that screening is often expanded to many hundreds or thousands of conditions to maximize combinatorial chemical space coverage for a successful (crystalline) outcome. In this paper, we propose a new experimental design method called \"Associative Experimental Design (AED)\" that provides a list of screening factors that are likely to lead to higher scoring outcomes or crystals by analyzing preliminary experimental results. We have tested AED on Nucleoside diphosphate kinase, HAD superfamily hydrolase, and nucleoside kinase proteins derived from the hyperthermophile Thermococcus thioreducens [1]. After obtaining the candidate novel conditions, we have confirmed that AED method yielded high scoring crystals after experimenting in a wet lab.Download I-Quest: an intelligent query structuring based on user browsing feedback for semantic retrieval of video dataMultimedia Tools and Applications, 2009In spite of significant improvements in video data retrieval, a system has not yet been developed... more In spite of significant improvements in video data retrieval, a system has not yet been developed that can adequately respond to a user’s query. Typically, the user has to refine the query many times and view query results until eventually the expected videos are retrieved from the database. The complexity of video data and questionable query structuring by the user S2S: structural-to-syntactic matching similar documentsKnowledge and Information Systems, 2008ABSTRACT PressBase : a presentation synchronization database for distributed multimedia systemsIEEE Transactions on Multimedia, 2000Multimedia presentations are the basic objects of multimedia databases. Since a multimedia presen... more Multimedia presentations are the basic objects of multimedia databases. Since a multimedia presentation is not an instant display of a query result, the control knowledge (or synchronization requirements) has to be incorporated into the database and necessary precautions have to be taken for a lengthy presentation. Active databases provide a mechanism for incorporation of control knowledge by using event-condition-action (ECA) User characterization for online social networksSocial Network Analysis and Mining, 2016 Sprite pyramid for videos and images having finite-depth scenes2004 Ieee International Conference on Multimedia and Expo, Jun 30, 2004 Integrating virtual camera controls into digital video2004 Ieee International Conference on Multimedia and Expo, Jun 30, 2004Virtual camera controls (VCC) for digital video enable the viewers to visualize interesting objec... more Virtual camera controls (VCC) for digital video enable the viewers to visualize interesting objects from their perspective. VCC also allow us to play the video from different angles. In this sense, VCC do not only support visualization and browsing capabilities but also support playback from different angles. VCC management requires accurate global motion estimation and accurate sprite generation. After motion Stationary background generation in mpeg compressed video sequencesIeee International Conference on Multimedia and Expo 2001 Icme 2001, Aug 22, 2001The development of the new video coding standard, MPEG4, has triggered many video segmentation al... more The development of the new video coding standard, MPEG4, has triggered many video segmentation algorithms that address the generation of the video object planes (VOPs). The background of a video scene is one kind of VOPs where all other video objects are layered on. In this paper, we propose a method for the generation of the stationary background in a Interactive multimedia presentation management in distributed multimedia systemsProceedings International Conference on Information Technology: Coding and Computing, 2000Multimedia presentations are difficult to handle in the existence of user interactions and comple... more Multimedia presentations are difficult to handle in the existence of user interactions and complex synchronization requirements. We present a synchronization model which can handle both time-based and event-based actions. The model can cope with the VCR-type user interactions. We also give a simple rule-based synchronization specification language which does not complicate as user interactions are allowed Global motion estimation from semi-dynamic video using motion sensorsProceedings. International Conference on Image Processing, 2000 Modeling and Verification of Interactive Flexible Multimedia Presentations Using PROMELA/SPINLecture Notes in Computer Science, 2002Download Management of Backward-Skip Interactions Using Synchronization Rules Streaming Multimedia Presentations in Distributed Multimedi",
  "content_length": 10620,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:23"
}