{
  "name": "Rama Chellappa",
  "homepage": "https://engineering.jhu.edu/ece/faculty/rama-chellappa",
  "status": "success",
  "content": "Rama Chellappa - Department of Electrical and Computer Engineering Contact rchella4@jhu.edu Connect Website Google Scholar Research Areas Computer vision artificial intelligence pattern recognition image and signal processing machine learning biometrics Rama Chellappa, a Bloomberg Distinguished Professor in electrical and computer engineering and biomedical engineering and former interim Director of the Data Science and Artificial Intelligence Initiative, is a pioneer in the area of artificial intelligence. His work in computer vision, pattern recognition, and machine learning have had a profound impact on areas including biometrics, smart cars, forensics, and 2D and 3D modeling of faces, objects, and terrain. His work in motion capturing and imaging shows promise for future use in health care and medicine. He joined Johns Hopkins after 29 years at the University of Maryland, where he served lengthy stretches as chair of the Department of Electrical and Computer Engineering and director of the Center for Automation Research. He is a member of Johns Hopkins’ Center of Imaging Science, the Center for Language and Speech processing, the Institute for Assured Autonomy, and the Mathematical Institute for Data Science. Chellappa’s research has shaped the field of facial recognition technology—developing detailed face models based on shape, appearance, texture, and bone and muscle structure. Under a recent program called Janus, he and his team have developed a high-accuracy face recognition system that serves critical needs for federal and commercial sectors. The team has also worked on modeling facial expressions, with potential for a variety of medical applications. He also is known as an expert in machine learning, a branch of artificial intelligence that instructs computer systems to perform tasks based on patterns and inferences. In one recent experiment, Chellappa and colleagues tested the skills of expert forensic facial examiners against the skills of machines; as it turned out, the best results came when both sides worked together. This research has implications for how machine learning algorithms can help doctors diagnose disease. Chellappa has also worked on gait analysis, which can apply to an enormous range of uses—everything from diagnosing Parkinson’s disease to human identification at a distance. He was born and raised in South India, near Chennai, and studied at the University of Madras and the Indian Institute of Science before attending Purdue University in Indiana, which was then building an international reputation for a branch of machine learning known as statistical pattern recognition. Chellapa’s book, Can We Trust AI ?, was published by the Johns Hopkins University Press in 2022. Chellappa is the 2020 recipient of the Jack S. Kilby Signal Processing Medal for his contributions to image and video processing, particularly face recognition. This is one of the top honors from the Institute of Electrical and Electronics Engineers (IEEE), where Chellappa is a life fellow and previously served as editor-in-chief of journals. Among many other honors, Chellappa was named the recipient of the 2025 Azriel Rosenfeld Lifetime Achievement Award, a Foreign Fellow of the Indian National Academy of Engineering, and has also won technical achievement awards from the IEEE Computer Society and the IEEE Signal Processing Society; the latter also awarded him with its highest honor, the Society Award. In 2023, he was inducted into the National Academy of Engineering, the highest honor accorded to an engineer. He earned his doctorate in electrical engineering there, studying under mentors including Keinosuke Fukunaga, R.L. Kashyap, and King Sun-Fu. (Some three decades later, Chellappa won the esteemed award named for Sun-Fu, from the International Association of Pattern Recognition.) His interest in biomedical engineering dates back to these years when he designed a cardiac pacemaker as his capstone project. During his doctoral studies, he also conducted research at the University of Maryland (UMD) with Azriel Rosenfeld, one of the founding fathers of computer vision. The mentorship launched his career in this field, which trains computers to identify, classify, and understand digital images. Chellappa later joined UMD as a professor in 1991, after 10 years at the University of Southern California. Related News View All News A New Approach to Healthy Aging Categories Research A new 10,000-square-foot hub at Bayview Medical Center is helping the Johns Hopkins Human Aging Project bring together a variety of disciplines to test technology-driven solutions for aging's biggest challenges Chellappa and Sisman brief Congress on AI’s promise and pitfalls Categories Department News Two Johns Hopkins electrical and computer engineering faculty members briefed congressional staff at the Hopkins Bloomberg Center on Aug. 4. Hosted by the Johns Hopkins Data Science and AI Institute,… AI Puts Too Much Weight Where It Shouldn’t: On Your Body Size Categories Research New research shows body recognition systems rely heavily on BMI, raising questions about accuracy Site Menu Close ﻿",
  "content_length": 5154,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:17"
}