{
  "name": "Raman Arora",
  "homepage": "http://www.cs.jhu.edu/~raman/Home.html",
  "status": "success",
  "content": "Home Raman Arora Associate Professor Department of Computer Science Mathematical Institute for Data Science (MINDS) Center for Language and Speech Processing (CLSP) Johns Hopkins University 3400 N Charles Street Malone Hall 331 Baltimore, MD 21218 arora at cs dot jhu dot edu Google Scholar Research Interests Machine Learning, Bandit Algorithms, RL, Privacy, Robustness My research is supported by an NSF CAREER award on Understanding Inductive Biases in Modern Machine Learning, an NSF BIGDATA award on Privacy in Machine Learning, a DARPA award on Robust Adversarial Learning, an NSF BIGDATA award on Stochastic Approximation for Subspace and Multiview Representation Learning, an NSF TRIPODS award on Foundations of Graph and Deep Learning, and an NSF CRCNS award on Computational Neuroscience. See here for more details. Our work on Deep CCA was a finalist for the 2023 ICML Test-of-Time Award. Bio: I am a member of the Mathematical Institute for Data Science (MINDS), the Center for Language and Speech Processing (CLSP) and the Institute for Data Intensive Engineering and Science (IDIES). Prior to joining Johns Hopkins, I was a Research Assistant Professor at the Toyota Technological Institute at Chicago (TTIC), a visiting researcher at Microsoft Research, Redmond and a research associate at the the University of Washington, Seattle. I received my Ph.D. from the University of Wisconsin-Madison. During 2019 - 2020, I was a member of the Department of Mathematics at the Institute for Advanced Study. I was a visiting scientist at the Simons Institute for the Theory of Computing at UC Berkeley during summer 2019 program as part of the program on Foundations of Deep Learning, during Fall 2020 program as part of the program on Theory of Reinforcement Learning, and during Spring 2022 as part of the program on Learning and Games. Group: Thanh Nguyen-Tang (Postdoc) Yunjuan Wang (Ph.D. student) Austin Watkins (Ph.D. student) Kaibo Zhang (Ph.D. student) Alumni Enayat Ullah (Ph.D., 2024, currently a researcher at Meta) [THESIS] Teodor Marinov (Ph.D., 2021, currently a researcher at Google) [THESIS] Poorya Mianjy (Ph.D., 2022, currently a quant researcher at Citadel) [THESIS] Tuo Zhao (Ph.D., 2017, currently an assistant professor at GaTech) [THESIS] Ashley Llorens (D.Engg., 2023, currently Corporate VP at Microsoft Research) Jalaj Upadhyay (Postdoc, 2017--2019, currently at Rutgers University) Sophia Sklaviadis (M.S., 2022) Naomi Saphra (M.S., CS) Mina Ghashami (Visiting Ph.D. student, CS) Mo Yu (Visiting Ph.D. student, CLSP, currently at WeChat AI, Tencent) Anh Do (M.S., CS) Sihan Wei (M.S., CS) Neil Mallinar (B.S., currently pursuing Ph.D. at UCSD) Corbin Rosset (B.S., currently at Microsoft) Chengzhi Shi (M.S., BME) Openings: I am seeking highly motivated and self-driven M.S./Ph.D. students with a strong mathematical background in machine learning. Prospective PhD students are encouraged to apply to the CS graduate program at Johns Hopkins: https://www.cs.jhu.edu/graduate-studies/phd-program/. I am also looking for postdoctoral researchers with an interest in theoretical machine learning, online learning, robustness, and differential privacy. Contact me for more details.",
  "content_length": 3212,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:20"
}