{
  "name": "Ramchandra Phawade",
  "homepage": "https://iitdh.ac.in/prb",
  "status": "success",
  "content": "Ramchandra Phawade Assistant Professor Contact Department of Computer Science and Engineering Indian Institute of Technology Dharwad Permanent Campus, Chikkamalligawad, Dharwad, Karnataka, India - 580011. India Email: prbXiitdhYacYin [@/X,./Y] Research interests : Concurrency, Automata Theory and Logic in Computer Science Petri nets : connections with product systems, expressions Modelling and analysis of timed, concurrent systems using Petri nets Formal verification of Timed systems Academic Background In 2017 Completed two years of Postdoc at IIT Bombay In 2015 Obtained PhD in Theoretical Computer Science from The Institute of Mathematical Sciences (IMSc), Chennai In 2007 Obtained MSc in Computer Science from Chennai Mathematical Institute (CMI), Chennai In 2002 Obtained BTech in Computer Science and Engineering from National Institute of Technology (NIT), Calicut Graduate Students: Tephilla Prince is a PhD scholar working with me and S. Sheerazuddin on BMC of infinite state systems using Petri nets and local logics. Rajdeep Baruri is looking at verification of Multi-agent systems in his PhD. Nitish Kumar has completed his Masters thesis (MS) on implementation of completeness parameters of BMC for temporal logics (2024). Publications: DBLP listing Journal Publications: (with S. Akshay and Lo\\\"ic H\\'elu\\\"et), Combining free choice and time in Petri nets, in Journal of Logical and Algebraic Methods in Programming, vol. 110, Elsevier, (2020) (draft) Kleene Theorems for Free Choice Automata over Distributed Alphabets, in T. Petri Nets and Other Models of Concurrency, LNCS, vol. 14: 146-171, Springer (2019) (full version here) (with Kamal Lodaya), Kleene theorems for synchronous products with matching, in Transactions on Petri Nets and Other models of Concurrency, LNCS, vol. 9410:84--108, Springer (2015). click here for pdf Conference Publications: (with Amrutha Benny, Sandeep Chandran, Rajshekar Kalayappan, Piyush Kurur), faRM-LTL: A Domain-Specific Architecture for Flexible and Accelerated Runtime Monitoring of LTL Properties, in 24th RV, LNCS, vol. 15191, 2024, pp. 109-127. (with Devendra Bhave, SN Krishna and Ashutosh Trivedi), On Timed Scope-bounded Context-sensitive Languages, in 23rd DLT, LNCS, vol. 11647, Springer, Warsaw, 2019, pp. 168--181. Full version here Kleene theorem for free choice nets labelled with distributed alphabets, in 12th PNSE, CEUR-WS/Vol-2138, Bratislava, 2018, 77--98. Kleene theorem for labelled free choice nets without distributed choice, in 10th PNSE, CEUR-WS, vol. 1591, Toru\\'n, 2016, pp. 132--152. Full version here (with S. Akshay and Lo\\\"ic H\\'elu\\\"et), Combining free choice and time in Petri nets, in 23rd TIME, Denmark, 2016. Full version here (with Devendra Bhave, Vrunda Dave, SN Krishna and Ashutosh Trivedi), A Perfect Class of Context-Sensitive Timed Languages, in 20th DLT, LNCS, vol. 9840, Springer, Montre\\'al, 2016, pp. 38--50. Full version here (with Devendra Bhave, Vrunda Dave, SN Krishna and Ashutosh Trivedi), A Logical Characterization for Dense-Time Visibly Pushdown Automata, in 10th LATA, LNCS, vol. 9618, Springer, Prague, 2016, pp. 89--101. Full version here (with Kamal Lodaya), Kleene theorems for labelled free choice nets, in 8th PNSE, CEUR-WS, vol. 1160, Tunis, 2014, pp. 75--89. click here for pdf (with Kamal Lodaya and Madhavan Mukund), Kleene theorems for product systems, in 13th DCFS, LNCS, vol. 6808, Springer, Limburg, 2011, pp. 235--247. click here for pdf Pre-prints: (with Tephilla Prince and S. Sheerazuddin), Bounded Model Checking for Unbounded Client-server Systems click here for pdf The time period of Autumn(August to December) Semester coincides with Kharif season for crops, and for Spring it is Rabi in Farmer's language. Scheduled Teaching in semester (Spring/Rabi 2024-25 AY) Automata Theory (CS 202)-- 8 credit CORE course-Spring 2023-24. Courses taught from August 2017 to December 2024 CORE courses (for BTech/MTech) Combinatorics and Probability (CS 634)-- 6 credit CORE course-Autumn 2023-24. Automata Theory (CS 202)-- 8 credit CORE course-Spring 2023-24. Computer Programming and Utilization (CS 101 -- 4 credits) Autumn 2022-23. Automata Theory (CS 202)-- 8 credit CORE course-Spring 2022-23. Automata Theory (CS 202)-- 8 credit CORE course-Spring 2021-22. Automata Theory (CS 202)-- 8 credit CORE course-Summer 2021. Automata Theory (CS 202)-- 8 credit CORE course-Spring 2020-21. Design and Analysis of Algorithms (CS 205)--6 credit CORE course.--Spring 2019-20 Software Systems Lab (CS 213)--8 credit CORE course--Autumn/Kharif 2019. Automata Theory (CS 202)-- 8 credit CORE course--Summer 2019. Design and Analysis of Algorithms (CS 218)-- 6 credit CORE course--Spring 2019 Software Systems Lab (CS 213)--8 credit CORE course -- Autumn 2018. Computer Programming and Utilization (CS 101) --2.75 credits CORE -- 12 hours -- Summer 2018 Design and Analysis of Algorithms (CS 218)-- 6 credit CORE course -- 43 hours -- Spring 2018. Software Systems Lab (CS 251)--8 credit CORE course -- (at IIT Goa) -- 44 hours -- Autumn 2017. Grad level courses/Electives Logic and its applications ---- 6 credits--Autumn 2023-24. Logic and its applications (Grad Course)---- 6 credits--Autumn 2021. Formal Models for concurrent and asynchronous systems (Grad Course)-- 6 credit course--Spring 2021 Logic for Computer Science --6 credit course for undergrads -- Autumn 2020-21. Logic and its applications (Grad Course)---- 6 credits--Autumn 2020. Formal Models for concurrent and asynchronous systems (Grad Course)-- 6 credit course--Spring 2019 Special topics in automata and logics (Grad Course)-- 6 credit course--\tSpring 2019 Logic and its applications (Grad Course)---- 6 credits--Autumn 2018. Engineering Mathematics for Advanced studies (Grad Course)-- 1 credit --6 hours- Spring 2018. Engineering Mathematics for Advanced studies (Grad Course)-- 1 credit--6 hours-Autumn 2018. Applications of Petri nets: Some areas they used in are: communication protocols and networks, software, workflow and business processes, hardware, control systems and military systems. Few pointers are given below. Success stories on Petri nets world, Industrial applications of Colored Petri nets, A paper by Van Der Aalst. Last modified: November 22, 18:31:00 IST 2024",
  "content_length": 6278,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:23"
}