{
  "name": "Ramesh Raskar",
  "homepage": "https://www.media.mit.edu/people/raskar/overview",
  "status": "success",
  "content": "Overview ‹ Ramesh Raskar — MIT Media Lab Find People, Projects, etc. Search Login Register Email: Password: Work for a Member organization and need a Member Portal account? Register here with your official email address. Register a Member Account Ramesh Raskar Associate Professor of Media Arts and Sciences Contact Information: raskar@media.mit.edu Personal Website Groups Camera Culture Ramesh Raskar is an Associate Professor at MIT Media Lab and directs the Camera Culture research group. His focus is on Machine Learning and Imaging for health and sustainability. They span research in physical (e.g., sensors, health-tech), digital (e.g., automated and privacy-aware machine learning) and global (e.g., geomaps, autonomous mobility) domains.At MIT, his co-inventions include camera to see around corners, femto-photography, automated machine learning (auto-ML), private ML (split-learning), low-cost eye care devices (Netra,Catra, EyeSelfie), a novel CAT-Scan machine, motion capture (Prakash), long distance barcodes (Bokode), 3D interaction displays (BiDi screen),  new theoretical models to augment light fields (ALF) to represent wave phenomena and algebraic rank constraints for 3D displays(HR3D).In his recent role at Facebook, he launched and led innovation teams in Digital Health, Health-tech, Satellite Imaging, TV and Bluetooth bandwidth for Connectivity, VR/AR and 'Emerging Worlds' initiative for FB.Before MIT, he co-invented techniques for AR, Computational Photography, Shader Lamps (projector-AR), composite RFID (RFIG), multi-flash non-photorealistic camera for depth edge detection, quadric transfer methods for multi-projector curved displays.He received the Lemelson Award 2016 and ACM SIGGRAPH Achievement Award 2017, Technology Review TR100 award 2004 (which recognizes top young innovators under the age of 35), Global Indus Technovator Award (top 20 Indian technology innovators worldwide) 2003, Alfred P. Sloan Research Fellowship award 2009 and Darpa Young Faculty award 2010. Other awards include Marr Prize honorable mention 2009, LAUNCH Health Innovation Award, presented by NASA, USAID, US State Dept+ NIKE, 2010, Vodafone Wireless Innovation Award (first place) 2011.His work has appeared in NYTimes, CNN, BBC, NewScientist, TechnologyReview and several technology news websites.His invited and keynote talks include TED, Wired, TEDMED, Darpa Wait What, MIT Technology Review, Google SolveForX and several TEDx venues.His co-authored books include Spatial Augmented Reality,  Computational Photography, and 3D Imaging (under preparation).He has worked on special research projects at Google [X], Facebook, Apple and co-founded/advised several startups. He launched REDX.io, a platform for young innovators to explore AI-for-Impact. He frequently consults for dynamic organizations to conduct 'SpotProbing' exercises to spot opportunities and probe solutions.He holds 90+ US patents.Personal webpage http://www.media.mit.edu/~raskarSpecialties: Health-tech, Digital health, Computer Vision, Machine Learning, Imaging, Optics, Displays, Sensors, Medical Imaging, RFID, Projector, VR-AR, Computation Photography, HCI, Tech-Transfer, Ventures, Startups",
  "content_length": 3186,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:27"
}