{
  "name": "Ramesh Govindan",
  "homepage": "https://govindan.usc.edu",
  "status": "success",
  "content": "Ramesh Govindan Office: GCS 502C Office Hours (Fall 2025): Th 4-6pm, GCS SB7 brief bio Ramesh Govindan is the Northrop Grumman Chair in Engineering and Professor of Computer Science at the University of Southern California. Dr. Govindan received the B.Tech degree from the Indian Institute of Technology at Madras, and the M.S. and Ph.D. degrees from the University of California at Berkeley. Dr. Govindan’s research has focused on scalable and robust routing infrastructures in large networks such as the Internet, on the structural properties of the Internet, and on the architectures and programming systems for wireless and mobile networks. He is a Fellow of the ACM and of the IEEE, the recipient of the 2018 IEEE Internet Award, a former Editor-in-Chief of the IEEE Transactions on Mobile Computing, and a Distinguished Alumnus of the Indian Institute of Technology, Madras. selected publications SIGCOMM ZENITH: Towards A Formally Verified Highly-Available Control Plane Pooria Namyar, Arvin Ghavidel, Mingyang Zhang, and 4 more authors In Proceedings of the ACM SIGCOMM 2025 Conference, 2025 Abs Bib Link Today, large-scale software-defined networks use microservice-based controllers. Bugs in these controllers can reduce network availability by making the data plane state inconsistent with the high-level intent. To recover from such inconsistencies, modern controllers periodically reconcile the state of all the switches with the desired intent. However, periodic reconciliation limits the availability and performance of the network at scale. We introduce Zenith, a microservice-based controller that avoids inconsistencies by design rather than always relying on recovery mechanisms. We have formally verified Zenith’s specifications and have proved that it ensures the network state will eventually be consistent with intent. We automatically generate Zenith’s code from its specification to minimize the likelihood of errors in the final implementation. Zenith’s guarantees and abstractions also enable developers to independently verify SDN applications and ensure end-to-end safety and correctness. Zenith resolves inconsistencies 5\\texttimes faster than today’s designs and significantly improves availability. @inproceedings{namyar.p.ghavidel.a.ea:zenith, author = {Namyar, Pooria and Ghavidel, Arvin and Zhang, Mingyang and Madhyastha, Harsha V. and Ravi, Srivatsan and Wang, Chao and Govindan, Ramesh}, title = {ZENITH: Towards A Formally Verified Highly-Available Control Plane}, booktitle = {Proceedings of the ACM SIGCOMM 2025 Conference}, year = {2025}, series = {SIGCOMM '25}, pages = {409–433}, address = {New York, NY, USA}, publisher = {Association for Computing Machinery}, isbn = {9798400715242}, url = {https://doi.org/10.1145/3718958.3750533}, doi = {10.1145/3718958.3750533}, numpages = {25}, keywords = {software defined networking, formal methods, availability}, topics = {dcn}, location = {S\\~{a}o Francisco Convent, Coimbra, Portugal} } SIGCOMM Firefly: Scalable, Ultra-Accurate Clock Synchronization for Datacenters Pooria Namyar, Yuliang Li, Weitao Wang, and 10 more authors In Proceedings of the ACM SIGCOMM 2025 Conference, 2025 Abs Bib Link Cloud-based financial exchanges require sub-10ns device-to-device clock synchronization accuracy while adhering to Coordinated Universal Time (UTC). Existing clock sync techniques struggle to meet this demand at scale and are vulnerable to clock drift, jitter, and path asymmetries. Firefly, a software-driven datacenter clock sync system, scalably, cost-effectively, and reliably achieves very high clock sync accuracy. It employs a distributed consensus algorithm on a random overlay graph to rapidly converge to a common time while applying gradual adjustments to device hardware clocks. To realize consistent sync-to-UTC (external sync) across devices while maintaining a stable device-to-device internal sync, Firefly uses a novel technique, layered synchronization, that decouples internal and external syncs. In a 248-machine Clos network, Firefly achieves sub-10ns device-to-device and ≤1μs device-to-UTC sync, and is resilient to time server failure and unstable clocks. @inproceedings{namyar.p.li.y.ea:firefly, author = {Namyar, Pooria and Li, Yuliang and Wang, Weitao and Dukkipati, Nandita and Yap, Kk and Gong, Junzhi and Chen, Chen and Gao, Peixuan and Ray, Devdeep and Kumar, Gautam and Ma, Yidan and Govindan, Ramesh and Vahdat, Amin}, title = {Firefly: Scalable, Ultra-Accurate Clock Synchronization for Datacenters}, booktitle = {Proceedings of the ACM SIGCOMM 2025 Conference}, year = {2025}, series = {SIGCOMM '25}, pages = {434–452}, address = {New York, NY, USA}, publisher = {Association for Computing Machinery}, isbn = {9798400715242}, url = {https://doi.org/10.1145/3718958.3750502}, doi = {10.1145/3718958.3750502}, numpages = {19}, topics = {dcn}, keywords = {clock synchronization, financial exchange, UTC synchronization, path asymmetry, distributed consensus}, location = {S\\~{a}o Francisco Convent, Coimbra, Portugal} } NSDI Preventing Network Bottlenecks: Accelerating Datacenter Services with Hotspot-Aware Placement for Compute and Storage Hamid Bazzaz, Weiwu Pang, Yingjie Bi, and 10 more authors In 22nd USENIX Symposium on Networked Systems Design and Implementation (NSDI 25), 2025 Bib @inproceedings{bazzaz.h.pang.w.ea:preventing, author = {Bazzaz, Hamid and Pang, Weiwu and Bi, Yingjie and Yu, Minlan and Govindan, Ramesh and Cardwell, Neal and Dukkipati, Nandita and Tsai, Meng-Jung and DeForeest, Chris and Jin, Yuxue Jin and Carver, Charles and Kopański, Jan and Cheng, Liqun}, title = {Preventing Network Bottlenecks: Accelerating Datacenter Services with Hotspot-Aware Placement for Compute and Storage}, booktitle = {22nd USENIX Symposium on Networked Systems Design and Implementation (NSDI 25)}, year = {2025}, } NSDI Solving Max-Min Fair Resource Allocations Quickly on Large Graphs Pooria Namyar, Behnaz Arzani, Srikanth Kandula, and 5 more authors In 21st USENIX Symposium on Networked Systems Design and Implementation (NSDI 24), 2024 Abs Bib Link We consider the max-min fair resource allocation problem. The best-known solutions use either a sequence of optimizations or waterfilling, which only applies to a narrow set of cases. These solutions have become a practical bottleneck in WAN traffic engineering and cluster scheduling, especially at larger problem sizes. We improve both approaches: (1) we show how to convert the optimization sequence into a single fast optimization, and (2) we generalize waterfilling to the multi-path case. We empirically show our new algorithms Pareto-dominate prior techniques: they produce faster, fairer, and more efficient allocations. Some of our allocators also have theoretical guarantees: they trade off a bounded amount of unfairness for faster allocation. We have deployed our allocators in Azure’s WAN traffic engineering pipeline, where we preserve solution quality and achieve a roughly 3× speedup. @inproceedings{namyar.p.arzani.b.ea:solving, author = {Namyar, Pooria and Arzani, Behnaz and Kandula, Srikanth and Segarra, Santiago and Crankshaw, Daniel and Krishnaswamy, Umesh and Govindan, Ramesh and Raj, Himanshu}, title = {{S}olving {M}ax-{M}in {F}air {R}esource {A}llocations {Q}uickly on {L}arge {G}raphs}, booktitle = {21st USENIX Symposium on Networked Systems Design and Implementation (NSDI 24)}, year = {2024}, } NSDI Finding Adversarial Inputs for Heuristics using Multi-level Optimization Pooria Namyar, Behnaz Arzani, Ryan Beckett, and 5 more authors In 21st USENIX Symposium on Networked Systems Design and Implementation (NSDI 24), 2024 Abs Bib Link Production systems use heuristics because they are faster or scale better than their optimal counterparts. Yet, practitioners are often unaware of the performance gap between a heuristic and the optimum or between two heuristics in realistic scenarios. We present MetaOpt, a system that helps analyze heuristics. Users specify the heuristic and the optimal (or another heuristic) as input, and MetaOpt automatically encodes these efficiently for a solver to find performance gaps and their corresponding adversarial inputs. Its suite of built-in optimizations helps it scale its analysis to practical problem sizes. To show it is versatile, we used MetaOpt to analyze heuristics from three domains (traffic engineering, vector bin packing, and packet scheduling). We found a production traffic engineering heuristic can require 30% more capacity than the optimal to satisfy realistic demands. Based on the patterns in the adversarial inputs MetaOpt produced, we modified the heuristic to reduce its performance gap by 12.5×. We examined adversarial inputs to a vector bin packing heuristic and proved a new lower bound on its performance. @inproceedings{namyar.p.arzani.b.ea:finding, author = {Namyar, Pooria and Arzani, Behnaz and Beckett, Ryan and Segarra, Santiago and Raj, Himanshu and Krishnaswamy, Umesh and Govindan, Ramesh and Kandula, Srikanth}, title = {{F}inding {A}dversarial {I}nputs for {H}euristics using {M}ulti-level {O}ptimization}, booktitle = {21st USENIX Symposium on Networked Systems Design and Implementation (NSDI 24)}, year = {2024}, }",
  "content_length": 9217,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:23"
}