{
  "name": "Rami Bahsoon",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/bahsoon-rami.aspx",
  "status": "success",
  "content": "Dr Rami Bahsoon - School of Computer Science - University of Birmingham Dr Rami Bahsoon School of Computer ScienceReader in Software Engineering Contact details Telephone+44 (0) 121 414 4770Emailr.bahsoon@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Rami Bahsoon is a Reader in Software Engineering (Associate Professor) and founding member of the Birmingham Software Engineering Group and the Cloud Software Engineering \"interest group\" at the School of Computer Science, University of Birmingham. He is also an active member of the Centre of Excellent for Research in Computational Intelligence and Applications (CERCIA), member of the the Birmingham Cyber Security and Privacy Centre and the newly established Birmingham Centre on Responsible AI. Please follow the link below to find out more about Rami's work: Dr Rami Bahsoon's-personal webpage Recent publications Article Gong, J, Chen, T & Bahsoon, R 2024, 'Dividable Configuration Performance Learning', IEEE Transactions on Software Engineering. https://doi.org/10.1109/TSE.2024.3491945 Bahsoon, R & Al Ghanmi, H 2024, 'ExplanaSC: A Framework for Determining Information Requirements for Explainable Blockchain Smart Contracts', IEEE Transactions on Software Engineering, vol. 50, no. 8, 10546473, pp. 1984-2004. https://doi.org/10.1109/TSE.2024.3408632 Zhang, N, Bahsoon, R, Tziritas, N & Theodoropoulos, G 2024, 'Knowledge Equivalence in Digital Twins of Intelligent Systems', ACM Transactions on Modeling and Computer Simulation, vol. 34, no. 1, 3. https://doi.org/10.1145/3635306 Zarrad, A, Bahsoon, R & Manimaran, P 2024, 'Optimizing regression testing with AHP-TOPSIS metric system for effective technical debt evaluation', Automated Software Engineering, vol. 31, no. 2, 58. https://doi.org/10.1007/s10515-024-00458-5 Diamantopoulos, G, Bahsoon, R, Tziritas, N & Theodoropoulos, G 2024, 'SymBChainSim: A Novel Simulation System for Info-Symbiotic Blockchain Management', ACM Transactions on Modeling and Computer Simulation. https://doi.org/10.1145/3704917 Kumar, S, Chen, T, Bahsoon, R & Buyya, R 2023, 'DebtCom: Technical Debt-Aware Service Recomposition in SaaS Cloud', IEEE Transactions on Services Computing, vol. 16, no. 4, pp. 2545-2558. https://doi.org/10.1109/TSC.2023.3237043 Ahmadjee, S, MERA-GÓMEZ, C, Bahsoon, R & KAZMAN, RICK 2022, 'A study on blockchain architecture design decisions and their security attacks and threats', ACM Transactions on Software Engineering and Methodology, vol. 31, no. 2, 36e. https://doi.org/10.1145/3502740 Conference contribution Vergara Marcillo, C, Bahsoon, R, Tziritas, N & Theodoropoulos, G 2025, A Connectionist Approach to Federated Digital Twins. in MH Lees, W Cai, SA Cheong, Y Su, D Abramson, JJ Dongarra & PMA Sloot (eds), Computational Science – ICCS 2025: 25th International Conference, Singapore, Singapore, July 7–9, 2025, Proceedings, Part III. 1 edn, Lecture Notes in Computer Science, vol. 15906, Springer, pp. 60-74, 25th International Conference on Computational Science (ICCS 2025), Singapore, Singapore, 7/07/25. https://doi.org/10.1007/978-3-031-97632-2_5 Diamantopoulos, G, Tziritas, N, Bahsoon, R & Theodoropoulos, GK 2025, Dynamic Digital Twins of Blockchain Systems: State Extraction and Mirroring. in 2024 28th International Symposium on Distributed Simulation and Real Time Applications (DS-RT). International Workshop/Symposium on Distributed Simulation and Real-Time Applications (DS-RT), IEEE, pp. 26-33. https://doi.org/10.48550/arXiv.2412.05527, https://doi.org/10.1109/DS-RT62209.2024.00014 Adeyemo, H, Bahsoon, R & Tino, P 2024, An Approach for Dynamic Behavioural Prediction and Fault Injection in Cyber-Physical Systems. in BDCAT '23: Proceedings of the IEEE/ACM 10th International Conference on Big Data Computing, Applications and Technologies., 8, Association for Computing Machinery (ACM), BDCAT '23, Taormina (Messina), Italy, 4/12/23. https://doi.org/10.1145/3632366.3632389 Diamantopoulos, G, Tziritas, N, Bahsoon, R & Theodoropoulos, G 2024, Dynamic Data-Driven Digital Twins for Blockchain Systems. in E Blasch, F Darema & A Aved (eds), Dynamic Data Driven Applications Systems: 4th International Conference, DDDAS 2022, Cambridge, MA, USA, October 6–10, 2022, Proceedings. 1 edn, Lecture Notes in Computer Science, vol. 13984, Springer, pp. 283–292, DDDAS2022 Conference, Cambridge, Massachusetts, United States, 6/10/22. https://doi.org/10.1007/978-3-031-52670-1 Diamantopoulos, G, Bahsoon, R & Tziritas, N 2023, Digital Twins for Dynamic Management of Blockchain Systems. in 2022 Winter Simulation Conference (WSC)., 10015447, Simulation Winter Conference, IEEE, pp. 2876-2887, Simulation Winter Conference 2022, Singapore, Singapore, 11/12/22. https://doi.org/10.1109/WSC57314.2022.10015447 Diamantopoulos, G, Tziritas, N, Bahsoon, R & Theodoropoulos, G 2023, Dynamic Blockchain Reconfiguration: Balancing the Trilemma Trade-off Using Digital Twins. in 2023 IEEE/ACM 27th International Symposium on Distributed Simulation and Real Time Applications (DS-RT)., 10305798, Proceedings (IEEE International Symposium on Distributed Simulation and Real-Time Applications), IEEE, 2023 IEEE/ACM International Symposium on Distributed Simulation and Real Time Applications (DS-RT 2023), Singapore, Singapore, 4/10/23. https://doi.org/10.1109/DS-RT58998.2023.00026 Adeyemo, H, Bahsoon, R & Tino, P 2023, Surrogate-based Digital Twin for Predictive Fault Modelling and Testing of Cyber Physical Systems. in 2022 IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT). IEEE/ACM International Conference on Big Data Computing Applications and Technologies, IEEE, pp. 166-169, 9th IEEE/ACM International Conference on Big Data Computing, Applications and Technologies, Vancouver, Washington, United States, 6/12/22. https://doi.org/10.1109/BDCAT56447.2022.00028 Diamantopoulos, G, Bahsoon, R & Tziritas, N 2023, SymBChainSim: A Novel Simulation Tool for Dynamic and Adaptive Blockchain Management and its Trilemma Tradeoff. in M Loper, D Jin & CD Carothers (eds), SIGSIM-PADS '23: Proceedings of the 2023 ACM SIGSIM Conference on Principles of Advanced Discrete Simulation. PADS: Principles of Advanced and Distributed Simulation, Association for Computing Machinery (ACM), New York, pp. 118–127, SIGSIM-PADS '23, Orlando, Florida, United States, 16/06/23. https://doi.org/10.1145/3573900.3591121 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 6630,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:29"
}