{
  "name": "Ramin Zabih [Tech]",
  "homepage": "http://www.cs.cornell.edu/rdz",
  "status": "success",
  "content": "Ramin Zabih Ramin Zabih Professor of Computer Science Faculty Director, arXiv Research Scientist, Google (on leave from Cornell) 607 255 8413 607 255 4428 (fax) Research My research interests lie in computer vision and its applications, especially in medical imaging. I have worked on a variety of problems in early vision, including motion and stereo; many of these problems can be solved very accurately using algorithms based on graph cuts, which was given the Helmholtz Prize at ICCV 2011/13 and the Koenderink prize at ECCV 2012 for contributions that have stood the test of time. I am a fellow of the ACM and the IEEE. I've worked for over a decade to bring open access to the computer vision community. I am the president and founder of the Computer Vision Foundation, a non-profit which now co-sponsors CVPR, ICCV and WACV with the IEEE Computer Society, and for which I was awarded the 2016 Everingham Prize. The main role of CVF is to provide an open access version of the CVPR, ICCV and WACV papers. I've also been extensively involved in organizing vision conferences. I served as a Program Chair for CVPR 2007 (the primary North American vision conference), and for the International Workshop on Computer Vision 2008, 2010, 2012, 2014, 2016 and 2018 (a small workshop for senior vision researchers), and General Chair for CVPR 2013, CVPR 2020 and CVPR 2024. I was the Editor-in-Chief of the IEEE Transactions on Pattern Analysis and Machine Intelligence from 2009 through 2012, and from 2013 through 2015 I chaired the PAMI-TC, which runs the main vision conferences. In 2018 I was a general chair for the European Conference on Computer Vision (ECCV). Since the fall of 2013 I am at Cornell Tech with a joint appointment in Weill Cornell Radiology. Since 2016 I have also worked at Google as a research scientist, where I am currently on leave. Students My current PhD students are Richard Strong Bowen and Michelle Shu (in CS). Alumni include Yuri Boykov (postdoc), Akshay Bhat, Alex Fix, Charles\tHerrmann, Jing Huang, Vera Kettnaker, Junhwan Kim, Vladimir Kolmogorov, Ashish Raj, Gurmeet Singh, Olga Veksler, Chen Wang and Jie Zhu (PhD students) and Brian Cody, Chris Danis, Devin Kennedy, Justin Miller, Greg Pass Brian Rogan and Justin Voskuhl (undergraduates). Selected Publications The best source is my Google scholar link. A few of my papers in computer vision, plus some unpublished drafts, are here. Teaching At CornellTech I primarily teach masters students, my most recent class is CS5112. While I taught in Ithaca, I developed a new course, called CS100R, that used camera-controlled robots to introduce basic concepts in computer science. I typically taught graduate computer vision , or advanced undergraduate programming. In the more distant past I also taught CS212, an honors-level freshman introduction to CS. Professional Activities General co-chair, IEEE/CVF Conference on Computer Vision and Pattern Recognition(CVPR), 2024 General co-chair, IEEE/CVF Conference on Computer Vision and Pattern Recognition(CVPR), 2020 General co-chair, European Conference on Computer Vision (ECCV), 2018 General co-chair, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2013 Editor-in-Chief, IEEE Transactions on Pattern Analysis and Machine Intelligence, 2009-2012 Program co-chair, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2007 Program co-chair, International Workshop on Computer Vision, 2008, 2010, 2012, 2014, 2016, 2018 Area chair: IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2005, 2006, 2008, 2011; IEEE International Conference on Computer Vision (ICCV), 2005, 2009, 2011, 2013; European Conference on Computer Vision (ECCV), 2008, 2012, 2016. External I've consulted for several companies, primarily Microsoft. I've been an external committee member for some talented students, including David Tolliver  and Dhruv Batra at CMU, Hao Jiang at Simon Fraser, Pushmeet Kohli and Pawan Kumar at Oxford Brookes, and Gabriel Tavares at Rutgers. Acknowledgements This web page design is courtesy of Dan Huttenlocher",
  "content_length": 4102,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:29"
}