{
  "name": "Ramin Yahyapour",
  "homepage": "https://www.gwdg.de/about-us/organization/management/ramin-yahyapour",
  "status": "success",
  "content": "Professor Dr. Ramin Yahyapour | GWDG - IT in der WissenschaftProfilSeit Oktober 2011 ist Professor Dr. Ramin Yahyapour Geschäftsführer der GWDG, einer gemeinsamen Einrichtung der Georg-August-Universität Göttingen und der Max-Planck-Gesellschaft. Zeitgleich wurde er als ordentlicher Professor für Praktische Informatik an die Georg-August-Unversität Göttingen berufen. Zuvor wirkte er als Professor an der Technischen Universität Dortmund sowie als Direktor des IT- und Mediencenters und als CIO der Universität.Professor Yahyapour hat im Fach Elektrotechnik promoviert. Seine Forschungsschwerpunkte liegen in den Bereichen Ressourcenmanagement sowie deren Anwendung in Service-orientierten Infrastrukturen, Cloud-Computing und Datenmangement.Professor Yahyapour war und ist aktiv an zahlreichen nationalen und internationalen Forschungsprojekten beteiligt, beispielsweise als wissenschaftlicher Koordinator des Projektes SLA@SOI, gefördert durch das siebte Forschungsrahmenprogramm der Europäischen Union oder Mitglied des Exekutivkomitees des Networks of Excellence CoreGRID. Professor Yahyapour ist regelmäßig als Gutachter für Förderinstitutionen und als Berater für IT-Organisationen tätig. Des Weiteren ist er Organisator und Mitglied in Programm-Komitees verschiedener Konferenzen und Workshops sowie Gutachter für eine Vielzahl von Fachpublikationen.LebenslaufZeitraumTätigkeitseit 2017Mitglied der International Max Planck Research School for Genome Science (IMPRS-GS) an der Göttingen Graduiertenschule für Neurowissenschaftenseit 2014Mitglied des Verwaltungsrates des DFN-Vereinsseit 2014Mitglied des Rates für Informationsinfrastrukturen der Gemeinsamen Wissenschaftskonferenzseit 2014Chief Information Officer der Georg-August-Universität Göttingen und Universitätsmedizin Göttingenseit 2012Mitglied der IT-Kommission der DFG und Sprecher der Netzwerkkommissionseit 2011Ordentlicher Professor für Praktische Informatik an der Georg-August-Universität Göttingenseit 2011Geschäftsführer der GWDG, Göttingen2009 - 2011Chief Information Officer der Technischen Universität Dortmund2009 - 2011Ordentlicher Professor für Angewandte Informatik, Technische Universität Dortmund2008 - 2011Wissenschaftlicher Koordinator des FP7 Projekts SLA@SOI2007 - 2011Direktor des IT- und Media Center, Technische Universität Dortmund2004 - 2008Institutsleiter und Mitglied im Steuerungsgremium des CoreGRID Network of Excellence2003 - 2007Forscher/Juniorprofessor2002Promotion Elektrotechnik, Technische Universität DortmundzuvorStudium Elektro- und Informationstechnik, Technische Universität DortmundForschungsschwerpunkteDistributed service infrastructuresManagement of research dataHigh Performance ComputingResource management and schedulingeScienceLehrveranstaltungenProfessor Yahyapour lehrt in den Bereichen Parallel Computing, Service Computing, Verteilte Systeme, Cloud Computing und eScience.Weitere Informationen über Professor Yahyapours Vorlesungen und Seminare an der Georg-August-Universität Göttingen finden Sie unter der Rubrik Lehre.Ausgewählte PublikationenBerber, F, Yahyapour, R, A High-Performance Persistent Identifier Management Protocol. In: 2017 International Conference on Networking, Architecture, and Storage (NAS), Shenzhen, China, August 07-09, 2017, DOI: 10.1109/NAS.2017.8026839Fatemi Moghaddam, F, Wieder P, Yahyapour, R, POBRES: Policy-Based Re-Encryption Schema for Secure Resource Management in Clouds, In: IEEE EUROCON 2019 - 17th IEEE International Conference on Smart Technologies, Ohrid, Macedonia, July, 06-09, 2017, DOI: 10.1109/EUROCON.2017.8011070Zhang F, Fu X, Yahyapour R, CBase: A New Paradigm for Fast Virtual Machine Migration across Data Centers. In: CCGrid 2017, Proceedings of the 17th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, Madrid, Spain - May 14-17, 2017: 284-293, DOI: 10.1109/CCGRID.2017.26Armenta-Cano F A, Tchernyhk A, Cortés-Mendoza J M, Yahyapour R, Drodoy A Yu, Bourry P, Kliazovich D, Aveisyan A, Nesmachnow S, Min_c: Heterogeneous concentration policy for energy-aware scheduling of jobs with resource contention. In: Programming and Computer Software (2017) Vol. 43 (3):204-215, DOI: 10.1134/S0361768817030021Yang S, Wieder P, Yahyapour R, Trajanovki S, Fu X, Reliable Virtual Machine Placement in Distributed Clouds. In: IEEE Transactions on Parallel and Distributed Systems, (2017) Vol. 28 (10): 2965-2978, DOI: 10.1109/TPDS.2017.2693273Mohebi A, Saeed Reza A, Ying WT, Tutut H, Yahyapour R: Iterative big data clustering algorithms: a review. In: Journal of Software - Practice and Experience, Vol. 46 (1) (2016): 107-129, DOI: 10.1002/spe.2341Weitere Veröffentlichungen finden Sie bei ResearchGate. Prof. Dr.Ramin YahyapourGeorg-August-Universität GöttingenInstitute of Computer SciencesFür weitere Fragen zum Bereich Lehre wenden Sie sich an teaching@gwdg.de.",
  "content_length": 4902,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:29"
}