{
  "name": "Rami G. Melhem",
  "homepage": "https://people.cs.pitt.edu/~melhem",
  "status": "success",
  "content": "Homepage Biography Rami Melhem received a B.E. in Electrical Engineering from Cairo University in 1976, an M.A. degree in Mathematics and an M.S. degree in Computer Science from the University of Pittsburgh in 1981, and a Ph.D. degree in Computer Science from the University of Pittsburgh in 1983. He was an Assistant Professor at Purdue University prior to joining the faculty of The University of Pittsburgh in 1986, where he is currently a Professor in the Computer Science Department which he chaired from 2000 to 2009. His research interests include Power Management, Parallel Computer Architectures, Fault-Tolerant Systems, Optical Networks and High Performance Computing. Dr. Melhem served and is serving on program committees of numerous conferences and workshops and on the editorial boards of the IEEE Transactions on Sustainable Computing, the IEEE Transactions on Computers, the IEEE Transactions on Parallel and Distributed systems, the Computer Architecture Letters, the Journal of Parallel and Distributed Computing and The Journal of Sustainable Computing, Informatics and Systems. Dr. Melhem is a fellow of IEEE and a member of the ACM. Curriculum Vitae Research Interests Power Aware Computing Power-aware scheduling Conference Papers Journal Papers Book Chapters Parallel, Distributed, and High Performance Architectures and Systems Parallel Architectures and communications Load Balancing and Mapping Parallel Solutions for Sparse Systems Conference Papers Journal Papers Book Chapters Real-time and Embedded Systems Scheduling in Real-time Systems Conference Papers Journal Papers Book Chapters Optical Networks Multiplexing Optical Networks Partitioned Optical Star Topology Pipelining of Optical Busses Coincidence Pulse Addressing Conference Papers Journal Papers Book Chapters Wireless and Sensor Networks Network Security Wireless Networks Network Control Conference Papers Journal Papers Book Chapters Fault Tolerant Systems Fault Tolerance in Real Time Systems Routing in Fault Tolerant Systems Compiler Assisted Fault Detection in Multiprocessors Modular Redundancy and Reconfiguration Conference Papers Journal Papers Book Chapters Teaching Graduate Courses CoE1502 : Advanced Digital Design CS3410 : Advanced Topics in Computer Architectures CS2410 : Computer Architectures CS2450 : Parallel Computing CS3420 : Fault Tolerant Parallel and Distributed Systems CS3530 : Advanced Topics in Distributed and Real-Time Systems CS3580 : Advanced Topics in Parallel Computing CS2001 : Research Topics in Computer Science Undergraduate Courses CS1645/2045 : Introduction to High Performance Computing Systems CS1541 : Introduction to Computer Architecture CS0447 : Computer Organization and Assembly Language Programming CS0445 : Introduction to Information Structures CS1550 : Introduction to Operating Systems Address: 210 S. Bouquet StreetDepartment of Computer ScienceUniversity of PittsburghPittsburgh, PA 15260-9161USA office: Sennott Square Building, Room 6429 (SENSQ 6429) Phone: +1 412 624 8426 email: melhem (at) cs (dot) pitt (dot) edu",
  "content_length": 3068,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:29"
}