{
  "name": "Ramnatthan Alagappan",
  "homepage": "https://ramalagappan.github.io",
  "status": "success",
  "content": "Ram Alagappan Ram Alagappan Assistant Professor, Computer Science, UIUC Email: ramn@illinois.edu Office: 3122 Siebel Center, 201 N Goodwin Ave, Urbana, IL 61801 DASSL Research Group CV | Google Scholar | DBLP I am an Assistant Professor in the Department of Computer Science at the University of Illinois Urbana-Champaign. I am a computer systems researcher. My work spans storage, memory, and distributed systems. I am often interested in improving the reliability and performance of these systems. I co-lead the Distributed And Storage Systems Laboratory (DASSL) at UIUC CS. I am always looking for self-motivated, hardworking, and creative PhD students. If you are interested in systems (OS, memory, storage, distributed systems), please apply to the UIUC CS PhD program and mention my name in the application. Latest [Jun 25] Invited talk at TigerBeetle's Systems Distributed 25. [Dec 24] Awarded NetApp faculty fellowship! [Nov 24] LazyLog won the Best Paper Award at SOSP 24! [Nov 24] Co-chaired the Systems Doctoral Workshop at SOSP 2024. [Oct 24] Invited talk at University of Pennsylvania Distributed Systems Laboratory. [Sep 24] Invited talk at UC Berkeley Sky Computing Lab. [Aug 24] Our work on low-latency shared logs will appear in SOSP 24. [May 24] Will serve on NSDI 25 PC. [May 24] Will serve on SOCC 25 PC. [Jan 24] NSF CAREER Award. [Jan 24] UIUC List of Teachers Ranked as Outstanding (for CS598 - Storage Systems Fall 2023). [Dec 23] Our work on high-performance replication for KV stores will appear in FAST 24. [Oct 23] Invited to co-chair ICDCS track on Algorithms for Distributed Computing, Scheduling and OS. [Sep 23] Invited to serve on the PC for SOSP 24, EuroSys 24 Fall, Systor 24, HotStorage 24. [Sep 23] Our work on disaggregated storage fault tolerance will appear in EuroSys 24. [Jun 23] UIUC List of Teachers Ranked as Excellent (for CS598 - Storage Systems Spring 2023). [Jan 23] UIUC List of Teachers Ranked as Excellent (for CS598 - Storage Systems Fall 2022). Awards Research Best Paper SOSP '24 - LazyLog NSF CAREER Award Best Paper FAST '20 - CAD UW CS Graduate Student Research (Best Dissertation Research) Award - Honorable Mention - 2019 Best Paper FAST '18 - PAR/CTRL Best Paper FAST '17 - CCFS Best Paper Nominee FAST '17- Redundancy Does Not Imply Fault Tolerance Teaching List of Teachers Ranked as Outstanding at UIUC (for CS598 - Storage Systems Fall 2023) List of Teachers Ranked as Excellent at UIUC (for CS598 - Storage Systems Spring 2023) List of Teachers Ranked as Excellent at UIUC (for CS598 - Storage Systems Fall 2022) CS 739 ranked 1st among all Spring 20 courses in student evaluations Nominated for SACM CoW Teaching Award for CS 739 Service Distinguished Reviewer HotStorage - 2021 Best Shadow PC Reviewer Eurosys '19 Grants and Scholarships IBM-IL Discovery Accelerator Institute (IIDAI) grant 2024 MS Azure Credits Research Award for $50,000 - 2019 Facebook Distributed Systems Research Award for $50,000 - 2019 Alumni Scholarship, UW Madison - 2013 Publications [Conference] [Workshop] [Journal & Invited] Conference Publications Low End-to-End Latency atop a Speculative Shared Log with Fix-Ante Ordering Shreesha G. Bhat, Tony Hong, Xuhao Luo, Jiyu Hu, Aishwarya Ganesan, Ramnatthan Alagappan OSDI 2025 PDF OSDI '25 LazyLog: A New Shared Log Abstraction for Low-Latency Applications Xuhao Luo, Shreesha G. Bhat*, Jiyu Hu*, Ramnatthan Alagappan, Aishwarya Ganesan *=equal contribution. SOSP 2024 PDF Best Paper Award SOSP '24 IONIA: High-Performance Replication for KV Stores Yi Xu*, Henry Zhu*, Prashant Pandey, Alex Conway, Rob Johnson, Aishwarya Ganesan, Ramnatthan Alagappan *=co-primary authors. FAST 2024 PDF FAST '24 SplitFT: Fault Tolerance for Disaggregated Datacenters via Remote Memory Logging Xuhao Luo, Ramnatthan Alagappan, Aishwarya Ganesan EuroSys 2024 PDF EuroSys '24 Automatic Reliability Testing For Cluster Management Controllers Xudong Sun, Wenqing Luo, Tyler Gu, Aishwarya Ganesan, Ramnatthan Alagappan, Michael Gasch, Lalith Suresh, and Tianyin Xu 16th USENIX Symposium on Operating Systems Design and Implementation PDF OSDI '22 Exploiting Nil-Externality for Fast Replicated Storage Aishwarya Ganesan, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau 28th ACM Symposium on Operating Systems Principles PDF, Talk Slides, Video - short, Video - long, Code Invited to Transactions on Storage SOSP '21 The Storage Hierarchy is Not a Hierarchy: Optimizing Caching on Modern Storage Devices with Orthus Kan Wu, Zhihan Guo, Guanzhou Hu, Kaiwei Tu, Ramnatthan Alagappan, Rathijit Sen, Kwanghyun Park, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau 19th USENIX Conference on File and Storage Technologies PDF FAST '21 From Wisckey to Bourbon: A Learned Index for Log-structured Merge Trees Yifan Dai, Yien Xu, Aishwarya Ganesan, Ramnatthan Alagappan, Brian Kroth, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Proceedings of the 14th Symposium on Operating System and Design Implementation PDF OSDI '20 Can Applications Recover from fsync Failures? Anthony Rebello, Yuvraj Patel, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau The 2020 USENIX Annual Technical Conference PDF Invited to Transactions on Storage ATC '20 Strong and Efficient Consistency with Consistency-aware Durability Aishwarya Ganesan, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau 18th USENIX Conference on File and Storage Technologies PDF, Talk Slides Best Paper Award Invited to Transactions on Storage FAST '20 Fault-Tolerance, Fast and Slow: Exploiting Failure Asynchrony in Distributed Systems Ramnatthan Alagappan, Aishwarya Ganesan, Jing Liu, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Proceedings of the 13th Symposium on Operating System and Design Implementation PDF, Talk Slides OSDI '18 Protocol-Aware Recovery for Consensus-Based Storage Ramnatthan Alagappan, Aishwarya Ganesan, Eric Lee, Aws Albarghouthi, Vijay Chidambaram, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Proceedings of the 16th USENIX Conference on File and Storage Technologies PDF, Talk Slides Best Paper Award Invited to Transactions on Storage Invited to ATC 19 Best of the Rest Coverage: Morning Paper, zdnet FAST '18 Atomic In-Place Updates for Non-Volatile Main Memories with KaminoTx Amir Saman Memaripour, Anirudh Badam, Amar Phanishayee, Yanqi Zhou, Ramnatthan Alagappan, Karin Strauss, Steven Swanson Proceedings of the Twelfth European Conference on Computer Systems PDF EuroSys '17 Redundancy Does Not Imply Fault Tolerance: Analysis of Distributed Storage Reactions to Single Errors and Corruptions Aishwarya Ganesan, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Proceedings of the 15th USENIX Conference on File and Storage Technologies PDF, Talk Slides, Code Best Paper Award Nominee Invited to Transactions on Storage Invited to Usenix ;login: Coverage: StorageMojo, Morning Paper, DHSR's blog FAST '17 Application Crash Consistency and Performance with C2FS Thanumalayan Sankaranarayana Pillai, Ramnatthan Alagappan, Lanyue Lu, Vijay Chidambaram, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Proceedings of the 15th USENIX Conference on File and Storage Technologies PDF, Talk Slides Best Paper Award Invited to Transactions on Storage Invited to ATC 17 Best of the Rest Coverage: Morning Paper FAST '17 Correlated Crash Vulnerabilities Ramnatthan Alagappan, Aishwarya Ganesan, Yuvraj Patel, Thanumalayan Sankaranarayana Pillai, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Proceedings of the 12th Symposium on Operating System and Design Implementation PDF, Talk Slides, Code OSDI '16 All File Systems Are Not Created Equal: On the Complexity of Crafting Crash-Consistent Applications Thanumalayan Sankaranarayana Pillai, Vijay Chidambaram, Ramnatthan Alagappan, Samer Al Kiswany, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Proceedings of the 11th Symposium on Operating System and Design Implementation PDF, Code Invited to Communications of the ACM Invited to ACM Queue Coverage: Morning Paper OSDI '14 Workshop Publications Reasoning about modern datacenter infrastructures using partial histories Xudong Sun, Lalith Suresh, Aishwarya Ganesan, Ramnatthan Alagappan, Michael Gasch, Lilia Tang, Tianyin Xu HotOS 2021 HotOS '21 The Storage Hierarchy is Not a Hierarchy: Optimizing Caching on Modern Storage Devices with Orthus Kan Wu, Zhihan Guo, Guanzhou Hu, Kaiwei Tu, Ramnatthan Alagappan, Rathijit Sen, Kwanghyun Park, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau NVMW 2021 NVMW '21 Too Many Knobs to Tune? Towards Faster Database Tuning by Pre-selecting Important Knobs Konstantinos Kannelis, Ramnatthan Alagappan, Shivaram Venkataraman 15th Workshop on Hot Topics in Storage and File Systems PDF HotStorage '20 Beyond Storage APIs: Provable Semantics for Storage Stacks Ramnatthan Alagappan, Vijay Chidambaram, Thanumalayan Sankaranarayana Pillai, Aws Albarghouthi, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau 15th Workshop on Hot Topics in Operating Systems PDF, HotOS '15 Journal/Invited Publications Exploiting Nil-Externalizing Interfaces for Fast Replicated Storage Aishwarya Ganesan, Ramnatthan Alagappan, Anthony Rebello, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Transactions on Storage - May 2022 Fast tracked PDF TOS '22 Can Applications Recover from fsync Failures? Anthony Rebello, Yuvraj Patel, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Transactions on Storage - Vol. 17, Issue 2, June 2021 PDF TOS '21 Strong and Efficient Consistency with Consistency-aware Durability Aishwarya Ganesan, Ramnatthan Alagappan, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Transactions on Storage - Vol. 17, Issue 1, January 2021 Fast tracked PDF TOS '21 Protocol-Aware Recovery for Consensus-based Storage Ramnatthan Alagappan, Aishwarya Ganesan, Eric Lee, Aws Albarghouthi, Vijay Chidambaram, Andrea C. Arpaci-Dusseau, Remzi H. Arpaci-Dusseau Usenix AT",
  "content_length": 15867,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:29"
}