{
  "name": "Ramon Antonio Rodriges Zalipynis",
  "homepage": "https://www.hse.ru/en/staff/rodriges",
  "status": "success",
  "content": "Staff - Ramon Antonio Rodriges Zalipynis – HSE University В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAABCABCABCАААААRegular version of the siteCampus in MoscowNizhny NovgorodSaint PetersburgPermRUENFor visually-impairedFor visually-impairedUser profile (HSE staff only)SearchSearchAdvanced searchMenuHSE UniversityHSE UniversityAbout HSEFaculty and StaffRamon Antonio Rodriges ZalipynisRUENUser profile (HSE staff only)SearchAdvanced search  HomeTeachingResearch and PublicationsIn HSE news Language ProficiencyEnglishUkrainianRussianContactsPhone:+7 (495) 772-95-90 28240Address: 11 Pokrovsky Bulvar, Pokrovka Complex, room S914The Land of GISSPIN-RSCI: 5057-7700ORCID: 0000-0002-3627-6688ResearcherID: M-8811-2015Scopus AuthorID: 57197832000Google ScholarOffice hoursPlease, book in advance to avoid collisions: https://calendly.com/antonio-rrz/consultationBlogsResearchGateSupervisorS. LebedevPrintable versionwith publicationswith newsPrintHave you spotted a typo?Highlight it, click Ctrl+Enter and send us a message. Thank you for your help!To be used only for spelling or punctuation mistakes.Ramon Antonio Rodriges ZalipynisProfessor: Faculty of Computer Science / School of Software EngineeringRamon Antonio Rodriges Zalipynis has been at HSE University since 2015.  HomeTeachingResearch and PublicationsIn HSE newsEducation and Degrees2024Doctor of Sciences*2013Candidate of Sciences* (PhD)2008Master'sDonetsk National Technical UniversityDoctor of Science in Computer Science (DSc in Computer Science) * Candidate of SciencesAccording to the International Standard Classification of Education (ISCED) 2011, Candidate of Sciences belongs to ISCED level 8 - \"doctoral or equivalent\", together with PhD, DPhil, D.Lit, D.Sc, LL.D, Doctorate or similar. Candidate of Sciences allows its holders to reach the level of the Associate Professor.* Doctor of SciencesA post-doctoral degree called Doctor of Sciences is given to reflect second advanced research qualifications or higher doctorates in ISCED 2011. Professional Interests distributed systemsdatabasesbig dataclimate changeRemote Sensingdata managementgeospatial datageographic information systems cloud computinghigh performance computingAwards and Accomplishments Best Teacher — 2023, 2017–2021Young Faculty Support Programme (Group of Young Academic Professionals)Category \"New Lecturers under 30\" (2016–2017)TalksVLDB 2018 (Very Large Data Bases) VLDB is a premier conference in the area of Big Data, Distributed Systems, and Databases. The only talk with Russian Affiliation at VLDB for the last 10 years (2009–2018) and the first talk from the Higher School of Economics. SIGMOD 2019 (ACM Special Interest Group on Management of Data) ACM SIGMOD International Conference on Management of Data (SIGMOD) is a premier conference on Management of Data and Databases. This is the 7th paper at SIGMOD with Russian affiliation in the SIGMOD conference history (1975 – 2019, 45 years) and the first from the Higher School of Economics. VLDB 2020 (Very Large Data Bases) This is the 2nd article at VLDB with Russian affiliation in the previous 10 years (2010–2020) and the 2nd article from the Higher School of Economics. http://bitfun.gis.land SIGMOD 2021 (ACM Special Interest Group on Management of Data) The 3rd paper at SIGMOD for all the years of the SIGMOD conference (1975–2021, 47 years), where the first author is from a Russian institution. This is also the 10th paper at SIGMOD, where at least one author is from a Russian institution for all the years of the SIGMOD conference. This is the 2nd paper from the HSE University. The paper presents a novel Research & Development direction in the area of Array (Tensor) DBMS VLDB 2021 (Very Large Data Bases) The 1st Tutorial from a Russian institution at VLDB. Talk duration: 90 minutes (1.5 hours). The Tutorial is in the main conference program. Only 8 tutorials are accepted to VLDB 2021. http://vldb2021.gis.gg/ Courses (2025/2026)Computer Networks (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 3, 4 module)RusGeospatial Data Science (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)EngGeospatial Data Science (Mago-Lego; Faculty of Computer Science; 1, 2 module)EngMathematical Modeling and Simulation (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngResearch Seminar \"Swarm Intelligence Algorithms\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)RusSpatial Data Management (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 1, 2 module)EngPast CoursesCourses (2024/2025)Computer Networks (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 3, 4 module)EngGeospatial Data Science (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)EngGeospatial Data Science (Mago-Lego; 1, 2 module)EngMathematical Modeling and Simulation (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngResearch Seminar \"Swarm Intelligence Algorithms\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)RusSpatial Data Management (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 1, 2 module)EngCourses (2023/2024)Computer Networks (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 3, 4 module)EngGeospatial Data Science (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)EngGeospatial Data Science (Mago-Lego; 1, 2 module)EngMathematical Modeling and Simulation (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngResearch Seminar \"Geographic Information Systems\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 1 year, 1-3 module)RusResearch Seminar \"Swarm Intelligence Algorithms\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)RusSpatial Data Management (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 1, 2 module)EngCourses (2022/2023)Computer Networks (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 3, 4 module)EngGeospatial Data Science (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics, field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)EngGeospatial Data Science (Mago-Lego; 1, 2 module)EngMathematical Modeling and Simulation (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngResearch Seminar \"Digital Imaging\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 2 year, 1-3 module)RusResearch Seminar \"Geographic Information Systems\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 1 year, 1-3 module)RusResearch Seminar \"Swarm Intelligence Algorithms\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)RusSpatial Data Management (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 1, 2 module)EngCourses (2021/2022)Computer Networks (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 3, 4 module)EngGeospatial Data Science (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)EngResearch Seminar \"Geographic Information Systems\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 1 year, 1-3 module)RusResearch Seminar \"Swarm Intelligence Algorithms\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)RusCourses (2020/2021)Algorithms and Data Structures (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 2 year, 1-4 module)RusComputer Networks (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 3 year, 3, 4 module)EngResearch Seminar \"Geographic Information Systems\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 1 year, 3 module)RusDissertation for a degree of Doctor of Science2024R. A. Rodriges Zalipynis Растровые (Тензорные) СУБД: теоретические основы, программное обеспечение и приложенияMy DBLP and ACM DL Profiles IEEE Collabratec Profile Editorial board membership2023: Member of the Editorial Board , PLoS ONE (Plos One).Conferences2023The 49th International Conference on Very Large Data Bases (Vancouver). Presentation: FastMosaic in Action: A New Mosaic Operator for Array DBMSs2022The 48th International Conference on Very Large Data Bases (Sydney). Presentation: WebArrayDB: A Geospatial Array DBMS in Your Web BrowserThe 48th International Conference on Very Large Data Bases (Sydney). Presentation: SimDB in Action: Road Traffic Simulations Completely Inside Array DBMS2021ACM SIGMOD/PODS International Conference on Management of Data (Xi'an, Shaanxi). Presentation: Convergence of Array DBMS and Cellular Automata: A Road Traffic Simulation CaseRussian Supercomputing Days (Moscow). Presentation: First Results of Performance Evaluation of Geospatial Raster Data Processing SystemsThe 47th International Conference on Very Large Data Bases (Copenhagen). Presentation: Array DBMS: Past, Present, and (Near",
  "content_length": 14586,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:30"
}