{
  "name": "Ramya Korlakai Vinayak",
  "homepage": "https://ramyakv.github.io",
  "status": "success",
  "content": "Ramya's Home Page Ramya Korlakai Vinayak Home Publications Teaching Group CV Contact About Me I am the Dugald C. Jackson Assistant Professor in the ECE Department at University of Wisconsin-Madison. I am also affiliated with the Department of Computer Science and the Department of Statistics at UW-Madison. My research broadly spans the areas of Machine Learning, Statistical Inference, and Crowdsourcing. My research vision is to develop theoretically grounded machine learning tools to make reliable inferences using data that comes from people. Previously, I worked with Prof. Sham Kakade as a postdoctoral researcher in the Paul G. Allen School of Computer Science and Engineering at University of Washington, Seattle prior to joining UW-Madison. I graduated from the Department of Electrical Engineering, California Institute of Technology (Caltech) where I was adviced by Prof. Babak Hassibi. I was supported by the Faculty for the Future fellowship from 2013-2015, awarded by the Schlumberger Foundation. Before Caltech, I obtained my undergraduate degree (B. Tech) from Indian Institute of Technology Madras (IIT Madras) with a major in Electrical Engineering and a minor in Physics. [Joining the group] I am looking for highly motivated graduate students. If you are already a graduate student at UW-Madison and are interested in working with me, please send me an email describing your research interests and CV. If you are not a graduate student at UW-Madison yet, but are interested in joining my research group, please apply to UW-Madison graduate program. Unfortunately, I am not able to reply to all the email inquiries from students who are in the process of applying to UW-Madison graduate programs. News Work on analyzing gaps in text-to-image models has been accepted for ICCV 2025! We introduce a new benchmark dataset and novel metrics based on marginal utility of attribute specification to analyze the performance of text-to-image generation models. Work on sample-efficient personalizable reward models for pluralistic alignment has been accepted for ICLR 2025! Work on rethinking confidence and thresholds in pseudolabeling-based SSL has been accepted for ICML 2025! Work on understanding cognitive overload and contextual bias in crowdsourced clustering has been accepted for The Web Conference 2025 as oral presentation! Work on learning confidence functions for auto-labeling has been accepted for Neurips 2024! Work on learning metric from limited pairwise comparisons has been accepted for UAI 2024! Congratulaitons Zhi and Geelon! Two papers accepted for AISTATS 2024! Congratulaitons Harit, Lin, Gokcan and Reid! Work with my students Harit and Lin on Human-in-the-loop OOD detection with FPR control where we propose a novel mathematically grounded framework that incorporates expert human feedback to safely update the OOD detection threshold, ensuring robustness to variations in OOD data encoun-tered after deployment. Work with my students Gokcan and Reid where we study the novel problem of learning the distribution of user preferences over a population via pairwise comparison queries with only one response per individual in the ideal point model and analyze fundamental questions of identifiability and recovery guarantees. Work on framework to audit the characteristics of synthetically generated faces , in collaboration with Harrison, Sheema, Guruprasad and Kassem, accepted at AAAI 2024. Work on analyzing the performance on auto-labeling systems, in collaboration with Harit, Lin, and Fred, accepted at Neurips 2023 (Spotlight)! Work on theoretically grounded practical acitve crowdsourced clustering algorithm, in collaboration with Reid and Babak accepted at AAAI HCOMP 2023. Excited to receive NSF CAREER Award! Co-organizing the MidWest Machine Learning Symposium (MMLS) 2023 , to be held in Chicago on May 16-17, 2023. Co-organizer for Neurips 2022 Tutorial on Theory and Practice of Efficient and Accurate Dataset Construction with Fred Sala. Paper on learning unknown metric and preference points simultaneously accepted at Neurips 2022. Received NSF research grant for “Uncovering the cognitive and neural fingerprints that make each of us unique” in collaboration with Tim Rogers, Rob Nowak and Brad Postle. Presented paper on learning preference distributions from distance measurements at Allerton 2022, in collaboration with Gokcan and Rob. Received American Family Funding Initiative Award with Fred Sala for our project on understanding foundations of auto-labeling systems. Publications [Google Scholar Page] Pre-prints Adaptive Scoring and Thresholding with Human Feedback for Robust Out-of-Distribution Detection Daisuke Yamada, Harit Vishwakarma, Ramya Korlakai Vinayak Arxiv Pre-print, 2025. [pdf] [Abstract] Optimal Estimation of Change in a Population of Parameters Ramya Korlakai Vinayak, Weihao Kong, Sham Kakade Arxiv Pre-print, 2019. [pdf] [Abstract] Publications: Conferences and Journals PAL: Sample-Efficient Personalized Reward Modeling for Pluralistic Alignment Daiwei Chen, Yi (Reid) Chen, Aniket Rege, Zhi Wang, Ramya Korlakai Vinayak International Conference on Learning Representations (ICLR), 2025. [pdf] [Abstract] Rethinking Confidence Scores and Thresholds in Pseudolabeling-based SSL Harit Vishwakarma, Yi (Reid) Chen, Satya Sai Srinath Namburi, Sui Jiet Tay, Ramya Korlakai Vinayak,Frederic Sala International Conference on Machine Learning (ICML), 2025. [pdf] [Abstract] Query Design for Crowdsourced Clustering: Effect of Cognitive Overload and Contextual Bias Yi (Reid) Chen, Ramya Korlakai Vinayak The ACM Web Conference , 2025. (Oral Presentation) [pdf] [Abstract] Pearls from Pebbles: Improved Confidence Functions for Auto-labeling Harit Vishwakarma, Yi (Reid) Chen, Sui Jiet Tay, Satya Sai Srinath Namburi, Frederic Sala, Ramya Korlakai Vinayak Neural Information Processing Systems (NeurIPS), 2024. [pdf] [Abstract] Metric Learning from Limited Pairwise Preference Comparisons Zhi Wang, Geelon So, Ramya Korlakai Vinayak 40th Conference on Uncertainty in Artificial, Barcelona, Spain, (UAI), 2024. [pdf] [Abstract] Taming False Positives in Out-of-Distribution Detection with Human Feedback Harit Vishwakarma, Heguang Lin, Ramya Korlakai Vinayak 27th International Conference on Artificial Intelligence and Statistics, Valencia, Spain, (AISTATS), 2024. [pdf] [Abstract] Learning Populations of Preferences via Pairwise Comparison Queries Gokcan Tatli, Reid (Yi) Chen, Ramya Korlakai Vinayak 27th International Conference on Artificial Intelligence and Statistics, Valencia, Spain, (AISTATS), 2024. [pdf] [Abstract] Limitations of Face Image Generation Harrison Rosenberg, Shimaa Ahmed, Guruprasad V Ramesh, Ramya Korlakai Vinayak, Kassem Fawaz AAAI Conference on Artificial Intelligence (AAAI), 2024. [pdf] [Abstract] Promises and Pitfalls of Threshold-based Auto-labeling Harit Vishwakarma, Heguang Lin, Frederic Sala, Ramya Korlakai Vinayak Neural Information Processing Systems (NeurIPS), 2023. (Spotlight). [pdf] [Abstract] Crowdsourced Clustering via Active Querying: Practical Algorithm with Theoretical Guarantees Reid (Yi) Chen, Ramya Korlakai Vinayak, Babak Hassibi The 11th AAAI Conference on Human Computation and Crowdsourcing (HCOMP) , 2023. [pdf] [Abstract] One for All: Simultaneous Metric and Preference Learning over Multiple Users Gregory Canal, Blake Mason, Ramya Korlakai Vinayak, Robert Nowak Neural Information Processing Systems (NeurIPS), 2022. [pdf] [Abstract] Learning Preference Distributions From Distance Measurements Gokcan Tatli, Rob Nowak, Ramya Korlakai Vinayak 58th Annual Allerton Conference on Communication, Control, and Computing (Allerton) , 2022. [pdf] [Abstract] Fisher-Pitman permutation tests based on nonparametric Poisson mixtures with application to single cell genomics Zhen Miao, Weihao Kong, Ramya Korlakai Vinayak, Wei Sun, Fang Han Journal of the American Statistical Association , 2022. [pdf] [Abstract] Estimating the number and effect sizes of non-null hypotheses Jennifer Brennan, Ramya Korlakai Vinayak, Kevin Jamieson International Conference on Machine Learning (ICML), 2020. [pdf] [Abstract] Maximum Likelihood Estimation for Learning Populations of Parameters Ramya Korlakai Vinayak, Weihao Kong, Gregory Valiant, Sham Kakade International Conference on Machine Learning (ICML), 2019. [pdf] [Abstract] The Illusion of Change: Correcting for Bias when Inferring Changes in Sparse, Societal-Scale Data Gabriel Cadamuro, Ramya Korlakai Vinayak, Joshua Blumenstock, Sham Kakade, Jacob N. Shapiro The Web Conference (WWW), 2019. [pdf] [Abstract] Also presented at the AI for Social Good ICML 2019 Workshop Tensor-based crowdsourced clustering via triangle queries Ramya Korlakai Vinayak, Tijana Zrnic, Babak Hassibi. International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2017. [pdf] [Abstract] Crowdsourced Clustering: Querying Edges vs Triangles Ramya Korlakai Vinayak, Babak Hassibi. Neural Information Processing Systems (NeurIPS), 2016. [pdf] [Abstract] Similarity Clustering in the Presence of Outliers: Exact Recovery via Convex Program Ramya Korlakai Vinayak, Babak Hassibi. International Symposium on Information Theory (ISIT), 2016. [pdf] [Abstract] [code] Graph Clustering With Missing Data: Convex Algorithms and Analysis Ramya Korlakai Vinayak, Samet Oymak, Babak Hassibi. Neural Information Processing Systems (NeurIPS), 2014. [pdf] [Abstract] Sharp Performance Bounds for Graph Clustering via Convex Optimization Ramya Korlakai Vinayak, Samet Oymak, Babak Hassibi. International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2014. [pdf] [Abstract] Workshops Learning Preference Distributions From Pairwise Comparisons Gokcan Tatli, Reid Chen, Ramya Korlakai Vinayak International Workshop on Computational Social Choice (COMSOC) , 2023. Workshop The Many Facets of Preference-Based Learning (ICML Workshop) , 2023. Adaptive Out-of-Distribution Detection with Human-in-the-Loop Heguang Lin, ",
  "content_length": 30027,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:31"
}