{
  "name": "Ramyaa Ramyaa",
  "homepage": "https://www.cs.nmt.edu/~ramyaa",
  "status": "success",
  "content": "Ramyaa Ramyaa Ramyaa Ramyaa Ramyaa Ramyaa Contact Info Curriculum Vitae Research Theory/Logic: Machine Learning/Artificial Intelligence: Publications Teaching Other Affiliations/Service/Misc. (incomplete list) Contact Info Office: 218 Cramer Hall, NMT Email - ramyaa dot ramyaa at nmt dot edu Phone - 575 835 5949 Curriculum Vitae Research Theory/Logic: My research focuses on the relationship between computation (complexity) and Logic, focusing on implicit complexity (relating logical complexity of concepts to computational, resource-based complexity). I am also interested in formalizing emerging models of computation such as biological neural networks and studying conceptual complexity in these settings.\tI am also interested in Learning theory (complexity of learning). Machine Learning/Artificial Intelligence: I am interested in learning symbolic models - especially using non-symbolic models. This interest spans from interpretable AI to Differential Inductive Logic Programming to grammar learning to other forms of program synthesis to using reinforcement learning for pipeline synthesis to proof synthesis. I am particularly interested in the modularity/hierarchy of the learned models and using higher-order structural heuristics and learned program specifications to guide the model synthesis. I am also interested in using machine learning/data mining techniques to solve real-world problems. Further, I am interested in advancements in neural networks - especially biologically inspired developments. Publications Binnendyk E, Carmosino M, Kolokolova A, Ramyaa R, and Sabin M. Learning with distributional inverters. Proceedings of Machine Learning Research (PMLR), 2022. Norouzi S, Luis JJD, Ramyaa R, Young JS, Seneta EB, Darvish M, Hosseini M, and Ligon ER. CNN to mitigate atmospheric turbulence effect on Shack-Hartmann wavefront sensing: A case study on the Magdalena ridge observatory interferometer. In Machine Learning for Scientific Imaging 2022, IST EI Conference Proceedings, 2022. B Dennis and Ramyaa R. Comparative analysis of object visualization tools with respect to their use in education. IEEE Computer Society Technical Committee on Learning Technology, 2022. Krishnan G, Maier F, and Ramyaa R. Learning rules with stratified negation in differentiable ILP. In Advances in Programming Languages and Neurosymbolic Systems Workshop in Neurips, 2021. Link Aranda D, Towler A, Ramyaa R, and Kuo R. The usability of using educational game for teaching foundational concept in propositional logic. At International Conference on Advanced Learning Technologies (ICALT), 2021. Kuo R, Banawan M, Domingo J, Popescu E, and Ramyaa R. Report from women in engineering panel at IEEE ICALT 2021. Bulletin of the Technical Committee on Learning Technology (ISSN 2306-0212), 21(3):4–6, 2021 (Invited paper) Krishnan S, Ramyaa R. When two heads are better than one: nutritional epidemiology meets machine learning The American Journal of Clinical Nutrition, Volume 111, Issue 6, June 2020,, Link Aranda D, Towler A, Ramyaa R, and Kuo R. Designing an Educational Game for Teaching Foundational Concepts in Propositional Logic. 2019, E-learn Ramyaa R, Hosseini O, Krishnan GP and Krishnan S. Phenotyping Women Based on Dietary Macronutrients, Physical Activity and Body Weight Using Machine-Learning Tools. 2019. Nutrients 11 (7). Krishnan GP, Tadros T, Ramyaa R, Bazhenov M. Biologically inspired sleep algorithm for artificial neural networks. 2019. arXiv:1908.02240 Tadros T, Krishnan GP, Ramyaa R, Bazhenov M. Biologically inspired sleep algorithm for increased generalization and adversarial robustness in deep neural networks. Accepted in ICLR 2020. Link Ramyaa R, Das K, Marru S. Aggregating Ensemble Weather Predictions for Rainfall Prediction. ICMLC 2018 conference proceedings. Buss S, and Ramyaa R. Short refutations for the equivalence-chain principle for constant-depth formulas. Under review in Mathematical Logic Quarterly. Leivant D, and Ramyaa R. The computational contents of ramified corecurrence. selected for Foundations of Software Science and Computation Structures (FoSSaCS) conference, 2015. Danner N, Licata DR, Ramyaa R. Denotational cost semantics for functional languages with inductive types. ICFP 2015: 140-151 Danner N, Licata DR, Ramyaa R. Denotational cost semantics for functional languages with inductive types. arXiv:1506.01949. Link Ramyaa R, and Leivant D. Ramified Lazy Corecursion and Logspace. Logic and Computational Complexity. Vienna, 2014. Hofmann M, Ramyaa R, and Schöpp U. Pure pointer programs and tree isomorphism. Foundations of Software Science and Computation Structures. Foundations of Software Science and Computation Structures (FOSSCS), 2013. Springer Berlin Heidelberg. Verma A, Ramyaa R, Singh R, Marru S. Validating distance decay through agent based modeling, Special Issue of Security Informatics (SI) on Computational Criminology 2012. Ramyaa R, Leivant D. Ramified Corecurrence and Logspace, Electr. Notes Th. CS. 276%: 247-261 (2011). Leivant D, Ramyaa R. Implicit complexity for coinductive data: a characterization of corecurrence. DICE 2011: 1-14. Ramyaa R, Leivant D. Feasible Functions over Co-inductive Data, WoLLIC 2010: 191-203. Verma A, Ramyaa R, Singh R, and Marru S. Rationalizing police patrol beats using Voronoi Tessellations. ACM SIGKDD Workshop on Intelligence and Security Informatics, 2010. McClendon RW, Hoogenboom G, Jain A, Ramyaa R, Smith B. Temperature prediction for Frost Prediction, Proc. of the 2005 Southeast Regional Vegetable Conference. GA, 2005. P. 97. Ramyaa R, He C, Rasheed K. Using Machine Learning Techniques for Stylometry, IC-AI 2004. Potter WD, Ramyaa, Li J, Ghent J, Twardus D, Thistle H. STP: An Aerial Spray Treatment Planning System, Proc. of the IEEE SoutheastCon 2002, pp. 300-305, Columbia, SC. Teaching Spring 2022: CSE 342 (Formal Languages and Automata) CSE 489/589 (Reinforcement Learning). Other courses I regularly offer : CSE 241 Foundations of Computation (offered in Fall), CSE 489 Machine Learning (Offered in Fall), CSE 546 Theory of Computation (Alternate Spring) Other courses I have offered: CSE 544 Advanced Algorithms, CSE 489 Graph Algorithms Other Affiliations/Service/Misc. (incomplete list) Instructor for \"Agent Based Modelling\" in Criminal Justice Data Analysis , certificate course at IIT Kanpur (targeted at senior police officers) . Fellowship at Simons Institute of Theory, University of California, Berkeley, (Logical structures in Computation). WiCS, NMT. CiE 2022. CSR 2022. ICALT 2022. Proof Theory Virtual Seminar",
  "content_length": 6579,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:33"
}