{
  "name": "Ran Yi",
  "homepage": "https://yiranran.github.io",
  "status": "success",
  "content": "Ran Yi Ran Yi   (易冉) 上海交通大学计算机学院 副教授 Associate Professor, School of Computer Science Shanghai Jiao Tong University (SJTU), Shanghai, China E-mail: ranyi@sjtu.edu.cn Office: SEIEE 3-533, SJTU [Google Scholar] [DMCV Lab] Biography Ran Yi is an Associate Professor and Doctoral Supervisor with School of Computer Science, Shanghai Jiao Tong University, China. She is a member of Digital Media and Computer Vision Laboratory, working closely with Prof. Lizhuang Ma. She received her B.Eng and Ph.D. degree from Tsinghua University, China, in 2016 and 2021 respectively. Her Ph.D advisor is Prof. Yong-Jin Liu, and the lab director is Prof. Shi-Min Hu. She also closely collaborates with Prof. Yu-Kun Lai, Prof. Paul L. Rosin and Prof. Ying He. Her research interests include computer vision, computer graphics and machine intelligence. She has published 100 papers in IEEE TPAMI, ACM TOG, SIGGRAPH, CVPR and other important journals and conferences, including 72 CCF-A papers. She was selected for Young Elite Scientists Sponsorship Program by CAST, and won the Second Class of Beijing Science and Technology Progress Award, the First Prize of Higher Education Teaching Achievement Award of China Society of Image and Graphics, the Shi Qingyun Female Scientist Award of the Chinese Society of Image and Graphics (QingYing Group), the CCF-Tencent RhinoBird Fund Outstanding Project, the Dimitris N. Chorafas Foundation Young Researcher Award, the Top Ten Leading Scientific and Technological Achievements of the Big Data Expo, the ACM SIGAI China Rising Star Award, the Wu Wenjun Artificial Intelligence Excellent Doctoral Dissertation, the Excellent Award of China Industry University Research Cooperation Innovation Achievement Award, and the CCF-CV Academic Emerging Award, CAD/Graphics 2023 Best Paper Honorable Mention Award and Best Poster Award. She served as the Deputy Secretary General of CSIG Intelligent Graphics Committee and a reviewer for TPAMI, IJCV, SIGGRAPH, CVPR, etc. [ Research Interests | Openings | Publications | Honors | Education | Working | Teaching | Activities ] News [2025.11.08] 3 papers accepted by AAAI 2026 (including 1 oral). [2025.10.20] 1 paper accepted by TIP. [2025.09.30] 1 paper accepted by TVCG. [2025.09.18] 3 papers accepted by NeurIPS 2025 (including 1 spotlight). [2025.07.12] 1 paper accepted by TPAMI. [2025.06.26] 4 papers accepted by ICCV 2025. [2025.02.27] 5 papers accepted by CVPR 2025. [2025.01.22] 1 paper accepted by ICLR 2025. [2024.12.10] 2 papers accepted by AAAI 2025. [2024.07.30] 2 papers conditionally accepted by SIGGRAPH Asia 2024 (1 journal track, 1 conference track). [2024.07.24] 1 paper accepted by TPAMI. [2024.07.23] 1 paper accepted by Scientific Data. [2024.07.19] 1 paper accepted by TPAMI. [2024.07.16] 5 papers accepted by ACM MM 2024. [2024.07.05] 1 paper accepted by IJCV. [2024.07.01] 2 papers accepted by ECCV 2024. [2024.05.02] 1 paper accepted by ICML 2024. [2024.04.14] 1 paper accepted by TVCG. [2024.03.20] 1 paper accepted by TVCG. [2024.02.27] 4 papers accepted by CVPR 2024. [2023.12.14] 1 paper accepted by TVCG. [2023.12.09] 2 papers accepted by AAAI 2024. [2023.08.04] 1 paper conditionally accepted by SIGGRAPH Asia 2023. [2023.07.26] 2 papers accepted by ACM MM 2023. [2023.07.14] 5 papers accepted by ICCV 2023. [2023.05.18] 1 paper accepted by TVCG. [2023.04.20] 1 paper accepted by IJCAI 2023. [2023.02.28] 3 papers accepted by CVPR 2023. [2022.09.13] 1 paper accepted by TMM. [2022.07.04] 2 papers accepted by ECCV 2022. [2022.06.30] 2 papers accepted by ACM MM 2022. [2022.04.26] 1 paper accepted by SIGGRAPH 2022. [2022.04.21] 1 paper accepted by IJCAI 2022. [2022.03.02] 2 papers accepted by CVPR 2022. [2022.01.27] 1 paper accepted by TPAMI. [2022.01.08] 1 paper accepted by TMM. [2021.12.01] 1 paper accepted by AAAI 2022. [2021.11.06] 1 paper accepted by TVCG. [2021.07.03] I joined SJTU as an assistant professor. [2021.05.18] I passed PhD thesis defense. [2021.03.15] 1 paper accepted by TVCG. [2020.04.08] 1 paper accepted by TPAMI. [2020.03.06] 1 paper accepted by TPAMI. [2020.02.24] 1 paper accepted by CVPR 2020. Research Interests Top Computer Vision, Computer Graphics. Some specific research interests: Image/video/3D generation NeRF & 3DGS based 3D reconstruction Rendering quality enhancement & speedup Openings / Internship Top I am looking for self-motivated PhD, master and undergraduate students to join my research group! If you are interested in computer vision, computer graphics and want to join us, please send me your CV via email. For more info about internship at our group, please refer to this link. 团队招收博士生，硕士生和对科研感兴趣的本科生！ 目前2026年入学的普博生还有1个名额，欢迎联系～ 如果你对计算机视觉、计算机图形学感兴趣，希望加入我们团队，欢迎与我邮件联系（邮件请附上个人简历） 实习生招生贴 Selected Publications 2025 2024 2023 2022 2021 2020 2019 2018 2016 Top (* corresponding author) Summary: IEEE TPAMI (6) + ACM TOG (3) + IJCV (1) + SIGGRAPH (Asia) Conference (3) + CVPR/ICCV (27) + IEEE TVCG/TIP (8) + ICML/NeurIPS/ICLR (5) + AAAI/IJCAI/ACM MM (19) 2025 Improving Autoregressive Visual Generation with Cluster-Oriented Token Prediction [project] [paper] [code] [blog(中文解读)] Teng Hu, Jiangning Zhang, Ran Yi*, Jieyu Weng, Yabiao Wang, Xianfang Zeng, Zhucun Xue, Lizhuang Ma IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [CCF A] ATA: Adaptive Transformation Agent for Text-Guided Subject-Position Variable Background Inpainting [paper] [blog(中文解读)] Yizhe Tang, Zhimin Sun, Yuzhen Du, Ran Yi*, Guangben Lu, Teng Hu, Luying Li, Lizhuang Ma, Fangyuan Zou IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [CCF A] 3D Gaussian Head Avatars with Expressive Dynamic Appearances by Compact Tensorial Representations [paper] [code] [blog(中文解读)] Yating Wang, Xuan Wang, Ran Yi*, Yanbo Fan, Jichen Hu, Jingcheng Zhu, Lizhuang Ma* IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [CCF A] M3DM-NR: RGB-3D Noisy-Resistant Industrial Anomaly Detection via Multimodal Denoising [paper] Chengjie Wang, Haokun Zhu, Jinlong Peng, Yue Wang, Ran Yi*, Yunsheng Wu, Lizhuang Ma*, Jiangning Zhang IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025 [CCF A] SaRA: High-Efficient Diffusion Model Fine-tuning with Progressive Sparse Low-Rank Adaptation [project] [arxiv] [code] [blog(中文解读)] Teng Hu, Jiangning Zhang, Ran Yi*, Hongrui Huang, Yabiao Wang, Lizhuang Ma International Conference on Learning Representations (ICLR), 2025 AttentionPainter: An Efficient and Adaptive Stroke Predictor for Scene Painting [paper] Yizhe Tang, Yue Wang, Teng Hu, Ran Yi*, Xin Tan, Lizhuang Ma, Yu-Kun Lai, Paul L. Rosin IEEE Transactions on Visualization and Computer Graphics (TVCG), 2025 [CCF A] Pinco: Position-induced Consistent Adapter for Diffusion Transformer in Foreground-conditioned Inpainting [paper] Guangben Lu, Yuzhen Du, Yizhe Tang, Zhimin Sun, Ran Yi*, Yifan Qi, Tianyi Wang, Lizhuang Ma, Fangyuan Zou IEEE/CVF International Conference on Computer Vision (ICCV), 2025 [CCF A] SuperMat: Physically Consistent PBR Material Estimation at Interactive Rates [project] [paper] [code] Yijia Hong, Yuan-Chen Guo, Ran Yi*, Yulong Chen, Yan-Pei Cao*, Lizhuang Ma* IEEE/CVF International Conference on Computer Vision (ICCV), 2025 [CCF A] MV-Adapter: Multi-View Consistent Image Generation Made Easy [project] [paper] [code] Zehuan Huang, Yuan-Chen Guo, Haoran Wang, Ran Yi, Lizhuang Ma, Yan-Pei Cao, Lu Sheng IEEE/CVF International Conference on Computer Vision (ICCV), 2025 [CCF A] SIGMAN: Scaling 3D Human Gaussian Generation with Millions of Assets [project] [paper] [code] Yuhang Yang, Fengqi Liu, Yixing Lu, Qin Zhao, Pingyu Wu, Wei Zhai, Ran Yi, Yang Cao, Lizhuang Ma, Zheng-Jun Zha, Junting Dong IEEE/CVF International Conference on Computer Vision (ICCV), 2025 [CCF A] ID-Sculpt: ID-aware 3D Head Generation from Single In-the-wild Portrait Image [project] [paper] [code] Jinkun Hao, Junshu Tang, Jiangning Zhang, Ran Yi*, Yijia Hong, Moran Li, Weijian Cao, Yating Wang, Chengjie Wang, Lizhuang Ma* AAAI Conference on Artificial Intelligence (AAAI), 2025 [CCF A] Rectified Diffusion Guidance for Conditional Generation [paper] [code] Mengfei Xia, Nan Xue, Yujun Shen, Ran Yi, Tieliang Gong, Yong-Jin Liu IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [CCF A] MOS: Modeling Object-Scene Associations in Generalized Category Discovery [paper] [code] [blog(中文解读)] Zhengyuan Peng, Jinpeng Ma, Zhimin Sun, Ran Yi, Haichuan Song, Xin Tan, Lizhuang Ma IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [CCF A] Crucial-Diff: A Unified Diffusion Model for Crucial Image and Annotation Synthesis in Data-scarce Scenarios [paper] Siyue Yao, Mingjie Sun, Eng Gee Lim, Ran Yi, Baojiang Zhong, Moncef Gabbouj IEEE Transactions on Image Processing (TIP), 2025 [CCF A] CloudMix: Dual Mixup Consistency for Unpaired Point Cloud Completion [paper] Fengqi Liu, Jingyu Gong, Qianyu Zhou, Xuequan Lu, Ran Yi, Yuan Xie, Lizhuang Ma IEEE Transactions on Visualization and Computer Graphics (TVCG), 2025 [CCF A] PCKRF: Point Cloud Completion and Keypoint Refinement with Fusion Data for 6D Pose Estimation [paper] Yiheng Han, Irvin Haozhe Zhan, Long Zeng, Yu-Ping Wang, Ran Yi, Minjing Yu, Matthieu Gaetan Lin, Jenny Sheng, Yong-Jin Liu IEEE Transactions on Visualization and Computer Graphics (TVCG), 2025 [CCF A] Weighted Poisson-disk Resampling on Large-Scale Point Clouds [paper] [code] Xianhe Jiao, Chenlei Lv, Junli Zhao, Ran Yi, Yu-Hui Wen, Zhenkuan Pan, Zhongke Wu, Yong-jin Liu AAAI Conference on Artificial Intelligence (AAAI), 2025 [CCF A] 2024 FEditNet++: Few-Shot Editing of Latent Semantics in GAN Spaces with Correlated Attribute Disentanglement [paper] [code] Ran Yi, Teng Hu, Mengfei Xia, Yizhe Tang, Yong-Jin Liu IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024 [CCF A] A Diffusion Model Translator for Efficient Image-to-Image Translation [paper] [code] Mengfei Xia, Yu Zhou, Ran Yi*, Yong-Jin Liu*, Wenping Wang IEE",
  "content_length": 27428,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:37"
}