{
  "name": "Ran Ben-Basat",
  "homepage": "https://www.bbasat.com",
  "status": "success",
  "content": "Ran Ben Basat's Homepage – My personal homepage Ran Ben Basat's Homepage My personal homepage Search Search Start here Home Publications Students Academic Service Contact Home I am an Associate Professor in the Computer Science department of University College London and an Affiliated Researcher with Broadcom. I joined UCL as a Lecturer (assistant professor) in Jan 2021. Previously, I was a postdoctoral fellow at Harvard University, working with Minlan Yu and Michael Mitzenmacher. Before Harvard, I was a Ph.D. candidate at the CS department of Technion under the supervision of Roy Friedman. I got my B.Sc and M.Sc from the same department. I am interested in algorithms for networking, machine learning, and measurement. News: Nov 25′: “Better than Optimal: Improving Adaptive Stochastic Quantization Using Shared Randomness” (which has been accepted to ACM SIGMETRICS 2026) got rejected from arXiv! This is because it does not “contain sufficient original or substantive scholarly research and is not of interest to arXiv.” Oct 25′: “Spatiotemporal Sketch Disaggregation: Streaming Analytics with Heterogeneous Resources” has been accepted to IEEE ICDE 2026. Sep 25′: “Better than Optimal: Improving Adaptive Stochastic Quantization Using Shared Randomness” has been accepted to ACM SIGMETRICS 2026. Jul 25′: Received the UCL Computer Science “Teacher of the Year 2025” award (one awardee out of a department of over 150 faculty members). Jun 25′: Started as an affiliated researcher with VMware Research/Broadcom. May 25′: Received the 2025 Google Research Scholar award for Networking (2 awardees worldwide). May 25′: “Bounded Memory in Distributed Networks” has been accepted to ACM SPAA 2025. Oct 24′: I have been promoted to Associate Professor! Sep 24′: “Optimal and Approximate Adaptive Stochastic Quantization” has been accepted to NeurIPS 2024. Sep 24′: “Beyond Throughput and Compression Ratios: Towards High End-to-end Utility of Gradient Compression” has been accepted to ACM Hotnets 2024. Sep 24′: “When ML Training Cuts Through Congestion: Just-in-Time Gradient Compression via Packet Trimming” has been accepted to ACM Hotnets 2024. Sep 24′: “F3: Fast and Flexible Network Telemetry with an FPGA coprocessor” has been accepted to ACM CoNEXT 2024. Jul 24′: “Enabling Silent Telemetry Data Transmission with InvisiFlow” has been accepted to USENIX NSDI 2025. Jul 24′: New preprint up on arXiv: ‘Beyond Throughput and Compression Ratios: Towards High End-to-end Utility of Gradient Compression‘. Jul 24′: “SQUID: Faster Analytics via Sampled Quantile Estimation” has been accepted to ACM CoNEXT 2024. May 24′: “Accelerating Federated Learning with Quick Distributed Mean Estimation” has been accepted to ICML 2024. Mar 24′: “DISCO: A Dynamically Configurable Sketch Framework in Skewed Data Streams” has been accepted to IEEE ICDE 2024. Dec 23′: “THC: Accelerating Distributed Deep Learning Using Tensor Homomorphic Compression” has been accepted to USENIX NSDI 2024. Aug 23′: I’ll be giving a keynote talk about “Navigating Network Telemetry: Efficiency, Insights, and Routing Challenges” at the ACM SIGCOMM 2023 Future of Internet Routing & Addressing (FIRA) Workshop. May 23′: “Direct Telemetry Access” has been accepted to ACM SIGCOMM 2023. Apr 23′: “Adaptive Online Cache Capacity Optimization via Lightweight Working Set Size Estimation at Scale” has been accepted to USENIX ATC 2023. Dec 22′: “Fast In-kernel Traffic Sketching in eBPF” has been accepted to the ACM SIGCOMM CCR journal. Nov 22′: “Together is Better: Heavy Hitters Quantile Estimation” has been accepted to ACM SIGMOD 2023. July 22′: “Enabling Efficient and General Subpopulation Analytics In Multidimensional Data Streams” has been accepted to VLDB 2022. May 22′: “EDEN: Communication-Efficient and Robust Distributed Mean Estimation for Federated Learning” has been accepted to ICML 2022. Jan 22′: “DUET: A Generic Framework for Finding Special Quadratic Elements in Data Streams” has been accepted to ACM WWW 2022 (now called TheWebConf). Nov 21′: “Memento: Making Sliding Windows Efficient for Heavy Hitters” has been accepted to IEEE/ACM Transactions on Networking. Sep 21′: I was named ACM Transactions on Storage “Distinguished Reviewer“. Sep 21′: “DRIVE: One-bit Distributed Mean Estimation” has been accepted to NeurIPS 2021. Aug 21′: Up on arXiv: “Communication-Efficient Federated Learning via Robust Distributed Mean Estimation“. Aug 21′: “Zero-CPU Collection with Direct Telemetry Access” has been accepted to ACM HotNets 2021. Jun 21′: New paper up on arXiv: “DRIVE: One-bit Distributed Mean Estimation“. Apr 21′: “How to Send a Real Number Using a Single Bit (and Some Shared Randomness) ” has been accepted to ICALP 2021. Feb 21′: “SALSA: Self-Adjusting Lean Streaming Analytics” has been accepted to IEEE ICDE 2021. Feb 21′: “Routing-Oblivious Network-Wide Measurements” has been accepted to IEEE/ACM Transactions on Networking. Oct 20′: New paper up on arXiv: “How to send a real number using a single bit (and some shared randomness)“. Sep 20′: “Detecting Routing Loops in the Data Plane” has been accepted to ACM CoNEXT 2020. Aug 20′: I will be joining the CS department of UCL as a Lecturer (assistant professor). July 20′: “Cooperative Network-wide Flow Selection” has been accepted to IEEE ICNP 2020. July 20′: “Optimal Distributed Covering Algorithms” has been accepted to the Distributed Computing journal. May 20′: “PINT: Probabilistic In-band Network Telemetry” has been accepted to ACM SIGCOMM 2020. Apr 20′: “Routing Oblivious Measurement Analytics” has been accepted to IFIP NETWORKING 2020. Apr 20′: “Cost Effective Troubleshooting of NFV Infrastructure” has been accepted to IFIP NETWORKING 2020. Mar 20′: “Cheetah: Accelerating Database Queries with Switch Pruning ” has been accepted to ACM SIGMOD 2020. Feb 20′: “Designing Heavy-Hitter Detection Algorithms for Programmable Switches” has been accepted to IEEE/ACM Transactions on Networking. Dec 19′: “Faster and More Accurate Measurement through Additive-Error Counters” has been accepted to IEEE INFOCOM 2020. Oct 19′: “I Know What You Did Last Summer: Network Monitoring using Interval Queries” has been accepted to ACM SIGMETRICS 2020. Oct 19′: “Learning Software Constraints via Installation Attempts” has been accepted to the ACM-SIAM Symposium on Algorithmic Principles of Computer Systems (APoCS) 2020. July 19′: “q-MAX: A Unified Scheme for Improving Network Measurement Throughput” has been accepted to ACM IMC 2019. July 19′: “Parameterized Distributed Algorithms” has been accepted to DISC 2019. July 19′: “Optimal Distributed Covering Algorithms” has been accepted to DISC 2019. May 19′: “NitroSketch: Robust and General Sketch-based Monitoring in Software Switches” has been accepted to ACM SIGCOMM 2019. May 19′: Our poster has won the IEEE INFOCOM 2019 Best Poster Paper Award. May 19′: “Randomized Admission Policy for Efﬁcient Top-k, Frequency and Volume Estimation” has been accepted to IEEE/ACM Transactions on Networking. April 19′: “Give Me Some Slack: Efficient Network Measurements” has been accepted to the Theoretical Computer Science journal. Mar 19′: “A Black-box Method for Accelerating Measurement Algorithms with Accuracy Guarantees” has been accepted to IFIP NETWORKING 2019. Nov 18′: “Heavy Hitters over Interval Queries”  has been accepted to VLDB 2019. Powered by WordPress / Academica WordPress Theme by WPZOOM",
  "content_length": 7423,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:40"
}