{
  "name": "Rana Hanocka",
  "homepage": "http://people.cs.uchicago.edu/~ranahanocka",
  "status": "success",
  "content": "Rana Hanocka Rana Hanocka I am an Assistant Professor of Computer Science at the University of Chicago. I founded and direct 3DL (threedle! ), a group of enthusiastic researchers passionate about 3D, machine learning, and visual computing. I obtained my Ph.D. in 2021 from Tel Aviv University under the supervision of Daniel Cohen-Or and Raja Giryes. My research is focused on building artificial intelligence for 3D data, spanning the fields of computer graphics, machine learning, and computer vision. Deep learning, the most popular form of artificial intelligence, has unlocked remarkable success on structured data (such as text, images, and video), and I am interested in harnessing the potential of these techniques to enable effective operation on unstructured 3D geometric data. We have developed a convolutional neural network designed specifically for meshes, and also explored how to learn from the internal data within a single shape (for surface reconstruction, geometric texture synthesis, and point cloud consolidation) - and I am interested in broader applications related to these areas. Additional research directions that I am aiming to explore include: intertwining human and machine-based creativity to advance our capabilities in 3D shape modeling and animation; learning with less supervision, for example to extract patterns and relationships from large shape collections; and making 3D neural networks more \"interpretable/explainable\". I am looking for highly motivated undergraduate and graduate students to join my lab at the University of Chicago. Current students may email me directly, and prospective students may find additional information regarding admissions here. Selected Talks Artificial Intelligence for Geometry Processing UW Allen School Colloquium Deep Learning on Single Shapes Toronto Geometry Colloquium MeshCNN: A Network with an Edge Israel Computer Vision Day",
  "content_length": 1908,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:38"
}