{
  "name": "Randall Davis",
  "homepage": "https://www.csail.mit.edu/user/805",
  "status": "success",
  "content": "Randall Davis | MIT CSAIL Skip to main content PI Core/Dual Randall Davis Professor Email davis@csail.mit.edu Phone 253-5879 Room 32-237 Randall Davis received his undergraduate degree from Dartmouth, graduating summa cum laude, Phi Beta Kappa in 1970, and received a PhD from Stanford in artificial intelligence in 1976. He joined the faculty of the Electrical Engineering and Computer Science Department at MIT in 1978 where he held an Esther and Harold Edgerton Endowed Chair (1979-1981). He has been a Full Professor in the Department since 1989. He has served as Associate Director of MIT's Artificial Intelligence Laboratory (1993-1998), as a Research Director of CSAIL from 2003-2007, and as Associate Director of CSAIL from 2012-2014. Dr. Davis has been a seminal contributor to the fields of knowledge-based systems and human-computer interaction, publishing some more than 100 articles and playing a central role in the development of several systems. He and his research group are developing advanced tools that permit natural multi-modal interaction with computers by creating software that understands users as they sketch, gesture, and talk. He is the co-author of Knowledge-Based Systems in AI. In 1990 he was named a Founding Fellow of the Association for the Advancement of AI and in 1995 was elected to a two-year term as its President. From 1995-1998 he served on the Scientific Advisory Board of the U. S. Air Force, earning the USAF Decoration for Exceptional Civilian Service. Dr. Davis has also been active in the area of intellectual property and software. In 1990 he served as expert to the Court in Computer Associates v. Altai, a case that produced the abstraction, filtration, comparison test now widely used in software copyright cases. From 1998 to 2000 he served as the chairman of the U.S. National Academy of Sciences study on intellectual property rights and the information infrastructure entitled The Digital Dilemma: Intellectual Property in the Information Age, published by the National Academy Press in February, 2000. In 2021 DCTClock, software developed jointly with Dr. Dana Penney (Lahey Hospital) and licensed to Linus Health was named one of the Best Inventions of 2021 by Time. Related Links Website Last updated Feb 23 '23 Research Areas Human-Computer Interaction Impact Areas Manufacturing Related Links Website Groups Community of Research Human-Computer Interaction Community of Research The focus of the HCI CoR is inventing new systems and technology that lie at the interface between people and computation, and understanding their design, implementation, and societal impact. +3 David Karger Leads David Karger Research Areas Graphics & Vision Human-Computer Interaction Programming Languages & Software Engineering Impact Areas Education Entertainment Manufacturing Lead David Karger +3 David Karger Community of Research Computing & Society Community of Research This community is interested in understanding and affecting the interaction between computing systems and society through engineering, computer science and public policy research, education, and public engagement. +6 Daniel Weitzner Leads Daniel Weitzner Research Areas Algorithms & Theory AI & ML Human-Computer Interaction Security & Cryptography Systems & Networking Impact Areas Big Data Cybersecurity Health Care Internet of Things Transportation Wireless Lead Daniel Weitzner +6 Daniel Weitzner Community of Research Cognitive AI Community of Research This CoR aims to develop AI technology that synthesizes symbolic reasoning, probabilistic reasoning for dealing with uncertainty in the world, and statistical methods for extracting and exploiting regularities in the world, into an integrated picture of intelligence that is informed by computational insights and by cognitive science. +5 Gerald Sussman Leads Gerald Sussman Research Areas Human-Computer Interaction Robotics Security & Cryptography Systems & Networking Impact Areas Cybersecurity Education Lead Gerald Sussman +5 Gerald Sussman Research Group Human-Computer Interaction HCI faculty and researchers in CSAIL. Leads Randall Davis Fredo Durand Daniel Jackson David Karger Rob Miller Stefanie Mueller Research Areas Human-Computer Interaction Lead Randall Davis Fredo Durand Daniel Jackson David Karger Rob Miller Stefanie Mueller Research Group Multimodal Understanding Group Our objective is to build techniques, software, and hardware that enable natural interaction with computation. Randall Davis Leads Randall Davis Research Areas Algorithms & Theory Human-Computer Interaction Impact Areas Education Lead Randall Davis Randall Davis 2 More",
  "content_length": 4639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:40"
}