{
  "name": "Randal C. Burns",
  "homepage": "http://www.cs.jhu.edu/~randal",
  "status": "success",
  "content": "Randal Burns · Scalable Data Systems and Scientific Data Plumber Randal Burns Scalable Data Systems and Scientific Data Plumber Randal Burns email: randal(at)jhu.edu phone: I don’t answer office: 163 Malone Hall snail: 160 Malone Hall, 3400 N. Charles St, Baltimore, MD 21218 Administrative Coordinator: Toni DeTallo email: tdetal1(at)jhu.edu phone: (410) 516-8775 Toni will be assisting with my schedule from September 5, 2023 through Decemeber 15, 2023. I am available for in-person meetings at JHU Monday-Thursday and zoom meetings Friday mornings. Randal Burns on Google Scholar Recent CV In Fall 2023, I am offering an my course Parallel Computing for Data Science for the second time. Last year, I initiated a redesign that changed the focus of the course. Examples will be drawn from machine learning and data science as much as possible. The course will not cover GPU programming, GPUs, or machine learning frameworks, such as TensorFlow, Keras, and PyTorch. Supercomputing and scientific/numerical applications will be deemphasized. The course adds a material on instruction level parallelism, including pipelining and vectorization. Most importantly, the term “Programming” has been replaced with “Computing” which reflects the natural evolution of the space to focus more on the architecture and systems aspects of the subject matter and less on programming patterns. This year, I am teaching the course from a self-contained e-book. We are also moving to more programming activities that are smaller. Students wishing to enroll in the course should consult the Web page prior to emailing the instructors. Recent Items: I gave a talk on Emergent Sparsity in AI (slides) at the Systems and Applications Challenges for the Emerging Bazaar of Accelerators Workshop on August 9, 2023. I contributed to reponse to the Federal Cybersecurity RFI as part of my volunteer work with the Computing Community Consortium. Less recent items: As of July 1, 2020, I became the Head of the Department of Computer Science. This supersedes my role as Chair (2019) and Interim Chair (2018). I represent a great group of faculty at an interesting time. I’m now serving on the Defense Advanced Research Projects Agency (DARPA) Information Science and Technology (ISAT) Study Group. I was a visiting procfessor at INPE in Brazil in January 2020 where I taught a course on Parallel Programming for Data Science. Randal Burns is a Professor and Head of Computer Science in the Whiting School of Engineering at Johns Hopkins University. His research has pushed the scalability limits of data science based on emergent storage technologies. This has ranged from engineering file systems for storage area networks in the 1990s, building scientific web services on scale-out cloud storage in the 2000s, implementing scalable analsysis and visualization tools and reproducibility systems in the 2010s, and developing graph and sparse-matrix engines for machine learning more recently. His work has been inspired by high-throughput science, including numerical simulations for turbulence, neuroscience microscopy, and observational astronomy. Burns earned his PhD in Computer Science from the University of California Santa Cruz in 2000 and a BS in Geophysics from Stanford in 1993. Prior to joining the faculty at Johns Hopkins, he was a research staff member at IBM’s Almaden Research Center, where he won an Outstanding Innovation Award. Burns is a recipient of the NSF Career Award and was a DOE Early Career Principal Investigator. He is a Kavli Fellow and served as a member of the Defense Science Study Group class of 2012-2013.” He is a co-founder of NeuroData along with Joshua Vogelstein. NeuroData democratizes access to world-class data sets, including electron-microscopy connectomics, CLARITY, MRI, and array tomography data. Randal is a core member of the JH Turbulence Database Group. He and his students have built Open Numerical Laboratories in which anyone can explore, mine, and analyze world-class turbulence simulations. Prior to arriving at JHU in 2002, Randal was Research Staff Member at IBM’s Almaden Research Center in San Jose. He earned his Ph.D. in 2000 and M.S. in 1997 from the Department of Computer Science at the University of California at Santa Cruz (Go Slugs!). He earned his B.S. degree from the Department of Geophysics at Stanford University (Go Cardinal!)",
  "content_length": 4377,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:40"
}