{
  "name": "Ransalu Senanayake",
  "homepage": "https://search.asu.edu/profile/4843390",
  "status": "success",
  "content": "Ransalu Senanayake | ASU Search Ransalu Senanayake Assistant Professor, School of Computing and Augmented Intelligence [email protected] Phone: 480-965-3190 ‌ 660 S. Mill Avenue CTRPT 203-21 Tempe, AZ 85281 Mail code: 8809 Campus: Tempe ‌ Long Bio Ransalu Senanayake is the director of the LENS Lab. He is an Assistant Professor in Computer Science at the School of Computing and Augmented Intelligence (SCAI), Arizona State University (ASU). Previously, he was a postdoctoral scholar in the Machine Learning Group at the Dept. of Computer Science, Stanford University Education Postdoctoral Research Scholar, Machine Learning Group, Stanford University Research Website URL https://www.ransalu.com/lens-lab Google Scholar URL https://scholar.google.com/citations?hl=en&user=mmo0bDIAAAAJ&view_op=list_works… Research Interests Machine Learning and Robotics Research Group https://www.ransalu.com/lens-lab Publications https://www.ransalu.com/lens-lab Teaching Website URL https://ransml.github.io/lens-lab/teaching.html Courses 2026 Spring Course Number Course Title CSE 493 Honors Thesis CSE 579 Knowledge Representation CSE 579 Knowledge Representation 2025 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 599 Thesis CSE 792 Research CSE 590 Reading and Conference CSE 475 Found of Machine Learning CSE 475 Found of Machine Learning RAS 599 Thesis 2025 Summer Course Number Course Title CSE 584 Internship 2025 Spring Course Number Course Title CSE 792 Research 2024 Fall Course Number Course Title CSE 493 Honors Thesis CSE 792 Research CSE 590 Reading and Conference CSE 580 Practicum CSE 475 Found of Machine Learning 2024 Summer Course Number Course Title CSE 792 Research 2024 Spring Course Number Course Title CSE 792 Research CSE 598 Special Topics 2023 Fall Course Number Course Title CSE 792 Research CSE 574 Planning/Learning Methods AI Expertise Areas Computer Vision Machine Learning Artificial Intelligence Robotics",
  "content_length": 1948,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:45"
}