{
  "name": "Raouf Boutaba",
  "homepage": "http://rboutaba.cs.uwaterloo.ca",
  "status": "success",
  "content": "Raouf Boutaba @ University of Waterloo Home Biography Publications Chronologically By Area By Type Talks Professional Activities Teaching Projects Research Team Downloads Raouf Boutaba Director, David R. Cheriton School of Computer Science Professor, FRSC, FIEEE, FIEC, FCAE University of Waterloo Office: DC3532 200 University Avenue West, Waterloo, Ontario Canada, N2L 3G1 Tel: +1 519 888 4820 Fax: +1 519 885 1208 Email: rboutaba__at__uwaterloo.ca Administrative Assistant: Tracy Dietrich (tdietrich__at__uwaterloo.ca) +1 519 888 4567 x46003 Research Interests My research interests are focused primarily on the management of networks, systems and services, and on resource management in wired and wireless networks. Applications areas of current interest include network function virtualization, software-defined networks, cloud computing and services, network virtualization, blockchain, future Internet architecture, and cybersecurity. What's New November 2025: Dr. Boutaba gives a keynote speech titled \"The Evolution of Network Virtualization: Past Achievements, Present Landscape, and Future Horizons\" at the 3rd IEEE IEEE Virtual Conference on Communications , Virtual Conference, November 5, 2025. October 2025: Dr. Boutaba to sit on experts panel to discuss \"Sustainable Network Management in the Age of AI: Reducing Power Consumption and Carbon Footprint\" at the 2025 IEEE/IFIP 21st International Conference on Network and Service Management (CNSM), Bologna, Italy, October 30, 2025. August 2025: Dr. Boutaba gives a keynote speech titled \"Network Slicing: Past, Present and Moving Forward\" at the 18th IEEE Colombian Conference on Communications and Computing (ColCom) , Popayan, Colombia, August 14, 2025. June 2025: Dr. Boutaba gives a keynote speech titled \"Securing the Future: Cybersecurity Challenges and Solutions for Softwarized and Virtualized 5G and Beyond Networks\" at the International Workshop on Cyber-Security Threats, Trust and Privacy management in Software-defined and Virtualized Infrastructures (SecSoft) , co-located with IEEE NetSoft, Budapest, Hungary, June 27, 2025. June 2025: Dr. Boutaba gives a keynote speech titled \"Zero-touch Networks: Past, Present, and Future\" at the International Balkan Conference on Communications and Networking (BalkanCom). Piraeus, Greece, June 18, 2025. May 2025: Dr. Boutaba to sit on experts panel to discuss \"AI-based Orchestration Technologies\" at the 2025 IEEE/IFIP Network Operations and Management Symposium (NOMS), Honolulu, Hawaii, USA, May 13, 2025. April 2025: Dr. Boutaba organizes the second Rogers TEP Workshop as part of the Rogers Chair in Network Automation. January 2025. Dr. Boutaba gives a distinguished lecture on \"Network Virtualization: Past, Present and Future\" as part of the Distinguished Lecture Series at the School of Engineering, College of Arts and Sciences, Texas A&M International University, USA, January 30, 2025. December 2024: Dr. Boutaba and a multidisciplinary team of computer science researchers has been awarded $2 million from the Ontario Research Fund–Research Excellence (ORF–RE) program to develop key infrastructure technology for next-generation mobile networks. December 2024: Dr. Boutaba delivers a tutorial titled \"Virtualization in Future Wireless Networks: Why is it Still Hard to Achieve?\" at the IEEE Global Communications Conference (Globecom), 8–12 December 2024, Cape Town, South Africa (with Soumaya Hamouda and Rami Langar). November 2024: Dr. Boutaba gives a keynote speech titled \"Automation in the Era of Cloud-native Telecommunication Networks\" at the IEEE International Conference on Cloud Networking , Rio de Janeiro, November 27, 2024. November 2024: Dr. Boutaba organizes the first Rogers TEP Workshop as part of the Rogers Chair in Network Automation. July 2024: Dr. Boutaba has been appointed as the inaugural Rogers Chair in Network Automation. June 2024: Dr. Boutaba gives a talk on \"Network Virtualization: past, present and moving forward\" as part of the ITU Webinar Series hosted by the ITU Journal, June 18, 2024. June 2024: Dr. Boutaba and his team win the 2024 CNOM Test of Time Paper Award for the paper Dynamic Controller Provisioning in Software Defined Networks presented at IEEE CNSM 2013. May 2024: Dr. Boutaba to sit on experts panel to discuss \"AI/ML: The Disruptive Force Reshaping Engineering Disciplines\" at the 2024 CAE Conference & Induction Ceremony of New Fellows, London, Ontario, May 28, 2024. April 2024: Dr. Boutaba gives a distinguished lecture on \"Network Virtualization: past, present and moving forward\" as part of the Distinguished Lecture Series at the School of Computer Science, University of Oklahoma, USA, April 29, 2024. April 2024: Dr. Boutaba is awarded the prestigious title of University Professor by the University of Waterloo. March 2024: Dr. Boutaba receives the Award of Excellence in Graduate Supervision. March 2024: Dr. Boutaba gives an invited talk on \"AI-Driven Slice Orchestration in 5G and Beyond Networks\" at the IEEE Workshop on Network Automation in Princeton, New Jersey, USA, March 25, 2024. November 2023: Dr. Boutaba and his team showcase the adaptability of 5G slices for demanding applications like augmented and virtual reality, as well as cloud gaming, optimizing network resources based on application demand, as part of the 5G LEAP and 5G ELITE projects on network slicing. ( UW News ) November 2023: Dr. Boutaba gives a talk on \"Autonomous Management in 5G and Beyond Network” at the Topical and Verticals session on Full Stack Automation in 5G and Beyond (5GB) Networks during the Future Networks World Forum in Baltimore, Maryland, USA, November 13, 2023. September 2023: Dr. Boutaba gives the inaugural distinguished lecture on \"Unity is strength and so is collaborative security\" as part of the Distinguished Speaker Series at Concordia Cybersecurity Research Center, Concordia University, Montreal, September 28, 2023. June 2023: Dr. Boutaba sits on experts panel to discuss \"Intelligent Network Slicing and Orchestration” at the Rogers 5G Partnership Summit. Brampton, Ontario, Canada, June 22, 2023. May 2023: Dr. Boutaba sits on experts panel to discuss \"Artificial Intelligence for Network Operation and Management: Can it meet the requirements of tomorrow's networks” at the IFIP/IEEE Network Operations and Management Symposium (NOMS) Miami, Florida, USA, May 8-12, 2023. May 2023: Muhammad Sulaiman received the best paper award at the IFIP/IEEE Network Operations and Management Symposium (NOMS) Miami, Florida, USA, May 8-12, 2023. January 2023: Dr. Boutaba is leading the Secure and Reliable End-to-End Network Slicing for 5G and Beyond Mobile Networks project as part of university and industry consortium to develop secure 5G mobile networks and improve Canada's security and defense. ( UW News , In the Media ) December 2022: Dr. Boutaba to give an industry talk titled \"Implications of Open RAN Adoption on AI-driven Management of 5G and Beyond Networks\" at the IEEE Global Communications Conference (IEEE GLOBECOM) , Rio de Janeiro, Brazil, December 4-8, 2022. October 2022: Dr. Boutaba to give a keynote speech titled \"The implications of Open RAN adoption on AI-driven Management of 5G and Beyond Networks\" at the 14th IFIP Wireless and Mobile Networking Conference (IFIP WMNC) , Sousse, Tunisia, October 17-19, 2022. September 2022: US Patent No. 11,438,139 B2 issued for Eric and Woojung's work on \"Blockchain based Secure Naming and Update Verification\". June 2022: Undergraduate student Leni Aniva is awarded Governor General's Silver Medal . Leni completed a research internship with Dr. Boutaba as part of the encrypted traffic classification project and was one of the co-authors of the ACM SIGMETRICS 2021 paper \"A Look Behind the Curtain: Traffic Classification in an Increasingly Encrypted Web\" which received the Kenneth C. Sevcik Outstanding Student Paper Award. June 2022: Dr. Boutaba sits on experts panel to discuss \"Blockchain for Future Networks” at the Blockchain Technology Symposium (BTS) , University of Calgary, Calgary (Canada), June 9, 2022. May 2022: Dr. Boutaba to give a keynote speech titled \"Machine Learning for Networking: Applications, Challenges and Opportunities\" at the 40th Brazilian Symposium on Computer Networks and Distributed Systems (SBRC) , May 23-27, 2022. April 2022: Muhammad Sulaiman received the best paper award at the IFIP/IEEE Network Operations and Management Symposium (NOMS) Budapest, Hungary, April 25-29, 2022. April 2022: Soheil received the best student paper award at the IFIP/IEEE Network Operations and Management Symposium (NOMS) Budapest, Hungary, April 25-29, 2022. April 2022: Shihab received the best dissertation award at the IFIP/IEEE Network Operations and Management Symposium (NOMS) Budapest, Hungary, April 25-29, 2022. April 2022: Nashid received the best dissertation award at the IFIP/IEEE International Symposium on Integrated Network Management (IM) Bordeux, France, May 17-21, 2021. March 2022: Dr. Boutaba sits on distinguished experts panel to speak on \"Unity is strength and so is collaborative security\" during the Joint Cybersecurity and Resilience Initiative and IPSI Public Lecture Series at the University of Toronto (Online Event), March 29, 2022. March 2022: Dr. Boutaba sits on panel of academic leaders from across Canada to discuss areas of research, opportunities for innovation and skills development at the Canadian Academy of Engineering International Workshop on Sustainable, Intelligent Next Generation Systems. December 2021: Dr. Boutaba to give a keynote speech titled \"The Cloud to Things Continuum - Infrastructure and Management\" at the 22nd ACM/IFIP Middleware Conference (Online), December 6-10, 2021. December 2021: Dr. Boutaba to give a keynote speech titled \"Machine Learning for Networking: Experiences, Challenges and Future Directions\" at the Facebook Network Infrastructure Summit (Online), December 7, 2021. October 2021: Shihab receives the 2021 Alumni Gold ",
  "content_length": 12350,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:50"
}