{
  "name": "Raphaël Pestourie",
  "homepage": "https://www.raphaelpestourie.com",
  "status": "success",
  "content": "Raphaël PestourieSearch this siteEmbedded FilesSkip to main contentSkip to navigationRaphaël Pestourie, PhD, MBA Assistant Professor in Scientific Machine Learning at the School of Computational Science and Engineering, Georgia Tech (2023-present)Postdoctoral Associate, Department of  Mathematics, Massachusetts Institute of Technology (2020-2023)PhD in Applied Mathematics, Harvard University––rpestourie3 ατ gatech  δøτ eduWelcome where AI meets scientific computing for engineering applications!My group develops solver-informed artificial-intelligence (AI)-enabled methods that enable efficient partial differential equation–constrained optimization (PDE-CO): a unifying mathematical framework for most engineering design problems, from optics and mechanics to transport and materials.Our goal is to make AI and physics co-evolve, so that learning and computation accelerate one another. In this Engineering + AI paradigm, we integrate the nonlinear fitting power of neural networks with the generalization capability of numerical solvers to design physical systems more efficiently, interpretably, and at unprecedented scale.Research AreasAI-enabled SolversWe build fast, approximate, and physics-enhanced solvers that accelerate simulations by orders of magnitude while maintaining physical fidelity. These solver-informed models use AI not as a black box, but as a partner that learns from theory to fill in missing physics and extend model generality.AI-enabled OptimizersWe develop representation-learning methods that teach algorithms to design smarter. By learning the geometry of the feasible design space, our models enable transfer learning across objectives, physics, and scales.Hybrid Models for Engineering DiscoveryWe bridge theory-driven and data-driven modeling through solver-informed learning, revealing where existing theory breaks down and discovering interpretable corrections.Long-term goalOur long-term vision is to establish a unified framework for AI-enabled PDE-constrained optimization: one that combines fast, physics-enhanced solvers with learned geometric representations of feasible designs. By accelerating both the simulation (through surrogate solvers) and the optimization (through representation learning), we enable scalable, transferable, and interpretable engineering design across physics and scales. These representations and solvers can be shared, lowering computational barriers, democratizing access to high-performance design, and restoring interpretability. Ultimately, this approach redefines how we explore and optimize complex physical systems: making engineering discovery faster, more efficient, and less redundant.Support and recognitionI would like to gratefully acknowledge the support the National Science Foundation (NSF), and the National Institutes of Health (NIH). I am also part of the MIT-IBM Watson AI Lab.I publish in journals such as Nature Machine Intelligence, Nature Communications, npj Computational Materials, Advanced Optical Materials, Small Methods, SIAM Journal on Scientific Computing, and IEEE Antennas & Propagation Magazine, and regularly serve as a reviewer for leading journals and conferences in AI and scientific computing.Keywords: AI-enabled PDE-constrained optimization, scientific machine learning, fast approximate solvers, representation learning, model discovery, inverse design, metasurfaces, mechanical metamaterials, end-to-end optimization, hybrid models.LinksGoogle Scholar (link)Twitter @rpestouriePhD (link)Teaching I’m grateful for the highlight about my teaching in the GT CSE press release: “Revered Faculty Uses Teaching to Nurture Students and Research Community”Fall 2023, Fall 2024 (CIOS Honor Roll), Fall 2025: CSE 8803 \"Special Topics in Scientific Machine Learning\" (I created this new course at Georgia Tech)Fall 2024: CSE 8801 \"Linear algebra, Probability, and Statistics\" (I created this new refresher course at Georgia Tech)Spring 2025  (CIOS Honor Roll): CX 4230 \"Computer Simulations\"Information about my groupMy group is hiring! If you are interested in collaborating with me, please don't hesitate to reach out. I strongly support the Georgia Tech value that \"We thrive on diversity.\"I am very fortunate to advise the following students:PhD & MSc student in my group at Georgia TechXian Mae Hadia (PhD candidate in CSE)Sophie Bekerman (PhD candidate in ML)Max Huang (PhD candidate in ML)Antonio Varagnolo (PhD candidate in CSE)Araceli Rodriguez Vallejo (MSc student)Undergraduate student in my group at Georgia TechDaniel Deller (Undergraduate student, CS)PhD student that I mentor scientificallyMahmoodreza Marzban (GT ECE, Prof Ali Adibi group)Lorenzo Xavier van Muñoz (MIT Physics, NSF Graduate Research Fellow and a Dean of Science Fellow, former Mellon Mays Undergraduate Fellow at Caltech)Dr. Wenchao Ma (MIT Chemistry, PhD student)Past students that I advised or mentoredDr. Joeri Lenearts (Free University of Brussels–VUB)Dr. Constant Bourdeloux (ESPCI)Sophie Fisher (PhD at MIT EECS)Jerrell Cockerham from Colorado College through MIT Summer Research Program 2020 (now PhD candidate in Mathematics at Rice university)Current collaborators: Prof. Steven G. Johnson (MIT), Dr. Giuseppe Romano (MIT), Dr. Chris Rackauckas (MIT), Dr. Payel Das (IBM), Dr. Youssef Mroueh (IBM), Prof. Federico Capasso (Harvard), Prof. Arka Majumdar (UW Seattle), Prof. Zin Lin (VT), Prof. Mathias Fink (ESPCI), Prof. Lu Lu (Yale), Prof. Boubacar Kanté (UC Berkeley), Dr. Thibault Laplace (LBNL), Prof. Holger Schmidt (UCSC), Prof. Constantine Sideris (USC), Prof. Sean Molesky (Polytechnique Montreal), Prof. Carlos Pérez Arancibia (Univ. Twente)About MeBefore joining the faculty at Georgia Tech, I earned five masters, a PhD, and completed my postdoctoral studies:Diplôme grande école from ESSECIngénieur des Arts et Manufactures specialized in Physics from École Centrale Paris (now CentraleSupelec)Master of research in Nanosciences from Université Paris SaclayMBA from ESSECAM in Statistics from Harvard UniversityPhD in Applied Mathematics with a secondary field in Computational Science and Engineering from Harvard John A. Paulson School of Engineering and Applied SciencesPostdoctoral studies in the Mathematics department at MIT (3 years).During my PhD, I was an Arthur Sachs Fellow selected by the French Fulbright Commission, and a Jean Gaillard fellow selected by the Board of Directors of the École Centrale des Arts et Manufactures in Paris. In addition, I was awarded membership into the Harvard Graduate School Leadership Institute through the Harvard Kennedy School’s Center for Public Leadership.I am a strong believer that research should result in innovation and commercialization. I have working experience in a quantitative trading hedge fund and in startups both as an employee and as a founder. I have published many peer-reviewed articles and am a patent inventor.I am originally from France, and I have studied languages and cultures of other people through pursuing internships and advanced degrees in several countries. Outside work, I play music with/for my bicultural, multilingual family.PublicationsPhD thesis: \"Assume Your Neighbor is Your Equal: Inverse Design in Nanophotonics\" Harvard University Library website.Peer-reviewed journal articles: (* these authors contributed equally, † corresponding authors)[21] M. R. Peters, D. Mojahed, W. Ma, R. Pestourie, T. Gu, S. G. Johnson, J. Hu \"Integrated photonic spectrometers: a critical review.\" Photonics Insights, 4(4), R10-R10, 2025.[20] R. Marzban, H. Abiri, R. Pestourie†, A. Adibi† “HiLAB: A Hybrid Inverse-Design Framework.” Small Methods, 2025 [arXiv, DOI][19] R. Pestourie “Fast approximate solvers for metamaterials design in electromagnetism.” IEEE Antennas and Propagation Magazine, 2025 [arXiv, DOI][18] W. Ma, R. Pestourie, SG Johnson, \"Time-reversal-symmetry bounds on electromagnetic fields\" Physical Review Applied, 2025 [arXiv, DOI][17] W. Ma, R. Pestourie, et al. \"Multiplicative resonant enhancement of chemical detection\" Physical Review Applied, 2024 [DOI][16] R. Pestourie, et al. \"Physics-enhanced deep surrogates for partial differential equations,\" Nature Machine Intelligence, 2023 [DOI] | Press: IEEE Spectrum, MIT News[15] R. Pestourie, W. Yao, B. Kanté, and S.G. Johnson \"Efficient Inverse Design of Large-Area Metasurfaces for Incoherent Light\" ACS Photonics, 2022 [DOI][14] S. Fisher, R. Pestourie, and S.G. Johnson \"Efficient perturbative framework for coupling of radiative and guided modes in nearly periodic surfaces,\" Physical Review A, 2022 [DOI] | Editors' Suggestion[13]  C. Munley, W. Ma, J. E. Fröch, Q. A. A. Tanguy, E. Bayati, K. F. Böhringer, Z. Lin, R. Pestourie, S.G. Johnson, and A. Majumdar \"Inverse-Designed Meta-Optics with Spectral-Spatial Engineered Response to Mimic Color Perception,\" Advanced Optical Materials, 2022 [DOI][12] L. Lu, R. Pestourie, et al. \"Multifidelity deep neural operators for efficient learning of partial differential equations with application to fast inverse design of nanoscale heat transport,\" Physical Review Research, 2022 [DOI][11] Z. Li, R. Pestourie, et al. \"Empowering Metasurfaces with Inverse Design: Principles and Applications,\" ACS Photonics, 2022 [DOI][10] Z. Li*, R. Pestourie*, et al. \"Inverse design enables large-scale high-performance meta-optics reshaping virtual reality,\" Nature Communications, 2022 [DOI] | Press: Nature blog, Harvard SEAS News[9] Z. Lin, R. Pestourie, et al. \"End-to-end metasurface inverse design for single-shot multi-channel imaging,\" Optics Express, 2022 [DOI][8] E. Bayati*, R. Pestourie*, et al. \"Inverse Designed Extended Depth of Focus Meta-Optics for Broadband Imaging in the Visible,\" Nanophotonics, 2021 [DOI][7] L. Lu, R. Pestourie, et al. \"Physics-informed neural networks with hard constraints for inverse design,\" SIAM Journal on Scientific Computing, 2021 [DOI] [6] Z. Lin, C. Roques-Carmes, R. Pestourie, et al.. \"End-to-end nanophotonic inverse design for imaging and polari",
  "content_length": 21324,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:47"
}