{
  "name": "Raquel Fernández",
  "homepage": "https://staff.science.uva.nl/r.fernandezrovira",
  "status": "success",
  "content": "Website of Raquel Fernandez Welcome I am Full Professor of Computational Linguistics & Dialogue Systems at the University of Amsterdam and the Vice-Director for Research at the Institute for Logic, Language & Computation (ILLC). I'm a Fellow of the ELLIS Society (the European Laboratory on Learning and Intelligent Systems) and a board member of the ELLIS Amsterdam Unit. I'm interested in natural language processing (NLP) by humans and machines, regarding both language understanding and generation. In my research, I use computational tools including deep learning models to investigate how cognitive constraints, social interaction, and perception shape language use. To what extent is language grounded in visual information? What coordination strategies help us to communicate successfully with our dialogue partners? And how can answers to these kinds of question lead to better NLP systems? My group and I carry out research on these and related topics from an interdisciplinary perspective, at the interface of computational linguistics, cognitive science, and artificial intelligence. Our publications can be found on the website of my lab, the Dialogue Modelling Group, the ACL anthology, and Google Scholar. I have been fortunate to receive generous funding to support my work, including grants by the European Research Council (ERC Consolidator grant 819455) and the Dutch Research Council (VENI, VIDI, and Aspasia). Prospective students: Please read this before emailing me. I do not have any available PhD positions for 2026. I am open to co-supervise ELLIS PhD students who already have a main ELLIS supervisor outside the Netherlands. I do not have internships, paid or otherwise. Due to volume, I may not be able to respond to most emails about PhD positions or internships, sorry. Recent activities and news November 2025: As part of my sabbatical, I will be spending a few months at the Joint Research Centre (JRC) of the European Commission in Seville, hosted by the European Centre for Algorithmic Transparency. October 2025: I'm on sabbatical, visiting CiMEC: Centre for Mind/Brain Sciences in the wonderful Italian region of Trentino. September 2025: once again, I will give a lecture on Multimodal NLP at the Athens NLP Summer School. July 2025: Invited talk at CoNLL 2025 in Vienna. July 2025: Lecture at the 4th AIHUB Summer School organised by the Spanish Research Council. June 2025: Lecture and hands-on lab on multimodal processing in face-to-face dialogue at the MEDAL Summer School on Computational Modelling in Birmingham, together with Esam Ghaleb. February 2025: I'm serving as Ethics co-chair for COLM 2025. January 2025: I got elected VP-Elect for SIGDAT, the ACL's Special Interest Group in charge of EMNLP! November 2024: Invited contributor on the topic of AI as a Catalyst for Change at ScienceÑL, the 1st Spanish/Dutch Scientific Congress, hosted by the Royal Netherlands Academy of Arts and Sciences (KNAW). November 2024: Invited talk at the Distinguished Lecture Series of the ELLIS Unit Stuttgart. October 2024: Keynote speaker at the Conference on Language Modeling (COLM) to be held in Philadelphia. September 2024: Lecturer on Multimodal NLP at the Athens NLP Summer School. July 2024: I'm serving as co-chair of the ACL Best Paper Awards committee. June 2024: Invited speaker at the Neuro-AI Symposium on bridging the gap between human and machine intelligence, in Amsterdam. May 2024: I'm a participant in an exciting NSF workshop on New Horizons in Language Science about interdisciplinary connections between LLMs and language processing in the human mind and brain. The videos of the event are available on this YouTube channel. March 2024: I'm serving as Area Chair for the new Conference on Language Modeling (COLM). March 2024: Lecturer at the ELLIS Winter School on Foundation Models. February 2024: Invited speaker at the WIC Mid-Winter Meeting on Generative AI in an information technology context. January 2024: Invited talk at the ILFC Seminar. December 2023: We have received an Outstanding Paper Award at EMNLP and a Best Data Award at the GenBench Workshop, for our paper Cross-Lingual Consistency of Factual Knowledge in Multilingual Language Models led by Jirui Qi and Arianna Bisazza. Nov-Dec 2023: I'll be visiting OIST (Okinawa Institute of Science and Technology) as part of their Theoretical Sciences Visiting Program. October 2023: I'm serving as Senior Area Chair for EACL 2024 in the track \"Linguistic Theories, Cognitive Modeling and Psycholinguistics\". October 2023: Invited speaker at the first AI Symposium on Large Language and Foundation Models in Amsterdam. June 2023: Invited speaker at IWCS in Nancy (slides). June 2023: With some delay, I finally gave the inaugural lecture of my professorship - \"oratie\" in Dutch; here is the video of the ceremony.",
  "content_length": 4836,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:50"
}