{
  "name": "Rashina Hoda",
  "homepage": "https://research.monash.edu/en/persons/rashina-hoda",
  "status": "success",
  "content": "Rashina Hoda - Monash University View Scopus Profile Rashina Hoda Professor Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0001-5147-8096 EmailRashina.Hodamonashedu 20052025 Research activity per year Personal profile BiographyRashina Hoda is a Professor of Software Engineering at Monash University, Australia. Her research focuses on the human and socio-technical aspects of Software Engineering, Artificial Intelligence, and Digital Health. She was named the 2025 Top Researcher in Software Systems in Australia by The Australian. In her 2024 Springer book Qualitative Research with Socio-Technical Grounded Theory, she presents a modern socio-technical variation to the Grounded Theory methods.As the Associate Dean ED&I, she has introduced an intersectional lens to the portfolio. Her contribution to championing women in STEM was recognised through the Guiding Star Mentorship Award at the 2024 Women of Colour in STEM Awards.She was selected as one of the Superstars of STEM 2021-22 cohort by Science and Technology Australia to serve as a visible role model of women in STEM. Rashina enjoys presenting her research, talks, and stories in a variety of accessible ways to academics, industry, media, and the wider society. For more, see: www.rashina.com Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Bachelor of Science (Honours Distinction), Louisiana State University Computer Science, PhD, Self-Organising Agile Teams: A Grounded Theory , Victoria University of Wellington Research area keywordsSoftware EngineeringHuman and Socio-Technical AspectsResponsible AISocio-Technical Grounded TheoryDigital Health Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2023 2023 2025 2027 2 Active Projects per year DHCRC: DHCRC Translational DH Research FellowshipHoda, R. (Primary Chief Investigator (PCI)) & Zhou, W. (Chief Investigator (CI))Digital Health Cooperative Research Centre1/05/25 → 30/04/26Project: Research RAISE: RAISE: Creating Responsible AI Software Engineering CapabilityTantithamthavorn, K. (Primary Chief Investigator (PCI)), Grundy, J. (Chief Investigator (CI)), Abdelrazek, M. A. (Chief Investigator (CI)), Thongtanunam, P. (Chief Investigator (CI)), Aleti, A. (Chief Investigator (CI)), Nakisa, B. (Chief Investigator (CI)), Treude, C. (Associate Investigator (AI)), Zahedi, M. (Associate Investigator (AI)), Arora, C. (Associate Investigator (AI)), Hoda, R. (Associate Investigator (AI)), Chen, C. (Associate Investigator (AI)), Chen , J. (Associate Investigator (AI)), Cooray, M. (Associate Investigator (AI)), Bigdeli, A. (Associate Investigator (AI)), Uzunov, A. (Associate Investigator (AI)), Hurse, M. (Associate Investigator (AI)) & Saunders, S. (Associate Investigator (AI))Episoft Pty Ltd, Swordfish Computing Pty Ltd1/01/23 → 31/12/27Project: Research Research output Research output per year 2005 2023 2024 2025 55 Conference Paper 53 Article 6 Foreword / Postscript 3 Review Article 6 More 2 Chapter (Book) 1 Book 1 Comment / Debate 1 Editorial 1 Other contribution Research output per year Research output per year Guiding principles for mixed methods research in software engineeringStorey, M. A., Hoda, R., Maciel Paz Milani, A. & Baldassarre, M. T., 9 Jul 2025, In: Empirical Software Engineering. 30, 5, 28 p., 138.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) Managing technical debt in a multidisciplinary data intensive software team: An observational case studyGraetsch, U. M., Hoda, R., Khalajzadeh, H., Shahin, M. & Grundy, J., Dec 2025, In: Journal of Systems and Software. 230, 21 p., 112546.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Navigating fairness: practitioners’ understanding, challenges, and strategies in AI/ML developmentPant, A., Hoda, R., Tantithamthavorn, C. & Turhan, B., 17 Apr 2025, In: Empirical Software Engineering. 30, 3, 38 p., 102.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) Raising AI Ethics Awareness: Insights from a Quiz-Based Workshop with Software Practitioners - An Experience ReportPant, A., Hoda, R. & McIntosh, P., 2025, Proceedings - 2025 IEEE/ACM International Workshop on Responsible AI Engineering, RAIE 2025. Lu, Q., Khomh, F., Vassilev, A., Poretschkin, M. & Bano, M. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 53-60 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Socio-Technical Qualitative Research in Human Robot InteractionHoda, R., 2025, Proceedings of the 2025 ACM/IEEE International Conference on Human-Robot Interaction. Nasir, J. (ed.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 2003-2005 3 p. (ACM/IEEE International Conference on Human-Robot Interaction).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other View all 123 research outputs Prizes Distinguished Paper Award - IEEE International Conference on Software Engineering (ICSE)Hoda, R. (Recipient), 2017Prize: Prize (including medals and awards) Distinguished Reviewer Award - IEEE International Conference on Software Engineering (ICSE)Hoda, R. (Recipient), 2020Prize: Prize (including medals and awards) Teaching Excellence Award - Faculty of Engineering, University of Auckland, New ZealandHoda, R. (Recipient), 2018Prize: Prize (including medals and awards) Activities Activities per year 2017 2017 2018 2019 2020 2020 3 Editorial responsibility 2 Contribution to conference 1 Performance/exhibition Activities per year IEEE Transactions on Software Engineering (Journal)Hoda, R. (Editorial board member)2020 → …Activity: Publication peer-review and editorial work types › Editorial responsibility International Conference on Software Engineering 2021Hoda, R. (Organiser)2020 → 2021Activity: Participating in or organising an event types › Contribution to conference 21st International Conference on Agile Software DevelopmentHoda, R. (Organiser)2019 → 2020Activity: Participating in or organising an event types › Contribution to conference TEDx Talk \"Agile Nation: New Zealand's response to terrorism\"Hoda, R. (Performer)1 May 2019Activity: Community Talks, Presentations, Exhibitions and Events › Performance/exhibition IEEE Software (Journal)Hoda, R. (Editorial board member)2018 → …Activity: Publication peer-review and editorial work types › Editorial responsibility View all 6 activities Press/Media Pandemic Programming Study featured in Australian Computer Society ArticleHoda, R.10/06/201 Media contributionPress/Media: Article/Feature COVID-19 pandemic hits programmers’ productivity, well being, study revealsTurhan, B. & Hoda, R.28/05/201 item of Media coveragePress/Media: Article/Feature ABC News article featuring Agile Nations response to COVID19Hoda, R.22/05/201 item of Media coveragePress/Media: Article/Feature Agile Nations interview on TickerTVHoda, R.18/05/201 item of Media coveragePress/Media: Profile/Interview Monash Lens article on Agile Nations response to COVID19Hoda, R.13/05/201 Media contributionPress/Media: Article/Feature View all 6 press/media",
  "content_length": 7888,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:52"
}