{
  "name": "Rashmi Jha",
  "homepage": "https://researchdirectory.uc.edu/p/jhari",
  "status": "success",
  "content": "Expert Profile: Rashmi Jha | Research Directory Rashmi Jha Professor ERC 385University of CincinnatiCincinnati, Ohio 45220Phone 513-556-1361Email jhari@ucmail.uc.edu 513-556-1361EmailDownload V-Card Dr. Rashmi Jha is Professor in Electrical Engineering and Computer Science Department at the University of Cincinnati. She was an Associate Professor at the University of Cincinnati from 2015-2020. She worked as an Assistant Professor and then Associate Professor in Electrical Engineering and Computer Science Department at the University of Toledo from 2008 to 2015. Before this, she worked as a Process Integration Engineer for 45 nm/32 nm High-k/Metal Gates based Advanced CMOS technology at Semiconductor Research and Development Center, IBM, East Fishkill New York between 2006-2008. She finished her Ph.D. and M.S. in Electrical Engineering from North Carolina State University in 2006 and 2003, respectively, and B.Tech. in Electrical Engineering from Indian Institute of Technology (IIT) Kharagpur, India in 2000. She has more than 18 years of experience in the areas of Solid State Electronics and Nanoelectronic Device Design, Modeling, Fabrication, Process Integration, Electrical Characterization, Data Analysis, Circuit Design and Simulations.  She has been granted 13 US patents and has authored/co-authored several publications in the areas of computing devices, circuits, and algorithms. She has been a recipient of AFOSR Summer Faculty Fellowship Award in 2017, CAREER Award from the National Science Foundation in 2013, IBM Faculty Award in 2012, IBM Invention Achievement Award in 2007, Materials Research Society's Graduate Student Award in 2006, Applied Materials Fellowship Award in 2005-2006, and the best student paper award nomination in IEEE International Electron Devices Meeting (IEDM) in 2005. Her current research interests span all the way from devices to systems and algorithms. Particularly, she is interested in Artificial Intelligence (AI), Low-Power Neuromorphic Systems, CMOS and other emerging logic and memory devices ( such as Resistive Random Access Memory Devices, Spintronics, and other memristive devices), On-die sensors, Cross-Technology Heterogenous Integration and Modeling, Cybersecurity with emphasis on Hardware Security, Additive, Flexible, and Wearable Electronics, Nanoelectronics, Neuroscience and Neuroelectronics, Bio-Inspired Computing and Systems. Ph.D.: North Carolina State University Raleigh, NC, USA, 2006 (Electrical Engineering) M.S.: North Carolina State University Raleigh, NC, USA, 2003 (Electrical Engineering) B.Tech. : Indian Institute of Technology (IIT) Kharagpur, India, 2000 (Electrical Engineering) Artificial Intelligence (AI); Low-Power Neuromorphic Systems; CMOS and other emerging logic and memory devices (such as Resistive Random Access Memory Devices, Spintronics, and other memristive devices); On-die sensors; Cross-Technology Heterogenous Integration and Modeling; Cybersecurity with emphasis on Hardware Security; Additive, Flexible, and Wearable Electronics; Nanoelectronics; Neuroscience and Neuroelectronics; Bio-Inspired Computing and Systems.2000 -2002 Software Engineer, Geometric Software Solutions, Pune, India 2002 -2006 Graduate Research Assistant, North Carolina State University, Raleigh, NC, USA 2006 -2008 Process Integration Engineer, Semiconductor Research and Development Center, IBM Corporation, East Fishkill, NY, USA 2008 -2014 Assistant Professor, University of Toledo, Toledo, Ohio, USA 2014 -2015 Associate Professor, University of Toledo, Toledo, Ohio, USA 2015 -2020 Associate Professor, University of Cincinnati, Cincinnati, Ohio, USA 2020 - Professor, University of Cincinnati, Cincinnati, Ohio, USA, 45220 Grant: #CNS-1556301 Investigators:Jha, Rashmi 05-30-2015 -08-31-2017 National Science Foundation SaTC: Collaborative: Exploiting Spintronics for Security, Trust and Authentication Role:PI $196,979.00 Active Level:Federal Grant: #ECCS-1556294 Investigators:Jha, Rashmi 08-03-2015 -12-31-2017 National Science Foundation CAREER: Novel Nanoelectronic Reconfigurable Synaptic Memory Devices Role:PI $362,231.00 Active Level:Federal Grant: #RY1-UC-17-4 Investigators:Jha, Rashmi 05-08-2017 -05-07-2018 Ohio Department of Higher Education Cyber Physical System Assessment Tools and Techniques for Trusted Microelectronics Role:PI $52,258.00 Active Level:State of Ohio Grant: #CCF-1718428 Investigators:Jha, Rashmi 08-01-2017 -07-31-2020 National Science Foundation SHF:Small: Collaborative Research: Exploring 3-Dimensional Integration Strategies of STTRAM Role:PI $224,999.00 Active Level:Federal Grant: #SETS03-UC-2017 / USAF FA8650-14-D-1724/0003 Investigators:Jha, Rashmi; Vemuri, Ranganadha 02-01-2018 -01-30-2019 Air Force Research Laboratory Secure Engineering of Trusted Systems (SETS), USAF FA8650-14-D-1724/0003 Role:Collaborator $102,500.00 Active Level:Federal Grant: #1919.03.22.91 / FA8650-13-D-1547/0003 Investigators:Jha, Rashmi; Niu, Nan; Ralescu, Anca 08-01-2017 -07-31-2018 Department of the Air Force Exploring Binary Diversification in Codes for Cyber Defense Role:PI $67,500.00 Active Level:Federal Grant: #18-RI-EP-08 Investigators:Jha, Rashmi 03-01-2018 -02-28-2023 Air Force Research Laboratory EDUCATION PARTNERSHIP (18-RI-EP-08) Role:PI $.00 Active Level:Federal Grant: #FA8650-18-C-1911 Investigators:Jha, Rashmi; Ralescu, Anca 04-27-2018 -12-31-2020 Air Force Research Laboratory A Novel, Effective, and Efficient Method for Real-Time Prevention and Detection of, and Intervention in Cyber Attacks for Avionics Systems Role:Collaborator $412,000.00 Awarded Level:Federal Grant: #RY-12-UC-18-4 sub ODHE Investigators:Jha, Rashmi; Ralescu, Anca 08-27-2018 -08-26-2019 Ohio Department of Higher Education Bio-Inspired Self-Evolving Software Platform for Cyber Security / Student: Jeremiah Greer Role:PI $44,130.00 Awarded Level:State of Ohio Grant: #1919.05.05.91 / FA8650-13-D-1547, Task Order FA8650-17-F-1043 Investigators:Jha, Rashmi; Ralescu, Anca 06-01-2018 -10-31-2018 Air Force Research Laboratory Dynamic Analysis using Intel Processor Trace for Real-Time Malware Detection Role:PI $36,300.00 Active Level:Federal Grant: #180889102 via e1350 pre-approval Investigators:Jha, Rashmi 09-01-2018 -12-31-2018 National Institute for Occupational Safety and Health Machine Learning to Predict Lower Back Pain Based on Wearable Sensors Data Role:PI $2,500.00 Active Level:Federal Grant: #75D30119P05031 Investigators:Jha, Rashmi 09-01-2019 -08-31-2020 Centers for Disease Control and Prevention Development of a Machine Learning Algorithm for Classifying Postural Risks of Manual Lifting Role:PI $35,000.00 Awarded Level:Federal Grant: #NSF ECCS 1926465 Investigators:Jha, Rashmi 09-15-2019 -08-31-2022 National Science Foundation Gated-Synaptic Memory Devices with Adaptive Short- and Long-term States for Neuromorphic Computing Role:PI $300,000.00 Awarded Level:Federal Grant: #SETS04-UC-2019 / FA8650-14-D-1724/0004 Investigators:Emmert, John; Jha, Rashmi; Vemuri, Ranganadha 06-01-2019 -04-30-2020 Air Force Research Laboratory Secure Engineering of Trusted Systems (SETS 04) Role:Collaborator $932,517.00 Awarded Level:Federal Grant: #RX16-UC-19-5-AFRL2 / FA8650-19-2-9300 Mod P00009 - Mayersky Investigators:Jha, Rashmi 08-26-2019 -11-30-2020 Air Force Research Laboratory Oxide ferroelectric materials for memristor and FeFET devices (Student: Joshua Mayersky) Role:PI $52,260.00 Awarded Level:Federal Grant: #IMPACT02-UC-01-2020 / W9111QY-17-C-0114 Investigators:Emmert, John; Jha, Rashmi 01-02-2020 -08-25-2020 Air Force Research Laboratory PHASE I: Simplified Asynchronous Design Framework for Side Channel Attack (SCA) Obfuscation and Mitigation Role:Collaborator $175,000.00 Awarded Level:Federal Grant: #RY8-UC-20-1 Investigators:Jha, Rashmi 08-24-2020 -08-23-2021 Ohio Department of Higher Education Context-Aware Malware Detection for Autonomous Air Vehicle Operations Role:PI $44,130.00 Awarded Level:State of Ohio Grant: #2020 KBR Teaming Agreement Investigators:Jha, Rashmi 07-15-2020 -07-14-2022 Department of the Air Force TEAMING AGREEMENT Between KBR Wyle Services, LLC And University of Cincinnati Role:PI $.00 Active Level:Federal Grant: #RY9-UC-20-4 Investigators:Jha, Rashmi 05-11-2020 -11-30-2021 Ohio Department of Higher Education Adaptable Protection for Embedded Systems Resilience Role:PI $52,260.00 Active Level:State of Ohio Grant: #IPIP 003 - Additive Components / CNS-1916722 Investigators:Cahay, Marc; Jha, Rashmi 06-01-2020 -05-31-2021 National Science Foundation Internal award from the CHEST IUCRC grant Program Income Accounts for PI: Rashmi Jha for Additive Components for Hardware Integrity Monitoring, as approved by the CHEST IAB. Role:PI $.00 Awarded Level:Federal Grant: #MOU / P1-19-1958 Investigators:Jha, Rashmi 09-21-2020 -09-20-2022 Air Force Research Laboratory Phase 2 ?Sanitized? Pricing Proposal / Information Analysis Center (IAC) Multiple Award Contract (MAC) Task Order (TO) Role:PI $.00 Active Level:Federal Grant: #FA9550-20-1-0218 Investigators:Angelopoulos, Anastasios; Guliants, Vadim; Jha, Rashmi; Shanov, Vesselin; Shi, Jing; Smith, Leigh; Steiner, Matthew; Vasudevan, Vijay; White, Ryan; Zhang, Peng 09-01-2020 -08-31-2021 Air Force Office of Scientific Research Acquisition of an Analytical High-Resolution Scanning/Transmission Electron Microscope for Multidisciplinary Research and Education Role:Collaborator $500,000.00 Awarded Level:Federal Grant: #AF 1677 Investigators:Angelopoulos, Anastasios; Guliants, Vadim; Jha, Rashmi; Shanov, Vesselin; Shi, Jing; Smith, Leigh; Steiner, Matthew; Vasudevan, Vijay; White, Ryan; Zhang, Peng 09-01-2020 -08-31-2021 Ohio Department of Higher Education Acquisition of an Analytical High-Resolution Scanning/Transmission Electron Microscope for Multidisciplinary Research and Education Role:Collaborator $237,500.00 Awarded Level:State of Ohio Grant: #TAME01-UC-2020 / 47QFLA20R0008/47QFLA20F0096 Investigators:Emmert, John; Jha, Rashmi 09-01-2020 -",
  "content_length": 26394,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:53"
}