{
  "name": "Rashmi Vinayak",
  "homepage": "http://www.cs.cmu.edu/~rvinayak",
  "status": "success",
  "content": "Rashmi K. Vinayak Google Scholar page rvinayak[at]cs.cmu[dot]edu Gates 9231 @RashmiKVinayak News • Juncheng Yang's PhD dissertation won the 2025 ACM SIGOPS Dennis M. Ritchie Award. Congratulations to Juncheng! • Helix, an LLM inference system for heterogeneous GPU clusters, accepted at ASPLOS 2025. Congratulations to Yixuan! • Morph, file-lifetime redundancy management in cluster file systems, presented at SOSP 2024. Congratulations to Tim and Sanjith! • Juncheng Yang accepts tenure track assistant professor offer from Harvard CS. Congratulations to Juncheng! • Our paper on SIEVE, a novel eviction algorithm for web caches, wins USENIX NSDI 2024 Community (Best Paper) Award! Congratulations to Yazhuo and Juncheng! • S3-FIFO (ACM SOSP 2023), our new cache eviction algorithm, has been adopted at VMware, Google, Redpanda, and several opensource libraries and systems! • S3-FIFO (ACM SOSP 2023) reached top of HackerNews! • Honored to be named Sloan Research Fellow 2023. • Honored to be named IEEE Information Theory Society Goldsmith Lecturer 2023. • Honored to receive Meta SDCs at scale Research Award 2022. • Our paper on Pacemaker (USENIX OSDI 2020) chosen among Highlight Papers at ACM Systor 2022. • Honored to receive 2021 VMware Systems Research Award. • Our paper on Segcache, a memory-efficient and high-throughput in-memory cache, wins USENIX NSDI 2021 Community (Best Paper) Award! Congratulations to Juncheng! • \"FoldedCNNs\", a novel approach for high throughput, high GPU-utilization specialized CNN inference, accepted to ICML 2021. Congratulations to Jack! • Invited talk at Stanford Compression Workshop 2021. • \"Segcache\", a memory-efficient and high-throughput in-memory cache, accepted to NSDI 2021. Congratulations to Juncheng! • Our OSDI 2020 paper recognized by the PC chairs as one of the best storage-related papers of OSDI 2020 and invited to the ACM Transactions on Storage. Congratulations to Juncheng! • Saurabh successfully defended his Ph.D. thesis! Congratulations to Saurabh! • Two papers from our group accepted for publication at OSDI 2020 (on resource efficiency in storage and in-memory caching systems). Congratulations to Jason, Saurabh, Francisco and Suhas! • Excited to be participating in the live panel sesssion on Machine-learning based approaches to coding\" at IEEE ISIT 2020. • Honored to receive NSF CAREER Award 2020. • Honored to receive Facebook Distributed Systems Research Award 2019. • Juncheng Yang receives Facebook PhD fellowship. Congratulations, Juncheng! • Honored to receive \"Prof. Narasimhan Memorial Lecture Award 2020\" from Tata Institute of Fundamental Research. • Our work on a new class of storage codes called Convertible codes to appear in ITCS (Innovations in Theoretical Computer Science) 2020. • Invited talk at AISystems workshop at ACM SOSP 2019. • Our work on learning-based coded computation for ML inference systems to appear in ACM SOSP 2019. • Invited talk at Facebook Networking and Communications Faculty Summit 2019. • Invited talk at ICML 2019 CodML Workshop on \"Reslient ML Inference via Coded Computation: A learning-based Approach\" (video). • Our work on social live video streaming to appear in ACM SIGCOMM 2019. • Google Faculty Research Award 2018. • NSF CRII 2018. • Program committee member for USENIX NSDI 2020. • Invited talk at ITA 2019. • Invited attendee at Microsoft Systems Faculty Summit 2018. • Facebook Communications and Networking Research Award 2017. • Program committee member for USENIX OSDI 2018. • DART used in Top 5 WSDM 2018 Music Recommendation Challenge winner. • Program committee member for SysML 2018. • Joined CMU CS as an assistant professor. • Received Eli Jury Award 2016 for best thesis in the area of Systems, Communications, Control, or Signal Processing at EECS, UC Berkeley. • Invited talk at ITA Graduation Day 2016. • Invited talk at Allerton 2015. • Awarded Google Anita Borg Memorial Scholarsihp 2015. • 'Reducing I/O cost in distributed storage codes' at USENIX FAST 2015. Chosen as the best paper of USENIX FAST 2015 by StorageMojo. I am an Associate Professor in the Computer Science Department at Carnegie Mellon University, where I am a part of both the Systems group and the Theory group. I lead the CMU TheSys research group, and also a part of the Parallel Data Lab (PDL). Before joining CMU, I did my Ph.D. and postdoctoral studies at UC Berkeley. My research interests broadly lie in computer/networked systems and information/coding theory, and the wide spectrum of intersection between the two areas. My current focus is on robustness and resource efficiency in data systems spanning across the system stack including storage, communication, and computation. The key thrusts include storage systems, caching systems, and systems for machine learning. The research from my group has been adopted by industry, both in large-scale production systems and in popular open source libraries, has been featured on popular media platforms, and has won multiple best paper awards. Check out our research below! A note to prospective students: Due to the high volume of emails that I receive from prospective students, unfortunately, I am unable to respond to them. Apologies in advance for this. But, I do catch up with these emails eventually, if there is a good fit and an opening in my group. If you are interested in joining my group as a PhD student, please apply to either CSD or ECE departments at CMU and write my name in your application. TheSys (\"Theory + Systems\") Group Overarching goal: The amount of data stored, communicated, and processed is increasing exponentially, making data systems indispensable to our society. Data systems have grown to a humongous scale where non-ideal conditions such as failures and unavaiblabilities are the norm. Safety-critical applications are increasingly becoming data driven. The frontiers of computing are expanding into operating regimes which are inherently unreliable. Due to these trends, it is imperative to make data systems robust by design, while being resource efficient and performant. The overarching goal of our research is to design and build next-generation data systems that are robust, efficient and performant, spanning across the system stack including storage, computation, and communication. Approach: We take a multi-disciplinary approach, spanning computer systems and networking, information and coding theory, and machine learning. We design solutions that are rooted in fundamental theory and enhanced with machine learning, and build systems that employ the resulting solutions to advance the state-of-the-art in data systems.\tWe also collaborate extensively with industry which enables us to (1) base our solutions on data from real-world production systems, and (2) make an impact on real-world practice. Our industry collaborators include Google, Microsoft, NetApp, Facebook, Cisco, Intel and Cloudera. Here is our group's Github. People: I am fortunate to be advising and working with the following amazing students at CMU. Current students: PhD students: Sanjith Athlur (co-advised with Greg Ganger) Timothy Kim (co-advised with Greg Ganger) Yixuan Mei Saransh Chopra Masters students: Meredith Pan Frank Chen Undergraduate students: Bob Chen Graduated students: PhD students: Juncheng (Jason) Yang (headed to Harvard University as a tenure track assistant professor) Francisco Maturana (CMU -> AWS Data Storage team) Michael Rudow (CMU -> McKinsey) Jack Kosaian (CMU -> Nvidia) Saurabh Kadekodi (co-advised with Greg Ganger) (CMU -> Research Scientist at Google) Masters students: Justin Zhang (CMU -> Purdue Ph.D. student) Saransh Chopra (CMU -> CMU Ph.D. student) Timothy Kim (CMU -> CMU Ph.D. student) Jiyu Hu (CMU -> UIUC Ph.D. student) Kaige Liu (CMU -> Meta) Abhishek Kumar (CMU) Shaobo Guan (CMU) Arvind Sai Krishnan (CMU) Vilas Bhat (CMU -> Google) Jiaan\tDai\t(CMU) Jiaqi\tZuo\t(CMU) Jiongtao Ye (CMU) Xuren\tZhou (CMU) Sai Kiriti Badam (CMU) Undergraduate students: Justin Zhang (CMU -> CMU 5th year masters) Helen Wang (CMU) Tianyu Zhang (CMU -> CMU 5th year masters) Ziming Mao (Yale -> UC Berkeley Ph.D. student) Ian Chiu (CMU -> Instagram) Eliot Robson (CMU -> UIUC Ph. D. student) Chaitanya Mukka (BITS, India) Weizhong Zhang (Tsinghua University, China -> CMU Tepper PhD student) Sanya Agarwarl (CMU) Support: My group's research has been generously funded by NSF, Sloan Foundation, Open Compute Project (OCP), Google, Facebook/Meta, VMware, and Amazon Web Services. Support gratefully acknowledged. Publications (On Google Scholar) Conference Papers \"Okapi: Decoupling Data Striping and Redundancy Grouping in Cluster File Systems\" Sanjith Athlur, Tim Kim, Saurabh Kadekodi, Francisco Maturana, Xavier Ramos, Arif Merchant, K.V. Rashmi, Greg Ganger USENIX OSDI, 2025. (Slides) (Talk video) \"Helix: Serving Large Language Models over Heterogeneous GPUs and Network via Max-Flow\" Yixuan Mei, Yonghao Zhuang, Xupeng Miao, Juncheng Yang, Zhihao Jia, K.V. Rashmi ACM ASPLOS, 2025. Github Repo. See Helix repo. \"Secure Convertible Codes for Passive Eavesdroppers\" Justin Zhang and K. V. Rashmi IEEE International Symposium on Information Theory (ISIT), 2025. \"Morph: Efficient File-Lifetime Redundancy Management for Cluster File Systems\" Tim Kim, Sanjith Athlur, Saurabh Kadekodi, Francisco Maturana, Dax Delvira, Arif Merchant, Greg Ganger, K.V. Rashmi ACM SOSP, 2024. Github Repo. See Morph repo. \"SIEVE: Simple and Efficient Eviction Policy for Turn-key Web Cache Replacement\" Yazhuo Zhang, Juncheng Yang, Yao Yue, Ymir Vigfusson, K.V. Rashmi USENIX NSDI, 2024. USENIX NSDI 2024 Community (Best Paper) Award. (Slides) Industry adoption, open source libraries, and media coverage: SIEVE website. \"On Low Field Size Constructions of Access-Optimal Convertible Codes\" Saransh Chopra, Francisco Maturana, K. V. Rashmi IEEE International Symposium on Information Theory (ISIT), 2024. \"Communication-efficient, Fault Tolerant PIR over Erasure Coded Storage\" Andrew Park, Tre",
  "content_length": 24166,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:54"
}