{
  "name": "Rasha Obeidat",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=rmobeidat",
  "status": "success",
  "content": "Rasha Mohammad Obeidat × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content rasha mohammad obeidat • Department of Computer Science - Faculty Member --- --- Department of Computer Science rmobeidat@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from Oregon State University, 2019 Msc. of Computer Science from Jordan University of Science and Technology, 2009 Bsc. of Computer Science & Information Technology from Jordan University of Science and Technology, 2005 \"Exploring prompting for dialectical machine translation: a focus on north Jordanian Arabic\", PeerJ Computer Science Rasha Mohammad Muhsen Obeidat, Lu'Ay Mohammed Deeb Alawneh 12/11/2025 \"Integrating artificial neural networks and neighborhood analysis for enhanced urban growth prediction depending on planned future development areas: A case study of Ar-Ramtha, Jordan\", Journal of Urban Management Anne Ayesh Mousa Gharaibeh, Mohammad Sufyan Khalaf Al-Rabee', Rasha Mohammad Muhsen Obeidat 25/04/2025 \"ArEntail: Manually-curated Arabic Natural Language Inference Dataset from News Headlines\", Language Resources and Evaluation Rasha Mohammad Muhsen Obeidat, Yara Emad Abed Al Ghafoor Al Harahsheh, Mahmoud Abdel-Karim Mahmoud Alshbool, Maram Mohammed Tayel Gharaibeh 22/04/2024 \"ArQuAD: An Expert-Annotated Arabic Machine Reading Comprehension Dataset\", Cognitive Computation Rasha Mohammad Muhsen Obeidat, Marwa Abdel Karim Helal Alharbi, Mahmoud Abdel-Karim Mahmoud Alshbool, Lu'Ay Mohammed Deeb Alawneh 11/03/2024 \" Multi-label multi-class COVID-19 Arabic Twitter dataset with fine-grained misinformation and situational information annotations\", PeerJ Computer Science Rasha Mohammad Muhsen Obeidat, Maram Mohammed Tayel Gharaibeh, Malak Abdel Ghani Mustafa Abdullah, Yara Emad Abed Al Ghafoor Al Harahsheh 05/12/2022 \"A Classifier to Detect Profit and Non Profit Websites Upon Textual Metrics for Security Purposes\", Journal of ICT Research and Applications Yahya Mohammad Suleiman Tashtoush, Dirar Abdul-Kareem Mohammad Darweesh, Rasha Mohammad Muhsen Obeidat 06/04/2022 Faculty Member, Department of Computer Science, Dec 2019 - Present Full-time Lecturer, Department of Computer Science, Sep 2019 - Dec 2019 DATA MINING DATA STRUCTURES DEEP LEARNING INFORMATION RETRIEVAL SYSTEMS INTRODUCTION TO OBJECT- ORIENTED PROGRAMMING INTRODUCTION TO PROGRAMMING NATURAL LANGUAGE PROCESSING NATURAL LANGUAGE PROCESSING OBJECT-ORIENTED PROGRAMMING LAB PROGRAMMING IN C++ PROGRAMMING LAB SELECTED PROGRAMMING LANGUAGES (FOR NON COMPUTER SCIENCE INFORMATION STUDENTS) SELECTED TOPICS IN COMPUTER SCIENCE 2 Deep Learning Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Newsletter Enter your email address to get the latest University news, special events and student activities delivered right to your inbox. Subscribe to JUST Newsletter ©2022, Information Technology and Communication Center. Jordan University of Science and Technology. All Rights Reserved. Contact JUST Jordan University of Science and Technology P.O.Box 3030, Irbid 22110, Jordan Tel: +962 2 7201000 Fax: +962 2 7095123 Email: public@just.edu.jo Close QS Ranking 2026 Close",
  "content_length": 3453,
  "method": "requests",
  "crawl_time": "2025-12-01 14:15:55"
}