{
  "name": "Ravi Ramamoorthi",
  "homepage": "https://cseweb.ucsd.edu/~ravir",
  "status": "success",
  "content": "RAVI RAMAMOORTHI'S HOME PAGE Ravi Ramamoorthi Ronald L. Graham Professor of Computer Science Director, UC San Diego Center for Visual Computing Professor CSE Department ; affiliate in ECE University of California, San Diego EBU3B, Room 4118 9500 Gilman Dr, MC 0404 La Jolla, CA 92093-0404 Office: 4118 EBU3B Phone: 858-822-1483 Fax:     858-534-7029 ravir@cs.ucsd.edu URL: http://www.cs.ucsd.edu/~ravir CV           Publications I started here at the University of California, San Diego CSE@UCSD on Jul 1, 2014, moving from UC Berkeley. My goal is to build a world-leading graphics and vision group at UCSD. (See launch of new UC San Diego Center for Visual Computing with newspaper article at UT San Diego, UCSD TV Computing Primetime on Visual Computing, appointment to endowed chair, selection as ACM Fellow and earlier UCSD News Release on my appointment). I also hold a part-time appointment as a Distinguished Research Scientist, Graphics at NVIDIA. New: I have written an article of general interest, TALES OF A GROUP LEADER: BUILDING LEADING ACADEMIC RESEARCH GROUPS on my experiences and advice on creating leading visual computing research groups at UCSD, and earlier Berkeley and Columbia. A followup article TALES OF ACADEMIC LIFE on faculty life and advice is now available. New: I am the Papers Chair for SIGGRAPH Asia 26. Please fill out this Self Nomination Form if you are interested in serving on the technical papers committee. MOOCS: Rendering MOOC, New now on edx, please sign up here. Lecture videos are also publicly available at local CSE 168 schedule or my YouTube Channel. Older News: Launch of Computer Graphics, CSE 167x as the first UC San DiegoX course (earlier Berkeley CS 184.1x, one of the founding 9 courses on the edX Platform in 2012, see Online Lectures and YouTube Channel), now self paced. Please sign up. Also see article in ThisWeek@UCSanDiego and launch of first online Virtual Reality (VR) App Development Professional Certificate, see CSE article. NERFs: ECCV 20 paper on NeRFs receives best paper honorable mention and selected for CACM. See ECCV 20 Daily Feature. ACM Dissertation Award Honorable Mention to Ben and Pratul, Frontiers of Science Award. SEMINAL PAPERS IN GRAPHICS: SIGGRAPH 2001 paper on A Signal-Processing Framework for Inverse Rendering included in 50th year SIGGRAPH anniversary Seminal Papers on Graphics. LFs: Website for Light Field Projects (2013-2021). Includes papers and datasets. Teaching CSE 167 Computer Graphics Winter 2024 Winter 2023 Winter 2022 Winter 2019 Winter 2017 CSE 168 Rendering Spring 2026 Spring 2025 Spring 2024 Spring 2021 Spring 2020 CSE 274 Topics in Computer Graphics Winter 2026 (Image-Based Rendering) Fall 2022 (Denoising to View Synthesis) Fall 2021 Fall 2018 (Samp./Recon. Visual Appearance) Winter 2018 CSE 163 Advanced Computer Graphics Spring 2018 Spring 2017 Winter 2016 (CSE 190) Spring 2015 (CSE 190) Selected Awards 2024 Frontiers of Science Award Certificate Award Trophy 2023 Frontiers of Science Award Certificate Award Trophy NeRF of NeRF Trophy 2019 SIGGRAPH Academy Plaque Teapot CSE Article 2017 ACM Fellow CSE Article SIGGRAPH Article ACM Announcement Certificate 2017 edX Prize for Exceptional Online Teaching and Learning (finalist) edX Blog UCSD art. Prize Certificate 2017 IEEE Fellow CSE Article Letter Certificate 2016 edX Prize for Exceptional Online Teaching and Learning (inaugural finalist) edX Blog UCSD art. Prize Certificate 2016 Ronald L. Graham (Endowed) Chair of Computer Science CSE Article Announcement Card 2011 Okawa Foundation Research Grant Award Certificate Website 2008 PECASE (Presidential Early Career Awards for Scientists and Engineers) Award Certificate Award Photo Group Photo with President Bush White House Press Release 2007 SIGGRAPH Significant New Researcher Award for Computer Graphics Video Citation Press Release Selected New Research: 2023-25 Selected New Papers in 2025: SIGGRAPH, SIGA, CVPR, 3DV (See pub. list for 2026, others) Automatic Sampling Discontinuities Differentiable Shaders (SIGA 25) Differentiable Light Transport Gaussian Surfels (SIGA 25) Generative Neural Materials (SIG 25) Unbiased Differential Visibility Walk-on-Spherical Caps (SIG 25) Locally Orderless Images (CVPR 25) RealmDreamer: Text-Driven 3D Scene Generation (3DV 25) Selected New Papers in 2024: SIGGRAPH, SIGA, ICML, CGF, TOG (See pub. list for others) Fluid Implicit Particles on Coadjoint Orbits (SIGA 24) A Generalized Ray Formulation of Wave Optics (SIGA 24) Residual Path Integrals for Re-Rendering (EGSR 24) Neural Geometry Fields for Meshes (SIG 24) What you see is What you GAN (CVPR 24) Importance Sampling BRDF Derivatives (TOG 24) Selected New Papers in 2023: SIGGRAPH, SIGA, ICML, CGF, TOG (See pub. list for others) Discontinuity-Aware 2D Neural Fields (SIGA 23) Live Portrait 3D: Real-Time Radiance Fields (SIG 23) NeRFDiff: Single-Image View Synthesis 3D Diffusion (ICML 23) MesoGAN: Generative Neural Reflectance Shells (CGF 23) NeuSample: Sampling for Neural Materials (SIG 23) Decorrelating ReSTIR Samplers via MCMC Mutations (TOG 23) Research Summary My research group develops the theoretical foundations, mathematical representations and computational models for the visual appearance of objects, digitally recreating or rendering the complexity of natural appearance. Our research program cuts across computer graphics, computer vision and signal processing with applications in sparse reconstruction and frequency analysis, Monte Carlo importance sampling, interactive photorealistic rendering, acquisition and representation of data-driven appearance, volumetric scattering, animation, image and video editing, light-field cameras, physics-based vision and lighting-insensitive recognition. This work has led to more than 200 publications, including more than 100 SIGGRAPH or TOG papers, and has been recognized in 2005 by a Sloan Fellowship and an NSF CAREER award, in 2007 with an ONR Young Investigator Award and the ACM SIGGRAPH Significant New Researcher Award, with a Presidential Early Career Award in a White House ceremony in Dec 2008, and an Okawa Foundation Award in 2011. In Spring 2016, I was appointed the inaugural holder of the Ronald L. Graham Chair of Computer Science. I was named a finalist for the inaugural edX prize for exceptional contributions in online teaching and learning (and again in 2017, as the only computer science and only two-time finalist). In 2017, I was also elevated to IEEE fellow for contributions to foundations of computer graphics and computer vision, and to ACM fellow for contributions to computer graphics rendering and physics-based computer vision. In 2019, I was elected to the SIGGRAPH Academy for groundbreaking theoretical work in mathematical representations of visual appearance, and for translating these into computational methods with wide practical impact. My papers on Local Light Field Fusion and Neural Radiance Fields received Frontiers of Science Awards in 2023 and 2024. Beyond academia, I serve as a distinguished research scientist, graphics, at NVIDIA. I have been on the technical advisory board at Proprio Vision. A full CV is available. While my focus has been primarily on academic publication, many of my papers have been refined and later widely implemented in products and commercial applications. For example, my work on spherical harmonic lighting and irradiance environment maps is now widely included in games (such as the Halo series), and is increasingly adopted in movie production (being a critical component of the rendering pipeline in Avatar in 2010, and now an integral part of RenderMan 16, since mid-2011). These ideas are also being used by Adobe for relighting, and are now included in many standard textbooks. My research on importance sampling has inspired a sampling and image-based lighting pipeline that is becoming standard for production rendering (also included in RenderMan 16) and is used for example on the Pixar movie, Monsters University (my papers discussing production use methods are presented at EGSR 2012 and the inaugural JCGT paper). Models for volumetric scattering have been used in demos by NVIDIA, and elsewhere in industry. I also participated in developing the first electronic field guide ; a subsequent iPhone app developed by Prof. Belhumeur and colleagues is now widely used by the public for visual species identification. Most recently, work on sampling and reconstruction for rendering (frequency analysis, adaptive wavelet rendering) has inspired widespread use of Monte Carlo denoising in industry, and been recognized as seminal in a EG STAR report. Subsequent work on real-time physically-based rendering and denoising (axis-aligned filtering for soft shadows) has inspired modern software and hardware real-time AI denoisers, which are now integrated into Optix5 and NVIDIA's RTX chips (2017, 18). As a result, physically-based (raytraced) rendering with denoising is now a reality in both offline and real-time rendering pipelines. Our new Fur Reflectance Model has been used for all animal fur in the 2017 movie War for the Planet of the Apes, nominated for a visual effects Oscar, while new glint models have been used in AutoDesk Fusion 360 and games. Neural Radiance Fields underlie many current commercial products for scene acquisition and generative 3D AI, including at Luma, Google, the New York Times, etc. A somewhat out of date summary of research projects is available (the listing of papers below is up to date). I am still interested in many of the same areas, as well as a broader range of topics. My current funding and research interests fall in four main directions: (1) Signal Processing and Sparse Reconstruction of Visual Appearance, with implications across Rendering, Imaging and Animation (see position paper ); (2) A Digital Visual Appearance Pipeline for complex visually rich materials; (3) Physics-Based Computer Vision with realistic reflectance, illumination and light transport",
  "content_length": 151295,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:04"
}