{
  "name": "Ravi Karkar",
  "homepage": "https://people.cs.umass.edu/~rkarkar",
  "status": "success",
  "content": "Ravi Karkar Ravi Karkar About Publications Teaching CV Contact: rkarkar@umass.edu Office: LGRC A351B Current PhD Mentees: Abhay Sheel Anand (co-advised with Deepak Ganesan) Itir Sayar (co-advised with VP Nguyen) Jeongah (Jasmine) Lee Sabrina Zaman Ishita Sidharth Kaliappan Qiuyue (Joy) Zhong I am an Assistant Professor in the Manning College of Information and Computer Sciences at the University of Massachusetts Amherst. I co-direct the Health Tech for the People (HT4P) initiative and am part of the stakeholder engagement core of MassAITC. My research focuses on using human-centered approaches to develop tools that enable people to collect, interact with, and use novel health data. Through these new health data experiences, I aim to empower individuals to actively engage with their personal health data, fostering informed self-advocacy and evidence-driven wellness decisions. In the past I have developed tools to support chronic care for conditions such as irritable bowel syndrome (IBS), cirrhosis, migraine, and depression. More recently, I am interested in: Developing novel tools to support better understanding and management of conditions such as mild cognitive impairment, mental health, and Alzheimer's disease. Developing n-of-1 (self-experimentation) tools to reduce barriers to people adopting a data-centric approach to better understand their health and well being. Understanding the ethics of health technology design. Look at my work with HT4P. Developing an understanding of the role of design research in informing clinical practice (connecting HCI with implementation science). I received my Ph.D. in Computer Science & Engineering from the University of Washington. I am receipient of the NSF CAREER award. I am a 2024 and 2025 STRIDE faculty fellow, 2024 PIT faculty fellow, and 2023 mHealth Training Institute fellow. My research has been recognized by CHI and DIS, and I have organized cross-disciplinary panels and discussions around tools for self-tracking at ICTD and QSC. I am grateful to have my research supported by NSF, NIA a2 Pilot Program, and UMass. I am happy to talk with folks about my recent work: Supporting collaborative care management of patients with cancer and depression by integrating care managers, oncologists, psychiatrists, and administrators to treat depression in primary care settings. Introducing a new form of self-monitoring in people with end-stage liver disease enabling them to better understand their chronic condition. Select Publications See my CV or Google Scholar for a complete publication list. Health Tech for the People (HT4P): A Transdisciplinary Research Initiative Focused on Artificial Intelligence Tech Ethics and Design for Health Justice Rachel (Rae) Walker, Jess Dillard-Wright, Ravi Karkar, Joohyun Chung, Jason Molony, and Cory Ellen Gatrall Nursing Outlook 2025 • PDF • Source A Systematic Review of Unmet Needs of Older Adults in Home Settings and Their Implications for Novel Technological Solutions Andrew Dolman, Sidharth Kaliappan, Yanling Zhou, Divija Palleti, Jenna Marquard, Sunghoon Lee, Ravi Karkar, and Holly Jimison Innovation in Aging 2025 • PDF • Source Balancing Caregiving and Self-Care: Exploring Mental Health Needs in Alzheimer’s and Dementia Caregiving Jiayue Melissa Shi, Keran Wang, Dong Whi Yoo, Ravi Karkar, and Koustuv Saha CSCW 2025 • arXiv • Source Forthcoming Online Communities as a Support System for Alzheimer Disease and Dementia Care: Large-Scale Exploratory Study Sidharth Kaliappan, Chunyu Liu, Yoshee Jain, Ravi Karkar, and Koustuv Saha JMIR Aging 2025 • PDF • Source Deploying and Examining Beacon for At-Home Patient Self-Monitoring with Critical Flicker Frequency Richard Li, Philip Vutien, Sabrina Omer, Michael Yacoub, George N Ioannou, Ravi Karkar, Sean A Munson, and James Fogarty CHI 2025 • Best Paper Award (Top 1%) • PDF • Source SCOPE: Examining Technology-Enhanced Collaborative Care Management of Depression in the Cancer Setting Anant Mittal, Tae E. Jones, Ravi Karkar, Jina Suh, Spencer Williams, Yihao Zheng, Lydia M. Andris, Nicole Bates, Amy M. Bauer, Ty W. Lostuter, Jesse R. Fann, James Fogarty, and Gary Hsieh CSCW 2025 • PDF • Source AI vs. Humans for Online Support: Comparing the Language of Responses from LLMs and Online Communities of Alzheimer’s Disease Koustuv Saha, Yoshee Jain, Chunyu Liu, Sidharth Kaliappan, and Ravi Karkar ACM Health 2025 • PDF • Source Hardware-Assisted Privacy-Preserving Multi-Channel EEG Computational Headwear Abdul Aziz*, Bhawana Chhaglani*, Amirmohammad Radmehr, Joseph Collins, Jeremy Gummeson, Sunghoon Ivan Lee, Ravi Karkar, and Phuc Nguyen (* = co-first authors) IEEE-BSN 2024 • PDF • Source Evaluating a Novel, Portable, Self-Administrable Device (“Beacon”) That Measures Critical Flicker Frequency as a Test for Hepatic Encephalopathy Philip Vutien, Richard Li, Ravi Karkar, Sean A Munson, James Fogarty, Kara Walter, Michael Yacoub, George N Ioannou AJG 2023 • PDF • Source Using Health Concept Surveying to Elicit Usable Evidence: Case Studies of a Novel Evaluation Methodology Alex Mariakakis, Ravi Karkar, Shwetak N Patel, Julie A Kientz, James Fogarty, Sean A Munson JMIR 2022 • PDF • Source The Importance of Starting with Goals in N-of-1 Studies Sean A. Munson, Jessica Schroeder, Ravi Karkar, Julie A. Kientz, Chia-Fang Chung, and James Fogarty Frontiers 2020 • PDF • Source Examining Opportunities for Goal-Directed Self-Tracking to Support Chronic Condition Management Jessica Schroeder, Ravi Karkar, Natalia Murinova, James Fogarty, and Sean A. Munson IMWUT 2019 • PDF • Source • Code Beacon: Designing a Portable Device for Self-Administering a Measure of Critical Flicker Frequency Ravi Karkar, Rafal Kocielnik, Xiaoyi Zhang, Jasmine Zia, George N. Ioannou, Sean A. Munson, and James Fogarty IMWUT 2018 • PDF • Source • Code Examining Self-Tracking by People with Migraine: Goals, Needs, and Opportunities in a Chronic Health Condition Jessica Schroeder, Chia-Fang Chung, Daniel A. Epstein, Ravi Karkar, Adele Parsons, Natalia Murinova, James Fogarty, and Sean A. Munson DIS 2018 • Honorable Mention Award (Top 5%) • PDF • Source TummyTrials: A Feasibility Study of Using Self-Experimentation to Detect Individualized Food Triggers Ravi Karkar, Jessica Schroder, Daniel A. Epstein, Laura R. Pina, Jeffrey Scofield, James Fogarty, Julie A. Kientz, Sean A. Munson, Roger Vilardaga, and Jasmine Zia CHI 2017 • Honorable Mention Award (Top 5%) • PDF • Source • Code A Framework for Self-Experimentation in Personalized Health Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R. Mishra, James Fogarty, Sean A. Munson, and Julie A. Kientz JAMIA 2016 • PDF • Source Organizer Open Session Panel - ICTD and Personal Informatics at ICTD 2019 Discussion - Designing Platforms for N-of-1 Experiments at QSC 2018 Program Committee Graphics Interface Conference - 2020 Pervasive Health Conference - 2020 CHI workhop - A Short Workshop on Next Step Towards Long Term Self Tracking - CHI 2018 University Service DUB Student Coordinator - 2017-2019 DUB Doctoral Consortium Co-organzier - 2018, 2019 CSE PhD Admission Committe (as reviewer)- 2017, 2019 CSE 590h Seminar Student Coordinator - 2016-2018 CSE PhD Mentorship Program (as mentor) - 2015-2017 DUB Retreat Student Coordinator - 2017 CSE Visit Days HCI Area Scheduler-in Chief and Housing Coordinator - 2017 CSE Visit Days Housing Coordinator and Activity Coordinator - 2016, 2017 Reviewer GI, Graphics Interface Conference - 2020 Pervasive Health, EAI International Conference on Pervasive Computing Technologies for Healthcare - 2017, 2020 CHI, ACM Conference on Human Factors in Computing Systems - 2017-2020 IMWUT, Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (previously UbiComp) - 2016-2018 AMIA, American Medical Informatics Association - 2018 IDC, ACM Interaction Design and Children Conference - 2018 DIS, ACM SIGCHI Conference on Designing Interactive Systems - 2018 TEI, ACM International Conference on Tangible, Embedded and Embodied Interaction - 2018 ISWC, International Symposium on Wearable Computers - 2017 Volunteer Student Volunteer UbiComp - 2015, 2017 Student Volunteer CHI - 2012, 2016 I primarily teach upper-level undergraduate courses related to human-computer interaction and health informatics. I also mentor undergraduate students through honors theses and Early Research Scholars Program. CompSci 325 - Introduction to Human-Computer Interaction Fall 2022, Fall 2024 Latest syllabus Info 490PI - Personal Health Informatics Spring 2023, Spring 2024, Spring 2025, Fall 2025 Latest syllabus Please reach out to me if you would like to view my course slides or other materials. A PDF version of the CV can be downloaded from here. It appears you don't have a PDF plugin for this browser. You can click here to download the PDF file.",
  "content_length": 8843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:01"
}