{
  "name": "Ravishankar K. Iyer",
  "homepage": "https://www.ece.illinois.edu/directory/profile/rkiyer",
  "status": "success",
  "content": "Ravishankar K Iyer | Electrical & Computer Engineering | Illinois Ravishankar K Iyer Ravishankar K Iyer Administrative TitlesGeorge and Ann Fisher Distinguished Professor of Engineering Professor (217) 333-9732 rkiyer@illinois.edu 255 Coordinated Science Lab For More Information Ravishankar K. Iyer's home page Education Ph.D., Electrical Engineering, University of Queensland, 1977 BE Electrical Engineering University of Queensland 1973 BiographyRavishankar K. Iyer is George and Ann Fisher Distinguished Professor of Engineering at the University of Illinois at Urbana-Champaign. He holds joint appointments in the Departments of Electrical and Computer Engineering and Computer Science, in the Coordinated Science Laboratory (CSL), the National Center for Supercomputing Applications, the Carle Illinois College of Medicine, and the Carl R. Woese Institute for Genomic Biology. He is also faculty Research Affiliate at the Mayo Clinic, and Yeoh Ghin Seng Distinguished Visiting Professor of the National University Health System, Singapore.Professor Iyer leads the DEPEND Group at CSL, with a multidisciplinary focus on systems and software that combine deep measurement driven analytics and machine learning with applications in two important domains: i) trust (that spans resilience and the security of critical infrastructures) and ii) health (that spans computational genomics and health analytics focused on personalized medicine). The Depend Group has developed a rich AI analytics framework that has been deployed on real-world applications in collaborations with industry, health providers, and government agencies including NSF, NIH, and DoD. Iyer directs the Illinois/Mayo NSF Center for Computational Biotechnology and Genomic Medicine (CCBGM). Professor Iyer is a Fellow of the American Association for the Advancement of Science (AAAS), the Institute of Electrical and Electronics Engineers (IEEE), and the Association for Computing Machinery (ACM). He has received several awards, including the IEEE Emanuel R. Piore Award, and the 2011 Outstanding Contributions award by the Association of Computing Machinery. Professor Iyer is also the recipient of the degree of Doctor Honoris Causa from Toulouse Sabatier University in France. Academic Positions Founder and Chief Scientist, Armored Computing, Inc. Interim Vice Chancellor for Research, University of Illinois, 2008-2011 Director, Motorola Center for Communication, 2000-2008 Director, Coordinated Science Laboratory, University of Illinois, 2000-2008 Acting Director, Coordinated Science Laboratory, University of Illinois, August 1995-May 1996 Co-Director, Center for Reliable and High-Performance Computing, University of Illinois, 1989-present Co-Director, Illinois Computer Laboratory for Aerospace Systems and Software (ICLASS), National Aeronautics and Space Administration (NASA) Center for Excellence in Aerospace Computing, 1985-1998 Director and Principal Investigator, Multi-University DARPA Project on Design for Dependability, 1994-1998 Associate Professor, Electrical and Computer Engineering, University of Illinois, August 1985-1989 Research Associate Professor, Coordinated Science Laboratory, University of Illinois, August 1985-1989 Associate Professor, Computer Science, University of Illinois, August 1985-1989 Assistant Professor, Electrical and Computer Engineering, University of Illinois, August 1983-August 1985 Research Assistant Professor, Coordinated Science Laboratory, University of Illinois, August 1983-August 1985 Acting Assistant Professor and Research Associate, Department of Electrical Engineering, Stanford University, April 1980-August 1983 Yeoh Ghim Seng Visiting Professor, National University Health System, Singapore, 2017-present Adjunct Professor, School of Computer Science and Engineering, University of New South Wales, 2018-present Faculty, Carle Illinois College of Medicine Faculty Research Affiliate, Mayo Clinic, 2016-present Chief Scientist, Information Trust Institute, 2004-present Carl R. Woese Institute for Genomic Biology, Faculty in Computing Genomes for Reproductive Health Research Theme, 2015-present CyberSecurity Division Faculty Advisor, NCSA, 2015-present Affiliate Faculty, NCSA, 2015-present Research Professor, Coordinated Science Laboratory, University of Illinois, 1989-present Professor, Computer Science, University of Illinois, 1989-present Professor, Electrical and Computer Engineering, University of Illinois, 1989-present George and Ann Fisher Distinguished Professor of Electrical and Computer Engineering, University of Illinois, 1998-present Research Interests Reliable and secure networks and systems, Measurement and modeling, dependability and security validation and benchmarking, data analytics, computing for genomics research, machine learning, artificial intelligence, computer systems, measurement driven analytics and machine learning, AI and health, trustworthiness of AI systems and algorithms. Research Areas Biomedical Imaging, Bioengineering, and Acoustics Cloud computing Machine learning and pattern recognition Networking and distributed computing Power and Energy Systems Reliable and secure systems System modeling and measurement Research Topics Autonomous vehicular technology, UAVs Genomics Healthcare and medical technologies Machine learning Neuro-engineering Books Edited or Co-Edited (Original Editions) R. K. Iyer, M. Morganti, W. K. Fuchs and V. Gligor, Eds., Dependable Computing for Critical Applications 5, Dependable Computing and Fault-Tolerant Systems, vol. 10, IEEE Computer Society Press, 1998. Chapters in Books K. Chung, P. Tang, Z. Zhu, X. Li, Z. T. Kalbarczyk, T. Kesavadas, R. K. Iyer. \"Machine Learning in the Hands of a Malicious Adversary: A Near Future If Not Reality.\" in Game Theory and Machine Learning for Cyber Security. C. A. Kamhoua, C. D. Kiekintveld, F. Fang, Q. Zhu, Eds. Wiley-IEEE Press, 2021. C. Di Martino, Z. Kalbarczyk, R. Iyer, “Measuring the Resiliency of Extreme-Scale Computing Environments,” Principles of Performance and Reliability Modeling and Evaluation: Essays in Honor of Kishor Trivedi on His 70th Birthday, L. Fiondella, A. Puliafito, Eds., Springer International Publishing AG Switzerland, pp. 609–655, 2016. R.K. Iyer, N. Nakka, W. Gu, and Z. Kalbarczyk, \"Fault Injection,\"Encyclopedia of Software Engineering, 2010. K. Pattabiraman, N. Nakka, Z. Kalbarczyk, R. Iyer, \"Discovering Application-Level Insider Attacks Using Symbolic Execution,\" Emerging Challenges for Security, Privacy and Trust, D. Gritzalis. J. Lopez, Eds., Springer, New York, NY, pp. 63-75, 2009. R.K. Iyer, Z. Kalbarczyk and W. Gu, \"Benchmarking the Operating System Against Faults Impacting Operating System Functions,\" Dependability Benchmarking for Computer Systems, K.Kanoun and L. Spainhower, Wiley, 2008. R.K. Iyer, P Dabrowski, N Nakka and Z Kalbarczyk, \"Reconfigurable Tamper-resistant Hardware Support Against Insider Threats: The Trusted ILLIAC Approach,\" Insider Attack and Cyber Security: Beyond the Hacker (Advances in Information Security), S. Stolfo, S. Bellovin, S. Hershkop, A. Keromytis, S. Sinclair and S. Smith, Springer, 2008. R. K. Iyer, \"Measurement-Based Analysis of Networked System Availability,\" Performance Evaluation - Stories and Perspectives, G. Kotsis, Ed., vol. 175 in the series OCG Schriftenreihe, Austrian Computer Society, December 2003. R. K. Iyer, \"Hardware and Software Fault Tolerance,\" Encyclopedia of Electrical Engineering, John Wiley and Sons, 2001. R. K. Iyer, \"Computer Equipment Testing,\" Encyclopedia of Electrical Engineering, John Wiley and Sons, 2001. Selected Articles in Journals Paul M. Arnold, Andrew G. Webb, Ravishankar K. Iyer (2021). Commentary: Smoking is an independent risk factor for 90-day readmission and reoperation following posterior cervical decompression and fusion. Neurosurgery. Krishnakant Saboo, Amirhossein Shamsaddini, Mihir V. Iyer, Chang Hu, Andrew Fagan, Edith A. Gavis, Melanie B. White, Michael Fuchs, Douglas M. Heuman, Masoumeh Sikaroodi, Ravishankar K. Iyer, Patrick M. Gillevet, Jasmohan S. Bajaj (2020). Sex is associated with differences in gut microbial composition and function in hepatic encephalopathy. J Hepatol, S0168-8278(20)30457-8. Hui Lin, Homa Alemzadeh, Zbigniew Kalbarczyk, Ravishankar Iyer. (2019) Challenges and Opportunities in Detection of Safety-Critical Cyber-Physical Attacks.  IEEE Computer. Yogatheesan Varatharajah, Vijay K. Ramanan, Ravishankar Iyer, Prashanthi Vemuri (2019). Predicting Short-term MCI-to-AD Progression Using Imaging, CSF, Genetic Factors, Cognitive Resilience, and Demographics. Scientific Reports, 9, 2235. Ravishankar K. Iyer, Arjun P. Athreya, Liewei Wang, Richard M. Weinshilboum (2019). Artificial Intelligence and Pharmacogenomics; A timely synergy for individualizing medicine. Advances in Molecular Pathology, Volume 2(1), 111-118. Jacob R. Heldenbrand, Saurabh Baheti, Matthew A. Bockol, Travis M. Drucker, Steven N. Hart, Matthew E. Hudson, Ravishankar K. Iyer, Michael T. Kalmbach, Katherine I. Kendig, Eric W. Klee, Nathan R. Mattson, Eric D. Wieben, Mathieu Wiepert, Derek E. Wildman, Liudmila S. Mainzer (2019). Correction to: Recommendations for performance optimizations when using GATK3.8 and GATK4. BMC Bioinformatics, 20(1), 722. Jacob R. Heldenbrand, Saurabh Baheti, Matthew A. Bockol, Travis M. Drucker, Steven N. Hart, Matthew E. Hudson, Ravishankar K. Iyer, Michael Kalmbach, Katherine I Kendig, Eric W. Klee, Nathan R Mattson, Eric D. Wieben, Mathieu Wiepert, Derek E. Wildman, Liudmila S. Mainzer (2019). Recommendations for performance optimizations when using GATK3.8 and GATK4. BMC Bioinformatics, 20(1), 557:1-557:9. Krishnakant V. Saboo, Yogatheesan Varatharajah, Brent M. Berry, Vaclav Kremen, Michael R. Sperling, Kathryn A. Davis, Barbara C. Jobst, Robert E. Gross, Bradley Lega, Sameer A. Sheth, Gregory A. Worrell, Ravishankar K. Iyer, Michal T. Kucewicz (2019). Unsupervised machine-learning classification of electrophysiolog",
  "content_length": 71082,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:07"
}