{
  "name": "Ravi Chugh",
  "homepage": "http://people.cs.uchicago.edu/~rchugh",
  "status": "success",
  "content": "Ravi Chugh Ravi Chugh Home Classes Papers Talks Misc News [Sep/Oct 2025] Our \"CSS Rocks\" tour is making stops at Shonan, UIST, and OOPSLA. [Jul 2025] Ragged Blocks: Rendering Structured Text with Style to appear at UIST 2025. [Feb 2025] Code Style Sheets: CSS for Code to appear at OOPSLA 2025. [Feb 2025] Sam presented the code style sheets project at PLATEAU 2025. [Jan 2025] Our study with creative coding educators and toolmakers to appear at CHI 2025. ... More News ... Currently Teaching None (Autumn 2025) ... More Classes ... Research The overarching theme of my research is to develop Direct Manipulation Programming Systems. I want programming to be more interactive and tangible (like GUIs) and GUIs to be more transparent and powerful (like programming). active projects [Code Style Sheets] Syntax-highlighted, monospaced text is what we know and expect computer programs to look like, but it doesn't have to be that way. Can we richly style programs while retaining the benefits of their underlying textual representation? Can we move seamlessly between different visualizations of the code as tasks and preferences change? [CS 111: Creative Coding] An introductory programming and creative coding course, while studying and experimenting with editor features. older projects [Sketch-n-Sketch] GUIs are great, but the lack of programmability makes it difficult to develop complex and reusable content. Sketch-n-Sketch is a bimodal programming system for interactively creating documents, such as graphic designs and web pages. [Deuce] Text editors are great, but coding involves tedious, error-prone edits that hinder productivity and creativity. Deuce is a structure-aware code editor with direct manipulation interactions for quickly performing programming and refactoring tasks. [Hazel, led by Cyrus Omar @ Michigan] Programming environments are great, but they typically provide little help for incomplete programs. This project develops Semantic Foundations for Hole-Driven Development, allowing programming environments to continuously edit, reason about, and run programs with holes. [Ivy] Visualization editors are great: chart choosers as in Excel are easy to use, shelf builders like Tableau faciliate rapid exploration, and textual specification languages like Vega are expressive and flexible. This project develops a framework for integrating and augmenting the benefits of multiple user interface modalities for visualization. [Dependent JavaScript @ UCSD] Scripting languages include features that frustrate static reasoning, such as extensible objects, dynamically computed keys, loosely coupled recursion, reflection, and dynamic code loading. This project aims to develop type systems to describe idiomatic programs in scripting languages such as JavaScript, Python, and Ruby. [Radar @ UCSD] Defining a dataflow analysis for concurrent programs is complicated by the subtleties of thread interleavings and locking protocols. Radar automatically converts a sequential dataflow analysis to a concurrent one by making use of datarace information from the Relay race detector for C programs. [Staged Information Flow @ UCSD] The prevalence of dynamically loaded code makes program analysis for JavaScript difficult. We present a staged approach to tracking information flow that splits the analysis burden between compile-time and run-time. [Fine @ Microsoft Research] Modern SMT solvers allow refinement type systems to track security and other complex properties, but they become a large part of the compiler's trusted computing base (TCB). Fine incorporates a type-preserving translation to eliminate the solver from the TCB. Fine is a precursor to MSR's F* language. Students Sam Cohen Ph.D. student former postdoctoral advisees Mikaël Mayer CTO @ Tharzen â Amazon Cyrus Omar Assistant Professor @ University of Michigan former graduate student advisees Brian Hempel Tangible Values with Text (Ph.D. 2022) Andrew McNutt Understanding and Enhancing JSON DSL Interfaces for Vis (Ph.D. 2023) Nick Collins Delta Dictionaries (MS 2021) former undergraduate thesis advisees Grace Lu Deuce: Direct Manipulation Source Program Editor (BS 2017) Justin Lubin Forging Smyth: Program Sketching with Live Bidirectional Eval. (BS 2020) Izaak Meckler Mote: Goal-Driven Development and Synthesis for Haskell (BS 2015) Bowen Wang Predicting Haskell Type Signatures from Names (BS/MS 2018) Professional Activities 2026: CHI AC 2025: LIVE PC, HATRA PC 2024: LIVE PC, HATRA PC 2023: VL/HCC PC, HATRA PC 2022: PLDI Sponsorship Co-chair, Bx PC, HATRA PC, SPLASH-E PC 2021: POPL PC, <Pro> PC, Bx PC, PLDI Sponsorship Co-chair, PLDI PC, PLATEAU PC 2020: Bx PC, SYNT Co-chair, FPE PC, SPLASH Local Chair, HATRA PC, LIVE PC 2019: <Pro> PC, Bx PC, PLDI AEC Co-chair, LIVE PC, Onward! PC 2018: PX PC, PLDI AEC Co-chair, ICFP SRC Chair, LIVE Co-organizer, PLATEAU PC 2017: PLDI PC, LIVE PC 2016: POPL SRC, PLDI ERC, ECOOP PC, TFP PC, Midwest PL Summit Co-organizer 2015: POPL PC, PLDI SRC, STOP PC, OOPSLA ERC 2014: PLDI ERC, PLDI AEC, OOPSLA PC 2013: FOOL PC Journal of Functional Programming, Editorial Board, 2020– Associate Professor PL + HCI Director of Undergraduate Studies Computer Science University of Chicago Crerar Library, Room 345 5730 S Ellis Ave Chicago, IL 60637 Fun, Funky, Functional: The Pursuit of Better UserInterfaces for Programming ICFP 2021 Keynote Episode 49, 2020-21 Structured Editingfor Elm* in Elm elm-conf 2018 Sketch-n-Sketch:Interactive SVG Programmingwith Direct Manipulation Strange Loop 2016 CV (Jul 2025) Research Statement (Jun 2020) Teaching Statement (Jun 2020) Co-CV (Jul 2025) © 2007 – 2025 ravichugh.net | stylesheet based on Resolved",
  "content_length": 5682,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:00"
}