{
  "name": "Ravin Balakrishnan",
  "homepage": "http://www.dgp.toronto.edu/~ravin",
  "status": "success",
  "content": "Ravin Balakrishnan Ravin Balakrishnan Professor Department of Computer Science University of Toronto Brief Biography Publications Courses Students & Postdocs Professional Activities email: ravin at dgp.toronto.edu voice: (416) 946-3448 office: Rm BA7204, 40 St. George St, Toronto lab: Dynamic Graphics Project postal mail & courier address: Ravin Balakrishnan Department of Computer Science University of Toronto 40 St. George Street, Room 4283 Toronto, Ontario Canada M5S 2E4 Tel (for courier): 416 978-6025 Brief Biography Ravin Balakrishnan is a Professor at the Department of Computer Science, University of Toronto. He served as the departments chair from 2015-2019. His research interests are in Human Computer Interaction (HCI), Information and Communications Technology for Development, and Interactive Computer Graphics. He is the recipient of an Alfred P. Sloan Research Fellowship, a Canada Research Chair, an Ontario Premier's Research Excellence Award, the Bell University Laboratories Associate Chair in HCI, the Canadian Human Computer Communications Society Achievement Award, multiple best paper type awards at the top conferences in his field, and was inducted into the ACM CHI Academy in 2011. In addition to working with students and colleagues at Toronto, he collaborates with researchers at leading industrial laboratories and universities worldwide, including stints as a visiting researcher at Mitsubishi Electric Research Laboratories (MERL), the University of Paris, INRIA Paris and Lille, Microsoft Researchs Redmond, Beijing, Bangalore and Cambridge labs, and Hewlett Packard Labs Bangalore. He has been a co-founder of several companies commercializing research conducted in his lab, including Bump Technologies (acquired by Google), FindSpace (acquired by Cougar Group), and Conceptualiz. He earned his Ph.D. in Computer Science from the University of Toronto, working with Bill Buxton, while concurrently a part-time researcher at Alias|wavefront (now part of Autodesk). He actively consults for various leading companies as a testifying technical expert on intellectual property matters in multiple countries. Further information, including publications and videos demonstrating some of his research, can be obtained from www.dgp.toronto.edu/~ravin Publications Refereed papers 148. Jiannan Li, Mauricio Sousa, Karthik Mahadevan, Bryan Wang, Paula Akemi Aoyagui, Nicole Yu, Angela Yang, Ravin Balakrishnan, Anthony Tang, Tovi Grossman. (2023). Stargazer: An Interactive Camera Robot for Capturing How-To Videos Based on Subtle Instructor Cues. Proceedings of CHI 2023 the ACM Conference on Human Factors in Computing Systems. 147. Jiannan Li, Maur cio Sousa, Chu Li, Jessie Liu, Yan Chen, Ravin Balakrishnan, Tovi Grossman. (2022). Asteroids: Exploring Swarms of Mini-Telepresence Robots for Physical Skill Demonstration. Proceedings of CHI 2022 the ACM Conference on Human Factors in Computing Systems. 146. Jiannan Li, Jiahe Lyu, Maur cio Sousa, Ravin Balakrishnan, Anthony Tang, Tovi Grossman. (2021). Route Tapestries: Navigating 360 Virtual Tour Videos Using Slit-Scan Visualizations. Proceedings of UIST 2021 the ACM Symposium on User Interface Software and Technology. 145. Jiannan Li, Ravin Balakrishnan, Tovi Grossman. (2020). StarHopper: A Touch Interface for Remote Object-Centric Drone Navigation. Proceedings of Graphics Interface 2020. 144. Laura Di Chen, Ravin Balakrishnan, Tovi Grossman (2020). Disambiguation Techniques for Freehand Object Manipulations in Virtual Reality. Proceedings of IEEE Conference on Virtual Reality and 3D User Interfaces. 143. Laura Di Chen, Dustin Freeman, Ravin Balakrishnan. (2019). Integrating Multimedia Tools to Enrich Interactions in Live Streaming for Language Learning. Proceedings of CHI 2019 the ACM Conference on Human Factors in Computing Systems. 142. Aakar Gupta, Jiushan Yang, Ravin Balakrishnan. (2018). Asterisk and Obelisk: Motion Codes for Passive Tagging. Proceedings of UIST 2018 the ACM Symposium on User Interface Software and Technology. 141. Teng Han, Jiannan Li, Khalad Hasan, Keisuke Nakamura, Randy Gomez, Ravin Balakrishnan, Pourang Irani. (2018). PageFlip: Leveraging page-flipping gestures for efficient command and value selection on smartwatches. Proceedings of CHI 2018 the ACM Conference on Human Factors in Computing Systems. 140. Aakar Gupta, Antony Irudayaraj, Ravin Balakrishnan. (2017). HapticClench: Investigating squeeze sensations using memory alloys. Proceedings of UIST 2017 the ACM Symposium on User Interface Software and Technology. 139. Aakar Gupta, Thomas Pietrzak, Cleon Yau, Nicolas Roussel, Ravin Balakrishnan. (2017). Summon and Select: Rapid interaction with interface controls in mid-air. Proceedings of ISS 2017 the ACM Conference on Interactive Surfaces and Spaces. 138. Rorik Henrikson, Bruno De Araujo, Fanny Chevalier, Karan Singh, Ravin Balakrishnan. (2016). Multi-device storyboards for cinematic narratives in VR. Proceedings of UIST 2016 the ACM Symposium on User Interface Software and Technology. 137. Aakar Gupta, Antony Irudayaraj, Vimal Chandran, Goutham Palaniappan, Khai Truong, Ravin Balakrishnan. (2016). Haptic learning of freehand semaphoric gesture shortcuts. Proceedings of UIST 2016 the ACM Symposium on User Interface Software and Technology. 136. Aakar Gupta, Muhammed Anwar, Ravin Balakrishnan. (2016). Porous interfaces for small screen multitasking using finger identification. Proceedings of UIST 2016 the ACM Symposium on User Interface Software and Technology. 135. Dustin Freeman, Ravin Balakrishnan. (2016). Improv Remix: Mixed-reality video manipulation using whole-body interaction to extend improvised theatre. Proceedings of DIS 2016 The ACM Conference on Designing Interactive Systems. 134. Rorik Henrikson, Bruno De Araujo, Fanny Chevalier, Karan Singh, Ravin Balakrishnan. (2016. Storeoboard: Sketching stereoscopic storyboards. Proceedings of CHI 2016 the ACM Conference on Human Factors in Computing Systems. p. 4587 4598. 133. Aakar Gupta, Ravin Balakrishnan. (2016). DualKey: Miniature screen text entry via finger manipulation. Proceedings of CHI 2016 the ACM Conference on Human Factors in Computing Systems. p. 59-70. CHI 2016 Best Paper Honorable Mention Award 132. Aakar Gupta, Thomas Pietrzak, Nicolas Roussel, Ravin Balakrishnan. (2016). Direct manipulation in tactile displays. Proceedings of CHI 2016 the ACM Conference on Human Factors in Computing Systems. p. 3683 3693. CHI 2016 Best Paper Honorable Mention Award 131. Jian Zhao, R. William Soukoreff, Ravin Balakrishnan. (2015). Exploring and modeling unimanual object manipulation on multi-touch displays. IJHCS: International Journal of Human-Computer Studies, 78(0). p. 68-80. 130. Jian Zhao, R. William Soukoreff, Xiangshi Ren, Ravin Balakrishnan. (2014). A model of scrolling on touch-sensitive displays. IJHCS: International Journal of Human-Computer Studies, 72(12). p. 805-821 129. Dustin Freeman, Stephanie Santosa, Fanny Chevalier, Ravin Balakrishnan, Karan Singh. (2013). LACES: Live authoring through compositing and editing of streaming video. Proceedings of CHI 2014 the ACM Conference on Human Factors in Computing Systems. p. 1207-1216. 128. Jian Zhao, Daniel Wigdor, Ravin Balakrishnan. (2013). TrailMap: Facilitating information seeking in a multi-scale digital map via implicit bookmarking. Proceedings of CHI 2013 the ACM Conference on Human Factors in Computing Systems. p. 3009-3018. 127. Sajad Shirali-Shahreza, Gerald Penn, Ravin Balakrishnan, Yashar Ganjali. (2013). SeeSay and HearSay CAPTCHAs for mobile interaction. Proceedings of CHI 2013 the ACM Conference on Human Factors in Computing Systems. p. 2147-2156. 126. Stephanie Santosa, Fanny Chevalier, Ravin Balakrishnan, Karan Singh. (2013). Direct space-time trajectory control for visual media editing. Proceedings of CHI 2013 the ACM Conference on Human Factors in Computing Systems. p. 1149-1158. CHI 2013 Best Paper Honorable Mention Award 125. Jian Zhao, Christopher Collins, Fanny Chevalier, Ravin Balakrishnan. (2013). Interactive exploration of implicit and explicit relations in faceted datasets. IEEE Transactions on Visualization and Computer Graphics (Proceedings of VAST 2013). p. 2080-2089. 124. Xiaojun Bi, Seok-Hyung Bae, Ravin Balakrishnan. (2013). WallTop: Managing overflowing windows on a large display. Human-Computer Interaction, 29(2). p. 153-203. 123. Chun Yu, Ravin Balakrishnan, Ken Hinckley, Tomer Moscovich, Yuanchun Shi. (2013). Implicit bookmarking: Improving support for revisitation in within-document reading tasks. International Journal of Human Computer Studies, 71(3). p. 303-320. 122. Mohit Jain, Ravin Balakrishnan. (2012). User learning and performance with bezel menus. Proceedings of CHI 2012 the ACM Conference on Human Factors in Computing Systems. p. 2221-2230. 121. Aakar Gupta, William Thies, Edward Cutrell, Ravin Balakrishnan. (2012). mClerk: Enabling mobile crowdsourcing in developing regions. Proceedings of CHI 2012 the ACM Conference on Human Factors in Computing Systems. p. 1843-1852. 120. Navkar Samdaria, Akhil Mathur, Ravin Balakrishnan. (2012). Paying in kind for crowdsourced work in developing regions. Proceedings of the Pervasive 2012 Conference. p. 343-360. 119. Jian Zhao, Fanny Chevalier, Christopher Collins, Ravin Balakrishnan. (2012). Facilitating discourse analysis with interactive visualization. IEEE Transactions on Visualization and Computer Graphics. 18(12). p. 2639-2648. 118. Dustin Freeman, Ravin Balakrishnan. (2011). Tangible actions. Proceedings of ITS 2011 the ACM International Conference on Interactive Tabletops and Surface. p. 87-96. video 117. Yannick Thiel, Karan Singh, Ravin Balakrishnan. (2011). Elasticurves: Exploiting stroke dynamics and inertia for the real-time neatening of sketched 2D curves. Proceedings of UIST 2011 the ACM Symposium on User Interface Software and Technology. p. 383-392. video 116. Jian Zhao, Fanny Chevalier, Emmanuel Pietriga, Ravin Balakrishnan. (2011). E",
  "content_length": 48555,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:05"
}