{
  "name": "Ravinderpal Singh Sandhu",
  "homepage": "http://www.profsandhu.com",
  "status": "success",
  "content": "Prof. Ravi Sandhu Ravi Sandhu University of Texas at San Antonio (UTSA) I retired on Sept 1, 2024 and hold an Emeritus Professor position at UTSA This website will eventually be updated accordingly I am currently enjoying my retirement honeymoon Executive Director and Chief Scientist Institute for Cyber Security (ICS) Director and Lead Principal Investigator NSF Center for Security and Privacy Enhanced Cloud Computing (C-SPECC) Lutcher Brown Endowed Chair in Cyber Security Professor of Computer Science (College of Sciences) ACM CODASPY: Co-Founder and Steering Committee Member ACM SACMAT: Founder and Steering Committee Member Career Highlights Vitae and Career Synopsis 300+ papers (with 100+ co-authors), 50,000++ Google Scholar Citations, 93 h-index, 32 USA patents, 40 PhD graduates, 50+ research grants Two highest cited papers in Access Control: 1.\tRBAC96 paper (click for citation count) 2.\tNIST standard paper (click for citation count) ACM Fellow (2001), IEEE Fellow (2002), AAAS Fellow (2008), National Academy of Inventors Fellow (2021) IEEE Computer Society Technical Achievement Award (2004), ACM SIGSAC Outstanding Contribution Award (2008), ACM SIGSAC Outstanding Innovation Award (2012), IEEE Innovation in Societal Infrastructure Award (2018) NIST/NSA National Computer Security Conference Best Paper Awards (1992 and 1998) Brief Biosketch, Briefer Biosketch, Long vita:  pdf  docx, Short vita (same as long vita without detailed enumeration):  pdf  docx Academic Positions Held University of Texas at San Antonio, 2007 onwards: Executive Director, Institute for Cyber Security and Lutcher Brown Endowed Chair in Cyber Security (Computer Science) George Mason University, 1995-2007: Professor, 1989-1995: Associate Professor, (Information and Software Engineering). Ohio State University, 1983-1989: Assistant Professor, 1982-1983: Instructor (Computer and Information Science). Professional Recognition National Academy of Inventors Fellow, 2020: See UTSA announcement in pdf. IFIP TC 11 Kristian Beckman Award, 2019: In recognition of significant and long-term contribution to the field of information security in research, education and promotion. IEEE Innovation in Societal Infrastructure Award, 2018: For advancing the foundations and practice of information security through creation, development, and technology transfer of role-based access control (RBAC). IFIP WG 11.3 Outstanding Research Award, 2017: For outstanding research contributions to the field of data and applications security and privacy that have had lasting impact. Society for Information Reuse and Integration Fellow, 2014: For contributions to Applications of Reuse to Capability Access Controls and Service to IRI-2013. ACM SIGSAC Outstanding Innovation Award, 2012: For seminal and highly innovative research contributions to the theory and practice of role and usage-based access control. AAAS Fellow, 2008: For distinguished contributions to cyber security, including seminal role-based access control and usage control models, and for professional leadership in research journals and conferences ACM SIGSAC Outstanding Contribution Award, 2008 IEEE Computer Society Technical Achievement Award, 2004: For outstanding and pioneering contributions to information security including innovation of the role-based access control model and usage control IEEE Fellow, 2002: For contributions to the field of information and system security ACM Fellow, 2001: For technical contributions to the field of information and system security, notably access control models and systems, and professional leadership in research journals and conferences University Recognition University of Texas at San Antonio, 2015, Charter member inductee of UTSA's Academy of Distinguished Researchers. University of Texas at San Antonio, 2015, Inductee of UTSA College of Science Academy for Outstanding Teaching Scholars. University of Texas at San Antonio, 2007 onwards: Lutcher Brown Endowed Chair in Cyber Security (Computer Science). George Mason University, 2001: Mitre Corporation award for Outstanding Research. (Information Security). Professional Leadership Editor-in-Chief, IEEE Transactions on Dependable and Secure Computing (TDSC), Jan 1, 2010 to Dec 31, 2013 Founding General Chair and Steering Committee Chair, ACM Conference on Data and Application Security and Privacy (CODASPY), 2010 onwards Founding Editor-in-Chief, ACM Transactions on Information & Systems Security (TISSEC), 1997-2004 Chairman, ACM Special Interest Group on Security Audit and Control (SIGSAC), 1995-2003 Conference Founder: ACM CCS (1993), ACM SACMAT (1995), ACM CODASPY (2011) Security Editor, IEEE Internet Computing, 1998-2004 Conference Steering Committees: ACM CCS (1993-2003 Chair, 2003-2007 Member), ACM SACMAT (1995-2008 Chair), IEEE CSF (1992-2008 Member), ACM CODASPY (2010- Chair) Conference Program Chair: IEEE CSF (1991, 1992), ACM CCS (1993, 1994, 2002), ACM SACMAT (1995), ACSAC (1996), IFIP WG 11.3 (1996), ACM CSAW (2007), ACM AsiaCCS (2011), NSS (2013) Conference General Chair: IEEE CSF (1993, 1994), ACM CCS (1996), ACM SACMAT (2001, 2002), ACM CODASPY (2011, 2012, 2013) Teacher and Educator Teach highly popular courses on cyber security topics at advanced graduate level at University of Texas at San Antonio. Chief architect and highly-regarded teacher of graduate curriculum in Information Assurance and Security at George Mason University, including MS and PhD degrees, 1989-2007 Invited lectures etcetera presented all over the world Entrepreneur and Consultant TriCipher, 2000-2010, Chief Scientist and Co-Founder, Acquired by VMWare in 2010 Consultant to numerous organizations including: McAfee, Trusted Information Systems, National Institute of Standards and Technology, Verizon, SETA Corporation, Argonne National Laboratory, Singapore Management University, Northrop Grumman, Integris Health Education PhD in Computer Science, Rutgers University, 1983 MS in Computer Science, Rutgers University, 1980 MTech in Computer Technology, IIT Delhi, 1976 BTech in Electrical Engineering, IIT Bombay, 1974 Personal US Citizen since 1997.  Born in India.  Schooled at Doon School.  Married with two sons. Fond of travel, diverse cultures and Bridge. Avid spectator of sports and current affairs.",
  "content_length": 6288,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:05"
}