{
  "name": "Ravi Mangal",
  "homepage": "https://ravimangal.github.io",
  "status": "success",
  "content": "Ravi Mangal I am an assistant professor in the Department of Computer Science at Colorado State University. I was a post-doctoral researcher in CMU Cylab hosted by Dr. Corina Pasareanu and graduated with a PhD from the School of Computer Science at Georgia Tech. [CSB 372] [ravi.mangal@colostate.edu] [CV] [Google Scholar] Research Interests: I am interested in analyzing the safety and security of software systems using formal methods. I focus on evaluating and improving the trustworthiness, i.e., safety, security, and interpretability, of AI-enabled systems such as coding assistants and robots. Read my (slightly outdated) research statement for more details. Prospective Students: I am always open to interacting and supervising students who are interested in or curious about topics related to my research. Feel free to send me an email outlining your interests or drop by my office! Teaching: CS 580B1: Trustworthy Machine Learning (Fall 2024) CS 454: Principles of Programming Languages (Spring 2025) Students: Ronaldo Canizales (PhD) William Scarbro (PhD; Co-advised with Sanjay Rajopadhye) Harshit Singh (MS) Md Abdul Hannan (MS) Hasan Najib Mahmud (MS) Davis Davalos-DeLosh (Student Researcher) Papers: (* indicates equal contribution, (#) indicates alphabetical ordering) On Selecting Few-Shot Examples for LLM-based Code Vulnerability Detection Md Abdul Hannan*, Ronghao Ni*, Chi Zhang, Limin Jia, Ravi Mangal, Corina Pasareanu Preprint, 2025 When “Correct” Is Not Safe: Can We Trust Functionally Correct Patches Generated by Code Agents? Yibo Peng*, James Song*, Lei Li*, Xinyu Yang, Mihai Christodorescu, Ravi Mangal, Corina Pasareanu, Haizhong Zheng, Beidi Chen Preprint, 2025 A Mixture of Linear Corrections Generates Secure Code Weichen Yu, Ravi Mangal, Terry Yue Zhuo, Matt Fredrikson, Corina Pasareanu Preprint, 2025 Conformal Safety Shielding for Imperfect-Perception Agents William Scarbro*, Calum Imrie*, Sinem Getir Yaman, Kavan Fatehi, Corina Pasarenu, Radu Calinescu, Ravi Mangal International Conference on Runtime Verification (RV), 2025 Scenario-based Compositional Verification of Autonomous Systems with Neural Perception Christopher Watson, Rajeev Alur, Divya Gopinath, Ravi Mangal, Corina Pasareanu 8th International Symposium on AI Verification (SAIV), 2025 (Co-located with CAV 2025) Validating Mechanistic Interpretations: An Axiomatic Approach Nils Palumbo, Ravi Mangal, Zifan Wang, Saranya Vijayakumar, Corina Pasareanu, Somesh Jha 42nd International Conference on Machine Learning (ICML), 2025 Monitoring Safety Properties for Autonomous Driving Systems with Vision-Language Models Felipe Toledo, Sebastian Elbaum, Divya Gopinath, Ramneet Kaur, Ravi Mangal, Corina Pasareanu, Anirban Roy, Susmit Jha Engineering Reliable Autonomous Systems (ERAS), 2025 Debugging and Runtime Analysis of Neural Networks with VLMs (A Case Study) Boyue Caroline Hu, Divya Gopinath, Ravi Mangal, Nina Narodytska, Susmit Jha, Corina Pasareanu 4th International Conference on AI Engineering – Software Engineering for AI (CAIN), 2025 (Co-located with ICSE 2025) Distinguished Paper Award Candidate Formal Verification Techniques for Vision-based Autonomous Systems – A Survey Sayan Mitra, Corina Pasareanu, Pavithra Prabhakar, Sanjit A. Seshia, Ravi Mangal, Yangge Li, Christopher Watson, Divya Gopinath, Huafeng Yu Principles of Verification: Cycling the Probabilistic Landscape: Essays Dedicated to Joost-Pieter Katoen on the Occasion of His 60th Birthday, Part III, 2024 Attacks and Defenses for Large Language Models on Coding Tasks Chi Zhang, Zifan Wang, Ruoshi Zhao, Ravi Mangal, Matt Fredrikson, Limin Jia, Corina Pasareanu NIER track of the 39th IEEE/ACM International Conference on Automated Software Engineering (ASE-NIER), 2024 Concept-based Analysis of Neural Networks via Vision-Language Models Ravi Mangal, Nina Narodytska, Divya Gopinath, Boyue Caroline Hu, Anirban Roy, Susmit Jha, Corina Pasareanu 7th International Symposium on AI Verification (SAIV), 2024 (Co-located with CAV 2024) Controller Synthesis for Autonomous Systems with Deep-Learning Perception Components (#) Radu Calinescu, Calum Imrie, Ravi Mangal, Genaina Nunes Rodrigues, Corina Pasareanu, Misael Alpizar Santana, and Gricel Vazquez IEEE Transactions on Software Engineering (TSE), 2024 Is Certifying Lp Robustness Still Worthwhile? Ravi Mangal*, Klas Leino*, Zifan Wang*, Kai Hu*, Weicheng Yu, Corina Pasareanu, Matt Fredrikson, Anupam Datta Preprint, 2023 Assumption Generation for Learning-Enabled Autonomous Systems Corina Pasareanu, Ravi Mangal, Divya Gopinath, and Huafeng Yu International Conference on Runtime Verification (RV), 2023 Closed-loop Analysis of Vision-based Autonomous Systems: A Case Study Corina Pasareanu, Ravi Mangal, Divya Gopinath, Sinem Getir Yaman, Calum Imrie, Radu Calinescu, and Huafeng Yu International Conference on Computer Aided Verification (CAV), 2023 On the Perils of Cascading Robust Classifiers Ravi Mangal*, Zifan Wang*, Chi Zhang*, Klas Leino, Corina Pasareanu, and Matt Fredrikson International Conference on Learning Representations (ICLR), 2023 [code] Feature-Guided Analysis of Neural Networks (#) Divya Gopinath, Luca Lungeanu, Ravi Mangal, Corina Pasareanu, Siqi Xie, and Huafeng Yu Fundamental Approaches to Software Engineering (FASE), 2023 Degradation Attacks on Certifiably Robust Neural Networks Klas Leino*, Chi Zhang*, Ravi Mangal*, Matt Fredrikson, Bryan Parno, and Corina Pasareanu Transactions on Machine Learning Reasearch (TMLR), 2022 [code] Self-Correcting Neural Networks For Safe Classification Klas Leino, Aymeric Fromherz, Ravi Mangal, Matt Fredrikson, Bryan Parno, and Corina Pasareanu Workshop on Formal Methods for ML-Enabled Autonomous Systems (FoMLAS), 2022 (Co-located with CAV 2022) [code] A Cascade of Checkers for Run-time Certification of Local Robustness Ravi Mangal and Corina Pasareanu Workshop on Formal Methods for ML-Enabled Autonomous Systems (FoMLAS), 2022 (Co-located with CAV 2022) [code] Reasoning About Programs in Statistically Modeled First-Order Environments Ravi Mangal Dissertation, 2020 Observational Abstract Interpreters Ravi Mangal Preprint, 2020 Probabilistic Lipschitz Analysis of Neural Networks Ravi Mangal, Kartik Sarangmath, Aditya V. Nori, and Alex Orso Static Analysis Symposium (SAS), 2020 [code] Robustness of Neural Networks: A Probabilistic and Practical Perspective Ravi Mangal, Aditya V. Nori, and Alex Orso NIER track of the 41st IEEE and ACM SIGSOFT International Conference on Software Engineering (ICSE-NIER), 2019 [slides] Checking Probabilistic Properties of Neural Networks via Symbolic Methods and Sampling Ravi Mangal, Aditya V. Nori, and Alessandro Orso First ICSE Workshop on Testing for Deep Learning and Deep Learning for Testing (DeepTest), 2019 (Co-located with ICSE 2019) [slides] On Optimally Combining Static and Dynamic Analyses For Intensional Program Properties Ravi Mangal, David Devecsery, and Alessandro Orso The Southeast Regional Programming Languages Seminar (SERPL), 2019 [slides] Accelerating Program Analyses by Cross-Program Training Sulekha Kulkarni, Ravi Mangal, Xin Zhang, and Mayur Naik ACM Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), 2016 [slides] Scaling Relational Inference using Proofs and Refutations Ravi Mangal, Xin Zhang, Aditya Kamath, Aditya V. Nori, and Mayur Naik AAAI Conference on Artificial Intelligence (AAAI), 2016 [poster] Query-guided Maximum Satisfiability Xin Zhang, Ravi Mangal, Aditya V. Nori, and Mayur Naik Principles of Programming Languages (POPL), 2016 [slides] Volt: A Lazy Grounding Framework for Solving Very Large MaxSAT Instances Ravi Mangal, Xin Zhang, Aditya V. Nori, and Mayur Naik International Conference on Theory and Applications of Satisfiability Testing (SAT), 2015 [slides] A User-Guided Approach to Program Analysis Ravi Mangal, Xin Zhang, Aditya V. Nori, and Mayur Naik ACM Symposium on Foundations of Software Engineering (FSE), 2015 ACM SIGSOFT Distinguished Paper Award [slides] Solving Weighted Constraints with Applications to Program Analysis Ravi Mangal, Xin Zhang, Mayur Naik, and Aditya V. Nori SCS Technical Report, GT-CS-15-03, Georgia Institute of Technology, February, 2015 On Abstraction Refinement for Program Analyses in Datalog Xin Zhang, Ravi Mangal, Radu Grigore, Mayur Naik, and Hongseok Yang ACM Conference on Programming Language Design and Implementation (PLDI), 2014 Distinguished Paper Award [long version]  [slides] Hybrid Top-Down and Bottom-Up Interprocedural Analysis Xin Zhang, Ravi Mangal, Mayur Naik, and Hongseok Yang ACM Conference on Programming Language Design and Implementation (PLDI), 2014 [long version]  [slides] A Correspondence between Two Approaches to Interprocedural Analysis in the Presence of Join Ravi Mangal, Mayur Naik, and Hongseok Yang European Symposium on Programming (ESOP), 2014 Best Paper Award Nominee [long version]  [slides]",
  "content_length": 8928,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:01"
}