{
  "name": "Rawan Alghofaili",
  "homepage": "https://rawanmg.com",
  "status": "success",
  "content": "Rawan Alghofaili Rawan Alghofaili Office: ECSS 4.704 · University of Texas at Dallas · rawan(at)utdallas(dot)edu Link to my Google Scholar Link to my ResearchGate Link to my LinkedIn Link to my Github I graduated in August 2022 with a PhD from the Department of Computer Science at George Mason University where I received the Distinguished Academic Achievement Award. During my PhD, I worked under the mentorship of Professor Lap-Fai (Craig) Yu, exploring the design of context-aware AR/VR/MR system interactions. In the Summer of 2020, I interned at Adobe’s Creative Intelligence Lab under the mentorship of Cuong Nguyen, Vojtěch Krs, Nathan Carr and Radomír Měch. I was also a research intern in the Summer and Fall of 2021 at Meta Reality Labs working under the mentorship of Ben Lafreniere. Prior to venturing into the world of PhD life, I received an MEng. (Master's of Engineering) in Computer Science from Cornell University and an MS (Master's of Science) from the University of Massachusetts-Boston. Research interests: Computational Design, Virtual Reality, Augmented Reality, Mixed Reality, Graphics, Vision, Machine Learning and HCI. I joined CS@UT Dallas as a tenure-track Assistant Professor in Fall 2023! I'm looking for well-motivated students who are excited about research in AR/VR/MR and HCI. If you're interested, please e-mail me your C.V. and transcripts. Publications Minyoung Kim, Rawan Alghofaili, Changyang Li, Lap-Fai Yu Dragon’s Path: Synthesizing User-Centered Flying Creature Animation Paths for Outdoor Augmented Reality Experiences. Conference Paper, (SIGGRAPH 2024) Featured in ABC News Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Rawan Alghofaili, Naveen Sendhilnathan, Ting Zhang, Tovi Grossman, Michael Glueck, Tanya R. Jonker, Ben Lafreniere Interactive Mediation Techniques for Error-Aware Gesture Input Systems. Proceedings of Graphics Interface (GI 2024) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Liuchuan Yu, Huining Feng, Rawan Alghofaili, Boyoung Byun, Tiffany O'Neal, Swati Rampalli, Yoosun Chung, Vivian Genaro Motti, Lap-Fai Yu HoloAAC: A Mixed Reality AAC Application for People with Expressive Language Difficulties. International Conference on Human-Computer Interaction (HCII 2024) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Rawan Alghofaili, Cuong Nguyen, Vojtěch Krs, Nathan Carr, Radomír Měch, Lap-Fai Yu Warpy: Contextual and Multi-view Indirect 3D Curve Sketching in Augmented Reality. IEEE Virtual Reality (VR 2023) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Wei Liang, Luhui Wang, Xinzhe Yu, Changyang Li, Rawan Alghofaili, Yining Lang, Lap-Fai Yu Optimizing Product Placement for Virtual Stores. IEEE Virtual Reality (VR 2023) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Rawan Alghofaili, Matthew Fisher, Richard Zhang, Michal Lukáč, Lap-Fai Yu Exploring Sketch-based Character Design Guided by Automatic Colorization. Proceedings of Graphics Interface (GI 2021) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Biao Xie, Huimin Liu, Rawan Alghofaili, Yongqi Zhang, Yeling Jiang, Flavio Destri Lobo, Changyang Li, Wanwan Li, Haikun Huang, Mesut Akdere, Christos Mousas, Lap-Fai Yu A Review on Virtual Reality Skill Training Applications. Frontiers in Virtual Reality, 2021 Link to paper pdf Link to BibTex Link to paper pdf Link to BibTex Wei Liang, Xinzhe Yu, Rawan Alghofaili, Yining Lang, Lap-Fai Yu Scene-Aware Behavior Synthesis for Virtual Pets in Mixed Reality. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2021) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Rawan Alghofaili, Michael Solah, Haikun Huang, Yasuhito Sawahata, Marc Pomplun, Lap-Fai Yu Optimizing Visual Element Placement via Visual Attention Analysis. IEEE Virtual Reality (VR 2019) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Rawan Alghofaili, Yasuhito Sawahata, Haikun Huang, Hsueh-Cheng Wang, Takaaki Shiratori, Lap-Fai Yu Lost in Style: Gaze-driven Adaptive Aid for VR Navigation. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2019) Link to project webpage Link to paper pdf Link to video Link to BibTex Link to project webpage Link to paper pdf Link to video Link to BibTex Academic Services Program Committee: ACM SIGGRAPH / Eurographics Symposium on Computer Animation (SCA) (2023) IEEE MetaCom (2023) CHI Late-Breaking Work (LBW) (2023) ETRA short papers (2023) IEEE MetaCom (2023) ACHI (2020) Associate Chair: CHI PLAY Work-In-Progress (WiP) (2022) ETRA short papers (2021) Reviewer: CHI (2020-2023) UIST (2023) IEEE VR journal track (2020-2023) IEEE VR conference track (2020, 2022) VRST (2020-2021) TOG (2023) TVCG (2023) CHI PLAY (2020) CASA (2019) CAVW journal (2019) Student Volunteer: SIGGRAPH (2020) Workshops: TraingingXR@IEEE VR: Workshop on 3D Content Creation for Simulated Training in eXtended Reality (2020) Invited Talks: MAGFest (2023) T-Mobile Advanced and Emerging Technologies (2022) NHK Science & Technology Research Laboratories (2019) Interests Apart from doing research. In my spare time I enjoy: hiking, yoga, cooking, knitting and exploring the local rock scene. When at home, I like to pester my cat Ada Lovelace.",
  "content_length": 5922,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:06"
}