{
  "name": "Rayid Ghani",
  "homepage": "http://www.rayidghani.com",
  "status": "success",
  "content": "Home - Rayid Ghani Skip to content FacebookXLinkedIn Homerayidghani2025-09-12T15:20:18+00:00 Rayid Ghani Machine Learning Department and Heinz College of Information Systems and Public Policy Office: Gates Hillman 8023 Email: rayid at cmu dot edu [Short Bio] [Longer CV] [Personal Github][DSSG Group Github] for Course Materials, Tutorials, and Source Code for Projects. I am a Professor in the Machine Learning Department (within the School of Computer Science) and the Heinz College of Information Systems and Public Policy at Carnegie Mellon University, and lead the Data Science and Public Policy Lab as well as the Data Science for Social Good Program. I’m also the co-lead of the Responsible AI Initiative at CMU. I work on developing and using Machine Learning, AI, and Data Science methods for solving high-impact social good and public policy problems with a deliberate focus on fairness and equity across human services, public health and healthcare, criminal justice, education, energy, transportation, economic development, workforce development, and public safety. My work includes collaborative projects with government agencies and NGOs, as well as research in areas such as explainability, bias/fairness/equity, I develop and teach experiential education and training programs for students and professionals in governments, non-profits, and industry. I also started (at the University of Chicago) and run the Data Science for Social Good Summer Fellowship (now running at CMU). AI Governance & Regulation: See my testimony to the United States Senate Committee on Homeland Security and Governmental Affairs Hearing on “Governing AI Through Acquisition and Procurement” and my congressional testimony to the Task Force on AI on ways to reduce AI bias in Financial Services to get an idea of my views in this space. Areas of Interest and Experience: Machine Learning/Data Science/Artificial Intelligence, Human-AI Collaboration, AI Evaluation, Public Policy, Social Good, Ethics, Fairness, Social Justice and Equity Policy/Societal Areas: Human Services, Public Health and Healthcare, Criminal Justice, Housing, Economic Development, Workforce Development, Transportation, Environment and Sustainability Recently (and reluctantly) added buzzwords: Artificial Intelligence, Data Science, and Big Data (not so recently) Older buzzwords that are trendy now: Machine Learning Not so old buzzwords that are not trendy now: Data Mining, Analytics What I used to do: Founder/Director of the Center for Data Science and Public Policy, Research Associate Professor in the Department of Computer Science, and a Senior Fellow at the Harris School of Public Policy at the University of Chicago. Chief Scientist at Obama for America 2012 campaign focusing on analytics, technology, and data. Senior Research Scientist and Director of Analytics research at Accenture Labs where I led a technology research team focused on applied R&D in analytics, machine learning, and data mining for large-scale & emerging business problems in various industries including healthcare, retail & CPG, manufacturing, intelligence, and financial services. In my ample free time, I advise several analytics start-ups and non-profits, speak at, organize, and participate in academic and industry analytics conferences, and publish in Machine Learning, AI, Data Science, and Public Policy conferences and journals. CVRecent Talks and Events Berkeley Tech and Law Symposium Panel on AI and criminal justice  – September 2025 Public Policy Seminar Panel on AI and Ethics – September 2025 AI Policy in Africa – Panel at Deep Learning Indaba – August 2025 National Association of Attorneys General  – Panel and Talk on AI in the Public Sector: Trends, Truths, and Tomorrow – June 2025 Ethics in AI: Principles and Practices for Healthcare. Panel at American Medical Informatics Association Informatics Summit  – March 2025 Trust and AI – Fireside chat at Human(X) – March 2025 Data Science for Social Good Scopeathon – Feb 2025 Research I broadly work on developing and using Machine Learning, Data Science, and AI to help tackle social and policy problems as well as on Responsible AI efforts for governance, policy, and regulation. My current research is focused on issues that come from the question “How do we design, build, deploy, and evaluate AI-Human collaborative systems for social and policy problems that can reliably help achieve fair and equitable outcomes?” and consists of three pillars: 1. Building AI systems designed to explicitly collaborate with humans to help them make better decisions (for social and policy problems) How do we use HCI and design approaches to build these systems? How do we augment the typical “prediction scores” with additional information that helps human users make better decisions? How do we make AI systems interpretable and explainable to users to help them improve their decision-making? How do we elicit and incorporate human feedback? 2. Designing them to deliberately support fair and equitable social outcomes. My work is focused on embedding fairness and equity in the entire process of scoping, formulating, designing, developing, validating, and deploying AI systems. This includes developing methods for eliciting fairness values from different stakeholders, auditing AI systems for bias and fairness, designing them to be fair, and reducing bias. 3. Designing and evaluating these systems to be reliable, robust and resilient to changing environments and policies How do we explicitly build these systems to match their use and deployment settings? What is the appropriate model selection and validation methodology to make them robust to changes over time? How do we make them resilient to gaming? How do we create transparency and trust for different stakeholders including those who will be impacted by the system? The work in my group is across three types of activities: Collaborative Applied Projects: with governments, non profits, and industry to solve problems in policy and social good Training: students and professionals in governments and non profits in the use of data driven methods (Machine Learning, AI, Data Science) for policy and social good Research, Tools, and Methodology Development: to develop new methods and tools that are needed across policy areas with special emphasis on increasing fairness, reducing bias, making machine learning/AI algorithms and models more understandable and transparent. Our areas of interest span health, criminal justice, education, public safety, workforce development, sustainability, transportation, social services, and economic development and we work closely with government agencies (local, federal, international) and NGOs. Historically, my research has spanned from general machine learning and data science to privacy preserving data analysis, text analysis, semi-supervised learning, active learning, information retrieval, Natural Language Processing, and knowledge management. Most of my work has focused on developing and using machine learning & data mining approaches to solve large-scale problems in corporate, political, and non-profit areas. My current interests lie at the intersection of Machine Learning, Public Policy, and Social Sciences. I’m interested in solving large-scale and high impact social problems using data driven and evidence based methods. A lot of government, civic, and non-profit organizations are realizing the value of better data and have been focusing on improving data collection and data standardization. My goal is to build on these efforts, and work with these organizations to use this data to help improve outcomes in a fair and equitable manner. My work involves developing and using machine learning and social science methods that can be operationalized to solve policy and social challenges across health, criminal justice, education, public safety, social services, and economic development. If you’re interested in working with me, I’m currently working on the following types of research problems: Machine Learning methods specifically targeted at the needs of social good and public policy problems. Challenges in building, validating, and deploying Machine learning/AI based systems Building explainable and interpretable models for use in human in the loop systems. Dealing with defining, detecting, reducing, and mitigating bias and increasing fairness to create AI systems that result in equitable outcomes. Recent Publications Aequitas Flow: Streamlining Fair ML Experimentation  in Journal of Machine Learning Research 2024 Beyond Implicit Bias – from a National Academies of Sciences, Engineering, and Medicine Workshop on the Science of Implicit Bias On the Importance of Application-Grounded Experimental Design for Evaluating Explainable ML Methods in AAAI 2024 Preventing Eviction-Caused Homelessness through ML-Informed Distribution of Rental Assistance in AAAI 2024 Explainable machine learning for public policy: Use cases, gaps, and research directions in Data & Policy Empirical observation of negligible fairness–accuracy trade-offs in machine learning for public policy in Nature Machine Intelligence Projects, Programs, Tools rayidghani2020-03-11T01:03:22+00:00 Data Science for Social Good Summer FellowshipFull-time summer program to train aspiring data scientists to work on machine learning, data science, and AI projects with social impact in a fair and equitable manner. Working closely with governments and nonprofits, fellows take on real-world problems in education, health, criminal justice, sustainability, public safety, workforce development, human services, transportation, economic development, international development, and more.rayidghani2020-03-11T01:03:54+00:00 TriageAn open source machine learning toolkit to help data scientists, machine learning developers, and analysts quickly prototype, build and evaluate end-to-end predictive risk modeling systems for public policy and social good problems.rayidghani2",
  "content_length": 24474,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:11"
}