{
  "name": "Raymond Kwok-Kay Wong",
  "homepage": "http://www.cse.unsw.edu.au/~wong",
  "status": "success",
  "content": "Dr. Raymond Wong Raymond Wong Role I am the Director of Online Education and an Associate Professor at the School of Computer Science & Engineering, UNSW. Biography During 2006-2010, I worked at NICTA (now Data61) and was collaborating with them until 2018. I was involved in its spin-out company Cohesive Data Inc. I received my BSc from ANU, MPhil and PhD from HKUST. I held the Sir Edward Youde Graduate Fellowship. After my PhD, I was a postdoc at Stanford University and visiting scholar at UCLA. Before I joined UNSW in 2000, I worked at the computer science departments of the following universities: HKUST, Chinese University of Hong Kong, Macquarie University, and then University of Sydney. I was a Visiting Professor at Tsinghua University, Beijing, in 2011-2013. Research Areas of interest: Database systems, big data Text processing and analytics, information retrieval Data mining and machine learning Teaching At UNSW, I teach: recently COMP9319 (Web Data Compression and Search) and COMP6714 (Information Retrieval). I used to teach: previously COMP3311 (an undergraduate database course), COMP9311 (a postgraduate database course), and COMP9314 (Next Generation Databases); sometimes COMP9315 (i.e., Database System Implementation) and COMP3900/9900 (the capstone project course for undergraduates and postgraduates); and occasionally COMP3311 (an undergraduate database course). I designed the courses and developed the course content for: COMP3900/9900, COMP9314, COMP9319. Industry Consulting Areas of expertise: Mobile content management Database technologies Text analytics Big data and data mining Graduated Research Students Supervised honours theses: 80+ 6 of them obtained the University Medals Graduated Research Masters (MPhil) student: 5 Graduated PhD students: 28 For Potential Research (Hons/PhD) Students Please email me (wong at cse.unsw.edu.au). Last modified by Raymond Wong 25/07/2020.",
  "content_length": 1921,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:11"
}