{
  "name": "Raymond Chi-Wing Wong",
  "homepage": "http://www.cse.ust.hk/~raywong",
  "status": "success",
  "content": "Raymond Chi-Wing Wong (Raymond Wong), HKUST CSE --> MENU Biography Research Experience Teaching Experience Mentoring Experience Student Award Publication - Book - Conference - Journal Academic Activity Invited Talk Research Statement Contact Raymond Chi-Wing Wong Professor Department of Computer Science and Engineering (CSE) the Hong Kong University of Science and Technology (HKUST) Associate Head of Department of Computer Science and Engineering (CSE) Director of Undergraduate Research Opportunities Program (UROP) Office: Rm 3541 (Lift 25/26) (Academic Building), The Hong Kong University of Science and Technology Clear Water Bay, Kowloon, Hong Kong Email: Tel: (852) 2358 6982 Fax: (852) 2358 1477 Biography | Research Experience | Teaching Experience | Mentoring Experience | Award | Publication | Academic Activity | Invited Talk | Research Statement Biography Raymond Chi-Wing Wong is a Professor in Computer Science and Engineering (CSE) of The Hong Kong University of Science and Technology (HKUST). He is currently the associate head of Department of Computer Science and Engineering (CSE) and the director of Undergraduate Research Opportunities Program (UROP). He was the associate director of the Data Science & Technology (DSCT) program (from 2019 to 2021), the director of the Risk Management and Business Intelligence (RMBI) program (from 2017 to 2019), the director of the Computer Engineering (CPEG) program (from 2014 to 2016) and the associate director of the Computer Engineering (CPEG) program (from 2012 to 2014). He received the BSc, MPhil and PhD degrees in Computer Science and Engineering in the Chinese University of Hong Kong (CUHK) in 2002, 2004 and 2008, respectively. In 2004-2005, he worked as a research and development assistant under an R&D project funded by ITF and a local industrial company called Lifewood. From May 2006 to Aug 2006, he was a visiting student of Prof. Jian Pei and Prof. Ke Wang, at Simon Fraser University in Canada. From Aug 2007 to Sept 2007, he visited IBM T.J. Watson Research Center as a summer intern under the supervision of Prof. Philip S. Yu. From Jun 2008 to Jul 2008, he visited Prof. Tamer Ozsu at University of Waterloo as a visiting scholar. Some of his collaborators are Prof. Ada Fu (2003-2013), Prof. Ke Wang (2003-2013), Prof. Philip S. Yu (2009-2013), Prof. Jian Pei (2006-2011), Prof. Tamer Ozsu (2009-2011), Prof. Jiuyong Li (2006-2011), Prof. Yufei Tao (2007-2009), Prof. Ihab Ilyas (2009), Prof. Jeffrey Yu (2009),Prof. Lei Chen (2008) and Prof. Eamonn Keogh (2008). Research Experience He received 43 awards. He published 135 conference papers (e.g., SIGMOD, SIGKDD, VLDB, ICDE and ICDM), 50 journal/chapter papers (e.g., TODS, DAMI, TKDE, VLDB journal and TKDD) and 1 book. He reviewed papers from conferences and journals related to data mining and database, including VLDB conference, SIGMOD, TODS, VLDB Journal, TKDE, TKDD, ICDE, SIGKDD, ICDM, DAMI, DaWaK, PAKDD, EDBT and IJDWM. He is a program committee member of conferences, including SIGMOD, VLDB, ICDE, KDD, ICDM and SDM, and a referee of journals, including TODS, VLDBJ, TKDE, TKDD, DAMI and KAIS. His research interests include database and data mining. The research topics he worked include the following. Spatial Database (published in SIGMOD20, ICDE20, ICDE19, SIGMOD17, VLDB16, VLDB15, SIGMOD14, VLDB14, SIGMOD13, VLDB13, VLDBJ12, TKDE12, SIGMOD11, VLDBJ11, ICDE11, VLDB09, EDBT09, VLDB08, TKDE09, VLDB07 and SIGKDD07) Data Analytics (published in KDD20, ICDE20, ICDM19, SIGMOD19, ICDE19, SIGMOD18, ICDT17) Customer-Centric Data Mining (published in SIGMOD14, ICDE14, ICDM13, TKDE12, ICDE11, ICDE10, VLDB09, TODS09, EDBT09, ICE09, VLDB08, SIGKDD07, DAMI06, SDM05, ICDM05, DAMI05, PAKDD04 and ICDM03) Privacy Preservation (published in TKDD11, DKE11, ICDM10, ICDE10, DASFAA10, SDM10, TODS09, ICDE09, VLDB08, TKDE08, VLDB07, SIGKDD06, ICDM05 and DaWaK06) Social Network (published in InfoSys14, ICDM11 and PAKDD04) Graph Database (published in ICDM19, VLDB17, VLDB14 and VLDB13) Classification (published in ICDM19, SDM14) Music Database (published in ICMC17, ICDE13) Data Warehouse (published in VLDB08, TKDE09 and SIGKDD07) Data Stream (published in DAMI06 and SDM05) Music Composition (published in ICDE12) Association Rule/Frequent Pattern Mining (published in ICDE12, ICDM03, DAMI05 and PAKDD04) Clustering/Outlier (published in TKDE05) Temporal Data/Time Series (published in ICDE12 and VLDBJ08) Wireless Network (published in ICC14 and INFOCOM08) Rate Control over Video Streams (published in ICIP07) Entropy Coding (published in ICASSP07) He also worked in different universities and research centers as follows. Visiting Scholar at University of Waterloo (Jun 2008-Jul 2008) To conduct research with Prof. Tamer Ozsu at University of Waterloo Summer Intern at IBM T.J. Watson Research Center (Aug 2007-Sept 2007) To conduct research with Prof. Philip S. Yu at IBM T.J. Watson Research Center in New York Research Visitor at SFU (Simon Fraser University) (May 2006-Aug 2006) To conduct research with two professors, Prof. Jian Pei and Prof. Ke Wang, at Simon Fraser University in Canada Research Assistant at HKU ETI (E-Business Technology Institute) (May 2005-July 2005) To do the research work on \"Drill Process Monitoring System ?V Drill Depth Calculation\" Research and Development Assistant at CUHK CSE (Computer Science and Engineering) (Aug 2004-April 2005) To do the R&D work with a local company called Lifewood on data mining in industrial funded projects Summer Research Assistant at HKU ETI(E-Business Technology Institute) (July-Aug 2001) To do a research project about e-business and computer security Teaching Experience COMP1942: Exploring and Visualizing Data (Spring 2025) MSBD5002: Data Mining and Knowledge Discovery (Spring 2025) COMP5331: Knowledge Discovery in Databases (Fall 2024) CSIT5210: Data Mining and Knowledge Discovery (Fall 2024) COMP1942: Exploring and Visualizing Data (Spring 2024) MSBD5002: Data Mining and Knowledge Discovery (Spring 2024) COMP5331: Knowledge Discovery in Databases (Fall 2023) CSIT5210: Data Mining and Knowledge Discovery (Fall 2023) CORE1232/COMP1942: Exploring and Visualizing Data (Spring 2023) COMP5331: Knowledge Discovery in Databases (Fall 2022) CSIT5210: Data Mining and Knowledge Discovery (Fall 2022) COMP1942: Exploring and Visualizing Data (Spring 2022) COMP5331: Knowledge Discovery in Databases (Fall 2021) CSIT5210: Data Mining and Knowledge Discovery (Fall 2021) COMP1942: Exploring and Visualizing Data (Spring 2021) MSBD5002: Data Mining and Knowledge Discovery (Spring 2021) COMP5331: Knowledge Discovery in Databases (Fall 2020) CSIT5210: Data Mining and Knowledge Discovery (Fall 2020) DSCT4900: Academic and Professional Development (Fall 2020) COMP1942: Exploring and Visualizing Data (Spring 2020) COMP5331: Knowledge Discovery in Databases (Fall 2019) COMP1942: Exploring and Visualizing Data (Spring 2019) COMP5331: Knowledge Discovery in Databases (Fall 2018) COMP1942: Exploring and Visualizing Data (Spring 2018) COMP4332: Big Data Mining and Management (Spring 2018) RMBI4310: Advanced Data Mining for Risk Management and Business Intelligence (co-listed with COMP 4332) (Spring 2018) COMP5331: Knowledge Discovery in Databases (Fall 2017) COMP1942: Exploring and Visualizing Data (Spring 2017) COMP2711: Discrete Mathematical Tools for Computer Science (Fall 2016) COMP1942: Exploring and Visualizing Data (Spring 2016) COMP1942: Exploring and Visualizing Data (Spring 2015) COMP1942: Exploring and Visualizing Data (Spring 2014) COMP5331: Knowledge Discovery in Databases (Fall 2013) COMP1942: Exploring and Visualizing Data (Spring 2013) COMP5331: Knowledge Discovery in Databases (Fall 2012) COMP1942: Exploring and Visualizing Data (Spring 2012) COMP5331: Knowledge Discovery in Databases (Fall 2011) COMP192: Exploring and Visualizing Data (Spring 2011) COMP537: Knowledge Discovery in Databases (Fall 2010) COMP170: Discrete Mathematical Tools for Computer Science (Spring 2010) COMP231: Database Management Systems (Fall 2009) COMP697J: Independent Studies: Database Management Implementation (Summer 2009) COMP537: Knowledge Discovery in Databases (Spring 2009) Mentoring Experience FYP Advisor (Aug 2009-May 2017) To supervise the FYP (Final Year Project) students to complete the project Finding Shortest Path in UST (Group 1) (Aug 2009-May 2010) Members: Kwan Wang CHOW, Hung Ho LIU, Siu Wing SO, Wai Ying NG Finding Shortest Path in UST (Group 2) (Aug 2009-May 2010) Members: Tat LEE, Ka Hei LAM, Chun Him LO Knowledge Discovery over Popular Songs (Aug 2009-May 2010) Members: Tsz Ho LEE, Ming Lun LI, Robbie Hon Pan WONG Seat Assignment in UST (Group 1) (Aug 2010-May 2011) Members: Po Yi CHEUNG, Hiram Tsz Him CHAN, Kin Shing CHEUK, Kai Shing CHAN Seat Assignment in UST (Group 2) (Aug 2010-May 2011) Members: Kam Yuen MOK, Jeffrey Man Ho FUNG Knowledge Discovery over Chinese Songs (Aug 2010-May 2011) Members: Raymond Ka Wai SZE, Kai Ho WOO, Yan Shing LEUNG, Man Fung LUI Data Mining for Business Applications (Group 1)(Aug 2011- May 2012) Members: Ka Man CHAN, Ka Wing HO, Pui Yan Kitty KWAN, Wai Ming LAM Data Mining for Business Applications (Group 2)\t(Aug 2011- May 2012) Members: Chak Pan HO Restaurant Search (Aug 2011- May 2012) Members: Ka Hang POON, Chun Ho TAM, Ka Wan TSANG, Yan Wai WU Data Mining over Songs (Aug 2012-May 2013) Members: Kai Ho CHAN, Kam Tsun SO, Hoi Yan CHEUK Transforming Audio into Music (Aug 2012-May 2013) Members: Kit Sze WAN, Sze Ho LEUNG, Oi Yan LEUNG, Chui Ling WONG UST Path Advisor Enhancement (Aug 2012-May 2013) Members: Ping Chung KWAN, Kin Long HO, Tsz Him Derek SUNG, Hiu Lam KWOK Hot Bundle for Red Wine Inventory (Aug 2012-May 2013) Members: Winky Hiu Tung CHAN, Candy Shuk Kai KO, Jason King Chung YEUNG Seat Assignment in UST (Aug 2013-May 2014) Members: Kai Shun CHAN, Chun Ho CHAN, Hoi Ting CHAN Knowledge Discovery over English Songs (Aug 2013-May 2014) Members:Richeng HUANG, Bo WANG, ",
  "content_length": 82944,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:08"
}