{
  "name": "Raymond A. Yeh",
  "homepage": "https://www.cs.purdue.edu/people/faculty/rayyeh.html",
  "status": "success",
  "content": "Raymond A Yeh - Department of Computer Science - Purdue University Skip to content Home People Faculty Raymond A Yeh Faculty & Lecturers Staff Offices Raymond A. Yeh Assistant Professor of Computer Science Raymond A. Yeh is an Assistant Professor in the Department of Computer Science at Purdue University. Prior to joining Purdue, he was a Research Assistant Professor at Toyota Technological Institute at Chicago (TTIC). He received his PhD in 2021 from the University of Illinois at Urbana-Champaign (UIUC). Previously, he completed his B.S. and M.S. degree in Electrical Engineering from UIUC as well. He is a recipient of the Google PhD Fellowship, the Mavis Fu… ↓More Joined department: Fall 2022 Research Areas Graphics, Visualization, and Geometric Modeling Robotics and Computer Vision Artificial Intelligence, Machine Learning, and Natural Language Processing Education Ph.D., University of Illinois Urbana-Champaign, Electrical Engineering (2021) Raymond A. Yeh is an Assistant Professor in the Department of Computer Science at Purdue University. Prior to joining Purdue, he was a Research Assistant Professor at Toyota Technological Institute at Chicago (TTIC). He received his PhD in 2021 from the University of Illinois at Urbana-Champaign (UIUC). Previously, he completed his B.S. and M.S. degree in Electrical Engineering from UIUC as well. He is a recipient of the Google PhD Fellowship, the Mavis Future Faculty Fellowship, and the Henry Ford II Scholarship. His research is at the intersection of machine learning and computer vision. Specifically, his research focuses on developing algorithms to learn effective and explainable models ranging across several domains including audio, vision, language, and multi-agent systems. Please refer to his webpage for research projects and Google scholar for full list of publications. Contact Info rayyeh@purdue.edu DSAI 3073 Websites My Homepage Google Scholar dblp",
  "content_length": 1933,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:07"
}