{
  "name": "Raymond Spiteri",
  "homepage": "https://www.cs.usask.ca/faculty/spiteri",
  "status": "success",
  "content": "Raymond J. Spiteri Raymond J. Spiteri I am a Professor at the University of Saskatchewan in the Department of Computer Science. My research is run out of the Numerical Simulation Laboratory. From Sep-Dec, 2013, I am teaching MATH314: Numerical Analysis III (Numerical Solution of Differential Equations) and MATH223 (Intermediate Calculus I for Engineering students). From Jan-Apr, 2014, I am teaching CMPT851: Parallel Programming for Scientific Computing. My subject areas of research expertise are applied mathematics and computer science, in particular algorithms and software for continuous mathematics and scientific computation. I am involved in several projects, many of which span more than one field of application. My core research area focuses on the development of novel numerical methods and software (specifically problem-solving software environments) for nonlinear algebraic equations, ordinary differential equations, and time-discretization methods for partial differential equations, in particular optimal design of implicit-explicit (IMEX) and strong-stability-preserving (SSP) Runge-Kutta time-discretization methods for computational fluid dynamics and differential-algebraic equations. I am also working on projects involving software for high-order variational integrators, simulation of electrical activity in myocardial tissue, fuel cell simulation, fluidized bed gasifier simulation for clean coal technology, and numerical algorithms and software for exascale computer architectures. I often have opportunities for students to join my research group at all levels (undergraduate, Master's, Ph.D., and PDF). Many of these opportunities involve an industrial component to the research. Please feel free to contact me if you wish to enquire about the availability and/or scope of any of these opportunities. I was the leader of the Mprime project Advanced Mathematical Modelling and Simulation of Transport Phenomena. Our industrial partners in this research included the Automotive Fuel Cell Corporation (AFCC), Ballard Power, FourStones Ltd., the Simula Research Lab of Oslo, Norway, Environment Canada, SoilVision, and IBM. I was also the Mitacs / Mprime Regional Scientific Director for the Prairie Provinces (Alberta, Saskatchewan, Manitoba). I am the Director of the Centre for High-Performance Computing in the College of Arts and Science at the University of Saskatchewan. I am also on the Executive Committee of the WestGrid high-performance computing consortium of Compute Canada. For more information about what I do while on the job, check out my research interests or publications. Copies of some of my students' work is also available. Here are the files for an introductory presentation on Matlab: the slides in pdf format, and the matlab code. These are the files that I used at St. Mary's University on Wed. Oct. 30, 2002. Here are some other matlab tutorials. I obtained my Ph. D. from the Department of Mathematics at the University of British Columbia under the direction of Drs. Uri Ascher and Dinesh Pai. At UBC, I was a member of the Institute of Applied Mathematics, which offers interdisciplinary graduate-degree programs to students from many different departments (such as physics, chemistry, computer science, economics, geology, ...) having some form of scientific computation at the heart of their research. Another biographical note: I obtained my B.Sc. degree in Applied Mathematics from the University of Western Ontario in 1990. My advisor was Dr. M.A.H. (Paddy) Nerenberg, after whom the Nerenberg Lecture Series is named. Here is an excerpt from the description, put here is his honour, as a model for the rest of us: The Nerenberg Lecture Series is first and foremost about people and ideas. Knowledge is the true treasure of humanity, accrued and passed down through the generations. Some of it, particularly science and its language, mathematics, is closed in practice to many because of technical barriers that can only be overcome at a high price. These technical barriers form part of the remarkable fractures that have formed in our legacy of knowledge. We are so used to those fractures that they have become almost invisible to us, but they are a source of profound confusion about what is known. The Nerenberg Lecture is named after the late Morton (Paddy) Nerenberg, a much-loved professor and researcher born on 17 March-- hence his nickname. He was a Professor at Western for more than a quarter century, and a founding member of the Department of Applied Mathematics there. A successful researcher and accomplished teacher, he believed in the unity of knowledge, that scientific and mathematical ideas belong to everyone, and that they are of human importance. He regretted that they had become inaccessible to so many, and anticipated serious consequences from it. The series honors his appreciation for the democracy of ideas. He died in 1993 at the age of 57. Other useful and fun links: What every computer scientist should know about floating-point arithmetic, Goldberg, ACM CSUR, 23(1):5-41 (1991) Software Carpentry Why crunch mode does not work Netlib Repository of Numerical Methods Society for Industrial and Applied Mathematics Mathscinet Din il-pagina tezisti wkoll bil-Malti. Please send comments or questions to Ray Spiteri <spiteri@cs.usask.ca> Follow @rjspiteri Last modified: Sat 03 Aug 2013 10:53:35 CST",
  "content_length": 5397,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:11"
}