{
  "name": "Razvan V. Marinescu",
  "homepage": "https://razvanmarinescu.com",
  "status": "success",
  "content": "Razvan Marinescu Search Razvan Marinescu Assistant Professor UC Santa Cruz ramarine at ucsc.edu Prospective PhDs/postdocs/undergrads/masters who want to work with me: see here I am an Assistant Professor in the department of Computer Science and Engineering at UC Santa Cruz. My research focuses on Machine Learning and its applications to Healthcare and Biomolecular systems. I am also the co-founder and CTO of a drug screening start-up, GiwoTech Inc. During my PostDoc in Polina Golland’s lab at MIT, I worked on machine learning algorithms for healthcare applications. I developed generative models for natural images, Chest X-Rays and brain images, which can be used as prior models for image reconstruction tasks, using bayesian posterior optimisation. During my PhD, I developed Bayesian statistical models for prediction of Alzheimer’s disease and related neurodegenerative diseases. Such models were able to not only to estimate the continuous evolution of Alzheimer’s disease, but also discover novel spatial patterns of brain pathology (e.g. DIVE) or transfer such “learned evolutions” in populations with different diseases (e.g. DKT). I further co-organised TADPOLE, an international competition that compared 92 algorithms from 33 teams at predicting the evolution of Alzheimer’s disease. Finally, together with UCL colleagues N. Firth and S. Primativo, I performed one of the first comprehensive clinical studies (Firth et al., Brain, 2019) on the evolution of Posterior Cortical Atrophy, a rare dementia affecting the visual system. On the technical side, I particularly enjoy the mathematics of statistical inference methods for Machine Learning. For example, I derived the EM-update rules for two complex Bayesian models that I proposed (see Supplementary section of the DIVE article and Appendix sections B and D of my PhD thesis). I also have a keen interest in general machine learning and computational intelligence, in order to make computers perform intelligent tasks. Aside from research, at MIT I was also the president of the Postdoctoral Association, working with the MIT administration to create a better research environment for postdocs. You can see a complete list of publications on my Google Scholar page. See my academic job market research statement here. My wife Leilani Gilpin is also a researcher in ML, and does fantastic work on ML Explainability using logical reasoning methods. See her publications here. Interests Machine Learning Generative ML Models Bayesian inference Applications of Machine Learning to Medicine Molecular Biology Molecular Dynamics Entrepreneurship Education PostDoc in Polina Golland's lab MIT CSAIL PhD in Computer Science, 2019 Center for Medical Image Computing, UCL MEng in Computer Science, 2014 Imperial College London BSc in Computer Science, 2013 Imperial College London News May 2025: Prathamesh presented a posted in ISMRM poster on ReMiDi: Microstructure reconstruction using a differentiable MRI simulator. March 2025: Malliavin Calculus can can be applied to AI-based Diffusion Models! Check our two new pre-prints: Malliavin Calculus for Diffusion Models (more applied, contains numerical results) and A Malliavin calculus approach to score functions in diffusion generative models (more theoretical, covering the general case) Oct 2024: New paper at ISMIR on Generative Music in Medicine: https://lapis-rudbeckia-73a.notion.site/Generative-Music-Medicine-1134c5d62d4c80f2a3eee2c50451b416 June 2024: Our lab attended the ML for drug discovery summer school in Montreal, hosted by Valence Labs and MILA. April 2024: Visited 6 universities in India (IIT Kanpour, IIT Delhi, IIT Madras, IIIT Hyderabad, Shiv Nadar and Ashoka) for research collaborations and student recruitment Oct 2023: New paper at MICCAI: InverseSR: 3D Brain MRI Super-Resolution Using a Latent Diffusion Model. Updated code here. Feb 2023: Talk about my research in the UCSC AI club. July 2022: I officially started as an Assistant Professor in the Computer Science and Engineering department at UC Santa Cruz! I am looking to build my lab and hire PhD students and postdocs. Dec 2021: Exciting news! Our Bayesian Image Reconstruction (BRGM) paper got the Best paper award at the NeurIPS Deep Generative Models and Downstream Applications Workshop. Nov 2021: Our Bayesian Image Reconstruction using Deep Generative Models paper has been accepted for an oral presentation at the NeurIPS Deep Generative Models Workshop. See recorded talk and slides. Oct 2021: Our TADPOLE Challenge results paper has been accepted in the MELBA journal. June 2021: New extension to BRGM: sampling of multiple reconstruction through Variational Inference. Updated paper here. Also, new updated code-implementation in PyTorch here, for both Bayesian-MAP and VI inference schemes. January 2021: New pre-print: Bayesian Image Reconstruction using Deep Generative Models (BRGM). I used StyleGAN2 for reconstructing images corrupted by any corruption process. SOTA performance on super-resolution, at low input-resolution, and inpainting. Code and pre-trained models now available on the project page. September 2020: Talk on GANs at the Harvard DBMS Clinical Lecture Series. See video recording and slides. July 2020: Talk at AAIC conference on final results of the TADPOLE Challenge. July 2020: Poster at AAIC conference on BrainPainter. June 2020: Wrote blog post on why generative models are important February 2020: TADPOLE Challenge results paper now on arxiv. We present all participant algorithms and complete analysis of the competition results. September 2019: Three of my papers were accepted at MICCAI 2019! TADPOLE (oral at PRIME workshop): preliminary results of Alzheimer’s prediction challenge BrainPainter (oral at MBIA workshop): a software to generate brain images useful for neuroimaging studies, by e.g. highlighting specific regions according to user input. Disease Knowledge Transfer (poster at main conference): novel method for transferring knowledge across neurodegenerative diseases August 2019: BrainPainter now available straight from the browser: https://brainpainter.csail.mit.edu/ 9-21 June 2019: I will be attending the CVPR and ICML conferences in Long Beach, California. If anyone is around, get in touch! June 2019: Tadpole Challenge Final Results will be announced on Friday 14th June 14:00 BST via YouTube: https://youtu.be/7IFC6zVA-ZE May 2019: Paper describing the brain visualisation software (BrainPainter) uploaded on arXiv. April 2019: Our paper on the progression of Posterior Cortical Atrophy was accepted in Brain! March 2019: Our paper describing DIVE, the spatio-temporal disease progression model, was published in NeuroImage. February 2019: Started postdoc at MIT with Polina Golland working on neroimaging analysis of stroke. January 2019: Defended my PhD thesis at UCL. Stanley Durrleman and Janaina Mourao-Miranda were part of the examining committee. Recent Publications ReMiDi: Reconstruction of Microstructure Using a Differentiable diffusion MRI Simulator Prathamesh Pradeep Khole, Zahra Kais Petiwala, Shri Prathaa Magesh, Ehsan Mirafzali, Utkarsh Gupta, Jing-Rebecca Li, Andrada Ianus, Razvan Marinescu July 2025 Preprint Poster Malliavin Calculus for Diffusion Models Ehsan Mirafzali, Utkarsh Gupta, Patrick Wyrod, Frank Proske, Daniele Venturi, Razvan Marinescu March 2025 Preprint Generative Music Medicine Manolis Nikolakakis, Razvan Marinescu, Emmanouil Karystinaios October 2024 ISMIR Project Estimation of Brain Tissue Probability Maps using a Differentiable MRI Simulator Utkarsh Gupta, Emmanouil Nikolakakis, Moritz Zaiss, Razvan Marinescu July 2024 ICML Differentiate Anything Workshop PDF Code InverseSR: 3D Brain MRI Super-Resolution Using a Latent Diffusion Model Jueqi Wang, Jacob Levman, Walter Hugo Lopez Pinaya, Petru-Daniel Tudosiu, M. Jorge Cardoso, Razvan Marinescu August 2023 MICCAI MBIA Preprint Code Bayesian Image Reconstruction using Deep Generative Models Razvan V Marinescu, Daniel Moyer, Polina Golland December 2021 NeurIPS Workshop on Deep Generative Models and Downstream Applications PDF Code Slides Video TADPOLE Challenge: Results after 1 Year Follow-up Razvan V. Marinescu, Neil P. Oxtoby, Alexandra L. Young, Esther E. Bron, Arthur W. Toga, Michael W. Weiner, Frederik Barkhof, Nick C. Fox, Stefan Klein, Daniel C. Alexander, the EuroPOND Consortium February 2020 arXiv Preprint PDF Code Project Video Disease Knowledge Transfer across Neurodegenerative Diseases Razvan V. Marinescu, Marco Lorenzi, Stefano Blumberg, Alexandra L. Young, Pere P. Morell, Neil P. Oxtoby, Arman Eshaghi, Keir X. Yong, Sebastian J. Crutch, Daniel C. Alexander July 2019 arXiv Preprint PDF Code Project BrainPainter: A software for the visualisation of brain structures, biomarkers and associated pathological processes Razvan V. Marinescu, Arman Eshaghi, Daniel C. Alexander, Polina Golland June 2019 MICCAI MBIA Preprint Code Website PhD thesis: Modelling the Neuroanatomical Progression of Alzheimer's Disease and Posterior Cortical Atrophy Razvan Marinescu April 2019 PhD thesis: Modelling the Neuroanatomical Progression of Alzheimer’s Disease and Posterior Cortical Atrophy PDF Slides See all publications Projects Project’s we’re currently focusing on: Molecular Dynamics, Differentiable simulators, ML Compositionality and Generative Modelling. For prospective students, look at these in particular. AI for Material Science AI and Quantum Simulations for Discovering Novel Materials Simulating a Virtual Cell Simulating a virtual cell using ML-derived coarse-grained potentials ML Compositionality ML Compositionality refers to the idea of building a large ML model from modular and reusable building blocks, just like LEGO. Image Reconstruction Using ML and compressed sensing techniques to improve the quality, speed and cost of medical scans. Generative Modelling Develop models for generation, reconstruction and manipulation of images, text or other high-dimensional data. ML Benchmarks We",
  "content_length": 13999,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:13"
}