{
  "name": "Razvan C. Bunescu",
  "homepage": "https://webpages.uncc.edu/rbunescu",
  "status": "success",
  "content": "Razvan C. Bunescu Razvan C. Bunescu Associate Professor Department of Computer Science @ College of Computing and Informatics University of North Carolina at Charlotte Office: Woodward Hall 410G Phone: (704) 687-8444 Email: razvan.bunescu@charlotte.edu OhioT1DM dataset: temporary instructions on how to obtain the dataset created by The SmartHealth Lab, until server access is restored at Ohio University. Home Research Teaching Students Personal Education Ph.D. in Computer Science, University of Texas at Austin, 2007 M.S. in Computer Science, University Politehnica of Bucharest, 1999 B.S. in Computer Science, University Politehnica of Bucharest, 1998 Research Interests Machine Learning Natural Language Processing Music Information Retrieval Professional Activities Associate Editor for IEEE Transactions on Computers, 2024-25. Program co-chair of the International Summer School on Data Science organized by the Bucharest University of Economic Studies in Predeal, 2018-24. Standing reviewer for Computational Linguistics, 2021-25. Area chair for the NLP Applications track at ACL 2020. Co-chair, with Cindy Marling, of the Blood Glucose Level Prediction Challenge at the ECAI 2020 workshop on Knowledge Discovery in Healthcare Data. Guest editor of the special issue on Sensor Technologies: Artificial Intelligence for Diabetes Management in the journal Sensors, 2020. Area chair for the Applications track at ACL 2019. Co-chair, with Cindy Marling, of the Blood Glucose Level Prediction Challenge at the IJCAI 2018 workshop on Knowledge Discovery in Healthcare Data. Invited talk at University of Akron on Machine Learning Models for Blood Glucose Level Prediction, October 2017. Steven Bethard, Mausam, and I are co-chairs of the ACL-IJCNLP 2015 track on \"Information Extraction and Text Mining\". I was a member of the Senior Program Committee for IJCAI 2013. I was a member of the Senior Program Committee for AAAI 2012, in the area of \"Natural Language Processing\". Alex Yates and I co-chaired the ACL HLT 2011 track on \"Text Mining and Information Extraction\". Michael Raymer and I co-chaired the OCCBIO 2010 session on \"Data Mining and Machine Learning\". Vivi, Rada, Evgeniy and I organized the IJCAI 2009 workshop on \"User Contributed Knowledge and AI: An evolving synergy\". Rada, Evgeniy and I organized the AAAI 2008 workshop on \"Wikipedia and AI: An evolving synergy\". A comprehensive list of publications is available in Google Scholar. Selected publications A Text-Based Recommender System that Leverages Explicit Affective State Preferences Tonmoy Hasan and Razvan Bunescu To appear in Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP), November 2025. An Expectation-Realization Model for Metaphor Detection Oseremen Uduehi and Razvan Bunescu Best paper award at the 4th Workshop on Figurative Language Processing (FigLang), June 2024. Can language models employ the Socratic method? Experiments with code debugging Erfan Al-Hossami, Razvan Bunescu, Justin Smith, Ryan Teehan Proceedings of the 55th ACM Technical Symposium on Computer Science Education (SIGCSE), March 2024. Extended version of Socratic Questioning of Novice Debuggers: A Benchmark Dataset and Preliminary Evaluations Proceedings of the 18th Workshop on Innovative Use of NLP for Building Educational Applications (BEA), July 2023. Topic-Level Bayesian Surprise and Serendipity for Recommender Systems Tonmoy Hasan and Razvan Bunescu Proceedings of the 17th ACM Conference on Recommender Systems (RecSys), September 2023. A semantic parsing pipeline for context-dependent question answering over temporally structured data Charles Chen, Razvan Bunescu and Cindy Marling Natural Language Engineering, October 2021. Extended version of Context-Dependent Semantic Parsing over Temporally Structured Data Proceedings of the 17th Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), June 2019. Changing the Narrative Perspective: From Deictic to Anaphoric Point of View Mika Chen and Razvan Bunescu Information Processing & Management, Special Issue on Creative Language Processing, 2021. LSTMs and Deep Residual Networks for Carbohydrate and Bolus Recommendations in Type 1 Diabetes Management Jeremy Beauchamp, Razvan Bunescu, Cindy Marling, Zhongen Li, Chang Liu Sensors, 2021, 21(9). Special Issue on Sensor Technologies: Artificial Intelligence for Diabetes Management. Hardware-Level Thread Migration to Reduce On-Chip Data Movement via Reinforcement Learning Quintin Fettes, Avinash Karanth, Razvan Bunescu, Ahmed Louri, and Kyle Shiflett IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, September 2020. Learning to Surprise: A Composer-Audience Architecture Razvan Bunescu and Oseremen Uduehi Proceedings of the 10th International Conference on Computational Creativity (ICCC), Charlotte, NC, June 2019. Chord Recognition in Symbolic Music: A Segmental CRF Model, Segment-Level Features, and Comparative Evaluations on Classical and Popular Music Kristen Masada and Razvan Bunescu Transactions of the International Society for Music Information Retrieval, 2(1), 2018. Code Python code and data for changing the narrative perspective. Python code and data for context dependent semantic parsing. Java code for chord recognition in symbolic music. Java & C++ packages for semi-supervised mining of functionally related genes. Java package for Adaptive Clustering. Java package for generalized subsequence kernels. Java package for Relational Markov Networks (discrete potentials). Datasets MIL dataset for relation extraction. Question Focus dataset. Question Ranking datasets. This work is licensed under a Creative Commons Attribution 3.0 Unported License. Wikipedia Sense and Reference datasets. Courses taught at UNCC ITCS 4101: Introduction to Natural Language Processing, Fall 2025 ITCS 5356: Introduction to Machine Learning, Fall 2024 ITCS 6156/8156: Machine Learning, Spring 2023 Courses taught at OU CS 6890: Deep Learning, Spring 2020 CS 4040/5040: Design and Analysis of Algorithms, Spring 2020 CS 6840: Natural Language Processing, Fall 2019 CS 4900: Machine Learning, Fall 2019 CS 6830: Machine Learning, Fall 2016 CS 6860: Information Retrieval and Web Search, Fall 2013 CS 3200: Organization of Programming Languages, Spring 2016 In my spare time, I like playing the guitar. I am also learning how to play the piano. Current Erfan Al-Hossami, PhD Tonmoy Hasan, PhD Justin Smith, PhD Youssef Ait Alama, PhD Alumni Ramit Aditya, MSc 2025 Oseremen Oscar Uduehi, PhD 2024 Sampada Sakpal, MSc 2023 Smita Ramkrishna Nannaware, MSc 2023 Kristen Masada, MSc 2022 Mika Chen, PhD 2022 Quintin Fettes, PhD 2021 Jeremy Beauchamp, MSc 2021 Li (Charles) Chen, PhD 2019 Yi Yu, MSc 2018 Sadegh Mirshekarian, MSc 2017 Lijie Xia, MSc 2017 Hui Shen, MSc 2017 Xin Ye, PhD 2016 Chinmaya Naguri, MSc 2016 Asish Gaddipati, MSc 2016 Mika Chen, MSc 2011",
  "content_length": 6963,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:16"
}