{
  "name": "Raúl Rojas 0001",
  "homepage": "https://www.unr.edu/math/people/raul-rojas",
  "status": "success",
  "content": "Raul Rojas | Department of Mathematics and Statistics | University of Nevada, Reno Raúl Rojas Fred D. Gibson, Jr. Endowed Professor in Science He/him/his Phone: (650) 788-9515 Email: rrojasgonzalez@unr.edu Building: DMSC Room: 319 Mail stop: 0084 Summary About the Fred D. Gibson, Jr. Endowed Professorship in Science Fred D. Gibson '51 was an outstanding leader in the U.S. chemical industry for more than 50 years. He was named by the University as Alumnus of the Year in 2010 and received an honorary doctorate from Nevada in 1999. Established: 1999. (College of Science and Mackay School of Earth Sciences and Engineering) Research interests Artificial Intelligence Robotics Autonomous Cars Number Theory Courses taught Linear Algebra Calculus Mathematical Modeling Theory of Positive Integers Statistical Machine Learning Introduction to Probability Introduction to Statistics Education PhD H.c. in Computer Science, Inastituto Nacional de òptica y Electrónica, 2016 Habilitation, Computer Science, Freie Universitaet Berlin, 1994 Ph.D. in Economics, Freie Universitaet Berlin, 1988 Selected publications Books 2022 R. Rojas, El Futbol bajo el Microscopio: Deporte y Ciencia, Fondo de Cultura Económica, 2022. 2023 R. Rojas, Konrad Zuse’s Early Computers, Springer-Verlag, London, 2023. 2024 R. Rojas, Matemáticas Electorales, Vividus Verlag, Berlin, 2024, ISBN: 978-3-949667-08-4. 2025 R. Rojas, The Language of Mathematics: The Stories behind the Symbols, Princeton University Press. Papers 2025 R. Rojas, “Konrad Zuse and Operation Paperclip”, IEEE Annals of the History of Computing, N.1, 2025. 2024 R. Rojas, “The First Computer Program”, Communications of the ACM, V. 67, N. 6, June 2024, pp. 78-81. 2024 N. Steinke, D. Goehring, R. Rojas, \"GroundGrid: LiDAR Point Cloud Ground Segmentation and Terrain Estimation”, IEEE Robotics and Automation Letters, V. 1, N. 1, pp. 420-426. Also presented at: 2024 IEEE International Conference on Robotics and Automation (ICRA), Yokohama, Japan, May 13-17, 2024. 2023 R. Rojas, “Das erste Computerprogramm“, futuRetro Conference 2023, Augsburg, Dec. 2023. 2023 R. Rojas, “Das erste Computerprogramm”, Informatik Spektrum, Springer-Verlag, accepted for publication. 2023 R. Rojas, “ Die Evolution der Analytischen Rechenmaschine von Charles Babbage”, Informatik Spektrum, Springer-Verlag, accepted for publication. 2022 Alomari, K., Sundermann, S., Goehring, D., Rojas, R. (2022), \"Design and Experimental Analysis of an Adaptive Cruise Control\", In: Galambos, P., Kayacan, E., Madani, K. (eds) Robotics, Computer Vision and Intelligent Systems. ROBOVIS 2020-2021. Communications in Computer and Information Science, vol 1667, Springer. 2021 R. Rojas, “The programming architecture of Zuse’s Z4”, IEEE Histelcon-2021, Nov. 10- 12, Moscow. 2021 K. Alomari, R. Carrillo, R. Rojas, “Path Following with Deep Reinforcement Learning for Autonomous Cars'”, 2nd International Conference on Robotics, Computer Vision and Intelligent Systems, ROBOVIS 2021, 27-28 Oct. 2021 N. Steinke, C. Ritter, D. Göhring, R. Rojas, \"Robust LiDAR Feature Localization for Autonomous Vehicles Using Geometric Fingerprinting on Open Datasets\", IEEE Robotics and Automation Letters, V. 6, N. 2, pp. 2761-2767, ISSN: 2377-3766, 2021. Presented also at IEEE ICRA 2021, Xian, China, May 2021. 2021 R. Rojas, “The Computer programs of Charles Babbage”, IEEE Annals of the History of Computing, V. 43, Jan-March, pp. 6-18, 2021.",
  "content_length": 3445,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:14"
}