{
  "name": "Rebecca Schulman",
  "homepage": "https://engineering.jhu.edu/faculty/rebecca-schulman",
  "status": "success",
  "content": "Rebecca Schulman - Johns Hopkins Whiting School of Engineering Contact (410) 516-8457 rschulm3@jhu.edu Location 200-B Shaffer Hall Connect Google Scholar Website Research Areas DNA Self-Assembly Smart Biomaterials Synthetic Biology Rebecca Schulman is an associate professor in the Department of Chemical and Biomolecular Engineering, with secondary appointments in chemistry and computer science. She is the Kent Gordon Croft Investment Management Faculty Scholar and a member of the Institute for NanoBioTechnology, the Hopkins Extreme Materials Institute, the Chemistry-Biology Interface Program, the Center for Cell Dynamics, and the Laboratory for Computational Sensing and Robotics. She is currently the co-director of the Passport to Future Technology Leadership program for PhD students. Schulman and her research group develop intelligent and adaptive biomolecular materials and nanostructures by combining ideas from materials science, biochemistry, circuit design, soft matter physics, and cell-free synthetic biology. DNA nanotechnology enables the design of complex molecular self-assembly processes involving hundreds of different species that produce structures with virtually arbitrary features at the nanoscale. Synthetic biology now allows the design of molecular “circuits” that integrate chemical information. Schulman’s group develops these techniques and uses them to produce dynamic biomaterials and smart sensors. These platform technologies can be applied to develop new assays and therapeutics for biologists, smart materials for cell culture and drug delivery, and self-assembling molecular circuits and autonomous soft micro-robots powered and controlled by biochemical reactions. Schulman’s team builds these devices by applying basic tools the group has developed for dynamic self-assembly of materials and chemical circuits for self-regulation. The group focuses on the development of mechanisms for constructing massively reconfigurable materials using design principles similar to those the cytoskeleton uses. This work includes the development of mechanisms for controlling the nucleation and architecture of semiflexible filaments using the design of assembly pathways with specific energy barriers. Other work is focused on the design of molecular reaction systems (or chemical reaction networks) for regulating energy flow within materials and for sensing and responding to environmental signals. Schulman has developed new means of building and repairing molecular circuits using a technique called point-to-point assembly and has developed new classes of soft materials called “hydrogels” that can change form in response to specific biomolecular sequences (or codes), paving the way for new classes of biomedical devices, robots, and materials. Schulman is the recipient of an AIMBE Fellowship Award, a Vannevar Bush Faculty Fellowship Award, a Hartwell Individual Biomolecular Research Award, a President’s Early Career Award in Science and Engineering (PECASE), a DARPA Young Faculty Award and Directors Fellowship, an NSF CAREER Award and NSF Trailblazer Engineering Impact Award, a Turing Scholar Award, and a DOE Early Career Award. Schulman earned bachelor’s degrees in mathematics and computer science from the Massachusetts Institute of Technology in 1999 and her PhD in computation and neural systems from the California Institute of Technology in 2007. She was a postdoctoral scholar in computer science at the California Institute of Technology and a Miller Postdoctoral Fellow in physics at the University of California, Berkeley. Related News View All News Rebecca Schulman Receives NSF Trailblazer Engineering Impact Award Categories Faculty Awards/Honors Research The award supports Schulman's efforts to create a programmable language for biomaterials that can bring us closer to making lab-grown organs and tissues. Molecular Morphers: DNA-powered Gels Shapeshift on Command Categories Research Hopkins engineers created small, flexible gels that can be programmed to change shape when exposed to DNA-based activators. Fluorescent dyes highlight the transformations. Five Johns Hopkins Scholars Elected to AIMBE College of Fellows Categories Awards and Honors Faculty Awards/Honors Kathleen Cullen, Andrew Feinberg, Eileen Haase, Deok-Ho Kim, Rebecca Schulman honored for outstanding contributions to engineering and medicine research, practice, or education. Site Menu Search Submit Close ﻿",
  "content_length": 4448,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:17"
}