{
  "name": "Rebekka Burkholz",
  "homepage": "https://sites.google.com/view/rebekkaburkholz/rebekka-burkholz",
  "status": "success",
  "content": "Rebekka BurkholzSearch this siteEmbedded FilesSkip to main contentSkip to navigationRebekka BurkholzHelmholtz Center CISPAStuhlsatzenhaus 566123 Saarbrücken, Germanyburkholz (at) cispa (dot) deI am a tenured faculty member (W3) at the Helmholtz Center CISPA, where I lead the Relational Machine Learning Group. Our research combines robust algorithm design and complex network science with the quest for a theoretical understanding of deep learning. Based on theoretical and experimental insights, we develop efficient models and algorithms that are robust to noise, adapt to a changing environment, and integrate information that can be available by small amounts of data and various forms of domain knowledge. This makes our approach well suited for the biomedical domain and sciences in general. While we care about solving real world problems in collaboration with domain experts, we have a special interest in problems related to glycans, gene regulation, and its alterations during cancer progression.Short CVDr. Rebekka Burkholz is a faculty member at the CISPA Helmholtz Center for Information Security in Saarbrücken, where she leads the relational machine learning group. Her main goal to develop efficient deep learning algorithms that are robust to noise, require small sample sizes, and are generally applicable in the sciences. Her work is founded in theory with implications for real world applications and is often characterized by a complex network science perspective. Her favourite applications and sources of inspiration are currently the biomedical domain, pharmacy, and physics. Her group is supported by the ERC starting grant SPARSE-ML and by Apple Research. From 2019-2021, she was a PostDoc at the Biostatistics Department of the Harvard T.H. Chan School of Public Health working with John Quackenbush. Before that, she enjoyed postdoctoral research at ETH Zurich, from 2017-2018 at the Institute for Machine Learning with Joachim Buhmann and from 2016-2017 at the Chair of Systems Design with Frank Schweitzer. Her PhD research from 2013-2016 at the ETH Risk Center was supervised by Frank Schweitzer and co-supervised by Hans J. Herrmann. Her thesis on systemic risk won the Zurich Dissertation Prize and her work on international maize trade received the CSF Best Contribution Award. She studied Mathematics and Physics at TU Darmstadt.NewsDisclaimer: An up-to-date list of news can be found on our group homepage: Relational Machine Learning Group.Three papers accepted at NeurIPS 2024. Looking forward to meet you in Vancouver!Two papers accepted at ICLR 2024. Please visit us at our spotlight talk and poster!I am incredibly grateful for the ERC starting grant SPARSE-ML that was awarded by the European Research Council to my group for the next 5 years. Please join me on this exciting journey if you are looking for a PostDoc or PhD position.Our paper on balancing GATs was accepted at NeurIPS 2023. Looking forward to meet you in New Orleans!Our paper on random pruning was accepted at ICML 2023. Many thanks to the engaged reviewers!PublicationsDisclaimer: An up-to-date list of publications can be found on Google Scholar.A. Jamadandi, C. Rubio-Madrigal, R. Burkholz (2024). Spectral Graph Pruning Agains Over-Squashing and Over-Smoothing. NeurIPS 2024.N. Mustafa, R. Burkholz (2024). Training GNNs in Balance by Dynamic Rescaling. NeurIPS 2024.I. Hossain, J. Fischer, R. Burkholz*, J. Quackenbush* (2024). Pruning neural network models for gene regulatory dynamics using data and domain knowledge. NeurIPS 2024.N. Mustafa, R. Burkholz (2024). GATE: How to keep out intrusive neighbors. ICML 2024.A. Gadhikar, R. Burkholz (2024). Masks, Signs, and Learning Rate Rewinding. Spotlight. ICLR 2024.  R. Burkholz (2024). Batch normalization is sufficient for universal function approximation in CNNs. ICLR 2024.I. Hossain, V. Fanfani, J. Fischer, J. Quackenbush, R. Burkholz (2024). Biologically informed NeuralODEs for genome-wide regulatory dynamics (2024). Genome Biol 25, 127 (2024).N. Mustafa, A.Bojchevski, R. Burkholz (2023). Are GATs out of balance? NeurIPS 2023.A. Gadhikar, S. Mukherjee, R. Burkholz (2023). Why random pruning is all we need to start sparse. ICML 2023.M. Ben Guebila et al. The Network Zoo: a multilingual package for the inference and analysis of gene regulatory networks (2023). Genome Biology. K.H. Shutta, D. Weighill, R. Burkholz, M. B. Guebila, D. DeMeo, H. U. Zacharias, J. Quackenbush, M. Altenbuchinger (2023). DRAGON: Determining Regulatory Associations using Graphical models on multi-Omic Networks. Nucleic Acids Research.R. Burkholz (2022). Most Activation Functions Can Win the Lottery Without Excessive Depth. arXiv:2205.02321, NeurIPS 2022.R. Burkholz (2022). Convolutional and Residual Networks Provably Contain Lottery Tickets. arXiv:2205.02343, ICML 2022.M. Ben Guebila , D. Weighill, C.M. Lopes-Ramos, R. Burkholz, et al. (2022) An online notebook resource for reproducible inference, analysis and publication of gene regulatory networks. Nature Methods. J. Fischer, R. Burkholz (2022). Plant 'n' Seek: Can You Find the Winning Ticket? arXiv:111.11153, ICLR 2022.R. Burkholz, N. Laha, R. Mukherjee, A. Gotovos (2022). On the Existence of Universal Lottery Tickets. arXiv:2111.11146, ICLR 2022.Laumer F, Di Vece D, Cammann VL, et al. (2022). Assessment of Artificial Intelligence in Echocardiography Diagnostics in Differentiating Takotsubo Syndrome From Myocardial Infarction. JAMA Cardiology.J. Fischer, R. Burkholz (2021). Towards strong pruning for lottery tickets with non-zero biases. arXiv:2110.11150.M. B. Guebila, C. Lopes-Ramos, D. Weighill, A. R. Sonawane, R. Burkholz, B. Shamsaei, J. Platig, K. Glass,  M. L. Kuijjer, J. Quackenbush (2021). GRAND: A database of gene regulatory network models across human conditions. bioRxiv, Nucleic Acids Research.A. Gotovos, R. Burkholz, J. Quackenbush, S. Jegelka. Scaling up Continuous-Time Markov Chains Helps Resolve Underspecification (2021). arXiv:2107.02911, NeurIPS 2021.L. Thomés, R. Burkholz, D. Bojar. Glycowork: A Python package for glycan data science and machine learning (2021). bioRxiv, Glycobiology.R. Burkholz, J. Quackenbush, D. Bojar (2021). Using Graph Convolutional Neural Networks to Learn a Representation of Glycans. Cell Reports 35(11), 109251.S Weichwald, A Candreva*, R Burkholz*, R Klingenberg, L Räber, D Heg, R Manka, B Gencer, F Mach, D Nanchen, N Rodondi, S Windecker, R Laaksonen, SL Hazen, Av Eckardstein, F Ruschitzka, TF Lüscher, JM Buhmann, CM Matter (2021). Improving 1-year mortality prediction in ACS patients using machine learning. European Heart Journal: Acute Cardiovascular Care.D. Weighill, M. B. Guebila, C. Lopes-Ramos, K. Glass, J. Quackenbush, J. Platig, R. Burkholz (2021). Gene regulatory network inference as relaxed graph matching. bioRxiv, AAAI 2021.R. Burkholz, J. Quackenbush (2021). Cascade Size Distributions and Why They Matter. arXiv:1909.05416, AAAI 2021.R. Burkholz, A. Dubatovka (2019). Initialization of ReLUs for Dynamical Isometry.  arXiv:1806.06362. NeurIPS 2019. Code.R. Burkholz (2019). Efficient message passing for cascade size distributions.  arXiv:1811.06872. Scientific Reports 9, 6561.R. Burkholz, F. Schweitzer (2019). International crop trade networks: The impact of shocks and cascades.  arxiv:1901.05872. Environmental Research Letters.R. Burkholz, F. Schweitzer (2018). Correlations between thresholds and degrees: An analytic approach to model attacks and failure cascades. arXiv:1706.04451. Phys. Rev. E 98, 022306.R. Burkholz, F. Schweitzer (2018). Framework for cascade size calculations on random networks. arXiv:1701.06970. Phys. Rev. E 97, 042312.R. Burkholz, H. J. Herrmann, F. Schweitzer (2018). Explicit size distributions of failure cascades redefine systemic risk on finite networks. arXiv:1802.03286. Scientific Reports 8 (1), 6878.M. V. Tomasello, R. Burkholz, F. Schweitzer (2017). Modeling the formation of R&D alliances: an agent-based model with empirical validation.  Economics E-Journal: No. 2017-107.  R. Burkholz, A. Garas, F. Schweitzer (2016). How damage diversification can reduce systemic risk. Physical Review E: 93: 042313. R. Burkholz, M. V. Lecuc, A. Garas, F. Schweitzer (2016). Systemic risk in multiplex networks with asymmetric coupling and threshold feedback, Physica D: Nonlinear Phenomena 323-324, 64-72. R. Burkholz (2016). Systemic Risk: From Generic Models to Food Trade Networks. PhD thesis.Talks21/09/2021: Gene regulatory network inference as relaxed graph matching. Bio-IT World, Boston (USA), invited.07/07/2021: Gene regulatory network inference as relaxed graph matching. Networks 2021 (formerly NetSci), online.10/07/2020: International Crop Trade Networks: The impact of shocks and cascades. Graphs & Networks, Boston (USA), lightning talk.23/06/2020: Message passing for cascade size distributions. LSV seminar, École Normale Supérieure Paris-Sacley, Paris (France), invited.12/12/2019: Initialization of ReLUs for Dynamical Isometry. NeurIPS 2019, Vancouver (Canada), Poster. 29/05/2019: Tree distribution approximation for finite networks. NetSci 2019, Burlington, Vermont. 2nd place at the NetSci Society YI for Best Talk Pitch.27/05/2019: Systemic risk in international crop trade. Network Science for Social Good. NetSci 2019 Satellite, Burlington, Vermont.23/05/2019: Non-invasive diagnosis of a rare heart disease by Machine Learning, 21st Future of Health Technology Summit, MIT, Boston.16/11/2018: Exact cascade size distributions redefine systemic risk on finite networks, MACSI seminar, University of Limerick (Ireland), invited.05/10/2018: How machines learn cardiology in three examples, ACS Plus, Berlin (Germany), invited.21/06/2018: How machines learn cardiology in three examples, Personalized Health Technologies and Translational Research Conference 2018, ETH Zurich (Switzerland), invited15/06/2018: Application of Temporal Multiplex Networks to Cascade Processes in Food Trade, NetSci 2018, Paris (France)12/06/2018: Co",
  "content_length": 13945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:16"
}