{
  "name": "Rebecca Willett",
  "homepage": "https://voices.uchicago.edu/willett",
  "status": "success",
  "content": "Rebecca Willett | University of Chicago Becca Willett at NITMB and SkAI Hub. (Photo by Jason Smith) Worah Family Professor of Statistics and Computer Science in the Wallman Society of Fellows Member of the UChicago Committee on Computational and Applied Mathematics (graduate program) Faculty Director of AI at the Data Science Institute Courtesy appointment at the Toyota Technological Institute at Chicago Recipient of the inaugural SIAM Activity Group on Data Science Career Prize in 2024 Deputy Director for Research at the NSF-Simons Foundation National Institute for Theory and Mathematics in Biology (NITMB) Deputy Director for Research at the NSF-Simons AI Institute for the Sky (SkAI Institute) Faculty Director of the Eric and Wendy Schmidt AI in Science Postdoctoral Fellowship Member of the Executive Committee for the NSF Institute for the Foundations of Data Science. Fellow of the Society of Industrial and Applied Mathematics Fellow of the IEEE Member of the National Academies of Sciences, Engineering, and Medicine Committee on Applied and Theoretical Statistics (CATS) Becca’s research is focused on the mathematical and statistical foundations of machine learning, scientific machine learning, and signal processing. Her machine learning and signal processing work reflects broad and interdisciplinary expertise and perspectives, with contributions in biology, astronomy, and climate science. She received the National Science Foundation CAREER Award in 2007, was a DARPA Computer Science Study Group member, and received an Air Force Office of Scientific Research Young Investigator Program award in 2010. She completed her PhD in Electrical and Computer Engineering at Rice University in 2005. She was an Assistant and then tenured Associate Professor of Electrical and Computer Engineering at Duke University from 2005 to 2013. She was an Associate Professor of Electrical and Computer Engineering, Harvey D. Spangler Faculty Scholar, and Fellow of the Wisconsin Institutes for Discovery at the University of Wisconsin-Madison from 2013 to 2018. Scientific community leadership roles: Public lecture at the National Museum of Mathematics on Mathematics of AI (video here!) Inaugural role in SIAM Journal of Mathematics of Data Science Inaugural role in Harvard Data Science Review Broad experience with leading conferences and workshops for the AI community Extensive experience in broadening participation in AI, including through Graduate Research Opportunities for Women (GROW) and as keynote speaker at GirlCon 2025 Conference chair or conference technical program chair for multiple large-scale conferences and workshops Additional service activities listed here",
  "content_length": 2690,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:17"
}