{
  "name": "Redha Gouicem",
  "homepage": "https://redha.gouicem.fr",
  "status": "success",
  "content": "Redha Gouicem Search Redha Gouicem Associate Professor RWTH Aachen University I am an Associate Professor at RWTH Aachen University leading the Operating Systems group. My research revolves around operating systems, scheduling, virtualisation, and binary translation systems, with a flavour of formal verification. Before that, I worked as a senior researcher in the Department of Informatics at TU Munich, in the chair of Distributed Systems and Operating Systems, where I lead the OS and Virtualization team. I obtained my Ph.D. in computer science in 2020 from Sorbonne Université, where I worked in the Whisper research group at LIP6 and Inria, under the supervision of Gilles Muller and Julien Sopena. My work focused on thread scheduling in general-purpose operating systems. We have open positions for Ph.D. students and B.Sc./M.Sc. thesis at our chair! Contact me if you want to apply! Featured Publications Full publication list Redha Gouicem, Dennis Sprokholt, Jasper Ruehl, Rodrigo C. O. Rocha, Tom Spink, Soham Chakraborty, Pramod Bhatotia. Risotto: A Dynamic Binary Translator for Weak Memory Model Architectures. ASPLOS (Distinguished Artifact Award), 2023. Cite PDF Artifact Source code Rodrigo C. O. Rocha, Dennis Sprokholt, Martin Fink, Redha Gouicem, Tom Spink, Soham Chakraborty, Pramod Bhatotia. Lasagne: A Static Binary Translator for Weak Memory Model Architectures. PLDI, 2022. Cite PDF Artifact Jörg Thalheim, Peter Okelmann, Harshavardhan Unnibhavi, Redha Gouicem, Pramod Bhatotia. VMSH: Hypervisor-Agnostic Guest Overlays for VMs. Eurosys, 2022. PDF Cite Source code Artifact award Redha Gouicem, Damien Carver, Jean-Pierre Lozi, Julien Sopena, Baptiste Lepers, Willy Zwaenepoel, Nicolas Palix, Julia Lawall, Gilles Muller. Fewer Cores, More Hertz: Leveraging High-Frequency Cores in the OS Scheduler for Improved Application Performance. USENIX ATC, 2020. PDF Cite Slides Video Baptiste Lepers, Redha Gouicem, Damien Carver, Jean-Pierre Lozi, Nicolas Palix, Maria-Virginia Aponte, Willy Zwaenepoel, Julien Sopena, Julia Lawall, Gilles Muller. Provable Multicore Schedulers with Ipanema: Application to Work Conservation. EuroSys, 2020. PDF Cite Justinien Bouron, Sebastien Chevalley, Baptiste Lepers, Willy Zwaenepoel, Redha Gouicem, Julia Lawall, Gilles Muller, Julien Sopena. The Battle of the Schedulers: FreeBSD ULE vs. Linux CFS. USENIX ATC, 2018. PDF Cite Baptiste Lepers, Willy Zwaenepoel, Jean-Pierre Lozi, Nicolas Palix, Redha Gouicem, Julien Sopena, Julia Lawall, Gilles Muller. Towards Proving Optimistic Multicore Schedulers. HotOS, 2017. PDF Cite Service EuroSys'24, PC member Middleware'23, PC member Usenix ATC'23, PC member EuroSys'23, PC member Middleware'21 Doctoral Symposium, PC member ComPAS'21, PC member Systor'21, PC member (Distinguished reviewer) EuroSys'21, Shadow PC member NSDI'21, External reviewer Teaching RWTH Aachen (2023 – current) Operating Systems TU Munich (2021 – 2023) Advanced Systems Programming in C/Rust Computer Systems Lab Introduction to Software Engineering (EIST) Sorbonne Université (2016 – 2020) Bachelor Level Programming 1 Programming 2 Introduction to Operating Systems Parallel Programming Compilation Master Level Linux Kernel Development Multicore Kernels and Virtualization (course on scheduling) Cite × Copy Download",
  "content_length": 3302,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:18"
}