{
  "name": "Regina Barzilay",
  "homepage": "http://people.csail.mit.edu/regina",
  "status": "success",
  "content": "Home | Regina Barzilay top of pageRegina BarzilaySchool of Engineering Distinguished Professor for AI and Health AI Faculty Lead, Jameel Clinic MacArthur FellowMIT Computer Science & Artificial Intelligence Lab 32 Vassar Street, 32-G468 Cambridge, MA 02139 (617) 258-5706 | regina@csail.mit.edu Lab Website: rbg.mit.eduNewsNewsNew diagnostic tool in battle against breast cancerHow artificial intelligence may help detect early signs of breast cancer years before symptoms.                                        Is artificial intelligence about to transform the mammogram?An MIT researcher who survived breast cancer has devised a technique that seems to predict many breast cancer cases. A path forward for trusted AI in breast cancer risk predictionAs the role of artificial intelligence grows in medicine, one of the leading concerns is that algorithmic tools will perpetuate disparities in care. These Doctors Are Using AI to Screen for Breast CancerDuring the pandemic, thousands of women have skipped scans and check-ups. So physicians tapped an algorithm to predict those at the highest risk. A leading AI researcher calls for standards to ensure equity and fairnessA top researcher at the Massachusetts Institute of Technology on Thursday said that artificial intelligence systems developed for medicine must be more transparent and judged against a set... MIT Professor Who Advanced Cancer Treatment Wins $1 Million AI PrizeRegina Barzilay, a breast cancer survivor, was recognized for her work in breast-cancer detection and drug discovery. Machine learning has been used to automatically translate long-lost languagesSome languages that have never been deciphered could be the next ones to get the machine translation treatment. Can these researchers catch cancer much earlier than ever before?From revolutionizing the mammogram to spotting a single tumor cell in the blood...Looking to Technology to Avoid Doctors’ Offices and Emergency RoomsAmericans are eagerly turning to the latest tech devices in hopes of preventing and detecting medical problems early...View allResearch InterestsOncologyLearning to Cure Data collected about millions of cancer patients — their pathology slides, imaging, and other tests — contain answers to many open questions in oncology. Jointly with the MGH collaborators, we are developing algorithms that can learn from this data to improve models of disease progression, prevent over-treatment, and narrow down to the cure. On the NLP side, we are creating databases which record pertinent cancer features extracted from raw documents. On the computer vision side, we are working on deep learning models that compute personalized assessment from mammogram data focusing on early cancer detection.ChemistryML Drug Discovery Today, drug discovery involves practitioners with years of advanced training and is carried out in a trial-and-error, labor-intensive fashion. Our goal is to change a traditional discovery pipeline. In a joint work with chemical engineers and biologists at MIT, we are working on deep learning methods for modeling biological and physicochemical properties, de-novo molecular design, and retrosynthesis.  On the ML side, this area brings many interesting questions related to learning molecular representations, interpretability and robustness. As part of the MLPDS consortium, we are continuously learning  from the deployment of our models in the pharmaceutical industry, directing the development towards our ultimate goal to change the drug discovery process.Research InterestsBio / AwardsGroupTeachingAziz Ayed Chris Alexiev Felix Faltings Hannes Stärk Itamar Chinn Mateo Reveiz MinGyu Choi Peter Mikhael Sean Murphy Serena Khoo Tally Portnoi Wenxian ShiFall 2025: ​ 6.S043/6.S983 AI and Decision Making in the Medicine: From Disease to Therapy ​ Description: Introduction to fundamental principles and applications of artificial intelligence (AI) in medicine and medical research. Students are introduced to foundational concepts in  machine learning as it pertains to clinical decision support systems, personalized medicine, and advanced computational methods for drug optimization and protein folding.   The role of explainablity and uncertainty analysis in deep learning for healthcare are discussed.  Problem sets integrate theoretical knowledge and hands-on applications based on concrete problems in both medical and pharmaceutical science.BioAwardsRegina Barzilay is a School of Engineering Distinguished Professor of AI & Health in the Department of Computer Science and the AI Faculty Lead at MIT Jameel Clinic. She develops machine learning methods for drug discovery and clinical AI. In the past, she worked on natural language processing. Her research has been recognized with the MacArthur Fellowship, an NSF Career Award, and the AAAI Squirrel AI Award for Artificial Intelligence for the Benefit of Humanity. Regina is a member of the National Academy of Engineering, American Academy of Arts and Sciences, and the National Academy of Medicine. IEEE Frances E. Allen Medal 2025 National Academy of Medicine 2023 National Academy of Engineering 2023 Susan G. Komen Scholar 2022 AACC Wallace H. Coulter Lectureship Award 2021 UNESCO/Netexplo Award 2021 School of Engineering Distinguished Professor for AI and Health (2021) AAAI Squirrel AI Award for Artificial Intelligence for the Benefit of Humanity 2021 Top 100 AI Leaders in Drug Discovery & Advanced Healthcare 2019 Xconomy Boston Digital Trailblazer 2019 Susan Komen Scholar 2018 Ruth and Joel Spira Award for Excellence in Teaching 2018 AAAI Fellowship 2017 ACL Fellowship 2017 MacArthur Fellowship 2017 Best Paper Award, EMNLP 2016 Burgess & Elizabeth Jamieson Award for Excellence in Teaching 2016 Delta Electronics Professor 2016 Best Paper Honorable Mention, EMNLP 2015 Faculty Research Innovation Fellowship 2014 Best Student Paper Award, NAACL 2014 Best Paper Award, SLT 2010 Carolyn Baldwin Morrison Lecture, Cornell 2009 Best Paper Award, ACL 2009 Ross Career Development Professor 2006 Microsoft Faculty Fellowship 2006 IEEE Intelligent Systems: “AI Ten to Watch” 2006 Technology Review: 35 Top Innovators 2005 NSF Career Award 2005 Technology Research News: “Top Picks: Technology Research Advances of 2004” Best Paper Award, HLT/NAACL 2004 Teaching / Studentsbottom of page",
  "content_length": 6330,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:23"
}