{
  "name": "Reheem Beyah",
  "homepage": "https://rbeyah.ece.gatech.edu",
  "status": "success",
  "content": "Raheem A Beyah Skip to main navigation Skip to main content Raheem A Beyah http://www.ece.gatech.edu/cap/, http://users.ece.gatech.edu/~rbeyah/ Official Job Title Professor; Provost and Executive Vice President for Academic Affairs Endowed Chair and Professorships Titles Southern Company Chair Email Address ab207@gatech.edu Telephone 404/894-2531 Office Building Klaus Office Room Number 2308 Technical Interest Group(s) Computer Systems and Software Biography Raheem Beyah is the Dean of the College of Engineering at Georgia Tech and the Southern Company Chair. A native of Atlanta, Georgia, Dr. Beyah received his Bachelor of Science in Electrical Engineering from North Carolina A&T State University in 1998. He received his Master's and Ph.D. in Electrical and Computer Engineering from Georgia Tech in 1999 and 2003, respectively. Prior to returning to Georgia Tech as a member of the ECE faculty, Dr. Beyah was a faculty member in the Department of Computer Science at Georgia State University, a research faculty member with the Georgia Tech Communications Systems Center (CSC), and a consultant in Andersen Consulting's (now Accenture) Network Solutions Group. He served as the Vice President for Interdisciplinary Research from June 2019-January 2021, the Interim Steve W. Chaddick School Chair in ECE from September 2017-July 2018, and the ECE Associate Chair for Strategic Initiatives and Innovation from September 2016-December 2018. While a member of the ECE faculty, he held the Motorola Foundation Professorship. Dr. Beyah's work is at the intersection of the networking and security fields. He leads the Georgia Tech Communications Assurance and Performance Group (CAP). The CAP Group develops algorithms that enable a more secure network infrastructure, with computer systems that are more accountable and less vulnerable to attacks. Through experimentation, simulation, and theoretical analysis, CAP provides solutions to current network security problems and to long-range challenges as current networks and threats evolve. Dr. Beyah has served as guest editor and associate editor of several journals in the areas of network security, wireless networks, and network traffic characterization and performance. He received the National Science Foundation CAREER award in 2009 and was selected for DARPA's Computer Science Study Panel in 2010. He is a member of AAAS, ASEE, a lifetime member of NSBE, a Fellow of IEEE, and an ACM Distinguished Scientist. Research Cyber-Physical Systems Security Privacy Network Security Network Monitoring and Performance Distinctions & Awards NSF CAREER Award - 2009 DARPA Computer Science Study Panel - 2010 Distinguished Scientist, ACM - 2016 Distinguished Paper Award, ACM Conference on Computer and Communications Security (CCS) - 2024 Fellow, IEEE - 2025 Wednesday, 05 November 2025 3:38 PM EST",
  "content_length": 2853,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:24"
}