{
  "name": "Reinhard Koch",
  "homepage": "https://www.mip.informatik.uni-kiel.de/en/team/prof.-dr.-ing.-reinhard-koch",
  "status": "success",
  "content": "Multimediale Informationsverarbeitung Die Arbeitsgruppe Multimedia-Informationsverarbeitung am Institut für Informatik der Christian-Albrechts-Universität zu Kiel forscht seit 1999 unter der Leitung von Prof. Dr.-Ing. Reinhard Koch auf dem Gebiet der Bild- und Signalverarbeitung mit Anwendungen in den Bereichen Computergrafik, Computer Vision und Augmented/Virtual Reality. Forschungsschwerpunkte sind die robuste und echtzeitfähige 3D-Rekonstruktion von Szenen aus Bildsequenzen und unterstützenden Sensordaten, 3D-Kameratracking, Objekterkennung und -verfolgung sowie die Datenverarbeitung von Tiefenkameras und komplexen Mehrkamerasystemen, neuerdings auch Deep Learning und medizinische Bildverarbeitungsanwendungen. Seit ihrem Bestehen hat die Forschungsgruppe ca. 220 wissenschaftliche Arbeiten in verschiedenen Fachzeitschriften und Konferenzbänden in den Bereichen Computer Vision, Mustererkennung etc. veröffentlicht.Derzeit beschäftigen sich 4 wissenschaftliche Mitarbeiter mit der theoretischen und praktischen Vertiefung dieser Themen, u.a. im Rahmen von wissenschaftlichen und industriellen Drittmittelprojekten. Beispiele für Forschungsergebnisse finden Sie im Forschungsprofil. Prof. Dr.-Ing. Reinhard Kochreinhard.koch@informatik.uni-kiel.deNeufeldtstr. 6D-24118 KielRaum: EG.015 (NFS6) Untersuchen der Auswirkungen von Mehrdeutigkeit bei der Bildannotation auf Deep-Learning-Modelle. Mehrdeutigkeit entsteht durch unscharfe oder schwer zu interpretierende Bilder, was zu Unsicherheit bei der Klassifizierung führt. Ziel ist es, Strategien zur Verbesserung der Robustheit von Modellen zu entwickeln, indem die Unsicherheit in den Annotationsprozessen systematisch berücksichtigt wird. Entwicklung von Methoden zur effizienten Annotation von marinen Bilddaten mit dem Ziel, die Konsistenz und Genauigkeit zu verbessern. Der Einsatz von Clustering-Algorithmen und Deep Representation Learning in der MorphoCluster-Plattform ermöglicht eine feingranulare Klassifikation und Erkennung von Neuheiten in Planktonbildern, was die Erforschung von Meeresökosystemen unterstützt. Erforschung und Simulation von Lichtfeldkameras zur Verbesserung der Tiefenschätzung und Datenerfassung. Durch die Entwicklung neuer Algorithmen und Simulationen für Plenoptik-Kameras wird die Qualität der Bilddaten für Anwendungen wie 3D-Modellierung und Tiefenanalyse optimiert. Dies schließt die Erstellung von Datensätzen und die Bewertung von Algorithmen ein. Entwicklung von Technologien zur Erfassung und Verarbeitung von Lichtfelddaten mit einem multi-kamerabasierten System. Dieses System ermöglicht Anwendungen wie freier Sichtpunktvideo und 3D-Display-Inhalte. Schwerpunkte liegen auf der Kalibrierung, Fusion von Sensordaten und effizienten Repräsentationen für dynamische Szenen, um eine realistische und detailreiche Darstellung zu ermöglichen. Forschung zur 3D-Rekonstruktion von Meeresbodenstrukturen aus ROV-basierten Videodaten. Die Anpassung klassischer Computer-Vision-Methoden an die spezifischen Herausforderungen der Unterwasserfotografie ermöglicht präzise 3D-Modelle von geologischen und archäologischen Strukturen. Dies trägt zur Erforschung des weitgehend unbekannten Tiefsee-Ozeans bei. Die Arbeitsgruppe für Multimediale Informationsverarbeitung steht für innovative Forschung.Aktuelle Forschungsprojekte im ÜberblickAutomatische 3D ModellierungDeformation TrackingEinordnung mehrdeutiger BilderLichtfelderfassungPlenoptische KamerasRekonstruktion des Meeresbodens Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 4016,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:29"
}