{
  "name": "Reinhard Kahle",
  "homepage": "https://uni-tuebingen.de/en/faculties/faculty-of-science/departments/interfaculty-facilities/philosophy-and-history-of-science/#c840039",
  "status": "success",
  "content": "Philosophy and History of Science | University of Tübingen Prof. Dr. Reinhard Kahle University of Tübingen Doblerstr. 33 72074 Tübingen Tel.: +49-7071-29-75333 Email: reinhard.kahlespam prevention@uni-tuebingen.de Office hours: by appointment Prof. Dr. Reinhard Kahle The Carl Friedrich von Weizsäcker endowed professorship for Philosophy and History of Science was established in 2019 with support of the Udo Keller Stiftung Forum Humanum. In the tradition of the scientific work of Carl Friedrich von Weizsäcker, the chair will study philosophical and societal questions resulting from modern science. The professorship is combined with the directorship of the Carl Friedrich von Weizsäcker Center, one of the one of the three pillars of the Forum Scientiarum at the University of Tübingen. Expand all Prof. Dr. Reinhard Kahle (Chair) Tel.: +49-7071-29-75333 E-mail: reinhard.kahlespam prevention@uni-tuebingen.de Office hours: by appointment Prof. Dr. Klaus Mainzer (Senior professor) Homepage: https://www.professoren.tum.de/mainzer-klaus/ Room 106 Tel.: +49-7071-29-70468  E-mail: mainzerspam prevention@tum.de, k.mainzerspam prevention@outlook.com Dr. Thomas Piecha (Member of academic staff) Homepage: https://uni-tuebingen.de/en/30466 Room 106 Tel.: +49-7071-29-70468 E-mail: piechaspam prevention@cs.uni-tuebingen.de Office hours: by appointment Dr. Vlasta Sikimić (Member of academic staff) Homepage: https://vlastasikimic.com   Room 107   Tel.: +49-7071-29-75366   E-mail: vlasta.sikimic@uni-tuebingen.de   Office hours: by appointment Dipl.-Math. Wilfried Keller, M.A. (Member of academic staff) Homepage: https://www.uni-saarland.de/fachrichtung/philosophie/professuren/professur-fuer-analytische-philosophie/wilfried-keller.htm Room 107 Tel.: +49-7071-29-75366 E-mail: wilfried.kellerspam prevention@mnf.uni-tuebingen.de Office hours: by appointment Dipl.-Math. René Gazzari (Research Assistant) Room 107 Tel.: +49-7071-29-75366 E-mail: gazzarispam prevention@informatik.uni-tuebingen.de Office hours: by appointment Natalie Clarius (Research assistant) Room 107 Tel.: +49-7071-29-75366 E-mail: natalie.clariusspam prevention@student.uni-tuebingen.de Office hours: by appointment Aleksandra Rötschke (Secretary) Room 103 Tel.: +49-7071-29-75334 E-mail: sekretariat.cfvwspam prevention@uni-tuebingen.de Research Projects Can Software be 'responsible'? \tPlanning Grant, funded by the VolkswagenStiftung Hilbert Bernays Summerschool on Logic and Computation \tsupported by the German Academic Exchange Service (DAAD) Hilbert's 24th Problem,  \tfunded by the Portugese Science Foundation FCT (PTDC/MHC-FIL/2583/2014) Publications Link to list of publications Supervision of theses Courses SS 20: \"Die Grenzen der Berechenbarkeit – was Computer nicht können\", Blockveranstaltung im Rahmen des Studium Professionale, 3.-5.6.2020 SS 20: \"Mathematische Logik\", Blockveranstaltung, 16.-27.3.2020; Hörsaal 001, Keplerstr. 2 (HS 001 OSA) WS 19/20: Einführung in die Wisssenschaftstheorie Seit 2019 Carl Friedrich von Weizsäcker-Stiftungsprofessor für Theorie und Geschichte der Wissenschaften an der Universität Tübingen 2008-2018 Professor für mathematische Logik an der Universidade Nova de Lisboa 2015 und 2016 Gastprofessor an der Universidade Aberta 2003-2008 Professor für Mathematik an der Universidade de Coimbra 2008 (Portugiesische) Habilitation in Mathematik Universidade de Coimbra 2007 Habilitation in Informatik Universität Tübingen 1997 Promotion in Informatik Universität Bern 1993 Diplom in Mathematik LMU München 1987-1993 Studium der Mathmatik, Philosophie und Informatik in Göttingen, Zürich und München 1967 Geboren Einrichtung der Carl Friedrich von Weizsäcker-Stiftungsprofessur für Theorie und Geschichte der Wissenschaften Pressemitteilung der Universität Reutlinger General-Anzeiger Schwäbisches Tagblatt Informationsdienst Wissenschaft (idw) Daß ich erkenne, was die Welt Im Innersten zusammenhält",
  "content_length": 3925,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:25"
}