{
  "name": "Reinhard Wilhelm",
  "homepage": "http://rw4.cs.uni-saarland.de/people/wilhelm.shtml",
  "status": "success",
  "content": "Chair for Programming Languages and Compiler Construction > Home > People > Prof. Reinhard Wilhelm Navigation Research Awards Positions and Functions Publications Talks Miscellaneous Address News Latest Publication: \"Von Autopiloten, Taliban und dem Friedrichstadtpalast: Neue Einsichten eines Informatikers von geringem Verstande\" by R. Wilhelm Die Einsichten sind umgezogen R. Wilhelm recived: TCRTS 2020 Outstanding Technical Achievement and Leadership Award Latest Publication: \"Einsichten eines Informatikers von geringem Verstande\" by R. Wilhelm Recived the EMSOFT Test-of-Time Award 2019 for: \"Reliable and Precise WCET Determination for a Real-Life Processor (2001)\" by C. Ferdinand, R. Heckmann, M. Langenbach, F. Martin, M. Schmidt, H. Theiling, S. Thesing and R. Wilhelm Check out the 2014 CACM article \"Computation Takes Time, But How Much?\" by R. Wilhelm and D. Grund Teaching No Current Courses Announcement: Die Einsichten sind umgezogen: Ab sofort kannst Du/können Sie meine Glossen hier lesen Latest Publication: \"Von Autopiloten, Taliban und dem Friedrichstadtpalast: Neue Einsichten eines Informatikers von geringem Verstande\" by R. Wilhelm Prof. em. Dr. Dr. h.c. Reinhard Wilhelm Research Interests Timing Analysis for Real-Time Systems Static Program Analysis based on 3-valued logic, vulgo Shape Analysis Compiler Construction Algorithm Explanation Awards ESWEEK 2019 Test-of-Time Award: Reliable and Precise WCET Determination for a Real-Life Processor TCRTS 2020 Outstanding Technical Achievement and Leadership Award Positions and Functions Holder of the chair for Programming Languages and Compiler Construction at Saarland University (from April 1, 1978 until September 30, 2014) Scientific Director of Schloss Dagstuhl – Leibniz Center for Informatics (from 1990 to April 2014) Associate of AbsInt Angewandte Informatik GmbH Associate Editor of the Communications of the ACM Publications Check out my new Book: \"Von Autopiloten, Taliban und dem Friedrichstadtpalast: Neue Einsichten eines Informatikers von geringem Verstande\" [German] \"Einsichten eines Informatikers von geringem Verstande\" [German] 40 Jahre Saarbrücker Informatik, saargeschichte|n 2-2009 See the list of my (and some random Reinhards') publications in Google Scholar or publications in DBLP or citations in Citeseer. Selected Talks A Gentle Introduction to Static Program Analysis for Verification (AbsInt 2020) Geniale Ideen - PASCAL: Im Gespräch - Prof. Dr. Reinhard Wilhelm über Niklaus Wirth (Gesellschaft für Informatik e.V. 2019) [German] Timing Analysis and Timing Predictability (ARTIST Summer School 2008) Miscellaneous Credentials If you have a vacant position of a chief conductor, prime minister, circus director, or opponent in a Finnish PhD defence, here are my credentials. Travel Reports Biketrip through the Baltic Countries (Summer 2004) Biketrip through Southeast Poland (Summer 2007) [German] Estonia revisited (2014) Radreise auf dem Eurovelo 6 (2017) [German] Saarbrücker Hefte Bin ich gebildet? Internet 16. St. Ingberter Festival der Kleinkunst Ist der 1. FC Saarbahn am Ende? Campus Straßenschilda Tanz 2/96 Rohre verlegen, 3/96 Endlich eine Aufgabe für den Informatiker, 1/97 Die Leiden des ge(k)ränkten Mannes, 4/97 Die eigentliche Schwierigkeit, 5/97 Ersatzwährungen 2/98 Konsistente Umbenennung, 1/99 Lieber Rechten als Rechnen, 2/99 Zentrale Verschaffung 3/99 Gesetzgeberische Kreativität Address Prof. em. Dr. Dr. h.c. Reinhard Wilhelm Compiler Research Group FR. MI - Informatik Universität des Saarlandes Campus E1 3 Postfach 15 11 50 66041 Saarbrücken Building E1 3, Room 405 Germany Phone: +49 (0)681 - 302 - 3434 Fax: +49 (0)681 - 302 - 3065 E-Mail: wilhelm@cs.uni-saarland.de",
  "content_length": 3710,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:29"
}