{
  "name": "Reinhard von Hanxleden",
  "homepage": "https://www.rtsys.informatik.uni-kiel.de/en/team/rvh",
  "status": "success",
  "content": "Echtzeitsysteme/Eingebettete Systeme Unser Forschungsinteresse gilt dem systematischen Entwurf und der Analyse von Computern, die nicht primär als Computer wahrgenommen werden. Dies ist eine Definition von eingebetteten Systemen - die es in sehr unterschiedlichen Formen gibt, von Miniatur-Hörgeräten über Handys, Röntgengeräte und elektronisch unterstützte Bremssysteme bis hin zu großen Fly-by-Wire-Flugzeugen. Diese Systeme müssen in der Regel nicht nur exakte Ergebnisse an die Umgebung liefern, sondern auch pünktlich - daher werden sie auch als Echtzeitsysteme bezeichnet.Unsere Forschungsgruppe setzt sich für die Bereitstellung von Open-Source-Software ein, siehe auch Dokumentation zum Projekt KIELER bei GitHub. Prof. Dr. Reinhard von Hanxledenreinhard.vonhanxleden@informatik.uni-kiel.de+49 431 880-7281Christian-Albrechts-Platz 424118 KielRaum: 1117 (CAP 4) Ein Baustein der pragmatischen Modellierung ist die Trennung von Modell und Ansicht (View). Dies erfordert die Fähigkeit, automatisch angepasste Modellansichten zu synthetisieren, die auf verschiedene Anwendungsfälle zugeschnitten sind. Wir stellen eine Reihe von Layout-Algorithmen in der Open-Source-Bibliothek elkjs zur Verfügung, die zum Zeitpunkt der Erstellung dieses Artikels 1,6k Sterne auf Github hat und durchschnittlich 100k Downloads pro Tag verzeichnet.© RTSYS Unser besonderes Interesse gilt der pragmatischen Modellierung, bei der die Produktivität der Designer bei der Verwendung visueller und textueller Modellierungssprachen im Vordergrund steht. KIELER (KIEL for the Eclipse Rich Client Platform) ist eine prototypische Modellierungsumgebung für die experimentelle Validierung neuartiger Modellierungs- und Analysemethoden. Ein weiteres Beispielprojekt ist Lingua Franca, bei dem wir mit der UC Berkeley und anderen Institutionen zusammenarbeiten. Diese Familie von Programmiersprachen eignet sich besonders gut für den Entwurf sicherheitskritischer Echtzeitsysteme. Ein entscheidender Vorteil ist ihre deterministische Handhabung des reaktiven Kontrollflusses, einschließlich Nebenläufigkeit und Präemption. Ein besonderes Interesse gilt dem sequentiell-konstruktiven Modell von Berechnungen, das synchronen Determinismus mit den aus C bekannten Freiheiten der Programmierung verbindet. Ein Beispiel dafür ist die Modellierungssprache SCCharts, die z.B. für die Modellierung von Bahnsteuerungssystemen verwendet wird.© RTSYS Wir sind an der REAKT-Forschungsinitiative beteiligt, deren Ziel es ist, die Reaktivierung ländlicher Eisenbahnen durch die Entwicklung neuartiger, leichter und kostengünstiger Fahrzeug- und Infrastrukturkonzepte zu fördern. Dazu gehört die Entwicklung von autonomen Fahrzeugen und neuartigen Konzepten für den Zweirichtungsverkehr auf eingleisigen Strecken. Für diese Initiative wird die Eisenbahnforschungsstrecke Malente – Lütjenburg genutzt. Die REAKT-Initiative wird von der CAU Kiel geleitet und umfasst eine Reihe von akademischen Einrichtungen und Unternehmen. © ADDIX Prof. Dr. Reinhard von Hanxleden leitet die Arbeitsgruppe Echtzeitsysteme und Eingebettete Systeme. Mitarbeitende der Arbeitsgruppe M.Sc. Rajib Chandra DasEchtzeitsysteme / Eingebettete Systemerajib.chandra.das@informatik.uni-kiel.de+49 431 880-7297Christian-Albrechts-Platz 4D-24118 KielRaum: 1112 (CAP 4)Dr.-Ing. Sören DomrösEchtzeitsysteme / Eingebettete Systemesoeren.domroes@informatik.uni-kiel.de+49 431 880-7297Christian-Albrechts-Platz 424118 KielRaum: 1112 (CAP 4)Sascha Hoppe, Dipl.-Inf. (FH) Echtzeitsysteme / Eingebettete Systemesascha.hoppe@informatik.uni-kiel.de+49 431 880-7282Christian-Albrechts-Platz 424118 KielRaum: 1111 (CAP 4)M. Sc. Maximilian KasperowskiEchtzeitsysteme / Eingebettete Systememaximilian.kasperowski@informatik.uni-kiel.de+49 431 880-7525Christian-Albrechts-Platz 424118 KielRaum: 1118 (CAP 4)M.Sc. Daniel MäckelmannEchtzeitsysteme / Eingebettete Systemedaniel.maeckelmann@informatik.uni-kiel.deChristian-Albrechts-Platz 4D-24118 KielRaum: CAP 4 R.1111M. Sc. Jette PetzoldEchtzeitsysteme / Eingebettete Systemejette.petzold@informatik.uni-kiel.de+49 431 880-7525Christian-Albrechts-Platz 424118 KielRaum: 1118 (CAP 4)Sven Ole RatjensEchtzeitsysteme / Eingebettete Systemesven.ratjens@informatik.uni-kiel.deChristian-Albrechts-Platz 424118 KielRaum: 1118 (CAP 4)M.Sc. Niklas RentzEchtzeitsysteme / Eingebettete Systemeniklas.rentz@informatik.uni-kiel.de+49 431 880-7526Christian-Albrechts-Platz 424118 KielRaum: 1113 (CAP 4)Dr.-Ing. Alexander Schulz-RosengartenEchtzeitsysteme / Eingebettete Systemealexander.schulz-rosengarten@informatik.uni-kiel.de+49 431 880-7526Christian-Albrechts-Platz 424118 KielRaum: 1113 (CAP 4)Dr.-Ing. Christoph StarkeEchtzeitsysteme / Eingebettete Systemechristoph.starke@informatik.uni-kiel.de+49 431 880-5337Hermann-Rodewald-Straße 324118 KielRaum: 504a (HRS 3)Gesa SturmEchtzeitsysteme / Eingebettete Systemegesa.sturm@informatik.uni-kiel.de+49 431 880-7290Christian-Albrechts-Platz 424118 KielRaum: 1116 (CAP 4)Prof. Dr. Reinhard von HanxledenEchtzeitsysteme / Eingebettete Systemereinhard.vonhanxleden@informatik.uni-kiel.de+49 431 880-7281Christian-Albrechts-Platz 424118 KielRaum: 1117 (CAP 4) © Sascha Hoppe Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 5707,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:29"
}