{
  "name": "Reinhold Plösch",
  "homepage": "http://www.se.jku.at/ploesch",
  "status": "success",
  "content": "Reinhold Plösch – WIN-SE Skip to content A. Univ.-Prof. Mag. Dr.Associate Professor and Deputy Department Head+43 732 2468 4250reinhold.ploesch(at)jku.atRoom: S3 0081 AboutResearch ProjectsResearch SpotlightsPublications Reinhold Plösch was born and raised in Salzburg and studied Business Informatics in Linz. Having finished his study he started as researcher at the Department of Business Informatics – Software Engineering. He worked on different projects in the context of object-oriented programming for process control systems in the steel industry. Doctoral dissertation in 1994 with a work on prototyping. After his dissertation he was member of the Christian Doppler Laboratory for Software Engineering and involved in an EU-funded project with contributions in software development processes and prototyping. Intense work on constructive quality assurance techniques (contracts, scenarios, prototyping) that flowed into his habilitation project (habilitation in 2004). After his habilitation he started to establish the research area Software Quality at the Department of Business Informatics – Software Engineering. In this context close cooperation with research departments at Siemens Munich, Siemens India and in the context of a germany-funded project with Fraunhofer IESE, University of Stuttgart, Technical University Munich, Cap Gemini, SAP, etc. The intensive cooperation with Siemens also led to two research visits to India that were used to help introducing methods and tools for code quality management at Siemens India. Reinhold Plösch is inventor (together with others) of 10+ international patents. He focuses on leveraging AI technologies to address various Software Engineering tasks, including code documentation, unit-test generation and improvement, requirements quality assessment, and AI-supported software evolution and migration. His work emphasizes the integration of hybrid approaches that combine data from traditional software quality tools (e.g., SonarQube) with the capabilities of large language models like GPT-4 to enhance the effectiveness of AI-driven outputs. Additionally, he explores strategies for optimizing the collaboration between Software Engineers, conventional software engineering tools, and AI systems to ensure that professionals can maximize the benefits of these combined tools. Currently he is Scientific Director of the “Institut für Personal- und Organisationsentwicklung” (IPO) at the Johannes Kepler University Linz. The IPO is a know-how transfer institute with an emphasis on system and software engineering, innovative technologies, organizational process diagnoses, software quality, etc. Besides his teaching activities at the Johannes Kepler University (bachelor and master degree of business informatics and master degree of computer science) Mr. Plösch is lecturer at the University of Applied Science in Hagenberg. Reinhold Plösch is author of two books and of  130+ scientific publications in peer-reviewed journals or international conferences. Curriculum vitae Reinhold Plösch",
  "content_length": 3056,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:28"
}