{
  "name": "Reinhold Scherer",
  "homepage": "https://www.essex.ac.uk/people/scher51108/reinhold-scherer",
  "status": "success",
  "content": "Reinhold Scherer | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Reinhold Scherer People Professor Reinhold Scherer Head of Department - Professor (R) School of Computer Science and Electronic Engineering (CSEE) Email r.scherer@essex.ac.uk Location 1NW.5.3A, Colchester Campus Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Reinhold Scherer is a Professor of Brain-Computer Interfaces (BCI) and Neural Engineering (NE) at the University of Essex, where he also serves as Head of the School of Computer Science and Electronic Engineering (CSEE). His academic background includes a Dipl.-Ing. (MSc) degree earned in 2001, a Dr.techn. (PhD) in Telematics awarded in 2008, and a Habilitation in Applied Computer Science from Graz University of Technology (TU Graz), Austria, in 2016. From 2008 to 2010, he completed a postdoctoral fellowship at the Paul G. Allen School of Computer Science & Engineering at the University of Washington in Seattle, USA. He then returned to TU Graz, where he served as Assistant Professor (2010–2016) and later as Associate Professor (2016–2018) at the Institute of Neural Engineering. Between 2011 and 2018, he also held the position of Deputy Director at the same institute. Additionally, from 2005 to 2016, he was the Technical Director at the Institute for Neurological Rehabilitation and Research at the Clinic Judendorf-Straßengel in Austria. With over two decades of experience in non-invasive BCI and neural interface technologies, Prof. Scherer specializes in motor rehabilitation and assistive communication for individuals with motor impairments. A recognized leader in the field, he has significantly advanced the performance and usability of BCI systems and mobile neuroimaging technologies. His collaborative research has played a key role in the responsible co-development of BCI technologies, ensuring they are aligned with the real-world needs of end-users. His interdisciplinary research focuses on brain-machine co-adaptation, data analytics, and predictive modeling using artificial intelligence (AI). By applying systems engineering principles to neuroscience, he develops neurotechnologies that enhance motor and cognitive skill acquisition. His current projects include addressing math anxiety, improving post-stroke motor rehabilitation, developing predictive healthcare models, and optimizing care pathways for individuals with Alzheimer’s disease and comorbidities to support independence and reduce caregiver burden. He is also working on innovative communication tools for people with aphasia. Prof. Scherer has authored numerous scientific publications and holds several patents. He serves as an Associate Editor for Scientific Reports and Frontiers in Neuroprosthetics, and is the Vice President of the International BCI Society. Qualifications Dipl.-Ing. Dr.techn (PhD) Graz University of Technology, Diplom-Ingenieur Graz University of Technology, Appointments University of Essex Professor, School of Computer Science and Electronic Engineering, University of Essex (1/1/2019 - present) Head of School Computer Science and Electronic Engineering, University of Essex (1/4/2022 - present) Other academic Associate Professor, Neural Engineering, Graz University of Technology (1/9/2016 - 31/12/2018) Assistant Professor, Graz University of Technology (1/11/2011 - 31/8/2016) Postdoctoral research fellow, Department of Computer Science, University of Washington (1/5/2008 - 30/5/2010) Research Associate, University of Graz (1/10/2007 - 30/4/2008) Research and professional activities Research interests Brain-Computer Interfaces Thought-based interaction with the physical world - Brain-Computer Interfaces (BCIs) translate brain signals directly into action. Motor activity is no longer required. Thoughts trigger actions. BCI research aims at providing physically disabled people communication tools that allow them to live an independent life and remain part of society. The primary goal of my research is to enhance usability and practicality of BCIs that detect changes in spontaneous noninvasive electroencephalogram (EEG) rhythms. Ultimate goal is the development of a reliable brain-switch signal that allows users 24/7 on-demand thought-based access to communication technologies. Using a BCI typically requires training. I am interested in optimizing human-machine interaction and in finding effective and efficient training paradigms. For both, human and machine. Key words: Brain-Computer Interface Open to supervise Statistical and adaptive signal processing Many applications, including brain-computer interfacing (BCI), require extracting relevant information from noisy signals and/or interpreting the uncertain information. I am interested in model based estimation methods for time-varying systems and in developing estimators/controllers where adaptive features are needed to handle uncertainties. Moreover, I am interested in transfer learning and findings stationary subspaces in multivariate data. Key words: signal processing Open to supervise Mobile brain and body imaging A more comprehensive knowledge of neuro-oscillatory mechanisms will lead to better understanding and interpretation of brain rhythms. To this end, it is essential to isolate specific behavior and study the related rhythms individually. It is, however, also important to study the brain behaving naturally in familiar environments. I am interested in studying the behaving brain in natural environment. Open to supervise Technology-mediated rehabilitation Directed and early rehabilitation after brain injury (e.g. stroke) aims at promoting neuroplasticity, i.e., inducing (sub)cortical reorganization for minimizing motor impairment. Long term rehabilitation significantly improves motor function. Some unique contributions of robotic therapy versus conventional therapies are that robots can be used as valuable adjuncts to save time and energy for the therapist, making rehabilitation sessions more efficient, and that rehabilitation protocols can be very precisely tailored to individual patients with only as much assistance provided as needed. I am interested in studying the interplay between therapeutic intervention, brain activity pattern and functional outcome for improving motor rehabilitation. Open to supervise Assistive technology | How can we help people with disabilities to perform tasks and activities of daily living independently? I am interested in developing novel human-machine interaction technology that support the disabled and allows regaining some degree of independence. Open to supervise Teaching and supervision Current supervision Cristina Del Prete Degree subject: Computer Science Degree type: Doctor of Philosophy Joshua George Mullett Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Constantina Maltezou Thesis title: Communication of Trustworthiness in Human and Synthesised Speech Degree subject: Psychology Degree type: Doctor of Philosophy Awarded date: 17/10/2025 Federica Armani Thesis title: Physiological Correlates of Math Anxiety for Neuroadaptive Learning Systems Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 30/9/2024 Themis Nikolas Efthimiou Thesis title: A Spark of Emotion: The Impact of Electrical Facial Muscle Activation on Emotional State and Affective Processing Degree subject: Psychology Degree type: Doctor of Philosophy Awarded date: 25/1/2024 Publications Publications (7) Handley, M., Windle, G., Mathie, E., Greco, H-A., Underwood, B., Surr, C., Dening, KH., Milton, S., Pujari, A., Lebcir, RM., Lynch, J., Beishon, L., Sampson, EL., Scherer, R. and Goodman, C., (2025). Living with dementia and other long-term conditions: what works for patient/caregiver dyads? A realist review Scherer, R., Jamalifard, M., Underwood, BR., Lewis, JR., Skea, A., Mathie, E., Dening, KH., Milton, S., Surr, C., Lebcir, RM., Pujari, AN., Free, RC., Leng, TY., Craven, M., Beishon, L., Keevil, VL., Goodman, C. and Handley, M., (2025). Understanding dynamics to Streamline Access: Systems Engineering and Agent-Based Probabilistic Modelling in Memory Assessment Services Penovski, R., Srčič, S. and Scherer, R., (2025). The landscape of Artificial Intelligence Driven Digital Platforms in Healthcare and Life Sciences: A Scoping Review Towards Universal Integration (Preprint) Penovski, R., Srčič, S. and Scherer, R., (2025). Blueprint for a Universal Artificial Intelligence-Driven Digital Platform in Healthcare and Life Sciences – From Vision to Implementation (Preprint) Basso, G., Scherer, R. and Barros, MT., (2024). Embodied Biocomputing Sequential Circuits with Data Processing and Storage for Neurons-on-a-chip Baker, J., Efthimiou, TN., Scherer, R., Gartus, A., Elsenaar, A., Mehu, M. and Korb, S., (2023). Measurement of the N170 during facial neuromuscular electrical stimulation (fNMES) Masse",
  "content_length": 47286,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:26"
}