{
  "name": "Reinhard Pichler",
  "homepage": "https://www.dbai.tuwien.ac.at/staff/pichler",
  "status": "success",
  "content": "Reinhard Pichler Skip to Content Top-level Navigation: Staff Education research Contact Services Current-level Navigation: Path: DBAI > staff > Reinhard Pichler Tools: Drucken Prof. Dr. Reinhard Pichler E-mail: reinhard.pichler@tuwien.ac.at Address: Institute of Logic and Computation Databases and Artificial Intelligence Group (DBAI) Technische Universität Wien Favoritenstrasse 9-11/3.Stock A-1040 Wien Phone:  (+43 1) 58801 / 192200 Office hours: by appointment (please send me a short mail) Courses in the Winter Term 2025/26 VU Theoretische Informatik (192.017) VU Complexity Theory (192.165) VU Introduction to Quantum Computing, Complexity Theory, and Algorithmics (192.042) VU Quantum Computing, Complexity Theory, and Algorithmics (192.043) SE Wissenschaftliches Arbeiten (group 192-02 of 193.052 ) IT-Projekte für Jugendliche (192.055) Praktika, Seminare, Bachelorarbeit Courses in the Summer Term 2025 Datenbanksysteme Vertiefung resp. Advanced Database Systems (184.780) Seminar aus Datenbanken (181.201) Seminar in Complexity Theory (184.687) IT-Projekte für Jugendliche (192.055) Praktika, Seminare, Bachelorarbeit Publications Please refer to DBLP Curriculum Vitae I got a master's degree from the University of Innsbruck (Mag.rer.nat. in Mathematics, 1991), another master's degree from the University of London (MSc in Mathematical Computation, 1992, at the Queen Mary College), and a PhD from the TU Wien (Dr.techn. in Computer Science, 2000). In 2001, I received my \"habilitation\" in Theoretical Computer Science. From 1992 to 2005, I worked in the Program and Systems Engineering Department (PSE) of the Siemens AG Österreich. Since July 2005, I have been a professor in the Databases and Artificial Intelligence Group (DBAI) of the TU Wien. Home / Kontakt / Webmaster / Offenlegung gemäß § 25 Mediengesetz: Inhaber der Website ist das Institut für Logic and Computation an der Technischen Universität Wien, 1040 Wien. Die TU Wien distanziert sich von den Inhalten aller extern gelinkten Seiten und übernimmt diesbezüglich keine Haftung. Disclaimer / Datenschutzerklärung Last modified 9 September, 2025",
  "content_length": 2124,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:26"
}