{
  "name": "Remo Rohs",
  "homepage": "https://rohslab.usc.edu",
  "status": "success",
  "content": "The Rohs Lab | Quantitative and Computational Biology | University of Southern California top of pageThe Rohs LabDepartment of Quantitative and Computational Biology University of Southern CaliforniaLearn MoreAboutWelcome to the Rohs LabAbout our Computational Biology and Bioinformatics research group Main FocusThe main focus of the Rohs lab is the understanding of molecular interactions based on three-dimensional structure. Who Can JoinProfessor Rohs primarily accepts students from the academic programs of the QCB Department. This includes the Ph.D. Program in Computational Biology and Bioinformatics. Professor Rohs can also advise students from the Departments of Chemistry, Physics & Astronomy, Computer Science and Biomedical Engineering. Primary GoalWe currently work on three research topics: (1) protein-DNA binding specificity, (2) structure-based drug design, and (3) RNA structure. The primarily goal is to use three-dimensional structure and sequence to reveal readout mechanisms across multiple scales. We use a combination of different approaches to understand readout and binding mechanisms.This includes artificial intelligence, machine learning, statistics, biophysics, molecular simulations, and wet-lab experiments such as crystallography and high-throughput sequencing.\"- Remo Rohs, Ph.D. Selected PublicationsR. Mitra, A.S. Cohen, W.Y. Tang, et al.: RNAproDB: a webserver and interactive database for analyzing protein-RNA interactions. J. Mol. Biol. 437, 169012 (2025)Y. Wang, et al.: DNAdesign: feature-aware in silico design of synthetic DNA through mutation. Bioinformatics 41, btaf052 (2025)R. Mitra, et al.: Geometric deep learning of protein-DNA binding specificity. Nat. Methods 21, 1674-1683 (2024)J.A. Weller, et al.: Structure-based drug design with a deep hierarchical generative model. J. Chem. Inf. Model. 64, 6450-6463 (2024)J.M. Sagendorf, et al.: Structure-based prediction of protein-nucleic acid binding using graph neural networks. Biophys. Rev. 16, 297-314 (2024)R. Mitra, A.S. Cohen, et al.: DNAproDB: an updated database for the automated and interactive analysis of protein-DNA complexes. Nucleic Acids Res. 53, D396-D402 (2025)J. Li, et al.: Predicting DNA structure using a deep learning method Nat. Commun. 15, 1243 (2024)B.H. Cooper, et al.: DNA binding specificity of all four Saccharomyces cerevisiae forkhead transcription factors. Nucleic Acids Res. 51, 5621-5633 (2023)T.P. Chiu, et al.: Physicochemical models of protein-DNA binding with standard and modified base pairs. Proc. Natl. Acad. Sci. USA 120, e2205796120 (2023)Read MoreLatest NewsCrunching Codes, Crafting Cures - Dornsife Magazine Profile of Dr. Remo RohsHow USC Dornsife is writing the formula for the future of medicine. https://dornsife.usc.edu/magazine/crunching-codes-crafting-cures/USC Researchers Develop AI Model That Predicts the Accuracy of Protein-DNA BindingA new artificial intelligence model developed by USC researchers and published in Nature Methods can predict how different proteins may...Read MoreBy The Numbers14Current Lab Members13Graduated Ph.D. Students92Published Peer-Reviewed Papers2010Est. at University of Southern California6Academic Department AffiliationsLab AffiliationsDepartment of Qualitative and Computational BiologyDepartment of Chemistry ​Department of Physics and AstronomyThomas Lord Department of Computer ScienceAlfred E. Mann Department of Biomedical EngineeringDivision of Oncologybottom of page",
  "content_length": 3467,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:32"
}