{
  "name": "Renato Figueiredo",
  "homepage": "https://engineering.oregonstate.edu/people/renato-figueiredo",
  "status": "success",
  "content": "Renato Figueiredo | College of Engineering | Oregon State University Skip to main content Facilities People Tools & Services Units Chemical, Biological, and Environmental Engineering Civil and Construction Engineering Electrical Engineering and Computer Science Mechanical, Industrial, and Manufacturing Engineering Nuclear Science and Engineering Biological & Ecological Engineering About Academics Research Alumni & Partners Renato Figueiredo Renato Figueiredo Professor Organizations Electrical Engineering and Computer Science Email renato.figueiredo@oregonstate.edu Address 4103 Kelley Engineering Center Corvallis, OR 97331 United States Research Website renatof.github.io/ Degrees Ph.D., Computer Engineering, Purdue University, 2001 M.S., Electrical Engineering, University of Campinas, Brazil, 1995 B.S., Electrical Engineering, University of Campinas, Brazil, 1994 Research Groups Networking and Computer Systems Biography Renato J. Figueiredo is a Professor in the School of EECS at Oregon State University, where he leads research on distributed systems and cyberinfrastructure (CI). His main interests are in resource virtualization techniques applied across the continuum from edge to cloud computing, and their use as foundations for CI supporting interdisciplinary team-science to advance solutions to pressing issues in the environment and society, in particular freshwater resources and biodiversity. Figueiredo graduated with a Ph.D. in ECE from Purdue University in 2001, joined Northwestern University as an Assistant Professor in 2001, and subsequently the ECE Department at the University of Florida from 2002-2024. He was also a sabbatical visiting researcher in the CS department at Vrije Universiteit (the Netherlands) in 2012-2013, and was promoted to Full Professor at UF in 2015. His research has been funded by government and industry sponsors; he has served as PI/Co-PI/senior personnel in over 50 awards that include the National Science Foundation, Intel Corp., IBM Corp., NOAA, DOE, and NASA. He has also served as Technical Program Committee Co-Chair for the International Conference on Autonomic Computing (ICAC, 2010) and the International Symposium on High-Performance Parallel and Distributed Computing (HPDC, 2013), and site co-director of the NSF Industry/University Cooperative Research Center (I/UCRC) for Cloud and Autonomic Computing (CAC) from 2008-2013. Awards/Accolades 2017 University of Florida Term Professorship 2012 ACM HPDC Symposium, One of the 22 “Best papers of HPDC 1992-2012” 2008 WETICE COPS Symposium, Best Paper Award 2008 ACM HPDC Symposium, Best Paper Award 2007 IBM Faculty Award 2000 Society of Hispanic Professional Engineers and Purdue University, Maria Canto Neuberger Award",
  "content_length": 2743,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:41"
}