{
  "name": "Renato Mancuso 0001",
  "homepage": "http://cs-people.bu.edu/rmancuso",
  "status": "success",
  "content": "Renato Mancuso - Personal Webpage Home about news selected publications all publications teaching Honors and awards current students research expertise research projects online resources travels Renato Mancuso Associate Professor Renato Mancuso Associate Professor Renato Mancuso Associate Professor Briefly I am an associate professor in the department of Computer Science at Boston University (BU) and the director of the BU Cyber-Physical Systems Lab (CPSLab@BU). I am also affiliated with the BU Dept. of Electrical and Computer Engineering. I received my Ph.D. from the University of Illinois at Urbana-Champaign (UIUC) in 2017. My research focuses on real-time and embedded systems. I am especially interested in partially-reconfigurable platforms and OS-level multi-core resource management technologies for high-performance, safety-critical systems. I am also interested in applications and methodologies to design, deploy and analyze Cyber-Physical Systems (CPS), and in real-time cloud computing. My research also touches on aspects of security for embedded systems and technologies for UAVs. I am currently looking for motivated master and Ph.D. students who would like to work with me. If you are one those, please contact me! Renato MancusoAssociate Professor Contact me Office:CCDS 740 (7th floor) Phone:+1 (617) 358-8537 Email:rmancuso@bu.edu Address:665 Commonwealth Ave, Boston MA 02215 Updates and News Oct. 2025 Our demo paper \"Toward Commodity Fine-grained Performance Tracing on ARM-based SoC/FPGA platforms\" has been accepted to the IEEE RTSS'25 Brief Presentations Track. Read the PDF here. Sept. 2025 Our paper \"MemScope: Open-Source Kernel-Level Framework for Heterogeneous Memory Characterization\" has been accepted to appear at IEEE RTSS'25 . Read the PDF here. Aug. 2025 I am on sabbatical leave until the end of Fall 2025. July 2025 I was invited to visit the CRIStAL research center in Lille, France by Prof. Lipari where I delievered the talk titled \"Turning Timeliness into a Controllable Dimension.\" June 2025 Our paper titled \"Closing the Intent-to-Reality Gap via Fulfillment Priority Logic\" has been accepted to appear at IROS'25. Read the PDF here . June 2025 Bassel El Mabsout defended his Ph.D. thesis \"Minimizing the Intent-to-Reality Gap in Robot Learning: A Fulfillment-Centric Perspective\" Commitee: Kate Saenko (BU), Sabrina Neuman (BU), Bingzhuo Zhong (HKUST-GZ). Deepest congratulations for this important career milestone! June 2025 Our paper titled \"RT-Bench: A Long Overdue Update\" has been accepted to appear at the OSPERT'25 workshop. Read the PDF here . June 2025 Our paper titled \"UltraScale+ SpinalHDL Wrapper: Streamlining Ideas to Bitstream on UltraScale+ platforms\" has been accepted to appear at the OSPERT'25 workshop. Read the PDF here . June 2025 Our paper titled \"Micro-architectural Exploration of the Relational Memory Engine in RISC-V and FireSim\" is accepted to appear at the ADMS'25 workshop. This is joint work with Prof. Athanassoulis (BU) and Prof. Yun (KU). Read the PDF here . May 2025 Our Ignition Award application titled \"Burning Fetch Execution: A Framework for Zero-Trust Multi-Party Confidential Computing\" has been selected for funding. April 2025 It's official! I have joined the Scientific Advisory Board of the Neobotics Foundation led by my former student Koneshka Bandyopadhyay, a non-profit organization poised to revolutionize autonomous vehicle education. Mar. 2025 Our paper \"Surgical Software-less I/O Virtualization\" has been accepted to appear at RAGE'25. Read the PDF here . Feb. 2025 Our pre-print titled \"Light Virtualization: a proof-of-concept for hardware-based virtualization\" proposing the use of FPGAs to enable software-less memory virtualization is available on ArXiv. Read the PDF here . Jan. 2025 I am invited to serve as co-chair for the Education Classes (EC) session at ESWEEK'25 . Jan. 2025 Rolling out the new CS-391 \"Computer & Memory Architectures\" course at BU. This is also the first undergraduate-level architecture course designed to become a regular addition to the CS curriculum. Jan. 2025 Our paper titled \"Flight Testing Instrumentation Development and Integration for a Subscale Integrated High Lift Propulsor Testbed\" has been accepted to appear at the AIAA SciTech 2025 Forum . Read the PDF here . Dec. 2024 Our paper \"Coherence-Aided Memory Bandwidth Regulation\" received the Best Paper Award at IEEE RTSS'24 . Read the PDF here. Dec. 2024 Our Red Hat Collaboratory project titled \"Foundations of Hypervisorless Virtualization Technology in High-performance Systems\" was selected to be funded. We are very thankful for the support! Dec. 2024 Shahin Roozkhosh successfully defended his Ph.D. thesis titled \"AlterWare: When Hardware Becomes Soft.\" Commitee members: Rich West (BU), Jonathan Appavoo (BU), Heechul Yun (KU). Deepest congratulations for this important career milestone! Nov. 2024 Our project titled \"Burning Fetch Execution: A Framework for Zero-Trust Multi-Party Confidential Computing\" received the best demo presentation award for Challenge 6 \"Zero-Trust Platform, System, and Communication Architecture [...]\" at the TII Genzero workshop. Nov. 2024 The F1-tenth team of the BU ACRO student club that I advise received the silver medal at the autonomous racing competition hosted as part of the Learning to Trust Autonomy Workshop. Nov. 2024 We are presenting the first demo of our take on confidential computing at the TII Genzero workshop with the project titled \"Burning Fetch Execution: A Framework for Zero-Trust Multi-Party Confidential Computing\". Oct. 2024 The technical program of RTNS'24 that I am co-chairing is officially online! This year, the conference will be a 3-days event. Oct. 2024 I am invited to serve as the Local Arrangements Chair for IEEE RTSS'25 which will be hosted at Boston University. Sep. 2024 Our paper titled \"Burning Fetch Execution: A Framework for Zero-Trust Multi-Party Confidential Computing\" has been selected for presentation at the GENZERO 2024 Workshop. Aug. 2024 It's official! The BU F1Tenth Autonomous Racing Organization (ACRO) is born. BU ACRO is a student-led club revolving around the definition of competition-grade autonomous racing software/hardware stack. I am delighted to serve as the PI of BU ACRO. Aug. 2024 I am a co-organizer for the \"Learning to Trust Autonomy Workshop\" (see details here). The event will also host a F1Tenth autonomous racing competition. Aug. 2024 Our paper \"Coherence-Aided Memory Bandwidth Regulation\" has been accepted to appear at IEEE RTSS'24 . Read the PDF here. July 2024 Our project \"Effortless Data Locality Through Near-memory On-the-fly Data Transformation\" is awarded funding from the National Science Foundation (NSF). See abstract here . Thanks for the support! This is a collaborative project with Manos Athanassoulis (BU) and Heechul Yun (KU). July 2024 I am invited to serve as the artifact evaluation committee chair of DSN 2025. . July 2024 I am invited to serve as the program committee chair of ECRTS 2025. which will be hosted in Brussels, Belgium. July 2024 Our paper \"Unified Local-Cloud Decision-Making via Residual Reinforcement Learning\" has been accepted to appear at ECCV 2024. Read the PDF here . June 2024 Our paper \"The Omnivisor: A real-time static partitioning hypervisor extension for heterogeneous core virtualization over MPSoCs\" has cleared artifact evaluation and a demo of the work will be presented at ECRTS 2024. Read the PDF here, and find the code here. May 2024 Our paper \"MCTI: Mixed-Criticality Task-based Isolation\" has been accepted for publication in the Real-Time Systems Journal. Read the PDF here. May 2024 I was awarded the 2024 ACM SIGBED Early Career Researcher Award which is conferred to one junior researcher per year for outstanding contribution in the area of embedded, real-time, and cyber-physical systems. May 2024 Our paper \"MemPol: Polling-Based Microsecond-Scale Per-Core Memory Bandwidth Regulation\" has been accepted for publication in the Real-Time Systems Journal. Read the PDF here. May 2024 I am promoted to the rank of Associate Professor with tenure in the Computer Science Department at Boston University. May 2024 Shahin Roozkhosh, a Ph.D. student in my CPSLab@BU, successfully cleared his Ph.D. Thesis Proposal. May 2024 Our paper \"The Omnivisor: A real-time static partitioning hypervisor extension for heterogeneous core virtualization over MPSoCs\" has been accepted to appear at ECRTS 2024. Read the PDF here . May 2024 Shahin Roozkhosh, a Ph.D. student in my CPSLab@BU, was awarded the BU Computer Science Research Excellence Award. Congratulations! Apr. 2024 Our paper \"Shared Resource Contention in Low-end MCUs: A Reality Check and the Quest for Timeliness\" has been accepted to appear at ECRTS 2024. Read the PDF here . Apr. 2024 Our paper \"Effortless Locality on Data Systems using Relational Fabric\" is accepted for publication in IEEE Transactions on Knowledge and Data Engineering (IEEE TC) . Read the PDF here. Mar. 2024 Denis Hoornaert (TUM) visited our Cyber-Physical Systems Lab and delivered the first talk about our collaborative work titled \"On-the-fly Reorganization of High-Order Data Objects to Achieve Effortless Locality\" at the BU Systems Seminar. Mar. 2024 We have concluded the first round of reviews for ACM RTNS'24 which this year I am chairing together with Patrick Meumeu Yomsi (CISTER). Two more rounds to go! Feb. 2024 I am invited to serve on the Technical Program Commitee of IEEE RTSS'24 . Feb. 2024 I am invited to serve on the program committee of ACM SIGBED EMSOFT'24 . Jan. 2024 I am invited to serve on the program committee of the Real-time And intelliGent Edge computing workshop (RAGE 2024 ) Jan. 2024 I am invited to serve on the program committee of ECRTS 2024. Dec. 2023 Bosch GmbH made a donation to our group for research on compartmentalization of safety-critical subsystems in heterogeneous platforms. Thanks for the support! Dec. 2023 The research cond",
  "content_length": 54356,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:44"
}