{
  "name": "Renata P. M. Fortes",
  "homepage": "http://conteudo.icmc.usp.br/pessoas/renata",
  "status": "success",
  "content": "Renata Pontin de Mattos Fortes Home-Page Renata Pontin de Mattos Fortes Associate Professor, Computer Science Department at University of São Paulo. E-mail: renata at icmc dot usp dot br - alternative e-mail: rfortes at acm dot org My short resumé and my CV-Lattes [Contact] | [Education] | [Research] | [Publications] | [Courses] | [Other] | Livre Docente (habilitation) at ICMC-USP, 2007 Visiting Scholar at Georgiatech - Jan./2000 to Jan./2001 with prof. Gregory Abowd D.Sc. in Computational Physics at IFSC-USP, 1996 - supervisor prof. Alvaro Garcia Neto M.Sc in Computer Science at ICMSC-USP, 1991 - supervisor prof. Paulo Cesar Masiero B.Sc in Computer Science at ICMSC-USP, 1982 Research Interests: PorSimples - Simplificacao de textos em Portugues na Web - a project supported by FAPESP and Microsoft Research SAFE - Software Engineering Available for Everyone - a framework of software process based on Open Software webtools Accessibility and Usability for Web Engineering projects and tools - aim at building software infrastructure for supporting good practices and activities in the context of web development Software Engineering - software specification issues and software process control Hypermedia Development - modelling and evaluation of hypermedia applications The synergy between Software Engineering, Human-Computer Interaction and Hypermedia as an approach boosting the understanding of the new software development processes Research Groups: Software Engineering group - LabES Intermídia group - Intermidia Lab. Research with my students: Dissertations and Thesis. Research Help: information from ISI (Institute for Scientific Information) about publications, and Scientific Commons (a community for Scientific Information). A brief description of tips to make a good job reading scientific papers (in Portuguese): \"dicas de leitura\". Courses (recent ones; all in Portuguese): COTEIA_Wiki SCE5811 Hipermidia - pós-graduação. Experience / Skills: Software Analyst - ELEBRA -TELECOM (Eletronica Brasileira - Telecomunicações e Controle); São Paulo- SP, 1987.Atualmente, ALCATEL Brasil. Software Analyst - ALCAN (Alunordeste- Aluminio do Brasil - Nordeste S/A); Candeias - BA, Centro Industrial de Aratu (CIA), 1985. System Analyst - SERPRO (Serviço Federal de Processamento de Dados - Centro de Tratamento de Informações); Osasco - SP, 1984. and my children :-) Contact [renata @ icmc.usp.br] or [rfortes @ acm.org] University of São Paulo Department of Computer Science - SCC - ICMC - USP C. P. 668 - 13560-970 São Carlos, SP - Brasil tel: 55 (16 3373.9655) or (16 3373.9658 - my office) room number: 3-248 (2nd floor) edited by Renata Interaction-Design.org",
  "content_length": 2682,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:40"
}