{
  "name": "Renato Cordeiro de Amorim",
  "homepage": "https://www.essex.ac.uk/people/corde69103/renato-amorim",
  "status": "success",
  "content": "Renato Amorim | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Renato Amorim People Dr Renato Amorim Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email r.amorim@essex.ac.uk Location 5B.538, Colchester Campus Academic support hours Tuesdays: 15:00 to 16:00 Thursdays: 15:00 to 16:00 Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Qualifications PhD Birkbeck, University of London, (2011) Research and professional activities Research interests Automatic feature weighting in clustering of large data sets Key words: Unsupervised learning Open to supervise Unsupervised feature selection Key words: Feature Selection Open to supervise Machine Learning Key words: Data Science Open to supervise Exploratory data analysis Key words: Data Analysis Open to supervise Teaching and supervision Current teaching responsibilities Team Project Challenge (CE201) Introduction to Programming in Python (CE705) Current supervision Reyhaneh Hashempour Degree subject: Computer Science Degree type: Doctor of Philosophy Richard James Fawley Degree subject: Computer Science Degree type: Doctor of Philosophy Julian Andrew Forrester Thesis title: Strongly Typed Cartesian Genetic Programming and its Applications Degree subject: Computer Science Degree type: Doctor of Philosophy Ashish Bhatia Thesis title: Explainability and Efficiency in Fuzzy Logic: Frameworks for Temporal Classification, Monotonicity, and Hybrid Predictive Modelling Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Simon Richard Harris Thesis title: K-Means Initialisation Algorithms: An Extensive Comparative Study Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 26/4/2021 Publications Publications (3) Amorim, RCD. and Makarenkov, V., (2025). Improving clustering quality evaluation in noisy Gaussian mixtures Hashempour, R., Plank, B., Villavicencio, A. and Amorim, RCD., (2024). A Deep Learning Approach to Language-independent Gender Prediction on Twitter Amorim, RCD., (2023). On large sum-free sets: revised bounds and patterns Journal articles (23) de Aquino, RDG., Verri, FAN., de Amorim, RC. and Curtis, VV., (2025). SLEDgeHammer: A Frequent Pattern-Based Cluster Validation Index for Categorical Data. Mathematics. 13 (17), 2832-2832 Rykov, A., Cordeiro De Amorim, R., Makarenkov, V. and Mirkin, B., (2024). Inertia-Based Indices to Determine the Number of Clusters in K-Means: An Experimental Evaluation. IEEE Access. 12, 11761-11773 Cordeiro de Amorim, R., (2024). On Large Sum-Free Sets: Revised Bounds and Patterns. Mathematics. 12 (24), 3889-3889 Chowdhury, S., Helian, N. and Amorim, R., (2023). Feature weighting in DBSCAN using reverse nearest neighbours. Pattern Recognition. 137, 109314-109314 Amorim, R., (2023). On Sum-Free Subsets of Abelian Groups. Axioms. 12 (8), 724-724 Amorim, R. and Makarenkov, V., (2023). On k-means iterations and Gaussian clusters. Neurocomputing. 553, 126547-126547 Harris, S. and Cordeiro De Amorim, R., (2022). An extensive empirical comparison of k-means initialisation algorithms. IEEE Access. 10, 58752-58768 Amorim, R. and Makarenkov, V., (2021). Improving cluster recovery with feature rescaling factors. Applied Intelligence. 51 (8), 5759-5774 Benayas, A., Hashempour, R., Rumble, D., Jameel, S. and De Amorim, RC., (2021). Unified Transformer Multi-Task Learning for Intent Classification With Entity Recognition. IEEE Access. 9, 147306-147314 Amorim, R. and Lopez Ruiz, CD., (2021). Identifying meaningful clusters in malware data. Expert Systems with Applications. 177, 114971-114971 Cordeiro de Amorim, R., Makarenkov, V. and Mirkin, B., (2020). Core clustering as a tool for tackling noise in cluster labels. Journal of Classification. 37 (1), 143-157 Cordeiro de Amorim, R., (2019). Unsupervised feature selection for large data sets. Pattern Recognition Letters. 128, 183-189 Panday, D., Amorim, RC. and Lane, P., (2018). Feature weighting as a tool for unsupervised feature selection. Information Processing Letters. 129, 44-52 Cordeiro de Amorim, R., Shestakov, A., Mirkin, B. and Makarenkov, V., (2017). The Minkowski central partition as a pointer to a suitable distance exponent and consensus partitioning. Pattern Recognition. 67, 62-72 Cordeiro de Amorim, R., Makarenkov, V. and Mirkin, B., (2016). A-Wardpβ: Effective hierarchical clustering using the Minkowski metric and a fast k-means initialisation. Information Sciences. 370-371, 343-354 Amorim, RC. and Makarenkov, V., (2016). Applying subclustering and Lp distance in Weighted K-Means with distributed centroids. Neurocomputing. 173 (P3), 700-707 Amorim, RC., (2016). A survey on feature weighting based K-Means algorithms. Journal of Classification. 33 (2), 210-242 Amorim, RC. and Hennig, C., (2015). Recovering the number of clusters in data sets with noise features using feature rescaling factors. Information Sciences. 324, 126-145 Amorim, RC., (2015). Feature Relevance in Ward's Hierarchical Clustering Using the L (p) Norm. Journal of Classification. 32 (1), 46-62 Cordeiro de Amorim, R. and Mirkin, B., (2012). Minkowski metric, feature weighting and anomalous cluster initializing in K-Means clustering. Pattern Recognition. 45 (3), 1061-1075 Amorim, R., Mirkin, B. and Gan, JQ., (2012). Anomalous pattern based clustering of mental tasks with subject independent learning – some preliminary results. Artificial Intelligence Research. 1 (1), 55-55 de Amorim, RC., (2009). . Information Processing & Management. 45 (4), 490-493 Wermter, S. and de Amorim, RC., (2009). . Cognitive Systems Research. 10 (4), 377-379 Show all Book chapters (8) de Amorim, RC., Tahiri, N., Mirkin, B. and Makarenkov, V., (2017). A Median-Based Consensus Rule for Distance Exponent Selection in the Framework of Intelligent and Weighted Minkowski Clustering. In: Data Science. Springer, Cham. 97- 110. 9783319557229 Cordeiro De Amorim, R. and Mirkin, B., (2016). A clustering based approach to reduce feature redundancy. Springer de Amorim, RC. and Mirkin, B., (2015). A clustering based approach to reduce feature redundancy. In: Knowledge, Information and Creativity Support Systems: Recent Trends, Advances and Solutions. Springer. 465- 475. 9783319190891 de Amorim, RC. and Komisarczuk, P., (2014). Partitional Clustering of Malware using K-Means. In: Cyberpatterns: Unifying Design Patterns with Security and Attack Patterns. Springer. 223- 233. 9783319044460 de Amorim, RC. and Komisarczuk, P., (2014). Towards effective malware clustering: reducing false negatives through feature weighting and the Lp metric. In: Case Studies in Secure Computing - Achievements and Trends. Editors: . CRC Press. 295- 310 Cordeiro De Amorim, R. and Mirkin, B., (2014). Selecting the Minkowski Exponent for Intelligent K-Means with Feature Weighting. Springer Cordeiro De Amorim, R. and Komisarczuk, P., (2014). Towards effective malware clustering: reducing false negatives through feature weighting and the Lp metric. CRC Press de Amorim, RC. and Mirkin, B., (2013). Selecting the Minkowski exponent for intelligent K-Means with feature weighting. In: Clusters, orders, trees: methods and applications. Springer. 103- 117. 9781493907410 Show all Conferences (20) Hashempour, R., Plank, B., Villavicencio, A. and Amorim, R., A Deep Learning Approach to Language-independent Gender Prediction on Twitter Raza, H., Rathee, D., Amorim, R. and Fasli, M., (2024). Optimizing Patient Care Pathways: Impact Analysis of an AI-Assisted Smart Referral System for Musculoskeletal Services Chowdhury, S. and Amorim, R., (2019). An Efficient Density-Based Clustering Algorithm Using Reverse Nearest Neighbour Zampieri, M. and de Amorim, RC., (2014). Between Sound and Spelling: Combining Phonetics and Clustering Algorithms to Improve Target Word Recovery Puttaroo, M., Komisarczuk, P. and de Amorim, RC., (2014). Challenges in developing Capture-HPC exclusion lists de Amorim, RC., (2013). An Empirical Evaluation of Different Initializations on the Number of K-means Iterations Austing, A., de Amorim, RC. and Griffin, A., (2013). Targeted tutorials and the use of ASSIST to support student learning Puttaroo, M., Komisarczuk, P. and de Amorim, RC., (2013). ON DRIVE-BY-DOWNLOAD ATTACKS AND MALWARE CLASSIFICATION de Amorim, RC. and Zampieri, M., (2013). Effective Spell Checking Methods Using Clustering Algorithms de Amorim, RC. and Mirkin, B., (2013). Removing redundant features via clustering: preliminary results in mental task separation Cordeiro De Amorim, R., (2013). An Empirical Evaluation of Different Initializations on the Number of K-Means Iterations Austin, A., Cordeiro de Amorim, R. and Griffin, A., (2013). Providing an enhanced tutorial system to support student learning Society for Research Amorim, RC., (2013). Constrained Clustering with Minkowski Weighted K-Means de Amorim, RC. and Komisarczuk, ",
  "content_length": 13092,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:41"
}