{
  "name": "Renata Georgia Raidou",
  "homepage": "https://www.cg.tuwien.ac.at/staff/RenataRaidou",
  "status": "success",
  "content": "Renata Raidou | TU Wien – Research Unit of Computer Graphics Skip to main content Renata Raidou Details TitleAssociate Prof. Dr.in Function: Professor Workgroup Visualization Group RoomHB0510 Links E-Mailrraidou [at] cg.tuwien.ac.at TISS Business card ORCID iD 0000-0003-2468-0664 WikidataQ85887039 FunctionI am Associate Professor in Biomedical Visualization and Visual Analytics at the Research Unit of Computer Graphics of the Institute of Visual Computing & Human-Centered Technology, at TU Wien, Austria.For more information, see my personal website.Research InterestsI investigate and design Visualization and Visual Analytics strategies, which address biological and medical applications. My core interests revolve around the following topics: Medical Visualization and Visual Analytics, to address the needs of P4 medicine: personalization, predictiveness, preventiveness, and patient participation.Uncertainty Visualization, e.g., to analyze anatomical variability and its effect on treatments, or to investigate uncertainty in biological models.  Ensemble and Comparative Visualization, e.g., to explore big data from large cohorts of patients, or to analyze models and simulations of biological processes.(Augmented) Data Physicalization, to fabricate physical objects from the data for the education of the general public or for training (e.g., combined with AR).Check my personal website if you want to see my full list of publications and other professional activities I am involved in. CoursesMedical Visualization 1 (Visualisierung medizinischer Daten 1)Medical Visualization 2 (Visualisierung medizinischer Daten 2)Wissenschaftliches ArbeitenSeminar aus CGSeminar aus VisualisierungComputer Animation Short Bio I am Associate Professor in Biomedical Visualization and Visual Analytics at the Research Unit of Computer Graphics of the Institute of Visual Computing & Human-Centered Technology, at TU Wien, Austria. Previously, I was Assistant Professor and Rosalind Franklin Fellow at the Scientific Visualization and Computer Graphics Research Group of the Bernoulli Institute at the University of Groningen, the Netherlands. Before that, I did a Post-Doc at the Institute of Visual Computing & Human-Centered Technology, at TU Wien. I received my Ph.D. in Medical Visualization from Eindhoven University of Technology, the Netherlands, in 2017. The topic of my dissertation was “Visual Analytics for Digital Radiotherapy: Towards a Comprehensible Pipeline”, and for the results of my work, I obtained the Best PhD Award 2018 of the EuroVis Awards Programme. Additionally, I was awarded the Dirk Bartz Prize for Visual Computing in Medicine (1st Place) at Eurographics 2017 and the EuroVis Young Researcher Award 2022. Awards Best short paper awarded at EG VCBM 2022 (September 2022).EuroVis Young Researcher Award 2022 awarded at EuroVis 2022 (June 2022).Best short paper awarded at IEEE Vis 2020 (October 2020).EG VCBM Certificate of Appreciation awarded at EG VCBM2020 (September 2020).Image Contest Award (People’s choice) awarded at EG VCBM2019 (September 2019).Best short paper–Honorable Mention (Eurographics Association) awarded at EuroVis2018 (June 2018).EuroVis Best PhD Award 2018 (Eurographics Association) awarded at EuroVis2018 (June 2018).Dirk Bartz Prize 2017 for Visual Computing in Medicine (Eurographics Association)—1st place (April 2017).Nomination for IEEE VGTC VPG doctoral dissertation award (March 2017). News Maath Musleh: PhD Defenseposted on 10. Nov 2025 Aron Kovacs: PhD Defenseposted on 10. Nov 2025 Henry Ehlers: PhD Defenseposted on 19. Sep 2025 Daniel Pahr: PhD Defenseposted on 19. Sep 2025 EG VCBM 2022 AWARDSposted on 30. Sep 2022 Renata Raidou received the EuroVis Young Researcher Award 2022posted on 28. Jun 2022 more Topics for Projects and Theses Interactive Patient Journey Visualization for Treatment MonitoringBA, PR; 1 person Comparative Visualization of Many-to-Many Large NetworksBA, PR; 1 person Scalable Comparative Visualization of Volumetric Data: Supporting 1-to-1, 1-to-Many, and Many-to-Many ComparisonsDA; 1 person Going Beyond 4D in the Exploration of Dynamical SystemsDA; 1 person Student Projects and Master Theses at Siemens HealthineersBA, PR, DA; 1-3 persons Research Projects Health virtual twins for the personalised management of stroke related to atrial fibrillation Jan 2024 - Dec 2028 See current and former projects of this person Courses in the current semester Bio-Medical Visualization and Visual Analytics2025WVU 193.186: TISS | History Methods for Data Generation and Analytics in Medicine and Life Sciences2025WVU 193.026: TISS | TUWEL | History Project in Visual Computing 12025WPR 193.023: Course page | TISS | TUWEL | History Project in Visual Computing 22025WPR 193.024: Course page | TISS | TUWEL | History Projekt Medizinische Informatik2025WPR 193.025: Course page | TISS | TUWEL | History Seminar aus Medizinischer Informatik2025WSE 186.848: Course page | TISS | History Seminar aus Visualisierungplanned for allSE 186.046: Course page | TISS | History Seminar für Diplomand_innen für Medizinische Informatik2025WSE 180.776: TISS | History Seminar für Diplomand_innen für Visual Computing2025WSE 180.774: Course page | TISS | History Wissenschaftliches Arbeiten2025WSE 193.052: Course page | TISS | TUWEL | History Wissenschaftliches Publizieren 12025WPR 186.185: TISS | History Publications 74 Publications found: Image Bib Reference Publication Type 2025 Henry Ehlers, Daniel Pahr, Sara Di Bartolomeo, Velitchko Filipov, Hsiang-Yun Wu, Renata Raidou Wiggle! Wiggle! Wiggle! Visualizing uncertainty in node attributes in straight-line node-link diagrams using animated wiggliness COMPUTERS & GRAPHICS-UK, 131, October 2025. Journal Paper (without talk) Oscar Casares-Magaz, Renata Raidou, Katarí­na Furmanová, Niclas Pettersson, Vitali Moiseenko, John Einck, Austin Hopper, Rick Knopp, Ludvig P. Muren Risk of genitourinary late effects after radiotherapy for prostate cancer associated with early changes in bladder shape Physics and Imaging in Radiation Oncology, 36, October 2025. [paper] Journal Paper (without talk) Julia Kummer, Elmar Laistler, Lena Nohava, Renata Raidou, Katja Bühler Flattening-based visualization of supine breast MRI COMPUTERS & GRAPHICS-UK, 133, September 2025. [paper] Journal Paper (without talk) Maath Musleh, Renata Raidou, Davide Ceneda TrustME: A Context-Aware Explainability Model to Promote User Trust in Guidance IEEE Transactions on Visualization and Computer Graphics, 31(10):8040-8056, April 2025. Journal Paper with Conference Talk Jakob Peischl, Renata Raidou Investigating the Propagation of CT Acquisition Artifacts along the Medical Imaging Pipeline In Proceedings of the 20th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications - (Volume 1), pages 752-764. February 2025. Conference Paper Maath Musleh, Davide Ceneda, Henry Ehlers, Renata Raidou ConAn: Measuring and Evaluating User Confidence in Visual Data Analysis Under Uncertainty Computer Graphics Forum, 44(1):e15272, February 2025. Journal Paper with Conference Talk Lorenzo Amabili, Eduard Gröller, Renata Raidou Leveraging Popular Board Games to Teach Data Visualization In Visgames 2025: EuroVis Workshop on Visualization Play, Games, and Activities. 2025. [paper] Conference Paper Daniel Pahr, Sara Di Bartolomeo, Henry Ehlers, Velitchko Filipov, C. Stoiber, W Aigner, Hsiang-Yun Wu, Renata Raidou NODKANT: exploring constructive network physicalization Computer Graphics Forum:e70140, 2025. [paper] Journal Paper with Conference Talk Henry Ehlers, Mario Kerndler, Renata Raidou Penta: Towards Visualizing Compound Graphs as Set-Typed Data In Proceedings of the 20th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications - Volume 1 GRAPP, HUCAPP and IVAPP: IVAPP,, pages 913-921. 2025. Conference Paper 2024 Daniel Pahr, Michal Piovarči, Hsiang-Yun Wu, Renata Raidou Squishicalization: Exploring Elastic Volume Physicalization IEEE Transactions on Visualization and Computer Graphics:1-14, December 2024. Journal Paper (without talk) Henry Ehlers, Daniel Pahr, Velitchko Filipov, Hsiang-Yun Wu, Renata Raidou Me! Me! Me! Me! A study and comparison of ego network representations COMPUTERS & GRAPHICS-UK, 125:1-15, December 2024. [paper] Journal Paper (without talk) Inês Lúcio, Renata Raidou, Pedro Rodrigues, Daniel Simões Lopes Your Face, Your Anatomy: Flashcard Lenses Enriched with Knowledge Maps for Anatomy Education In Proceedings 2024 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), pages 495-504. November 2024. Conference Paper Katarí­na Furmanová, Barbora Kozlikova, Thomas Höllt, Eduard Gröller, Bernhard Preim, Renata Raidou BioMedical Visualization : Past Work, Current Trends, and Open Challenges. Springer Nature, October 2024. Published Book Anna Shilo, Renata Raidou Visual narratives to edutain against misleading visualizations in healthcare COMPUTERS & GRAPHICS-UK, 123, October 2024. Journal Paper (without talk) Daniel Pahr, Henry Ehlers, Hsiang-Yun Wu, Manuela Waldner, Renata Raidou Investigating the Effect of Operation Mode and Manifestation on Physicalizations of Dynamic Processes Computer Graphics Forum, 43(3):e15106, June 2024. Journal Paper with Conference Talk Áron Samuel Kovács, Pedro Hermosilla-Casajus, Renata Raidou Surface-aware Mesh Texture Synthesis with Pre-trained 2D CNNs Computer Graphics Forum, 43(2), May 2024. Journal Paper (without talk) Henry Ehlers, Diana Marin, Hsiang-Yun Wu, Renata Raidou Visualizing Group Structure in Compound Graphs: The Current State, Lessons Learned, and Outstanding Opportunities In Proceedings of the 19th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications - Volume 1, HUCAPP and IVAPP, pages 697-708. March 2024. Conference Paper Hannah Clara Bayat, Manuela Waldner, Renata Raidou A Workflow to Visually Assess Interobserver Variabil",
  "content_length": 18922,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:34"
}