{
  "name": "Renchi Yang",
  "homepage": "https://renchi.ac.cn",
  "status": "success",
  "content": "Home Renchi YangAssistant Professor Contact Hong Kong Baptist University Email Twitter ORCID Google Scholar DBLP TidbitI am currently an Assistant Professor with the Department of Computer Science at Hong Kong Baptist University. I earned a Ph.D. in computer science from Nanyang Technological University, followed by a postdoctoral stint at the National University of Singapore. I am a recipient of the 2021 VLDB Best Research Paper Award and the 2022 SIGMOD Research Highlight Award. Broadly speaking, my research focuses on big data science and engineering, which involves developing effective and/or efficient algorithms, models, and systems for large-scale data management, mining, and analysis. I am also affiliated with Database Research Group at HKBU.Research InterestsDatabases and data management: graph databases, vector databasesWeb and information retrieval: web/e-commerce search & ranking, recommender systems, social networks and media, dialogue systemsData mining and analytics: graph, text, tabular, multimodal data ming and analyticsMachine learning: data-centric machine learning, graph learning, efficient LLMs, AI4X NewsNov 23, 2025: 3 papers were accepted to KDD 2026Aug 23, 2025: 1 paper was accepted to SIGMOD 2026Aug 5, 2025: 3 papers were accepted to CIKM 2025May 15, 2025: 2 papers were accepted to KDD 2025Apr 5, 2025: 2 papers were accepted to SIGIR 2025Mar 25, 2025: 1 paper was accepted to ICDE 2025Jan 20, 2025: 1 paper was accepted to WWW 2025Selected HonorsHonorable mention as one of the best PC members in WWW 2022Best Paper Award Nominee in WWW 20222022 ACM SIGMOD Research Highlight AwardBest Research Paper Award in VLDB 2021 Academic ServicesProceedings co-chair: MDM 2024-2025Session chair: ICDE 2025Program committee member for the following conferences/workshops:DB: SIGMOD 2027, VLDB 2026, ICDE 2024-2026DM&IR: KDD 2022-2026, WWW 2022-2026, SIGIR 2025, WSDM 2023-2026, CIKM 2024-2025, ECML-PKDD 2022ML: NeurIPS 2025, IJCAI 2024-2025, AAAI 2026, ECAI 2025, NeurIPS 2023 GLFrontiers workshop,Invited reviewer for the following journals: TKDE, VLDBJ, TKDD. TeachingHKBU COMP4035: Database Systems Implementation, Fall 2023, 2024, 2025HKBU COMP7640: Database Systems & Administration, Spring 2023, 2024, 2025HKBU COMP7930: Big Data Analytics, Spring 2023, 2024, 2025",
  "content_length": 2307,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:43"
}