{
  "name": "Renfa Li",
  "homepage": "http://csee.hnu.edu.cn/people/lirenfa",
  "status": "success",
  "content": "李仁发-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 李仁发 我的位置在： 首页 > 学院概况 > 师资力量 > 李仁发 教师介绍 李仁发，教授（1997年），工学博士。1978年考入天津大学，先后获天津大学工学学士、天津大学工学硕士学位、华中理工大学（现华中科技大学）博士学位。1994年在乔治.华盛顿大学短期研修。在国营742厂（现华晶电子集团）工作2年，任技术员。1987年后，一直在高校从事教学与科研工作，1993年破格晋升为计算机学科副教授，1997年破格晋升为计算机学科教授，享受国务院颁发政府特殊津贴专家，获全国优秀教师称号，省记一等功，国家超级计算长沙分中心湖南省聘专家组成员，湖南省科协第九届委员会委员。2002年起，任湖南大学计算机与通信学院院长。2010年底任教务处长兼信息学院副院长。2012年起兼任嵌入式与网络计算省重点实验室主任。2014年起，任湖南大学信息科学与工程学院院长。 中文名： 李仁发 英文名： 学历： 博士 职称： 教授 联系电话： 电子邮件： lirenfa@hnu.edu.cn 研究方向： 计算机系统结构、嵌入式计算体系结构、无线网络、嵌入式软件、CPS、信息网络、虚拟与仿真技术 联系地址： 湖南省长沙市岳麓区麓山南路2号,湖南大学信息科学与工程学院（410082） 所属机构： 计算机工程系 学院教师 简介 李仁发，教授（1997年），工学博士。1978年考入天津大学，先后获天津大学工学学士、天津大学工学硕士学位、华中理工大学（现华中科技大学）博士学位。1994年在乔治.华盛顿大学短期研修。在国营742厂（现华晶电子集团）工作2年，任技术员。1987年后，一直在高校从事教学与科研工作，1993年破格晋升为计算机学科副教授，1997年破格晋升为计算机学科教授，享受国务院颁发政府特殊津贴专家，获全国优秀教师称号，省记一等功，国家超级计算长沙分中心湖南省聘专家组成员。2002年起，任湖南大学计算机与通信学院院长。2010年底任教务处长兼信息学院副院长。2012年起兼任嵌入式与网络计算省重点实验室主任。2014年起，任湖南大学信息科学与工程学院院长近年来在专业期刊发表学术论文（含合作）300余篇，完成国家科技计划项目(国家核高基、973、863、国家基金、国家重大科技支撑计划、教育部重点科技计划、省重点科技计划)20余项，获省（部）一等奖2项（含排名非第一）和二等奖5项（含排名非第一）。获授权发明专利9项，申请待授权4项。获全国优秀教师称号，省记一等功。是国家精品课程负责人，省优秀教学团队负责人。已出版书（含专著、教科书、编著、译著、参编）12部。研究兴趣：计算机系统结构、嵌入式计算体系结构、无线网络、嵌入式软件、CPS、信息网络、虚拟与仿真技术。联系方式：湖南大学信息科学与工程学院（410082）电    话：0731-88821544邮    箱：lirenfa@hnu.edu.cn 社会兼职 IEEE高级会员，ACM高级会员。中国计算机学会理事兼无线传感器网络专委委员、网络与数据通信专委委员、协同计算专委委员、嵌入式系统专委会委员。教育部网上合作制造中心学术委员。中国系统仿真学会理事，中国电子学会会员，中国教育信息化协会理事。《计算机研究与发展》编委、《通信学报》编委、《系统仿真学报》编委、《计算机科学与工程》编委、《小型微型计算机系统》编委。湖南省计算机学会副理事长、湖南省电子学会副理事长、湖南省通信学会常务理事、省软件行业协会专家。 主讲课程 计算机系统结构、嵌入式软件设计、嵌入式计算系统设计原理（硕）、高性能嵌入式计算（博） 主要获奖 2013年，湖南省科技进步一等奖，金融SOC设计及其关键技术研究，排名第二。2010年，省优秀教学团队负责人，湘教通[2010]127号，湖南省教育厅2010年4月。2010年，第五届湖南省普通高等学校教学名师奖，湘教通[2010]255号，湖南省教育厅2010年7月。2006年，湖南省科技进步二等奖，嵌入式计算机系统结构及其应用系统，排名第一。2001年，湖南省高等教育省级教学成果一等奖，虚拟电子实验室技术与教学实践研究，排名第一。1999年，湖南省教育委员会科技进步二等奖，中小型图书馆自动化集成系统研究，排名第一。1995年，评为全国优秀教师并授予全国优秀教师奖章。1995年，湖南省记一等功。 主要国家研究项目 1.   行业应用市场分析和电磁计算软件研发（863计划，2012AA01A301-01，2013-2014）2.   以汽车为例的CPS若干问题研究（国家自然科学基金，61173036，2012-2015） 3.   实时嵌入式操作系统及开发环境（核高基，2009ZX01038－001，2009-2010） 4.   复杂嵌入式系统中的软件构造技术研究（国家自然科学基金，60873047，2009-2011）5.   面向可重构片上系统的过程级动态软硬件划分方法研究（863计划，2007AA01Z104，2007-2009）6.   人员遇险区域定位及救灾通讯关键技术与装备（国家科技支撑计划，2007BAK23B03，2007-2009）7.   一类复杂环境下的无线传感器网络定位算法研究（国家自然科学基金，60673061，2007-2009）8.   基于虚拟原型的虚拟实验室实现原理研究（国家自然科学基金项目，66974031，2000-2002）9.   面向领域特点的可信流媒体分发技术研究（教育部重点，108168，2008-2010）10.  基于无线传感器网络的矿井瓦斯监控平台的研究（博士点基金，20060532024，2007-2009）11.  环境监测信息处理系统关键技术研究(湖南省高新领域重点科技计划，项目号：2007GK2015)12.  高速网络环境下入侵检测技术研究（湖南省自然科学基金资助项目，03jjy3103，2004-2005）13.  汽车电子基础软件研究（长沙市科技计划，K1003028-11，2010-2011）14.  基于无线传感器网络技术的环境监测系统（长沙市科技攻关项目，K069015-12，2006-2008）15.  中国网上教育平台试点工程高等教育网上教育系统（国家发展与改革委员会项目，2003-2005） 16.  面向一类动漫媒体内容管理的多媒体数据库若干关键技术研究 （广东省产学研项目，项目号：2007A090302079）17.  嵌入式智能控制器及系统的设计与实现研究（973专项子项，2003-2005）18.  支持INTERNET的可重构嵌入式微控器设计研究（湖南省科学技术厅制造业信息化示范工程项目，编号：HNMIE-A-026，2002-2004.6）19.  新一代网络流量模型研究（湖南省科技攻关项目，湘科计字[2003]127号）20.  湖南省科技攻关项目，SoC中IP模块网络化互联方法研究，2003.12-2004.12。21.  国家某项目，“XX工程”特种显示中的人机交互。22.  国家某项目，项目号：2001-研2-B-003 2002～2004。23.  深圳华为公司项目，基于CORBA 的网管技术研究，2000～2002。24.  虚拟实验室技术（教育部骨干教师基金项目，2000～2002）25.  中小型图书馆自动化集成系统研究（原煤炭部攻关项目，批号：煤部科第128号，1993-1996）26.  智能控制高性能矿山电气传动系统研制（原煤炭部优秀青年基金项目，批号：煤部科第120号，1992-1994） 教学项目 2007年，国家精品课程负责人，《大学信息技术基础》，排名第一2008年，国家省精品课程，《计算机组成与结构》，排名第二2006年，湖南省精品课程，《大学信息技术基础》，排名第一2007年，湖南省精品课程，《计算机组成与结构》，排名第二 出版的书（含合作） 1.   计算机网络安全，李仁发 喻飞等（著），科学出版社，2004.11 2.   C语言程序设计，汕头大学出版社，1999.08 3.   自动化理论、技术及应用(第五卷)，中南工业大学出版社，1998.05 4.   C语言程序设计基础（高等学校规划教材），中国矿业大学出版社，1996.08 5.   虚拟电子实验平台应用技术，湖南科技大学出版社，1999.07 6.   嵌入式系统导论:cps方法，李实英 贺蓉李仁发(译)，机械工业出版社，2012.01 7.   嵌入式计算系统设计原理，李仁发（译），机械工业出版社，2009.06 8.   数字逻辑设计，李仁发 肖玲 吴强（译），人民邮电出版，2006.05 9.   软件设计——从程序设计到体系结构，李仁发王岢 任小西（译），电子工业出版社，2005.03 10.  VHDL数字系统设计，李仁发 凌纯清 徐成（译），电子工业出版社，2004.08 11.  计算机系统组成与体系结构，李仁发彭蔓蔓（译），人民邮电出版社，2003.08 12.  嵌入式计算系统设计原理（原书第3版），李仁发（译），机械工业出版社，2014.01 13.  无线传感器网络原理与OMNET++实现，曾凡仔 李仁发，肖玲编著,湖南大学出版社，2011-7 14.  数字内容安全原理与应用， 彭飞 龙敏 刘玉玲 李仁发 等著，清华大学出版社，2012.7 15.  嵌入式Linux系统实训教程，徐成 谭曼琼 徐署华 李仁发 等，人民邮电出版社，2010.4 16.  特征提取与图像处理(第2版)，李仁发李实英（译），电子工业出版社， 2010.10 近年来发表的部分论文（含合作） 1、英文期刊论文[1]    Wang, Y; Li, RF. FPGA based unified architecture for public key and private key cryptosystems. FRONTIERS OF COMPUTER SCIENCE. JUN 2013:卷: 7 期: 3 页: 307-316[2]    Yang, A; Li, RF; Zhu, W; Yue, GX.A Novel Method for Protein Function Prediction Based on Sequence Numerical Features. MATCH-COMMUNICATIONS IN MATHEMATICAL AND IN COMPUTER CHEMISTRY. 2012:卷: 67期: 3页: 833-843[3]    Cai, SH; Li, RF. The analysis of industry organization model based on the economic and ecological benefits. ADVANCED RESEARCH ON INDUSTRY, INFORMATION SYSTEMS AND MATERIAL ENGINEERING, PTS 1-7;2011:卷: 204-210页: 1203-1206[4]    Cao, Z; Li, RF; Chen, WY.A 3D Graphical Representation of DNA Sequence Based on Numerical Coding Method. INTERNATIONAL JOURNAL OF QUANTUM CHEMISTRY;APR 2010:卷: 110期: 5页: 975-980[5]    Wu, RH; Li, RF; Liao, BY; Yue, GX.A Novel Method for Visualizing and Analyzing DNA Sequences. MATCH-COMMUNICATIONS IN MATHEMATICAL AND IN COMPUTER CHEMISTRY;2010:卷: 63期: 3页: 679-690[6]    Luo, J (Luo, Jiawei); Li, R (Li, Renfa); Zeng, QQ (Zeng, Qingguang).A novel method for sequence similarity analysis based on the relative frequency of dual nucleotides. MATCH-COMMUNICATIONS IN MATHEMATICAL AND IN COMPUTER CHEMISTRY;2008:卷: 59期: 3页: 653-659[7]    Liao, B (Liao, Bo); Li, RF (Li, Renfa); Zhu, W (Zhu, Wen); Xiang, XY (Xiang, Xuyu).On the similarity of DNA primary sequences based on 5-D representation. JOURNAL OF MATHEMATICAL CHEMISTRY;JUL 2007:卷: 42期: 1页: 47-57[8]    Wu, RH (Wu, Ronghui); Li, RF (Li, Renfa); Yu, F (Yu, Fei); Yue, GX (Yue, Guangxue); Xu, C (Xu, Chen).Research on Advanced Distributed Learning by using SCORM. Computational Science - ICCS 2007, Pt 3, Proceedings;2007:丛书: LECTURE NOTES IN COMPUTER SCIENCE卷: 4489页: 571-574[9]    Xu, Y (Xu, Ying); Qu, R (Qu, Rong) ; Li, RF (Li, Renfa).A simulated annealing based genetic local search algorithm for multi-objective multicast routing problems. ANNALS OF OPERATIONS RESEARCH;JUL 2013:卷: 206 期: 1 页: 527-555[10]    Yang, A (Yang, Ang) ; Cao, T (Cao, Tao); Li, RF (Li, Renfa); Liao, B (Liao, Bo).A Hybrid Gene Selection Method for Cancer Classification Based on Clustering Algorithm and Euclidean Distance. JOURNAL OF COMPUTATIONAL AND HEORETICAL NANOSCIENCE;APR 2012:卷: 9期: 4页: 611-615[11]    Luo, J (Luo, Juan); Pan, C (Pan, Chen); Li, RF (Li, Renfa); Ge, F (Ge, Fei).Power Control in Distributed Wireless Sensor Networks Based on Noncooperative Game Theory. INTERNATIONAL JOURNAL OF DISTRIBUTED SENSOR NETWORKS;2012[12]    Wu, RH (Wu, Ronghui); Hu, QG (Hu, Qiguang); Li, RF (Li, Renfa); Yue, GX (Yue, Guangxue).A Novel Composition Coding Method of DNA Sequence and Its Application. MATCH-COMMUNICATIONS IN MATHEMATICAL AND IN COMPUTER CHEMISTRY;2012:卷: 67期: 1页: 269-276[13]    Yang, SF (Yang, Shufan); Wu, Q (Wu, Qiang); Li, RF (Li, Renfa).A case for spiking neural network simulation based on configurable multiple-FPGA systems. COGNITIVE NEURODYNAMICS;SEP 2011:卷: 5期: 3页: 301-309[14]    Wu, RH (Wu, Ronghui); Liu, Y (Liu, Yun); Li, RF (Li, Renfa); Cao, T (Cao, Tao); Yue, GX (Yue, Guangxue).A Novel Hybrid Method for Gene Selection of Microarray Data. JOURNAL OF COMPUTATIONAL AND THEORETICAL NANOSCIENCE;JUL 2011:卷: 8期: 7页: 1162-1165[15]    Zeng, QG (Zeng, Qiangguang); Yue, GX (Yue, Guangxue); Li, RF (Li, Renfa).Prediction of Protein Functional Class from Pseudo-Amino Acid Composition. JOURNAL OF COMPUTATIONAL AND THEORETICAL NANOSCIENCE;JUL 2011:卷: 8期: 7页: 1247-1251[16]    Cao, Z (Cao, Zhi); Liao, B (Liao, Bo); Li, RF (Li, Renfa);Luo, JW (Luo, Jiawei); Zhu, W (Zhu, Wen). RNA Secondary Structure Alignment Based on an Extended Binary Coding Method. INTERNATIONAL JOURNAL OF QUANTUM CHEMISTRY;APR 2011:111期: 5页: 978-982[17]    Wu, D (Wu, Di); Bao, LC (Bao, Lichun); Li, RF (Li, Renfa).Robust Localization Protocols and Algorithms in Wireless Sensor Networks Using UWB.AD HOC & SENSOR WIRELESS NETWORKS;2011:卷: 11期: 3-4页: 219-243[18]    Tang, XY (Tang, Xiaoyong); Li, KL (Li, Kenli); Li, RF (Li, Renfa); Veeravalli, B (Veeravalli, Bharadwaj).Reliability-aware scheduling strategy for heterogeneous distributed computing systems;SEP 2010,卷: 70期: 9页: 941-952[19]    Wu, D (Wu, Di); Bao, LC (Bao, Lichun); Li, RF (Li, Renfa).A holistic approach to wireless sensor network routing in underground tunnel environments.COMPUTER COMMUNICATIONS;AUG 16 2010:卷: 33期: 13页: 1566-1573[20]    Zhu, W (Zhu, Wen); Liao, B (Liao, Bo); Li, RF (Li, Renfa).A Method for Constructing Phylogenetic Tree Based on a Dissimilarity Matrix.MATCH-COMMUNICATIONS IN MATHEMATICAL AND IN COMPUTER CHEMISTRY;2010:卷: 63期: 2页: 483-492 [21]    Cao, Z (Cao, Zhi); Liao, B (Liao, Bo); Li, RF (Li, Renfa); Zhu, W (Zhu, Wen).A Three-Dimensional Cube Representation of RNA Secondary Structure and Its Application. JOURNAL OF COMPUTATIONAL AND THEORETICAL NANOSCIENCE;JUL 2009:卷: 6期: 7页: 1478-1481[22]    Cao, Z (Cao, Zhi); Liao, B (Liao, Bo); Li, RF (Li, Renfa).A group of 3D graphical representation of DNA sequences based on dual nucleotides. INTERNATIONAL JOURNAL OF QUANTUM CHEMISTRY;AUG 5 2008:卷: 108期: 9页: 1485-1490[23]    Liao, B (Liao, Bo); Luo, JW (Luo, Jiawei); Li, RF (Li, Renfa); Zhu, W (Zhu, Wen).Novel method for analyzing proteome. INTERNATIONAL JOURNAL OF QUANTUM CHEMISTRY;MAY 2007:卷: 107期: 6页: 1295-1300[24]    Liao, B (Liao, Bo); Zhu, W (Zhu, Wen); Li, RF (Li, Renfa).RNA secondary structure mathematical representation without degeneracy. MATCH-COMMUNICATIONS IN MATHEMATICAL AND IN COMPUTER CHEMISTRY;2007:卷: 57期: 3页: 687-695[25]    Li, Renfa; Xie, Yunlong; Wen, Jigang; Yue, Guangxue.EMMP: A highly efficient membership management protocol. Frontiers of Computer Science in China,v 1, n 2,2007: 208-212 (EI:20074811741399)[26]    Hamed, Ahmed A",
  "content_length": 32763,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:43"
}