{
  "name": "Rens Bod",
  "homepage": "https://www.uva.nl/profiel/b/o/l.w.m.bod/l.w.m.bod.html",
  "status": "success",
  "content": "Prof. dr. L.W.M. (Rens) Bod - Universiteit van Amsterdam Prof. dr. L.W.M. (Rens) Bod Computationele en digitale geesteswetenschappen, Faculteit der Natuurwetenschappen, Wiskunde en Informatica & Faculteit der Geesteswetenschappen Dep. Mediastudies Fotograaf: Jeroen Oerlemans Bezoekadres Science Park 900 Kamernummer: 2.20 Postadres Postbus 94550 1090 GN Amsterdam Contactgegevens l.w.m.bod@uva.nl Tweede werkadres: Turfdraagsterpad 9, 1012 XT Amsterdam Profile Latest News: My new book The Unique Animal (\"Het unieke dier\") has just been published (September 2025)! It explores how humans differ from other animals and what they have in common with them. By using Big Data and topic modelling techniques, and by going through millions of publications across disciplines, the book aims to give the first empirical answer to the age-old question as to what makes us human. Current position Rens Bod (rens.bod@gmail.com) is professor of Digital Humanities and History of Humanities, and a director of the Vossius Center for the History of Humanities and Sciences. He investigates the humanities from both computational and historical perspectives. He currently serves as president of the Society for the History of the Humanities, and is a member of the Royal Netherlands Academy of Arts and Sciences (KNAW), the Royal Holland Society of Sciences and Humanities (KHMW) and of the Society for the Dutch Letters (MNL). He is also the founder of WOinActie, an action group that strives for properly funded and democratic universities. Bod is a recipient of an EPSRC Advanced Research Fellowship (UK), a personal academy fellowship (KNAW), a personal VIDI fellowship and a personal VICI fellowship (1.5 MEuro, NWO). Bod is the author of the first historical overview of the humanities from Antiquity to the present: A New History of the Humanities (translated from the Dutch \"De Vergeten Wetenschappen\"). The book has appeared in seven translations, and was voted as best science book of 2011 by Kennislink and as one of the 25 books on science you \"must  have read\" by NRC Handelsblad.  The book has been reviewed by over 50 journals and newspapers and is acclaimed as \"an extraordinarily ambitious undertaking ... the first ever history of its kind\" (Times Literary Supplement) and \"Bod takes the humanities back to their rightful place in the family tree of science.\" Rens Bod has also published an Open Access monograph on the general history of knowledge disciplines, World of Patterns: A Global History of Knowledge, which explores the search for patterns and underlying principles in 20 disciplines from 5 continents across the sciences, social sciences and the humanities. The book was nominated for the Libris History Prize and has been translated into six languages. A few years ago he published a world history of the meaning of life, which is currently being translated into English as Why Am I Here? A World History of the Search for Meaning. Bod's most recent book is The Unique Animal (\"Het unieke dier\"), which explores how humans differ from other animals and what they have in common with them. By using Big Data and topic modelling, and by going through millions of publications across disciplines, the book aims to give the first empirical answer to the age-old question as to what makes us human. Bod's earlier work focused on (computational) linguistics, for example his seminal work on a natural language processing model that creates rule-like behavior without rules -- see his monograph Beyond Grammar: An Experience-Based Theory of Language. Bod's computational work also covers computational musicology, digital aesthetics and computational literary studies. In the field of digital humanities, he coordinated several public-private partnerships in the humanities. He is one of the main architects of the Data-Oriented Parsing model, a general machine learning technique which has been applied to language, music, vision and reasoning. Bod is a founding editor of the journal History of Humanities and the initiator of the conference series The Making of the Humanities. His books include Beyond Grammar (1998), Probabilistic Linguistics (2003), Data-Oriented Parsing (2003) and De Vergeten Wetenschappen (The Forgotten Sciences) (2010), and he co-edited three volumes on the comparative history of the humanities, The Making of the Humanities I, II and III (2010, 2012, 2014). Our multi-volume work The Making of the Humanities is now freely available. Click here for my recent books. Click here for the Center for Digital Humanities Click here for the Vossius Center on the History of Humanities and Sciences Click here for my Language and Computation group Click here for my weblog on the history of the knowledge and the history of humanities Click here for The Making of the Humanities conferences Click here for our new journal History of Humanities Current projects The Flow of Cognitive Goods: Towards a Post-Disciplinary History of Knowledge CREATE: Creative Amsterdam -- An E-Humanities Perspective (Spearpoint UvA) Legal Structures (NSF/NWO Digging into Data) Language in Interaction (NWO Gravitation) The Riddle of Literary Quality (KNAW Computational Humanities) CLARIAH: Common Lab Research Infrastructure for the Humanities (NWO Roadmap) Full List of Publications Books and Edited Books R. Bod, 2019. Een Wereld Vol Patronen: De Geschiedenis van Kennis, Prometheus. R. Bod, 2019. Le Scienze Dimenticate, Carocci Editori. R. Bod, 2017. 人文学的历史：被遗忘的科学, Peking University Press. Extended Chinese version of A New History of the Humanities, with new material on mohist logic, theories on parallel perspective, Chinese Ming and Qing linguistics. Censored by Peking University Press: the parts on 20th century Chinese humanities (historiography, literary studies and art history) under Mao Zedong and the People’s Republic of China were not published. R. Bod, 2015. Fully revised and updated paperback edition of A New History of the Humanities: The Search for Principles and Patterns from Antiquity to the Present. Oxford University Press. R. Bod, 2013. A New History of the Humanities: The Search for Principles and Patterns from Antiquity to the Present. Oxford University Press. Translated into Chinese (Peking University Press, Beijing), Korean (Torus Book, Seoul), Polish (Aletheia), Ukrainian, Armenian (Sargis Khachents), Italian (Carocci, Rome). Reviewed in 45+ journals and newspapers. Lead review in Times Literary Supplement of 6 June 2014; review essays in American Historical Review, Scientific American, Seminary Studies, Isis, Renaissance Society of America, Postmedieval, Il Sole 24 Ore a.o. Selected among the best books of 2016 (from longlist of more than 500 books) at the Lviv Forum of Publishers, see http://svoeradio.com/news/c-1/u_lvovi_23_vidannya_rozdilili_nagorodu_naykraschoyi_knizhki_roku Selected among “Books of the Year” by Higher Education Strategy Associates (HESA), see http://higheredstrategy.com/books-of-the-year/ R. Bod, J. Maat and T. Weststeijn (eds.), 2014. The Making of the Humanities – Vol. III: The Modern Humanities, Amsterdam University Press. \"monumental and expansively illustrated […] the three-volume history edited by Rens Bod, Jaap Maat, and Thijs Weststeijn, The Making of the Humanities, [is] a massive undertaking that documents with painstaking subtlety and detail the difficult transitions from the early modern to the modern period in the reformation of the European ratio studiorum of the arts, humanities, and natural sciences.\"  Robert Davis in http://onlinelibrary.wiley.com/doi/10.1111/edth.12138/full \"A must-read for anyone interested in the history of a broad range of the humanities. It combines case studies of great historical precision with methodological considerations of historical epistemologies, with the explicit aim of matching the work done in the history of science with equivalent historical epistemologies of the various humanistic disciplines”, Reviewed in Isis, by Katherine Arens: R. Bod, J. Maat and T. Weststeijn (eds.), 2012. The Making of the Humanities – Vol. II: From Early Modern to Modern Disciplines, Amsterdam University Press. (Reviewed in Choice and other journals) R. Bod, 2012. Het Einde van de Geesteswetenschappen 1.0, Vossiuspers, Amsterdam University Press. R. Bod, 2010. De Vergeten Wetenschappen: Een Geschiedenis van de Humaniora (“The Forgotten Sciences: A History of the Humanities”), Prometheus, Bert Bakker. Revised and updated second edition, 2011 Revised and updated third edition, 2012 Revised and updated fourth edition, 2013 Revised and updated fifth edition, 2015, with new Preface Chosen among best 25 books of 2010 by NRC Handelsblad. Chosen among best non-fiction books by De Groene Amsterdammer. Chosen as best science book by Kennislink in 2011. Reviewed by >40 journals and newspapers. R. Bod, J. Maat and T. Weststeijn (eds.), 2010. The Making of the Humanities – Vol. I: Early Modern Europe, Amsterdam University Press. (Reviewed in Choice, H-Soz-u-Kult, European Review, Intellectual History Review, De Zeventiende Eeuw, Renaissance Quarterly) • Sandrine Maufroy in H-Soz-u-Kult 02.12.2011, URL: http://hsozkult.geschichte.hu-berlin.de/rezensionen/id=15753 . • Nicolette Mout in European Review 20/2 (May 2012), pp. 297-299. • Charles G. Nauert in Intellectual History Review 22/2 (2012), pp. 293-296. • Anja-Silvia Goeing in Renaissance Quarterly, Vol. 65, No. 3 (Fall 2012). • Eric Jorink in De Zeventiende Eeuw 29/1 (2012). R. Bod and D. Cochran (eds.), 2007. Proceedings ESSLLI workshop \"Exemplar-Based Models of Language Acquisition and Use\".  ESSLLI 2007. R. Bod, J. Hay and S. Jannedy (eds.), 2003. Probabilistic Linguistics. Cambridge: The MIT Press. (Reviewed by >10 journals) R. Bod, R. Scha and K. Sima'an (eds.), 2003. Data-Oriented Parsing. CSLI Publications/The University of Chicago Press. (Reviewed in Computational Linguistics) R. Bod, 1998. Beyond Grammar: An Experience-Based Theory of Language. CSLI Publications/The Universi",
  "content_length": 81830,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:57"
}