{
  "name": "Renwei Dian",
  "homepage": "https://sites.google.com/view/publication-code-renweidian/homepage",
  "status": "success",
  "content": "HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationRenwei Dian (佃仁伟)Follow me: Github, Google ScholarShort BiographyRenwei Dian is a Professor in Hunan University (湖南大学)News2025/01：I have been a professor in the School of Robotics, Hunan University as the associate professor.2022/08: I have joined the School of Robotics, Hunan University as the associate professor.2021/5: I am invtied to giving a talk at the 36th Youth Academic Annual Conference of Chinese Association of Automatic (第36届中国自动化学会青年学术年会).2020/12: I have  been rewared with the  Excellent Doctoral Dissertation by China Society of Image and Graphics in 2020(中国图象图形学学会优秀博士学位论文,全国10人). 2020/11:  One review paper for HSI and MSI fusion is accepted by Information Fusion. 2020/07: I have got my  doctor's degree . 2020/06: I have been awarded with  the Fellowship of China National Postdoctoral Program for Innovative Talents(博士后创新人才支持计划). 2020/06: The code of paper (TNNLS 2020) has been released in my github.2020/01: I have got the National Scholarship!2019/11: The code of NLSTF (CVPR 2017, TCYB2019) has been in my github.Research InterestsCurrent Interests: Hyperspectral image super-resolution, Image fusion, Tensor decompositionWork Experience 2025.01-Present: Professor,School of Robotics, Hunan University, Changsha, China2022.08- 2024.12: Associate Professor,School of Robotics, Hunan University, Changsha, China2020.08 - 2022.07: Post-doctor , College of Electrical and Information Engineering, Hunan University, Changsha, China, supervised by Prof. Shutao Li (IEEE Fellow)Education2015.09 - 2020.07: D.S., College of Electrical and Information Engineering, Hunan University, Changsha, China, supervised by Prof. Shutao Li (IEEE Fellow)2017.11 - 2018.11: Visiting Ph.D student, University of Lisbon, Portugal, working with Prof. Jose Bioucas Dias (IEEE Fellow)2011.09 - 2015.06: B.S., College of Information Science and Engineering, Wuhan University of Science and Technology, Wuhan, ChinaPublicationReviewer      Reviewer for the following journals:IEEE Transactions on Pattern Analysis and Machine IntelligenceIEEE Transactions on Information TheoryIEEE Transactions on Image Processing IEEE Transactions on Neural Networks and Learning SystemsIEEE Transactions on CyberneticsIEEE Transactions on Medical ImagingIEEE Transactions on Geoscience and Remote SensingIEEE Transactions on Instrumentation and MeasurementInformation FusionIEEE Journal of Selected Topics in Applied Earth Observations and Remote SensingGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2563,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:49"
}