{
  "name": "René Rydhof Hansen",
  "homepage": "http://people.cs.aau.dk/~rrh",
  "status": "success",
  "content": "René Rydhof Hansen René Rydhof Hansen, Ph.D. Contact Information Department of Computer Science Aalborg University Selma Lagerlöfs Vej 300 DK-9220 Aalborg Ø Denmark Office: 1.2.36 Phone: (+45) 9940 9940 Direct: (+45) 9940 7514 Fax: (+45) 9940 9798 I am an associate professor in the Distributed and Embedded Systems group at the Department of Computer Science at Aalborg University. Projects Self Energy-Supporting Autonomous Computation funded by the EU under FP7 2012-1015. Model Based Analysis and Testing of Embedded Systems (MBAT), funded by ARTEMIS. Certifiable Java for Embedded Systems (CJ4ES@googlecode), funded by the Danish Research Council for Technology and Production Sciences 2011-2013. Improving Security of Infrastructure Software (ISIS), funded by the Danish Research Council for Technology and Production Sciences 2008-2011. In collaboration with Julia L. Lawall at DIKU. The project is based on the Coccinelle tool (coccinelle@github). Research My main research interests are language-based safety and security, static analysis, programming languages, and programming language issues in operating systems. A detailed list of publications is available here (DBLP, VBN). Teaching RTS spDS PSS: Principper for Samtidighed og Styresystemer (SW4, DAT4/Spring 2012) ASV: Advanced Topics in Semantics and Verification (DAT8, DAT8old/Spring 2012) TSW: Real-Time Software (SW5/Fall 2011) FAS: Formal Aspects of Security (PhD/Fall 2011) PSS: Principper for Samtidighed og Styresystemer (Spring 2011) AppSec: Applied Security (Spring 2011) spDS: Distributed Systems (DAT5/Fall 2010) TSW: Real-Time Software (SW5/Fall 2010) PSS: Principper for Samtidighed og Styresystemer (Spring 2010) CatFunc: Category Theory with Applications in Functional Programming (PhD course/Fall 2009) PROB: Programmering og Datastrukturer (BAIT1/Fall 2009) TSW: Real-time Software (SW5/Fall 2009) PSS: Principper for Samtidighed og Styresystemer (Spring 2009) SSAS: System Architecture and Security (ITU/Fall 2008) FS: Formal Systems (DAT5/Fall 2008) PROB: Programmering og Datastrukturer (BAIT/Fall 2008) PSS: Principper for Samtidighed og Styresystemer (Spring 2008) PROB: Programmering og Datastrukturer (BAIT/Fall 2007) A list of current and former students is available here. [ | publications | calendar ]",
  "content_length": 2296,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:58"
}