{
  "name": "Reto Achermann",
  "homepage": "https://retoachermann.ch",
  "status": "success",
  "content": "Reto Achermann | Assistant Professor UBC Reto Achermann Office: [ICICS Building, 341] CV: [a4.pdf] [letter.pdf] [LinkedIn] [GitHub] [DBLP] [Google Scholar] Introduction I am an Assistant Professor in the Systopia Lab at the Department of Computer Science of the University of British Columbia in Vancouver Canada. The goal of my research is to make systems more resilient and efficient. I work in the intersection of operating systems, applied formal methods and hardware models. Before that, I was a Postdoctoral Research Fellow working with Prof. Margo Seltzer. I did my PhD with Prof. Timothy Roscoe in the Systems Group at the Department of Computer Science, ETH Zurich. My PhD was about formally specifying the memory subsystem of a hardware platform as it is seen by software. Prospective Students I am currently NOT looking for more students. Checkout the Systopia Lab for other opportunities. If you are a UBC student interested in directed studies, honour's thesis or summer research projects, please see here. Letter of Recommendation If you are looking for a letter-of-recommendation, please see here. Updates Latest News and Upcoming Travel April 2, 2025 - Paper \"Velosiraptor: Code Synthesis for Memory Translation\" won the distinguished artifact award at ASPLOS'25. Nov 4, 2024 - Paper \"Verus: A Practical Foundation for Systems Verification\" has won the distinguished artifact award. October 1, 2024 - Our Paper 'Verus: A Practical Foundation for Systems Verification' was accepted at SOSP'24 September 28, 2024 - I'll be serving on the USENIX ATC'25 PC. July 1, 2024 - I'm delighted to join the CS Department at the University of British Columbia as an Assistant Professor. I'm looking forward to working with the amazing faculty and students at UBC. Biography Reto Achermann is an Assistant Professor in the Computer Science Department at the University of British Columbia. His research interests are at the intersection of memory and storage systems, hardware platforms, formal specification and verification, device drivers, and software synthesis. The main goal of his research is to help developers build more reliable system software while at the same time reducing development efforts. He was part of the core Barrelfish operating system team, working on various subsystems such as memory management, capabilities, hardware abstractions, and device drivers. Before joining the University of British Columbia as an Assistant Professor, he was a Postdoctoral Research Fellow at the Systopia Lab of the Computer Science Department at the University of British Columbia working with Prof. Margo Seltzer. Reto Achermann received a Doctor of Science from ETH Zurich where he was advised by Prof. Timothy Roscoe. His thesis \"On Memory Addressing\" presents a formal model of address decoding in computer systems and its implementation in a capability-based kernel. He also holds an MSc in Computer Science from ETH Zurich. He served on the program committees of ASPLOS, PLDI, EuroSys and Usenix ATC. While at the University of British Columbia, he received the Faculty of Science Excellence in Service Award for his engagement in the education of undergraduate and graduate students. Contact The University of British Columbia Department of Computer Science 2366 Main Mall ICICS Building, Office 341 Vancouver, BC V6T 1Z4 Canada achreto [at] cs.ubc.ca +1 604 827 2446",
  "content_length": 3383,
  "method": "requests",
  "crawl_time": "2025-12-01 14:16:58"
}