{
  "name": "Reuben N. S. Rowe",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/reuben-rowe(70354339-7bc5-475d-b8d5-7fa95114d851).html",
  "status": "success",
  "content": "Reuben Rowe - Royal Holloway Research Portal Reuben Rowe Dr Centre for Programming Languages and SystemsSenior Lecturer in Computer Science, Department of Computer Science https://orcid.org/0000-0002-4271-9078 Phone+44 1784 443483EmailReuben.Rowerhul.acuk TW20 0EX Personal profile Personal profileI started as a lecturer at Royal Holloway in August 2019. Prior to that I worked as a postdoctoral researcher in the PLAS group at the University of Kent and the PPLV group at University College London. Before that, I spent some time as a Teaching Fellow at Imperial College London, where I was responsible for teaching and admissions for the MSc in Computing Science. I have also worked in industry as a web developer. See my personal web pages: https://www.cs.rhul.ac.uk/home/rrowe/Educational backgroundI obtained my BA in Computer Science from the University of Cambridge Computer Lab in 2004. I was a member of Fitzwilliam College. I was awarded my MSc (Distinction) in Advanecd Computing in 2008 and my PhD in 2013, both from Imperial College London.Research interestsMy research interests centre around formal program verification and Proof Theory. I am also interested in type systems and type-based analysis in general, with particular emphasis on intersection types and guarded recursive types. My wider research interests also include: programming languages and language design; fundamental models of computation (Lambda Calculus, Term Rewriting Systems, Process Calculi); Curry-Howard Isomorphisms; Logics for Computer Science. Trustworthy Refactoring Whilst at the University of Kent, I worked on the Trustworthy Refactoring project (EPSRC Grant EP/N028759/1) with Simon Thompson, Scott Owens, and Hugo Férée. The aim was to build a refactoring tool for the OCaml programming language in which refactoring instances can be formally verified to be behaviour preserving. We developed a prototype tool called ROTOR, and an abstract static semantics for a subset of OCaml that formalises our approach. Non-wellfounded/Cyclic Proof and Automated Verification I work on aspects of proof theory, specifically a notion of proof in which we allow derivations of infinite height but with a well-formedness condition that guarantees soundness. This essentially encodes forms of inductive reasoning. A natural finite representation of infinite proofs is using finite derivation trees with cycles, hence the term \"cyclic\" proof. I have investigated the theory of non-wellfounded and cyclic proofs in different contexts, including first order logic, Herbrand logics, and modal logics. I worked with James Brotherston at University College London on investigating how to expand verification techniques making use of separation logic and cyclic proofs. This project (funded by EPSRC Grant EP/K040049/1) focussed on the development of the Cyclist theorem proving framework. My work in particular added capabilities for proving termination of procedural code with recursion. Other Projects I like thinking about the Factorisation Calculus, which is a combinatory rewrite system that has the capability to analyse the syntactic structure of a wide class of its own terms. This makes it a good candidate for a fundamental model in which to study issues like intensional computation, reflection, and meta-programming. I have described an encoding of the Factorisation Calculus into Lambda Calculus; I have also supervised an MEng dissertation, where we looked at a structural type system for the Factorisation Calculus. An older research interest, which has been on the back burner for a while, is in frameworks for extensible programming languages, and recursive adaptive grammars (RAGs) in particular. I have written a RAG-based parser in Java which is hosted on Sourceforge. (I really should move this over to Github, or similar!) Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 12 Conference contribution 4 Article 2 Abstract Research output per year Research output per year The Complex(ity) Landscape of Checking Infinite DescentCohen, L., Jabarin, A., Popescu, A. & Rowe, R. N. S., 5 Jan 2024, In: Proceedings of the ACM on Programming Languages. 8, POPL, p. 1352-1384 33 p., 46.Research output: Contribution to journal › Article › peer-review Open AccessFile 30 Downloads (Pure) Cyclic program synthesisItzhaky, S., Peleg, H., Polikarpova, N., Rowe, R. N. S. & Sergey, I., 18 Jun 2021, PLDI 2021 - Proceedings of the 42nd ACM SIGPLAN International Conference on Programming Language Design and Implementation. Freund, S. N. & Yahav, E. (eds.). Association for Computing Machinery (ACM), p. 944-959 16 p. (Proceedings of the ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Deductive Synthesis of Programs with Pointers: Techniques, Challenges, Opportunities Itzhaky, S., Peleg, H., Polikarpova, N., Rowe, R. N. S. & Sergey, I., 15 Jul 2021, Computer Aided Verification - 33rd International Conference, CAV 2021, Proceedings. Silva, A. & Leino, K. R. (eds.). Springer Science and Business Media Deutschland GmbH, p. 110-134 25 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 12759 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Integrating Induction and Coinduction via Closure Operators and Proof CyclesCohen, L. & Rowe, R. N. S., 24 Jun 2020, Automated Reasoning - 10th International Joint Conference, IJCAR 2020, Proceedings. Peltier, N. & Sofronie-Stokkermans, V. (eds.). Springer, p. 375-394 20 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 12166 LNAI).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 93 Downloads (Pure) Non-well-founded Proof Theory of Transitive Closure LogicCohen, L. & Rowe, R., Aug 2020, In: ACM Transactions on Computational Logic. 21, 4, p. 1-31 31 p., 31.Research output: Contribution to journal › Article › peer-review Open AccessFile 113 Downloads (Pure) View all 18 research outputs",
  "content_length": 6583,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:01"
}