{
  "name": "Reyer Zwiggelaar",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/rrz",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityProf Reyer Zwiggelaar Ir (Groningen), PhD (University College London) Professor Department of Computer Science Assistant Faculty Pro Vice-Chancellor (Research) Contact Details Email: rrz@aber.ac.uk ORCID: 0000-0002-4360-0896 Office: B61, Llandinam Building Phone: +44 (0) 1970 628691 Google Scholar: https://scholar.google.co.uk/citations?user=NZldyesAAAAJ Research Portal Profile Profile Reyer Zwiggelaar received the Ir. Degree in Applied Physics from the State University Groningen, Groningen, The Netherlands, in 1989, and the Ph.D. Degree in Electronic and Electrical Engineering from the University College London, London, UK, in 1993. He is currently a Professor at the Department of Computer Science, Aberystwyth University, UK. He is the author or co-author of more than 180 conference and journal papers. His current research interests include Medical Image Understanding, especially Focusing on Mammographic and Prostate Data, Pattern Recognition, Statistical Methods, Texture-Based Segmentation, and Feature-Detection Techniques. Additional Information ResponsibilitiesAs Head of the Graduate School, Professor Reyer Zwiggelaar is responsible for the provision of postgraduate education within the University as a whole, and also has a coordinating role in relation to the development of policy on postgraduate matters; the provision of facilities for postgraduates; and the monitoring of academic progress of postgraduate students. Teaching Module Coordinator PGM2210 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM1610 - Public Engagement and Impact PGM2310 - Research Skills and Personal Development (Science) (2310) PGM2610 - Reading and Writing Development Group PGM6310 - Subject Specific Research Skills PGM2610 - Reading and Writing Development Group PGM6410 - Writing your first Journal Article PGM2510 - Grants Development Workshops PGM5060 - Pilot Doctoral Enquiry Project PGM8110 - How to Organise a Conference Coordinator PGM6410 - Writing your first Journal Article PGM8110 - How to Organise a Conference PGM6310 - Subject Specific Research Skills PGM6410 - Writing your first Journal Article PGM5060 - Pilot Doctoral Enquiry Project PGM5060 - Pilot Doctoral Enquiry Project PGM5060 - Pilot Doctoral Enquiry Project PGM5060 - Pilot Doctoral Enquiry Project PGM4940 - Work Based Research in Professional Contexts PGM4940 - Work Based Research in Professional Contexts PGM4940 - Work Based Research in Professional Contexts PGM4820 - Orientation in Professional Research PGM4820 - Orientation in Professional Research PGM4820 - Orientation in Professional Research PGM4710 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM4710 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM4710 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM4510 - Qualitative Data Collection and Analysis (1710) PGM4510 - Qualitative Data Collection and Analysis (1710) PGM4510 - Qualitative Data Collection and Analysis (1710) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4120 - Research Skills and Personal Development (0120) PGM4120 - Research Skills and Personal Development (0120) PGM4120 - Research Skills and Personal Development (0120) PGM4005 - Ethics, Plagiarism and Academic Practice for Research Students PGM4005 - Ethics, Plagiarism and Academic Practice for Research Students PGM4005 - Ethics, Plagiarism and Academic Practice for Research Students PGM2610 - Reading and Writing Development Group PGM2610 - Reading and Writing Development Group PGM2510 - Grants Development Workshops PGM2210 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM2310 - Research Skills and Personal Development (Science) (2310) PGM1610 - Public Engagement and Impact Tutor PGM5410 - Research Seminar Skills in Physical Sciences PGM0010 - Practice based research skills in Art and Design PGM0010 - Practice based research skills in Art and Design PGM0210 - Principles of Research Design PGM0310 - Qualitative Data Collection and Analysis (0310) PGM0410 - Ways of Reading PGM0720 - Qualitative Data Collection and Analysis (0720) PGM0810 - Qualitative Data Collection and Analysis (0810) PGM0910 - Statistics in context: collecting, handling and presenting data PGM1010 - Quantitative Data Collection and Analysis (for social scientists) PGM1010 - Quantitative Data Collection and Analysis (for social scientists) PGM1210 - Manuscript Skills: Post Medieval Palaeographic and Diplomatic PGM1610 - Public Engagement and Impact PGM1910 - Leadership for Researchers PGM2010 - Specialist Research Skills for scientists PGM2210 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM2310 - Research Skills and Personal Development (Science) (2310) PGM2410 - Research Seminar Skills in the Life Sciences PGM2510 - Grants Development Workshops PGM2610 - Reading and Writing Development Group PGM2610 - Reading and Writing Development Group PGM2710 - Theoretical Foundations of Research in Law and Criminology PGM2810 - Skills in Bioinformatics for Biologists PGM3410 - Using Manuscript Sources for Medieval Studies: palaeography and diplomatic PGM3510 - Sources for Postgraduate Research in the Modern Humanities and Social Sciences PGM3610 - Texts that made the Middle Ages: Latin for postgraduates PGM3710 - Designing Criminological Research PGM4005 - Ethics, Plagiarism and Academic Practice for Research Students PGM4005 - Ethics, Plagiarism and Academic Practice for Research Students PGM4005 - Ethics, Plagiarism and Academic Practice for Research Students PGM4120 - Research Skills and Personal Development (0120) PGM4120 - Research Skills and Personal Development (0120) PGM4120 - Research Skills and Personal Development (0120) PGM4210 - Principles of Research Design PGM4210 - Principles of Research Design PGM4210 - Principles of Research Design PGM4310 - Quantitative Data Collection and Analysis PGM4310 - Quantitative Data Collection and Analysis PGM4310 - Quantitative Data Collection and Analysis PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4420 - Qualitative Data Collection and Analysis (1120) PGM4510 - Qualitative Data Collection and Analysis (1710) PGM4510 - Qualitative Data Collection and Analysis (1710) PGM4510 - Qualitative Data Collection and Analysis (1710) PGM4610 - Leadership for Researchers PGM4610 - Leadership for Researchers PGM4610 - Leadership for Researchers PGM4610 - Leadership for Researchers PGM4710 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM4710 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM4710 - Research Skills and Personal Development (Arts and Humanities) (2210) PGM4820 - Orientation in Professional Research PGM4820 - Orientation in Professional Research PGM4820 - Orientation in Professional Research PGM4940 - Work Based Research in Professional Contexts PGM4940 - Work Based Research in Professional Contexts PGM4940 - Work Based Research in Professional Contexts PGM5060 - Pilot Doctoral Enquiry Project PGM5060 - Pilot Doctoral Enquiry Project PGM5060 - Pilot Doctoral Enquiry Project PGM5060 - Pilot Doctoral Enquiry Project PGM6210 - Philosophy and Contemporary Culture PGM6310 - Subject Specific Research Skills PGM6410 - Writing your first Journal Article PGM6410 - Writing your first Journal Article PGM8110 - How to Organise a Conference Professor of the Department of Computer Science, Aberystwyth University, UK. Publications Li, G, Zhou, M, Fu, Y, Alam, N, Denton, ERE & Zwiggelaar, R 2025, 'An interpretable CNN-based model for mass classification in mammography', Knowledge-Based Systems, vol. 316, 113372. 10.1016/j.knosys.2025.113372Maurya, L, Zwiggelaar, R, Chawla, D & Mahapatra, P 2025, 'Contactless apnea event detection using visible-thermal imaging', Signal, Image and Video Processing, vol. 19, no. 5, 389. 10.1007/s11760-025-03959-2Suchak, T, Aliu, AE, Harrison, C, Zwiggelaar, R, Geifman, N & Spick, M 2025, 'Explosion of formulaic research articles, including inappropriate study designs and false discoveries, based on the NHANES US national health database', PLoS Biology, vol. 23, no. 5, e3003152. 10.1371/journal.pbio.3003152Dutta, SJ, Boongoen, T & Zwiggelaar, R 2025, 'Human activity recognition: A review of deep learning-based methods', IET Computer Vision, vol. 19, no. 1, e70003. 10.1049/cvi2.70003Dutta, S, Boongoen, T & Zwiggelaar, R 2025, 'Human Activity Recognition with Noise-Injected Time-Distributed AlexNet', Biomimetics, vol. 10, no. 9, 613. 10.3390/biomimetics10090613More publications on the Research Portal",
  "content_length": 9056,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:01"
}