{
  "name": "Reyhan Aydogan",
  "homepage": "https://faculty.ozyegin.edu.tr/reyhanaydogan",
  "status": "success",
  "content": "Reyhan Aydoğan | Assistant Professor in Computer Science at Ozyegin University Skip to primary content I am an associate professor in Artificial Intelligence and Data Engineering and Computer Science at Ozyegin University and a research fellow in the Interactive Intelligence Group at Delft University of Technology. I am the chair of the Department of Artificial Intelligence and Data Engineering since April 2024. My main research focuses on the modeling, development and analysis of agent technology that integrates different aspects of intelligence such as reasoning, decision making and learning. I am applying artificial intelligent techniques such as machine learning and semantic reasoning in designing and developing agent-based decision support systems, e.g. negotiation support systems and automated negotiation tools where intelligent software negotiates on behalf of their users. I am particularly interested in supporting human decision makers in complex and dynamic environments, which also requires the design of effective human computer interaction (e.g. preference elicitation). Working Experience: (2024 – present) Associate Professor, Artificial Intelligence and Data Engineering, Ozyegin University, Istanbul, Turkey. (2024 – present) Associate Professor, Computer Science, Ozyegin University, Istanbul, Turkey. (2015 – 2024) Assistant Professor, Computer Science, Ozyegin University, Istanbul, Turkey. (2015- present) Research Fellow, Interactive Intelligence Group, Department of  Intelligent    Systems,  Faculty of Electrical Engineering, Mathematics and Computer Science, Delft, the Netherlands. (2011 – 2015)   Postdoc Researcher, Interactive Intelligence Group, Department of  Intelligent    Systems,  Faculty of Electrical Engineering, Mathematics and Computer Science, Delft, the Netherlands. (2007 – 2011) Teaching/Research Assistant, Department of Computer Engineering, Boğaziçi University, Istanbul, Turkey. Research Visits: Visiting Researcher, Universidad de Alcala, Alcala de Henares, Madrid, Spain, July 2023. Visiting Professor, Frontier Research Institute for Information Science,Nagoya Institute of Technology, June-July  2017. Guest Lecturer and Researcher, Norwegian University of Science and Technology, February 2015. Visiting Scholar, The Center for Collective Intelligence (CCI) , Massachusetts Institute of Technology (MIT), Cambridge, United States of America, July-August 2013. Accessibility: Research Gate Scholar Google ORCID How to reach me: Office Number: EF. 302 Office Phone Number: +90 216 564 94 75 Email: reyhan.aydogan_AT_ozyegin.edu.tr Address: Ozyegin University, Computer Science, Nişantepe Mah. Orman Sok. No:34-36, Alemdağ, Çekmeköy, Istanbul 34794 TURKEY Recent Posts",
  "content_length": 2732,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:01"
}