{
  "name": "Reyhaneh Jabbarvand Behrouz",
  "homepage": "http://reyhaneh.cs.illinois.edu",
  "status": "success",
  "content": "Home Assistant Professor Department of Computer Science University of Illinois Address 2106 Siebel Center 201 N Goodwin Avenue Urbana, IL 61801 Email reyhaneh@illinois.edu Biography: I am an Assistant Professor in the Department of Computer Science at the University of Illinois at Urbana-Champaign. I obtained my PhD from University of California at Irvine, under supervision of Dr. Sam Malek. I have been awarded the Google PhD Fellowship in Programing Technology and Software Engineering for my work on advancing energy testing of Android and have been recognized as a Rising Star in EECS. I am recipient of NSF CAREER Award and my research has been supported by generous grants from NSF, IBM Research, Amazon, and C3.ai. Research: My research interests lie in the field of programming languages and software engineering, with a focus on improving software quality, reliability, and maintenance thorough neuro-symbolic approaches. I am the director of Intelligent CAT Lab working with a team of awesome PhD, Master's, undergrad, and high school students. Please refer to my Google Scholar and Intelligent CAT Lab Google Scholar page for the most recent list of publicly available publications and pre-prints. Students: Ali Reza Ibrahimzada (PhD) [Fall'22]: Third place at ACM SRC (ICSE'24) Yang Chen (PhD, co-advised with Darko Marinov) [Fall'22]: Second Place at ACM SRC (ICSE'24) Changshu Liu (PhD) [Fall'23] Shuyang Liu (PhD) [Fall'24] Saman Dehghan (MS) [Fall'25] I also had a blast to work with 50+ amazing undergraduate and high school students who contributed to lab's research through UIUC+ summer research program in software engineering (now at Berkeley, CMU, Cornell, Georgia Tech, Stanford, UIUC, UMass Amherst, UT Austin, and many other amazing places). The call for UIUC+ program for summer 2026 will be out around the end of January 2026. I am always looking for highly motivated and self-driven PhD students, who are interested to apply AI and mathematical optimization techniques to solve real-world software engineering problems. Please read my papers before reaching out to ensure your background and interests match my research. Recent Talks: [2025] Algorithm Seminar at DeepMind, AICE Fall Symposium (Keynote), Columbia Software Engineering Seminar, Cornell Software Engineering Seminar, New Faculty Symposium (FSE) [2024] ML4Code Seminar at JetBrains, IBM Research, IFIP Working Group 2.4, Winter Seminar Series at Sharif University of Technology, York University AI+SE Seminar Series [2023] Global PhD Fellowship Summit, IFIP Working Group 2.4, Dagstuhl seminar 23062, Winter Seminar Series at Sharif University of Technology, IBM Research, Microsoft Azure Research Group Service: For most recent list of external serive, please visit my conf.researchr profile.",
  "content_length": 2787,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:03"
}