{
  "name": "Rezaul Alam Chowdhury",
  "homepage": "http://www3.cs.stonybrook.edu/~rezaul",
  "status": "success",
  "content": "Rezaul A. Chowdhury Associate Professor Department of Computer Science 239 New Computer Science Building Stony Brook University Stony Brook, NY 11794-2424 USA Email: rezaul AT cs DOT stonybrook DOT edu I was on sabbatical leave to MIT in 2023. Here is one of the several groups I was (and still am) working with. I lead the Theoretical and Experimental Algorithmics (TEA) Group where we concentrate on both algorithm design and algorithm engineering. I have a joint appointment with the Institute for Advanced Computational Science (IACS). I received my Ph.D. from the Department of Computer Sciences, UT Austin, working with Professor Vijaya Ramachandran, and defending this: \"Cache-efficient Algorithms and Data Structures: Theory and Experimental Evaluation\". Prior to joining SBU, I was in Boston working with Professor Sandor Vajda's Structural Bioinformatics Group at Boston University, and Professor Charles Leiserson's SuperTech Research Group at MIT. Before moving to Boston, I was a postdoctoral fellow at the Computational Visualization Center (CVC), Institute for Computational Engineering & Sciences (ICES), University of Texas at Austin. I worked with Professor Chandrajit Bajaj. (Link to an old page of mine that still exists: MIT) I am a Bachelor of Science in Computer Science & Engineering from Bangladesh University of Engineering & Technology. My undergraduate supervisor was Professor Mohammad Kaykobad to whom I am infinitely indebted. Research Interests ¤ Design and analysis of algorithms and data structures for combinatorial problems, especially, - Algorithms for massive datasets: external-memory, cache-oblivious, streaming, parallel, etc. - Algorithms for multicore computing. - Graph algorithms: static and dynamic, exact and approximate, etc. ¤ Computational Biology and Bioinformatics - structure-based drug design, protein-protein docking, protein flexibility, energetics, sequence alignment, etc. ¤ Computer-aided Algorithm Design. ¤ Experimental algorithmics. Publications Click here for a list (outdated), and here for recent publications supported by my NSF CAREER Award. Software Click here for a list. Teaching ¤ Analysis of Algorithms (CSE548/AMS542, Graduate): Fall 2023, Spring 2021, Fall 2019, Spring 2019, Fall 2017, Fall 2016, Fall 2015, Spring 2015, Spring 2014, Fall 2012. ¤ Parallel Programming (CSE613, Graduate): Spring 2019, Spring 2018, Spring 2017, Spring 2015, Fall 2013, Spring 2012. ¤ Supercomputing (CSE590, Graduate): Spring 2016, Spring 2012. ¤ Advanced Algorithms (CSE638, Graduate): Spring 2013. ¤ Analysis of Algorithms (CSE385, Undergraduate, Honors): Fall 2019. Algorithms Reading Group ¤ I organize the weekly Algorithms Reading Group meetings (co-taught with Esther Arkin, Michael Bender, Joe Mitchell, and Steve Skiena): Fall 2020, Spring 2020, Fall 2019, Spring 2019, Fall 2018, Spring 2018, Fall 2017, Spring 2017, Fall 2016, Spring 2016, Fall 2015, Spring 2015, Fall 2014, Spring 2014, Fall 2013, Spring 2013, Fall 2012. Competitive Programming for Algorithmic Problem Solving I am the faculty adviser of the SBU Competitive Programming Club and SBUCS ICPC teams. ¤ Click here to learn how our teams performed in the 2020 Greater New York regional contest, and here to learn how they did in 2018. Click here to learn about results prior to 2018. ¤ Stony Brook won a Bronze Medal in the 2016 North American Invitational Programming Contest. Click here for full results. Students PhD (Current) ¤ Shih-yu Tsai (co-advised) ¤ Zafar Ahmad ¤ Yimin Zhu ¤ Aaron Gregory Undergrad (Current) ¤ Reilly Browne (SBU) PhD (Graduated) ¤ Jesmin Jahan Tithi (Graduated in Fall 2015, now Research Scientist @ Intel Labs) ¤ Pramod Ganapathi (Graduated in Fall 2016, now Research Assistant Professor @ CS, Stony Brook University) ¤ Mohammad Mahdi Javanmard (Graduated in Spring 2020, co-advised, now Research Scientist @ Facebook) ¤ Rathish Das (Graduated in Winter 2021, co-advised, now Faculty @ University of Liverpool, UK) MS (Graduated, Thesis) ¤ Sharmila Duppala (Graduated in Summer 2019, now PhD student @ UMD, College Park) MS (Graduated, Advanced Project, 25+) ¤ Click here for a list. Undergrad (Former) ¤ Stephen Tschudi (SBU) ¤ Charles Bachmeier (MIT UROP) ¤ Rohit Datta (SBU) ¤ Jeremy Herrmann (SBU) ¤ Gregory Croisdale (UTK / IACS DCD) ¤ Layth Yassin (Cooper Union / IACS DCD) ¤ Jarin Hawlader (SBU) ¤ Isa Faridi (UMD, Baltimore County / IACS DCD) High School Students (Former) ¤ Rahul Ram (Ward Melville Senior High School, now an Undergraduate student at Columbia University) Fun Stuff ¤ My Erdös Number is 3. Click here to see how. ¤ Click here for my acedamic genealogy extracted from the Mathematics Genealogy Project which traces back to the 17th century German mathematician Erhard Weigel. ¤ Click here for a list of contest problems I designed a long time back when I used to train BUET programming teams for ACM ICPC, and here for a list of programming contests in which I contributed as a problem setter. ¤ Click here for a picture of mine as a contestant in the ACM ICPC World Finals a long time back when I was an undergrad! ¤ Click here for a few screenshots of an antivirus program I wrote with two of my friends a long long time ago when we were 2nd year (sophomore) undergraduate students at BUET. It cleaned only one specific, brand-new virus but nonetheless saw widespread use in Bangladesh, since other antivirus programs had not yet added that virus to their databases.",
  "content_length": 5454,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:08"
}