{
  "name": "Reza Haffari",
  "homepage": "https://research.monash.edu/en/persons/reza-haffari",
  "status": "success",
  "content": "Reza Haffari - Monash University Reza Haffari public CV View Scopus Profile Reza Haffari Professor ARC Future Fellow, Department of Data Science & AI https://orcid.org/0000-0001-7326-8380 EmailGholamreza.Haffarimonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 20022025 Research activity per year Personal profile BiographyReza's work is focused on Artificial Intelligence (AI), particularly in low-level perception and high-level reasoning under uncertainty, mainly from text and potentially from other data modalities such as vision and speech. His research tackles problems such as: Understanding and generating natural language text eg translating documents from one language to another while keeping the document's coherency/semantics intact. Effective training of deep neural networks with minimal human supervision as this powerful technology is data hungry, eg through interaction with human to achieve effective lifelong learning. Explaining the outcome of black-box computational models in order to make them trustable in critical decision making scenarios such as digital health. Monash teaching commitmentReza has experience as the Chief Examiner for the following units in the Faculty of IT: FIT1045 Algorithms and programming fundamentals in pythonFIT1053 Algorithms and programming fundamentals in python (advanced)FIT2004 Algorithms and data structuresFIT5201 Data analysis algorithms Reza has experience as the Lecturer for the following units in the Faculty of IT: FIT1045 Algorithms and programming fundamentals in pythonFIT2004 Algorithms and data structuresFIT3080 Intelligent systemsFIT4005/FIT5185 IT research methodsFIT4009 Advanced topics in intelligent systemsFIT5201 Data analysis lgorithms Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Simon Fraser UniversityAward Date: 26 Feb 2010Artificial Intelligence, Master of Science, Sharif University of TechnologyAward Date: 31 Aug 2002Software Engineering, Bachelor of Science, Sharif University of TechnologyAward Date: 31 Aug 2000 Research area keywordsNatural Language ProcessingDeep LearningArtificial intelligenceMachine Learning Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2013 2019 2022 2023 2027 1 Curtailed 9 Active 20 Finished Projects per year SEA-AI: SEA-AI: Neuro-Symbolic Enhanced Autonomy for Maritime Scene Understanding and ReasoningRezatofighi, H. (Primary Chief Investigator (PCI)), Haffari, R. (Chief Investigator (CI)) & Rastgoo, N. (Chief Investigator (CI))11/07/25 → 10/07/26Project: Research Lifelong Version-controlled Code Generation: Lifelong Version-controlled Code GenerationHaffari, R. (Primary Chief Investigator (PCI)) & Wu, T. (Chief Investigator (CI))7/07/25 → 6/07/26Project: Research Bidirectional trust modelling: Bidirectional trust modelling in Human-machine teaming in dynamic environmentsRastgoo, N. (Primary Chief Investigator (PCI)) & Haffari, R. (Chief Investigator (CI))10/01/25 → 9/01/27Project: Research TMLGenAI: Trustworthy Generative AI: Towards Safe and Aligned Foundation ModelsPhung, D. (Primary Chief Investigator (PCI)), Vu, T. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Webb, G. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Ke, Q. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)) & Bui, T. (Chief Investigator (CI))11/06/24 → 10/07/26Project: Research Aligning Large Language Models with Human Intention: Aligning Large Language Models with Human IntentionHaffari, R. (Primary Chief Investigator (PCI)) & Vu, T. (Chief Investigator (CI))4/07/23 → 21/12/26Project: Research View all 30 projects Research output Research output per year 2002 2017 2018 2019 2020 2021 2022 2023 2024 2025 174 Conference Paper 32 Article 3 Review Article 1 Commissioned Report 3 More 1 Chapter (Book) 1 Foreword / Postscript 1 Other Research output per year Research output per year Active Continual Learning: On Balancing Knowledge Retention and LearnabilityVu, T.-T., Khadivi, S., Ghorbanali, M., Phung, D. & Haffari, G., 2025, AI 2024, AI 2024: Advances in Artificial Intelligence, 37th Australasian Joint Conference on Artificial Intelligence, AI 2024 Melbourne, VIC, Australia, November 25–29, 2024 Proceedings, Part II. Gong, M., Song, Y., Koh, Y. S., Xiang, W. & Wang, D. (eds.). Singapore Singapore: Springer, p. 137-150 14 p. (Lecture Notes in Computer Science; vol. 15443).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Audio Is the Achilles’ Heel: Red Teaming Audio Large Multimodal ModelsYang, H., Qu, L., Shareghi, E. & Haffari, R., 2025, NAACL 2025, Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics Proceedings of the Conference Volume 1: Long Papers. Chiruzzo, L., Ritter, A. & Wang, L. (eds.). Kerrville TX USA: Association for Computational Linguistics (ACL), p. 9292–9306 15 p. 2025.naacl-long.470Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Extending LLMs to New Languages: A Case Study of Llama and Persian AdaptationSani, S. M., Sadeghi, P., Vu, T.-T., Yaghoobzadeh, Y. & Haffari, G., 2025, COLING 2025, The 31st International Conference on Computational Linguistics, Proceedings of the Main Conference. Rambow, O., Wanner, L., Apidianaki, M., Al-Khalifa, H., Di Eugenio, B. & Schockaert, S. (eds.). Stroudsburg PA USA: Association for Computational Linguistics (ACL), p. 8868-8884 17 p. (Proceedings - International Conference on Computational Linguistics, COLING; vol. Part F206484-1).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 1 Citation (Scopus) Causal Discovery Inspired Unsupervised Domain Adaptation for Emotion-Cause Pair ExtractionHua, Y., Huang, Y., Huang, S., Feng, T., Qu, L., Bain, C., Bassed, R. & Haffari, G., 2024, EMNLP 2024, The 2024 Conference on Empirical Methods in Natural Language Processing, Findings of EMNLP 2024. Al-Onaizan, Y., Bansal, M. & Chen, Y.-N. (eds.). Kerrville TX USA: Association for Computational Linguistics (ACL), p. 8139-8156 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 1 Citation (Scopus) Direct Evaluation of Chain-of-Thought in Multi-hop Reasoning with Knowledge GraphsNguyen, M.-V., Luo, L., Shiri, F., Phung, D., Li, Y. F., Vu, T. T. & Haffari, G., 2024, 62nd Annual Meeting of the Association for Computational Linguistics, ACL 2024 - Proceedings of the Conference. Ku, L.-W., Martins, A. & Srikumar, V. (eds.). Kerrville TX USA: Association for Computational Linguistics (ACL), p. 2862-2883 22 p. (Proceedings of the Annual Meeting of the Association for Computational Linguistics).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 5 Citations (Scopus) View all 213 research outputs Activities Activities per year 2016 2016 2016 2 Committees and working groups 1 Professional association or peak discipline body Activities per year Member - Faculty Education Committee - Faculty of Information Technology, Monash UniversityHaffari, R. (Member)1 Jan 2016Activity: External Academic Engagement › Committees and working groups Member - Faculty Research Committee - Faculty of Information Technology, Monash UniversityHaffari, R. (Member)1 Jan 2016Activity: External Academic Engagement › Committees and working groups Course Director - Graduate Diploma of Data Science - Faculty of Information Technology, Monash UniversityHaffari, R. (Executive Member)1 Jan 2016Activity: External Academic Engagement › Professional association or peak discipline body",
  "content_length": 8505,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:05"
}