{
  "name": "Riad S. Wahby",
  "homepage": "https://wahby.net",
  "status": "success",
  "content": "Riad S. Wahby Riad S. Wahby (he/him) My name sounds vaguely like the email subject line \"Re: odd,\" but that's just a coincidence. I'm an Assistant Professor in ECE at CMU, working on designing and building secure hardware and software systems. I like to think about questions like \"how can we build trustworthy chips?\" and \"how can we build operating systems that resist subversion by malicious hardware?\" I've recently been focusing on proof systems and cryptography. I am always looking for great PhD students! If you are interested in research related to cryptography, security, and software or hardware systems, we might be a good fit. I strongly recommend applying to both the ECE and CS PhD programs, and of course please feel free to send me an email. Apologies in advance: I may not respond quickly to your email, but I will try. In addition, please note that CMU admissions are department-wide: I cannot admit you directly into my group. Please submit an application! I used to be a student at Stanford, working with Dan Boneh and Keith Winstein. Before that, I was a Junior Research Scientist in NYU's Computer Science department and a Visiting Researcher at UT Austin, in both cases working for Mike Walfish; and before jumping into computer science research, I spent ten years as a Staff Design Engineer building analog and mixed-signal integrated circuits at Silicon Labs. Long, long ago I received my SB and MEng from MIT. As a master's student, I worked in LEES for David Perreault. For the latest dirt, consult my CV. publications COBBL: Dynamic constraint generation for SNARKs Kunming Jiang, Fraser Brown, and Riad S. Wahby. IEEE Symposium on Security and Privacy, Oakland25, May 2025. ALPACA: Anonymous Blocklisting with Constant-Sized Updateable Proofs Jiwon Kim, Abhiram Kothapalli, Orestis Chardouvelis, Riad S. Wahby, and Paul Grubbs. IEEE Symposium on Security and Privacy, Oakland25, May 2025. Universal Composability is Robust Compilation Marco Patrignani, Robert Künnemann, Riad S. Wahby, and Ethan Cecchetti. ACM Transactions on Programming Languages and Systems, TOPLAS Vol 46, No 4, December 2024. Presented at POPL 25, January 2025. Open access: ACM Digital Library. Bending microarchitectural weird machines towards practicality Ping-Lun Wang, Riccardo Paccagnella, Riad S. Wahby, and Fraser Brown. USENIX Security Symposium, Security24, August 2024. Open access: USENIX Association. NOTRY: Deniable messaging with retroactive avowal Faxing Wang, Shaanan Cohney, Riad S. Wahby, and Joseph Bonneau. Privacy Enhancing Technology Symposium, PETS24, July 2024. Technical report: Cryptology ePrint 2023/1926. Unlocking the lookup singularity with Lasso Srinath Setty, Justin Thaler, and Riad S. Wahby. IACR International Conference on the Theory and Applications of Cryptographic Techniques, EUROCRYPT24, . Technical report: Cryptology ePrint 2023/1216. Riggs: Decentralized sealed-bid auctions Nirvan Tyagi, Arasu Arun, Cody Freitag, Riad S. Wahby, Joseph Bonneau, and David Mazières. ACM Conference on Computer and Communications Security, CCS23, November 2023. Technical report: Cryptology ePrint 2023/1336. Checking passwords on leaky computers: a side-channel analysis of Chrome's password leak detection protocol Andrew Kwong, Walter Wang, Jason Kim, Jonathan Berger, Daniel Genkin, Eyal Ronen, Hovav Shacham, Riad S. Wahby, and Yuval Yarom. USENIX Security Symposium, Security23, August 2023. Brakedown: Linear-time and post-quantum SNARKs for R1CS Alexander Golovnev, Jonathan Lee, Srinath Setty, Justin Thaler, and Riad S. Wahby. IACR International Cryptology Conference, CRYPTO23, August 2023. Technical report: Cryptology ePrint 2021/1043. An older version of this paper is available as Cryptology ePrint 2021/030. Hashing to Elliptic Curves Armando Faz-Hernandez, Sam Scott, Nick Sullivan, Riad S. Wahby, and Christopher A. Wood. IETF/IRTF RFC 9380, August 2023. Bounded verification for finite-field blasting (in a compiler for zero-knowledge proofs) Alex Ozdemir, Riad S. Wahby, Fraser Brown, and Clark Barrett. International Conference on Computer Aided Verification, CAV23, July 2023. Technical report: Cryptology ePrint 2023/778. The ghost is the machine: weird machines in transient execution Ping-Lun Wang, Fraser Brown, and Riad S. Wahby. IEEE Workshop on Offensive Technologies, WOOT23, May 2023. Silph: A framework for scalable and accurate generation of hybrid MPC protocols Edward Chen, Jinhao Zhu, Alex Ozdemir, Riad S. Wahby, Fraser Brown, and Wenting Zheng. IEEE Symposium on Security and Privacy, Oakland23, May 2023. Technical report: Cryptology ePrint 2023/060. Specialized proof of confidential knowledge (SPoCK) Tarak Bin Youssef and Riad S. Wahby. Technical report: Cryptology ePrint 2023/082. Customizable constraint systems for succinct arguments. Srinath Setty, Justin Thaler, and Riad S. Wahby. Technical report: Cryptology ePrint 2023/552. CirC: Compiler infrastructure for proof systems, software verification, and more Alex Ozdemir and Fraser Brown and Riad S. Wahby. IEEE Symposium on Security and Privacy, Oakland22, May 2022. Technical report: Cryptology ePrint 2020/1586. Compact certificates of collective knowledge Silvio Micali, Leonid Reyzin, Georgios Vlachos, Riad S. Wahby, and Nickolai Zeldovich. IEEE Symposium on Security and Privacy, Oakland21, May 2021. Technical report: Cryptology ePrint 2020/1568. High-level high-speed high-assurance crypto Jonathan Cogan, Fraser Brown, Alex Ozdemir, and Riad S. Wahby. Principles of Secure Compilation, PriSC21, January 2021. Scaling verifiable computation using efficient set accumulators Alex Ozdemir, Riad S. Wahby, Barry Whitehat, and Dan Boneh. USENIX Security Symposium, Security20, August 2020. Technical report: Cryptology ePrint 2019/1494. An airdrop that preserves recipient privacy Riad S. Wahby, Dan Boneh, Christopher Jeffrey, and Joseph Poon. Financial Cryptography and Data Security, FC20, February 2020. Technical report: Cryptology ePrint 2020/676. Universal Composability is Secure Compilation Marco Patrignani, Riad S. Wahby, and Robert Künnemann. Principles of Secure Compilation, PriSC20, January 2020. Technical report: arXiv:1910.08634. Fast and simple constant-time hashing to the BLS12-381 elliptic curve  [slides | video] Riad S. Wahby and Dan Boneh. IACR Transactions on Cryptographic Hardware and Embedded Systems, CHES19, August 2019. Technical report: Cryptology ePrint 2019/403. FaCT: a DSL for timing-sensitive computation Sunjay Cauligi, Gary Soeller, Brian Johannesmeyer, Fraser Brown, Riad S. Wahby, John Renner, Benjamin Grégoire, Gilles Barthe, Ranjit Jhala, and Deian Stefan. ACM SIGPLAN Conference on Programming Language Design and Implementation, PLDI19, June 2019. Pantheon: the training ground for Internet congestion-control research  (Best paper award.) Francis Y. Yan, Jestin Ma, Greg Hill, Deepti Raghavan, Riad S. Wahby, Philip Levis, and Keith Winstein. USENIX Annual Technical Conference, ATC18, July 2018. Doubly-efficient zkSNARKs without trusted setup  [slides | video] Riad S. Wahby, Ioanna Tzialla, abhi shelat, Justin Thaler, and Michael Walfish. IEEE Symposium on Security and Privacy, Oakland18, May 2018. Technical report: Cryptology ePrint 2017/1132. Salsify: Low-latency network video through tighter integration between a video codec and a transport protocol Sadjad Fouladi, John Emmons, Emre Orbay, Catherine Wu, Riad S. Wahby, and Keith Winstein. USENIX Symposium on Networked Systems Design and Implementation, NSDI18, April 2018. Full accounting for verifiable outsourcing  [slides | video] Riad S. Wahby, Ye Ji, Andrew J. Blumberg, abhi shelat, Justin Thaler, Michael Walfish, and Thomas Wies. ACM Conference on Computer and Communications Security, CCS17, October 2017. Technical report: Cryptology ePrint 2017/242. Trust but verify: auditing secure Internet of Things devices Judson Wilson, Riad S. Wahby, Henry Corrigan-Gibbs, Dan Boneh, Philip Levis, and Keith Winstein. ACM International Conference on Mobile Systems, Applications, and Services, MobiSys17, June 2017. Finding and preventing bugs in JavaScript bindings Fraser Brown, Shravan Narayan, Riad S. Wahby, Dawson Engler, Ranjit Jhala, and Deian Stefan. IEEE Symposium on Security and Privacy, Oakland17, May 2017. Encoding, fast and slow: Low-latency video processing using thousands of tiny threads Sadjad Fouladi, Riad S. Wahby, Brennan Shacklett, Karthikeyan Vasuki Balasubramaniam, William Zheng, Rahul Bhalerao, Anirudh Sivaraman, George Porter, and Keith Winstein. USENIX Symposium on Networked Systems Design and Implementation, NSDI17, March 2017. Robust, low-cost, auditable random number generation for embedded system security  [slides] Ben Lampert, Riad S. Wahby, Shane Leonard, and Philip Levis. ACM Conference on Embedded Networked Sensor Systems, SenSys16, November 2016. Technical report: Cryptology ePrint 2016/884. Defending against malicious peripherals with Cinch Sebastian Angel, Riad S. Wahby, Max Howald, Joshua B. Leners, Michael Spilo, Zhen Sun, Andrew J. Blumberg, and Michael Walfish. USENIX Security Symposium, Security16, August 2016. Technical report: arXiv:1506.01449. Verifiable ASICs  [slides | video]  (Distinguished student paper award.) Riad S. Wahby, Max Howald, Siddharth Garg, abhi shelat, and Michael Walfish. IEEE Symposium on Security and Privacy, Oakland16, May 2016. Technical report: Cryptology ePrint 2015/1243. Efficient RAM and control flow in verifiable outsourced computation  [slides] Riad S. Wahby, Srinath Setty, Zuocheng Ren, Andrew J. Blumberg, and Michael Walfish. 22nd Network and Distributed System Security Symposium, NDSS15, San Diego, CA, February 2015. Technical report: Cyptology ePrint 2014/674. New architectures for radio frequency dc-dc power conversion Juan M. Rivas, Riad S. Wahby, John S. Shafran, and David J. Perreault. IEEE Transactions on Power Electronics, Volume 21, No. 2, March 2006. Conference paper: PESC04. Radio frequency rectifiers for dc-dc power conversion Riad S",
  "content_length": 12898,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:09"
}