{
  "name": "Ricarose Roque",
  "homepage": "http://www.ricarose.com",
  "status": "success",
  "content": "Ricarose Roque I am an associate professor in the Information Science department at CU Boulder with courtesy appointments in Computer Science and Learning Sciences and Human Development at the School of Education. I direct the Creative Communities research group and lead the Family Creative Learning project. I am recipient of an NSF CAREER award and the 2023 Jan Hawkins Award for Early Career Contributions to Humanistic Research and Scholarship in Learning Technologies. I was previously a member of the Lifelong Kindergarten research group at the MIT Media Lab, a member of the MIT Scratch Team, and faculty associate at the Berkman Klein Center for Internet and Society at Harvard University. I design and study equitable learning environments that enable young people to become computational creators — able to use computing to create things they care about, develop identities as creators, and imagine the ways they can shape the world. I draw on community-engaged, design-based, and ethnographic methods to study the role that social context plays in supporting childrenâs participation in computing, especially children from non-dominant groups who have been marginalized from opportunities because of race, ethnicity, immigration status, and/or socioeconomic status. Connect with me ricarose (at) colorado (dot) edu. Family Creative Learning Family Creative Learning is a series of family workshops that support intergenerational learning through the use of creative technologies like Scratch. The workshops are collaboratively designed with community centers that serve families from non-dominant groups in computing. Facilitating Computational Tinkering Our approach to computational tinkering aims to broaden the styles of engaging with computing, that is more social, physical, and cross-disciplinary. We especially focus on how facilitators, or informal learning educators, engage youth and families in equitable computational tinkering experiences. Selected Publications Roque, R. (2024) Joy as an Aesthetic: Reflections on Designing Transformative Learning Experiences. Adapted talk for the Jan Hawkins Award for Early Career Contributions to Humanistic Research and Scholarship in Learning Technologies at AERA 2024 and Colorado Library Association Maker Workshop. Philadelphia, PA and Greely, CO (respectively). Roque, R. (2023) Imagining Alternative Visions of Computing: Photo-Visuals of Material, Social, and Emotional Contexts from Family Creative Learning. Proceedings of the ACM Conference on Interaction Design and Children. Chicago, IL. Roque, R. & Tamashiro, M. (2022) Making Learning Visible in Constructionist Learning Contexts. Proceedings of the ACM Conference on Interaction Design and Children. Braga, Portugal. Roque, R., Tamashiro, M., McConnell, K. & Granados, J. (2021) Opportunities and Limitations of Construction Kits in Culturally Responsive Computing Contexts: Lessons from ScratchJr and Family Creative Learning. Proceedings of the ACM Conference on Interaction Design and Children. Online. Roque, R. (2020) Building Projects, Building Relationships: Designing for Family Learning. In Holbert, N., Berland, M., & Kafai, Y. (Eds.), Designing Constructionist Futures: The Art, Theory, and Practice of Learning Designs. Cambridge, MA: MIT Press. Roque, R. (2020) Qualities of Identity Resources in Creative Computing. In Gresalfi, M. & Horn, I.S., The Interdisciplinarity of the Learning Sciences: The International Conference ofthe Learning Sciences (ICLS) 2020, Volume 1 (pp. 207-214). Nashville, TN: International Society of the Learning Sciences. Roque, R. and Rusk, N. (2019). Youth perspectives on their development in a coding community. Information and Learning Sciences. 120 (5/6): 327-348. Roque, R. and Jain, R. (2018). Becoming facilitators of creative computing in out-of-school settings. Proceedings of the 13th International Conference of the Learning Sciences. London. Yu, J. and Roque, R. (2018) A survey of computational toys and kits for young children. Proceedings of the 17th ACM Conference on Interaction Design and Children. Trondheim, Norway. Roque, R., Dasgupta, S., Costanza-Shock, S. (2016) Children's civic engagement in the Scratch Online Community. Social Science. 5(4): 1-17. Roque, R., Lin, K., Liuzzi, R. (2016). \"I'm not just a mom\": Parents developing multiple roles in creative computing. Proceedings of the 12th International Conference of the Learning Sciences. Singapore. Roque, R. (2016). Family Creative Learning. In Peppler, K., Kafai, Y., & Halverson, E. (Eds.) Makeology in K-12, Higher, and Informal Education. New York, NY: Routeledge. Roque, R, Rusk, N., Resnick, M. (2016). Supporting diverse and creative collaboration in the Scratch online community. In Cress, U., Jeong, H., and Moskaliuk, J. (Eds.) Mass Collaboration and Education. Springer. Roque, R., Rusk, N., & Blanton, A. (2013) Youth roles and development of leadership in an online creative community. Proceedings of the 10th International Conference on Computer Supported Collaborative Learning (CSCL) (pp. 399-405). Madison, WI. Roque, R. (2007) OpenBlocks: An extendable framework for graphical block programming systems (Master's Thesis). Massachusetts Institute of Technology, Cambridge, MA. Selected Courses INFO 4608/5608 Community-Based Design (Spring 2019, Spring 2021) INFO 3505/5505 Designing for Creativity and Learning (Fall 2017, Fall 2018, Fall 2020) INFO 1201 Computational Reasoning 1 (Spring 2017, Spring 2018) INFO 1111 Representations (Fall 2016) MAS.S61 Unpacking Impact: Reflecting As We Make (Fall 2015) - Co-instructor MAS.712 Learning Creative Learning (Spring 2013) - Teaching Assistant",
  "content_length": 5666,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:29"
}