{
  "name": "Ricardo G. Sanfelice",
  "homepage": "https://hybrid.soe.ucsc.edu",
  "status": "success",
  "content": "Home | Ricardo Sanfelice Skip to main content CITRIS project on Hybrid Algorithms for Real-time Identification and Manipulation of Deformable Soft Tissues Home HIGHLIGHTS Pre-conference Workshop at the IEEE Conference on Decision and Control, Rio de Janeiro, Brazil: Workshop in Honor of Andrew R. Teel's 60th Birthday with Jorge Poveda and Rafal Goebel Tuesday, December 9, 2025 For more details, see here 5th Workshop Edition: Computation-Aware Algorithmic Design for Cyber-Physical Systems A co-located workshop of the 2025 CPS-IoT week, May 6-9, 2025 More details here The theme of CITRIS Aviation Prize 2024-2025 is Air Operations System Development It aims to advance air mobility by bringing University of California students, researchers and professionals together to design critical aviation subsystems, integrating air transit into campus transportation networks for efficient intercampus travel. Proposal deadline: November 15, 2024. More details here New book on cyber-physical systems: M. Prandini and R. G. Sanfelice, Computation-Aware Algorithmic Design for Cyber-Physical Systems, Systems & Control: Foundations & Applications: Birkhauser, December, 2023 Available at Springer.com Book on hybrid control: R. G. Sanfelice, Hybrid Feedback Control, Princeton University Press, January, 2021 Available at Amazon.com More details here Best viewed in a 1024px window SHORT BIO Ricardo Sanfelice is Professor and Chair at the Department of Electrical and Computer Engineering, University of California at Santa Cruz. Currently, he serves as Director for the Cyber-Physical Systems Research Center and the CITRIS Aviation Initiative. He received his B.S. in Electronics Engineering from the Universidad Nacional de Mar del Plata, Buenos Aires, Argentina, in 2001. He joined the Center for Control, Dynamical Systems, and Computation at the University of California, Santa Barbara in 2002, where he received his M.S. and Ph.D. degrees in 2004 and 2007, respectively. During 2007 and 2008, he was a Postdoctoral Associate at the Laboratory for Information and Decision Systems at MIT and at the Centre Automatique et Systemes at the Ecole de Mines de Paris. From 2009 to 2014, he was Assistant Professor in the Aerospace and Mechanical Engineering at the University of Arizona. Complete bio and photo here CV available here RESEARCH INTERESTS Modeling, stability, robust control, observer design, and simulation of nonlinear and hybrid systems with applications to power systems, robotics, aerospace, and biology. See selected projects and publications. PUBLICATIONS Publication list Google scholar Mathrevs SELECTED AWARDS AND HONORS Semi-plenary Speaker at the IFAC Symposium on Nonlinear Control Systems Fellow of IEEE Test-of-Time Award, ACM Hybrid Systems: Computation and Control Conference SIAM Control and Systems Theory Prize National Science Foundation (NSF) CAREER award Air Force Young Investigator Research Award (YIP) IEEE Control Systems Magazine Outstanding Paper Award Educator of the Year for Higher Education Semiplenary Speaker, IEEE Biennial Congress of Argentina Plenary Speaker,  Congreso Argentino de Control Automatico Plenary Speaker, XVIII Spanish Control Engineering Symposium Plenary Speaker, Society of Hispanic Professional Engineers National Conference Plenay Spearker, DYSCO Network Study Days Best Student Paper Award Finalist, American Control Conference (twice) Best Paper Award Finalist, International Conference on Automation Science and Engineering Blavatnik National Award for Young Scientists Campus Nominee ASEE Air Force Summer Faculty Fellow Senior Member of IEEE HIGHLIGHTS News history here New Book Computation-Aware Algorithmic Design for Cyber-Physical Systems Systems & Control: Foundations & Applications: Birkhauser Publisher's website Bibtex New Book Hybrid Feedback Control Princeton University Press Publisher's website Book page  Book errata  Bibtex Book Chapter Robust Distributed Estimation and Synchronization for Linear Systems with Limited Information In Control Subject to Computational and Communication Constraints Springer's Lecture Notes in Control and Information Sciences ONLINE New Center at UCSC Cyber-Physical Systems Research Center ONLINE Coursera MOOC Cyber-Physical Systems: Modeling and Simulation ONLINE Book Chapter Incremental Graphical Asymptotic Stability for Hybrid Dynamical Systems In Feedback Stabilization of Controlled Dynamical Systems Springer's Lecture Notes in Control and Information Sciences ONLINE Book Chapter Analysis and Design of Cyber-Physical Systems In Cyber Physical Systems: From Theory to Practice CRC Press ONLINE Book Chapter Feedback Control of Hybrid Dynamical Systems In Encyclopedia of Systems and Control Springer ONLINE YouTube Channel Hybrid Systems Lab ONLINE SIAM Plenary Control of Hybrid Dynamical Systems: From Cells to Power Networks ONLINE Book Chapter Control of Hybrid Dynamical Systems: An Overview of Recent Advances In Hybrid Systems with Constraints, Wiley ONLINE Bibtex Book Hybrid Dynamical Systems: Modeling, Stability, and Robustness Princeton University Press Publisher's website: http://press.princeton.edu/titles/9759.html. Chapter 1 (sample): http://press.princeton.edu/chapters/s9759.pdf Book page  Book errata  Bibtex Featured Article Hybrid Dynamical Systems: Robust Stability and Control IEEE Control Systems Magazine ONLINE  Bibtex EDUCATION Ph.D., Electrical and Computer Engineering University of California, Santa Barbara. Spring 2007. Dissertation Title: “Robust hybrid control systems.” M.S., Electrical and Computer EngineeringUniversity of California, Santa Barbara. Winter 2004. B.S., Electronic Engineering Universidad de Mar del Plata, Buenos Aires, Argentina. Fall 2001. Thesis Title: “Novel current control method for AC induction motors.” CONTACT Ricardo G. Sanfelice, Ph.D. Professor Department of Electrical and Computer Engineering University of California Santa Cruz1156 High Street  MS:SOE3Santa Cruz, CA 95064 Tel: (831) 459-1016 Fax: (831) 459-4046Url: http://hybrid.soe.ucsc.edu Email: before @ put ``ricardo'', and after the @ symbol write ucsc <dot > edu Search form Search Tweets by RGSanfelice Recent Publications HyRNN: Hybrid Recurrent Neural Networks for Approximating Hybrid Dynamical SystemsStochastic Approximation of Hybrid Systems: Boundedness and Asymptotic BehaviorLyapunov-like Descriptions of Strong Forward Invariance for Differential InclusionsTwo-Player Zero-Sum Hybrid GamesOn Robust Stability of Hybrid Limit Cycles in the Impulsive Goodwin's OscillatorHybrid Control of the Buck Converter for Global Asymptotic StabilizationGeometric Hybrid Dynamical Systems on Intrinsic Manifolds: Part II – Hybrid Invariance PrincipleMore... News Promoted to Full Professor! Our journal article \"Forward Invariance of Sets for Hybrid Dynamical Systems\" was published in IEEE Transactions on Automatic Control in 2018 as Full Paper New Journal Article Jun Chai receives a PhD from the University of California, Santa Cruz Dawn Hustigs-Schultz receives 2018 ARCS Foundation Fellowship",
  "content_length": 7057,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:14"
}