{
  "name": "Ricardo A. L. Reis",
  "homepage": "http://inf.ufrgs.br/~reis",
  "status": "success",
  "content": "Professor Ricardo Reis RICARDO REIS PROFESSOR HOME ACADEMIC BACKGROUND PROFESSIONAL EXPERIENCE ACTIVITIES International Brazilian PROFESSIONAL/SCIENTIFIC ORGANIZATIONS EVENTS ORGANIZATION International Brazilian ACADEMIC ADVISORY PhD Thesis PhD Students (current) Master Thesis Master Students (current) Pos Doc Supervision Undergraduate Final Dissertation Undergraduate Research Advisory Other Advisories PUBLICATIONS Internationals Journals Internationals Books International Book Chapters Internacional Conferences Abstracts Published in Internacional Conferences Brazilian Journals Brazilian Book Brazilian Book Chapters Editor of Proceedings Brazilian Conferences Brazilian Journals 2 Local Symposiums Others BOOKS AWARDS INVITED TALKS LINKS Ricardo Augusto da Luz Reis Full Professor at the Instituto de Informática of the Universidade Federal do Rio Grande do Sul (UFRGS), at Porto Alegre, Brazil. About Electrical Engineering from the Federal University of Rio Grande do Sul (UFRGS), Porto Alegre, Brazil, in 1978. Ph. D. degree from the Polytechnic Institute of Grenoble (INPG), France, January 1983. Professor at UFRGS since 1979. Former member of the Microelectronics Committee of National Council for Scientific and Technological Development (CNPq). Former member of the Computer Science Committee of National Council for Scientific and Technological Development (CNPq), for two terms. More than 500 hundred papers in journals and conferences proceedings (like IEEE Design & Test, ACM TODAES, IEEE JSSC, ISCAS, SBCCI, PATMOS, VLSI-SoC, DAC, DATE, ICCD, CICC, ASP-DAC, LATW). Author or co-author of several books. Award as research of the year from the Fapergs (Science Foundation of Rio Grande do Sul), 2002. Silver Core award from IFIP (International Federation for Information Processing) Research level 1A of the CNPq (Brazilian National Science Foundation) Head of several research projects supported by Government Agencies and Industry. Professor and Advisor at the Microelectronics and Computer Science Graduate Programs at UFRGS. Former head of the Microelectronics Graduate Program and Computer Science Graduate Program at UFRGS. General Chair or Program Chair of several conferences like the IFIP/IEEE VLSI-SoC, IEEE ISVLSI, IEEE LASCAS, Symposium on Integrated Circuits and Systems Design (SBCCI) and Congress of the Brazilian Microelectronics Society (SBMIcro). Past President of the Brazilian Computer Society and Past Vice-President of the Brazilian Microelectronics Society. IEEE CASS Chapter Rio Grande do Sul Chair (since 2007) Vice-president of IEEE Circuits and Systems representing R9, for two terms, from 2008 to 2011. Member of the Editorial Board of IEEE Design&Test and IEEE JETCAS. Member of the Steering Committee of the following conferences: IFIP/IEEE VLSI-SoC, ICECS, LASCAS, NEWCAS, IEEE CASS Summer School, IEEE ISVLSI, SBCCI, IBERCHIP, and PATMOS. His primary research interests include Physical Design Automation and Methodologies, CAD tools, Circuits Tolerant to Radiation, VLSI Design Methodologies and Microelectronics Education. Topics of Research MICROELECTRONICS EDA - ELECTRONIC DESIGN AUTOMATION PHYSICAL DESIGN VLSI DESIGN DESIGN OF CIRCUITS TOLERANT TO RADIATION EFFECTS SYSTEMS ON CHIP",
  "content_length": 3240,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:14"
}