{
  "name": "Ricardo Rodriguez",
  "homepage": "http://www-2.dc.uba.ar/profesores/ricardo",
  "status": "success",
  "content": "Portafolio - [Nombre de tu padre] Dr. Ricardo Oscar Rodriguez Profesor Asociado en Ciencias de la Computación Doctor en Ciencias de la Computación Universidad de Buenos Aires, Argentina 35 años de experiencia en docencia universitaria Sobre mí Publicaciones Sobre mí Datos personales 29 de marzo de 1961 14.508.313 Paraguay 4519, 1ro. E. CABA. C.P.: 1425 Títulos académicos Licenciado en Ciencias de la Computación Facultad de Ciencias Exactas y Naturales de la UBA Obtenido el 18 de septiembre de 1991 Doctorado en Ciencias de la Computación Universidad Politécnica de Cataluña Obtenido el 8 de febrero de 2002 Título de la tesis: \"Aspectos Formales en el Razonamiento Basado en Relaciones de Similitud Borrosas\" Experiencia Académica 2017 - Presente Profesor Asociado regular con dedicación exclusiva Departamento de Computación de la Facultad de Ciencias Exactas y Naturales de la Universidad de Buenos Aires Dictado de materias tales como: Lógicas Modales, Introducción a la Computación (Matemáticos), Aspectos Éticos en Inteligencia Artificial, Sobre Cambio de Creencias, Integración de Bases de Conocimientos, entre otras. 2000 - 2017 Profesor Adjunto regular dedicación exclusiva Departamento de Computación de la Facultad de Ciencias Exactas y Naturales de la Universidad de Buenos Aires Área Métodos No Numéricos. Cátedras: Teoría de Cambio, Lógicas No Estándar, Inteligencia Artificial, Representación del Conocimiento y Data Mining. Áreas de Investigación Lógicas Modales Investigación en lógicas modales multivaluadas, semánticas de Kripke y aplicaciones. Inteligencia Artificial Razonamiento aproximado, sistemas multiagentes y aspectos éticos en IA. Cambio de Creencias Teoría de cambio, revisión de creencias y lógicas no-monótonas. Lógica Difusa Razonamiento basado en similitud, lógicas multivaluadas y aplicaciones. Demostración Automática Métodos de demostración automática para lógicas no clásicas. Ética en Tecnología Aspectos éticos en inteligencia artificial y sistemas autónomos. Publicaciones 2024 Revisión de Creencias Moderated Revision En colaboración con Daniel A. Grimaldi y M. Vanina Martinez International Journal of Approximate Reasoning En prensa 2023 Lógica Difusa Semántica Algebraica An algebraic semantics for possibilistic finite-valued Lukasiewicz logic En colaboración con Manuela Busaniche, Penélope Cordero y Miguel Marcos International Journal Approximate Reasoning. Volume 159, August 2023 2022 Lógica Modal Semántica de Kripke Simplified Kripke semantics for K45-like Gödel modal logics and its axiomatic extensions Ricardo Oscar Rodriguez, Olim Frits Tuyt, Francesc Esteva and Lluís Godo Journal of Symbolic Logic 2022 Neurociencia Ontologías Scalable Query Answering under Uncertainty to Neuroscientific Ontological Knowledge: The NeuroLang Approach En colaboración con Gaston Zanitti, Yamil Soto, Valentin Iovene, M. Vanina Martinez, Gerardo Simari y Demian Wasserman NEUROINFORMATICS (ISSN: 1539-2791) 2022 Lógica Modal Semántica Algebraica Algebraic Semantics for the Minimum Many-Valued Modal Logic over Ln En colaboración con Penélope Cordero y Manuela Busaniche Fuzzy Set and System 2022 Lógica Intermedia Marcos Lineales One-variable fragments of intermediate logics over linear frames En colaboración con Xavier Caicedo, George Metcalfe y Olim Tuyt Information and Computation. Volumen 287 2021 Lógica Modal Axiomatización Axiomatization Of Crisp Gödel Modal Logics En colaboración con Amanda Vidal Journal of Symbolic Logic, vol. 109, pages 367–395 2019 Lógica de Corsi Fragmentos The one-variable fragment of Corsi logic En colaboración con Xavier Caicedo, George Metcalfe y Olim Tuyt Logic, Language, Information, and Computation. WoLLIC 2019, Lecture Notes in Computer Science 2019 Álgebras de Gödel Teorema de Representación A representation theorem for finite Gödel algebras with operators En colaboración con Tommaso Flaminio, y Lluis Godo Logic, Language, Information, and Computation. WoLLIC 2019, Lecture Notes in Computer Science 2019 Álgebras BL Pseudo-monádicas Pseudo-monadic BL Algebras En colaboración con Penélope Cordero y Manuela Busaniche Special Issue of Soft Computing Journal 23:2199–2212 Mostrar más Conferencias y Charlas Febrero 2025 Inteligencia Artificial y Ética Conferencia en la Escuela Internacional de Verano en Inteligencia Artificial Abril 2023-2024 Nociones de Big Data Dictado de cuatro clases en la Diplomatura de Inteligencia Artificial y Sociedad Diciembre 2017 On fuzzy modal logics KD45(C) Conferencia en la sesión de Lógica y Computabilidad de la UMA, Buenos Aires Julio 2017 Algebraic Semantic for BL-Possibilistic Logic Conferencia en Buenos Aires Logic Group, Buenos Aires Contacto Email ricardo@dc.uba.ar Dirección Departamento de Computación Facultad de Ciencias Exactas y Naturales Universidad de Buenos Aires",
  "content_length": 4814,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:31"
}