{
  "name": "Riccardo Poli",
  "homepage": "https://www.essex.ac.uk/people/polir15101/riccardo-poli",
  "status": "success",
  "content": "Riccardo Poli | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Riccardo Poli People Professor Riccardo Poli Professor School of Computer Science and Electronic Engineering (CSEE) Email rpoli@essex.ac.uk Telephone +44 (0) 1206 872338 Location 1NW.5.3B, Colchester Campus Academic support hours From week 3 to week 11: 10-11am on Tuesdays and 10-11am on Fridays Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Coordinator of the Brain-Computer Interfaces and Neural Engineering (BCI-NE) group Riccardo Poli is a Professor in CSEE. His main research interests include brain-computer interfaces, human cognitive augmentation, neural engineering, genetic programming, particle swarm optimisation and the theory of evolutionary algorithms. He has published more than 400 refereed papers on evolutionary algorithms, biomedical engineering, neural networks and image/signal processing. He was a co-founder of the Essex BCI-NE group in 2004. He has co-authored the books Foundations of Genetic Programming, Springer, 2002 and A Field Guide to Genetic Programing, Lulu, 2008. He has been chair of numerous international conferences. He is an advisory board member of the Evolutionary Computation journal and was an associate editor of the Genetic Programming and Evolvable Machines journal and a member of the editorial board of Swarm Intelligence. According to Google Scholar he has presently an H-index of 71, meaning that he has 71 publications which have been cited at least 71 times each, and over 29,000 citations.. (See also:staff research interests by category) Qualifications Laurea (equivalent to a BSc plus an MSc) in Electronic Engineering (with Biomedical specialisation) from the University of Florence in Italy, in 1989. PhD in Biomedical Engineering from the University of Florence, in 1993. Research and professional activities Research interests Evolutionary Computation and Genetic Programming Open to supervise Brain Computer Interfaces Open to supervise Particle swarms Open to supervise Schema Theory Open to supervise Neural Nets Open to supervise Machine Vision, Image and Signal Processing Open to supervise Artificial Intelligence Open to supervise Teaching and supervision Current teaching responsibilities Evolutionary Computation and Genetic Programming (CE310) Analysis and Classification of Neural Signals (CE345) Current supervision Rizeng Wu Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Rizeng Wu Thesis title: Neurotechnology for Augmenting Group Decision-Making Degree subject: Computing and Electronic Systems Degree type: Master of Science (by Dissertation) Awarded date: 30/7/2025 Benjamin William Jarvis Thesis title: A Data-Driven Approach for Magnetic Microswarm Steering Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 30/6/2025 Ahmet Can Mercimek Thesis title: Erp-Based Bci Speller Based on a Novel Sequential Protocol Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 29/1/2025 Stephen Brian Shaw Cullum Thesis title: Codemology Measuring Software Understandability By Exploiting Human Behaviours Captured Within Source Code Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 2/6/2023 Milan Rybar Thesis title: Towards Eeg/Fnirs-Based Semantic Brain-Computer Interfacing Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 14/2/2023 Ahmet Yilmaz Thesis title: Uncovering Efficient Learning and Initialisation Algorithms for Neural Networks Using Evolutionary Algorithms and Theoretical Analyses Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 15/3/2021 Mihail Morosan Thesis title: Automating Game-Design and Game-Agent Balancing Through Computational L Intelligence Degree subject: Intelligent Games and Game Intelligence Degree type: Doctor of Philosophy Awarded date: 25/3/2019 Davide Valeriani Thesis title: Improving Group Decision Making with Collaborative Brain-Computer Interfaces Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 31/7/2017 Dimitrios Andreou Thesis title: A Study on the Utility of Temporal Derivatives and Unsupervised Clustering in Brain-Computer Interfaces. Degree subject: Computer Science Degree type: Master of Philosophy Awarded date: 2/6/2017 Ana Matran-Fernandez Thesis title: Collaborative Brain-Computer Interfaces in Rapid Image Presentation and Motion Pictures Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 6/3/2017 Mikdam A Turkey Thesis title: Characterising and Synthesising the Collective Dynamic Behaviour of Population-Based Algorithms Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 12/1/2015 Behrooz Koohestani Thesis title: Genetic Hyper-Heuristics for Graph Layout Problems Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 4/6/2013 Publications Journal articles (87) Rybar, M., Poli, R. and Daly, I., (2025). Simultaneous EEG and fNIRS recordings for semantic decoding of imagined animals and tools. Scientific Data. 12 (1), 613- Poli, R., Mercimek, AC. and Cinel, C., (2025). Novel Sequential BCI Speller based on ERPs and Event-Related Slow Cortical Potentials. Journal of Neural Engineering. 22 (3), 036030-036030 Rybar, M., Poli, R. and Daly, I., (2024). Corrigendum: Decoding of semantic categories of imagined concepts of animals and tools in fNIRS. Journal of Neural Engineering. 21 (2), 029501-029501 Rybar, M., Poli, R. and Daly, I., (2024). Using data from cue presentations results in grossly overestimating semantic BCI performance. Scientific Reports. 14 (1), 28003- Jarvis, BW., Abolfathi, K., Poli, R. and Kafash Hoshiar, A., (2024). Haptic-Based Real-Time Platform for Microswarm Steering in a Multi-Bifurcation Vascular Network.. Nanomaterials. 14 (23), 1917-1917 Poli, R. and Yilmaz, A., (2023). Incorrect Application of Yilmaz–Poli (2022) Initialisation Method in dePater–Mitici 2023 paper entitled “A mathematical framework for improved weight initialization of neural networks using Lagrange multipliers”. Neural Networks. 168, 57-58 Carli, V., Petros, NG., Hadlaczky, G., Vitcheva, T., Berchialla, P., Bianchi, S., Carletto, S., Christinaki, E., Citi, L., Dinis, S., Gentili, C., Geraldes, V., Giovinazzo, L., Gonzalez-Martinez, S., Meyer, B., Ostacoli, L., Ottaviano, M., Ouakinin, S., Papastylianou, T., Paradiso, R., Poli, R., Rocha, I., Settanta, C., Scilingo, EP. and Valenza, G., (2022). The NEVERMIND e-health system in the treatment of depressive symptoms among patients with severe somatic conditions: A multicentre, pragmatic randomised controlled trial. eClinicalMedicine. 48, 101423-101423 Tremmel, C., Fernandez-Vargas, J., Stamos, D., Cinel, C., Pontil, M., Citi, L. and Poli, R., (2022). A meta-learning BCI for estimating decision confidence. Journal of Neural Engineering. 19 (4), 046009-046009 Cinel, C., Fernandez Vargas, J., Tremmel, C., Citi, L. and Poli, R., (2022). Enhancing performance with multisensory cues in a realistic target discrimination task. PLoS One. 17 (8), e0272320-e0272320 Yilmaz, A. and Poli, R., (2022). Successfully and Efficiently Training Deep Multi-layer Perceptrons with Logistic Activation Function Simply Requires Initializing the Weights with an Appropriate Negative Mean. Neural Networks. 153, 87-103 Rybář, M., Poli, R. and Daly, I., (2021). Decoding of semantic categories of imagined concepts of animals and tools in fNIRS. Journal of Neural Engineering. 18 (4), 046035-046035 Bhattacharyya, S., Valeriani, D., Cinel, C., Citi, L. and Poli, R., (2021). Anytime collaborative brain–computer interfaces for enhancing perceptual group decision-making. Scientific Reports. 11 (1), 17008- Fernandez-Vargas, J., Tremmel, C., Valeriani, D., Bhattacharyya, S., Cinel, C., Citi, L. and Poli, R., (2021). Subject- and task-independent neural correlates and prediction of decision confidence in perceptual decision making. Journal of Neural Engineering. 18 (4), 046055-046055 Valeriani, D., Ayaz, H., Kosmyna, N., Poli, R. and Maes, P., (2021). Editorial: Neurotechnologies for Human Augmentation.. Frontiers in Neuroscience. 15, 789868- Carli, V., Wasserman, D., Hadlaczky, G., Petros, NG., Carletto, S., Citi, L., Dinis, S., Gentili, C., Gonzalez-Martinez, S., De Leonibus, A., Meyer, B., Ostacoli, L., Ottaviano, M., Ouakinin, S., Paradiso, R., Poli, R., Rocha, I., Settanta, C., Waldmeyer, MTA., Valenza, G. and Scilingo, EP., (2020). A protocol for a multicentre, parallel-group, pragmatic randomised controlled trial to evaluate the NEVERMIND system in preventing and treating depression in patients with severe somatic conditions. BMC Psychiatry. 20 (1), 93- Christinaki, E., Papastylianou, T., Carletto, S., Gonzalez-Martinez, S., Ostacoli, L., Ottaviano, M., Poli, R.",
  "content_length": 53095,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:33"
}