{
  "name": "Riccardo Lazzeretti",
  "homepage": "http://www.diag.uniroma1.it/users/riccardo%20lazzeretti",
  "status": "success",
  "content": "Riccardo Lazzeretti | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Riccardo Lazzeretti Riccardo Lazzeretti Professore associatostanza: B114telefono: +39 0677274141email uniroma1: riccardo.lazzeretti@uniroma1.it Biografia I got the MSc degree (Laurea) in Computer Science Engineering at the University of Siena in 2007. Then I continued my studies as a Ph.D. under the supervision of Prof. Mauro Barni at the Information Engineering Department of the University of Siena, working on Signal Processing of Encrypted Signals. During Ph.D., from November 2009 to May 2010, I spent six months in Philips Lab at Eindhoven, The Netherland. In 2012 I discussed the Ph.D. thesis. Until October 2015, I continued my research activities as a post-Doc at the Information Engineering and Mathematics Department of the University of Siena in the VIPP (Visual Information Processing and Protection) group, led by Prof. Mauro Barni. In the group I supervised, together with Prof. Barni, the activities of master and PhD students involved in SPED (Signal Processing in the Encrypted Domain, also named Secure Multi-Party Computation) topics and actively take part in other research fields addressed by the group, such as forensic, watermarking and adversarial signal processing. Together with Prof. Barni, University of Siena, I am continuing the research in privacy preserving biometric authentication, extending it to multi-biometrics. From November 2015 to January 2016, I’ve been part of the research team of Cynny s.p.a., an Italian start-up, where I was involved in machine learning problems, such as object recognition, face detection, affective computing. I’m currently broadening my knowledge in the topic, by approaching deep learning and implementing Convolutional Neural Networks with Google’s TensorFlow. From September 2016 to February 2017, I had a research grant at the University of Padua, Italy, supervised by Prof. Conti. I started several research activities together with Prof. Conti that still are on-going. First of all, together with Prof Conti and Scientist Braca of Centre for Maritime Research and Experimentation (CMRE), NATO, we are working on the implementation of privacy preserving consensus algorithm for decentralized Information fusion in Internet of Things. Together with Prof. Conti and Michele Nati, Digital Catapult, UK, we are exploring Blockchain-based architectures for smart health applications. Together with Prof. Conti and Quattrociocchi, IMT Lucca, Italy, we are working on the possibility of discriminating hoaxes in social networks from the analysis of only structural properties of content propagation cascades. From March 2017 to August 2019 I have been an Assistant Professor (RTD-A) at Sapienza University of Rome, where I am principally involved in APT malware analysis. From September 2019 to August 2022  I have been an Assistant Professor (RTD-B) at Sapienza University of Rome, working in IoT security. Since September 2022 I am an Associate Professor at Sapienza University of Rome. Interessi di ricerca Privacy preserving applications through Secure Multi-Party Computation protocols Biometric identification Malware analysis IoT security and Provacy Named Data Network (NDN) security Security and Provacy in Healthcare Membro di Cybersecurity Awards 2022 SIGMM Test of Time Paper Honourable Mention in the category of Multimedia Security and Privacy 2021 IET Biometrics Premium (Best Paper) Awards 2021 Ultime pubblicazioni Do you Trust your Device? Open Challenges in IoT Security Analysis in Proceedings of the International Conference on Security and Cryptography 2024 Exploring Jamming and Hijacking Attacks for Micro Aerial Drones in IEEE INTERNATIONAL CONFERENCE ON COMMUNICATIONS 2024 Is AI a Trick or T(h)reat for Securing Programmable Data Planes? in IEEE NETWORK 2024 With Great Power Comes Great Responsibility: Security and Privacy Issues of Modern Browser Application Programming Interfaces in IEEE SECURITY & PRIVACY 2024 X-Lock: A Secure XOR-Based Fuzzy Extractor for Resource Constrained Devices in Lecture Notes in Computer Science 2024 A comprehensive security and performance assessment of UAV authentication schemes in SECURITY AND PRIVACY 2023 A survey on security and privacy issues of UAVs in COMPUTER NETWORKS 2023 Last 50 publications © Università degli Studi di Roma \"La Sapienza\" - Piazzale Aldo Moro 5, 00185 Roma",
  "content_length": 4448,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:32"
}