{
  "name": "Riccardo Guidotti",
  "homepage": "http://kdd.isti.cnr.it/kdd7/?q=people/riccardo-guidotti",
  "status": "success",
  "content": "Guidotti Riccardo | Knowledge Discovery and Data Mining Laboratory Skip to main content HomeHighlights Events Hosted Events Job & Study Opportunities Press Contacts ResearchPublications Projects People ResourcesDataset Software Blog Search form Search Guidotti Riccardo You are hereHome » People Riccardo Guidotti was born in 1988 in Pitigliano (GR) Italy. In 2013 and 2010 he graduated cum laude in Computer Science (MS and BS) at University of Pisa. He received the PhD in Computer Science with a thesis on Personal Data Analytics in the same institution. He is currently an Assistant Professor (RTD-B) at the Department of Computer Science University of Pisa, Italy and a member of the Knowledge Discovery and Data Mining Laboratory (KDDLab), a joint research group with the Information Science and Technology Institute of the National Research Council in Pisa. He won the IBM fellowship program and has been an intern in IBM Research Dublin, Ireland in 2015. His research interests are in personal data mining, clustering, explainable models, analysis of transactional data. Topics: Explainable ModelsPersonal AnayticsClusteringAnalysis of Transactional Data Awards Teaching Education Quotes IBM Fellowship Award 2014 ISTI Young Researcher Award 2016ISTI Young Researcher Award 2017ISTI Young Researcher Award 2018NGDS Award 2018ISTI Young Researcher Award 2019 Logica Per la Programmazione 2018/2019Data Mining 2018/2019Data Mining 2017/2018Data Mining 2016/2017Data Mining 2015/2016Data Mining for Customer Relationship Management 2017Data Mining 2: Advanced Topics 2017 PhD in Computer Science at University of Pisa2014 CAE - Cambridege English Certificate2013 Master Degree in Computer Science at University of Pisa with 110/110 cum laude2012 FCE - Cambridege English Certificate2010 Bachelor Degree in Computer Science at University of Pisa with 110/110 cum laude \"... na volta si diceva i dati so' tanti ... adesso si dice BigData ...\" Position Associate Professor Affiliation Department of Computer Science, University of Pisa (DI-UNIPI) Room 286 Floor 2 Gate 20 Phone 050 221 3134 Email riccardo.guidotti@unipi.it Skype ric.guidotti Google Scholar Riccardo Guidotti\t\t\t\t\t\t\t\ton Google Scholar DBLP Riccardo Guidotti\t\t\t\t\t\t\t\ton DBLP Scopus Riccardo Guidotti\t\t\t\t\t\t\t\ton Scopus LinkedIn Riccardo Guidotti\t\t\t\t\t\t\t\ton LinkedIn Facebook Riccardo Guidotti\t\t\t\t\t\t\t\ton Facebook Twitter Riccardo Guidotti\t\t\t\t\t\t\t\ton Twitter Projects SoBigData++ - European Integrated Infrastructure for Social Mining and Big Data Analytics XAI - Science and technology for the eXplanation of AI decision making SAI - Social Explainable Artificial Intelligence HumMingBird - Enhanced migration measures from a multidimensional perspective HumanE-AI-Net - HumanE AI Network AI4EU - A European AI On Demand Platform and Ecosystem T&K - Track and Know PETRA - Personal Transport Advisor: an integrated platform of mobility patterns for Smart Cities to enable demand-adaptive transportation system LivLab - LivLab Livorno CLD HII - Trusted Data Management with Service Ecosystem 1 of 2 next › Publications 2022 A. Fedele, Guidotti, R., and Pedreschi, D., “Explaining Siamese Networks in Few-Shot Learning for Audio Data”, in Discovery Science - 25th International Conference, DS 2022, Montpellier, France, October 10-12, 2022, Proceedings, 2022.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS 2021 F. Bodria, Giannotti, F., Guidotti, R., Naretto, F., Pedreschi, D., and Rinzivillo, S., “Benchmarking and Survey of Explanation Methods for Black Box Models”, CoRR, vol. abs/2102.13076, 2021.Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS M. Nanni, Andrienko, G., Barabasi, A. - L., Boldrini, C., Bonchi, F., Cattuto, C., Chiaromonte, F., Comandé, G., Conti, M., Coté, M., Dignum, F., Dignum, V., Domingo-Ferrer, J., Ferragina, P., Giannotti, F., Guidotti, R., Helbing, D., Kaski, K., Kertész, J., Lehmann, S., Lepri, B., Lukowicz, P., Matwin, S., Jiménez, D. Megías, Monreale, A., Morik, K., Oliver, N., Passarella, A., Passerini, A., Pedreschi, D., Pentland, A., Pianesi, F., Pratesi, F., Rinzivillo, S., Ruggieri, S., Siebes, A., Torra, V., Trasarti, R., van den Hoven, J., and Vespignani, A., “Give more data, awareness and control to individual citizens, and they will help COVID-19 containment”, 2021.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS M. Setzu, Guidotti, R., Monreale, A., Turini, F., Pedreschi, D., and Giannotti, F., “GLocalX - From Local to Global Explanations of Black Box AI Models”, vol. 294, p. 103457, 2021.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS 2020 R. Guidotti and Rossetti, G., ““Know Thyself” How Personal Music Tastes Shape the Last.Fm Online Social Network”, in Formal Methods. FM 2019 International Workshops, Cham, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS R. Guidotti, Monreale, A., Matwin, S., and Pedreschi, D., “Black Box Explanation by Learning Image Exemplars in the Latent Feature Space”, in Machine Learning and Knowledge Discovery in Databases, Cham, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS M. Natilli, Fadda, D., Rinzivillo, S., Pedreschi, D., and Licari, F., “Analysis and Visualization of Performance Indicators in University Admission Tests”, in Formal Methods. FM 2019 International Workshops, Cham, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS R. Guidotti and Rossetti, G., ““Know Thyself” How Personal Music Tastes Shape the Last.Fm Online Social Network”, in Formal Methods. FM 2019 International Workshops, Cham, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS M. Setzu, Guidotti, R., Monreale, A., and Turini, F., “Global Explanations with Local Scoring”, in Machine Learning and Knowledge Discovery in Databases, Cham, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS F. Naretto, Pellungrini, R., Nardini, F. Maria, and Giannotti, F., “Prediction and Explanation of Privacy Risk on Mobility Data with Neural Networks”, in ECML PKDD 2020 Workshops, Cham, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS Pages1 2 3 4 5 6 7 next › last » Blog MALOTEC Seminar - Riccardo Guidotti: Evaluating Local Explanation Methods on Ground Truth 09 Apr 21 Riccardo Guidotti 0 Comments MALOTEC Seminar - Riccardo Guidotti: Evaluating Local Explanation Methods on Ground Truth 09/04/2021 Riccardo is an Assistant Professor at the Department of Computer Science, University of Pisa, and a member of the Knowledge Discovery and Data Mining Laboratory (KDDLab), a joint research group with the Information Science and Technology Institute 2 Data Science PhD positions on Explainable AI funded by the ERC grant XAI 31 Jul 19 Vittorio Romano Federico Mazzoni 0 Comments DSPHD-XAI.jpeg The ERC Advanced Grant XAI “Science & technology for the eXplanation of AI decision making”, led by Fosca Giannotti of the Italian CNR, in collaboration with the PhD program in “Data Science” by Scuola Normale Superiore in Pisa, invites applic ISTI News July 2019 30 Jul 19 Vittorio Romano Federico Mazzoni 0 Comments IstiNews_2019-07_pdf__pagina_9_di_64_.png IstiNews_2019-07_pdf__pagina_29_di_64_.png IstiNews_2019-07_pdf__pagina_30_di_64_.png IstiNews_2019-07_pdf__pagina_49_di_64_.png IstiNews_2019-07_pdf__pagina_56_di_64_.png IstiNews_2019-07_pdf__pagina_57_di_64_.png IstiNews_2019-07_pdf__pagina_58_di_64_.png IstiNews_2019-07_pdf__pagina_59_di_64_.png IstiNews_2019-07_pdf__pagina_60_di_64_.png IstiNews_2019-07_pdf__pagina_61_di_64_.png IstiNews_2019-07_pdf__pagina_62_di_64_.png On the fifth issue of the ISTI News newsletter you'll find the project Track&Know, the papers \"A survey of methods for explaining black box models\" by Riccardo Guidotti, Anna Monreale, Salvatore Ruggieri, ISTI News March 2018 12 Nov 18 Vittorio Romano Federico Mazzoni 0 Comments ISTI_News_4_pdf__pagina_15_di_32_.png ISTI_News_4_pdf__pagina_23_di_32_.png ISTI_News_4_pdf__pagina_28_di_32_.png ISTI_News_4_pdf__pagina_29_di_32_.png On the fourth issue of the ISTI News newsletter you'll find the papers \"Clustering individual transactional data for masses of users\" by Riccardo Guidotti, Anna Monreale, Mirco Nanni, Fosca Giannotti, Din Next Generation Data Scientist Award to Riccardo Guidotti 03 Oct 18 Vittorio Romano Federico Mazzoni 0 Comments guidotti2.jpg The 3rd October at the International Conference on Data Science and Advanced Analytics (DSAA2018) in Turin Riccardo Guidotti has been awarded the “Next Generation Data Scientist Award” (NGDS Award). Discovering temporal regularities in retail customers’ shopping behavior 17 Apr 18 Riccardo Guidotti 0 Comments aisle-3105629_640-620x342.jpg image via Pixabay, CC0 Creative Commons ISTI News March 2018 28 Feb 18 Vittorio Romano Federico Mazzoni 0 Comments ISTI_News_3_2018_pdf__pagina_15_di_32_.png ISTI_News_3_2018_pdf__pagina_26_di_32_.png ISTI_News_3_2018_pdf__pagina_28_di_32_.png On the third issue of the ISTI News newsletter you'll find the paper \"MyWay: location prediction via mobility profiling\" by Roberto Trasarti, Riccardo Guidotti, Anna Monreale, Fosca Giannotti and \"An anal Clustering Individual Transactional Data for Masses of Users @ KDD 2017 19 Oct 17 Riccardo Guidotti 0 Comments Clustering Individual Transactional Data for Masses of Users Clustering Individual Transactional Data for Masses of Users @ KDD 2017 19 Oct 17 Riccardo Guidotti 0 Comments Clustering Individual Transactional Data for Masses of Users Clustering Individual Transactional Data for Masses of Users @ KDD 2017 19 Oct 17 Riccardo Guidotti 0 Comments Clustering Individual Transactional Data for Masses of Users Pages1 2 next › last » more Copyright © 2014 - KDD Lab Home Contacts Credits Privacy Reserved Area",
  "content_length": 9697,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:32"
}