{
  "name": "Richard Wolski",
  "homepage": "https://www.cs.ucsb.edu/~rich",
  "status": "success",
  "content": "Rich Wolski's Home Page Rich Wolski Computer Science Department University of California, Santa Barbara Santa Barbara, CA 93106 My origins, like those of most people born in North America during this century, are ambiguous and questionable. I am currently a Professor and hold the Duval Family Presidential Chair for Energy Efficiency in the Computer Science Department at the University of California, Santa Barbara which is, of course, located in Goleta California for all intents and purposes that do not involve the U.S. Mail. My past is checkered (it used to be plaid, but I've been politely informed that a past can only be so retro). Formerly, I enjoyed the hospitable climes offered by the Computer Science Department at the University of Tennessee. I've also done time as research faculty member in the U.C. San Diego CS&E Department where I researched CS and a little E (every now and then) in a decidedly pedagogical manner. My research interests include, but are not limited to, Cloud Computing, The Internet of (No)things, performance oriented distributed computing, parallel and distributed systems, and the endless metaphysical search for the perfect coffee cup. Perhaps with unjustified notoriousness I will be leading the exploration of truth and beauty known as CS270 Graduate Operating Systems during Fall 2025 quarter. My current research projects include CSPOT -- A Serverless Platform of Things, an open source distributed system for IoT. RiPiT Carbon Emissions Project developing open-source software infrastructure for measuring carbon footprint SmartFarm -- That's a popular moniker now but our effort was the first. Accept no substitutes. The Depot Open Source Data Lake project that has emerged from the RiPiT effort. Where's The Bear -- IoT and Edge cloud wildlife image categorization I co-lead the RACELab at UCSB (which is home to the most talented students on earth) with Professor Chandra Krintz. I am also a member of the UCSB Institute for Energy Efficiency where I collaborate with a dizzying array of world-class academic researchers to use computation to improve sustainability and energy usage. My current and past indiscretions include CSPOT -- a Serverless Platform of Things (in C) is an open-source, multi-scale, Laminar -- a dataflow programming environment for writing functional, distributed CSPOT applications. xGFabric -- an end-to-end, multi-scale platform for putting putting science and AI \"in the loop.\" Watch xGFabric -- The Movie for details. I am formerly the Chief Technology Officer at -- a company started from my research group here at UCSB in 2009 offering open source software for buidling AWS-compatible clouds from local datacenter resources. The source code for the current release of the Eucalyptus software is available on GitHub and packages and documentation are available from https://www.eucalyptus.cloud/. the Network Weather Service -- a system for making network performance forecasts in real time, EveryWare -- a toolkit for building high-performance globally distributed programs, and G-Commerce -- market-based resource allocation strategies for the Grid. For enriching insights into their often obscure purposes, please see my publications page (that is now up-to-date despite a long hiatus in its up-to-dateness) where a copy of my vita can also be found. rich@cs.ucsb.edu Phone: 805-893-5117 Fax: 805-893-8553",
  "content_length": 3388,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:02"
}