{
  "name": "Richard M. C. McCreadie",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/richardmccreadie",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Richard Mccreadie Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Richard MccreadieMr Ethan KellyZhen Tian Dr Richard McCreadie Senior Lecturer (Computing Science) telephone: 4932 email: Richard.Mccreadie@glasgow.ac.uk Room 304, Computing Science, Sir Alwyn Williams Building Import to contacts https://orcid.org/0000-0002-2751-2087 Biography I am a Lecturer in Information Retrieval and Data Systems at the University of Glasgow, UK. My core research topics include real-time information retrieval, machine learning, big data stream processing and evaluation methodologies over streaming data. In particular, I specialize in real-time IR technologies to enable users to efficiently and effectively find information in big data streams; research and develop automatic (assistive) agents to detect events, extract knowledge and summarize information within big data streams; as well as methodologies to evaluate systems that process such streams I received my Ph.D on the topic of News Vertical Search using User Generated Content in 2012 and am currently part of the Information, Data and Analytics section, and within that the Information Retrieval Group. I also work with researchers and industry partners around the world to advance the IR field as co-chair of the Incident Streams emergency informatics initiative (2018-Present) at the Text Retrieval Conference (TREC). Research interests Information Retrieval Disaster Informatics Social Media Stream Processing Digital Finance (Fintech) Summarization IR Evaluation Event Detection and Tracking Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2009Number of items: 77.2025 Yi, Zixuan, Long, Zijun ORCID: https://orcid.org/0000-0002-2008-960X, Ounis, Iadh ORCID: https://orcid.org/0000-0003-4701-3223, Macdonald, Craig ORCID: https://orcid.org/0000-0003-3143-279X and Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 (2025) Enhancing recommender systems: deep modality alignment with large multi-modal encoders. ACM Transactions on Recommender Systems, 3(4), 52. (doi: 10.1145/3718099) Long, Zijun, Liang, Kangheng, Aragon Camarasa, Gerardo ORCID: https://orcid.org/0000-0003-3756-5569, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Henderson, Paul ORCID: https://orcid.org/0000-0002-5198-7445 (2025) Diffusion Augmented Retrieval: A Training-Free Approach to Interactive Text-to-Image Retrieval. In: 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025), Padua, Italy, 13-17 July 2025, pp. 823-832. ISBN 9798400715921 (doi: 10.1145/3726302.3729950) Guo, Lubingzhi, Sanz-Cruzado Puig, Javier ORCID: https://orcid.org/0000-0002-7829-5174 and Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 (2025) Selecting the Right Experts: Generalizing Information Extraction for Unseen Scenarios via Task-Aware Expert Weighting. In: 28th European Conference on Artificial Intelligence (ECAI 2025), Bologna, Italy, 25-30 Oct 2025, (Accepted for Publication) Chen, Chung-Chi, Lee, Yongjae, Lopez-Lira, Alejandro, Choi, Chanyeol, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174 (2025) Information Retrieval in Finance: Industry and Academic Perspectives on Innovation. In: 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025), Padua, Italy, 13-17 July 2025, (Accepted for Publication) Guo, Lubingzhi, Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174 and Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 (2025) Evaluating Knowledge Graph Sources for Non-Personalized Financial Asset Recommendation: 10K Reports vs. Wikidata. In: The Second Workshop on Knowledge-Enhanced Information Retrieval (KEIR @ ECIR 2025), Lucca, Italy, 10 Apr 2025, (Accepted for Publication) Takayanagi, Takehiro, Izumi, Kiyoshi, Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174, McCreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Ounis, Iadh ORCID: https://orcid.org/0000-0003-4701-3223 (2025) Are Generative AI Agents Effective Personalized Financial Advisors? In: 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2025), Padua, Italy, 13-17 July 2025, (Accepted for Publication) Takayanagi, Takehiro, Suzuki, Masahiro, Izumi, Kiyoshi, Sanz-Cruzado Puig, Javier ORCID: https://orcid.org/0000-0002-7829-5174, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Ounis, Iadh ORCID: https://orcid.org/0000-0003-4701-3223 (2025) FinPersona: An LLM-Driven Conversational Agent for Personalized Financial Advising. In: 47th European Conference on Information Retrieval (ECIR 2025), Lucca, Italy, 06-10 Apr 2025, pp. 13-18. ISBN 9783031887208 (doi: 10.1007/978-3-031-88720-8_3) 2024 Lee, Youngbin, Kim, Yejin, Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Lee, Yongjae (2024) Stock Recommendations for Individual Investors: A Temporal Graph Network Approach with Mean-Variance Efficient Sampling. In: 5th ACM Conference on AI in Finance (ICAIF 2024), Brooklyn, NY, USA, 14-17 November 2024, pp. 795-803. ISBN 979840071081 (doi: 10.1145/3677052.3698662) Long, Zijun ORCID: https://orcid.org/0000-0002-2008-960X, Zhuang, Lipeng, Killick, George, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087, Aragon-Camarasa, Gerardo ORCID: https://orcid.org/0000-0003-3756-5569 and Henderson, Paul ORCID: https://orcid.org/0000-0002-5198-7445 (2024) Understanding and Mitigating Human-Labelling Errors in Supervised Contrastive Learning. In: 18th European Conference on Computer Vision ECCV 2024, Milan, Italy, 29 Sep-04 Oct 2024, pp. 435-454. ISBN 9783031729492 (doi: 10.1007/978-3-031-72949-2_25) Long, Zijun ORCID: https://orcid.org/0000-0002-2008-960X, Zhuang, Lipeng, Killick, George, Meng, Zaiqiao ORCID: https://orcid.org/0000-0001-5374-0318, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Aragon-Camarasa, Gerardo ORCID: https://orcid.org/0000-0003-3756-5569 (2024) CLCE: An Approach to Refining Cross-Entropy and Contrastive Learning for Optimized Learning Fusion. In: 27th European Conference on Artificial Intelligence (ECAI-2024), Santiago de Compostela, Spain, 19-24 Oct 2024, pp. 1800-1807. ISBN 9781643685489 (doi: 10.3233/FAIA240691) Long, Zijun ORCID: https://orcid.org/0000-0002-2008-960X, Killick, George, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Aragon-Camarasa, Gerardo ORCID: https://orcid.org/0000-0003-3756-5569 (2024) RoboLLM: Robotic Vision Tasks Grounded on Multimodal Large Language Models. In: 2024 IEEE International Conference on Robotics and Automation (ICRA2024), 13-17 May 2024, Yokohama, Japan, ISBN 9798350384581 (doi: 10.1109/ICRA57147.2024.10610797) Long, Zijun ORCID: https://orcid.org/0000-0002-2008-960X, Ge, Xuri ORCID: https://orcid.org/0000-0002-3925-4951, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Jose, Joemon M. ORCID: https://orcid.org/0000-0001-9228-1759 (2024) CFIR: Fast and Effective Long-Text To Image Retrieval for Large Corpora. In: 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2024), Washington D.C., USA, 14-18 July 2024, pp. 2188-2198. ISBN 9798400704314 (doi: 10.1145/3626772.3657741) Guo, Lubingzhi, Sanz-Cruzado Puig, Javier ORCID: https://orcid.org/0000-0002-7829-5174 and Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 (2024) University of Glasgow at the FinLLM Challenge Task: Adapting Llama for Financial News Abstractive Summarization. Joint Workshop of the 8th Financial Technology and Natural Language Processing (FinNLP) and the 1st Agent AI for Scenario Planning (AgentScen), Jeju, Korea, 3 Aug 2024. (Accepted for Publication) Guo, Lubingzhi, Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174 and Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 (2024) Comparing the Impact of Financial Knowledge Graphs from Financial Reports and Wikidata in Asset Recommendation. IJCAI-24 Workshop on Recommender Systems in Finance (Fin-RecSys), Jeju, Republic of Korea, 4 August 2024. Lee, Youngbin, Kim, Yeyin, Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174, Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 and Lee, Yongjae (2024) Stock Recommendations for Individual Investors: A Temporal Graph Network Approach with Diversification-Enhancing Contrastive Learning. IJCAI-24 Workshop on Recommender Systems in Finance (Fin-RecSys), Jeju, Republic of Korea, 4 August 2024. Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174, Droukas, Nikolaos and Mccreadie, Richard ORCID: https://orcid.org/0000-0002-2751-2087 (2024) FAR-Trans: An Investment Dataset for Financial Asset Recommendation. IJCAI-24 Workshop on Recommender Systems in Finance (Fin-RecSys), Jeju, Republic of Korea, 4 August 2024. Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174, Richards, Edward an",
  "content_length": 67380,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:54"
}