{
  "name": "Richard H. Clayton",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/richard-clayton",
  "status": "success",
  "content": "Professor Richard Clayton | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Richard Clayton PhD School of Computer Science Professor of Computational Physiology Director of School - Research and Innovation Member of the Complex Systems Modelling research group Open staff member portrait in a modal window r.h.clayton@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Richard Clayton School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-8438-7518 Google Scholar Personal website Profile Richard Clayton has a first degree in Applied Physics and Electronics from the University of Durham, and a PhD in Medical Physics from the University of Newcastle upon Tyne. After completing his PhD, Richard continued research at the Freeman Hospital in Newcastle upon Tyne, funded by British Heart Foundation junior and intermediate fellowships.The main focus of these projects was on understanding the electrical mechanisms that underlie life-threatening disorders of heart rhythm, based on the analysis of data recorded from patients. A move to the University of Leeds, funded by a British Heart Foundation Lectureship enabled Richard to work on developing mechanistic models of cardiac electrophysiology in the human heart.Richard Clayton was appointed Senior Lecturer in the School of Computer Science in Sheffield in 2003, promoted to Reader in Computer Science in 2008, and Professor of Computational Physiology in 2014. He is a core member of the INSIGNEO institute for in-silico Medicine, and serves on the INSIGNEO board. Research interests Richard Clayton’s research interests are focussed on developing physics-based and mechanistic computational models and simulations as tools to examine the structure and function of human tissues and organs. This theme aligns with the recently established INSIGNEO institute for in-silico medicine in Sheffield.Richard Clayton has had a long running interest in developing computational models to investigate the mechanisms that initiate and sustain dangerous disorders of heart rhythm in the human heart, and this has been funded through grants and fellowships from the British Heart Foundation.Recent funding from EPSRC will develop techniques to handle the quantification and propagation of uncertainty within multiscale models of physiology. Publications Journal articles Preston SP, Wilkinson RD, Clayton RH, Chappell MJ & Mirams GR (2025) Think before you fit: parameter identifiability, sensitivity and uncertaintyin systems biology models. Current Opinion in Systems Biology, 100563-100563. Saxton H, Taylor DJ, Faulkner G, Halliday I, Newman T, Schenkel T, Morris PD, Clayton RH & Xu X (2025) The impact of experimental designs & system sloppiness on the personalisation process: A cardiovascular perspective. PLoS One, 20(6). View this article in WRRO Tonko JB, Sattler S, Dalgas Nissen S, Jerltorp K, Seshan S, Chow A, Jespersen T, Clayton R & Lambiase P (2025) Differentiating mechanisms of long duration ventricular fibrillation in acute ischemic myocardium vs. chronic infarct in an in-vivo porcine model. EP Europace, 27(Supplement_1). View this article in WRRO Sridhar S & Clayton RH (2025) The effect of non-local coupling of fibroblasts on pacing dynamics in a 2D tissue: a simulation study. Scientific Reports, 15(1). View this article in WRRO Holland BL, Monk NAM, Clayton RH & Osborne CP (2025) Implementing a framework of carbon and nitrogen feedback responses into a plant resource allocation model. in silico Plants, 7(1). View this article in WRRO Weiner OJF, Das M, Clayton RH, McComb JM, Murray A, Parry G & Lord SW (2025) Sympathetic reinnervation in cardiac transplant recipients: Prevalence, time course and association with long-term survival. The Journal of Heart and Lung Transplantation, 44(2), 204-212. View this article in WRRO Mamalakis M, Banerjee A, Ray S, Wilkie C, Clayton RH, Swift AJ, Panoutsos G & Vorselaars B (2024) Deep multi-metric training: the need of multi-metric curve evaluation to avoid weak learning. Neural Computing and Applications, 36(30), 18841-18862. View this article in WRRO Saxton H, Xu X, Schenkel T, Clayton RH & Halliday I (2024) Convergence, sampling and total order estimator effects on parameter orthogonality in global sensitivity analysis. PLoS Computational Biology, 20(7). View this article in WRRO Dharmaprani D, Tiver K, Salari Shahrbabaki S, Jenkins EV, Chapman D, Strong C, Quah JX, Tonchev I, O’Loughlin L, Mitchell L , Tung M et al (2024) Observable Atrial and Ventricular Fibrillation Episode Durations Are Conformant With a Power Law Based on System Size and Spatial Synchronization. Circulation: Arrhythmia and Electrophysiology, 17(7). Clayton RH & Sridhar S (2024) Re-entry in models of cardiac ventricular tissue with scar represented as a Gaussian random field. Frontiers in Physiology, 15. View this article in WRRO Sridhar S & Clayton RH (2024) Fibroblast mediated dynamics in diffusively uncoupled myocytes: a simulation study using 2-cell motifs. Scientific Reports, 14(1). View this article in WRRO Dharmaprani D, Jenkins E, Tiver K, Quah J, Mitchell L, Tung M, Ahmad W, Stoyanov N, Aguilar M, Nash M , Clayton R et al (2023) Fractal Dimension of Atrial and Ventricular Fibrillation: A Potential Determinant for the Persistence and Termination of Cardiac Turbulence. Heart, Lung and Circulation, 32, S196-S196. Jenkins EV, Dharmaprani D, Schopp M, Quah JX, Tiver K, Mitchell L, Nash MP, Clayton RH, Pope K & Ganesan AN (2023) Markov modeling of phase singularity interaction effects in human atrial and ventricular fibrillation. Chaos: An Interdisciplinary Journal of Nonlinear Science, 33(6). View this article in WRRO Mamalakis M, Garg P, Nelson T, Lee J, Swift AJ, Wild JM & Clayton RH (2023) Artificial Intelligence framework with traditional computer vision and deep learning approaches for optimal automatic segmentation of left ventricle with scar. Artificial Intelligence in Medicine, 143. View this article in WRRO Corrado C, Roney CH, Razeghi O, Lemus JAS, Coveney S, Sim I, Williams SE, O’Neill MD, Wilkinson RD, Clayton RH & Niederer SA (2023) Quantifying the impact of shape uncertainty on predicted arrhythmias. Computers in Biology and Medicine, 153, 106528-106528. Mamalakis M, Garg P, Nelson T, Lee J, Swift AJ, Wild JM & Clayton RH (2023) Automatic development of 3D anatomical models of border zone and core scar regions in the left ventricle. Computerized Medical Imaging and Graphics, 103. View this article in WRRO Coveny S, Roney C, Corrado C, Wilkinson R, Oakley J, Niederer S & Clayton R (2022) Calibrating cardiac electrophysiology models using latent Gaussian processes on atrial manifolds. Scientific Reports, 12. View this article in WRRO Jenkins EV, Dharmaprani D, Schopp M, Quah JX, Tiver K, Mitchell L, Xiong F, Aguilar M, Pope K, Akar FG , Roney CH et al (2022) The inspection paradox: an important consideration in the evaluation of rotor lifetimes in cardiac fibrillation. Frontiers in Physiology, 13. Jenkins E, Dharmaprani D, Schopp M, Xian Quah J, Tiver K, Mitchell L, Nash M, Clayton R & Ganesan A (2022) Evidence for a Novel Self-Inhibitory Effect on Rotor Formation and Destruction Rates With Increased Phase Singularity Population During Human Atrial and Ventricular Fibrillation. Heart, Lung and Circulation, 31, S116-S116. Lee JMS, Nelson TA, Clayton RH & Kelland NF (2022) Characterization of persistent atrial fibrillation with non‐contact charge density mapping and relationship to voltage. Journal of Arrhythmia, 38(1), 77-85. View this article in WRRO Dharmaprani D, Jenkins EV, Quah JX, Lahiri A, Tiver K, Mitchell L, Bradley CP, Hayward M, Paterson DJ, Taggart P , Clayton RH et al (2022) A governing equation for rotor and wavelet number in human clinical ventricular fibrillation: Implications for sudden cardiac death. Heart Rhythm, 19(2), 295-305. Mamalakis M, Swift AJ, Vorselaars B, Ray S, Weeks S, Ding W, Clayton RH, Mackenzie LS & Banerjee A (2021) DenResCov-19: a deep transfer learning network for robust automatic classification of COVID-19, pneumonia, and tuberculosis from X-rays. Computerized Medical Imaging and Graphics, 94. View this article in WRRO Bernjak A, Iqbal A, Heller S & Clayton R (2021) Hypoglycaemia combined with mild hypokalaemia reduces the heart rate and causes abnormal pacemaker activity in a computational model of a human sinoatrial cell. Journal of the Royal Society Interface, 18(184). View this article in WRRO Coveney S, Corrado C, Oakley JE, Wilkinson RD, Niederer SA & Clayton RH (2021) Corrigendum: Bayesian Calibration of Electrophysiology Models Using Restitution Curve Emulators. Frontiers in Physiology, 12, 765622. Mamalakis M, Garg P, Nelson T, Lee J, Wild JM & Clayton RH (2021) MA-SOCRATIS: An automatic pipeline for robust segmentation of the left ventricle and scar. Computerized Medical Imaging and Graphics, 93. View this article in WRRO Roney CH, Child N, Porter B, Sim I, Whitaker J, Clayton RH, Laughner JI, Shuros A, Neuzil P, Williams SE , Razavi RS et al (2021) Time-averaged wavefront analysis demonstrates preferential pathways of atrial fibrillation, predicting pulmonary vein isolation acute response. Frontiers in Physiology, 12. Coveny S, Corrado C, Oakley J, Wilkinson R, Niederer S & Clayton R (2021) Bayesian calibration of electrophysiology models using restitution curve emulators. Frontiers in Physiology, 12. View this article in WRRO Dharmaprani D, Jenkins E, Aguilar M, Quah JX, Lahiri A, Tiver K, Mitchell L, Kuklik P, Meyer C, Willems S , Clayton R et al (2021) M/M/Infinity birth-death processes – a quantitative representational framework to summarize and explain phase singularity and wavelet dynamics in atrial fibrillation. Frontiers in Physiology, 11(1). Dharmaprani D, Jenkins E, Quah J, Lahiri A, Tiver K, Mitchell L, Bradley C, Hayward M, Paterso",
  "content_length": 47681,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:50"
}