{
  "name": "Richard J. Cole",
  "homepage": "http://cs.nyu.edu/cole",
  "status": "success",
  "content": "Richard Cole home page Richard Cole Silver Professor of Computer Science Computer Science Department Courant Institute of Mathematical Sciences New York University Quick links  contact info, research interests, bio, teaching, students, publications Contact Information [Show/Hide] Top of Page 251 Mercer Street New York, NY 10012-1185 U.S.A cole at cs dot nyu dot edu (212) 998-3119 Research Interests Top of Page My main interest is the design and analysis of algorithms. I am currently concentrating on the following area: algorithmic economic market theory and game theory.  I have previously worked on string and pattern matching, amortization, parallelism, network and routing problems. I have also been interested in the use of visualization for algorithm explanation and teaching. Bio [Show/Hide] Top of Page I have lived most of my life in or near London, Paris, and New York. My education began in France, and was continued in England for the latter part of primary (elementary) school and for secondary school (at Ealing Grammar School for Boys, now closed). For my undergraduate studies, I went to University College, Oxford,  receiving my BA in Mathematics in 1978. I then came to America to study for a Ph.D. in Computer Science at Cornell University; this was supervised by John Hopcroft and completed in 1982. After this I came to NYU as an assistant professor. I was promoted to full professor in 1990. I served as department chair from 1994-2000. and as interim director of the Courant Institute from 2016-2017. I was named a Guggenheim Fellow for the 1988-89 academic year, an ACM Fellow in 1998, and a Silver Professor of Computer Science in 2011. I am an author or co-author of 100 plus papers; the more recent half, accessible on the web, are listed below. Teaching Top of Page Current: Theory of Computation, ug (fall 23, password protected). Recent: Fundamental Algorithms (password protected), grad (fall 20); Randomized Algorithms (password protected), ug (spring23); Basic Algorithms, ug (spring 14); Theory of Computation, ug (spring 20, spring 19, spring16, fall 14, fall 12, fall 11); Algorithmic & Economic Aspects of the Internet (co-taught with Vahab Mirrokni), grad (spring 14, spring 12). Less Recent: [Show/Hide] Theory of Computation, ug (fall 09, fall 08, fall 07, fall 06, fall 01), Honors Analysis of Algorithms, grad (fall 04, fall 01), Fundamental Algorithms (fall 99, fall97), Basic Algorithms (fall 98), Randomized Algorithms (spring 97). Students Top of Page Ph.D. Ishan Agarwal (Ph.D. 2023) Yixin Tao (Ph.D. 2020) Yun Kuen Cheung (Ph.D. 2014) Vasilis Gkatzelis (Ph.D. 2013) Ashish Rastogi (Ph.D. 2008, coadvised with Mehryar Mohri) Lee-Ad Gottlieb (Ph.D. 2008) Less Recent: [Show/Hide] Ramesh Hariharan (Ph.D. 1994) Rajamani Sundar (Ph.D. 1991, coadvised with Ravi Boppana) John Turek (Ph.D. 1991, coadvised with Dennis Shasha) Ofer Zajicek (Ph.D. 1990) High School: [Show/Hide] Aayush Sharma, current, West Windsor Plainsboro High School North Gautam Ramasubramanian, 2011-12, Bronx High School of Science Milo Beckman, Styuvesant High School, 2010, Intel Science Competition Semi-Finalist Interested in or curious about working with me? [Read this.] Prospective Ph.D. students: I am interested in hearing about your interests. On occasion, I can host visiting Ph.D. students. Undergraduates: I have both implementation and more theoretical projects; you need to have taken Basic Algorithms. Note that I am rarely able to take on summer students from outside NYU. High school students: please send me email explaining your interests and skills; some programming experience is a huge plus. So that I can avoid broadcast emails please end you subject line the first time you write to me with the number 42. Publications Top of Page This includes papers from about the last 20 years. Older papers will have to be sought in online libraries. (There are a few repetitions due to topic overlaps.) Recent papers Algorithmic economics & game theory Parallel algorithms, parallel computation, and routing Resource oblivious algorithms String and patttern matching Data structures Graph algorithms Sorting Miscellaneous Copyright Notice The documents being distributed here are being provided as a means to ensure timely dissemination of scholarly and technical work on a noncommercial basis. The present version of the paper may differ from the definitive published version. Papers appearing in journals and conference proceedings are protected by the associated copyrights, and files posted here are for personal scholarly use only. Copyright and all rights therein are maintained by the authors or by other copyright holders, notwithstanding that the works are offered here electronically. It is understood that all persons copying this information will adhere to the terms and constraints invoked by each author's copyright. These works may not be reposted or distributed without the explicit permission of the copyright holder (ACM, Springer-Verlag, Elsevier, etc.). Permission to make digital or hard copies of part or all of these works for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage. Recent Papers    Publications Top of Page Ishan Agarwal, Richard Cole. Stable Matching: Choosing which proposals to make. ICALP 2023. 8:1-8:20. https://cs.emis.de/LIPIcs/volltexte/2023/18060/pdf/LIPIcs-ICALP-2023-8_.pdf. arXiv version https://arxiv.org/abs/2204.04162 (2022) Moshe Babaioff, Richard Cole, Jason Hartline, Nicole Immorlica, Brendan Lucier. Non-Quasi-Linear Agents in Quasi-Linear Mechanisms. Innovations in Theoretical Computer Science, ITCS 2021. One-page abstract. arXiv version arxiv.org/abs/2012.02893 (2020) Richard Cole, Yixin Tao. On the Existence of Pareto Efficient and Envy Free Allocations. J. Economic Theory 193 (2021) doi.org/10.1016/j.jet.2021.105207. arXiv version arxiv.org/abs/1906.07257 (2019). Yun Kuen Cheung, Richard Cole, Yixin Tao. Parallel Stochastic Coordinate Descent: Tight Bounds on the Possible Parallelism. SIAM J. Optim. 31(1): 448-460 (2021).  epubs.siam.org/doi/abs/10.1137/19M129574X arXiv version arxiv.org/abs/1811.05087 (2020). Yun Kuen Cheung, Richard Cole, Yixin Tao.  Fully asynchronous coordinate descent: a tight lower bound on the parallelism achieving linear speedup. Math Program. 190(1): 615-677 (2021) doi.org/10.1007/s10107-020-01552-8. arXiv version arxiv.org/abs/1811.03254 (2020). Rediet Abebe, Richard Cole, Vasilis Gkatzelis, Jason Hartline. A Truthful Cardinal Mechanism for One-Sided Matching. SODA 2020. arXiv version arxiv.org/abs/1903.07797 (2020). Yun Kuen Cheung, Richard Cole, Nikhil Devanur. Tatonnement Beyond Gross Substitutes? Gradient Descent to the Rescue. Games and Economic Behavior 123: 295-326 (2020) paper. Preliminary version, STOC 2013: 191-200.  pdf Algorithmic economics & game theory    Publications Top of Page Ishan Agarwal, Richard Cole. Stable Matching: Choosing which proposals to make. ICALP 2023. 8:1-8:20. https://cs.emis.de/LIPIcs/volltexte/2023/18060/pdf/LIPIcs-ICALP-2023-8_.pdf. arXiv version https://arxiv.org/abs/2204.04162 (2022) Moshe Babaioff, Richard Cole, Jason Hartline, Nicole Immorlica, Brendan Lucier. Non-Quasi-Linear Agents in Quasi-Linear Mechanisms. Innovations in Theoretical Computer Science, ITCS 2021. One-page abstract. arXiv version arxiv.org/abs/2012.02893 (2020) Richard Cole, Yixin Tao. On the Existence of Pareto Efficient and Envy Free Allocations. J. Economic Theory 193 (2021) doi.org/10.1016/j.jet.2021.105207. arXiv version arxiv.org/abs/1906.07257 (2019). Rediet Abebe, Richard Cole, Vasilis Gkatzelis, Jason Hartline. A Truthful Cardinal Mechanism for One-Sided Matching. SODA 2020. arXiv version arxiv.org/abs/1903.07797 (2020). Richard Cole, Yixin Tao. Balancing the Robustness and Convergence of Tatonnement. arxiv.org/abs/1908.00844 (2019). Yun Kuen Cheung, Richard Cole, Nikhil Devanur. Tatonnement Beyond Gross Substitutes? Gradient Descent to the Rescue. Games and Economic Behavior 123: 295-326 (2020) paper. Preliminary version, STOC 2013: 191-200.  pdf Yun Kuen Cheung, Richard Cole. Amortized Analysis of Asynchronous Price Dynamics. ESA 2018. 18:1-18:15. Richard Cole, Vasilis Gkatzelis. Approximating the Nash Social Welfare with Indivisible Items. SIAM J. Comput. 47(3): 1211-1236 (2018). Preliminary version, STOC 2015: 371-380. pdf. See also SIGECON Exchanges, Nov 2015  pdf Richard Cole, Thanasis Lianeas, Evdokia Nikolova. When Does Diversity of Agent Preferences Improve Outcomes in Selfish Routing? IJCAI 2018: 173-179. Yun Kuen Cheung, Richard Cole, Yixin Tao. Dynamics of Distributed Updating in Fisher Markets. EC 2018: 351-368. pdf Richard Cole, Shravas Rao. Applications of α-Strongly Regular Distributions to Bayesian Auctions. ACM Trans. Economics and Comput. 5(4): 18:1-18:29 (2017) pdf. Preliminary version, WINE 2015: 244-257. Richard Cole, Nikhil Devanur, Vasilis Gkatzelis, Kamal Jain, Tung Mai, Vijay Vazirani, Sadra Yazdanbod. Convex Program Duality, Fisher Markets, and Nash Social Welfare. EC 2017: 459-460. pdf Richard Cole, Yixin Tao. Large Market Games with Near Optimal Efficiency.  EC 2016: 791-808. pdf Richard Cole, Jose R. Correa, Vasilis Gkatzelis, Vahab S. Mirrokni, Neil Olver. Decentralized utilitarian mechanisms for scheduling games. Games and Economic Behavior 92: 306-326 (2015). pdf Journal version of: Inner product spaces for MinSum coordination mechanisms. STOC 2011: 539-548. pdf Richard Cole, Tim Roughgarden. The sample complexity of revenue maximization. STOC 2014: 243-252. pdf. Full paper (with improved results) arxiv.org/abs/1502.00963, Feb 2015. Richard Cole, Vasilis Gkatzelis, Gagan Goel.  Mechanism Design for Fair Division: Allocating Divisible Items without Payments. EC 2013: 251-268.  pdf Richard Cole, Vasilis Gkatzelis, Gagan Goel. Positive results for mechanism design without money. AAMAS 2013: 1165-1166. Yun Kuen Cheung, Richard Cole, Ashish Rastogi. Tatonnement in o",
  "content_length": 20736,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:51"
}