{
  "name": "Richard Buckland",
  "homepage": "http://www.cse.unsw.edu.au/~richardb",
  "status": "success",
  "content": "Professor Richard Buckland Professor Richard Buckland Professor Richard Buckland is the Director of First Year Experience of UNSW. Richard is Professor in CyberCrime Cyberwar and Cyberterror at the School of Computer Science and Engineering UNSW, Visiting Professor in Educational Design at the National University of Malaysia UKM, and Grand Challenge Visiting Professor in CyberSecurity at Taylors University. He was Director of Professional Education and Chair of the Academic Board of the Australian Computer Sociery, Director of Education of the Australian Centre for Cyber Security, and a Fellow of the Institute of Actuaries of Australia. He is the Director of the UNSW/CommBank Security Engineering Capability partnership -SecEDU, and long term member of the UNSW Academic Board and the University Academic Quality Committee. He was the 2008 Australian and New Zealand Engineering Educator of the Year (Engineers Australia) and the 2013 Australian ICT Educator of the Year (iAwards) and has been the recipient of 10 peer reviewed awards in teaching and education including awards from the Australian College of Educators and the The Australian Learning and Teaching Council. He pioneered the first Australian MOOC, has hundreds of thousands of students and millions of views online, and is co-founder of social education platform OpenLearning.com. His research areas lie in Education and Teaching, and in Cyber Security and Security Engineering. Currently he is working on the affective domain (emotions, belief, motivation and feelings), learning communities and kindness, non-mark based motivation in online education, and engineering secure electronic elections in untrusted environments. Richard has a love for teaching and a deep faith in the potential of all his students. He has taught over 10,000 students face to face at numerous levels including primary school, high school, undergraduate, postgraduate and professional students, and hundreds of thousands of students electronically. He has a passionate belief in the importance of education, of learning, of thinking. He has a particular interest in unconventional students: including gifted and talented students and students with learning difficulties. Before commencing his second degree he worked as an actuary and management consultant - which was not a patch on being a teacher :) His hobbies include being a husband and dad, reading everything, cinema, bush regeneration, breaking things, puzzles, games, music, speaking in the third person, and being a rascal. Contact Room 212, Building K17 School of Computer Science and Engineering Faculty of Engineering University of New South Wales Sydney 2052 AUSTRALIA",
  "content_length": 2685,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:43"
}