{
  "name": "Richard M. Jiang 0001",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/richard-jiang",
  "status": "success",
  "content": "Richard Jiang - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Richard Jiang Senior Lecturer Profile Dr. Richard Jiang is a Senior Lecturer (Associate Professor) in the School of Computing and Communications at Lancaster University, UK. He is a Fellow of the Higher Education Academy (HEA) and a Member of the EPSRC Peer Review College. His research interests reside in the fields of Novel Computing and Artificial Intelligence, with a focus on Quantum Neural Computing, Post-Quantum Computing, Medical Computing, and Trustworthy AI. Dr. Jiang has secured over £1 million in research funding from the EPSRC, the Leverhulme Trust, international funding bodies, and industry partners to advance his pioneering research. He has pioneered single-qubit and hybrid quantum neural models on NISQ devices, opening new routes for resource-efficient quantum computing with real-world data. Working with world-leading AI researchers worldwide, he has contributed to shaping the next generation XAI towards trustworthy AI. In medical computing, he invented Face2Brain, a breakthrough method for non-invasive neurodegenerative assessment, and developed explainable precision models for brain function and ageing analysis, offering new insights into cognitive computing processes. His earlier work on encrypted pattern recognition, leveraging the many-manifold learning framework, is paving new pathways towards post-quantum pattern analysis and data security. Dr. Jiang has supervised and co-supervised more than 20 PhD researchers, with over 10 successfully completing their doctorates. He has authored over 100 peer-reviewed publications, edited books and special issues, and actively serves on editorial boards, programme committees, and as a reviewer for leading international journals and conferences. Show more… Current Teaching SCC-300 Third Year Projects DSS-591 MSc Data Science Projects PhD Supervision Interests Research topics on Artificial Intelligence, Neural Computing, Quantum Machine Learning, Post-Quantum Computing, and their applications are welcome. Show less Publications Projects Activities PhD Students Research Groups Selected Publications Show all 121 publications Efficient Quantum Image Classification Using Single Qubit EncodingEasom-Mccaldin, P., Belatreche, A., Bouridane, A., Jiang, R., Almaadeed, S. 29/02/2024 In: IEEE Transactions on Neural Networks and Learning Systems. 35, 2, p. 1-15. 15 p.Journal article Explainable Artificial Intelligence (XAI) 2.0: A manifesto of open challenges and interdisciplinary research directionsLongo, L., Brcic, M., Cabitza, F., Choi, J., Confalonieri, R., Ser, J.D., Guidotti, R., Hayashi, Y., Herrera, F., Holzinger, A., Jiang, R., Khosravi, H., Lecue, F., Malgieri, G., Páez, A., Samek, W., Schneider, J., Speith, T., Stumpf, S. 30/06/2024 In: Information Fusion. 106Journal article Private Facial Prediagnosis as an Edge Service for Parkinson's DBS Treatment ValuationJiang, R., Chazot, P.L., Pavese, N., Crookes, D., Bouridane, A., Celebi, M.E. 30/06/2022 In: IEEE Journal of Biomedical and Health Informatics. 26, 6, p. 2703-2713. 11 p.Journal article Alz-QNet: A Quantum Regression Network for Studying Alzheimer’s Gene InteractionsKonar, D., Sreekumar, N., Jiang, R., Aggarwal, V. 30/09/2025 In: Computers in Biology and Medicine. 196, Part C, 10 p.Journal article Enable Quantum Graph Neural Networks on a Single Qubit with Quantum WalkZhu, Y., Jiang, R., Ni, Q., Bouridane, A. 28/07/2025 In: IEEE Transactions on Artificial Intelligence. 10 p.Journal article Energy Landscape-Aware Vision Transformers: Layerwise Dynamics and Adaptive Task-Specific Training via Hopfield StatesXia, R., Jiang, R. 23/09/2025 In: Advances in Neural Information Processing Systems. 38Journal article Quantum Face Recognition with Multi-Gate Quantum Convolutional Neural NetworkZhu, Y., Bouridane, A., Celebi, M.E., Konar, D., Angelov, P., Ni, Q., Jiang, R. 31/12/2024 In: IEEE Transactions on Artificial Intelligence. 5, 12, p. 6330-6341. 12 p.Journal article 3-D Quantum-Inspired Self-Supervised Tensor Network for Volumetric Segmentation of Medical ImagesKonar, D., Bhattacharyya, S., Gandhi, T.K., Panigrahi, B.K., Jiang, R. 31/08/2024 In: IEEE Transactions on Neural Networks and Learning Systems. 35, 8, p. 10312-10325. 14 p.Journal article DNR-Pruning: Sparsity-Aware Pruning via Dying Neuron Reactivation in Convolutional Neural NetworksWang, B., Jiang, R. 30/09/2025 In: Transactions on Machine Learning Research. 2025-September, 26 p.Journal article Towards Quantum Image Generation on Single Qubit using Quantum Information BottleneckZhu, Y., Aggarwal, V., Konar, D., Pashkin, Y., Angelov, P., Jiang, R. 29/09/2025 In: IEEE Transactions on Artificial Intelligence. p. 1-12. 12 p.Journal article Modeling Brain Aging with Explainable Triamese ViT: Towards Deeper Insights into Autism DisorderZhang, Z., Aggarwal, V., Angelov, P., Jiang, R. 1/11/2025 In: IEEE Journal of Biomedical and Health Informatics. 29, 11, p. 8409-8422. 14 p.Journal article User-Centric Democratization towards Social Value Aligned Medical AI ServicesZhang, Z., Jiang, R. 19/08/2023Conference contribution/Paper Privacy-Protected Facial Biometric Verification Using Fuzzy Forest LearningJiang, R., Bouridane, A., Crookes, D., Celebi, M.E., Wei, H. 1/08/2016 In: IEEE Transactions on Fuzzy Systems. 24, 4, p. 779-790. 12 p.Journal article A Computational Model for Reputation and Ensemble-Based Learning Model for Prediction of Trustworthiness in Vehicular Ad Hoc NetworkAlharthi, A., Ni, Q., Jiang, R., Khan, M.A. 15/10/2023 In: IEEE Internet of Things Journal. 10, 20, p. 18248-18258. 11 p.Journal article Face Recognition in the Scrambled Domain via Salience-Aware Ensembles of Many KernelsJiang, R., Al-Maadeed, S., Bouridane, A., Crookes, D., Celebi, M.E. 1/08/2016 In: IEEE Transactions on Information Forensics and Security. 11, 8, p. 1807-1817. 11 p.Journal article WALDATA: Wavelet transform based adversarial learning for the detection of anomalous trading activitiesSafa, K., Belatreche, A., Ouadfel, S., Jiang, R. 1/12/2024 In: Expert Systems with Applications. 255, Part CJournal article Shallow Unorganized Neural Networks Using Smart Neuron Model for Visual PerceptionJiang, R., Crookes, D. 31/10/2019 In: IEEE Access. 7, p. 152701-152714. 14 p.Journal article Delve into Neural Activations: Towards Understanding Dying NeuronsJiang, Z., Wang, Y., Li, C., Angelov, P., Jiang, R. 1/08/2023 In: IEEE Transactions on Artificial Intelligence. 4, 4, p. 959-971. 13 p.Journal article Semantic Segmentation under Adverse Conditions: A Weather and Nighttime-aware Synthetic Data-based ApproachKerim, A., Chamone, F., De Souza Ramos, W., Soriano Marcolino, L., Nascimento, E.R., Jiang, R. 30/09/2022Conference contribution/Paper Self-Supervised Leaf Segmentation under Complex Lighting ConditionsLin, X., Li, C., Adams, S., Kouzani, A.Z., Jiang, R., He, L., Hu, Y., Vernon, M., Doeven, E.H., Webb, L., Mcclellan, T., Guskic, A. 31/03/2023 In: Pattern Recognition. 135, 14 p.Journal article Emotion recognition from scrambled facial images via many graph embeddingJiang, R., Ho, A.T.S., Cheheb, I., Al-Maadeed, N., Al-Maadeed, S., Bouridane, A. 1/07/2017 In: Pattern Recognition. 67, p. 245-251. 7 p.Journal article Marine Debris Detection in Satellite Surveillance using Attention MechanismsShen, A., Zhu, Y., Angelov, P., Jiang, R. 3/01/2024 In: IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing. 17, p. 4320-4330. 11 p.Journal article Multimodal Biometric Human Recognition for Perceptual Human-Computer InteractionJiang, R.M., Sadka, A.H., Crookes, D. 11/2010 In: IEEE Transactions on Systems, Man, and Cybernetics, Part C: Applications and Reviews. 40, 6, p. 676-681. 6 p.Journal article Live-Cell Tracking Using SIFT Features in DIC Microscopic VideosJiang, R.M., Crookes, D., Luo, N., Davidson, M.W. 09/2010 In: IEEE Transactions on Biomedical Engineering. 57, 9, p. 2219-2228. 10 p.Journal article All Publications Show only selected publications Democratic Federated Learning for Cross–Silo Medical Services via Explainable AI (Abdulrahman Alsaluli) 01/10/2025 → 30/09/2028 Research Quantum Brain: Leveraging Quantum Neuromorphic Computing towards Human-Like Intelligence 01/07/2025 → 31/08/2025 Research AI Democracy - Go Beyond the Clouds 15/06/2022 → 15/09/2022 Research Target-Aware High-Quality Video Generation via 3D CNN based Self-Supervised Adversary Learning 01/03/2020 → 31/07/2023 Research Face2Gene: Genetic Identity behind Deep Facial Features 01/08/2019 → 28/02/2021 Research Privacy-Protected Human Identification in Encrypted/Transformed Domains 14/05/2017 → 28/02/2019 Research Fourty-Seventh AAAI Conference on Artificial Intelligence (AAAI-26): Special Track on AI Alignment Participation in conference - Public NeurIPS 2025: The 39th Conference on Neural Information Processing Systems Participation in conference - Academic The 3rd World Conference on eXplainable Artificial Intelligence Participation in conference - Academic Blockchain & Cryptocurrency Conference (B2C' 2024) Participation in conference - Academic International Conference on AI in Healthcare Participation in conference - Academic The 2nd World Conference on eXplainable Artificial Intelligence Participation in conference - Academic The Sixteenth International Conference on Information, Process, and Knowledge Management Participation in conference - Academic IET Information Security (Journal) Editorial activity EURASIP Journal on Image and Video Processing (Journal) Editorial activity PLoS ONE (Journal) Editorial activity Journal of Information Security and Applications (Journal) Editorial activity Frontiers in Artificial Intelligence (Journal) Editorial activity Senso",
  "content_length": 11774,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:53"
}