{
  "name": "Richard S. Zemel",
  "homepage": "http://www.cs.toronto.edu/~zemel",
  "status": "success",
  "content": "Professor Richard Zemel Richard Zemel Professor Department of Computer Science University of Toronto Recent Research Highlights Research Interests Selected Papers Course Offerings Students & Post Docs Prospective Students Affiliations News Brief Academic Bio Curriculum Vitae Contact Info Visitor Info Contact: Department of Computer Science University of Toronto Office: Pratt Building 290C Packages: 10 King's College Road, Rm. 3302Toronto, Ontario, CANADA M5S 3G4 Phone: (416) 978-7497 Fax: (416) 978-1455 Email: zemel [at] cs [dot] toronto [dot] edu NOTE: I am on-leave from the University of Toronto in 2021-2022, and am not taking on new students. Co-Founder, Vector Institute for Artificial Intelligence Industrial Research Chair in Machine Learning, University of Toronto Senior Fellow, Canadian Institute for Advanced Research Recent Research Highlights Environment inference for invariant learning. Elliot Creager, Joern Jacobsen, Richard Zemel. ICML 2021 (2021). SketchEmbedNet: Learning novel concepts by imitating drawings. Alex Wang, Mengye Ren, Richard Zemel. ICML 2021 (2021). Universal template for few-shot dataset generalization. Eleni Triantafillou, Hugo Larochelle, Richard Zemel, Vincent Dumoulin. ICML 2021 (2021). On monotonic linear interpolation of neural network parameters. James Lucas, Juhan Bae, Michael Zhang, Stanislav Fort, Richard Zemel, Roger Grosse. ICML 2021 (2021). A computational framework for slang generation. Zhewei Sun, Richard Zemel, Yang Xu. Transactions of the Association for Computational Linguistics, 9: 478-462 (2021). Wandering within a world: Online contextualized few-shot learning. Mengye Ren, Michael Iuzzolino, Michael Mozer, Richard Zemel. ICLR 2021 (2021). Bayesian few-shot classification with one-vs-each Polya-Gamma augmented Gaussian Processes. Jake Snell, Richard Zemel. ICLR 2021 (2021). Theoretical bounds on estimation error for meta-learning. James Lucas, Mengye Ren, Irene Kameni, Toni Pitassi, Richard Zemel. ICLR 2021 (2021). A PAC-Bayesian approach to generalization bounds for graph neural networks. Renjie Liao, Raquel Urtasun, Richard Zemel. ICLR 2021 (2021). Shortcut learning in deep neural networks. Robert Geirhos, Jörn-Henrik Jacobsen, Claudio Michaelis, Richard Zemel, Wieland Brendel, Matthias Bethge, Felix Wichmann . Nature Machine Intelligence (2020). Causal modeling for fairness in dynamical systems. Elliot Creager, David Madras, Toni Pitassi, Richard Zemel. ICML 2020 (2020). Cutting out the middle-man: Training and evaluating energy-based models without sampling. Will Grathwohl, Jackson Wang, Jorn Jacobsen, David Duvenaud, Richard Zemel. ICML 2020 (2020). Optimizing long-term social welfare in recommender systems: A constrained matching approach.. Martin Mladenov, Elliot Creager, O Ben-Porat, Kevin Swersky, Richard Zemel, Craig Boutilier. ICML 2020 (2020). Understanding the limitations of conditional generative models. Ethan Fetaya, Joern-Henrik Jacobsen, Will Grathwohl, Richard Zemel. ICLR 2020 (2020). Incremental few-shot learning with attention attractor networks. Mengye Ren, Renjie Liao, Ethan Fetaya, Richard Zemel. NeurIPS 2019 (2019). SMILe: Scalable meta inverse reinforcement learning through context-conditional policies. Seyed Kamyar Seyed Ghasemipour, Shane Gu, Richard Zemel. NeurIPS 2019 (2019). Efficient graph generation with graph recurrent attention networks. Renjie Liao, Yujia Li, Yang Song, Shenlong Wang, Charlie Nash, William Hamilton, David Duvenaud, Raquel Urtasun, Richard Zemel. NeurIPS 2019 (2019). Flexibly fair representation learning by disentanglement. Elliot Creager, David Madras, Joern-Henrik Jacobsen, Marissa Weis, Kevin Swersky, Toniann Pitassi, Richard Zemel. ICML (2019). [web page]Understanding the origins of bias in word embedding. Marc-Etienne Brunet, Colleen Alkalay-Houlihan, Ashton Anderson, Richard Zemel. ICML (2019). Lorentzian distance learning for hyperbolic representations. Marc Law, Renjie Liao, Jake Snell, Richard Zemel. ICML (2019). [web page]Excessive invariance causes adversarial vulnerability. Jörn-Henrik Jacobsen, Jens Behrmann, Richard Zemel, Matthias Bethge. ICLR (2019). [web page]Aggregated momentum: Stability through passive damping. James Lucas, Shengyang Sun, Richard Zemel, Roger Grosse. ICLR (2019). [web page]LanczosNet: Multi-scale deep graph convolutional networks. Renjie Liao, Zhizhen Zhao, Raquel Urtasun, Richard Zemel. ICLR (2019). [web page]Dimensionality reduction for representing the knowledge of probabilistic models. Marc Law, Jake Snell, Amir-massoud Farahmand, Raquel Urtasun, Richard Zemel. ICLR (2019). A divergence minimization perspective on imitation learning methods. Seyed Kamyar Seyed Ghasemipour, Richard Zemel, Shane Gu. CoRL 2019 [Best Paper Award] (2019). Fairness through causal awareness: Learning causal latent-variable models for biased data.. David Madras, Elliot Creager, Toni Pitassi, Richard Zemel. Conference on Fairness, Accountability and Transparencey (FAT*) (2019). Learning latent subspaces in variational autoencoders. Jack Klys, Jake Snell, Richard Zemel. NIPS (2018). [pdf]The elephant in the room. Amir Rosenfeld, Richard Zemel, John K. Tsotsos. arxiv (2018). Predict responsibly: improving fairness and accuracy by learning to defer. David Madras, Toni Pitassi, Richard Zemel. NIPS (2018). [pdf]Neural guided constraint logic programming for program synthesis. Lisa Zhang, Gregory Rosenblatt, Ethan Fetaya, Renjie Liao, William Byrd, Matthew Might, Raquel Urtasun, Richard Zemel.. NIPS (2018). [pdf]Reviving and improving recurrent back-propagation. Renjie Liao, Yuwen Xiong, Ethan Fetaya, Lisa Zhang, KiJung Yoon, Zachary Pitkow, Raquel Urtasun, Richard Zemel. ICML (2018). [pdf]Learning adversarially fair and transferable representations. David Madras, Elliot Creager, Toniann Pitassi, Richard Zemel. ICML (2018). [pdf]Adversarial distillation of Bayesian neural network posteriors. Kuan-Chieh Wang, Paul Vicol, James Lucas, Li Gu, Roger Grosse, Richard Zemel. ICML (2018). [pdf]Neural relational inference for interacting systems. Thomas Kipf, Ethan Fetaya, Kuan-Chieh Wang, Max Welling, Richard Zemel. ICML (2018). [pdf]Few-shot learning through an information retrieval lens. Eleni Triantafillou, Richard Zemel, Raquel Urtasun. NIPS (2017). [pdf]Dualing GANs. Yujia Li, Alexander Schwing, Kuan-Chieh Wang, Richard Zemel. NIPS (2017). [pdf]Causal effect inference with deep latent-variable models. Christos Louizos, Uri Shalit, Joris Mooij, David Sontag, Richard Zemel, Max Welling. NIPS (2017). [pdf]Deep spectral clustering learning. Marc Law, Raquel Urtasun, Richard Zemel. ICML (2017). [pdf, web page]Efficient multiple Instance metric learning using weakly supervised data. Marc Law, Yaoling Yu, Raquel Urtasun, Richard Zemel, Eric Xing. CVPR (2017). [pdf]Prototypical networks for few-shot learning. Jake Snell, Kevin Swersky, Richard Zemel. NIPS (2017). [pdf, pdf]Stochastic segmentation trees. Jake Snell, Richard Zemel. UAI (2017). [pdf, pdf]Normalizing the normalizers: Comparing and extending network normalization schemes. Mengye Ren, Renjie Liao, Raquel Urtasun, Fabian H. Sinz, Richard S. Zemel. ICLR 2017 (2017). [web page]End-to-end instance segmentation with recurrent attention. Mengye Ren and Richard Zemel. CVPR (2017). [pdf, code] Towards generalizable sentence embeddings . Eleni Triantafillou, Jamie Ryan Kiros, Raquel Urtasun, Richard Zemel. ACL Workshop on Representation Learning for NLP (2016). [pdf]The variational fair autoencoder. Christos Louizos, Kevin Swersky, Yujia Li, Max Welling, Richard Zemel. ICLR 2016 (2016). [pdf]Classifying NBA offensive plays using neural networks. Kuan-Chieh Wang, Richard Zemel. Sloan Sports Analytics Conference (2016). [pdf]Understanding the effective receptive field in deep convolutional neural networks. Wenjie Luo, Yujia Li, Raquel Urtasun, Richard Zemel. NIPS 2016 (2016). [pdf, poster]Learning deep parsimonious representations. Renjie Liao, Alexander Schwing, Richard Zemel, Raquel Urtasun. NIPS 2016 (2016). [pdf, poster]Training deep neural networks via direct loss minimization. Yang Song, Alex Schwing, Richard Zemel, Raquel Urtasun. ICML 2016 (2016). [pdf]Learning to generate images with perceptual similarity metrics. Jake Snell, Karl Ridgeway, Renjie Liao, Brett Roads, Michael C. Mozer & Richard S. Zemel. ICIP (2017). [pdf, pdf]Generative moment matching networks. Yujia Li, Kevin Swersky and Richard Zemel . ICML-2015: The 32nd International Conference on Machine Learning (2015). [pdf]Show, attend and tell: Neural image caption generation with visual attention. Kelvin Xu, Jimmy Ba, Ryan Kiros, Kyunghyun Cho, Aaron Courville, Ruslan Salakhutdinov, Richard Zemel, Yoshua Bengio. ICML-2015: The 32nd International Conference on Machine Learning (2015). [pdf, web page, notes, notes] Siamese neural networks for one-shot image recognition. Gregory Koch, Richard Zemel, Ruslan Salakhutdinov. ICML 2015 Deep Learning Workshop (2015). [pdf]A neural autoregressive approach to attention-based recognition. Yin Zheng, Richard Zemel, Yu-Jin Zhang and Hugo Larochelle. International Journal of Computer Vision, Special Issue on Deep Learning (2014). [pdf]Leveraging user libraries to bootstrap collaborative filtering. Laurent Charlin, Richard Zemel, Hugo Larochelle. KDD 2014: 20th ACM Conference on Knowledge Discovery and Data Mining (2014). [pdf]High order regularization for semi-supervised learning of structured output problems. Yujia Li, Richard Zemel. ICML-2014: The 31st International Conference on Machine Learning (2014). [pdf, poster, notes]Multimodal neural language models. Ryan Kiros, Ruslan Salakhutdinov, Richard Zemel. ICML-2014: The 31st International Conference on Machine Learning (2014). [pdf]Mean field networks. Yujia Li, Richard Zemel. ICML Workshop on Learning Tractable Probabilistic Models (2014). [pdf, notes]Input warping for Bayesian optimization of non-stationary functions. Jasper Snoek, Kevin Swersky, Richard Zemel, Ryan Adams. ICML-2014: The 31st Internatio",
  "content_length": 11975,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:58"
}