{
  "name": "Richard S. Bird",
  "homepage": "http://www.cs.ox.ac.uk/richard.bird",
  "status": "success",
  "content": "Richard Bird | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleEmeritus FacultyRichard BirdRichard Bird Professor Richard Bird Emeritus ProfessorFellow, Lincoln CollegeSee Also:Algorithm Design with HaskellThinking Functionally with HaskellCode for Garsia-Wachs paperInterests The algebra of programming; See the Algebra of Programming Research Group home page. The calculation of algorithms from their specification Functional programming Algorithm designSelected PublicationsView AllManage publications A Greedy Algorithm for Dropping Digits Richard S. Bird and Shin−Cheng Mu In Journal of Functional Programming. Vol. 31. Pages e29. 2021. Details about A Greedy Algorithm for Dropping Digits | BibTeX data for A Greedy Algorithm for Dropping Digits | DOI (10.1017/S0956796821000198) Algorithmics Nicolas Wu Richard S. Bird Jeremy Gibbons Ralf Hinze Peter Hoefner Johan Jeuring Lambert G. L. T. Meertens Bernhard Moeller Carroll Morgan Tom Schrijvers Wouter Swierstra In Kai Rannenberg Michael Goedicke Erich J. Neuhold, editor, Advancing Research in Information and Communication Technology − IFIP's Exciting First 60+ Years‚ Views from the Technical Committees and Working Groups. Vol. 600 of IFIP Advances in Information and Communication Technology. Pages 59−98. Springer. 2021. Details about Algorithmics | BibTeX data for Algorithmics | Download of Algorithmics | DOI (10.1007/978-3-030-81701-5_3) | Download (pdf) of Algorithmics Algorithm Design with Haskell Richard Bird and Jeremy Gibbons Cambridge University Press. July, 2020. Details about Algorithm Design with Haskell | BibTeX data for Algorithm Design with Haskell | Link to Algorithm Design with Haskell ActivitiesAlgebra of ProgrammingAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 1997,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:58"
}