{
  "name": "Richard Bowden",
  "homepage": "http://personal.ee.surrey.ac.uk/Personal/R.Bowden",
  "status": "success",
  "content": "Professor Richard Bowden Professor Richard Bowden Richard Bowden received a BSc in computer science from the University of London in 93, an MSc with distinction from the University of Leeds in 95, and a PhD in computer vision from Brunel University in 99 for which he was awarded the Sullivan Doctoral Thesis Prize for the best UK thesis in computer vision. An award also won by three of his PhD students (Lebeda 2017, Mendez 2018 and Spencer-Martin2021). He is Professor of Computer Vision and Machine Learning at the University of Surrey, UK, where he leads the Cognitive Vision Group within the Centre for Vision Speech and Signal Processing. He is also co-founder and Chief Scientist of the company Signapse AI. His research centres on the use of computer vision to locate, track, and understand humans. He was Associate Editor for Image and Vision Computing 2009-2022 and IEEE Pattern Analysis and Machine Intelligence 2013-2019. He was a member of the British Machine Vision Association (BMVA) executive committee and a company director for seven years. He is a fellow of the Higher Education Academy, a senior member of the IEEE, a Fellow of the International Association of Pattern Recognition and Distinguished Fellow of the BMVA. Google Scholar Linkedin ORCID Research Gate Contact blog: How to build an autonomous car Im always looking for good PhD candidates but normally when I have funding available it is for UK or EU students. This is sometimes due to restrictions on the funding but more often than not more to do with the difference between home and overseas fees. However, if you are an exceptional candidate, then drop me an email. I am happy to work with high caliber candidates to obtain scholarships either internally or from external funders such as the China Scholarship Council or the Commonwealth Scholarship Council. Please note that we do not operate an internship scheme so if you're emailing me about this its likely to go unanswered. Latest News: Sept 2025 - Ed had his NeurIPS accepted and Ozge her journal paper. Aug 2025 - 2 more papers accepted at BMVC (well done Sobhan and Maksym) July 2025 - 5 papers accepted at SLTAT and 2 at ICCV workshops July 2025 - Congrats to Ryan and Marhsall on having their ICCV papers accepted. June 2025 - Congratulations to Anton on his Journal publication and Roger for his two oral IROS papers. June 2025 - Ran two workshops are CVPR, MDEC and SLRTP. May 2025 - Welcome to Karahan Sahin and Steven Emery who joined the group this month April 2025 - Three papers accepted for Face and Gesture, congrats Leo, Maxim and Mohamed March 2025 - Congratulations to George for having her ICRA2025 paper accepted Feb 2025 - Currently recruiting 2 Research Fellows, a Research Software Engineer and a Project Manager for SignGPT project Feb 2025 - Spinoff company Signapse releases Try with AI on its Sign studio product Jan 2025 - New major grant announced SignGPT March 2024 - Currently have openings for both post doc and PhD positions in the lab March 2024 - 4 Papers accepted to Face and Gesture 2024 in Istanbul Feb 2024 - Paper accepted for LREC-COLING2024. Feb 2024 - New dataset and simulator accepted for IROS2024 in Japan Jan 2024 - Congrats to Ryan on having his ICLR2024 paper accepted July 2023 - 2 papers accepted for ICCV, congratulations to Avi and Jaime, and 3 workshop papers June 2023 - We are running the 2nd Monocular Depth Estimation Challenge as a workshop at CVPR2023 March 2023 - TMLR paper \"A Free Lunch with Influence Functions?...\" accepted Dec 2022 - TMLR paper \"Deconstructing Self-Supervised Monocular Reconstruction\" accepted. Nov 2022 - Journal accepted for IEEE Transactions on Biometrics, Behavior, and Identity Science Nov 2022 - Awarded Distinguished Fellow of the British Machine Vision Conference Nov 2022 - Spinoff company Signaspe awarded startup of the year at Surrey Business Awards Oct 2022 - Spinoff company Signapse finalist in three categories for the Surrey Business Awards July 2022 - Ryan won the Track 1 challenge in this years ECCV 2022 Sign Spotting Challenge at chalearn July 2022 - 3 Papers accepted for IROS and a journal in IEEE Access May 2022 - Currently looking for 2 PhD students: one in sign recognition and one in sign production. May 2022 - Avi's Paper at ICRA shortlisted and won the outstanding/best paper award. March 2022 - Matthews paper on Structure Learning and Causal Discovery accepted to ACM Computing Surveys. March 2022 - 2 Papers accepted for CVPR 2022 Feb 2022 - 1 Paper accepted for ICRA 2022 Oct 2021 - Another paper accepted for FG2021 in the second reviewing round making 4 in total. Oct 2021 - New collaborative Swiss Flagship project announced. Oct 2021 - Giving an invited talk at Crossmodal Social Animation Workshop @ ICCV2021 Aug 2021 - 3 Papers accepted to Face and Gesture 2021 and another paper accepted for ICCV2021 July 2021 - 2 Papers accepted for IROS 2021 June 2021 - 3 Papers accepted for ITSC 2021 June 2021 - 1 Paper at CVPR2021, 3 Workshop papers and 2 invited keynote talks at CVPR workshops June 2021 - Giving an invited talk at CREST Fest 2021 in the US May 2021 - Extended version of sign language generation with progressive transformers in IJCV. March 2021 - 3 Papers accepted to ICRA and 1 Paper accepted at CVPR. May 2020 - EU Project Content4ALL receives Technology Innovation Award at NAB, link, link, link Feb 2020 - Four Papers accepted for CVPR. One Oral and three Posters Selected Publications 2025 Fish E, Bowden R. Geo-Sign: Hyperbolic Contrastive Regularisation for Geometrically Aware Sign Language Translation. In Proc. NeurIPS 2025. Accepted, to appear. DOI: TBA Download: arXiv, Preprint, SRI Sincan OM, Low JH, Asasi, Sobhan, Bowden R. Gloss-Free Sign Language Translation: An Unbiased Evaluation of Progress in the Field. In Computer Vision and Image Understanding. Accepted, to appear. DOI: TBA Download: arXiv, Preprint, SRI Asasi S, Lakhal MI, Sincan OM, Bowden R. Beyond Gloss: A Hand-Centric Framework for Gloss-Free Sign Language Translation. In Proc. BMVC 2025. DOI: TBA Download: arXiv, Preprint, SRI Ivashechkin M, Mendez O, Bowden R. HuGeDiff: 3D Human Generation via Diffusion with Gaussian Splatting. In Proc. BMVC 2025. DOI: TBA Download: arXiv, Preprint, SRI Thomas M, Fish E, Bowden R. VALLR: Visual ASR Language Model for Lip Reading. In Proc. Int. Conf. on Computer Vision (ICCV), 2025. DOI: TBA Download: arXiv, Preprint, SRI Wong R, Camgoz N C, Bowden R. SignRep: Enhancing Self-Supervised Sign Representations. In Proc. Int. Conf. on Computer Vision (ICCV), 2025. DOI: TBA Download: arXiv, Preprint, SRI Fransen R, Bowden R, Hadfield S. BeeTLe: Blind Terrain-aware Learned Locomotion. In Proc. IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2025. DOI: TBA Download: arXiv, Preprint, SRI Fransen R, Bowden R, Hadfield S. Addressing Dimensional Scaling in Reinforcement Learning for Symbolic Locomotion Policies through Leveraging Inductive Priors.  In Proc. IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2025. DOI: TBA Download: arXiv, Preprint, SRI Symeonidis-Herzig, A, Sincan OM, Bowden R. VisualSpeaker: Visually-Guided 3D Avatar Lip Synthesis. In Proc. CV4A11y: Workshop on Vision Foundation Models and Generative AI for Accessibility. ICCV Workshop. Accepted, to appear. DOI: TBA Download: arXiv, Preprint, SRI Low JH, Sincan OM, Bowden R. SAGE: Segment-Aware Gloss-Free Encoding for Token-Efficient Sign Language Translation. In Proc. SAGE: Segment-Aware Gloss-Free Encoding for Token-Efficient Sign Language Translation.  ICCV Workshop. Accepted, to appear. DOI: TBA Download: arXiv, Preprint, SRI Low JH, Sincan OM, Bowden R. Sign Spotting Disambiguation using Large Language Models. In SLTAT 2025: 9th Workshop on Sign Language Translation and Avatar Technologies. In Adjunct Proceedings of the 25th ACM International Conference on Intelligent Virtual Agents (IVA Adjunct '25). Association for Computing Machinery. pp1-9. DOI: 10.1145/3742886.3756720 Download: arXiv, Preprint, SRI Sincan OM, Bowden R. Contrastive Pretraining with Dual Visual Encoders for Gloss-Free Sign Language Translation. In SLTAT 2025: 9th Workshop on Sign Language Translation and Avatar Technologies. IVA Adjunct '25: Adjunct Proceedings of the 25th ACM International Conference on Intelligent Virtual Agents. pp1-7. DOI: 10.1145/3742886.3756703 Download: arXiv, Preprint, SRI Walsh H, Ivashechkin M, Bowden R. Using Sign Language Production as Data Augmentation to enhance Sign Language Translation. In SLTAT 2025: 9th Workshop on Sign Language Translation and Avatar Technologies. In Adjunct Proceedings of the 25th ACM International Conference on Intelligent Virtual Agents (IVA Adjunct '25). Association for Computing Machinery. pp1-10. DOI: 10.1145/3742886.3756723 Download: arXiv, Preprint, SRI Sincan OM, Bowden R. Spotter+GPT: Turning Sign Spottings into Sentences with LLMs. In SLTAT 2025: 9th Workshop on Sign Language Translation and Avatar Technologies. In Adjunct Proceedings of the 25th ACM International Conference on Intelligent Virtual Agents (IVA Adjunct '25). Association for Computing Machinery. pp1-6. DOI: 10.1145/3742886.3756708 Download: arXiv, Preprint, SRI Asasi S, Lakhal MI, Bowden R. Hierarchical Feature Alignment for Gloss-Free Sign Language Translation. In SLTAT 2025: 9th Workshop on Sign Language Translation and Avatar Technologies. In Adjunct Proceedings of the 25th ACM International Conference on Intelligent Virtual Agents (IVA Adjunct '25). Association for Computing Machinery. pp1-6. DOI: 10.1145/3742886.3756707 Download: arXiv, Preprint, SRI Bowden R, Saunders B, Wheatley M, Crowley C, Hirshman M, Birtles D. Taxonomy and Definitions for Terms Related to Automatic Translation of Spoken Language into Sign Language -Version 1.2. 1st May 2025. DOI: 10.15126/901631 Download: arXiv, Preprint, SRI Pelykh A, Sincan OM, Bowden R. Handling the Details: A Two-Stage Diffusion Approach to Improving Hands in Huma",
  "content_length": 97922,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:43"
}