{
  "name": "Richard F. Paige",
  "homepage": "https://www.cas.mcmaster.ca/paige",
  "status": "success",
  "content": "Richard Paige's Web Page Richard Paige (photo by Eelco Visser; click on the photo for a more realistic representation) Dr. Richard Paige Professor, Department of Computing and Software, McMaster University, 1280 Main Street West, Hamilton, Ontario, L8S 4L7 Canada email: my last name followed by my first two initials at mcmaster dot ca I am (full) Professor of Software Engineering at McMaster University, Hamilton, Canada, in the Department of Computing and Software. I joined the department in January 2019. I continue to hold a part-time position as Professor of Enterprise Systems in the Department of Computer Science at the University of York. I work part-time (and mostly remotely) at York. From July 2001 through December 2018 I was a full-time academic and Chair of Enterprise Systems in the Department of Computer Science, University of York, UK. From June 1997 - June 2001, I was at York University, Toronto, Canada. I received my PhD in Computer Science from the University of Toronto in 1997 under the supervision of Eric C.R. Hehner. I research and teach software engineering, with an emphasis on industrial applications and technology transfer. My current interests are in modelling (e.g., model-based development, model transformation), agile development, software architecture, integrated methods, formal methods, safety- and security-critical systems, cloud computing, and search-based software engineering. As part of this, I am involved in a number of conferences (see here). I am a member of the steering committee of the International Conference on Model Transformation (ICMT), Software Technologies federated symposium (I am currently chair of the steering committee), and of the MoDELS Conference series. I was program chair for TOOLS Europe 2008, June/July 2008, in Zurich, ICMT 2009 (also in Zurich), program co-chair for ECMDA-FA 2009 in Enschede, and program co-chair for ICECCS 2010 in Oxford. I was program co-chair for Software Language Engineering 2013 in Indianapolis, and was general chair for SLE 2015 in Pittsburgh, Pennsylvania. I was Foundations track program chair for MoDELS 2018 in Copenhagen, Denmark. I am on the editorial board for the Springer journal Software and Systems Modeling, the open-access Journal of Object Technology (I am editor for Special Issues/Themes), and the Springer journal Empirical Software Engineering. I was for three years on the editorial board of the Elsevier journal Journal of Systems Architecture, where I focused on Model-Driven Engineering. I am currently an investigator on the Innovate UK-funded project SECT-AIR, where we are developing approaches to automatically generating assurance cases and qualification data using model transformation. I am also an investigator on the H2020 project CROSSMINER (starting January 2017), where we are investigating off-line and on-line analytics in the IDE. I am an investigator in the H2020 project TYPHON (starting January 2018) on hybrid polystores. I am an investigator in three Knowledge Transfer Partnerships funded by Innovate UK: one with IBM UK (focusing on transforming spreadsheets to OLAP-based analytic models), one with Smith and Nephew on deploying Model-Driven Engineering for building healthcare applications, and one with Rolls-Royce on complex heterogeneous modeling. I am also involved in the Marie-Curie European Training Network LOWCOMOTE. For my sins I am also involved in the Papyrus Industry-Academic Consortium. Previously, I was principal investigator on a DSTL-funded project on technical obsolescence, where we are developing model-based approaches to migrating applications across software and hardware platforms while making it easier to carry out re-certification. I was principal investigator on the EC FP7 project OSSMETER, where we developed measures and metrics to assess the impact and quality of OSS projects. I was principal investigator on the SESAR JU project COMPASS, exploring MDE techniques applied to air traffic management. I was also involved as co-investigator on the EPSRC-funded project LSCITS, the FP7 funded project MONDO, and a EURAMET-funded project with the National Physical Laboratory on software modelling for measurement. I was an investigator on the EC FP7 project MADES, where we developed languages and tools for Model-Driven Embedded Systems development. I was an investigator on the MoD-funded SSEI, where I led research on model-driven systems integration. I was also recently an investigator on the FP7 project INESS, where we used model transformation to enable analysis of large-scale (safety) requirements models. I was a co-investigator on a recent EPSRC project exploring domain-specific languages for measurement, for the National Physical Laboratory. I was a partner in the European Integrated Project MODELPLEX, which ran from September 2006 through February 2010. In MODELPLEX, we extended our work on the Epsilon project, which is one of the leading platforms for model management. I was principal investigator on the EPSRC project Refinement Patterns for Contractual Statecharts, which ran from July 2007 until September 2010. I was the principal investigator on the e-Science EPSRC-funded project eXGrid: Agile Development of High-Integrity Grid Middleware, which ran from 2004-2007. I was a Strand Leader (\"Model-Based Systems Engineering\") in the High-Integrity Real-Time Systems DARP, which was funded by the EPSRC, DTI, and the MOD, in partnership with BAE Systems, Rolls-Royce, and QinetiQ from 2002-2006. I was also a partner in the EU Integrated Project MODELWARE, which ran from 2004-2006. As well, I also did some work with QinetiQ in 2005 on a project to compare the benefits of proof versus testing under the auspices of DO-178B.",
  "content_length": 5737,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:46"
}