{
  "name": "Richard Marciano",
  "homepage": "https://www.cs.umd.edu/people/marciano",
  "status": "success",
  "content": "Richard Marciano | UMD Department of Computer Science Skip to main content Explore People People FacultyFaculty Awards In Memoriam Staff Dept. PhonebookFaculty Staff Students As PDF University Directory Search People Overview Name Search by name Title Search by title Location Search by location Apply Reset Richard Marciano Affiliate Professor Email: marcianoumd[.dot.]edu Phone: (301) 314-0281 Location: HBK 4113 South Google Scholar: 6xPi5mQAAAAJ Education: Ph.D., University of Iowa, 1992. National School of Civil Aviation, Toulouse France, 1985 Appointments: CS, ISR, ISCHOOL Research Areas: Databases and Big Data, Information Retrieval and Geographic Information Systems (GIS), Machine Learning and Data Science Interest Areas: Digital curation, digital preservation, digital archives and records management, ectronic records, digital humanities, spatial informatics, sustainable archives, cyber-infrastructure Biography Dr. Richard Marciano is a professor in the College of Information Studies at the University of Maryland.  He is an affiliate faculty member of ISR and the Department of Computer Science. Prior to that, he was a Professor at the School of Information and Library Science at the University of North Carolina at Chapel Hill for 5 years. He was also a Research Scientist at the San Diego Supercomputer Center (SDSC) at the University of California San Diego (UCSD) for 13 years.  His research interests center on computational archival science (CAS), digital curation, digital preservation, sustainable archives, cyberinfrastructure, and big data.  He is also the 2017 recipient of the Emmett Leahy Award for \"outstanding and sustained work in digital records and information management\". He holds degrees in Avionics and Electrical Engineering, a Master's and Ph.D. in Computer Science from the University of Iowa, and conducted a postdoc in Computational Geography. Mentions 2014 Three affiliate faculty to join Department",
  "content_length": 1949,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:55"
}