{
  "name": "Richard Gault",
  "homepage": "https://pure.qub.ac.uk/en/persons/richard-gault",
  "status": "success",
  "content": "Richard Gault - Queen's University Belfast View Scopus Profile Richard Gault Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0001-6097-8981 EmailRichard.Gaultqub.acuk Room 02.005 - 21 Stranmillis RoadUnited Kingdom Accepting PhD StudentsPhD projectsPhD enquiries are welcome regarding projects in the areas of:- Computer Vision and Medical Image Analysis.Projects in these areas require experience in one (or more) of the following areas: Computer Science, Mathematics, Electrical Engineering, Software Engineering. 20142025 Research activity per year Personal profile Research InterestsMy primary research interests are related to the development of novel computer vision methods for microscopy with applications in medicine, digital pathology, biological sciences, and environmental sciences. KeywordsQA75 Electronic computers. Computer scienceQA76 Computer softwareArtificial Intelligencecomputer visionComputer VisionAI Fingerprint Dive into the research topics where Richard Gault is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Models Computer Science 100% Fuzzy-Neural System Computer Science 64% Tinnitus Neuroscience 57% Age-Related Macular Degeneration Neuroscience 57% Accuracy Computer Science 48% Deep Learning Method Computer Science 44% Ensemble Learning Computer Science 38% Retinal Disease Neuroscience 38% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2019 2025 1 Finished Projects per year R5131ECI: Approximation of 3D quantifiers by analysing 2D videoGault, R. (PI) & Shen, J. (CoI)28/11/2019 → 30/09/2025Project: Research Research output Research output per year 2014 2021 2024 2025 2025 20 Conference contribution 8 Poster 8 Article 3 Paper 5 More 2 Abstract 2 Meeting abstract 1 Working paper Research output per year Research output per year Combining self-attention and convolution to understand OCT imagesHaider, A., Wright, D., Hogg, R., Wang, H., Peto, T. & Gault, R., 30 Jun 2025, (Accepted) Irish Machine Vision and Image Processing Conference Proceedings 2025. Irish Pattern Recognition & Classification Society, (Proceedings of the Irish Machine Vision and Image Processing Conference).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Decision-Making 100% Retinal Disease 100% Age-Related Macular Degeneration 100% Convolution 100% Self-Attention 100% ConsensusXAI: A framework to examine class-wise agreement in medical imagingHaider, A., Wright, D., Hogg, R., Wang, H., Peto, T. & Gault, R., 11 Nov 2025, (Accepted) 2026 IEEE Winter Conference on Applications of Computer Vision (WACV): Proceedings. IEEEResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution Medical Imaging 100% Artificial Intelligence 100% Time Demand 100% Explainable Artificial Intelligence 100% XAI 100% Data informed initialization of fuzzy membership functionsWang, T., Gault, R. & Greer, D., 18 Feb 2025, (Early online date) In: International Journal of Fuzzy Systems. 12 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Fuzzy Membership Function 100% Membership Function 100% Fuzzy-Neural System 71% Baseline Model 28% Local Minimum 14% 10 Downloads (Pure) Deep learning based segmentation of retinal layers from OCT ImagingBaine, A., Haider, A., Hogg, R. & Gault, R., 01 Jun 2025, (Accepted) Irish Machine Vision and Image Processing Conference Proceedings 2025. (Proceedings of the Irish Machine Vision and Image Processing Conference).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Retinal Disease 100% Glaucoma 100% Age-Related Macular Degeneration 100% Diabetic Retinopathy 100% Deep Learning Method 100% Ensemble learning-based fuzzy aggregation functions and their application in TSK neural networksWang, T., Gault, R. & Greer, D., 01 Jun 2025, In: International Journal of Fuzzy Systems. 27, 4, p. 1115-1126 12 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Ensemble Learning 100% Neural Network 100% Aggregation Function 100% Fuzzy-Neural System 66% Regression Problem 33% 1 Citation (Scopus) 13 Downloads (Pure) View all 44 research outputs Prizes 2nd Place Glioma-MDC 2025 (One-shot testing) CompetitionBrown, A. (Recipient), Porter, V. (Recipient), Baine, A. (Recipient) & Gault, R. (Recipient), 16 Apr 2025Prize: Prize (including medals and awards) Ganglioglioma 100% Staining Technique 100% Action on Hearing Loss Travel ScholarshipGault, R. (Recipient), 16 Mar 2016Prize: Fellowship awarded competitively Research 100% Higher Education Finance 100% Action 100% Auditory Defect 100% Hearing Impairment 100% Best Oral Presentation at Annual Translational Medicine (TMED7) ConferenceGault, R. (Recipient), 27 Oct 2015Prize: Prize (including medals and awards) Best Poster Presentation: Irish Machine Vision and Image Processing ConferenceGault, R. (Recipient), 27 Aug 2014Prize: Prize (including medals and awards) Department of Education and Learning (DEL) NI PhD StudentshipGault, R. (Recipient), 01 Oct 2013Prize: Fellowship awarded competitively View all 14 prizes Activities Activities per year 2015 2020 2022 2023 2025 8 Participation in workshop, seminar, course 5 Membership of peer review panel or committee 5 Membership of external research organisation 5 Invited talk 25 More 4 Membership of national or international committees and working groups 3 Participation in conference 3 Publication peer-review 3 PhD external examination 3 Other 3 Hosting a school group or open day 2 Public lecture/debate/seminar 1 Work on advisory panel to industry or government or non-government organisation 1 Editorial activity 1 Invited or keynote talk at national or international conference 1 Visiting an external academic institution Activities per year A-I Spy: Through the Computer’s EyeGault, R. (Presenter), Porter, V. (Presenter) & Smith, C. (Presenter)17 Jun 2025Activity: Talk or presentation types › Invited talk AI-enabled flaw detection and classification using multi-sensory data fusionGault, R. (Examiner)13 Jun 2025Activity: Examination types › PhD external examination RAS 2025 | 8th Annual IEEE UK and Ireland Robotics and Automation Society Chapter ConferenceAthanasopoulos, N. (Chair), Gault, R. (Chair), McLoone, S. (Member of the organising committee), Schofield, A. (Session chair), Mullins, D. (Session chair), Naeem, W. (Session chair), Sopasakis, P. (Session chair), Van, M. (Session chair) & Edmondson, C. (Session chair)20 Feb 2025 → 21 Feb 2025Activity: Participating in or organising an event types › Participation in conference File An AI-Based Machine Vision Model for the Diagnosis of Neglected Tropical DiseasesGault, R. (Examiner)13 Sept 2024Activity: Examination types › PhD external examination Sensors and methodologies design for image processing in precision agriculture: crop water status and fruit ripening monitoringGault, R. (Examiner)03 Sept 2024Activity: Examination types › PhD external examination View all 48 activities",
  "content_length": 7474,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:48"
}