{
  "name": "Richard Banach",
  "homepage": "https://www.research.manchester.ac.uk/portal/richard.banach.html",
  "status": "success",
  "content": "Richard Banach - Research Explorer The University of Manchester Richard Banach Dr Senior Lecturer, Systems and Software Security https://orcid.org/0000-0002-0243-9434 Personal profile BiographyFor accurate and up to date info, see http://www.cs.man.ac.uk/~banachResearch interestsFor accurate and up to date info, see http://www.cs.man.ac.uk/~banachMy groupFormal MethodsOpportunitiesEnquiries from prospective postgraduate students interested in working with me are welcome. Please see my homepage (http://www.cs.man.ac.uk/~banach) for details of my research interests and my email address. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital Futures Fingerprint Dive into the research topics where Richard Banach is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Cyber Physical Systems Computer Science 100% Case Study Computer Science 100% Proof Obligation Computer Science 82% Illustrates Engineering 76% Operational Semantics Computer Science 57% Concurrency Computer Science 46% Use Case Computer Science 46% Applicability Engineering 46% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 67 Conference contribution 54 Article 4 Other 3 Chapter Research output per year Research output per year Permissionless Blockchain Recent Trends, Privacy Concerns, Potential Solutions and Secure Development LifecycleBayan, T., Yazici, A. & Banach, R., 11 Nov 2025, (Accepted/In press) In: Future Internet.Research output: Contribution to journal › Article › peer-review Secure Development 100% Lexical Tokenization 16% Threat Strategy 16% Vulnerability Signature 16% Privacy-Preserving Technique 16% An Algebraic Approach to Simulation and Verification for Cyber-Physical Systems with Shared-Variable ConcurrencyLi, R., Zhu, H. & Banach, R., 22 Apr 2024, (Accepted/In press) In: Journal of Logical and Algebraic Methods in Programming.Research output: Contribution to journal › Article › peer-review Open AccessFile Cyber Physical Systems 100% Concurrency 100% Parallel Program 20% Continuous Behavior 20% modeling language 20% 10 Downloads (Pure) Autonomous System Safety Properties with Multi-Machine Hybrid Event-BBanach, R., 26 Sept 2024, (Accepted/In press) Sixth International Workshop on Formal Methods for Autonomous Systems. (International Workshop on Formal Methods for Autonomous Systems).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile System Safety 100% Autonomous System 100% Transponder 100% Specifies 50% Drone 50% Core Hybrid Event-B III: Fundamentals of a Reasoning FrameworkBanach, R., 1 Jan 2024, In: Science of Computer Programming. 213, 103002.Research output: Contribution to journal › Article › peer-review Open Access Continuous Function 100% Singularities 50% Cyber-Physical Systems 50% Illustrates 50% Function of Time 50% The ‘Causality’ Quagmire for Formalised Bond GraphsBanach, R. & Baugh, J., 24 Apr 2024, (Accepted/In press) ICGT 2024.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Applicability 100% Power Flow 100% Simplest Case 100% Mechatronic System 100% Counterexample 100% 3 Downloads (Pure) View all 128 research outputs Projects 1 Not started 1 Active Projects per year Centre for Digital Trust and SocietyBarrett, E. (PI), Allmendinger, R. (Researcher), Elliot, M. (Researcher), Lord, N. (Researcher), Cordeiro, L. (Researcher), Gibson, R. (Researcher), Papamarkou, T. (Researcher), Dresner, D. (Researcher), Aldridge, J. (Researcher), Duncan, P. (Researcher), Banach, R. (Researcher), Brown, G. (Researcher), Dennis, L. (Researcher), Fisher, M. (Researcher), Korovin, K. (Researcher), Kotselidis, C.-E. (Researcher), Luján, M. (Researcher), Mustafa, M. (Researcher), Olivier, P. (Researcher), Reger, G. (Researcher), Zhang, N. (Researcher), Hodgkinson, G. (Researcher), Gulati, S. (Researcher), Ainsworth, J. (Researcher), Chen, Y.-W. (Researcher), Green, B. (Researcher), Healey, M. (Researcher), Uyarra, E. (Researcher), Zachariadis, M. (Researcher), Little, C. (Researcher), Mackey, E. (Researcher), Nenadic, G. (Researcher), Keane, J. (Researcher), Shlomo, N. (Researcher), Graff, N. (Researcher), Jarwar, M. A. (Researcher), Shariati Samani, S. (Researcher), Smith, D. (Researcher), Kambites, M. (Researcher), Thorpe, M. (Researcher), Rowley, P. (Researcher), Flynn, S. (Researcher), Turner, P. (Researcher), Wainwright, V. (Researcher), Czerwinsky, A. (PGR student), Nini, A. (Researcher), Broad, R. (Researcher), Shute, J. (Researcher), Deakin, J. (Researcher), Taboada, P. (PGR student), Knight, P. (Researcher), Hutchings, S. (Researcher), Whyte, J. (Researcher), Tolz-Zilitinkevic, V. (Researcher), Pilkington, H. (Researcher), Guharoy, S. (Researcher), Nicolo, A. (Researcher), Reggiani, C. (Researcher), Garcia Oliva, J. (Researcher), Van Someren, A. (Researcher), Bon, E. (Researcher), Cantijoch Cunill, M. (Researcher), Koch, D. (Researcher) & Chen, Y.-W. (Researcher)11/05/21 → …Project: Other Social Statistics 100% Computer Science 100% Interdisciplinary Research 100% Social Research 100% Business School 100% RAI: Centre for Robotics and Artificial IntelligenceCangelosi, A. (PI), Lennox, B. (PI), Weightman, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Fisher, M. (CoI), Herrmann, G. (CoI), Dickson, A. (CoI), Lanzon, A. (CoI), Stancu, A. (CoI), Miller, A. (CoI), Freitas, A. (CoI), Nini, A. (CoI), Voronkov, A. (CoI), Brass, A. (CoI), Vijayaraghavan, A. (CoI), Parslew, B. (CoI), crowther, W. (CoI), Grieve, B. (CoI), Adorno, B. (CoI), Jay, C. (CoI), Wang, C. C. L. (CoI), Todd, C. (CoI), Soutis, C. (CoI), Arsene, C. (CoI), Dresner, D. (CoI), Barrett, E. (CoI), Gowen, E. (CoI), Arvin, F. (CoI), Podd, F. (CoI), Brown, G. (CoI), Reger, G. (CoI), Cooper, G. (CoI), Mairs, H. (CoI), Yin, H. (CoI), Kinloch, I. (CoI), Eleftheriou, I. (CoI), Li, J. (CoI), Carrasco Gomez, J. (CoI), Ainsworth, J. (CoI), Sinha, J. (CoI), Ozanyan, K. (CoI), Smith, K. (CoI), Twomey, K. (CoI), Margetts, L. (CoI), Ren, L. (CoI), Zhang, L. (CoI), Cordeiro, L. (CoI), Rattray, M. (PI), Bissett, M. (CoI), Elliot, M. (CoI), Alvarez, M. (CoI), Luján, M. (CoI), Nabawy BSc, MSc, PhD, MRAeS, SMAIAA, FHEA, M. (CoI), Peek, N. (CoI), Marjanovic, O. (CoI), Dorn, O. (CoI), Dudek, P. (CoI), Green, P. (CoI), Connolly, P. (CoI), Da Silva Bartolo, P. J. (CoI), Gardner, P. (CoI), Martin, P. (CoI), Potluri, P. (CoI), Curtis, R. (CoI), Schmidt, R. (CoI), Banach, R. (CoI), Batista-Navarro, R. T. (CoI), Kaski, S. (CoI), Midson, S. (CoI), Watson, S. (CoI), Holm, S. (CoI), Furber, S. (CoI), Schlegel, V. (CoI), Mirihanage, W. (CoI), Mansell, W. (CoI), Pan, W. (CoI), Sampson, B. (CoI), Sellers, W. (CoI), Yang, W. (CoI), Cai, P. (CoI), Sun, Y. (CoI), Alharthi, A. (Researcher), Macario Rojas, A. (Researcher), Serhan, B. (Researcher), Yu, C. (Researcher), Abara, D. (Researcher), Lopez Pulgarin, E. (Researcher), Faruq, F. (Researcher), Tavella, F. (Researcher), Semeraro, F. (Researcher), Liu, G. (Researcher), Fang, G. (Researcher), Niu, H. (Researcher), Taylor, H. (PI), Zhu, H. (PGR student), Collenette, J. (Researcher), Amano, K. (Researcher), Lo, K. C. J. (PGR student), Raggioli, L. (Researcher), Romeo, M. (Researcher), Ruocco, M. (PGR student), Ghaffari Saadat, M. (Researcher), Walmsley, M. (Researcher), Mubarik, A. (Researcher), Vinanzi, S. (Researcher), Su, Y.-H. (PGR student), McAleese, H. (PGR student), Stringer, P. (PGR student), Stoican, R. (PGR student), Ye, R. (PGR student), Kurawa, S. S. (PGR student), Zhang, T. (PGR student), Krywonos, W. (PGR student), Xu, Y. (PGR student), Tian, Y. (PGR student), Henderson, A. (Technical team), Morley, D. (Support team), Tallentire, J. (Support team), Smith, J. (Support team), Hawthornthwaite, S. (Support team), Carlson, J. (Support team) & Baniqued, P. D. (Researcher)Project: Research Robot 100% Human Robot Interaction 22% Digital Twin 20% Cognitive Architecture 17% Autonomous System 17% Prizes Invited two-month research visit to School of Software Engineering, Shanghai Key Laboratory of Trustworthy Computing, East China Normal UniversityBanach, R. (Recipient), 2016Prize: Other distinction",
  "content_length": 8804,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:41"
}