{
  "name": "Richard Jensen",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/rkj",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityDr Richard Jensen BSc (Lancaster), MSc (Edinburgh), PhD (Edinburgh) Lecturer Department of Computer Science Contact Details Email: rkj@aber.ac.uk ORCID: 0000-0002-1016-1524 Office: C44, Llandinam Building Phone: +44 (0) 1970 628510 Personal Website: http://users.aber.ac.uk/rkj/site/ Google Scholar: https://scholar.google.co.uk/citations?user=_nYdqsoAAAAJ Research Portal Profile Teaching Module Coordinator CS26520 - Artificial Intelligence CS00710 - License to Use Mathematics Moderator CSM6120 - Fundamentals of Intelligent Systems CS36220 - Machine Learning CS36110 - Fundamentals of Machine Learning Lecturer CS39440 - Major Project CS26520 - Artificial Intelligence CS00710 - License to Use Mathematics Tutor CS26520 - Artificial Intelligence CS12020 - Introduction to Programming Coordinator CS26520 - Artificial Intelligence CS00710 - License to Use Mathematics Research Groups Advanced Reasoning Group Publications Zhang, Q, Henry, C, Jensen, R, Gao, X, Wang, G, Yao, JT, Cornelis, C & Xia, S 2025, 'Preface', Lecture Notes in Computer Science, vol. 15708 LNAI, pp. v-vi.Zhang, Q, Jensen, R, Wang, G, Cornelis, C, Henry, C, Gao, X, Yao, J & Xia, S 2025, 'Preface', Lecture Notes in Computer Science, vol. 15709 LNAI, pp. v-vi.Zhang, Q, Henry, C, Jensen, R, Gao, X, Wang, G, Yao, J, Cornelis, C & Xia, S 2025, 'Preface', Lecture Notes in Computer Science, vol. 15710 LNAI, pp. v-vi.Zhang, Q, Henry, C, Jensen, R, Gao, X, Wang, G, Yao, J, Cornelis, C & Xia, S (eds) 2025, Rough Sets: International Joint Conference, IJCRS 2025, Chongqing, China, May 11–13, 2025. Lecture Notes in Computer Science, Springer Nature. 10.1007/978-3-031-92747-8Moayedikia, A, Jensen, R & Samimi, A 2025, 'Trust-Enhanced POI Recommendation Algorithm Using Expectation-Maximization', Social Network Analysis and Mining.More publications on the Research Portal",
  "content_length": 1919,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:52"
}