{
  "name": "Richard Peng",
  "homepage": "https://www.cs.cmu.edu/~yangp",
  "status": "success",
  "content": "Yang (Richard) Peng Associate Professor, School of Computer Science, Carnegie Mellon University Page for Intercollegiate Programming Contests Contact: yangp@cs.cmu.edu. NOTE: due to load constraints, I can only start new research projects with students with IMO scores at least 30, or IOI rank top 9, or consistently reproducible performances on equivalents of the 2018-2025 versions of these tests. This is entirely due to limits of my bandwidth and resources, and is only specific to my group. My research is broadly in the design and analysis of fast algorithms for solving fundamental computational problems, including graph algorithms, dynamic algorithms, and linear algebraic algorithms. My representative results include linear systems solvers, max-flow/min-cut algorithms, and time/space efficient data structures for matchings, resistances, and matrices. I teach courses on algorithms and data structures, and supervise research projects at all levels. I am also actively involved with outreach activities in the programming contest community, with focus at the high-school level. I am the point of contact for organizing the CMU teams attending the International Collegiate Programming Contest and related activities such as Unniversal Cup. Page with schedules/details. I was an assistant, then associate, professor at Georgia Tech from 2015 to 2021, and was an associate professor at the University of Waterloo from 2021 to 2023. Prior to that, I received my BMath from Waterloo, PhD from CMU, and was a postdoc at MIT. I am recipient of the NSF Career Award, the 2011 Microsoft Research PhD Fellowship, the 2013 CMU SCS Distinguished Dissertation Award, the 2021 SODA Best Paper Award, and the 2022 FOCS Best Paper Award. When not thinking about problems, I enjoy biking, baseball, swimming, road trips, and flight simulators. DBLP profile Some updates Nov 2024: I compiled a Summary of Cell Phone Situation at IOI`24. August 2024: Danny Sleator has transferred the ICPC portion of Competition Programming and Problem Solving to me. August 2023: The latest iteration of my obsession with cows and trees has taken me to Carnegie Mellon University. I am grateful to the University of Waterloo for providing me with an academic home over the past few years of uncertainties, as well as over the past twenty years through CEMC and its extensions. PhD Students Current Junzhao Yang, Ph.D. Fall 2024 - present @ CMU. Alicia Stepin, Ph.D. Fall 2024 - present @ CMU. Former Jingbang Chen, M.S. Fall 2020 - Fall 2022 @ Georgia Tech, Ph.D. Winter 2023 - Spring 2025 @ Waterloo, now at CUHK-Shenzhen. Li Chen, Ph.D. Fall 2019 - Summer 2023 @ Georgia Tech, now at LMArena. Yu Gao, Ph.D. Fall 2017 - Spring 2022 @ Georgia Tech, now at Huawei. Saurabh Sawlani, Ph.D. Fall 2016 - Spring 2020 @ Georgia Tech, now at Amira. David Durfee, Ph.D. Fall 2015 - Fall 2018 @ Georgia Tech, now at Anonym. Peng Zhang, PhD Fall 2015 - Summer 2018 @ Georgia Tech, now at Rutgers Univeristy.",
  "content_length": 2974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:58"
}