{
  "name": "Richard E. Jones",
  "homepage": "https://www.cs.kent.ac.uk/~rej",
  "status": "success",
  "content": "Computer Science: Home page for RE Jones - School of Computing - University of Kent University of Kent - The UK's European University University of Kent - Home Contact Maps Departments Gold award for Kent in Teaching Excellence Framework TEF About Planning and strategyStrategy: Kent 2025 UK's European university Annual review and reports How we operateCommitteesGovernanceConstitution Regulations Charity information Modern Slavery Act Transparency Statement People Vice-Chancellor Executive Group Principal officers Honorary graduates DepartmentsSchools and faculties Professional services External services Complete A-Z More about KentCareer Opportunities Essential Kent Eastern ARC Regional impact Community relations Events and what's onFull calendar Undergraduate term dates Gulbenkian Research Excellence at KentLatest research news REF 2021 Research impact Expertise Publications Public engagement Departments/peopleFind a Kent expert Schools and faculties Research Services Innovation & Enterprise Graduate School Academic/research jobs Research degreesSearch courses Research degrees How to apply Postgraduate funding Graduate school Courses Undergraduate coursesSearch coursesHow to applyFees and fundingUndergraduate courses 2023Search coursesHow to applyFees and fundingStudy abroadGo abroad Postgraduate coursesSearch courses How to apply Research degrees Taught courses Fees and funding Part-time and short coursesOnline prospectus Summer schools InternationalFoundation (IFP)Pre-sessional English Short-term programmes Visit KentOpen Days Applicant Days Informal visits Kent around the world Useful linksAccommodation Fees and funding Scholarships Locations Information for...International students Parents and family Applicants New students Locations UK locationsCanterbury MedwayTonbridge Validated institutions European centresBrussels Paris Other locationsExchanges with over 100 overseas universities International Courses Study and work abroad Double-degrees Short-term study options 'International' courses Erasmus exchanges International studentsStudy at Kent Application process When you arrive International PartnershipsWorldwide partnerships International exchanges Alumni groups/networks ContactsInternational Recruitment International Partnerships English & world languages Strategy & reputationInternational impact World-leading research UK's European university MapsInternational impact International Research Impact Campus locations Business International expertiseBusiness services Collaborative projectsConsultancyFacilitiesEmployability points CoursesUndergraduate Postgraduate Part-time (undergraduate) Executive education ContactsCareers & Employability Service Innovation & Enterprise Kent Business School Conferences and functions Sports centre and facilities News News CentreLatest storiesExpert commentPress officeSocial mediaRSS feeds Students and staffStudent newsStaff newsCampus transport newsIT service alertsSubmit a story Alumni Lasting connections...Alumni and friends News Events Community Alumni groups Former staff Useful linksTelephone Campaign Congregations Honorary graduates Discount on fees Alumni scholarships Online giftshop Giving Major projectsKent Law Campaign Kent Opportunity Fund Hong Kong & China Portal Ways to giveTelephone Campaign Online By post or phone Other options.. School of Computing School of Computing homeUndergraduate degreesMaster's degreesPhD and research degreesResearchPlacementsKent IT ConsultancyMakerspaceWorking with usAbout usNewsPeopleContact us For current students & staffInformation for studentsSystems supportInformation for staff Search School of Computing Search: University of KentSchool of Computing Skip to content Publications GC bibliography GC page GC books Programming Languages and Systems Group Richard Jones FBCS FRSA Emeritus Professor of Computer Systems Email: : 0000-0002-8159-0297 Fellow, BCS Fellow, RSA Distinguished Scientist, ACM Member, AITO Honorary Fellow, University of Glasgow I am Emeritus Professor of Computer Systems in the School of Computing at the University of Kent. I was made a Distinguished Scientist of the ACM in 2006, and an Honorary Fellow of the University of Glasgow in July 2005. I received IBM Faculty Awards in 2003, 2004 and 2005. I was elected to AITO, Association Internationale pour les Technologies Objets, in 2014. I am a member of the Programming Languages and Systems Research Group. Outside work, I'm a keen sailor and cyclist. I race a Dart 18 catamaran at Whitstable. Check out this fantastic video of the AC45s racing in Plymouth - crazy stuff. Research Interests My chief area of interest is dynamic memory management - this grew out of work on lazy functional programming languages and particularly their efficient implementation. The Second Edition of my book The Garbage Collection Handbook: the art of automatic memory management, Richard Jones, Antony Hosking and Eliot Moss, Chapman and Hall, 2012 was released in July 2023. The book considerably extends my earlier Garbage Collection book, in particular with complete and up-to-date coverage of parallel, concurrent, and real-time garbage collection algorithms, and explanations of some of the tricky aspects of garbage collection, including the interface to the run-time system. The Second Edition explores the latest collectors, and includes new material on finalisation, weak references, dynamic languages and GC on the GPU, and new chapters on energy efficiency and GC for persistent systems. The Handbook is also available as an e-book, with over 37,000 hyperlinks to sections, figures, algorithms, references, glossary entries and indexed items! Garbage Collection for Multicore Systems The EPSRC-funded MirrorGC project (September 2010 - February 2014) investigates fully concurrent garbage collection for multicore processors. Tomas Kalibera, who has a wealth of experience in automatic memory management for real-time and embedded systems, virtual machines for these systems in general, and verification of applications for these systems, Carl Ritson, who brings experience of concurrency, and in particular scheduling, Tomoharu Ugawa (Kochi University of Technology), Laurence Hellyer and Matthew Mole contributed hugely to this project. Transactional Sapphire: Lessons in High Performance, On-the-fly Garbage Collection. Tomoharu Ugawa, Carl G. Ritson and Richard Jones. In ACM Transactions on Programming Languages and Systems 40(4), December 2018. Constructing a high-performance garbage collector is hard. Constructing a fully concurrent 'on-the-fly', compacting collector is much more so. We describe our experience of implementing the Sapphire algorithm as the first on-the-fly, parallel, replication copying, garbage collector for the Jikes RVM Java virtual machine. In part, we explain our innovations such as copying with hardware and software transactions, on-the-fly management of Java's reference types and simple, yet correct, lock-free management of volatile fields in a replicating collector. We fully evaluate, for the first time, and using realistic benchmarks, Sapphire's performance and suitability as a low latency collector. An important contribution of this work is a detailed description of our experience of building an on-the-fly copying collector for a complete JVM with some assurance that it is correct. A key aspect of this is model checking of critical components of this complicated and highly concurrent system. Model Checking Transactional Sapphire. Tomoharu Ugawa and Richard Jones. University of Kent Technical report, May 2018. Building high performance, fully concurrent garbage collectors with confidence. Richard Jones. In Virtual Machines Summer School 2016, Cumberland Lodge, UK. [slides ppt] [slides pdf] [video] Exploring Garbage Collection with Haswell Hardware Transactional Memory. Carl G. Ritson, Tomoharu Ugawa and Richard Jones. In International Symposium on Memory Management (ISMM). ACM 2014. [slides] Reference Object Processing in On-The-Fly Garbage Collection. Tomoharu Ugawa, Richard Jones and Carl G. Ritson. In International Symposium on Memory Management (ISMM). ACM 2014. [slides] Rigorous Benchmarking in Reasonable Time. Tomas Kalibera and Richard Jones. In International Symposium on Memory Management (ISMM). ACM 2013. A Black-box Approach to Understanding Concurrency in DaCapo. Tomas Kalibera, Matthew Mole, Richard Jones and Jan Vitek. In Object Oriented Programmig, Systems, Languages and Applications (OOPSLA). ACM 2012. Handles Revisited: Optimising Performance and Memory Costs in a Real-time Collector. Tomas Kalibera, Richard Jones. In International Symposium on Memory Management (ISMM). ACM 2011. The Locality of Concurrent Write Barriers Laurence Hellyer, Richard Jones, Antony L. Hosking. In International Symposium on Memory Management (ISMM). ACM 2010 Improving Experimental Evaluation Progress in computer systems research is driven by experimental evaluation. Our community can only make advances when new systems can be shown to improve over earlier ones. Unfortunately, as our paper ISMM'13 shows, computer science lags far behind other disciplines. Fortunately, it also shows that we can perform rigorous experiments within a reasonable budget of experimentation time. Rigorous Benchmarking in Reasonable Time. Tomas Kalibera and Richard Jones. In ISMM'13, International Symposium on Memory Management. ACM 2013 (Note: this version corrects the ISMM version). See also Virtual Machine Warmup Blows Hot and Cold, Barrett et al, OOPSLA 2017, which confirms and extends these findings. Quantifying Performance Changes with Effect Size Confidence Intervals. Tomas Kalibera and Richard Jones. Technical report, University of Kent. We encourage researchers to help us improve the standard of experimental evaluation. Read The Truth, the Whole Truth, and Nothing but the Truth: A Pragmatic Guide to Assessing Empirical Evaluations. Stephen M Blackburn, Amer Diwan, Mattias Hauswirth, Peter F Sweeney, J",
  "content_length": 18988,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:45"
}