{
  "name": "Richard Mann",
  "homepage": "https://cs.uwaterloo.ca/~mannr",
  "status": "success",
  "content": "Richard Mann Associate Professor Department of Computer Science University of Waterloo mannr@uwaterloo.ca DC2510 (Davis Center) Voice: (519) 888-4567 x33006 Fax: (519) 885-1208 Driving directions to Waterloo Campus map Announcement: I will be offering CS498/689 (Advanced Topics in CS, Computer Audio) in Winter 2025. This is a project-based course. Choose your own topic. Work individually or in groups. Grade will be 50% homework, 50% project. *** Note, Winter 2025 will be my final offering of this course at University of Waterloo. Past Teaching CS489/698 - Computational Sound (W24) CS489/698 - Computational Sound (sixth offering, W21) CS489/698 - Computational Sound (fifth offering, W20) CS489/698 - Computational Sound (fourth offering, W19) CS489/698 - Computational Sound (third offering, W18). CS489/698 - Computational Sound (second offering, W17). CS489/698 - Computational Sound (first offering, W16). CS484/684 - Computational Vision (F11, W13) CS886 - Perception as Bayesian Inference (W10) CS787 - Computational Vision (W03, F04, W07) CS486/686 - Introduction to Artificial Intelligence (S02) CS498Q/698Q - Computational Vision (W00, W01, W06) CS251 - Digital Design and Architecture (W01, W02, W04, W05, F05, F06, F10, W11, F12) CS134 - Principles of Computer Science (S00) Graduate Students Daniel Recoskie PhD 2018. “Learning Sparse Orthogonal Wavelet Filters” Michael Cormier PhD 2018. Co-supervised with Robin Cohen. “Computer Vision on Web Pages: A Study of Man-Made Images”. (Second-PlaceWinner of 2019 Inaugural Cheriton Dissertation Award; Winner of 2018 Murray Martin Prize (Award for Best Research Paper by a Graduate Student in Faculty of Mathematics at UW)) Heming Wang MMath (Applied Math) 2018. Co-supervised with Edward Vrscay (Applied Math). “A Novel Diffusion-based Empirical Mode Decomposition Algorithm for Signal and Image Analysis” Daniel Recoskie MMath 2014. “Constrained Nonnegative Matrix Factorization with Applications to Music Transcription” Michael Cormier MMath 2013. Co-supervised with Daniel Lizotte. Adam Fourney MMath 2009. Nicholas Miller MMath 2008. Alan Caine MMath 2005. David Tausky MMath 2004. Alan Angold MMath 2003. Blake Grant MMath 2002. Talks/ Presentations/ Videos/ Tutorials Raspberry Pi videos Acoustic measurement, Raspberry Pi 4, 64 bit ARM. First demonstrated as guest lecturer in CS251/F22 October 6 2022. http://www.cs.uwaterloo.ca/~mannr/2022-10-12-RaspberryPi_AcousticMeasurement.mp4 Connecting camera to Raspberry Pi 4 http://www.cs.uwaterloo.ca/~mannr/2022-12-02-RaspberryPiCamera.mp4 External USB drive for Raspberry Pi 400 http://www.cs.uwaterloo.ca/~mannr/2022-12-31-RaspberryPiExternalDrive.mp4 CS251 course Introduction. Reading kernel messages booting Raspberry Pi. http://www.cs.uwaterloo.ca/~mannr/2023-01-02-CourseIntro_part1.mp4 Undergraduate Talks CS Undergraduate Club Talk Date: Monday Nov 5, 2018, 5:30pm. Location: MC4063. POSTPONED. I have included the Abstract and Slides below for interested students. Abstract (text), Slides (PDF). CS Undergraduate Club Talk Title: From Microphones to Speakers and Everything In Between Date: Tuesday July 17, 2018, 6pm Location: MC4041 Slides: (PDF) Research Computational vision (high-level vision, motion understanding, event recognition) Computational hearing (acoustics, speech, music, signal processing) Perception and Learning Artificial Intelligence Computer Audio: Electrical and Acoustic Measurement Industrial Wind Turbine Noise (audible and infra sound) Publications IARO (International Acoustics Research Organization) Open Source Software for Electrical and Acoustic measurement Joint work with John Vanderkooy (Physics), Audio Research Group. John Vanderkooy and Richard Mann,  An Open-Source Electroacoustic Measurement System Part 1: Theory, Practicalities & Acoustic Examples. Linear Audio, Volume 13, 1 April 2017.  LinearAudio.net. Paper (PDF) M-files & readme for part1 Richard Mann and John Vanderkooy,  An Open-Source Electroacoustic Measurement System Part 2: Sound Card Setup, System Characterization and a few more Examples.  Linear Audio, Volume 13, 1 April 2017. LinearAudio,net. Paper (PDF)   M-files & readme for part 2. Service, External Industrial Wind Turbines Research, investigation, commentary, correspondence and advocacy on Industrial Wind Turbines. Pandemic Investigation and commentary on Pandemic. University Correspondence. Selected correspondence with the University.",
  "content_length": 4438,
  "method": "requests",
  "crawl_time": "2025-12-01 14:17:55"
}