{
  "name": "Rico Möckel",
  "homepage": "https://www.maastrichtuniversity.nl/rico.mockel",
  "status": "success",
  "content": "Dr Rico Möckel (R.) - Dr Rico Möckel (R.) - Maastricht University Skip to main content Dr Rico Möckel (R.) Research Dr Rico Möckel (R.) Rico Möckel is Associate Professor of Robotics and Intelligent Systems at Maastricht University in the Department of Advanced Computing Sciences. He also serves Maastricht University as Director of the Robotics Laboratories in Maastricht and Venlo. Dr. Möckel obtained his PhD in 2012 from ETH Zurich, Switzerland, and was at Postdoc at EPFL, Switzerlands, and Darmstadt University of Technology, Germany.His research focusses on robotics and artificial intelligence with high societal relevance with innovations in three main areas: (1) increasing the autonomy of robotic systems, (2) strengthening the abilities of robots to cooperate better in teams of human and robots, (3) distributed artificial intelligence and swarm intelligence. Together with colleagues he applies this research to create smart solutions for manufacturing and construction industries, agrifood, healthcare, education, and logistics.Dr. Möckel is currently involved in the ITEA ADVISOR project that enables Cooperative Missions of Autonomous Vehicle Swarms for Surveillance Tasks and will generate new robotic solutions for autonomous monitoring of off-shore windparks.He is also a main PI in the EDMO initiative that generates robotic and AI solutions to support children and teachers.Rico Möckel was the coordinator and a PI of the H2020 IA CoRoSect aiming at securing sustainable food sources and generating innovation through Cognitive Robotic System for Digitalized and Networked (Automated) Insect Farms.Rico Möckel was an alumni member of the Maastricht Young Academy (https://www.maastrichtuniversity.nl/research/maastricht-young-academy).Until 2021 Rico Möckel formed and was the coordinator of the MaRBLe 2.0 Honours Programme of the Department of Advanced Computing Sciences.From December 2020 until October 2023 Rico Möckel served as Director of Research of the Department of Advanced Computing Sciences.Together with colleagues, Rico Möckel won the 2018 UM Data Science Research Competition, the 2017 UM IMPACT COURSE competition, a best poster award at the 2017 Real-Time Functional Imaging and Neurofeedback Conference (rtFIN), a best paper award at the 2017 IEEE Congress on Evolutionary Computation, a best paper award at the 2014 IEEE International Symposium on Robot and Human Interactive Communication, Presentation First Place and Gold Medal at the 2007 International Competition on Genetically Engineered Machines (iGEM), the Industrial Robot Highly Recommended Award at the 2005 International Conference on Climbing and Walking Robots, and the Best engineer student award from The Association of German Engineers (VDI Mecklenburg-Vorpommern) in 2002. Dr Rico Möckel (R.) Associate Professor of Robotics and Intelligent SystemsDirector of Laboratories of the Department of Advanced Computing Sciences Artificial Intelligence Dept. of Advanced Computing Sciences Faculty of Science and Engineering ORCID Paul Henri Spaaklaan 1 6229 EN Maastricht C4.032 rico.mockel@maastrichtuniversity.nl Linkedin External Blog",
  "content_length": 3143,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:06"
}