{
  "name": "Rida Laraki",
  "homepage": "https://sites.google.com/site/ridalaraki",
  "status": "success",
  "content": "Rida LarakiSearch this siteEmbedded FilesSkip to main contentSkip to navigationBiography and PublicationsCurriculum Vitae*****************************************************************Je suis professeur à l'Université Mohammed VI Polytechnique (UM6P). J'ai été directeur de chercheur au  Centre National de la Recherche Scientifique (CNRS), de 2001 à 2013 affecté au laboratoire d'Econométrie de l’École Polytechnique puis au LAMSADE (Université Paris Dauphine) jusqu'à mon détachement du CNRS en 2024. De 2006 à 2017, j'ai été professeur chargé de cours à l’École Polytechnique (où j'ai enseigné aux départements d'Economie et de mathématiques appliquées: CMAP). De 2017 à 2023  j'ai été professeur à  l'université de Liverpool (au département d'informatique).  À partir de 2024, j'ai rejoint l'UM6P pour fonder un laboratoire de recherche interdisciplinaire en mathématiques, informatique et économie: le centre marocain de théorie des jeux.Je suis ingénieur diplômé de l’Ecole Polytechnique (promotion X93) et docteur en mathématiques appliquées de l’université Pierre et Marie Curie (doctorat en obtenue 2000, Habilitation à Diriger des Recherches HDR obtenue en 2011). Mes travaux de recherche portent sur la théorie des jeux, le choix social, l’économie théorique, l'optimisation, l'apprentissage, et les mathématiques de la recherche opérationnelle. Je suis connu pour mon travail sur le jugement majoritaire, un mode de scrutin que j'ai inventé avec Michel Balinski. Cela a fait l’objet d’un livre publié chez MIT Press en 2011. J'ai organisé le séminaire hebdomadaire en théorie des jeux à l’Institut Henri Poincaré de 2001 à 2018, et j'ai organisé de nombreux colloques et conférences internationales. Je suis éditeur associé dans plusieurs revues scientifiques, j'ai été responsable du programme doctoral d’informatique à l’université Paris Dauphine de 2015 à 2021, et responsable du groupe Mathématique de la Modélisation et de la Décision de la la Société de Mathématiques Appliquées et Industrielles (SMAI-MODE) de 2016 à 2019. Durant mon mandat à SMAI-MODE, j'ai eu l'honneur de créer le prix Jean Jacques Moreau en Optimisation conjoitement avec l'Académie des Sciences, la SMAI et la SMF. Je suis membre élu du conseil de la Game Theory Society et du conseil d'administration de la SMAL.  Enfin, j'ai co-fondé en 2018 avec Chloé Ridel l'association \"mieux voter\".*****************************************************************I am full professor at the Université Mohammed VI Polytechnique (UM6P). I was director of research at the National Center for Scientific Research (CNRS), at the Ecole Polytechnique (2001-2013) then at University of Paris Dauphine (from 2013 to 2024). From 2006 to 2017, I was professor at the École Polytechnique and from 2017 to 2023 professor at the University of Liverpool. Starting from 2024, I am detached from the CNRS and joined UM6P to establish an interdisciplinary research laboratory in mathematics, computer science, and economics: the Moroccan Centrer for Game Theory.I graduated from the Ecole Polytechnique (promotion X93) and did a PhD in Mathematics at the University Pierre et Marie Curie (in 2000, Habilitation to Direct Research in 2011). My research is in game theory, social choice, economic theory, optimization, learning, and the mathematics of operations research. I am known for my voting system majority judgment invented with Michel Balinski. We published a book on the subject at the MIT Press in 2011. I also organised a weekly seminar on game theory at the Institut Henri Poincaré from 2001 to 2018, and organised several international conferences and workshops. I am associate editor in several international journals, I was responsible of the doctoral program in computer science at the University of Paris Dauphine from 2015 to 2021, and of the french scientific society on the mathematics of optimisation and decision: SMAI-MODE from 2016 to 2019  During my tenure at SMAI-MODE, I had the honor of creating the Jean-Jacques Moreau Prize in Optimization, in collaboration with the Academy of Sciences, SMAI, and SMF.  I am elected member of the council of the Game Theory Society and of the council of the SMAI. Finally, in 2018 I co-founded with Chloé Ridel to non-profit association \"mieux voter\".*****************************************************************Google Scholar ****************************************************Books (as author)1 Laraki R.,  J. Renault and S. Sorin (2019) Mathematical Foundations of Game Theory. Springer. Translated to Polish in 2023.2 Balinski M. and R. Laraki (2011) «Majority Judgment: Measuring Ranking and Electing». MIT Press.3 Laraki R.,  J. Renault and S. Sorin (2013) «Bases Mathématiques de la Théorie des Jeux». Editions de l'Ecole Polytechnique.4 Laraki R.,  J. Renault and T. Tomala (2006) «Théorie des Jeux: Introduction à la Théorie des Jeux Répétés». Journées Mathématiques XUPS. Editions de l'Ecole Polytechnique.5 Laraki R. and S. Zamir (2004) «Théorie des Jeux». Polycopié de Cours de l'Ecole Polytechnique.Books (as co-editor)6 One Hundred Years of Game Theory (2025). Cambrige University Press, to Appear. Editors:  M. Voorneveld, J. Weibull, T. Andersson, R. Myerson, J.-F. Laslier, R. Laraki & Y. KoriyamaScientific articles (published or accepted)1 Laraki R. (2001) «Variational inequalities, system of functional equations and incomplete information repeated games». SIAM Journal on Control and Optimization, vol. 40, 516-524.2 Laraki R. (2001) «The splitting game and applications». International Journal of Game Theory, vol. 30, 359-376.3 Laraki R. (2002) «Repeated games with lack of information on one side : the dual differential approach». Mathematics of Operations Research, vol. 27, 419-440.4 Laraki R. (2004) «On the regularity of the convexification operator on a compact set». Journal of Convex Analysis, vol 11, 209-234.5 Laraki R., W. D. Sudderth (2004) «The preservation of continuity and Lipschitz continuity by optimal rewards operators». Mathematics of Operations Research, vol 29, 672-685.6 Laraki R., E. Solan, N. Vieille (2005) «Continuous-time games of timing». Journal of Economic Theory, vol 120, 206-238.7 Laraki R., E. Solan (2005) «Stopping games in continuous time». SIAM Journal on Control and Optimization, vol 43, 1913-1922.8 Balinski M., R. Laraki (2007) «A theory of measuring, electing and ranking». Proceedings of the National Academy of Sciences USA, vol. 104, no. 21, 8720-8725.9 Laraki R., J.-B. Lasserre (2008) «Computing uniform convex approximations for convex envelopes and convex hull». Journal of Convex Analysis, special issue in the memory of Thomas Lachand-Robert, vol. 3, 635—654.10 Balinski M., A. Jennings, R. Laraki (2009) «Monotone Incompatibility Betwenn Electing and Ranking». Economics Letters, vol. 105, 145-147.11 Gossner O., R. Laraki, T. Tomala (2009) «Infomationally Optimal Correlation». Mathematical Programming B, Special Issue in Honnor of Alfred Auslender, vol 116, 147-172.12 Balinski M., R. Laraki, S. Sorin (2009) «David Gale In Paris». Games and Economic Behavior, vol. 66, pages 594-597.13 Laraki R. (2010) «Explicit Formulas for Repeated Games with Absorbing States». International Journal of Game Theory, Special Issue in the memory of Michael Maschler, vol. 39, 53-70.14 Balinski M., R. Laraki (2010) «Election by Majority Judgement: Experimental Evidence». Chapter in the book: In Situ and Laboratory Experiments on Electoral Law Reform: French Presidential Elections. Springer.15 Laraki R., J.-B. Lasserre (2012) «Semidefinite Programming for min-max problems and Games». Mathematical Programming A, vol 131, 305-332.16 Cardaliaguet P., R. Laraki, S. Sorin (2012). «A Continuous Time Approach for the Asymptotic Value in Two-Person Zero-Sum Repeated Games». SIAM Journal on Control and Optimization, vol 50, 1573–1596.17 Laraki R., E. Solan (2013) «Equilibrium in Two-Player Non-Zero-Sum Dynkin Games in Continuous Time». Stochastics, vol 85, 997-1014.18 Laraki R., A. Maitra, W. D. Sudderth  (2013). «Two-person zero-sum stochastic games with semicontinuous payoff». Dynamic Games and Applications, special issue Shapley, vol 3, 162-171.19 Balinski M., R. Laraki (2013). «Jugement Majoritaire vs Vote Majoritaire (via les Présidentielles de 2011-2012)». Revue Française d’Economie. N°4, volume XXVII, 11-44.20 Laraki R., P. Mertikopoulos (2013). «Higher Order Games Dynamics». Journal of Economic Theory, vol 148, 2666-2695.21 Balinski M., R. Laraki (2013). «How Best to Rank Wines: Majority Judgement». Chapter in the book: Wine Economics: Quantitative Studies and empirical Observations, Palgrave-MacMillan.22 Balinski M. and R. Laraki (2014). «Judge: Don't vote». Operations Research, vol 28, No 3, pp 483-511.23 Balinski M., R. Laraki (2014). What Should “Majority Decision” Mean? Chapter 6 in the book: Majority Decisions, Cambridge University Press, edited by J. Elster and S. Novak, pp 103-131.24 Laraki R., S. Sorin (2014). «Advances in Zero-Sum Dynamic Games». Chapter 2 in Handbook of Game Theory IV, edited by H. P. Young and S. Zamir, pp 27-93.25 J. Hofbauer,  R. Laraki, J. Renault (2014). Preface: Special Issue in Honor of the 60th Birthday of Sylvain Sorin. Journal of Dynamics and Games. Pages : i - iv.26 Laraki R. and P. Mertikopoulos (2015). «Inertial Game Dynamics and Applications to Constrained Optimization». SIAM Journal on Control and Optimization, vol. 53, No. 5, pp. 3141–3170.27 Bich P., R. Laraki (2017). «On the Existence of Approximate Equilibria and Sharing Rule Solutions in Discontinuous Games». Theoretical Economics, vol 12, pp. 79–108.28 Laraki R.,  W. D. Sudderth (2017). «A Continuity Question of Dubins and Savage». Journal of Applied Probability, vol 54, pp. 462–473.29 Bich P., R. Laraki (2017). «Externalities in Economies with Endogenous Sharing Rules». Economic Theory Bulletin, vol 5, pp. 127–137.30 Flesch J., R. Laraki, V. Perchet (2018). «Online Learning and Blackwell Approachability in Quitting Games». Games and Economic Behavi",
  "content_length": 17486,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:05"
}