{
  "name": "Ridha Khedri",
  "homepage": "http://www.cas.mcmaster.ca/~khedri",
  "status": "success",
  "content": "Ridha Khedri, Dipl. Eng., M.Sc., Ph.D., P.Eng. | Prof. Ridha Khedri, Department of Computing and Software, Faculty of Engineering, McMaster University, Hamilton, Canada Ridha Khedri Dipl.Eng., M.Sc., Ph.D., P.Eng Professor, McMaster University Home Education Teaching SFWR ENG 3S03 SFWR ENG 3A04 CAS 703 Courses Taught Scholarly Activity Selected Publications Research Interests Current Activities Invited Speaker (2014-2015) Program committees & Workshop and conference organiser Research Research Projects in the News FRAISE Research Group Collaborators Current Students Former Students Software Tools JORY SMART II McMaster-Shanghai Group Team Research Topics FRAISE Research Group Professional Organisations Dept. Computing & Software Faculty of Engineering McMaster University Search for: © 2010-2016 Ridha Khedri. Some Rights Reserved. Dep. of Computing and SoftwareFaculty of EngineeringMcMaster University Prof. Ridha Khedri, Dipl.Eng., M.Sc., Ph.D., P.Eng IEEE Senior member Professor Department of Computing and Software, McMaster University, Hamilton, Ontario, Canada. Contact Information McMaster University, Department of Computing and Software, ITB 202 1280 Main St. West, Hamilton, Ontario Canada L8S 4L7 Phone: (905) 525.9140 Ext. 23163 Fax: 905.524.0340 office: ITB 129 Email: Short Biography Ridha Khedri is a Professor of Software Engineering at McMaster University. He served as the Chair of the department of Computing and Software from 2016 to 2019. He was Adjunct Professor in the School of Computer Engineering and Science, Shanghai University. He obtained his Engineer Diploma in 1987 from the University of Tunis. He received a M.Sc. and a Ph.D. from Laval University, Quebec, Canada, in 1993 and 1998 respectively. In March 1998, he joined the Communications Research Laboratories of McMaster as a post-doctoral researcher under the supervision of Prof. David L. Parnas. He is a licensed professional engineer in the province of Ontario. He is a member of the Association for Computing Machinery and the IEEE Computer Society. He has been co-organizer, program committee member, and referee of more than 30 international workshops and conferences. He is the general co-Chair for the conference on Reconciling Data Analytics, Automation, Privacy, and Security: A Big Data Challenge (RDAAPS 2021). He served on the editorial board of the Journal of Digital Communications and Networks (Elsevier). He served as Guest Editor on IEEE Reviews in Biomedical Engineering. His research interests include algebraic methods in software engineering, data cleaning, information security, and security-data analytics. His work on information security tackles covert channels, network segmentation, cryptographic-key distribution schemes, and dynamic cyber defense. With his students and with long term collaboration with Prof. Bernard Moeller (university of Augsburg), he developed Product Family Algebra (PFA) as a formalism to reason on Software Product Families. Then, he extended the use of PFA to reason on aspects and dynamic cyber defense. His research record includes more than 100 peer-reviewed articles. He supervised more than 30 graduate students. He currently serves on CANARIE’s Cybersecurity Technical Committee. He patented solutions for network segmentation problems that are being developed by industrial partners into commercial products. His security trained graduate students are recruited at prestigious places such as the U.S. Department of Homeland Security Cybersecurity Group at Stanford University, and others are leading cybersecurity researchers in Universities and Industry.",
  "content_length": 3617,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:07"
}