{
  "name": "Rie Yamaguchi",
  "homepage": "http://www.yamagula.ic.i.u-tokyo.ac.jp/index_e.html",
  "status": "success",
  "content": "The University of Tokyo | Rie Yamaguchi Lab. NEWS Information 2023.12.21Rie Yamaguchi, Project Associate Professor at the Social ICT Center, Associate Professor at Center for Creation of Intelligent World, will be moderating the session at the Social ICT Research Center Symposium \"ICT Opens the Future of Society.\" Also,Project Lecturer Mhd Irvan, and Project Assistant Professor Ryosuke Kobayashi will be appearing at the Symposium. Information 2023.10.10 A forum commemorating the launch of University of Tokyo Institute for Digital Observatory was held, which goal is \"Achieving a Resilient Society that Looks Ahead to 2050\". Yamaguchi Laboratory is engaged in the activities of this forum regarding \"Achieving resilience through analysis of financial, logistics, and human flow trajectory data.\" Information 2020.6.22 An article on the demonstration experiment at Mitsubishi Electric Information Systems was published. Information 2020.5.8 An interview article of Associate Professor Yamaguchi was published in Biz Compass. Information 2020.1.16 An article by Associate Professor Yamaguchi was published on the Dentsu Tech information site \"Bae\". Information 2019.10.15--10.18 We exhibited a research project of \"Lifestyle Authentication and Analysis\" at the booth of Yamaguchi laboratory of the University of Tokyo at CEATEC 2019 We had a related presentation at the mini stage. Information 2019.6.28 Mitsubishi UFJ NICOS and Mitsubishi Electric Information Systems have released news on the experiment of \"Lifestyle Authentication\". Reference article Information 2018.11.10--11.11 We exhibited at the science communication event \"Science Agora\". At the booth of the University of Tokyo,we introduced a research project of \"Lifestyle Authentication/Analysis\" with hands-on demonstration of behavior authentication. Information 2018.10.16--10.19 Yamaguchi Lab exhibited atCEATEC JAPAN 2018. We introduced the near future use scenes of \"Lifestyle Authentication/Analysis\" by video etc. Information 2018.10.10 The news about the establishment of Social Cooperation Programs was released on October 10. Information 2018.10.10 The press conference \"Establishment of a Social Cooperation Program of Lifestyle Authentication\" was held on October 10. Information 2018.10.10 Symposium on Personal Data Analysis / Distribution and Future Social System was held on October 10 at the University of Tokyo Koshiba Hall. Information 2018.6.25 Symposium on Next Generation Personal Authentication Technology was held on June 25 at the University of Tokyo Koshiba Hall. Information 2018.2.28 An article by Associate Professor Yamaguchi was published in CardWave 2018. Past Articles Our Policy You can choose any research topic in the field of information security and I would be very happy to encourage you to pursue new challenges.",
  "content_length": 2821,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:06"
}