{
  "name": "Rikke Bjerg Jensen",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/rikke-bjerg-jensen",
  "status": "success",
  "content": "Rikke Bjerg Jensen - Royal Holloway Research Portal Rikke Bjerg Jensen Professor Professor, Department of Information Security Phone+44 1784 276549EmailRikke.Jensenrhul.acuk TW20 0EX Personal profile Personal profileI am a social scientist and ethnographer researching collective (information) security practices. My work focuses on how social contexts and relations as well as interactions and structures shape (information) security needs, perspectives and practices among groups of people in often higher-risk contexts -- including activists and protesters, people living through conflict and precarious work. My research is inherently ground-up, using ethnographic methods such as extended fieldwork in distinct settings and the co-production of knowledge with diverse groups. Pronouns: She/her, they/them.Research interestsEthnographies of collective information security practices in higher-risk settingsSocial foundations of information security and cryptographyPrecarious labour and information security Further information Personal websiteDBLPEthnography GroupSocial Foundations of Cryptography Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 17 Conference contribution 7 Article 4 Chapter 2 Other contribution 2 More 1 Commissioned report 1 Special issue Research output per year Research output per year On the Virtues of Information Security in the UK Climate MovementBrough, M., Jensen, R. B. & Albrecht, M., 8 Sept 2025, Proceedings of the 34th USENIX Security Symposium. USENIX, p. 5091-5110 20 p. 262Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Reflexivity & Reflection (R&R) for Sociotechnical Safety: Creating a Space for Collective LearningMcclearn, J., Qin, L., Tseng, E., Wei, M., Jensen, R. B., McDonald, N., Redmiles, E. M., Scheuerman, M. K. & Talhouk, R., 17 Oct 2025, CSCW Companion '25: Companion Publication of the 2025 Conference on Computer-Supported Cooperative Work and Social Computing. ACM, p. 138-143 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Searching for a Farang: Collective Security among Women in Pattaya, ThailandRobinson, T. & Jensen, R. B., 13 Sept 2025, (Accepted/In press) 47th IEEE Symposium on Security and Privacy (SP). IEEE, p. 1 20 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution The Everyday Security of Living With ConflictMcclearn, J., Talhouk, R. & Jensen, R. B., 26 Mar 2025, In: IEEE Security and Privacy Magazine. 23, 2, p. 95-100 6 p.Research output: Contribution to journal › Special issue › peer-review Open AccessFile 63 Downloads (Pure) The Gig Economy and Its Impact on Women in IraqMilani, H., Shah, Z. & Jensen, R. B., 31 Jan 2025, In: Global Labour Journal. 16, 1, p. 45-60 16 p.Research output: Contribution to journal › Article › peer-review Open Access View all 32 research outputs Projects 3 Active 7 Finished Projects per year Wireless Mesh Networking for Humanitarian CommunicationJensen, R. B. (PI)2/09/24 → 27/02/26Project: Research Social Foundations of CryptographyAlbrecht, M. (PI) & Jensen, R. B. (CoI)Eng & Phys Sci Res Council EPSRC1/01/24 → 31/12/26Project: Research EPSRC Centre for Doctoral Training in Cyber Security for the Everyday Martin, K. M. (PI), Cid, C. (CoI), Coles-Kemp, L. (CoI), Jensen, R. B. (CoI) & Adey, P. (CoI)1/10/19 → 31/03/28Project: Other Survey on crime and hostility suffered by Anglican clergyJensen, R. B. (PI) & Gabe, J. (CoI)National Churchwatch1/12/17 → 31/12/18Project: Research Navigating Everyday Connectivities at SeaJensen, R. B. (PI)The Sailors Society1/09/17 → 31/08/18Project: Research View all 10 projects",
  "content_length": 4285,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:08"
}