{
  "name": "Riko Jacob",
  "homepage": "https://pure.itu.dk/portal/en/persons/riko-jacob(e6f70fb0-caf1-4736-b583-b0777bc1390f).html",
  "status": "success",
  "content": "Riko Jacob - IT-University of Copenhagen Riko Jacob Head of Section Associate Professor, Theoretical Computer ScienceAlgorithmsMachine LearningCenter for Information Security and Trust https://orcid.org/0000-0001-9470-1809 Emailrikjitudk 20142024 Research activity per year Personal profile KeywordsAlgorithmsComplexitySortingExperimentsDifferential privacyCombinatorial optimization Fingerprint Dive into the research topics where Riko Jacob is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Matrix (Mathematics) Mathematics 100% Fragile Complexity Keyphrases 71% Competitive Ratio Mathematics 71% Data Structure Computer Science 59% Randomized Algorithms Keyphrases 48% Adaptive Algorithm Keyphrases 47% Matrix Multiplication Computer Science 47% External Memory Model Keyphrases 41% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2015 2016 2018 2019 2021 2022 2024 2024 11 Article in proceedings 4 Conference article 3 Journal article 1 Report 1 More 1 Working paper Research output per year Research output per year An Algorithm for Bichromatic Sorting with Polylog Competitive RatioJacob, R. & Goswami, M., 24 Jan 2024, In: Leibniz International Proceedings in Informatics (LIPIcs). 287, p. 1-17 17 p.Research output: Journal Article or Conference Article in Journal › Conference article › Research Open Access Bichromatic 100% Competitive Ratio 100% Worst-case Performance 20% Randomized Algorithms 20% Sorting Algorithm 20% An Optimal Randomized Algorithm for Finding the Saddlepoint.Dallant, J., Haagensen, F., Jacob, R., Kozma, L. & Wild, S., 23 Sept 2024, In: Leibniz International Proceedings in Informatics (LIPIcs). 308, p. 1-12 12 p.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open Access Randomized Algorithms 100% Time Algorithm 100% Matrix (Mathematics) 100% Algorithm Improvement 50% Pure Nash Equilibrium 50% Finding the saddlepoint faster than sortingJacob, R., Dallant, J., Haagensen, F., Kozma, L. & Wild, S., 2024, 2024 Symposium on Simplicity in Algorithms (SOSA). Society for Industrial and Applied Mathematics, p. 168 - 178 11 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research Open Access Sorted Matrices 100% Feasibility Trial 100% Iterated Logarithm 100% Recursive Method 100% Shor 100% On Instance-Optimal Algorithms for a Generalization of Nuts and Bolts and Generalized SortingJacob, R. & Goswami, M., Aug 2024, In: Leibniz International Proceedings in Informatics (LIPIcs). 317, p. 1-23 23 p.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open Access Optimal Algorithm 100% Instance Optimal 100% Optimality 100% Competitive Ratio 100% Cost Function 100% Optimal Parallel Sorting with Comparison ErrorsJacob, R. & Goodrich, M. T., 17 Jun 2023, Proceedings SPAA '23. Association for Computing Machinery, p. 355-365 11 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Parallel Sorting 100% Dislocation 100% Comparison Errors 100% Probability Theory 100% Non-persistent 80% View all 20 research outputs Projects Projects per year 2014 2014 2020 2023 2025 4 Finished Projects per year DIREC: Digital community buildingJacob, R. (PI) & Schürmann, C. (PI)Innovation Fund Denmark01/04/2023 → 01/09/2025Project: Research Denmark 100% Digital Research 100% Community Building 100% Danish 100% Profit Organization 100% SSS: Scalable Similarity SearchPagh, R. (PI), Christiani, T. L. (CoI), Pham, N. D. (CoI), Faithfull, A. (CoI), Silvestri, F. (CoI), Mikkelsen, J. W. (CoI), Sivertsen, J. V. T. (CoI), Aumüller, M. (CoI), Skala, M. (CoI), Ceccarello, M. (CoI), Themsen, R. (CoI), Jacob, R. (CoI), McCauley, S. (CoI) & Ahle, T. D. (CoI)European Commission01/05/2014 → 30/04/2019Project: Research Locality Sensitive Hashing 100% Similarity Join 54% Similarity Search 44% False Negative 41% Hamming Space 34% DISTRUST: Distributed business process execution under partial trustJacob, R. (PI), Debois, S. (PI) & Haagensen, F. (CoI)Independent Research Fund Denmark01/07/2020 → 30/06/2025Project: Research DIREC: Digital Research Centre DenmarkGodskesen, J. C. (PI), Barkhuus, L. (PI), Bonnet, P. (PI), Brabrand, C. (PI), Schürmann, C. (PI), Sekara, V. (PI), David, B. M. (PI), Husfeldt, T. (PI), Curticapean, R.-C. (PI), Limaye, N. (PI), Aumüller, M. (PI), Jacob, R. (PI), Risi, S. (PI), Wasowski, A. (PI), Okkels, C. B. (CoI), Berthelsen, K. H. (CoI), Larsen, M. K. (CoI), Schmidt, M. D. (CoI) & Ghaffari, M. (CoI)Innovation Fund Denmark01/10/2020 → 30/09/2025Project: Research Digital Research 100% Denmark 100% Research Centre 100% Danish 83% Industry Organization 33% Activities Activities per year 2024 2024 2024 1 Membership in review committee Activities per year Hiring committee for assistant/associate Professorships in Algorithms (Event)Sestoft, P. (Chair), Kulyk, O. (Member) & Jacob, R. (Member)2 May 2024 → 1 Sept 2024Activity: Membership types › Membership in review committee",
  "content_length": 5546,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:09"
}