{
  "name": "Rineke Verbrugge",
  "homepage": "http://www.ai.rug.nl/~rineke",
  "status": "success",
  "content": "Homepage Skip to content Rineke Verbrugge Menu Job •  Since 2009: Full Professor Logic and Cognition. •  Team leader of the Multi-agent Systems Group in the Department of Artificial Intelligence. •  Based at the Bernoulli Institute of Mathematics, Computer Science and Artificial Intelligence, in the Faculty of Science and Engineering of the University of Groningen, the Netherlands. Research interests •  Applications of logic in Artificial Intelligence •  Multi-agent systems •  Higher-order social cognition Short biography Current position Rineke Verbrugge is a pioneer in building bridges between logic and cognitive science. Specifically, she was the first one to combine dynamic epistemic logic and computational cognitive modeling to study theory of mind. Verbrugge is a full professor, holding the chair of Logic and Cognition at the University of Groningen’s Bernoulli Institute. Since 2002, she has been the leader of the Multi-agent Systems research group in Groningen, first as an associate professor and since 2009 as a full professor. Education and past positions In 1988, Rineke Verbrugge received an MSc (cum laude) followed in 1993 by a PhD, both in Logic and Foundations of Mathematics at the University of Amsterdam. Subsequently, she was post-doc at the Charles University of Prague and the University of Gothenburg, visiting assistant professor at MIT in Cambridge (MA), and assistant professor at the Vrije Universiteit in Amsterdam. During her time at MIT, she changed her field of research from mathematical logic to artificial intelligence, focusing on logics for multi-agent systems. Publishing Verbrugge has published more than 200 peer-reviewed international publications and a monograph, Teamwork in Multi-Agent Systems: A Formal Approach, written together with Barbara Dunin-Kęplicz and published by Wiley in 2010. Her work is widely cited, her current Google Scholar h-index being 25. Her work with Elske van der Vaart and Charlotte Hemelrijk on corvids’ social cognition was reported by Michael Balter in Science (March 1, 2012). Research projects Together with Jan van Eijck, she has led the large international NIAS theme group “Games, Action, and Social Software” (2006-2007), resulting among others in two edited volumes, Discourses on Social Software (Amsterdam University Press, 2009) and Games, Actions and Social Software (Springer LNCS, 2012). Together with Johan van Benthem and Sujata Ghosh, she has led the NWO-EW project “Strategies in multi-agent systems: from implicit to implementable” (2009-2012), leading to the book Models of Strategic Reasoning: Logics, Games, and Communities (Springer 2015). In 2009-2014, Verbrugge has led her NWO Vici-project “Cognitive systems in interaction: Logical and computational models of higher-order social cognition”, which has been very successful, leading to three PhDs and 125 publications. Since 2019, Verbrugge is co-applicant of the ten-year long national Gravitation project Hybrid Intelligence: Augmenting Human Intellect, for which she is the director of PhD training. Invited lectures As examples of international recognition, Rineke Verbrugge has been invited to speak at around 60 international occasions, for example as keynote speaker at the 14th International Conferences on Theoretical Approaches to Rationality and Knowledge (TARK 2013), at the 5th International Conference on Computational Models of Argument (COMMA 2014), and for 500 people at the popular scientific series Science and Cocktails in Copenhagen in 2016. More recently, she has been a keynote speaker at the 14th international conference on Advances in Modal Logic (AiML 2022) and the 20th International Conference on Principles of Knowledge Representation and Reasoning (KR 2023). She was also invited to present the yearly Lindström Lectures in Gothenburg in 2023. Editing Verbrugge is associate editor of the Journal of Logic, Language and Information (JoLLI), and member of the editorial board of Computability, the Journal of Reasoning-based Intelligent Systems, and Theoria. She has been co-editor of six books and several special issues of journals, for example, on the theme “Logic and Cognition” for the JoLLI and on the theme “Lying in logic, language and cognition” for Topics in Cognitive Science. Awards In 2008, Verbrugge was awarded an NWO Vici grant in the innovational research incentives scheme for her five year, multi-person research project “Cognitive systems in interaction: Logical and computational models of higher-order social cognition” (2009-2014). In 2009, she received an NWO Aspasia grant. Also in 2009, she was awarded the Faculty Award for “Best Educator” of the Faculty of Mathematics and Natural Sciences of the University of Groningen, which employs around 300 lecturers. In 2013, her paper with Nils Bulling and Sujata Ghosh,“Reaching your goals without spilling the beans: Boolean secrecy games”, won the Best Paper Prize at the 16th International Conference on Principles and Practice of Multi-Agent Systems. Since 2016, Rineke Verbrugge has been an elected member of the Koninklijke Hollandsche Maatschappij der Wetenschappen (Royal Holland Society of Sciences and Humanities, KHMW). Since 2021, Verbrugge is an elected member of the KNAW (Koninklijke Nederlandse Akademie van Wetenschappen / Royal Netherlands Academy of Arts and Sciences). A model by any other name… In 1992, I wrote the manuscript, “Verzamelingen-Veltman frames en modellen (set Veltman frames and models)”, without writing my name on it and without submitting it for publication. Download pdf The manuscript started to travel. Researchers proved many new results about these models, which they re-named “generalized Veltman models”. In 2020, some of these researchers found out that the manuscript had in fact been written by me and gave the models their current name. For the history and the main results, see Joost Joosten and colleagues’ chapter “An overview of Verbrugge semantics, a.k.a. generalised Veltman semantics”, in the book Dick de Jongh on Intuitionistic and Provability Logic, 2024. Download pdf Wisdom of the crowd? Image by Mohamed Hassan from Pixabay In discussions, people tend to overvalue arguments that confirm their prior beliefs, while undervaluing arguments that attack their prior beliefs. What consequences does this ‘my-side bias’ have for group decisions? Here you can find our article The Wisdom of the Small Crowd: Myside Bias and Group Discussion, by Edoardo Baccini, Zoé Christoff, and Rineke Verbrugge Lies, lies, lies A special issue on Lying has appeared in Topics in Cognitive Science. Editors: Hans van Ditmarsch, Petra Hendriks and Rineke Verbrugge. Here you can find our Editors’ Review and Introduction: Lying in Logic, Language, and Cognition And here you can find the whole Special issue on Lying Rineke Verbrugge 2024 Scroll To Top",
  "content_length": 6855,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:14"
}