{
  "name": "Rini van Solingen",
  "homepage": "https://rinivansolingen.nl",
  "status": "success",
  "content": "Home - Rini van Solingen Rini van SolingenSpreker, best-seller auteur en hoogleraar. Zijn expertise is snelheid en wendbaarheid van mensen en organisaties Boek Rini voor een lezing SprekenRini spreekt over snelheid en wendbaarheid van mensen en organisaties. Zijn gave is het eenvoudig maken en op een humorvolle manier uitleggen van complexe inhoud.Dat doet hij door het gebruik van simpele analogieën en het vertellen van concrete praktijkverhalen en anekdotes. Ook deelt hij simpele en krachtige modellen in zijn presentaties. En dat hoeft niet altijd serieus te zijn; er mag ook best gelachen worden.Rini gebruikt geen powerpoint presentaties. Tijdens zijn lezingen gebruikt Rini flipcharts: de ene voor de centrale lijn van het verhaal en de andere voor de zijpaden en modellen. Op basis van een lezing en de gemaakte flipcharts wordt achteraf een handout verstrekt.Vanuit zijn leerstoel aan de TU-Delft kan Rini ook dieper ingaan op best-practices en voorbeelden van virtueel samenwerken; zelfs over grote afstanden, cultuurverschillen en tijd-zones heen.Ook een online lezing via Zoom, Skype, MsTeams, etc. is mogelijk. Opnames van lezingenDe ankerpunten van agile (Nederlandstalig)Module 1 – masterclass agile (leiderschap) (Nederlandstalig)Innovation & unexpected learning (Engelstalig)Global software engineering (Engelstalig)The good, bad & ugly of Scrum (Engelstalig)Bekijk meer video’sRini legt de grootste focus op het empoweren van zijn publiek (hoe pas je het de volgende dag al toe, wat kan je doen en wat kan je laten?). Hij helpt in te zien waarom de dingen gaan zoals ze gaan en wat je daar dus zelf concreet aan kunt doen. Hierdoor scoren zijn presentaties bijna altijd boven de 9 en is hij vaak de best-gewaardeerde spreker op events. Voorbeelden van lezingen die Rini geeft, zijn:Het waarom, hoe en wat van snelheid en wendbaarheidHoe ziet werken (en leidinggeven) er uit als onvoorspelbaarheid en complexiteit groeit?Wat leert de Formule 1 ons over snelheid voor onze eigen organisaties?Agile leiderschap – hoe word ik daar beter in en wat is het eigenlijk?Hoe vergroot je je eigen persoonlijke snelheid en resultaatgerichtheid?Wat is een wendbare cultuur en hoe creëer je die?En wat kunnen we leren over virtueel samenwerken uit jaren aan global sw-engineering research?Online SessiesDoordat er steeds meer vanuit huis wordt gewerkt is het niet altijd mogelijk iedereen bij elkaar op dezelfde locatie te krijgen voor een lezing. Een online sessie is dan een prima optie.Rini verzorgt steeds vaker online sessies. Daarbij wisselt hij doorlopend van werkvorm. Bijvoorbeeld door een break-out in subgroepen, een poll of quizvraag, een mentimeter survey, een opdracht, Q&A sessie, enzovoorts. Daarmee wordt de energie van de deelnemers vastgehouden en wordt het niet saai.Ook bij online sessies gebruikt Rini geen powerpoint maar verzorgt hij de lezing of workshop voor een flipchart. Na afloop wordt een handout met de flips en aanvullende artikelen en filmpjes nagestuurd om te delen met alle deelnemers. In overleg kan de sessie ook worden opgenomen voor collega’s die er niet bij kunnen zijn of die de sessie deels terug willen kijken. Hybride Werken (gratis)Samen met Despreker.nl heb ik een masterclass hybride werken gemaakt die gratis online te volgen is. Tien videos bestaande uit 8 modules met (team) opdrachten. Je vindt de video’s (en opdrachten) hier:Opening   – Start en basistheorieModule  1  – Van thuis naar onlineModule 2  – Van activiteit naar resultaatModule 3  – Van alleen naar samenModule 4  – Van plannen naar ritmeModule 5  – Van subtiel naar duidelijkModule 6  – Van buiten naar binnenModule 7  – Van planbaar naar wendbaarModule 8  – Van herder naar imkerAfsluiting – Hoe nu verder?In de beschrijving op YouTube staan de (team)opdrachten opgenomen. Maar je kunt ook het werkboek met alle opdrachten hier vinden.Sessies van een uur, twee uur of een dagdeel zijn mogelijk. Neem gerust even contact op om de mogelijkheden en doelen door te spreken.Onderwerpen voor online sessies zijn bijvoorbeeld:Tips en tricks voor thuiswerkende agile teams (video)Hoe doe je een agile transformatie (en hoe als iedereen thuiswerkt)?Waarom, hoe en wat van wendbaarheid – en wat komt daarna.Agile leiderschap, wat vraagt dat van mij?MasterclassesOnline masterclasses met Rini:Masterclass AgileMasterclass Agile LeiderschapDeze masterclasses kunnen gebruikt worden ter voorbereiding van een online sessie of workshop. Aansluitend kan dan een live online sessie voor vragen, verdieping of aanvullende opdrachten worden gehouden.Rini heeft ook een aantal managementboeken geschreven waarover hij graag een lezing geeft. Boek Rini voor een lezing Schrijven Boeken Alle ballen op ImpactNegen impactversnellers om meer resultaat uit je werk te halen AGILEMooi boek over hoe je een organisatie gezond, flexibel en fit maakt Agile Portfoliomanagementmet Henny Portman Formule Xmet Jurriaan Kamer De BijenherderLeidinggeven aan zelfsturende teams, hoe doe je dat? De Kracht van Scrummet Eelco Rustenburg Toolkit voor agile coaches en scrummastersmet Charlotte Bendermacher en Cleo Kampschuur Agile werken in 60 minutenmet Rob van Lanen De Boeken van Rini bestel je hier: Overzicht van alle boeken Artikelen Legacy én innovatie Scrum master excellence Product owner excellence Product discovery Agile managementteams Sturen op waarde Agile Portfoliomanagement Executie als strategie Release snelheid Agile transformaties Eigenaarschap van teams Valkuilen in agile transformaties Overzicht van alle artikelen Wetenschappelijke artikelenRini is sinds 2010 deeltijdhoogleraar global software engineering aan de Technische Universiteit Delft (faculteit Electrotechniek, Wiskunde en Informatica – afdeling software technologie, sectie software engineering). Hij verzorgt het onderwijs en onderzoek naar gedistribueerde software teams (near- en offshore). Hierover publiceert hij regelmatig. Zijn belangrijkste wetenschappelijke publicaties over dit onderwerp zijn: TDarja Šmite, Rini van Solingen, Panagiota ChatzipetrouThe Offshoring Elephant in the Room: Turnover Strategies for Addressing Turnover When Offshoring to IndiaIEEE Software, March 11, 2019. AJan Vlietland, Rini van Solingen, Hans van VlietAligning codependent Scrum teams to enable fast business value delivery: A governance framework and intervention actionsJSS (Volume 113, Pages 418-429), Elsevier, March 2016. CDarja Šmite, Ricardo Britto, Rini van SolingenCalculating the extra costs and the bottom-line hourly cost of offshoringBest-paper award ICGSE 2017, Proceedings of the 12th International Conference on Global Software Engineering (pp. 96-105), IEEE CS Press, May 28, 2017. AHennie Huijgens, Arie van Deursen, Rini van Solingen,An exploratory study on the effects of perceived value and stakeholder satisfaction on software projectsBest-paper award of EASE 2016, Proceedings of the 20th International Conference on Evaluation and Assessment in Software Engineering (Article No. 31), ACM, June 03, 2016 WDarja Smite, Rini van SolingenWhat's the True Hourly Cost of Offshoring?IEEE Software (Volume: 33 , Issue: 5), IEEE CS Press, Sept-Oct, 2016. CKevin Dullemond, Ben van Gameren, Rini van SolingenCollaboration Spaces for Virtual Software TeamsIEEE CS Press, Nov-Dec, 2014. VKevin Dullemond, Ben van Gameren, Rini van SolingenVirtual Open Conversation Spaces: Towards Improved Awareness in a GSE SettingProceedings of the 5th International Conference on Global Software Engineering, IEEE CS Press, August 26, 2010. WPanagiota Chatzipetrou, Darja Smite, Rini Van SolingenWhen and who leaves matters: emerging results from an empirical study of employee turnoverProceedings of the 12th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement, ACM, October 11, 2018 Overzicht van alle publicaties Training & coachingEen lezing van Rini duurt meestal een uur. Soms is er echter behoefte aan meer tijd of aan intensieve interactie. Dan is een workshop of training waarschijnlijk een beter alternatief.Workshops duren meestal 2 á 3 uur en worden in onderling overleg en op maat samengesteld. Ook training door Rini is mogelijk, variërend van een tot enkele dagen of bijvoorbeeld een dagdeel per maand gedurende een half jaar. Neem gerust even contact op de mogelijkheden en doelen door te spreken.Aangezien Rini zelf veel ervaring heeft als directielid en heeft meegeholpen aan meerdere transformaties in multinationals, komt hij ook uitstekend tot zijn recht in directiesessies en/of RvB-meetings.Advies & coachingOp zoek naar persoonlijke begeleiding bij het sneller of wendbaarder maken van jouzelf of je organisatie/afdeling/team? Rini is beschikbaar als coach of consultant. Neem gerust even contact op om samen te onderzoeken wat een passende manier zou kunnen zijn.Tevens werkt Rini nauw samen met Prowareness We-On.  Prowareness WeOn heeft een groot aantal agile coaches, consultants en professional in dienst die op dagelijkse basis klanten helpen in hun transformatie. Daarnaast heeft Prowareness We-On een eigen academy met een ruim aanbod aan (gecertificeerde) trainingen en verzorgt zij ook agile softwareontwikkeling via haar zusterorganisatie DEVON. Video's Masterclass Agile (1/5)www.hetgrootstekennisfestival.nl De kracht van agile Scrum in 19 minuten videowww.hetgrootstekennisfestival.nl Snelheid als strategie Webinar Thuiswerken (offshoren naar de keukentafel) Het waarom, hoe en wat van agile Distributed software engineeringEngelstalig The power of Scrum – met Jeff Sutherland (en Rini in de sloot)Engelstalig Overzicht van alle video's Over RiniRini van Solingen is deeltijd hoogleraar aan de Technische Universiteit Delft, en vult de CTO-rol in bij Prowareness en Xeleron. Daarnaast is non-executive boardmember bij Momo Medical. Hij is docent bij verschillende masterclasses en MBA’s aan Universiteit Nyenrode.Rini woont in Zoeterwoude-dorp, samen met zijn echtgenote Patricia en zijn kinderen Bo en Bas. Samen met Patricia is hij mede-oprichter van stichting ",
  "content_length": 11110,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:13"
}