{
  "name": "Rishi Ranjan Singh",
  "homepage": "https://www.iitbhilai.ac.in/index.php?pid=rishi",
  "status": "success",
  "content": "Dr. Rishi Ranjan Singh IIT Bhilai administration@iitbhilai.ac.in हिन्दी English A- A A+ Home Academic DepartmentsDepartment of Computer Science and EngineeringCSE Faculty Dr. Rishi Ranjan Singh Rishi Ranjan Singh Associate Professor Dept. of Computer Science and Engineering Indian Institute of Technology, Bhilai E-mail: rishi@iitbhilai.ac.in Areas of Interest Social & Complex Network Analysis, Machine Learning with Graphs, Approximation Algorithms, Combinatorial Optimization, Mathematical Formulation, Vehicle Routing Problems, Graph Theory, Theoretical computer science. Education PhD, 2016, Indian Institute of Technology Ropar BTech, 2011, Uttar Pradesh Technical University, Lucknow, India Teaching Theory of Computation Complexity Theory Approximation Algorithms Network Science Social and Complex Network Analysis Experience November 2024-Present: Associate Professor, Dept. of Computer Science and Engineering, IIT Bhilai, India. August 2017-November 2024: Assistant Professor, Dept. of Computer Science and Engineering, IIT Bhilai, India. April 2016-August 2017: Assistant Professor, Dept. of Information Technology, IIIT Allahabad, India. September 2015-April 2016: Visiting Faculty, Dept. of Information Technology, IIIT Allahabad, India. Students Kirtidev Mohapatra [Ph.D., Ongoing] Aditi Shukla [M.Tech., Ongoing] Sanjeevani Vishni Bhopre [M.Tech., Ongoing] (Co-supervised with Dr. Soumajit Pramanik) Parul Diwakar [M.Tech., Completed] (Co-supervised with Dr. Soumajit Pramanik) Shaswati Patra [Ph.D., Completed] (Co-supervised with Dr. Barun Gorain) Bikas Saha [M.Tech., Completed] Shivam Sharma [M.Tech., Completed] (Co-supervised with Dr. Amit Kumar Dhar) Anuj Singh [B.Tech. Hons., Completed] Selected Publications S. Kumar, A. Kumar, A. Mallik, and R. R. Singh: OptNet-Fake: Fake News Detection in Socio-Cyber Platforms Using Grasshopper Optimization and Deep Neural Network, IEEE Transactions on Computational Social Systems, 2023. Exposure to half-truths or lies has the potential to undermine democracies, polarize public opinion, and promote violent extremism. Identifying the veracity of fake news is a challenging task in distributed and disparate cyber-socio platforms. To enhance the trustworthiness of news on these platforms, in this article, we put forward a fake news detection model, OptNet-Fake. The proposed model is architecturally a hybrid that uses a meta-heuristic algorithm to select features based on usefulness and trains a deep neural network to detect fake news in social media. The d -D feature vectors for the textual data are initially extracted using the term frequency inverse document frequency (TF-IDF) weighting technique. The extracted features are then directed to a modified grasshopper optimization (MGO) algorithm, which selects the most salient features in the text. The selected features are then fed to various convolutional neural networks (CNNs) with different filter sizes to process them and obtain the n-gram features from the text. These extracted features are finally concatenated for the detection of fake news. The results are evaluated for four real-world fake news datasets using standard evaluation metrics. A comparison with different meta-heuristic algorithms and recent fake news detection methods is also done. The results distinctly endorse the superior performance of the proposed OptNet-Fake model over contemporary models across various datasets. LINK B. Gorain, S. Patra, and R. R. Singh: Graph Covering Using Bounded Size Subgraphs, Algorithms and Discrete Applied Mathematics (CALDAM 2023), pp. 415-426, Springer, 2023. A variant of graph covering problem demands to find a set of sub-graphs when the union of sub-graphs contain all the edges of G. Another variant of graph covering problem requires finding a collection of subgraphs such that the union of the vertices of subgraphs forms a vertex cover. We study the later version of the graph covering problem. The objective of these problems is to minimize the size/cost of the collection of subgraphs. Covering graphs with the help of a set of edges, set of vertices, tree or tour has been studied extensively in the past few decades. In this paper, we study a variant of the graph covering problem using two special subgraphs. The first problem is called bounded component forest cover problem. The objective is to find a collection of minimum number of edge-disjoint bounded weight trees such that the vertices of the forest, i.e., collection of edge-disjoint trees, cover the graph. The second problem is called bounded size walk cover problem. It asks to minimize the number of bounded size walks which can cover the graph. Walks allow repetition of vertices/edges. Both problems are a generalization of classical vertex cover problem, therefore, are NP-hard. We give 4ρ and 6ρ factor approximation algorithm for bounded component forest cover and bounded size walk cover problems respectively, where ρ is an approximation factor to find a solution to the tree cover problem.. LINK A. K. Dhar, B. Gorain, K. Mondal, S. Patra, and R. R. Singh: Edge exploration of anonymous graph by mobile agent with external help, Computing, Volume 105, Pages 483-506, Springer, 2023. LINK R. R. Singh: Centrality measures: a tool to identify key actors in social networks, Principles of Social Networking, Chapter 1, 1-27, 2022. Experts from several disciplines have been widely using centrality measures for analyzing large as well as complex networks. These measures rank nodes/edges in networks by quantifying a notion of the importance of nodes/edges. Ranking aids in identifying important and crucial actors in networks. In this chapter, we summarize some of the centrality measures that are extensively applied for mining social network data. We also discuss various directions of research related to these measures. LINK D. Bajpai, and R. R. Singh: Temporal Analysis of Worldwide War, International Conference on Theory and Practice of Digital Libraries (TPDL 2021), pp. 66-70. Springer, 2021. In this paper, we study the wars fought in history and draw conclusions by analysing a curated temporal multi-graph. We explore the participation of countries in wars and the nature of relationships between various countries during different timelines. This study also attempts to shed light on different countries’ exposure to terrorist encounters. LINK R. R. Singh, A. K. Dhar, A. A. Kherani, N. V. Jacob, A. Misra, and D. Bajpai: Network Based Framework to Compare Vaccination Strategies, International Conference on Computational Data and Social Networks (CSoNet 2021), pp. 218-230. Springer, 2021. We propose a network based framework to model spread of disease. We study the evolution and control of spread of virus using the standard SIR-like rules while incorporating the various available models for social interaction. The dynamics of the framework has been compared with the real-world data of COVID-19 spread in India. This framework is further used to compare vaccination strategies. LINK A. A. Kherani, N. A. Kherani, R. R. Singh, A. K. Dhar, and D. Manjunath: On modeling of interaction-based spread of communicable diseases, International Conference on Computational Science and Its Applications (ICCSA 2021), pp. 576-591. Springer, 2021. We use a queuing model to study the spread of an infection due to interaction among individuals in a public facility. We provide tractable results for the probability that a susceptible individual leaves the facility infected. This model is then applied to study infection spread in a closed system like a large campus, community, and model the interaction among individuals in the multiple public facilities found in such systems. These public facilities could be restaurants, shopping malls, public transportation, etc. We study the impact of relative timescales of the Close Contact Time (CCT) and the individuals’ stay time in a facility on the spread of the virus. The key contribution is on using queuing theory to model time-spread of an infection in a closed population. LINK A. K. Dhar, S. Sharma, and R. R. Singh: Network Based Comparison of Indian Railways and Airways, International Conference on Computational Data and Social Networks (CSoNet 2020), pp. 100-112. Springer, 2020. We compare the Indian railways and domestic airways using network analysis approach. The analysis also compares different characteristics of the networks with a previous work and notes the change in the networks over a decade. In a populous country like India with an ever increasing GDP, more and more people are gaining the facility of choosing one mode of travel over the other. Here we have compared these two networks, by building a merger network. The need for such type of network arises as the order of both networks are different. This newly formed network can be used in identifying new routes and adding more flights on some of the popular routes in India. LINK A. Singh, R. R. Singh, and S.R.S. Iyengar: Node-weighted centrality: a new way of centrality hybridization, Computational Social Networks, Volume 7, Pages 1-33, Springer, 2020. Centrality measures have been proved to be a salient computational science tool for analyzing networks in the last two to three decades aiding many problems in the domain of computer science, economics, physics, and sociology. With increasing complexity and vividness in the network analysis problems, there is a need to modify the existing traditional centrality measures. Weighted centrality measures usually consider weights on the edges and assume the weights on the nodes to be uniform. One of the main reasons for this assumption is the hardness and challenges in mapping the nodes to their corresponding weights. In this paper, we propose a way to overcome this kind of limitation by hybridization of the traditional centrality measures. The hybridization is done by taking one of the centrality measures as a mapping function to generate weights on the nodes and the",
  "content_length": 21326,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:12"
}