{
  "name": "Risi Kondor",
  "homepage": "http://people.cs.uchicago.edu/~risi",
  "status": "success",
  "content": "Risi Kondor Risi Kondor homepage Risi Kondor Associate Professor Department of Computer Science (Crerar 221) Department of Statistics, Computational and Applied Mathematics Initiative (CAMI) The University of Chicago [Mastodon] [Github] [Scholar] My group is focused on fundamental methodological developments in machine learning, specifically machine learning for physics and chemistry. Much of our work is related to computational harmonic analysis and group representation theory. We are responsible for some foundational work on equivariant neural networks. We are also engaged in developing high performance, open source AI software in Python and C++. In addition, we are also engaged in work related to AI safety. Group members Andrew Hands (CS PhD, 4th year) Ryan Keane (CS PhD, 3rd year) Su Hyeong Lee (CCAM PhD, 4th year) Soumyabrata Kundu (Stats PhD, 6th year) Matthew Rossi (Data Science PhD, 1st year) Nicolas Schmid (CCAM Masters, 2nd year) Ryan Wong (Physics PhD, 5th year) Tarun Yadav (Data Science PhD, 2nd year) Former group   members Maia Fraser (Associate Prof at the University of Ottawa) Nedelina Teneva (Head of AI at RealAvatar) Vikas Garg (Assistant Prof at Aalto University) Yi Ding (Assistant Prof at Purdue) Brandon Anderson (Staff Scientist at Atomic.ai) Jonathan Eskreis-Winkler (Senior Applied Scientist at Etsy) Pramod K Mudrakarta (Software Engineer at Google) Shubhendu Trivedi (now at MIT) Erik Thiede (Assistant Prof at Cornell) Alexander Bogatskiy (DSI postdoc at UChicago) Hy Truong Son (Assistant Prof at the University of Alabama) Horace Pan (Machine Learning Engineer at Gauntlet) Richard Xu (PhD student at UChicago) Qinqi Zhang (PhD student at Harvard) Recent events Caltech & UChicago AI+Science conference (Nov 2025) UK AI Security Institute Alignment Conference (Oct 2025) Simons Workshop: Graph Learning Meets Theoretical Computer Science (Aug 2025) JHU Physics of Machine Learning workshop (Apr 2025) IMSI program on data-driven materials informatics (Mar-May 2024) NeurIPS 2020 tutorial on equivariant networks (with Taco Cohen) Mind the gap: between fairness and ethics (NeurIPS 2019 workshop) Software cnine: lightweight tensor library with GPU support (Python/C++) GElib: equivariant neural network library (Python/C++) ptens: permutation equivariant message passing library (Python/C++) Snob2: symmetric group FFT library (Python/C++) cengine: asynchronous compute engine (C++) SnOB: the original symmetric group FFT library (C++) pMMF: a high performance parallel Multiresolution Matrix Factorization (C++) Mondrian:  parallel blocked matrix library (C++) Selected   recent papers Risi Kondor:: The principles behind equivariant neural networks for physics and chemistry [PNAS 122(41) Jul 2025] Qingqi Zhang, Ruize Xu and Risi Kondor: Schur Nets: effectively exploiting local structure for equivariance in higher order graph neural networks [NeurIPS 2024] [code] [ptens] Andrew Hands, Tianyi Sun and Risi Kondor: P-tensors: a General Framework for Higher Order Message Passing in Subgraph Neural Networks [AISTATS, 2024] [code] [ptens] Han Zheng, Zimu Li, Junyu Liu, Sergii Strelchuk, and Risi Kondor: Speeding up Learning Quantum States through Group Equivariant Convolutional Quantum Ansätze [PRX Quantum 4, May 15, 2023] [preprint, Dec 2021] Horace Pan and Risi Kondor: Permutation equivariant layers for higher order interactions [AISTATS, 2022] Erik H. Thiede, Wenda Zhou and Risi Kondor: Autobahn: Autmorphism-based graph neural nets [NeurIPS 2021] [bib] [code] Brandon Anderson, Truong Son Hy and Risi Kondor: Cormorant: Covariant molecular neural networks [NeurIPS 2019] [bib] Risi Kondor and Shubhendu Trivedi: On the generalization of equivariance and convolution in neural networks to the action of compact groups [ICML 2018] [poster] [slides] [preprint, Feb 2018] Recent papers Soumyabrata Kundu and Risi Kondor:: A Geometric Approach to Steerable Convolutions [preprint, Oct 2025] Su Hyeong Lee, Risi Kondor and Richard Ngo:: Probabilistic Modeling of Latent Agentic Substructures in Deep Neural Networks [preprint, Sep 2025] Risi Kondor:: The principles behind equivariant neural networks for physics and chemistry [PNAS 122(41) Jul 2025] Qingqi Zhang, Ruize Xu and Risi Kondor: Schur Nets: effectively exploiting local structure for equivariance in higher order graph neural networks [NeurIPS 2024] [code] [ptens] Zimu Li, Zihan Pengmei, Han Zheng, Erik Thiede, Junyu Liu and Risi Kondor: Unifying O(3) equivariant neural networks design with tensor-network formalism [Machine Learning: Science and Technology 5:2, 2024] Su Hyeong Lee, Qingqi Zhang and Risi Kondor: Sign Rank Limitations for Inner Product Graph Decoders [ICML 2024] Soumyabrata Kundu and Risi Kondor: Steerable transformers [preprint, May 2024] Andrew Hands, Tianyi Sun and Risi Kondor: P-tensors: a General Framework for Higher Order Message Passing in Subgraph Neural Networks [AISTATS, 2024] [code] [ptens] Zihan Pengmei, Zimu Li, Chih-chan Tien, Risi Kondor, Aaron R. Dinner: Transformers are efficient hierarchical chemical graph learners (accepted at NeurIPS AIxScience workshop 2023) [preprint, Oct 2023] Duc Thien Nguyen, Manh Duc Tuan Nguyen, Truong Son Hy, Risi Kondor: Fast temporal wavelet graph neural networks (accepted at NeurIPS Temporal Graph Learning workshop 2023) [preprint, Feb 2023] Tianyi Sun, Andrew Hands, Risi Kondor: P-tensors: a general formalism for constructing higher order message passing networks [preprint, Jun 2023] [ptens software] Nhat Khang Ngo, Truong Son Hy, Risi Kondor: Multiresolution graph transformers and wavelet positional encoding for learning long-range and hierarchical structures [Journal of Chemical Physics, 159:3, July 2023] [preprint, Feb 2023] T. Son Hy and Risi Kondor: Multiresolution equivariant graph variational autoencoder [Machine Learning: Science and Technology 4:1, Mar 2023] [preprint, June 2021] Han Zheng, Zimu Li, Junyu Liu, Sergii Strelchuk, and Risi Kondor: Speeding up Learning Quantum States through Group Equivariant Convolutional Quantum Ansätze [PRX Quantum 4, May 15, 2023] [preprint, Dec 2021] Nhat Khang Ngo, Truong Son Hy, Risi Kondor: Modeling polypharmacy and predicting drug-drug interactions using deep generative models on multimodal graphs [preprint, Feb 2023] Zimu Li, Han Zheng, Erik Thiede, Junyu Liu, Risi Kondor: Group-equivariant neural networks with fusion diagrams [preprint, Nov 2022] T. Son Hy and R. Kondor: Multiresolution Matrix Factorization and its Wavelet Networks on Graphs [Topological, Algebraic, and Geometric Learning Workshops, Nov 2022] [preprint, Nov 2021] Nhat Khang Ngo, Truong Son Hy, Risi Kondor: Predicting drug-drug interactions using deep generative models on graphs [preprint, Sep 2022] Han Zheng, Zimu Li, Junyu Liu, Sergii Strelchuk, Risi Kondor: On the super-exponential quantum speedup of equivariant quantum machine learning algorithms with SU(d) symmetry [preprint, Jul 2022] Yanan Long, Horace Pan, Chao Zhang, Hy Truong Song, Risi Kondor, Andrey Rzhetsky: Molecular fingerprints are a simple yet effective solution to the drug-drug interaction problem [ICML workshop on Computational Biology, 2022] Truong Son Hy, Viet Bach Nguyen, Long Tran-Thanh, Risi Kondor: Temporal multiresolution graph neural networks for epidemic prediction [Workshop on healthcare and AI, 2022] A. Bogatskiy et al: Symmetry Group Equivariant Architectures for Physics (preprint, Mar 2022) Horace Pan and Risi Kondor: Permutation equivariant layers for higher order interactions [AISTATS, 2022] R. Townshend et al.: ATOM3D: Tasks On Molecules in Three Dimensions (Winner of the best paper award in the \"Datasets and benchmarks\" category at NeurIPS 2021) Erik H. Thiede, Wenda Zhou and Risi Kondor: Autobahn: Autmorphism-based graph neural nets [NeurIPS 2021] [bib] [code] Lars A. Bratholm et al.: A community-powered search of machine learning strategy space to find NMR property prediction models (PLOS ONE, July 2021) H. Pan and R. Kondor: Fourier bases for solving permutation puzzles (AISTATS 2021) A. Bogatskiy, B. Anderson, J. Offermann, M. Roussi, D. Miller and R. Kondor: Lorentz group equivariant neural network for particle physics (ICML 2020) [bib] E. H. Thiede, T. Son Hy and R. Kondor: The general theory of permutation equivarant neural networks and higher order graph variational encoders (preprint, April 2020) [bib] K. Swanson, S. Trivedi, J. Lequieu, K. Swanson and R. Kondor: Deep learning for automated classification and characterization of amorphous materials (Soft Matter, Royal Society of Chemistry, 2020) [bib] B. Anderson, T. Son Hy and R. Kondor: Cormorant: Covariant molecular neural networks [NeurIPS 2019] [bib] R. Kondor, Z. Lin and S. Trivedi: Clebsch-Gordan nets: a fully Fourier space spherical convolutional neural network (NeurIPS 2018) T. Son Hy, S. Trivedi, H. Pan, B. M. Anderson and R. Kondor: Predicting molecular properties with covariant compositional networks (JCP special issue, June 2018) [pdf] R. Kondor: N-body networks: a covariant hierarchical neural network architecture for learning atomic potentials (March 2018) Risi Kondor and Shubhendu Trivedi: On the generalization of equivariance and convolution in neural networks to the action of compact groups [ICML 2018] [poster] [slides] [preprint, Feb 2018] R. Kondor, Hy Truong Son, Horace Pan, Brandon Anderson, Shubhendu Trivedi: Covariant compositional networks for learning graphs (preprint, January 2018) [PyTorch code] [GraphFlow] [video] Y. Ding, R. Kondor and J. Eskreis-Winkler: Multiresolution kernel approximation for Gaussian process regression (NIPS 2017) P. K. Mudrakarta and R. Kondor: A generic multiresolution preconditioner for sparse symmetric systems (preprint 7/7/17) K. Rajendran, A. A. Kattis, A. Holiday, R. Kondor and I. G. Kevrekidis: Data mining when each data point is a network (Patterns of Dynamics, Springer Proceedings) [preprint] V. Ithapu, R. Kondor and V. Singh: The incremental multiresolution matrix factorization algorithm (C",
  "content_length": 11261,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:12"
}