{
  "name": "Risto Miikkulainen",
  "homepage": "http://www.cs.utexas.edu/~risto",
  "status": "success",
  "content": "Risto Miikkulainen Risto Miikkulainen Professor of Computer Science The University of Texas at Austin Director of the UTCS Neural Networks Research Group VP of AI Research, Cognizant AI Lab A Short Bio Risto Miikkulainen is a Professor of Computer Science at the University of Texas at Austin and VP of AI Research at Cognizant AI Lab. He received an M.S. in Engineering from the Helsinki University of Technology (now Aalto University) in 1986, and a Ph.D. in Computer Science from UCLA in 1990. His current research focuses on methods and applications of neuroevolution, as well as neural network models of natural language processing and vision; he is an author of over 500 publications in these research areas. Honors and Awards College of Fellows, International Neural Network Society, 2024 AAAI Fellow, 2023 IEEE CIS Evolutionary Computation Pioneer Award, 2020 Gabor Award, the International Neural Network Society, 2017 Outstanding Paper of the Decade Award, International Society for Artificial Life, 2017. IEEE Fellow, 2016 IEEE Computational Intelligence Society Distinguished Lecturer, 2015-2017. Best Paper Awards at GECCO-2002, 2003, 2005, 2007, 2008, 2014, 2015, 2017, 2020, 2022 Best Paper Awards at CIG-2005, 2006, 2009, 2011 Best Paper Award at CEC-2020 Deployed Application Award, AAAI/IAAI-2013, AAAI/IAAI-2018 Silver Award, 2022; Bronze Medal, 2005, 2017; Human Competitive Results Competition at GECCO Best Pathway to Impact Award, NeurIPS Climate Change workshop, 2024 BotPrize Award (Turing test for game bots), 2012 Honorable mention, Somerfield-Ziskind Research Award, Society of Biological Psychiatry, 2012 Winner, Annual Competition of Pseudo-Boolean SAT Solvers at SAT-2010 and SAT-2011 Research My research focuses on biologically-inspired computation such as neural networks and evolutionary computation. On one hand, the goal is to understand biological information processing, and on the other, to develop intelligent artificial systems that learn and adapt by observing and interacting with the environment. The three main focus areas are: (1) Neuroevolution, i.e. evolving complex deep learning architectures and recurrent neural networks for sequential decision tasks such as those in robotics, games, and artificial life; (2) Cognitive Science, i.e. models of natural language processing, memory, and learning that, in particular, shed light on disorders such as schizophrenia and aphasia; and (3) Computational Neuroscience, i.e. development, structure, and function of the visual cortex, episodic memory, and language processing. See the UTCS Neural Networks Research Group website as well as Cognizant AI Lab website for research projects, publications, demos, and software. A few highlights: Neuroevolution: Harnessing Creative Discovery of AI Model Design book; AI Paradigm Shift column and video in the AI Magazine; Lex Fridman podcast on Neuroevolution and Evolutionary Computation; an interactive COVID-19 Intervention optimization demo; the NERO machine learning game; the Computational Maps in the Visual Cortex book. Classes Current: CS378 Neuroevolution (undergraduate class), Fall 2024 CS394N Neural Networks (graduate class), Fall 2024 Past: CS343 Artificial Intelligence (undergraduate class) CS342 Neural Networks (undergraduate class) CS381K Artificial Intelligence (graduate class) CS378 CI in Game Design Part I; Part II (undergraduate research class) CS395T Cognitive Science (graduate seminar) Curriculum Vitae Stories Contact Office: GDC 3.826 (Meeting Schedule) Email address: risto@cs.utexas.edu Phone: (512) 471-9571; Fax: (512) 471-8885 Department of Computer Science, The University of Texas at Austin 2317 Speedway, Stop D9500, Austin, TX 78712 USA risto@cs.utexas.edu Wed Mar 6 21:29:39 CST 2024 2317 sp",
  "content_length": 3769,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:13"
}