{
  "name": "Ritambhara Singh",
  "homepage": "https://ritambharasingh.com",
  "status": "success",
  "content": "Ritambhara Singh About Me I am an Associate Professor of Computer Science and Data Science and a member of the Center for Computational Molecular Biology at Brown University.  My research lab develops machine learning methods with the goals of data integration and model interpretation for biological and biomedical applications. Prior to joining Brown, I was a post-doctoral researcher in the Noble Lab at the University of Washington. I completed my Ph.D. in 2018 from the University of Virginia with Dr. Yanjun Qi as my advisor. My research involves developing integrative and interpretable machine learning/deep learning models for important biological and clinical questions. I have received the NHGRI Genomic Innovator Award and Brown University’s Richard B. Salomon Faculty Research Award for developing deep learning methods to integrate and model genomics datasets. I have also received the Dean’s Award for Excellence in Teaching at Brown. I recently received the NSF CAREER award for developing integrative and explainable machine learning methods for heterogenous health-related datasets. I am serving as the co-Director of Graduate Studies (DGS) for the Computational Biology Ph.D. program at Brown with Dr. Jeff Bailey for the current academic year (2025-2026). Research Interests Machine Learning, Data Mining, Computational Biology, Health Sciences Information Office Location: Room #313 Data Science Institute (3rd Floor) 164 Angell Street Providence, RI 02912 Office Phone: (401)-863-9925 Email: ritambhara@brown.edu Google Scholar Search Search Subscribe Subscribed Ritambhara Singh Sign me up Already have a WordPress.com account? Log in now. Ritambhara Singh Subscribe Subscribed Sign up Log in Report this content View site in Reader Manage subscriptions Collapse this bar",
  "content_length": 1794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:14"
}