{
  "name": "Rita Francese",
  "homepage": "http://salerno.academia.edu/RitaFrancese",
  "status": "success",
  "content": "Rita Francese - University of Salerno Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Rita FranceseUniversity of Salerno, Dmi, Faculty MemberaddFollowdoneFollowingFollowers156Following131Co-authors5Public ViewsRelated Authors Michael SpiveyUniversity of California, Merced Andrej DujellaUniversity of Zagreb Alberto PimpinelliUniversité Clermont Auvergne Hemin KoyiUppsala University Jana JavornikUniversity of East London Armando Marques-GuedesUNL - New University of Lisbon Graham MartinUniversity of Leicester Gabriel Gutierrez-AlonsoUniversity of Salamanca John SuttonMacquarie University Kevin ArbuckleSwansea UniversityUploadsPapers by Rita FranceseThe SPECTRA Project: Biomedical Data for Supporting the Detection of Treatment Resistant SchizophreniaLecture notes in computer science, 2024 Supporting Schizophrenia PatiEnts’ Care wiTh Robotics and Artificial IntelligenceLecture Notes in Computer Science, Dec 31, 2022 Efficient local cascading residual network for real-time single image super-resolutionJournal of Real-Time Image ProcessingIn the past decade, single image super-resolution (SISR) based on convolutional neural networks (... more In the past decade, single image super-resolution (SISR) based on convolutional neural networks (CNNs) has been represented remarkable performance. Powerful characterization of CNN is important for recent methods to learn an intricate non-linear mapping between high-resolution and corresponding low-resolution images. However, a deeper and wider network structure brings superior performance while increasing the number of network parameters and calculations so that it is difficult to handle the real-time information. Hence, it can be embedded in mobile devices with difficulty. Inspired by the above motivation, a lightweight network for the real-time SISR is proposed by stacking efficient cascading residual blocks, which consist of several concatenate effective modules with wide activation. To further improve the network performance, with the increase of a slight number of parameters, the proposed network cooperates with a lightweight residual efficient channel attention module to capture feature interaction between channels. Extensive experiments provide significant demonstrations that the proposed network obtains the superior trade-off between performance and parameters compared with other current methods. The lightweight trait of our method allows it to implement real-time image processing and can be embedded in mobile devices. MetaCUX: Social Interaction and Collaboration in the MetaverseLecture Notes in Computer Science, Dec 31, 2022 Believe in Artificial Intelligence? A User Study on the ChatGPT’s Fake Information ImpactIEEE Transactions on Computational Social Systems, 2023 Special issue on interactive information VisualisationJournal of computer languages, Jun 1, 2020Special issue on interactive information Visualisation We are immersed in data. In the last years... more Special issue on interactive information Visualisation We are immersed in data. In the last years, the pace of data production closely follows Mooore's law, stressing our capabilities to produce valuable information at the same rate. As we know, more data is not necessary a synonym for a good amount of information. In fact, the challenge of finding a relevant piece of information in the lake of data is hard. Researchers address this problem by using many strategies, including machine learning, artificial intelligence, and adaptable user interfaces approaches. Nevertheless, solutions that use the \"human-inthe loop\" are effective in certain domains and problems, leveraging one's capability to make the difference. Improving the information retrieval is the key to augment the value of data for users. The international conference on information Visualisation (iV), one of the longest running on the subject, has long been dedicated in improving the value of data by using Visualisation approaches. This special issue of Journal of Computer Languages for Interactive Information Visualisation is based on the submissions to the 22nd International Conference on Information Visualisation (iV18), which was held in Italy in July 2018. The paper selected for this special issue among ten papers outlines and evaluates some recent works on tools for interactive information Visualisation, aiming at improving information retrieval.Download AI Unreliable Answers: A Case Study on ChatGPTLecture Notes in Computer Science, 2023 Contextualized Experiential Language Learning in the MetaverseProceedings of the 15th Biannual Conference of the Italian SIGCHI ChapterMetaverse is an immersive environment that may support in an effective way contextualized experie... more Metaverse is an immersive environment that may support in an effective way contextualized experiential language learning, offering the possibility of collaboration, inclusion, and social interaction among students in context simulating real situations. In this paper, we propose MetaCLA, an immersive multiuser virtual environment based on oculus Meta Quest 2 that offers contextualized experiences for interactive language lab activities conducted in a small group. The environment is equipped with interactive objects useful for learning vocabulary, stimulating discussions, and role-playing. We also conduct a preliminary evaluation involving an English classroom composed of 15 students and a teacher. We assess the presence and easiness to use perceptions, the easiness of use, and the net promoter score of participants. First results were encouraging. CCS CONCEPTS • Human-centered computing → Collaborative and social computing systems and tools; • Applied computing → Collaborative learning.arrow_back_iosarrow_forward_iosDownload Guest editorial preface Special Issue on Advances in Adaptive and Affective LearningInternational Journal of Distance Education Technologies, 2013Download Traceability management in ADAMSTraceability Management in ADAMS Andrea De Lucia, Fausto Fasano, Rita Francese, Rocco Olivete {ac... more Traceability Management in ADAMS Andrea De Lucia, Fausto Fasano, Rita Francese, Rocco Olivete {aciduria, ffasano, francese, roliveto}@ unisa. it Dipartimento di Matematica e Informatica-Università di Salerno Via Ponte don Melillo-84084 Fisciano (SA)-Italy Abstract ... A Multimodal Conversational Interface to Support the creation of customized Social Stories for People with ASDProceedings of the 2022 International Conference on Advanced Visual Interfaces Training Bachelor Students to Design Better Quality Web Apps: Preliminary Results from a Prospective Empirical Investigation TA-CAMP Life: Integrating a Web and a Second Life Based Virtual ExhibitionDistributed Multimedia Systems, 2009 Improving student’s Self-Efficacy using an Adaptive Approach DyscalcTest Generation Environment: Supporting the Clinician in the Creation, Delivery and Evaluation of Dyscalculia TestsDyscalculia should be detected in the third primary class, but in many cases this disturb is diag... more Dyscalculia should be detected in the third primary class, but in many cases this disturb is diagnosed in later ages. In this paper we present a tool for supporting the clinician in the generation of responsive web-based tests for individuating people with disorder in basic numerical and arithmetic skills. Tests are created by combining specific kinds of questions which are delivered to a sample of people belonging to a specific target. The tool provides also support in the data analysis and in setting the alert thresholds for the selected user target. Results may be graphically visualized in summarized and single user way. Once the setting process is terminated, the test may be adopted. A case study on adult people is also presented. Identifying Correlations among Biomedical Data through Information Retrieval TechniquesIn recent years, the integration of researches in Computer Science and medical fields has made av... more In recent years, the integration of researches in Computer Science and medical fields has made available to the scientific community an enormous amount of data, stored in databases. In this paper, we analyze the data available in the Parkinson’s Progression Markers Initiative (PPMI), a comprehensive observational, multi-center study designed to identify progression biomarkers important for better treatments for Parkinson’s disease. The data of PPMI participants are collected through a comprehensive battery of tests and assessments including Magnetic Resonance Imaging and DATscan imaging, collection of blood, cerebral spinal fluid, and urine samples, as well as cognitive and motor evaluations. To this aim, we propose a technique to identify a correlation between the biomedical data in the PPMI dataset for verifying the consistency of medical reports formulated during the visits and allow to correctly categorize the various patients. To correlate the information of each patient’s medical report, Information Retrieval techniques have been adopted, including the Latent Semantic Analysis technique suitable for constructing a concept space on patient information. Then, patients are grouped and classified into affected or not by using clustering algorithms according to the similarity of medical reports projected in the concept space. Results revealed that the proposed technique reached 95% of effectiveness in the classification of patients. On the Use of Requirements Measures to Predict Software Project and Product Measures in the Context of Android Mobile Apps: A Preliminary StudyIn this paper, we study the value of software project and product measures in the context of Andr... more In this paper, we study the value of software project and produ",
  "content_length": 12890,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:14"
}