{
  "name": "Rittika Shamsuddin",
  "homepage": "https://ileadlab.okstate.edu",
  "status": "success",
  "content": "Rittika ShamsuddinSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome! I am Rittika, spearheading the iLEAD  Lab, where we harness the power of AI to revolutionize healthcare. With a keen focus on the fusion of machine learning and biomedical informatics, my team and I are committed to pioneering solutions that enhance patient outcomes and advance medical research. Outside the lab, I am passionate about mobile app development, baseball, and using art forms to promote STEM.  Join us as we navigate the exciting interface of technology and health, one breakthrough at a time!Rittika ShamsuddinAssistant Proffessor Data ScienceOklahoma State UniversityDr. Rittika Shamsuddin is an Assistant Professor of Computer Science at Oklahoma State University, where she combines her passion for machine learning, explainable AI, and healthcare informatics in her research. Her work focuses on practical applications, like healthcare data synthesis and clinical informatics, which aim to improve decision-making in clinical settings. Dr. Shamsuddin’s research interests also cover knowledge integration and interpretable AI, addressing critical challenges in areas such as bioinformatics and public health.She earned her Ph.D. and M.S. in Computer Science and Data Science from the University of Texas at Dallas, where she explored innovative ways to synthesize healthcare time series data. Before that, she graduated summa cum laude from Mount Holyoke College with a B.S. in Computer Science and Biology, where her thesis won the Best Senior Honors Thesis Award at the New England Undergraduate Computing Symposium. Her career has been shaped by a dedication to both academic and practical contributions, which has earned her awards, including the Holistic Science Prize Faculty Award from OSU.Dr. Shamsuddin is also an active member of the research community, frequently participating in NSF review panels and serving as a reviewer for journals in her fields. Her publication record includes work in top journals like Scientific Reportsand IEEE Transactions on Instrumentation and Measurement, where she contributes to topics such as synthetic healthcare data and ML interpretability.In the classroom, Dr. Shamsuddin brings her real-world research experiences into courses that range from introductory programming to advanced mobile application development. She is currently developing a Bioinformatics track and a Master’s program in AI in Healthcare at OSU. Passionate about inclusivity in STEM, she mentors students at all levels and serves as an advisor to programs like Girls Who Code. Dr. Shamsuddin’s commitment to education and her collaborative spirit make her a valued educator, researcher, and mentor.CS E-News - Oklahoma State UniversityPresident's Fellows Funding,Grace Hopper Faculty ScholarRittika Shamsuddin - Oklahoma State UniversityFaculty Spotlight2022_cs_newsletter.pdfHolistic Science Prize Awardee, Interdisciplinary Research, Department of MathematicsVirtual Career Panel - Oklahoma State UniversityWiDS, Stillwater Virtual Career PanelHosting Women in Data Science Stillwater Career PanelGet Involved - Oklahoma State UniversityWiDS Stillwater, Get InvolvedWomen in Data Science Stillwater (WiDS^²) - Oklahoma State UniversityGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3342,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:16"
}