{
  "name": "Rizos Sakellariou",
  "homepage": "http://www.cs.man.ac.uk/~rizos",
  "status": "success",
  "content": "Rizos Sakellariou - Home Page Rizos Sakellariou, PhD Department of Computer Science University of Manchester Oxford Road Manchester M13 9PL U.K. Phone: +44-161-2756257 email: rizos@manchester.ac.uk The High-Performance Lab Publications People Research Grants Teaching Professional Activities Miscellany Dr Rizos Sakellariou is (full) Professor, holding a Chair in Computer Science, a member of the academic staff of the Department of Computer Science of the University of Manchester, where he teaches and leads a Research Laboratory carrying out research in the broad area of Software for Parallel, Distributed and Large-Scale Systems. [Prior to his current role he was Lecturer, Senior Lecturer, Reader: if you are not familiar with UK academia check this)] Dr Sakellariou has been into Computer Science for nearly 40 years having accumulated huge experience in the field. During this time, he has been a programmer, a researcher, a consultant, an educator, a senior academic. He has authored over 200 research articles, participated in more than 25 funded projects, served as a chair or program committee member of over 200 international conferences, and successfully supervised 16 Ph.D. students to completion. For a full list of publications the best link is my google scholar profile Current research interests focus on software for any large-scale and/or distributed computing environment, especially in relation to resource management with multiple constraints and diverse optimization objectives and trade-offs. Dr Sakellariou would be happy to discuss research projects/proposals or supervise PhD projects particularly in relation to these topics. (if you are looking for a PhD topic and supervisor you may want to read this, also read these essential PhD tips) In the by now distant past, as a postdoc, Rizos was a member of the dHPF Compiler Group in the Department of Computer Science, Rice University, where he was involved with the DARPA-funded project POEMS. He has also been a Visiting Assistant Professor with the Department of Computer Science, University of Cyprus, whereas he has also had a brief spell of experience with the software industry, long time ago when people were using COBOL, Pascal and the like. A limited number of PhD studentships for home students are currently available from the School for a September 2024 start I am keen to supervise projects in a number of areas related to large-scale software including: high-performance (also distributed, cloud, fog, edge, heterogeneous) computing, scheduling, energy efficient computing, scientific workflows, managing large-scale computations/data, social network analysis. Feel free to suggest a research topic along these lines!",
  "content_length": 2711,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:18"
}