{
  "name": "Rob Voigt",
  "homepage": "https://faculty.wcas.northwestern.edu/robvoigt",
  "status": "success",
  "content": "Rob Voigt - Assistant Professor - Northwestern Linguistics Hi there! I have recently moved to UC Davis Linguistics; this page is now archival. Please visit my new faculty website at http://robvoigt.faculty.ucdavis.edu/. ---Rob Rob Voigt robvoigt(at)northwestern.edu Assistant Professor of Linguistics and Computer Science (by courtesy) Northwestern University Affiliations: Institute for Policy Research Cognitive Science Program Current courses: Winter 2025 LING 331 - Text Processing for Linguists Publications Forthcoming Body Camera Footage as Data: Using Natural Language Processing to Capture Policing At Scale and In Depth. Nicholas P. Camp and Rob Voigt. Forthcoming in Behavioral Science & Policy. Transgressing the binary: A computational approach to gendered reference. C. Michael Senko and Rob Voigt. Forthcoming in Battlefield Linguistics: Contemporary contestations of language, gender, and sexuality, De Gruyter Mouton. 2024 Adaptive Axes: A Pipeline for In-domain Social Stereotype Analysis. Qingcheng Zeng, Mingyu Jin, and Rob Voigt. 2024. Proceedings of Empirical Methods for Natural Language Processing (EMNLP 2024). Causal Micro-Narratives. Mourad Heddaya, Qingcheng Zeng, Chenhao Tan, Rob Voigt, and Alexander Zentefis. 2024. Proceedings of Empirical Methods for Natural Language Processing, Workshop on Narrative Understanding (WNU 2024). Leveraging body-worn camera footage to assess effects of training on officer communication during traffic stops. Nicholas P. Camp*, Rob Voigt*, MarYam G. Hamedani, Dan Jurafsky, and Jennifer L. Eberhardt. 2024. PNAS Nexus. A Computational Analysis and Exploration of Linguistic Borrowings in French Rap Lyrics. Lucas Zurbuchen and Rob Voigt. 2024. Proceedings of the Association for Computational Linguistics Student Research Workshop (ACL SRW 2024). [code and data] Pre-trained artificial intelligence language model represents pragmatic language variability central to autism and genetically related phenotypes. Joseph C.Y. Lau, Emily Landau, Qingcheng Zeng, Ruichun Zhang, Stephanie Crawford, Rob Voigt, and Molly Losh. Autism. 2023 The Refugee Advantage: English-Language Attainment in the Early Twentieth Century. Ran Abramitzky, Leah Platt Boustan, Peter Catron, Dylan Connor and Rob Voigt. 2023. Sociological Science. The Language of Bargaining. Mourad Heddaya, Solomon Dworkin, Chenhao Tan, Rob Voigt, and Alexander Zentefis. 2023. Proceedings of the Association for Computational Linguistics (ACL 2023) [video, data] Large Language Models Are Partially Primed in Pronoun Interpretation. Suet-Ying Lam, Qingcheng Zeng, Kexun Zhang, Chenyu You and Rob Voigt. 2023. Findings of the Association for Computational Linguistics (ACL 2023 Findings). [code] GreenPLM: Cross-Lingual Transfer of Monolingual Pre-Trained Language Models at Almost No Cost. Qingcheng Zeng, Lucas Garay, Peilin Zhou, DaDing Chong, Yining Hua, Jiageng Wu, Yikang Pan, Han Zhou, Rob Voigt, and Jie Yang. 2023. Proceedings of the International Joint Conference on Artificial Intelligence (IJCAI 2023) [code] 2022 Computational analysis of 140 years of US political speeches reveals more positive but increasingly polarized framing of immigration. Dallas Card, Serina Chang, Chris Becker, Julia Mendelsohn,Rob Voigt, Leah Boustan, Ran Abramitzky, Dan Jurafsky. 2022. Proceedings of the National Academy of Sciences. [data and code] 2021 The Thin Blue Waveform: Racial Disparities in Officer Prosody Undermine Institutional Trust in the Police. Nicholas P. Camp, Rob Voigt, Dan Jurafsky, and Jennifer L. Eberhardt. 2021. Journal of Personality and Social Psychology. Show Older Papers 2019 Analyzing Polarization in Social Media: Method and Application to Tweets on 21 Mass Shootings. Dorottya Demszky, Nikhil Garg, Rob Voigt, James Zou, Matthew Gentzkow, Jesse Shapiro, and Dan Jurafsky. 2019. Proceedings of NAACL. [code] 2018 RtGender: A Corpus of Responses to Gender for Studying Gender Bias. Rob Voigt, David Jurgens, Vinodkumar Prabhakaran, Dan Jurafsky, and Yulia Tsvetkov. 2018. Proceedings of LREC. [data] 2017 Language from Police Body Camera Footage Shows Racial Disparities in Officer Respect. Rob Voigt, Nicholas P. Camp, Vinodumar Prabhakaran, William L. Hamilton, Rebecca C. Hetey, Camilla M. Griffiths, David Jurgens, Dan Jurafsky, and Jennifer L. Eberhardt. 2017.Proceedings of the National Academy of Sciences. 2016 Cans and Cants: Computational Potentials for Multimodality with a Case Study in Head Position. Rob Voigt, Penelope Eckert, Dan Jurafsky, and Robert J. Podesva. 2016.Journal of Sociolinguistics. [code] Between- and Within-Speaker Effects of Bilingualism on F0 Variation. Rob Voigt, Dan Jurafsky, and Meghan Sumner. 2016.Proceedings of Interspeech. 2015 The Connection Between Smiling and GOAT Fronting: Embodied Affect in Sociophonetic Variation. Robert J. Podesva, Patrick Callier, Rob Voigt, and Dan Jurafsky. 2015.Proceedings of the International Congress of Phonetic Sciences 18. The Users Who Say \"Ni\": Audience Identification in Chinese-language Restaurant Reviews. Rob Voigt and Dan Jurafsky. 2015.Proceedings of ACL. [data] 2014 Two Knives Cut Better Than One: Chinese Word Segmentation with Dual Decomposition. Mengqiu Wang, Rob Voigt, and Christopher D. Manning. 2014 Proceedings of ACL. Speaker Movement Correlates with Prosodic Indicators of Engagement. Rob Voigt, Robert J. Podesva, and Dan Jurafsky. 2014. Proceedings of Speech Prosody 7. 2nd Place Best Paper Award. [code] 2013 Feature-Rich Phrase-based Translation: Stanford University's Submission to the WMT 2013 Translation Task. Spence Green, Daniel Cer, Kevin Reschke, Rob Voigt, John Bauer, Sida Wang, Natalia Silveira, Julia Neidert, and Christopher D. Manning. 2013. Proceedings of the Eighth Workshop on Statistical Machine Translation (WMT 2013). Tradition and Modernity in 20th Century Chinese Poetry. Rob Voigt and Dan Jurafsky. 2013. NAACL Workshop on Computational Linguistics for Literature. [code] 2012 Towards a Literary Machine Translation: The Role of Referential Cohesion. Rob Voigt and Dan Jurafsky. 2012. NAACL Workshop on Computational Linguistics for Literature. Links Computational Linguistics The ACL Anthology Conference Schedule Computational Linguistics (journal) Transactions of the ACL (journal) Personal Check out my personal website for all sorts of random projects. I make music as facsimiles. My main musical project is that I record an EP of original songs every year, and plan to do so for the rest of my life; seven years so far and going strong! I'm always open to collaborations and sometimes do music for radio and film. My brother John makes great animations and music as thunderwerld. I play Go and keep a board in the office. I probably maxed out in the neighborhood of 1k/1d but have no idea what my rank is anymore - anyway I'd love to play any time! You can also find me on KGS/OGS as robvoigt. Transparency and Accountability Pay Transparency Keeping salaries secret takes away bargaining power from workers and is a driver of structural inequalities in wages. This article is a useful starting summary of the issues at play. I will glady share my salary and details of my compensation with colleagues and anyone on the academic job market if it would be useful to you, please just email me. Accountability I am committed to doing what I can to work for equity and create an inclusive learning environment and research community. I also know I will sometimes misstep and want to continue to improve. If you notice something I need feedback on, I'm open to hearing it and hope you're comfortable letting me know directly. If not, please feel free to fill out the anonymous feedback form to the right here.",
  "content_length": 7685,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:24"
}