{
  "name": "Rob Alexander",
  "homepage": "https://www-users.cs.york.ac.uk/~rda",
  "status": "success",
  "content": "Dr Rob Alexander Dr Rob Alexander Department of Computer Science,University of York. Office: ISA/108, middle floor ISA Building Telephone: 01904 325474Email: rob.alexander@york.ac.uk I'm a senior lecturer (associate professor) in the Department of Computer Science at the University of York, UK. Research I study three things: The World - Understanding and modelling the messy real world environments that high-autonomy systems must inhabit, in particular for the sake of systems validation The Engineering Process - Understanding how the messy reality of large-scale engineering processes can give rise to disasters in safety-critical systems, and in refining techniques for managing that reality Collaborations with Drew Rae and John McDermid The Machine - Reconciling the advanced technologies needed for autonomy with the dependability (particularly safety) requirements that safety-critical applications impose on technologies and the means of analysing them I am interested in collaborations, and in supervising PhD research, in all of the above areas. If you're interested in PhD study, I have a page with some ideas for specific PhD projects. Teaching My current teaching includes: High Integrity Systems Engineering (HINT) - BEng & MEng Computer Science Autonomous Robotic Systems Engineering - BEng & MEng Computer Science Robotics and Autonomous Systems Safety - MSc Safety Critical Systems Engineering Publications I'm not keeping this current anymore  for my papers from 2019 onwards, please refer to my page on the university's research database 2018 Evaluation of Mutation Testing in a Nuclear Industry Case Study Delgado-Perez, P., Habli, I., Gregory, S., Alexander, R., Clark, J. & Medina-Bulo, I. IEEE Transactions on Reliability, December 2018 Ethics and the safety of autonomous systems Menon, C. & Alexander, R. D Safety-Critical Systems Symposium, February 2018 The State of Solutions for Autonomous Systems Safety Alexander, R. D., Ashmore, R. & Banks, A Safety-Critical Systems Symposium, February 2018 Safety-Related Challenges for Autonomous Systems SCSC Safety of Autonomous Systems Working Group SCSC, February 2018 2017 Evolving Test Environments to Identify Faults in Swarm Robotics Algorithms Hao Wei, Jon Timmis, Rob Alexander IEEE Congress on Evolutionary Computation, June 2017 Forecasts or fortune-telling: when are expert judgements of safety risk valid? Andrew Rae, Rob Alexander Safety Science, Sept 2017 Incorporating epistemic uncertainty into the safety assurance of socio-technical systems Chris Leong, Tim Kelly, Rob Alexander 2nd international Workshop on Causal Reasoning for Embedded and Safety-critical Systems Technologies, April 2017 Probative blindness and false assurance about safety Andrew Rae, Rob Alexander Safety Science, Feb 2017 From Safety Cases to Security Cases Rob Alexander, Richard Hawkins, Tim Kelly Safety-critical Systems Symposium, Feb 2017 2016 A Systematic Approach for Designing Mutation Operators for MDE languages Faisal Alhwikem, Richard Paige, Louis Rose, Rob Alexander. 13th Workshop on Model-Driven Engineering, Verification and Validation, October 2016. On the Validation of a UAV Collision Avoidance System Developed by Model-Based Optimization: Challenges and a Tentative Partial Solution Xueyi Zou, Rob Alexander, John McDermid 2nd International Workshop on Safety and Security of Intelligent Vehicles, June 2016 Testing Method for Multi-UAV Conflict Resolution Using Agent-Based Simulation and Multi-Objective Search Xueyi Zou, Rob Alexander, John McDermid Journal of Aerospace Information Systems, April 2016 Safe Multi-objective Planning With A Posteriori Preferences Ralph Eastwood, Rob Alexander and Tim Kelly IEEE High Assurance Systems Engineering Symposium (HASE), Jan 2016 2015 Semantic Mutation Testing for Multi-Agent Systems Zhan Huang, Rob Alexander The International Workshop on Engineering Multi-Agent Systems (EMAS), May 2015 (Jason release 1.4.1 modified to support SMT - version used for original paper) (Jason release 1.4.1 modified to support SMT - version used for post-proceedings paper) The optimisation of stochastic grammars to enable cost-effective probabilistic structural testing Simon Poulding, Rob Alexander, John Clark, Mark Hadley Journal of Systems and Software, May 2015 Subdomain-based test data generation (Publisher version  http://dx.doi.org/10.1016/j.jss.2014.11.033) Matthew Patrick, Rob Alexander, Manuel Oriol, John Clark Journal of Systems and Software, May 2015 Situation coverage - a coverage criterion for testing autonomous robots Rob Alexander, Heather Hawkins, Drew Rae Technical Report YCS-2015-496, Department of Computer Science, University of York, February 2015 2014 Probative Blindness: How Safety Activity can Fail to Update Beliefs about Safety Andrew Rae, John McDermid, Rob Alexander, Mark Nicholson Proceedings of the 9th IET International System Safety Conference, October 2014 Safety Validation of Sense and Avoid Algorithms Using Simulation and Evolutionary Search Xueyi Zou, Rob Alexander, John McDermid Proceedings of the 33rd International Conference on Computer Safety, Reliability and Security (SAFECOMP '14), September 2014 Mutation Testing for Jason Agents Zhan Huang, Rob Alexander, John Clark The International Workshop on Engineering Multi-Agent Systems (EMAS), May 2014 (Code for the muJason tool) Fixing the Cracks in the Crystal Ball: A Maturity Model for Quantitative Risk Assessment Andrew Rae, Rob Alexander, John McDermid Reliability Engineering and System Safety, May 2014 Probability-based semantic interpretation of mutants Matthew Patrick, Rob Alexander, Manuel Oriol, John Clark The International Workshop on Mutation Analysis, March 2014 Evolving Robust Networks for Systems-of-Systems: is it Viable for Large Networks? Jonathan M. Aitken, Rob Alexander, Tim Kelly, Simon Poulding Empirical Software Engineering, February 2014 2013 Selecting Highly Efficient Sets of Subdomains for Mutation Adequacy Matthew Patrick, Rob Alexander, Manuel Oriol, John A. Clark Proceedings of the 20th Asia-Pacific Software Engineering Conference (APSEC), December 2013 Towards a safety case for runtime risk and uncertainty management in safety-critical systems Ralph Eastwood, Tim Kelly, Rob Alexander, Einar Landre Proceedings of the 8th IET International System Safety Conference, October 2013 Testing Autonomous Robot Control Software using Procedural Content Generation James Arnold, Rob Alexander Proceedings of the 32nd International Conference on Computer Safety, Reliability and Security (SAFECOMP '13), September 2013 Efficient Subdomains for Random Testing Matthew Patrick, Rob Alexander, Manuel Oriol, John A. Clark Proceedings of the Symposium on Search-Based Software Engineering, August 2013 The Optimisation of Stochastic Grammars to Enable Cost-Effective Probabilistic Structural Testing Simon Poulding, Rob Alexander, John Clark, Mark Hadley Proceedings of Gecco, July 2013 (awarded best paper prize for SBSE track) The Discovery and Quantification of Risk in High Dimensional Search Spaces Kester Clegg, Rob Alexander Proceedings of Gecco, July 2013 Searching for Risk in Large Complex Spaces Kester Clegg, Rob Alexander Proceedings of EvoStar, April 2013 Using Mutation Analysis to Evolve Subdomains for Random Testing Matthew Patrick, Rob Alexander, Manuel Oriol, John A Clark Proceedings of the 8th International Workshop on Mutation Analysis, March 2013 Supporting systems of systems hazard analysis using multi-agent simulation Rob Alexander, Tim Kelly Safety Science, Volume 51, Issue 1, January 2013 2012 Searching air sectors for risk Kester Clegg, Rob Alexander Proceedings of the 2nd SESAR Innovation Days, November 2012 Evolving Robust Networks for Systems-of-Systems Jonathan M. Aitken, Rob Alexander, Tim Kelly, Simon Poulding Proceedings of the 4th International Symposium on Search-Based Software Engineering (SSBSE), September 2012 Network generator Code used in the paper The Science and Superstition of Quantitative Risk Assessment Andrew Rae, John McDermid, Rob Alexander Proceedings of PSAM 11 & ESREL 2012, June 2012 2011 ASHiCS: Automating the Search for Hazards in Complex Systems K Clegg, R Alexander Proceedings of the 1st SESAR Innovation Days, December 2011 Using a Software Safety Argument Pattern Catalogue: Two Case Studies R Hawkins, K Clegg, R Alexander, T Kelly Proceedings of the 30th International Conference on Computer Safety, Reliability and Security (SAFECOMP '11), September 2011 Is the \"System of Systems\" a Useful Concept for Hazard Analysis? A J Rae, R Alexander Proceedings of the 29th International System Safety Conference (ISSC '11), August 2011 The Need for SoS Safety Cases R Alexander, G Despotou, T Kelly Proceedings of the 29th International System Safety Conference (ISSC '11), August 2011 Security Assurance Cases: Motivation and the State of the Art R Alexander, R Hawkins, T Kelly Report produced for CESG, April 2011 A Risk Modelling Approach for a Communicating System of Systems J Aitken, R Alexander, T Kelly Proceedings of the 5th IEEE Systems Conference, March 2011 2010 Matching Research Goals and Methods in System Safety Engineering R Alexander, A Rae, M Nicholson Proceedings of the 5th IET System Safety Conference, October 2010 The State of Practice in System Safety Research Evaluation A Rae, M Nicholson, R Alexander, Proceedings of the 5th IET System Safety Conference, October 2010 Safety Lifecycle Activities for Autonomous Systems Development R Alexander, B Gorry, T Kelly 5th SEAS DTC Technical Conference, July 2010 A Case for Dynamic Risk Assessment in NEC Systems of Systems J M Aitken, R Alexander, T Kelly Proceedings of the 5th IEEE Conference on Systems of Systems Engineering, June 2010 2009 The Role of the Human in an Autonomous System R Alexander, N Herbert, T Kelly Proceedings of the 4th IET System Safety Conference, October 2009 Equivalence Arguments for Complex Systems Simulations - A Case-Study T Ghetiu, R Alexander, P Andrews, F Polac",
  "content_length": 12732,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:21"
}