{
  "name": "Rob A. Rutenbar",
  "homepage": "https://www.chancellor.pitt.edu/people/rob-rutenbar",
  "status": "success",
  "content": "Rob A. Rutenbar | Office of the Chancellor Skip to main content Rob A. RutenbarSenior Vice Chancellor for Research As senior vice chancellor for research, Rob A. Rutenbar provides strategic vision, leadership and partnership expertise to help University of Pittsburgh researchers and scholars advance their world-class research, scholarship and innovation. He directs the Pitt Research unit, which supports the full breadth of the University’s research enterprise — from pursuing and securing funding, through ensuring adherence to the highest standards of research conduct, to building collaborations that lead to successful commercialization. Since his arrival in 2017, Rutenbar has launched several initiatives, including the Pitt Momentum Funds, which support large-scale team science, and Pitt Big Proposal Bootcamp, which educates faculty about the unique logistics of securing center/institute-scale external support. He has rebuilt and modernized key components of the University’s policy ecosystem, including the conflict of interest and intellectual property policies. To enhance Pitt’s ability to transfer innovations to commercial use, Rutenbar launched LifeX Labs, which focuses on life sciences technologies, and the Office of Industry and Economic Partnerships, which aligns the University’s research expertise with industry partners to advance scientific and technological opportunities. He previously served as the Abel Bliss Professor of Engineering at the University of Illinois at Urbana-Champaign, where he also oversaw one of the nation’s largest and most highly ranked computer science departments. Prior to that, Rutenbar held the Stephen J. Jatras Chair in Electrical and Computer Engineering at Carnegie Mellon University, where he was on the faculty for 25 years. A serial entrepreneur, Rutenbar founded the tech firms Neolinear Inc. (acquired by Cadence in 2004) and Voci Technologies Inc. (acquired by Medallia in 2020). At Pitt, Rutenbar holds Distinguished Professor appointments in both the School of Computing and Information and the Swanson School of Engineering. His research focuses on tools for integrated circuit design, especially analog circuits, and hardware architectures for artificial intelligence. He has authored over 200 research publications and mentored more than 50 graduate students. Rutenbar is an elected Fellow of the Association for Computing Machinery and Institute for Electrical and Electronic Engineers (IEEE). He is a winner of the Semiconductor Research Corporation’s Aristotle Award, and the Phil Kaufman Award from the Electronic System Design Alliance and IEEE Council on Electronic Design Automation. Rutenbar is also among the top scientists to be elected both an American Association for the Advancement of Science Fellow and a National Academy of Inventors (NAI) Fellow. Election to NAI Fellow is the highest professional distinction for academic inventors. In 2024, Rutenbar was announced as the chair-elect of the Association of Public and Land-grant Universities (APLU) Council on Research. He will transition to full chair in November 2025. Rutenbar earned his bachelor’s degree in electrical engineering at Wayne State University and a master’s degree and doctorate in computer information and control engineering at the University of Michigan. Senior Leadership Team Vice Chancellor and Secretary of the Board of Trustees Phil Bakken Vice Chancellor for Government Relations and Advocacy David Brown Vice Chancellor for External Relations Lina D. Dostilio Chancellor Gabel's Chief of Staff Kimberlee Eberle-Sudré Vice Chancellor for Human Resources James W. Gallaher Jr. Director of Athletics Allen Greene Vice Chancellor and Chief Strategy Officer William Haldeman Vice Chancellor and Chief Information Officer Mark D. Henderson Provost and Senior Vice Chancellor Joseph J. McCarthy Vice Provost for Student Affairs Carla Panzella Vice Chancellor for Institutional Engagement and Wellbeing Clyde Wilson Pickett Executive Senior Vice Chancellor for Administration and Finance, Chief Financial Officer Dwayne Lee Pinkney Vice Chancellor for Communications and Marketing Rachel Decker Richelieu Senior Vice Chancellor for Research Rob A. Rutenbar Senior Vice Chancellor for the Health Sciences, John and Gertrude Petersen Dean of the School of Medicine Anantha Shekhar Senior Vice Chancellor and Chief Legal Officer Geovette Washington Senior Vice Chancellor for External Relations Kevin Washo",
  "content_length": 4465,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:18"
}