{
  "name": "Robbert Krebbers",
  "homepage": "http://robbertkrebbers.nl",
  "status": "success",
  "content": "About | Robbert Krebbers Robbert Krebbers AboutERC ProjectPublicationsTalksPhD ThesisScholar About I am associate professor (in Dutch: universitair hoofddocent, ius promovendi) and vice department head of the Department of Software Science of Institute for Computing and Information Sciences at Radboud University Nijmegen, The Netherlands. My research is centered around scaling up program verification techniques to challenging programming paradigms like concurrency, higher-order functions and modules, and applying these techniques to programming languages like C, Rust, and Scala. I like to build solid mathematical foundations and usable tools, preferably using the Rocq proof assistant. Together with Ralf Jung I am leading the Iris project: a framework for concurrent separation logic in Rocq. Iris has been deployed in a wide variety of verification projects, for many different programming languages, at many different institutes world-wide. Together with my Iris co-authors I received the 2023 Alonzo Church Award for Outstanding Contributions to Logic and Computation. Check out the Iris website for more information! I have received my PhD (cum laude) from Radboud University Nijmegen (2011-2015), have been a postdoc in the logic and semantics group at Aarhus University (2015-2016), and an assistant professor in the programming languages group at Delft University of Technology (2016-2020). Bachelor and master projects I am always looking for motivated bachelor and master students. If you are interested in a thesis project related to program languages (in particular, in the field of concurrency, language semantics, separation logic, and Rocq), do not hesitate to contact me. Professional service ECOOP'26 (PC co-chair), POPL'26 (Associate chair), ESOP'26 (PC chair), PLMW'25 (SC chair), LICS'25 (PC), ECOOP'25 (PC), CPP'25 (PC), MFPS'24 (PC), OOPSLA'24 (PC), ICFP'24 (PC), FoSSaCS'24 (PC), RADICAL'23 (PC), APLAS'23 (PC), PLDI'23 (PC), POPL'23 (PC), ESOP'23 (PC), CPP'23 (senior conference co-chair), PLMW'23 (senior co-chair), Iris'22 (lead organizer), ASL'22 (organizing committee), OOPSLA'22 (PC), CPP'22 (junior conference co-chair), PLMW'22 (junior co-chair), ESOP'21 (PC), FSCD'21 (PC), ICFP'20 (PC), PLMW'20 (co-organizer), CoqPL'20 (co-chair), PLNL'19 (PC), Iris'19 (co-organizer), Lorentz workshop \"Static Analysis Meets Program Logics\" (co-organizer), CoqPL'19 (co-chair), POPL'19 (PC), PLNL'18 (co-chair), HOPE'17 (PC), POPL'17 (ERC + AEC), CPP'17 (PC), Coq Workshop'16 (PC). PhD students and postdocs Current PhD students: Thomas Somers: daily advisor/promotor (second promotor: Herman Geuvers) Simcha van Collem: daily advisor/promotor (second promotor: Herman Geuvers) Philip Kaluđerčić: daily advisor/promotor (second promotor: Herman Geuvers) David Läwen: daily advisor/promotor (second promotor: Jorge Pérez) Former PhD students: Ike Mulder: daily advisor/promotor (second promotor: Herman Geuvers, 2020-2024, defended February 2025, now researcher at AWS) PhD thesis: Proof Automation For Fine-Grained Concurrent Separation Logic (graduated cum laude) Jules Jacobs: daily advisor/promotor (second promotor: Herman Geuvers, external co-advisor/co-promotor: Stephanie Balzer, 2019-2023, defended June 2024, now researcher at Jane Street) PhD thesis: Guarantees By Construction (graduated cum laude) Arjen Rouvoet: daily advisor/co-promotor (promotor: Eelco Visser, 2017-2021, defended October 2021, now senior researcher at TNO) PhD thesis: Correct By Construction Language Implementations (graduated cum laude) Jonas Kastberg Hinrichsen: external advisor (daily advisor at ITU: Jesper Bengtson, 2018-2021, defended June 2021, now assistant professor at Aalborg University) PhD thesis: Sessions and Separation Dan Frumin: daily advisor/first co-promotor (second co-promotor: Freek Wiedijk, promotor: Herman Geuvers, 2016-2020, defended March 2021, now assistant professor at Groningen University) PhD thesis: Concurrent Separation Logics for Safety, Refinement, and Security Former postdocs: Paolo Giarrusso (2019-2020, now formal methods engineer at BlueRock Security) Contact Email: (λ x y . mail @ x y . nl) robbert krebbers Office: Mercator 1, Office 1.17, Toernooiveld 214, Nijmegen Send snail mail/packages to: Dr. Robbert Krebbers Department of Software Science Institute for Computing and Information Sciences Faculty of Science Mailbox 47 PO Box 9010 6500 GL Nijmegen The Netherlands",
  "content_length": 4429,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:24"
}