{
  "name": "Robby",
  "homepage": "http://robby.santoslab.org",
  "status": "success",
  "content": "Robby's Homepage Robby Professor SAnToS Lab, Department of Computer Science, Kansas State University 2181 Engineering Hall, 1701D Platt Street, Manhattan, KS 66506, USA Phone/Fax: +1 (785) 532-6350/7353 E-mail: robby@k-state.edu Bib Sireum CIS 706/801 Recent Papers Stefan Hallerstede, Robby, John Hatcliff: Danvy's Mystery Functions in Slang. OlivierFest 2025 (to appear). John Hatcliff, Jason Belt, Robby, Clint McKenzie, Catalina Liang: End-to-End Formal Methods Integrated Development with SysMLv2 using HAMR. FMICS 2025 (to appear). Stefan Hallerstede, Robby, John Hatcliff, Jason Belt, David Hardin: Proof Engineering in Logika: Synergistically Integrating Automated and Semi-Automated Program Verification. FMICS 2025 (to appear). Robby, John Hatcliff, Jason Belt: Logika: The Sireum Verification Framework. FMICS 2024: 97-116. Stefan Hallerstede, John Hatcliff, Robby: Teaching with Logika: Conceiving and Constructing Correct Software. FMTea 2024: 106-123. John Hatcliff, Jason Belt, Robby, David Hardin: Integrated Contract-based Unit and System Testing for Component-based Systems. NFM 2024: 406-426. John Hatcliff, Robby, Jason Belt, Jacob Legg, Danielle Stewart, Todd Carpenter: Automated Property-based Testing from AADL Component Contracts. FMICS 2023: 131-150. Jason Belt, John Hatcliff, Robby, John Shackleton, Jim Carciofini, Todd Carpenter, Eric Mercer, Isaac Amundson, Junaid Babar, Darren Cofer, David Hardin, Karl Hoech, Konrad Slind, Ihor Kuz, Kent McLeod: Model-driven development for the seL4 microkernel using the HAMR framework. JSA 134: 102789, 2023. John Hatcliff, Danielle Stewart, Jason Belt, Robby, August Schwerdfeger: An AADL Contract Language Supporting Integrated Model- and Code-Level Verification. HILT 2022: 45-54. Hariharan Thiagarajan, John Hatcliff, Robby: Awas: AADL information flow and error propagation analysis framework. ISSE 18 (4): 485-504, 2022. Darren Cofer, Isaac Amundson, Junaid Babar, David Hardin, Konrad Slind, Perry Alexander, John Hatcliff, Robby, Gerwin Klein, Corey Lewis, Eric Mercer, John Shackleton: Cyberassured Systems Engineering at Scale. IEEE S&P: 2-14, 2022. Robby, John Hatcliff: Slang: The Sireum Programming Language. ISoLA 2021: 253-273. [presentation] John Hatcliff, Jason Belt, Robby, Todd Carpenter: HAMR: An AADL Multi-Platform Code Generation Toolset. ISoLA 2021: 274-295. [presentation] Hariharan Thiagarajan, John Hatcliff, Robby: Awas: AADL Information Flow and Error Propagation Analysis Framework. DETECT: 294-310, 2020.",
  "content_length": 2505,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:24"
}