{
  "name": "Roberto Palmieri",
  "homepage": "http://www.cse.lehigh.edu/~palmieri",
  "status": "success",
  "content": "Roberto Palmieri | PhD Home Activities Group Publications Teaching News Roberto Palmieri I am an Associate Professor in the Computer Science and Engineering Department at Lehigh University where I lead the SSS - Scalable Systems Software Research Group. My research focuses on different aspects of concurrency, synchronization, transactional memory, data structures, distributed computing, hererogeneous systems, in-memory key-value stores, fault tolerance, and distributed systems, spanning from theory to practice. I am passionate about designing and implementing synchronization protocols optimized for a wide range of deployments, from multicore architectures to cluster-scale and geo-distributed infrastructures. A Lehigh press article about my NSF CAREER: Optimizing Remote Direct Memory Access for a faster, more robust internet A Lehigh press article about our group: Roberto Palmieri: Getting in synch A Lehigh press article about one of our NSF project on concurrent data structors: Roberto Palmieri: A shortcut to a faster supercomputer I am pleased and honored to announce I have been awarded the NSF CAREER, titled \"Distributed Protocols and Primitives Optimized for RDMA Read/Write Operations in Data Management Systems\". Abstract available here. I serve as co-chair of the Distributed Consensus area of the new Journal of Systems Research (JSys). Read more about the mission of this project. Please consider submitting. I am always looking for motivated students who are enthusiastic about theory and practice of concurrency, synchronization, distributed systems, and/or any topic that falls into my areas of interest (see Research). Some Recent Publications: Jacob Nelson-Slivon, Lewis Tseng and Roberto PalmieriBrief Announcement: Asymmetric Mutual Exclusion for RDMAThe 36th International Symposium on Distributed Computing, DISC, October 25-27, 2022. Jacob Nelson, Ahmed Hassan, Roberto PalmieriBundled References: An Abstraction for Highly-Concurrent Linearizable Range Queries27th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming (PPoPP), April 2-6, 2022. Link Paper Haochen Pan, Jesse Tuglu, Neo Zhou, Tianshu Wang, Yicheng Shen, Xiong Zheng, Joseph Tassarotti, Lewis Tseng, Roberto PalmieriRabia: Simplifying State-Machine Replication Through RandomizationThe 28th ACM Symposium on Operating Systems Principles (SOSP), October 25-28, 2021. Link Paper dePaul Miller, Jacob Nelson, Ahmed Hassan, Roberto PalmieriKVCG: A Heterogeneous Key-Value Store for Skewed WorkloadsThe 14th ACM International System and Storage Conference (SYSTOR), June 14-16, 2021. Link Paper Masoomeh Javidi Kishi, Roberto PalmieriFW-KV: Improving Read Guarantees in PSIThe 22nd ACM/IFIP International Conference (Middleware), 6-10 December, 2021. Link Paper Jacob Nelson, Roberto PalmieriPerformance Evaluation of the Impact of NUMA on One-sided RDMA InteractionsThe 39th International Symposium on Reliable Distributed Systems (SRDS), September 21-24, 2020. Link Paper Masoomeh Javidi Kishi, Sebastiano Peluso, Hank Korth, Roberto PalmieriSSS: Scalable Key-Value Store with External Consistent and Abort-free Read-only Transactions The 39th IEEE International Conference on Distributed Computing Systems (ICDCS), 2019. Link Paper Roberto Palmieri, PhD -- he/him/his Associate Professor Computer Science and Engineering Lehigh University Building C 338 phone: +1 (610) 758-3623 email: \"palmieri\" at \"lehigh\" dot \"edu\" Recent News (All News) - Invited to serve as Program Committee member of IPDPS 2023. Consider to submit and attend! - Our paper \"Asymmetric Mutual Exclusion for RDMA\" has been accepted as a Brief Announcement at DISC 22. Congrats Jacob! - I will be the co-chair of the Program Committe of OPODIS 2022 along with Eshcar Hillel. Consider to submit and attend! - I have been promoted to Associate Professor with tenure. I'm grateful for the help and support received by many along my journey. - Our paper \"Bundled References: An Abstraction for Highly-Concurrent Linearizable Range Queries\" has been accepted paper at PPoPP 2022. Congrats Jacob! - Invited to serve as Program Committee member of SRDS 2022. Consider to submit and attend! - Invited to serve as Program Committee member of Eurosys 2022. Consider to submit and attend! - Our paper \"Rabia: Simplifying State-Machine Replication Through Randomization\" has been accepted at SOSP 2021. Congrats to the whole team! - I am pleased and honored to announce I have been awarded the NSF CAREER, titled \"Distributed Protocols and Primitives Optimized for RDMA Read/Write Operations in Data Management Systems\". Abstract available here. - Our paper \"KVCG: A Heterogeneous Key-Value Store for Skewed Workloads\" has been accepted at SYSTOR 2021. Congrats dePaul and Jacob! - Our paper \"FW-KV: Improving Read Guarantees in PSI\" has been accepted at MIDDLEWARE 2021. Congrats Masoomeh!",
  "content_length": 4875,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:27"
}