{
  "name": "Robert D. Montoya",
  "homepage": "http://robertdmontoya.com",
  "status": "success",
  "content": "Robert D. Montoya – Martin and Bernard Breslauer Professor in Bibliography, Associate Professor, UCLA Department of Information Studies & Director of California Rare Book School Skip to content Bibliography | Book History | Special Collections |International & Global Librarianship | Pedagogy | Justice & Ethics |Fulbright Specialist Robert D. Montoya, M.F.A, M.L.I.S., Ph.D., is the Martin and Bernard Breslauer Endowed Professor in Bibliography; Vice-Chair and Associate Professor in the UCLA Department of Information Studies; Director of UCLA California Rare Book School, and Director of the UCLA Library, Ethics, and Justice Lab. Montoya’s research trajectory focuses on special collections and rare books; global book history; and international library development and publishing; information representation and positionality; critical, ethical, and justice-oriented LIS work; and knowledge organization. He is an expert in rare books and print culture; library science and studies; library continuing education and pedagogy, international library development; and biodiversity informatics. (with a specific emphasis on museum environments). Dr. Montoya’s research examines the urgent role libraries must play in examining how imbalances in power within social structures impact the social agency and epistemic possibilities of individuals, communities, and ecological spaces. Montoya is a globally recognized expert in the implementation of library curriculum and programs in both the United States and abroad. He has experience working with large-scale international institutions to meet strategic needs. In partnership with the Fulbright program, he has maintained a six-year partnership with the National Library of Kosovo and the United States Embassy in Kosovo, to create a continuing-education program for the Kosovo’s libraries; worked through strategic and comprehensive professional plans; articulated a BA program in Library Studies; and executed workshops throughout the country on topics ranging from special collections, history of the book, collection development and management, digital collections, library management and administration, among many others.  In 2022, he was awarded top national prizes in Kosovo by the National Library and US Embassy in Kosovo for distinguished and impactful service to the National Library of Kosovo and in honor of his contributions to cultural heritage. His book with The MIT Press, Power of Position: Classification and the Biodiversity Sciences, describes and deconstructs how classification systems, data and information structures, and information work (including that done in libraries and museums), overtly and passively wield great power over the social and natural world. He is currently working on a monograph on the ethics of book, print, and manuscript culture in international library programing and development, tentatively titled, Bibliography, Print Culture, and Librarianship Across Borders: Ethics and Epistemic Power. He received his Ph.D. from the Department of Information Studies at UCLA; a M.L.I.S. with a specialization in Rare Books, Print and Visual Culture from UCLA, and a M.F.A in Creative Writing from Antioch University, Los Angeles. His work has been funded by UCLA; Mellon Foundation; The Ahmanson Foundation; National Science Foundation; Smithsonian National Museum of Natural history; U.S. State Department; U.S. Embassy, Kosovo; and the National Library of Kosovo. Montoya has extensive experience working in academic libraries and non-profit institutions. He’s held professional positions in special collections and archives since 2007. Most recently, until 2016, he was the Head of Public Services for Library Special Collections (LSC) at UCLA–ranked among the top ten academic research libraries in North America–where he led LSC’s reference, reader services, instruction, outreach, scholarly communication & publishing, and duplication services.",
  "content_length": 3944,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:35"
}