{
  "name": "Robert Sablatnig",
  "homepage": "https://cvl.tuwien.ac.at/staff/robert-sablatnig",
  "status": "success",
  "content": "Robert Sablatnig | Computer Vision Lab Skip to content Robert Sablatnig was born in Klagenfurt, Carinthia, Austria, in 1965. From 1992 to 2003 he was an assistant professor (Univ.Ass.), and from 2003 to 2010 an associate professor (ao Univ.Prof.) of computer vision at the Pattern Recognition and Image Processing Group. From 2005 to 2017 he was the head of the Institute of Computer Aided Automation. Since 2010 he is heading the Computer Vision Lab, which is part of the 2018 founded Institute of Visual Computing & Human-Centered Technology, which he is heading since 2019. His research interests are 3D Computer Vision including Range Finder, Stereovision, Shape from X, Registration, Calibration, Robot Vision, Machine- and Deep Learning for Computer Vision, Video data analysis (Motion and Tracking), Automated Document Analysis, Multispectral Imaging, Virtual- and Augmented Reality, and Applications in Industry and Cultural Heritage Preservation. He edited 17 conference proceedings and is author or co-author of more than 300 referred scientific publications published in journals, at several international conferences and workshops. He served in many program committees for international conferences and as member of the editorial board and referee for international journals and conferences; is Vice President of the Austrian Association for Pattern Recognition (AAPR/OAGM), the Austrian branch of IAPR and the IEEE and legally sworn and certified expert witness for computer vision (allgemein beeideter und gerichtlich zertifizierter Sachverständiger). Education Habilitation Vienna University of Technology, Applied Computer Science, 2003. Thesis title: Shape Based Machine Vision. Ph.D. Vienna University of Technology, Computer Science, with distinction, 1997. Thesis title: A Highly Adaptable Concept for Visual Inspection. Thesis advisor: Prof. W.G. Kropatsch M.S. Vienna University of Technology, Computer Science (Computer Graphics, Pattern Recognition and Image Processing), 1992. Thesis title: Das Lichtschnittverfahren, ein Verfahren zur Erfassung archäologischer Fundgegenstände. Thesis advisors: Prof. W.G.Kropatsch, Dr. A. Pinz B.S. Vienna University of Technology, Computer Science, 1988. AHS (High School) BG/BRG Lerchenfeldstrasse 22, Klagenfurt, 1983. Visiting Positions July – Sept. 1995 Rijksuniversiteit te Leiden, Netherlands, Institute of Advanced Computing (LIACS), High Performance Computing Division November 1998 Univerity of Lubljana, Computer Vision Lab (Prof. Solina). Scientific Organisations Since 1991 OAGM – Austrian Association for Pattern Recognition, which is part of the IAPR International Association for Pattern Recognition Since 1997 IEEE – The Institute of Electrical and Electronics Engineers, Inc. Current Teaching 2SE 183.125 Seminar (mit Bachelorarbeit) 2SE 183.152 Grundlagen methodischen Arbeitens 2VU 183.155 Anwendungen der Bildverarbeitung 2PV 183.294 Privatissimum aus Computer Vision 2SE 183.300 Seminar für DiplomandInnen 3SE 183.301 Dissertantenseminar 2SE 183.502 Scientific Presentation and Communication Address TU Wien Faculty of Informatics Institute of Visual Computing & Human-Centered Technology Computer Vision Lab Favoritenstr. 9/193-1 A-1040 Vienna, Austria Phone: +43-1-58801-193176 e-mail: sek@cvl.tuwien.ac.at for directions see about Teaching (NEW)Diploma thesis on human action and emotion recognition for an Empathic VehicleEnhancing RAG/LLM Solutions for Real Estate Data ProcessingImage Restoration Using Deep LearningMultilingual Speech Recognition for Low-Resource LanguagesSymbol Recognition in Images and Videos – Robust Methods for Complex ScenariosRESEARCH (NEWS)TXT – Language as a TraceMASLOTSSTeRniMARSURBISOpen PositionsDiploma thesis on human action and emotion recognition for an Empathic VehicleDiploma Thesis – Caring Robots // Robotic Care Data Privacy Statement",
  "content_length": 3863,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:10"
}