{
  "name": "Robert Best",
  "homepage": "https://pure.qub.ac.uk/en/persons/robert-best",
  "status": "success",
  "content": "Robert Best - Queen's University Belfast View Scopus Profile Robert Best Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer ScienceEnergy Power and Intelligent Control Phone+44 (0)28 9097 4159Emailr.bestqub.acuk Room 08.027 - Ashby TowerUnited Kingdom Accepting PhD StudentsPhD projectsDistribution network modernizationElectrical energy storageGrid integration of renewable generationPower system ancillary services and power system analysis 20052025 Research activity per year Personal profile Fingerprint Dive into the research topics where Robert Best is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Power Engineering Engineering 100% Battery Energy Storage Engineering 89% Electric Power Distribution Engineering 61% Storage System Computer Science 58% Networks Engineering 56% Electric Potential Engineering 53% Distribution Network Computer Science 52% Phasor Measurement Unit Computer Science 48% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2013 2013 2014 2015 2017 2020 2021 2023 2023 2 Finished 7 Active Projects per year R7518ECS: Identifying the Source of Very Low Frequency Oscillations for the All-Island Power SystemLiu, X. A. (PI) & Best, R. (CoI)04/10/2023 → …Project: Research R5279ECS: Identifying the Source of Very Low Frequency Oscillations for the All-Island Power SystemLiu, X. A. (PI) & Best, R. (CoI)27/09/2023 → …Project: Research R1591ECS: Challenges and Opportunities of Machine Learning & BESS for Oscillations Mitigation in Low Inertia Power Networks Liu, X. A. (PI) & Best, R. (CoI)17/11/2021 → …Project: Research R1147MEE: Queen's University Belfast Core Equipment Call 2019Price, M. (PI), Best, R. (CoI), Dessing, J. C. (CoI), Doumas, M. (CoI), Hamill, G. (CoI), Latu, I. (CoI), Morrow, D. J. (CoI), Riley, D. (CoI), Rodger, M. (CoI) & Taylor, S. (CoI)28/01/2020 → …Project: Research R6966ELE: SPIRE 2 - Storage Platform for the Integration of Renewable EnergyLiu, X. A. (PI), Best, R. (CoI), Foley, A. (CoI) & Morrow, D. J. (CoI)09/06/2017 → …Project: Research Battery Energy Storage 100% Storage System 77% Networks 61% Electric Power Distribution 51% Distribution Network 41% View all 9 projects Research output Research output per year 2005 2021 2025 42 Conference contribution 34 Article 13 Paper 4 Poster Research output per year Research output per year Clustering smart meter data for residential load profile analysisGreer, C., Liu, X. A. & Best, R., 19 Jun 2025, (Accepted) 2025 60th International Universities Power Engineering Conference (UPEC): Proceedings. Institute of Electrical and Electronics Engineers Inc.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Load Profile 100% Smart Meter 100% Energy Demand Management 33% Data Series 33% Pattern Detection 33% Dynamic mode decomposition analysis of very low frequency oscillations on the Irish gridMaclean, R., Liu, X. A., Best, R., Duggan, C., Kennedy, E., Doyle, R., McGowan, D. & Kennedy, J., 25 Feb 2025, 59th International Universities Power Engineering Conference: UPEC2024: Proceedings. Institute of Electrical and Electronics Engineers Inc., 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 34 Downloads (Pure) Fast and adaptive-MEMD for oscillation mode identificationMaclean, R., Liu, X. A. & Best, R., 10 Nov 2025, 2025 IEEE Power and Energy Society General Meeting: Proceedings. Institute of Electrical and Electronics Engineers Inc., 6 p. (IEEE Power and Energy Society General Meeting: Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Real Time 100% Detection Method 100% empirical mode decomposition 100% Empirical-Mode Decomposition 100% High voltage‑gain non‑isolated DC‑to‑DC converter design for microinverter applicationsAlrefai, M., Elkhateb, A. & Best, R., 26 Feb 2025, 2024 59th International Universities Power Engineering Conference (UPEC): Proceedings. Institute of Electrical and Electronics Engineers Inc., 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Inverter 100% 3 Downloads (Pure) Sectoral coupling pathway towards a 100% renewable energy system for Northern IrelandAhmed, F., Foley, A., McLoone, S., Best, R., Lund, H. & Al Kez, D., Mar 2025, In: Renewable and Sustainable Energy Reviews. 210, 114939.Research output: Contribution to journal › Article › peer-review Open AccessFile Renewable Energy System 100% Sectoral 100% Demand Side 50% Energy Systems 50% Electric Power Plant 50% 7 Citations (Scopus) 8 Downloads (Pure) View all 93 research outputs Prizes 2017 Premium Award for Best Paper in IET Generation, Transmission & DistributionLaverty, D. (Recipient), Best, R. (Recipient) & Morrow, D. (Recipient), 25 Aug 2017Prize: Prize (including medals and awards) Paper 100% Award 100% Premium 100% Research 100% Transmissions 100% Best Graduate Student Poster AwardMohamed, A. (Recipient), Best, R. (Recipient), Liu, X. A. (Recipient) & Morrow, D. J. (Recipient), 28 Jul 2021Prize: Prize (including medals and awards) Battery (Electrochemical Energy Engineering) 100% Best Paper AwardAhmed, F. (Recipient), Foley, A. (Recipient), McLoone, S. (Recipient), Best, R. (Recipient), Cameron, C. (Recipient) & Al Kez, D. (Recipient), 07 Nov 2022Prize: Prize (including medals and awards) File Best PhD Thesis Competition AwardMohamed, A. (Recipient), Best, R. (Recipient), Liu, X. A. (Recipient) & Morrow, D. J. (Recipient), Sept 2022Prize: Prize (including medals and awards) Competition 100% Thesis 100% Award 100% Integration 100% Electric Power Distribution 100% Primary Engineer - Silver MacRobert Medal AwardBrowning, J. (Recipient), Frost, S. (Recipient), Best, R. (Recipient) & Cosgrove, T. (Recipient), 19 Nov 2024Prize: Prize (including medals and awards) Activities Activities per year 2013 2015 2017 2018 2021 2022 6 Participation in conference 3 Publication peer-review 3 Invited or keynote talk at national or international conference 2 KTP &amp; Consultancy in kind 4 More 1 Work on advisory panel to industry or government or non-government organisation 1 PhD external examination 1 Hosting a school group or open day 1 Invited talk Activities per year Center for Power Electronics Annual Conference 2022Meshael, H. M. M. (Participant), Elkhateb, A. (Participant) & Best, R. (Participant)05 Jul 2022 → 06 Jul 2022Activity: Participating in or organising an event types › Participation in conference NIE Networks Technical Focus GroupBest, R. (Advisor)Nov 2021 → …Activity: Consultancy types › Work on advisory panel to industry or government or non-government organisation Low Frequency Oscillations on Ireland's Power SystemDuggan, C. (Presenter), Liu, X. A. (Advisor), Best, R. (Advisor) & Morrow, D. J. (Advisor)07 Sept 2021Activity: Talk or presentation types › Invited or keynote talk at national or international conference Integration of Battery Energy Storage Systems in Modern Distribution NetworksMohamed, A. (Invited speaker), Best, R. (Advisor), Liu, X. A. (Advisor) & Morrow, D. J. (Advisor)07 Sept 2021Activity: Talk or presentation types › Invited or keynote talk at national or international conference Novel approaches for detecting source of oscillation using PMU measurementsDuggan, C. (Presenter), Liu, X. A. (Advisor), Best, R. (Advisor) & Morrow, D. J. (Advisor)16 Jul 2021Activity: Talk or presentation types › Invited or keynote talk at national or international conference View all 18 activities",
  "content_length": 7970,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:29"
}