{
  "name": "Robert Soulé",
  "homepage": "https://cpsc.yale.edu/people/robert-soule",
  "status": "success",
  "content": "Robert Soulé | Professor | Yale Engineering Skip to Content Robert Soulé Associate Professor of Computer Science Additional Appointments Electrical & Computer Engineering Email Room / Office:Dunham 408 Office Address:10 Hillhouse Avenue New Haven, CT 06511 Mailing Address:P.O. Box 208285 New Haven, CT 06520 Website: Robert Soulé About Robert Soulé Degrees Ph.D., New York University B.A., Brown University Perspectives Networking, distributed systems, databases, and programming languages. Selected Awards & Honors USENIX Symposium on Networked Systems Design and Implementation (NSDI) Best Paper Award (2018) Google Faculty Research Award (2015) ACM International Conference on Distributed Event-Based Systems (DEBS) Best Paper Award (2012) Selected Publications The Case For In-Network Computing On Demand. Yuta Tokusashi, Huynh Tu Dang, Fernando Pedone, Robert Soulé, and Noa Zilberman. 2019 European Conference on Computer Systems (EuroSys '19), March 2019. p4v: Practical Verification for Programmable Data Planes. Calin Cascaval, Nate Foster, William Hallahan, Jeongkeun Lee, Jed Liu, Nick McKeown, Cole Schlesinger, Milad Sharif, Robert Soulé, and Han Wang. 2018 ACM SIGCOMM Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications (SIGCOMM '18), August 2018. NetChain: Scale-Free Sub-RTT Coordination. Xin Jin, Xiaozhou Li, Haoyu Zhang, Nate Foster, Jeongkeun Lee, Robert Soulé, Changhoon Kim, and Ion Stoica. 15th USENIX Symposium on Networked Systems Design and Implementation (NSDI '18), April 2018. Best Paper Award. Callinicos: Robust Transactional Storage for Distributed Data Structures. Ricardo Padilha, Enrique Fynn, Robert Soulé, and Fernando Pedone. USENIX Annual Technical Conference (USENIX ATC), June 2016. RailwayDB: Adaptive Storage of Interaction Graphs. Robert Soulé and Buğra Gedik. Very Large Data Bases Journal (VLDBJ), 25(2), March 2016. Related Content Making computing sustainable, with help from NSF grant",
  "content_length": 1982,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:11"
}