{
  "name": "Robert T. Loftin",
  "homepage": "https://www.sheffield.ac.uk/cs/people/academic/robert-loftin",
  "status": "success",
  "content": "Dr Robert Loftin | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Robert Loftin School of Computer Science Lecturer in Machine Learning Student Societies Officer Open staff member portrait in a modal window R.Loftin@sheffield.ac.uk +44 114 215 7542 Regent Court (DCS) Full contact details Dr Robert Loftin School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:https://orcid.org/0000-0001-9888-178X Google Scholar Profile Robert received his PhD in Computer Science from North Carolina State University in 2019, under the supervision of Dave Roberts. His dissertation examined the types of latent knowledge conveyed by human-provided feedback and demonstrations, and developed interactive learning algorithms which leverage models of human behavior to extract this information. He received his Bachelor's in Computer Science from Georgia Tech in 2011. After completing his PhD, he did a two-year post-doc with Microsoft Research Cambridge, exploring the use of Reinforcement Learning and Interactive Learning in commercial game development. He also completed a post-doc at TU Delft with Frans Oliehoek, where he focused on applying game theory and multi-agent reinforcement learning to human-AI cooperation.  Robert is currently a Lecturer in Machine Learning at the University of Sheffield. Research interests - Ad Hoc Human-AI Cooperation- Human-AI Alignment- Human-in-the-loop Machine Learning- Deep Reinforcement Learning- Multi-Agent RL- Human-Robot Interaction- AI for Games Publications Journal articles Peng B, MacGlashan J, Loftin R, Littman ML, Roberts DL & Taylor ME (2018) Curriculum Design for Machine Learners in Sequential Decision Tasks. IEEE Transactions on Emerging Topics in Computational Intelligence, 2(4), 268-277. Loftin R, Peng B, MacGlashan J, Littman ML, Taylor ME, Huang J & Roberts DL (2016) Learning behaviors via human-delivered discrete feedback: modeling implicit feedback strategies to speed up learning. Autonomous Agents and Multi-Agent Systems, 30(1), 30-59. Conference proceedings Loftin R, Bandyopadhyay S & Çelikok MM (2025) On the complexity of learning to cooperate in populations of socially rational agents. Proceedings of the 24th International Conference on Autonomous Agents and Multiagent Systems (pp 233-241). Detroit, Michigan, USA, 19 May 2025 - 19 May 2025. View this article in WRRO Loftin R, Çelikok MM, van Hoof H, Kaski S & Oliehoek FA (2024) Uncoupled learning of differential Stackelberg equilibria with commitments. Proceedings of AAMAS-2024 (pp 1265-1273). Auckland, New Zealand, 6 May 2024 - 6 May 2024. View this article in WRRO Aydeniz AA, Marchesini E, Loftin R & Tumer K (2023) Entropy Maximization in High Dimensional Multiagent State Spaces. 2023 International Symposium on Multi-Robot and Multi-Agent Systems (MRS) (pp 92-99), 4 December 2023 - 5 December 2023. Aydeniz AA, Loftin R & Tumer K (2023) Novelty Seeking Multiagent Evolutionary Reinforcement Learning. Proceedings of the Genetic and Evolutionary Computation Conference (pp 402-410) Loftin R & Oliehoek FA (2022) On the impossibility of learning to cooperate with adaptive partner strategies in repeated games. Proceedings of the 39th International Conference on Machine Learning, Vol. 162 (pp 14197-14209). Baltimore, MD, USA View this article in WRRO Loftin R, Saha A, Devlin S & Hofmann K (2021) Strategically efficient exploration in competitive multi-agent reinforcement learning. Proceedings of the Thirty-Seventh Conference on Uncertainty in Artificial Intelligence (UAI 2021), Vol. 161 (pp 1587-1596). Online, 27 July 2021 - 27 July 2021. View this article in WRRO Loftin R, Saha A, Devlin S & Hofmann K (2021) Strategically Efficient Exploration in Competitive Multi-agent Reinforcement Learning. 37th Conference on Uncertainty in Artificial Intelligence Uai 2021 (pp 1587-1596) Ciosek K, Vuong Q, Loftin R & Hofmann K (2020) Better exploration with optimistic actor-critic. Advances in Neural Information Processing Systems (NeurIPS 2019), Vol. 32. Vancouver, Canada, 8 December 2019 - 8 December 2019. View this article in WRRO Peng B, MacGlashan J, Loftin R, Littman ML, Roberts DL & Taylor ME (2017) Curriculum Design for Machine Learners in Sequential Decision Tasks. AAMAS'17: PROCEEDINGS OF THE 16TH INTERNATIONAL CONFERENCE ON AUTONOMOUS AGENTS AND MULTIAGENT SYSTEMS (pp 1682-1684) MacGlashan J, Ho MK, Loftin R, Peng B, Wang G, Roberts DL, Taylor ME & Littman ML (2017) Interactive Learning from Policy-Dependent Human Feedback. INTERNATIONAL CONFERENCE ON MACHINE LEARNING, VOL 70, Vol. 70 Peng B, MacGlashan J, Loftin R, Littman ML, Roberts DL & Taylor ME (2016) A Need for Speed: Adapting Agent Action Speed to Improve Task Learning from Non-Expert Humans. AAMAS'16: PROCEEDINGS OF THE 2016 INTERNATIONAL CONFERENCE ON AUTONOMOUS AGENTS & MULTIAGENT SYSTEMS (pp 957-965) Loftin R, MacGlashan J, Peng B, Taylor ME, Littman ML, Huang J & Roberts DL (2014) A Strategy-Aware Technique for Learning Behaviors from Discrete Human Feedback. PROCEEDINGS OF THE TWENTY-EIGHTH AAAI CONFERENCE ON ARTIFICIAL INTELLIGENCE (pp 937-943) Loftin R, Peng B, MacGlashan J, Littman ML, Taylor ME, Huang J & Roberts DL (2014) Learning Something from Nothing: Leveraging Implicit Human Feedback Strategies. 2014 23RD IEEE INTERNATIONAL SYMPOSIUM ON ROBOT AND HUMAN INTERACTIVE COMMUNICATION (IEEE RO-MAN) (pp 607-612) Smith E, Loftin R, Murphy-Hill E, Bird C & Zimmermann T (2013) Improving developer participation rates in surveys. 2013 6th International Workshop on Cooperative and Human Aspects of Software Engineering (CHASE) (pp 89-92), 25 May 2013 - 25 May 2013. Preprints Loftin R, Çelikok MM, Hoof HV, Kaski S & Oliehoek FA (2023) Uncoupled Learning of Differential Stackelberg Equilibria with Commitments. Research group Machine Learning research group",
  "content_length": 5941,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:12"
}