{
  "name": "Robert J. Full",
  "homepage": "https://ib.berkeley.edu/people/faculty/fullr",
  "status": "success",
  "content": "Robert J. Full | Integrative Biology Skip to main content Robert J. Full Professor of the Graduate School Email: rjfull@berkeley.edu Phone: (510) 642-9896 Lab Webpage: http://polypedal.berkeley.edu Full Contact Information >Research DescriptionMy primary interests reside in the area of comparative biomechanics and physiology. My research program quantifies whole animal performance in general and locomotion in particular as it relates to an animal's structure, physiology, and behavior. We use biomechanical, computer simulation (dynamic musculo-skeletal modeling), physical modeling (robot and artificial muscle construction), isolated muscle, biochemical, whole-animal exercise physiology and field-tracking techniques to seek general design principles for species which have evolved different solutions to the problems of locomotion and activity in general. The study of arthropod, amphibian and reptilian locomotion continues to offer an excellent opportunity for comparison. Animals such as crabs, cockroaches, ants, beetles, scorpions, centipedes, geckos and salamanders show tremendous variation in body shape, gas transport system, leg number, musculoskeletal arrangement and mode of movement. Diversity enables discovery. We use these \"novel\" biological designs as natural experiments to probe for basic themes concerning the relationship between morphology, body size, energetics, dynamics, control, stability, maneuverability, maximum speed and endurance. An understanding of the diverse biological solutions to the problems of locomotion contributes to the development of a general theory of energetics, neuro-mechanics and behavior. We collaborate closely with engineers, mathematicians and computer scientists by providing biological principles to inspire the design of multi-legged robots, artificial limbs and muscles, novel control algorithms, and self-cleaning, dry adhesives. Selected PublicationsHunt, N., Jinn, J., Jacobs, L.F., and Full, R.J. 2021. Acrobatic squirrels learn to leap and land on tree branches without falling. Science. 373, 697–700. Full, R.J., Bhatti, H.A., Jennings, P., Ruopp, R., Jafar, T., Matsui, J., Flores, L.A. and Estrada, M. 2021. Eyes toward tomorrow program enhancing collaboration, connections, and community using bioinspired design. Integrative and Comparative Biology. Nov;61 (5):1966-80. Full R.J., Dudley R., Koehl M.A., Libby T., Schwab C. 2015. Interdisciplinary laboratory course facilitating knowledge integration, mutualistic teaming, and original discovery. Integrative and Comparative Biology. Nov 1;55(5):912-25. Libby, T., T. Moore, E. Chang-Siu, D. Li, D. Cohen, A. Jusufi and R. J. Full. 2012. Tail assisted pitch control in lizards, robots and dinosaurs. Nature. 481, 181–184. doi:10.1038/nature10710. Sponberg, S., A. Spence, C. Mullens, and R. J. Full. 2011. A single muscle's multifunctional control potential of body dynamics for postural control and running. Phil. Trans. R. Soc. B. 366, 1592-1605 doi:10.1098/rstb.2010.0367. Holmes, P., Full, R.J., Koditschek, D. and Guckenheimer, J. 2006. Dynamics of legged locomotion: Models, analyses, and challenges. SIAM Review (SIREV) 48 (2), 207-304. Autumn, K., Liang, Y., Hsieh, T, Zesch, W., Chan, W.-P., T. Kenny, Fearing, R., and Full, R.J. 2000. Adhesive force of a single gecko foot-hair. Nature. 405,681-685. Altendorfer, A., N. Moore, H. Komsuoglu, M. Buehler, H.B. Brown Jr., D. McMordie, U. Saranli, R. Full, and D.E. Koditschek. 2002. RHex: A biologically inspired hexapod runner. Journal of Autonomous Robots 11:207-213. Dickinson, M.H., C.T. Farley, R.J. Full, M.A.R. Koehl, R. Kram, and S. Lehman. 2000. How animals move: An integrative view. Science 288:100-106. Full, R.J. and  Koditschek, D. E. 1999. Templates and anchors - Neuromechanical hypotheses of legged locomotion on land.  J. exp Bio. 202, 3325-3332.",
  "content_length": 3848,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:49"
}