{
  "name": "Robert Karam",
  "homepage": "https://cse.usf.edu/~rkaram",
  "status": "success",
  "content": "Welcome Research Interests My research interests lie at the intersection of energy-efficiency, reconfigurability, and hardware security. Specific application areas include: Energy-efficient reconfigurable computing: Energy-efficient design for FPGAs and FPGA-like reconfigurable fabrics; power and performance scalability, domain-specific architecture design Algorithms and hardware for bioimplantable devices: co-design of algorithms and digital hardware for improved area- and energy-efficiency in bioimplantables; biosignal processing; event detection and pattern recognition; algorithm tunability for individualized healthcare Hardware security in IoT: FPGA security, anti-piracy and anti-reverse engineering for bitstreams and configuration files; lightweight security solutions for ultraconstrained devices (IoT, wearables, implantables) Researchers interested or working in these and related areas are welcome to contact Prof. Karam to discuss potential research opportunities and collaborations. News Dr. Karam (PI), along with USF CSE faculty Dr. Katkoori and Dr. Mozaffari-Kermani, is awarded a NSF SaTC Education grant for $500,000 to design an accessible hardware security lab course and research the impact of gamification on student learning in the lab. PhD student Brooks Olney publishes an article in ACM TODAES, February 2020. PhD student Brooks Olney is awarded the A. Richard Newton Fellowship for attending the 2019 Design Automation Conference (DAC) in Las Vegas, NV, USA, June 2019. Interface Research Laboratory students Shakil Mahmud (PhD), Brooks Olney (PhD), and Farhath Zareen (MS) present research posters at the Florida Institute of Cybersecurity (FICS) Annual Conference (Gainesville, FL, USA), March 2019. Dr. Karam gives a lecture presentation at the 2018 Society for Pelvic Research (SPR) Annual Meeting on the topic of using dynamic time warping (DTW) for parameter optimization in a bladder event detection algorithm, December 2018. MS student Farhath Zareen publishes a conference paper in the 2018 Asian Hardware Oriented Security Conference (AsianHOST) on the topic of RTL Hardware Trojan Detection using Artificial Immune Systems, December 2018. MS student Farhath Zareen is awarded 3rd place in the Best Poster Competition at the 2018 Women in Hardware and System Security (WISE) workshop, co-located with the Hardware Oriented Security and Trust (HOST) conference (McLean, VA, USA), May 2018. PhD student Shakil Mahmud is awarded an NSF-sponsored travel grant to attend the 2018 IEEE VLSI Test Symposium (San Francisco, CA, USA), April 2018. Dr. Karam presents a poster titled \"Algorithm for Real-Time Event Detection from Bladder Sensor Data\" at the NIH SPARC Annual Meeting (Bethesda, MD, USA), May 2018. Interface Research Lab members Vishalini Ramnath (PhD), Shakil Mahmud (PhD), Farhath Zareen (MS), and Brooks Olney (BS) present a research poster at the Florida Institute of Cybersecurity (FICS) Annual Conference (Gainesville, FL, USA), February 2018. Article on algorithm and hardware design for low-cost compression and event detection in implantable medical device accepted in IEEE Transactions on Biomedical Circuits and Systems (Special Issue from BioCAS 2016).",
  "content_length": 3214,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:54"
}