{
  "name": "Roberta Sinatra",
  "homepage": "https://www.robertasinatra.com",
  "status": "success",
  "content": "Roberta Sinatra – Professor @ University of Copenhagen Skip to content UPDATE: link to apply for the PhD positions now live! I am pleased to announce two calls for multiple openings in my research group at the University of Copenhagen: one for Postdoctoral Researchers and another for PhD Students. These positions offer the chance to work on cutting-edge projects, collaborate with an international network of researchers, and contribute to a vibrant scientific community. Find more info and how to apply in the links below. Call for Postdocs positions in Network Science, AI, and Science of Science. Application deadline: 1st April 2025 Call for PhD positions Network Science, AI, and Science of Science. Application deadline: 21st April 2025 Join us in Copenhagen! Please contact me only if you have a specific question, otherwise just submit an application through the system. Thank you! I am on maternity leave until December 31st 2024 (thank you welfare state of Denmark!). I am checking emails only sporadically and will only answer in January 2025 unless the request is urgent and important. Contact the administration at SODAS for urgent matters! (My automatic responder is on, but it does not work properly if you are writing from a non-Microsoft email address) I am thrilled to share some wonderful news: I have been awarded the prestigious European Research Council (ERC) Consolidator Grant for my project “scAIence.” This grant is a testament to the hard work and dedication of my team and me in pushing the boundaries of scientific research. The ERC Consolidator Grant is a highly competitive and esteemed award, aimed at supporting groundbreaking research across all fields. The Vision of scAIence: At the heart of “scAIence” lies the ambition to critically assess how generative AI is reshaping the scientific discourse. The idea is that more and more scientific documents, like scientific articles, grants, and patents, are being (co-) written using generative AI, like the famous chatGPT. Yet, scientific documents are far from being used only to communicate scientific ideas – they are also used to quantify how science progresses, how social processes shape science, and how science shapes our society. If this AI-infused science is different from the human science we have so far, our measures, models, and interpretations based on scientific data need to be changed. In a nutshell, we need to quantify AI-infused science. Methodology and Interdisciplinary Approach: “scAIence” employs a novel methodological framework, leveraging large-scale databases and controlled experiments. Our approach is inherently interdisciplinary, drawing insights from fields as varied as NLP, network science, computational social science, and AI ethics. Potential Impact and Goals: Through “scAIence,” we aim to redefine how AI-generated content in science is understood and measured. The project seeks to offer a comprehensive overview of AI’s role in science, providing insights that could shape, among other things, future policies and practices in scientific research. This ERC Consolidator Grant is not just a recognition of our project’s potential but also a testament to the growing importance of AI in the scientific domain. As we embark on this exciting journey with “scAIence,” we remain committed to uncovering the opportunities and addressing the challenges posed by AI in reshaping the landscape of scientific research and communication. Acknowledgments: My heartfelt gratitude goes to the European Research Council for their support – they really embraced to support and to all collaborators who have contributed to the conception and development of the ideas behind “scAIence.” I look forward to advancing the frontiers of knowledge in this exciting and rapidly evolving field together with an amazing team of people. Today is one of those life milestones. One of those moments one awaits, even dreams of, for a large portion of adulthood. Today, I am happy and feel blessed. Yes, I have become a Full Professor! Why am I happy and blessed?I am from Southern Europe. I am a woman. Since I was 13, I was raised only by my mom with my two younger sisters. I am the second in my family to have a university degree, the first one to have a degree in the natural sciences, and the first one to have a PhD. I am a mom. And against all the odds – today I become a Full professor in Social Data science, at one of the oldest and most prestigious universities in Europe. There are a ton of people that contributed to what I am today, and that directly or indirectly shaped me and my path up to this moment and role. I will not name each person one by one, because there are too many – but you know who you are. And I am so grateful that I met you. There are also many people that helped me to understand what I do NOT want to be or become. You also indirectly shaped me. And I am grateful that this happened without blocking my journey to now and here. Finally, I know that some are thinking “What? Professor? She does not deserve it.” “She has only XX publications”. “She has only XX grants”. “She got the position because she is connected to XY.” “She is not nerdy enough for a position in Data Science”. “She does not know enough social sciences for a position in Social Data science”. These kinds of comments have occurred in the past, so I expect them to happen again. There is no shame or blame in thinking so, probably a few years back I would have thought the same of a different person, or perhaps even of my future self. But I learned the hard way, and today I can tell you that the world teaches us to value only the visible accomplishments, not the less visible ones or the missed ones, and their reasons. And this is the mission of my professorship: contribute to increasing the odds of becoming professors for more diverse people, and learn to value what is less visible, overcoming societal biases. You will read more about it. Ad Maiora! Find all the details in the dedicated post on the NERDS group page I got the Complex Systems Society Junior award! The ceremony took place in zoom, but I hope to be on stage in the future 🙂 I am one of the recipients of a Sapere Aude: Starting Grant. I will model bias mechanisms and use them to improve fairness. See a description here. For those who want to join, you can register for free 🙂 I am Associate Professor starting from today! 🙂 I kept a light travel schedule this spring, because of teaching, supervision, and to reduce CO2 emissions (yes, I factor that in my decisions now). Nevertheless I will do some trips. If you are around, come and say hi! Feb 11th: I will be at the University of Barcelona, giving an invited talk on “Women in Science” day Mar 16th: I will give an invited talk in the DPG March meeting – cancelled, due to the coronavirus pandemic May 2020: visiting ISI, in Turin – cancelled, due to the coronavirus pandemic Roberta SinatraShort Bio Roberta Sinatra is Professor in Social Data Science at the Center for Social Data Science, University of Copenhagen. She has also joint appointments at ITU Copenhagen, at ISI (Turin, Italy) and CSH (Vienna, Austria). She is one of the co-founding members of NEtwoRks, Data, and Society (NERDS) Research group at ITU. Her research is at the forefront of network science, data science, and computational social science. Google Scholar Bluesky LinkedIn Email How to find me Copenhagen Center for Social Data Science University of Copenhagen, Øster Farimagsgade 5 1353 Copenhagen K 2300 København, Denmark Office: bldg. 1, 2. floor, room 4 Search Search for: Search",
  "content_length": 7597,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:18"
}