{
  "name": "Roberto Sebastiani",
  "homepage": "http://disi.unitn.it/rseba",
  "status": "success",
  "content": "Roberto Sebastiani Watercolor portrait of myself painted by my mother Emilia Raffaelli Sebastiani in 1998. (Unfortunately, unlike Dorian Gray 's, it doesn't age in my place.) Roberto Sebastiani Full Professor (Professore Ordinario) of Artificial Intelligence, Automated Reasoning and Formal Methods. Dipartimento di Ingegneria e Scienza dell'Informazione (DISI), Università di Trento Sector: 09/H1, ING-INF/05. Contact me A more recent picture of myself (2nd from the left, with Donald Knuth and some other SAT'12 PC members) The following links refer to my job and research: Research interests Publications Curriculum Vitae (in English) Awards Education and past positions Boards, Committees, etc. Collaborations Automated reasoning and verification software Materiale Didattico/Teaching Material My students I'm part of the development team of OptiMathSAT, an Optimization Modulo Theories procedure. MathSAT, an SMT decision procedure. NuSMV2, a OBDD+SAT based Symbolic Model Checker. whilst the following refer to a more joyful side of my life: A much less serious photo of myself My Travel Photobook - beautiful places I've been Although you have surely met much better photographers than I am, my photograph \"Ragazza con bambino [Yemen, 2004]\" (\"Girl with child [Yemen, 2004]\") has won a prize at a national photography context in 2008. BLOG: Cronaca di un'adozione in Cambogia ( in italian ) My tiny contribution to international politics discussion (From \"Time\" Magazine, European Edition, December 12th, 2011) \"La cucina di mamma Seba\" ( in italian ) Consigli per gli acquisti (di libri) (my personal book review) -- in italian Nice quotes (in English or in Italian) Poetry Corner (mostly in italian ) Trento and Trentino, my home Official Disclaimer: these are informal pages, representing the opinions of the contributor, but not necessarily of his employer. The information is provided without any warranty. It is intended to be useful, but is certainly not always complete nor up-to-date. All \"Calvin and Hobbes\" materials is owned and copyrighted by Bill Watterson. All \"Dilbert\" materials is owned and copyrighted by Scott Adams. All \"Doonesbury\" materials is owned and copyrighted by Garry Trudeau.",
  "content_length": 2213,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:28"
}