{
  "name": "Robert Procter",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/rob_procter",
  "status": "success",
  "content": "Rob Procter Skip to main content Skip to navigation TITLES AND AFFILIATIONS Professor of Social Informatics, Department of Computer Science AI & ML Systems Alan Turing Institute for Data Science and AI Government Outcomes Lab, Blavatnik School of Government, Oxford University OECD AI expert group on AI incidents Algorithms, Data and Democracy College of Optometrists Artificial Intelligence Expert Advisory Group Observatory for Information Democracy, Forum for Information Democracy Rob.Procter@warwick.ac.ukRoom 2.32, Mathematical Sciences Building Department of Computer ScienceUniversity of WarwickTel: +44 (0) 24 7657 3783 RESEARCH INTERESTS Social informatics; data science methodologies and applications; trustworthy, ethical and safe AI; social media analytics; health informatics; computer-supported cooperative work (CSCW); participatory design; co-production; science and technology studies (STS); ethnography. RESEARCH PROFILE Social informatics is the study of factors that shape ICT adoption and use. For the past 15 years my research has focused on AI. This work is complemented by applying data science in the large-scale study of uses of social media, beginning when I led a multidisciplinary team working with the Guardian Newspaper on the Reading the Riots project, analysing tweets sent during the August 2011 riots. This work continued with funding from JISC, ESRC and EU Framework 7 and in my work as a Turing Fellow, where I co-lead the social data science interest group. I collaborated with Dr Alex Voss of St Andrews University and Wire Free Productions, an independent media company, on the BBC Radio 5 Live Hit List, a weekly show covering the top 40 stories in social media. My current AI and data science related research includes: methodologies and practices for the development of trustworthy, safe and ethical AI systems, with applications of AI in public services (e.g., healthcare), government and industry. These include decision-support tools in medical diagnostics, development of tools to assist in policy review and impact assessment, and in policy-making. I am a Co-I on two projects funded by UK RAI on AI ethics and safety, AdSoLve. and RAKE. I am also a member Project Bluebird, which is developing agent-based tools for air traffic control. Recent policy-oriented projects include creating machine learning tools to assist in evidence-based policy review (in collaboration with Ministry for Housing, Communities and Local Government), systematic reviewing and in peace dialogue process management. I was editor of the Health Informatics Journal from 2004-2020. Currently, I am a member of the advisory board of the Observatory for Responsible Research and Innovation in ICT (ORBIT), the Algorithms, Data and Democracy (ADD) project, the OECD AI expert group on AI incidents and the College of Optometrists Artificial Intelligence Expert Advisory Group. Finally, in 2023-24 I was Lead rapporteur on Information Ecosystems and Troubled Democracy, a synthesis of research on news media, AI and data governance, written for the Observatory for Information Democracy. RESEARCH GROUPS AI & Human-Centred Computing Warwick Institute for the Science of Cities Centre for Interdisciplinary Methodologies SELECTED RECENT PUBLICATIONS Procter, R., Rouncefield, M. (2025). Trustworthy AI: UK Air Traffic Control Revisited. UK AI Research Symposium. Alqazlan, L., Fang, Z., Castelle, M., & Procter, R. (2025). A novel, human-in-the-loop computational grounded theory framework for big social data. Big Data and Society. Procter, R., Rouncefield, M., & Tolmie, P. (2024). Everyday Diagnostic Work in the Histopathology Lab: CSCW Perspectives on the Utilization of Data-Driven Clinical Decision Support Systems. Journal of Computer-Supported Cooperative Work. Weiler, T., Paluch, R., Kirschsieper, D., Procter, R., Ortega Roman, D. H., Syed, H. A., ... & Müller, C. (2025). Negotiating Extra Work: A Reflection on Participatory Research Practices in Healthcare. In Proceedings of the 23rd Conference on Computer Supported Cooperative Work. European Society for Socially Embedded Technologies. Zhang, W., Gui, L., Procter, R., & He, Y. (2024). Multi-Layer Ranking with Large Language Models for News Source Recommendation. In Proceedings of the 47th International ACM SIGIR Conference on Research and Development in Information Retrieval (pp. 2537-2542). Bibizadeh, R., Procter, R., Girvan, C., Webb, H., & Jirotka, M. (2023). Digitally Un/Free: The everyday impact of social media on the lives of young people. Learning Media and Technology, 48. Procter, R., Catania, M. A., He, Y., Liakata, M., Zubiaga, A., Kochkina, E., & Zhao, R. (2023). Some Observations on Fact-Checking Work with Implications for Computational Support. Mediate workshop, International AAAI Conference on Web and Social Media, June. Procter, R., Rouncefield, M., & Tolmie, P. (2023). Holding AI to Account: Challenges for the Delivery of Explainable AI in Healthcare. ACM Transactions on Computer-Human Interaction, special issue on AI and healthcare. Procter, R. (2023). Developing Tools and Inter-disciplinary Collaboration for Digital Social Research. In W. Housley, A. Edwards, et al. (eds), Handbook of Digital Society, Sage. Arana Catania, M., van Lier, F., & Procter, R. (2022). Supporting peace negotiations in the Yemen war through machine learning. Data & Policy, 4. Tolmie, P., Procter, R., Rouncefield, M., Liakata, M., & Zubiaga, A. (2017). Microblog Analysis as a Programme of Work. ACM Transactions on Social Computing. Webb, H., Housley, W., Procter, R., Edwards, A., & Jirotka, M. (2017). The ethical challenges of publishing Twitter data for research dissemination. ACM Web Science Conference. Best paper award. Zubiaga, A., Voss, A., Procter, R., Liakata, M., Wang, B., & Tsakalidis, A. (2017). Towards Real-Time, Country-Level Location Classification of Worldwide Tweets. IEEE Transactions on Knowledge and Data Engineering. Tkachenko, N., Procter, R., & Jarvis, S. (2017). Predicting floods with Flickr tags. PLOS One. Tolmie, P., Procter, R., Rouncefield, M., Liakata, M., Zubiaga, A., Randall, D. (2017). Supporting the use of user generated content in journalistic practice. ACM Conference on Computer-Human Interaction (CHI). Best paper award. Wang, B., Liakata, M., Zubiaga, A., & Procter, R. (2016). TDParse-multi-target-specific sentiment recognition on Twitter. 15th Conference of the European Chapter of the Association for Computational Linguistics (EACL). Zubiaga, A., Kochkina, E., Liakata, M., Procter, R., & Lukasik, M. (2016). Stance classification in rumours as a sequential task exploiting the tree structure of social media conversations. Proceedings of 26th International Conference on Computational Linguistics (COLING), December, pp. 2438-2448. Tkachenko, N., Procter, R., & Jarvis, S. (2016). Predicting the impact of urban flooding using open data. Royal Society Open Science, 3(5), 160013. Zubiaga, A., Liakata, M., Procter, R., Hoi, G. W. S., & Tolmie, P. (2016). Analysing how people orient to and spread rumours in social media by looking at conversational threads. PloS one, 11(3), e0150989. Webb, H., Burnap, P., Procter, R., Rana, O., Stahl, B.C., Williams, M., Housley, W., Edwards, A. and Jirotka, M. (2016). Digital Wildfires: propagation, verification, regulation, and responsible innovation. ACM Transactions on Information Systems (TOIS), 34(3), p.15. Greenhalgh, T., Shaw, S., Wherton, J., Hughes, G., Lynch, J., Hinder, S., Fahy, N., Byrne, E., Finlayson, A., Sorell, T. and Procter, R. (2016). SCALS: a fourth-generation study of assisted living technologies in their organisational, social, political and policy context. BMJ open, 6(2), e010208. Procter, R., Wherton, J., Greenhalgh, T., Sugarhood, P., Rouncefield, M. and Hinder, S. (2016). Telecare call centre work and ageing in place. Computer Supported Cooperative Work (CSCW), 25(1), pp. 79-105. QUICK LINKS Projects Publications Alan Turing Institute Supervision Other activities Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 8368,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:04"
}