{
  "name": "Robert E. Fields",
  "homepage": "http://www.cs.mdx.ac.uk/people/bob-fields",
  "status": "success",
  "content": "Fields, Dr Bob – CS@MDX Skip to the content Close Menu Email: B.Fields @ mdx.ac.ukOffice: TG07 Town Hall Building, Hendon CampusPersonal Website About Associate Professor Courses: Research Interests Publications Repository Preventing suicides on the railways: learning from lived and living experiencesMackenzie, J.-M., Marsh, I., Fields, B., Kruger, I., Katsampa, D., Crivatu, I. and Marzano, L. 2025. Preventing suicides on the railways: learning from lived and living experiences. BMC Public Health. 25 (1). https://doi.org/10.1186/s12889-025-22744-xFormalizing federated learning and differential privacy for GIS systems in IIIfKammueller, F., Piras, L., Fields, B. and Nagarajan, R. 2025. Formalizing federated learning and differential privacy for GIS systems in IIIf. Garcia-Alfaro, J., Kalutarage, H., Yanai, N., Kozik, R., Ksieniewicz, P., Woźniak, M., Abie, H., Ranise, S., Verderame, L., Cambiaso, E., Ugarelli,, R., Praça, I., Katt, B.., Pirbhulal, S., Shukla, A., Pawlicki, M. and Choraś, M. (ed.) 3rd International Workshop on System Security Assurance. Bydgoszcz, Poland 19 - 20 Sep 2024 Springer. pp. 477-487 https://doi.org/10.1007/978-3-031-82362-6_28Designing for learnability: improvement through layered interfacesForsey, H., Leahy, D., Fields, B., Minocha, S., Attfield, S. and Snell, T. 2024. Designing for learnability: improvement through layered interfaces. Ergonomics in Design: The Quarterly of Human Factors Applications. https://doi.org/10.1177/10648046241273291Characteristics and circumstances of rail suicides in England 2019-2021: a cluster analysis and autopsy study  Norman, H., Marzano, L., Fields, B., Brown, S., MacDonald Hart, S. and Kruger, I. 2024. Characteristics and circumstances of rail suicides in England 2019-2021: a cluster analysis and autopsy study  . Journal of Affective Disorders. 354, pp. 397-407. https://doi.org/10.1016/j.jad.2024.03.020Patterns and motivations for method choices in suicidal thoughts and behaviour: qualitative content analysis of a large online surveyMarzano, L., Katsampa, D., Mackenzie, J., Kruger, A., El-Gharbawi, N., Ffolkes-St-Helene, D., Mohiddin, H. and Fields, B. 2021. Patterns and motivations for method choices in suicidal thoughts and behaviour: qualitative content analysis of a large online survey. BJPsych Open. 7 (2), pp. 1-6. https://doi.org/10.1192/bjo.2021.15An approach to human-machine teaming in legal investigations using anchored narrative visualisation and machine learningAttfield, S., Fields, B., Windridge, D. and Xu, K. 2019. An approach to human-machine teaming in legal investigations using anchored narrative visualisation and machine learning. Conrad, J., Pickens, J., Jones, A., Baron, J. and Henseler, H. (ed.) First International Workshop on AI and Intelligent Assistance for Legal Professionals in the Digital Workplace (LegalAIIA 2019).. Montreal, Canada 17 Jun 2019 CEUR Workshop Proceedings. pp. 7-11Factors deterring and prompting the decision to attempt suicide on the railway networks: findings from 353 online surveys and 34 semi-structured interviewsMarzano, L., Mackenzie, J., Kruger, A., Borrill, J. and Fields, B. 2019. Factors deterring and prompting the decision to attempt suicide on the railway networks: findings from 353 online surveys and 34 semi-structured interviews. The British Journal of Psychiatry. 215 (4), pp. 582-587. https://doi.org/10.1192/bjp.2018.303A resources model for distributed sensemakingAttfield, S., Fields, B. and Baber, C. 2018. A resources model for distributed sensemaking. Cognition, Technology and Work. 20 (4), pp. 651-664. https://doi.org/10.1007/s10111-018-0529-4MIRTO: an open-source robotic platform for educationAndroutsopoulos, K., Aristodemou, L., Boender, J., Bottone, M., Currie, E., El-Aroussi, I., Fields, B., Gheri, L., Gorogiannis, N., Heeney, M., Micheletti, M., Loomes, M., Margolis, M., Petridis, M., Piermarteri, A., Primiero, G., Raimondi, F. and Weldin, N. 2018. MIRTO: an open-source robotic platform for education. 3rd European Conference on Software Engineering Education. Seeon, Germany 14 - 15 Jun 2018 Association for Computing Machinery (ACM). pp. 55-62 https://doi.org/10.1145/3209087.3209106Behaviours preceding suicides at railway and underground locations: a multimethodological qualitative approachMackenzie, J., Borrill, J., Hawkins, E., Fields, B., Kruger, I., Noonan, I. and Marzano, L. 2018. Behaviours preceding suicides at railway and underground locations: a multimethodological qualitative approach. BMJ Open. 8 (4), pp. 1-8. https://doi.org/10.1136/bmjopen-2017-021076« Previous123...6Next » Address Department of Computer ScienceMiddlesex UniversityHendon Town HallThe BurroughsLondon NW4 4BT, United Kingdom Contact Us For enquiries about research collaboration & knowledge transfer, please contact Dr Aboubaker Lasebae. For postgraduate research enquiries (PhD & MRes), please contact Professor Juan Augusto. For undergraduate/postgraduate taught degrees (BSc & MSc), please contact the director of programmes Dr Serengul Smith.",
  "content_length": 5033,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:38"
}