{
  "name": "Robert M. Hierons",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/rob-hierons",
  "status": "success",
  "content": "Professor Rob Hierons | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Rob Hierons BA, PhD School of Computer Science Chair in Testing Member of the Testing research group Open staff member portrait in a modal window R.Hierons@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Rob Hierons School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-4771-1446 Profile Rob Hierons received a BA in Mathematics (Trinity College, Cambridge), and a Ph.D. in Computer Science (Brunel University). He then joined the Department of Mathematical and Computing Sciences at Goldsmiths College, University of London, before returning to Brunel University in 2000.He was promoted to full Professor in 2003 and joined The University of Sheffield in 2018. Research interests Professor Hierons’ research largely concerns software testing. The main aim of this research is to devise automated techniques (and tools) that generate efficient, systematic test suites on the basis of program code, models or specifications.Progress in this area can help industry to produce higher quality software and potentially to do so more quickly. He has recently become interested in the testing of autonomous systems, with a particular focus on robotics. Publications Books (2021) Software Engineering for Robotics. Springer International Publishing. Hierons RM & Mosbah M (2019) Preface. Hierons RM, Merayo MG & Bravetti M (2013) Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics): Preface. Groz R & Hierons RM (2004) Preface. Journal articles Hierons R, Merayo MG & Nunez M (2026) Combining sequential test cases into an equivalent set of adaptive test cases. Journal of Logical and Algebraic Methods in Programming, 148. View this article in WRRO Turker U, Hierons R, Mousavi MR & El-Fakih K (2025) Efficient state identification for finite state machine-based testing. IEEE Transactions on Software Engineering. View this article in WRRO Rafiq Y, James BA, Xu K, Hierons RM & Dogramadzi S (2025) Hybrid Control Strategies for Safe and Adaptive Robot-Assisted Dressing.. CoRR, abs/2505.07710. Foster M, Clark A, Wild C, Allian F, Turner R, Somers R, Latimer N, Walkinshaw N & Hierons RM (2025) The causal testing framework. Journal of Open Source Software, 10(107). View this article in WRRO Hierons RM & Mousavi MR (2025) Complete FSM Testing Using Strong Separability.. CoRR, abs/2502.04035. Hierons R (2025) Configuration testing of an artificial pancreas system using a digital twin: an evaluative case study. Software Testing Verification and Reliability, 35(2). View this article in WRRO Elgendy IT, Hierons RM & McMinn P (2025) A systematic mapping study of the metrics, uses and subjects of diversity‐based testing techniques. Software Testing, Verification and Reliability, 35(2). View this article in WRRO Gazda M & Hierons RM (2025) Model independent refusal trace testing. Science of Computer Programming, 239. View this article in WRRO Turker UC, Hierons RM, El-Fakih K, Mousavi MR & Tyukin IY (2024) Accelerating finite state machine-based testing using reinforcement learning. IEEE Transactions on Software Engineering, 50(3), 574-597. View this article in WRRO Clark AG, Foster M, Prifling B, Walkinshaw N, Hierons RM, Schmidt V & Turner RD (2024) Testing Causality in Scientific Modelling Software.. ACM Trans. Softw. Eng. Methodol., 33, 10:1-10:1. Turker UC, Hierons RM, Barlas G & El-Fakih K (2023) Incomplete adaptive distinguishing sequences for non-deterministic FSMs. IEEE Transactions on Software Engineering, 49(9), 4371-4389. View this article in WRRO Núñez M, Hierons R & Lefticaru R (2023) Implementation relations and testing for cyclic systems: adding probabilities. Robotics and Autonomous Systems, 165. View this article in WRRO Baxter J, Cavalcanti A, Gazda M & Hierons RM (2023) Testing using CSP Models: Time, Inputs, and Outputs.. ACM Trans. Comput. Log., 24, 17:1-17:1. Walkinshaw N & Hierons R (2023) Modelling second-order uncertainty in state machines. IEEE Transactions on Software Engineering, 49(5), 3261-3276. View this article in WRRO Mousavi MR, Cavalcanti A, Fisher M, Dennis L, Hierons R, Kaddouh B, Law E, Richardson R, Ringert JO, Tyukin I & Woodcock J (2023) Trustworthy autonomous systems through verifiability. Computer, 56(2), 40-47. View this article in WRRO Baxter J, Cavalcanti A, Gazda M & Hierons R (2023) Testing using CSP models: time, inputs, and outputs. ACM Transactions on Computational Logic, 24(2). View this article in WRRO Gazda M & Hierons R (2023) Removing redundant refusals: minimal complete test suites for failure trace semantics. Information and Computation, 291. View this article in WRRO Elgendy IT, Hierons RM & McMinn P (2023) A Survey of the Metrics, Uses, and Subjects of Diversity-Based Techniques in Software Testing.. CoRR, abs/2311.09714. Somers RJ, Douthwaite JA, Wagg DJ, Walkinshaw N & Hierons RM (2023) Digital-twin-based testing for cyber–physical systems: a systematic literature review. Information and Software Technology, 156. View this article in WRRO Hierons RM (2022) Farewell after an 11‐year journey as joint editor‐in‐chief. Software Testing, Verification and Reliability, 32(4). Hierons RM & Xie T (2022) Metamorphic testing and test automation. Software Testing, Verification and Reliability, 32(3). Hierons RM & Xie T (2022) Combinatorial testing and model‐based testing. Software Testing, Verification and Reliability, 32(2). Hierons RM & Xie T (2022) Model checking, testing and debugging. Software Testing, Verification and Reliability, 32(1). Patel K, Hierons R & Clark D (2022) An information theoretic notion of software testability. Information and Software Technology, 143. View this article in WRRO Hierons RM & Xie T (2021) Property generation/verification and empirical studies. Software Testing, Verification and Reliability, 31(8). Hierons RM & Xie T (2021) Adaptive or embedded software testing and mutation testing. Software Testing, Verification and Reliability, 31(7). Hierons RM & Xie T (2021) Editorial: Verification, reliability and performance. Software Testing, Verification and Reliability, 31(6). Hierons RM & Mosbah M (2021) Preface. Theoretical Computer Science, 880, 138-138. Turker UC, Hierons R & Jourdan G-V (2021) Minimizing characterizing sets. Science of Computer Programming, 208. View this article in WRRO Clark A, Walkinshaw N & Hierons R (2021) Test case generation for agent-based models : a systematic literature review. Information and Software Technology, 135. View this article in WRRO Hierons RM & Xie T (2021) Editorial: Testing, Debugging, and Defect Prediction. Software Testing, Verification and Reliability, 31(5). El-Fakih K, Hierons R & Turker UC (2021) Κ-branching UIO sequences for partially specified observable non-deterministic FSMs. IEEE Transactions on Software Engineering, 47(5), 1029-1040. Ibias A, Nunez M & Hierons RM (2021) Using mutual information to test from finite state machines: test suite selection. Information and Software Technology, 132. View this article in WRRO Nunez A, Canizares P, Nunez M & Hierons R (2021) TEA-Cloud: A formal framework for testing cloud computing system. IEEE Transactions on Reliability, 70(1), 261-284. View this article in WRRO Lefticaru R, Hierons R & Nunez M (2020) Implementation relations and testing for cyclic systems with refusals and discrete time. Journal of Systems and Software, 170. View this article in WRRO Hierons RM & Xie T (2020) Peer Reviewing in Software Engineering. ACM SIGSOFT Software Engineering Notes, 45(4), 18-18. Lima B, Faria JP & Hierons R (2020) Local observability and controllability analysis and enforcement in distributed testing with time constraints. IEEE Access, 8, 167172-167191. View this article in WRRO Hierons RM & Xie T (2020) On automation in software engineering. Software Testing, Verification and Reliability, 30(6). Hierons RM & Xie T (2020) Conference Virtualization. Software Testing, Verification and Reliability, 30(4-5). Cavalcanti A, Hierons RM & Nogueira S (2020) Inputs and outputs in CSP : a model and a testing theory. ACM Transactions on Computational Logic, 21(3). View this article in WRRO Hierons RM & Xie T (2020) Working Across Boundaries. Software Testing, Verification and Reliability, 30(3). Medina-Bulo I, Merayo MG & Hierons RM (2020) Guest Editorial: Special Section on ICTSS. Information and Software Technology, 118, 106222-106222. Hierons R, Li M, Liu X, Parejo JA, Segura S & Yao X (2020) Many-objective test suite generation for software product lines. ACM Transactions on Software Engineering and Methodology, 29(1). View this article in WRRO Patel K & Hierons RM (2019) A partial oracle for uniformity statistics. Software Quality Journal, 27(4), 1419-1447. Hierons RM (2019) The world changes. Software Testing, Verification and Reliability, 29(6-7). Clark D, Hierons R & Patel K (2019) Normalised squeeziness and failed error propagation. Information Processing Letters, 149, 6-9. View this article in WRRO Alberto I, Hierons R & Manuel N (2019) Using Squeeziness to test component-based systems defined as Finite State Machines. Information and Software Technology, 112, 132-147. View this article in WRRO Hierons R (2019) FSM quasi-equivalence testing via reduction and observing absence. Science of Computer Programming, 177, 1-18. View this article in WRRO Patel K & Hierons RM (2018) A mapping study on testing non-testable systems.. Software Quality Journal, 26(4), 1373-1413. View this article in WRRO Merayo MG, Hierons RM & Nunez M (2018) A tool supported methodology to passively test asynchronous systems with multiple users. Information and Software Technology, 104, 162-178. View this article in WRRO Aichernig BK, Furia CA, Gaudel M-C & Hierons R (2018) Special secti",
  "content_length": 63405,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:04"
}