{
  "name": "Roberto Cabral de Mello Borges",
  "homepage": "https://www.inf.ufrgs.br/site/docente/roberto-cabral-de-mello-borges",
  "status": "success",
  "content": "Roberto Cabral de Mello Borges - Instituto de Informática - UFRGS Contato Links úteisCiência da ComputaçãoEngenharia de ComputaçãoContatoLocalizaçãoWebmail Voltar para lista de docentes Roberto Cabral de Mello Borges Professor Associado Página Pessoal → CV LATTES → E-mail: *protected email* Telefone: +55 51 3308-6798 Prédio: 43425 Sala: 229 Qualificações Mestrado em Ciência da Computação - UFRGS-1998 1995-1997 Mestrado em Computação 1981-1983 Especialização em Engenharia da Energia 2008-2012 Doutorado em Informática na Educação 2011-2011 Doutorado em Educação de Adultos Áreas de Interesse Informática na Educação educação de adultos Minibiografia Prof. Cabral possui graduação em Engenharia Elétrica (opção Eletrônica), pela Universidade Federal do Rio Grande do Sul (1980) e especialização em Engenharia da Energia, também pela UFRGS (1983). Concluiu o mestrado em Ciência da Computação, em 1997, e o doutorado em Informática na Educação, em 2012, ambos pela UFRGS. Durante o doutorado, em 2011, realizou estágio na University of Wisconsin-Milwaukee, no tema educação de adultos.  Tanto no mestrado, pelo PPGC, como no doutorado, pelo PGIE, foi orientado pelo amigo e colega de longa data, José Valdeni de Lima, com quem ministra disciplinas até hoje. Cabral ingressou na UFRGS em 1973, atuando junto ao CPD. Em 1981, foi nomeado para o cargo de Professor, com atividades junto à Escola Técnica de Comércio e ao então Departamento de Informática, que deu origem ao nosso Instituto. Seus temas de interesse tem sido  Usabilidade, Ergonomia, Interação Humano-Computador, Web e Educação de Adultos e Idosos. Em sua vida acadêmica, Cabral também desempenhou muitas atividades administrativas. Dentre elas, foi Coordenador da Comissão de Extensão do INF, Chefe Substituto do Departamento de Informática Aplicada, membro do Conselho da Unidade, membro do Colegiado do Departamento de Informática Aplicada, membro da Comissão de Extensão e membro de algumas comissões temporárias. Uma das maiores contribuições de Cabral para o INF é a idealização do nosso Museu, em 1999, a partir de diversas peças que possuía.  Ao longo dos anos, com diversas doações, vem reunindo o acervo do que hoje é o \"Museu da Informática da UFRGS\", que desperta muita atenção a cada \"Portas Abertas\".  Além disso, seu conhecimento sobre a História da Computação sempre enriqueceu muitas conversas. Sua aposentadoria foi publicada no D.O.U de 05 de setembro de 2019.",
  "content_length": 2443,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:21"
}