{
  "name": "Robert Hoehndorf",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/robert-hoehndorf",
  "status": "success",
  "content": "Robert Hoehndorf - Associate Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Robert Hoehndorf Associate Professor, Computer Science Principal Investigator, Bio-Ontology Research Group Computer, Electrical and Mathematical Science and Engineering Division Research Platform Membership: The Bioinformatics Platform robert.hoehndorf@kaust.edu.sa Personal Website Program Affiliations Computer Science Bioengineering Bioscience Center of Excellence Center of Excellence for Generative AI Biography Robert Hoehndorf is an Associate Professor of Computer Science at King Abdullah University of Science and Technology (KAUST), where he is the principal investigator of the Bio-Ontology Research Group (BORG).Before joining the University in the fall of 2014, Professor Hoehndorf obtained his Ph.D. in Computer Science from the University of Leipzig, Germany, in 2009. Post-graduation, he spent several years in the U.K. as a research fellow and a research associate at Aberystwyth University and the University of Cambridge, respectively. He was also a postdoctoral fellow at the European Bioinformatics Institute, U.K. Research Interests Professor Hoehndorf’s main academic interests are knowledge representation, neuro-symbolic methods and their application in life sciences. He develops knowledge-based methods for analyzing large, complex and heterogeneous biological datasets and applies them to understanding genotype-phenotype relations.His group developed the DeepGO methods for protein function prediction, neuro-symbolic methods applicable to Semantic Web ontologies and knowledge graphs, and several approaches to represent, reason over, and predict genotype-phenotype relations. bioinformatics biomedical data knowledge representation Neuro-Symbolic AI neuro-symbolic methods Education Profile Ph.D., University of Leipzig, 2009M.Sc., University of Leipzig, 2005 Awards and Recognitions Bye Fellow (elected), Robinson College, University of Cambridge, 2022Leibniz AI Fellow, Leibniz University of Hannover, 2022 Show more Publications Hoehndorf, R., Queralt-Rosinach, N., “Data science and symbolic AI: Synergies, challenges and opportunities”. In: Data Science.Boudellioua, I., Mahamad Razali, R. B., Kulmanov, M., Hashish, Y., Bajic, V. B., Goncalves- Serra, E., Schoenmakers, N., Gkoutos, G. V., Schofield, P. N., Hoehndorf, R., “Semantic prioritization of novel causative genomic variants”. In: PLOS Computational Biology 13.4 (Apr. 2017), pp. 1–21.Hoehndorf, R., Schofield, P. N., Gkoutos, G. V., “Analysis of the human diseasome using phenotype similarity between common, genetic, and infectious diseases”. In: Scientific Reports 5 (June 2015), p. 10888.Robert Hoehndorf, Tanya Hiebert, Nigel W. Hardy, Paul N. Schofield, Georgios V. Gkoutos, and Michel Dumontier. \"Mouse model phenotypes provide information about human drug targets\". In: Bioinformatics (Oct. 2013).Robert Hoehndorf, Paul N. Schofield, and Georgios V. Gkoutos. \"PhenomeNET: a whole-phenome approach to disease gene discovery\". In: Nucleic Acids Research 39.18 (July 2011), e119. Show more Research Areas Computer Science Computational Bioscience Machine Learning Multimedia - ORCID - KAUST Academic Portal - KAUST Repository - X - Google Scholar - GitHub",
  "content_length": 3289,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:49"
}