{
  "name": "Robert West 0001",
  "homepage": "https://people.epfl.ch/robert.west",
  "status": "success",
  "content": "EPFL - Robert West Données administratives Robert West robert.west@epfl.ch +41 21 693 35 36 http://dlab.epfl.ch/people/west/ vCard Professeur associé, Laboratoire de science des données EPFL IC IINFCOM DLABINR 230 (Bâtiment INR)Station 141015 Lausanne +41 21 693 69 67 +41 21 693 35 36 Office: INR 230 EPFL › IC › IINFCOM › DLAB Professeur associé, SIN - Enseignement +41 21 693 35 36 EPFL › IC › IC-SIN › SIN-ENS Site web: https://sin.epfl.ch Professeur associé, SSC - Enseignement +41 21 693 35 36 EPFL › IC › IC-SSC › SSC-ENS Site web: https://ssc.epfl.ch Professeur associé, SODH - Enseignement +41 21 693 35 36 EPFL › CDH › CDH-SODH › SODH-ENS Membre de la commission du programme doctoral, Programme doctoral Humanités digitales +41 21 693 35 36 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDDH-GE Site web: https://go.epfl.ch/phd-eddh Professeur associé, EDIC - Enseignement +41 21 693 35 36 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDIC-ENS Professeur associé, EDEE - Enseignement +41 21 693 35 36 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDEE-ENS Prix et distinctions Enseignement et PhD Prix et distinctions Google 2017 International Conference on Web and Social Media 2023 Enseignement et PhD Current Phd Tim Ruben Davidson, Ivan Zakazov, Marija Sakota, Saibo Geng, Mohammad Hossein Amani Past Phd As Director Tiziano Piccardi, Kristina Gligoric, Akhil Arora, Lars Henning Klein, Valentin Hartmann, Manoel Horta Ribeiro, Martin Josifoski Past Phd As Codirector Ramtin Yazdanian Courses EECS Seminar: Advanced Topics in Machine Learning ENG-704 Machine learning CS-433 Les méthodes de l'apprentissage automatique deviennent de plus en plus importants dans de nombreuses sciences et applications. Dans ce cours, les principes fondamentaux et les méthodes d'apprentissage automatique seront introduits, analysés et pratiquement mis en œuvre. Topics in Computational Social Science (TopiCSS) CS-727 Back to top",
  "content_length": 1917,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:14"
}