{
  "name": "Robert Soden",
  "homepage": "http://robertsoden.io",
  "status": "success",
  "content": "Robert Soden I am an Assistant Professor at the University of Toronto working on climate informatics, human-centered computing (HCC), and science and technology studies (STS). My research uses a range of ethnographic, participatory, and design research methods to evaluate and improve the technologies we use to understand and respond to environmental challenges like disasters and climate change. My research is supported by a diverse network of funders including NSERC, SSHRC, NSF, NOAA, and the Natural Hazards Center. I coordinate the Toronto Climate Observatory. I am also a Faculty Affiliate at the Schwartz Reisman Institute for Technology and Society, the School of Cities, and an organizer of the University of Toronto's Critical Computing Group. Some recent publications include: Reimagining Environmental Data Optimizing Tropical Cyclone Risk Information Modes of Uncertainty in HCI Time for Historicism in CSCW: An Invitation - Best Paper at CSCW 2021 Dilemmas in Mutual Aid What We Speculate About When We Speculate About Sustainable HCI I have a PhD in Computer Science from the University of Colorado Boulder, a Master's Degree in Natural Resources and Sustainable Development from American University and Bachelors Degrees in History and Political Science from the University of Illinois, Chicago. Prior to starting my PhD, I was was a researcher at the The Center for Neighborhood Technology and the World Resources Institute, a software developer at Development Seed, and a consultant to the World Bank’s Global Facility for Disaster Reduction and Recovery (GFDRR). At GFDRR I launched the Open Data for Resilience Initiative, a worldwide effort to harness open data, open source software, and civic technology to improve disaster and climate risk management. I am also a co-founder and member of the Humanitarian OpenStreetMap Team, an international organization working towards creating a free and open map of the world for humanitarian and development purposes. While a PhD student at CU Boulder, I was also a visiting student researcher with University of California, Berkeley's Center for Science, Technology, Medicine, and Society, and a visiting researcher and lecturer with the Stanford Urban Resilience Initiative. Online: CV Google Scholar Linkedin Contact: soden@cs.toronto.edu Updates May 2023 - We will be hosting a workshop on HCI for Climate Change: Imagining Sustainable Futures at CHI 2023 in Hamburg, Germany. December 2022 - I was awarded a grant on incorporating equity into disaster and climate risk moldeing by the University of Toronto Data Sciences Institute. December 2022 - We received a grant to design and launch the Toronto Climate Summer School in 2024 from the UofT Learning & Education Advancement Fund. November 2022 - I traveled to Florianopolis, Brazil to present on equity in disaster risk assessment at the World Bank's Understanding Risk Forum. October 2022 - I was named Faculty Affiliate at the Schwartz Reisman Institute for Technology and Society. June 2022 - I was awarded a SSHRC Insight Development Grant for improving the design of severe weather risk communication technologies for people with visual impairments. January 2022 - I wrote a short piece for ACM Interactions on Reimagining Environmental Data. September 2021 - Our paper on historicism in CSCW has been awarded Best Paper (top 1% of submissions) in CSCW.",
  "content_length": 3382,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:07"
}