{
  "name": "Robert Laganière",
  "homepage": "http://www.site.uottawa.ca/~laganier",
  "status": "success",
  "content": "Robert Laganiere Robert Laganière Teaching | Research Professor Ph.D., P.Eng (OIQ) laganier@eecs.uottawa.ca room STE 5023 (613) 562-5800ext. 6707 School of Electrical Engineering and Computer Science Member of the VIVA Research lab My colleagues of the School List of publications Research interests Computer Vision Image and Video Analysis Visual Surveillance CSI2520 - Paradigmes de Programmation Hiver 2025 Présentation des principaux paradigmes de programmation: orienté objet, impératif, logique, fonctionnel. Langages de programmation correspondants, leurs propriétés essentielles et leurs applications typiques. Programmation avec langages impératifs, logiques et fonctionnels. Influence des paradigmes de programmation sur la résolution de problèmes et les stratégies de conception de programmes. Survol d'autres paradigmes tels que les programmations orientées contraintes, à base de règles, et événementielle. Préalable : CSI2510 ou CSI2610. »» Syllabus CSI 2510 : Structure de données et algorithmes Automne 2023 Types abstraits de données. Méthodes simples d analyse de complexité. Arbres. Recherche : arbres binaires, arbres équilibrés et hachage. Tris. Graphes et algorithmes simples pour graphes : parcours, arbre minimal recouvrant. Chaines, patrons et filtrage. Préalables : ITI1521, MAT1748. »» Syllabus CSI4533 - Méthodes informatisées en traitement d'images Hiver 2025 Représentation des images numériques. Éléments de perception visuelle. Géométrie des systèmes d'acquisition d'images. Amélioration d'images et restauration d'images. Segmentation et identification de primitives. Analyse des images à partir de leur contenu. Compression d'images et standard de compression. »» Syllabus CSI2772 - Concepts avancés en programmation C++ Automne 2020 Différences entre la programmation Java et la programmation C++. Pointeurs et gestion de la mémoire. Programmation orientée objet en C++. Entrée-sortie des fichiers et flux de données. Macros du préprocesseur. Classes génériques et bilbiothèque STL. Calcul numérique en C++. Interfacage avec le matériel. Applications d'ingénierie. Préalables : ITI1521, ITI1500 »» Syllabus SEG2505 - Introduction au Génie Logiciel Automne 2015 Les principes du génie logiciel : Requis, conception et tests. Revue des principes de l'orientation objet. Analyse orienté objet avec UML, des cadres de conception et des interfaces. Introduction à l'architecture client-serveur. Analyse, conception et programmation de clients et serveurs simples. Introduction à la technologie des interfaces utilisateurs. Préalables: ITI1521 ou ITI1621. »» Syllabus EECS | Faculty of Engineering | University of Ottawa 800 King Edward, Ottawa, ON, Canada, K1N 6N5",
  "content_length": 2694,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:59"
}