{
  "name": "Robert E. Kinicki",
  "homepage": "http://www.cs.wpi.edu/~rek",
  "status": "success",
  "content": "Bob Kinicki's Home Page Bob Kinicki Professor Emeritus Computer Science Department rek@wpi.edu As of July 1st 2016, I am a WPI CS Professor Emeritus. While officially retired, I remain involved with WPI through its Global Projects Program. In the C25 term I will serve as co-advisor with Professor Shockey for the Wellington Project Center in New Zealand. Additionally, I will serve as the advisor for the Wellington Project Center in D25. WPI President's 2020 IQP of the Year Zoom Presentations YouTube link LakeW's final New Zealand presentation: LakeW 2016 IQP Presentation with President's 2017 IQP Award Presentation Current: Activities | Undergraduate Global Projects Historic: Courses | Publications | Graduate Students | Undergraduate Projects I have a running bibliography of over 150 references concerning Wireless Sensor Networks at: WSN Bibliography 2013. Research Presentations prior to my retirement in July 2016: The Internet of Things: Introduction and Issues, Victoria University of Wellington Colloquium 16 February 2016 A Snapshot of IoT Puzzle Pieces with Focus on Trickle PEDS 23 November 2015 Review of 2014 Internet of Things Conference PEDS 13 October 2014 - Internet of Things Program Introduction to Internet of Things, CS Colloquium 15 March 2013 Observing Home Wireless Experience through WIFI APs, PEDS 18 November 2012 The Internet of Things, PEDS 5 December 2011 MAC Protocols for Health Care WSNs, PEDS 19 September 2011 Energy Analysis of Four Wireless Sensor MAC Protocols, ISWPC11, Hong Kong, February 2011 AS-MAC: An Asynchronous Scheduled MAC Protocol for Wireless Sensor Networks, PEDS 1 November 2010 Open Discussion of Mobile Operating Systems, PEDS 7 December 2009 Teaching Computing to Non-Majors CS Colloquium May 2008 Teaching Technology Fellowship Results Food for Thought April 2008 A Glimpse at Three Wireless Networking Problems CS Colloquium Oct 2007 Research Directions from MobiCom 2007 , PEDS 24 September 07 Wireless Dynamic Rate Adaptation , PEDS 26 March 07 \"Power Efficient System for Sensor Networks\", PEDS 18 September 06, Powerpoint WOC07 Montreal, May 2007 | P2MNet06 November 2006 | Performance Evaluation of Computer Networks November 2006 | Research Bytes October 2006 | EuroIMSA06 Euro IMSA Trip Report | EuroIMSA06 Innsbruck, Austria February 2006 | WMuNeP05 Montreal, Canada October 2005 | NOSSDAV05 Skamania, Washington June 2005 | Research Rugby November 2004 | Research Byte October 2004 | PEDS September 2004 | DMS04 September 2004 | IPCCC04 April 2004 | Networking Research PEDS October 2003 | NOSSDAV03 Monterey, Ca., June 2003 | IMW02 Marseille, France November 2002 | ISCC02 Taormina, Italy July 2002 | ICN01 Colmar, France July 2001 Recent Overseas IQP Advising Project Co-adviosr with Professor Wen-Hua Du for Taipei Project Center D24 Project Co-advisor with Professor Pollice for Cuenca Project Center D23 Project Co-advisor with Professor Danielski for Bucharest Project Center D22 Project Advisor for Prague, Czech Republic Project Center B22 Project Co-advisor with Professor Butler for Bucharest Project Center D21 Other Activities and Hobbies France Playing Basketball Playing Soccer NCAA Basketball Predictions Wine WPI Courses Teaching AY1516 | Teaching AY1415 | Teaching AY1314 | Teaching AY1213 | Teaching AY1112 | Teaching AY1011 Teaching AY0910 | Teaching AY0809 | Teaching AY0708 Teaching AY0607 | Teaching AY0506 | Teaching AY0405 Teaching AY0304 | Teaching AY0203 | Teaching AY0102 Last Few Courses Taught Advanced Computer and Communications Networks CS577/EE537 Computer Networks CS3516 Introduction to Computer and Communications Networks CS513 Advanced Computer Networks CS4516 Historic Courses Computer Networks CS4514 Operating Systems CS3013 Local Area Networks CS576/EE536 High Performance Networks C530/EE530 Basketball A set of CS faculty and students continue to play something that resembles basketball in Recreation Center on Mondays, Wednesdays and Fridays around the lunch hour. They welcome students to our games!! 50th Birthday Basketball Soccer A group of students and faculty play soccer on Tuesdays and Thursdays. When the weather permits we play on the football field beginning at noon. During the winter and under inclement weather, they play in Harrington Gym at noon. Spring 2015 Soccer Summer 2010 Soccer Last modified 20 December 2024 Robert E. Kinicki rek@wpi.edu",
  "content_length": 4382,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:38"
}