{
  "name": "Robert T. Collins",
  "homepage": "http://www.cse.psu.edu/~rtc12",
  "status": "success",
  "content": "Robert T. Collins Associate Professor Computer Science & Engineering Department The Pennsylvania State University Email: rcollins at cse dot psu dot edu Home Research Teaching Publications Software Students Background My research area is Computer Vision, with current emphasis on video scene understanding, human body segmentation, activity analysis, and real-time tracking. I teach courses in the CSE and EE departments at PSU on Computer Vision and Image Processing, and run the CSE Laboratory for Perception, Action and Cognition (LPAC). Since Jan 2005: Associate Professor, CSE Department, Penn State University. 1996-2004: Research Faculty, Robotics Institute, Carnegie Mellon University. 1994-1996: Postdoctoral Research Associate, University of Massachusetts at Amherst. 1994: Ph.D., CS Department, University of Massachusetts at Amherst. New Course Spring 2023 Recent News Invited keynote talk at 1st Joint BMTT-PETS Workshop on Tracking and Surveillance (held in conjunction with CVPR2017). Title of talk \"Tracking: Where has it been and where is it going?\" Area chair for CVPR2017 and CVPR2018. United States Patent 9,361,520 \"Method and system for tracking objects\" awarded June 7, 2016 to inventors Collins (PSU) and Carr (Disney Research). Serving on editorial board for IEEE T-PAMI On sabbatical, Fall 2013 and Spring 2014. Visiting CMU Robotics Institute. Gave invited keynote talk at 9th IEEE Workshop on Perception Beyond the Visible Spectrum (PBVS'13, held in conjunction with CVPR'13). Title of talk was Multi-frame Data Association with Higher-Order Cost Functions. TMS (Toronto Matching System) Program Coordination Chair for CVPR2013). Gave invited lecture on Video Tracking and Crowd Scene Analysis at VLPR 2012 in Shanghai China, July 2012. A web page for summer school participants that includes links to background reading material for the lecture can be found here . Served as area chair for CVPR2011, CVPR2012 and ACCV2012. Gave invited tutorial lecture, Online Learning for Tracking, at the 1st Sino-USA Summer School on Vision, Learning and Pattern Recognition (VLPR'09) in Beijing. Also gave a longer lecture on Fundamentals of Video Surveillance, the year after, at VLPR2010 in Xi'an. Serving on editorial board for IJCV Served as area chair for CVPR2009 and ICCV2009. Our new lab web page is up! Go to http://vision.cse.psu.edu/ Three patents were finally awarded for work we performed at CMU on the EyeVision system. United States Patent 7,027,083 \"System and method for servoing on a moving fixation point within a dynamic scene\" awarded April 11, 2006 to inventors Kanade, Collins, Amidi, Miller, and Hua. United States Patent 7,102,666 \"System and method for stabilizing rotational images\" awarded Sept 5, 2006 to inventors Takeo Kanade and Robert Collins. United States Patent 7,106,361 \"System and method for manipulating the point of interest in a sequence of images\" awarded Sept 12, 2006 to inventors Takeo Kanade and Robert Collins. In November 2005 I co-chaired a workshop on \"Computer Vision for Interactive and Intelligent Environments\" with Chris Jaynes from University of Kentucky. The proceedings is now available from IEEE Computer Society, ISBN 0-7695-2524-5. Read our introduction to learn more about the workshop topics and presentations.",
  "content_length": 3291,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:11"
}