{
  "name": "Roberto Yus",
  "homepage": "https://robertoyus.com",
  "status": "success",
  "content": "Roberto Yus Search Roberto Yus Assistant Professor University of Maryland, Baltimore County Biography I’m Roberto Yus, Assistant Professor at the Department of Computer Science and Electrical Engineering at the University of Maryland, Baltimore County. I’m leading the DAMS (DAta Management & Semantics) Research Group at UMBC. Previously, I was a Postdoctoral Researcher at the University of California, Irvine working with Prof. Sharad Mehrotra in the ISG group. My research interests concern Data Management, Knowledge Representation, the Internet of Things, and Privacy. Specifically semantic and privacy preserving data management in IoT environments. —> I’m looking for students to join my lab! More information Interests Data Management Knowledge Representation Internet of Things Privacy Education Postdoctoral Researcher, 2021 University of California, Irvine Ph.D. in Computer Science, 2016 University of Zaragoza, Spain Projects .js-id-Active Active All Internet of Things Data Management Semantic Web Privacy PrivacyLens Framework aimed at discovering, collecting, and analyzing privacy policies of smart devices using NLP and ML algorithms, to provide … SmartSpec SmartSPEC is a smart space simulator and data generator that creates customizable smart space datasets using semantic models of spaces, … Android goes semantic Semantic Web on smartphones FaceBlock Protecting individuals' privacy from eyewear technology Infoboxer Semantic tool to help create Wikipedia Infoboxes MultiCAMBA Multi-CAMera Broadcasting Assistant SemIoTic Facilitating the development of applications in IoT spaces SHERLOCK System for Heterogeneous mobilE Requests by Leveraging Ontological and Contextual Knowledge TIPPERS Testbed for IoT-based Privacy-Preserving PERvasive Spaces Recent Publications Quickly discover relevant content by filtering publications. Jun Ma, Aziz Boubaker, Sabrine Azaiez, Roberto Yus, Georgios Bouloukakis (2025). DEMO: Web-CozyBench - A Web-Based Platform to Benchmark Thermal Comfort Provision using Digital Twins. IEEE International Conference on Smart Computing (SmartComp). PDF Cite Code Jun Ma, Roberto Yus, Georgios Bouloukakis (2025). DigiGuide: A DT-based Occupant Guiding System for Optimizing Comfort and Energy Consumption. IEEE International Conference on Smart Computing (SmartComp). PDF Cite Code Dylan Conklin, Primal Pappachan, Roberto Yus (2025). BL(u)E CRAB: A User-Centric Framework for Identifying Suspicious Bluetooth Trackers. 23rd International Conference on Pervasive Computing and Communications (PerCom). PDF Cite See all publications Recent Talks Data Privacy 101 Data Protection can be viewed as the combination of Data Security, which focuses on protecting data from internal/external attackers, … Jun 29, 2023 Los Alamos National Lab (Don’t) Mind the Gap: Bridging the Worlds of People and IoT Devices The Internet of Things (IoT) has the potential to improve our lives through different services given the diversity of smart devices and … Jul 21, 2022 Data Works MD Project Project See all talks Awards, Achievements, & Highlights Highlights HuffPost (2022): Should I Click 'Allow Cookies' On Every Website That Asks? Publimetro (Mexico) (2022): Tus dispositivos inteligentes saben más de ti de lo que crees Let's Go There w/ Shira & Ryan -- Channel Q (2022): How your machines are spying on you The Conversation (2022): Smart devices spy on you – 2 computer scientists explain how the Internet of Things can violate your privacy The Washington Post (2020): The Technology 202: Tech to contain coronavirus on college campuses sparks fresh privacy concerns Defense Visual Information Distribution Service (2020): NAVWAR Trident Warrior Team Assesses New Tracking Technology for COVID-19 Mitigation Health IT Analytics (2020): UCI Uses Campus Wi-Fi to Test COVID-19 Contact Tracing App Military News (2019): Navy tests experimental technology at Trident Warrior 2019 UCI CS News (2018): IoT Hackathon Apps Coming Soon UCI CS News (2017): ICS launches IoT Hackathon to discover student talent who can develop a UCI ‘smart’ campus Nature (2015): What could derail the wearables revolution? Infodocket (2014): Interesting Research! FaceBlock App Allows Google Glass Users to Take Privacy-Aware Pictures 2nd place INCS-CoE Sandpit Challenge on Digital Trust 2022INCS-CoE May 2022 This is an international collaboration between University of Maryland Baltimore County (UMBC), Royal Holloway University of London (RHUL), and Keio University Tokyο (Keio). Mark Weiser Best Paper Award at PerCom 2022PerCom 2022 Mar 2022 For our paper SmartSPEC: Customizable Smart Space Datasets via Event-Driven Simulations. Student Travel AwardISWC (2015,2014), WI-IAT (2015), CollaborateCom (2014) Jan 2014 – Dec 2015 Predoctoral Mobility GrantSpanish Ministry of Science and Innovation Jun 2013 – May 2015 Received three times in 2013 (6 months), 2014 (4 months), and 2015 (4 months) for a total of $30K. Used to fund research visits at UMBC and UCI. FPI FellowshipSpanish Ministry of Science and Innovation Sep 2011 – Sep 2015 Contact ryus@umbc.edu 1000 Hilltop Circle, Baltimore, MD 21250 Information Technology and Engineering (ITE) Building Cite × Copy Download",
  "content_length": 5195,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:29"
}