{
  "name": "Robert Jenssen",
  "homepage": "https://uit.no/ansatte/robert.jenssen",
  "status": "success",
  "content": "Jenssen, Robert | UiT Robert.jenssen – Institutt for fysikk og teknologi | UiT Gå til hovedinnhold Enheten Ansatte Robert Jenssen Professor / Forskningsgruppa for maskinlæring / Direktør Visual Intelligence Institutt for fysikk og teknologi robert.jenssen@uit.no +4777646493 41699612 Tromsø Her finner du meg Robert Jenssen Om Forskning og undervisning Her finner du meg Stillingsbeskrivelse Jeg er direktør for Visual Intelligence. Dette er et Senter for Forskningsdrevet Innovasjon (SFI) innen kunstig intelligens finansiert for 8 år av Norges forskningsråd og et konsortium av private og offentlige partnere (prosjektnr. 309439). Vi er i den internasjonale frontlinjen innen forskning på dyp læring for bildeanalyse spesielt og multimodal læring generelt. Min hovedstilling er som Professor i Forskningsgruppa for maskinlæring ved UiT. Jeg er også ansatt som Adjunct Professor ved: Pioneer Centre for AI, University of Copenhagen & Norwegian Computing Center. For en kort CV, se \"Vedlegg\". Fremme vår felles framtid gjennom forskning Min motivasjon er å bidra til løsninger for de store samfunnsutfordringene i vår tid innen helse, marin kartegging, bedre utnyttelse av energiressurser og presis observasjon av jorda. Jeg har omfattende samarbeid med industri og offentlige aktører. Min metodologiske forskning har fokusert på emner som nevrale nettverk, informasjonsteoretisk læring, \"kjernemetoder\", ikke-styrt læring, selv-læring og forklarbar AI (XAI). Min forskning publiseres jevnlig innen de mest sentrale konferanser og journaler innen feltet (ICLR, ICML, NeurIPS, etc). Jeg har vært heldig å jobbe med mange dyktige kolleger, og sammen har vår forskning blitt anerkjent i feltet: Priser for forskning (og undervisning) Beste artikkel, Pattern Recognition Letters (2024) Dissertation Award, Norwegian Artificial Intelligence Society (Trosten, biveileder, 2023) Beste artikkel, Colour and Visual Computing Symposium (2022) Beste artikkel Int’l Medical Informatics Association (2018) Undervisningsprisen, Fakultet for naturvitenskap og teknologi, UiT (2018) Beste studentartikkel, Scandinavian Conference on Image Analysis (veileder) (2017) Vinner av IEEE GRS Society Letters Prize Paper Award (2013) Framhevet artikkel, IEEE Transactions on Pattern Analysis and Machine Intelligence (2010) Pris for Yngre Forsker Universitetet i Tromsø (deles ut annethvert år) (2007) Vinner av ICASSP Outstanding Student Paper Award (2005) Beste artikkel, Pattern Recognition Journal, Honourable Mention (2003) Internasjonalt lederskap (nåværende) Vitenskapelig rådgivningsstyre (Scientific Advisory Board - SAB) for Max Planck Institute for Intelligent Systems https://is.mpg.de I SAB for et av Frankrikes nye \"AI Excellence Clusters\" SequoIA, finansiert av France 2030 og under administrasjon fra French National Agency for Research (ANR) I SAB for DIREC - Digital Research Centre Denmark https://direc.dk Utvalgte artikler (Engelsk): Google Scholar Aggregation of Dependent Expert Distributions in Multimodal Variational Autoencoders. ICML 2025. https://openreview.net/forum?id=jYmGi1175R The Conditional Cauchy-Schwarz Divergence with Applications to Time-Series Data and Sequential Decision Making. IEEE TPAMI 2025. REPEAT: Improving Uncertainty Estimation in Representation Learning Explainability. AAAI 2025. https://arxiv.org/abs/2412.08513 Editor for Special Issue on Information Theoretic Methods for the Generalization, Robustness, and Interpretability of Machine Learning. IEEE TNNLS 2025. https://doi.org/10.1109/TNNLS.2025.3525991 Finding NEM-U: Explaining unsupervised representation learning through neural network generated explanation masks. ICML 2024. https://proceedings.mlr.press/v235/moller24a.html MAP IT to visualize representations. ICLR 2024. https://openreview.net/pdf?id=OKf6JtXtoy Cauchy-Schwarz divergence information bottleneck for regression. ICLR, 2024. https://openreview.net/pdf?id=7wY67ZDQTE ADNet++: A few-shot learning framework for multi-class medical image volume segmentation with uncertainty-guided feature refinement. Medical Image Analysis, 2023. https://doi.org/10.1016/j.media.2023.102870 Hubs and Hyperspheres: Reducing Hubness and Improving Transductive Few-Shot Learning With Hyperspherical Embeddings. CVPR, 2023. https://openaccess.thecvf.com/content/CVPR2023/html/Trosten_Hubs_and_Hyperspheres_Reducing_Hubness_and_Improving_Transductive_Few-Shot_Learning_CVPR_2023_paper.html On the Effects of Self-Supervision and Contrastive Alignment in Deep Multi-View Clustering. CVPR, 2023. https://openaccess.thecvf.com/content/CVPR2023/html/Trosten_On_the_Effects_of_Self-Supervision_and_Contrastive_Alignment_in_Deep_CVPR_2023_paper.html RELAX: Representation Learning Explainability. International Journal of Computer Vision, 2023. https://doi.org/10.1007/s11263-023-01773-2 ProtoVAE: A Trustworthy Self-Explainable Prototypical Variational Model. NeurIPS, 2022. https://openreview.net/forum?id=L8pZq2eRWvX Principle of Relevant Information for Graph Sparsification. UAI, 2022. https://proceedings.mlr.press/v180/yu22c.html Anomaly Detection-inspired Few-shot Medical Image Segmentation through Self-supervision with Supervoxels. Medical Image Analysis, 2022. https://doi.org/10.1016/j.media.2022.102385 Clinically Relevant Features for Predicting the Severity of Surgical Site Infections. IEEE Journal of Biomedical and Health Informatics, 2021. https://doi.org/10.1109/JBHI.2021.3121038 Measuring Dependence with Matrix-based Entropy Functional. AAAI, 2021. https://doi.org/10.1609/aaai.v35i12.17288 Reconsidering Representation Alignment for Multi-view Clustering. CVPR, 2021. https://openaccess.thecvf.com/content/CVPR2021/papers/Trosten_Reconsidering_Representation_Alignment_for_Multi-View_Clustering_CVPR_2021_paper.pdf Joint Optimization of an Autoencoder for Clustering and Embedding. Machine Learning, 2021. https://doi.org/10.1007/s10994-021-06015-5 Uncertainty-aware Deep Ensembles for Reliable and Explainable Predictions of Clinical Time Series. IEEE Journal of Biomedical and Health Informatics, 2020. https://doi.org/10.1109/JBHI.2020.3042637 SEN: A Novel Feature Normalization Dissimilarity Measure for Prototypical Few-Shot Learning Networks. ECCV, 2020. https://link.springer.com/chapter/10.1007/978-3-030-58592-1_8 Arbeider i Cristin Vitenskapelige artikler og bokkapitler Bøker og antologier Andre Thea Brüsch, Kristoffer Wickstrøm, Mikkel N. Schmidt, Robert Jenssen, Tommy Sonne Alstrøm : FLEXtime: Filterbank Learning to Explain Time Series Communications in Computer and Information Science (CCIS) 14. oktober 2025 DOI Teresa Dorszewski, Lenka Tětková, Robert Jenssen, Lars Kai Hansen, Kristoffer Knutsen Wickstrøm : From Colors to Classes: Emergence of Concepts in Vision Transformers 12. oktober 2025 DOI Rogelio Andrade Mancisidor, Robert Jenssen, Shujian Yu, Michael Kampffmeyer : Aggregation of Dependent Expert Distributions in Multimodal Variational Autoencoders Proceedings of Machine Learning Research (PMLR) 2025 Solveig Thrun, Stine Hansen, Zijun Sun, Nele Blum, Suaiba Amina Salahuddin, Kristoffer Wickstrøm m.fl.: Reconsidering Explicit Longitudinal Mammography Alignment for Enhanced Breast Cancer Risk Prediction Lecture Notes in Computer Science (LNCS) 20. september 2025 DOI Kristoffer Wickstrøm, Thea Brüsch, Michael Kampffmeyer, Robert Jenssen : REPEAT: Improving Uncertainty Estimation in Representation Learning Explainability | Proceedings of the AAAI Conference on Artificial Intelligence Proceedings of the AAAI Conference on Artificial Intelligence 11. april 2025 DOI Lars Uebbing, Harald Lykke Joakimsen, Luigi Tommaso Luppino, Iver Martinsen, Andrew McDonald, Kristoffer Wickstrøm m.fl.: Investigating the Impact of Feature Reduction for Deep Learning-based Seasonal Sea Ice Forecasting Proceedings of Machine Learning Research (PMLR) 2025 DOI Changkyu Choi, Arangan Subramaniam, Nils Olav Handegard, Ali Ramezani-Kebrya, Robert Jenssen : Leveraging Foundation Model Adapters to Enable Robust and Semantic Underwater Exploration 2025 ARKIV Shujian Yu, Hongming Li, Sigurd Eivindson Løkse, Robert Jenssen, Jose C. Principe : The Conditional Cauchy-Schwarz Divergence With Applications to Time-Series Data and Sequential Decision Making IEEE Transactions on Pattern Analysis and Machine Intelligence 2025 DOI Suaiba Amina Salahuddin, Elisabeth Wetzer, Kristoffer Wickstrøm, Solveig Thrun, Michael Kampffmeyer, Robert Jenssen : Assessing the Efficacy of Multi-task Learning in Mammographic Density Classification: A Study on Class Imbalance and Model Performance Lecture Notes in Computer Science (LNCS) 16. juni 2025 DOI Harald Lykke Joakimsen, Iver Martinsen, Luigi Tommaso Luppino, Andrew McDonald, Scott Hosking, Robert Jenssen : Interrogating Sea Ice Predictability with Gradients IEEE Geoscience and Remote Sensing Letters 2024 DOI / ARKIV Duy Khoi Tran, van Nhan Nguyen, Davide Roverso, Robert Jenssen, Michael Christian Kampffmeyer : LSNetv2: Improving weakly supervised power line detection with bipartite matching Expert Systems With Applications 2024 DOI / ARKIV Kaizhong Zheng, Shujian Yu, Baojuan Li, Robert Jenssen, Badong Chen : BrainIB: Interpretable Brain Network-Based Psychiatric Diagnosis With Graph Information Bottleneck IEEE Transactions on Neural Networks and Learning Systems 2024 DOI / ARKIV Bjørn Møller, Christian Igel, Kristoffer Knutsen Wickstrøm, Jon Sporring, Robert Jenssen, Bulat Ibragimov : Finding NEM-U: Explaining unsupervised representation learning through neural network generated explanation masks Proceedings of Machine Learning Research (PMLR) 2024 ARKIV / SAMMENDRAG / OMTALE Shujian Yu, Sigurd Eivindson Løkse, Robert Jenssen, Jose Principe : Cauchy-Schwarz Divergence Information Bottleneck for Regression International Conference on Learning Representations 2024 FULLTEKST Robert Jenssen, Kerstin Bach : Proceedings of the Symposium of the Norwegian AI Society 2025 CEUR-WS 2025 FULLTEKST Solveig Thrun, Stine Hansen, Zijun Sun, Nele Blum, Suaiba Amina Salahuddin,",
  "content_length": 15032,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:59"
}