{
  "name": "Roberto Martin Martin",
  "homepage": "https://robertomartinmartin.com",
  "status": "success",
  "content": "- Roberto Martín-Martín Skip to the content Roberto Martín-Martín Robotics, Computer Vision, Machine Learning Toggle mobile menu Toggle search field Search for: About me RobIN Lab Apply to RobIN Teaching, Talks, Events, CV, Bio Google Scholar Twitter Email me About me RobIN Lab Apply to RobIN Teaching, Talks, Events, CV, Bio Google Scholar Twitter Email me I’m an Assistant Professor of Computer Science at the University of Texas at Austin, where I lead the RobIn (Robot Interactive Intelligence) Lab, and an Amazon Scholar. My research bridges robotics, computer vision, and machine learning to enable robots to act safely and autonomously in human environments such as homes and offices. I’m fascinated by how to make machines perceive, learn, plan, and act—to transform their surroundings toward desired goals, robustly and safely, even under uncertainty. Humans do this effortlessly, and understanding how we perceive and decide often inspires my approach. I develop AI algorithms that combine reinforcement and imitation learning with planning and control, while addressing challenges in perception such as pose estimation, tracking, and scene understanding. My work spans mobile and whole-body manipulation, dexterous and contact-rich interactions, and long-horizon everyday tasks. Before joining UT Austin, I was a Postdoctoral Scholar at Stanford with Fei-Fei Li and Silvio Savarese and an AI Researcher at Salesforce AI. I earned my Ph.D. from Technische Universität Berlin under Oliver Brock and my B.Sc. from Universidad Politécnica de Madrid. My work has been recognized with awards including the RSS Best Systems Paper, ICRA Best Paper, IROS Best Mechanism, Amazon Faculty Award, RSS Pioneer, TRI Young Faculty Researcher, AAAI Young Faculty, and IJCAI Early Faculty distinctions. I currently serve as Chair of the IEEE/RAS Technical Committee on Mobile Manipulation, as an Editor for ICRA, CoRL, RSS, ICLR, IROS and IJRR, and as a co-founder of QueerInRobotics. Prospective students and applicants: due to the large number of requests, I may be unable to reply to your email. If you want to apply with my group, take a look here. © 2025 Roberto Martín-Martín Theme by Anders Noren — Up ↑",
  "content_length": 2204,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:31"
}