{
  "name": "Robert Robere",
  "homepage": "https://www.cs.mcgill.ca/~robere",
  "status": "success",
  "content": "Robert Robere Robert Robere about | announcements | advising | research | teaching | fun contact E-Mail: robert.robere@mcgill.ca Office: MC 309 McConnell Engineering Building McGill University Montréal, QC, Canada about me I am an Assistant Professor in the School of Computer Science at McGill University. I am a theoretical computer scientist, which means that I use mathematical tools to study what computation really \"is\". My main research topic is computational complexity theory, and particularly proof complexity, circuit complexity, communication complexity, and related topics. But this is not prescriptive, and I like to think about any fun problems that come my way! You can look at my curriculum vitae for more of my (professional) past life, if you're into that sort of thing. Otherwise, scroll on down to find my research papers, my graduate students, or my recent teaching. If you are a McGill undergraduate looking for advising from me, please read this first. announcements January 9, 2023. For the Spring semester 2023 I will be a research fellow at the Simons Institute for Theory of Computing at UC Berkeley, attending the program on Meta-Complexity. Due to this I will be away from McGill for the duration of the semester, but can still be reached via e-mail. September 13, 2022. This year I am returning as the head organizer of the Undergraduate Computer Science Research Symposium (UCORE) at McGill, which is our annual symposium for students in the School of Computer Science. If you are an undergraduate SOCS student who has participated in research over the past year then I strongly encourage you to submit to the symposium. Please see the UCORE website for more details. February 10, 2022. At FOCS 2021 I co-organized a workshop on recent progress in Propositional Proof Complexity. The schedule for the workshop is available, and the talks were recorded and are now publicly available. Of particular interest to many may be the following list of open problems in proof complexity, which were assembled by the speakers of the workshop and which we seek to distribute widely. recent research papers On Pigeonhole Principles and Ramsey in TFNP Siddhartha Jain, Jiawei Li, Robert Robere, Zhiyang Xun FOCS 2024. [ECCC] [ArXiV] Black-Box PPP is Not Turing-Closed Noah Fleming, Stefan Grosser, Toniann Pitassi, Robert Robere STOC 2024. [ECCC] Intersection Classes in TFNP and Proof Complexity Yuhao Li, William Pires, Robert Robere ITCS 2024. [DROPS] Colourful TFNP and Propositional Proofs Ben Davis and Robert Robere. CCC 2023. [ECCC] On Low End Obfuscation and Learning Elette Boyle, Yuval Ishai, Pierre Meyer, Robert Robere, Gal Yehuda. ITCS 2023. [DROPS] Separations in Proof Complexity and TFNP Mika Göös, Alexandros Hollender, Siddhartha Jain, Gilbert Maystre, William Pires, Robert Robere, Ran Tao. FOCS 2022. [ECCC] Journal of the ACM (2024). [ACM DL] Further Collapses in TFNP Mika Göös, Alexandros Hollender, Siddhartha Jain, Gilbert Maystre, William Pires, Robert Robere, Ran Tao. CCC 2022. [ECCC] [DROPS] Contributed presentation at HALG 2022. SIAM Journal of Computing (2024). [SIAM] [all research papers] the lab Ben Davis, PhD Student (2024-Present). Svetla Vassileva, MSc Student (2023-Present). John Ahmed Dellas, PhD Student (2022-Present). Stefan Grosser. PhD Student (2021-Present). long-term visitors Jiawei Li , UT Austin. (Summer 2024). Erfan Khaniki, Institute of Mathematics of the Czech Academy of Sciences. (Fall 2023). Yuhao Li, University of Columbia. (Summer 2023). current and future teaching Fall 2024: COMP 360 - Algorithm Design (Administered through myCourses) Fall 2024: COMP 604 - Graduate School Fundamentals (Administered through myCourses, co-taught with Paul Kry and Siva Reddy) Winter 2024: COMP 532 - Propositional Proof Complexity (Administered through myCourses) fun facts - I was born and raised in St. John's, Newfoundland, which is the best place on earth. When I was 22 I moved away for graduate school and, as you can see from the picture, this was obviously a mistake. - Speaking of which, you might be looking for my Dad — also named Robert Robere — who is a house designer in St. John's. His website is here. - I do a lot of rock climbing! I'm even on Mountain Project (light blue shirt). Places I've climbed include: Red Rocks, Yosemite, Utah, The New River Gorge, The Gunks, Newfoundland, and essentially every crag in Southern Ontario and around Princeton, NJ. - Before graduate school I was heavily involved in theatre. As a student I performed with (and then later taught many workshops for) the Canadian Improv Games in Newfoundland. I was also a founding member of the theatre group Stanley Braxton, which is still running today! words of wisdom beast on my brain, every thought is the same if the beast is controlled, it'll never turn gold and that's just fine we don't own the world around us",
  "content_length": 4878,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:06"
}