{
  "name": "Roberto Pereira 0002",
  "homepage": "https://web.inf.ufpr.br/rpereira",
  "status": "success",
  "content": "RPereira – DInf/UFPR - Prof. Roberto Pereira Skip to content Recent PostsArchives Professor and researcher at the Department of Informatics, Federal University of Paraná (UFPR), Curitiba, Brazil.  From 2015 to 2023, I have served as Associate Editor for the Brazilian Journal on Computers in Education, Editor-in-Chief of the Horizontes Magazine, and as a member of the special Human Computer Interaction (IHC) committee in Brazil (2016-2021). Currently, I am serving as: Editor-in-Chief of the Journal on Interactive Systems (JIS)(2020-), Associate Editor of the ACM Journal on Responsible Computing (2022-), and Coordinator of the UFPR’s Graduate Program in Computer Science. Research areas: Human-Computer Interaction, Computing Education, Social Software, Computational Thinking, Human Values and Culture in Interactive Systems Design, Sociotechnical Systems. Profiles: DBLP Google Scholar Lattes (Portuguese only) LinkedIn ORCID ResearchGate Contact: rpereira inf ufpr br Department of Computer Science, Office room 87. Phone: +55 41 3361 3685 Rua Cel. Francisco H. dos Santos, 100 Centro Politécnico, 81531-980 Curitiba, Paraná, Brazil. Ten SELECTED publications: Baranauskas, M., Pereira, R., & Bonacin, R. Socially Aware Systems Design: A Perspective Towards Technology-society Coupling. AIS Transactions on Human-Computer Interaction, 16(1), 80-109. 2024. https://doi.org/10.17705/1thci.00201 Ascari, REOS, Silva L, Pereira R. MyPGI-a methodology to yield personalized gestural interaction. Universal Access in the Information Society. 2023 Jan 3:1-26. Pereira, R., Reis, R., Derenievicz, G., Peres, L. M., Silva, F. Sua Jornada Começa Aqui: gamificando uma disciplina introdutória de computação com uma narrativa distópico-crítica. Revista Brasileira de Informática na Educação, [S. l.], v. 31, p. 1128–1164, 2023. [in Portuguese] Choma, J., Guerra, E.M., Alvaro, A., Pereira, R. and Zaina, L., Influences of UX factors in the Agile UX context of software startups. Information and Software Technology, 152, p.107041. 2022. Ortiz, J. S., Moreira, C., Menezes, K., Ferrari, B., Silva Junior, D., & Pereira, R.  Computational Thinking and Mental Models: Promoting Digital Culture in the Youth and Adult Education. Interacting with Computers. 2022. Pereira, R. Dez Pontos que Precisamos Discutir e Repensar na Pós-Graduação Pública. Revista de Educação Pública. Vol. 31. pp. 1-26. 2022. [in Portuguese] Piccolo, L.S. and Pereira, R., Culture-based artefacts to inform ICT design: foundations and practice. AI & SOCIETY, 34(3), pp.437+453. 2019. Pereira, R., Baranauskas, M.C.C. and Liu, K., An Essay on Human Values in HCI. Journal on Interactive Systems, 9(1), pp. 4-16. 2018. Pereira, R., Baranauskas, M.C.C. A value-oriented and culturally informed approach to the design of interactive systems. International Journal of Human-Computer Studies 80: 66-82. 2015. Baranauskas, M.C.C., de Souza, C.S, Pereira, R. I GranDIHC-BR — Grand Research Challenges in Human-Computer Interaction in Brazil. Brazilian Computer Society. 2015. Partners InterHAD – Human-Digital Artifact Interaction Research Group, University of Campinas. Coordinated by Cecilia Baranauskas. SERG.UFF – Semiotic Engineering Research Group, Fluminense Federal University. Coordinated by Luciana Salgado. User eXperience –  Laboratory of Studies in Networks, Innovation and Software, Federal University of São Carlos. Coordinated by Luciana Zaina. Carleen Maitland, Penn State Univeristy, collaboration in ICT and humanity issues research. NEPP – Núcleo de Estudos em Políticas Públicas (Studies on Public Policy), University of Campinas. Federal University of Paraná, Centro Politécnico. Curitiba, Paraná, Brazil.",
  "content_length": 3687,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:36"
}