{
  "name": "Robert D. Kent",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1037/dr-robert-kent",
  "status": "success",
  "content": "Dr. Robert Kent | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Robert Kent Dr. Robert Kent Professor 519-253-3000 ext. 2993 rkent@uwindsor.ca Office: 5100 LT Education: Ph.D. (1979, University of Windsor, Canada) M.Sc. (1974, University of Windsor, Canada) B.Sc. (1972, University of British Columbia, Canada) Research Interests: Modeling for Decision Support Systems, Reasoning with Uncertainty, Subjective Logic, Conceptual Spaces, Conceptual Reasoning Health Informatics, Application Development in Healthcare, Self-management Systems in Healthcare Grid computing, High-Performance Computing and Networking Security, Network Forensics Theoretical spectroscopy, Unitary Group Approach, Scientific Computing Professional & Community Affiliations: Member, The Sandbox Project – Brain Injury Prevention Group Reviewer, Physical Review A Reviewer, Physical Review D Reviewer, Physical Review Letters Reviewer, Journal of Physics A Reviewer, The Canadian Journal of Physics Reviewer, Journal of the Electrochemical Society Reviewer, Journal of Computational Physics Selected Publications: Janaswamy, Sreya; Kent, Robert D., Semantic Interoperability and Data Mapping in EHR Systems, 2016 IEEE 6th International Conference on Advanced Computing (IACC), 117-122, 2016, IEEE Conference Publishing Services (CPS), 6th IEEE International Advance Computing Conference (IACC - 2016), 27-28 February 2016, S R K R Engineering College, Bhimavaram, Andhra Pradesh, India. Baert, Todd; McKay, Phillip; Carriveau, Rupp; Ting, David; Kent, Robert D., Windtelligence: the development of a wind farm performance management system, North American Wind Energy Academy 2015 Symposium (NAWEA 2015), North American Wind Energy Academy, U.S. Dep't of Energy, 2015, June, Blacksburg, Virginia, June 9-11, 2015. Snowdon, Anne; Hussein, Abdulkadir; Kent, Robert; Pino, Lou; Hachinski, Vladimir, Comparison of an Electronic and Paper-Based Montreal Cognitive Assessment Tool, Alzheimer Dis Assoc Disord., 29(4), 325-9, 2015, October. Kobti, Ziad; Snowdon, Anne W.; Kent, Robert D.; Bhandari, Gokul; Rahaman, Shamual F.; Preney, Paul D.; Kolga, Carol A.; Tiessen, Barbara; Zhu, Lichun, Towards a Just-in-Time Distributed Decision Support System in Health Care Research, Supporting Real Time Decision-Making, 253-285, 13/3, Springer, 2011, Editor(s) - Schuff, D.; Paradice, D.; Burstein, F.; Power, D.J.; Sharda, R., Annals of Information Systems, January. Subhani, Numanul; Kent, Robert D., Continuous process auditing (CPA): An audit rule ontology based approach to audit-as-a-service, Systems Conference (SysCon), 2015 9th Annual, 832-838, 2015, May, IEEE, IEEE, Vancouver, BC, 13-16 April 2015. Subhani, Numanul; Kent, Robert D., Novel design approach to build audit rule ontology for healthcare decision support systems, 133-138, 2014, July, The 2014 International Conference on e-Learning, e-Business, Enterprise Information Systems, and e-Government (EEE '14). Subhani, Numanul; Kent, Robert D., Incorporating Policy-based Authorization Framework in Audit Rule Ontology for Continuous Process Auditing in Complex Distributed Systems, LNCS, 8842, 367-376, 2014, Fifth International Workshop on Information Systems in Distributed Environment (ISDE14). Zhao, Shushan; Kent, Robert D.; Aggarwal, Akshai, A key management and secure routing integrated framework for Mobile Ad-hoc Networks, Ad Hoc Networks, 11(3), 1046-1061, 2013. Zhao, Shushan; Kent, Robert D.; Aggarwal, Akshai, An Integrated Key Management and Secure Routing Framework for Mobile Ad-Hoc Networks, Proceedings of the Tenth Annual Conference on Privacy, Security and Trust (PST 2012), 96-103, 2012, July, IEEE Computer Society, The Tenth Annual Conference on Privacy, Security and Trust (PST 2012). share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 6394,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:32"
}