{
  "name": "Robert Ganian",
  "homepage": "https://www.ac.tuwien.ac.at/people/rganian",
  "status": "success",
  "content": "Robert Ganian – Algorithms and Complexity Group Robert Ganian Address: Robert Ganian Technische Universität Wien Institute of Logic and Computation Favoritenstraße 9–11, E192-01 1040 Wien Austria Room: HC0411 Phone: +43(1)58801–192127 Email: rganian@ac.tuwien.ac.at, rganian@gmail.com Web: http://www.ac.tuwien.ac.at/people/rganian/ Robert Ganian is an associate professor at the Vienna University of Technology (TU Wien) and a member of the Algorithms and Complexity Group. His main research interests are centered around the parameterized algorithms and complexity paradigm, with a special focus on the applications of this paradigm in artificial intelligence research. He received his Ph.D. in 2012, has published over 160 articles in scientific journals and conference proceedings, and has an Erdős Number of 2. Research Grants and Funding: Principal Investigator of FWF START Project 10.55776/Y1329: Parameterized Analysis in Artificial Intelligence – ParAI (approx. € 1 150 000, 2021-2026). Principal Investigator of WWTF Project 10.47379/ICT22029: Parameterized Graph Drawing – PGD (approx. € 780 000 divided among two PIs, 2023-2027). Research Module Leader in the Cluster of Excellence 10.55776/COE12 on Bilateral AI (approx. € 33 mil. divided between six universities, 2024-2029). Co-investigator and vice-chair of admission for the LogiCS@TUWien Marie Skłodowska-Curie COFUND doctoral programme (approx. € 5 300 000 divided among 13 co-investigators, 2021-2026). Principal Investigator of bilateral Czech-Austrian OeAD projects Structural Approaches in Stability Under Diversity Constraints (approx. € 10 000, 2021-2023) and Anonymizing User Data: A Parameterized Perspective (approx. € 4 000, 2022). Principal Investigator of FWF stand-alone project P31336: New Frontiers for Parameterized Complexity – NFPC (approx. € 250 000, 2018-2022). Coordinator of FWF stand-alone project P26696: Exploiting New Types of Structure for Fixed Parameter Tractability – X-TRACT (approx. € 350 000, 2015-2018). Program Committee and Editorial Duties: Area Chair of the International Joint Conference on Artificial Intelligence (IJCAI, annual). Senior Program Committee member of the AAAI Conference on Artificial Intelligence (AAAI, annual). Associate Editor of the Journal of Computer and System Sciences (JCSS, since 2025). Program Committee member of the Conference on Neural Information Processing Systems (NeurIPS, annual), International Conference on Learning Representations (ICLR, annual) and International Conference on Machine Learning (ICML, annual). Program Committee member of the European Symposium on Algorithms (ESA 2026). Program Committee member of the 52nd International Workshop on Graph-Theoretic Concepts in Computer Science (WG 2026). Organizer of the 3rd Workshop on Logic, Graphs, and Algorithms (LogALG 2025). Program Committee member of the 33rd International Symposium on Graph Drawing and Network Visualization (GD 2025). Program Committee member of the 31st International Computing and Combinatorics Conference (COCOON 2025). Program Committee member of the 48th, 49th and 50th International Symposium on Current Trends in Theory and Practice of Computer Science (SOFSEM 2023-2025). Program Committee member of the 35th International Workshop on Combinatorial Algorithms (IWOCA 2024). Organizer of the minisymposium on Fixed-Parameter Tractability in Machine Learning at FPT Fest 2023 in Bergen, Norway. Program Committee member of the 24th International Symposium on Fundamentals in Computation Theory (FCT 2023). Program Committee Co-Chair of the 47th International Symposium on Mathematical Foundations of Computer Science (MFCS 2022). Program Committee member of the 17th International Symposium on Parameterized and Exact Computation (IPEC 2022). Invited Speaker at the 2022 Lorentz Workshop on Graph Decompositions: Small Width, Big Challenges. Program Committee member of the 47th International Workshop on Graph-Theoretic Concepts in Computer Science (WG 2021). Program Committee member of the Workshop on Model Counting (MCW-2020), co-located with the 23rd International Conference on Theory and Applications of Satisfiability Testing (SAT 2020). Guest Editor of the GROW 2017 and GROW 2019 special issues of Discrete Applied Mathematics. Other Academic Activities: Member of the Evaluation Committee at the Czech Science Foundation (GACR) in the area of Mathematics and Computer Science (2024-2026). Organization Co-chair of the 32nd International Symposium on Graph Drawing and Network Visualization (GD 2024) in 2024 (Approx. 100 participants). Organizer of Dagstuhl seminar 23162 New Frontiers of Parameterized Complexity in Graph Drawing in 2023 (Approx. 30 participants). Steering Committee member of the Workshop on Graph Classes, Optimization, and Width Parameters (GROW). PhD Advisory Board Member at the Faculty of Informatics of Masaryk University, Czech Republic. Co-location & Competition Chair of the 31st International Joint Conference on Artificial Intelligence (IJCAI 2022). Organizer of Dagstuhl seminar 21293 Parameterized Complexity in Graph Drawing in 2021. (Approx. 30 participants). Co-chair of the 9th Workshop on Graph Classes, Optimization, and Width Parameters (GROW 2019) in Vienna. (Approx. 50 participants) Award Committee Co-Chair of the VCLA International Student Awards (2018-2022). Organization co-chair of ALGO 2017 in Vienna; ALGO is an annual congress combining the premier algorithmic conference European Symposium on Algorithms and a number of other specialized conferences and workshops. (300+ participants) Organizer of the Parameterized Complexity Summer School (PCSS 2017) in Vienna. (100+ participants) Invited by the organizers to give a series of tutorials at the European Summer School in Logic, Language and Information (ESSLLI 2017) in Toulouse. (Approx. 400 participants) Organizer of the workshop on Parameterized Complexity of Computational Reasoning (PCCR 2014) in Vienna. (40+ participants) Member of the organizing team of the Symposium on Structure in Hard Combinatorial Problems (STRUCTURE 2013) in Vienna. (40+ participants) Current Postdoctoral Researchers: Phuc Hung Hoang: from 2023. Simon Dominik Fink: from 2024. Current Doctoral Students: Liana Khazaliya: from 2022. Mathis Rocton: from 2022. Simon Wietheger: from 2023. Thomas Depian (co-advised with Martin Nöllenburg): from 2023. Alexander Firbas (co-advised with Martin Nöllenburg): from 2024. Former Postdoctoral Researchers: Kirill Simonov: 2021-2022. Cornelius Brand: 2021-2023. Fionn Mc Inerney: 2023-2024. Graduated Doctoral Students: Eduard Eiben (co-advised with Stefan Szeider): 2014-2018. Thekla Hamm: 2018-2022. Viktoriia Korchemna: 2021-2024. Publications: A full list of publications is available here. Doris Brazda Maria Bresich Jiehua Chen Alexis de Colnet Thomas Depian Sara Di Bartolomeo Alexander Dobler Jan Dreier Martin Durand Simon Dominik Fink Alexander Firbas Robert Ganian Marlene Gründel Christian Hatschka Phuc Hung Hoang Marc Huber Enrico Iurlano Liana Khazaliya Markus Kirchweger Viktoria Korchemna Martin Kronegger Pablo Manrique Merchan Martin Nöllenburg Tomáš Peitl Vaidyanathan P. R. Günther Raidl Franz Xaver Reichl Mathis Rocton Andre Schidler Sofia Simola Frank Sommer Manuel Sorge Johannes Strasser Stefan Szeider Laurenz Tomandl Johannes Varga Florentina Voboril Markus Wallinger Simon Wietheger Hai Xia Tianwei Zhang Offenlegung (§25 MedienG) Inhaber der Website ist das Institut für Logic and Computation an der Technischen Universität Wien, 1040 Wien. Die TU Wien distanziert sich von den Inhalten aller extern gelinkten Seiten und übernimmt diesbezüglich keine Haftung. – Disclaimer – Datenschutzerklärung Log in requires cookies.",
  "content_length": 7724,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:43"
}