{
  "name": "Robert Nicholas Maxwell Watson",
  "homepage": "https://www.cl.cam.ac.uk/~rnw24",
  "status": "success",
  "content": "Department of Computer Science and Technology – Robert N. M. Watson: Home Page @ cl.cam.ac.uk Skip to content | Access key help Search Advanced searchA–ZContact us Department of Computer Science and Technology Robert N. M. Watson University of Cambridge William Gates Building 15 JJ Thomson Avenue Cambridge CB3 0FD United Kingdom Office: GE-13, William Gates Building Voice: +44 (0)1223 763 569 Fax: +44 (0)1223 334 678 E-mail: robert.watson AT cl.cam.ac.uk I am Professor in Systems, Security, and Architecture at the University of Cambridge Computer Laboratory. I am involved in several research groups at the lab, including Security, Networks and Operating Systems, and Computer Architecture. I lead a number of cross-layer research projects spanning computer architecture, compilers, program analysis, program transformation, operating systems, networking, and security. I have strong interests in open-source software, am on the board of directors of the FreeBSD Foundation, and have contributed extensively to the FreeBSD Project. I am a coauthor on the Design and Implementation of the FreeBSD Operating System (second edition) published by Pearson. I completed two and a half years of post-doctoral research at the Computer Laboratory, and a Research Fellowship at St John's College, Cambridge, in May, 2013 to take up a lectureship in the department. I finished my PhD in Computer Science at the Computer Laboratory in 2010 (awarded in 2011), supervised by Professor Ross Anderson. Prior to that, I worked for six years in a series of industry research labs (SPARTA ISSO, McAfee Research, NAI Labs, and Trusted Information Systems) investigating operating systems, networking, and security; my contributions included widely used work in operating-system security extensibility, the topic of my later PhD dissertation. My undergraduate degree is in Logic and Computation, with a double major in Computer Science at Carnegie Mellon University. While at CMU, I worked on research projects with Professor M. Satyanarayanan and Professor Jeremy Avigad. If you are interested in joining my team to work on an MPhil or PhD research project, do see below. ContentsRecent newsApplying to our masters or PhD research degreesProjects and researchResearch interestsCapability hardware enhanced RISC instructions (CHERI)Bluespec experimental RISC implementation (BERI)Temporally enhanced security logic assertions (TESLA)Security-oriented analysis of application programs (SOAAP)Operating-system network stacksCapsicum: practical capabilities for UNIXExploiting concurrency vulnerabilities in system call wrappersOperating system access control extensibility (MAC Framework)TeachingResearch studentPostdocs and research assistantsProgramme CommitteesIndustry and industrial researchFreeBSD Project and FoundationPublications Recent news April 2021 I'm very pleased to have received the EuroSys Jochen Liedtke Young Researcher Award at EuroSys 2021 for my work in systems research. May 2020 Our paper, Cornucopia: Temporal Safety for CHERI Heaps. appeared at the IEEE Symposium on Security and Privacy in May 2020. This paper describes a GC-like sweeping revocation algorithm, with hardware acceleration, for use with the CHERI architecture. Its hardware dependencies appear in Arm's Morello processor, shipping in 2022. February 2020 Our paper, Rigorous engineering for hardware security: Formal modelling and proof in the CHERI design and implementation process, will appear in the IEEE Symposium on Security and Privacy in May 2020. This paper describes our formal modeling and proof work around the CHERI-MIPS architecture, which is one of the foundations for our formal work around Arm's Morello board. September 2019 Arm has announced Morello, a CHERI-extended A76-derived processor, System-on-Chip, and development board. Morello will be an industrial scale demonstrator of a capability architecture, fabricated using a 7nm process, providing a quad-core, 2GHz processor based on the A76, suitable to perform CHERI-related research and prototyping in academia and industry. This £187M (~$225M) research programme is supported in part through £70M in grants from the UK Industrial Strategy Challenge Fund, and support from industrial sponsors including Arm, Google, Microsoft, and Amazon. Applying to our masters or PhD research degrees If you are applying to our PhD in Computer Science, please review the PhD application information. Once you have reviewed this, if you believe that I would make an appropriate supervisor for your proposed research, please contact me directly well in advance of our annual early December deadline. Please include a recent CV and initial research proposal (contents described on the application PhD web page). It is a particularly exciting time to work with us on CHERI, with Arm's CHERI-extended Morello board due in early 2022. Areas in which I am particularly soliciting potential research students include: Designing, prototyping, and evaluating new software models for memory safety and softawer compartmentalization based on CHERI and Morello. Theoretical and practical work exploring the security properties of the CHERI architecture and its software stack. The application of CHERI C/C++ memory safety at a larger scale, and to complex software stacks such as language runtimes. Performance analysis and optimization techniques for CHERI C/C++-enabled operating systems and applications. Software compartmentalization using CHERI, including motivations, techniques, and evalaution, with a particular concern with how and why we compartmentalize software, and benefits/costs in terms of performance, program complexity, security, and maintainability. New techniques and approaches to software debugging and tracing in CHERI-based software environments. CHERI's interactions with hardware accelerators including GPUs and machine learning, both respect to hardware and software. Projects and research Current and recent projects include: CHERI, a DARPA-funded project in collaboration with SRI International revisiting the hardware-software interface to improve security. We have designed a new architectural protection model, CHERI, that extends commodity RISC instruction sets with support for fine-grained, compiler-directed memory protection, and scalability, fine-grained software compartmentalisation. Arm has announced Morello, a multicore superscale CHERI-extended processor, SoC, and development board shipping in 2021. Read about CHERI in our Introduction to CHERI or CHERI Instruction-Set Architecture (version 7 technical reports. As part of this work we also developed SOAAP, a set of static analysis techniques to assist programmers in developing compartmentalised software design, implementation, and maintenance. CADETS, a DARPA-funded project in collaboration with BAE Systems and Memorial University Newfoundland, to improve support for local and distributed tracing via software instrumentation. We are developing a distributed version of DTrace, new LLVM-based program instrumentation techniques, and using architectural simulation tools such as Gem5 to explore optimising the performance of software instrumentation. This project builds on our prior work on TESLA, a temporaral assertion system allowing us to validate complex safety properties of C-language software, published at EuroSys 2014. A variety of work in network-stack performance and optimisation, including work on the Sandstorm network stack, a clean-slate \"specialised\" stack able to better exploit current hardware architectures and microarchitectures. In the past, I have contributed extensively to the FreeBSD network stack, including leading work to develop scalable multicore support for the TCP stack. The Capsicum hybrid capability system, which blends capability-system concepts with contemporary UNIX operating-system design. We have upstreamed this work to FreeBSD, which now ships with Capsicum as its native sandboxing model, and Google has developed a Linux adaptation of the model. Other areas of ongoing interest, and recent projects, include: System-call interposition concurrency problems: how concurrency can be used to attack interposition-based security wrappers. The TrustedBSD MAC Framework, a widely deployed OS access-control extensibility framework (now shipped in FreeBSD, Mac OS X, Apple iOS, Junos, and other products). OpenBSM security-event auditing, the Common Criteria-compliant security logging mechanism shipped in FreeBSD and Mac OS X. Research interests I lead a number of research projects spanning the security, computer architecture, and network + operating system research groups at the Computer Laboratory, supported by grants from DARPA, Google, DeepMind, Netapp, Thales E-Security, Arm, and HP Labs. A theme spanning many of my current research areas is the tension between program representation and security, with interests in revising the hardware-software interface, and whole-system implementation of security. Several of these projects are part of the DARPA-sponsored CTSRD Project in collaboration with Peter G. Neumann at the Computer Science Laboratory at SRI International. I have additional research interests in the interplay between concurrency and security, operating system access control (especially as relates to software pplication compartmentalisation and capability systems), multi-threaded network stacks, and revisiting a variety of hardware-software interfaces in support of security, networking, and operating system design. Utilising and improving open source platforms for research plays a key role in technology transition for my work. Capability hardware enhanced RISC instructions (CHERI) This project is joint between SRI International and the University of Cambridge. The CHERI architecture provides hardware-assisted in-process sandboxing based on a hybrid capability model. The goal is to support several orders of magnitude greater numbers of sandboxes than current ISAs support -- while still ",
  "content_length": 45786,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:03"
}