{
  "name": "Robert D. Macredie",
  "homepage": "https://www.brunel.ac.uk/people/robert-macredie",
  "status": "success",
  "content": "Professor Rob Macredie | Introduction | Brunel University London Skip to Content Home People Professor Rob Macredie Professor Rob MacredieProfessor - Interactive Systems Wilfred Brown Building 215 Email: robert.macredie@brunel.ac.uk Tel: +44 (0)1895 266053 Computer Science College of Engineering, Design and Physical Sciences Summary With over 20 years of research experience, Rob Macredie has worked with a range of organisations, ranging from large, blue-chip companies, through small businesses, to government agencies.  Rob’s research spans the fields of Human-Computer Interaction and Information Systems, exploring the ways in which people and organisations use technology, and aims to determine how work can be more effectively undertaken by improving the way that we understand how people and technology interact in organisational (and social) settings.  He is Professor of Interactive Systems at Brunel University London, and has held senior leadership roles as Head of School, Dean of Faculty and Pro-Vice-Chancellor. Rob is a Fellow of the British Computer Society. Qualifications BSc Physics and Computer Science PhD Computer Science Responsibility Rob is Director of Undergraduate Studies for the Department of Computer Science. Newest selected publications Koulouri, T., Macredie, RD. and Olakitan, D. (2022) 'Chatbots to Support Young Adults' Mental Health: an Exploratory Study of Acceptability'. The ACM Transactions on Interactive Intelligent Systems, 12 (2). pp. 1 - 39. ISSN: 2160-6455 Open Access Link Journal article Christopoulos, A., Kurczaba, J., Pellas, N. and Macredie, R. (2021) 'The effects of augmented reality-supported instruction in tertiary-level medical education'. British Journal of Educational Technology, 53 (2). pp. 307 - 325. ISSN: 0007-1013 Open Access Link Journal article Macredie, R., Kim, H. and Giacomin, J. (2014) 'A qualitative study of stakeholders' perspectives on the social network service environment'. International Journal of Human-Computer Interaction, 30 (12). pp. 965 - 976. ISSN: 1044-7318 Open Access Link Journal article Macredie, R., Koulouri, T. and Lauria, S. (2014) 'Do (and say) as I say: Linguistic adaptation in human-computer dialogues'. Human-Computer Interaction, 31 (1). pp. 59 - 95. ISSN: 0737-0024 Open Access Link Journal article Borsci, S., Macredie, RD., Martin, JL. and Young, T. (2014) 'How many testers are needed to assure the usability of medical devices?'. Expert Review of Medical Devices, 5 (5). pp. 513 - 525. ISSN: 1745-2422 Open Access Link Journal article More publications(71)",
  "content_length": 2568,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:32"
}