{
  "name": "Robert Wille",
  "homepage": "https://www.cda.cit.tum.de/team/wille",
  "status": "success",
  "content": "Robert Wille · Chair for Design Automation Chair for Design Automation School of Computation, Information and Technology Technical University of Munich Prof. Dr. Robert Wille Head Arcisstrasse 21, 3rd floor, room 3936 Phone: +49 (89) 289 - 23551 robert.wille@tum.de Go to: Bio, Curriculum Vitae, Publications, Professional Service, Miscellaneous Bio Robert Wille is a Full and Distinguished Professor at the Technical University of Munich, Germany, and Chief Scientific Officer at the Software Competence Center Hagenberg GmbH, Austria. From 2002 to 2006, Robert Wille studied Computer Science (Diploma) at the University of Bremen. After successfully completing his doctorate in 2009 (summa cum laude), he worked as postdoc at the University of Bremen and, since 2013, as Senior Researcher in the Cyber-Physical Systems department of the German Research Center for Artificial Intelligence (DFKI). Besides that, he served as lecturer at the University of Applied Science Bremen from 2010 to 2012 and was guest professor at the University of Potsdam in 2012 as well as the Technical University of Dresden in 2013/2014. From 2015 to 2022, he was Full Professor at the Johannes Kepler University Linz and head of the Institute for Integrated Circuits (at the age of 32 and as one of the youngest full professors in the field). In 2019, he founded the LIT Secure and Correct Systems Lab at JKU and, in 2020, he additionally became Chief Scientific Officer at the Software Competence Center Hagenberg GmbH. Since 2022, he works in Munich—appointed through a “Leuchtturm”-procedure (i.e., direct appointment) and, additionally, through the “Distinguished Professorship”-program. Robert Wille’s expertise covers a broad spectrum of topics with a particular focus on the development of automatic methods for the design, simulation, verification, and test of complex systems in hard- and software. He considers conventional technologies (from formal specifications to the realization) as well as future technologies (including quantum computing, microfluidic biochips, field-coupled nanotechnologies, optical circuits, memristors, reversible circuits, and adiabatic circuits). Besides that, he frequently applies his expertise to complementary fields in cooperation with groups from other areas of Computer Science (e.g., Machine Learning, Software Development, Theoretical Computer Science, Database Systems, Operation Systems, and more) as well as Mechatronics and Electrical Engineering. Furthermore, his work on future technologies frequently exposes him to topics from physics, biology, chemistry, and optics. Also projects with legal sciences are within his portfolio. Since 2007, Robert Wille published more than 400 journal and conference papers in this area and was repeatedly awarded (e.g., with Best Paper Awards, e.g., at TCAD and ICCAD, an ERC Consolidator Grant, a Distinguished Professor appointment, a Google Research Award, and more). Besides that, he served as Associate Editor and Guest Editor for various renowned journals such as the IEEE Transactions on Computer Aided Design of Integrated Circuits and Systems (TCAD), the ACM Journal on Emerging Technologies in Computing Systems (JETC), or Springerâs Lecture Notes in Computer Science (LNCS). Additionally, he was General Chair and PC Chair for several conferences, is Executive Committee Member for DATE and ICCAD, served in numerous Program Committees, and organized several tutorials, seminars, workshops, and special sessions. Back to top â Curriculum Vitae Personal Data Name: Robert Wille Date of birth: November 11th, 1982 Nationality: German Highlights 2022 Appointed Full and Distinguished Professor at the Technical University of Munich, Germany (appointed through a \"Leuchtturm\"-procedure, i.e., direct appointment and supported by the \"Distinguished Professorship\"-program providing 4.7 million Euros for five years) 2022 Successful application for a so-called COMET K1 Center for the Software Competence Center Hagenberg GmbH(supported with 22.7 million Euros for 4 years) 2020 Awarded an ERC Consolidator Grant \"Design Automation for Quantum Computing\" (providing 2 million Euros for five years) 2020 Appointed Chief Scientific Officer at the Software Competence Center Hagenberg GmbH (a company for technology transfer between academia and industry with more than 100 employees) 2020 1st place in the \"Vote Your Prof\"-competition for exceptional performance in teaching 2019 Founding Head of the LIT Secure and Correct Systems Lab (an interdisciplinary research lab composing the expertise of ten institutes at the Johannes Kepler University; supported by the State of Upper Austria with 2.4 million Euros in its first four years) 2019 Under-40 Innovators Award from the Design Automation Conference (DAC) 2018 Google Faculty Research Award 2018 Winner of the IBM QISKit Developer Challenge 2015 Appointment to Full Professor (tenured) at the age of 32 Several awards for scientific works such as Best Paper Awards (at TCAD, ICCAD, and FDL), 10-year Retrospective Most Influential Paper Award (at ASP-DAC), Best Research Demo Award (at ISVLSI), a Young Researchers Award (at ISMVL), as well as numerous further nominations Several awards won by students such as Best Dissertation Awards, Award of Excellence from the Austrian Ministry of Education, a KlarText Award from the Klaus Tschira Foundation, and many more. Numerous collaborations with industrial partners such as Infineon, IBM, Google, Atos, and many more. Scientific Career Since 2022 Full and Distinguished Professor at the Technical University of Munich, Germany (appointed through a \"Leuchtturm\"-procedure, i.e., direct appointment and supported by the \"Distinguished Professorship\"-program) Since 2020 Chief Scientific Officer at the Software Competence Center Hagenberg GmbH, Austria 2019-2022 Head of the \"LIT Secure and Correct Systems Lab\" (composing the expertise of over nine institutes) at the Johannes Kepler University Linz, Austria 2015-2022 Full Professor (W3-equivalent) at the Johannes Kepler University Linz, Austria 2014 HabilitationTitle: \"Design of Circuits and Systems: Today and Tomorrow\" (submitted in February 2014; hearing conducted in July 2014) 2013-2014 Visiting Professor at the Technical University Dresden, Germany 2013-2022 Senior Researcher at the German Research Center for Artificial Intelligence (DFKI), Bremen, Germany 2012 Visiting Professor at the University of Potsdam, Germany 2010-2012 Lecturer at the University of Applied Science, Bremen, Germany 2009-2015 Postdoc at the University of Bremen, Germany 2009 Dissertation Title: \"Towards a Design Flow for Reversible Logic\" Degree: Dr.-Ing. (Grade: summa cum laude) 2006-2009 Doctoral candidate (Scholarship Holder) at the \"Graduate School Embedded Systems\" at the University of Bremen, Germany 2006 Diploma thesis Title: \"Building Free Binary Decision Diagrams Using SAT Solvers\" (German: \"Erstellung von Free Binary Decision Diagrams mit SAT-Beweisern\"; Grade: 1,0) Degree: Diploma (Grade: 1,0) 2002-2006 Studies of computer science (Diploma) at the University of Bremen, Germany Education 2014 Habilitation, University of Bremen, Germany Topic: \"Design of Circuits and Systems: Today and Tomorrow\" 2009 Dr.-Ing. (summa cum laude), University of Bremen, Germany Advisor: Prof. Dr. Rolf Drechsler Thesis: \"Towards a Design Flow for Reversible Logic\" 2006 Diploma in Computer Science, University of Bremen, Germany Thesis: \"Erstellung von Free Binary Decision Diagrams mit SAT-Beweisern\" (\"Synthesis of Free Binary Decision Diagrams Using SAT Solvers\") 2002-2006 Student of Computer Science, University of Bremen, Germany Further Work Experience 2006 Student research assistant at the Group of Computer Architecture at the University of Bremen 2004-2006 Freelancer of Electronic Arts Germany, Cologne 2003-2006 Student assistant at the University of Bremen for exercise courses on Technical Computer Science and Theoretical Computer Science Back to top â Publications Book Â» Book Chapters Â» Edited Publications Â» Tutorials, Special Sessions, etc. Â» Journals Â» Conferences, Workshops, etc. with Proceedings Â» Conferences, Workshops, etc. without Proceedings Â» Miscellaneous Â» Since 2007, more than 350 papers in journals and conference proceedings (including many papers in the top venues DAC, DATE, FMCAD, ICCAD, ASP-DAC, Memocode, MODELS, TCAD and JETC) Co-author of 7 textbooks and 15 book chapters Editor of 12 journal issues, seminar summaries, and technical reports Author and co-author of 16 invited papers Books S. Hillmich and R. Wille. Efficient Implementation of Quantum Circuit Simulation with Decision Diagrams. Springer, 2023. DOI. M. Walter, R. Wille, F. Sill Torres, and R. Drechsler. Design Automation for Field-coupled Nanotechnologies. Springer, 2022. K. Verma and R. Wille. High performance simulation for industrial paint shop applications. Springer, 2021. A. Zulehner and R. Wille. Introducing Design Automation for Quantum Computing. Springer, 2020. A. Grimmer and R. Wille. Designing Droplet Microfluidic Networks: A Toolbox for Designers. Springer, 2020. O. Keszocze, R. Wille, and R. Drechsler. Exact Design of Digital Microfluidic Biochips. Springer, 2019. N. Przigoda, R. Wille, J. Przigoda, and R. Drechsler. Automated Validation & Verification of UML/OCL Models Using Satisfiability Solvers. Springer, 2018. P. Niemann and R. Wille. Compact Representations for the Design of Quantum Logic. Springer, 2017. J. Seiter, R. Wille, and R. Drechsler. Automatic Methods for the Refinement of System Models. Springer, 2017. R. Wille and R. Drechsler. Towards a Design Flow for Reversible Logic. Springer, 2010. Book Chapters R. Wille, S. Hillmich, and L. Burgholzer. Decision Diagrams for Quantum Computing. In R. O. Topaloglu, editor, Design Automation of Quantum Computers. Springer, 2023. arXiv:2302.04687, DOI, PDF. R. Wille, P. Niemann, A. Zulehner, and R. Drechsler. Empowering the Design of Reversible and Quantum Logic with",
  "content_length": 192325,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:16"
}