{
  "name": "Roberto Battiti",
  "homepage": "https://rtm.science.unitn.it/~battiti",
  "status": "success",
  "content": "Roberto Battiti Roberto Battiti Full Professor of Computer Science University of Trento, Italy LION (machine Learning and Intelligent OptimizatioN) Email: battiti ((AT)) alumni.caltech.edu List of publications Short bio I was born in Trento (Italy) and received the Laurea in Theoretical Physics from the University of Trento in 1985. Then I moved to the USA, where I received the Ph. D. degree in Computer Science and Neural Networks from the California Institute of Technology (Caltech) in 1990. I organize research initiatives in the area of machine learning and intelligent optimization (LION) and reactive search optimization (RSO) heuristics. My passion is to use data to build flexible models and extract actionable knowledge (machine learning), exploit knowledge to automate the discovery of improving solutions (intelligent optimization), connect insight to decisions and actions. I am leading the LION: machine Learning and Intelligent OptimizatioN initiative, author of THE LION WAY, Machine Learning plus Intelligent Optimization . I am a Fellow of the IEEE (class of 2009). I am the 2023 winner of INFORMS (The Institute for Operations Research and the Management Sciences) Test of Time Paper Award Combining Machine Learning and Optimization LION (machine learning and intelligent optimization) . Courses Courses relevant to our research topics: Machine learning for data science, professor: Roberto Battiti Intelligent optimization for data science, professor: Roberto Battiti Suggested book for our courses: The LION way. Machine Learning plus Intelligent Optimization. R. Battiti and M. Brunato LIONlab, University of Trento, Italy, Version 4.0, Dec 2023. The book is also available in the Chinese version: 罗伯托·巴蒂蒂（Roberto Battiti），毛罗·布鲁纳托（Mauro Brunato） Duties / Memberships Fellow of the IEEE. Founder of LION initiative : machine learning and intelligent optimization. Member of the advisory committee for the future Telecommunications Plan of the Autonomous Province of Trento. Member of the Faculty Commission for Teaching Evaluation (Commissione paritetica per la didattica) Representative of the Faculty of Science in the PhD \"future strategies\" commission of the University of Trento. Member of the IEEE Computational Intelligence Society Winner of INFORMS (The Institute for Operations Research and the Management Sciences) Test of Time Paper Award Publications Complete List of publications with digital versions, click here The LION way. Machine Learning plus Intelligent Optimization. R. Battiti and M. Brunato LIONlab, University of Trento, Italy, Version 4.0, Dec 2023. Reactive Search and Intelligent Optimization, by R. Battiti, M. Brunato and F. Mascia Preprint of book (PDF) Reactive-Search-and-Intelligent-Optimization-Battiti-Brunato-Mascia-preprint.pdf Reactive Search and Intelligent Optimization, local sample pages Book Review by Quingfu Zhang appeared in IEEE COMPUTATIONAL INTELLIGENCE MAGAZINE, Feb 2010 , local cache copy Special issue AMAI (Annals of Mathematics and Artificial Intelligence) about \"Learning and Intelligent Optimization\" - Editors R. Battiti and C. Blum Conferences organized or co-organized by our group Learning and Intelligent OptimizatioN Conference LION 20 , June 15–19, 2025, Milano, Italy (Chair of Steering Committee). Learning and Intelligent OptimizatioN Conference LION 19 , June 5–19, 2025, Prague, Czech Republic (Chair of Steering Committee). Learning and Intelligent OptimizatioN Conference LION 18 , June 9-13, 2024 (Ischia, Italy) (Chair of Steering Committee). Learning and Intelligent OptimizatioN Conference LION 17 , June 4-8, 2023 (Nice, France) (Chair of Technical Program Committee). Learning and Intelligent OptimizatioN Conference LION 16 , June 5-10, 2022 (Milos Island, Cyclades, Greece) (Chair of Technical Program Committee). Invited speaker: Tourism and Hospitality: Relevant Problems for Machine Learning and Intelligent Optimization Learning and Intelligent OptimizatioN Conference LION 15 , June 20-25, 2021 (Athens, Greece) (Chair of Technical Program Committee). 3rd Revenue Management & Pricing in Services Conference 2019 RevMe Europe, Dec 2-3, 2019, École hôtelière de Lausanne (invited speaker) Learning and Intelligent OptimizatioN Conference LION 14 , May 24-28, 2020, Athens, Greece (Chair of Technical Program Committee). LION-APP, Jul 5-9, 2019, Summer School and Workshop, Riva del Garda, Trento, Italy. MACHINE LEARNING AND INTELLIGENT OPTIMIZATION APPLIED TO TOURISM AND HOSPITALITY. (head of steering committee). Learning and Intelligent OptimizatioN Conference LION 12, June 10-15, 2018, Kalamata, Greece (head of steering committee). Learning and Intelligent OptimizatioN Conference LION 11, June 19-20-21, 2017, Nizhny Novgorod, Russia (head of steering committee). Learning and Intelligent OptimizatioN Conference LION 10, Ischia Island (Napoli), Italy, 29 May - 1 June, 2016. (head of steering committee). International Symposium on Big Data Management and Analytics (BIDMA 2016) , Calgary, Canada 25-26 April 2016 (member of the PC) Numerical Computations: Theory and Algorithms The 2nd International Conference and Summer School,19-25 June 2016, Pizzo Calabro, Calabria, Italy, (member of scientific committee). PPSN2016 14th International Conference on Parallel Problem Solving from Nature, 17-21 September 2016 Edinburgh, Scotland, (member of the program committee) Metaheuristics International Conference (MIC 2015) Agadir, Morocco, June 7-10, 2015 (member of steering committee). Learning and Intelligent OptimizatioN Conference LION 9 , Lille, FRANCE, Jan. 12-16, 2015. (head of steering committee). LION 8, Learning and Intelligent OptimizatioN, Gainesville, Florida - USA Feb 16-21, 2014 (head of steering committee). BAFI 2014, Business Analytics in Finance and Industry, Jan 6-9, 2014, Santiago, Chile (member of the Program Committee). 8th International Workshop on Hybrid Metaheuristics , May 23-25, Ischia, (invited speaker). LION 7, Learning and Intelligent OptimizatioN, Catania, Jan 7-11, 2013, (head of steering committee). CoCoMile 2012 , First workshop on COmbining COnstraint solving with MIning and LEarning, Workshop at ECAI 2012, August 27/28, Montpellier, France. LION 6, Learning and Intelligent OptimizatioN, Jan 16-20, 2012, (head of steering committee). PPSN 2012 12th International Conference on Parallel Problem Solving From Nature - September 1-5, 2012 Taormina, Italy. (program committee). Submission deadline: Mar 15, 2012. ICARIS 2011 - University of Cambridge, UK , July 18-21, 2011 (PC member). GECCO 2011 New Frontiers Track: Self-* Search, 2011 Genetic and Evolutionary Computation Conference (GECCO-2011) July 12-16, Dublin, Ireland (PC member). LION 5, Learning and Intelligent OptimizatioN, Rome - Italy, Jan 17-21, 2011 MIC 2011, July 25-28, 2011, Udine, Italy. (program committee). 7th workshop on Local Search for Constraint Satisfaction. during the CP conference held in St Andrews, Scotland from 6-10th September 2010 (invited talk). WCCI 2010, July 18-23, Barcelona, Spain. (tutorialist) 6th International Workshop on Local Search Techniques in Constraint Satisfaction, LSCS'09, At the 15th International Conference on Principles and Practice of Constraint Programming, CP2009 20 September 2009 Lisbon, Portugal (TPC member). 27th International Conference on Machine Learning (ICML) will be held in Haifa, Israel, June 21-24, 2010 (TPC member) MIC - Metaheuristics International Conference, Hamburg - July 13 - 16, 2009 (invited speaker). LSCS'09, 6th International Workshop on Local Search Techniques in Constraint Satisfaction, at the 15th International Conference on Principles and Practice of Constraint Programming, CP2009 20 September 2009 Lisbon, Portugal (TPC member). CROCS-09 Workshop, First International Workshop on Constraint Reasoning and Optimization for Computational Sustainability September 20, 2009 Lisbon, Portugal (TPC member). LION 4, Learning and Intelligent OptimizatioN, Venice - Italy, Jan 18-22, 2010 META 10, International Conference on Metaheuristics and Nature Inspired Computing, Tunisia, October 28-30, 2010 (TPC member) The 22nd Conference of the European Chapter on Combinatorial Optimization (ECCO XXII) , May 17-19, 2009, Jerusalem, Israel 9th Haifa Workshop on Interdisciplinary Applications of GraphTheory, Combinatorics and Algorithms , 20-21 May 2009, Haifa (Israel) SLS09, Engineering Stochastic Local Search Algorithms, Brussels, September 3-5, 2009, (TPC member) COM track (Combinatorial Optimization and Metaheuristics) of GECCO 2009, the Genetic & Evolutionary Computation Conference, Montreal (Canada), July 8-12, 2009. (Program Committee member) LION 3, Learning and Intelligent OptimizatioN, Trento - Italy, Jan 14-18 2009 Machine learning and intelligent optimization in bioinformatics, Special session at CIBB2008 Computational intelligence methods for bioinformatics and biostatistics, Vietri sul Mare, Salerno, 4 October 2008 Hyper-heuristics - Automating the Heuristic Design Process, held in conjunction with the 10th International Conference on Parallel Problem Solving From Nature (PPSN X), Dortmund, Sep 13, 2008 (invited talk). ECAI 2008 (Patras), Jul 21-25, (TPC member) HIS 2008 (Barcelona), Sep 10-12, (TPC member). Australasian Joint Conference on Artificial Intelligence (AI-08), Auckland, December 1-5, 2008. (TPC member). LION 2 2007, Learning and Intelligent OptimizatioN Conference, Trento - Italy, Dec 8-12, 2007 (chair of the steering committee) META 08, International Conference on Metaheuristics and Nature Inspired Computing, Tunisia, October 30-31, 2008 (TPC member) First Workshop on Autonomous Search, in conjunction with CP 2007. Sep 23, 2007, Providence, Rhode Island, USA (TPC member) NICSO 2008, the third \"International Workshop on Nature Inspired Cooperative Strategies for Optimization\", which will be held in Puerto de La Cruz (Tenerife, Spain) form 12th to 14th November 2008. (TPC member) NICSO 2007, Workshop on Nature Inspired Cooperative Strategie",
  "content_length": 13862,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:19"
}