{
  "name": "Robert Sabourin",
  "homepage": "https://www.etsmtl.ca/Unites-de-recherche/LIVIA",
  "status": "success",
  "content": "Chaires, laboratoires, instituts et centres de recherche | ÉTS Montréal - ÉTS Montréal Accueil Recherche et innovation Chaires, laboratoires, instituts et centres de recherche Chaires, laboratoires, instituts et centres de recherche L’École de technologie supérieure croit fermement que la recherche scientifique doit servir le bien commun. Avec près de 80 groupes se consacrant à la recherche, les possibilités de faire progresser la connaissance et d'améliorer la vie des gens sont infinies. Chaires de recherche L’ÉTS mise sur plusieurs chaires de recherche pour développer de nouveaux créneaux, qu'il s'agisse des prestigieuses chaires de recherche du Canada ou des chaires industrielles, qui renforcent la relation privilégiée de l'École avec ses partenaires. Les chaires de recherche institutionnelles Marcelle-Gauvreau, quant à elles, sont confiées à des chercheuses et des chercheurs inspirants et résilients. Parcourez la liste des chaires de l'ÉTS Laboratoires de recherche L’ÉTS offre des espaces d’expérimentation diversifiés à une communauté de recherche engagée à faire sa part pour le mieux-être de la société, à produire de nouvelles connaissances et à les partager. Ses nombreux laboratoires de recherche peuvent s'appuyer sur des équipements de choix pour former une relève qualifiée et faciliter un transfert efficace des innovations vers l’industrie. Parcourez la liste des laboratoires de l'ÉTS Instituts et centres de recherche Les instituts et centres de recherche de l'ÉTS regroupent une masse critique de chercheurs et chercheuses qui collaborent en interdisciplinarité autour d'un programme scientifique porteur. Le rôle stratégique de ces organisations repose sur un leadership attesté, leur originalité, leur potentiel d'impact et le niveau exceptionnel qu'elles ont atteint sur le plan de la recherche. Parcourez la liste des instituts et centres de recherche de l'ÉTS Fermer l'affichage superposé Transcription textuelle Afficher la transcription textuelle Transcription textuelle Masquer la transcription textuelle",
  "content_length": 2045,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:10"
}