{
  "name": "Robert Stevens 0001",
  "homepage": "https://www.research.manchester.ac.uk/portal/robert.stevens.html",
  "status": "success",
  "content": "Robert Stevens - Research Explorer The University of Manchester Robert Stevens Prof Emeritus Professor, Computer Science Teaching https://orcid.org/0000-0002-6038-9025 Personal profile BiographyI am a professor of computer science in the Bio-Health Informatics Group in the School of Computer Science at the University of Manchester. I have a B.Sc. in biochemistry; an M.Sc. in biological Computation; and a D.Phil. in Computer Science: A blend of Biology and Computer Science, that I use within my main research area of Bioinformatics. I am also a member of the Information Management Group where I work with colleagues on both e-Science and description logics. I also have close affiliation with the Bioinformatics Groups from the Faculty of Life Sciences. An article in The Biochemist magazine gives an overview of my academic life-history A pottted biography is: 2013: Professor of computer science (Computer Science, Manchester);2010: Reader in bio-health informatics (Computer Science, Manchester);2006: Senior lecturer (Computer Science, Manchester);2001: Lecturer (Computer Science, Manchester);1997: Move to Manchester as postdoctoral research associate on TAMBIS project;1993: RA on Maths project, university of York;1996: D.Phil. computer science, University of York;1991: M.Sc.biological computation, University of York;1986: B.Cs. (Hons) Biochemistry, university of Bristol.Research interestsMy research has followed a theme of the computer science associated with managing and using complex information in inter-disciplinary settings, from early research into presenting complex information in audio to blind people, through research into tools for data analysis in e-Science to my principle research area in biomedical semantics. Within my biomedical ontology research I have led the ontology building and use within the school as one vertex of a virtuous triangle of ontology language fundamentals, tool development and ontology development and use. I have published the first papers on semantic similarity using bio-ontologies, the use of bio-ontologies to query multiple distributed information sources, to discover new proteins through classification, and to publish discovery of new biological facts in a high impact biology journal from the use of Semantic Web technologies. This research into semantically describing and managing biomedical data has had a counterpart in my activity within e-Science research. I led the user activity of the Taverna Workflow Workbench (led by Carole Goble) in analysis of biomedical data. I was first author on the first paper to mention workflow within bioinformatics; the lead author on the first paper to use workflows to demonstrate an automation of biological analysis and a supervisor (with Andy Brass) of Paul Fisher, who developed novel methods for analyzing gene expression data that has led to insights into tolerance to trypanosomiasis in East African cattle.My group Bio Health InfomaticsData Science InstituteLazarus Advanced Interfaces GroupBio-Health Informatics GroupInformation Management Group OpportunitiesI have supervised  five Ph.D. students to completion. I currently have three Ph.D. students. My students mainly work in the area of knowledge management within bioinformatics through the use of ontologies. I also run students on e-Science projects looking at \"industrialising\" data analysis within bioinformatics. Finally, I also have Ph.D. students working in the area of accessibility to electronic information by visually disabled computer users. I welcome enquiries from prospective Ph.D. students. I will be looking to take on new students from late 2008. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital FuturesChristabel Pankhurst Institute Fingerprint Dive into the research topics where Robert Stevens is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Ontology Computer Science 100% Annotation Computer Science 20% Semantic Web Computer Science 13% Web Page Computer Science 13% Visually Impaired User Computer Science 10% Deep Learning Computer Science 8% Web Service Computer Science 8% Semantic Web Technology Computer Science 8% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 162 Conference contribution 124 Article 24 Chapter 3 Paper 1 More 1 Poster Research output per year Research output per year Augmenting a Nature Documentary with a Lifelike Hologram in Virtual RealitySaeghe, P., Weir, B., McGill, M., Clinch, S. & Stevens, R., 20 Apr 2022, (Accepted/In press) The ACM International Conference on Interactive Media Experiences (IMX) 2022.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Virtual Reality 100% Augmented Reality 80% Reality Television 80% Visual Display 20% Personal Preference 20% Evaluating and Updating a Design Space for Augmented Reality TelevisionSaeghe, P., McGill, M., Weir, B., Clinch, S. & Stevens, R., 15 Mar 2022, (Accepted/In press) ACM International Conference on Interactive Media Experiences.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Broadcast Mode 100% MetaMap versus BERT Models with Explanable Active Learning: Ontology-Based Experiments with Prior Knowledge for COVID-19,Arguello Casteleiro, M., Henson, C., Marato, N., Li, S., Des-Diz, J., Fernandez-Prieto, M., Peters, S., Furmston, T., Sevillano Torrado, C., Maseda Fernandez, D., Kulsrestha, M., Keane, J., Stevens, R. & Wroe, C., Jan 2022. 10 p.Research output: Contribution to conference › Paper › peer-review Open Access Modelling trend life cycles in scientific research using the Logistic and Gompertz equationsTattershall, E., Nenadic, G. & Stevens, R. D., Nov 2021, In: Scientometrics. 126, 11, p. 9113-9132 20 p.Research output: Contribution to journal › Article › peer-review Open Access Trend 100% Research 100% Model 100% Logistics 100% Time 60% NERO: A Biomedical Named-entity (Recognition) Ontology with a Large, Annotated Corpus Reveals Meaningful Associations Through Text EmbeddingStevens, R., Ananiadou, S., Schoene, A., Li, M., Christopoulou, F. & et al., 17 Sept 2021, (Accepted/In press) In: npj Systems Biology and Applications.Research output: Contribution to journal › Article › peer-review Ontology 100% Named Entity Recognition 100% Annotation 25% Machine Vision 25% View all 314 research outputs Projects 2 Finished Projects per year DARPAKing, R. (PI), Ananiadou, S. (CoI) & Stevens, R. (CoI)15/07/14 → 14/01/19Project: Research Amendment 100% Budgets 100% Inflation 100% Health Care Cost 100% Contract Law 50% Open-PHACTS An open integrated and sustainable chemistry, biology and pharmacology knowledge resource for drug discoveryGoble, C. (PI), Pettifer, S. (CoI), Stevens, R. (CoI), Gray, A. (Researcher), Soiland-Reyes, S. (Researcher) & Brenninkmeijer, C. (Researcher)1/03/11 → 28/02/14Project: Research Data Source 100% Resolution Service 80% Semantic Web 60% Linked Data 60% Data Integration 40% Datasets Deep learning meets ontologies: experiments to anchor the cardiovascular disease ontology in the biomedical literatureArguello Casteleiro, M. (Contributor), Demetriou, G. (Contributor), Read, W. (Contributor), Fernandez Prieto, M. J. (Contributor), Maroto, N. (Contributor), Maseda Fernandez, D. (Contributor), Nenadic, G. (Contributor), Klein, J. (Contributor), Keane, J. (Contributor) & Stevens, R. (Contributor), figshare , 12 Apr 2018DOI: 10.6084/m9.figshare.c.4068524.v1, https://figshare.com/collections/Deep_learning_meets_ontologies_experiments_to_anchor_the_cardiovascular_disease_ontology_in_the_biomedical_literature/4068524/1Dataset The Proteasix OntologyArguello Casteleiro, M. (Contributor), Klein, J. (Contributor) & Stevens, R. (Contributor), figshare , 4 Jun 2016DOI: 10.6084/m9.figshare.c.3622397.v1, https://figshare.com/collections/The_Proteasix_Ontology/3622397/1Dataset",
  "content_length": 8514,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:12"
}