{
  "name": "Robert Mercas",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/robert-mercas",
  "status": "success",
  "content": "Robert Mercaș | Computer Science | Loughborough University Dr Robert Mercas Senior Lecturer Research groups and centres Theoretical Computer Science Publications +44 (0) 1509 222 545 Send email Office: N.3.18 (Haslegrave Building) Personal website Biography Research External activities Responsibilities PhD Students Robert graduated from University of Bucharest in 2004 with a degree in Computer Science. He did his Masters in Theoretical Computer Science at the same university before moving to Tarragona where he did his PhD at the Rovira I Virgili University. In 2011, Robert became an Alexander von Humboldt fellow at Otto-von-Guericke University Magdeburg. Between 2013 and 2016 he was a postdoctoral fellow at Kiel University. During this time, he also had a DAAD fellowship on which he spent a one-year mobility at King’s College London. In 2016, he held a Newton Postdoctoral fellowship at King’s College London, before joining Loughborough University in July. Robert’s research focusses on the combinatorial and algorithmic properties of sequences. His research interest also spans over automata and formal languages and bioinformatics algorithms. He is a Senior Lecturer since October 2022. Research areas Algorithms and Combinatorics on sequences Efficient Algorithms and Data Structures Automata Theory and Formal Languages Steering committee member for WORDS Programme committee member of CPM, DLT, WORDS, SPIRE, JM, PSC, DACS, SYNASC, Interplays, ICAART Organising committee member for WORDS 2023 & 2019 (co-chair), LSD&LAW 2016 (co-chair), SPIRE 2015, LSD&LAW 2015, LATA 2008, LATA 2007 Reviewer for several conferences and journals. Member of the Theoretical Computer Science (TCS) research theme Final Year Projects coordinator (Computer Science), since August 2020 Dr. Laura Hutchinson (2022)",
  "content_length": 1811,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:01"
}