{
  "name": "Robert Granger",
  "homepage": "https://www.surrey.ac.uk/people/robert-granger",
  "status": "success",
  "content": "Dr Robert Granger | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all LinkedIn Google Scholar Dr Robert Granger Reader in Secure Systems MSci (Mathematics), PhD (Computer Science) +44 (0)1483 683037 r.granger@surrey.ac.uk10 BB 03Usually Wednesdays 11.00-12.00, but feel free to contact me regarding personal tutoring at any timeAcademic and research departments Surrey Centre for Cyber Security, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyRobert Granger holds an MSci from the School of Mathematics, University of Bristol (2002) and a PhD from the Department of Computer Science, University of Bristol (2006). He has held postdoctoral positions at: the Centre for Applied Cryptographic Research, University of Waterloo, Canada; his alma mater, again in the Cryptography and Information Security Group; and at the Claude Shannon Institute, University College Dublin, Ireland. Before joining the University of Surrey as a Lecturer in Secure Systems in December 2018, he was a scientist in the Laboratory for Cryptologic Algorithms, EPFL, Switzerland. He became a Senior Lecturer in Secure Systems in August 2021 and a Reader (what the University now designates as an Associate Professor) in August 2023.He is the Cryptography Research Theme Lead for the Computer Science Research Centre. Expand biography Areas of specialism Computational number theory and algebraic geometry; Cryptography and cryptanalysis; Algorithm design; Discrete mathematics; Finite field theory Affiliations and memberships International Association for Cryptologic Research (IACR) Member since 2003.NewsIn the media 26 May 2014 128-bit crypto scheme allegedly cracked in two hours: Boffins splat 'supersingular curve' crypto &nbsp; The Register 20 May 2014 Researchers crack unassailable encryption algorithm in two hours phys.org 20 May 2014Interviewed live on World Radio Switzerland to talk about&nbsp;breaking an industry-standard ‘128-bit secure’ genus two supersingular curve. World Radio Switzerland 03 March 2013Maths whizzes in bits after record code crack Irish Sunday TimesResearchResearch interestsI am a computational number theorist whose main specialism is the number-theoretic assumptions, applications and algorithms underlying public key cryptography. I have over a decade of experience conceiving and leading often groundbreaking research projects in this area, and am an expert in foundational cryptographic security assumptions. In particular, I have designed several highly original discrete logarithm algorithms for various algebraic groups (one receiving the Best Paper Award, CRYPTO 2013) and have set several world records for discrete logarithm computations with my teams. I have a natural passion for attacking interesting and hard problems (in cryptography and elsewhere), combining deep insights with powerful mathematical and computational techniques. In addition to cryptography and cryptanalysis, number theory, algebraic geometry, algorithm design, discrete mathematics and finite field theory, I am interested in various theoretical properties of irreducible polynomials and curves over finite fields. Expand research interests Research projects PKC-Sec: Security Analysis of Classical and Post-Quantum Public Key Cryptography Assumptions (EPSRC EP/W021633/1, 01/07/23 - 30/06/25) Public key cryptography (PKC) depends on the existence of computational problems that are incredibly hard - but not impossible - to solve. Classical examples that were fundamental to the origins of PKC in the 1970s (and indeed were prominent centuries earlier) are the integer factorisation problem and the discrete logarithm problem (DLP). While there are no known efficient, i.e., polynomial-time algorithms for solving these problems that run on classical computers, thanks to Shor's astounding breakthrough ideas in 1994, both can be solved efficiently on a quantum computer of sufficient size. Intense research in the areas of quantum computation, quantum information theory and quantum algorithms ensued, and replacement post-quantum (PQ) cryptosystems have been studied in earnest for the past 15 years or so, with standardisation efforts in process by both NIST and ETSI. PQ cryptosystems must be secure against both classical and quantum computers and therefore their underlying hardness assumptions must be studied intensely before they can be fully trusted to replace our existing PKC hardness assumptions. Until these standards have been established and cryptographic practice migrates entirely to PQ cryptography, it is also essential that the study of classical hardness assumptions persists, particularly as sporadic and sometimes spectacular progress can occur: for instance, for a special but large family of finite fields the DLP can be solved on a classical computer in quasi-polynomial time, i.e., `very nearly' efficiently, thanks to a series of results due to Dr. Granger and his collaborators, and Joux and his collaborators.In this project we will research and develop algorithms for solving computational problems that are foundational to the security of PKC, both now and in the future. In particular, we will study: the DLP in the aforementioned special family of finite fields, for which an efficient classical algorithm is potentially on the horizon; the security of the Legendre pseudo-random function, which is extremely well suited for multi-party computation and has been proposed for use in the next iteration of Ethereum - the de facto standard blockchain platform - but is not so well-studied; and finally the security of supersingular isogeny-based PQ cryptography, which although a relatively young field offers many very promising applications. Due to their nature, any cryptographic assumptions based on mathematical constructions are potentially weaker than currently believed, and we will deepen our understanding and assess the hardness of these natural and fundamental problems, thus providing security assurances to the cryptography community and more generally all users of cryptography. Expand research projects SupervisionPostgraduate research supervisionPrevious PhD students as Principal Supervisor:Bruno Sterner Previous PhD students (co-supervised):Benjamin Wesolowski (EPFL 2018)Naomi Benger (CSI 2010) Expand TeachingThis year (2024/25) I am teachingCryptography (COMM066) in the MSc in Cyber Security programme.Advanced Algorithms (COM2031)I also supervise Professional Projects (COM3001) and MSc dissertations (COMM002).Since 2020/21 I have been the Senior Examinations Officer for the department. Expand my teaching PublicationsRobert Granger, Thorsten Kleinjung, Arjen K Lenstra, Benjamin Wesolowski, Jens Zumbrägel Computation of a 30750-Bit Binary Field Discrete Logarithm, In: arXiv (Cornell University)DOI: 10.48550/arxiv.2008.02717This paper reports on the computation of a discrete logarithm in the finite field $\\mathbb F_{2^{30750}}$, breaking by a large margin the previous record, which was set in January 2014 by a computation in $\\mathbb F_{2^{9234}}$. The present computation made essential use of the elimination step of the quasi-polynomial algorithm due to Granger, Kleinjung and Zumbr\\\"agel, and is the first large-scale experiment to truly test and successfully demonstrate its potential when applied recursively, which is when it leads to the stated complexity. It required the equivalent of about 2900 core years on a single core of an Intel Xeon Ivy Bridge processor running at 2.6 GHz, which is comparable to the approximately 3100 core years expended for the discrete logarithm record for prime fields, set in a field of bit-length 795, and demonstrates just how much easier the problem is for this level of computational effort. In order to make the computation feasible we introduced several innovative techniques for the elimination of small degree irreducible elements, which meant that we avoided performing any costly Gr\\\"obner basis computations, in contrast to all previous records since early 2013. While such computations are crucial to the $L(\\frac 1 4 + o(1))$ complexity algorithms, they were simply too slow for our purposes. Finally, this computation should serve as a serious deterrent to cryptographers who are still proposing to rely on the discrete logarithm security of such finite fields in applications, despite the existence of two quasi-polynomial algorithms and the prospect of even faster algorithms being developed.Robert Granger Three Proofs of an Observation on Irreducible Polynomials over $\\text{GF}(2)DOI: 10.48550/arxiv.2302.11932We present three proofs of an observation of Ahmadi on the number of irreducible polynomials ove",
  "content_length": 39096,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:46"
}