{
  "name": "Robert Krüger",
  "homepage": "https://kruegert.github.io",
  "status": "success",
  "content": "About Me - Dr. Robert Krueger Dr. Robert KruegerAssistant Professor at New York University (NYU) Follow New York, NY Email LinkedIn Github Google ScholarI am an Assistant Professor for Computer Science and Engineering at New York University (NYU-CSE) and a member of VIDA, the Visualization, Imaging and Data Analysis Center at NYU Tandon. Before my professor position, I was a postdoc research fellow and subgroup leader at VCG Harvard, School of Engineering and Applied Sciences at Harvard University and a senior research scientist at the Laboratory of Systems Pharmacology, Harvard Medical School. I received my MS in Computer Science and Media at the Stuttgart Media University in 2012 and my Ph.D. degree (Dr. rer. nat.) in Computer Science at the Institute for Visualization and Interactive Systems, University of Stuttgart in 2017. My research interests lie in the field of data visualization and visual analytics for on spatial and spatially-referenced multivariate data with a focus on biomedical visualization to understand diseases, most notably cancer.Latest NewsMay 2024 We publised several new papers in IEEE TVCG, IEEE CGA, and Molecular Oncology, including Cell2Cell, an approach for cell interaction analysis in multi-volume imaging data, and a state of the art report on Single-Cell Atlas Data Visualization in the Biological Literature.September 2023 Our new approach Residency Octree: A Hybrid Approach for Scalable Web-Based Multi-Volume Rendering aids biomedical experts in visually exploring and analyzing large and multiplexed 3D tissue data in the web. It will be published on IEEE Explore and presented at IEEE VIS 2023 in Melbourne.May 2023 I am excited to announce that I will start as an Assistant Professor (tenure track) at NYU in New York City this fall! I am looking forward to join the team at the Visualization Imaging and Data Analysis Center (VIDA) at NYU Tandon.Nov 2022 The preprint of our collaboration paper Lymphocyte networks are dynamic cellular communities in the immunoregulatory landscape of lung adenocarcinoma appeared on bioArxiv.Nov 2022 The IEEE VIS 2022 paper Visinity: Visual Spatial Neighborhood Analysis for Multiplexed Tissue Imaging Data appeared in IEEE Transaction on Visualization and Computer Graphics (TVCG).Nov 2021 Our paper Narrative Online Guides for the Interpretation of Digital-Pathology Images and Tissue-Atlas Data appeared in Nature Biomedical EngineeringSept 2021 Since Fall 2021 I am leading a subgroup at VCG Harvard that collaborates with the Laboratory of Systems Pharmacology (at Harvard Medical School) on visualization and analysis of biomedical datasets.Sept 2021 Two new papers accepted for IEEE VIS 2021 and the Transaction on Visualization and Computer Graphics journal. Scope2Screen is a focus+context-based exploration and annotation approach for large multiplex biomedical image data, and GenNI is a human-AI collaboration for data-backed text generation. See publications.Jan 2021 I am grateful that I will be awarded with a Harvard Certificate of Distinction and Excellence in Teaching (Q Awards) based on student evaluation of my teaching role in the Harvard College course CS171.July 2019 Two new papers accepted for IEEE VIS 2019 VAST track and the Transaction on Visualization and Computer Graphics journal. See publications.Apr 2019 I am grateful for being awarded with a Harvard Certificate of Distinction and Excellence in Teaching (Q Awards)Oct 2018 My dissertation was selected (and will be awarded) as one of two Honorable Mentions of this year’s VGTC VPG best dissertation award at IEEE VIS 2018July 2018 Our new paper is published: Immersive Modular Factory Layout Planning using Augmented RealityMay 2018, Cambridge, USA New Position: Postdoctoral Research Fellow @ VCG, Harvard UniversityApril 2018, Kobe, Japan TVCG/ IEEE PacificVis Honorable Mention: Visual Interactive Map MatchingNovember 2017, Adelaide, Australia IEEE BDVA Best Paper Award: VESPa 2.0: Data-Driven Behavior Models for Visual Analytics of Movement Sequences",
  "content_length": 4033,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:54"
}