{
  "name": "Robert Elsässer",
  "homepage": "https://algorithms.cosy.sbg.ac.at/group/robert-elsaesser.html",
  "status": "success",
  "content": "Efficient Algorithms (en) - Universität Salzburg Accesskeys  : Main menu (Accesskey - 1) Skip to main content (Accesskey - 2) Subnavigation (Accesskey - 3) Footer (Accesskey - 4) Search (Accesskey - 5) DE Search Item 1 Item 2 Item 3 Library E-Mail E-Learning PLUS-Login PLUSOnline More Press CIVIS Jobs PLUS Research Ukraine | Support Blog HomeEfficient Algorithms (en)Research Our research group focuses on different algorithmic aspects of modern models of computation, such as parallel and distributed computing. Parallel and distributed algorithms are used to solve large, computationally intensive problems in science and engineering. We work on the interface between discrete mathematics, theoretical computer science, and parallel aspects of computing. We combine various techniques from these fields to design efficient solutions for problems such as information dissemination, distributed communication, network exploration, load balancing, and graph models for large real world networks. Teaching In teaching, we cover the basic course for algorithms and data structures for 1st year students, as well as more advanced courses on algorithms for 3rd year bachelor and master students. In addition, we run basic courses in theoretical computer science. We also offer a number of seminars and projects related to parallel and distributed algorithms. Overview HomeEfficient Algorithms (en) ResourcesFor aspiring students For current students For alumni For staff (in German) For media UniversityLocations Events Event spaces Jobs InformationNews Bulletins (in German) Career Center Press Contact & HelpInternational Relations Department Services Students’ Union PLUS Respekt Whistleblower FAQs MorePLUS-Login Library E-Mail PLUSonline Universität Salzburg Kapitelgasse 4-6 5020 Salzburg, Austria T +43 (0) 662 8044-0 F +43 (0) 662 8044-145Follow us Copyright © 2025 University of Salzburg. All Rights reserved. Imprint and photo credits Freedom of information and data protection",
  "content_length": 1984,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:43"
}