{
  "name": "Robert Amor",
  "homepage": "https://www.cs.auckland.ac.nz/~trebor",
  "status": "success",
  "content": "Robert Amor's Home Page Robert Amor's Home Page Home Students Publications Projects Conferences I am a professor at the School of Computer Science at the University of Auckland. While my PhD was in computer science I am really interested in the application of computer science to the fields of architecture, engineering, construction and facility management (A/E/C-FM). This came from several years working at the School of Architecture at Victoria University of Wellington, then in the mid 1990's I had 5 years at the (now defunct) Centre for Construction IT at the BRE in the UK, where I observed the problems associated with the introduction of computing into the architecture, engineering and construction fields. I've also had the great fortune to spend sabbatical time at Yonsei University in Seoul, South Korea, CSTB in Sophia Antipolis, France, Penn State University in State College, USA, Technical University of Eindhoven in Eindhoven, The Netherlands, University of Twente in Enschede, The Netherlands, EPFL in Lausanne, Switzerland, Georgia Tech in Atlanta, USA, RMIT in Melbourne, Australia, and TU Delft in Delft, The Netherlands. Detailed Information There is a lot more information about me available through the navigation bars. The majority of my papers are available online, but some are copyright by various publishers so you will need to look them up at their source. There is information on projects I have undertaken over the years as well available projects. I keep track of the successes of my past students as well as those currently working with me. I also maintain a listing of forthcoming conferences in my research field. Contact Details Professor Robert Amor Maths & Physics Building, Room 401 School of Computer Science University of Auckland Private Bag 92019 Auckland 1142 New Zealand Mobile: +64-21-368 814 Phone: +64-9-373 7599 x83068 FAX: +64-9-373 7453 Skype: trebor-nz Robert Amor- Email: trebor@cs.auckland.ac.nz",
  "content_length": 1952,
  "method": "requests",
  "crawl_time": "2025-12-01 14:18:26"
}