{
  "name": "Robert van Liere",
  "homepage": "http://homepages.cwi.nl/~robertl",
  "status": "success",
  "content": "Robert van Liere at CWI Robert van Liere Visualization and Virtual Reality Robert van Liere Principal Investigator Visualization and Virtual Reality CWI, Amsterdam Contents Biographical Sketch VR on Dutch TV Visualization and Virtual Reality Research Publications The PSS Page Photo Album Vakantie Huis Ardennen Vakantie Huis Zeeland Tijdelijke Tapijten Biographical Sketch Prof. dr. ir. Robert van Liere is a senior researcher at Center for Mathematics and Computer Science (CWI) in Amsterdam, where he heads the Visualization and Virtual Reality research group. He also holds a part-time position as full professor at the Technical University in Eindhoven. Prior to joining CWI in 1985 he worked at TNO-IBBC, a Dutch institute for building and construction research in Rijswijk. Robert received a Ph.D. in computer science from University of Amsterdam and a master degree in computer science from University of Delft. His research interests involve interactive visualization, virtual reality, and human-computer interaction. He has served on numerous program commitees, has been involved in the organization of various workshops / symposiums / conferences, and is a member of the IEEE and EuroGraphics. Robert was born in Beirut, Lebanon. He is fortunate to have lived and visited many countries and seen many different cultures. Proir to moving to the Netherlands, he lived in Syria (1956-1964), Lebanon (1964-1967) and Thailand (1967-1974). His hobbies include transcontinental travelling and biking. The blue dots on the map in the left image below show the capitals of the countries/states which have been visited. The right image is a recent picture on the bike somewhere close to Lucca, Italy. (click on the images to obtain a larger view). Virtual Reality on Dutch TV I was on the Dutch television program \"De Digitale Revolutie\" broadcasted on Saterday 14 April, 2001. Click on the image above to play the 5 minute MPG file (size 45 MBytes, which can take a while to download). This interview shows some of the Virtual Reality work we are doing. Visualization and Virtual Reality Research At CWI, I head the Visualization and Virtual Reality group. This group studies those mechanisms that support the development of visualization techniques at the systems and user levels. These techniques include those found in virtual reality and and data visualization. The applications studied originate from joint projects with partners, who bring in the application domain expertise. An example is the Bio-VR project with cell biologists from the University of Amsterdam. Recent developments in laser scanning confocal microscopy have allowed biologists to obtain high quality 4D-images of biological objects, such as cells and tissues. A fundamental problem in understanding cellular structures is the inherent complexity and spatial relationships of these structures. We have studied the idea of exploring cell structures in a virtual environment. The combination of stereoscopic graphics and head-coupled displays can aid in the unambiguous display of complex cell structures. Interaction techniques coupled to spatial input devices provide the users a natural means of directly manipulating with the underlying data. Two topics are addressed in the visualization group: from the user's perspective, how does the application of interactive visualization result in a more effective modeling, computation and analysis cycle? at the systems level, how can the development costs of interactive visualization applications be lowered? Solutions to the resulting research questions involve the development of innovative techniques for the visualization of and interaction with the underlying data, as well as the development of innovative techniques for the simplification of resulting visual representations. I believe that the development of small-scale prototype systems is essential to the understanding of the problems associated with visualization research, although the research results will extend beyond the building of proof-of-concept implementation systems. Compostion of the group per 1 october 2009 Robert van Liere Group Leader Chris Kruszynski Phd-student Ferdi Smit Phd-student Liu Lei Phd-student Vacancy Phd-student Vacancy Phd-student Vacancy Post Doc Click here for more information on our vacancies. Video Gallery Here is a selection of some projects. Click on an image for the video. Warning: some videos can be very large. Turbulent Flow Data: Prof. A. Veldman, RU Groningen Visualization: Wim de Leeuw Video format mpg, size:left 36 MB, right 8 MB Cell Decondensation Data: Prof. R. van Driel, UvA Visualization: Wim de Leeuw Video format mpg, size: 10 MB Measuring Corals Data: Dr J. Kaandorp, UvA Visualization: Chris Kruszynski Video format mov, size: 15 MB Coral Growth Data: Dr J. Kaandorp, UvA Visualization: Andrei Jalba Video format mov, size: 4 MB Crosstalk Reduction Visualization: Ferdi Smit Video format mov, size: 30 MB Image Warping Visualization: Ferdi Smit Video format mov, size: 30 MB Publications Journal \"Enabling 3D CT-scanning of cultural heritage objects using only in-house 2D X-ray equipment in museums\" F. G. Bossema, W.J. Palenstijn, A. Heginbotham, M. Corona, T. van Leeuwen, R. van Liere, J. Dorscheid, D.O. Flynn, J. Dyer, E. Hermens , K.J. Batenburg, Nature Communications volume 15, 3939, 2024 \"Joint 2D to 3D image registration workflow for comparing multiple slice photographs and CT scans of apple fruit with internal disorders\", D.E. Schut, R.M. Wood, A.K. Trull, R. Schouten, R. van Liere, T. van Leeuwen, K.J. Batenburg, Postharvest Biology and Technology, volume 211 (2024). \"CT-based data generation for foreign object detection on a single X-ray projection\" V. Andriiashen, R. van Liere, T. van Leeuwen, K.J. Batenburg, Scientific Reports, volume 13, issue 1 (2023). \"A tomographic workflow to enable deep learning for X-ray based foreign object detection\" M.T. Zeegers, T. van Leeuwen, D.M. Pelt, S.B. Coban, R. van Liere, K.J. Batenburg, Expert Systems with Applications, volume 206 (2022). \"Looking under the skin: multi-scale CT scanning of a peculiarly constructed cornett in the Rijksmuseum\" J. Dorscheid, F.G. Bossema, P. van Duin, S.B. Coban, R. van Liere, K.J. Batenburg, G.P. Di Stefano, Heritage Science, volume 10, issue 1 (2022). \"TOP-CT: Trajectory With Overlapping Projections X-Ray Computed Tomography\" D.E. Schut, K.J. Batenburg, R. van Liere, T. van Leeuwen IEEE Transactions on Computational Imaging, volume 8 (2022). \"The Dual Space: Concept and Applications in Cultural Heritage\" R. van Liere, K.J. Batenburg, I. Garachon, C.L. Wang, J. Dorscheid, IEEE BITS the Information Theory Magazine (2022). \"The Study of Three-Dimensional Fingerprint Recognition in Cultural Heritage\" D. Sero, I. Garachon, E. Hermens, R. van Liere , K.J. Batenburg, Journal on Computing and Cultural Heritage, volume 14, issue 4, pages 1-20, 2021 \"Revealing the Secrets of Chinese Ivory Puzzle Balls: Quantifying the Crafting Process Using X-Ray Computed Tomography\" R. van Liere, C-L. Wang The Rijksmuseum Bulletin, volume 69, issue 3, pages 244-263, 2021 \"Unsupervised Foreign Object Detection Based on Dual-Energy Absorptiometry in the Food Industry\" V. Andriiashen, R. van Liere, T. van Leeuwen, K. J. Batenburg , MDPI Journal of Imaging, 7, 104, 2021. \"Integrating expert feedback on the spot in a time-efficient explorative CT scanning workflow for cultural heritage objects\" F.G. Bossema, S.B. Coban, A. Kostenko, P. van Duin, J. Dorscheid, I. Garachon, E. Hermens, R. van Liere, K.J. Batenburg, Journal of Cultural Heritage, volume 49 (2021). \"Towards X-ray Plenoptic Imaging: Emulation with a Laboratory X-ray Scanner\" N. Viganò, F. Lucka, O. de La Rochefoucauld, S.B. Coban, R. van Liere, M. Fajardo, P. Zeitoun, K.J. Batenburg, Digital Holography and Three-Dimensional Imaging (2021) \"Emulation of X-ray Light-Field Cameras\", N Viganò, F. Lucka, O. de La Rochefoucauld , S. Bethany Coban, R. van Liere , M. Fajardo, , P. Zeitoun , K. J. Batenburg , MDPI Journal of Imaging, 6, 138, 2020. \"Task-Driven Learned Hyperspectral Data Reduction Using End-to-End Supervised Deep Learning\" M. T. Zeegers , D. M. Pelt , T. van Leeuwen , R. van Liere and K. J. Batenburg, MDPI Journal of Imaging, 6, 132, 2020 \"Prototyping X-ray tomographic reconstruction pipelines with FleXbox\" A. Kostenko, W.J. Palenstijn, S.B. Coban, A.A. Hendriksen, R. van Liere, K.J. Batenburg, SoftwareX, 11, 100364, 2020 \"Advanced light-field refocusing through tomographic modeling of the photographed scene\". N. Vigano, P.M. Gil, C. Herzog, O. de la Rochefoucauld, R. van Liere, K.J. Batenburg, Opt. Express 2018, 27, 6. \"Tomographic approach for the quantitative scene reconstruction from light field images\". Viganò, N.; Der Sarkissian, H.; Herzog, C.; de la Rochefoucauld, O.; van Liere, R.; Batenburg, K.J. Opt. Express 2018, 26, 22574. \"Modeling Object Pursuit for Desktop Virtual Reality\" L. Liu, R. van Liere IEEE Transactions on Visualization and Computer Graphics, vol 18, nr 7, pp 1017--1026, 2012 \"Modeling the effect of force feedback for 3D steering tasks\" L. Liu, R. van Liere, K.J. Kruszynski, Eurographics (2011) \"Revisiting path steering for 3D manipulation tasks\" L. Liu, J-B. Martens, R. van Liere International Journal of Human-Computer Studies, vol 69, nr 3, 2011 \"A comparison between coral colonies of the genus Madracis and simulated forms\" M. Filatov, J. Kaandorp, M. Postma, M. Vermeij, R. Bak, R. van Liere, G. Streekstra, K. Kruszynski Proceedings of the Royal Society B (Biological Sciences) , 2010 2009 \"Perception of Mechanically and Optically Simulated Bumps and Holes\" K. van Mensvoort, P. Vos, D. Hermes, R. van Liere ACM Transactions on Applied Perception (TAP), vol 7, nr 2, 2010 \"A Shared-Scene-Graph Image-Warping Architecture for VR: Low Latency versus Image Quality\" F.A. Smit, R. van Liere, S. Beck, B. Froehlich Accepted for publication, Elsevier Computers and Graphics, vol 34 (1), pp 3-16, 2010 \"A Programmable Displ",
  "content_length": 26661,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:17"
}