{
  "name": "Robin R. Murphy",
  "homepage": "http://faculty.cs.tamu.edu/murphy",
  "status": "success",
  "content": "Robin Murphy-Department of Computer Science and Engineering Texas A&M University Department of Computer Science and Engineering Contact Info Quick Links Office: EABA 118C Office Hours: by appointment only Email: robin.r.murphy at tamu.edu Follow Dr. Murphy on: Blogs: CRASAR Blog on disaster roboticsBlog on real science in science fiction robots For CRASAR updates: Please note I retired from TAMU in May 2025. Though I remain active in research and field work, I am not taking on new graduate students or post-docs. (And, yes, the webpages need to be updated- you would probably think I would have time now that I'm retired but no...) Dr. Robin Murphy Professor Emeritus, Computer Science and Engineering (former Raytheon Professor) IEEE Fellow, ACM Fellow, AAAS Fellow Center for Robot-Assisted Search and Rescue (CRASAR) Disaster Thrust Lead for NSF AI Institute for Societal Decision Making (AI-SDM) Professor (courtesy) Robotics Institute Carnegie Mellon University :: Dr. Murphy's bio :: Publications :: Awards and Honors :: CRASAR :: Respond-R :: Current Research :: Courses :: For interested grad students Looking for... Learn AI and Human-Robot Interaction through Asimov's I, Robot Stories (2019) Robotics Through Science Fiction (MIT Press Fall 2018) 2012 Defense Science Board Study: The Role of Autonomy in DoD Systems ACM Webinar on Computing for Disasters (2018) Disaster Robotics (MIT Press 2014) Computing for Disasters: A Report from the Community Workshop CRASAR Research Topics and Resources My primary research is in artificial intelligence for mobile robots as applied to disaster robotics. As my analyses have shown that 50% of the terminal failures in disaster robotics are due to human error, a significant portion of my work is in human-robot interaction. My research uses a field methodology, working with responders and agency stakeholders to determine gaps that lead to the formulation of applied and fundamental research thrusts. We have participated in 30 disasters or incidents and over 35 exercises gathering data spanning urban search and rescue, structural inspection, hurricanes, flooding, mudslides, mine disasters, radiological events, and wilderness search and rescue. © Copyright 2008 Department of Computer Science and Engineering | Texas A&M Engineering | Texas A&M University",
  "content_length": 2319,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:38"
}