{
  "name": "Robin Bing-Yu Chen 0004",
  "homepage": "http://graphics.im.ntu.edu.tw/~robin",
  "status": "success",
  "content": "Robin's Homepage [Services] [Schedule] [Courses] [Publications] [ORCiD] [Google Scholar Profile] [DBLP] [ResearchGate] [Scopus] [Web of Science] [ArnetMiner] Affiliation Distinguished Professor Dept. of Computer Science and Information Engineering Dept. of Information Management Graduate Inst. of Networking and Multimedia College of Design and Innovation (D-School) National Taiwan University Deputy Minister National Science and Technology Council, Taiwan Contact Information Add National Taiwan University No. 1, Roosevelt Rd. Sec. 4, Taipei, 106-17, Taiwan TelFax +886-2-3366-1193+886-2-2362-1776 Email robin(AT)ntu.edu.tw Web http://graphics.csie.ntu.edu.tw/~robin/ Cooperating Laboratories Interactive Graphics Laboratory and Communications and Multimedia Laboratory Dept. of Information Management Dept. of Computer Science and Information Engineering Graduate Inst. of Networking and Multimedia National Taiwan University Courses Spring 2025 Entrepreneurship Project@EiMBA also in Fall 2024 (with Keng-Yu Ho), Spring 2023, Fall 2022, Spring 2021, Fall 2020, Spring 2018, Fall and Spring 2017 (with Chialin Chen) Spring 2025 Cloud Native Application Development (with TSMC IT) also in Fall 2023 Fall 2024 Game Programming also in Fall 2023 (with Ken-Yi Lee), 2022, 2021 (with Ken-Yi Lee and Yung-Ting Lee), 2020 (with Ken-Yi Lee and Min-Hsiang Hung), 2019, 2018 (with Chuan-Chang Wang and Min-Hsiang Hung), 2017 (with Yu-Chi Lai and Chih-Yuan Yao), 2015, 2014, 2013, 2011, 2010, 2009, 2007 and 2006 (with Chuan-Chang Wang) Summer 2024 Global Management Practice for Entrepreneurship and Innovation@EiMBA also in Winter 2019 Spring 2024 Game for Life (with Wenn-Chieh Tsai, Shenglin Elijah Chang, and Hui-Fen Mao) also in Spring 2023, 2021 and 2020 (with Wenn-Chieh Tsai and Shenglin Elijah Chang) Spring 2024 Creativity and Design Thinking@EiMBA (with Luo Lu and Rax Liu) also in Spring 2020 (with Rax Liu) and Spring 2022 and 2019 (with Luo Lu and Rax Liu) Fall 2022 MIS Seminar (with Ching-Chin Chern) also in Fall 2018, 2014, 2011 and Spring 2005 Spring 2022 Entrepreneurship Core Course and Project@CEP (with Ching-Hsuan Lin and Chia-Wei Kuo) also in Fall, Summer, Spring 2021 and Fall 2020 (with Ching-Hsuan Lin and Chia-Wei Kuo), Spring 2020 (with Ching-Hsuan Lin), Fall 2019 (with Ching-Hsuan Lin and Audrey Wen-hsin Hsu), Spring 2019 (with Ching-Hsuan Lin), Fall and Spring 2018 (with Ching-Hsuan Lin and Shao-Yi Chien) and Fall 2017 (with Ching-Hsuan Lin) Fall 2021 Designing Experiences within Living Landscapes (with Wenn-Chieh Tsai and Shenglin Elijah Chang) also in Fall 2020 (with Wenn-Chieh Tsai, Rung-Huei Liang, and Shenglin Elijah Chang) Spring 2021 Data Structures and Advanced Programming (with Fu-Ying Cherng) also in Spring 2020 (with Ling-Chieh Kung) Spring 2018 Information Technologies and Applicaitons@EiMBA Spring 2016 Human-Computer Interaction (with Rong-Hao Liang) Fall 2015 Computer Organization and Structure also in Fall 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007, 2006, 2005, 2004 and 2003 Spring 2013 Geometric Modeling also in Spring 2007, Fall 2005 and Spring 2004 Spring 2013 IM Ph.D. Forum (with Hsin-Min Lu) also in Fall 2009 (with Ching-Chin Chern) Summer 2012 Geometric Modeling@U. of Tokyo (in Japanese) Summer 2012 Computer Graphics@U. of Tokyo (with Tomoyuki Nishita, in Japanese) also in Summer 2011-2008 Fall 2010 Computer Graphics@HTC (with Tz-Huan Huang and Ken-Yi Lee) Fall 2008 3D Graphics@Digital Content Inst. also in Fall, Summer 2007, Winter, Fall 2006, Winter 2005 and 2004 Spring 2007 Operating Systems also in Spring 2004 Spring 2006 Machine Learning for Graphics, Vision and Multimedia (with Yung-Yu Chuang) Fall 2005 Advanced Multimedia Technology (with Ja-Ling Wu, Yi-Ping Hung, and Yung-Yu Chuang) Spring 2005 Digital Content Technologies Fall 2004 Computer Graphics also in Fall 2003 Experiences Distinguished Professor, IM & CSIE & GINM & D-School, NTU, 08/2020 - Deputy Minister, NSTC, 05/2024 - Visiting Researcher, RCAST, U-Tokyo, 04/2016 - 03/2017, 04/2022 - Visiting Researcher, GITS / GITI, Waseda-U, 12/2012 - Dean, D-School, NTU, 02/2019 - 05/2024 Director, CEP, NTU, 10/2016 - 03/2022 Associate Director, IoX Center, NTU, 01/2016 - 07/2021 Professor, IM & CSIE & GINM, NTU, 08/2011 - 07/2020 Director, EiMBA, College of Management, NTU, 10/2016 - 07/2019 Associate Dean, College of Management, NTU, 08/2013 - 07/2019 Visiting Researcher, IPC, U-Tokyo, 01/2016 - 03/2017 Visiting Researcher, KMD, Keio-U, 12/2014 - 03/2016 Visiting Researcher, UEI Research, 07/2013 - 02/2016 Associate Director, Intel-NTU Connected Context Computing Center, NTU, 10/2012 - 01/2016 Professor, CSE, U-Tokyo, 01 - 09/2012 Director, Computer Center, College of Management, NTU, 08/2007 - 03/2012 Visiting Researcher, CS, U-Tokyo, 01/2008 - 09/2011 Associate Professor, CSIE, NTU, 02/2008 - 07/2011 Associate Professor, IM & GINM, NTU, 08/2007 - 07/2011 Assistant Professor, GINM, NTU, 08/2005 - 07/2007 Assistant Professor, IM, NTU, 08/2003 - 07/2007 Research Associate & System Administrator, Computer Graphics Lab., IS & CS & CSE, U-Tokyo, 10/1999 - 07/2003 Research Assistant & System Administrator, Communications and Multimedia Lab., CSIE, NTU, 09/1994 - 09/1999 Project / System Manager, Secretariat and Affair / Secretariat Office, GHQ, Taiwan Army, 09/1997 - 06/1999 Educations Ph.D., in Information Science, The University of Tokyo, 2000-2003. Master of Science, in Computer Science and Information Engineering, National Taiwan University, 1995-1997. Bachelor of Science in Engineering, in Computer Science and Information Engineering, National Taiwan University, 1991-1995. High School of National Taiwan Normal University, 1988-1991. Wuchang Junior High School, Taipei, 1985-1988. Wuchang Elementary School, Taipei, 1979-1985. Last Update:",
  "content_length": 5814,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:33"
}