{
  "name": "Robin Walters 0001",
  "homepage": "https://www.khoury.northeastern.edu/people/robin-walters",
  "status": "success",
  "content": "Robin Walters - Khoury College of Computer Sciences All People Robin Walters (he/him) Assistant Professor Research interests Research interests Deep learning Equivariant neural networks Representation theory Algebraic geometry Education Education PhD in Mathematics, University of Chicago AB in Mathematics, Harvard University Biography Biography Robin Walters is an assistant professor in the Khoury College of Computer Sciences at Northeastern University, based in Boston. Walters’ research focuses on the role of symmetry in deep learning. By exploring ways of building a problem’s symmetry into a deep learning model as hard mathematical constraints, Walters has discovered it’s possible to improve not just that model’s data efficiency, but its generalization and trustworthiness as well. Now, as director of the Geometric Learning Lab, Walters is pushing the limits of these methods, making use of approximate symmetry and exploring everything from the theory of underlying symmetry in neural network structure to the subject’s range of practical applications. Walters also brings his background as a mathematician into the classroom, where he teaches computational theory. He enjoys watching his students develop the ability to think rigorously and communicate clearly about the complex topic, and he particularly enjoys mentoring graduate students. Walters is a visiting fellow at the Boston Dynamics AI Institute, where he develops equivariant neural networks for sample efficient robot perception and manipulation. In his free time, Walters enjoys sailing, hiking, swimming, playing board games, and spending time with his partner, Angela, and two children, Sidney and Sally. Recent publications Recent publications Published: September 2, 2025 Match Policy: A Simple Pipeline from Point Cloud Registration to Manipulation Policies Citation: Haojie Huang, Haotian Liu, Dian Wang , Robin Walters , Robert Platt . (2025). Match Policy: A Simple Pipeline from Point Cloud Registration to Manipulation Policies ICRA, 16907-16914. https://doi.org/10.1109/ICRA55743.2025.11128725 Published: June 16, 2024 Improving Convergence and Generalization Using Parameter Symmetries Citation: Bo Zhao, Robert M. Gower, Robin Walters , Rose Yu. (2024). Improving Convergence and Generalization Using Parameter Symmetries ICLR. https://openreview.net/forum?id=L0r0GphlIL Published: May 1, 2024 Discovering Symmetry Breaking in Physical Systems with Relaxed Group Convolution Citation: Rui Wang , Elyssa F. Hofgard, Hang Gao , Robin Walters , Tess E. Smidt. (2024). Discovering Symmetry Breaking in Physical Systems with Relaxed Group Convolution ICML. https://openreview.net/forum?id=59oXyDTLJv Published: May 1, 2024 Latent Space Symmetry Discovery Citation: Jianke Yang, Nima Dehmamy, Robin Walters , Rose Yu. (2024). Latent Space Symmetry Discovery ICML. https://openreview.net/forum?id=qstt2OguvM Published: January 16, 2024 Fourier Transporter: Bi-Equivariant Robotic Manipulation in 3D Citation: Haojie Huang, Owen Howell, Dian Wang , Xupeng Zhu, Robert Platt , Robin Walters . (2024). Fourier Transporter: Bi-Equivariant Robotic Manipulation in 3D ICLR. https://openreview.net/forum?id=UulwvAU1W0 Published: July 4, 2023 SEIL: Simulation-augmented Equivariant Imitation Learning Citation: Mingxi Jia, Dian Wang , Guanang Su, David Klee, Xupeng Zhu, Robin Walters, Robert Platt. (2023). SEIL: Simulation-augmented Equivariant Imitation Learning ICRA, 1845-1851. https://doi.org/10.1109/ICRA48891.2023.10161252 Published: July 4, 2023 Edge Grasp Network: A Graph-Based SE(3)-invariant Approach to Grasp Detection Citation: Haojie Huang, Dian Wang , Xupeng Zhu, Robin Walters, Robert Platt. (2023). Edge Grasp Network: A Graph-Based SE(3)-invariant Approach to Grasp Detection ICRA, 3882-3888. https://doi.org/10.1109/ICRA48891.2023.10160728 Published: February 27, 2023 Image to Sphere: Learning Equivariant Features for Efficient Pose Prediction Citation: David Klee, Ondrej Biza, Robert Platt, Robin Walters. (2023). Image to Sphere: Learning Equivariant Features for Efficient Pose Prediction ICLR. https://openreview.net/pdf?id=_2bDpAtr7PI Published: February 1, 2023 Generative Adversarial Symmetry Discovery Citation: Jianke Yang, Robin Walters, Nima Dehmamy, Rose Yu. (2023). Generative Adversarial Symmetry Discovery CoRR, abs/2302.00236. https://doi.org/10.48550/arXiv.2302.00236 Published: February 1, 2023 Symmetries, Flat Minima, and the Conserved Quantities of Gradient Flow Citation: Bo Zhao, Iordan Ganev, Robin Walters, Rose Yu, Nima Dehmamy. (2023). Symmetries, Flat Minima, and the Conserved Quantities of Gradient Flow ICLR. https://openreview.net/pdf?id=9ZpciCOunFb Published: November 16, 2022 The Surprising Effectiveness of Equivariant Models in Domains with Latent Symmetry Citation: Dian Wang , Jung Yeon Park, Neel Sortur, Lawson L. S. Wong, Robin Walters, Robert Platt. (2023). The Surprising Effectiveness of Equivariant Models in Domains with Latent Symmetry ICLR. https://openreview.net/pdf?id=P4MUGRM4Acu Published: July 17, 2022 Toward Compositional Generalization in Object-Oriented World Modeling Citation: Linfeng Zhao, Lingzhi Kong, Robin Walters, Lawson L. S. Wong. (2022). Toward Compositional Generalization in Object-Oriented World Modeling ICML, 26841-26864. https://proceedings.mlr.press/v162/zhao22b.html Published: June 8, 2022 Integrating Symmetry into Differentiable Planning with Steerable Convolutions Citation: Linfeng Zhao, Xupeng Zhu, Lingzhi Kong, Robin Walters, Lawson L. S. Wong. (2023). Integrating Symmetry into Differentiable Planning with Steerable Convolutions ICLR. https://openreview.net/pdf?id=n7CPzMPKQl Published: May 4, 2022 Probabilistic Symmetry for Multi-Agent Dynamics Citation: Sophia Huiwen Sun, Robin Walters, Jinxi Li, Rose Yu. (2023). Probabilistic Symmetry for Multi-Agent Dynamics L4DC, 1231-1244. https://proceedings.mlr.press/v211/sun23a.html Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://www.robinwalters.com/ Google Scholar See Citations Areas of Interest Artificial Intelligence Machine Learning Robotics Contact r.walters@northeastern.edu Related news 25 in ’25: Record number of Khoury research apprentices showcase work in Boston May 16, 2025 Explore all news Current PhD students Yuxuan Chen PhD Student Read bio Locations Close this dialog window Boston Boce Hu PhD Student Read bio Locations Close this dialog window Boston Haojie Huang PhD Student Read bio Locations Close this dialog window Boston Lucas Laird PhD Student Read bio Locations Close this dialog window Boston Jung Yeon Park PhD Student Read bio Locations Close this dialog window Boston Claire Schlesinger PhD Student Read bio Locations Close this dialog window Boston Dian Wang PhD Student Read bio Locations Close this dialog window Boston Parnian Zameni PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 6901,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:38"
}