{
  "name": "Robin Cockett",
  "homepage": "http://www.cpsc.ucalgary.ca/~robin",
  "status": "success",
  "content": "CPSC Faculty Brochure ROBIN COCKETT Credentials B.Sc. (1974) Warwick University, England Ph.D. (1979) Leeds University, England Present Position Professor, Department of Computer Science Key Words: Distributive categories, extensive categories, linearly distributive categories; Restriction categories, Turing categories, differential categories, tangent categories; Categorical proof theory, semantics of computation, semantics of concurrency; Categorical programming, quantum programming, differential programming. Research: The charity project CaMPL (Categorical Message Passing Language) Logic and Category Theory Seminars: the Calgary Peripatetic Research Group on Logic and Category theory Linearly distributive categories work with Robert Seely and Rick Blute. Linear bicategories with Robert Seely and Jurgen Koslowski Restriction categories with Steve Lack Some student theses here. LQPL - Linear Quantum Programming Language compiler and emulator, available for download. Some recent talks: Mathematics of program construction (2006) Estonia:  What is a good process semantics? Association for Symbolic Logic (2006) Montreal: Programming with classical quantum datatypes. Category theory and semigroups (2006) Calgary: Topological aspects of restriction categories. Octoberfest Category theory meeting (2006) Ottawa: Seely categories revisited. Fields Institute Meeting on Traces (2007) Ottawa: Itegories and PCAs. FMCS (2007) Colgate and the Lisbon semigroup micro-workshop (2007): Turing Categories. International Category Theory Meeting (2007) Carvoeiro, Portugal: Join restriction categories and the importance of being adhesive. Ottawa-Fields Institute Meeting on Smooth Structures (2009) Ottawa: Cartesian differential categories. Estonia Winter School (2010) Palmse, Lahemaa, Estonia: Categories and Computability, lectures 1, 2, 3, and 4. Teaching: cpsc449: Programming language paradigms cpsc411: Compiler construction I cpsc417 : Foundations of functional programming cpsc510: Compiler construction II (second semester) cpsc521: Foundations of functional programming (new version) cpsc617: Category theory for computer science cpsc613: Program transformation cpsc700.04: Topics in proof theory cpsc601.02: HoTT cpsc601.03: Categories in Physics cpsc601.09: Readings in Topos Theory Service: Research and Planning (secure website here) Editor of Mathematical Structures in Computer Science Organizer of Foundational Methods in Computer Science (FMCS) in 1999, 2003 , 2004, 2006 (with CMS meeting), 2010, and 2011 (after the CMS meeting), 2014, 2019, 2022, and 2024. Organizer of the Peripatetic Seminar at the University of Calgary Statement: I am a concerned Scientist. I do not believe that economic growth is more important than sustaining our global environment. I do believe that Alberta's continued development of the tar sands is deeply and morally wrong. I am deeply concerned about the lack of Scientific oversight in the governance of Alberta ... and Canada. Other: The National Energy Board (NEB) gives the Northern Gateway a conditional go ahead ... BUT what were those probability calculations? For doubters: has global warming just stopped?  Well maybe not quite yet!  Watch this (old news) and then this (more recent news)! Greta Thunberg on the climate emergency \"How dare you!\" (here). Adrian Tadic's cartoon of humanity's future (here)",
  "content_length": 3372,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:35"
}