{
  "name": "Robin Gras",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1048/dr-robin-gras",
  "status": "success",
  "content": "Dr. Robin Gras | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Robin Gras Dr. Robin Gras Professor Former Canada Research Chair 8111 Lambton Tower 519.253.3000 ext. 2994 rgras@uwindsor.ca Research Interests: Deep Learning/Machine Learning Natural Language processing Vision Individual-based modeling Theoretical Biology Affiliations: CSO and Partner at Movyl Technologies and MVYL Associates Cross-appointed by the Biology Department Cross-appointed by the Great Lakes Institute for Environmental Research Selected Publications: Bhattacharjee S., Gras R., Estimation of Distribution using Population Queue based Variational Autoencoders, IEEE Congress on Evolutionary Computation, 2019, In Press. Scott R.; MacPherson B., Gras R., A comparison of stable and fluctuating resources with respect to evolutionary adaptation and life-history traits using individual-based modeling and machine learning, Journal of Theoretical Biology, 459(14), 52-66, 2018. Scott R., Zhan A., Brown E.A., Chain F.J.J., Cristescu M.E., Gras R., MacIsaac H.J., Optimization and performance testing of a sequence processing pipeline applied to detection of nonindigenous species, Evolutionary Applications, 11, 891-905, 2018. Mashayekhi M., Gras R., Rule Extraction from Decision Trees Ensembles: New Algorithms based on Heuristic Search and Sparse Group Lasso Methods, International Journal of Information Technology & Decision Making, 16, 6, 1707-1727 2017. MacPherson B., Gras R., Individual-Based Ecological Models: Adjunctive Tools or Experimental Systems?, Ecological Modelling, 323, 106-114, March 2016. Gras R., Golestani A., Hendry A., Cristescu M., Speciation without pre-defined fitness functions, PLOS ONE, 2015. Golestani A., Gras R., Cristescu M., Speciation with gene flow in a heterogeneous virtual world: can physical obstacles accelerate speciation?, Proceedings of the Royal Society B: Biological Sciences, 279(1740), 3055-3064, 2012. Websites: http://sites.google.com/site/ecosimgroup/home http://movyltech.net/ https://www.mvyl-associates.com/ share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 4694,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:35"
}