{
  "name": "Robson Eduardo De Grande",
  "homepage": "http://www.cosc.brocku.ca/~rdegrande",
  "status": "success",
  "content": "Robson E. De Grande Robson E. De Grande Associate Professor Department of Computer Science Brock University Email [email protected] Phone +1 (905) 688-5550 ext. 3090 Address 1812 Sir Isaac Brock Way St Catharines, Ontario, Canada L2S 3A1 in About Education Ph.D. in Computer Science, University of Ottawa, Canada M.Sc. in Computer Science, Federal University of Sao Carlos, Brazil B.Sc. in Computer Science, Federal University of Sao Carlos, Brazil Publication Highlights Ensemble SARSA and LSTM for User-centric Handover Decisions in 5G Vehicular Networks. Mubashir Murshed, Glaucio H. S. Carvalho, and R. E. De Grande Robson E. De Grande. IEEE Transactions on Intelligent Transportation Systems. In Press, 2024 MDP-based connectivity and availability models for Internet of Vehicles. Abubakar Saad, Penghan Yan, and Robson E. De Grande. Elsevier Internet of Things, 24: 100963, 2023 Book Intelligent Transport System in Smart Cities: Aspects and Challenges of Vehicular Networks and Cloud. Rodolfo I. Meneguette, Robson E. De Grande, Antonio A. F. Loureiro. in Series: Urban Computing. Publisher: Springer. ISBN 978-3-319-93332-0. DOI 10.1007/978-3-319- 93332-0. Pages 390. 2018 Research Research Interests Vehicular Networks - Multi-RAT, High Mobility, Ultra Density, 5G NG Mobility Management Handover Management Traffic Steering Connectivity stability / intermittency Intelligence on the Edge Distributed / Decentralized / Federated learning IoT / IoV Dissemination and applications Performance Mobile Cloud Computing / Vehicular Clouds HPC and allocation Offloading heuristics Classification and ML Applications (ITS) Intelligent Transportation Systems Path Recommendation, Traffic management, and Traffic analysis Research Team PhD Thesis Mubashir Murshed Douglas Lieira (visiting) Victor Vilchez Diaz (visiting) MSc Thesis Parinaz Bigdelian Israt Jabin Afrin Jubaida Nadia Karimzadeh Undergrad Students Jacob Drobena Darsh Kurmi Cam Carvalho Harman Malhi Nitish Kartikkumar K. Parekh Entire Research Group Research Description My research interests primarily involve algorithms and protocols for supporting and enabling large-scale distributed systems, which concern urban computing, intelligent transportation, and PDES (Parallel Discrete-event Simulations). Due to the focus on high performance, my projects make use of optimization strategies, [meta-]heuristics, and learning algorithms in a distributed setup. My research work thus faces challenges on the complexity and scale of problems, fairness, unpredictability, and volatility. I have explored the MDP (Markov Decision Process) modelling to tackle uncertainty. Game Theory models enable fair allocation in a distributed fashion. Supported and Supported Learning tools, as well as meta-heuristics, allow classification and characterization of traffic in ITS, IoT, and urban computing. My research experience and interests are ample and substantially revolves around distributed systems and wireless networks. Due to their large-scale nature, my project makes used of simulators to validate and evaluate new designs. Vehicular network simulators support my current works on Intelligent Transportation and Vehicular Systems, particularly Veins framework, which runs OMNet++ and SUMO. Please refer to my Publications and list of Projects for my past scientific works. Prospective Students Please contact me if you are a student interested in pursuing an MSc. degree or conducting an undergraduate research project, mainly if you share some of my above-listed, research interests. I am happy to discuss and encourage any potential interest or application. Before you suggest any potential project, I strongly recommend you to take a close look at my past works and publications to identify relevant topics that fall in my field of expertise. If you have any inquiries or concerns, contact me. Advice to students seeking graduate supervision: There is no need to know exactly what project you want to do. Students are expected to be motivated and independent, to evaluate problems critically, and to learn new things. I am continually looking for motivated students. However, please refer to the deadlines and academic rules of Brock University. There might be funding available: Graduate students receive funding from a combination of sources: research funding, fellowships, and teaching assistantships. Undergraduate students may receive funding from awards or research assistantships. Advice and rules to applicants to the graduate program here. Research Seminars Tutorial on Simulation-based Design and Evaluation of Multi-Radio Access Technologies for Highly Mobile Vehicular Networks. Robson E. De Grande and Mubashir Murshed. International Conference on Wireless Intelligent, and Distributed Environment for Communication - October, 2024 Vehicular Edge Computing: Leveraging ITS and Urban Computing. Fall, 2020 (Lakehead University, Canada) Projects Handover Management in Vehicular Networks Handover Management in Highly Dynamic Ultra Dense 5G Vehicular Networks. GNN-based Dynamic Network Edge Analysis Dynamic Network Edge Analysis for Internet of Vehicles with Graph Neural Networks. Resource Estimation in Vehicular Fogs Cloudlet Dwell Time Model and Resource Availability for Vehicular Fog Computing. Resource Allocation in Vehicular Clouds Composition of vehicular resource units as a relaxed, dynamic method for assigning VCC services. Vehicular Network Connectivity Modelling for VCC Management Modelling intermittent connectivity in vehicular networks for more precisely supporting VCC services. More Projects Teaching Teaching Topics Principles of Mobile Cloud Computing (Graduate) Advanced Computer Networks (4th Year Undegraduate) Advanced Object Oriented Programming (3rd/4th Year Undegraduate) Parallel Computing (3rd/4th Year Undegraduate) Computer Systems (2nd Year Undegraduate) Current Offerings Fall 2024 COSC 4P14 Advanced Computer Networks COSC 3P93 Parallel Computing Recent Invited Lectures Vehicular Edge Computing: Leveraging ITS and Urban Computing. Fall, 2020 (Lakehead University, Canada) More on Teaching Publications",
  "content_length": 6116,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:39"
}