{
  "name": "Roderick Murray-Smith",
  "homepage": "http://www.dcs.gla.ac.uk/~rod",
  "status": "success",
  "content": "Roderick Murray-Smith Roderick Murray-Smith I am a Professor in the School of Computing Science, where I am a member of the Inference, Dynamics and Interaction (IDI) group and the Information, Data and Analysis Section. I was Director of SICSA, the Scottish Informatics and Computer Science Alliance from 2012-14. My publications Videos Phone +44 141 330 4984 FAX: +44 141 330 4913 e-mail:Roderick.Murray-Smith@glasgow.ac.uk Postal address: School of Computing Science, Glasgow University Glasgow G12 8QQ Scotland. Google maps link Inference, Dynamics and Interaction group. Researchers: Dr. John Williamson (his Ph.D. thesis) Dr. Catherine Higham Dr. Sebastian Stein Dr. Chaitanya Kaul Andrew Ramsay Dr. Markus Klar Jonathan Sweetland Fraser Carlyle Paterson Current Funded Research Projects DIFAI: Designing Interaction Freedom via Active Inference, ERC Advanced Grant awarded (proposal 101097708), 2023-2028, €2.5M, funded via UK guarantee scheme as EPSRC grant EP/Y029178/1. Quantum Imaging for Monitoring of Wellbeing and Disease in Communities, EPSRC EP/T021020/1, 2020-2025, £5.65M QuantIC - Quantum Technology Hub in Quantum imaging EPSRC 2016-2024. Industrial projects: Aegean Airlines collaboration, Amazon/Quantic Ph.D. studentship, Moodagent Ph.D. studentship, dotPhoton Ph.D. studentship, Thales/Quantic Ph.D. studentship. Completed funded projects Closed-loop Data Science EPSRC 2018-2023, £3M. iCaird - the Industrial Centre for Artificial Intelligence Research in Digital Diagnostics, InnovateUK 2018-2021, £10M, Fast multi-shot epidemic interventions for post lockdown Covid-19 mitigation: Open-loop mitigation strategies, EPSRC funded project, EP/V018450/1. July-November 2020 MoreGrasp - EC Horizon2020 project 2015-2018. Final Demo video CoSound A Cognitive Systems Approach to Enriched and Actionable Information from Audio Streams, Supported by the Danish Strategic Research Council, Jan. 2012 – Dec. 2015 Bang & Olufsen Ph.D. studentship. This led to the BeoSound Moment system. TOBI: Tools for Brain-Computer Interaction, EC-funded project. Roderick Murray-Smith (Glasgow PI), John Williamson, project coordinator:Prof. José del R. Millán, 2008-2012. Multimodal, Negotiated Interaction in Mobile Scenarios, EPSRC funded project (£638k), Roderick Murray-Smith (PI), with Matt Jones (Swansea), Stephen Brewster, 2007-2010. EC-COST action IC0601 on Sonic Interaction Design. Social Interaction: A Cognitive-Neurosciences Approach, ESRC funded project (£3.7 million) , Simon Garrod (PI), 2008-2012. PASCAL network member, EC-funded network in Pattern Analysis, Statistical Modelling and Computational Learning. GAIME: Gestural and Auditory Interactions for Mobile Environments, Stephen Brewster(PI), Roderick Murray-Smith and Andrew Crossan, EPSRC funded project. 2007-2010. OpenInterface. EC funded Research network. 2006-2009. A dynamic systems approach to Negotiated Interaction on mobile devices, (€164k), Science Foundation Ireland Research Frontier grant, Sept. 2006-08. Dynamics, Uncertainty and Interaction, (€66K) PASCAL Pump-priming project (EC-funded), 2005-2006, Roderick Murray-Smith & John Williamson, based in Glasgow, in collaboration with Fraunhofer FIRST, Berlin, and DTU, Denmark. Dynamics and Interaction in BCI and Music Spaces, (€68k), J. Williamson, R. Murray-Smith, funded within the PASCAL network 2005-2007. Intelligent Sound Project - supported by the Danish Technical Research Council, and led by Lars Kai Hansen. Nonparametric Methods for Curve Fitting and Prediction with Large Data-sets, EPSRC GR/T29253/01 (Jan. 2005—June 2007), Jian Qing Shi (PI), Mike Titterington & Roderick Murray-Smith as Collaborators. Body space: Feedback for Closed-loop control of Gesture input, €136K, based at the Hamilton Institute, collaborating with the Palpable Machines group at Media Lab Europe, started November 2003 Continuous Gestural Interaction with Mobile devices (€77K), with Stephen Brewster and Doug Leith, based at the Hamilton Institute. Sept. 2003-Sept 2006. Audioclouds: Three-Dimensional Audio and Gestural Interfaces for Mobile and wearable Computers, Three year EPSRC funded research project (Principal Investigator Stephen Brewster), October 2002-2005. £237K, graded \"Outstanding\" by EPSRC. The Glasgow Computing Science Research Festival 2005-06, Muffy Calder and Simon Gay and Roderick Murray-Smith (£19K), EPSRC. MAC - Multi-Agent Control: Probabilistic reasoning, optimal co-ordination, stability analysis and controller design for intelligent hybrid systems. (€1.2M) A four year Research Training Network within the European Commission's 5th Framework, April 2000-2004. Modern Statistical Approaches to off-equilibrium modelling for nonlinear system control. A three year EPSRC funded research project 2000-03, graded \"tending to outstanding\" by EPSRC reviewers. Early recognition of rollover in large lorries, Industrially funded project (joint work with K. Hunt in Mechanical Engineering as Principal Investigator) Portable Robotic Laboratories, EPSRC funded Public Understanding Award (Prof. Muffy Calder as Principal Investigator). See the legolab page for related information. Design of controllers based on pattern recognition (Fondecyt Project 700397), (Principal Investigator Daniel Sbarbaro-Hofer, Universidad de Concepcion, Chile) Gesture-Based Interaction with Mobile Devices, (together with coinvestigator Stephen Brewster). Funded by SHEFC RDG85. Selected recent Publications: (full list of publications available here) R Murray-Smith, J.H. Williamson, S. Stein, Active Inference and Human-Computer Interaction, ACM Transactions on Computer-Human Interaction (ToCHI), August, 2025. pdf S.A. Puthiya Parambath, C. Anagnostopoulos, R. Murray-Smith, Sequential query prediction based on multi-armed bandits with ensemble of transformer experts and immediate feedback, Data Mining and Knowledge Discovery 38 (6), 3758-3782 A. Tragakis, C. Kaul, K.J. Mitchell, H. Dai, R. Murray-Smith, D. Faccio, IGAF: Incremental Guided Attention Fusion for Depth Super-Resolution, Sensors 25 (1), 24, 2025. pdf C. Kaul, K. J. Mitchell, K. Kassem, A. Tragakis, V. Kapitany, I. Starshynov, F. Villa, R. Murray-Smith, D. Faccio, AI-Enabled Sensor Fusion of Time of Flight Imaging and mmWave for Concealed Metal Detection, Sensors, 24 (18), 5865, 2024. pdf G.E. Johnstone, J. Gray, S. Bennett, S.D. Johnson, C.F. Higham, F Dehkhoda, E. Xie, J. Herrnsdorf, P. Murray, M.J. Padgett, R. Murray-Smith, R.K. Henderson, M.D. Dawson, M.J. Strain, High speed single pixel imaging using a microLED-on-CMOS light projector, Optics Express, Vol. 32, no. 14, p24615-24628, 2024. pdf A. Tragakis, M. Aversa, C. Kaul, R. Murray-Smith, Is One GPU Enough? Pushing Image Generation at Higher-Resolutions with Foundation Models, NeurIPS, 2024. pdf G. Nobis, M. Springenberg, M. Aversa, M. Detzel, R. Daems, R. Murray-Smith, S. Nakajima, S. Lapuschkin, S. Ermon, T. Birdal, M. Opper, Ch. Knochenhauer, L. Oala, W. Samek, Generative Fractional Diffusion Models, NeurIPS 2024. pdf S. Stein, J. H. Williamson, R. Murray-Smith, Towards Interaction Design with Active Inference: A Case Study on Noisy Ordinal Selection, International Workshop on Active Inference (IWAI), Oxford, 2024. pdf F. Fischer, A. Ikkala, M. Klar, A. Fleig, M.Bachinski, R. Murray-Smith, P. Hämäläinen, A. Oulasvirta, J. Müller, SIM2VR: Towards Automated Biomechanical Testing in VR, UIST 2024. M. Aversa, G. Nobis, M. Hägele, K. Standvoss, M. Chirica, R. Murray-Smith, A. M. Alaa, L. Ruff, D. Ivanova, W. Samek, F. Klauschen, B. Sanguinetti, L. Oala, Diffinfinite: Large mask-image synthesis via parallel random patch diffusion in histopathology, NeurIPS 36, 2023. pdf J. Mitton, R. Murray-Smith, Subgraph Permutation Equivariant Networks, Transactions on Machine Learning Research, August 2023. pdf R. Murray-Smith, A. Oulasvirta, A. Howes, J. Müller, A. Ikkala, M. Bachinski, A. Fleig, F. Fischer, M. Klar, What Simulation Can Do for HCI Research, ACM Interactions Magazine, Nov/Dec. 2022. pdf A. Tragakis, C. Kaul, R. Murray-Smith, D. Husmeier, The Fully Convolutional Transformer for Medical Image Segmentation, IEEE/CVF Winter Conference on Applications of Computer Vision (WACV 23), 2023. pdf J. Mitton, S.P. Mekhail, M. Padgett, D. Faccio, M. Aversa, and R. Murray-Smith, Bessel Equivariant Networks for Inversion of Transmission Effects in Multi-Mode Optical Fibres, NeurIPS 2022. pdf A. Ikkala, Fischer, F., Klar, M., Bachinski, M., Fleig, A., Howes, A., Hämäläinen, P., Müller, J., Murray-Smith, R. and Oulasvirta, A., Breathing Life Into Biomechanical User Models, UIST'22: The 35th Annual ACM Symposium on User Interface Software and Technology, Bend, OR, USA, Nov 2022. pdf C. Kaul, J. Mitton, H. Dai, and R. Murray-Smith, Convolutional Point Transformer, 16th Asian Conference on Computer Vision (ACCV2022), 2022. pdf R. Murray-Smith, J.H. Williamson, F. Tonolini, Human–Computer Interaction Design and Inverse Problems, Ch 7 of Bayesian Methods for Interaction and Design, Ed. J.H. Williamson, A. Oulasvirta, P.O. Kristensson, N. Banovic, Cambridge University Press, 2022. D.J. Siria, R. Sanou, J. Mitton, E. P. Mwanga, A. Niang, I. Sare, P. C. D. Johnson, G. M. Foster, A. M. G. Belem, K. Wynne, R. Murray-Smith, H. M. Ferguson, M. González-Jiménez, S. A. Babayan, A. Diabaté, F. O. Okumu, F. Baldini, Rapid age-grading and species identification of natural mosquitoes for malaria surveillance. Nature Communications 13, 1501 (2022). pdf H. Gabbard, C. Messenger, I. S. Heng, F. Tonolini, R. Murray-Smith, Bayesian parameter estimation using conditional variational autoencoders for gravitational-wave astronomy, Nature Physics, 18, 112–117, 2022.nature article open article J. Mitton, R. Murray-Smith, Rotation Equivariant Deforestation Segmentation and Driver Classification, Tackling Climate Change with Machine Learning workshop at NeurIPS 2021. arXiv preprint arXiv:2110.13097 J. A. Á. Martín, H. Gollee, J. Müller, R. Murray-Smith, Intermittent control as a model of mouse movemen",
  "content_length": 15118,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:43"
}