{
  "name": "Rodrigo D. Castro",
  "homepage": "http://www.dc.uba.ar/People/rcastro",
  "status": "success",
  "content": "HOME - SEDLab Skip to content SEDLab Laboratorio de Simulación de Eventos Discretos Investigación Nuestro laboratorio desarrolla nuevos fundamentos teóricos, metodologías y herramientas de software para el modelado, simulación y análisis de sistemas complejos. Nuestro objetivo es hacer avanzar el estado del arte en la construcción asistida y sistematizada de modelos de simulación por medio de la composición incremental de subcomponentes heterogéneos (multi-dominio, multi-escala, multi-paradigma) de un sistema.Para estas tareas nos basamos en formalismos derivados de la teoría general de sistemas, con el fin de poder integrar sistemas dinámicos continuos, de tiempo discreto y de eventos discretos bajo descripciones unificadoras.Nuestro enfoque facilita y promueve el estudio interdisciplinario de sistemas complejos, por ejemplo aquellos que integran fenómenos naturales, sociales y cibernéticos. Nuestras publicaciones pueden accederse aquí. ModeladoUtilizamos diversas técnicas para modelar sistemas en áreas diversas como  física de altas energías, redes de comunicaciones, vehículos no tripulados, sistemas socioeconómicos y socioambientales, entre otras.Desarrollamos nuevos sustentos teóricos como por ejemplo teoría de la representación de fenómenos emergentes, representación de ecuaciones diferenciales en entornos 3D reticulados y representación de sistemas de gran escala mediante flujos de energía, entre otros.Las principales técnicas son máquinas de estados finitos, modelado basado en agentes, ecuaciones diferenciales, ecuaciones en diferencia, autómatas celulares (entre otras) todas ellas representadas dentro del marco del formalismo DEVS (Discrete EVent Systems specification).SimulaciónDesarrollamos nuevos algoritmos para darle comportamiento a los modelos mejorando las características de las simulaciones como ser su eficiencia, paralelismo, ejecución distribuída,  análisis de sensibilidad ante dispersión de parámetros y co-simulación entre diferentes sistemas, entre otras.ControlUn aspecto presente en todos los sistemas que estudiamos es el diseño de estrategias de control, para hacer converger el comportamiento de los sistemas bajo estudio a objetivos de comportamiento deseables al menor costo posible. Novedades Charla del Dr. Gabriel Wainer como Orador Distinguido ACM El Dr. Gabriel Wainer brindó la charla titulada “Cellular Modeling with Cell-DEVS: a Discrete-Event Cellular Automata formalism” VER MÁS → Tobías Carreira Munich en el 7mo. día del ICC Tobías Carreira Munich presentó su trabajo “Hacia un Simulador de la Transformación Digital Productiva” en el 7mo. día del ICC. VER MÁS → Agustín Caputo Bugallo en el 7mo. día del ICC Agustín Caputo Bugallo presentó su trabajo “Clasificación no supervisada y explicabilidad de propiedades emergentes en modelos de simulación basados en agentes” VER MÁS → Defensa de Tesis de Lic. Cs. de la Computación Gerónimo Romczyk “Optimización Sistemática de Simulaciones a Eventos Discretos para Sistemas Complejos de Gran Escala: Contribuciones al Simulador PowerDEVS” VER MÁS → PowerDEVS-Palooza PDP2025 Primera edición del PowerDEVS-Palooza PDP2025 en el SEDlab. VER MÁS → Esteban Lanzarotti en la SDCD2025 “Explorando el mundo a través de los datos: Visualización científica para descubrir y entender” VER MÁS → Departamento de Computación, Facultad de Ciencias Exactas y Naturales,Universidad de Buenos Aires (DC-FCEyN-UBA)Instituto de Ciencias de la Computación (ICC-CONICET/UBA) X-twitter Youtube Github Envelope Scroll to top",
  "content_length": 3521,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:06"
}