{
  "name": "Rodrigo Toro Icarte",
  "homepage": "https://www.ing.uc.cl/academicos-e-investigadores/rodrigo-andres-toro-icarte",
  "status": "success",
  "content": "RODRIGO ANDRES TORO ICARTE | Ingeniería UC Inicio Nuestra Escuela Sobre Ingeniería UC Internacionalización Retribuye Proyecto Ingeniería 2030 Código de Honor Consejo Asesor Autoridades y equipos Programas de Estudio Admisión Pregrado Postgrado Educación Profesional Acreditaciones Académicos e Investigación Académicos Ingeniería UC Publicaciones Investigación en pregrado Proyectos de investigación Concursos postdoctorales Libro de Investigación Divulgación Científica y Tecnológica Innovación y Emprendimiento Ecosistema de emprendimiento Formación académica Programas extracurriculares Emprendimiento Social Apoyo al emprendimiento Alumnos emprendedores Vida Universitaria Deporte Cultura Centro de Alumnos de Ingeniería Proyectos de Alumnos Mujeres Ingeniería UC Cuerpo de Tutores Pastoral Vinculación con el Medio Transferencia Alumni Ingeniería UC Preingeniería Atracción y desarrollo de talento Plataforma de Colocaciones Responsabilidad Social Oficina de Vinculación con la Industria Contacto Departamentos y áreas académicas SIDING English Home » Académicos e Investigadores » RODRIGO ANDRES TORO ICARTE Académicos Ingeniería UC RODRIGO TORO Profesor Asistente Departamento de Ciencia de la Computación rntoro@uc.cl Publicaciones Publicaciones Sanabria P., Montoya S., Neyem A., Toro R., Hirsch M., Mateos C. (2024) Connection-Aware Heuristics for Scheduling and Distributing Jobs under Dynamic Dew Computing Environments Applied Sciences-Basel 14 8 Álvaro Labarca Silva, Denis Parra, Rodrigo Toro Icarte Proceedings of the 41st International Conference on Machine Learning, PMLR 235:45432-45450, 2024. (2024) On the Unexpected Effectiveness of Reinforcement Learning for Sequential Recommendation Proceedings of the 41st International Conference on Machine Learning, PMLR 235:45432-45450 Labarca A., Parra D., Toro R. (2024) On the Unexpected Effectiveness of Reinforcement Learning for Sequential Recommendation Proceedings of the 41st International Conference on Machine Learning Li, A. C., Chen, Z., Klassen, T. Q., Vaezipoor, P., Toro Icarte, R., & McIlraith, S. A. (2024) Reward Machines for Deep RL in Noisy and Uncertain Environments 38th Conference on Neural Information Processing Systems (NeurIPS 2024) Li, A. C., Chen, Z., Klassen, T. Q., Vaezipoor, P., Toro Icarte, R., & McIlraith, S. A. (2024). Reward Machines for Deep RL in Noisy and Uncertain Environments. In Proceedings of the 37th Conference on Advances in Neural Information Processing Systems, 2024. (2024) Reward Machines for Deep RL in Noisy and Uncertain Environments Advances in Neural Information Processing Systems 37 (NeurIPS 2024) Wang A., Li A.C., Klassen T.Q., Toro Icarte R. Mcilraith S.A. (2023) Learning Belief Representations for Partially Observable Deep RL Proceedings of the 40th International Conference on Machine Learning 202 35970-35988 Klassen T., Valenzano R., Castro M., Waldie E., Mcilraith S., Toro R. (2023) Learning reward machines: A study in partially observable reinforcement learning ARTIFICIAL INTELLIGENCE 323 Alizadeh-Alamdari P., Klassen T. Q., Toro-Icarte R., McIlraith S. A. (2022) Be Considerate: Avoiding Negative Side Effects in Reinforcement Learning Proceedings of the 21st International Conference on Autonomous Agents and Multiagent Systems 18-26 Middleton, J., Toro Icarte, R., & Baier, J. (2022). Real-Time Heuristic Search with LTLf Goals. In Proceedings of the Thirty-First International Joint Conference on Artificial Intelligence (pp. 4785-4792). (2022) Real-Time Heuristic Search with LTLf Goals Proceedings of the Thirty-First International Joint Conference on Artificial Intelligence 4785-4792 Toro R., Klassen T. Q., Valenzano R., McIlraith S.A. (2022) Reward Machines: Exploiting Reward Function Structure in Reinforcement Learning Journal of Artificial Intelligence Research 73 73-208 Sanabria P., Tapia T.F., Toro Icarte R., Neyem A. (2022) Solving Task Scheduling Problems in Dew Computing via Deep Reinforcement Learning Applied Sciences 12 14 7137 CONÉCTATE CON INGENIERÍA UC Contáctate con nosotros Información sobre las distintas áreas de Ingeniería UC. Contáctanos Postula a Ingeniería UC Conoce la información relevante para postular a la carrera. Postula Concursos de Postdoctorado Descubre las ofertas de postdoctorado Postula Mapa Campus San Joaquín Retribuye a Ingeniería UC Trabaja con nosotros Error: Formulario de contacto no encontrado. Email Todo Noticias Contenido Institucional",
  "content_length": 4436,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:55"
}