{
  "name": "Roger F. Woods",
  "homepage": "https://www.qub.ac.uk/schools/eeecs/Connect/Staff/BusinessCard/?name=r.woods",
  "status": "success",
  "content": "Business Card | School of Electronics, Electrical Engineering and Computer Science | Queen's University Belfast Top Business Card Professor Roger Woods E-mail: Phone: +44 (0)28 9097 4081 Fax: +44 (0)28 9097 5449 Research Profile: pure.qub.ac.uk/en/persons/roger-woods Room: 07.021Ashby Building,Stranmillis Road AlternateRoom: R/106Institute of Electronics, Communications and Information Technology,Titanic Quarter PostalAddress: School of Electronics, Electrical Engineering and Computer Science, The Queen's University Belfast, Ashby Building, Stranmillis Road Belfast, BT9 5AH Research Interests:   Implementation of complex programmable systems e.g. FPGA-based systems for signal processing and telecommunications including design flows, methodologies and applications. Research Clusters:   Electronics and Computer Engineering Centre for Intelligent Sustainable Computing (CISC) School & University Responsibilities: Chair of the Examination Board for EEE and SESE subjects External Activities: Member of IEEE Signal Processing Society Advisory Board on the Design/Implementation Signal Processing Systems. Member of the Engineering Policy Group for Northern Ireland. Member of the Engineering and Technology Board Steering Group for Northern Ireland. Undergraduate and MSc external examiner for: University of Newcastle (2006-2009). Editorial board member of: ACM Transactions on Reconfigurable Technology and Systems IET Proceedings on Computers and Digital Techniques Journal of VLSI Signal Processing Systems General Chair for the 5th International Workshop on Applied Reconfigurable Computing in 2009. Program Chair for the 4th International Workshop on Applied Reconfigurable Computing in 2008. Session Chair organiser for the Asilomar Conference on Signals, Systems, and Computers. Member of program technical committee of the following conferences: International conference on Field Programmable Logic (FPL). International conference on Field Programmable Technology (FPT). International Workshop on Applied Reconfigurable Computing (ARC). IEEE conference on Application Specific Array Processors (ASAP). IEEE International workshop on Signal Processing Systems (SiPS). International symposium on VLSI Design, Automation and Test (VLSIDAT). Design, Automation and Test in Europe (DATE2009) - subtopic D3. Reconfigurable Architectures Workshop (RAW2009). Meet Our People © Queen's University Belfast 2024 Privacy and cookies Website accessibility Freedom of information Modern slavery statement Equality, Diversity and Inclusion University Policies and Procedures Information Privacy and cookies Website accessibility Freedom of information Modern slavery statement Equality, Diversity and Inclusion University Policies and Procedures © Queen's University Belfast 2024 Manage cookies",
  "content_length": 2796,
  "method": "requests",
  "crawl_time": "2025-12-01 14:19:59"
}