{
  "name": "Roger K. Moore",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/roger-moore",
  "status": "success",
  "content": "Professor Roger K. Moore | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Roger K. Moore BA (Hons), MSc, PhD School of Computer Science Professor of Spoken Language Processing Deputy Head of School Head of the Speech and Hearing (SpandH) research group Open staff member portrait in a modal window r.k.moore@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Roger K. Moore School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-0065-3311 Google Scholar Personal website Profile Prof. Roger K. Moore has over 40 years’ experience in Speech Technology R&D and, although an engineer by training, much of his research has been based on insights from human speech perception and production.  As Head of the UK Government's Speech Research Unit from 1985 to 1999, he was responsible for the development of the Aurix range of speech technology products and the subsequent formation of 20/20 Speech Ltd.  Since 2004 he has been Professor of Spoken Language Processing at the University of Sheffield, and also holds Visiting Chairs at Bristol Robotics Laboratory and University College London Psychology & Language Sciences.  He was President of the European/International Speech Communication Association from 1997 to 2001, General Chair for INTERSPEECH-2009 and ISCA Distinguished Lecturer during 2014-15.  In 2017 he organised the first international workshop on ‘Vocal Interactivity in-and-between Humans, Animals and Robots (VIHAR)’.  Prof. Moore is the current Editor-in-Chief of Computer Speech & Language and in 2016 he was awarded the LREC Antonio Zampoli Prize for \"Outstanding Contributions to the Advancement of Language Resources & Language Technology Evaluation within Human Language Technologies\". Research interests Prof. Moore is currently working on a unified theory of spoken language processing in the general area of `Cognitive Informatics` called `PRESENCE` (PREdictive SENsorimotor Control and Emulation). PRESENCE weaves together accounts from a wide variety of different disciplines concerned with the behaviour of living systems - many of them outside the normal realms of spoken language - and compiles them into a new framework that is intended to breathe life into a new generation of research into spoken language processing.Prof. Moore is involved in collaborations aimed at Clinical Applications of Speech Technology (particularly for  individuals with speaking difficulties) and he is becoming increasingly involved in Creative Applications of Speech Technology through interactions with colleagues from the performing arts. Publications Books (2017) Biomedical Engineering Systems and Technologies. Springer International Publishing. Gibbon D, Moore R & Winski R (2013) Spoken language system and corpus design. (1997) Spoken Language Reference Materials. De Gruyter. (1997) Spoken Language Characterization. De Gruyter. Journal articles Bennion MR, Spencer R, Moore RK & Kenyon R (2025) Digital capability, open-source use, and interoperability standards within the NHS in England: a survey of healthcare trusts. JMIR Human Factors, 12. View this article in WRRO Huang G & Moore RK (2024) Freedom comes at a cost?: An exploratory study on affordances’ impact on users’ perception of a social robot. Frontiers in Robotics and AI, 11. View this article in WRRO Chetouani M, Briefer EF, Dassow A, Marxer R, Moore RK, Obin N & Stowell D (2023) Vocal interactivity in-and-between humans, animals and robots. Interaction Studies. Social Behaviour and Communication in Biological and Artificial Systems, 24(1), 1-4. View this article in WRRO Huang G & Moore RK (2023) Using social robots for language learning: are we there yet?. Journal of China Computer-Assisted Language Learning, 3(1), 208-230. View this article in WRRO Huang G & Moore RK (2022) Is honesty the best policy for mismatched partners? Aligning multi-modal affordances of a social robot: an opinion paper. Frontiers in Virtual Reality. Marge M, Espy-Wilson C, Ward NG, Alwan A, Artzi Y, Bansal M, Blankenship G, Chai J, Daumé H, Dey D , Harper M et al (2022) Spoken language interaction with robots: Recommendations for future research. Computer Speech & Language, 71. ter Haar SM, Fernandez AA, Gratier M, Knörnschild M, Levelt C, Moore RK, Vellema M, Wang X & Oller DK (2021) Cross-species parallels in babbling : animals and algorithms. Philosophical Transactions of the Royal Society B: Biological Sciences, 376(1836). Simmonds-Buckley M, Bennion MR, Kellett S, Millings A, Hardy GE & Moore RK (2020) Acceptability and effectiveness of NHS recommended e-therapies for depression, anxiety and stress: A meta-analysis. Journal of Medical Internet Research, 22(10). View this article in WRRO Bennion MR, Hardy GE, Moore RK, Kellett S & Millings A (2020) Usability, acceptability and effectiveness of web-based conversational agents to facilitate problem solving in older adults : controlled study. Journal of Medical Internet Research, 22(5). View this article in WRRO Bennion M, Hardy G, Moore R, Kellett S & Millings A (2019) E-therapies in England for stress, anxiety or depression: how are apps developed? A survey of NHS e-therapy developers. BMJ Health & Care Informatics, 26(1). View this article in WRRO Cameron D, Millings A, Fernando S, Collins EC, Moore RK, Sharkey A, Evers V & Prescott A (2018) The effects of robot facial emotional expressions and gender on child-robot interaction in a field study. Connection Science, 30(4), 343-361. View this article in WRRO Moore RK & Nicolao M (2017) Toward a needs-based architecture for 'intelligent' communicative agents: speaking with intention. Frontiers in Robotics and AI, 4. View this article in WRRO Gonzalez JA, Cheah LA, Gomez AM, Green PD, Gilbert JM, Ell SR, Moore RK & Holdsworth E (2017) Direct Speech Reconstruction From Articulatory Sensor Data by Machine Learning. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 25(12), 2362-2374. View this article in WRRO Gilbert JM, Gonzalez Lopez JA, Cheah LA, Ell SR, Green P, Moore RK & Holdsworth E (2017) Restoring speech following total removal of the larynx by a learned transformation from sensor data to acoustics. Journal of the Acoustical Society of America, 141(3), EL307-EL307. View this article in WRRO Bennion MR, Hardy G, Moore RK & Millings A (2017) E-therapies in England for stress, anxiety or depression: what is being used in the NHS? A survey of mental health services.. BMJ Open, 7(1). View this article in WRRO Gonzalez JA, Cheah LA, Green PD, Gilbert JM, Ell SR, Moore RK & Holdsworth E (2017) Restoring Speech Following Total Removal of the Larynx. Studies in Health Technology and Informatics, 242, 314-321. View this article in WRRO Moore RK, Marxer R & Thill S (2016) Vocal Interactivity in-and-between Humans, Animals, and Robots. Frontiers in Robotics and AI, 3. View this article in WRRO Gonzalez JA, Cheah LA, Gilbert JM, Bai J, Ell SR, Green PD & Moore RK (2016) A silent speech system based on permanent magnet articulography and direct synthesis. Computer Speech & Language, 39, 67-87. View this article in WRRO Moore RK (2016) Introducing a Pictographic Language for Envisioning a Rich Variety of Enactive Systems with Different Degrees of Complexity. International Journal of Advanced Robotic Systems, 13. View this article in WRRO Moore RK, Thill S & Marxer R (2016) Vocal Interactivity in-and-between Humans, Animals and Robots (VIHAR) (Dagstuhl Seminar 16442).. Dagstuhl Reports, 6, 154-194. Moore RK (2014) Spoken language processing: Time to look outside?. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 8791, 21-36. Kempton T & Moore RK (2014) Discovering the phoneme inventory of an unwritten language: A machine-assisted approach. SPEECH COMMUNICATION, 56, 152-166. Moore RK (2013) Spoken Language Processing: Where Do We Go from Here?, 119-133. Moore RK (2012) A Bayesian explanation of the 'Uncanny Valley' effect and related psychological phenomena.. Sci Rep, 2, 864. Crook N, Field D, Smith C, Harding S, Pulman S, Cavazza M, Charlton D, Moore R & Boye J (2012) Generating context-sensitive ECA responses to user barge-in interruptions. Journal on Multimodal User Interfaces, 6(1-2), 13-25. Green PD (2012) Small-Vocabulary Speech Recognition Using a Silent Speech Interface Based on Magnetic Sensing. Speech Communication. Crook N, Field D, Smith C, Harding S, Pulman S, Cavazza M, Charlton D, Moore R & Boye J (2012) Generating context-sensitive ECA responses to user barge-in interruptions. Journal on Multimodal User Interfaces, 1-13. Attar MN, Ahmed FZ & Moore RK (2012) Recurrent collapses following permanent pacemaker implantation. Netherlands Heart Journal, 20(2), 86-87. Worgan SF & Moore RK (2011) Towards the detection of social dominance in dialogue. Speech Communication, 53(9-10), 1104-1114. Wilks Y, Catizone R, Worgan S, Dingli A, Moore R, Field D & Cheng WW (2011) A prototype for a conversational companion for reminiscing about images. COMPUT SPEECH LANG, 25(2), 140-157. Worgan SF & Moore RK (2010) Speech as the Perception of Affordances. ECOL PSYCHOL, 22(4), 327-343. Kirchner R, Moore RK & Chen TY (2010) Computing phonological generalization over real speech exemplars. J PHONETICS, 38(4), 540-547. Aimetti G, Moore RK & Ten Bosch L (2010) Discovering an optimal set of minimally contrasting acoustic speech units: A point of focus for whole-word pattern matchinga1. Proceedings of the 11th Annual Conference of the International Speech Communication Association Interspeech 2010, 310-313. Gilbert JM, Rybchenko SI, Hofe R, Ell SR, Fagan MJ, Moore RK & Green P (2010) Isolated word recognition of silent speech using magnetic implants and sensors.. Med Eng Phys, 32(10), 1189-1197. Elshaw M, Moore RK & Klein M (2010) An attention-gating recurr",
  "content_length": 61510,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:02"
}