{
  "name": "Roger Zimmermann",
  "homepage": "https://www.comp.nus.edu.sg/~rogerz/roger.html",
  "status": "success",
  "content": "Roger Zimmermann (MMRL) Skip to content Skip to main navigation Skip to first column Skip to second column Media Management Research Lab National University of Singapore Roger Zimmermann Thursday, 8 August 2019 08:00 administrator Director of the Media Management Research Lab (MMRL) Associate Professor of Computer Science at NUS Deputy Director of the Smart Systems Institute (SSI) Location AI project lead in the Grab-NUS AI Lab Co-Director of the Centre of Social Media Innovations for Communities (COSMIC) Secretary of ACM SIGSPATIAL (2014-2017) Biography Roger Zimmermann is a professor of Computer Science in the School of Computing at the National University of Singapore (NUS). He is also deputy director with the Smart Systems Institute (SSI) at NUS and leads the Location AI project in the Grab-NUS AI Lab, a joint research lab between the NUS Institute of Data Science and Grab. Earlier He was a co-director of the Centre of Social Media Innovations for Communities (COSMIC), a research institute funded by the National Research Foundation (NRF) of Singapore. Prior to joining NUS he held the position of Research Area Director with the Integrated Media Systems Center (IMSC) at the University of Southern California (USC). He received his M.S. and Ph.D. degrees from the University of Southern California in 1994 and 1998, respectively. Among his research interests are streaming media architectures, multimedia networking, distributed systems, applications of machine/deep learning, mobile and spatial data management. Dr. Zimmermann is a Senior Member of the IEEE and a Distinguished Member of the ACM. He has co-authored a book, seven patents and more than three hundred conference publications, journal articles and book chapters in the areas of multimedia, GIS and information management. He has received funding from NSF (US), A*STAR (Singapore), MOE (Singapore), NUS Research Institute (NUSRI), NRF (Singapore), and NSFC (China) as well as several industries such as Seagate, Fuji Xerox, HP, Intel, and Pratt & Whitney. Dr. Zimmermann has been a director of the IEEE Multimedia Communications Technical Committee (MMTC) Review Board and on the editorial board of the Springer International Journal of Multimedia Tools and Applications (MTAP). He is also an associate editor with IEEE MultiMedia, the ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), and the IEEE Open Journal of the Communications Society (OJ-COMS). He has been elected to serve as Secretary of ACM SIGSPATIAL for the term 1 July 2014 to 30 June 2017. He has served on the conference program committees of many leading conferences and as reviewer of many journals. Recently he was the general chair of the ACM Multimedia Systems 2014, the IEEE ISM 2015 and the IEEE BigMM 2019 conferences, and TPC co-chair of the ACM TVX 2017, the IEEE ICME 2019, and the ACM Multimedia 2020 conferences. Research More information on multimedia, GIS and information management research can be found on the MMRL lab website at http://eiger.ddns.comp.nus.edu.sg. The list of publications is available here. Note that many of the ACM publications are enabled with the ACM Author-Izer service such that they can be downloaded directly and for free from the ACM Digital Library. The enabled publications are marked with a small ACM logo. The title links of these papers will re-direct a visitor to an ACM Author-Izer download page.Note: You must click through from the bibliography page (here). Additional Resources Roger Zimmermann's sites are: Google Scholar, DBLP, Academia.edu, Elsevier Mendeley, Publons, Semantic Scholar, ACM Digital Library, and ResearchGate. His ORCID persistent digital identifier is 0000-0002-7410-2590, his Researcher ID is D-7944-2015 and his SCOPUS ID is 55423994500. Follow me on Academia.edu Teaching Teaching information can be found here. Contact Information Campus address: School of Computing Department of Computer Science National University of Singapore Computing 1 13 Computing Drive Singapore 117417 Email: rogerz@comp.nus.edu.sg Phone: (+65) 6516 7949 Fax: (+65) 6779 4580 Office: AS6, #05-05 Recent News Articles... NSFC Proposal Approved Sypher Labs Raises Funding ACM Multimedia 2015 Web Site ACM SIGSPATIAL Secretary Â« Start  Prev  1  2  3  4  5  6  7  8  9  10  Next  End Â» Page 1 of 22 Main Menu HomePeopleResearchPublicationsCoursesPress Coverage Resources Administrator Who's Online We have 2 guests online Latest News IEEE ISM 2014 Panel Keynote at PCM 2014 NEAT IP License with Sypher Labs Singapore Named No 1 by Lonely Planet Popular NUS-CALIT2 Workshop Multimedia Workshop \"on Hot Topics in Multimedia Research\" ACM MM 2009 Papers Accepted SIGIR 2008 Conference ResearchAbout DMRLNewsSponsorsContact Us Copyright Â© 220 Media Management Research Lab. All Rights Reserved. Joomla! is Free Software released under the GNU/GPL License. Feed Entries",
  "content_length": 4901,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:03"
}