{
  "name": "Roger Villemaire",
  "homepage": "https://professeurs.uqam.ca/professeur/villemaire.roger",
  "status": "success",
  "content": "Roger Villemaire | Répertoire des professeures et professeurs - UQAM Roger Villemaire Professeur Roger Villemaire Professeur Unité : Département d'informatique Courriel : villemaire.roger@uqam.ca Téléphone : (514) 987-3000 poste 6744 Domaines d'expertise Informatique Logique informatique Modélisation Liens d'intérêt Page personnelle Enseignement Développement de systèmes informatiques (2026, 2025, 2024, 2022, 2021) Séminaire interdisciplinaire en sciences cognitives (2026, 2025) Concepts fondamentaux de l'informatique cognitive (2025, 2024, 2023, 2022, 2021, 2020) Projet de thèse (2025, 2022) Logique, informatique et sciences cognitives (2024, 2022, 2021) Projet de thèse (2023, 2022, 2021) Initiation à la recherche en informatique (2023, 2022, 2021) Séminaire de maîtrise en informatique I (2021) Directions de thèses et mémoires Thèses de doctorat Drown, Dennis. (2023). Analyzing emotion in the context of online social media and climate change. (Thèse de doctorat). Université du Québec à Montréal. Potvin, Benoit. (2019). Traitement de l'information visuelle pour l'extraction d'information à partir de documents visuellement riches. (Thèse de doctorat). Université du Québec à Montréal. Monnet, Anthony Jean-Luc. (2013). Améliorer l'efficacité de l'algorithme CDCL : décompositions arborescentes de grandes instances, CDCL sans saut arrière et CDCL à ordre partiel. (Thèse de doctorat). Université du Québec à Montréal. Hallé, Sylvain. (2008). Spécification, validation et satisfiabilité [i.e. satisfaisabilité] de contraintes hybrides par réduction à la logique temporelle. (Thèse de doctorat). Université du Québec à Montréal. Mémoires Laberge, Vincent. (2022). Démonstration d'une borne supérieure du nombre d'itérations de l'algorithme de Weisfeiler-Lehman de Dimension 2. (Mémoire de maîtrise). Université du Québec à Montréal. Boucher, Steve. (2019). Diagnostic automatisé de problèmes réseau. (Mémoire de maîtrise). Université du Québec à Montréal. Ben Nasr, Sami. (2011). Model-checking du délai dans les éléments réseaux. (Mémoire de maîtrise). Université du Québec à Montréal. Bourgeois, Mathieu. (2011). Conception et implémentation d'un langage de description de diagrammes de mathématiques discrètes et d'informatique théorique. (Mémoire de maîtrise). Université du Québec à Montréal. Wenaas, Éric. (2006). Implantation d'une logique de configuration pour la vérification automatique de configurations d'équipements de réseaux. (Mémoire de maîtrise). Université du Québec à Montréal. Rahmoune, Nabila. (2006). Méthode SAT et algorithme DPLL appliqués à un problème de recherche opérationnelle. (Mémoire de maîtrise). Université du Québec à Montréal. Micati, Marwan. (2005). Développement d'une heuristique par influences mutuelles pour l'ordonnancement des variables d'un diagramme de décision binaire (BDD). (Mémoire de maîtrise). Université du Québec à Montréal. Hallé, Sylvain. (2005). Formalismes logiques pour la gestion des configurations dans les réseaux informatiques. (Mémoire de maîtrise). Université du Québec à Montréal. Rapports d'activités et projets d'intervention Jaafar, Samir. (2016). Modélisation et vérification de l'utilisation de patrons de conception (GoF). (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Publications Articles scientifiques Hallé, S., Villemaire, R., Cherkaoui, O. et Deca, R. (2012). A logical approach to data-aware automated sequence generation. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 7050 LNCS, 192–216. http://dx.doi.org/10.1007/978-3-642-28525-7_7. Villemaire, R. et Hallé, S. (2012). Reasoning about visibility. Journal of Applied Logic, 10(2), 163–178. http://dx.doi.org/10.1016/j.jal.2012.02.001. Hallé, S. et Villemaire, R. (2012). Runtime enforcement of web service message contracts with data. IEEE Transactions on Services Computing, 5(2), 192–206. http://dx.doi.org/10.1109/TSC.2011.10. Hallé, S. et Villemaire, R. (2010). Runtime verification for the web: A tutorial introduction to interface contracts in web applications. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 6418 LNCS, 106–121. http://dx.doi.org/10.1007/978-3-642-16612-9_10. Hallè, S., Bultan, T., Hughes, G., Alkhalaf, M. et Villemaire, R. (2010). Runtime verification of Web service interface contracts. Computer, 43(3), 59–66. http://dx.doi.org/10.1109/MC.2010.76. Hallé, S. et Villemaire, R. (2009). Browser-based enforcement of interface contracts in web applications with beepbeep. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 5643 LNCS, 648–653. http://dx.doi.org/10.1007/978-3-642-02658-4_50. Hallé, S., Villemaire, R., Cherkaoui, O., Tremblay, J. et Ghandour, B. (2008). Extending model checking to data-aware temporal properties of Web Services. Lecture Notes in Computer Science, 4937 LNCS, 31–45. http://dx.doi.org/10.1007/978-3-540-79230-7_3. Hallé, S. et Villemaire, R. (2008). XML methods for validation of temporal properties on message traces with data. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 5331 LNCS(PART 1), 337–353. http://dx.doi.org/10.1007/978-3-540-88871-0_23. Hallé, S., Deca, R., Cherkaoui, O., Villemaire, R. et Puche, D. (2007). Modelling the temporal aspects of network configurations. IFIP International Federation for Information Processing, 229, 269–282. http://dx.doi.org/10.1007/978-0-387-49690-0_22. Hallé, S., Wenaas, É., Villemaire, R. et Cherkaoui, O. (2006). Self-configuration of network devices with configuration logic. Lecture Notes in Computer Science, 4195 LNCS, 36–49. Obtenir \"Self-configuration of network devices with configuration logic\" aux bibliothèques de l'UQAM Halle, S., Deca, R., Cherkaoui, O., Villemaire, R. et Puche, D. (2004). A formal validation model for the netconf protocol. Lecture Notes in Computer Science, 3278, 147–158. Obtenir \"A formal validation model for the netconf protocol\" aux bibliothèques de l'UQAM Hallé, S., Deca, R., Cherkaoui, O. et Villemaire, R. (2004). Automated validation of service configuration on network devices. Lecture Notes in Computer Science, 3271, 176–188. Obtenir \"Automated validation of service configuration on network devices\" aux bibliothèques de l'UQAM Michaux, C. et Villemaire, R. (1996). Presburger arithmetic and recognizability of sets of natural numbers by automata: New proofs of Cobham's and Semenov's theorems. Annals of Pure and Applied Logic, 77(3), 251–277. Obtenir \"Presburger arithmetic and recognizability of sets of natural numbers by automata: New proofs of Cobham's and Semenov's theorems\" aux bibliothèques de l'UQAM Villemaire, R. (1992). Completely decomposable abelian groups[InlineEquation not available: see fulltext.]-categorical over a subgroup. Archive for Mathematical Logic, 31(4), 263–275. http://dx.doi.org/10.1007/BF01794983. Villemaire, R. (1992). The theory of 〈N, +, Vk, Vl〉 is undecidable. Theoretical Computer Science, 106(2), 337–349. Obtenir \"The theory of 〈N, +, Vk, Vl〉 is undecidable\" aux bibliothèques de l'UQAM Villemaire, R. (1990). Abelian groups א0-categorical over a subgroup. Journal of Pure and Applied Algebra, 69(2), 193–204. Obtenir \"Abelian groups א0-categorical over a subgroup\" aux bibliothèques de l'UQAM Actes de colloque Halle, S., Ngoupe, E.L., Villemaire, R. et Cherkaoui, O. (2013). Distributed firewall anomaly detection through LTL model checking. Dans Proceedings of the 2013 IFIP/IEEE International Symposium on Integrated Network Management, IM 2013. Hallé, S. et Villemaire, R. (2012). Constraint-based invocation of stateful web services: The beep store (case study). Dans ICSE Workshop on Principles of Engineering Service Oriented Systems. http://dx.doi.org/10.1109/PESOS.2012.6225942. Khorchani, B., Halle, S. et Villemaire, R. (2012). Firewall anomaly detection with a model checker for visibility logic. Dans Proceedings of the 2012 IEEE Network Operations and Management Symposium, NOMS 2012. http://dx.doi.org/10.1109/NOMS.2012.6211932. Halle, S., Ngoupe, E.L., Nijdam, G., Cherkaoui, O., Valtchev, P. et Villemaire, R. (2012). ValidMaker: A tool for managing device configurations using logical constraints. Dans Proceedings of the 2012 IEEE Network Operations and Management Symposium, NOMS 2012. http://dx.doi.org/10.1109/NOMS.2012.6212037. Monnet, A. et Villemaire, R. (2010). Scalable formula decomposition for propositional satisfiability. Dans ACM International Conference Proceeding Series. http://dx.doi.org/10.1145/1822327.1822333. Hallé, S. et Villemaire, R. (2009). Flexible and reliable messaging using runtime monitoring. Dans Proceedings – IEEE International Enterprise Distributed Object Computing Workshop, EDOC. http://dx.doi.org/10.1109/EDOCW.2009.5332002. Hallé, S. et Villemaire, R. (2009). Runtime monitoring of web service choreographies using streaming XML. Dans Proceedings of the ACM Symposium on Applied Computing. http://dx.doi.org/10.1145/1529282.1529752. Villemaire, R. et Hallé, S. (2009). Strong temporal, weak spatial logic for rule based filters. Dans TIME 2009 – 16th International Symposium on Temporal Representation and Reasoning. http://dx.doi.org/10.1109/TIME.2009.15. Hallé, S. et Villemaire, R. (2008). Runtime monitoring of message-based workflows with data. Dans Proceedings – 12th IEEE International Enterprise Distributed Object Computing Conference, EDOC 2008. http://dx.doi.org/10.1109/EDOC.2008.32. Hallé, S. et Villemaire, R. (2008). Satisfying a fragment of XQuery by branching-time reduction. Dans Proceedings of the International Workshop on Temporal Representation and Reasoning. http://dx.doi.org/10.1109/TIME.2008.20. Hallé, S., Villemaire, R., Cherkaoui, O. et Ghandour, B. (2007). Model-checking data-aware tempo",
  "content_length": 10927,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:06"
}