{
  "name": "Rogério de Lemos",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/rdl",
  "status": "success",
  "content": "Rogério de Lemos - School of Computing - University of Kent University of Kent - The UK's European University University of Kent - Home Contact Maps Departments Gold award for Kent in Teaching Excellence Framework TEF About Planning and strategyStrategy: Kent 2025 UK's European university Annual review and reports How we operateCommitteesGovernanceConstitution Regulations Charity information Modern Slavery Act Transparency Statement People Vice-Chancellor Executive Group Principal officers Honorary graduates DepartmentsSchools and faculties Professional services External services Complete A-Z More about KentCareer Opportunities Essential Kent Eastern ARC Regional impact Community relations Events and what's onFull calendar Undergraduate term dates Gulbenkian Research Excellence at KentLatest research news REF 2021 Research impact Expertise Publications Public engagement Departments/peopleFind a Kent expert Schools and faculties Research Services Innovation & Enterprise Graduate School Academic/research jobs Research degreesSearch courses Research degrees How to apply Postgraduate funding Graduate school Courses Undergraduate coursesSearch coursesHow to applyFees and fundingUndergraduate courses 2023Search coursesHow to applyFees and fundingStudy abroadGo abroad Postgraduate coursesSearch courses How to apply Research degrees Taught courses Fees and funding Part-time and short coursesOnline prospectus Summer schools InternationalFoundation (IFP)Pre-sessional English Short-term programmes Visit KentOpen Days Applicant Days Informal visits Kent around the world Useful linksAccommodation Fees and funding Scholarships Locations Information for...International students Parents and family Applicants New students Locations UK locationsCanterbury MedwayTonbridge Validated institutions European centresBrussels Paris Other locationsExchanges with over 100 overseas universities International Courses Study and work abroad Double-degrees Short-term study options 'International' courses Erasmus exchanges International studentsStudy at Kent Application process When you arrive International PartnershipsWorldwide partnerships International exchanges Alumni groups/networks ContactsInternational Recruitment International Partnerships English & world languages Strategy & reputationInternational impact World-leading research UK's European university MapsInternational impact International Research Impact Campus locations Business International expertiseBusiness services Collaborative projectsConsultancyFacilitiesEmployability points CoursesUndergraduate Postgraduate Part-time (undergraduate) Executive education ContactsCareers & Employability Service Innovation & Enterprise Kent Business School Conferences and functions Sports centre and facilities News News CentreLatest storiesExpert commentPress officeSocial mediaRSS feeds Students and staffStudent newsStaff newsCampus transport newsIT service alertsSubmit a story Alumni Lasting connections...Alumni and friends News Events Community Alumni groups Former staff Useful linksTelephone Campaign Congregations Honorary graduates Discount on fees Alumni scholarships Online giftshop Giving Major projectsKent Law Campaign Kent Opportunity Fund Hong Kong & China Portal Ways to giveTelephone Campaign Online By post or phone Other options.. School of Computing School of Computing homeUndergraduate degreesMaster's degreesPhD and research degreesResearchPlacementsKent IT ConsultancyMakerspaceWorking with usAbout usNewsPeopleContact us For current students & staffInformation for studentsSystems supportInformation for staff Search School of Computing Search: University of KentSchool of Computing Rogério de Lemos Senior Lecturer / Director of Graduate Studies (Taught) workTel:     +44 (0)1227 82 3628 Email: R.Delemos@kent.ac.uk Room S106 School of Computing University of Kent, School of Computing, University of Kent Canterbury Kent CT2 7NF England Publications My publications are available from the University of Kent's Academic Repository. Otherwise you can check Google Scholar, Microsoft Academic, or ACM Author Profile. Research Interests I belong to the following research groups: Programming Languages and Systems Group Cyber Security Group External Website Research Topics Software engineering for self-adaptive systems assurances, and resilience evaluation dynamic generation of processes Handling insider threats using self-adaptive authorisation Architecting dependable systems architectural abstractions for fault tolerance verification and validation of dependable software architectures Software development for safety-critical systems Dependability and bioinspired computing Specification and verification of hybrid and real-time systems Application of game theory to software systems Current Projects \" Collaborative and Confidential Information Sharing and Analysis for Cyber Protection\". European Union’s Horizon 2020 Programme (H2020) - Grant Agreement n°700294. Past Projects \"ADAAS: Assuring Dependability in Architecture-based Adaptive Systems\". Partners: University of Coimbra, University of Lisbon, Instituto Superior Técnico, Critical Software, CMU. Started November 2010, duration three years. Sponsored by FCT Carnegie Mellon Portugal Program. \"Pervasive Service Provision using Adaptive, Dynamic Systems\". With Jon Timmis (PI), and Jason Xiaohu Liu (PhD Student). Started October 2010, duration of three years. In collaboration with NCR . \"Dynamic Adaption for Sensor Fusion (DASF)\". With Jon Timmis (PI), and Piero Conca (PhD Student). Started October 2008, duration of three years. In collaboration with NCR . \"Sensors Integrating Fusion Technology (SiFT)\". With Jon Timmis (PI), and Adam Knowles (PhD Student). Started October 2005, duration of three years. In collaboration with NCR . Poster: Artificial Immune Systems for Data Fusion: A Novel Biologically Inspired Approach. \"Immunised Fault Tolerance for Mechatronic Devices\". With Jon Timmis (PI), and Modupe Ayara (PhD Student). Started October 2001, duration of three years. In collaboration with NCR . Poster: Immune Inspired Fault Tolerance. Poster: Immunising Automated Teller Machines (ATMs). The Computing Laboratory is a node of CaberNet - Network of Excellence in Distributed and Dependable Computing. IST Contract No. IST-2000-25088. CaberNet Vision of RTD. \"Exception Handling in Dependable Software Architectures\". The Nuffield Foundation. Started May 2001, duration of two years. Poster: Exception Handling in the Software Lifecycle. \"Dependable Software for Embedded Aerospace Applications\". British Council and CAPES/Brazil. Collaboration project between the Computing Laboratory / University of Kent at Canterbury and Institute of Aeronautics and Space (IAE) / Aerospace Technical Centre (CTA). Started April 1999, duration of three years. Poster: Safety Analysis of the Destruction System of a Sounding Rocket. Journals (EB and RB) Computing Journal of Software Engineering Research and Development (JSERD) International Journal of Applied Intelligence (from 2011-2017) Nonlinear Analysis: Hybrid Systems (from 2002-2014) Journals Special Issues Journal of Universal Computer Science, Special Issue on Software Components, Architectures and Reuse Journal of Systems and Software, Special Issue on Architecting Dependable Systems JBCS Special Issue on Dependable Computing Books Software Engineering for Self-Adaptive Systems III: Assurances. Lecture Notes in Computer Science 9640. Rogerio de Lemos, David Garlan, Carlo Ghezzi, Holger Giese (Eds.). Springer. 2017. Software Engineering for Self-Adaptive Systems II. Lecture Notes in Computer Science 7475. Rogerio de Lemos, Holger Giese, Hausi A. Muller, Mary Shaw (Eds.). Springer. 2017. Assurances for Self-Adaptive Systems. Lecture Notes in Computer Science 7740. Javier Camara, Rogerio de Lemos, Carlo Ghezzi, Antonia Lopes (Eds.). Springer. 2013. Self-Organizing Architectures. Lecture Notes in Computer Science 6090. Danny Weyns, Sam Malek, Rogerio de Lemos, Jesper Andersson (Eds.). Springer. 2010. Software Engineering for Self-Adaptive Systems. Lecture Notes in Computer Science 5525. Betty H.C. Cheng, Rogerio de Lemos, Holger Giese, Paola Inverardi, Jeff Magee (Eds.). Springer. 2009. Architecting Dependable Systems Book Series. Conferences and Workshops (OC, PC, SC) 15th International Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS 2020) 14th European Conference on Software Architecture (ECSA 2020) 15th Dependable and Adaptive Distributed Systems (DADS) Track of the 35th ACM Symposium on Applied Computing (SAC 2020) Past Conferences and Workshops (OC, PC, SC) Postgraduate Topics Brief description of possible projects. Other Interests I am collecting contributions on the dependability terminology currently being used in Portuguese: Confiança no Funcionameto: Terminologia em Português School of Computing, University of Kent, Canterbury, Kent, CT2 7NF Enquiries: +44 (0)1227 824180 or contact us. Last Updated: 01/12/2025 Kent on facebook Kent on twitter Kent on linkedin Kent on youtube Kent on flickr Kent on rss Instagram Social media at Kent © University of Kent - Contact | Feedback | Legal | FOI | Cookies SGroup: European Universities Network Eastern Academic Research Consortium Universities UK",
  "content_length": 9292,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:04"
}