{
  "name": "Rohan Basu Roy",
  "homepage": "https://rohanbasuroy.github.io",
  "status": "success",
  "content": "Rohan Basu Roy Rohan Basu Roy I am an Assistant Professor (tenure-track) in the Kahlert School of Computing and SCI Institute at the University of Utah. I perform research on scheduling and optimizations on various forms of parallel and distributed computing systems like cloud computing, serverless platforms, and HPC/supercomputing systems. The goal of my research is to improve the productivity, cost-effectiveness, and sustainability of these large-scale systems. The tools and solutions from my works are largely open-sourced, regularly reproduced and used in the systems research community. My works have appeared in several highly competitive systems research venues, in recognition of which I have received the ACM-IEEE CS George Michael Memorial HPC Fellowship, MLCommons ML and Systems Rising Star recognition, and other departmental awards and recognitions. My Ph.D. is in Computer Engineering from Northeastern University Boston, advised by Prof. Devesh Tiwari. I am looking for Ph.D. students, with interest/experience in HPC and Quantum Computation, to join my group in Fall 2026. If you are motivated, please drop me an email and apply to the University of Utah's CS Ph.D. program. Publications SoCC 2025 GridGreen: Integrating Serverless Computing in HPC Systems for Performance and SustainabilityAmit Samanta, Ryan Stutsman, and Rohan Basu Roy. ACM Symposium on Cloud Computing. [Paper][Code]SoCC 2025 Water Footprint of Datacenter Applications: Methodological Implications of Manufacturing, Operational, and Decommissioning PhasesAmit Samanta, Yankai Jiang, Ryan Stutsman, and Rohan Basu Roy. ACM Symposium on Cloud Computing. [Paper][Code]SC 2025 GreenMix: Leveraging Asymmetric Multi-Core Processors for Saving Energy and Keep-Alive Cost of Serverless WorkloadsRohan Basu Roy, Tirthak Patel, Baolin Li, Sid Samsi, Vijay Gadepally, and Devesh Tiwari. International Conference on High-Performance Computing, Networking, Storage and Analysis. [Paper][Code] (Best Paper Finalist)SC 2025 Water Footprint Modeling, Characterization, and Analysis Toward Water-aware HPC System Design and OperationsYankai Jiang, Raghavendra Kanakagiri, Rohan Basu Roy, and Devesh Tiwari. International Conference on High-Performance Computing, Networking, Storage and Analysis. [Paper][Code]SIGMETRICS 2025 ForgetMeNot: Understanding and Modeling the Impact of Forever Chemicals Toward Sustainable Large-Scale ComputingRohan Basu Roy, Raghavendra Kanakagiri, Yankai Jiang, and Devesh Tiwari. International Conference on Measurement and Modeling of Computer Systems. [Paper][Code]HPDC 2025 Privacy-preserving of HPC Traces for Data Sharing and Analysis. Ana Veroneze Solórzano, Rohan Basu Roy, Devesh Tiwari, Jim Brandt, Benjamin Schwaller, and Sara Walton. International Symposium on High-Performance Parallel and Distributed Computing. [Paper][Code]   ASPLOS 2025 DarwinGame: Playing Tournaments for Tuning Applications in Noisy Cloud Environments. Rohan Basu Roy, Vijay Gadepally, and Devesh Tiwari. International Conference on Architectural Support for Programming Languages and Operating Systems Storage and Analysis. [Paper][Code]PPoPP 2025 WaterWise: Co-optimizing Carbon- and Water-Footprint Toward Environmentally Sustainable Cloud ComputingYankai Jiang, Rohan Basu Roy, Raghavendra Kanakagiri, and Devesh Tiwari. International Symposium on Principles and Practice of Parallel Programming. [Paper][Code]SoCC 2024 The Hidden Carbon Footprint of Serverless ComputingRohan Basu Roy, Raghavendra Kanakagiri, Yankai Jiang, and Devesh Tiwari. ACM Symposium on Cloud Computing.[Paper][Code]SC 2024 ECOLIFE: Carbon-Aware Serverless Function Scheduling for Sustainable ComputingYankai Jiang, Rohan Basu Roy, Baolin Li, and Devesh Tiwari. International Conference on High-Performance Computing, Networking, Storage and Analysis. [Paper][Code] SIGMETRICS 2024 StarShip: Mitigating I/O Bottlenecks in Serverless Computing for Scientific WorkflowsRohan Basu Roy, and Devesh Tiwari. International Conference on Measurement and Modeling of Computer Systems. [Paper][Code]ASPLOS 2024 CodeCrunch: Improving Serverless Performance via Function Compression and Cost-Aware Warmup Location OptimizationRohan Basu Roy, Tirthak Patel, Rohan Garg, and Devesh Tiwari. International Conference on Architectural Support for Programming Languages and Operating Systems Storage and Analysis. [Paper][Code]ASPLOS 2024 RainbowCake: Mitigating Cold-starts in Serverless with Layer-wise Container Caching and SharingHanfei Yu, Rohan Basu Roy, Christian Fontenot, Devesh Tiwari, Jian Li, Hong Zhang, Hao Wang, and Seung-Jong Park. International Conference on Architectural Support for Programming Languages and Operating Systems Storage and Analysis. [Paper][Code]SC 2023 Toward Sustainable HPC: Carbon Footprint Estimation and Environmental Implications of HPC SystemsBaolin Li, Rohan Basu Roy, Daniel Wang, Siddharth Samsi, Vijay Gadepally, and Devesh Tiwari. International Conference on High-Performance Computing, Networking, Storage and Analysis. [Paper][Code]         HPDC 2023 ProPack: Executing Concurrent Serverless Functions Faster and Cheaper. Rohan Basu Roy, Tirthak Patel, Richmond Liew, Yadu Nand Babuji, Ryan Chard, and Devesh Tiwari.  International Symposium on High-Performance Parallel and Distributed Computing. [Paper][Code]                             SC 2022 DayDream: Executing Dynamic Scientific Workflows on Serverless Platforms with Hot StartsRohan Basu Roy, Tirthak Patel, and Devesh Tiwari. International Conference on High-Performance Computing, Networking, Storage and Analysis. [Paper][Code]                         ASPLOS 2022 IceBreaker: Warming Serverless Functions Better with HeterogeneityRohan Basu Roy, Tirthak Patel, and Devesh Tiwari. International Conference on Architectural Support for Programming Languages and Operating Systems Storage and Analysis. [Paper][Code] PPoPP 2022 MASHUP: Making Serverless Computing Useful for HPC WorkflowsRohan Basu Roy, Tirthak Patel, Vijay Gadepally, and Devesh Tiwari. International Symposium on Principles and Practice of Parallel Programming. [Paper][Code] HPCA 2022 AI-Enabling Workloads on Large-Scale GPU-Accelerated System: Characterization, Opportunities, and ImplicationsBaolin Li, Tirthak Patel, Sid Samsi, Vijay Gadepally, Rohin Arora, Rohan Basu Roy, Devesh Tiwari, et al. International Symposium on High-Performance Computer Architecture. [Paper][Code]IISWC 2021 Characterizing and Mitigating the I/O Scalability Challenges for Serverless ApplicationsRohan Basu Roy, Tirthak Patel, and Devesh Tiwari. International Symposium on Workload Characterization. [Paper][Code]ISCA 2021 SATORI: Efficient and Fair Resource Partitioning by Sacrificing Short-Term Benefits for Long-Term GainsRohan Basu Roy, Tirthak Patel, and Devesh Tiwari. International Symposium on Computer Architecture. [Paper][Code]PLDI 2021 BLISS: Auto-tuning Complex Applications Using a Pool of Diverse Lightweight Learning ModelsRohan Basu Roy, Tirthak Patel, Devesh Tiwari, and Vijay Gadepally. International Conference on Programming Language Design and Implementation. [Paper][Code]SC 2021 Ribbon: Cost-Effective and QoS-Aware Deep Learning Model Inference Using a Diverse Pool of Cloud Computing Instances Baolin Li, Rohan Basu Roy, Tirthak Patel, Vijay Gadepally, Karen Gettings, and Devesh Tiwari. International Conference on High-Performance Computing, Networking, Storage and Analysis. [Paper][Code]HPCA 2021 Operating Liquid-Cooled Large-Scale Systems: Long-Term Monitoring, Reliability Analysis, and Efficiency MeasuresRohan Basu Roy, Tirthak Patel, Devesh Tiwari, Raj Kettimuthu, Paul Rich, Adam Scovel, and Bill Allcock. International Symposium on High-Performance Computer Architecture. [Paper][Code]SC 2020 Experimental Evaluation of NISQ Quantum Computers: Error Measurement, Characterization, and ImplicationsTirthak Patel, Abhay Potharaju, Baolin Li, Rohan Basu Roy, and Devesh Tiwari. International Conference on High-Performance Computing, Networking, Storage and Analysis. [Paper][Code] (Best Paper Finalist, Best Student Paper Finalist)ATC 2020 UREQA: Leveraging Operation-Aware Error Rates for Effective Quantum Circuit Mapping on NISQ-Era Quantum ComputersTirthak Patel, Baolin Li, Rohan Basu Roy, and Devesh Tiwari. USENIX Annual Technical Conference. [Paper][Code]CEC 2019 Design of a Computationally Economical Image Classifier using Generic FeaturesRohan Basu Roy, Anisha Halder Roy, Amit Konar, and Atulya Nagar. Congress in Evolutionary Computation. [Paper][Code]IJAMT 2020 Digital twin: current scenario and a case study on a manufacturing processRohan Basu Roy, Debasish Mishra, Surjya K Pal, Tapas Chakravarty, Satanik Panda, M Girish Chandra, Arpan Pal, Prateep Misra, Debashish Chakravarty, and Sudip Misra. International Journal of Advanced Manufacturing Technology. [Paper][Code]JMP 2018 A review on sensor based monitoring and control of friction stir welding process and a roadmap to Industry 4.0Debasish Mishra, Rohan Basu Roy, Samik Dutta, Surjya K Pal, and Debashish Chakravarty. Journal of Manufacturing Processes. [Paper][Code]IJAMT 2018 Weld defect identification in friction stir welding through optimized wavelet transformation of signals and validation through X-ray micro-CT scanRohan Basu Roy, Alekhya Ghosh, Soham Bhattacharyya, Raju P Mahto, Kanchan Kumari, Surjya K Pal, and Srikanta Pal. International Journal of Advanced Manufacturing Technology. [Paper][Code] Awards and Recognition 2023 ACM/IEEE-CS George Michael Memorial HPC Fellowship The ACM-IEEE CS George Michael Memorial HPC Fellowship is endowed in memory of George Michael, one of the founders of the SC Conference series. The fellowship honors exceptional PhD students throughout the world whose research focus is on high performance computing applications, networking, storage, or large-scale data analytics using the most powerful computers that are currently available.Awarded “for methods and tools that exploit cloud computing and on-premise HPC resourc",
  "content_length": 13836,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:03"
}