{
  "name": "Rohan Paul",
  "homepage": "https://www.cse.iitd.ac.in/~rohanpaul",
  "status": "success",
  "content": "Rohan Paul Home Publications Bio Teaching Contact Rohan Paul Associate Professor, Department of Computer Science and Engineering (CSE) Joint Faculty, Yardi School of Artificial Intelligence (Yardi ScAI) Associate Faculty, School of Information Technology (SIT) Indian Institute of Technology Delhi, India Email: rohan@cse.iitd.ac.in Research Areas: Robotics, Artificial Intellgence and Assistive Technologies. Recent Updates Work on scaling imitation learning to long-horizon tasks accepted at the Conference on Robot Learning (CoRL), 2025. Joint work with Shivam Jain and Sachit Sachdeva. Paper titled, \"Enabling Long(er) Horizon Imitation for Manipulation Tasks by Modeling Subgoal Transitions\". Shivam Jain also received the BOSS Award, CSE Dept. for his Dual Degree thesis on this work during Convocation 2025.' Paper titled \"A Cane-mounted System for Dynamic Orientation Prediction for Correcting Incorrect Cane-tapping by Visually Challenged Persons\" appeared in the International Conference on Robotics and Automation (ICRA), 2025. Joint work with Gagandeep Singh and Dr. Piyush Chanana. Work on scaling imitation learning to long-horizon tasks accepted at the Conference on Robot Learning (CoRL), 2025. Joint work with Shivam Jain and Sachit Sachdeva. New work on grounded temporal reasoning for assistive robots using a combination of multi-modal LLMs and robot control. Joint with Prof. Souvik Chakraborty. Arxiv version is here. Paper titled \"Uncertainty-aware Active Learning of NeRF-based Object Models for Robot Manipulators using Visual and Re-orientation Actions\" to appear in the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2024. Arxiv version is here. Paper titled \"Learning to Recover from Plan Execution Errors during Robot Manipulation: A Neuro-symbolic Approach\" to appear in the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2024. Arxiv version is here. Paper titled \"Unsupervised Learning of Neuro-symbolic Rules for Generalizable Context-aware Planning in Object Arrangement Tasks\" appeared in the International Conference on Robotics and Automation (ICRA) 2024. Project web page is: here. Invited talk at the Indo-German Workshop on Frontiers of Robot Learning (FRL 2024) at IIT Bombay (website). Serving as Area Chair for Conference on Robot Learning (CoRL) 2024. Arxiv pre-print available for work on few-shot learning of spatial inductive concepts (paper). This works paves way to teach robots high-level concepts via curriculum training allow a robot to understand, plan and execute instructions that involve making an assembly of objects. This is joint work with Namasivayam Kalithasan, Sachit Sachdeva Himanshu Gaurav Singh Divyanshu Aggarwal, Gurarmaan Singh Panjeta, Vishal Bindal, Arnav Tuli, and Parag Singla. Arxiv pre-print available for work on enabling robots to perform physical reasoning tasks (website). Such tasks are hard for pure RL to learn. Our approach combines physics-informed networks to model individual physical skills with model-based RL to plan in continuous spaces under delayed reward settings. This is joint work with Mudit Agarwal, Abhinav Barnawal, Shreshth Tuli and Souvik Chakraborty. New work on acquiring object models via active physical interaction. The Arxiv paper is here. This work shows how a robot can build a radiance field model (visual and geometric) by actively interacting with an object. Deciding the next action is by estimating model uncertainty as the robot is interacting with an object. Joint work with Saptarshi Dasgupta, Akshat Gupta and Shreshth Tuli. Three papers accepted in the International Conference on Computers Helping People with Special Needs (ICCHP) 2024. We report work on embodied AI device for aiding a visually challenged person in correct use of a sensor-mounted cane (LNCS track). The second work presents a novel system to aid 3D shape perception for a blind student (OAC Track). Further, we address accessibility challenges in enabling blind students to code introduction to programming exercises (for a COL100 course I co-taught last year). Our contribution is in enabling access to error/debug messages that appear in the terminal window as well as visual cues (like making patterns) for them to write correct code. This work appears in the innovation track in ICCHP. Four workshop papers accepted at ICRA 2024. These papers report emerging work on zero-shot scene graph generation for robot plan execution, unsupervised 3D scene graph generation for outdoor manipulation, active learning of NeRF-based object models and robot instruction following with temporal reasoning. Paper titled \"GoalNet: Inferring Conjunctive Goal Predicates from Human Plan Demonstrations for Robot Instruction Following\" to appear in AAAI 2024. The arxiv version is here. This work is motivated with the problem of teaching robots a generalized representation for what a task essentially means. We present a method that allows a robot to observe human demonstrations and infer the essential relationships that must be true for a task to be considered complete. Work on development of intelligent robotic team mate to aid security persons showcased at IInventive 2024 at IIT Hyderabad (article). We demonstrate a high-level autonomy task that allows a mobile manipulator to take in a high-level instruction and perform a multi-step interaction task under partial world knowledge. This work is supported by DIA-COE at IIT Delhi and jointly with Prof. P. V. M. Rao and Dr. M. H. Rahaman (DRDO). Invited talk at the Next Gen AI Symosium: Inspiration from Brain Science, 2023 at IIT Jodhpur (website). Invited talk at the NorthTec Symposium (Robotics and AI) at IIT Jammu (website). Invited talk at ConfAI 2023 at Plaksha University, Mohali (website). Work on teaching robots manipulation skills will appear in ICRA 2023. Joint work with Himanshu, Namasivayam, Vishal, Arnav and Prof. Parag Singla. See project website for videos, paper and code. Paper titled, \"An Intelligence Architecture for Grounded Language Communication with Field Robots\" accepted in the Journal of Field Robotics. Teamwork with Thomas Howard, Jacob Arkin, Daehyung Park, Subhro Roy Nicholas Roy and others. Our paper on learning commonse sense knowledge for robotics appeared in IJCAI, 2021. Collaboration with Mausam, Shreshth Tuli and Rajas Bansal. Link. Our paper on neuro-symbolic learning of robot manipulation programs appeared in RSS Workshop, 2021. Collaboration with Parag Singla, Vishwajeet Agarwal and Rahul Jain. Link. Co-organizing NeurIPS workshop 2021 workshop. Link. Honored to present a talk at the CMU Robotics Institute (CMU-RI) Seminar. Link. Delighted to participate in the University of Rochester Seminar Series. Thanks to Thomas Howard and Jacob Arkin at the Robotics and AI Lab! Honored to be speaking at the KAIST, Korea on Bridging the Gap between Humans and Robots. Thanks to Daehyung Park and his lab members. Link. Overview of COL864-2021 course for Planning and Estimation for Autonomous Systems. Link. Participated on the Early Career Panel (Inclusion@CoRL) Conference on Robot Learning (CoRL) 2020 Serving on the Program Committee for the AAAI Conference on Artificial Intelligence, 2021. Serving on the Program Committee for the Conference on Robot Learning (CoRL), 2020. Joint work with Rajas Bansal, Shreshth Tuli and Mausam on Learning Common sense Tool use for Robot Planning appeared in the Robotics Science and Systems (RSS) Workshop on Imitation Learning, July, 2020. Video. Paper. Arxiv pre-print available for ToolNet: Using Commonsense Generalization for Predicting Tool Use for Robot Plan Synthesis. Joint work with Rajas Bansal, Shreshth Tuli and Mausam. Link. Honored to be part of the core team for the DST's Technology Innovation Hub (TIH) for Cobotics at IIT Delhi, 2020. Contributed towards organizing the International Workshop on Human-Robot Teaming organized by Joint Advanced Technology Center (JATC) at IIT Delhi, March 2020. Contributed to Vigyan Prasar's India Science Episode on AI, 2020. Video. Grateful to be a recipient of the Pankaj Gupta Faculty Fellowship, 2020. Journal paper on Multi-Modal Estimation and Communication of Latent Semantic Knowledge for Robust Execution of Robot Instructions accepted in the International Journal on Robotics Research (IJRR) 2019. Two papers on on learning constraints and learning representations for actions with Daehyung Park and Mike Noseworthy appeared at the Conference on Robot Learning (CoRL) 2019. Started as an Assistant Professor at IIT Delhi. Smartcane receives recognition at The Gates Foundation event in Seattle. Paper on grounding robot plans from language instructions with incomplete world knowledge accepted for CoRL 2018.Video. Work on using language and physical interaction to infer latent object states accepted for ISER 2018. Video. Co-organizing NIPS ’17 workshop titled Acting and Interacting in the Real World: Challenges in Robot Learning Served as Program Committee member for RSS ’17, CoRL ’17 and AAAI Fall Symposium ’17. Presented work on Language Grounding with Learned Visual-Linguistic Context and Grounding Abstract Spatial Concepts that IJCAI 2017. Media coverage for ComText in MIT News, Engadget and The Hindu. Honored to learn that the SmartCane will be exhibited at Cooper Hewitt, Smithsonian Design Museum in New York from Dec 15, 2017 till October 2018. The device is also being curated at the National Museum of Scotland, Edinburgh, UK. Work on Grounding Unknown Concepts accepted for ISRR ’17. Follow up work on using Visual attributes for disambiguation accepted at AAAI Fall Symposium ’17.",
  "content_length": 9661,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:04"
}