{
  "name": "Rohit Vaish",
  "homepage": "https://rohitvaish.in",
  "status": "success",
  "content": "Rohit Vaish Rohit Vaish I am an Assistant Professor in the Department of Computer Science and Engineering at Indian Institute of Technology Delhi and an associate faculty at Yardi School of Artificial Intelligence. I am also part of the Theoretical Computer Science group at IIT Delhi. Previously, I was a postdoctoral researcher at Tata Institute of Fundamental Research and at Rensselaer Polytechnic Institute, and before that, I did my PhD at Indian Institute of Science. Prior to that, I was affiliated with ETH Zürich and IIT Kanpur. Address: Room 428, Department of Computer Science and Engineering, Bharti Building, IIT Delhi, Hauz Khas, New Delhi 110 016 Research My research is in the area of computational social choice, which is the study of collective decision-making problems from a computational lens. More generally, I enjoy thinking about problems at the interface of economics and computer science. Teaching (Previous Courses) Spring 2026: COL8184 - Special Topics in Economics and Computation (forthcoming) Fall 2025: COL106 - Data Structures and Algorithms (co-taught with Rajendra Kumar) Outreach (See all) December 8-12, 2025: ACM IndiCS Winter School and Seminar on \"Algorithmic Mechanism Design\" December 16, 2025: Workshop on Information in Games and Mechanisms. Register here. December 19-20, 2025: ACM India Winter School on Algorithmic Game Theory Selected Publications (See All) Best of Both Worlds: Ex-Ante and Ex-Post Fairness in Resource Allocation Haris Aziz, Rupert Freeman, Nisarg Shah, and Rohit Vaish Operations Research Journal paper (combines the EC 2020 paper by Freeman, Shah, and Vaish and the WINE 2020 paper by Aziz) A polynomial-time algorithm for finding a distribution over EF1 allocations that is envy-free in expectation. On Approximate Envy-Freeness for Indivisible Chores and Mixed Resources Umang Bhaskar, A R Sricharan, and Rohit Vaish APPROX 2021 Conference paper / arXiv / Video (17 min) from GAIW 2021 Resolving arbitrary envy cycles could fail to achieve EF1 even for additive chores. The paper proposes the top-trading envy cycle algorithm that guarantees EF1 for monotone chores. Stable Fractional Matchings Ioannis Caragiannis, Aris Filos-Ratsikas, Panagiotis Kanellopoulos, and Rohit Vaish EC 2019 and Artificial Intelligence Conference paper / Journal paper / arXiv / Video (14 min) from EC 2019 / Video (30 mins) from COMSOC video seminar The paper studies computational aspects of the stable matching problem when agents have cardinal preferences and one seeks a fractional solution with high social welfare. Greedy Algorithms for Maximizing Nash Social Welfare Siddharth Barman, Sanath Kumar Krishnamurthy, and Rohit Vaish AAMAS 2018   (Best Paper Nomination) Conference paper / arXiv A polynomial-time algorithm for maximizing Nash social welfare under binary valuations. Finding Fair and Efficient Allocations Siddharth Barman, Sanath Kumar Krishnamurthy, and Rohit Vaish EC 2018 Conference paper / arXiv An algorithmic framework for finding an allocation that is envy-free up to one good (EF1) and Pareto optimal (PO), and a 1.45-approximation algorithm for Nash social welfare. Opting Into Optimal Matchings Avrim Blum, Ioannis Caragiannis, Nika Haghtalab, Ariel Procaccia, Eviatar Procaccia, and Rohit Vaish SODA 2017 Conference paper / arXiv The paper studies a semi-random model for kidney exchange with a worst-case compatibility graph and a uniformly random assignment of patient-donor pairs to hospitals. Manipulating Gale-Shapley Algorithm: Preserving Stability and Remaining Inconspicuous Rohit Vaish and Dinesh Garg IJCAI 2017 Conference paper Under the deferred acceptance algorithm, optimal manipulation by an agent on the proposed-to side is inconspicuous and stability-preserving. Thanks!",
  "content_length": 3769,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:06"
}