{
  "name": "Rohith Venkatakrishnan",
  "homepage": "https://www.cs.ucf.edu/person/rohithvenkatakrishnan",
  "status": "success",
  "content": "Rohith Venkatakrisnan Skip to main content Rohith VenkatakrishnanAssistant Professor EMAIL Office: L3Harris Engineering Center Email: rohith.venkatakrishnan@ucf.edu Phone: 407-823-3957 Biography Research Awards News BIOGRAPHY Rohith Venkatakrishnan is an assistant professor of computer science who studies people’s experiences of using immersive virtual, augmented and mixed reality (XR) technologies. He broadly aims to understand and enhance aspects related to the user experience of these technologies, exploring how to deploy them in effective, impactful and ethical ways. His research spans a wide range of XR-related topics, including perception and cognition, cybersickness, inputs and interactions, self-avatars, artificially intelligent agents, social applications and tangible integration. Through collaborative multidisciplinary research, he aims to solve real-world problems and advance XR’s potential to transform humanity. EDUCATION Ph.D. in Human-Centered Computing, Clemson University RESEARCH Human-Computer Interaction (HCI)UX in Immersive XR (VR/AR/MR) TechnologiesCybersicknessVirtual AgentsPerception and CognitionInteraction in XRSelf Avatars AWARDS Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Honorable Mention for the Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Honorable Mention for the Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Best Paper Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Shanghai, 2023Honorable Mention for the Best Paper Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Shanghai, 2023Best Paper Award at ACM Symposium on Applied Perception, 2022Best Presentation Award at ACM Symposium on Applied Perception, 2021Best Paper Award at ACM Symposium on Applied Perception, 2020Honorable Mention for the Best Presentation Award at ACM Symposium on Applied Perception, 2020 LATEST NEWS Skip to content",
  "content_length": 2145,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:07"
}