{
  "name": "Rohit Babbar",
  "homepage": "https://research.aalto.fi/en/persons/rohit-babbar",
  "status": "success",
  "content": "Rohit Babbar - Aalto University's research portal Contact expert View Scopus Profile Rohit Babbar Assistant Professor, Professorship Marttinen P. https://orcid.org/0000-0002-3787-8971 20122025 Research activity per year Personal profile Artistic and research interestsI am an Assistant Professor at the department of Computer Science, Aalto University in Finland. Along with my research group, we work on problems in large scale machine learning particularly encountered in extreme classification with large output spaces, and robustness Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Keywordslarge scale learningextreme multi-label classificationdeep learningsequential datarobustness Fingerprint Dive into the research topics where Rohit Babbar is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Multi-Label Classification Computer Science 100% Text Classification Computer Science 89% Hierarchical Classification Computer Science 48% Classification Problem Computer Science 44% Linear Classifier Computer Science 36% Performance Metric Computer Science 30% Related Search Computer Science 27% Prediction Accuracy Computer Science 26% View full fingerprint Research output Research output per year 2012 2020 2021 2022 2024 2025 2025 28 Conference article in proceedings 7 Article 4 Working paper 2 Conference article 2 More 1 Chapter 1 Paper Research output per year Research output per year How Well Calibrated are Extreme Multi-label Classifiers? An Empirical AnalysisUllah, N., Schultheis, E., Zhang, J. & Babbar, R., 20 Jul 2025, KDD 2025 : Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining. ACM, p. 1397-1408 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open AccessFile Regression Method 100% Prediction Accuracy 100% Probability Mass 100% Related Product 100% Model Calibration 100% 1 Citation (Scopus) 10 Downloads (Pure) Large Language Model as a Teacher for Zero-shot Tagging at Extreme ScalesZhang, J., Ullah, N. & Babbar, R., 2025, The 31st International Conference on Computational Linguistics (COLING 2025). Rambow, O., Wanner, L., Apidianaki, M., Al-Khalifa, H., Di Eugenio, B. & Schockaert, S. (eds.). Association for Computational Linguistics, p. 3465-3478 14 p. (International Conference on Computational Linguistics; vol. Part F206484-1).Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open AccessFile Large Language Model 100% Superior Performance 14% Categorization System 14% Raw Text 14% New-State 14% 10 Downloads (Pure) Navigating Extremes: Dynamic Sparsity in Large Output SpacesUllah, N., Schultheis, E., Lasby, M., Ioannou, Y. & Babbar, R., 2025, Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Globerson, A., Mackey, L., Belgrave, D., Fan, A., Paquet, U., Tomczak, J. & Zhang, C. (eds.). Curran Associates Inc., 27 p. (Advances in Neural Information Processing Systems; vol. 37).Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open Access Sparsity 100% Matrix Multiplication 66% Generalization Performance 33% Commodity Hardware 33% Label Distribution 33% UniDEC : Unified Dual Encoder and Classifier Training for Extreme Multi-Label ClassificationKharbanda, S., Gupta, D., Gururaj, K., Malhotra, P., Singh, A., Hsieh, C. J. & Babbar, R., 28 Apr 2025, WWW 2025 - Proceedings of the ACM Web Conference. ACM, p. 4124-4133 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open AccessFile Textual Feature 100% 7 Downloads (Pure) A General Online Algorithm for Optimizing Complex Performance MetricsKotłowski, W., Wydmuch, M., Schultheis, E., Babbar, R. & Dembczyński, K., 2024, In: Proceedings of Machine Learning Research. 235, p. 25396-25425 30 p.Research output: Contribution to journal › Conference article › Scientific › peer-review Open AccessFile Performance Metric 100% on-line algorithm 100% Update Algorithm 33% Classification Problem 33% Electronic Learning 33% 31 Downloads (Pure) View all 43 research outputs Projects Projects per year 2022 2022 2026 1 Finished 1 Active Projects per year ScaleX/Babbar: Scalable and Robust Representation Learning in Large output SpacesBabbar, R. (Principal investigator), Arora, A. (Project Member), Kharbanda, S. (Project Member), Schultheis, E. (Project Member), Patel, M. (Project Member), Kharbanda, P. (Project Member), Ullah, N. (Project Member) & Zhang, J. (Project Member)01/09/2022 → 31/08/2026Project: RCF Academy Project Multi-Label Classification 100% Classification Problem 69% Performance Metric 45% Text Classification 44% Graphics Processing Unit 39% HPC-HD/Babbar: High Performance Computing for the Detection and Analysis of Historical DiscoursesBabbar, R. (Principal investigator), Mohammadnia Qaraei, M. (Project Member), Schultheis, E. (Project Member) & Zhang, J. (Project Member)01/01/2022 → 31/12/2024Project: RCF Academy Project targeted call Multi-Label Classification 100% Classification Problem 60% Performance Metric 39% Text Classification 38% Graphics Processing Unit 34% Datasets Dismec++Schultheis, E. (Creator) & Babbar, R. (Supervisor), Zenodo, 2022DOI: 10.5281/zenodo.6699586, https://zenodo.org/record/6699587Dataset: Software or code Prizes Outstanding Reviewer Award ACL 2021 ConferenceBabbar, R. (Recipient), 12 Jul 2021Prize: Award or honor granted for a specific work Activities Activities per year 2018 2018 2020 2021 2021 2 Conference presentation 1 Organization of a workshop, panel, session, tutorial or event 1 Participant of a conference, workshop, session, tutorial or event 1 Invited academic talk Activities per year Convex Surrogates for Unbiased Loss Functions in Extreme Classification With Missing LabelsSchultheis, E. (Speaker), Mohammadnia Qaraei, M. (Contributor) & Babbar, R. (Contributor)23 Apr 2021Activity: Talk or presentation types › Conference presentation Convex Surrogates for Unbiased Loss Functions in Extreme Classification With Missing LabelsMohammadnia Qaraei, M. (Speaker), Schultheis, E. (Contributor) & Babbar, R. (Contributor)4 Nov 2021Activity: Talk or presentation types › Invited academic talk Why state-of-the-art deep learning barely works as good as a linear classifier in extreme multi-label classificationMohammadnia Qaraei, M. (Speaker) & Babbar, R. (Contributor)2 Oct 2020Activity: Talk or presentation types › Conference presentation Dagstuhl Seminar Babbar, R. (Member)15 Jul 2018 → 20 Jul 2018Activity: Participating in or organising an event types › Participant of a conference, workshop, session, tutorial or event Tutorial on Extreme Classification for Information RetrievalBabbar, R. (Member)26 Apr 2018Activity: Participating in or organising an event types › Organization of a workshop, panel, session, tutorial or event Your message has successfully been sent. Your message was not sent due to an error. x Contact Rohit Babbar Subject:* Message:* Your name:* Your email:* Send me a copy of this message *required field See privacy policy in the footer of the page Cancel Send",
  "content_length": 7514,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:06"
}