{
  "name": "Rohini K. Srihari",
  "homepage": "https://cse.buffalo.edu/~rohini",
  "status": "success",
  "content": "Rohini K. Srihari Menu Home Teaching Research Areas Publications Conversational AI for Social Good Presentations Media Rohini K. Srihari Professor and Associate Chair, Department of Computer Science and Engineering, University at Buffalo, The State University of New York Office Address: 338C Davis Hall, Buffalo, NY 14260 Phone: +1 (716) 645-1602 E-mail: rohini [@] buffalo [DOT] edu Biography Rohini Srihari is a scientist, educator and entrepreneur. Dr. Srihari is a professor in the Dept. of Computer Science and Engineering at the State University of New York, Buffalo where her research focuses on natural language processing, artificial intelligence, machine learning and information retrieval. She teaches graduate courses in information retrieval and natural language processing and offers seminars in various topics in AI including conversational AI, deep learning in NLP and AI for social good. She supervises students’ research in both the CSE department as well as the Linguistics department. Her work has been funded by agencies such as The National Science Foundation, DARPA and IARPA. She has also worked extensively with the US Government in developing innovative multilingual text mining solutions. Her recent research focuses on advancing the state-of-the-art in socialbots capable of engaging in empathetic, interesting and purposeful conversations. This work is partly supported through an NSF grant Purposeful Conversational Agents based on Hierarchical Knowledge Graphs . She directs a research group focused on Conversational AI for Social Good that addresses research issues in building trustworthy socialbots for various purposes, including combating disinformation as well as assisting the disabled. In 2021 she supervised an interdisciplinary student team (Team Proto) that competed and won the bronze prize in the Alexa Prize Socialbot Grand Challenge 4. Here is the announcement of winners and a video describing the challenges of the compeition and featuring the top three contestants. She has published over 100 research papers in computer science journals and conference proceedings. Her Google Scholar h-index is 40. She is also the author of two US patents, one on multilingual text mining. A selected list of publications and talks is available elsewhere on this site. She has served as Chief Data Scientist at PeaceTech Lab, a non-profit incubated within the United States Institute of Peace in Washington, DC. She directed a multidisciplinary team in the development of an AI platform that leverages diverse data sources to provide scalable solutions for conflict prevention and early warning of social disruption in fragile countries. Her research is currently focused on AI for Social Good and includes topics such as predicting social unrest, identifying and combating disinformation, and conversational AI (chatbots). She has also founded and directed technology start-ups, focusing on “big data” analytics solutions for various markets. Two of these companies were subsequently acquired by large media analytics companies. In her roles as founder, CEO and chief scientist at these companies, she has handled all aspects of launching a technology start-up, including raising venture capital, building technical and business teams, directing product development, and marketing and sales. Dr. Srihari received her B. Math degree from the University of Waterloo (Canada) and her PhD in Computer Science from the State University of New York.",
  "content_length": 3480,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:06"
}