{
  "name": "Roi Yozevitch",
  "homepage": "https://cris.ariel.ac.il/en/persons/roi-yozevitch",
  "status": "success",
  "content": "Roi Yozevitch - Ariel University View Scopus Profile Roi Yozevitch Dr. Lecturer, Department of Computer and Software EngineeringFormer affiliationLecturer, Department of Computer Science https://orcid.org/0000-0001-5180-4541 20122025 Research activity per year Fingerprint Dive into the research topics where Roi Yozevitch is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Signal Strength Engineering 100% GNSS Device Keyphrases 74% Global Navigation Satellite System Keyphrases 61% Region of Interest Engineering 48% Hand Movement Keyphrases 46% Star Tracker Keyphrases 44% Neural Network Keyphrases 44% Machine Learning Algorithm Computer Science 44% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2012 2017 2021 2023 2024 2025 2025 19 Article 11 Conference contribution 1 Chapter 1 Comment/debate Research output per year Research output per year Enhanced method for assessing designed sag accuracy in overhead transmission electric lines using field data and statistical analysisNudler, A., Yozevitch, R. & Holdengreber, E., Apr 2025, In: International Journal of Electrical Power and Energy Systems. 165, 110457.Research output: Contribution to journal › Article › peer-review Open Access Statistical Analysis 100% Design Information 100% Enhanced Method 100% Overhead Transmission 100% Field Data Analysis 100% 1 Scopus citations Harnessing Haptic Technology for Real-Time Emotion DetectionLevy, L., Blum, Y., Ambaw, A., Yozevitch, R. & Holdengreber, E., 2025, In: IEEE Sensors Letters. 9, 3, 5500804.Research output: Contribution to journal › Article › peer-review Haptic Technology 100% Automatic Emotion Detection 100% Real-time Emotion Recognition 100% Social Interaction 100% Facial Expression 100% 2 Scopus citations Touch to Speak: Real-Time Tactile Pronunciation Feedback for Individuals with Speech and Hearing ImpairmentsSharon, A., Yozevitch, R. & Holdengreber, E., Aug 2025, In: Technologies. 13, 8, 345.Research output: Contribution to journal › Article › peer-review Open Access Language Development 100% Multimodal Interface 100% Phoneme Learning 25% Wearable Haptic Device 25% Multimodal Interfaces 25% Transformer-based language-independent gender recognition in noisy audio environmentsAnidjar, O. H. & Yozevitch, R., Dec 2025, In: Scientific Reports. 15, 1, 14421.Research output: Contribution to journal › Article › peer-review Open Access Audio Clips 100% Noisy Audio 100% Gender Recognition 100% Overrepresentation 100% Spectrogram 100% Exploring crystallized and fluid intelligence in down syndrome using graph theoryLifshitz, H., Shnitzer-Meirovich, S., Koslovsky, M. & Yozevitch, R., Dec 2024, In: Scientific Reports. 14, 1, 23738.Research output: Contribution to journal › Article › peer-review Open Access Graph Theory 100% Down Syndrome 100% Fluid Intelligence 100% Crystallized Intelligence 100% Intellectual Disability 66% 2 Scopus citations View all 32 Research outputs",
  "content_length": 3362,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:09"
}