{
  "name": "Roland Wismüller",
  "homepage": "https://www.bs.informatik.uni-siegen.de/mitarbeiter/wismueller/index_html",
  "status": "success",
  "content": "Roland Wismüller Skip to the navigation.Skip to the content. Fakultät IV Betriebssysteme / verteilte Systeme Mitarbeiter Lehre / Teaching Forschung Projekte CISCO Academy Kontakt Internes Sharepoint Mail unisono Formulare Suche Wir verwenden Google für unsere Suche. Mit Klick auf diesen Button aktivieren Sie das Suchfenster und akzeptieren die Nutzungsbedingungen.Hinweise zum Einsatz der Google Suche Studieninteressierte Studierende Alumni / nt / eti / bs / mitarbeiter / wismueller / Prof. Dr. Roland Wismüller Adresse / Address Address University of Siegen Fakulty IV - Science and Technology Institute of Computer Science Operating Systems / Distributed Systems Hoelderlinstr. 3 57068 Siegen, Germany Office H-B 8404 Phone +49-271-740-4050 Fax +49-271-740-14050 Email roland.wismuelleruni-siegend Encryption For confidential messages, please use my public PGP key (fingerprint: 14C2 1C3E 7770 84BB A9F4 42E3 0DB6 E6FF B27D BCB1) or my X.509 certificate for S/MIME. Sprechstunde / Consultation hour Jeweils Montags, 14:15 - 15:15 Uhr, Raum H-B 8404 Sie können mich in der Sprechstunde auch als Studiengangsberater für den Bachelor-Studiengang \"Informatik\" mit Vertiefung Mathematik in Anspruch nehmen. Ich bin derzeit Vorsitzender des Prüfungsausschusses Informatik. Bitte beachten Sie meine Abwesenheitszeiten / Please notice my times of absence. Wenn Sie eine mündliche Prüfung bei mir machen wollen, beachten Sie bitte diese Hinweise. Research Interests Secure component systems Type systems Pattern recognition in sensor data Wireless sensor networks Security Monitoring and instrumentation techniques Veröffentlichungen / Publications and Talks As HTML document As BibTeX file Current R&D Projects Cosma: A virtual machine supporting the secure cooperation of untrusted components. Closed R&D Projects GEMIMEG-II: Sichere und robuste kalibrierte Messsysteme für die digitale Transformation.LEICAR: Lernbasierte multimodale Interpretation von Sensordaten zur Ereigniserkennung in Carsharing-Flotten. MiSee: Multimodale Interpretation von Sensordaten zur automatischen Ereigniserkennung in Carsharing Flotten. D-Grid_HEP-Grid: Development of Applications and Components for Data Processing in High Energy Physics in a national e-Science Framework OMIS: On Line Monitoring Interface Specification OCM: Development of an OMIS Compliant Monitoring System DETOP: Development of a Parallel Debugger for PVM CrossGrid: Development of a Grid Environment for Interactive Applications. EU IST Project IST-2001-32243 PERIDOT: Automatic Performance Analysis for Hitachi SR8000 Combined On-line Monitoring and Tracing of Grid Applications. Cooperation with Dept. for Graphics and Parallel Processing (GUP), Joh. Kepler University Linz (Austria) and the Parallel Computing Group at Institute of Computer Science, Stanislaw Staszic University of Mining and Metallurgy in Cracow (Poland). Apart: EU IST Working Group on Automatic Performance Analysis Cooperation with the Parallel Computing Group at Institute of Computer Science, Stanislaw Staszic University of Mining and Metallurgy in Cracow (Poland): enhancing and extending the OCM (configurability, portability, scalability, support for multi-threaded applications) SFB 342 (Teilprojekt A1): Methods and Tools for the Use of Parallel Systems EuroTools: Esprit Working Group for European HPCN Tools Promotion Cooperation with the Parallel Computing Group at Institute of Computer Science, Stanislaw Staszic University of Mining and Metallurgy in Cracow (Poland): porting the OCM to MPI, porting and enhancing the performance analysis tools PATOP/TATOO GRADE-OMIS: Using OMIS/OCM as a monitoring interface for the GRADE programming environment Cooperation with Institute for Software Technology and Parallel Systems (AURORA-Project): Using DETOP and OCM as a basis for an HPF debugger Toolworld: Development of a debugger and a monitoring system for Parix/PowerPC systems (Industrial Cooperation with Parsytec) ESPRIT Project Prepare More ... Zitate und Sprüche (in German) Suche Wir verwenden Google für unsere Suche. Mit Klick auf diesen Button aktivieren Sie das Suchfenster und akzeptieren die Nutzungsbedingungen.Hinweise zum Einsatz der Google Suche © Universität Siegen | Datenschutzerklärung | Feedback zur Barrierefreiheit | E-Mail an die Webredaktion",
  "content_length": 4308,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:10"
}