{
  "name": "Rolf Stadler",
  "homepage": "https://www.kth.se/profile/stadler",
  "status": "success",
  "content": "KTH | Rolf Stadler Skip to main content Rolf StadlerProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/stadlerDetailsWorks for Division of Network and Systems EngineeringTelephone +46 8 790 42 50Unit address Teknikringen 33E-mail stadler@kth.seAbout meRolf Stadler is a professor at KTH Royal Institute of Technology in Stockholm, Sweden. He received a M.S. degree in mathematics and a Ph.D. in computer science from the University of Zurich. In 1991 he was a researcher at the IBM Zurich Research Laboratory. From 1992 to 1994 he was a visiting scholar at Columbia University in New York, which he joined in 1994 as a research scientist. From 1998 to 1999 he was a visiting professor at ETH Zurich. He joined the faculty of KTH in 2001 and is currently with the Laboratory for Communication Networks at the School of Electrical Engineering. Dr. Stadler is also a senior scientist at the Swedish Institute of Computer Science (SICS). He is a founding member of the ACCESS Linneus Center at KTH, an interdisciplinary center focusing on fundamental understanding and engineering of complex networks and systems. Dr. Stadler’s main research focus has been on integrated management of networks and systems. His group made many contributions to real-time monitoring, resource management, and self-management for large-scale networks and clouds. His current interests include advanced monitoring techniques, as well as the use of data-driven methods for network engineering and management. Dr. Stadler’s group has current collaborations with Ericsson Research (network and cloud analytics), Cisco Systems (scalable search in networked systems), and KDDI Labs (network anomaly detection). Dr. Stadler is Editor-in-Chief of IEEE Transactions on Network and Service Management (TNSM). In 2014, he received the Applied Networking Research Prize, awarded by the Internet Research Task Force (IRTF), for the paper Uddin, R. Stadler, A. Clemm: “Scalable Matching and Ranking for Network Search,” Conference on Network and Service Management (CNSM), 14-18, October 2013, Zurich, Switzerland. In 2015, Dr. Stadler received the Dan Stokesberry Award, \"presented to an individual who has made a particularly distinguished technical contribution to the growth of the network management field.\"CoursesDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in Cybersecurity, Second cycle (DA237X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerDegree Project in Computer Science and Engineering, specializing in Industrial Management, Second Cycle (DA235X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Systems, Control and Robotics, Second Cycle (DA236X), examinerDegree Project in Electrical Engineering, Second Cycle (EA250X), examinerDegree Project in Electrical Engineering, Second Cycle (EA238X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA258X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA256X), examinerDegree Project in Electrical Engineering, specializing in Communication Systems, Second Cycle (EA246X), examinerDegree Project in Electrical Engineering, specializing in Information and Network Engineering, Second Cycle (EA260X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerIndividual Project in Networked Systems (EP2800), examinerNetwork Analytics (EP2420), examinerNetwork Analytics and Data-Driven Engineering (EP272V), teacher, course responsible, examinerSeminar on Advanced Topics in Communication Networks 1 (FEP3316), examinerSeminar on Advanced Topics in Communication Networks 2 (FEP3317), examinerLinksLinkedInGoogle Scholar",
  "content_length": 4175,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:16"
}