{
  "name": "Rolf Wanka",
  "homepage": "https://www12.informatik.uni-erlangen.de/people/rwanka",
  "status": "success",
  "content": "Rolf Wanka - Lehrstuhl für Informatik 12 Organisationsmenü öffnen Organisationsmenü schließen Friedrich-Alexander-Universität Hardware-Software-Co-Design Rolf Wanka Rolf Wanka Prof. Dr. rer. nat. Rolf WankaRolf WankaVertrauensdozent/Mentor im Max Weber-ProgrammDepartment Informatik (INF)Professur für Informatik mit dem Schwerpunkt Effiziente Algorithmen und Kombinatorische OptimierungRaum: Raum 02.113-128 (Felix-Klein-Gebäude)Cauerstr. 1191058 ErlangenTelefon: +49 9131 85-25152Faxnummer: +49 9131 85-25149E-Mail: rolf.wanka@fau.deWebseite: https://www.cs12.tf.fau.de/person/rolf-wanka Publikationen (automatisch aus CRIS erzeugt, alternativ hier) 2024 Bassimir B., Wanka R.:On the Computation of Robust Examination Timetables: Methods and Experimental ResultsIn: Journal of Scheduling (2024)ISSN: 1094-6136DOI: 10.1007/s10951-024-00815-yBibTeX: Download Kergaßner M., Keszöcze O., Wanka R.:Markov Chain-based Optimization Time Analysis of Bivalent Ant Colony Optimization for Sorting and LeadingOnesGenetic and Evolutionary Computation Conference (GECCO) (Melbourne, 14. Juli 2024 - 18. Juli 2024)DOI: 10.1145/3638529.3654022BibTeX: Download 2021 Mühlenthaler M., Raß A., Schmitt M., Wanka R.:Exact Markov chain-based runtime analysis of a discrete particle swarm optimization algorithm on sorting and OneMaxIn: Natural Computing (2021)ISSN: 1567-7818DOI: 10.1007/s11047-021-09856-0BibTeX: Download 2020 Bassimir B., Schmitt M., Wanka R.:Self-adaptive potential-based stopping criteria for Particle Swarm Optimization with forced movesIn: Swarm Intelligence (2020)ISSN: 1935-3812DOI: 10.1007/s11721-020-00185-zBibTeX: Download Muradi M., Wanka R.:Processing Time Optimization for Robot Applications6th International Conference on Control, Automation and Robotics (ICCAR) (Singapore, 20. April 2020 - 23. April 2020)In: IEEE (Hrsg.): Proc. 6th International Conference on Control, Automation and Robotics (ICCAR) 2020DOI: 10.1109/ICCAR49639.2020.9108089BibTeX: Download Muradi M., Wanka R.:Sample-Based Motion Planning for Multi-Robot Systems6th International Conference on Control, Automation and Robotics (ICCAR) (Singapore, 20. April 2020 - 23. April 2020)In: IEEE (Hrsg.): Proc. 6th International Conference on Control, Automation and Robotics (ICCAR) 2020DOI: 10.1109/ICCAR49639.2020.9108020BibTeX: Download 2019 Bassimir B., Wanka R.:Robustness Approaches for the Examination Timetabling Problem under Data Uncertainty9th Multidisciplinary International Conference on Scheduling: Theory and Applications (Ningbo)In: Ruibin Bai, Zhi-Long Chen, Li Jiawei, Graham Kendall, Barry McCollum (Hrsg.): Proc. 9th Multidisciplinary International Conference on Scheduling: Theory and Applications 2019Open Access: http://www.schedulingconference.org/proceedings/2019/mista2019.pdfURL: http://www.schedulingconference.org/proceedings/2019/mista2019.pdfBibTeX: Download Raß A., Schreiner J., Wanka R.:Runtime Analysis of Discrete Particle Swarm Optimization Applied to Shortest Paths Computation19th European Conference on Evolutionary Computation in Combinatorial Optimisation (EvoCOP) (Leipzig, 24. April 2019 - 26. April 2019)In: Springer International Publishing (Hrsg.): Evolutionary Computation in Combinatorial Optimization, Cham: 2019DOI: 10.1007/978-3-030-16711-0_8BibTeX: Download Wanka R.:Swarm IntelligenceIn: it - Information Technology 61 (2019), S. 157-158ISSN: 1611-2776DOI: 10.1515/itit-2019-0034BibTeX: Download 2018 Bassimir B., Wanka R.:Probabilistic Curriculum-based Examination Timetabling12th International Conference on the Practice and Theory of Automated Timetabling (PATAT) (Vienna)In: Edmund K. Burke, Luca Di Gaspero, Barry McCollum, Nysret Musliu, Ender Özcan (Hrsg.): Proc 12th International Conference on the Practice and Theory of Automated Timetabling (PATAT) 2018Open Access: http://patatconference.org/patat2018/proceedings/URL: http://patatconference.org/patat2018/files/proceedings/paper41.pdfBibTeX: Download 2017 Mühlenthaler M., Raß A., Schmitt M., Siegling A., Wanka R.:Runtime Analysis of a Discrete Particle Swarm Optimization Algorithm on Sorting and OneMaxConference on Foundations of Genetic Algorithms (FOGA) (Copenhagen, Denmark, 12. Januar 2017 - 15. Januar 2017)In: ACM New York, NY, USA (Hrsg.): Proceedings of the 14th ACM/SIGEVO Conference on Foundations of Genetic Algorithms 2017DOI: 10.1145/3040718.3040721BibTeX: Download 2015 Raß A., Schmitt M., Wanka R.:Explanation of Stagnation at Points that are not Local Optima in Particle Swarm Optimization by Potential Analysis17th Genetic and Evolutionary Computation Conference (GECCO) (Madrid, Spain, 11. Juli 2015 - 15. Juli 2015)In: ACM New York, NY, USA (Hrsg.): Companion of Proc. 17th Genetic and Evolutionary Computation Conference (GECCO) 2015DOI: 10.1145/2739482.2764654BibTeX: Download Raß A., Schmitt M., Wanka R.:Explanation of Stagnation at Points that are not Local Optima in Particle Swarm Optimization by Potential Analysis [Extended Version] (2015)URL: https://arxiv.org/abs/1504.08241BibTeX: Download(online publication) Schmitt M., Wanka R.:Particle Swarm Optimization Almost Surely Finds Local OptimaIn: Theoretical Computer Science 561A (2015), S. 57-72ISSN: 0304-3975DOI: 10.1016/j.tcs.2014.05.017BibTeX: Download Schmitt M., Wanka R., Schwab L.:Multimodal Medical Image Registration Using Particle Swarm Optimization with Influence of the Data's Initial Orientation12th IEEE Conf. on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB) (Niagara Falls)In: Proc. 12th IEEE Conf. on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB) 2015DOI: 10.1109/CIBCB.2015.7300314BibTeX: Download 2014 Aliee H., Glaß M., Wanka R., Teich J.:Automatic Graph-based Success Tree Construction and AnalysisAnnual Reliability and Maintainability Symposium (RAMS) (Colorado Springs, Colorado, USA, 27. Januar 2014 - 30. Januar 2014)In: Proc. 60th Annual Reliability and Maintainability Symposium (RAMS) 2014DOI: 10.1109/RAMS.2014.6798487URL: https://www12.informatik.uni-erlangen.de/people/rwanka/publications/AGWT14.phpBibTeX: Download Bassimir B., Schmitt M., Wanka R.:How Much Forcing is Necessary to Let the Results of Particle Swarms Converge?International Conference on Swarm Intelligence Based Optimization (ICSIBO)In: Proc. Int. Conf. on Swarm Intelligence Based Optimization (ICSIBO) 2014DOI: 10.1007/978-3-319-12970-9_11URL: http://www12.cs.fau.de/people/rwanka/publications/BSW14.phpBibTeX: Download Lange V., Schmitt M., Wanka R.:Towards a Better Understanding of the Local Attractor in Particle Swarm Optimization: Speed and Solution QualityInternational Conference on Adaptive and Intelligent Systems (ICAIS) (Bournemouth, UK, 8. September 2014 - 10. September 2014)In: Proc. International Conference on Adaptive and Intelligent Systems (ICAIS) 2014DOI: 10.1007/978-3-319-11298-5_10URL: https://www12.informatik.uni-erlangen.de/people/rwanka/publications/LSW14.phpBibTeX: Download Mühlenthaler M., Wanka R.:Fairness in Academic Course TimetablingIn: Annals of Operations Research (2014)ISSN: 0254-5330DOI: 10.1007/s10479-014-1553-2BibTeX: Download Mühlenthaler M., Wanka R.:The Connectedness of Clash-free TimetablesInt. Conf. on the Practice and Theory of Automated Timetabling (PATAT) (York, UK)In: Proc. 10th Int. Conf. on the Practice and Theory of Automated Timetabling (PATAT) 2014URL: http://www12.cs.fau.de/people/rwanka/publications/MW14.phpBibTeX: Download 2013 Mühlenthaler M., Wanka R.:A Decomposition of the Max-min Fair Curriculum-based Course Timetabling Problem: The Impact of Solving Subproblems to Optimality6th Multidisciplinary International Scheduling Conference: Theory and Applications (MISTA) (Gent)In: Proc. 6th Multidisciplinary International Scheduling Conference: Theory and Applications 2013URL: http://www12.informatik.uni-erlangen.de/people/rwanka/publications/MW13.phpBibTeX: Download Schmitt M., Wanka R.:Exploiting Independent Subformulas: A Faster Approximation Scheme for #k-SATIn: Information Processing Letters 113 (2013), S. 337-344ISSN: 0020-0190DOI: 10.1016/j.ipl.2013.02.013BibTeX: Download Schmitt M., Wanka R.:Particles Prefer Walking Along the Axes: Experimental Insights into the Behavior of a Particle SwarmGenetic and Evolutionary Computation Conference (GECCO) (Amsterdam, 6. Juli 2013 - 10. Juli 2013)In: Companion of Proc. 15th Genetic and Evolutionary Computation Conference 2013DOI: 10.1145/2464576.2464583BibTeX: Download Schmitt M., Wanka R.:Particle Swarm Optimization Almost Surely Finds Local OptimaGenetic and Evolutionary Computation Conference (GECCO) (Amsterdam)In: Proc. 15th Genetic and Evolutionary Computation Conference 2013DOI: 10.1145/2463372.2463563BibTeX: Download 2012 Mühlenthaler M., Wanka R.:Fairness in Academic Timetabling9th Int. Conf. on the Practice and Theory of Automated Timetabling (PATAT) (Son, 28. August 2012 - 31. August 2012)In: Proc. 9th Int. Conf. on the Practice and Theory of Automated Timetabling (PATAT) 2012BibTeX: Download Riess C., Strehl V., Wanka R.:The Spectral Relation between the Cube-Connected Cycles and the Shuffle-Exchange Network10th Workshop on Parallel Systems and Algorithms (PASA) of the 25th Int. Conf. on Architecture of Computing Systems (ARCS) (München)In: GI (Hrsg.): Proc. 10th Workshop on Parallel Systems and Algorithms (PASA) of the 25th Int. Conf. on Architecture of Computing Systems (ARCS) 2012BibTeX: Download 2011 Angermeier J., Sibirko E., Wanka R., Teich J.:Bitonic Sorting on Dynamically Reconfigurable ArchitecturesIEEE International Symposium on Parallel and Distributed Processing Workshops and Phd Forum (IPDPSW) (Anchorage, AL, 16. Mai 2011 - 20. Mai 2011)In: Proc. IEEE International Symposium on Parallel and Distributed Processing Workshops and Phd Forum (IPDPSW), New York, NY, USA: 2011DOI: 10.1109/IPDPS.2011.164BibTeX: Download Helwig S., Neumann F., Wanka R.:Velocity Adaptation in Particle Swarm OptimizationIn: Handbook of Swarm Intelligence, Heidelberg: Springer, 2011, S. 155-173 (Ad",
  "content_length": 21850,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:16"
}