{
  "name": "Rolf Kraemer",
  "homepage": "https://www.b-tu.de/fg-systeme/team/professor",
  "status": "success",
  "content": "Professor - Fachgebiet Systeme - BTU Cottbus-Senftenberg × Zielgruppen Schulen & Lehrkräfte Studieninteressierte Internationale Studieninteressierte Studierende Alumni Beschäftigte Stifter & Förderer Presse Querverweise Stellenangebote Lehrangebote eLearning Bibliothek IT-Services Campuspläne Mensapläne Webmail Rolf Kraemer Prof. Dr.-Ing. Rolf KraemerBTU Cottbus-SenftenbergErich-Weinert-Str. 103046 Cottbus Lehrgebäude 10, Raum 236/237 T +49 (0) 335 5625 342F +49 (0) 335 5625 671 Prof. Dr.-Ing. Rolf KraemerBTU Cottbus-Senftenberg Erich-Weinert-Str. 103046 CottbusLehrgebäude 10Raum 236/237 T +49 (0) 335 5625 342F +49 (0) 335 5625 671Rolf.Kraemer(at)b-tu.de Hinweis zu Cookies Unsere Webseite verwendet Cookies. Diese haben zwei Funktionen: Zum einen sind sie erforderlich für die grundlegende Funktionalität unserer Website. Zum anderen können wir mit Hilfe der Cookies unsere Inhalte für Sie immer weiter verbessern. Hierzu werden pseudonymisierte Daten von Website-Besuchern gesammelt und ausgewertet. Das Einverständnis in die Verwendung der technisch nicht notwendigen Cookies können Sie jeder Zeit wiederrufen. Weitere Informationen erhalten Sie auf unseren Seiten zum Datenschutz. Einstellungen [TODO] Erforderlich Diese Cookies werden für eine reibungslose Funktion unserer Website benötigt. [TODO] Statistik Für den Zweck der Statistik betreiben wir die Plattform Matomo, auf der mittels pseudonymisierter Daten von Websitenutzern der Nutzerfluss analysiert und beurteilt werden kann. Dies gibt uns die Möglichkeit Websiteinhalte zu optimieren. NameZweckAblaufTypAnbieter _pk_id Wird verwendet, um ein paar Details über den Benutzer wie die eindeutige Besucher-ID zu speichern. 13 Monate HTML Matomo _pk_ref Wird benutzt, um die Informationen der Herkunftswebsite des Benutzers zu speichern. 6 Monate HTML Matomo _pk_ses Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo Erforderliche Cookies akzeptieren Alle Cookies akzeptieren Einstellungen speichern ×",
  "content_length": 2013,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:12"
}