{
  "name": "Rolf H. Krause",
  "homepage": "http://search.usi.ch/people/385ec98e41e4068a2f61ba6cdbf33c9d/Krause-Rolf",
  "status": "success",
  "content": "Krause, Rolf | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Rolf Krause http://usi.to/jky Biography Prof. Rolf Krause's research focuses on numerical simulation, machine learning, optimization, and data driven approaches. The complexity of real world applications constitutes a challenge for model and data based prediction, turning the development of models and of solution methods into a challenging task. In addition to a well balanced combination of methodological and mathematical knowledge, it also requires experience in dealing with subtle aspects of the implementation. Rolf Krause holds a chair of advanced scientific computing in the faculty of informatics and is the director of the institute of computational science (ICS). He is also the Co-director of the Center for Computational Medicine in Cardiology (CCMC) at USI From 2003 to 2009, he was professor for Scientific Computing at the University of Bonn. During that time he spent a sabbatical at UC San Diego (USA) and Columbia University New York (USA). In 2002 he was on a research visit at the Courant Institute (NYU, New York). He holds a Diploma and a PhD (2000) in Applied Mathematics from FU Berlin (Germany). He is the head of the group \"High Performance Methods for Numerical Simulation in Science, Medicine, and Engineering\". The research in his group focuses on numerical simulation for complex and data-intensive applications, techniques for advanced machine learning, and scientific software for large scale applications and HPC. As a new direction of research, the transfer of techniques from scientific computing and HPC to machine learning has been established in his group, paving the road to ExaScale ML. On the software side, in his group Utopia, a hardware portable library for Scientific Computing and Machine Learning is developed, which allows for efficiently exploiting modern and possibly specialized hardware, such as GPUs and other accelerators. In terms of applications, focus areas are medicine, in particular cardiology; image analysis; geo-physics and geo-mechanics, including porous media and the modeling of fracture networks; computational mechanics for non-smooth systems, including friction and contact. His editorial service includes the SIAM Journal on Scientific Computing (SISC) and Computing and Visualizatio in Science (Springer), and Numerische Mathematik (Springer). Academic Career Since 2021Director of the interdisciplinary interfaculty  Euler Institute at USI 2017 Co-Founder of the start-up “Algo4U Sagl” 2016 Research visit at Lawrence Livermore National Laboratories, California 2014 Offer for a W3-professorship “Wissenschaftliches Rechnen” (Scientific Computing), University of Hannover. Not realized Since 02/2014 (Founding) Director of CCMC – Center for Computational Medicine in Cardiology, Università della Svizzera italiana and Cardiocentro Lugano, together with Prof. A. Auricchio (Cardiocentro Lugano/eoc). 2009 - 2021 Director of the Institute of Computational Science (ICS), USI Since 2009 Chair for Advanced Scientific Computing, Faculty of  Informatics, USI 11/2008 - 01/2009 Visit at the University of California, San Diego, supported by the DFG 08/2008 - 10/2008 Visit at the Columbia University, New York, supported by the DFG 2008 Offer for a full W3-professorship in Scientific Computing at the University of Mainz, not realized 2006-03/2009 Member of the Hausdroff-Center in Mathematics (DFG funded “Cluster of Excellence” at the University of Bonn 11/2003 - 03/2009 Professor of Scientific Computing/Numerical Simulation (C3) at the University of Bonn, Institute for Numerical Simulation 08/2002 - 10/2002 Visit at the Courant-Institute of Mathematical Sciences in New York, supported by the DFG 01/2002 - 10/2003 Assistant lecturer at the Freie Universität Berlin, Department of Mathematics and Informatics 2001 PhD in Applied Mathematics  (\"summa cum laude\"). Advisor: Prof. R. Kornhuber 06/1998– 12/2001 Scientific assistant within a DFG project on the efficient numerical simulation of frictional contact problems 10/1996 - 05/1998 Scientific assistant at the University of Stuttgart, Member of the Collaborative Research Center SFB 404 “Multifield Problems in Solid and Fluid Mechanics” 1993 - 10/1996 Student assistant Academic Service Since 2021 Director of the interdisciplinary interfaculty Euler Institute at USI 2019-2021 Elected member of the Academic Senate of USI 2017-2019 Elected member of the Academic Senate of USI Since 2015 Co-Director “Center for Computational Medicine in Cardiology” (CCMC) 2015 - 2017 Vice-Dean, Faculty of Informatics, USI 2009 - 2020 Director Institute of Computational Science, Faculty of Informatics, USI. 2007 – 2009 Chairman of the examination board for the Bachelor- and Master studies in mathematics at the University of Bonn 2009 – 2012 Director of the master specialization “Applied Mathematics and Computational Science”, faculty of informatics, USI, Lugano Since 2013 Vice-Director of the master program “Applied Mathematics and Computational Science”, Institute of Computational Science, USI, Lugano Reviewer for the DFG, and for SISC, SINUM, Numerische Mathematik, APNUM, IJNME, ACOM, CMAME and other international Journals Advisory Boards ·         Member of the “Eidgenössischen Geologische Fachkommission (EGK) - Swiss FederAl Geological Commission” ·         Since 2018: Member of the Scientific Advisory Board of ZIB (Zuse-Institut Berlin) www.zib.de ·         2019 - 2021: Member of the “National Strategic Comission for High Performance Computing” of the German “Joint Science Conference” (Strategieausschusses Nationales Hochleistungsrechnen der Gemeinsamen Wissenschaftskonferenz (GWK)) 201Since 2021: Chairman of the “National Strategic Comission for High Performance Computing” of the German “Joint Science Conference” (Strategieausschusses Nationales Hochleistungsrechnen der Gemeinsamen Wissenschaftskonferenz (GWK)) Supervised Theses ≥ 31 completed diploma/master and bachelor theses in the areas computational geo-sciences, contact problems, multiscale simulation methods, simulation of biomechanical and biological processes, bionics and continuum mechanics, cardiac simulation, and GPU accelerated computing (partly in cooperation with the Jülich Supercomputing Center, the Institute of Zoology at the University Bonn, and the Swiss Supercomputing Center CSCS); ≥ 22 finished PhD theses in the areas machine learning, computational geo-sciences, cardiac simulation, finite elements, concurrent multiscale simulations, parallel nonlinear solution methods, constrained optimization, nonconforming domain decomposition methods, multigrid methods, vortex particle methods for fluid simulations, residual based error estimators for contact problems, and time discretizations for contact problems, HPC. Graduade teaching programmes ·         Swiss Graduate school “FoMICS - Foundations in Mathematics and Informatics for Computer Simulations in Science and Engineering” within the SUK-program “Doktoratsprogramme”. 2013 - 2021 ·         Participation in the Swiss Graduate School “Computational Toolbox” within the SUK-program “Doktoratsprogramme” Leading House: University of Basel with participants from USI and ETH Zurich. 01/2013-12/2016 ·         Former Participation in the post graduate program (DFG-Graduiertenschule) “Bionics – interaction on boundary layers” with the PhD scholarship: “Design of a biomimetic infrared (IR) sensor: Numerical simulation of the transduction-process” 08/2008-07/2011 ·         former Participation in the “Bonn International Graduate School in Mathematics within the excellence cluster “Mathematics: Foundations, Models, Applications” 04/2007-09/2012 Awards ·          \"MATH+ Distinguished Visiting Scholar Berlin Mathematics Research Center MATH+, 2020 ·         Offer for a W3-professorship “Wissenschaftliches Rechnen” (Scientific Computing), University of Hannover, 2014 ·         Offer for a full W3-professorship in Scientific Computing at the University of Mainz, 2008 ·         Youngest professor at the University of Bonn at the start of duty in 2003 ·         Zuse-fellowship (http://www.zib.de), Berlin, 2004 ·         Taylor & Francis prize for “Innovative Contribution to Theoretical Biomechanics/Biomedical Engineering”, 8th International Symposium on Computer Methods in Biomechanics and Biomedical Engineering, Porto, 2008 ·         Membership High-Q Club, Research Center Jülich, 2013 with M. Emmet (Berkeley), M. Bolten (Wuppertal), R. Speck (Jülich), D. Ruprecht (Lugano) ·         PhD thesis of M. Walloth has been awarded with the GAMM-Körperpreis 2013 ·         Faculty price for “Best Thesis in 2013” for the PhD thesis of D. Krause ·         Best Poster Award for Computer Science & Mathematics, Pasc14, Conference of the Swiss Platform for Advanced Scientific Computing, 2014 Monolithic coupling of finite element and finite volume methods for Fluid-Structure-Interaction. Presenting author: Johannes Steiner (USI) Co-author: Rolf Krause (USI) ·         Best Poster Award for Computer Science & Mathematics, Pasc15, Conference of the Swiss Platform for Advanced Scientific Computing, 2015 Energy Efficiency of Parareal. Presenting author: Daniel Ruprecht (USI, Switzerland) Co-authors: Andrea Arteaga (ETH Zurich, Switzerland); Rolf Krause (USI, Switzerland) ·         Best Poster Award for Computer Science & Mathematics, Pasc16, Conference of the Swiss Platform for Advanced Scientific Computing, 2016 Energy Efficiency of Parareal. Hadi Zolfaghari (University of Bern), Co-authors: Bama Errol Mario Becsek (University of Bern), Maria Giuseppina Chiara Nestola (USI, Switzerland), Dominik Obrist (Univ",
  "content_length": 11500,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:14"
}