{
  "name": "Roman Klinger",
  "homepage": "https://www.uni-bamberg.de/en/nlproc/team/prof-dr-roman-klinger",
  "status": "success",
  "content": "Prof. Dr. Roman Klinger - Fundamentals of Natural Language Processing Prof. Dr. Roman Klinger Prof. Dr. Roman Klinger heads the BamNLP research group and is professor for  Fundamentals of Natural Language Processing.He studied computer science with a minor in psychology, holds a Ph.D. in computer science from TU Dortmund University (2011), and received the venia legendi in computer science in Stuttgart (2020). Before moving to Bamberg, he worked at the Institute for Natural Language Processing in Stuttgart, at the University of Bielefeld, at the Fraunhofer Institute for Algorithms and Scientific Computing, and the University of Massachusetts Amherst. Roman Klinger’s vision is to enable computers to understand and generate text regarding both factual and non-factual information. This finds application in interdisciplinary research, including biomedical text mining, digital humanities, modelling psychological concepts (like emotions) in language, and social media mining. These topics often constitute novel challenges to existing machine learning methods. Therefore, he and his group also contribute to the fields of probabilistic and deep machine learning.You can find more detailed information on Roman Klinger at https://romanklinger.de/cv/. Selected Publications Bagdon, Christopher Doyle et al. (2024): “You are an expert annotator”: Automatic Best–Worst-Scaling Annotations for Emotion Intensity Modeling. In: Proceedings of the 2024 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Mexico City, Mexico: Association for Computational Linguistics. S. 7917–7929.Wegge, Maximilian/Klinger, Roman (2024): Topic Bias in Emotion Classification. In: Proceedings of the Ninth Workshop on Noisy and User-generated Text (W-NUT 2024). San Ġiljan, Malta: Association for Computational Linguistics. S. 89–103.Wührl, Amelie et al. (2024): What Makes Medical Claims (Un)Verifiable?: Analyzing Entity and Relation Properties for Fact Verification. In: Proceedings of the 18th Conference of the European Chapter of the Association for Computational Linguistics. Association for Computational Linguistics. S. 2046–2058.Klinger, Roman (2023): Where are We in Event-centric Emotion Analysis?: Bridging Emotion Role Labeling and Appraisal-based Approaches. In: Proceedings of the Big Picture Workshop. Singapore: Association for Computational Linguistics. S. 1–17.Menchaca Resendiz, Yarik/Klinger, Roman (2023a): Affective Natural Language Generation of Event Descriptions through Fine-grained Appraisal Conditions. In: Proceedings of the 16th International Natural Language Generation Conference. Prag: Association for Computational Linguistics. S. 375–387.Menchaca Resendiz, Yarik/Klinger, Roman (2023b): Emotion-Conditioned Text Generation through Automatic Prompt Optimization. In: Proceedings of the 1st Workshop on Taming Large Language Models: Controllability in the era of Interactive Assistants! Prag: Association for Computational Linguistics. S. 24–30.Troiano, Enrica/Klinger, Roman/Padó, Sebastian (2023): On the Relationship between Frames and Emotionality in Text. In: Northern European Journal of Language Technology 9.Troiano, Enrica/Oberländer, Laura/Klinger, Roman (2023): Dimensional Modeling of Emotions in Text with Appraisal Theories: Corpus Creation, Annotation Reliability, and Prediction. In: Computational linguistics 49, S. 1–72.Velutharambath, Aswathy/Klinger, Roman (2023): UNIDECOR: A Unified Deception Corpus for Cross-Corpus Deception Detection. In: Proceedings of the 13th Workshop on Computational Approaches to Subjectivity, Sentiment, & Social Media Analysis. Toronto: Association for Computational Linguistics. S. 39–51.Velutharambath, Aswathy/Sassenberg, Kai/Klinger, Roman (2023): Prevention or Promotion?: Predicting Author’s Regulatory Focus. In: Northern European Journal of Language Technology 9.Kadiķis, Emīls/Srivastav, Vaibhav/Klinger, Roman (2022): Embarrassingly Simple Performance Prediction for Abductive Natural Language Inference. In: Proceedings of the 2022 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Seattle: Association for Computational Linguistics. S. 6031–6037.Khlyzova, Anna/Silberer, Carina/Klinger, Roman (2022): On the Complementarity of Images and Text for the Expression of Emotions in Social Media. In: Proceedings of the 12th Workshop on Computational Approaches to Subjectivity, Sentiment & Social Media Analysis. Association for Computational Linguistics. S. 1–15.Kreuter, Anne/Sassenberg, Kai/Klinger, Roman (2022): Items from Psychometric Tests as Training Data for Personality Profiling Models of Twitter Users. In: Proceedings of the 12th Workshop on Computational Approaches to Subjectivity, Sentiment & Social Media Analysis. Dublin: Association for Computational Linguistics. S. 315–323.Papay, Sean/Klinger, Roman/Padó, Sebastian (2022): Constraining Linear-chain CRFs to Regular Languages. arxiv.Plaza-del-Arco, Flor Miriam/Martín-Valdivia, María-Teresa/Klinger, Roman (2022): Natural Language Inference Prompts for Zero-shot Emotion Classification in Text across Corpora. In: Proceedings of the 29th International Conference on Computational Linguistics. Gyeongju: International Committee on Computational Linguistics. S. 6805–6817.Sabbatino, Valentino et al. (2022): “splink” is happy and “phrouth” is scary: Emotion Intensity Analysis for Nonsense Words. In: Proceedings of the 12th Workshop on Computational Approaches to Subjectivity, Sentiment & Social Media Analysis. Dublin: Association for Computational Linguistics. S. 37–50.Troiano, Enrica et al. (2022): x-enVENT: A Corpus of Event Descriptions with Experiencer-specific Emotion and Appraisal Annotations. In: Proceedings of the Thirteenth Language Resources and Evaluation Conference. Marseille: European Language Resources Association. S. 1365–1375.Troiano, Enrica/Velutharambath, Aswathy/Klinger, Roman (2022): From theories on styles to their transfer in text: Bridging the gap with a hierarchical survey. In: Natural Language Engineering 29, S. 849–908.Wührl, Amelie/Klinger, Roman (2022a): Recovering Patient Journeys: A Corpus of Biomedical Entities and Relations on Twitter (BEAR). In: Proceedings of the Thirteenth Language Resources and Evaluation Conference. Marseille: European Language Resources Association. S. 4439–4450.Wührl, Amelie/Klinger, Roman (2022b): Entity-based Claim Representation Improves Fact-Checking of Medical Content in Tweets. In: Proceedings of the 9th Workshop on Argument Mining. Gyeongju: International Conference on Computational Linguistics. S. 187–198.Doan Dang, Bao Minh/Oberländer, Laura Ana Maria/Klinger, Roman (2021): Emotion Stimulus Detection in German News Headlines. In: Proceedings of the 17th Conference on Natural Language Processing (KONVENS 2021). KONVENS 2021 Organizers. S. 73–85.Grimminger, Lara/Klinger, Roman (2021): Hate Towards the Political Opponent: A Twitter Corpus Study of the 2020 US Elections on the Basis of Offensive Speech and Stance Detection. In: Proceedings of the Eleventh Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis. Association for Computational Linguistics. S. 171–180.Troiano, Enrica/Padó, Sebastian/Klinger, Roman (2021): Emotion Ratings: How Intensity, Annotation Confidence and Agreements are Entangled. In: Proceedings of the Eleventh Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis. Association for Computational Linguistics. S. 40–49.Bostan, Laura Ana Maria/Kim, Evgeny/Klinger, Roman (2020): GoodNewsEveryone: A Corpus of News Headlines Annotated with Emotions, Semantic Roles, and Reader Perception. In: Proceedings of the Twelfth Language Resources and Evaluation Conference. Paris: European Language Resources Association. S. 1554–1566.Haider, Thomas et al. (2020): PO-EMO: Conceptualization, Annotation, and Modeling of Aesthetic Emotions in German and English Poetry. In: Proceedings of the Twelfth Language Resources and Evaluation Conference. Paris: European Language Resources Association. S. 1652–1663.Hofmann, Jan et al. (2020): Appraisal Theories for Emotion Classification in Text. In: Proceedings of the 28th International Conference on Computational Linguistics. International Committee on Computational Linguistics. S. 125–138.Papay, Sean/Klinger, Roman/Padó, Sebastian (2020): Dissecting Span Identification Tasks with Performance Prediction. In: Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Computational Linguistics. S. 4881–4895.Troiano, Enrica/Klinger, Roman/Padó, Sebastian (2020): Lost in Back-Translation: Emotion Preservation in Neural Machine Translation. In: Proceedings of the 28th International Conference on Computational Linguistics. International Committee on Computational Linguistics. S. 4340–4354.Barnes, Jeremy/Klinger, Roman (2019): Embedding Projection for Targeted Cross-Lingual Sentiment: Model Comparisons and a Real-World Study. In: Journal of artificial intelligence research 66, S. 691–742.Kim, Evgeny/Klinger, Roman (2019): Frowning Frodo, Wincing Leia, and a Seriously Great Friendship: Learning to Classify Emotional Relationships of Fictional Characters. In: Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics. S. 647–653.McHardy, Robert/Adel, Heike/Klinger, Roman (2019): Adversarial Training for Satire Detection: Controlling for Confounding Variables. In: Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics. S. 660–665.Troiano, Enrica/Klinger, Roman/Padó, Sebastian (2019): Crowdsourcing and Validating Event-focused Emotion Corpora for German and English",
  "content_length": 12451,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:18"
}