{
  "name": "Roman Dumitrescu",
  "homepage": "http://www.hni.uni-paderborn.de/ase",
  "status": "success",
  "content": "Advanced Systems Engineering - Heinz Nixdorf Institut (HNI) | Universität Paderborn „Digitalisierung und Nachhaltigkeit gelten heute als wichtigste Veränderungstreiber für produzierende Unternehmen. Mit Advanced Systems Engineering erarbeiten wir fachübergreifende Lösungsansätze, um auftretende Herausforderungen bestmöglich zu meistern.” Prof. Dr.-Ing. Roman Dumitrescu, Leiter der Fachgruppe \"Advanced Systems Engineering\" am Heinz Nixdorf Institut der Universität Paderborn aus Paderborn Advanced Systems Engineering steht für die zukunftsorientierte Entwicklung intelligenter technischer Systeme. In einer Zeit, in der die Digitalisierung als zentraler Veränderungstreiber wirkt, eröffnen sich sowohl faszinierende Nutzungspotenziale Potenziale als auch Veränderungen für Industrie und Gesellschaft. An dieser Stelle setzen wir an: Durch das Zusammenspiel von Elektronik, Informatik und Maschinenbau verfolgen wir das Ziel, neue Denk- und Arbeitsweisen für die Produktentstehung zu etablieren, die über klassische Entwicklungsmethoden hinausgehen. Im Fokus steht dabei die ganzheitliche Betrachtung und enge Verzahnung der zentralen Aufgaben in diesem Prozess. Mit fachlichem Austausch, der Entwicklung innovativer Methoden und der Förderung interdisziplinärer Zusammenarbeit gestalten wir aktiv die nächste Generation technischer Systeme. Mehr... News der Fachgruppe 25.11.2025 Su­staina­ble Li­fe­cy­cle En­gi­nee­ring Mehr erfahren 30.10.2025 Go­Pro­Ze­ro – Di­gi­ta­li­sie­rung trifft Kreis­l­auf­wirt­schaft Mehr erfahren 27.10.2025 Stel­le­n­an­zei­ge für wis­sen­schaft­li­che Mit­a­r­bei­ter*in­nen (w/m/d) zur Er­for­schung von Ziel­sys­te­men in der… Mehr erfahren 18.08.2025 Wir gra­tu­lie­ren Le­on Öz­can zur be­stan­de­nen Pro­mo­ti­ons­prü­fung Mehr erfahren 28.07.2025 Da­ten als Weg­wei­ser – Die Zu­kunft des Pro­dukt­ma­na­ge­ments neu de­fi­nie­ren Mehr erfahren 09.07.2025 Wir gra­tu­lie­ren Da­ni­e­la Hob­scheidt zur be­stan­de­nen Pro­mo­ti­ons­prü­fung Mehr erfahren 17.06.2025 Er­folg­rei­cher Pro­jekt­ab­schluss: „Zir­ku­Pro“ bie­tet pra­xis­na­he Lö­sung für mehr Nach­hal­tig­keit in der Pro­duk­tent­ste­hung Mehr erfahren 16.06.2025 Li­sa Petz­ke be­sucht 34th IA­MOT in Mon­tre­al Mehr erfahren 11.06.2025 Wir gra­tu­lie­ren Jo­na­than Brock zur be­stan­de­nen Pro­mo­ti­ons­prü­fung Mehr erfahren 11.06.2025 Wir gra­tu­­lie­ren La­ban As­mar zur be­­stan­­de­­nen Pro­­mo­ti­­ons­prü­­fung Mehr erfahren 26.03.2025 100 Jah­re Heinz Nix­dorf: Ler­nen mit der Lern­fa­brik - spie­le­risch das Zu­sam­men­spiel von Ro­bo­tern, Ma­schi­nen und Com­pu­tern ent­de­cken Mehr erfahren 21.03.2025 Lö­sun­gen für ef­fi­zi­en­te und nach­hal­ti­ge Pro­dukt­ent­wick­lung Mehr erfahren 17.03.2025 För­der­vor­ha­ben In­GAIA-X ver­öf­fent­licht Ab­schluss­pu­bli­ka­ti­on Mehr erfahren 05.03.2025 Wir gra­tu­lie­ren Me­li­na Panz­ner zur be­stan­de­nen Pro­mo­ti­ons­prü­fung Mehr erfahren 26.02.2025 For­schungs­pro­jekt pro­duct.in­tel­li­gence ver­öf­fent­licht Whi­te­pa­per Mehr erfahren Weitere Neuigkeiten Team Mehr erfahren Pu­bli­ka­ti­o­nen Mehr erfahren Ba­che­lor- und Mas­ter­a­r­bei­ten Mehr erfahren For­schung Forschungsschwerpunkt ist die Produktentstehung intelligenter technischer Systeme. Dabei setzt die Fachgruppe mit Advanced Systems Engineering auf einen fachübergreifenden technologiegestützten Entwicklungsansatz, der den gesamten Innovationsprozess im Blick hat – von der strategischen Planung bis hin zum Markterfolg. Forschungsthemen Leh­re Wir engagieren uns intensiv in der Lehre und Ausbildung von Studierenden und Nachwuchswissenschaftler/inne/n wie Doktorand/inn/en, Habilitand/inn/en und Juniorprofessor/inn/en mit dem Ziel, ihnen die Voraus­setzung für die Gestaltung der Zukunft zu vermitteln. Lehrveranstaltungen Pro­jek­te Wir können Unternehmen wesentliche Impulse für Innovationen und für den Erhalt ihrer Wettbewerbsfähigkeit geben. Dafür gibt es viele Ansätze. Sie reichen von der Vermittlung von Absolventen über Verbundprojekte bis hin zu Auftragsentwicklungen, die wir in der Regel über unsere Spin-offs durchführen. Projektübersicht Wer­de Teil des Teams In der Fachgruppe Advanced Systems Engineering erwarten Sie vielfältige Karrierechancen in einem zukunftsorientierten Umfeld. Im Fokus steht die Entwicklung digital getriebener, intelligenter technischer Systeme. Interdisziplinäre Projekte aus Elektronik, Informatik und Maschinenbau bieten spannende Aufgaben und fördern Ihre persönliche sowie fachl Mehr erfahren Ge­mein­sam Zu­kunft ge­stal­ten Unsere Forschung zeichnet sich durch hohe Praxisorientierung aus. Unsere Forschungsergebnisse und unsere Expertise stellen wir interessierten Unternehmen gerne im Rahmen von Kooperationen zu Verfügung. Allen Formaten ist gemein, dass wir gemeinsam mit Ihnen konkrete Mehrwerte für Ihr Unternehmen schaffen wollen. Mehr erfahren „Meine ewige Fragerei hat mich auf diesen Weg geführt: Wie funktionieren all diese Maschinen, die wir täglich benutzen, sei es beim Fahren oder in anderen alltäglichen Situationen, und die scheinbar selbstverständlich zu unserem Leben dazugehören?” Lisa Irene Petzke, Wissenschaftlerin der Fachgruppe \"Advanced Systems Engineering\" am Heinz Nixdorf Institut der Universität Paderborn aus Paderborn Der Dreiklang aus unserer Fachgruppe, dem Fraunhofer IEM und dem Technologienetzwerk it's OWL formt unser Ökosystem. Wir nehmen wir die Rolle der Grundlagenforschung ein. Das Fraunhofer IEM zeichnet sich durch angewandte Forschung aus und it's OWL ermöglicht den Transfer und die Umsetzung in der Praxis. Mehr erfahren Der Dreiklang aus unserer Fachgruppe, dem Fraunhofer IEM und dem Technologienetzwerk it's OWL formt unser Ökosystem. Wir nehmen wir die Rolle der Grundlagenforschung ein. Das Fraunhofer IEM zeichnet sich durch angewandte Forschung aus und it's OWL ermöglicht den Transfer und die Umsetzung in der Praxis. Mehr erfahren Komplementiert wird unser Ökosystem durch den Ehemaligenverein »KOMMIT e.V. – Kommunikationskreis für Unternehmensführung und Informationstechnik«. Als Informationsnetzwerk fördert der gemeinnützige Verein den Erfahrungsaustausch seiner Mitglieder. Mehr erfahren Ein Forum für Strategen auf hohem Niveau23. & 24. Oktober | Berlin Mehr denn je kommt es auf Strategiekompetenz an, d.h. auf das frühzeitige Erkennen der Erfolgspotentiale von morgen und das rechtzeitige Erschließen dieser Erfolgspotentiale. Die Veranstaltung bietet ein anspruchsvolles Forum, in dem Fachleute aus Industrie und Wissenschaft ihre Arbeiten präsentieren, diskutieren und Erfahrungen austauschen können. ­→ Mehr Informationen auf der Webseite",
  "content_length": 6610,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:18"
}