{
  "name": "Roman Bauer 0001",
  "homepage": "https://www.surrey.ac.uk/people/roman-bauer",
  "status": "success",
  "content": "Dr Roman Bauer | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Twitter Dr Roman Bauer Senior Lecturer +441483686737 r.bauer@surrey.ac.uk19 BB 02Academic and research departments Nature Inspired Computing and Engineering Research Group, Distributed and Networked Systems Group, Centre for Mathematical and Computational Biology, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyRoman received his Bachelor's and Master's Degree in Computational Science and Engineering from ETH Zuerich, Switzerland. Afterwards, he did his doctoral studies at the Institute for Neuroinformatics (INI) at ETH Zürich and University of Zürich, working on simulations of cortical development. He then joined Newcastle University in September 2013 as a postdoctoral research associate and afterwards started his MRC fellowship project in September 2016 as an independent principal investigator. In June 2018 he took up an EPSRC UKRI Innovation Fellowship at the School of Computing and a joint affiliation with the Institute of Genetic Medicine, both at Newcastle University. In August 2020 he then became a lecturer at the Department of Computer Science, University of Surrey. Expand biography University roles and responsibilities Programme Lead for Computing with Business Management (BSc Hons; Nov 2023 - Current)Previous roles 18 April 2022 - 17 April 2023 Director of Employability. I led the Employability Programme, where I managed the placements for Computer Science students. Employability 18 April 2023 - 31 October 2023 Co-director of Employability; I co-directed the Employability Programme, co-ordinating and co-managing placements of Computer Science students.News 25 NOV 2025Virtual retina could help unlock new treatments for vision loss 30 OCT 2025Brain-inspired AI could cut energy use and boost performance 10 OCT 2024Simulation mimics how the brain grows neurons, paving the way for future disease treatments 10 SEP 2024Touching Base with the Local Community 20 FEB 2024New computer model of lung tissue could herald safer radiotherapy for cancer 21 SEP 2022Dementia diagnosis could be fast-tracked using artificial intelligence 20 SEP 2021New computational platform to study biological processes 14 APR 2021Surrey develops a breakthrough new simulation platform 29 MAR 2021Born to die young: The early death of nerve cells is crucial to form healthy brains Show all articlesResearchResearch interestsRoman Bauer's research focus on the computational modelling and analysis of biological dynamics, in particular those of the brain. He devises and analyses computational and statistical models of how tissue evolves (e.d. during development, degeneration or other types of processing, e.g. cryopreservation), in order to better understand the system dynamics. These models incorporate the interaction between cellular processes and physical laws of the extracellular environment. Since such a detailed approach can be very demanding from a computational point of view, his research also involves modern computing approaches and IT-related collaboration. Expand research interests Research projects Computational modelling of cryopreservation of biological tissueWe employ innovative computational modelling to optimise cryopreservation protocols.  Computational modelling of retinal developmentWe use agent-based computational modelling and use various biological data to model the development of the retina. Neural network self-organizationWe make use of advanced computational modelling and analysis techniques to better understand and leverage how neural circuits self-organise and produce function.  AI for healthWe use AI methods to model how the brain changes during development and ageing, in health as well as in disease. To inform such modelling, we make use of various data, including retinal images, neuroimaging data and EEG data. Expand research projects Research collaborationsBioDynaMo collaboration. This is an international collaboration in Computational Biology. More information can be found at www.biodynamo.org as well as www.romanbauer.net. Expand research collaborations TeachingI teach on the BSc in Computer Science, BSc in Computing with Business Management programmes and on the MEng in Computer Science. In particular, I teach on the following modules:Advanced Algorithms (COM2031) to MEng & BSc students (FHEQ Level 7 & 5) – taught on the MEng and BSc in Computer Science.  Module topics include Algorithm Design Approaches, Network Flow Problems and others.Data Structures and Algorithms (COM1029) to year 1 undergraduate students (FHEQ Level 4) – taught on the BSc in Computer Science, MEng in Computer Science and BSc in Computing with Business Management.  Module topics include Trees, Graphs, Algorithm Efficiency and others. Expand my teaching PublicationsHighlightsCogno, N., Bauer, R. and Durante, M., 2024. Mechanistic model of radiotherapy-induced lung fibrosis using coupled 3D agent-based and Monte Carlo simulations. Communications Medicine, 4(1), p.16.Breitwieser, L., Hesam, A., Montigny, J., Vavourakis, V., Iosif, A., Jennings, J., Kaiser, M., Manca, M., Di Meglio, A. and Al-Ars, Z., Rademakers, F., Bauer, R. 2021. BioDynaMo: an agent-based simulation platform for scalable computational biology research. Bioinformatics.Bauer, R., Clowry, G.J. and Kaiser, M., 2021. Creative destruction: a basic computational model of cortical layer formation. Cerebral Cortex, 31(7), pp.3237-3253.Pegah Kassraian-Fard, Michael Pfeiffer, Roman Bauer.  A generative growth model for thalamocortical axonal branching in primary visual cortex. PLoS Computational Biology, 2020Peraza, L.R., Díaz-Parra, A., Kennion, O., Moratal, D., Taylor, J.P., Kaiser, M., Bauer, R. and Alzheimer's Disease Neuroimaging Initiative, 2019. Structural connectivity centrality changes mark the path toward Alzheimer's disease. Alzheimer's & Dementia: Diagnosis, Assessment & Disease Monitoring, 11, pp.98-107. Expand research highlights Katherine Emily Birch, Alberto Dur´an-L´opez, Daniel Bola˜nos-Martinez, Chandresh Pravin, Maria Bermudez-Edo, Roman Bauer, Suparna De (2025)Exploring Structural Brain Connectivity in Term and Preterm Infants with Explainable AI and Fuzzy Logic, In: CEUR workshop proceedings4061 CEURPreterm births have been associated with altered neurological development for neonatal infants, this has been implicated in certain neurodevelopmental conditions in later life. Advances in brain imaging methods, such as Magnetic Resonance Imaging, have allowed for the analysis of physical connectivity of brain matter in infants shortly after birth. However, commonly used methods of investigating such data rely on a brain network analysis, traditionally based on graph-theoretical approaches, which may fail to capture complex patterns involving both local and global network structures and spatial information. Furthermore, many previous studies of infant brain data rely on a priori selection of specific graph connectivity measures. We propose employing machine learning models such as logistic regression and Graph Neural Networks to provide a data-driven approach for classifying preterm and term brain networks at birth. We utilize fuzzy logic, and explainability methods including Shapley Additive Explanations to identify influential regions and connections in decision making. In our analysis, brain regions are represented as spatially embedded nodes, with edges representing strength of structural connections between areas. Using this setup, our model achieves a binary classification accuracy of 88.57%. This performance is further enhanced using a fuzzy boundary between preterm and term classes, achieving an accuracy of 96.19%. This demonstrates that the model can be assisted particularly by adding context to 'near-term' born infant cases. These analyses highlight important connections, and key nodes including deep brain structures which are broadly consistent with biological literature.Cristian Axenie, Roman Bauer, Oliver López Corona, Jeffrey West (2025)Introduction, In: Applied Antifragility in Natural Systemspp. 1-3 Springer Nature SwitzerlandDOI: 10.1007/978-3-031-90391-5_1The concept of antifragility pertains to the benefit derived from the variability inherent to a dynamical system, particularly in response to perturbations. This chapter briefly introduces the properties of antifragility in natural systems. These will serve as guidelines to detect, analyse, and model antifragile behavior in various natural systems.Cristian Axenie, Roman Bauer, Oliver López Corona, Jeffrey West (2025)Interventional Antifragility, In: Applied Antifragility in Natural Systemspp.",
  "content_length": 73896,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:17"
}