{
  "name": "Roman Garnett",
  "homepage": "https://www.cse.wustl.edu/~garnett",
  "status": "success",
  "content": "Roman Garnett About I joined the CSE faculty at Wash U in January 2015. Before arriving here, I was a postdoctoral researcher in the Knowledge Discovery and Machine Learning research group at the University of Bonn (2012–2014) and the Auton Lab at Carnegie Mellon University (2010–2012). I completed my PhD as a member of the Machine Learning Research Group at the University of Oxford in 2010, and received an AB and MSc from Washington University in St. Louis in 2004. You can find my CV here. Research Broadly, my research concerns Bayesian experimental design. I am especially interested in applications to scientific discovery, and received an NSF CAREER award to support this research. Two particular problems of focus are: active search, where we seek to locate novel members of a rare, valuable class. Active search is a model for many settings in scientific discovery, such as drug discovery. Bayesian optimization, where we seek to globally optimize an expensive objective function. Bayesian optimization has seen widespread successful use across a range of application domains across the sciences and engineering, including in machine learning itself for tuning the hyperparameters of complex models. DeepMind recently used Bayesian optimization to learn architectures as part of AlphaGo Zero. I wrote a wrote book on Bayesian optimization! It is available free to download. Publications You may find a list of my publications here, or may wish to refer to my Google Scholar profile. Working with me Thanks for your interest! Here is some advice for those seeking to work with me: Aspiring Ph.D. students: please note that the WUSTL CSE department considers all admissions collectively in a single pool. Students are initially admitted without a graduate advisor assigned. You can find application instructions here. Master's and undergraduate students at Wash U: if you are seeking to complete a master's thesis, a master's project, or an undergraduate independent study with me, I strongly suggest you take my course on Bayesian machine learning. I have successfully completed numerous projects with both undergraduate and graduate students who have taken the course, and these collaborations have led to several publications. If you wish to pursue such a project, please identify a project and a potential plan for completing it before approaching me. These projects are meant to be student led, and you will get much more out of the project if you have a personal connection to it. Undergraduate students at any institution: The CSE department has an active REU program! We are currently focusing on big data analytics, and I have been heavily involved since joining the department. Consider applying! Teaching CSE 515T – Bayesian Methods in Machine Learning: Fall 2024 Fall 2019",
  "content_length": 2794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:18"
}