{
  "name": "Roman Barták",
  "homepage": "https://ktiml.mff.cuni.cz/~bartak",
  "status": "success",
  "content": "Prof. Roman Barták: Home Prof. RNDr. Roman Barták, Ph.D. Home | Bio | Research | Teaching | Service Prof. RNDr. Roman Barták, Ph.D. Professor of Computer Science Charles University Faculty of Mathematics and Physics I am working in the area of Artificial Intelligence with particular emphasis on automated planning and scheduling, constraint satisfaction, knowledge representation, and machine learning. My research goal is to design intelligent autonomous agents (e.g. robots) that can plan their activities, do decisions, and act in real environment. I believe in a model-based approach, where agents can learn models (of environment and own capabilities) and use them to take decisions (plan activities, find what they do not know). As the models can be formally verified and validated and also presented to humans; this approach leads to trustful and reliable AI. I focus on a single agent behaviour as well as on coordination of multiple agents. The applications are in robotics, production and transportation environments, deep space and ocean missions, etc. Where to go next: Bio contains more detailed biographic information about me. Research gives more deails about my research topics, partners, projects, and publications. For those that are interested in collaboration with me and my team. Teaching is an overview of my university courses and conference tutorials. It also contains information about past students and for prospective students. Service describes my service activities such as participation in various boards and committees and organizing events. Contact: Office #206 Department of Theoretical Computer Science and Mathematical Logic Faculty of Mathematics and Physics, Charles University Malostranské nám. 2/25, 118 00 Praha 1 Czech Republic e-mail: bartak@ktiml.mff.cuni.cz tel: +420 951 554 242 fax: +420 951 554 323",
  "content_length": 1846,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:16"
}