{
  "name": "Ron Kikinis",
  "homepage": "http://www.mic.uni-bremen.de/cmt-management-team/ron-kikinis",
  "status": "success",
  "content": "Ron Kikinis | Medical Image Computing Skip to content Dr. Kikinis is is the professor of Medical Image Computing in the Department of Computer Science at the University of Bremen (FB3, Mathematics and Computer Science). He is also “Institutsleiter” of Fraunhofer MEVIS and the founding Director of the Surgical Planning Laboratory, Department of Radiology, Brigham and Women’s Hospital, Harvard Medical School, Boston, MA, and a Professor of Radiology at Harvard Medical School. Dr. Kikinis studied Medicine at the University of Zurich in Switzerland and graduated in 1982. He then trained as a resident in radiology at the University Hospital in Zurich, and as a researcher in computer vision at the ETH in Zurich, Switzerland. During the mid-80’s, Dr. Kikinis developed a scientific interest in image processing algorithms and their use for extracting relevant information from medical imaging data. Since then, this topic has matured from a fairly exotic topic to a field of science. This is due to the explosive increase of both the quantity and complexity of imaging data. Dr. Kikinis has led and has participated in research in different areas of science. His activities include technological research (segmentation, registration, visualization, high performance computing), software system development, and biomedical research in a variety of biomedical specialties. The majority of his research is interdisciplinary in nature and is conducted by multidisciplinary teams. The results of his research have been reported in a variety of peer-reviewed journal articles. He is the author and co-author of 316 peer-reviewed articles. Full Length Curriculum Vitae, 01-2018 Ron Kikinis on Medline and Google Scholar Contact Prof. Dr. Ron Kikinis, Professor für Medical Image Computing Tab Am Fallturm 1 28359 Bremen *protected email*",
  "content_length": 1833,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:28"
}