{
  "name": "Ron Weiss",
  "homepage": "https://be.mit.edu/directory/ron-weiss",
  "status": "success",
  "content": "Ron Weiss | MIT Department of Biological Engineering Ron Weiss, PhD Professor of Biological Engineering Engineering cells, building circuits The Weiss Laboratory seeks to create integrated biological systems capable of autonomously performing useful tasks, and to elucidate the design principles underlying complex phenotypes. Contact Email rweiss@mit.edu Office Phone 617.253.8966 MIT Address NE47-223 Lab Website Weiss Lab Staff Darlene Ray 617.253.3874 Teaching 20.129 20.305 20.405 Research: Cells sense their environment, process information, and continuously react to both internal and external stimuli. The construction of synthetic gene networks can help improve our understanding of such naturally existing regulatory functions within cells. Synthetic gene networks will also enable a wide range of new programmed cells applications. The Weiss lab uses computer engineering principles of abstraction, composition, and interface specifications to program cells with sensors and actuators precisely controlled by analog and digital logic circuitry. Here, recombinant DNA-binding proteins represent signals, and recombinant genes perform the computation by regulating protein expression. The group constructed synthetic gene networks that implement biochemical logic circuits in Escherichia coli fabricated using the AND, NOT, and IMPLIES logic gates. The lab has built a variety of circuits, including a transcriptional cascade whose digital behavior improves significantly with the addition of genetic components. The group has also built analog circuits that perform signal processing to detect specific chemical gradients and generate pulses in response to cell-cell communication. The integration of digital and analog circuitry is useful for controlling the behavior of individual cells and the lab has also combined these circuits with engineered cell-cell communication to coordinate the behavior of cell aggregates. Publications Areas I Research Cancer Biology Computational Systems Biology Neurobiology Synthetic Biology Tissue Engineering Biography: Professor Weiss is one of the pioneers of synthetic biology. He has been engaged in synthetic biology research since 1996 when he was a graduate student at MIT and where he helped set up a wet-lab in the Electrical Engineering and Computer Science Department. After completion of his PhD, Weiss joined the faculty at Princeton University, and recently returned to MIT to take on a tenured faculty position in the Department of Biological Engineering and the Department of Electrical Engineering and Computer Science.",
  "content_length": 2583,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:30"
}