{
  "name": "Ron Alterovitz",
  "homepage": "https://www.cs.unc.edu/~ron",
  "status": "success",
  "content": "Prof. Ron Alterovitz Ron Alterovitz, Ph.D. Lawrence Grossberg Distinguished Professor and Associate Chair for Faculty Affairs Department of Computer Science University of North Carolina at Chapel Hill Chapel Hill, NC 27599-3175 Office: 254 Fred Brooks Building Phone: 919-590-6068 E-mail: ron@cs.unc.edu Lab: Computational Robotics Research Group Ph.D., University of California, Berkeley M.S., University of California, Berkeley B.S., California Institute of Technology (Caltech) Ron Alterovitz is the Lawrence Grossberg Distinguished Professor in the Department of Computer Science at the University of North Carolina at Chapel Hill. He leads the Computational Robotics Research Group, which focuses on increasing the autonomy of robots by developing novel algorithms for robots to learn and plan their motions, with an emphasis on enabling robots to autonomously perform new, less invasive medical procedures and tasks in homes and workplaces. Prior to joining UNC-Chapel Hill in 2009, Dr. Alterovitz earned his B.S. with Honors from the California Institute of Technology (Caltech), completed his Ph.D. at the University of California, Berkeley, and conducted postdoctoral research at the UCSF Comprehensive Cancer Center and a French National Center for Scientific Research (CNRS) lab in Toulouse, France. Dr. Alterovitz is co-inventor on three patents and has received multiple best paper awards at robotics and computer-assisted medicine conferences including RSS, ICRA, IROS, and MIUA. He is the recipient of an NIH Ruth L. Kirschstein National Research Service Award, two UNC Computer Science Department Excellence in Teaching Awards, an NSF Early Career Development (CAREER) Award, and the Presidential Early Career Award for Scientists and Engineers (PECASE), the highest honor bestowed by the United States Government on science and engineering professionals in the early stages of their independent research careers. More information is available on the Computational Robotics Research Group site. Research    | Students    | Publications    | CV",
  "content_length": 2059,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:20"
}