{
  "name": "Ronald Cramer",
  "homepage": "http://homepages.cwi.nl/~cramer",
  "status": "success",
  "content": "Ronald Cramer Ronald Cramer Head of the Cryptology Group, CWI Professor, Mathematical Institute, Leiden University (INFORMAL) GROUP HOME-PAGE RISC SEMINAR Mail address: Prof. dr. Ronald Cramer CWI P.O. Box 94079 1090 GB Amsterdam, The Netherlands Email: cramer (at) cwi.nl, cramer (at) math.leidenuniv.nl Tel: +31-20-592 4166 Tel: +31-20-592 4189 (Secretary Ms. Susanne van Dam) Research Interests Cryptology: foundations, mathematical aspects, applications. Algebraic number theory and -geometry, coding theory, combinatorics, algorithms, complexity theory Some Professional Activities Editorial Board Memberships: Journal of Cryptology (2000-2016) Designs, Codes and Cryptography Journal of Mathematical Cryptology Journal of Algebra and Its Applications IEEE Transactions on Information Theory (2011-2014) Information Security and Cryptology Book Series (advisory board, Springer Verlag) Program Chair : 24th Annual IACR EUROCRYPT, 2005 11th Annual IACR PKC, 2008 9th Annual IACR TCC, 2012 General Chair : 4th Annual IACR TCC, 2007 Short CV Position: Since June 1, 2004: Head of the Cryptology Group, CWI Since June 1, 2004: Full Professor (Chair in Cryptology), Mathematical Institute, Leiden University Past affiliations: 2000-2004: Aarhus University, BRICS & Computer Science Department, Associate Professor. 1997-2000: ETH Zurich, Institute for Theoretical Computer Science, Senior Researcher. 1992-1997: CWI, Researcher. Degrees: Ph.D., University of Amsterdam (Jan. 1997), M.Sc., Leiden University (Aug. 1992). Selected Awards and Honors: 2016 ERC Advanced Grant (Since 2013) Member of the Royal Netherlands Academy of Arts and Sciences (KNAW) (Since 2013) Fellow of the International Association for Cryptologic Research (IACR) 2011 Invited Speaker (keynote address), 30th Annual IACR EUROCRYPT 2006 NWO VICI Laureate 2005 KNAW DJA 2003 Distinguished Cryptographer Lecture Series, NTT Research, Tokio 1998 KNAW Christiaan Huygens Award",
  "content_length": 1945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:35"
}