{
  "name": "Ronald Garcia",
  "homepage": "http://www.cs.ubc.ca/~rxg",
  "status": "success",
  "content": "Ronald Garcia Ronald Garcia Professor Software Practices Lab Department of Computer Science University of British Columbia 201-2366 Main Mall Vancouver, B.C., Canada V6T 1Z4 rxg+xoxo@cs.ubc.ca Vita Contents Research Interests Teaching Students Activities Refereed Publications Technical Reports Boost Personal Research Interests I am interested in many aspects of programming language semantics, design, and implementation, including language support for library-centric and modular software development, generic and generative programming, and domain specific languages and libraries. Teaching Spring 2025: Computation, Programs, and Programming (CPSC 110) Fall 2024: Definition of Programming Languages (CPSC 311) Spring 2024: Programming Language Principles (CPSC 509) Fall 2023: Definition of Programming Languages (CPSC 311) Spring 2022: Programming Language Principles (CPSC 509) Fall 2021: Definition of Programming Languages (CPSC 311) Spring 2021: Systematic Program Design (CPSC 107) Fall 2020: Definition of Programming Languages (CPSC 311) Spring 2020: Introduction to Compiler Construction (CPSC 411) Fall 2019: Programming Language Principles (CPSC 509) Spring 2019: Introduction to Compiler Construction (CPSC 411) Fall 2018: Programming Language Principles (CPSC 509) Spring 2017: Introduction to Compiler Construction (CPSC 411) Fall 2016: Programming Language Principles (CPSC 509) Spring 2015: Introduction to Compiler Construction (CPSC 411) Fall 2015: Programming Language Principles (CPSC 509) Spring 2014: Programming Language Principles (CPSC 509) Fall 2014: Computation, Programs, and Programming (CPSC 110) Spring 2013: Programming Language Principles (CPSC 509) Fall 2013: Computation, Programs, and Programming (CPSC 110) Spring 2012: Programming Language Principles (CPSC 509) Fall 2012: Computation, Programs, and Programming (CPSC 110) Fall 2011: Programming Language Principles (CPSC 509) Students Current Students: Rui Ge (Ph.D.) Gabriela Araújo Britto (MSc.) Alumni: Stephanie Van Dyk (BSc. Combined Honours with Math) (with Steven A. Wolfman) (Google) Ruiyuan (Ronnie) Chen (BSc. Combined Honours with Math) (CalTech Ph.D.) Julia Litke (BSc. Cognitive Systems) (Vancouver College of Massage Therapy) Felipe Bañados Schwerter (MSc. @ University of Chile, co-advised with Éric Tanter) (UBC) [Thesis] Victor Barua (BSc. Combined Honours with Physics) (with Steven A. Wolfman) (BitLit) Evgeny Roubinchtein (MSc.) (MathWorks) [Thesis] Jonatan Milewski (MSc.) (Amazon) [Thesis] Cristina Teodoropol (BSc.) (Berkeley) Rui Ge (MSc.) (UBC) [Thesis] Alison M. Clark (BSc.) Khurram A. Jafery (BSc. Combined Honours with Math) (Amazon) Patience Shyu (BSc.) (alongside Gail Murphy) (Tasktop) Thiabaud Engelbrecht (BSc. Combined Honours with Math) (Google) Yuchong Pan (BSc.) (MIT Ph.D.) David Ewert (BSc.) (UBC MSc.) Liam Coyle (BSc. Honours) Joey Eremondi (PhD.) (Isaac Newton Fellow @ University of Edinburgh -> Assistant Professor @ University of Regina) Nico Ritschel (PhD.) (with Reid Holmes) (Postdoc @ University of Illinois, Urbana Champaign) Felipe Bañados Schwerter (PhD.) (Postdoc @ University of Alberta) Kiana Rashidi (BSc. Honours) Recent Activities PLDI 2024: Symposium on Programming Language Design and Implementation (Area Chair). June 2024. POPL 2024: Symposium on Principles of Programming Languages (PC Member). January 2024. POPL 2022: Symposium on Principles of Programming Languages (PC Member). January 2022. ICFP 2021: International Conference on Functional Programming (Program Chair). August 2021. ICFP 2020: International Conference on Functional Programming (ERC Member & Deputy Program Chair). August 2020. WGT 2020: Workshop on Gradual Typing (PC Member). 2019. PLDI 2020: ACM SIGPLAN Conference on Programming Language Design and Implementation (ERC Member). 2020. SPLASH 2019: Systems, Programming, Languages and Applications: Software for Humanity (PC Member). 2019. TFP 2019: Symposium on Trends in Functional Programming (General Co-Chair). June 12-14, 2018. ICFP 2018: \"Gradual Typing\". Invited Keynote: [Slides] [Video] SCHEME 2018: Scheme and Functional Programming Workshop (PC Member). September 28, 2018. APLAS 2017: Asian Symposium on Programming Languages and Systems (Invited Speaker). November 27-29, 2017. DSLDI 2017: Domain-Specific Language Design and Implementation (Invited Speaker). October 22, 2017. SPLASH 2017: Systems, Programming, Languages and Applications: Software for Humanity (Publicity Co-Chair). October 22-27, 2017. PWLConf 2017: \"What Type of Thing is a Type?\" Second Papers We Love Conf. (Invited Speaker). September 28, 2017. [Video] PLMW 2017: Programming Languages Mentoring Workshop at ICFP. (Invited Speaker). September 3, 2017. OPLSS 2017: Oregon Programming Languages Summer School (Lecturer: Gradual Typing). June 26-July 8, 2017. ICFP 2017: International Conference on Functional Programming (PC Member). January 2017. POPL 2017: Symposium on Principles of Programming Languages (PC Member). January 2017. Refereed Publications Training Industrial End-user programmers with Interactive Tutorials [Preprint] Nico Ritschel, Anand Ashok Sawant, David Weintrop, Reid Holmes, Alberto Bacchelli, Ronald Garcia, Chandrika K R, Avijit Mandal, Patrick Francis, David C. Shepherd Nico Ritschel, Vladimir Kovalenko, Reid Holmes, Ronald Garcia, David C. Shepherd Software: Practice and Experience (SPE), 53 (3), 729-747. 2023. Can guided decomposition help end-users write larger block-based programs? a mobile robot experiment Nico Ritschel, Felipe Fronchetti, Reid Holmes, Ronald Garcia, David C. Shepherd Proceedings of the ACM on Programming Languages, Volume 6, Issue OOPSLA, October 2022, Article No.: 133, pp 233-258 Propositional Equality for Gradual Dependently Typed Programming [Preprint] Joseph Eremondi, Ronald Garcia, Éric Tanter Proceedings of the ACM on Programming Languages, Volume 6, Issue ICFP, August 2022, Article No.: 96, pp 165-193 Abstracting gradual typing moving forward: precise and space-efficient [Tech Report] [Video] Felipe Bañados Schwerter, Alison M. Clark, Khurram A. Jafery, Ronald Garcia Proceedings of the ACM on Programming Languages, Volume 5, Issue POPL, January 2021, Article No.: 61, pp 1-28 Comparing Block-based Programming Models for Two-armed Robots. [Preprint] [Supplementary Data] Nico Ritschel, Vladimir Kovalenko, Reid Holmes, Ronald Garcia, David C. Shepherd IEEE Transactions on Software Engineering (TSE), 48 (5), 1630-1643. 2020. Gradual Typing as if Types Mattered Ronald Garcia, Éric Tanter WGT '20: The First ACM SIGPLAN Workshop on Gradual Typing. Approximate Normalization for Gradual Dependent Types [Video] Joseph Eremondi, Ronald Garcia, Éric Tanter Proceedings of the ACM on Programming Languages, Volume 3, Issue ICFP, July 2019, Article No.: 88, pp 1-30 Novice-friendly Multi-armed Robotics Programming Nico Ritschel, Reid Holmes, Ronald Garcia, David C. Shepherd RoSE '19: Proceedings of the 2nd International Workshop on Robotics Software Engineering, May 2019, pp 29-32 Refining Semantics for Multi-Stage Programming Rui Ge, Ronald Garcia. Journal of Computer Languages. 51 (1), 222-240. April 2019. Type-Driven Gradual Security with References [Tech Report] [POPL 2019 Talk] Matías Toro, Ronald Garcia, Éric TanterACM Transactions on Programming Languages and Systems (TOPLAS), 40 (4), 1-55. 2018 Gradual typing is typically understood as a way to incrementally transform untyped programs to statically-typed ones. But this perspective is too limiting: all programming languages are to some extent untyped, in the sense that many desirable program properties cannot be expressed in, or enforced by, their type systems. This paper interrogates this phenomenon in the context of type systems for information-flow security. It develops a gradually-typed language where the \"dynamic\" language is untyped with respect to security properties, and the \"static\" language uses types to express and enforce information-flow security properties. The main technical innovation of this paper over prior gradual security languages is a notion of gradual security typing that is driven solely by the type structure of programs: all reasoning about information-flow security comes from the type system, even though the language mixes static and dynamic enforcement. A programmer can read type signatures and ascriptions as security guarantees and predict security behaviour without consulting the code itself. The key conceptual observation of this paper is that sophisticated typing guarantees more more of the gradual type system than syntactic type safety. To achieve type-driven gradual security typing, the paper develops a semantic typing judgment that directly characterizes the security properties that each type can ascribe to code fragments, and proves that the syntactic typing judgment is sound with respect to it. Refining semantics for multi-stage programming [GPCE Talk] Rui Ge, Ronald GarciaGPCE 2017 Proceedings of the 16th ACM SIGPLAN International Conference on Generative Programming: Concepts and Experiences, 2017 Multi-stage programming enhances a programming language with principled support for constructing and evaluating code at run-time. A variety of semantices for multi-stage languages appear in the literature, each suited to varied forms of reasoning, including interpretation, compilation, and translation. This paper develops and proves correct the first environment-passing abstract machine for arbitrary homogeneous multi-stage programming. This style of semantics is particularly well-suited to the development of abstract interpretation-based static analyses [Van Horn and Might 2011]. Gradual Type-and-Effect Systems Felipe Bañados Schwerter, Ronald Garcia, and Éric Tanter. Journal of Functional Programming, Volume 26. January, 2016 Type-and-effect systems provide stronger reasoning principles than classic type systems, especially when the programming language in question supports effectful computation. But there is",
  "content_length": 26733,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:37"
}