{
  "name": "Ronald de Haan",
  "homepage": "https://staff.science.uva.nl/r.dehaan",
  "status": "success",
  "content": "Ronald de Haan , . , In: , , , , :, . mypdf (Not so) news I have created a (hopefully fun) game for students to practice their ASP skills. Students (e.g., in the MSc Logic or MSc AI programs at the UvA) can consider these research projects. Check out these 2-player Sudoku puzzles that I made (using ASP)! I wrote an interactive explainer on how SAT solving works using the example of Sudoku puzzles. About me I'm assistant professor at the Institute for Logic, Language and Computation (ILLC) at the University of Amsterdam. My research interests include the application of methods from theoretical computer science—in particular methods from (parameterized) complexity theory—to problems in artificial intelligence (AI), knowledge representation & reasoning (KRR), and computational logic. Generally, I'm fascinated by all things related to computational complexity—e.g., parameterized complexity theory, the Polynomial Hierarchy (PH), subexponential-time complexity, the Exponential Time Hypothesis (ETH), and (parameterized) compilability. I wrote my PhD thesis—titled \"Parameterized Complexity in the Polynomial Hierarchy\"—at the Algorithms and Complexity Group at the Faculty of Informatics of the Technische Universität Wien. I received my PhD in 2016. My PhD thesis was awarded the E.W. Beth Dissertation Prize 2017, was shortlisted for the Heinz Zemanek Prize 2018, and was nominated for the GI-Dissertationspreis 2016 of the German Informatics Society. I have an Erdős number of 3. Bio Since December 2019: assistant professor at the Institute for Logic, Language & Computation (ILLC) at the University of Amsterdam. 2017–2019: postdoctoral researcher at the Institute for Logic, Language & Computation (ILLC) at the University of Amsterdam. 2012–2017: PhD student and research assistant at the Algorithms and Complexity Group at the Technische Universität Wien, under supervision of Stefan Szeider. Graduated in 2016. 2010–2012: Studied Computational Logic (MSc) in the European Master's Program in Computational Logic (EMCL), at the Technische Universität Dresden, the Free University of Bozen-Bolzano, and the Technische Universität Wien. 2007–2010: Studied Cognitive Artificial Intelligence (BSc) and Linguistics (BA) at Utrecht University. 1988: Born in Hengelo, the Netherlands. Publications Most of my publications are also listed at the DBLP Computer Science Bibliography. Academic Service PC Member of ESSLLI 2026, the 37th European Summer School in Logic, Language and Information. AC of AAAI 2026, the 40th AAAI Conference on Artificial Intelligence. PC Member of KR 2025, the 22nd International Conference on Principles of Knowledge Representation and Reasoning. PC Member of PRIMA 2025, the 26th International Conference on Principles and Practice of Multi-Agent Systems. PC Member of ECAI 2025, the 28th European Conference on Artificial Intelligence. PC Member of UAI 2025, the 41st Conference on Uncertainty in Artificial Intelligence. PC Member of COMSOC 2025, the 10th International Workshop on Computational Social Choice. PC Member of IJCAI 2025, the 34th International Joint Conference on Artificial Intelligence. PC Member of AAMAS 2025, the 24th International Conference on Autonomous Agents and Multiagent Systems. AC of AAAI 2025, the 39th AAAI Conference on Artificial Intelligence. PC Member of PRIMA 2024, the 25th International Conference on Principles and Practice of Multi-Agent Systems. PC Member of ADT 2024, the 8th International Conference on Algorithmic Decision Theory. PC Member of KR 2024, the 21st International Conference on Principles of Knowledge Representation and Reasoning. PC Member of UAI 2024, the 40th Conference on Uncertainty in Artificial Intelligence. PC Member of ECAI 2024, the 27th European Conference on Artificial Intelligence. PC Member of IJCAI 2024, the 33rd International Joint Conference on Artificial Intelligence. PC Member of AAMAS 2024, the 23rd International Conference on Autonomous Agents and Multiagent Systems. AC of AAAI 2024, the 38th AAAI Conference on Artificial Intelligence. PC Member of UAI 2023, the 39th Conference on Uncertainty in Artificial Intelligence. PCB Member of IJCAI 2023, the 32nd International Joint Conference on Artificial Intelligence. PC Member of ECAI 2023, the 26th European Conference on Artificial Intelligence. PC Member of COMSOC 2023, the 9th International Workshop on Computational Social Choice. PC Member of KR 2023, the 20th International Conference on Principles of Knowledge Representation and Reasoning. PC Member of AAMAS 2023, the 22nd International Conference on Autonomous Agents and Multiagent Systems. PC Member of AAAI 2023, the 37th AAAI Conference on Artificial Intelligence. PC Member of PRIMA 2022, the 24th International Conference on Principles and Practice of Multi-Agent Systems. PC Member of KR 2022, the 19th International Conference on Principles of Knowledge Representation and Reasoning. PCB Member of IJCAI 2022, the 31st International Joint Conference on Artificial Intelligence. PC Member of AAMAS 2022, the 21st International Conference on Autonomous Agents and Multiagent Systems. SPC Member of AAAI 2022, the 36th AAAI Conference on Artificial Intelligence. PC Member of KR 2021, the 18th International Conference on Principles of Knowledge Representation and Reasoning. PC Member of EUMAS 2021, the 18th European Conference on Multiagent Systems. SPC Member of IJCAI 2021, the 30th International Joint Conference on Artificial Intelligence. PC Member of AAMAS 2021, the 20th International Conference on Autonomous Agents and Multiagent Systems. SPC Member of AAAI 2021, the 35th AAAI Conference on Artificial Intelligence. PC Member of KR 2020, the 17th International Conference on Principles of Knowledge Representation and Reasoning. PC Member of IJCAI-PRICAI 2020, the 29th International Joint Conference on Artificial Intelligence and the 17th Pacific Rim International Conference on Artificial Intelligence. PC Member of COMSOC 2020, the 8th International Workshop on Computational Social Choice. PC Member of AAMAS 2020, the 19th International Conference on Autonomous Agents and Multiagent Systems. PC Member of ECAI 2020, the 24th European Conference on Artificial Intelligence. SPC Member of AAAI 2020, the 34th AAAI Conference on Artificial Intelligence. PC Member of IJCAI 2019, the 28th International Joint Conference on Artificial Intelligence. PC Member of AAMAS 2019, the 18th International Conference on Autonomous Agents and Multiagent Systems. PC Member of AAAI 2019, the 33rd AAAI Conference on Artificial Intelligence. PC Member of EUMAS 2018, the 16th European Conference on Multi-Agent Systems. PC Member of COMSOC 2018, the 7th International Workshop on Computational Social Choice. PC Member of IJCAI-ECAI 2018, the 27th International Joint Conference on Artificial Intelligence and the 23rd European Conference on Artificial Intelligence. PC Member of AAMAS 2018, the 17th International Conference on Autonomous Agents and Multiagent Systems. PC Member of AAAI 2018, the 32th AAAI Conference on Artificial Intelligence. PC Member of IJCAI 2017, the 26th International Joint Conference on Artificial Intelligence. PC Member of IJCAI 2016, the 25th International Joint Conference on Artificial Intelligence. Co-organizer of PhDs in Logic VII. Chair of ESSLLI 2014 StuS, the Student Session at ESSLLI 2014, the 26th European Summer School in Logic, Language and Information. Co-chair of ESSLLI 2013 StuS, the Student Session at ESSLLI 2013, the 25th European Summer School in Logic, Language and Information. Reviewing for conferences including AAAI 2013, SAT 2013, COCOON 2014, ECAI 2014, ISAIM 2014, SAT 2014, IJCAI 2015, SAT 2015, CCC 2016, ESA 2016, AAMAS 2017, EC 2017, FOCS 2017, IPEC 2017, SAT 2017, SAT 2018, WINE 2018, MFCS 2019, STACS 2019, TARK 2019, SAGT 2020, DaLí 2020, CP 2020, FSTTCS 2022, and journals including ACM Transactions on Economics and Computation; ACM Transactions on Computation Theory; ACM Transactions on Computational Logic; Algorithmica; Algorithms; Artificial Intelligence (AIJ); Autonomous Agents and Multi-Agent Systems; Fundamenta Informaticae; Information Processing Letters; Artificial Intelligence Research (JAIR); Journal of Computer and System Sciences (JCSS); Journal of Logic, Language and Information; Journal of Logic and Computation; Journal of Universal Computer Science; and Theoretical Computer Science. Teaching Recursion Theory, MSc Logic, University of Amsterdam, September–October 2025. Knowledge Representation and Reasoning, MSc Artificial Intelligence, University of Amsterdam, September–October 2025. Meta Complexity (project course), MSc Logic, University of Amsterdam, June 2025 Recursion Theory, MSc Logic, University of Amsterdam, April–May 2025. Computational Complexity, MSc Logic, University of Amsterdam, April–May 2025. Knowledge Representation and Reasoning, MSc Artificial Intelligence, University of Amsterdam, September–October 2024. Probabilistic Logic Programming (project course), MSc Logic, University of Amsterdam, June 2024 Computational Complexity, MSc Logic, University of Amsterdam, April–May 2024. Knowledge Representation and Reasoning, MSc Artificial Intelligence, University of Amsterdam, February–March 2024. Meta Complexity (project course), MSc Logic, University of Amsterdam, January 2024 Computational Complexity, MSc Logic, University of Amsterdam, April–May 2023. Knowledge Representation and Reasoning, MSc Artificial Intelligence, University of Amsterdam, February–March 2023. Knowledge Representation and Reasoning, MSc Artificial Intelligence, University of Amsterdam, February–March 2022. Parameterized Complexity Theory and its Applications to Social Choice (project course), MSc Logic, University of Amsterdam, June 2021 Knowledge Representation and Reasoning, MSc Artificial Intelligence, University of Amsterdam, June 2021. Computational Complexity, MSc Logic, University of Amsterdam, February–March 2021. Symbolic Systems 1, M",
  "content_length": 10875,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:43"
}