{
  "name": "Ronald F. DeMara",
  "homepage": "http://cal.ucf.edu",
  "status": "success",
  "content": "Computer Architecture Laboratory Skip to main content L3Harris Engineering Center- Room 242 Director Pegasus Professor of ECE, Fellow of IEEE and AAAS CV  Bio IEEE IEMtronics 2020 Keynote Research Projects Recent Publications 12 Jun 2024: Our paper titled “Educational Tool-spaces for Convolutional Neural Network FPGA Design Space Exploration Using High-Level Synthesis,” has been accepted in the Proceedings of the Great Lakes Symposium on VLSI 2024 (GLSVLSI ’24) 3 Apr 2024: Our paper titled “Sensitivity Analysis of SOT-MTJs to Manufacturing Process Variation: A Hardware Security Perspective,” has been accepted in the Proceedings of 25th International Symposium on Quality Electronic Design (ISQED) 26 Mar 2024: Our paper titled “Strength-based Approaches to Build Community in Online Learning,” has been accepted in the Proceedings of Society for Information Technology and Teacher Education Annual Conference (SITE 2024) 11 Mar 2024: Our paper titled “Instructor-Facing Graphical User Interface for Micro-Credential Designation and Refinement in STEM Curricula,” has been accepted in Proceedings of 2024 ASEE-SE Annual Meeting (ASEE-2024), Marietta, GA, USA, March 11, 2024. 15 Dec 2023: Our paper titled “A Genetic Algorithm for Combinational Logic Circuit Synthesis Using Directed Graph Primitives,” has been accepted in the Proceedings of 2023 International Conference on Machine Learning and Applications (ICMLA) 5 Jun 2023: Our paper titled “Algorithm and hardware codesign co-optimization framework for LSTM accelerator using quantized fully decomposed tensor train,” has been accepted to Internet of Things. 1 Jun 2023: Our paper titled “Exploring the Student-to-Faculty Ratio and Degree Attainment in Florida” has been accepted at Journal of Hispanic Higher Education. 13 Mar 2023: Our paper titled “Energy-/Area-Efficient Spintronic ANN-based Digit Recognition via Progressive Modular Redundancy”, was accepted in Proceedings of IEEE International Symposium of Circuits and Systems (ISCAS-2023) , Monterey, CA, USA, May 21 – 25, 2023. 3 Mar 2023: Our paper titled “Image Quantization Tradeoffs in a YOLO-based FPGA Accelerator Framework”, has been accepted in IEEE International Symposium on Quality Electronic Design (ISQED). 30 Jan 2023: Our paper titled “Quantitative Impacts and Student Perceptions of Offering MultiAttempt Lockdown Assessment in Two Engineering Core Courses: Dynamics and Thermodynamics,” has been accepted in American Society for Engineering Education (ASEE-SE-2023). 28 Jan 2023: Our paper titled “Transfer Student Higher Success with Multiple- Attempt Testing in Engineering Dynamics,” has been accepted in Proceedings of American Society for Engineering Education (ASEE-SE-2023). 15 Jan 2023: Our paper titled “Developing a Culturally Relevant Instructional Approach Self-efficacy Scale” has been accepted in Proceedings of Society for Information Technology & Teacher Education (SITE) International Conference of the Association for the Advancement of Computing in Education (AACE). 25 Oct 2022: Our paper titled “Personalizing Digitized Assessments and Remediation using an Automated Micro-Credentialing Framework,” has been accepted to Online Learning Consortium (OLC) 2022 Conference on Accelerating Online Learning Worldwide. 25 Sep 2022: Our paper titled “Scalable Reasoning and Sensing using Processing-in-Memory with Hybrid Spin/CMOS-based Analog/Digital Blocks,” has been accepted to IEEE Transactions on Emerging Topics in Computing (TETC): Thematic Section on Memory-centric Designs: Processing-in-Memory, In-memory Computing, and Near-memory Computing for Real World Applications. 2 Sep 2022: Our paper titled “Hardware Oriented Strip-wise Optimization (HOSO) Framework for Efficient Deep Neural Network,” has been accepted to 2022 IEEE 35th International System-on-Chip Conference (SOCC). 14 Sep 2022: Our book chapter titled “MRAM-Based FPGA: A Survey,” submitted to the book under the working title “Field-Programmable Gate Arrays,” has been accepted for publication at Intechopen. 24 August 2022: Our paper “Energy-Efficient Recurrent Neural Network with MRAM-based Probabilistic Activation Functions” accepted to IEEE Transactions on Emerging Topics in Computing (TETC). 19 August 2022: Our paper “Utilization of Data Augmentation Techniques to Enhance Learning with Sparse Datasets” accepted to IEEE Conference on AI for Industry (AI4I). 16 July 2022: Our paper “Non-uniform Compressive Sensing via Ohmic Voltage Attenuation: A Memristive Crossbar Design Approach Leveraging Intrinsic Computation,” accepted in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD). 20 July 2022: Our paper “Personalizing Digitized Assessments and Remediation using an Automated Micro-Credentialing Framework for Canvas LMS” accepted to OLC Accelerate 2022 Conference on Accelerating Online Learning Worldwide. Advancement and Congratulations 1 December 2024: Professor DeMara elected Fellow of the Institute of Electrical and Electronics Engineers (IEEE) with citation “For contributions to run-time reconfigurable computing and resilient datapath design.” 11 Dec 2023: Professor DeMara presenting keynote seminar at IEEE International Symposium on Smart Electronic Systems (IEEE – iSES), December, 2023. 4 Dec 2023: Congratulations to Richard Yarnell for passing Ph.D. Candidacy. 3 Aug 2023: Congratulations to Mousam Hossain for being awarded Provost GTA Award in ECE Dept. UCF for Computer Organization course. 15 April 2023: Congratulations to Paul Amoruso for passing M.S. thesis defense. 4 April 2023: Congratulations to Adrian Tatulian for passing Ph. D. dissertation defense. 31 January 2023: Professor DeMara elected Fellow of the American Association for the Advancement of Science (AAAS) with citation “For outstanding contributions in computer systems design and architecture with emphasis on emerging computing devices for machine learning, adaptive and reconfigurable hardware, and digitization of STEM education.” 18 November 2022: Congratulations to Harshavardhana Reddy Thummala for passing M.S. thesis defense. 12 September 2022: Congratulations to 2022 Ph.D. graduate Hossein Pormeidani for starting work as Senior GPU Performance Engineer, at Samsung Electronics. 15 August 2022: Congratulations to 2020 Ph.D. graduate Soheil Salehi for commencing Assistant Professor of ECE at University of Arizona 12 July 2022:  Professor DeMara serving as General Co-Chair of ACM/IEEE GLSVLSI-2023 12 July 2022: Congratulations to Shadi Sheikhfaal for full-time employment at MixComm as a Digital Designer. 30 June 2022: Congratulations to Soheil Salehi for full-time employment at University of Arizona as Assistant Professor of ECE.",
  "content_length": 6717,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:36"
}