{
  "name": "Rongxin Wu",
  "homepage": "https://wurongxin1987.github.io/wurongxin.xmu.edu.cn",
  "status": "success",
  "content": "Rongxin Wu's Homepage Rongxin Wu's Homepage Department of Computer Science and Technology School of Informatics Xiamen University Email: wurongxin@xmu.edu.cn Office: Room 101, Building 3, School of Informatics, Xiang'an Campus, Xiamen University I am currently an associate professor in the department of computer science and technology at Xiamen University. My research interests include software security, program analysis, and software engineering. Education The Hong Kong University of Science and Technology Sep. 2013 -- July. 2017 Ph.D. Degree in Computer Science and Engineering Tsinghua University Sep. 2009 -- July. 2012 Master Degree in Software Engineering Northeastern University Sep. 2005 -- July. 2009 Bachelor Degree in Software Engineering Publications Conference Publications(# first author; * corresponding author) \"DLBENCH: A Comprehensive Benchmark for SQL Translation with Large Language Models\". Li Lin, Hongqiao Chen, Qinglin Zhu, Liehang Chen, Linlong Tang, Rongxin Wu*. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025). November 2025. \"Protecting Source Code Privacy When Hunting Memory Bugs\". Jielun Wu, Bing Shui, Hongcheng Fan, Shengxin Wu, Rongxin Wu, Yang Feng, Baowen Xu, Qingkai Shi. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025). November 2025. \"TailTracer: Continuous Tail Tracing for Production Use\". Tianyi Liu, Yi Li, Yiyu Zhang, Zhuangda Wang, Rongxin Wu, Xuandong Li, Zhiqiang Zuo. In Proceedings of the ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA 2025). October 2025. \"QTRAN: Extending Metamorphic-Oracle based Logical Bug Detection Techniques for Multiple-DBMS Dialect Support\". Li Lin, Qinglin Zhu, Hongqiao Chen, Zhuangda Wang, Rongxin Wu*, Xiaoheng Xie. In Proceedings of the 34th ACM ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2025). June 2025. \"SQLess: Dialect-Agnostic SQL Query Simplification\". Li Lin, Zongyin Hao, Chengpeng Wang, Zhuangda Wang, Rongxin Wu*, Gang Fan. In Proceedings of the 33rd ACM ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2024). Sep 2024. \"DAInfer: Inferring API Aliasing Specifications from Library Documentation via Neurosymbolic Optimization\". Chengpeng Wang, Jipeng Zhang, Rongxin Wu*, Charles Zhang. In Proceedings of the 32nd ACM International Conference on the Foundations of Software Engineering (FSE 2024). July 2024. \"Falcon: A Fused Approach to Path-Sensitive Data Dependence Analysis\". Peisen Yao, Jinguo Zhou, Xiao Xiao, Qingkai Shi, Rongxin Wu, Charles Zhang. In Proceedings of 45th ACM SIGPLAN International Conference on Programming Language Design and Implementation (PLDI 2024). June 2024. \"LibAlchemy: A Two-Layer Persistent Summary Design for Taming Third-Party Libraries in Static Bug-Finding Systems\". Rongxin Wu#, Yuxuan He, Jiafeng Huang, Chengpeng Wang, Wensheng Tang, Qingkai Shi, Xiao Xiao and Charles Zhang. In Proceedings of the 46th International Conference on Software Engineering (ICSE 2024). April 2024. \"DCLink: Bridging Data Constraint Changes and Implementations in FinTech Systems\". Wensheng Tang#, Chengpeng Wang#, Peisen Yao, Rongxin Wu*, Xianjin Fu, Gang Fan, and Charles Zhang. In Proceedings of the 38th IEEE/ACM International Conference on Automated Software Engineering (ASE 2023). Sep 2023. \"Demystifying Template-based Invariant Generation for Bit-Vector Programs\". Peisen Yao, Jingyu Ke, Jiahui Sun, Hongfei Fu, Rongxin Wu, and Kui Ren. In Proceedings of the 38th IEEE/ACM International Conference on Automated Software Engineering (ASE 2023). Sep 2023. \"Pinolo: Detecting Logical Bugs in Database Management Systems with Approximate Query Synthesis\". Zongyin Hao, Quanfeng Huang, Chengpeng Wang, Jianfeng Wang, Rongxin Wu*, and Charles Zhang. In 2023 USENIX Annual Technical Conference (ATC 2023). Jul 2023. \" Improving Java Deserialization Gadget Chain Mining via Overriding-Guided Object Generation\". Sicong Cao, Xiaobing Sun, Xiaoxue Wu, Lili Bo, Bin Li, Rongxin Wu, Wei Liu, Biao He, Yu Ouyang and Jiajia Li. In Proceedings of the 45th IEEE/ACM International Conference on Software Engineering (ICSE 2023). May 2023. \"Detecting JVM JIT Compiler Bugs via Exploring Two-Dimensional Input Spaces\". Haoxiang Jia, Ming Wen, Zifan Xie, Xiaochen Guo, Rongxin Wu, Maolin Sun, Kang Chen, and Hai Jin. In Proceedings of the 45th IEEE/ACM International Conference on Software Engineering (ICSE 2023). May 2023. \"Accelerating Build Dependency Error Detection via Virtual Build\". Rongxin Wu#, Minglei Chen, Chengpeng Wang*, Gang Fan, Jiguang Qiu, and Charles Zhang. In Proceedings of the 37th IEEE/ACM International Conference on Automated Software Engineering (ASE 2022). Oct 2022. \"SmartPip: A Smart Approach to Resolving Python Dependency Conflict Issues\". Chao Wang, Rongxin Wu*, Haohao Song, Jiwu Shu and Guoqing Li. In Proceedings of the 37th IEEE/ACM International Conference on Automated Software Engineering (ASE 2022). Oct 2022. \"MVD: Memory-related Vulnerability Detection Based on Flow-Sensitive Graph Neural Networks\". Sicong Cao, Xiaobing Sun, Lili Bo, Rongxin Wu, and Bin Li. In Proceedings of the 44th International Conference on Software Engineering (ICSE 2022). Pittsburgh, USA, May 2022. \"BEACON : Directed Grey-Box Fuzzing with Provable Path Pruning\". Heqing Huang, Yiyuan Guo, Qingkai Shi, Peisen Yao, Rongxin Wu, and Charles Zhang. In Proceedings of the 43rd IEEE Symposium on Security and Privacy (S&P 2022). May 2022. \"Transcode: Detecting Status Code Mapping Errors in Large-Scale Systems\". Wensheng Tang, Yikun Hu, Gang Fan, Peisen Yao, Rongxin Wu, Guangyuan Bai, Pengcheng Wang, and Charles Zhang. In Proceedings of the 36th IEEE/ACM International Conference on Automated Software Engineering (ASE 2021). Melbourne, Australia, Nov 2021. \"Targeting Requirements Violations of Autonomous Driving Systems by Dynamic Evolutionary Search\". Yixing Luo, Xiaoyi Zhang, Paolo Arcaini, Zhi Jin, Haiyan Zhao, Fuyuki Ishikawa, Rongxin Wu, and Tao Xie. In Proceedings of the 36th IEEE/ACM International Conference on Automated Software Engineering (ASE 2021). Melbourne, Australia, Nov 2021. \"Skeletal Approximation Enumeration for SMT Solver Testing\". Peisen Yao, Heqing Huang*, Wensheng Tang, Qingkai Shi, Rongxin Wu, and Charles Zhang. In Proceedings of the 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2021). Athens, Greece, Aug 2021. \"Fuzzing SMT Solvers via Two-Dimensional Input Space Exploration\". Peisen Yao, Heqing Huang, Wensheng Tang, Qingkai Shi, Rongxin Wu*, and Charles Zhang. In Proceedings of the 30th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2021). Aarhus, Denmark, July 2021. \"Path-Sensitive Sparse Analysis without Path Conditions\". Qingkai Shi, Peisen Yao*, Rongxin Wu* and Charles Zhang. In Proceedings of the 42nd ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2021). Virtual conference, June 2021. \"Escaping Dependency Hell: Finding Build Dependency Errors with the Unified Dependency Graph\". Gang Fan, Chengpeng Wang, Rongxin Wu*, Qingkai Shi and Charles Zhang. In Proceedings of the 29th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2020). Los Angeles, USA, July 2020. \"Pangolin: Incremental Hybrid Fuzzing with Polyhedral Path Abstraction\". Heqing Huang, Peisen Yao, Rongxin Wu, Qingkai Shi and Charles Zhang. In Proceedings of the 41st IEEE Symposium on Security and Privacy (S&P 2020). Hyatt Regency, San Francisco, CA, USA, May 2020 \"Conquering the Extensional Scalability Problem for Value-Flow Analysis Frameworks\". Qingkai Shi, Rongxin Wu*, Gang Fan and Charles Zhang. In Proceedings of the 42nd International Conference on Software Engineering (ICSE 2020). Seoul, South Korea, May 2020 \"Exploring and Exploiting the Correlations between Bug-Inducing and Bug-Fixing Commits\". Ming Wen, Rongxin Wu*, Yepang Liu, Yongqiang Tian, Xuan Xie, Shing-Chi Cheung and Zhendong Su. In Proceedings of The ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering 2019 (ESEC/FSE 2019). Tallinn, Estonia, August 2019 \"SMOKE: Scalable Path-Sensitive Memory Leak Detection for Millions of Lines of Code\". Gang Fan, Rongxin Wu*, Qingkai Shi, Xiao Xiao, Jinguo Zhou and Charles Zhang. In Proceedings of the 41st International Conference on Software Engineering (ICSE 2019). Montréal, QC, Canada. May 2019.(ACM SIGSOFT Distinguished Paper Award Winner) \"Could I Have a Stack Trace to Examine the Dependency Conflict Issue?\". Ying Wang, Ming Wen, Rongxin Wu*, Zhenwei Liu, Shin Hwei Tan, Zhiliang Zhu, Hai Yu and Shing-Chi Cheung*. In Proceedings of the 41st International Conference on Software Engineering (ICSE 2019). Montréal, QC, Canada. May 2019. \"Exposing Library API Misuses via Mutation Analysis\". Ming Wen, Yepang Liu, Rongxin Wu, Xuan Xie, Shing-Chi Cheung and Zhendong Su. In Proceedings of the 41st International Conference on Software Engineering (ICSE 2019). Montréal, QC, Canada. May 2019. \"Do the Dependency Conflicts in My Project Matter?\". Ying Wang, Ming Wen, Zhenwei Liu, Rongxin Wu, Rui Wang, Bo Yang, Hai Yu, Zhiliang Zhu and Shing-Chi Cheung. In Proceedings of ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2018), Lake Buena Vista, Florida, United States. Nov 2018. \"Pinpoint: Fast and Precise Sparse Value Flow Analysis for Million Lines of Code\". Qingkai Shi, Xiao Xiao, Rongxin Wu, Jinguo Zhou, Gang Fan, and Charles Zhang. In Proceedings of the 39th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2018), Philadelphia, Pennsylvania, United States. June 2018. \"Context-Aware Patch Generation for Better Automated Program Repair\". Ming Wen, Junjie Chen, Rongxin Wu, Dan ",
  "content_length": 17673,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:46"
}