{
  "name": "Rong Qu",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/rong.qu",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Rong QuProfessor of Computer Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom C71 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/arong.qu@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~rxq Expertise SummaryReal world applications: Transport Logistic Scheduling, Vehicle Routing Cyber Security for Connected and Autonomous Vehicles (CAVs) Personnel Scheduling, Portfolio Optimization, Multicast Network Routing (Network Coding), Timetabling Algorithms / techniques: Automated Algorithm Design; Hyper-heuristics; Evolutionary Algorithms; Meta-heuristics Machine Learning supported Evolutionary Algorithms Constraint Programming; Integer Programming, Case Based Reasoning Teaching Summary* Introduction to Artificial Intelligence * Selected Topics in Artificial Intelligence * Constraint Logic Programming * Artificial Intelligence Methods * Decision Support MethodologiesResearch SummaryReal world applications: Transport Logistic Scheduling, Vehicle Routing Cyber Security for Connected and Autonomous Vehicles (CAVs) Personnel Scheduling, Portfolio Optimization, Multicast Network Routing (Network Coding), Timetabling Algorithms / techniques: Hyper-heuristics; Evolutionary Algorithms; Meta-heuristics Constraint Programming; Integer Programming, Case Based Reasoning Selected Publications QU, R, BURKE, E.K, MCCOLLUM, B, MERLOT, L.T.G. and LEE, S.Y., 2009. A Survey of Search Methodologies and Automated System Development for Examination Timetabling Journal of Scheduling. 12(1), 55-89QU, R., BURKE, E.K. and MCCOLLUM, B., 2009. Adaptive automated construction of hybrid heuristics for exam timetabling and graph colouring problems European Journal of Operational Research. 198(2), 392-404QU, R. and BURKE, E.K., 2009. Hybridisations within a graph-based hyper-heuristic framework for university timetabling problems Journal of the Operational Research Society. 60, 1273-1285BURKE, E.K., CURTOIS, T.E., POST, G., QU, R. and VELTMAN, B., 2008. A hybrid heuristic ordering and variable neighbourhood search for the nurse rostering problem European Journal of Operational Research. 188(2), 330-341 View all publications Past ResearchArtificial Intelligence methods (i.e. heuristics, meta-heuristics and hyper-heuristics) integrated with machine learning for real world scheduling and optimization problems.Future ResearchModeling and fundamentals of evolutionary algorithms towards automated algorithm design for optimisaiton problems. CASTILLO-SALAZAR, J. ARTURO, LANDA-SILVA, DARIO and QU, RONG, 2016. Workforce Scheduling and Routing Problems Literature Survey and Computational Study Annals of Operations Research. 239(1), 39-67KENDALL, G., BAI, R., BLAZEWICZ, J., CAUSMAECKER, P. D., GENDREAU, M., JOHN, R., LI, J., MCCOLLUM, B., PESCH, E., QU, R., SABAR, N., BERGHE, G. V. and YEE, A. S. V., 2016. Good Laboratory practice for Optimisation Research Journal of Operational Research Society. 66(11), 1-14Z. WANG, H. XING, T. LI, Y.YANG, R. QU, AND Y. PAN, 2016. A Modified Ant Colony Optimization Algorithm for Network Coding Resource Minimization IEEE Transactions on Evolutionary Computation. (In Press.)J. ARTURO CASTILLO-SALAZAR, D. LANDA-SILVA, R. QU, 2016. Workforce scheduling and routing problems: literature survey and computational study Annals of Operations Research. (In Press.)BINHUI CHEN, RONG QU, RUIBIN BAI AND HISAO ISHIBUCHI, 2016. A Variable Neighbourhood Search Algorithm with Compound Neighbourhoods for VRPTW: 2016 International Conference on Operations Research and Enterprise Systems (ICORES'16) In: 2016 International Conference on Operations Research and Enterprise Systems (ICORES'16). YAN JIN, RONG QU, JASON ATKIN, 2016. Constrained Portfolio Optimisation: the state-of-the-art Markowitz Models In: 2016 International Conference on Operations Research and Enterprise Systems (ICORES'16). F. HE, 2016. Hybridising Local Search with Branch-and-Bound for Cnonstrained Portfolio Selection Problems In: The 30th EUROPEAN Conference on Modelling and Simulation (ECMS'16). RL PINHEIRO, D LANDA-SILVA, R. QU and E YANAGA, 2016. Towards an Efficient API for Optimisation Problems Data Avoiding the Drawback of Relying on Built-in Garbage Collectors In: The 18th International Conference on Enterprise Information Systems (ICEIS'16). 2016. Domain Transformation in Nurse Scheduling In: National Innovation and Invention Competition Through Exhibition 2015 (iCompEx'15). HUANLAI XING, YING XU, RONG QU, LEXI XU, 2016. A PBIL for Load Balancing in Network Coding Based Multicasting In: 16th International on Conference Computational Science and Its Applications. LNCS 9787. 34-44SABAR, N. R., M. AYOB, KENDALL, G. and QU, R., 2015. A Dynamic Multi-Armed Bandit-Gene Expression Programming Hyper-Heuristic for Combinatorial Optimization Problems IEEE Transactions on Cybernetics. 45(2), 217 - 228N. R. SABAR, M. AYOB, G. KENDALL and R. QU, 2015. The Automatic Design of Hyper-heuristic Framework with Gene Expression Programming for Combinatorial Optimization problems IEEE Transactions on Evolutionary Computation. 19(3), 309 - 325J. LI, R. BAI, Y. SHEN and R. QU, 2015. Search with Evolutionary Ruin and Stochastic Rebuild: a Theoretic Framework and a Case Study on Exam Timetabling European Journal of Operational Research. 242(3), 798-806R. QU, N. PHAM, R. BAI and G. KENDALL, 2015. Hybridising Heuristics within an Estimation Distribution Algorithm for Examination Timetabling Applied Intelligence. 42(4), 679-693Y. WANG, L. SUN, R. QU, G. LI, 2015. Price and Service Competition with Maintenance Service Bundling Journal of Systems Science and Systems Engineering. 24(2), 168-189Z. WANG, H. XING, T. LI, Y. YANG, R. QU, 2015. An Improved MOEA/D for QoS Oriented Multimedia Multicasting with Network Coding In: 8th International Conference on Mobile Multimedia Communications (MOBIMEDIA 2015). T. CUI, R. BAI, A.J. PARKES, F. HE, R. QU, J. LI, 2015. A Hybrid Genetic Algorithm for a Two-Stage Stochastic Portfolio Optimization With Uncertain Asset Prices In: The 2015 IEEE Congress on Evolutionary Computation (CEC'2015). F. HE R. QU, AND R. JOHN, 2015. A Compromise Based Fuzzy Goal Programming Approach for Multi-objective Portfolio Optimisation In: 29th European Conference on Modelling and Simulation (ECMS 2015). E.K. BURKE, R. QU and A. SOGHIER, 2014. Adaptive Selection of Heuristics for Improving Exam Timetables Annals of OR. 218(1), 129-145P. BRUCKER and R. QU, 2014. Network Flow Models for Intraday Personnel Scheduling Problems Annals of OR. 218(1), 107-114H. XING, R. QU, G. KENDALL and R. BAI, 2014. A Path-Oriented Encoding Evolutionary Algorithm for Network Coding Resource Minimization Journal of the Operational Research Society. 65, 1261–1277XING, H., QU, R., L BAI and Y JI, 2014. On Minimizing Coding Operations in Network Coding Based Multicast: An Evolutionary Algorithm Applied Intelligence. 41(3), 820-836K. LWIN, R. QU and G. KENDALL, 2014. A learning-guided Multi-objective Evolutionary Algorithm for Constrained Portfolio Optimization Applied Soft Computing. 757–772F. HE and R. QU, 2014. A Two-Stage Stochastic Mixed-Integer Program Modelling and Hybrid Solution Approach to Portfolio Selection Problems Information Sciences. 190-205YAN JIN, RONG QU and JASON ATKIN, 2014. A Population-based Incremental Learning Method for Constrained Portfolio Optimisation In: 16th International Symposium on Symbolic and Numeric Algorithms for Scientific Computing (SYNASC 2014). EDWARD KENT, JASON ATKIN and RONG QU, 2014. Vehicle Routing in a Forestry Commissioning Operation Using Ant Colony Optimisation Lecture Notes in Computer Science: Theory and Practice of Natural Computing. 8890, 95-106E.K. BURKE, T. CURTOIS, R. QU AND G. VANDEN BERGHE, 2013. A Time Pre-defined Variable Depth Search for Nurse Rostering INFORMS Journal on Computing. (In Press.)S.K.N. ABDUL RAHIM, A. BARGIELA, R. QU, 2013. Domain Transformation Approach to Deterministic Optimization of Examination Timetables Artificial Intelligence Research. 2(1), 122-138H. XING, R. QU, 2013. A Non-dominated Genetic Algorithm for Bi-objective Network Coding based Multicast Routing Information Sciences. 233, 36–53Y. XU, R. QU, R. LI, 2013. A Simulated Annealing based Genetic Local Search Algorithm for Multi-objective Multicast Routing Problems Annals of Operations Research. 260, 527–555M.HADWAN, M. AYOB, N.R. SABAR, R. QU, 2013. A Harmony Search Algorithm for Nurse Rostering Problems Information Sciences. 233, 126–140K. LWIN, R. QU, 2013. Hybrid Algorithm for Constrained Portfolio Selection Problem Applied Intelligence. 39(2), 251-266SABAR, N. R., AYOB, M., KENDALL, G. and QU, R., 2013. Grammatical Evolution Hyper-heuristic for Combinatorial Optimization problems IEEE Transactions on Evolutionary Computation. 17(6), 840-861BURKE, E.K., GENDREAU, M., HYDE, M., KENDALL, G., OCHOA, G., 'OZCAN, E. and QU, R., 2013. Hyper-heuristics: A survey of the state of the art Journal of the Operational Research Society. 64(12), 1695-1724SABAR, NASSER R., AYOB, MASRI, KENDALL, GRAHAM and QU, RONG, 2013. Grammatical Evolution Hyper-Heuristic for Combinatorial Optimization Problems IEEE TRANSACTIONS ON EVOLUTIONARY COMPUTATION. 17(6), 840-861BURKE, EDMUND K., CURTOIS, TIMOTHY, QU, RONG and BERGHE, GREET VANDEN, 2013. A Time Predefined Variable Depth Search for Nurse Rostering INFORMS JOURNAL ON COMPUTING. 25(3), 411-419SOGHIER, AMR and QU, RONG, 2013. Adaptive selection of heuristics for assigning time slots and rooms in exam timetables APPLIED INTELLIGENCE. 39(2), 438-450N.R. SABAR, M. ",
  "content_length": 22246,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:45"
}