{
  "name": "Rong Ge 0002",
  "homepage": "https://people.cs.clemson.edu/~rge",
  "status": "success",
  "content": "﻿ Rong Ge Rong Ge Professor CV Research People Publications Teaching Services For Prospective Students I usually recruit 1-2 new Ph.D. students to join my lab every year. Self-motivated students are strongly encouraged to contact me. News [2022/05] Congratulations Tyler! He successfully defended and will join UNC Charlotte as a tenure-track Assistant Professor. [2022/04] Congratulations to Zheng! He successfully defended and will join Hangzhou Dianzi University, China as a tenure-track Assistant Professor [2021/06] Congratulations to Thomas and Tyler! Our paper won the Best Paper Award in ICS21. Contact Office: Rm 209 McAdams Hall Email: rge AT CLEMSON DOT EDU Google Scholar Selected Recognition Best Paper Award, International Conference on Supercomputing, June 2021 Dean's Distinguished Professor, Aug. 2020 - July 2023 Winner of the IEEE TPDS Award for Editorial Excellence, 2021 NSF CAREER Awardee, 2015 Dr. Rong Ge is Professor in the School of Computing at Clemson University. Her research interest includes high performance computing, parallel and distributed systems, and performance and power analysis and modeling. Dr. Ge co-directs the Scalable Computing and Analytics Lab with Dr. Xizhou Feng. The undergoing research explores novel systems and software design to improve performance, scalability, energy efficiency, and resilience of compute- and data-intensive applications on parallel and distributed systems. Particularly, it takes an experimental systems approach that combines system prototyping, profiling, modeling, and controlling, and develops theoretical foundations and enabling technologies to scalable computing and analytics. Dr. Ge is a recipient of the NSF Faculty Early Career Development (CAREER) Award in 2015. Before joining Clemson University she worked with Marquette University. design from HTML5webtemplates.co.uk",
  "content_length": 1861,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:47"
}