{
  "name": "Roni Khardon",
  "homepage": "http://homes.sice.indiana.edu/rkhardon",
  "status": "success",
  "content": "Roni Khardon Home Research Research Group Publications Teaching Service Data/Software Contact Roni Khardon Professor Department of Computer Science Luddy School Indiana University, Bloomington Research Interests and Projects: My interests are in the areas of Machine Learning and Data Mining, Artificial Intelligence, and Efficient Algorithms and my research explores theoretical questions, empirical questions, and applications. Most recently my work has focused on problems in two broad areas: Theory, Algorithms and Applications of Graphical models and Stochastic Planning and Reinforcement Learning and their Relation to Probabilistic Inference. Please beware of phishing attempts: Multiple phishing attempts using my name have been circulating over the last few months. Typical examples inlcude fake job offers that ask you to communicate with me by text/phone or through an alternate non-IU email address - these are phishing attempts. Sophisticated variations and schemes are evolving. If you are reading this web page after seeing an odd offer it is likely a phishing attempt. Please help others by reporting these. Information about reporting phishing at IU is at: https://phishing.iu.edu/report/index.html Recent News 8/2025: Upcoming NeurIPS 2025 paper: introducing a new approach speeding up planning and model based RL in continuous environments through temporally-extended actions. Paper, code and other materials are available through the MBRL with TEA Project Page. 6/2025: COLT 2025 paper: develops new results for learnability of DNF with queries (making progress on a longstanding open problem) by developing generalized Foureir representations for arbitrary distributions. Read the short version published in COLT proceedings. Read the full version of the paper on arxiv. Watch the video of the conference presentation of this paper 2/2025 Invited talk: \"Bayesian UQ from the perspective of Risk Minimization\", at BIRS Workshop on: Uncertainty Quantification in Neural Network Models Read an overview of the talk. 2/2025: Congratuations! to Yadi Wei who has successfully defended her PhD thesis. 2/2025: New manuscript providing stability based generalization bounds for variational inference which are meaningful in practice. Read the paper on arxiv. 2/2025: Paper proposing new approach for planning in continuous time control problems by explicitly optimizing action duration. To be presented at the PRL Workshop at AAAI 2025. Read the paper here. 9/2024: Our paper on VIFO (Variational Inference on the Final-Layer Output of Neural Networks) is published in TMLR. VIFO, is a new approach for uncertainty quantification in deep neural networks. It is based on a new variational approximation which combines the simplicity of non-Bayesian approaches with uncertainty quantification given by Bayesian approaches. Read the paper in TMLR. 6/2024: RSS 2024 paper: develops an efficient constant-time online update method for sparse GP which is effective for non-stationary data, with applications for Robotic Information Gathering. Read the paper. 5/2024: Congratuations! to Weizhe Chen who has successfully defended his PhD thesis. 3/2024: Our group's collaborative work, with Chanh Kieu from Earth and Astmospheric Sciences, is being presented at the American Metrological Society, Conference on Hurricanes and Tropical Meteorology, May, 2024: Link to talk abstract 11/2023: Explainable Models via Compression of Tree Ensembles, published in the Machine Learning Journal. The ideas developed in the paper have two outcomes: extracting explainable models from ensemble methods and a flexible tool for manipulating relational data structures that can be used in other algorithms. 7/2023: Our team is the Winner of the Probabilistic Track of the International Planning Competition held as part of ICAPS 2023. See organizers' slides summarizing the results We used a variant of the DiSProD planner (IJCAI 2023 paper). Congratulations to Palash Chatterjee and Ashutosh Chapagain. 6/2023: IJRR paper : Adaptive Robotic Information Gathering via Non-Stationary Gaussian Processes. The paper develops a new kernel for modelling non-stationary phenomena, shows how this improves uncertainty quantification when used with Gaussian Processes, and how it imporves performance in Robotic Information Gathering. Read the paper on arxiv. 6/2023: New NSF Grant will support research on planning/control, uncertainty quantification in machine learning and reinforcement learning, with some applications in robotics. NSF award #2246261: RI: Small: Approximate Inference for Planning and Reinforcement Learning 5/2023: Upcoming IJCAI 2023 paper: develops DiSProD, a new planner for continuous and hybrid environments, with applications to controlling Robotic Systems. The planner works through Differentiable Symbolic Propagation of Distributions, and is a generalization of our top-performing SOGBOFA planner (that only handled discrete models). Read the paper on arxiv. Watch a 5 minute overview presentation of this paper Watch videos of field experiments showing DiSProD controlling a ground vehicle (Jackal) and Surface Vessell (Heron) on the DiSProD project page",
  "content_length": 5169,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:48"
}