{
  "name": "Roopa Vishwanathan",
  "homepage": "https://www.cs.nmsu.edu/~roopa",
  "status": "success",
  "content": "Roopa's page Roopa Vishwanathan Associate Professor Pronouns: she/her Dept. of Computer Science New Mexico State University (NMSU) 1290 Frenger Mall Las Cruces, NM 88003 Contact e-mail: roopav at nmsu.edu Location and Hours Office: Science Hall 142 Office hours for Spring'25: M/W 4:00-5:00 pm, or by appointment Teaching Spring'25: CS 478/513: Computer Security Research Interests I'm interested broadly in security, privacy, and applied cryptography. Of late, I've been investigating applied cryptography in the context of blockchain-based applications, such as secure auditing, doing blockchain rewrites, and designing access control mechanisms for blockchains. I'm currently working in the exciting area of building secure and efficient Layer-2 protocols such as payment channel networks, state channels and rollups. My past work was about secure cryptographic protocol design, such as verifiable escrow, fair exchange, attribute-based signatures, etc. I'm always looking for new students! If you're an NMSU student and are interested in security, privacy, or cryptography, please feel free to come talk to me, or drop me an email. My research has been in the past or is currently funded by the NSF, the Federal Aviation Administration (FAA), and the Dept. of Energy (DoE). Thank you to the funding agencies for their support! Students I'm fortunate to work with the following students: Current: Kartick Kolachala (PhD), Mohammed Ababneh (PhD), Matheen Basha Shaik (PhD), Manuel Mares Solano (MS) Past: Lalitha Muthu Subramanian (MS), Guruprasad Eswaraiah (MS), Douglas Nedza (BS) Selected recent publications 2025 FIRST: Frontrunning Resistant Smart Contracts Emrah Sariboz, Gaurav Panwar, Roopa Vishwanathan and Satyajayant Misra ACM AsiaCCS Transaction-level Blockchain Rewrites with Revocation and Traceability using Attribute-based Cryptosystems Gaurav Panwar, Roopa Vishwanathan and Satyajayant Misra ACM Distributed Ledger Technologies (journal) SCOOP: Cost-effective Congestion Attacks in Payment Channel Networks Mohammed Ababneh, Kartick Kolachala and Roopa Vishwanathan CoDecFin 2025 Verifiable Computation in Smartgrids using Dynamic Slicing Matheen Basha Shaik and Roopa Vishwanathan IEEE PerCom SPT-IoT 2024 Auroch: Auction-based Multipath Routing in Payment Channel Networks Mohammed Ababneh, Kartick Kolachala and Roopa Vishwanathan ACM ASIACCS 2024 (AR 19%)[pdf]. SPRITE: Secure and Private Routing in Payment Channel Networks Gaurav Panwar, Roopa Vishwanathan, George Torres and Satyajayant Misra ACM ASIACCS 2024 [pdf]. RACED: Routing in Payment Channel Networks using Distributed Hash Tables Kartick Kolachala, Mohammed Ababneh and Roopa Vishwanathan ACM ASIACCS 2024 [pdf]. SoK: Payment Channel Networks Kartick Kolachala, Mohammed Ababneh and Roopa Vishwanathan IEEE BuildSec 2024 PEPPER: Privacy Preserving Auditable and Fair Payment based Resource Discovery at the Pervasive Edge Emrah Sariboz, Reza Tourani, Roopa Vishwanathan and Satyajayant Misra ACM ASIACCS 2024 [pdf]. 2022 Private and Secure Smart Meter Billing Mohammed Ababneh, Kartick Kolachala and Roopa Vishwanathan ACM CPSS 2022[pdf]. 2021 APECS: A Distributed Access Control Framework for Pervasive Edge Computing Services Sean Dougherty, Reza Tourani, Gaurav Panwar, Roopa Vishwanathan, Satyajayant Misra and Srikathyayani Srikanteswara ACM CCS 2021 [pdf]. SoK: Money Laundering in Cryptocurrencies Kartick Kolachala, Ecem Simsek, Mohammed Ababneh and Roopa Vishwanathan ARES 2021 [pdf]. ReTRACe: Revocable and Traceable Blockchain Rewrites using Attribute-based Cryptosystems Gaurav Panwar, Roopa Vishwanathan and Satyajayant Misra ACM SACMAT 2021 [pdf]. Off-chain Execution and Verification of Computationally Intensive Smart Contracts Emrah Sariboz, Kartick Kolachala, Gaurav Panwar, Roopa Vishwanathan and Satyajayant Misra IEEE ICBC 2021 [pdf]. 2020 Balance Transfers and Bailouts in Credit Networks using Blockchains Lalitha M. Subramanian, Roopa Vishwanathan and Kartick Kolachala IEEE ICBC 2020 [pdf]. 2019 SAMPL: Scalable Auditability of Monitoring Processes using Public Ledgers Roopa Vishwanathan, Gaurav Panwar, Satyajayant Misra, and Austin Bos ACM CCS 2019 [pdf]. BlAnC: Blockchain-based Anonymous and Decentralized Credit Networks Gaurav Panwar and Satyajayant Misra and Roopa Vishwanathan ACM Conference on Data and Application Security and Privacy (CODASPY) 2019 [pdf]. Older papers About me Before I joined NMSU, I was an Assistant Professor from 2014-2017 at SUNY Polytechnic in Utica, NY. Before that I was a Postdoc in UNC Greensboro from 2011-2013, working with Steve Tate. I joined UNC Greensboro in July 2011 after completing my PhD at the University of North Texas's Department of Computer Science and Engineering in May 2011. At UNC Greensboro, I worked on this project. Downloadable source code and plugins related to the project can be found here Even before that, I received my BE in Computer Science and Engineering in 2003 from the University of Mumbai (Bombay). I was born and raised in the beautiful city of Mumbai (Bombay). Fun Links! Fun blog I used to follow in grad school (and sometimes still do!): PhD comics Sarcasm, science, math, linguistics comic: xkcd comics Top 30 CS blogs: Top 30 Computer Science Blogs Useful academic/research links Cryptology eprint archive DBLP computer science bibliography arXiv'sComputing Research Repository (CoRR)",
  "content_length": 5377,
  "method": "requests",
  "crawl_time": "2025-12-01 14:20:50"
}