{
  "name": "Rosanna Bellini",
  "homepage": "https://www.rosiebellini.com",
  "status": "success",
  "content": "- Rosanna Bellini Skip to content Assistant Professor Department of Computer Science & EngineeringTandon School of Engineering Courant Institute School of Mathematics, Computing, and Data ScienceNew York Universitycontact: ✉️ bellini [at] nyu [dot] edu I am recruiting PhD students for my research lab for the upcoming ’25-’26 admissions cycle (deadline: Dec 12th). Please read my Working Together page for more information. I am an Assistant Professor in Computer Science & Engineering at New York University across the Tandon School of Engineering and the Courant Institute School of Mathematics, Computing, and Data Science. I act as a core member of SIGCHI CARES to oversee cases in violation of ACM’s policies governing SIG activities (incl. sexual harassment, abuse, plagiarism, falsification). Previously, I had a wonderful time as a postdoctoral scholar with Associate Prof. Nicola Dell and Prof. Thomas Ristenpart at Cornell Tech (NYC) and helped to lead the Clinic to End Tech Abuse as the Director of Research. I also earned my Ph.D. in Computer Science across the pond at Newcastle University in the UK. What drives me as a researcher is to make technology safer for every individual. I combine rigorous data-driven and engaged design research techniques from the fields of Computer Security and Privacy (S&P) and Human- Computer Interaction (HCI) to:(1) Analyze abusive adversaries’ goals, skills, and attack strategies across in-person and online contexts;(2) Develop and deploy digital tools that change abusive adversaries’ patterns of behavior in community-based interventions, alongside software applications for assessment, training, and monitoring;(3) Design responsive sociotechnical interventions to help survivors of technology-based attacks to reclaim their privacy and security and improve their financial wellbeing; and,(4) Build a community of practice dedicated to safer S&P research involving at-risk users in academia and industry. To minimize harm to at-risk users, benefit academic theory, and drive real-world impact, my approach encompasses both proactive and reactive anti-abuse strategies. To proactively address technology abuse, I lead efforts to redesign consumer-facing technologies by detecting areas of misuse, and develop digital tools that intervene with abusers to prevent harmful behavior. I couple these efforts with direct, reactive security services for survivors subject to ongoing attacks, and consult with consumer-facing banking, legal, and security services to offer targeted solutions that mitigate harm. Updates [Sep 2025] Launched my latest course at NYU: Trust and Safety (!) [Jul 2025] Received a gift for an exciting partnership in stopping online harms, thanks Google! [May 2025] Secured a Google Cyber NYC Institutional Research Program grant with Prof. Sunoo Park! [May 2025] Attended CHI’25 in Japan, perhaps the most beautiful conference venue yet? [Apr 2025] Thanks for having me as a panelist on digital safety at your Tokyo office, Google.",
  "content_length": 3007,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:02"
}