{
  "name": "Rosario Giustolisi",
  "homepage": "https://pure.itu.dk/portal/en/persons/rosario-giustolisi(62db65c9-470c-472f-b039-6c4a704ef170).html",
  "status": "success",
  "content": "Rosario Giustolisi - IT-University of Copenhagen Rosario Giustolisi Associate Professor, Theoretical Computer ScienceProgramming Logic and SemanticsCenter for Information Security and Trust https://orcid.org/0000-0002-2917-9601 Emailrosgitudk 20172025 Research activity per year Personal profile KeywordsSecurity Fingerprint Dive into the research topics where Rosario Giustolisi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Coercion Keyphrases 100% Security Properties Computer Science 76% Ceremony Keyphrases 75% Security Ceremonies Keyphrases 72% Privacy-preserving Keyphrases 66% Privacy Preserving Computer Science 66% Fake Credential Computer Science 66% Threat Model Computer Science 60% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2017 2017 2018 2019 2020 2022 2023 2024 2025 2025 15 Article in proceedings 3 Book chapter 2 Journal article 1 Book 1 More 1 Editorial Research output per year Research output per year Anamorphic Voting: Ballot Freedom Against Dishonest AuthoritiesGiustolisi, R., Rakeei, M. & Lenzini, G., 2025, Financial Cryptography and Data Security. FC 2025 International Workshops - Voting. p. 266-280 15 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open AccessFile Anamorphic 100% Decryption 100% Ballot Secrecy 66% Decryption Key 33% Voting Intention 33% Surtr: Transparent Verification with Simple yet Strong Coercion MitigationGiustolisi, R., Garjan, M. S. & Roenne, P., 2025, E-Vote-ID 2025 - Ninth International Joint Conference on Electronic Voting. Springer, 17 p. (LNCS).Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open AccessFile Coercion 100% Keying Material 100% Verification Method 33% SELENE 33% Efficient Cleansing in Coercion-Resistant VotingGiustolisi, R. & Garjan, M. S., 2024, Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics. Cham: Springer Nature Switzerland, p. 72-88 17 p. (Lecture Notes in Computer Science, Vol. 15014).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Coercion 100% Security Properties 100% Fake Credential 100% Invalid 66% Electronic Voting 33% Thwarting Last-Minute Voter CoercionGiustolisi, R., Garjan, M. S. & Schuermann, C., 2024, 2024 IEEE Symposium on Security and Privacy (SP). IEEE, p. 3423-3439 17 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Last Minute 100% Fake Credential 100% Coercion 100% Cryptographic Key 50% Loki 33% Local Differential Privacy in VotingGiustolisi, R., David, B., Mortensen, V. & Pedersen, M., 2023, ITASEC 2023: The Italian Conference on CyberSecurity. CEUR Workshop ProceedingsResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile View all 22 research outputs Projects Projects per year 2021 2021 2023 1 Finished Projects per year ENUMEDS: Enabling User-Accountable Mechanisms in Decision SystemsGiustolisi, R. (PI), Schürmann, C. (CoI), Sheikhi Garjan, M. (CoI) & Ramadan Mohammed Abdalla, M. (CoI)Villum Foundation01/07/2021 → 31/07/2023Project: Research Press/Media Svindlere har udviklet tro kopier af webshops: \"Historisk\" mange falder iGiustolisi, R.30/09/20251 Media contributionPress/Media: Press / Media ITU-forsker: Østdansk mobilpendlerkort-app kan forfalskesGiustolisi, R.21/11/20171 item of Media coveragePress/Media: Press / Media Prizes Best NordSec 2017 Paper AwardGiustolisi, R. (Recipient), 2017Prize: Prizes, scholarships, distinctions",
  "content_length": 4208,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:03"
}