{
  "name": "Roshan L. Peiris",
  "homepage": "https://www.rit.edu/directory/rxpics-roshan-peiris",
  "status": "success",
  "content": "Roshan Peiris | RIT RIT Logo with Text Roshan Peiris Assistant Professor School of Information Golisano College of Computing and Information Sciences roshan.peiris@rit.edu Office Location GOL-2637 Roshan Peiris Assistant Professor School of Information Golisano College of Computing and Information Sciences Bio Roshan Peiris, an Assistant Professor at the Rochester Institute of Technology (RIT), is the Director of the AIR (Accessible and Immersive Realities) Lab. He is also an affiliated faculty at the RIT's Center for Accessibility and Inclusion Research (CAIR) and the Frameless XR Labs at the MAGIC Spell Studios. His research interests include Virtual/Augmented Reality, Haptics, Wearable Technologies, and Accessibility with a particular focus on human-computer interaction. His main research direction is \"Immersive Accessibility\" where he explores new ways of using immersive technologies such as AR, VR, and Haptics for accessibility applications and making such technologies accessible as well. Prior to joining RIT, he worked at Keio University as a Project Senior Assistant Professor with the ACCEL Embodied Media Project and was a Postdoctoral Research Fellow at the Singapore University of Technology and Design at the Augmented Human Lab. Roshan obtained his Ph.D. at the National University of Singapore and his BSc in Electrical Engineering from the University of Moratuwa. roshan.peiris@rit.edu Personal Links Personal Website ORCID Google Scholar Select Scholarship Book ChapterMilallos, Rezylle, Tae Oh, and Roshan L Peiris. \"Exploring the Effectiveness of Electrotactile Feedback for Data Visualization for Blind and Visually Impaired Users.\" Part of the book series: Lecture Notes in Computer Science. New York, NY: Springer, 2024. 413-428. Web.Bhole, Palavi V., et al. \"Exploring the Need of Assistive Technologies for People with Olfactory Disorders.\" Universal Access in Human-Computer Interaction. HCII 2024. Lecture Notes in Computer Science, vol 14696. New York, NY: Springer, 2024. 3-18. Web.Mathew, Roshan, Garreth W Tigwell, and Roshan L Peiris. \"Deaf and Hard of Hearing People’s Perspectives on Augmented Reality Interfaces for Improving the Accessibility of Smart Speakers.\" Universal Access in Human-Computer Interaction. HCII 2024. Lecture Notes in Computer Science, vol 14697. New York, NY: Springer, 2024. 334-357. Web.Kamarushi, Manisha Varma, et al. \"VibroAuth: Authentication with Haptics Based Non-visual, Rearranged Keypads to Mitigate Shoulder Surfing Attacks.\" HCII 2022: HCI for Cybersecurity, Privacy and Trust. NY, NY: Springer, 2022. 280-303. Web.Published Conference ProceedingsPataca, Caluã de Lacerda, et al. \"Caption Royale: Exploring the Design Space of Affective Captions from the Perspective of Deaf and Hard-of-Hearing Individuals.\" Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems. Ed. NA. Honolulu, Hawaii: ACM, 2024. Web.Chelladurai, Pratheep Kumar, et al. \"SoundHapticVR: Head-Based Spatial Haptic Feedback for Accessible Sounds in Virtual Reality for Deaf and Hard of Hearing Users.\" Proceedings of the 26th International ACM SIGACCESS Conference on Computers and Accessibility. Ed. NA. St. Johns, Canada: ACM, 2024. Web.Wang, Yiwen, et al. \"Haptic-Captioning: Using Audio-Haptic Interfaces to Enhance Speaker Indication in Real-Time Captions for Deaf and Hard-of-Hearing Viewers.\" Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. Ed. NA. Hamburg, Germany: n.p., 2023. Web.Pataca, Caluã de Lacerda, et al. \"Visualization of Speech Prosody and Emotion in Captions: Accessibility for Deaf and Hard-of-Hearing Users.\" Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. Ed. NA. Hamburg, Germany: n.p., 2023. Web.Keilers, Chloe, Garreth W Tigwell, and Roshan L Peiris. \"Data Visualization Accessibility for Blind and Low Vision Audiences.\" Proceedings of the International Conference on Human-Computer Interaction. Ed. NA. Copenhagen, Denmark: Springer, 2023. Web.Nwogu, Ifeoma, et al. \"AI-Driven Sign Language Interpretation for Nigerian Children at Home.\" Proceedings of the International Joint Conference on Artificial Intelligence. Ed. NA. Macao, Macao: n.p., 2023. Web.Chelladurai, Pratheep Kumar, et al. \"An Exploratory Study on the Usability and Features of Indoor Navigation Apps for the Blind and Visually Impaired.\" Proceedings of the 2nd International Conference of the ACM Greek SIGCHI Chapter. Ed. NA. Athens, Greece: ACM, 2023. Web.Geddes, Connor, et al. \"Improving Colour Patterns to Assist People with Colour Vision Deficiency.\" Proceedings of the CHI Conference on Human Factors in Computing Systems. Ed. NA. New Orleans, LA: ACM, Web.Li, Ziming, et al. \"SoundVizVR: Sound Indicators for Accessible Sounds in Virtual Reality for Deaf or Hard-of-Hearing Users.\" Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility. Ed. NA. Athens, Greece: ACM, Web.Agrawal, Chanchal and Roshan Peiris. \"I See What You’re Saying: A Literature Review of Eye Tracking Research in Communication of Deaf or Hard of Hearing Users.\" Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility. Ed. ASSETS. Online, Online: ACM, Web.RAGOZIN, KIRILL, et al. \"ThermoQuest - A Wearable Head Mounted Display to Augment Realities with Thermal Feedback.\" Proceedings of the 20th International Conference on Mobile and Ubiquitous Multimedia (MUM 2021). Ed. MUM. Online, Online: ACM, Web.Tseng, Wen-Jie, et al. \"A Skin-Stroke Display on the Eye-Ring Through Head-Mounted Displays.\" Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Ed. Joanna McGrenere and Andy Cockburn. New York, New York: ACM, 2020. Web.Shirota, Kenichiro, et al. \"Design of Altered Cognition with Reshaped Bodies.\" Proceedings of the Augmented Humans International Conference. Ed. NA. Kaiserslautern, Germany: ACM, 2020. Web.Chandra, Yurike, et al. \"Preliminary Investigation of Across-Body Vibrotactile Pattern for the Design of Affective Furniture.\" Proceedings of the IEEE Haptics Symposium (HAPTICS). Ed. NA. Washington DC, Washington DC: IEEE, 2020. Web.Tseng, Wen-Jie, et al. \"A Skin-Stroke Display on the Eye-Ring Through Head-Mounted Displays.\" Proceedings of the CHI Conference on Human Factors in Computing Systems. Ed. NA. Honolulu, Hawaii: ACM, 2020. Web.Czech, Elaine, et al. \"Discovering Narratives: Multi-sensory Approach Towards Designing with People with Dementia.\" Proceedings of the CHI Conference on Human Factors in Computing Systems - Case Studies. Ed. NA. Honolulu, Hawaii: ACM, 2020. Web.Athif, Mohamed, et al. \"Using Biosignals for Objective Measurement of Presence in Virtual Reality Environments.\" Proceedings of the IEEE Engineering in Medicine & Biology Society (EMBC). Ed. NA. Montreal, Canada: IEEE, 2020. Web.Tigwell, Garreth W, et al. \"Student and Teacher Perspectives of Learning ASL in an Online Setting.\" Proceedings of the SIGACCESS Conference on Computers and Accessibility. Ed. NA. Lisbon, Portugal: ACM, 2020. Web.Shen, Lichao, et al. \"Visuomotor Influence of Attached Robotic Neck Augmentation.\" Proceedings of the Symposium on Spatial User Interaction. Ed. NA. Ottawa, Canada: ACM, 2020. Web.Soucy, Nicholas, et al. \"THED: A Wrist-Worn Thermal Display to Perceive Spatial Thermal Sensations in Virtual Reality.\" Proceedings of the Future Technologies Conference. Ed. NA. Canada, Canada: Springer, 2020. Web.Shirota, Kenichiro, Roshan Lalintha Peiris, and Kouta Minamizawa. \"Altered Pinna: Exploring Shape Change of Pinna for Perception and Illusion of Sound Direction Change.\" Proceedings of the International Symposium on Wearable Computing. Ed. Lucy E. Dunne, Ozan Cakmakci, and Jamie A. Ward. New York, New York: ACM, 2019. Web.Peer Reviewed/Juried Poster Presentation or Conference PaperLi, Ziming, et al. \"Exploring the Use of Large Language Model-Driven Chatbots in Virtual Reality to Train Autistic Individuals in Job Communication Skills.\" Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems. Ed. NA. Honolulu, Hawaii: ACM.Babar, Pinaki, Mike Barry, and Roshan L Peiris. \"Understanding Job Coaches’ Perspectives on Using Virtual Reality as a Job Training Tool for Training People with Intellectual Disabilities.\" Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems Extended Abstracts. Ed. NA. Hamburg, Germany: n.p..Li, Ziming, Kristen Shinohara, and Roshan L Peiris. \"Exploring the Use of the SoundVizVR Plugin with Game Developers in the Development of Sound-Accessible Virtual Reality Games.\" Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems Extended Abstracts. Ed. NA. Hamburg, Germany: n.p..Sachan, Manjul Singh and Roshan L Peiris. \"Designing Augmented Reality Based Interventions to Encourage Physical Activity During Virtual Classes.\" Proceedings of the CHI Conference on Human Factors in Computing Systems Extended Abstracts. Ed. NA. New Orleans, LA: ACM.Chao, Vanny T. and Roshan L. Peiris. \"College Students’ and Campus Counselors’ Attitudes Toward Teletherapy and Adopting Virtual Reality (Preliminary Exploration) for Campus Counseling Services.\" Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility. Ed. NA. Athens, Greece: ACM.Brooks, Jas, et al. \"Smell, Taste, and Temperature Interfaces.\" Proceedings of the CHI Conference on Human Factors in Computing Systems. Ed. CHI. Yokohama, Japan: ACM.Kurogi, Tadatoshi, et al. \"Small, Soft, Thin, Lightweight and Flexible Tactile Display Enabling to Provide Multiple Mechanical Stimuli.\" Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Ed. Madeline Balaam and Neha Kumar. New York, New York: ACM.Journal PaperBhole, Palavi V., et al. \"Haptic2FA: Haptics-Based Accessible Two-Factor Authentication for Blind and Low Vision People.\" Proceedings of the ACM on Human-Computer Interaction 8. MCHI (2024): 1-20. Web.Li, Ziming and Roshan L Peiris. \"Exploring the SoundVizVR Plugin in t",
  "content_length": 14791,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:04"
}