{
  "name": "Roshan Venkatakrishnan",
  "homepage": "https://www.cs.ucf.edu/person/roshanvenkatakrishnan",
  "status": "success",
  "content": "Roshan Venkatakrishnan Skip to main content Roshan VenkatakrishnanAssistant Professor EMAIL Office: L3Harris Engineering Center Email: roshan.venkatakrishnan@ucf.edu Phone: 407-823-3957 Biography Research Awards News BIOGRAPHY Roshan Venkatakrishnan is an assistant professor of computer science, focusing on human-centered mixed reality (XR) technologies spanning virtual, augmented and mixed reality. His research explores how people perceive, interact and behave in these immersive mediums, with interests in avatars, artificially intelligent virtual humans and agents, cybersickness, inputs, 3D user interfaces and embodied interaction.Through interdisciplinary collaborations, he designs XR systems that make virtual experiences more meaningful, intuitive and impactful. His goal? To solve real-world problems and enhance the user experience, ultimately making the promise of XR a reality. EDUCATION Ph.D. in Human-Centered Computing, Clemson University RESEARCH Human-Computer Interaction (HCI)UX in Immersive XR (VR/AR/MR) TechnologiesVirtual AgentsCybersicknessPerception and CognitionInteraction in XR AWARDS Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Honorable Mention for the Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Honorable Mention for the Best Presentation Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Orlando, 2024Best Paper Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Shanghai, 2023Honorable Mention for the Best Paper Award at IEEE Conference on Virtual Reality and 3D User Interfaces, Shanghai, 2023Best Paper Award at ACM Symposium on Applied Perception, 2022Best Presentation Award at ACM Symposium on Applied Perception, 2021Best Paper Award at ACM Symposium on Applied Perception, 2020Honorable Mention for the Best Presentation Award at ACM Symposium on Applied Perception, 2020 LATEST NEWS UCF Strengthens Investment in Computer Science With 19 New HiresRead more ➞ Skip to content",
  "content_length": 2166,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:06"
}