{
  "name": "Rossano Venturini",
  "homepage": "http://pages.di.unipi.it/rossano",
  "status": "success",
  "content": "Rossano Venturini Associate professor Dipartimento di Informatica Università di Pisa Largo Bruno Pontecorvo 3, I-56127 Pisa, Italy. Room: 361 I am an Associate Professor at the Computer Science Department, University of Pisa. I received the PhD degree from the University of Pisa, in 2010. My research interests mainly focus on designing and analyzing algorithms and data structures for large datasets with applications in Information Retrieval and Machine Learning. I love algorithms, data structures, low-level code optimizations, and Rust, often all together at the same time. Awards Best short student paper award at ECIR 2025: 47th european conference on Information Retrieval Best paper runner-up award at SIGIR 2024: 47th international ACM SIGIR conference on research & development in Information Retrieval Best paper award at SIGIR 2015: 38th international ACM SIGIR conference on research & development in Information Retrieval Best paper award at SIGIR 2014: 37th international ACM SIGIR conference on research & development in Information Retrieval Yahoo Faculty Research and Engagement Program award (FREP), 2014 Three Best Young Research (under 35) awards at the I.S.T.I. “A. Faedo” – C.N.R. (2011, 2013 e 2014) Best Italian PhD Thesis in Theoretical Computer Science of the Italian Chapter of EATCS, 2012 Patents A method to rank documents by a computer, using additive ensembles of regression trees and cache optimization, and search engine using such a method. Co-authored by D. Dato, C. Lucchese, F.M. Nardini, S. Orlando, R. Perego, N. Tonellotto. Owned by Tiscali S.p.A. System and method for string processing and searching using a compressed permuterm index. Number US 2009/0063465 A1 of 5 March 2009. Co-authored by P. Ferragina. Owned by Yahoo! Inc. U.S. Service PC co-chair (with Franco Maria Nardini and Nadia Pisanti) of the 30th edition of the International Symposium on String Processing and Information Retrieval, SPIRE 2023. PC co-chair (with Gabriele Fici and Marinella Sciortino) of the 24th edition of the International Symposium on String Processing and Information Retrieval, SPIRE 2017. Program Committees: EMNLP-CoNLL’12, CIKM’12, WSDM’13, CPM’13, CIKM’13, WSDM’14, ESA’14, PODS’15, IIR’15, SIGIR’15, SPIRE’15, AAIM’16, IIR’16, SIGIR’16, WSDM’17, WWW’17, SEA’17, SIGIR’17, IIR’17, WWW’18, SIGIR’19, SPIRE’20, SIGIR’21, ESA’21, SIGIR’22, and SIGIR’24. Best way to reach me is by e-mail.",
  "content_length": 2482,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:10"
}