{
  "name": "Routo Terada",
  "homepage": "http://www.ime.usp.br/~rt",
  "status": "success",
  "content": "Routo Terada home page Routo Terada Ph. D. University of Wisconsin-Madison, 1979 I am a Full Professor (Titular) at the Department of Computer Science Institute of Mathematics and Statistics University of São Paulo - USP São Paulo, Bra[sz]il My pictures (2002), (1997) , (1990) Currículo Lattes Professor Homenageado pelos Formandos do Curso de Ciências Moleculares - Turma 9 (agosto de 2003) Medalha Amigo da Marinha (12/12/2003) LSD - Laboratório de Segurança de Dados SBSeg2012 (Curitiba) Dionathan, Bernardo, RT, Rafael, Fábio, Ewerton, Denise Bird's eye view (satellite) IME-USP Map and directions to IME-USP Research Interests Computational Complexity Cryptography Machine Learning Teaching and students Disciplinas 2019, 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007, 2006, 2005, 2004, 2003 Publications ~2007 (pdf-file) Segurança de dados - criptografia em redes de computador, Segunda Edição (livro p/ Ed. E. Blücher, 2008) (Clique aqui p/ obter índice do livro em formato PDF) (Clique aqui p/ obter errata em PDF) Segurança de dados - criptografia em redes de computador (livro p/ Ed. E. Blücher, 2000) (Clique aqui p/ obter índice do livro em .ps) (Clique aqui p/ obter errata em pdf) Projects Mestrado Profissionalizante 2005 * MMF * CRYPTOGRAPHY Notes Notas de Aula - C (pdf file) Notas de Aula - C++ (pdf file) Programas em C: strings, arquivo/disco, struct, números pseudo-aleatórios, pilha/stack, etc. visits since 28/November/97 Inst. of Math. and Stat. Home Page (IME-USP) Some interesting cryptography web sites: IACR - Internat'l Assoc. for Cryptologic Research RSA Labs., Calif. Cryptography Research, Calif. Doug Stinson's Page, Canada Some interesting Pictures: Americas Ipê Tree 1 Ipê Tree 2 Ipê Tree 3 Fuji by Hokusai Evening by Hokusai Benkei and giant carp, by Kuniyoshi (circa 1845) Salt gatherer (Akaishi Beach), by Kuniyoshi (1891) Kabuki actor, by Kuniyoshi (circa 1840)",
  "content_length": 1926,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:11"
}