{
  "name": "Roy A. Ruddle",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/257/professor-roy-ruddle",
  "status": "success",
  "content": "Professor Roy Ruddle | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Roy Ruddle Position: Professor of Computing Areas of expertise: visualization; human-computer interaction; visual analytics; data quality; health informatics; gigapixel displays Email: R.A.Ruddle@leeds.ac.uk Phone: +44(0)113 343 1711 Location: 2.04b Sir William Henry Bragg Building Website: My Personal Site Profile I am best known for my research into novel interactive visualization techniques, ‘Powerwall’ displays, data science, data quality, virtual reality, navigation and human computer interaction. I co-founded the Leeds Institute for Data Analytics (LIDA), and and have been an Alexander von Humboldt Foundation fellow and an Alan Turing Institute fellow. Responsibilities Research technology director, Leeds Institute for Data Analytics (LIDA) Research interests For details of my work, please look at these webpages: Visualization, virtual pathology, virtual reality (VR). My current research projects are Making Visualization Scalable (MAVIS) for explaining machine learning classification models DynAIRx: AI for Dynamic prescribing optimisation and care integration in multimorbidity <h4>Research projects</h4> <p>Some research projects I'm currently working on, or have worked on, will be listed below. Our list of all <a href=\"https://eps.leeds.ac.uk/dir/research-projects\">research projects</a> allows you to view and search the full list of projects in the faculty.</p> Making Visualization Scalable (MAVIS) Student education I presently teach Information visualization (COMP3736) and Data Science (COMP5122M). In LIDA, I deliver an annual CPD workshop about Tableau, and jointly run the interdisciplinary special interest group about data visualization. Research groups and institutes Computing in Biology, Medicine and Health Computational Science and Engineering <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Projects <li><a href=\"//phd.leeds.ac.uk/project/311-the-scalability-of-data-visualization-on-high-resolution-displays\">The scalability of data visualization on high-resolution displays</a></li> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 3036,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:10"
}