{
  "name": "Ru-Xin Wang",
  "homepage": "https://ruxinwang1994.github.io",
  "status": "success",
  "content": "Ruxin Wang Search Ruxin (Daisy) Wang Assistant Professor Department of Computer Science at The University of Texas--San Antonio Biography I am a tenure-track Assistant Professor in Computer Science at the University of Texas--San Antonio. I earned my Ph.D degree in Computer Science from Southern Methodist University under the supervision of Dr. Chen Wang, and my Master’s degree in Engineering and Computer Science from Syracuse University. I lead the Cybersecurity, Privacy, and Healthcare Lab (CypherLab). My research interests include Cybersecurity and Privacy, Mobile and Ubiquitous Sensing, AR/MR, AI in Healthcare. CypherLab welcomes research intern students. Please contact me with your resume and use the subject line format: \"Intern Application + Your Name.\" Interests Cybersecurity and Privacy Mobile and Ubiquitous Sensing Augmented and Mixed Reality (AR/MR) AI in Healthcare Education Ph.D in Computer Science, 2020 - 2025 Southern Methodist University, TX, USA M.S in Computer Engineering, 2017 - 2019 Syracuse University-Syracuse, NY, USA B.S in Electronic Engineering, 2013 - 2017 Northeast Forestry University, Harbin, China News [Jul 15, 2025] Our paper \"DrinkMR: Unobtrusive Drinking Monitoring Using Off-The-Shelf Smart Glasses\" is accepted at IEEE MASS25. [Jul 15, 2025] Our paper \"Converting Your Bluetooth Headphones into Active Sensing Authenticator: a Bond-Conduction Solution\" is accepted at IEEE MASS25. [Jun 23, 2025] I successfully defended my Ph.D. dissertation, with heartfelt thanks to my committee members! [Jun 06, 2025] Two of our collaborative works have been accepted by APHA25, congrats, Gabrielle! [Mar 30, 2025] I am excited to continue my academic career at the University of Texas--San Antonio as an Assistant Professor in Fall 2025. [Nov 14, 2024] Our poster \"Unobtrusive Drinking Monitoring Using Off-The-Shelf AR Glasses\" is presented in 2024 North Texas BME Symposium at UT Southwestern Medical Center. [Jun 03, 2024] I'm excited to share that I will be working as an AI Scientist Intern at Wyze this summer! [Apr 08, 2024] I'm named among the CPS Rising Stars in 2024. [Mar 23, 2024] Our paper \"Enhancing QR Code System Security by Verifying the Scanner's Gripping Hand Biometric\" is accepted at ACM WiSec24. [Mar 01, 2024] Our paper \"Fast Detection of Handheld Phone-distracted Driving by Sensing the Driver's Hand-grip\" is accepeted for publication in the IEEE Transactions on Vehicular Technology. Publications Ruxin Wang, Long Huang, Kaitlyn Madden, and Chen Wang (2024). Enhancing QR Code System Security by Verifying the Scanner's Gripping Hand Biometric. In the Proceedings of the 17th ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec). PDF DOI Ruxin Wang, Long Huang, and Chen Wang (2023). Low-effort VR Headset User Authentication Using Head-reverberated Sounds with Replay Resistance. In the 2023 IEEE Symposium on Security and Privacy (SP). PDF Cite DOI Ruxin Wang, Kaitlyn Madden, and Chen Wang (2022). Low-effort User Authentication for Kiosk Systems based on Smartphone User's Gripping Hand Geometry. In CHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI ‘22 Extended Abstracts), 2022, New Orleans, LA, USA. PDF DOI Ruxin Wang, Long Huang, and Chen Wang (2021). Preventing Handheld Phone Distraction for Drivers by Sensing the Gripping Hand. In The 18th IEEE International Conference on Mobile Ad Hoc and Smart Systems (MASS 2021), Virtual Conference. PDF Cite DOI Ruxin Wang, Long Huang, and Chen Wang (2021). Poster: Distracted driving detection by sensing the hand gripping of the phone. In Proceedings of the 27th Annual International Conference on Mobile Computing and Networking (MobiCom’21), New Orleans, LA, USA. PDF Cite DOI Awards CPS Rising Star 2024University of Virginia Apr 2024 IEEE SP23 Travel GrantIEEE SP23 May 2023 ACM MobiCom2021 N2Women FellowshipACM MobiCom2021 N2Women Dec 2021 ACM MobiCom2021 Travel GrantACM MobiCom2021 SRC Nov 2021 Student Graduated With HonorsNortheaset Forestry University May 2017 Teaching ◦ CSC2362 Introduction to Cybersecurity and Cyber Defense Guest Lecturer & Teaching Assistant ◦ CSC4562 Mobile Security and Applied Cryptography Guest Lecturer & Teaching Assistant ◦ CSC7700 Cyber-physical Security Teaching Assistant ◦ CSC7080 Advanced Computer Architecture Teaching Assistant Experience AI Research Scientist (Intern) Wyze Jun 2024 – Aug 2024 Seattle, WA, USA Advisor: Dr.Lin Chen Software Engineer (Full-time) HSBC Bank (China) Company Limited Aug 2019 – Jul 2020 Guangzhou, China Contact ruxin.wang@utsa.edu (225)-603-8175 UTSA School of Science, 506 Dolorosa St. San Antonio, TX 78204 Cite × Copy Download",
  "content_length": 4679,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:13"
}