{
  "name": "Ruan Na",
  "homepage": "https://www.cs.sjtu.edu.cn/~naruan",
  "status": "success",
  "content": "Na Ruan Na Ruan Associate Professor, Ph.D Shanghai Jiao Tong University About Me é®å¨ï¼ä¸æµ·äº¤éå¤§å­¦è®¡ç®æºå­¦é¢å¯ææãåå£«çå¯¼å¸ï¼æè²é¨ç½ç»ä¿¡æ¯å®å ¨ç®¡çä¸æå¡å·¥ç¨ç ç©¶ä¸­å¿å¯ä¸»ä»»ãä¸­å½è®¡ç®æºå­¦ä¼ï¼CCFï¼æ°åºä¼åï¼ä¸æµ·äº¤éå¤§å­¦æ¨æä¼ç§éå¹´å­¦è ï¼ä¸»è¦ä»äºç½ç»å®å ¨ä¸æ°æ®éç§ãåºåé¾ãäººå·¥æºè½å®å ¨ç ç©¶ï¼åè¡¨Usenix SecurityãACM CCSãCVPRãASEãEsoricsãTIFSãTDSCãTMCãTONãTCç­é«æ°´å¹³è®ºæ60ä½ç¯ï¼åèå­¦æ¯ä¸è2é¡¹ï¼åä¸å½é /è¡ä¸æ å7é¡¹ï¼å¯ä¸»å¸­2é¡¹ï¼ãè·ä¸çäººå·¥æºè½å¤§ä¼WAICYOP2025éå¹´ä¼ç§è®ºææåå¥ï¼å½é å­¦æ¯ä¼è®®ISPEC2024ãBlocksys2025æä½³è®ºæå¥ãProvSec2025æä½³å­¦çè®ºæå¥ãWASA2017æä½³è®ºææåå¥ã2025å ¨å½å¤§å­¦çä¿¡æ¯å®å ¨ç«èµä¼ç§æå¯¼æå¸ãCCF&ATEC2023å ¨å½å¤§å­¦çåºåé¾å®å ¨ææ¯ä¸åæ°åºç¨ç«èµä¸ç­å¥ä¼ç§æå¯¼æå¸ãä¸»æå½å®¶éç¹ç åè¯¾é¢ãå½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®ãä¸æµ·ç§å§éç¹æ»å ³é¡¹ç®ãæè²é¨-åä¸ºäº§å­¦ç ååè²äººé¡¹ç®ãCCFè ¾è®¯ççé¸åºéç­é¡¹ç®20ä½é¡¹ãç ç©¶ææä¸å½å®¶çµç½ãèèéå¢ç­ä¼ä¸èåææ¯è½¬åï¼è·CCFææ¯åæäºç­å¥ï¼æ1ï¼ã1986å¹´çäºå®å¾½å®åºï¼2007å¹´æ¬ç§æ¯ä¸äºä¸­å½ç¿ä¸å¤§å­¦ä¿¡æ¯å·¥ç¨ä¸ä¸å¹¶ä¿éç¡å£«ï¼æ¬ç¡åè·æ ¡ä¼ç§æ¯ä¸çåä¼ç§æ¯ä¸è®¾è®¡ï¼ç¡å£«æé´å½å®¶å ¬æ´¾èµ´æ¥æ¬ä¹å·å¤§å­¦å¸ä»å¯ç å­¦ä¸å®¶æ¨±äºå¹¸ä¸æææ»è¯»åå£«ï¼è·ä¹å·å¤§å­¦åå£«Aç±»å¥å­¦éï¼æ¾³æ´²èçº³ä»å¤§å­¦åºåé¾ä¸­å¿è®¿é®å­¦è ï¼2012å¹´åå£«æ¯ä¸åå å ¥ä¸æµ·äº¤éå¤§å­¦è³ä»ã English Bio. Na Ruan received the B.E. and M. E. degree from China University of Mining&Technology, Xu Zhou, China in 2007 and 2010 respectively. She received the Dr. Eng. Degree from Kyushu University, Fukuoka, Japan in 2012. She is with Department of Computer Science and Engineering, Shanghai Jiaotong University, Shanghai, China where she is an associate professor. She was a visiting researcher in Monash University, Melbourne, Australia. Her current research interests are in AI security, blockchain and data privacy. She serves as guest editors for many IEEE journals and transactions. She has also served on the program committees for several international conferences. Office: SEIEE 3-527 800 Dongchuan Road, Minhang District Shanghai 200240, P.R. China Email: naruan@cs.sjtu.edu.cn / naruan@sjtu.edu.cn / ruannana@gmail.com I am looking for self-motivated students who are strongly committed to research. If you are interested in Security and Privacy, Blockchain and AI Security, feel free to send me your CV. Books è¿ææ, å´æ¨æ¶, æè¶ , é®å¨, éé¨äº­.ãäºè®¡ç®åçä¸å®è·µã. æºæ¢°å·¥ä¸åºçç¤¾, 400,000å­, åºçæ¶é´ 2017-03. é®å¨, é¾å®, åå«ä¸, å¼ ç£. ãä¿¡æ¯æ¶ä»£çè®¡ç®æºç§å­¦çè®ºã(Computer Science Theory for the Information Age ä¸­æç). ä¸æµ·äº¤éå¤§å­¦åºçç¤¾, 500,000 å­, ISBN 9787313111098, åºçæ¶é´ 2014-06. Papers *Corresponding author; #Students -æåè®ºæ- [è½¯ä»¶å­¦æ¥] åç«ä¼#ï¼å è¶ è±ª#ï¼å­æ³½å #ï¼å¨è#ï¼é®å¨*ï¼èæä¿ï¼æ°æ®è¦ç´ æµéå ¨æµç¨éç§å ³é®ææ¯ï¼ç°ç¶ãææä¸å±æ. è½¯ä»¶å­¦æ¥ï¼2025ï¼To-appear. Download (CCF-A) [TIFS]Junjie Hu, Huan Yan, Na Ruan*, Zhen Xiao, Jianhua Li. The Halt Game: Sometimes Rewards Cannot Cover Expenses In The PoW-Based Blockchain, IEEE Transactions on Information Forensics & Security, 2025.(CCF-A) [TIFS]Zekun Sun, Na Ruan*, Jianhua Li. DDL: Effective and Comprehensible Interpretation Framework for Diverse Deepfake Detectors, IEEE Transactions on Information Forensics & Security, 2025.(CCF-A) [TIFS]Chaohao Fu, Hongbin Chen, Na Ruan*. Privacy for Free: Spy Attack in Vertical Federated Learning by Both Active and Passive Parties, IEEE Transactions on Information Forensics & Security, 2025.(CCF-A) [TDSC] Bowen Li, Hanlin Gu, Ruoxin Chen, Jie Li, Chentao Wu, Na Ruan, Xueming Si, Lixin Fan. Temporal Gradient Inversion Attacks with Robust Optimization. IEEE Transactions on Dependable and Secure Computing, 2025. (CCF-A) [TMC] Na Ruan*, Jikun Chen, Tu Huang, Zekun Sun, Jie Li. Fool Attackers by Imperceptible Noise: A Privacy-Preserving Adversarial Representation Mechanism for Collaborative Learning. IEEE Transactions on Mobile Computing, 2024. (CCF-A) [TON] Na Ruan*, Hanyi Sun, Zenan Lou, Jie Li. A General Quantitative Analysis Framework for Attacks in Blockchain. IEEE/ACM Transactions on Networking, 2023. (CCF-A) [TOMM]Zekun Sun, Na Ruan*,GANK: Dynamic Geometric and Appearance Features for Efficient and Robust Detection of Face Forgery, ACM Transactions on Multimedia Computing Communications and Applications, 2025. (JCR-1) [TOIT] Na Ruan, Dongli Zhou, Weijia Jia, Ursa: Robust Performance for Nakamoto Consensus with Self-adaptive Throughput, ACM Transactions on Internet Technology (ACM TOIT), 2020. (JCR-1) [è®¡ç®æºå­¦æ¥] é®å¨ï¼åæ±å¿ï¼æ¯éªæï¼éç¨å·¥ä½éè¯æå ±è¯æºå¶çåºåé¾ä¸­æç¿æ»å»è é´çé²¶é±¼æåº. è®¡ç®æºå­¦æ¥, 2021å¹´ç¬¬1æã (CCF-A) -ä¼è®®è®ºæ- [USENIX Security] Zekun Sun, Zijian Liu, Shouling Ji, Chenhao Lin, Na Ruan*, Pretender: Universal Active Defense against Diffusion Finetuning Attacks, The 34th USENIX Security Symposium,Seattle,USA,August 13â15, 2025.(CCF-A) [ACM CCS] Mengyuan Li, Yan Meng, Junyi Liu, Haojin Zhu, Xiaohui Liang, Yao Liu, Na Ruan. When CSI Meets Public WiFi: Inferring Your Mobile Phone Password via WiFi Signals. ACM SIGSAC Conference on Computer and Communications Security, Vienna, Austria, 2016.(CCF-A) [CVPR] Zekun Sun, Yujie Han, Zeyu Hua, Na Ruan*, Weijia Jia, Improving the Efficiency and Robustness of Deepfakes Detection through Precise Geometric Features, IEEE Conference on Computer Vision and Pattern Recognition, 2021.(CCF-A) [ASE] Xingshuang Lin, Qinge Xie, Binbin Zhao, Yuan Tian, Saman Zonouz, Na Ruan, Jiliang Li, Raheem Beyah, and Shouling Ji, PROMFUZZ: Leveraging LLM-Driven and Bug-Oriented Composite Analysis for Detecting Functional Bugs in Smart Contracts, ASE 2025.(CCF-A) New [ESORICS] Hanyi Sun, Na Ruan*, Chunhua Su . How to Model the Bribery Attack: A Practical Quantification Method in Blockchain. European Symposium on Research in Computer Security, 2020.(CORE-A) [ICDCS] Na Ruan, Lei Gao, Haojin Zhu, Weijia Jia, Xiang Li, Qi Hu. Toward Optimal DoS-Resistant Authentication in Crowdsensing Networks via Evolutionary Game. International Conference on Distributed Computing Systems, Kyoto, Japan, 2016.(CCF-B) [ICASSP] Chaohao Fu, Weijia Jia, Na Ruan*. Client-free federated unlearning via training reconstruction with anchor subspace calibration, Seoul, Korea, 2024.(CCF-B) [ACNS] Hongbin Chen, Chaohao Fu, Na Ruan*. Steal from Collaboration: Spy Attack by a Dishonest Party in Vertical Federated Learning. 21st International Conference on Applied Cryptography and Network Securityï¼Kyotoï¼Japan, 2023.(Core Conference Rank-B) [SECON] Wenyan Yao, Na Ruan*, Feifan Yu, Weijia Jia, Haojin Zhu. Privacy-Preserving Fraud Detection via Cooperative Mobile Carriers with Improved Accuracy. Annual IEEE International Conference on Sensing, Communication, and Networking, San Diego, USA, 2017.(CCF-B) [ACM AsiaCCS] Feifan Yu, Na Ruan*, Siyuan Cheng. Rational Manager in Bitcoin Mining Pool: Dynamic Strategies to Gain Extra Rewards. The 15th ACM Asia Conference on Computer and Communications Security (accept ratio 21%, 67 in 308), 2020. >>>More>>> -æ´å¤è®ºæ- [TC] Jing Wang, Haiyong Bao, Na Ruan, Qinglei Kong, Cheng Huang, and Hong-Ning Daiï¼PRRQ: Privacy-Preserving Resilient RkNN Query over Encrypted Outsourced Multi-Attribute Dataï¼IEEE Transactions on Computers,2025. (CCF-A) New [TCC] Honglin Wu , Haiyong Bao, Menghong Guan,Na Ruan,Cheng Huang, and Hong-Ning Dai, MKAC: Efficient and Privacy-Preserving Multi-Keyword Ranked Query with Ciphertext Access Control in Cloud Environmentsï¼IEEE Transactions on Cloud Computing(TCC,JCR-1),2025 New [è®¡ç®æºå­¦æ¥] åæ±å¿#ï¼é®å¨*ï¼åºåé¾ä¸­æ»å»æ¹å¼çç ç©¶. è®¡ç®æºå­¦æ¥, 2021å¹´ç¬¬4æ. (CCF-A) [Blocksys'25]Junjie Hu, Na Ruan*ï¼BM-PAW: A Profitable Mining Attack in the PoW-based Blockchain Systemï¼International Conference on Blockchain, Artificial Intelligence, and Trustworthy Systems, Zhuhai, China, 2025. Best-paper award [ISPEC]Liwei Liu, Zijian Liu, Na Ruan*.From the Perspective of Prototypes: A Privacy-Preserving Personalized Federated Learning Framework.The 19th International Conference on Information Security Practice and Experience, 2024. (CCF-C, Best-paper award) [WASA]Mingli Wu,Na Ruan*, Shiheng Ma, Haojin Zhu, Weijia Jia, Qingshui Xue, Songyang Wu. Detect SIP Flooding Attacks in VoLTE by Utilizing and Compressing Counting Bloom Filter. International Conference on Wireless Algorithms, Systems, and Applications (CCF-C, Best Paper Runner-up Award), 2017. [ICC 2025 Workshop-DTNWN] Boyu Han, Yuanhang He, Rui Xu, Xiao Da, Jianhua Li, Na Ruan. Manipulating Digital Twin Networks by Poisoning Semantic Knowledge Base, ICC 2025 Workshop-DTNWN. [ACISP24] Zenan Lou, Na Ruan*. FXChain: a multi-consortium blockchain with flexible privacy-preserving strategies, The 29th Australasian Conference on Information Security and Privacyï¼Sydney, Australia. [IEEE GBC24] Zihan Wang, Yusen Wang, Chentian Yuan, Jiong Lou, Jie Li, Na Ruan*. Taking Attacks to the Next Level: A Framework for Front-Running Attacks on Blockchain Systems.2024 IEEE Global Blockchain Conference [PRICAI 2024] Chaohao Fu, Yun Zhou, Na Ruan*. Preserving Individual User's Right to be Forgotten in Enterprise-Level Federated Learningï¼The 21th Pacific Rim International Conference on Artificial Intelligence. [HPCC 2024] Ziye Zheng, Jiajing Wu, Dan Lin, Quanzhong Li, Na Ruan. XSema: A Novel Framework for Semantic Extraction of Cross-Chain Transactionsï¼IEEE HPCC'2024, on 13-15 December, 2024. [ProvSec 2022] Huang Juzheng, Qiang Tang, Chunhua Su, Na Ruan*. Secure Collaboration between Consort",
  "content_length": 24382,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:12"
}