{
  "name": "Ruba Abu-Salma",
  "homepage": "https://www.kcl.ac.uk/people/ruba-abu-salma",
  "status": "success",
  "content": "Ruba Abu-Salma | King's College London Skip to main contentDr Ruba Abu-Salma Deputy Head of the Cybersecurity GroupSenior Lecturer in Computer ScienceResearch interestsComputer scienceContact detailsruba.abu-salma@kcl.ac.ukBiographyRuba Abu-Salma is a Senior Lecturer (Associate Professor) in Computer Science at King’s College London, affiliated with the Cybersecurity Group and Human-Centered Computing Group in the Department of Informatics. She is also Deputy Head of the Cybersecurity Group and Co-Champion of the department’s Security Hub. Her research is interdisciplinary, sitting at the intersection of cybersecurity, privacy, human-computer interaction (HCI), emerging technologies, and public policy. She uses computational and social science methods to understand and improve people’s security, privacy, and safety decision-making processes, with a focus on at-risk populations. Her work has been published at top-tier venues, including IEEE S&P (Oakland), USENIX Security, ACM CHI, and ACM TOCHI, and has been featured in national and international media outlets such as BBC News, BBC Women’s Hour, Financial Times, The Register, Euronews, The New York Times, CNET, Science News, and Politico. Before joining King’s in 2021, Ruba was a Postdoctoral Researcher in the Usable Security and Privacy Group at the International Computer Science Institute (ICSI) at the University of California, Berkeley, and in the PRIVATICS Team at INRIA Sophia Antipolis. Ruba defended her doctoral thesis in December 2019, earning a PhD in Computer Science from University College London (UCL). Her dissertation focused on designing user-centered privacy-enhancing technologies. As a postgraduate student, she was supported by Google, a Marie-Skłodowska Curie Research Fellowship, and a Supporting Usability and Design in Security (SUDS) Fellowship from the Open Technology Fund (OTF). She also performed research at the Open Data Institute, Cambridge Cybercrime Centre, Brave, and Telefónica Research. Research interests Cybersecurity Privacy-enhancing technologies Human-computer interaction (HCI) Usable security and privacy Privacy and human rights Further information Personal website Google Scholar PublicationsResearchResearchHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Security HubThe Security Hub consolidates the research related to securityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Centre for Technology and the BodyStories of embodied technology: from the plough to the touchscreenHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Cyber Security Research GroupCSRG promotes research into cyber security bringing together experts from diverse disciplines.CybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.NewsNews07 May 2025Smart home devices used to monitor domestic workers raise safety concernsThe growing use of smart home devices is undermining the privacy and safety of domestic workers. Technology & Science13 May 2024Female health apps misuse highly sensitive data, study finds The study revealed user data could be subject to access from law enforcement or security authorities.HealthTechnology & Science08 March 2023International Women's Day 2023: Transforming technology for gender equalityIn recognition of the United Nation’s 2023 International Women’s Day theme celebrating innovation and technology for gender equality, we shine a light on some...Arts & CultureHealthBusiness & FinanceInternationalSocietyTechnology & Science07 March 2023Google funds project tackling risks of sharing personal data on female health apps Researchers from the Department of Informatics will investigate how users can protect sensitive data in platforms such as period-tracking apps. Technology & Science23 September 2022Data privacy concerns of migrant domestic workersNew research paper publishedTechnology & SciencePublicationsResearchNewsResearchHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Security HubThe Security Hub consolidates the research related to securityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Centre for Technology and the BodyStories of embodied technology: from the plough to the touchscreenHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Cyber Security Research GroupCSRG promotes research into cyber security bringing together experts from diverse disciplines.CybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.News07 May 2025Smart home devices used to monitor domestic workers raise safety concernsThe growing use of smart home devices is undermining the privacy and safety of domestic workers. Technology & Science13 May 2024Female health apps misuse highly sensitive data, study finds The study revealed user data could be subject to access from law enforcement or security authorities.HealthTechnology & Science08 March 2023International Women's Day 2023: Transforming technology for gender equalityIn recognition of the United Nation’s 2023 International Women’s Day theme celebrating innovation and technology for gender equality, we shine a light on some...Arts & CultureHealthBusiness & FinanceInternationalSocietyTechnology & Science07 March 2023Google funds project tackling risks of sharing personal data on female health apps Researchers from the Department of Informatics will investigate how users can protect sensitive data in platforms such as period-tracking apps. Technology & Science23 September 2022Data privacy concerns of migrant domestic workersNew research paper publishedTechnology & ScienceBH(N)7.18Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 6443,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:15"
}