{
  "name": "Ruben Mayer",
  "homepage": "https://ruben-mayer.com",
  "status": "success",
  "content": "Ruben Mayer Skip to content Welcome to my academic homepage! You can find all the latest news on my research and teaching on this page. My research is centered on distributed/decentralized information systems and data management. In particular, I am interested in improving the efficiency of machine learning systems. The focus areas of my team are federated learning and graph neural networks. Lately, I’ve also embarked on investigating interdisciplinary aspects of machine learning and law. News Area Chair ICDE 26 & Reviewer NeurIPS 25 14. May 2025 Associate Editor for PVLDB Volume 19 (VLDB 2026) 11. February 2025 VLDB Paper Accepted 18. November 2024 About Me I am a professor of computer science at the University of Bayreuth, heading the Chair of Data Systems since March 2023. Simultaneously, I’m also a guest professor at Technical University of Munich (TUM). Previously, I was an interim professor at TUM, leading the Chair for Data Engineering at the TUM Campus in Heilbronn. Before that, I was leading the Chair for Application and Middleware Systems at TUM as an interim professor, after working there as a post-doctoral researcher together with Prof. Hans-Arno Jacobsen. Before that, I was a postdoctoral researcher at the University of Stuttgart in the Distributed Systems research group (Prof. Kurt Rothermel), where I was also awarded my PhD. During my doctoral studies in Stuttgart, I spent some time as a guest researcher in the Embedded Pervasive Lab of Prof. Umakishore Ramachandran at the Georgia Institute of Technology, Atlanta, GA, USA. Subscribe Subscribed Ruben Mayer Sign me up Already have a WordPress.com account? Log in now. Ruben Mayer Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 1879,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:16"
}