{
  "name": "Rubing Huang",
  "homepage": "https://huangrubing.github.io",
  "status": "success",
  "content": "Rubing Huang IEEE/CCF Senior Member, Associate Professor, School of Computer Science and Engineering, Faculty of Innovation Engineering, Macau University of Science and Technology Rubing received his M.Eng. and Ph.D. degrees in Computer Science and Technology from Huazhong University of Science and Technology. After that, Dr. Rubing conducted academic visits to two prestigious Australian institutions. At Swinburne University of Technology, he collaborated with Prof. T. Y. Chen (IEEE Fellow and honoree of the 2024 ACM SIGSOFT Outstanding Research Award). He then engaged in research at Monash University under the joint mentorship of Dr. Xin Xia (ACM Distinguished Member and honoree of the 2019 ACM SIGSOFT Early Career Researcher Award) and Dr. Robert G. Merkel. Currently, he is an associate professor in the School of Computer Science and Engineering, Faculty of Innovation Engineering, Macau University of Science and Technology (MUST), Macau SAR. Before joining MUST, he was a faculty member at Jiangsu University, China. He has more than 100 publications in journals and proceedings, including ACM Transactions on Software Engineering and Methodology (ACM TOSEM), IEEE Transactions on Software Engineering (IEEE TSE), IEEE Transactions on Reliability (IEEE TR), IEEE Transactions on Emerging Topics in Computational Intelligence (IEEE TETCI), Journal of Systems and Software (JSS), Information and Software Technology (IST), Software: Practice and Experience (SPE), Science of Computer Programming (SCP), IET Software, International Journal of Software Engineering and Knowledge Engineering (IJSEKE), Engineering Applications of Artificial Intelligence (EAAI), Expert Systems with Applications (ESWA), The Computer Journal, ICSE, AAAI, ISSRE, ICST, and COMPSAC. He has served as the senior program committee member of IJCAI2025, program committee chair of ICETT2025 and CAIT2024, registration chair of APSEC2025 and Internetware2024, finance chair of SANER2023, and the program committee member of MM2025, ECAI2025, ICST2020, APSEC2023-2024, and AI Testing 2019-2021. He has served as the reviewer for many journals such as ACM TOSEM, IEEE TSE, IEEE TPAMI, IEEE TIFS, IEEE TKDE, IEEE TDSC, IEEE TSC, IEEE/ACM TON, IEEE TC, IEEE TMC, IEEE TNNLS, IEEE/ACM ASL, IEEE TCAD, ACM CSUR, ACM TKDD, IEEE TAI, IEEE TBD, ACM TWEB, IEEE TR, IEEE TFS, IEEE TNSE, IEEE TCSVT, IEEE TETCI, IEEE TEM, ACM TIOP, IEEE T-ASE, IJHCI, STVR, JSS, IST, SPE, JSEP, ASEJ, SCP, EAAI, FCS, IEEE Software, IEEE Intelligent Systems, etc. He is a senior member of the IEEE and the China Computer Federation. His current research interests include: 1) AI for Software Engineering (AI4SE), i.e., adopting AI knowledge and techniques such as Machine Learning (ML), Deep Learning (DL), and Large Language Model (LLM), to support the development of software engineering (including software requirements, testing, debugging, and maintenance); 2) Software Engineering for AI (SE4AI), i.e., applying the principles of software engineering to AI systems (such as AI systems testing, debugging, and maintenance); 3) Failure-Based Testing (FBT), i.e., taking advantage of the knowledge of software failures to support the testing process, for example, Adaptive Random Testing (ART); 4) Testing of Complex Software Systems, such as various intelligent systems, autonomous driving systems, AI compilers, cloud computing systems, and IoT systems; and 5) Software Vulnerability Analysis, such as vulnerability detection, classification, assessment, localization, and repair. AI+SE Research Lab AI+SE Research Lab, led by Rubing Huang, includes one full professor, one associate professor, four assistant professors, 23 Ph.D. students, and 30 master's students. This research lab focuses on Artificial Intelligence (AI), Software Engineering (SE), and the intersections between AI and SE, i.e., AI for SE (AI4SE) and SE for AI (SE4AI). The main research interests include: Intelligent Software Engineering (AI4SE and SE4AI), Software Testing, Debugging, and Maintenance, Trustworthy Artificial Intelligence, Computer Vision and Image Processing, and Various AI Applications. The research outputs have been published in many high-quality conferences such as ICSE, CVPR, AAAI, ACM MM, ISSRE, and ICST; and in many high-quality journals such as ACM TOSEM, IEEE TSE, IEEE TSC, IEEE TFIS, IEEE TIP, IEEE TNNLS, IEEE TAC, IEEE TCSVT, IEEE TR, IEEE TCSS, IEEE TETCI, JSS, IST, SPE, SCP, PR, and ESWA. The members of the research lab have undertaken many research projects from the National Natural Science Foundation of China (NSFC) and the Science and Technology Development Fund of Macau (FDCT), such as NSFC General Projects, NSFC Youth Projects, FDCT Research and Innovation Support Program, FDCT Science and Technology Innovation Enhancement Support Program, and FDCT General Projects. Our research Lab is looking for highly motivated Ph.D./MPhil students with strong backgrounds in Computer Science, Artificial Intelligence, Software Engineering, Computer Vision, and Programming. Undergraduate students who are interested in my research areas are also warmly welcome to join us as research assistants. Please don't hesitate to contact me by email at the bottom of this page. The basic requirements for students are listed as follows: 1) For Ph.D. candidates, when giving a research paper or a research direction, you can do the following work, i.e., Reading and understanding research papers --> Finding potential issues --> Proposing your new ideas --> Implementing your ideas --> Conducting experiments to validate your ideas --> Collecting and analyzing experimental results --> Writing a research paper to summarize your findings; 2) For MPhil candidates, if you can do Ph.D. candidates' work, it would be great; otherwise, you should at least do the following work based on a given research idea, i.e., Implementing the given idea --> Conducting experiments to validate the given idea --> Collecting and analyzing experimental results --> Writing a research report. A friendly reminder: If you do not satisfy these requirements, we can discuss with you how to do the research work; however, if you do not want to have a try, please reconsider your decision. Thank you. News [2025.11.08]. Our paper \"OAD-Promoter: Enhancing Zero-shot VQA using Large Language Models with Object Attribute Description\" has been accepted by the 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026). Congratulations to Quanxing! [2025.11.05]. Our paper \"PLMAS: Adaptive Sample Selection for Prompting LLMs in Knowledge-Based Visual Question Answering\" has been accepted by the ACM Transactions on Multimedia Computing Communications and Applications. Congratulations to Jian! [2025.10.11]. I have been invited to serve as the Program Committee Chair at the 2026 12th International Conference on Education and Training Technologies (ICETT 2026). [2025.10.06]. Our paper \"Requirements-Based Test Generation: A Comprehensive Survey\" has been accepted by the ACM Transactions on Software Engineering and Methodology. Congratulations to Zhenzhen! [2025.09.30]. Our TSE paper \"Toward Cost-effective Adaptive Random Testing: An Approximate Nearest Neighbor Approach\" has been accepted by the Journal-First Track of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025). Congratulations to Chenhui! [2025.09.30]. Our TOSEM paper \"Large Language Models for Automated Web-Form-Test Generation: An Empirical Study\" has been accepted by the Journal-First Track of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025). Congratulations to Tao! [2025.09.19]. I have been invited to serve as the Program Committee Member at the 7th ACM/IEEE International Conference on Automation of Software Test (AST 2026), co-located with the 48th International Conference on Software Engineering (ICSE 2026). [2025.09.05]. Our paper \"Adaptive Random Testing of Deep Learning Systems Using Image Hashing\" has been accepted by the IEEE Transactions on Reliability. Congratulations to Linwei! [2025.08.25]. Our paper \"Ribonucleic-Acid Protein Interaction Prediction Based on Deep Learning: A Comprehensive Survey\" has been accepted by the Applied Soft Computing Journal. Congratulations to Danyu! [2025.05.06]. Our paper \"Large Language Models for Automated Web-Form-Test Generation: An Empirical Study\" has been accepted by the ACM Transactions on Software Engineering and Methodology. Congratulations to Tao! [2025.04.26]. I have been invited to serve as the Program Committee Member at the 33rd ACM International Conference on Multimedia (MM 2025). [2025.04.23]. Our paper \"Short-Term Electricity-Load Forecasting by Deep Learning: A Comprehensive Survey\" has been accepted by the Engineering Applications of Artificial Intelligence. Congratulations to Qi! [2025.04.22]. I have been invited to serve as the Program Committee Member at the 28th European Conference on Artificial Intelligence (ECAI 2025). [2025.03.21]. I have been invited to serve as the Conference Chair at the 2025 16th International Conference on Software Engineering and Service Science (ICSESS 2025). [2025.02.16]. Our paper \"Diff-ZsVQA: Zero-shot Visual Question Answering with Frozen Large Language Models Using Diffusion Model\" has been accepted by the Expert Systems with Applications. Congratulations to Quanxing! [2025.02.07]. Our paper \"Applying Lexicographical Ordering to Software Product Line Testing\" has been accepted by the IEEE Transactions on Reliability. Congratulations to Tao! [2025.01.25]. Our paper \"An Attention-based Wide and Deep Neural Network for Reentrancy Vulnerability Detection in Smart Contracts\" has been accepted by the Journal of Systems and Software. Congratulations to Samuel! [2025.01.14]. I have been invited to serve as the Senior Program Committee Member at the 34th International Joint Conference on Artificial Intelligence (IJCAI 2025). Selected Publications (*corresponding author) Zh",
  "content_length": 18100,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:15"
}