{
  "name": "Rucha Joshi",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-rucha-joshi",
  "status": "success",
  "content": "Dr. Rucha Joshi | Associate Professor, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Rucha Joshi Rucha Joshi Associate Professor, Plaksha University PhD, Purdue University Area of Expertise: Engineering Education Tissue Engineering Drug Delivery Select About Research Awards About Rucha Joshi Dr. Rucha Joshi is an Associate Professor at Plaksha University. Formerly she was an Assistant Professor at the University of California, Davis; and a postdoctoral fellow at Purdue University, where she worked on tissue engineering as well as engineering education research, specifically on biomaterials, drug delivery and instructional innovation using active learning in biomedical engineering. Rucha received a BS in biotechnology engineering from Shivaji University, India, in 2009, and an MS in Biomedical Engineering from Vanderbilt University in 2011, a PhD in Biomedical Engineering in 2016. Rucha has two patents, on making low calorie biscuits from banana peel pulp, and second on “collagen based therapeutic delivery systems”. Her current research focuses on natural biomaterials such as silk fibroin, and collagen, and within engineering education research, she focuses on creating inclusive education for visually impaired students, gamification of STEM education, building entrepreneurial mindset in engineers, infusing metacognition within engineering curriculum, and personalizing teaching-learning processes using human-centred design thinking. Her dedication extends beyond the classroom. Dr. Joshi champions diversity through her experience with NSF grants and outreach programs, and her workshops exemplify this. She recently led sessions for educators on integrating transversal skills into teaching methodologies using the 3T play model, as well as workshops embedding critical thinking, systems thinking, perspective taking, and negotiation skills into the engineering curriculum, with practical exercises on sustainability challenges and role-playing scenarios for educators and students. She is actively working to promote inclusivity within STEM for high school children and girls. She has served as a BME Liaison for the Committee for Diversity, Equity, and Inclusion (CDEI) of the American Society for Engineering Education (ASEE) in 2021-22, and as a secretary of New Engineering Educators division of ASEE in 2019-20. From 2021-24, she was the director for Grand Challenges Scholars Program at Plaksha, creating experiential learning through a combined curricular, co-curricular, and extra-curricular program. On extra-curriculars, Rucha is a NAUI certified SCUBA diver and 2023 Punjab state badminton winner in 35+ Women category, representing Punjab in the 45th  and 46th National Badminton Veterans Championship. Her book in Marathi tells a story of her journey of representing India at Japan in class 12th, being honored by Dr. APJ Abdul Kalam, the late president of India, for her invention of “low calorie biscuits from banana peel pulp”. The book won a literary award from the State Government of Maharashtra in 2008. Her latest book on collagen based drug delivery was published by Springer in 2021. Most recently, she received the prestigious Chhabria Award for Best Woman Professional 2023 given by Hope Foundation in association with the IEEE India Council and Women In Engineering Affinity Group, solidifying her status as a role model and changemaker in engineering education. Research Dr. Joshi's current research focuses on approaching challenges in teaching engineering through the lens of design thinking. Previously, she contributed to instructional innovation in biomedical engineering at Purdue and worked on an National Science Foundation funded grant for studying the professional formation of engineers and enhancing diversity and inclusion within Purdue. She has been involved in educational entrepreneurship projects and making engineering accessible to underrepresented high school students in India and in the United States. Dr. Joshi received a BS in Biotechnology Engineering from Shivaji University, India, in 2009, and MS in Biomedical Engineering from Vanderbilt University in 2011, where she worked on creating smart microspheres responsive to temperature, pH, and Reactive Oxygen Species (ROS) for therapeutic drug delivery applications. She received her PhD in biomedical engineering from Purdue University in 2016, where she created designer collagen biografts for soft tissue biograft and drug delivery applications with Prof. Sherry Voytik-Harbin. Dr. Joshi is a passionate advocate for transforming engineering education. Her experiences at prestigious institutions like UC Davis and Purdue honed her expertise in educational research and innovation in bioengineering.Currently, her research focuses on: Natural Biomaterials for Drug Delivery: Implantable Silk-Fibroin scaffolds for chronic wound healingSF-Keratin-Collagen- based drug delivery devices for tuning heparin delivery for rapid vascularizationPoint of Care Thernostics using Pyranin embedded Silk-based biomaterials Engineering Education: Inclusive STEM education for visually impaired studentsEntrepreneurial-Minded Learning Within Engineering StudentsGamification of STEM Education for inspiring youth to pursue careers in STEMFostering Metacognition within the engineering curriculumHuman-centred Design Thinking for Education Reform Awards Dr. Joshi has received several scholarships and awards for thought leadership, entrepreneurship, and community engagement, including the Ross Fellowship for outstanding PhD applicants, and the Burton D. Morgan Fellowship for entrepreneurial students at Purdue. She was honored by Dr. APJ Abdul Kalam, the late president of India, for her invention of “low calorie biscuits from banana peel pulp” and for her STEM popularization efforts. Honors and Awards: Awarded sponsorship for visit from The Center for Learning Sciences (LEARN), École Polytechnique Fédérale de Lausanne (EPFL), Switzerland, to further collaboration with the 3T PLAY project, which focuses on using Tangibles to develop Transversal skills in students at Technical universities 2024 Teaching and Learning Award, International Conference on Transformations in Engineering Education (ICTIEE) 2024 2023 Pralhad P. Chhabria Award for Best Women Professional (Early career) by Hope Foundation, IEEE India Council and Women in Engineering Affinity Group2023 Invited member of technical committee for the international Research in Engineering Education Symposium (REES) 2024 at KLE Technological University in Hubli, India in January 20242023-24 Selected as Biomedical Engineering Division Liaison at the Committee for Diversity, Equity and Inclusion, American Society for Engineering Education (ASEE), June 2021 to June 20222021-22 Selected",
  "content_length": 12073,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:16"
}