{
  "name": "Rudra Dutta",
  "homepage": "http://dutta.csc.ncsu.edu",
  "status": "success",
  "content": "Professor Rudra Dutta, NC State Skip to content Academic Home Page I am a faculty member in the Department of Computer Science in the College of Engineering, and the Masters in Computer Networking Program; at North Carolina State University, Raleigh, North Carolina. My contact information is below. Email is the best way to get in touch. Sadly, I am not plugged into most social media. I do have a LinkedIn account ! I typically use it to connect with people I have had specific individual contact with, IRL. I do try to keep the “Recent News” page on this website a bit more frequently updated than I can for the rest of this website. Prospective Students: Before emailing me (or if you have sent mail and not received a reply), please read the Prospective Students section of my Research page, and also my post on RA, TA, Grader positions. Contact Info Email: rdutta@ncsu.edu Professional Calendar: Public link, Subscribe link Office: Room 2402-C, Engineering Building – III (EB3), Centennial Campus Mailing Address (USPS) : Department of Computer ScienceNC State UniversityCampus Box 8206Raleigh, NC 27695-8206 Shipping Address (UPS, FedEx, …) : Department of Computer ScienceNC State University890 Oval DriveRoom 3320, Engineering Building – IIRaleigh, NC 27606 Brief Bio Rudra Dutta was born in Kolkata, India, in 1968. After completing elementary schooling in Kolkata, he received a B.E. in Electrical Engineering from Jadavpur University, Kolkata, India, in 1991, a M.E. in Systems Science and Automation from Indian Institute of Science, Bangalore, India in 1993, and a Ph.D. in Computer Science from North Carolina State University, Raleigh, USA, in 2001. From 1993 to 1997 he worked for IBM as a software developer and programmer in various networking related projects. He has been employed from 2001 – 2007 as Assistant Professor, from 2007 – 2013 as Associate Professor, and since 2013 as Professor, in the department of Computer Science at the North Carolina State University, Raleigh. As of Fall, 2018, he is serving as Associate Department Head. His current research interests focus on design and performance optimization of large networking systems, Internet architecture, wireless networks, and network analytics. He is a senior member of IEEE and a distinguished member (distinguished engineer) of ACM. He is the author of more than a hundred and fifty papers, including some of the most cited papers in virtual topology design and traffic grooming in optical network design. His work has been supported by grants from the National Science Foundation, the Army Research Office, the National Security Agency, and industry, most recently including a $24M PAWR grant from NSF, for the AERPAW project that is creating a national drones/wireless testbed in an extended outdoor area. He has served as a reviewer for many premium journals, on NSF, DoE, ARO, and NSERC (Canada) review panels, as part of the organizing committee of many premium conferences, most recently as an Editor of the Annals of Telecommunications journal. He previously served on the editorial boards of the Elsevier Journal of Optical Switching and Networking, and the Springer Photonic Communication Networks journal, for several years. He is married, has two children and lives in Cary, North Carolina. His sister and her family live in Kolkata, India. Primary Sidebar SearchSearchCSC 401-001 in Fall, 2025 RA, TA, Grader Positions MSCN Advising See \"News\" page for all current and some past news posts. Scroll to the top",
  "content_length": 3509,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:21"
}