{
  "name": "Rudy Darken",
  "homepage": "http://faculty.nps.edu/vitae/cgi-bin/vita.cgi?p=display_vita&id=1023567683",
  "status": "success",
  "content": "Faculty - Naval Postgraduate School Faculty NPS - Faculty Profiles - Heading Academic Directory FacultyCV Welcome to the NPS Academic directory. Use the form below to search. Department All Academic Administration Academic Affairs Acquisition Management Applied Mathematics Center for Executive Education Center for Homeland Defense and Security Computer Science Defense Analysis Department of Defense Management Electrical and Computer Engineering Energy Academic Group Faculty Administration Financial Management Graduate Education Advancement Center Graduate School of International and Defense Studies Graduate Writing Center/Thesis Information Sciences International Programs Library Management Manpower and Economics Mechanical and Aerospace Engineering Meteorology NPS Extended Campus National Security Affairs Naval Warfare Studies Institute Oceanography Operations Research Operations and Logistics Physics President Provost Research Space Systems Academic Group Systems Engineering Undersea Warfare Academic Group Keywords Search No user records found Page 1 of 25 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 20 Items per Page 5 10 20 30 50 75 100 200 Showing 1 - 20 of 492 results. ← First Previous Next Last → Name Email Department , Defense Analysis , Applied Mathematics Acosta, David david.a.acosta@nps.edu Research Adair, Audra aeadair@nps.edu Center for Executive Education Adams, Christopher caadams@nps.edu Mechanical and Aerospace Engineering Adesanya, Kehinde kehinde.adesanya@nps.edu Computer Science Agrawal, Brij agrawal@nps.edu Mechanical and Aerospace Engineering Ahn, Sae Young sahn1@nps.edu Manpower and Economics Alanazi, Mowafiq mowafiq.alanazi@nps.edu International Programs Alderson, David dlalders@nps.edu Operations Research Allen, Bruce bdallen@nps.edu Computer Science Alley, Erick esalley@nps.edu Mechanical and Aerospace Engineering Alves, Richard richard.alves@nps.edu Electrical and Computer Engineering Amara, Jomana jhamara@nps.edu Provost Anderson, Timothy tpanders@nps.edu Systems Engineering Ansell, Troy troy.ansell@nps.edu Mechanical and Aerospace Engineering Appleget, Jeffrey jaappleg@nps.edu Operations Research Armey, Laura larmey@nps.edu Department of Defense Management Aros, Susan SKAROS@nps.edu Department of Defense Management Aten, Kathryn kjaten@nps.edu Management Page 1 of 25 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 20 Items per Page 5 10 20 30 50 75 100 200 Showing 1 - 20 of 492 results. ← First Previous Next Last →",
  "content_length": 2526,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:20"
}