{
  "name": "Rui Hu 0005",
  "homepage": "https://sites.google.com/view/ruihu/home",
  "status": "success",
  "content": "Rui (Zoey) HuSearch this siteEmbedded FilesSkip to main contentSkip to navigationRui (Zoey) HuAssistant Professor of Computer Science & EngineeringUniversity of Nevada, RenoAbout MeI am Rui (Zoey) Hu, an Assistant Professor in the Department of Computer Science & Engineering at University of Nevada, Reno. My research mainly focuses on solving the security, privacy, and efficiency issues of machine learning, federated learning, large language model, edge computing, etc..I am currently looking for highly self-motivated Ph.D. students in Fall 2026 (with assistantship) who are interested in working on multi-modal model fine-tuning, federated learning, agentic AI, reinforcement learning, efficient AI, or AI security. Please send me your CV, transcripts, TOEFL and GRE scores, and everything else that you believe will help your application if you are interested. [I will only be able to respond to applications that are of interest, given the number received.][updated-Jul. 2025] For current undergraduate and graduate students at UNR who are interested in LLM security topics such as prompt injection and would like to gain project or research experience, feel free to email me or stop by my office. If you are interested in AI security more broadly, I highly recommend taking my course, CS 791 CyberAI, which is offered during the spring semester.[Nov. 2025] Looking for undergraduate students at UNR who is interested in doing projects on building up agentic AI for robotics. Please email me with your CV!EducationPhD in Electrical Engineering, 2022The University of Texas at San Antonio (Supervisor: Dr. Yanmin Gong)BEng in Electrical Engineering, 2017Jinan University, ChinaResearch InterestsAI Security & EfficiencyFederated LearningData PrivacyAgentic AINews10/2025: Congradulations to Zikai and Jiahao on receiving travel grants from Graduate Student Association at UNR, Mobihoc 2025, and NSF EPSCoR HDRFS program!08/2025: Our project \"Research Infrastructure: MRI: Acquisition of a High-Performance GPU Cluster for Large-Scale AI\" is funded by NSF! 🎉07/2025: Our paper \"On the Out-of-Distribution Backdoor Attack for Federated Learning\" has been accepted by ACM MobiHoc 2025 (acceptance rate 23%). Congratulations, Jiahao! 🎉👏 Code will be released soon. 06/2025: Our projct \"RET Site: Research Experience on Edge Artificial Intelligence for Nevada Teachers\" is funded by NSF! Looking forward to sharing more—our project website will be live soon!06/2025: Our paper \"Fed-HeLLo: Efficient Federated Foundation Model Fine-Tuning with Heterogeneous LoRA Allocation\" is accepted by IEEE Transactions on Neural Networks and Learning Systems (IEEE TNNLS). Congradulations to Zikai! 🎉👏04/2025: Congratulations to Jiahao on receiving the CVPR 2025 Travel Award! 🎉👏02/2025: Our paper \"Detecting Backdoor Attacks in Federated Learning via Direction Alignment Inspection\" is accepted by CVPR 2025 (highlight). Congratulations to Jiahao. 🎉👏02/2025: I serve as the Associate Editor for IEEE Open Journal of the Communication Society (OJCOMS).01/2025: Jiahao's research project, \"Towards Robust Water Leak Detection via Federated Learning with Sparsified Local Models,\" has been awarded the 2024 Nevada WateReuse Research Grant. Congratulations, Jiahao! 🎉👏12/2024: Our work \"Power-Optimized Field-Programmable Gate Array Implementation of Neural Activation Functions Using Continued Fractions for AI/ML Workloads\" has been published!11/2024: Our paper \"Identify Backdoored Model in Federated Learning via Individual Unlearning\" is accepted by WACV 2025. Congratulations to Jiahao on this achievement! Code has been released!10/2024: Our work \"Fed-piLot: Optimizing LoRA Assignment for Efficient Federated Foundation Model Fine-Tuning\" is in arXiv. In this work, we optimize the local LoRA-based foundation model fine-tuning tasks for clients with heterogeneous memory resources in federated learning.08/2024: Our paper \"Achieving Byzantine-Resilient Federated Learning via Layer-Adaptive Sparsified Model Aggregation\" is accepted by WACV 2025. Congratulations, Jiahao! Code has been released!06/2024: I received the NSF EPSCoR HDRFS seed grant as a sole PI. 09/2023: Congratulations to Zikai for receiving the IEEE CNS student travel grant and UNR GSA Travel Award!08/2023: Our paper on defending against byzantine attacks in federated learning has been accepted by CNS 2023. Congratulations, Zikai!03/2023: I received the Outstanding Ph.D. Dissertation Award from UTSA!08/2022: Our paper \"Agent-Level Differentially Private Federated Learning via Compressed Model Perturbation\" was accepted by IEEE CNS 2022!05/2022: I served as a TPC member of the IEEE Consumer Communications & Networking Conference (CCNC) 2023. 05/2022: I received the Outstanding Graduate Research Award of UTSA!04/2022: I defended my Ph.D. dissertation!03/2022: I will join the CSE department, University of Nevada, Reno, as a tenure-track assistant professor in July 2022!03/2022: Our paper \"Energy-Efficient Distributed Machine Learning at Wireless Edge with Device-to-Device Communication\" was accepted by IEEE ICC 2022!02/2022: I served as a TPC member of the 19th Annual International Conference on Privacy, Security, and Trust (PST) 2022. 01/2022: Our paper \"Hybrid Local SGD for Federated Learning with Heterogeneous Communications\" was accepted by ICLR 2022 and selected for a spotlight presentation (5%). 06/2021: I served as a TPC member of IEEE Vehicular Technology Conference (VTC) 2021.04/2021: Our paper \"Federated Learning with Sparsification-Amplified Privacy and Adaptive Optimization\" was accepted by IJCAI 2021 (Acceptance ratio: 13.9%).Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5701,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:21"
}