{
  "name": "Rui Zhang 0007",
  "homepage": "https://www.eecis.udel.edu/~ruizhang",
  "status": "success",
  "content": "Rui Zhang@University of Delaware Rui Zhang Associate Professor Office: 100 S Main St, Suite 109, Rm 108 Computer and Information Sciences Department Phone: 302-831-2010 University of Delaware Fax: 302-831-8458 Newark, DE 19716 Email: I am always looking for highly self-motivated Ph.D. students who are strongly committed to research. If you are interested, please send your resume or CV, transcripts, TOEFL and GRE scores, and everything else that you believe will help your application to me in one email. Visiting scholars and students are also welcome. Biography Rui Zhang received his Ph.D. degree in Electrical Engineering from the Arizona State University in 2013. He received the B.E. degree in Communication Engineering and the M.E. degree in Communication and Information Systems both from Huazhong University of Science and Technology, China, in 2001 and 2005, respectively. He was an assistant professor in the Department of Electrical Engineering at the University of Hawaii from 2013 to 2016 and a software engineer at UTStarcom, Shenzhen, from 2005 to 2007. He received the NSF CAREER Award in 2017. What's New May 2021 Congratulations to Yidan for successfully defending her Ph.D. dissertation, who will join the Department of Computing Security at Rochest Institute of Technology as a Tenure-Track Assistant Professor. Sept. 2019 I received an NSF grant on \"Trustworthy Hierarchical Edge Computing\". Aug. 2017 I received an NSF grant on \"Secure Mobile Cloud Sensing\". Jan. 2017 I received an NSF CAREER Award. Jan. 2016 I was invited to serve on the editorial board of IEEE Internet of Things Journal. Oct. 2015 Prof. Masahiro Mambo and I will organize ISC 2016. Please submit your good work and consider attending. Aug. 2015 I received an NSF grant on \"Secure and usable indoor navigation for indivuals with visual impairment\". Aug. 2014 I received an NSF grant on \"Secure and usable authentication for people with visual impairment\". Teaching CISC320 Introduction to Algorithms: Fall'21 CISC621 Algorithm Design and Analysis: Fall'20|Fall'19 CISC450/CPEG419 Computer Networks I: Spring'20|Spring'19|Fall'17 CISC464/664 Introduction to Network Security: Spring'19|Spring'18|Fall'16 CISC859 Advanced Topics in Communications, Distributed Computing Networks: Network Security: Fall'18|Spring'17 EE 205 Object Oriented Programming: Spring'16|Spring'15|Spring'14 (at University of Hawaii) EE 602 Algorithm I: Fall'15|Fall'14|Fall'13 (at University of Hawaii) Research Interests Security and privacy issus in wireless networks, mobile crowdsourcing, mobile systems for disabled people, cloud computing, and social networks Research Projects \"SaTC: CORE: Small: Collaborative: Trustworthy Hierarchical Edge Computing,\" $250,000, National Science Foundation (CNS-1933047), 11/1/2019-10/1/2022, PI \"SaTC: CORE: Small: Secure Mobile Cloud Sensing,\" $500,000, National Science Foundation (CNS-1718078), 9/1/2017-8/31/2020, PI \"CAREER: Secure Database-Driven Dynamic Spectrum Sharing\", $500,000, National Science Foundation (CNS-1651954), 5/1/2017-4/30/2022, PI \"NeTS: Medium: Collaborative Research: Secure and Usable Indoor Navigation for Individuals with Visual Impairement,\" $250,000, National Science Foundation (CNS-1700039), 9/1/2015-8/31/2019, PI \"TWC: Small: Collaborative: Secure and Usable Mobile Authentication for People with Visual Impairment,\" $149,999, National Science Foundation (CNS-1700032), 8/1/2015-7/31/2018, PI. Students Aishah Aseeri (PhD student, Fall 2017~) Tianye Ma (PhD student, Spring 2018~) Zheyuan Liu (PhD student, Spring 2018~) Yunzhi Li (PhD student, Fall 2018~) Yukun Dong (PhD student, Fall 2018~) Hui Cao(Visting PhD student, Wuhan University, Fall 2018~Spring 2019) Xixun Yu (Visting PhD student, Xidian University, Fall 2017~Spring 2019) Yidan Hu (PhD, Fall 2016~Spring 2021, initial employment: Tenure Track Assistant Professor, Computing Security Department, Rochester Institute of Technology) Publications Journal Article (In)secure acoustic mobile authentication [pdf] Dianqi Han, Ang Li, Lili Zhang, Yan Zhang, Jiawei Li, Tao Li, Rui Zhang, and Yanchao Zhang, to appear at IEEE Transactions on Mobile Computing Verifiable Query Processing Over Outsourced Social Graph [pdf] Xin Yao, Rui Zhang, Dingquan Huang, and Yanchao Zhang, IEEE/ACM Transactions on Networking, vol. 29, no. 5, pp. 2313-2326, Oct. 2021,. Privacy Preserving Collaborative Machine Learning [pdf] Zheyuan Liu and Rui Zhang, EAI Endorsed Transactions on Security and Safety, 8 (28). e3. 2021 A Spatiotemporal Approach for Secure Crowdsourced Radio Environment Map Construction [pdf] Yidan Hu and Rui Zhang, IEEE/ACM Transactions on Networking, vol. 28, no. 4, pp. 1790-1803, Aug. 2020. IndoorWaze: A Crowdsourcing-Based Context-Aware Indoor Navigation System [pdf] Tao Li, Dianqi Han, Yimin Chen, Rui Zhang, Yanchao Zhang, and Terri Hedgpeth, IEEE Transactions on Wireless Communications, vol. 19, no. 8, pp. 5461-5472, Aug. 2020. Verifiable outsourced computation over encrypted data [pdf] Xixun Yu, Zheng Yan, and Rui Zhang, Information Sciences, vol. 479, pp. 372-385, April 2019. Beware of what you share: inferring user locations in Venmo [pdf] Xin Yao, Yimin Chen, Rui Zhang, Yanchao Zhang, and Yaping Lin, IEEE Internet of Things Journal, vol. 5, no. 6, pp. 5109-5118, Dec. 2018. SpecGuard: Spectrum misuse detection in dynamic spectrum access systems [pdf] Xiaocong Jin, Jingchao Sun, Rui Zhang, Yanchao Zhang, and Chi Zhang, IEEE Transactions on Mobile Computing , vol. 17, no. 12, pp. 2925-2938, 1 Dec. 2018. The rise of social botnets: Attacks and countermeasures [pdf] Jinxue Zhang, Rui Zhang, Yanchao Zhang, and Guanhua Yan, IEEE Transactions on Dependable and Secure Computing, vol. 15, no. 6, pp. 1068-1082, 1 Nov.-Dec. 2018. A multisecret value access control framework for airliner in multinational air traffic management [pdf] Depeng Li, Rui Zhang, Yingfei Dong, Fangjin Zhu, and Dusko Pavlovic, IEEE Internet of Things Journal, vol. 4, no. 7, pp. 1853-1867, December 2017. Privacy-preserving spatiotemporal matching for secure device-to-device communications [pdf] Jingchao Sun, Rui Zhang, and Yanchao Zhang, IEEE Internet of Things Journal, vol. 3, no. 6, pp. 1048-1060, December 2016. TrueTop: A sybil-resilient system for user influence measurement on Twitter [pdf] Jinxue Zhang, Rui Zhang, Jingchao Sun, Yanchao Zhang, and Chi Zhang, IEEE/ACM Transactions on Networking.vol. 24, no. 5, pp. 2834-2846, October 2016 SecureFind: Secure and privacy-preserving object finding via mobile crowdsourcing [pdf] Jingchao Sun, Rui Zhang, Xiaocong Jin, and Yanchao Zhang, IEEE Transactions on Wireless Communications, vol. 15, no. 3, pp. 1716-1728, March 2016. Jamming-resistant secure neighbor discovery in mobile ad hoc networks [pdf] Rui Zhang, Jingchao Sun, Yanchao Zhang, and Xiaoxia Huang, IEEE Transactions on Wireless Communications, vol. 14, no. 10, pp. 5588-5601, Oct. 2015. Secure spatial top-k query processing via untrusted location-based service provider [pdf] Rui Zhang, Jingchao Sun, Yanchao Zhang, and Chi Zhang, IEEE Transactions on Dependable and Secure Computing, vol. 12, no. 1, pp. 111-124, January/February 2015. Secure top-k query processing in unattended tiered sensor networks [pdf] Rui Zhang, Jing Shi, Yanchao Zhang, and Xiaoxia Huang, IEEE Transactions on Vehicular Technology, vol. 63, no. 9, pp. 4681-4693, Nov. 2014. TIGHT: A geographic routing protocol for cognitive radio mobile ad hoc networks [pdf] Xiaocong Jin, Rui Zhang, Jingchao Sun, and Yanchao Zhang, IEEE Transactions on Wireless Communications, vol. 13, no. 8, pp. 4670-4681, Aug. 2014. Verifiable privacy-preserving aggregation in people-centric urban sensing systems [pdf] Rui Zhang, Jing Shi, Yanchao Zhang, and Chi Zhang, IEEE Journal on Selected Areas in Communications, Special Issue on Emerging Technologies, vol. 31, no. 9, pp. 268-278, Sep. 2013. Privacy-preserving profile matching for proximity-based mobile social networking [pdf] Rui Zhang, Jinxue Zhang, Yanchao Zhang, Jinyuan Sun, and Guanhua Yan, IEEE Journal on Selected Areas in Communications, Special Issue on Emerging Technologies, vol. 31, no. 9, pp. 656-668, Sep. 2013. Distributed privacy-preserving access control in sensor networks [pdf] Rui Zhang, Yanchao Zhang, and Kui Ren, IEEE Transactions on Parallel and Distributed Systems, vol. 23, no. 8, pp. 1427-1438, August 2012. Secure cooperative data storage and query processing in unattended tiered sensor networks [pdf] Rui Zhang, Jing Shi, Yanchao Zhang, and Jinyuan Sun, IEEE Journal on Selected Areas in Communications, Special Issue on Cooperative Networking Challenges and Applications, vol. 30, no. 2, pp. 433-441, February 2012. AOS: An anonymous overlay system for mobile ad hoc networks [pdf] Rui Zhang, Yanchao Zhang, and Yuguang Fang, ACM Wireless Networks, vol. 17, pp. 843-859, May 2011. A spatiotemporal approach to secure range queries in tiered sensor networks [pdf] Jing Shi, Rui Zhang, and Yanchao Zhang, IEEE Transactions on Wireless Communications, vol. 10, no. 1 pp. 264-273, January 2011. Conference Papers ImPos: An image-based indoor positioning system [pdf] Yunzhi Li, Rajeswari Kambhamettu, Yidan Hu, and Rui Zhang, to appear at IEEE Consumer Communications & Networking Conference (CCNC), Virtual, January 2022. SecQSA: Secure sampling-based quantile summary aggregation in wireless sensor networks [pdf] Xin Yao, Rui Zhang, and Yanchao Zhang, to appear at International Conference on Mobility, Sensing and Networking (MSN), Virtual, December 2021. Differential privacy-preserving user linkage across online social networks [pdf] Xin Yao, Rui Zhang, and Yanchao Zhang, IEEE/ACM International Symposium on Quality of Service (IWQoS), Virtual, June 2021. Secure outsourced top-$k$ selection queries against untrusted cloud service providers [pdf] Xixun Yu, Yidan Hu, Rui Zhang, Zheng Yan, and Yanchao Zhang, IEEE/ACM International Symposium on Quality of Service (IWQoS), Virtual, June 2021. Your home is insecure: practic",
  "content_length": 22544,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:25"
}