{
  "name": "Rui Li 0002",
  "homepage": "https://www.rit.edu/directory/rxlics-rui-li",
  "status": "success",
  "content": "Rui Li | RIT RIT Logo with Text Rui Li Associate Professor Department of Computing and Information Sciences Ph.D. Golisano College of Computing and Information Sciences rxlics@rit.edu 585-475-2521 Rui Li Associate Professor Department of Computing and Information Sciences Ph.D. Golisano College of Computing and Information Sciences Education BS, Harbin Institute of Technology (China); MS, Tianjin University of Technology (China); Ph.D., Rochester Institute of Technology rxlics@rit.edu 585-475-2521 Personal Links Personal Website Select Scholarship Published Conference ProceedingsLi, Rui, et al. \"Sparse Covariance Modeling of Gene Regulatory Networks with Gaussian Processes.\" Proceedings of the NeurIPS. Ed. NeurIPS. Montreal, QC: n.p., 2018. Web.KC, Kishan, et al. \"Learning Topology-preserving Embedding for Gene Interaction Networks.\" Proceedings of the European Conference on Computational Biology. Ed. ECCB. Athens, Greece: n.p., 2018. Web.Li, Rui, Jared Curhan, and M. Ehsan Hoque. \"Understanding Social Interpersonal Interaction via Synchronization Templates of Facial Events.\" Proceedings of the AAAI 2018. Ed. Carol Hamilton. New Orleans, Louisiana: AAAI, 2018. Print.Guo, Xuan, et al. \"Modeling Physicians’ Utterances to Explore Diagnostic Decision-making.\" Proceedings of the IJCAI 2017. Ed. Fahiem Bacchus. Melbourne, Australia: IJCAI, 2017. Print.Journal PaperLi, Rui, et al. \"Modeling Eye Movement Patterns to Characterize Perceptual Skill in Image-based Diagnostic Reasoning Processes.\" Computer Vision and Image Understanding 151. (2016): 138-152. Web. Currently Teaching CISC-863Statistical Machine Learning3 CreditsThis course will cover the theory and practice of statistical machine learning, focusing on computational methods for supervised and unsupervised data analysis. Specific topics include Bayesian, maximizing a posteriori (MAP), and maximum likelihood (ML) parameter estimation, regularization and sparsity-promoting priors, kernel methods, adaptive basis function methods, the expectation maximization algorithm, Monte Carlo methods, variational methods, and models for data with temporal or hierarchical structure. Applications to regression, categorization, clustering, and dimensionality reduction problems are illustrated by examples. Each student will complete several problem sets, including both mathematical and computer implementation problems. Probability and Statistics I, Linear Algebra, and Introduction to Computer Programming. Familiarity with a numerical mathematics package (e.g. Matlab, Maple, Mathematica) is helpful but not required.CISC-865Deep Learning3 CreditsDeep learning represents a set of emerging techniques in machine learning that has quickly become prevalent in the analysis of big data. The power and potential of this recent breakthrough in intelligent computer systems has been demonstrated through many successes. Deep learning systems are the current best performer in computer vision and speech processing. A wide variety of active researches are being conducted to leverage the capability of deep learning for achieving automation in areas such as autonomous driving, robotics, and automated medical diagnosis. There is a crucial need to educate our students on such new tools. This course gives an in-depth coverage of the advanced theories and methods in deep learning including basic feedforward neural networks, convolutional neural networks, recurrent neural networks including long short-term memory models, deep belief nets, and autoencoders. It will make an emphasis on approaches with practical relevance, and discusses a number of recent applications of deep networks applications in computer vision, natural language processing and reinforcement learning. In the News October 6, 2025 RIT researchers use machine learning to better understand the pathways of disease A new project funded by the National Institutes of Health is using artificial intelligence to map the full journey of illnesses and discover entirely new disease pathways. January 31, 2022 Scholars earn coveted early career awards Three faculty members who chose to start their research careers at RIT received prestigious National Science Foundation CAREER Awards in 2021. Their research aims to advance the foundations of machine intelligence, artificial intelligence, and clean energy. July 21, 2021 CAREER Awards advance promising research for future innovators and leaders NSF Faculty Early Career Development (CAREER) Award winners are among an elite group of research faculty on campus and across the country. CAREER Awards are just one of several indicators of a university’s growing research initiatives, funding sources, and faculty innovation. More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 4922,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:24"
}