{
  "name": "Rui Kuang",
  "homepage": "http://www-users.cs.umn.edu/~kuang",
  "status": "success",
  "content": "﻿Rui Kuang Rui Kuang Kuang-Lab Homepage Kuang-Lab Software Rui Kuang Professor Department of Computer Science and Engineering University of Minnesota Twin Cities PhD, Columbia University (2006); MS, Temple University (2002); BS, Nankai University (1999), all in Computer Science Office: 5-215 Keller Hall;\t\tPhone:(612) 624-7820; Email: kuang at umn dot edu; Kuang-Lab Homepage Research Interests My broad research interests are in computational biology, biomedical informatics and machine learning. My lab focuses on developing machine-learning algorithms for problems in cancer genomics, biological network analysis and protein function/structure analysis. Teaching Spring 2021: CSCI 5546: Functional Genomics, Systems Biology and Bioinformatics [syllabus] Fall 2019: CSci 5521: Introduction to Machine Learning [syllabus] Selected Publications (Complete list in Publication @ Kuang Lab Home Page and software available via GitHub ) Learning a Low-rank Tensor of Pharmacogenomic Multi-relations from Biomedical Networks, Li, Zhuliu; Zhang, Wei; Huang, Stephanie R; Kuang, Rui, IEEE International Conference on Data Mining, 2019 Machine Learning and Statistical Methods for Clustering Single-cell RNA-sequencing Data, Raphael Petegrosso, Zhuliu Li, Rui Kuang#, Briefs in Bioinformatics, In Press, 2019 Scalable Remote Homology Detection and Fold Recognition in Massive Protein Networks. Petegrosso, Raphael, Zhuliu Li, Molly A. Srour, Yousef Saad, Wei Zhang, and Rui Kuang. Scalable Proteins: Structure, Function, and Bioinformatics (2019) 87(6):478-491. A Multitask Clustering Approach for Single-cell RNA-Seq Analysis in Recessive Dystrophic Epidermolysis Bullosa, Huanan Zhang*, Catherine AA Lee*, Zhuliu Li*, John R Garbe, Cindy R Eide, Rui Kuang#, and Jakub Tolar#, PLoS Comput Biol, https://doi.org/10.1371/journal.pcbi.1006053, 2018 Detecting Population-differentiation Copy Number Variants in Human Population Tree by Sparse Group Selection, Zhang, Huanan; Roe, David; Kuang, Rui#, In: IEEE/ACM Transactions on Computational Biology and Bioinformatics, 2018, In Publication Network-based Machine Learning and Graph Theory Algorithms for Precision Oncology, Zhang, Wei; Chien, Jeremy; Yong, Jeongsik; Kuang, Rui#, In: NPJ Precision Oncology, (25), 2017. Transfer Learning across Ontologies for Phenome-Genome Association Prediction, Petegrosso, Raphael; Park, Sunho; Hwang, Tae Hyun; Kuang, Rui#, Bioinformatics, pp. btw649, 2016 Network-based Isoform Quantification with RNA-Seq Data for Cancer Transcriptome Analysis, Wei Zhang, Jae-Woong Chang, Lilong Lin, Kay Minn, Baolin Wu, Jeremy Chien, Jeongsik Yong, Hui Zheng, and Rui Kuang#. PLoS Comput Biol, 2015. doi:10.1371/journal.pcbi.1004465 mRNA 3'UTR shortening is a new mTORC1-activated molecular signature defining the specificity in ubiquitin-proteasome pathway, Jae-Woong Chang*, Wei Zhang*, Hsin-Sung Yeh, Ebbing de Jong, Semo Jun, Kwan-Hyun Kim, Sun Sik Bae, Kenneth Beckman, Tae Hyun Hwang, Kye-Seong Kim, Do-Hyung Kim, Timothy Griffin, Rui Kuang, Jeongsik Yong, Nature Communication, 6:7218, 2015 Network-based Phenome-Genome Association Prediction by Bi-Random Walk, MaoQiang Xie, YingJie Xu, YaoGong Zhang, TaeHyun Hwang, Rui Kuang#, Plos One, May 1, 2015 Platinum-Sensitive Recurrence in Ovarian Cancer: The Role of Tumor Microenvironment, Jeremy R Chien, Rui Kuang, Charles Landen and Viji Shridhar, Front Oncol., 2013; 3: 251. Network-based Survival Analysis Reveals Subnetwork Signatures fro Predicting Outcomes of Ovarian Cancer Treatment, Wei Zhang, Takayo Ota, Viji Shridhar, Jeremy R Chien, Baolin Wu and Rui Kuang#, PLoS Computational Biology, 9(3):e1002975, 2013 Co-clustering Phenome-genome for Phenotype Classification and Disease Gene Discovery, TaeHyun Hwang, Gowtham Atluri, Maoqiang Xie, Sanjoy Dey, Changjin Hong, Vipin Kumar and Rui Kuang#, Nucleic Acids Research, 40(19):e146, 2012 Inferring Disease and Gene Set Associations with Rank Coherence in Networks, TaeHyun Hwang, Wei Zhang, MaoQiang Xie and Rui Kuang#, Bioinformatics, Vol. 27, No. 19, pages: 2692-2699, 2011 Integrative Classification and Analysis of Multiple ArrayCGH Datasets with Probe Alignment, Ze Tian and Rui Kuang#, Bioinformatics, Vol. 26, No. 18, pages: 2313-2320, 2010 A Hypergraph-based Learing Algorithm for Classifying Gene Expression and ArrayCGH Data with Prior Knowledge, Ze Tian, TaeHyun Hwang and Rui Kuang#, Bioinformatics, Vol. 25, No. 21, pages: 2831-2838, 2009 Robust and Efficient Identification of Biomarkers by Classifying Features on Graphs, TaeHyun Hwang, Hugues Sicotte, Ze Tian, BaolinWu, Dennis Wigle, Jean-Pierre Kocher, Vipin Kumar and Rui Kuang#, Bioinformatics, Vol. 24, No. 18, pages 2023-2029, 2008 Profile-based String Kernels for Remote Homology Detection and Motif Extraction, Rui Kuang, Eugene Ie, Ke Wang, Kai Wang, Mahira Siddiqi, Yoav Freund and Christina Leslie, Journal of Bioinformatics and Computational Biology, Vol. 3, No. 3, pages: 527-550, 2005 Motif-based Protein Ranking by Network Propagation, Rui Kuang, Jason Weston, William Stafford Noble and Christina Leslie, Bioinformatics, Vol. 21, No. 19, pages: 3711-3718, 2005 Fast String Kernels Using Inexact Matching for Protein Sequences, Christina Leslie and Rui Kuang, Journal of Machine Learning Research, Vol. 5, pages: 1435-1455, 2004 Protein Backbone Angle Prediction with Machine Learning Approaches, Rui Kuang, Christina Leslie and An-Suei Yang, Bioinformatics, Vol. 20. No. 10, pages: 1612-1621, 2004 Transfer Learning Across Cancers on DNA Copy Number Variation Analysis, Huanan Zhang, Ze Tian and Rui Kuang, IEEE International Conference on Data Mining (ICDM), 2013. Sparse Group Selection on Fused Lasso Components for Identifying Group-specific DNA Copy Number Variations, Ze Tian, Huanan Zhang and Rui Kuang, Proc. of IEEE International Conference on Data Mining (ICDM), page 665-674, 2012 (Best Student Paper) Disease Gene Prioritization by Bi-Random Walk, Maoqiang Xie, TaeHyun Hwang and Rui Kuang, Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), pages: 292-303, 2012. Global Linear Neighborhoods for Efficient Label Propagation, Ze Tian and Rui Kuang, SIAM International Conference on Data Mining (SDM), 2012. A Heterogeneous Label Propagation Algorithm for Disease Gene Discovery, TaeHyun Hwang and Rui Kuang, SIAM International Conference on Data Mining (SDM), 2010. Learning on Weighted Hypergraphs to Integrate Protein Interactions and Gene Expressions for Cancer Outcome Prediction, TaeHyun Hwang, Ze Tian, Jean-Pierre Kocher and Rui Kuang, International Conference on Data Mining (ICDM), pages: 293-302, 2008. Profile-based String Kernels for Remote Homology Detection and Motif Extraction, Rui Kuang, Eugene Ie, Ke Wang, Kai Wang, Mahira Siddiqi, Yoav Freund and Christina Leslie, The Computational Systems Bioinformatics Conference (IEEE CSB), pages: 152-160, 2004. Fast Kernels for Inexact String Matching, Christina Leslie and Rui Kuang, Conference on Learning Theory and Kernel Workshop (COLT/KW), pages: 114-128, 2003. Department of Computer Science and Engineering University of Minnesota Twin Cities",
  "content_length": 7110,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:23"
}