{
  "name": "Ruibang Luo",
  "homepage": "http://www.bio8.cs.hku.hk",
  "status": "success",
  "content": "Luo lab in Bioinformatics - HKU Computer Science Ruibang Luo Associate Professor Assistant Director (Learning Experience & Student Enrichment) Program Director (BEng (AI & Data Science)) School of Computing and Data Science The University of Hong Kong Office: Rm422, Chow Yei Ching Bldg., HKU Pokfulam Rd., Hong Kong Email: rbluo (at) cs (dot) hku (dot) hk [Google Scholar] [ORCID] [CV] [My GitHub] [Lab GitHub] People Publications Software Teaching Join us at the GIW/ISCB-Asia 2025 conference on the HKU main campus on December 11-13, 2025. More detail at giw.hk. ABOUT Dr. Ruibang Luo is an Associate Professor of Computer Science at the University of Hong Kong. He completed his Ph.D. training in Bioinformatics with Dr. Tak-Wah Lam at the University of Hong Kong (2010-2015), and his postdoctoral training with Drs. Steven Salzberg and Michael Schatz at the Center of Computational Biology, Johns Hopkins University (2016-2017). Luo is a researcher working on bioinformatics algorithms and clinical informatics. He published more than 80 papers. Ten of them have achieved over a thousand citations. He has been identified as Top 1% Scholars Worldwide by Clarivate Analytics since 2019. He has been selected by Baidu Research as Worldwide Top 150 Chinese Young Scholars in Artificial Intelligence. He was named Top 10 Innovators Under 35 Asia Pacific by MIT Technology Review in 2019, and 30 Under 30 Asia in Healthcare and Science by Forbes in 2017. Recruitment: We are looking for dedicated and self-motivated students and postdocs with passion in bioinformatics. If you enjoy deciphering biological and medical big data by writing up your own code to target for the best speed, sensitivity and accuracy, you might be interested in working with me. Please contact me through email with your CV. Visiting scholars: We invite scholars at any career stage for short-term or long-term collaborative visits at HKU. We offer an engaging research environment, access to advanced facilities and technologies, and numerous professional development opportunities. Awards/Honors Top 1% Scholars Worldwide by Clarivate Analytics, 2019-25 World’s Top 2% Scientists Released by Stanford University, 2020-25 Outstanding Young Researcher Award (OYRA), HKU, 2024 Faculty's Best Teacher Award, HKU Engineering, 2022/23 Department's Best Teacher Award, HKU Comupter Science, 2022/23 Top 150 Chinese Young Scholars in Artificial Intelligence by Baidu Research, 2022 Innovators Under 35 Asia Pacific by MIT Technology Review, Class of 2019 Forbes 30 Under 30 Asia 2017: Healthcare and Science",
  "content_length": 2582,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:23"
}