{
  "name": "Ruihui Li",
  "homepage": "https://liruihui.github.io",
  "status": "success",
  "content": "Li Ruihui @ HNU Ruihui Li (李瑞辉) Professor College of Computer Science and Electronic Engineering Hunan University, Changsha, Hunan Province liruihui [at] hnu [dot] edu [dot] cn [Twitter] [中文主页] Research Interest Deep Geometry Learning, Generative modeling, 3D Vision, and Computer graphics, particularly interested for 3D reconstruction and generation with high controllability. News I am looking for self-motivated Ph.D./MPhil. students, RAs, PostDocs, and Visiting scholars to join my group. Please drop me an email with your CV if you are interested. [02/2024] One paper (Camera-based 3D Semantic Scene Completion) was accepted by CVPR 2024. [01/2024] One paper (Neural wavelet-domain diffusion for 3d shape generation, inversion, and manipulation) was accepted by TOG 2024. [07/2023] One paper (SD-Net point cloud completion) was accepted by ACM MM 2023. [10/2022] One paper (neural template) was accepted by CVPR2022. [10/2022] One paper (point cloud self-embedding) was accepted by TVCG. [10/2022] One paper (Neural Wavelet-domain Diffusion) was accepted by SIGA 2023. [07/2022] One paper (pair-patch-wise point cloud upsampling) was accepted by ACM MM 2022 . [03/2022] One paper (topology-aware mesh reconstruction and generation) was accepted by CVPR2022 . [02/2022] One paper (invertible downsampling for point set) was accepted by TVCG . [02/2022] One paper (domain adaptation for RNA-binding protein analysis) was accepted by PLOS CB . [06/2021] One paper (rotation invariant framework for point cloud analysis) was accepted by TVCG. [06/2021] Passed the oral defense and became a Dr. [03/2021] SP-GAN was accepted to SIGGRAPH 2021. (A Real Milestone :)) [02/2021] Dis-PU was accepted to CVPR 2021. [02/2020] PointAugment was accepted by CVPR 2020 (Oral). [07/2019] PU-GAN was accepted by ICCV 2019. Publications [Google Scholar] [Github] Neural Wavelet-domain Diffusion for 3D Shape Generation Ka-Hei Hui, Ruihui Li, Jingyu Hu, Chi-Wing Fu SIGGRAPH Asia 2022 [Paper] PC^2-PU: Patch Correlation and Point Correlation for Effective Point Cloud Upsampling Chen Long, Wenxiao Zhang, Ruihui Li#, Hao Wang, Zhen Dong, Bisheng Yang ACM MM 2022 [Paper] Neural Template: Topology-aware Reconstruction and Disentangled Generation of 3D Meshes Ka-Hei Hui*, Ruihui Li*, Jingyu Hu, Chi-Wing Fu (* joint first authors) IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 2022 [Paper] [Project] [Code] Point Set Self-Embedding Ruihui Li, Xianzhi Li, Tien-Tsin Wong, Chi-Wing Fu IEEE Transactions on Visualization and Computer Graphics (IEEE TVCG), 2022. [Paper] [Code] Inferring RNA-binding protein target preferences using adversarial domain adaptation Ying Liu, Ruihui Li, Jiawei Luo Zhaolei Zhang PLOS Computational Biology [Paper] [Code] SP-GAN: Sphere-Guided 3D Shape Generation and Manipulation Ruihui Li, Xianzhi Li, Ka-Hei Hui, Chi-Wing Fu ACM SIGGRAPH 2021 [Project] [Paper] [Video] [Code] Point Cloud Upsampling via Disentangled Refinement Ruihui Li, Xianzhi Li, Pheng-Ann Heng, Chi-Wing Fu IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 2021 [Paper] [Video] [Poster] [Code] A Rotation-invariant Framework for Deep Point Cloud Analysis Xianzhi Li, Ruihui Li#, Guangyong Chen, Chi-Wing Fu, Daniel Cohen-Or, Pheng-Ann Heng IEEE Transactions on Visualization and Computer Graphics (IEEE TVCG), 2021. (# Corresponding author) [Paper] [Code] PointAugment: an Auto-Augmentation Framework for Point Cloud Classification Ruihui Li, Xianzhi Li, Pheng-Ann Heng, Chi-Wing Fu IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2020). (Oral) [Paper] [Video] [Poster] [Code] DNF-Net: a Deep Normal Filtering Network for Mesh Denoising Xianzhi Li, Ruihui Li, Lei Zhu, Pheng-Ann Heng, Chi-Wing Fu IEEE Transactions on Visualization and Computer Graphics (IEEE TVCG), 2020. [Paper] [Code] PU-GAN: a Point Cloud Upsampling Adversarial Network Ruihui Li, Xianzhi Li, Chi-Wing Fu, Daniel Cohen-Or, Pheng-Ann Heng IEEE International Conference on Computer Vision (ICCV), pp. 7203-7212, 2019. [Paper] [Project] [Poster] [Code] Activities Invited Talks: Asia Graphics Webinar Session 5: 3D Geometry Learning from Upsampling to Generation, 2021.12 [Poster] [Video] Peking University: 3D Point Cloud Analysis via Deep Learning, 2021.07 [Link] Wuhan University: Point Cloud Upsampling: challenge and solution, 2021.03 Shenlan Xueyuan: Deep learning in point cloud recognition, 2020.04 [Link] Reviews Conference: CVPR'22, ICCV'21, CVPR'21, ECCV'20, CVPR'20, et al. Journal: TPAMI, TVCG, TIP, IJCV, CGA, TVC,GMOD, et al. Reading List on 3D/2D topics [Link] ©Ruihui Li.  Last updated: Mar. 01, 2022.",
  "content_length": 4626,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:25"
}