{
  "name": "Ruiyuan Li",
  "homepage": "http://www.kangry.net/blog/?type=about-me",
  "status": "success",
  "content": "Ruiyuan Li (李瑞远) | 康瑞部落 康瑞部落 一箫一剑走江湖，千古情愁酒一壶。双脚踏翻尘世路，以天为盖地为庐。 About Me About Blog Post List Released Data 欢迎辞 欢迎来到“康瑞部落”! 如果您是第一次来到本站，建议访问“关于部落”以便更快地了解本站。 如果您还不了解我，建议访问“关于我”以便我们更好地交流。 分类导航 数据库 (5)git (2)时空数据 (50)数据 (4)分布式 (13)maven (4)eclipse (2)java (6)HBase (3)程序远读论文 (6)数学 (2)python (3)机器学习 (4)Azure (21)云计算 (22)多线程 (4)计算机网络 (1)Linux (4)《算法竞赛入门经典》 (1)读书笔记 (1)移动开发 (1)系统案例 (1)程序远的音乐梦 (15)程序远面试笔记 (8)oj (203)C#/.NET (57)工具/软件使用技巧 (48)胡诌 (2)windows (13)shell (1)SqlServer (13)算法 (15)录制视频 (1)mysql (5)c/c++ (209)网络小说 (1)金庸小说 (2)计算机转载 (9)转载美文 (9)php (9)网站开发 (5)javascript (8)诗词曲赋 (1)部落系统 (4) 最新评论 Kangry[博主] 在 Ruiyuan Li (李瑞远) 说： 2024-12-11 13:58 主页中有邮箱哈，欢迎邮件联系。 贺陈浪 在 Ruiyuan Li (李瑞远) 说： 2024-12-11 10:43 瑞远哥，我是原京东城市贺陈浪，很高兴在重庆看见你，我也回重庆了，希望瑞远哥留个联系方式，后面继续互相支持工作 邓女士 在 VLDB 2023 | 基于擦除的浮点无损压缩（附论文和源码） 说： 2024-09-11 17:34 123456 Rong Lonely 在 Ruiyuan Li (李瑞远) 说： 2023-06-02 16:02 请问老师的实验室还招博士吗，守elf论文深深启发，想从硕士再读博 李茜茜 在 word公式编辑器插件MathType 说： 2023-03-15 22:14 您好您好，能发一下MathType插件吗？非常感谢 热门文章 Ruiyuan Li (李瑞远) (81519)c#用JObject解析Json (77724)多种序列距离汇总 (64329)京东城市时空数据引擎JUST亮相中国数据库技术大会（附PPT链接） (48142)京东城市时空数据引擎—JUST 如何通过轨迹数据恢复小区路网 (47190)无损时序压缩Elf+：压缩率再提升10%，压缩时间减少20%（附源码） (42661)揭秘京东城市时空数据引擎—JUST如何助力交通流量预测 (25565)vs2013无法创建html，不能发布：The web publishing extension is not installed which is required to publish. You can install it from http://go.microsoft.com/fwlink/?LinkID=208120 (23019)molebox launcher fatal (could not open boxfile) (22391)windows 8 中文乱码 (20536) 文章归档 2025年11月 (1)2025年09月 (4)2025年06月 (1)2025年04月 (2)2023年08月 (1)2023年05月 (3)2023年04月 (1)2022年12月 (1)2022年06月 (1)2022年05月 (6)2022年04月 (2)2022年03月 (2)2021年09月 (1)2021年08月 (3)2021年04月 (7)2021年03月 (5)2021年02月 (6)2021年01月 (5)2020年12月 (7)2020年11月 (3)2020年10月 (3)2020年09月 (4)2020年07月 (2)2019年11月 (2)2018年04月 (3)2018年01月 (3)2017年12月 (2)2017年11月 (1)2017年09月 (1)2017年07月 (2)2017年06月 (4)2017年05月 (3)2017年01月 (5)2016年12月 (4)2016年11月 (6)2016年10月 (4)2016年09月 (3)2016年08月 (9)2016年07月 (3)2016年06月 (1)2016年05月 (6)2016年04月 (3)2016年03月 (12)2016年02月 (4)2016年01月 (9)2015年12月 (8)2015年11月 (11)2015年10月 (2)2015年09月 (5)2015年08月 (46)2015年07月 (24)2015年06月 (22)2015年05月 (61)2015年04月 (68)2015年03月 (23)2015年02月 (2)2015年01月 (6)2014年12月 (13)2014年11月 (7)2014年10月 (8)2014年09月 (4)2014年08月 (14)2014年07月 (14)2014年05月 (2)2014年04月 (3)2014年03月 (5)2014年01月 (5) 友情链接 时空实验室-知乎 康瑞部落CSDN Yu Zheng Jie Bao Sijie Ruan 08 01/2014 Ruiyuan Li (李瑞远) 分类： 部落系统 | 浏览 (81521) | 评论 (18) Name: Ruiyuan Li (李瑞远)Affiliation: College of Computer Science, Chongqing UniversityTitle: Associate ProfessorEmail: ruiyuan.li at cqu.edu.cnAddress: Information Technology Research Building, Huxi Cumpus, Chongqing University, China, 401331Research Interests: Database, AI4DB, Big Data, Spatio-Temporal Data Intelligence, Distributed Computing, Urban ComputingTeaching: Database Systems (Stand-out Class), Foundation of Programming[中文版] [Google Scholar] [DBLP] [Homepage in Chongqing University]Dr. Ruiyuan Li is an associate professor with the College of Computer Science, Chongqing University, China. He was selected as the most popular teacher among students. He was the Head of Spatio-Temporal Data Group in JD Intelligent Cities Research, leading the research and development of JUST (JD Urban Spatio-Temporal data engine). Before joining JD, he had interned in Microsoft Research Asia from 2014 to 2017. He received the B.E. and M.S. degrees from Wuhan University, China in 2013 and 2016, respectively, and the Ph.D. degree from Xidian University, China in 2020, under the supervisor of IEEE Fellow and ACM Distinguished Scientist Yu Zheng. His research focuses on Spatio-temporal Data Intelligence, Distributed Computing, and Urban Computing. He has published more than 50 refereed papers (including 20+ CCF A papers) that contribute to 3300+ Google Scholar Citations, and applied for over 40 Chinese patents. One of his patents got the China Patent Excellence Award.  He received the Excellent Doctoral Dissertation Award of Shaanxi Computer Society in 2020 and Excellent Doctoral Dissertation Award of Chinese Institute of Electronics in 2022. He won the third prize in CCF Natural Science because of his contribution to spatio-temporal data management and mining. He was awarded as the Spatial Data Intelligence Rising Star in 2025. He is a senior member of CCF (China Computer Federation), Outstanding Technical Committee on Databases of CCF, and Technical Committee on Pervasive Computing of CCF. He is a reviewer of several top-level conferences and journals. JUST system, which he was responsible for, has been successfully deployed in many national projects of China.The greatest advantage of Dr. Ruiyuan Li is that he enjoys the experiences in both of top universities and big enterprises. Whether you are interested in academic research or preparing to work in industry, you can feel free to contact him.There are annually 3~5 postgraduate places opening for dedicated, diligent, down-to-earth and self-motivated students majoring in computer science, GIS or other related majors!Education Experience2016.09 - 2020.08    Ph.D.            Computer Science and Technology      Xidian University, China2013.09 - 2016.06    Master         Computer Software and Theory           Wuhan University, China2009.09 - 2013.06    Bachelor      Computer Science and Technology      Wuhan University, ChinaWork Experience2021.10 - Now        Associate Professor                 Chongqing University, China2018.01 - 2021.10   Researcher/Head of Spatio-Temporal Data Group        JD Intelligent Cities Research, China2014.07 - 2018.01   Research Intern            Microsoft Research AsiaRecent News2025.04.10: I was awarded as the Spatial Data Intelligence Rising Star.2025.03.19: One paper was accepted by Data Science and Engineering.2025.03.18: One paper about floating-point compression was accepted by IoTJ! Congratulations to Zheng Li!2025.02.05: One paper about floating-point compression was accepted by SIGMOD 2025!2024.12.24: I was selected for the Electronic Information Frontier Young Scholars Publishing Project.2024.11.07: Our survey paper about compression of time series was accepted by Journal of Software (CCF A)!2024.09.28: I won the third prize in CCF Natural Science2024.09.19: I am promoted to a CCF Senior Member2024.09.15: One paper about spatio-temporal data management is accept by Data Science and Engineering.2024.07.24: One paper about AI4DB is accepted by IEEE Transactions on Big Data!2023.12.01: One co-authored paper is accepted by ICDE 2024!2023.09.28: One co-authored paper is accepted by TIST!2023.08.05: One co-authored paper is accepted by CIKM 2023!2023.07.25: Congratulations to Zechao Chen who is awarded as an outstanding student in DBS!2023.02.28: My doctoral dissertation is honored with Excellent Doctoral Dissertation Award by Chinese Institute of Electronics!2023.01.16: Our paper about floating-point compression is accepted by VLDB 2023!2022.12.17: Our paper about traffic forecasting is accepted by TKDE!2022.11.18: Our proposal is funded by China Postdoctoral Science Foundation!2022.11.02: Our paper is accepted by TITS!2022.09.08: Our proposal is funded by NSFC Youth Program (No. 62202070)!Students Supervised (Default @ Chongqing University)PhD2022: Zheng LiMasters2025: Jialing Wu, Ningrui Liu, Yurong Zhang, Fanhao Liu, Bowen Zhuang, Qinqin Zhou (@Southwest Jiaotong University)2024: Ruyun Lu, Xiaolong Xu, Tianyu Huang, Sainan Su, Ariful Sajib2023: Jiajun Li, Minghui Zhu, Zihang Xu (@Southwest Jiaotong University)2022 (graduated): , Xiang He (Meituan), Yangyang Sun (Bank of Chengdu)Undergraduates2024: Min Zhao, Jicheng Ou (@Jiangnan University), Xiang Li (@Hunan University of Science and Technology), Xinyuan Hu, Yuehan Li, Yu Fan, Yingqi Tang2023: Chengcong Hong, Qihao Shen, Yutao Bai2022: You Shang, Yi Xu, Yansheng Gao, Weiyan Wang2021 (graduated): Yongxin Tang (@Shaoyang University), Zechao Chen (PhD. HKUST(gz)), Zijian Zhang (Zhejiang University), Shuxiang Gou (UESTC), Minxin Zhou (Fudan University)2020 (graduated): Yi Wu (UIUC), Wenhui Li (Harbin Institute of Technology), Yingying Sun (Sun Yat-Sen University)Selected Published Papers (*Corresponding Author)2025Yangyang Sun, Tianyu Huang, Zijian Zhang, Ruiyuan Li*, Chao Chen, Yu Zheng. EAR-MM: An Efficient Adaptive and Robust Algorithm for Streaming Map Matching. IEEE Transactions on Intelligent Transportation Systems. 2025. (TITS, CCF B)Xianlong Jiao, Yunhui Chen, Xiang Wu, Ruiyuan Li, Songtao Guo, Yong Ma, Jiannong Cao. Intelligent Compression Offloading and Adaptive Resource Allocation for Wireless Powered MEC. IEEE Transactions on Services Computing. (TSC, CCF A) Jiajun Li, Shuxiang Gou, Ruiyuan Li*, Huajun He, Wenhui Li, Yu Zheng. DiST: Efficient Distributed Spatio-Temporal Clustering with Automatic Parameter Optimization. IEEE Transactions on Knowledge and Data Engineering. (TKDE, CCF A)You Shang, Xiang He, Ruiyuan Li*, Yingying Sun, Guanyao Li, Guangchao Yang, Junbo Zhang, Yu Zheng. General Adaptive Memory Allocation for Learned Bloom Filters. In 34th ACM International Conference on Information and Knowledge Management. (CIKM 2025, CCF B)Jiaxing Shang, Xueqi Jia, Xiaoquan Li, Fei Hao, Ruiyuan Li, Geyong Min. DVCAE: Semi-Supervised Dual Variational Cascade Autoencoders for Information Popularity Prediction. IEEE Transactions on Knowledge and Data Engineering. (TKDE, CCF A)Jiaxing Shang, Yuxuan Zhang, Linyang Zhong, Ruiyuan Li. Syntactic-Enhanced Multi-Task Learning Model for Aspect Sentiment Triplet Extraction. Data Science and Engineering. (DSEJ, CCF C)Zheng Li, Ruiyuan Li*, Xiaolong Xu, Yi Wu, Chao Chen, Tong Liu, Jiaxing Shang, Yu Zheng. Adaptive Encoding Strategies for Lossless Floating-Point Compression. IEEE Internet of Things Journal. (IoTJ, SCI 1区)Ruiyuan Li, Zechao Chen, Ruyun Lu, Xiaolong Xu, Guangchao Yang, Chao Chen, Jie Bao, Yu Zheng. Serf: Streaming Error-Bounded Floating-Point Compression. International Conference on Management of Data. (Code)(Poster)(SIGMOD 2025, CCF A)2024Minghui Zhu, Zheng Li, Ruiyuan Li*, Chao Chen, Yu Zhen",
  "content_length": 24649,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:28"
}