{
  "name": "Ruizhe Li 0001",
  "homepage": "https://www.abdn.ac.uk/people/ruizhe.li",
  "status": "success",
  "content": "Dr Ruizhe Li | The University of Aberdeen Dr Ruizhe Li Dr Ruizhe LiBEng, PhD, FHEALecturer Accepting PhDs About Email Addressruizhe.li@abdn.ac.ukSchool/DepartmentSchool of Natural and Computing Sciences Personal WebsiteGoogle ScholarTwitterLinkedinScopusORCiDPure Biography Ruizhe Li is a Lecturer (Assistant Professor) at the Aberdeen - South China Normal University (SCNU) Joint Institute in the School of Natural Computing Sciences/Business School, the University of Aberdeen. He is associated with Natural Language Processing (NLP) group, the Machine Learning (ML) group and Edinburgh clinical NLP group. He was a postdoc research fellow in the Web Intelligence Group, affiliated with the Centre for Artificial Intelligence at University College London (UCL). He received his PhD from the Sheffield NLP group, the Department of Computer Science at the University of Sheffield. He completed his bachelor's degree in BEng Electronic Information & Engineering at Shanghai University, China. Research Interests: Interpretability of LLMs, Multimodal LLMs For more details, please visit my personal website: https://www.ruizhe.space/ I am looking for highly motivated PhD students interested in NLP and ML. Please contact me for any enquiries. Qualifications Fellow of HEA 2025 - University of Aberdeen Internal Memberships SCNU JI Outreach Officer Latest Publications Leveraging Large Language Models Knowledge Enhancement Dual-Stage Fine-Tuning Framework for Recommendation 2025 - PublishedZeng, B., Shi, H., Li, Y., Li, R., Deng, H. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-981-97-9434-8_26[ONLINE] Read only PDF provided by the Springer Nature SharedIt content-sharing initiative Anchored Answers: Unravelling Positional Bias in GPT-2's Multiple-Choice Questions 2025 - PublishedLi, R., Gao, Y. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2025.findings-acl.124/[ONLINE] DOI: https://doi.org/10.18653/v1/2025.findings-acl.124[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/323c0991-8aa9-42da-85c9-bc4f84e540df/downloadMarco-Bench-MIF: On Multilingual Instruction-Following Capability of Large Language 2025 - PublishedZeng, B., Lyu, C., Liu, S., Zeng, M., Wu, M., Ni, X., Shi, T., Zhao, Y., Liu, Y., Zhu, C., Li, R., Geng, J., Li, Q., Tong, Y., Wang, L., Luo, W., Zhang, K. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2025.acl-long.1172/[ONLINE] DOI: https://doi.org/10.18653/v1/2025.acl-long.1172[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/22fd96b8-a385-4f3a-b526-92b62d0f48fe/downloadAdaptive Retrieval-Augmented Generation for Conversational Systems 2025 - PublishedWang, X., Sen, P., Li, R., Yilmaz, E. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2025.findings-naacl.30/[ONLINE] DOI: https://doi.org/10.18653/v1/2025.findings-naacl.30[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/7e260823-8a1d-445c-9561-e490ea5ebe17/downloadLeveraging Medical Knowledge Graphs Into Large Language Models for Diagnosis Prediction: Design and Application Study 2025 - PublishedGao, Y., Li, R., Croxford, E., Caskey, J., Patterson, B. W., Churpek, M., Miller, T., Dligach, D., Afshar, M. JMIR AI, vol. 4, e58670Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.2196/58670[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/683c361f-85d7-4f64-98c2-27505046224a/download View My Publications Prizes and Awards - Best Poster Award at the 2nd Workshop on Multimodal AI 2024 - ACL 2023 Area Chair Award - Outstanding Reviewer at EMNLP 2020 - Best Paper Runner-up at INLG 2019 Research Research Overview Multimodality LLMs Knowledge Graphs LLMs Reasoning Explainable LLMs. Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Supervising Accepting PhDsView Research Area Research Specialisms Artificial IntelligenceNatural Language ProcessingMachine Learning Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Funding and Grants PI, Gemma 2 Academic Program GCP Credit Award, Google, $10,000, 2024-2025 PI, Deep-learning-based Modelling of Electromechanical Coupling for Bone Conduction Transducers, The Royal Society International Exchanges 2023 Cost Share (NSFC), £24,000, 2024-2026 Teaching Courses Python Programming Foundation JC1001Object-Oriented Programming JC1503Introduction to Software Engineering JC2001Intelligent Software Implementation JC3510Natural Language Processing JC4003Knowledge Representation JC4002Graduation Thesis JC4000 Publications Page 1 of 4 Results 1 to 10 of 36 Leveraging Large Language Models Knowledge Enhancement Dual-Stage Fine-Tuning Framework for Recommendation 2025 - PublishedZeng, B., Shi, H., Li, Y., Li, R., Deng, H. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1007/978-981-97-9434-8_26[ONLINE] Read only PDF provided by the Springer Nature SharedIt content-sharing initiative Anchored Answers: Unravelling Positional Bias in GPT-2's Multiple-Choice Questions 2025 - PublishedLi, R., Gao, Y. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2025.findings-acl.124/[ONLINE] DOI: https://doi.org/10.18653/v1/2025.findings-acl.124[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/323c0991-8aa9-42da-85c9-bc4f84e540df/downloadMarco-Bench-MIF: On Multilingual Instruction-Following Capability of Large Language 2025 - PublishedZeng, B., Lyu, C., Liu, S., Zeng, M., Wu, M., Ni, X., Shi, T., Zhao, Y., Liu, Y., Zhu, C., Li, R., Geng, J., Li, Q., Tong, Y., Wang, L., Luo, W., Zhang, K. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2025.acl-long.1172/[ONLINE] DOI: https://doi.org/10.18653/v1/2025.acl-long.1172[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/22fd96b8-a385-4f3a-b526-92b62d0f48fe/downloadAdaptive Retrieval-Augmented Generation for Conversational Systems 2025 - PublishedWang, X., Sen, P., Li, R., Yilmaz, E. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2025.findings-naacl.30/[ONLINE] DOI: https://doi.org/10.18653/v1/2025.findings-naacl.30[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/7e260823-8a1d-445c-9561-e490ea5ebe17/downloadLeveraging Medical Knowledge Graphs Into Large Language Models for Diagnosis Prediction: Design and Application Study 2025 - PublishedGao, Y., Li, R., Croxford, E., Caskey, J., Patterson, B. W., Churpek, M., Miller, T., Dligach, D., Afshar, M. JMIR AI, vol. 4, e58670Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.2196/58670[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/683c361f-85d7-4f64-98c2-27505046224a/downloadLLM-Generated Personalized Analogies to Foster AI Literacy in Adult Novices 2024 - PublishedCao, C. C., Chen, E., Fang, Z., Cao, L. Y., Lin, J., Li, R. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.58459/icce.2024.4809Aspect-aware semantic feature enhanced networks for multimodal aspect-based sentiment analysis 2024 - PublishedZeng, B., Xie, L., Li, R., Yao, Y., Li, R., Deng, H. Journal of Supercomputing, vol. 81, no. 1, 64Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s11227-024-06472-4Noise-aware Speech Enhancement using Diffusion Probabilistic Model 2024 - PublishedHu, Y., Chen, C., Li, R., Zhu, Q., Chng, E. S. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.21437/Interspeech.2024-929GenTranslate: Large Language Models are Generative Multilingual Speech and Machine Translators 2024 - PublishedHu, Y., Chen, C., Yang, C. H., Li, R., Zhang, D., Chen, Z., Chng, E. S. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2024.acl-long.5/[ONLINE] DOI: https://doi.org/10.18653/v1/2024.acl-long.5[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/3fc5ecd3-ed76-4bc1-a4b4-c435019acf95/downloadListen Again and Choose the Right Answer: A New Paradigm for Automatic Speech Recognition with Large Language Models 2024 - PublishedHu, Y., Chen, C., Qin, C., Zhu, Q., Chng, E., Li, R. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2024.findings-acl.37/[ONLINE] DOI: https://doi.org/10.18653/v1/2024.findings-acl.37[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/60363245-8270-4233-9899-abbdc3e54293/download Show 10 | 25 | 50 | 100 results per page Refine Chapters in Books, Reports and Conference Proceedings Conference Proceedings (23) Contributions to Conferences Oral Presentations (3) Contributions to Journals Articles (2) Conference Articles (1) Working Papers Preprint Papers (7) Update",
  "content_length": 9205,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:30"
}