{
  "name": "Rumi Chunara",
  "homepage": "https://rumichunara.github.io",
  "status": "success",
  "content": "Rumi Chunara Rumi Chunara Associate Professor, Biostatistics and Computer Science & Engineering Director, Center for Health Data Science New York University, School of Global Public Health and Tandon School of Engineering Publications | Group | Teaching | Awards | Press I am an Associate Professor of Computer Science, Biostatistics, and Global Public Health at New York University, where I direct the Center for Health Data Science (CHDS). My research sits at the intersection of machine learning, public health, and society. I focus on understanding what makes algorithms actually work in practice for healthcare and health systems—how methods must be designed, tested, and deployed so that they are useful, reliable, and actionable. Methdologically, my group develops methods in causal inference, domain adaptation, representation learning, and multimodal modeling to advance environmental and health research. Examples include analyzing how missing mediators affect causal transportability (CLeaR 2024); developing fairness-aware transfer learning across urban–rural domains (CVPR 2022); introducing augmentation strategies for greenspace detection in underrepresented areas (ACM JCSS 2025); and building multimodal frameworks that integrate satellite, climate, and health data (ACM JCSS 2025). We also study the role of prediction in health models (AJPM 2021; Nat Mach Intell 2021; Soc Ind Res 2024; Lancet Digit Health 2024), create new measures of environmental and social determinants using large-scale data (CVPR CV4GC 2019; Soc Sci Med 2023), and advance segmentation and domain-adaptation techniques for geospatial imagery (CVPR 2022; FAccT 2021; SIGSpatial 2018; PNAS 2024). Notably, we work closely with real-world partners including insurers, health systems such as NYC Health + Hospitals, and city planning agencies—to ensure our methods are grounded in practice. For example, our algorithms have been integrated into safety-net hospitals to mitigate bias in predictive models, and our geospatial work on greenspace is informing the Karachi 2047 Regional Plan. In addition to advancing methods, I am committed to championing the science of how to “think structurally” with data. This includes leading the Data Science for Social Determinants Community of Practice, which brings together researchers and practitioners globally to better capture, organize, and model social and environmental determinants of health. My work has been recognized with awards including [e.g., NSF CAREER, Max Planck Society Sabbatical award, etc.], and my students have received prestigious recognitions such as the Google PhD Fellowship. Lab alumni have gone on to roles in academia, health systems, and technology companies including Amazon, Google, Meta, and Kaiser Health. In recent years, I have also developed a body of work related to cardiovascular disease (JACC 2023, Prog Card Dis 2023, Prev Med 2022) and best practices for teaching in Health Data Science (Harvard Data Sci Review 2022, Lancet Global Health 2023). Please see my Google Scholar page for a full list of publications. *Updates* *My recent OpEd in The Chronicle of Higher Education on how Scholars need to work together across disciplines to shape more-ethical AI systems. Flaws in AI Are Deciding Your Future. Here's How to Fix Them *See our new paper in PNAS on how Utilizing big data without domain knowledge impacts public health decision-making *See our piece in The Lancet Digital Health on The Need for Data Science Methods and Capacity for Incorporating Social Determinants of Health into analytic models *We are launching a new Center for Health Data Science at NYU. Stay tuned for more! *I gave a lecture as part of the Suessmilch Lecture series at the Max Planck Institute for Demographic Research on \"Using Data to Advance the Science of Health Disparities\". Gave a similar talk at the USC Institute on Inequalities in Global Health *I am the PI of a new training program from the NIH: the NYU-Moi Data Science for Social Determinants Training Program Selected Awards and Honors Elected as an ACM Senior Member (2023) Keynote at The Conference on Health, Inference, and Learning (CHIL 2022) Max Planck Sabbatical Award (2021) Invited speaker at NSF Computer and Information Science and Engineering Directorate Career Proposal Writing Workshop (2020) Invited tutorial on Public Health and Machine Learning at ACM Conference on Health, Inference and Learning (2020) [slides, video and paper] Keynote at Human Computation and Crowdsourcing (HCOMP 2019) Invited to speak at Expert Group Meeting at United Nations Population Fund, Advances in mobile technologies for data collection panel (2019) Keynote at ''Mapping the Equity Dimensions of Artificial Intelligence in Public Health'', University of Toronto (2019) Facebook Research Award (2019) Gates Foundation Grand Challenges Exploration Award (3% of proposals selected) (2019) (Press release) NSF CAREER award (2019) MIT Technology Review Top 35 Innovators Under 35 (2014) Work with students: My PhD student Vishwali Mhasawade was recognized with a Google PhD Fellowship. Her growing research portfolio in machine learning, health, and causal modeling will be important to watch! (2021) Best paper honorable mention at ICWSM 2020 Spotlight presentation at Neurips Fair ML for Health workshop (2019) Oral presentation at CVPR Computer Vision for Global Challenges workshop (2019) Second Prize Award for Outstanding Student or Post-Degree Abstract International Society for Disease Surveillance Conference (2016) NYC Media Lab Bloomberg Data for Good Exchange Paper Award (2015) Selected Press \"Finding the Fairness in AI\" ACM News \"Covid-19 Patients Put Remote Care to the Test\" Wall Street Journal \"Cities With More Hateful Tweets Have More Hate Crimes, Study Finds\" VICE \"Text Messages Quickly Track Healthcare Use During Ebola Outbreak\" ACM Technews, also on BBC World Service Radio \"Flu-dunnit\" WNYC \"Scientists are working on ways of predicting where the flu will strike next\" Public Radio International \"Online Platforms to Share Medical Data Launch\" The Scientist \"The Latest Tool for Tracking Obesity? Facebook Likes\" Time \"Disease Sleuths Surf For Outbreaks Online\" NPR \"Twitter data accurately tracked Haiti cholera outbreak\" Nature \"Tracking infectious disease on Twitter\" CNN blog",
  "content_length": 6321,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:27"
}