{
  "name": "Rumyana Neykova",
  "homepage": "https://www.brunel.ac.uk/people/rumyana-neykova",
  "status": "success",
  "content": "Dr Rumyana Neykova | Introduction | Brunel University London Skip to Content Home People Dr Rumyana Neykova Dr Rumyana NeykovaSenior Lecturer in Computer Science Wilfred Brown 210 Email: rumyana.neykova@brunel.ac.uk Tel: +44 (0)1895 265513 Computer Science College of Engineering, Design and Physical Sciences Summary Dr Rumyana Neykova is a lecturer at Brunel University London. She has a PhD from Imperial College London where she was also a fellow and a research associate. Her PhD focuses on development and applications of a type theory (called session types) for runtime verification of concurrent and distributed systems. Her body of work builds on the foundations of concurrency theory and type systems to offer practical, yet rigorous, verification techniques for distributed systems. She utilises type systems, formal methods, model checkers, compiling techniques, and code generation to help prevent communication faults (such as deadlocks and communication mismatches), increase software reliability, improve performance, assist the software development process, and enhance software understanding. Newest selected publications Ibba, G., Neykova, R., Ortu, M., Tonelli, R., Counsell, S. and Destefanis, G. (2025) 'A machine learning approach to vulnerability detection combining software metrics and topic modelling: Evidence from smart contracts'. Machine Learning with Applications, 22. pp. 1 - 18. ISSN: 2666-8270 Open Access Link Journal article Malla, NA., Neykova, R., Destefanis, G. and Tiezzi, F. (2025) 'LLM-Based Translation of Ethereum Solidity Contracts to Algorand Python'.The 7th IEEE International Conference on Decentralized Applications and Infrastructures (IEEE DAPPS 2025). Tucson, AZ, USA. 21 - 24 July. IEEE. pp. 7 - 12. ISSN: 2835-348X Conference paper Neykova, R. and Groen, D. (2025) 'Reversed Model Verification by Inferring Conceptual Models from Simulation Code'.25th International Conference on Compuer Science (ICCS 2025). Singapore. 6 - 9 July. Springer Nature Switzerland. pp. 361 - 368. ISSN: 0302-9743 Open Access Link Conference paper Destefanis, G., Bartolucci, S., Graziotin, D., Neykova, R. and Ortu, M. (2025) 'Introducing Repository Stability'.33rd ACM International Conference on the Foundations of Software Engineering (FSE 2025). Trondheim, Norway. 23 - 27 June. ACM. pp. 555 - 560. ISSN: 1539-7521 Open Access Link Conference paper Neykova, R. and Groen, D. (2025) 'Model input verification of large scale simulations'. Journal of Simulation, 19 (5). pp. 596 - 615. ISSN: 1747-7778 Open Access Link Journal article More publications(25)",
  "content_length": 2591,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:28"
}