{
  "name": "Rune Kristian Lundedal Nielsen",
  "homepage": "https://pure.itu.dk/portal/en/persons/rune-kristian-lundedal-nielsen(80784458-06f6-4eff-b0c8-df982ffa9835).html",
  "status": "success",
  "content": "Rune Kristian Lundedal Nielsen - IT-University of Copenhagen Rune Kristian Lundedal Nielsen PhD Associate Professor, Play, Culture, and AIGames Research GroupAssociate Professor, Center for Digital PlayAcademic Responsible, Game LabHead of Programme, MSc in Games https://orcid.org/0000-0002-7209-9041 Emailrklnitudk 20112025 Research activity per year Personal profile Keywordsaddictionpsychologyyouthgaminggame disorder Fingerprint Dive into the research topics where Rune Kristian Lundedal Nielsen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Gaming Psychology 100% Video Games Keyphrases 71% Gaming Addiction Keyphrases 70% Gambling Psychology 43% Loot Boxes Keyphrases 35% Computer Game Psychology 35% Mental Health Psychology 35% Addiction Keyphrases 34% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2011 2013 2017 2018 2022 2023 2025 11 Journal article 10 Net publication - Internet publication 9 Article in proceedings 6 Book chapter 12 More 6 Conference abstract for conference 1 Book 1 Conference abstract in proceedings 1 Encyclopedia chapter 1 Comment/debate 1 Contribution to newspaper - Feature article 1 PhD thesis Research output per year Research output per year Using Psychophysiological Insights to Evaluate the Impact of Loot Boxes on ArousalTedeschi, G., Nielsen, R. K. L. & Burelli, P., Aug 2025, 2025 IEEE Conference on Games. IEEE, Vol. abs/2507.04906. Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Electrodermal Activity 100% Skin Conductance Response 50% Electrodermal Response 25% Monetisation Strategies 16% Gambling Research 16% Development of the Saini-Hodgins Addiction Risk Potential of Games (SHARP-G) Scale: An International Delphi studySaini, N., Adair, C., King, D. L., Kuss, D. J., Gentile, D. A., Kim, H. S., Edge, J., Billieux, J., Ng, J., Yun, J. P. S., Henkel, L., Faulcon, L., Nogueira, M., Nielsen, R. K. L., Husk, S., Rumble, S., Becker, T. R., Demetrovics, Z. & Hodgins, D. C., 2024, In: Journal of Behavioral Addictions. 13, 2, p. 450-462 13 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Addiction Risk 100% Risk Potential 100% Gaming 100% Delphi Method 100% Lived Experience 60% Clash of ClansNielsen, R. K. L., 22 Aug 2023Research output: Other contribution › Net publication - Internet publication › Communication Counter-Strike 2Nielsen, R. K. L., 12 Oct 2023Research output: Other contribution › Net publication - Internet publication › Communication Open Access Diablo IVNielsen, R. K. L., 14 Sept 2023Research output: Other contribution › Net publication - Internet publication › Communication Open Access View all 48 research outputs Projects Projects per year 2012 2012 2015 2016 2021 2024 2025 5 Finished Projects per year EliteForsk Travel GrantXiao, L. Y. (PI), Nielsen, R. K. L. (PI), Gauffriau, M. (Admin) & Haar, T. (Admin)Danish Agency for Higher Education and Science01/01/2024 → 28/02/2025Project: Research Travel Grant 100% Elite Studies 50% Elite Research 50% Travel Grants 50% Denmark 25% MSG: Making Sense of Games: A Methodology for Humanistic Game AnalysisAarseth, E. (PI), Debus, M. S. (CoI), Jørgensen, I. K. H. (CoI), Blom, J. (CoI), Grabarczyk, P. (CoI), Nielsen, R. K. L. (CoI), Vozaru, M. (CoI), Houe, N. P. (CoI), Grabarczyk, P. (CoI), Jørgensen, I. K. H. (CoI), Blom, J. (CoI) & Bakkerud, F. (CoI)European Commission01/11/2016 → 30/04/2022Project: Research Game Analysis 100% Gamers 66% Making Sense 66% Representation in Games 66% Alien 66% Tietgenprisen 2019Nielsen, R. K. L. (PI)Danish Society for Education and Business01/12/2021 → 30/11/2024Project: Research CDI: Creative Digital IndustriesSicart, M. A. (PI) & Nielsen, R. K. L. (CoI)Innovationsnetværk - Visuel Vækst01/12/2012 → 31/05/2014Project: Research Video Games of Concern and Concerns about Video GamesAarseth, E. (PI), Sørensen, E. (CoI) & Nielsen, R. K. L. (CoI)Independent Research Fund Denmark01/11/2015 → 29/02/2016Project: Research Video Games 100% videogame 100% Addiction 14% Legislators 14% Healthcare Professionals 14% Press/Media Guide til videnskaben på Folkemødet: Se fremtidens hjerneforskning, fermentering og forskerspirerWirman, H. E., Backe, H.-J., Løvlie, A. S. & Nielsen, R. K. L.12/06/20251 Media contributionPress/Media: Press / Media The Sims fylder 25 år: Kender du den tragiske baggrund og det skjulte budskab i spillet?Nielsen, R. K. L.13/02/20251 Media contributionPress/Media: Press / Media Elon Musk beskyldes for at lyve om sine evner til computerspilNielsen, R. K. L.15/01/20251 Media contributionPress/Media: Press / Media TV 2 Go’ morgen Danmark 14.01.2025 09:10Nielsen, R. K. L.14/01/20251 Media contributionPress/Media: Press / Media DR P1 K-Live 14.01.2025 14:03Nielsen, R. K. L.14/01/20251 Media contributionPress/Media: Press / Media View all 160 press/media Activities Activities per year 2011 2011 2012 2013 2014 2017 2018 2019 21 Lecture and oral contribution 9 Organisation and participation in workshop, seminar, course 4 Organisation and participation in conference 1 Consultancy 1 More 1 Visiting an external academic institution Activities per year Afhængig af computerspilNielsen, R. K. L. (Lecturer)4 Dec 2012Activity: Talk or presentation types › Lecture and oral contribution Are Loot Boxes Gambling? Random Reward Mechanisms in Video GamesNielsen, R. K. L. (Speaker) & Grabarczyk, P. (Speaker)26 Jul 2018Activity: Talk or presentation types › Lecture and oral contribution Challenges for Computer Game Addiction as a Mental Health Diagnosis: Motivation and Preliminary findingsNielsen, R. K. L. (Speaker)18 Apr 2014Activity: Talk or presentation types › Lecture and oral contribution Children's Interactions with Emerging Technologies and media literacyNielsen, R. K. L. (Organizer), Froes, I. (Organizer) & Tosca, S. (Organizer)1 Dec 2014 → 3 Dec 2014Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course Chinese Digital Games Research AssociationNielsen, R. K. L. (Participant)18 Apr 2014 → 20 Apr 2014Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course View all 36 activities",
  "content_length": 6735,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:29"
}