{
  "name": "Rune Møller Jensen",
  "homepage": "https://pure.itu.dk/portal/en/persons/rune-moeller-jensen(4d7fda5a-3cf4-4d39-9daf-1ae192b0e0e7).html",
  "status": "success",
  "content": "Rune Møller Jensen - IT-University of Copenhagen Rune Møller Jensen Associate Professor, Data ScienceHead of Center, The Maritime Hub Emailrmjitudk 1997 …2026 Research activity per year Personal profile Research areasFor more than 20 years, I have focused on container vessel stowage planning optimization with derived applications in capacity, network, and revenue management. With a background in symbolic-AI from CMU, I have moved into operations research and analytics. I apply optimization methods such as metaheuristics, constraint programming, and mathematical programming. In addition, I have carried out a wide range of industrial projects including churn prediction, terminal load planning, AIS ship ETA prediction, lashing force regression, and cargo forecasting. I spent half of my time as CEO of Sealytix which is a leading provider of  stowage analytics tools. As head of The Maritime Hub, my mission is to support young researchers at ITU. Link to short CV Some citations to get you through the day. External positionsCEO / Founder, Sealytix1 Jul 2019 → …CEO / Founder, Optivation1 Jun 2007 → 1 Aug 2022 KeywordsStowage optimizationMetaheuristicsMathematical programmingMachine Learning/AIForecasting Fingerprint Dive into the research topics where Rune Møller Jensen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles binary decision diagram Computer Science 100% Container Vessel Keyphrases 85% Stowage Planning Keyphrases 73% Stowage Keyphrases 62% Non-deterministic Keyphrases 56% Liner Shipping Keyphrases 44% Binary Decision Diagram Keyphrases 41% Fleet Repositioning Keyphrases 41% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1997 2002 2003 2004 2010 2011 2012 2013 2019 2022 2025 30 Article in proceedings 15 Report 14 Conference abstract for conference 11 Journal article 17 More 3 Book chapter 3 Paper 3 Conference article 2 Conference abstract in proceedings 2 Patent 1 Book 1 Review 1 Other contribution 1 PhD thesis Research output per year Research output per year Deep Reinforcement Learning for Revenue Management under Uncertainty in Master Stowage Planning on Container Vesselsvan Twiller, J., Adulyasak, Y., Delage, E. & Jensen, R. M., 2025, 25th DNV Nordic Maritime Universities Workshop. p. 63 Research output: Conference Article in Proceeding or Book/Report chapter › Conference abstract in proceedings › Research › peer-review Open AccessFile Container Vessel 100% Stowage Planning 100% Under Uncertainty 100% Revenue Management 100% Deep Reinforcement Learning (deep RL) 100% Navigating Demand Uncertainty in Container Shipping: Deep Reinforcement Learning for Enabling Adaptive and Feasible Master Stowage Planningvan Twiller, J., Adulyasak, Y., Delage, E., Grbic, D. & Jensen, R. M., 18 Feb 2025.Research output: Contribution to conference - NOT published in proceeding or journal › Paper › Research Reinforcement Learning 100% Stowage Planning 100% Deep Reinforcement Learning (deep RL) 100% Container Shipping 100% Demand Uncertainty 100% An Efficient Integer Programming Model for Solving the Master Planning Problem of Container Vessel Stowagevan Twiller, J., Sivertsen, A., Jensen, R. M., Andersen, K. H., Garrido, A. (Editor), Paternina, C. (Editor) & Voß, S. (Editor), Aug 2024, Computational Logistics. Springer, Vol. 15168. p. 236-253 17 p. (Lecture Notes in Computer Science, Vol. 15168).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Free Space 100% Bending Moment 100% Global Supply Chain 100% Optimization Model 100% Named Template 100% Deep Reinforcement Learning for Master Stowage Planningvan Twiller, J., Grbic, D. & Jensen, R. M., 2024, ODYSSEUS 2024: International Workshop on Freight Transportation and Logistics. 9th ed. Carmona, SpainResearch output: Conference Article in Proceeding or Book/Report chapter › Conference abstract in proceedings › Research › peer-review Open AccessFile PPSTOW: An End-to-End Deep Reinforcement Learning Model for Master Stowage Planning on Container Vesselsvan Twiller, J., Grbic, D. & Jensen, R. M., 30 Jun 2024.Research output: Contribution to conference - NOT published in proceeding or journal › Conference abstract for conference › Research › peer-review Open AccessFile Container Vessel 100% Stowage Planning 100% Deep Reinforcement Learning Model 100% Deep Reinforcement Learning 100% Supply Chain Management 100% View all 87 research outputs Projects Projects per year 2008 2008 2009 2010 2012 2014 2016 2022 2023 2024 2026 2029 1 Not started 1 Active 9 Finished Projects per year Containing Stuvning og Fagbog om StuvningsplanerJensen, R. M. (PI), Ajspur, M. L. (CoI) & Pacino, D. (CoI)Den Danske Maritime Fond01/08/2012 → 31/12/2017Project: Research mHub: The Maritime HubJensen, R. M. (PI) & Georgi, L. V. (Admin)Den Danske Maritime Fond01/07/2023 → 31/12/2026Project: Other Maritime 100% Research Partnerships 100% GreenshipJensen, R. M. (PI) & Ajspur, M. L. (CoI)Technical University of Denmark01/01/2014 → 31/07/2016Project: Research Maersk 100% Green Ship 100% Industrial Applications 100% Bridging 100% Subcontractor 100% ENERPLAN: Energy Efficient Transportation PlanningJensen, R. M. (PI) & Tierney, K. (CoI)Innovation Fund Denmark01/01/2009 → 31/08/2014Project: Research Liner Shipping 100% Fleet Repositioning 100% Energy-efficient Transportation 50% Environmental Impact 50% Transportation Sector 50% Maritime Alarm Handling Practices: Existing Challenges and Possible SolutionsJensen, R. M. (CoI), Burelli, P. (CoI) & Nygaard, F. (Admin)01/04/2024 → 31/03/2025Project: Research Handling Practices 100% Alarm Handling 100% Existing Challenges 100% Handling Practice 100% Maritime Industry 66% View all 11 projects Press/Media Ny netværksorganisation skal bygge bro mellem den maritime branche og ITUJensen, R. M.27/06/20231 Media contributionPress/Media: Press / Media Det startede med World of Warcraft. Nu kan Christopher forudsige misbrugeres tilbagefaldJensen, R. M.08/12/20171 Media contributionPress/Media: Press / Media Overlad de rette job til kunstig intelligensJensen, R. M.30/11/20171 Media contributionPress/Media: Press / Media Klumme: Hype om kunstig intelligens er farligBonnet, P. & Jensen, R. M.10/11/20171 Media contributionPress/Media: Press / Media AI-washing er over osJensen, R. M.10/10/20171 Media contributionPress/Media: Press / Media View all 10 press/media Prizes Hede Nielsen-PrisenJensen, R. M. (Recipient), 2005Prize: Prizes, scholarships, distinctions Heuristic Search 100% The McKinsey AwardJensen, R. M. (Recipient), 1998Prize: Prizes, scholarships, distinctions Activities Activities per year 2016 2016 2017 2018 2020 2021 2022 14 Lecture and oral contribution 2 Membership in committee, council, board Activities per year A demonstration of Cargotec’s recent auto-stowage tools for containerships and general cargo vesselsJensen, R. M. (Speaker)30 Oct 2018Activity: Talk or presentation types › Lecture and oral contribution Changing the way you achieve maximum yieldJensen, R. M. (Speaker)4 Oct 2021Activity: Talk or presentation types › Lecture and oral contribution Combining Stowage and Flow OptimizationJensen, R. M. (Speaker) & Ajspur, M. L. (Speaker)18 Mar 2018Activity: Talk or presentation types › Lecture and oral contribution Decision Support for Linershipping: Stowage, Capacity, and Revenue ManagementJensen, R. M. (Speaker)25 Jun 2020Activity: Talk or presentation types › Lecture and oral contribution Introduction to Stowage Planning and StowmanSJensen, R. M. (Speaker)2017Activity: Talk or presentation types › Lecture and oral contribution View all 16 activities",
  "content_length": 8081,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:30"
}