{
  "name": "Runhua Xu",
  "homepage": "https://runhua.me",
  "status": "success",
  "content": "Runhua Xu @ Beihang University Runhua Xu (许,润华) is a Professor in the School of Computer Science and Engineering at Beihang University. Prior to that, he served as a Research Staff Member at IBM Research (AI S&P Solutions team). He earned his Ph.D. in Information Security from the School of Computing and Information, University of Pittsburgh, under the guidance of IEEE Fellow, Prof. James Joshi. He also holds an M.S. in Computer Science from Beihang University, where he was advised by Prof. Bo Lang, and a B.E. in Software Engineering from NWPU. Curriculum Vitae runhua /dot/ xu /at/ buaa /dot/ edu /dot/ cn runhua /dot/ xu /at/ outlook /dot/ com runhua /dot/ xu /at/ pitt /dot/ edu Areas of Specialization Privacy Enhancing Technologies, Federated Learning, Privacy-Preserving Collaborative Learning Applied Crypto, Blockchain, Access Control Security and Privacy Issues in Edge/Cloud Computing Academia Services Journal Services Associated Editor, IEEE Transactions on Dependable and Secure Computing (IEEE TDSC). (2025 - Present) Youth Editorial Board Member, Blockchain. (2025 - Present) Youth Editorial Board Member, Chinese Journal of Electronics (CJE). (2024 - Present) Guest Editor, Special Issue on \"Cyber Security for Multimodal Transport\" in CJE. (Welcome to submit your work by May 31, 2025) Guest Editor, Special Issue on \"Security, Privacy, and Trust in Blockchain and Web 3.0\" in IET Blockchain. (Welcome to submit your work by October 31, 2024) Conference Services SSC Member, The Network and Distributed System Security (NDSS) Symposium (NDSS 2026) TPC Member, The 31st ACM Symposium on Access Control Models and Technologies (ACM SACMAT 2026) TPC Member, The 40th AAAI Conference on Artificial Intelligence (AAAI 2026) TPC Member, The 25th IEEE International Conference on Data Mining (IEEE ICDM 2025) TPC Member, The 30th European Symposium on Research in Computer Security (ACM ESORICS 2025) TPC Member, The 30th ACM Symposium on Access Control Models and Technologies (ACM SACMAT 2025) TPC Member/Publicity Chair, The 15th ACM Conference on Data and Application Security and Privacy (ACM CODASPY 2025) TPC Member, IEEE International Conference on Big Data (IEEE BigData 2021, 2022, 2023, 2024, 2025) Proceeding/Publicity/Workshop/Tutorial Chair, IEEE International Conference on Collaboration and Internet Computing (CIC 2019, 2020, 2021, 2022, 2023, 2024, 2025) Proceeding/Publicity/Workshop/Tutorial Chair, IEEE International Conference on Trust, Privacy and Security in Intelligent Systems, and Applications (TPS 2019, 2020, 2021, 2022, 2023, 2024, 2025) Proceeding/Publicity/Workshop/Tutorial Chair, IEEE International Conference on Cognitive Machine Intelligence (CogMI 2019, 2020, 2021, 2022, 2023, 2024, 2025) Organization Chair, The 2023 International Workshop on Privacy-Preserving Machine Learning (PPML'23) Organization Chair, The 2024 1st Workshop on Large Language Models and Cybersecurity (LLM-CyberSec) Publications All Selected Manuscript Conference Workshop Journal Book Chapter Patent 2025 Chao Li, Runhua Xu, Balaji Palanisamy, Li Duan, Meng Shen, Jiqiang Liu, Wei Wang. “Blockchain Takeovers in web 3.0: An empirical study on the TRON-steem incident”. ACM Transactions on the Web (TWEB). [ arXiv ] [ ACM] [ DOI ] all-pub, journal-pub, selected-pub 2025 Xingchen Sun, Runhua Xu, Wei Ni, Li Duan, Chao Li. “DeFeed: Secure Decentralized Cross-Contract Data Feed in Web 3.0 for Connected Autonomous Vehicles”. ACM Transactions on Autonomous and Adaptive Systems (TAAS). [ arXiv ] [ ACM ] [ DOI ] all-pub, manuscript-pub, selected-pub 2025 Zhiyong Jin, Runhua Xu, Chao Li, Yizhong Liu, Jianxin Li, James Joshi. “Sparsification Under Siege: Defending Against Poisoning Attacks in Communication-Efficient Federated Learning”. (under peer review). [ arXiv ] 2025 Qianren Mao, Qili Zhang, Hanwen Hao, Zhentao Han, Runhua Xu, Weifeng Jiang, Qi Hu, Zhijun Chen, Tyler Zhou, Bo Li, Yangqiu Song, Jin Dong, Jianxin Li, Philip S Yu. “Privacy-preserving federated embedding learning for localized retrieval-augmented generation”. (under peer review). [ arXiv ] all-pub, manuscript-pub 2025 Yizhong Liu, Zixiao Jia, Xiao Chen, Song Bian, Runhua Xu, Dawei Li, Yuan Lu. “Aion: Robust and Efficient Multi-Round Single-Mask Secure Aggregation Against Malicious Participants”. In Proceedings of 34th USENIX Security Symposium (USENIX Security 25). [ USENIX ] all-pub, conference-pub, selected-pub 2025 Shiqi Gao, Tianxiang Gong, Zijie Lin, Runhua Xu, Haoyi Zhou, Jianxin Li. “FLUE: Streamlined Uncertainty Estimation for Large Language Models”. In Proceedings of The 39th Annual AAAI Conference on Artificial Intelligence (AAAI '25). Philadelphia, PA, USA. all-pub, conference-pub, selected-pub 2025 Runhua Xu, Nathalie Baracaldo Angel, Hayim Shaul, Omri Soceanu. \"Private vertical federated learning\" US Patent 12,192,321, filed January 7, 2025. [ Link ] all-pub, patent-pub 2024 Runhua Xu, Shiqi Gao, Chao Li, James Joshi, Jianxin Li. “Dual Defense: Enhancing Privacy and Mitigating Poisoning Attacks in Federated Learning”. In Proceedings of The Thirty-eighth Annual Conference on Neural Information Processing Systems (NeuraIPS '24). Vancouver, British Columbia, Canada. [ OpenReview ] all-pub, conference-pub, selected-pub 2024 Shiqi Gao, Tianyu Chen, Mingrui He, Runhua Xu, Haoyi Zhou, Jianxin Li. \"PE-Attack: On the Universal Positional Embedding Vulnerability in Transformer-Based Models.\" IEEE Transactions on Information Forensics and Security (IEEE TIFS). [ IEEE ] [ DOI ] all-pub, selected-pub, journal-pub 2024 Eyal Kushnir, Hayim Shaul, Omri Soceanu, Ehud Aharoni, Nathalie Baracaldo Angel, Runhua Xu, Heiko H Ludwig. \"Secure reordering using tensor of indicators.\" Patent Application 17/895,711, filed March 14, 2024. [ Link ] all-pub, patent-pub 2024 Runhua Xu, Nathalie Baracaldo Angel, Hayim Shaul, Omri Soceanu. \"Private vertical federated learning\" Patent Application 17/875,987, filed Feberary 1, 2024. [ Link ] all-pub, patent-pub 2024 Runhua Xu, Bo Li, Chao Li, James Joshi, Shuai Ma and Jianxin Li. \"TAPFed: Threshold Secure Aggregation for Privacy-Preserving Federated Learning.\" IEEE Transactions on Dependable and Secure Computing (IEEE TDSC). [ arXiv ] [ IEEE ] [ DOI ] all-pub, selected-pub, journal-pub 2023 Ali Anwar, Yi Zhou, Nathalie Baracaldo Angel, Runhua Xu, Yuya Jeremy Ong, Annie K Abay, Heiko H Ludwig, Gegi Thomas, Jayaram Kallapalayam Radhakrishnan, Laura Wynter. \"Grouped aggregation in federated learning.\" Patent Application 17/807,871, filed December 21, 2023. [ Link ] all-pub, patent-pub 2023 Shiqiang Wang, Timothy John Castiglia, Nathalie Baracaldo Angel, Stacy Elizabeth Patterson, Runhua Xu,Yi Zhou. \"Vertical federated learning with secure aggregation.\" Patent Application 17/838,445, filed December 14, 2023. [ Link ] all-pub, patent-pub 2023 Chao Li, Balaji Palanisamy, Runhua Xu, Li Duan, Jiqiang Liu and Wei Wang. “How Hard is Takeover in DPoS Blockchains? Understanding the Security of Coin-based Voting Governance”. In Proceedings of the 2023 ACM SIGSAC Conference on Computer and Communications Security (CCS '23). Association for Computing Machinery, New York, NY, USA, 150-164. (Distinguished Paper Award) [ arXiv ] [ ACM ] [ DOI ] all-pub, conference-pub, selected-pub 2023 Chao Li, Runhua Xu, and Li Duan. “Liquid democracy in DPoS blockchains”. Proceedings of the 5th ACM International Symposium on Blockchain and Secure Critical Infrastructure, pp. 1148-52. [ arXiv ] [ DOI ] all-pub, conference-pub 2023 Chao Li, Runhua Xu, and Li Duan. “Characterizing Coin-Based Voting Governance in DPoS Blockchains”. Proceedings of the International AAAI Conference on Web and Social Media, Vol. 17, pp. 1148-52. [ PDF ] [ DOI ] all-pub, conference-pub 2023 Chao Li, Balaji Palanisamy, Runhua Xu, and Li Duan. “Cross-Consensus Measurement of Individual-level Decentralization in Blockchains”. IEEE 9th Intl Conference on Big Data Security on Cloud (BigDataSecurity 2023), New York, NY, USA, 2023, pp. 45-50. [ IEEE ] [ DOI ] all-pub, conference-pub 2023 Nathalie Baracaldo, Runhua Xu, Yi Zhou, Ali Anwar, and Heiko Ludwig. \"Efficient private vertical federated learning.\" U.S. Patent 11,588,621, issued February 21, 2023. [ Link ] all-pub, patent-pub 2022 Runhua Xu, Chao Li and James Joshi. \"Blockchain-Based Transparency Framework for Privacy Preserving Third-Party Services,\" in IEEE Transactions on Dependable and Secure Computing, vol. 20, no. 3, pp. 2302-2313, 1 May-June 2023. doi: 10.1109/TDSC.2022.3179698. [ pdf ] [ arXiv ] [ IEEE ] [ DOI ] all-pub, selected-pub, journal-pub 2022 Runhua Xu, Nathalie Baracaldo, Yi Zhou, Ali Anwar, Heiko Ludwig. \"DeTrust-FL: Efficient Privacy-Preserving Federated Learning in Decentralized Trust Setting.\" In 2022 IEEE International Conference on Cloud Computing (IEEE CLOUD 2022), Hybrid event in Barcelona, Spain, IEEE 2022. (Best Paper Award) [ pdf ] [ arXiv ] [ slides ] all-pub, selected-pub, conference-pub 2022 Nathalie Baracaldo and Runhua Xu. \"Protecting Against Data Leakage in Federated Learning: What Approach Should You Choose?\" Federated Learning: A Comprehensive Overview of Methods and Applications. Ludwig, H., Baracaldo, N. (eds). Springer, Cham. pp.281–312. 2022. [ Springer Link ] all-pub, selected-pub, chapter-pub 2022 Runhua Xu, Nathalie Baracaldo, Yi Zhou, Annie Abay, and Ali Anwar. \"Privacy-Preserving Vertical Federated Learning.\" Federated Learning: A Comprehensive Overview of Methods and Applications. Ludwig, H., Baracaldo, N. (eds). Springer, Cham. pp.417-438. 2022. [ Springer Link ] all-pub, selected-pub, chapter-pub 2021 Runhua Xu, Nathalie Baracaldo and James B.D. Joshi. \"Privacy-Preserving Machine Learning: Methods, Challenges and Directions .\" (preprint) [ arXiv ] all-pub, selected-pub, manuscript-pub 2021 Runhua Xu, Nathalie Baracaldo, Yi Zhou, Ali Anwar, James Joshi, Heiko Ludwig. \"FedV: Privacy-Preserving Federated Learning over Vertically Partitioned Data.\" In Proceedings of the 14th ACM Workshop on Artificial Intelligence and ",
  "content_length": 17180,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:28"
}