{
  "name": "Ruoming Jin",
  "homepage": "http://www.cs.kent.edu/~jin",
  "status": "success",
  "content": "Ruoming Jin's homepage! Hi, this is Ruoming Jin's homepage I am an associate professor in the Computer Science Department, Kent State University. My general research interests are on Data Mining, Database, Biomedical Informatics and Cloud Computing. My current research focus is on Big Data, especially, Big Graph Data! My group is developing novel algorithmic and system solutions to manage and analyze massive graph and network data. We also work on the applications of graph/network mining on semantic web, social network, biomedical informatics, and transportation systems. CV (updated at 5/2/2012) Teaching St: Big Data & Analytics (CS4/6/79995), Spring/2014 Recent Publications (DBLP and Google Scholar) Network Science and Graph Mining Yelong Shen, Ruoming Jin, Dejing Dou, Nafisa Chowdhury, Junfeng Sun, Brigitte Piniewski, and David Kil, Socialized Gaussian Process Model for Human Behavior Prediction in a Health Social Network, ICDM'12. Yelong Shen and Ruoming Jin, Learning personal + social latent factor model for social recommendation, KDD'12. Ruoming Jin, Victor E. Lee, and Hui Hong, Axiomatic Ranking of Network Role Similarity, in KDD'11. Ning Ruan, Ruoming Jin, and Yan Huang, Distance Preserving Graph Simplification, in ICDM'11. Haishan Liu, Paea LePendu, Ruoming Jin, and Dejing Dou, A Hypergraph-based Method for Discovering Semantically Associated Itemsets, in ICDM'11. Charu Aggrawal, Yao Li, Philip Yu, and Ruoming Jin, On Dense Pattern Mining in Graph Streams, in VLDB'10. Ning Ruan, Ruoming Jin, Victor Lee, and Kun Huang,  A Sparsification Approach for Temporal Graphical Model Decomposition, in ICDM'09. Uncertain Graph Lin Liu, Ruoming Jin, Charu Aggrawal, and Yelong Shen, Reliable Clustering on Uncertain Graphs, ICDM'12. Ruoming Jin, Lin Liu, Charu C. Aggarwal, Discovering Highly Reliable Subgraphs in Uncertain Graphs, in KDD'11. Ruoming Jin, Lin Liu, Bolin Ding, and Haixun Wang, Distance-Constraint Realiability Computation in Uncertain Graphs, in VLDB'11. Graph Databases Ruoming Jin, Ning Ruan, Saikat Dey, and Jeffrey Yu Xu, SCARAB: Scaling Reachability Computation on Large Graphs, SIGMOD'12. Ruoming Jin, Ning Ruan, Yang Xiang, and Victor Lee, A Highway-Centric Labeling Approach for Answering Distance Queries on Large Sparse Graphs, SIGMOD'12. Jun Gao, Ruoming Jin, Jiashuai Zhou, Jeffrey Xu Yu, Xiao Jiang, Tengjiao Wang, Relational Approach for Shortest Path Discovery over Large Graphs, in VLDB'12. Jun Gao, Jeffrey Xu Yu, Ruoming Jin, Jiashui Zhou, Tengjiao Wang, and Dongqiang Yang, Neighborhood-Privacy Protected Shortest Distance Computing in Cloud, in SIGMOD'11. Ruoming Jin, Hui Hong, Haixun Wang, Ning Ruan, and Yang Xiang, Computing Label Constraint Reachability in Graph Databases, in SIGMOD'10. Ruoming Jin, Ning Ruan, Yang Xiang, and Haixun Wang, Path-tree: An efficient reachability indexing scheme for large directed graphs. ACM Trans. Database Syst. 36(1): 7 (2011), Journal Version of SIGMOD'08 Paper: Efficiently Answering Reachability Query in Very Large Directed Graphs. Ruoming Jin, Yang Xiang, Ning Ruan, and Dave Fuhry, 3-HOP: A High-Compression Indexing Scheme for Reachability Query, in SIGMOD'09. Others Bolin Ding, Haixun Wang, Ruoming Jin, and Jiawei Han, and Zhongyuan Wang, Optimizing Index for Taxonomy Keyword Search, SIGMOD'12. Yang Xiang, Ruoming Jin, David Fuhry, and Feodor Dragan, Summarizing transactional databases with overlapped hyperrectangles. Data Min. Knowl. Discov. 23(2): 215-251 (2011), Journal Version of KDD'08 Paper:  Succinct summarization of transactional databases: an overlapped hyperrrectangle scheme. Ruoming Jin, Yang Xiang, Hui Hong and Kun Huang, Block Interaction: A Generative Summarization Scheme for Frequent Patterns, in UP'10 (Link, Slides). Ruoming Jin, Yang Xiang, and Lin Liu, Cartesian Contour: A Concise Representation for a Collection of Frequent Sets, in KDD'09. Xiaoxi Du, Ruoming Jin, Liang Ding, Victor Lee, and John Thornton, Migration Motif: A spatial-temporal pattern mining approach for financial market, in KDD'09. Ruoming Jin, Yang Xiang, Dave Fuhry, and Feodor Dragan, Overlapping Matrix Pattern Visualization: a Hypergraph Approach, in ICDM'08. Ruoming Jin, Muad Abu-Ata, Yang Xiang, and Ning Ruan, Effective and efficient itemset pattern summarization: regression-based approaches, in KDD'08. Contact Information Office: MCS 264, Kent State University Tel: (330)672-9063 Email: my last name at cs dot kent dot edu",
  "content_length": 4445,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:30"
}