{
  "name": "Ruonan Liu",
  "homepage": "https://automation.sjtu.edu.cn/Ruonan",
  "status": "success",
  "content": "上海交通大学自动化系 JC登陆 下载 English 投票/问卷调查 系况介绍 系情概况 领导介绍 行政机构 历史沿革 学科建设 师资队伍 师资概况 知名学者 教师名录 教师风采 退休教师 人才培养 本科教学 研究生教学 教学成果 办事指南 科学研究 科研概况 科研基地 科研团队 党建活动 校友资讯 部分系友 系友专栏 招生招聘 招生信息 师资招聘 信息发布 新闻动态 通知公告 学术交流 政策指南 汶川地震17年后，少年在交大圆了“报国梦” MORE 海外优青 | 上海交通大学自动化与感知学院竭诚邀请全球英才 MORE 巾帼英姿展风华 | 热烈祝贺我系陈彩莲教授荣获2024年度全国三八红旗手 MORE +1！我系《运动控制系统》入选上海市一流本科课程 MORE 祝贺！关新平教授团队荣获2023年度上海市技术发明奖一等奖！ MORE 祝贺！自动化系学子荣获IEEE CASE唯一最佳应用论文奖 MORE 师资队伍 师资概况 知名学者 教师名录 教师风采 退休教师 刘若楠 职称：长聘教轨副教授邮箱：ruonan.liu@sjtu.edu.cn地址：闵行校区电信群楼2号楼个人主页：https://ruonanliu.com实验室主页：https://ipac.sjtu.edu.cn 个人简介 刘若楠，博士生导师，德国洪堡学者，中国科协青年托举人才 目前课题组经费和计算资源充足，欢迎自动化、计算机、机械工程以及其他相关专业的同学Email简历来实验室开展本科、硕士、博士研究工作。 2024 - 至今    上海交通大学 自动化系  长聘教轨副教授 2019 - 2024  天津大学 人工智能学院  长聘/英才副教授 2017 - 2019  卡耐基梅隆大学 计算机科学学院 联合培养博士/博士后研究员 2009 - 2019  西安交通大学 机械工程 本硕博连读 科研方向 具身智能、视觉导航、人机交互 高端装备智能运维、预测性维护 科研项目 主持 国自然面上项目 开放环境连续视觉语言导航及其自主进化研究 主持 新一代人工智能国家科技重大专项子课题 主持 国自然青年项目 小样本下动态图网络的鲁棒学习研究 主持 青年人才托举工程 机器学习 主持 天津市应用基础研究项目 知识与数据联合驱动的可解释图神经网络研究 主持 国防基础科研计划重点项目课题 XX系统XX定位、诊断与预测 主持 CCF-百度松果基金 融合知识的图神经网络计算研究 参与 973项目“航空发动机运行安全基础研究” 参与 Deep Intermodal Video Analytics (DIVA) Program (Supported by IARPA via DOI/IBC Department Contract number D17PC00340) 荣誉及学术任职 2021年 IEEE Transactions on Industrial Informatics 最佳论文奖（IF 12.3） 2021年-至今 全球前2%顶尖科学家（World's Top 2% Scientists） 2022年 德国洪堡学者、中国科协青年托举人才 2024年 IJCAI Runner-up Paper Award 2024年 福建省科学技术一等奖、中国商业联合会科学技术一等奖、中国航海学会科学技术一等奖 2024年 指导学生获中国机器人大赛暨RoboCup机器人世界杯中国赛一等奖 2024年-至今 IEEE Senior Member、CAAI/CAA具身智能专委会委员、CCF智能机器人执委 2025年-至今 Co-EiC of IEEE Transactions on Industrial Cyber-Physical Systems，Chair of IEEE Reliability Society Shanghai Chapter 2025年 自然资源科学技术奖一等奖 2025年 New Generation Star Project, IROS 2025 Best Paper Finalist*2 代表性论文 [43]Peng J, Lin D, Xu Z, Lu H, Liu R*, et al. FreeMem: Enhancing Consistency in Long Video Generation via Tuning-Free Memory[C]. The Fortieth AAAI Conference on Artificial Intelligence (AAAI 2025). [42]Zhang X, Xu Y, Li J, Liu R, Hu Z. Agent Journey Beyond RGB: Hierarchical Semantic-Spatial Representation Enrichment for Vision-and-Language Navigation[C]. The Fortieth AAAI Conference on Artificial Intelligence (AAAI 2025). [41]Liu R, Hu P, Zhao S, Lin D*, Zhang W. Causal Counterfactual Faithfulness Generation for Open set Fault Diagnosis of Complex Industrial Processes[J]. IEEE Transactions on Industrial Informatics, 2025. [40]Dong H, Wang X, Lin D, Liu R*, et al. NoiseController: Towards Consistent Multi-view Video Generation via Noise Decomposition and Collaboration[C]. International Conference on Computer Vision (ICCV 2025). [39]Jiang Z, Liu R*, Zhou Y, et.al. PhysGCN-DL: Physics-Informed Graph Convolutional Networks with Diversity-Aware Loss Optimization for Multimodal Pedestrian Trajectory Prediction[C]. IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2025). (同时入选两个领域Best Paper Award Finalist) [38]Liu R, Wu S, Lin D*, Zhang W. CVLN-Think: Causal Inference with Counterfactual Style Adaptation for Continuous Vision-and-Language Navigation[C]. IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2025). [37]Liu R, Hu X, Jiang Z, et al. Survey on heterogeneous aquatic robot systems: communication, perception, navigation, control, decision-making and energy management[J]. Robot Learning, 2025. [36]Li Z, Liu R*, Chen D, et al. OR-Gate Mixup Multi-Scale Spectral Graph Neural Network for Node Anomaly Detection[J]. IEEE Transactions on Neural Networks and Learning Systems, 2025. [35]Ge T, Zhao S, Ma S, Liu R*. Anomaly Detection of Marine Engines using Graph Network AutoEncoder with Multi-scale Feature Fusion[C]. The 23rd IEEE International Conference on Industrial Informatics (INDIN 2025). [34]Yang B, Zhang J, Liu R*, Lin D, et al. Point-to-Set Metric-Gated Mixture of Experts for Multi-Source Domain Adaptation Fault Diagnosis[J]. IEEE Transactions on Neural Networks and Learning Systems, 2025. [33]Zhang R, Lin D, Wang X, Liu R, et al. Temporal-Interim Pose Synthesis and Distillation for Dynamic Human Pose Estimation[J]. IEEE Transactions on Neural Networks and Learning Systems, 2025. [32]Wu S, Liu R*, Xie Z, et al. Map-SemNav: Advancing Zero-Shot Continuous Vision-and-Language Navigation through Visual Semantics and Map Integration[C]. IEEE International Conference on Robotics and Automation (ICRA 2025). [31]Kong P, Liu R*, Xie Z, et al. VLN-KHVR: Knowledge-and-History Aware Visual Representation for Continuous Vision-and-Language Navigation[C]. IEEE International Conference on Robotics and Automation (ICRA 2025). [30] Liu R, Wu S, Liu Q, et al. Rectified Flow-Based Generative Transfer Learning for System Fault Diagnosis[C]. IEEE International Conference on Vision, Image and Signal Processing (ICVISP), 2024. (Best Paper Award) [29] Liu R, Zhao S, Pang Z, et al. Out-of-Distribution Fault Diagnosis of Industrial Cyber-physical Systems Based on Orthogonal Anchor Clustering with Adaptive Balance[J]. IEEE Transactions on Industrial Cyber-Physical Systems, 2024. [28]Yu W,  Liu R*, Chen D, et. al. Explainability Enhanced Object Detection Transformer with Feature Disentanglement[J]. IEEE Transactions on Image Processing, 2024. [27] Liu R, Wu S, Kong P, et. al. Robust Object Recognition in Open Environments Based on Causal Inference[C]. International Conference on Robotics, Control and Automation Engineering (RCAE), 2024. (Best Paper Award) [26]Wang L, Lin D, Yang K, Liu R*, Guo Q, et. al. Voxel Proposal Network via Multi-Frame Knowledge Distillation for Semantic Scene Completion[C]. Neural Information Processing Systems (NeurIPS 2024). [25] Liu R, Xie Y, Lin D*, et. al. Information-based Gradient Enhanced Causal Learning Graph Neural Network for Fault Diagnosis of Complex Industrial Processes[J]. Reliability Engineering & System Safety, 2024. [24]Zhang X, Hu Z, Liu R, et al. Fault Detection of Unmanned Surface Vehicles: The Fuzzy Multi-Processor Implementation[J]. IEEE Transactions on Fuzzy Systems, 2024. [23] Liu R, Kong P, Zhang W. Multiple Visual Features in Topological Map for Vision-and-Language Navigation[C]. 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2024). [22]Jin C, Yang B,  Liu R. Improved VLN-BERT with Reinforcing Endpoint Alignment for Vision-and-Language Navigation[C]. International Joint Conference on Artificial Intelligence (IJCAI 2024).  (Runner-up Paper Award) [21] Liu R, Kong P, Wu S, Zhang W. RewardVLN: An Improved Agent Navigation Based on Visual-Instruction Alignment[C]. The IEEE International Conference on Advanced Robotics and Mechatronics (IEEE ARM 2024).  (Best Paper Award Finalist) [20] Liu R, Zhang Q, Lin D*, et al. Causal Disentangled Graph Neural Network for Fault Diagnosis of Complex Industrial Process[J]. IEEE Transactions on Industrial Informatics, 2024. [19] Liu R, Zhang Q, Han T*, et al. Survey on Foundation Models for Prognostics and Health Management in Industrial Cyber-Physical Systems[J]. IEEE Transactions on Industrial Cyber-Physical Systems, 2024. [18] Liu R, Zhang Q, Lin D*, et al. Causal intervention graph neural network for fault diagnosis of complex industrial processes[J]. Reliability Engineering & System Safety, 2024. [17]Cheng P, Ye S,  Liu R, et al. SMC-Based Bounded Consensus Tracking for Multiagent Systems Under Stochastic DoS Attacks With Applications to Multiple DC Motors[J]. IEEE Transactions on Industrial Informatics, 2024. [16] Liu R, Xiao D, Lin D*, et al. Intelligent Bearing Anomaly Detection for Industrial Internet of Things Based on Auto-Encoder Wasserstein Generative Adversarial Network[J]. IEEE Internet of Things Journal, 2024. [15] Liu R, Zhang Q, Wang Y*, et al. Industrial Big Data Analytical System in Industrial Cyber-Physical Systems Based on Coarse-to-Fine Deep Network[J]. IEEE Transactions on Industrial Cyber-Physical Systems, 2023. [14] Chen D, Xie Z,  Liu R*, et al. Bayesian hierarchical graph neural networks with uncertainty feedback for trustworthy fault diagnosis of industrial processes[J]. IEEE Transactions on Neural Networks and Learning Systems , 2023. [13] Wang H, Liu R*, Ding S X, et al. Causal-Trivial Attention Graph Neural Network for Fault Diagnosis of Complex Industrial Processes[J]. IEEE Transactions on Industrial Informatics, 2023. [12] Lin D, Wang X, Shen J, Zhang R, Liu R, et al. Generative Status Estimation and Information Decoupling for Image Rain Removal[C] //Advances in Neural Information Processing Systems (NeurIPS 2022). [11] Chen D, Liu R*, Hu Q, et al. Interaction-Aware Graph Neural Networks for Fault Diagnosis of Complex Industrial Processes[J]. IEEE Transactions on Neural Networks and Learning Systems, 2021.(ESI, Hot Paper) [10] Chen H, Liu R*, Xie Z, et al. Majorities Help Minorities: Hierarchical Structure Guided Transfer Learning for Few-shot Fault Recognition[J]. Pattern Recognition, 2021: 108383 [9] Hu Y, Liu R*, Li X, et al. Task-Sequencing Meta Learning for Intelligent Few-Shot Fault Diagnosis with Limited Data[J]. IEEE Transactions on Industrial Informatics, 2021.(ESI) [8]Wang Y, Liu R*, Lin D, et al, Coarse-to-Fine: Progressive Knowledge Transfer Based Multi-Task Convolutional Neural Network for Intelligent Large-Scale Fault Diagnosis[J]. IEEE Transactions on Neural Networks and Learning Systems, 2021. [7] Wang F, Liu R*, Hu Q, et al. Cascade convolutional neural network with progressive optimization for motor fault diagnosis under nonstationary conditions[J]. IEEE Transactions on Industrial Informatics, 2020, 17(4): 2511-2521 [6] Liu R, Wang F, Yang B*, et al. Multi-scale Kernel based Residual Convolutional Neural Network for Motor Fault Diagnosis Under Non-stationary Conditions[J]. IEEE Transactions on Industrial Informatics, 2019.(ESI) [5] Yang B, Liu R*, Zio E. Remaining useful life prediction based on a double-convolutional neural network architecture[J]. IEEE Transactions on Industrial Electronics, 2019, 66(12): 9521-9530.(ESI) [4]Liu R, Yang B*, Hauptmann A G. Simultaneous Bearing Fault Recognition and Remaining Useful Life Prediction Using Joint-Loss Convol",
  "content_length": 11008,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:28"
}