{
  "name": "Ruoyu Li 0003",
  "homepage": "https://ruoyu-li.github.io",
  "status": "success",
  "content": "Ruoyu Li (李若愚) email: liry@szu.edu.cn office: Zhi Teng Building #931, Canghai Campus About me This is the homepage of Ruoyu Li (Roy, 李若愚). I am an Assistant Professor with the College of Computer Science and Software Engineering at Shenzhen University (see my official website here), collaborating with Professor Laizhong Cui. In 2024, I received my Ph.D. degree in Computer Science and Technology from Tsinghua University, where I was part of Smart Internet Group (SIG) and was advised by Professor Yong Jiang and Doctor Qing Li. During that time, I also served as a research intern at Peng Cheng Laboratory (PCL). In 2019, I received my M.S. degree in Computer Science (Security Track) from Columbia University, where I was advised by Professor Henning Schulzrinne (IEEE & ACM Fellow) and Doctor Gaston Ormazabal. In 2017, I received my B.Eng. degree in Information Security from Huazhong University of Science and Technology, where I was advised by Professor Peng Xu. Research Interests My primary research areas include data-driven network security, IoT security, programmable networking, and trustworthy AI. I have been engaged in long-term research in fields such as encrypted traffic analysis, botnet and DDoS detection and prevention, IoT anomaly detection, AI-enabled network monitoring, explainable machine learning, and programmable data plane. Recently, I am exploring the development of foundation models for network security by LLMs. My long-term goal is to build network security frameworks with better intelligence, efficiency, robustness, and usability that effectively reduce the labor intensity of cybersecurity industry. News Jul 2025 Our book chapter ‘‘Security and Privacy in Smart Homes: Challenges and Latest Developments’’ is released! May 2025 Our paper QueryAttack is accepted by ACL 2025! Mar 2025 I receive the SZCCF Outstanding Doctoral Dissertation Award! Nov 2024 I join Shenzhen University and serve as an Assistant Professor! Sep 2024 Our paper about XAI is accepted by NeurIPS 2024! Jul 2024 Our paper IoTGemini is accepted by IEEE TMC! Jun 2024 Our paper SeIoT is accepted by IEEE TIFS! May 2024 I defend my Ph.D. dissertation “Data-Driven Network Traﬀic Monitoring towards IoT Cyberattacks”! May 2024 Our paper DeviceRadar is accepted by IEEE/ACM ToN! Dec 2023 Our paper Genos is accepted by INFOCOM 2024! Selected Publications ToN ’24 DeviceRadar: Online IoT Device Fingerprinting in ISPs Using Programmable Switches Ruoyu Li, Qing Li, Tao Lin, Qingsong Zou, Dan Zhao, Yucheng Huang, Gareth Tyson, Guorui Xie, and Yong Jiang IEEE/ACM Transactions on Networking, 2024 Abs DOI Bib Device fingerprinting can be used by Internet Service Providers (ISPs) to identify vulnerable IoT devices for early prevention of threats. However, due to the wide deployment of middleboxes in ISP networks, some important data, e.g., 5-tuples and flow statistics, are often obscured, rendering many existing approaches invalid. It is further challenged by the high-speed traffic of hundreds of terabytes per day in ISP networks. This paper proposes DeviceRadar, an online IoT device fingerprinting framework that achieves accurate, real-time processing in ISPs using programmable switches. We innovatively exploit “key packets” as a basis of fingerprints only using packet sizes and directions, which appear periodically while exhibiting differences across different IoT devices. To utilize them, we propose a packet size embedding model to discover the spatial relationships between packets. Meanwhile, we design an algorithm to extract the “key packets” of each device, and propose an approach that jointly considers the spatial relationships and the key packets to produce a neighboring key packet distribution, which can serve as a feature vector for machine learning models for inference. Last, we design a model transformation method and a feature extraction process to deploy the model on a programmable data plane within its constrained arithmetic operations and memory to achieve line-speed processing. Our experiments show that DeviceRadar can achieve state-of-the-art accuracy across 77 IoT devices with 40 Gbps throughput, and requires only 1.3% of the processing time compared to GPU-accelerated approaches. @article{lideviceradar2024, author = {Li, Ruoyu and Li, Qing and Lin, Tao and Zou, Qingsong and Zhao, Dan and Huang, Yucheng and Tyson, Gareth and Xie, Guorui and Jiang, Yong}, journal = {IEEE/ACM Transactions on Networking}, title = {DeviceRadar: Online IoT Device Fingerprinting in ISPs Using Programmable Switches}, year = {2024}, volume = {32}, number = {5}, pages = {3854-3869}, doi = {10.1109/TNET.2024.3398778}, } TMC ’24 IoTGemini: Modeling IoT Network Behaviors for Synthetic Traffic Generation Ruoyu Li, Qing Li, Qingsong Zou, Dan Zhao, Xiangyi Zeng, Yucheng Huang, Yong Jiang, Feng Lyu, Gaston Ormazabal, Aman Singh, and Henning Schulzrinne IEEE Transactions on Mobile Computing, 2024 Abs DOI Bib Synthetic traffic generation can produce sufficient data for model training of various traffic analysis tasks for IoT networks with few costs and ethical concerns. However, with the increasing functionalities of the latest smart devices, existing approaches can neither customize the traffic generation of various device functions nor generate traffic that preserves the sequentiality among packets as the real traffic. To address these limitations, this paper proposes IoTGemini, a novel framework for high-quality IoT traffic generation, which consists of a Device Modeling Module and a Traffic Generation Module. In the Device Modeling Module, we propose a method to obtain the profiles of the device functions and network behaviors, enabling IoTGemini to customize the traffic generation like using a real IoT device. In the Traffic Generation Module, we design a Packet Sequence Generative Adversarial Network (PS-GAN), which can generate synthetic traffic with high fidelity of both per-packet fields and sequential relationships. We set up a real-world IoT testbed to evaluate IoTGemini. The experiment result shows that IoTGemini can achieve great effectiveness in device modeling, high fidelity of synthetic traffic generation, and remarkable usability to downstream tasks on different traffic datasets and downstream traffic analysis tasks. @article{liiotgemini2024, author = {Li, Ruoyu and Li, Qing and Zou, Qingsong and Zhao, Dan and Zeng, Xiangyi and Huang, Yucheng and Jiang, Yong and Lyu, Feng and Ormazabal, Gaston and Singh, Aman and Schulzrinne, Henning}, journal = {IEEE Transactions on Mobile Computing}, title = {IoTGemini: Modeling IoT Network Behaviors for Synthetic Traffic Generation}, year = {2024}, volume = {23}, number = {12}, pages = {13240-13257}, doi = {10.1109/TMC.2024.3426600}, } TIFS ’24 SeIoT: Detecting Anomalous Semantics in Smart Homes via Knowledge Graph Ruoyu Li, Qing Li, Yucheng Huang, Qingsong Zou, Dan Zhao, Zhengxin Zhang, Yong Jiang, Fa Zhu, and Athanasios V. Vasilakos IEEE Transactions on Information Forensics and Security, 2024 Abs DOI Bib Existing IoT Network Anomaly Detection Systems (NADSes) typically treat IoT devices as independent entities and model them by Euclidean space features. These approaches suffer from low accuracies on new attacks (e.g., platform-based attacks and evasion attacks), since they do not fully consider the semantic information including traffic periodicity and device/environment interactions. In this paper, we propose SeIoT, a knowledge graph-based bimodal anomaly detection framework for smart homes. We propose a knowledge graph structure to represent the semantic information of a smart home. First, we propose the Action Fingerprint module, an efficient and effective traffic classification approach to extract the device actions and features required by the knowledge graph. Then, we propose a bimodal anomaly detection framework including interaction-related and time-related detectors to detect the knowledge graph. We propose a feature separation-based heterogeneous graph attention network that can accurately model the interactions among devices and environments, and a method to represent traffic periodicity for the time-related detector. For evaluation, we set up a real-world testbed and evaluate the detection performance of both device-targeted attacks and platform-based attacks. Experiment results show that SeIoT can achieve better detection capability than prior work on both of the attacks. @article{liseiot2024, author = {Li, Ruoyu and Li, Qing and Huang, Yucheng and Zou, Qingsong and Zhao, Dan and Zhang, Zhengxin and Jiang, Yong and Zhu, Fa and Vasilakos, Athanasios V.}, journal = {IEEE Transactions on Information Forensics and Security}, title = {SeIoT: Detecting Anomalous Semantics in Smart Homes via Knowledge Graph}, year = {2024}, volume = {19}, number = {}, pages = {7005-7018}, doi = {10.1109/TIFS.2024.3428856}, } NeurIPS ’24 Dissect Black Box: Interpreting for Rule-Based Explanations in Unsupervised Anomaly Detection Yu Zhang*, Ruoyu Li*, Nengwu Wu, Qing Li, Xinhan Lin, Yang Hu, Tao Li, and Yong Jiang In Proceedings of Advances in Neural Information Processing Systems, Vancouver, Canada, Dec 2024 Abs Bib PDF In high-stakes sectors such as network security, IoT security, accurately distinguishing between normal and anomalous data is critical due to the significant implications for operational success and safety in decision-making. The complexity is exacerbated by the presence of unlabeled data and the opaque nature of black-box anomaly detection models, which obscure the rationale behind their predictions. In this paper, we present a novel method to interpret the decision-making processes of these models, which are essential for detecting malicious activities without labeled attack data. We put forward the Segmentation Clustering Decision Tree (SCD-Tree), designed to dissect and understand the structure of normal data distributions. The SCD-Tree integrates predictions from the anomaly detection model into its",
  "content_length": 16736,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:29"
}