{
  "name": "Rupak Majumdar [SWS]",
  "homepage": "https://www.mpi-sws.org/~rupak",
  "status": "success",
  "content": "Home Page of Rupak Majumdar Rupak Majumdar Ph.D., University of California at Berkeley, 2003. Scientific Director, Max Planck Institute for Software Systems Computer Science Research at the Max Planck Society Biographical Sketch   Curriculum Vitae (pdf) I am also associated with the Automated Reasoning Group in AWS. Office: Max Planck Institute for Software Systems Room 414 Paul Ehrlich Str. 26 67663 Kaiserslautern, Germany Phone + 49 (631) 9303-8500 Email:  rupak at m p i - s w s. org Academics My research interests are computer-aided verification and control of reactive, real-time, hybrid, and probabilistic systems, software verification and programming languages, logic, and automata theory. List of Publications at DBLP Current Post-Docs Khushraj Madnani A.R. Balasubramanian Current Students Mahmoud Salamati Ashwani Anand V.R. Sathiyanarayana Mohammad Khoshechin Selected Graduated Students and Postdocs Manav Mital (MS): Now at Cyral Jeff Fischer: Robust service composition: Now at c9 RuGang Xu: Symbolic execution algorithms for test generation: Now at Susquehanna International Group Michael Emmi: Now at Amazon Rafit Izhak-Ratzin: Now at Robin Systems Pierre Ganty: Now at IMDEA Software Majid Zamani: Now at CU Boulder Indranil Saha: Now at IIT Kanpur Vinayak Prabhu: Now at Colorado State University Dmitry Chistikov: Now at Warwick Rayna Dimitrova: Now at CISPA Johannes Kloos: Now at Diffblue Filip Niksic: Now at Google Sadegh Soudjani: Now at Newcastle Anne-Kathrin Schmuck: Now at MPI-SWS Burcu Ozkan: Now at TU Delft Natsuki Urabe Jie An Jaroslav Bendik (now at Certora) Jiarui Gan (now at Oxford) Kaushik Mallik (now at IMDEA Software, Madrid) Ivan Gavran (now at Informal Systems) Ramanathan Thinniyam (now at Uppsala) Aman Shankar Mathur (now at Siemens) Felix Stutz (now at Uni Luxembourg) Personal Blog Academic Genealogy: Rupak Majumdar → Tom Henzinger → Zohar Manna's descendants and ancestors. Imprint / Data Protection Rupak Majumdar,",
  "content_length": 1970,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:32"
}