{
  "name": "Rupesh Nasre",
  "homepage": "http://www.cse.iitm.ac.in/~rupesh",
  "status": "success",
  "content": "Rupesh Nasre. Rupesh Nasre., CSE, IITM Home | Mentoring | Teaching | Research | Service | Contact Licensing Patents Get in touch if interested. Address Sanitizer for AMD GPUs Software Testing Auto-Generate Parallel Code for Multiple Platforms Bug Identification with Ontology ICPC Sponsorship Our students going to ICPC World Finals are looking for funds. Please support them. Events & Announcements CSE Course Portal NSM Nodal Centre Python Book on Teaching and Others Teaching@IIT Initiative My Teachers' Day Speech Teaching Award Acceptance Speech Article in The Hindu Article on India HPC Article on Student Engagement in Class Survey on Student Engagement Open TCF: I encourage keeping teacher course feedback public. Rupesh is a faculty member in the CSE Department at IIT Madras. He completed BE from VRCE Nagpur, MTech from IIT Bombay, PhD from IISc Bangalore, and Post-Doctoral Fellowship from the University of Texas at Austin. His research focus is in Compilers and Parallelization. He is a recipient of the Excellence in Teaching Award at IIT Madras, APJ Abdul Kalam Cray HPC Award, NVIDIA Special Prize for CodeForScience, and ICPC Coach Award. He chaired the Curriculum Task Force 2024 which recommended the new BTech curriculum at IIT Madras. He holds ten patents, has contributed to 8 PhD theses, and is an author of two books. He is an associate editor of the CCPE journal and is a Coordinator of the NSM Nodal Center at IIT Madras for Training in HPC and AI. And an illeist is a person who refers to himself in the third person. Rupesh is a proud alumnus of the following institutions / companies: UT Austin (where I learned parallel programming in Keshav Pingali's group) IISc Bangalore (where R. Govindarajan taught me how to do research) IIT Bombay (where I learned keyword searching in relational databases) VRCE Nagpur (which built my foundation in computing) NetApp Bangalore (I still miss the Friday Bash) VERITAS Pune (my first stint as a software engineer) Rupesh's group, named Gajendra, has received the following honors: Anju co-won the IBM Best PhD thesis award in the department in 2024. Shouvick Mondal received the Honorable Mention in 2021. Tejasvi Malladi, Barenya Nandi, Shahbaz Husain won the H N Mahabala Award for the Best MTP in the department in 2025, 2024, 2020. Ashwina Kumar and Nibedita Behera's proposal was selected for Qualcomm Innovation Fellowship 2023. StarPlat's Sycl backend was featured at Intel. Dileep Pattipati, Shouvick Mondal, Saurabh Kalikar received the Institute Research Awards in 2022, 2021, 2019. Vimarsh's BTP with NVIDIA won the Prof. C S Krishnamoorthy Endowment Prize in 2022. Saurabh Kalikar co-won the Distinguished Paper Award at PPoPP 2016 at Barcelona. The paper was invited to the TOPC journal. Anurag Ingole co-won the Best Paper Award at HiPC Student Research Symposium 2015. News Sep 25: Robert's work on parallel XML parsing is accepted at HiPC. Sep 25: Rupesh talks about Parallel Graph Algorithms at KLA Conference. Aug 25: Dhruv's work on address sanitizer for AMD GPUs is patented. Aug 25: Anirudh joins the group for MS. Jul 25: Rupesh lectures on GPU Programming at KLA. Jun 25: Tejasvi wins H N Mahabala Award for the Best MTP in the department. Jun 25: Python Programming book is now available in Gujarati, Hindi, Malayalam, and Telugu. May 25: Goodbye Abhirup, Pritam, SB, Tejasvi; Harshitha, Jash, Saran, Shruthi, Vedang; Shweta.",
  "content_length": 3419,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:31"
}