{
  "name": "Ruqi Zhang",
  "homepage": "https://ruqizhang.github.io",
  "status": "success",
  "content": "Ruqi Zhang Ruqi Zhang I am an Assistant Professor in the Department of Computer Science at Purdue University. Before that, I was a postdoctoral fellow at Institute for Foundations of Machine Learning, UT Austin. I completed my PhD at Cornell University, where I was advised by Chris De Sa. I am looking for highly motivated students (PhD, MS, undergrads, and interns) to join our lab. If you are interested, feel free to reach out. We are hiring Postdocs through IPAI Fellowships and Gilbreth Fellowships. If you're interested in working with me, please get in touch. News [10/2025] Gave an invited talk at Monte Carlo Seminar on Gradient-Based Discrete Sampling: Algorithms and Applications. Check out video and slides. [9/2025] 2 papers were accepted by NeurIPS 2025. [8/2025] Grateful to receive support from NSF IIS RI for our research on gradient-based discrete sampling. [8/2025] 1 paper was accepted by EMNLP 2025. [7/2025] 3 papers were accepted by COLM 2025. [6/2025] Gave an invited talk at Midwest Machine Learning Symposium 2025 on Capable and Reliable LLMs via Probabilistic Modeling. Check out slides. [6/2025] 2 papers on probabilistic agent prediction & planning were accepted by IROS 2025. [6/2025] Grateful to receive the Amazon Research Award to study test-time alignment. [4/2025] Will give an invited talk at IJCAI 2025 Workshop on User-Aligned Assessment of Adaptive AI Systems. [4/2025] Gave an invited talk at Morgan Stanley Machine Learning External Speaker Series. [2/2025] Co-organizing Midwest Machine Learning Symposium 2025. [2/2025] Co-organizing 7th Symposium on Advances in Approximate Bayesian Inference. [01/22/2025] 2 papers were accepted by ICLR 2025 and 1 paper was accepted by AISTATS 2025. [12/17/2024] Selected for AAAI-25 New Faculty Highlights program. [12/15/2024] Area Chair for ICML 2025. [11/14/2024] Serve as Action Editor for TMLR. [09/25/2024] 1 paper was accepted by NeurIPS 2024. [07/15/2024] Co-organizing NeurIPS 2024 Workshop on ML with New Compute Paradigms. [07/02/2024] Co-organizing 6th Symposium on Advances in Approximate Bayesian Inference. [07/01/2024] 1 paper was accepted by IROS 2024. [05/02/2024] Grateful to receive the Institute for Physical Artificial Intelligence (IPAI) Postdoctoral Research Program Fund. [05/02/2024] 1 paper was accepted by ICML 2024. [04/16/2024] Area Chair for NeurIPS 2024. [04/2024] 2 papers were accepted by TMLR. [01/16/2024] 2 papers were accepted by ICLR 2024. [01/16/2024] Area Chair for UAI 2024. [12/16/2023] Gave an invited talk and attended the panel at NeurIPS 2023 Workshop on ML with New Compute Paradigms. My talk starts at 2:33:25. [09/22/2023] 1 paper was accepted by NeurIPS 2023. [08/20/2023] Area Chair for AISTATS 2024. [07/28/2023] Gave an invited talk at ICML 2023 Workshop on Structured Probabilistic Inference & Generative Modeling. My talk starts at 5:32:25. [06/26/2023] 1 paper was accepted at AIES 2023 as Oral Presentation. [05/30/2023] Grateful to receive the Ross-Lynn Research Scholar Fund. [04/24/2023] 1 paper was accepted by ICML 2023. [03/18/2023] Co-organizing ICML 2023 Workshop on Sampling and Optimization in Discrete Space. [02/28/2023] Co-organizing 5th Symposium on Advances in Approximate Bayesian Inference. See you in Hawaii! [01/20/2023] 1 paper was accepted by ICLR 2023! [01/20/2023] 1 paper was accepted by AISTATS 2023! [10/06/2022] Invited talk at Center for Data Science and Machine Learning, National University of Singapore [09/14/2022] 1 paper was accepted by NeurIPS 2022! [05/15/2022] 2 papers were accepted by ICML 2022! [11/04/2021] Gave a talk at Simons Institute, UC Berkeley on Scalable and Reliable Inference for Probabilistic Modeling. Check out the video! [10/18/2021] Will be co-organizing 4th Symposium on Advances in Approximate Bayesian Inference. Show More Research Interests I am interested in developing scalable, reliable and efficient probabilistic methods for machine learning and generative AI. Our work bridges theoretical foundations and practical implementations, aiming to address fundamental challenges in building trustworthy and efficient AI systems. Currently, I focus on the following key directions: (1) alignment and safety of foundation models, including LLMs, VLMs, and diffusion models; (2) Probabilistic inference, uncertainty estimation, and Bayesian methods; and (3) Generation and learning on discrete data. Publications CANDI: Hybrid Discrete-Continuous Diffusion Models Patrick Pynadath, Jiaxin Shi, Ruqi Zhang Preprint, 2025 [Paper][Project Page] VERA-V: Variational Inference Framework for Jailbreaking Vision-Language Models Qilin Liao, Anamika Lochab, Ruqi Zhang Preprint, 2025 [Paper] Single-Step Consistent Diffusion Samplers Pascal Jutras-Dube, Patrick Pynadath, Ruqi Zhang Preprint, 2025 Oral Presentation at MMLS 2025, top 12% [Paper] Exploring Non-Convex Discrete Energy Landscapes: An Efficient Langevin-Like Sampler with Replica Exchange Haoyang Zheng, Hengrong Du, Ruqi Zhang, Guang Lin The 40th Annual AAAI Conference on Artificial Intelligence (AAAI), 2026 [Paper] Gradient GA: Gradient Genetic Algorithm for Drug Molecular Design Debadyuti Mukherjee, Chris Zhuang, Yingzhou Lu, Tianfan Fu, Ruqi Zhang Transactions on Machine Learning Research (TMLR), 2025 [Paper][Code] VERA: Variational Inference Framework for Jailbreaking Large Language Models Anamika Lochab, Lu Yan, Patrick Pynadath, Xiangyu Zhang, Ruqi Zhang Neural Information Processing Systems (NeurIPS), 2025 [Paper][Code] Sherlock: Self-Correcting Reasoning in Vision-Language Models Yi Ding, Ruqi Zhang Neural Information Processing Systems (NeurIPS), 2025 [Paper][Code][Project Page] Reward-Shifted Speculative Sampling Is An Efficient Test-Time Weak-to-Strong Aligner Bolian Li, Yanran Wu, Xinyu Luo, Ruqi Zhang The Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 [Paper][Code] Energy-Based Reward Models for Robust Language Model Alignment Anamika Lochab, Ruqi Zhang Conference on Language Modeling (COLM), 2025 [Paper][Code] Cascade Reward Sampling for Efficient Decoding-Time Alignment Bolian Li, Yifan Wang, Anamika Lochab, Ananth Grama, Ruqi Zhang Conference on Language Modeling (COLM), 2025 [Paper][Code] More is Less: The Pitfalls of Multi-Model Synthetic Preference Data in DPO Safety Alignment Yifan Wang, Runjin Chen, Bolian Li, David Cho, Yihe Deng, Ruqi Zhang, Tianlong Chen, Zhangyang Wang, Ananth Grama, Junyuan Hong Conference on Language Modeling (COLM), 2025 [Paper] On Learning Closed-Loop Probabilistic Multi-Agent Simulator Juanwu Lu, Gupta Rohit, Ahmadreza Moradipari, Kyungtae Han, Ruqi Zhang, Ziran Wang International Conference on Intelligent Robots and Systems (IROS), 2025 [Paper][Code] Dynamic Obstacle Avoidance through Uncertainty-Based Adaptive Planning with Diffusion Vineet Punyamoorty, Pascal Jutras-Dube, Ruqi Zhang, Vaneet Aggarwal, Damon Conover, Aniket Bera International Conference on Intelligent Robots and Systems (IROS), 2025 [Paper][Code] CoT-UQ: Improving Response-wise Uncertainty Quantification in LLMs with Chain-of-Thought Boxuan Zhang, Ruqi Zhang Findings of The Annual Meeting of the Association for Computational Linguistics (ACL), 2025 [Paper][Code] STACEY: Promoting Stochastic Steepest Descent via Accelerated lp-Smooth Nonconvex Optimization Xinyu Luo, Site Bai, Bolian Li, Petros Drineas, Ruqi Zhang, Brian Bullins International Conference on Machine Learning (ICML), 2025 [Paper][Code] Bayesian Computation in Deep Learning Wenlong Chen, Bolian Li, Ruqi Zhang, Yingzhen Li In 2nd edition of the Handbook of Markov Chain Monte Carlo, 2025 [Paper] Reheated Gradient-based Discrete Sampling for Combinatorial Optimization Muheng Li, Ruqi Zhang Transactions on Machine Learning Research (TMLR), 2025 [Paper][Code] ETA: Evaluating Then Aligning Safety of Vision Language Models at Inference Time Yi Ding, Bolian Li, Ruqi Zhang International Conference on Learning Representations (ICLR), 2025 [Paper][Code][Project Page] Controlled LLM Decoding via Discrete Auto-regressive Biasing Patrick Pynadath, Ruqi Zhang International Conference on Learning Representations (ICLR), 2025 [Paper][Code][Project Page] Optimal Stochastic Trace Estimation in Generative Modeling Xinyang Liu, Hengrong Du, Wei Deng, Ruqi Zhang International Conference on Artificial Intelligence and Statistics (AISTATS), 2025 [Paper][Code] Making Reliable and Flexible Decisions in Long-tailed Classification Bolian Li, Ruqi Zhang Transactions on Machine Learning Research (TMLR), 2025 [Paper][Code] Adaptive Draft-Verification for Efficient Large Language Model Decoding Xukun Liu, Bowen Lei, Ruqi Zhang, Dongkuan Xu The 39th Annual AAAI Conference on Artificial Intelligence (AAAI), 2025 [Paper][Code][Project Page] Gradient-based Discrete Sampling with Automatic Cyclical Scheduling Patrick Pynadath, Riddhiman Bhattacharya, Arun Hariharan, Ruqi Zhang Neural Information Processing Systems (NeurIPS), 2024 [Paper][Code] Adaptive Planning with Generative Models under Uncertainty Pascal Jutras-Dube, Ruqi Zhang, Aniket Bera International Conference on Intelligent Robots and Systems (IROS), 2024 [Paper][Code] Position Paper: Bayesian Deep Learning in the Age of Large-Scale AI Theodore Papamarkou, Maria Skoularidou, [and 20+ authors], Ruqi Zhang International Conference on Machine Learning (ICML), 2024 [Paper] Enhancing Low-Precision Sampling via Stochastic Gradient Hamiltonian Monte Carlo Ziyi Wang, Yujie Chen, Qifan Song, Ruqi Zhang Transactions on Machine Learning Research (TMLR), 2024 [Paper][Code] Embracing Unknown Step by Step: Towards Reliable Sparse Training in Real World Bowen Lei, Dongkuan Xu, Ruqi Zhang, Bani K Mallick Transactions on Machine Learning Research (TMLR), 2024 [Paper][Code] Training Bayesian Neural Networks with Sparse Subspace Variational Inference Junbo Li, Zichen Miao, Qiang Qiu, Ruqi Zhang International Conference on Learning Representations (ICLR), 2024 [Paper][Code] Entropy-MCMC: Sampling from Flat Basins with Ease Bolian Li, Ruqi Z",
  "content_length": 15658,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:31"
}