{
  "name": "Rushikesh Joshi",
  "homepage": "https://www.cse.iitb.ac.in/~rkj",
  "status": "success",
  "content": "Homepage of Rushikesh K. Joshi IIT Bombay Rushikesh K. Joshi Professor Department of Computer Science & Engineering Indian Institute of Technology Bombay Powai, Mumbai-400076, India Ph:+91-22-25767730 Email: rkj@cse.iitb.ac.in with IIT Bombay since 1997 Computational Models for Programs, their Structures and Dynamics: processes, interactions, program structures, abstractions, conceptual models, ontology, meta-models, specifications, design, analysis, refactoring, concurrency, distribution, parallelism. Read Course Syllabus and Organization for the current course (Jan 2025) CS 770 Process Engineering Other courses recently taught: CS 787 Language Engineering for Complex Programs: A C++ Perspective (was offered in the previous semester ) CS 757 Design and Re-engineering of Object Oriented Programs (was offered in the previous year) CS 152, cs 154 Abstractions and Paradigms for Programming (was offered recently-2020, 2021, 2022) Course List Research grants/fellowships./. Honorary work Publications A few Recent papers (dblp) Charu Agarwal, Rushikesh K. Joshi Automation Strategies for Unconstrained Crossword Puzzle Generation. CoRRabs/2007.04663 (2020)  link Karnika Shivhare, Rushikesh K. Joshi Process Line Diagrams (PLDs): An Approach for Modular Process Modeling ISEC2023: 16th Innovations in Software Engineering ConferenceFebruary, 2023. link Karnika Shivhare, Rushikesh K. Joshi Trace Language: Mining Micro-configurations from Process Transition Traces International Workshop on Petri Nets and Software Engineering 2022, PNSEâ22 link Ahana Pradhan, Rushikesh K. Joshi A Taxonomy of Consistency Models in Dynamic Migration of Business Processes, IEEE Transactions on Services Computing, Volume 11 Issue 3, May-June 2018. link Ravikumar Gelli, S.A. Khaparde, Rushikesh K. Joshi, Integration of Process Model and CIM to Represent Events and Chronology in Power System Processes, IEEE Systems Journal, Volume 12, Issue 1, March 2018  link Vrinda Yadav, Rushikesh K. Joshi, and Sea Ling. Evolution Traceability Roadmap for Business Processes. In Proceedings of the 12th Innovations on Software Engineering Conference 2019 link Omkarendra Tiwari, Rushikesh K. Joshi Extract Method Refactoring by Successive Edge Contraction arXiv:1908.04636  2019  link Ph.D. Students (current) Karnika Shivhare Ph.D. Students (advised) Dr. Omkarendra Tiwari Dr. Vrinda Yadav (Co guided with Prof. Sea Ling, Monash University) Dr. Ahana Pradhan Dr. Ravikumar Gelli (Co guided with Prof. S.A. Khaparde, EE, IIT Bombay) Dr. Pradeep Yemula (Co guided with Prof. S.A. Khaparde, EE, IIT Bombay) Dr. Dharmendra Yadav Dr. Arvind Kiwelekar Dr. Padmaja Joshi M.S. Students (advised) Sagar Tamhane Kalyan Chakrawarthy Amita Sharma M.Tech and B.Tech Student thesis + interns students : advised around 100 thesis Downloads (from past projects) Project Pages from the group ARC Website Anonymous Remote Computing Project (Parallel Computing Platform on Linux/Unix) ArcSharp Anonymous Remote Computing with C# (Parallel Computing Plaform for .NET C#) PICS A Purely Interconnected Component System (List programming, ideas) Filter Objects/Aspects/Concerns Filter Objects project  (Extension to OOPLs) Constore Graph Database (Storage system) Ox The Ox project on Object Identification from Procedural Programs (Code Refactoring applied to Linux Kernel) Arts section I play musical instruments, sing, love to cook and experiment, occasionally, write poetry, prose, and make sketches and drawings. Enjoy these short clips Sitar Harmonium Flute Keyboard",
  "content_length": 3535,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:31"
}