{
  "name": "Ruslan Nikolaev 0001",
  "homepage": "https://rusnikola.github.io",
  "status": "success",
  "content": "Ruslan Nikolaev Ruslan Nikolaev Ph.D., Assistant ProfessorThe Pennsylvania State University Email: rnikola {AT} psu.edu I am an Assistant Professor with the Department of Computer Science and Engineering at Penn State. Prior to that, I worked as a Research Assistant Professor at Systems Software Research Group (Virginia Tech) led by Prof. Binoy Ravindran. Before my academic career, I worked as a Senior Software Engineer with Pure Storage, Inc. and as a Software Engineer with Microsoft Corporation. I completed my Ph.D. in Computer Science at Virginia Tech in 2013. My Ph.D. advisor was Prof. Godmar Back. Research interests: Operating systems, concurrency, algorithms, virtualization, file systems, storage, networking. I am recruiting students. Please send me an email if you are interested. Contact: W331 Westgate Building, University Park, PA 16802 LinkedIn GitHub Google Scholar Committee Service Program Committee: USENIX ATC 2022, USENIX ATC 2023, KISV 2023 (co-located w/ ACM SOSP), ACM PODC 2024, USENIX ATC 2025, SYSTOR 2025, KISV 2025 (co-located w/ ACM SOSP), DISC 2025, PLDI 2026 Publicity Chair: HotStorage 2022 Journals: IEEE TPDS 2020 and 2021, ACM TECS 2021 and 2022 Subreviewer: DISC 2018, DISC 2019, and SYSTOR 2020 Current Students Md Amit Hasan Arovi (Ph.D.), advising since Fall 2022. Yanlin Du (Ph.D.), advising since Fall 2023. Xi Wang (Ph.D.), advising since Fall 2023. Yubo Wang (M.S. thesis), advising since Spring 2025. Daniil Rose (undergraduate research), since Spring 2024. Past Students Chitrang Goyani (M.S. non-thesis project), Spring 2024, now with Laborup. Jugal Rawlani (M.S. non-thesis project), Spring 2024, now with Oracle. Niramay Vaidya (M.S non-thesis project), Spring 2023, now with ARM. Ajay Pradeep (M.S. non-thesis project), Spring 2023. Joshua Famous (M.S. non-thesis project), Summer 2023, now with Appian Corporation. Past Mentees Mincheol Sung (Ph.D.), Spring 2023, now with Microsoft. A K M Fazla Mehrab (Ph.D.), Spring 2023, now with ByteDance. Hassan Nadeem (M.S. thesis), Spring 2020, now with Bloomberg LP. Publications RRR-SMR: Reduce, Reuse, Recycle: Better Methods for Practical Lock-Free Data Structures. Md Amit Hasan Arovi and Ruslan Nikolaev. In the Proceedings of the 2025 ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI'25). Seoul, Republic of Korea. (ACM Artifacts Available V1.1 , ACM Artifacts Evaluated Reusable V1.1 .) [Paper, Slides, and Source Code] Scalable and Fault-Tolerant Storage and File System Services with Non-Blocking Synchronization for Private Clouds. Mincheol Sung, Ruslan Nikolaev, and Binoy Ravindran. Accepted to the Proceedings of the 16th ACM Symposium on Cloud Computing (SOCC'25). [Paper] Parsec: Fast, Scalable, and Secure Design with Wait-Free Parallelism. Ruslan Nikolaev. In the Proceedings of the 16th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys'25). Seoul, Republic of Korea. [Paper and Slides] reInstruct: Toward OS-aware CPU microcode reprogramming. Yubo Wang, Ruslan Nikolaev, and Binoy Ravindran. In the Proceedings of the 3rd Workshop on Kernel Isolation, Safety and Verification (KISV'25). Seoul, Republic of Korea. [Paper and Slides] Joyride: Rethinking Linux's network stack design for better performance, security, and reliability. Yanlin Du and Ruslan Nikolaev. In the Proceedings of the 3rd Workshop on Kernel Isolation, Safety and Verification (KISV'25). Seoul, Republic of Korea. [Paper and Slides] Brief Announcement: SCOT: Fix non-blocking data structures, not memory reclamation. Md Amit Hasan Arovi and Ruslan Nikolaev. In the Proceedings of the 37th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA'25). Portland, OR. [Paper, Full (arXiv) Paper, Slides, and Source Code] A Family of Fast and Memory Efficient Lock- and Wait-Free Reclamation. Ruslan Nikolaev and Binoy Ravindran. In the Proceedings of the 2024 ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI'24). Copenhagen, Denmark. (ACM Artifacts Available V1.1 , ACM Artifacts Evaluated Reusable V1.1 .) [Paper, Slides, and Source Code] wCQ: A Fast Wait-Free Queue with Bounded Memory Usage. Ruslan Nikolaev and Binoy Ravindran. In the Proceedings of the 34th ACM Symposium on Parallelism in Algorithms and Architectures (SPAA'22). Philadelphia, PA, USA. [Paper, Slides, and Source Code] POSTER: wCQ: A Fast Wait-Free Queue with Bounded Memory Usage. Ruslan Nikolaev and Binoy Ravindran. In Proceedings of the 27th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming (PPoPP'22). Seoul, Republic of Korea. [Paper, Full (arXiv) Paper, Slides, and Source Code] Kite: Lightweight Critical Service Domains. A K M Fazla Mehrab, Ruslan Nikolaev, and Binoy Ravindran. In the Proceedings of the 17th European Conference on Computer Systems (EuroSys'22). Rennes, France. (ACM Artifacts Evaluated - Functional , ACM Artifacts Available , ACM Results Reproduced .) [Paper and Source Code] Adelie: Continuous Address Space Layout Re-Randomization for Linux Drivers. Ruslan Nikolaev, Hassan Nadeem, Cathlyn Stone, and Binoy Ravindran. In the Proceedings of the 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS'22). Lausanne, Switzerland. (ACM Artifacts Evaluated - Functional , ACM Artifacts Available , ACM Results Reproduced .) [Paper, Slides, and Source Code] Brief Announcement: Crystalline: Fast and Memory Efficient Wait-Free Reclamation. Ruslan Nikolaev and Binoy Ravindran. In Proceedings of the 35th International Symposium on Distributed Computing (DISC'21). Freiburg, Germany. [Paper, Full (arXiv) Paper, Slides, Video, and Source Code] Snapshot-Free, Transparent, and Robust Memory Reclamation for Lock-Free Data Structures. Ruslan Nikolaev, and Binoy Ravindran. In the Proceedings of the 42nd ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI'21). (ACM Artifacts Evaluated - Functional , ACM Artifacts Available , ACM Artifacts Evaluated Reusable .) [Paper, Slides, Poster, Video, and Source Code] LibrettOS: A Dynamically Adaptable Multiserver-Library OS. Ruslan Nikolaev, Mincheol Sung, and Binoy Ravindran. In Proceedings of the 16th ACM SIGPLAN/SIGOPS International Conference on Virtual Execution Environments (VEE'20). Lausanne, Switzerland. [Paper, Slides, Video, Source Code, and Website] Universal Wait-Free Memory Reclamation. Ruslan Nikolaev and Binoy Ravindran. In Proceedings of the 25th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming (PPoPP'20). San Diego, CA, USA. (ACM Artifacts Evaluated - Functional , ACM Artifacts Available , ACM Artifacts Results Replicated .) [Paper, Slides, and Source Code] A Scalable, Portable, and Memory-Efficient Lock-Free FIFO Queue. Ruslan Nikolaev. In Proceedings of the 33rd International Symposium on Distributed Computing (DISC'19). Budapest, Hungary. [Paper, Slides, and Source Code] Brief Announcement: Hyaline: Fast and Transparent Lock-Free Memory Reclamation. Ruslan Nikolaev and Binoy Ravindran. In Proceedings of the 38th ACM Symposium on Principles of Distributed Computing (PODC'19). Toronto, ON, Canada. [Paper, Full (arXiv) Paper, Slides, and Source Code] VirtuOS: An Operating System with Kernel Virtualization. Ruslan Nikolaev and Godmar Back. In Proceedings of the 24th ACM Symposium on Operating Systems Principles (SOSP'13), pp.116-132. Farmington, PA, USA. [Paper, Slides, Video, Poster, and Source Code] Perfctr-Xen: a framework for performance counter virtualization. Ruslan Nikolaev and Godmar Back. In Proceedings of the 7th ACM SIGPLAN/SIGOPS international conference on Virtual Execution Environments (VEE'11), pp.15-26. Newport Beach, CA, USA. [Paper, Slides, Poster, and Source Code] Talks Wait-free memory reclamation and data structures. Ruslan Nikolaev. Hydra 2020: Concurrent and distibuted computing conference (July 6-9, 2020, Online.) [Link, Video, Slides] Open Source Activity Over the years, I contributed code to various open-source projects. Some examples where my code ended up upstreamed are: LLVM/clang compiler, NetBSD, Info-ZIP (ubiquitous zip/unzip archiver), RHash (tool with numerous hash-sum functions), GNU GRUB 2 bootloader, and Syllable OS. Please also see the native UEFI shim, a fork of Red Hat's UEFI shim (hosted on my github). The fork is completely standalone and does not use gnu-efi with ELF wrappers. Instead, it uses native UEFI compilation with the PE/COFF output format. Due to much better linking, it also drastically reduces executable image sizes. Past Work Experience Virginia Tech, ECE, Research Assistant Professor, 2017-2021 Pure Storage, Senior Software Engineer, 2014-2017 Microsoft, Software Engineer, 2014 VMware, Software Engineer (Intern), Summer 2012 Microsoft, Software Engineer (Intern), Summer 2011 ABBYY, Software Engineer, 2007 Disclaimer: Any information presented on this web page in part or in whole cannot be redistributed without a written permission of the author. Any paper, source code or other outside material are distributed under their corresponding copyright and licensing terms. Any views, opinions and positions of the author do not necessarily represent views, opinions and positions of any past or present employers, an affiliated person or companies.",
  "content_length": 9314,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:31"
}