{
  "name": "Russell Harmer",
  "homepage": "http://perso.ens-lyon.fr/russell.harmer",
  "status": "success",
  "content": "Russ Harmer russ harmerrussell point harmer arobase ens tiret lyon point fr. Chargé de Recherche (CRHC) au CNRS. Équipe Plume (LIP, CNRS - ENS Lyon - UCBL1 - Université de Lyon). Membre de la commission des thèses du LIP. Bureau M7-307, 46 allée d'Italie, 69364 LYON Cedex 07. google scholar. HAL. séminaires / seminarsLe groupe de travail de l'équipe Plume. Séminaire mensuel CHoCoLa. GReTA seminar: graph transformation theory and applications (scientific committee). événements / eventsarXiv W3C Workshop on Web Standardization for Graph Data (invited participant). 3rd Joint International GRADES-NDA Workshop (PC member). 4th Joint International GRADES-NDA Workshop (PC member). 15th International Conference on Graph Transformation (PC member). 6th Joint International GRADES-NDA Workshop (PC member). 16th International Conference on Graph Transformation (PC member). 7th Joint International GRADES-NDA Workshop (PC member). 17th International Conference on Graph Transformation (co-chair). enseignement / teachingarXiv UCBL1 BDW1 (Bases de données et programmation web), groupe TP, 2019/20 (L2). ENS Lyon M2IF CR03 (Graph-based knowledge representation), 2019/20-2020/21 (M2). With Angela Bonifati. projets / projectsExecutable Knowledge (DARPA Big Mechanism). Active Context (DARPA CwC bio-curation use case). BioQurate (FIL projet transversal). CoREACT (Agence Nationale de la Recherche). développement logiciel / software developmentKAMI (Knowledge Aggregator and Model Instantiator) and the KAMIStudio environment. More detail on the overall Kappa project. ReGraph: graph rewriting library in Python. publications#PA = proof assistants, #GDB = graph DBs, #KR = knowledge representation, #GR = graph rewriting Formalizing adhesive category theory in Rocq. #GR #PA Samuel Arsac, Russ Harmer and Damien Pous. JFLA'25 (2025). A living monograph for graph transformation. #GR #KR Nicolas Behr and Russ Harmer. ICGT'23 (2023). Fundamentals of compositional rewriting theory. #GR Nicolas Behr, Russ Harmer and Jean Krivine. JLAMP 135, 100893 (2023). Concurrency theorems for non-linear rewriting theories. #GR Nicolas Behr, Russ Harmer and Jean Krivine. ICGT'21 (2021). arXiv. Schema inference for property graphs. #GDB Angela Bonifati, Russ Harmer and Hanâ Lbath. BDA'20 (2020). EDBT'21 (2021). Reversibility and composition of rewriting in hierarchies. #KR #GR Russ Harmer and Eugenia Oshurko. GCM'20 (2020). EPTCS 330, pp. 145--162 (2020). Knowledge representation and update in hierarchies of graphs. #GDB #KR #GR Russ Harmer and Eugenia Oshurko. JLAMP 114, 100559 (2020). Schema validation and evolution for graph databases. #GDB #KR #GR Angela Bonifati, Peter Furniss, Alastair Green, Russ Harmer, Eugenia Oshurko and Hannes Voigt. ER'19 (2019). Knowledge representation and update in hierarchies of graphs (extended abstract). #GDB #KR #GR Russ Harmer and Eugenia Oshurko. ICGT'19 (2019). arXiv activité éditorialeGraph Transformation. Proceedings of the 17th International Conference. #GR Russ Harmer and Jens Kosiol (editors). ICGT'24 (2024). arXiv 31.10.2025",
  "content_length": 3072,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:34"
}