{
  "name": "Russell H. Taylor",
  "homepage": "http://www.cs.jhu.edu/~rht",
  "status": "success",
  "content": "Russell H. Taylor's Home Page Russell H. Taylor John C. Malone Professor Department of Computer Science Whiting School of EngineeringThe Johns Hopkins University Joint Appointments Mechanical Engineering Radiology Otolaryngology Surgery Navigation CIIS Lab web site LCSR web site Whiting School of Engineering  Computer Science Mechanical Engineering Electrical & Computer Engineering Biomedical Engineering School of Medicine Radiology Surgery Biomedical Engineering Johns Hopkins University Russell Taylor's Web Site Home Research Curriculum Vita Courses Contact Information Campus Map Research For many years, starting in the late 1980's at IBM T. J. Watson Research Center, my research has focused on all aspects of computer-integrated interventional medicine. Broadly, this research has included: Medical robotics; Medical imaging & modeling;and Complete systems for surgical assistance, image-guided surgery, and what I refer to as \"Surgical CAD/CAM\". An underlying theme has been the basic insight that information-based technologies can have just as profound an impact on computer-integrated medicine as it has had on computer-integrated manufacturing. Some of my current and recent research projects include work on systems, medical robotics for microsurgery and MIS, statistical modeling and deformable 2D-3D registration, radiation oncology planning, and human-machine cooperative systems in surgery. More information may be found on the Research Page of this web site and on the web site for the Computer-Integrated Interventional Systems Lab. Information about my early medical robotics work at IBM can be found by following this link.  Information about my other earlier work can be found by following this link. Also, here is a link to a December 2021 interview in Computer Vision News where I talk about how I see the field evolving. Publications You can find a (somewhat complete) list of my publications in my curriculum vita.  An extended (2 page) bio-sketch can be found here, and a shorter version can be found here on my faculty page on the CS Department website. Courses Computer-Integrated Surgery Course Sequence The Computer Science Department has recently changed the numbers of this coruse from 600.445/645 to 610.455/655. There will also be changes in the CIS II course numbers. Further changes to this and the CIS II web site will be made as soon as I can get the new numbers clarified. Overview Computer-Integrated Surgery I (601.455/655 - previously 600.445/645) CIS I Fall 2025 Schedule Computer-Integrated Surgery II (601.456/656/496/452) Computer-Integrated Surgery II Schedule for Spring 2025 Other Courses Medical Image Analysis Seminar (601.856 / 520.746 - previously also 600.746) Winter School on Medical Robotics and Computer-Integrated Interventional Systems (MRCIIS) Contact Information 127 Hackerman Hall TheJohns Hopkins University 3400 North Charles Street Baltimore, Maryland 21218 USA Phone: 410-516-6299 Fax: 410-516-5553 email: rht at jhu.edu Click here for an annotated campus map showing how to find my office and other locations on campus. Copyright © Russell Taylor 2018",
  "content_length": 3124,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:34"
}