{
  "name": "Russell Beale",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/beale-russell.aspx",
  "status": "success",
  "content": "Professor Russell Beale, Computer Science, University of Birmingham - University of Birmingham Professor Russell Beale School of Computer ScienceProfessor of Human-Computer Interaction Contact details Telephone+44 (0)121 414 3729Emailr.beale@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of BirminghamEdgbastonBirminghamB15 2TT Staff detailsMedia information Recent publications Article Wicaksono, A, Hendley, R & Beale, R 2019, 'Investigating the impact of adding plan reminders on implementation intentions to support behaviour change', Interacting with Computers, vol. 31, no. 2, pp. 177-191. https://doi.org/10.1093/iwc/iwz012 Pinder, C, Vermeulen, J, Cowan, B & Beale, R 2018, 'Digital Behaviour Change Interventions to Break and Form Habits', ACM Transactions on Computer-Human Interaction, vol. 25, no. 3, 15. https://doi.org/10.1145/3196830 Conference contribution Beale, R & Williams, O 2025, Am I Productive? Exploring the Experience of Remote Workers with Task Management Tools. in CHItaly '25: Proceedings of the 16th Biannual Conference of the Italian SIGCHI Chapter., 1, Proceedings of the Biannual Conference of the Italian SIGCHI Chapter, Association for Computing Machinery (ACM). https://doi.org/10.1145/3750069.3750107 Beale, R & Rutter, D 2025, Investigating the Ways in Which Mobile Phone Images with Open-Source Data Can Be Used to Create an Augmented Virtual Environment (AVE). in Computer Graphics & Visual Computing (CGVC) 2025. Eurographics Digital Library, Computer Graphics & Visual Computing 2025, Liverpool, United Kingdom, 11/09/25. https://doi.org/10.2312/cgvc.20251219 Beale, R 2025, Large Language Models Will Change The Way Children Think About Technology And Impact Every Interaction Paradigm. in IDC '25: Proceedings of the 24th Interaction Design and Children. Association for Computing Machinery (ACM), pp. 1103-1107, IDC '25, Reykjavik, Iceland, 23/06/25. https://doi.org/10.1145/3713043.3731538 Wicaksono, A, Hendley, RJ & Beale, R 2019, Using reinforced implementation intentions to support habit formation. in CHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI’19 Extended Abstracts)., 3312985, Association for Computing Machinery (ACM), ACM CHI Conference on Human Factors in Computing Systems (CHI 2019), Glasgow, United Kingdom, 4/05/19. https://doi.org/10.1145/3290607.3312985 Wicaksono, A, Hendley, RJ & Beale, R 2018, Does adding reinforcement of implementation intentions support behaviour change? in R Bond, M Mulvenna, J Wallace & M Black (eds), Proceedings of the 32nd International BCS Human Computer Interaction Conference (HCI 2018)., 38, Electronic Workshops in Computing (eWiC), BCS, The Chartered Institute for IT, 32nd International BCS Human Computer Interaction Conference, HCI 2018, Belfast, United Kingdom, 4/07/18. https://doi.org/10.14236/ewic/HCI2018.38 Pinder, C, Vermeulen, J, Cowan, BR, Beale, R & Hendley, RJ 2017, Exploring the feasibility of subliminal priming on smartphones. in Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2017., 21, Association for Computing Machinery (ACM), 19th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2017, Vienna, Austria, 4/09/17. https://doi.org/10.1145/3098279.3098531 Stylianidis, A, Vermeulen, J, Houben, S, MacDonald, L & Beale, R 2017, SenseBelt: a belt-worn sensor to support cross-device interaction. in CHI EA '17 Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery (ACM), pp. 2123-2131. <http://eprints.lancs.ac.uk/85599/1/lbw0338_stylianidisA.pdf> Preprint Beale, R & Sergueeva, E 2025 '5 Days, 5 Stories: Using technology to promote empathy in the workplace' arXiv. https://doi.org/10.48550/arXiv.2506.19495 Beale, R 2025 'Adapting university policies for generative AI: Opportunities, challenges, and policy solutions in Higher Education' arXiv. https://doi.org/10.48550/arXiv.2506.22231 Beale, R 2025 'Computer science education in the Age of Generative AI' arXiv. https://doi.org/10.48550/arXiv.2507.02183 Beale, R 2025 'Dialogic pedagogy for Large Language Models: Aligning conversational AI with proven theories of learning' arXiv. https://doi.org/10.48550/arXiv.2506.19484 Beale, R 2025 'The revolution has arrived: What the current state of Large Language Models in education implies for the future' arXiv. https://doi.org/10.48550/arXiv.2507.02180 Review article Thomson, C & Beale, R 2021, 'Is blockchain ready for orthopaedics? A systematic review', Journal of clinical orthopaedics and trauma, vol. 23, 101615. https://doi.org/10.1016/j.jcot.2021.101615 View all publications in research portal Modern computer and communications technology and society; how people use and appropriate technology; how we can design it to be better; the impact of the Internet, mobile technologies; usability; human-computer interaction and ethical issues (e.g. privacy and security) Alternative contact number available for this expert: contact the press office Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 5266,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:35"
}