{
  "name": "Ruta Mehta",
  "homepage": "https://cs.illinois.edu/directory/profile/rutameht",
  "status": "success",
  "content": "Ruta Mehta | Siebel School of Computing and Data Science | Illinois Ruta Mehta Ruta Mehta Associate Professor (217) 300-4650 rutameht@illinois.edu 3218 Siebel Center for Comp Sci For More Information Ruta Mehta's DBLP page Ruta Mehta's Homepage Education Doctor of Philosophy, Computer Science and Engineering, Indian Institute of Technology, Bombay. 2012. Advisor: Prof. Milind Sohoni Masters of Technology,Computer Science and Engineering, Indian Institute of Technology, Bombay, 2005 Bachelor of Engineering, Computer Engineering, Maharaja Saiyajirao University (MSU) Baroda, 2003 BiographyI am currently an Assistant Professor in the Department of Computer Science. Prior to joining UIUC, I did postdoc at Simons Institute for Theory of Computing at UC Berkeley (Aug'15 to Dec'15), and in College of Computing at Georgia Tech (Aug'12 to July'15, advisor: Prof. Vijay V. Vazirani). I received my Ph.D. in computer science from IIT-Bombay under the supervision of Prof. Milind Sohoni and Prof. Bharat Adsul, in August 2012. My Ph.D. thesis titled \"Nash Equilibrium Computation in Various Games\" won the ACM India Doctoral Dissertation Award, 2012. Academic Positions Assistant Professor, Dept of Computer Science, University of Illinois at Urbana-Champaign. 2016 - Present Postdoctoral Fellow, Simons Institute for Theory of Computing, University of California at Berkeley. July'15 - Dec'15. Host: Prof. Allistair Sinclair. Postdoctoral Fellow, College of Computing, Georgia Institute of Technology. Sept'12 - July'15. Host: Prof. Vijay V. Vazirani Software Engineer and Developer, Sybase India, Aug'05 - July'07 Professional Registrations ACM membership since 2017 Professional Highlights Founder of the EC (AGT) Mentoring Workshop, co-located with the ACM Economics and Computation Conference. Area Chair, 22nd ACM Conference on Economics and Computation (EC), 2021. Program Co-Chair, The 16th Conference on Web and Internet Economics (WINE), 2020. Associate Editor, Mathematics of Operations Research (MOR), INFORMS, since 2020. Course Development CS 580: Topics on Algorithmic Game Theory Research StatementMy research is primarily in theoretical computer science. It looks at the fundamental solution concepts from economics, game theory, and social choice from the computational lens. I am also interested in understanding questions related to fairness in society, and evolution in nature.My main research interests lie in the areas of algorithmic game theory, mathematical economics, and in design of efficient algorithms. I am interested in exploring the computability of equilibria, both market and Nash, under various settings, and also understanding the impact of strategic behavior in multi-agent situations. Currently, I am exploring problems from dynamic matching, fair division of scarce resources, and market design for cloud computing. In addition I am exploring avenues for interdisciplinary applications of these tools to genetic evolution, machine learning and dynamical systems. Research Interests Algorithmic Game Theory: Equilibrium Computation and Complexity, Smoothed Analysis, Learning in Games, Strategic and Dynamic Aspects Fair division Interdisciplinary applications of game-theoretic tools to machine learning, genetic evolution, and climate change. Research Areas Theory and Algorithms Selected Articles in Journals A simplex-like algorithm for linear Fisher markets. Adsul, Bharat, Ch Sobhan Babu, Jugal Garg, Ruta Mehta, and Milind Sohoni. JSTOR Current Science (2012), 103(9), 1033-1042. A complementary pivot algorithm for market equilibrium under separable, piecewise-linear concave utilities. Jugal Garg, Ruta Mehta, Milind Sohoni, and Vijay V. Vazirani. SIAM Journal on Computing (2015), 44(6), 1820-1847. Dichotomies in Equilibrium Computation and Membership of PLC Markets in FIXP. Jugal Garg, Ruta Mehta, and Vijay V. Vazirani. ELSEVIER Theory of Computing (2016), 12(1), 1-25. Substitution with Satiation: A New Class of Utility Functions and a Complementary Pivot Algorithm. Jugal Garg, Ruta Mehta, and Vijay Vazirani. INFORMS Mathematics of Operations Research (2018), 43(3): 996-1024. Constant Rank Bimatrix Games are PPAD-hard. Ruta Mehta. SIAM Journal on Computing (2018). 47(5): 1858­-1887. Special Section on the 46th Annual ACM Symposium on Theory of Computing (STOC 2014). (invited) EXISTS-R-Completeness for Decision Versions of Multi-Player (Symmetric) Nash Equilibria. Jugal Garg, Ruta Mehta, Vijay V. Vazirani, and Sadra Yazdanbod, ACM Transactions on Economics and Computation (2018), 6(1) 1:1-1:23. Articles in Conference Proceedings Rank-1 Bimatrix Games: A Homeomorphism and a Polynomial Time Algorithm. Bharat Adsul, Jugal Garg, Ruta Mehta, and Milind Sohoni. In Proceedings of the 43rd annual ACM symposium on Theory of computing (STOC), 195--204, 2011. ACM. Invited to the Games \\& Economic Behavior (GEB) Special Issue for STOC/FOCS/SODA 2011. (28% acceptance rate) A Complementary Pivot Algorithm for Market Equilibrium under Separable, Piecewise-Linear Concave Utilities. Jugal Garg, Ruta Mehta, Milind Sohoni and Vijay V. Vazirani. In Proceedings of the 44th annual ACM symposium on Theory of computing (STOC), 525--534, 2012. ACM. (29% acceptance rate) Towards Polynomial Simplex-Like Algorithms for Market Equilibria. Jugal Garg, Ruta Mehta, Milind Sohoni and Nisheeth Vishnoi. In Proceedings of the 24th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), 1226--1242, 2013. ACM-SIAM. (29% acceptance rate) Dichotomies in equilibrium computation, and complementary pivot algorithms for a new class of non-separable utility functions. Jugal Garg, Ruta Mehta, and Vijay V. Vazirani. In Proceedings of the 46th Annual ACM Symposium on Theory of Computing (STOC), 525--534, 2014. ACM. (29% acceptance rate) Constant Rank Bimatrix Games are PPAD-hard. In Proceedings of the 46th Annual ACM Symposium on Theory of Computing (STOC), 545--554, 2014. ACM. Invited to a special volume of the SIAM Journal on Computing dedicated to the best papers of STOC’14. (29% acceptance rate) Natural Selection as an Inhibitor of Genetic Diversity: Multiplicative Weights Update Algorithm and a Conjecture of Haploid Genetics. Ruta Mehta, Ioannis Panageas, and Georgios Piliouras. In 2015 Conference on Innovations in Theoretical Computer Science (ITCS), 73--73, 2015. ACM.(28% acceptance rate) Nash Social Welfare Approximation for Strategic Agents. Simina Branzei, Ruta Mehta, and Vasilis Gkatzelis. In Proceedings of the 2017 ACM Conference on Economics and Computation (EC), 611--628, 2017. ACM. (29% acceptance rate) Mutation, Sexual Reproduction and Survival in Dynamic Environments. Ruta Mehta, Ioannis Panageas, Georgios Piliouras, Prasad Tetali, and Vijay V. Vazirani. In Proceedings of the 8th Innovations in Theoretical Computer Science Conference (ITCS), 2017. LIPIcs-Leibniz International Proceedings in Informatics. (35% acceptance rate) Settling the Complexity of Leontief and PLC Exchange Markets under Exact and Approximate Equilibria. Jugal Garg, Ruta Mehta, Vijay V. Vazirani and Sadra Yazdanbod. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing (STOC), 890--901, 2017. ACM. (24% acceptance rate) A New Class of Combinatorial Markets with Covering Constraints: Algorithms and Applications. Nikhil Devanur, Jugal Garg, Ruta Mehta, Vijay V. Vazirani, and Sadra Yazdanbod. In Proceedings of the 29th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), 2311--2325, 2018. ACM-SIAM. (33% acceptance rate) Sum-of-Squares Meets Nash: Lower Bounds for Finding Any Equilibrium. Pravesh Kothari and Ruta Mehta. In Proceedings of the 50th Annual Symposium on the Theory of Computation (STOC), 1241--1248, 2018. ACM. (26.6% acceptance rate) Nash Equilibrium Computation in Resource Allocation Game. Shivam Gupta and Ruta Mehta. In Proceedings of the 17th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 1953--1955, 2018. ACM. (18% acceptance rate) Universal Growth in Production Economies. Simina Branzei, Ruta Mehta, and Noam Nisan. In Proceedings of the 32nd Annual Conference on Neural Information Processing Systems (NuerIPS), 1973–1973, 2018. ACM. (21% acceptance rate) Unique End of Potential Line. John Fearnley, Spencer Gordon, Ruta Mehta, and Rahul Savani. In 46th International Colloquium on Automata, Languages and Programming (ICALP), 56:1 - 56:15, 2019. LIPIcs-Leibniz International Proceedings in Informatics. (29% acceptance rate) Multiclass Performance Metric Elicitation. Gaurush Hiranandani, Shant Boodaghians, Ruta Mehta, and Oluwasanmi Koyejo. In 23rd conference on Neural Information Processing Systems (NeuroIPS), 2019. ACM. (21% acceptance rate) Smoothed Efficient Algorithms and Reductions for Network Coordination Games. Shant Boodaghians, Rucha Kulkarni, and Ruta Mehta. In 11th Innovations in Theoretical Computer Science (ITCS), 2020. LIPIcs-Leibniz International Proceedings in Informatics. (42% acceptance rate) Approximate Nash Equilibria of Imitation Games: Algorithms and Complexity. Aniket Murhekar and Ruta Mehta. In 17th International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS), 2020. International Foundation for AAMAS. (23% acceptance rate) Competitive Allocation of a Mixed Manna. Bhaskar Ray Chaudhury, Jugal Garg, Peter McGlaughlin, and Ruta Mehta. Proceedings of the 32nd Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), 2021. SIAM. (28% acceptance rate) Improving EFX Guarantees through Rainbow Cycle Number. Bhaskar Ray Chaudhury, Jugal Garg, Kurt Mehlhorn, Ruta Mehta, and Pranabendu Misra. In Proceedings of the 22nd ACM Conference on Economics and Computation (EC), 2021. ACM. (26% acceptance rate) Indivisible Mixed Manna: On the Computability of MMS + PO Allocations. Rucha Kulkarni, Ruta Mehta, and Setareh Taki. In Proceedings of the 22nd ACM Conference on Economics and Computation (EC), 2021. ACM. (26% acceptance rate) Polynomial Time Algorithms to Find an Approximate Competitive Equilibrium ",
  "content_length": 16262,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:39"
}