{
  "name": "Ruth Misener",
  "homepage": "https://wp.doc.ic.ac.uk/rmisener",
  "status": "success",
  "content": "Ruth Misener | Optimization Models, Algorithms, and Software Department of Computing Ruth Misener Optimization Models, Algorithms, and Software ContactHuxley 379 Department of Computing South Kensington Campus Imperial College London SW7 2AZ r.misener@imperial.ac.uk +44 (0) 20759 48315 Curriculum Vitae Dr Ruth Misener (she/her) is a Professor in the Computational Optimization Group, an Amazon Scholar, and the BASF/RAEng Research Chair in Data-Driven Optimization (2022-27). Foundations of her research are in numerical optimization and computational software. Her applications focus on optimization challenges arising in industry, e.g. in logistics or experimental design. Ruth also works at the interface of operations research and machine learning. Ruth’s research team develops open-source code on GitHub, releases video presentations on YouTube, and announces research on LinkedIn. See her inaugural lecture: Print Email to a Friend Email to a Friend Page URL: https://wp.doc.ic.ac.uk/rmisener/ Your Information: Your Name Your Email Friend’s Information: Friend’s Name Friend’s Email Close Projects Global optimization of mixed-integer nonlinear programs This project develops algorithmic protocols and computational tools for solving mixed-integer nonlinear optimization problems; we focus on building effective solution strategies for engineering applications. [+] more Optimization over machine learning surrogates We’re hybridizing mechanistic, model-based optimization with data-driven optimization by developing mathematical programming formulations of machine learning surrogate models. [+] more Active learning & Experimental design We’re developing data-efficient strategies to reduce the number of experiments needed for chemical and pharmaceutical development and manufacturing. [+] more Optimization under uncertainty Safety-critical settings sometimes require optimization with respect to the worst-case realization of the problem setting. The adversarial, robust optimization setting is especially useful when errors are very costly. [+] more Explainable optimization Optimization solvers are often unexplainable black boxes where the reasoning for a solution is inaccessible to users. We use argumentation to empower the interaction between optimization solvers and users, supported by tractable explanations which certify or refute solutions. [+] more Scheduling & rescheduling In logistics applications such as our Royal Mail collaboration, a planned schedule is made in advance. But suppose something disruptive happens and we need to adapt quickly. How can we make rescheduling efficient? [+] more Designing heat recovery networks Heat exchanger networks reuse excess industrial process heat onsite and thereby improve energy recovery. We consider the resulting mixed-integer nonlinear optimization problem for designing heat recovery networks. [+] more Bioprocess optimization for stem cell tissue engineering This project considers robust superstructure design and operation of a bioreactor that produces red blood cells. Although we develop an optimization model for a specific bioreactor, the intellectual framework may generally apply to bioprocess optimization. [+] more Global optimization of petrochemical process networks This project optimizes fuel blending for energy systems on a feed-forward network of inputs, intermediate storage, and outputs; we investigate blending petrochemical feeds in a way that maximizes profit subject to environmental standards. [+] more Bayesian optimization with dimension scheduling: Application to biological systems Our Dimension Scheduling Algorithm reduces the computational burden of Bayesian optimization for many experiments. The key is optimizing the fitness function only along a small set of dimensions at each iteration. [+] more Ruth’s Social Media ProfilesDBLP Google Scholar LinkedIn Official ICL ORCID ResearchGate Computational Optimization GroupGitHub Website YouTube Research AffiliationsArtificial Intelligence Network Data Science Institute Institute for Molecular Science and Engineering Machine Learning Initiative Quantitative Analysis and Decision Science Sargent Centre for Process Systems Engineering Theory & Algorithms Research Theme Login Main campus address: Imperial College London, South Kensington Campus, London SW7 2AZ, tel: +44 (0)20 7589 5111 // Campus maps and information About this site This site uses cookies © Copyright 2014 – Imperial College London",
  "content_length": 4464,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:39"
}