{
  "name": "Ruy J. G. B. de Queiroz",
  "homepage": "https://www.cin.ufpe.br/~ruy",
  "status": "success",
  "content": "Ruy J. Guerra B. de Queiroz Calendário 2025 Events WoLLIC'26 Associações ASL IGPL FoLLI WoLLIC Projetos Model Th. Proof Th. Publicações Livros Vol. Org. Artigos Outros Ensino Lógica Inf.Teór. Bitcoin Cripto Lambda C. Pós-Grad. Programas Orientação Pessoal Ruy J. Guerra B. de Queiroz Centro de Informática, Universidade Federal de Pernambuco Posição Atual Professor Titular, Univ. Federal de Pernambuco (UFPE) Membro do Grupo de Teoria, CIn-UFPE Co-Editor-in-Chief, Logic Journal of the IGPL, Oxford U. Press Associate Editor, Journal of Computer and System Sciences Membro do Corpo Editorial do Journal of Applied Logics, College Publications, Kings College, London, UK. Coordenador do Interest Group in Pure and Applied Logics Membro do Corpo Editorial do South American Journal of Logic Membro do Corpo Editorial do The International Directory of Logicians Membro do Corpo Editorial da LNCS-FoLLI series, Springer. Membro da Comissão Científica da série Cadernos de Lógica e Computação, College Publications, Kings College, London, UK. Membro do \"Advisory Group\" do Comitê de Premiação do Rolf Schock Prize in Logic and Philosophy 2026 (Real Academia de Ciências da Suécia) Posições Anteriores Membro (Elected Member-at-Large, 2009) do Council da Association for Symbolic Logic Membro (2011-2016) do Committee on Logic in Latin America da Association for Symbolic Logic Membro do \"Advisory Group\" do Comitê de Premiação do Rolf Schock Prize in Logic and Philosophy (2008, 2011, 2014, 2017, 2018, 2019, 2022) (Real Academia de Ciências da Suécia) Membro do Comitê de Premiação do E.W. Beth Dissertation Prize (2012-2016) Membro do 2020, 2021, 2022 IEEE John von Neumann Medal Committee. Áreas de interesse Fundamentos Lógicos da Computação, Teoria da Prova, Teoria dos Modelos, Lógica e Teoria da Complexidade (Complexidade de Provas, Complexidade Descritiva), Fundamentos da Cibersegurança. Blogs Cibersegurança e O Domínio Público Os Ventos da Liberdade Prêmio Internacional Stanford \"Edward Larocque Tinker\" Visiting Professorship (Jan-Jun 2006) (indicado por Solomon Feferman (Rolf Schock Prize 2003) e Grigori Mints) Livro: de Queiroz, R., de Oliveira, A., & Gabbay, D.: 2011, The Functional Interpretation of Logical Deduction. Vol. 5 of Advances in Logic series. Imperial College Press / World Scientific, Oct 2011. ISBN 978-981-4360-95-1. DOI https://doi.org/10.1142/8215 (flyer) (Buy it from Amazon) Contribuições editoriais recentes Livros Organizados Como Colaborador Anais Números Especiais de Revistas Traduções Endereço Postal: Centro de Informática Universidade Federal de Pernambuco Av Jornalista Anibal Fernandes, s/n Cidade Universitária 50740-560 Recife, PE Tel.: (+55 81) 2126 8430. ruy at cin ufpe br Última modificação: 19 Novembro 2025, 04:08pm GMT-3.",
  "content_length": 2776,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:41"
}