{
  "name": "Ruzanna Chitchyan",
  "homepage": "https://research-information.bris.ac.uk/en/persons/ruzanna-chitchyan",
  "status": "success",
  "content": "Ruzanna Chitchyan - University of Bristol View Scopus Profile Professor Ruzanna Chitchyan PhD (Lanc.) Professor of Software Engineering for Sustainability, School of Computer ScienceBristol Poverty InstituteCabot Institute for the Environment https://orcid.org/0000-0001-6293-3445 Emailr.chitchyanbristol.acuk BS8 1UB Personal profile Research Groups and ThemesBristol Interaction GroupKeywordssoftware and systems requirementssoftware engineeringsocio-technical systemshuman computer interactionenergy transitiondigital energydigital servicescommunity energyenergy systemstechnology adoptionprivacycommunity engagementuser centred designco-creationskills and trainingsustainabilitydecentralised energysharing economy Fingerprint Dive into the research topics where Ruzanna Chitchyan is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Software Systems Computer Science 100% Software Engineering Computer Science 98% Case Study Computer Science 98% Requirement Engineering Computer Science 85% Energy Systems Engineering 73% Energy Engineering Engineering 54% Awareness Framework Computer Science 37% Requirement Elicitation Computer Science 35% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 47 Conference Contribution (Conference Proceeding) 19 Article (Academic Journal) 7 Other report 4 Other chapter contribution 20 More 3 Discussion paper 3 Preprint 2 Chapter in a book 2 Conference Paper 2 Editorial (Academic Journal) 2 Review article (Academic Journal) 2 Working paper 1 Authored book 1 Commissioned report 1 Foreword/postscript to book 1 Special issue (Academic Journal) Research output per year Research output per year Embedding Sustainability in Software Engineering Curriculum: A Case StudyChitchyan, R. & Mahmoudi, N., 1 Oct 2025, arXiv.org.Research output: Working paper › Preprint File Software Engineering 100% Engineering Curriculum 100% Case Study 100% Student Engagement 20% Engineering Program 20% Integrating Sustainability into Scrum Agile Software Development: An Action Research ApproachOyedeji, S., Shamshiri, H., Adisa, M. O., Capilla, R. & Chitchyan, R., 23 Mar 2025, Software Business: 15th International Conference, ICSOB 2024, Utrecht, the Netherlands, November 18-20, 2024, Proceedings. Papatheocharous, E., Farshidi, S., Jansen, S. & Hyrynsalmi, S. (eds.). Springer Nature, p. 236-250 15 p. (Lecture Notes in Business Information Processing (LNBIP); vol. 539).Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open AccessFile Software Development 100% Agile Software Development 100% Awareness Framework 50% Elicitation 50% Agile Methods 50% 81 Downloads (Pure) Overcoming Barriers to Heat Pump Adoption among Able-to-Pay HouseholdsChitchyan, R., 1 Nov 2025, In: Energy Policy. 206, 12 p., 114660.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open Access Heat Pump 100% Road 20% Retro-Fitting 20% Gas Boiler 20% Common Sense 20% View all 97 research outputs Projects 1 Active 11 Finished Projects per year Co-creating equitable circular food systems through a digital hubChitchyan, R. (Principal Investigator)1/11/24 → 31/10/27Project: Research Tolling up Citizens Upskilling for SLESChitchyan, R. (Principal Investigator)1/10/22 → 31/03/23Project: Research, Parent Energy Wallet: Energy WalletChitchyan, R. (Principal Investigator)4/04/22 → 31/07/22Project: Research Retro-Fitting 100% Integrated System 100% View all 12 projects Datasets Trade-off Decisions Across Time in Technical Debt Management: Literature review Coding and Reference DocumentationBecker, C. (Creator), Chitchyan, R. (Creator), Betz, S. (Creator), McCord, C. (Creator) & Becker, C. (Contributor), Scholars Portal Dataverse, 2018DOI: 10.5683/sp/dgoiz8, https://dataverse.scholarsportal.info/citation?persistentId=doi:10.5683/SP/DGOIZ8Dataset",
  "content_length": 4276,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:41"
}