{
  "name": "Ruzena Bajcsy",
  "homepage": "https://www.grasp.upenn.edu/people/ruzena-bajcsy",
  "status": "success",
  "content": "Ruzena Bajcsy - GRASP Lab Ruzena Bajcsy - GRASP Lab ✕ NEXT EVENT Fall 2025 GRASP SFI: Minghan Zhu, University of Pennsylvania, “3D… People Faculty Ruzena Bajcsy GRASP Founder & Faculty Member until '01 - Returned to Penn '21 Website Ruzena Bajcsy is the NEC Distinguished Professor of Electrical Engineering and Computer Sciences at the University of California, Berkeley. She was the founding director of the Center for Information Technology Research in the Interest of Society (CITRIS) in 2001, a multicampus organization comprising 4 campuses: UC Berkeley, UC Davis, UC Santa Cruz, and UC Merced. As part of her activities in CITRIS, and together with the University of California Center for the Humanities, she played a founding role in establishing a program of Digital Humanities. Before joining UC Berkeley, she headed the Computer and Information Science and Engineering Directorate at the National Science Foundation (1999–2001). From 1972 to 2001 she was a professor in the Computer and Information Science Department at the University of Pennsylvania, where she established in 1978 the General Robotics, Automation, Sensing, and Perception (GRASP) Lab. As director of the GRASP lab she fostered interdisciplinary research activities and attracted faculty from electrical and mechanical engineering as well as psychology/cognitive science and of course computer science. Throughout her 28 years at UPenn she worked on robotics research, including computer vision, tactile perception, and in general the problem of system identification. She also worked on medical imaging, and developed with her students a digital anatomy atlas coupled with elastic matching algorithms that made it possible to automatically identify anatomic structures of the brain, first in X-ray tomography, later with MRI and positron image tomography. Use of this technology is now standard in medical practice. Dr. Bajcsy is a member of the National Academy of Engineering (1997) and National Academy of Medicine (1995) as well as a fellow of the Association for Computing Machinery (ACM) and the American Association for Artificial Intelligence (AAAI). In 2001 she received the ACM/AAAI Allen Newell Award, and in November 2002 she was named one of the 50 most important women in Discover Magazine. She is the recipient of the Benjamin Franklin Medal for Computer and Cognitive Sciences (2009) and the IEEE Robotics and Automation Award (2013) for her contributions in the field of robotics and automation. Her current research is in the use of robotic technology, namely measuring and extracting noninvasively kinematic and dynamic parameters of individual in order to assess their physical movement capabilities or limitations. If there are limitations, her students have designed assistive devices that can compensate for the lack of kinematic agility and /or physical strength. Work + News + Ph.D. Students + Publications Robotics at the University of Pennsylvania from Birth to Maturity: A Review of 30 Years of Research Publisher Annual Reviews News National Academy of Medicine Honors Three Members for Outstanding Service October 20, 2025 Faculty News 5 Questions for Robotics Legend Ruzena Bajcsy November 28, 2024 Faculty News GRASP Laboratory’s Founder, Dr. Ruzena Bajcsy, is Awarded UC Berkeley’s Highest Honor September 27, 2023 GRASP News The Nuts and Bolts of GRASP at ICRA 2022 June 1, 2022 Faculty News GRASP News International Women’s Day: In Conversation with Professor Ruzena Bajcsy May 22, 2022 Faculty News GRASP News GRASP Lab founder Ruzena Bajcsy, Susan Davidson & Duncan Watts Elected 2021 AAAS Fellows January 31, 2022 Alumni David Talton PhD CIS '85 - Member, Robin Hood Ventures",
  "content_length": 3693,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:47"
}