{
  "name": "Ruzica Piskac",
  "homepage": "http://www.cs.yale.edu/~piskac",
  "status": "success",
  "content": "Ruzica Piskac - Professor of Computer Science, Yale University Ruzica Piskac Professor of Computer Science Yale University 51 Prospect Street, office AKW 212 New Haven, CT 06511 Email: Phone: +1-203-432-8001 Curriculum Vitae Bio Research Team Publications Teaching Service Bio Short Bio Ruzica Piskac is a Professor of Computer Science at Yale University, where she leads the Rigorous Software Engineering (ROSE) group. Her research interests span the areas of software verification, security and applied cryptography, automated reasoning, and code synthesis. Much of her research has focused on using formal techniques to improve software reliability and trustworthiness. Piskac joined Yale’s Department of Computer Science in 2013. She was previously an Independent Research Group Leader at the Max Planck Institute for Software Systems in Germany. Her research has received a range of professional honors, including multiple Amazon Research Awards, Yale University’s Ackerman Award for Teaching and Mentoring, the Facebook Communications and Networking Award, and the Microsoft Research Award for the Software Engineering Innovation Foundation (SEIF). In 2019, Yale named Piskac the Donna L. Dubinsky Associate Professor of Computer Science. Piskac holds a Ph.D. from the Swiss Federal Institute of Technology (EPFL), where her dissertation won the Patrick Denantes Prize. Her current and recent professional activities include service as Program Chair of the 37th International Conference on Computer Aided Verification and the Steering Committee of the Formal Methods in Computer-Aided Design conference. Piskac has graduated five PhD students, four of them are currently holding a position of an assistant professor of computer science. Education and Previous Affiliations Max Planck Institute for Software Systems, Germany Leading an independent research group on synthesis, analysis and automated reasoning (2012 - 2013) EPFL, Switzerland PhD in Computer Science (2011) Thesis title: Decision Procedures for Program Synthesis and Verification Advisor: Viktor Kuncak Research Ruzica Piskac's research interests span the areas of programming languages, software verification, automated reasoning, and code synthesis. A common thread in Ruzica's research is improving software reliability and trustworthiness using formal techniques. On-going Projects Research projects are described on the group website Funding sponsors Team Ruzica Piskac is leading the Rigorous Software Engineering (ROSE) group. Publications Conference / Journal Papers [OOPSLA'24] Jialu Zhang, José Cambronero, Sumit Gulwani, Vu Le, Ruzica Piskac, Gustavo Soares, Gust Verbruggen: PyDex: Repairing Bugs in Introductory Python Assignments Using Large Language Models, in Proceedings of the ACM on Programming Languages, Volume 8, Issue OOPSLA1, Article No.: 133, pp.1100-1124. [url] [USENIX'24] Daniel Luick, John C. Kolesar, Timos Antonopoulos, William R. Harris, James Parker, Ruzica Piskac, Eran Tromer, Xiao Wang, Ning Luo: ZKSMT: A VM for Proving SMT Theorems in Zero Knowledge, in the 33rd USENIX Security Symposium, to appear. [url] [CAV'24] Samuel Judson, Matthew Elacqua, Filip Cano, Timos Antonopoulos, Bettina Könighofer, Scott J. Shapiro, Ruzica Piskac: soid: A Tool for Legal Accountability for Automated Decision Making, in the 36th International Conference on Computer Aided Verification (CAV 2024), pp.233-246. [url] [SIGMOD'24] Haoran Ding, Zhaoguo Wang, Yicun Yang, Dexin Zhang, Zhenglin Xu, Haibo Chen, Ruzica Piskac, Jinyang Li: Proving Query Equivalence Using Linear Integer Arithmetic, in Proceedings of the ACM on Management of Data, Volume 1, Issue 4, Article No.: 227, pp.1-26. [url] [TCHES] Ferhat Erata, Chuanqi Xu, Ruzica Piskac, Jakub Szefer: Quantum Circuit Reconstruction from Power Side-Channel Attacks on Quantum Computer Controllers, in IACR Transactions on Cryptographic Hardware and Embedded Systems, TCHES 2024 Issue 2, pp. 735-768. [url] [CSLAW'24] Samuel Judson, Matthew Elacqua, Filip Cano, Timos Antonopoulos, Bettina Könighofer, Scott J. Shapiro, Ruzica Piskac: 'Put the Car on the Stand': SMT-based Oracles for Investigating Decisions, in the 3rd ACM Symposium on Computer Science and Law (CS & Law 2024), pp.73-85. [url] [FSE'24] Xi Zheng, Aloysius K. Mok, Ruzica Piskac, Yong Jae Lee, Bhaskar Krishnamachari, Dakai Zhu, Oleg Sokolsky, Insup Lee: Testing Learning-Enabled Cyber-Physical Systems with Large-Language Models: A Formal Approach, in Companion Proceedings of the 32nd ACM International Conference on the Foundations of Software Engineering (FSE 2024), pp.467-471. [url] [AISOLA'23] Katrine Bjørner, Samuel Judson, Filip Cano Córdoba, Drew Goldman, Nicholas Shoemaker, Ruzica Piskac, Bettina Könighofer: Formal XAI via Syntax-Guided Synthesis, in the 1st International Conference on Bridging the Gap Between AI and Reality (AISoLA 2023), pp.119-137. [url] [CCS'23] Yuyang Sang, Ning Luo, Samuel Judson, Ben Chaimberg, Timos Antonopoulos, Ruzica Piskac, Xiao Wang, Zhong Shao: Ou: Automating the Parallelization of Zero-Knowledge Protocols, in the 29th ACM SIGSAC Conference on Computer and Communications Security (CCS 2023), pp.534-548. [url] [IJCAI'23] Filip Cano Córdoba, Samuel Judson, Timos Antonopoulos, Katrine Bjørner, Nicholas Shoemaker, Scott J. Shapiro, Ruzica Piskac, Bettina Könighofer: Analyzing intentional behavior in autonomous agents under uncertainty, in the 32nd International Joint Conference on Artificial Intelligence, (IJCAI 2023), pp.372-381. [url] [EuroS&P'23] Ferhat Erata, Ruzica Piskac, Víctor Mateu, Jakub Szefer: Towards Automated Detection of Single-Trace Side-Channel Vulnerabilities in Constant-Time Cryptographic Code, in the 8th IEEE European Symposium on Security and Privacy, (EuroS&P 2023), pp.687-706. [url] [TECS] Ferhat Erata, Eren Yildiz, Arda Goknil, Kasim Sinan Yildirim, Jakub Szefer, Ruzica Piskac, Gokcin Sezgin: ETAP: Energy-aware timing analysis of intermittent programs, in ACM Transactions on Embedded Computing Systems, Volume 22, Issue 2, Article No.: 23, pp. 1-31. [url] [OOPSLA'22] John C. Kolesar, Ruzica Piskac, William T. Hallahan: Checking equivalence in a non-strict language, in Proceedings of the ACM on Programming Languages, Volume 6, Issue OOPSLA2, pp.1469-1496. [url] [CCS'22] Ning Luo, Timos Antonopoulos, William R. Harris, Ruzica Piskac, Eran Tromer, Xiao Wang: Proving UNSAT in Zero Knowledge, in the 28th ACM SIGSAC Conference on Computer and Communications Security (CCS 2022), pp.2203-2217. [url] [Distinguished Paper Award] [ISSTA'22] Jialu Zhang, Todd Mytkowicz, Mike Kaufman, Ruzica Piskac, Shuvendu K. Lahiri: Using pre-trained language models to resolve textual and semantic merge conflicts (experience paper), in the 31st ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2022), pp.77-88. [url] [ASE'22] Jialu Zhang, De Li, John Charles Kolesar, Hanyuan Shi, Ruzica Piskac: Automated Feedback Generation for Competition-Level Code, in the 37th IEEE/ACM International Conference on Automated Software Engineering (ASE 2022), pp.13:1-13:13. [url] [PLDI'22] Wonhyuk Choi, Bernd Finkbeiner, Ruzica Piskac, Mark Santolucito: Can reactive synthesis and syntax-guided synthesis be friends?, in the 43rd ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2022), pp.229-243. [url] [SANER'22] Mark Santolucito, Jialu Zhang, Ennan Zhai, Jürgen Cito, Ruzica Piskac: Learning CI Configuration Correctness for Early Build Feedback, in the 29th IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER 2022), pp.1006-1017. [url] [USENIX'22] Ning Luo, Samuel Judson, Timos Antonopoulos, Ruzica Piskac, Xiao Wang: ppSAT: Towards Two-Party Private SAT Solving, in the 31st USENIX Security Symposium, pp.2983-3000. [url] [OOPSLA'21] Jialu Zhang, Ruzica Piskac, Ennan Zhai, Tianyin Xu: Static detection of silent misconfigurations with deep interaction analysis, in the 36th ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA'21), pp.1-30. [url] [TACAS'21] Julien Lepiller, Ruzica Piskac, Martin Schaef, Mark Santolucito: Analyzing Infrastructure as Code to Prevent Intra-update Sniping Vulnerabilities, in the 27th International Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS 2021), pp. 105-123. [url] [Extended version] [NSDI'21] Eric Campbell, William Hallahan, Priya Srikumar, Carmelo Cascone, Jed Liu, Vignesh Ramamurthy, Hossein Hojjat, Ruzica Piskac, Robert Soulé, Nate Foster: Avenir: Managing Data Plane Diversity with Control Plane Synthesis, in the 18th USENIX Symposium on Networked Systems Design and Implementation (NSDI 2021), pp. 133-153. [url] [INFOCOM'21] Yichao Cheng, Ning Luo, Jingxuan Zhang, Timos Antonopoulos, Ruzica Piskac, Qiao Xiang: Looking for the Maximum Independent Set: A New Perspective on the Stable Path Problem, in the 16th IEEE International Conference on Computer Communications (INFOCOM 2021), pp. 1-10. [url] [FMSD] William T. Hallahan, Ennan Zhai, Ruzica Piskac: Automated Repair by Example for Firewalls, in the International Journal on Formal Methods in System Design (FMSD), volume 56, pp. 127-153. [url] [TAPAS'20] Nicholas Shoemaker, Ruzica Piskac, Mark Santolucito: Towards Checkpoint Placement for Dynamic Memory Allocation in Intermittent Computing, in the 11th Workshop on Tools for Automatic Program Analysis (TAPAS 2020), pp. 20-22. [url] [WPES'20] Samuel Judson, Ning Luo, Timos Antonopoulos, Ruzica Piskac: Privacy Preserving CTL Model Checking through Oblivious Graph Algorithms, in the 19th Workshop on Privacy in the Electronic Society (WPES 2020), pp. 101-115. [url] [IJCAR'20] Ruzica Piskac: Efficient Automated Reasoning About Sets and Multisets with Cardinality Constraints, in the 10th International Joint Conference on Automated Reasoning (IJCAR 2020), pp. 3-10. [url] [NSDI'20] Ennan Zhai, Ang Chen, Ruzica Piskac, Mahesh Balakrishnan, Bingchu",
  "content_length": 21265,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:42"
}