{
  "name": "Ryan M. Layer",
  "homepage": "http://layerlab.org",
  "status": "success",
  "content": "Layer Lab | Developing algorithms for large-scale genomics at CU Boulder Computer Science and Biofrontiers Institute. Make science faster. News Oct 29, 2024 Layer Lab and Codebreaker Pitch Win Lab Benture Challenge Aug 20, 2024 Michael Bradshaw gets his PhD! Jun 10, 2022 Nate Collins recognized by CRA for undergraduate research Jun 10, 2022 STIX in the media Jun 10, 2022 Searching thousands of genomes to classify somatic and novel structural variants using STIX Dec 1, 2021 AG2PI WorkShop on Structural Variant Detection in Animal Populations Jun 9, 2021 Manual and automated structural variant curation with samplot and samplot-ml Dec 16, 2020 Media Coverage: Research on salmon genetics could aid in conservation, human genome understanding Oct 14, 2020 The structural variation landscape in 492 Atlantic salmon genomes Sep 11, 2020 Media Coverage: Study Of Wi-Fi Data On CU’s Campus Could Help Students Avoid Areas Where COVID Risk May Be Greater Jun 18, 2020 Managing Social Distancing in an Open Society May 8, 2020 Monitoring Stay-at-Home Adherence for Local Governmends in the COVID-19 Pandemic Jun 21, 2019 Talking about samplot at 2019 Rocky Mountain Genomics HackCon at CU Boulder Jun 4, 2019 Samplot Improvements: Split View / SV Browser Visualize translocations, zoom into large varaints, browse SVs in a VCF Jun 7, 2018 My handy dandy simple bitmap library, in C Apr 19, 2018 Samplot: Rapid SV Visualization Quickly and easily visualize sequencing support for structural variants across samples. Feb 27, 2018 The LayerLab is hiring a post doc If you have strong programming skills and want to develop algorithms for large-scale genomic research, please apply. Feb 17, 2018 Manually curate thousands of structural variants with SV-Plaudit SV-plaudit is a cloud-based framework that enables large teams to curate thousands of structural variants rapidly. Jan 30, 2018 How I tokenize a string (char array) in C Jan 22, 2018 UofU Health features GIGGLE in Driving Discovery Jan 8, 2018 GIGGLE is out! GIGGLE is a genomics search engine that identifies and ranks the significance of shared genomic loci between query features and thousands of genome interval files. Jan 7, 2018 Moving to CU Boulder Layer Lab will open this summer in Boulder CO in Comp Sci Dept and the BioFrontiers Institute. subscribe via RSS",
  "content_length": 2323,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:46"
}