{
  "name": "Ryan Kastner",
  "homepage": "http://kastner.ucsd.edu",
  "status": "success",
  "content": "Kastner Research Group | KRG @ UC San Diego Skip to primary contentSkip to secondary content Francesco Restuccia recently presented our research project “BASTION: A Framework for Secure Third-Party IP Integration in NoC-based SoC Platforms” at the Conference on Cryptographic Hardware and Embedded Systems (CHES) 2025 in Kuala Lumpur, Malaysia. BASTION addresses one of the most critical challenges in hardware security: access control. Access control vulnerabilities appear in 5 out of 11 entries on 2025 MITRE’s list of most important hardware CWEs. By combining hardware design with rigorous security verification, BASTION provides a comprehensive framework for building provably verifiable access control systems on NoC-based platforms. BASTION is a collaborative project, and it would not have been possible without the key contributions of Zhenghua Ma and Andres Meza from our UCSD hardware security team, together with Joseph Zuckerman, Biruk Seyoum, and Luca Carloni from Columbia University. BASTION is integrated with the ESP platform and is open-source. Check out our GitHub repo and paper. Olivia Weng and Alexander Redding had two invited presentations to describe our group’s latest and greatest reearch on fault-tolerant neural networks at the Fast Machine Learning for Science Conference. Alexander introduced Arbolta, a tool that bridges the gap between software and hardware fault injection by simulating faults in accelerators at the gate-level. Arbolta was born out of Alexander’s AMD internship under the supervision of Ian Colbert. Olivia presented on PrioriFI, a software fault injection tool that prioritizes flipping the most sensitive parameter bits in a neural network first. PrioriFI is a joint project with Nhan Tran from FermiLab. There were many interesting presentations this year from across computer science, engineering, and physics. Our group enjoys attending FastML every year, meeting up with our collaborators across seas and sciences. Liv presenting PrioriFI Alexander presenting Arbolta Nhan Tran summarizing our group’s research Alexander, Liv, Marta Andronic and Olly Cassidy (last two are our friends at Imperial College London) in a birdwatching booth. The end of the academic year just finished and a couple of our group members received UCSD Department of Computer Science and Engineering Awards. Undergraduate researcher Subhash Katel was given the Award for Excellence in Research. Subash did outstanding research on the Junkyard Computing project and helped out with our parallel computing efforts. Subash will continue his studies at Princeton University as a Ph.D. student. Olivia Weng was given the award for Excellence in Service and Leadership. Amongst Liv’s many service and leadership roles are serving as the student representative for the department’s graduate commitee (gradcom), helping to running the social hour, and leading the DEI Book Club. When developing a software, firmware, or hardware design, designers work to ensure the final design behaves and functions as required by the design’s specification (a list of desired behaviors/functionalities). While verifying the functionality of a design is certainly crucial, designers must also verify that the way they implemented the desired functionality does not introduce security or safety weaknesses. Identifying such weaknesses requires designers to have not only a broad knowledge of potential weaknesses but also a reliable way of detecting instances of these weakness in their code. This is by no means an easy task but there are resources to help point designers in the right direction. One invaluable resource is Mitre’s Common Weakness Enumeration (CWE), a community-developed list of software and hardware weaknesses that can become vulnerabilities. On April 3, 2025, Mitre released CWE Version 4.17 which, among many other updates, contained a new CWE entry contributed by Andy Meza and Jason Oberg (CWE-1431: Driving Intermediate Cryptographic State/Results to Hardware Module Outputs). This CWE was developed based on our security analysis of the open-source hardware root of trust OpenTitan (see paper here). Using hardware information flow tracking enabled by Cycuity’s Radix-S, we discovered a weakness in the implementation of a crypto core in OpenTitan’s one-time programmable memory controller. Despite being a commonly seen weakness that is relevant to many systems, there was no corresponding CWE entry for the detected weakness. So, we submitted a CWE proposal to Mitre’s CWE team and eventually began working with them to prepare CWE-1431 for release. The development of CWE-1431, along with the original security analysis, was a collaborative effort led by Andy Meza. It featured a great team of academic and industry researchers: Andy Meza, Francesco Restuccia, Jason Oberg, Dominic Rizzo, and Ryan Kastner. We look forward to contributing more CWEs in the future and encourage others in the community to do the same. Ryan was given the CRA Undergraduate Research Faculty Mentoring Award for his contributions to mentoring undergraduates through the Engineers for Exploration program and as part of his research group. Over the years, Ryan has mentored thousands of undergraduates and over one hundred of them have gone onto graduate school. Press: UCSD Today, UCSD CSE Article On-chip communication protocols like ARM AXI, RISC-V TileLink, and Wishbone govern communications between processors, memories, I/O, and accelerators. These protocols were developed to maximize performance. Their focus on performance leaves the protocols vulnerable to security risks as many implementations either do not follow the standard or the standard leaves important vulnerabilities underspecified. This is dangerous as it opens the door to exploits that can snoop on on-chip communication or lead to denial of service attacks. eXpect was developed to systematically analyze AXI implementations for functional and security violations. Testing it on seven implementations, including AMD Xilinx and RISC-V PULP, revealed 135 violations, with 10 leading to seven significant exploits. These exploits demonstrated risks like using stale data and bypassing memory operations, which went undetected by AMD Xilinx’s protocol checkers in most cases. eXpect was a collaboration started during Ryan’s Zurich sabbatical in 2022. The research was lead by Melisande Zonta-Roudes in Prof. Shweta Shinde‘s ETH Zurich research group. KRG members Francesco Restuccia played a key role in developing the initial ideas and Andy Meza helped with the implementation and testing. eXpect was nominated for the Best Paper Award at the IEEE/ACM International Conference on Computer-Aided Design (ICCAD) 2024. Congrats to all the authors! After a many year hiatus, our research group retreat returned to Mammoth Lakes in late August. The days were spent hiking, swimming, and sightseeing in the Eastern Sierras and the evenings were spent discussing research plans for the upcoming year. Venturing into the John Muir Wilderness Zhenghua, Mammoth Mountain, and the Minarets Sean and Chris at Mono Lake Group Hike to Arrowhead Lake Liv and Jen swimming in Arrowhead Lake Ryan was named the William Nachbar endowed chair. William Nachbar was early faculty member of the UC San Diego Jacobs School of Engineering. Prof. Nachbar joined UCSD in 1965 as a professor of applied mechanics. His research focused on structural mechanics and combustion. He retired from UCSD in 1989 and passed away in 2005. Despite the different research areas, there are some similarities. Both Prof. Nachbar and Ryan moved to UCSD as associate professors from other California universities (Stanford and UCSB, respectively). Prof. Nachbar worked on the first missile designed to be launched underwater. Ryan has done research in underwater systems for communications, robotics, and 3D vision. Prof. Nachbar “loved camping, fly fishing, snorkeling, and Mozart. And he loved his family.” Ryan similarly loves the outdoors, music, and his family. Prof. William Nachbar UCSD Press ReleaseUCSD CSE Press Release The great John East visited UCSD to give two lectures. John’s first lecture, “How to Succeed at Whatever You End Up Doing,” imparted knowledge that he has gained over his career to the “Embedded Systems Design Project” class. His second lecture in the Embedded Systems Seminar on “The History of Silicon and Semiconductor” was filled with stories of his long and storied career in Silicon Valley. John uniquely connects with the students and gives sage advice on business, research, and life. His nearly annual UCSD visits are always one of the highlights of my academic year. Cloud service providers offer Field Programmable Gate Arrays (FPGAs) as a time-shared service for accelerating various workloads. With the current temporal sharing model, there is generally believed to be no information leakage between subsequent users since the FPGA is entirely digitally erased between each tenant. Our results show that conventional wisdom is flawed: data from previous users of an FPGA can be extracted by measuring analog burn-in effects without physical access to the FPGA. We call these “FPGA pentimenti,” i.e., analog remnants of a previous user’s information that reflect themselves due to bias temperature instability (BTI) effects that change transistor timing behavior. Pentimenti arise when BTI causes are reversed and transistor characteristics recover, enabling a subsequent FPGA user to observe previous logical values applied to FPGA elements. Much like infrared imaging can expose artwork pentimenti — early paint strokes since painted over by an artist whose remnants remain but are not visible to the naked eye — an FPGA pentimento can be extracted by a subsequent FPGA user even though the data was cleared, and thus no longer digitally exists on the device. Our ASPLOS paper describes the results in more detail. Or listen to Colin’s lightning talk below. Recent Posts Bastion: Fortifying Network on Ch",
  "content_length": 11475,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:45"
}