{
  "name": "Ryan Tibshirani",
  "homepage": "http://www.stat.cmu.edu/~ryantibs",
  "status": "success",
  "content": "Ryan Tibshirani Ryan Tibshirani Research Software Teaching Group Other *** I moved to UC Berkeley in July 2022. This website is being preserved online by CMU Statistics (thank you guys) but is no longer being actively maintained. Please see my UC Berkeley website for the up to date version. *** Professor of Statistics and Machine Learning Carnegie Mellon University Principal Investigator in the Delphi group Amazon Scholar in AWS AI Labs Short bio I am a Professor jointly appointed in the Departments of Statistics and Machine Learning at Carnegie Mellon University. I am also a Principal Investigator in the Delphi group at CMU, and an Amazon Scholar in Alex Smola's group in AWS AI Labs. I have been a CMU faculty since 2011. From 2007-2011, I did my Ph.D. in Statistics at Stanford University, with Jonathan Taylor as my thesis advisor. From 2003-2007, I did my B.S. in Mathematics at Stanford. Research interests My research interests lie broadly in statistics, machine learning, and optimization; and I like to think about problems from different angles: applied, computational, theoretical. More specifically, my interests include high-dimensional statistics, nonparametric estimation, distribution-free inference, convex optimization, and numerical methods. My main applied focus at this time is on tracking and forecasting epidemics. Professional service Institute of Mathematical Statistics Council (2022-) Science Advisory Board for the Institute for Pure and Applied Mathematics (2019-) Associate Editor for Journal of Machine Learning Research (2018-) Editorial Board for Springer Series in the Data Sciences (2018-) I have also been an Associate Editor for the Annals of Statistics (2016-20), Biometrika (2013-16), Journal of the American Statistical Society (2019-20), and for a number of ML conferences (NeurIPS, ICML, AISTATS, 2014-20). A full CV can be found here.",
  "content_length": 1885,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:50"
}