{
  "name": "Ryan Kok Leong Ko",
  "homepage": "https://researchers.uq.edu.au/researcher/23784",
  "status": "success",
  "content": "Professor Ryan Ko | UQ Experts Skip to menu Skip to content Skip to footer Professor Ryan Ko Email: ryan.ko@uq.edu.au Phone: +61 7 336 51092 Positions Centre Director of UQ Cyber Research Centre UQ Cyber Research Centre Faculty of Engineering, Architecture and Information Technology Chair & Director - Cyber Security School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Professor Ryan Ko is Chair Professor of Cyber Security, Centre Director of UQ Cyber Research Centre, Director of Research at the School of Electrical Engineering and Computer Science, and an elected member of the Academic Board at the University of Queensland, Australia. He holds a Bachelor of Engineering (Computer Engineering)(Hons.) (2005), and PhD (2011) from Nanyang Technological University (NTU), Singapore. Ko has held senior scientific leadership, executive, and directorship roles across industry and academia, and has more than 15 years of board, governance and advisory experience across government, industry and NGOs across Australia, New Zealand, Singapore, and USA. He currently serves on the Audit and Risk Committee for the board of the global not-for-profit ORCID, and has served on boards and advisory groups for AustCyber, Queensland Government, Meat and Livestock Australia (MLA), and the NZX-listed (NZE:LIC) Livestock Improvement Cooperation (LIC). He has also served as expert advisor to INTERPOL, the government of Tonga, NZDF, NZ Minister for Communications' Cyber Security Skills Taskforce, and is a Technical Advisor (one of four nationally-appointed) for judges relating to the Harmful Digital Communications Act 2015, Ministry of Justice. He has also served as independent technical expert for Australian law firms in court cases, litigations and class actions. He is a registered external expert for the Tertiary Education Quality and Standards Agency (TEQSA), and a member of the Australian Computer Society (ACS) Accreditation Committee. He has experience reviewing course proposals and served in governance roles for higher education institutes. He is Adjunct Professor at the Singapore Institute of Technology, and Affiliate Faculty Member at NIATEC at the Idaho State University, USA. He has been a co-founder of 4 start-ups, including First Watch Ltd (NZ) – an industrial cybersecurity spin-off based on his patented OT security and provenance research at the University of Waikato. Since joining UQ in 2019, he has served as: Deputy Head of School (External Engagement) (2021-2022) Founding Discipline Leader of the Cyber Security and Software Engineering discipline (2020-2021) Group Leader - Cyber Security (2019) Ko has successfully established several university-wide, multi-disciplinary academic research and education programmes, including establishing and leading: UQ Cyber Research Centre - interdisciplinary cyber scurity research centre involving 60+ academics and their respective teams from the 6 Schools (EECS, Business, Economics, Law, Social Science, Mathematics & Physics), the Centre for Policy Futures, and 4 Faculties since 2019. UQ's interdisciplinary postgraduate programme (MCyber, PGDipCyber, GCertCyber) involving four UQ faculties in 2019, NZ's first cyber security graduate research programme and lab (Cybersecurity Researchers of Waikato (CROW)) in 2012, NZ's first Master of Cyber Security (encompassing technical and law courses), the NZ Cyber Security Challenge since 2014, and NZ Institute for Security and Crime Science – Te Puna Haumaru as its founding director, the Evidence Based Policing Centre (at Wellington with NZ Police and ESR), and Master of Security and Crime Science in 2017 with the University of Waikato, NZ. Over his academic career, Ko has been awarded A$20+million in competitive grants as lead Chief Investigator, and ~A$40+million as co-investigator. Prior to UQ, he was the highest funded computer scientist in New Zealand, as Principal Investigator and Science Leader of the largest MBIE-awarded cloud security research funding for STRATUS (NZ$12.2 million; 2014-2018). STRATUS' research was awarded 'Gold' by MBIE (i.e. top performing project, 2017), adopted by INTERPOL and featured in NZ's Department of Prime Minister and Cabinet's NZ Cyber Security Strategy 2016 annual report. Ko has a track record developing international and national cyber security curricula, including: Co-creation of the gold-standard (ISC)2 Certified Cloud Security Professional (CCSP) curriculum (2014-2015) Authoring the draft of the NZQA's Level 6 Cybersecurity Diploma qualification as part of the NZ Cyber Security Skills Taskforce on behalf of the Department of Prime Minister and Cabinet. Ko has also experience developing competitions and coaching competitive cyber security teams, including: Co-founding the NZ Cyber Security Challenge in 2014, and leading the NZCSC from 2014 to 2018. NZCSC is now the premier national cyber security competition in NZ. Co-founding the Oceania Cybersecurity Challenge (OCC) in 2020, and leading the competition from 2022 to present. OCC is now the regional qualifiers for the International Cybersecurity Challenge Co-founding the International Cybersecurity Challenge (ICC) as part of the Steering Committee in 2022. ICC has been held in Athens (2022) and San Diego (2023). It is aiming to be the world cup of cyber competitions. Head Coach of Team Oceania for the ICC. 2022 Results: Overall 4th; 2023 Results: Overall 2nd in the world. He contributed to the establishment of the Government of Tonga CERT and CERT NZ, and has been a keynote speaker regularly on cyber and cloud security research across the globe, including the OECD, Republic of Korea National Assembly (2018), INTERPOL (2017), TEDx Ruakura (2017), and the NZ Members of Parliament (2016). Within the ISO/IEC JTC 1/SC 27, Prof Ko was Head of Delegation for the Singapore national body, served as Editor, ISO/IEC 21878 “Security guidelines for design and implementation of virtualized servers”, and hosted the ISO/IEC JTC 1/SC 27 meetings at Hamilton, NZ, in 2017. He is currently one of the editors of the ISO/IEC PWI 5181 Data Provenance Reference Model. In 2022, Ko co-chaired the development of the Singapore standard TR 106:2022 Tiered cybersecurity standards for enterprises in collaboration with the SPSTC and Singapore Cyber Security Agency. Ko serves as an assessor for the Australian Research Council (ARC), Irish Research Council, Nederlandse Organisatie voor Wetenschappelijk Onderzoek (NWO), Natural Sciences and Engineering Research Council of Canada (NSERC), and NZ MBIE College of Assessors (since 2015). Ko has externally examined 11 PhD and 3 Masters theses for universities in Australia, New Zealand, Canada, Hong Kong and Singapore. For his contributions to the field, he was elected Fellow of the Australian Computer Society, Fellow of the Queensland Academy of Arts and Sciences, and Fellow of Cloud Security Alliance (CSA) (2016). He was awarded the Singapore Government (Enterprise Singapore)’s Young Professional Award (2018) for his leadership at ISO, and awarded the inaugural CSA Ron Knode Service Award 2012 for the establishment of Cloud Data Governance and Cloud Vulnerabilities Research Working Groups. He is also recipient of the 2015 (ISC)2 Information Security Leadership Award. For his research and teaching excellence, he was awarded the University of Queensland Awards for Excellence - Leadership (Commendation) (2023), EAIT Nominations for Most Effective Teacher (both semesters of 2020, 2021, 2022, 2023), University of Waikato's Early Career Excellence Award (2014), Faculty Teaching Excellence Awards (2014, 2015, 2018), and the Nola Campbell eLearning Excellence Award (2014). During his PhD, he was also awarded A*STAR SIMTech's Best Student Award (2009), and clinched the 1st Prize of the IEEE Services Cup 2009 at IEEE ICWS (CORE A*) in Los Angeles, CA. Earlier in his career, Ko was a systems engineer, and subsequently founded two start-ups (one was a social enterprise which became an events/conventions management contractor with IMG at mega-events in Singapore, including the inaugural Youth Olympics in 2010). He is an active science communicator and is regularly interviewed and featured by Australian (ABC News, SBS News, 7 News, 9 News, Courier Mail, Network 10, AFR), Singaporean (Channel NewsAsia, CNA Radio938), NZ (NZ Herald, Dominion Post, Stuff.co.nz, Waikato Times, TVNZ, Central TV) and international media on topics of cyber security, cybercrime and data privacy. Read more Read less Availability Professor Ryan Ko is: Available for supervision Media expert Fields of research Communications engineering Cryptography Data communications Distributed computing and systems software Information and Computing Sciences Mathematical Sciences Qualifications Bachelor (Honours) of Computer Engineering, Nanyang Technological University Doctor of Philosophy, Nanyang Technological University Certificate of Management, Harvard University Fellow, Australian Computer Society, Australian Computer Society Fellow, Cloud Security Alliance, Cloud Security Alliance Fellow, Queensland Academy of Arts and Sciences, Queensland Academy of Arts and Sciences Research interests Provenance and Traceability Applications into tracking Cybercrime Payments (e.g. cryptocurrency transactions), and data across AgTech, IoT, Edge, Cloud Computing and OT environments. Read more Read less Trusted Computing Applications Applications into agriculture, regulatory, auditing and media. Read more Read less Data Privacy and Privacy Enhancing Technologies Enabling secure and private multi-party computation. Read more Read less AI Planning/ Automated Planning Adapting classical AI planning approaches into cyber security. Read more Read less Automating Cyber Security for Critical Infrastructure Designing cyber autonomy to empower all end-users. Read more Read less Applying Situation Crime Prevention to Cybercrime Prevention ",
  "content_length": 28198,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:46"
}