{
  "name": "Ryan Shaun Baker",
  "homepage": "http://www.upenn.edu/learninganalytics/ryanbaker/index.html",
  "status": "success",
  "content": "Ryan Baker Educational Data Mining Learning Analytics Learning Engineering Disengagement Ryan Baker (Ryan S. Baker) ryanshaunbaker@gmail.com Home Publications Teaching CV Contact Miscellaneous Prospective students and visiting scholars: please read this before emailing me. I am Professor of Artificial Intelligence and Education in the Centre for Change and Complexity in Learning within UNISA Education Futures, in the College of Education, Behavioural and Social Sciences, at Adelaide University. I am also Adjunct Professor in the Graduate School of Education at the University of Pennsylvania. My primary appointment is in the Teaching, Learning, and Literacies Division. I am also affiliated with the Policy, Organizations, Leadership, and Systems Division and the Department of Computer and Information Science. I direct the Penn Center for Learning Analytics and serve as Advisor to Penn's Masters in Learning Analytics and Artificial Inteligence (Online) I also have courtesy appointments at the University of Edinburgh Moray House School of Education and Sport and at Ashoka University Department of Computer Science. I am Associate Editor of the Journal of Educational Data Mining. I teach the MOOC Big Data and Education. I also co-lead the Data Science Methods for Digital Learning Platforms Training Program and the Learning Analytics in STEM Education Research (LASER) Institute. I am co-Director of the JeepyTA project. The PCLA developed a wiki detailing the evidence around Algorithmic Bias in Education. I proposed the Baker Learning Analytics Prizes. My research involves the use of Educational Data Mining/Learning Analytics to study learners and learning. I develop and use methods for mining the data that comes out of the interactions between students and educational software, in order to better understand how students respond to educational software, and how these responses impact their outcomes. I study these issues within intelligent tutors, simulations, MOOCs/online courses, and educational games. I study these issues in the context of K-12 formal and informal learning, higher education, and lifelong learning. A core second area of research for me is Quantitative Ethnography, where my work has involved methods for human-LLM partnership in qualitative coding, and detector-driven classroom interviewing using our app Quick Red Fox, which informs qualitative researchers about key events and automated detector outputs in real time. Although my usual approach is to use EDM/LA/QE to study and help improve learning systems developed by other groups, I have become involved more recently in Learning Engineering projects that more directly develop learning platforms, including JeepyTA. One of the core outputs of my work has been automated detectors that make inferences in real-time about students' affect and disengaged behavior and self-regulated learning, using data from students' actions within digital Learning platforms (no sensor, video, or audio data). We have in particular studied gaming the system, off-task behavior, carelessness, self-regulated learning strategies, boredom, frustration/confrustion, engaged concentration, and the appropriate use of help and feedback. We use these models to study the conditions under which these behaviors or affective states arise, and their impacts, including supporting in-the-moment qualitative research. Many of these models are developed using data collected through the Baker Rodrigo Ocumpaugh Monitoring Protocol (BROMP), and the HART Android app. I have also been involved in large-scale efforts to provide early warning/at-risk detection in K-12 and higher education. I have made some tools for EDM research available here. This webpage offers additional resources, including data sets. Over the span of my career, I've had the honor of co-authoring papers with several hundred people. I have created some games with and for my children. My kids and I also write children's stories for fun. Please check out my publications web page for my published papers. For new papers as they appear, follow me on LinkedIn. Educational Data Monkey (art courtesy of Maria Baker) Quantitative Field Observation Generative AI and Education Algorithmic Bias Quantitative Ethnography Ryan Baker",
  "content_length": 4273,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:48"
}