{
  "name": "Ryan Farrell",
  "homepage": "https://faculty.cs.byu.edu/~farrell",
  "status": "success",
  "content": "Ryan Farrell · Brigham Young University (BYU), Computer Science Department Ryan Farrell Associate Professor Computer Science Department Brigham Young University (BYU) contact 2216 TMCB Provo, UT 84602 801.422.3222 bio, cv, etc. bio · curriculum vitae · google scholar announcements January 2019 - I will be serving as a Program Chair for WACV 2020. December 2018 - I will be serving as a Program Chair for ICVGIP 2020. August 2018 - Our paper Aligned to the Object, not to the Image: A Unified Pose-aligned Representation for Fine-grained Recognition was accepted to WACV 2019. July 2018 - Our paper Pairwise Confusion for Fine-Grained Visual Classification was accepted to ECCV 2018. July 2018 - I will be serving as an Area Chair for ICVGIP 2018. May 2018 - I will be serving as an Area Chair for both CVPR 2019 and WACV 2019. April 2017 - I have received an NSF CAREER Award for my proposal \"Inverse Origami: Generalized Pose-Normalization for Large-Scale Fine-Grained Recognition\". research · My research focuses on the emerging field of fine-grained visual categorization (FGVC), where, instead of recognizing objects at a coarse level (e.g. bird or car), we tackle the difficult task of training a computer to find the highly-localized and often subtle characteristics (differences in shape, coloration, etc.) that allow precise identification at the level of fine-grained or \"subordinate-level\" categories (e.g. genus/species, make/model/year). Overcoming this key challenge bridges the divide between objects in the visual world around us and the vast wealth of digital information about them. teaching · Winter 2020: CS493R - Competitive Programming and Coding Interview Prep Winter 2020: CS312 - Algorithm Design and Analysis selected publications (show all) Aligned to the Object, not to the Image: A Unified Pose-aligned Representation for Fine-grained Recognition Pei Guo, Ryan Farrell, Winter Conference on Applications of Computer Vision (WACV), 2019 Pairwise Confusion for Fine-Grained Visual Classification Abhimanyu Dubey, Otkrist Gupta, Pei Guo, Ramesh Raskar, Ryan Farrell, Nikhil Naik, European Conference on Computer Vision (ECCV), 2018 Building a Bird Recognition App and Large Scale Dataset With Citizen Scientists: The Fine Print in Fine-Grained Dataset Collection Grant Van Horn, Steve Branson, Ryan Farrell, Scott Haber, Jessie Barry, Panos Ipeirotis, Pietro Perona, Serge Belongie Computer Vision and Pattern Recognition (CVPR), 2015 Deformable Part Descriptors for Fine-grained Recognition and Attribute Prediction Ning Zhang, Ryan Farrell, Forrest Iandola, Trevor Darrell International Conference on Computer Vision (ICCV), 2013 Pose Pooling Kernels for Sub-category Recognition Ning Zhang, Ryan Farrell, Trevor Darrell Computer Vision and Pattern Recognition (CVPR), 2012 Birdlets: Subordinate Categorization Using Volumetric Primitives and Pose-Normalized Appearance Ryan Farrell, Om Oza, Ning Zhang, Vlad I. Morariu, Trevor Darrell, Larry S. Davis International Conference on Computer Vison (ICCV), 2011 (ORAL, 4% acceptance) Target Localization in Camera Wireless Networks Ryan Farrell, Roberto Garcia, Dennis Lucarelli, Andreas Terzis, I-Jeng Wang Pervasive and Mobile Computing, April 2009 Decentralized Discovery of Camera Network Topology Ryan Farrell and Larry S. Davis International Conference on Distributed Smart Cameras (ICDSC), 2008 Distributed Inference for Network Localization using Radio Interferometric Ranging Dennis Lucarelli, Anshu Saksena, Ryan Farrell, I-Jeng Wang European Workshop on Sensor Networks (EWSN), 2008 Tracking Down Under: Following the Satin Bowerbird Aniruddha Kembhavi*, Ryan Farrell*, Yuancheng Luo, David Jacobs, Ramani Duraiswami, Larry S. Davis Workshop on Applications of Computer Vision (WACV), 2008 Localization in Multi-Modal Sensor Networks Ryan Farrell, Roberto Garcia, Dennis Lucarelli, Andreas Terzis, I-Jeng Wang Intelligent Sensors, Sensor Networks, and Information Processing (ISSNIP), 2007 Best Paper Award (out of 128 papers) Learning Higher-order Transition Models in Medium-scale Camera Networks Ryan Farrell, David Doermann, Larry S. Davis Workshop on Omnidirectional Vision (OMNIVIS), in conjunction with ICCV 2007 The Designers Outpost: A Tangible Interface for Collaborative Web Site Design Scott R. Klemmer, Mark W. Newman, Ryan Farrell, Mark Bilezikjian, James A. Landay User Interface Software and Technology (UIST), 2001 students Graduate Pei Guo (PhD) Connor Anderson (MS/PhD) Suguru Onda (MS) Undergraduate Gabriel Cano Thomas Cole Matthew Gwilliam Rebecca Haggard Dillon Harris Isabel Hilton Andrew Merrill Jamison Moody Adam Teuscher Taylor Sorensen Alumni Greg Sadler - MS 2019 Ben Clough Cody Kesler Ben Jafek Jeff Hilton Jared Rydalch Kevin Thompson Trayson Keli'i Mohit Khattar Andrew Tate Tim Price - MS 2017 - Loveland Innovations Andrew Hale - BS 2018 - serving a mission in Finland Sam Heydorn - serving a mission Jacob Hill - William Jones - BS 2018 - Ryan De Figueiredo - BS 2018 - MS Student at CMU Kolten Pearson - BS 2018 - PhD Student at UMD Michael Walker - BS - Jared Ryrie - BS 2014 - Matthew Heydorn - BS - Annette Heydorn - BS - Adam Rogers - BS - Microsoft service Area Chair for CVPR 2016, ICVGIP 2018, WACV 2019, and CVPR 2019. Co-Chair for 5 Workshops on Fine-Grained Visual Categorization (FGVC): FGVC (2011), FGVC^2 (2013), FGVC^3 (2015), FGVC4 (2017), and FGVC5 (2018); Co-Chair and for the 2017 Workshop on Visual Wildlife Monitoring. Program Committee Member for CVPR 2010/2011/2012/2013/2014/2015, ECCV 2010/2012/2014/2016 and ICCV 2011/2013/2015. Website Chair/Co-Chair for CVPR 2010, CVPR 2012, CVPR 2013, ICCV 2013, CVPR 2014 and ICCV 2015. Reviewer for PAMI and IJCV. personal · The most important things in my life are my family and my faith.  I consider myself fortunate to be married to my best friend and sweetheart and to be a devoted father to three wonderful children.  I spend most of my free time with them and with friends.  When occasion permits (and it rarely does these days), I pursue my favorite hobby, birding.",
  "content_length": 6060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:43"
}