{
  "name": "Ryan O'Donnell",
  "homepage": "http://www.cs.cmu.edu/~odonnell",
  "status": "success",
  "content": "Ryan O'Donnell Ryan O'Donnell Professor Theory Group, Computer Science Dept., CMU 7213 Gates Hillman Center Administrative Assistant: Emi Perdan Analysis of Boolean Functions book Free PDF download Buy a copy from Cambridge University Press Current Teaching CS251: Great Ideas in Theoretical Computer Science (with Anıl Ada) Research publications Videos Low-soundness direct-product testers and PCPs from KaufmanOppenheim complexes R. O'Donnell, N. Singer   *Author order randomized Manuscript No exponential quantum speedup for SIS∞ anymore R. Kothari, R. O'Donnell, K. Wu Manuscript Non-iid hypothesis testing: from classical to quantum G. De Palma, M. Fanizza, C. Mowry, R. O'Donnell QIP '26 SPAM tolerance for Pauli error estimation R. O'Donnell, S. Sharma Manuscript Generalized Samorodnitsky noisy function inequalities, with applications to error-correcting codes O. Abawonse, J. Hązła, R. O'Donnell Manuscript A classical quadratic speedup for Planted kXOR M. Gupta, W. He, R. O'Donnell, N. Singer SODA '26 Instance-optimal quantum state certification with entangled measurements R. O'Donnell, C. Wadhwa Manuscript Sampling and identity-testing without Approximate Tensorization of Entropy W. Gay, W. He, N. Kocurek, R. O'Donnell Manuscript Few single-qubit measurements suffice to certify any quantum state M. Gupta, W. He, R. O'Donnell QIP '26 Explicit two-sided vertex expanders beyond the spectral barrier J.-T. Hsieh, T.-C. Lin, S. Mohanty, R. O'Donnell, R. Y. Zhang STOC '25 Coboundary expansion inside Chevalley coset complex HDXs R. O'Donnell, N. Singer   *Author order randomized Manuscript Uniformity testing when you have the source code C. Canonne, R. Kothari, R. O'Donnell TQC '25 Learning the closest product state A. Bakshi, J. Bostanci, W. Kretschmer, Z. Landau, J. Z. Li, A. Liu, R. O'Donnell, E. Tang QIP '25, STOC '25 Computability theory of closed timelike curves S. Aaronson, M. Bavarian, T. Cubitt, S. Grewal, G. Gueltrini, R. O'Donnell, M. Raat Manuscript Pseudorandom permutations from random reversible circuits W. Gay, W. He, N. Kocurek, R. O'Donnell CRYPTO '25 Quartic quantum speedups for planted inference Alexander Schmidhuber, R. O'Donnell, R. Kothari, R. Babbush SODA '25, QIP '25 Sparsifying suprema of Gaussian processes A. De, S. Nadimpalli, R. O'Donnell, R. Servedio Manuscript Quantum chi-squared tomography and mutual information testing (pdf) S. Flammia, R. O'Donnell Quantum 8, 1381 (2024) QIP '24 Explicit orthogonal and unitary designs (pdf) R. O'Donnell, R. Servedio, P. Paredes   *Author order randomized FOCS '23 Query-optimal estimation of unitary channels in diamond distance (pdf) J. Haah, R. Kothari, R. O'Donnell, E. Tang FOCS '23, QIP '24 Mean estimation when you have the source code; or, quantum Monte Carlo methods (pdf) R. Kothari, R. O'Donnell SODA '23, QIP '23 Explicit abelian lifts and quantum LDPC codes (pdf) F. G. Jeronimo, T. Mittal, R. O'Donnell, P. Paredes, M. Tulsiani. ITCS '22 High-dimensional expanders from Chevalley groups (pdf) R. O'Donnell, K. Pratt   *Author order randomized CCC '22 Optimizing strongly interacting fermionic Hamiltonians (pdf) M. Hastings, R. O'Donnell STOC '22, QIP '22 The SDP value of random 2CSPs (pdf) A. Musipatla, R. O'Donnell, T. Schramm, X. Wu ICALP '22 Pauli error estimation via Population Recovery (pdf) S. Flammia, R. O'Donnell Quantum 5, pp. 549 (2021). TQC '21 The Quantum Union Bound made easy (pdf) R. O'Donnell, R. Venkateswaran   *Author order randomized SOSA '22 Toward instance-optimal quantum state certification with independent measurements (pdf) S. Chen, J. Z. Li, R. O'Donnell COLT '22, QIP '22 Improved quantum data analysis (pdf) C. Bădescu, R. O'Donnell TheoretiCS 3:7 (2024) STOC '21 Fiber bundle codes: Breaking the N1/2polylog(N) barrier for quantum LDPC codes (pdf) J. Haah, M. Hastings, R. O'Donnell QIP '21, STOC '21 Quantum approximate counting with nonadaptive Grover iterations (pdf) R. Venkateswaran, R. O'Donnell  *Author order randomized STACS '21 Explicit near-fully X-Ramanujan graphs (pdf) R. O'Donnell, X. Wu  *Author order randomized FOCS '20 Fooling Gaussian PTFs via local hyperconcentration (pdf) R. O'Donnell, R. Servedio, L.-Y. Tan  *Author order randomized with an appendix by D. Kane STOC '20 Explicit near-Ramanujan graphs of every degree (pdf) S. Mohanty, R. O'Donnell, P. Paredes SIAM Journal on Computing 2021, special section on STOC 2020. STOC '20 Lower bounds for testing complete positivity and quantum separability (pdf) C. Bădescu, R. O'Donnell LATIN '20 The SDP value for random two-eigenvalue CSPs (pdf) S. Mohanty, R. O'Donnell, P. Paredes STACS '20 X-Ramanujan graphs (pdf) S. Mohanty, R. O'Donnell SODA '20 SheraliAdams strikes back (pdf) R. O'Donnell, T. Schramm Theory of Computing 17(9), pp. 1-30 (2021). CCC '19 Learning sparse mixtures of rankings from noisy information (pdf) A. De, R. O'Donnell, R. Servedio. COLT '21 A log-Sobolev inequality for the multislice, with applications (pdf) Y. Filmus, R. O'Donnell, X. Wu To appear, Electronic Journal of Probability ITCS '19 Fooling polytopes (pdf) R. O'Donnell, R. Servedio, L.-Y. Tan To appear, Journal of the ACM STOC '19 The threshold for SDP-refutation of random regular NAE-3SAT (pdf) Y. Deshpande, A. Montanari, R. O'Donnell, T. Schramm, S. Sen SODA '19 SOS lower bounds with hard constraints: think global, act local (pdf) P. Kothari, R. O'Donnell, T. Schramm. ITCS '19 Quantum state certification (pdf) C. Bădescu, R. O'Donnell, J. Wright. QIP '18, STOC '19 On closeness to k-wise uniformity (pdf) R. O'Donnell, Y. Zhao. RANDOM '18 Sharp bounds for population recovery (pdf) A. De, R. O'Donnell, R. Servedio. Theory of Computing 16(6), pp. 1-20 (2020). Sum of squares lower bounds for refuting any CSP (pdf) P. Kothari, R. Mori, R. O'Donnell, D. Witmer. STOC '17 Optimal mean-based algorithms for trace reconstruction (pdf) A. De, R. O'Donnell, R. Servedio. Annals of Applied Probability 29(2), pp. 851-874 (2019). Conference version: STOC '17 Efficient quantum tomography II (pdf) R. O'Donnell, J. Wright. STOC '17 Quantum automata cannot detect biased coins, even in the limit (pdf) G. Kindler, R. O'Donnell. ICALP '17 SOS is not obviously automatizable, even approximately (pdf) R. O'Donnell. ITCS '17 Bounding laconic proof systems by solving CSPs in parallel (pdf) J. Li, R. O'Donnell. SPAA '17 Polynomial bounds for decoupling, with applications (pdf) R. O'Donnell, Y. Zhao. CCC '16 Efficient quantum tomography (pdf) R. O'Donnell, J. Wright. To appear, Journal of the ACM. STOC '16, QIP '16 Remarks on the Most Informative Function Conjecture at fixed mean (pdf) G. Kindler, R. O'Donnell, D. Witmer. Manuscript Beating the random assignment on constraint satisfaction problems of bounded degree (pdf) B. Barak, A. Moitra, R. O'Donnell, P. Raghavendra, O. Regev, D. Steurer, L. Trevisan, A. Vijayaraghavan, D. Witmer, J. Wright. APPROX '15 How to refute a random CSP (pdf) S. R. Allen, R. O'Donnell, D. Witmer. FOCS '15 Optimal bounds for estimating entropy with PMF queries (pdf) C. Caferov, B. Kaya, R. O'Donnell, A. C. C. Say. MFCS '15 The weakness of CTC qubits and the power of approximate counting (pdf) R. O'Donnell, A. C. C. Say. Transactions on Computation Theory 10(2), no. 5 (2018). Quantum spectrum testing (pdf) R. O'Donnell, J. Wright. To appear, Communications of Mathematical Physics (2021). Conference version: STOC '15, QIP '15 One time-traveling bit is as good as logarithmically many (pdf) R. O'Donnell, A. C. C. Say. FSTTCS '14 Conditioning and covariance on caterpillars (pdf) S. R. Allen, R. O'Donnell. ITW '15 Algorithmic signaling of features in auction design (pdf) S. Dughmi, N. Immorlica, R. O'Donnell, L.-Y. Tan. SAGT '15 Convergence, unanimity and disagreement in majority dynamics on unimodular graphs and random graphs (pdf) I. Benjamini, S.-O. Chan, R. O'Donnell, O. Tamuz, L.-Y. Tan. Stochastic Processes and their Applications 126(9), pp. 2719-2733 (2016). Improved NP-inapproximability for 2-variable linear equations (pdf) J. Håstad, S. Huang, R. Manokaran, R. O'Donnell, J. Wright. Theory of Computing 13(19), pp. 1-51 (2017). Conference version: APPROX '15 A composition theorem for parity kill number (pdf) R. O'Donnell, X. Sun, L.-Y. Tan, J. Wright, Y. Zhao. CCC '14 Goldreich's PRG: Evidence for near-optimal polynomial stretch (pdf) R. O'Donnell, D. Witmer. CCC '14 Note (Dec. '21): The proof of Theorem III.2 in this paper is wrong. Thanks to Andrej Bogdanov and Aayush Jain for pointing this out. Hardness of robust graph isomorphism, Lasserre gaps, and asymmetry of random graphs (pdf) R. O'Donnell, J. Wright, C. Wu, Y. Zhou. SODA '14 Testing surface area (pdf) P. Kothari, A. Nayyeri, R. O'Donnell, C. Wu. SODA '14 Learning sums of independent integer random variables (pdf) C. Daskalakis, I. Diakonikolas, R. O'Donnell, R. SIIRVedio, L.-Y. Tan. FOCS '13 A composition theorem for the Fourier Entropy-Influence conjecture (pdf) R. O'Donnell, L.-Y. Tan. ICALP '13 Hypercontractive inequalities via SOS, and the Frankl-Rödl graph (pdf) M. Kauers, R. O'Donnell, L.-Y. Tan, Y. Zhou. Discrete Analysis 2016:4. SODA '14 Approximability and proof complexity (pdf) R. O'Donnell, Y. Zhou. SODA '13 Markov chain methods for small-set expansion (pdf) R. O'Donnell, D. Witmer. Manuscript New NP-hardness results for 3-Coloring and 2-to-1 Label Cover (pdf) P. Austrin, R. O'Donnell, L.-Y. Tan, J. Wright. Transactions on Computation Theory 6(1), pp. 2:1-20 (2014). Preliminary version: APPROX '12, A new point of NP-hardness for 2-to-1 Label Cover Gaussian noise sensitivity and Fourier tails (pdf) G. Kindler, N. Kirshner, R. O'Donnell. Israel Journal of Mathematics 225(1), pp. 71-109 (2018). Conference version: CCC '12 A new point of NP-hardness for Unique Games (pdf) R. O'Donnell, J. Wright. To appear, Journal of the ACM. STOC '12 Linear programming, width-1 CSPs, and robust satisfaction (pdf) G. Kun, R. O'Donnell, S. Tamaki, Y. Yoshida, Y. Zhou. ITCS '12 Note (Sep. '13): Theorem 4.1 in this paper is false; there is",
  "content_length": 26262,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:47"
}