{
  "name": "Ryan J. Leduc",
  "homepage": "http://www.cas.mcmaster.ca/~leduc",
  "status": "success",
  "content": "Ryan Leduc - Associate Professor Ryan Leduc B.eng (Victoria), M.A.Sc. (Toronto), Ph.D. (Toronto), P.Eng. Associate Professor Dept. of Computing and Software Faculty of Engineering McMaster University, Hamilton, Ontario Canada L8S 4K1 Office: ITB/247 E-mail: leduc@mcmaster.ca Tel: 905-525-9140 Ext. 27962 GPG public key: leduc-gpg.asc Research Interests: I joined the Dept. of Computing and Software in August 2001. My doctorate was done with Prof. W.M. Wonham at the Systems Control Group, University of Toronto. My area of research is Discrete-Event Systems (DES). Particular areas of interest are Supervisory Control of DES, hierarchical structure, concurrency and implementation issues, and DES as software and hardware. I am also interested in hierarchical approaches to formal verification of software. I am a licensed Professional Engineer in the province of Ontario. Tools DESpot: DESpot is a discrete-event system (DES) software research tool that supports Hierarchical Interface-Based Supervisory Control and Sampled-Data Supervisory Control. For more information, see here. Software Downloads: Software developed for research purposes can be downloaded here. Undergraduate Courses: SFWR ENG 2DA4: information can be found here. SFWR ENG/CS 2GA3: information can be found here. Graduate Courses: CAS 745: information can be found here. CAS 704: information can be found here. Publications: Journal, Conference, Reports, Theses Journal Papers Aos Mulahuwaish and Ryan J. Leduc, \"Fault-Tolerant Supervisory Control with Permanent Faults,\" International Journal of Control, Dec, 2021. DOI: 10.1080/00207179.2021.2015626. [Online Access]. Robi Malik and Ryan Leduc, \"Hierarchical Modelling of Manufacturing Systems Using Discrete Event Systems and the Conflict Preorder,\" Journal of Discrete Event Dynamic Systems, vol 25, no. 1-2, pp. 177-201, June, 2015. Online publication May, 2014, DOI: 10.1007/s10626-014-0185-7. [Online Access]. Ryan J. Leduc, Yu Wang, and Fahim Ahmed, \"Sampled-Data Supervisory Control,\" Discrete Event Dynamic Systems, vol. 24, no. 4, pp. 541 - 579, Dec, 2014. Online publication November, 2013, DOI: 10.1007/s10626-013-0172-4, [Online Access]. NOTE: This paper should be read before the \"Sampled-Data Controller Implementation\" paper. R. Malik, and R.J. Leduc, \"Compositional Nonblocking Verification Using Generalised Nonblocking Abstractions,\" IEEE Trans. on Automatic Control, vol 58, no 8, pp. 1-13, Aug. 2013. [Online Access]. Yu Wang and R.J. Leduc, \" Sampled-Data Controller Implementation,\" International Journal of Control, vol. 85, no. 9, pp. 1343 - 1360, Sept, 2012. [Online Access]. R.J. Leduc, P. Dai, and R. Song, \"Synthesis Method for Hierarchical Interface-Based Supervisory Control,\" IEEE Trans. on Automatic Control, vol 54, no 7, pp. 1548-1560, Jul. 2009. [Online Access] See also Software Quality Research Laboratory Technical report No. 46. R.J. Leduc, \"Hierarchical Interface-Based Supervisory Control with Data Events,\" International Journal of Control, vol. 82, no. 5, pp. 783 - 800, May, 2009. [Online Access]. See also Software Quality Research Laboratory Technical report No. 44. R.J. Leduc, M. Lawford, and P. Dai, \"Hierarchical Interface-Based Supervisory Control of Flexible Manufacturing System,\" IEEE Trans. on Control Systems Technology, vol. 14, no. 4, pp. 654-668, Jul. 2006. [Online Access]. See also Software Quality Research Laboratory Technical report No. 32. Ryan J. Leduc, Bertil A. Brandin, Mark Lawford, and W.M. Wonham, \"Hierarchical Interface-Based Supervisory Control-Part I: Serial Case,\" IEEE Trans. on Automatic Control, vol 50, no 9, pp. 1322-1335, Sep. 2005. [Online Access]. See also Software Quality Research Laboratory Technical report No. 12. Ryan J. Leduc, Mark Lawford, and W.M. Wonham, \"Hierarchical Interface-Based Supervisory Control-Part II: Parallel Case,\" IEEE Trans. on Automatic Control, vol 50, no 9, pp. 1336-1348, Sep. 2005. [Online Access]. See also Software Quality Research Laboratory Technical report No. 13. Conference Papers Huailiang Liu, Ryan J. Leduc, and S. L. Ricker. Hierarchical Interface-Based Decentralized Supervisory Control. Proc. of 54th IEEE Conf. on Decision and Control, pages 1693-1700, Osaka, Japan, Dec., 2015. Click here to download PDF copy: HIDSC-CDC2015.pdf (410KB). Simon Radel, Aos Mulahuwaish, and Ryan J. Leduc. Fault Tolerant Controllability. Proc. of 2015 American Control Conference, pages 1603-1610, Chicago, USA, July 2015. Click here to download PDF copy: RadelMulahLeduc2015.pdf (227KB). Huailiang Liu, Ryan J. Leduc, Robi Malik and S. L. Ricker. Incremental Verification of Co-Observability in Discrete-Event Systems. Proc. of 2014 American Control Conference, pages 5446-5452, Portland, USA, June 2014. Click here to download PDF copy: acc2014FinalVersion.pdf (365KB). Robi Malik, Ryan Leduc. Hierarchical Interface-Based Supervisory Control using the conflict preorder. Proc. 11th International Workshop on Discrete Event Systems (WODES'12), pages 163-168, Guadalajara, Mexico, 3-5 October 2012. Click here to download PDF copy: hiscMC.pdf (143KB). Wang YU and Ryan J. Leduc. Sampled-Data Controller Implementation. Proc. of 2012 American Control Conference, pages 5287-5293, Montreal, Canada, June, 2012. Click here to download PDF copy: sdContFSMACC2012.pdf (483KB). Ryan Leduc and Yu Wang. Sampled-Data Supervisory Control. Proc. 10th International Workshop on Discrete Event Systems (WODES'10), pages 353-359, Berlin, Germany, Aug 2010. Click here to download PDF copy: sdContwodes2010.pdf (253KB). Ryan Leduc and Robi Malik. A Compositional Approach for Verifying Hierarchical Interface-Based Supervisory Control. Proc. 10th International Workshop on Discrete Event Systems (WODES'10), pages 114-120, Berlin, Germany, Aug 2010. Click here to download PDF copy: wodes2010HISCcv.pdf (179KB). Robi Malik, Ryan Leduc. A Compositional Approach for Verifying Generalised Nonblocking. In Proc. 7th IEEE International Conference on Control and Automation (ICCA'09), pp. 448-453, Christchurch, New Zealand, Dec. 2009. Click here to download PDF copy: icca2009.pdf (108KB). Robi Malik, Ryan Leduc. Generalised Nonblocking. Proc. 9th International Workshop on Discrete Event Systems (WODES'08), pages 340-345, Gothenburg, Sweden, May 2008. Click here to download PDF copy: wodes2008gennb.pdf (114KB). R.J. Leduc. Hierarchical Interface-Based Supervisory Control with Data Events. Proc. of 46th IEEE Conf. on Decision and Control, pages 5910-5917, New Orleans, USA, Dec., 2007. Click here to download PDF copy: HISCLdataECDC.pdf (307KB). Ryan J. Leduc and Pengcheng Dai. Synthesis Method for Hierarchical Interface-based Supervisory Control. Proc. of 26th American Control Conference, pages 4260-4267, New York City, USA, July, 2007. Click here to download PDF copy: daiACC07.pdf (285KB). Raoguang Song and Ryan J. Leduc. Symbolic Synthesis and Verification of Hierarchical Interface-Based Supervisory Control. Proc. of 8th International Workshop on Discrete Event Systems, pages 419-426, Ann Arbor, USA, July, 2006. Click here to download PDF copy: SLwodes06.pdf (277KB). R.J. Leduc. Hierarchical Interface-based Supervisory Control: Command-pair Interfaces. In Proc. of the Third International DCDIS Conference on Engineering Applications and Computational Algorithms, pp. 323-329, Guelph, Ontario, Canada, May 15-18, 2003. Click here to download PDF copy: dcdis2002.pdf (671KB). Click here to download longer version: dcdis2002Long.pdf (1.2MB). R.J. Leduc, M. Lawford, and W.M. Wonham. Hierarchical Interface-based Supervisory Control: AIP Example. In Proc. of the 39th Allerton Conf. on Comm., Contr., and Comp., pp. 396-405, October 3-5, 2001. Click here to download zipped postscript copy PCaseAIPEg.ps.zip (500KB) or PDF copy PCaseAIPEg.pdf (650KB). R.J. Leduc, W.M. Wonham, and M. Lawford. Hierarchical Interface-based Supervisory Control: Parallel Case. In Proc. of the 39th Allerton Conf. on Comm., Contr., and Comp., pp. 386-395, October 3-5, 2001. Click here to download zipped postscript copy PCase.ps.zip (365KB) or PDF copy PCase.pdf (430KB). R.J. Leduc, B.A. Brandin, W.M. Wonham, and M. Lawford. Hierarchical Interface-based Supervisory Control: Serial Case. In Proc. of the 40th Conf. Decision Contr., pp. 4116-4121, Orlando, USA, Dec. 4-7, 2001. Click here to download zipped postscript copy cdc2001.ps.zip (464KB) or PDF copy cdc2001.pdf (645KB). R.J. Leduc, B.A. Brandin, and W.M. Wonham. Hierarchical Interface-Based Non-blocking Verification. In Proceedings of Canadian Conference on Electrical and Computer Engineering, pp. 1-6, May 7, 2000. Click here to download zipped postscript copy can2000.ps.zip (186KB) or PDF copy can2000.pdf (426KB). R.J. Leduc and W.M. Wonham. PLC Implementation of a DES Supervisor for a Manufacturing Testbed. In Proc. of Thirty-third Annual Allerton Conference on Communication, Control, and Computing, pp. 519-528, Oct 4-6, 1995. Click here to download zipped postscript copy allt95.ps.zip (91KB) or PDF copy allt95.pdf (193KB). R.J. Leduc and W.M. Wonham. Discrete Event Systems Modeling and Control of a Manufacturing Testbed. In Proc. of Canadian Conference on Electrical and Computer Engineering, Vol. II, pp. 793-796. Sept. 5-8, 1995. Click here to download zipped postscript copy can95.ps.zip (65KB) or PDF copy can95.pdf (157KB). Technical Reports Hina Mahmood, and Ryan J. Leduc. Automatic Disablement of tick Event in Sampled-Data Supervisory Control, Computing and Software Technical Report CAS-23-07-RL, Department of Computing and Software, McMaster University, July 2023. [Online Access] Aos Mulahuwaish, Simon Radel, Oriane Dierikx, Amal Alsuwaidan, and Ryan J. Leduc. Fault Tolerant Controllability and Nonblocking, Computing and Software Technical Report CAS-15-12-RL, Department of Computing and Software, McMaster University, December 2015. [Online Access] Huailiang Liu, Ryan J. Leduc, and S. L. Ricker. Decentralized Control Using the Hierarchical Interface-based Supervisory Control App",
  "content_length": 15961,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:45"
}