{
  "name": "Ryan P. Adams",
  "homepage": "https://www.cs.princeton.edu/~rpa",
  "status": "success",
  "content": "Ryan P. Adams, Princeton University Ryan P. Adams Professor of Computer Science Princeton University Department of Computer Science 35 Olden Street, Room 411 Princeton, NJ 08540-5233 Recently, someone has been sending out scam/phishing emails claiming that I am seeking applications for research internships. Please do not engage with these emails but instead report them to phishbowl@princeton.edu. I am interested in machine learning, artificial intelligence, and computational statistics, with applications across science and engineering. I have broad interests but often work on probabilistic methods and approximate Bayesian inference. I am Associate Chair of the Computer Science Department, the co-director of the AI2 Initiative, and Associated Faculty in the Program in Applied and Computational Mathematics. I co-founded Whetlab (sold to Twitter in 2015) and formerly co-hosted the Talking Machines podcast. I was faculty at Harvard from 2011 to 2016 and was at Twitter and then Google Brain before joining the faculty at Princeton in 2018. I call my group the Laboratory for Intelligent Probabilistic Systems (LIPS). Teaching Spring 2024: COS Independent Work Seminar Fall 2023: COS 302 -- Mathematics for Numerical Comp. and Machine Learning Spring 2022: COS 598C -- Advanced Topics in Computer Science: Artificial Mechanical Intelligence Fall 2022: COS 302 -- Mathematics for Numerical Comp. and Machine Learning Spring 2021: COS 302 -- Mathematics for Numerical Comp. and Machine Learning Spring 2020: COS 302 -- Mathematics for Numerical Comp. and Machine Learning Fall 2019: COS 597C -- Advanced Topics in Automatic Differentiation Spring 2019: COS 324 -- Introduction to Machine Learning Fall 2018: COS 324 -- Introduction to Machine Learning Current Graduate Students and Postdocs Joshua Aduol Cyrill Boesch Alex Guerra Nicholas Richardson Geoffrey Roeder Olga Solodova Yaqian Tang Sowmya Thanvantri Kathryn Wantlin Daniel Williams Jenny Ni Zhan Cindy Zhang Former Students and Postdocs Jordan Ash, Microsoft Research Elaine Angelino Sam Barnett, Osmo Alex Beatson, Co-founder of Axiom Bio Diana Cai, Flatiron Institute SueYeon Chung, Harvard University Faculty Finale Doshi-Velez, Harvard University Faculty David Duvenaud, University of Toronto Faculty Michael Gelbart, University of British Columbia Faculty Jose Miguel Hernandez Lobato, University of Cambridge Faculty Matthew Johnson, Google Brain Research Scientist Scott Linderman, Stanford University Faculty Sulin Liu, MIT Postdoctoral Fellow Dougal Maclaurin, Google Brain Research Scientist Eder Medina Andrew Miller, Apple Research Scientist Mehran Mirramezani, NC State University Faculty Shamim Nemati, UC San Diego Faculty Deniz Oktay, OpenAI Jad Rahme, DE Shaw Yakir Reshef, MD/PhD Fellow at Brigham and Women's Hospital Oren Rippel, Co-founder and CTO of WaveOne Ardavan Saeedi, Butterfly Network Ari Seff, OpenAI Jasper Snoek, Google Brain Research Scientist Xingyuan Sun, Citadel Jose Garrido Torres, Microsoft Research Tianju Xue, Faculty at Shanghai Jiao Tong University",
  "content_length": 3058,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:48"
}