{
  "name": "Ryan Stansifer",
  "homepage": "https://cs.fit.edu/~ryan",
  "status": "success",
  "content": "Ryan Stansifer Information Ryan Stansifer Professor Emeritus EE and Computer Science Florida Institute of Technology 150 West University Boulevard Melbourne, Florida 32901-6975 WWW: http://cs.fit.edu/~ryan/ Former students are also encouraged to send e-mail to me, and let me know what they are doing. Professional interests The areas of Computer Science I'm most interested in are the following: programming languages compilers internationalization more specifically: functional programming and type systems typed, object-oriented programming static analysis of programs the Java programming language software development and formal verification character sets for representing natural languages Ph.D Students Daniel Wetklow Steve Atkin In the international competition for the Best Thesis Award organized by Localisation Research Centre of the University of Limerick, Ireland, honorable mention is given to: \"Steven Atkin of the Florida Institute of Technology (USA) for his PhD thesis 'A Framework for Multilingual Information Processing.' His thesis presents general software globalisation issues, character encoding systems, issues around bi-directional text and the enhancement of plain text as a basis for the application of metacode layers with exemplary academic depth and scholarship.\" Ramon Zatarain Maria Lucia Barron Lajos Nagy Research Sundry papers of mine in gzipped, PostScript format: Completeness of Propositional Logic as a Program Presburger's Article on Integer Arithmetic: Remarks and Translation Explaining type errors in polymorphic languages Solving diagramless crossword puzzles The calculation of Easter Type reconstruction for coercion polymorphism (SAC) Method reuse in typed object-oriented languages Modula-3 as a Database Programming Language Stansifer, Ryan. The Study of Programming Languages. Prentice Hall, 1995. ISBN: 0-13-726936-6 Miscellaneous In fact, I do not think that the search for high-level programming languages that are more and more satisfactory from a logical point of view can stop short of anything but a language in which (constructive) mathematics can be adequately expressed. Per Martin-Löf I have always wished that my computer would be as easy to use as my telephone. My wish has come true. I no longer know how to use my telephone. Bjarne Stroustrup Alfred North Whitehead and Bertrand Russell, Principia Mathematica, volume 3, second edition, Cambridge University Press, Cambridge, England, 1927, page 91. Friedrich Ludwig Gottlob Frege, Grundgesetze der Arithmetik, volume 2, H. Pohle, Jena, 1903, end of section 143 \"Aufbau,\" page 178.",
  "content_length": 2598,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:50"
}