{
  "name": "Rym Zalila-Wenkstern",
  "homepage": "http://www.utdallas.edu/~rmili",
  "status": "success",
  "content": "Dr. Rym Zalila Wenkstern Dr. Rym Zalila Wenkstern Home Research Teaching Service News Professor Department of Computer Science The University of Texas at Dallas Dr. Rym Zalila-Wenkstern is a Professor of Computer Science at the Erik Jonsson School of Engineering and Computer Science. She holds a Ph.D. in Computer Science from the University of Ottawa, Canada, and the Doctorat de Specialite (Ph.D.) in Computer Science from the University of Tunis, Tunisia. Dr. Wenkstern is the Founder and Director of the UT Dallas Center for Smart Mobility (COSMO). The Center's mission is to provide advanced solutions for smart vehicle technologies and transportation infrastructures to improve safety, reduce emissions and enhance mobility and transport justice for all urban users. Dr. Wenkstern is also the Director of the Multi-Agent and Visualization Systems lab. Her research focuses on all aspects of engineering large, complex, real-world systems using the agent paradigm, with an emphasis on Smart Cities challenges. She has served on several international conference organizing committees and numerous program committees. Dr. Zalila-Wenkstern's research recently received media attention with a news segment on CBS 11 News, press articles in Dallas Innovates and Community Impact, and interviews with the Dallas Business Journal and Smart Cities Connect. In addition, Dr. Wenkstern's research on Intelligent Transportation Systems received a Smart 50 Award, which annually recognizes the most innovative and influential global smart projects and was a finalist at the Tech Titan Awards, which recognizes the elite in North Texas technology. Her work on agent-based simulation systems received twice the AAMAS Best Demo/System Award, Best Paper Award at Agent-Directed Simulations, and Overall Best Paper Award at Spring Simulation Conference. Dr. Zalila-Wenkstern founded the Executive Masters of Science in Software Engineering program at UT Dallas in 2012 and served as the program's Director from 2012 until 2017. She has worked as a consultant for U.S. and European organizations. Dr. Zalila-Wenkstern was recognized twice for her Outstanding Contribution to the Department of Computer Science and received twice the Erik Jonsson School's Teaching Excellence Award. Office Engineering and Computer Science South Building, ECSS 4.228 The University of Texas at Dallas 2601 North Floyd Road Richardson, TX 75080 Mailing Address Department of Computer Science The University of Texas at Dallas MS EC 31, P.O. Box 830688 Richardson, TX 75080, USA Contact Email: rymw@utdallas.edu Phone: 972-883-2091 <",
  "content_length": 2601,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:52"
}