{
  "name": "Rynson W. H. Lau",
  "homepage": "https://www.cs.cityu.edu.hk/~rynson",
  "status": "success",
  "content": "Home Page: Rynson W.H. Lau B.Sc. (Kent), Ph.D. (Cambridge) Research Interests: Computer Graphics, Computer Vision, and AI I received a first-class (top) B.Sc. honors degree in Computer Systems Engineering from University of Kent and a Ph.D. degree in Computer Science from University of Cambridge. I have been on the faculty of Durham University, City University of Hong Kong, and The Hong Kong Polytechnic University. I am an Honorary Professor at Swansea University, United Kingdom. My research interests include computer graphics, computer vision, and the development of deep-learning techniques for solving computer graphics/vision problems. The papers from my group appear in SIGGRAPH, SIGGRAPH Asia, CVPR, ICCV, ECCV, AAAI and NeurIPS. We also have papers in TVCG, IJCV, TPAMI, and TIP. Refer to my publications for more information. I received an Adobe Research Gift in 2023. I serve on the Editorial Board of International Journal of Computer Vision (IJCV). I am glad to receive the Springer Nature Editorial Contribution Award 2025 for my contributions to IJCV. I am also serving as the SPC of AAAI 2026. I served as the Guest Editor of a number of journal special issues, including ACM Trans. on Internet Technology, IEEE Trans. on Multimedia, IEEE Trans. on Visualization and Computer Graphics, and IEEE Computer Graphics & Applications. In addition, I also served on the committees of a number of conferences, including Program Co-Chair of ACM VRST 2004 (Hong Kong), ICWL 2005 (Hong Kong), ICAT 2006 (Hangzhou, China), ICEC 2007 (Shanghai, China), ACM MTDL 2009 (Beijing, China), IEEE U-Media 2010 (Jinhua, China), and Conference Co-Chair of CASA 2005 (Hong Kong), ACM VRST 2005 (Monterey, California), ICWL 2007 (Edinburgh, U.K.), ACM MTDL 2010 (Firenze - Italy), ACM VRST 2010 (Hong Kong), ACM VRST 2014 (Edinburgh, U.K.). Research Publications on Computer Graphics, Computer Vision and Virtual Reality Main Research Projects Our Research Team: Students and Staff Guest-Editorialship of Special Issues IEEE Computer Graphics & Applications on \"Virtual Reality Software and Technology\", Sept./Oct. 2015 issue Guest Editors: Taku Komura, Rynson Lau, Ming Lin, Dinesh Manocha, and Weiwei Xu IEEE Trans. on Learning Technologies on \"Game-Based Learning\", Oct./Dec. 2010 issueGuest Editors: Timothy Shih, Kurt Squire, and Rynson Lau IEEE Internet Computing on \"Emerging Technologies and Applications for e-Learning\", Jul./Aug. 2009 issue Guest Editors: Qing Li, Rynson Lau, Benjamin Wah, and Helen Ashman IEEE Trans. on Knowledge and Data Engineering on \"Knowledge and Data Engineering for e-Learning\", Apr. 2009 issueGuest Editors: Qing Li, Rynson Lau, Dennis McLeod, and Jiming Liu ACM Trans. on Internet Technology on \"Internet Technologies for Distance Education\", Feb. 2008 issue Guest Editors: Qing Li, Rynson Lau, Dennis McLeod, and Timothy Shih IEEE Trans. on Multimedia on \"Distributed Media Technologies and Applications\", April 2006 issue Guest Editors: Rynson Lau, Benjamin Wah, Qing Li, and C.L. Liu Computer Animation and Virtual Worlds on \"Game Technologies\", Feb. 2006 issue Giest Editors: Rynson Lau, Daniel Cohen-Or, Baining Guo, and John Buchanan Presence on \"Advances in Collaborative Virtual Environments\", June 2004 issue Guest Editors: Rynson Lau and Michael Zyda IEEE Computer Graphics & Applications on \"Web Graphics\", Jan./Feb. 2003 issueGuest Editors: Rynson Lau and Tosiyasu L. Kunii Forthcoming Graphics/Vision/Multimedia Conferences Teaching First semester teaching (2025/2026): Multimedia Technologies and Applications (CS4185) Second semester teaching (2024/2025): Virtual Reality Technologies and Applications (CS4188/CS5188) Other Information Travel Information Local Information (government organizations, local companies) Online Dictionary Online Bibles CityU Information Department of Computer Science City University of Hong Kong Tat Chee Avenue, Kowloon HONG KONG Telephone: +852 3442-7525 rynson dot lau at cityu.edu.hk Last updated in August, 2025.",
  "content_length": 3998,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:50"
}