{
  "name": "Ryuichi Shigemoto",
  "homepage": "https://ist.ac.at/research/research-groups/shigemoto-group",
  "status": "success",
  "content": "ISTA | Shigemoto Group HomeResearchShigemoto Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Shigemoto Group Molecular Neuroscience Information transmission, the formation of memory, and plasticity are all controlled by various molecules at work in the brain. Focusing on the localization and distribution of molecules in brain cells, the Shigemoto group investigates their functional roles in higher brain functions. The release of neurotransmitters from a nerve cell into the synapse, where they act on receptors of the connecting nerve cell, is the primary process of information transmission and computation in the brain. The Shigemoto group studies the localization of single neurotransmitter receptors, ion channels, and other functional molecules to understand the molecular basis of neuronal information processing. The group has pioneered several methods for studying the localization of functional molecules at unprecedented sensitivity, detecting and visualizing even single membrane proteins in nerve cells using SDS-digested freeze-fracture replica labeling. This method was recently combined with ‘Flash & Freeze’ to visualize millisecond dynamics of presynaptic molecules relative to vesicle fusion events in the active zone. They apply these methods to investigate the mechanisms of signaling and plasticity in the brain, with questions ranging from neurotransmission to learning. Group Leader Ryuichi Shigemoto Professor +43 2243 9000 5201 Ryuichi.Shigemoto@ist.ac.at Administrative Support Dayana Shaybazyan Assistant to Professors +43 2243 9000 2231 Dayana.Shaybazyan@ist.ac.at Team Pradeep Bhandari Research Technician Pradeep.Bhandari@ist.ac.at Elodie Le Monnier Research Technician elodie.le-monnier@ist.ac.at Jacqueline-Claire Montanaro-Punzengruber Research Technician jacqueline.montanaro@ist.ac.at Abdylla Parahadov PhD Student Abdylla.Parahadov@ist.ac.at Utsa Roy PhD Student UTSA.ROY@ist.ac.at Hana Stefanickova PhD Student hana.stefanickova@ist.ac.at Elena Säckl Research Technician Elena.Saeckl@ist.ac.at Naoki Zenmyo Postdoc Naoki.Zenmyo@ist.ac.at Cihan Önal Postdoc hueseyincihan.oenal@ist.ac.at Current Projects New chemical labeling methods for high resolution EM visualization of single molecules | Ultrastructural localization and function of receptors and ion channels in the brain | Flash & Freeze-fracture | Mechanisms of long-term memory formation | Left-right asymmetry of neuronal circuitry Publications Aguado C, Alfaro-Ruiz R, Martínez-Poyato ML, Moreno-Martínez AE, García-Madrona S, Roldán-Sastre A, Alonso-Gómez P, Fernández M, Puertas-Avendaño R, Shigemoto R, Martemyanov KA, Luján R. 2025. Developmental regulation of GABAB receptors and downstream molecules in the mouse brain. Histology and Histopathology. 40(12), 1967–1984. View Önal C. 2025. Asymmetrical modulation of fear expression via GABAB receptors in the mouse medial habenula. Institute of Science and Technology Austria. View Martín‐Belmonte A, Aguado C, Alfaro‐Ruiz R, Kulik A, de la Ossa L, Moreno‐Martínez AE, Alberquilla S, García‐Carracedo L, Fernández M, Fajardo‐Serrano A, Aso E, Shigemoto R, Martín ED, Fukazawa Y, Ciruela F, Luján R. 2025. Nanoarchitecture of CaV>2.1 channels and GABAB receptors in the mouse hippocampus: Impact of APP/PS1 pathology. Brain Pathology. 35(2), e13279. View Kim O, Okamoto Y, Kaufmann W, Brose N, Shigemoto R, Jonas PM. 2024. Presynaptic cAMP-PKA-mediated potentiation induces reconfiguration of synaptic vesicle pools and channel-vesicle coupling at hippocampal mossy fiber boutons. PLoS Biology. 22(11), e3002879. View Zupančič M, Keimpema E, Tretiakov EO, Eder SJ, Lev I, Englmaier L, Bhandari P, Fietz SA, Härtig W, Renaux E, Villunger A, Hökfelt T, Zimmer M, Clotman F, Harkany T. 2024. Concerted transcriptional regulation of the morphogenesis of hypothalamic neurons by ONECUT3. Nature Communications. 15, 8631. View View All Publications ReX-Link: Ryuichi Shigemoto Career Since 2013 Professor, Institute of Science and Technology Austria (ISTA)1998 – 2014 Professor, National Institute for Physiological Sciences, Okazaki, Japan1990 – 1998 Assistant Professor, Kyoto University Faculty of Medicine, Kyoto, Japan1994 PhD, Kyoto University, Japan 1985 MD, Kyoto University Faculty of Medicine, Japan Selected Distinctions ISI Highly Cited Researcher2017 Member, Academia Europaea2016 ERC Advanced Grant2000 ISI Citation Laureate Award Additional Information Download CVERC Advanced Grant website Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6897,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:56"
}