{
  "name": "Rúben H. de Freitas Gouveia",
  "homepage": "https://www.rubengouveia.com",
  "status": "success",
  "content": "Rúben Gouveia Assistant Professor at University of Lisbon's Faculty of Sciences PhD's: Tina Ekhtiar Lara Siering Naomi Stralen Teaching: Follow Building C6, room 6.3.17 Email ResearchGate Google Scholar ORCIDI am an Assistant Professor at the University of Lisbon’s Faculty of Science. My research has focused on designing, developing and evaluating tools that support health and wellbeing. I hold a PhD in Human-Computer Interaction from the Univeristy of Madeira, where I was the holder of a National PhD studentship awarded by the Portuguese Foundation for Science and Technology. Before moving to Lisbon, I worked as an Assistant Professor at the University of Twente.I often publish in top-tier venues in the field of HCI, such as CHI and Ubicomp. My full list of publications can be found on google scholar.Select Recent Papers Goals for Goal Setting: A Scoping Review on Personal Informatics Tina Ekhtiar, Armagan Karahanoğlu, Rúben Gouveia, Geke Ludden. DIS 2023 pdf Honorable Mention (Top 5%)This Watchface Fits with my Tattoos: Investigating Customisation Needs and Preferences in Personal Tracking Rúben Gouveia, Daniel Epstein. CHI 2023 pdfTransitions in Personal Informatics: Investigating Self-Tracking During Moments of Change Catrin Feron, Tina Ekhtiar, Rúben Gouveia. NordiCHI 2022 pdfReflection During Goal Setting: An Analysis of Popular Personal Informatics Apps Tina Ekhtiar, Rúben Gouveia, Armagan Karahanoğlu, Geke Ludden. DRS 2022 pdfHow Are Sports-Trackers Used by Runners? Running-Related Data, Personal Goals, and Self-Tracking in Running. Armagan Karahanoğlu, Rúben Gouveia, Jasper Reenalda, Geke Ludden Sensors 2022 pdf | publisherActivity Tracking in vivo Rúben Gouveia, Evangelos Karapanos, Marc Hassenzahl CHI 2018. pdf | talk slides | recording talk | publisher",
  "content_length": 1794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:54"
}