{
  "name": "Rüdiger Schack",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/ruediger-schack",
  "status": "success",
  "content": "Ruediger Schack - Royal Holloway Research Portal Ruediger Schack Professor Professor of Mathematics, Department of MathematicsQuantum Dynamics Phone+44 1784 443097EmailR.Schackrhul.acuk TW20 0EX Personal profile Research interestsMy main research interests are quantum information theory, quantum cryptography and quantum Bayesianism. Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 62 Article 16 Conference contribution 5 Chapter Research output per year Research output per year QBism's account of quantum dynamics and decoherenceDeBrota, J. B., Fuchs, C. A. & Schack, R., 6 Nov 2024, In: Physical Review A. 110, 052205.Research output: Contribution to journal › Article › peer-review Open AccessFile 24 Downloads (Pure) When will Two Agents Agree on a Quantum Measurement Outcome? Intersubjective Agreement in QBismSchack, R., 5 Oct 2024, In: International Journal of Theoretical Physics. 63, 9 p., 254.Research output: Contribution to journal › Article › peer-review Open Access A QBist reads Merleau-PontySchack, R., 5 Dec 2023, Phenomenology and QBism: New Approaches to Quantum Mechanics. Berghofer, P. & Wiltsche, H. A. (eds.). New York: Routledge, p. 144-153 10 p. (Routledge Studies in the Philosophy of Mathematics and Physics).Research output: Chapter in Book/Report/Conference proceeding › Chapter Open AccessFile 5 Downloads (Pure) Respecting One’s Fellow: QBism’s Analysis of Wigner’s FriendDeBrota, J. B., Fuchs, C. A. & Schack, R., 18 Aug 2020, In: Foundations of Physics. 16 p.Research output: Contribution to journal › Article › peer-review Homer Nodded: Von Neumann’s Surprising OversightMermin, N. D. & Schack, R., Sept 2018, In: Foundations of Physics. 48, 9, p. 1007-1020 14 p.Research output: Contribution to journal › Article › peer-review Open Access View all 83 research outputs Projects 3 Finished Projects per year What Is Metrology If Quantum Measurements Don’t Reveal A Pre-Existing Reality?Schack, R. (PI)John Templeton Foundation1/09/22 → 31/08/25Project: Research QBist causal networksSchack, R. (PI)FQXI1/03/17 → 31/12/17Project: Research Teaching FellowshipSchack, R. (PI)Berlin Institute for Advanced Study1/09/09 → 31/07/10Project: Research",
  "content_length": 2510,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:57"
}