{
  "name": "Rüdiger Kapitza",
  "homepage": "https://www.ibr.cs.tu-bs.de/users/kapitza",
  "status": "success",
  "content": "Ruediger Kapitza Menü Suche IBR LoginInstitut für Betriebssysteme und Rechnerverbund News Wir über uns Gesamtes Team Anreise Raumplan Projekte Veröffentlichungen Software News Archiv Connected and Mobile Systems Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Software Datensätze Verlässliche Systemsoftware Übersicht Team Lehre Arbeiten & Jobs Forschung Publikationen Algorithmik Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Mikroprozessorlabor Studium Wintersemester 2025/2026 Sommersemester 2025 Abschlussarbeiten Service Bibliothek Mailinglisten Webmail Knowledgebase Wiki Account Management Service-Status Spin-Offs Docoloc bliq (formerly AIPARK) Confidential Technologies Forschungsverbünde IST.hub Prof. Dr. Rüdiger KapitzaEhemaliger AbteilungsleiterFAU Erlangen-NürnbergLehrstuhl für Informatik 16rrkapitz[[at]]ibr.cs.tu-bs.de Die Arbeitsgruppe unter der Leitung von Prof. Dr. Rüdiger Kapitza verlässt zum Wintersemester 2022/2023 die TU Braunschweig und wechselt an die FAU Erlangen-Nürnberg. Der Prozess einer Wiederbesetzung der Abteilung am IBR mit einer ähnlichen inhaltlichen Ausrichtung hat bereits begonnen. Der Master-Lehrbetrieb ruht bis dahin. Für Bachelor-/Grundlagenveranstaltungen wird vorübergehend ein Vertretungsbetrieb eingerichtet. Interessengebiete Systemsoftware und Verteilte Systeme Vertrauenswürdige Ausführung Fehler- und Einbruchstolerante Middleware Lehre Eine Uebersicht der Lehrveranstaltungen unserer Arbeitsgruppe findet sich auf den enstprechenden Seiten des Instituts. Aktuelle Informationen zu jedem Semester stehen unter dem jeweiligen Semestereintrag. Laufende Projekte Informationen zu den Forschungsprojekten. Aktuelle Veröffentlichungen David Goltzsche, Manuel Nieke, Thomas Knauth and Rüdiger Kapitza: AccTEE: A WebAssembly-based Two-way Sandbox for Trusted Resource Accounting, in Proceedings of the 20th International Middleware Conference, Middleware '19, Davis, CA, USA, ACM, 2019 (goltzsche2019acctee, DOI, BibTeX, Folien) Stefan Brenner and Rüdiger Kapitza: Trust More, Serverless, in Proceedings of the 12th ACM International Conference on Systems and Storage (SysTor'19), Haifa, Israel, Seite 33-43, 2019 (systor19lambda, DOI, BibTeX) Vasily A. Sartakov, Stefan Brenner, Sonia Ben Mokhtar, Sara Bouchenak, Gaël Thomas and Rüdiger Kapitza: EActors: Fast and flexible trusted computing using SGX, in 19th International Middleware Conference Proceedings (Middleware'18), ACM, 2018 (sartakov18eactors, BibTeX) Alle akutellen Veroeffentlichungen Ausgewaehlte Veröffentlichungen Johannes Behl, Tobias Distler and Rüdiger Kapitza: Hybrids on Steroids: SGX-based High Performance BFT, in Proceedings of the 12th European Conference on Computer Systems (EuroSys '17), 2017 (behl17hybster, BibTeX) Björn Cassens, Simon Ripperger, Martin Hierold, Frieder Mayer and Rüdiger Kapitza: Automated Encounter Detection for Animal-Borne Sensor Nodes, in International conference on embedded wireless systems and networks, Uppsala, Sweden, 2017 (cassens2017ewsn, BibTeX) Nico Weichbrodt, Anil Kurmus, Peter Pietzuch and Rüdiger Kapitza: AsyncShock: Exploiting Synchronisation Bugs in Intel SGX Enclaves, in Proceedings of the 21st European Symposium on Research in Computer Security (ESORICS 2016), 2016 (weichbr16esorics, BibTeX) Johannes Behl, Tobias Distler and Rüdiger Kapitza: Consensus-Oriented Parallelization: How to Earn Your First Million, in Proceedings of the 16th Annual Middleware Conference (Middleware '15), Seite 173-184, ACM, 2015 (behl15cop, DOI, BibTeX) Anil Kurmus, Reinhard Tartler, Daniela Dorneanu, Bernhard Heinloth, Valentin Rothberg, Andreas Ruprecht, Wolfgang Schröder-Preikschat, Daniel Lohmann and Rüdiger Kapitza: Attack Surface Metrics and Automated Compile-Time OS Kernel Tailoring, in Proceedings of the 20th Network and Distributed System Security Symposium (NDSS '13), Internet Society (ISOC), San Diego, CA United States, 2013 (kurmus13ndss, BibTeX) Rüdiger Kapitza, Johannes Behl, Christian Cachin, Tobias Distler, Simon Kuhnle, Seyed Vahid Mohammadi, Wolfgang Schröder-Preikschat and Klaus Stengel: CheapBFT: Resource-efficient Byzantine Fault Tolerance, in Proceedings of the EuroSys 2012 Conference (EuroSys '12), European Chapter of ACM SIGOPS, Bern, Switzerland, Seite 295-308, 2012 (kapitza12eurosys, DOI, BibTeX) Meine Veröffentlichungsliste Aktuelle Programmkomitees etc.(2014-2021) Middleware '21 (Program Committee) DSN '21 (Program Commitee) CCGrid '21 (Program Commitee) Middleware '20 (Program Co-Chair) EWSN '20 (Program Commitee) DSN '20 (Program Commitee) SysTEX '19 (Program Committee and Steering Committee) DSN '19 (Program Commitee) SERIAL '18 (Program Co-Chair) EuroSys '18 (Program Commitee) Middleware '18 (Program Committee) SRDS '18 (Program Committee) DSN '18 (Program Commitee) ICDCS '18 (Program Commitee) Ada-Europe '18 (Program Commitee) SysTEX '18 (Program Committee and Steering Committee) SERIAL '17 (Program Co-Chair) SysTEX '17 (Program Co-Chair) Opodis '17 (Program Committee) Middleware '17 (Program Committee) DSN '17 (Program Committee) SysTEX '16 (Program Co-Chair) ARM '16 (Program Co-Chair) Opodis '16 (Program Committee) Middleware '16 (Program Committee) ICDCS '16 (Program Committee) DAIS '16 (Program Committee) EuroSys '15 (Program Committee) Opodis '15 (Program Committee) Middleware '15 (Program Committee) TRUST '15 (Program Committee) SRDS '15 (Program Committee) Middleware '14 (Program Committee) ACM ASIACCS '14 (Program Committee) DCDV '14 (Program Committee) CrossCloud '14 (Program Committee) ETX 2014 - Eclipse Technology eXchange Workshop (Program Committee) ACM SAC DADS '14 (Program Committee) aktualisiert am 13.12.2022, 16:04, verwaltet von Prof. Dr. Rüdiger Kapitza Für alle Stellen der TU Braunschweig Jobbörse des Career Service Merchandising Sponsoring- & Spendenleistungen Drittmittelgeförderte Forschungsprojekte Vertrauenspersonen für Hinweisgeber Für Studierende Semestertermine Lehrveranstaltungen Studiengänge von A-Z Informationen für Erstsemester TUCard Interne Tools Status GITZ-Dienste Handbuch für TYPO3 (Intern) Corporate Design-Toolbox (Intern) Glossar (DE-EN) Meine Daten ändern Hochschulöffentliche Bekanntmachungen Kontakt Technische Universität Braunschweig Universitätsplatz 2 38106 Braunschweig Postfach: 38092 Braunschweig Telefon: +49 (0) 531 391-0 Anreise © Technische Universität Braunschweig Impressum Datenschutz Barrierefreiheit",
  "content_length": 6444,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:56"
}