{
  "name": "Rüdiger L. Urbanke",
  "homepage": "https://people.epfl.ch/rudiger.urbanke",
  "status": "success",
  "content": "EPFL - Rüdiger Urbanke Données administratives Rüdiger Urbanke rudiger.urbanke@epfl.ch +41 21 693 76 92 vCard Professeur ordinaire, Laboratoire de théorie des communications EPFL IC IINFCOM LTHCINR 116 (Bâtiment INR)Station 141015 Lausanne +41 21 693 76 92 +41 21 693 76 95 Office: INR 116 EPFL › IC › IINFCOM › LTHC Site web: https://lthcwww.epfl.ch/ Professeur ordinaire, EDIC - Enseignement +41 21 693 76 92 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDIC-ENS Biographie Prix et distinctions Publications Enseignement et PhD Formation | 1992 – 1995 WashU Dirigée par Bixio Rimoldi | 1991 – 1992 WashU Dirigée par Bixio Rimoldi | 1985 – 1990 TU Wien Prix et distinctions IEEE (Institute of Electrical and Electronics Engineers) 2011 IEEE (Institute of Electrical and Electronics Engineers) 2014 IEEE Information Theory Society 2023 IEEE (Institute of Electrical and Electronics Engineers) 2023 IEEE (Institute of Electrical and Electronics Engineers) 2021 ACM Symposium on Theory of Computing (STOC) 2016 IEEE (Institute of Electrical and Electronics Engineers) 2013 2011 2009 2002 Interpolation of Quantum Polar Codes and Quantum Reed-Muller CodesK. Hidaka; D. Abdelhadi; R. Urbanke2025. 2025 IEEE Information Theory Workshop (ITW), Sydney, Australia, 2025-09-29 - 2025-10-03. p. 1 - 7. DOI : 10.1109/itw62417.2025.11240456.Detailed recordView at publisherA Vector-Based Algorithm for Generating Complete Balanced Reaction Sets with Arbitrary Numbers of ReagentsN. Yilmaz; P. Kozub; S. Kozub2025Detailed recordView at publisherVector-Based Approach to the Stoichiometric Analysis of Multicomponent Chemical Reactions: The Case of Black PowderP. Kozub; N. Yilmaz; S. Kozub2025Detailed recordView at publisherReed-Muller Codes for Quantum Pauli and Multiple Access ChannelsD. Abdelhadi; C. Sandon; E. Abbe; R. Urbanke2025. 2025 IEEE International Symposium on Information Theory, Ann Arbor, MI, USA, 2025-06-22 - 2025-06-27. DOI : 10.1109/isit63088.2025.11195303.Detailed recordView at publisherFederated One-Shot Learning with Data Privacy and Objective-HidingM. Egger; R. Urbanke; R. BitarIEEE Transactions on Information Forensics and Security. 2025. DOI : 10.1109/tifs.2025.3570132.Detailed recordView at publisherNoisy Quantum Communication and ComputationD. K. S. AbdelhadiLausanne, EPFL, 2025. DOI : 10.5075/epfl-thesis-10588. Detailed recordView at publisherEntanglement Sharing Across a Damping-Dephasing ChannelV. Siddhu; D. Abdelhadi; T. Jochym-O’Connor; J. A. Smolin2024. 2024 IEEE International Symposium on Information Theory, Athens, Greece, 2024-07-07 - 2024-07-12. p. 1432 - 1437. DOI : 10.1109/isit57864.2024.10619242.Detailed recordView at publisherRandom matrix methods for high-dimensional machine learning modelsA. P. M. BodinLausanne, EPFL, 2024. DOI : 10.5075/epfl-thesis-10524. Detailed recordView at publisherBeyond worst-case analysis, with or without predictionsA. MaggioriLausanne, EPFL, 2023. DOI : 10.5075/epfl-thesis-9958. Detailed recordView at publisherSymmetry in design and decoding of polar-like codesK. IvanovLausanne, EPFL, 2022. DOI : 10.5075/epfl-thesis-8989. Detailed recordView at publisherPolar Codes Do Not Have Many Affine AutomorphismsK. Ivanov; R. Urbanke2022. IEEE International Symposium on Information Theory (ISIT), Espoo, FINLAND, 2022-06-26 - 2022-07-01. p. 2374 - 2378. DOI : 10.1109/ISIT50566.2022.9834782.Detailed recordView at publisherOn the Efficiency of Polar-Like Decoding for Symmetric CodesK. Ivanov; R. L. UrbankeIeee Transactions On Communications. 2022. DOI : 10.1109/TCOMM.2021.3121442.Detailed recordView at publisherThe Stability of Low-Density Parity-Check Codes and Some of its ConsequencesW. Liu; R. UrbankeIeee Transactions On Information Theory. 2021. DOI : 10.1109/TIT.2021.3119392.Detailed recordView at publisherMutual information for low-rank even-order symmetric tensor estimationC. Luneau; J. Barbier; N. MacrisInformation And Inference-A Journal Of The Ima. 2021. DOI : 10.1093/imaiai/iaaa022.Detailed recordView at publisherA Statistical Physics approach to a multi-channel Wigner spiked modelD. Alberici; F. Camilli; P. Contucci; E. MingioneEurophysics Letters - European Physical Society Letters (EPL). 2021. DOI : 10.1209/0295-5075/ac4794.Detailed recordView at publisherLearning from survey propagation: a neural network for MAX-E-3-SATR. MarinoMachine Learning-Science And Technology. 2021. DOI : 10.1088/2632-2153/ac0496.Detailed recordView at publisherThe Solution of the Deep Boltzmann Machine on the Nishimori LineD. Alberici; F. Camilli; P. Contucci; E. MingioneCommunications In Mathematical Physics. 2021. DOI : 10.1007/s00220-021-04165-0.Detailed recordView at publisherBell Diagonal and Werner State Generation: Entanglement, Non-Locality, Steering and Discord on the IBM Quantum ComputerE. Riedel Gårding; N. Schwaller; C. L. Chan; S. Y. Chang; S. Bosch et al.Entropy. 2021. DOI : 10.3390/e23070797.Detailed recordView at publisherCriticality and conformality in the random dimer modelS. Caracciolo; R. Fabbricatore; M. Gherardi; R. Marino; G. Parisi et al.Physical Review E. 2021. DOI : 10.1103/PhysRevE.103.042127.Detailed recordView at publisherAdaptive Path Interpolation Method for Sparse Systems: Application to a Censored Block ModelJ. Barbier; C. L. Chan; N. MacrisIeee Transactions On Information Theory. 2021. DOI : 10.1109/TIT.2021.3052524.Detailed recordView at publisherDeep Boltzmann Machines: Rigorous Results at Arbitrary DepthD. Alberici; P. Contucci; E. MingioneAnnales Henri Poincaré. 2021. DOI : 10.1007/s00023-021-01027-2.Detailed recordView at publisherThe Multi-species Mean-Field Spin-Glass on the Nishimori LineD. Alberici; F. Camilli; P. Contucci; E. MingioneJournal Of Statistical Physics. 2021. DOI : 10.1007/s10955-020-02684-z.Detailed recordView at publisherQuery Complexity of Adversarial AttacksG. Gluch; R. Urbanke2021. International Conference on Machine Learning (ICML), ELECTR NETWORK, Jul 18-24, 2021. Detailed recordStatistical limits of high-dimensional inference problemsC. D. LuneauLausanne, EPFL, 2021. DOI : 10.5075/epfl-thesis-8098. Detailed recordView at publisherFast Block Sequential Decoding of Polar CodesG. Trofimiuk; N. Iakuba; S. Rets; K. Ivanov; P. TrifonovIeee Transactions On Vehicular Technology. 2020. DOI : 10.1109/TVT.2020.3006369.Detailed recordView at publisherConcentration of Multi-overlaps for Random Dilute Ferromagnetic Spin ModelsJ. Barbier; C. L. Chan; N. MacrisJournal Of Statistical Physics. 2020. DOI : 10.1007/s10955-019-02470-6.Detailed recordView at publisherOn the Second-Order Asymptotics of the Partially Smoothed Conditional Min-Entropy & Application to Quantum CompressionD. Abdelhadi; J. M. RenesIEEE JOURNAL ON SELECTED AREAS IN INFORMATION THEORY. 2020. DOI : 10.1109/JSAIT.2020.3016899.Detailed recordView at publisherMutual Information and Optimality of Approximate Message-Passing in Random Linear EstimationJ. Barbier; N. Macris; M. Dia; F. KrzakalaIeee Transactions On Information Theory. 2020. DOI : 10.1109/TIT.2020.2990880.Detailed recordView at publisherAnnealing and Replica-Symmetry in Deep Boltzmann MachinesD. Alberici; A. Barra; P. Contucci; E. MingioneJournal Of Statistical Physics. 2020. DOI : 10.1007/s10955-020-02495-2.Detailed recordView at publisherConstructing a provably adversarially-robust classifier from a high accuracy oneG. Gluch; R. Urbanke2020. 23rd International Conference on Artificial Intelligence and Statistics (AISTATS), ELECTR NETWORK, Aug 26-28, 2020. p. 3674 - 3683. Detailed recordSecond-order asymptotics of quantum data compression from partially-smoothed conditional entropyD. Abdelhadi; J. M. Renes2020. IEEE International Symposium on Information Theory (ISIT), ELECTR NETWORK, Jun 21-26, 2020. p. 1846 - 1851. DOI : 10.1109/ISIT44484.2020.9173948.Detailed recordView at publisherHigh-dimensional rank-one nonsymmetric matrix decomposition: the spherical caseC. Luneau; N. Macris; J. Barbier2020. IEEE International Symposium on Information Theory (ISIT), ELECTR NETWORK, Jun 21-26, 2020. p. 2646 - 2651. DOI : 10.1109/ISIT44484.2020.9174104.Detailed recordView at publisherOn the Universality of Low-Density Parity-Check Block CodesW. Liu; R. Urbanke2020. 54th Annual Conference on Information Sciences and Systems (CISS), Princeton, NJ, Mar 18-20, 2020. p. 86 - 91. DOI : 10.1109/CISS48834.2020.1570617344.Detailed recordView at publisherOn the dependency between the code symmetries and the decoding efficiencyK. Ivanov; R. Urbanke2020. International Symposium on Information Theory and its Applications (ISITA), ELECTR NETWORK, Oct 24-27, 2020. p. 195 - 199. Detailed recordThe committee machine: computational to statistical gaps in learning a two-layers neural networkB. Aubin; A. Maillard; J. Barbier; F. Krzakala; N. Macris et al.Journal Of Statistical Mechanics-Theory And Experiment. 2019. DOI : 10.1088/1742-5468/ab43d2.Detailed recordView at publisherEntropy and mutual information in models of deep neural networksM. Gabrie; A. Manoel; C. Luneau; J. Barbier; N. Macris et al.Journal Of Statistical Mechanics-Theory And Experiment. 2019. DOI : 10.1088/1742-5468/ab3430.Detailed recordView at publisherA New Coding Paradigm for the Primitive Relay ChannelM. Mondelli; S. H. Hassani; R. UrbankeAlgorithms. 2019. DOI : 10.3390/a12100218.Detailed recordView at publisherUniversal Sparse Superposition Codes With Spatial Coupling and GAMP DecodingJ. Barbier; M. Dia; N. MacrisIeee Transactions On Information Theory. 2019. DOI : 10.1109/TIT.2019.2919519.Detailed recordView at publisherNear-Optimal Finite-Length Scaling for Polar Codes Over Large AlphabetsH. D. Pfister; R. L. UrbankeIeee Transactions On Information Theory. 2019. DOI : 10.1109/TIT.2019.2915595.Detailed recordView at publisherThe adaptive interpolation method: a simple scheme to prove replica formulas in Bayesian inferenceJ. Barbier; N. MacrisProbability Theory And Related Fields. 2019. DOI : 10.1007/s00440-018-0879-0.Detailed recordView at publisherThe adaptive interpolation method for provi",
  "content_length": 24817,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:56"
}