{
  "name": "S.-H. Gary Chan",
  "homepage": "https://home.cse.ust.hk/~gchan",
  "status": "success",
  "content": "Shueng-Han Gary Chan (陳雙幸) Home Page Shueng-Han Gary Chan (陳雙幸)Smart IoT and Sensing Systems Group Professor, Department of Computer Science and Engineering Associate Director, GREAT Smart Cities Institute Office: Room 2539 (via Lift 25-26) Academic Building, The Hong Kong University of Science and Technology Clear Water Bay, Kowloon Hong Kong Tel: +852 2358-6990 Fax: +852 2358-1477 Email: gchan@cse.ust.hk Elected Fellow of Sigma Xi (FSX), The Scientific Research Honor Society with 200+ members having received Nobel Prize (for contributions to enterprises through research) Elected Chartered Fellow (FCILT) of Chartered Institute of Logistics and Transport World's Top 2% Scientists (published by Stanford University), 2025, 2024, 2023, 2022, 2021, 2020 Chief Executive's Commendation for Community Service (for \"outstanding contribution to the fight against COVID-19\"), 23rd Honours List, Hong Kong, 2020 (video, 07:10-07:28) Board Director, Hong Kong Logistics and Supply Chain MultiTech R&D Center (LSCM), Hong Kong PhD, Electrical Engineering, Stanford University, January 1999 PhD minor: Business Administration (Management of operations, information and technology) MSE, Electrical Engineering, Stanford University, June 1994 (William and Leila Fellow, 1993-94) BSE (Highest Honors), Electrical Engineering, Princeton University, June 1993 (Charles Ira Young Memorial Tablet and Medal, and the POEM Newport Award of Excellence) Certificates (Minors) in Engineering Physics, Applied and Computational Mathematics, and Engineering and Management Systems (currently Optimization and Quantitative Decision Science), Princeton University, June 1993 Elected into Tau Beta Pi, and Phi Beta Kappa, Princeton University, 1993 My weekly regular schedule Research Interests Smart sensing and AIoT (AI+IoT) systems, cloud and edge AI, location AI and mobile computing, video/user/data analytics, machine learning system innovations, technology transfer and IT entrepreneurship Full biography in text I research and develop innovative smart IoT systems to advance our living and society. Through applied research on machine learning and data analytics, we seek to overcome critical operational challenges in industry to support cost-effective large-scale multimedia and mobile services. In contrast to theoretical or fundamental research, my team has been collaborating closly with companies to bridge the \"last mile\" divide between laboratory and marketplace. We apply rigorous algorithmic, computational and optimization techniques to relentlessly close theory-practice gaps so that our systems can operate under the most general realistic environment. Beyond proof-of-concept prototypes or demonstrations, and through technology transfer and entrepreneurship, our systems can be readily and fully integrated into industrial systems with unmatched performance. I keep a strong team of researchers (postdocs, PhD and MPhil candidates) and engineering staff, whose work closely knit together so that our research drives engineering systems while deployment challenges drive our research agenda. Our work has been extensively supported by leading companies such as Boeing, China Mobile, Cisco, Google, HP, Huawei, Mei Ah Entertainment, Microsoft, New World Development, Sun Hung Kei Properties, TCL, Tencent, UMP, etc. Widely known for their practical impacts and deployment success in industry, my systems have won many awards. The following lists some of my system projects which have been under commercial trials or transferred to industry with users (mostly supported by industry-government collaboration program through Hong Kong Innovation and Technology Fund (ITF) and LSCM Center): AI + Healthcare (HealthTech/MedTech/Medical AI) System depoyment Building a Smart IoT City to Efficiently Search for Missing MIP (Mentally Incapacitated People) MIP search with AIoT and LoRa (or NB-IoT) infrastructure (Total HK$9,438,075) Fostering a caring community for dementia anti-wandering (Total HK$13,030,000) Precision Medicine: Developing a Personalized AI Nurse (with UMP Healthcare Innovation and Incubation Company Limited) Deep Learning Technology for Dyslexia Pre-screening (Total HK$3,741,641) IoT Geofencing to Enforce Hong Kong Home Quarantine Order for Covid-19 J. Tan, E. Sumpena, W. Zhuo, Z. Zhao, M. Liu and S.-H. Chan, \"IoT Geofencing for COVID-19 Home Quarantine Enforcement,\" IEEE Internet of Things Magazine Special Issue on Smart IoT Solutions for Combating the COVID-19 Pandemic, Vol. 3, No. 3, pp. 24-29, September 2020. [pdf] AI-based Guidewire Recognition Technology to Enhance Surgical Safety Proximity and Risk with Covid-infected Places for Mobile Users: A Big Data Machine Learning Approach (Currently available in Google and Apple stores with keyword search \"CovidInArea\") Automated and Private Multimodal IoT Contact Tracing for Covid-19 Exposure G. Li, S. Hu, S. Zhong, W. Tsui and S.-H. Chan, \"vContact: Private WiFi-based IoT Contact Tracing with Virus Lifespan,'' IEEE Internet of Things Journal, Vol. 9, pp. 3465-3480, March 2022. [pdf] Awards and Honors (Attributed to my transferred technology) Chief Executive's Commendation for Community Service (for \"outstanding contribution to the fight against COVID-19\"), 23rd Honours List, Hong Kong, 2020 Smart People (Smart Empowerment) Certificate of Merit, Hong Kong ICT Awards, 2025 Smart People (Smart Ageing) Silver Award, Hong Kong ICT Awards, 2024 Gold Medal, International Exhibition of Inventions Geneva, April 2023 Gold Award, FITMI (Federation of Innovative Technologies and Manufacturing Industries) Asia International Innovative Invention Award, June 2023 Outstanding Award, ASMPT Technology Award, 2023 Smart People (Smart Inclusion) Gold Award, Hong Kong ICT Awards, 2022 Smart People (Smart Education and Learning) Award, Certificate of Merit, Hong Kong ICT Awards, 2022 Merit Award (Inclusion category - General), 20th Asia Pacific Information and Communications Technology Alliance (APICTA) Awards, December 2021 Merit Award (Technology category - IoT), 20th Asia Pacific Information and Communications Technology Alliance (APICTA) Awards, December 2021 Anti-epidemic Technology Product Award, Retail Innovation Award 2020, Hong Kong Retail Technology Industry Association (RTIA), November 2020 Outstanding Tracking and Surveillance Award, Pandemic Innovative Digital Solution Awards 2020, Hong Kong Computer Society (HKCS), 2020 (To Logistics and Supply Chain MultiTech R&D Centre Limited/Compathnion Technology for the geofencing technologies) Student Innovation (Post Graduate Stream) Bronze Award, Hong Kong ICT Awards, November 2020 IoT Wireless Sensing System deployment Wireless Camera and Video Analytics for Smart Carpark Management (Total HK$9,552,716.10) RF Sensing for Asset Management in Hospital and People Flow Analysis in Park and Museum (Total HK$3,052,100.00) SmartAP: Ubiquitous People Sensing and User Analytics with Wi-Fi (Total HK$8,814,651.58) Awards (Attributed to my transferred technology) OSH Innovation & Technology Award (Bronze Award), March 2024 Smart Living Partnership Awards (Smart Mobility), February 2023 ASM Technology Award (Silver Award), 2021 China College Students' Entrepreneurship Competition (Silver Medal), 2018 International Exhibition of Inventions (Silver Medal), Geneva, April 2018 Hong Kong ICT Awards (Bronze), Student Innovation (Tertiary or Above), 2018 Champion, JCI East Kowloon Next Step Startup Challenge, July 2017 Student Team Award, Winner of the 7th Annual HKUST One Million Dollar Entrepreneurship Competition, June 2017 First-class Award, Entrepreneurship Proposal, \"Challenge Cup\" National Competition - Hong Kong Regional Final, Hong Kong University Student Innovation and Entrepreneurship Competition 2017, May 2017 Indoor Localization and Mobile Computing System deployment Indoor Navigation in Museum (Total HK$1,674,000.00) Wherami: Client-based Indoor Localization Technology (Total HK$11,206,191.59) Awards (Attributed to my transferred technology) Asia Pacific Information and Communications Technology Alliance (APICTA) Awards (Merit Award: Technology category - IoT), December 2021 (to StayHomeSafe by Compathnion Technology Limited/Logistics and Supply Chain MultiTech R&D Centre Limited) Asia Pacific Information and Communications Technology Alliance (APICTA) Awards (Merit Award: Inclusion category - General), December 2021 (to StayHomeSafe by Compathnion Technology Limited/Logistics and Supply Chain MultiTech R&D Centre Limited) Hong Kong Awards for Industries: Technological Achievement, 2018 (To Compathnion Technology Ltd. for deploying our technologies) HK ICT Awards 2018 (Certificate of Merit), Smart Mobility Award (Smart Tourism), 2018 (To Harbour City Estates Ltd./Compathnion Technology Ltd. for deploying our technologies) Hong Kong Awards for Industries: Innovation and Creativity, 2015 (To Compathnion Technology Ltd. for deploying our technologies) Try out our \"HKUST Path Advisor\" Android apps for HKUST multi-floor indoor navigation on Google Play Multi-hop Mesh WiFi for Pervasive High-throughput Access System deployment Pervasive Mesh Wi-Fi Access in Hong Kong Police College (Total HK$1,759,000) Innovating an Efficient Outdoor Mobile Wireless Mesh Network (Total HK$2,801,774.18) Designing an Advanced Outdoor Wireless Router (Total HK$984,193.52) Lavinet: An Advanced Multi-hop Wireless Infrastructure for Aviation MRO Industry (Total HK$7,582,751.93) SmartMesh: An Intelligent Wireless Mesh Network for a Wi-Fi City (Total HK$1,045,000) Awards (Attributed to my transferred technology) Asia-Pacific ICT Awards (Merit), Research and Development category, Brunei, December 2012 Best Innovation & Research (College & Undergraduates) Award (Bronze), Hong Kong ICT Awards 2012 Silver Award, Boeing Research and Technology, 2009 Successful technology transfer and commercial deployment in Modern Terminals Ltd. (Nov 16, 2011) Press release and coverage on technology breakthroughs Demo video (sho",
  "content_length": 16697,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:08"
}