{
  "name": "S. Akshay 0001",
  "homepage": "https://www.cse.iitb.ac.in/~akshayss",
  "status": "success",
  "content": "Akshay's homepage S Akshay Professor, Department of Computer Science and Engineering, IIT Bombay Shridhar Shukla Chair Professor in Digital Trust, IIT Bombay Home Publications Teaching Activities Talks Misc Contact information Mail akshayss [AT] cse.iitb.ac.in Office Address Rm no. 507, 5th floor, New CSE Building, Department of Computer Science and Engineering, Indian Institute of Technology Bombay, Powai, Mumbai - 400076, Maharashtra, India. Tel. +91 (0) 22 2576 7711 Research interests I am interested broadly in formal methods, with a focus on -- verification of timed, recursive and distributed systems; -- automated functional synthesis; -- formal modeling and analysis of probabilistic and dynamical systems; -- trust issues and certification in AI models. Much of this work is motivated by applications arising from different domains including systems biology, cyber-physical systems, and artificial intelligence. I am also affiliated with the IITB Trust Lab, the Ashank Desai Centre for Policy Studies (ADCPS) and the Centre for Formal Design and Verification of Software Systems (CFDVS) at IIT Bombay. Academic Background In 2012, completed second year of postdoc at IRISA/ENS Cachan Bretagne, Rennes, France. In 2011, completed a one year postdoctoral fellowship at National University of Singapore. In 2010, obtained a joint PhD degree from Ecole Normale Superieure de Cachan (ENS-Cachan) and Chennai Mathematical Institute (CMI), India. In 2006, obtained masters degree in Computer science after completing the Masters Parisien Recherche en Informatique (MPRI) program at ENS-Cachan in one year. In 2005, completed first year of masters as a junior research fellow at the Institute of Mathematical Sciences (IMSc), Chennai, India. In 2004, completed undergraduate studies and obtained degree of BSc Honors in Mathematics from Chennai Mathematical Institute (CMI), Chennai, India.",
  "content_length": 1896,
  "method": "requests",
  "crawl_time": "2025-12-01 14:21:57"
}