{
  "name": "S. J. Creese",
  "homepage": "http://www.cs.ox.ac.uk/sadie.creese",
  "status": "success",
  "content": "Sadie Creese | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultySadie CreeseSadie Creese Professor Sadie Creese Professor of Computer Science (Cybersecurity)Governing Body Fellow, Worcester CollegeE: sadie.creese@cs.ox.ac.ukT: 01865 273616 Department of Computer Science, Robert Hooke BuildingDirections Postal AddressThemes:SecurityCompleted Projects:Analysing Cyber Value-at-RiskCorporate Insider Threat Detectionmore…BiographySadie Creese is Professor of Cyber Security in the Department of Computer Science at the University of Oxford. She teaches operational aspects of cybersecurity including threat detection, risk assessment and security architectures. In Computer Science she teaches the second year Computer Security course, and the Advanced Security course taken both by BSc undergraduates and MSc graduate students. Sadie is currently Chair of Examiners for the MSc in Computer Science. Elsewhere in Oxford, Sadie is a member of the faculty of the Blavatnik School Executive Public Leaders Programme, where she lectures on cybersecurity topics relevant to senior leaders in public policy from around the world. She also is a regular contributor to the leadership programmes and MBA teaching of the Said Business School. Her current research portfolio includes: threat modelling and detection with particular interest in the insider threat and threat from AI, visual analytics for cybersecurity, risk propagation logics and communication, resilience strategies for business, privacy requirements, vulnerability of distributed ledgers and block-chains,  understanding cyber-harm and how it emerges for single organisations, nations and the potential for systemic cyber-risk, and the Cyber Security Capacity Maturity Model for Nations. She is Principal Investigator on the AXIS sponsored project “Analysing Cyber-Value-at-Risk, Residual Risk and models for Systemic Cyber-Risk” focused on developing a method for predicting potential harms arising from cyber-attacks. She leads the Oxford team’s collaboration with the World Economic Forum’s Shaping the Future of Cybersecurity and Digital Trust Platform, research sponsored by AXIS, which is considering the cybercrime challenges that world leaders will need to address in the near and far technology future – part of the Platform’s Futures Series – “Futures Series: Cybercrime 2025”. Sadie is also co-Chair of the Lloyds Register Foundation sponsored Foresight review of cyber security for the Industrial Internet of Things (IIoT), which is considering operational cybersecurity technology gaps in future IIoT environments. Sadie is the founding Director of the Global Cyber Security Capacity Centre (GCSCC) at the Oxford Martin School, where she continues to serve as a Director conducting research into what constitutes national cybersecurity capacity, working with countries and international organisations around the world. She was the founding Director of Oxford’s Cybersecurity network launched in 2008 and now called CyberSecurity@Oxford. She was a member of the World Economic Forum’s Cyber Security Centre’s Strategic Advisory Board, and was a Technical Advisor to the Government of Japan (GOJ) and the World Economic Forum joint project on International Data Flow Governance ‘Advancing the Osaka Track’. Sadie is a Fellow of Worcester College, Oxford where she sits on the Governing Body, and a regular public speaker on cybersecurity and organisational challenges today and in the future. Prior to returning to academia she has worked as a cybersecurity expert in business and as a research scientist specializing in security for the UK’s Ministry of Defence. She has a DPhil in Computer Science from the University of Oxford, as well as an MSc in Computation and a BSc (Hons) in Mathematics and PhilosophySelected PublicationsView AllManage publications The SuperIdentity Stimulus Dataset − a Multi−Modal Biometric and Cybermetric Resource G. Neil‚ S. Stevenage‚ S. Black‚ H. Meadows‚ S. Creese‚ D. Hodges‚ H. He‚ W. Pike‚ O. Love‚ S. Saxby‚ A. Knight‚ I. Hamlin‚ J. Schultz‚ D. Stanton−Fraser‚ C. Bevan‚ L. Emanuel‚ M. Whitty and S Jamison−Powell In Pattern Analysis and Machine Intelligence‚ IEEE Transactions on. In Review. Details about The SuperIdentity Stimulus Dataset − a Multi−Modal Biometric and Cybermetric Resource | BibTeX data for The SuperIdentity Stimulus Dataset − a Multi−Modal Biometric and Cybermetric Resource Sonification in Security Operations Centres: What do Security Practitioners Think? Louise M. Axon‚ Bushra Alahmadi‚ Jason R. C. Nurse‚ Michael Goldsmith and Sadie Creese In Workshop on Usable Security (USEC) at the Network and Distributed System Security (NDSS) Symposium. Internet Society. 2018. To appear Details about Sonification in Security Operations Centres: What do Security Practitioners Think? | BibTeX data for Sonification in Security Operations Centres: What do Security Practitioners Think? | Download (pdf) of Sonification in Security Operations Centres: What do Security Practitioners Think? The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance Ioannis Agrafiotis‚ Sadie Creese‚ Michael Goldsmith‚ Jason R.C. Nurse and David Upton No. RR−17−01. DCS. Oxford‚ UK. 2017. Details about The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance | BibTeX data for The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance | Download (pdf) of The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance ActivitiesCybersecurity AnalyticsSecurityCyber Security OxfordProjectsGCSCCSCULICompleted ProjectsAnalysing Cyber Value-at-RiskCorporate Insider Threat DetectionCyberVisEnCoReIdentity Security in CyberspaceSATURNSuper IdentityIdentity Security in CyberspaceTEASESecurity Protocols for Ad Hoc NetworksRefinement-friendly bigraphsSponstaneous SecurityFly2Plan Team Ioannis AgrafiotisSenior Research AssociateLouise Axon-JonesSenior Research AssociateBill DuttonSenior Research FellowPatricia Esteve-GonzalezResearch FellowMichael GoldsmithAssociate Professor of Computer Science, Senior Research FellowAhmed  SalmanDoctoral StudentCarolin Weisser HarrisInternational Operations LeadLouise WilliamsProject Manager Past Students Mary BisphamRodrigo CarvalhoElizabeth PhillipsMarcel Stolz (Armasuisse Science and Technology; Swiss Armed Forces; Konrad Adenauer Stiftung) Meredydd Williams Past Researchers Maria BadaArnau ErolaJassim HappaAlastair Janse van RensburgEva NagyfejeoJason NurseAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 6826,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:03"
}