{
  "name": "S. P. Suresh",
  "homepage": "http://www.cmi.ac.in/~spsuresh",
  "status": "success",
  "content": "S P Suresh Home Hi! I am S P Suresh. Welcome to my home page. I am on the faculty of Theoretical Computer Science at the Chennai Mathematical Institute. My research interests include logic in computer science, concurrency and distributed computing, and formal methods for security. I did my PhD at the Institute of Mathematical Sciences with Jam. My other interests include classical Indian logic and epistemology, Carnatic music, chess, and P G Wodehouse. And my mission in life is to prove beautiful theorems and present them in beautifully typeset papers! Publications Solving the insecurity problem for assertions [DOI | BibTeX | Technical report] R Ramanujam, Vaishnavi Sundararajan and S P Suresh Proceedings of 2024 IEEE 37th Computer Security Foundations Symposium (CSF 2024), pages 636–650, July 2024 Who holds the best card? Secure communication of optimal secret bits [BibTeX | PDF ] Hans van Ditmarsch, David Fernández-Duque, Vaishnavi Sundararajan, S. P. Suresh Australasian Journal of Combinatorics, 80(1), pages 1–29, June 2021 Bounded Version Vectors Using Mazurkiewicz Traces [DOI | BibTeX | PDF] Madhavan Mukund, Gautham R Shenoy and S P Suresh Advanced Computing and Systems for Security: Volume Eleven, pages 31–42, 2021 The complexity of disjunction in intuitionistic logic [DOI | BibTeX | Technical report] R Ramanujam, Vaishnavi Sundararajan and S P Suresh Journal of Logic and Computation, 30(1), pages 421–445, January 2020 Formalizing and Checking Multilevel Consistency [Springer link | BibTeX | Technical report] Ahmed Bouajjani, Constantin Enea, Madhavan Mukund, Gautham R Shenoy and S P Suresh Proc. VMCAI 2020, Springer LNCS volume 11990, pages 379–400 Dolev-Yao theory with associative blindpair operators [Technical report | BibTeX] A Baskar, R Ramanujam and S P Suresh Proc. CIAA 2019, Springer LNCS volume 11601, pages 58–69 Knowledge transfer and information leakage in protocols [PDF | BibTeX] Abdullah Abdul Khadir, Madhavan Mukund and S P Suresh Proc. ATVA 2017, Springer LNCS volume 10482, pages 225–240 Existential Assertions for Voting Protocols [PDF | Slides | BibTeX] R Ramanujam, Vaishnavi Sundararajan and S P Suresh Proc. FC 2017 Workshops (Voting '17), Springer LNCS volume 10323, pages 337–352 The complexity of disjunction in intuitionistic logic [PDF | BibTeX] R Ramanujam, Vaishnavi Sundararajan and S P Suresh Proc. LFCS 2016, Springer LNCS volume 9537, pages 349–363 Effective verification of Replicated Data Types using Later Appearance Records (LAR) [PDF | BibTeX | Slides] Madhavan Mukund, Gautham Shenoy R and S P Suresh Proc. ATVA 2015, Springer LNCS volume 9364, pages 293–308 Bounded Implementations of Replicated Data Types [PDF | BibTeX] Madhavan Mukund, Gautham Shenoy R and S P Suresh Proc. VMCAI 2015, Springer LNCS volume 8931, pages 355–372 Extending Dolev-Yao with assertions [Conference version | BibTeX | Technical report] R Ramanujam, Vaishnavi Sundararajan and S P Suresh Proc. ICISS 2014, Springer LNCS volume 8880, pages 50–68 34th International Conference on Foundations of Software Technology and Theoretical Computer Science (FSTTCS 2014) [Proceedings] Venkatesh Raman and S P Suresh (Editors) LIPIcs volume 29, 2014 Optimized OR-Sets Without Ordering Constraints [Conference version | BibTeX | Technical report] Madhavan Mukund, Gautham Shenoy R and S P Suresh Proc. ICDCN 2014, Springer LNCS volume 8314, pages 227–241 Primal infon logic: derivability in polynomial time [Conference version | BibTeX | Technical report | Slides] A Baskar, Prasad Naldurg, K R Raghavendra and S P Suresh Proc. FSTTCS 2013, LIPIcs volume 24, pages 162–174 On bounded version vectors [PDF] Madhavan Mukund, Gautham Shenoy R and S P Suresh Technical report. August 2012 Dolev-Yao theories with distributive encryption [PDF] A Baskar, R Ramanujam and S P Suresh Technical report, 2011 Challenges for epistemic logic from security protocols [PDF | BibTeX] R Ramanujam and S P Suresh Games, Norms and Reasons: Logic at the Crossroads, volume 353, Synthese Library, pages 215–231. April 2011 A DEXPTIME-complete Dolev-Yao theory with distributive encryption [Conference version | BibTeX | Technical report] A Baskar, R Ramanujam and S P Suresh Proc. MFCS 2010, Springer LNCS volume 6281, pages 102–113 A Dolev-Yao model for Zero-Knowledge [PDF | BibTeX] A Baskar, R Ramanujam and S P Suresh Proc. ASIAN 2009, Springer LNCS volume 5913, pages 137–146 Knowledge-based modelling of voting protocols [ PDF | BibTeX] A Baskar, R Ramanujam and S P Suresh Proc. TARK 2007, pages 62–71 A (restricted) quantifier elimination for security protocols [ DOI | PDF | BibTeX] R Ramanujam and S P Suresh Theoretical Computer Science, volume 367, 2006, pages 228–256 Generic verification of security protocols [PDF | BibTeX] Abdul Sahid Khan, Madhavan Mukund and S P Suresh Proc. SPIN 2005, Springer LNCS 3639, pages 221–235 Decidability of context-explicit security protocols [PDF | BibTeX] R Ramanujam and S P Suresh Journal of Computer Security, volume 13(1), 2005, pages 135–165 Deciding knowledge properties of security protocols [PDF | BibTeX] R Ramanujam and S P Suresh Proc. TARK 2005, pages 219–235 Tagging makes secrecy decidable for unbounded nonces as well [PDF | BibTeX] R Ramanujam and S P Suresh Proc. FSTTCS 2003, Springer LNCS 2914, pages 363–374 Foundations of Security Protocol Analysis [PDF] S P Suresh PhD Thesis, Madras University, November 2003 An equivalence on terms for security protocols [PDF] R Ramanujam and S P Suresh Proc. AVIS 2003, pages 45–56 A decidable subclass of unbounded security protocols [PDF] R Ramanujam and S P Suresh Proc. WITS 2003, pages 11–20 Information based reasoning about security protocols [PDF] R Ramanujam and S P Suresh Logical Aspects of Cryptographic Protocol Verification 2001, ENTCS, vol. 55, pages 85–100 Semi-deterministic extensions of fixed-point logic [PDF] S P Suresh MSc Thesis, Anna University, June 1999 Teaching Some recent courses Programming in Haskell Programming in Haskell August – November 2018 Proofs and Types August – November 2018 Programming in Haskell August – November 2017 Formal Methods for Cryptographic Protocols August – November 2017 Programming in Haskell August – November 2016 Proofs and Types August – November 2016 Implementation of Functional Programming Languages (with Madhavan Mukund) January – April 2016 Programming Language Concepts January – April 2016 Programming in Haskell August – November 2015 Concurrent Programming (with Madhavan Mukund) August – November 2015 External courses Functional Programming in Haskell (with Madhavan Mukund) July – September 2015 January – March 2016 Professional activities Programme Committee, ATVA 2017 Programme Committee, ICLA 2017 Organizing Committee, FSTTCS 2016 Co-chair of Programme Committee, ISLA 2016 Programme Committee, FSTTCS 2015 Programme Committee, ICLA 2015 Co-chair of Programme Committee, FSTTCS 2014 Programme Committee, CiE 2013 Co-chair of Programme Committee, ISLA 2012 Programme Committee, M4M 2011, 10–12 November 2011, Osuna, Spain Programme Committee, ICLA 2011 Programme Committee, ICISS 2010 Organizing Committee, ICM satellite conference on set theory and mathematical logic, August 15–17, 2010. Chennai Mathematical Institute, Chennai, India Programme Committee, FSTTCS 2009 Organizing Committee, ICLA 2009 Programme Committee, FSTTCS 2008",
  "content_length": 7349,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:04"
}