{
  "name": "S. Rao Kosaraju",
  "homepage": "http://www.cs.jhu.edu/~kosaraju",
  "status": "success",
  "content": "S. Rao Kosaraju's home page S. Rao Kosaraju Edward J. Schaefer Professor in Engineering Tel: 410-516-8134 Fax: 410-516-6134 kosaraju@cs.jhu.edu Research Prof. Kosaraju has done extensive work in the design and analysis of parallel and sequential algorithms. Recent research efforts include efficient algorithms for pattern matching, data structure simulations, universal graphs, DNA sequence assembly, and derandomization. Current research interests also include investigations of immune system responses. Biographical notes Ph.D.   University of Pennsylvania      1969 M.Tech. I.I.T., Kharagpur, India        1966 B.Engg. Andhra University, India        1964 Fellow of IEEE, Fellow of ACM Managing Editor, SIAM Journal on Computing (1980-88). Editor, 1975-2005 Information and Computation, 1983-91 Theory of Computing Systems, 1976-2009 Journal of Computer and System Sciences, 1981- Member of NSF Advisory Committee for CCR 1985-91, Chair ,1989-91 Member of Advisory Committee, Dept. of CIS, Univ. of Penn., 1985-91 Member of Advisory Council, Dept. of CS, Princeton University, 1995-99 Member of ACM Fellows Selection Committee, 1995-99, Chair, 1997 Vice-chair, ACM SIGACT, 1979-81 Chair, ACM SIGACT, 1991-93 Program Committee Member, IEEE FOCS, 1977, 1978, 1979, 1987, 1993, 1996 Program Committee Member, ACM STOC, 1990, 2002 Program Committee Member, ACM-SIAM SODA, 1992, 1998, 2001, 2004 Program Committee Member, ACM POPL, 1982, 1983 Program Committee Member, WADS 1993, 1995 Program Committee Member, Symp. Combinatorial Pattern Matching, 1996, 2002 Conference Chair, ACM STOC, 1990 Program Committee Chair, IEEE FOCS 1979; ACM-SIAM SODA 2001 William H. Huggins Excellence in Teaching Award, 1992 Alumni Association Excellence in Teaching Award, 1999 Alumni Association Excellence in Teaching Award, 2001 Robert B. Pond Excellence in Teaching Award, 2009 ACM SIGACT Distinguished Service Award, 2000",
  "content_length": 1908,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:08"
}