{
  "name": "Saad Hassan",
  "homepage": "https://sse.tulane.edu/cs/faculty/hassan",
  "status": "success",
  "content": "Saad Hassan | Tulane University School of Science and Engineering Skip to main content Information for SSE Comp Sci Dept. Account Login EMAIL GIBSON ONLINE MYTULANE Saad Hassan Assistant Professor saadhassan@tulane.edu 504-247-1415 School of Science & Engineering Dr. Hassan's Website Education & Affiliations Ph.D., 2023, Rochester Institute of Technology Biography About Professor Hassan Saad Hassan obtained his PhD from the Golisano College of Computing and Information Sciences at the Rochester Institute of Technology in 2023. His research centers on Accessible Computing, Human-Computer Interaction (HCI), and Computational Social Science, with a focus on technologies to promote inclusion, facilitate learning, and encourage creative expression among individuals with disabilities. During his graduate studies, Saad worked as a research scientist intern at Google AI and Meta Reality Labs, where he helped develop and deploy innovative technologies. Saad's research has been featured in prestigious computing conferences and journals, including the ACM Conference on Human Factors in Computing Systems (CHI), the ACM SIGACCESS Conference on Computers and Accessibility (ASSETS), the ACM Transactions on Accessible Computing (TACCESS), and the Conference on Empirical Methods in Natural Language Processing (EMNLP). Currently, he serves as a program committee member for CHI and ASSETS. Research Interests Accessible Computing, Human-Computer Interaction (HCI), and Computational Social Science, with a focus on AI-powered technologies to facilitate inclusion, learning, and creative expression for individuals with disabilities. Office 307 Paul Hall Courses Taught CMPS 4661/CMPS 6663: Human-Computer Interaction Google Scholar Page DBLP Biography Privacy Accessibility Copyright",
  "content_length": 1787,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:09"
}