{
  "name": "Saad Mneimneh",
  "homepage": "http://www.cs.hunter.cuny.edu/~saad",
  "status": "success",
  "content": "Saad's Website Saad Mneimneh RESEARCH PEOPLE PUBLICATIONS RESOURCES TEACHING CONTACT Research My research revolves around the application of mathematical modeling and algorithmic techniques to various problems, including scheduling, load balancing, and more recently computational biology, especially the problem of RNA interaction and combinatorial problems inspired by it. My work includes complexity analysis, approximation algorithms, game theory/optimal strategies, and lower/upper bounds. For more detail, see below and refer to my list of publications. I recently acquired an interest in finding new ways to teach about counting. Here's my research project on teaching to count. I am planning on creating an REU that I call PRiMAL. Scheduling/Load Balancing What kind of performance guarantees are possible in packet scheduling and the load balancing of switches? Properties such as throughput, order, and liveliness are of particular importance. We prove several bounds on throughput and some impossibility results, and we provide scheduling, load balancing, and resource allocation algorithms for several settings studied in computer science. Multiple RNA Interaction The pairwise interaction of RNAs has been studied extensively. However, the interaction of multiple RNAs (more than two) is important for understanding other biological mechanisms involving snRNAs and snoRNAs. We develop combinatorial formulations and algorithms to predict the interaction of multiple RNAs. Protein Secondary Structure A generalized percolation theory approach for secondary structures in proteins reveals an interesting evolutionary aspect of the probability distribution of amino acids in terms of hydrophobic, hydrophilic, and breakers. The approach can be adapted to make prediction of secondary structure based on protein sequence alone. Other Research We also have occasional fun with research ideas related to mathematics and computer science, such as Fibonacci, Skolem sequences, islands on a torus, and musical scales. Funding for the research is provided by: RESEARCH PEOPLE PUBLICATIONS RESOURCES TEACHING CONTACT Copyright © 2017 Saad Mneimneh",
  "content_length": 2149,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:14"
}