{
  "name": "Saber Salehkaleybar",
  "homepage": "https://sabersalehk.github.io",
  "status": "success",
  "content": "Saber's Homepage Saber Salehkaleybar Assistant Professor at the Leiden Institute of Advanced Computer Science (LIACS) Follow Leiden University Email Google Scholar Saber Salehkaleybar is an assistant professor at the Leiden Institute of Advanced Computer Science (LIACS), Leiden University. Prior to this, he worked as a research scientist in the School of Computer and Communication Sciences (IC) and College of Management of Technology (CDM) at École Polytechnique Fédérale de Lausanne. His research interests include causal inference, stochastic optimization, and reinforcement learning. He is particularly interested in causal discovery, experiment design, and applications of causality in generative AI. Additionally, he is focused on developing efficient optimization algorithms for training large learning models. Latest News Nov 2025, Our paper Learning Subgroups with Maximum Treatment Effects without Causal Heuristics was accepted for an oral presentation at AAAI 2026. Oct 2025, I was selected as a Top Reviewer in NeurIPS 2025. Sep 2025, Our paper Near-Optimal Experiment Design in Linear non-Gaussian Cyclic Models was accepted in NeurIPS 2025 as a spotlight paper. May 2025, Our three papers were accepted at ICML 2025: MetaOptimize: A Framework for Optimizing Step Sizes and Other Meta-parameters Hierarchical Reinforcement Learning with Targeted Causal Interventions Causal Effect Identification in lvLiNGAM from Higher-Order Cumulants May 2025, Our two papers were accepted at UAI 2025: Causal Effect Identification in Heterogeneous Environments from Higher-Order Moments Efficiently Escaping Saddle Points for Policy Optimization Jan 2025, Our paper Multi-Domain Causal Discovery in Bijective Causal Models was accepted in CLEAR 2025. May 2024, Our paper Causal Effect Identification in LiNGAM Models with Latent Confounders was accepted in ICML 2024. Apr 2024, I became an ELLIS member. Apr 2024, Our paper Momentum-Based Policy Gradient with Second-Order Information was accepted in TMLR. Jan 2024, Our paper Learning Unknown Intervention Targets in Structural Causal Models from Heterogeneous Data was accepted in AISTATS 2024. Dec 2023, I am honored to be serving as the Workflow Chair for the UAI 2024 conference. Dec 2023, Our paper A Unified Experiment Design Approach for Cyclic and Acyclic Causal Models was accepted in JMLR. Sep 2023, Our paper A Cross-Moment Approach for Causal Effect Estimation was accepted as a spotlight paper in NeurIPS 2023.",
  "content_length": 2477,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:12"
}