{
  "name": "Sabine Süsstrunk",
  "homepage": "http://ivrl.epfl.ch/people/susstrunk",
  "status": "success",
  "content": "Sabine Süsstrunk ‒ IVRL ‐ EPFL Skip to content ©Alain Herzog Images and Visual Representation Lab (IVRL) School of Computer and Communication Sciences (IC) Ecole Polytechnique Fédérale de Lausanne (EPFL) Address : EPFL IC IVRL BC 328 (Building BC) Station 14 CH-1015 Lausanne, Switzerland Phone: +41 (0)21 693 6664 / 7662 Fax: +41 (0)21 693 4312 Email: sabine [dot] susstrunk [at] epfl [dot] ch Bio Sabine Süsstrunk joined EPFL in 1999. She is full professor and Director of the Images and Visual Representation Laboratory (IVRL) in the School of Computer and Communication Sciences (IC). From 2015-2020, she was also the first Director of the Digital Humanities Institute (DHI) and Digital Humanities Section (SoDH), College of the Humanities (CdH). Her main research areas are in computational imaging, computational photography, color image processing and computer vision, multimedia, and computational image quality and aesthetics. She has a BS in Scientific Photography from ETH Zürich, Switzerland, a MS in Electronic Publishing from the Rochester Institute of Technology (RIT), Rochester, NY, USA, and a PhD on computing chromatic adaptation from the School of Computing Sciences, University of East Anglia (UEA) in Norwich, UK. From 2003-2004, Sabine was a Visiting Scholar in the Computational Color Reproduction Group at Hewlett-Packard Labs in Palo Alto, CA, USA. From 1995-1999, she was the Principle Imaging Researcher at Corbis Corporation in Seattle, WA, USA. From 1991-1995, she was a Visiting Assistant Professor in the School of Photographic Arts and Sciences at the Rochester Institute of Technology (RIT). Sabine has authored and co-authored over 250 publications, of which 8 have received best paper/demo awards, and holds 10 patents. She served as chair or committee member in many international conferences on color imaging, digital photography, and image systems engineering (General Chair for the International Conference on Computational Photography (ICCP) in 2024, General Chair for the IS&T/SPIE Annual Symposium on Electronic Imaging in 2011, Area Chair for IEEE CVPR 2011, 2016, 2020, 2022, Area Chair for IEEE ICIP 2008, 2009, 2016, 2017, etc.). She was an Associate Editor for the IEEE Transactions on Image Processing from 2007-2011 and the IEEE Transactions on Computational Imaging from 2014-2016. She was the Technical Secretary of the International Color Consortium (ICC) from 2000-2001, Vice-President of IS&T, the Society of Imaging Science and Technology, from 1999-2003 and Conference Vice-President from 2011-2014, Director of CIE Division 8 (Commission Internationale de l’Eclairage, Imaging Technology) from 2007-2011, and member of the ACM E.L. Lawler Award Committee for Humanitarian Contributions within Computer Science and Informatics from 2004-2014. Since 2021, Sabine is President of the Swiss Science Council SSC. Sabine is also Member of the Board (President from 2014-2018) of the EPFL-WISH (Women in Science and Humanities) Foundation, Member of the Board of the SRG SSR (Swiss Broadcasting Corporation), Co-Founder and Member of the Board of Largo Films, and Member of the Board of the Swiss Study Foundation. Sabine received the IS&T/SPIE 2013 Electronic Imaging Scientist of the Year Award for her contributions to color imaging, computational photography, and image quality, and the IS&T 2018 Raymond C. Bowman and the EPFL AGEPoly 2020 IC Polysphere Awards for excellence in teaching. She is a Fellow of AIIA, ELLIS, IEEE and IS&T, and a regular member of the Swiss Academy of Engineering Sciences SATW. Quick links to : Publications Talks Back to top",
  "content_length": 3611,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:20"
}