{
  "name": "Sabine Oechsner",
  "homepage": "https://soechsner.de",
  "status": "success",
  "content": "Sabine Oechsner Sabine Oechsner I am an Assistant Professor at the Vrije Universiteit Amsterdam in the Theoretical Computer Science group. I'm also affiliated with the VUSec group. My research interests are cryptography and provable security, as well as their intersection with formal methods and programming languages. I am particularly interested in making the worlds meet in a way that furthers our understanding of provable security: Instead of merely reproducing existing cryptographic proofs with tool support, my goal is to use formal verification as an opportunity to understand how to write better proofs with high assurance, both on paper and in a machine-checkable way. News \"Who Verifies the Verifiers? Lessons Learned From Formally Verified Line-Point Zero-Knowledge\" was accepted to CiC 2025. Joint work with Vitor Pereira and Peter Scholl. I'm on the PC of Eurocrypt 2026! \"How hard can it be to formalize a proof? Lessons from formalizing CryptoBox three times in EasyCrypt\" was accepted to Asiacrypt 2025. Joint work with François Dupressoir, Andreas Hülsing, Cameron Low, Matthias Meijers, and Charlotte Mylog. \"Privacy-preserving computing in the music ecosystem\" was accepted to PoEM 2025. Joint work with my PhD student Yulu Wang, Charlotte van der Velden, and Jaap Gordijn. \"Satisfying Complex Data Security Requirements in Digital Business Ecosystems\" was accepted to RE@Next! 2025. Joint work with my PhD student Yulu Wang, Charlotte van der Velden, Arthur McLaren, and Jaap Gordijn. The Zama Cryptanalysis Grant Program is going to fund our project on the real-world security of MPC protocols. Peter Scholl and I are planning to host some interns for this project for summer 2026. More information to follow. I am honored to give a keynote at CSF 2025. \"Rushing at SPDZ: On the Practical Security of Malicious MPC Implementations\" was accepted to S&P 2025. Joint work with Alexander Kyster, Frederik Huss Nielsen, and Peter Scholl. Publications Journals Who Verifies the Verifiers? Lessons Learned From Formally Verified Line-Point Zero-Knowledge with Vitor Pereira and Peter Scholl Communications in Cryptology 2025 [paper] [eprint] Conferences How hard can it be to formalize a proof? Lessons from formalizing CryptoBox three times in EasyCrypt with François Dupressoir, Andreas Hülsing, Cameron Low, Matthias Meijers, and Charlotte Mylog Asiacrypt 2025 [eprint] Privacy-preserving computing in the music ecosystem with Yulu Wang, Charlotte van der Velden, and Jaap Gordijn PoEM 2025 Satisfying Complex Data Security Requirements in Digital Business Ecosystems with Yulu Wang, Charlotte van der Velden, Arthur McLaren, and Jaap Gordijn RE@Next! 2025 [paper] Rushing at SPDZ: On the Practical Security of Malicious MPC Implementations with Alexander Kyster, Frederik Huss Nielsen, and Peter Scholl S&P 2025 [paper] [eprint] [video] Adaptive Distributional Security for Garbling Schemes with O(|x|) Online Complexity with Estuardo Alpirez Bock, Chris Brzuska, Pihla Karanko, and Kirthivaasan Puniamurthy Asiacrypt 2023 [paper] [eprint] A State-Separating Proof for Yao’s Garbling Scheme with Chris Brzuska CSF 2023 [paper] [eprint] CRAFT: Composable Randomness Beacons and Output-Independent Abort MPC From Time with Carsten Baum, Bernardo David, Rafael Dowsley, Ravi Kishore, and Jesper Buus Nielsen PKC 2023 [paper] [eprint] Bringing State-Separating Proofs to EasyCrypt - A Security Proof for Cryptobox with François Dupressoir and Konrad Kohbrok CSF 2022 [paper] [eprint] [slides] Formal security analysis of MPC-in-the-head zero-knowledge protocols with Nikolaj Sidorenco and Bas Spitters CSF 2021 [paper] [eprint] [video] TARDIS: A Foundation of Time-Lock Puzzles in UC with Carsten Baum, Bernardo David, Rafael Dowsley, and Jesper Buus Nielsen Eurocrypt 2021 [paper] [eprint] [video] Adaptive Security of Practical Garbling Schemes with Zahra Jafargholi Indocrypt 2020 [paper] [eprint] [video] Towards Practical Lattice-Based One-Time Linkable Ring Signatures with Carsten Baum and Huang Lin ICICS 2018 [paper] [eprint] More Efficient Commitments from Structured Lattice Assumptions with Carsten Baum, Ivan Damgård, Vadim Lyubashevsky, and Chris Peikert SCN 2018 [paper] [eprint] Computer-Aided Proofs for Multiparty Computation with Active Security with Helene Haagh, Aleksandr Karbyshev, Bas Spitters, and Pierre-Yves Strub CSF 2018 [paper] [eprint] Compact Zero-Knowledge Proofs of Small Hamming Weight with Ivan Damgård, Ji Luo, Peter Scholl, and Mark Simkin PKC 2018 [paper] [eprint] [slides] PhD Students Yulu Wang (co-supervised with Jaap Gordijn) Kirthivaasan Puniamurthy (co-supervised with Chris Brzuska, Aalto University) Activities Editorial Board IACR Communications in Cryptology (since 2024) Program Committee 2026: Eurocrypt 2025: Eurocrypt, PLAS 2024: CSF, ACM SRC@POPL 2022: CCS, CSF, ACNS 2021: CSF, Indocrypt 2020: Indocrypt Organization and co-chairing 2025: Workshop on Proofs and Proof Techniques for Cryptographic Security (ProTeCS), Eurocrypt 2025 affiliated event, Location: Madrid, Spain 2025: Workshop on Computer-Aided Proofs of Security (CAPS), Eurocrypt 2025 affiliated event, Location: Madrid, Spain 2024: Workshop on Proofs and Proof Techniques for Cryptographic Security (ProTeCS), Eurocrypt 2024 affiliated event, Location: Zurich, Switzerland 2022-2024: Edinburgh Crypto Seminar, the weekly cryptography seminar at the University of Edinburgh 2021: WRePP: Workshop on Reduction Proofs in Pseudocode, co-organized with Chris Brzuska, co-located with CRYPTO 2021, Location: Santa Barbara, USA/virtual 2020: WoDUP: Workshop on developing, using and teaching cryptographic proofs, co-organized with Chris Brzuska and Markulf Kohlweiss, co-located with EUROCRYPT 2020, Location: Zagreb, Croatia/cancelled due to pandemic 2019-2020: Aarhus Crypto Seminar, the weekly seminar of the Cryptography group at Aarhus University. Here is the list of talks during that time. 2019: Aarhus Crypto Day 2019 Teaching Foundations of Cryptography MSc Computer Science, Period 2 Secure Programming BSc Computer Science, Period 2 (co-taught with Erik van der Kouwe) Bio I received my PhD from Aarhus University in 2019 for my research on \"Constructions and Proof Techniques for Secure Computation\". My PhD was supervised by Ivan Damgård. During that time I also visited NTT Secure Platform Laboratories as well as IDC Herzliya (now Reichman University), working with Elette Boyle. I then stayed in Aarhus for a postdoc with Jesper Buus Nielsen before continuing my research in the Security and Privacy group at the University of Edinburgh. While my PhD started out more traditionally by constructing cryptography, I am now leaning more towards the \"proof techniques\" side of provable security. Having been raised into cryptography at Aarhus University, I am particularly interested in cryptographic protocols and their security. Contact s.a.oechsner (at) vu.nl How to pronounce my last name The combination OE is an old spelling of the German letter Ö. The pronounciation is similar to the Scandinavian Ø or the French Œ, or the vowel in the English word learn. If you are in doubt, use O instead. The CHS in the middle of my name is pronounced like X or KS in English. How to spell my last name The way it is spelled on all my publications: Oechsner. But isn't OE actually Ö? Yes and no. In most German words, Ö is indeed used instead of OE. But names are not ordinary words, and they certainly don't care about modern spelling rules. There is even a German brewery with that spelling. (We are not related though.)",
  "content_length": 7561,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:13"
}