{
  "name": "Sabine Schulte im Walde",
  "homepage": "https://www.ims.uni-stuttgart.de/institut/mitarbeiter/schulte",
  "status": "success",
  "content": "Frau Prof. Dr. Sabine Schulte im Walde | Institut für Maschinelle Sprachverarbeitung | Universität Stuttgart zum Inhalt springen zum Footer springen zurück Navigation schließen Für die volle Funktionalität dieser Site ist JavaScript notwendig. Hier finden Sie eine Anleitung zum Aktivieren von JavaScript in Ihrem Browser. Sabine Schulte im Walde Frau Prof. Dr. Akademische RätinInstitut für Maschinelle SprachverarbeitungGrundlagen der Computerlinguistik Kontakt +49 711 685 84584 E-Mail Website Pfaffenwaldring 5B 70569 Stuttgart Deutschland Raum: 02.006 Fachgebiet Meine Forschung untersucht und modelliert lexikalisch-semantische Sprachphänomene anhand von statistischen Methoden. Ein Fokus dabei liegt auf der linguistischen und kognitiven Plausibilität der computationellen Ansätze. Meine Forschungsthemen umfassen: Kompositionalität und Bedeutungsverschiebungen von Mehrwortausdrücken(Fokusse: Nomen-Komposita, Partikelverben, Funktionsverbgefüge) Abstraktheit, Konkretheit und Metaphorizität, Synchrone und diachrone Ambiguität und (Änderungen von) figurative(r) Sprache, Selektionspräferenzen und Plausibilität an der Syntax-Semantik-Schnittstelle, Semantische Assoziationen, Klassifikationen und Relationen, Erstellung von Datensätzen mit menschlichen Bewertungen zu Bedeutungskomponenten und -relationen Evaluation von Korpus-basiertem semantischen Wissen Anwendung der Modellierungen auf Lexikographie, Maschinelle Übersetzung, Terminologie-Extraktion Ich bin außerplanmäßige Professorin am Lehrstuhl Grundlagen der Computerlinguistik von Professor Jonas Kuhn. Details zu meiner Forschung, meinen Mitarbeiter*innen und meiner Lehre finden Sie auf meiner persönlichen Homepage sowie auf den folgenden Seiten zu Projekten und meiner SemRel-Gruppe. Lebenslauf seit 01/2019 Apl. ProfessorinUniversität Stuttgart, Institut für Maschinelle Sprachverarbeitung. seit 06/2012 Akademische RätinUniversität Stuttgart, Institut für Maschinelle Sprachverarbeitung. 10/2011-12/2016 DFG-Heisenberg-StipendiatinUniversität Stuttgart, Institut für Maschinelle Sprachverarbeitung. 09/2010-09/2011 Mutterschutz und Elternzeit 10/2006-09/2011 Post-Doktorandin in Computerlinguistik im Sonderforschungsbereich 732 \"Inkrementelle Spezifikation im Kontext\".Universität Stuttgart, Institut für Maschinelle Sprachverarbeitung.Projekt: Modulare Lexikalisierung von Probabilistischen Kontext-freien Grammatiken. 07/2008-07/2009 Mutterschutz und Elternzeit 06/2009 HabilitationUniversität des Saarlandes, Philosophische Fakultät.Thesis: Theoretical Adequacy, Human Data and Classification Approaches in Modelling Word Properties, Word Relatedness and Word Classes 04/2004-09/2006 Post-Doktorandin in Computaterlinguistik im Internationalen Graduiertenkolleg Saarbrücken/Edinburgh \"Language Technology and Cognitive Systems\".Universität des Saarlandes, Institut für Computerlinguistik und Phonetik. 04/2004-12/2004 Freie Mitarbeiterin der Abteilung SprachtechnologieBrockhaus Duden Neue Medien GmbH. 09/2003-03/2004 Produktmanagerin der Abteilung SprachtechnologieBrockhaus Duden Neue Medien GmbH. 08/2000-07/2003 Promotion in Computerlinguistik im Graduiertenkolleg 609 \"Sprachliche Repräsentationen und ihre Interpretation\".Universität Stuttgart, Institut für Maschinelle Sprachverarbeitung.Dissertation: Experiments on the Automatic Induction of German Semantic Verb Classes 10/2001-11/2001 Kollaboration mit Bibliographisches Institut & F.A. Brockhaus AGProjekt: Comparison of Lexical Verb Entries 04/1999-07/2000 Wissenschaftliche Angestellte im Sonderforschungsbereich 340 \"Linguistische Grundlagen der Computerlinguistik\".Universität Stuttgart, Institut für Maschinelle Sprachverarbeitung.Projekt: Statistical Grammar Models and Lexicon Acquisition 10/1993-12/1998 Diplomstudium der ComputerlinguistikUniversität Stuttgart, Institut für Maschinelle Sprachverarbeitung.Diplomarbeit: Automatic Semantic Classification of Verbs According to their Alternation Behaviour 10/1996-09/1997 MSc-Programm in Cognitive Science and Natural LanguageUniversity of Edinburgh, Centre for Cognitive Science.Studienarbeit: Resolving Bridging Descriptions in High-Dimensional Space 08/1990-07/1993 Duales Studium der WirtschaftsinformatikBerufsakademie Emsland e.V. in Kooperation mit der Deilmann Erdöl Erdgas GmbH.Abschlussarbeit: Entwicklung eines Informationssystems zur Verwaltung und Überwachung der EDV-technischen Einrichtungen der Deilmann Erdöl Erdgas GmbH 08/1983-07/1990 Gymnasium Georgianum, Lingen (Ems) Projektleitung und Stipendien seit 07/2025 Projektleiterin der DFG-Sachbeihilfe SCHU 2580/5-2 Computationelle Modelle für Sprach- und Sprecher-Bedeutungsvarianten von Nomen-Komposita und Partikelverben (SemVarMWE). seit 06/2024 Projektleiterin der DFG-Sachbeihilfe SCHU 2580/7 MeTRapher: Learning to Translate Metaphors. 07/2022-08/2025 Projektleiterin der DFG-Sachbeihilfe SCHU 2580/5 Computationelle Modelle für die Entstehung und den Diachronen Wandel der Bedeutungen von Nomen-Komposita und Partikelverben (SemChangeMWE). seit03/2022 Projektleiterin der DFG-Sachbeihilfe SCHU 2580/4 Multimodale Dimensionen und Computationelle Anwendungen von Abstraktheit (MUDCAT). 10/2015-06/2018 Projektleiterin des DFG-Projekts D11 (von Lonneke van der Plas übernommen) im Sonderforschungsbereich 732 \"Inkrementelle Spezifikation in Kontext\": Sprachübergreifendes Verfahren zur Interpretation von Nominalkomposita. 07/2014-06/2018 Projektleiterin des DFG-Projekts D12 im Sonderforschungsbereich 732 \"Inkrementelle Spezifikation in Kontext\": Bedeutungen und reguläre Bedeutungsverschiebungen bei deutschen Partikelverben. 07/2014-06/2018 Leiterin des Integrierten Graduiertenkollegs im DFG-Sonderforschungsbereich 732 \"Inkrementelle Spezifikation in Kontext\". 11/2011-02/2017 Projektleiterin der DFG-Sachbeihilfe SCHU 2580/2 Distributionelle Ansätze für die Modellierung von semantischen Beziehungen. 10/2011-06/2014 Projektleiterin des DFG-Projekts D6 (von Sebastian Padó übernommen) im Sonderforschungsbereich 732 \"Inkrementelle Spezifikation in Kontext\": Lexikalisch-semantische Faktoren in der Ereignisinterpretation. 10/2011-12/2016 DFG-Heisenberg-Stipendium SCHU 2580/1Homepage 08/2000-07/2003 DFG-Promotionsstipendium im Graduiertenkolleg 609 \"Linguistische Repräsentationen und ihre Interpretation\" SemRel-Team Meine SemRel-Gruppe beschäftigt sich mit Themen rund um die Modellierung von semantischen Beziehungen zwischen Wortbedeutungen. Aktuelle Mitarbeiter*innen: Annerose Eichel, Doktorandin (Hanns-Seidel-Stiftung; Robert Bosch GmbH) Chris Jenkins, Doktorand (Projekt SemChangeMWE) Sinan Kurtyigit, Doktorand (TUM Heilbronn; Projekt MeTRapher) Urban Knupleš, Doktorand (Projekte MUDCAT und MeTRapher) Filip Miletić, Postdoktorand (Projekt SemChangeMWE) Prisca Piccirilli, Doktorandin (Studienstiftung des deutschen Volkes; LMU München; Projekte MUDCAT und MeTRapher) Tarun Tater, Doktorand (Projekt MUDCAT) Ehemalige Mitarbeiter*innen: Jeremy Barnes, Doktorand (SFB 732/MGK) Dr. Stefan Bott, Postdoktorand (Heisenberg-Gruppe) Marco del Tredici, Doktorand (SFB 732/MGK) Marion Di Marco (née Weller), Doktorandin (Heisenberg-Gruppe) Anna Hätty, Doktorandin (Robert Bosch GmbH) Evangelia Kiagia, Doktorandin (SFB 732/MGK) Maximilian Köper, Doktorand (SFB 732/D12) Gabriella Lapesa, Doktorandin (SFB 732/MGK) Daniela Naumann, Doktorandin (SFB 732/MGK) Kim-Anh Nguyen, Doktorand (Vietnam Ministry of Education and Training) Shuxian Pan, Doktorandin Anita Ramm, Doktorandin (SFB 732/MGK) Stephen Roller, Doktorand (SFB 732/MGK) Dr. Michael Roth, Postdoktorand (Heisenberg-Gruppe) Dr. Silke Scheible, Postdoktorandin (Heisenberg-Gruppe) Dominik Schlechtweg, Doktorand (SFB/MGK; Konrad-Adenauer-Stiftung) Sylvia Springorum, Doktorandin (SFB 732/D12) Zum Seitenanfang",
  "content_length": 7750,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:16"
}