{
  "name": "Sabine Timpf",
  "homepage": "https://www.uni-augsburg.de/en/fakultaet/fai/geo/prof/geoinf/geoinf-team/s-timpf",
  "status": "success",
  "content": "Prof. Dr. Sabine Timpf Geoinformatics University Faculties Faculty of Applied Computer Science Institute of Geography Chairs and Professors Geoinformatics Team Prof. Dr. Sabine Timpf Prof. Dr. Sabine Timpf Professor for Geoinformatics Geoinformatics Phone: +49 821 598 2313 Email: sabine.timpf@geo.uni-augsburggeo.uni-augsburg.de () Room: 2022 (B) Open hours: Appointment via e-mail, WiSe 26/27: Tue 4-5pm Address: Alter Postweg 118, 86159 Augsburg Contact (.vcf) Further Information Visiting hours: Please contact me via Email or come to my office Tuesdays between 4 and 5pm (WiSe 2025/26). Outside of semester teaching times, please contact me via Email. Portfolios: Please send your Portfolio to me via Email. You will receive the signed copy back also via Email. Please make sure that you use your UniA student email address and that you have filled out all required fields in the Portfolio. Research Foci spatial cognition in geo-spatial activities (wayfinding and navigation, landscape planning) geospatial artic´ficial intelligence (GeoAI) enabling smart mobility using information technology urban intelligent (and complex) systems agent-based modelling and simulation 3D models of urban environments Courses / Teaching If you are interested in researching and writing a Bachelor's or Master's thesis with me, then please check out our teaching pages. Course Home institute Lecturer Semester Type Language OPUS Publication list Please also take a look at my Google Scholar, OrcID, ResearcherID and ResearchGate profiles. 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | 2002 | 2001 | 2000 | 1999 | 1998 | 1997 | 1996 | 1995 | 1994 | 1993 | 1992 2025 2025. Geographic Information Science responding to Global Challenges: proceedings of the 28th AGILE Conference on Geographic Information Science, 10–13 June 2025, Dresden, Germany. In Auriol Degbelo, Serena Coetzee, Carsten Keßler, Monika Sester, Sabine Timpf, Lars Bernard (Eds.). Copernicus, GöttingenBibTeX | RIS | URL Eva Nuhn, Kai Hamburger and Sabine Timpf. 2025. Mapping olfactory cues for wayfinding – a theoretical approach and an empirical study. Journal of Location Based Services 19, 1, 78-102. DOI: 10.1080/17489725.2024.2371298BibTeX | RIS | DOI Eva Nuhn, Michaela Ehrig, Leonie Engemann, Fabian Heißerer, Julia Maltan, Jenny Ruf and Sabine Timpf. 2025. Measuring landmark salience in rural areas: a comparative study of two models. In Auriol Degbelo, Serena Coetzee, Carsten Keßler, Monika Sester, Sabine Timpf, Lars Bernard (Eds.). Geographic Information Science responding to Global Challenges: proceedings of the 28th AGILE Conference on Geographic Information Science, 10-13 June 2025, Dresden, Germany. Copernicus, Göttingen, 7 DOI: 10.5194/agile-giss-6-7-2025PDF | BibTeX | RIS | DOI Nico Van de Weghe, Lars De Sloover, Anthony Cohn, Haosheng Huang, Simon Scheider, Renée Sieber, Sabine Timpf and Christophe Claramunt. 2025. Opportunities and challenges of integrating geographic information science and large language models. Journal of Spatial Information Science 30, 93-116. DOI: 10.5311/josis.2025.30.389PDF | BibTeX | RIS | DOI Auriol Degbelo, Serena Coetzee, Carsten Keßler, Monika Sester and Sabine Timpf. 2025. Preface. In Auriol Degbelo, Serena Coetzee, Carsten Keßler, Monika Sester, Sabine Timpf, Lars Bernard (Eds.). Geographic Information Science responding to Global Challenges: proceedings of the 28th AGILE Conference on Geographic Information Science, 10-13 June 2025, Dresden, Germany. Copernicus, Göttingen, 1 DOI: 10.5194/agile-giss-6-1-2025PDF | BibTeX | RIS | DOI 2024 Irada Ismayilova and Sabine Timpf. 2024. Knowledge-based identification of urban green spaces: allotments. In Alison Heppenstall, Mingshu Wang, Urska Demsar, Rob Lemmens, Jing Yao (Eds.). Geographic Information Science for a Sustainable Future: proceedings of the 27th AGILE Conference on Geographic Information Science, 4–7 June 2024, Glasgow, UK. Copernicus, Göttingen, 8 DOI: 10.5194/agile-giss-5-8-2024PDF | BibTeX | RIS | DOI Eva Nuhn, Laura Spang and Sabine Timpf. 2024. getFeedback!: Feedback-based learning while identifying a caravan site location. In Alison Heppenstall, Mingshu Wang, Urska Demsar, Rob Lemmens, Jing Yao (Eds.). Geographic Information Science for a Sustainable Future: proceedings of the 27th AGILE Conference on Geographic Information Science, 4–7 June 2024, Glasgow, UK. Copernicus, Göttingen, 42 DOI: 10.5194/agile-giss-5-42-2024PDF | BibTeX | RIS | DOI 2023 Eva Nuhn and Sabine Timpf. 2023. Landmark weights - an alternative to spatial distances in shortest route algorithms. Spatial Cognition & Computation 23, 3, 206-232. DOI: 10.1080/13875868.2022.2130330BibTeX | RIS | DOI Sabine Timpf and Franziska Klügl. 2023. Modelling affordances as emergent phenomena. In Roger Beecha, Jed A. Long, Dianna Smith, Qunshan Zhao, Sarah Wise (Eds.). 12th International Conference on Geographic Information Science (GIScience 2023), September 12-15, 2023, Leeds, UK. Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Wadern, 72:1-72:6 DOI: 10.4230/LIPIcs.GIScience.2023.72PDF | BibTeX | RIS | DOI Xiang Zhou, Zulfa Nur'aini Afifah, Andreas Keler, Sabine Timpf and Jukka M. Krisp. 2023. Narrative indoor navigation – an approach using annotated 360-degree camera documentation. In Haosheng Huang, Nico Van de Weghe, Georg Gartner (Eds.). Proceedings of the 18th International Conference on Location Based Services, LBS 2023, Ghent, Belgium, 20-22 November 2023. Ghent University, Ghent, 31-35 DOI: 10.34726/5728PDF | BibTeX | RIS | DOI Irada Ismayilova and Sabine Timpf. 2023. Semantic identification of urban green spaces: forest. AGILE: GIScience Series 4, 28. DOI: 10.5194/agile-giss-4-28-2023PDF | BibTeX | RIS | DOI Irada Ismayilova and Sabine Timpf. 2023. Towards an ontology of urban green spaces. GI_Forum 10, 2, 47-57. DOI: 10.1553/giscience2022_02_s47PDF | BibTeX | RIS | DOI Eva Nuhn, Kai Hamburger and Sabine Timpf. 2023. Urban sound mapping for wayfinding – a theoretical approach and an empirical study. AGILE: GIScience Series 4, 9. DOI: 10.5194/agile-giss-4-9-2023PDF | BibTeX | RIS | DOI Eva Nuhn, Kai Hamburger and Sabine Timpf. 2023. Urban sound mapping for wayfinding – a theoretical approach and an empirical study. In Peter van Oosterom, Hendrik Ploeger, Ali Mansourian, Simon Scheider, Rob Lemmens, Bastiaan van Loenen (Eds.). Spatial data for design: proceedings of the 26th AGILE Conference on Geographic Information Science, 13–16 June 2023, Delft, the Netherlands. Copernicus, Göttingen, 9 DOI: 10.5194/agile-giss-4-9-2023PDF | BibTeX | RIS | DOI 2022 Irada Ismayilova and Sabine Timpf. 2022. Classifying urban green spaces using a combined Sentinel-2 and random forest approach. AGILE: GIScience Series 3, 38. DOI: 10.5194/agile-giss-3-38-2022PDF | BibTeX | RIS | DOI Eva Nuhn and Sabine Timpf. 2022. Do people prefer a landmark route over a shortest route?. Cartography and Geographic Information Science 49, 5, 407-425. DOI: 10.1080/15230406.2022.2075469BibTeX | RIS | DOI Eva Nuhn, Franziska König and Sabine Timpf. 2022. Landmark route: a comparison to the shortest route. AGILE: GIScience Series 3, 12. DOI: 10.5194/agile-giss-3-12-2022PDF | BibTeX | RIS | DOI Moritz Mühlmeier, Eva Nuhn and Sabine Timpf. 2022. Towards a GeoSocial landmark identification model. In Jukka Krisp, Liqiu Meng, Holger Kumke, H. Huang (Eds.). 17th International Conference on Location-Based Services (LBS), September 12-14, 2022, Munich/Augsburg, Germany. Technical University Munich, MunichBibTeX | RIS | URL 2021 Jesús Rojo, Jose Oteros, Antonio Picornell, José M. Maya‐Manzano, Athanasios Damialis, Katrin Zink, Matthias Werchan, Barbora Werchan, Matt Smith, Annette Menzel, Sabine Timpf, Claudia Traidl-Hoffmann, Karl‐Christian Bergmann, Carsten B. Schmidt‐Weber and Jeroen Buters. 2021. Effects of future climate change on birch abundance and their pollen load. Global Change Biology 27, 22, 5934-5949. DOI: 10.1111/gcb.15824PDF | BibTeX | RIS | DOI Irada Ismayilova, Tabea Zeyer and Sabine Timpf. 2021. Identification of microplastics in soils using 2D geometric shape descriptors. AGILE: GIScience Series 2, 32. DOI: 10.5194/agile-giss-2-32-2021PDF | BibTeX | RIS | DOI Eva Nuhn and Sabine Timpf. 2021. Modelling of landmark dimensions [Abstract]. Cognitive Processing 22, 1, 28. DOI: 10.1007/s10339-021-01058-xBibTeX | RIS | DOI Eva Nuhn and Sabine Timpf. 2021. On the modelling of landmarks [Abstract]. Cognitive Processing 22, 1, 27. DOI: 10.1007/s10339-021-01058-xBibTeX | RIS | DOI Franziska Klügl and Sabine Timpf. 2021. Towards more explicit interaction modelling in agent-based simulation using affordance schemata. In Stefan Edelkamp, Ralf Möller, Elmar Rueckert (Eds.). KI 2021: Advances in Artificial Intelligence: 44th German Conference on AI, virtual event, September 27 – October 1, 2021, proceedings. Springer, Cham, 324-337 DOI: 10.1007/978-3-030-87626-5_24BibTeX | RIS | DOI 2020 Eva Nuhn and Sabine Timpf. 2020. How to model (personalised) Landmarks?. Lecture Notes in Computer Science 12162, 33-49. DOI: 10.1007/978-3-030-57983-8_3BibTeX | RIS | DOI Irada Ismayilova, Evelyn Uuemaa, Aveliina Helm, Christian Röger and Sabine Timpf. 2020. Land suitability analysis of Alvar grassland vegetation in Estonia using Random Forest. GI_Forum: Journal for Geographic Information Science 8, 1, 63-72. DOI: 10.1553/giscience2020_01_s63PDF | BibTeX | RIS | DOI 2019 Sabine Timpf, Christoph Schlieder, Markus Kattenbeck, Bernd Ludwig and Kathleen Stewart (Ed.). 2019. 14th International Conference on Spatial Information Theory: COSIT 2019, September 9–13, 2019, Regensburg, Germany. (Online-Ressource). Schloss Dagstuhl - Leibniz-Zentrum für Informatik, Dagstuhl (LIPIcs - Leibniz International Proceedings in Informatics ; 142). BibTeX | RIS Sabine Timpf. 2019. Categorisations: AI. KI - Künstliche Intelligenz 33, 4, 313-314. DOI: 10.1007/s13218-019-00629-7BibTeX | RIS ",
  "content_length": 44502,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:19"
}