{
  "name": "Saeed Salem",
  "homepage": "http://www.cs.ndsu.nodak.edu/~ssalem",
  "status": "success",
  "content": "Welcome to Saeed Salem's webpage Home Publications Teaching Service NSF Project Saeed Salem, PhD Professor and Graduate Coordinator Computer Science Department North Dakota State University Phone: (701) 231-6377 Fax: (701) 231-8255 Email: URL: http://cs.ndsu.edu/~salem/ Selected Publications: All Google Scholar Underlined authors: students. Saeed Salem, Mohammed Alokshiya, Mohammad Al Hasan. RASMA: a reverse search algorithm for mining frequent subgraphs. BMC BioData Mining, 14(1), pp. 1-23, 2021. Abubakr O Al-Abbasi, Lutfi Samara, Saeed Salem, Ridha Hamila, Naofal Al-Dhahir. A Unified Framework for Differentiated Services in Intelligent Healthcare Systems. IEEE Transactions on Network Science and Engineering, 2021. Riyad Hakim, Saeed Salem . Efficiently mining rich subgraphs from vertex-attributed graphs. In Proceedings of the 11th ACM International Conference on Bioinformatics, Computational Biology and Health Informatics (BCB 2020), USA, September 21-24, 2020. Sarim Zafar, Muhammad Usman Sarwar, Saeed Salem, Muhammad Zubair Malik. Language and Obfuscation Oblivious Source Code Authorship Attribution. IEEE Access 8, 197581-197596, 2020. Mohammed Alokshiya, Saeed Salem, Fidaa Abed. A Linear Delay Algorithm for Enumerating All Connected Induced Subgraphs. BMC Bioinformatics, 20(12), 312, 2019. Jeff Anderson, Maral Azizi, Saeed Salem, Hyunsook Do. On the Use of Usage Patterns from Telemetry Data for Test Case Prioritization. Information and Software Technology, 113, pp. 110-130, 2019. Saeed Salem. Template edge similarity graph clustering for mining multiple gene expression datasets. International Journal of Data Mining and Bioinformatics, 18(1), pp. 28-39, 2017. Jeff Anderson, Hyunsook Do, Saeed Salem. Customized Regression Testing Using Telemetry Usage Patterns. In Proceedings of the 32nd IEEE International Conference on Software Maintenance and Evolution (ICSME), pages 572-581, October 2016. Jeff Anderson, Hyunsook Do, Saeed Salem. Striving for failure: An industrial case study about test failure prediction. In Proceedings of the 2015 IEEE/ACM 37th IEEE International Conference on Software Engineering (ICSE), volume 2 of ICSE 2015, pages 49-58, May 2015. Saeed Salem, Cagri Ozcaglar. Hybrid coexpression link similarity graph clustering for mining biological modules from multiple gene expression datasets. BMC BioData Mining, 7(1):16, 2014. Saeed Salem. Mining frequent subgraph patterns for classifying biological data. In Xiao-Li Li, See Kiong Ng, and Jason T. L. Wang, editors, Biological Data Mining and its Applications in Healthcare, pages 147-167. World Scientific, 2014. Jeff Anderson, Saeed Salem, Hyunsook Do. Improving the Effectiveness of Test Suite Through Mining Historical Data. In Proceedings of the 11th Working Conference on Mining Software Repositories (MSR'14; co-located with ICSE2014), pages 142-151, May 2014. Saeed Salem, Mohammed J. Zaki, Chris Bystroff. FlexSnap: Flexible Non-sequential Protein Structural Alignment. Algorithms for Molecular Biology Journal, 5(12), 2010. Saeed Salem, Mohammed J. Zaki, Chris Bystroff. SNAP: Iterative Non-Sequential Protein Structural Alignment. Journal of Bioinformatics and Computational Biology, 7(3), pp. 571-596, 2009. Saeed Salem, Mohammed J. Zaki, Chris Bystroff. FlexSnap: Flexible Non-Sequential Protein Structural Alignment. In Proceedings of the 9th International Workshop on Algorithms in Bioinformatics (WABI). Philadelphia, PA, September 2009. Saeed Salem, Mohammed J. Zaki. Iterative Non-Sequential Protein Structural Alignment. In Proceedings of the 7th Annual International Conference on Computational Systems Bioinformatics (CSB). Stanford, CA, August 2008. Address: North Dakota State University Computer Science Dept. 2740 258 QBB Bldg. 1320 Albrecht Blvd. Fargo ND 58102, USA",
  "content_length": 3798,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:20"
}