{
  "name": "Saeed Samet",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1052/dr-saeed-samet",
  "status": "success",
  "content": "Dr. Saeed Samet | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Saeed Samet Dr. Saeed Samet Associate Professor (519) 253-3000 Ext: 3782 Saeed.Samet@uwindsor.ca Room 5102 Lambton Tower Education: Post Doctoral Fellow (2010 – 2012): E-Health Information Laboratory, Research Institute at the Children Hospital of Eastern Ontario (CHEO), Ottawa, ON, Canada Ph.D. in Computer Science (2010), University of Ottawa, Ottawa, ON, Canada M.Sc. in Computer Science (2005), McMaster University, Hamilton, ON, Canada M.Sc. in Computer Science (2003), Tehran University, Tehran, Iran Research Interests: Privacy-Preserving in Data Mining, Machine Learning, and Statistics, Big Data, Social Networks e-Health Security and Privacy Health Informatics mHealth Cryptography and Network Security Secure Multi-party Computation Secret Sharing Selected Publications: Saeed Samet, Mohd Tazim Ishraque, Mehdi Ghadamyari, Krishna Kakadiya, Yash Mistry, and Youssef Nakkabi. TouchMetric: a machine learning based continuous authentication feature testing mobile application. International Journal of Information Technology. pp. 1–7. April 2019. Javad Rahimipour, Saeed Samet, Mahdi Eftekhari, and Chang Wook Ahn. A Fuzzy-Rough Feature Selection based on Binary Shuffled Frog Leaping Algorithm. International Journal of Computer, Electrical, Automation, Control and Information Engineering, 12(9), pp. 722 - 729, 2018. Saeed Samet. Secure Bivariate Statistical Analysis on Health Data. International Interdisciplinary Conference on Science Technology Engineering Management Pharmacy and Humanities (IIC- STEMPH 2017), Singapore, pp. 71-78, April 2017. Saeed Samet, Mitu Kumar Debnath, and Navid Shekoufa. A Secure, Online, Interactive, and Revocable Personal Health Record System. The 2017 Canadian e-Health Conference, Toronto, ON, Canada, June 4 to 7, 2017. Arastoo Bozorgi, Saeed Samet, Johan Kwisthout, and Todd Wareham. Community-based Influence Maximization in Social Networks under a Competitive Linear Threshold Model. Journal of Knowledge-Based Systems, Vol. 134, pp. 149-158. 2017. Saeed Samet, Ahoora Sadeghi, and Shabnam Asghari. Secure Health Statistical Analysis Methods. IADIS International Journal on Computer Science and Information Systems, Vol. 11, No. 1, pp. 32-48. 2016. Javad Rahimipour, Saeed Samet, Wolfgang Banzhaf, and Mahdi Eftekhari. A New Fuzzy-Rough Hybrid Merit to Feature Selection. LNCS Transactions on Rough Sets XX, Volume 10020, pp. 1-23, DOI: 10.1007/978-3-662-53611-7_1. 2016. Biruk Habtemariam, Andriy Miranskyy, Ali Miri, Saeed Samet, and Matt Davison. Privacy Preserving Predictive Analytics with Smart Meters. Proceeding of the 2016 IEEE International Congress on Big Data. San Francisco, USA, 27 June-2 July 2016. Saeed Samet. Privacy-Preserving Statistical Analysis on Health Data. The 7th International Conference on e-Health (EH 2015), Canary Islands, July 2015. Khaled El Emam, Hanna Farah, Saeed Samet, Aleksander Essex, Elizabeth Jonker, Murat Kantarcioglu, Craig Earle.  A Privacy Preserving Protocol for Tracking Participants in Phase I Clinical Trials. Journal of Biomedical Informatics (JBI). Volume 57, pp. 145-162, October 2015. Saeed Samet. Privacy-Preserving Logistic Regression. Journal of Advance in Information Technology, Volume 6, No. 3, pp. 88-95, 2015. Saeed Samet and Ali Miri. New Incremental Privacy-Preserving Clustering Protocols. Lecture Notes on Software Engineering (LNSE), Volume 1, Issue 3, pp. 244-248, August 2013. Saeed Samet, Ali Miri and Eric Granger. Incremental learning of privacy-preserving Bayesian networks. Applied Soft Computing Journal, Volume 13, Issue 8, pp. 3657-3667, 2013. Khaled El Emam, Saeed Samet, Luk Arbuckle, Robyn Tamblyn, Craig Earle, and Murat Kantarcioglu. A Secure Distributed Logistic Regression Protocol for the Detection of Rare Adverse Drug Events. Journal of the American Medical Informatics Association (JAMIA), Volume 20, Issue 3, pp. 453-461, May 2013. Saeed Samet and Ali Miri. Privacy-Preserving Back-Propagation and Extreme Learning Machine Algorithms. Journal of Data & Knowledge Engineering. Volume 79-80, pp. 40-61, September-October 2012. Khaled El Emam, Saeed Samet, Jun Hu, Liam Peyton, Craig Earle, Gayatri C. Jayaraman, Tom Wong, Murat Kantarcioglu, Fida Dankar, and Aleksander Essex. A Protocol for the Secure Linking of Registries for HPV Surveillance. PLOS ONE, Volume 7, Issue 7, e39915, July 2012. Saeed Samet and Ali Miri. Privacy-Preserving Bayesian Network for Horizontally Partitioned Data. IEEE International Conference on Information Privacy, Security, Risk and Trust (PASSAT 2009). Vancouver, Canada, August 2009. Saeed Samet and Ali Miri. Secure two and multi-party association rule mining. IEEE Symposium: Computational Intelligence for Security and Defence Applications (CISDA 2009). Ottawa, Canada, July 2009. Website: http://ssamet.myweb.cs.uwindsor.ca/ Meet Dr. Samet! share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 7540,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:21"
}