{
  "name": "Saeed Boorboor",
  "homepage": "https://saeedboorboor.github.io",
  "status": "success",
  "content": "Boorboor Assistant Professor University of Illinois Chicago boorboor [AT] uic.edu home publications courses team news and updates Nov 2025 Our submission to the BioMedVis Challenge, IEEE VIS 2025 received the Award of Excellence! July 2025 One paper accepted to IEEE ISMAR 2025! June 2025 Attended the Visualization Summer Camp 25/26 cohort April 2025 Gave a lecture talk at NYU on \"Situated Visual Information Spaces\" Feb 2025 I'll be serving as a Program Committee member for IEEE VIS 2025 Feb 2025 Gave a talk on \"Immersive Visualization,\" at LUMS, School of Science and Engineering, Pakistan 2025 Joining UIC as Assistant Professor Will be serving as IEEE VR 2026 Publications co-chair Dec 2024 Two papers accepted at IEEE VR 2025 Saeed Boorboor I am an Assistant Professor at the Department of Computer Science at the University of Illinois Chicago. My research seeks to design, build, and evaluate visualization systems that empower domain scientists to explore, analyze, and interact with scientific data, using methods of human-centered design, image processing, computer graphics, and applied AI. I am also interested in investigating novel visualization and interaction methods across immersive technologies -- from hand-held and wearable devices to large display modalities. Prior to joining UIC, I was a Principal Research Scientist at the Center for Visual Computing, Stony Brook University. I received my Ph.D. in CS from Stony Brook University, advised by Prof. Arie E. Kaufman. Research Highlights ✸ New -- accepted to IEEE ISMAR 2025 ✸ AuxiScope:  Handheld Augmented Reality Tablet as an Auxiliary Display for Large-Scale Display Systems Matthew S. Castellana, Chahat Kalsi, Saeed Boorboor, Arie E. Kaufman [Demo] Explainable XR:  Understanding User Behaviors of XR Environments using LLM-assisted Analytics Framework Yoonsang Kim, Zainab Aamir, Mithilesh Singh, Saeed Boorboor, Klaus Mueller, Arie E. Kaufman [Demo] Silo:  Half-Gigapixel Cylindrical Stereoscopic Immersive Display Saeed Boorboor, Doris E. Gutierrez-Rosales, Ahamed Shoaib, Chahat Kalsi, Yue Wang, Yuyang Cao, Xianfeng Gu, Arie E. Kaufman [Demo] VoxAR:  Adaptive Visualization of Volume Rendered Objects in Optical See-Through Augmented Reality Saeed Boorboor, Matthew S. Castellana, Yoonsang Kim, Chen Zhu-Tian, Johanna Beyer, Hanspeter Pfister, Arie E. Kaufman [Demo] Submerse:  Visualizing Storm Surge Flooding Simulations in Immersive Display Ecologies Saeed Boorboor, Yoonsang Kim, Ping Hu, Josef Moses, Brian Colle, and Arie E. Kaufman. [Demo] [Media] NeuRegenerate:  A Framework for Visualizing Neurodegeneration Saeed Boorboor, Shawn Mathew, Mala Ananth, David Talmage, Lorna W. Role, and Arie E. Kaufman. IEEE TVCG 2023. [Demo] Courses Courses taught at UIC: CS 428: Virtual Reality, Augmented Reality, Mixed Reality (Fall 2025) Courses taught at Stony Brook University: CS 366: Introduction to Virtual Reality (Spring 2024) Team I work with the wonderful team at the Electronic Visualization Laboratory (EVL). Students I supervise (ordered by time joined): Daye Yoon 2025 - Ph.D. Student",
  "content_length": 3081,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:18"
}