{
  "name": "Saeid Tizpaz-Niari",
  "homepage": "https://tizpaz.github.io",
  "status": "success",
  "content": "Saeid Tizpaz-Niari The key theme in my research is to automate the process of finding and explaining bugs, vulnerabilities, and fairness issues in large-scale software and machine learning systems. In particular, I am interested in analyzing a differential class of properties that include confidentiality, privacy, and fairness. The findings help discover multiple performance bugs in popular ML libraries such as scikit-learn, fairness bugs in the state-of-the-art machine learning algorithms, and timing side-channel vulnerabilities in critical Java libraries such as OpenJDK and Apache ([1],[2],[3],[4],[5]). I lead the Responsible, Informative, and Secure Computing Lab (RISC) at UIC. Software Engineering (SE) + Machine Learning (Secure, Efficient, and Fair Software Systems) Responsible and Fair AI-Software Development [ICSE'25,ISSTA'24, ICSE'23, ICSE'22] Accountable Tax Prep Software [IRS-TPC'25, IRS-TPC'24, ICSE-SEIS'23, NLLP'23] Performance Testing and Debugging with SE for ML [CAIN'24, ISSTA'20 , AAAI'18 , TACAS'17] Automated Verification, Fuzz Testing, and Debugging of Security Vulnerabilities [TOSEM'24, TNSM'23, ISSTA'21, NDSS'20, CAV'19] Application of Deep Neural Network for Side-Channel Analysis [STTT'21,RV'19] News Nov 2025. Presented our paper on detecting, quantifying, and explaining discrimination clusters in ASE'25, Seoul, South Korea. Nov 2025. Rafael presented his paper on the risk estimation of differential fuzzing in ASE'25, Seoul, South Korea. Nov 2025. I presented an invited talk on \"Metamorphic Debugging for Responsible AI-Software\" to Artificial Intelligence Security Lab in EWHA Womans University, Seoul, South Korea (hosted by Dr. Se Eun Oh). Oct 2025. Congratulations to Verya! Our paper \"On the Robustness of Fairness Practices: A Causal Framework for Systematic Evaluation\" has been accepted to the main research track of ICSE'26. Oct 2025. Congratulations to Vishnu! Our paper \"Attention Pruning: Automated Fairness Repair of Language Models via Surrogate Simulated Annealing\" has been accepted to the main research track of ICSE'26. Sep 2025. Congratulations to Rafael! Our paper \"Risk Estimation in Differential Fuzzing via Extreme Value Theory\" has been accepted to the main research track of ASE'25. Aug 2025. Congratulations to Ranit! Our paper \"Uncovering Discrimination Clusters: Quantifying and Explaining Systematic Fairness Violations\" has been accepted to the main research track of ASE'25 (9.5% direct acceptance rate). July 2025. My team has received the prestigious NSF CAEER Award on building debugging tools and techniques for Responsible AI-Software development. Thank You, NSF! June 2025. Congratulations to Sina! Our paper on LLM agentic approach for legal-critical software (with an emphasis on the tax prep software) has been accepted to the main research track of ICSE'26 (9% direct acceptance rate). April 2025. Congratulations to Sina! Our paper on evaluating Large Language Models (LLMs) for VITA Tax Certification Test has been accepted to the Journal of Artificial Intelligence and Law. Jan 2025. I am teaching a special topic course on Responsible AI Engineering at UIC during Spring 2025. Jan 2025. After five great years at UTEP, I am joining to the faculty of CS department at University of Illinois Chicago as an Assistant Professor. Dec 2024. Our collaborative work on Taxpayer Perceptions of Trust and Procedural Justice in Tax Software with Krystia Reed (Pyschology) and Ashutosh Trivedi (CS) has been accepted to the Journal of Law and Human Behavior (Justice, Legitimacy, and Technology). Dec 2024. Congratulations to Normen. FairLay-ML toolkit has been accepted to the demonstration track of ICSE'25. Dec 2024. I invited to serve as a PC for the main research track of ICSE'26. Nov 2024. Congratulations to Verya! Our paper Fairness Testing through Extreme Value Theory has been accepted to the main research track of ICSE'25. Oct 2024. I presented our position paper on Metamorphic Debugging for Accountable Software at ProLaLa'24. Aug 2024. Data Science in a Mathematics Classroom: Lessons on AI Fairness with two K-12 teachers, Ms. Sotelo and Ms. Wieseman (Northwest Early College High School El Paso) has been accepted to SIGITE'24. Aug 2024. The third edition of our workshop InteNSE: International Workshop on Interpretability, Robustness, and Benchmarking in Neural Software Engineering (Third Edition: Large Language Models) has been accepted to ICSE 2025 Workshop Track. Aug 2024. Metamorphic Debugging for Accountable Software has been accepted to Programming Languages and the Law (ProLaLa'24)! July 2024. Sina has presented our work on Maintaining Tax Prep Software via LLMs to the 2024 IRS-TPC Research Conference, Washington, DC! June 2024. Congratulations to Vishnu! Our work NeuFair: Neural Network Fairness Repair with Dropout has been accepted to ISSTA'24! May 2024. Our collaborative work on Timing Side-Channel Mitigation via Automated Program Repair has been accepted to TOSEM'24! April 2024. I invited to serve as a PC of AI, Ethics, and Society (AIES'24). April 2024. I invited to serve as a PC of ISSTA'25. April 2024. Congratulations to Salvador! Our work on Predicting Fairness of ML Software Configurations has been accepted to PROMISE'24 (co-located with FSE'24). April 2024. Dr. Danil Mikhailov (the Executive Director of data.org) has presented an invited talk on \"Responsible AI in practice\". March 2024. Dr. Mikhail Yurochkin (IBM Research) has presented an invited talk on \"Individual Fairness\" for my Responsible AI course. Jan 2024. Excited to present a cross-listed course on Responsible AI in Spring 2024 at UTEP. Jan 2024. Our paper on Worst-Case Convergence Time of ML Algorithms via Extreme Value Theory has been accepted to AI Engineering Conference (CAIN'24). Dec 2023. Congratulations to Sina! Our paper on Maintaining Tax Prep Software with Large Language Models has been accepted to the 14th IRS-TPC Research Conference on Tax Administration. Dec 2023. I invited to serve as a PC of ISSTA'24. Nov 2023. I invited to serve as a PC of ASE'24. Oct 2023. Our paper On the Potential and Limitations of Few-Shot In-Context Learning to Generate Metamorphic Specifications for Tax Preparation Software has been accepted to In the 5th Natural Legal Language Processing (NLLP 2023). Sep 2023. Our workshop InteNSE'24: International Workshop on Interpretability, Robustness, and Benchmarking in Neural Software Engineering (Second Edition: Large Language Models) has been accepted to ICSE 2024 Workshop Track. Aug 2023. I am extremely honored to receive an NSF DASS award, Assessing Accountability of Tax Preparation Software Systems in collaboration with Dr. Krystia Reed (UTEP, Pyschology) and Ashutosh Trivedi (CU Boulder, CS): $750k for UTEP+CU Boulder and $530,000 for UTEP. Thank You, NSF! July 2023. I invited to serve as a PC of FSE'24. June 2023. I presented a workshop on safe and ethical AI to 10 middle- and high- school teachers from various El Paso K-12 schools. May 2023. I received an outstanding award for securing external fuding from the OSRP office at UTEP. May 2023. I presented our ICSE'23 and ICSE-SEIS'23 papers in Melbourne, Austalia. May 2023. Together with Dr. Jabbarvand, we successfully held the first ICSE workshop on Interpretability and Robustness in Neural Software Engineering (InteNSE’23) in Melbourne, Austalia. May 2023. Congratulations to Normen Yu for a successful BS Thesis project: FairLay-ML: Intuitive Remedies for Unfairness in Data-Driven Social-Critical Algorithms. March 2023. I am thrilled to receive my first PI grant funding from NSF SaTC Program, Detecting and Localizing Non-Functional Vulnerabilities in Machine Learning Libraries in collaboration with Dr. Tan. Thank You, NSF! Dec 2022. \"Metamorphic Testing and Debugging of Tax Preparation Software\" has been accepted to ICSE-SEIS'23! Dec 2022. Congratulations to Verya! Information-Theoretic Testing and Debugging of Fairness Defects in Deep Neural Networks has been accepted to ICSE 2023! Nov 2022. Our Workshop \"InteNSE: Interpretability and Robustness in Neural Software Engineering\" has been accepted to ICSE workshop track. Oct 2022. I invited to serve as a PC of Programming Languages and Law (ProLaLa'23). Oct 2022. \"Detecting Unseen Anomalies in Network Systems by Leveraging Neural Networks\" has been accepted to IEEE Transactions on Network and Service Management (IEEE TNSM). Dec 2021. \"Fairness-aware Configuration of Machine Learning Libraries\" has been accepted to ICSE 2022! Apr 2021. \"QFuzz: Quantitative Fuzzing for Side Channels\" has been accepted to ISSTA 2021! Apr 2020. \"Detecting and Understanding Real-World Differential Performance Bugs in Machine Learning Libraries\" has been accepted to ISSTA 2020! Feb 2020. \"Data-driven debugging for functional side channels\" has been accepted to NDSS 2020! Nov 2019. Our RV'19 paper is recognized as one of the top papers in RV'19 and invited for submitting to STTT Journal. July 2019. \"Efficient Detection and Quantification of Timing Leaks with Neural Networks\" has been accepted to RV 2019! Apr 2019. \"Quantitative Mitigation of Timing Side Channels\" has been accepted to CAV 2019! Apr 2018. I received \"2018 Gold Research Award\" from ECEE department of CU Boulder! Nov 2017. \"Differential Performance Debugging with Discriminant Regression Tree\" has been accepted to AAAI 2018! Dec 2016. \"Discriminating Traces with Time\" has been accepted to TACAS 2017! Apr 2016. I won the Second Prize in the First Microsoft Open Source Challenge by Microsoft Research. Hello, Welcome!",
  "content_length": 9566,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:21"
}