{
  "name": "Saeid Sanei",
  "homepage": "https://www.saeidsanei.com",
  "status": "success",
  "content": "Home Professor Saeid Sanei BSc, MSc, PhD, DIC, FIEEE, FBCS Professor of Signal Processing & Machine Learning College of Engineering & Computer Science (CECS), VinUniversity, Hanoi, Vietnam saeid.s@vinuni.edu.vn & Visitor to School of Neuroscience, Institute of Psychiatry, Psychology & Neuroscience King's College London, Denmark Hill, London, SE5 9RS, UK Google Scholar: https://scholar.google.co.uk/citations?user=zUaubUQAAAAJ&hl=en SHORT BIOGRAPHY Saeid Sanei received his PhD from Imperial College London in 1991. He worked in National University of Singapore, King’s College London, Cardiff University, University of Surrey, Nottingham, Imperial College London (as a Visiting Professor in Digital Health from 2017-2025), and King's College London (Visiting Professor since 2025) . He is a Fellow of British Computer Society (FBCS), Fellow of IEEE (FIEEE) and has been a member of prestigious IEEE MLSP and SPTM Technical Committees. His research involves development of adaptive and nonlinear systems including consensus and adaptive diffusion networks, tensor factorisation, graph signal processing, compressive sensing, subspace analysis, machine learning including deep neural networks, and many others mostly with applications to biological signals and systems. He has served as the Director of Digital Signal Processing Centre in Cardiff University and the Deputy Head of Computer Science Department in University of Surrey. He developed four UG and MSc programs and many teaching modules and lectured more than 30 different subjects across Electrical Engineering, Computer Science, and Bioengineering. He served as the External Examiner to Glasgow University, London Southbank University, University of Mauritius, Singapore Institute of Management, and currently Royal Holloway University of London (RHUL), where he also serves as the External Assessor of the Academic Promotion Panel. Saeid registered 5 patents, published 5 books, 7 Edited Books, 8 book chapters, and over 470 peer-reviewed papers (Google Scholar citation can be found Here). He also presented 32 keynote talks, tutorials, and workshops, and over 60 invited talks in prestigious international conferences and institutions and received several best paper awards. Saeid, internationally known for his brain research, has supervised 6 Postdocs and 47 successful PhD students as the main supervisor. He has been a Distinguished Lecturer to Nanyang Singapore and served as the REF Assessor and External to Hong Kong Polytechnic University during 2018-2019. He has been an Associate Editor for the IEEE Signal Processing Magazine, IEEE Signal Processing Letters, and Journal of Computational Intelligence and Neuroscience and several others. He organized and chaired several reputed conferences including IEEE ICASSP 2019. He collaborates with world renown research laboratories such as RIKEN in Japan, Temasek Laboratory in Singapore, and GIPSA-Lab in France as well as many Neuroscience and other clinical departments in the UK hospitals and worldwide. Last but not least, he is a Co-Founder of Brain Aware Charity. CONTENT: Current Research Conference Organisation Editorial Activities and International Recognition Publications Adverts for Journal Special Issues Currently Open for Submissions Current Research: Brain-Computer Interfacing (BCI) Seizure Identification by Analysis of Interictal Epileptiform Discharges (IED) and Brain Response to Single Pulse Electrical Stimulation (SPES), EEG Signal Processing & Machine Learning, Infant's Lung Sound Analysis and Automated Diagnosis, Heart Murmur Identification and Classification, Processing of other Biosignals  and Medical images, Cooperative Networks for BCI, Body Sensor Networks, Source Localisation, Crowd Modelling, and Robot Swarming. Conference Organisation (Leadership & Networking) 1. Co-organizer and Finance Chair of IEEE Statistical Signal Processing Workshop, SSP2001, Singapore 2. Organizing Chair, 15th Int. Conf. on Digital Signal Processing, DSP 2007, July 2007, Cardiff, UK. 3. General Chair and Organizer, IEEE Statistical Signal Processing Workshop, SSP2009, Aug-Sept 2009, Cardiff, UK. 4. Honorary Chair, Third Int. Conf. on Bio-inspired Systems and Signal Processing, 2010, Valencia, Spain 5. General Chair, IEEE International Workshop on Machine Learning for Signal Processing (MLSP), UK, 2013 (and LVA/ICA 2013). 6. General Chair and Organizer of Seizure Engineering Conference, Surrey, UK, 2015 7. Technical Program Co-Chair of European Signal Processing Conference, EUSIPCO 2016, Budapest, Hungary. 8. Honorary Chair, 1st Int. Conf. on Emerging Trends in Electrical, Electronic, and Communication Engineering (ELECOM 2016) Mauritius, 2016. 9. General Chair and Organizer of the 22nd Int. Conf. on Digital Signal Processing, DSP 2017, London, UK. 10. International Chair of the 2nd Int. Conf. on Emerging Trends in Electrical, Electronic, and Communication Engineering (ELECOM 2018) Mauritius, 2018. 11. General Chair and Organizer of the 44th IEEE International Conference on Acoustics, Speech, and Signal Processing, ICASSP 2019, Brighton, UK. 12. Member of Advisory Committee of IEEE 14th Image, Video, and Multidimensional Signal Processing Workshop 23-26 June 2020, Nafplio, Greece. 13. International Chair of the 3rd Int. Conf. on Emerging Trends in Electrical, Electronic, and Communication Engineering (ELECOM 2020) Mauritius, 2020. 14. Tutorial Co-Chair of 47th IEEE International Conference on Acoustics, Speech, and Signal Processing, ICASSP 2022, Singapore. 15. Technical Program Chair; International Forum on Signal Processing (IFSP 2021) in Sanya, China, January 1-3, 2021. 16. International Chair of the 4th Int. Conf. on Emerging Trends in Electrical, Electronic, and Communication Engineering (ELECOM 2022) Mauritius, 2022. 17. Award Panel Chair of Digital Signal Processing Conference, DSP 2023, Rhodes Island, Greece. 18. Special Sessions Chair of the IEEE Statistical Signal Processing 2023 (SSP 2023), Hanoi, Vietnam 19. Advisory Board Chair of IEEE Machine Learning for Signal Processing (MLSP 2024), London, UK. 20. Honorary Chair of the 16th International Conference on Signal Processing Systems (ICSPS 2024) will be held in Kunming, China during November 15-17, 2024. 21. International Chair of the 5th Int. Conf. on Emerging Trends in Electrical, Electronic, and Communication Engineering (ELECOM 2024) Mauritius, 2024. 22. General Co-Chair of International Conference on Multi-disciplinary Trends in Artificial Intelligence (MIWAI 2025), UK. 23. Constantinides Track Chair of the 25th International Conference on Digital Signal Processing (DSP 2025), Costa Navarino, Greece. 24. Advisory Chair of the 17th International Conference on Signal Processing Systems (ICSPS 2025), Chengdu, China during October 24-26, 2025. Editorial Activities and International Recognition 1. Associate Editor of Journal of Computational Intelligence and Neuroscience. 2. Guest Editor of the EURASIP Journal of Computational Intelligence and Neuroscience special issue in EEG/MEG Signal Processing, 3. Associate Editor; IEEE Signal Processing Letters, May 2009-May 2011. 4. Guest Editor; Majlesi Journal of Electrical Engineering, 2010. 5. Guest Editor of the EURASIP Journal of Computational Intelligence and Neuroscience special issue on Bioinspired Systems and Cognitive Signal Processing, 6. Guest Editor: Springer Journal special Issue on Machine Learning for Signal Processing, 2013. 7. Guest Editor of Elsevier Journal of Computers and Electrical Engineering; Special Issue on Biomedical Signal and Image Processing and Biometrics, 2013-2014. 8. Associate Editor of IEEE Signal Processing Magazine, for Columns & Forum; since 2014. 9. Editorial Board Member; Journal of Frontiers in Biomedical Technologies, since 2013. 10. Guest Editor of the Sixth Special Issue on Advances in Biomedical Signal and Image Processing, and Biometrics, Elsevier Journal of Computers and Electrical Engineering (2015-2016). 11. Guest Editor of the Journal of Bioengineering, Special Issue in Biomedical Signal Processing, 2016. 12. Editorial Board Member of Journal of Neurodevelopmental Cognition, Since Nov. 2016 13. Editorial Board Member of Journal of Signals, Since March 2017. 14. Associate Editor of Elsevier Journal of Sciencia Iranica, since 2017. 15. Guest Editor of Journal of Computer Networks and Communications, 2018.16. 16. Guest Editor of Elsevier Journal of Computers and Electrical Engineering Special Issue on Recent Advancements in Biomedical Engineering, 2019-2020. 17. Guest Editor of Journal of Biosensors (together with H. Costin), Special Issue on Intelligent Biosignal Processing in Wearable and Implantable Sensors, 2020. 18. Guest Editor of Journal of Sensors (together with S. Kouchaki and X. Ding), Special Issue on AI and IoT Enabled Solutions for Healthcare, 2021-2022. 19. Guest Editor of Journal of Biosensors (Together with H. Costin), Special Issue on Applications of AI and Wearable Biosensors in Precision, Personalized and Predictive Medicine, 2022-2023. 20. Guest Editor for the Special Issue Body Sensor Networks and their applications to healthcare and health technology for Elsevier Journal of Smart Health, 2023-2024 (https://www.sciencedirect.com/journal/smart-health/about/call-for-papers). 21. Guest Editor of Journal of Bioengineering (Together with T. KM Lee), Special Issue on Surrogate Biomedical Data Generation, 2024 (https://www.mdpi.com/journal/bioengineering/special_issues/8GN99VCI60). Publications Books (monograms): S. Sanei, A. Valentin, and G. Alarcon, EEG Processing and Learning for Epilepsy Identification, , John Wiley & Sons, 2026, ISBN: 978-1394396764. S. Sanei and J. A. Chambers, EEG Signal Processing and Machine Learning, John Wiley & Sons, 2021, ISBN-10: 978-1119386942; ISBN-13: 978-1119386940. S. Sanei, D. Jarchi and A. G. Constantinides, Body Sensor Networking, Design and Algorithms, John Wiley & Sons, 2020, ISBN-10: 978-1-119-39001-5 (eBook), ISBN-13: 978-1-119-39002-2 ",
  "content_length": 54031,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:22"
}