{
  "name": "Sagnik Mukhopadhyay",
  "homepage": "https://sagnikm.github.io",
  "status": "success",
  "content": "Sagnik Mukhopadhyay I am an associate professor in the School of Computer Science at the University of Birmingham. I am primarily associated with the Theory of Computation group. My research interest is in algorithms and complexity. In my previous avatar, I was a lecturer (Assistant professor in North American equivalence) in the Department of Computer Science at the University of Sheffield, a post-doctoral researcher at the Department of Computer Science in the University of Copenhagen in 2021, at KTH Royal Institute of Technology during 2019-2021, a post-doctoral fellow at IUUK, Charles University in 2018, in the APC group at KTH Royal Institute of Technology during 2017-2018, and a graduate student in theoretical computer science at TIFR Mumbai until August 2017, working under the guidance of Dr. Arkadev Chattopadhyay. I am a recipient of the UKRI New Investigator Award. During my PhD, I was a recipient of TCS PhD Fellowship and my PhD research work was supported by this fellowship. Current team members PhD: Shravan Mehra (2024 - present), Yonggang Jiang (2022 - present) Postdoc: Vihan Shah (2025 - present) Highlights [New!] New paper accepted in SODA and SOSA 2026. Check the publication section. [New!] Together with Arindam Khan, Siddharth Barman, Anand Lewis and Thatchaphol Saranurak, I am organising a workshop at IISc Bengaluru called Frontiers of Graph Algorithms. We have a fantastic set of speakers. Please consider attending. [Ongoing] I am looking for a motivated PhD student. Start date is flexible. Contact me if you have read my papers and are interested in my research area. [Pinned!] I am not accepting any interns. [Pinned] Along with Allan Lo, I organise a monthly TCS + Combinatorics seminar series. More details here. Upcoming talks: Sagnik Mukhopadhyay [first letter of first name].[surname]@bham.ac.uk Associate Professor in Computer Science School of Computer Science University of Birmingham United Kingdom Google Scholar DBLP Plain Academic",
  "content_length": 1987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:22"
}