{
  "name": "Saher S. Manaseer",
  "homepage": "http://www.just.edu.jo/~masadeh/pages/pup.htm",
  "status": "success",
  "content": "My favorite Links Publications Muneer Bani Yassein SCOPUS(55969035200) Publications Krstic, D., Marjanovic, I., Zdravkovic, S., Veljkovic, S., Yassein, M.M.B. Moments of macrodiversity SC receiver output signal with two microdiversity EGC receivers with three branches over rayleigh multipath fading environment (2015) International Conference on Applied Electronics, 2015-October, art. no. 7301070, pp. 121-124. Salayma, M., Al-Dubai, A., Romdhani, I., Yassein, M.B. Battery aware beacon enabled IEEE 802.15.4: An adaptive and cross-layer approach (2015) Proceedings of the 2015 Federated Conference on Computer Science and Information Systems, FedCSIS 2015, art. no. 2015F118, pp. 1267-1272. Khamayseh, Y., Mardini, W., Aljawarneh, S., Yassein, M.B. Integration of wireless technologies in Smart University Campus environment: Framework architecture (2015) International Journal of Information and Communication Technology Education, 11 (1), pp. 60-74. Cited 1 time. Yassein, M.B., Al-Maolegi, M., Khamayseh, Y., Krstic, D., Aljawarneh, S. Smart system for busy roads using short range wireless technologies (2015) International Journal of Mathematics and Computers in Simulation, 9, pp. 146-152. Bourdena, A., Mavromoustakis, C.X., Kormentzas, G., Pallis, E., Mastorakis, G., Yassein, M.B. A resource intensive traffic-aware scheme using energy-aware routing in cognitive radio networks (2014) Future Generation Computer Systems, 39, pp. 16-28. Cited 17 times. Mardini, W., Yassein, M.B., Khamayseh, Y., Ghaleb, B.A. Rotated hybrid, energy-efficient and distributed (R-HEED) clustering protocol in WSN (2014) WSEAS Transactions on Communications, 13, pp. 275-290. Cited 7 times. Charalambous, M., Mavromoustakis, C., Violaris, G., Yassein, M. On the mobility scenario implementation using a graphical P2P discrete event simulator for the bittorrent protocol (2013) Journal of Algorithms and Computational Technology, 7 (4), pp. 449-487. Cited 1 time. Alwidian, S.A., Ababneh, I.M., Yassein, M.O.B. Neighborhood-based route discovery protocols for mobile ad hoc networks (2013) International Journal of Mobile Computing and Multimedia Communications, 5 (3), pp. 68-87. Charalambous, M.C., Mavromoustakis, C.X., Yassein, M.B. A resource intensive traffic-aware scheme for cluster-based energy conservation in wireless devices (2012) Proceedings of the 14th IEEE International Conference on High Performance Computing and Communications, HPCC-2012 - 9th IEEE International Conference on Embedded Software and Systems, ICESS-2012, art. no. 6332263, pp. 879-884. Cited 6 times. Yassein, M.B., Abed Al-Hameed, B., Mavromoustakis, C.X. Adaptive counter-based broadcasting scheme in mobile ad hoc networks (2012) HP-MOSys'12 - Proceedings of the ACM Workshop on High Performance Mobile Opportunistic Systems, pp. 47-51. Yassein, M.B., Jaradat, Z., Hijazi, N., Mavromoustakis, C. New load balancing algorithm for LEACH protocol (F-VCH LEACH) (2012) Sensors and Transducers, 145 (10), pp. 172-182. Bani Yassein, M.O., Alslaity, A.N., Ababneh, I.M. Performance evolutions of velocity-aware routing protocol for Mobile Ad hoc Networks (2012) UBICOMM 2012 - 6th International Conference on Mobile Ubiquitous Computing, Systems, Services and Technologies, pp. 8-13. Yassein, M.B., Abuein, Q., Alzoubi, D. Dynamic probabilistic flooding in DSR routing algorithm for wireless network(2012) Journal of Emerging Technologies in Web Intelligence, 4 (4), pp. 352-361. Shatnawi, M.Q., Yassein, M.B., Mahafza, R. A framework for retrieving Arabic documents based on queries written in Arabic slang language (2012) Journal of Information Science, 38 (4), pp. 350-365. Cited 5 times. Yassein, M.O.B., Manaseer, S.S., Momani, A.A. Adaptive backoff algorithm for wireless internet(2012) Journal of Emerging Technologies in Web Intelligence, 4 (2), pp. 155-163. Cited 2 times. Khamayseh, Y., Al-Salah, R., Yassein, M.B. Malicious nodes detection in MANETs: Behavioral analysis approach(2012) Journal of Networks, 7 (1), pp. 116-125. Cited 4 times. Yassein, M.B., Al-Rushdan, S., Mardini, W., Khamayseh, Y. Performance of probabilistic broadcasting of dynamic source routing protocol (2011) CTRQ 2011 - 4th International Conference on Communication Theory, Reliability, and Quality of Service, pp. 110-114. Khamayshe, Y., Yassein, M.B., Badran, I.I., Mardini, W. An adaptive backoff algorithm for mobile Ad-Hoc networks (2011) International Journal of Mobile Computing and Multimedia Communications, 3 (3), pp. 1-19. Yassein, M.B., Mistareehi, H. Improvement on the lifetime of the wsn using energy efficiency saving of leach protocol (New Improved LEACH) (2011) Sensors and Transducers, 130 (7), pp. 142-154. Cited 3 times. Mardini, W., Khamayseh, Y., Yassein, M.B., Obiedat, G. Survey of latest Wimax technologies and techniques (2011) International Review on Computers and Software, 6 (4), pp. 586-603. Cited 3 times. Yassein, M.B., Nimer, S.F., Al-Dubai, A.Y. A new dynamic counter-based broadcasting scheme for Mobile Ad hoc Networks (2011) Simulation Modelling Practice and Theory, 19 (1), pp. 553-563. Cited 17 times. Yassein, M.B., Oqaily, O.A., Min, G., Mardini, W., Khamayseh, Y., Manaseer, S.S. Enhanced Fibonacci backoff algorithm for mobile Ad-hoc network (2010) Proceedings - 10th IEEE International Conference on Computer and Information Technology, CIT-2010, 7th IEEE International Conference on Embedded Software and Systems, ICESS-2010, ScalCom-2010, art. no. 5578112, pp. 749-754. Cited 3 times. Yassein, M.B., Al-hassan, A.A., Taye', Z.A. Performance analysis of the effects of network density and network mobility on velocity-based scheme in mobile ad hoc network (2010) 2010 7th International Multi-Conference on Systems, Signals and Devices, SSD-10, art. no. 5585522, . Yassein, M.B., Hijazi, N. Improvement on cluster based routing protocol by using vice cluster head(2010) Proceedings - NGMAST 2010: 4th International Conference on Next Generation Mobile Applications, Services, and Technologies, art. no. 5558223, pp. 137-141. Cited 4 times. Yassein, M.B., Manaseer, S., Al-hassan, A.A., Taye, Z.A., Al-Dubai, A.Y. A new probabilistic linear exponential backoff scheme for MANETs(2010) Proceedings of the 2010 IEEE International Symposium on Parallel and Distributed Processing, Workshops and Phd Forum, IPDPSW 2010, art. no. 5470789, . Bani Yassein, M., Bani Khalaf, M., Al-Dubai, A.Y. A new probabilistic broadcasting scheme for mobile ad hoc on-demand distance vector (AODV) routed networks (2010) Journal of Supercomputing, 53 (1), pp. 196-211. Cited 21 times. Alsaad, A., Bani-Yassein, M., Qattan, I.A., Ahmad, A., Malkawi, S.R. Structural and magnetic properties of MnN and ScN binaries and their ScN:Mn diluted magnetic semiconductors and MnxSc1-xN alloys (2010) Physica B: Condensed Matter, 405 (5), pp. 1408-1414. Cited 2 times. Yassein, M.B., Al-Dubai, A., Khaoua, M.O., Al-jarrah, O.M. New adaptive counter based broadcast using neighborhood information in MANETS(2009) IPDPS 2009 - Proceedings of the 2009 IEEE International Parallel and Distributed Processing Symposium, art. no. 5161179, . Bani Yassein, M., Al Sha'Bani, R., Alsaad, A., Manaseer, S. Performance evolution of easy-exponential backoff algorithm in a mobile ad hoc network (MANET) (2009) 3rd Mosharaka International Conference on Communications, Signals and Coding, MIC-CSC 2009, . Yassein, M.B., Khaoua, M.O., Mackenzie, L.M., Papanastasiou, S., Jamal, A. Improving route discovery in on-demand routing protocols using local topology information in MANETs (2006) PM2HW2N 2006: Proceedings of 2006 ACM International Workshop on Performance Monitoring, Measurement, and Evaluation of Heterogeneous Wireless and Wired Networks, pp. 95-99. Cited 15 times. Yassein, M.M.B., Khaoua, M.O., Mackenzie, L.M., Papanastasiou, S. Performance evaluation of adjusted probabilistic broadcasting in MANETs (2006) Proceedings - 2nd IEEE International Symposium on Dependable, Autonomic and Secure Computing, DASC 2006, art. no. 4030889, pp. 245-249. Cited 7 times. Bani-Yassein, M., Ould-Khaoua, M., MacKenzie, L.M., Papanastasiou, S. Performance analysis of adjusted probabilistic broadcasting in mobile ad hoc networks (2006) International Journal of Wireless Information Networks, 13 (2), pp. 127-139. Cited 32 times. Bani Yassein, M., Ould-Khaoua, M., Papanastasiou, S. On the performance of probabilistic flooding in mobile ad hoc networks(2005) Proceedings of the International Conference on Parallel and Distributed Systems - ICPADS, 2, pp. 125-129. Cited 3 times. Yassein, M.B., Ould-Khaoua, M., Papanastasiou, S. Performance evaluation of flooding in MANETs in the presence of multi-broadcast traffic (2005) Proceedings of the International Conference on Parallel and Distributed Systems - ICPADS, 2, pp. 505-509. Cited 3 times. M. Bani Yassein, H. Sencal and M. Al-Nawashi, \" Comparison between multi probabilistic schemes in MANETs using different parameters\", the Third Mosharaka International Conference on Communications, Computers and Applications (MIC-CCA2009), Amman  Jordan, 26-28 October 2009. M. Bani Yassein, N. Hijazi and Z. Jaradat, \" Lower Energy Adaptive Clustering Hierarchy Using N-Vice Cluster Head \", the Third Mosharaka International Conference on Communications, Computers and Applications (MIC-CCA2009), Amman  Jordan, 26-28 October 2009. M. Bani Yassein, R. Al Shabani, A. Alsaad and S. Manaseer, \" Performance Evolution of Easy-Exponential Backoff Algorithm in a Mobile Ad hoc Network (MANET)\", the third Mosharaka International Conference on Communications, Signals and Coding (MIC-CSC2009)., Amman  Jordan, 19-21 October 2009. M. Bani Yassein and M. Bani Khalaf  A Performance Comparison of Smart Probabilistic Broadcasting of Ad hoc Distance vector (AODV)  Proceeding of the IEEE International conference on Communications, Propagation and Electronics, MIC-CPE 2009, Amman, Jordan, February 6-8, 2009. Muneer Bani Yassein, Saher S. Manaseer and Abdallh .Al-Turani, A Performance Probabilistic ",
  "content_length": 17013,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:30"
}