{
  "name": "Sahil Singla 0001",
  "homepage": "https://www.cc.gatech.edu/~ssingla7",
  "status": "success",
  "content": "Sahil Singla Workshops Teaching Advising Publications Program Committees Sahil Singla Assistant Professor, School of Computer Science, Georgia Tech Address: 2142 KACB, 266 Ferst Drive, Atlanta, GA 30332 Email: s <my last name> at gatech dot edu Research Interests My research is in Algorithms and Uncertainty where the goal is to design optimal algorithms for uncertain inputs by studying different forms of uncertainty together. My uncertainty models are inspired from areas such as Online Algorithms, Algorithmic Game Theory, Stochastic Optimization, Multi-Armed Bandits and Online Learning. Here is my CV, DBLP, and Google Scholar. Also, a 3 min and a 1 hour video overview of my research. Biography I am an Assistant Professor in the School of Computer Science at Georgia Tech. Before coming to Atlanta, I was a Research Instructor (postdoc) at Princeton University and Institute for Advanced Study from 2018 to 2021. Earlier, I finished my PhD in Computer Science at Carnegie Mellon University where I was advised by Anupam Gupta and Manuel Blum. Workshops and Tutorials Workshop on Online Algorithms beyond Competitive Analysis at Dagstuhl 2025. Summer School on Data-Driven Stochastic Optimization at PhD School on Intersections of Algorithms and Machine Learning Theory, Denmark 2025 (videos, material) Workshop (with videos) on Online Resource Allocation at STOC 2024. Tutorial on Online Contention Resolution Schemes at FOCS 2023 (video, slides) Tutorial (with videos) on Prophet Inequalities and Implications to Pricing Mechanisms and Online Algorithms at EC 2021 Teaching CS 6515: Graduate Algorithms, Georgia Tech (Fall 2025, Fall 2024) CS 4540: Advanced Undergraduate Algorithms: Online Decision Making, Georgia Tech (Spring 2025) CS 7530: Randomized Algorithms, Georgia Tech (Fall 2024) CS 6550/8803: Advanced Algorithms and Uncertainty, Georgia Tech (Spring 2024, Spring 2022) CS 3510: Design and Analysis of Algorithms, Georgia Tech (Fall 2023) CS 3511: Algorithms Honors, Georgia Tech (Spring 2023) COS 521: Advanced Algorithm Design, Princeton (Fall 2020) COS 397: IW Seminar on Algorithms and Uncertainty, Princeton (Fall 2020, Fall 2018) COS 445: Economics and Computation, Princeton (Spring 2019) Advising Ph.D. Siddharth Meenachi Sundaram (Ph.D., 2025-current) Zhimeng Gao (Ph.D., 2024-current) Thiago Oliveira (Ph.D., 2024-current, jointly with Mohit Singh) Kalen Patton (Ph.D., 2022-current) Yifan Wang (Ph.D., 2021-current) Postdoc Matthew Faw (ARC Postdoc, 2024-current) Evangelia Gergatsouli (ARC Postdoc, 2024-2025) Rohan Ghuge (ARC Postdoc, 2023-2025) Selected Publications (All Publications) Online Algorithms and Online Learning Integral Online Algorithms for Set Cover and Load Balancing with Convex Objectives T. Kesselheim, M. Molinaro, K. Patton, and S. Singla. Symposium on Foundations of Computer Science (FOCS 2025) Supermodular Approximation of Norms and Applications T. Kesselheim, M. Molinaro, and S. Singla. Symposium on Theory of Computing (STOC 2024) (video) Bandit Algorithms for Prophet Inequality and Pandora's Box K. Gatmiry, T. Kesselheim, S. Singla, and Y. Wang. Symposium on Discrete Algorithms (SODA 2024) (slides) Online Vector Balancing and Geometric Discrepancy N. Bansal, H. Jiang, S. Singla, and M. Sinha. Symposium on Theory of Computing (STOC 2020) (video, slides) Contributed talk at HALG 2020 Invited talk at TCS+ 2020 (also see below the paper Online Discrepancy Minimization for Stochastic Arrivals) Online Learning with Vector Costs and Bandits with Knapsacks T. Kesselheim and S. Singla. Conference on Learning Theory (COLT 2020) (video, slides) Contributed talk at HALG 2020 Algorithmic Game Theory Single-Sample and Robust Online Resource Allocation R. Ghuge, S. Singla, and Y. Wang. Symposium on Theory of Computing (STOC 2025) (video) Online Combinatorial Allocations and Auctions with Few Samples P. Duetting, T. Kesselheim, B. Lucier, R. Reiffenhauser, and S. Singla. Symposium on Foundations of Computer Science (FOCS 2024) (video) Improved Truthful Mechanisms for Subadditive Combinatorial Auctions: Breaking the Logarithmic Barrier S. Assadi, T. Kesselheim, and S. Singla. Symposium on Discrete Algorithms (SODA 2021) (video, slides) Approximation Schemes for a Unit-Demand Buyer with Independent Items via Symmetries P. Kothari, D. Mohan, A. Schvartzman, S. Singla, and S. M. Weinberg. Symposium on Foundations of Computer Science (FOCS 2019) (video, slides) Invited talk at HALG 2020 (video) Improved Truthful Mechanisms for Combinatorial Auctions with Submodular Bidders S. Assadi and S. Singla. Symposium on Foundations of Computer Science (FOCS 2019) (video, slides) Short research note in SIGecom Exchanges Invited to SICOMP Special Issue for FOCS 2019 Invited talk at Highlights Beyond EC at EC 2020 (video) Prophet Secretary for Combinatorial Auctions and Matroids S. Ehsani, M. Hajiaghayi, T. Kesselheim, and S. Singla. Symposium on Discrete Algorithms (SODA 2018) (slides) SIAM Journal on Computing (SICOMP 2024) Stochastic Discrete Optimization Improved Mechanisms and Prophet Inequalities for Graphical Dependencies V. Livanos, K. Patton, and S. Singla. Conference on Economics and Computation (EC 2024) (video) Efficient Approximation Schemes for Stochastic Probing and Prophet Problems D. Segev and S. Singla. Conference on Economics and Computation (EC 2021) (video, slides) The Price of Information in Combinatorial Optimization S. Singla. Symposium on Discrete Algorithms (SODA 2018) (slides) (also see the paper The Markovian Price of Information) Adaptivity Gaps for Stochastic Probing: Submodular and XOS Functions A. Gupta, V. Nagarajan, and S. Singla. Symposium on Discrete Algorithms (SODA 2017) (video, slides) Invited talk at ISMP 2018 Exact Analysis of TTL Cache Networks D. Berger, P. Gland, S. Singla, and F. Ciucu. IFIP Performance 2014 (slides) Best Paper Award Book Chapters and Theses Random-Order Models A. Gupta and S. Singla. Chapter 11 in the book Beyond the Worst-Case Analysis of Algorithms, Cambridge University Press, 2021 Combinatorial Optimization Under Uncertainty: Probing and Stopping-Time Algorithms S. Singla. Ph.D. Thesis, Carnegie Mellon University, 2018 (slides) Program Committees Symposium on Discrete Algorithms (SODA 2020, SODA 2023, SODA 2024, SODA 2026) International Colloquium on Automata Languages and Programming, Track A (ICALP 2021, ICALP 2026) Innovations in Theoretical Computer Science (ITCS 2025) Symposium on Theory of Computing (STOC 2024) International Conference on Approximation Algorithms for Combinatorial Optimization Problems (APPROX 2024) Foundations of Software Technology and Theoretical Computer Science (FSTTCS 2024) Conference on Economics and Computation, Track Theory (EC 2019, EC 2020, EC 2021, EC 2023) EECS Rising Stars (RS 2023) The Web Conference, Track on Economics, Monetization, and Online Markets (TheWebConf 2022) Conference on Web and Internet Economics (WINE 2021) European Symposium on Algorithms, Track A (ESA 2019)",
  "content_length": 6987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:28"
}