{
  "name": "Sahra Sedigh Sarvestani",
  "homepage": "http://web.mst.edu/~sedighs",
  "status": "success",
  "content": "Sahra Sedigh Sarvestani | Missouri S&T Sahra Sedigh Sarvestani Missouri University of Science & Technology Affiliations Department of Electrical & Computer Engineering Associate Professor and Distance Learning Coordinator Faculty Ombuds Faculty Senate Senator for ECE Intelligent Systems Center (ISC) Investigator Contact Information Office 135 Emerson Electric Co. Hall 301 W. 16th Street Rolla, MO 65409 P: +1 (573) 341-7505 Office Hours Fall 2025 August 25 through December 12 Tuesdays 1:30 to 3 pm Thursdays, 9 to 10:30 am or by appointment Research Details at my group's web page Dependability modeling for critical infrastructure Funded by the US Department of Education, the National Science Foundation, and the Missouri S&T Intelligent Systems Center. Software-based analysis and improvement of electromagnetic immunity Funded by Ford and Samsung. Dependable networks and systems for environmental and structural monitoring Funded by the US Department of Transportation, Missouri Department of Transportation, the Center for Infrastructure Engineering Studies, and the European Commission. Short Bio I am an Associate Professor of Electrical and Computer Engineering and a Research Investigator with the Intelligent Systems Center at the Missouri University of Science and Technology. I hold a BS in electrical engineering from the Sharif University of Technology, and an MS in electrical engineering and PhD in electrical and computer engineering from Purdue University. My current research centers on the analysis and modeling of dependability for complex systems, with focus on critical infrastructure and cyber-physical systems My past and present research sponsors include the National Science Foundation, the US and Missouri Departments of Transportation, the Department of Education, the National Security Agency, the European Union, and industry. My past experience includes analysis and development of high availability mechanisms for critical network systems. I am a Fellow of the National Academy of Engineering's Frontiers of Engineering Education Program and held a Purdue Research Foundation Fellowship throughout my doctoral studies. I am a Senior Member of the IEEE, a member of the IEEE Computer Society's Golden Core, and a member of IEEE-HKN. Teaching Fall 2025 Schedule CpE 5410 Introduction to Computer Communication Networks TR 11 am to 12:15 pm",
  "content_length": 2375,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:28"
}