{
  "name": "Sai Kit Yeung",
  "homepage": "http://www.saikit.org",
  "status": "success",
  "content": "Dr. Sai-Kit Yeung Home Members Publications Teaching Services Opportunities Sai-Kit Yeung Professor Division of Integrative Systems and Design (ISD) Department of Computer Science and Engineering (CSE) Department of Ocean Science (OCES) Hong Kong University of Science and Technology Email: saikit[AT]ust.hk Address: Room 6530, 6/F, School of Engineering, Lifts 27-28 The Hong Kong University of Science and Technology Clear Water Bay Hong Kong Biography: Sai-Kit Yeung is a Professor at the Division of Integrative Systems and Design (ISD), the Department of Computer Science and Engineering (CSE), and the Department of Ocean Science (OCES) at the Hong Kong University of Science and Technology (HKUST). Before joining HKUST, he was an Assistant Professor at the Singapore University of Technology and Design (SUTD) and founded the Vision, Graphics and Computational Design (VGD) Group. During his time at SUTD, he was also a Visiting Assistant Professor at the Computer Science Department at Stanford University and the Computer Science and Artificial Intelligence Laboratory (CSAIL) at MIT. Prior to that, he had been a Postdoctoral Scholar in the Department of Mathematics, University of California, Los Angeles (UCLA). He was a visiting student at the Image Processing Research Group at UCLA in 2008 and the Image Sciences Institute, University Medical Center Utrecht, the Netherlands in 2007. He received his Ph.D. degree in Electronic and Computer Engineering, M.Phil. degree in Bioengineering, and B.Eng. degree (First Class Honors) from HKUST, respectively in 2009, 2005 and 2003. Dr. Yeung's research expertise is in computer vision and computer graphics. His current research interests include 3D contents (scene and shape) reconstruction, understanding, modeling, and redesign, as well as computational design (using AI techniques for design and content generation), computational fabrication, visual understanding, and human-AI interaction. Education and Working Experience: 2024 - Present Professor, Division of Integrative Systems and Design (ISD) Department of Computer Science and Engineering (CSE) Department of Ocean Science (OCES) Hong Kong University of Science and Technology (HKUST) 2018 - 2024 Associate Professor, Division of Integrative Systems and Design (ISD) Hong Kong University of Science and Technology (HKUST) 2011 - 2018 Assistant Professor, Pilliar of Information Systems Technology and Design (ISTD), Singapore University of Technology and Design (SUTD) 2013 - 2014 Visiting Assistant Professor, Department of Electrical Engineering and Computer Science, Massachusetts Institute of Technology (MIT) 2013 Summer Visiting Assistant Professor, Computer Science Department, Stanford University 2010 - 2011 Postdoctoral Scholar, Department of Mathematics, The University of California, Los Angeles (UCLA) 2009 - 2010 Postdoctoral Fellow, Department of Computer Science and Engineering, The Hong Kong University of Science and Technology (HKUST) 2005 - 2009 Ph.D., Electronic and Computer Engineering, The Hong Kong University of Science and Technology 2003 - 2005 M.Phil., Bioengineering, The Hong Kong University of Science and Technology 2000 - 2003 B.Eng. (First Class Honors) in Computer Engineering, The Hong Kong University of Science and Technology",
  "content_length": 3287,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:28"
}