{
  "name": "Saifuddin Md. Tareeq",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1767",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Saifuddin Md. Tareeq (Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Informatics The Graduate University for Advanced Studies Japan 2011 Masters Computer Science The University of Western Australia Australia 2004 Masters Computer Science University of Dhaka Bangladesh 1998 Bachelor Applied Physics and Electronics University of Dhaka Barbados 1995 Title Organization Location From Date To Date Professor University of Dhaka Dhaka 27, Oct 2014 Currently Working Associate Professor University of Dhaka Dhaka 14, Jan 2012 26-10-2014 Assistant Professor University of Dhaka Dhaka 04, Jul 2004 13-01-2012 Lecturer University of Dhaka Dhaka 01, Jul 1999 03-07-2004 Research Interest Subject Description Research Interest (Goal, Target Indicator) Machine Learning Data Analysis (big data) Human Robot Interaction Humanoid Robot Behavior Generation (for social skill development of Autistic Children) Bioinformatics Regulatory Elements Finding in Genome for Stress Tolerance (salt, drought etc) Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion No project/research supervision is found Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration Human Robot Interaction Robot Behavior Development for Class Room Use for Autistic Children to Enhance Their Social Interaction Ministry of Educaiton 01-07-2016 30-06-2019 Human Robot Interaction Developing Low Cost Robotic kit and Graphical Programming Language for School Students Ministry of Education 01-07-2015 30-06-2018 Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found No publication is found. Award Type Title Year Country Description International NII Scholarship 2007 Japan for pursuing Ph.D International ADS scholarship 2002 Australia for pursuing M. Sc. Local Book Award 1994 Bangladesh for securing first position in the M. Sc. Examination Local Book Award 1993 Bangladesh for securing first position in B. Sc. Examination Dr. Saifuddin Md. Tareeq Professor Department of Computer Science and Engineering Faculty of Engineering and Technology Email: smtareeq@du.ac.bd Phone: 880-2-9661900",
  "content_length": 2582,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:30"
}