{
  "name": "Saikat Dutta 0001",
  "homepage": "https://www.cs.cornell.edu/~saikatd",
  "status": "success",
  "content": "438 Gates HallDepartment of Computer ScienceCornell UniversityIthaca, NY, 14853 USA Saikat Dutta I am an Assistant Professor in the Department of Computer Science at Cornell University. My research interests are at the intersection of Software Engineering and Machine Learning. I am a member of the growing Software Engineering Group at Cornell. I received my PhD in Computer Science from the University of Illinois Urbana-Champaign in Summer 2023, advised by Prof. Sasa Misailovic. Before joining Cornell, I spent a year as a Postdoctoral Researcher at the University of Pennsylvania, working with Prof. Mayur Naik. You can find my CV here. Prospective students: I am looking for skilled and motivated undergraduates, PhD students, and postdocs to join my group. If you are interested in working with me, please drop me an email. If you are a prospective PhD student, apply to the Cornell CS PhD program. Also read this. Research Interests My research interests are at the intersection of Software Engineering and Machine Learning. I am particularly interested in 1) developing novel techniques and tools to improve the reliability of Machine Learning-based systems, and 2) leveraging Machine Learning to solve challenging tasks in Software Engineering. My research focuses on following themes: Automated Test Generation and Debugging of ML/DL libraries [ISSTA 2025 Tool Demo] [FSE 2019] [FSE 2018] Using AI/ML for Automated Software Engineering [ASE 2025] [OOPSLA 2025] [ICLR 2025] [ICST 2025] [ICSE-SEIP 2022] [FASE 2022] Improving Performance and Effectiveness of Regression Tests in Machine Learning Libraries [ICSE 2023] [ICST 2022] [FSE 2021] [ISSTA 2021] [ISSTA 2020] Static and Dynamic Analyses for Probabilistic Programming [SAS 2025] [UAI 2023] [ATVA 2021] [FSE 2018] Students Current PhD students: Yingao (Elaine) Yao (Fall 2024-now) Shinhae (Joseph) Kim (Fall 2024-now; Co-advised with Prof. Owolabi Legunsen) Junkai Huang (Fall 2025-now) Notes for prospective students Teaching Fall 2025: CS 6158: Software Engineering in the Era of ML/AI Spring 2025: CS 5150: Software Engineering Fall 2024: CS 6158: Software Engineering in the Era of Machine Learning Awards ACM SIGSOFT Distinguished Paper Award at ASE 2025 Amazon Research Award 2025 Meta AI: Large Language Model (LLM) Evaluation Research Grant 2025 Public Announcement Mavis Future Faculty Fellowship 2022-23 Facebook PhD Fellowship 2020-22 3M Foundation Fellowship 2019-2020 News New:Nov 2025: Our paper received a ACM SIGSOFT Distinguished Paper Award at ASE 2025! Congrats to my PhD student, Shinhae Kim! New:Sep 2025: Received an Amazon Research Award for our project on DL Compiler Testing! New:Aug 2025: Our paper Faster Runtime Verification during Testing via Feedback-Guided Selective Monitoring has been accepted to ASE 2025! Congrats to my PhD student, Shinhae Kim, for his first paper! New:July 2025: Our paper AURA: Precise Abstract Interpretation of Probabilistic Programs with Interval Data Uncertainty has been accepted to SAS 2025! New:June 2025: Our paper Understanding and Improving Flaky Test Classification has been accepted to OOPSLA 2025! New:May 2025: Our paper Dolphin: A Programmable Framework for Scalable Neurosymbolic Learning has been accepted to ICML 2025! Check out Preprint. New:April 2025: Our paper BugsInDLLs : A Database of Reproducible Bugs in Deep Learning Libraries to Enable Systematic Evaluation of Testing Techniques has been accepted to ISSTA Tool Demo 2025! Check out paper and dataset New:Jan 2025: Our paper LLM-Assisted Static Analysis for Detecting Security Vulnerabilities has been accepted to ICLR 2025! Check out Preprint and Dataset. New:Jan 2025: Excited to receive Meta AI LLM Evaluation Research Grant! See announcement. More News New:Dec 2024: Our paper Evaluating the Effectiveness of LLMs in Detecting Security Vulnerabilities has been accepted to ICST 2025! New:Dec 2024: Our paper CoCoNUT: Structural Code Understanding does not fall out of a tree has been accepted to LLM4Code 2025! August 2024: Our paper GlueTest: Testing Code Translation via Language Interoperability has been accepted to ICSME NIER 2024! August 2024: Started as an Assistant Professor in the CS Department at Cornell University! Passed PhD Final Defense! Find my dissertation here. Our paper ASTRA: Understanding the Practical Impact of Robustness for Probabilistic Programs has been accepted to UAI 2023! Our paper Balancing Effectiveness and Flakiness of Non-Deterministic Machine Learning Tests has been accepted to ICSE 2023! Our paper To Seed or Not to Seed? An Empirical Analysis of Usage of Seeds for Testing in Machine Learning Projects has been accepted to ICST 2022! Our paper InspectJS: Leveraging Code Similarity and User-Feedback for Effective Taint Specification Inference for JavaScript has been accepted to ICSE-SEIP 2022! Our paper SixthSense: Debugging Convergence Problems in Probabilistic Programs via Program Representation Learning has been accepted to FASE 2022! Our paper AQUA: Automated Quantized Inference for Probabilistic Programs has been accepted to ATVA 2021! Our paper TERA: Optimizing Stochastic Regression Tests in Machine Learning Projects has been accepted to ISSTA 2021! Our paper FLEX: Fixing Flaky Tests in Machine-Learning Projects by Updating Assertion Bounds has been accepted to ESEC/FSE 2021! I will be interning at Amazon Web Services (AWS) with the Automated Reasoning Group (ARG) for Summer 2021! Our paper on Detecting Flaky Tests in Probabilistic and Machine Learning Applications was accepted to ISSTA 2020! I will be interning at Microsoft Research, Redmond with the RISE group for Summer 2020!Looking forward to it! Awarded Facebook PhD Fellowship 2020 Thanks Facebook! Our paper, Storm: Program Reduction for Testing and Debugging Probabilistic Programming Systems, has been accepted to FSE 2019 Selected for 3M Foundation Fellowship 2018-19 Our paper on ProbFuzz, \"Testing Probabilistic programming systems\" has been accepted to FSE 2018 Attended PLDI 2018 at Philadelphia, USA (20-22 June, 2018) Our recent work on Automated Sensitivity Analysis was published in IEEE TSE Volume 43, Issue 12 Attended Midwest Programming Language Summit 2017 at Bloomington, Indiana Attended Automated Software Engineering Conference (ASE 2017) at UIUC Selected Publications LLM-Assisted Static Analysis for Detecting Security Vulnerabilities The Thirteenth International Conference on Learning Representations (ICLR 2025) Ziyang Li, Saikat Dutta, Mayur Naik [Paper] [Dataset] [Code] Balancing Effectiveness and Flakiness of Non-Deterministic Machine Learning Tests 45th International Conference on Software Engineering (ICSE 2023) Steven Xia, Saikat Dutta, Sasa Misailovic, Darko Marinov, and Lingming Zhang [Paper] [Code] FLEX: Fixing Flaky Tests in Machine-Learning Projects by Updating Assertion Bounds 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (FSE 2021) Saikat Dutta, August Shi, and Sasa Misailovic [Paper] [Code] All Publications Preprints: Evaluating the Effectiveness of Coverage-Guided Fuzzing for Testing Deep Learning Library APIs Feiran Qin, M. M. Abid Naziri, Hengyu Ai, Saikat Dutta, Marcelo d'Amorim [Preprint] [Code] A Regression Testing Framework with Automated Assertion Generation for Machine Learning Notebooks Yingao (Elaine) Yao, Vedant Nimje, Varun Viswanath, Saikat Dutta [Preprint] [Code] Peer-Reviewed: 2025 Faster Runtime Verification during Testing via Feedback-Guided Selective Monitoring 40th International Conference on Automated Software Engineering (ASE 2025) Shinhae Kim, Saikat Dutta, Owolabi Legunsen ACM SIGSOFT Distinguished Paper Award [Paper] [Code] Understanding and Improving Flaky Test Classification ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Application (OOPSLA 2025) Shanto Rahman, Saikat Dutta, August Shi [Paper] [Code] Dolphin: A Programmable Framework for Scalable Neurosymbolic Learning Forty-Second International Conference on Machine Learning (ICML 2025) Aaditya Naik, Jason Liu, Claire Wang, Saikat Dutta, Mayur Naik, Eric Wong [Paper] [Code] LLM-Assisted Static Analysis for Detecting Security Vulnerabilities The Thirteenth International Conference on Learning Representations (ICLR 2025) Ziyang Li, Saikat Dutta, Mayur Naik [Paper] [Dataset] [Code] AURA: Precise Abstract Interpretation of Probabilistic Programs with Interval Data Uncertainty 32nd International Static Analysis Symposium (SAS 2025) Zixin Huang, Jacob Laurel, Saikat Dutta, Sasa Misailovic [Paper] [Code] Understanding the Effectiveness of Large Language Models in Detecting Security Vulnerabilities 18th IEEE International Conference on Software Testing, Verification and Validation (ICST 2025) Avishree Khare, Saikat Dutta, Ziyang Li, Alaia Solko-Breslin, Rajeev Alur, Mayur Naik [Paper] [Code] BugsInDLLs : A Database of Reproducible Bugs in Deep Learning Libraries to Enable Systematic Evaluation of Testing Techniques International Symposium on Software Testing and Analysis (ISSTA Tool Demo 2025) M M Abid Naziri, Aman Kumar Singh, Benjamin Wu, Feiran (Alex) Qin, Saikat Dutta, and Marcelo d'Amorim [Paper] [Code] [Data Artifact] CoCoNUT: Structural Code Understanding does not fall out of a tree 2nd International Workshop on Large Language Models for Code (LLM4Code 2025) Claas Beger, Saikat Dutta [Paper] [Code] 2024 GlueTest: Testing Code Translation via Language Interoperability 40th International Conference on Software Maintenance and Evolution: New Ideas and Emerging Results (ICSME NIER 2024) Flagstaff, AZ, USA. Acceptance Rate 29% (10/35 papers) Muhammad Salman Abid, Mrigank Pawagi, Sugam Adhikari, Xuyan Cheng, Ryed Badr, Md Wahiduzzaman, Vedant Rathi, Ronghui Qi, Choiyin Li, Lu-Chi Liu, Rohit Sai Naidu, Licheng Lin, Que Liu, Asif Zubayer Palak, Mehzabin Haque, Xinyu Chen, Darko Marinov, and Saikat Dutta [Paper] [Code] Debugging Convergence Problems in Probabilistic Programs via Program Re",
  "content_length": 15404,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:32"
}