{
  "name": "Sainyam Galhotra",
  "homepage": "http://sainyamgalhotra.com",
  "status": "success",
  "content": "Sainyam GalhotraSearchSainyam GalhotraAssistant ProfessorCornell UniversitySainyam GalhotraI am an assistant professor in Computer Science at Cornell University. Before that, I was a Computing Innovation Fellow pursuing postdoctoral research at the University of Chicago. The goal of my research is to develop data science tools for effective and responsible analytics.My work has leveraged techniques from causal inference, data management, theoretical computer science, ML and HCI to understand various aspects of trustworthy system design including robustness, explainability, and fairness. I received my Ph.D. from University of Massachusetts Amherst under the supervision of Barna Saha. I completed my undergraduate studies from Indian Institute of Technology Delhi (IIT Delhi) in May, 2014 under the guidance of Prof. Amitabha Bagchi. Prior to joining UMass, I worked as a budding scientist at Xerox Research Centre India, Bangalore for a year.I am actively looking for students to work with me. If you are interested, please complete an application here and email me sg@cs.cornell.edu.InterestsDatabasesData ManagementResponsible Data ScienceCausal InferenceMachine LearningEducationPostdocUniversity of ChicagoMS, PhDUniversity of Massachusetts AmherstBTechIndian Institute of Technology DelhiUpdatesRising Star in Data Science at the Data Science Institute, UChicago Oct 2021Computing Innovation Fellowship Award Recipient (by CRA, CCC and NSF) Apr 2021DAAD AInet Fellow Feb 2021ACM SIGMOD Entity Resolution Programming Contest – Top 5 finalist May 2020Most reproducible paper award in SIGMOD 2018 and 2019 Jun 2019First recipient of Krithi Ramamritham Computer Science Scholarship Jun 2019Best paper award in SIGSOFT FSE 2017 May 2017Recent PublicationsQuickly discover relevant content by filtering publications. Donatella Firmani, Sainyam Galhotra, Barna Saha, Divesh Srivastava (2024). Building Taxonomies with Triplet Queries. Proceedings of the 32nd Symposium of Advanced Database Systems, Villasimius, Italy, June 23rd to 26th, 2024.PDF Cite Kevin Dharmawan, Chirag A. Kawediya, Yue Gong, Zaki Indra Yudhistira, Zhiru Zhu, Sainyam Galhotra, Adila Alfa Krisnadhi, Raul Castro Fernandez (2024). Demonstration of Ver: View Discovery in the Wild. Companion of the 2024 International Conference on Management of Data, SIGMOD/PODS 2024, Santiago AA, Chile, June 9-15, 2024.Cite DOI URL Lennart Behme, Sainyam Galhotra, Kaustubh Beedkar, Volker Markl (2024). Fainder: A Fast and Accurate Index for Distribution-Aware Dataset Search. Proc. VLDB Endow..PDF Cite Yash Kurkure, Miles Shamo, Joseph Wiseman, Sainyam Galhotra, Stavros Sintos (2024). Faster Algorithms for Fair Max-Min Diversification in R(^mboxd). Proc. ACM Manag. Data.Cite DOI URL Abolfazl Asudeh, Sainyam Galhotra, Amir Gilad, Babak Salimi, Brit Youngmann (2024). First Workshop on Governance, Understanding and Integration of Data for Effective and Responsible AI (GUIDE-AI). Companion of the 2024 International Conference on Management of Data, SIGMOD/PODS 2024, Santiago AA, Chile, June 9-15, 2024.Cite DOI URL Sainyam Galhotra, Joseph Y. Halpern (2024). Intervention and Conditioning in Causal Bayesian Networks. Neurips 2024.Cite DOI URL Yue Gong, Sainyam Galhotra, Raul Castro Fernandez (2024). Nexus: Correlation Discovery over Collections of Spatio-Temporal Tabular Data. 2024 International Conference on Management of Data, SIGMOD/PODS 2024, Santiago AA, Chile, June 9-15, 2024.Cite DOI URL Jiongli Zhu, Sainyam Galhotra, Nazanin Sabri, Babak Salimi (2023). Consistent Range Approximation for Fair Predictive Modeling. PVLDB.PDF Cite DOI Yue Gong, Zhiru Zhu, Sainyam Galhotra, Raul Castro Fernandez (2023). Ver: View Discovery in the Wild. 39th IEEE International Conference on Data Engineering, ICDE 2023, Anaheim, CA, USA, April 3-7, 2023.Cite DOI URL Sainyam Galhotra, Arya Mazumdar, Soumyabrata Pal, Barna Saha (2023). Community Recovery in the Geometric Block Model. J. Mach. Learn. Res..Cite URL Jiongli Zhu, Sainyam Galhotra, Nazanin Sabri, Babak Salimi (2023). Consistent Range Approximation for Fair Predictive Modeling. Proc. VLDB Endow..PDF Cite DOI Fangzhu Shen, Kayvon Heravi, Oscar Gomez, Sainyam Galhotra, Amir Gilad, Sudeepa Roy, Babak Salimi (2023). Causal What-If and How-To Analysis Using HypeR. 39th IEEE International Conference on Data Engineering, ICDE 2023, Anaheim, CA, USA, April 3-7, 2023.Cite DOI URL Sainyam Galhotra, Yue Gong, Raul Castro Fernandez (2023). Metam: Goal-Oriented Data Discovery. 39th IEEE International Conference on Data Engineering, ICDE 2023, Anaheim, CA, USA, April 3-7, 2023*.Cite DOI URL Rajesh Bordawekar, Cinzia Cappiello, Vasilis Efthymiou, Lisa Ehrlinger, Vijay Gadepally, Sainyam Galhotra, Sandra Geisler, Sven Groppe, Le Gruenwald, Alon Y. Halevy, Hazar Harmouch, Oktie Hassanzadeh, Ihab F. Ilyas, Ernesto Jiménez-Ruiz, Sanjay Krishnan, Tirthankar Lahiri, Guoliang Li, Jiaheng Lu, Wolfgang Mauerer, Umar Farooq Minhas, Felix Naumann, M. Tamer Özsu, El Kindi Rezig, Kavitha Srinivas, Michael Stonebraker, Satyanarayana R. Valluri, Maria-Esther Vidal, Haixun Wang, Jiannan Wang, Yingjun Wu, Xun Xue, Mohamed Zaït, Kai Zeng (2023). Joint Proceedings of Workshops at the 49th International Conference on Very Large Data Bases (VLDB 2023), Vancouver, Canada, August 28 - September 1, 2023. CEUR-WS.org.Cite URL Sainyam Galhotra, Udayan Khurana (2022). Automated Relational Data Explanation using External Semantic Knowledge. VLDB.PDF Cite Sainyam Galhotra, Karthikeyan Shanmugam, Prasanna Sattigeri, Kush R. Varshney (2022). Causal Feature Selection for Algorithmic Fairness. SIGMOD ‘22: International Conference on Management of Data, Philadelphia, PA, USA, June 12 - 17, 2022.PDF Cite DOI Sainyam Galhotra, Anna Fariha, Raoni Lourenço, Juliana Freire, Alexandra Meliou, Divesh Srivastava (2022). DataPrism: Exposing Disconnect between Data and Systems. SIGMOD ‘22: International Conference on Management of Data, Philadelphia, PA, USA, June 12 - 17, 2022.PDF Cite DOI Romila Pradhan, Aditya Lahiri, Sainyam Galhotra, Babak Salimi (2022). Explainable AI: Foundations, Applications, Opportunities for Data Management Research. 38th IEEE International Conference on Data Engineering, ICDE 2022, Kuala Lumpur, Malaysia, May 9-12, 2022.PDF Cite DOI Romila Pradhan, Aditya Lahiri, Sainyam Galhotra, Babak Salimi (2022). Explainable AI: Foundations, Applications, Opportunities for Data Management Research. SIGMOD ‘22: International Conference on Management of Data, Philadelphia, PA, USA, June 12 - 17, 2022.PDF Cite DOI Suman K. Bera, Syamantak Das, Sainyam Galhotra, Sagar Sudhir Kale (2022). Fair k-Center Clustering in MapReduce and Streaming Settings. WWW ‘22: The ACM Web Conference 2022, Virtual Event, Lyon, France, April 25 - 29, 2022.PDF Cite DOI Sainyam Galhotra, Donatella Firmani, Barna Saha, Divesh Srivastava (2022). Hierarchical Entity Resolution using an Oracle. SIGMOD ‘22: International Conference on Management of Data, Philadelphia, PA, USA, June 12 - 17, 2022.PDF Cite DOI Sainyam Galhotra, Amir Gilad, Sudeepa Roy, Babak Salimi (2022). HypeR: Hypothetical Reasoning With What-If and How-To Queries Using a Probabilistic Causal Approach. SIGMOD ‘22: International Conference on Management of Data, Philadelphia, PA, USA, June 12 - 17, 2022.PDF Cite DOI Javen Kennedy, Pranav Subramaniam, Sainyam Galhotra, Raul Castro Fernandez (2022). Revisiting Online Data Markets in 2022: A Seller and Buyer Perspective. SIGMOD Rec..Cite DOI URL Udayan Khurana, Sainyam Galhotra (2021). Semantic Concept Annotation for Tabular Data. CIKM ‘21: The 30th ACM International Conference on Information and Knowledge Management, Virtual Event, Queensland, Australia, November 1 - 5, 2021.PDF Cite DOI Sainyam Galhotra, Donatella Firmani, Barna Saha, Divesh Srivastava (2021). BEER: Blocking for Effective Entity Resolution. SIGMOD ‘21: International Conference on Management of Data, Virtual Event, China, June 20-25, 2021.PDF Cite DOI Paul Y. Wang, Sainyam Galhotra, Romila Pradhan, Babak Salimi (2021). Demonstration of Generating Explanations for Black-Box Algorithms Using Lewis. VLDB.PDF Cite DOI Sainyam Galhotra, Behzad Golshan, Wang-Chiew Tan (2021). Adaptive Rule Discovery for Labeling Text Data. SIGMOD ‘21: International Conference on Management of Data, Virtual Event, China, June 20-25, 2021.PDF Cite DOI Sainyam Galhotra, Romila Pradhan, Babak Salimi (2021). Explaining Black-Box Algorithms Using Probabilistic Contrastive Counterfactuals. SIGMOD ‘21: International Conference on Management of Data, Virtual Event, China, June 20-25, 2021.PDF Cite DOI Raghavendra Addanki, Sainyam Galhotra, Barna Saha (2021). How to Design Robust Algorithms using Noisy Comparison Oracle. Proc. VLDB Endow..PDF Cite DOI Sainyam Galhotra, Karthikeyan Shanmugam, Prasanna Sattigeri, Kush R. Varshney (2021). Interventional Fairness with Indirect Knowledge of Unobserved Protected Attributes. Entropy.PDF Cite DOI Sainyam Galhotra, Sandhya Saisubramanian, Shlomo Zilberstein (2021). Learning to Generate Fair Clusters from Demonstrations. AIES ‘21: AAAI/ACM Conference on AI, Ethics, and Society, Virtual Event, USA, May 19-21, 2021.PDF Cite DOI Sainyam Galhotra, Donatella Firmani, Barna Saha, Divesh Srivastava (2021). Efficient and effective ER with progressive blocking. VLDB J..PDF Cite DOI Sandhya Saisubramanian, Sainyam Galhotra, Shlomo Zilberstein (2020). Balancing the Tradeoff Between Clustering Value and Interpretability. AIES ‘20: AAAI/ACM Conference on AI, Ethics, and Society, New York, NY, USA, February 7-8, 2020.PDF Cite DOI Sainyam Galhotra (2020). Reliable Clustering with Applications to Data Integration. Proceedings of the VLDB 2020 PhD Workshop co-located with the 46th International Conference on Very Large Databases (VLDB 2020), ONLINE, August 31 - September 4, 2020.PDF Cite Sainyam Galhotra, Udayan Khurana (2020). Semantic Search over Structured Data. CIKM ‘20: The 29th ACM International Conference on Information and Knowledge Management,",
  "content_length": 15143,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:31"
}