{
  "name": "Sajin Koroth",
  "homepage": "https://web.uvic.ca/~skoroth",
  "status": "success",
  "content": "index Sajin Koroth's home page About Me I am an assistant professor at the Department of Computer Science, University of Victoria. My research interests are in algorithms and theory. I am particularly interested in circuit and communication complexity and the interplay between these two seemingly different areas. Contact Office Phone: +1-250-472-5737 Office: ECS 530, Faculty of Engineering and Computer Science, 3800 Finnerty Rd, Victoria, BC V8P 5C2 Background Earlier I was a postdoctoral researcher at Simon Fraser University, hosted by Valentine Kabanets and Igor Shinkar. Before that, I was a postdoctoral fellow at the University of Haifa hosted by Or Meir. During this time, I attended the Simons program on Lowerbounds in Computational Complextiy at University of California, Berkeley as a visiting postdoc. I completed my Ph.D. (thesis, joint winner of IBM India Outstanding Ph.D. Thesis Award) from Indian Institute of Technology, Madras under the guidance of Jayalal Sarma. I also did my masters (thesis) from Indian Institute of Technology, Madras under the guidance of Shankar Balachandran. Research Link to Google Scholar , DBLP Upcoming Toward Probabilistic Checking against Non-Signaling Strategies with Constant Locality -- jointly with Mohammad Jahanara and Igor Shinkar Abstract Non-signaling strategies are a generalization of quantum strategies that have been studied in physics over the past three decades. Recently, they have found applications in theoretical computer science, including to proving inapproximability results for linear programming and to constructing protocols for delegating computation. A central tool for these applications is probabilistically checkable proof (PCPs) systems that are sound against non-signaling strategies. In this paper we show, assuming a certain geometrical hypothesis about noise robustness of non-signaling proofs (or, equivalently, about robustness to noise of solutions to the Sherali-Adams linear program), that a slight variant of the parallel repetition of the exponential-length constant-query PCP construction due to Arora et al. (JACM 1998) is sound against non-signaling strategies with constant locality. Our proof relies on the analysis of the linearity test and agreement test (also known as the direct product test) in the non-signaling setting Full version Algorithms and lower bounds for de morgan formulas of low-communication leaf gates -- jointly with Valentine Kabanets, Zhenjian Lu, Dimitrios Myrisiotis, and Igor C. Oliveira Abstract The class \\(FORMULA[s] \\circ \\mathcal{G}\\) consists of Boolean functions computable by size-\\(s\\) de Morgan formulas whose leaves are any Boolean functions from a class \\(\\mathcal{G}\\). We give lower bounds and (SAT, Learning, and PRG) algorithms for \\(FORMULA[n^{1.99}]\\circ \\mathcal{G}\\), for classes \\(\\mathcal{G}\\) of functions with low communication complexity. Let \\(R^{(k)}(\\mathcal{G})\\) be the maximum \\(k\\)-party number-on-forehead randomized communication complexity of a function in \\(\\mathcal{G}\\). Among other results, we show: (1) The Generalized Inner Product function \\(GIP^k_n\\) cannot be computed in \\(FORMULA[s]\\circ \\mathcal{G}\\) on more than \\(1/2+\\varepsilon\\) fraction of inputs for \\[ s = o \\! \\left ( \\frac{n^2}{ \\left(k \\cdot 4^k \\cdot {R}^{(k)}(\\mathcal{G}) \\cdot \\log (n/\\varepsilon) \\cdot \\log (1/\\varepsilon) \\right)^{2}} \\right). \\] This significantly extends the lower bounds against bipartite formulas obtained by [Tal17]. As a corollary, we get an average-case lower bound for \\(GIP^k_n\\) against \\(FORMULA[n^{1.99}]\\circ PTF^{k-1}\\), i.e., sub-quadratic-size de Morgan formulas with degree-\\((k-1)\\) PTF (polynomial threshold function) gates at the bottom. Previously, only sub-linear lower bounds were known [Nis94, Vio15] for circuits with PTF gates. (2) There is a PRG of seed length \\(n/2 + O\\left( \\sqrt{s} \\cdot R^{(2)}(\\mathcal{G}) \\cdot\\log(s/\\varepsilon) \\cdot \\log (1/\\varepsilon) \\right)\\) that \\(\\varepsilon\\)-fools \\(FORMULA[s] \\circ \\mathcal{G}\\). For the special case of \\(FORMULA[s] \\circ LTF\\), i.e., size-\\(s\\) formulas with LTF (linear threshold function) gates at the bottom, we get the better seed length \\(O\\left(n^{1/2}\\cdot s^{1/4}\\cdot \\log(n)\\cdot \\log(n/\\varepsilon)\\right)\\). In particular, this provides the first non-trivial PRG (with seed length \\(o(n)\\)) for intersections of \\(n\\) half-spaces in the regime where \\(\\varepsilon \\leq 1/n\\), complementing a recent result of [OST19]. (3) There exists a randomized \\(2^{n-t}\\)-time \\(\\#\\)SAT algorithm for \\(FORMULA[s] \\circ \\mathcal{G}\\), where \\[ t = \\Omega\\left(\\frac{n}{\\sqrt{s} \\cdot \\log^2(s)\\cdot R^{(2)}(\\mathcal{G})}\\right)^{1/2}. \\] In particular, this implies a nontrivial #SAT algorithm for \\(FORMULA[n^{1.99}]\\circ LTF\\). (4) The Minimum Circuit Size Problem is not in \\(FORMULA[n^{1.99}] \\circ XOR\\); thereby making progress on hardness magnification, in connection with results from [OPS19, CJW19]. On the algorithmic side, we show that the concept class \\(FORMULA[n^{1.99}] \\circ XOR\\) can be PAC-learned in time \\(2^{O(n/\\log n)}\\). Conference version, appeared in CCC 2020 Full version Video, by Dimitrios Myrisiotis, CCC'20 My slides : pdf, keynote Automating cutting planes is NP-hard -- jointly with Mika Göös, Ian Mertz, and Toniann Pitassi Abstract We show that Cutting Planes (CP) proofs are hard to find: Given an unsatisfiable formula F, 1) It is NP-hard to find a CP refutation of F in time polynomial in the length of the shortest such refutation; and 2)unless Gap-Hitting-Set admits a nontrivial algorithm, one cannot find a tree-like CP refutation of F in time polynomial in the length of the shortest such refutation. The first result extends the recent breakthrough of Atserias and Müller (FOCS 2019) that established an analogous result for Resolution. Our proofs rely on two new lifting theorems: (1) Dag-like lifting for gadgets with many output bits. (2) Tree-like lifting that simulates an r-round protocol with gadgets of query complexity \\(O(logr)\\) independent of input length. Conference version, appeared in STOC 2020 Full version Video, by Ian Mertz, STOC'20 Query-to-communication lifting for BPP using inner product -- jointly with Arkadev Chattopadhyay, Yuval Filmus, Or Meir, Toniann Pitassi Abstract We prove a new query-to-communication lifting for randomized protocols, with inner product as gadget. This allows us to use a much smaller gadget, leading to a more efficient lifting. Prior to this work, such a theorem was known only for deterministic protocols, due to Chattopadhyay et al. and Wu et al.. The only query-to-communication lifting result for randomized protocols, due to G\"o\"os, Pitassi and Watson, used the much larger indexing gadget. Our proof also provides a unified treatment of randomized and deterministic lifting. Most existing proofs of deterministic lifting theorems use a measure of information known as thickness. In contrast, G\"o\"os, Pitassi and Watson used blockwise min-entropy as a measure of information. Our proof uses the blockwise min-entropy framework to prove lifting theorems in both settings in a unified way. Conference version, appeared in ICALP 2019 Full version Video, my own talk at Banff, Slides Improved composition theorems for functions and relations -- jointly with Or Meir Abstract One of the central problems in complexity theory is to prove super-logarithmic depth bounds for circuits computing a problem in \\(\\text{P}\\), i.e., to prove that \\(\\text{P} \\not\\subseteq \\text{NC}^{1}.\\) As an approach for this question, Karchmer, Raz and Wigderson proposed a conjecture called the KRW conjecture, which if true, would imply that \\(\\text{P} \\not\\subseteq \\text{NC}^{1}\\). Since proving this conjecture is currently considered an extremely difficult problem, previous works by Edmonds, Impagliazzo, Rudich and Sgall, Håstad and Wigderson and Gavinsky, Meir, Weinstein and Wigderson considered weaker variants of the conjecture. In this work we significantly improve the parameters in these variants, achieving almost tight lower bounds. Conference version, appeared in Random 2018 Slides : pdf, pptx Characterization and Lower Bounds for Branching Program Size Using Projective Dimension -- jointly with Krishnamoorthy Dinesh and Jayalal Sarma Abstract We study projective dimension, a graph parameter, denoted by \\(\\mathsf{pd}(G)\\) for a bipartite graph \\(G\\), introduced by Pudlák and Rödl. For a Boolean function \\(f\\) (on \\(n\\) bits), Pudl\\'ak and R\"odl associated a bipartite graph \\(G_f\\) and showed that size of the optimal branching program computing \\(f\\), denoted by \\(\\mathsf{bpsize}(f)\\), is at least \\(\\mathsf{pd}(G_f)\\) (also denoted by \\(\\mathsf{pd}(f)\\)). Hence, proving lower bounds for \\(\\mathsf{pd}(f)\\) imply lower bounds for \\(\\mathsf{bpsize}(f)\\). Despite several attempts (Pudlák and Rödl, Rónyai et.al,), proving super-linear lower bounds for projective dimension of explicit families of graphs has remained elusive. We observe that there exist a Boolean function \\(f\\) for which the gap between the \\(\\mathsf{pd}(f)\\) and \\(\\text{bpsize}(f)\\) is \\(2^{\\Omega(n)}\\). Motivated by the argument in Pudlák and Rödl, we define two variants of projective dimension - projective dimension with intersection dimension 1, denoted by \\(\\mathsf{upd}(f)\\), and bitwise decomposable projective dimension, denoted by \\(\\mathsf{bitpdim}(f)\\). We show the following results : We observe that there exist a Boolean function \\(f\\) for which the gap between \\(\\mathsf{upd}(f)\\) and \\(\\text{bpsize}(f)\\) is \\(2^{\\Omega(n)}\\). In contrast, we also show that the bitwise decomposable projective dimension characterizes size of the branching program up to a polynomial factor. That is, there exists a constant \\(c>0\\) and for any function \\(f\\), \\[\\mathsf{bitpdim}(f)/6 \\le \\textrm{bpsize}(f) \\le (\\mathsf{bitpdim}(f))^c\\] We introduce a new candidate family of functions \\(f\\) for showing super-polynomial lower bounds for \\(\\mathsf{bitpdim}(f)\\). As our main r",
  "content_length": 14807,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:38"
}