{
  "name": "Salil P. Vadhan",
  "homepage": "http://www.eecs.harvard.edu/~salil",
  "status": "success",
  "content": "Salil Vadhan | Salil Vadhan Skip to main content arrow_circle_down Salil Vadhan I am a member of Harvard's Theory of Computation research group and also lead Harvard's Privacy Tools Project and co-lead the OpenDP open-source differential privacy software project.  My research areas include computational complexity, cryptography, randomness in computation, and data privacy.This fall I am teaching CS 1200: Introduction to Algorithms and Their Limitations. I typically offer two office hours a week: one via Zoom and one in-person at my office in the Harvard Science and Engineering Complex. My fall semester office hours will be Mondays 4:00-4:45pm (Zoom) and Thursdays 1:00-1:45pm (in-person). Please note that office hours are frequently subject to change; the most accurate times for the upcoming week(s) are listed below. If you need to meet at a time outside of office hours, please contact my faculty coordinator Allison Choat at <achoat@g.harvard.edu>.My 2012 monograph on Pseudorandomness is on my former website.See FAQ with answers to common inquiries (including reference letters, graduate admissions, advising, internal and external service, appointments, and refereeing) and information on contacting me. Upcoming Events There are no published office hours at this time. View Additional Office Hours arrow_circle_right News Teaching CS 1200, \"Algorithms and Their Limitations\", This Fall Semester August 30, 2024 This Fall Asst. Prof. Anurag Anshu and I will co-teach CS 1200, \"Algorithms and Their Limitations\". Course Description: An introductory course in theoretical computer science, aimed at giving students the power of using mathematical abstraction and... CS 229cr: Spectral Graph Theory in Computer Science January 18, 2023 In Spring 2023, I taught CS 229cr: Spectral Graph Theory in Computer Science. See the course website for details. Read More... arrow_circle_right Current Professional Activities Lead PI, Privacy Tools Project and OpenDP: an Open-Source Suite of Differential Privacy Tools.Editor-in-Chief, Foundations and Trends in Theoretical Computer Science.Steering Committee, Symposium on the Foundations of Responsible Computing (FORC).Steering Committee, Theory of Cryptography Conference (TCC).Program Committee, 2nd Symposium on the Foundations of Responsible Computing (FORC 2021).Editor, Computational Complexity.Scientific Board, Electronic Colloquium on Computational Complexity.Executive Committee, Harvard Center for Research on Computation and Society.",
  "content_length": 2500,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:57"
}