{
  "name": "Sally Fincher",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/saf",
  "status": "success",
  "content": "Sally Fincher - School of Computing - University of Kent Jump to content design1 Sally Fincher Emeritus Professor of Computing Education Email s.a.fincher@kent.ac.uk More information Go to google-scholar ORCID iD: 0000-0001-7347-108X On this page About Research interests Professional About I am head of the Computing Education Research Group so unsurprisingly most of my interests focus on the teaching and learning of Computer Science. In 2004, when I was editor of the journal Computer Science Education, I edited the book Computer Science Education Research with Marian Petre. In 2019, together with Anthony Robins I edited the Cambridge Handbook of Computing Education Research. Research interests I belong to the following research groups: Computing Education GroupHowever I am also particularly interested in Patterns and Pattern Languages, especially developing Patterns for HCI. I maintain The Pattern Gallery which tracks the variety of form that HCI patterns take, and co-organised a workshop at CHI 2003 Perspectives on HCI Patterns: Concepts and Tools. At this workshop we worked on a preliminary Pattern Language Markup Language (PLML). Professional Current & Forthcoming (updated March 2019)I am a Chair of CPHC 2018-2020I am a member of the Board of the BCS Academy of ComputingI am Vice-Chair of the UK & Ireland chapter of SIGCSE. We will be hosting the first UK Computing Education Research conference, UKICER, in September.I am leading the School's Makerspace effort. It's very exciting.Long termI am an affiliate researcher to the Crucible network in interdisciplinary designI am proud to be a link in the chain of Suffrage Science. My friend Hannah Dee, and fellow recipient of this award in 2018, de-coded the brooch.I was immensely honoured to be the 2010 recipient of the ACM SIGCSE award for Outstanding Contribution to Computer Science Education with the citation For outstanding contributions to computing education research and inspiring a generation of computing education researchers. Here is a recording of my keynote address to the conference.I was recognised as a Distinguished Scientist by the ACM in 2009.I was invited by the trustees to become a Fellow of the Royal Society of Arts in 2008.I was recognised as Senior Fellow of the Higher Education Academy in 2007.I was made a National Teaching Fellow in 2005. Here are some photos. Here are details of the project I undertook with the award.In November 2004 the Universidad Privada Antenor Orrego, Trujillo, Peru awarded me the title of Honorary ProfessorI was honoured, and humbled, to be the 2003 recipient of the IEEE Computer Society Computer Science & Engineering Undergraduate Teaching Award with the citation \"for sustained contributions to undergraduate computer science education through rigorous examination of teaching effectiveness and fostering and promoting research in computer science education\". Here's a photo of all the 2003/4 award winners.In 2002 I became a Fellow of the Staff and Educational Development Association (SEDA) Last updated 10 June 2021",
  "content_length": 3059,
  "method": "requests",
  "crawl_time": "2025-12-01 14:22:58"
}