{
  "name": "Salvatore Ruggieri",
  "homepage": "http://www.di.unipi.it/~ruggieri",
  "status": "success",
  "content": "Home Page Salvatore Ruggieri Department of Computer Science Home Research: Papers Software KDDLab FINDHR NoBias Enforce Teaching: DSD SDS Salvatore Ruggieri Ph.D. in Computer Science Full Professor at Dipartimento di Informatica, Università di Pisa Coordinator of the National PhD Program in Artificial Intelligence for Society Room: 321/DO Ph.: +39 050 2212782 Office hours: Tuesday 14-16, or by appointment, in person or via Teams Salvatore Ruggieri is full professor at the Computer Science Department of the University of Pisa, Italy, where he teaches at the Master Program in Data Science and Business Informatics and at the National PhD Program in Artificial Intelligence for Society. He holds a Ph.D. in Computer Science (1999), whose thesis has been awarded by the Italian Chapter of EATCS as the best Ph.D. thesis in Theoretical Computer Science. He is senior member of the KDD LAB, a research group spanning from University of Pisa to the National Research Council to Scuola Normale Superiore), with research interests focused in the Artificial Intelligence and Data Science area, including: - algorithmic fairness, - explainable AI, - causality and uncertainty, - knowledge discovery methods and processes, - classification algorithms, and their applications. He is the contact person of the AI and Data Science Lab, which comprises all researchers working on AI and Data Science at the Department of Computer Science. He was co-program chair of the ACM Conference in Fairness, Accountability and Transparency (FAT*2020), Barcelona, Spain, 27-30 January 2020. He was a member of the steering committee of FAccT, of the executive board the Italian Association for Artificial Intelligence (AI*IA), of the Quality Assurance Auditing committee (Nucleo di Valutazione) of the University of Pisa, and the coordinator of the Master Program in Data Science and Business Informatics. He has participated in many scientific projects at national level (PRIN, FIRB) and european level (Horizon Europe, H2020, MSCA-ITN, FP7-FET, FP6-IP, FP6-STReP), as well as in industrial research projects, including FINDHR, FAIR, SoBigData, XAI, NoBias, Tailor, HumanE-AI, ICON, Enforce and others. Doctoral Consortium at the Hybrid Human Artificial Intelligence (HHAI 2025 DC) Pisa, (Italy), 9-13 June 2025 Symposium on Foundations of Responsible Computing (FORC 2024) Cambridge, MA (USA), 12-14 June 2024 Calls for admissions to the National PhD in Artificial IntelligenceDeadline (AI and Society): 7th August 2023 DMKD Special Issue on Bias and Fairness in AI Deadline: August 31st 2021 Explainable Artificiale Intelligence, Workshop at AI*IA 2020 (XAI.it 2020) Anywhere, 25-27 November 2020 Bias and Fairness in AI, Workshop at ECMLPKDD 2020 (BIAS 2020) Ghent (Belgium), 18 September 2020 ACM Conference on Fairness, Accountability and Transparency (FAT* 2020) Barcelona (Spain), 27-30 January 2020 International Symposium on the Future of Education in Information Sciences FEIS 2018 - Pisa, 10-11 September 2018 Intelligenza Artificiale - July 2015 special issue Artificial Intelligence for Society and Economy XIII AI*IA Symposium on Artificial Intelligence AI*IA 2014 - Pisa, 10-12 December 2014 Artificial Intelligence and Law - June 2014 special issue Computational Methods for Enforcing Privacy and Fairness in the Knowledge Society Contact Salvatore Ruggieri Department of Computer Science, University of Pisa Largo B. Pontecorvo 3, 56127 Pisa Tel.: +39 050 2212782 Fax: +39 050 2212726 email: ruggieri@di.unipi.it",
  "content_length": 3510,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:02"
}