{
  "name": "Sam Kumar",
  "homepage": "https://www.samkumar.org",
  "status": "success",
  "content": "Sam Kumar Sam Kumar Assistant Professor Computer Science Department University of California, Los Angeles Office: 496B Engineering VI E-mail: samkumar [at] cs [dot] ucla [dot] edu GitHub: @samkumar I am an Assistant Professor in the Computer Science Department at UCLA. My research interests are in System Security and Networked Systems. Prior to joining UCLA, I spent a year as a postdoctoral scholar in the FOCI Center at the University of Washington, supervised by Arvind Krishnamurthy and Ratul Mahajan. Before that, I received my Ph.D. in Computer Science in the EECS Department at UC Berkeley. I was fortunate to be co-advised by David E. Culler and Raluca Ada Popa. During my Ph.D., I worked in the Sky Computing Lab, the RISE Lab (the predecessor to the Sky Computing Lab), and the Buildings, Energy, and Transportation Systems (BETS) research group. Prior to that, I received my B.S. in Electrical Engineering and Computer Sciences at UC Berkeley. As an undergraduate student, I worked in the Software-Defined Buildings (SDB) research group, which was the predecessor to BETS. Teaching At UCLA: Instructor for CS 111: Operating Systems Principles, Fall 2025 Instructor for CS 111: Operating Systems Principles, Spring 2025 Instructor for CS 239: Efficient Cryptography-Based Systems, Fall 2024 As a graduate student at UC Berkeley: Instructor for CS 162: Operating Systems and System Programming, Summer 2020 Head GSI (Head Teaching Assistant) for CS 162: Operating Systems and System Programming, Fall 2019 Service Program committee member, IEEE S&P 2026 Program committee member, NSDI 2026 External review committee member, ASPLOS 2026 MS admissions committee member, UCLA Computer Science (2024-2025) Program committee member, NSDI 2025 Co-author of the revised UC Berkeley EECS Operating Systems Preliminary Exam Syllabus (2023) Organized an effort, among PhD students, to revise the syllabus. It had last been revised in 2005 (18 years prior). Co-organizer of the Systems Reading Group, UC Berkeley EECS (2021-2022) Creator and organizer of the DARE Research Workshop, UC Berkeley EECS (2021) Graduate admissions reader, UC Berkeley EECS (2018-2019) Subreviewer for SOSP 2023, SOSP 2021, S&P 2020, SOSP 2019, NSDI 2019, and OSDI 2018 Publications 2025 Rethinking RPC Communication for Microservices-based Applications. Xiangfeng Zhu, Yang Zhou, Yuyao Wang, Xiangyu Gao, Arvind Krishnamurthy, Sam Kumar, Ratul Mahajan, and Danyang Zhuo. ACM SIGOPS 20th Workshop on Hot Topics in Operating Systems (HotOS XX). High-level Programming for Application Networks. Xiangfeng Zhu, Yuyao Wang, Banruo Liu, Yongtong Wu, Nikola Bojanic, Jingrong Chen, Gilbert Louis Bernstein, Arvind Krishnamurthy, Sam Kumar, Ratul Mahajan, and Danyang Zhuo. 22nd USENIX Symposium on Networked Systems Design and Implementation (NSDI 2025). 2023 Rethinking System Design for Expressive Cryptography. Sam Kumar. PhD Dissertation. University of California, Berkeley. Original/official version available on ProQuest and as Technical Report No. UCB/EECS-2023-194. Skyplane: Optimizing Transfer Cost and Throughput Using Cloud-Aware Overlays. Paras Jain, Sam Kumar, Sarah Wooders, Shishir G. Patil, Joseph E. Gonzalez, and Ion Stoica. 20th USENIX Symposium on Networked Systems Design and Implementation (NSDI 2023). 2021 MAGE: Nearly Zero-Cost Virtual Memory for Secure Computation. Sam Kumar, David E. Culler, and Raluca Ada Popa. 15th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2021). Received a Jay Lepreau Best Paper Award at OSDI 2021. 2020 Performant TCP for Low-Power Wireless Networks. Sam Kumar, Michael P Andersen, Hyung-Sin Kim, and David E. Culler. 17th USENIX Symposium on Networked Systems Design and Implementation (NSDI 2020). Received an Applied Networking Research Prize from the IETF/IRTF in 2022. Ghostor: Toward a Secure Data-Sharing System from Decentralized Trust. (*Co-primary authors) *Yuncong Hu, *Sam Kumar, and Raluca Ada Popa. 17th USENIX Symposium on Networked Systems Design and Implementation (NSDI 2020). 2019 JEDI: Many-to-Many End-to-End Encryption and Key Delegation for IoT. Extended Version (published as Technical Report No. arXiv:1905.13369 [cs.CR]). Sam Kumar, Yuncong Hu, Michael P Andersen, Raluca Ada Popa, and David E. Culler. 28th USENIX Security Symposium (USENIX Security 2019). WAVE: A Decentralized Authorization Framework with Transitive Delegation. Michael P Andersen, Sam Kumar, Moustafa AbdelBaky, Gabe Fierro, John Kolb, Hyung-Sin Kim, David E. Culler, and Raluca Ada Popa. 28th USENIX Security Symposium (USENIX Security 2019). Thread/OpenThread: A Compromise in Low-Power Wireless Multihop Network Architecture for the Internet of Things. Hyung-Sin Kim, Sam Kumar, and David E. Culler. IEEE Communications Magazine, Vol. 57, No. 7 (ComMag July 2019). 2018 System Architecture Directions for Post-SoC/32-bit Networked Sensors. Hyung-Sin Kim, Michael P Andersen, Kaifei Chen, Sam Kumar, William J. Zhao, Kevin Ma, and David E. Culler. 16th ACM Conference on Embedded Networked Sensor Systems (SenSys 2018). Received a Best Paper Runner-Up Award at SenSys 2018. Demo Abstract: Bringing Full-Scale TCP to Low-Power Networks. Sam Kumar, Michael P Andersen, Hyung-Sin Kim, and David E. Culler. 16th ACM Conference on Embedded Networked Sensor Systems (SenSys 2018). 2016 Well-Connected Microzones for Increased Building Efficiency and Occupant Comfort. Michael P Andersen, Gabe Fierro, Sam Kumar, Joyce Kim, Edward A. Arens, Hui Zhang, Paul Raftery, and David E. Culler. 2016 ACEEE Summer Study on Energy Efficiency in Buildings (SSB 2016). 2015 DISTIL: Design and Implementation of a Scalable Synchrophasor Data Processing System. Michael P Andersen, Sam Kumar, Connor Brooks, Alexandra von Meier, and David E. Culler. 2015 IEEE International Conference on Smart Grid Communications (SmartGridComm 2015). Poster Abstract: Well-Connected Microzones for Increased Building Efficiency and Occupant Comfort. Michael P Andersen, Gabe Fierro, Sam Kumar, Michael Chen, Leonard Truong, Joyce Kim, Edward A. Arens, Hui Zhang, Paul Raftery, and David E. Culler. 2nd ACM International Conference on Embedded Systems for Energy-Efficient Built Environments (BuildSys 2015). Projects and Software TCPlp: TCP for Low Power Wireless Networks Published at NSDI 2020 (see above) Relevant GitHub repositories: Adoption in OpenThread, Code for Reproducibility MAGE: Memory-Aware Garbling Engine Published at OSDI 2021 (see above) Relevant GitHub repositories: MAGE System, Scripts for Experiments JEDI: Joining Encryption and Delegation for IoT Published at USENIX Security 2019 (see above) Relevant GitHub repositories: JEDI Cryptography Library, JEDI Prototype Implementation GDPFS: The Global Data Plane File System CS 262A Project Report (Spring 2016) Relevant GitHub repositories: GDPFS Implementation, FIG Tree Library (C), FIG Tree Prototype (Java) Mr. Plotter: The Multiresolution Plotter (Project Page) Project Report (published as Technical Report No. UCB/EECS-2018-85) Relevant GitHub repositories: Mr. Plotter Web Application, Mr. Plotter Desktop Application, Mr. Plotter QML Library",
  "content_length": 7137,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:03"
}