{
  "name": "Sam Lindley",
  "homepage": "https://homepages.inf.ed.ac.uk/slindley",
  "status": "success",
  "content": "Sam Lindley Sam Lindley Sam.Lindley@ed.ac.uk I am a Reader in Programming Language Design and Implementation in the Laboratory for Foundations of Computer Science at the School of Informatics at The University of Edinburgh. I hold a UKRI Future Leaders Fellowship in Effect Handler Oriented Programming. Papers See also DBLP and Google Scholar. Rows and capabilities as modal effects Wenhao Tang, Sam Lindley To appear at POPL 2026. An equational axiomatization of dynamic threads via algebraic effects Ohad Kammar, Jack Liell-Cock, Sam Lindley, Cristina Matache, Sam Staton To appear at POPL 2026. Encoding product types Sam Lindley In the proceedings of OlivierFest 2025. First-order Laziness Anton Lorenzen, Daan Leijen, Wouter Swierstra, Sam Lindley In the proceedings of ICFP 2025. Modal effect types Wenhao Tang, Leo White, Stephen Dolan, Daniel Hillerström, Sam Lindley, Anton Lorenzen In the proceedings of OOPSLA 2025. Scoped effects, scoped operations, and parameterized algebraic theories Cristina Matache, Sam Lindley, Sean Moss, Sam Staton, Nicolas Wu, and Zhixuan Yang In ACM Transactions on Programming Languages and Systems, May 2025. Effect handlers for C via coroutines Mario Alvarez-Picallo, Teodoro Freund, Dan R. Ghica, and Sam Lindley In the proceedings of OOPSLA 2024. Oxidizing OCaml with modal memory management Anton Lorenzen, Leo White, Stephen Dolan, Richard Eisenberg, and Sam Lindley In the proceedings of ICFP 2024. Asymptotic speedup via effect handlers Daniel Hillerström, Sam Lindley, and John Longley In the Journal of Functional Programming (ICFP 2020 special issue) 34:e5, April 2024. Bringing the WebAssembly standard up to speed with SpecTec Dongjun Youn, Wonho Shin, Jaehyun Lee, Sukyoung Ryu, Joachim Breitner, Philippa Gardner, Sam Lindley, Matija Pretnar, Xiaojia Rao, Conrad Watt, and Andreas Rossberg In the proceedings of PLDI 2024. The functional essence of imperative binary search trees Anton Lorenzen, Daan Leijen, Wouter Swierstra, and Sam Lindley In the proceedings of PLDI 2024. Behavioural types for heterogeneous systems Simon Fowler, Philipp Haller, Roland Kuhn, Sam Lindley, Alceste Scalas, and Vasco T. Vasconcelos In the proceedings of PLACES 2024. Scoped effects as parameterized algebraic theories Sam Lindley, Cristina Matache, Sean Moss, Sam Staton, Nicolas Wu, and Zhixuan Yang In the proceedings of ESOP 2024. Soundly handling linearity Wenhao Tang, Daniel Hillerström, Sam Lindley, and J. Garrett Morris In the proceedings of POPL 2024. Continuing WebAssembly with effect handlers Luna Phipps-Costin, Andreas Rossberg, Arjun Guha, Daan Leijen, Daniel Hillerström, KC Sivaramakrishnan, Matija Pretnar, and Sam Lindley In the proceedings of OOPSLA 2023. Structural subtyping as parametric polymorphism Wenhao Tang, Daniel Hillerström, James McKinna, Michel Steuwer, Ornela Dardha, Rongxiao Fu, and Sam Lindley In the proceedings of OOPSLA 2023. Separating sessions smoothly Simon Fowler, Wen Kokke, Ornela Dardha, Sam Lindley, and J. Garrett Morris In LMCS, Volume 19, Issue 3, July 2023. High-level effect handlers in C++ Dan R. Ghica, Sam Lindley, Marcos Maroñas Bravo, and Maciej Piróg In the proceedings of OOPSLA 2022. Constraint-based type inference for FreezeML Frank Emrich, Jan Stolarak, James Cheney, and Sam Lindley In the proceedings of ICFP 2022. [extended version] A typed slicing compilation of the polymorphic RPC calculus Kwanghoon Choi, James Cheney, Sam Lindley, and Bob Reynders In the proceedings of PPDP 2021. [extended version] Separating sessions smoothly Simon Fowler, Wen Kokke, Ornela Dardha, Sam Lindley, and J. Garrett Morris In the proceedings of CONCUR 2021. Practical normalization by evaluation for EDSLs Nachiappan Valliappan, Alejandro Russo, and Sam Lindley In the proceedings of Haskell 2021. Handler calculus Sam Lindley Extended abstract. Presented at HOPE 2021. The virtues of semi-explicit polymorphism Frank Emrich, Sam Lindley, and Jan Stolarek Extended abstract. Presented at ML 2020. Effects for efficiency: asymptotic speedup with first-class control Daniel Hillerström, Sam Lindley, and John Longley In the proceedings of ICFP 2020. A polymorphic RPC calculus Kwanghoon Choi, James Cheney, Simon Fowler, and Sam Lindley Science of Computer Programming 197:102499, October 2020. Doo bee doo bee doo Lukas Convent, Sam Lindley, Conor McBride, and Craig McLaughlin In the Journal of Functional Programming (special issue on algebraic effects and handlers) 30:e9, March 2020. Effect handlers via generalised continuations Daniel Hillerström, Sam Lindley, and Robert Atkey In the Journal of Functional Programming (special issue on algebraic effects and handlers) 30:e5, March 2020. FreezeML: complete and easy type inference for first-class polymorphism Frank Emrich, Sam Lindley, Jan Stolarek, James Cheney, and Jonathan Coates In the proceedings of PLDI 2020. On the expressive power of user-defined effects: effect handlers, monadic reflection, delimited control Yannick Forster, Ohad Kammar, Sam Lindley, and Matija Pretnar In the Journal of Functional Programming (ICFP 2017 special issue) 29:e15, October 2019. Exceptional asynchronous session types: session types without tiers Simon Fowler, Sam Lindley, J. Garrett Morris, and Sára Decova In the proceedings of POPL 2019. Data Parallel Idealised Algol Robert Atkey, Michel Steuwer, Sam Lindley, and Christophe Dubach Draft, July 2018. Shallow effect handlers Daniel Hillerström and Sam Lindley In the proceedings of APLAS 2018. Continuation passing style for effect handlers Daniel Hillerström, Sam Lindley, Robert Atkey, and KC Sivaramakrishnan In the proceedings of FSCD 2017. On the expressive power of user-defined effects: effect handlers, monadic reflection, delimited control Yannick Forster, Ohad Kammar, Sam Lindley, and Matija Pretnar In the proceedings of ICFP 2017. Lightweight functional session types Sam Lindley and J. Garrett Morris In Behavioural types: from theory to tools. June 2017. Mixing metaphors: actors as channels and channels as actors Simon Fowler, Sam Lindley, and Philip Wadler In the proceedings of ECOOP 2017. Do be do be do Sam Lindley, Conor McBride, and Craig McLaughlin In the proceedings of POPL 2017. Embedding session types in Haskell Sam Lindley and J. Garrett Morris In the proceedings of Haskell 2016. Liberating effects with rows and handlers Daniel Hillerström and Sam Lindley In the proceedings of TyDe 2016. Coherence generalises duality: a logical explanation of multiparty session types Marco Carbone, Sam Lindley, Fabrizio Montesi, Carsten Schürmann, and Philip Wadler In the proceedings of CONCUR 2016. Talking bananas: structural recursion for session types Sam Lindley and J. Garrett Morris In the proceedings of ICFP 2016. Conflation confers concurrency Robert Atkey, Sam Lindley, and J. Garrett Morris In the proceedings of WF 2016. Everything old is new again: Quoted Domain Specific Languages Shayan Najd, Sam Lindley, Josef Svenningsson, and Philip Wadler In the proceedings of PEPM 2016. Generating performance portable code using rewrite rules: from high-level functional expressions to high-performance OpenCL code Michel Steuwer, Christian Fensch, Sam Lindley, and Christophe Dubach In the proceedings of ICFP 2015. A semantics for propositions as sessions Sam Lindley and J. Garrett Morris In the proceedings of ESOP 2015. Algebraic effects and effect handlers for idioms and arrows Sam Lindley In the proceedings of WGP 2014. Query shredding: efficient relational evaluation of queries over nested multisets James Cheney, Sam Lindley, and Philip Wadler In the proceedings of SIGMOD 2014. Sessions as propositions Sam Lindley and J. Garrett Morris In the proceedings of PLACES 2014. Effective quotation James Cheney, Sam Lindley, Gabriel Radanne, and Philip Wadler In the proceedings of PEPM 2014. Hasochism: the pleasure and pain of dependently typed Haskell programming Sam Lindley and Conor McBride In the proceedings of Haskell 2013. Handlers in action Ohad Kammar, Sam Lindley and Nicolas Oury In the proceedings of ICFP 2013. A practical theory of language-integrated query James Cheney, Sam Lindley, and Philip Wadler In the proceedings of ICFP 2013. Lenses for web data Raghu Rajkumar, Sam Lindley, Nate Foster, and James Cheney In the proceedings of BX 2013. Dr. Formlens, Or: How I Learned to Stop Worrying and Love Monoidal Functors Raghu Rajkumar, Nate Foster, Sam Lindley and James Cheney Draft, June 2012. Embedding F Sam Lindley In the proceedings of WGP 2012. Row-based effect types for database integration Sam Lindley and James Cheney In the proceedings of TLDI 2012. The Database Wiki project: a general-purpose platform for data curation and collaboration Peter Buneman, James, Cheney, Sam Lindley and Heiko Müller In SIGMOD Record 40(3), pages 15-20, September 2011. Using Links to prototype a database wiki James Cheney, Sam Lindley and Heiko Müller In the proceedings of DBPL 2011. DBWiki: a structured wiki for curated data and collaborative data management Peter Buneman, James Cheney, Sam Lindley and Heiko Müller In the proceedings of SIGMOD 2011. The arrow calculus Sam Lindley, Philip Wadler and Jeremy Yallop In the Journal of Functional Programming 20:1, pages 51-69, January 2010. [extended version] Accumulating bindings Sam Lindley In the proceedings of 2009 Workshop on Normalization by Evaluation. Unembedding domain-specific languages Robert Atkey, Sam Lindley, and Jeremy Yallop In the proceedings of Haskell Symposium 2009. ACM Digital Library. The essence of form abstraction Ezra Cooper, Sam Lindley, Philip Wadler and Jeremy Yallop In the proceedings of APLAS 2008. LNCS 5356. Many holes in Hindley-Milner Sam Lindley In the proceedings of ML 2008. ACM Digital Library. Idioms are oblivious, arrows are meticulous, monads are promiscuous. Sam Lindley, Philip Wadler, and Jeremy Yallop In the proceedings of MSFP 2008. ENTCS 229(5). The arrow calculus Sam Lindley, Philip Wadler, and Jeremy Yallop Technical report EDI-INF-RR-1258.",
  "content_length": 12328,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:03"
}