{
  "name": "Sam H. Noh",
  "homepage": "https://next.cs.vt.edu",
  "status": "success",
  "content": "NECSST Lab. – Next-generation Embedded/Computer System Software Technology Skip to content Sam H. Noh ACM Fellow/IEEE FellowDepartment of Computer ScienceCollege of Engineering, Virginia Tech Education Background B.S. Seoul National University (College of Engineering), Seoul, Korea (Computer Engineering) Ph.D. University of Maryland, College Park, Maryland (Computer Science) Short Bio Sam H.(Hyuk) Noh received the BE degree in computer engineering from the Seoul National University, Seoul, Korea, in 1986, and the PhD degree from the Department of Computer Science, University of Maryland, College Park, MD, in 1993. He held a visiting faculty position at the George Washington University, Washington, DC, from 1993 to 1994 before joining Hongik University, Seoul, Korea, where he was a professor in the School of Computer and Information Engineering until the Spring of 2015. During this period, he served as the Chair of the Department of Computer Engineering as well as the Head of the School from September of 2013 through February of 2015. From August 2001 to August 2002, he was also a visiting associate professor with the University of Maryland Institute of Advanced Computer Studies (UMIACS), College Park, MD. Starting from the Fall of 2015 he joined UNIST (Ulsan National Institute of Science and Technology), a young Science and Tech focused national university, where he is a Professor at the Department of Computer Science and Engineering and serves as the inaugural Dean of the Graduate School of Artificial Intelligence in the College of Information and Biotechnology. He also served as the Dean of the School of Electrical and Computer Engineering from January of 2016 through June of 2018. He has served as General Chair, Program Chair, and Program Committee Member on a number of technical conferences and workshops including ACM SOSP, ACM Eurosys, USENIX FAST, USENIX OSDI, IEEE RTAS, USENIX ATC, ACM EMSOFT, USENIX HotStorage, ACM ASPLOS, ACM LCTES, IEEE ICPADS, and WWW, among others. He also served on the Steering Committee of LCTES from 2016 through 2020. He is currently the Chair of the Steering Committee for ACM HotStorage and a Steering Committee member of USENIX FAST and IEEE NVMSA. He also served as Editor-in-Chief of the ACM Transactions on Storage​ from 2016 through 2022, and as of April 2024, is serving as co-Editor-in-Chief of the ACM Transactions on Computer Systems. His research interests include system software issues pertaining to computer systems in general and storage systems in particular, with a focus on the use of new memory technologies such as flash memory and persistent memory. He is a Fellow of the ACM and IEEE and a member of USENIX and KIISE (Korean Institute of Information Scientists and Engineers). Join NECSST! We are looking for passionate students. If you are interested in our lab, please fill this form. Recent News Professor Noh recognized as Distinguished Reviewer for ASPLOS 2024May 7, 2024https://www.asplos-conference.org/asplos2024/distinguished-reviewers/ Professor Noh appointed co-Editor-in-Chief of ACM Transactions on Computer Systems (TOCS)April 26, 2024Professor Noh appointed co-Editor-in-Chief (along with Professor Robbert Van Renesse of Cornell) of ACM Transactions … Continue reading \"Professor Noh appointed co-Editor-in-Chief of ACM Transactions on Computer Systems (TOCS)\" Professor Noh serving as PC member for ASPLOS 2025 and Eurosys 2025April 25, 2024Professor Noh serving as PC member for ASPLOS 2025 and Eurosys 2025 Professor Noh serving as Systor 2024 PC Co-ChairJanuary 24, 2024(https://www.systor.org/2024/) – submission deadline is fast approaching. Submit your best work! Welcome Hangyul Kim!January 16, 2024Our new member Hangyul Kim joined our group as a Master’s student! Paper accepted to FAST’24December 14, 2023Our paper titled “MIDAS: Minimizing Write Amplification in Log-Structured Systems through Adaptive Group Number and … Continue reading \"Paper accepted to FAST’24\" Professor Noh serving as PC member for USENIX ATC 2024November 30, 2023(https://www.usenix.org/conference/atc24/) Professor Noh serving as PC member for ACM ASPLOS 2024August 4, 2023(https://www.asplos-conference.org/asplos2024/)",
  "content_length": 4215,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:01"
}