{
  "name": "Sam Westrick",
  "homepage": "https://cs.nyu.edu/~shw8119",
  "status": "success",
  "content": "Sam Westrick Sam Westrick s (dogoodt) we!stricluckk (a!t) nyrobotsu (do!t) ed!u 60 Fifth Ave, Room 308 CIMS Computer Science Department New York University New York, NY I am an assistant professor of computer science in the Courant Institute at New York University, where I lead the ParCour lab and am a member of ACSys. My research focuses on provably efficient and safe implementations of high-level programming languages, especially for parallel programming. The goal is to make it simpler and safer to develop parallel software by providing strong guarantees on not only safety, but also performance. Two examples from my work include (1) provably efficient parallel garbage collection based on disentanglement, and (2) provably efficient automatic granularity control. Previously, I was a post-doc at Carnegie Mellon University, working with Umut Acar. I completed my PhD at Carnegie Mellon in 2022. Check out my blog, and come find me elsewhere on the web: bsky, mastodon, github, twitter. News (Nov 6, 2025) TypeDis: A Type System for Disentanglement is accepted at POPL'26! (Nov 6, 2025) All for One and One for All: Program Logics for Exploiting Internal Determinism in Parallel Programs is accepted at POPL'26! (Oct 22, 2025) I gave a talk at the Simons Institute Managing Parallelism Workshop about our work on automatically controlling parallelism overheads in MaPLe. [video] [slides] (Sep 3, 2025) Local Optimization of Quantum Circuits is a Best Paper at QCE'25! (Dec 12, 2024) I will be giving at tutorial at POPL'25! Come join us on Sun, Jan 19 for a hands-on dive into MPL: Provably Efficient Parallel Programming. Two sessions; three hours total. A short description of the tutorial is available here. (Sep 16, 2024) GraFeyn: Efficient Parallel Sparse Simulation of Quantum Circuits is a Best Paper at QCE'24! (Jan 1, 2024) Automatic Parallelism Management is a Distinguished Paper at POPL'24! (Nov 17, 2023) We have two papers accepted at POPL'24! See paper list below. (June 21, 2023) I am the 2023 recipient of the SIGPLAN Reynolds Doctoral Dissertation Award. MaPLe (MPL) I lead development of MaPLe (MPL for short), an efficient and scalable parallel functional programming language. MaPLe offers excellent multicore performance through a combination of provably efficient parallel garbage collection and automatic granularity control. Across a wide range of parallel algorithms and benchmarks (see our benchmark suite), we have shown that MaPLe can compete with languages such as C/C++ in terms of time and space efficiency. As a functional language, MaPLe makes it easy to avoid data races and unintended race conditions. MaPLe is currently being used at New York University and Carnegie Mellon University to help teach parallel programming to hundreds of students every year. MaPLe is open-source! Check out the project on GitHub or try it out now with Docker: $ docker pull shwestrick/mpl $ docker run -it shwestrick/mpl /bin/bash ...# examples/bin/primes @mpl procs 4 -- Ph.D. Thesis (John C. Reynolds Doctoral Dissertation Award) Efficient and Scalable Parallel Functional Programming Through Disentanglement Sam Westrick. Carnegie Mellon University, August 2022. [pdf] [abstract] [award info] Publications TypeDis: A Type System for Disentanglement Alexandre Moine, Stephanie Balzer, Alex Xu, and Sam Westrick POPL 2026. All for One and One for All: Program Logics for Exploiting Internal Determinism in Parallel Programs Alexandre Moine, Sam Westrick, and Joseph Tassarotti POPL 2026. (Best Paper Award) Local Optimization of Quantum Circuits Jatin Arora, Mingkuan Xu, Sam Westrick, Pengyu Liu, Dantong Li, Yongshan Ding, and Umut A. Acar. QCE 2025. [pdf] (Best Paper Award) GraFeyn: Efficient Parallel Sparse Simulation of Quantum Circuits Sam Westrick, Pengyu Liu, Byeongjee Kang, Colin McDonald, Mike Rainey, Mingkuan Xu, Jatin Arora, Yongshan Ding, and Umut A. Acar. QCE 2024. [pdf] [abstract] (Distinguished Paper) Automatic Parallelism Management Sam Westrick, Matthew Fluet, Mike Rainey, and Umut A. Acar. POPL 2024. [pdf] [abstract] [dl.acm] DisLog: A Separation Logic for Disentanglement Alexandre Moine, Sam Westrick, and Stephanie Balzer. POPL 2024. [pdf] [abstract] [dl.acm] Efficient Parallel Functional Programming with Effects Jatin Arora, Sam Westrick, and Umut A. Acar. PLDI 2023. [pdf] [abstract] [dl.acm] WARDen: Specializing Cache Coherence for High-Level Parallel Languages Michael Wilkins, Sam Westrick, Vijay Kandiah, Alex Bernat, Brian Suchy, Enrico Armenio Deiana, Simone Campanoni, Umut A. Acar, Peter Dinda, and Nikos Hardavellas. CGO 2023. [abstract] [dl.acm] (Distinguished Paper) Entanglement Detection With Near-Zero Cost Sam Westrick, Jatin Arora, and Umut A. Acar. ICFP 2022. [pdf] [abstract] [dl.acm] Parallel Block-Delayed Sequences Sam Westrick, Mike Rainey, Daniel Anderson, and Guy E. Blelloch. PPoPP 2022. [pdf] [abstract] [dl.acm] (Distinguished Paper) Provably Space-Efficient Parallel Functional Programming Jatin Arora, Sam Westrick, and Umut A. Acar. POPL 2021. [pdf] [abstract] [dl.acm] Parallel Batch-Dynamic Trees via Change Propagation Umut A. Acar, Daniel Anderson, Guy E. Blelloch, Laxman Dhulipala, and Sam Westrick. ESA 2020. [pdf] [abstract] [drops.dagstuhl] Disentanglement in Nested-Parallel Programs Sam Westrick, Rohan Yadav, Matthew Fluet, and Umut A. Acar. POPL 2020. [pdf] [abstract] [dl.acm] Fairness in Responsive Parallelism Stefan K. Muller, Sam Westrick, and Umut A. Acar. ICFP 2019. [pdf] [abstract] [dl.acm] Hierarchical Memory Management for Mutable State Adrien Guatto, Sam Westrick, Ram Raghunathan, Umut A. Acar, and Matthew Fluet. PPoPP 2018. [pdf] [abstract] [dl.acm] [arxiv] Brief Announcement: Parallel Dynamic Tree Contraction via Self-Adjusting Computation Umut A. Acar, Vitaly Aksenov, and Sam Westrick. SPAA 2017. [abstract] [dl.acm] Preprints DePa: Simple, Provably Efficient, and Practical Order Maintenance for Task Parallelism Sam Westrick, Larry Wang, and Umut A. Acar. 2022. [abstract] [arxiv] Talks and Presentations Automatic Parallelism Management @ Simons Institute, Managing Parallelism Workshop [video] [slides] MPL: Provably Efficient Parallel Programming (Tutorial) @ POPL, Denver, January 2025 [code] [recording] [slides] GraFeyn: Efficient Parallel Sparse Simulation of Quantum Circuits @ QCE, Montreal, September 2024 [slides] Automatic Parallelism Management @ POPL, London, January 2024 [video] [slides] How to Thrive as a PhD Student @ PLMW, Seattle, September 2023 @ PLMW, Ljubljana, September 2022 [slides] (Keynote) Efficient and Scalable Parallel Functional Programming Through Disentanglement @ ML Workshop, September 2022 [video] [abstract] [slides] Entanglement Detection With Near-Zero Cost @ ICFP, September 2022 [video] [abstract] [slides] Parallel Block-Delayed Sequences @ PPoPP, April 2022 [video] [abstract] [slides] Efficient and Scalable Parallel Functional Programming Through Disentanglement @ Stanford, March 2022 @ Cornell, April 2022 [abstract] [slides] Disentanglement: Provably Efficient Parallel Functional Programming @ MIT Fast Code Seminar, March 2021 [video] [abstract] [slides] Disentanglement in Nested-Parallel Programs @ POPL, January 2020 [video] [abstract] [slides] Efficient Parallel Functional Programming with Hierarchical Memory Management @ RIT, June 2019 [abstract] [slides] Brief Announcement: Parallel Dynamic Tree Contraction via Self-Adjusting Computation @ SPAA, July 2017 [abstract] [slides] Teaching At NYU, I am teaching a new course: CSCI-GA.3033-121 (Special Topic): Programming Parallel Algorithms current semester: F25 past semesters: S25 I was a teaching assistant for the following courses at Carnegie Mellon: 15-210: Parallel and Sequential Data Structures and Algorithms (Semesters S20, S19, F18, S16, F15, S15, F14, S14, F13) 15-122: Principles of Imperative Computation (Summer Sessions N14, M14, N13, M13) Mentoring and Advising I am a SIGPLAN-M mentor. I have also been a mentor and advisor for both undergraduate and graduate-level research: 2025-present: Sundara Vishnu Satish, PhD student 2025-present: Seong-Heon Jung, PhD student 2024-present: Ulysses Butler, PhD student (co-advised with Anirudh Sivaraman) 2025-present: Ed Chen, PhD independent study 2025-present: Darshan Dinesh Kumar, master's independent study and master's thesis 2024-2025: Karan Kumar Gangadhar, master's independent study 2024-2025: Drake Adams, undergraduate research 2019-2020: Lawrence Wang, undergraduate research (CMU) 2018-2019: Rohan Yadav, undergraduate thesis (CMU) (now PhD candidate at Stanford) 2018-2020: Yue Yao, master's thesis (CMU) (now PhD student at CMU) 2018: Yifan Qiao, CMU Summer research intern (now post-doc at UC Berkeley) Professional Service ICFP Publicity Chair 2024-Present ICFP 2026: program committee member POPL 2026: invited external reviewer PADL 2026: program committee member ML Family Workshop (@ICFP/SPLASH) 2025: program chair PLDI 2025: program committee member SPAA 2025: PL area chair and program committee member ASPLOS 2025: program committee member POPL SRC 2025: selection committee member PADL 2025: program committee member TQC: reviewer (2024) TOPC: reviewer (2024) ML Family Workshop (@ICFP) 2024: program committee member SPAA 2024: invited external reviewer PLDI 2024: artifact evaluation committee member PLMW (@POPL) 2024: panelist FHPNC Workshop (@ICFP) 2023: co-chair SC 2023: invited external reviewer PLDI 2023: artifact evaluation committee member PLDI 2023: invited external reviewer Collaborators I'm fortunate to have worked with all sorts of incredible people, including Umut Acar, Guy Blelloch, Matthew Fluet, Stefan Muller, Stephanie Balzer, Daniel Anderson, Laxman Dhulipala, Mike Rainey, Rohan Yadav, Jatin Arora, Ram Raghunathan, Adrien Guatto, Yue Yao, Lawrence Wang, Yue Niu, Peter Dinda, Nikos Hardavellas, Simone Campanoni, Mike Wilkins, Brian Suchy, Enrico Deiana, Pascal Costanza, Alexandre Moine, Yongshan Ding, Dantong Li, Sanil Rao, Troels Henriksen, C",
  "content_length": 10774,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:05"
}