{
  "name": "Samar Agnihotri",
  "homepage": "http://faculty.iitmandi.ac.in/~samar",
  "status": "success",
  "content": "Samar Agnihotri I am with the School of Computing and Electrical Engineering at Indian Institute of Technology Mandi. Contact Tel: +91-1905-267-107 Email: firstname AT iitmandi DOT ac DOT in Research Areas Information Theory, Wireless Communications and Networks, Computational and Communication Complexity, Machine learning Research Interests Learning based compression, Federated learning, Language models, Distributed compression and computation, Secure communication and computation, Relay networks Publications Research Group Current Members: Shubhrajyoti Mohapatra, Ph.D. Mohd. Saif Ali Khan, Ph.D. Akshay S. Vidhate, Ph.D. (jointly with Dr. Pradeep Kumar) Anika Shrivastava, M.S.(research) Alumni: Ritwik Ghoshal, M.S.(research) Thesis: Analysis and enhancement of the lossless mode of WebP Govind Rajendran, M.S.(research) Thesis: Deterministic scheduling over Wi-Fi 6: A Target Wake Time approach Monika Sharma, Ph.D. (jointly with Prof. Bharat S. Rajpurohit) Thesis: Modelling and control of voltage source converter based shunt active power filter for power quality improvement in emerging electric power systems Archana Sharma, Ph.D. (jointly with Prof. Bharat S. Rajpurohit) Thesis: Investigation of power quality in power distribution systems Ajay Bhardwaj, Ph.D. Thesis: Device-to-device multicast in underlay cellaular networks Tulika Agrawal, M.S.(research) Thesis: Secure analog network coding in presence of a single eavesdropper Teaching I am teaching the following courses in the academic year 2025-26: MA552: Number Theory and Cryptography (Fall 2025) DS411: Optimization for Data Science (Spring 2026) CS525: Computational Foundations of Cryptography (Spring 2026) Previously, I have taught the following courses: Signals, Information, and Learning (Mathematical Foundations of Data Science) (Fall 2018) CS208: Mathematical Foundations of CS (Fall 2018, Fall 2019, Fall 2020, Fall 2021) CS304: Formal Languages and Automata Theory (Fall 2015, Fall 2017) CS513: Discrete Mathematics (Fall 2021, Fall 2022, Fall 2023) DS401: Optimization for Data Science (Spring 2022) EE304: Communication Theory (Spring 2013, Fall 2013, Fall 2014) EE503: Advanced Communication Theory (Fall 2013, Spring 2017, Fall 2018) EE517: Wireless Communications and Networking (Spring 2016, Spring 2020) EE518: Information Theory (Spring 2021) EE530: Applied Optimization (Spring 2021, Spring 2022, Spring 2023) EE531: Estimation and Detection Theory (Spring 2018, Spring 2019, Spring 2020) EE605: Information Theory (Fall 2012) EE609: Network Information Theory (Spring 2013) IC260: Signals and Systems (Spring 2014, Spring 2015, Spring 2016) HS528: Information Technology and Development (Fall 2022) MA651: Optimization Techniques (Spring 2014) PH511: Mathematical Physics (Fall 2016, Fall 2017, Fall 2019) PH521: Electromagnetic Theory (Spring 2017, Spring 2018) Academic Background Ph.D. Electrical Sciences, DESE (formerly CEDT), Indian Institute of Science, 2009 M.Sc.Engg. Electrical Sciences, DESE (formerly CEDT), Indian Institute of Science, 2001 M.Sc. Physics, Department of Physics, Indian Institute of Technology Kanpur, 1998 B.Sc.(Honors) Physics, Sri Venkateswara College, University of Delhi, 1996 .",
  "content_length": 3211,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:07"
}