{
  "name": "Samarjit Chakraborty",
  "homepage": "https://www.cs.unc.edu/~samarjit",
  "status": "success",
  "content": "Samarjit Chakraborty's webpage Samarjit Chakraborty I am with the Computer Science Department of UNC Chapel Hill and a member of the Real-Time Systems Group. My research interests span across real-time, embedded, and cyber-physical systems design. A brief bio and contact information may be found here. News Jul 2023: Research Panel at DAC 2023: \"Achieving Verifiable Autonomy: Is Design Automation the Golden Key?\" Mar 2023: Special issue on Automotive CPS Safety & Security in the ACM Transactions on Cyber-Physical Systems is now available. Feb 2023: Special session on \"Autonomy-driven Emerging Directions in Software-defined Vehicles\" (with General Motors and Siemens) at DATE 2023 (as part of the Initiative on Autonomous Systems Design) Dec 2022: Special issue on Embedded Systems for Computer Vision in the Leibniz Transactions on Embedded Systems is now available. Aug 2022: Statistical Hypothesis Testing of Controller Implementations under Timing Uncertainties nominated for Best Paper Award at RTCSA 2022 Mar 2022: BMC+Fuzz: Efficient and Effective Test Generation nominated for Best Paper Award at DATE 2022 Feb 2022: Enrico Fraccaroli joins us as a Postdoctoral Researcher from the University of Verona Jan 2022: Smartphone-based Electronic Contact Tracing for COVID-19 featured as the Communications of the ACM cover article Oct 2021: Our Special Issue on Cross-Layer Design of Cyber-Physical Systems in IEEE Design & Test is now available. See introduction to the special issue [pdf] Oct 2021: TECS 2021 Best Paper Award for: Energy Modeling for the Bluetooth Low Energy Protocol. Philipp H. Kindt, Daniel Yunge, Robert Diemer, and Samarjit Chakraborty. ACM Transactions on Embedded Computing Systems, Volume 19, Issue 2, March 2020 Aug 2021: Shengjie Xu and Sharmin Aktar start their PhD Jun 2021: Paper on Smartphone-based Electronic Contact Tracing for COVID-19 accepted to Communications of the ACM May 2021: Submissions are being invited to a Special Issue on Automotive CPS Safety & Security at the ACM Transactions on Cyber-Physical Systems (submission deadline: July 01, 2021, please submit your work) Jan 2021: Nominations are being invited for the 2021 ACM SIGBED Early Career Researcher Award (deadline: March 15, 2021, new procedures for this year). Consider nominating your former PhD students, postdocs, or junior colleagues! Jan 2021: New NSF project on automotive CPS started from Jan 01, 2021 Jan 2021: Session on Predictable Perception in Autonomous Systems at the Special Initiative on Autonomous Systems Design on Fri, Feb 05, at DATE 2021 (Registration is FREE, please attend!) Oct 2020: New paper on neighbor discovery in IEEE TMC Jun 2020: Submissions are being invited to a Special Issue on Embedded Systems for Computer Vision at the Leibniz Transactions on Embedded Systems (deadline: Dec 15, 2020, contact guest editors if extensions are necesaary) May 2020: How Reliable is Smartphone-based Electronic Contact Tracing for COVID-19? Mar 2020: CPS-oriented Modeling and and Control of Traffic Signals Using Adaptive Back Pressure nominated for Best Paper Award at DATE 2020 Jan 2020: Our paper Energy Modeling for the Bluetooth Low Energy Protocol accepted to the ACM Trans. on Embedded Computing Systems (TECS) Jan 2020: Our Special Issue on Transportation Cyber-Physical Systems in ACM Trans. on Cyber-Physical Systems (TCPS) Nov 2019: Nominations are being invited for the 2020 ACM SIGBED Early Career Researcher Award (deadline: January 15, 2020). Consider nominating your former PhD students, postdocs, or junior colleagues! Teaching Fall 2023: Programming Intelligent Physical Systems Fall 2023: COMP 915: Technical Communication in Computer Science (with Jack Snoeyink) Spring 2022: COMP 915: Technical Communication in Computer Science (with Jim Anderson) Fall 2021: Embedded Systems Students Graduate/Postdoc: Clara Hobbs (co-supervised with Jim Anderson) Shengjie Xu Sharmin Aktar Enrico Fraccaroli (postdoc) Projects Automotive Cyber-Physical Systems (funded by NSF) (ongoing) Timing Analysis for Service-Oriented Communication Architectures (General Motors research contract) (ongoing) Selected recent papers (posted here for the purpose of timely dissemination, please respect the ACM and IEEE copyright policies; other publishers might have similar ones) Safety-Aware Implementation of Control Tasks via Scheduling with Period Boosting and Compressing. Shengjie Xu, Bineet Ghosh, Clara Hobbs, P.S. Thiagarajan, Prachi Joshi, and Samarjit Chakraborty. 29th IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA), 2023 Autonomy-driven Emerging Directions in Software-defined Vehicles. Unmesh Bordoloi, Samarjit Chakraborty, Markus Jochim, Prachi Joshi, Arvind Raghuraman, and S. Ramesh. Design, Automation and Test in Europe (DATE), 2023 Timing Predictability for SOME/IP-based Service-oriented Automotive In-vehicle Networks. Enrico Fraccaroli, Prachi Joshi, Shengjie Xu, Khaja Shazzad, Markus Jochim, and Samarjit Chakraborty. Design, Automation and Test in Europe (DATE), 2023 Safety-aware Flexible Schedule Synthesis for Cyber-Physical Systems using Weakly-Hard Constraints. Shengjie Xu, Bineet Ghosh, Clara Hobbs, P.S. Thiagarajan, and Samarjit Chakraborty. 28th Asia and South Pacific Design Automation Conference (ASP-DAC), 2023 Safety Analysis of Embedded Controllers under Implementation Platform Timing Uncertainties. Clara Hobbs, Bineet Ghosh, Shengjie Xu, Parasara Sridhar Duggirala, and Samarjit Chakraborty. 22nd International Conference on Embedded Software (EMSOFT), 2022 (in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems) How Reliable is Smartphone-based Electronic Contact Tracing for COVID-19? Philipp H. Kindt, Trinad Chakraborty, and Samarjit Chakraborty. Communications of the ACM (CACM), 2022 Optimizing BLE-Like Neighbor Discovery. Philipp Kindt, Swaminathan Narayanaswamy, Marco Saur, and Samarjit Chakraborty. IEEE Transactions on Mobile Computing (TMC), 2022 Tool Integration for Automated Synthesis of Distributed Embedded Controllers. Debayan Roy, Licong Zhang, Wanli Chang, Dip Goswami, Birgit Vogel-Heuser, and Samarjit Chakraborty. ACM Transactions on Cyber-Physical Systems (TCPS), 2022 Micro- and Macroscopic Road Traffic Analysis using Drone Image Data. Friedrich Kruber, Eduardo Sánchez Morales, Robin Egolf, Jonas Wurst, Samarjit Chakraborty, and Michael Botsch. Leibniz Transactions on Embedded Systems (LITES), 2022 BMC+Fuzz: Efficient and Effective Test Generation. Ravindra Metta, Raveendra Kumar Medicherla, and Samarjit Chakraborty. Design, Automation and Test in Europe (DATE), 2022 (nominated for Best Paper Award) Process Dynamics-Aware Flexible Manufacturing for Industry 4.0. Michael Balszun, Clara Hobbs, Enrico Fraccaroli, Debayan Roy, Franco Fummi, and Samarjit Chakraborty. 18th IEEE International Conference on Automation Science and Engineering (CASE), 2022 CAN Bus Intrusion Detection based on Auxiliary Classifier GAN and Out-of-Distribution Detection. Qingling Zhao, Mingqiang Chen, Zonghua Gu, Siyu Luan, Haibo Zeng, and Samarjit Chakrabory. ACM Transactions on Embedded Computing Systems (TECS), 2022 Statistical Hypothesis Testing of Controller Implementations under Timing Uncertainties. Bineet Ghosh, Clara Hobbs, Shengjie Xu, Sridhar Duggirala, James H. Anderson, P.S. Thiagarajan, and Samarjit Chakraborty. 28th IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA), 2022 Checking Scheduling-induced Violations of Control Safety Properties. Anand Yeolekar, Ravindra Metta, Clara Hobbs, and Samarjit Chakraborty. 20th International Symposium on Automated Technology for Verification and Analysis (ATVA), 2022 Exploiting Process Dynamics in Multi-Stage Schedule Optimization for Flexible Manufacturing. Michael Balszun, Clara Hobbs, Debayan Roy, Enrico Fraccaroli, and Samarjit Chakraborty. 27th IEEE International Conference on Emerging Technologies and Factory Automation (ETFA), 2022 Mass-deployable Smartphone-based Objective Hearing Screening with Otoacoustic Emissions. Nils Heitmann, Thomas Rosner, and Samarjit Chakraborty. 23rd ACM International Conference on Multimodal Interaction (ICMI), 2021 Cooling by Core-idling: Thermal-aware Thread Scheduling for Mobile Multicore Processors. Srijeeta Maity, Anirban Ghose, Soumyajit Dey, Sangyoung Park, and Samarjit Chakrabarty. 42nd IEEE Real-Time Systems Symposium (RTSS), Work-in-Progress, 2021 Heterogeneous Communication Virtualisation for Distributed Embedded Applications. Thinh Pham, Shanker Shreejith, Sebastian Steinhorst, Suhaib A. Fahmy, and Samarjit Chakraborty. Euromicro Conference on Digital System Design (DSD), 2021 Insert & Save: Energy Optimization in IP Core Integration for FPGA-based Real-time Systems. Martin Geier, Marian Brändle, and Samarjit Chakraborty. 27th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), 2021 Timing Debugging for Cyber-Physical Systems. Debayan Roy, Clara Hobbs, James H. Anderson, Marco Caccamo, and Samarjit Chakraborty. Design, Automation and Test in Europe (DATE), 2021 Perception Computing-Aware Controller Synthesis for Autonomous Systems. Clara Hobbs, Debayan Roy, Parasara Sridhar Duggirala, F. Donelson Smith, Soheil Samii, James H. Anderson, and Samarjit Chakraborty. Design, Automation and Test in Europe (DATE), 2021 Timing-Predictable Vision Processing for Autonomous Systems. Tanya Amert, Michael Balszun, Martin Geier, F. Donelson Smith, James H. Anderson, and Samarjit Chakraborty. Design, Automation and Test in Europe (DATE), 2021 Bounding Perception Neural Network Uncertainty for Safe Control of Autonomous Systems. Zhilu Wang, Chao Huang, Yixuan Wang, Clara Hobbs, Samarjit Chakraborty, and Qi Zhu. Design, Automation and Test in Europe (DATE), 2021 Proactive Feedback for Networked CPS. Sumana Ghosh, Arnab Mondal, Debayan Roy, Philipp H. Kindt, Soumyajit Dey, and Samarjit Chakraborty. 36th ACM/SIGAPP Symposium O",
  "content_length": 14362,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:08"
}