{
  "name": "Samantha Kleinberg",
  "homepage": "http://www.skleinberg.org",
  "status": "success",
  "content": "Samantha Kleinberg Samantha Kleinberg Home Publications Teaching Data Books cv About me I'm the Farber Chair Professor in the Computer Science department at Stevens Institute of Technology. After completing my PhD in Computer Science at NYU, I spent two years as a postdoctoral Computing Innovation Fellow at Columbia University, in the Department of Biomedical Informatics. Before that I was an undergraduate at NYU in Computer Science and Physics, and I more recently spent a year on sabbatical in the psychology department of University College London. I've written an academic book, Causality, Probability, and Time, and another for a wider audience, Why: A Guide To Finding and Using Causes. I'm the editor of Time and Causality Across the Sciences. Health and AI Lab website We are primarily motivated by trying to improve human health, through the development of artificial intelligence methods. Most of these problems come back to the question of why things happen or how they change, so we focus on causal inference and time series data. We look at both clinical data as well as data generated outside of hospitals and aim to support both medical providers and patients in their decision making. Key application areas include stroke and diabetes. We are also working on devices that can automatically measure food intake, using body-worn sensors. Lab members Elena Korshakova (PhD student), Aishat Toye (PhD student), Yiheng Shen (PhD student), Jim Pleuss (PhD student), Bethel Hall (PhD student), Asuman Celik (PhD student), Shreyoshi Ghosh (PhD student), Joy Choi (Researcher). Our mascot is the Honey Badger, for obvious reasons. Recent courses Spring 2023 Health Informatics [CS-544] Fall 2021 Causal Inference [CS-582] Current Funding NSF Smart & Connected Health, III and PAC grants, NIH R01s, NIH U54 project award samantha.kleinberg@stevens.edu (email is my preferred contact method) Lab twitter: @HealthAI_Lab Current Openings We're hiring postdocs and seeking undergrad and grad students. Join us! News September 2024 I was promoted to Full Professor! August 2024 New paper on how physicians judge patients based on their beliefs. More coverage in Medical Economics and full paper. Undark Op-ed on why we should not ask AI to make life or death decisions. January 2024 STAT Op-ed on our obsession with health and fitness tracking and why it may be time for a data diet. May 2023 We are organizing the Heuristics and Causality in the Sciences conference at UCL! April 2023 Two papers accepted to CogSci, examining how beliefs interact with new information and how to assess the utility of causal models. September 2022 New paper using routinely collected ICU data to classify consciousness in neurological ICU patients. Summary of our work, and full article in Neurocritical Care. New paper on where people get their health info in JMIR Form Res.",
  "content_length": 2864,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:07"
}