{
  "name": "Saman A. Zonouz",
  "homepage": "https://sites.google.com/site/samanzonouz4n6",
  "status": "success",
  "content": "Saman ZonouzSearch this siteEmbedded FilesSkip to main contentSkip to navigationSaman ZonouzI am an Associate Professor at Georgia Tech School of Cybersecurity and Privacy (SCP) - Office: Coda E0964B School of Electrical and Computer Engineering (ECE) Director,  Cyber-Physical Systems  Track in GTPEI lead CPSec: Cyber-Physical Systems Security Lab. Detailed CV including the publicationsRecent PC memberships: IEEE S&P'24-25, USENIX Security'24, NDSS'2019-2025, CCS'2022-24, DSN'2020-24, DSN'23, ICCPS'22, ICCPS'20, IEEE S&P'20. I received the Presidential Early Career Award for Scientists and Engineers (PECASE) from the U.S. President in 2019.I received the Early Career Academic Achievement Alumni Award from the Siebel School of Computing and Data Science at the University of Illinois, Urbana-Champaign in 2025.I gave the Plenary Keynote at DOE's Cybersecurity Conference on Resilient Critical Infrastructures to a large (~2,000) audience in 2024. I received the Outstanding Faculty Research Award, Georgia Tech in 2024.Our paper received the Distinguished Paper Award from the ACM Conference on Computer and Communications Security (CCS) in 2024.I received NSF CAREER Award in Cyber-Physical Systems (CPS). Project started in 2015.We won the $65M Georgia Tech-led AI-Manufacturing project - announced by President Biden, 2022. My Cybersecurity of Drones course received Georgia Tech's Teaching Award (Student Recognition of Excellence in Teaching), 2023. See the teaser video here.I have served on the Editorial Board of IEEE Transactions on Smart Grids. Recent work: One Video to Steal Them All: 3D-Printing IP Theft through Optical Side-Channels, CCS 2025.A Sea of Cyber Threats: Maritime Cybersecurity from the Perspective of Mariners, CCS 2025.The Challenges and Opportunities with Cybersecurity Regulations: A Case Study of the US Electric Power Sector, CCS 2025.Release the Hounds! Automated Inference and Empirical Security Evaluation of Field-Deployed PLCs using Active Network Data, CCS 2024.ERACAN: Defending Against a Game-Changing CAN Threat Model, CCS 2024; Distinguished Paper Award.Compromising Industrial Processes using Web-Based Programmable Logic Controller Malware (NDSS 2024 - artifact evals: available, functional, reproduced)GraphMP: Graph Neural Network-based Motion Planning with Efficient Graph Search (NeurIPS 2023)CSTAR: Towards Compact and Structured Deep Neural Networks with Adversarial Robustness (AAAI 2023)Hiding in Plain Sight? On the Efficacy of Power Side Channel-Based Control Flow Monitoring (USENIX Security 2022)Hiding My Real Self! Protecting 3D Printer Intellectual Property Against Optical Side-Channel Attacks (NDSS 2022)Reverse Engineering and Retrofitting Robotic Aerial Vehicle Control Firmware using DisPatch (MobySys 2022)Robot Motion Planning as Video Prediction: A Spatio-Temporal Neural Network-based Motion Planner (IROS 2022)CHIP: CHannel Independence-based Pruning for Compact Neural Networks (NeurIPS 2021)A Trusted Safety Verifier for Process Controller Code (NDSS)Hey, My Malware Knows Physics! Attacking PLCs with Physical Model Aware Rootkit (NDSS)See No Evil, Hear No Evil, Feel No Evil, Print No Evil? Malicious Fill Patterns Detection in Additive Manufacturing (USENIX-Security)Contactless PLC Security Monitoring via EM Emanations (CCS)Bio: Saman Zonouz is an Associate Professor at Georgia Tech in the Schools of Cybersecurity and Privacy (SCP) and Electrical and Computer Engineering (ECE), and the Director of Georgia Tech’s Online Masters of Cybersecurity - Cyber-Physical Systems Track. Saman also directs the Cyber-Physical Security Laboratory (CPSec) which recently hosted a U.S. Congressional visit to demonstrate its research outcomes. His research (supported by over $120M collaboratively) focuses on security and privacy research problems in cyber-physical systems and critical infrastructures including attack detection and response capabilities using techniques from systems security, control theory and artificial intelligence. His research has been awarded by the Presidential Early Career Awards for Scientists and Engineers (PECASE) by the United States President and The White House Office of Science and Technology Policy (OSTP), the National Science Foundation (NSF) CAREER Award in Cyber-Physical Systems (CPS), Significant Research in Cyber Security by the National Security Agency (NSA), Faculty Fellowship Award by the Air Force Office of Scientific Research (AFOSR), Google Hall of Fame Security Award, Provost Research Award, Outstanding Faculty Research Award by the Georgia Tech College of Computing, and Cybersecurity Fellowship by the Georgia Tech College of Engineering. His research group has disclosed several critical zero-day security vulnerabilities with published CVEs in widely used commercial industrial controllers. Saman is currently a Co-PI on President Biden’s American Rescue Plan $65M Georgia AI Manufacturing (GA-AIM) project. Saman was invited to co-chair the NSF CPS PI Meeting as well as the NSF CPS Next Big Challenges Workshop. Saman has received two Georgia Tech Teaching Awards for his courses “Critical Infrastructure Security” and “Cybersecurity of Drones”. Saman has served as the Chair and/or Program Committee member for top conferences (e.g., IEEE S&P, USENIX, CCS, NDSS, DSN, and ICCPS). Saman obtained his Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign. Email: saman.zonouz@gatech.edu Non-professional activities: I train for triathlons; I have completed Escape-to-Miami 2013, ITU San Diego 2014, and Palm Spring HITS Triathlon 2015. Currently, I train for and compete in the USTA Tennis League (Singles), qualifying for the Nationals Competition in Las Vegas in 2018, and was ranked #1 in Atlanta's Ultimate Tennis League (139 players) in 2023. Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 5860,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:04"
}