{
  "name": "Sameer G. Kulkarni",
  "homepage": "https://iitgn.ac.in/faculty/cse/sameer",
  "status": "success",
  "content": "IIT Gandhinagar | Sameer Gundurao Kulkarni IIT Gandhinagar: 17 Years of ExcellenceNews Research A+ A A- A English | हिंदी | Contact Quick Links Research@IITGN IITGN-X Webmail Internal Website (IWS) Competency Development Foundation Institute Management System (IMS) Career Development Services Medical Centre cNARMADA Staff Development Cell (SDC) Reservation Cell Guest House Campus on the Sabarmati Art@IITGN Unnat Bharat Abhiyan List of Holidays NIRF Reports ARIIA Reports Tenders and Auctions Campus Facilities Library Student Affairs Alumni Affairs Scholarships and Financial Aid Internal Complaints Committee IITGN Counseling Service Leadership Development Initiative RTI ISTF Subscribe Sameer Gundurao Kulkarni Faculty Computer Science & Engineering Sameer Gundurao Kulkarni Sameer Gundurao Kulkarni Assistant Professor , Computer Science & Engineering (Jointly with Electrical Engineering department) B.E.: National Institute of Engineering, 2004 M.S.: University of Southern California, 2010 Ph.D.: University of Göttingen, 2018 Email: sameergk -AT- iitgn.ac.in Website : https://sameergk.github.io/ Office: 13/405 E Recent Publications Dhakal, A., Kulkarni, S.G., and Ramakrishnan, K.K. “GSLICE: Controlled Spatial Sharing of the GPUs for a Scalable Inference Platform.”. In Proceedings of the ACM Symposium on Cloud Computing 2020 (SOCC 2020) (To appear) Kulkarni, S.G., Zhang, W., Hwang, J., Rajagopalan, S., Ramakrishnan, K.K., Wood, T., Arumaithurai, M. and Fu, X., 2020. NFVnice: Dynamic Backpressure and Scheduling for NFV Service Chains. IEEE/ACM Transactions on Networking, Volume 28, Issue 2 February 2020. Kulkarni, S.G., Liu, G., Ramakrishnan, K.K., Arumaithurai, M., Wood, T. and Fu, X., 2020. REINFORCE: Achieving Efficient Failure Resiliency for Network Function Virtualization-Based Services. IEEE/ACM Transactions on Networking, volume 28, Issue 2, February 2020. Kulkarni, S.G., Zhang, W., Hwang, J., Rajagopalan, S., Ramakrishnan, K.K., Wood, T., Arumaithurai, M. and Fu, X. (2017). NFVnice: Dynamic Backpressure and Scheduling for NFV Service Chains. In Proceedings of the Conference of the ACM Special Interest Group on Data Communications (SIGCOMM 2017), ACM, pp. 71-84, Los Angeles, USA, August 2017. Kulkarni, S.G., Arumaithurai, M., Ramakrishnan, K.K. and Fu, X. (2017). REARM: Renewable energy based resilient deployment of Virtual Network Functions. In Proceedings of 26th European Conference on Networks and Communications (EuCNC 2017), IEEE, pp. 1-6, Oulu, Finland, June 2017. Tasiopoulos, A., Kulkarni, S.G., Arumaithurai, M., Psaras, I., Ramakrishnan, K.K., Fu, X. and Pavlou, G. (2017). DRENCH: A Semi-Distributed Resource Management Framework for NFV based Service Function Chaining. In Proceedings of IFIP Networking 2017 Conference (IFIP Networking 2017), pp. 1-9, Stockholm, Sweden, June 2017. (Joint First Author) Work Experience Assistant Professor, Indian Institute of Technology Gandhinagar (Apr 2020 to present) Post Doctoral Researcher, University of Riverside, California (Nov 2018 - Feb 2020) Post Doctoral Researcher, University of Göttingen (Jul 2018 - Sep 2018) Marie Curie Early-stage Researcher (EU-ITN Cleansky), University of Göttingen (Mar 2015 - Jul 2018) Engineer Staff – Multimedia Systems, QCT, Qualcomm, San Diego (May 2009 - Feb 2015) Sr. Engineer – Product Research & Design (Embedded Systems), Tata Elxsi, Bangalore (Aug 2004 - Jul 2008) Research Interests ● Network Function Virtualization ● Software Defined Networking ● Cloud Computing ● Power & Performance Optimizations ● Network Security and Data Reliability ● Green Computing ● Virtual Machines & Virtualization ● Embedded and Portable Devices ● Distributed Systems Complete List of Publications",
  "content_length": 3720,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:07"
}