{
  "name": "Samer Lahoud",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/Samer-Lahoud.html",
  "status": "success",
  "content": "Dr. Samer Lahoud - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events I have fellowship opportunities available Dr. Samer Lahoud Associate Professor Connect with me My research cluster: Systems My website I have fellowship opportunities available Faculty of Computer Science Email: sml@dal.ca Mailing Address: Faculty of Computer Science Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Wireless communications Cellular networks Internet of Things Network energy efficiency Education: HDR - Université Paris-Saclay, France (2023) PhD - IMT Atlantique, France (2006) BEng - Saint Joseph University of Beirut, Lebanon (2002) Bio: Samer Lahoud is an Associate Professor in the Faculty of Computer Science at Dalhousie University. His research interests primarily revolve around optimizing radio resource allocation in wireless networks. Samer holds a Ph.D. in computer science and networks from IMT Atlantique, Rennes, and a Habilitation from the University of Paris-Saclay in France. Prior to joining Dalhousie in 2023, he served as an associate professor at the University of Rennes and worked as a researcher at the IRISA laboratory in France since 2007. He also served as a visiting scholar at Saint Joseph University in Beirut, Lebanon, from 2016 to 2022. Additionally, he gained experience as a research engineer at Nokia Bell Labs Europe in 2006-2007. Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 2476,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:09"
}