{
  "name": "Samer Al-Kiswany",
  "homepage": "https://cs.uwaterloo.ca/~alkiswan",
  "status": "success",
  "content": "Samer Al-Kiswany Samer Al-Kiswany Associate Professor David R. Cheriton School of Computer Science University of Waterloo At Waterloo Advanced Systems Lab (WASL) our research interests are in the area of computing systems with a special focus on distributed and operating systems. I am interested in building highly efficient systems by leveraging recent advances in hardware technology and by exploiting domain specific optimizations. My current projects focus on building software-defined storage system for workflow applications, exploring fundamental reliability and scheduling problems in the Linux I/O stack, and exploiting recent advances in software-defined networks and multicore platforms to accelerate storage systems. Research Lab Publications Professional Activities Associate Editor at IEEE Transactions on Parallel and Distributed Systems (TPDS) (2023 - ) PC Member FAST 2025, 2026 Treasurer and Registration chair HotOS 2025 PC Member EuroSys 2023 PC Member SRDS 2022, 2023 PC member HostStorage 2022 PC member FAST 2022 PC member HPDC 2018 - 2023 PC member SOSP 2019 Teaching 2024 Fall: CS 754: Advanced Distributed Systems Previsoue Terms 2024 Winter: CS 454/654: Distributed Systems 2022 Winter: CS 454/654: Distributed Systems 2021 Fall: CS 754: Advanced Distributed Systems 2021 Fall: CS 454/654: Distributed Systems 2020 Fall: CS 754: Advanced Distributed Systems 2019 Fall: CS 754: Advanced Distributed Systems 2019 Fall: CS 454/654: Distributed Systems 2019 Spring: CS 454/654: Distributed Systems 2019 Winter: CS 798: Advanced Distributed Systems 2017 Fall: CS 798: Advanced Distributed Systems 2017 Spring: CS 454/654: Distributed Systems 2017 Winter: CS 798: Advanced Distributed Systems Short Bio I completed my PhD at the Networked Systems Laboratory in the Electrical and Computer Engineering Department at The University of British Columbia, advised by Prof. Matei Ripeanu. During my PhD I completed five internships at Microsoft Research Lab, Microsoft Azure, IBM Research, NEC Lab, and Argonne National Lab. After my PhD I joined the Computer Science Department at the University of Wisconsin - Madison as a postdoc, working with Prof. Andrea Arpaci-Dusseau and Prof. Remzi Arpaci-Dusseau, and the ADSL research group. Nowadays, I am an Associate Professor at the David R. Cheriton School of Computer Science at the University of Waterloo. Contact Information Samer Al-Kiswany David Cheriton School of Computer Science University of Waterloo 200 University Avenue West Waterloo, ON, N2L 3G1 Canada Office: DC 3516 Email:",
  "content_length": 2553,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:09"
}