{
  "name": "Samit Bhattacharya",
  "homepage": "http://www.iitg.ernet.in/samit",
  "status": "success",
  "content": "Dr Samit Bhattacharya Dr Samit Bhattacharya Head, Center for Linguistic Science & Technology Associate Professor, Department of Computer Science & Engineering Indian Institute of Technology, Guwahati For my latest research interests and opportunities,Click Below About Me Teaching Research Publication Professional Activities Sponsored Projects Contact Academic Experience Achievements Academic Ph.D., 2009, Computer Science and Engineering, IIT Kharagpur M.S. (by Research), 2005, Computer Science and Engineering, IIT Kharagpur B. Tech., 2001, Computer Science and Technology, Kalyani Govt. Engineering College, University of Kalyani Experience Associate Professor, Dept. of Computer Science and Engineering, IIT Guwahati (since April, 2016). Assistant Professor, Dept. of Computer Science and Engineering, IIT Guwahati (March, 2009 - March, 2016).; Senior Lecturer, Dept. of Computer Science and Engineering, IIT Guwahati (October 2008 - February, 2009). Junior Project Officer, Communication Empowerment Laboratory, Dept. of Computer Science & Engineering, IIT Kharagpur (July, 2002 - February, 2006). Program Facilitator, School of Information Technology, IIT Kharagpur (September, 2001 - June, 2002). Awards/Honors Visiting scholar, University of Canberra, Australia, 2014 DST Young Scientist Project Award, 2012 Microsoft Outstanding Young Faculty Award, 2010 National Doctoral Fellowship (NDF), All India Council for Technical Education (AICTE), 2006 Sanyog-an AAC system that I developed at IIT Kharagpur had won Da Vinci 2004 award by the Engineering Society of Detroit, Michigan, and The National Multiple Sclerosis Society, Michigan Chapter, USA This website is best viewed in all latest and stable version of modern browsers(Firefox,chrome,safari). Not seeing a Scroll to Top Button? Go to our FAQ page for more info.",
  "content_length": 1830,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:18"
}