{
  "name": "Samir Chatterjee",
  "homepage": "https://www.cgu.edu/people/samir-chatterjee",
  "status": "success",
  "content": "Samir Chatterjee, Fletcher Jones Chair of Technology Design & Management Emailsamir.chatterjee@cgu.edu Websitehttps://scholar.cgu.edu/samir-chatterjee DegreesPhD, Computer Science, University of Central Florida MS, Computer Science, University of Central Florida BE, Electronics and Telecommunications Engineering, Jadavpur University, Calcutta, India Research InterestsDesign science research, Health informatics, Electronics and telecommunication engineering Samir Chatterjee is the Fletcher Jones Chair of Technology Design & Management at CGU’s Center for Information Systems & Technology (CISAT). He is also considered a leading technology designer and strategist for 21st-century health care. His primary research interests are in Machine Learning in Healthcare, Design Science, Persuasive Technologies, Telemedicine and Chronic Disease Management Technologies. He joined CGU in July of 2001. He founded the Network Convergence Laboratory made possible by a grant from the National Science Foundation in 2002. NCL then changed its name to IDEA Labs (Innovations Design Empowerment Applications Laboratory). In May 2015, he was awarded the distinguished lifetime achievement award for contributions to Design Science Research, presented by the AIS design community. In 2017 he was selected as Schoeller Senior Fellow 2017 by Dr. Theo and Friedl Schoeller Research Center for Business and Society in Nuremberg Germany. In August of 2017, Chatterjee was chosen as a recipient of the Mahatma Gandhi Pravasi Samman, an award given by NRI Welfare Society of India in recognition of the high accomplishments of Indians living outside of India. Throughout his career, Chatterjee has had substantial influence on the advancement of technology within the health care industry. He founded the Network Convergence Laboratory (now IDEA Labs), made possible by a grant from the National Science Foundation. He was co-founder and chairman of VoiceCore Technologies Inc., which he formed in 2001. In 2013, he founded DCL Health (Dr. Chatterjee’s Laboratories Health LLC), a wireless health care startup. He works closely with the Venture Capital and entrepreneurial startup community in the Southern California area. Since 2006 he has been an evangelist and champion of design science as a research method in the IS community. He started the successful DESRIST series of conferences, and his book Design Research in Information Systems: Theory & Practice, co-authored by Alan Hevner, is the best-seller in the field. One of his design methodology research (DSR) papers is the third-most cited DSR paper in the IS community. He works closely with his graduate students in the lab; at any given time, the lab has several ongoing projects, with six to eight doctoral students involved in various stages of their dissertations. He has published over 165 peer-reviewed articles in international conferences and journals including Communications of the ACM, IEEE Network, IEEE J. on Selected Areas in Communications, Journal of AIS, Computer Networks, Journal of MIS, Decision Support Systems, Journal of American Medical Informatics Association (JAMIA), Journal of Medical Internet Research (JMIR), Telemedicine & e-Health Journal, Sustainability, Information Systems Frontiers, Computer Communication, IEEE IT Professional, ACM CCR, Communications of AIS, Health Systems etc. He is the Editor-in-Chief of Health Systems journal, a flagship journal of the OR Society. Ken Peffers, Tuure Tuunanen, Marcus A. Rothenberger, and Samir Chatterjee. “A Design Science Research Methodology for Information Systems Research“, Journal of Management Information Systems (JMIS), Vol. 24, No. 3, pp. 45–77, Winter 2007-8. [Most cited IS paper in the last decade] Armin Abazari, S. Chatterjee, and Md. Moniruzzaman, “Understanding Cancer Caregiving and Predicting Burden: An Analytics and Machine Learning Approach”, in Proc. of AMIA 2023, New Orleans, November 11-15, 2023. Riad Alharby and Samir Chatterjee, “An mHealth Assistive System “MyLung” to Empower Patients with Chronic Obstructive Pulmonary Disease”, Published on 19.03.19 in Vol 3, No 1 (2019): Jan-Mar, JMIR Formative Research Olayan Alharbi and Samir Chatterjee, “Design of an Awareness Smartphone Platform Based on Direct and Indirect Persuasion for Energy Conservation,” in Proc. Of DESRIST 2016, St. John, Newfoundland, Canada, May 23–25, 2016. [Received the Best Paper Award] Alan Hevner and Samir Chatterjee, “Design Research in Information Systems: Theory and Practice,” Integrated Series in Information Systems 22. New York: Springer Publisher Inc., 2010. Communications & Networking Cryptography & Computer Security Design Research: Seminar Introduction to Health Informatics Persuasive Technologies",
  "content_length": 4743,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:13"
}