{
  "name": "Samson Abramsky",
  "homepage": "https://www.cs.ox.ac.uk/samson.abramsky",
  "status": "success",
  "content": "Samson Abramsky | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleEmeritus FacultySamson AbramskySamson Abramsky Professor Samson Abramsky FRSEmeritus ProfessorFellow, Wolfson CollegeE: samson.abramsky@cs.ox.ac.ukThemes:QuantumProgramming LanguagesCompleted Projects:more…See Also:Personal web pages with linksInterestsI have worked in a wide range of areas in the semantics and logic of computation, including concurrency, domain theory (especially domain theory in logical form), lambda calculus, semantics of programming languages, and abstract interpretation and program analysis. I have played a leading role in the development of game semantics and its applications to the semantics of programming languages, in interaction categories, and in geometry of interaction, and connections with traced monoidal categories and realizability. More recently, I have become increasingly interested in connections between computer science and other scientific disciplines. I believe that the distinctive methods of computer science, above all compositional semantics and logic, have much to offer across a broad sweep of the physical and biological sciences, and to the modelling of complex systems. In particular, I have worked extensively in the field of quantum information and computation. I have been working on high-level methods for quantum computation and information. I pioneered categorical quantum mechanics with Bob Coecke. More recently, I have been working on a unified sheaf-theoretic approach to non-locality and contextuality. This has led to a number of developments, including a novel classification of mulitpartite entangled states, cohomological characterizations of non-locality and contextuality, a novel characterization of no-signalling involving signed measures (negative probabilities), and a unifying principle for Bell inequalities. There are also striking connections with a number of topics in computer science, including relational database theory, computational complexity and dependence logic. Current work is focussing on contextuality as a resource for quantum advantage. Topics include quantifying contextuality and a resource theory for contextuality, and connections with non-local games giving rise to a quantum monad on relational structures. This is ongoing work, with a number of collaborators past and present including Adam Brandenburger, Lucien Hardy, Shane Mansfield, Rui Soares Barbosa, Ray Lal, Phokion Kolaitis, Georg Gottlob, Kohei Kishida, Nadish de Silva, and Giovanni Caru. BiographySamson Abramsky is an Emeritus Professor in the Department of Computer Science and an Emeritus Fellow of Wolfson College, Oxford University. He is Professor of Computer Science at University College London. He was previously the Christopher Strachey Professor of Computing at the University of Oxford, 2000-2021. He holds MA degrees from Cambridge and Oxford, and a PhD from the University of London. He is a Fellow of the Royal Society (2004), a Fellow of the Royal Society of Edinburgh (2000), a Member of Academia Europaea (1993), and a Fellow of the ACM (2014). His paper ``Domain theory in Logical Form'' won the LiCS Test-of-Time award (a 20-year retrospective) for 1987. The award was presented at LiCS 2007. His paper ``A Fully Abstract Game Semantics for General References'' with Kohei Honda and Guy McCusker won the LiCS Test-of-Time award (a 20-year retrospective) for 1998. The award was presented at LiCS 2018. He was the Clifford Lecturer at Tulane University in 2008. He was awarded the BCS Lovelace Medal in 2013. He received the Alonzo Church Award for Outstanding Contributions to Logic and Computation in 2017. He has played a leading role in the development of game semantics, and its applications to the semantics of programming languages. Other notable contributions include his work on domain theory in logical form, the lazy lambda calculus, strictness analysis, concurrency theory, interaction categories, and geometry of interaction. More recently, he has been working on high-level methods for quantum computation and information. He introduced categorical quantum mechanics with Bob Coecke. He introduced the sheaf-theoretic approach to contextuality and non-locality with Adam Brandenburger, and has contributed extensively to developing a structural theory of contextuality and its applications. Selected PublicationsView AllManage publications Minimum quantum resources for strong non−locality Samson Abramsky‚ Rui Soares Barbosa‚ Giovanni Carù‚ Nadish de Silva‚ Kohei Kishida and Shane Mansfield In Mark M. Wilde, editor, Proceedings of 12th Conference on the Theory of Quantum Computation‚ Communication and Cryptography (TQC 2017). Vol. 73 of Leibniz International Proceedings in Informatics (LIPIcs). Pages 9:1–9:20. Dagstuhl‚ Germany. 2018. Schloss Dagstuhl–Leibniz−Zentrum fuer Informatik. Accepted for communication at 14th International Conference on Quantum Physics and Logic (QPL 2017); E−print: arXiv:1705.09312 [quant−ph] Details about Minimum quantum resources for strong non−locality | BibTeX data for Minimum quantum resources for strong non−locality | DOI (10.4230/LIPIcs.TQC.2017.9) | Link to Minimum quantum resources for strong non−locality A complete characterization of All−versus−Nothing arguments for stabilizer states Samson Abramsky‚ Rui Soares Barbosa‚ Giovanni Carù and Simon Perdrix In Philosophical Transactions of the Royal Society of London A: Mathematical‚ Physical and Engineering Sciences‚ Theme Issue on ‘Second quantum revolution: foundational questions'. Vol. 375. No. 2106. 2017. E−print: arXiv:1705.08459 [quant−ph] Details about A complete characterization of All−versus−Nothing arguments for stabilizer states | BibTeX data for A complete characterization of All−versus−Nothing arguments for stabilizer states | DOI (10.1098/rsta.2016.0385) | Link to A complete characterization of All−versus−Nothing arguments for stabilizer states Contextual fraction as a measure of contextuality Samson Abramsky‚ Rui Soares Barbosa and Shane Mansfield In Physical Review Letters. Vol. 119. No. 050504. 2017. E−print: arXiv:1705.07918 [quant−ph]; Earlier version (“Quantifying contextuality via linear programming”) accepted for communication to 13th International Conference on Quantum Physics and Logic (QPL 2016). Details about Contextual fraction as a measure of contextuality | BibTeX data for Contextual fraction as a measure of contextuality | DOI (10.1103/PhysRevLett.119.050504) | Link to Contextual fraction as a measure of contextuality ActivitiesQuantum GroupCompleted ProjectsInformation Flow: Foundations and Applications to SecurityStructures at the Interface of Physics and Computer ScienceMetacomputationPast StudentsSivert AasnaessMario Alvarez-PicalloGiovanni CarùAmin KaramlouAlex KavvosRobin LorenzAlex MerryThomas PaineKarl PaulssonRoman PriebeNihil ShahCamilo Miguel SignorelliSam SpeightColin StephenJoshua TanNorihiro YamadaWoongseon  YooVladimir ZamdzhievAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 7264,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:18"
}