{
  "name": "Samuel S. Wagstaff Jr.",
  "homepage": "https://www.cs.purdue.edu/people/ssw",
  "status": "success",
  "content": "Samuel S. Wagstaff - Department of Computer Science - Purdue University Skip to content Home People Faculty Samuel S. Wagstaff Faculty & Lecturers Staff Offices Samuel S. Wagstaff, Jr. Before coming to Purdue, Professor Wagstaff taught at the Universities of Rochester, Illinois, and Georgia. He spent a year at the Institute for Advanced Study in Princeton. His research interests are in the areas of cryptography, parallel computation, and analysis of algorithms, especially number theoretic algorithms. He and J. W. Smith of the University of Georgia have built a special processor with parallel capability for factoring large integers. He is… ↓More Joined department: 1983 Research Areas Information Security and Assurance Education BS, Massachusetts Institute of Technology, (1966) PhD, Cornell University, (1970) Before coming to Purdue, Professor Wagstaff taught at the Universities of Rochester, Illinois, and Georgia. He spent a year at the Institute for Advanced Study in Princeton. His research interests are in the areas of cryptography, parallel computation, and analysis of algorithms, especially number theoretic algorithms. He and J. W. Smith of the University of Georgia have built a special processor with parallel capability for factoring large integers. He is the author of Factorizations of bn ± 1, b = 2, 3, 5, 6, 7, 10, 11, 12 up to high powers, Contemporary Mathematics series, v. 22, Third edition, American Mathematical Society, 2002 (with John Brillhart, D. H. Lehmer, J. L. Selfridge and Bryant Tuckerman) (See http://www.ams.org/online_bks/conm22), Cryptanalysis of Number Theoretic Ciphers, CRC Press, 2002, Sums of Squares of Integers, CRC Press, 2005 (with Carlos Moreno), and The Joy of Factoring, American Mathematical Society, 2013. His Erdos number is 1. Selected Publications P.L Montgomery, S. Nahm and S. S. Wagstaff Jr, \"The period of the Bell numbers modulo a prime\", Mathematics of Computation, v. 79 (2010), pages 1793-1800 J. Gower and S. S. Wagstaff Jr, \"Square form factorization\", Mathematics of Computation, v. 77 (2008), pages 551-588 E. Bertino, N. Shang and S. S. Wagstaff, Jr, \"An efficient time-bound hierarchical key management scheme for secure broadcasting\", IEEE Trans. on Dependable and Secure Computing, v. 5, no. 2 (2008), pages 65-70. Contact Info ssw@cs.purdue.edu CONV 3800 Websites My Homepage",
  "content_length": 2362,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:23"
}