{
  "name": "Samuel Staton",
  "homepage": "http://www.cs.ox.ac.uk/people/samuel.staton/main.html",
  "status": "success",
  "content": "Sam Staton Sam Staton Sam Staton Professor of Computer Science Department of Computer Science, University of Oxford Room 421 Wolfson Building, Parks Road Oxford OX1 3QD Senior Research Fellow, Jesus College, Oxford +44 (0)1865 (2)73893 sam.staton at cs.ox.ac.uk Interests: My research is in programming language theory, and I'm also interested in logic and category theory. I've recently been especially interested in two kinds of programming language: Probabilistic programming languages: This is broadly to do with specifying and understanding statistical models using programming languages. I am currently running a ERC Consolidator grant in this area, and we have been given a Facebook research award too. Most recently we were awarded a grant from the ARIA programme Safeguarded AI, called 'Employing Categorical Probability towards Safe AI', as well as an Opportunity Seed, 'SynthStats: GFlowNet-steered probabilistic program synthesis for safer AI'. Our POPL 2023 introduces the LazyPPL library which demonstrates the power of lazy data structures in probabilsitic programming. Quite a bit of my work in semantics of probabilistic programming starts from two key ideas: s-finite kernels as a simple compositional formalism allowing both sampling and observations (ESOP 2017), and quasi-Borel spaces, a new setting for higher order probability theory (LICS 2017). Our PPS 2017 abstract looked at the relationship between exchangeability and program modules which I think is an exciting direction, and we stepped further in ICALP 2018, AHP 2021 and POPL 2024. Quantum computing and programming languages: Mathieu Huot and I found a neat universal property for quantum theory (LICS 2019, QPL 2018) based on my theory of quantum programs (POPL 2015). Earlier, I've worked on contextuality and non-locality with Sander Uijlen (see our ICALP 2015 paper), and on quantum programming languages with Mathys Rennela (see our MFPS 2017/LMCS and 2015 papers and our QPL 2016 paper). My research in this area has been supported by my grant 'Quantum Computation as a Programming Language' (EP/N007387/1) and a current AFOSR grant FA9550-21-1-0038. Aside from these recent interests, I've been involved in various foundational aspects of programming language theory. One key theme has been computational monads and algebraic theories: This line of work stems from the observation that notions of computation can be determined by program equations using techniques from universal algebra. I have presented new algebraic frameworks to analyze program equations for quantum computation (POPL 2015), jumps (LICS 2014), local store and pi-calculus (LICS 2013, FOSSACS 2010 and MFPS 2009) and functional logic programming (FOSSACS 2013). See FOSSACS 2019 for a program logic, and WACT 2014 for a categorical perspective. I've also been involved in game semantics (LICS 2014) and categorical operational semantics (e.g. LICS 2008, LICS 2006, LMCS 2011). Quick biography: I've been in Oxford since March 2015. Since 2020 I've been partly supported by my ERC Consolidator Grant 'Better Languages for Statistics'. Between 2015-2022 I was supported by a Royal Society University Research Fellowship. Before that, I spent time in Nijmegen (NL) on Bart Jacobs' ERC project Quantum Computation, Logic, and Security (2013–14), in Paris on the CHOCO project (2010–11), and in Cambridge as a lecturer (2010–13), on a EPSRC research fellowship (2007–10), as a postdoc (2006–07), a PhD student (with Marcelo Fiore, 2002–06) and an undergraduate. (Jump down for postdocs, PhD students and more CV-related info.) Publications and preprints O. Kammar, J. Liell-Cock, S. Lindley, C. Matache, S. Staton. An equational axiomatization of dynamic threads via algebraic effects. Accepted to POPL 2026. Please contact me for a draft. J. Liell-Cock, Z. Shirazi, S. Staton. The relative monadic metalanguage. Accepted to POPL 2026. Please contact me for a draft. Notes on A causal Markov category with Kolmogorov products. Sean Moss and Sam Staton. [pdf] Z. Ye, L. C. Melo, Y. Kaddar, P. Blunsom, S. Staton, Y. Gal. Uncertainty-Aware Step-wise Verification with Generative Reward Models. Accepted for ICLR 2025 Workshop on Quantifying Uncertainty and Hallucination in Foundation Models. Preprint: arxiv:2502.11250. J. Liell-Cock and S. Staton. Compositional models of imprecise probability. In Proceedings of POPL 2025. Proceedings of the ACM on Programming Languages, Volume 9, Article No.: 54. Preprint: arxiv:2405.09391. doi:10.1145/3704890. Cristina Matache, Sam Lindley, Sean Moss, Sam Staton, Nicolas Wu, Zhixuan Yang. Scoped Effects as Parameterized Algebraic Theories. In Proceedings of ESOP 2024. doi:10.1007/978-3-031-57262-3_1. Extended version: arxiv:2402.03103. Accepted for ACM Transactions of Programming Languages and Systems (TOPLAS), 2025. D. Stein and S. Staton. Probabilistic programming with exact conditions. In Journal of the ACM, Volume 71, Issue 1, Article 2. 2024. arxiv:2312.17141. doi:10.1145/363217. N. Ackerman, C. Freer, Y. Kaddar, J. Karwowski, S. Moss, D. Roy, S. Staton and Hongseok Yang. Probabilistic programming interfaces for random graphs: Markov categories, graphons, and nominal sets. In Proceedings of 50th ACM SIGPLAN Symposium on Principles of Programming Languages (POPL 24). Proceedings of the ACM on Programming Languages, Volume 8, Issue POPL Article No.: 61. Preprint: [pdf]. doi:https://doi.org/10.1145/363290. LICS Distinguished Paper: A. Lew, M. Huot, S. Staton and V. Mansinghka. omega-PAP Spaces: Reasoning Denotationally About Higher-Order, Recursive Probabilistic and Differentiable Programs. In Proceedings of Thirty-Eighth Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2023). doi:10.1109/LICS56636.2023.10175739. Preprint: arxiv:2302.10636. Y. Kaddar, S. Staton. A model of stochastic memoization and name generation in probabilistic programming: categorical semantics via monads on presheaf categories. In Proceedings of 39th Conference on Mathematical Foundations of Programming Semantics (MFPS 2023). Preprint: arxiv:2309.09467. S. Dash, Y. Kaddar, H. Paquet and S. Staton. Affine monads and lazy structures for Bayesian programming. In Proceedings of 50th ACM SIGPLAN Symposium on Principles of Programming Languages (POPL 2023). Proceedings of the ACM on Programming Languages, Volume 7, Article No.: 46, Pages 1338 - 1368. Preprint: arxiv:2212.07250. doi:10.1145/3571239. POPL Distinguished Paper: A. Lew, M. Huot, S. Staton and V. Mansinghka. ADEV: Sound Automatic Differentiation of Expected Values of Probabilistic Programs. In Proceedings of 50th ACM SIGPLAN Symposium on Principles of Programming Languages (POPL 2023). Proceedings of the ACM on Programming Languages, Volume 7, Article No. 5. doi:10.1145/3571198. Preprint: arxiv:2212.06386 Selected for QPL plenary: S. Staton and N. Summers. Quantum de Finetti Theorems as Categorical Limits, and Limits of State Spaces of C*-algebras. To appear in Proceedings of International Conference on Quantum Physics and Logic 2022 (QPL 2022). Preprint: arxiv:2207.05832 C. Matache, S. Moss and S. Staton. Concrete categories and higher-order recursion. In Proceedings of 27th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2022). doi:10.1145/3531130.3533370. arxiv:2205.15917. M. Huot, S. Staton and M. Vákár. Higher order automatic differentiation of higher order functions. In Logical Methods in Computer Science. 2022. doi:10.46298/lmcs-18(1:41)2022. Preprint: arxiv:2101.06757. S. Dash and S. Staton. Monads for measurable queries in probabilistic databases. In proceedings of 37th Conference on Mathematical Foundations of Programming Semantics (MFPS 2021). 2021. doi:10.4204/EPTCS.351.3. Preprint: arxiv:2112.14048. C. Matache, S. Moss and S. Staton. Recursion and Sequentiality in Categories of Sheaves. In Proceedings of 6th International Conference on Formal Structures for Computation and Deduction (FSCD 2021). arxiv:2105.02156. doi:10.4230/LIPIcs.FSCD.2021.25. 2021. LICS Distinguished Paper: D. Stein and S. Staton. Compositional Semantics for Probabilistic Programs with Exact Conditioning. In Proceedings of Thirty-Sixth Annual ACM/IEEE Conference on Logic in Computer Science (LICS 2021). arxiv:2101.11351. doi:10.1109/LICS52264.2021.9470552. 2021. LazyPPL. [github]. 2021 onwards. Selected for spotlight presentation at AIPLANS 2021. Full paper at POPL 2023. P. Jung, J. Lee, S. Staton and H. Yang. A generalization of hierarchical exchangeability on trees to directed acyclic graphs. Annales Henri Lebesgue, vol 4, 2021. Preprint: arxiv:1812.06282. doi:10.5802/ahl.74. Jiho's poster about this journal paper was awarded an Honourable Mention at BNP 2019. B. Vidgen, S. Staton, S. Hale, T. Melham, H. Margetts, O. Kammar, M. Szymczak. Recalibrating classifiers for interpretable abusive content detection. In Proceedings of the Fourth Workshop on Natural Language Processing and Computational Social Science (NLP+CSS 2020). [PDF at AclWeb]. M. Sabok, S. Staton, D. Stein and M. Wolman. Probabilistic programming semantics for name generation. In Proceedings of POPL 2021. Proceedings of the ACM on Programming Languages vol 5. arxiv:2007.08638. doi:10.1145/3434292. S. Dash and S. Staton. A monad for probabilistic point processes. In Proceedings of Applied Category Theory 2020 (ACT 2020). Open access: [pdf]. M. Huot, S. Staton and M. Vákár. Correctness of Automatic Differentiation via diffeologies and categorical gluing. In 23rd International Conference on Foundations of Software Science and Computation Structures (FOSSACS 2020). doi:10.1007/978-3-030-45231-5_17. Preprint: arxiv:2001.02209. B. Jacobs and S. Staton. De Finetti's construction as a categorical limit. In 15th International Workshop on Coalgebraic Methods in Computer Science (CMCS 2020). Preprint: arxiv:2003.01964 M. Rennela and S. Staton. Classical control, quantum circuits and linear logic in enriched category theory. In Logical Methods In Computer Science, March 2020. Preprint arxiv:1711.05159. M. Hu",
  "content_length": 28419,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:23"
}