{
  "name": "Samuel Kadoury",
  "homepage": "https://www.polymtl.ca/expertises/en/kadoury-samuel",
  "status": "success",
  "content": "Kadoury, Samuel | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Kadoury, Samuel Poly Directory Courses Français Directory of Experts Kadoury, Samuel Directory of Experts Back to search results Edit my profileHelp Publications Link(s) Samuel Kadoury B.Ing. (Poly), M.Ing. (McGill), Ph.D. (Montréal), Postdoc (INRIA) Publications Link(s) Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 4262 Fax: (514) 340-5139 Room: M-3418 samuel.kadoury@polymtl.ca Areas of expertise Biomedical technology Computer vision Intelligent systems applications Pattern analysis and machine intelligence Image and video processing Primary sphere of excellence in research Human Health Secondary sphere(s) of excellence in research Modeling and Artificial Intelligence New Frontiers in Information and Communication Technologies Research interests and affiliations Research interests The research interests of professor Kadoury pertain to the development of novel methods and systems in medical imaging related to a broad range of clinical applications, including neurology, cardiovascular interventions, orthopaedics and interventional oncology. These new technologies in image registration (temporal, mono and multimodality), segmentation, organ atlas conception, statistical shape modeling, classification, and minimally invasive treatments are validated through clinical trials, both with adult and paediatric populations. Medical imaging Machine learning Computer vision Pattern recognition and shape modeling Interventional navigation systems Multimodal image fusion Affiliation(s) Institut de génie biomédical, Member Institute for Data Valorization (IVADO), Member Expertise type(s) (NSERC subjects) 1901 Biomedical technology 2603 Computer vision 2604 Intelligent systems applications 2605 Pattern analysis and machine intelligence 2708 Image and video processing Publications Recent publications Journal article Dayan, G., Henique, G., Bahig, H., Nelson, K., Brodeur, C., Christopoulos, A., Filion, É., Nguyen-Tan, P.-F., O'Sullivan, B., Ayad, T., Bissada, É., Tabet, P., Guertin, L., Desîlets, A., Kadoury, S., & Létourneau-Guillon, L. (2025). Artificial Intelligence Model for Imaging-Based Extranodal Extension Detection and Outcome Prediction in Human Papillomavirus−Positive Oropharyngeal Cancer. JAMA Otolaryngology–Head & Neck Surgery. Presented at 67th Annual Meeting of the American Society for Radiation Oncology (ASTRO 2025), San Francisco, CA, USA. Journal article Alley, S., Tonneau, M., Olivié, D., Tempany, C. M., Choyke, P. L., Türkbey, B., van der Heide, U. A., Ellis, R. J., Kadoury, S., Boike, T., Daniel Pennington, J., Frazier, A., Lawton, C. A., Leong, N., Mihai, A., Morgan, S. C., Solanki, A. A., Michalski, J. M., Feng, F. Y., ... Ménard, C. (2025). Assessing Quality and Adherence to PI‐RADSv2.1 Minimum Technical Standards of Prostate MRI in NRG‐GU005. Journal of Magnetic Resonance Imaging, 11 pages. Conference paper Alley, S., Tonneau, M., Olivié, D., Tempany-Afdhal, C. M., Choyke, P. L., Turkbey, B. I., Van Der Heide, U., Ellis, R. J., Boike, T. P., Pennington, D., Frazier, A., Lawton, C. A. F., Leong, N., Mihai, A. M., Morgan, S. C., Solanki, A. A., Michalski, J. M., Feng, F. Y., Sandler, H., ... Kadoury, S. (2025, February). Assessing the impact of a pre-processing pipeline on a tumor localization model in prostate MRI within a large multi-institutional dataset (NRG-GU005) [Paper]. SPIE Medical Imaging, San Diego, CA, USA (3 pages). Journal article Dayan, G., Henique, G., Létourneau-Guillon, L., Nelson, K. M., Brodeur, C., Christopoulos, A., Filion, É., Nguyen, F., O'Sullivan, B., Ayad, T., Bissada, É., Tabet, P., Guertin, L., Desîlets, A., Kadoury, S., & Bahig, H. (2025). Automated Lymph Node Segmentation and iENE Classification Model for HPV-Associated Oropharyngeal Cancer. International Journal of Radiation Oncology*Biology*Physics, 123(1), S195-S196. See all publications (232) Supervision at Polytechnique COMPLETED Ph.D. Thesis (6) Saber, R. (2025). Identification de biomarqueurs non invasifs et multi-omiques pour la stratification pronostique des métastases hépatiques colorectales et du cancer pulmonaire basée sur l'apprentissage automatique [Ph.D. thesis, Polytechnique Montréal]. Alley, S. (2024). Standardization of Multi-Parametric Magnetic Resonance Imaging for the Characterization of Prostate Cancer [Ph.D. thesis, Polytechnique Montréal]. Picot, F. (2022). Sonde Raman multimodale intégrée à une plateforme d'imagerie TRUS-IRM à l'aide d'un capteur électromagnétique pour améliorer le guidage des biopsies de la prostate [Ph.D. thesis, Polytechnique Montréal]. Vazquez Romaguera, L. (2021). Image-Based Analysis and Modelling of Respiratory Motion Using Deep Learning Techniques [Ph.D. thesis, Polytechnique Montréal]. Vorontsov, E. (2020). On Medical Image Segmentation and on Modeling Long Term Dependencies [Ph.D. thesis, Polytechnique Montréal]. Shakeri, M. (2016). Analysis of Sub-Cortical Morphology in Benign Epilepsy with Centrotemporal Spikes [Ph.D. thesis, École Polytechnique de Montréal]. Master's Thesis (17) Henique, G. (2025). Risk Stratification for Adaptive Radiotherapy in Head and Neck Cancers Using Deep Learning Approaches [Master's thesis, Polytechnique Montréal]. Ouraou, E. (2024). Prédiction de survie du cancer du poumon par imagerie 4DCT et réseaux génératifs lors d'un traitement par radiothérapie [Master's thesis, Polytechnique Montréal]. Alefsen de Boisredon d'Assier, M. (2023). Méthodes faiblement supervisées d'apprentissage profond pour la segmentation inter-modalités de tumeurs en imagerie médicale [Master's thesis, Polytechnique Montréal]. Francoeur, J. (2023). Conception d'un capteur optique distribué pour la détection de forme des instruments médicaux en chirurgie minimalement invasive [Master's thesis, Polytechnique Montréal]. Cros, S. (2021). Méthodes d'apprentissage profond 3D en radiothérapie pour la segmentation d'organes et la prédiction de distributions de dose [Master's thesis, Polytechnique Montréal]. Mezheritsky, T. (2021). Modélisation du mouvement tridimensionnel du foie à partir d'images échographiques 2D par auto-encodeurs convolutionnels [Master's thesis, Polytechnique Montréal]. Shakeri, S. (2020). Deformable MRI to Transrectal Ultrasound Registration for Prostate Interventions Using Deep Learning [Master's thesis, Polytechnique Montréal]. Maaref, A. (2019). Prediction of Chemotherapy Response of Liver Metastases from Baseline CT-Images Using Deep Neural Networks [Master's thesis, Polytechnique Montréal]. Oulbacha, R. (2019). Synthèse d'images tomodensitométriques à partir d'IRM par des réseaux adverses génératifs pour le recalage 3D/2D de la colonne vertébrale [Master's thesis, Polytechnique Montréal]. Boucher, M.-A. (2018). Volumétrie des ventricules latéraux chez le nouveau-né par segmentation automatique d'échographies 3D [Master's thesis, École Polytechnique de Montréal]. Jobidon-Lavergne, H. (2018). Intégration de la simulation numérique à la navigation chirurgicale pour le traitement de la scoliose par chirurgie de modulation de croissance sans fusion par attache flexible [Master's thesis, École Polytechnique de Montréal]. Nozadi, S. H. (2017). Classification of Alzheimer's Disease and Mild Cognitive Impairment Using Longitudinal FDG-PET Images [Master's thesis, École Polytechnique de Montréal]. Gérard, M. (2016). Modélisation 3D des artères hépatiques et visualisation par fusion d'imagerie par résonance magnétique et d'imagerie ultrasonore [Master's thesis, École Polytechnique de Montréal]. Mandal, K. K. (2016). Intra-Operative Needle Tracking Using Optical Shape Sensing Technology [Master's thesis, École Polytechnique de Montréal]. Parent, F. (2016). Reconstruction 3D de la forme d'aiguilles chirurgicales en utilisant la réflectométrie fréquentielle dans des fibres optiques [Master's thesis, École Polytechnique de Montréal]. Thong, W. (2015). Apprentissage de représentations pour la classification d'images biomédicales [Master's thesis, École Polytechnique de Montréal]. De Leener, B. (2014). Segmentation automatique de la moelle épinière sur des images de résonance magnétique par propagation de modèles déformables [Master's thesis, École Polytechnique de Montréal]. Awards and honors 2009 - Prize for best Ph.D. thesis - Polytechnique Montreal News about Samuel Kadoury BLOG | March 3, 2022 Cancer & AI working together for treatment | Read NEWS | February 24, 2021 50 Polytechnique Montréal researchers among the top 2% most cited in their respective fields | Read NEWS | October 15, 2018 Four Canada Research Chairs at Polytechnique Montréal are advancing knowledge in several areas | Read NEWS | February 22, 2018 Deep neural networks identifies tumours | Read Press review about Samuel Kadoury May 27, 2024, Savoir Média, La vie continue - Cancer du cerveau | Saison 1 - Épisode 4 Frédéric Leblond et Samuel Kadoury, respectivement professeur au Département de génie physique et professeur au Département de génie informatique et génie logiciel, discute à propos des techniques qu'ils élaborent pour la détection des cellules cancéreuses du cancer du cerveau. February 2, 2024, ICI Nouvelles, Cancers de la région ORL : prédire les effets des traitements avec l'IA Samuel Kadoury, professeur titulaire au Département de génie informatique et géni",
  "content_length": 11967,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:22"
}