{
  "name": "Samuel Horvath",
  "homepage": "https://mbzuai.ac.ae/study/faculty/samuel-horvath",
  "status": "success",
  "content": "Samuel Horváth - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Samuel Horváth Samuel Horváth Assistant Professor of Machine Learning Research Interests Professor Horváth’s research interests lie at the intersection of mathematics, computer science, machine learning, optimization, and statistics, with a particular focus on federated learning. Email Share Prior to joining MBZUAI, Professor Horváth completed his M.Sc. (2018) and Ph.D. (2022) in statistics at King Abdullah University of Science and Technology (KAUST) in Kingdom of Saudi Arabia. He has a relatively rich industrial experience obtained via research internships, including Amazon Scalable Machine Learning, Germany (2019), Samsung AI Centre, United Kingdom (2020), and Facebook AI Research, Canada (2021). Ph.D. in statistics, King Abdullah University of Science and Technology (KAUST), Kingdom of Saudi Arabia Master’s in statistics, King Abdullah University of Science and Technology (KAUST), Kingdom of Saudi Arabia Bachelor (Summa Cum Laude) in mathematics of economics and finance from Comenius University, Slovakia Dean’s list, Academic Excellence Award, KAUST 2022 Al Kindi Statistics Research Student Award, KAUST 2021 Best Poster Award at the Data Science Summer School (DS3), Ecole Polytechnique, France, 2018 Best Paper Award at the NeurIPS 2020 Federated Learning Workshop Best Reviewer Award at NeurIPS 2020 Top Reviewer Award at NeurIPS 2019 “Fedshuffle: Recipes for better use of local work in federated learning”, S Horváth, M Sanjabi, L Xiao, P Richtárik, M Rabbat\" “Adaptivity of Stochastic Gradient Methods for Nonconvex Optimization”, S Horváth, L Lei, P Richtárik, MI Jordan,SIAM Journal on Mathematics of Data Science (SIMODS) “FjORD: Fair and Accurate Federated Learning under heterogeneous targets with Ordered Dropout”, S Horváth, S Laskaridis, M Almeida, I Leontiadis, SI Venieris, ND Lane, 35th Conference on Neural Information Processing Systems (NeurIPS 2021) “A Better Alternative to Error Feedback for Communication-Efficient Distributed Learning”, S Horváth, P Richtárik, International Conference on Learning Representations (ICLR 2021) Google Scholar ResearchGate Personal website Related Saturday, October 04, 2025 MBZUAI celebrates faculty excellence at annual recognition reception Awards were presented to seven faculty members for their exceptional achievements in research, mentorship, community, and beyond. research provost faculty community award impact mentorship service Read more Monday, March 24, 2025 MBZUAI and Berkeley explore the future of machine learning Machine learning pioneer Michael I. Jordan was among the speakers discussing the cutting-edge ideas shaping the field. machine learning research innovation collaborations ML workshop berkeley Read more Wednesday, August 14, 2024 Orchestrated efficiency: A new technique to increase model efficiency during training Presented at ICML 2024, Horváth's new study proposes a framework to efficiently train machine learning models for… machine learning federated learning icml 2024 Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 4709,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:20"
}