{
  "name": "Samuel Fiorini",
  "homepage": "http://homepages.ulb.ac.be/~sfiorini",
  "status": "success",
  "content": "Samuel Fiorini's homepage Contact Samuel Fiorini Université libre de Bruxelles Département de Mathématique Algebra and Combinatorics (CP 216) Boulevard du Triomphe, B-1050 Brussels, Belgium tel: +32 (0) 2 650 58 88, fax: +32 (0) 2 650 58 67 email: <first letter of first name followed by last name>@ulb.ac.be [Top] Selected Publications No Small Linear Program Approximates Vertex Cover within a Factor 2 - epsilon, Abbas Bazzi, Samuel Fiorini, Sebastian Pokutta and Ola Svensson, 56th Annual IEEE Symposium on Foundations of Computer Science (FOCS 2015), Berkeley (CA), USA, 18-20 October 2015 Approximation Limits of Linear Programs (Beyond Hierarchies). Gábor Braun, Samuel Fiorini, Sebastian Pokutta and David Steurer. 53rd Annual IEEE Symposium on Foundations of Computer Science (FOCS 2012), New Brunswick (NJ), USA, 20-23 October 2012 Linear vs. Semidefinite Extended Formulations: Exponential Separation and Strong Lower Bounds. Samuel Fiorini, Serge Massar, Sebastian Pokutta, Hans Raj Tiwary and Ronald de Wolf. 44th ACM Symposium on Theory of Computing (STOC 2012), New-York (NY), USA, 19-22 May 2012. Best Paper Award. The paper was discussed, e.g., here, here, here, here, here, here , here and here. Sorting under Partial Information (without the Ellipsoid Algorithm). Jean Cardinal, Samuel Fiorini, Gwenaël Joret, Raphaël Jungers and Ian Munro. 42nd ACM Symposium on Theory of Computing (STOC 2010), Cambridge (MA), USA, 6--8 June 2010. (Journal version to appear in Combinatorica) An efficient algorithm for partial order production. Jean Cardinal, Samuel Fiorini, Gwenaël Joret, Raphaël Jungers and Ian Munro. 41st ACM Symposium on Theory of Computing (STOC 2009), Bethesda (MD), USA, 31 May--2 June 2009. (Journal version published in SIAM Journal on Computation) Approximate min-max relations for odd cycles in planar graphs. Samuel Fiorini, Nadia Hardy, Bruce Reed and Adrian Vetta. 11th conference on Integer Programming and Combinatorial Optimization (IPCO 2005), Berlin, Germany, 8-10 June 2005. (Journal version published in Mathematical Programming Series B) [Top] Research Interests Polyhedral combinatorics. Extended formulations. Combinatorial optimization. Approximation algorithms. Structural graph theory. [Top] PhD Students and Postdocs Current/past PhD Student(s) Carole Muller (2017-...) Matthew Drescher (2017-...) Marco Macchia (2014-2018) Selim Rexhep (2011-2016) Eglantine Camby (2010-2015) Céline Engelbeen (2006-2010) Current/past Postdocs Manuel Aprile (1/2019-...) Krystal Guo (9/2017-8/2019) Tillman Wiltzow Pierre Aboulker (9/2016-8/2017) Yohann Benchetrit (5/2016-1/2017) Tony Huynh (9/2015-8/2019) Vissarion Fisikopoulos (5/2015-4/2016) Yuri Faenza (9/2014-1/2015) Adam Bohn (9/2014-4/2015) Kanstantsin Pashkovich (9/2013-1/2015) Hans Raj Tiwary (2010-2013) Nikolaus Mutsanas (2011) Ugo Pietropaoli (2009) Dirk Oliver Theis (2007-2009) [Top] Conferences APPPROX 2019 (PC member) ... IPCO 2017 (PC member) WAOA 2016 (PC member) STACS 2016 (PC member) WAOA 2015 (PC member) Sixth Cargese Workshop on Combinatorial Optimization (organizer) [Top] Samuel Fiorini Associate Professor Main Contact Selected Publications Research Interests Students and Postdocs Conferences ERC project Publications Teaching © 2013 S.F. (Template by A.V.)",
  "content_length": 3276,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:20"
}