{
  "name": "Samuel J. Lomonaco Jr.",
  "homepage": "http://www.csee.umbc.edu/~lomonaco",
  "status": "success",
  "content": "Professor Samuel J. Lomonaco : Home Page Samuel J. Lomonaco , Jr. Full Professor: Computer Science & Electrical Engineering , UMBC Ph.D., 1964, Princeton University, Mathematics E-Mail: Lomonaco (AT) umbc (DOT) edu UMBC Covid-19 Support Services Short Biographical Sketch Representative Publications Personal Lecture Notes AMS Lecture Notes PowerPoint Lectures & Slides Knot Theory References Quantum Computation References Quantum Algorithms Research Group Supported by DARPA AMS Short Course on Quantum Computation & Quantum Information To be held at The Annual Meeting of the American Mathematical Society Washington, DC January 3-4, 2009 Schedule 2003 Pot de Vin Award Four Lectures on Quantum Computing given at Oxford University July 2006 2008 Clifford Lectures given at Tulane University March 12-15, 2008 Past Conferences, Workshops, and Special Sessions My Books My AMS Books 2000 Quantum Computation: A Grand Mathematical Challenge for the Twenty-First Century and the Millennium AMS Bookstore 2009 Quantum Information Science and Its Contributions to Mathematics AMS Bookstore 2000 Quantum Computation and Information AMS Bookstore 1983 Low Dimensional Topology AMS Bookstore My Other Books 2007 Mathematics of Quantum Computation and Quantum Technology CRC Bookstore Topological Quantum Information Theory (In Preparation) World Scientific Teaching Schedule My Mother's Paintings For your amusement How to reach me \"My best friend\" My Erdos number is 2 Video: The Non-Abelian Fourier Transform & Quantum Computation Research Interests COMPUTER SCIENCE: Quantum computation, algebraic coding theory, cryptography, numerical computation, symbolic computation, algorithms. MATHEMATICS: Applications of topology to physics, knot theory & 3-manifolds, algebraic & differential topology, differential geometry, Lie groups. AMS",
  "content_length": 1832,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:22"
}