{
  "name": "Sana Belguith",
  "homepage": "https://research-information.bris.ac.uk/en/persons/sana-belguith",
  "status": "success",
  "content": "Sana Belguith - University of Bristol View Scopus Profile Dr Sana Belguith BSc, PhD, PGCHE Senior Lecturer, School of Computer Science https://orcid.org/0000-0003-0069-8552 Emailsana.belguithbristol.acuk BS8 1UB Personal profile Research interestsSecurity and Privacy in Distributed Systems. Machine Learning Privacy. Space Applications Cyber Security. User-Centric Privacy and Security. External positionsExternal Examiner, University of Surrey1 Jan 2022 → … Research Groups and ThemesCyber Security Fingerprint Dive into the research topics where Sana Belguith is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Internet-Of-Things Computer Science 100% Learning System Computer Science 84% Machine Learning Computer Science 84% Attribute-Based Encryption Computer Science 81% Security and Privacy Computer Science 58% Security Challenge Computer Science 55% Large Language Model Computer Science 44% Virtual Assistant Computer Science 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 24 Conference Contribution (Conference Proceeding) 14 Article (Academic Journal) 1 Preprint Research output per year Research output per year Personal Data-Less Personalized Software ApplicationsBelguith, S., Omoronyia, I. & Chitchyan, R., 10 Jul 2024, FSE 2024: Companion Proceedings of the 32nd ACM International Conference on the Foundations of Software Engineering. d'Amorim, M. (ed.). Association for Computing Machinery (ACM), p. 477-481 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Personal Data 100% Software Application 100% Software Solution 25% Privacy Concern 25% Data Minimization 25% 1 Citation (Scopus) Securing the Skies: A Cutting-Edge Authenticated Key Establishment Protocol for the Internet of DronesShamshad, S., Belguith, S. & Oracevic, A., 17 Apr 2025, In: IEEE Internet of Things Journal. 12, 14, p. 27113-27125 13 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open AccessFile forgery attack 100% 60 Downloads (Pure) View all 39 research outputs Projects 1 Active 5 Finished Projects per year Assessing the Space Security in the presence of AIBelguith, S. (Principal Investigator)1/11/24 → 31/07/25Project: Research SCULI: Securing Convergent Ultra-large Scale InfrastructuresRashid, A. (Principal Investigator), Belguith, S. (Co-Investigator), Adepu, S. (Co-Investigator), Creese, S. (Co-Investigator), Flechais, I. (Co-Investigator), Suri, N. (Co-Investigator), Bradbury, M. (Co-Investigator), Rushforth, Y. (Manager), Abaimov, S. (Researcher) & Badva, P. K. (Researcher)1/09/24 → 31/08/29Project: Research Securing Critical Infrastructure in the Quantum EraBelguith, S. (Principal Investigator) & Hammoudeh, M. (Co-Principal Investigator)1/04/24 → 30/09/25Project: Research View all 6 projects",
  "content_length": 3261,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:25"
}