{
  "name": "Sander M. Bohte",
  "homepage": "http://homepages.cwi.nl/~sbohte",
  "status": "success",
  "content": "Website Sander M. Bohte Navigation Home Publications Research Teaching Personal Researcher Neural Computation Email: S.M.Bohte [at] cwi [dot] nl Phone: tel. (+31) (0)20 592 4074 Mailing Address: Prof.dr. Sander M. Bohté CWI ML group Science Park 123 NL-1098XG Amsterdam The Netherlands Research overview NL:Ik werk aan neurale netwerk modellen met als doel te begrijpen hoe biologische neurale netwerken zoals het brein informatie verwerken. I develop computational models to understand information processing in neural networks. I strongly believe that neural networks and computational neuroscience models should \"compute\"; the challenge is to develop insights from neuroscience into usefully computing neural networks, and to bring machine learning insights into models of how neurons in the brain compute. I particularly focused on continuous-time information processing, where time is an explicit dimension of the problem domain. This includes networks of spiking neurons, models of attention, predictive coding, interactive neural cognition, supervised neural learning, and deep reinforcement learning methods. A key research interest is work on learning in spiking neural networks, including the role of neural adaptation and predictive coding for optimal spiking information processing. The links to work we do on biologically plausible deep learning, ranging from plausible deep reinforcement learning to models of (learned) working memory and contextual task behavior. I have an appointment as a part-time full professor of Computational Neuroscience at the Swammerdam Institute for Life Sciences (SILS) of the University of Amsterdam. Active collaborations include work with Cyriel Pennartz (UvA); Pieter Roelfsema, at NIN Amsterdam; and Steven Scholte at B&C. In more applied machine learning efforts, we work on the use of deep neural network models in Scientific Machine Learning (with Kees Oosterlee, Utrecht University). Talented students are always welcome to come and do their MSc-thesis work, either based on their own proposed ideas, or based some ready-made potential MSc thesis projects. Note that I give preference to students from UvA as part of my appointment there. Topics include projects that link (spiking) neural networks to biology, and also on work that explores (probabilistic) learning in spiking neural networks (SNNs), for example in connection with reservoir computing, or in projects on efficiently simulating large-scale SNNs, with for example GPUs. Feel free to contact me for more information.",
  "content_length": 2534,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:34"
}