{
  "name": "Sandeep Manjanna",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-sandeep-manjanna",
  "status": "success",
  "content": "Dr. Sandeep Manjanna | Assistant Professor, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Sandeep Manjanna Sandeep Manjanna Assistant Professor, Plaksha University PhD, McGill University Area of Expertise: Applied Machine Learning Robotics Select About Awards About Sandeep Manjanna Dr. Sandeep Manjanna is a founding faculty at Plaksha University. His research is concentrated in applied machine learning and robotics. Earlier, he was a James McDonnell Postdoctoral Fellow at GRASP Labs in Computer and Information Science at University of Pennsylvania, Philadelphia, PA, USA. His research interests include robotic active sampling, multi-robot coordination, robotic sensor networks, reinforcement learning, and machine learning. Dr. Manjanna received his MSc and PhD from McGill University, advised by Prof. Gregory Dudek. His doctoral research focuses on designing algorithms for autonomous vehicles to sample, understand, and map challenging environments. Awards Dr. Manjanna’s PhD thesis was awarded the CIPPRS John Barron Dissertation Award in Robotics (2021) for its impact in the field of Robotics in Canada. Research Interests Robotics for Marine and Agriculture Path Planning Reinforcement Learning Adaptive Sampling for Environmental Monitoring Past Associations Postdoctoral Researcher at GRASP Labs, University of Pennsylvania, USA Education PhD in Computer Science, McGill University, Canada Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 4677,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:30"
}