{
  "name": "Sandra Siegert",
  "homepage": "https://ist.ac.at/research/research-groups/siegert-group",
  "status": "success",
  "content": "ISTA | Siegert Group HomeResearchSiegert Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Siegert Group Microglia-Neuron Interaction Identifying brain function has primarily concentrated on how environmental signals are encoded within a complex neuronal network—the impact of the immune system was mostly overlooked. The Siegert group focuses on how neurons and microglia interact with each other and how malfunctions within this relationship affect neuronal circuit formation and function in health and disease. Microglia are the CNS-resident macrophages, which continuously sense their neuronal environment also beyond just pathogenic insults. The Siegert group and others have shown that microglia adapt to defined environmental cues and can severely interfere with well-established neuronal circuit elements such as synapse but also extracellular matrix remodeling. Yet, the scientists are only starting to identify these cues, how they drive a microglia response, and which consequences those have on neuronal function in the adult brain. The goal of the Siegert group is to dissect the impact of defined environmental cues like drugs, extracellular matrix, sex, and metabolic insults, and how those cues modulate microglia response to either be beneficial or detrimental to neuronal circuit function and behavior. The Siegert group combines live imaging approaches with electrophysiological/cellular, molecular, and behavior analysis in the preclinical and human iPSC models. Furthermore, the group incorporates strategies of biophysics, mathematics, and machine learning in its research line. Group Leader Sandra Siegert Professor +43 2243 9000 3050 Sandra.Siegert@ist.ac.at Administrative Support Dayana Shaybazyan Assistant to Professors +43 2243 9000 2231 Dayana.Shaybazyan@ist.ac.at Team Medina Korkut-Demirbas PhD Student medina.korkut@ist.ac.at Alessandro Venturino Research Technician +43 2243 9000 7673 Alessandro.Venturino@ist.ac.at Natalie Özgen PhD Student natalie.gutmann-oezgen@ist.ac.at Current Projects Disentangle the morph-functional relationship of microglia | How to alter microglia function and pinpoint the consequences on the neuronal network | Microglia-neuron interaction in the human context For further details, see also the lab webpage below. Publications Hübschmann V, Korkut M, Venturino A, Maya-Arteaga JP, Siegert S. 2025. Microglia determine an immune-challenged environment and facilitate ibuprofen action in human retinal organoids. Journal of Neuroinflammation. 22(1), 98. View Miteva FE, Maes ME, Alamalhoda M, Firoozi A, Colombo G, Siegert S. 2025. Optic nerve crush does not induce retinal ganglion cell loss in the contralateral eye. Investigative Ophthalmology & Visual Science. 66(3), 49. View Michalska JM, Lyudchik J, Velicky P, Korinkova H, Watson J, Cenameri A, Sommer CM, Amberg N, Venturino A, Roessler K, Czech T, Höftberger R, Siegert S, Novarino G, Jonas PM, Danzl JG. 2024. Imaging brain tissue architecture across millimeter to nanometer scales. Nature Biotechnology. 42, 1051–1064. View Maes ME, Colombo G, Schoot Uiterkamp FE, Sternberg F, Venturino A, Pohl EE, Siegert S. 2023. Mitochondrial network adaptations of microglia reveal sex-specific stress response after injury and UCP2 knockout. iScience. 26(10), 107780. View Hübschmann V, Korkut M, Siegert S. 2022. Assessing human iPSC-derived microglia identity and function by immunostaining, phagocytosis, calcium activity, and inflammation assay. STAR Protocols. 3(4), 101866. View View All Publications ReX-Link: Sandra Siegert Career Since 2023 Professor, Institute of Science and Technology Austria (ISTA)2015 – 2023 Assistant Professor, Institute of Science and Technology Austria (ISTA)2011 – 2015 Postdoctoral Associate, Massachusetts Institute of Technology, Cambridge, USA2010 PhD, Friedrich Miescher Institute for Biomedical Research, Basel, Switzerland Selected Distinctions 2023 Horizon 2020 – ERC Proof-of-Concept2023 FWF Stand Alone Grant2019 SFN “Hot Topic” Selection2017 Liese Prokop Award2016 ERC Starting Grant2013 SWISS OphthAWARD2012 HFSP Long-term Fellowship Additional Information View Orcid AccountSiegert Lab Website Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6596,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:41"
}