{
  "name": "Sandra Geisler",
  "homepage": "https://dbis.rwth-aachen.de/dbis/index.php/user/sgeisler",
  "status": "success",
  "content": "JProf. Dr. Sandra Geisler | DBIS DBIS Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in Categories Pages - - Courses i5 Jobs Labs Lectures News Projects Research Fields RFC Seminars Theses Uncategorized Working Groups - Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in DBIS JProf. Dr. Sandra Geisler You can also find more information on my website: https://sandra-geisler.de This user account status is Approved This user has not added any information to their profile yet.Contact Information:AddressData Stream Management and Analysis Building: E2 Room: Ahornstraße 55 52074 Aachen Phone Number+492418021509E-mail Addressgeisler@dbis.rwth-aachen.deLinkedInhereWikiDatahttps://www.wikidata.org/wiki/Q110459066Short BioSandra Geisler is a junior professor for Data Stream Management and Analysis at the RWTH Aachen University since September 2021. She received her doctoral degree in computer science in December 2016 at the RWTH Aachen University. The thesis' title was \"A systematic evaluation approach for data stream-based applications\". She completed her diploma (master) studies in computer science in April 2008 at RWTH Aachen University. Sandra Geisler is leader of the group Digital Health Spaces at the Fraunhofer Institute for Applied Information Technology FIT in St. Augustin. She was working as a research assistant and PhD student at the Informatik 5 (Information Systems) chair at RWTH Aachen University from June 2008 until April 2017. She was member of the working group Model Management. Talks Quality-oriented Stream Processing on the Edge, Keynote Talk, Cluster of Excellence Conference, 27.10.2021, Online Big Time - A Glance At Azure Time Series Insights, SQL Saturday Wien, 24.01.2020, Wien, Österreich Schritte ins digitale Gesundheitswesen - Szenarien des Fraunhofer Medical Data Space, Networked Health, 09.11.2019, Köln, Deutschland How Flow Can You Go, SQL Saturday Rheinland, 25.05.2019, Bonn, Deutschland Stream on - Echtzeitdatenanalyse mit MS StreamInsight & Azure Stream Analytics, SQL Server Konferenz, 21.02.2019, Darmstadt, Deutschland Get into the Flow, SQL Server Konferenz, 20.02.2019, Darmstadt, Deutschland Stream on - Echtzeitdatenanalyse mit MS StreamInsight & Azure Stream Analytics, SQLdays Konferenz, 10.10.2018, Erding, Deutschland Stream on - Real-time Data Analysis with StreamInsight and Azure Stream Analytics, SQL Server Konferenz 2018, 28.02.2018, Darmstadt, Deutschland An Integrated Ontology-based Approach for Patent Classification in Medical Engineering, 12th Int. Conference on Data Integration in the Life Sciences 2017 (DILS'17), 13.11.2017, Luxembourg, Luxembourg Ontology-based Data Quality Management for Data Streams, Otto-Friedrich-Universitaet Bamberg, 16.05.2017, Bamberg Microsoft Business Intelligence für alle mobilen Plattformen, SQL Saturday Wien, 20.01.2017, Wien, Austria Complex Event Processing mit StreamInsight, PASS (Professional Association for SQL Server) Regionalgruppe Ruhrgebiet, 14.03.2013 An Ontology-based Data Quality Framework for Data Stream Applications, 16th International Conference on Data Quality, 19.11.2011, Adelaide, Australia A Universal Tool for Mobile Long-Time Recording, Monitoring and Analysis of Bio-Signals. IEEE International Conference on Mobile Data Management, International Workshop on Managing Health Information in Mobile Applications (HIMoA), June 6-9, Luleå, Sweden Data Stream Management Systems and Query Languages, Advanced School on Data Exchange, Integration and Streams (DEIS'10), Schloss Dagstuhl, Wadern, 09.11.2010 A data stream-based evaluation framework for traffic information systems. ACM SIGSPATIAL Intl. Workshop on GeoStreaming (IWGS), San José, USA, November 2010 Accuracy Assessment for Traffic Information Derived from Floating Phone Data. 17th World Congress on Intelligent Transportation Systems and Services (ITS), Busan, South-Korea, October 2010 A Data Stream-based Evaluation Framework for Traffic Information Systems, UMIC Workshop, 18.10.2010 A Data Stream-based Framework for Traffic Information Systems, Ericsson Eurolab, Aachen, 02.09.2010 Einführung in SQL Server Spatial, PASS (Professional Association for SQL Server) Regionalgruppe Ruhrgebiet, 12.08.2010 Dynamische Erstellung von SSIS-Paketen, PASS (Professional Association for SQL Server) Regionalgruppe Ruhrgebiet, 11.02.2010 Memberships and Posts Associate Editor of the Data Knowledge and Engineering Journal (DKE), Elsevier Public Relation Chair of the QDB Workshop held in conjunction with the VLDB 2016 in New Delhi, India Workshop Chair of the IMMoA Workshop held in conjunction with the VLDB 2013 in Riva del Garda, Trento, Italy Workshop Chair of the IMMoA Workshop held in conjunction with the VLDB 2012 in Istanbul, Turkey Workshop Chair of the HIMoA Workshop held in conjunction with the MDM 2011 in Lulea, Sweden Editor of the Special Issue on Information Management in Mobile Applications in the Pervasive and Mobile Computing Journal Current Teaching:Data Ecosystems Lab (WS 2025)Intelligent Data Management with Generative AI (WS 2025)Past Teachings:Data Ecosystems Lab (SS 2025)Data Stream Management and Analysis (SS 2025)Implementation of Databases (WS 2024)Research Focus Class on Data Ecosystems (WS 2024)Seminar Data Ecosystems (WS 2024)Data Stream Management and Analysis (SS 2024)Seminar Data Stream Management and Analysis (SS 2024)Data Ecosystems Lab (WS 2023)Implementation of Databases (WS 2023)Data Stream Management and Analysis (SS 2023)Seminar Data Ecosystems (SS 2023)Implementation of Databases (WS 2022)Seminar Data Stream Management and Analysis (WS 2022)Data Stream Management and Analysis (SS 2022)Seminar Data Ecosystems (SS 2022)Implementation of Databases (WS 2021)Seminar Data Stream Management and Analysis (WS 2021)Projects:LENS-C: Learning, Exams, and eNgagement Structure – ChatbotsMOSAIC: Malignant Cell Atlas based on Single-cell TranscriptomicschampI4.0nsTheses:Analyzing the Effect of Data Quality on the Performance of Fine-Tuned Large Language Models (Running)Creating the Digital Nervous System for the Internet of Sustainable Production (Running)On the Evaluation of Retrieval Augmented Generation-based Cypher Queries (Running)LLM-based Tool for Integrating Ontologies and Knowledge Graphs Into Researchers’ RDM Processes (Running)Synopsis operators for a distributed on-the-edge streaming architecture (Running)Near Real-time Anomaly Detection from Videostreams using WASM and Machine Learning (Running)Federated Machine Learning Architecture for an MDF Production Industry Use Case (Finished)Data-driven quality assurance in grinding manufacturing technology (Finished)Leveraging LLMs for Mathematical Optimization on the Example of Supply Chains (Finished)Image stream anomaly detection using feature sketch for industrial quality control (Finished)Is there data? Repository approaches to simplify the search for reusable research data (Finished)Data-driven quality assurance in grinding manufacturing technology (Finished)Adaptive Operator Placement for Edge Clusters using Cluster Simulation (Finished)User-defined and Predictive Quality of Service Monitoring for on-the-edge Data Stream Processing (Finished)Offloading of IoT Workloads in Peer-to-Peer Networks using WebAssembly (Finished)Executing Stream Processing Operators on Programmable Networking Devices (Finished)Efficient Metadata Management in Industrial Data Lakes for High Pressure Die Casting (Finished)A Hybrid and Platform-Agnostic Stream Processing Architecture (Finished)Development of a Data Ecosystem Model for the Context of Procurement (Finished)Time-series based Academic Trend and Downtrend Detection (Finished)Development of a metadata model for the storage of data streams in data lakes in the context of industrial production (Finished)Model-based Data Sharing Across Organizations (Cancelled)Publications: Loading publications Entries Comments SearchSearch Quick Links News Staff Job Offers Thesis Projects Resources Featured Videos How to find us ContactProf. Dr. S. DeckerRWTH Aachen UniversityLehrstuhl Informatik 5Ahornstr. 5552074 AachenTel +49/241/80-21509Fax +49/241/80-22321 Recent News Inaugural Meeting of the JUPITER AI Factory (JAIF) Call for Papers: Semantics in Dataspaces (SDS25) @ESWC 2025 Best Academic Reviewer Award at the iLRN 2024 Call for Papers: LLMs4MI2024 Workshop in Dubai Nachruf auf Prof. Dr. rer.pol. Matthias Jarke Recent Publications Loading publications top RWTH Main Page Faculty of Mathematics, Computer Science and Natural Sciences Department of Computer Science Knowledge-Based Systems Group Fraunhofer FIT",
  "content_length": 8767,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:38"
}