{
  "name": "Sandeep K. S. Gupta",
  "homepage": "https://cidse.engineering.asu.edu/directory/gupta-sandeep",
  "status": "success",
  "content": "Home - School of Computing and Augmented Intelligence Ash in the sky, water on the run Satellites, sensors and models unite in Paul Grogan’s work to deliver faster, smarter disaster response, turning orbiting assets into lifesaving allies. Learn more SCAI news Helping international students feel at home NewsFrom airport greetings to campus festivals, Hindu YUVA builds community and connection for ASU’s international students through support and friendship. read more What if cars and surgical robots spoke the same language? NewsAs machines take on critical roles in medicine, transportation and energy, researchers are developing a common foundation to ensure they don’t fail us. read more AI and the new golden rule NewsHasan Davulcu builds transparent systems that explain decisions, cut toxic output and encourage balanced, respectful conversations. read more Read more SCAI news Explore our diverse programs Our programs in computer science support the evolution of the computing and informatics disciplines, and the integration of computer and information sciences with other disciplines such as biology, geography, anthropology, public health, urban planning and mathematics. Degrees offered: BA, BS, MS, MCS, PhD Our computer systems engineering programs are concerned with the analysis, design and evaluation of computer systems, both hardware and software. This field of study not only focuses on how computer systems work, but also how they integrate into the larger picture. Degrees offered: BSE, MS, PhD The data science, analytics and engineering program focuses on development of new systems and algorithms for collecting, cleaning, storing, valuing, aggregating, fusing, summarizing, managing and drawing inferences from high dimension, high volume, heterogeneous data streams. Degrees offered: PhD The engineering management program is designed to provide the graduate with the competencies for effective management and leadership of engineering-driven enterprises. The curriculum provides a breadth of engineering science and design with depth in one specific engineering area suitable for practice. Degrees offered: BSE, DEng Our industrial engineering programs concentrate on the design, operation and improvement of the systems required to meet societal needs for products and services. The program combines knowledge from the physical, mathematical and social sciences to help design efficient manufacturing and service systems that integrate people, equipment and information. Degrees offered: BSE, MS, PhD The discipline of informatics makes connections between the work people do and technology that can support that work. It combines aspects of software engineering, human-computer interaction, decision theory, organizational behavior and information technology. Degrees offered: BSE The artificial intelligence concentration of robotics and autonomous systems focuses on the algorithmic aspects of robotics, including statistical machine learning, computer vision, natural language processing, knowledge retrieval and reasoning, and formal methods of planning. Degrees offered: MS with artificial intelligence concentration Our software engineering programs blend engineering, computing, project leadership and software construction. Students engineer software solutions in application areas such as Web applications, mobile systems, embedded systems, or graphics and game development. Degrees offered: BS, MS",
  "content_length": 3441,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:27"
}