{
  "name": "Sandro Etalle",
  "homepage": "http://www.win.tue.nl/~setalle",
  "status": "success",
  "content": "Home Page of Sandro Etalle Founder of the Security group and Startup Coach at the Technical University of Eindhoven Investor, Advisor, Board Member, VC (key man of CYSERO and Advisor of Curiosity VC) Not too long ago: co-founder, CEO and later Chairman of the Board of SecurityMatters, a 4TU spin-off, which has been acquired by ForeScout. I have a passion for entrepreneurship and for computer security. My current research interest include network intrusion detection, protection of industrial control systems and trust management. Innovation and main projects The Eindhoven Security Hub is a Security Operations Center we started in cooperation with Fontys, Kembit, Intermax and BDO. It is a place where excellent researchers work together with excellent professionals. INTERSCT. \"Towards an Internet of Secure Things\" is a public private partnership bringing together 11 knowledge/education/research institutions (TU/e, VU, TUD, UT, RU, UvT, TNO [CSR, ESI], NSCR, Fontys, HvA, HL), and a large number of private organisations to tackle the problem of IoT security. INTERSECT is funded by the Dutch National Research Council (Grant NWA.1162.18.301) and more than 20 private organisations. Of course there is also an INTERSCT. LinkedIn page I am actively involved in the startup world and I regularly assist/coach students who want to start their own company. Reach out to me if you are starting a new venture. FAQ (please read this before contacting me!) Requirements and procedure for doing an external master thesis at the Security Group. Important! How to join the security group at the TU/e. The vacancies at the Security group at the TU/e are listed at http://security1.win.tue.nl (tab \"vacancies\"). Research Slides of my keynote speech at ESORICS 2017. The paper \"From Intrusion Detection to Software Design\" is available here. I gave an updated version of the talk as keynote of the 2019 CPS-SPC workshop. The slides are here. The paper Encryption in ICS networks: a Blessing or a Curse? with a few coauthors. IEEE SmartGridComm, 2017. Other Publications. Teaching (link to old courses) At the TU/e, we offer a very cool Master Track in Information Security Technology Together with Luca Allodi, I teach Cyberattacks, Crime and Defenses, information is on CANVAS Ideas for master projects: see the \"Master Projects\" tab in the Security group page. Other Links Older events I have been involved in How to write an introduction - some suggestions Contact Details Technical University of Eindhoven Faculty of Mathematics and Computer Science Embedded Systems Security Group P.O. Box 513 5600 MB Eindhoven the Netherlands office: MetaForum 6.060 phone: ++31 (0)40 2475016 phone: ++31 (0)40 2472853 (secretary) fax: ++31 (0)40 2435810 email: s.etalle followed by @ and then by tue.nl",
  "content_length": 2788,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:45"
}