{
  "name": "Sandhya Saisubramanian",
  "homepage": "https://www.sandhyasai.com",
  "status": "success",
  "content": "Sandhya Saisubramanian 0 I am an Assistant Professor in the School of Electrical Engineering and Computer Science (EECS) at Oregon State University, where I lead the Intelligent and Reliable Autonomous Systems (IRAS) research group. I am also an affiliate member of the Collaborative Robotics and Intelligent Systems (CoRIS) Institute at Oregon State University. I earned my Ph.D. in Computer Science from the University of Massachusetts Amherst, where I was advised by  Shlomo Zilberstein.My research interests are in designing AI systems that are safe, reliable, and unbiased. My current research focus is on developing techniques for reliable decision-making in autonomous systems that operate in fully and partially observable environments. I am a recipient of the Outstanding Paper Award at RLC 2025, Outstanding Program Committee Member Award at ICAPS 2022, IJCAI 2020 Distinguished Paper Award, and a Rising Stars in EECS 2020 workshop participant. I will serve as a Program Co-Chair of the International Conference on Automated Planning and Scheduling (ICAPS), 2026. During the summer of 2019, I interned in the Intelligent Systems Division at NASA Ames Research Center . I designed and maintain a repository of negative side effects in AI systems. Consider contributing to our repository by letting us know about any negative side effects observed in a laboratory prototype or a deployed AI system.Contact: sandhya.sai AT oregonstate.eduOffice: 3005 Kelley Engineering Center Recent NewsAug 2025: Our paper on differential testing of autonomous systems accepted to AAAI Fall Symposium 2025!Aug 2025: Our paper on WOFOSTGym received the Outstanding Paper Award at RLC 2025!June 2025: Gave an invited talk on “Multi-Objective Planning with Contextual Preferences” at the RSS 2025 Workshop on Multi-Objective Optimization and Planning in Robotics.May 2025: Our paper introducing WOFOSTGym crop simulator for RL has been accepted to RLC 2025!January 2025: Paper on using credit assignment for mitigating side effects in multi-agent systems has been accepted at ICRA 2025!",
  "content_length": 2076,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:32"
}