{
  "name": "Sanda M. Harabagiu",
  "homepage": "http://www.utdallas.edu/~sanda",
  "status": "success",
  "content": "Dr. Sanda Harabagiu Home ~ Publications ~ Research ~ Teaching ~ Personal ~ Students Professor and Erik Jonsson School Research Initiation Chair Department of Computer Science University of Texas at Dallas Richardson, TX 75083-0688 Office: ECSS-3.411 Email: sanda@utdallas.edu Phone: (972) 883-4654 Fax: (972) 883-2349 I joined the Computer Science Department at U.T.Dallas in January 2002, coming from U.T. Austin, where I was a faculty member in the Department of Computer Sciences. My research interests include Natural Language Processing, Information Retrieval, Knowledge Processing, Artificial Intelligence and more recently Medical Informatics. I have been interested for a long time in Textual Question-Answering, reference resolution and textual cohesion and coherence. In 2006 I co-edited a book entitled Advances in Open Domain Question Answering. I have also co-organized several workshops, symposia, tutorials and research tracks focusing on Textual Question-Answering or Reference Resolution. In my research I combine knowledge extracted from the Web with knowledge coerced from large domain-specific knowledge bases (e.g. the Unified Medial Language System (UMLS) to model the semantics of language in texts. By learning knowledge embeddings for UMLS , superior recognition of relations in clinical documents can be achieved. UMLS knowledge embeddings can also inform the adversarial learning of biomedical knowledge embeddings used for alignining biomedial knowledge bases. More recently I have been fascinated by the discovery of misinformation on social media and its impact on vaccine hesitancy. Currently, the focus of my research is in using Large Language Models for several forms of reasoning about how controversial information is framed and about how stance towards frames of communication can be inferred from social media. I am a past recipient of an NSF CAREER Grant for studying reference resolution. I am a member of AMIA, AAAI, ACL, ACM SIGIR, IEEE Computer Society. I am also the Director of the Human Language Technology Research Institute at University of Texas at Dallas. Prospective students: I am actively looking for strong and motivated PhD students to join our group! If you are interested in working with me, please apply through the UT Dallas Computer Science PhD Program and mention me in your application (please understand that I cannot respond to individual emails). ONLY after being admitted in the PhD program, please email me to set up a meeting.",
  "content_length": 2494,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:27"
}