{
  "name": "Sandeep Sen",
  "homepage": "http://www.cse.iitd.ac.in/~ssen",
  "status": "success",
  "content": "Home page of Sandeep Sen Sandeep Sen June 1991- July 31, 2022. Email: ssen@cse.iitd.ac.in Currently in Ashoka University Ex Dean of Faculty, IIT Delhi (Aug 2016 - Aug 2018) Ex Head, Dept of CSE (Aug 2007 - Aug 2010) Biosketch Research PhD Students Teaching Area: Algorithms and Complexity with focus on Randomized Algorithms, Computational Geometry, Approximate Shortest Path problems model-specific efficient techniques (parallel, caching etc) Publications with selected online versions (previous students) Neelima Gupta(ngupta@cs.du.ac.in) 1998 Surender Baswana(sbaswana@cse.iitk.ac.in) 2003 Yogish Sabharwal (ysabharwal.in.ibm.com) 2006 V.N. Muralidhara(murali@cse.iitd.ernet.in) 2009 Manoj Gupta 2014 Sem II 18-19 COL 352 Intro to Automata and Theory of Computation Sem I 18-19 COL 702 Advanced data structures and algorithms Sem II 17-18 COV 886 Special Module in Algorithms (short course) Sem I 17-18 COL 702 Advanced data structures and algorithms Sem II 16-17 COL 757 Model Centric Algorithm Design Sem I 16-17 COL 752 Geometric Algorithms Sem II 15-16 COL 352 Intro to Automata and TOC Sem I 14-15 CSL 630 Data Structures and Algorithms CSL 866 Special Topics in Algorithms Sem II 14-15 CSL 705 Theory of Computation Sem I 13-14 CSL356 Analysis and Design of Algorithms (UG Core) Lecture Notes Previous courses CSL852 Computational Geometry Spl Topics in TCS (Cryptography) Spl Topics in TCS (Randomized Algorithms) CSL101 Introduction to Computers and Programming A recent book on algorithms (with Amit Kumar) Draft preprint Errata compilation in the published book NPTEL Video course on Computational Geometry, (Co-instructor Prof Pankaj Agarwal). QEEE Lectures on Basic Graph Algorithms : Topological Sort, Strong Components, MST (matroids), Shortest Paths The strengths of academic enterprise: EW Dijkstra A gentle introduction to Quantum Computation (authors: A. Bhushan and M. Gupta, April 2002) Photo Album More Qutub Terracota Temples (Bishnupur) Chhangu Lake (Sikkim) Umiam Lake (Shillong) Pangong Lake (Ladakh)",
  "content_length": 2029,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:30"
}