{
  "name": "Sangmi Pallickara",
  "homepage": "http://www.cs.colostate.edu/~sangmi",
  "status": "success",
  "content": "Sangmi Lee Pallickara Sangmi Pallickara Research Courses Outreach Program .ETC Sangmi Lee Pallickara, Ph.D. Clare Booth Luce Professor Professor of Computer Science Colorado State University Email) Sangmi.Pallickara@colostate.edu Phone) +1-970-492-4153 Office) CSB 374 Curriculum Vitae [Link] Publications [Link] Sangmi Lee Pallickara is the Clare Booth Luch professor of computer science at Colorado State University. Her research interests are in the areas of Big Data for the sciences, with an emphasis on issues related to predictive analytics, storage, retrieval, and metadata management. Her research spans data science and data engineering, especially in the context of voluminous, high-velocity data. Her projects have been deployed in agricultural sciences, atmospheric science and meteorology, environmental monitoring, and epidemiology. Her research has been funded through grants from the National Science Foundation including the NSF AI Institutes and CyberPhysical Systems programs, the Department of Homeland Security, the Advanced Research Projects Agency-Energy (ARPA-E), the National Institute of Food and Agriculture (NIFA), and the Environmental Defense Fund. Pallickara was the inaugural Jack Cochran Family Professor. She serves as an Associate Editor of the IEEE Transactions on Parallel and Distributed Systems and as an Editor of Future Generation Computer Systems, Elsevier. Also, she served on the editorial board of the Journal of Big Data, Springer, from 2013 to 2023. Pallickara is a recipient of the National Science Foundation’s CAREER award and the IEEE TCSC’s Award for Excellence in Scalable Computing. Currently, her ongoing research is funded through the US National Science Foundation's Artificial Intelligence Institutes, Cyberinfrastructure for Sustained Scientific Innovation, and the CyberPhysical Systems programs as well as the National Institute of Food and Agriculture. Information for Spring 2025 Office hours: 9-10AM on Fridays, CSB374 Research Group meetings: 10-11AM on Fridays, CSB305 (Open to all CS students)",
  "content_length": 2061,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:54"
}