{
  "name": "Sangkyun Lee 0002",
  "homepage": "https://air.korea.ac.kr",
  "status": "success",
  "content": "고려대학교 인공지능 연구실 AIR Lab @ Korea UniversitySearch this siteEmbedded FilesSkip to main contentSkip to navigationAI Research Lab고려대학교 정보보호대학원 인공지능 연구실Main Research Subjects:AI Safety / Secure AI / Trustworthy AIModel security: adversarial, model extraction, and backdoor attack & defense, watermarking & fingerprintingLLM security: prompt injection (e.g., jailbreaking) attacks, output sanitization,  and data/model extraction attacks.XAI (eXplainable AI): computer vision & NLP modelsOn-device AI: model compression, robust trainingAI for CybersecurityS/W vulnerability detection (source & binary code)LLM-based safe code generation협력연구기관: 국군방첩사령부 국방보안연구소, 방위사업청, 국방기술품질원, 국방과학연구소(ADD), 국가정보원(NIS), 한국전자통신연구소(ETRI), 국가보안기술연구소(NSR), 한국정보통신기술협회(TTA)협력연구기업: 삼성전자, KT, LIG 넥스원, 카카오뱅크, 현대기아자동차, 삼성SDSWe're interested in machine learning algorithms and theory for emerging fields of applications, e.g., deep computer vision, distributed machine learning, adversarial learning, and AutoML . We're specially interested in security and robustness of machine learning models and algorithms, which is crucial for the safe use of AI / ML in real life.Leader: Prof. Sangkyun Lee (이상근), Associate ProfessorSchool of CybersecurityKorea University연구실: 정운오IT교양관 310호대학원연구실: 로봇융합관 211호USENIX Security @ Seattle, USA (August 12-15, 2025)News[연구실 인턴쉽, 대학원생 모집] 대학원 진학을 희망하는 학부생, 인공지능 보안 연구에 관심이 있는 창의적이고 진취적인 신입생을 모집합니다 (이메일로 면담 신청)대학원 지원 전, 3개월 이상 학부 인턴쉽을 하는 것을 추천합니다.AI Security 필요 역량: 기계학습, 수학, 통계학 등AI for Security 필요 역량: 정적/동적 binary / source code 분석, LLM 사용 등[2025.10.1] 임베디드 시스템 등에 탑재를 위해 소형화된 AI 모델의 복제 공격 방어 기법 논문 (금소현, 이정현, 이상근)이 IEEE Access에 accept되었습니다.[2025.5.8] 연구실 논문 1편이 top-tier conference인 UAI 2025에 accept 되었습니다.[2024.10.9] Transformer 구조에 기반한 새로운 SW 취약점 탐지 기법 논문 (한성민, 김미주, 이상근 및 LIGNex1 연구진)이 IEEE Access에 accept 되었습니다.[2024.7.17] SW 취약점 탐지를 위한 CODE-SMASH 기법 논문 (한성민, 남현경, 이상근 및 LIGNex1 연구진)이 IEEE Access에 accept 되었습니다.[2024.4.18] AI모델 복제 기법인 SwiftThief 논문(이정현, 한성민, 이상근)이 top-tier conference인 IJCAI 2024에 accept 되었습니다. [2023.6.22] 이상근 교수님이 디지털타임즈 AI인 기사에 소개되었습니다. 기사원문[2023.4.48] 이상근 교수님이 Applied Science지의 special issue, Recent Advances in XAI의 객원 편집장을 맡게 되었습니다. 많은 투고 바랍니다.[2023.4.25] 특허 등록 되었습니다. 네트워크 침입 탐지 시스템 및 네트워크 침입 탐지 방법, 출원번호: 10-2021-0057630, 등록번호: 10-2526-9350000[2023.4.20] 특허 등록 되었습니다. 네트워크 공격 탐지 시스템 및 네트워크 공격 탐지 방법, 출원번호: 10-2021-0057656, 등록번호: 10-2525-5930000[2023. 2. 7] Smart factory 과제 관련 우리 연구실 논문 1편이 top-tier인 Journal of Manufacturing Systems 저널에 accept 되었습니다 (SCIE 상위 7%). 축하합니다!!! [2022. 5. 3] 우리 연구실 논문 2편이 top-tier conference인 IJCAI-22에 accept 되었습니다.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2625,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:53"
}