{
  "name": "Sang Ho Yoon",
  "homepage": "https://hcitech.org",
  "status": "success",
  "content": "Welcome to HCI Tech Lab! We are a multidisciplinary research group working on physical computing, natural user interface, and socially acceptable interactions. Our research focuses on enabling novel interactions for Extended Reality (XR) through sensing/haptic feedback technology and wearable interface with the aid of applied machine learning while supporting intelligent authoring systems. We envision natural user interactions that overcome physical, mental, and social barriers. To achieve this, we will focus onEmbedding Interactive TechnologiesAdvancing Interaction TechniquesAuthoring User Interface & ExperienceHCI Tech YoutubeLearn More about HCI Tech Lab (Korean)PreviousNextNews   Winter 2026 Undergraduate Research Internship Nov 7 2025We are looking for research interns (including URP) for 2025 Winter. Application deadline is Nov 18th. You can find more information here.  Visit from Danish delegation of distinguished professors Nov 3 2025Distinguished professors from Denmark visited our lab as part of the Global Innovation Network Programme (GINP) – Korea 2025.  A paper accepted to IMWUT (UbiComp 2026) Oct 27 2025Our paper Moving-Press: Pressure-based Moving Phantom Sensation for Immersive VR Hand Interaction led by Dongkyu, Kyungjin and Rachel is accepted to Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT).  Lab Activity (Fall Barbeque) Oct 24 2025Lab Gathering for Fall Barbeque.  UbiComp 2025 Participation Oct 16 2025Our lab participated in UbiComp'25 in Espoo. Changheyon and HyungIl presented IMWUT paper and ISWC Brief.  Best Paper Award for ISMAR 2025 Oct 13 2025Our paper Visuo-Tactile Feedback with Hand Outline Styles for Modulating Affective Roughness Perception led by Minju wins Best Paper Award (<1%) for ISMAR 2025!'  ISMAR 2025 Participation Oct 13 2025Our lab participated in ISMAR'25 in Daejeon. Kun-woo and Minju presented papers. Hojeong, Kyoungwhan, Min-yung, and Dongkyu presented posters.  Visit from Aarhus University Oct 10 2025Prof. Ken Pfeuffer and Dr. Qiushi Zhou from Aarhus University visited us!  Visit from MIT & FH Technikum Wien Oct 10 2025Dr.Liu from MIT's Leap Group and Horst Orsolits from FH Technikum Wien visited us!  Visit from Google XR team Oct 2 2025Ruofei and Xun from Google XR team visited HCI Tech Lab for potential research collaboration.  UIST 2025 Participation Sep 29 2025Our lab participated in UIST'25 in Busan. Youjin, Hanseok, and Donkyu presented demos. Eunho and Rachel presented SIC demo.  Pre-UIST Participation Sep 28 2025Our lab participated in Pre-UIST event in KAIST.  Student Fellowship Aug 28 2025Dongkyu & Kyungeun are selected for 'PhD Student Research Grant' from the National Research Foundation of Korea.  Student Fellowship Aug 20 2025Kyungeun is selected for 'Research Grant for U.S. Visiting Women Researchers' from the National Research Foundation of Korea.  KCCV 2025 Participation Aug 1 2025Our lab participated in KCCV'25 in Busan. Hanseok presented our NeurIPS'24 paper.  Visit from Beihang, Tsinghua, SUS Tech July 15 2025Visitors from Chinese institutions including Prof. Dangxiao Wang, Prof. Yun Wang, Prof. Yang Jiao, Prof. Seungwoo Je visited us!  WHC 2025 Participation July 8 2025Our lab participated in WHC'25 in Suwon. Hojeong presented a paper and Eunho, Murad, Kun-woo, and Youjin presented demos/posters.  Visit from UIUC July 7 2025Prof. Craig Shultz from UIUC's Interactive Display Lab visited us!  KCC 2025 Participation July 1 2025Our lab participated in KCC'25 in Jeju. Our lab had a workshop on Multimodal Haptic Interface. Yubin and Dohui received Outstanding Paper Awards.  Lab Activity (Sports Day) Jun 18 2025Lab Gathering with Sports Activity.  Research Collaboration (ETRI) Jun 5 2025Out lab participated in ETRI Conference 2025. Hojeong & Dongkyu presented our haptic glove project with ETRI.  Visit from ASU Jun 4 2025Prof. Heejin Jeong from Arizona State University's HiMER Lab visited us!  CHI 2025 Participation May 1 2025Our lab participated in CHI'25 in Yokohama. Jina, Kyungeun, Youjin & Hyunyoung presented their papers with 2 Honorable Mention Awards!  CHI 2025 Workshop Apr 28 2025We had a successful 1st XR-PHY workshop at CHI'25. Thanks Jina & Soyeong for volunteering as assistants.   HCI Tech Lab members and papers at CHI 2025 Apr 28 20254 full papers and 1 workshop got accepted to CHI 2025.Read More  Summer 2025 Undergraduate Research Internship Apr 27 2025We are looking for research interns (including URP) for 2025 Summer. Application deadline is May 7th.  A paper accepted to WHC 2025 Apr 18 2025Our paper 3D Shape Perception through Spatiotemporal Vibrotactile Patterns with Kinesthetic Feedback led by Hojeong and Eun Ho is accepted to IEEE World Haptics Conference (WHC).  A paper accepted to IMWUT (UbiComp 2025) Apr 3 2025Our paper UltraBoard: Always-Available Wearable Ultrasonic Mid-air Haptic Interface for Responsive and Robust VR Inputs led by Changhyeon and Yubin is accepted to Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT).  New Research Project Apr 1 2025Generative Haptics and Fine Response Inference for Flexible Tactile Interfaces supported by Institute for Information & communication Technology Planning & evaluation (IITP) for 4 years.  Lab Activity (KAIST Strawberry Party) Mar 31 2025Lab Gathering at the KAIST Strawberry Party.  Two Honorable Mention Award for CHI 2025 Mar 28 2025Our papers ChoreoCraft: In-situ Crafting of Choreography in Virtual Reality through Creativity Support Tool led by Kyungeun & Hyunyoung and T2IRay: Design of Thumb-to-Index based Indirect Pointing for Continuous and Robust AR/VR Input led by Jina win Honorable Mention Award for CHI 2025!'  New Lab Logo Feb 20 2025Our lab got a new logo designed by Changheyon Park! Thanks all members for the feedback!  2025 Graduation Feb 14 2025Hyung Il, Soyeong, Dongkyu, Min-yung, Junghoon, Kyungeun, Kyungjin, and Nicha graudated. Congrats!  KSC 2024 Outstanding Paper Presentation Award Feb 3 2025Kun-woo, Youngrae, and Kyoungwhan received KSC 2024 Outstanding Paper Presentation Award!  A paper accepted to IEEE TVCG Jan 26 2025Our paper Neck Goes VRrr: Reducing Rotation-Induced Virtual Reality Sickness through Neck Muscle Vibrations led by Kun-Woo is accepted to IEEE Transactions on Visualization and Computer Graphics (TVCG).  Four papers accepted to CHI 2025 Jan 17 2025Four papers from HCI Tech Lab and collaborators have been accepted to CHI 2025. Congratulations to Hyunyoung Han, Kyungeun Jung, Jina Kim, and Youjin Sung!Read More  Interns Jan 1 2025Welcome our winter interns Rachel Jungmin Kim, Eun Ho Kim, and Hyunwook Jung!  KSC 2024 Participation Dec 20 2024Out lab participated in KSC 2024. Dongkyu and Kun-Woo presented papers.  Student Research Prize Dec 16 2024Hojeong received the College of Liberal Arts and Convergence Science Research Prize for 2024!  NeurIPS 2024 Participation Dec 10 2024Our lab participated in NeurIPS 2024 held in Vancouver. Kyungjin, Junghoon, Hanseok presented a paper!More NewsHCI Tech Youtube Highlighted PublicationsNeck Goes VRrr: Reducing Rotation-Induced Virtual Reality Sickness through Neck Muscle VibrationsAUTHORS: Kun-Woo Song, Sang Ho Yoon IEEE Transactions on Visualization and Computer Graphics (TVCG/ISMAR2025)Project WebsiteDOIUltraBoard: Always-Available Wearable Ultrasonic Mid-air Haptic Interface for Responsive and Robust VR InputsAUTHORS: Changhyeon Park, Yubin Lee, Sang Ho Yoon ACM IMWUT (UbiComp/ISWC 2025)Project WebsiteDOIVIDEOT2IRay: Design of Thumb-to-Index based Indirect Pointing for Continuous and Robust AR/VR InputAUTHORS: Jina Kim, Yang Zhang, Sang Ho Yoon CHI2025AWARD:  Honorable Mention AwardProject WebsiteDOIVIDEOChoreoCraft: In-situ Crafting of Choreography in Virtual Reality through Creativity Support ToolAUTHORS: Kyungeun Jung*, Hyunyoung Han*, Sang Ho Yoon CHI2025AWARD:  Honorable Mention AwardProject WebsiteDOIVIDEOHapticGen: Generative Text-to-Vibration Model for Streamlining Haptic DesignAUTHORS: Youjin Sung*, Kevin John*, Hasti Seifi**, Sang Ho Yoon** CHI2025Project WebsiteDOIVIDEOPosture-Informed Muscular Force Learning for Robust Hand Pressure EstimationAUTHORS: Kyungjin Seo*, Junghoon Seo*, Hanseok Jeong, Sangpil Kim, Sang Ho Yoon NeurIPS 2024Project WebsiteDOIVIDEOEStatiG: Wearable Haptic Feedback with Multi-Phalanx Electrostatic Brake for Enhanced Object Perception in VRAUTHORS: Nicha Vanichvoranun*, Hojeong Lee*, Seoyeon Kim, Sang Ho Yoon ACM IMWUT (UbiComp2024)Project WebsiteDOIVIDEOPDF",
  "content_length": 8540,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:46"
}