{
  "name": "Sanghamitra Bandyopadhyay",
  "homepage": "https://www.isical.ac.in/~sanghami",
  "status": "success",
  "content": "Home Page of Sanghamitra Bandyopadhyay Indian Statistical Institute Home Research Recognitions ▾ Awards Fellowship/Membership Academic ▾ Editorial Activities Teaching Student Publication▾ Journals Books Conferences Book Chapters Projects Professional▾ Plenary/Keynote/Panel Talks Invited Lectures/Tutorials/Seminars Conference/Workshop Organizational Activities Research/Travel Fellowships Other Personal Welcome to the homepage of Sanghamitra Bandyopadhyay Professor (HAG), Machine Intelligence Unit Director, Indian Statistical Institute, Kolkata Sanghamitra Bandyopadhyay joined the Machine Intelligence Unit of the Indian Statistical Institute as a faculty member in 1999, after completing her PhD from the same Institute. She was the Director of the Institute from August 2015 to July 2020, and is currently on her second tenure as Director from September 2020 onwards. Sanghamitra has worked in various Universities and Institutes world-wide including in USA, Australia, Germany, France, Italy, China, Slovenia and Mexico, and delivered invited lectures in many more countries. She has received several awards and fellowships including the Bhatnagar Prize, Infosys award, TWAS Prize, DBT National Women Bioscientist Award (Young), INAE Silver Jubilee Prize, Young scientist/engineer medals of INSA, INAE and Science Congress, JC Bose Fellowship, Swarnajayanti Fellowship and Humboldt Fellowship. She is a Senior Associate of ICTP and Fellow of INSA, INAE, NASI and IEEE. She is currently a member of the Science, Technology and Innovation Advisory Council of the Prime Minister of India (PM-STIAC). The current research interests of Prof. Sanghamitra Bandyopadhyay include artificial intelligence, machine learning, soft and evolutionary computation, pattern recognition, data mining and various other applications. She has authored/co-authored more than 300 research article in international journals, conferences and book chapters, and published six authored and edited books from publishers like Springer, World Scientific and Wiley. She has also edited journals special issues in the area of soft computing, data mining, and bioinformatics. Some Interesting Links: ISI Bioinformatics Lab Machine Learning Repository Bioinformatics at MB&B lab, Yale Univ BISC - Berkeley Initiative in Soft Computing Knowledge Discovery and Data Mining Conferences: NIPS, ICONIP, ICICS, MISMRM, ICIP,IJCNN,CVPR Contact Address : Machine Intelligence Unit Indian Statistical Institute 203 B. T. Road, Kolkata 700108 West Bengal, India E-mail :    sanghami [at] isical [dot] ac [dot] in Phone :     91 33 2575 3114 (office) 91 33 2646 7081 (home) © Copyright 2014. Designed by usaonlinecasinos.org",
  "content_length": 2687,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:53"
}