{
  "name": "Sang Won Lee 0002",
  "homepage": "http://people.cs.vt.edu/sangwonlee",
  "status": "success",
  "content": "Sang Won Lee Sang Won Lee's website computer music, human computer interaction, live coding. email : Hi, I am an assistant professor in Computer Science at Virginia Tech. I received a Ph.D. in Computer Science at the University of Michigan, advised by Prof. Walter Lasecki and Prof. Georg Essl. I earned my B.Sc. in Industrial Engineering from Seoul National University, Master of Science in Music Technology from Georgia Tech. I am looking for exceptional undergraduates, Master's students, Ph.D. students, and post-docs with strong technical skills who are interested in creating novel interactive systems that can facilitate collaboration, creativity, and empathy. I also create novel interactive music systems that enable new musical aesthetic. Drop me an email if you think you are the one. Drop me an email if you think you are the one. Upcoming Travel - , Selected Projects Crowdsourcing SketchExpress - Crowdsourcing Interactive Behaviors in Sketch Prototypes Live Coding Live Coding YouTube Crowdsourcing Codeon - On-Demand Programming Assistance Music Information Retrieval Lyric-to-Music Alignment using Synthesized Speech Live Writing, Live Coding Live Writing - Writing as a Real-time Audiovisual Performance Audience Participation, Live Coding Crowd in C[loud] Live Writing, Live Coding Live Writing - Asynchronous Playback of Live Coding and Writing Live Coding, Network Music, CSCW SuperCopair - Google Doc for Live Coding Live Writing, Live Coding, Web Audio Temporal Typography for Musical Expression and Performance Network Music, Live Coding Networked Collaborative Live Coding Network Music, Audience Participation Distributing Mobile Music Applications over MANET Interactive Media Design Aural Cavity Interactive Media Design Interactive Media Design Projects Live Coding, Network Music Live Coding the Mobile Music Instrument Audience Participation, Mobile Music echobo Network Music, Live Coding SGLC, Live Coding Real-Time Notation Mobile Music, Network Music TOK! Network Music, Live Coding LOLC Interactive Music Crossole Algorithmic Composition, Machine Listening Don't listen to human. Composition, Musique Concrete Printer Music Interactive Music Stickies Music Algorithmic Composition XOR Interactive Listening SharePhone email :",
  "content_length": 2261,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:49"
}