{
  "name": "Sangjin Lee 0002",
  "homepage": "https://dfrc.korea.ac.kr",
  "status": "success",
  "content": "Digital Forensic Research Center (DFRC), Korea University. Back Back More Post notifications Post reactions\t\t\t\t\t\t\t\t\t\t\t\t\tBe notified when someone leaves a comment or a reply to your post or comment. Updates and news\t\t\t\t\t\t\t\t\t\t\t\t\tStay ahead of important updates and news from the site. Alarm My account Sign out ABOUT US Professor Current Members Alumni & Former Members PUBLICATION Paper Patent Award Standard Book RESEARCH INFRA DFRC Knowledge Base Online Training Courses Glossary of Terms DFRC Reference Datasets OS/App Hash DB Synthetic Evidence DFRC Resources DFRC Tools BOARD Notice News DFRC Board Q&A CONTACT Location Seoul Travel Guide Close Korea UniversityDigital Forensic Research Center Digital Forensic Research Center (DFRC) is a university research center, established within the School of Cybersecurity in Korea University, with a mission to research techniques and procedures for the identification, collection, process, analysis, and presentation of digital evidence in response to cybercrimes and cybersecurity incidents. We are always looking for researchers who are passionate on digital forensics. Digital Forensic Research Center Digital Forensic Research Center (DFRC) is a university research center, established within the School of Cybersecurity in the Korea University, with a mission to research techniques and procedures for the identification, collection, process, analysis, and presentation of digital evidence in response to cybercrimes and cybersecurity incidents. We are always looking for researchers who are passionate on digital forensics. Location RESEARCH AREAS DFRC is conducting research in various fields of digital forensics. We are not limited to digital forensics but are constantly exploring areas we can study, such as AI, vulnerabilities, and system security diagnosis in cybersecurity. Techniques and Processes for Digital ForensicsConduct research on overall technologies and procedures used in the field of digital forensics. Laws and Policiesfor Digital ForensicsResearch the laws and policies needed in the field of digital forensics, and establish relevant standards. Other areas applicable to Digital ForensicsConducts research that can be fused with digital forensics such as cybersecurity, reverse engineering, firmware analysis, and vulnerabilities. Development ofDigital Forensic InfrastructuresBuild a digital forensic infrastructure through various activities such as RDS(Reference Datasets) and online training course. NEWS More News Forensic Knowledge More Information 디지털 포렌식 개요 1디지털 포렌식이란? 디지털 포렌식 개요 1디지털 포렌식이란? 디지털 포렌식 개요 2디지털 데이터 특성 디지털 포렌식 개요 2디지털 데이터 특성 디지털 포렌식 개요 3디지털 증거 디지털 포렌식 개요 3디지털 증거 디지털 데이터의 저장과 표현 1시간 정보와 수 체계 디지털 데이터의 저장과 표현 1시간 정보와 수 체계 디지털 데이터의 저장과 표현 2문자 코드와 파일 디지털 데이터의 저장과 표현 2문자 코드와 파일 디지털 포렌식 개요 4디지털 포렌식 절차 디지털 포렌식 개요 4디지털 포렌식 절차 디지털 포렌식 수집 1활성 상태 데이터 수집 디지털 포렌식 수집 1활성 상태 데이터 수집 디지털 포렌식 수집 2비활성 상태 데이터 수집 디지털 포렌식 수집 2비활성 상태 데이터 수집 디지털 포렌식 수집 3임베디드 기기 데이터 수집 디지털 포렌식 수집 3임베디드 기기 데이터 수집 디지털 기기와 저장 장치 1저장 장치와 인터페이스 디지털 기기와 저장 장치 1저장 장치와 인터페이스 디지털 기기와 저장 장치 2파티션과 볼륨 디지털 기기와 저장 장치 2파티션과 볼륨 파일시스템 1파일시스템 역사와 특징 파일시스템 1파일시스템 역사와 특징 파일시스템삭제 파일 복구 기술 파일시스템삭제 파일 복구 기술 파일시스템 2FAT 파일시스템 파일시스템 2FAT 파일시스템 파일시스템 3NTFS 파일시스템 파일시스템 3NTFS 파일시스템 RESEARCH AREAS DFRC is conducting research in various fields of digital forensics. We are not limited to digital forensics but are constantly exploring areas we can study, such as AI, vulnerabilities, and system security diagnosis in cybersecurity. Techniques and Processes for Digital Forensics Development of Digital Forensic Infrastructures Laws and Policies for Digital Forensics Others areas applicable to Digital Forensics Techniques and Processes for Digital ForensicsConduct research on overall technologies and procedures used in the field of digital forensics. Development ofDigital Forensic InfrastructuresBuild a digital forensic infrastructure through various activities such as RDS(Reference Datasets) and online training course. Laws and Policiesfor Digital ForensicsResearch the laws and policies needed in the field of digital forensics, and establish relevant standards. Other areas applicable to Digital ForensicsConducts research that can be fused with digital forensics such as cybersecurity, reverse engineering, firmware analysis, and vulnerabilities. Research Areas NEWS More News No posts yet. Forensic Knowledge Online Training Courses More Information 디지털 포렌식 개요 1디지털 포렌식이란? 디지털 포렌식 개요 1디지털 포렌식이란? 디지털 포렌식 개요 2디지털 데이터 특성 디지털 포렌식 개요 2디지털 데이터 특성 디지털 포렌식 개요 3디지털 증거 디지털 포렌식 개요 3디지털 증거 디지털 데이터의 저장과 표현 1시간 정보와 수 체계 디지털 데이터의 저장과 표현 1시간 정보와 수 체계 디지털 데이터의 저장과 표현 2문자 코드와 파일 디지털 데이터의 저장과 표현 2문자 코드와 파일 디지털 포렌식 개요 4디지털 포렌식 절차 디지털 포렌식 개요 4디지털 포렌식 절차 디지털 포렌식 수집 1활성 상태 데이터 수집 디지털 포렌식 수집 1활성 상태 데이터 수집 디지털 포렌식 수집 2비활성 상태 데이터 수집 디지털 포렌식 수집 2비활성 상태 데이터 수집 디지털 포렌식 수집 3임베디드 기기 데이터 수집 디지털 포렌식 수집 3임베디드 기기 데이터 수집 디지털 기기와 저장 장치 1저장 장치와 인터페이스 디지털 기기와 저장 장치 1저장 장치와 인터페이스 디지털 기기와 저장 장치 2파티션과 볼륨 디지털 기기와 저장 장치 2파티션과 볼륨 파일시스템 1파일시스템 역사와 특징 파일시스템 1파일시스템 역사와 특징 파일시스템삭제 파일 복구 기술 파일시스템삭제 파일 복구 기술 파일시스템 2FAT 파일시스템 파일시스템 2FAT 파일시스템 파일시스템 3NTFS 파일시스템 파일시스템 3NTFS 파일시스템",
  "content_length": 5090,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:53"
}