{
  "name": "Sanghamitra Dutta",
  "homepage": "https://www.cs.umd.edu/people/sanghamd",
  "status": "success",
  "content": "Sanghamitra Dutta | UMD Department of Computer Science Skip to main content Explore People People FacultyFaculty Awards In Memoriam Staff Dept. PhonebookFaculty Staff Students As PDF University Directory Search People Overview Name Search by name Title Search by title Location Search by location Apply Reset Sanghamitra Dutta Affiliate Assistant Professor Email: sanghamdumd[.dot.]edu Phone: (301) 405-2677 Location: AV Williams 2115 Website: https://sites.google.com/site/sanghamitraweb/ Google Scholar: BgaqaXwAAAAJ Twitter: https://x.com/sangha26dutta Education: PhD, Carnegie Mellon University, 2021 Master's, Carnegie Mellon University, 2021 B. Tech. (Hons.), Indian Institute of Technology Kharagpur, 2015 Appointments: CS, UMIACS, ECE Research Areas: Algorithms and Theory, Machine Learning and Data Science, Computer Vision and Machine Perception Interest Areas: Trustworthy Machine Learning, artificial intelligence, Explainability, Fairness, AI Interpretability, information theory, Statistics, Optimization Biography Sanghamitra Dutta is an assistant professor in the Department of Electrical and Computer Engineering at the University of Maryland College Park since Fall 2022. She is also affiliated with the Department of Computer Science, the Center for Machine Learning (CML) at UMIACS, and the Values-Centered Artificial Intelligence (VCAI). Prior to joining UMD, she was a senior research associate at JPMorgan Chase AI Research New York in the Explainable AI Centre of Excellence (XAI CoE). She received her Ph.D. and Master's from Carnegie Mellon University and B. Tech. from IIT Kharagpur, all in Electrical and Computer Engineering. Her research interests broadly revolve around reliable and trustworthy machine learning. She is particularly interested in addressing the challenges concerning fairness, explainability, privacy, and reliability, by bringing in a novel foundational perspective deep-rooted in information theory, statistics, causality, and optimization. Her research has featured in New Scientist and Montreal AI Ethics Brief, and also been adopted as part of the fair-lending model review at JPMorgan. In her prior work, she has also examined problems in reliable computing, proposing novel algorithmic solutions for large-scale distributed machine learning, using tools from coding theory (an emerging area called “coded computing”). Her results on coded computing has received substantial attention from across disciplines. She is a recipient of the 2024 NSF CAREER Award, 2023 Northrop Grumman Seed Grant, 2023 JPMorgan Faculty Award, 2022 Simons Institute Fellowship for Causality, 2021 AG Milnes Outstanding Thesis Award from CMU and 2019 K&L Gates Presidential Fellowship in Ethics and Computational Technologies. She has also pursued research internships at IBM Research and Dataminr. Honors and Awards Year Type Org. Name 2024 Award NSF NSF CAREER 2023 Award Northrop Grumman Faculty Research Award 2023 Award JP Morgan Faculty Research Award",
  "content_length": 2988,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:51"
}