{
  "name": "Sangeun Oh",
  "homepage": "https://mes.korea.ac.kr",
  "status": "success",
  "content": "MES Lab. @ KUSearch this siteEmbedded FilesSkip to main contentSkip to navigationMobile Embedded Systems Lab@ Korea UniversityWelcome to Mobile Embedded Systems (MES) Lab!MES Lab is directed by Prof. Sangeun Oh. Our lab aims to uncover practical challenges embedded in people's daily lives and develop edge computing technologies to address them, thereby creating innovative and useful user experiences (UX). To this end, we conduct research in three key directions, as outlined below:Multi-device / multi-app collaboration for mobile IoTSystem-level optimization for on-device AILLM-enhanced interaction for mobile IoTNOTICEWe are looking for enthusiastic researchers (B.S., M.S., and Ph.D. students)Please contact me freely via email (sangeunoh@korea.ac.kr)NEWS2024[Nov. 2024] Our paper \"TaPIN: Reinforcing PIN Authentication on Smartphones with Tap Biometrics\" has been accepted to IEEE Transactions on Mobile Computing.[Sep. 2024] Sangeun Oh joined Korea University and MES Lab@KU was launched.[Jun. 2024] Our paper \"MobileGPT: Augmenting LLM with Human-like App Memory for Mobile Task Automation\" has bee accepted to ACM MobiCom 2024.[Mar. 2024] Our paper \"LiquidListener: Supporting Ubiquitous Liquid Volume Sensing via Singing Sounds\" has bee accepted to IEEE Access.[Jan. 2024] Our paper \"RT-Swap: Addressing GPU Memory Bottlenecks for Real-Time Multi-DNN Inference\" has bee accepted to IEEE RTAS 2024.[Jan. 2024] Our paper \"Extracting Payment Tokens Out of Sounds Produced by Magnetic Field Fluctuations\" has bee accepted to IEEE Transactions on Mobile Computing.2023[Jan. 2024] Our paper \"Supporting Flexible and Transparent User Interface Distribution across Mobile Devices\" has bee accepted to IEEE Transactions on Mobile Computing.[Feb. 2023] Our Paper \"SPET: Transparent SRAM Allocation and Model Partitioning for Real-time DNN Tasks on Edge TPU\" has been accepted to DAC 2023. Congratulations, Changhun!2022[Aug. 2022] Our Paper \"A-Mash: Providing Single-App Illusion for Multi-App Use through User-centric UI Mashup\" has been accepted to ACM MobiCom 2022.[May. 2022] Our Paper \"MagSnoop: Listening to Sounds Induced from Magnetic Fields to Infer Mobile Payment Tokens\" has been accepted to ACM MobiSys 2022.[Feb. 2022] Our Paper \"Supporting Safe Priority Adjustment for Software-Defined Real-Time Networking\" has been accepted to IEEE Embedded Systems Letters. 2021[Oct. 2021] Our paper \"RT-SDN: Adaptive Routing and Priority Ordering for Software-Defined Real-Time Networking\" has been accepted to IEEE Systems Journal.[Jul. 2021] Our paper \"FLUID-XP: flexible user interface distribution for cross-platform experience\" has been accepted to ACM MobiCom 2021.2020[Sep. 2020] Sangeun Oh joined Ajou University and HIS Lab@Ajou was launched.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2828,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:50"
}