{
  "name": "Sanghack Lee",
  "homepage": "https://www.sanghacklee.me",
  "status": "success",
  "content": "Sanghack Lee I am an Associate Professor leading the Causality Lab at Seoul National University, where we explore how causal reasoning can make machine learning systems more reliable, interpretable, and useful in the real world. Our research spans from theoretical foundations of causal discovery to practical applications in health, finance, and large-scale AI systems. We are always looking for motivated students who are curious about how why-questions can drive the next generation of intelligent systems. [CV] Research Interests My research lies at the intersection of causal inference, causal discovery, and causal decision making, aiming to make machine learning systems not only accurate but also understandable, fair, and actionable. I am particularly interested in developing methods that uncover and utilize causal structures in complex, non-stationary, and high-dimensional environments — advancing both the theory and practical algorithms for reliable causal reasoning from data. Beyond these core directions, I am also interested in explainable and trustworthy AI, including issues of fairness, robustness, and interpretability, and in emerging connections between causal reasoning and large-scale foundation models, where causal perspectives may help explain or improve their reasoning behavior. Employment & Education Seoul National University Associate Professor 2025.03—present Seoul National University Assistant Professor 2021.03—2025.02 Columbia Univeristy Associate Research Scientist 2019—2021 Purdue University Postdoctoral Research Associate 2018—2019 Pennsylvania State University Ph.D. 2013—2018 News (Nov 2025) Prof. Lee is recognized as a Top Area Chair (top 10% of Area Chairs) at NeurIPS. (Nov 2025) Hyeonji’s paper on mitigating bias in RLHF is accepted at AAAI. (Sep 2025) Two papers on Structural Causal Bandits are accepted at NeurIPS. (Aug 2025) Yesong was awarded the NRF Ph.D. fellowship. (Apr 2025) We’re excited to host research talks by Julius von Kügelgen and Junhyung Park from ETH Zurich! (Feb 2025) Dong Kyu’s paper on single source domain generalization is accepted at CVPR 2025! (Nov 2024) Jonghwan and Jeongsup won first prize at DATA AI competition (by KISTI) (Nov 2024) Our paper on IV representation learning won a Best Paper Award at 2024 Fall Conference of Korean AI Association (Oct 2024) Two NeurIPS workshop papers are accepted. (Sep 2024) A paper on a graphical criterion for sequential adjustment is accepted at NeurIPS! (Aug 2024) Congratulations, Hyeonji, on receiving NRF’s Research Scholarship for Master students! (Aug 2024) Congratulations to Inwoo for being chosen as a recipient of the Yulchon AI STAR Scholarship! (May 2024) Two papers are accepted at ICML 2024. Thanks for students’ incredible efforts! (Apr 2024) Two papers are accepted at UAI 2024. Super congrats! (Jan 2024) Soheun’s paper on cyclic causal discovery is accepted at AISTATS. Congrats! Academic Activities Program Committee/Reviewed for 2026 AAAI, AISTATS, ICML (Area Chair) 2025 AAAI, KDD (outstanding reviewer), ICLR, AISTATS, CLeaR, ICML (Area Chair), NeurIPS (Top Area Chair) 2024 NeurIPS (Area Chair), CLeaR, ICML, UAI, JMLR (2x), ECAI, ARR (June), CI4TS at UAI 2023 UAI, NeurIPS (top reviewer), Journal of Causal Inference (JCI), CI4TS at UAI 2022 ICLR (highlighted reviewer), AAAI, AISTATS, CLeaR, ICML, UAI (top reviewer), JCI, NeurIPS 2021 ICLR, AAAI, AISTATS, UAI, ICML, NeurIPS, JAIR, Why now? workshop at NeurIPS 2020 NeurIPS, UAI, ICML (top reviewer), AAAI, AISTATS, IEEE TPAMI, Journal of Artificial Intelligence (AIJ), JCI, CDML Workshop at NeurIPS 2019 NeurIPS (Best Reviewer Award), WHY conference, JMLR, 2017 Causality Workshop at UAI, 2016 ACM CHI, 2014 ACM TIST Research Projects Causal Machine Learning (NRF, PI, 2023 ~ 27 with Innovative Research Lab Initiation Grant) Self-Motivated AI: Developing self-directed AI agents that can solve new problems (IITP, Co-I, 2022 ~ 26, PI: Byoung-Tak Zhang) Center for Optimizing Hyperscale AI Models and Platforms (NRF, Co-I, 2023~, PI: Jaejin Lee) Metabolomic Big Data Analysis (MFDS, Co-I, 2023 ~ 25) Scalable Causal Discovery (LG AI Research, PI, 2025 ~ 26) Advancing Credit Decision Making (Afinit, PI, 2025 ~ 26) Past Projects Semantic Search for Korean Medical and Legal Documents (SNU, co-PI, 2022~23, PI: Hyopil Shin) Association and Causality in Metabolomic data (MFDS, co-PI, 2022) Supply Chain based Financial Keyword Analysis (NH Investment, 2021) Causal Discovery for Time Series (LG AI Research, PI, 2023.04~24.04) An algorithmic aspect of proxy-based causal inference (SNU, PI, 2021~24) Deep Generative Models for Causal Reasoning (LG AI Research, PI, 2024.05~25.05)",
  "content_length": 4679,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:50"
}