{
  "name": "Sanidhya Kashyap",
  "homepage": "https://sanidhya.github.io",
  "status": "success",
  "content": "Sanidhya Kashyap Sanidhya Kashyap Assistant Professor School of Computer and Communication Sciences (IC) École Polytechnique Fédérale de Lausanne (EPFL) Lausanne, Switzerland CV RS3Lab sanidhya.kashyap@epfl.ch Research Interest Operating Systems, Concurrency, Distributed Systems, Computer Architecture For prospective folks I am always looking for motivated PhD students. Please drop me an email if you are interested. Publications Towards Structurally Extensible Host Network Stacks. Kumar Kartikeya Dwivedi, Rishabh Iyer, and Sanidhya Kashyap In Proceedings of the 24th ACM Workshop on Hot Topics in Networks (HotNets 2025) eBPF Misbehavior Detection: Fuzzing with a Specification-Based Oracle. Tao Lyu, Kumar Kartikeya Dwivedi, Thomas Bourgeat, Mathias Payer, Meng Xu, and Sanidhya Kashyap In Proceedings of the 30th ACM Symposium on Operating Systems Principles (SOSP 2025) Scalable Far Memory: Balancing Faults and Evictions. Yueyang Pan, Yash Lala, Musa Unal, Yujie Ren, Seung-seob Lee, Abhishek Bhattacharjee, Anurag Khandelwal, and Sanidhya Kashyap In Proceedings of the 30th ACM Symposium on Operating Systems Principles (SOSP 2025) FlexGuard: Fast Mutual Exclusion Independent of Subscription. Victor Laforet, Sanidhya Kashyap, Călin Iorgulescu, Julia Lawall, Jean-Pierre Lozi In Proceedings of the 30th ACM Symposium on Operating Systems Principles (SOSP 2025) Analyzing and Enhancing ArckFS: An Anecdotal Example of Benefits of Artifact Evaluation. Jonguk Jeon, Subeen Park, Sanidhya Kashyap, Sudarsun Kannan, Diyu Zhou, and Jeehoon Kang In Proceedings of the 30th ACM Symposium on Operating Systems Principles (SOSP 2025) Demystifying CXL Memory Bandwidth Expansion for Analytical Workloads. Georgiy Lebedev, Hamish Nicholson, Musa Unal, Sanidhya Kashyap, and Anastasia Ailamaki In Proceedings of the 16th International Workshop on Accelerating Analytics and Data Management Systems Using Modern Processor and Storage Architectures (ADMS'25) Single-Address-Space FaaS with Jord. Yuanlong Li, Atri Bhattacharyya, Madhur Kumar, Abhishek Bhattacharjee, Yoav Etsion, Babak Falsafi, Sanidhya Kashyap, and Mathias Payer 52nd International Symposium on Computer Architecture (ISCA'25) Tolerate It if You Cannot Reduce It: Handling Latency in Tiered Memory. Musa Unal, Vishal Gupta, Yueyang Pan, Yujie Ren, and Sanidhya Kashyap In Proceedings of the 20th Workshop on Hot Topics in Operating Systems (HotOS XX) PolyStore: Exploiting Combined Capabilities of Heterogeneous Storage. Yujie Ren, David Domingo, Jian Zhang, Paul John, Rekha Pitchumani, Sanidhya Kashyap, and Sudarsun Kannan 23rd USENIX Conference on File and Storage Technologies (FAST 25) Fast, Flexible, and Practical Kernel Extensions. Kumar Kartikeya Dwivedi, Rishabh Iyer, and Sanidhya Kashyap In Proceedings of the 30th ACM Symposium on Operating Systems Principles (SOSP 2024) Accepted to LPC’23 Monarch: A Fuzzing Framework for Distributed File Systems. Tao Lyu, Liyi Zhang, Zhiyao Feng, Yueyang Pan, Yujie Ren, Meng Xu, Mathias Payer, and Sanidhya Kashyap In Proceedings of the 2024 USENIX Annual Technical Conference (ATC 2024) Context-aware Prefetching for Near-Storage Accelerators. Jian Zhang, Marie Nguyen, Sanidhya Kashyap, and Sudarsun Kannan In Proceedings of the 16th ACM Workshop on Hot Topics in Storage and File Systems (HotStorage 2024) Transparent Multicore Scaling of Single-Threaded Network Functions. Lei Yan, Yueyang Pan, Diyu Zhou, George Candea, and Sanidhya Kashyap In Proceedings of the 19th ACM European Conference on Computer Systems (EuroSys 2024) Enabling High-Performance and Secure Userspace NVM File Systems with the Trio Architecture. Diyu Zhou, Vojtech Aschenbrenner, Tao Lyu, Jian Zhang, Sudarsun Kannan, and Sanidhya Kashyap In Proceedings of the 29th ACM Symposium on Operating Systems Principles (SOSP 2023) Best paper Ship your Critical Section, Not Your Data: Enabling Transparent Delegation with TCLocks. Vishal Gupta, Kumar Kartikeya Dwivedi, Yugesh Kothari, Yueyang Pan, and Sanidhya Kashyap In Proceedings of the 2023 USENIX Symposium on Operating Systems Design and Implementation (OSDI 2023) Also accepted to LPC’23 Usenix Login article Using Local Cache Coherence for Disaggregated Memory Systems. Irina Calciu, M. Talha Imran, Ivan Puddu, Sanidhya Kashyap, Hasan Al Maruf, Onur Mutlu, Aasheesh Kolli ACM SIGOPS Operating Systems Review (OSR 2023) Skadi: Building a Distributed Runtime for Data Systems in Disaggregated Data Centers. Cunchen Hu, Chenxi Wang, Sa Wang, Ninghui Sun, Yungang Bao, Jieru Zhao, Sanidhya Kashyap, Xiaoyang Deng, Pengfei Zuo, Rongfeng He, Xushen Chen, Liangliang Xu, Qin Zhang, Hao Feng, and Yizhou Shan In Proceedings of the 19th Workshop on Hot Topics in Operating Systems (HotOS XIX) TENET: Memory Safe and Fault tolerant Persistent Transactional Memory. R. Madhava Krishnan, Diyu Zhou, Wook-Hee Kim, Sudarsun Kannan, Sanidhya Kashyap, and Changwoo Min 21st USENIX Conference on File and Storage Technologies (FAST 23) Odinfs: Scaling PM Performance with Opportunistic Delegation. Diyu Zhou, Yuchen Qian, Vishal Gupta, Zhifei Yang, Changwoo Min, and Sanidhya Kashyap In Proceedings of the 2022 USENIX Symposium on Operating Systems Design and Implementation (OSDI 2022) Application-Informed Kernel Synchronization Primitives. Sujin Park, Diyu Zhou, Yuchen Qian, Irina Calciu, Taesoo Kim, and Sanidhya Kashyap In Proceedings of the 2022 USENIX Symposium on Operating Systems Design and Implementation (OSDI 2022) Birds of a Feather Flock Together: Scaling RDMA RPCs with FLOCK. Sumit Kumar Monga, Sanidhya Kashyap, and Changwoo Min In Proceedings of the 28th ACM Symposium on Operating Systems Principles (SOSP 2021) PACTree: A High Performance Persistent Range Index Using PAC Guidelines. Wook-Hee Kim, R. Madhava Krishnan, Xinwei Fu, Sanidhya Kashyap, and Changwoo Min In Proceedings of the 28th ACM Symposium on Operating Systems Principles (SOSP 2021) Preventing Use-After-Free Attacks with Fast Forward Allocation. Brian Wickman, Hong Hu, Insu Yun, Daehee Jang, JungWon Lim, Sanidhya Kashyap, and Taesoo Kim In Proceedings of the 30th USENIX Security Symposium (Security 2021) NrOs: Effective Replication and Sharing in an Operating System. Ankit Bhardwaj, Chinmay Kulkarni, Reto Achermann, Irina Calciu, Sanidhya Kashyap, Ryan Stutsman, Amy Tai, and Gerd Zellweger In Proceedings of the 2021 USENIX Symposium on Operating Systems Design and Implementation (OSDI 2021) Contextual Concurrency Control. Sujin Park, Irina Calciu, Taesoo Kim, and Sanidhya Kashyap In Proceedings of the 18th Workshop on Hot Topics in Operating Systems (HotOS XVIII) Rethinking Software Runtimes for Disaggregated Memory. Irina Calciu, M. Talha Imran, Ivan Puddu, Sanidhya Kashyap, Hasan Al Maruf, Onur Mutlu, Aasheesh Kolli In Proceedings of the 26th ACM Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2021) KRACE: Data Race Fuzzing for Kernel File Systems. Meng Xu, Sanidhya Kashyap, Hanqing Zhao, and Taesoo Kim In Proceedings of the 41st IEEE Symposium on Security and Privacy (S&P 2020) Finding Bugs in File Systems with an Extensible Fuzzing Framework. [  ] Seulbae Kim, Meng Xu, Sanidhya Kashyap, Jungyeon Yoon, Wen Xu, and Taesoo Kim ACM Transactions on Storage (TOS 2020) GT News, GT News Scalable and Practical Locking With Shuffling. [ | |  ] Sanidhya Kashyap, Irina Calciu, Xiaohe Cheng, Changwoo Min, and Taesoo Kim In Proceedings of the 27th ACM Symposium on Operating Systems Principles (SOSP 2019) GT News Finding Semantic Bugs in File Systems with an Extensible Fuzzing Framework. [ | |  ] Seulbae Kim, Meng Xu, Sanidhya Kashyap, Jungyeon Yoon, Wen Xu, and Taesoo Kim In Proceedings of the 27th ACM Symposium on Operating Systems Principles (SOSP 2019) GT News, GT News RECIPE: Converting Concurrent DRAM Indexes to Persistent-Memory Indexes. [ | |  ] Se Kwon Lee, Jayashree Mohan, Sanidhya Kashyap, Taesoo Kim, and Vijay Chidambaram In Proceedings of the 27th ACM Symposium on Operating Systems Principles (SOSP 2019) GT News SplitFS: Reducing Software Overhead in File Systems for Persistent Memory. [ | |  ] Rohan Kadekodi, Se Kwon Lee, Sanidhya Kashyap, Taesoo Kim, Aasheesh Kolli, and Vijay Chidambaram In Proceedings of the 27th ACM Symposium on Operating Systems Principles (SOSP 2019) PIRL, GT News Fuzzing File Systems via Two-Dimensional Input Space Exploration. [ | |  ] Wen Xu, Hyungon Moon, Sanidhya Kashyap, Po-Ning Tseng, and Taesoo Kim In Proceedings of the 40th IEEE Symposium on Security and Privacy (S&P 2019) GT News MV-RLU: Scaling Read-Log-Update with Multi-Versioning. [ |  ] Jaeho Kim, Ajit Mathew, Sanidhya Kashyap, Madhava Krishnan Ramanathan, and Changwoo Min In Proceedings of the 23rd ACM Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2019) Concurrency Freaks Scaling Guest OS Critical Sections With $e$CS. [ | |  ] Sanidhya Kashyap, Changwoo Min, and Taesoo Kim In Proceedings of the 2018 USENIX Annual Technical Conference (ATC 2018) A Scalable Ordering Primitive for Multicore Machines. [ | |  ] Sanidhya Kashyap, Changwoo Min, Kangnyeon Kim, and Taesoo Kim In Proceedings of the 13th ACM European Conference on Computer Systems (EuroSys 2018) SOLROS: A Data-Centric Operating System Architecture for Heterogeneous Computing. [ | |  ] Changwoo Min, Woonhak Kang, Mohan Kumar, Sanidhya Kashyap, Steffen Maass, and Taesoo Kim In Proceedings of the 13th ACM European Conference on Computer Systems (EuroSys 2018) LATR: Lazy Translation Coherence. [ | |  ] Mohan Kumar, Steffen Maass, Sanidhya Kashyap, Jan Vesely, Zi Yan, Taesoo Kim, Abhishek Bhattacharjee, and Tushar Krishna In Proceedings of the 23rd ACM Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2018) Designing New Operating Primitives to Improve Fuzzing Performance. [ | |  ] Wen Xu, Sanidhya Kashyap, Changwoo Min, and Taesoo Kim In Proceedings of the 24th ACM Conference on Computer and Communications Security (CCS 2017) Mo",
  "content_length": 12170,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:53"
}