{
  "name": "Sanjay Modgil",
  "homepage": "https://www.kcl.ac.uk/people/sanjay-modgil",
  "status": "success",
  "content": "Sanjay Modgil | King's College London Skip to main contentDr Sanjay Modgil Reader in Artificial IntelligenceResearch interestsComputer scienceContact details+44 020 7848 2775sanjay.modgil@kcl.ac.ukBiographyAbout Reader in Artificial Intelligence. Member of the Reasoning and Planning group. Research Interests Argumentation Theory Non-monotonic Logic Normative Reasoning Agent Reasoning and Multi-agent dialogue Applications of Artificial Intelligence in Medicine Philosophy and Ethics of Artificial Intelligence More Information Research Profile Research Funding Personal Website PublicationsResearchResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Security HubThe Security Hub consolidates the research related to securityCONSULTWellness sensors to support patient decisions in managing their healthcareProject status: OngoingReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. NewsNews14 April 2025Digital Futures Institute announces eleven new Fellows for 2025-26Eleven interdisciplinary projects awarded Fellowships from the Digital Futures Institute for the 2025-26 cohort.Arts & CultureBusiness & FinanceHealthInternationalLawSocietyTechnology & Science21 January 2019Interdisciplinary King's team win Best Demo for CONSULT healthcare projectAn interdisciplinary team from King’s, led by academic staff from the Department of Informatics, has won Best Demo at the 6th International Conference on...Technology & ScienceEventsEvents19MarKing's Experts Series: the Ethics of AI19 March 2024 18:00 to 19:00The King’s Experts Series is a series of events exclusively for King’s alumni, this webinar will touch on some of the latest research on digital technology...Please note: this event has passed.FeaturesFeatures16 November 2023Beyond silos: Why AI Regulation calls for an Interdisciplinary ApproachAre we facing an information apocalypse due to unregulated AI? What damage has already been done to society and what should our next steps be? Dr Sanjay...Technology & Science30 October 2023Reimagining AI Futures - Dr Sanjay Modgil: A future of AI regulation beyond silo - Part 2The information apocalypse still looms, but what other long-term effects could AI have? Dr Sanjay Modgil looks ahead to the world of issues a SAGE-AI could...Technology & Science30 October 2023Reimagining AI Futures - Dr Sanjay Modgil: Why AI Regulation calls for an Interdisciplinary Approach - Part 1To avoid the information apocalypse, Dr Sanjay Modgil talks how to balance over- and under-regulation of AI with a SAGE-AITechnology & SciencePublicationsResearchNewsEventsFeaturesResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Security HubThe Security Hub consolidates the research related to securityCONSULTWellness sensors to support patient decisions in managing their healthcareProject status: OngoingReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. News14 April 2025Digital Futures Institute announces eleven new Fellows for 2025-26Eleven interdisciplinary projects awarded Fellowships from the Digital Futures Institute for the 2025-26 cohort.Arts & CultureBusiness & FinanceHealthInternationalLawSocietyTechnology & Science21 January 2019Interdisciplinary King's team win Best Demo for CONSULT healthcare projectAn interdisciplinary team from King’s, led by academic staff from the Department of Informatics, has won Best Demo at the 6th International Conference on...Technology & ScienceEvents19MarKing's Experts Series: the Ethics of AI19 March 2024 18:00 to 19:00The King’s Experts Series is a series of events exclusively for King’s alumni, this webinar will touch on some of the latest research on digital technology...Please note: this event has passed.Features16 November 2023Beyond silos: Why AI Regulation calls for an Interdisciplinary ApproachAre we facing an information apocalypse due to unregulated AI? What damage has already been done to society and what should our next steps be? Dr Sanjay...Technology & Science30 October 2023Reimagining AI Futures - Dr Sanjay Modgil: A future of AI regulation beyond silo - Part 2The information apocalypse still looms, but what other long-term effects could AI have? Dr Sanjay Modgil looks ahead to the world of issues a SAGE-AI could...Technology & Science30 October 2023Reimagining AI Futures - Dr Sanjay Modgil: Why AI Regulation calls for an Interdisciplinary Approach - Part 1To avoid the information apocalypse, Dr Sanjay Modgil talks how to balance over- and under-regulation of AI with a SAGE-AITechnology & Science(N)7.08Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 4903,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:07"
}