{
  "name": "Sanjeev Bedi",
  "homepage": "https://uwaterloo.ca/mechanical-mechatronics-engineering/profile/sbedi",
  "status": "success",
  "content": "Sanjeev Bedi | Mechanical and Mechatronics Engineering | University of Waterloo Skip to main content Sanjeev Bedi Professor, NSERC Design Chair and Director IDEAs Clinic Contact information Email: sbedi@uwaterloo.ca Website Sanjeev Bedi Biography summary Sanjeev Bedi is a Professor in the Department of Mechanical and Mechatronics Engineering at the University of Waterloo. He is the founder of the Engineering IDEAs Clinic and the NSERC Chair in Immersive Design Engineering Activities (IDEAs). Professor Bedi leads the 5-Axis Surface Machining Lab and was a former Director of Mechatronics Engineering (06-12). Professor Bedi’s research interests are in flank milling, the development of tool path strategies, the design of NC controllers, 5-axis numerically controlled machining, the modeling of the machining process and the design of NC machines. His research expertise lies in automated polishing, complex curve machining methods, efficient tool path planning, gouge detection and avoidance mechanisms, machined surface evaluation, and surface finish estimation. The 5-axis machine lab is designed to conduct research into 5-axis machining. 5-axis machines are becoming increasingly popular in the industry, however the techniques required to take advantage of the additional flexibility of these machines are still in their infancy. Research interests 5-axis Surface Machining Flank Milling Tool Positioning Methods CNC Controller Design Tool Path Planning Live Model based Controller Paradigms for 5-axis Machining Automotive Ornamental Wood Working Mechatronics Gouge detection and Avoidance Mechanisms Automated Polishing Complex curve Machining Methods: Principle Axis Method (PAM) and Multi-Point Method (MPM) Design of Numerical Control (NC) Machines and Controllers Machined Surface Evaluation Surface Finish Estimation Education 1987, Doctorate, Engineering, University of Victoria, Victoria, BC 1984, Master's, Mechanical Engineering, University of British Columbia, Vancouver, BC 1982, Bachelor's, Mechanical Engineering, Indian Institute of Technology, Kanpur Courses* MTE 100 - Mechatronics EngineeringTaught in 2020, 2021, 2022, 2023, 2024, 2025 MTE 380 - Mechatronics Engineering Design WorkshopTaught in 2024, 2025 MTE 481 - Mechatronics Engineering Design ProjectTaught in 2022, 2023 * Only courses taught in the past 5 years are displayed. Selected/recent publications Kvinevskiy, Ilarion, Bedi, Sanjeev, and Mann, Stephen;, Detecting machine chatter using audio data and machine learning, The International Journal of Advanced Manufacturing Technology, 108, 2020, 3707 - 3716 Sharma, Sandeep Kumar, Duvedi, Ravinder Kumar, Bedi, Sanjeev, and Mann, Stephen, A multipoint tool positioning method for five-axis machining in the region of two intersecting tensor product Bézier surfaces, International Journal of Machine Tools and Manufacture, 142, 2019, 42 - 53 Sharma, Sandeep Kumar, Duvedi, Ravinder Kumar, Bedi, Sanjeev, and Mann, Stephen, A method for generating multiple solutions for multipoint five-axis tool positioning, The International Journal of Advanced Manufacturing Technology, 100(9-12), 2019, 2509 - 2525 Duvedi, R.K. and Bedi, S., and Mann, S., \"An efficient multipoint 5-axis tool positioning method for tensor product surfaces\", IJAMT, 97(1-4): 279-295, 2018. Jawanda, A.S., Batish, A., and Bedi, S., Adaptive ball drop algorithm for toolpath generation of axisymmetric triangulated parts to eliminate overcutting, International Journal of Advanced Manufacturing Technology, 99(1-4), 2018, 461 - 474 Duvedi, R.K. and Bedi, S., and Mann, S., \"Numeric implementation of drop and tilt method of five-axis tool positioning for tensor product surfaces\", IJAMT, 95(1-4): 219-232, 2018. Sood, S., Duvedi, R.K. and Bedi, S., and Mann, S., \"3D representation and CNC machining of 2D digital images\", Procedia Manufacturing, 26: 10-20, 2018. https://doi.org/10.1016/j.promfg.2018.07.001 Duvedi, R.K. and Bedi, S., and Mann, S., \"Drop and tilt method of five-axis tool positioning for tensor product surfaces\", IJAMT, 93(1-4): 617-622, 2017. Hurst, Ada, Rennick, Chris, and Bedi, Sanjeev, A “Lattice” Approach to Design Education: Bringing Real and Integrated Design Experience to the Classroom through Engineering Design Days, Proceedings of the Design Society: International Conference on Engineering Design, The Design Society International Conference on Engineering Design, 2019, 429 - 438 Sharma, Sandeep Kumar, Duvedi, Ravinder Kumar, Bedi, Sanjeev, and Mann, Stephen, Five-Axis Tool Positioning of a Toroidal End Mill Tool Near Common Edge Between Two Intersecting Surfaces, published in proceedings of CAD Conference and Exhibition, CAD Conference and Exhibition, 6 2019, Singapore, 75 - 79Link Sanjeev Bedi, Carol Hulls, Chris Rennick, Mary Robinson, William Melek, “Design of an introductory course which integrates first semester courses”, Proceedings of the Canadian Engineering Education Association (CEEA), 2017. Teertstra, P., and Bedi, S., “Backing up a trailer – An application-based vector analysis project for 2nd year calculus”, Proceedings of the Canadian Engineering Education Association (CEEA), 2017. Rania Al-Hammoud, Ada Hurst, Andrea Prier, Mehrnaz Mostafapour, Chris Rennick, Carol Hulls, Erin Jobidon, Eugene Li, Jason Grove, Sanjeev Bedi, “Teamwork for engineering students: Improving skills through experiential teaching modules”, Proceedings of the Canadian Engineering Education Association (CEEA), 2017. Eugene Li, Chris Rennick, Carol Hulls, Mary Robinson, Michael Cooper-Stachowsky, Eline Boghaert, William Melek, Sanjeev Bedi, “Tron Days: Horizontal Integration and Authentic Learning”, Proc. 2017 Canadian Engineering Education Association (CEEA17) Conference. Ada Hurst, M Mostafapour, R Al-Hammoud, A Prier, E Jobidon, C Rennick, J Grove, E Li, S Bedi, “Practicing What we Preach: A Multi-Disciplinary Team Teaching Multi-Disciplinary Teamwork”, Proc. ASEE 124th Annual Conference and Exposition (Columbus, OH). Warkentin, Andrew, Hoskins, Paul, Ismail, Fathy, and Bedi, Sanjeev, Computer Aided 5-axis Machining, Computer-Aided Design, Engineering, and Manufacturing: Systems Techniques and Applications, Volume I, Systems Techniques and Computational Methods, Leondes, Cornelius T, S. Bedi, “Design of custom footwear”, Leaders of Academics conference, Guadalajara, Mexico, 29 March 2012. S. Bedi, “Bike Design”, Leaders of Academics conference, Guadalajara, Mexico, 29 March 2012. S. Mohamed, F. Mansour, S. Bedi, “Constructing a DC Brushless Motor – an Experiential Engineering Clinic Activity”, 2015 Integrated and Engaged Learning Conference, WLU University, Waterloo. S. Bedi, “Distillation Apparatus and Method”, Provisional US Patent filed. November, 2017. Jon Taylor and S.Bedi, “Arcuate motion apparatus and method”, US9814928B2. S. Bedi, “Life Cycle Design.” Keynote Speech, Intl. Conf. on Powder, Granules and Bulk Solids Innovations and Applications. Thapar University, Patiala, India, Nov. 2013. S. Bedi, “Life Cycle Design.” Keynote Speech, Intl. Conf. on Powder, Granules and Bulk Solids Innovations and Applications. Thapar University, Patiala, India, Nov. 2013. S. Bedi, \"The Entrepreneurial Engineer\", Keynote Speech, General Assembly, OSPE, May 7, 2013. S. Bedi, “Future of Manufacturing in Canada”, Keynote Speech, Waterloo Development Council, April 2013. S. Bedi, \"Future of Engineering Education\", Guest of Honour (Valedictory), the International Conference on \"Powder, Granule and Bulk Solids: Innovations and Applications\", held on Nov 30, 2013 at Thapar University, Patiala, India. S. Bedi, “Custom Orthotic design”, Keynote Address, Sinergia’12, ITESM, Guadalajara, Mexico, Nov 1-3, 2012. S. Bedi, “Mountain Bike Design”, Keynote Address, Sinergia’12, ITESM, Guadalajara, Mexico, Nov 1-3, 2012. S. Bedi, “Life Cycle testing of Bikes”, PEO Brampton Chapter – Keynote speaker, Annual Awards dinner, January 27, 2012. Sanjeev Bedi, Innovation and Academia: Boosting Research and its Commercialization, 11 , Chandigarh, India. In the news A passion for hands-on education Graduate studies Currently considering applications from graduate students. A completed online application is required for admission; start the application process now.",
  "content_length": 8236,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:05"
}