{
  "name": "Sanjay Kumar Bose",
  "homepage": "https://user.plaksha.edu.in/sanjay-bose",
  "status": "success",
  "content": "Sanjay Kumar Bose Sanjay Kumar Bose Qualifications B.Tech (IIT, Kanpur), M.S. & Ph.D. (Stony Brook, USA) Designation Professor Plaksha University, INDIA Email Address sanjay.bose(AT)plaksha.edu.in, skbose(AT)gmail.com, skb(AT)iitk.ac.in Past Associations Professor, Department of EEE, Indian Institute of Technology, Guwahati, India (2009 - 2021) Professor, Department of Electrical Engineering, Indian Institute of Technology, Kanpur, India (1991-2003) Assistant Professor, Department of Electrical Engineering, Indian Institute of Technology, Kanpur, India (1982-1991) Member, Technical Staff, Corporate R & D, General Electric Co. Schenectady, NY, USA Visiting Faculty, University of Adelaide, Adelaide, SA, Australia Visiting Faculty, Queensland University of Technology, Brisbane, Australia Visiting Faculty, University of Pretoria, Pretoria, South Africa Visiting Faculty, Royal Melbourne Institute of Technology, Melbourne, Australia Senior Fellow, Nanyang Technological University, Singapore Associate Professor, School of EEE, NTU, Singapore (2003 - 2009) Dean, Alumni Affairs & External Relations, IIT Guwahati (2011 - 2014) Guest Professor, Soochow University (since January 2015) Areas of Interest Modeling, Simulation and Analysis of Communication Networks Performance of WDM Systems Queuing Networks    QNAT Software Network Applications Multiple Access Schemes Mobile Satellite Systems Communication & Queueing Related Software Development Ph.D. Theses Guided [1] K.K. Islam, \"Digital Protection of EHV/UHV Transmission Line\" [2] B. Venkataramani, \"Queueing Analysis of a Non-preemptive MMPP/D/1/K Priority System for Applications in ATM Networks\" [3] M.V. Vinodkumar, \"A Flow Model Based, Control Theoretic Approach to Dynamic Routing in Some Structured Communication Networks\" [4] T.S. Rao, \"Approximate Modeling of the Call-level Output Process of an ATM Switch\" [5] Vivek Mudgil, \"A Study of QoS based Management of Congestion using Backpressure Mechanism and Call Admission Control in ATM Networks\" [6] Bin Chen, \"Dynamic Traffic Grooming in IP/MPLS over WDM Networks\" [7] Chee Wah Tan, \"Advanced Routing Techniques for Wireless Ad-hoc Networks\" [8] Samar Shailendra, \"Multipath Transport and Flow Division in Multihome Hosts\" [9] Ripudaman Singh, \"Low Delay and Low Energy Contention Based Synchronous MAC Protocols for Event-Driven Wireless Sensor Networks [10] Krishna Pavan Inala. \"Impact of Communication Systems on Distributed Node Voltage and Vehicle to Grid Controller in a Smart Grid Scenario\" [11] Prateek Rathore, \"Network Coding Assisted Multicasting in Multi-Hop Wireless Networks\" [12] Arijit Bhattacharjee, \"Investigation of Certain Issues Related to Development of Next-Generation Broadband Wireless Networks\" Publications & Patents Books Journal Papers Conference Papers Technical Reports Patents In a Lighter Vein ........if you can spare some time for light-hearted stuff!....... Society Memberships Senior Member, IEEE (Chairperson, IEEE Uttar Pradesh Section, 1996, 1997) Member, Sigma Xi Member, Eta Kappa Nu Fellow, IETE (India)",
  "content_length": 3071,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:58"
}