{
  "name": "Sanjay Krishnan",
  "homepage": "http://sanjayk.io",
  "status": "success",
  "content": "Sanjay Krishnan – Data Science Research @ U Chicago Skip to content As humans, we understand that intelligence is inherrently decentralized and collaborative. Effective teams bring together multiple specialized skillsets to solve hard problems. Why can’t computer leverage this same principle? Ongoing Projects Decentralized Prediction. Our group is exploring how nodes on a distributed network can efficiently coordinate to make fast collective decisions. For example, a set of servers deciding whether a cyber-attack is currently happening or a set of robots identifying an object in a room. Effective Data Science Teams. As data science efforts proliferate through every organization, tools are needed to track data movement, data access, and data usage. What makes data science teams more effective? Sustainable AI. How do we assess the carbon footprint of AI models and data science processes? We study how to account for carbon costs when the data “value chains” span multiple organizations and teams. Recent Publications Raul Castro Fernandez, Aaron J. Elmore, Michael J. Franklin, Sanjay Krishnan, Chenhao Tan:How Large Language Models Will Disrupt Data Management. VLDB 2023 Jinjin Zhao, Avigdor Gal, Sanjay Krishnan: Data Makes Better Data Scientists. HILDA@SIGMOD 2023. Tilmon et al.. Sociome Data Commons: A scalable and sustainable platform for investigating the full social context and determinants of health. J Clin Transl Sci. 2023. Ted Shaowang, Nilesh Jain, Dennis D. Matthews, and Sanjay Krishnan. “Declarative data serving: the future of machine learning inference on the edge.” VLDB 2021 pdf Past Selected Publications in Relevant Areas Data Structures for Approximation Bruno Barbarioli, Gabriel Mersy, Stavros Sintos, Sanjay Krishnan. HIRE: Hierarchical Residual Encoding for Multiresolution Compression in Time-Series Data. SIGMOD 2023. Rui Liu, Aaron J. Elmore, Michael J. Franklin, Sanjay Krishnan: Rotary: A Resource Arbitration Framework for Progressive Iterative Analytics. ICDE. 2023. Xi Liang, Stavros Sintos, Zechao Shang, Sanjay Krishnan. Combining Sampling and Aggregation (Nearly) Optimally. SIGMOD 2021 pdf John Paparrizos, Chunwei Liu, Bruno Barbarioli, James Hwang, Ikrudya Edian, Aaron Elmore, Mike Franklin, and Sanjay Krishnan, VergeDB: A Database for IoT Analytics on Edge Devices. CIDR 2021 pdf Xi Liang, Zechao Shang, Aaron J. Elmore, Sanjay Krishnan, Mike Franklin. Fast and Reliable Missing Data Contingency Analysis with Predicate-Constraints. SIGMOD 2020 pdf Zongheng Yang, Eric Liang, Amog Kamsetty, Chenggang Wu, Yan Duan, Xi Chen, Pieter Abbeel, Joseph M. Hellerstein, Sanjay Krishnan, and Ion Stoica. Deep Unsupervised Cardinality Estimation. VLDB 2020. pdf Distributed and Decentralized Systems (Digitial and Human) Shinan Liu, Tarun Mangala, Ted Shaowang, JinJin Zhao, John Paparizzos, Sanjay Krishnan, Nick Feamster. AMIR: Active Multimodal Interaction Recognition from Video and Network Traffic in Connected Environment. Ubicomp 2023. Xi Liang, Stavros Sintos, Sanjay Krishnan: JanusAQP: Efficient Partition Tree Maintenance for Dynamic Approximate Query Processing. ICDE 2023. Rui Liu, Aaron J. Elmore, Michael J. Franklin, Sanjay Krishnan: Rotary: A Resource Arbitration Framework for Progressive Iterative Analytics. ICDE 2023. Siyuan Xia, Zhiru Zhu, Chris Zhu, Jinjin Zhao, Kyle Chard, Aaron Elmore, Ian Foster, Michael Franklin, Sanjay Krishnan, Raul Castro Fernandez. Data Station: Delegated, Trustworthy, and Auditable Computation to Enable Data-Sharing Consortia with a Data Escrow. VLDB 2022 pdf Nalin Ranjan, Zechao Shang, Sanjay Krishnan, and Aaron J. Elmore. “Version Reconciliation for Collaborative Databases.” SoCC 2021 pdf Martin Jaggi, Virginia Smith, Martin Takác, Jonathan Terhorst, Sanjay Krishnan, Thomas Hofmann, and Michael I. Jordan. Communication-efficient distributed dual coordinate ascent. NeurIPS 2014. pdf Sanjay Krishnan, Jay Patel, Michael J. Franklin, and Ken Goldberg. Social Influence Bias in Recommender Systems: A Methodology for Learning, Analyzing, and Mitigating Bias in Ratings. Under Review: ACM Conference on Recommender Systems (RecSys). Foster City, CA, USA. Oct 2014 (pdf) Machine Learning Applications Tilmon S, Nyenhuis S, Solomonides A, Barbarioli B, Bhargava A, Birz S, Bouzein K, Cardenas C, Carlson B, Cohen E, Dillon E, Furner B, Huang Z, Johnson J, Krishnan N, Lazenby K, Li K, Makhni S, Miler D, Ozik J, Santos C, Sleiman M, Solway J, Krishnan S, Volchenboum S. Sociome Data Commons: A scalable and sustainable platform for investigating the full social context and determinants of health. J Clin Transl Sci. 2023. Vanlin Sathya, Adam Dziedzic, Monisha Ghosh, and Sanjay Krishnan. Machine Learning based detection of multiple Wi-Fi BSSs for LTE-U CSAT. ICNC 2020 pdf Adam Dziedzic, John Paparrizos, Sanjay Krishnan, Aaron Elmore, and Michael Franklin. Band-limited training and inference for convolutional neural networks. ICML 2019. pdf Sanjay Krishnan, Zongheng Yang, Keng Goldberg, Joe Hellerstein, and Ion Stoica. Learning to Optimize Join Queries with Deep Reinforcement Learning. 2018. pdf Roy Fox, Richard Shin, Sanjay Krishnan, Ken Goldberg, Dawn Song, and Ion Stoica. Parametrized hierarchical procedures for neural programming. ICLR 2018. Roy Fox, Sanjay Krishnan, Ion Stoica, and Ken Goldberg. Multi-level discovery of deep options. 2017.",
  "content_length": 5360,
  "method": "requests",
  "crawl_time": "2025-12-01 14:23:58"
}