{
  "name": "Sanjukta Krishnagopal",
  "homepage": "https://cs.ucsb.edu/people/faculty/sanjukta-krishnagopal",
  "status": "success",
  "content": "Sanjukta Krishnagopal | UCSB Computer Science Sanjukta Krishnagopal Assistant Professor sanjukta@ucsb.edu 2123 Harold Frank Hall Networks Lab Education Ph.D Physics, University of Maryland, College Park Off-Campus Affiliations UCLA Applied Math Research Areas Algorithms and Theory Computational Science and Engineering Human Centered and Social Computing Machine Learning and Data Mining Bio Sanjukta's research interests are multidisciplinary, with the goal of developing computational and mathematical tools to answer questions about real world physical, social, and biological systems. She received her PhD from the University of Maryland, College Park. She was a UC Presidential postdoc with a joint appointment at UC Berkeley and UCLA. She enjoys traveling and has lived on four continents. In her free time she enjoys dance, art, hiking, and attempting to climb mountains. Research Sanjukta's research involves using multidisciplinary insight to develop methods and theory for studying data-driven systems. Her research involves a combination of computational models, mathematical insight, and method-development. A direction of her research is in the study of networks - (1)  modeling complex and interactive social and biological systems as networks, (2) understanding how the structure and properties of a graph can be useful for graph-based machine learning, and (3) developing algorithms for the analysis of time-evolving graphs and hypergraphs. Another direction of her research is in computational social science, and asking questions about how political ideas spread in society, how hate speech snowballs in online content, the behaviors that underlie self organization, and questions about fairness in society. Finally, she is interested in developing a rigorous understanding of machine learning for physical systems (e.g. ocean waves, or climate) that have their own dynamics and behavior. In such tasks, she is interested in questions about how the underlying dynamical system is captured by the machine learning model, how physics-informed models can be developed to harness the dynamics, and how  geometric and topological structure in the data is captured by the model for generalized machine learning.",
  "content_length": 2224,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:07"
}