{
  "name": "Sanjeev Baskiyar",
  "homepage": "http://www.eng.auburn.edu/~baskiyar",
  "status": "success",
  "content": "Dr. Sanjeev Baskiyar's page Sanjeev Baskiyar Professor Computer Science & Software Eng. 3127C Shelby Technology Center 345 Magnolia Ave W. Auburn University, Auburn, AL 36849 Voice: (334)-844-6306 Fax:     (334)-844-6329 <mylastname><at>eng<dot>auburn<dot>edu Sanjeev Baskiyar received the PhD and MSEE degrees (major: Electrical (Computer) Engineering, minor: Computer Science) from the University of Minnesota, Twin Cities (Minneapolis), in 1993 and 1988 respectively and the BE (Electronics and Communications) degree from the Indian Institute of Science, Bangalore in 1984.  He received the BS degree in Physics with honors and distinction in Mathematics in 1981.  He was a recipient of several competitive national and state-merit scholarships.  His academic record has been in the top decile.  He has taught courses in the areas of Real-time and Embedded Computing, Computer Architecture, Operating Systems, Microprocessor Programming and Interfacing and VLSI Design.   His experience includes working as an Assistant Professor at Western Michigan University, as a Senior Software Engineer in Unisys Corporation, and Computer Engineer in Tata Motors, India.   Dr. Baskiyars research has been supported by grants from the National Science Foundation, DARPA/AFRL, NASA/MSGC, Wind-River Systems and Mentor Graphics. Specialty Areas Computer Systems:  Scheduling, Real-time and Embedded Computing, Storage, Computer Architecture, STEM education, Fog and Cloud Computing, Machine Learning in Scheduling, Quantum computing applications. Academic Honors and Awards 1. Walker Teaching Excellence Award, Auburn University, Auburn, AL, 2020 2. Summer Faculty Fellow, Air Force Research Labs, Rome, NY, 2020 3. Nominated Best Teaching Assistant, ECE dept., Univ. of Minnesota, 1992 4. Merit Scholarship, Indian Institute of Science, Bangalore, 1982-1983 5. Merit Scholarship, Indian Institute of Science, Bangalore, 1983-1984 6. Honors in Physics 7. Distinction in Mathematics 8. State-merit scholarship 9. State-merit scholarship Research Projects 1. Resource and energy aware scheduling: This goal of this project is to develop and evaluate schedules for embedded systems, multi-core computers, clusters, and grids.  The target is to develop adaptable and scalable schedules that are resource aware (memory, computational power) as well as energy and thermal conscious. 2. Real-time micro-architecture:  This project investigates the use of secondary bus between cache and memory to develop better micro-architectures.    It also investigates the use of wireless technology to develop better fault tolerance and cache coherence techniques.  It involves performance analysis and hardware design. 3. Storage architecture:  This project investigates novel data and meta-data organization within disks, disk-clusters and flash drives for better timing, energy, fault tolerance and wear. 4. Education: This project involves development of concept graphs and cartoon strips for computer science education. Funding Sources Graduate students supervised, their degrees completed and their employments 1. Chen Zhang, MS, Software Engineer, Wells Fargo, NY, NY 2. Meghanathan Natarajan, MS; UT, Dallas Assistant Professor; Associate; Full Professor, Jackson State Univ., MS 3. Arun Kannan, MS, Mentor Graphics, FL 4. Kiran Palli, MS, Intel Corporation, CA 5. Prashanth C. Ranga,  PhD, Assistant Professor, University of Windsor, Toronto 6. Rabab Abdel-Kader, PhD, Assistant Professor, Port Said University, Egypt 7. Chiao Huang, Taiwan Energy, Taiwan. 8. Rakshith Venkatesh, Oracle, CA 9. Cong Liu, MS, ->PhD, Univ. of NC, Chapel Hill -Assistant Professor, Univ. of TX, Dallas. 10. Yong-won Park, MS, PhD student, Auburn University. 11. Christopher Dickinson, MS, Entergy. 12. Sudhakar Jonnalgadda, Oracle, CA. 13. Ahmed Owian, BS (Honors thesis)->MS Univ. of Memphis, Sr. Programmer/Analyst, FedEx,Memphis. 14. Sreekanth Boga, MS, Embedded Systems Engineer, Qualcomm, CA. 15. Yong-Won Park, PhD, Managing Researcher, Samsung S1 (Security) 16. Karthik Vemula, MS, InfoTech, Gainesville, FL. 17. Chengjun Wang, PhD, Assistant Professor, Vermont Tech, VT. 18. John OFarrell, PhD, Science Applications International Corporation (SAIC), Huntsville, AL. 19. Adarsh Jain, MS, VmWare, Atlanta, GA. 20. Swathi Bathula, Intel Corporation, Oregon. 21. Sankari S. Anupindi, PhD, Blackhawk Networks, Phoenix, AZ. 22. Pavan Ravi Teja-Uppu, MS, AMD, Santa Clara, CA 23. Sameul Haque, MS, Alpha Corporation, AL 24. Shehenaz Shaik, PhD, Auburn University, AL 25. Bobby Sharp, BS, Dynetics, Huntsville, AL 26. Harika Kilari, MS, Qualcomm, San Diego, CA 27. Vibudh Mishra, MS, Software Development Lead, Morris Group, Montgomery 28. Varun Deep, MS 29. Ziyan Tian, MS, Summer Intern, Corus, Florida 30. Ziyan Tian, PhD, Auburn University Research Milestones 1. Design and evaluation of an efficient novel proactive thermal aware CPU scheduling 2. Design and evaluation of an interface to flash to merge writes that double its lifetime. 3. Design and evaluation of a disk-cache partition to determine the best split 4. First use and evaluation of Support Vector machine to schedule tasks on clusters/grids. 5. Proposal of an intra-body network for medical uses 6. Proposal and proof of an optimal energy efficient rate monotonic algorithm 7. Design and evaluation of path from write-back buffer to main memory, which significantly enhances processor real-time performance. 8. Design of intra-chip wireless communication to enhance computer architectures. 9. Identification and proof NP-completeness of the fundamental task in-tree scheduling problem on completely connected multiprocessors 10. Design and development of optimal schedules on a very wide set of restricted task in-trees on multiprocessors 11. Definition of the object-invocation graph in program decomposition and partitioning on multiprocessors for efficient execution 12. Design and development of an O(n3p) heuristic yielding optimal/very near-optimal schedule lengths for thousands of random and benchmark directed a-cyclic task graphs on homogeneous multiprocessors 13. Design and development of one of the fastest dynamic method resolution techniques for pure object-oriented programs that is usable for reentrant programs 14. Development of scheduling libraries 15. Development of windows based interactive complete Smith Chart Selected Refereed Full-Length Papers in Refereed Journals & Conferences (Penultimate versions of a few papers are being placed here for timely research dissemination.  The copyright rests with the publisher) Link to my Google Scholar Citations page Link to my LinkedIn page (A * next to the name refers to graduate student supervised) 1. Z. Zhang*, A. Das*, M. Rahgouy*, Y. Bao* and S. Baskiyar, Multi-Label Classification of CS Papers Using Natural Language Processing Models, Proceedings of the IEEE International Conference on Machine Learning and Applications, pp. 1901-1906, Jacksonville, Florida, 2023, IEEE. 2. Z. Zhang*, L. Xu*, Y. Bao*, and S. Baskiyar, Towards the Diagnosis of Heart Disease Using an Ensemble Learning Approach, Proceedings of the IEEE International Conference on Machine Learning and Applications, pp 1061-1069, Jacksonville, pp. 1901-1907, Florida, 2023, IEEE. 3.     S. Shaik*, J. Hall*, C. Johnson*, Q. Wang*, R. Sharp*, and S. Baskiyar, PFogSim: A Simulator for Evaluation of Mobile and Hierarchical Fog Computing, Sustainable Computing: Informatics and Systems, vol. 35, 100736, Elsevier, 2022. 4. S. Shaik* and S. Baskiyar, Distributed service placement in hierarchical fog environments, Sustainable Computing: Informatics and Systems, vol 34, 100744, Elsevier, 2022. 5. Z. Tian* and S. Baskiyar, Fake News Detection: A Quantum Perspective,  Proc. of the 7th International Conference on Advances in Computing & Communication Engineering, LA, 2021 6. Z. Tian* and S. Baskiyar, Fake news detection: an application of quantum k-nearest neighbors, IEEE Symposium Series on Computational Intelligence (SSCI), pp 1-6,  Dec. 2021 7. Z. Tian* and S. Baskiyar, Fake News Detection using Machine Learning with Feature Selection, 6th International Conference on Computing, Communication and Security (ICCCS), pp 1-6, 2021, IEEE. 8. S. Shaik* and S. Baskiyar, A scalable approach to service placement in fog/cloud environments, IEEE International Performance, Computing, and Communications Conference (IPCCC), pp 1-8, 2021, IEEE 9.     Y.w. Park*, H. Kilari* and S. Baskiyar,  Clustered Particle Swarm Optimization using Self-Organizing Maps, International Journal of Computers and Applications, vol 28, no. 2, pp. 115-120, Acta Press, June 2021. 10.  S. Shaik* and S. Baskiyar, Hierarchical and Autonomous Fog Architecture, Proc of the 47th International Conference on Parallel Processing, pp 1-8, 2018, Eugene, OR. https://doi.org/10.1145/3229710.3229740 11.  S. Shaik* and S. Baskiyar, Resource and Service Management in Fog Computing, Proc. of  the 47th International Conference on Parallel Processing Poster Session, Eugene, OR, 2018. 12.  S. Shaik* and S. Baskiyar, Network-Aware Service Pricing Approach for Fog Infrastructure as a Service, Proc of the 3rd Smart Cloud Conference, pp. 202-207, NY, NY, 2018 13.S. Shaik* and S. Baskiyar, Resource and Service Management for Fog Infrastructure as a Service, Proc of IEEE International Conference on Smart Cloud, pp 64-69, NY, NY, 2018. 14.  S. Shaik* and S. Baskiyar, Fog Infrastructure and Service Management, 9th International Green and Sustainable Computing Conference (IGSC), pp. 1-2, 2018. 15.   Y.w. Park* and S. Baskiyar, Adaptive Scheduling in heterogeneous systems using Support Vector Machines, Computing, Springer, DOI 10.1007/s00607-016-0513-x,  2016.  PDF 16.   S. Baskiyar, C.-C. Huang*, and T.-Y. Tam, Minimum energy consumption for rate monotonic scheduled tasks, Computing, Springer, 2015 (24 pages) DOI 10.1007/s00607-015-0475-4. PDF 17.   J. W. OFarrell* and S. Baskiyar, Enhanced real-time performanc",
  "content_length": 23738,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:05"
}