{
  "name": "Sanjay Ranka",
  "homepage": "https://www.cise.ufl.edu/people/faculty/ranka",
  "status": "success",
  "content": "Ranka Named UF Distinguished Professor - Department of Computer & Information Science & Engineering After many years devoted to teaching and research at the University of Florida, Sanjay Ranka, Ph.D., was recently named a Distinguished Professor. Dr. Ranka is the second person in the UF Department of Computer & Information Science & Engineering (CISE) to receive the distinction. The title of Distinguished Professor at the University of Florida is a rare honor given to those with exceptional records of teaching and research. “Dr. Ranka’s promotion to Distinguished Professor is well deserved. He has been outstanding in his research, teaching and service,” said Juan E. Gilbert, Ph.D., the Banks Family Preeminence Endowed Professor and chair of the CISE department. “His research in machine learning has had quite an impact locally.” Dr. Ranka’s research is on developing algorithms and software using Machine Learning, the Internet of Things, GPU Computing and Cloud Computing for solving applications in Transportation and Health Care. The focus of his current research is the development of efficient computational methods and data analysis techniques to model scientific phenomenon. Practical applications of his research are to improve the quality of healthcare and reduce traffic accidents. In 2019, Dr. Ranka was awarded a $2 million grant from the National Science Foundation to develop technology that will monitor high-risk intersections in Gainesville, Fla., to make roadways safer. He earned his Ph.D. in computer science from the University of Minnesota and a B. Tech. in computer science from IIT, Kanpur, India. He has co-authored one book, four monographs, 300-plus journal and refereed conference articles. He is an IEEE Fellow, an AAAS Fellow, an Asia-Pacific Artificial Intelligence Association Fellow, and a past member of IFIP Committee on System Modeling and Optimization. In 2020, he received the IEEE Technical Committee on Cloud Computing Impact Award. He is an associate Editor-in-Chief of the Journal of Parallel and Distributed Computing and an associate editor for ACM Computing Surveys, IEEE/ACM Transactions on Computational Biology and Bioinformatics, Sustainable Computing: Systems and Informatics, Knowledge and Information Systems, and International Journal of Computing. For more information about Dr. Ranka, visit his website. Search Submit",
  "content_length": 2383,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:05"
}