{
  "name": "Sanjeev Khanna",
  "homepage": "http://www.cis.upenn.edu/~sanjeev",
  "status": "success",
  "content": "Sanjeev Khanna Sanjeev Khanna Henry Salvatori Professor of Computer and Information Science University of Pennsylvania Address: Room 419, Amy Gutmann Hall 3333 Chestnut Street, Philadelphia, PA 19104. Email: Moving to NYU As of January 2026, I will be joining NYU as a Professor in the Department of Computer Science at the Courant Institute School of Mathematics, Computing, and Data Science. Prospective students and others are welcome to reach me at my new email: Research Interests My primary research interests are in the design and analysis of algorithms for combinatorial optimization and in complexity theory. My research has been supported by National Science Foundation, an Alfred P. Sloan Fellowship, and a Guggenheim Fellowship. Professional Activities Program Committees: STOC 2023, FSTTCS 2021, STOC 2020, EC 2018, HALG 2018, APPROX 2017, NETECON 2017, ITCS 2016, STOC 2015, SODA 2013 (Program Chair), EC 2012, STOC 2012, FSTTCS 2011, ICS 2011, COCOON 2010, ICS 2010, SODA 2010, ICDT 2009, SODA 2007, APPROX 2004 (Program Chair), STOC 2003, APPROX 2002, SODA 2002, STOC 2000, APPROX 2000, SWAT 1998. I serve on the Editorial board of Journal of the ACM (JACM) and Foundations and Trends in Theoretical Computer Science. I have previously served on the editorial boards of SICOMP, ACM TALG, Algorithmica, JCSS, and as an area editor for Encyclopaedia of Algorithms. Publications Some of my papers. Current and Past Students Ashwin Padaki Krish Singal Junkai Song Nathan White Huan Li Prathamesh Patil Yu Chen (National University of Singapore) Sepehr Assadi (University of Waterloo) Yang Li (Facebook) Sudeepa Roy (Duke University) Tanmoy Chakraborty (Facebook) Anand Bhalgat (Google) Stanislav Angelov (Google) Wang-Chiew Tan (Facebook) Postdocs Supervised Grigory Yaroslavtsev (George Mason University) Deeparnab Chakrabarty (Dartmouth College) Julia Chuzhoy (Toyota Technological Institute, Chicago)",
  "content_length": 1915,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:05"
}