{
  "name": "Sanjib Sur 0001",
  "homepage": "https://cse.sc.edu/~sur",
  "status": "success",
  "content": "Sanjib Sur@University of South Carolina Sanjib Sur Assistant Professor, Computer Science and Engineering University of South Carolina Office: 2259 Storey Innovation Center 550 Assembly St, Columbia, SC 29201 Email: sur@cse.sc.edu I am an Assistant Professor in the Computer Science and Engineering department at the University of South Carolina. My research interests include Wireless Systems and Architectures, Millimeter-wave Communications and Networks, Internet of Things Connectivity and Sensing Systems. I received my Ph.D. in Computer Engineering from the University of Wisconsin-Madison, where the Electrical and Computer Engineering department nominated me for the Wisconsin Distinguished Graduate Fellowship for outstanding graduate work. Before that, I received my Bachelor's degree in Computer Science and Engineering from the Bengal Engineering and Science University, India, where I earned the President of India gold medal. I am looking for prospective students to join my research group. Send me an email if you are interested. Recent News: March 2022 Received the NSF CAREER Award. NSF's most prestigious award in support of junior faculty who exemplify the role of teacher-scholars through outstanding research, excellent education, and the integration of education and research. 🏆 Best Poster Runner-up Award at HotMobile'22 for work on Drone-based survey of millimeter-wave propagation, presented by Ian C. McDowell and Rahul Bulusu. 🏆 Best Poster Honorable Mention (Second Place) at UbiComp'21 for work on handheld millimeter-wave imaging, presented by Jacqueline M. Schellberg. January 2022 2 posters accepted in ACM HotMobile'22. Undergraduate research student Jacqueline M Schellberg wins the MTT-S Undergraduate Scholarships, 2022 December 2021 Argus paper accepted in ACM SIGMETRICS'22: A first-of-its-kind machine-learning framework for robust millimeter-wave indoor network deployment. Awarded Magellan Grant together with undergraduate research students Ian C. McDowell and Rahul Bulusu. Awarded Magellan Grant together with undergraduate research student Edward Sitar. July 2021 SquiggleMilli paper accepted in ACM IMWUT'21: A first-of-its-kind machine-learning augmented handheld SAR imaging with a squiggle motion of mobile millimeter-wave devices. 3 posters accepted in ACM UbiComp'21. Apr. 2021 mmFlow paper is accepted by SECON'21. Awarded an REU grant on NSF #1910853. Granted US Patent 10,972,155. Mar. 2021 🏆 Best Poster Award at HotMobile'21 for early work on visual map and machine learning aided 5G picocell placement, presented by Timothy Dayne Hooks. 🏆 Best Poster Runner-up Award at HotMobile'21 for early work on machine learning augmented hand-held millimeter-wave imaging, presented by Hem Regmi. Jan. 2021 3 posters accepted in ACM HotMobile'21. [ More News ... ] Selected Publications: Argus: Predictable Millimeter-Wave Picocells with Vision and Learning Augmentation Hem Regmi, Sanjib Sur SIGMETRICS'22 Proceedings of the ACM International Conference on Measurement and Modeling of Computer Systems, Mumbai, India, June 2022 [ Paper ] [ Talk ] SquiggleMilli: Approximating SAR Imaging on Mobile Millimeter-Wave Devices Hem Regmi, Moh Sabbir Saadat, Sanjib Sur, Srihari Nelakuditi IMWUT'21 Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, Virtual, September 2021 [ Paper ] [ Talk ] mmFlow: Facilitating At-Home Spirometry with 5G Smart Devices Aakriti Adhikari, Austin Hetherington, Sanjib Sur SECON'21 IEEE International Conference on Sensing, Communication and Networking, Virtual, July 2021 [ Paper ] [ Talk ] A Case for Temperature-Aware Scheduler for Millimeter-Wave Devices and Networks Moh Sabbir Saadat, Sanjib Sur, Srihari Nelakuditi ICNP'20 The 28th IEEE International Conference on Network Protocols, Madrid, Spain, October 2020 [ Paper ] [ 1-minute video ] [ Talk ] Towards Scalable and Ubiquitous Millimeter-Wave Wireless Networks Sanjib Sur, Ioannis Pefkianakis, Xinyu Zhang, Kyu-Han Kim MobiCom'18 ACM International Conference on Mobile Computing and Networking, New Delhi, India, Oct 2018 [ Paper ] [ Talk (starts at 31:19) ] [ Full List ] Services: TPC: ACM mmNets'19 to '21, IEEE MSN'21, ACM WiNTECH'19 to '21, IEEE MASS'21, IEEE ICDCS'21, IEEE WoWMoM'21, IEEE IFIP Networking'21, IEEE STEERS'21, IEEE WSCE'19, ACM Mobicom S3'17 Chair/co-chair: ACM mmNets'20 co-chair, ACM MobiSys'22 Demo ACM SenSys'22 Publicity Panelist: ACM MobiCom S3 workshop, 2018 Reviewer: Book proposals at Springer Nature, 2018, IEEE Transactions on Mobile Computing, IEEE/ACM Transactions on Networking, IEEE Transactions on Communications, IEEE Transactions on Vehicular Technology, IEEE Transactions on Network and Service Management, IEEE Transactions on Dependable and Secure Computing, IEEE Wireless Communications Letters, IEEE Transactions on Network Science and Engineering, IEEE Systems Journal, ACM Transactions on Sensor Networks, Elsevier Pervasive and Mobile Computing, EURASIP Journal on Wireless Communications and Networking, MDPI Open Access - Energies, MDPI Open Access - Information, IEEE Access, IEEE Journal on Selected Areas in Communications CV: My CV is available here.",
  "content_length": 5173,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:06"
}