{
  "name": "Sanjay Purushotham",
  "homepage": "https://sanjayp.is.umbc.edu",
  "status": "success",
  "content": "Sanjay Purushotham Sanjay Purushotham is an Assistant Professor in the Department of Information Systems at the University of Maryland Baltimore County (UMBC). His research interests are in machine learning, data mining, optimization theory, statistics, computer vision and its applications to biomedical informatics, social network analysis and multimedia data mining. Before joining UMBC, he was a Postdoctoral Scholar Research Associate in the Department of Computer Science and Integrated Media Systems Center (IMSC) at the University of Southern California (USC), where he was mentored by Prof. Yan Liu and Prof. Cyrus Shahabi. He obtained his PhD in Electrical Engineering from USC under the supervision of Prof. C.-C. Jay Kuo in the Media Communications Labs (MCL). News December 2022: Paper to appear at SDM 2023 : Multi-state Survival Analysis using Pseudo value-based Deep Neural Networks November 2022: Paper at SIGSPATIAL 2022 : VDAM: VAE based domain adaptation for cloud property retrieval from multi-satellite data May 2022: Paper at KDD 2022 : Fair and interpretable models for survival analysis June 2022: Paper at KDD DSHealth 2022 : FedPseudo: Pseudo value-based Deep Learning Models for Federated Survival Analysis June 2022: Paper at KDD DSHealth 2022 : Pseudo value-based Deep Neural Networks for Multistate Survival Analysis June 2022: Paper at ICML 2022: The 1st Workshop on Healthcare AI and COVID-19 : Thermal Face Contrastive GAN (TFC-GAN): A Framework For Visible-to-Thermal Face Translation January 2022: Journal paper in Computer and Geosciences : A review of Earth Artificial Intelligence December 2021: Paper at SPIE 2022: Benchmarking domain adaptation for semantic segmentation December 2021: Paper at AAAI 2022 - Trustworthy AI for Healthcare workshop: A Pseudo Value Based Interpretable Neural Additive Model for Survival Analysis November 2021: AAAI Fall Symposium Series paper: PseudoNAM: A pseudo value based interpretable neural additive model for survival analysis October 2021: NeurIPS 2021 paper - Intelligent Sight and Sound: A Chronic Cancer Facial Pain Dataset August 2021: Journal paper in Nature Scientific Reports: MedFuseNet: Attention-based Multimodal deep learning model for Visual Question Answering in the Medical Domain May 2021: Conference paper at IEEE ICIP 2021: Generating Thermal Human Faces for Physiological Assessment using Thermal Sensor Auxiliary Labels Feb. 2021: Paper at ISMRM 2021 Annual Meeting : Improved Outcome prediction in mild Traumatic Brain Injury using Latent Feature Extraction from Volumetric MRI December 2020: Paper at AAAI 2021 : DeepPseudo: Pseudo Value Based Deep Learning Models for Competing Risk Analysis October 2020: Paper at IEEE BigData 2020 : Deep Domain Adaptation based Cloud Type Detection using Active and Passive Satellite Data September 2020: Paper at AAAI Fall Symposium Series 2020 : The Use of AI for Thermal Emotion Recognition: A Review of Problems and Limitations in Standard Design and Data July 2020: Paper at KDD 2020 DS Health : Deep Learning for Competing Risk Analysis July 2020: Covid-19 Paper at KDD 2020 epiDAMIK workshop :Exploratory analysis of covid-19 tweets July 2020: Paper at KDD 2020 DeepSpatial workshop : Deep Multi-Sensor Domain Adaptation Feburary 2020: Paper at WSDM 2020 Health Day Explainable Methods for Visual Question Answering in Medical Domain Selected Publications (Full publications at Google Scholar) Neural Interaction Transparency (NIT): Disentangling Learned Interactions for Improved Interpretability Michael Tsang, Hanpeng Liu, Sanjay Purushotham, Pavankumar Murali and Yan Liu Neural Information Processing Systems (NIPS 2018) Hierarchical Deep Generative Models for Multi-Rate Multivariate Time Series Zhengping Che*, Sanjay Purushotham*, Guangyu Li*, Bo Jiang, and Yan Liu International Conference on Machine Learning (ICML 2018) (*Co-first authors) Recurrent Neural Networks for Multivariate Time Series with Missing Values Zhengping Che, Sanjay Purushotham, Kyunghyun Cho, David Sontag and Yan Liu Nature Scientific Reports, 2018 Benchmarking Deep Learning Models on Large Healthcare Datasets Sanjay Purushotham, Chuizheng Meng, Zhengping Che, and Yan Liu Journal of Biomedical Informatics, 2018 (JBI 2018) Association of tumor differentiation grade and survival of women with squamous cell carcinoma of the uterine cervix Koji Matsuo, Rachel S Mandelbaum, Hiroko Machida, Sanjay Purushotham, Brendan H Grubbs, Lynda D Roman and Jason D Wright Journal of Gynecologic Oncology, 2018 (JGO 2018) Deep Multi-Instance Learning for Concept Annotation from Medical Time Series Data Sanjay Purushotham, Zhengping Che, Bo Jiang, Yan Liu NIPS Machine Learning for Health Workshop, 2017 (NIPS ML4H 2017) Variational Recurrent Adversarial Deep Domain Adaptation Sanjay Purushotham*, Wilka Carvalho*, Tanachat Nilanon and Yan Liu International Conference on Learning Representations (ICLR 2017) (*Co-first authors) Measuring and Predicting Tag Importance for Image Retrieval Shangwen Li, Sanjay Purushotham, Chen Chen, Yuzhuo Ren and C.-C. Jay Kuo IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2017 A Pilot Study in using Deep-learning to Predict limited Life-expectancy in Women with Recurrent Cervical Cancer Koji Matsuo, Sanjay Purushotham, Aida Moeini, Guangyu Li, Hiroko Machida, Yan Liu and Lynda D Roman American Journal of Obstetrics and Gynecology (AJOG), 2017 Time-series Feature Learning with Applications to Healthcare Domain (Book Chapter) Zhengping Che, Sanjay Purushotham, David Kale, Wenzhe Li, Mohammad Taha Bahadori, Robinder Khemani and Yan Liu Mobile Health: Sensors, Analytic Methods, and Applications, 2017 Mining Human Mobility to Quantify Performance Status Minh Nguyen, Zaki Hasnain, Sanjay Purushotham, Luciano Nocera, Paul Newton and Cyrus Shahabi IEEE International Conference on Data Mining (ICDM 2017) Personalized Group Recommender Systems for Location and Event Based Social Networks Sanjay Purushotham and C.-C.Jay Kuo ACM Transactions on Spatial Algorithms and Systems (TSAS), 2016 Variational Adversarial Deep Domain Adaptation for Healthcare Time Series Analysis Sanjay Purushotham, Wilka Carvalho and Yan Liu NIPS Machine Learning for Healthcare Workshop (NIPS 2016) m-TSNE: A Framework for Visualizing High-Dimensional Multivariate Time Series Minh Nguyen, Sanjay Purushotham, Hien To and Cyrus Shahabi AMIA 2016 Workshop on Visual Analytics in Healthcare (AMIA 2016) Interpretable Deep Models for ICU Outcome Prediction Zhengping Che, Sanjay Purushotham, Robinder Khemani, and Yan Liu Proceedings of the American Medical Informatics Assocation Annual Symposium, 2016 (AMIA 2016) Normal / Abnormal Heart Sound Recordings Classification Using Deep Recurrent Neural Network Tanachat Nilanon, Sanjay Purushotham and Yan Liu Proceedings of the Computing in Cardiology, 2016 (CinC 2016) Distilling Knowledge from Deep Networks with Applications to Computational Phenotyping Zhengping Che, Sanjay Purushotham and Yan Liu Data Science Learning and Applications to Biomedical and Health Sciences Workshop, New York Academy of Sciences, 2016 Distilling Knowledge from Deep Networks with Applications to Healthcare Domain Zhengping Che, Sanjay Purushotham and Yan Liu arXiv preprint arXiv:1512.03542, 2015 (extended paper of NIPS-MLHC 2015) Knowledge Based Factorized High Order Sparse Learning Models Sanjay Purushotham, Martin Renqiang Min, C.-C. Jay Kuo and Mark Gerstein NIPS 2015, Machine Learning in Computational Biology (MLCB) Workshop, Montreal, Canada, 2015 (NIPS 2015) Distilling Knowledge from Deep Networks with Applications to Phenotype Discovery Zhengping Che, Sanjay Purushotham and Yan Liu NIPS 2015 Workshop on Machine Learning in Healthcare (MLHC), Montreal, Canada, 2015 (NIPS 2015) Efficient Spatio-Temporal Sampling via Low-rank Tensor Sketching Qi (Rose) Yu, Sanjay Purushotham and Yan Liu NIPS Time Series Workshop 2015, Montreal, Canada, 2015 (NIPS 2015) Modeling Group Dynamics for Personalized Group-Event Recommendation Sanjay Purushotham and C.-C. Jay Kuo 2015 International Conference on Social Computing, Behavioral-Cultural Modeling, & Prediction, Washington DC, USA, 2015 (SBP 2015) Studying User Influence in Personalized Group Recommenders in Location Based Social Networks Sanjay Purushotham and C.-C. Jay Kuo NIPS 2014, Personalization: Methods and Applications Workshop, Montreal, Canada, 2014 (NIPS 2014) Collaborative Group-Activity Recommendation in Location-Based Social Networks Sanjay Purushotham, Junaith Shahabdeen, Lama Nachman and C.-C. Jay Kuo 3rd ACM SIGSPATIAL GeoCrowd, Dallas, Texas, USA, 2014 (SIGSPATIAL 2014) (Best Paper Award) Factorized Sparse Learning Models with Interpretable High Order Feature Interactions Sanjay Purushotham, Martin Renqiang Min, C.-C. Jay Kuo, Rachel Ostroff 20th ACM SIGKDD International Conference on Knowledge Discovery and Data mining, New York, USA, 2014 (KDD 2014) Collaborative Topic Regression with Social Matrix Factorization for Recommendation Systems Sanjay Purushotham, Yan Liu and C.-C. Jay Kuo 29th International Conference on Machine Learning, Edinburgh, Scotland, 2012 (ICML 2012) Hierarchical Bag-of-Words Model for Joint Multi-View Object Representation and Classification Xiang Fu, Sanjay Purushotham, Daru Xu, Jian Li and C.-C. Jay Kuo APSIPA Annual Summit & Conference, Hollywood, USA, 2012 (APSIPA 2012) Picture-in-Picture Copy Detection Using Spatial Coding Techniques Sanjay Purushotham, Qi Tian and C.-C. Jay Kuo ACM Multimedia, AIEMPro Workshop, Scottsdale, Arizona, USA, 2011 (ACM MM 2011) Video Genre Inference based on Camera Capturing Models, (Book Chapter) Ping-Hao Wu, Sanjay Purushotham and C.-C. Jay Kuo Chapter 7 in Video Search and Mining, Studies in Computational Intelligence, Vol. 287/2010 Separation of Professional and Amateur Video in Large Video Collections Ping-Hao Wu, Tanaphol Thaipanich, Sanjay Purushotham and C.-C. Jay Kuo IEEE Pacific-Rim Conf. on Multimedia, Bangkok, Thailand, D",
  "content_length": 13061,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:02"
}