{
  "name": "Sanjiva Prasad",
  "homepage": "http://www.cse.iitd.ernet.in/~sanjiva",
  "status": "success",
  "content": "Sanjiva Prasad My research interests are in the broad area of Formal Methods: programming languages and their semantics; concurrency theory; verification; proof theory; mobile computation; formal foundations of networks, including IoT and SDN; security, especially in information flow; formal models for reconfigurable architectures. I have also some work in systems biology, computational biology, and medical applications of computing. I take a broad approach to programming language issues. Some of the areas I have explored and in which I have guided students include security and integrity of information; ``Eco-Design’’ and architectures for information representation; phonetic encodings of text; IDEs and the interaction with context; working in resource-challenged scenarios; reasoning about system execution beyond programmer control. Learn More Professional Profile Education Ph.D. Computer Science, SUNY Stony Brook, 1991. M.S. Computer Science, SUNY Stony Brook, 1990. B. Tech. Computer Science & Engineering, IIT Kanpur, 1985. Experience Head of Department, Computer Science and Engineering, IIT Delhi. 2018-2021. Professor, Computer Science & Engineering, IIT Delhi. 2006-present. Coordinator, Amar Nath and Shashi Khosla School of Information Technology, IIT Delhi. 2011-2015. Associate Professor, Computer Science & Engineering, IIT Delhi. 2000-2006. Visiting Lektor, BRICS/DAIMI, Aarhus University, Denmark. 1998-1999. Assistant Professor, Computer Science & Engineering, IIT Delhi. 1994-2000 Researcher, ECRC GmbH, Munich, Germany. 1992-1994 Computer Scientist, ORA Corporation, Ithaca, NY. 1990-1992. Current Research Formal Foundations of Routing in Networks (algebraic and logical foundations and techniques for reasoning about their correctness and security) Secure information flow in distributed settings Higher-order Hypergraphical structures for representing data and challenges in distributed settings Medical applications of computing: from mobile healthcare to neurosurgery training. Teaching Holi 2021: COL832. Proofs and Types Diwali 2020: COL765. Introduction to Logic and Functional Programming Holi 2020: COL226. Programming Languages Diwali 2019: COL703. Introduction to Logic for Computer Science Holi 2019: COL226. Programming Languages Diwali 2018: COL869: Special Topics in Concurrency (with S. Akshay) More Recent Publications Normalising Lustre Preserves Security. Sanjiva Prasad, R. Madhukar Yerraguntla. Proceedings of ICTAC 2021. Online. September 6-9, 2021. (preprint at arXiv. https://arxiv.org/abs/2105.10687) 2021. [secure information flow, synchronous data flow] Security Types for Synchronous Data Flow Systems. Sanjiva Prasad, R. Madhukar Yerraguntla, Subodh Sharma. Proceedings of MEMOCODE 2020, IEEE. Online. December 2-4, 2020. [secure information flow, synchronous data flow] (Joint Best Paper Award) Only Connect, Securely. Chandrika Bhardwaj, Sanjiva Prasad. Proceedings of Formal Techniques for Distributed Objects, Components, and Systems, 39th IFIP WG 6.1 International Conference), FORTE 2019, Springer. LNCS volume 11535. Pages 75-92. Held as Part of the 14th International Federated Conference on Distributed Computing Techniques, DisCoTec 2019, DTU Kongens Lyngby, Denmark, June, 2019. [secure information flow, algebra] DHOOM: Reusing Design-for-Debug Hardware for Online Monitoring. Neetu Jindal, Sandeep Chandran, Preeti Ranjan Panda, Sanjiva Prasad, Abhay Mitra, Kunal Singhal, Shubham Gupta, Shikhar Tuli. Proceedings of the 56th Annual Design Automation Conference 2019, DAC 2019. Pages 99:1-99:6, ACM. Las Vegas, NV, USA. June 2019 [reconfigurable architecture, runtime verification] Sanjiva Prasad. Best-by-simulations: A framework for comparing efficiency of reconfigurable architectures on workloads with deadlines. Journal of Logical and Algebraic Methods in Programming, 100:1-15, Elsevier, November 2018. Jiawei Su, Danilo Vasconcellos Vargas, Sanjiva Prasad, Daniele Sgandurra, Yaokai Feng, Kouichi Sakurai. Lightweight Classification of IoT Malware Based on Image Recognition. 2018 IEEE 42nd Annual Computer Software and Applications Conference, COMPSAC 2018, Volume 2, Pages 664-669. IEEE. Tokyo, Japan. July 2018. Sanjiva Prasad. Best-by-Simulations: A Framework for Comparing Efficiency of Reconfigurable Multicore Architectures on Workloads with Deadlines. PLACES 2017 Workshop at ETAPS. Proceedings of PLACES@ETAPS 2017. EPTCS 246. Pages 61-71. Uppsala, Sweden. April 2017. Sujata Ghosh and Sanjiva Prasad. Proceedings of the 7th Indian Conference on Logic and Its Applications (ICLA 2017). Springer LNCS volume 10119. Kanpur, India. January 2017. More Recent Talks Security Types for Synchronous Data Flow Systems, MEMOCODE 2020, 3 December 2020. Only Connect, Securely. Security in the IoT Space. Indo-Japanese Online Workshop (Kyushu University-IIT Delhi), 3 December 2020. Language Based Security: Lattices and Connections. Academic Research Summit (Microsoft Research & ACM India), BITS Goa, 30-31 January 2020. Only Connect, Securely. Dartmouth University, NH, USA. 10 July 2019. Only Connect, Securely. U Washington, Seattle, WA, USA. 8 July 2019. Best-by-simulations. McGill University, Montreal, Canada. 19 October 2018. Lectures on Algebraic Foundations of Network Routing, Kyushu University, Fukuoka, Japan. 2-10 July 2018. A LitTLe logic for Mobility. University of Sheffield, UK. 31 May 2018 From ABC of Networks to a LitTLe logic for mobility. University of Manchester, UK. 30 May 2018. Formal Foundations of Routing in Networks. Estonian Winter School in Computer Science, Palmse, Estonia. 4-9 March 2018. Compositional Security in IoT. 6th International Cyber-Security Workshop. Fukuoka, Japan. 22 January 2018. A LitTLe logic for mobility. Imperial College, London, UK. 17 October 2017. Truss-worthy Computing. 5th International Cyber-Security Workshop, Fukuoka, Japan. 14 July 2017. Self-Similarity Breeds Resilience. Kyushu University, Fukuoka, Japan. 6 July 2017. Best-by-simulations. PLACES@ETAPS 2017, Uppsala, Sweden. 29 April 2017. More Current Projects and Consultancies PI. Security in the Internet of Things Space. (Centre of Excellence in Cyber Systems and Information Assurance), Indo-Japanese Collaborative Research Project. Department of Science and Technology, Government of India. March 2017-February 2022. INR 14,482,500. [Collaboration: Kyushu University] Co-PI. (Centre of Excellence) Collaborative Neuro-Engineering Platform for Excellence in Innovation and Translational Research. Department of Biotechnology, Ministry of Science and Technology, Government of India. March 2018-February 2023. INR 17,467,000. Total Budget INR 65,716,000. [Collaboration: AIIMS] PI. Curriculum Design and Ongoing Quality Advisory for Academic Programmes at KCST, Kuwait (phase 3). Kuwait College for Science and Technology, Kuwait. May 2018-May 2022. USD 36000. More Current Students Rathnakar Madhukar Yerraguntla (CSE, with Subodh Sharma): Verification of Cyber-Physical Systems Graduated Ankit Singhal (2021. Khosla School, with SN Maheshwari): Computational Biology Chandrika Bhardwaj (2020. CSE): Secure Information Flow Rajesh Kumar Pal (CSE, with Kolin Paul): Priti Paul Sinha (Math, with Wagish Shukla): More Professional Activity outside IITD I am an Editor-in-Chief ACM Books. Please consider sending your manuscripts or monographs to ACM Books. I am currently the Chair of the Executive Committee of Association for Logic in India (ALI). Please consider submitting papers in Logic to the conference ICLA and participating in the Schools ISLA. I am on the Executive Committee and PRSG of the ITRA Project of the Ministry of Electronics and Information Technology, Government of India. I am on the Academic Committee of the Visvesvaraya PhD Scheme of the Ministry of Electronics and Information Technology, Government of India. Other external activities Consider submitting papers to VNU Journal of Science (Vietnam). I am an Associate Editor for Computer Science and Communication Engineering (Vietnam) ICLA 2019 (I am on the Organising Committee) ICTAC 2019 (I am on the Programme Committee) Past Programme Committees Full Profile Get In Touch If you wish to contact me in my official capacity as Head of the Department of Computer Science and Engineering, please send mail to hodcse AT admin.iitd.ac.in using the contact form below Please do NOT email or phone my office regarding internships, invitations to serving on technical programme committees or giving invited talks, or serving on selection committees for government departments UNLESS you already know me personally, or have the permission to do so from IITD's administration. I am happy to hear from alumni, especially with suggestions on how the CSE Department may grow and improve. In all such communications, we will be grateful if you remind us which programme your graduated from, and when. Please send mail to hodcse AT admin.iitd.ac.in Current students of the CSE Department at IITD should FIRST contact their faculty advisers or project guides/teachers of their courses BEFORE contacting the Head, especially for certificates and letters of recommendation. My personal email address: sanjiva AT cse DOT iitd DOT ac DOT in Address Department of Computer Science and Engineering Indian Institute of Technology Delhi Hauz Khas, New Delhi 110016 India Phone +91 11 2659 1291 (HoD) +91 11 2659 1294 (Off) Email hodcse@admin.iitd.ac.in",
  "content_length": 9419,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:07"
}