{
  "name": "Sankha Narayan Guria",
  "homepage": "https://sankhs.com",
  "status": "success",
  "content": "About | Sankha Narayan Guria Assistant Professor, The University of Kansas Electrical Engineering and Computer Science Department 2034 Eaton Hall Institute for Information Sciences 137 Nichols Hall [email protected] or [email protected] @ngsankha / @sankhs.com / ngsankha I am an Assistant Professor in the EECS Department at The University of Kansas. I am interested in practical tools that help programmers build correct and efficient software. My research specifically uses programming language abstractions to design program analysis and synthesis techniques that facilitate automatic construction of functionally correct software. I direct the KU Programming Systems Group. I got my PhD from the University of Maryland, advised by Prof. Jeff Foster and Prof. David Van Horn. My background includes significant industry experience, from contributing to the SpiderMonkey JavaScript engine at Mozilla Firefox to building cloud-scale testing infrastructure for apps and websites at BrowserStack. I also gained valuable insights while working on the Hack programming language at Meta. I am hiring Ph.D. students for our group! Here are some reasons why our group and KU might be a great fit. Please send me an email and apply to the graduate program in EECS at KU if you want to join us. If you are already at KU, shoot me an email to set up a meeting. News Received the New Faculty Research Development (NFRD) Award to work on combining formal methods based program synthesis with LLMs. December 03, 2024 Serving as the OOPSLA 2024 Artifact Evaluation Committee co-chair. September 17, 2024 Serving as the OOPSLA 2024 Artifact Evaluation Committee co-chair. September 13, 2023 Started as an Assistant Professor at The University of Kansas EECS Department. July 17, 2023 I defended my PhD! May 05, 2023 [More …] Publications Absynthe: Abstract Interpretation-Guided Synthesis. Sankha Narayan Guria, Jeffrey S. Foster and David Van Horn. PLDI 2023. ACM / Preprint / Source Code Program Synthesis with Lightweight Abstractions. Sankha Narayan Guria. PhD Dissertation. DRUM ANOSY: Approximated Knowledge Synthesis with Refinement Types for Declassification. Sankha Narayan Guria, Niki Vazou, Marco Guarnieri and James Parker. PLDI 2022. ACM / Preprint / Source Code / Talk RbSyn: Type- and Effect-Guided Program Synthesis. Sankha Narayan Guria, Jeffrey S. Foster and David Van Horn. PLDI 2021. ACM / Extended Version / Source Code / Talk Type-Level Computations for Ruby Libraries. Milod Kazerounian, Sankha Narayan Guria, Niki Vazou, Jeffrey S. Foster and David Van Horn. PLDI 2019. ACM / Video / Extended Version / Source Code Transparent Object Proxies for JavaScript. Matthias Keil, Sankha Narayan Guria, Andreas Schlegel, Manuel Geffken and Peter Thiemann. ECOOP 2015. LIPICS / Video / Project Homepage / Artifact / Source Code Teaching EECS 700: Introduction to Program Synthesis Fall 2024 / Fall 2023 EECS 662: Programming Languages Spring 2025 / Spring 2024",
  "content_length": 2962,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:08"
}