{
  "name": "Sanorita Dey",
  "homepage": "https://redirect.cs.umbc.edu/~sanorita",
  "status": "success",
  "content": "Sanorita Dey, Assistant Professor, UMBC Sanorita Dey Assistant Professor Dept. of CSEE, University of Maryland Baltimore County sanorita@umbc.edu Research interests Core: STEM Education, Cognitive dissonance, Persuasion theory, Spatial learning, Mental Mapping Application: Adopting Technology, Crowdsourcing and Crowdfunding, Advertising and campaign management, Cognitive mobile app I am looking for new graduate students to join my lab. If you are interested, please contact me. News It was a great experience to attend GROUP 2025 this year and presenting our paper \"Understanding the Impact of YouTube Videos on Parents of Children with Developmental Delay and Disabilities\" We are thrilled to receive COEIT Interdisciplinary Award, 2024 to develop a summer workshop for facilitating students to learn about role model characters. Two of our posters got accepted at CSCW 2024. Our paper \"You Don't See Too Many of Me, Too Many of Us, in That Area\" got accepted at ITiCSE 2024. It was exciting to attend CSCW 2023 as our group presented three papers this year. Current Projects Children's Developmental Delays This project aims to understand the challenges of early detection of developmental delays among young children. The goal of this project is to create an proactive and intelligent system that can assist parents to learn and monitor their children's developmental growth and allow them to convey their concerns and collected information in an organized way to their physicians. STEM Education This goal of this project is to understand the challenges that students experience when they intend to pursue computer science and computational thinking as their career path. We aim to build solutions that are facilitate computational thinking and creativity among students. Paper Next Generation AI Agent: Promises and Prospects This project aims to understand the critical and context-sensitive responses of AI agents. What aspects may potentially impact an AI agent? How can we use AI agents to teach computing skills and lifeskills to various population? Paper The Impact of Social Platforms This goal of this project is to explore and examine how social platforms impact our communities by proving companionship and by forming narratives of critical issues. Paper Paper Paper Paper Adopting Technological Solution by Global South Communities This project explores the challenges of adopting technological solutions by global-south population and design systems that can merge the gap. Paper Selected Publications Papers Things Are Clear to Me Now! – Exploring the Effectiveness of AI-Generated Contextual Explanations in Digitally Altered and Synthetic Images Saquib Ahmed, Md. Nazmus Sakib, Sanorita Dey, AAAI/ACM Conference on AI, Ethics, and Society (AIES'25) (PDF)(Appendix) Understanding the Impact of YouTube Videos on Parents of Children with Developmental Delay and Disabilities Saquib Ahmed, Tejo Gayathri Busireddy, Sanorita Dey, Proceedings of the ACM on Human-Computer Interaction (GROUP'25) (GROUP 2025) \"You Don't See Too Many of Me, Too Many of Us, in That Area\": Exploring the Challenges and Opportunities of Promoting STEM Education Among Black and Latinx Students Isabella Lopez, Sanorita Dey, Proceedings of the 2024 on Innovation and Technology in Computer Science Education (ITiCSE 2024) COBIAS: Contextual Reliability in Bias Assessment Priyanshul Govil, Vamshi Krishna Bonagiri, Manas Gaur, Ponnurangam Kumaraguru, Sanorita Dey, arXiv preprint arXiv:2402.14889 (Paper) Why should I bother to break the norm?: Exploring the Prospects of Adopting Technology-Driven Solutions by Indian Shrimp Farmers Lokesh Medarametla, Saquib Ahmend, Sanorita Dey, Computer- Supported Cooperative Work and Social Computing (CSCW 2023) Fishing for Validation: Understanding Promises and Challenges of a Private Social Media Group for COVID-19 Long-Hauler Patients Abhinav Reddy Karra, Ranjan Jaiswal, Sanorita Dey, Computer- Supported Cooperative Work and Social Computing (CSCW 2022) It Is All About Criticism: Understanding the Effect of Social Media Discourse on Legal Crowdfunding Campaigns Sanorita Dey, Brittany Duff, Karrie Karahalios, Computer- Supported Cooperative Work and Social Computing (CSCW 2022) Computational Understanding of Narratives: A Survey Priyanka Ranade; Sanorita Dey, Anupam Joshi, Tim Finin, IEEE Access 2022: The Multidisciplinary Open Access Journal (IEEE Access 2022) Re-imagining the Power of Priming and Framing Effects in the Context of Political Crowdfunding Campaigns Sanorita Dey, Brittany Duff, Karrie Karahalios, Human Factors in Computing Systems Conference (CHI 2022) Interpretable Explanations for Probabilistic Inference in Markov Logicitical Crowdfunding Campaigns KM Al Farabi, S Sarkhel, S Dey, D Venugopal, IEEE International Conference on Big Data, 2021 (Paper) Recommendation for Video Advertisements based on Personality Traits and Companion Content Sanorita Dey, Brittany Duff, Niyati Chhaya, Wai Fu, Vishy Swaminathan, Karrie Karahalios, International Conference on Intelligent User Interfaces(IUI 2020) VidLyz: An Interactive Approach to Assist Novice Entrepreneurs in Making Persuasive Campaign Videos Sanorita Dey, Brittany Duff, Karrie Karahalios, Wai-Tat Fu, Computer- Supported Cooperative Work and Social Computing (CSCW 2019) Understanding the Effect of the Combination of Navigation Tools in Learning Spatial Knowledge Sanorita Dey, Wai-Tat Fu, Karrie Karahalios, Spatial User Interaction((SUI 2019) Top-5 paper Effects of Socially Stigmatized Crowdfunding Campaigns in Shaping Opinions Sanorita Dey, Karrie Karahalios, Wai-Tat Fu, Human Factors in Computing Systems Conference (CHI 2018) Best paper: honorable mention award Getting There and Beyond: Incidental Learning of Spatial Knowledge with Turn-by-Turn Directions and Location Updates in Navigation Interfaces Sanorita Dey, Karrie Karahalios, Wai-Tat Fu, Spatial User Interaction((SUI 2018) Understanding the Effects of Endorsements for Scientific Crowdfunding Sanorita Dey, Karrie Karahalios, Wai-Tat Fu, Human Factors in Computing Systems Conference (CHI 2017) The Art and Science of Persuasion: Not All Crowdfunding Campaign Videos Are The Same Sanorita Dey, Brittany Duff, Karrie Karahalios, Wai-Tat Fu, Computer- Supported Cooperative Work and Social Computing (CSCW 2017) Fine-Grained Explanations using Markov Logic Khan Mohammad Al Farabi, Somdeb Sarkhel, Sanorita Dey, Deepak Venugopal, Machine Learning and Knowledge Discovery in Databases (ECMLPKDD 2019) A scalable online platform for evaluating and training visuospatial skills of engineering students Z. Xiao, Y. Yao, C. Yen, Sanorita Dey, H. Wauck, J. Leake, B. Woodard, A. Wolters, W. Fu, The Annual Conference of the American Society of Engineering Education, 2017 (Paper) AccelPrint: Imperfections of Accelerometer Make Smartphones Trackable Sanorita Dey, Nirupam Roy, Wenyuan Xu, Romit Roy Choudhury, Srihari Nelakuditi, The Network and Distributed System Security Symposium (NDSS 2014) Outstanding MS thesis award Extended Abstract/Workshop/Posters Post-Roe Public Discourse: A Temporal Analysis of Discussion on US Abortion Law Changes (Poster) H. N. Venkata, V. Palakurthi, S S S Bindu Devalam, Md. Nazmus Sakib, Saquib Ahmed, Sanorita Dey, Computer- Supported Cooperative Work and Social Computing (CSCW 2024) The Dual Role of Student and Creator: Exploring the TikTok Experience (Poster) B. K. Bulley, S. Tirumala, B. S. Mahamkali, Md. Nazmus Sakib, Saquib Ahmed, Sanorita Dey, Computer- Supported Cooperative Work and Social Computing (CSCW 2024) Are navigation applications killing your spatial skills? (Poster) Sanorita Dey, User Interface Software and Technology (UIST 2019) Videolyzer: An Interactive Platform for Making Videos Persuasive (Doctoral Consortium) Sanorita Dey, Intelligent User Interfaces (IUI 2017) Know your Surroundings with an Interactive Map (Student Consortium) Sanorita Dey, Intelligent User Interfaces (IUI 2015) Study the Effect of Allocentric and Egocentric Interfaces in Indoor Navigation (Boster) Sanorita Dey, HCI Consortium, 2014 (Boster) Leveraging Imperfections of Sensors for Fingerprinting Smartphones (Poster) Best poster runner-up Sanorita Dey, Nirupam Roy, Wenyuan Xu, Srihari Nelakuditi, HotMobile, 2013 (Poster) Mitigating Distractions from Smartphones (Poster) Connor Bain, Sanorita Dey, Romit Roy Choudhury, Srihari Nelakuditi, HotMobile, 2013 (Poster) Awards & Honors Maria Pia Gratton International Fellowship, 2019 “The Maria Pia Gratton fellowship is focused on recognizing applicants who shares Pia's philosophy of life and desire to improve their multicultural experiences and education.\" Top-5 paper at SUI, 2019 The top-5 highest ranked papers were invited to present at UIST 2019 in order to foster connections between the two communities. Graduate College Dissertation Completion Fellowship, 2018 \"The Graduate College's Dissertation Completion Fellowship helps outstanding UIUC graduate students complete the doctoral degree by providing stipend and waivers of tuition. Best paper: Honorable mention award at CHI, 2018 \"Effects of Socially Stigmatized Crowdfunding Campaigns in Shaping Opinions” won the best paper honorable mention award at CHI 2018. Adobe Digital Marketing Research Award, 2016 Adobe Digital Marketing Research Award promotes both theoretical and empirical development of solutions to problems in marketing by understanding the use of data science. Outstanding MS thesis award, 2014 The MS thesis was selected for the outstanding thesis award. SPARC Graduate Fellowship Award, 2013 SPARC Graduate Fellowship Award is a merit-based award designed to ignite research and creative excellence among outstanding students. Best poster runner-up award, 2013 The poster on smartphone fingerprinting (AccelPrint) won the second prize at the HotMobile 2013, the International Workshop on Mobile Computing Systems and Applications. 18th rank in the Higher Secondary Examination, 2002 Placed 18th according to the merit list publis",
  "content_length": 10376,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:10"
}