{
  "name": "Santosh Kumar 0001",
  "homepage": "https://www.memphis.edu/cs/people/faculty_pages/santosh-kumar.php",
  "status": "success",
  "content": "Santosh Kumar - Computer Science - The University of Memphis Skip to main content SearchX Safety & Security Prospective Students Current Students Parents & Family Alumni Veterans Faculty & Staff People Take Action Follow Us Online FacebookLinkedIn Home Computer Science People Faculty Pages Santosh Kumar Santosh Kumar Director, NIH mDOT Center, Director, MD2K Center of Excellence, and Lillian and Morrie Moss Chair of Excellence Professor in Computer Science Phone 901.678.2487 Email Santosh.Kumar@memphis.edu Fax 901.678.1506 Office Dunn Hall 319 Office Hours Call for hours Degree: PhD, Computer Science, The Ohio State University, 2006 Teaching Interests:Wireless sensor networks, wireless networks, network design and performance analysis, operations research Research Interests:Artificial intelligence (AI) for wearables, mobile sensor big data, sensor-guided behavioral interventions on wearables, behavioral privacy, mobile health (mHealth) Personal Website:https://mdotcenter.org/santosh/ Google Scholar Dr. Santosh Kumar joined the Department in Fall 2006 after completing his PhD at The Ohio State University, where his dissertation was selected for the Presidential Fellowship award. In 2010, he was selected as one of America's ten most brilliant scientists under the age of 38 (called the \"Brilliant Ten\") by Popular Science magazine, becoming the first person in the Mid-South region to receive this honor. At the University of Memphis, he received an Early Career Research Award in 2008, the Faudree Professorship in 2011, and Distinguished Research Award in 2013. In 2015, he was promoted to full professor and named Tennessee’s first chair of excellence in Computer Science. Dr. Kumar’s research focusses on mobile health (or mHealth). He and his students have developed computational models to infer human health and behavior such as stress, conversation, smoking, craving, brushing, flossing, and cocaine use from wearable sensor data. Dr. Kumar's research works appear in highly-selective publication venues in computer science such as ACM UbiComp, ACM CHI, ACM MobiCom, ACM SenSys, ACM IPSN, ICML, IEEE INFOCOM, and several ACM and IEEE Transactions journals. His publications are widely cited, at an average of 70 citations per article. Dr. Kumar leads several large multidisciplinary projects in mHealth funded by both National Institutes of Health (NIH) and National Science Foundation (NSF). He currently leads ten federally-funded grants worth over $18 million. It includes multiple R01’s from NIH and a national Center of Excellence on Mobile Sensor Data-to-Knowledge (MD2K) funded by the Big Data-to-Knowledge (BD2K) initiative from NIH that involves over 20 scientists in computing, engineering, behavioral science, and medicine from 12 universities. This is complemented by a $4 million NSF grant from its data cyberinfrastructure program. As a leading expert on mobile health, Dr. Kumar is frequently invited to chair national meetings on mobile health and speak at national and international meetings in both computing and health. In 2013, he was invited to speak at the White House on the future of biosensors. In 2015, he was invited by NSF to speak about his career to aspiring investigators in smart health as a role model scientist.",
  "content_length": 3271,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:14"
}