{
  "name": "Santanu Chaudhury",
  "homepage": "https://web.iitd.ac.in/~santanuc",
  "status": "success",
  "content": "Dr. Santanu Chaudhury // IIT Delhi >Bio >Research >Publications >Courses >Contact >Lab Dr. Santanu ChaudhuryPhd, B.Tech Current Positions | Previous Positions | Extra Activities | Education Current positions: Schlumberger Chair Professor in the Department of Electrical Engneering Dean, UGS, I.I.T, Delhi Professor at Electrical Engneering Department, I.I.T, Delhi President, Board of Students Publications Coordinator, Thrust Area on Real time Embedded Systems Previously held positions: Development Engineer at MMC (digital systems division) KGP Junior Scientific Officer at CSE Department, I.I.T, Delhi Computer Engineer at ECSU, ISI, Calcutta Lecturer at Electronics and Electrical Communication Engneering Department, I.I.T, Kharagpur Assistant Professor at Electrical Engneering Department, I.I.T, Delhi Chairman, Grades and Registration (U.G) Extension Activities: Program Committee member of IEEE ICCV 2000, 2002, 2005 Program Chair ICVGIP98 Organising Chair ACCV2005 Guest Editor for IETE Technical Review General Secretary, IUPRAI (Indian Unit of International Association of Pattern Recognition), 2005-2007 Curriculum Development: Structuring and course development for the new B.Tech curriculum of I.I.T, Delhi (introduced in 2003) Designed complete curriculum and coordinated development of course material for a certificate course on Embedded Systems and Applications for working professionals. The course is being run (5 times) successfully under the aegis of FITT, I.I.T, Delhi. Developing a Video Lecture series on Embedded Systems with support from ETSC under NPTEL programme. Awards: INSA Medal for Young Scientists in 1993. Fellowships: Indian National Academy of Engineers, National Academy of Sciences.. Education Ph.D. (Computer Science and Engneering)I.I.T Kharagpur B.Tech (Electronics and Electrical Communication Engneering)I.I.T Kharagpur Bio | Research | Publications | Courses | Contact | Lab |",
  "content_length": 1930,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:09"
}