{
  "name": "Santiago Chumbe",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/santiago-segundo-chumbe",
  "status": "success",
  "content": "Santiago Segundo Chumbe - Heriot-Watt Research Portal CV View Scopus Profile Santiago Segundo Chumbe Dr Assistant Professor, School of Mathematical & Computer SciencesAssistant Professor, School of Mathematical & Computer Sciences, Computer Science Emails.chumbehw.acuk EH14 4ASUnited Kingdom 19972015 Research activity per year Personal profile KeywordsZ665 Library Science. Information Science Fingerprint Dive into the research topics where Santiago Segundo Chumbe is active. These topic labels come from the works of this person. Together they form a unique fingerprint. solutions INIS 100% performance INIS 61% libraries INIS 56% iterative methods INIS 56% environment INIS 56% learning INIS 56% Open Access Computer Science 56% Virtual Learning Environments Computer Science 56% View full fingerprint Research output Research output per year 1997 1997 1998 2003 2006 2007 2009 2010 2011 2013 2015 2015 7 Paper 3 Article 2 Chapter 1 Chapter (peer-reviewed) 1 More 1 Poster Research output per year Research output per year Developing Seamless Discovery of Scholarly and Trade Journal Resources Via OAI and RSSChumbe, S. & MacLeod, R., 2003, p. 853-856.Research output: Contribution to conference › Paper › peer-review Open AccessFile Interoperability 100% Online Information 100% information 100% resources 100% trade 100% 168 Downloads (Pure) TICTOCRON: an automatic solution for propagating quality metadata to scholarly TOC RSS feed metadataChumbe, S. & MacLeod, R., Mar 2009. 10 p.Research output: Contribution to conference › Paper Open AccessFile Best Practice 100% Automatic Solution 100% solutions 100% tables 100% Solution and Solubility 100% 1867 Downloads (Pure) Building bridges with blocks: assisting digital library and virtual learning environment integration through reusable middlewareChumbe, S., MacLeod, R. & Kennedy, M., 2007. 10 p.Research output: Contribution to conference › Paper Open AccessFile environment 100% learning 100% bridges 100% libraries 100% Virtual Learning Environments 100% 136 Downloads (Pure) Hybrid Journals: Ensuring Systematic and Standard Discoverability of the Latest Open Access ArticlesChumbe, S., Kelly, B. & Macleod, R., 2015, In: Serials Librarian. 68, 1-4, p. 143-155 13 p.Research output: Contribution to journal › Article › peer-review Discoverability 100% Open Access 100% hybrids 100% Aggregator 100% Really Simple Syndication 100% 6 Citations (Scopus) We should not light an Open Access lamp and then hide it under a bushel!Chumbe, S. S., MacLeod, R. A. & Kelly, B., Sept 2015, New Avenues for Electronic Publishing in the Age of Infinite Collections and Citizen Science: Scale, Openness and Trust: Proceedings of the 19th International Conference on Electronic Publishing. Schmidt, B. & Dobreva, M. (eds.). IOS Press, p. 102-112 11 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (peer-reviewed) › peer-review Open AccessFile solutions 100% lamps 100% End-Users 100% Potential Benefit 100% Namespace 100% 2 Citations (Scopus) 728 Downloads (Pure) View all 14 research outputs Impacts Making Articles Systematically Discoverable for Researchers – JournalTOCsChumbe, S. S. (Participant)Impact: Technological File",
  "content_length": 3200,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:11"
}