{
  "name": "Santiago Franco",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/santiago-franco-aixela",
  "status": "success",
  "content": "Santiago Franco - Royal Holloway Research Portal Santiago Franco Dr Lecturer in Computer Science (Soft Eng), Department of Computer ScienceCentre for Intelligent Systems EmailSantiago.FrancoAixelarhul.acuk TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 21 Conference contribution 2 Article 1 Chapter Research output per year Research output per year A Problem with the Current Methodology for Comparing Search Algorithms and a Proposed SolutionBarley, M., de Kriek, N., Franco, S., Garcia-Olaya, A., Hartill, T., Triggs, C., Zwart, H., Alcazar, V. & Riddle, P., 20 Jul 2025, International Symposium on Combinatorial Search (SOCS), 2025. 1 ed. Vol. 18. p. 29-37 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 5 Downloads (Pure) Speed vs Accuracy in Goal Recognition for Time-Sensitive Applications: a Game-Theoretic ApproachBernardini, S., Fagnani, F. & Franco, S., 23 May 2025, 24th International Conference on Autonomous Agents and Multiagent Systems.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 6 Downloads (Pure) Lazy Evaluation of Negative Preconditions in Planning Domains (Extended Abstract)Franco, S., Roberts, J. & Bernardini, S., 1 Jun 2024, The 17th International Symposium on Combinatorial Search (SoCS). AAAI Press, 2 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 27 Downloads (Pure) Optimizing Pathfinding for Goal Legibility and Recognition in Cooperative Partially Observable EnvironmentsBernardini, S., Fagnani, F., Neacsu, A. & Franco, S., Aug 2024, In: Artificial Intelligence. 333, 37 p., 104148.Research output: Contribution to journal › Article › peer-review Open Access Teaching the principles of artificial intelligence to Generation Z: The SMaILE-App mobile game application Giulia Ballatore, M., Bernardini, S., Como, G., Damonte, L., Franco, S., Neacsu, A. & Vanelli, M., 14 Jun 2024, School Children and the Challenge of Managing AI Technologies . 1 ed. Routledge, p. 223 11 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter Open AccessFile 16 Downloads (Pure) View all 24 research outputs",
  "content_length": 2843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:11"
}