{
  "name": "Santo Fortunato",
  "homepage": "https://www.santofortunato.net",
  "status": "success",
  "content": "Santo FortunatoSearch this siteEmbedded FilesSkip to main contentSkip to navigationSanto's WebsiteJames H. Rudy Professor of Informatics and Computing at the Luddy School of Informatics, Computing, and EngineeringMember of the Center for Complex Networks and Systems Research (CNetS)Indiana University, Bloomington, USAFellow of the American Physical SocietyFellow of the Network Science SocietyAuthor of A First Course in Network ScienceNewsHonored to be named James H. Rudy Professor of Informatics and Computing at Indiana University. Thanks to all my mentors, advisors, students, postdocs, and collaborators for pushing me to this career high. See Luddy's press release here.I am the top faculty of Luddy School according to Stanford/Elsevier Top 2% Scientists Ranking. Here is the school's press release. I was named an inaugural Highly Ranked Scholar by ScholarGPS.I have organized and given A Short First Course in Network Science, a two-weeks online basic course for people interested in the topic, held in June 2024, sponsored by the Network Science Society. You can find the videos of the lectures here.I have co-organized the network science program for the 2024 March Meeting of the American Physical Society, held in Minneapolis. Thanks to my co-organizers Raffaella Burioni, Guido Caldarelli and Filippo Radicchi.Our overview of network community detection on the 20th anniversary of the Girvan-Newman paper is out in Nature Physics! Delightful first collaboration with the great Mark Newman Recent papers                               (Some) neural embeddings, like node2vec, are surprisingly good at learning community structure! Check our paper, just out in Nature Communications.Over 92% of authors of papers on Covid-19 knew nothing about infectious diseases! Problem or opportunity? Both! Check out our comment in Nature Human Behavior. See Luddy's press release here.What's the best subway line one can build with a fixed budget? It could be one serving only half of the population! Check out our paper, published in Nature Communications. How can you mitigate epidemic spreading in structured populations? Just make social groups overlap! Check our paper, just published in PRX, and its highlight in PhysicsLast modified on November the 27th, 2024Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2317,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:13"
}