{
  "name": "Santosh Nagarakatte",
  "homepage": "https://www.cs.rutgers.edu/~santosh.nagarakatte",
  "status": "success",
  "content": "Santosh Nagarakatte's Homepage Santosh Nagarakatte Professor and Undergraduate Program Director of Computer Science, Department of Computer Science, Rutgers University, New Brunswick email: office: CORE 328 phone: (+1) 848-445-8407( Email is the fastest way to reach me) CV (last updated: October, 2025) Google Scholar, DBLP Research Group Research Group's blog The RLIBM Project Verifying the eBPF verifier About me I joined Rutgers in January 2013, after obtaining my Ph.D. in Computer Science from the University of Pennsylvania. I am interested in building efficient, robust, and secure software systems. Primary research interests are in hardware-software interfaces spanning programming languages, compilers, runtimes and computer architecture. I love working on the entire computing stack ranging from hardware modifications, operating system enhancements, compiler optimizations and programming language design to build robust systems. My group's research has been recognized with the NSF CAREER Award, two IEEE Micro Top Picks Paper Awards (2010 and 2013), five Distinguished Paper Awards (PLDI 2015, ICSE 2016, PLDI 2021, POPL 2022, and CGO 2022), SIGPLAN Research Highlights paper, CACM Research Highlight paper, 2018 ACM SIGPLAN John C Reynolds Outstanding Dissertation Award, Google Research Award, Intel Corporation Gifts, and 2022 ACM SIGPLAN John C Reynolds Outstanding Dissertation Award. I was selected as the ACM Distinguished Member in 2023. For more details, see my research group's page. Selected Publications: SAS 2025, eBPF-2025, PLDI 2025, VSS 2025, SAS 2024, SP 2024, PLDI 2024, CAV 2023, CGO 2023, OOPSLA 2022, ACM TACO 2022 , PLDI 2022 , CGO 2022 , POPL 2022, FSE 2021, PLDI 2021, POPL 2021, PLDI 2020, CF 2020, PLDI 2019, CGO 2019, SC 2018, CACM-RH 2018, PLDI 2017, FSE 2017, FSE 2016, ICSE 2016, PLDI 2015, ASPLOS 2015, PLDI 2013, OOPSLA 2013, PLDI 2012, ISCA 2012, POPL 2012, ASPLOS 2010, and PLDI 2009. News (New) July 2025: Our paper on comparing the precision of eBPF abstract operators accepted to SAS-2025. Congratulations Matan and Hari! (New) June 2025: Communications of the ACM Magazine has a small blurb on my research group's effort to mainstream formal methods. See the CACM June 2025 edition or the Rutgers CS department's news item. (New) June 2025: Daroc Alden wrote an article in the Linux Weekly News summarizing my talk on \"Formally Verifying the eBPF verifier\" at LSFMM+BPF Summit. Thanks Daroc and LWN. (New) June 2025: Hari's patch to improve the precision of the BPF_ADD and BPF_SUB operators upstreamed in to the Linux Kernel. Congratulations Hari! (New) June 2025: My PLMW talk at PLDI 2025 is now available online. (New) June 2025: My PhD student Sehyeok Park's PLDI 2025 talk is now available online. (New) June 2025: Our paper on synthesizing eBPF abstract operators accepted to the 3rd workshop on eBPF and Kernel Extensions, co-located with SIGCOMM 2025. Congratulations Hari and Matan! (New) June 2025: Camera ready version of our PLDI 2025 paper now available here. (New) June 2025: Talked about our eBPF verification work at the Distinguished Webinar Series in Artificial Intelligence and Cyber Security. See here for a recording. (New) May 2025: Video of the Sehyeok's talk at VSS 2025 is now available here. (New) May 2025: Participating in the panel on Correctly Rounded Functions at ARITH 2025. April 2025: Our paper \"Correctly Rounded Math Libraries Without Worrying about the Application’s Rounding Mode\" accepted to appear at PLDI 2025. Congratulations Sehyeok Park and Justin Kim! March 2025: Excited about attending the Linux Storage, Filesystem, MM, and eBPF Summit in Montreal and present our work on formal verification of the eBPF verifier. See you in Montreal. March 2025: My PhD student Jay Lim, who graduated in 2021, is going to join the CS department at the University of California, Riverside as a tenure-track assistant professor. Congratulations Jay Lim! March 2025: Our new paper on the RLIBM project conditionally accepted to PLDI 2025. Congrats Sehyeok Park and Justin Kim! March 2025: Our new paper on correctly rounded trigonometric functions with the RLIBM approach accepted to VSS 2025. Congrats Sehyeok Park! Feb 2025: Serving on the ASPLOS 2026 PC. Submit your exciting papers! Jan 2025: Matan's patch to improve the precision of the multiplication abstract operator in the eBPF verifier upstreamed to the mainline Linux Kernel. Congrats Matan! September 2024: Thanks eBPF foundation for awarding a research gift for our project on verifying the eBPF verifier. August 2024: Serving on the PLDI 2025 Program committee. Submit your exciting papers! August 2024: Serving on the PLDI Steering committee as a Member at Large for the period 2024-2027. July 2024: Another unrestricted gift from Intel Corporation for the RLIBM project. Thanks Intel! July 2024: Our paper on fixing the unsound latent abstract operators in eBPF verifier accepted to SAS 2024. Congratulations Hari and Matan! July 2024: Awarded NSF FMITF Track II grant with Srinivas Narayana on our eBPF verification work. See details here June 2024: Serving on the program committees of ASPLOS 2025, NDSS 2025, and CGO 2025. Submit your exciting papers! April 2024: Paper with colleague Mridul Aanjenaya on building a maximum consensus low dimensional linear program solver accepted for publication at PLDI 2024! March 2024: Our patch to the eBPF verifier in the Linux kernel to make the abstract operator sound is here. February 2024: Paper on memory safety to appear in IEEE Security and Privacy's 2024 special issue! February 2024: Serving as the associate editor for ACM TACO. January 2024: Selected as the 2023 ACM Distinguished Member! October 2023: Serving as the vice-chair for ASPLOS 2024. September 2023: Serving on the PLDI 2024, ASPLOS 2024, ISCA 2024, and ESOP 2024 program committees. Submit your interesting work! June 2023: Awarded a NSF SHF Small Grant with Mridul Aanjaneya for the project on building solvers for low dimensional linear programs solvers. June 2023: Intel Corporation supports our work on the RLIBM project with another unrestricted research gift. Thanks Intel! April 2023: Our paper \"Verifying the verifier: eBPF Range Analysis Verification\" accepted for publication at CAV 2023. Congratulations Hari, Matan, and Srinivas! November 2022: The RLIBM project now provides fast and correctly rounded trigonometric functions. Congrats Sehyeok Park on this excellent work! October 2022: Santosh Nagarakatte's talk at the 2022 Papers We Love Conference on the RLIBM project is now available. August 2022: Intel Corporation supports our research on the RLIBM project with a research gift. Thanks Intel. July 2022: Mohammadreza Soltaniyeh and Sangeeta Chowdhary successfully defend their PhD dissertations. Congratulations Reza and Sangeeta! June 2022: Jay Lim's dissertation awarded the 2022 ACM SIGPLAN John C Reynolds Outstanding Dissertation Award! Congratulations Jay! May 2022: ACM SIGPLAN blog post about our paper recognized with the POPL 2022 Distinguished Paper Award is live now. April 2022: CGO 2022 Distinguished Paper Award for our paper on verifying tnum operations with colleague Srinivas Narayana and PhD students Harishankar Vishwanathan and Matan Shachnai! March 2022: Gave an invited keynote talk at the Conference on Next Generation Arithmetic 2022 as part of Supercomputing Asia! December 2021: Our RLIBM-ALL paper recognized with the ACM SIGPLAN POPL 2022 Distinguished Paper Award. See the POPL program here. Congratulations Jay! December 2021: Correctly rounded logf from our RLIBM project now in LLVM's libc. See here. December 2021: Camera ready for our CGO 2022 paper sent to the publisher. Our new algorithm for tnum multiplication is now part of the Linux Kernel. Read here. September 2021: Our new result on producing a single polynomial approximation that generates correct results for multiple representations and rounding modes accepted to POPL-2022. See the technical report here. Congratulations Jay! September 2021: Jay Lim successfully defends this PhD thesis. Congratulations Dr. Jay P. Lim! August 2021: See our ACM SIGPLAN blog post on the RLIBM project that was recognized with the PLDI 2021 Distinguished Paper Award. June 2021: Our Linux kernel patch with a new algorithm for sound and precise multiplication of tnums (an abstract domain in the eBPF verifier) has been upstreamed. Congratulations Hari and Matan! May 2021: PLDI 2021 Distinguished Paper Award for our paper: High Performance Correctly Rounded Math Libraries for 32-bit Floating Point Representations. Congratulations Jay! May 2021: Awarded NSF SHF Small grant for our research on correctly rounded math libraries. August 2020: Awarded NSF Formal Methods in the Field Track I grant for the project \"Formally Verified Sandboxing for Packet-Processing Programs\" with Srinivas Narayana. October 2019: Our ebpf verification project with Srinivas Narayana awarded Facebook Networking Systems Research Award. September 2019: Adarsh Yoga successfully defended his PhD dissertation. Congrats Dr. Adarsh Yoga! July 2019: Awarded NSF FMiTF Grant for the research on equivalence checking for cryptography libraries. June 2019: Awarded NSF SHF Grant for the research on Posits. July 2018: My PhD student David Menendez's dissertation selected to receive the ACM SIGPLAN John C. Reynolds Dissertation Award! Congratulations David! Feb 2018: Our Communications of the ACM Research Highlights Article is now available here. December 2017: David Menendez successfully defended his PhD dissertation. Congrats David! November 2017: Awarded Intel grant for the year 2017-2018 for the project on LLVM verification. July 2017: David's ICSE 2016 paper \"Termination-Checking for LLVM Peephole Optimizations\" selected as Computing Review's one of the Notable Articles and Books of 2016. See more information here. Congrats David! November 2016: Intel awards an unrestricted gift for our research on LLVM Verification. October 2016: PLDI ",
  "content_length": 60071,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:18"
}