{
  "name": "Saori C. Tanaka",
  "homepage": "https://xsaori.github.io",
  "status": "success",
  "content": "Welcome to Saori Tanaka’s Pages Skip to the content. Dr. Saori C Tanaka Google Scholar ORCID Affiliations Computational Behavioral Neuroscience Lab, Division of Information Science, Nara Institute of Science and Technology (web) Department of Neural Computation for Decision-Making, ATR Brain Information Communication Research Lab. Group (web) Short Bio I began my research as a graduate student in computational neuroscience at the Nara Institute of Science and Technology (NAIST) in 2001. My early research established some of the first foundational computational models of decision-making, in particular my work on temporal discounting (Nature Neuroscience, 2004) has been cited >1000 times. and has had substantial impact on the development of the field. I received the Best Paper Award, Best Research Award, and Encouragement Award from the Japan Neural Networks Society in 2005 for this achievement. After completing graduate school, I continued my research on human decision-making and received the Nakayama Award for Encouragement from the Nakayama Science Foundation in 2008 for the theme of “Science of Emotion”. With advances in data science, however, I became interested in fusing hypothesis-driven with data- driven approaches. Hence more recently, I have been involved in national flagship neuroscience projects funded by MEXT and AMED by leading in building databases to make MRI data from thousands of patients with human diseases publicly available (Tanaka et al., 2022, Scientific Data). Compared to other countries, Japan lags behind in data sharing, and there is an urgent need to improve policies and systems, and to secure human resources. I am now recognised as a leader of open science in the field of brain imaging in Japan, thanks to my expertise and skills in computational neuroscience, as well as the networks I have built with overseas researchers through invitations to several meetings of the International Brain Initiative (IBI). In parallel with my research activities, I have actively contributed to developing the research field as a program committee member of various academic societies. As a representative of our society, I am also a member of the Future Plan Committee of the Japanese Association of Brain Science Societies, which consists of 19 basic and clinical brain science-related societies in Japan, and I have made proposals to the government, the public, and academic societies on future plans for brain science research. Specifically, I proposed the application of artificial intelligence technology and databases as essential areas of neuroscience in Japan’s science policy. Biography Professor, 2025.4 – Division of Information Science, Nara Institute of Science and Technology, Japan Associate Professor (tenure-track), 2022.4 – 2025.3 Division of Information Science, Nara Institute of Science and Technology, Japan Department Head, 2015.9 – Department of Neural Computation for Decision-making (NCD), ATR Brain Information Communication Research Lab. Group Senior Researcher, 2015.4 – 2015.9 Researcher, 2014.1 – 2015.3 Department of Cognitive Neuroscience (DCN), ATR Brain Information Communication Research Lab. Group, Japan Associate Professor, 2012 – 2013 Associate Professor (project appointed), 2009 – 2012 Institute of Social and Economic Research, Osaka University, Japan Researcher, 2007 – 2008 Department of Computational Biology, ATR Brain Information Communication Research Lab. Group Postdoc fellow, 2006 – 2007 Human Reward Learning Laboratory (John O’Doherty lab) Division of Humanities and Social Sciences, California Institute of Technology Ph. D. Candidate, 2003 – 2006 Graduate School of Information Science, Nara Institute of Science and Technology, Japan Master of Science, 2001 – 2003 Graduate School of Information Science, Nara Institute of Science and Technology, Japan Bachelor of Science, 1997 – 2001 Department of Physics, Faculty of Science, Osaka University, Japan Publications Haitani T, Sakai Y & Tanaka SC. Effects of measurement errors on relationships between resting-state functional connectivity and psychological phenotypes. Sci Rep 15, 30316, 2025 Yamashita O, Yamashita A, Takahara Y, Sakai Y, Okamoto Y, Okada G, Takamura M, Nakamura M, Itahashi T, Hanakawa T, Togo H, Yoshihara Y, Murai T, Okada T, Narumoto J, Takahashi H, Takagishi H, Hosomi K, Kasai K, Okada N, Abe O, Imamizu H, Hayashi T, Koike S, Tanaka SC, Kawato M. Computational mechanisms of neuroimaging biomarkers uncovered by multicenter resting-state fMRI connectivity variation profile. Mol Psychiatry. 2025 Koike S, Tanaka SC, Hayashi T. Beyond case-control study in neuroimaging for psychiatric disorders: Harmonizing and utilizing the brain images from multiple sites. Neurosci Biobehav Rev. 2025 Takahara Y, Kashiwagi Y, Tokuda T, Yoshimoto J, Sakai Y, Yamashita A, Yoshioka T, Takahashi H, Mizuta H, Kasai K, Kunimitsu A, Okada N, Itai E, Shinzato H, Yokoyama S, Masuda Y, Mitsuyama Y, Okada G, Okamoto Y, Itahashi T, Ohta H, Hashimoto RI, Harada K, Yamagata H, Matsubara T, Matsuo K, Tanaka SC, Imamizu H, Ogawa K, Momosaki S, Kawato M, Yamashita O. Comprehensive evaluation of pipelines for classification of psychiatric disorders using multi-site resting-state fMRI datasets. Neural Netw. 187, 107335, 2025 Shinsuke Koike, Saori C Tanaka, Takuya Hayashi. Beyond case-control study in neuroimaging for psychiatric disorders: Harmonizing and utilizing the brain images from multiple sites. Neuroscience and biobehavioral reviews 171, 106063, 2025 Itahashi T, Yamashita A, Takahara Y, Yahata N, Aoki YY, Fujino J, Yoshihara Y, Nakamura M, Aoki R, Okimura T, Ohta H, Sakai Y, Takamura M, Ichikawa N, Okada G, Okada N, Kasai K, Tanaka SC, Imamizu H, Kato N, Okamoto Y, Takahashi H, Kawato M, Yamashita O, Hashimoto RI. Generalizable and transportable resting-state neural signatures characterized by functional networks, neurotransmitters, and clinical symptoms in autism, Molecular Psychiatry, 30(4), 1466–1478, 2025. Tanaka SC et al. The status of MRI databases across the world focused on psychiatric and neurological disorders, Psychiatry and Clinical Neurosciences78（10）, 563-579, 2024 Morishita T, Sakai Y, Iida H, Tanaka H, Permana GI, Kobayashi H, Tanaka SC, Abe H. Surgical Concepts and Long-term Outcomes of Thalamic Deep Brain Stimulation in Patients with Severe Tourette Syndrome: A Single-center Experience. Neurol Med Chir (Tokyo) Published online June 19, 2024. Kawashima I, Hinuma T, Nagata M, Yoneyama A, Honjo M, Kumano H, Tanaka SC. Psychometric properties of the Japanese version of the standardised assessment of personality abbreviated scale. Frontiers in Psychology 14, 1339902, 2024 Morishita T, Sakai Y, Iida H, Yoshimura S, Fujioka S, Oda K, Tanaka SC, Abe H. Precision Mapping of Thalamic Deep Brain Stimulation Lead Positions Associated With the Microlesion Effect in Tourette Syndrome. Neurosurgery 93(4), 875-883, 2023 Hamamura T, Kobayashi N, Oka T, Kawashima I, Sakai Y, Tanaka SC, Honjo M. Validity, reliability, and correlates of the Smartphone Addiction Scale–Short Version among Japanese adults. BMC Psychology 11(1), 78, 2023 Nakamura Y, Ishida T, Tanaka SC, Mitsuyama Y, Yokoyama S, Shinzato H, Itai E, Okada G, Kobayashi Y, Kawashima T, Miyata J, Yoshihara Y, Takahashi H, Aoki R, Nakamura M, Ota H, Itahashi T, Morita S, Kawakami S, Abe O, Okada N, Kunimatsu A, Yamashita A, Yamashita O, Imamizu H, Morimoto J, Okamoto Y, Murai T, Hashimoto RI, Kasai K, Kawato M, Koike S. Distinctive alterations in the mesocorticolimbic circuits in various psychiatric disorders. Psychiatry and Clinical Neurosciences 77(6), 345-354, 2023 Ishida T, Nakamura Y, Tanaka SC, Mitsuyama Y, Yokoyama S, Shinzato H, Itai E, Okada G, Kobayashi Y, Kawashima T, Miyata J, Yoshihara Y, Takahashi H, Morita S, Kawakami S, Abe O, Okada N, Kunimatsu A, Yamashita A, Yamashita O, Imamizu H, Morimoto J, Okamoto Y, Murai T, Kasai K, Kawato M, Koike S. Aberrant Large-Scale Network Interactions Across Psychiatric Disorders Revealed by Large-Sample Multi-Site Resting-State Functional Magnetic Resonance Imaging Datasets. Schizophrenia bulletin 49(4), 933-943, 2023 Kawashima I, Hinuma T, Tanaka SC. Ecological momentary assessment of mind-wandering: meta-analysis and systematic review. Scientific Reports 13(1), 2023 Kawashima I, Nagahama T, Kumano H, Momose K, Tanaka SC. Pavlovian-based neurofeedback enhances meta-awareness of mind-wandering. Neural Networks 158, 239-248, 2022 Sakai Y, Sakai Y, Abe Y, Narumoto J, Tanaka SC. Memory trace imbalance in reinforcement and punishment systems can reinforce implicit choices leading to obsessive-compulsive behavior. Cell Reports 40(9), 111275, 2022 Kasai K, Yagishita S, Tanaka SC, Koike S, Murai T, Nishida A, Yamasaki S, Ando S, Kawakami N, Kanehara A, Morita K, Kumakura Y, Takahashi Y, Sawai Y, Uno A, Sakakibara E, Okada N, Okamoto Y, Nochi M, Kumagaya SI, Fukuda M. Personalized values in life as point of interaction with the world: Developmental/neurobehavioral basis and implications for psychiatry. Psychiatry and Clinical Neurosciences Report 1(2), e12, 2022 Kurokawa R, Kamiya K, Koike S, Nakaya M, Uematsu A, Tanaka SC, Kamagata K, Okada N, Morita K, Kasai K, Abe O. Cross-scanner reproducibility and harmonization of a diffusion MRI structural brain network: A traveling subject study of multi-b acquisition. NeuroImage 245, 118675, 2021 Suzuki Y, Tanaka SC. Functions of the ventromedial prefrontal cortex in emotion regulation under stress. Scientific Reports 11(7), 18225, 2021 Tanaka SC, Yamashita A, Yahata N, Itahashi T, Lisi G, Yamada T, Ichikawa N, Takamura M, Yoshihara Y, Kunimatsu A, Okada N, Hashimoto R, Okada G, Sakai Y, Morimoto J, Narumoto J, Shimada Y, Mano H, Yoshida W, Seymour B, Shimizu T, Hosomi K, Saitoh Y, Kasai K, Kato N, Takahashi H, Okamoto Y, Yamashita O, Kawato M and Imamizu H. A multi-site, multi-disorder resting-state magnetic resonance image database. Scientific Data 8, 227, 2021 Maikusa N, Zhu Y, Uematsu A, Yamashita A, Sa",
  "content_length": 25870,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:16"
}