{
  "name": "Saptarshi Ghosh 0001",
  "homepage": "https://sites.google.com/site/saptarshighosh",
  "status": "success",
  "content": "Saptarshi's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationSaptarshi  GhoshAssociate ProfessorDepartment of Computer Science and EngineeringIndian Institute of Technology Kharagpur               Kharagpur - 721302, West Bengal, India.[Head, Max Planck Partner Group]Email:saptarshi @ cse . iitkgp . ac . insaptarshi . ghosh @ gmail . comBrief BioI am an Associate Professor at the Department of Computer Science and Engineering, Indian Institute of Technology (IIT) Kharagpur. My current research interests are in Legal data analytics, AI and Sustainability and Algorithmic bias and fairness. My research is inter-disciplinary and uses techniques from Machine Learning, Natural Language Processing, Information Retrieval, Computational Social Science, and Complex Network Theory. I received my PhD in Computer Science from IIT Kharagpur in 2013. I was a Humboldt Post-doctoral research fellow at the Max Planck Institute for Software Systems (MPI-SWS), Germany. I head a Max Planck Partner Group at IIT Kharagpur, that focuses on algorithmic bias and fairness.Profiles:  Google scholar | Scopus | DBLP | LinkedIn | Semantic Scholar | Web of Science | ACL AnthologyNote about internships: I am unable to offer summer/winter internships to students from outside IIT Kharagpur. Apologies for not being able to personally reply to the numerous emails about internships.NewsSpecial Issue of the Artificial Intelligence & Law journal on \"Applications and Evaluation of Large Language Models in the Legal Domain\" completed with 15 high-quality papers from all over the world. It was a pleasure to co-edit the issue with Jack Conrad, Kripabandhu Ghosh and Debasis Ganguly. Our AAAI 2022 paper \"LeSICiN: A Heterogeneous Graph-Based Approach for Automatic Legal Statute Identification from Indian Legal Documents\" wins the Markose Thomas Memorial Award for being one of the two best research papers published from the Department of CSE, IIT Kharagpur during 2022-23. Congratulations Shounak and Pawan !!Website for AI-Law research group at IIT Kharagpur launched - please visit link Paper accepted at EMNLP 2025 Main conference: IL-PCSR: Legal Corpus for Prior Case and Statute Retrieval Honoured to be awarded a Faculty Excellence Award at Associate Professor level by IIT Kharagpur, on the occasion of the 75th Foundation Day (18 August 2025) [for contributions towards teaching, research and institutional development]Co-organizing the Workshop JustNLP (Workshop on NLP for Empowering Justice) with IJCNLP-AACL 2025. Please consider submitting your work !!Co-organizing the Workshop BHASHA (Benchmarks, Harmonization, Annotation, and Standardization for Human-Centric AI in Indian Languages) with IJCNLP-AACL 2025. Please consider submitting your work !!Paper accepted at ASONAM 2025: Justice for the Disadvantaged: A Study of Public Reactions on Indian Supreme Court JudgmentsPaper accepted at the International Journal of Disaster Risk Reduction: Humanitarian Classification of Crisis-related Microblogs in Bengali: A Comparison of Multilingual Pre-trained Language ModelsHonoured to deliver an AI, Computing, and Society (AICS) Distinguished Speaker Lecture at the Max Planck Institute for Software Systems (MPI-SWS), Kaiserslautern, Germany (June 2025)Invited talk on NLP for the legal domain at the Max Planck Institute for Research on Collective Goods, Bonn (June 2025)Invited talk on NLP for the legal domain at the Ruhr University, Bochum (June 2025)Invited talk on Law & AI at HEC Paris (June 2025)Paper accepted at ACL 2025 Findings: Brevity is the soul of sustainability: Characterizing LLM response lengthsPaper accepted at ACL 2025 Findings: Label-semantics Aware Generative Approach for Domain-Agnostic Multilabel ClassificationOur Language Model pre-trained on Indian legal text -- InLegalBERT -- reaches 1 million downloads on Huggingface !!Reached 6000 citations (according to Google Scholar)Paper accepted at NAACL 2025 Main conference: Towards Sustainable NLP: Insights from Benchmarking Inference Energy in Large Language ModelsPaper accepted at Artificial Intelligence and Law journal:  MARRO: Multi-headed Attention for Rhetorical Role Labeling in Legal DocumentsHonoured to be appointed a Fellow of the Institution of Engineers (India)Paper accepted at ACL 2024 Main conference: IL-TUR: Benchmark for Indian Legal Text Understanding and ReasoningPaper accepted in Artificial Intelligence and Law journal: Applicability of Large Language Models and Generative Models for Legal Case Judgement SummarizationAwarded Gemma Academic Program GCP Credit Award. Thanks Google for the support !!Paper accepted at AAAI/ACM Conference on AI, Ethics and Society 2024: Breaking the Global North Stereotype: A Global South-centric Benchmark Dataset for Auditing and Mitigating Biases in Facial Recognition SystemsPaper accepted at AAAI/ACM Conference on AI, Ethics and Society 2024: Sponsored is the New Organic: Implications of Sponsored Results on Quality of Search Results in the Amazon MarketplacePaper accepted at CSCW 2024: Investigating Nudges toward Related Sellers on E-commerce Marketplaces: A Case Study on AmazonOrganizing the ICPR2024 Competition on Multilingual Claim-Span Identification. Winning teams stand to win prizes and certificates [competition website]Paper accepted at SIGIR 2024 (Resource & Reproducibility track): Legal Statute Identification: A Case Study using State-of-the-Art Datasets and MethodsPaper accepted at SIGIR 2024 (short): Instruction-Guided Bullet Point Summarization of Long Financial Earnings Call TranscriptsProject \"NyayKosh: Multilingual Resources for AI-based Legal Analytics\" sanctioned for funding by AI4ICPS Hub Foundation, IIT Kharagpur. Thanks for the support !!Paper accepted at ACM Transactions on the Web: MuLX-QA: Classifying Multi-Labels and Extracting Rationale Spans in Social Media PostsPaper accepted at NAACL 2024: Beyond Borders: Investigating Cross-Jurisdiction Transfer in Legal Case SummarizationPaper accepted at NAACL 2024: Parameter-Efficient Instruction Tuning of Large Language Models For Extreme Financial Numeral Labelling Paper accepted at CVPR 2024: Convolutional Prompting meets Language Models for Continual Learning Paper accepted at ICWSM 2024: How COVID-19 has Impacted the Anti-Vaccine Discourse: A Large-Scale Twitter Study Spanning Pre-COVID and Post-COVID Era Elevated to IEEE Senior Member Co-editing a Special Issue of the Artificial Intelligence & Law journal on \"Applications and Evaluation of Large Language Models in the Legal Domain\". Paper accepted at EMNLP 2023: MILDSum: A Novel Benchmark Dataset for Multilingual Summarization of Indian Legal Case Judgments (with Debtanu Datta, Shubham Soni, Rajdeep Mukherjee)Paper accepted at ICCV 2023: Exemplar-Free Continual Transformer with Convolutions (with Anurag Roy, Vinay Verma, Sravan Voonna, Kripabandhu Ghosh, Abir Das)Paper accepted at ICDAR 2023: TransDocAnalyser: A framework for semi-structured offline handwritten documents analysis with an application to legal domain (with Sagar Chakraborty, Gaurav Harit)Co-chairing the Artificial Intelligence on Social Media (AISoMe) data challenge with the FIRE2023 conference, comprising of a very challenging classification task on social media text - please participate !Honoured to be invited to speak on Legal NLP at the Symposium on NLP for Social Good at University of Liverpool (June 2023)Paper accepted at ICAIL 2023: Pre-trained Language Models for the Legal Domain: A Case Study on Indian Law (with Shounak Paul, Arpan Mandal, Pawan Goyal). Presents the first Transformer-based Language Models pre-trained on Indian legal text -- InLegalBERT, InCaseLawBERT, CustomInLawBERT -- an important resource for advancement of Legal NLP in India.Congratulations Abhisek Dash for defending his PhD thesis titled \"Bias and Fairness in Information Retrieval Algorithms on E-commerce Platforms\" (co-supervised with Prof. Animesh Mukherjee).  Abhisek is now a postdoc at MPI-SWS, Germany. Organized the 3rd Symposium on AI and Law (SAIL2023) during February 24--26, 2023 as a hybrid event at IIIT Hyderabad. Details at https://sites.google.com/view/sail-2023/ Paper accepted in the Artificial Intelligence and Law journal: Ensemble methods for improving extractive summarization of legal case judgements (with Aniket Deroy and Kripabandhu Ghosh) Delivered a tutorial on the application of AI in the legal domain at CODS-COMAD 2023, along with Jack Conrad, (Director and Lead Research Scientist), Shirsha Ray Chaudhuri (Director of Engineering) from Thomson Reuters, and Shounak Paul (PhD student) [Resource page]  Paper accepted at EMNLP 2022: ECTSum: A New Benchmark Dataset For Bullet Point Summarization of Long Earnings Call Transcripts. Congratulations Rajdeep !!Paper accepted at AACL-IJCNLP 2022: Legal Case Document Summarization: Extractive and Abstractive Methods and their Evaluation. Congratulations Abhay, Paheli, Soham, Rajdeep !!Our work on fairness in e-commerce search covered by the Data Skeptic -- podcast available hereCongratulations to Paheli for defending her PhD at IIT Kharagpur!! Thesis title: Text and Graph Processing Methods for Assisting Legal PractitionersHonoured to be awarded the A K Singh Young Faculty Award at Assistant Professor level, by IIT Kharagpur (2022) [for contributions towards teaching, research and institutional development]Paper accepted at the Information Processing and Management journal: Legal Case Document Similarity: You Need Both Network and Text. Congratulations Paheli !! Congratulations Abhisek for getting a postdoctoral offer from the Max Planck Institute for Software Systems (MPI-SWS) !!Congratulations Arpan for getting a postdoctoral offer from the University of Southampton !!Presented our works on Law-AI to a global Thomson Reuters audience, as part of AI@TR Invited Speaker Series. Thanks Jack Conrad for the invite !!Honoured to be appointed a Section Editor (on Legal Information Retrieval) for the prestigious",
  "content_length": 14844,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:17"
}