{
  "name": "Saqib A. Kakvi",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/saqib-kakvi",
  "status": "success",
  "content": "Saqib Kakvi - Royal Holloway Research Portal Saqib Kakvi, FHEA Dr Lecturer in Information Security, Department of Information Security https://orcid.org/0000-0003-4425-4240 Phone+44 1784 917683EmailSaqib.Kakvirhul.acuk TW20 0EX Research output 9 Conference contribution 5 Article 1 Chapter 1 Paper 1 More 1 Doctoral Thesis Research output per year Research output per year SoK: Anonymous CredentialsKakvi, S., Martin, K. M., Putman, C. & Quaglia, E., 7 Apr 2023, (E-pub ahead of print) Security Standardisation Research: 8th International Conference, SSR 2023, Lyon, France, April 22-23, 2023, Proceedings. Günther, F. & Hesse, J. (eds.). Springer, p. 129-151 23 p. (Lecture Notes in Computer Science; vol. 13895).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Identity-Based Encryption in DDH Hard GroupsBlazy, O. & Kakvi, S. A., 6 Oct 2022, (E-pub ahead of print) Progress in Cryptology - AFRICACRYPT 2022: 13th International Conference on Cryptology in Africa, AFRICACRYPT 2022, Fes, Morocco, July 18-20, 2022, Proceedings. Batina, L. & Daemen, J. (eds.). Springer Nature Switzerland AG, p. 81-102 22 p. (Lecture Notes in Computer Science; vol. 13503).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Offline Witness Encryption with Semi-adaptive SecurityChvojka, P., Jager, T. & Kakvi, S. A., 27 Aug 2020, Applied Cryptography and Network Security : 18th International Conference, ACNS 2020, Rome, Italy, October 19-22, 2020, Proceedings, Part I. Conti, M., Zhou, J., Casalicchio, E. & Spognardi, A. (eds.). Springer, p. 231-250 20 p. (Lecture Notes in Computer Science; no. 12146).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Skipping the q in Group SignaturesBlazy, O. & Kakvi, S. A., 8 Dec 2020, Progress in Cryptology - INDOCRYPT 2020 : 21st International Conference on Cryptology in India, Bangalore, India, December 13-16, 2020, Proceedings. Bhargavan, K., Oswald, E. & Prabhakaran, M. (eds.). Springer, p. 553-575 23 p. (Lecture Notes in Computer Science; vol. 12578).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution SoK: Comparison of the Security of Real World RSA Hash-and-Sign SignaturesKakvi, S. A., 24 Nov 2020, Security Standardisation Research - 6th International Conference, SSR 2020, London, UK, November 30 - December 1, 2020, Proceedings. Merwe, T. V. D., Mitchell, C. J. & Mehrnezhad, M. (eds.). Springer, p. 91-113 23 p. (Lecture Notes in Computer Science; vol. 12529).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution View all 17 research outputs",
  "content_length": 2672,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:18"
}