{
  "name": "Sarah M. Preum",
  "homepage": "https://web.cs.dartmouth.edu/people/sarah-masud-preum",
  "status": "success",
  "content": "Sarah M. Preum | Department of Computer Science Skip to main content Sarah M. Preum Assistant Professor Appointments Assistant Professor of Computer Science Adjunct Faculty, Department of Biomedical Data Science, Geisel School of Medicine Faculty Affiliate, Center for Technology and Behavioral Health (CTBH) Technical Associate Director, Dartmouth Center for Precision Health and Artificial Intelligence Area of Expertise Natural Language Processing, Human-AI Interaction, Multimodal AI, Social Computing, Computational Health Download CV Download CV Biography My research lies at the intersection of human-centered natural language processing (NLP), human–AI interaction, social computing, and computational health. I design socio-technical AI systems that reduce communication burdens, support uncertainty-aware decision-making, and enhance outcomes in high-stakes, communication-intensive domains, such as healthcare. My work spans a range of settings, from primary and critical care to emergency medical services and online health communities, across both the U.S. and the Global South. I focus on building AI systems that work collaboratively with people, adapt to context and user needs, and promote equitable and trustworthy technology. My research has been recognized with a Google Research Scholar Award, Rising Stars in EECS selection, multiple best paper nominations, and funding from the NIH, NSF, Google, CTSA, and other institutional grants. I also serve as an Associate Editor for ACM Health. View More Education B.Sc. Bangladesh University of Engineering and Technology M.Sc. University of Virginia Ph.D. University of Virginia View More Taught Courses COSC 89/189: Human-centered Large Language Models COSC 74/274: Machine Learning and Statistical Data Analysis CS 72/Ling 48: Accelerated Computational Linguistics COSC 89/189: Computational Healthcare View More Publications Joseph Gatto, Omar Sharif, Parker Seegmiller, Sarah M. Preum. Large Language Models for Document-Level Event-Argument Data Augmentation for Challenging Role Types. The 63rd  Annual Meeting of the Association for Computational Linguistics (ACL) 2025. Joseph Gatto, Parker Seegmiller, Timothy Burdick, Inas S. Khayal, Sarah DeLozier, Sarah M. Preum. Follow-up Question Generation For Enhanced Patient-Provider Conversations. The 63rd Annual Meeting of the Association for Computational Linguistics (ACL) 2025. Omar Sharif, Joseph Gatto, Madhusudan Basak, Sarah M. Preum. Explicit, Implicit, and Scattered: Revisiting Event Extraction to Capture Complex Arguments. Proceedings of the International Conference on Empirical Methods in Natural Language Processing (EMNLP), 2024. Bushra Hossain, Sarah M. Preum, Md Fazle Rabbi, Rifat Ara, Mohammed Eunus Ali. Subreddit to Symptomatology: A Lexicon-based Approach to Extract Symptoms of Complex Conditions from Online Discourse. Journal of Medical Internet Research (JMIR), 2025. Omar Sharif, Madhusudan Basak, Tanzia Parvin, Ava Scharfstein, Alphonso Bradham, Jacob Borodovsky, Sarah Lord, Sarah M. Preum. Characterizing Information Seeking Events in Health-Related Social Discourse. The 38th Annual AAAI Conference on Artificial Intelligence (AAAI), 2024. Will Romano, Omar Sharif, Madhusudan Basak, Joseph Gatto, and Sarah M. Preum. Theme-driven Keyphrase Extraction to Analyze Social Media Discourse. Proceedings of the AAAI Conference on Web and Social Media (ICWSM). 2024 Sarah M. Preum, Sirajum Munir, Meiyi Ma, Mohammad Yasar, David J. Stone, Ronald D. Williams, Homa Alemzadeh, and John Stankovic. A Review of Cognitive Assistants for Healthcare: Trends, Prospects, and Future Directions. ACM Computing Surveys, 2021. View More Speaking Engagements View More Works in Progress View More Selected Works & Activities View More <p>&nbsp;</p><div id=\"highlighter--hover-tools\" style=\"display: none;\"><div id=\"highlighter--hover-tools--container\"><div class=\"highlighter--icon highlighter--icon-tag\" title=\"Tag\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\">&nbsp;</div></div></div><div id=\"highlighter--hover-tools\" style=\"display: none;\"><div id=\"highlighter--hover-tools--container\"><div class=\"highlighter--icon highlighter--icon-tag\" title=\"Tag\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\">&nbsp;</div></div></div><div id=\"highlighter--hover-tools\" style=\"display: none;\"><div id=\"highlighter--hover-tools--container\"><div class=\"highlighter--icon highlighter--icon-tag\" title=\"Tag\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-copy\" title=\"Copy\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-change-color\" title=\"Change Color\">&nbsp;</div><div class=\"highlighter--separator\">&nbsp;</div><div class=\"highlighter--icon highlighter--icon-delete\" title=\"Delete\">&nbsp;</div></div></div> Contact Sarah.Masud.Preum@dartmouth.edu Engineer and Comp Science Ctr, Room 019 HB 6211 Departments Biomedical Data Science Computer Science Related Links Personal Website Connect Contact Us Contact Us inclusivity at dartmouth Dartmouth is committed to academic excellence and encourages the open exchange of ideas within a culture of mutual respect. People with different backgrounds, life experiences, and perspectives make the Dartmouth community diverse, which enhances academic excellence.",
  "content_length": 6060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:26"
}