{
  "name": "Sarah Pink",
  "homepage": "https://research.monash.edu/en/persons/sarah-pink",
  "status": "success",
  "content": "Sarah Pink - Monash University View Scopus Profile Sarah Pink Professor Professor (Research), Department of DesignProfessor, Department of Human Centred Computing https://orcid.org/0000-0003-0073-8382 EmailSarah.Pinkmonashedu Accepting PhD Students 1996 …2026 Research activity per year Personal profile BiographySarah Pink is a an award winning design and futures anthropologist and documentary filmmaker, whose work is influential internationally both inside and beyond academia. Sarah is an Australian Research Council Laureate Professor, and has Honorary Doctorates from Malmo and Halmstad Universities in Sweden. Sarah is currently Professor and Director of FUTURES Hub and the Emerging Technologies Research Lab at Monash, where she engages and innovates interdisciplinary and international research approaches to offer fresh perspectives and realistic future visions and foresight about the role of human futures in shaping digital and net zero transitions. She has a joint appointment across the Faculty of Art, Design and Architecture and the Faculty of Information Technology. Sarah has over 25 years experiences of working with academic and industry research partners internationally and frequently gives keynote and public lectures in academic and business environments internationally. She has published numerous academic books, peer referred journal articles and book chapters and directed several documentaries. Sarah is also known for her career-long focus on innovating new research and dissemination methodologies, and engaging design futures, digital, visual and sensory methods in interdisciplinary projects to engage with contemporary issues and challenges. Sarah's research has been funded by national research councils in Australia, UK, Sweden, Norway and Spain, and the EU, and through industry partnerships internationally. ConsultingSarah consults in her areas of expertise, focused on the social, cultural and experiential dimensions of technology design and use. She has experience of consulting with large companies as well as design, branding and research agencies internationally. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationSocial Anthropology , PhD, University of Kent Social Anthropology, 1st class BA Hons, University of Kent Visual Anthropology , MA, University of Manchester External positionsFellow, Academy of the Social Sciences in Australia Incorporated2019 → …International Visiting Professor, Hogskolan i Halmstad (Halmstad University)2014 → …Visiting Professor, Loughborough University2012 → … Research area keywordsdesign anthropologyemerging technologiesinnovative ethnographyvisual ethnographyautomated decision makingfuture mobilitiesfuture healthfuture energyfuture of work Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2019 2020 2021 2029 7 Active 12 Finished Projects per year CSIRO Next Generation AI for Clean Energy and Sustainability: A welcome addition, or an inevitable intrusion?Wang, H. (Primary Chief Investigator (PCI)), Strengers, Y. (Chief Investigator (CI)), Pink, S. (Chief Investigator (CI)), Bradshaw, A. (Chief Investigator (CI)), Spak, B. (Chief Investigator (CI)) & Grealy, M. (Chief Investigator (CI))7/07/25 → 6/01/29Project: Research SFL: Scenarios for Future Living: Putting People at the Centre of the Energy TransitionStrengers, Y. (Primary Chief Investigator (PCI)), Pink, S. (Chief Investigator (CI)), Ben-David, R. (Chief Investigator (CI)), MacGill, I. (Chief Investigator (CI)), Roberts, M. (Chief Investigator (CI)), Bruce, A. (Chief Investigator (CI)), Passey, R. (Chief Investigator (CI)), McConnell , D. (Chief Investigator (CI)), Mellick Lopes, A. (Chief Investigator (CI)), Tonkinwise, C. (Chief Investigator (CI)), Briggs, C. (Chief Investigator (CI)), Riedy, C. (Chief Investigator (CI)), Kaviani, F. (Chief Investigator (CI)), Dahlgren, K. (Chief Investigator (CI)) & Lipscombe, S. (Project Manager)6/12/24 → 6/12/27Project: Research The impact of human futures on Australia’s digital and net zero transitionPink, S. (Primary Chief Investigator (PCI))24/06/24 → 23/06/29Project: Research AI for Clean Energy and SustainabilityWang, H. (Primary Chief Investigator (PCI)), Jalili, M. (Chief Investigator (CI)), Strengers, Y. (Chief Investigator (CI)), Hill, D. (Chief Investigator (CI)), Razzaghi, R. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Liebman, A. (Associate Investigator (AI)), Pink, S. (Associate Investigator (AI)), Le Bodic, P. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Wang, T. (Associate Investigator (AI)), Vered, M. (Associate Investigator (AI)), Rong, J. (Associate Investigator (AI)), George, Y. (Associate Investigator (AI)), Song, H. (Associate Investigator (AI)), Tafakori, L. (Associate Investigator (AI)), Sajjadi, S. (Associate Investigator (AI)), Pourkhanali, A. (Associate Investigator (AI)), Moradiamani, A. (Associate Investigator (AI)) & Kamoona, A. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Net Zero Precincts: an interdisciplinary approach to decarbonising citiesRaven, R. (Primary Chief Investigator (PCI)), Pink, S. (Chief Investigator (CI)), Webb, G. (Chief Investigator (CI)), Farrelly, M. (Chief Investigator (CI)), Liebman, A. (Chief Investigator (CI)), Coxon, S. (Chief Investigator (CI)), Graham, P. (Chief Investigator (CI)), Quillinan, A. (Partner Investigator (PI)) & Cailes, D. (Partner Investigator (PI))1/09/21 → 31/08/26Project: Research View all 19 projects Research output Research output per year 1996 2013 2015 2016 2017 2018 2021 2022 2025 2026 153 Article 85 Chapter (Book) 18 Book 17 Conference Paper 50 More 13 Edited Book 8 Editorial 7 Commissioned Report 6 Other Report 6 Audio / Visual Recording 5 Comment / Debate 2 Foreword / Postscript 1 Paper 1 Review Article 1 Design / Architecture Research output per year Research output per year Anthropology in an Uncertain WorldPink, S., 2026, Why the World Needs Anthropologists. Podjed, D. & Guerrón Montero, C. (eds.). 2nd ed. New York NY USA: Routledge, p. 65-81 17 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Other › peer-review Design and Futures Anthropologies for Transitions: Reframing the Journey to Net ZeroPink, S., Quilty, E., Sharp, D., Raven, R. & Tuckwell, D., 2026, Post-Carbon Futures: Imagining (and Enacting) New Worlds through Transition Studies. Willow, A. & Abiral, B. (eds.). 1st ed. New York NY USA: Routledge, p. 282-298 17 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research › peer-review 1 Citation (Scopus) Introduction - Moving forward with anthropologyPink, S., 2026, Beyond Perception: Correspondences with Tim Ingold's Work. Oxon UK: Routledge, p. 195-202 7 p.Research output: Chapter in Book/Report/Conference proceeding › Foreword / Postscript › Other › peer-review Open AccessFile Mobile Media Technologies and the Future of ChargingPink, S., 2026, The Routledge Companion to Mobile Media: Second Edition. Goggin, G. & Hjorth, L. (eds.). New York USA: Taylor & Francis, p. 138-146 9 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Other › peer-review Anticipatory automated mobilitiesPhan, T. & Pink, S., 2025, In: Mobilities. 20, 2, p. 223-229 7 p.Research output: Contribution to journal › Editorial › Other Open Access View all 323 research outputs Prizes 2016 The CIOB Award for the Best International PaperLingard, H. (Recipient), Pink, S. (Recipient), Hayes, J. (Recipient), McDermott, V. (Recipient) & Harley, J. (Recipient), 2016Prize: Prize (including medals and awards) 2021 9th Asia Pacific Eldercare Innovation Awards, Best Ageing Research - Winner: 'Smart homes for seniors: Intelligent home design for independent living'Pink, S. (Recipient), Duque, M. (Recipient), Strengers, Y. (Recipient) & Williams, C. (Recipient), 2021Prize: Prize (including medals and awards) 2021 IoT (Internet of Things) Awards, Diversity, Equity & Inclusion in Action - Winner: 'Smart Homes for Seniors: Intelligent home design for independent living'Strengers, Y. (Recipient), Pink, S. (Recipient), Duque Hurtado, M. (Recipient), Martin, R. (Recipient), Nicholls, L. (Recipient), Mortimer, M. (Recipient), Horan, B. (Recipient), Eugene, A. (Recipient) & Thomson, S. (Recipient), 2021Prize: Prize (including medals and awards) 2023 Good Design Award, Design Research - Gold Winner: 'City Sensing Data Futures'Pink, S. (Recipient), Vallentine, B. (Recipient), Lanzeni, D. (Recipient), Fridman, I. (Recipient), Duque Hurtado, M. (Recipient), Sumartojo, S. (Recipient) & Lundberg, R. (Recipient), 8 Sept 2023Prize: Prize (including medals and awards) 2023 Good Design Award, Design Research - Gold Winner: 'Smart Homes for Seniors'Pink, S. (Recipient), Williams, C. (Recipient), Duque Hurtado, M. (Recipient), Nichols, L. (Recipient) & Martin, R. (Recipient), 8 Sept 2023Prize: Prize (including medals and awards) View all 10 prizes Activities Activities per year 2017 2017 2019 2021 2022 2023 2024 2024 3 Contribution to conference 3 Public event 1 Consultancy Activities per year International Conference On Sustainability Transitions 2024Sharp, D. (Speaker), Quilty, E. (Speaker), Tuckwell, D. (Speaker), Rye, S. (Speaker), Pink, S. (Speaker), Farrelly, M. (Speaker) & Raven, R. (Speaker)17 Jun 2024Activity: Participating in or organising an event types › Contribution to conference Interna",
  "content_length": 12255,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:26"
}