{
  "name": "Sarah Nadi",
  "homepage": "https://sarahnadi.org",
  "status": "success",
  "content": "Sarah Nadi I am an Associate Professor of Computer Science at New York University Abu Dhabi. I also hold an adjunct position at the University of Alberta. I co-direct the SANAD lab lab where we design tools and techniques that can help software developers perform their tasks more efficiently and effectively. My research heavily relies on the idea of mining software repositories, where I extract and analyze data from existing software repositories (e.g., version control systems, issue tracking systems, crowd-sourced question/answer websites) to infer insights that can help developers perform their tasks. For more info on my research, please check SANAD’s research projects and my publications. If you would like to work with me, please check current open positions at the SANAD lab. Email: sarah.nadi@nyu.edu Office: Building A1, Office 177 Recent News Aug 11, 2025 SANAD is hiring fully funded PhD students at NYUAD for Fall 2026! May 14, 2024 I'm hiring fully funded PhD students at NYUAD for Fall 2025! Jan 22, 2024 Our paper on characterizing Python library migration got accepted at FSE’24! Selected Publications LEARNER A Friend or a Foe? Evaluating ChatGPT’s Impact on Students’ Computational Thinking Skills May Mahmoud, Eric Asare, Nourhan Sakr, and Sarah Nadi In Proceedings of International Workshop on evaLuation and assEssment in softwARe eNgineers’ Education and tRaining (LEARNER 2025), 2025 PDF ESEM An Empirical Study of API Misuses of Data-Centric Libraries Akalanka Galappaththi, Sarah Nadi, and Christoph Treude In Proceedings of the ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM ’24), 2024 PDF ESEC/FSE Characterizing Python Library Migrations Mohayeminul Islam, Ajay Kumar Jha, Ildar Akhmetov, and Sarah Nadi In Proceedings of the ACM International Conference on the Foundations of Software Engineering (FSE), 2024 PDF TSE An Empirical Evaluation of Using Large Language Models for Automated Unit Test Generation Max Schäefer, Sarah Nadi, Aryaz Eghbali, and Frank Tip IEEE Transactions on Software Engineering, 2023 HTML DataPDF Code TSE Operation-Based Refactoring-Aware Merging: An Empirical Evaluation Max Ellis, Sarah Nadi, and Danny Dig IEEE Transactions on Software Engineering, 2023 DataPDF Code MSR PyMigBench: A Benchmark for Python Library Migration Mohayeminul Islam, Ajay Kumar Jha, Sarah Nadi, and Ildar Akhmetov In Proceedings of the 20th ACM International Conference on Mining Software Repositories (MSR) – Data Showcase Track , 2023 DataPDF EMSE Selecting Third-party Libraries: The Data Scientist’s Perspective Sarah Nadi, and Nourhan Sakr Empirical Software Engineering Journal (EMSE), 2022 PDF",
  "content_length": 2684,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:26"
}