{
  "name": "Sara Cohen",
  "homepage": "http://www.cs.huji.ac.il/~sara",
  "status": "success",
  "content": "Sara Cohen \"Data! Data! Data!\" he cried impatiently. \"I can't make bricks without clay.\" About I am a full professor and, since October 2022, the dean of the Selim and Rachel Benin Department of Computer Science and Engineering at Hebrew University. My research focuses on both theoretical and practical aspects of database management systems. My list of publications is accessible via DBLP. Office: Rothberg 534C 02-5494545 firstname at cs dot huji dot ac dot il Research Over the years, I have done research on many different ares of databases, including: query equivalence, full disjunctions, imprecise querying, XML, aggregate functions, database generation, querying probabilistic data, link prediction, and social network databases. My current research focuses on team formation, learning queries from examples, data discovery, and clustering as a first-class database operator. Some of the code from previous projects is available here. If you are a highly motivated student, with some background in the database area, and are considering working on a research project, you are welcome to contact me for details. Teaching Current or recent courses: Databases Big Data Processing: Theory and Practice Seminar on Databases and the Internet Lab in Modern Databases Information Retrieval on the Web (Spring 2017) Service I have been a program committee member at: PODS (2025, 2018, 2014, 2011, 2009, 2007) ICDT (2027, 2021, 2016, 2014, 2013, 2011, 2010, 2009) VLDB (2018, 2009, 2007) SIGMOD (2020, 2015) EDBT (2017, 2007) ICDE (2020 PhD Symposium, 2019, 2016, 2015, 2010, 2007) WebDB (2016) NDA (2017) DEXA (2009) DBPL (2005) BLOCKDM (2019) BLOCKSW (2019) AMW (2020, 2023) I am on the steering and program committee for the annual Israeli Database Day. Personal I am married to Chaim and have seven children.",
  "content_length": 1811,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:20"
}