{
  "name": "Sarah Zelikovitz",
  "homepage": "http://www.cs.csi.cuny.edu/~zelikovi",
  "status": "success",
  "content": "Sarah Zelikovitz Home Page Sarah Zelikovitz, PhD Professor, Department of Computer Science College of Staten Island of CUNY sarah.zelikovitz@csi.cuny.edu Spring 2025 Introduction to Computer Science CSC126 See Blackboard site for the course. Spring 2023 Introduction to Computer Science CSC126 See Blackboard site for the course. Data Mining CSc 84040 Fall 2022 Introduction to Computer Science CSC126 See Blackboard site for the course. Introduction to Computer Technology CSC115 See BB site for the course Spring 2022 Introduction to Data Science CSC245 See Blackboard site for the course. This class also uses DataCamp that provides university access to 350+ courses on data science and analytics. Seminar in Computer Science CSC490 Fall 2021 Introduction to Data Science CSC245 See Blackboard site for the course. This class also uses DataCamp that provides university access to 350+ courses on data science and analytics. Seminar in Computer Science CSC490 Spring 2021 Introduction to Data Science CSC245 Fall 2020 Introduction to Computer Science CSC126 Seminar in Computer Science CSC490 Other Classes Introduction to Computer Science CSC126 Intermediate Computer Science CSC 211 Web Application Databases CSC 226 -- See BlackBoard Site This class uses DataCamp , that provides free university access to its 350+ courses on tipcs in data science and analytics. Data Structures CSC 326 Discrete Mathematics CSC 228 Artificial Intelligence and Knowledge Engineering CSC 731 Undergraduate Advisement Procedures Fill out the degree checklist before your advisement appointment, and bring it with you. Compare your checklist with Degree Works. Find Checklists Here Flowcharts and Prereqs Prof Zelikovitz Office Hours Fall 2025: 1N 212. If you cannot make it in person, please send an email and I will respond with a zoom link. Tues 11:10PM-12:10PM, Thursday 12:10-2:00pm or by appointment. I can also meet later on Tuesday/Thursdays. Please send an email. sarah.zelikovitz@csi.cuny.edu Research Google Scholar Publications S Marcus, D Sokol and S Zelikovitz, 2d Side-Sharing Tandems with Mismatches, In: Liptak, Z., Moura, E., Figueroa, K., Baeza-Yates, R. (eds) String Processing and Information Retrieval. SPIRE 2024. Lecture Notes in Computer Science, vol 14899. Springer, Cham. https://doi.org/10.1007/978-3-031-72200-4_23 (2025) S Marcus, D Sokol and S Zelikovitz, Runs of Side-Sharing Tandems in Rectangular Arrays, Similarity Search and Applications (Sisap 2023 LNCS #1428) (2023) S Zelikovitz, C Bergeron, Short Text Classification: Detecting Depression from Tweets In: https://iima.org/wp/wp-content/uploads/2020/02/IIMA-2019-Proceedings.pdf (2019) L Dembitzer, S Zelikovitz, R J Kettler, Designing computer-based assessments: multidisciplinary findings and student perspectives, International Journal of Educational Technology, [S.l.], v. 4, n. 3, p. 20-31, Jan. 2018. ISSN 2476-0730. (2018) SP Imberman, S Zelikovitz, I Ludwig, An Ophthalmologist's Tool for Predicting Deterioration in Patients with Accommodative Esotropia, Information Technology: New Generations (ITNG), 2013 Tenth International Conference, P 738-742, (2013) Y Liang, D Sokol, S Zelikovitz, Clustering Tandem Repeats Via Trinucleotides, BioDM of IEEE International Conference on Data Mining, (2012) Taksa, Isak, Sarah Zelikovitz and Amanda Spink, Non-Topical Classification of Query Logs Using Background Knowledge, In Machine Learning Techniques for Adaptive Multimedia Retrieval: Technologies Applications and Perspectives, ed. Chia-Hung Wei and Yue Li, Pages 194-212 (2011) Susan P Imberman, Irene Ludwig, and Sarah Zelikovitz, Using Decision Trees To Find Patterns in a Clinical Ophthalmology Dataset, in Proceedings of the Twenty Fourth International FLAIRS Conference, Pages 95-96 (2011) Sarah Zelikovitz, Herbert Schanker, Donna Scimeca, Partners in Science Education: an Undergraduate Experience, Seventh International Conference on Information Technology pp.466-470, (2010) Deborah Sturm and Sarah Zelikovitz, Integrating Research Projects in CS1, Journal of Computing Sciences in Colleges, Volume 25, Issue 6, Pages 55-59 (2010) http://portal.acm.org/citation.cfm?id=1791140 Herbert Schanker, Deborah Sturm, and Sarah Zelikovitz, The Science of Computing: Concepts and Current Technologies , Proceedings of the 2009 International Conference of ITNG, Pages 963-968, http://portal.acm.org/citation.cfm?id=1588924 IEEE Computer Society (2009) Isak Taksa, Sarah Zelikovitz, and Amanda Spink, Machine learning approach to search query classification, Chapter XVI in Handbook of Web Log Analysis, Pages 329-344, IGI Publications, (2009), http://new.igi-global.com/Bookstore/TitleDetails.aspx?TitleId=520&DetailsType=Preface Susan Imberman and Sarah Zelikovitz, Robotics As A Component Of A General Education Course, (Using AI to Motivate Greater Participation in Computer Science, Proceedings of the 2008 AAAI Spring Symposium), Pages 50-54 AAAI Press (2008) Isak Taksa, Sarah Zelikovitz, and Amanda Spink, Using Web Search Logs to Identify Query Classification Term, International Journal of Web Information Systems, Volume 3 Issue 4 Pages 315-327 (2007) Susan Imberman, Roberta Klibaner, and Sarah Zelikovitz, Student Feedback on Robotics in CS1, Robots and Robot Venues: Resources for AI Education, Proceedings of the 2007 AAAI Spring Symposium), Pages 65-68, AAAI Press (2007) Isak Taksa, Sarah Zelikovitz, Amanda Spink, Using Web Search Logs to Identify Query Classification Terms, Fourth International Conference on Information Technology: New Generations, Pages 469-474 (2007), http://portal.acm.org/citation.cfm?id=1262320 Sarah Zelikovitz, William W. Cohen, and Haym Hirsh, Extending WHIRL with Background Knowledge for Improved Text Classification, Information Retrieval Volume 10, Number 1 / January, 2007 Pages 35-67 (2007) (Online version is available at: http://dx.doi.org/10.1007/s10791-006-9004-6) Sarah Zelikovitz and Marina Kogan, Using Web Searches on Important Words to Create Background Sets for LSI Classification, Proceedings of the 19th International FLAIRS Conference, Pages 598-603 (2006) Sarah Zelikovitz and Haym Hirsh, Improving Text Classification Using EM with Background Text, Proceedings of the 18th International FLAIRS Conference, Pages 499-505 (2005) Sarah Zelikovitz and Finella Marquez, Evaluation of Background Knowledge for Latent Semantic Indexing Classification, FLAIRS Conference 2005: Pages 868-870 (2005) Sarah Zelikovitz and Finella Marquez, Transductive Learning for Short-Text Classification Problems using Latent Semantic Indexing, International Journal of Pattern Recognition and Artificial Intelligence, Volume 19, Number 2, Pages 143-163, World Scientific Publishing Co., 2005 (draft copy available upon request) Sarah Zelikovitz and Robert Hafner, Automatic Generation of Background Knowledge to Aid Classification, Proceedings of the 17th International FLAIRS Conference (2004) Sarah Zelikovitz, Transductive LSI for Short Text Classification Problems, Proceedings of the 17th International FLAIRS Conference (2004) Sarah Zelikovitz and Haym Hirsh, Integrating Background Knowledge with Text Classifiers, Proceedings of the International Joint Conference of Artificial Intelligence (2003) Sarah Zelikovitz, Mining for Features to Improve Classification, Proceedings of Machine Learning, Models, Technologies and Applications (MLMTA) (2003) Sarah Zelikovitz and Haym Hirsh, Integrating Background Knowledge into Nearest Neighbor Text Classification Proceedings of the Sixth European Conference on Case Based Reasoning (ECCBR)(2002) Sarah Zelikovitz and Haym Hirsh, Using LSI for Text Classification in the Presence of Background Text, Proceedings for the Conference on Information and Knowledge Management (CIKM)(2001) Sarah Zelikovitz and Haym Hirsh, Improving Text Classification with LSI Using Background Knowledge, IJCAI01 Workshop Notes on Text Learning: Beyond Supervision (2001) Sarah Zelikovitz and Haym Hirsh, Improving Short Text Classification Using Unlabeled Background Knowledge, In Proceedings of the Seventeenth International Conference on Machine Learning (ICML)( 2000) Contact Dr. Sarah Zelikovitz Building 1N Room 212 Computer Science Department 2800 Victory Blvd Staten Island, NY 10314 sarah.zelikovitz@csi.cuny.edu (718)982-2849 Computer Science Department: (718)982-2850",
  "content_length": 8331,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:31"
}