{
  "name": "Sarah Goodwin",
  "homepage": "https://research.monash.edu/en/persons/sarah-goodwin",
  "status": "success",
  "content": "Sarah Goodwin - Monash University View Scopus Profile Sarah Goodwin Dr Senior Lecturer, Department of Human Centred Computing https://orcid.org/0000-0001-8894-8282 EmailSarah.Goodwinmonashedu 20122025 Research activity per year Personal profile BiographyDr Sarah Goodwin is a Senior Lecturer within Monash's Embodied Visualisation research group. She is passionate about helping to harness data more effectively for a sustainable future. Using human-centric approaches her  research seeks to create visual solutions to enable the exploration and communication of complex, multi-dimensional and geospatial data sets. Sarah's research looks to drive innovative, practical and feasible solutions which can have immediate impact. Her recent projects include: - investigating information overload in energy network control rooms: presenting recommendations for future control room designs (with Australian Energy Market Operator / AEMO) - developing novel visual exploration tools to explore smart energy grid data including Uplift - an immersive casual collaboration tool,  Timetables - an embodied spatial-temporal view and Embodied Provenance - Active Proxy Dashboards - interactive dashboards using 3D buildings, and dashboards and large screen displays for microgrid visualisations. - visualising disadvantage in Australia through analysing media and parliamentary discussions: Australia's Discourse Explorer (with the Paul Ramsay Foundation) - developing the openly available visual eye tracking analysis software: Gazealytics (VETA and Gazealytics publications) - visualising cancer prevalance and communicating geostatistical model uncertainty: Australian Cancer Atlas (with Cancer Council Queensland and Queensland University of Technology) - creating MultiViz (Urban diversity) to enable the visual exploration of multiple variables on one map for social scientists and novel immersive and interactive visualisations including Tiltmap ,  DataDancing and Data as Delight. Sarah is Director of Engagement for Monash's Human-Centred Computing Department, co-Director of Research for the Monash Grid Innovation Hub. She is a member of the Monash Energy Institute and Monash Data Futures Institute and was previously the deputy IT for Sustainable Energy theme lead for Monash Faculty of Information Technology. Sarah has over 20 years experience in the field of geospatial analysis and information visualisation in professional and academic roles; as a GIS technician, geo-data analyst, consultant and an academic researcher for some of the leading research centres for spatial analysis and visualisation around the world including the giCentre at City, University of London, UK; the g2Lab at HafenCity University, Hamburg, Germany,  Geospatial Science Department at RMIT University, Melbourne and now with the Immersive Analytics Lab / Embodied Visualisation group, Monash University. She is co-General Chair for IEEE VIS 2023, bringing the largest international visualisation and visual analytic conference to Australia for the first time. She runs two international workshop series on 'Energy Data Visualisation' (EnergyVis) and 'Urban Data Visualisation' (CityVis) and has been on various program committees including IEEE InfoVis and IEEE PacificVis. Sarah has taught data visualisation to over 1000 students per year and supervises a long list of PhD, Masters and Honours students. Research interestsInfovis Design Studies and MethodologiesCreativity Techniques and WorkshopsGeographical Information VisualisationSpatial Temporal Visual AnalyticsHuman Computer InteractionMultidimensional Data VisualisationGeodemographicsUncertainty VisualisationEnergy, Smart and Micro Grid VisualisationMovement and Flow Data VisualisationCity and Urban Data VisualisationMonash teaching commitmentLecturer S1/S2 2020, S1/S2 2021, S1/S2 2023 (Lecturer / CE): FIT5147 Data Exploration and Visualisation  (postgraduate elective, manadatory for advanced Data Science pathway) S1/S2 2019; S2 2018: FIT5125/FIT5143/FIT4005 Research Methods in Information Technology (All hons/masters/phd research component students) Previously at RMIT University: S1 2018 ONPS2335: The Professional Scientist (UG3), RMIT ONPS2334 Science Skills & Communication (UG1), and GEOM2334 Geospatial Science & Communication Skills (UG1). All Core subjects. S2 2017 GEOM2069 Cartography and Visualisation (RMIT) - Elective postgraduate S1 2017 GEOM2079 Cartography 2 (RMIT) - Core UG2 Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationGeographical Information Science, Doctor of Philosophy, City University LondonAward Date: 14 Sept 2015Geographical Information Systems, Master of Science, City University LondonAward Date: 22 Nov 2007Geography, Bachelor of Science (Honours), University of ManchesterAward Date: 1 Jul 2003 Research area keywordsVisualizationAnalytics and big dataEnergyComputer GraphicsSmart gridHCISmart CitiesGeostatisticsGISSpatial temporal statisticsSpatial cognitionCreativity Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2018 2020 2021 2024 2027 4 Active 7 Finished Projects per year Grid Guru: Grid Guru - Leveraging AI-Driven Grid OptimisationWagner, M. (Primary Chief Investigator (PCI)), Abbasnejad, E. (Chief Investigator (CI)), Mak, T. (Chief Investigator (CI)), Shareghi Nojehdeh, E. (Chief Investigator (CI)), Wang, H. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)) & Lipscombe, S. (Project Manager)Monash University – Internal Faculty Contribution, GridGuru Solutions Pty Ltd, Electricity Transmission Ministerial Holding Corporation (trading as Transgrid)16/07/25 → 15/07/26Project: Research MDFI: ASEAN Disinformation Index: Analyzing and Mitigating the Impact of Malicious Information on Democracy in Southeast AsiaA. Khalim, N. H. (Chief Investigator (CI)), Bonotti, M. (Primary Chief Investigator (PCI)), Idris, I. (Chief Investigator (CI)), Wijaya, D. (Chief Investigator (CI)), Perdana, A. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Anggorojati, B. (Chief Investigator (CI)) & Adam, L. (Chief Investigator (CI))31/05/24 → 31/12/25Project: Research DAAD - Universities Australia: Improving the Safety of Vulnerable Road Users Through Contextual Emotion Sensing Using Smartphone Data and Machine LearningTag, B. (Primary Chief Investigator (PCI)), Goodwin, S. (Partner Investigator (PI)), Kosch, T. (Chief Investigator (CI)) & Bosch, E. (Partner Investigator (PI))1/01/24 → 31/12/25Project: Research AI for Clean Energy and SustainabilityWang, H. (Primary Chief Investigator (PCI)), Jalili, M. (Chief Investigator (CI)), Strengers, Y. (Chief Investigator (CI)), Hill, D. (Chief Investigator (CI)), Razzaghi, R. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Liebman, A. (Associate Investigator (AI)), Pink, S. (Associate Investigator (AI)), Le Bodic, P. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Wang, T. (Associate Investigator (AI)), Vered, M. (Associate Investigator (AI)), Rong, J. (Associate Investigator (AI)), George, Y. (Associate Investigator (AI)), Song, H. (Associate Investigator (AI)), Tafakori, L. (Associate Investigator (AI)), Sajjadi, S. (Associate Investigator (AI)), Pourkhanali, A. (Associate Investigator (AI)), Moradiamani, A. (Associate Investigator (AI)) & Kamoona, A. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Paul Ramsay Foundation: Tracking media and parliamentary narratives around cycles of disadvantage in AustraliaWebb, G. (Primary Chief Investigator (PCI)), Angus, S. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Smith, L. (Chief Investigator (CI)), Bragge, P. (Chief Investigator (CI)), Batstone, J. (Chief Investigator (CI)) & Shareghi Nojehdeh, E. (Chief Investigator (CI))29/09/22 → 30/08/23Project: Research View all 11 projects Research output Research output per year 2012 2021 2023 2024 2025 2025 33 Conference Paper 18 Article 1 Other Report 1 Comment / Debate 1 More 1 Review Article Research output per year Research output per year Correction to: Variable Mapper: Developing, Implementing, and Evaluating an Online Tool for Multidimensional Spatial Data Visualization (Journal of Geovisualization and Spatial Analysis, (2025), 9, 1, (18), 10.1007/s41651-025-00219-2)Gamlen, A., Goodwin, S. & Ho, X., 13 Mar 2025, In: Journal of Geovisualization and Spatial Analysis. 9, 1, 1 p., 19.Research output: Contribution to journal › Comment / Debate › Other Open AccessFile 1 Citation (Scopus) Embedding Human Values in the Design of Mixed-Reality TechnologiesLi, M., Alshehri, T., Dwyer, T., Goodwin, S. & Evans, J., May 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 5, p. 2374-2383 10 p.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) Sensing Movement: Contemporary Dance Workshops with People who are Blind or have Low Vision and Dance TeachersDe Silva, M. T., Smiley, J., Goodwin, S., Holloway, L. M. & Butler, M., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 19 p. 1063Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) Streamlining Eye-Tracking and",
  "content_length": 12752,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:25"
}