{
  "name": "Sara M. Beery",
  "homepage": "https://beerys.github.io",
  "status": "success",
  "content": "Sara Beery I'm an assistant professor at MIT EECS' Faculty of AI and Decision Making and CSAIL, and I was previously a visiting researcher at Google working on Auto Arborist. I’ve always loved the natural world, and I've seen a growing need for technology-based approaches to conservation and sustainability challenges. My research focuses on building computer vision methods that enable global-scale environmental and biodiversity monitoring across data modalities, tackling real-world challenges including strong spatiotemporal correlations that lead to domain shift, imperfect data quality, fine-grained categories, and long-tailed distributions. I received my PhD in Computing and Mathematical Sciences (CMS) at Caltech, advised by Pietro Perona, where I received the Amori Doctoral Prize for my dissertation. I have been honored to be awarded an AI2050 Early Career Fellowship, an NSF CAREER Grant, a PIMCO Data Science Fellowship an Amazon AI4Science Fellowship, and the NSF Graduate Research Fellowship. My work has been supported by the NSF, NASA, Google, Microsoft, IBM, the USAF, MIT J-WAFS, and the Caltech Resnick Sustainability Institute. I seek to break down knowledge barriers between fields: I founded the successful AI for Conservation slack community (with over 2500 members), I am Co-PI on the NSF/NSERC Global Center on AI and Biodiversity Change, I am the Biodiversity Community Lead for Climate Change AI, and I am the founding director of the Caltech Summer School on Computer Vision Methods for Ecology. I work closely with industry, including the MIT-IBM Watson AI Lab, Microsoft AI for Good, Google Research, Wildlife Insights, and Wild Me where I help turn my research into usable, deployed tools. My experiences as a professional ballerina and a nontraditional student have taught me the value of unique perspectives, both inside and outside of the research community. I am passionate about increasing access to and capacity in STEM through mentorship, teaching, and outreach, and was honored to have my efforts recognized with the inaugural Caltech Computing and Mathematical Sciences Department Gradient for Change Award and the inaugural Caltech Engineering and Applied Science Division New Horizons Award. PhD Students Julia Chae Timm Haucke Neha Hulkund Justin Kay Eddie Vendrow Rupa Kurinchi-Vendhan Elena Sierra (incoming Fall 2025) Antoine Salaun (incoming Fall 2025) Masters and Visiting Students Lauren Shrack (MEng) Yuyan Chen (Visited Summer 2024 from McGill) Undergraduates Kai Van Brunt Xenia Zhao Asmi Kumar Ada Tsui David Fang (Alumni) Ari Pero (Alumni) Avi Sundaresan (@Caltech, Alumni) Interested in joining the group? If you are interested in any position with the group (Postdoc, PhD, MEng, UROP, Visitor), instead of emailing me please fill out the interest survey below so I can better organize my responses. I am unlikely to respond to individual emails. Interested in a PhD? I consider students primarily via MIT EECS and the MIT-WHOI joint program, but I would be open to advising students with the right fit for my lab through MIT EAPS or MIT CEE if that is better aligned with your background. If you are interested in working with me on impact-driven computer vision research for the environment, biodiversity, conservation, and sustainability, apply to any of these programs and list me in your application. Unfortunately I am unlikely to be able to meet with prospective applicants before they have gone through the formal review process. Interested in a postdoc? I will be welcoming postdocs on an ongoing basis, depending on funding availability. If our research interests align, please fill out the interest survey below and include any ideas you have for projects you would be interested in exploring together. I am happy to develop fellowship proposal(s) together. I'm particularly interested in bringing on a postdoctoral researcher with a background in quantitative large-scale biodiversity monitoring to explore the intersection between machine learning outputs and ecological modeling inputs with me and my group. Fill out the Interest Survey here. Selected Invited Talks Plenary Panel on Scienctific Discovery and the Environment, CVPR 2023 AI and Conservation United Nations World Wildlife Day Invited Speaker, 2024 U.S. Department of the Interior AI Strategy Workshop Keynote Speaker, 2024 U.S. Department of Fish and Wildlife Geospatial Training Workshop Keynote Speaker, 2024 WWF Fuller Seminar, 2023 Movement Ecology and AI Ohio State University Room2Roam Keynote Speaker, 2024 International Symposium on Heirarchical Bio-Navigation Keynote Speaker, 2024 Monitoring the Urban Forest with Auto Arborist RISE Seminar, 2023 Image XD Symposium Keynote, 2023 AI Helps Ukraine Seminar, 2022 MI EAPS Seminar, 2022 Stanford Computer Vision Seminar, 2022 Cornell Urban AI Seminar, 2022 Computer Vision for Global-Scale Biodiversity Monitoring - Scaling Geospatial and Taxonomic Coverage Using Contextual Clues EPFL School of Computer & Communication Sciences Seminar, 2022 ETH Zurich Sustainability Seminar, 2022 MIT EECS Seminar, 2022 Caltech Environmental Science and Engineering Seminar, 2022 UC Berkeley EECS Seminar, 2022 University of Washington Computer Science & Engineering Seminar, 2022 Cornell University Computer Science Seminar, 2022 UCSB PSTATS Seminar, 2022 UCSB Computer Science & Computer Engineering Joint Seminar, 2022 The Ohio State University Computer Science & Engineering Seminar, 2022 University of Melbourne Computer Science Seminar, 2022 Stevens Institute of Technology Data Science Seminar, 2022 UCLA Electrical and Computer Engineering Seminar, 2022 MIT Operations Research Center Seminar on Sustainability and Climate Change, 2022 University of Sydney Computer Science Seminar, 2022 Climate Change AI Seminar (with Dave Thau, Global Data and Technology Lead Scientist at WWF), 2022 UCL Center for Biodiversity and Environment Research Seminar, 2022 IST Austria Research Seminar, 2022 Max Planck Institute for Intelligent Systems and Cyber Valley Scientific Symposium, 2022 Georgia Tech Computational Science and Engineering Seminar, 2021 University of New South Wales Cognitive Robotics Seminar, 2021 Reed College Computer Science Seminar, 2021 Berkeley AI + Climate Seminar, 2021 University of Guelph CARE-AI and Biodiversity Institute Joint Seminar, 2021 Seminar at Microsoft Research Cambridge, 2020 Computational Sustainability (CompSust) Doctoral Consortium, 2020 Computational Imaging Challenges in Ecological Monitoring Keynote at the International Conference in Computational Photography, 2023 Edge AI for Wildlife Conservation TinyML Seminar, 2023 AJCAI Edge AI Workshop, 2022 Joint Human-AI Elephant Population Monitoring - A Case Study in the Greater Mara Ecosystem Keynote - The Second CV4Animals Workshop at CVPR, 2022 Beyond Benchmarks - Going from Competition-Winning Methods to Real-World Solutions LifeCLEF, 2021 Queer in AI at ICML, 2021 AI-Assisted Biodiversity Monitoring Data Science Frontiers Seminar at the African Institute for Mathematical Sciences, 2021 Leveraging AI to Extend Specimen Networks at iDigBio, 2021 Princeton AI4All, 2021 Computer Vision for Biodiversity Monitoring and Conservation EPFL Joint Mathis Lab Seminar, 2021 AI for Mankind, 2021 Yale Center for Biodiversity and Global Change Seminar, 2020 Deep Learning + Camera Traps Plenary at Imaginecology Workshop (Deep Learning pour le traitement et l’analyse d’imageset de sons en écologie) at Le GDR EcoStat, 2020 Improving Computer Vision for Camera Traps: Leveraging Practitioner Insight to Build Solutions for Real-World Challenges Ecological Society of America Annual Meeting, 2020 CompSust Open Graduate Seminar, 2020 Camera Trap Technology Symposium, 2019 AI for Camera Traps - Challenges, Best Practices, Benchmarks, and De-Siloing Data World Agroforestry Centre (ICRAF) Seminar, 2020 WILDLABS Virtual Meetup on Camera Trapping, 2019 Computer Vision for Wildlife Conservation Workshop at ICCV, 2019 Computer Vision for Camera Traps Caltech AI4Science Workshop, 2019 USC Center for AI in Society Symposium on AI for Conservation, 2019 Research Seminar at Google Venice, 2019 Selected Publications This list is a selected subset and may not be up to date. For a full list of publications please see my CV or Google Scholar. * denotes equal contribution, ^ denotes equal advising Harnessing artificial intelligence to fill global shortfalls in biodiversity knowledge Laura J Pollock*, Justin Kitzes*, Sara Beery, Kaitlyn M Gaynor, Marta A Jarzyna, Oisin Mac Aodha, Bernd Meyer, David Rolnick, Graham W Taylor, Devis Tuia, Tanya Berger-Wolf Nature Reviews Biodiversity 2025 [paper] Do Large Language Model Benchmarks Test Reliability? Joshua Vendrow*, Edward Vendrow*, Sara Beery^, Aleksander Madry^ [paper] [webpage] Generative AI as a tool to accelerate the field of ecology Kasim Rafiq, Sara Beery, Meredith S Palmer, Zaid Harchaoui, Briana Abrahms Nature Ecology & Evolution 2025 [paper] Personalized Representation from Personalized Generation Shobhita Sundaram*, Julia Chae*, Yonglong Tian, Sara Beery^, Phillip Isola^ ICML 2025 [paper] [webpage] The Potential for AI to Revolutionize Conservation: A Horizon Scan Sam A Reynolds, Sara Beery, Neil Burgess, Mark Burgman, Stuart HM Butchart, Steven J Cooke, David Coomes, Finn Danielsen, Enrico Di Minin, América Paz Durán, Francis Gassert, Amy Hinsley, Sadiq Jaffer, Julia PG Jones, Binbin V Li, Oisin Mac Aodha, Anil Madhavapeddy, Stephanie AL O'Donnell, William M Oxbury, Lloyd Peck, Nathalie Pettorelli, Jon Paul Rodríguez, Emily Shuckburgh, Bernardo Strassburg, Hiromi Yamashita, Zhongqi Miao, William J Sutherland Trends in Ecology & Evolution 2024 [paper] INQUIRE: A Benchmark for Natural World Image Retrieval Edward Vendrow*, Omiros Pantazis*, Alexander Shepard, Gabriel Brostow, Kate E. Jones, Oisin Mac Aodha^, Sara Beery^, Grant Van Horn^ NeurIPS 2024 Datasets and Benchmarks Track [webpage] Application-Driven Innovation in Machine Learning Dav",
  "content_length": 18429,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:20"
}