{
  "name": "Sarath Chandar",
  "homepage": "http://sarathchandar.in",
  "status": "success",
  "content": "Sarath Chandar Sarath Chandar Sarath Chandar Canada CIFAR AI Chair Canada Research Chair in Lifelong Machine Learning Associate Professor Department of Computer and Software Engineering École Polytechnique de Montréal Core faculty member Mila - Quebec Artificial Intelligence Institute Email: fname [DOT] lname [AT] mila [DOT] quebec About Me: I am an Associate Professor in the Department of Computer and Software Engineering at Polytechnique Montreal where I lead the Chandar Research Lab (CRL). I hold a Canada CIFAR AI (CCAI) chair and the Canada Research Chair in Lifelong Machine Learning. I am a core faculty member at Mila - the Quebec AI Institute. I am also an adjunct professor in the Department of Computer Science and Operations Research at University of Montreal and in the Department of Computer Science and Engineering at Indian Institute of Technology Madras. I work in machine learning and my long-term vision is to develop interactive learning algorithms that can continually learn from experiences. I created the Conference on Lifelong Learning Agents (CoLLAs) in 2022. You can find my short bio here. Research Areas: Artificial Intelligence, Machine Learning, Deep Learning, Recurrent Neural Networks, Lifelong/Continual Learning, Reinforcement Learning, Natural Language Processing, Optimization, AI for Science. Education: Ph.D. from University of Montreal with Yoshua Bengio and Hugo Larochelle. MS by Research from Indian Institute of Technology Madras with Balaraman Ravindran. News: NEW(Aug 2023): I will be serving as a General Chair for thethird Conference on Lifelong Learning Agents (CoLLAs) in 2024. NEW(Jul 2023): Chandar Research Lab (CRL) Annual Symposium 2023 is happening this Aug 08 and 09! NEW(Apr 2023): I will be giving a lecture on introduction to neural networks at theCIFAR DLRL Summer School 2023! NEW(Aug 2022): I will be serving as a Program Chair for thesecond Conference on Lifelong Learning Agents (CoLLAs) in 2023.",
  "content_length": 1965,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:34"
}