{
  "name": "Sara C. Madeira",
  "homepage": "https://ciencias.ulisboa.pt/pt/perfil/sacmadeira",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Sara C. Madeira Contactos Departamento de Informática Email sacmadeira@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Palavras Chave Machine Learning. Data Science. Bioinformatics. Biomedical Informatics, Health Informatics. Keywords Machine Learning. Data Science. Bioinformatics. Biomedical Informatics, Health Informatics. Currículo Resumido SARA C. MADEIRA is Associate Professor with tenure at Department of Informatics of Ciências-ULisboa (02/2017-now), coordinated Data Science graduation (05/2018 to 01/2022) and teaching graduation courses on Data Science, Machine Learning and Data Mining; and Senior Researcher at FCiencias-ID/LASIGE, coordinating Data and Systems Intelligence and a member of Health and Biomedical Informatics Research Lines of Excellence. She was awarded the Scientific Prize Universidade de Lisboa/Caixa Geral de Depósitos 2021 in the area of Computer Science and Engineering, the Best Runner-Up Outreach Initiative 2020 by LASIGE and Ciências 2022 Productivity Research Award in Computer Science and Engineering by Ciências-ULisboa. She received her PhD degree and MSc degrees in Computer Science and Engineering at Instituto Superior Técnico, Universidade Técnica de Lisboa (Técnico-ULisboa) in 2008 and 2022, and graduated in Matemática-Informática at Universidade da Beira Interior in 2000. She was a Lecturer at Informatics Department of UBI (11/2002-12/2008), while being a PhD student at Técnico-Ulisboa, and hired as Assistant Professor after finishing her PhD in 12/2008. She was Assistant Professor at the Computer Science and Engineering department at Técnico-ULisboa (06/2009-02/2017), teaching undergraduate courses on algorithms and data structures and programming, and graduate courses on computational biology and integrative bioinformatics; and a Senior Researcher at INESC-ID, receiving the INESC-ID Young Research Award in 2013. She was on sabbatical leave at Biocomputing group - University of Bologna (03/2015 to 07/2016 and 09/2022-07/2023), and an EURIAS Junior Fellow at Istituti di Studi Avanzate in Bologna (09/ 2015-06/2016). She co-chaired the 14th and 15th International Workshops on Data Mining in Bioinformatics (BIOKDD'15 and BIOKDD'16), held in conjunction with ACM SIGKDD '15 and SIGKDD'16. Her research interests are in the broad area of data science and include machine learning, bioinformatics and health informatics. In this context, she published +40 Q1 papers, has +5000 citations, supervised 5 Phd (+5 ongoing) and +40 MSc theses, and participated/participates in several national and European research projects. In particular, at national level, she was PI of NEUROCLINOMICS - Understanding NEUROdegenerative diseases through CLINical and OMICS data (PTDC/EIA-EIA/111239/2009) and NEUROCLINOMICS2 - Unravelling Prognostic Markers in NEUROdegenerative diseases through CLINical and OMICS data integration (PTDC/EEI-SII/1937/2014); and is now PI of AIpALS - Advanced learnIng models using Patient profiles and disease progression patterns for prognostic prediction in ALS (PTDC/CCI-CIF/4613/2020). At European level, she is now leading FCiencias-ID/LASIGE team in H2020 Project CIRCLES - Controlling mIcRobiomes CircuLations for bEtter food Systems (Grant agreement ID: 818290) and H2020 Project BRAINTEASER - BRinging Artificial INTelligencE home for a better cAre of amyotrophic lateral sclerosis and multiple SclERosis (Grant agreement ID: 101017598). Her 2004 ACM/IEEE TCBB paper Biclustering Algorithms for Biological Data Analysis: a Survey, ESI Hot Paper in Computer Science in 11/2006, has +2500 citations and is the key reference in the field. Biclustering and triclustering algorithms and their applications in biomedical data analysis are her main research topics. She proposed state of the art biclustering algorithms and the first triclustering taxonomy on 2018 ACM Computing Surveys paper Triclustering Algorithms for Three-Dimensional Data Analysis: A Comprehensive survey. She further made relevant contributions to prognostic prediction in neurodegenerative using advanced machine learning models, in particular Amyotrophic Lateral Sclerosis (ALS) and Alzheimer's Disease (AD), where biclustering and triclustering are used to analyse heterogeneous high-dimensional static/temporal data, finding key patient profiles and disease progression patterns. Interesses Científicos Machine Learning. Data Science. Bioinformatics. Biomedical Informatics, Health Informatics. Scientific Interests Machine Learning. Data Science. Bioinformatics. Biomedical Informatics, Health Informatics. Publicações selecionadas Diogo F. Soares, Rui Henriques, Marta Gromicho, Mamede de Carvalho, Sara C Madeira. Learning prognostic models using a mixture of biclustering and triclustering: Predicting the need for non-invasive ventilation in Amyotrophic Lateral Sclerosis. Journal of Biomedical Informatics, 134, 104172, October 2022. Elsevier. Eduardo N. Castanho, Helena Aidos, Sara C. Madeira, Biclustering fMRI time series: a comparative study. BMC Bioinformatics 23, 192, May 2022, Springer. Rui Henriques and Sara C. Madeira, FleBiC: Learning classifiers from high-dimensional biomedical data using discriminative biclusters with non-constant patterns, Pattern Recognition, 115, 107900, July 2021, Elsevier. João Lobo, Rui Henriques, Sara C Madeira, G-Tric: generating three-way synthetic datasets with triclustering solutions, BMC Bioinformatics, 22, 16, January 2021, Springer. Rui Henriques and Sara C. Madeira, Triclustering algorithms for three-dimensional data analysis: A comprehensive survey, ACM Computing Surveys, Vol. 51, No. 5, Article 95, pp 1-45, September 2018, ACM. Ver todas as Publicações Prizes and Awards 2023-10-24 - Reconhecimento da Investigação de Excelência em Ciências (Faculdade de Ciências da Universidade de Lisboa)2022-06-28 - Prémios Científicos Universidade de Lisboa/Caixa Geral de Depósitos (Caixa Geral de Depósitos)2021-07-26 - Menções honrosas dos Prémios Científicos Universidade de Lisboa/Caixa Geral de Depósitos (Caixa Geral de Depósitos)2021-05-10 - Best Runner-up Outreach Initiative (LASIGE)2016-07-25 - Menções honrosas dos Prémios Científicos Universidade de Lisboa/Caixa Geral de Depósitos (Caixa Geral de Depósitos)2013-10-01 - Best Young Researcher (Instituto de Engenharia de Sistemas e Computadores: Investigação e Desenvolvimento em Lisboa (INESC-ID))",
  "content_length": 6648,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:21"
}