{
  "name": "Sara Silva",
  "homepage": "https://ciencias.ulisboa.pt/perfil/sgsilva",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Sara Silva Contactos Departamento de Informática Sala/Gabinete 6.3.53 Ext. Principal 526353 Telefone Direto 217500565 Email sgsilva@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado Indicadores Google Scholar Scientific Interests Genetic Programming, other flavours of Evolutionary Computation and all other biologically inspired methods.Applications, mostly in Biomedical Informatics and Remote Sensing. Publicações selecionadas Lectures on Intelligent Systems (2023). L Vanneschi, S Silva. Natural Computing Series, Springer. https://doi.org/10.1007/978-3-031-17922-8 Fitness landscape analysis of convolutional neural network architectures for image classification (2022). NM Rodrigues, KM Malan, G Ochoa, L Vanneschi, S Silva. Information Sciences, Volume 609, 711-726. https://doi.org/10.1016/j.ins.2022.07.040 Optical time series for the separation of land cover types with similar spectral signatures: cocoa agroforest and forest (2022). JE Batista, NM Rodrigues, AIR Cabral, MJP Vasconcelos, A Venturieri, LGT Silva, S Silva. International Journal of Remote Sensing 43:9, 3298-3319. https://doi.org/10.1080/01431161.2022.2089540 Evolving knowledge graph similarity for supervised learning in complex biomedical domains (2020). RT Sousa, S Silva, C Pesquita. BMC bioinformatics 21 (1), 6. https://doi.org/10.1186/s12859-019-3296-1 A semi-supervised Genetic Programming method for dealing with noisy labels and hidden overfitting (2018). S Silva, L Vanneschi, AIR Cabral, MJ Vasconcelos. Swarm and Evolutionary Computation. https://doi.org/10.1016/j.swevo.2017.11.003 Ver todas as Publicações Prizes and Awards 2024-10-22 - Reconhecimento da Investigação de Excelência em Ciências (Faculdade de Ciências da Universidade de Lisboa)",
  "content_length": 1942,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:25"
}