{
  "name": "Sarah Dean",
  "homepage": "https://sdean.website",
  "status": "success",
  "content": "Sarah Dean About Me  • News  • Teaching  • Advising  • Publications Sarah Dean sdean AT cornell DOT edu I am an Assistant Professor in the CS Department at Cornell. ⓘ I can't guarantee a reply to every email. I do not have the capacity to supervise remote internships. I study the interplay between optimization, machine learning, and dynamics in real-world systems. My research focuses on understanding the fundamentals of data-driven methods for control and decision-making, inspired by applications ranging from robotics to recommendation systems. You can learn more by reading my dissertation, watching my dissertation talk, or browsing my recent talks. In fall 2021, I was a postdoc with Jamie Morgenstern at UW. Before that, I was a PhD student in EECS at UC Berkeley, advised by Ben Recht. At Berkeley, I was a founding member of Graduates for Engaged and Extended Scholarship in computing and Engineering (GEESE). I interned with Canopy in Boston, MA during Summer 2019. ⓘ For reference, my CV, headshot, bio, job talk, faculty app, and NSF GRFP app. News [new!] My collaborators will present papers at NeuRIPS (on Pre-trained Large Language Models Learn Hidden Markov Models In-context) and CDC (on Sub-optimality of the Separation Principle for Quadratic Control from Bilinear Observations) I gave a virtual talk at the ACC Workshop on Interplay Between Machine Learning and Set-Based Identification & Control and at the Simon's workshop on Theoretical Aspects of Trustworthy AI My collaborators presented papers at ICML (on Policy Design for Two-sided Platforms with Participation Dynamics) and ACC (on Learning Linear Dynamics from Bilinear Observations) I was quoted in a piece in Digital Frontier magazine. I was selected as an AI2050 Early Career Fellow and recieved a NSF CAREER award! In 2024, we had papers at AISTATS, WSDM, L4DC, ICML, KDD, and NeuRIPS. In 2024, I spoke at the Princton OLC Workshop on Learning Dynamics from Bilinear Observations; gave a plenary at SYSID 2024 on Learning Models of Dynamical Systems from Finite Observations; spoke at the ICML FoRLaC workshop and Workshop on Humans, ADS, and Society; spoke at the Lehigh AIR Lab Seminar on the Foundations for Learning with Human Interaction & Dynamics. I co-organized NESCW 2024 and RecEcoSys at AAAI 2024 In 2023, we had papers at NeuRIPS, a CoRL workshop, AIES, IFAC, and ICLR I co-organized the DM4IR&Recsys workshop at WWW 2023 and spoke on User Dynamics in Machine Learning Systems at the Princeton Networks & Cognition Workshop and OCO with Unbounded Memory at ACC Workshop I gave a keynote at L4DC 2022 on Preference and Participation Dynamics in Learning Systems I joined Cornell CS in 2022 In 2021, I was on the job market, graduated from Berkeley, and did a post doc at UW Teaching At Cornell, I am teaching Machine Learning in Feedback Systems (CS 6784) in Fall 2025 (previously in 2022, 2023). Previously, I taught CS 3/5780: Introduction to Machine Learning in Fall 2024 and CS 4/5789: Introduction to Reinforcement Learning (in Spring 2022, 2023, 2024) and At Berkeley, I worked on course development for a new EECS Anti-Racism and Social Justice course (and gave a guest lecture on Bias in Algorithms) and as a Graduate Student Instructor for Statistical Learning Theory (EECS 281) and Introduction to Machine Learning (EECS 189/289). Advising and Mentoring I've had the pleasure of working with several students at Cornell, including PhD advisees Rohan Banerjee (co-advised with Tapo Bhattacharjee), Sunmook Choi, Yijia Dai (co-advised with Jennifer Sun), Kimia Kazemian, Yujin Kim, Haruka Kiyohara (co-advised with Thorsten Joachims), and Raunak Kumar ('24, co-advised with Bobby Kleinberg); MS advisees Eliot Shektman ('24) and Vaishnavi Gupta; many wonderful undergraduates; and postdoc Yahya Sattar (2023-present). Publications ⓘ My Google Scholar profile has the most up to date list of publications and preprints. If you are interested in code for a paper without a github link, feel free to send me an email. Pre-trained Large Language Models Learn Hidden Markov Models In-context [arXiv] Yijia Dai, Zhaolin Gao, Yahya Sattar, Sarah Dean, Jennifer J. Sun. to appear at NeuRIPS 2025. Sub-optimality of the Separation Principle for Quadratic Control from Bilinear Observations [arXiv] Yahya Sattar, Sunmook Choi, Yassir Jedra, Sarah Dean, Maryam Fazel. to appear at CDC 2025. MixUCB: Enhancing Safe Exploration in Contextual Bandits with Human Oversight [openreview] Jinyan Su, Rohan Banerjee, Jiankai Sun, Wen Sun, Sarah Dean. presented at RLC 2025. Policy Design for Two-sided Platforms with Participation Dynamics [arXiv] Haruka Kiyohara, Fan Yao, Sarah Dean. presented at at ICML 2025. Finite Sample Identification of Partially Observed Bilinear Dynamical Systems [arXiv] Yahya Sattar*, Yassir Jedra*, Sarah Dean, Maryam Fazel. oral presentation at L4DC 2025. Datasets for Navigating Sensitive Topics in Recommendation Systems [github] Amelia Kovacs, Jerry Chee, Kimia Kazemian, Sarah Dean. oral presentation in the Resources track at WWW 2025. also presented at NeuRIPS 2024 Safe Generative AI Workshop. Learning Linear Dynamics from Bilinear Observations [arXiv] [slides] [talk] Yahya Sattar, Yassir Jedra, Sarah Dean. presented at ACC 2025. Accounting for AI and Users Shaping One Another: The Role of Mathematical Models [arXiv] [openreview] Sarah Dean, Evan Dong, Meena Jagadeesan, Liu Leqi. published in TMLR 6/2025. shorter version Recommender Systems as Dynamical Systems: Interactions with Viewers and Creators presented at the AAAI 2024 Workshop on Recommendation Ecosystems: Modeling, Optimization and Incentive Design. Initializing Services in Interactive ML Systems for Diverse Users [arXiv] Avinandan Bose, Mihaela Curmei, Daniel L. Jiang, Jamie Morgenstern, Sarah Dean, Lillian J.Ratliff, Maryam Fazel. presented at NeuRIPS 2024. Harm Mitigation in Recommender Systems under User Preference Dynamics [arXiv] [github] Jerry Chee, Shankar Kalyanaraman, Sindhu Kiranmai Ernala, Udi Weinsberg, Sarah Dean, Stratis Ioannidis. presented at KDD 2024. Learning from Streaming Data when Users Choose [arXiv] [github] Jinyan Su, Sarah Dean. presented at ICML 2024. Random Features Approximation for Control-Affine Systems [arXiv] Kimia Kazemian, Yahya Sattar, Sarah Dean. presented at L4DC 2024. short version presented at NeurIPS Workshop on Gaussian Processes, Spatiotemporal Modeling, and Decision-making Systems 2023. Strategic Usage in a Multi-Learner Setting [arXiv] [github] Eliot Seo Shekhtman, Sarah Dean. presented at AISTATS 2024. short version presented (oral) at AAAI 2024 Recommendation Ecosystems Workshop: Modeling, Optimization, and Incentive Design. Emergent specialization from participation dynamics and multi-learner retraining [arXiv] [slides] [talk] Sarah Dean, Mihaela Curmei, Lillian J. Ratliff, Jamie Morgenstern, and Maryam Fazel presented at AISTATS 2024. To Ask or Not To Ask: Human-in-the-loop Contextual Bandits with Applications in Robot-Assisted Feeding [arXiv] [website] Rohan Banerjee, Rajat Kumar Jenamani, Sidharth Vasudev, Amal Nanavati, Katherine Dimitropoulou, Sarah Dean, Tapomayukh Bhattacharjee best paper finalist at ICRA 2025 short version presented at First Workshop on Out-of-Distribution Generalization in Robotics at CoRL 2023. Ranking with Long-Term Constraints [arXiv] [github] Kianté Brantley, Zhichong Fang, Sarah Dean, Thorsten Joachims presented at WSDM 2024. Online Convex Optimization with Unbounded Memory [arXiv] [slides] Raunak Kumar, Sarah Dean, Robert D. Kleinberg presented at NeuRIPS 2023. Reward Reports for Reinforcement Learning [arXiv] Thomas Krendl Gilbert, Sarah Dean, Nathan Lambert, Tom Zick, and Aaron Snoswell presented at AIES 2023. short version at Responsible Decision Making in Dynamic Environments workshop at ICML 2022. Perception-Based Sampled-Data Optimization of Dynamical Systems [arXiv] Liliaokeawawa Cothren, Gianluca Bianchin, Sarah Dean, Emiliano Dall'Anese presented at IFAC 2023. Modeling Content Creator Incentives on Algorithm-Curated Platforms [arXiv] [overview] Jiri Hron, Karl Krauth, Michael I. Jordan, Niki Kilbertus, and Sarah Dean oral presentation at ICLR 2023. Engineering a Safer Recommender System [PDF] Liu Leqi and Sarah Dean at Responsible Decision Making in Dynamic Environments workshop at ICML 2022. Preference Dynamics Under Personalized Recommendations [arXiv] [slides] [talk] Sarah Dean and Jamie Morgenstern presented at EC 2022. Choices, Risks, and Reward Reports: Charting Public Policy for Reinforcement Learning Systems [CLTC] [arXiv] Thomas Krendl Gilbert, Sarah Dean, Tom Zick, and Nathan Lambert Center for Long-Term Cybersecurity Whitepaper Series (2022). Towards Robust Data-Driven Control Synthesis for Nonlinear Systems with Actuation Uncertainty [arXiv] Andrew J. Taylor*, Victor D. Dorobantu*, Sarah Dean*, Benjamin Recht, Yisong Yue, and Aaron D. Ames presented at CDC 2021. Quantifying Availability and Discovery in Recommender Systems via Stochastic Reachability [arXiv] [github] Mihaela Curmei*, Sarah Dean*, and Benjamin Recht presented at ICML 2021, short version presented at Participatory Approaches to Machine Learning workshop at ICML 2020. Certainty Equivalent Perception-Based Control [arXiv] [github] [talk] [slides] Sarah Dean and Benjamin Recht oral presentation at L4DC 2021. Axes for Sociotechnical Inquiry in AI Research [arXiv] [IEEE] Sarah Dean, Thomas Krendl Gilbert, Nathan Lambert, and Tom Zick published in IEEE Transactions on Technology and Society (2021). AI Development for the Public Interest: From Abstraction Traps to Sociotechnical Risks [arXiv] McKane Andrus, Sarah Dean, Thomas Krendl Gilbert, Nathan Lambert, and Tom Zick presented at IEEE ISTAS 2020. Do Offline Metrics Predict Online Performance in Recommender Systems? [arXiv] [github] Karl Krauth, Sarah Dean*, Alex Zhao*, Wenshuo Guo*, Mihaela Curmei*, Benjamin Recht, and Michael I. Jordan presented at the Workshop on Consequential Decisions in Dynamic Environmen",
  "content_length": 12202,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:22"
}