{
  "name": "Sarah Clinch",
  "homepage": "https://www.research.manchester.ac.uk/portal/sarah.clinch.html",
  "status": "success",
  "content": "Sarah Clinch - Research Explorer The University of Manchester Sarah Clinch Dr Senior Lecturer in Computer Science, Human Computer Systems https://orcid.org/0000-0002-9305-4774 Emailsarah.clinchmanchester.acukWebsitehttp://sclinch.com Accepting PhD StudentsPhD projectsI'm currently looking for students to work on projects related to: * Augmentation and manipulation of human memory, particularly episodic memory, through technology intervention * Mobile sensing and intervention for aphantasia/hyperphantasia * Evaluation measures human memory augmentations * Queer HCI * Theory in HCI / Ubiquitous computingI do NOT supervise projects with any meaningful machine learning / AI element. Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital Futures Fingerprint Dive into the research topics where Sarah Clinch is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Case Study Computer Science 100% Pervasive Computing Computer Science 75% Augmented Reality Computer Science 70% Virtual Reality Computer Science 50% Stakeholder Interview Computer Science 50% Behavioral Feature Computer Science 50% Content Distribution Computer Science 50% Scheduling Requirement Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 57 Conference contribution 20 Article 11 Paper 3 Other 11 More 3 Poster 2 Chapter 1 Book 1 Abstract 1 Conference article 1 Editorial 1 Master's Thesis 1 Working paper Research output per year Research output per year Shaping the Design of Smartphone-Based Interventions for Self-HarmHonary, M., Clinch, S., Bell, B., Kroll, L., Sefi, A., Vega Hernandez, J. & McNaney, R., 21 Apr 2020, CHI 2020 - Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 3376370. (Conference on Human Factors in Computing Systems - Proceedings).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Self-Management 100% Emotional Distress 100% 600 Downloads (Pure) Supporting Stimulation Needs in Dementia Care through Wall-Sized DisplaysSas, C., Davies, N., Clinch, S., Shaw, P., Mikusz, M., Steeds, M. & Nohrer, L., 21 Apr 2020, In: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems . 0, p. 1-16Research output: Contribution to journal › Conference article › peer-review Open Access Home Care 100% Cognitive Decline 100% Psychosocial Intervention 100% Sensory Stimulation 100% Contextual Interview 50% 22 Downloads (Pure) Scheduling Content in Pervasive Display SystemsClinch, S., Mikusz, M., Elhart, I., Davis, N. & Langheinrich, M., Dec 2019, In: ACM Proceedings on Interactive, Mobile, Wearable and Ubiquitous Technologies.Research output: Contribution to journal › Article › peer-review Open Access Testbed 100% Architectural Model 50% Content Filtering 50% Performance Requirement 50% Learning From Our Mistakes – Identifying Opportunities for Technology Intervention to Address Everyday Cognitive FailureClinch, S. & Mascolo, C., 12 Jun 2018, In: IEEE Pervasive Computing. 17, 2, p. 22-33Research output: Contribution to journal › Article › peer-review Open AccessFile Alzheimer's Disease 100% Case Study 100% Cognitive Impairment 100% Cognitive Error 100% Cognitive Capability 100% 554 Downloads (Pure) Behavioural Indicators of Usability in Visual Analytics DashboardsAlhamadi, M., Alsayahani, H., Clinch, S. & Vigo, M., 9 Apr 2025, In: ACM Transactions on Interactive Intelligent Systems. 15, 2, p. 1 35 p., 9.Research output: Contribution to journal › Article › peer-review Open AccessFile Dashboards 100% Visual Analytics 100% Behavioral Indicator 100% Information Presentation 14% Centered Approach 14% 14 Downloads (Pure) View all 102 research outputs Projects 1 Finished 1 Not started Projects per year HARG: Healthy Ageing Research GroupTodd, C. (Researcher), Stanmore, E. (Researcher), Hall, A. (Researcher), Littlewood, A. (Researcher), Davies, A. (Researcher), Sowerbutts, A. M. (Researcher), Maharani, A. (Researcher), Dowding, D. (Researcher), Jones, D. (Researcher), Boulton, L. (Researcher), Cruickshank, F. (Researcher), Hawley-Hague, H. (Researcher), Brooks, J. (Researcher), Griffiths, J. (Researcher), Spencer, K. (Researcher), Fisher, K. (Researcher), Mcgarrigle, L. (Researcher), Cook, M. (Researcher), Pendleton, N. (Researcher), Stanford, P. (Researcher), Lasrado, R. (Researcher), Ahmed, S. (Researcher), Clinch, S. (Researcher), Burden, S. (Researcher), Gluchowski, A. (Researcher), Ford, C. (PGR student), Al Zadjali, F. (PGR student), Sremanakova, J. (PGR student), Fisher, K. (PGR student), Zougar, M. (PGR student), Almohaisen, N. (PGR student), Yang, Y. (PGR student), Mckenzie, Y. (PGR student), O'Connor, S. (Researcher), Aminu, A. (Researcher), Bosco, A. (Researcher), Parchment, A. (Researcher), Money, A. (Researcher), Mackenzie, A. (Researcher), Karki, B. (PGR student), Poku, B. (Researcher), Eost-Telling, C. (Researcher), French, C. (PGR student), Harris, D. (PGR student), Damisa, E. (Researcher), Vardy, E. (Researcher), Hakeem, F. (Researcher), Donald, G. (Researcher), Bilsborough, H. (PGR student), Gangannagaripalli, J. (Researcher), Astbury, J. (Researcher), Garsden, J. (Researcher), Ventre, J. (Researcher), Aguilera Munoz, J. (Researcher), Allsopp, K. (Researcher), Mcgarrigle, L. (Researcher), Mott, L. (PGR student), Huang, L. (Researcher), Tomkow, L. (Researcher), Ahmed, N. (Researcher), Fox, S. (Researcher), Mcdermott, J. (Researcher), Hoodless, S. (Researcher), Dlima, S. (PGR student), Shi, Y. (PGR student) & Tang, Y. (PGR student)Project: Research Systematic Review 100% Qualitative Study 68% Digital Health 61% Home Care 58% Health Care Cost 50% S.Clinch: Human-Driven Pervasive Data ApplicationClinch, S. (PI), Bechhofer, S. (CoI), Evans, J. (CoI), Jay, C. (CoI), McLachlan, C. (CoI) & Parisio, A. (CoI)12/06/17 → 30/07/17Project: Research Data Application 100% Activities 2 Organising a conference, workshop, exhibition, performance, inquiry, course etc Activities per year Gender Advancement through Transforming Institutions Phase 1 Starting OutHarris, D. (Organiser), Richards, L. (Organiser), Cowen, R. (Member of programme committee), Mohammad-Qureshi, S. (Member of programme committee), Boya, R. (Member of programme committee), Browning, P. (Member of programme committee), Clinch, S. (Member of programme committee), Cotter, S. (Member of programme committee), Polya, D. (Member of programme committee), Sattler, U. (Member of programme committee), Walton, C. (Member of programme committee), Da Conceicao Bispo, P. (Member of programme committee), Browne, A. L. (Member of programme committee), Lawson, C. (Member of programme committee) & Pampaka, M. (Member of programme committee)19 Oct 2021Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research 34th British HCI ConferenceSteeds, M. (Co-Organiser), Cecchinato, ‪. E. (Co-Organiser), Sas, C. (Co-Organiser) & Clinch, S. (Co-Organiser)Jul 2021Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research Datasets Novice programmers strategies for online resource use and their impact on source codeAlghamdi, O. (Creator), Clinch, S. (Creator), Alhamadi, M. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 17 May 2023DOI: 10.48420/c.6366063.v2, https://figshare.manchester.ac.uk/collections/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code/6366063/2 and one more link, https://figshare.manchester.ac.uk/collections/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code/6366063 (show fewer)Dataset Strategies for Using Websites to Support Programming and Their Impact on Source Code: Interview TranscriptsAlghamdi, O. (Creator), Clinch, S. (Creator), Alhamadi, M. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 4 Apr 2023DOI: 10.48420/21806244.v2, https://figshare.manchester.ac.uk/articles/dataset/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code_Interview_Transcripts/21806244/2 and one more link, https://figshare.manchester.ac.uk/articles/dataset/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code_Interview_Transcripts/21806244 (show fewer)Dataset Interactive information dashboards user performance, low-level interaction data and interaction patterns.Alhamadi, M. (Creator), Clinch, S. (Creator) & Vigo, M. (Creator), University of Manchester Figshare, 30 Mar 2023DOI: 10.48420/21335622, https://figshare.manchester.ac.uk/articles/dataset/Interactive_information_dashboards_user_performance_and_interaction_patterns/21335622Dataset How are websites used during development and what are the implications for the coding process? : Interview and Survey StudyAlghamdi, O. (Creator), Clinch, S. (Creator), Skeva, R. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 31 Jul 2023DOI: 10.48420/c.6148593, https://figshare.manchester.ac.uk/collections/How_are_websites_used_during_development_and_what_are_the_implications_for_the_coding_process_Interview_and_Survey_Study/6148593Dataset How are websites used during development and what are the implications for the coding process? : Surv",
  "content_length": 10357,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:26"
}