{
  "name": "Sarah Creem",
  "homepage": "https://psych.utah.edu/people/faculty/creem-regehr-sarah.php",
  "status": "success",
  "content": "Sarah Creem-Regehr, Ph.D. - Department of Psychology - The University of Utah Skip to content Search Site: Powered by Search Campus: Powered by Search Campus Reveal Menu SARAH CREEM-REGEHR, PH.D., CHAIR PROFESSOR, COGNITION AND NEURAL SCIENCE | CNS Curriculum VitaeVAAST LabGoogle Scholar I am currently the Editor-in-Chief of Cognitive Research: Principles and ImplicationsWe publish new empirical and theoretical work covering all areas of Cognition, with a special emphasis on use-inspired basic research: fundamental research that grows from hypotheses about real-world problems. Please consider submitting! CONTACT INFORMATION Office: 1033 BEHSPhone: 801-581-5045Email: sarah.creem@psych.utah.edu Research Interests Spatial Cognition, Visual Perception, Multisensory Perception, Spatial Navigation, Virtual and Augmented Reality Our research examines how humans perceive, learn, and navigate spaces in natural, virtual, and visually impoverished environments. We take an interdisciplinary approach, combining the study of space perception and spatial cognition with applications in virtual environments and visualization. Current projects include: 1) Navigation in Extended Realities (XR), 2) Spatial Gist—perception and memory formed in dynamic navigation tasks, 3) Multisensory cue-combination during navigation, 4) Low vision spatial cognition, 5) Space Perception in XR OPPORTUNITIES FOR STUDENTS The Vision, Audition, Action in Space & Time (VAAST) laboratory has many opportunities for undergraduate research assistants to participate in all aspects of our research. Our research is fun and interactive, involving tasks measuring space perception and spatial cognition in real and virtual environments. It is a great experience to add to graduate school applications as well! If interested, please email Dr. Creem-Regehr. Dr. Creem-Regehr is not considering new graduate student applications for the Fall 2025 admissions cycle. EDUCATION Ph.D., University of Virginia (Psychology, 2000)M.A. University of Virginia (Psychology, 1997)B.A. Colgate University (Psychology, 1994) Selected Publications Creem-Regehr, S. H., Stefanucci, J. K., & Bodenheimer, B. (2023). Perceiving Distance in Virtual Reality: Theoretical Insights from Contemporary Technologies. Philosophical Transactions of the Royal Society B, 378(1869), 20210456. Ruginski, I. T., Giudice, N., Creem-Regehr, S. H., & Ishikawa, T. (2022). Designing mobile spatial navigation systems from the user’s perspective: An interdisciplinary review. Spatial Cognition and Computation 22(1-2), 1-29. Barhorst-Cates, E., Meneghetti, C., Zhao, Y., Pazzaglia, F. & Creem-Regehr, S. H. (2021).  Effects of home environment structure on navigation preference and performance: A comparison in Veneto, Italy and Utah, USA. Journal of Environmental Psychology, 74, 101580. Creem-Regehr, S. H., Barhorst-Cates, E.M., Tarampi, M. R., Rand, K. M. & Legge, G. (2021). How can basic research on spatial cognition enhance the visual accessibility of architecture for people with low vision? Cognitive Research: Principles and Implications, 6(1), 1-18. Gagnon, H. C., Rosales, C. S., Mileris, R., Stefanucci, J.K., Creem-Regehr, S.H., & Bodenheimer, B. (2021). Estimating distances in action space in Augmented Reality. ACM Transactions on Applied Perception, 18(2), 1-16. Barhorst-Cates, E.M., Stefanucci, J.K., & Creem-Regehr, S. H. (2020). A comparison of virtual locomotion methods in movement experts and non-experts: Testing the contributions of body-based and visual translation for spatial updating. Experimental Brain Research, 238 (9), 1911-1923. MY CURRENT GRADUATE STUDENTS Mirinda Whitaker (Psychology)Hunter Finney (Computer Science)Emily Tighe (Psychology)Corey Shayman (Neuroscience)Maggie McCracken (Psychology)Ashley Buzard (Psychology) Last Updated: 9/26/24",
  "content_length": 3825,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:22"
}