{
  "name": "Sara Mostafavi",
  "homepage": "http://saramostafavi.github.io",
  "status": "success",
  "content": "saramostafavi.github.io Mostafavi Lab Welcome! We develop and apply machine learning and statistical methods to study biology, including mechanisms of human health and disease. We are especially interested in developing models for combining association evidence across multiple types of molecular/genomoics data, such as gene expression and genotype data, and modeling prior biological pathways and networks for disentangling spurious from meaningful correlations. To develop methods that lead to new biological insights, my group works closely with colleagues from varied disciplines, including immunology, genetics and neuroscience. As some examples, we are part of the Child and Brain Development program through Canadian Institute for Advanced Research (CIFAR), and a core member of Immunological Genome (ImmGen) Consortium About Sara Mostafavi: I’m on leave from UW during AY 2024–25 and AY 2025–26, leading Genentech's AI for Biology and Translation (AIBT) department. I am an Associate Professor at the Paul Allen School of Computer Science and Engineering at University of Washington (UW). I am also a co-founder of the Machine Learning for Computational Biology (MLCB) Conference. Before joining UW, I was an Assistant Professor at the Department of Statistics and the Department of Medical Genetics at University of British Columbia (UBC), and a faculty member at the Vector Institute. I was the recepient of a Canada Research Chair (CRC II) in Computational Biology (2015-2020), and a Canada CIFAR Chair in Artificial Intelligence (CIFAR-AI). Before UBC, I did a postdoc at Stanford CS working with Daphne Koller. I got my PhD in Computer Science from the University of Toronto in 2011, working with Quaid Morris. My PhD thesis developed machine learning methods for integrating large-scale genomics datasets to predict gene function. Check out GeneMANIA to find out more about this project! You can find my CV here and my google scholar page here. Recent News Mar 1, 2025 Congratulations to Anna, Xinming, Alex and Yilun, our personal genome training paper is now on bioRxiv. Oct 28, 2024 Sara is on leave for the academic year 2024-2025 at Genentech, to head the CompBio and Translation Organization Sep 2, 2024 Congratulations to Wuwei on starting grad school in CS at Princeton! Sep 1, 2024 Congratulations to Alex on starting his own lab at ZMBH in Heidelberg! Aug 1, 2024 Congratulations to Dream on starting grad school at UCL!",
  "content_length": 2445,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:20"
}