{
  "name": "Saroj Kaushik",
  "homepage": "http://www.cse.iitd.ernet.in/~saroj",
  "status": "success",
  "content": "Dr. Saroj Kaushik - Department of Computer Science, IIT Delhi Prof. Saroj Kaushik (Retd.) Dept of Computer Science and engineering Indian Institute of Technology Delhi New Delhi - 110016, India Office: +91 11 26591292 (off) Email: saroj@cse.iitd.ernet.in Link: Click for farewell pics Brief Sketch Dr Saroj Kaushik was a Professor in the Department of Computer Science and Engineering at Indian Institute of Technology, Delhi since 2002 till June 2019. She joined IIT Delhi as a faculty in 1980 after completing her Ph.D in Computer Science from IIT Delhi in the same year. She worked for thirty nine years as a researcher and teacher in IIT Delhi. Her interests are in Location Based services, Social Network Analysis, Artificial Intelligence, Natural Language Processing etc. She has successfully supervised many Ph.D students and has collaborated on various research projects. She published three books: one on Logic and Prolog Programming with New Age International (2000), second on Artificial Intelligence with Cengage Learning (2010) and third on Soft Computing with McGraw Hill (2018).She has more than 100 refereed papers in journals and international conferences. She has guided about 100 theses at MTech and BTech level. She has been examiner for many theses at Ph.D and MS level. She is on the board of studies of various universities and Institutions of repute and was senate member of NIT Hamirpur. She is a member of faculty selection committees for various Institutes and universities. She was invited by MUM University, Fairfield, IOWA state, USA as a visiting professor for teaching AI course and guiding the masters students for their project in 2008 fall. She has visited number of universities abroad and has presented many research papers in good international conferences held in US, Canada, Europe, Australia, Algeria, Malaysia, Japan, Singapore and China. She held various administrative possitions such as Head CSE, Assoc Dean for student welfare, Head of Counseling Cell, President of BSW, House Master and Warden of Girls Hostel etc. She was very active in Institute activities. She is fellow member of IETE (Institution of Electronics and Telecommunication Engineers), and a life member of CSI (Computer Society of India). Currently she is a distinguished professor and Head of CSE department at Shiv Nadar University since July 2019.",
  "content_length": 2364,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:39"
}