{
  "name": "Sartaj Sahni",
  "homepage": "http://www.cise.ufl.edu/~sahni",
  "status": "success",
  "content": "Dr. Sartaj Sahni's Website Sartaj K Sahni Areas of Interest Contact Educational Background Employment History Main Menu Awards Books Copyrights Courses Editorships Grants Patents Professional Activities Publications Ph.D Students Wikipedia and Other Links Gators Welcome Sartaj Sahni is a Distinguished Professor of Computer and Information Sciences and Engineering at the University of Florida. He is also a member of the European Academy of Sciences and the Academy of Engineering, Science, and Medicine Florida, a Fellow of IEEE, ACM, AAAS, and Minnesota Supercomputer Institute, and a Distinguished Alumnus of the Indian Institute of Technology, Kanpur. In 1997, he was awarded the IEEE Computer Society Taylor L. Booth Education Award ``for contributions to Computer Science and Engineering education in the areas of data structures, algorithms, and parallel algorithms'', and in 2003, he was awarded the IEEE Computer Society W. Wallace McDowell Award ``for contributions to the theory of NP-hard and NP-complete problems''. Dr. Sahni was awarded the 2003 ACM Karl Karlstrom Outstanding Educator Award for ``outstanding contributions to computing education through inspired teaching, development of courses and curricula for distance education, contributions to professional societies, and authoring significant textbooks in several areas including discrete mathematics, data structures, algorithms, and parallel and distributed computing.'' In 2016, Dr. Sahni was awarded the IEEE Technical Committee on Scalabale Computing (TCSC) Award for Excellence in Scalable Computing for ``fundamental contributions to scalable computing and leadership in service to the scalable computing community.'' Dr. Sahni has published over four hundred and thirty research papers and written 15 texts. He has 15 US patents. His research publications and patents are on the design and analysis of efficient algorithms, parallel computing, interconnection networks, design automation, and medical algorithms. He is past Editor-in-Chief of ACM Computing Surveys and past co-Editor-in-Chief of the Journal of Parallel and Distributed Computing. Presently, he is on the editorial board of 17 other journals. He is also a member of the steering committee of several international conferences. Students looking for information regarding class assignments, exam dates, and general course information regarding COP 3530 and COP 5536 should click on the courses link to obtain this information. Copyright 2005, 2014, 2016 Sartaj Sahni",
  "content_length": 2513,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:40"
}