{
  "name": "Sasanka Roy",
  "homepage": "https://www.isical.ac.in/~sasanka",
  "status": "success",
  "content": "Homepage of Sasanka Roy, Indian Statistical Institute Sasanka Roy Associate Professor at ACMU, Indian Statistical Institute, Kolkata, India Email: sasanka (at) isical.ac.in About Me I am proud of being member of Scheduled caste (Rajbanshi from Cooch Behar). I had worked in many different positions. The only Government job that I have been offered (of course after a significant long wait and .. !!!) in reserved category is the assistant professor position at ACMU, Indian Statistical Institute. Hence officially it stands (and some people are very eager to remind me about it) that I have got this job with a bio-data that must have been relatively weaker when compared to other faculties belonging to general caste. In my opinion, the relaxation (if any) that is given to me, after comparing (with respect to quality/quantity or whatsoever measures) my publications with other colleagues who work in similar theoretical area of CS from our Unit/Institute, requires a serious deliberation from those wise (of course so called \"wise\") people who talk a lot about (read *against*) reservation, if the relaxation was indeed a relaxation or an anti-relaxation in the name of merit. So the biggest question remains is: \"WHO DID ENJOY THE RESERVATION IN REALITY??\". I strongly believe that merit (on which, may be, depends development of our nation as per se some so called wise people would preach) and reservation are not orthogonal, but the caste discriminations are. But I am surprised to see that in my institute as well as in Indian academic circle, the opposite opinion is prevalent sometime at the indulgence of the authorities. I am afraid to think how these nonsenses are preached without any formal reference frame for comparison. The current verbal reference frame (sometime presented using elegant english words inherited from our colonial masters), which now I understand to be completely brahmanical in nature, is a holy crap to me. Some people would love me and some would hate me. I mostly ignore the hatred and carry on with them for whom I am a beloved one :) I say this because I have experienced caste discriminations, specially, higher the places (according to the prevalent culture) stronger the order of discriminations are, of course in a highly sophisticated form :):):) One fine day, I plan to share my experiences on discriminations through my blog, right here. If you are an ISI student who is interested to work with me, I insist you to please go through my recent publications (works done in last two/three years) to get an idea about my current research interests. Publications: Journal Publications Conference Publications Students: Interests: Computational Geometry, Geometric Optimizations, Design and Analysis of Algorithms, Data Structures Positions Held: 1. Associate Professor (August, 2017 - Present) Indian Statistical Institute, Kolkata, India. (Promotion was offered without any relaxation). 1. Assistant Professor (August, 2015 - August, 2017) Indian Statistical Institute, Kolkata, India. (Position was offered under SC category). 2. Associate Professor (April, 2013 - August, 2015) Chennai Mathematical Institute, Chennai, India (Promotion was offered without any relaxation). 3. Assistant Professor (April, 2010 - August, 2013) Chennai Mathematical Institute, Chennai, India (Position was offered without any relaxation). 4. Assistant Professor (June, 2011 - July, 2012) Indian Institute of Science Education and Research (IISER), Kolkata, India. ((on lien from CMI), Position was offered without any relaxation). 5. Visiting Professor (August, 2013-December, 2013) Simon Fraser University, BC, Canada. (On Sabbatical from CMI) 6. Centenary Postdoctoral Fellow (May, 2009 - March 2010) Indian Institute of Science (IISc), India. (Position offered without any relaxation). 7. Scientist (October, 2006 - March 2009) Tata Research Development and Design Centre, India. 8. Other Position Offered: I was offered an assistant professor position at computer science department of IIT, Ropar (in 2009) without any relaxation . I regretted the offer in favor of joining CMI. Academics: PhD in Computer Science (in 2007) Indian Statistical Institute, Kolkata, India. (There was no reservation in PhD Admission of ISI until 2015). Master of Computer Applications (in 2001) North Bengal University, West Bengal. (Admission offered under SC category). PS: ``without any relaxation'' means that the position was offered without any relaxation on the basis of caste reservation. I might have received facilities of reservation which I am not aware of and is not listed here. Disclaimer: The information in this page is not meant to hurt anyone personally.",
  "content_length": 4684,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:43"
}