{
  "name": "Sasa Radomirovic",
  "homepage": "https://www.surrey.ac.uk/people/sasa-radomirovic",
  "status": "success",
  "content": "Dr Sasa Radomirovic | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Dr Sasa Radomirovic Senior Lecturer in Secure Systems; Programme Lead of MSc Information Security PhD (Rutgers University, NJ, USA) +44 (0)1483 689305 s.radomirovic@surrey.ac.uk05 BB 02Academic and research departments Surrey Centre for Cyber Security, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographySasa Radomirovic holds a PhD from the Department of Mathematics at Rutgers University (2005). He has held postdoctoral positions at NTNU Trondheim, Norway; CRM Barcelona, Spain; and the University of Luxembourg. He was a senior scientist at ETH Zurich, his alma mater, in the Institute for Information Security. Before joining the University of Surrey in April 2022, he has held faculty positions at the University of Dundee and at Heriot-Watt University. Expand biography Areas of specialism Formal Methods for Information Security; Formal Modeling and Verification of Cryptographic Protocols University roles and responsibilities Director of the NCSC-accredited Information Security MScSupervisionPostgraduate research supervisionPrevious PhD students (co-supervised):Lara Schmid (ETH Zürich, 2020)Michael Schläpfer (ETH Zürich, 2016)Ton van Deursen (University of Luxembourg, 2011) Expand PublicationsHighlightsSven Hammann, Michael Crabb, Sasa Radomirovic, Ralf Sasse, David A. Basin: \"I'm Surprised So Much Is Connected\". CHI 2022: 620:1-620:13David A. Basin, Jannik Dreier, Sofia Giampietro, Sasa Radomirovic: Verifying Table-Based Elections. CCS 2021: 2632-2652David A. Basin, Sasa Radomirovic, Lara Schmid: Dispute Resolution in Voting. CSF 2020: 1-16Sven Hammann, Sasa Radomirovic, Ralf Sasse, David A. Basin: User Account Access Graphs. CCS 2019: 1405-1422David A. Basin, Jannik Dreier, Lucca Hirschi, Sasa Radomirovic, Ralf Sasse, Vincent Stettler:A Formal Analysis of 5G Authentication. CCS 2018: 1383-1396David A. Basin, Sasa Radomirovic, Lara Schmid: Modeling Human Errors in Security Protocols. CSF 2016: 325-340Barbara Kordy, Sjouke Mauw, Sasa Radomirovic, Patrick Schweitzer: Attack-defense trees. J. Log. Comput. 24(1): 55-87 (2014)Ton van Deursen, Sjouke Mauw, Sasa Radomirovic: mCarve: Carving Attributed Dump Sets. USENIX Security Symposium 2011 Expand research highlights Sasa Radomirovic (2023)SAC 2023: Track Editorial [IoT and Edge Computing], In: Proceedings of the 38th ACM/SIGAPP Symposium on Applied ComputingDOI: 10.1145/3555776Sasa Radomirovic (2022)Session details: Theme: System software and security: SEC - computer security track, In: Proceedings of the 37th ACM/SIGAPP Symposium on Applied Computing ACMDOI: 10.1145/3535445Luca Arnaboldi, David Aspinall, Christina Kolb, Saša Radomirović (2024)Tactics for Account Access Graphs, In: Computer Security – ESORICS 202314346470 SpringerDOI: 10.1007/978-3-031-51479-1_23Account access graphs have been proposed as a way to model relationships between user credentials, accounts, and methods of access; they capture both multiple simultaneous access routes (e.g., for multi-factor authentication) as well as multiple alternative access routes (e.g., for account recovery). In this paper we extend the formalism with state transitions and tactics. State transitions capture how access may change over time as users or adversaries use access routes and add or remove credentials and accounts. Tactics allow us to model and document attacker techniques or resilience strategies, by writing small programs. We illustrate these ideas using some attacks against mobile authentication and banking applications which have been publicised in 2023.Barbara Fila, Sasa Radomirovic (2024)Nothing is Out-of-Band: Formal Modeling of Ceremonies, In: 37th IEEE Computer Security Foundations Symposium (CSF 2024)pp. 464-478 Institute of Electrical and Electronics Engineers (IEEE)DOI: 10.1109/CSF61375.2024.00049We develop and explain the design decisions of a framework for the formal specification and analysis of interactions in generalized distributed systems. Our approach is suitable to reason about various types of agents and supports the modeling of synchronous interactions between any finite number of agents. Our proposal provides a common ground for existing modeling techniques for cryptographic protocols and security ceremonies, by generalizing and unifying them in a single formalism. We discuss the specification of security properties in our framework and demonstrate on a short voting ceremony a technique to model our ceremonies in the Tamarin prover.Sjouke Mauw, Sasa Radomirovic, Mohammad Torabi Dashti (2009)Minimal Message Complexity of Asynchronous Multi-party Contract Signing, In: PROCEEDINGS OF THE 22ND IEEE COMPUTER SECURITY FOUNDATIONS SYMPOSIUMpp. 13-25 IEEEDOI: 10.1109/CSF.2009.15Multi-party contract signing protocols specify how a number of signers can cooperate in achieving a fully signed contract, even in the presence of dishonest signers. This problem has been studied in different settings, yielding solutions of varying complexity. Here we assume the presence of a trusted third party that will be contacted only in case of a conflict, asynchronous communication, and a total ordering of the protocol steps. Our goal is to develop a lower bound on the number of messages in such a protocol. Using the notion of abort chaining, a specific type of attack on fairness of signing protocols, we derive the lower bound alpha(2) + 1, with alpha > 2 being the number of signers involved. We obtain the lower bound by relating the problem of developing fair signing protocols to the open combinatorial problem of finding shortest permutation sequences. This relation also indicates a way to construct signing protocols which are shorter than state-of-the-art protocols. We illustrate our approach by presenting the shortest three-party fair contract signing protocol.David Basin, Michel Keller, Sasa Radomirovic, Ralf Sasse (2015)Alice and Bob Meet Equational Theories, In: N MartiOliet, P C Olveczky, C Talcott (eds.), LOGIC, REWRITING, AND CONCURRENCY9200pp. 160-180 Springer NatureDOI: 10.1007/978-3-319-23165-5_7Cryptographic protocols are the backbone of secure communication over open networks and their correctness is therefore crucial. Tool-supported formal analysis of cryptographic protocol designs increases our confidence that these protocols achieve their intended security guarantees. We propose a method to automatically translate textbook style Alice&Bob protocol specifications into a format amenable to formal verification using existing tools. Our translation supports specification modulo equational theories, which enables the faithful representation of algebraic properties of a large class of cryptographic operators.Ton van Deursen, Sasa Radomirovic (2009)On a new formal proof model for RFID location privacy, In: Information processing letters110(2)pp. 57-61 ElsevierDOI: 10.1016/j.ipl.2009.10.007We discuss a recently proposed formal proof model for RFID location privacy. We show that protocols which intuitively and in several other models are considered not to be location private, are provably location private in this model. Conversely, we also show that protocols which obviously are location private, are not considered location private in this model. Specifically, we prove a protocol in which every tag transmits the same constant message to not be location private in the proposed model. Then we prove a protocol in which a tag's identity is transmitted in clear text to be weakly location private in the model. (C) 2009 Elsevier B.V. All rights reserved.Jannik Dreier, Lucca Hirschi, Sasa Radomirovic, Ralf Sasse (2018)Automated Unbounded Verification of Stateful Cryptographic Protocols with Exclusive OR, In: IEEE 31ST COMPUTER SECURITY FOUNDATIONS SYMPOSIUM (CSF 2018)2018-pp. 359-373 IEEEDOI: 10.1109/CSF.2018.00033Exclusive-or (XOR) operations are common in cryptographic protocols, in particular in Rill) protocols and electronic payment protocols. Although there are numerous applications, due to the inherent complexity of faithful models of XOR, there is only limited tool support for the verification of cryptographic protocols using XOR. The TAMARIN prover is a state-of-the-art verification tool for cryptographic protocols in the symbolic model. In this paper, we improve the underlying theory and the tool to deal with an equational theory modeling XOR operations. The XOR theory can be freely combined with all equational theories previously supported, including user-defined equational theories. This makes TAMARIN the first tool to support simultaneously this large set of equational theories, protocols with ",
  "content_length": 44230,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:42"
}