{
  "name": "Sasu Tarkoma",
  "homepage": "https://www.cs.helsinki.fi/u/starkoma",
  "status": "success",
  "content": "CS Department's User Page Computer Science / Sasu Tarkoma Professor, Ph.D. Dean, Faculty of Science at the University of Helsinki Director of the Nokia Center for Advanced Research (NCAR) PI at the Helsinki Institute for Information Technology (HIIT) PI at the Finnish Center for AI (FCAI) flagship Director of the Helsinki Centre for Data Science (HiDATA) 2018-2022 PI at the Intel Collaborative Research Institute on Secure Computing, now concluded Phone (mobile): +358 40 5062163 (SMS is fine) Email: sasu.tarkoma(at)cs.helsinki.fi Skype: sasu.tarkoma LinkedIn Office: Faculty Council at Physicum Reception: please send email Address (at the Department): Tietojenkäsittelytieteen laitos PL 68 (Pietari Kalmin katu 5 00014 HELSINGIN YLIOPISTO My Erdős number is 3. Interests Internet technology, Internet of Things, data science, mobile and ubiquitous computing, publish/subscribe. Affiliations Chairman, Scientific Advisory Board for Finnish Defence (MATINE) Fellow, the Institution of Engineering and Technology (IET) Fellow, the European Alliance for Innovation (EAI) Senior Member, Institute of Electrical and Electronics Engineers (IEEE) Senior Member, Association for Computing Machinery (ACM) The Finnish Union of University Professors (Professoriliitto) Member of the Union of Journalists in Finland. COST Information and Communication Technologies Member (2010-2014) Contents Recent highlights Bio Presentations by Head of Department Selected research results Awards, recognitions, mentions Instructed/supervised PhD degrees and PhD referee activity Selected presentations and talks Recent projects Recent professional activities Published work Theses Past teaching Bio in English Professor Sasu Tarkoma is Dean of the Faculty of Science at the University of Helsinki and Professor of Computer Science. He is Chairman of the Scientific Advisory Board for Finnish Defence (MATINE). He has authored 4 textbooks and published over 240 scientific articles and 10 granted US Patents; his h-index is 47. He is Fellow of IET and EAI, and Senior Member of IEEE and ACM. His research interests are Internet technology, distributed systems, data analytics, and mobile and ubiquitous computing. His research has received several Best Paper awards and mentions, for example, at IEEE PerCom, ACM CCR, and ACM OSR. He is actively involved in the Helsinki Institute for Information Technology (HIIT), the Finnish Center for AI (FCAI) flagship, Helsinki Center for Data Science (HiDATA), and the Allied ICT Finland network. His flagship MegaSense research program aims to elevate air quality and environmental monitoring to the next level by providing a real-time and accurate view to the chemical cocktail and the micro climates of mega cities. MegaSense involves a novel hierarchy of distributed air quality sensors, in which more accurate sensors calibrate lower cost sensors. Current low-cost air quality sensors suffer from measurement drift and they have low accuracy. This significant open problem is addressed by a new AI-based calibration scheme. MegaSense integrates with the 5G cellular network and leverages mobile edge computing for sensor management and distributed pollution map creation. Bio in Finnish Sasu Tarkoma on tietojenkäsittelytieteen professori ja matemaattis-luonnontieteellisen tiedekunnan dekaani Helsingin yliopistossa. Hän johtaa myös Helsinki Centre for Data Science (HiDATA)-yksikköä ja on Finnish Center for AI (FCAI)-lippulaivan jäsen. Tarkomalla on laaja kokemus kansallisista sekä kansainvälisistä johto- ja luottamustehtävistä. Hän on laaja-alaisen ja monitieteisen Maanpuolustuksen tieteellisen neuvottelukunnan (MATINE) puheenjohtaja sekä Valtiovarainministeriön asettaman tekoälyn ja digitalisaation tutkimuksen valtakunnallisen asiantuntijaryhmän jäsen. Tarkoman tutkimus keskittyy digitalisaation avainkysymyksiin erityisesti yhteiskunnan hyödyntämän ICT-infrastruktuurin suunnitteluun, resilienssiin sekä suojaamiseen. Hän on erityisesti vaikuttanut mobiilijärjestelmien ja esineiden Internetin sekä pilvilaskennan mahdollistamiin uusiin ratkaisuihin ja niiden tietoturvaan sekä tietosuojaan. Hänen nykyinen tutkimuksensa yhdistää ympäristön havainnoinnin ja kestävyyden, uudet anturiteknologiat sekä tekoälyn kokonaisuudeksi, jolla ympäristön tilannekuvaa voidaan muodostaa päätöksenteon tueksi reaaliaikaisesti, skaalautuvasti ja tietosuoja huomioon ottaen. Tarkomalla on merkittävää ja pitkäaikaista yhteistyötä teollisuuden kanssa ja hän on käynnistänyt useita tutkimuskeskuksia Suomessa, esimerkiksi Intel Collaborative Research Institute for Secure Computing ja Nokia Center for Advanced Research. Hänen tutkimusryhmänsä tulosten pohjalta on käynnistetty useita yrityksiä. Hän on julkaissut yli 240 tieteellistä artikkelia, 4 kirjaa ja hänellä on 10 myönnettyä patenttia. Hän on saanut useita palkintoja tutkimustyöstä (IEEE ja ACM) ja hänelle on myönnetty kaksi Fellow arvoa (the Institution of Engineering and Technology (IET) ja European Alliance for Innovation (EAI)). Presentations by Head of Department Link to intranet Recent highlights Helsinki Center for Data Science (HiDATA) events G20 RIYADH Global Digital Health Summit: Global Strategic Partnership in Digital Health to Fight Pandemics. Member of the Advisory Board StartmeupHK 2020 festival panel speaker Edge AI Special Interest Group connecting FCAI and 6Genesis flagships AI and Data Science Against COVID Webinar series Dagstuhl Seminar Identifying Key Enablers in Edge Intelligence with 6G Edge Intelligence 7th Finland-China-Netherlands (FCN 2020) workshop on Edge Intelligence, IoT Systems and Analytics Media visibility: Latest media mentions from the TUHAT system Past media visibility: Interview on university and industry collaboration. Appeared in Yliopistolainen magazine, 2015. Yliopistot lähenevät yrityksiä - Helsingin yliopistossa keksintöjä on tehty nyt ennätysmäärä. Article in Helsingin Sanomat 9/11/2015. Esineiden Internet on seuraava teknologinen murros article in Finnish. Internet of Things research featured in YLE Prisma Studio television program Carat featured on Danish radio Carat context dataset released. Carat covered by Helsingin Sanomat: What is draining my phone battery? Carat reveals the culprit and How long does your phone battery last? IoT and 5G talk at Hetky New Digile blog entry \"Matkapuhelin tietää pian, millä liikennevälineellä matkustat - entä sitten?\" Talouselämä article on Android malware (in Finnish). YLE Tiedevartti haastattelu \"Esineiden Internet\" 18.10.2013 IoT Week June 2013 presentation video by Mr. Wilhelm Rauss (Ericsson) and prof. Tarkoma. Mentioned in Tietokone magazine article \"Verkotetut vermeet\" 8/2013. UH news item on IoT in 2012. YLE Puhe interview pertaining to mobile phones and innovations (Finnish) 18.4.2012. Tivit Webinar on IoT in 2012. Carat collaborative energy profiling applications for iOS and Android are available here! 7 News video and article! Yhdistetyt tietojenkäsittelyn päivät 2012 were held on 28-29.5.2012 in Kumpula! The proceedings can be found here. Science coverage Scientific American. Podcast titled App IDs Other Battery-Eater Apps. Scientific American. Content is king: clean-slate Internet research featured in Scientific American features section. ACM Technews September 17, 2014. Researchers' New App Outs iPhone and Android Phone Energy Hogs ACM Technews April 08, 2015. Researchers Measure Smartphone Malware Infection Rates. MIT Technology Review December 16, 2014. First Direct Measurement of Infection Rates For Smartphone Viruses Selected research highlights Prof. Tarkoma was the Academic Coordinator of the large-scale 50 MEUR Finnish Internet of Things research program 2011-2016 (www.internetofthings.fi). The research program paved way for 5G research and standardization pertaining to IoT. The program made many IETF, 3GPP and IEEE standardization contributions related to IoT and pioneered massive Machine-Type-Communications (mMTC) in 4G and then later 5G. One highlight research result of the program was an algorithm for transportation mode detection based on acceleration patterns published at ACM SenSys 2013. A company, Moprim Ltd., was formed based on the result. Moprim has won several startup awards related to their smart city products. Prof. Tarkoma was the architecture lead for the Publish-Subscribe Internet Routing Paradigm (PSIRP) EU FP7 project that proposed a new architecture for computer networks based on publish/subscribe. PSIRP was the first project to propose a clean-slate Publish-Subscribe inspired future networking architecture. The PURSUIT successor project to PSIRP received the EU Future Internet Award. PSIRP/PURSUIT and ICN demonstrate new networking technologies that have promising features for efficient data delivery and improved network security. Long-term research on collaborative mobile analytics, in which data gathered from smartphones is used to diagnose and correct energy and battery problems in mobile devices. The Carat system was the first collaborative mobile analytics and diagnostics service. Carat is an application for iOS and Android devices that has become very popular with over 850 000 users across the world. The application has helped active users to extend their battery lives. This research has resulted in a generic methodology for analyzing and diagnosing mobile systems, and it is being applied to identify battery defects, charging anomalies, and identify and predict malware on devices. The research activity has contributed open anonymized data sets for the research community. The Carat project has received many awards including the prestigious Mark Weiser Best Paper award at IEEE Percom 2015. The practical impact of the research helps people to extend smartphone battery operating times and keep devices clean of malware. The research has been widely covered by the media and the research results are used by several companies in their products. He has led research work on security AI for computer ",
  "content_length": 36421,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:46"
}