{
  "name": "Sathyanarayanan N. Aakur",
  "homepage": "https://saakur.github.io",
  "status": "success",
  "content": "Sathyanarayanan N. Aakur Sathyanarayanan N. Aakur IEEE Senior Member Assistant Professor Department of Computer Science and Software Engineering Auburn University Email: san0028 -at- auburn.edu [ LinkedIn ] [ Twitter ] We are looking for students to join our lab! Check out Recruiting for more details. Highlights and News Fall'25 Two papers accepted to WACV 2026! Congrats to Shubham on his 5th paper and Akash on his first and to Thilina and Dr. Kandah for their works! Preprints to come! Fall'25 One paper accepted to IJCNLP-AACL 2025! Congrats to Yash Mahajan and all co-authors! Fall'25 One paper accepted to International Conference on Data Science (IKDD CODS 2025)! Congrats to the undergraduate students Chaitanya Garg and Tanishq Jain on their first papers! Fall'25 Serving as Associate Editor for IEEE MultiMedia and ACM Transactions on Internet Technology! Fall'25 Serving as Area Chair for IEEE/CVF CVPR 2026 and IEEE/CVF WACV 2026! Summer'25 Our paper on open world functional affordance grounding has been accepted to the Conference on Neurosymbolic Learning and Reasoning (NeSy 2025)! Congrats to my student Zhou Chen for his second paper and to Joe Lin on his first paper! Link to preprint is here Summer'25 Our paper on open world egocentric action recognition has been accepted to IEEE/CVF International Conference on Computer Vision (ICCV)! Congrats to my student Sanjoy Kundu for his trifecta of A* vision papers and to Shanmukha Vellamcheti on his first paper! Preprint can be found here. Summer'25 Our paper on acive event perception with free energy minimization has been accepted to IEEE Robotics and Automation Letters! Congrats to my student Zhou Chen on his first paper! Spring'25 Serving as Area Chair for BMVC 2025! Spring'25 Congrats to my student John Lieb on winning the 2024-2025 Auburn University Undergraduate Research Fellowship! Fall'24 One paper on analyzing ML for corn yield prediction accepted at Smart Agricultural Technology! Congrats to Shengfang Ma, my former M.S. student, whose thesis drove this work! Paper can be found here. Fall'24 Serving as Area Chair for IEEE/CVF CVPR 2025, IEEE/CVF WACV 2025, ICML 2025, and NeurIPS 2025! More news.. About Me I am an Assistant Professor in the Computer Science and Software Engineering Deoartment at Auburn University. Previously, I was an Assistant Professor in the Department of Computer Science at Oklahoma State University, Stillwater. I received my PhD from University of South Florida, where I worked with Dr. Sudeep Sarkar in the Computer Vision and Pattern Recognition Group and with Dr. Kenneth Malmberg. I received my Master's degree in Management Information Systems from the Muma College of Business at the University of South Florida and my undergraduate degree in Electronics and Communication Engineering from Velammal Engineering College, Anna University, India. Research In my research, I’m broadly interested in the intersection of computer vision, natural language processing, and psychology: I aim to build intelligent agents that understand the visual world beyond recognition (labels) or captions (sentences) without the need for explicit human supervision through expensive annotations. This entails developing approaches that do things such as: self-supervised predictive learning for video event segmentation commonsense reasoning to ground perception and prior knowledge generative modeling for building knowledge from the ground-up Much of my group's current work focuses on analyzing, modeling, and synthesizing complex video scenes and the semantic structure that can describe them. I also work on applying machine learning to other domains, such as IoTs We also work on use-inspired artificial intelligence research with applications in agriculture and animal diagnostics. Teaching Spring 2025: COMP 1100 The Power of AI: Fundamentals to Applications. Auburn University. Spring 2024: COMP 5630/6630 Machine Learning. Auburn University. Fall 2023, 2024: COMP 5600/6600 Artificial Intelligence. Auburn University. Fall 2020, 2021, 2022: CS 4783/5783 Machine Learning. Oklahoma State University. Spring 2020, 2021, 2022, 2023: CS 5323 Design and Implementation of Operating Systems II. Oklahoma State University. Summer 2019: COP 2512: IT Programming Fundamentals. University of South Florida (USF) Spring 2019: Co-taught CAP 6415: Computer Vision. Primary Instructor: Dr. Sudeep Sarkar. (USF) Summer 2016: COP 2512: IT Programming Fundamentals. (USF) Talks Active event perception for effective human-robot collaboration. 1st KAMTIC Manufacturing Technology Innovation Workshop. Spring 2025. Towards open world egocentric activity recognition from multimodal videos. Area Chair Workshop, CVPR 2024 Summer 2024. Towards Multimodal Open World Event Understanding with Neuro Symbolic Reasoning. DMS Statistics and Data Science Seminar, Auburn University. Spring 2024. Towards Multimodal Open World Event Understanding with Neuro Symbolic Reasoning. WADLA 3.0, IIT-Sri City. Fall 2023 Towards Multimodal Open World Event Understanding with Neuro Symbolic Reasoning. 7th Summer School on AI, IIT-Hyderabad. Summer 2023 Representation Learning for Metagenomics: An Explorative Study. INTERACT Symposium on One Health and One Medicine. Summer 2023 Towards Open World Event Understanding with Neuro Symbolic Reasoning. The University of Iowa. Spring 2023 Towards Open World Multimodal Event Understanding with Neuro Symbolic Reasoning. Auburn University Spring 2023 Towards Multimodal Open World Event Understanding with Neuro Symbolic Reasoning. Washington University in St. Louis. Fall 2023 Towards Open World Visual Understanding with Neuro Symbolic Reasoning. Mega AI series, Pacific Northwest National Lab (PNNL). Fall 2022 Towards Intelligent Agents with Open World Visual Understanding. Collaborative Assistants for the Society (CASY 2020), University of South Carolina. Fall 2020 Latent Space Modeling for Cloning Encrypted PUF-based Authentication. IFIP International Internet of Things (IoT) Conference, Fall 2019 The Role of Commonsense Reasoning in Visual Understanding. Oklahoma State University. Fall 2018 Going Deeper with Semantics: Exploiting Semantic Contextualization for Interpretation of Human Activity in Videos. Technical Seminar Series, Statistical Shape Analysis and Modeling Group, Florida State University. Fall 2018 Video Event Understanding with Pattern Theory. Robotics Technical Seminar Series, Department of Mechanical Engineering,University of South Florida. Spring 2018 Inherently Explainable Model for Video Activity Recognition. AAAI Workshop On Reasoningand Learning for Human-Machine Dialogues, 2018 Leveraging ConceptNet to Reduce Training Requirements for Video Descriptions, Seminar in AI, University of South Florida, Spring 2017 Towards a Knowledge-based Approach to Video Comprehension. Conference on Computer and Robot Vision (CRV), Spring 2017",
  "content_length": 6898,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:48"
}