{
  "name": "Sathish S. Vadhiyar",
  "homepage": "https://cds.iisc.ac.in/faculty/vss",
  "status": "success",
  "content": "Sathish Vadhiyar's Homepage Sathish Vadhiyar Professor Department of Computational and Data Sciences (CDS) Chair, Supercomputer Education and Research Centre (SERC) Indian Institute of Science (IISc), Bangalore - 560012, India e-mail: vss@iisc.ac.in Phone: 91-80-22932615 Fax: 91-80-23602648 Associated Lab: Middleware and Runtime Systems (MARS) Lab CV - PDF Bio I am a Professor in CDS and SERC, IISc. Prior to joining IISc, from 1999-2003, I was in Innovative Computing Lab of Dr. Jack Dongarra, Computer Science Department, University of Tennessee, USA, first as a PhD student and then as a senior research associate. more... Research My research interests are in high performance computing (HPC) in general, and building middleware and runtime systems for parallel applications and systems, in particular. Our lab, MARS, deals with the following primary areas: HPC Runtime Systems / Application Frameworks: Our lab works on building runtime systems for HPC applications on both accelerator and general HPC systems. We primarily focus on irregular applications including graph applications, N-Body simulations, Molecular Dynamics (MD), and Adaptive Mesh Refinement (AMR) applications. We have also worked with applications in climate science and visualization in collaboration with researchers working in these areas. Accelerator systems: Techniques for load balancing, hybrid executions utilizing both CPU and GPU cores, and efficient executions of different programming models on these systems. Large-scale systems: Scalability studies, tools and techniques, processor allocation, mapping and remapping strategies on HPC network topologies. Middleware: Job Scheduling: Our work is on analyzing job submissions, developing prediction strategies and scheduling techniques that use predictions for efficient job management and utilization of production supercomputer systems. Fault Tolerance: For exascale applications using checkpointing and process replication. Besides these, we are also eager to learn about and provide solutions for efficient executions, good speedups, and in general remarkable reduction in turnaround times of large time-consuming Industrial applications. more... Publications Anwesha Bhowmick, Sathish S. Vadhiyar, Varun PV. Scalable Multi-node Multi-GPU Louvain Community Detection Algorithm for Hetergeneous Architectures. Concurrency & Computation: Practice & Experience Volume. 34(17), 2022. Manasi Tiwari, Sathish S. Vadhiyar. Pipelined Preconditioned Conjugate Gradient Methods for Real and Complex Linear Systems for Distributed Memory Architectures. Journal of Parallel and Distributed Computing, Volume. 163, Pagess 147-155, 2022. Manasi Tiwari, Sathish Vadhiyar. Pipelined Preconditioned s-step Conjugate Gradient Methods for Distributed Memory Systems. In the proceedings of the IEEE Cluster, September 2021. KG Renga Bashyam, Sathish Vadhiyar. Fast Scalable Approximate Nearest Neighbour Search for High-Dimensional Data. In the proceedings of the IIEEE Cluster, September 2020. Manasi Tiwari, Sathish Vadhiyar. Pipelined Preconditioned Conjugate Gradient Methods for Distributed Memory Systems. In the proceedings of the  IIEEE International Conference on High Performance Computing, Data and Analytics (HiPC), December 2020. more... Students Current: 2 PhD, 1 Masters by Course. Past: 4 PhDs, 12 Masters by Research, 22 Masters by Course, 1 long-duration student intern from INSA, Lyon. more... Teaching DS 295, January, 3:1. Parallel Programming. 2004-date DS 221, August, 3:1. Introduction to Scalable Systems. (With Profs. Matthew Jacob and Yogesh Simmhan/Chirag Jain). 2017-date. SE 286, August, 3:1. Data Structures and Programming. 2014. SE 292, August, 3:0. High Performance Computing. 2009-13, 15-16. E 293, August, 3:1. Topics in Grid Computing. 2004-07. Professional Activities Editorial Boards: Associate Editor, TPDS. April 2014-2018. Award Committee: ACM Senior Member Award Comittee. Member, March 2015-December 2017. Chair, 2018. Chair: HiPC Program Co-Chair HPC 2022, HiPC Vice Chair Algorithms Track 2021, Session Chair - HPCC 2017, Session Chair - ICS 2013, Student affairs committee chair - PPoPP 2010,... Program Committee: IEEE IPDPS 2023, IEEE Cluster 2022, IPDPS 2021, HiPC 2020, ICPP 2020, ... Reviewer: Parco 2017, CPE 2017, ACM Supercomputing Surveys 2016, Journal of Supercomputing 2016,... National, Institute Services: : Investigator, NSM for R&D projects, 2021-date, UG SCC Member, 2022-date, Member, PCC, BTech in Math & Computing, 2021. Invited Talks: Shell-IISc workshop, 2021, FDP program in NMIT Bangalore, 2021, IIT Indore NSM workshop 2021, Adena workshop 2020,... more... Awards Outstanding Reviewer Status for Journal of Parallel and Distributed Computing, May 2015. NVIDIA Innovation Award. For the project \"GPU-enabled Efficient Executions of Radiation Calculations for Climate Modeling''. 2013. Yahoo! Faculty Research Award, 2011. Indian National Academy of Engineering (INAE) Young Engineer Award, 2009. University of Tennessee citation for Extraordinary Professional Promise, 2003. Interested in working with us? Look for project positions in our lab positions page. Last Modified: February, 2023 Copyright Â© 2010 Sathish Vadhiyar",
  "content_length": 5217,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:46"
}