{
  "name": "Satish Rao",
  "homepage": "http://www.cs.berkeley.edu/~satishr",
  "status": "success",
  "content": "Satish Rao's Home Page Satish Rao Professor Computer Science Division 687 Soda Hall University of California Berkeley, CA 94720-1776 Phone: (510) 642-4328 Fax: (510) 642-5775 Email:satishr is my username and the hostname is cs.berkeley.edu Contents : Teaching / Research Interests / Recent Papers / Selected Papers / Contact information / Office Hours / Other Office Hours CS270: See Edstem. Soda 687. Teaching CS270 Fall 2025 Research interests Design and analysis of algorithms Combinatorial optimization Papers. DBLP list of papers. Google Scholar Some no so recent papers: see DBLP! [1] Kamalika Chaudhuri, Satish Rao, Samantha Riesenfeld, and Kunal Talwar. A push-relabel approximation algorithm for approximating the minimum-degree mst problem and its generalization to matroids. Theor. Comput. Sci., 410(44):4489-4503, 2009. [ bib | http ] [2] Benjamin I. P. Rubinstein, Blaine Nelson, Ling Huang, Anthony D. Joseph, Shing hon Lau, Satish Rao, Nina Taft, and J. D. Tygar. Stealthy poisoning attacks on pca-based anomaly detectors. SIGMETRICS Performance Evaluation Review, 37(2):73-74, 2009. [ bib | http ] [3] Kamalika Chaudhuri, Satish Rao, Samantha Riesenfeld, and Kunal Talwar. What would edmonds do? augmenting paths and witnesses for degree-bounded msts. Algorithmica, 55(1):157-189, 2009. [ bib | http ] [4] Punyashloka Biswal, James R. Lee, and Satish Rao. Eigenvalue bounds, spectral partitioning, and metrical deformations via flows. J. ACM, 57(3), 2010. [ bib | http ] [5] Sagi Snir and Satish Rao. Quartets maxcut: A divide and conquer quartets algorithm. IEEE/ACM Trans. Comput. Biology Bioinform., 7(4):704-718, 2010. [ bib | http ] [6] Satish Rao and Shuheng Zhou. Edge disjoint paths in moderately connected graphs. SIAM J. Comput., 39(5):1856-1887, 2010. [ bib | http ] [7] Blaine Nelson, Benjamin I. P. Rubinstein, Ling Huang, Anthony D. Joseph, Shing hon Lau, Steven J. Lee, Satish Rao, Anthony Tran, and J. Doug Tygar. Near-optimal evasion of convex-inducing classifiers. Journal of Machine Learning Research - Proceedings Track, 9:549-556, 2010. [ bib | .html ] [8] Benjamin I. P. Rubinstein, Blaine Nelson, Ling Huang, Anthony D. Joseph, Shing hon Lau, Satish Rao, Nina Taft, and J. D. Tygar. Antidote: understanding and defending against poisoning of anomaly detectors. In Feldmann and Mathy [10], pages 1-14. [ bib | http ] [9] Moses Charikar, Mohammad Taghi Hajiaghayi, Howard J. Karloff, and Satish Rao. 22 spreading metrics for vertex ordering problems. Algorithmica, 56(4):577-604, 2010. [ bib | http ] [10] Howard J. Karloff and Toniann Pitassi, editors. Proceedings of the 44th Symposium on Theory of Computing Conference, STOC 2012, New York, NY, USA, May 19 - 22, 2012. ACM, 2012. [ bib | http ] The above list was generated by bibtex2html 1.95. Selected papers Beyond the Flow Decomposition Barrier. In JACM 2001. (With Andrew Goldberg.) Small distortion and volume preserving embeddings for Planar and Euclidean metrics. In Symposium on Computational Geometry, June 1999. Towards Efficiency and Portability: Programming with the BSP Model. Extended version has appeared in the IEEE Transactions on Computers 48(7): 670-689. (1999). With M. Goudreau, K. Lang, T. Suel, and A. Tsantilas. Ratio Regions: a technique for image segmentation. Packet routing and job-shop scheduling in $O(congestion + dilation)$ steps. In Combinatorica 1994. With Bruce Maggs and F.T. Leighton. Random Stuff Congratulations! Letters and Sciences, Computer Science Majors, Class of 2003 To be or not with PCP",
  "content_length": 3525,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:51"
}