{
  "name": "Satish K. Tripathi",
  "homepage": "https://www.buffalo.edu/president/biography.html",
  "status": "success",
  "content": "About Satish K. Tripathi - UB Office of the President - University at Buffalo About Satish K. Tripathi Internationally recognized as an accomplished researcher and transformative higher education leader, Dr. Satish K. Tripathi was appointed the 15th president of the University at Buffalo on April 18, 2011.Education and ServiceThe first international-born president in UB’s history, Tripathi graduated at the top of his class from Banaras Hindu University (BHU) in India and holds a doctorate in computer science from the University of Toronto, as well as three master’s degrees—one in computer science from the University of Toronto and two in statistics from the University of Alberta and BHU. In 2024, Tripathi was elected to the American Academy of Arts and Sciences. A fellow of the Institute of Electrical and Electronics Engineers (IEEE) and the American Association for the Advancement of Science (AAAS), he was awarded honorary doctorates from Maharaja Surajmal Brij University in India, the Indian Institute of Information Technology, Allahabad, and Brock University in Canada.Tripathi is co-chair of the Association of American Universities (AAU) Task Force on Expanding U.S.-India University Partnerships, board member of the University Innovation Alliance, steering committee member of the SUNY Asian American, Native Hawaiian, Pacific Islander (AANHPI) Leadership Institute and serves on the College Football Playoff Board of Managers. Previously, he was chair of the Mid-American Conference Council of Presidents and Internet 2. He also served on the boards of the AAU, the NCAA Division I, the NCAA Board of Governors, the Association of Public and Land-Grant Universities and the Council for Higher Education Accreditation. A past member of the Reimagine NY Commission, he was the inaugural co-chair of the Western New York Regional Economic Development Council.Dr. Tripathi's impressive body of work as a scholar and academic leader and his compelling vision for UB's future made him the UB Council's unanimous recommendation to lead our university.\"Jeremy M. Jacobs Chairman, UB Council and Presidential Search CommitteeProfessional BiographyIn 1978, Tripathi joined the faculty of the Department of Computer Science at the University of Maryland, where his 19-year tenure included serving as chair from 1988-1995. While on sabbatical at the University of Maryland, he held visiting professorships at the University of Paris-Sud in France and the University of Erlangen-Nuremberg in Germany. From 1997-2004, Tripathi served as dean of the Bourns College of Engineering at the University of California-Riverside. There, he nearly quadrupled the number of engineering students and tripled the number of faculty, leading the college’s rise from an unranked program to a position in the upper half of the U.S. News and World Report Best Engineering Graduate Schools rankings.Tripathi joined the University at Buffalo in 2004, serving as UB’s provost and executive vice president for academic affairs. He was one of the principal creators of the UB 2020 long-range academic plan that led the university to achieve significant growth in research and scholarly activity and enhance both the diversity and academic profile of UB’s undergraduate and graduate students. As provost, he led the recruitment of many prominent faculty to the university and oversaw a significant increase in the number of faculty hired to develop and enhance strengths in strategic disciplinary areas. Consequently, the university achieved substantial increases in research expenditures and federally awarded research grants, putting UB in league with the top national research universities in the United States. Tripathi led several efforts to enrich the educational experiences of UB undergraduate students by introducing programs designed to provide them with more opportunities to engage in learning and research with UB’s top faculty. He also oversaw the development of innovative “living-learning environments” constructed as part of “Building UB,” the university’s comprehensive physical plan.Furthermore, Tripathi led a strategic planning process for UB’s international programs that significantly expanded the university’s international presence and the continued globalization of its three Western New York campuses. He signed a memorandum of understanding in 2005 with Indian Prime Minister Manmohan Singh to establish the Indo-U.S. Inter-University Collaborative Initiative in Higher Education and Research, which led to a robust partnership between UB and Amrita University. UB’s educational programs in Singapore, in partnership with the Singapore Institute of Management, also experienced significant growth under Tripathi’s leadership.Building on this solid foundation, Tripathi’s vision as president has focused on moving the university into the highest ranks of the nation’s leading research universities by expanding its reach and impact—locally and globally.VideoAbout UB's 15th PresidentRelated Links 5/1/20 Campus and Community Response 4/18/11 Open Letter to the UB Community 12/19/24 Our Past Presidents 2/9/22 President Tripathi in the News Within his first year as president, the university celebrated a number of major milestones, including the passage of the NYSUNY 2020 legislation that led to historic reforms for UB and the SUNY system of public higher education as a whole. During his presidency, the university has opened six major building projects on its three campuses—including the $375-million building for the Jacobs School of Medicine and Biomedical Sciences. Made possible with a $40 million gift—the largest in university history—this state-of-the-art building serves as the hub of a thriving life sciences community, anchoring UB’s downtown campus. The university also received designation as a New York State Center of Excellence in Materials Informatics, positioning UB at the forefront of the rapidly expanding field of advanced materials.In 2018, Tripathi launched UB’s comprehensive Boldly Buffalo campaign, which has had a transformative impact on the university, allowing UB to make an even more meaningful difference in Western New York and the many communities the university serves. With the campaign having surpassed its original goal within three years, President Tripathi announced, in 2021, that UB was extending the campaign’s goal to $1 billion.Today, Tripathi’s vision focuses on positioning UB among the top 25 public research universities in the nation. This goal will further the university’s mission to achieve greater societal impact by enhancing scholarly productivity and growing UB’s research portfolio; providing students with innovative, research-grounded educational experiences; building upon a university-wide culture of equity and inclusion; and deepening the university’s engagement in the region by strengthening partnerships.In 2022, New York Governor Kathy Hochul designated UB a flagship institution of the State University of New York system. This designation recognizes UB’s reputation as a premier public research university, its leadership in public higher education, and its commitment to bring the benefits of its research, clinical care and education to the region, state, nation and world—all accomplishments that Tripathi advanced, and continues to elevate, as UB experiences a remarkable era of progress and innovation.",
  "content_length": 7397,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:49"
}