{
  "name": "Satoshi Nakamura",
  "homepage": "https://ahcweb01.naist.jp/en",
  "status": "success",
  "content": "Augmented Human Communication Labs. (NAIST) – AHC-LAB Web page Message from Prof. Satoshi Nakamura We NAIST AHC Lab. is conducting research to be published in top-tier international journals and conferences and is also challenging its implementation for practical use. However, we have currently no plan to accept new students for the AY 2023 enrollment. Our lab’s ex-faculty member Prof. Sakriani Sakti moved to JAIST, Japan Advanced Institute of Science and Technology, and started to accept new students. Please take a look at the JAIST website and consider application to her lab. http://www.jaist.ac.jp/english/laboratory/his/sakti.html Hosting IWSDS2024 Prof. Nakamura will serve as the general chair of the international conference IWSDS2024 in this winter. http://sites.google.com/grp.riken.jp/iwsds2024 Automated social skills trainer Introduction movie of âAutomated social skills trainer.â CHRONUS Introduction movie of Chronus, Simultaneous Speech Translation System developped in our lab. Links Twitter Prof. Satoshi Nakamura Assc. Prof. Katsuhito Sudoh Graduate School of Information and Science (NAIST) Website Nara Institute of Science and Technology Graduate School of Information and Science Latest News 2021-02-09Award: 1st place award on MOTS Challenge 2020 2021-02-09Award : 1st place award of BDD100K MOT Challenge at WAD 2020 2020-12-15COLING2020 2020-11-26Award: Oriental COCOSDA 2020 Best Paper Award 2020-11-26Award: Oriental COCOSDA 2020 Best Paper Award Â» Read More Info for Prospect Students Laboratory brochure Download PDF file Prof. Nakamura and Assoc. Prof. Sudoh in the PR brochure of NAIST âãããã (Sentan: May, 2019).â Download PDF file (Japanese) Research Projects ANR-CREST: TAPAS â Training Adapted Personalised Affective Social Skills with Cultural Virtual Agents",
  "content_length": 1820,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:51"
}