{
  "name": "Satoshi Tsujimoto",
  "homepage": "http://www-is.amp.i.kyoto-u.ac.jp/lab/en/tujimoto",
  "status": "success",
  "content": "TSUJIMOTO, Satoshi (English) [Japanese] Professor Satoshi TSUJIMOTO Applied Mathematics and Physics Course Graduate School of Informatics Kyoto University Yoshida-Honmachi, Sakyo-ku, Kyoto 606-8501, Japan e-mail: tsujimoto.satoshi.5s _at_ kyoto-u.jp Office: Room 316, 3F, Research Bldg. No.10 Activity Research Orthogonal Polynomials and Special Functions Discrete Integrable Systems Box-Ball Systems (Soliton Automata) International Conference 13TH International Conference on Symmetries and Integrablity of Difference EquationsSIDE13 Conference HP Preprints Yu Luo and Satoshi Tsujimoto: Exceptional Laurent biorthogonal polynomials through spectral transformations of generalized eigenvalue problems, Studies in Applied Mathematics (2023), pp.1-31, DOI: 10.1111/sapm.12603 [arXiv] Katsuki Kobayashi, Kazuki Maeda and Satoshi Tsujimoto: An isospectral transformation between Hessenberg matrix and Hessenberg–bidiagonal matrix pencil without using subtraction. [arXiv] Hiroshi Miki, Satoshi Tsujimoto and Da Zhao: Quantum walk on extension of association schemes, to appear in Journal of Physics A: Mathematical and Theoretical. [arXiv] Hiroshi Miki, Satoshi Tsujimoto and Luc Vinet: The single-indexed exceptional Krawtchouk polynomials, Journal of Difference Equations and Applications, 29:3 (2023) pp. 344-365, DOI: 10.1080/10236198.2023.2202283, [arXiv] Katsuki Kobayashi and Satoshi Tsujimoto: Generalization of the ε-BBS and the Schensted insertion algorithm. [arXiv] Current Papers Atsushi Maeno and Satoshi Tsujimoto: Linearization of the box-ball system with box capacity L, Journal of the Physical Society of Japan, 92 (2023), 024003 (10 pages). [doi][arXiv] David A. Croydon, Makiko Sasada and Satoshi Tsujimoto: General solutions for KdV- and Toda-type discrete integrable systems based on path encodings, Mathematical Physics, Analysis and Geometry, 25 (2022), 27 (71 pages). [doi][arXiv] Hiroshi Miki, Satoshi Tsujimoto, Luc Vinet: Classical and quantum walks on paths associated with exceptional Krawtchouk polynomials, Journal of Mathematical Physics 63 (October 2022), 103502. [doi][arXiv] Hiroshi Miki, Satoshi Tsujimoto and Luc Vinet: Perfect state transfer in two dimensions and the bivariate dual-Hahn polynomials, Progress of Theoretical and Experimental Physics 2022 (April 2022), 053A01(14pp). [doi][arXiv] David Croydon, Tsuyoshi Kato, Makiko Sasada and Satoshi Tsujimoto: Dynamics of the box-ball system with random initial conditions via Pitman's transformation, Memoirs of the American Mathematical Society 283 (March 2023), 1389 (99pp). [doi][arXiv] Katsuki Kobayashi and Satoshi Tsujimoto: The ultradiscrete Toda lattice computes the Smith normal form of bidiagonal matrices, Journal of Mathematical Physics 62 (September 2021), 092701 (8pp). [doi][arXiv] Xiang-Ke Chang, Shi-Hao Li, Satoshi Tsujimoto and Guo-Fu Yu: Two-parameter generalisations of Cauchy bi-orthogonal polynomials and integrable lattices, Journal of Nonlinear Science 31 (March 2021), 30 (23pp). [doi][arXiv] Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: The rational Heun operator and Wilson biorthogonal functions, The Ramanujan Journal, (May 2021), https://doi.org/10.1007/s11139-020-00383-7 (23pp). [doi][arXiv] Satoshi Tsujimoto, Luc Vinet and Alexei Zhedanov: An algebraic description of the bispectrality of the biorthogonal rational functions of Hahn type, Proceedings of the American Mathematical Society, 149 (November 2020), pp.715-728. [doi][arXiv] Julien Gaboriaud, Satoshi Tsujimoto, Luc Vinet and Alexei Zhedanov: Degenerate Sklyanin algebras, Askey–Wilson polynomials and Heun operators, Journal of Physics A: Mathematical and Theoretical 53 (October 2020), 445204 (19pp). [doi][arXiv] David Croydon, Makiko Sasada and Satoshi Tsujimoto: Dynamics of the ultra-discrete Toda lattice via Pitman’s transformation, RIMS Kokyuroku Bessatsu B78 (2020 April), pp.233-248. [arXiv] Hiroshi Miki, Satoshi Tsujimoto, Luc Vinet: Spin Chains, Graphs and State Revival, In: Foupouagnigni M., Koepf W. (eds) Orthogonal Polynomials. AIMSVSW 2018. Tutorials, Schools, and Workshops in the Mathematical Sciences. Birkhäuser, Cham (March 2020), pp.495-516. [doi][arXiv] Yu Luo, Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Dunkl-Supersymmetric orthogonal functions associated with classical orthogonal polynomials, Journal of Physics A: Mathematical and Theoretical 53 (January 2020), 085205 (16pp). [doi][arXiv] David Croydon, Tsuyoshi Kato, Makiko Sasada, Satoshi Tsujimoto: Dynamics of the box-ball system with random initial conditions via Pitman's transformation, to appear in \"Memoirs of the AMS\". [arXiv] Pascal Baseilhac, Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: The Heun-Askey-Wilson algebra and the Heun operator of Askey-Wilson type, Annales Henri Poincaré 20, pp.3091-3112 (2019). [doi][arXiv] Hiroshi Miki, Satoshi Tsujimoto, Luc Vinet: Quantum walks on graphs of the ordered Hamming scheme and spin networks, to appear in \"SciPost Physics\". [arXiv] Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Double affine Hecke algebra of rank 1 and orthogonal polynomials on the unit circle. [arXiv] Yu Luo, Satoshi Tsujimoto: Exceptional Bannai-Ito polynomials, to appear in \"Journal of Approximation Theory\". [doi][arXiv] Geoffroy Bergeron, Luc Vinet, Satoshi Tsujimoto: Generating functions for the Bannai-Ito polynomials, to appear in \"Proceedings of the American Mathematical Society\". [arXiv] Saburo Kakei, Jonathan J.C. Nimmo, Satoshi Tsujimoto, Ralph Willox: Linearization of the box-ball system: an elementary approach, Journal of Integrable Systems 3, pp.1-32 (2018). [doi] [arXiv] Satoshi Tsujimoto, Luc Vinet, Guo-Fu Yu, Alexei Zhedanov: Symmetric abstract hypergeometric polynomials, Journal of Mathematical Analysis and Applications 458, pp.742-754 (2018). [doi] [arXiv] Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Tridiagonal representations of the q-oscillator algebra and Askey-Wilson polynomials, Journal of Physics A: Mathematical and Theoretical 50, 235292(15pp) (2017). [doi] [arXiv] Vincent X. Genest, Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Persymmetric Jacobi matrices, isospectral deformations and orthogonal polynomials, Journal of Mathematical Analysis and Applications 450, pp.915-928 (2017). [arXiv] Tsuyoshi Kato, Satoshi Tsujimoto, Andrzej Zuk: Spectral analysis of transition operators, Automata groups and translation in BBS, Communications in Mathematical Physics 350, pp.205-229 (2017). [arXiv] Kazuki Maeda, Satoshi Tsujimoto: A generalized eigenvalue algorithm for tridiagonal matrix pencils based on a nonautonomous discrete integrable system, Journal of Computational and Applied Mathematics 300, pp.134-154 (2016) Hendrik De Bie, Vincent X. Genest, Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: The Bannai-Ito algebra and some applications, Journal of Physics: Conference Series 597, conference 1, 12001 (2015) Hiroshi Miki, Satoshi Tsujimoto: A new recurrence formula for generic exceptional orthogonal polynomials, Journal of Mathematical Physics 56, 033502 (2015) Maxim Derevyagin, Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Bannai-Ito polynomials and dressing chains, Proceedings of the American Mathematical Society 142, pp.4191-4206 (2014) Satoshi Tsujimoto, Tsuyoshi Kato, Andrzej Zuk: Automata groups and box-ball systems, RIMS Kôkyûroku Bessatsu B47, pp.163-170 (2014), in Japanese Kazuki Maeda, Satoshi Tsujimoto: Direct connection between the RII chain and the nonautonomous discrete modified KdV lattice, Symmetry, Integrability and Geometry: Methods and Applications 9, 073 (2013) Satoshi Tsujimoto: Construction of the exceptional orthogonal polynomials and its application to the superintegrable system, in: The breadth and depth of nonlinear discrete integrable systems, ed. T. Tokihiro, RIMS Kôkyûroku Bessatsu B41, pp.181-205 (2013) Yi He, Xing-Biao Hu, Hon-Wah Tam, Satoshi Tsujimoto: Convergence acceleration algorithms related to a generalized E-transformation and its particular cases, Japan Journal of Industrial and Applied Mathematics 30, pp.263-285 (2013) Masatoshi Noumi, Satoshi Tsujimoto, Yasuhiko Yamada: Pad\\'e interpolation for elliptic Painlev\\'e equation, in: Symmetries, Integrable Systems and Representations, eds. K. Iohara et al., Springer Proceedings in Mathematics & Statistics 40, pp 463-482 (2013), arXiv:1204.0294v2 [math-ph] Tsuyoshi Kato, Satoshi Tsujimoto: A rough analytic relation on partial differential equations, Journal of Mathematics Research 4, pp 125-139 (2012), arXiv:1004.4981v1 [math.MG] Hiroshi Miki, Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: An algebraic model for the multiple Meixner polynomials of the first kind, Journal of Physics A: Mathematical and Theoretical 45, 325205 (2012) arXiv:1203.0357v1 [math-ph] Hiroshi Miki, Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Quantum state transfer in a two-dimensional regular spin lattice of triangular shape, Physycal Review A 85, 062306 (2012) arXiv:1203.2128v2 [math-ph] Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Dual -1 Hahn polynomials: ``Classical'' polynomials beyond the Leonard duality,Proceedings of the American Mathematical Society 141, pp.959-970 (2013) arXiv:1108.0132v1 [math.CA]. Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Dunkl shift operators and Bannai-Ito polynomials, Advances in Mathematics, Vol.229, pp.2123-2158 (March 2012), arXiv:1106.3512v2 [math.CA] Hiroshi Miki, Hiroaki Goda, Satoshi Tsujimoto: Discrete spectral transformations of skew orthogonal polynomials and associated discrete integrable systems, SIGMA, Vol.8, 008, 14 pages (February 2012), arXiv:1111.7262v2 [math-ph] Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: Jordan algebras and orthogonal polynomials, Journal of Mathematical Physics, Vol.52, 103512, 8 pages (October 2011), arXiv:1108.3531v1 [math.CA] Satoshi Tsujimoto, Luc Vinet, Alexei Zhedanov: From slq(2) to a parabosonic Hopf algebra, SIGMA, Vol.7, 093, 13 pages (October 2011), arXiv:1108.1603v3 [math-ph] Ryu Sasaki, Satoshi Tsujimoto, Alexei Zhedanov: Ex",
  "content_length": 10539,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:53"
}