{
  "name": "Satrajit Ghosh",
  "homepage": "https://satcrypt.github.io",
  "status": "success",
  "content": "Homepage: Satrajit Ghosh [IIT Kharagpur] Welcome to my homepage I am an Assistant Professor at the Department of Computer Science and Engineering, IIT Kharagpur. Before joining IIT Kharagpur I was working as a Post-doctoral Fellow at the Cryptography and Security Group, Aarhus University hosted by Jesper Buus Nielsen. I also obtained my PhD from the Department of Computer Science, Aarhus University under the supervision of Jesper Buus Nielsen and Claudio Orlandi. More information about the vibrant Aarhus Crypto group can be found here. I received my Masters degree from the Computer Science and Engineering Department, IIT Kharagpur under the guidance of Dr. Abhijit Das. Prior to that, I did my B.Tech in Computer Science and Engineering and B.Sc (Honors) in Physics from University Of Calcutta. Before joining Aarhus University, I worked as a researcher at the R. C. Bose Centre of Cryptology and Security, Indian Statistical Institute and in the Graduate School of Computer Science, Saarland University. Research My research interest varies over many aspects of theoretical computer science, with a focus on cryptography and security. Specifically, I am interested in the design and analysis of provably secure \"efficient\" cryptographic primitives. Currently, I am working on different projects related to secure multi-party computation. Publications TERRA: Trojan-Resilient Reverse-Firewall for Cryptographic Applications [ePrint] In ESORICS (2025) -- Chandan Kumar, Nimish Mishra, Suvradip Chakraborty, Satrajit Ghosh, Debdeep Mukhopadhyay. Improved Distributed RSA Key Generation Using the Miller-Rabin Test [ePrint] In ACM CCS (2023) -- Jakob Burkhardt, Ivan Damgård, Tore Frederiksen, Satrajit Ghosh, Claudio Orlandi. Threshold Private Set Intersection with Better Communication Complexity [ePrint] In PKC (2023) -- Satrajit Ghosh, Mark Simkin. Practical non-malleable codes from symmetric-key primitives in 2-split-state model [Link] In ProvSec (2022) -- Anit Kumar Ghosal, Satrajit Ghosh, Dipanwita Roychowdhury. Improved Primitives for MPC over Mixed Arithmetic-Binary Circuits [ePrint] In Crypto (2020) -- Daniel Escudero, Satrajit Ghosh, Marcel Keller, Rahul Rachuri, Peter Scholl. The Communication Complexity of Threshold Private Set Intersection [ePrint] In Crypto (2019) -- Satrajit Ghosh, Mark Simkin. Invited to Journal of Cryptology. An Algebraic Approach to Maliciously Secure Private Set Intersection [ePrint] In Eurocrypt (2019) -- Satrajit Ghosh, Tobias Nilges. Maliciously Secure Oblivious Linear Function Evaluation with Constant Overhead [ePrint] In Asiacrypt (2017) -- Satrajit Ghosh, Jesper Buus Nielsen, Tobias Nilges. TinyOLE: Efficient Actively Secure Two-Party Computation from Oblivious Linear Function Evaluation [ePrint] In ACM CCS (2017) -- Nico Döttling, Satrajit Ghosh, Jesper Buus Nielsen, Tobias Nilges, Roberto Trifiletti. Post-Quantum Forward Secure Onion Routing (Future Anonymity in Today’s Budget) [ePrint] In ACNS (2015) -- Satrajit Ghosh, Aniket Kate. New Variants of Algebraic Attacks Based on Structured Gaussian Elimination [SCC] (Extended Abstract) In SCC (2012) -- Satrajit Ghosh, Abhijit Das. An improvement of linearization-based algebraic attacks [LNCS] In SPACE (2011) -- Satrajit Ghosh, Abhijit Das. Manuscript(s) Improvements of Algebraic Attacks Based on Structured Gaussian Elimination [ePrint] -- Satrajit Ghosh, Abhijit Das. Thesis Secure Computation Based On Oblivious Linear Function Evaluation [pdf] PhD Thesis, Aarhus University, 2019. Improvements of Linearization-Based Algebraic Attacks on Block Ciphers [pdf] Master's Thesis, IIT Kharagpur, 2012. Academic Services Program Committee Member : PKC 2026, ACM AsiaCCS 2026, Indocrypt 2025, ACM CCS 2025, Indocrypt 2024, SCN 2024, CANS 2024, AfricaCrypt 2024, CANS 2023, Indocrypt 2023, AfricaCrypt 2023, CANS 2022. External reviewer : Crypto (2025, 2020, 2019), Eurocrypt (2025, 2024, 2022, 2021, 2020, 2018, 2016), PKC (2022, 2019, 2018, 2016), CHES (2025), ACM CCS (2021, 2019, 2018), Asiacrypt (2021, 2020, 2019, 2018, 2017), TCC (2020, 2018, 2017, 2016-B), CANS (2020), ProvSec (2020, 2014), SAC (2019), Indocrypt (2019, 2016), ACISP 2016, SPACE 2014. Journal reviewer : Designs, Codes and Cryptography (DESI). PhD Evaluation Committee Member: Protik Paul (IISc Bangalore), Nishat S Koti (IISc Bangalore). Students PhD Students: Sandip Pal, Jitendra Kulaste, Chandan Kumar (Joint with Debdeep Mukhopadhyay), Anit Kumar Ghosal (Joint with Dipanwita Roychowdhury) MS Student: Divyam Katiyar Teaching Current Semester (Spring 2025): Theory: Cryptographic Protocol Theory (CS60210). Theory: Foundations of Cryptography (CS60088). Previous: I worked as a Teaching Assistant in the Security, Databases and Concurrency courses at Aarhus University. I worked as a Teaching Assistant in Computational Number Theory (Spring 2011), Algorithm Design and Analysis (Autumn 2010), Computing Laboratory (Autumn 2009) and Programming and Data Structure Laboratory (Spring 2009) courses at IIT Kharagpur. Miscellaneous The world of MPC. Awesome MPC resources. Contact Information Email: 1st name [at] cse [{dot}] iitkgp (dot) ac.in or my last name dot first five letters of first-name in gmail. Address: Office: A-304, CSE, IIT Kharagpur, India. Follow @satrajit_",
  "content_length": 5272,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:50"
}