{
  "name": "Satyajit Thakor",
  "homepage": "http://faculty.iitmandi.ac.in/~satyajit",
  "status": "success",
  "content": "Dr. Satyajit Thakor << IIT Mandi Dr. Satyajit Thakor Designation: Associate Professor School of Computing and Electrical EngineeringIndian Institute of Technology Mandi Mandi, Himachal Pradesh, India-175075 Office: A13-F7, North Campus Office Phone: 01905-267917 E-Mail: satyajit[at]iitmandi[dot]ac[dot]in Google Scholar     LinkedIn Personal Website Research Interests Information Theory Communication Theory Network Coding Algorithms Teaching IC252 Data Science 2 (Spring 2020, Spring 2021, Spring 2022) IC260 Signals and Systems (Autumn 2020, Autumn 2021) Applied AI and ML, PG Certification by IIT Mandi-WileyNXT (co-instructor, Spring 2021, Autumn 2021) Full Stack Development, PG Certification by IIT Mandi-WileyNXT (coordinator and co-instructor, Autumn 2021) EE534 Probability and Random Processes (Autumn 2019) EE530 Optimization Theory (Spring 2019) CS601 Probability and Random Processes (Autumn 2018) CS403 Algorithm Design and Analysis (Spring 2017, Spring 2018) EE503 Advanced Communication Theory (Spring 2014, Spring 2015, Autumn 2017) EE304 Communication Theory (Autumn 2016) EE609 Network Information Theory (Autumn 2015, Autumn 2016) CS208 Mathematical Foundations of Computer Science (Autumn 2014, Autumn 2015) Journal Publications M. I. Qureshi and S. Thakor, \"A Bound on Undirected Unicast Network Information Flow,\" IEEE Transactions on Information Theory (accepted). D. Saleem, S. Thakor, and A. Tiwari, \"Recursive Algorithm to Verify Quasi-Uniform Entropy Vectors and Its Applications,\" IEEE Transactions on Communications, vol. 69, no. 2, pp. 874-883, Feb. 2021. S. Alam, S. Thakor, and S. Abbas, \"Inner Bounds for the Almost Entropic Region and Network Code Construction,\" IEEE Transactions on Communications, vol. 69, no. 1, pp. 19-30, Jan. 2021. M. I. Qureshi and S. Thakor, \"On the Information Capacity of Layered Undirected Unicast Networks,\" IEEE Communications Letters, vol. 24, no. 12, pp. 2715-2718, Dec. 2020. T. Chan, S. Thakor, and A. Grant, \"Minimal Characterisation of Shannon-type Inequalities under Functional Dependence and Full Conditional Independence Structures,\" IEEE Transactions on Information Theory, vol. 65, no. 7, pp. 4041-4051, July 2019. P. Kumar and S. Thakor, \"Performance of 3T-ANC based Orthogonal Frequency Division Multiplexed-Optical Wireless Link With Pointing Error,\" Journal of Optics, pp. 400-411, June 2019. P. Kumar and S. Thakor, \"Performance of OFDM-FSO link with Analog Network Coding,\" Photonic Network Communications, vol. 35, no. 2, pp. 210-224, April 2018. S. Thakor, T. Chan, and A. Grant, \"Capacity Bounds for Networks with Correlated Sources and Characterisation of Distributions by Entropies,\" IEEE Transactions on Information Theory, vol. 63, no. 6, pp. 3540-3553, June 2017. S. Thakor, A. Grant, and T. Chan, \"Cut-set Bounds on Network Information Flow,\" IEEE Transactions on Information Theory, vol. 62, no. 4, pp. 1850-1865, April 2016. X. Xu, S. Thakor, and Y. L. Guan, \"Reduced Functional Dependence Graphs,\" IET Networks. vol. 4, no. 2, pp. 102-110, March 2015. Conference Publications M. I. Qureshi and S. Thakor, \"On the Partition Bound for Undirected Unicast Network Information Capacity,\" in IEEE International Symposium on Information Theory (ISIT), pp. 1623-1628, LA, USA, June 2020. S. Alam, S. Thakor, and S. Abbas, \"An Analysis of a Randomized Local Search Algorithm for the Entropy Space,\" in 4th International Conference on Information Systems and Computer Networks (ISCON), pp. 330-334, Mathura, India, 2019. H. Tiwari and S. Thakor, \"On Characterization of Entropic Vectors at the Boundary of Almost Entropic Cones,\" in IEEE Information Theory Workshop (ITW), pp. 1-5, Gotland, Sweden, August 2019. S. Thakor and M. I. Qureshi, \"Undirected Unicast Network Capacity: A Partition Bound,\" in IEEE International Symposium on Information Theory (ISIT), pp. 196-200, Paris, France, July 2019. S. Alam, S. Thakor, and S. Abbas, \"On Enumerating Distributions for Associated Vectors in the Entropy Space,\" in International Symposium on Information Theory and Its Applications (ISITA), pp. 65-69, Singapore, October 2018. T. Chan, S. Thakor, and A. Grant, \"A Minimal Set of Shannon-type Inequalities for MRF Structures with Functional Dependencies,\" in IEEE International Symposium on Information Theory (ISIT), pp. 1759-1763, Vail, USA, June 2018. S. Thakor, T. Chan, and A. Grant, \"A Minimal Set of Shannon-type Inequalities for Functional Dependence Structures,\" in IEEE International Symposium on Information Theory (ISIT), pp. 679-683, Aachen, Germany, June 2017. S. Thakor, T. Chan, and A. Grant, \"Characterising Probability Distributions via Entropies,\" in International Symposium on Information Theory and Its Applications (ISITA), pp. 723-727, Monterey, USA, October 2016. S. Thakor and S. Abbas, \"Outer Bounds on the Capacity of 2-Layer N-Relay Gaussian Network,\" in International Symposium on Information Theory and Its Applications (ISITA), pp. 453-457, Monterey, USA, October 2016. S. Thakor, T. Chan, and A. Grant, \"Characterising Correlation via Entropy Functions,\" in IEEE Information Theory Workshop (ITW), pp. 1-2, Seville, Spain, September 2013 (invited paper). X. Xu, S. Thakor, and Y. L. Guan, \"On the Mutual Information between Random Variables in Networks,\" in IEEE Information Theory Workshop (ITW), pp. 1-5, Seville, Spain, September 2013. S. Thakor, T. Chan, and K. Shum, \"Symmetry in Distributed Storage Systems,\" in IEEE International Symposium on Information Theory (ISIT), pp. 1244-1246, Istanbul, Turkey, July 2013. X. Xu, S. Thakor, and Y. L. Guan, \"Weighted Functional Dependence Bound for Network Coding Capacity,\" in International Symposium on Information Theory and Its Applications (ISITA), pp. 187-191, Honolulu, HI, USA, October 2012. S. Thakor, A. Grant, and T. Chan, \"Compact Representation of Polymatroid Axioms for Random Variables with Conditional Independencies,\" in IEEE Information Theory Workshop (ITW), pp. 267-271, Lausanne, Switzerland, September 2012. X. Xu, S. Thakor, and Y. L. Guan, \"Reduced Functional Dependence Graphs and Their Applications,\" in the 2012 International Symposium on Network Coding (NETCOD), pp. 61-66, Boston, USA, June 2012. S. Thakor, A. Grant, and T. Chan, \"On Complexity Reduction of the LP bound Computation and Related Problems,\" in the 2011 International Symposium on Network Coding (NETCOD), pp. 1-6, Beijing, China, July 2011. S. Thakor, T. Chan, and A. Grant, \"Bounds for Network Information Flow with Correlated Sources,\" in Australian Communication Theory Workshop (AusCTW), pp. 43-48 Melbourne, Australia, January-February 2011. S. Thakor, A. Grant, and T. Chan, \"Network Coding Capacity: A Functional dependence Bound,\" in IEEE International Symposium on Information Theory (ISIT), pp. 263-267, Seoul, South Korea, June-July 2009. Research Projects Entropy Region, Information Inequalities and their Applications Core research grant Science and Engineering Research Board, Govt. of India, New Delhi Principal Investigator (PI) INR 37 Lakhs 2021-2024 Technology Innovation Hub National mission on interdisciplinary cyber physical system (NM-ICPS) implementation mechanisms Department of Science and Technology, Govt. of India, New Delhi Co-PI INR 110 Crores 2020-2025 Characterization of the Entropy regions for three and four random variables and their application Extramural research scheme Science and Engineering Research Board, Govt. of India, New Delhi PI INR 33 Lakhs 2017-2020 Information inequalities and capacity bound computation AWS cloud credits for research Amazon web services PI USD 3,200 (in AWS cloud credits) 2018-2019 IU-ATC Project Department of Science and Technology, Govt. of India, New Delhi Co-PI INR 81 Lakhs 2012-2015 Computing the LP bound for multi-source network coding Endeavour Research Fellowship Department of Education, Employment and Workplace Relations, Australian Government PI AUD 23,500 2009 Awards, Honours and Selected Talks Teaching Honour Roll Award for excellence in teaching, IIT Mandi, 2021 Senior Member, IEEE, 2020 SERB-DST travel grant under International Travel Scheme, 2016 Michael Miller Medal for Ph.D. thesis, UniSA, 2013 Travel Award from IEEE South Australia Section to represent in IEEE Region 10 Student Congress, Chennai, India, 2008 Seminar: The undirected multiple-unicast network information flow problem, Centre for Networked Intelligence, IISc, 2022 Seminar: On the characterization of entropic vectors at the boundary of almost entropic cones, IIT Mandi, October 2019 Seminar: Undirected unicast network capacity: A partition bound, IIT Mandi, October 2019 Seminar: A minimal set of Shannon-type inequalities for full conditional independence constraints, SCEE Seminar, IIT Mandi, August 2018 Seminar: A minimal set of Shannon-type inequalities for functional dependence structures, SCEE Seminar, IIT Mandi, September 2017 Seminar: Upper bounds on the capacity of 2-layer N-relay symmetric Gaussian network, Australian National University, Canberra, June 2016. (ACT Chapter of the IEEE Signal Processing and Communications Societies Seminar) Seminar: Characterizing probability distributions via entropy functions, Internal workshop on Dynamical systems, Statistics, Networking, and Control, IIT Mandi, April 2016 Seminar: Problems and results in network information flow, Michael Miller Medal Seminar, Institute for Telecommunications Research, UniSA, August 2013 Seminar: Network coding capacity bounds: characterization and computation, Institute of Network Coding, The Chinese University of Hong Kong, July 2011 Seminar: On complexity reduction of the LP bound computation and related problems, Institute for Telecommunications Research, May 2011 Seminar: Bounds on network information flow for correlated sources, Institute for Telecommunications Research, January 2011 Seminar: Network coding capacity bounds, Institute for Telecommunications Research, May 2010 Employment & Education Associate Professor School of Computing and Electrical Engineering",
  "content_length": 10840,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:53"
}