{
  "name": "Satyajayant Misra",
  "homepage": "http://www.cs.nmsu.edu/~misra",
  "status": "success",
  "content": "Satyajayant Misra Home Research Interests Wireless Sensor Ad-Hoc Networks: Node placement for Connectivity/Survivability; Energy Harvesting, Sensors designs and development; Security, Privacy, and Anonymity in Communication. Smart Grid: Secure, Resilient, and Scalable Network and Communication Architecture design. Future Internet: Scalable and Holistic Protocol design for users privacy & security and efficient system utilization. Social Networks: Anonymity in Social Graph Structures, Security from Sybil Attacks, Use of Social Networks for improving Human Communication. High Performance Computing: Expanding on one-sided communication primitives and scaling them for exascale High Performance Computing. . Education Ph.D. in Computer Science (08/2003 - 08/2009)Advisor:Professor Guoliang XueDepartment of Computer Science and EngineeringArizona State University (ASU), Tempe, AZ M.Sc. in Information Systems and Physics (08/98 - 07/03)Birla Institute of Technology and Sciences (BITS)Rajasthan, India NEWS !! 7/1/2022: Started as the Associate Dean for Research, College of Engineering 7/1/2022: Started as the Professor in Electrical and Computer Engineering and Nakayama Professor of Engineering 7/12/2013: Krishna Cherukuri, my fifth student to graduate, successfully defended his M. S. thesis titled, \"Survey of Attacks and Security Measures in Delay Tolerant Networks.\" Congratulations to Cherukuri! 11/2/2012: Jharrod LaFon, my fourth student to graduate, successfully defended his M. S. thesis titled, \"Distributed Tree Walk on Parallel Filesystems.\" Congratulations to Jharrod! 11/1/2011: Reza Tourani, my third student to graduate, successfully defended his M. S. thesis titled, \"FaSt: Framework for Secure Content Delivery with High Availability and Efficiency in Content-Centric Networks.\" Congratulations to Reza! 11/1/2011: Kabi Bhattarai, my second student to graduate, successfully defended his M. S. thesis titled, \"Security and Privacy Algorithms for Wireless and Social Networks.\" Congratulations to Kabi! 08/15/2011: I was awarded the NMSU Early Career award for Scholarly Activity 2011. 08/14/2011: I was invited to serve as a feature editor for \"IEEE Wireless Communication\" Magazine. 11/05/2010: Sowmya Myneni, my first student to graduate, successfully defended her M. S. thesis titled, \"SARP: Secure And Resilient Protocol design for Wireless Sensor and Ad Hoc Networks.\" Congratulations to Sowmya! 08/16/2010: I started serving on the Editorial Board of the journal, \"IEEE Communications on Surveys and Tutorials.\"",
  "content_length": 2545,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:52"
}