{
  "name": "Saugata Ghose",
  "homepage": "https://ghose.web.illinois.edu",
  "status": "success",
  "content": "Saugata Ghose Saugata Ghose Assistant Professor Siebel School of Computing and Data Science University of Illinois Urbana-Champaign @ UIUC CDS About Me I am an assistant professor in the Siebel School of Computing and Data Science at the University of Illinois Urbana-Champaign, working broadly in the area of computer architecture. I hold affiliate appointments in the Coordinated Science Laboratory and in the Department of Electrical and Computer Engineering at Illinois. I lead the ARCANA Research Group (), where we explore several aspects of designing data-centric computer architectures and systems. I am particularly interested in processing-in-memory, introducing interactions between different levels of the compute stack that allow the levels to cooperate with each other, and architectures for emerging platforms and application domains. Prior to joining Illinois, I was a postdoc and then a systems scientist in the Department of Electrical and Computer Engineering at CMU, working in the SAFARI Research Group. Before moving to CMU, I was a graduate student in the M3 Architecture Group, which is part of the Computer Systems Laboratory at Cornell University. At Cornell, I designed efficient, high-performance memory systems for multicore architectures. Research Interests Data-centric computing / processing-in-memory Memory and storage systems New interfaces between compute stack layers Architectures for emerging platforms/domains Office 4120 Siebel Center for Computer Science Spring 2025: Tu 3:15 PM - 3:45 PM, Th 2:15 PM - 3 PM 201 N. Goodwin Ave., MC-258, Urbana IL 61801 (217) 333-1893 Selected Publications View All > ISCA 2025: ANVIL: An In-Storage Accelerator for Name–Value Data Stores EuroSys 2025: CRAVE: Analyzing Cross-Resource Interaction to Improve Energy Efficiency in Systems-on-Chip HPCA 2024: MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing ISCA 2022: SeGraM: A Universal Hardware Accelerator for Genomic Sequence-to-Graph and Sequence-to-Sequence Mapping JETCAS 2022: Adapting the RACER Architecture to Integrate Improved In-ReRAM Logic Primitives ICDE 2022: Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design MICRO 2021: RACER: Bit-Pipelined Processing Using Resistive Memory PACT 2021: Google Neural Network Models for Edge Devices: Analyzing and Mitigating Machine Learning Inference Bottlenecks ASPLOS 2021: SIMDRAM: An End-to-End Framework for Bit-Serial SIMD Computing in DRAM HPCA 2021: BlockHammer: Preventing RowHammer at Low Cost by Blacklisting Rapidly-Accessed DRAM Rows ISCA 2020: The Virtual Block Interface: A Flexible Alternative to the Conventional Virtual Memory Framework IBM JRD 2019: Processing-in-Memory: A Workload-Driven Perspective SIGMETRICS 2019: Demystifying Complex Workload–DRAM Interactions: An Experimental Study ISCA 2019: CoNDA: Efficient Cache Coherence Support for Near-Data Accelerators SIGMETRICS 2018: What Your DRAM Power Models Are Not Telling You: Lessons from a Detailed Experimental Study ISCA 2018: FLIN: Enabling Fairness and Enhancing Performance in Modern NVMe Solid State Drives ASPLOS 2018: Google Workloads for Consumer Devices: Mitigating Data Movement Bottlenecks Proceedings of the IEEE 2017: Error Characterization, Mitigation, and Recovery in Flash Memory Based Solid-State Drives View All Publications > Recent Teaching CS 433: Computer System Organization Fall 2024, Spring 2024, Fall 2023 CS 534 ME: Architectures for Mobile and Edge Computing Spring 2025, Spring 2024, Spring 2023, Spring 2022 (as CS 598 SG), Spring 2021 (as CS 498 ME) CS 233 Honors: Computer Architecture Fall 2024, Fall 2022, Fall 2021 Education Ph.D., Computer Engineering Cornell University, August 2014 M.S., Computer Engineering Cornell University, January 2014 B.S., Computer Engineering B.S., Computer Science State University of New York at Binghamton (Binghamton University), May 2007 Select Awards & Honors HPCA Hall of Fame, 2024 Intel Rising Star Faculty Award, 2023 CMU Wimmer Faculty Fellow, 2019 Cornell ECE Director's Ph.D. Teaching Assistant Award, 2013 NDSEG Fellowship, 2008-2011 Cornell University Fellowship, 2007 Binghamton Foundation Award for Student Excellence, 2007 University Award for Student Excellence, 2007 Kunis Scholarship for Computing Excellence, 2003-2007",
  "content_length": 4455,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:54"
}