{
  "name": "Saurabh Sinha",
  "homepage": "https://sites.google.com/view/sinhalaboratorygatech",
  "status": "success",
  "content": "Sinha Laboratory @ GaTechSearch this siteEmbedded FilesSkip to main contentSkip to navigationAbout UsWelcome to the laboratory of Saurabh Sinha at Georgia Tech.Our research belongs to the inter-disciplinary field of Bioinformatics, which provides the computational infrastructure for modern molecular biology as it rapidly transforms into a quantitative science. We are interested in understanding gene regulation, which refers to how genes in a cell are switched on or off to determine the cell’s functions. It is central to an extraordinary range of biological phenomena from development to disease, as well as the evolution of diverse life forms. We develop innovative computational methods, based on machine learning, probabilistic inference and biophysics-inspired models, to answer unsolved and topical questions related to gene regulation in diverse biological processes. These days we are especially interested in analysis of single-cell multi-omics and spatial omics data. We collaborate extensively with experimental biologists for confirmation of predictions made by our models. Principal Investigator: Saurabh Sinha.We are looking for new graduate students and post-docs to join the lab at Georgia Tech. Please send me an email if you are interested. saurabh.sinha@bme.gatech.eduGoogle Scholar pageFEATURED RESEARCH: Spatial Transcriptomics: subcellular colocalization of genesAnurendra Kumar, Alex W Schrader, Bhavay Aggarwal, Ali Ebrahimpour Boroojeny, Marisa Asadian, JuYeon Lee, You Jin Song, Sihai Dave Zhao, Hee-Sun Han, Saurabh Sinha. Intracellular spatial transcriptomic analysis toolkit (InSTAnT). Nature Communiucations 2024. [Free full text] Comparative Spatial Transcriptomics + Machine LearningYeojin Kim, Abhishek Ojha, Alex Schrader, Juyeon Lee, Zijun Wu, Ian M Traniello, Gene E Robinson, Hee Sun Han, Sihai D Zhao, Saurabh Sinha. SpaceExpress: a method for comparative spatial transcriptomics based on intrinsic coordinate systems of tissues. [biorxiv preprint] Causal Inference + Machine Learning + Gene NetworksP. Dibaeinia, S. Sinha. CIMLA: Interpretable AI for inference of differential causal networks. arXiv:2304.12523 [Free full text] (Published in Science Advances '25.)Machine Learning + Optimization + Protein DesignS. Ghaffari, E. Saleh, A. G. Schwing, Y. Wang, M. D. Burke, S. Sinha (2024). Robust Model-Based Optimization for Challenging Fitness Landscapes. ICLR '24. [Arxiv preprint] (Published in Proceedings of ICLR '24.)Spatial Transcriptomics: subcellular gene modulesBhavay Aggarwal, Saurabh Sinha. CellSP: Module discovery and visualization for subcellular spatial transcriptomics data. [biorxiv Preprint] Bayesian deconvolution of RNA-seq data S Ghaffari, K J Bouchonville, E Saleh, R E Schmidt, S M Offer, S Sinha (2023). BEDwARS: a robust Bayesian approach to bulk gene expression deconvolution with noisy reference signatures. Genome Biology 24(1). [Free full text]Multi-omics integration identifies regulators of colorectal cancer invasiveness S. Ghaffari, C. Hanson, R.E. Schmidt, K.J. Bouchonville, S.M. Offer, S. Sinha (2021). An integrated multi-omics approach to identify regulatory mechanisms in cancer metastatic processes. Genome Biology 22(19). [Free full text]Perspective on Gene Regulatory Networks in BehaviorS. Sinha, B.M. Jones, I.M. Traniello, ... G.E. Robinson (2020). Behavior-related gene regulatory networks: A new level of organization in the brain. PNAS , 201921625. [Free full text]A Cloud-based knowledge engine for genomicsC. Blatti, A. Emad, M.J. Berry, ... C.B. Bushell,   S. Sinha (2020). Knowledge-guided analysis of ‘omics’ data using the KnowEnG cloud platform. PLoS Biology 18(1): e3000583. [Free full text]Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3740,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:55"
}