{
  "name": "Sayak Ray Chowdhury",
  "homepage": "https://sites.google.com/view/sayakraychowdhury/home",
  "status": "success",
  "content": "Sayak Ray ChowdhurySearch this siteEmbedded FilesSkip to main contentSkip to navigationSAYAK RAY CHOWDHURYAffiliation: Assistant Professor, Department of CSE, IIT Kanpur, IndiaEmail: sayakrc [at] iitk [dot] ac [dot] inResearch Interests: Sequential Decision Making: Multi-armed Bandits, Reinforcement LearningPrivacy, Safety, Fairness: Differential Privacy, Algorithmic FairnessLanguage Model Optimization: Alignment Algorithms, In-context LearningAbout me:  I am an Assistant Professor at the Department of Computer Science and Engineering, Indian Institute of Technology Kanpur. Previously, I was a Postdoctoral Researcher at Microsoft Research with Dr. Nagarajan Natarajan. Before that, I was a Postdoctoral fellow at the Department of Systems Engineering, Boston University. I completed my PhD in the ECE Department of the Indian Institute of Science, Bangalore, where I was advised by Prof. Aditya Gopalan. I have also spent time working as a research intern at Google. I did my master's at the Indian Institute of Science, Bangalore, and my bachelor's at Jadavpur University. Here is my CV (last updated September 2025).IITK Students interested in working with me: I am currently looking for students with interests in:Sequential Decision Making under UncertaintyAlgorithmic FairnessPlease review my Publications to gain an understanding of my current research.  If you are interested, feel free to send an email for further details. Students looking for short-term projects (less than 3 months): Unfortunately, I don't have any open positions at this time. Please refrain from sending any emails regarding this matter.Updates (recent):  November 2025: Paper on fairness and privacy in sequential learning accepted at AAAI, 2026. Led by amazing undergrad students Dhruv Sarkar (IITKgp) and Nishant Pandey (IITK).September 2025: I have been selected as a Young Associate of the Indian National Academy of Engineering.June 2025: I am visiting the Department of CSA at the Indian Institute of Science (IISc), Bangalore.May 2025: I have received a gift fund from Adobe Research to conduct research on LLM alignment.May 2025: Paper on LLM alignment under preference drift accepted at ICML, 2025.May 2025: Paper on sample-efficient LLM alignment accepted at ECML-PKDD, 2025.April 2025: I have received an ANRF early-career research grant. As part of this project, I am seeking one PhD student and one MS student to collaborate with me on privacy-preserving AI algorithms.March 2025: Invited talk on LLM alignment at REACH Symposium, IIT Kanpur.December 2024: Invited lecture series on Differential Privacy at Theory CS Winter School 2024, IISc Bangalore. September 2024: Joined the Department of CSE, IIT Kanpur, as an Assistant Professor.Representative Publications (see full list here):  Right Now, Wrong Then: Non-Stationary Direct Preference Optimization under Preference Drift. S. Son, W. Bankes, S.R. Chowdhury, B. Paige, I. Bogunovic. International Conference on Machine Learning (ICML), 2025. Link  Communication Efficient, Secure, and Private Multi-Party Deep Learning. Sankha Das, Sayak Ray Chowdhury, Nishanth Chandran, Divya Gupta, Rahul Sharma, Satya Lokam. Proceedings on Privacy Enhancing Technologies Symposium (PETS), 2025. Link Provably Robust DPO: Aligning Language Models with Noisy Feedback. Sayak Ray Chowdhury, Anush Kini, Nagarajan Natarajan. International Conference on Machine Learning (ICML), 2024. LinkDifferentially Private Federated Linear Contextual Bandits. Xingyu Zhou, Sayak Ray Chowdhury. International Conference on Learning Representations (ICLR), 2024. LinkDifferentially Private Reward Estimation with Preference Feedback. Sayak Ray Chowdhury, Xingyu Zhou, Nagarajan Natarajan. International Conference on Artificial Intelligence and Statistics (AISTATS), 2024. Link  Bregman Deviations of Generic Exponential Families. Sayak Ray Chowdhury, Patrick Saux, Odalric-Ambrym Maillard, Aditya Gopalan. 36th Annual Conference on Learning Theory (COLT), 2023. Link Distributed Differential Privacy in Multi-armed Bandits. Sayak Ray Chowdhury, Xingyu Zhou. International Conference on Learning Representations (ICLR), 2023. Link Shuffle Private Linear Contextual Bandits. Sayak Ray Chowdhury, Xingyu Zhou. International Conference on Machine Learning (ICML), 2022. Link Bayesian Optimization under Heavy-tailed Payoffs. Sayak Ray Chowdhury, Aditya Gopalan. Neural Information Processing Systems (NeurIPS), 2019. Link Online Learning in Kernelized Markov Decision Processes. Sayak Ray Chowdhury, Aditya Gopalan. International Conference on Artificial Intelligence and Statistics (AISTATS), 2019. LinkOn Kernelized Multi-armed Bandits. Sayak Ray Chowdhury, Aditya Gopalan. International Conference on Machine Learning (ICML), 2017. LinkGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4837,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:56"
}