{
  "name": "Sayandeep Saha",
  "homepage": "https://sites.google.com/view/sayandeepsaha/home",
  "status": "success",
  "content": "Sayandeep SahaSearch this siteEmbedded FilesSkip to main contentSkip to navigationSayandeep SahaAssistant ProfessorDepartment of Computer Science and EngineeringIndian Institute of Technology, BombayOffice: CC-215, Department of Computer Science and Engineering, Indian Institute of Technology Bombay, IndiaEmail: sayandeepsaha@cse.iitb.ac.in, sayandeep.iitkgp@gmail.comPh (Office): 7134Research Group: SHarCUpdated addendum on \"Systematic Evaluation of Randomized Cache Designs against Cache Occupancy\" USENIX Security 2025, and Anubhav Bhatla, Hari Rohit Bhavsar, Sayandeep Saha, and Biswabandan Panda, “So, You Think You Know All About Secure Randomized Caches?” USENIX Security 2025\"Check our research group: SHarC** We are hiring: We are currently looking for Project Research Assistants for SISHAM project. The goal of the project is to make a RISC-V-based ISA secure against microarchitectural and physical side channel attacks. Selected candidates will be able to apply for the PhD position at IIT Bombay, funded through this project, provided they satisfy the eligibility criteria for applying at IITB. Please drop me an email if you are interested or even curious. ** I am looking for students in microarchitectural attacks, side-channel, or fault attacks, and Post-Quantum Cryptography. Please drop me an email if you are interested. For details on this topic, please take a look here. Alternatively, you can also browse through the accepted paper lists in the top conferences and journals: TCHES, USENIX Security, IEEE S&P, NDSS, ACM-CCS, EUROCRYPT, ASIACRYPT, CRYPTO, ToSC, DATE, DAC, ICCAD, HOST, HPCA, ISCA, MICRO, IEEE TIFS, IEEE TC, IEEE TCAD, IEEE TDSC.I am an Assistant Professor in the Department of Computer Science and Engineering, Indian Institute of Technology Bombay. Before joining IIT Bombay, I spent two wonderful years of postdoctoral research at NTU Singapore (Jan 2022 - Jan 2023; with Professor Thomas Peyrin) and UCLouvain Belgium (Feb 2023 - March 2024; with Professor François-Xavier Standaert). I completed my PhD from the  Department of Computer Science and Engineering, Indian Institute of Technology Kharagpur (Jul 2016 - Sep 2021) under the supervision of Professor Debdeep Mukhopadhyay and Professor Pallab Dasgupta. My primary area of research is Hardware Security and Cryptography. In my Ph.D. and postdoctoral research, I have worked on Fault Attacks for Symmetric-key cryptosystems and Post-Quantum public-key cryptosystems. I also work on Side-Channel attacks and other aspects of Hardware Security, such as microarchitectural attacks, Logic Locking, etc.  Besides my research, I spend most of my leisure time reading books and travelling. News5th July 2025: Another hit by SHArC: \"Everything Depends on Your Hammer: A Systematic Rowhammer Attack Exploration on SPHINCS+\" has been accepted at ICCAD 2025. Kudos to Shoaib, Mrityunjay, and Khushang.29th May 2025: Our paper \"SoK: So, You Think You Know All About Secure Randomized Caches?\" has been accepted at USENIX Security 2025. This is the second paper at USENIX this year.26th Jan 2025: Our paper, \"Fault Template Attacks on Block Ciphers Exploiting Fault Propagation\" from EUROCRYPT 2020 has been crowned as \"Top Picks in Hardware and Embedded Security 2024\". Top Picks recognizes the best of the best in hardware security. 25th Jan 2025: Our paper \"Systematic Evaluation of Randomized Cache Designs against Occupancy Attack\" has been accepted at USENIX Security 2025.19th December 2024: The website for \"Implementation Security in Cryptography\" is up!! The course will be offered in slot 6 in the coming semester. The timings are 11:05 -- 12:30 am (Wed and Fri). Interested students, please register!!! The course is open to CSE and EE students.27th July 2024: I am co-teaching the Digital Logic and Computer Architecture Theory + Lab course. Please refer to this page for resources on the digital logic module.15th July 2024: Delighted to share that I am a member of CHES PC this year!!! Please consider submitting15th June 2024: Our paper entitled \"Prime Masking vs. Faults - Exponential Security Amplification against Selected Classes of Attacks.\" got accepted at CHES 2024. This is the second paper that got accepted to CHES this year!!! The links are here: paper1, paper2.15th May 2024: Finished Reviewing for USENIX Security 2024. I was a PC member this year.10th April 2024: Joined the Department of Computer Science and Engineering at IIT Bombay. Feeling excited!!Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4547,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:57"
}