{
  "name": "Sayan Sarcar",
  "homepage": "https://sayansarcar.github.io/index.html",
  "status": "success",
  "content": "ur Sayan Sarcar Sayan Sarcar Sayan.Sarcar@bcu.ac.uk Millenium Point, Birmingham, B4 7XG, UK About Research Publication Courses Services Sayan Sarcar is a Lecturer in the Faculty of Computing, Engineering and the Built Environment at the Birmingham City University, UK. His research interests are in human–computer interaction, aging and accessibility and user interface optimization. Prior to joining BCU, he worked as an Assistant Professor in the Faculty of Library, Information and Media Science at the University of Tsukuba, Japan and a Research Associate in the School of Information at Kochi University of Technology, Japan, where he was a member of Center for Human-Engaged Computing directed by Prof. Xiangshi Ren. Before that, he obtained PhD degree from IIT Kharagpur, master and bachelor degrees from West Bengal University of Technology, India. His research sits at the intersection of Human-Computer Interaction (HCI) and Accessibility. In particular, his research emphasizes on improving human individual abilities through developing intelligent systems using design and modelling practices, specifically focused on individual differences in users’ sensorimotor abilities toward technology adoption. CV /  Google Scholar /  Linkedin /  Github /  Twitter Join our group We are always looking for talented, hard-working, and self-motivated students to join our group. A range of graduate and undergraduate projects are available. The candidate must have strong skills in computer programming, interaction design, and/or qualitative and quantitative research methods. Current Birmingham City University students can contact directly over email to express their interest in working with us. Visit group webpage for further details. News Two co-authored full papers got accepted at CHI 2020 conference, one is on a novel method to leverage eye gaze modality to boost voice-based text correction efficiency and the other is on a novel replacement-based text revision technique for mobile devices. Deatils will be updated soon. Three Special Interest Group meeting proposals and One Workshop proposal also got accepted at CHI 2020 conference Serving as the Publicity co-chair and Program Committee member of ASSETS 2020 conference. Serving as a Paper Co-Chair of India HCI 2020 conference. Our paper on Adaptive Feature Guidance: Modelling Visual Search with Graphical Layouts just got accepted at International Journal of Human Computer Studies. Details (here) Joined in the Program Committee of CHI 2020 conference. Joined in the Program Committee of ISS 2019 conference. Paper on On Gesture Combination: An Exploration of a Solution to Augment Gesture Interaction accepted to ACM ISS 2019 as a Full Paper. The paper can be downloaded from here",
  "content_length": 2753,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:56"
}