{
  "name": "Scharam Dustdar",
  "homepage": "https://dsg.tuwien.ac.at/team/sd",
  "status": "success",
  "content": "Univ. Prof. Dr. Schahram Dustdar Full ProfessorHead of the Distributed Systems Group IEEE Fellow, Asia-Pacific Artificial Intelligence Association (AAIA) FellowACM Distinguished Scientist, ACM Distinguished SpeakerMember of the Academia Europaea dustdar @ dsg.tuwien.ac.at +43 1 58801 18414 Follow @twitter last edited: June 24, 2025 My current research agenda: As humans, things, software and AI continue to become the entangled fabric of distributed systems, systems engineers and researchers are facing novel challenges. In my current research agenda, I investigate all aspects related to Edge-Computing, Fog-Computing, Cloud Computing, and Human-based Computing as well as AI in the co-evolution of distributed systems for the new decade. My research revolves around all challenges that these new distributed systems have to address. Interested in doing your PhD? Research topics at the DSG Short CV: Schahram Dustdar is Full Professor of Computer Science heading the Research Division of Distributed Systems at the TU Wien, Austria. He holds several honorary positions: Francqui Chair Professor at University of Namur, Belgium (2021-2022), University of California (USC) Los Angeles; Monash University in Melbourne, Shanghai University, Macquarie University in Sydney, University Pompeu Fabra, Barcelona, Spain. From Dec 2016 until Jan 2017 he was a Visiting Professor at the University of Sevilla, Spain and from January until June 2017 he was a Visiting Professor at UC Berkeley, USA. From 1999 - 2007 he worked as the co-founder and chief scientist of Caramba Labs Software AG in Vienna (acquired by Engineering NetWorld AG), a venture capital co-funded software company focused on software for collaborative processes in teams. Caramba Labs was nominated for several (international and national) awards: World Technology Award in the category of Software (2001); Top-Startup companies in Austria (Cap Gemini Ernst & Young) (2002); MERCUR Innovation award of the Austrian Chamber of Commerce (2002). He was founding co-Editor-in-Chief of ACM Transactions on Internet of Things (ACM TIoT) as well as Editor-in-Chief of Computing (Springer). He is an Associate Editor of IEEE Transactions on Services Computing, IEEE Transactions on Cloud Computing, ACM Computing Surveys, ACM Transactions on the Web, and ACM Transactions on Internet Technology, as well as on the editorial board of IEEE Transactions on Big Data, IEEE Internet Computing, IEEE Computer and of many more. Dustdar is recipient of multiple awards: TCI Distinguished Service Award (2021), IEEE TCSVC Outstanding Leadership Award (2018), IEEE TCSC Award for Excellence in Scalable Computing (2019), ACM Distinguished Scientist (2009), ACM Distinguished Speaker (2021), IBM Faculty Award (2012). He is an elected member of the Academia Europaea: The Academy of Europe, where he is chairman of the Informatics Section, as well as an IEEE Fellow (2016), an Asia-Pacific Artificial Intelligence Association (AAIA) President (2021-2023) and Fellow (2021). He is an EAI Fellow (2021) and an I2CICC Fellow (2021). He is a Member of the 2022 IEEE Computer Society Fellow Evaluating Committee (2022) and Chair of the Advisory Board of the National Edge AI Hub (led by Newcastle University, UK). He has been a frequently invited expert evaluator for the IST 6th Framework (FP6), EU Horizon 2020 of the European Commission, an invited expert for the 7th Framework roadmap definitions for several working groups, as well as a Technical Expert for the roadmap definition for the European Commission’s research on the Future Internet. He has been a scientific reviewer for the European Research Council (ERC) as well as a number of National Science Foundations e.g., DFG (Germany), NWO (Netherlands), SNF (Switzerland), EPSRC (UK), SFI (Ireland), Czech Science Foundation (GA CR), NSERC (Canada), FWO (Research Foundation Flanders, Belgium), FCT (Foundation for Science and Technology, Portugal), Panel on Computer Science and Information Technologies, R&D Units, FCT (Portugal), Einstein Foundation Berlin (Germany). On behalf of the National Commission for Scientific and Technological Development (CONICYT) and the Superior Council of the National Fund for Scientific & Technological Development (FONDECYT), Chile, Academy of Finland, Israel Science Foundation, EPSRC Peer Review College, New Zealand Ministry of Business, Innovation & Employment (MBIE), Cyprus Agency for Quality Assurance and Accreditation in Higher Education, L’Oréal-UNESCO For Women in Science Awards 2021 (Physical sciences, Mathematics and Computer science), Estonian Research Council (ETAg), review panel member of the Research Council of Finland. About: Schahram Dustdar Publications Activities Keynotes & Invited Talks Projects Honors & Awards Teaching Students back to staff Profiles: Google Scholar Profile Research Gate Profile Microsoft Academic Page profile ACM Author Profile DBLP Publications Web of Science ORCID iD Scopus SciProfile Top 2% Scientist Sciprofiles Scholarships:",
  "content_length": 5024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:24:59"
}