{
  "name": "Scott Rixner",
  "homepage": "https://www.cs.rice.edu/~rixner",
  "status": "success",
  "content": "Scott RixnerBiographyScott Rixner is a Professor of Computer Science at Rice University. His research spans virtualization, operating systems, and computer architecture, with a specific focus on memory systems and networking. He concentrates on the intersection of hardware and software, working to develop system software that better exploits modern hardware and to develop hardware that simplifies system software. He is also well versed in the internals of the Python programming language, as he has developed Python interpreters for both embedded systems and web browsers. His work has led to 11 patents and has been implemented within several open source systems.He has also been actively involved in curriculum development and oversight at Rice, having served on the curriculum committees for the University (member), School of Engineering (chair), and Department of Computer Science (chair). He is currently leading the MCS@Rice and MDS@Rice online degree programs. Prior to joining Rice, he received his Ph.D. from MIT.ResearchComputer ArchitectureOperating SystemsMemory SystemsCS EducationVirtualizationNetworkingEducation Academic PhD in Electrical Engineering, 2001Massachusetts Institute of Technology Academic MEng in Computer Science and Electrical Engineering, 1995Massachusetts Institute of Technology Academic BS in Computer Science, 1995Massachusetts Institute of TechnologyHow a Master’s Degree in Computer Science Can Affect Job Prospects, US News & World ReportOnline Master of Computer Science, Rice University Computer Science Unconventional Computing Podcast (iTunes, Google Play)Rice Eliminates the Red Tape to Encourage Research on Teaching, The Chronicle of Higher EducationHouston Public Radio InterviewCampus Conversations with the PresidentThe Anatomy of a MOOCMDS@RiceOnline Master of Data Science Degree Program - Aug 2021I am the faculty director of the MDS@Rice program, helping to launch the second fully online degree program in the School of Engineering and Computing at Rice University.MCS@RiceOnline Master of Computer Science Degree Program - Aug 2019I am the faculty director of the MCS@Rice program, helping to launch the first fully online degree program in the School of Engineering and Computing at Rice University.In 2025, the MCS@Rice program earned a top 10 spot in the US News & World Report rankings for online computer science programs. Mail rixner[at]rice.edu Phone 1-713-348-6353 Address Duncan Hall 3032 Department of Computer Science Rice University Houston, TX 77005 Calendar Email to book an appointment",
  "content_length": 2561,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:04"
}