{
  "name": "Scott E. Hudson",
  "homepage": "http://www.cs.cmu.edu/~hudson",
  "status": "success",
  "content": "Scott Hudson | Home Scott Hudson is a Professor in the Human-Computer Interaction Institute within the School of Computer Science at Carnegie Mellon University, where he served for many years as the founding director of the HCII PhD program. He was previously an Associate Professor in the College of Computing at the Georgia Institute of Technology and prior to that an Assistant Professor of Computer Science at the University of Arizona. He earned his Ph.D. in Computer Science at the University of Colorado in 1986. Scott received the ACM SIGCHI Lifetime Research Award in 2021. He was elected to the CHI Academy in 2006, and has published extensively on technology-oriented HCI topics. He has received the Allen Newell Award for Research Excellence at CMU, as well as the ACM SIGCHI Lifetime Service Award. He has regularly served on program committees for the SIGCHI and UIST conferences, He served as papers co-chair for the SIGCHI 2009 and 2010 conferences, Program Chair for the UIST '90 and UIST '00 conferences, as well as Symposium Chair for UIST '93, and the founding UIST Doctoral Symposium chair from 2003 to 2005. He currently serves as the Steering Committee chair for the UIST conference, and also served as a founding Associate Editor for ACM Transactions on Computer Human Interaction. He has received research funding from the National Science Foundation, DARPA, Google, Microsoft, HP, Disney, Intel, GM, and IBM. Research Scott's research interests over time have covered a wide range of topics within Human-Computer Interaction, but have a center of gravity in technical aspects of HCI. They have generally included the invention and building of things which lead to a better user experience, or enabling of new capabilities for new sets of people (although often indirectly through tools). Scott's Curriculum Vitae (Which will inevitably be out of date...) Scott's Google Scholar Page Scott's Papers in the ACM Digital Library Much of Scott's recent work has focused on computational fabrication, including topics such as: the creation of unique new types of 3D printers, the use of knitting and weaving machines as fabrication devices, tools for computational design and the use of advanced fabrication for assistive devices. His older work has explored areas such as: handling inputs with uncertainty, interactive devices, sensing, and physical interaction, managing human attention, situationally appropriate interaction, and tools and toolkits for user interface implementation. Most of Scott's papers are available on-line via the ACM Digital Library. Teaching Teaching is intertwined with almost everything Scott does. He has two major teaching activities: supervising (and co-supervising) a number of PhD students, and teaching HCI courses at the undergraduate, masters, and PhD levels. Until a few years ago he was also the director of the HCI Institute PhD program. PhD Students In addition to an impressive set of current students, Scott has a long history of graduating successful PhD students. These include, for example 14 who have gone on to be professors at schools such as: CMU, University of Washington (in the CSE and HCDE departments), University of British Columbia, UCLA, Yale, Arizona State, Seoul National University, and NYU; to be department heads (in CS, and Medical Informatics) and an endowed chair; as well as industrial research standouts who have been the originators of work such as Google News and Google Project Tango. Classroom Teaching Scott regularly teaches: 05-3/833 \"Applied Gadgets Sensors and Activity Recognition in HCI\" 05-4/835 \"Applied Fabrication Techniques for HCI\" HCII PhD Program Until a few years ago Scott directed the HCII PhD program, having led the committee which created it, ushered in the first class in 2000, and served as its director for many years. This program was the first PhD program in the United States devoted exclusively to HCI. It's central goal is to train world class interdisciplinary HCI researchers capable of transforming our field, and we take great pride in our students, both past and present. The program admits research-oriented students from a wide variety of backgrounds. However, admissions are very competitive. If you are interested in our program, please see the materials regarding applications on the HCII web site. Contact Information The best way to contact Scott is by email at scott.hudson (at) cs.cmu.edu. Last updated 8/20",
  "content_length": 4443,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:00"
}