{
  "name": "Scott A. Kuhl",
  "homepage": "https://www.mtu.edu/cs/department/faculty-staff/faculty/kuhl",
  "status": "success",
  "content": "Scott A. Kuhl | Computer Science | Michigan Tech Skip to page content Skip to footer navigation Computer Science Michigan Tech Computing Computer Science Faculty Directory Scott A. Kuhl Also in this section Scott A. Kuhl Contact Scott A. Kuhl kuhl@mtu.edu 906-487-2798 Rekhi Hall 210 Download CV LinkedIn Associate Professor, Computer Science Affiliated Associate Professor, Psychology and Human Factors Faculty Advisor, Husky Game Development Enterprise PhD, Computer Science, University of Utah BS, Computer Science, Augsburg University BA, Mathematics, Augsburg University Biography Scott Kuhl is an associate professor of computer science at Michigan Technological University. He received his PhD in computer science from the University of Utah in 2009. His research interests include computer graphics, immersive virtual environments, head-mounted displays, and how humans understand and interact with 3D space. He is affiliated with the Human-Centered Computing group in the Institute of Computing and Cybersystems. Dr. Kuhl is the faculty advisor of Husky Game Development (HGD) Enterprise where students develop computer, console and smartphone games for business, education and fun. Games are regularly released on the HGD website. He has also helped organize the BonzAI Brawlprogramming contest. Links of Interest Faculty Webpage Husky Game Development Enterprise ICC - Institute of Computing and Cybersystems Area of Expertise Computer Graphics Virtual Environments Head-mounted displays Human Perception Recent Publications Soheil Sepahyar, Scott Kuhl. VR Distance Judgments are Affected by the Amount of Pre-Experiment Blind Walking. ACM Symposium on Applied Perception. September 2022. Accepted. Dylan Gaines and Scott Kuhl. Methods for evaluating depth perception in a large-screen immersive display. In Proc. ACM Symposium on Spatial User Interaction, pages 1–4, October 2020. Fan Ding, Soheil Sepahyar, and Scott Kuhl. Effects of brightness on distance judgments in head mounted displays. In ACM Symposium on Applied Perception 2020, pages 1–5, 2020. Bochao Li, James Walker, and Scott A. Kuhl. The effects of peripheral vision and light stimulation on distance judgments through HMDs. ACM Trans. Appl. Percept., 15(2):12:1–12:14, April 2018. Aleksandr Sergeyev, Nasser Alaraje and Scott Kuhl. Researching for Effective Teaching Methodologies in Industrial Robotics. International Journal of Information and Education Technology. Presented at the 9th International Conference on Education, E-Business, E-Management, and E-Learning (IC4E 2018). James Walker, Bochao Li, Keith Vertanen, and Scott Kuhl. Efficient typing on a visually occluded physical keyboard. In Proc. 2017 ACM CHI Conference on Human Factors in Computing Systems, CHI ’17, pages 5457–5461, New York, NY, USA, 2017. Read More Bochao Li, Anthony Nordman, James Walker, and Scott A. Kuhl. The effects of artificially reduced field of view and peripheral frame stimulation on distance judgments in HMDs. In Proceedings of the ACM Symposium on Applied Perception, SAP ’16, pages 53–56, New York, NY, USA, 2016. Read More Bochao Li, Ruimin Zhang, Anthony Nordman, Scott Kuhl. The effects of minification and display field of view on distance judgments in real and HMD-based environments. Proc. ACM Symposium on Applied Perception 2015, pages 55--58. Read More Aleksandr Sergeyev, Nasser Alaraje, Scott Kuhl, Michael Meyer, Mark Kinney, Mark Highum. ``A University, Community College, and Industry Partnership: Revamping Robotics Education to Meet 21st Century Workforce Needs and Technology Programs,'' The Technology Interface International Journal (TIIJ). 16(1), pp. 59-69. Fall/Winter 2015. Read More Bochao Li, Ruimin Zhang, Scott Kuhl. \"Minification Affects Action-Based Distance Judgments in Oculus Rift HMDs,\" In Proc. ACM Symposium on Applied Perception, pages 91--94, New York, NY, USA, 2014. Read More Jun Ma, James Walker, Chaoli Wang, Scott Kuhl, and C-K Shene. \"FlowTour: An Automatic Guide for Exploring Internal Flow Features,\" IEEE Pacific Visualization Symposium (PacificVis). pp. 25--32. March 2014. Read More Scott A. Kuhl, Robert Pastel, Ryan George, Chad M. Meyers, Matthew L. Freitag, Jacob M. Lund and Michael Paul Stefaniak. \"Teaching interdisciplinary teamwork through hands-on game development,\" ASEE Annual Conference. 2014 Read More Ruimin Zhang, Bochao Li, Scott Kuhl. \"Human Sensitivity to Dynamic Translational Gains in Head-Mounted Displays,\" ACM Symposium on Spatial User Interaction 2014. In press. Myounghoon Jeon, Michael Smith, James Walker, and Scott Kuhl. \"Constructing the Immersive Interactive Sonification Platform (iISoP),\" Distributed, Ambient and Pervasive Interactions (DAPI), Lecture Notes in Computer Science (LNCS). 8530, pp 337-3-48. Springer International Publishing. 2014. Read More Ruimin Zhang and Scott A. Kuhl, \"Human Sensitivity to Dynamic Rotation Gains in Head-Mounted Displays.\" In Proc. ACM Symposium on Applied Perception. pp 71--74. 2013 Read More Ruimin Zhang, Anthony Nordman, James Walker, Scott A. Kuhl, \"Minification affects verbal and action-based distance judgments differently in head-mounted displays. ACM Transactions on Applied Perception.\" Presented at the 2012 ACM Symposium on Applied Perception. Read More Frank Steinicke, Gerd Bruder, Scott Kuhl, \"Realistic Perspective Projections for Virtual Objects and Environments.\" ACM Transactions on Graphics. 30(5), 112:1--112:10, October 2011. Presented at SIGGRAPH 2012. Read More Frank Steinicke, Gerd Bruder, Markus Lappe, Scott Kuhl, Pete Willemsen, Klaus H. Hinrichs, \"Natural perspective projections for Head-Mounted Displays. IEEE Transactions on Visualization and Computer Graphics (TVCG).\" 17(7), pp. 888-899. July 2011 Read More Frank Steinicke, Gerd Bruder, Klaus H. Hinrichs, Scott Kuhl, Markus Lappe, and Pete Willemsen, \"Judgment of natural perspective projections in head-mounted display environments\". In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST), pp. 35–42. Kyoto, Japan. September 2009. Award: Best full paper. Read More Scott A. Kuhl, William B. Thompson, Sarah H. Creem-Regehr, \"HMD calibration and its effects on distance judgments\". ACM Transactions on Applied Perception, 6(3). pp. 19:1--19:20. August 2009. Read More Scott A. Kuhl, Sarah H. Creem-Regehr, and William B. Thompson, \"Recalibration of Rotational Locomotion in Immersive Virtual Environments\". ACM Transactions on Applied Perception, 5(3). pp. 17:1--17:11. August 2008. Read More Scott A. Kuhl, William B. Thompson, and Sarah H. Creem-Regehr, \"HMD calibration and its effects on distance judgments\". Proc. Fifth ACM SIGGRAPH Symposium on Applied Perception in Graphics and Visualization (APGV), pp. 15--22. August 2008. Read More Scott A. Kuhl, William B. Thompson, and Sarah H. Creem-Regehr, \"Minification influences spatial judgments in virtual environments\". Proc. Third ACM SIGGRAPH Symposium on Applied Perception in Graphics and Visualization (APGV), pp. 15--19. July 2006. Read More Recent Funding Keith Vertanen (PI), Scott Kuhl (Co-PI), \"CHS: Small: Rich Surface Interaction for Augmented Environments,\" National Science Foundation. Aleksandr Sergeyev (PI), Mark Highum (Co-PI), Mark Kinney (Co-PI), Scott Kuhl (Co-PI), Abdulnasser Alaraje (Co-PI), \"University, Community College and Industry Partnership: Revamping Robotics Education to Meet 21st Century Workforce Needs,\" National Science Foundation (Division Of Undergraduate Education) \"MRI: Development of Infrastructure for Research in Multi-View Video, Graphics, Visualization and Immersive Virtual Environment Systems,'' National Science Foundation (Division of Computer and Network Systems) \"PLC education through simulation and games,\" Subcontractor to Bay College of Escanaba as a part of Department of Labor Trade Adjustment Assistance Community College and Career Training Grants Program. ©",
  "content_length": 7890,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:00"
}