{
  "name": "Scott Sanner",
  "homepage": "https://d3m.mie.utoronto.ca/members/ssanner",
  "status": "success",
  "content": "Professor Scott Sanner, PhD | Data-Driven Decision Making LabData-Driven Decision Making Lab Skip to content Address: University of Toronto Department of Mechanical and Industrial Engineering 5 King’s College Rd Toronto, Ontario, Canada  M5S 3G8 Office: Bahen Centre for Information Technology, Room BA8104 Email: ssanner@mie.utoronto.ca Phone: (416) 978-4871 Scott Sanner is a Professor in Industrial Engineering, Cross-appointed in Computer Science, and a faculty affiliate of the Vector Institute. Previously Scott was an Assistant Professor at Oregon State University and before that he was a Principal Researcher at National ICT Australia (NICTA) and Adjunct Faculty at the Australian National University. Scott earned a PhD in Computer Science from the University of Toronto (2008), an MS in Computer Science from Stanford University (2002), and a double BS in Computer Science and Electrical and Computer Engineering from Carnegie Mellon University (1999). Scott’s research spans a broad range of topics from the data-driven fields of Machine Learning and Information Retrieval to the decision-driven fields of Artificial Intelligence and Operations Research. Scott has applied the analytic and algorithmic tools from these fields to diverse application areas such as conversational recommender systems, adaptive user interfaces, and Smart Cities applications including predictive health analytics, transport optimization, power systems security, and residential HVAC control. Scott has served as Program Co-chair for the 26th International Conference on Automated Planning and Scheduling (ICAPS) and is currently an Associate Editor for ACM Transactions on Recommender Systems (TORS), Journal of Artificial Intelligence Research (JAIR), and Machine Learning Journal (MLJ). Scott was a co-recipient of paper awards from the AI Journal (2014), Transport Research Board (2016), and CPAIOR (2018). He was a recipient of a Google Faculty Research Award in 2020 and a Visiting Researcher at Google while on sabbatical during 2022-23.",
  "content_length": 2035,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:06"
}