{
  "name": "Scott A. Brandt",
  "homepage": "http://www.cs.ucsc.edu/~sbrandt",
  "status": "success",
  "content": "Computer Science and Engineering – Baskin School of Engineering Skip to content ucsc.edu BE News Students Current Undergraduate Students Prospective Undergraduate Students Undergraduate Student Newsletter Current Graduate Students Prospective Graduate Students Graduate Student Newsletter Student Organizations Student Employment Staff & Faculty Home » Departments » Computer Science and Engineering The Computer Science and Engineering (CSE) department spans multiple areas of research including theory, systems, AI/ML, architectures, and software. CSE’s areas of research are computer hardware, including architecture, VLSI (chip design), FPGAs, and design automation; computer security and privacy; cyber-physical systems; distributed systems; database systems; machine learning and artificial intelligence; natural language processing; networks; pervasive computing and human-computer interaction; programming languages; robotics; social computing; storage systems; and visual computing, including computer vision, visualization, and graphics. In cooperation with other departments on campus, CSE also offers a strong research group in bioinformatics, computational biology, biomolecular engineering, and human genome mapping. The CSE department enjoys a close relationship with the Electrical and Computer Engineering, Applied Mathematics, and Statistics departments. Faculty members carry out joint research projects, supervise students, and teach courses for these departments. The M.S. degree requires either a master’s thesis or an approved project and is usually completed in two years, although it is possible to complete the program in one year. The Ph.D. degree is usually completed in five years. Research Learn about the research being conducted within our department. People Meet people in Computer Science and Engineering. Degrees Learn about the Graduate and Undergraduate programs in Computer Science and Engineering. #40top computer science institutions worldwide (Computer Science Rankings, 2024)#8best computer engineering bachelor's degree schools in the far Western US region (College Factual, 2025)#26best school for computer engineering graduate degrees (College Factual, 2025) WiFi signals can measure heart rate—no wearables needed Low-cost WiFi devices can measure heart rate with clinical-level accuracy—without the need for a wearable device. Read more CSE research news Students develop AI solutions for wildfire mitigation at Reboot the Earth hackathon Student hackers tackled California’s wildfire crisis at the event co-hosted by the United Nations and the Baskin School of Engineering Scheduling smarter: Combining technology and policy for more pleasant, equitable commuting As housing costs push workers farther from their jobs, UCSC researchers are developing smart scheduling technology to ease commutes and reduce traffic in Santa Cruz. By combining real-time data, public policy, and community input, the project aims to create a more equitable and sustainable public transportation system. AI leaders gather in Silicon Valley for UC Santa Cruz, SF Tech Week event More than 200 people gathered for an event called “AI Frontier: Data, Agents & Robots.” More CSE news » We’re hiring! Open positions include: lecturer, teaching professor, research professor. Find out more. Upcoming events When Less is More: Applications of Type-Based Underapproximate Reasoning December 3, 2025 Engineering 2 GradWiC Womxn’s Lunch December 4, 2025 E2 Lanai Littschwager, N. (CSE) – A Proposal for Characterizing Replicated Systems and Emulators December 5, 2025 View all events… Explore potential Computer Science and Engineering career paths Software Engineer/Developer Hardware Engineer/Developer Network Engineer Web Developer Mobile App Developer AI/ML Engineer UX Designer Systems Architect Cybersecurity Engineer Learn more Computer engineering faculty and students are researching and developing secure, efficient, and effective networking applications that support the internets of the future.The Natural Language Processing (NLP) master's degree program provides students the in-depth NLP skills and experience needed for successful careers in this fast-growing field. Ready to take the next step? Apply now Book a tour Baskin School of Engineering1156 High StreetSanta Cruz, CA 95064 Contact Us Careers Make a Gift Online Store",
  "content_length": 4362,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:01"
}