{
  "name": "Scott C. Schmidler",
  "homepage": "http://www2.stat.duke.edu/~scs",
  "status": "success",
  "content": "Scott Schmidler Home Page Scott C. Schmidler Associate Professor of Statistical Science and Computer Science Computational Biology & Bioinformatics Structural Biology & Biophysics Duke Center for Systems Biology Duke University Contact Brief Bio Research Monte Carlo & Dynamical Simulation Shape Analysis Structural Biol & Biophysics Other Publications All Markov chain convergence Gibbs fields Shape analysis Protein folding Structure Alignment Molecular simulation Students & Postdocs Teaching Seminars Statistics CompBio Algorithms Probability Biophysics Systems Biology Genome Note: this page is badly out of date. For an automatically-curated list of recent publications please see here Recent Highlights: New Course: Analysis of Object-Oriented Data (Spring 2013) Protein Structure Evolution Model for Alignment and Phylogeny  (Dec '11) Dramatically improves results for distantly related sequences. with Chris Challis. Convergence Diagnostics for Molecular Simulations  (Oct '11) Monitoring convergence properly in the presence of long time-scale kinetic traps. with Kevin Wiehe. Designing an HIV Vaccine - CS Newsletter (June '11) Geometric Convergence for Lennard-Jones Potentials  (April '11) The first result we're aware of for realistic potentials, albeit for a very simple system. with Mattingly, Cooke, McKinley. Convergence Rate Bounds for Adaptive MCMC Algorithms The first non-asmyptotic bounds I'm aware of; shows that some popular methods cannot improve convergence. with Dawn Woodard. α-Stable Limit Laws for Harmonic Mean Estimators of Marginal Likelihood The nail in the coffin for HME methods (we hope!). with Robert Wolpert. ≪more≫ Estimating Parameters of Ising and Potts Models Compares computational methods for Bayesian estimation, applied to protein threading. with Xiang Zhou. Reservoir Methods in Molecular Dynamics Shows theoretical problems with reservoir REMD, and gives corrections. with Kevin Wiehe. Probabilistic Multiple Protein Structure Alignment with Rui Wang. Upcoming Talks and Seminars: Jul 26-31, 2015 - ISI World Statistics Conference, Rio de Janeiro, Brazil Jan 12-16, 2015 - IPAM Workshop on Multiple Sequence Alignment, UCLA Jun 30-Jul 4, 2014 - Telluride Workshop on Enhanced Sampling Methods for Biomolecular Simulation, Telluride, CO Apr 22-25, 2014 - Newton Institute Workshop on Monte Carlo Inference for Complex Statistical Models, Cambridge, UK Apr 6-11, 2014 - MCQMC, Lueven, Belgium Apr 2-5, 2014 - RECOMB 2014, Pittsburgh, PA Mar 2-7, 2014 - BIRS Workshop on Advances in Scalable Bayesian Computation, Banff, Canada Aug 25-30, 2013 - ISI World Statistics Congress, Hong Kong, China Aug 3-9, 2013 - Joint Statistical Meetings, Montreal, Canada Jun 6-8, 2013 - Bayesian Inference in Stochastic Processes (BISP 8), Milan, Italy Jan 6-10, 2013 - Intl Conf Bayesian Theory and Applications, Varanasi, India Jul 28-Aug 2, 2012 - Joint Statistical Meetings, San Diego, CA Jun 25-29, 2012 - ISBA World Meeting, Kyoto, Japan Jun 11-15, 2012 - Telluride Workshop on Enhanced Sampling Methods for Biomolecular Simulation. Telluride, CO. Apr 16-19, 2012 - Workshop on Intractability in Statistical Inference, University of Bristol Feb 12-17, 2012 - Monte Carlo/Quasi Monte Carlo conference, Sydney, Australia Feb 4-10, 2012 - Algebraic Biology at Cass workshop, Cass Field Station, New Zealand Jan 29-Feb 3, 2012 - South 2012 Phylogenetics Meeting, Kaikoura, New Zealand Nov 28, 2011 - Harvard University, Statistics Dept Seminar Nov 16, 2011 - University of Warwick, Molecular Org & Systems Biology seminar Nov 8, 2011 - Oxford University Nov 4, 2011 - University of Warwick, Algorithms and Computational Inference Seminar Nov 3, 2011 - University of Warwick, Dept of Statistics Seminar Oct 21, 2011 - University of Bristol, Dept of Mathematics, Statistics Seminar Oct 14, 2011 - University of Leeds, Statistics Dept Seminar July 17-19, 2011 - First Wu Xi Intl Statistics Forum, Wu Xi, China July 4-8, 2011 - Telluride Workshop on Free Energy Simulations. Telluride, CO Feb 10, 2011 - Information Theory and its Applications Workshop, San Diego, CA Feb 3, 2011 - Duke/UNC Probability Seminar Jan 2-7, 2011 - AdapskIII: Third Workshop on Adaptive Monte Carlo Methods. Park City, Utah. Nov 12, 2010 - Florida State University, Statistics Dept Colloqium Nov 2, 2010 - University of Pittsburgh, Dept of Computational and Systems Biology Seminar June 2010 - Telluride Workshop on Enhanced Sampling Methods for Biomolecular Simulation. Telluride, CO. Mar 31, 2010 - Statistical and Stochastic Issues in Modeling Dynamical Systems. Duke Systems Biology Seminar. Mar 22, 2010 - Duke CS Dept, Algorithms Seminar Feb 26, 2010 - Markov chains, networks, and molecules. SAMSI Education and Outreach Program, Two-Day Undergraduate Workshop. Jan 25, 2010 - Bounding Convergence Rates for Adaptive Markov Chains. Duke Probability Group. Current Professional Activities: Co-organizer, BIRS Workshop on Advances in Scalable Bayesian Computation, March 2-7, 2014 Co-organizer, SAMSI Workshop on Molecular Motors, Neuron Models, and Epidemics on Networks, April 15-17, 2010 SAMSI Program on Stochastic Dynamics, 2009-10 Associate Editor, Annals of Applied Statistics. December 2009-present Program Coordinator, Master's program in Statistical Science. Office: 223D Old Chem Bldg Mail: Box 90251 Duke University Durham, NC 27708 USA Email: schmidler@stat.duke.edu Phone: (919) 684-8064 Fax: (919) 684-8594 Directions to Duke Statistics",
  "content_length": 5463,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:01"
}