{
  "name": "Scott Niekum",
  "homepage": "https://people.cs.umass.edu/~sniekum",
  "status": "success",
  "content": "Scott Niekum Scott Niekum The University of Massachusetts Amherst   //   College of Information and Computer Sciences Home Publications Teaching Lab CV I am an Associate Professor and the director of the Safe, Confident, and Aligned Learning + Robotics Lab (SCALAR) in the College of Information and Computer Sciences at The University of Massachusetts Amherst. I am also a core member of the interdepartmental UMass robotics group, as well as an Amazon Scholar at Amazon Robotics. The goal of my research is to ensure that AI systems are well-aligned with human objectives and can be deployed safely in the real world. Toward this goal, we develop efficient learning algorithms that enforce safety constraints, provide performance guarantees, and infer and align human and agent objectives. We work in a wide range of problem settings, from large language models to robotics, drawing from imitation learning, reinforcement learning, AI safety, and human factors. I am a recipient of the NSF CAREER Award, the AFOSR Young Investigator Award, and the UT Austin CNS Teaching Excellence Award. Representative Publications H. Sikchi, S. Agarwal, P. Jajoo, S. Parajuli, C. Chuck, M. Rudolph, P. Stone, A. Zhang, S. Niekum. RL Zero: Zero-Shot Language to Behaviors Without Any Supervision. Neural Information Processing Systems (NeurIPS), December 2025. [Website and Code] H. Sikchi, Q. Zheng, A. Zhang, S. Niekum. Dual RL: Unification and New Methods for Reinforcement and Imitation Learning. International Conference on Learning Representations (ICLR), May 2024. [f-DVL Code] [ReCOIL Code] D.S. Brown, R. Coleman, R. Srinivasan, and S. Niekum. Safe Imitation Learning via Fast Bayesian Reward Inference from Preferences. International Conference on Machine Learning (ICML), July 2020. [Project Page and Code] D.S. Brown, W. Goo, and S. Niekum. Better-than-Demonstrator Imitation Learning via Automatically-Ranked Demonstrations. Conference on Robot Learning (CoRL), October 2019. [Project Page and Code] M. Alshiekh, R. Bloem, R. Ehlers, B. Könighofer, S. Niekum, and U. Topcu. Safe Reinforcement Learning via Shielding. AAAI Conference on Artificial Intelligence, February 2018. J. Hanna, Y. Chandak, P.S. Thomas, M. White, P. Stone, S. Niekum. Data-Efficient Policy Evaluation Through Behavior Policy Search. Journal of Machine Learning Research (JMLR), October 2024. Associate Professor UMass Amherst CICS Email: [javascript protected email address] Copyright © Scott Niekum",
  "content_length": 2473,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:02"
}