{
  "name": "Scott D. Stoller",
  "homepage": "http://www3.cs.stonybrook.edu/~stoller",
  "status": "success",
  "content": "Scott Stoller's Home Page Scott Stoller's Home Page Research Interests My primary research areas are cybersecurity, cyber-physical systems, distributed systems, and programming languages. Within cybersecurity, one of my specialties is Security Policy Mining. I co-lead the Reliable Systems Lab (New Computer Science, Room 234). C.V. / Résumé Publications Software Editorial Board Memberships Foundations and Trends in Programming Languages Frontiers in Big Data, Associate Editor for Cybersecurity & Privacy International Journal on Software Tools for Technology Transfer Research Event Organization 25th ACM Symposium on Access Control Models and Technologies (SACMAT 2025), General Chair Consensus Algorithms from Classical To Blockchain: Quickly Program, Configure, Run, and Check. With Yanhong A. Liu. Tutorial at 44th IEEE International Conference on Distributed Computing Systems (ICDCS 2024), Jersey City, NJ, July 23, 2024. High-Level Executable Specification and Reasoning for Improving Distributed Algorithms, Tutorial at PLDI 2023 and PODC 2023 at ACM FCRC 2023, with Y. Annie Liu 25th ACM Symposium on Access Control Models and Technologies (SACMAT 2020), Program Co-Chair NSF Workshop on Future Directions for Parallel and Distributed Computing (SPX 2019), Co-Chair Older Research Event Organization Program Committees 41st Annual Computer Security Applications Conference (ACSAC 2025), Arfifact Competition 39th Annual IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSec 2025) 38th Annual IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSec 2024) 29th ACM Symposium on Access Control Models and Technologies (SACMAT 2024) 22nd Workshop on Privacy in the Electronic Society (WPES 2023) 37th Annual IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSec 2023) 28th ACM Symposium on Access Control Models and Technologies (SACMAT 2023) 21st Workshop on Privacy in the Electronic Society (WPES 2022) 36th Annual IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSec 2022) 27th ACM Symposium on Access Control Models and Technologies (SACMAT 2022) 17th International Conference on Information Systems Security (ICISS 2021) 35th Annual IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSec 2021) 26th ACM Symposium on Access Control Models and Technologies (SACMAT 2021) 2021 USENIX Annual Technical Conference (USENIX ATC'20), Extended Review Program Committee 16th International Conference on Information Systems Security (ICISS 2020) 34th Annual IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSec 2020) 2020 USENIX Annual Technical Conference (USENIX ATC'20) 19th International Conference on Runtime Verification (RV 2019) 15th International Conference on Information Systems Security (ICISS 2019) 24th ACM Symposium on Access Control Models and Technologies (SACMAT 2019) 33rd Annual IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSec 2019) Older Program Committees Courses Taught Fall2025 CSE 416 (Section 2): Software Engineering Spring2025 CSE 416 (Sections 2 and 4): Software Engineering Spring2025 CSE 659: Computer Security Seminar (co-taught) Fall2024 CSE 659: Computer Security Seminar (co-taught) Spring2023 CSE 416 (Section 3): Software Engineering Spring2023 CSE 659: Computer Security Seminar (co-taught) Fall2022 CSE 416 (Section 2): Software Engineering Fall2022 CSE 659: Computer Security Seminar (co-taught) Fall2021 CSE 535: Distributed Systems Fall2021 CSE 643: Cyber-Physical Systems and Verification Seminar (co-taught) Fall2021 CSE 659: Computer Security Seminar (co-taught) Older Courses Humor To understand recursion, one must first understand recursion. - Unknown In theory, there's no difference between theory and practice. In practice, there is. - Yogi Berra Contact Info Scott D. Stoller myLastName@cs.stonybrook.edu 357 Department of Computer Science GnuPG Public Key Stony Brook University 631-632-1627 Stony Brook, NY 11794-2424",
  "content_length": 4097,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:00"
}