{
  "name": "Scott R. Klemmer",
  "homepage": "http://d.ucsd.edu/srk",
  "status": "success",
  "content": "Scott Klemmer > events 20 Oct 19 New Orleans, LA UIST Doc Symposium 20 Jun 19 Stanford, CA UIST PC Meeting 4 May 19 San Diego, CA Rally for Science 22 Apr 19 Madison, WI U Wisconsin Design 5 Feb 19 UCSD ACM Ed Board 23 Oct 18 Evanston, IL Northwestern: Segal Design The Design LabThink. Observe. Make.Design at Large SeminarResearch that’s real-world, at scale, & often disruptive.Design Mining the WebThe Webzeitgeist Search engine finds pages based on design attributes.Dynamic Procedure AidsRapidRead’s step-at-a-glance checklist design speeds crisis response & coordination.Global Peer LearningTry our massive open peer learning platforms & learn about the approach.Graduate Student FoundersMy graduate students have founded Instagram, Pulse, Apropose, & more…The Power of ExamplesWe build tools that harvest & synthesize examples, empowering more people to design inters.Ix Design SpecializationJoin tens of thousands of online learners: earn a certificate in Interaction Design.Prototyping DynamicsWeb-scale experiments investigate creativity, prototyping, & collaboration.Valet CrowdsourcingOnline assistants squash your email overload. The valet key: privacy & accountability. show & tell @DesignAtLarge 4/22: The pandemic has left my inbox overfull. My apologies if I haven't responded to your email.Construction on the Design & Innovation Building starts July 1! More info in this front-page Union-tribune articleDoes Kombucha affect your microbiome? KPBS hears how Austin of SD Fermenters' Club wants to find out, and w/Vineet on the Gut Instinct platform. And join/run your own citizen science experiment!#IxDOnline students & other curious folk: Catch me on zoom Friday 2/15/19 9-10am PST. ask away… TedXSan Diego Postcards from the FutureDesigning technology has always been magic, but now is a special time, as the internet allows for large-scale public participation and nearly instantaneous feedback - what I call Design at Large. faq learn design contact/meet recommendations UCSD students PHD committees prospectives hire/collaborate teaching resources our software CV office hours Tu/Th 2-3P DIB364",
  "content_length": 2118,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:04"
}