{
  "name": "Sebastian Michel 0001",
  "homepage": "https://dbis.informatik.uni-kl.de/index.php/en/people/michel",
  "status": "success",
  "content": "Prof. Dr.-Ing. Sebastian Michel | DBIS Lab Email: sebastian.michel@cs.rptu.de Phone: +49 631 205 5628 Room: 36/330 Postal address: RPTU Kaiserslautern-Landau Department of Computer Science AG DBIS P.O. Box 3049 67653 Kaiserslautern, Germany As of August 2014 I am Chair of the Databases and Information Systems Group (DBIS) at RPTU Kaiserslautern-Landau (TU Kaiserslautern) Below you find a brief overview of my academic career and research. If you are a student at RPTU and in the phase of looking for possible Bachelor’s or Master’s thesis topics, please do not hesitate to contacting me directly. Academic Career Since August 2014, Full Professor (W3) at RPTU (TU Kaiserslautern) 05/2010-07/2014: Senior Researcher at Max-Planck Institute Informatics, Saarbrücken. 08/2009-07/2014: Independent Research Group Leader (W2) at Saarland University (MMCI) 08/2007-07/2009: Postdoc at LSIR lab at EPF Lausanne (EPFL) 03/2004-07/2007: PhD student at DBIS group (D5) at Max-Planck Institute Informatics / Saarland University, Saarbrücken Academic Administration Services Since 01/2023: Vice Dean (Prodekan) of the CS department Since 01/2017: Member of the CS department council (Fachbereichsrat) 01/2017-12/2022: Head of examination board of the CS Bachelor’s study program and member of the Master’s examination board Recent Reviewing Activities PC member of SIGMOD 2026, VLDB 2026, SIGMOD 2025, VLDB 2025, BTW 2025, ICDE 2024, ACM SoCC 2023, EDBT 2023 Reviewer for VLDBJ, IEEE TKDE, ACM TOIS, ACM TOIT, IEEE TPDS Reviewer for European Union (FP7), German Research Foundation (DFG), and Swiss National Science Foundation (SNSF), German Academic Exchange Service (DAAD) Publications See also My Google Scholar Profile | My DBLP Entry Automated Training of Learned Database Components with Generative AI. Angjela Davitkova, and Sebastian Michel. Workshop on Novel Optimizations for Visionary AI Systems (NOVAS). 2025. To Publisher The Case for Intent-Based Query Rewriting. Gianna Lisa Nicolai, Patrick Hansert, and Sebastian Michel. 2nd International Workshop on Data-driven AI (DATAI). 2025. To PublisherCode Generating Federated REST API Servers. Patrick Hansert, Bozhou Bai, Ngoc Anh Le, and Sebastian Michel. BTW. 2025. To Publisher Grid-AR: A Grid--based Booster for Learned Cardinality Estimation and Range Joins. Damjan Gjurovski, Angjela Davitkova, and Sebastian Michel. Eighth International Workshop on Exploiting Artificial Intelligence Techniques for Data Management (aiDM). 2025. Code Partiton, Don’t Sort! Compression Boosters for Cloud Data Ingestion Pipelines. Patrick Hansert and Sebastian Michel. VLDB. 2024. To PublisherCode Learning over Sets for Databases. Angjela Davitkova, Damjan Gjurovski, and Sebastian Michel. EDBT. 2024. To PublisherCode To UDFs and Beyond: Demonstration of a Fully Decomposed Data Processor for General Data Wrangling Tasks. Nico Schäfer, Damjan Gjurovski, Angjela Davitkova, and Sebastian Michel. Proc. VLDB Endow.. 2023. To PublisherCode Schema-based Column Reordering for Dremel-encoded Data. Patrick Hansert and Sebastian Michel. Big Data in Emergent Distributed Environments (BiDEDE 2023), co-located with ACM SIGMOD. 2023. To PublisherPresentation Tuple Bubbles: Learned Tuple Representation for Tunable Approximate Query Processing. Damjan Gjurovski and Sebastian Michel. Sixth International Workshop on Exploiting Artificial Intelligence Techniques for Data Management (aiDM), co-located with ACM SIGMOD. 2023. To PublisherPresentation BETZE: Benchmarking Data Exploration Tools with (Almost) Zero Effort. Nico Schäfer and Sebastian Michel. ICDE. 2022. To Publisher LMKG: Learned Models for Cardinality Estimation in Knowledge Graphs. Angjela Davitkova, Damjan Gjurovski, and Sebastian Michel. EDBT. 2022. To PublisherMore Details Ameliorating data compression and query performance through cracked Parquet. Patrick Hansert, and Sebastian Michel. BiDEDE@SIGMOD. 2022. To Publisher Summarizing Edge-Device Data via Core Items. Damjan Gjurovski, Jan Heidemann, and Sebastian Michel. ADBIS. 2022. To Publisher Compressing (Multidimensional) Learned Bloom Filters. Angjela Davitkova, Damjan Gjurovski, and Sebastian Michel. DBAI@NeurIPS. 2021. To Publisher Optimizing Multiple Multi-Way Stream Joins. Manuel Dossinger, and Sebastian Michel. CoRR. 2021. To Publisher Utilizing Delta Trees for Efficient, Iterative Exploration and Transformation of Semi-Structured Contents. Nico Schäfer, and Sebastian Michel. ICDE. 2021. To Publisher Optimizing Multiple Multi-Way Stream Joins. Manuel Dossinger, and Sebastian Michel. ICDE. 2021. To Publisher Natural Joins for Schema-free Data. Damjan Gjurovski, and Sebastian Michel. IEEE BigData. 2021. To Publisher JODA: A Vertically Scalable, Lightweight JSON Processor for Big Data Transformations. Nico Schäfer, and Sebastian Michel. ICDE. 2020. To Publisher Scaling Out Schema-free Stream Joins. Damjan Gjurovski, and Sebastian Michel. ICDE. 2020. To PublisherMore DetailsPresentation Partially Materializable Delta Trees for Efficient Data Wrangling of Semi-Structured Contents. Nico Schäfer, and Sebastian Michel. EDBT. 2020. To Publisher Distributed Similarity Joins over Top-K Rankings. Evica Milchevski, and Sebastian Michel. EDBT. 2020. To Publisher The ML-Index: A Multidimensional, Learned Index for Point, Range, and Nearest-Neighbor Queries. Angjela Davitkova, Evica Milchevski, and Sebastian Michel. EDBT. 2020. To Publisher Concept and Computation of Ranking-based Dominance. Kiril Panev, and Sebastian Michel. Inf. Syst.. 2019. To Publisher CLASH: A High-Level Abstraction for Optimized, Multi-Way Stream Joins over Apache Storm. Manuel Dossinger, Sebastian Michel, and Constantin Roudsarabi. SIGMOD Conference. 2019. To Publisher Similarity Search and Data Exploration over Entity Rankings (Ähnlichkeitssuche und Datenexploration über Entitäts-Ranglisten). Sebastian Michel. Grundlagen von Datenbanken. 2019. To Publisher Scaling Out Multi-Way Stream Joins using Optimized, Iterative Probing. Manuel Dossinger, and Sebastian Michel. IEEE BigData. 2019. To Publisher Editorial. Sebastian Michel, Rainer Gemulla, Ralf Schenkel, and Theo Härder. Datenbank-Spektrum. 2018. To Publisher Processing Class-Constraint K-NN Queries with MISP. Evica Milchevski, Fabian Neffgen, and Sebastian Michel. WebDB. 2018. To Publisher Learning interesting attributes for automated data categorization. Koninika Pal, and Sebastian Michel. SSDBM. 2018. To Publisher Exploring Pros and Cons of Ranked Entities with COMPETE. Kiril Panev, and Sebastian Michel. ExploreDB@SIGMOD/PODS. 2018. To Publisher Class-constraint similarity queries. Jéssica Andressa de Souza, Agma J. M. Traina, and Sebastian Michel. SAC. 2018. To Publisher Learning Interesting Categorical Attributes for Refined Data Exploration. Koninika Pal, and Sebastian Michel. CoRR. 2017. To Publisher LSH-Based Probabilistic Pruning of Inverted Indices for Sets and Ranked Lists. Koninika Pal, and Sebastian Michel. WebDB. 2017. To Publisher Scaling Out Continuous Multi-Way Theta-Joins. Manuel Hoffmann, and Sebastian Michel. BeyondMR@SIGMOD. 2017. To Publisher Playing Information LEGO at Large Scale. Sebastian Michel. CIDR. 2017. To Publisher Reverse Engineering Top-k Join Queries. Kiril Panev, Nico Weisenauer, and Sebastian Michel. BTW. 2017. To Publisher Exploring Databases via Reverse Engineering Ranking Queries with PALEO. Kiril Panev, Sebastian Michel, Evica Milchevski, and Koninika Pal. BTW. 2017. To Publisher Exploring Databases via Reverse Engineering Ranking Queries with PALEO. Kiril Panev, Sebastian Michel, Evica Milchevski, and Koninika Pal. Proc. VLDB Endow.. 2016. To Publisher Mining Entity Rankings. Fabian Reinartz, Koninika Pal, and Sebastian Michel. Datenbank-Spektrum. 2016. To Publisher Die Arbeitsgruppen für Datenbanken und Informationssysteme an der TU Kaiserslautern. Stefan Deßloch, Theo Härder, and Sebastian Michel. Datenbank-Spektrum. 2016. To Publisher Efficient Similarity Search across Top-k Lists under the Kendall's Tau Distance. Koninika Pal, and Sebastian Michel. SSDBM. 2016. To Publisher Computing similar entity rankings via reverse engineering of top-k database queries. Kiril Panev, Evica Milchevski, and Sebastian Michel. ICDE Workshops. 2016. To Publisher Playing LEGO with JSON: Probabilistic joins over attribute-value fragments. Manuel Hoffmann, Evica Milchevski, and Sebastian Michel. ICDE Workshops. 2016. To Publisher Reverse Engineering Top-k Database Queries with PALEO. Kiril Panev, and Sebastian Michel. EDBT. 2016. To Publisher A Data Mining Approach to Choosing Categorical Attributes for Ranked Lists. Koninika Pal, and Sebastian Michel. EDBT. 2016. To Publisher Quantifying Likelihood of Change through Update Propagation across Top-k Rankings. Evica Milchevski, and Sebastian Michel. EDBT. 2016. To Publisher ligDB - Online Query Processing Without (almost) any Storage. Evica Milchevski, and Sebastian Michel. EDBT. 2015. To Publisher The Sweet Spot between Inverted Indices and Metric-Space Indexing for Top-K-List Similarity Search. Evica Milchevski, Avishek Anand, and Sebastian Michel. EDBT. 2015. To Publisher An LSH Index for Computing Kendall's Tau over Top-k Lists. Koninika Pal, and Sebastian Michel. CoRR. 2014. To Publisher Tracking set correlations at large scale. Foteini Alvanaki, and Sebastian Michel. SIGMOD Conference. 2014. To Publisher Benchmarking Soundtrack Recommendation Systems with SRBench. Aleksandar Stupar, and Sebastian Michel. CoRR. 2013. To Publisher A thin monitoring layer for top-k aggregation queries over a database. Foteini Alvanaki, and Sebastian Michel. DBRank@VLDB. 2013. To Publisher Automated educated guessing. Aleksandar Stupar, and Sebastian Michel. ICDE Workshops. 2013. To Publisher Scalable, continuous tracking of tag co-occurrences between short sets using (almost) disjoint tag partitions. Foteini Alvanaki, and Sebastian Michel. DBSocial. 2013. To Publisher Interesting event detection through hall of fame rank",
  "content_length": 21422,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:18"
}