{
  "name": "Sebastian Padó",
  "homepage": "http://www.ims.uni-stuttgart.de/~pado",
  "status": "success",
  "content": "Herr Prof. Dr. Sebastian Padó | Institut für Maschinelle Sprachverarbeitung | Universität Stuttgart zum Inhalt springen zum Footer springen zurück Navigation schließen Für die volle Funktionalität dieser Site ist JavaScript notwendig. Hier finden Sie eine Anleitung zum Aktivieren von JavaScript in Ihrem Browser. Sebastian Padó Herr Prof. Dr. Lehrstuhlinhaber Theoretische Computerlinguistik, Geschäftführender Direktor des IMSInstitut für Maschinelle SprachverarbeitungTheoretische Computerlinguistik Kontakt +49 711 685 81400 E-Mail Website Pfaffenwaldring 5 b 70569 Stuttgart Deutschland Raum: 02.020 Sprechstunde Nach Vereinbarung. Bitte melden Sie sich per Email an. Fachgebiet In meiner Arbeitsgruppe wird vor allem Forschung zu den Themen komputationelle Semantik und statistische Sprachverarbeitung durchgeführt. Allgemeinverständlich ausgedrückt, entwickeln wir Programme, die es Computern erlauben, die Bedeutung von Wörtern und Sätzen besser zu verstehen. Mehr Details finden Sie auf der Seite meiner Arbeitsgruppe. Publikationen Publikationen von Sebastian Padó: 2025Keith, A., Rojas Castro, A., Jung, K., Ehrlicher, H., Padó, S.: Identifying Humor, Critique, and Gender: Computational Analysis of the Gracioso Archetype in Spanish Golden Age Theater. In: Digital Humanities. , Lisbon, Portugal (2025).BibTeXBibTeX@inproceedings{keith25:_ident_humor_critiq_gender, address = {Lisbon, Portugal}, author = {Keith, Allison and Rojas Castro, Antonio and Jung, Kerstin and Ehrlicher, Hanno and Padó, Sebastian}, booktitle = {Digital Humanities}, title = {Identifying Humor, Critique, and Gender: Computational Analysis of the Gracioso Archetype in Spanish Golden Age Theater}, year = 2025 }Möller, L., Tilli, P., Vu, N.T., Padó, S.: Explaining Caption-Image Interactions in CLIP models with Second-Order Attributions. Transactions on Machine Learning Research. (2025).BibTeXLinkBibTeX@article{moeller2024explainingvisionlanguagesimilaritiesdual, abstract = { Dual encoder architectures like Clip models map two types of inputs into a shared embedding space and predict similarities between them. Despite their wide application, it is, however, not understood how these models compare their two inputs. Common first-order feature-attribution methods explain importances of individual features and can, thus, only provide limited insights into dual encoders, whose predictions depend on interactions between features. In this paper, we first derive a second-order method enabling the attribution of predictions by any differentiable dual encoder onto feature-interactions between its inputs. Second, we apply our method to Clip models and show that they learn fine-grained correspondences between parts of captions and regions in images. They match objects across input modes and also account for mismatches. This intrinsic visual-linguistic grounding ability, however, varies heavily between object classes, exhibits pronounced out-of-domain effects and we can identify individual errors as well as systematic failure categories}, archiveprefix = {arXiv}, author = {Möller, Lucas and Tilli, Pascal and Vu, Ngoc Thang and Padó, Sebastian}, eprint = {2408.14153}, journal = {Transactions on Machine Learning Research}, primaryclass = {cs.CV}, title = {Explaining Caption-Image Interactions in CLIP models with Second-Order Attributions}, url = {https://openreview.net/forum?id=HUUL19U7HP}, year = 2025 }Linkhttps://openreview.net/forum?id=HUUL19U7HPWeeber, F., Ceron, T., Padó, S.: Do Political Opinions Transfer Between Western Languages? An Analysis of Unaligned and Aligned Multilingual LLMs, https://arxiv.org/abs/2508.05553, (2025).BibTeXLinkBibTeX@preprint{weeberarxiv25, author = {Weeber, Franziska and Ceron, Tanise and Padó, Sebastian}, note = {Manuscript}, title = {Do Political Opinions Transfer Between Western Languages? An Analysis of Unaligned and Aligned Multilingual LLMs}, url = {https://arxiv.org/abs/2508.05553}, year = 2025 }Linkhttps://arxiv.org/abs/2508.05553Keith, A., Castro, A.R., Ehrlicher, H., Jung, K., Padó, S.: Computational Analysis of Gender Depiction in the Comedias of Calderón de la Barca. Journal of Computational Literary Studies. 4, (2025).BibTeXLinkBibTeX@article{keith25:_comput_analy_gender_depic_comed_calder_barca, author = {Keith, Allison and Castro, Antonio Rojas and Ehrlicher, Hanno and Jung, Kerstin and Padó, Sebastian}, journal = {Journal of Computational Literary Studies}, number = 1, title = {Computational Analysis of Gender Depiction in the Comedias of Calder\\'on de la Barca}, url = {https://doi.org/10.48694/jcls.4055}, volume = 4, year = 2025 }Linkhttps://doi.org/10.48694/jcls.4055Weeber, F., Ceron, T., Padó, S.: A Cross-Lingual Evaluation of Political Opinions in Multilingual Large Language Models. In: Proceedings of IC2S2 (2025).BibTeXBibTeX@inproceedings{weeber25:_cross_lingual_evaluat_polit_opinion, author = {Weeber, Franziska and Ceron, Tanise and Padó, Sebastian}, booktitle = {Proceedings of IC2S2}, title = {A Cross-Lingual Evaluation of Political Opinions in Multilingual Large Language Models}, year = 2025 }Papay, S., Klinger, R., Padó, S.: Regular-pattern-sensitive CRFs for Distant Label Interactions. In: Proceedings of the First Workshop on Structure-aware Large Language Models. , Vienna, Austria (2025).BibTeXLinkBibTeX@inproceedings{papay25:_regul_crfs_distan_label_inter, address = {Vienna, Austria}, author = {Papay, Sean and Klinger, Roman and Padó, Sebastian}, booktitle = {Proceedings of the First Workshop on Structure-aware Large Language Models}, title = {Regular-pattern-sensitive CRFs for Distant Label Interactions}, url = {https://aclanthology.org/2025.xllm-1.4/}, year = 2025 }Linkhttps://aclanthology.org/2025.xllm-1.4/Daffara, A., Dattawad, S., Padó, S., Ceron, T.: Generalizability of Media Frames: Corpus creation and analysis across countries. In: Proceedings of STARSEM. , Suzhou, China (2025).BibTeXLinkBibTeX@inproceedings{daffara25:_gener_media_frames, address = {Suzhou, China}, author = {Daffara, Agnese and Dattawad, Sourabh and Padó, Sebastian and Ceron, Tanise}, booktitle = {Proceedings of STARSEM}, title = {Generalizability of Media Frames: Corpus creation and analysis across countries}, url = {https://aclanthology.org/2025.starsem-1.7/}, year = 2025 }Linkhttps://aclanthology.org/2025.starsem-1.7/Opitz, J., Möller, L., Michail, A., Padó, S., Clematide, S.: Interpretable Text Embeddings and Text Similarity Explanation: A Survey. In: Proceedings of EMNLP. , Suzhou, China (2025).BibTeXLinkBibTeX@inproceedings{opitz25:_inter_text_embed_text_simil_explan, address = {Suzhou, China}, author = {Opitz, Juri and Möller, Lucas and Michail, Andrianos and Padó, Sebastian and Clematide, Simon}, booktitle = {Proceedings of EMNLP}, title = {Interpretable Text Embeddings and Text Similarity Explanation: {A} Survey}, url = {https://aclanthology.org/2025.emnlp-main.1135/}, year = 2025 }Linkhttps://aclanthology.org/2025.emnlp-main.1135/Lindenmaier, G., Papay, S., Padó, S.: Efficient Language Modeling for Low-Resource Settings with Hybrid RNN–Transformer Architectures, https://arxiv.org/abs/2502.00617, (2025).BibTeXLinkBibTeX@preprint{lindenmaierpapaypado25, author = {Lindenmaier, Gabriel and Papay, Sean and Padó, Sebastian}, note = {Manuscript}, title = {Efficient Language Modeling for Low-Resource Settings with Hybrid RNN–Transformer Architectures}, url = {https://arxiv.org/abs/2502.00617}, year = 2025 }Linkhttps://arxiv.org/abs/2502.00617Hardy, H., Padó, S., Wührl, A., Ceron, T.: Democratizing News Recommenders: Modeling Multiple Perspectives for News Candidate Generation with VQ-VAE, https://arxiv.org/abs/2508.13978, (2025).BibTeXLinkBibTeX@preprint{hardy2025democratizingnewsrecommendersmodeling, archiveprefix = {arXiv}, author = {Hardy, Hardy and Padó, Sebastian and Wührl, Amelie and Ceron, Tanise}, eprint = {2508.13978}, note = {Manuscript}, primaryclass = {cs.IR}, title = {Democratizing News Recommenders: Modeling Multiple Perspectives for News Candidate Generation with VQ-VAE}, url = {https://arxiv.org/abs/2508.13978}, year = 2025 }Linkhttps://arxiv.org/abs/2508.13978Lara-Ortiz, V., Padó, S.: Low-Resource Sign Language Glossing Profits From Data Augmentation. In: Proceedings of the IJCNLP-AACL workshop on sign language processing. , Mumbai, India (2025).BibTeXBibTeX@inproceedings{lara-ortiz25:_low_resour_sign_languag_gloss, address = {Mumbai, India}, author = {Lara-Ortiz, Vania and Padó, Sebastian}, booktitle = {Proceedings of the IJCNLP-AACL workshop on sign language processing}, note = {Accepted for publication}, title = {Low-Resource Sign Language Glossing Profits From Data Augmentation}, year = 2025 }Möller, L., Padó, S.: Explaining Neural News Recommendation with Attributions onto Reading Histories. ACM Transactions on Intelligent Systems and Technology. 16, 7:1––25 (2025). https://doi.org/10.1145/3673233.BibTeXLinkBibTeX@article{moeller24:explaining-neural, abstract = { An important aspect of responsible recommendation systems is the transparency of the prediction mechanisms. This is a general challenge for deep-learning-based systems such as the currently predominant neural news recommender architectures which are optimized to predict clicks by matching candidate news items against users' reading histories. Such systems achieve state-of-the-art click-prediction performance, but the rationale for their decisions is difficult to assess. At the same time, the economic and societal impact of these systems makes such insights very much desirable. In this paper, we ask the question to what extent the recommendations of current news recommender systems are actually based on content-related evidence from reading histories. We approach this question from an explainability perspective. Building on the concept of integrated gradients, we present a neural news recommender that can accurately attribute individual recommendations to news items and words in input reading histories while maintaining a top scoring click-predictio",
  "content_length": 254168,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:17"
}