{
  "name": "Sebastian Fischmeister",
  "homepage": "https://uwaterloo.ca/embedded-software-group/people-profiles/sebastian-fischmeister",
  "status": "success",
  "content": "Sebastian Fischmeister | Real-time Embedded Software Group | University of Waterloo Skip to main content Sebastian Fischmeister Professor and NSERC/Magna Industrial Research Chair in Automotive Software for Connected and Automated Vehicles Short Biography Sebastian Fischmeister received the Dipl.-Ing. degree in Computer Science at the Vienna University of Technology, Austria, in March 2000, and his Ph.D. degree in Computer Science at the University of Salzburg, Austria in December 2002. He continued working at the University of Salzburg as researcher and lecturer and was awarded the Austrian APART stipend in 2005. He subsequently worked at the University of Pennsylvania, USA, as Post Graduate Research Associate until 2008. Sebastian Fischmeister is Professor and NSERC/Magna Industrial Research Chair in Automotive Software for Connected and Automated Vehicles at the Department of Electrical and Computer Engineering at the University of Waterloo, Canada. Sebastian Fischmeister performs systems research at the intersection of software technology, distributed systems, and formal methods. His preferred application area includes distributed real-time embedded systems in the domain of automotive systems, avionics, and medical devices. Key highlights of his research include a framework for scalable location-based pervasive computing systems and tree communication schedules for verifiable but flexible real-time communication. A slightly modified version of his real-time communication framework has been used for the plug-and-play demonstration of medical devices and to promote the ASTM F29.21 standard. He is now working on (a) information extraction of time-sensitive systems, (b) using data analytics of extracted information for system validation and security, (c) runtime monitoring of safety-critical systems, and (d) reliable and robust performance evaluation of embedded systems Sebastian Fischmeister has received the APART stipend in 2005, the Ontario Early Researcher Award (ERA) in 2014, and throughout the years several best paper and tool awards. Sebastian Fischmeister is currently an ACM Distinguished Speaker. Contact Sebastian Professional Activities Embedded Security in Cars (ESCAR) Conference TPC member 2016, 2017 IEEE International Symposium on Real-time Computing (ISORC)General chair 2017 International Conference on Practical Formal Verification for Software Dependability TPC member 2017 Workshop on Monitoring and Testing Cyber-Physical Systems (MT-CPS) TPC member 2017 ACM Symposium on Applied Computing TPC member 2017 International Conference on Embedded Software (EMSOFT)TPC co-chair 2011 TPC member 2016, 2014, 2013, 2010, 2009 Executive committee 2012-2015 IEEE Real-Time Systems Symposium (RTSS)TPC chair for D&V track 2014 TPC member 2016, 2013, 2011, 2009, 2008 WIP member 2010 IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA) TPC member 2016 Design, Automation, and Test in Europe (DATE) TPC member 2016, 2013, 2012, 2011 USENIX Workshop on Cyber Security Experimentation and Test TPC (USENIX CSET) TPC member 2016 Workshop on Formal Verification for Practicing Engineers TPC member 2016 Workshop on Formal Verification for Practicing Engineers (FVPE) TPC member 2016 ACM Conference on Languages, Compilers, Tools and Theory for Embedded Systems (LCTES)TPC co-chair 2015 TPC member 2013, 2012, 2010 International Conference on Runtime Verification (RV)General chair 2014 International Workshop on Reproducible Research Methodologies and New Publication Models (TRUST) TPC member 2014 Euromicro Conference on Real-time Systems (ECRTS) TPC member 2013 WIP member 2008 IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS) TPC member 2011, 2010, 2009, 2008, 2006 IEEE International Conference on Emerging Technologies and Factory Automation (ETFA) TPC member 2014, 2010, 2009, 2008, 2007 IEEE International Conference on Cyber-Physical Systems, Networks, and Applications (CPSNA 2014) TPC member 2014 Workshop on Operating Systems Platforms for Embedded Real-Time applications (OSPERT) TPC member 2014 Workshop on Benchmarking Embedded Systems (BES) General co-chair 2013 Workshop on Real-time Ethernet (RATE) General co-chair 2013 Workshop on Adaptive and Reconfigurable Embedded Systems (APRES) TPC member 2012TPC co-chair 2011, 2010, 2008 International Conference on Performance Evaluation (ICPE) TPC member 2013 IEEE International Conference on Computational Science and Engineering (CSE) TPC member 2009 IEEE International Conference on Embedded Software and Systems (ICESS) TPC member 2012, 2011, 2010 Brazilian Workshop on Real-Time Systems (WRT) TPC member 2013, 2012, 2011 International Colloquium on Theoretical Aspects of Computing (ICTAC) TPC member 2011 IEEE/ACM International Conference on Cyber-Physical Systems (ICCPS) Publicity chair 2011 TPC member 2009 IEEE International Symposium on Advanced Topics on Embedded Systems and Applications (ESA) TPC member 2011 International Conference on Embedded and Multimedia Computing (EMC) TPC member 2010 Workshop on Binary Instrumentation and Applications (WBIA) TPC member 2010 IEEE International Conference on Web Services (ICWS) TPC member 2009, 2008, 2007 IEEE/IFIP International Conference On Embedded and Ubiquitous Computing (EUC) TPC member 2009, 2008 International Conference on Computer Science and its Applications (CSA) TPC member 2009 Workshop on Compositional Theory and Technology for Real-Time Embedded Systems (CRTS) TPC member 2008 ACM/IEEE International Conference on Model Driven Engineering Languages and Systems (MODELS) Review panel 2008 IFIP Workshop on Software Technologies for Future Embedded & Ubiquitous Systems (SEUS) TPC member 2008, 2007 IEEE International Symposium on OO Real-Time Distributed Computing (ISORC) TPC member 2006 Publications with this group 2022 Shrestha, S. L., Lee, T., & Fischmeister, S. (2022). Metasploit for Cyber-Physical Security Testing with Real-Time Constraints Presented at the 5th International Conference on Science of Cyber Security (SciSec) conference. Matsue, Japan. Dunne, M., & Fischmeister, S. (2022). Powertrace-based Fuzzing of CAN Connected Hardware Presented at the IEEE International Conference on Cyber Security and Resilience (CSR) conference. Rhodes, Greece: IEEE. https://doi.org/10.1109/CSR54599.2022.9850299 Grisel-Davy, A., Bhogayata, M., Pabbi, S., Narayan, A., & Fischmeister, S. (2022). Work-in-Progress: Boot Sequence Integrity Verification with Power Analysis Presented at the ACM SIGBED International Conference on Embedded Software (EMSOFT) conference. Shanghai, China: ACM. 2021 Kauffman, S., Havelund, K., & Fischmeister, S. (2021). What Can We Monitor Over Unreliable Channels? International Journal on Software Tools for Technology Transfer, 23, 579-600. https://doi.org/10.1007/s10009-021-00625-z Basiri, M. H., Azad, N. L., & Fischmeister, S. (2021). Secure Dynamic Nonlinear Heterogeneous Vehicle Platooning: Denial-of-Service Cyber-Attack Case In Security and Privacy in Cyber-Physical Systems: Threats and Defenses. Studies in Systems, Decision and Control. Springer. Sakhuja, S., Dunne, M., & Fischmeister, S. (2021). The Boy Who Cried Wolf: On Precision in CAN Bus Intrusion Detection Presented at the Embedded Security in Cars conference. Michigan, USA. Basiri, M. H., Pirani, M., Azad, N. L., & Fischmeister, S. (2021). Security-aware optimal actuator placement in vehicle platooning Asian Journal Of Control. https://doi.org/10.1002/asjc.2567 2020 Basiri, M. H., Azad, N., & Fischmeister, S. (2020). Attack Resilient Heterogeneous Vehicle Platooning Using Secure Distributed Nonlinear Model Predictive Control Presented at the 28th Mediterranean Conference on Control and Automation (MED) conference. Saint-Raphael, France: IEEE. Basiri, M. H., Ghojogh, B., Azad, N. L., Fischmeister, S., Karray, F., & Crowley, M. (2020). Distributed Nonlinear Model Predictive Control and Metric Learning for Heterogeneous Vehicle Platooning with Cut-in/Cut-out Maneuvers Presented at the 59th Conference on Decision and Control (CDC) conference. Jeju Island, Republic of Korea: IEEE. Basiri, M. H., Azad, N., & Fischmeister, S. (2020). Distributed Time-varying Kalman Filter Design and Estimation over Wireless Sensor Networks Using OWA Sensor Fusion Technique Presented at the 28th Mediterranean Conference on Control and Automation (MED) conference. Saint-Raphael, France: IEEE. Thakur, S., & Fischmeister, S. (2020). A Generalizable Saliency Map-based Interpretation of Model Outcome Presented at the International Conference on Pattern Recognition (CPR) conference. Milano, Italy. Iegorov, O., & Fischmeister, S. (2020). Parameterless Semi-Supervised Anomaly Detection in Univariate Time Series Presented at the Joint European Conference on Machine Learning and Knowledge Discovery in Databases (ECML) conference. Kauffman, S., Dunne, M., Gracioli, G., Khan, W., Benann, N., & Fischmeister, S. (2020). Palisade: A Framework for Anomaly Detection in Embedded Systems Journal of Systems Architecture, 1-17. https://doi.org/10.1016/j.sysarc.2020.101876 2019 Basiri, M., Thistle, J., Simpson-Porco, J., & Fischmeister, S. (2019). Kalman Filter Based Secure State Estimation and Individual Attacked Sensor Detection in Cyber-Physical Systems Presented at the Annual American Control Conference (ACC) conference. Philadelphia, USA. Kauffman, S., Havelund, K., & Fischmeister, S. (2019). Monitorability Over Unreliable Channels International Conference on Runtime Verification (RV), 256 to 272. Porto, Portugal. https://doi.org/10.1007/978-3-030-32079-9_15 Sharma, S., Flores, A., Hobbs, C., Stafford, J., & Fischmeister, S. (2019). Safety and Security Analysis of AEB for L4 Autonomous Vehicle Using STPA Presented at the Workshop on Autonomous Systems Design (ASD 2019) conference. Florence, Italy. Salem, M., Carvajal, G., Liu, T., & Fischmeister, S. (2019). Assessing the Robustness of Arrival Curves Models for Real-time Systems In",
  "content_length": 47947,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:15"
}