{
  "name": "Sebastian Proksch 0001",
  "homepage": "https://proks.ch",
  "status": "success",
  "content": "proks.ch: Home Sebastian Proksch Software Engineering Research Group (SERG), TU Delft, The Netherlands Home Research Projects Publications Teaching Service Home Podcast Invitation Jan 13, 2025 I have been invited by Daniel Shea to join the Scholarly Communication podcast and talk about the experience of publishing at ICSE. Together with my co-authors Amir Mir and Georgios Gousios, we reflected on the paper journey of Type4Py: Practical Deep Similarity Learning-Based Type Inference for Python, which we published at ICSE 2022. Major Website Overhaul Sep 27, 2024 It was long overdue and I finally took the time to update my personal website. I have substantially revised the teaching section, esp. the way I list my supervised theses, updated the description of my current research interests, and added an overview over my project experience. I joined the FNS/6G project May 19, 2024 I proudly announce that I am part of the FNS/6G project, a project paid from the Dutch National Growth Fund to bring the Netherlands into a leading international position for the development of 6G. My role in the project is twofold: (1) I investigate how an Appstore for AI Applications can support developers and (2) how to improve the security monitoring of cloud deployments. Oops, I did it again. Apr 20, 2024 I was honored with my second distinguished reviewer award from the International Conference on Software Engineering 2024. Having the opportunity to contribute my part to such a renowned community is a privilege and a deeply rewarding experience, even when teaching duties kept me from accepting the award in person this time. University Teaching Qualification? Check! Jul 5, 2023 In the Netherlands, lecturers must complete a training program of 160h that has been developed jointly by the four Dutch technical universities. My four proof-of-competence documents about developing a course, teaching, assessment, and student supervision got accepted, and I have passed the final oral exam. Tenured Assistant Professor Jun 1, 2023 I passed my tenure-track midterm and was offered a permanent faculty position at TU Delft. I am very grateful for this offer and I want to thank all the people around me that contributed to the achievement over the last couple of years. I could not have done it without you! Finally back to in-person conferences May 27, 2023 I attended the International Conference of Software Engineering in Melbourne, Australia. After staying isolated for so long, it feels great to go out again and meet people. I am back full of energy and ideas and I am looking forward to the next research endeavors. Distinguished ICSE Reviewer May 20, 2023 The Program Chairs of the International Conference on Software Engineering 2023 decided to award me with a distinguished reviewer award. I always try to be as constructive as possible for the authors, and it really makes me proud to see that these efforts do not go unnoticed. Successful Completion of the FASTEN Project Sep 16, 2022 Today, we concluded the FASTEN project with the final project review. Thanks to all the partners for their amazing work. We had highs and lows in the project, but it was a pleasure to work with all of you and the results were a great success. I joined the FASTEN project Jul 3, 2020 From today, I will join the FASTEN project to replace Georgios Gousios in the role of the scientific coordinator and the prinicpal investigator at TU Delft. In FASTEN, we develop an intelligent software package management systems that will enhance robustness and security in software ecosystem by modelling the fine-grained dependencies of method calls. New Job at TU Delft Feb 1, 2020 I am very excited to announce that I will be working as Assistent Professor at the Technical University of Delft, starting today. I will work in the Software Engineering Research Group on empirical topics around CI/CD, DevOps, and on collaborative SE in general. I am a bit sad to leave SEAL, and I will certainly miss Switzerland, but I am looking forward to start a new chapter in another awesome research group! Website Now Has Teaching and Service Sections May 17, 2019 Even though my website is reduced to the bare information, it still takes some effort to keep it up-to-date and it will never be “done”. Every now and then, I decide to add something, this time, I added two new sections about my teaching experience and my community service. I will be visiting Montreal in 2019 Dec 12, 2018 Wow, the ICSE notifications really caught me off-guard. It is not only the first time that I will have an ICSE full paper, I even managed to get in two. What a great way to end a successful year. Thanks to all of my co-authors for the great collaborations, see you in Canada! Participation at Hack Zurich Sep 16, 2018 I participated in the annual hackathon “Hack Zurich”. Three days of non-stop coding in a great team resulted in a browser-extension that helps to improve awareness about the footprint of food by analyzing and commenting on images of food on social media. Happy End for the MSR Mining Challenge Jun 6, 2018 The mining challenge is over. While the organization took way more time than anticipated, it was worth every invested second. I learned a lot about conference organization and it was awesome to see so many great papers that used my data, sometimes in very creative ways! Exciting Times Mar 3, 2018 The year is not very old yet, but a lot of things happen at once right now. I have the pleasure of lecturing a Master course, we have just sent out the notifications for the MSR mining challenge, and one of our papers got into ICPC. MSR Mining Challenge 2018 Aug 8, 2017 I’m very proud to announce that our proposal to use our dataset of “Enriched Event Streams” for the Mining Challenge at MSR’18 has been accepted. Hello World (Wide Web)! Apr 20, 2017 Personal websites seem to be a thing again. I refrained from reactivating my old myspace page though and came up with this one instead. Some polishing is still adviced and will be performed along with future extensions. Thesis Status: Content Complete Apr 8, 2017 Wow, what a feeling. I printed my first full draft of my thesis today to get some feedback on it. Looking foward to finally finishing this part of my life. Moving to Zürich! Mar 31, 2017 I’m very pleased to announce that I will become a s.e.a.l. at University of Zürich in June. Exciting times ahead! Computer scientist with a passion for the development and operation of software. Generally tries to be a good person. LinkedIn GitHub Google Scholar DBLP TU DelftRoom 1.W.680van Mourik Broekmanweg 6NL-2628XE, DelftThe Netherlands S.Proksch at tudelft nl +31 15 27 87215 Imprint This site was last updated on Oct 17, 2025.",
  "content_length": 6726,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:14"
}