{
  "name": "Sebastian Rudolph",
  "homepage": "https://iccl.inf.tu-dresden.de/web/Sebastian_Rudolph/en",
  "status": "success",
  "content": "Sebastian Rudolph - International Center for Computational Logic TU Dresden / TU Dresden / InformatikComputer Science / ICCL / TU Dresden / Fakultät InformatikFaculty of Computer Science / International Center For Computational Logic Account Log in Edit tools Discussion View source View history Refresh Internal SucheSearch Deutsch Sebastian Rudolph From International Center for Computational Logic Jump to:navigation, search Prof. Dr. Sebastian Rudolph ProfessorTechnische Universität Dresdenhttp://www.tu-dresden.deInternational Center for Computational Logichttps://iccl.inf.tu-dresden.de Computational Logic Personal homepageDBLPGoogle Scholar sebastian.rudolph@tu-dresden.de  Secretary: cl@tu-dresden.de  +49 351 463 38516  +49 351 463 32827  APB 2035 Since April 2013, I have been full professor for Computational Logic at the Institute for Artificial Intelligence at the Faculty of Computer Science of Technische Universität Dresden, since 2021 affiliated member of the Faculty of Mathematics. My research interests comprise Artificial Intelligence, in particular Knowledge Representation and Reasoning using diverse formalisms (such as Description Logics, Existential Rules and Formal Concept Analysis) and their applications in diverse areas, for instance Semantic Technologies. I deal with problems ranging from theoretical foundations (e.g., decidability and complexity of reasoning tasks) to practical deployment (ontology modeling, interactive knowledge acquisition). In 2017, I received an ERC Consolidator Grant for investigating general principles of decidability in logic-based knowledge representation. Before returning to Dresden, I spend the years 2006 to 2013 as a postdoctoral researcher, project leader and later Privatdozent in Rudi Studer's Knowledge Management group at the Institute AIFB of the Karlsruhe Institute of Technology, where I obtained my habilitation in 2011. Before I had completed my PhD in Algebra and my studies for highschool teaching in mathematics, physics and computer science at the TU Dresden. Publications Activities Teaching Newest Publications View full publication list Lucía Gómez Álvarez, Sebastian Rudolph Putting Perspective into OWL [sic]: Complexity-Neutral Standpoint Reasoning for Ontology Languages via Monodic S5 over Counting Two-Variable First-Order Logic In Magdalena Ortiz, Renata Wassermann, Torsten Schaub, eds., Proceedings of the 22nd International Conference on Principles of Knowledge Representation and Reasoning, 366–375, 2025. IJCAI Organization Details DownloadSimon Hosemann, Jean Christoph Jung, Carsten Lutz, Sebastian Rudolph Fitting Ontologies and Constraints to Relational Structures In Magdalena Ortiz, Renata Wassermann, Torsten Schaub, eds., Proceedings of the 22nd International Conference on Principles of Knowledge Representation and Reasoning, 407–416, 2025. IJCAI Organization Details DownloadPiotr Gorczyca, Dörthe Arndt, Martin Diller, Jochen Hampe, Georg Heidenreich, Pascal Kettmann, Markus Krötzsch, Stephan Mennicke, Sebastian Rudolph, Hannes Straß Supporting Risk Management for Medical Devices via the Riskman Ontology and Shapes Proceedings of the 21st International Conference on Semantic Systems (SEMANTiCS 2025), to appear Details DownloadSergei Obiedkov, Sebastian Rudolph When Horn is All You Need In Peggy Cellier, Bernhard Ganter, Rokia Missaoui, eds., Conceptual Knowledge Structures. CONCEPTS 2025, volume 15941 of Lecture Notes in Artificial Intelligence, 309–324, September 2025. Springer Details DownloadFaiq Miftakhul Falakh, Sebastian Rudolph, Kai Sauerwald AGM Belief Revision, Semantically ACM Transactions on Computational Logic, 2025 Details DownloadThomas Feller, Tim Lyon, Piotr Ostropolski-Nalewaja, Sebastian Rudolph Decidability of Querying First-Order Theories via Countermodels of Finite Width Logical Methods in Computer Science, 21(2):7:1-7:35, April 2025 Details DownloadJonas Karge, Juliette-Michelle Burkhardt, Sebastian Rudolph, Dominik Rusovac To Lead or to be Led: A Generalized Condorcet Jury Theorem under Dependence AAMAS '24: Proceedings of the 2024 International Conference on Autonomous Agents and Multiagent Systems, 2024 Details DownloadLucas Carr, Nicholas Leisegang, Thomas Meyer, Sebastian Rudolph Non-monotonic Extensions to Formal Concept Analysis via Object Preferences In Aurona Gerber, Jacques Maritz, Anban W. Pillay, eds., Proceedings of the 5th Southern African Conference on AI Research (SACAIR'24), volume 2326 of CCIS, 476–492, 2024. Springer Details DownloadNicholas Leisegang, Thomas Meyer, Sebastian Rudolph Towards Propositional KLM-Style Defeasible Standpoint Logics In Aurona Gerber, Jacques Maritz, Anban W. Pillay, eds., Proceedings of the 5th Southern African Conference on AI Research (SACAIR'24), volume 2326 of CCIS, 459–475, 2024. Springer Details DownloadLucía Gómez Álvarez, Sebastian Rudolph Reasoning in SHIQ with Axiom- and Concept-Level Standpoint Modalities In Pierre Marquis, Magdalena Ortiz, Maurice Pagnucco, eds., Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning, 383–393, 2024. IJCAI Organization Details Download View full publication list Affiliate Member of the Faculty of Mathematics, TU DresdenManaging Director of the Institute for Artificial IntelligenceMember of the Faculty Council of the CS Department and the School Council of the School of Engineering SciencesPrincipal Investigator in the DFG Research Training Group \"Quantitative Logics and Automata\" (QuantLA) Courses Introduction to Existential Rules (WS 2025) Foundations of Knowledge Representation (WS 2025) Theoretische Informatik und Logik (SS 2025) Formale Systeme (WS 2024) Introduction to Existential Rules (SS 2024)show further courses Student projects Projects and Theses in Computational Logic (WS 2025) Completed Theses Visualizing the Extension Space of Abstract Argumentation Frameworks Using Clustering Methodsby Mei Yang (27 Februar 2021)Supervisor: Sebastian Rudolph, Sarah Alice Gaggl Analysis and Implementation of scf2 Argumentation Semanticsby Guzel Khuziakhmetova (25 Februar 2021)Supervisor: Sebastian Rudolph, Sarah Alice Gaggl Justifications under the Fixed-Domain Semanticsby Satyadharma Tirtarasa (28 September 2017)Supervisor: Sebastian Rudolph, Lukas Schweizer Combining Belief Revision and Abstract Dialectical Frameworksby Umer Mushtaq (13 Oktober 2016)Supervisor: Sebastian Rudolph, Sarah Alice Gaggl Encoding Belief Revision Operators in Abstract Dialectical Frameworksby Umer Mushtaq (7 Oktober 2016)Supervisor: Sebastian Rudolph, Sarah Alice Gaggl On the Computation of Naive-based Argumentation Semanticsby Javanshir Alammadli (14 März 2016)Supervisor: Sebastian Rudolph, Sarah Alice Gaggl Grounded Circumscription in Description Logicsby Efstathios Delivorias (9 April 2015)Supervisor: Sebastian Rudolph Solving Product Configuration Problems using Non-standard Reasoning Servicesby Lukas Schweizer (11 Juli 2014)Supervisor: Sebastian Rudolph, Sarah Alice Gaggl Computational Logic Retrieved from \"https://iccl.inf.tu-dresden.de/w/index.php?title=Sebastian_Rudolph/en&oldid=32872\" This page was last edited on 1 December 2025, at 03:56. Privacy policy About International Center for Computational Logic Disclaimers Accessibility",
  "content_length": 7269,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:17"
}