{
  "name": "Sebastijan Dumancic",
  "homepage": "https://sebdumancic.github.io",
  "status": "success",
  "content": "Sebastijan Dumancic Office 4.East.220 Van Mourik Broekmanweg 6 2628 XE Delft How can we make machines learn from as little data as possible? How can we make machines that effectively deploy their knowledge in novel situations? I try to answer these questions by investigating how can we use programming languages to represent what artificially intelligence agents know and how they act. In pursuing this goal, I work on program synthesis, which focuses on learning programs from examples, and probabilistic programming, which focuses on representing and reasoning with probabilistic models represented as computer programs. In both fields, representing knowledge as a program is the key feature that allows us to capture knowledge of arbitrary complexity, use it flexibly, and acquire it from little experience. I am also interested in application of program synthesis and probabilistic programming in scientific discovery (especially geophysics), transportation, robotics and planning. Before joining TU Delft, I was an FWO-funded postdoctoral fellow in the DTAI lab at KU Leuven working with Hendrik Blockeel and Luc De Raedt, where I also obtained my PhD. I was a visiting researcher at MIT, University of Oxford, and NEC Laboratories Europe. news Jun 5, 2025 I’ve joined the Scientific Comittee of the Symbolic Computation and Machine Learning Initiative Jun 3, 2025 I’m visiting the Amsterdam Machine Learning Lab May 27, 2025 I am attending NWO Life where I’m giving a talk about our efforts to autonomously discovery mechanistic models Apr 15, 2025 Reuben, Richard, and I are attending AI4Bio symposium Apr 2, 2025 I have (finally) obtained University Teaching Qualification. Feb 21, 2025 I am giving a talk in the KAS lab of Carlos Hernández Corbato Feb 16, 2025 Claire Kuhlkin joins us as a MSc student (co-supervised by Annette ten Teije and Frank van Harmelen). Claire will be working on improving medical guidelines from data through Inductive Logic Programming. Feb 9, 2025 Rutger Klaassen joins us as a MSc students. Rutger will be working on combining symbolic program synthesis with LLMs and robotics. Feb 9, 2025 Ole Poeth joins us as a MSc student. Ole will be working on interactive constraint acquisition in program synthesis. Feb 2, 2025 Sebastian Mežnar is visiting us for 3 weeks. Dec 13, 2024 I am giving a talk at Sebastian Musslick’s Autonomous Empricial Research group Dec 10, 2024 I am visiting Bordeaux (virtually) for Théo Matricon’s PhD defense, as a jury member. Dec 10, 2024 Our Find2Fix project has been accepted. I will be hiring a PhD student to work on the intersection of program syntehsis and cyber security. Nov 15, 2024 Matteo Bertorotta joins us as a MSc student (co-supervised with Andreea Costea). Matteo will be making program synthesis more efficient through e-graphs. Nov 15, 2024 Sebastien van Tiggele joins us as a MSc student (co-supervised with Walter Fontana and Jérôme Feret). Sebastien will be exploring how program synthesis can be used to automatically construct Kappa models. Nov 15, 2024 Richard Wijers joins us as a MSc student (co-supervised with Jana Weber). Richard will be exploring how program synthesis can be used to automatically construct chemical reaction networks. Nov 11, 2024 I have finally joined ELLIS! I am also a part of the Delft Unit. Nov 7, 2024 I am attending a AAAI Fall Symposium on Computational Scientific Discovery. Nov 5, 2024 I am visiting Walter Fontana’s lab at Harvard School of Medicine Nov 1, 2024 Our project A Layered, Explainable Approach to Intelligent Greenhouse Horticulture has been awarded by NWO. I will be hiring one PhD student next year. Sep 16, 2024 I’m attending Aachen Symposium on Representation Learning to Act and Plan. Aug 19, 2024 Luka Janjić defended his MSc thesis on program synthesis with dependent types. Jul 29, 2024 Tan Zhi-Xuan is visiting us today. We are excited to learn more about her work on probabilistic programming and model-based planning. Jul 16, 2024 I’m participating in the IAS Amsterdam workshop on Logic and AI Jul 4, 2024 Bart Swinkels graduated with an excellent MSc thesis on Constraint Propagation in Program Synthesis. Bart’s thesis set the foundations for our Herb library. Jun 19, 2024 I’m giving a lecture on machine learning with provable guarantees at the SIKS course on Neuro-symbolic AI Apr 30, 2024 I’m attending the European AI for Fundamental Physics Conference 2024 Apr 1, 2024 Mara joins us as an MSc student. Mara will be working on automatically constructing better proposals in probabilistic programming with constraint solvers. Mar 11, 2024 Lorenzo joins us as a PhD student. Lorenzo will be working with Fernando Kuipers and me on program synthesis for programmable networks, as a part of the Future Network Services project Mar 1, 2024 Stef joins us again as a research assistant helping us to get Herb in a good shape Mar 1, 2024 Han joins us as an MSc student. Han will be working with Frans Oliehoek and me on probabilistic programming and MDPs. Feb 1, 2024 Jord Molhoek defended his master thesis Reasoning about MDPs Abstractly – Bayesian Policy Search with Uncertain Prior Knowledge, exploring how uncertain prior knowledge can be leveraged in MDPs with probabilistic programming Jan 29, 2024 I’m visiting Nathanaël Fijalkow’s group at CNRS in Bordeaux Jan 15, 2024 I’m giving a talk on the need for a neuro-symbolic languages at the Probabilistic Learning and Reasoning mini-symposium, co-located with Emile Van Krieken’s PhD defence. I am also one of Emile’s examiners. Jan 12, 2024 Avi joins us as an MSc student. Avi will be working on improving reasoning in large langauge models with probabilistic programming and theorem provers. Jan 1, 2024 Liang joins my group as a postdoc. He will be working on probabilistic programming for coupled physics simulators. Jan 1, 2024 I am acting as a co-chair for the Special Track on Reasoning, Learning, and Decision-Making at KR 2024 together with Jean Christoph Jung and Iran Mansouri Nov 15, 2023 Lola joins us as an MSc student. Lola will be working on incremental inference in probabilistic programs. Nov 15, 2023 Luka joins us as an MSc student. Luka will be working with Jesper Cockx and me on program synthesis for programs with dependent types. Nov 15, 2023 Bart joins us as an MSc student. Bart will be developing a specialised constraint solver for program synthesis. Oct 20, 2023 Hector Geffner is visiting us today. We are excited to learn more about his work on generalised planning. Oct 1, 2023 Reuben joins us as a PhD student. Reuben will be working on program synthesis and probabilistic programming for scientific discovery. Aug 28, 2023 Alexander Freeman defended his master thesis Exploiting modularity during program synthesis, exploring how modularity can help us explore program spaces better Aug 24, 2023 Gautham Venkataraman defended his master thesis Reduce, Reuse, Recycle – On exploration of solution reuse in VRPTW, exploring how exploit structure in vehicle routing problems thorugh probabilistic programming Aug 22, 2023 Timo Jugariu defended a master thesis Program Synthesis for Programmable Data Planes, exploring the potential of progrma synthesis to automatically configure programmable networks Jul 21, 2023 Reuben Gardos Reid defends his thesis Inferring Robust Plans with a Rail Network Simulator on using probabilistic programming to deal with uncertainty in railway planning problems Jul 7, 2023 Pepijn Klop defended a master thesis Augmenting Program Synthesis with Large Language Models, exploring how large language models can help us generate more expamples for program synthesis Jul 4, 2023 Jaap de Jong defended his master thesis Speeding up program synthesis with specification discovery, showing how we can automatically discover program equivalences and specifications in program synthesis from data Feb 7, 2023 Andrew, Celine and I are giving a tutorial on inductive logic programming at AAAI’23. Jan 12, 2023 Our RAIL lab has been funded through the ROBUST programme",
  "content_length": 8027,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:20"
}