{
  "name": "Sebastian Risi",
  "homepage": "https://pure.itu.dk/portal/en/persons/sebastian-risi(a420ffb3-2ca6-4925-a25f-baaa5228fc15).html",
  "status": "success",
  "content": "Sebastian Risi - IT-University of Copenhagen Sebastian Risi public CV Sebastian Risi Professor, Play, Culture, and AIHead of Research Group, Creative AI LabMachine LearningRobotics, Evolution, and Art LabREAL Lab https://orcid.org/0000-0003-3607-8400 Emailsebritudk 20072024 Research activity per year Personal profile CurriculumSebastian Risi is a Professor at the IT University of Copenhagen. He received a diploma in computer science from the Philipps University of Marburg, Germany in 2007 and received a PhD in 2012 from the University of Central Florida. Before joining the IT University he was a postdoctoral DAAD fellow at Cornell University working with Hod Lipson. More information can be found here: sebastianrisi.com and full CV here. KeywordsNeuroevolutionEvolutionary ComputationEvolutionary RoboticsNeural NetworksProcedural Content GenerationGame AI Fingerprint Dive into the research topics where Sebastian Risi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Neural Network Computer Science 100% Robot Computer Science 99% Reinforcement Learning Computer Science 99% Artificial Intelligence Computer Science 70% Cellular Automata Computer Science 52% Neural Cellular Automata Keyphrases 43% Evolutionary Algorithms Computer Science 41% Interactive Evolutionary Computation Keyphrases 39% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2007 2015 2016 2017 2018 2019 2020 2021 2024 72 Article in proceedings 21 Journal article 14 Conference article 13 Book chapter 14 More 7 Paper 2 Conference abstract in proceedings 2 Conference abstract for conference 1 Report 1 Comment/debate 1 Other contribution Research output per year Research output per year Algorithmic Ways of Seeing: Using Object Detection to Facilitate Art ExplorationMeyer, L. S., Engel Aaen, J., Tranberg, A. R., Kun, P., Freiberger, M., Risi, S. & Løvlie, A. S., 11 May 2024, Algorithmic Ways of Seeing: Using Object Detection to Facilitate Art Exploration. p. 1-18 18 p. (ACM Annual Conference on Human Factors in Computing Systems (CHI)).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Museum Collections 100% Art Museums 100% Art Exploration 100% Digital 50% Painting 50% Towards Self-Assembling Artificial Neural Networks through Neural Developmental ProgramsNajarro, E., Risi, S. & Sudhakaran, S., 2023, In: Artificial Life Conference Proceedings .Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open AccessFile A Unified Substrate for Body-Brain Co-evolutionPontes-Filho, S., Walker, K. E., Najarro, E., Nichele, S. & Risi, S., 2022.Research output: Contribution to conference - NOT published in proceeding or journal › Paper › Research › peer-review Open AccessFile Cellular Robots 100% Body-brain Coevolution 100% Robotics 100% Coevolution 100% Robot 100% HyperNCA: Growing Developmental Networks with Neural Cellular AutomataNajarro, E., Sudhakaran, S., Glanois, C. & Risi, S., 2022, In: arXiv.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open AccessFile Neural Network 100% Developmental Networks 100% Neural Cellular Automata 100% Cellular Automata 100% Reinforcement Learning 66% Mario Plays on a Manifold: Generating Functional Content in Latent Space through Differential GeometryDuque, M. G., Berg Palm, R., Hauberg, S. & Risi, S., 2022, In: Proceedings of the 2022 IEEE Conference on Games (CoG).Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Latent Space 100% Differential Geometry 100% Generating Functional 100% Functional Content 100% End User 100% View all 134 research outputs Projects Projects per year 2015 2018 2020 2034 4 Active 16 Finished Projects per year Google Faculty Research AwardRisi, S. (PI) & Duque, M. G. (CoI)Google Inc.20/03/2019 → 30/04/2025Project: Other Trial-and-error 100% Personalized Training 100% Medical Diagnosis 100% Video Games 100% Patient Outcomes 100% DIREC: ExplainableRisi, S. (PI) & Barkhuus, L. (CoI)Innovation Fund Denmark02/03/2021 → 02/07/2021Project: Research BDTB: Beyond Digital - Towards BiologicalBeloff, L. (PI), Kadish, D. (CoI), Risi, S. (CoI) & Jørgensen, J. (CoI)Danish Agency for Higher Education and Science01/02/2017 → 31/12/2017Project: Research Biological Materials 100% Artistic Development 50% Artificial Life 50% Do-it-yourself 50% Digital 50% STELLAR: Super Turing Evolving Lifelong Learning ARchitectureRisi, S. (PI) & Grbic, D. (CoI)Federal Business Opportunities12/07/2018 → 15/12/2021Project: Research Award-winning Papers 100% Super-Turing 100% Learning Architecture 100% Autonomous Driving 100% Robotics 100% Improving Marketing Mix Decisions Through Interactive Bayesian OptimizationRisi, S. (PI) & Löwe, M. K. K. (CoI)Innovation Fund Denmark01/09/2018 → 31/08/2021Project: Research View all 20 projects Press/Media Falske billeder af Donald Trump, der bliver anholdt, set af millioner på TwitterRisi, S.24/03/20231 Media contributionPress/Media: Press / Media I fremtiden vil vi alle kunne blive snydt - skal vi frygte AI-skabte billeder?Risi, S.20/11/20221 Media contributionPress/Media: Press / Media Kig godt på billederne til denne historie. De er skabt af kunstig intelligensRisi, S.21/08/20221 Media contributionPress/Media: Press / Media Nyhavn skabt i baconRisi, S.08/08/20221 Media contributionPress/Media: Press / Media ITU-forsker får bevilling til at udvikle neurale netværkRisi, S.23/06/20221 Media contributionPress/Media: Press / Media View all 51 press/media Prizes Best Paper Award, 2021 Conference of Foundation of Digital Games (FDG’21)Zhu, J. (Recipient), Löwe, M. K. K. (Recipient), Villareale, J. (Recipient), Freed, E. (Recipient), Sladek, A. (Recipient) & Risi, S. (Recipient), 2021Prize: Prizes, scholarships, distinctions Digital Games 100% Best Paper Award 100% Game Research 50% Acceptance Rate 50% Academic Conferences 50% Best Paper Runner-Up at the 2020 IEEE Conference on GamesDuque, M. G. (Recipient), Berg Palm, R. (Recipient), Ha, D. (Recipient) & Risi, S. (Recipient), 2020Prize: Prizes, scholarships, distinctions Best Papers 100% Game-based 50% Winner of the 2017 Virtual Creatures Competition at GECCO 2017Veenstra, F. (Recipient), Faina, A. (Recipient), Støy, K. (Recipient) & Risi, S. (Recipient), 19 Jul 2017Prize: Prizes, scholarships, distinctions Winner of Virtual Creature Competition at GECCO 2017Veenstra, F. (Recipient), Faina, A. (Recipient), Støy, K. (Recipient) & Risi, S. (Recipient), 15 Jul 2017Prize: Prizes, scholarships, distinctions GECCO 100% Modular Robots 100%",
  "content_length": 7134,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:17"
}