{
  "name": "Sebastian Böcker",
  "homepage": "http://bio.informatik.uni-jena.de",
  "status": "success",
  "content": "Lehrstuhl für Bioinformatik an der FSU Jena, Prof. Böcker Skip to content Foto: Jens Meyer Head: Prof. Dr. Sebastian Böcker Office hours: nach Vereinbarung Postal Address Friedrich-Schiller-Universität Jena Institut für Informatik Lehrstuhl für Bioinformatik Inselplatz 5 07743 Jena Secretariat Kathrin Schowtka Room: 3012 Phone: +49-3641-9-46450 Fax: +49-3641-9-46452 Office hours: Monday-Friday, 7:30-16:00 This is the home page of the Boecker lab, headed by Prof. Sebastian Böcker. For e-mail or phone contact to a particular member of the chair see the members page. Follow us on Social Media Links We are part of the HUMAN doctoral network (Harmonising and Unifying Blood Metabolomic Analysis Networks) funded by EU Horizon. We are part of an ongoing project regarding the identification of pharmacologically active molecules using AS-MS (affinity selection-mass spectrometry). This project is supported by the Thüringer Ministerium für Wirtschaft, Wissenschaft und Digitale Gesellschaft (TMWWDG) with funds from the European Union (ERDF, 2023 VFE 0003). Read more We are cooperating with the International Max Planck Research School “Chemical Communication in Ecological Systems” at the Max Planck Institute for Chemical Ecology (Jena) and the International Max Planck Research School for Global Biogeochemical Cycles at the Max Planck Institute for Biogeochemistry (Jena) The Bio Systems Analysis research group of Prof. Dr. Peter Dittrich is an independent research group which is also part of this Chair. BioinfoWelten: Aktuelle Forschung verständlich erklärt. How to find us Look at the map on Google Maps. Getting there by train: You will arrive either at Jena Westbahnhof or at Jena Paradies. Click on one of the links to find walking directions to our offices, walking distance is about 15 minutes. The main entrance (“Eingang Lutherplatz”) is at the intersection of Löbdergraben and Lutherplatz. Take the elevator on the right, press 3, the secretariat is on the right. News Small server downtimes at the 24th and 25thby Jonas Emmert21/11/2025 Our barcode-free screening platform for early drug discovery appeared in Nature Communicationsby Nils Haupt14/11/2025 PhD and postdoc positions within the ERC project BindingShadows are still openby Nils Haupt12/11/2025 We finally moved!by Nils Haupt11/11/2025 Website and Mattermost will be down again on 20th and 21stby Jonas Emmert18/10/2025 We are backby Sebastian Böcker10/10/2025 PhD and postdoc positions as part of the ERC project BindingShadowsby Sebastian Böcker17/09/2025",
  "content_length": 2540,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:12"
}