{
  "name": "Sebastian Wandelt",
  "homepage": "http://m3nets.de/group/sw.html",
  "status": "success",
  "content": "Sebastian Wandelt@M3Nets (Multi-Modal Mobility Networks) M3NetsXiaoqian SunSebastian WandeltMembersTeachingResearchPublications ﻿ Sebastian Wandelt, PhD Full Professor (教授, 博导), 青年千人 Department of Electronics and Information Engineering Beihang UniversityBeijing, ChinaPhone: +86 10 8233 8036Email: sebastian[at]wandelt(dot)eu I am a professor at Department of Electronics and Information Engineering, Beihang University. My work is broadly on the design and evaluation of scalable algorithms and data management techniques, with a focus the underlying computational challenges. The application domains are various, including intelligent transportation systems, complex networks, bioinformatics. In addition, I have an interest in the robustness and evolution of all kinds of systems. The results of my research are published in leading transportation journals (e.g., Transportation Science, Transportation Research Part A/B/C/E, Transport Policy, and IEEE T-ITS), as well as computer science journals (e.g., Future Generation Computer Systems and Information Sciences) and conferences (e.g., PVLDB). A list of recent key publications can be found below. According to my wide area of interest, I am an active and reliable reviewer for many international journals, including Nature Biotechnology, Transportation Research Part A/B/C/D/E, Transportmetrica A/B, and several IEEE Transactions, such as Vehicular Technology / Intelligent Transportation Systems / Knowledge and Data Engineering. I also occasionally review for several Computer Science and Bioinformatics journals, given my past research interests. Ten selected key publications:Sebastian Wandelt, Anming Zhang, et al. The Hitchhiker's Guide to Challenges in Transport Policy Research: Towards ANSWERing questions regarding life, mobility, and everything. Transportation Research Part A-Policy and Practice 200, pp. 104650, 2025, IF=6.8 (Q1) DOISebastian Wandelt, Morton O'Kelly, et al. Towards quantifying fuel savings in global air transport with fleet upgrades. Transportation Research Part D-Transport and Environment 146, pp. 104811, 2025, IF=7.7 (Q1) DOISebastian Wandelt, Shuang Wang, et al. Network structures in air transportation: A comprehensive review of applications and challenges. Journal of Air Transport Management 126, pp. 102794, 2025, IF=3.6 (Q2) DOISebastian Wandelt, Andrea Signori, et al. Unleashing the Potential of Operations Research in Air Transport: A review of applications, methods, and challenges. Journal of Air Transport Management 124, pp. 102747, 2025, IF=3.6 (Q2) DOISebastian Wandelt, Anming Zhang, et al. Global Airport Resilience Index: Towards a comprehensive understanding of air transportation resilience. Transportation Research Part D-Transport and Environment 138, pp. 104522, 2025, IF=7.7 (Q1) DOISebastian Wandelt, Shuang Wang, et al. A literature review on hub location-routing models and their solution techniques. Computers & Operations Research 173, pp. 106861, 2025, IF=4.3 (Q1) DOISebastian Wandelt* and Changhong Zheng. Toward Smart Skies: Reviewing the State of the Art and Challenges for Intelligent Air Transportation Systems (IATS). IEEE Transactions on Intelligent Transportation Systems 25(10), pp. 12943-12953, 2024, IF=8.4 (Q1) DOISebastian Wandelt, Shuang Wang, et al. AERIAL: A meta review and discussion of challenges towards unmanned aerial vehicle operations in logistics, mobility, and monitoring. IEEE Transactions on Intelligent Transportation Systems 25(7), pp. 6276-6289, 2023, IF=8.4 (Q1) DOISebastian Wandelt, Xiaoqian Sun*, et al. Towards Analyzing the Robustness of the Integrated Global Transportation Network Abstraction (IGTNA). Transportation Research Part A-Policy and Practice 178, pp. 103838, 2023, IF=6.8 (Q1) DOISebastian Wandelt, Weibin Dai, et al. Towards a Reference Experimental Benchmark for Solving Hub Location Problems. Transportation Science 56, pp. 543-564, 2022, IF=4.8 (Q1) DOI",
  "content_length": 3951,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:19"
}