{
  "name": "Sebastian Steinhorst",
  "homepage": "https://www.ce.cit.tum.de/esi/mitarbeiter/steinhorst",
  "status": "success",
  "content": "Steinhorst - Professur für Embedded Systems and Internet of Things Prof. Dr. Sebastian Steinhorst Technische Universität München Professur für Embedded Systems and Internet of Things Arcisstr. 21 80333 München Deutschland Tel. +49.89.289.23568 Fax +49.89.289.23555 E-Mail: sebastian.steinhorst(at)tum.de X.509 Certificate, SHA-1: 2E 2A 64 EC 13 52 06 BB 3F 5A 6C B8 47 76 64 4E D2 50 67 9A Gebäude: 0509 Raum: 4961 Persönliche Website: sebastian.steinhorst.info Biografie Prof. Steinhorst ist Associate Professor (W3-Level mit Tenure) für Embedded Systems and Internet of Things im Department of Computer Engineering in der School of Computing, Information and Technology der Technischen Universität München (TUM). Vor seiner Beförderung zum Associate Professor im Januar 2020 war er Rudolf Mößbauer Tenure Track Assistant Professor und Fellow des TUM Institute for Advanced Study seit November 2016. Er war zudem Co-Program PI des Forschungszentrums TUMCREATE in Singapur. Die Forschungsschwerpunkte von Prof. Steinhorst liegen im Bereich der Informationssicherheit, Vorhersagbarkeit, Zuverlässigkeit und Interoperabilität von intelligenten vernetzten und autonomen Systemen in komplexen cyber-physischen Szenarien mit Anwendungsgebieten z.B. im Internet der Dinge, Industrie 4.0 und Fahrzeugen. Prof. Steinhorst studierte Informatik an der Johann Wolfgang Goethe-Universität Frankfurt am Main und promovierte dort 2011. Zwischen 2011 und 2016 war er im Forschungszentrum TUMCREATE in Singapur tätig, zuletzt als Leiter der Abteilung Embedded Systems. Von Mai bis September 2016 war er Assistant Professor an der Aarhus University in Dänemark. Prof. Steinhorst ist seit November 2016 an der TUM. Weitere Aktivitäten u.a.: Stellvertretender Gleichstellungsbeauftragter der TUM School of Computing, Information and Technology Mitglied des Masterprüfungsausschusses des Master of Science in Electrical and Computer Engineering Co-Organizer der Special Initiative on Autonomous Systems Design der Design, Automation and Test in Europe (DATE) Conference (https://asd-initiative.org/) Co-Organizer der Future-IoT PhD School (https://school.future-iot.org/) Mitglied des Editorial Board der ACM Transactions on Embedded Computing Systems (ACM TECS) (https://dl.acm.org/journal/tecs/editorial-board) Publikationen Wenn Sie externe Inhalte von tum-esi.github.io aktivieren, werden Daten automatisiert an diesen Anbieter übertragen. Mehr Informationen Einmalig aktivieren To top Professur für Embedded Systems and Internet of Things Prof. Dr. Sebastian Steinhorst Arcisstr. 21 D-80333 München Tel.: +49-(0)89-289-23537",
  "content_length": 2609,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:19"
}