{
  "name": "Sebastian Trimpe",
  "homepage": "https://www.dsme.rwth-aachen.de/cms/DSME/das-institut/Team/~jlolt/Prof-Sebastian-Trimpe/?allou=1",
  "status": "success",
  "content": "Prof. Sebastian Trimpe | Institut für Data Science im Maschinenbau | RWTH Aachen University | DE Prof. Dr. Sebastian Trimpe Universitätsprofessor Bild © Martin Braun Institut für Data Science in Maschinenbau Universitätsprofessor, Institutsleiter Gebäude: 6074 Raum: 4-21 Theaterstr. 35-39 52062 Aachen Work Telefon: +49 241 80 92071 (Office) Work office@dsme.rwth-aachen.de Sprechstunde Dienstag, 8:20-9:20 (mit vorheriger Anmeldung) Scientific Vita since 2020 Full Professor and Head of Institute for Data Science in Mechanical Engineering, RWTH Aachen University since 2023 Co-Executive Director, RWTH Center for Artificial Intelligence (AI Center) 2018 - 2022 Max Planck Research Group Leader, Max Planck Institute for Intelligent Systems, Stuttgart 2013 - 2018 Research Scientist/Senior Research Scientist, Max Planck Institute for Intelligent Systems, Tübingen 2013 Dr. sc. (Ph.D.), Inst. Dynamic Systems and Control (Prof. Raffaello D’Andrea), ETH Zurich 2007 Dipl.-Ing. (M.Sc.), Electrical Engineering, TU Hamburg 2007 MBA, Technology Management, TU Hamburg 2007 Visiting Research Scholar, University of California, Berkeley 2005 B.Sc., General Engineering, TU Hamburg Academic Activities (select) since 2021 Member of the Board, Rheinstahl Stiftung since 2021 Associated Researcher and Co-Lead Expert Group on AI in Cluster of Excellence “Internet of Production” since 2020 Board of Directors, RWTH Center for Artificial Intelligence since 2018 Faculty/Associate Faculty International Max Planck Research School on Intelligent Systems 2018 - 2020 Co-Speaker PN4 and Participating Researcher in Cluster of Excellence Cluster of Excellence “Data-integrated Simulation Science” (SimTech, EXC 2075) University of Stuttgart, Co-speaker of Project Network (PN) 4 2017 - 2020 Institute Scientific Staff Representative at Max Planck Society, Representative elected by all scientific staff members at the MPI-IS Tübingen/Stuttgart to the Section Meetings of the Chemistry, Physics and Technology (CPT) Section of the Max Planck Society 2019 - 2022 Associate Editor / Conference Editorial Board IEEE Control Systems Society, including main control conferences CDC, ACC ongoing Reviewing and editorial activities for main conferences in control (e.g., CDC, ACC, L4DC, ECC, IFAC), machine learning (TMLR, NeurIPS, ICML), and robotics (ICRA, IROS, RSS) ​ Publications Google Scholar Bio Statement Sebastian Trimpe is a Full Professor (W3) at RWTH Aachen University, where he heads the Institute for Data Science in Mechanical Engineering (DSME) since May 2020. Additionally, he is a founding director of the RWTH Center for Artificial Intelligence and, as of 2023, serves as one of its two Executive Directors. Sebastian's research focuses on fundamental questions at the crossroads of machine learning, control, networked systems, and robotics, with innovative applications thereof. Prior to his role at RWTH, he was a Max Planck Research Group Leader (W2) at the Max Planck Institute for Intelligent Systems in Tübingen/Stuttgart. Sebastian earned his Ph.D. degree in 2013 from ETH Zurich, working with Raffaello D'Andrea at the Institute for Dynamic Systems and Control. His academic journey includes a B.Sc. in General Engineering Science (2005), an M.Sc. (Dipl.-Ing.) in Electrical Engineering (2007), and an MBA degree in Technology Management (2007), all from Hamburg University of Technology. Sebastian is recipient of the triennial IFAC World Congress Interactive Paper Prize (2011), the Klaus Tschira Award for achievements in public understanding of science (2014), the Best Paper Award of the International Conference on Cyber-Physical Systems (2019), and the Future Prize by the Ewald Marquardt Stiftung for innovations in control engineering (2020).",
  "content_length": 3759,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:20"
}