{
  "name": "Sebastian Altmeyer",
  "homepage": "https://www.uni-augsburg.de/de/fakultaet/fai/informatik/prof/embsys/team/prof-dr-sebastian-altmeyer",
  "status": "success",
  "content": "Prof. Dr. Sebastian Altmeyer Lehrstuhl für Embedded Systems Universität Fakultäten Fakultät für Angewandte Informatik Institut für Informatik Lehrstühle und Professuren der Informatik Embedded Systems Team Prof. Dr. Sebastian Altmeyer Prof. Dr. Sebastian Altmeyer Professor Lehrstuhl für Embedded Systems Telefon: +49 821 598 - 2352 Fax: +49 821 598 - 2359 E-Mail: altmeyer@es-augsburges-augsburg.de () Raum: 3020 (N) Sprechzeiten: nur nach vorheriger Vereinbarung Adresse: Universitätsstraße 6a, 86159 Augsburg Kontakt (.vcf) Werdegang Aug. 2019 Professor an der Universität Augsburg Sept. 2017 - Juli 2019 Assistenzprofessor an der Universität von Amsterdam März 2016 -  Aug. 2017 PostDoc an der Universität von Amsterdam März 2015 - März 2016 PostDoc an Universität Luxemburg Jan. 2013 -       März 2015 PostDoc an der Universität von Amsterdam Oktober 2012 Promotion an der Universität des Saarlandes PGP-Schlüssel Schlüsselkennung B7D79111EF2F94D2 Fingerabruck 4780 4F49 63D6 152C 5C41 1321 B7D7 9111 EF2F 94D2 Öffentlicher Schlüssel altmeyer.asc Publikationen 2025 | 2024 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 2025 Tilmann L. Unte and Sebastian Altmeyer. 2025. ECRTS2025 Systematic mapping study on real-time system evaluation techniques [Data set]. 37th Euromicro Conference on Real-Time Systems (ECRTS 2025), July 8-11, 2025, Brussels, Belgium (Online-Ressource). Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Saarbrücken DOI: 10.4230/artifacts.23679BibTeX | RIS | DOI Axel Wiedemann, Florian Haas and Sebastian Altmeyer. 2025. Manatee: a multicore interference analysis tool for embedded soc evaluation. Computer Science and Information Systems 22, 2, 591-621. DOI: 10.2298/csis240724024wBibTeX | RIS | DOI Tilmann L. Unte and Sebastian Altmeyer. 2025. Real-time system evaluation techniques: a systematic mapping study. In Renato Mancuso (Ed.). 37th Euromicro Conference on Real-Time Systems (ECRTS 2025), July 8-11, 2025, Brussels, Belgium. Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Saarbrücken, 12:1-12:21 DOI: 10.4230/LIPIcs.ECRTS.2025.12PDF | BibTeX | RIS | DOI 2024 Arvind Easwaran and Sebastian Altmeyer. 2024. Performance guarantees in dynamic networks and graph algorithms [Editorial]. Real-Time Systems 60, 2, 197-198. DOI: 10.1007/s11241-024-09424-6PDF | BibTeX | RIS | DOI Alexander Stegmeier, Peter Knauer, Philipp Schubaur, Christian Piatka, Dominik Merli and Sebastian Altmeyer. 2024. Safe and secure? On the timing analysability of cryptographic implementations. In Iain Bate, Benny Akesson, Xiaotian Dai (Eds.). 2024 IEEE 30th Real-Time and Embedded Technology and Applications Symposium (RTAS), 13-16 May 2024, Hong Kong, Hong Kong. IEEE, Piscataway, NJ, 68-80 DOI: 10.1109/rtas61025.2024.00014PDF | BibTeX | RIS | DOI Gautam Gala, Tilmann L. Unte, Luiz Maia, Johannes Kühbacher, Isser Kadusale, Mohammad Ibrahim Alkoudsi, Gerhard Fohler and Sebastian Altmeyer. 2024. Safety-critical edge robotics architecture with bounded end-to-end latency. In 3rd International Workshop on Real-Time Cloud systems (RT-Cloud), held in conjunction with the 36th Euromicro Conference on Real-time Systems (ECRTS) 2024, Lille, France, 9 July 2024. arXiv, arXiv:2406.14391 DOI: 10.48550/arxiv.2406.14391PDF | BibTeX | RIS | DOI | URL 2022 Benny Akesson, Mitra Nasri, Geoffrey Nelissen, Sebastian Altmeyer and Robert I. Davis. 2022. A comprehensive survey of industry practice in real-time systems. Real-Time Systems 58, 3, 358-398. DOI: 10.1007/s11241-021-09376-1PDF | BibTeX | RIS | DOI Sebastian Altmeyer and Jean-Luc Scharbarg. 2022. Editorial on the special issue of RTNS 2020. Real-Time Systems 58, 1, 1-3. DOI: 10.1007/s11241-022-09378-7PDF | BibTeX | RIS | DOI Rico Amslinger, Christian Piatka, Florian Haas, Sebastian Weis, Theo Ungerer and Sebastian Altmeyer. 2022. Multiversioning hardware transactional memory for fail-operational multithreaded applications. Reports / Technische Berichte der Fakultät für Angewandte Informatik der Universität Augsburg 2022-01. Institut für Informatik, Universität Augsburg, Augsburg.PDF | BibTeX | RIS Christoph Kühbacher, Theo Ungerer and Sebastian Altmeyer. 2022. Redundant dataflow applications on clustered manycore architectures. In Jiman Hong, Miroslav Bures, Juw Won Park, Tomas Cerny (Eds.). SAC '22: proceedings of the 37th ACM/SIGAPP Symposium on Applied Computing, virtual event, April 25 - 29, 2022. ACM, New York, NY, 226-235 DOI: 10.1145/3477314.3507272PDF | BibTeX | RIS | DOI 2021 Julius Roeder, Benjamin Rouxel, Sebastian Altmeyer and Clemens Grelck. 2021. Energy-aware scheduling of multi-version tasks on heterogeneous real-time systems. In Chih-Cheng Hung, Jiman Hong, Alessio Bechini and Eunjee Song (Ed.). SAC '21: The 36th ACM/SIGAPP Symposium on Applied Computing Virtual Event, Republic of Korea, March 22 - 26, 2021. ACM, New York, NY, 501-510. DOI: 10.1145/3412841.3441930PDF | BibTeX | RIS | DOI Benjamin Rouxel, Sebastian Altmeyer and Clemens Grelck. 2021. YASMIN: a real-time middleware for COTS heterogeneous platforms. In Kaiwen Zhang, Abdelouahed Gherbi, Nalini Venkatasubramanian and Luís Veiga (Ed.). Middleware '21: Proceedings of the 22nd International Middleware Conference, Québec city, Canada, December 6 - 10, 2021. ACM, New York, NY, 298-309. DOI: 10.1145/3464298.3493402PDF | BibTeX | RIS | DOI 2020 Benny Akesson, Mitra Nasri, Geoffrey Nelissen, Sebastian Altmeyer and Robert Ian Davis. 2020. An empirical survey-based study into industry practice in real-time. In X. Sharon Hu, Jian-Jia Chen, Avira Shrivastava, Nan Guan and Tam Chantem (Ed.). 2020 IEEE Real-Time Systems Symposium (RTSS), 1-4 December 2020, Houston, TX, USA. IEEE, Piscataway, NJ, 3-11. DOI: 10.1109/RTSS49844.2020.00012PDF | BibTeX | RIS | DOI Rico Amslinger, Christian Piatka, Florian Haas, Sebastian Weis, Theo Ungerer and Sebastian Altmeyer. 2020. Hardware multiversioning for fail-operational multithreaded applications. In Miguel Areias, Jorge Barbosa, Inês Dutra (Eds.). 2020 IEEE 32nd International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD), 9-11 Sept. 2020, Porto, Portugal. IEEE, Piscataway, NJ, 20-27 DOI: 10.1109/sbac-pad49847.2020.00014PDF | BibTeX | RIS | DOI Filip Marković, Jan Carlson, Sebastian Altmeyer and Radu Dobrin. 2020. Improving the accuracy of cache-aware response time analysis using preemption partitioning. In Marcus Völp (Ed.). 32nd Euromicro Conference on Real-Time Systems (ECRTS 2020). Schloss Dagstuhl, Leibniz-Zentrum für Informatik, Dagstuhl (Leibniz International Proceedings in Informatics (LIPIcs) ; 165), 5:1-5:23. DOI: 10.4230/LIPIcs.ECRTS.2020.5PDF | BibTeX | RIS | DOI Christian Piatka, Rico Amslinger, Florian Haas, Sebastian Weis, Sebastian Altmeyer and Theo Ungerer. 2020. Investigating transactional memory for high performance embedded systems. Lecture Notes in Computer Science 12155, 97-108. DOI: 10.1007/978-3-030-52794-5_8PDF | BibTeX | RIS | DOI Architecture of Computing Systems – ARCS 2020: 33rd International Conference, Aachen, Germany, May 25–28, 2020, Proceedings Jun Xiao, Sebastian Altmeyer and Andy D. Pimentel. 2020. Schedulability analysis of global scheduling for multicore systems with shared caches. IEEE Transactions on Computers 69, 10, 1487-1499. DOI: 10.1109/tc.2020.2974224PDF | BibTeX | RIS | DOI Julius Roeder, Benjamin Rouxel, Sebastian Altmeyer and Clemens Grelck. 2020. Towards energy-, time- and security-aware multi-core coordination. Lecture Notes in Computer Science 57-74. DOI: 10.1007/978-3-030-50029-0_4PDF | BibTeX | RIS | DOI 2019 Claire Maiza, Hamza Rihani, Juan M. Rivas, Joël Goossens, Sebastian Altmeyer and Robert I. Davis. 2019. A survey of timing verification techniques for multi-core real-time systems. ACM Computing Surveys 52, 3, 1-38. DOI: 10.1145/3323212PDF | BibTeX | RIS | DOI Julius Roeder, Benjamin Rouxel, Sebastian Altmeyer and Clemens Grelck. 2019. Interdependent multi-version scheduling in heterogeneous energy-aware embedded systems. In Benjamin Rouxel, Antonio Paolillo (Eds.). Proceedings of the 13th Junior Researcher Workshop on Real-Time Computing, JRWRTC 2019, Toulouse, France, November 6-8, 2019. IRIT - Institut de Recherche en Informatique de Toulouse, Toulouse, 45-48PDF | BibTeX | RIS | URL Reinder J. Bril, Sebastian Altmeyer and Paolo Gai. 2019. Stack memory requirements of AUTOSAR/OSEK-compliant scheduling policies. In Jiming Chen and Eduardo Tovar (Ed.). 2019 IEEE 25th International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA), 18-21 August 2019, Hangzhou, China. IEEE, Piscataway, NJ DOI: 10.1109/rtcsa.2019.8864554PDF | BibTeX | RIS | DOI 2018 Robert I. Davis, Sebastian Altmeyer, Leandro S. Indrusiak, Claire Maiza, Vincent Nelis and Jan Reineke. 2018. An extensible framework for multicore response time analysis. Real-Time Systems 54, 3, 607-661. DOI: 10.1007/s11241-017-9285-4PDF | BibTeX | RIS | DOI Sebastian Altmeyer, Reinder J. Bril and Paolo Gai. 2018. EMPRESS: an efficient and effective method for PREdictable stack sharing. In Rodolfo Pellizzoni, Insik Shin and Kaori Fujinami (Ed.). 2018 IEEE 24th International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA), 28-31 August 2018, Hakodate, Japan. IEEE, Piscataway, NJ, 92-100. DOI: 10.1109/rtcsa.2018.00020PDF | BibTeX | RIS | DOI Robert I. Davis, Sebastian Altmeyer and Alan Burns. 2018. Mixed criticality systems with varying context switch costs. In Rodolfo Pellizzoni (Ed.). 2018 IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), 11-13 April 2018, Porto, Portugal. IEEE, Piscataway, NJ, 140-151. DOI: 10.1109/rtas.2018.00024PDF | BibTeX | RIS | DOI Benjamin Lesage, David Griffin, Sebastian Altmeyer, Liliana Cucu-Grosjean and Robert I. Davis. 2018. On the analysis of random replacement caches using static probabilistic timing methods for multi-path programs. Real-Time Systems 54, 2, 307-388. DOI: 10.1007/s11",
  "content_length": 32345,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:11"
}