{
  "name": "Seeun William Umboh",
  "homepage": "http://williamumboh.com",
  "status": "success",
  "content": "Seeun William Umboh My research is broadly in theoretical computer science and combinatorial optimisation. I am particularly interested in approximation and online algorithms for optimisation problems involving graphs, metric spaces, and submodularity. One of the main themes in my research is bridging the theory and practice of optimisation under uncertainty. Recently, I have started collaborating with colleagues outside of theoretical computer science to improve the use of algorithms in specific real-world settings such as ride-sharing. Previously, I was a Lecturer in Algorithms and Honours Coordinator at the School of Computer Science, University of Sydney. Before that, I was fortunate to be a postdoc with Prof. Nikhil Bansal at TU Eindhoven. I was also a Visiting Professor at the Hebrew University of Jerusalem (hosted by Prof. Yair Bartal) from Oct 2017 - Jan 2018 and a Visiting Postdoc at the Simons Institute for the Algorithms and Uncertainty (Fall 2016) and Fine-Grained Complexity (Fall 2017) programs. I received my PhD in Computer Science at the University of Wisconsin-Madison, where I was blessed to be co-advised by Profs. Shuchi Chawla and Eric Bach. I also have an MSc in Computer Science and a BSc majoring in Computer Science and Mathematics, all from UW-Madison. News 2025-Mar-26 I am excited to join the STACS 2026 PC! 2025-Mar-4 I am excited to join the WAOA 2025 PC! 2025-Feb-24 I am excited to join the ISAAC 2025 PC! 2025-Jan-17 I am thrilled to accept an invitation to Dagstuhl Seminar 25471 on Online Algorithms beyond Competitive Analysis! 2024-Dec-14 Paper accepted at STACS 2025: Colorful Vertex Recoloring of Bipartite Graphs with Boaz Patt-Shamir and Adi Rosen. 2024-Sep-12 New paper in Transportation Research Part B: “Freelance drivers with a decline choice: dispatch menus in on-demand mobility services for assortment optimization” with Yue Yang (first author) and Mohsen Ramezani. I am excited by this paper as it’s my first paper with non-CS collaborators (coauthors are from Civil Engineering) and we were able to use theory to come up with practical algorithms. 2024-Sep-12 I am excited to join the ICALP 2025 PC! 2024-Aug-13 Paper accepted at PODS 2025: Optimal Dynamic Parameterized Subset Sampling with Junhao Gan, Hanzhi Wang, Anthony Wirth and Zhuo Zhang. 2024-Jul-23 Paper accepted to SPIRE 2024! Online Computation of String Net Frequency with Peaker Guo, Anthony Wirth and Justin Zobel. 2024-Jul-3 2 papers accepted to APPROX 2024! Universal Optimization for Non-Clairvoyant Subadditive Joint Replenishment with Tomer Ezra, Stefano Leonardi, Michał Pawłowski and Matteo Russo. Maximum Unique Coverage on Streams: Improved FPT Approximation Scheme and Tighter Space Lower Bound with Philip Cervenjak, Junhao Gan and Anthony Wirth. 2024-Mar-1 I am delighted to join the PhD supervision teams of Phil Cervenjak (supervised with Junhao Gan and Tony Wirth), Zhuo Zhang (supervised with Junhao Gan and Tony Wirth), and Peaker Guo (supervised with Tony Wirth and Justin Zobel) 2024-Feb-5 I am excited to join the ESA 2024 PC! 2024-Jan-29 I am excited to host Prof. Seffi Naor (ACM Fellow) from the Technion for a month-long visit as part of the FEIT Visiting Fellows Scheme. 2024-Jan-29 I am excited to join the FSTTCS24 PC! 2024-Jan-10 I am excited to join the SODA 2025 PC! 2023-Oct-30 Our DP24 project “Algorithms for Future-Proof Networks” with Joachim Gudmundsson, André van Renssen, and Mark de Berg has been funded by the Australian Research Council for $547,662! Grateful to be part of this amazing team! 2023-Oct-25 I will be on the TAMC 2024 PC. 2023-Aug-11 I am excited to be an Associate Investigator with OPTIMA 2023-Aug-7 New paper in Algorithmica: “The Online Broadcast Range-Assignment Problem” with Mark de Berg and Aleksandar Markovic. This is a journal version of our paper in ISAAC 2020. 2023-Jun-23 New paper in APPROX 2023: “Online Matching with Set and Concave Delays” with Lindsey Deryckere. This is based on Lindsey’s MPhil thesis, supervised by me, and her first academic paper. Congrats Lindsey 2023-Apr-19 I am excited to join the School of Computing and Information Systems at the University of Melbourne Publications",
  "content_length": 4198,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:24"
}