{
  "name": "Sefki Kolozali",
  "homepage": "https://www.essex.ac.uk/people/koloz89402/sefki-kolozali",
  "status": "success",
  "content": "Sefki Kolozali | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Sefki Kolozali People Dr Sefki Kolozali Lecturer School of Computer Science and Electronic Engineering (CSEE) Email sefki.kolozali@essex.ac.uk Telephone +44 (0) 1206 873302 Location 5A.523, Colchester Campus Academic support hours Mondays between 11:30 and 12:30 Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I am a Lecturer in Embedded and Intelligent Systems at the University of Essex, and I am part of the Robotics and Embedded Systems Research Group. My interests include the fields of Internet of Things, Edge Computing, Machine Learning, Time Series Analysis, Signal Processing, Semantic Web, Federated Learning and their applications to various healthcare scenarios. Additionally, I have a particular interest in high-order tensor decompositions, multi-aspect learning, multimodal learning, explainable AI, and energy-efficient AI technologies. I am a member of the EPSRC Peer Review College and a registered expert with the European Commission. Additionally, I serve as an editor at PLOS ONE and as a reviewer for both the EPSRC and the European Commission. Furthermore, I act as a reviewer for several prominent journals, including the IEEE Internet of Things Journal, ACM Transactions on Internet of Things, IEEE Transactions on Emerging Topics in Computing, IEEE Transactions on Industrial Informatics, and Neural Computing and Applications. I am leading the Internet of Things and Machine Intelligence Lab as part of the Future Health Technologies cluster. Previously, I was a Postdoctoral Research Fellow at the Institute of Analytics and Data Science, University of Essex. Before that I worked as a Research Associate in Applied Big Data Analysis at the MRC-PHE Centre for Environment and Health, King's College London. I worked on exploring links between the environment and human health through the analysis of very large time series datasets. I was part of the COPE study team, which aimed to reduce the frequency of hospital and GP visits by patients with respiratory disease. I also worked as a Research Fellow in large-scale data analytics for the Internet of Things at the 5G innovation centre, University of Surrey, where I was a work package leader in large scale data analysis and seamless integration of data sources in the CityPulse project. I received a B.Sc. degree in Computer Engineering from Near East University (NEU), Nicosia, Turkish Republic of Northern Cyprus (TRNC), in 2005. I received an M.Sc. degree from the University of Essex and a PhD degree from Queen Mary University of London (QMUL). My thesis was titled Automatic Ontology Generation Based on Semantic Audio Analysis. I received full scholarship for BSc from the NEU and TRNC, and full scholarship for PhD from the NEMA and EPSRC projects at QMUL. I am always happy to hear from motivated prospective PhD students. If you are interested in working on intelligent systems, multimodal learning, or healthcare monitoring technologies, please do not hesitate to get in touch. Qualifications PhD on Automatic Ontology Generation Based on Semantic Audio Analysis Queen Mary University of London, (2013) MSc in E-Commerce Technologies University of Essex, (2008) BSc in Computer Engineering Near East University, (2005) Appointments University of Essex Postdoctoral Research Fellow, Institute for Analytics and Data Science, University of Essex (2/7/2018 - 14/1/2020) Other academic Lecturer in Embedded and Intelligent Systems, School of Computer Science and Electronic Engineering, University of Essex (15/1/2020 - present) Research Associate in Applied Big Data Analysis, MRC-PHE Centre for Environment and Health, Faculty of Life Sciences, King's College London (1/9/2016 - 30/4/2018) Research Fellow in Large-scale data analytics for the Internet of Things, 5G Innovation Centre, Institute for Communication Systems (ICS), University of Surrey (4/2/2014 - 31/8/2016) Research and professional activities Research interests Internet of Things Machine Learning Semantic Web Signal Processing Time Series Analysis Internet of Things in Healthcare Multi-aspect Learning Multimodal Learning Explainable AI Energy Efficient AI Models High-order Tensor Decompositions Edge Computing Federated Learning Teaching and supervision Current teaching responsibilities Team Project Challenge (CE201) Digital Signal Processing (CE335) Current supervision Thanh Dat Ngo Thesis title: Novel Low-Cost and Artificial Intelligence Driven Audio Signal Processing for Respiratory Monitoring and Rehabilitation Degree subject: Computer Science Degree type: Doctor of Philosophy Abdul Wafeeq Ali Abdul Asik Ali Degree subject: Artificial Intelligence Degree type: Doctor of Philosophy Publications Publications (1) Ngo, D., Pham, L., Phan, H., Tran, M., Jarchi, D. and Kolozali, S., (2023). An Inception-Residual-Based Architecture with Multi-Objective Loss for Detecting Respiratory Anomalies Journal articles (12) Kolozali, S., Fasli, M., White, SL., Norris, S. and van Heerden, A., (2024). Explainable Early Prediction of Gestational Diabetes Biomarkers by Combining Medical Background and Wearable Devices: A Pilot Study with a Cohort Group in South Africa. IEEE Journal of Biomedical and Health Informatics. 28 (4), 1860-1871 Kolozali, S., Chatzidiakou, L., Rones, R., Quint, JK., Kelly, F. and Barratt, B., (2023). Early Detection of COPD Patients’ Symptoms with Personal Environmental Sensors: A Remote Sensing Framework using Probabilistic Latent Component Analysis with Linear Dynamic Systems. Neural Computing and Applications. 35 (23), 17247-17265 van Heerden, A., Kolozali, Ş. and Norris, SA., (2023). Feasibility and acceptability of continuous at-home glucose monitoring during pregnancy: a mixed-methods pilot study. South African Journal of Clinical Nutrition. 36 (3), 100-107 Wachter, EW., Kasap, S., Kolozali, S., Zhai, X., Ehsan, S. and McDonald-Maier, K., (2022). Using Machine Learning for Anomaly Detection on a System-on-Chip under Gamma Radiation. Nuclear Engineering and Technology. 54 (11), 3985-3995 Van Heerden, A., Comulada, WS., Kolozali, Ş. and Kohrt, B., (2021). Drawing open the curtain on home-based interventions.. mHealth. 7 (2), 18-18 van den Brink, L., Barnaghi, P., Tandy, J., Atemezing, GA., Atkinson, R., Cochrane, B., Fathy, Y., García-Castro, R., Haller, A., Harth, A., Janowicz, K., Kolozali, S., van Leeuwen, B., Lefrançois, M., Lieberman, J., Perego, A., Le Phuoc, D., Roberts, B., Taylor, K. and Troncy, R., (2019). Best Practices for Publishing, Retrieving, and Using Spatial Data on the Web. Semantic Web. 10 (1), 95-114 Kolozali, S., Bermudez-Edo, M., FarajiDavar, N., Barnaghi, P., Gao, F., Intizar Ali, M., Mileo, A., Fischer, M., Iggena, T., Kuemper, D. and Tonjes, R., (2019). Observing the Pulse of a City: A Smart City Framework for Real-time Discovery, Federation, and Aggregation of Data Streams. IEEE Internet of Things Journal. 6 (2), 2651-2668 Quint, JK., Moore, E., Lewis, A., Hashmi, M., Sultana, K., Wright, M., Smeeth, L., Chatzidiakou, L., Jones, R., Beevers, S., Kolozali, S., Kelly, F. and Barratt, B., (2018). Recruitment of patients with Chronic Obstructive Pulmonary Disease (COPD) from the Clinical Practice Research Datalink (CPRD) for research. npj Primary Care Respiratory Medicine. 28 (1), 21- Hashmi, M., Wright, M., Sultana, K., Barratt, B., Chatzidiakou, L., Moore, E., Kolozali, Ş., Jones, RL., Beevers, S., Smeeth, L., Kelly, FJ. and Quint, JK., (2018). Preliminary results from the COPE study using primary-care electronic health records and environmental modelling to examine COPD exacerbations. British Journal of General Practice. 68 (suppl 1), bjgp18X696749-bjgp18X696749 Kolozali, S., Puschmann, D., Bermudez-Edo, M. and Barnaghi, P., (2016). On the Effect of Adaptive and Nonadaptive Analysis of Time-Series Sensory Data. IEEE Internet of Things Journal. 3 (6), 1084-1098 Puiu, D., Barnaghi, P., Tonjes, R., Kumper, D., Ali, MI., Mileo, A., Xavier Parreira, J., Fischer, M., Kolozali, S., Farajidavar, N., Gao, F., Iggena, T., Pham, T-L., Nechifor, C-S., Puschmann, D. and Fernandes, J., (2016). CityPulse: Large Scale Data Analytics Framework for Smart Cities. IEEE Access. 4, 1086-1108 Kolozali, S., Barthet, M., Fazekas, G. and Sandler, M., (2013). Automatic Ontology Generation for Musical Instruments Based on Audio Analysis. IEEE Transactions on Audio, Speech, and Language Processing. 21 (10), 2207-2220 Show all Conferences (15) Kolozali, S., Chatzidiakou, L., Jones, R., Quint, JK., Kelly, F. and Barratt, B., A probabilistic multi-aspect learning model for the early detection of COPD patients' symptoms Turetta, C., Varasteh, M., Kolozali, Ş. and Pravadelli, G., (2024). Leveraging mmWave for Contactless Breath Rate Estimation of Moving Subjects Ngo, D., Pham, L., Phan, H., Tran, M., Jarchi, D. and Kolozali, Ş., (2023). An Inception-Residual-Base",
  "content_length": 14061,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:25"
}