{
  "name": "Sehoon Ha",
  "homepage": "https://faculty.cc.gatech.edu/~sha9",
  "status": "success",
  "content": "Sehoon Ha Sehoon Ha Assistant Professor, School of Interactive Computing, Georgia Institute of Technology Contact: sehoonha@gatech.edu | CV Office: Klaus 3226 Address: 266 Ferst Dr NW, Atlanta, GA 30332 I'm an assistant professor at Georgia Institute of Technology. Before joining Georgia Tech, I was a research scientist at Google and Disney Research Pittsburgh. I received my PhD in Computer Science from the Georgia Institute of Technology in 2015. My advisor was Dr. C. Karen Liu. I have a B.S. degree in Computer Science from KAIST in 2009. I am interested in character animation, robotics, and artificial intelligence. Google Scholar | Twitter | How to Join HA Lab Jump to Students News Our paper, VLFM has received the best cognitive paper award in ICRA 2024! Coc News I have received new collaborative research grants from SAMSUNG Research and ETRI. Georgia Tech (PI: me and Prof. Jennifer Kim) is leading a $7M research project in collaboration with Neuromeka, ETRI, and KAIST to develop a mobile humanoid. Chosun News (Korean) MK News (Korean) I have received the NSF CAREER award! (January, 2024) CoC News We started new collaborative projects with Amazon Consumer Robotics and ETRI (2023). We received the collaborative project from KEIT (~$700,000) with KAIST, ETRI, KIRO, and Rastech (2022). We started new collaborative projects with Google, META, and MORAI (2022). The recent work \"Learning to Navigate Sidewalks in Outdoor Environments\" is covered by Techxplore (October, 2021). Our team (Naoki, Qian, Sehoon, and Dhruv) won the iGibson Challenge 2021 @ CVPR! (June, 2021) Classes Deep Reinforcement Learning (Spring 2022-) Syllabus 2022 Computer Animation (Fall 2020-) Syllabus 2023 Programming Interview Preparation (Fall 2020) Syllabus 2020 Publications Multi-Agent Deep Reinforcement Learning for Effective Coordination of Robot Swarms in Crowded Conditions Kehinde Aina and Sehoon Ha SWARM 2022 arxiv youtube web Learning to Navigate Sidewalks in Outdoor Environments Maks Sorokin, Jie Tan, C. Karen Liu, Sehoon Ha IEEE Robotics and Automation Letters (RA-L) 2022 arxiv youtube Finite State Machine Policies Modulating Trajectory Generator Ren Liu, Nitish Sontakke, Sehoon Ha IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2022 arxiv youtube Benchmarking Augmentation Methods for Learning Robust Navigation Agents: the Winning Entry of the 2021 iGibson Challenge Naoki Yokoyama, Qian Luo, Dhruv Batra, Sehoon Ha IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2022 arxiv youtube Solving Challenging Control Problems Using Two-Staged Deep Reinforcement Learning Nitish Sontakke and Sehoon Ha International Conference on Ubiquitous Robots (UR) 2023 arxiv Learning Robot Structure and Motion Embeddings using Graph Neural Networks J. Taery Kim, Jeongeun Park, Sungjoon Choi, Sehoon Ha ICML ML4CompDesign Workshop 2022 arxiv website Google AI Blog Safe Reinforcement Learning for Legged Locomotion Tsung-Yen Yang, Wenhao Yu, Tingnan Zhang, Sehoon Ha, Jie Tan IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2022 arxiv youtube Improving Safety in Deep Reinforcement Learning using Unsupervised Action Planning Hao-Lun Hsu, Qiuhua Huang, Sehoon Ha IEEE International Conference on Robotics and Automation (ICRA) 2021 arxiv youtube Graph-based Cluttered Scene Generation and Interactive Exploration using Deep Reinforcement Learning K. Niranjan Kumar, Irfan Essa, Sehoon Ha IEEE International Conference on Robotics and Automation (ICRA) 2021 pdf youtube Learning Agile Motor Skills on Quadrupedal Robots using Curriculum Learning Zuoxin Tang, Donghyun Kim, Sehoon Ha International Conference on Robot Intelligence Technology and Applications 2021 web Legged Robots that Keep on Learning: Fine-Tuning Locomotion Policies in the Real World Laura Smith, Chase Kew, Xue Bin Peng, Sehoon Ha, Jie Tan, Sergey Levine IEEE International Conference on Robotics and Automation (ICRA) 2021 openreview Visual-Locomotion: Learning to Walk on Complex Terrains with Vision Wenhao Yu, Deepali Jain, Alejandro Escontrela, Atil Iscen, Peng Xu, Erwin Coumans, Sehoon Ha, Jie Tan, and Tingnan Zhang Conference on Robot Learning (CoRL) 2021 arxiv video Success Weighted by Completion Time: A Dynamics-Aware Evaluation Criteria for Embodied Navigation Naoki Yokoyama, Sehoon Ha, Dhruv Batra IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2021 arxiv Error-Aware Policy Learning: Zero-Shot Generalization in Partially Observable Dynamic Environments Visak C.V. Kumar, Sehoon Ha, C. Karen Liu Proceedings of Robotics: Science and Systems (RSS) 2021 pdf PODS: Policy Optimization via Differentiable Simulation Miguel Angel Zamora Mora, Momchil Peychev, Sehoon Ha, Martin Vechev, Stelian Coros International Conference on Machine Learning (ICML) 2021 arxiv video Learning Human Search Behavior from Egocentric Visual Inputs Maks Sorokin, Wenhao Yu, Sehoon Ha, C. Karen Liu Computer Graphics Forum (The proceeding of Eurographics 2021) arxiv Learning to be Safe: Deep RL with a Safety Critic Krishnan Srinivasan, Benjamin Eysenbach, Sehoon Ha, Jie Tan, Chelsea Finn Computer Graphics Forum (The proceeding of Eurographics 2021) arxiv video A Few Shot Adaptation of Visual Navigation Skills to New Observations using Meta-Learning Qian Luo, Maks Sorokin, Sehoon Ha IEEE International Conference on Robotics and Automation (ICRA) 2021 arxiv Observation Space Matters: Benchmark and Optimization Algorithm Joanne Taery Kim and Sehoon Ha IEEE International Conference on Robotics and Automation (ICRA) 2021 arxiv video Learning to Walk in the Real World with Minimal Human Effort Sehoon Ha, Peng Xu, Zhenyu Tan, Sergey Levine, Jie Tan Conference on Robot Learning (CoRL) 2020 Articles: MIT Technology Review Business Insider Digital Trends NowThis News PopMech arxiv video Zero-shot Imitation Learning from Demonstrations for Legged Robot Visual Navigation Xinlei Pan, Tingnan Zhang, Brian Ichter, Aleksandra Faust, Jie Tan, Sehoon Ha IEEE International Conference on Robotics and Automation (ICRA) 2020 arxiv video Learning Fast Adaptation with Meta Strategy Optimization Wenhao Yu, Jie Tan, Yunfei Bai, Erwin Coumans, Sehoon Ha IEEE Robotics and Automation Letters (RA-L) 2020 arxiv Learning a Control Policy for Fall Prevention on an Assistive Walking Device Visak C.V. Kumar, Sehoon Ha, Gergory Sawicki, C. Karen Liu IEEE International Conference on Robotics and Automation (ICRA) 2020 arxiv video WIRED Learning to Walk via Deep Reinforcement Learning Tuomas Haarnoja*, Sehoon Ha*, Aurick Zhou, Jie Tan, George Tucker, Sergey Levine *Two First Authors equally contributed. Proceedings of Robotics: Science and Systems (RSS) 2019 arxiv Soft Actor-Critic Algorithms and Applications Tuomas Haarnoja, Aurick Zhou, Kristian Hartikainen, George Tucker, Sehoon Ha, Jie Tan, Vikash Kumar, Henry Zhu, Abhishek Gupta, Pieter Abbeel, Sergey Levine arxiv video Expanding Motor Skills through Relay Neural Networks Visak C.V. Kumar, Sehoon Ha, C. Karen Liu Conference on Robot Learning (CoRL) 2018 IEEE to appear Learning Hardware Dynamics Model from Experiments for Locomotion Optimization Kuo Chen, Sehoon Ha, Katsu Yamane IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2018 pdf video Computational Design of Robotic Devices from High-Level Motion Specifications Sehoon Ha, Stelian Coros, Alexander Alspach, James M. Bern, Joohyung Kim, Katsu Yamane IEEE Transactions on Robotics (T-Ro) 2018 pdf video Automated Deep Reinforcement Learning Environment for Hardware of a Modular Legged Robot Sehoon Ha, Joohyung Kim, Katsu Yamane International Conference on Ubiquitous Robots 2018 pdf video Computational Co-Optimization of Design Parameters and Motion Trajectories for Robotic Systems Sehoon Ha, Stelian Coros, Alexander Alspach, Joohyung Kim, Katsu Yamane International Journal of Robotics Research (IJRR) 2018 pdf Improving Model-Based Balance Controllers Using Reinforcement Learning and Adaptive Sampling Visak C.V. Kumar, Sehoon Ha, Katsu Yamane IEEE International Conference on Robotics and Automation (ICRA) 2018 pdf DART: Dynamic animation and robotics toolkit Jeongseok Lee, Michael X. Grey, Sehoon Ha, Tobias Kunz, Sumit Jain, Yuting Ye, Siddhartha S. Srinivasa, Mike Stilman, and C. Karen Liu The Journal of Open Source Software (JOSS) 2018 pdf Learning a Unified Control Policy for Safe Falling Visak C.V. Kumar, Sehoon Ha, C. Karen Liu IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2017 pdf video Joint Optimization of Robot Design and Motion Parameters using the Implicit Function Theorem [Best Conference Paper Finalist, Top 3] Sehoon Ha, Stelian Coros, Alexander Alspach, Joohyung Kim, Katsu Yamane Proceedings of Robotics: Science and Systems (RSS) 2017 pdf video PBS News Hours Smithsonian Stair Negotiation Made Easier Using Novel Interactive Energy-Recycling Assistive Stairs Yun Seong Song, Sehoon Ha, Hsiang Hsu, Lena H. Ting, C. Karen Liu PLoS One 2017 pdf Task-based Limb Optimization for Legged Robots Sehoon Ha, Stelian Coros, Alexander Alspach, Joohyung Kim, Katsu Yamane IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2016 pdf video Evolutionary Optimization for Parameterized Whole-body Dynamic Motor Skills Sehoon Ha and C. Karen Liu IEEE International Conference on Robotics and Automation (ICRA) 2016 pdf video IEEE Spectrum MIT Technology Review Multiple Contact Planning for Minimizing Damage of Humanoid Falls Sehoon Ha and C. Karen Liu IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2015 pdf video Reducing Hardware Experiments for Model Learning and Policy Optimization Sehoon Ha and Katsu Yamane IEEE International Conference on Robotics and Automation (ICRA) 2015 pdf youtube Iterative Traiing Of Dynamic Skills Inspired By Human Coaching Technique Sehoon Ha and C. Karen Liu ACM Transactions on Graphics 2014 pdf video Physics Storyboards Sehoon Ha, Jim McCa",
  "content_length": 10762,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:26"
}