{
  "name": "Seif Haridi",
  "homepage": "https://www.kth.se/profile/haridi",
  "status": "success",
  "content": "KTH | Seif Haridi Skip to main content Seif HaridiProfessor emeritusKungliga Tekniska Högskolanhttps://www.kth.se/profile/haridiDetailsWorks for Division of Software and Computer SystemsTelephone +46 8 790 41 22Unit address Lindstedtsvägen 30E-mail haridi@kth.seAbout meSeif Haridi is a professor at KTH, the Royal Institute of Technology Sweden Seif Haridi is Chair-Professor of Computer Systems specialized in parallel and distributed computing at KTH Royal Institute of Technology, Stockholm, Sweden. He is also the Chief Scientist of the Swedish Institute of Computer Science (SICS). He led a European research program on Cloud Computing and Big Data by EIT-Digital between 2010 to 2013, and is a co-founder of a number of start-ups in the area of distributed and cloud computing including HiveStreaming and LogicalClocks. He is well-known for the textbook \"Concepts, Techniques, and Models of Computer Programming\" which explains many difficult programming concepts in a simple and insightful way. For more than ten years he has been teaching two popular courses on distributed algorithms and peer-to-peer computing at KTH. His research is focused on the combination of systems research and theory in the areas of programming systems and distributed computing. He is a co-designer of SICStus Prolog, the most well known logic programming system, and the Mozart Programming System, a high-quality open-source development platform based on the Oz multi-paradigm programming language. Recently, together with his research group, he has been contributing to the design of Apache Flink, a Big Data distributed engine for streaming analytics, and HOPS the first European complete platform for data-analytics and machine learning. HOPS-FS the file system of HOPS won IEEE Scale Prize 2017 as the most scalable HDFS filesystem. My Personal webpage: https://people.kth.se/~haridi LinksMy webpageedX course: Reliable distributed algorithms (part 1)edX course: Reliable distributed algorithms (part 2)Google Scholar Citations",
  "content_length": 2019,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:26"
}