{
  "name": "Selim G. Akl",
  "homepage": "http://www.cs.queensu.ca/home/akl",
  "status": "success",
  "content": "AKL BIO Selim G. Akl (Ph.D. McGill, 1978) \"Our discipline, the science of information and computation, is important, not only because of the multitude of useful applications it offers to today's society, but more crucially owing to the fundamental role it plays in unraveling the mysteries of the universe in which we live.\" Selim G. Akl is an Emeritus Professor at Queen's University in the School of Computing, where he leads the Parallel and Unconventional Computation Group. His research interests are primarily in the area of algorithm design and analysis, in particular for problems in parallel computing and unconventional computation. Activities Dr. Akl is Honourary Editor of Parallel Processing Letters (World Scientific Publishing, since 2017, and previously Editor in Chief of the same journal, 2006 - 2017, and a Regional Editor, 1991 - 2006), an Editorial Board Member of International Journal of Parallel, Emergent, and Distributed Systems (Taylor and Francis; 2004 -), International Journal of Unconventional Computing (Old City Publishing; 2011 -), and Communications in Applied Geometry (Research India Publications; 2006 -), an Area Editor (Unconventional Computation) of Scalable Computing and Communications (Springer; 2012 - ), a Founding Editorial Board Member of International Journal of High Performance Computing and Networking (Inderscience Publishers; 2003 -), and a past editor of Journal of Cryptology (Springer-Verlag; 1988 - 1991), Information Processing Letters (North-Holland; 1989 - 1999), Parallel Algorithms and Applications (Taylor and Francis; 1991 - 2004), and Computational Geometry (Elsevier; 1993 - 2017). Dr. Akl was winner in 2004 and 2007 of the Howard Staveley Award for Teaching Excellence. He received the Queen's University Prize for Excellence in Research in 2005 and the Queen's University Award for Excellence in Graduate Supervision in 2012. He served as Director of the Queen's School of Computing (2007 - 2017). In 2018, Dr. Akl was the recipient of a CS-Can/Info-Can Lifetime Achievement Award in Computer Science and in 2020 the Queen's University Distinguished Service Award. In 2024, Dr. Akl was honored as an Inaugural Highly Ranked Scholar by ScholarGPS. The citation reads: \"Congratulations on being named an inaugural Highly Ranked Scholar by ScholarGPS. Dear Dr. Akl, ScholarGPS celebrates Highly Ranked Scholars™ for their exceptional performance in various Fields, Disciplines, and Specialties. Your prolific publication record, the high impact of your work, and the outstanding quality of your scholarly contributions have placed you in the top 0.05% of all scholars worldwide.\" Selim G. Akl Highly Ranked Scholar-Lifetime Selected Publications Dr. Akl is the author of Parallel Sorting Algorithms (Academic Press, 1985), The Design and Analysis of Parallel Algorithms (Prentice Hall, 1989), and Parallel Computation: Models and Methods (Prentice Hall, 1997). He is a co-author of Parallel Computational Geometry (Prentice Hall, 1993), Adaptive Cryptographic Access Control (Springer, 2010), Using Quantum Mechanics to Enhance Information Processing (Scholars' Press, 2012), and Applications of Quantum Cryptography (Lambert, 2016). Journal and Conference Papers, Books, Book Chapters, and Encyclopedia Articles Technical Reports Current Research Posters Recent Theses Supervised Recent Book Recent Book Edited TEDxQueensU Talk Contributions to a Recent Book Chapters in a New Book A Computational Challenge Non-Universality in Computation Inherently Parallel Computations TheChurch-Turing Thesis Is False Computation Is Universal, Computers Are Not Time Travel Play Quantum Chess Quantum Chess on the Web Stephen Hawking Plays Quantum Chess The Quantum Chess Story Natural Computing Slime Mold Computes Slime Mold In The News Computing With DNA Quantum Computers Can Do What Classical Computers Cannot Do Quantum Security for Sensor Networks Communicating Secret Information Without Secret Messages A Festschrift What Is Computation? Nonuniversality In Computation: Thirteen Misconceptions Rectified On Computable Numbers, Nonuniversality, and the Genuine Power of Parallelism Nouniversality Explained Unconventional Wisdom How to Encrypt a Graph Fully Homomorphic Encryption: Simple, Efficient, and Secure Conventional or Unconventional: Is Any Computer Universal? A Map of England, the Simulator Simulated, and Nonuniversality in Computation Unconventional computational problems Evolving computational systems Computational nonuniversality: Philosophical and artistic perspectives Courses Mathematics of Information Technology Natural Computing Conference International Conference on Unconventional Computation 2007 The conference returns to Canada in 2014: International Conference on Unconventional Computation and Natural Computation 2014 Contact Information School of Computing Queen's University Kingston, Ontario, Canada K7L 3N6 Phone: (613) 533-6062 or 533-6050 Fax: (613) 533-6513 akl at cs dot queensu dot ca Last Updated:",
  "content_length": 5003,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:30"
}