{
  "name": "Sema Fatma Oktug",
  "homepage": "http://web.itu.edu.tr/oktug",
  "status": "success",
  "content": "Sema F. (AKGUN) OKTUG, Prof. Dr.IEEE Senior Member After serving for many years as an academic and Dean at Istanbul Technical University, Faculty of Computer and Information Engineering, I retired in 2023. Throughout my academic career, I authored/co-authored over 100 articles and took part in the organization of numerous international conferences. Currently, I consult on computer networks and serve as an evaluator of the Association for Evaluation and Accreditation of Engineering Programs (MUDEK) in Turkiye. I also dwell on how to encourage girls to study engineering or technical fields. Furthermore, I have recently become enhusiastic about olive oil. I am working on the production of high-quality olive oil and the application of modern technological tools to the olive oil production in Turkiye. Moreover, I am conducting research to increase the sustainability of olive groves considering climate change. E-posta/E-mail : oktug@itu.edu.tr       LinkedIn Egitim/Education B.Sc.(1987), M.Sc.(1989), Ph.D.(1996): Dept. of  Computer Engineering, Bogazici University, Istanbul, Turkiye Calisma Deneyimi/Work Experince Istanbul Technical University,  Dept. of Computer Eng., Retired Faculty Member (1998 - 2023) Bogazici University Dept. of Computer Eng., Instructor (1996-1998) NYU Tandon School of Eng (Formerly NewYork Poly.) Dept. of EE, Postdoc (1996) Bogazici University, Dept. of Computer Eng., Research/Teaching Assistant (1987-1996) Yayinlar/Publications:Google Scholar Citations Mesleki Etkinlikler / Professional Activities Konferanslar vb / Symposiums and Conferences Universite Hizmetleri / University Services Dersler / Courses Arastirma Projeleri / Research Projects Ogrenciler / Students Oduller / Awards and Honors Arastirma Alanlari / Research Interests Dusuk Guclu Genis Alan Aglari/Low Power Wide Area Networks Nesnelerin Interneti/Internet of Things (IoT) Akilli Sehir Uygulamalari icin Haberlesme Teknolojileri/Communication Technologies for Smart City Apps Bilgisayar Aglarinin Basarim Modellemesi/Performance Modelling of Computer Networks Telsiz Aglar (duyarga, orgu, bilissel)/Wireless Networks (sensor, mesh, cognitive) By  Sema Oktug, Sep.2025",
  "content_length": 2178,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:31"
}