{
  "name": "Sen Cheng",
  "homepage": "https://www.ini.rub.de/the_institute/people/sen-cheng",
  "status": "success",
  "content": "Prof. Dr. Sen Cheng | People | Institut für Neuroinformatik RUB INI People Prof. Dr. Sen Cheng sen.cheng@rub.de (+49) 234-32-29486 Prof. Dr. Sen Cheng Computational Neuroscience Computational Neuroscience Ruhr-Universität Bochum Institut für Neuroinformatik Universitätsstraße 150 Building NB, Room NB 3/33 D-44801 Bochum, Germany sen.cheng@rub.de (+49) 234-32-29486 About Me Publications Teaching Supervised Theses Projects My research group investigates the neural mechanisms underlying learning and memory. We are primarily interested in the hippocampus, the brain region that is mainly involved in episodic memory, as well as in the learning and memory of sequences. Our research focuses on the dynamics of these processes, which has received relatively little attention to date.We employ two complementary approaches. Our first approach is modeling, including mathematic models as well as computer simulation of complex networks. While all models are simplified, we aim to build biologically realistic models that capture the essence of the neural circuit mechanism underlying learning and memory. Our second approach is data-mining. We develop methods for model-based data analysis and apply such methods to experimental data. These data include electrophysiological and EEG recordings as well as behavioral data. We collaborate closely with neuroscientists on the RUB campus and at other universities in Germany and abroad. Selected Publications view all publications 2023 A map of spatial navigation for neuroscienceParra-Barrero, E., Vijayabaskaran, S., Seabrook, E., Wiskott, L., & Cheng, S.Neuroscience & Biobehavioral Reviews, 152, 105200 Bibtex APA Downloads A map of spatial navigation for neuroscience @article{Parra-BarreroVijayabaskaranSeabrookEtAl2023, author\t\t=\t{Parra-Barrero, Eloy and Vijayabaskaran, Sandhiya and Seabrook, Eddie and Wiskott, Laurenz and Cheng, Sen}, title\t\t=\t{A map of spatial navigation for neuroscience}, journal\t\t=\t{Neuroscience & Biobehavioral Reviews}, volume\t\t=\t{152}, pages\t\t=\t{105200}, month\t\t=\t{September}, year\t\t=\t{2023}, doi\t\t=\t{10.1016/j.neubiorev.2023.105200}, } Parra-Barrero, E., Vijayabaskaran, S., Seabrook, E., Wiskott, L., & Cheng, S.. (2023). A map of spatial navigation for neuroscience. Neuroscience & Biobehavioral Reviews, 152, 105200. http://doi.org/10.1016/j.neubiorev.2023.105200 Optogenetics reveals paradoxical network stabilizations in hippocampal CA1 and CA3de Jong, L. W., Nejad, M. M., Yoon, E., Cheng, S., & Diba, K.Current Biology, 33(9), 1689–1703.e5 Bibtex APA Downloads Optogenetics reveals paradoxical network stabilizations in hippocampal CA1 and CA3 Optogenetics reveals paradoxical network stabilizations in hippocampal CA1 and CA3- SupplementaryMaterial @article{de JongNejadYoonEtAl2023, author\t\t=\t{de Jong, Laurel Watkins and Nejad, Mohammadreza Mohagheghi and Yoon, Euisik and Cheng, Sen and Diba, Kamran}, title\t\t=\t{Optogenetics reveals paradoxical network stabilizations in hippocampal CA1 and CA3}, journal\t\t=\t{Current Biology}, volume\t\t=\t{33}, number\t\t=\t{9}, pages\t\t=\t{1689–1703.e5}, month\t\t=\t{May}, year\t\t=\t{2023}, doi\t\t=\t{10.1016/j.cub.2023.03.032}, } de Jong, L. W., Nejad, M. M., Yoon, E., Cheng, S., & Diba, K. (2023). Optogenetics reveals paradoxical network stabilizations in hippocampal CA1 and CA3. Current Biology, 33(9), 1689–1703.e5. http://doi.org/10.1016/j.cub.2023.03.032 A model of hippocampal replay driven by experience and environmental structure facilitates spatial learningDiekmann, N., & Cheng, S.eLife, 12, e82301 Bibtex APA Downloads A model of hippocampal replay driven by experience and environmental structure facilitates spatial learning @article{DiekmannCheng2023, author\t\t=\t{Diekmann, Nicolas and Cheng, Sen}, title\t\t=\t{A model of hippocampal replay driven by experience and environmental structure facilitates spatial learning}, journal\t\t=\t{eLife}, volume\t\t=\t{12}, pages\t\t=\t{e82301}, month\t\t=\t{March}, year\t\t=\t{2023}, doi\t\t=\t{10.7554/eLife.82301}, } Diekmann, N., & Cheng, S.. (2023). A model of hippocampal replay driven by experience and environmental structure facilitates spatial learning. eLife, 12, e82301. http://doi.org/10.7554/eLife.82301 2022 The cerebellum contributes to context-effects during fear extinction learning: A 7T fMRI studyBatsikadze, G., Diekmann, N., Ernst, T. M., Klein, M., Maderwald, S., Deuschl, C., et al.NeuroImage, 253, 119080 Bibtex APA @article{BatsikadzeDiekmannErnstEtAl2022, author\t\t=\t{Batsikadze, Giorgi and Diekmann, Nicolas and Ernst, Thomas Michael and Klein, Michael and Maderwald, Stefan and Deuschl, Cornelius and Merz, Christian Josef and Cheng, Sen and Quick, Harald H. and Timmann, Dagmar}, title\t\t=\t{The cerebellum contributes to context-effects during fear extinction learning: A 7T fMRI study}, journal\t\t=\t{NeuroImage}, volume\t\t=\t{253}, pages\t\t=\t{119080}, month\t\t=\t{June}, year\t\t=\t{2022}, doi\t\t=\t{10.1016/j.neuroimage.2022.119080}, } Batsikadze, G., Diekmann, N., Ernst, T. M., Klein, M., Maderwald, S., Deuschl, C., et al. (2022). The cerebellum contributes to context-effects during fear extinction learning: A 7T fMRI study. NeuroImage, 253, 119080. http://doi.org/10.1016/j.neuroimage.2022.119080 2021 Neuronal Sequences during Theta Rely on Behavior-Dependent Spatial MapsParra-Barrero, E., Diba, K., & Cheng, S.eLife, 10, e70296 Bibtex APA @article{Parra-BarreroDibaCheng2021, author\t\t=\t{Parra-Barrero, Eloy and Diba, Kamran and Cheng, Sen}, title\t\t=\t{Neuronal Sequences during Theta Rely on Behavior-Dependent Spatial Maps}, journal\t\t=\t{eLife}, volume\t\t=\t{10}, pages\t\t=\t{e70296}, year\t\t=\t{2021}, doi\t\t=\t{10.7554/eLife.70296}, } Parra-Barrero, E., Diba, K., & Cheng, S.. (2021). Neuronal Sequences during Theta Rely on Behavior-Dependent Spatial Maps. eLife, 10, e70296. http://doi.org/10.7554/eLife.70296 2019 Hippocampal Reactivation Extends for Several Hours Following Novel ExperienceGiri, B., Miyawaki, H., Mizuseki, K., Cheng, S., & Diba, K.The Journal of Neuroscience, 39(5), 866–875 Bibtex APA Downloads link @article{GiriMiyawakiMizusekiEtAl2019, author\t\t=\t{Giri, Bapun and Miyawaki, Hiroyuki and Mizuseki, Kenji and Cheng, Sen and Diba, Kamran}, title\t\t=\t{Hippocampal Reactivation Extends for Several Hours Following Novel Experience}, journal\t\t=\t{The Journal of Neuroscience}, volume\t\t=\t{39}, number\t\t=\t{5}, pages\t\t=\t{866–875}, month\t\t=\t{December}, year\t\t=\t{2019}, doi\t\t=\t{10.1523/jneurosci.1950-18.2018}, } Giri, B., Miyawaki, H., Mizuseki, K., Cheng, S., & Diba, K. (2019). Hippocampal Reactivation Extends for Several Hours Following Novel Experience. The Journal of Neuroscience, 39(5), 866–875. http://doi.org/10.1523/jneurosci.1950-18.2018 2016 What is episodic memory if it is a natural kind?Cheng, S., & Werning, M.Synthese, 193(5), 1345–1385 Bibtex APA @article{ChengWerning2016, author\t\t=\t{Cheng, Sen and Werning, Markus}, title\t\t=\t{What is episodic memory if it is a natural kind?}, journal\t\t=\t{Synthese}, volume\t\t=\t{193}, number\t\t=\t{5}, pages\t\t=\t{1345–1385}, year\t\t=\t{2016}, doi\t\t=\t{10.1007/s11229-014-0628-6}, } Cheng, S., & Werning, M. (2016). What is episodic memory if it is a natural kind? Synthese, 193(5), 1345–1385. http://doi.org/10.1007/s11229-014-0628-6 Dissociating memory traces and scenario construction in mental time travelCheng, S., Werning, M., & Suddendorf, T.Neuroscience & Biobehavioral Reviews, 60, 82–89 Bibtex APA @article{ChengWerningSuddendorf2016, author\t\t=\t{Cheng, Sen and Werning, Markus and Suddendorf, Thomas}, title\t\t=\t{Dissociating memory traces and scenario construction in mental time travel}, journal\t\t=\t{Neuroscience & Biobehavioral Reviews}, volume\t\t=\t{60}, pages\t\t=\t{82–89}, month\t\t=\t{January}, year\t\t=\t{2016}, doi\t\t=\t{10.1016/j.neubiorev.2015.11.011}, } Cheng, S., Werning, M., & Suddendorf, T. (2016). Dissociating memory traces and scenario construction in mental time travel. Neuroscience & Biobehavioral Reviews, 60, 82–89. http://doi.org/10.1016/j.neubiorev.2015.11.011 2008 New Experiences Enhance Coordinated Neural Activity in the Hippocampus Cheng, S., & Frank, L. M.Neuron , 57(2), 303–313 Bibtex APA @article{ChengFrank2008, author\t\t=\t{Cheng, Sen and Frank, Loren M.}, title\t\t=\t{New Experiences Enhance Coordinated Neural Activity in the Hippocampus }, journal\t\t=\t{Neuron }, volume\t\t=\t{57}, number\t\t=\t{2}, pages\t\t=\t{303–313}, year\t\t=\t{2008}, doi\t\t=\t{10.1016/j.neuron.2007.11.035}, } Cheng, S., & Frank, L. M. (2008). New Experiences Enhance Coordinated Neural Activity in the Hippocampus . Neuron , 57(2), 303–313. http://doi.org/10.1016/j.neuron.2007.11.035 in press Gedächtnisverbesserung: Möglichkeiten und kritische BetrachtungCheng, S.In F. Hüttemann & Liggieri, K. (Eds.), Die Grenze \"Mensch\". Diskurse des Transhumanismus. Bielefeld: transcript Verlag Bibtex APA @incollection{Cheng0, author\t\t=\t{Cheng, Sen}, title\t\t=\t{Gedächtnisverbesserung: Möglichkeiten und kritische Betrachtung}, booktitle\t=\t{Die Grenze \"Mensch\". Diskurse des Transhumanismus.}, editor\t\t=\t{Hüttemann, Felix and Liggieri, Kevin}, publisher\t=\t{transcript Verlag}, address\t\t=\t{Bielefeld}, year\t\t=\t{in press}, } Cheng, S. (in press). Gedächtnisverbesserung: Möglichkeiten und kritische Betrachtung. In F. Hüttemann & Liggieri, K. (Eds.), Die Grenze \"Mensch\". Diskurse des Transhumanismus.. Bielefeld: transcript Verlag. 2025 A taxonomy of spatial navigation in mammals: Insights from computational modelingVijayabaskaran, S., Zeng, X., Ghazinouri, B., Wiskott, L., & Cheng, S.Neuroscience & Biobehavioral Reviews, 176, 106282 Bibtex APA Downloads pdf @article{VijayabaskaranZengGhazinouriEtAl2025, author\t\t=\t{Vijayabaskaran, Sandhiya and Zeng, Xiangshuai and Ghazinouri, Behnam and Wiskott, Laurenz and Cheng, Sen}, title\t\t=\t{A taxonomy of spatial navigation in mammals: Insights from computational modeling}, journal\t\t=\t{Neuroscience & Biobehavioral Reviews}, volume\t\t=\t{176}, pages\t\t=\t{106282}, month\t\t=\t{July }, year\t\t=\t{2025}, doi\t\t=\t{10.1016/j.neubiorev.2025.106282}, } Vijayabaskaran, S., Zeng, X., Ghazinouri, B., Wiskott, L., & Cheng, S.. (2025). A taxonomy of spati",
  "content_length": 104200,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:31"
}