{
  "name": "Senjuti Basu Roy",
  "homepage": "https://web.njit.edu/~senjutib",
  "status": "success",
  "content": "Home - Senjuti Basu Roy Senjuti Basu Roy Panasonic Chair in Sustainability Associate Professor Department of Computer Science Newark, NJ New Jersey Institute of Technology 973-596-3662 senjutib@njit.edu Google Scholar March on. Do not tarry. To go forward is to move toward perfection. March on, and fear not the thorns, or the sharp stones on life's path. – Kahlil Gibran About Me I am the Panasonic Endowed Chair in Sustainability and an Associate Professor at the Department of Computer Science at the New Jersey Institute of Technology. At NJIT, I am the director of BDAL (Big Data Analytics Lab). Prior to that, I held a position at the Institute of Technology at the University of Washington Tacoma, and was a postdoctoral fellow at DIMACS at Rutgers University before that. I have received my PhD in Computer Science from the University of Texas at Arlington in May 2011. Earlier, I graduated from the University of Texas at Arlington in May 2007 with the M.S. degree in Computer Science (CSE@UTA). I have recieved my undergraduate B.Tech degree(2004) in Computer Science and Engineering from the University of Calcutta, India. Research Interests My research interest lies at the intersection of data management, information retrieval, and AI, with three integrated thrusts: Model Reusability: Designing storage, indexing, and metadata management techniques that make pretrained AI models easily discoverable, composable, and adaptable across diverse tasks, with provable qualitative guarantees. Responsible Data Management: Advancing methods for collecting, storing, processing, and governing structured and vectorized data to ensure accuracy, trustworthiness, ethical integrity, and compliance with legal and societal requirements. Human-in-the-Loop Decision Support: Creating scalable decision-support systems for national security applications, integrating Generative AI and applied machine learning for predictive maintenance and cyber defense under stringent performance, security, and resource constraints. My work is funded by: NSF, ONR, NIH, Microsoft Research, and Multicare Health Systems. Open Position: I have an opening for a postdoctoral researcher position funded by a DoD project. The initial appointment is for 1 year, with the possibility of renewal for 2 additional years based on performance. Please apply here. News ✨NEW!! A new project, in collaboration with Boston Fusion Corporation, sponsored by Office of Naval Research, titled \"RUBICON: form curation while completion\", has been awarded for 4 years! ✨ NEW!! I am serving as the Women in Science Co-Chair at ICDM 2025, the 25th IEEE International Conference on Data Mining! ✨ NEW!! I am serving as a Research PC-Co Chair of CIKM 2025, the 34th ACM International Conference on Information and Knowledge Management! ✨ NEW!! I am serving as a PC-Co Chair of EDBT 2027, the 30th ACM International Conference on Extending Database Technology! ✨ NEW!! Phase-2 of a project, sponsored by ONR, titled, \"Predictive Analytics on Ship Scheduling\", has resumed and will go for another 3 years!",
  "content_length": 3077,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:32"
}