{
  "name": "Senzhang Wang",
  "homepage": "https://senzhangwangcsu.github.io/index.html",
  "status": "success",
  "content": "SenZhang Wang at CSU SenZhang Wang Home Research Publications Team Teaching Distinguished Professor School of Computer Science Central South University My Google Scholar Page Email: szwang@csu.edu.cn My principal research interest is in large-scale information and social networks, and more generally in data mining, big data analysis, statistics, machine learning, and network science, with a focus on modeling novel problems and proposing scalable algorithms for large-scale, real-world applications, including but not limited to: spatial-temporal data mining, graph data mining, urban computing with deep learning models, and intelligent transportation systems with big data. In particular, I have extended conventional studies of influence mining in both homogeneous and heterogeneous networks. I proposed new models and algorithms to capture and predict the future dissemination trend of cascades on social networks, and also studied how to explore both the different patterns of information diffusion and the community property of the social network to better infer the hidden structure of the diffusion network. My recent research focuses on urban traffic computation with multi-sourced data. We are estimating and predicting urban traffic congestions by exploring data from different domains, such as GPS probe data collected from vehicles, social media data, and also rich other data that can largely influence urban traffic including POIs, weather, and social events. Education experience Jan, 2018-Jan, 2020. Post-doctoral, Hong Kong Polytechnic University with Prof.Jiannong Cao Sep, 2013-Sep, 2015. Joint cultivation of doctoral students supported by NSFC University of Illinois at Chicago Prof.Philip S. Yu Sep, 2009-Jan, 2016. Ph.D, School of Computer Science and Engineering, Beihang University Awards 2022-2025, Furong Scholar of Hunan Province 2021, Best paper candidate of ICDM 2021 2020, Best Student paper of ADMA 2020 2019, \"Changkong Star\" Scholar of NUAA 2019, MCEA Young Researcher Travel Grant of PAKDD 2019 (5 researchers are granted in total in that year) 2017, Excellent Doctoral Dissertation of Beihang University 2017, Hong Kong Scholar Programme 2015, Excellent PhD Graduate of Beijing with Ph.D. degree 2014, SDM 14 Travel Award 2014, awarded CASA Scholarship of Beihang University 2013-2014, granted by the Innovation Foundation of BUAA for PhD Graduates (the only winner of CS department of BUAA that year) 2013, awarded National Scholarship 2012, awarded Outstanding graduate of Beihang University Grants National Science Foundation of China, 2022-2015, 600,000, PI Start Up Foundation of Central South University, 2021-2026, 1,200,000, PI Guangdong Basic and Applied Basic Research Foundation, 2021-2023, 100,000, PI CAAI-Huawei Joint Research Foundation, 2022, 90,000, PI ××××× supported by National University of Defense Technology,2022, 308,000,PI AI+ Research Project of NUAA, 2020-2022, 200,000, PI National Natural Science Foundation of China, 2016.12-2019.12 210,000¥ PI Natural Science Foundation of Jiangsu Province, 2017.6-2020.6 100,000¥ PI Book Chapters Senzhang Wang, Jiannong Cao, \"AI and Deep Learning for Urban Computing\", in Urban Informatics, Edited by Wenzhong Shi, Goodchild Michael, Batty Michael and Kwan Mei-Po, Springer, 2020. Chapter 5.5. pp 1-30. Jianping Cao, Dongliang Duan, Liuqing Yang, Qingpeng Zhang, Senzhang Wang, and Feiyue Wang, \"Social influence analysis in the big data era: a review,\" in Shuguang (Robert) Cui (Editors), Big Data in Networks, Cambridge University Press, 2016, pp. 301-334. Editor/Guest Editor Chinese Journal of Intelligent Science and Technology (《智能科学与技术学报》, EIC: Prof. Fei-Yue Wang) Computer Engineering(《计算机工程》) Guest Editor of ACM Transactions on Intelligent Systems and Technology;Guest Editor of Remote Sensing Organizer & PC Member & Session Chair 20th IEEE International Conference on Data Mining (ICDM 2020), July 30-31, 2020 in Istanbul, Turkey, PC Member 25th International Conference on Database Systems for Advanced Applications (DASFAA 2020) 21-24 MAY, 2020 Seoguipo KAL Hotel, Jeju, Korea, PC Member APWeb-WAIM 2020 : The 4th APWeb-WAIM International Joint Conference on Web and Big Data, August 12-14, 2020, Tianjin, China, PC Member 29th International Joint Conference on Artificial Intelligence and the 17th Pacific Rim International Conference on Artificial Intelligence (IJCAI-PRICAI 2020), July 11-17, 2020, Yokohama, Japan. PC Member Special Session on Learnable Representation and Analytics of Neuroimaging (LRAN 2019), in conjunction with 2019 International Conferences on Brain Informatics. December 13-15, 2019, Haikou, Hainan, China. Organizer 19th IEEE International Conference on Data Mining (ICDM 2019), November 8-11, 2019, Beijing, PC Member The Pacific-Asia Conference on Knowledge Discovery and Data Mining 2019, 14-17 April, 2019, Macau, China, Session Chair 28th International Joint Conference on Artificial Intelligence, Macao, China, August 10-16, 2019, Session Chair 2019 IEEE International Conference on Big Data, December 9-12, 2019, Los Angeles, CA, USA, PC Member The 19th IEEE International Conference on Data Mining, Nov 8, 2019 - Nov 11, 2019, Beijing, China, PC Member 28th International Joint Conference on Artificial Intelligence(IJCAI 19), Macao, China, August 10-16, PC Member 8th CCF International Conference on Natural Language Processing and Chinese Computing 2019 (NLPCC 2019), Dunhuang, 9-14 October, 2019, PC Member 27th International Joint Conference on Artificial Intelligence and the 23rd European Conference on Artificial Intelligence (IJCAI-ECAI 18), Stockholm, Sweden, July 13-19, PC Member The 27th ACM International Conference on Information and Knowledge Management (CIKM 18), October 22-26, 2018 in Italy, PC Member (Case studies track) 2018 The Thirty-Second AAAI Conference on Artificial Intelligence (AAAI 18), Hilton New Orleans Riverside, New Orleans, Louisiana, USA, February 2–7, PC Member 2018 IEEE International Conference on Big Data (IEEE BigData 18), PC Member The 26th ACM International Conference on Information and Knowledge Management (CIKM 17), November 6-10, 2017 in Singapore, PC Member (Case studies track) 2017 The Thirty-First AAAI Conference on Artificial Intelligence (AAAI 17), Hilton San Francisco, San Francisco, California, USA, February 4–9, PC Member 2017 IEEE International Conference on Data Science in Cyberspace (DSC 17), Shenzhen, Guangdong, Jun. 26-29, PC Member 2016 IEEE International Conference on Data Science in Cyberspace (DSC 16), Changsha, Hunan, Jun. 13-16, PC Member CCKS 2018: China Conference on Knowledge Graph and Semantic Computing,2018, PC Member First International Workshop on Machine Learning and Data Quality for Mobile Data Management (In conjunction with MDM 2019), PC Member 2017 The 3nd workshop of Heterogeneous Information Network Analysis and Applications (HENA 17), Shenzhen, Guangdong, Jun. 26-29, PC Member 2016 The 2nd workshop of Heterogeneous Information Network Analysis and Applications (HENA 16), Changsha, Hunan, Jun. 13-16, PC Member 1st Workshop on Scalable and Applicable Recommendation Systems (SAREC 2018, held in conjunction with ICDM 2018), PC Member Conference reviewer AAAI 2018 IEEE Big Data 2017 ACPR 2017 CIKM 2017 AAAI 2017 NDBC 2017 WAIM 2016 CIKM 2016 IEEE Big Data 2016 IJCAI 2015 WWW 2015 CIKM 2015 SBP 2015 WAIM 2015 IEEE Big Data 2015 CIKM 2014 ICWSM 2014 Journal reviewer Plos ONE Knowledge and Information System (KAIS) ACM Transactions on Knowledge Discovery from Data (TKDD) IEEE Transactions on Knowledge and Data Engineering (TKDE) IEEE Transactions on Intelligent Transportation Systems (ITS) Applied Intelligence, Knowledge-based System (KBS) IEEE Transactions on Signal and Information Processing over Networks Journal of Software (Chinese version) IEEE Access Neural Processing Letter Applied Intelligence ECML Journal Website management Writing to esperanto1949@foxmail.com and letting us know your thought",
  "content_length": 7970,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:31"
}