{
  "name": "Seokki Lee",
  "homepage": "https://researchdirectory.uc.edu/p/lee5sk",
  "status": "success",
  "content": "Expert Profile: Seokki Lee | Research Directory Seokki Lee Asst Professor Rhodes Hall 885 CEAS - Computer Science - 513-556-5795EmailDownload V-Card PhD: Illinois Institute of Technology Chicago, 2020 (Computer Science) Masters: Hanyang University Seoul, 2009 (Computer Science) Databases, Data Provenance, Big Data, Database security, Data Exchange For more detailed information, please visit DB Group webpagePeer Reviewed Publications Lee, Seokki; Ludäscher, Bertram; Glavic, Boris; (2019. ) PUG: a framework and practical implementation for why and why-not provenance .The VLDB Journal, , 47-71 Diestelkämper, Ralf; Glavic, Boris; Herschel, Melanie; Lee, Seokki; (2019. ) Query-based why-not explanations for nested data .11th International Workshop on Theory and Practice of Provenance (TaPP 2019), , Arab, Bahareh Sadat; Feng, Su; Glavic, Boris; Lee, Seokki; Niu, Xing; Zeng, Qitian; (2018. ) GProM-A swiss army knife for your provenance needs .A Quarterly bulletin of the Computer Society of the IEEE Technical Committee on Data Engineering, , Lee, Seokki; Ludäscher, Bertram; Glavic, Boris; (2018. ) Provenance summaries for answers and non-answers .Proceedings of the VLDB Endowment, , 1954-1957 Lee, Seokki; Ludäscher, Bertram; Glavic, Boris; (2018. ) PUG: A Framework and Practical Implementation for Why & Why-Not Provenance (extended version) .arXiv preprint arXiv:1808.05752, , Lee, Seokki; Köhler, Sven; Ludäscher, Bertram; Glavic, Boris; (2017. ) A SQL-middleware unifying why and why-not provenance for first-order queries .2017 IEEE 33rd International Conference on Data Engineering (ICDE), , 485-496 Spoth, William; Arab, Bahareh Sadat; Chan, Eric S; Gawlick, Dieter; Ghoneimy, Adel; Glavic, Boris; Hammerschmidt, Beda; Kennedy, Oliver; Lee, Seokki; Liu, Zhen Hua; (2017. ) Adaptive schema databases .CIDR 2017, 8th Biennial Conference on Innovative Data Systems Research, Chaminade, CA, USA, January 8-11, 2017, Online Proceedings, , Niu, Xing; Arab, Bahareh Sadat; Lee, Seokki; Feng, Su; Zou, Xun; Gawlick, Dieter; Krishnaswamy, Vasudha; Liu, Zhen Hua; Glavic, Boris; (2017. ) Debugging transactions and tracking their provenance with reenactment .arXiv preprint arXiv:1707.09930, , Lee, Seokki; Niu, Xing; Ludäscher, Bertram; Glavic, Boris; (2017. ) Integrating approximate summarization with provenance capture .9th {USENIX} Workshop on the Theory and Practice of Provenance (TaPP 2017), , Lee, Seokki; Köhler, Sven; Ludäscher, Bertram; Glavic, Boris; (2016. ) Implementing Unified Why-and Why-Not Provenance Through Games .International Provenance and Annotation Workshop, , 209-213 Lee, Seokki; Tang, Yuchen; Köhler, Sven; Ludäscher, Bertram; Glavic, Boris; (2015. ) An efficient implementation of game provenance in DBMS . Lee, Seokki; Wang, Zhen; Glavic, Boris; Miller, Renée J; Automatic Generation and Ranking of Explanations for Mapping Errors . Lee S.; Ludäscher B.; Glavic B. (01-01-2020. ) Approximate summaries for why and why-not provenance.Proceedings of the VLDB Endowment, , 13 (6 ) ,912-924 More Information Lee S.; Ludäscher B.; Glavic B. (02-01-2019. ) PUG: a framework and practical implementation for why and why-not provenance.VLDB Journal, , 28 (1 ) ,47-71 More Information Diestelkämper R.; Glavic B.; Herschel M.; Lee S. (01-01-2019. ) Query-based why-not explanations for nested data .TaPP 2019 - 11th International Workshop on the Theory and Practice of Provenance, , Lee S.; Ludäscher B.; Glavic B. (01-01-2018. ) Provenance summaries for answers and nonanswers.Proceedings of the VLDB Endowment, , 11 (12 ) ,1954-1957 More Information Niu X.; Arab B.; Lee S.; Feng S.; Zou X.; Gawlick D.; Krishnaswamy V.; Liu Z.; Glavic B. (08-01-2017. ) Debugging transactions and tracking their provenance with reenactment.Proceedings of the VLDB Endowment, , 10 (12 ) ,1857-1860 More Information Lee S.; Köhler S.; Ludäscher B.; Glavic B. (05-16-2017. ) A SQL-Middleware unifying why and why-not provenance for first-order queries.Proceedings - International Conference on Data Engineering, , 485-496 More Information Lee S.; Niu X.; Ludäscher B.; Glavic B. (01-01-2017. ) Integrating approximate summarization with provenance capture .TaPP 2017 - 9th USENIX Workshop on the Theory and Practice of Provenance, , Spoth W.; Arab B.S.; Chan E.S.; Gawlick D.; Ghoneimy A.; Glavic B.; Hammerschmidt B.; Kennedy O.; Lee S.; Liu Z.H.; Niu X.; Yang Y. (01-01-2017. ) Adaptive schema databases .CIDR 2017 - 8th Biennial Conference on Innovative Data Systems Research, , Lee S.; Köhler S.; Ludäscher B.; Glavic B. (01-01-2016. ) Implementing unified why- and why-not provenance through games.Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), , 9672 ,209-213 More InformationInvited Presentations Seokki Lee (09-2019. ) PUG: A Framework for Efficiently Computing and Summarizing Why and Why-not Provenance .University of Notre Dame, Notre Dame, IN 46556 USA. Poster Presentations Seokki Lee (2015. ) Automatic generation and ranking of explanations for mapping errors .Greater Chicago Area Systems Research Workshop (GCASR), Chicago. . Level:Local Seokki Lee (2017. ) A SQL-Middleware Unifying Why and Why-Not Provenance for First-Order Queries .Greater Chicago Area Systems Reasearch Workshop (GCASR), Chicago. . Level:Local Seokki Lee (2018. ) Sharing reproducible research through DataONE and Whole Tale .Whole Tale Workshop on Tools and Approaches for Publishing Reproducible Research, Rhodes 8852851 Woodside DrCincinnati Ohio, 45221",
  "content_length": 5548,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:35"
}