{
  "name": "Seong-Whan Lee",
  "homepage": "http://pr.korea.ac.kr",
  "status": "success",
  "content": "고려대학교 패턴인식 및 머신러닝 연구실 NEWS PEOPLE Professor Postdoctoral Fellows Graduate Students Alumni RESEARCH ADAS Brain-Computer Interface Computer Vision Artificial General Intelligence Large Language Model Speech Processing PUBLICATIONS GALLERY ARCHIVE CONTACT US Recent Publications 2025 Nov., \"Towards Memory-Efficient Continual Adaptation for MI-EEG Decoding in BCIs\" has been accepted in IEEE Trans. on Systems, Man and Cybernetics: Systems. 2025 Oct., \"Enhancing Spatio-Temporal Zero-shot Action Recognition with Language-driven Description Attributes\" has been accepted in Pattern Recognition. 2025 Oct., \"Consciousness-ECG Transformer for Conscious State Estimation System with Real-Time Monitoring\" has been accepted in Expert Systems With Applications. 2025 Oct., \"Reconstructing Unseen Sentences from Speech-related Biosignals for Open-vocabulary Neural Communication\" has been accepted in IEEE Trans. on Neural Systems & Rehabilitation Engineering. 2025 Sep., \"Towards Generalizable 3D Human Pose Estimation via Ensembles on Flat Loss Landscapes\" has been accepted in NeurIPS. 2025 Aug., \"XLQA: A Benchmark for Locale-Aware Multilingual Open-Domain Question Answering\" has been accepted in EMNLP. 2025 Aug., \"FillerSpeech: Towards Human-Like Text-to-Speech Synthesis with Filler Injection and Filler Style Control,\" has been accepted in EMNLP. 2025 Jul., \"ChemFixer: Correcting Invalid Molecules to Unlock Previously Unseen Chemical Space\" has been accepted in IEEE Journal of Biomedical and Health Informatics. 2025 Jul., \"MIRe: Enhancing Multimodal Queries Representation via Fusion-Free Modality Interaction for Multimodal Retrieval\" has been accepted in Findings of ACL. 2025 Jul., \"RaDL: Relation-aware Disentangled Learning for Multi-Instance Text-to-Image Generation\" has been accepted in IEEE SMC. Selected Publications Science Robotics, \"An adaptive deep reinforcement learning framework enables curling robots with human-like performance ...\", 2020. Nature Machine Intelligence, \"Network of Evolvable Neural Units Can Learn Synaptic Learning Rules and Spiking Dynamics\", 2020. Science Advances, \"Leaf inspired homeostatic cellulose biosensors\", 2021. Nature Communications, \"Quantifying Arousal and Awareness in Altered States of Consciousness using Interpretable Deep Learning\", 2022. News D. Li's paper has been accepted in IEEE Transactions on Systems, Man and Cybernetics: Systems 2025.11.03 Y.-N. Kim's paper has been accepted in Pattern Recognition 2025.10.31 Y.-S. Kweon's paper has been accepted in Expert Systems with Applications 2025.10.20 D.-S. Kim's paper has been accepted in IEEE Transactions on Neural Systems & Rehabilitation Eng… 2025.10.16 J.-M. Han's paper has been accepted in NeurlPS 2025.09.19 S.-B. Kim's paper has been accepted in EMNLP 2025.08.21 K. Roh's paper has been accepted in EMNLP 2025.08.21 J.-H. Park's paper has been accepted in IEEE Journal of Biomedical and Health Informatics 2025.07.25 B.-K. Ko's paper has been accepted in IEEE Transactions on Neural Systems & Rehabilitation Engi… 2025.07.16 G.-H. Shin's paper has been accepted in npj Science of Learning 2025.07.11 J.-H. Kim's paper has been accepted in ICCV 2025.06.26 S.-H. Lee's paper has been accepted in IEEE Transactions on Neural Networks and Learning System 2025.06.25 B.-H. Kwon's paper has been accepted in Expert Systems with Applications 2025.06.23 S.-H. Na's paper has been accepted in IEEE Transactions on Neural Networks and Learning Systems 2025.06.12 Y. K. Kim's paper has been accepted in IEEE Transactions on Systems, Man and Cybernetics: Syste 2025.06.05 D.-M. Byun's paper has been accepted in IEEE Transactions on Audio, Speech and Language Process… 2025.06.03 S.-H. Choi's paper has been accepted in Neural Networks 2025.05.31 이성환 고려대 교수 “생각을 음성으로 바꾸는 BTS, 5년 후 현실로” 2025.05.30 J.-S. Choi's paper has been accepted in Interspeech 2025.05.20 D.-H. Cho's paper has been accepted in Interspeech 2025.05.20 Pattern Recognition & Machine Learning Lab Korea University, 145, Anam-ro, Seongbuk-gu, Seoul, 02841, Korea Tel: +82-2-3290-3799, Fax: +82-2-926-2168 접속자 현황(2015년 12월 4일 이후)오늘:25전체:696485 a a delete from g4_login where lo_datetime < '2025-12-01 16:11:44' 1194 : Table 'g4_login' is marked as crashed and should be repairederror file : /index.php",
  "content_length": 4279,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:35"
}