{
  "name": "Seon Wook Kim",
  "homepage": "http://compiler.korea.ac.kr",
  "status": "success",
  "content": "Compiler&Microarchitecture Lab. OUR FOCUS Compiler JavaScript Parallelizing Compiler Android ART HTML Parallel Parsing LLVM/GCC SDK Porting & Optimization GPU OpenGL|ES/OpenCL Compiler Microarchitecture Power/Energy Efficient Core Design GPU/Embedded Core Design Memory System (DRAM, PIM, Persistent Memory) Neural Processing Architecture Simulation Acceleration Error Detection/Recovery HW/SW Framework Digital SoC RFID NFC TCON ABOUT US Compiler & Micro-ArchitectureCompiler and Microarchitecture Laboratory (COMMIT) at the School of Electrical and Computer Engineering of Korea University performs the state-of-the-art research in area of software and hardware intergation and their interaction, especially in compiler, system software, microarchitecture, memory, parallel processing, etc. PH.D COURSE3 Students M.S. COURSE4 Students INTERNS1 Students ALUMNI33 Students LOCATION New Engineering Hall #415, Science and Engineering Complex Korea University. 145, Anam-ro, Seongbuk-gu, Seoul, Republic of Korea, 02841 RECRUITMENT NOTICEWe are currently recruiting for undergraduate interns who are willing to join our lab (M.S. and Ph.D. Course) in near future. Please do not hesitate to contact at your convenience. Contact : Ph.D. student Mun Seong Park( qkranstjd01 at korea.ac.kr) Recruitment Notice We are eagerly inviting new graduate students, especially for the M.E. and Ph.D. combined degree. The projects we are currently working on are as follows. System software (Compiler & OS) Development of PIM Computing Architecture based on Data-Flow (IITP) Simulation-based High-speed/High-Accuracy Data Center Workload/System Analysis Platform (IITP) Microarchitecture Large-scale PIM Platform Research for Large Language Model (SK Hynix) Memory-Centric Architecture Using the Reconfigurable PIM Devices (IITP) Please do not hesitate to contact me at qkranstjd01 at korea.ac.kr (Mun Seong Park, Ph.D. student). ×",
  "content_length": 1915,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:34"
}