{
  "name": "Seongku Kang",
  "homepage": "https://seongku-kang.github.io",
  "status": "success",
  "content": "SeongKu Kang SeongKu Kang I am an Assistant Professor in the Department of Computer Science and Engineering at Korea University. I received my Ph.D. from POSTECH, where I was advised by Prof. Hwanjo Yu. I was honored with the Stars of Tomorrow award from Microsoft Research Asia, where I interned in the Social Computing group. After completing my Ph.D., I worked as a postdoctoral researcher at UIUC, working with Prof. Jiawei Han. Email  | CV  | Google Scholar  | Github  | Lab Page Research Interest Data science and machine learning for real-world applications Information retrieval and recommender systems Publications Please refer to our lab page. Experience Assistant Professor | Korea University Mar 2025 - Present Postdoctoral Researcher | UIUC Jun 2023 - Feb 2025 Postdoctoral Researcher in Data Mining Group Advisor: Prof. Jiawei Han Research Intern | Microsoft Research Asia May 2022 - April 2023 At Social Computing Group, I worked with Dr. Xing Xie and Dr. Jianxun Lian. Award of excellence (Stars of Tomorrow, top 10%) Education Ph.D in Computer Science and Engineering | POSTECH Mar 2018 - Aug 2023 Advisor: Prof. Hwanjo Yu B.S in Computer Science and Engineering | Nanyang Technological University Jul 2016 - May 2017 Exchange Student B.S in Computer Science and Engineering | Hanyang University Mar 2012 - Feb 2018 Cumulative GPA: 4.43/4.50 (ranked 1st in CSE Dept.) Leave of absence for mandatory military service: Mar 2014 - Mar 2016 Honors & Awards Seoktop Lecture Award (Artificial Intelligence), Korea University, 2025 Top Paper Recognition, WSDM 2025 / ACM TIST Best Papers of WSDM 2025 Outstanding reviewer, ACM KDD, 2024 Stars of Tomorrow Award, Microsoft Research Asia, 2023 POSTECHIAN Fellowship, POSTECH, 2022 4th Rank @ POSTECH Research Award, National Research Foundation in Korea and POSTECH, 2022 Naver Ph.D Fellowship, Naver, 2021 3rd Rank @ Music Playlist Recommendation Competition, Kakao, 2020 Student Travel Award, ACM SIGIR, 2019-2020 Dean’s List, Hanyang University, 2018 3rd Rank @ Best Paper Award, Korean Database Conference (KDBC), 2017 Hanyang Brain Scholarship, Hanyang University, 2012 National Science and Technology Scholarship, Ministry of Education in Korea, 2012-2017 Website templates from (link).",
  "content_length": 2250,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:35"
}