{
  "name": "Serap Atay",
  "homepage": "http://ceng.iyte.edu.tr/tr/kisi/serap-sahin",
  "status": "success",
  "content": "Serap Şahin - Bilgisayar Mühendisliği Bölümü Bilgisayar Mühendisliği Bölümü İzmir Yüksek Teknoloji Enstitüsü Search Bilgisayar Mühendisliği Bölümü İzmir Yüksek Teknoloji Enstitüsü Anasayfa Hakkında Kişiler Araştırma Araştırma Odağı Projeler Yayınlar İşbirlikleri Eğitim Lisans Programı Yüksek Lisans Programları CENG YL Programı SEDS YL Programı Doktora Programı Yan Dal Programı İletişim lidya multisite > Bilgisayar Mühendisliği Bölümü > Serap Şahin Serap Şahin Doktor Öğretim Üyesi Dr. Öğr. Üyesi Serap Şahin 1966 Ankara doğumludur. 1987’de Ege Üniversitesi Bilgisayar Mühendisliği Bölümü’nden “Uzman Sistemler” üzerine yaptığı bitirme projesi ile mezun oldu. Aynı bölümde, 1989 yılında, “Arkas Holding Bilgi Sistemlerinin Analiz ve Tasarımı” konusunda yaptığı proje ile yüksek lisans çalışmalarını tamamladı. 1987-2002 yılları arasında Arkas Holding’de bilgi sistemleri koordinatörü olarak çalıştı; deniz, kara ve hava taşımacılığı, lojistik, liman ve gemi işletmeciliği ile ilgili pekçok proje tamamladı. 1995’te Bimar Bilgi Sistemleri A.Ş’nin kuruluşunu Arkas Holding bünyesinde sağladı ve 1995-2002 yıllarında Genel Müdürlüğü’nü yaptı. 2002 yılında İzmir Yüksek Teknoloji Enstitüsü Bilgisayar Mühendisliği Bölümü’nde öğretim görevlisi olarak sorumluluk aldı. Doktora çalışmalarını “Eliptik Eğri Tabanlı Kriptosistemlerde Kullanılan Aritmetik İşlemler Ve İşlem Hızındaki Problemler”e odaklayarak, Bilgi Sistemleri Strateji ve Güvenliği Laboratuvarı’nda yürüttü. 2006 yılında doktora derecesine layık görüldü. TÜBİTAK Bideb-2219 Doktora-sonrası Yurtdışı Araştırma Burs Programı kapsamında, Avrupa Birliği’nin güvenlik araştırmalarına odaklı JRC-IPSC araştırma merkezinde “Gelecek Nesil Ağlarda Güvenlik” konulu çalışmasını kritik altyapılar ile ilgili olarak tamamladı. 2010 yılında, doktor öğretim üyesi olarak bölümümüze katıldı. B.Sc. : Bilgisayar Mühendisliği, Ege Üniversitesi (1987) M.Sc. : Bilgisayar Mühendisliği, Ege Üniversitesi (1989) Ph.D. : Bilgisayar Mühendisliği, Ege Üniversitesi (2006) Dersler Publications Projects Ders bulunamadı. Makale Şahin, S., \"Privacy Issues on Social Networks\", International Journal of Information Security Science, IJJISS, vol.7, no.2, pp.60-66, 2018. Karataş, A., Şahin, S., \"Sosyal Bot Algılama Teknikleri ve Araştırma Yöntemleri Üzerine Bir İnceleme\", Uluslararasi Bilgi Güvenliği Mühendisliği Dergisi, DergiPark, vol.4, no.1, pp.10-20, 2018. Sayin, B., Şahin, S., \"An Analysis of Rumor Spreading Fundamentals with a Case Study on Facebook\", International Conference on Advanced Technologies, Computer Engineering and Science, ICATCES, 2018. Kaplan, S.P., Şahin, S., \"Blockchain : A Decentralized Approach to Big Data\", International Conference on Advanced Technologies, Computer Engineering and Science, ICATCES, 2018. Özgür, H.G., Şahin, S., \"Forensic Analysis of Persistent Data Storages Analyzing NTFS Formatted Drives\", International Conference on Advanced Technologies, Computer Engineering and Science, ICATCES, 2018. Tekin, L., Özgür, H.G., Sayin, B., Karataş, A., Şenkula, P., İrtem, E., \"EDU-VOTING: An Educational Homomorphic e-Voting System\", International Conference on Advanced Technologies, Computer Engineering and Science, ICATCES, 2018. Karataş, A., Şahin, S., “Application Areas of Community Detection: A Review,” International Congress on Big Data, Deep Learning and Fighting Cyber Terrorism, IBIGDELFT, 2018. Karataş, A., Şahin, S., “A Comparative Study of Modularity-Based Community Detection Methods for Online Social Networks,” Ulusal Yazılım Mühendisliği Sempozyumu, UYMS, 2018. Sayin, B., Şahin, S., “A Novel Approach to Information Spreading Models for Social Networks,” International Conference on Data Analytics, IARIA, 2017. Şahin, S., “A New Solution Direction for Cyber Security,” Deep Learning and Big Data in Cybersecurity Panel, IARIA, 2017. Öztürk, E., Şahin, S., “A Comparison Study of Apriori, Eclat, FP-Growth and Max-Miner Itemset Mining Algorithms in terms of Dataset Characteristics,” International Advanced Technologies Symposium, IATS, 2017. Tekin, L., Şahin, S., “Implementation and Evaluation of Improved Secure Index Scheme Using Standard and Counting Bloom Filters,” Uluslararası Bilgi Güvenligi ve Kriptoloji Konferansı, ISCTurkey, 2017. Karataş, A., Şahin, S., “A Review on Social Bot Detection Techniques and Research Directions,” Uluslararası Bilgi Güvenligi ve Kriptoloji Konferansı, ISCTurkey, 2017. Tekin, L., Şahin, S., “Implementation and Evaluation of Improved Secure Index Scheme Using Standard and Counting Bloom Filters,” International Journal of Information Security Science, vol.6, no.4, pp.46-56, December 2017. Şahin, S., Aslanoğlu, R., “Comparison of Group Key Establishment Protocols,” Turkish Journal of Electrical Engineering and Computer Sciences, vol.25, pp.46-57, January 2017. Şahin, S., “On Current Trends in Security and Privacy of Cloud Computing,” International Conference on Application of Information and Communication Technologies, AICT, 2013. Alioğlu, M., Göğebakan, U., Şahin, S., “Prime Numbers for Secure Cryptosystems and Primality Testing on MultiCore Architectures,” International Symposium on Computing in Science & Engineering, 2011. Yıldız, E., Şahin, S., “Security Risks of Cloud Computing and Precautions,” Izmir International Informatics Law Congress, 2011. Atay, S., Masera, M., “Challenges for the Security Analysis of Next Generation Networks,” Information Security Technical Report, vol.16, no.1, pp.3-11, February 2011. Atay, S., Massera, M., “Security of Critical Information Infrastructures E-Governance and Standardization,” Information Security & Cryptology Conference with International Participation, ISCTurkey, 2008. Atay, S., “The Performance Results of ECDSA Implementation on Different Coordinate Systems,” International Conference on Security of Information and Networks, SIN, 2007. Atay, S., Koltuksuz, A., Hisil, H., Eren, S., “Computational cost analysis of elliptic curve arithmetic,” International Conference on Hybrid Information Technology, ICHIT, 2006. Kurtel, K., Atay, S., Tunçay, A., “Information Technologies For Contemporary Logistics Centers,” International Logistics and Supply Chain Congress, The Era of Collaboration Through Supply Chain Networks, 2006. Atay, S., Kurtel, K., Eren, Ş., Koltuksuz, A., “Security Issues of the Supply Chain Management with Web Services,” World Business Congress International Management Development Association / International Management Development Reserach Yearbook, IMDA, 2006. Atay, S., “Protocols For Elliptic Curve Cryptography,” International Symposium on Information Technologies, ISIT, 2005. Atay, S., “Elliptic Curve Cryptography and An Implementation on Smart Cards,” Network and Information Security Symposium organized by ITU and EMO, 2005. Atay, S., “Certification of IT Security Personnel,” Akademik Bilişim Konferansı, AB, 2005. Atay, S., “Digital Signature and Applications,” Compotek Informatics Symposium, 2004. Atay, S., “Information Security for Mobile Environments and Smart Cards,” Compotek Informatics Symposium, 2003. Çizge Veri Tabanları Üzerinde Veri Toplama ve Mahremiyet İlişkilerinin Analizi, Mevlana Değişim Programı Homomorfik Kriptosistem Tabanlı Elektronik Seçim Sistem Çözümü, BAP İYTE Bilgisayar Müh. Böl., Gülbahçe, 35430 Urla, İzmir, Türkiye 114/A serapsahin@iyte.edu.tr +90 232 750 7871 www.serapsahin.com.tr issrg.iyte.edu.tr",
  "content_length": 7375,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:48"
}