{
  "name": "Serafeim Perdikis",
  "homepage": "https://www.essex.ac.uk/people/perdi05405/serafeim-perdikis",
  "status": "success",
  "content": "Serafeim Perdikis | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Serafeim Perdikis People Dr Serafeim Perdikis Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email serafeim.perdikis@essex.ac.uk Location 3A.524, Colchester Campus Academic support hours Autumn term: Monday 12:00 - 13:00 in Zoom or office 5A.542 Tuesday 13:00 - 14:00 in Zoom or office 5A.542 Spring term: Teaching at the NWU campus, China Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I was born in Thessaloniki, Greece in 1984. I received the M.E. degree in Electrical and Computer Engineering from the Aristotle University of Thessaloniki (AUTH) in 2007 and the Ph.D. degree in brain-computer interaction (BCI) from the Swiss Federal Institute of Technology in Lausanne (EPFL) in 2014, where I subsequently served as a post-doctoral researcher until May 2015. My thesis title is \"Mutual learning and spelling in Motor Imagery BCI\". In June 2015 I joined the Wyss Center for Bio- and Neuro-engineering at Campus Biotech, Geneva, Switzerland working on BCI-based stroke rehabilitation. Between November 2017 and February 2019 I have been employed by Mindmaze SA as Biosignal Research Engineer. As of February 2019 I am serving as a Lecturer of the Neural Engineering and BCI Laboratory at the University of Essex, School of Computer Science and Electronic Engineering, UK. My main areas of research interest include brain-computer interface (BCI), theoretical and applied machine learning, artificial intelligence, bio-signal and especially electroencephalography (EEG) and electromyography (EMG) signal processing, mutual learning and co-adaptation in BCI, translational and rehabilitation applications of BCI. Qualifications Diploma in Electrical and Computer Engineering Aristotle University of Thessaloniki, (2007) PhD in Brain-Computer Interaction École Polytechnique Fédérale de Lausanne, (2014) Appointments University of Essex Lecturer, School of Computer Science and Electronic Engineering, University of Essex (1/2/2019 - present) Other academic Lecturer, School of Computer Science and Electronic Engineering, University of Essex (1/2/2019 - present) Research and professional activities Research interests Brain-Computer Interface Key words: brain-computer interface Machine Learning Key words: Applied Machine Learning Learning Key words: mutual learning Translational applications of BCI Key words: Stroke Rehabilitation Conferences and presentations IEEE SMC 2022 10/10/2022 ANTNeuro EEG summer school, Berlin, Germany 20/9/2022 IADS Summer School 7/8/2022 RehabWeek 2021 22/9/2021 BCi Society Next Gen 2021 13/5/2021 Teaching and supervision Current teaching responsibilities Digital Systems Design (CE264) Engineering Electromagnetics (CE266) Current supervision Idorenyin Akwaowo Amaunam Thesis title: Eeg-Based Methods for Diagnosing Awareness in Disorders of Consciousness Degree subject: Computer Science Degree type: Doctor of Philosophy Maryam Sousani Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Mushfika Sultana Thesis title: Eeg Correlates and Methods for Learning in Brain-Computer Interaction. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 29/5/2024 Publications Publications (1) Krueger, J., Krauth, R., Reichert, C., Perdikis, S., Vogt, S., Huchtemann, T., Duerschmid, S., Sickert, A., Lamprecht, J., Huremovic, A., Goertler, M., Nasuto, SJ., Tsai, I-C., Knight, RT., Hinrichs, H., Heinze, H-J., Lindquist, S., Sailer, M., Millan, JDR. and Sweeney-Reed, CM., (2023). Hebbian plasticity induced by temporally coincident BCI enhances post-stroke motor recovery Journal articles (22) Perdikis, S., Bayati, H., Leeb, R. and Millan, JDR., Evidence Accumulation in asynchronous BCI. International journal of bioelectromagnetism. 13 (3), 131-132 Tonin, L., Perdikis, S., Leeb, R. and Millan, JDR., A BCI-driven telepresence robot. International Journal of Bioelectromagnetism. 13 (4), 125-126 Krueger, J., Krauth, R., Reichert, C., Perdikis, S., Vogt, S., Huchtemann, T., Dürschmid, S., Sickert, A., Lamprecht, J., Huremovic, A., Görtler, M., Nasuto, SJ., Tsai, I-C., Knight, RT., Hinrichs, H., Heinze, H-J., Lindquist, S., Sailer, M., Millán, JDR. and Sweeney-Reed, CM., (2024). Hebbian plasticity induced by temporally coincident BCI enhances post-stroke motor recovery. Scientific Reports. 14 (1), 18700- Sultana, M. and Perdikis, S., (2024). Automatic Feature Selection for Sensorimotor Rhythms Brain-Computer Interface Fusing Expert and Data-Driven Knowledge.. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 32, 3422-3431 Vourvopoulos, A., Fleury, M., Tonin, L. and Perdikis, S., (2023). Editorial: Neurotechnologies and brain-computer interaction for neurorehabilitation. Frontiers in Neuroergonomics. 4, 1203934-1203934 Tonin, L., Perdikis, S., Kuzu, TD., Pardo, J., Orset, B., Lee, K., Aach, M., Schildhauer, TA., Martinez-Olivera, R. and Millan del R., J., (2022). Learning to control a BMI-driven wheelchair for people with severe tetraplegia. iScience. 25 (12), 105418-105418 Perdikis, S., Leeb, R., Chavarriaga, R. and Millan, JDR., (2021). Context–aware Learning for Generative Models. IEEE Transactions on Neural Networks and Learning Systems. 32 (8), 3471-3483 Cunha, JD., Perdikis, S., Halder, S. and Scherer, R., (2021). Post-adaptation effects in a motor imagery brain-computer interface online coadaptive paradigm. IEEE Access. 9, 41688-41703 Perdikis, S. and Millan, JDR., (2020). Brain-Machine Interfaces: A Tale of Two Learners. IEEE Systems Man and Cybernetics Magazine. 6 (3), 12-19 Krauth, R., Schwertner, J., Vogt, S., Lindquist, S., Michael, S., Almut, S., Lamprecht, J., Perdikis, S., Corbet, T., Millan, JDR., Hinrichs, H., Heinze, H-J. and Sweeney-Reed, C., (2019). Cortico-muscular coherence is reduced acutely post-stroke and increases bilaterally during motor recovery: a pilot study. Frontiers in Neurology. 10 (FEB), 126- Noel, J-P., Chatelle, C., Perdikis, S., Jöhr, J., Lopes Da Silva, M., Ryvlin, P., De Lucia, M., Millán, JDR., Diserens, K. and Serino, A., (2019). Peri-personal space encoding in patients with disorders of consciousness and cognitive-motor dissociation. NeuroImage: Clinical. 24, 101940-101940 Bevilacqua, M., Perdikis, S. and Millan, JDR., (2019). On Error-related Potentials during Sensorimotor-based Brain-Computer Interface: Explorations with a Pseudo-Online Brain-Controlled Speller. IEEE Open Journal of Engineering in Medicine and Biology. 1, 17-22 Biasiucci, A., Leeb, R., Iturrate, I., Perdikis, S., Al-Khodairy, A., Corbet, T., Schnider, A., Schmidlin, T., Zhang, H., Bassolino, M., Viceic, D., Vuadens, P., Guggisberg, AG. and Millán, JDR., (2018). Brain-actuated functional electrical stimulation elicits lasting arm motor recovery after stroke. Nature Communications. 9 (1), 2421- Perdikis, S., Tonin, L., Saeedi, S., Schneider, C. and Millán, JDR., (2018). The Cybathlon BCI race: Successful longitudinal mutual learning with two tetraplegic users. PLoS Biology. 16 (5), e2003787-e2003787 Corbet, T., Iturrate, I., Pereira, M., Perdikis, S. and Millán, JDR., (2018). Sensory threshold neuromuscular electrical stimulation fosters motor imagery performance. NeuroImage. 176, 268-276 Randazzo, L., Iturrate, I., Perdikis, S. and Millán, JDR., (2018). mano: A Wearable Hand Exoskeleton for Activities of Daily Living and Neurorehabilitation.. IEEE Robotics and Automation Letters. 3 (1), 500-507 Perdikis, S., Tonin, L. and del R. Millan, J., (2017). Brain racers. IEEE Spectrum. 54 (9), 44-51 Perdikis, S., Leeb, R. and Millán, JDR., (2016). Context-aware adaptive spelling in motor imagery BCI. Journal of Neural Engineering. 13 (3), 036018-036018 Sollfrank, T., Ramsay, A., Perdikis, S., Williamson, J., Murray-Smith, R., Leeb, R., Millán, JDR. and Kübler, A., (2016). The effect of multimodal and enriched feedback on SMR-BCI performance. Clinical Neurophysiology. 127 (1), 490-498 Sagha, H., Perdikis, S., Millan, JDR. and Chavarriaga, R., (2015). Quantifying Electrode Reliability During Brain–Computer Interface Operation. IEEE Transactions on Biomedical Engineering. 62 (3), 858-864 Perdikis, S., Leeb, R., Williamson, J., Ramsay, A., Tavella, M., Desideri, L., Hoogerwerf, E-J., Al-Khodairy, A., Murray-Smith, R. and Millán, JDR., (2014). Clinical evaluation of BrainTree, a motor imagery hybrid BCI speller.. Journal of Neural Engineering. 11 (3), 036003-036003 Leeb, R., Perdikis, S., Tonin, L., Biasiucci, A., Tavella, M., Creatura, M., Molina, A., Al-Khodairy, A., Carlson, T. and Millán, JDR., (2013). Transferring brain–computer interfaces beyond the laboratory: Successful application control for motor-disabled users. Artificial Intelligence in Medicine. 59 (2), 121-132 Show all Book chapters (3) Andrews, RJ., Sultana, M. and Perdikis, S., (2024). Neurotechnology: brain-machin",
  "content_length": 19300,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:37"
}