{
  "name": "Serengul Smith",
  "homepage": "http://www.cs.mdx.ac.uk/people/serengul-smith",
  "status": "success",
  "content": "Smith, Prof. Serengul – CS@MDX Skip to the content Close Menu Email: S.Smith @ mdx.ac.ukOffice: TG12a Town Hall Building, Hendon Campus About Associate Professor Courses: Research Interests Publications Repository Lessons from adopting a competency-based assessment approach for an introductory programming moduleAndroutsopoulos, K., Heeney, M., Smith, S. and Ticar, M.A. 2025. Lessons from adopting a competency-based assessment approach for an introductory programming module. ITiCSE 2025: Innovation and Technology in Computer Science Education. Nijmegen, Netherlands 27 Jun - 02 Jul 2025 Association for Computing Machinery (ACM). https://doi.org/10.1145/3724389.3731257Cloistered knowledge capture and retrieval: offline LLMs and vector search for enterpriseHall, S.J., Smith, S., Başkent, C. and de Raffaele, C. 2025. Cloistered knowledge capture and retrieval: offline LLMs and vector search for enterprise. 5th International Conference on Smart Information Systems and Technologies. Astana, Kazakhstan 14 - 16 May 2025 IEEE. https://doi.org/10.1109/sist61657.2025.11139171Evaluating the effectiveness of a collaborative framework on student learningZammit, O., Smith, S. and De Raffaele, C. 2024. Evaluating the effectiveness of a collaborative framework on student learning. 2024 International Conference on Machine Learning and Artificial Intelligence. Edinburgh, UK 21 - 23 Oct 2024 Pages Conferences.Adaptive PMME medium access control protocol for multi-event IoT sensor networksHang, N.T.T., Nguyen, H. and Smith, S. 2024. Adaptive PMME medium access control protocol for multi-event IoT sensor networks. 7th International Conference on Advanced Communication Technologies and Networking (CommNet). Rabat, Morocco 04 - 07 Dec 2024 IEEE. https://doi.org/10.1109/CommNet63022.2024.10793281A taxonomy of knowledge management systems in the micro-enterpriseHall, S.J., Smith, S., Baskent, C. and De Raffaele, C. 2024. A taxonomy of knowledge management systems in the micro-enterprise. International Journal of Operations Management. 4 (1), pp. 7-20. https://doi.org/10.18775/ijom.2757-0509.2020.41.4001Optimising student internet navigation: a comparative analysis of machine learning algorithms for action predictionZammit, O., Smith, S. and De Raffaele, C. 2024. Optimising student internet navigation: a comparative analysis of machine learning algorithms for action prediction. The Future of Education - 14th Edition International Conference. Florence, Italy 20 - 21 Jun 2024 Filodiritto Editore.Comparison of the effectiveness and performance of student workgroups in online wiki activities with and without AINalli, G. and Smith, S. 2023. Comparison of the effectiveness and performance of student workgroups in online wiki activities with and without AI. 4th International Electronic Conference on Applied Sciences. Online 27 Oct - 10 Nov 2023 MDPI. https://doi.org/10.3390/ASEC2023-16273Knowledge management for the micro enterprise: a taxonomyHall, S., Smith, S., Baskent, C. and De Raffaele, C. 2023. Knowledge management for the micro enterprise: a taxonomy. Matos, F. and Rosa, A. (ed.) 24th European Conference on Knowledge Management. Lisboa, Portugal 07 - 08 Sep 2023 Academic Conferences International (ACI). https://doi.org/10.34190/eckm.24.1.1268Artificial Intelligence to improve learning outcomes through online collaborative activitiesNalli, G., Amendola, D. and Smith, S. 2022. Artificial Intelligence to improve learning outcomes through online collaborative activities. Fotaris, P. and Blake, A. (ed.) 21st European Conference on e-Learning. Brighton, UK 27 - 28 Oct 2022 Academic Conferences International (ACI). pp. 475-479 https://doi.org/10.34190/ecel.21.1.661Reducing the dependency of having prior domain knowledge for effective online information retrievalZammit, O., Smith, S., Windridge, D. and De Raffaele, C. 2023. Reducing the dependency of having prior domain knowledge for effective online information retrieval. Expert Systems. 40 (4). https://doi.org/10.1111/exsy.13014« Previous1234Next » Address Department of Computer ScienceMiddlesex UniversityHendon Town HallThe BurroughsLondon NW4 4BT, United Kingdom Contact Us For enquiries about research collaboration & knowledge transfer, please contact Dr Aboubaker Lasebae. For postgraduate research enquiries (PhD & MRes), please contact Professor Juan Augusto. For undergraduate/postgraduate taught degrees (BSc & MSc), please contact the director of programmes Dr Serengul Smith.",
  "content_length": 4480,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:41"
}