{
  "name": "Sergio Maffeis",
  "homepage": "https://www.doc.ic.ac.uk/~maffeis",
  "status": "success",
  "content": "Sergio Maffeis Associate Professor in Computer Security Director of the Security and Machine Learning Lab. Research interests: web security, machine learning, formal methods. For a complete, but not up to date list of publications, see my DBLP page. Contact: Email: maffeis at doc ic ac uk Tel: +44 (0)2075948390 Office: 441 Huxley Address: Dr. Sergio Maffeis, Department of Computing, Imperial College London, SW7 2AZ, United Kingdom. Contents (show/hide all) Current events Teaching: Academic year 2025-2026 Papers on security and machine learning Papers on security and formal methods Final year projects PhD Students PhD applicants Funding and support PC Memberships Current events ACM Conference on Computer and Communications Security: CCS'26 (PC Member). ECAI Workshop on Generative Code Intelligence: GeCoIn'25 (Co-Organiser). [PDF] Clouesau: A Hierarchical Multi-Agent Approach For Autonomous Attack Investigation, with A. Aldaihan, F. Alotaibi. ACSAC 2025. [PDF] Poster: Towards Reproducible Attack Scenarios With Automated Labeling, with J. Xie, A. Aldaihan. ACSAC 2025. [PDF] Deep Learning from Imperfectly Labeled Malware Data, with F. Alotaibi, E. Goodbrand. CCS 2025. [PDF] Poster: Randomness Unmasked: Towards Reproducible and Fair Evaluation of Shift-Aware Deep Learning NIDS, with L. Steele, F. Alotaibi. CCS 2025. [PDF] The Richer Representation Fallacy: Are We Just Adding Noise to LLM-based Software Vulnerability Detectors?, with H. Hanif, N. Badrul Anuar. ICOCO 2025. [arXiv] Clutch Control: An Attention-based Combinatorial Bandit for Efficient Mutation in JavaScript Engine Fuzzing, with M. Foley, M. Fakhrur Rozi, T. Takahashi. arXiv 2025. [arXiv] KnowML: Improving Generalization of ML-NIDS with Attack Knowledge Graphs., with X. Guo, A. Merono Penuela, F. Pierazzi. arXiv 2025. [PDF] APIRL: Deep Reinforcement Learning for REST API Fuzzing, with M. Foley. AAAI 2025. [arXiv] Investigation of Advanced Persistent Threats Network-based Tactics, Techniques and Procedures, with A. Alageel. arXiv 2025. [arXiv] Detecting APT Malware Command and Control over HTTP(S) Using Contextual Summaries, with A. Alageel. arXiv 2025. [arXiv] Helping LLMs Improve Code Generation Using Feedback from Testing and Static Analysis, with G. Dolcetti, V. Arceri, E. Iotti, A. Cortesi, E. Zaffanella. arXiv 2024. [arXiv] HarmLevelBench: Evaluating Harm-Level Compliance and the Impact of Quantization on Model Alignment, with Y. Belkhiter, G. Zizzo. SafeGenAI@NeurIPS 2024. [OpenReview] MED: Exploring LLM Memorization on Encrypted Data, with P. Christodoulou, G. Zizzo. SafeGenAI@NeurIPS 2024. [PDF] Mateen: Adaptive Ensemble Learning for Network Anomaly Detection, with F. Alotaibi. RAID 2024. [PDF] Rasd: Semantic Shift Detection and Adaptation for Multi-Classification NIDS, with F. Alotaibi. IFIPSEC 2024. [arXiv] Differentially Private and Adversarially Robust Machine Learning: An Empirical Evaluation, with J. Thakkar, G. Zizzo. PPAI@AAAI 2024. [arXiv] Elevating Defenses: Bridging Adversarial Training and Watermarking for Model Resilience, with J. Thakkar, G. Zizzo. DAI@AAAI 2024. Teaching: Academic year 2025-2026 60015:70082 Network and Web Security (aka \"331\") This course provides an overview of current cybersecurity issues, attacks and defenses; an introduction to secure software development, threat modelling and pentesting; and an in-depth look at server- and client-side security for web applications. In-class lectures are complemented by practical sessions in the lab. More details can be found on the course web page. CTRL+F - A Practical Guide to Security Reviews This four-session mini-course (not for credits) offers a practical and accessible introduction to vulnerability research. Through a combination of theory, guided labs, and real-world case studies, you’ll learn how security vulnerabilities are discovered, from reviewing source code to using modern program analysis tools. More details can be found on the course web page. Selected papers on security and machine learning [PDF] SQIRL: Grey-Box Detection of SQL Injection Vulnerabilities Using Reinforcement Learning, with S. Al Wahaibi, M. Foley. USENIX Security 2023. In this paper we develop SQIRL, a novel approach to detecting SQL injection vulnerabilities based on deep reinforcement learning. Our approach generates a more varied set of payloads than existing scanners, leading to the discovery of more vulnerabilities with fewer requests. SQIRL discovered 22 novel vulnerabilities, grouped in 6 CVEs, in production grade web applications. [PDF] Adaptive Experimental Design for Intrusion Data Collection, with K. Highnam, Z. Hanif, E. Van Vogt, S. Parbhoo, N. Jennings. CAMLIS 2023. We introduce an adaptive experimental design for honeypot deployments that uncovers causal relationships between vulnerabilities and exploitation rates, reducing time and resource costs while improving data quality compared to observational studies and standard RCTs. [PDF] EarlyCrow: Detecting APT Malware Command and Control Over HTTP(S) Using Contextual Summaries, with A. Alageel. ISC 2022. In this paper, we present an approach to detect APT malware command and control over HTTP(S) contextual summaries, informed by a novel threat model focused on TTPs present in traffic generated by tools recently used as part of APT campaigns. [PDF] HAXSS: Hierarchical Reinforcement Learning for XSS Payload Generation, with M. Foley. IEEE TrustCom 2022. In order to increase the diversity of payloads that can be automatically generated to exploit web applications in a black-box fashion, we develop a hierarchical reinforcement learning approach where agents focus separately on the tasks of escaping the current context, and evading sanitisation. Our approach improves on the state of the art of automated web scanners, and discovers 5 new CVEs in 3 production-grade web applications. [PDF] VulBERTa: Simplified Source Code Pre-Training for Vulnerability Detections, with H. Hanif. IEEE IJCNN 2022. This paper presents a deep learning model pre-trained to learn a deep knowledge representation of C/C++ syntax and semantics, and then fine-tuned to obtain vulnerability detection classifiers. The evaluation results show that our classifiers outperform existing approaches across different datasets, despite their relative simplicity, and limited cost in terms of size of training data and number of model parameters. [PDF] A Hybrid Graph Neural Network Approach for Detecting PHP Vulnerabilities, with R. Rabheru, H. Hanif. IEEE DSC 2022. We present DeepTective, a deep learning approach to detect vulnerabilities in PHP source code, leveraging both syntactic and semantic information. Experimental results show that our model outperformed related solutions on both synthetic and realistic datasets, and was able to discover 4 novel vulnerabilities in established WordPress plugins. [PDF] Certified Federated Adversarial Training, with G. Zizzo, A. Rawat, M. Sinn, C. Hankin. NFFL@NeurIPS 2021. We tackle the scenario of securing FL systems conducting adversarial training when a quorum of workers could be completely malicious. We model an attacker who poisons the model to insert a weakness into the adversarial training such that the model displays apparent adversarial robustness, while the attacker can exploit the inserted weakness to bypass the adversarial training and force the model to misclassify adversarial examples. We use abstract interpretation techniques to detect such stealthy attacks and block the corrupted model updates. We show that this defence can preserve adversarial robustness even against an adaptive attacker. [PDF] Hawk-Eye: Holistic Detection of APT Command and Control Domains, with A. Alageel. ACM SAC 2021, (Security Track). We study the usage of domains in the context of the Command and Control infrastructure of APTs, focusing in particular on evasion techniques, and we build a machine learning classifier that leverages novel sematic and structural features of malicious domains to detect APTs. [PDF] Adversarial Attacks on Time-Series Intrusion Detection for Industrial Control Systems, with G. Zizzo, C. Hankin, K. Jones. IEEE TrustCom 2020. In this work we investigate the use of neural networks for intrusion detection on industrial control systems. We demonstrate their vulnerability to adversarial attacks and identify potential over-estimation of performance arising from data leakage artefacts. [arXiv] Deep Latent Defence, with G. Zizzo, C. Hankin, K. Jones. CoRR 2019. This work introduces deep latent defence, a technique that makes neural-network based classifiers more resistant against adversarially-crafted attacks. [PDF] Adversarial Machine Learning Beyond the Image Domain, with G. Zizzo, C. Hankin, K. Jones. DAC 2019. This work gives a brief overview of adversarial machine learning, suggests key differences with the use of machine learning in the cyber domain, and shows an adversarial attack on an industrial control system. Selected papers on security and formal methods [PDF] Abstract Domains for Type Juggling, with V. Arceri. NSAD 2016. We provide a formal semantics for the core of PHP with type juggling, and propose a precise type analysis based on abstract interpretation. [PDF] BrowserAudit: Automated Testing of Browser Security Features, with C. Hothersall-Thomas and C. Novakovic. ISSTA 2015. A web application and testing framework comprising more than 400 security test for web browsers. Try it: browseraudit.com. [PDF] Defensive JavaScript: Building and Verifying Secure Web Components, with K. Bhargavan, A. Delignat-Lavaud. FOSAD VII Lecture Notes LNCS 8604, 2014. This is an introductory tutorial based on our USENIX Security 2013 paper Language-based Defenses Against Untrusted Browser Origins [PDF]. [PDF] An Executable Formal Semantics of PHP, with D. Filaretti. ECOOP 2014. The K semantics of PHP, together with our interpreter/model-checker for PHP is available on phpsemantics.org. [PDF] A Trusted Mechanised JavaScript Specification",
  "content_length": 17168,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:47"
}