{
  "name": "Sergei N. Artëmov",
  "homepage": "http://sartemov.ws.gc.cuny.edu",
  "status": "success",
  "content": "Sergei N. Artemov Skip to the content Close Menu Distinguished Professor The Graduate Center of the City University of New York, Computer Science Mathematics Philosophy Professional interests logic in computer science mathematical logic and proof theory knowledge representation and artificial intelligence automated deduction and verification optimal control and hybrid systems. For details check research statement and major scientific accomplishments. Degrees Full Professor in Mathematics and Computer Science, Moscow State University, 1993 Doctor of Sciences in Mathematics, USSR Academy of Sciences, 1988 Ph.D. in Mathematics, Moscow University/USSR Academy of Sciences, 1980 Diploma with Perfection in Mathematics, Moscow State University, 1975 Publications Over 150 papers. For recent publications in English check selected publications list. Honors A keynote lecture for CLS’03, KGC’03, ESSLLI’03, Venna, 2003. ( ps, pdf) 50th birthday article Distinguished Lecture in Computer Science at the New York Academy of Sciences, 2002 Clifford Lectures, 2002 Spinoza Lecture of 1999 from the European Association for Logic, Language and Information Paper Operational Modal Logic commended for its excellence by the Committee on the IGPL/FoLLI Prize For the Best Idea of the Year, 1996 Award from the President of Russia “To Outstanding Scientist”, 1994 Award for the best paper of the year from the Mathematical Institute of Russian Academy of Sciences, 1994 Award for the best paper of the year from the Mathematical Institute of USSR Academy of Sciences, 1986 Award for the best project of the year from the Optimal Control Institute of  USSR Academy of Sciences, 1979 USSR National Olympiad (Eastern Conference): Gold Medal in mathematics, Silver Medal in physics, 1967 Address: 365 Fifth Avenue, rm 4319 New York, NY 10016 tel. (212) 817-8661 fax (212) 817-1510 Email",
  "content_length": 1873,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:46"
}