{
  "name": "Sergios Theodoridis",
  "homepage": "http://cgi.di.uoa.gr/~stheodor",
  "status": "success",
  "content": "Sergio's Theodoridis personal page About Activities Publications Funding Awards Books Society Contact More about Sergios Download Full CV Teaching Activities Contact e: stheodor [at] di.uoa.gr ph: +30 2107275328 Department of Informatics and Telecommunications National and Kapodistrian University of Athens, Panepistimiopolis Ilissia, 157 84 Athens, GREECE About Sergios Theodoridis Sergios Theodoridis is currently Professor Emeritus of Signal Processing and Machine Learning in the Department of Informatics and Telecommunications of the National and Kapodistrian University of Athens. He has held a Distinguished Professor Chair in Aalborg University, Denmark, 2020-2024, and a part time Chair in the Chinese University of Hong Kong, Shenzhen, China, 2017-2019. His research interests lie in the areas of Adaptive/Online Learning Algorithms, Distributed and Sparsity-Aware Learning, Machine Learning, and in a range of related applications, such as speech and audio, communications and medical imaging. He is the co-editor of the book \"Efficient Algorithms for Signal Processing and System Identification\", Prentice Hall 1993, the co-author of the best selling book \"Pattern Recognition\", Academic Press, 4th ed., 2009, the co-author of the book \"Introduction to Pattern Recognition: A MATLAB Approach\", Academic Press, 2010, the author of the book \"Machine Learning: From the Classics to Deep Networks, Transformers and Diffusion Models\", 3rd Ed., Academic Press, 2025, and the co-author of three books in Greek, two of them for the Greek Open University. He has served as Editor-in-Chief for the IEEE (Institute of Electronics and Electrical Engineers) Transactions on Signal Processing, which is the leading journal in Signal Processing. He is Editor-in-Chief for the Signal Processing Book Series, Academic Press and co-Editor in Chief (with Rama Chellappa) for the E-Reference Signal Processing, Elsevier. He is the co-author of seven papers that have received Best Paper Awards including the 2014 IEEE Signal Processing Magazine best paper award and the 2009 IEEE Computational Intelligence Society Transactions on Neural Networks Outstanding Paper Award. He has received an honorary doctorate degree (D.Sc) from the University of Edinburgh, UK, in 2023. He is the recipient of a number of highly prestigious awards, the 2021 IEEE Signal Processing Society (SPS) Norbert Wiener Award, which is the society’s highest honor, the 2017 EURASIP European Association for Signal processing) Athanasios Papoulis Award, the 2014 IEEE Signal Processing Society Carl Friedrich Gauss Education Award, and the 2014 EURASIP Meritorious Service Award. He has served as a Distinguished Lecturer of the IEEE Signal Processing (SP) and IEEE Circuits and Systems (CAS) Societies. He was Otto Monstead Guest Professor, Technical University of Denmark, 2012, and holder of the Excellence Chair, Dept. of Signal Processing and Communications, University Carlos III, Madrid, Spain, 2011. He has served as Vice President (publications) of the IEEE Signal Processing Society (SPS), as President of EURASIP, as Chair of the Awards Board of the IEEE SP Society, as a member of the Board of Governors for the IEEE CAS Society, as a member of the Board of Governors (Member-at-Large) of the IEEE SP Society and as a Chair of the Signal Processing Theory and Methods (SPTM) technical committee of IEEE SPS. He was the general chairman of EUSIPCO-1998, the Technical Program co-chair for ISCAS-2006 and ISCAS-2013, co-chairman and co-founder of CIP-2008, co-chairman of CIP-2010, Technical Program co-chair of ISCCSP-2014. and co-Chair of EUSIPCO-2017. Currently, he is in charge of the Education activities of the Hellenic Robotics Center of Excellence HERON. He also serves as a member of the Board of Governors of the National Technical University of Athens (NTUA), as a member of the Scientific Advisory Board of the ARCHIMEDES research center for AI, Data Science and Algorithms, and he is a member of the National (Greek) Commission for Bioethics &Technoethics. He has served as a member of the Greek National Council for Research and Technology and he was Chairman of the SP advisory committee for the Edinburgh Research Partnership (ERP). He has served as vice chairman of the Greek Pedagogical Institute and he was for four years member of the Board of Directors of COSMOTE (the Greek mobile phone operating company). He is Fellow of IET, a Corresponding Fellow of the Royal Society of Edinburgh (RSE), a Fellow of EURASIP and a Life Fellow of IEEE. Besides his technical and scientific activities, he is heavily involved with the social and political implications of Technology. He is regularly contributing articles and interviews in newspapers and electronic sites and TV Channels. Currently, he serves as Vice-president of the Think Tank DIKTIO (Network for Reform in Greece and Europe). © 2014 Department of Informatics and Telecommunications - UoA",
  "content_length": 4944,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:50"
}