{
  "name": "Sergei Gorlatch",
  "homepage": "https://www.uni-muenster.de/PVS/personen/gorlatch.html",
  "status": "success",
  "content": "Prof. Dr. Sergei Gorlatch Einsteinstr. 6248149 MünsterForschungsschwerpunkteAlgorithmen- und Softwareentwicklung für moderne RechnersystemeParallele und verteilte Systeme, Middleware, Grids und CloudsHochleistungsrechnen, multi-core und GPU-basierte SystemeVerteilte Anwendungen: Online Spiele, SimulationenPerformance-Modelle und OptimierungWeitere Zugehörigkeit an der Universität MünsterInstitut für InformatikVitaAkademische Ausbildung1998Habilitation an der Universität Passau, Erlangung der Venia legendi für Informatik, Habilitationsthema: \"Abstraction and Performance in the Development of Programs for Parallel and Networked Systems\"1984Promotion zum Dr. rer. nat. in Informatik am Institut für Kybernetik der Akademie der Wissenschaften in Kiew, Dissertationsthema: \"Algebren von Datenstrukturen und ihre Anwendung in Parallelen Systemen\", Betreuer: Prof. A. Letichevsky1974 – 1979Studium der Angewandten Mathematik und Informatik (Diplom) an der Universität Kiew1979Diplom in Angewandter Mathematik und Informatik, Universität KiewBeruflicher Werdegang2006 – 2009Gastprofessor, Universität Iwate, Japanseit 10.2003Universitätsprofessor (C4), Inhaber des Lehrstuhls für Praktische Informatik (Parallele und Verteilte Systeme) der Westfälischen Wilhelms-Universität Münster10.2000 – 09.2003Universitätsprofessor (C3) für Parallele und Verteilte Programmierung, Technische Universität Berlin1998 – 2000Oberassistent (C2), Universität Passau1999Gastprofessor, Universität Lyon, Frankreich1997Gastprofessor, Universität Pisa, Italien1992 – 1997Wissenschaftlicher Assistent (C1) und Habilitand, Universität Passau1991 – 1992Gastprofessor an der TU München als Research Fellow der Alexander-von-Humboldt-Stiftung (Bonn)1984 – 1991Projektgruppenleiter am Institut fuer Kybernetik, KiewPreise2019Best Poster Award – Programming and Tuning Massively Parallel Systems + Artificial Intelligence Conference (PUMPS+AI)2018Best Paper Award – CGO Conference Committee1991Research Fellowship – Alexander-von-Humboldt StiftungMitgliedschaften und Aktivitäten in Gremienseit 2007Mitglied des Editorial Boards des \"Journal of Cluster Computing\"seit 2005Mitglied des Editorial Boards der Zeitschrift \"Multiagent and Grid Systems\"seit 2002Herausgeber des \"Journal of Programming and Artificial Intelligence\"2000 – 2004Vorsitzender des Programm-Ausschusses des \"International Workshop on Constructive Methods for Parallel Programming\"Rufe2003Ruf an die TU Berlin (abgelehnt)Technische Universität Berlin – abgelehnt2003Ruf an die Universität Düsseldorf (abgelehnt)Heinrich-Heine-Universität Düsseldorf – abgelehnt2000Ruf an die Universität Gießen, (abgelehnt)Justus-Liebig-Universität Gießen – abgelehntProjektePerformance, Portabilität und Produktivität für Deep-Learning Anwendungen auf Multi- und Many-Core Architekturen – PPP-DL (2022 – 2025)Gefördertes Einzelprojekt: DFG - Sachbeihilfe/Einzelförderung | Förderkennzeichen: GO 756/8-1Automatische Skalierbarkeit in verteilten Systemen mit Echtzeit-Anforderungen (2018 – 2022)Gefördertes Einzelprojekt: GS electronic Gebr. Schönweitz GmbHNVIDA Graduate Fellowship award (2019 – 2020)Gefördertes Einzelprojekt: Nvidia CorporationVerbundprojekt: HPC2SE - Hardware- und Leistungsorientierte Codegenerierung für Informatik und Ingenieurwesen – HPC²SE (2017 – 2019)Beteiligung an einem bundesgeförderten Verbund: Bundesministerium für Forschung, Technologie und Raumfahrt | Förderkennzeichen: 01IH16003BEXC 1003 A6 - Analyse von Bewegung in Zellsysytemen (2012 – 2019)Teilprojekt in DFG-Verbund koordiniert an der Universität Münster: DFG - Exzellenzcluster | Förderkennzeichen: EXC1003/19th International Symposium on High-Level Parallel Programming and Applications (2016)Wissenschaftliche Veranstaltung: Teilnahmebeiträge/TagungsgebührenData Structures and Algorithms for RDF on Many-Core Systems (2014 – 2016)Beteiligung in sonstigem Verbundvorhaben: Deutscher Akademischer Austauschdienst | Förderkennzeichen: 57084841Mobile Cloud Computing: Networks, Services and Architecture – MONICA (2012 – 2014)EU-Projekt koordiniert außerhalb der Universität Münster: EU FP 7 - Marie Curie Actions - Internationaler Forschungspersonalaustausch | Förderkennzeichen: PIRSES-GA-2011-295222OpenFlow in Real-Time Internet Edutainment – OFERTIE (2012 – 2014)EU-Projekt koordiniert außerhalb der Universität Münster: EU FP 7 - Collaborative Project | Förderkennzeichen: 318665SFB 656 PM13 - Parallele 4D-Bildrekonstruktionsverfahren – SFB 656 PM13 (2011 – 2012)Teilprojekt in DFG-Verbund koordiniert an der Universität Münster: DFG - SonderforschungsbereichOptimierung von Scheduling-Mechanismen innerhalb der ATIS-Softwareprodukte (2009 – 2010)Gefördertes Einzelprojekt: WirtschaftA scalable QoS-enabled business Grid Environment for multi-user real-time online interactive applications – EDUTAIN@GRID (2006 – 2009)EU-Projekt koordiniert außerhalb der Universität Münster: EU FP 6 - Specific Targeted Research Projects | Förderkennzeichen: 034601Durchführung einer gemeinsam betreuten Diplomarbeit/Vereinbarung mit der OVSoftware GmbH (2008 – 2009)Gefördertes Einzelprojekt: WirtschaftITSoftTeam – ITSoftTeam (2006 – 2009)EU-Projekt koordiniert außerhalb der Universität Münster: EU - TEMPUS | Förderkennzeichen: TEMPUS CD_JEP-26195-2005European research network on foundations, software infrastructures and applications for large scale distributed, grid and peer-to-peer technologies – CoreGrid (2004 – 2008)EU-Projekt koordiniert außerhalb der Universität Münster: EU FP 6 - Networks of Excellence | Förderkennzeichen: 4265Collective Operations: Formal Framework, Equalities, Efficiency – COFFEE (2003 – 2006)Gefördertes Einzelprojekt: DFG - Sachbeihilfe/Einzelförderung | Förderkennzeichen: GO 756/4-2Publikationen 20242023202220212020201920182017201620152014201320122011201020092008200720062005200420032002200120001999199819971996199519941992199119901989198819871986198519841983198219812024Jarrous-Holtrup, S, Abdinghoff, J, Schamel, F, und Gorlatch, S. 2024. „Towards an Autoscaling Service for Real-Time Online Interactive Applications on Clouds.“ In Euromicro Conference on Parallel, Distributed and Network-Based Processing, herausgegeben von A Chis und H. González-Vélez. Dublin: Wiley-IEEE Press. doi: 10.1109/PDP62718.2024.00024.Tomak, J., Liermann, A., und Gorlatch, S. 2024. „Performance Evaluation of a Legacy Real-Time System: An Improved RAST Approach.“ In Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering, herausgegeben von JL. Guisado-Lizar, A. Riscos-Núñez, MJ. Morón-Fernández und G. Wainer. Cham: Springer. doi: 10.1007/978-3-031-57523-5_2.Garanina, N., und Gorlatch, S. 2024. „KNOWLEDGE ACQUISITION IN MULTI-AGENT SYSTEMS: A FORMALIZATION OF THE ELEUSIS CARD GAME.“ Journal of Mathematical Sciences 281 (2). doi: 10.1007/s10958-024-07107-y.Köpcke, Bastian, Gorlatch, Sergei, und Steuwer, Michel. 2024. „Descend: A Safe GPU Systems Programming Language.“ Proceedings of the ACM on Programming Languages 8 (PLDI): 841–864. doi: 10.1145/3656411.2023Garanina, N, und Gorlatch, S. 2023. „Autotuning Parallel Programs by Model Checking.“ Automatic Control and Computer Sciences 56 (7): 634–648. doi: 10.3103/S0146411622070045.Rasch, Ari, Schulze, Richard, Shabalin, Denys, Elster, Anne, Gorlatch, Sergei, und Hall, Mary. 2023. „(De/Re)-Compositions Expressed Systematically via MDH-Based Schedules.“ In CC 2023: Proceedings of the 32nd ACM SIGPLAN International Conference on Compiler Construction, herausgegeben von Clark Verbrugge. New York: ACM Press. doi: 10.1145/3578360.3580269.Hagedorn, Bastian, Lenfers, Johannes, Koehler, Thomas, Qin, Xueying, Gorlatch, Sergei, und Steuwer, Michel. 2023. „Achieving High Performance the Functional Way: Expressing High-Performance Optimizations as Rewrite Strategies.“ Communications of the ACM 66 (3): 89–97. doi: 10.1145/3580371.Jarrous-Holtrup, S., Gorlatch, S., Dey, M., und Schamel, F. 2023. „Multi-Cloud Container Orchestration for High-Performance Real-Time Online Applications.“ In Euromicro Conference on Parallel, Distributed and Network-Based Processing, herausgegeben von R. Montella, A. Ciaramella, M. Lapegna, M. Danelutto und D. Blanco Heras. Neapel: Wiley-IEEE Computer Society Press. doi: 10.1109/PDP59025.2023.00054.Jarrous-Holtrup, S., Gorlatch, S., Dey, M., und Schamel, M. 2023. „An OpenVPN-Based Interconnection in Multi-Clouds with Windows and Linux nodes.“ In Consumer Communications and Networking Conference, CCNC IEEE, herausgegeben von K. Chowdhury. Las Vegas: Wiley-IEEE Computer Society Press. doi: 10.1109/CCNC51644.2023.10059709.2022Mohammed, O.T., Paznikov, A.A., und Gorlatch, S. 2022. „Accelerating Neural Network Training Process on Multi-Core Machine Using OpenMP.“ In 2022 III International Conference on Neural Networks and Neurotechnologies (NeuroNT), herausgegeben von IEEE. Sankt Petersburg: Wiley-IEEE Press. doi: 10.1109/NeuroNT55429.2022.9805549.Abadeer, Mina, Magharious, Sameh, und Gorlatch, Sergei. 2022. „Modeling and interactive simulation of measures against infection transmission.“ Simulation: Transactions of the Society for Modeling and Simulation International I (20). doi: 10.1177/00375497221133849.Garanina, N., Staroletov, S., und Gorlatch, S. 2022. „Model Checking Meets Auto-Tuning of High-Performance Programs.“ In Logic-Based Program Synthesis and Transformation, Bd. 13474 aus Lecture Notes in Computer Science, herausgegeben von A. Villanueva. Cham: Springer. doi: 10.1007/978-3-031-16767-6_4.Tomak, J, und Gorlatch, S. 2022. „RAST: Evaluating Performance of a Legacy System Using Regression Analysis and Simulation.“ In 2022 30th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS), herausgegeben von ",
  "content_length": 66721,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:43"
}