{
  "name": "Serge J. Belongie",
  "homepage": "https://di.ku.dk/ai-centre",
  "status": "success",
  "content": "Pioneer Centre for AI – Københavns Universitet Datalogisk Institut Datalogisk Institut Datalogisk Institut Pioneer Centre for AI Pioneer Centre for AI The Pioneer Centre for Artificial Intelligence opened in Copenhagen at the end of 2021. The centre conducts world-class artificial intelligence research focusing on societal challenges, people and design while putting Denmark at the international forefront. Collaboratories The centre will be organized in a collaboratory structure, with seven collaboratories structured around an AI research theme with 2-3 PIs as well as PhD students and postdocs attached. Collaboratory Co-lead / PI 💡 Cx - Causality and Explainability Sebastian Weichwald, Assistant Professor, Department of Mathematical Sciences, UCPHAasa Feragen, Professor, DTU ComputeIra Assent, Professor, Department of Computer Science, AU 🥽 Xr - Extended Reality Dan Witzner Hansen, Professor, Department of Computer Science, ITUKasper Hornbæk, Professor, Department of Computer Science, UCPHHans Gellersen, Professor, Department of Computer Science, AU 🦜 Fg - Fine-Grained Analysis Mads Nielsen, Professor, Department of Computer Science, UCPHThomas Moeslund, Professor, Department of Architecture, Design and Media Technology, AAU 🎯 Lo - Learning Theory and Optimization Ole Winther, Professor, Department of Biology, UCPHChristian Igel, Professor, Department of Computer Science, UCPH ⚡️ Sd - Signals and Decoding Lars Kai Hansen, Professor, DTU ComputeZheng-Hua Tan, Professor, Department of Electronic Systems, AAU 💬 Sl - Speech and Language Christian Hardmeier, Associate Professor, Computer Science Department, ITUIsabelle Augenstein, Professor, Department of Computer Science, UCPH 🔗 Ng - Networks and Graphs Sune Lehmann Jørgensen, Professor, DTU ComputeRoberta Sinatra, Professor, Center for Social Data Science, UCPH and ITU. Societal Challenges The centre will target 10 societal challenges: Biotech, Life, and Health Sciences Climate and Conservation Education and Capacity Building Equality and Inclusion Economic Growth and Entrepreneurship Crisis Response Information Verification and Validation Energy and Infrastructure Security, Ethics, and Justice Public and Social Sector Funding The centre has received DKK 352,4 million (€47 million) from the following foundations: Participants / Partners Aalborg University (AAU) Aarhus University (AU) The Technical University of Denmark (DTU) The IT University of Copenhagen (ITU) The University of Copenhagen (UCPH) Management The centre will be headed by professor Serge Belongie and be rooted in the Department of Computer Science (DIKU) at the University of Copenhagen, with COO Michelle Cumming Løkkegaard. Contact aicentre@ku.dk Michelle Cumming LøkkegaardChief Operating Officermcl@di.ku.dk Website Visit our new website:https://www.aicentre.dk/ Leading American researcher and DKK 350 million will take Danish artificial intelligence research to new heights A new pioneer centre for artificial intelligence research is expected to  open in Copenhagen at the end of 2021. Headed by world-leading American AI researcher, Serge Belongie, and with a good DKK 350 million to back it, the centre will conduct world-class artificial intelligence research focusing on societal challenges, people and design, while putting Denmark at the international forefront. Datalogisk Institut Københavns Universitet Universitetsparken 52100 København ØEAN: 5798000422421CVR: 29979812P-nummer: 1012361358 Kontakt: Datalogisk Institut info@di.ku.dk",
  "content_length": 3506,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:41"
}