{
  "name": "Sergio F. Ochoa",
  "homepage": "https://www.dcc.uchile.cl/sochoa",
  "status": "success",
  "content": "Sergio F. Ochoa - Home Page :: Home :: Publications :: Projects :: Students :: Related Links :: Professional :: Contact me :: SERGIO F. OCHOA Associate Professor of Computer Science Department at the University of Chile. ORCID: 0000-0002-0431-8767 Educational Studies: - 2003 - Post-doctoral studies at the CEE Department, University of Illinois at Urbana-Champaign, USA. - 2002 - Doctor in Engineering Science (Computer Science) at Pontificia Universidad Catolica de Chile. Santiago, Chile. - 1996 - Software Systems Engineer at UNICEN, Argentina. Current Interest Areas: - Software Engineering (projects pre-contract, upfront software engineering, collaboration in software development, requirements engineering, software architecture, software process, software engineering education). - Collaboration Technology applied to several application domains (urban emergencies, disaster relief efforts, elderly caregiving, systems modeling, software development). - Mobile/Ubiquitous/Social Computing (particularly context-awareness interactions, loosely-coupled work, and systems modeling). Undergraduate Courses: -       Software Project Formulation and Management (CC4402) -       Software Engineering II (CC5401) -       Social Computing (CC5703) Graduate Courses: -       Software Architecture (CC63J) -       Advanced Topics in Software Engineering (CC72R) -       Requirements Engineering (CC63H) -       IT Projects Management (CC63B) Administration: - Head of the CS Undergraduate Program, 2018-2020. -       Head of the Computer Science Department (DCC), Univ. of Chile, 2014-2016. -       Deputy Head of the Computer Science Department (DCC), Univ. of Chile, 2007-2008, 2012-2014, 2016-2018. -       Head of the Continuing Education Program, 2001-2003, 2011-2013. -       Coordinator of the External Projects, 2009-2011. -       Coordinator of IT Master Program, 2004-2008, 2021-2022, 2024-today. Memberships: - Latin American and Caribbean Collaborative ICT Research (LACCIR) - Chilean Computer Science Society (SCCC) - IEEE Computer Society (IEEE CS) - Association for Computing Machinery (ACM) - Latin American Center for Computer Science Studies (CLEI) ______________________________________________________________ Beauchef 851, 3er. Piso, Ofic. 322, Casilla 2777, Santiago, Chile Phone: +(56 22) 978-4879 or 978-4364/5. E-mail: sochoa@dcc.uchile.cl _______________________________________________________________________ Home | Publications | Projects | Students | Related Links | Professional | Personal | Contact Me",
  "content_length": 2531,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:50"
}