{
  "name": "Sergiu Dascalu",
  "homepage": "https://www.cse.unr.edu/~dascalus",
  "status": "success",
  "content": "Sergiu Dascalu's Home Page Sergiu Dascalu, PhD Department of Computer Science and Engineering Mailstop 171 University of Nevada Reno, NV 89557 Office: SEM-236 Tel: (775) 784-4613 Fax: (775) 784-1877 E-mail: dascalus@unr.edu Background I am a Professor in the Department of Computer Science and Engineering (CSE) at the University of Nevada, Reno (UNR), which I joined in July 2002. I have a PhD degree in Computer Science (2001) from Dalhousie University, Canada and a Master’s degree in Automatic Control and Computers (1982) from the Polytechnic of Bucharest, Romania. At UNR I am also the Director of the Software Engineering Lab (SOELA) and the Co-Director of the Cyberinfrastructure Lab (CIL), which are part of the Data and Software Systems cluster of the CSE Department. Since joining UNR, I have worked on research projects funded by federal agencies (NSF, NASA, DoD-ONR) as well as the local industry (Bally Tech, GE, PC Doctor). I have advised many PhD, Master, and undergraduate students. I have created several new courses, both graduate and undergraduate, and taught the capstone courses Software Engineering and Senior Projects in CSE. At UNR I received several awards, including the 2005 UNR College of Engineering’s Lemelson Award for Innovation in Teaching and Research, the 2009 Nevada Center for Entrepreneurship’s Faculty Advisor Award, the 2011 UNR Outstanding Undergraduate Research Faculty Mentor Award, the 2011 UNR Donald Tibbitts Distinguished Teacher of the Year Award, the 2014 CoEN Faculty Excellence Award, the 2019 UNR GSA Outstanding Graduate Mentor Award, and the 2023 CSE Best Faculty Teaching Award. Many of my students have received awards and recognitions, more recently Gavin Claire (Spring 2022 College of Engineering Senior Scholar), Adam Cassell (2022 Outstanding CSE Master Thesis Award 2022 and Best Student Paper Award at ITNG-2021), Nicole Beaulieu (2022 CSE IWD Award for Inclusive Practices), Youngsook Choi (2023-2024 UNR Graduate Dean Merit Scholarship), Hossein Jamali (2024 UNR Outstanding Graduate Student Advocacy Award) and Vinh Le (2022 and 2023 Outstanding CSE TA Award, Best Student Paper Award at ITNG-2022, UNR 2022-2023 and 2023-2024 Graduate Dean Merit Scholarhip, and 2024 UNR Oustanding Domestic Graduate Student Scholarship). Further details can be found in my curriculum vitae (February 2025). Research My main research interests are in Software Engineering (in particular, software for scientific and interdisciplinary research, requirements specification, software environments, and software systems) and Human-Computer Interaction (user interface design, virtual environments, and simulation environments). Other interests include Data Science and Computer-Aided Education. The following may provide additional details on my research: Publications (selection) Projects Awards PhD thesis (2001) Teaching After sabbatical in 2023/2024, in Fall 2024 I will teach CS 791 Advanced Topics on Human-Computer Interaction (15 graduate students) and CS 420/620 Human Computer Interaction (50 undergrad and grad students) -- details are available on UNR Web Campus. Information about other courses that I taught in the past as well as on courses that I will teach next semester can be found here: Past courses Future courses Sample senior projects videos posted on youtube can be accessed via this page. Graduate students advised Current students Alumni Academic Services (recent) Member of UNR Senate (2020-2023) Member of UNR University Research Council (2020-2023) Member of UNR Travel Grants committee (2022-2023) Member of UNR Board of Regents Awards committee (2022-2023) Chair of UNR Donald Tibbitts Distinguished Teacher of the Year review panel (2019-2020) Member of UNR Donald Tibbitts Distinguished Teacher of the Year review panel (2018-2019) Member of UNR Outstanding Undergraduate Research Faculty Mentor Award committee (2019) Chair of College of Engineering Personnel and Evaluation committee (2019-2022) Chair of the Faculty Evaluation committee, CSE Department (2023) Member of Search committees of the CSE Department (last one in 2019) Member of the Undergraduate Committee, CSE Department (2017-2020) Member of the Facilities committee, CSE Department (2020-present) Other Professional Activities (recent) Member of technical program committee for the following conferences: CSEDU-2025, Porto, Portugal, April 2025 IISA-2024, Grand Arsenali, Chania, Crete, Greece, July 2024 ICSOFT-2024, Dijon, France, July 2024 CSEDU-2024, Angers, France, May 2024 ESSE-2023, Napoli, Italy, December 2023 ICSOFT-2023, Rome, Italy, July 2023 CSEDU-2023, Prague, Czech Republic, April 2023 SERD-2022, Oklahoma City, OK, October 2022 ESSE-2022, Rome, Italy, October 2022 Reviewer for journals: International Journal of Human-Computer Interaction Springer Nature in Computer Science Multimedia Tools and Applications ACM Database Journal of Systems and Software Future Generation Computer Systems PeerJ Computer Science Reviewer/panelist for grant applications Reviewer for the NSF CSSI program solicitation, 2023 Reviewer for the NSF GRFP program solicitation, 2021-2022 Reviewer for ARO/DoD US and the Global Challenges Research Fund (GCRF) UK (2020)",
  "content_length": 5210,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:49"
}