{
  "name": "Sergej Fatikow",
  "homepage": "https://uol.de/informatik/amir/personen/prof-dr-ing-habil-sergej-fatikow",
  "status": "success",
  "content": "Prof. Dr.-Ing. habil. Sergej Fatikow // Universität Oldenburg Fk. II Department für Informatik Mikrorobotik und Regelungstechnik Prof. Dr.-Ing. habil. Sergej Fatikow Leitung Prof. Dr.-Ing. habil. Sergej Fatikow Sekretariat Anja Hiller Team Personen Kontakt und Anreise Prof. Dr.-Ing. habil. Sergej Fatikow Universität Oldenburg Department für Informatik - AMiR 26111 Oldenburg A1-3-303 (0441) 798-4291 (0441) 798-3141 Donnerstag, 14.00-15.00 Uhr und nach Vereinbarung fatikow@uol.de Prof. Dr.-Ing. habil. Sergej Fatikow studierte an der Flugtechnischen Universität Ufa in Rußland Informatik und Elektrotechnik und promovierte 1988 über die Fuzzy-Regelung komplexer nichtlinearer Systeme. Von 1988 bis 1990 war er als Dozent an derselben Universität tätig. Während seiner Tätigkeit in Rußland veröffentlichte er über 30 Journalartikel und Konferenzbeiträge und erwarb über 50 Patente auf dem Gebiet intelligenter Steuerung. Von 1990 bis 2000 arbeitete er am Institut für Prozessrechentechnik, Automation und Robotik der Universität Karlsruhe und leitete seit 1994 die Forschungsgruppe \"Mikrorobotik und Mikromechatronik\". Er wurde 1996 Assistenzprofessor und habilitierte sich 1999 auf dem Gebiet der Mikrorobotik und Mikromontage. Ein Jahr später wurde Sergej Fatikow auf eine Professur für Regelungs- und Automatisierungstechnik an der Universität Kassel berufen. Im Jahr 2001 hat er einen weiteren Ruf an die Universität Oldenburg angenommen und leitet seitdem die von ihm gegründete Abteilung für Mikrorobotik und Regelungstechnik. Seine Forschungsinteressen umfassen Mikro- und Nanorobotik, automatisierte Nanohandhabung im Rasterelektronenmikroskop, sensorische Rückkopplung bei der Nanohandhabung, Mikro- und Nanomontage, Rastersondenmikroskopbasierte Nanohandhabung, sowie die Anwendung künstlicher neuronaler Netze und der Fuzzy-Logik in Robotik und Automation. Sergej Fatikow veröffentlichte drei Bücher, \"Microsystem Technology and Microrobotics\", Springer, 1997, \"Mikroroboter und Mikromontage\", Teubner, 2000, und \"Automated Nanohandling by Microrobots\", Springer, 2008. Webmaster (Stand: 20.06.2024) |  Kurz-URL:Shortlink: https://uol.de/p39039 Zum Seitananfang scrollen Scroll to the top of the page",
  "content_length": 2213,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:44"
}