{
  "name": "Sethu Vijayakumar",
  "homepage": "http://homepages.inf.ed.ac.uk/svijayak",
  "status": "success",
  "content": "Sethu Vijayakumar, Professor of Robotics, University of Edinburgh, UK Professor Sethu Vijayakumar FRSE Professor of Robotics & Microsoft Research-RAEng Chair Programme Director, The Alan Turing Institute, UK Home Publications Research Group Research Videos Outreach Contact U. Edinburgh Informatics Professor Sethu Vijayakumar FRSE holds a Personal Chair in Robotics within the School of Informatics at the University of Edinburgh and is the Director of the Edinburgh Centre for Robotics and Programme Director for Robotics and AI at The Alan Turing Institute, helping shape and drive the UK national agenda in Robotics and Autonomous Systems. Since 2007, he holds the Senior Research Fellowship of the Royal Academy of Engineering, co-funded by Microsoft Research and is also an Adjunct Faculty of the University of Southern California (USC), Los Angeles and a Visiting Research Scientist at the ATR Computational Neuroscience Labs, Kyoto-Japan. He has a PhD (1998) in Computer Science and Engineering from the Tokyo Institute of Technology. Prof. Vijayakumar previously held the position of the Director of IPAB (2005-2015), Reader (2007-2010) and Lecturer (2003-2007) at the University of Edinburgh, a Research Assistant Professor (2001-2003) at USC and a Staff Scientist (1998-2000) at the RIKEN Brain Science Institute, Tokyo. His research interest spans a broad interdisciplinary curriculum involving basic research in the fields of robotics, statistical machine learning, motor control, planning and optimization in autonomous systems and computational neuroscience. One of his flagship projects (2016) involved a collaboration with the NASA Johnson Space Centre on the Valkyrie humanoid robot being prepared for unmanned robotic pre-deployment missions to Mars. See here for a list of his publications [Google Scholar]. Sethu is a keen science communicator [see one of his TED talks ] and in recent years, has been active in conceptualising, producing and presenting several public outreach events to engage with the general public and children on all things science and engineering. He is a Fellow of the Royal Society of Edinburgh and the winner of the 2015 Tam Dalyell Prize for Excellence in Engaging the Public with Science. He was a judge on the latest edition of BBC Robot Wars, a hugely popular technology show as well as involved with the launch of the BBC micro:bit coding initiative. UKRI Robotics and Artificial Intelligence (RAI) Hubs and EU Projects: We have been involved in three EPSRC funded RAI hubs; as coordinator of ORCA(Offshore Robotics for Certification of Assets), focusing on the real world challenges in the Offshore and partners in Space (FAIR-SPACE) and Nuclear (NCNR) domains -- with overall investment of over £32M across our academic partners (Heriot-Watt, Oxford, Imperial, Surrey, Liverpool etc.). Also check out the EU Projects we are involved in, including HARMONY and the recently concluded Memmo (Memory of Motion). Postdoctoral Researchers: We are always looking for Postdoctoral Fellow candidates who have a PhD (or submitted), with a world leading track record in the areas of motor control (robots, prosthetics and exoskeletons), real-time, multi-contact motion planning, humanoid and quadruped locomotion, shared autonomy interfaces and optimal control in dynamic environments. Get in touch and find latest details here. Studentships: Are you passionate about Robotics? Interested in a fully funded PhD with us on topics such as Machine Learning for Robotics, Humanoid and Anthropomorphic Robot planning, sensing and control, Prosthetics and Human Motor Control? Would you like to work on exciting robotic platforms such as the PAL Humanoid and ANYmal Quadruped platforms? [Prospective PhD Students apply here -- fully funded 4-year studentships] Outreach:Please look at my Outreach and Media pages for public engagements, keynotes and media coverage. Details of my research group, the Statistical Learning & Motor Control (SLMC) lab can be accessed here. Selected Publications (for full list, see here) Franco Angelini, Guiyan Xin, Wouter Wolfslag, Carlo Tiseo, Michael Mistry, Manolo Garabini, Antonio Bicchi and Sethu Vijayakumar, Online Optimal Impedance Planning for Legged Robots, Proc. IEEE Intl.\tConf. on Intelligent Robots and Systems (IROS 2019), Macau, China (2019). [pdf] [video] Joao Moura, Vladimir Ivan, Mustafa Suphi Erden and Sethu Vijayakumar, Equivivalence of the Projected Forward Dynamics and the Dynamically Consistent Inverse Solution, Proc. Robotics: Science and Systems (RSS 2019), Frieberg, Germany (2019). [pdf][poster] [RSS 2019 Best Paper Award Finalist] Theodorous Stouratis, Iordanis Chatzinikolaidis, Michael Gienger and Sethu Vijayakumar, Dyadic collaborative Manipulation through Hybrid Trajectory Optimization, Proc. Conference on Robot Learning (CoRL 2018), Madrid (2018). [pdf] [link] [video] [CoRL 2018 Best Paper Award Finalist] Yiming Yang, Wolfgang Merkt, Vladimir Ivan, Zhibin Li and Sethu Vijayakumar, HDRM: A Resolution Complete Dynamic Roadmap for Real-Time Motion Planning in Complex Environments, IEEE Robotics and Automation Letters, vol. 3(1), pp. 551-558 (2018) [pdf] [DOI] [video] Jun Nakanishi, Andreea Radulescu, David Braun and Sethu Vijayakumar, Spatio-temporal Stiffness Optimization with Switching Dynamics, Autonomous Robots, vol. 41(2), pp. 273-291 (2017). [pdf] [DOI] Wolfgang Merkt, Yiming Yang, Theodoros Stouraitis, Christopher Mower, Maurice Fallon and Sethu Vijayakumar, Robust Shared Autonomy for Mobile Manipulation with Continuous Scene Monitoring, Proc. 13th IEEE Conference on Automation Science and Engineering, Xian, China (2017). [pdf] [video] [First Prize at Robots for Resilient Infrastructure Challenge 2017, Leeds, UK] (coverage) David Braun, Florian Petit, Felix Huber, Sami Haddadin, Patrick van der Smagt, Alin Albu-Schffer and Sethu Vijayakumar, Robots Driven by Compliant Actuators: Optimal Control under Actuation Constraints, IEEE Transactions on Robotics (IEEE T-RO), 29(5), pp. 1085-1101 (2013). [pdf] [2013 IEEE Transactions on Robotics Best Paper Award] Konrad Rawlik, Marc Toussaint and Sethu Vijayakumar, On Stochastic Optimal Control and Reinforcement Learning by Approximate Inference, Proc. Robotics: Science and Systems (R:SS 2012), Sydney, Australia (2012). [pdf] [R:SS 2012 Best Paper AwardRunner-up] Sethu Vijayakumar, Aaron D'Souza and Stefan Schaal, Incremental Online Learning in High Dimensions, Neural Computation, vol. 17, no. 12, pp. 2602-2634 (2005). [pdf] [LWPR software] [see next for usage guide] Stefan Klanke, Sethu Vijayakumar and Stefan Schaal, A Library for Locally Weighted Projection Regression, Journal of Machine Learning Research (JMLR), vol. 9, pp. 623--626 (2008). [pdf][DOI] Stefan Schaal, Chris Atkeson and Sethu Vijayakumar, Real time robot learning with locally weighted statistical learning, Proc. International Conference on Robotics and Automation (ICRA2000), San Francisco, USA, vol.1, pp.288-293,(2000). [pdf] [ICRA 2000 Best Paper Award Finalist] Ian Saunders and Sethu Vijayakumar, The Role of Feed-Forward and Feedback Processes for Closed-Loop Prosthesis Control, Journal of Neuroengineering and Rehabilitation (JNER), 8:60 (2011). [pdf][DOI] Dmitry Zarubin, Vladimir Ivan, Marc Toussaint, Taku Komura and Sethu Vijayakumar, Heirachical Motion Planning in Topological Representations, Proc. Robotics: Science and Systems (R:SS 2012), Sydney, Australia(2012). [pdf] [video] Andreaa Radulescu, Matthew Howard, David Braun and Sethu Vijayakumar, Exploiting Variable Physical Damping in Rapid Movement Tasks, Proc. 2012 IEEE ASME International Conference on Advanced Intelligent Mechatronics, Taiwan (2012). [pdf][video] [AIM 2012 Best Student Paper Award Finalist Timothy Hospedales and Sethu Vijayakumar, Bayesian Structure Inference for Multisensory Scene Understanding, IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), vol. 30, no. 12, pp. 2140-2157 (2008). [pdf] [DOI] Sebastian Bitzer and Sethu Vijayakumar, Latent Spaces for Dynamic Movement Primitives, Proc. 9th IEEE RAS International Conference on Humanoid Robots (Humanoids 2009), Paris, France (2009). [pdf] Djordje Mitrovic, Stefan Klanke, Rieko Osu, Mitsuo Kawato and Sethu Vijayakumar, A Computational Model of Limb Impedance Control based on Principles of Internal Model Uncertainty, PLoS ONE, Vol. 5, No. 10 (2010). [pdf] [DOI] Sethu Vijayakumar, Aaron D'Souza, Tomohiro Shibata, Jorg Conradt and Stefan Schaal, Statistical Learning for Humanoid Robots, Autonomous Robots , Vol. 12, No.1, pp. 55-69 (2002). [pdf] Djordje Mitrovic, Stefan Klanke and Sethu Vijayakumar, Adaptive Optimal Feedback Control with Learned Internal Dynamics Models, In: O. Sigaud and J. Peters (eds.): From Motor Learning to Interaction Learning in Robots, SCI 264, pp. 65-84, Springer-Verlag (2010). [pdf] Graham McNeill and Sethu Vijayakumar, Part-based Probabilistic Point Matching Using Equivalence Constraints, Proc. Advances in Neural Information Processing Systems (NIPS '06), Vancouver (2006). [pdf] Sethu Vijayakumar and Hidemitsu Ogawa, RKHS based Functional Analysis for Exact Incremental Learning Neurocomputing, Vol.29, No.1-3, pp.85-113, Elsevier Science(1999). [pdf] Sethu Vijayakumar and Hidemitsu Ogawa, A Functional Analytic Approach to Incremental Learning in Optimally Generalizing Neural Networks, Proc. IEEE International Conference on Neural Networks (ICNN '95), Australia, vol. 2, pp.777-782 (1995). [DOI] [ICNN 1995 Best Student Paper Award]",
  "content_length": 9510,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:56"
}