{
  "name": "Seth Gilbert",
  "homepage": "http://www.comp.nus.edu.sg/~gilbert",
  "status": "success",
  "content": "Seth Gilbert Seth Gilbert Department of Computer Science National University of Singapore Home · Google Scholar · DBLP · CV Research Interests The main goal of my research is to develop algorithmic techniques for designing robust large-scale systems. At the heart of these large-scale systems is the problem of scalable, trusted coordination. How do we build platforms to support coordinated activity among large numbers of untrusted and unreliable participants? How do we cope with this constantly changing environment, where dynamic participation and continuous cycles of failure and repair are the norm? What are the fundamental algorithms needed to enable these types of large-scale, reliable distributed distributed? In general, I design algorithms for several different applications that rely on trusted coordination. Some of these applications are fairly concrete, such as new and efficient algorithms for Byzantine agreement, the critical problem for blockchains. Other applications are more abstract, such as distributing information in a dynamic networks or coordinating resource usage under varying levels of contention. There are several common techniques that underlie these results. They include: Accountability: If you can identify where a network is failing or who is attacking the network, then you can respond efficiently. This idea has shown up informally in my work for many years (see, e.g., ``DConstructor'', PODC 2020); more recently we have formalized the idea of accountability and showed how it plays a central role in agreement protocols (see, e.g., ``Polygraph'', ICDCS 2021). Work Sharing and Task Distribution: For many coordination problems, the critical challenge is in determining who does what task. We have studied this explicitly (e.g., ``How to allocate tasks asynchronously'', FOCS 2012; ``On the Complexity of Load Balancing in Dynamic Networks'', SPAA 2021); and we have seen how it applies to specific problems (e.g., ``A Secure Sharding Protocol For Open Blockchains'', CCS 2016). A careful distribution of work is also critical to communication efficiency, as has been evident in our more recent work on information dissemination (e.g., ``Every Bit Counts in Consensus'', DISC 2023). Contention Resolution: A fundamental problem underlying many coordination protocols is contention resolution: many devices/users need to share a set of common resources, and we need to efficiently allocate those resources. We have focused on the question of efficiency (e.g., ``Leader Election in Well-Connected Graphs'', Algorithmic 2023), the challenge of robustness (e.g., ``Scaling Exponential Backoff: Constant Throughput, Polylogarithmic Channel-Access Attempts, and Robustness'', JACM 2019), and the problem of adapting to different network settings (e.g., ``Contention Resolution for Coded Radio Networks'', SPAA 2022). Overall, my research has led to significant new insights in how to design robust and scalable algorithms for large-scale coordination. Mini Biography I am currently the Head of Department and Dean's Chair Associate Professor in the Department of Computer Science at the National University of Singapore. My work includes research on backoff protocols, dynamic graph algorithms, wireless networks, robust scheduling, and the occasional blockchain. In fact, my research focuses on algorithmic issues of robustness and scalability, wherever they may arise. I received my PhD from MIT, advised by Nancy Lynch. I then spent several years as a postdoc at EPFL working with Rachid Guerraoui. I have been very involved with the major distributed and parlalel algorithms conferences, serving as the PC Chair of DISC 2021, OPODIS 2019, and SPAA 2016. I am currently serving on the Steering Committee for DISC, serving as the Treasurer. I have received several awards for my research, including Best Paper Awards at DISC 2023, DISC 2022, ICDCS 2022, IPDPS 2022, and OPODIS 2019, and the Best Student Paper award (for students I work with) at DISC 2022. I was born and grew up in Washington D.C., where I went to Maret School. After high school, I attended Yale University where I majored in Electrical Engineering and Math. In college, I spent several years building a solar car (which we raced in SunRayce97), and working at the Yale Dramat. After graduating from Yale, I worked for Microsoft as a software developer. I was a member of the Visual Studio.Net team, responsible for developing new team collaboration tools, such as an integrated (and improved) source control system. After two years at Microsoft, I moved back to the east coast, where I spent six years at MIT in the Theory of Distributed Systems group, which was headed by Nancy Lynch. After getting my PhD, I moved to Switzerland, where I spent three years as a postdoctoral researcher in the Laboratory for Distributed Programming, working with Rachid Guerraoui. I then moved to Singapore, where I have been living over since, enjoying the warm weather and the excellent food. E-mail: seth dot gilbert at comp dot nus dot edu dot sg Office: COM2-3-23 Phone: +65-6516-2729",
  "content_length": 5083,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:53"
}