{
  "name": "Seth Flaxman",
  "homepage": "https://www.cs.ox.ac.uk/people/seth.flaxman",
  "status": "success",
  "content": "Seth Flaxman | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultySeth FlaxmanSeth Flaxman Professor Seth Flaxman Associate Professor of Computer ScienceTutorial Fellow, Jesus CollegeE: seth.flaxman@cs.ox.ac.ukS: TwitterWolfson Building, Parks Road, Oxford OX1 3QD Themes:Artificial Intelligence and Machine LearningCompleted Projects:ST-SMLInterestsI am an associate professor at the University of Oxford in the Department of Computer Science and a tutorial fellow of Jesus College. My research is on scalable methods and flexible models for spatiotemporal statistics and Bayesian machine learning, applied to public policy and social science. Much of my time is spent on computational statistical disease modelling. I’ve worked on application areas that include public health, orphanhood, deep learning from satellite and street-level imagery, crime, voting patterns, filter bubbles / echo chambers in media, the big data paradox, the regulation of machine learning algorithms, and emotion.BiographyI grew up in Evanston, Illinois, USA. You can follow me on Twitter. I speak Yiddish with my two children. Education: BA Harvard College, mathematics and computer science (2004-2008), PhD Carnegie Mellon University, machine learning and public policy (2011-2015)Academic posts: postdoc, Department of Statistics, University of Oxford (2015-2017); Lecturer, Department of Mathematics, Imperial College London (2017-2019); Senior Lecturer (2019-2020).Work experience: Mortality and Burden of Disease Unit, World Health Organization, Geneva, Switzerland (2010-11); Media and Design Laboratory, École Polytechnique Fédérale de Lausanne (2008-2010)See alsoHomepage About UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 1956,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:53"
}