{
  "name": "Seth Pettie",
  "homepage": "http://web.eecs.umich.edu/~pettie",
  "status": "success",
  "content": "Seth Pettie Seth Pettie 2260 Hayward St. Department of EECS University of Michigan Ann Arbor, MI 48109 Office: CSE Building Room 3628 Phone: (734) 615-4210 Fax: (734) 763-1260 Curriculum Vitae: PDF Professional Service: Steering Committee Chair, SIAM Symposium on Simplicity in Algorithms (SOSA). Steering Committee, European Symposium on Algorithms (ESA). Editorial Boared, SIAM Journal on Computing. Advisory Board, TheoretiCS Journal. PC Chair, ESA Track A 2026 in L'Aquila, Italy. PC Chair, SOSA 2024 which was co-located with SODA 2024 in Alexandria, VA. Organizing Committee, Integer Programming and Combinatorial Optimization (IPCO 2019) Editorial Board, Algorithmica Editorial Board, The Encyclopedia of Algorithms PC Member of ESA-A 2026, ICALP 2026, SWAT 2026, ITCS 2026, SODA 2026 STOC 2025, SODA 2025, ICALP 2024, FOCS 2023, LATIN 2022, PODC 2022, SIROCCO 2022, SSS 2021, SODA 2021, ESA 2020, SWAT 2020, SSS 2019, STOC 2019, ISAAC 2018, SSS 2018, ITCS 2018, ICALP 2018, WADS 2017, STACS 2017, SPAA 2016, SWAT 2016, FOCS 2015, ESA 2015, ISAAC 2015, SIROCCO 2015, SPAA 2014, TAMC 2013, SODA 2013, STOC 2011, MFCS 2011, FSTTCS 2011, STACS 2008, ALENEX 2008, ESA 2007, SODA 2007, ICALP 2005, ALENEX 2005. Together with M. Lewenstein and V. V. Williams I organized a Dagstuhl workshop on Structure and Hardness in P, which was held in November 2016. With R. Krauthgamer, B. Saha, and V. V. Williams I organized a Bertinoro Workshop on Fine-grained Approximation Algorithms and Complexity, held May 27-31, 2019. With David Bevan, Miklós Bóna, and István Miklós I organized a Dagstuhl workshop on Pattern Avoidance, Statistical Mechanics, and Computational Complexity, held March 19-24, 2023. Students, Postdocs, and Visitors Daniel Skora (Ph.D. student) Dingyu Wang (Ph.D. 2025), now @ Huawei. Leqi (Jimmy) Zhu (postdoc), now Professor @ University of Manitoba. Shang-En Huang (Ph.D 2022), postdoc @ Boston College, now Professor @ National Taiwan University. Ohad Trabelsi (postdoc), Research Professor @ TTI-Chicago, now Professor @ University of Haifa. Dawei Huang (Ph.D. 2020), now @ Google. Yi-Jun Chang (Ph.D. 2019), postdoc @ ETH Zurich, now Professor @ NUS Singapore. Winner of the 2020 Principles of Distributed Computing Doctoral Dissertation Award. Hsin-Hao Su (Ph.D. 2015), postdoc @ MIT, now Professor @ Boston College. Winner of the 2016 Principles of Distributed Computing Doctoral Dissertation Award. Tsvi Kopelowitz (postdoc), now Professor @ Bar-Ilan University. Ran Duan (Ph.D. 2011), postdoc @ MPI, now Professor @ IIIS, Tsinghua University Maxwell Young (postdoc), now Professor @ Mississippi State University. Veronika Loitzenbauer, Visitor, June-August, 2016. Julian Wellman, Greenhills High School. Summer 2016. Now Ph.D. student @ MIT Mathematics. Ruosong Wang, Tsinghua University. Visitor, February-June, 2016. Ph.D. student @ Carnegie Mellon, Postdoc @ Univ. of Washington, Professor @ Peiking University. Wei Zhan, Tsinghua University. Visitor, February-June, 2016. Ph.D. student @ Princeton University, Postdoc @ University of Chicago, now Professor @ Purdue. Qizheng He, Tsinghua University. Visitor, March-August, 2017. Ph.D. student @ UIUC, now @ Huawei TopMinds. Wenzheng Li, Tsinghua University. Visitor, March-August, 2017. Now Ph.D. student @ Stanford. Hengjie Zhang, Tsinghua University. Visitor, March-August, 2018. Now Ph.D. student @ Columbia University. Yixiang Zhang, Tsinghua University. Visitor, March-August, 2019. Zhijun Zhang, Tsinghua University. Visitor, March-August, 2019. Ph.D. student @ Princeton University, now postdoc @ INSAIT. Longhui Yin, Tsinghua University. Visitor, February-August, 2020. Now Ph.D. student @ IIIS, Tsinghua. Yaowei Long, Tsinghua University. Visitor, February-August, 2020. Now Ph.D. student @ University of Michigan. Zhongtian He, Tsinghua University. February-August, 2021. Now Ph.D. student @ Princeton University. Benyu Wang, Tsinghua University. Visitor, February-August, 2022. Now Ph.D. student @ University of Michigan. Zhiyi Huang, Tsinghua University. Visitor, February-August, 2022. Now Ph.D. student @ UT Austin. Zixi Cai, Tsinghua University. Visitor, February-August, 2025. Kuowen Chen, Tsinghua University. Visitor, March-June, 2025. Shengquan Du, Tsinghua University. Visitor, March-August, 2025. See my Google Scholar and DBLP pages for more citation information. Conference Papers On a Clique Game and the Erdős-Hajnal Problem on High-chromatic High-girth Subgraphs Seth Pettie, Gábor Tardos, and Bartosz Walczak SODA 2026 Sketching, Moment Estimation, and the Lévy-Khintchine Representation Theorem Seth Pettie and Dingyu Wang ITCS 2025 arXiv:2410.17426, Proceedings version A Refutation of the Pach-Tardos Conjecture for 0-1 Matrices Seth Pettie and Gábor Tardos SODA 2025 arXiv:2407.02638 Connectivity Labeling Schemes for Multiple Edge and Vertex Faults via Expander Hierarchies Yaowei Long, Seth Pettie, and Thatchaphol Saranurak SODA 2025 arXiv:2410.18885 Universal Perfect Sampling for Incremental Streams Seth Pettie and Dingyu Wang SODA 2025 arXiv:2407.04931 Connectivity Labeling and Routing with Multiple Vertex Failures Merav Parter, Asaf Petruschka, and Seth Pettie STOC 2024 arXiv:2307.06276 link to paper Fraud Detection for Random Walks Varsha Dani, Thomas Hayes, Seth Pettie, and Jared Saia ITCS 2024 link to paper On the Extremal Functions of Acyclic Forbidden 0-1 Matrices Seth Pettie and Gábor Tardos SODA 2024 arXiv:2306.16365 Sorting Pattern-Avoiding Permutations via 0-1 Matrices Forbidding Product Patterns Parinya Chalermsook, Seth Pettie, and Sorrachai Yingchareonthawornchai SODA 2024 arXiv:2307.02294 Better Cardinality Estimators for HyperLogLog, PCSA, and Beyond Seth Pettie and Dingyu Wang PODS 2023 arXiv:2208.10578 Byzantine Agreement with Optimal Resilience via Statistical Fraud Detection Shang-En Huang, Seth Pettie, and Leqi Zhu SODA 2023 arXiv:2206.15335 Optimal Vertex Connectivity Oracles Seth Pettie, Thatchaphol Saranurak, and Longhui Yin STOC 2022 arXiv:2201.00408 Byzantine Agreement in Polynomial Time with Near-Optimal Resilience Shang-En Huang, Seth Pettie Leqi Zhu STOC 2022 arXiv:2202.13452 Incremental SCC Maintenance in Sparse Graphs Aaron Bernstein, Aditi Dudeja, and Seth Pettie ESA 2021 PDF. Wake Up and Join Me! An Energy Efficient Algorithm for Maximal Matching in Radio Networks Varsha Dani, Aayush Gupta, Thomas Hayes, and Seth Pettie DISC 2021; Brief Announcement at PODC 2021. arXiv:2104.09096 Non-mergeable Sketching for Cardinality Estimation Seth Pettie, Dingyu Wang and Longhui Yin ICALP 2021 arXiv:2008.08739 The Structure of Minimum Vertex Cuts Seth Pettie and Longhui Yin ICALP 2021 arXiv:2102.06805 Information Theoretic Limits of Cardinality Estimation: Fisher meets Shannon Seth Pettie and Dingyu Wang STOC 2021 arXiv:2007.06865 Distance Oracles for Planar Graphs with Better Time-Space Tradeoffs Yaowei Long and Seth Pettie SODA 2021 arXiv:2007.08585 Contention Resolution without Collision Detection Michael Bender, Tsvi Kopelowitz, William Kuszmaul, Seth Pettie STOC 2020 Join on Samples: A Theoretical Guide for Practitioners Dawei Huang, Dong Young Yoon, Seth Pettie, and Barzan Mozafari Presented at VLDB 2020 The Energy Complexity of BFS in Radio Networks Yi-Jun Chang, Varsha Dani, Thomas Hayes, and Seth Pettie PODC 2020 Publisher's website The Communication Complexity of Set Intersection and Multiple Equality Testing Dawei Huang, Seth Pettie, Yixiang Zhang, and Zhijun Zhang SODA 2020 arXiv:1908.11825 Simple Contention Resolution via Multiplicative Weight Updates Yi-Jun Chang, Wenyu Jin, and Seth Pettie SOSA 2019 Proceedings Distributed Triangle Detection via Expander Decomposition Yi-Jun Chang, Seth Pettie, and Hengjie Zhang SODA 2019 arXiv:1807.06624 Fine-grained Lower Bounds on Cops and Robbers Sebastian Brandt, Seth Pettie, and Jara Uitto ESA 2018 Improved Bounds for Multipass Pairing Heaps and Path-balanced Binary Search Trees Dani Dorfman, Haim Kaplan, Laszlo Kozma, Seth Pettie, and Uri Zwick ESA 2018 The Energy Complexity of Broadcast Yi-Jun Chang, Varsha Dani, Thomas Hayes, Qizheng He, Wenzheng Li, and Seth Pettie PODC 2018 arXiv:1710.01800 Lower Bounds on Sparse Spanners, Emulators, and Diameter-reducing Shortcuts Shang-En Huang and Seth Pettie SWAT 2018 arXiv:1802.06271 An Optimal Distributed (Δ +1)-Coloring Algorithm? Yi-Jun Chang, Wenzheng Li, and Seth Pettie STOC 2018 arXiv:1711.01361 The Complexity of Distributed Edge Coloring with Small Palettes Yi-Jun Chang, Qizheng He, Wenzheng Li, Seth Pettie, and Jara Uitto SODA 2018 arXiv:1708.04290 A Time Hierarchy Theorem for the LOCAL Model Yi-Jun Chang and Seth Pettie FOCS 2017 arXiv:1704.06297 A 1-hour version at TCS+. Invited presentation (PDF) at HALG 2018. Exponential Separations in the Energy Complexity of Leader Election Yi-Jun Chang, Tsvi Kopelowitz, Seth Pettie, Ruosong Wang, Wei Zhan STOC 2017 arXiv:1609.08486v2 Fully Dynamic Connectivity in O(log n (log log n)2) Amortized Expected Time Shang-En Huang, Dawei Huang, Tsvi Kopelowitz, and Seth Pettie SODA 2017 arXiv:1609.05867 A Hierarchy of Lower Bounds for Sublinear Additive Spanners Amir Abboud, Greg Bodwin, and Seth Pettie SODA 2017 arXiv:1607.07497 Connectivity Oracles for Graphs Subject to Vertex Failures Ran Duan and Seth Pettie SODA 2017 arXiv:1607.06865 Scaling Algorithms for Weighted Matching in General Graphs Ran Duan, Seth Pettie, and Hsin-Hao Su SODA 2017 arXiv:1411.1919v5 Simultaneously Load Balancing for Every p-norm, With Reassignments Aaron Bernstein, Tsvi Kopelowitz, Seth Pettie, Ely Porat, and Cliff Stein ITCS 2017 PDF Mind the Gap: Essentially Optimal Algorithms for Online Dictionary Matching with One Gap Amihood Amir, Tsvi Kopelowitz, Avivit Levy, Seth Pettie, Ely Porat, and B. Riva Shalom ISAAC 2016 arXiv:1503.07563 An Exponential Separation Between Randomized and Deterministic Complexity in the LOCAL Model Yi-Jun Chang, Tsvi Kopelowitz, and Seth Pettie FOCS 2016 arXiv:1602.08166 Faster Worst Case Deterministic Dynamic Connectivity ",
  "content_length": 24679,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:55"
}