{
  "name": "Sethuraman Panchanathan",
  "homepage": "https://search.asu.edu/profile/88253",
  "status": "success",
  "content": "Sethuraman Panchanathan | ASU Search Sethuraman Panchanathan Professor and Foundation Chair in Computing and Informatics, School of Computing and Augmented Intelligence Other ASU affiliations Founding Director, CUbiC Senior Global Futures Scientist, Global Futures Scientists and Scholars [email protected] FULTN 310 TEMPE, AZ 85287-7205 Mail code: 7105 Campus: Tempe ‌ Long Bio The Honorable Sethuraman Panchanathan is a computer scientist and engineer. He is a leader in the fields of science, engineering, and education, with more than three decades of experience in higher education and government. Throughout his career, he has designed and built knowledge enterprises aimed at advancing research innovation, strategic partnerships, entrepreneurship, global development, and economic growth. From 2020-2025, he served as the 15th Director of the U.S. National Science Foundation (NSF), a $9.06 billion independent federal agency and the only government agency charged with advancing all fields of scientific discovery, technological innovation, and STEM education. During his tenure, he established the first new directorate in 31 years, the Directorate for Technology, Innovation and Partnerships, aimed at delivering \"Innovation Everywhere for Everyone\" by accelerating the translation of science and technology for economic progress, national security, and societal impact. Panchanathan currently serves as the University Professor of Technology and Innovation and Foundation Chair in Computing and Augmented Intelligence at Arizona State University, where he has held a faculty appointment since 1997. His previous roles at ASU include leading the university's research portfolio as the executive vice president of the ASU Knowledge Enterprise and the chief research and innovation officer. Under his leadership, ASU increased its research performance fivefold, earning recognition as the fastest growing and most innovative research university in the U.S. Panchanathan has received numerous recognitions for his scientific work during his career; in 2025, he was awarded the Padma Shri, one of the highest civilian awards bestowed by the Government of India, in recognition of his distinguished contributions to science. Panchanathan received his Ph.D. in Electrical and Computing Engineering from the University of Ottawa. He is married to Sarada \"Soumya\" Panchanathan, an academic pediatrician and informatician, who has taught medical students, pediatric residents, and informatic fellows. They have two adult children, Amritha and Roshan, and three grandchildren. CV Curriculum Vitae Courses 2024 Fall Course Number Course Title CSE 492 Honors Directed Study CEN 792 Research CEN 584 Internship CEN 799 Dissertation CEN 795 Continuing Registration 2024 Summer Course Number Course Title CSE 595 Continuing Registration CSE 790 Reading and Conference CEN 795 Continuing Registration CSE 595 Continuing Registration 2024 Spring Course Number Course Title CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 790 Reading and Conference CSE 584 Internship CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 599 Thesis CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 795 Continuing Registration 2023 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 499 Individualized Instruction CEN 792 Research CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration 2023 Summer Course Number Course Title CSE 595 Continuing Registration CSE 790 Reading and Conference CEN 795 Continuing Registration CSE 595 Continuing Registration 2023 Spring Course Number Course Title CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 790 Reading and Conference CSE 584 Internship CSE 595 Continuing Registration CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 599 Thesis CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 795 Continuing Registration 2022 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 499 Individualized Instruction CEN 792 Research CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration 2022 Summer Course Number Course Title CSE 580 Practicum CSE 595 Continuing Registration CSE 790 Reading and Conference CEN 795 Continuing Registration CSE 595 Continuing Registration 2022 Spring Course Number Course Title EEE 595 Continuing Registration CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 790 Reading and Conference CSE 584 Internship CSE 595 Continuing Registration CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 599 Thesis CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 795 Continuing Registration CSE 493 Honors Thesis 2021 Fall Course Number Course Title EEE 599 Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 499 Individualized Instruction CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration 2021 Summer Course Number Course Title CSE 580 Practicum CSE 595 Continuing Registration CSE 790 Reading and Conference CEN 795 Continuing Registration CSE 595 Continuing Registration 2021 Spring Course Number Course Title EEE 595 Continuing Registration CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 590 Reading and Conference CSE 790 Reading and Conference CSE 584 Internship CSE 595 Continuing Registration CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 599 Thesis CSE 790 Reading and Conference CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 795 Continuing Registration CSE 493 Honors Thesis 2020 Fall Course Number Course Title EEE 599 Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 499 Individualized Instruction CSE 590 Reading and Conference CSE 580 Practicum CSE 584 Internship CSE 790 Reading and Conference CEN 792 Research CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 590 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration",
  "content_length": 6874,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:55"
}