{
  "name": "Seth Hutchinson 0001",
  "homepage": "https://www.khoury.northeastern.edu/people/seth-hutchinson",
  "status": "success",
  "content": "Seth Hutchinson - Khoury College of Computer Sciences All People Seth Hutchinson (he/him) Professor, Jointly Appointed with College of Engineering Research interests Research interests Robotics Education Education PhD in Electrical Engineering, Purdue University, MS in Electrical Engineering, Purdue University BS in Electrical Engineering, Purdue University Biography Biography Seth Hutchinson is a professor in the Khoury College of Computer Sciences and the College of Engineering at Northeastern University, based in Boston. Hutchinson began publishing robotics research while pursuing his PhD in electrical engineering at Purdue University in 1986 and he hasn’t stopped since, with his name appearing on more than 300 publications related to planning, sensing, and control in robotics. He joined Khoury College in 2025 after 28 years at the University of Illinois at Urbana-Champaign and seven at Georgia Tech, where he served as the executive director of the Institute for Robotics and Intelligent Machines. Hutchinson’s work is motivated by a desire to make robots smarter and more capable. Specifically, his research has delved into physical human–robot interaction, motion planning, vision-based control, planning under uncertainty, pursuit and evasion, localization and mapping, locomotion, and bio-inspired robotics. Hutchinson previously served as president of the IEEE Robotics and Automation Society, editor-in-chief of IEEE Transactions on Robotics, and founding editor-in-chief of the RAS Conference Editorial Board. At Khoury College, he works with the Institute for Experiential Robotics. In his free time, Hutchinson enjoys playing the electric bass and welcomes invitations to play with local rock and roll bands. Labs and groups Labs and groups Institute for Experiential Robotics Recent publications Recent publications Published: December 25, 2024 Architectural-Scale Artistic Brush Painting with a Hybrid Cable Robot Citation: Gerry Chen, Tristan Al-Haddad, Frank Dellaert, Seth Hutchinson . (2024). Architectural-Scale Artistic Brush Painting with a Hybrid Cable Robot IROS, 2556-2563. https://doi.org/10.1109/IROS58592.2024.10802489 Published: December 25, 2024 A Deep Reinforcement Learning Framework and Methodology for Reducing the Sim-to-Real Gap in ASV Navigation Citation: Luis F. W. Batista, Junghwan Ro, Antoine Richard, Pete Schröpfer, Seth Hutchinson , Cédric Pradalier. (2024). A Deep Reinforcement Learning Framework and Methodology for Reducing the Sim-to-Real Gap in ASV Navigation IROS, 1258-1264. https://doi.org/10.1109/IROS58592.2024.10802067 Published: August 8, 2024 Generalizing Trajectory Retiming to Quadratic Objective Functions Citation: Gerry Chen, Frank Dellaert, Seth Hutchinson . (2024). Generalizing Trajectory Retiming to Quadratic Objective Functions ICRA, 9823-9829. https://doi.org/10.1109/ICRA57147.2024.10610854 Published: July 4, 2023 LES: Locally Exploitative Sampling for Robot Path Planning Citation: Sagar Suhas Joshi, Seth Hutchinson , Panagiotis Tsiotras. (2023). LES: Locally Exploitative Sampling for Robot Path Planning ICRA, 1551-1557. https://doi.org/10.1109/ICRA48891.2023.10160279 Individual Details Tenured/Tenure-Track Faculty Campus Boston Area of Interest Robotics Contact s.hutchinson@northeastern.edu",
  "content_length": 3283,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:54"
}