{
  "name": "Seungwoo Je",
  "homepage": "https://www.sustech.edu.cn/en/faculties/seungwooje.html",
  "status": "success",
  "content": "Seungwoo JE - Faculty - SUSTech Menu News E-Hall ä¸­æ Academic Calendar Notice News Academic Calendar Notice Library News Admissions Global  ä¸­æ   Â© 2019 All Rights Reserved.ç½ç«è®¾è®¡æ¯æ ç²¤ICPå¤14051456å· ä¸­æ Home News Events About Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Faculty Overview High-level Talents Talent Program Directory Academics Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Research Overview Research Centers & Facilities Technology Transfer Research News Research Administration Go Global Campus Life Overview Residential College Housing & Dining Clubs & Organizations Email Library Admissions Give University Intranets Old Site Faculty ä¸­æ Go Back Search Seungwoo JE Assistant Professor seungwoo@sustech.edu.cn Personal Homepage Seungwoo JE is a maker, User Experience (UX), and Human-Computer Interaction (HCI) researcher and educator. His research is to enrich and diversify the interaction between users and computers by creating novel experiences with emerging technology. He received a Ph.D., Masters, and BS from Industrial Design at KAIST, Korea. His works have been published in top academic venues in HCI, including ACM CHI and ACM UIST. In recognition of his academic work, he received a Global Ph.D. Fellowship from the Ministry of Education, Korea, the most prestigious research fellowship in Korea. Moreover, he is an award-winning design researcher (Red Dot Design Award, IF Design Award, IDEA Award) and holds international patents (Korea and US). He participated in industry projects sponsored by Samsung and Hyundai and in national research projects funded by National Research Foundation (NRF), Korea. More information can be found at www.seungwooje.com. Apply Now Careers@SUSTech Cooperation With SUSTech",
  "content_length": 1921,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:58"
}