{
  "name": "Seungwon Jung",
  "homepage": "https://sites.google.com/view/deepiplab",
  "status": "success",
  "content": "Deep Image Processing LabSearch this siteEmbedded FilesSkip to main contentSkip to navigationWe are looking for self-motivated and passionate students to join our team.  Please send the CV via email to Prof. Jung at swjung83@korea.ac.kr (27년 전기 석사/박사/석박통합과정 모집 중)Changwoo & Hongil's paper has been accepted for presentation at AAAI 2026. Jinah's paper has been accepted for publication in IEEE SPL. Prof. Uhm (our collaborator at Gachon Univ.)'s paper has been accepted for publication in IEEE TMI. Dongjea's paper has been accepted for publication in JVCI. Two papers (Hongjae's and Sejin's) have been accepted for presentation at ICCV 2025. Yurim & Geon-Ho's paper has been accepted for publication in JSID. Jun Yong's paper has been accepted for publication in IEEE TPAMI.Jun Yong's paper has been accepted for presentation at CVPR 2025. Hyunjun & Dongjin's paper has been accepted for publication in IEEE JBHI. Hongjae received the First Prize from the Korea University-Samsung Electronics Best Paper Award!Yucheng's paper has been accepted for publication in IEEE TMI. Hongjae's paper has been accepted for publication in IEEE TIP. Hyunjoon's paper has been accepted for publication in IEEE SPL. Yurim's paper has been accepted for publication in IEEE SPL. Seohoon's paper has been accepted for publication in IEEE SPL. Seokjun's paper has been accepted for presentation at AAAI 2024. Zhixin's paper has been accepted for publication in Computers in Biology and Medicine. Junsang's and Hongjae's papers have been accepted for presentation in ICCVW 2023. Kwang-Lim's paper has been accepted for publication in IEEE TITS. Our team won 2nd place in the KiTS23 Challenge. Congratulations!Junsang's paper has been accepted for presentation at ICCV 2023. Sumin's paper has been accepted for presentation at ICIP 2023. Jun Yong's paper has been accepted for presentation at CVPR 2023. Ju Ho's paper has been accepted for publication in IEEE Access. Hongjae's paper has been accepted for publication in Optics Letters. Congratulations!Zhixin's paper has been accepted for publication in Scientific Reports. Junsang's paper has been accepted for publication in IEEE TMM. Wooseok's paper has been accepted for presentation at ECCV 2022. Seo-Won's paper has been accepted for presentation at CVPR 2022.  Yucheng's paper has been accepted for publication in IEEE TIP. Prof. Jung received Best Editor Award from ICT Express. (2021.07.31.)Sung-Jin's paper has been accepted for presentation at ICCV 2021.  Prof. Jung received Haedong Young Scholar Award. (2019.12.13.)Link LinkWe received two Winner Awards @ CVPRW 2019 (NTIRE and CLIC challenges)Link Link Link Link Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2706,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:58"
}