{
  "name": "Seung-Jae Han",
  "homepage": "http://mnet.yonsei.ac.kr/#professor",
  "status": "success",
  "content": "Mobile Networking Laboratory - Yonsei University M.NET Research Area Professor Members Alumni Publications Contact Welcome to Mobile Networking Lab. It is a mobile networking laboratory of Yonsei university. +82-2-2123-7751 (extension: 7751) Last Updated: October 30th, 2025 Research Area Large-scale Wireless Sensor Networks In near future, the Internet infrastructure (i.e., Internet of Things) will connect trillions of sensors and machine objects together to truly realize the vision of Ubiquitous Computing. The focus of our research is given on the solutions for ultra large-scale wireless sensor networks. Wireless LAN Technology While WLAN has been very successful in providing high capacity at low cost, it involves inefficiency due to the lack of sophisticated resource management. The focus of our research is given on such issues as WLAN load balancing, configuration optimization for capacity enhancement and mobile multimedia support. Mobile Cloud Computing Mobile Cloud Computing is the combination of cloud computing, mobile computing and wireless networks to bring rich computational resources to mobile users. Our research extends across a broad range of relevant mobile devices including wearable devices, IoT devices. Multi-hop Wireless Networking Multi-hop wireless networking (e.g., Wireless Mesh Networks, Vehicular Networks) can facilitate various mobile services more effectively than conventional one-hop wireless networking. The focus of our research is given on such issues as multi-hop routing, resource scheduling, frequency channel allocation, DTN (Delay/Disruption Tolerant Networking) techniques and interference handling. Software-defined networking(SDN) for Internet of Things(IoT) Software Defined Networking (SDN) is a new networking paradigm which enables centralized network management that allows efficient optimization and configuration. In IoT which will be an extremely diverse networking environment, SDN is the potential solution for IoT resource management. Professor Prof. Seung-Jae Han seungjaehan yonsei.ac.kr Resume file (pdf) 4th Engineering building (Building No.122), D911, Department of Computer Science, Yonsei University50 Yonsei-ro, Seodaemun-gu, Seoul 03722, Republic of Korea +82-2-2123-5723+82-2-365-2579 Research Interests Wireless networks, Multimedia networking, Embedded systems, Sensor networks, Telemetric services Employment Yonsei University, Seoul, Korea, ProfessorSeptember, 2005 ~ Now Bell Laboratories, Lucent Technologies, Murray Hill, NJ, Member of Technical StaffJuly, 1999 ~ August, 2005 University of Michigan, Ann Arbor, MI, Post-doctoral Research ScientistSeptember, 1998 ~ July, 1999 Education University of Michigan , Ann Arbor , MI Ph.D., Computer Science & Engineering, August 1998 Thesis Title: Low-Cost Failure Recovery for Real-Time Communication in Multi-Hop Networks, Advisor: Kang G. Shin Seoul National University, Seoul, Korea M.S., Computer Engineering, February 1991 Seoul National University , Seoul , Korea B.S., Computer Engineering, February 1989 Honour and Award Teaching Excellence Award, Yonsei University (2006) OKAWA Foundation Research Grant (2006) Bell Laboratories Teamwork Award (2003, 2005) Bell Laboratories President's Silver Award (2002) Samsung Human-Tech Thesis Bronze Prize (1998) University of Michigan Summer Research Fellowship (1993) Members Alumni Publications Journal Papers W. Jang and S.Han, “Collision avoidance by mitigating uncertain packet loss in multi-hop wireless IoT networks”, Computer Networks, Elsevier, Vol 262, May, 2025. J. Sung and Seungjae Han, “Use of edge resources for DNN model maintenance in 5G IoT networks”, Cluster Computing, Springer, Vol 27, pp 5093-5105, July, 2024. J. Kim, S. Kim, C. Bak, Seungjae Han, “Adaptive cloud resource allocation for large-scale crowdsourced multimedia live streaming services”, Cluster Computing, Springer, Vol 27, pp 3233-3257, June, 2024. J. Sung, Seungjae Han, and J. Kim, “Cloning-based virtual machine pre-provisioning for resource constrained edge cloud server”, Cluster Computing, Springer, Vol 27, pp 1831-1847, April, 2024. C. Bak and S.Han. “Contention alleviation in WiFi networks by using light-weight machine learning model” Computer Networks, Elsevier Vol 222, February, 2023. H. Kim, M. Kim, and Seungjae Han, “Collision-free optimal packet scheduling algorithm for multi-hop wireless IoT networks”, Computer Networks, Elsevier Vol 206, April, 2022. J. Han and S. Han. \"Hidden terminal-aware access point selection for IEEE 802.11ah networks\" Computer Communications 173 2021: 1-13. J. Sung and S. Han. “Data-Bundling Proxy to Aggregate Transmissions for Energy-Constrained Devices” Computer Communications 134 2019: 114–125. J. Han and Seungjae Han, \"Non-Intrusive Estimation of Available Throughput for IEEE 802.11 Link\" Computer Networks 2018 S. Kim and Seungjae Han, “Distinguishing Social Contacts and Pass-by Contacts in DTN Routing”, Telecommunication Systems, Springer vol 68, 2018: 669-685 J. Han, H. Choi, Seungjae Han, “Acknowledgement Corruption: A New Aspect of Physical Layer Capture in IEEE 802.11 Networks”, Wireless Communications and Mobile Computing, vol 2018, 15 pages, 2018. J. Sung and Seungjae Han, “Data Bundling for Energy Efficient Communication of Wearable Devices”, Computer Networks, Elsevier, Vol 121, Page 76-88, July, 2017. S. Kim and Seungjae Han, “Delay-Tolerant Sensing Data Delivery for IoT Network by using Signal Strength Information”, Peer-to-Peer Networking and Applications, Vol 11, No 1, Page 181-197, 2018, Springer S. Moon, S. Park and Seungjae Han, “Energy Efficient Data Collection in Sink-Centric Wireless Sensor Networks: a Cluster-Ring Approach“, Computer Communications, Elsevier, Vol 101. Page 12~25, March, 2017 M. Song, S. Moon, and Seungjae Han, “Self-Optimization of Handover Parameters for Dynamic Small Cell Networks”, Wireless Communications and Mobile Computing, Wiley, Vol. 15, No. 11, Page 1497~1517, August, 2015 K. Lee, H. Kim, S. Park, and Seungjae Han, “Satisfying the Target Network Lifetime in Wireless Sensor Networks”, Computer Networks, Elsevier, Vol 65, page 41-55, June 2014 S. Kim, Y. Jeong, and Seungjae Han, “Use of Contact Duration for Message Forwarding in Intermittently Connected Mobile Networks”, Computer Networks, Elsevier, Vol 64, page 38-54, May 2014 K. Lee, Y. Kim, H. Kim, and Seungjae Han, \"A Myopic Mobile Sink Migration Strategy for Maximizing Lifetime of Wireless Sensor Networks\", Wireless Networks, Springer, Vol. 20, No.2, page 303 - 318, February 2014 Y. Jeong, J. Kim, and Seungjae Han, \"Interference Mitigation in Wireless Sensor Networks using Dual Heterogeneous Radios\", Wireless Networks, Springer, Vol. 17, No.7, page 1699 - 1713, July 2011 E. Talipov, H. Shin, Seungjae Han, and H. Cha, \"A Lightweight Stateful Address Autoconfiguration for 6LoWPAN\", Wireless Networks, Springer, Vol. 17, No.1, page 183 - 197, January 2011 Y. Bejerano, K. Lee, Seungjae Han, and A. Kumar, \"Single-Path Routing for Life Time Maximization in Multi-hop Wireless Networks\", Wireless Networks, Springer, Vol. 17, No.1, page 263 - 275, January 2011 H. Choi and Seungjae Han, \"Domain Load Balancing Routing for Multi-Gateway Wireless Mesh Networks\", Wireless Networks, Springer, Vol. 16, No.8, page 2105 - 2122, November 2010 Y. Bejerano, Seungjae Han, and M. Smith, \"A Novel Frequency Planning Algorithm for Mitigating Unfairness in Wireless LANs\", Computer Networks, Elsevier, Vol. 54, No.15, page 2575 - 2590, October 2010. S. Cho, H. Shin, Seungjae Han, H. Cha, and R. Ha, \"Density-Adaptive Network Reprogramming Protocol for Wireless Sensor Networks\", Wireless Communications and Mobile Computing, Wiley, Vol. 10, No. 6, page 857 - 874, June 2010. S. Sim, J. Park, Seungjae Han, and S. Lee, \"Seamless IP Mobility Support for Flat-Architecture Mobile WiMAX Networks\", IEEE Communications Magazine. Vol. 47, No. 6, page 142 - 149, June 2009. Y. Bejerano and Seungjae Han, \"Cell Breathing Techniques for Load Balancing in Wireless LANs,\" IEEE Transactions on Mobile Computing, Vol. 8, No. 6, page 735 - 749, June 2009. S. Park, Seungjae Han, S. Cho, \"User Utility Discovery for Priority-based Network Resource Pricing\", Computers & Industrial Engineering, Elsevier, Vol. 56, No. 4, page 1357 - 1368, May 2009. D. Ko, Seungjae Han, H. Cha, and R. Ha, \"A traffic control system for IEEE 802.11 networks based on available bandwidth estimation\", Wireless Communications & Mobile Computing, Wiley, Vol. 8, No. 4, page 409-419, May 2008 J. Park and Seungjae Han, \"Load Balancing for video streaming services in hierarchical wireless networks,\" Computer Networks, Elsevier, Vol. 52, No.1, page 259 - 274, Jan 2008. Seungjae Han and T. Klein, \"User Assignment Strategies for Throughput Maximization in Hierarchical Wireless Networks,\" International Journal of Wireless and Mobile Computing, Inderscience, Vol. 2, No. 4, page 337-349, Dec 2007. Kwon, H. Cha, Seungjae Han, and R. Ha, \"Empirical evaluation of receiver-based TCP delay control in CDMA2000 networks,\" International Journal of Communication Systems, Wiley, , Vol. 20, No. 8, page 927-941, August 2007. Y.Bejerano, Seungjae Han, and A. Kumar, \"Efficient Load Balancing Routing for Wireless Mesh Networks,\" Computer Networks, Elseviers , Vol. 51, No.10, page 2450 - 2466, July 2007. Y.Bejerano, Seungjae Han, and L. Li, \"Fairness and Load Balancing in Wireless LANs using Association Control,\" IEEE/ACM Transactions on Networking, Vol. 15, No. 3, page 560-573, June 2007. T. Klein and Seungjae Han, \"Assignment Strategies for Mobile Data Users in Hierarchical Overlay Networks: Performance of Optimal and Adaptive Strategies,\" IEEE Journal on Selected Areas in Communications, Vol. 22, No. 5, page 849 - 861, June 2004. M. Buddhikot, G. Chandranmenon, Seungjae Han, Y. Lee, S. Miller, and L. Salgarelli., \"Design and Implementation of a WLAN/CDMA2000 Interworking Architecture,\" IEEE Communications Magazine, Vol. 41, No. 11, page 90 - 100, November 2003. Seungjae Han and K.",
  "content_length": 19494,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:56"
}