{
  "name": "Seungjun Baek",
  "homepage": "https://singkru.github.io",
  "status": "success",
  "content": "System INtelligence Group (지능시스템 연구실) Search Seung Jun Baek Professor Dept. of Computer Science & Engineering, Dept. of Artificial Intelligence, Dept. of Data Science, Korea University Biography Seung Jun Baek is a full professor of Computer Science and Engineering at Korea University. Prof. Baek received Ph.D. and M.S. degrees at University of Texas at Austin, and B.S. degree at Seoul National University, all in Electrical and Computer Engineering. He was a Member Technical Staff of DSP Systems R&D center, Communication and Medical Systems Lab. of Texas Instruments. He is now a full professor at Computer Science and Engr. Dept, Artificial Intelligence Dept. and Data Science Dept. of College of Informatics, Korea University. His research interests are on the design of intelligent systems in the areas including deep learning, medical AI, generative models, language models, graph learning, mobile- and fog/edge computing. He leads the System INtelligence Group (SING). Interests Deep Learning Systems Medical AI Generative Models Language Models Graph Learning Mobile and Fog/Edge Computing Education PhD in Electrical and Computer Engineering University of Texas at Austin MSc in Electrical and Computer Engineering University of Texas at Austin BSc in Electrical Engineering Seoul National University Research 연구분야 Deep Learning Systems 딥러닝 시스템 Generative AI 생성형 AI Language Models 언어모델 Medical AI 의료 AI Graph Learning 그래프 학습 Data fusion for autonomous navigation 자율주행을 위한 데이터 융합 Mobile Systems and AI 모바일 AI 및 시스템 Recent Publications Root Completion from Intraoral Scans of Tooth Crowns using Diffusion with Patch Perturbation YH Jang, IS Song, S Baek ContextFace: Generating Facial Expressions from Emotional Contexts MJ Kim, MS Kim, S Baek Diagnosis of carpal tunnel syndrome using deep learning with comparative guidance J Sim, S Lee, S Kim, S Jeong, J Yoon, S Baek DuoDent: Tooth Generation using Dual-Stream Diffusion with Normal Consistency D Kwon, S Kim, IS Song, S Baek DynASyn: Multi-subject personalization enabling dynamic action synthesis Y Choi, C Park, SJ Baek See all publications Contact sjbaek@korea.ac.kr 82-2-3290-4847 IT Education Hall, 508 (정운오 IT교양관 508호, 고려대학교 이공계캠퍼스), Seoul, Korea Cite × Copy Download",
  "content_length": 2240,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:57"
}