{
  "name": "Seunghee Shin",
  "homepage": "https://sites.google.com/binghamton.edu/seunghee",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationSeunghee ShinEmail: sshin AT binghamton.eduAssistant ProfessorDepartment of Computer Science, SUNY BinghamtonI am currently hiring a Ph.D. student. Please contact me if you have an interest in my research.BiographySeunghee Shin received his Ph.D. degree from Electrical and Computer Engineering department at North Carolina State University, Raleigh, NC.  He also has M.S. degree in Computer Science from Northeastern University, MA, where he studied computer networks. His primary research interests lie in computer architecture and systems. Specifically, he has high interests in investigating the impact of emerging technologies on memory systems. Besides, he has more than five years of professional system software development experiences in multiple companies where he engaged in mobile and storage system development projects. PublicationsQi Pei, Yipeng Wang, Seunghee Shin, Litmus: Fair Pricing for Serverless Computing, 2024 ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), April 2025, accepted in 2024 ASPLOS, presented in 2025 ASPLOSTaehun Kim, Hyeongjin Park, Seokmin Lee, Seunghee Shin, Junbeom Hur, Youngjoo Shin, DEVIOUS: Device-Driven Side-Channel Attacks on the IOMMU, 2023 IEEE Symposium on Security and Privacy (IEEE S&P), May 2023 Qi Pei, Seunghee Shin, Improving the Heavy Re-encryption Overhead of Split Counter Mode Encryption for NVM, 2021 IEEE International Conference on Computer Design (ICCD), October 2021Zhen Lin, Kao-Feng Hsieh, Yu Sun, Seunghee Shin, Hui Lu, FlashCube: Fast Provisioning of Serverless Functions with Streamlined Container Runtimes, The 11th Workshop on Programming Languages and Operating Systems (PLOS), October 2021Emir C Marangoz, Kyoung-Don Kang, Seunghee Shin, Designing GPU Architecture for Memory Bandwidth Reservation, 2021 IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS), March 2021Qi Pei, Seunghee Shin, Efficient Split Counter Mode Encryption for NVM, 2021 IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS), March 2021Yu Sun, Jiaxin Lei, Seunghee Shin, Hui Lu, Baoverlay: a block-accessible overlay file system for fast and efficient container storage, The 11th ACM Symposium on Cloud Computing (SOCC), New York, NY, October 2020 Seunghee Shin, Michael LeBeane, Yan Solihin, Arkaprava Basu, Neighborhood-aware address translation for irregular GPU application, Proceedings of the 51th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), Fukuoka City, Japan, October 2018 Seunghee Shin, Guilherme Cox, Mark Oskin, Gabriel H Loh, Yan Solihin, Abhishek Bhattacharjee, Arkaprava Basu, Scheduling Page Table Walks for Irregular GPU Applications, 2017 ACM/IEEE 44th Annual International Symposium on Computer Architecture (ISCA), Los Angeles, CA, June 2018 Seunghee Shin, Satish Kumar Tirukkovalluri, James Tuck, Yan Solihin, Proteus: A Flexible and Fast Software Supported Hardware Logging approach for NVM, Proc. of the 9th Annual Non-Volatile Memories Workshop  (NVMW), San Diego, CA, March 2018. Seunghee Shin, Satish Kumar Tirukkovalluri, James Tuck, Yan Solihin, Proteus: A flexible and fast software supported hardware logging approach for NVM, Proceedings of the 50th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), Cambridge, Massachusetts, October 2017Seunghee Shin, James Tuck, Yan Solihin, Hiding the long latency of persist barriers using speculative execution, 2017 ACM/IEEE 44th Annual International Symposium on Computer Architecture (ISCA), Toronto, ON, Canada, June 2017Seunghee Shin, Sihong Kim, Yan Solihin, Dense Footprint Cache: Capacity-Efficient Die-Stacked DRAM Last Level Cache, Proceedings of the Second International Symposium on Memory Systems (MEMSYS), Alexandria, VA, USA, October, 2016  https://scholar.google.com/citations?user=A7L47LMAAAAJ&hl=enResearch InterestComputer Architecture and SystemsReport abuseReport abuse",
  "content_length": 4055,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:57"
}