{
  "name": "Seungryong Kim",
  "homepage": "https://cvlab.kaist.ac.kr/members/faculty",
  "status": "success",
  "content": "CVLAB - FacultySearch this siteEmbedded FilesSkip to main contentSkip to navigationFacultySeungryong Kim, Associate Professor, Ph.D.I am an Associate Professor at Kim Jaechul Graduate School of AI, KAIST, Seoul, Korea.Before joining KAIST, I was an assistant professor at Korea University, a postdoctoral researcher in School of Computer and Communication Science  at École Polytechnique Fédérale de Lausanne (EPFL), Lausanne, Switzerland, and a postdoctoral researcher in School of Electrical and Electronic Engineering at Yonsei University, Seoul, Korea. I was a research intern at Microsoft Research Asia (MSRA), Beijing, China. I received the B.S. and Ph.D. degrees in School of Electrical and Electronic Engineering at Yonsei University, Seoul, Korea, in 2012 and 2018, respectively.My research interests include Computer Vision, Computational Photography, Machine Learning, and Deep Learning, particularly representation learning, visual scene reconstruction and understanding. [Google Scholar] [CV]ExperienceAssociate Professor in Korea Advanced Institute of Science and Technology (KAIST), Seoul, Korea (2024.08 - Present)Associate Professor in Korea University, Seoul, Korea (2024.03 - 2024.07)Assistant Professor in Korea University, Seoul, Korea (2020.03 - 2024.02)Postdoctoral Researcher in École Polytechnique Fédérale de Lausanne (EPFL), Lausanne, Switzerland (2019.03 - 2020.02)Postdoctoral Researcher in Yonsei University, Seoul, Korea (2018.03 - 2019.02)Research Intern in Microsoft Research Asia (MSRA), Beijing, China (2015.09 - 2016.02)EducationPh.D. in Electrical and Electronics Engineering, Yonsei University (2012.03 - 2018.02)B.S. in Electrical and Electronics Engineering, Yonsei University (2008.03 - 2012.02, Graduated Cum Laude)Professional Activities Member of IEEE, Professional Member of ACMArea ChairAnnual Conference on Neural Information Processing Systems (NeurIPS) 2023, 2024Area ChairComputer Vision and Pattern Recognition (CVPR) 2023, 2024Technical Program CommitteeInternational Conference on Consumer Electronics (ICCE) Asia 2022OrganizerThe 1st Workshop on Customized Chat Grounding Persona and Knowledge at COLING 2022Program Committee1st Workshop on Traditional Computer Vision in the Age of Deep Learning (TradiCV) at ICCV 2021Area ChairInternational Conference on 3D Vision (3DV) 2020, 2022Publication ChairThe 1st Workshop and Challenge on Comprehensive Video Understanding in the Wild (CoVieW’18) at ACM MM 2018ReviewersAAAI Conference on Artificial Intelligence (AAAI)International Conference on Learning Representations (ICLR)Neural Information Processing Systems (NeurIPS)European Conference on Computer Vision (ECCV)Computer Vision and Pattern Recognition (CVPR)AAAI Conference on Artificial Intelligence (AAAI)International Conference on Computer Vision (ICCV)Computer Vision and Pattern Recognition (CVPR)IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)Etc.Awards and HonorsOutstanding Lecture Award, Korea University, 2021, 2022, 2023 Silver, Bronze Prize, Outstanding Paper Award, Workshop of Image Processing and Image Understanding (IPIU), 2024 Outstanding Poster Presentation Award, Workshop of Image Processing and Image Understanding (IPIU), 2023Outstanding Young Researcher Award, Signal Processing Society of IEIE, 2022Outstanding Paper Award, Signal Processing Joint Conference of IEIE, 2022.Outstanding Paper Award, NAVER Award in Summer Annual Conference of IEIE, 2022.Silver Prize, Outstanding Paper Award, Workshop of Image Processing and Image Understanding (IPIU), 2022Outstanding Lecture Aware at Korea University, 2021, 2022Award Certification by Korean Ministry of Education, 2021Chun-Gang Outstanding Research Award, Chun-Gang Memorial Foundation, 2018Doctoral Consortium Award, IEEE ICCV, 2017Honorable Mention Award, Outstanding Research Award, Yonsei University, 2017Microsoft Research Asia Fellowship Nomination Award, 2016Runner-up Award, Hackatone Competition, HYUNDAI Motor Group, 2016Bronze Award, IEEE Student Paper Contest, IEEE Seoul Section, 2012Volunteer Award, IEEE Broadcast Technology Society, 2012Honor Graduation Award, Yonsei University, 2012Best Award, COEX 2011 Capstone Design Symposium, 2011Best Award, Capstone Design Symposium, Korea University, 2011Best Award, Creative Research Competition, Yonsei University, 2011Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4411,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:58"
}