{
  "name": "Seungryul Baek",
  "homepage": "https://sites.google.com/site/bsrvision00",
  "status": "success",
  "content": "Seungryul BaekSearch this siteEmbedded FilesSkip to main contentSkip to navigationSeungryul Baek ( 백승렬 )Associate Professor UNIST Vision and Learning (UVL) LabArtificial Intelligent Graduate School (AIGS) & Department of Computer Science and Engineering College of Information and Biotechnology Ulsan National Institute of Science and Technology (UNIST)Email: srbaek@unist.ac.kr (official), sryul.baek@gmail.com (personal)Links: [Cirriculum Vitae], [Lab Homepage: https://vision.unist.ac.kr],  [YouTube channel], [Google scholar] 50 UNIST-gil, Ulju, Ulsan, South Korea, 44919Brief Bio: I am an associate professor, jointly affiliated to the Artificial Intelligence Graduate School (AIGS) and Department of Computer Science and Engineering (CSE) at UNIST where I joined in April 2020. I obtained BS (2009) and MS (2011) degrees from Dept. of Electrical Engineering at KAIST and Ph.D. degree (2020) from Dept. of Electrical and Electronic Engineering at Imperial College London. During my Ph.D., I have interned at INRIA Sophia Antipolis (2019.6-2019.8.). Before joining Ph.D., I was an employee at DMC Research Center of Samsung Electronics for four years (2011.2.-2015.2.).Our lab holds a fund for multiple Innocore PostDoc positions (salary: 90 million KRW/yr for max 5 yrs). Please contact me, if interested in.Our lab opens a new branch in Centum AI Convergence Research Center (Haeundae Busan) since Sep. 2025.Research InterestsComputer Vision and Machine Learning (Deep Learning).3D Pose Estimation/Mesh Reconstruction, Action/Gesture Recognition, Semantic Segmentation, Object Recognition.EducationPh.D. at Dept. of Electrical and Electronic Engineering, Imperial College London, London, United Kingdom.Advisor: Tae-Kyun KimSep. 2015 ~ Mar. 2020.M.S. at Dept. of Electrical Engineering, Korea Advanced Institute of Science and Technology (KAIST), Daejeon, South Korea.Advisor: Chang D. YooFeb. 2009 ~ Feb. 2011.B.S. at Dept. of Electrical Engineering, Korea Advanced Institute of Science and Technology (KAIST), Daejeon, South Korea.Mar. 2004 ~ Jan. 2009.Work ExperiencesAssociate Professor, Ulsan National Institute of Science and Technology (UNIST), Ulsan, South Korea.AI Graduate School and Dept. of CSEMar. 2024 ~ (Present).Assistant Professor, Ulsan National Institute of Science and Technology (UNIST), Ulsan, South Korea.AI Graduate School and Dept. of CSEApr. 2020 ~ Feb. 2024.Student Internship, INRIA Sophia Antipolis, Valbonne, France.Advisor: François BrémondJun. 2019 ~ Aug. 2019.Computer Vision Engineer, Samsung Electronics, DMC Research, Suwon, South Korea.This job is taken as the alternative to the military duties in South Korea.Feb. 2011 ~ Feb. 2015.PublicationsYoojin Jang, Junsu Kim, Ha Yeon Kim, Eun-Ki Lee, Eun-Sol Kim, Seungryul Baek, Jaejun Yoo, \"B-RIGHT: Benchmark Re-evaluation for Integrity in Generalized Human-Object Interaction Testing\",  in Proc. of British Machine Vision Conference (BMVC), Sheffield, UK, 2025 (accepted).Taehoon Kim, Jongwook Choi, Yonghyun Jeong, Haeun Noh, Jaejun Yoo, Seungryul Baek, Jongwon Choi, \"Beyond Spatial Frequency: Pixel-wise Temporal Frequency-based Deepfake Video Detection\", in Proc. of IEEE Int. Conf. on Computer Vision  (ICCV),  Honolulu, HI, USA, 2025 (accepted).Jeongwan On, Kyeonghwan Gwak, Gunyoung Kang, Junuk Cha, Soohyun Hwang, Hyein Hwang, Seungryul Baek, \"BIGS: Bimanual Category-agnostic Interaction Reconstruction from Monocular Videos via 3D Gaussian Splatting\", in Proc. of IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Nashville, TN, USA, 2025.Uyoung Jeong, Jonathan Freer, Seungryul Baek, Hyung Jin Chang, Kwang In Kim, \"PoseBH: Prototypical Multi-Dataset Training Beyond Human Pose Estimation\", in Proc. of IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Nashville, TN, USA, 2025.Elkhan Ismayilzada, Khalequzzaman Sayem, Yihalem Yimolal Tiruneh, Mubarrat Tajoar Chowdhury, Muhammadjon Boboev, Seungryul Baek, \"QORT-Former: Query-optimized Real-time Transformer for Understanding Two Hands Manipulating Objects\", in Proc. of Annual AAAI Conference on Artificial Intelligence (AAAI), Philadelphia, PA, USA, 2025.Junuk Cha, Mengwei Ren, Krishna Kumar Singh, He Zhang, Yannick Hold-Geoffroy, Seunghyun Yoon, HyunJoon Jung, Jae Shin Yoon*, Seungryul Baek*, \"Text2Relight: Creative Portrait Relighting with Text Guidance\", in Proc. of Annual AAAI Conference on Artificial Intelligence (AAAI), Philadelphia, PA, USA, 2025.Zicong Fan, Takehiko Ohkawa, Linlin Yang, Nie Lin, Zhishan Zhou, Shihao Zhou, Jiajun Liang, Zhong Gao, Xuanyang Zhang, Xue Zhang, Fei Li, Liu Zheng, Feng Lu, Karim Abou Zeid, Bastian Leibe, Jeongwan On, Seungryul Baek, Aditya Prakash, Saurabh Gupta, Kun He, Yoichi Sato, Otmar Hilliges, Hyung Jin Chang, Angela Yao, \"Benchmarks and Challenges in Pose Estimation for Egocentric Hand Interactions with Objects\", in Proc. of European Conference on Computer Vision (ECCV), Milano, Italy, 2024.Junsu Kim, Hoseong Cho, Jihyeon Kim, Yihalem Yimolal Tiruneh, Seungryul Baek, \"SDDGR: Stable Diffusion-based Deep Generative Replay for Class Incremental Object Detection\", in  Proc. of IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Seattle, WA, USA, 2024 (Highlight presentation, 324/11,532≈2.8% Accept ratio).Junuk Cha, Jihyeon Kim, Jae Shin Yoon*, Seungryul Baek*, \"Text2HOI: Text-guided 3D Motion Generation for Hand-Object Interaction\", in  Proc. of IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Seattle, WA, USA, 2024.Jongwook Choi, Taehoon Kim, Yonghyun Jeong, Seungryul Baek, Jongwon Choi, \"Exploiting Style Latent Flows for Generalizing Video Deepfake Detection\", in  Proc. of IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Seattle, WA, USA, 2024.Junsu Kim, Yunhoe Ku, Jihyeon Kim, Junuk Cha, Seungryul Baek, \"VLM-PL: Advanced Pseudo Labeling approach Class Incremental Object Detection with Vision-Language Model\", CVPR Workshop on Continual Learning Vision (CLVision), Seattle, WA, USA, 2024. Junsu Kim, Sumin Hong, Chanwoo Kim, Jihyeon Kim, Yihalem Yimolal Tiruneh, Jeongwan On, Jihyun Song, Sunhwa Choi, Seungryul Baek, \"Class-wise Buffer Management for Incremental Object Detection: An Effective Buffer Training Strategy\", in Proc. of IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), Seoul, South Korea, 2024.YunSeong Cho, Chanwoo Kim, Hoseong Cho, Yunhoe Ku, Eunseo Kim, Muhammadjon Boboev, Joonseok Lee, Seungryul Baek, \"RMFER: Semi-supervised Contrastive Learning for Facial Expression Recognition with Reaction Mashup Video\", in Proc. of IEEE Winter Conf. on Applications of Computer Vision (WACV), Waikoloa, HI, USA, 2024 (Oral presentation, 53/2,042≈2.6% Accept ratio).Junuk Cha, Hansol Lee, Jaewon Kim, Nhat Nguyen Bao Truong, Jae Shin Yoon*, Seungryul Baek*, \"3D Reconstruction of Interacting Multi-Person in Clothing from a Single Image\", in Proc. of IEEE Winter Conf. on Applications of Computer Vision (WACV), Waikoloa, HI, USA, 2024.Nodirkhuja Khujaev, Tsoy Roman, Seungryul Baek, \"AstroYOLO: Learning Astronomy Multi-Tasks in a Single Unified Real-Time Framework\", in NeurIPS 2023 Workshop on Machine Learning and Physical Sciences, New Orleans, LA, USA, 2023.Uyoung Jeong, Seungryul Baek, Hyung Jin Chang, Kwang In Kim, \"BoIR: Box-Supervised Instance Representation for Multi Person Pose Estimation\", in Proc. of British Machine Vision Conference (BMVC), Aberdeen, UK, 2023.Hoseong Cho, Chanwoo Kim, Jihyeon Kim, Seongyeong Lee, Elkhan Ismayilzada, Seungryul Baek, \"Transformer-based Unified Recognition of Two Hands Manipulating Objects\", in  Proc. of IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Vancouver, Canada, 2023.Seongyeong Lee, Hansoo Park, Jihyeon Kim, Dong Uk Kim, Muhammadjon Boboev, Seungryul Baek, \"Image-free Domain Generalization via CLIP for 3D Hand Pose Estimation\", in Proc. of IEEE Winter Conf. on Applications of Computer Vision (WACV), Waikoloa, HI, USA, 2023.Junuk Cha, Muhammad Saqlain, GeonU Kim, Mingyu Shin, Seungryul Baek, \"Multi-Person 3D Pose and Shape Estimation via Inverse Kinematics and Refinement\", in Proc. of European Conf. on Computer Vision (ECCV), Tel Aviv, Israel, 2022.Junuk Cha, Muhammad Saqlain, Donguk Kim, Seungeun Lee, Seongyeong Lee, Seungryul Baek, \"Learning 3D Skeletal Representation From Transformer for Action Recognition\", in IEEE Access 2022 (IF:3.367).Muhammad Saqlain, Donguk Kim, Junuk Cha, Changhwa Lee, Seongyeong Lee, Seungryul Baek, \"3DMesh-GAR: 3D human body mesh-based method for group activity recognition\", in Sensors 2022 (IF:3.576).Dong Uk Kim, Kwang In Kim, Seungryul Baek, ''End-to-End Detection and Pose Estimation of Two Interacting Hands'', in Proc. of IEEE  Int. Conf. on Computer Vision  (ICCV), Virtual, 2021. Junuk Cha, Muhammad Saqlain, Changhwa Lee, Seongyeong Lee, Seungeun Lee, Donguk Kim, Won-Hee Park, Seungryul Baek, \"Towards Single 2D Image-level Self-supervision for 3D Human Pose and Shape Estimation\", in Journal of Applied Sciences 2021 (IF:2.679).Anil Armagan, Guillermo Garcia-Hernando, Seungryul Baek, Shreyas Hampali, Mahdi Rad, Zhaohui Zhang, Shipeng Xie, Neo Chen, Boshen Zhang, Fu Xiong, Yang Xiao, Zhiguo Cao, Junsong Yuan, Pengfei Ren, Weiting Huang, haifeng sun, Marek Hrúz, Jakub Kanis, Zdeněk Krňoul, Qingfu Wan, Shile Li, Dongheui Lee, Linlin Yang, Angela Yao, Yun-Hui Liu, Adrian Spurr, Pavlo Molchanov, Umar Iqbal, Philippe Weinzaepfel, Romain Brégier, Grégory Rogez, Vincent Lepetit, Tae-Kyun Kim, ''Measuring Generalisation to Unseen Viewpoints, Articulations, Shapes and Objects for 3D Hand Pose Estimation under Hand-Object Interaction'', in Proc. of European Conf. on Computer Vision (ECCV), Edinburgh, UK, 2020.Seungryul Baek, Kwang In Kim, Tae-Kyun Kim, \"Weakly-supervised Domain Adaptation via GAN and Mesh Model for Estimating 3D Hand Poses Interacting Objects\", in Proc. of IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), Seattle, WA, USA, 2020 (Oral presentation, 335/5,865≈5.7% Accept ratio).Binod Bhattarai, Seungryu",
  "content_length": 22213,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:58"
}