{
  "name": "Seungwon Shin 0001",
  "homepage": "http://nss.kaist.ac.kr/?page_id=29",
  "status": "success",
  "content": "Faculty – NSS | Network and System Security Laboratory Skip to content Search for: Home People Faculty Doctoral Students Master’s Students Alumni Research Publication/Talk Award Gallery 291 Daehak-ro, Yuseong-gu, Daejeon, Korea nsslab@kaist.ac.kr Associate Professor (tenured)School of Electrical Engineering, KAISTEmail: claude@kaist.ac.krOffice: N1-910Address: 291 Daehak-ro, Yuseong-gu, Daejeon, Korea, 305-701 About Professor Seungwon Shin: Professor Seungwon Shin received the Ph.D. degree in computer engineering from the Electrical and Computer Engineering Department, Texas A&M University (Advisor, Prof. G. Gu and Prof. A. L. Narasimha Reddy). He received his M.S degree and B.S degree in electrical and computer engineering from KAIST. He is currently an Associate Professor (tenured) in the School of Electrical Engineering at KAIST. Before joining KAIST, he has spent nine years at industry, where he devised several mission critical networking systems. He is currently a Research Associate of Open Networking Foundation (ONF), and a member of security working group at ONF. His research interests span the areas of Software Defined Networking (SDN) security, IoT (Inter of Things) security, and Botnet analysis/detection. A common thread in his research is in revealing/ understanding network threats and designing new systems/algorithms for making networked system secure. He has conducted several SDN security projects to make SDN environments more secure (e.g., FRESCO, FortNOX, and Avant-Guard) and their outputs have been published at top-tier networking/security conferences, such as ACM CCS, NDSS, and SIGCOMM-HotSDN. [Publications] [Google Scholar] Work Experience: Sep 2013 – present : KAIST, Daejeon, South Korea (Associate Professor) May 2012 – Aug 2012 : SRI International, Menlo Park, CA, USA (Summer Intern, Mentors: Phil Porras and Vinod Yegeswaran) May 2011 – Aug 2011 : SRI international, Menlo Park, CA, USA (Summer Intern, Mentors: Phil Porras and Vinod Yegeswaran) Oct 2006 – Jul 2009 : TmaxSoft, Seoul, Korea (Principal Researcher, Team Manager) Nov 2005 – Aug 2006 : Massachusetts Institute of Technology (MIT), MA, U.S.A., (Visiting Scientist, Host: Hari Balakrishnan) Dec 2002 – Oct 2005 : ETRI, Daejeon, Korea, (Researching Staff) Feb 2000 – Oct 2002: TmaxSoft, Seoul, Korea (Senior Researcher) Professional Services: Editorial Board – Elsevier Computers & Security General Chair – 2016:  IEEE ICNP Hot-PNS Workshop Program Chair – ACM SDN/NFV Security Workshop (2016, 2017, 2018) Demo/Poster Chair – ACM SOSR 2020 Program Committee – 2022 : ACSAC, ICDCS, DIMVA, SecureComm        – 2021 : ACSAC, SECURECOM, DIMVA, CRISIS        – 2020: ACSAC, ASIACCS, IEEE WCNC, DIMVA        – 2019: CCS, ACSAC, SECURECOM, IEEE CNS, IEEE DAPPCON, IEEE Globecom, AIBlock (ACNS workshop)        – 2018: ACSAC, INFOCOM, IEEE CNS, AsiaCCS, SECURECOM, IoT S&P/SecSON (SIGCOMM workshop),                      ICCCN, ICICS        – 2017: INFOCOM, IEEE CNS, SECURECOM, IEEE Globecom, IoT S&P (ACM CCS workshop),   IEEE ATC        – 2016: INFOCOM, IEEE CNS, AsiaCCS, SECURECOM, IEEE Globecom, Inscrypt        – 2015: Inscrypt, SECURECOM, ICNP-CoolSDN, NDSS-SENT        – 2014: ICNP-CoolSDN, IEEE ATC, PST, IWCMC-SDWN Guest Editor – IEEE TDSC Special Issue, ChinaCom, Security and Communication Networks Research Associate – Open Networking Foundation(ONF), 2015 – 2017 Location Details291 Daehak-ro, Yuseong-gu, Daejeon, Korea",
  "content_length": 3440,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:59"
}