{
  "name": "Seungjin Choi",
  "homepage": "http://mlg.postech.ac.kr/~seungjin",
  "status": "success",
  "content": "Seungjin Choi Seungjin Choi Professor of Computer Science Department of Computer Science and Engineering, Pohang University of Science and Technology (POSTECH), 77 Cheongam-ro, Nam-gu, Pohang 37673, KOREA, email: seungjin.choi.mlg@gmail.com Hello, this is my old website but I still maintain updated information for my own purpose. I was a Professor of Computer Science at POSTECH, Korea. I received B.S. and M.S. in the Department of Electrical Engineering from Seoul National University, KOREA, in 1987 and 1989, respectively. From August 1990 through August 1996, I was with Laboratorty for Image and Signal Analysis (LISA), University of Notre Dame (ND) where I received the Ph.D. degree in the Department of Electrical Engineering in 1996. After lecturing as a Visiting Assistant Professor at University of Notre Dame for 1996 Fall semester, I joined Lab for Artificial Brain Systems (headed by Professor A. Cichocki), Brain Information Processing Group (directed by Professor S. Amari) in RIKEN, JAPAN. While I was working in Brain Information Processing Group, RIKEN, I focused on understanding an information processing principle for brain and I also worked on independent component analysis (ICA) extensively. Whole scientists working in brain science have wanted to know how brain works. That is our ultimate goal. Personally, I would like to devote myself to develop real unsupervised learning algorithms in the sense that they have real intelligence. I would like to call a family of these algorithms as self-evaluation algorithms. (this is tentative terminology because I have not found better word) I used to work on multichannel blind deconvolution and equalization problem which is very fundamental and challenging. Multichannel blind deconvolution and equalization have numerous applications in digital communication and wireless communications as well as in brain science. My academic background grew up in signal processing community and statistics, not in neuroscience. However, ever since I worked on RIKEN, Japan, I started to have a variety of interests in brain science, especially computational neuroscience. My experience of working with Prof. S. Amari and A. Cichocki made me to realize how much important information theory is. Ever since then, my interest has remained in a variety of topics in information theory, mainly information-theorectic learning. As of February, 2001, I joined the Department of Computer Science in POSTECH. Currently I am working on machine learning, especially statistical machine learning which included many exciting things such as probabilistic models, graphical models, kernel machines, Bayesian learning, and so on. I am also working on the applications of machine learning, which include brain computer interface, pattern classfication, medical imaging, computational hearing/vision, bioinformatics, etc. I would like to keep doing some theoretical work to develop real learning algorithms and will do some application work as well. Although whole algorithms can not be named as learning algorithms (they are simply adaptive algorithms, they are not really learning), I am one of researchers who have called them as learning algorithms. Until I come up with self-evaluation algorithms, I will be excused to call them as learning algorithms. News I will be serving as a short course chair for ICASSP-2024. I am serving as an area chair for ICML-2023. I am serving as an area chair for ICLR-2023. The paper \"Combinatorial Bayesian optimization with random mapping functions to convex polytope\" (with Jungtaek Kim and Minsu Cho) has been accepted by UAI-2022. I am serving as an area chair for NeurIPS-2022. I have served as an area chair for NeurIPS-2021, 2020, 2019, 2018, 2017, 2015. The paper \"On uncertainty estimation by tree-based surrogate models in sequential model-based optimization\" (with Jungtaek Kim) has been accepted by AISTATS-2022. I have served as an area chair for IJCAI-2022, 2021, 2020, 2019. I have served as an area chair for ICML-2022, 2021, 2020, 2019. I have served as an area chair for ICLR-2022, 2021. I have served as an area chair for AAAI-2022, 2021. The paper \"Bayesian optimization with approxiate set kernels\" (with Jungtaek Kim, Michael McCourt, Tackgeun You, Saehoon Kim) has been accepted by Machine Learning Journal. The paper on neural complexity measures (with Yoonho Lee et al.) has been accepted by NeurIPS-2020. The paper on \"local optimizers of acquisition functions\" (with Jungtaek Kim) has been accepted by ECML-PKDD-2020. The paper on \"set transformer\" (with Juho Lee, Yoonho Lee, Jungtaek Kim, Adam R. Kosiorek, and Yee Whye Teh) has been accepted by ICML-2019. I have served as an area chair for ACML-2022, 2021, 2020, 2019, 2018. A paper with Juho Lee, Lancelot James, and Francois Caron has been accepted at AISTATS-2019. I have served as an area chair for AISTATS-2019. A paper with Yoonho Lee has been accepted by ICML-2018. A paper with Saehoon Kim and Jungtaek Kim has been accepted by AAAI-2018. A paper with Juho Lee, Creighton Heaukulani, Zoubin Ghahramani, and Lancelot James has been accepted by ICML-2017. I served as a special sessions co-chair for ICASSP-2018. A paper with Saehoon Kim has been accepted at AAAI-2017. A paper with Juho Lee and Lancelot James has been accepted at NIPS-2016. I organized the 'First Korea-Japan Machine Learning Symposium' which took place in SK T-Tower on June 2-3, 2016. I organized the Korean 'machine learning winter worskhop' which took place in Phoenix Park on Thursday, December 17, 2015. I organized the 2nd Korean 'deep learning workshop' which was held in SK T-Tower on Friday, October 16, 2015. My life as a geek: Are you interested in my publications? Teaching Current students My research group on machine learning Collection of pix Program committee",
  "content_length": 5817,
  "method": "requests",
  "crawl_time": "2025-12-01 14:25:57"
}