{
  "name": "Sevil Sen",
  "homepage": "https://web.cs.hacettepe.edu.tr/~ssen",
  "status": "success",
  "content": "Sevil Sen's Home Page Sevil Şen Professor Department of Computer Engineering Hacettepe University 06800 Ankara, TURKEY Office: 113 Phone: +90 (0) 312 2977500 email: ssen@cs.hacettepe.edu.tr Follow @huwiselab Publications Projects Activities Students Teaching About Me I am currently a faculty member at the Department of Computer Engineering, Hacettepe University and the head of the WISE Lab. My journey in academia started when I completed my PhD in the Department of Computer Science at the University of York, UK, after which I joined Hacettepe University as a lecturer in October 2010. I was appointed Associate Professor of Computer Science in 2015, followed by my promotion to Full Professor of Computer Science in 2022. Throughout my career, I have had the opportunity to conduct research visits to prestigious institutions, including Eurecom Institute in France in 2011 and the University of York, UK in 2016 and 2022. I am affiliated with the Cyber Security and Privacy Research Group at York. For more, please see my CV. Research My research interests are centered around the development of intelligent secure systems. In particular, I am highly engaged in researching intrusion detection, trust management and malware analysis. My work also extends to wireless networks and IoT, where I concentrate on enhancing routing protocols and strengthening the security of these networks. Furthermore, I am interested in nature-inspired algorithms and evolutionary computation, and their application to solve hard problems in networking and security. Throughout the years, I have been actively investigating the implementation of artificial intelligence-based approaches to tackle challenging problems in the fields of networking and security. Latest News December 2025: Organizing AdHocNets 2025 in Istanbul Nov 2025: Attending FPS2025, Brest July 2025: Talk at University of Milan May 2025: A new patent on Malicious Code Localization July 2024: Keynote Speech at NLPAICS'24, Lancaster July 2023 : Invited talk at CBIoT 2023, London March 2022 : 5G ve Ötesi Burs Programı Hakkında October 2018 : Invited talk at Mid Sweden University about Our Research Visit. September 2018 : New Joint Project with Mid Sweden University Detecting Intrusions in Industrial Internet of Things.",
  "content_length": 2281,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:00"
}