{
  "name": "Seyede Fatemeh Ghoreishi",
  "homepage": "https://ghoreishi.sites.northeastern.edu/#_ga=2.121167816.151196753.1645503161-368177100.1593803560",
  "status": "success",
  "content": "Fatemeh Ghoreishi | Fatemeh Ghoreishi Fatemeh Ghoreishi Assistant Professor College of Engineering & Khoury College of Computer Sciences Northeastern University Profile: Google Scholar Email: f.ghoreishi@northeastern.edu Short Bio I am an assistant professor in the Department of Civil and Environmental Engineering and the Khoury College of Computer Sciences at Northeastern University. My research includes machine learning and Bayesian statistics for design and decision-making under uncertainty. Prior to Northeastern, I was a postdoctoral research fellow at the Institute for Systems Research at the University of Maryland. I received my M.Sc. and Ph.D. degrees both in Mechanical Engineering from Texas A&M University in 2016 and 2019 respectively. I hold a minor in Applied Statistics from the Department of Statistics at Texas A&M University. I also received an M.Sc. degree in Biomedical Engineering from Iran University of Science and Technology in 2014 and a B.Sc. degree in Mechanical Engineering from the University of Tehran in 2012. Open Positions I am looking for motivated Ph.D. students to join my group. The general areas of interest include machine learning, optimization, and Bayesian statistics. The candidates are expected to have strong backgrounds in programming, mathematics, and statistics. If interested, please contact me at f.ghoreishi@northeastern.edu and include your CV and transcripts. Highlights Elevated to the Grade of IEEE Senior Member [January 2025]. Our paper “Surrogate Modeling for Efficient Uncertainty Analysis of Coupled Multidisciplinary Systems” received the Best Paper Finalist Award at the 2025 AIAA SciTech [January 2025]. Joined the Editorial Board of IEEE Transactions on Intelligent Transportation Systems [November 2024]. Our paper “Active Learning for Efficient Data Acquisition in Coupled Multidisciplinary Systems” received the Conference Best Paper Award at the Modeling, Estimation, and Control Conference (MECC 2024) [November 2024]. Promoted to the Senior Editor of IEEE Transactions on Neural Networks and Learning Systems [February 2024]. Received the Army Research Laboratory (ARL) Award on Strengthening Teamwork for Robust Operations in Novel Groups [September 2023]. Selected as the Corresponding Member of ASCE Artificial Intelligence in Transportation Committee [June 2023]. Received an FY24 TIER 1 Interdisciplinary Research Seed Grant [April 2023]. Joined the Editorial Board of IEEE Transactions on Neural Networks and Learning Systems [February 2022]. Joined the Department of Civil and Environmental Engineering and the Khoury College of Computer Sciences at Northeastern University as an assistant professor [August 2021]. Served as a co-chair in 2021 American Control Conference (ACC) [May 2021]. Gave a talk on “Bayesian Decision Making and Learning in Complex Uncertain Systems” in the Department of Aerospace and Ocean Engineering at Virginia Tech [March 2021]. Gave a talk on “Bayesian Decision Making and Learning in Complex Uncertain Systems” in the Department of Mechanical Engineering at University of Wisconsin-Madison [January 2021]. Co-organized a half-day workshop titled “Scalable, Reliable and Online Bayesian Learning” in IEEE 16th International Conference on Automation Science and Engineering (CASE) [August 2020]. Co-organized a half-day workshop titled “Machine Learning for Scalable, Reliable and Online Design and Decision Making” workshop in IEEE Conference on Control Technology and Applications (CCTA) [August 2020]. Gave a talk on “Scalable and Reliable Design and Decision-Making: A Bayesian Perspective” in the Schools of Mechanical Engineering and Industrial & Systems Engineering at Georgia Institute of Technology [March 2020]. Gave a talk on “Scalable and Reliable Design and Decision-Making: A Bayesian Perspective” in the Department of Civil and Environmental Engineering at University of Southern California [March 2020]. Gave a talk on “Scalable and Reliable Design and Decision-Making: A Bayesian Perspective” in the Department of Structural Engineering at University of California San Diego [March 2020]. Gave a talk on “Scalable and Reliable Design and Decision-Making: A Bayesian Perspective” in the Department of Mechanical Engineering at Pennsylvania State University [March 2020]. Honors and Awards Elevated to the Grade of IEEE Senior Member, 2025. Recipient of the Conference Best Paper Finalist Award at the 2025 AIAA SciTech. Recipient of the Conference Best Paper Award at the Modeling, Estimation, and Control Conference (MECC 2024). Selected as the Rising Stars in Mechanical Engineering at the University of California, Berkeley, 2020. Recipient of the Maryland Robotics Center Postdoctoral Fellowship at the Institute for Systems Research (ISR) at the University of Maryland, 2019 and 2020. Selected as the Rising Stars in Computational and Data Sciences at the Oden Institute for Computational Engineering and Sciences at the University of Texas at Austin, 2019.",
  "content_length": 4991,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:06"
}