{
  "name": "Seyed Ebrahim Abtahi",
  "homepage": "http://sharif.edu/~abtahi",
  "status": "success",
  "content": "ï»¿ Seyed Ebrahim Abtahi Seyed Ebrahim AbtahiAssistant Professor Department of Computer Engineering Sharif University of Technology Phone: 66166609 Fax: 66019246 E-Mail: abtahi[at]sharif[dot]edu Office: 709 Last Update: Aug 2017 [Education] [Courses] [Honors] [Memberships] [Research Interests] [Publications] [Supervised Projects] [Supervised Thesis] [Professional Experiences] [Links] Education MS Computer Science, Sharif University of Technology, IRAN, 1984 BS Computer Applications and Systems Analysis, SPCA (School of Planning and Computer Applications), IRAN, 1977 topâ Courses Fundamentals of Information Technology(14 times) Software Engineering (16 times) Systems Analysis and Design(16 times) Management Information Systems(7 times) Internet Engineering (6 times) Information Technology Strategic Management and Planning(10 times) Information Technology Project Management(10 times) Information Technology Ethics(9 times) Application Engineering(2 times) e-Learning(2 times) Computer Aided Learning(5 times) Cybernetics (2 times) Fundamentals and Applications of Informatics(3 times) Scientific and Technical Presentation (40 times) e-Commerce (2 times) topâ Honors Honored by President Khatami for contributions to the community, July, 2005. topâ Memberships 2015-Now Member of University Council of Information Technology , Sharif University of Technology, Tehran, Iran. 2015-now Iranian Society of Engineering Education (ISEE) : Member of Board of Directors and Supervisors (Now). 2010-2014 Member of Undergraduat and Graduate IT Discipline Courseware Improve and development Committee, Ministry of Science,Research and Technology, Tehran, Iran. 2008-now Iranian Association for Ethics in Science and Technology (IAEST). 1991-now Computer Society of Iran (CSI) : Member of Board of Directors and Supervisors. (Now) 1990-2000 Chairman and member of undergraduate project committee, Computer Engineering Department, Sharif University of Technology, Tehran, Iran. 1989-1993 Member of Committee for Computer Course Planning in High School, Research & Educational Planning Organization, Ministry of Education, Tehran, Iran. 1980-now Informatics Society of Iran (ISI) : Distinguished Member and Member of Editorial Board of COMPUTER REPORT Magazine. topâ Research Interests Information Technology (IT), Software Engineering, IT Strategic Management and Planning, Information Technology Ethics, IT Project Management, IT Education , e-Learning , e-Research. topâ Publications Journal Papers (Farsi List) Conference Papers (Farsi List) Books Date Title Publisher 2014 1-5 Dimensions Models of Course Chains for IT Courseware Development Sharif University of Technology 1995 Information Superhighway Technology Ministry of Agriculture 1992 Introduction to Informatics and Cybernetics University of Tehran 1989 What is informatics? DP-IRAN 1989 Informatics from development point of view DP-IRAN 1989 Informatics in the world DP-IRAN topâ Supervised Projects Under Graduate Students List (Farsi List) topâ Supervised Thesis Post Graduate Students List (Farsi List) topâ Professional Experiences 1984-2014 Educational and Research Consultancy for : 1) High Council of Informatics. 2) DP-IRAN Computer Company. 3) National Center of Gifted Children's Education. 4) Ministry of Education. 5) Ministry of Agriculture. 6) Agriculture Bank. 7) EN Bank : Eghtesade Novin Bank. 8) Agricultural Insurance Fund. 9) Rouzbeh , Farzanegan and Kherad High Schools. 2001-2011 Technical and Propjects Manager : RAHGOSHA Tehran System Co. , Tehran , IRAN. topâ Links My Ms Thesis supervisor : Dr. Behrooz Parhami topâ",
  "content_length": 3625,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:02"
}