{
  "name": "Seyed Mohammad Hosseini 0001",
  "homepage": "https://mohammad-hosseini.com",
  "status": "success",
  "content": "Mohammad Hosseini Skip to content Mohammad Hosseini Hello!I’m Mohammad Hosseini, an assistant professor at the Faculty of Computer Science and Engineering at Shahid Beheshti University. When my wife and baby give me a break, I spend my time teaching and doing research at the university—apparently just for heavenly rewards!🤔 Before joining the faculty, I survived a Master’s and a PhD in Computer Engineering at Sharif University of Technology.My teaching and research revolve around networked and distributed systems—basically, making a large number of computers talk to each other without fighting over resources, causing chaos, or arguing forever about who’s the leader! I’ve published in some cool venues like HotNets, SIGMETRICS, MICRO, IEEE TNSM, and IEEE TIFS, and I strive to keep my work at the level of top-tier conferences and journals.On this website, you can learn about the courses I teach and explore my research. You’ll also find my course materials here.Feel free to reach out if you want to talk about networks (especially cloud datacenter networking), distributed systems, or just swap parenting survival tips! Hello!I’m Mohammad Hosseini, an assistant professor at the Faculty of Computer Science and Engineering at Shahid Beheshti University. When my wife and baby give me a break, I spend my time teaching and doing research at the university—apparently just for heavenly rewards!🤔 Before joining the faculty, I survived a Master’s and a PhD in Computer Engineering at Sharif University of Technology. My teaching and research revolve around networked and distributed systems—basically, making a large number of computers talk to each other without fighting over resources, causing chaos, or arguing forever about who’s the leader! I’ve published in some cool venues like HotNets, SIGMETRICS, MICRO, IEEE TNSM, and IEEE TIFS, and I strive to keep my work at the level of top-tier conferences and journals.On this website, you can learn about the courses I teach and explore my research. You’ll also find my course materials here.Feel free to reach out if you want to talk about networks (especially cloud datacenter networking), distributed systems, or just swap parenting survival tips! Teaching Research Publications Contact Email: My institutional Email: m[dash]hosseini[at]sbu[dot]ac[dot]ir (I check it once a week!) Address:  Room 215, Computer Science and Engineering Department, Shahid Beheshti University, Tehran, Iran Google Scholar dblp LinkedIn Mohammad HosseiniAssistant professorFaculty of Computer Science and EngineeringShahid Beheshti University سید محمد حسینیاستادیار دانشکده علوم و مهندسی کامپیوتردانشگاه شهید بهشتی © 2025 Dr. Mohammad Hosseini. All rights reserved.",
  "content_length": 2707,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:02"
}