{
  "name": "Seán F. McLoone",
  "homepage": "https://www.qub.ac.uk/schools/eeecs/Connect/Staff/BusinessCard/?name=s.mcloone",
  "status": "success",
  "content": "Business Card | School of Electronics, Electrical Engineering and Computer Science | Queen's University Belfast Top Business Card Professor Sean McLoone E-mail: Phone: +44 (0)28 9097 4125 Fax: +44 (0)28 9097 5449 Research Profile: pure.qub.ac.uk/en/persons/seï¿½n-mcloone Room: 08.026Ashby Building,Stranmillis Road PostalAddress: School of Electronics, Electrical Engineering and Computer Science, The Queen's University Belfast, Ashby Building, Stranmillis Road Belfast, BT9 5AH Research Interests: Intelligent systems; System identification, fault diagnosis and statistical process control; Artificial intelligence inspired adaptive learning algorithms and optimization techniques; Optimization and control of renewable energy and demand side management systems; Soft sensing (virtual metrology), predictive maintenance and control of advanced manufacturing processes; Autonomous robotics Research Clusters:   Energy, Power and Intelligent Control School & University Responsibilities: Director of the Energy Power and Intelligent Control Research Cluster Member of the School Management Committee (SMC) Member of the School Management Group (SMG) External Activities: Associate Editor , Transactions of the Institute of Measurement and Control (2010- ) Member, IET Academic Accreditation Committee (2012- ) Member, Accreditation Board of Engineers Ireland (2008- ) Member, IFAC Technical Committee on Cognition and Control (2005- ) Treasurer, Irish Systems and Control Committee (Ireland's NMO for IFAC) Past Chairman (2010-2011), Chairman (2006-2009), Vice-Chairman (2006), Secretary (2002-2005) of United Kingdom and Republic of Ireland (UKRI) Section of the IEEE. Founder and inaugural Chairman (2004-2006), IEEE Communication and Control Ireland Joint Chapter of the IEEE UKRI Section. Meet Our People © Queen's University Belfast 2024 Privacy and cookies Website accessibility Freedom of information Modern slavery statement Equality, Diversity and Inclusion University Policies and Procedures Information Privacy and cookies Website accessibility Freedom of information Modern slavery statement Equality, Diversity and Inclusion University Policies and Procedures © Queen's University Belfast 2024 Manage cookies",
  "content_length": 2222,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:04"
}