{
  "name": "Shaddi Hasan",
  "homepage": "https://people.cs.vt.edu/shaddi",
  "status": "success",
  "content": "Shaddi Hasan Shaddi Hasan I am an assistant professor of computer science at Virginia Tech. My research interests are in networks, information and communication technologies for development (ICTD), HCI, and distributed systems. My research aims to build network infrastructure that meets the needs of the humans that rely upon it -- users, network operators, and policymakers. My research group builds operational, deployable systems informed by qualitative research with users and network operators and evaluated through real-world deployments and fieldwork. In doing so, our work expands the frontiers of the Internet beyond what is achievable today, providing more equitable access to communications, especially in rural and developing regions. My research has appeared in venues such as ICTD, SIGCOMM, IMC, and NSDI, and paper awards at NSDI, ACM DEV, and IEEE DySPAN. I am actively recruiting motivated PhD students with interests in networking, HCI, and policy. In addition, I have opportunities for motivated Virginia Tech undergraduates interested in research. Prospective PhD students: Please apply to the Virginia Tech CS program through the normal channels, and mention my name in your application. Current Virginia Tech undergraduates: Please send me email describing your research interests along with your CV/resume. Prior to Virginia Tech, I completed my PhD (2019) at UC Berkeley, advised by Eric Brewer, and my BS (2010) from the University of North Carolina at Chapel Hill, where I worked with Kevin Jeffay and Jay Aikat. In 2014, I co-founded Endaga (press), which was acquired by Facebook in 2015; I worked with Facebook Connectivity until 2021, where I helped start the Magma project. I am lucky to work with a number of excellent students as part of the Systems, People, Infrastructure, and Networks (SPIN) Lab. Wesley Woo (PhD) Tauhid Nabi (PhD) Aatif Dar (PhD) Prashiddha Dhoj Thapa (PhD) Zhuowei Wen (MS) Monniiesh Velmurugan (MS) Our group alumni: Zahra Yazdani (BS 2023; next PhD student Georgia Tech ) Molly Hickman (MS 2022; next nLine) Here's my CV. Selected Publications Making Cellular Networks More Efficient By Roaming-in-Place Tenzin Samten Ukyab, Lisa Suzuki, Demetrius Davis, Zhihong Luo, Silvery Fu, Shaddi Hasan, Sylvia Ratnasamy, Scott Shenker SIGCOMM, September 2025 [pdf] Strategic Misreporting in the National Broadband Map Zhuowei Wen, Jocelyn Bliton, Laasya Koduru, Arpit Gupta, Shaddi Hasan TPRC, September 2025 [pdf] Red is Sus: Automated Identification of Low-Quality Service Availability Claims in the US National Broadband Map Syed Tauhidun Nabi, Zhuowei Wen, Brooke Ritter, Shaddi Hasan IMC, November 2024 [pdf] [data] What's my Daily Value? Interpretation of Network Performance Metrics in Broadband Consumer Labels Wesley Woo and Shaddi Hasan SNIP2+, September 2023 [pdf] Building Flexible, Low-Cost Wireless Access Networks with Magma Shaddi Hasan, Amar Padmanabhan, Bruce Davie, Jennifer Rexford, Ulas Kozat, Hunter Gatewood, Shruti Sanadhya, Nick Yurchenko, Tariq Al-Khasib, Oriol Batalla, Marie Bremner, Andrei Lee, Evgeniy Makeev, Scott Moeller, Alex Rodriguez, Pravin Shelar, Karthik Subraveti, Sudhi Kandi, Alejandro Xoconostle, Praveen Kumar Ramakrishnan, Xiaochen Tian, and Anoop Tomar NSDI, April 2023 (Community Award) [pdf] [talk] [slides] [project site] [code] LOCA: A Location-Oblivious Cellular Architecture Zhihong Luo, Silvery Fu, Natacha Crooks, Shaddi Hasan, Christian Maciocco, Sylvia Ratnasamy, and Scott Shenker NSDI, April 2023 [pdf] Democratizing Cellular Access with CellBricks Zhihong Luo, Silvery Fu, Mark Theis, Shaddi Hasan, Sylvia Ratnasamy, and Scott Shenker SIGCOMM, August 2021 [pdf] [project site] [code] Scaling Community Cellular Networks with CommunityCellularManager Shaddi Hasan, Mary Claire Barela, Matthew Johnson, Eric Brewer, and Kurtis Heimerl NSDI, February 2019 (Community Award) [pdf] [slides] [code] [talk] An Investigation of Phone Upgrades in Remote Community Cellular Networks Kushal Shah, Philip Martinez, Emre Tepedelenlioglu, Shaddi Hasan, Cedric Festin, Joshua Blumenstock, Josephine Dionisio, and Kurtis Heimerl ICTD, November 2017 [pdf] Macroscopically Sustainable Networking: On Internet Quines Barath Raghavan and Shaddi Hasan LIMITS, June 2016 [pdf] The Challenges of Scaling WISPs Shaddi Hasan, Yahel Ben-David, Max Bittman, and Barath Raghavan. ACM DEV, December 2015 (Best Paper Award) [pdf] [slides] [code] GSM Whitespaces: An Opportunity for Rural Cellular Service Shaddi Hasan, Kurtis Heimerl, Kate Harrison, Kashif Ali, Sean Roberts, Anant Sahai, and Eric Brewer. IEEE DySPAN, April 2014 (Best Paper Award) [pdf] [slides] [code] An Experiment in Reducing Cellular Base Station Power Draw With Virtual Coverage Kurtis Heimerl, Shaddi Hasan, Kashif Ali, Eric Brewer, and Tapan Parikh. ACM DEV, December 2013 [pdf] Local, Sustainable, Small-Scale Cellular Networks Kurtis Heimerl, Shaddi Hasan, Kashif Ali, Eric Brewer, and Tapan Parikh. ICTD, December 2013 [pdf] Building Dissent Networks: Towards Effective Countermeasures against Large-Scale Communications Blackouts Shaddi Hasan, Yahel Ben-David, Giulia Fanti, Eric Brewer, and Scott Shenker. USENIX FOCI, August 2013 [pdf] [slides] [talk] Making Middleboxes Someone Else's Problem: Network Processing as a Cloud Service Justine Sherry, Shaddi Hasan, Colin Scott, Arvind Krishnamurthy, Sylvia Ratnasamy, and Vyas Sekar. SIGCOMM, August 2012 [pdf] Towards Traffic Benchmarks for Empirical Networking Research: The Role of Connection Structure in Traffic Workload Modeling Jay Aikat, Shaddi Hasan, Kevin Jeffay, and F. D. Smith. MASCOTS, August 2012 [pdf] Teaching Fall 2024: CS6204: Computing for Social Good Fall 2023: CS4254/5565: Network Architecture and Programming Spring 2023: CS5566: Network Architecture and Protocols II Fall 2022: CS4254/5565: Network Architecture and Programming Spring 2021: CS6204: Computing and Social Good Fall 2021: CS4254: Network Architecture and Programming Software My research group's software is on our GitHub. Software I've been involved with over the years includes: Broadband Data Kit: Tools to enable communities and ISPs to engage with the FCC's Broadband Data Collection Program. Magma (github): Open-source distributed LTE/5G core network and platform for building open and flexible access networks. Community Cellular Manager (github): Software we developed at Endaga and Facebook for running community cellular networks. Orangemesh: A web-based mesh network management tool. Maps of spectrum availability for the EBS Tribal Priority Filing Window. Contact [email protected] @shaddih 620 Drillfield Drive 1140 Torgersen Hall Blacksburg, VA 24061 KJ4VNL How to say my name My name is pronounced \"SHA-dee\" (IPA: /ʃædi/), which rhymes with \"daddy\" or \"caddy\". In particular, it does not rhyme with \"shoddy\", \"shady\", or \"shad-eye\". Last updated: Oct 2025. Cookies?",
  "content_length": 6877,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:09"
}