{
  "name": "Shafiq Joty",
  "homepage": "https://raihanjoty.github.io",
  "status": "success",
  "content": "Shafiq Joty Home Papers Research Teaching Students CV Shafiq Joty Senior Research Director Salesforce AI Research Office: 181 Lytton Ave, Palo Alto, CA 94301, United States Email Phone Google Scholar Associate Professor (On leave since Aug'22) NTU Natural Language Processing Group Office: Block N4, 02c-79 School of Computer Science and Engineering, NTU Email Phone Github Short Biography Senior Research Director, Salesforce AI Research Palo Alto, USA [Feb'25 - ] Associate Professor (tenured, on leave since Aug 2022), Nanyang Technological University (NTU), Singapore [Mar'22 - ] Research Director, Salesforce AI Research Palo Alto, USA [Sep'22 - Jan'25] Senior Research Manager (part time), Salesforce AI Research, Singapore [Feb'19 - Aug'22] Assistant Professor, Nanyang Technological University (NTU), Singapore [Jul'17 - Feb'22] Research Scientist, Qatar Computing Research Institute (QCRI), Doha [Jan'14 - Jul'17] PhD in Computer Science, University of British Columbia (UBC), Vancouver [Sep'08 - Feb'14] Research Interests Natural Language Processing Large Language Models (LLMs) Multi-lingual NLP (Machine Translation, Cross-lingual tasks) Multi-modal NLP (NLP+Code, NLP+Vision) Robust/adversarial NLP Machine Learning Deep Learning Reinforcement Learning News 10 Oct 25Released SFR-DeepResearch , LiveReserachBench , Hard2Verify , Variation in Verification 25 Feb 25 Ruochen Zhao and Chengwei Qin have recently graduated and joined Apple (Research Engineer) and HKUST (Asst. Prof), respectively. Congrats! 25 Feb 25Received a presidential award FY'25 from Salesforce (one of the 0.5% employees!) 20 Feb 25Released Process DPO from Pseudo Feedback , Fin-DAP 6 Oct 24Released SFR-RAG, SFR-Judge, GemFilter, FaithEval, and CRM Benchmarks 20 Apr 24Gave in-person invited talk at JHU CSLP. Thanks Kevin Duh, Jason Eisner and Philipp Koehn for inviting me. 3 Sep 23Gave a tutorial on LLM+Vis at EMNLP-23 and four keynotes on LLMs: (a) LLM-AI workshop @KDD-23, (b) KAUST Research Conference, (c) QCRI LLM Seminar, and (d) Taming LLMs workshop @SIGDIAL-23 (slides) 30 Jun 23Released XGen-7B LLM that supports 8K sequence length (Code, Blog). Good at both text and code, and specially on long sequence tasks.",
  "content_length": 2211,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:08"
}