{
  "name": "Shagufta Mehnaz",
  "homepage": "https://smehnaz.github.io",
  "status": "success",
  "content": "Shagufta Mehnaz Shagufta Mehnaz Assistant Professor @ Penn State CSE Home Research Publications Awards and Honors Teaching Contact Download CV Search for: © 2019 Shagufta Mehnaz Shagufta Mehnaz I am an Assistant Professor in the Department of Computer Science and Engineering at The Pennsylvania State University. My research interests are at the intersection of security, privacy, and machine learning. I received the NSF CAREER Award from the National Science Foundation (NSF) in 2025. I obtained my Ph.D. and MSc. in Computer Science from Purdue University, and BSc. in Computer Science and Engineering (CSE) from Bangladesh University of Engineering and Technology (BUET). Experience 2022-Present Assistant ProfessorComputer Science and Engineering, The Pennsylvania State University 2021-2022 Assistant ProfessorComputer Science, Dartmouth College 2014-2020 Research AssistantComputer Science, Purdue University Summer2017 Research Associate InternHewlett Packard Labs- Edge/IoT Summer2016 Research Associate InternHewlett Packard Labs- Data Analytics Summer2015 Graduate Technical InternIntel Corporation Education Ph.D. 2020 Ph.D. in Computer Science Purdue University MS 2016 Master of Computer Science Purdue University BSc 2013 Bachelor of Science (ranked 1st among 142 students) Bangladesh University of Engineering and technology (BUET). News July 2025 I have received the National Science Foundation (NSF) CAREER Award. Deeply grateful to NSF for this opportunity to contribute meaningfully to the field of ML privacy. National Science Foundation (NSF) CAREER Award June 2025 Organized a tutorial on 'Privacy and Security in Distributed Data Markets' at SIGMOD 2025 along with Daniel, Sainyam, Zeyu, and Eugene. Privacy and Security in Distributed Data Markets March 2025 Our paper titled 'GNNBleed: Inference Attacks to Unveil Private Edges in Graphs with Realistic Access to GNN Models' has been accepted to PETS 2025. Congratulations to Zeyu and the team! February 2025 Our paper titled 'Robust Unlearning for Large Language Models' has been accepted to PAKDD 2025. Congratulations to Kang and the team! January 2025 I have been invited to give a talk at the ICML 2025 Workshop on Machine Unlearning for Generative AI. ICML 2025 Workshop on Machine Unlearning for Generative AI December 2024 Our paper titled 'Disparate Privacy Vulnerability: Targeted Attribute Inference Attacks and Defenses' has been accepted to USENIX Security 2025. Congratulations to Ehsan and the team! December 2024 Our paper titled 'Forget to flourish: Leveraging machine-unlearning on pre-trained language models for privacy leakage' has been accepted to AAAI 2025. Congratulations to Md Rafi and the team! December 2024 Congratulations to Ehsan, Md Rafi, and Zeyu for passing the PhD comprehensive exam! May 2024 Congratulations Dr. Kang Gu on your graduation and best wishes for your next adventure! October 2023 Our paper titled 'FLShield: A Validation Based Federated Learning Framework to Defend Against Poisoning Attacks' has been accepted to IEEE S&P 2024. Congratulations to Ehsan, Zeyu, and Rafi! October 2023 Served on the panel 'AI for xG Security' at IEEE CNS 2023. August 2023 Our paper titled 'SecureImgStego: A Keyed Shuffling-based Deep Learning Model for Secure Image Steganography' has been accepted to IEEE CNS 2023. Congratulations to the team! February 2023 Our paper titled 'Towards Sentence Level Inference Attack Against Pre-trained Language Models' has been accepted to PETS 2023. Congratulations to Kang, Ehsan, Neha, and Soroush! 2023 Serving on the PC of ACM CCS, USENIX Security, PETS, and CODASPY in 2023 November 2022 Our paper titled 'Model Inversion Attack with Least Information and an In-depth Analysis of its Disparate Vulnerability' has been accepted to IEEE Conference on Secure and Trustworthy Machine Learning (SaTML 2023). Congratulations to Sayanton and Dae Lim! January 2022 Received Walter and Constance Burke Research Initiation Award ($30K). Many thanks to the sponsors! January 2022 Our paper titled 'Are Your Sensitive Attributes Private? Novel Model Inversion Attribute Inference Attacks on Classification Models' has been accepted to USENIX Security 2022. Congratulations to Sayanton and Ehsan! December 2021 Serving on the PC of ACM CCS 2022 May 2021 Serving on the PC of USENIX Security 2022 March 2021 Serving on the PC of PETS 2022 February 2021 Serving on the PC of ACSAC 2021 December 2020 Serving on the PC of ACM SACMAT 2021 October 2020 I have been invited to serve on the PC of The Web Conference 2021 August 2020 I have been invited to serve on the PC of CODASPY 2021 June 9, 2020 Defended my PhD thesis! May 6, 2020 Accepted a tenure-track faculty position in the Department of Computer Science at Dartmouth College starting from winter 2021 October 15, 2019 Paper accepted for inclusion in an upcoming issue of IEEE Transactions on Dependable and Secure Computing (TDSC) October 3, 2019 Presented a talk at the Award Winning Research Session, GHC 2019 October 2, 2019 Paper accepted for publication in the proceedings of 36th IEEE International Conference on Data Engineering (ICDE)",
  "content_length": 5137,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:09"
}