{
  "name": "Shahid Raza",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/shahidraza",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Shahid Raza Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffShahid RazaMr Ethan KellyZhen Tian Professor Shahid Raza Professor in Cybersecurity (School of Computing Science) telephone: 01413303810 email: Shahid.Raza@glasgow.ac.uk 18 Lilybank Gardens,, Glasgow,, Scotland, United Kingdom, G12 8RZ Import to contacts https://orcid.org/0000-0001-8192-0893 Biography [visit https://ShahidRaza.net for updated contents]Shahid Raza is a cybersecurity expert specializing in IoT Security and serves as the Chair Professor of Cybersecurity at the University of Glasgow, UK. He is involved in research, PhD and Postdoc supervision, and teaching. Previously, Prof. Shahid served as the Director of Cybersecurity Unit at RISE for eight (8) years and established the RISE Cybersecurity Unit as one of the largest technical cybersecurity groups in Sweden, conducting cutting-edge research on both fundamental and applied cybersecurity topics. He holds a Docentship (Uppsala University), a PhD, a Licentiate, and a Master’s degree, all in cybersecurity, from Sweden. He also holds a 4-year Bachelor's degree in computer science, where he graduated with a 3.99 CGPA and received a Gold Medal.He leads and participates in large-scale EU and Swedish research projects and coordination initiatives. Examples include Cybercampus Sweden (Co-founder and Research Director), H2020 CONCORDIA (participant and member of the management board), Swedish Cybersecurity Research and Innovation Node - Cyber Node (founder and project leader), H2020 Arcadian-IoT (technical project leader), and Horizon Europe CUSTODES (coordinator). Shahid is also the founder and project leader of the RISE Cyber Range, the largest cybersecurity test and demo facility in Sweden.He is an IEEE Senior Member and a member of numerous EU and Swedish cybersecurity groups and associations such as EU Stakeholder Cybersecurity Certification Group (SCCG); European Cyber Security Organisation (ECSO), the largest cybersecurity public-private partnership in EU; and EARTO Security & Defence Research working group. Shahid also reviews Swedish and International research funding proposals and scientific journal articles, acts as a TPC member in conferences, and examines PhD theses. Research interests https://shahidraza.net/publications.html PKI & network security for IoT Our research brings Public Key Infrastructure (PKI) to IoT, which includes lightweight digital certificates and their enrollment, renewal, and revocation. We have also developed lightweight network security protocols and intrusion detection for IoT. READ MORE AI/machine learning & IoT security Our research on Artificial Intelligence (AI)/Machine Learning (ML) and Cybersecurity covers both AI for better cybersecurity and security of AI/ML techniques. We focus on efficient and secure federated learning and its usage for better IoT security. READ MORE IoT assurance & re-certification With billions of IoT devices having heterogeneous capabilities, it is important to protect consumers by setting cybersecurity standards for IoT. Our research sets requirements and develops continuous cyber certification solutions for IoT. READ MORE Hardware & data security for IoT Working on security for low-power RISC-V devices; isolation of critical operations using TEE, sandboxing TEE operations, and strengthening TEE security; and IoT data privacy in public clouds using homomorphic encryption and confidential computing. READ MORE Research groupsGlasgow Systems Publications List by: Type | Date Jump to: 2024Number of items: 1.2024 Bjurling, Björn and Raza, Shahid ORCID: https://orcid.org/0000-0001-8192-0893 (2024) Cyber threat intelligence meets the analytic tradecraft. ACM Transactions on Privacy and Security, 28(1), 6. (doi: 10.1145/3701299) This list was generated on Mon Dec 1 02:50:39 2025 GMT. Jump to: ArticlesNumber of items: 1.Articles Bjurling, Björn and Raza, Shahid ORCID: https://orcid.org/0000-0001-8192-0893 (2024) Cyber threat intelligence meets the analytic tradecraft. ACM Transactions on Privacy and Security, 28(1), 6. (doi: 10.1145/3701299) This list was generated on Mon Dec 1 02:50:39 2025 GMT. Prior publications Article Urkhimbam Boby Clinton, Nazrul Hoque, Shahid Raza, Monowar Bhuyan (2025) Securing IoT: Unveiling Attacks with Multiview-Multitask Learning IEEE Transactions on Artificial Intelligence Shahid Raza. ISSN 2691-4581 (doi: 10.1109/tai.2025.3615565) Mazaher Kianpour, Shahid Raza (2024) More than malware: unmasking the hidden risk of cybersecurity regulations International Cybersecurity Law Review Crossref. (doi: 10.1365/s43439-024-00111-7) Mohammed Ramadan, Shahid Raza (2023) Secure Equality Test Technique Using Identity-Based Signcryption for Telemedicine Systems IEEE Internet of Things Journal Crossref. (doi: 10.1109/JIOT.2023.3269222) Han Wang, David Eklund, Alina Oprea, Shahid Raza (2023) FL4IoT: IoT Device Fingerprinting and Identification Using Federated Learning ACM Transactions on Internet of Things Crossref. (doi: 10.1145/3603257) Joel Höglund, Martin Furuhed, Shahid Raza (2023) Lightweight certificate revocation for low-power IoT with end-to-end security Journal of Information Security and Applications Crossref. (doi: 10.1016/j.jisa.2023.103424) Khurshid, A., Raza, S. (2023) AutoCert: Automated TOCTOU-secure digital certification for IoT with combined authentication and assurance Computers and Security Scopus - Elsevier. ISSN 01674048 (doi: 10.1016/j.cose.2022.102952) Anum Khurshid, Sileshi Demesie Yalew, Mudassar Aslam, Shahid Raza, Leonardo Mostarda (2022) TEE-Watchdog: Mitigating Unauthorized Activities within Trusted Execution Environments in ARM-Based Low-Power IoT Devices Security and Communication Networks Crossref. (doi: 10.1155/2022/8033799) Anum Khurshid, Reem Alsaaidi, Mudassar Aslam, Shahid Raza (2022) EU Cybersecurity Act and IoT Certification: Landscape, Perspective and a Proposed Template Scheme IEEE Access Crossref. (doi: 10.1109/ACCESS.2022.3225973) Hampus Lundberg, Nishat I Mowla, Sarder Fakhrul Abedin, Kyi Thar, Aamir Mahmood, Mikael Gidlund, Shahid Raza (2022) Experimental Analysis of Trustworthy In-Vehicle Intrusion Detection System Using eXplainable Artificial Intelligence (XAI) IEEE Access Crossref. (doi: 10.1109/ACCESS.2022.3208573) Khurshid, A., Yalew, S.D., Aslam, M., Raza, S. (2022) ShieLD: Shielding Cross-zone Communication within Limited-resourced IoT Devices running Vulnerable Software Stack IEEE Transactions on Dependable and Secure Computing Scopus - Elsevier. ISSN 19410018 15455971 (doi: 10.1109/TDSC.2022.3147262) Valaenthin Tratter, Mudassar Aslam, Shahid Raza, Qi-zhou Hu (2021) Shared Mobility for Transport and Its Environmental Impact VeSIPreS: A Vehicular Soft Integrity Preservation Scheme for Shared Mobility Journal of Advanced Transportation Crossref. (doi: 10.1155/2021/5569331) Mudassar Aslam, Simon Bouget, Shahid Raza (2021) Security and trust preserving inter‐ and intra‐cloud VM migrations International Journal of Network Management Crossref. (doi: 10.1002/nem.2103) Mudassar Aslam, Bushra Mohsin, Abdul Nasir, Shahid Raza (2020) FoNAC - An automated Fog Node Audit and Certification scheme Computers & Security Crossref. (doi: 10.1016/j.cose.2020.101759) Salvador Perez, Jose L. Hernandez-Ramos, Shahid Raza, Antonio Skarmeta (2020) Application Layer Key Establishment for End-to-End Security in IoT IEEE Internet of Things Journal Crossref. (doi: 10.1109/JIOT.2019.2959428) Joel Höglund, Samuel Lindemer, Martin Furuhed, Shahid Raza (2020) PKI4IoT: Towards public key infrastructure for the Internet of Things Computers & Security Crossref. (doi: 10.1016/j.cose.2019.101658) Tiloca, M., Dini, G., Rizki, K., Raza, S. (2020) Group rekeying based on member join history International Journal of Information Security Scopus - Elsevier. ISSN 16155270 16155262 (doi: 10.1007/s10207-019-00451-0) Shahid Raza, Runar Mar Magnusson (2019) TinyIKE: Lightweight IKEv2 for Internet of Things IEEE Internet of Things Journal Crossref. (doi: 10.1109/JIOT.2018.2862942) Rizki, K., Lamproudi, A., Tiloca, M., Raza, S. (2019) Group-IKEv2 for multicast IPsec in the internet of things International Journal of Security and Networks Scopus - Elsevier. ISSN 17478413 17478405 (doi: 10.1504/IJSN.2019.098908) Shahid Raza, Prasant Misra, Zhitao He, Thiemo Voigt (2017) Building the Internet of Things with bluetooth smart Ad Hoc Networks Crossref. (doi: 10.1016/j.adhoc.2016.08.012) Tiloca, M., Nikitin, K., Raza, S. (2017) Axiom: DTLS-based secure IoT group communication ACM Transactions on Embedded Computing Systems Scopus - Elsevier. ISSN 15583465 15399087 (doi: 10.1145/3047413) Raza, S., Helgason, T., Papadimitratos, P., Voigt, T. (2017) SecureSense: End-to-end secure communication architecture for the cloud-connected Internet of Things Future Generation Computer Systems Scopus - Elsevier. ISSN 0167739X (doi: 10.1016/j.future.2017.06.008) (2016) S3K: Scalable Security with Symmetric Keys - DTLS Key Establishment for the Internet of Things IEEE Transactions on Automation Science and Engineering Shahid Raza. (doi: 10.1109/TASE.2015.2511301) (2015) An experimental study of attacks on the availability of Glossy Computers & Electrical Engineering Shahid Raza. ISSN 00457906 (doi: 1",
  "content_length": 21359,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:13"
}