{
  "name": "Shahin Jabbari",
  "homepage": "https://shahin-jabbari.github.io",
  "status": "success",
  "content": "Shahin Jabbari - Personal Page Shahin Jabbari Office: 3675 Market St, Office 1151, Philadelphia, PA, 19104 Email: shahin@drexel.edu Phone: 215-895-2474 I am an assistant professor in the Computer Science Department of the College of Computing & Informatics at Drexel University where I am part of the EconCS group. Prior to Drexel, I was a CRCS postdoctoral fellow in the Computer Science Department of the School of Engineering and Applied Sciences at Harvard. I was lucky to be hosted by Milind Tambe and was also affiliated with the EconCS group. From 2013 to 2019, I was a PhD student in the Computer and Information Science Department at University of Pennsylvania where I was fortunate to be advised by Michael Kearns. I received my Master's degree from the Department of Computing Science at University of Alberta, where I had the pleasure of working with Robert Holte and Sandra Zilles. I did my undergraduate degree in Computer Engineering at Sharif University of Technology. Research Interests My main interests are in machine learning, game theory, and their intersection. These days, I mostly focus on the ethical aspects of algorithmic decision-making and think about how AI-driven technology can lead to positive societal impact. If you are interested in working on any of these topics with me, instead of contacting me directly, please apply to our PhD program and mention me in your application. Publications Unless specified otherwise, authors are listed in alphabetical order. Optimal Robust Recourse with Lp-Bounded Model Change P. Kyaw, K. Kayastha, SJ (contributional order) Preprint In Generative AI We (Dis)Trust? Computational Analysis of Trust and Distrust in Reddit Discussions A. Pessianzadeh, N. Sultana, H. Van den Bulck, D. Gefen, SJ, R. Rezapour (contributional order) Preprint Learning-Augmented Robust Algorithmic Recourse K. Kayastha, V. Gkatzelis, SJ (contributional order) Preliminary Version in ICML 2025 Workshop on Actionable Interpretability Preprint A Game-Theoretic Approach for Hierarchical Epidemic Control F. Jia, A. Mate, Z. Li, SJ, M. Chakraborty, M. Tambe, M. Wellman, and Y. Vorobeychik (contributional order) JAAMAS 2025 The Disagreement Problem in Explainable Machine Learning: A Practitioner's Perspective S. Krishna, T. Han, A. Gu, Z.S. Wu, SJ, and H. Lakkaraju (contributional order) TMLR 2024 The Evolving Meaning of Trust and Risk in Reddit Discourse about ChatGPT D. Gefen, SJ, R. Rezapour, A. Pessianzadeh, K. Kayastha, H. Van den Bulck (contributional order) AMCIS 2024 (ERF) Improving Fairness in Adaptive Social Exergames via Shapley Bandits R. Gray, J. Villareale, T. Fox, D. Dallal, S. Ontañón, D. Arigo, SJ, and J. Zhu (contributional order) IUI 2023 Human-Subject Experiments on Risk-Based Cyber Camouflage Games P. Aggarwal, SJ, O. Thakoor, E. Cranford, P. Vayanos, C. Lebiere, M. Tambe, and C. Gonzalez (contributional order) Book Title: Cyber Deception: Techniques, Strategies, and Human Aspects Book Chapter 2023 Solving Structured Hierarchical Games Using Differential Backward Induction Z. Li, F. Jia, A. Mate, SJ, M. Chakraborty, M. Tambe, and Y. Vorobeychik (contributional order) UAI 2022 (Oral Presentation) Combining Machine Learning and Cognitive Models for Adaptive Phishing Training E. Cranford, SJ, H-C. Ou, M. Tambe, C. Gonzalez, and C. Lebiere (contributional order) ICCM 2022 Designing Effective Masking Strategies for Cyberdefense through Human Experimentation and Cognitive Models P. Aggarwal, O. Thakoor, SJ, E. Cranford, C. Lebiere, M. Tambe, and C. Gonzalez (contributional order) Computers & Security 2022 Towards the Unification and Robustness of Perturbation and Gradient Based Explanations S. Aggarwal, SJ, C. Agarwal, S. Upadhyay, Z.S. Wu, and H. Lakkaraju (contributional order) ICML 2021 (Spotlight Presentation) Active Screening for Recurrent Diseases: A Reinforcement Learning Approach H-C. Ou, H. Chen, SJ, and M. Tambe (contributionalal order) AAMAS 2021 (Best Paper Finalist) Fair Influence Maximization: A Welfare Optimization Approach A. Rahmattalabi*, SJ*, H. Lakkaraju, P. Vayanos, M. Izenberg, R. Brown, E. Rice, and M. Tambe (contributionalal order, * equal contributional) AAAI 2021 Modeling Between-Population Variation in COVID-19 Dynamics in Hubei, Lombardy, and New York City B. Wilder, M. Charpignon, J. Killian, H-C. Ou, A. Mate, SJ, A. Perrault, A. Desai, M. Tambe, and M. Majumder (contributional order) PNAS 2020 Risk-based Cyber Camouflage Games and Exploiting Bounded Rationality O. Thakoor, SJ, P. Aggarwal, C. Gonzalez, M. Tambe, and P. Vayanos (contributional order) GameSec 2020 (Best Paper) Network Formation under Random Attack and Probabilistic Spread with Y. Chen, M. Kearns, S. Khanna, and J. Morgenstern IJCAI 2019 Equilibrium Characterization for Data Acquisition Games with J. Dong, H. Elzayn, M. Kearns, and Z. Schutzman IJCAI 2019 Fair Algorithms for Learning in Allocation Problems with H. Elzayn, C. Jung, M. Kearns, S. Neel, A. Roth, and Z. Schutzman ACM FAccT (formerly ACM FAT*) 2019 Fairness in Criminal Justice Risk Assessments: The State of the Art with R. Berk, H. Heidari, M. Kearns, and A. Roth Sociological Methods & Research 2018 A Convex Framework for Fair Regression with R. Berk, H. Heidari, M. Joseph, M. Kearns, J. Morgenstern, S. Neel, and A. Roth FATML 2017 Fairness in Reinforcement Learning with M. Joseph, M. Kearns, J. Morgenstern, and A. Roth ICML 2017 Learning from Rational Behavior: Predicting Solutions to Unknown Linear Programs with R. Rogers, A. Roth, and Z.S. Wu NIPS 2016 Strategic Network Formation with Attack and Immunization with S. Goyal, M. Kearns, S. Khanna, and J. Morgenstern WINE 2016 Online Assignment of Heterogeneous Tasks in Crowdsourcing Markets with S. Assadi, and J. Hsu HCOMP 2015 Adaptive Task Assignment for Crowdsourced Classification with C-J. Ho, and J.W. Vaughan ICML 2013 PAC-Learning with General Class Noise Models SJ, R. Holte, and S. Zilles (contributional order) KI 2012 (Best Paper) Teaching CS 465: Privacy & Trust Spring 2022, Spring 2024 CS 525: Theory of Computation Spring 2025 CS 589: Responsible Machine Learning Winter 2022, Winter 2024, Spring 2025 CS 590: Privacy Fall 2022, Spring 2023, Fall 2025 Drexel Computer Science Theory Reading Group Spring 2024 Students Graduate Students Kshitij Kayastha (PhD Student, 2023-Present) Ram Ravi (Master's Student, 2025-Present)Amira Bendjama (Master's Student, CO-OP, 2023) Undergraduate Students Phone Kyaw (CO-OP, 2025-Present)Joel Jins (CO-OP, 2025) Mihir Rao (CO-OP, 2023) Bumyeol Park (STARS Scholar, 2023)Vivek Khimani (Bachelor's Thesis, 2022-2023) High School Niru Vijayakrishnan (Conestoga High School, 2022-2023) Service Senior Program Committee/Area Chair ICML 2025, 2026 NeurIPS 2024, 2025 Action Editor TMLR 2024--now Junior Program Committee/Reviewer AAAI 2019, 2026 AIES 2023 AISTATS 2024 FAccT 2022 EC 2020, 2021, 2025 ICLR 2023, 2025 ICML 2020, 2021, 2022, 2023, 2024 NeurIPS 2014, 2015, 2018 (Top Reviewer!), 2019, 2020, 2021, 2022 (Top Reviewer!), 2023 UAI 2023 WINE 2021 External Reviewer AAAI 2025 EC 2018, 2019 NeurIPS 2013 SAGT 2017 SODA 2022 WINE 2019 Journal Reviewer AIJ 2020 PNAS Nexus 2022 TEAC 2021 TMLR 2022, 2023, 2024",
  "content_length": 7197,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:12"
}