{
  "name": "Shahab Asoodeh",
  "homepage": "https://www.cas.mcmaster.ca/~asoodehs",
  "status": "success",
  "content": "Shahab Asoodeh Shahab Asoodeh I am an Assistant Professor in the Department of Computing and Software at McMaster University, and a Faculty Affiliate at the Vector Institute. Prior to that, I was a postdoctoral fellow, first in the Knowledge Lab at the University of Chicago, and then in the School of Engineering and Applied Sciences at Harvard University. Even prior to that, I obtained my Ph.D. in Applied Mathematics from Queen’s University, where I also earned an M.Sc. in the same field. Long ago, and farther away, I received an M.Sc. in Electrical Engineering jointly from TU Delft and ETH Zürich. My main areas of research lie in information theory, statistics, and inference, with a focus on rigorous approaches to data privacy, algorithmic fairness, and trustworthy machine learning. One of my current interests involves developing principled privacy-preserving tools grounded in information-theoretic and statistical principles. Another concerns the intersection of synthetic data generation with rigorous fairness guarantees in decision-making systems. There is an open Ph.D. position in my lab on topics related to trustworthy machine learning (e.g., privacy, algorithmic fairness, interpretability). If you have strong background in math, probability and statistics, contact me with your CV and transcripts. Please note that, like many other faculty members, I receive large volume of emails, and as such, I cannot respond to all inquiries. 🗞️ Recent Announcements September 2025: I'll attend the 3-day memorial conference to honor Dr. Mario Díaz. We'll soon announce a journal's special issue to publish all his unpublished works. September 2025: Our work on locally private sampling is accepted to NeurIPS 2025. Congrats to Hrad! July 2025: I am now an associate editor of ACM Transactions on Probabilistic Machine Learning. Submit your awesome works! June 2025: I'll give a talk at RIKEN AIP and Institute of Science Tokyo (hosted by prof. Sakuma) May 2025: I'll be visiting Vincent Tan's lab at NUS for two weeks. May 2025: Our paper on optimal Rényi DP mechanisms got accepted to ICML 2025. May 2025: I'll attend AISTAT 2025 in Phuket, Thailand. January 2025: Our paper on private sampling with public data got accepted to AISTAT. Congrats to Behnoosh! January 2025: I'll give an invited talk in the workshop \"Machine Learning and Statistics: From Theory to Practice\", organized by the Chennai Mathematical Institute (CMI) in Chennai, India, and the Banff International Research Station for Mathematical Innovation and Discovery (BIRS). [Details] October 2024: One paper accepted to NeurIPS 2024. [Details] July 2024: I'll attend ISIT 2024 in Athens, Greece. June 2024: Our paper on the sample complexity of locally private hypothesis selection was selected for an oral presentation at TPDP 2024. Congrats to Alireza! May 2024: Three papers at TPDP 2024. Check out the program here. March 2024: We will organize the Information-Theoretic Methods for Trustworthy Machine Learning workshop at ISIT 2024, the first of its kind in ISIT history. Submit your great papers. February 2024: One paper at COLT 2024 with Alireza F. Pour and Hassan Ashtiani. If you're interested in the locally private hypothesis selection, check it out here. January 2024: Four papers at ISIT 2024. Here is one of them with a brilliant graduate student in my group, Hrad Ghoukasian. January 2024: We will organize the 2024 North American School of Information Theory from July 28th to August 2nd at the University of Ottawa. See the program and a great list of speakers here. December 2023: Our paper on the contraction properties of LDP mechanisms was published in IEEE Journal on Selected Areas in Information Theory (JSAIT). [ieee] [arXiv] August 2023: Four papers accepted to TPDP 2023. July 2023: I'll give a talk in a contributed session at the XVI Latin American Congress of Probability and Mathematical Statistics (CLAPEM), São Paulo, Brazil. June 2023: I'll attend ISIT 2023 in Taipei. May 2023: New paper posted to arXiv on the privacy analysis of hidden-state DP-SGD algorithm. May 2023: I will give a talk in the Information-Theoretic Methods for Trustworthy Machine Learning Workshop at Simons Institute. May 2023: New paper posted to arXiv on the cardinality bound of information bottleneck representations. April 2023: Our paper on the saddle-point accountant for differential privacy was accepted in ICML 2023. Here is my talk at Google on this work. April 2023: Four papers were accepted to ISIT 2023. October 2022: One paper accepted to NeurIPS 2022 (selected for Oral Presentation). In this work, we proposed an efficient algorithm for correcting bias in probabilistic classifiers. Check it out. October 2022: A new paper on local differential privacy posted to arXiv. here October 2022: Invited talk at Google on saddle-point accountant for differential privacy. [slides], [talk] September 2022: With Lele Wang (UBC), we organized a virtual reading group on \"Foundations of Differential Privacy\". More info. August 2022: Two papers on differential privacy posted to arXiv. [1] [2] July 2022: My recent work on fairness in multi-class prediction is posted to arXiv. here July 2022: Talk in the Workshop on Differential Privacy and Statistical Data Analysis at The Fields Institute. June 2022: Flavio Calmon, Mario Diaz, Haewon Jeong and I gave a tutorial at IEEE ISIT 2022: slides. June 2022: Talk at CWIT 2022 on \"Distribution Simulation Under Local Differential Privacy\". short version April 2022: I was awarded the NSERC Discovery Grant and Launch Supplement. August 2022: I started working with the Statistics & Privacy Team at Meta as an Academic Collaborator. Research Group Current Group Members and Research Advisees: Behnoosh Zamanlooy (Ph.D. since Fall 2022) Alireza Daeijavad (Ph.D. since Fall 2022) Guanhua (Tom) Zhao (M.Sc. since Fall 2025) Narges Rahimi Shahmirzadi (M.Eng. since Fall 2024) Past Group Members: Hrad Ghoukasian (M.Sc. graduated in Fall 2024) — Next stop: Ph.D. student at USC Alireza Fathollah Pour (Research Associate Feb–Aug 2023, co-supervised with Hassan Ashtiani) — Next stop: Ph.D. student at University of Waterloo Hyun-Young Park (Visiting Ph.D. student from KAIST, Winter 2023) Anish Das (Mitacs intern, Summer 2023) Nihal Azavedo (Undergrad, 2021–2022): Currently Ph.D. at NYU Publications Selected publications: H. Ghoukasian, B. Lee, and S. Asoodeh, “Locally optimal private sampling: Beyond the global minimax”, NeurIPS 2025. A. Gilani, J. F. Gomez, S. Asoodeh, F. Calmon, O. Kosut, and L. Sankar, “Optimizing noise distributions for differential privacy”, ICML 2025. B. Zamanlooy, M. Diaz and S. Asoodeh, “Locally private sampling with public data”, AISTATS 2025. H-Y. Park, S. Asoodeh, and S-H. Lee, “Exactly minimax-optimal locally differentially private sampling”, NeurIPS 2024. A. Fathollah Pour, H. Ashtiani, and S. Asoodeh, “Sample-optimal locally private hypothesis selection and the provable benefits of interactivity”, COLT 2024. W. Alghamdi, S. Asoodeh, F. Calmon, F. Gomez, O. Kosut, and L. Sankar, “The saddle-point accountant for differential privacy”, ICML 2023. W. Alghamdi, H. Hsu, H. Jeong, H. Wang, S. Asoodeh, and F. Calmon, “Beyond Adult and COMPAS: Fairness in multi-class prediction”, NeurIPS 2022. [Oral Presentation] An (almost) up-to-date list of publications can be found on Google Scholar. Teaching CAS 751 Information-Theoretic Methods in Trustworthy Machine Learning, Fall 2024, Fall 2025. COMPSCI 4ML3 Fundamentals of Machine Learning, Fall 2025. COMPSCI 3DP3 Data Privacy, Winter 2023, Winter 2024, Fall 2024, Fall 2025. COMPSCI 1JC3 Introduction to Computational Thinking, Fall 2024. COMPSCI 1DM3 Discrete Math for Computer Science, Winter 2023, Winter 2024. COMPSCI 3IS3 Information Security, Winter 2022. Contact Office: Information Technology Building, 1280 Main St W, Office 212, Hamilton, ON L8S 1C7 Email: asoodehs [@] mcmaster.ca",
  "content_length": 7924,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:11"
}