{
  "name": "Shalev Ben-David",
  "homepage": "https://cs.uwaterloo.ca/~s4bendav",
  "status": "success",
  "content": "Shalev Ben-David Search Shalev Ben-David Associate Professor of Computer Science Institute for Quantum Computing, University of Waterloo I am an Associate Professor at the David R. Cheriton School of Computer Science and the Institute for Quantum Computing at the University of Waterloo. My research interests include computational complexity and quantum computing. Interests Computational Complexity Quantum Computing Boolean Functions Education PhD in Electrical Engineering and Computer Science, 2017 Massachusetts Institute of Technology SM in Electrical Engineering and Computer Science, 2014 Massachusetts Institute of Technology BMath in Pure Mathematics and Combinatorics & Optimization, 2011 University of Waterloo Courses CS 341: Algorithms Course website for the Spring 2024 offering of CS 341. May 4, 2024 CS 867 / QIC 890: Quantum Query and Communication Complexity Course website for the Spring 2023 offering of CS 867 / QIC 890. May 8, 2023 See all Featured Publications A New Minimax Theorem for Randomized Algorithms The celebrated minimax principle of Yao (1977) says that for any Boolean-valued function f with finite domain, there is a distribution … Shalev Ben-David, Eric Blais Cite DOI Separations in Query Complexity Using Cheat Sheets We show a power 2.5 separation between bounded-error randomized and quantum query complexity for a total Boolean function, refuting the … Scott Aaronson, Shalev Ben-David, Robin Kothari Cite DOI Recent Work Quickly discover relevant content by filtering publications. Shalev Ben-David, Srijita Kundu (2024). Oracle separation of QMA and QCMA with bounded adaptivity. Proceedings of the 51st International Colloquium on Automata, Languages, and Programming (ICALP). Cite DOI Shalev Ben-David, Or Sattath (2023). Quantum Tokens for Digital Signatures. Quantum. Cite DOI Shalev Ben-David, Eric Blais, Mika Göös, Gilbert Maystre (2022). Randomised Composition and Small-Bias Minimax. Proceedings of the 63nd Annual IEEE Symposium on Foundations of Computer Science (FOCS). Cite DOI Kaspars Balodis, Shalev Ben-David, Mika Göös, Siddhartha Jain, Robin Kothari (2021). Unambiguous DNFs and Alon-Saks-Seymour. Proceedings of the 62nd Annual IEEE Symposium on Foundations of Computer Science (FOCS). Cite DOI Anurag Anshu, Shalev Ben-David, Srijita Kundu (2021). On Query-to-Communication Lifting for Adversary Bounds. Proceedings of the 36th Computational Complexity Conference (CCC). Cite DOI See all publications Grad Students Avantika Agarwal PhD student Bandar Al-Dhalaan MMath student Mohammad Hossein Ebtehaj PhD student Zhiying Yu MMath student Postdocs Srijita Kundu Postdoctoral Researcher Contact shalev.b@uwaterloo.ca Office: DC 3128 Cite × Copy Download",
  "content_length": 2718,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:18"
}