{
  "name": "Shamik Sengupta",
  "homepage": "https://www.cse.unr.edu/~shamik",
  "status": "success",
  "content": "Shamik Sengupta | University of Nevada, Reno Shamik Sengupta Menu © Shamik Sengupta All Rights Reserved. Go to the top Shamik Sengupta Ralph E. & Rose A. Hoeper Professor Executive Director UNR Cybersecurity Center IEEE Senior Member Professor Computer Science & Engineering Ph.D., University of Central Florida, 2007 B.E., Jadavpur University, 2002 Download CV Download PhD thesis Latest Updates Prospective Students... Postdoc/Graduate students/undergraduate students with a high motivation for research and a strong mathematical background and/or a strong systems development background are always welcome to apply. Prospective Students? Contact Here Quick Links... University of Nevada, Reno Cybersecurity Center Nevada Cyber Club Cybersecurity Center in the News Cybersecurity Programs at UNR (Undergrad & Grad) UNR Annual Cybersecurity Conference Latest updates at a glance... June 2020: UNR designated as a Center of Academic Excellence in Cyber Defense Education (CAE-CD). Spring 2020: Raj Shukla is the recipient of \"Outstanding Graduate Student Researcher Award 2020\" from UNR Graduate Student Association (GSA). Congratulations! Spring 2020: PhD Student Raj Shukla successfully defended his PhD Thesis. Congratulations! Spring 2020: PhD Student Amar Patra successfully defended his PhD Thesis. Congratulations! Spring 2020: MS Student Tapadhir Das successfully defended his MS Thesis. Congratulations! Spring 2020: MS Student Ankita Thakkar successfully defended her MS Thesis. Congratulations! Spring 2020: MS Student Anuraag Kotra successfully defended his MS Thesis. Congratulations! March, 2020: University of Nevada, Reno Hosts Second Cybersecurity Conference... Read more about this More News... The following articles have recently been accepted for publications: N. Bhusal, M. Gautam, R. Shukla, M. Benidris, and S. Sengupta, \"Coordinated Data Falsification Attack Detection in Distributed Generation Domain Using Deep learning\", Elsevier International Journal of Electrical Power & Energy Systems, 2021. S. Kudva, S. Badsha, J. La and S. Sengupta, \"A Scalable Blockchain based Trust Management in VANET Routing Protocol\", Elsevier Journal of Parallel and Distributed Computing, 2021. A. Walker, T. Das, R. Shukla and S. Sengupta, \"Friend or Foe: Discerning Benign vs Malicious Software and Malware Family\", IEEE GLOBECOM, 2021. I. Vakilinia, and S. Sengupta, \"Vulnerability market as a public good auction with privacy preservation\", Elsevier Computers and Security Journal, 2020. R. Shukla, and S. Sengupta, \"Scalable and Robust Outlier Detector using Hierarchical Clustering and Long Short-Term Memory (LSTM) Neural Network for Internet of Things\", Elsevier Internet of Things: Engineering Cyber Physical Human Systems, 2020. R. Shukla, and S. Sengupta, \"An integrated Communication, Optimization, and Prediction unit for smart Plug-in Electric Vehicle Charging\", Elsevier Internet of Things: Engineering Cyber Physical Human Systems, 2020. I. Vakilinia, and S. Sengupta, \"Fair and Private Rewarding in a Coalitional Game of Cybersecurity Information Sharing\", IET Information Security. A. Patra, P. Regis,, and S. Sengupta, \"Distributed Allocation and Dynamic Reassignment of Channels in UAV Networks for Wireless Coverage\", Elsevier Pervasive and Mobile Computing. A. Patra, P. Regis,, and S. Sengupta, \"Dynamic Self-Reconfiguration of Unmanned Aerial Vehicles to Serve Overloaded Hotspot Cells\", Elsevier Computer and Electrical Engineering. S. Bhunia, M. Khan, M. Yuksel and S. Sengupta, \"In-Band LOS Discovery Using Highly Directional Transceivers\", Elsevier Ad Hoc Networks Journal. I. Vakilinia, and S. Sengupta, \"A Coalitional Cyber-Insurance Framework for a Common Platform\", IEEE Transactions on Information Forensics and Security (IEEE TIFS) S. Bhunia, E. Miles, S. Sengupta, and F. Vazquez-Abad, \"CR-Honeynet: A Cognitive Radio Learning and Decoy Based Sustenance Mechanism to Avoid Intelligent Jammer\", IEEE Transactions on Cognitive Communications and Networking (IEEE TCCN). S Bhunia, P A Regis and S. Sengupta, \"Distributed Adaptive Beam Nulling to Survive Against Jamming in 3D UAV Mesh Networks\", Elsevier Computer Networks, 2018. More Publications... Research Grants Ongoing NSF Research Grants National Science Foundation: CyberCorps Scholarship for Service: Preparing an Interdisciplinary Next-Gen Cybersecurity Workforce ($3,305,867, Feb. 2022 - Jan. 2027, PI: Sengupta). award abstract National Science Foundation: CC*: Integration-Large: Robust and Predictable Network Infrastructure for Wide-Area Hybrid Sensor Networks ($998,568, 2020 - 2022, Co-PI: Sengupta) award abstract National Science Foundation: RET Site: Research Experiences in Cybersecurity for Nevada Teachers (RECNT) ($599,307, Feb. 2019 - Jan. 2023, PI: Sengupta) award abstract National Science Foundation: A Novel AI-Human Teaming Approach to Trust and Cooperation in AI-Cybersecurity Education ($298,620, July 2021 - June 2023, Co-PI: Sengupta) award abstract Ongoing Other Research Grants @ UNR UNR Grant, \"Developing the Next Generation Cybersecurity Workforce at UNR through a Full Spectrum Cybersecurity Zone: Senior Information Security Engineer Position\", ($113,900/yr for 2 years, July 2020 - June 2022, PI: Sengupta). Past Research Grants @ UNR National Science Foundation: CAREER: Survivability and Self-coexistence in the Battle of Cognitive Radio Network Societies ($400K, Mar. 2012 - Feb. 2018, PI: Sengupta). award abstract award abstract National Science Foundation: CyberCorps(R): \"Collaborative Research: Capacity building in Cybersecurity-literacy: An inter-disciplinary approach ($300,000, Sep. 2015- Aug. 2018; (Collaboration between UNR and TMCC; UNR: $262,534; TMCC: $37,466); PI: Sengupta). award abstract National Science Foundation: SATC: Establishing market based mechanisms for CYBer security information EXchange (CYBEX) ($351,578, Sep. 2015- Aug. 2019, PI: Sengupta). award abstract National Science Foundation: RET Site: Cyber Security Initiative for Nevada Teachers (CSINT) ($540,000, Sep. 2015- Aug. 2019, PI: Sengupta). award abstract National Science Foundation: Longitudinal Injection of Interdisciplinary Cybersecurity Awareness into Engineering Curricula ($300,000, Sep. 2017- Aug. 2020, PI: Sengupta). award abstract National Science Foundation: CICI: CE: Implementing CYBEX-P: Helping Organizations to Share with Privacy Preservation ($1,018,067, Jan. 2018- July. 2021, PI: Sengupta). award abstract National Science Foundation: REU Site: Collaborative Human-Robot Interaction ($360,000, Feb. 2018- Jan. 2022, Co-PI: Sengupta). award abstract National Science Foundation: PFI:BIC: Enhanced Situational Awareness Using Unmanned Autonomous Systems for Disaster Remediation ($800K, Aug. 2014- Jul. 2018, Senior Personnel: Sengupta) award abstract Nokia Grant, \"Prototype Implementation of IoT Networks - LTE and WAN Coexistence in Unlicensed Band\", ($25,000, PI: Sengupta) UNR Grant, \"Developing the Next Generation Cybersecurity Workforce at UNR through a Full Spectrum Cybersecurity Zone: Senior Information Security Engineer Position\", ($118,800/yr for 3 years, July 2017 - June 2020, Co-PI: Sengupta) UNR Grant, \"Developing Classroom Infrastructure for Cybersecurity Education\", ($21,200, Jan. 2017 - June 2017, PI: Sengupta) UNR Grant, \"Cybersecurity Operational Environment Development for Teaching and Training UNR Students\", ($50,000, July 2016 - June 2017, PI: Sengupta) UNR Research Enhancement Grant (REG) Award, University of Nevada, Reno, $21,530, Jul 2015 - June 2016. USAF, AFMC Air Force Research Laboratory, SUNY IT Visiting Scholar Program: Insuring and Incentivizing Cyber Security Information Sharing, $17,391, 2014 Acquisition of Instructional and Research Equipment (AIRE) Award, Sandbox - A cyber security instructional infrastructure, University of Nevada, Reno, $70,000, 2014. Start-up research grant, University of Nevada, Reno, 2013-2016 Past Research Grants @ CUNY PSC-CUNY Research Award Grant (July 2011 - Dec 2012) National Institute of Justice (NIJ) Department of Justice Research Subaward - \"Cognitive Radio Protocols and Platform for Dynamic Spectrum Access in Public Safety Bands\", 2010 - 2011. (Prime Recipient: Stevens Institute of Technology). PSC-CUNY Research Award Grant (July 2010 - Dec 2011). NY GRTI (Graduate Research and Technology Initiative) Equipment Grant, (2009-2010 Funding Round). Start-up equipment grant, John Jay College of Criminal Justice. Research Interests Wireless Networking & Mobile Computing Unmanned Autonomous Systems, Cognitive radio, Dynamic spectrum access (DSA), D2D communications, Interoperable networks, Testbed implementation, Network design and performance analysis, Cross-layer protocol optimization, Wireless mobile mesh, sensor networks; Cybersecurity Cryptography, Security & Privacy in Cybersecurity information exchange, Game Theory in Cybersecurity, Machine Learning in Cybersecurity, Network security, Covert communications, Malicious node sensing/detection, Anomaly detection, Honeypot, Spectrum fingerprinting, Anti-jamming mechanism design, UAV security; Inter-disciplinary Research Applied game theory, Evolutionary Game Theory, Economic theory, Probability, Stochastic process, Anthropology & human-society inspired evolutionary models, Behavioral dynamics; Publications 2022 || 2021 || 2020 || 2019 || 2018 || 2017 || 2016 || 2015 || 2014 || 2013 || 2012 || 2011 || 2010 || 2009 || 2008 || 2007 and older DBLP: Bibliography || Google Scholar Profile Need Paper? Request Here 2022 C116. Mackenzie Zappe, Ben Lupton, Jay Thom, Shamik Sengupta, Dave Feil-Seifer, \"Vulnerability Analysis and Prevention in a Smart City\", (Accepted). IEEE CCWC 2022. (BEST PAPER AWARD) C115. Jay Thom, Nathan Thom, Shamik Sengupta, Emily Hand, \"Smart Recon: Network Traffic Fingerprinting for IoT Device Identification\", (Accepted). IEEE CCWC 2022. (BEST PRESENTER AWARD) C114. Aaron Walker, Raj Shukla, Tapadhir Das and Shamik Sengupta, \"Ohana Means Family: Malware Family Classifi",
  "content_length": 75655,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:19"
}