{
  "name": "Shangqing Zhao",
  "homepage": "https://cs.ou.edu/~shangqing",
  "status": "success",
  "content": "Shangqing Zhao's homepage @ University of Oklahoma University of Oklahoma Homepage Research Publications Shangqing Zhao Ph.D., Assistant Professor School of Computer Science University of Oklahoma Norman Campus: 110 W. Boyd St., DEH 210D, Norman, OK 73019 Tulsa Campus: 4502 E 41st St, 4303, Tulsa, OK 74135 Email: shangqing@ou.edu | Phone: (918) 660-3292 Multiple Ph.D. openings are available in our group. Self-motivated students who have strong interests in mobile system design, network security, wireless security, IoT design, machine learning, are always welcome to join us. Short Bio Shangqing Zhao is an Assistant Professor in School of Computer Science, University of Oklahoma. He received his Ph.D. degree under Dr. Zhuo Lu at University of South Florida in 2021. Shangqing Zhao's research primarily focuses on the network and mobile system design and security. His research results have been published in top-tier conferences and journals. He also served as a reviewer for multiple top academic journals and conferences. News [Dec 2024] Our paper on RFID attack has been accepcted by INFOCOM 2025 [Apr 2024] Our proposal on Capsule Forensics has been funded by OU DISC. Thanks DISC! [Dec 2023] Our paper on defending adversary machine learning on spectrum attack has been accepcted by INFOCOM 2024 [Oct 2023] Our proposal on adversal driven physical layer security has been funded by NSF SaTC. Thanks to NSF! [Aug 2023] Our education proposal on AI related 5G security has been funded by NSF. Thanks to NSF! [Aug 2023] Our paper on the efficient attacks of physical layer authentication has been accepted by IEEE S&P 2024. [July 2023] Our paper on adaptive mmWave AP design won IEEE ICCCN 2023 Best Paper Award. Research Interests Novel data-driven mobile/IoT system design Mobile and network security Machine learning for mobile network and security applications LLM in Mobile Systems and Security Publications Full Conference Papers: Xinyu Cao, Bimal Adhikari, Shangqing Zhao, Jingxian Wu, Yanjun Pan, \"'An Adversarial-Driven Experimental Study on Deep Learning for RF Fingerprinting,\" in Proc. of IEEE Military Communications Conference ( MILCOM ), Accepted. (The first two authors are co-primary authors) Paper BibTex Guanchong Huang, Yan He, Shangqing Zhao, Yi Wu, Song Fang, \"MotionDecipher: General Video-assisted Passcode Inference In Virtual Reality,\" in Proc. of International Symposium on Research in Attacks, Intrusions and Defenses ( RAID ), Accepted. Yu Cai, Ziang He, Yanyan Luo, Jie Cao, Yuchen Liu, Zhengping Luo, Shangqing Zhao, \"Adversarial Attacks on Cooperative Spectrum Sensing: A LLM-powered Multi-Agent Approach,\" in Proc. of IEEE International Workshop on Signal Processing and Artificial Intelligence in Wireless Communications ( SPAWC ), Accepted. Haiyun Liu, Jiahao Xue, Shangqing Zhao, Yao Liu and Zhuo Lu, \"The Dual Role of Large Language Models in Network Security: Survey and Research Trends,\" in Proc. of ACM Workshop on Wireless Security and Machine Learning ( WiseML ), June 2025. Paper BibTex Jiaohao Xue, Xiao Han, Shangqing Zhao, Yao Liu, and Zhuo Lu, \"An Active Identification Overriding Attack against RFID: Attack Strategy and Defense Design,\" in Proc. of IEEE Conference on Computer Communications (INFOCOM), May 2025. Paper BibTex Hamidah Alanazi, Shengping Bi, Tao Wang, Tao Hou and Shangqing Zhao, \"Adaptive Feature Engineering Against Adversarial Learning,\" in Proc. of IEEE Secure Development Conference (Poster) (SecDev), Oct 2024. Xinyu Cao, Shangqing Zhao, Yanjun Pan, Yuchen Liu, \"Secure Parameter Sharing in Federated Learning via Over-the-Air Computing,\" in Proc. of IEEE Secure Development Conference (Poster) (SecDev), Oct 2024. Poster Zhengping Jay Luo, Tyler Stewart, Mourya Narasareddygari, Rui Duan, Shangqing Zhao, \"Quantum Machine Learning: Performance and Security Implications in Real-World Applications,\" in Proc. of IEEE Secure Development Conference (Poster) (SecDev), Oct 2024. Paper BibTex Wenwei Zhao, Xiaowen Li, Shangqing Zhao, Jie Xu, Yao Liu, and Zhuo Lu, \"Detecting Adversarial Spectrum Attacks via Distance to Decision Boundary Statistics,\" in Proc. of IEEE Conference on Computer Communications (INFOCOM), May 2024. Paper BibTex Jinmiao Chen, Zhengping Luo, Yuchen Liu, and Shangqing Zhao \"MMP: A Dynamic Routing Protocol Design to Proactively Defend against Wireless Network Inference Attacks,\" in Proc. of ACM Workshop on Moving Target Defense (MTD), Nov. 2023. Paper BibTex Zhe Qu, Rui Duan, Xiao Han, Shanqing Zhao, Yao Liu, and Zhuo Lu, \"Guessing on Dominant Paths: Understanding the Limitation of Wireless Authentication Using Channel State Information,\" in Proc. of IEEE Symposium on Security and Privacy (S&P), May 2024. Paper BibTex Yuchen Liu, Mingzhe Chen, Donghuan Xu, Shangqing Zhao, \"E-App: Adaptive mmWave Access Point Planning with Environmental Awareness in Wireless LANs,\" in Proc. of IEEE International Conference on Computer Communications and Networks (ICCCN), July 2023. (Best Paper) Paper BibTex Jiahao Xue, Zhe Qu, Shangqing Zhao, Yao Liu, Zhuo Lu, \"Data-Driven Next-Generation Wireless Networking: Embracing AI for Performance and Security,\" in Proc. of IEEE International Conference on Computer Communications and Networks (ICCCN), July 2023. Paper BibTex Jinmiao Chen, Zhaohe Zhang, Shangqing Zhao, Song Fang, Thomas M. Peters, Evan L. Floyd, Changjie Cai, \"Short: A Data-Driven Respirator Fit Test Model via Human Speech Signal,\" in Proc. of IEEE Conference on Connected Health: Applications, Systems and Engineering Technologies (CHASE), June 2023. Paper BibTex Jinmiao Chen, Zhaohe Zhang, Shangqing Zhao, Song Fang, Thomas M. Peters, Evan L. Floyd, Changjie Cai, \"Noninvasive Respirator Fit Factor Inference by Semi-Supervised Learning,\" in Proc. of IEEE Conference on Connected Health: Applications, Systems and Engineering Technologies (Poster) (CHASE), June 2023. Paper BibTex Zhengping Luo, Will A. Pitera, Shangqing Zhao, Zhuo Lu, Yalin Sagduyu, \"How Can the Adversary Effectively Identify Cellular IoT Devices Using LSTM Networks?\" in Proc. of ACM Workshop on Wireless Security and Machine Learning (WiseML), May 2023. Paper BibTex Qiuye He, Edwin Yang, Song Fang, Shangqing Zhao, \"Honey Breath: An Ambush Tactic Against Wireless Breath Inference\" in Proc. of EAI Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (MobiQuitous), Nov 2022 (Best Paper). BibTex Rui Duan, Zhe Qu, Shanqing Zhao, Leah Ding, Yao Liu, and Zhuo Lu, \"Perception-Aware Attack: Creating Adversarial Music via Reverse-Engineering Human Perception,\" in Proc. of ACM Conference on Computer and Communications Security (CCS), Nov 2022. Paper BibTex Chengbin Hu, Yao Liu, Zhuo Lu, Shangqing Zhao, Xiao Han and Junjie Xiong, \"Smartphone Location Spoofing Attack in Wireless Networks,\" in Proc. of EAI International Conference on Security and Privacy in Communication Networks (SecureComm), Sept, 2021. Paper BibTex Zhengping Luo, Shangqing Zhao, Rui Duan, Zhuo Lu, Yalin E. Sagduyu, and Jie Xu, \"Low-cost Influence-Limiting Defense against Adversarial Machine Learning Attacks in Cooperative Spectrum Sensing,\" in Proc. of ACM Workshop on Wireless Security and Machine Learning (WiSec-WiseML), July, 2021. Paper BibTex Zhengping Luo, Shangqing Zhao, Zhuo Lu, Yalin E. Sagduyu, and Jie Xu, \"Adversarial Machine Learning based Partial-model Attack in IoT,\" in Proc. of ACM Workshop on Wireless Security and Machine Learning (WiSec-WiseML), July. 2020. Paper Slide BibTex Shangqing Zhao, Zhe Qu, Zhengping Luo, Zhuo Lu, Yao Liu \"Comb Decoding towards Collision-Free WiFi,\" in Proc. of USENIX Symposium on Networked Systems Design and Implementation (NSDI), Feb. 2020. (Acceptance Rate: 17.45%) Paper Slide BibTex Shangqing Zhao, Zhe Qu, Zhuo Lu, Cliff Wang \"Vulnerability Analysis, Attack Strategies and Countermeasures Design in Network Tomography,\" in Proc. of Annual Computer Security Applications Conference (ACSAC) (Poster), Dec. 2019. Paper Poster BibTex Shangqing Zhao, Zhe Qu, Zhuo Lu, Tao Wang \"Spectrum Tomography Attacks: Inferring Spectrum Allocation Mechanisms in Multicarrier Systems,\" in Proc. of IEEE International Symposium on Dynamic Spectrum Access Networks (DySPAN) (Poster), Nov. 2019. Paper Poster BibTex Shangqing Zhao, Zhuo Lu, Zhengping Luo, Yao Liu, \"Orthogonality-Sabotaging Attacks against OFDMA-based Wireless Networks,\" in Proc. of IEEE Conference on Computer Communications (INFOCOM), Apr. 2019. (Acceptance Rate: 19.7%) Paper Slide BibTex Song Fang, Tao Wang, Yao Liu, Shangqing Zhao, Zhuo Lu, \"Entrapment for Wireless Eavesdroppers,\" in Proc. of IEEE Conference on Computer Communications (INFOCOM), Apr. 2019. (Acceptance Rate: 19.7%) Paper Slide BibTex Song Fang, Ian Markwood, Yao Liu, Shangqing Zhao, Zhuo Lu, and Haojin Zhu, \"No Training Hurdles: Fast Training-Agnostic Attacks to Infer Your Typing,\" in Proc. of ACM Conference on Computer and Communications Security (CCS), Oct. 2018. (Acceptance Rate: 16.6%) Paper BibTex Shangqing Zhao, Zhengpin Luo, Zhuo Lu, Xiang Lu, and Yao Liu, \"Stateful inter-packet signal processing for wireless networking,\" in Proc. of ACM Conference on Mobile Computing and Networking (MobiCom), Oct. 2017 . (Acceptance Rate: 18.83%) Paper Slide BibTex Shangqing Zhao, Zhuo Lu and Cliff Wang, \"When seeing isn't believing: on feasibility and detectability of scapegoating in network tomography,\" in Proc. of IEEE International Conference on Distributed Computing Systems (ICDCS), Jun. 2017. (Acceptance Rate: 16.9%) Paper Slide BibTex Full Journal Papers: Rui Duan, Zhe Qu, Shangqing Zhao, Leah Ding, Yao Liu, Zhuo Lu \"Perception-Aware Attack Against Music Copyright Detection: Impacts and Defenses,\" IEEE Transactions on Dependable and Secure Computing, Early Access. Qiuye He, Edwin Yang, Song Fang, Shangqing Zhao \"Revisiting Wireless Breath and Crowd Inference Attacks With Defensive Deception,\" IEEE Transactions on Networking, vol. 32, pp. 4976 - 4988, Sep. 2024. Dong Han, Reza Babaei, Shangqing Zhao, Samuel",
  "content_length": 13848,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:25"
}