{
  "name": "Shan Lin 0001",
  "homepage": "http://www.ece.sunysb.edu/~slin",
  "status": "success",
  "content": "Shan Lin Welcome to Shan Lin's Group! \"I find that the harder I work, the more luck I seem to have.\"  - Thomas Jefferson Home People Research Publications Resources Related Projects Outreach Teaching Shan Lin Associate Professor Department of Electrical and Computer Engineering Affiliated to Department of Computer Science College of Engineering and Applied Sciences Stony Brook University Phone: (631) 632-8398 Email: shan dot x dot lin AT stonybrook dot edu Office: 249 Light Engineering I am looking for self-motivated PhD students with a CS/Control/EE background! RA positions are available! Biographical Sketch I joined Stony Brook University as an assistant professor in Aug 2014. I received my PhD in computer science working under the direction of Professor John A. Stankovic at the University of Virginia. My PhD dissertation is on Taming Networking Challenges with Feedback Control. Here is my CV. My research is in the area of networked systems, with an emphasis on feedback control based design for cyber physical systems and sensor systems. I work on wireless network protocols, interoperable medical devices, smart transportation systems, and intelligent sensing systems. I am broadly interested in computer networks, distributed computing, networked information systems, sensor systems, and robotics. Active Grants NSF CAREER: Safe and Secure Network Control for Smart and Connected Hospitals NSF SCC Socially Informed Services Conflict Governance through Specification, Detection, Resolution, and Prevention OVPR Grant: A Smart Artificial Pancreas for Patients with Diabetes Other Recent Grants DOE EERE: Human-in-the-loop Sensing and Control for Commercial Building Energy Efficiency and Occupant Comfort NSF CAREER: Safe and Secure Network Control for Smart and Connected Hospitals NSF CPS: Multiple-level Predictive Control of Mobile Cyber Physical Systems with Correlated Context NSF NeTS: Non-isotropic Networked Sensor Deployment for Smart Buildings NSF SHB: Heterogeneous Large-Scale Telemedicine for Cardiology Patients News and Events March 2025 Our paper SHADE-AD: An LLM-Based Framework for Synthesizing Activity Data of Alzheimer’s Patients is accepted to SenSys 2025. March 2025 Our paper mAP: Abandoned Properties Detection using Multifaceted Urban Service Data is accepted to ICDE 2025. March 2025 Shan Lin is recognized as a Distinguished TPC Member for INFOCOM 2024 and 2025. June 2024 Shan Lin completes the training program of NIH mHealth Institute at UCLA. June 2023 Hongkai Chen will join IE department at the Chinese University of Hong Kang as a research assistant professor. June 2022 Our paper An STL-based Formulation of Resilience in Cyber-Physical Systems has won the Best Paper Award at the FORMATS 2022. [Slides] June 2022 Yukun Yuan will join CS department at the University of Tennessee Chattanooga as a tenure track assistant professor. May 21, 2021 Our paper DeResolver: A Decentralized Negotiation and Conflict Resolution Framework for Smart City Services has won the Best Paper Award at the ACM/IEEE ICCPS 2021. [Presentation] Sep 21, 2020 Our paper MET: A Novel Magneto-Inductive Sensing Based Electric Toothbrushing Monitoring System was presented at ACM MobiCom 2020. [Slides] June 2020 Hua Huang graduated and joined EECS at the University of California Merced as a tenure track assistant professor. Jan, 2020 Kin Sum Liu graduated and joined Twitter at San Francisco as a machine learning researcher. Novermber 15, 2016 Hua Huang presented our paper MagTrack: Enabling Safe Driving Monitoring with Wearable Magnetics at MobiSys 2019. [Slides] Sep 1, 2018 Nicola Paoletti joined Royal Holloway University of London, UK as a tenure track assistant professor. June 10, 2017 Shan Lin gave a talk Tooth Brushing Monitoring using Wrist Watch at USTC at Suzhou. May 25, 2017 Shan Lin gave a talk Model Predictive Control for Smart Transportation Systems at TsingHua University. Novermber 15, 2016 Hua Huang presented our paper Tooth Brushing Monitoring using Wrist Watch at SenSys 2016. [Slides] July 20, 2016 Shan Lin gave a talk on Smart Transportation Systems in the Vienna University of Technology at Vienna, Austria. July 8, 2016 Shan Lin gave a talk on Smart Transportation Systems in the Delft University of Technology at Amsterdam, Netherlands. Recent Papers H. Fu, H. Chen, S. Lin, G. Xing. SHADE-AD: An LLM-Based Framework for Synthesizing Activity Data of Alzheimer's Patients. In the 23rd ACM Conference on Embedded Networked Sensor Systems (SenSys 2025). L. Zhou, A. Edomwonyi, S. Lin. mAP: Abandoned Properties Detection using Multifaceted Urban Service Data. In the IEEE International Conference on Data Engineering (ICDE 2025). L. Zhou, Y. Zhao, Y. Yuan, C. Xu and S. Lin. eFlx: Provisioning of Energy Flexibility for E-taxi Fleet. The 16th ACM/IEEE International Conference on Cyber-Physical Systems (ICCPS 2025). K. Choksi, H. Chen, K. Joshi, S. Jade, S. Nirjon, S. Lin. SensEmo: Enabling affective learning through real-time emotion recognition with smartwatches. 2024 IEEE 21st International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2024). Y. Yuan, Z. Ding, S. Lin. Fairness-Aware Electric Taxi Fleet Coordination Under Short-Term Power System Failures. 2024 American Control Conference (ACC 2024). S. Munir, H. Chen, S. Fang, M. Monjur, S. Lin, S. Nirjon. CarFi: Rider Side Localization using Wi-Fi CSI. In 2023 IEEE 20th International Conference on Mobile Ad Hoc and Smart Systems (MASS 2023). H. Chen, S. A. Smolka, N. Paoletti, and S. Lin. An STL-based Approach to Resilient Control for Cyber-Physical Systems. In the 26th ACM International Conference on Hybrid Systems: Computation and Control (HSCC 2023). H. Chen, S. Lin, S. A. Smolka, and N. Paoletti. An STL-based Formulation of Resilience in Cyber-Physical Systems. In the 20th International Conference on Formal Modeling and Analysis of Timed Systems (FORMATS 2022). H. Chen, S. Munir, S. Lin. RFCam: Uncertainty-aware Fusion of Camera and Wi-Fi for Real-time Human Identification with Mobile Devices. In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) 2022. Y. Yuan, Y. Zhao, L. Chen, and S. Lin. Game Theoretic Analysis of Urban E-Taxi Systems: Equilibria and Efficiency. In IEEE International Conference on Sensing, Communication, and Networking (IEEE SECON), 2022. F. Z. Ali, H. Chen, G. Davis, C. DeLorenzo, S. Lin, Using Wearables for Assessing Circadian Rhythm Changes With Antidepressant Treatment, in 2022 New England Science Symposium, 2022. L. Chen, S. Lin, H. Huang and W. Yang. Charging Path Optimization in Mobile Networks. in IEEE/ACM Transactions on Networking 2022. Y. Yuan, Y. Zhao, and S. Lin. POET: Towards Power-System-Aware E-Taxi Coordination under Dynamic Passenger Mobility. In Thirteenth ACM International Conference on Future Energy Systems (ACM e-Energy) 2022. ​ Y. Yuan, Y. Zhao, and S. Lin. SOURCE: Towards Solar-Uncertainty-Aware E-Taxi Coordination under Dynamic Passenger Mobility. In American Control Conference (ACC) 2022. H. Chen, N. Paoletti, S. A. Smolka, and S. Lin. MPC-guided Imitation Learning of Neural Network Policies for the Artificial Pancreas. In 60th IEEE Conference on Decision and Control (CDC) 2021. Y. Yuan, Y. Zhao, and S. Lin. SAC: Solar-Aware E-Taxi Fleet Charging Coordination under Dynamic Passenger Mobility. In 60th IEEE Conference on Decision and Control (CDC) 2021. Y. Yuan, M. Ma, S. Han, D. Zhang, F. Miao, J. Stankovic, S. Lin. DeResolver: A Decentralized Negotiation and Conflict Resolution Framework for Smart City Services. Accepted to the ACM/IEEE 11th International Conference on Cyber-Physical Systems (ICCPS), 2021. L. Chen, A. Giovanidis, W. Wang, and S. Lin. Sequential Resource Access: Theory and Algorithm. Accepted to the IEEE International Conference on Computer Communications (INFOCOM), 2021. F. Qiao, and S. Lin. Data-driven prediction of fine-grained EV charging behaviors in public charging stations. Accepted to the ACM e-Energy 2021. H. Huang and S. Lin. MET: A Novel Magneto-Inductive Sensing Based Electric Toothbrushing Monitoring System. Accepted to the 26th ACM Annual International Conference on Mobile Computing and Networking (MobiCom), 2020. F. Shmarov et al., \"Automated Synthesis of Safe Digital Controllers for Sampled-Data Stochastic Nonlinear Systems,\" in IEEE Access, vol. 8, 2020. Y. Yuan, K. S. Liu, S. Munir, J. Francis, C. Shelton, and S. Lin. Leveraging Fine-Grained Occupancy Estimation Patterns for Effective HVAC Control, accepted to the ACM/IEEE Conference on Internet of Things Design and Implementation (IoTDI), 2020. H. Huang, C. Ni, J. Gao, X. Ban, A. Schnerider, S. Lin. Connected Wireless Camera Network Deployment with Visibility Coverage. In Proc. of the ACM Transactions on Internet of Things (TIOT), 2020. C. Kushan, S. Nagaraj, R. Thielke, and S. Lin. mDB: Monitoring Dysfunctional Behaviors for Patients with Bipolar Disorder. Accepted to the 42nd Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC'20). S. Munir, H. Yang, S. Lin, E. Hoque, S. M. Shahriar, C. Lin, J. Stankovic, K. Whitehouse. Reliable Communication and Latency Bound Generation in Wireless Cyber Physical System. In Proc. of the ACM Transactions on Cyber Physical Systems (TCPS), 2019. H. Huang, H. Chen, and S. Lin. MagTrack: Enabling Safe Driving Monitoring with Wearable Magnetics. In Proc. of the 17th ACM International Conference on Mobile Systems, Applications, and Services (MobiSys), 2019. Y. Yuan, D. Zhang, F. Miao, J. Chen, T. He and S. Lin. p^2Charging: Proactive Partial Charging for Electric Taxi Systems. In Proc. of the 39th IEEE International Conference on Distributed Computing Systems (ICDCS), 2019.",
  "content_length": 9736,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:22"
}