{
  "name": "Shanchieh Jay Yang",
  "homepage": "https://people.rit.edu/sjyeec",
  "status": "success",
  "content": "Home Page of Shanchieh Jay Yang Shanchieh Jay Yang Ph.D., ECE, University of Texas at Austin Professor, Department of Computer Engineering Director of Global Outreach, Global Cybersecurity Institute Co-director of NetIP Lab (GLE-3490) Rochester Institute of Technology 83 Lomb Memorial Drive, Bldg 09 Rochester, NY 14623-5603 Office: Bldg. 09, Room 3435 Tel: (585) 475-6434, Fax: (585) 475-4084 Email: Jay.Yang@rit.edu Overview Dr. S. Jay Yang received his Ph.D. degree in Electrical and Computer Engineering from the University of Texas at Austin. He is currently a Professor in the Department of Computer Engineering at Rochester Institute of Technology. He also serves as the Director of Global Outreach for Global Cybersecurity Institute and a Co-Director for the Networking and Information Processing (NetIP) Laboratory at RIT. Dr. Yang's research group has developed machine learning, attack modeling, and simulation systems to provide predictive analysis of cyber attacks, enabling anticipatory / proactive cyber defense. With current and past research projects supported by NSF, IARPA, DARPA, NSA, AFRL, ONR, and ARO, he and his research group has developed a number of machine learning, attack modeling, and simulation systems to enhance cyber defense. His earlier works include the use of Variable Length Markov Models and statistical graph models, and the development of Virtual Terrain, and Attack Social Graphs for predictive cyber situation awareness. This set of work has led to FuSIA, VTAC, ViSAw, F-VLMM, and attack obfuscation modeling. Most recently, his research group has developed three pioneering systems: 1) ASSERT to provide timely separation and extraction of unique attack behavior models, 2) CASCADES to simulate synthetic cyberattack scenarios that integrates data-driven and theoretically grounded understanding of adversary behaviors, and 3) CAPTURE to forecast cyberattacks before they happen using unconventional signals in the public domain. Dr. Yang has published more than sixty-five papers and mentored more than sixty graduate and undergraduate students for research. He has also established a number of international partnership programs and helped developed two PhD programs at RIT. He has served on organizing committees for several conferences and as a guest editor and a reviewer for a number of journals and textbooks. He was also invited as a keynote and panel speaker for several venues. He was a co-chair for IEEE Joint Communications and Aerospace Chapter in Rochester NY in 2005, when the chapter was recognized as an Outstanding Chapter of Region 1. Dr. Yang is dedicated to student experiential learning through classroom/laboratory teaching, research mentoring, and extracurricular engagements. He has established a number of international collaborative degree programs to provide students with global experiences. He has championed several industry sponsored design challenges where RIT students participate with faculty and alumni guidance. He is also an advocate for faculty mentoring and academic leadership development. He received Norman A. Miles Award for Academic Excellence in Teaching in 2007, and IEEE Region 1 Outstanding Teaching in an IEEE Area of Interest Award, for outstanding leadership and contributions to cybersecurity and computer engineering education in 2019. He is also one of the six NSF Trusted CI Open Science Fellow in 2019. Teaching Research Publications Students and Alumni Last Update: November 2019 by S. Jay Yang",
  "content_length": 3498,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:23"
}