{
  "name": "Shan Luo 0001",
  "homepage": "https://cgi.csc.liv.ac.uk/~shanluo",
  "status": "success",
  "content": "About Me - Shan Luo About Me | Shan Luo Shan LuoAn enthusiastic robotics researcher at King's College London Follow London, UK King's College London Email Twitter LinkedIn Google Scholar ORCIDI am currently a Reader in Robotics and AI at the Department of Engineering, King’s College London, where I lead the Robot Perception Lab (RPL). I am an enthusiastic and dedicated researcher doing research on robot perception with vision and tactile sensing, leveraging machine learning and computer vision algorithms with applications in robotics, e.g., robot perception, object recognition & localisation, and multimodal sensing fusion.I was a Lecturer (Assistant Professor) at the Department of Computer Science, the University of Liverpool, from 2018 to 2021, and was Director for the smARTLab at the Department. Prior to that, I was a Postdoctoral Research Fellow at Harvard University from 2017 to 2018, and at the University of Leeds from 2016 to 2017. I received the PhD degree in Robotics from King’s College London, in 2016. I was a Visiting Scientist at the Computer Science and Artificial Intelligence Laboratory (CSAIL), MIT, in 2016. I am a Fellow of the Higher Education Academy (FHEA).ContactEmail: shan.luo at kcl.ac.ukOpenings PhD studentships (home/international fees) available, contact me with a copy of your up-to-date CV if you are interested!PhD Opening: One King’s-China Scholarship Council PhD position is available, open to Chinese students. Deadline: 1st January 2026.Commonwealth PhD ScholarshipsFulbright Postgraduate Scholarship (for American students)Visiting Research StudentshipsPlease email me with a copy of your CV if you are interested in the above opportunities. Visit Opportunities for all the opportunities.NewsNovemeber 2025: I will serve as Area Chair for RSS 2026.October 2025: I was nominated for the Supervisory Excellence Award!October 2025: Our RoTiBot won the Best Paper Award at IROS 2025 Workshop on “Tactile Sensing Toward Robot Dexterity and Intelligence”, congratulations to Xuyang and Jiaqi!October 2025: Our RoTiBot won the Best Visual Paper Award at IROS 2025 Workshop on “Bio-Inspired Robotic Perception and Control: Bridging Centralized and Decentralized Intelligence”, congratulations to Xuyang and Jiaqi!October 2025: I will be an Open Source AI Fellow at The Alan Turing Institute.October 2025: Our paper titled “ViTacGen: Robotic Pushing with Vision-to-Touch Generation” has been accepted to IEEE Robotics and Automation Letters (RA-L), congratulations to Zhiyuan and the team!September 2025: Our paper titled “TransFace++: Rethinking the Face Recognition Paradigm with a Focus on Accuracy, Efficiency, and Security” has been accepted to IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI), congratulations to Yang and the team! paper linkAugust 2025: I was inteterview by CGTN Europe on “Rise of the robots: How they’re solving global issues” at the IET Savoy Place. YouTube interview video; News articleAugust 2025: Our paper titled “MultiClear: Multimodal Soft Exoskeleton Glove for Transparent Object Grasping Assistance” was awarded the Best Paper Award at TAROS 2025, congratulations to Chen, Letizia and Tim! paper linkJuly 2025: Our paper titled “Tactile Robotics: An Outlook” has been accepted to T-RO! paper linkJuly 2025: I will give a keynote talk “Tactile Intelligence in Robotics: Sensing and Interaction Across Scales” at the Trustworthy Embodied Intelligence in Healthcare Symposium at Imperial-X on 17th July 2025.July 2025: I will give a keynote talk “Tactile Sensing in a Multimodal Embodied Intelligence Era”, at EPSRC UK Robotics and Autonomous Systems (UK-RAS) Network ECR Webinar: Online Pitching Event – BioInspired Robotics, on 11th July 2025.June 2025: I will give a talk at the workshop on “Visual-tactile sensing for soft tissue examination” at the workshop on “Advanced tissue examination for diagnostics in surgical soft robotics” at Hamlyn Symposium 2025, come to join us! websiteJune 205: I will co-organise the workshop on “Flexible Electronics for Healthcare”, at Hamlyn Symposium 2025, come to join us! websiteMay 2025: I will serve as an Associate Editor for the IEEE Transactions on Robotics (T-RO) from July 2025.May 2025: The 3rd London Summer School in Robotics and AI will take place at King’s on 25th June, this year’s theme is “A Robot Touch of AI”, come to join us! registration siteApr 2025: Our RoTipBot is accepted to T-RO, congratultions to Jiaqi, Xuyang and the team! paper websiteApr 2025: One paper is accepted to R:SS 2025, congratulations to Stone, Hao and the team! paper websiteMar 2025: We have one EPSRC PhD Studentship in Robotics and AI available, funded by the EPSRC CDT in Advanced Engineering for Personalised Surgery & Intervention, send me a copy of your CV if you are interested in joining our lab! linkFeb 2025: One paper is accepted to CVPR 2025, congratultions to Kostas and the team! paperFeb 2025: We have one IDLA PhD Studentship available, funded by the EPSRC and Unilever, send me a copy of your CV if you are interested in joining our lab! link Closing date: 15 April 2025.Feb 2025: I have been invited to share my insights into accelerating sustainable manufacturing with robotics in the “Engineering Sustainability: Where to next?” Panel.Jan 2025: Our paper on cross-sensor force prediction has been accepted to ICRA 2025, congratulations to Zhuo and the team! paperDec 2024: Our 6th ViTac workshop has been accepted to ICRA 2025, see you in Atlanta!Dec 2024: Our paper on multi-modality tactile sensor has been accepted to T-RO Special Collection in Tactile Robotics, congratulations to Dandan and the team! paperNov 2024: Our Royal Society International Exchange Award has been granted.Sep 2024: Our paper on topology alignment for face recognition has been accepted to NeuRIPS 2024, congratulations to Yang and the team! paper code and modelsSep 2024: Welcome Tuan Nguyen from JAIST and Hengfei Zhao from Tsinghua University to start visiting our group!Sep 2024: Welcome Zhiyuan Wu, Yongqiang Zhao, Yupeng Wang to start their PhD at our group!Aug 2024: Our tactile sensing technologies have been shortlisted for the 2024 Robotics and Automation Awards!Aug 2024: Our paper on transiting between marker and markerless optical tactile sensing is accepted to RA-L, congratulations to Ni and Zhuo! [paper link] [website]July 2024: One paper is accepted to ECCV 2024, congratultions to Kostas!June 2024: Two papers are accepted to IROS 2024, congratulations to Zhuo, Jagoda and Jiaqi!June 2024: Welcome Yang Liu to start his PhD at our group!May 2024: Congratulations to Dr Kun Wang for securing the K. C. Wong Postdoctoral Fellowship! He will join us as a postdoctoral researcher.May 2024: I am elevated as an IEEE Senior Member.April 2024: Our paper on fast simulation of optical tactile sensors is accepted to RA-L, congratulations to Yongqiang, Kun and the team! [paper link] [website]March 2024: We have PhD stduentships (home/international fees) available, contact me with a copy of your up-to-date CV if you are interested!March 2024: Our paper on multimodal zero-shot learning for tactile texture recognition has been accepted to Robotics and Autonomous Systems, congratulations to Guan and the team! [paper link]March 2024: Our review on road surface defect detection has been accepted to IEEE Transactions on Intelligent Transportation Systems, congratulations to Jongmin and the team! [paper link]Feb 2024: I will give a talk at the 4th International Conference on Embodied Intelligence on 20th March, look forward to the discussions!Jan 2024: We have three papers accepted to ICRA 2024 (2 x ICRA, 1 x RA-L), congratulations to Jongmin, Zhonglin and Dandan, as well as all the co-authors, see you in Yokohama!Jan 2024: We will organise the 6th UK Robot Manipulation Workshop at King’s in 2024, look forwarding to having the workshop along the River Thames and stay tuned!Jan 2024: Our work on multimodal perception received the Best Workshop Poster at the 5th UK Robot Manipulation Workshop, congratulations to Jagoda and Jiaqi!Jan 2024: I will give a talk at the 5th UK Robot Manipulation Workshop, join us on 11th and 12th Jan 2024 in Oxford!Dec 2023: Our 5th ViTac workshop has been accepted to ICRA 2024, see you in Yokohama!Dec 2023: One A*STAR and King’s College London PhD Studentship (October 2024 Entry) is available. Applications are accepted from citizens of the UK, the EU, the USA, Canada, Latin America, and Australia.Oct 2023: Our review on robotic perception of transparent objects has been accepted to the IEEE Transactions on Artificial Intelligence, congratulations to Jiaqi and the team! [paper link]Oct 2023: I serve as an Associate Editor for ICRA 2024.Sep 2023: I am promoted to Reader, thanks to all the RPL group members, collaborators, colleagues and funders!Sep 2023: Our work on Inverse Image Frequecy to improve long-tailed recognition has been accepted to the IEEE Transactions on Image Processing, congratulations to Kostas and the team! [paper link]July 2023: Our work on GelFinger, the first multi-angle optical tactile sensor, has been accepted to RA-L, congratulations to Zhonglin and the team! [paper link]July 2023: Our BridgeAI project has been funded.July 2023: I will give a talk entitled “Empowering Robotic Manipulation: Bridging Sim-to-Real with Tactile Representations” at RSS 2023 Workshop Interdisciplinary Exploration of Generalizable Manipulation Policy Learning: Paradigms and Debates on 10th July.June 2023: Our work on tactile representation learning with masked autoencoders has been accepted to IROS 2023, congratulations to Guan and the team!June 2023: Our Robot Live Lab demo has been successully livestreamed on YouTube, check out this link for the recording of our demo!June 2023: I am honoured to receive the Early Career Award from the UK-RAS!May 2023: Our work on leveraging multi-modal sensing for robotic insertion tasks in R&D laboratories has been accepted to CASE 2023, congra",
  "content_length": 14366,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:20"
}