{
  "name": "Shangfei Wang",
  "homepage": "http://staff.ustc.edu.cn/~sfwang",
  "status": "success",
  "content": "Shangfei Wang's Homepage Toggle navigation Shangfei Wang's Homepage About Me Education Employment History Research Interests Professional Activities Projects Research Outputs Publications Book/Book Chapter Journal/Transaction Papers International Conference Papers About Me Shangfei Wang £¨ÍõÉÏ·É£© Ph. D, Professor Key Laboratory of Computing and Communication Software of Anhui Province (CCSL) School of Computer Science and Technology University of Science and Technology of China Hefei, Anhui, China, 230027 Phone: +86-551-3602824 (Lab) Email: sfwang@ustc. edu. cn My Google Scholar Citations My DBLP My Reasearch Group Education Doctor (2002), Department of Computer Science and Technology, USTC Master (1999), Department of Electronic Science and Technology, USTC Bachelor (1996), Department of Electronic Engineering, Anhui University Employment History Jul. 2018 ¨C present: Professor, School of Computer Science and Technology, USTC, China Sept. 2011 ¨C Sept. 2012: Visiting Scholar, Rensselaer Polytechnic Institute, USA Dec. 2005 ¨C 2018: Associate Professor, School of Computer Science and Technology, USTC, China Jul. 2004 ¨C Oct. 2005: Visiting Scholar, Kyushu University, Japan Feb. 2001 ¨C Nov. 2005: Lecturer, School of Computer Science and Technology, USTC, China Jun. 1999 ¨C Jan. 2001 Assistance Professor, School of Computer Science and Technology, USTC, China Research Interests Pattern Recognition Affective Computing Probabilistic Graphical Models Computation Intelligence Professional Activities Associate editor of IEEE Trans. on Affective Computing, 2019 ~ Associate editor of ACM Trans. on Multimedia Computing, Communications, and Applications, 2019 ~ Publicity Chair of the 8th?Humaine Association Conference on Affective Computing and Intelligent Interaction (ACII 2019), Cambridge, UK, 2019 Doctoral Consortium co-chair of 13th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2018), Xian, China, 2018 Workshop/Tutorial co-chair of the 12th IEEE International Conference on Automatic Face and Gesture Recognition (FG 2017), Washington DC, USA Doctoral Consortium co-chair of the 6th?Humaine Association Conference on Affective Computing and Intelligent Interaction (ACII 2015), Xian, China, 2015 Program co-chair of the 1st International Workshop on Multimedia Affective Computing£¬in conjunction with IEEE International Conference on Multimedia & Expo., Chendu, China, 2014. Program chair of the special session on Affective Human-Machine Interaction, the 12th International Conference on Intelligent Autonomous System, Jeju Island, Korea, 2012. Program co-chair of the special session on Interactive Evolutionary Computation and Affective Computing, The Second World Congress on Nature and Biologically Inspired Computing, Kitakyushu, Japan, 2010. Member of IEEE Member of ACM Portal member of HUMAINE Member of Artificial Emotion and Artificial Psychology of China Member of China Computer Federation Projects I am the Principal Investigator (PI) of all the following grants unless noted otherwise. 2021. 1-2024. 12, National Nature Science Foundation Program of China -Major Research plan of Coexisting-Cooperative-Cognitive Robots, Tri-Co Robots, Research on the basic theory and key technology of emergency quarantine robot for respiratory infectious diseases, sub-project, emotion- aware multimodal medical consultation 2020. 12-2023. 11, National Key R&D Program of China, Research and development of human ¨C like emotive companion robot (Co-PI) 2019. 5-2022. 4, National Key R&D Program of China, Research on Multimodal Human-robot Interaction 2018. 1-2020. 12, National Nature Science Foundation Program of China -Major Research plan of Coexisting-Cooperative-Cognitive Robots, Tri-Co Robots, Research on Bidirectional Emotive Interaction of Social Assistance Robot. 2018. 1-2020. 12, Key Research and Development Program of Anhui Province, Multimodal Emotion Recognition and Assistance of Medical Service Robot. 2015. 1-2018. 12, National Nature Science Foundation Program of China, Facial expression and action unit recognition by using privileged information and facial prior knowledge. 2015. 7-2017. 7, Project from Nature Science Foundation of Anhui Province, Emotion Classification of Videos Using Privilege Information and Emotional Cognitive Appraisal Theory. 2012. 1-2015. 12, National Nature Science Foundation Program, Implicit Emotional Semantic Annotation and Editing of Videos based on Audiences¡¯ Facial Information. 2013. 1-2014. 12, National Nature Science Foundation Program -overseas scholars collaborative research fund, Visual-based Emotion Recognition and Assistance from visual information and application in service robot. I am the Coordinator in China. 2011. 6-2012. 12, Anhui Science and Technology Agency, Study of Affective Information Processing and its Application. 2011. 6-2012. 12, Special Innovation Project on Speech of Anhui Province: Study of Affective Perception and Expression in Natural Human-Computer Interaction (Sub-project). 2010. 6-2012. 6, Program Xu Guangqi, Statistical Learning for Affective Brain Computer Interfaces (BCI). Prof. Stephane Canu, from LITIS, INSA de Rouen, is the Coordinator in France; I am the Coordinator in China. 2009. 1-2010. 12, National High Technology Research and Development Program (National 863 Project), Facial Expression Recognition and Emotion Inference by Fusing Visible and Infrared Images. 2008. 1-2009. 12, Project Sponsored by the Scientific Research Foundation for the Returned Overseas Chinese Scholars, State Education Ministry, Affective Multimedia Content Analysis and Design. 2008. 7-2009. 6, Project Sponsored by Huawei Company, Emotion-based Music Analysis and Synthesis. 2007. 1-2008. 12, Project from Nature Science Foundation of Anhui Province, Multimedia Emotion Modeling and its Application in Multimedia Environment. 2007. 1-2007. 12, Open Project from Key Lab of Computing and Communicating Software of Anhui Province, Several Issues in Facial Expression Recognition. 2005. 1-2005. 12, National Nature Science Foundation Program, Artificial Emotion Modeling and its Application. 2002. 6-2004. 6, Youth Project of USTC, Kansei Information Processing and Its Application. Research Outputs USTC-NVIE database (Natural Visible and Infrared facial Expression) has been constructed and published under the sponsor of the National 863 Project. 2019, second place on the Generalized Track of OMG - Empathy Prediction Challenge. 2019, second place on the Personalized Track of OMG - Empathy Prediction Challenge. 2019, Runner-up of the Detecting Depression with AI Sub-Challenge. Publications from 2010 BOOK/BOOK CHAPTER Shangfei Wang, Wang Xufa, Kansei Engineering and Soft Computing: Theory and Practice Chapter 7: Emotional Semantic Detection from Multimedia: A Brief Overview, Pennsylvania: IGI Global, 2010. JOURNAL/TRANSACTION PAPERS Shangfei Wang, Yanan Chang, Can Wang, Dual Learning for Joint Facial Landmark Detection and Action Unit Recognition, IEEE Transactions on Affective Computing, DOI: 10.1109/TAFFC.2021.3114158 Zhiwei Xu, Shangfei Wang, Emotional Attention Detection and Correlation Exploration for Image Emotion Distribution Learning, IEEE Transactions on Affective Computing, DOI: 10.1109/TAFFC.2021.3071131 Shangfei Wang, Shi Yin, Longfei Hao, Guang Liang, Multi-task Face Analyses through Adversarial Learning, Pattern Recognition, 114:107837, 2021. Shangfei Wang, Heyan Ding, Guozhu Peng, Dual Learning for Facial Action Unit Detection under Non-Full Annotation, IEEE Transactions on Cybernetics, DOI: 10.1109/TCYB.2020.3003502 Shangfei Wang, Zhuangqiang Zheng, Shi Yin, Jiajia Yang, Qiang Ji: A Novel Dynamic Model Capturing Spatial and Temporal Patterns for Facial Expression Analysis, IEEE Trans. on Patten Analysis and Machine Learning, 42(9): 2082-2095 (2020) Shangfei Wang, Guozhu Peng, Qiang Ji. Exploring Domain Knowledge for Facial Expression-Assisted Action Unit Activation Recognition, IEEE Trans. on Affective Computing, 11(4): 640-652 (2020) Shangfei Wang, Guozhu Peng, Zhuangqiang Zheng: Capturing Joint Label Distribution for Multi-Label Classification through Adversarial Learning, IEEE Trans. on Knowledge and Data Engineering, 32(12): 2310-2321 (2020) Shangfei Wang, Longfei Hao, Qiang Ji: Knowledge-Augmented Multimodal Deep Regression Bayesian Networks for Emotion Video Tagging, IEEE Trans. on Multimedia, 22(4): 1084-1097 (2020) Shangfei Wang, Longfei Hao, Qiang Ji, Posed and Spontaneous Expression Distinction Using Latent Regression Bayesian Networks, ACM Trans. on Multimedia Computing, Communications and Applications, 16(3): 80:1-80:18 (2020) Sicheng Zhao, Shangfei Wang, Mohammad Soleymani, Dhiraj Joshi, and Qiang Ji. 2019. Affective Computing for Large-scale Heterogeneous Multimedia Data: A Survey. ACM Trans. on Multimedia Computing, Communications and Applications 15, 3s, Article 93: 1-32, (2020) Shangfei Wang, Bowen Pan, Shan Wu, Qiang Ji: Deep Facial Action Unit Recognition and Intensity Estimation from Partially Labelled Data, IEEE Trans. on Affective Computing, DOI: 10.1109/TAFFC.2019.2914654 Shangfei Wang, Can Wang, Tanfang Chen, Yaxin Wang, Yangyang Shu, Qiang Ji: A Video Affective Content Analysis by Exploiting Domain Knowledge, IEEE Trans. on Affective Computing, DOI: 10.1109/TAFFC.2019.2912377 Shangfei Wang, Guozhu Peng, Zhuangqiang Zhen, Zhiwei Xu: Capturing Emotion Distribution for Multimedia Emotion Tagging. IEEE Trans. on Affective Computing, 2019. DOI: 10.1109/TAFFC.2019.2900240 Shangfei Wang, Guozhu Peng: Weakly Supervised Dual Learning for Facial Action Unit Recognition, IEEE Trans. on Multimedia, 21(12): 3218-3230 (2019) Shangfei Wang, Shiyu Chen, Qiang Ji. Content-based Video Emotion Tagging Augmented by Users' Multiple Physiological Responses. IEEE Trans. on Affective Computing, 10(2): 155-166 (2019). Shangfei Wang£¬Shan Wu£¬Guozhu Peng£¬Qiang Ji. Capturing Feature and Label Relations Simultaneously for Multiple Facial Action Unit Recognit",
  "content_length": 25523,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:23"
}