{
  "name": "Shan-Yuan Teng",
  "homepage": "https://tengshanyuan.info",
  "status": "success",
  "content": "Shan-Yuan Teng Shan-Yuan Teng鄧善元 [ CV ] Shan-Yuan Teng is an Assistant Professor (Yushan Young Fellow) leading Dexterous Interaction Lab in the Department of Computer Science & Information Engineering (CSIE) at National Taiwan University (NTU, Taipei, Taiwan). Shan-Yuan’s research aims at advancing a new generation of haptic devices (e.g., those that can create a programmable sense of touch, forces, etc.) to exhibit properties that we have become used to expect from our mobile & wearable devices, such as extreme mobility, availability anytime, etc. Shan-Yuan has published these works at top Human-Computer Interaction (HCI) conferences including ACM CHI & UIST, with two Best Paper Awards & five Honorable Mention Awards. Shan-Yuan has also demonstrated works at SIGGRAPH & IEEE Haptics. Shan-Yuan received their PhD in Computer Science at the University of Chicago advised by Prof. Pedro Lopes. Shan-Yuan holds a Master’s degree in Computer Science & Bachelor’s degree in Electrical Engineering from National Taiwan University. [ tengshanyuan@csie.ntu.edu.tw ] [ CV ] [ Google Scholar ] [ ORCID ] * Shan-Yuan is my first name Academic service I served on Program Committee for SIGGRAPH Asia 2025 Emerging Technologies, UIST 2024, SUI 2024/2023, ISS 2024 Editorial Board, ISWC 2022, Augmented Humans 2024/2023. I served as a Demo Chair for ACM Augmented Humans 2021. I regularly review papers for ACM CHI, UIST, IMWUT, TEI, DIS, IMX, SIGGRAPH (Technical Paper), IEEE ISMAR, IEEE VR, IEEE Haptics, IEEE World Haptics, IEEE Robotics and Automation Letters, International Journal of Human-Computer Studies. Watch my 3-minute introduction & demo PhD Research: Enabling haptic experiences anywhere, anytime Haptics (sense of touch & forces, etc), while highly developed in labs, are left to a minimum in our daily computing devices (vibration in phones). My research asks: What fundamental technical restrictions are limiting more haptics from integrating into our lives, and, more importantly, can we tackle these? Enabling haptic experiences anywhere, anytime PhD dissertation, Computer Science, University of Chicago, 2025 [ Defense recording ] Lead author publications (ACM CHI & UIST) Seeing with the hands: a sensory substitution that supports manual interactions Shan-Yuan Teng*, Gene S-H Kim*, Xuanyou Liu*, Pedro Lopes (*equal contribution) CHI 2025 Paper [ Paper (PDF) (DOI) ] [ Project website ] Haptic permeability: adding holes to tactile devices improves dexterity Shan-Yuan Teng, Aryan Gupta, Pedro Lopes CHI 2024 Paper [ Paper (PDF) (DOI) ] Prolonging VR haptic experiences by harvesting kinetic energy from the user Shan-Yuan Teng, K. D. Wu, Jacqueline Chen, Pedro Lopes UIST 2022 Paper 🏅 Honorable Mention Award [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] [ More info ] Touch&Fold: a foldable haptic actuator for rendering touch in mixed reality Shan-Yuan Teng, Pengyu Li, Romain Nith, Joshua Fonseca, Pedro Lopes CHI 2021 Paper, SIGGRAPH 2021 Emerging Technologies, World Haptics 2023 Demo 🏅 Honorable Mention Award [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] [ More info ] Collaborated papers (ACM CHI & UIST) Can a smartwatch move your fingers? Compact and practical electrical muscle stimulation in a smartwatch Akifumi Takahashi, Yudai Tanaka, Archit Tamhane, Alan Shen, Shan-Yuan Teng, Pedro Lopes UIST 2024 Paper 🏅 Honorable Mention Award [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] Altering perceived softness of real rigid objects by restricting fingerpad deformation Yujie Tao, Shan-Yuan Teng, Pedro Lopes UIST 2021 Paper 🏆 Best Paper Award🏆 Best Demo Award (Jury's Choice) [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] dextrEMS: increasing dexterity in electrical muscle stimulation by combining it with brakes Romain Nith, Shan-Yuan Teng, Pengyu Li, Yujie Tao, Pedro Lopes UIST 2021 Paper 🏆 Best Demo Award (People's Choice) [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] MagnetIO: passive yet interactive soft haptic patches anywhere Alex Mazursky, Shan-Yuan Teng, Romain Nith, Pedro Lopes CHI 2021 Paper [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] More publications (ACM CHI, UIST & Science Advances) ThermalRouter: enabling users to design thermally-sound devices Alex Mazursky, Borui Li, Shan-Yuan Teng, Daria Shifrina, Joyce E. Passananti, Svitlana Midianko, Pedro Lopes UIST 2023 Paper [ Paper (PDF) (DOI) ] [ Video (YouTube) ] A stretchable and strain-unperturbed pressure sensor for motion-interference-free tactile monitoring on skins Qi Su, Q. Zou, Yang Li, Yuzhen Chen, Shan-Yuan Teng, Jane Tunde Kelleher, Romain Nith, Ping Cheng, Nan Li, Wei Liu, Shilei Dai, Youdi Liu, Alex Mazursky, Jie Xu, Lihua Jin, Pedro Lopes, Sihong Wang Science Advances 2021 [ Paper (PDF) (DOI) ] Stereo-smell via electrical trigeminal stimulation Jas Brooks, Shan-Yuan Teng, Jingxuan Wen, Romain Nith, Jun Nishida, Pedro Lopes CHI 2021 Paper [ Paper (PDF) (DOI) ] [ Video (YouTube) ] Elevate: a walkable pin-array Seungwoo Je, Hyunseung Lim, Kongpyung Moon, Shan-Yuan Teng, Jas Brooks, Pedro Lopes, and Andrea Bianchi CHI 2021 Paper [ Paper (PDF) (DOI) ] [ Video (YouTube) ] HandMorph: a passive exoskeleton that miniaturizes grasp Jun Nishida, Soichiro Matsuda, Hiroshi Matsui, Shan-Yuan Teng, Ziwei Liu, Kenji Suzuki, Pedro Lopes UIST 2020 Paper 🏆 Best Paper Award [ Paper (PDF) (DOI) ] [ Video (YouTube) ] Wearable microphone jamming Shan-Yuan Teng*, Yuxin Chen*, Huiying Li*, Steven Nagels, Zhijing Li, Pedro Lopes, Ben Y. Zhao, Haitao Zheng (*equal contribution) CHI 2020 Paper 🏅 Honorable Mention Award [ Paper (PDF) (DOI) ] [ Video (YouTube) ] TilePoP: tile-type pop-up prop for virtual reality Shan-Yuan Teng, Cheng-Lung Lin, Chi-huan Chiang, Tzu-Sheng Kuo, Liwei Chan, Da-Yuan Huang, Bing-Yu Chen UIST 2019 Paper 🏅 Honorable Mention Award [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] [ More info ] Aarnio: passive kinesthetic force output for foreground interactions on an interactive chair Shan-Yuan Teng, Da-Yuan Huang, Chi Wang, Jun Gong, Teddy Seyed, Xing-Dong Yang, Bing-Yu Chen CHI 2019 Paper [ Paper (PDF) (DOI) ] [ Video (YouTube) ] [ More info ] PuPoP: pop-up prop on palm for virtual reality Shan-Yuan Teng, Tzu-Sheng Kuo, Chi Wang, Chi-huan Chiang, Da-Yuan Huang, Liwei Chan, Bing-Yu Chen UIST 2018 Paper [ Paper (PDF) (DOI) ] [ Video (YouTube) (MP4) ] [ More info ] Outside-In: visualizing out-of-sight regions-of-interest in a 360 video using spatial picture-in-picture previews Yung-Ta Lin, Yi-Chi Liao, Shan-Yuan Teng, Yi-Ju Chung, Liwei Chan, Bing-Yu Chen UIST 2017 Paper [ Paper (PDF) (DOI) ] [ Video (YouTube) ] [ More info ] This website is built using Jekyll and hosted on GitHub with a domain from Gandi.",
  "content_length": 6678,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:21"
}