{
  "name": "Shang-En Huang",
  "homepage": "https://tmt514.github.io",
  "status": "success",
  "content": "Create Next AppShang-En HuangI am currently an assistant professor in the Department of Computer Science and Information Engineering (CSIE), National Taiwan University. Previously, I was a Postdoc at Boston College advised by Hsin-Hao Su. I had the honor of being advised by Seth Pettie when pursuing my PhD at University of Michigan. I am interested in any cool analysis techniques of an algorithm, as well as any cool stuff related to graphs. I also love competitive programming. Research Interest [CV]: Dynamic Graph Data Structures and Algorithms. Asynchronous Distributed Algorithms. Distributed Graph Algorithms. Algorithms in Word RAM Model. Lower bound graphs for sparse distance preservers. EducationAssistant Professor, CSIE, National Taiwan University, Taipei, Taiwan2024 - presentPostdoc, Computer Science, Boston College, Chestnut Hill, MA, USA2022 - 2024Ph.D., Computer Science and Engineering, University of Michigan, Ann Arbor, MI, USA2016 - 2022M.S., Computer Science and Engineering, University of Michigan, Ann Arbor, MI, USA2014 - 2016B.S., Mathematics and CSIE, National Taiwan University, Taipei, Taiwan2007 - 2012Conference PapersDeterministic Expander Routing: Faster and More Versatile [arXiv]Yi-Jun Chang, Shang-En Huang, and Hsin-Hao SuACM Symposium on Principles of Distributed Computing (PODC), 2024Breaking 3-Factor Approximation for Correlation Clustering in Polylogarithmic Rounds [arXiv]Nairen Cao, Shang-En Huang, and Hsin-Hao SuACM-SIAM Symposium on Discrete Algorithms (SODA), 2024Cactus Representations in Polylogarithmic Max-flow via Maximal Isolating Mincuts [arXiv]Zhongtian He, Shang-En Huang, and Thatchaphol SaranurakACM-SIAM Symposium on Discrete Algorithms (SODA), 2024Cactus Representation of Minimum Cuts: Derandomize and Speed up [arXiv]Zhongtian He, Shang-En Huang, and Thatchaphol SaranurakACM-SIAM Symposium on Discrete Algorithms (SODA), 2024(1−ϵ)(1-\\epsilon)(1−ϵ)-Approximate Maximum Weighted Matching in poly(1/ϵ,log⁡n)\\text{poly}(1/\\epsilon, \\log n)poly(1/ϵ,logn) Time in the Distributed and Parallel Settings [arXiv]Shang-En Huang and Hsin-Hao SuACM Symposium on Principles of Distributed Computing (PODC), 2023Nearly Optimal Parallel Algorithms for Longest Increasing SubsequenceNairen Cao, Shang-En Huang, and Hsin-Hao SuACM Symposium on Parallelism in Algorithms and Architectures (SPAA), 2023Byzantine Agreement with Optimal Resilience via Statistical Fraud Detection [arXiv]Shang-En Huang, Seth Pettie, and Leqi ZhuACM-SIAM Symposium on Discrete Algorithms (SODA), 2023Vertex Sparsifiers for Hyperedge Connectivity [arXiv]Han Jiang, Shang-En Huang, Thatchaphol Saranurak, and Tian ZhangEuropean Symposium on Algorithms (ESA), 2022Byzantine Agreement in Polynomial Time with Near-Optimal Resilience [arXiv]Shang-En Huang, Seth Pettie, and Leqi ZhuACM SIGACT Symposium on Theory of Computing (STOC), 2022Lower Bounds on Sparse Spanners, Emulators, and Diameter-reducing shortcuts [arXiv]Shang-En Huang and Seth PettieScandinavian Symposium and Workshops on Algorithm Theory (SWAT), 2018Fully Dynamic Connectivity in O(log⁡n(log⁡log⁡n)2)O(\\log n(\\log\\log n)^2)O(logn(loglogn)2) Amortized Expected Time [arXiv]Shang-En Huang, Dawei Huang, Tsvi Kopelowitz, and Seth PettieACM-SIAM Symposium on Discrete Algorithms (SODA), 2017Journal PapersByzantine Agreement with Optimal Resilience via Statistical Fraud DetectionShang-En Huang, Seth Pettie, and Leqi ZhuJournal of the ACM, Volume 71, Issue 2, 2024Fully Dynamic Connectivity in O(log⁡n(log⁡log⁡n)2)O(\\log n(\\log\\log n)^2)O(logn(loglogn)2) Amortized Expected Time [arXiv]Shang-En Huang, Dawei Huang, Tsvi Kopelowitz, Seth Pettie, and Mikkel ThorupTheoretiCS, Volume 2, 2023Lower Bounds on Sparse Spanners, Emulators, and Diameter-reducing shortcuts [arXiv]Shang-En Huang and Seth PettieSIAM Journal on Discrete Mathematics (SIDMA), Volume 35(3), 2021Thorup-Zwick emulators are universally optimal hopsets [arXiv]Shang-En Huang and Seth PettieInformation Processing Letters (IPL), February 2019TeachingAlgorithm Design and Analysis 2024 FallRandomness and Computation (CSCI 2244) @ Boston College 2023 Fall This site is built using",
  "content_length": 4137,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:22"
}