{
  "name": "Shan-e-Ahmed Raza",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/shan_raza",
  "status": "success",
  "content": "Shan Raza Skip to main content Skip to navigation Title Associate Professor Contact Details Room: CS3.05 Department of Computer Science University of Warwick, Coventry, CV4 7ALTel: +44 24 7657 3801 Email: shan.raza@warwick.ac.uk BiographyDr Shan E Ahmed Raza is an Associate Professor in Computer Science and is associated with the Applied Computing divisionLink opens in a new window and the Tissue Image Analytics (TIA) CentreLink opens in a new window. Before joining Warwick, Dr Raza held a postdoctoral position for two years at the Institute of Cancer Research, UKLink opens in a new window working on the lung TRACERx project funded by Cancer Research UK (CRUK)Link opens in a new window. Prior to that, he worked for three years as a research fellow at Warwick Computer Science department on a BBSRC funded project exploring the origin of new beta cells during pregnancy. Dr Raza obtained BSc degree in electrical engineering from University of Engineering and Technology (UET), TaxilaLink opens in a new window in 2008 and MS in systems engineering from Pakistan Institute of Engineering and Applied Sciences (PIEAS), IslamabadLink opens in a new window in 2010. He obtained a PhD in Computer Science from Warwick in 2014, where his research focused on detection of biomedical anomalies using multiplexed images. During his PhD and postdoc roles, he gained hands on experience in the wet labs to prepare tissue samples for multiplexed imaging. In his current role, Dr Raza is associated with the TIA Centre at Warwick, is a PI on the Histomaps project, Co-PI on the Precision Vision project, Co-I on the PathLAKE-plus, COBIx and BigPicture projects. In the past, he has worked as a Co-I on the PathLAKE project. His research is primarily in the areas of brightfield and multiplexed microscopy image analysis and applied machine learning. Specifically, he is interested in the development of Computational Pathology algorithms for studying tumour microenvironment. Dr Raza has led the NGFF (next generation file format) workstream in the past which is an Innovate UK initiative on interoperability in healthcare. He has led the development of TIAToolboxLink opens in a new window for end-to-end deployment of AI algorithms in Computational Pathology and is working closely with the developers on the MONAI project in the pathology working group.Research InterestsComputational Pathology, Multi-Channel and Multi-Model Image Analysis, Deep Learning and Pattern Recognition, Integration of Histology with GenomicsCurrent Research ProjectsHistoMaps funded by MRCPathLAKE plus funded by Innovate UKBigPicture funded by ERCCOBIx funded by NIHRPrevious Research ProjectsPathLAKE funded by Innovate UKPrecision Vision funded by CRUKTeachingCS324: Computer GraphicsCS424/CS904 Computational BiologyPublicationsPlease click here for a full list of publications. Useful linksHomepagePublicationsCS324: Computer GraphicsCS424/CS904: Computational BiologyGoogle ScholarLink opens in a new windowTissue Image Analytics Centre Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 3386,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:22"
}