{
  "name": "Shandian Zhe",
  "homepage": "https://www.cs.utah.edu/~zhe",
  "status": "success",
  "content": "Homepage æ éª çµ Shandian Zhe Associate Professor School of Computing, University of Utah Office: Room 3466, MEB building Address: 50 Central Campus Dr #3190, School of Computing, University of Utah, Salt Lake City, UT 84112 I obtained the Ph.D. degree from the Computer Science Department of Purdue University in 2017. My research interests mainly lie in probabilistic learning. That is, using probabilistic frameworks to formulate learning problems and to infer/estimate model parameters. My research include but are not limited to probabilistic graphical models, Bayesian deep neural networks, operator learning, generative modeling, physics informed neural networks, Bayesian emulation, approximate inference, and kernel methods. From application side, I have developed probabilistic methods for microarray data analysis, association study for Alzheimer's disease, functional magnetic resonance imaging (fMRI) data analysis, blood transfusion prediction, and click-through-rate prediction for online advertising. Email: zhe at cs.utah.edu Curriculum Vitae Graduate students I am looking for highly motivated students with solid background in probability, linear algebra and/or optimization, and good programming skills. If you are interested in joining my group, welcome to contact me via the email address above. Please attach your CV in the email. In particular, if you have a strong math and/or physics background (e.g., with a BS degree in math or physics) and also have coding experiences, e.g., matlab and python), feel free to schedule a meeting with me. Current Group (see Alumini) Undergraduate students: Shen-hei Ho Ph.D. students: Zhitong Xu Da Long Qiwei YuanKeyan ChenMatthew Lowery (co-advised with Varun Shankar) Zachary Bastiani (co-advised with Mike Kirby) Madison Cooley (co-advised with Mike Kirby) Tushar Gautam (co-advised with Mike Kirby) Group Seminar Teaching CS 3130/ECE 3530 Engineering Probability and Statistics, Spring 2025 CS 6190 Probabilistic Modeling, Fall 2019, Spring 2022, 2023, 2024 CS 5350/6350 Machine Learning, Spring 2018, 2019, 2020, 2021, Fall 2021, 2022, 2023, 2024 CS 3190 Foundation of Data Analysis, Fall 2018 CS 7941 Data Group Seminar, Fall 2018, 2019 News Year 2025 2 ICML papers accepted. Congrats to Zhitong Xu, Da Long, Guang Yang! Zhitong has published four papers after joining our group in the first year! 1 ICLR and 1 AISTATS paper accepted. Contras to Zhitong Xu, Da Long, Qiwei Yuan! In particular, Zhitong got two papers --- first author (ICLR) and second author (AISTATS) --- after joining our group for the first semester! Congras Zhitong for his paper being selected as an oral presentation in ICLR! Year 2024 Shibo will join Department of Computer Science, Florida State University (FSU) as a Tenure-Track Assistant Professor! Shibo is my first Ph.D. student coming to the academia (even before I was tenured!). Congrats to Professor Li! Shikai will join Microsoft Research Asia as a Senior Researcher. This position is rarely given to a fresh Ph.D. Congrats to Shikai! Shibo Li, Shikai Fang, and Xin Yu have successfully defended their Ph.D. thesis. Congrates to Dr. Li, Dr. Fang and Dr. Yu! Shibo received 3 TTAP offers from Florida State Univrsity, University of Tennessee, Knoxville, and The University of Alabama. Xin received TTAP offer from UMass Boston. 2 ICLR and 2 AISTATS papers accpeted. Congras to Shikai Fang, Shibo Li, Da Long, and others. Congras to Shibo for his paper being selected as an oral presentation in AISTATS! Congrats to Shikai for his paper being selected as a ICML spotlight presentation! Year 2023 2 NeurIPS papers accepted. Congrats to Zheng Wang, Shikai Fang, Shibo Li and Xin Yu! Congrats to Zheng for his paper being selected as a spotlight presentation! Zheng Wang has successfully defended his Ph.D. thesis. Congrats to Dr. Wang now. Zheng will join Celonis --- the unicorn in process mining! Given this is a hard time for international students to find jobs, Zheng has made a great achievement! Congrats! 2 ICML papers and 1 AISTATS papers accepted. Congrats to Shibo Li and Shikai Fang! Year 2022 Zhimeng Pan has successfully defended his Ph.D. thesis. Congrats to Dr. Pan now! Zhimeng will join Pinterest in his next step. 3 NeurIPS papers accpeted. Congrats to Shibo Li, Zheng Wang and Xin Yu. Especially, Shibo is the leading author for two papers! 7 ICML papers accpeted. Congratulations to Da Long and Xin Yu: they got ICML papers after joining our group for one semester! In particular, Da is a fresh Ph.D. student. Congratulations to Shikai for his paper being selected as a long presentation! Grants Current Project Publications Year 2026 Yintong Shang, Yutao Feng, Xiang Feng, Lei Lan, Shandian Zhe, Tianjia Shao, Hongzhi Wu, Kun Zhou, Chenfanfu Jiang, Yin Yang. “ElastoGen: 4D Generative Elastodynamics” (oral presentation), AAAI, 2026 Year 2025 Da Long, Zhitong Xu, Guang Yang, Akil Narayan, and Shandian Zhe, “Arbitrarily-Conditioned Multi-Functional Diffusion for Multi-Physics Emulation”, Forty-Second International Conference on Machine Learning (ICML), 2025. [PDF] [Code] Zhitong Xu*, Da Long*, Yiming Xu, Guang Yang, Shandian Zhe, and Houman Owhadi, “Toward Efficient Kernel-Based Solvers for Nonlinear PDEs”, Forty-Second International Conference on Machine Learning (ICML), 2025. [PDF] [Code] Zhitong Xu, Haitao Wang, Jeff M. Phillips, and Shandian Zhe, “Standard Gaussian Process is All You Need for High-Dimensional Bayesian Optimization” (oral presentation), International Conference on Learning Representations (ICLR), 2025 [PDF] [Code] Da Long, Zhitong Xu, Qiwei Yuan, Yin Yang, and Shandian Zhe, “ Invertible Fourier Neural Operators for Tackling Both Forward and Inverse Problems”, The 28th International Conference on Artificial Intelligence and Statistics (AISTATS), 2025 [PDF] [Code] Johncox, Max, Zhaoxia Pu, and Shandian Zhe. \"Using the Fourier neural operator and realâtime GOESâR satellite data for precipitation retrievals in the southern Great Plains.\" Journal of Geophysical Research: Machine Learning and Computation 2.3 (2025): e2024JH000531 Tushar Gautam, Jacob Hochhalter, Shandian Zhe, Eric Lindgren, and Robert M. Kirby, \"Developing Robust Stress Intensity Factor Models Using Fourier-Based Data Analysis To Guide Machine Learning Method Selection and Training\", Engineering Fracture Mechanics, In Press, 2025. Madison Cooley, Varun Shankar, Mike Kirby, and Shandian Zhe, “Fourier PINNs: From Strong Boundary Conditions to Adaptive Fourier Bases”, Transactions on Machine Learning Research (TMLR), 2025. [PDF] Keyan Chen, Yile Li, Da Long, Zhitong Xu, Wei Xing, Jacob Hochhalter, Shandian Zhe, \"Pseudo-Physics-Informed Neural Operators: Enhancing Operator Learning from Limited Data\", Transactions on Machine Learning Research (TMLR), 2025. Madison Cooley, Mike Kirby, Shandian Zhe, Varun Shankar, \"HyResPINNs: A Hybrid Residual Physics-Informed Neural Network Architecture Designed to Balance Expressiveness and Trainability\", Transactions on Machine Learning Research (TMLR), 2025. Year 2024 Shikai Fang, Qingsong Wen, Yingtao Luo, Shandian Zhe, Liang Sun, “BayOTIDE: Bayesian Online Multivariate Time series Imputation with functional decomposition” (spotlight), The 41st International Conference on Machine Learning (ICML), 2024. [PDF] [Code] Shikai Fang, Xin Yu, Zheng Wang, Shibo Li, Rboert M. Kirby, and Shandian Zhe, “Functional Bayesian Tucker Decomposition for Continuous-indexed Tensor”, The International Conference on Learning Representations (ICLR), 2024. [PDF][Code] Shikai Fang*, Madison Cooley*, Da Long*, Shibo Li, Robert M. Kirby, and Shandian Zhe, “Solving High Frequency and Multi-Scale PDEs with Gaussian Processes”, The International Conference on Learning Representations(ICLR), 2024. [PDF] [Code] Shibo Li, Xin Yu, Wei W. Xing, Robert M. Kirby, Akil Narayan, and Shandian Zhe, “Multi-Resolution Active Learning of Fourier Neural Operators”(oral presentation), The 27th International Conference on Artificial Intelligence and Statistics (AISTATS), 2024. [PDF] [Code] Da Long, Wei W. Xing, Aditi S. Krishnapriyan, Robert M. Kirby, Shandian Zhe, and Michael W. Mahoney, “Equation Discovery with Bayesian Spike-and-Slab Priors and Efficient Kernels”, The 27th International Conference on Artificial Intelligence and Statistics (AISTATS), 2024. [PDF] [Code] Da Long, Nicole Mrvaljevic, Shandian Zhe, and Bamdad Hosseini, “A Kernel Approach for PDE Discovery and Operator Learning”, In Physcia D: Nonlinear Phenomena. Yingjing Wu, Ahmed Elmokashfi, Foivos Michelinakis, Jacobus, Van der Merwe, and Shandian Zhe, “ ADDER: Service-Specific Adaptive Data-Driven Radio Resource Control for Cellular-IoT ”, 2024 IEEE 25th International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM) Lingyi Fu, Ryan D. Burns, Shandian Zhe, Yang Bai, “ What Explains Adolescentsâ Physical Activity and Sports Participation During the COVID-19 Pandemic? â An Interpretable Machine Learning Approach ”, Journal of Sports Sciences, 2024, Vol 42, Issue 17. Year 2023 Zheng Wang, Shikai Fang, Shibo Li, and Shandian Zhe, “Dynamic Tensor Decomposition via Neural Diffusion-Reaction Processes” (spotlight presentation), The 37th Conference on Neural Information Processing Systems (NeurIPS), 2023. [PDF] [Code] Shikai Fang, Xin Yu, Shibo Li, Zheng Wang, Robert M. Kirby, and Shandian Zhe, “Streaming Factor Trajectory Learning for Temporal Tensor Decomposition”, The 37th Conference on Neural Information Processing Systems (NeurIPS), 2023. [PDF][Code] Hongsup Oh, Roman Amici, Geoffrey Bomarito, Shandian Zhe, Robert M. Kirby and Jacob Hochhalter, “Inherently Interpretable Machine Learning Solutions to Differential Equations”, Engineering with Computers, In Press, 2023. Shikai Fang, Shandian Zhe, Hui-Ming Lin, Arun A. Azad, Heidi Fettke, Edmond M Kwan, Lisa Horvath, Blossom Mak, Tiantian Zheng, Pan Du, Shidong Jia, Robert M. Kirby, Manish Kohli MD, “Multi-Omic Integration of Blood-Based Tumor Associated Genomic and",
  "content_length": 27280,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:23"
}