{
  "name": "Shang-Tse Chen",
  "homepage": "https://www.csie.ntu.edu.tw/~stchen",
  "status": "success",
  "content": "Shang-Tse Chen, Associate Professor, Department of Computer Science and Information Engineering, National Taiwan University Shang-Tse Chen Publications Teaching Home stchen@csie.ntu.edu.tw Google Scholar CV (PDF) I am an Associate Professor in the Department of Computer Science and Information Engineering and Graduate Institute of Networking and Multimedia at National Taiwan University. I work in the intersection of applied and theoretical machine learning, with a strong application focus on cybersecurity. My recent research interests include adversarial ML and various aspects of security, privacy, and fairness of ML models. I lead the NTU AI Security Lab, where we are actively looking for highly motivated Postdocs, PhD, MS, and undergraduate students! News May 2025Two papers accepted to ICML 2025. Mar. 2025Honored to receive the K. T. Li Young Researcher Awardï¼ ä¸­è¯æ°åè³è¨å­¸ææåé¼éå¹´ç ç©¶çï¼! Jan. 2025One paper accepted to NACCL-Findings 2025. Nov. 2024MS student Jacky Liu won ä¸­è¯æ°åäººå·¥æºæ §å­¸æ TAAI 2024 ç¢©å£«è«æä½³ä½ç! Sept. 2024One paper accepted to NeurIPS 2024. Sept. 2024One paper accepted to EMNLP 2024. Jul. 2024BS student Ping-Han Huang received the NSTC Undergraduate Research Grant! Jun. 2024BS student Ping-Han Huang got 1st Prize at NTU CSIE Undergrad Research Competition! Jan. 2024One paper accepted to IEEE Wireless Communications Magazine. Jan. 2024One paper accepted to ICLR 2024. Dec. 2023One paper accepted to AAAI 2024. Nov. 2022MS student Jacky Liu received Garmin Fellowship! Aug. 2021I co-organized MLSS 2021. Education 2013 â 2019Ph.D. in Computer Science Georgia Institute of Technology, Atlanta, GA Thesis: AI-infused Security: Robust Defense by Bridging Theory and Practice Committee: Polo Chau (advisor), Nina Balcan (co-advisor), Wenke Lee, Le Song, Â  Â  Â  Â  Â  Â Â Kevin Roundy, and Cory Cornelius 2006 â 2010B.S. in Computer Science Information Engineering National Taiwan University, Taipei, Taiwan Selected Honors and Awards 2025K. T. Li Young Researcher Awardï¼ ä¸­è¯æ°åè³è¨å­¸ææåé¼éå¹´ç ç©¶çï¼ 2020ACM Trans. Interactive Intelligent Systems (TiiS) 2018 Best Paper, Honorable Mention 2018 â 2019 IBM PhD Fellowship For my Ph.D. research on âAI-infused Security: Robust Defense by Bridging Theory and Practiceâ 2018KDDâ18 Audience Appreciation Award, Runner Up For âShield: Fast, Practical Defense and Vaccination for Deep Learning using JPEG Compressionâ 2016Symantec Fellowship Runner-Up 2016KDDâ16 Best Student Paper Award, Runner-Up For âFirebird: Predicting Fire Risk and Prioritizing Fire Inspections in Atlantaâ 2010National Science Council Research Creativity Award For my undergraduate research on âLink Prediction in Heterogeneous Networksâ 2009KDD Cup 2009 3rd Prize (slow track) Out of 400+ submissions KDD CUP is the most prestigious data mining contest Industry Research Experience Summer 2018Intel Labs, Hillsboro, OR Graduate Machine Learning Security Intern Mentor: Cory Cornelius, Jason Martin Explored regularization techniques as defense against adversarial attack. Summer 2017Intel Labs, Hillsboro, OR Graduate Security Intern Mentor: Cory Cornelius, Jason Martin Developed ShapeShifter, the 1st physical adversarial attack that fools Faster R-CNN object detectors Summer 2016Symantec Research Labs, Culver City, CA Research Engineer Intern Mentor: Kevin A. Roundy Developed patented Virtual Product, a novel framework for enterprise cyber threat detection. Summer 2015Pindrop Security, Atlanta, GA Research Intern Mentor: Raj Bandyopadhyay Improved phone fraud detection system significantly by 10 absolute percentage. Academic Research Experience 2020 â 2024National Taiwan University, Taipei, Taiwan Assistant Professor, Department of Computer Science and Information Engineering 2013 â 2019Georgia Institute of Technology, Atlanta, GA Graduate Research Assistant, School of Computational Science and Engineering Advisors: Polo Chau and Nina Balcan 2011 â 2013Academia Sinica, Taipei, Taiwan Graduate Research Assistant, Institute of Information Science Advisors: Chi-Jen Lu and Hsuan-Tien Lin 2008 â 2010National Taiwan University, Taipei, Taiwan Undergraduate Research Assistant, Department of Computer Science and Information Engineering Advisors: Shou-De Lin and Hsuan-Tien Lin Student Advising PhD Students 2021 â presentBo-Han Kung 2021 â presentHsuan Su (co-advised with Prof. Hung-Yi Lee) MS Students 2020 â presentPei-Chi Wang 2020 â presentShao-Lun Ma 2020 â presentKai-Chen Lin 2020 â presentJun-Jie Wang 2021 â presentYu-Yu Wu 2021 â presentHung-Jui Wang 2021 â presentJeremy Wu Undergraduate Students 2020 â presentWei-Lun Kao 2021 â presentYu-Che Huang 2021 â presentYu-Hsun Chou 2021 â presentJan-Ting Du Alumni 2020 â 2021Hao-Ping (Hank) Lee (now a PhD student at CMU) 2020 â 2021Simon Ko (now an MS student at UC Berkeley) Publications Refereed Conference Papers Safeguard Fine-Tuned LLMs Through Pre- and Post-Tuning Model Merging Hua Farn, Hsuan Su, Shachi H Kumar, Saurav Sahay, Shang-Tse Chen, Hung-yi Lee To appear in Findings of the Conference on Empirical Methods in Natural Language Processing (EMNLP-Findings). Suzhou, China. Nov. 2025. Enhancing Certified Robustness via Block Reflector Orthogonal Layers and Logit Annealing Loss Bo-Han Lai, Pin-Han Huang, Bo-Han Kung, and Shang-Tse Chen International Conference on Machine Learning (ICML) (spotlight). Vancouver, Canada. July 2025. GitHub DRAG: Data Reconstruction Attack using Guided Diffusion Wa-Kin Lei, Jun-Cheng Chen, and Shang-Tse Chen International Conference on Machine Learning (ICML). Vancouver, Canada. July 2025. GitHub Jailbreaking with Universal Multi-Prompts Yu-Ling Hsu, Hsuan-Su, and Shang-Tse Chen Findings of Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics (NAACL-Findings), Albuquerque, NM. Apr. 2025. GitHub Trap-MID: Trapdoor-based Defense against Model Inversion Attacks Zhen-Ting Liu and Shang-Tse Chen Annual Conference on Neural Information Processing Systems (NeurIPS), Vancouver, Canada. Dec. 2024. GitHub Task Arithmetic can Mitigate Synthetic-to-Real Gap in Automatic Speech Recognition Hsuan Su, Hua Farn, Fan-Yun Sun, Shang-Tse Chen, and Hung-yi Lee Conference on Empirical Methods in Natural Language Processing (EMNLP), Miami, FL. Nov. 2024. Site | GitHub Annealing Self-Distillation Rectification Improves Adversarial Training Yu-Yu Wu, Hung-Jui Wang, and Shang-Tse Chen International Conference on Learning Representations (ICLR), Vienna, Austria. May 2024.. GitHub Towards Large Certified Radius in Randomized Smoothing using Quasiconcave Optimization Bo-Han Kung and Shang-Tse Chen Annual AAAI Conference on Artificial Intelligence (AAAI), Vancouver, Canada. Feb. 2024. GitHub AdvCAPTCHA: Creating Usable and Secure Audio CAPTCHA with Adversarial Machine Learning Hao-Ping (Hank) Lee, Wei-Lun Kao, Hung-Jui Wang, Ruei-Che Chang, Yi-Hao Peng, Fu-Yin Cherng, and Shang-Tse Chen Symposium on Usable Security and Privacy (USEC), San Diego, CA. Feb. 2024. UnMask: Adversarial Detection and Defense Through Robust Feature Alignment Scott Freitas, Shang-Tse Chen, Zijie J. Wang, and Duen Horng Chau IEEE International Conference on Big Data (BigData). Atlanta, GA. Dec. 2020. GitHub ShapeShifter: Robust Physical Adversarial Attack on Faster R-CNN Object Detector Shang-Tse Chen, Cory Cornelius, Jason Martin, and Duen Horng (Polo) Chau European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML-PKDD). Dublin, Ireland. Sept. 2018. GitHub | Video Shield: Fast, Practical Defense and Vaccination for Deep Learning using JPEG Compression Nilaksh Das, Madhuri Shanbhogue, Shang-Tse Chen, Fred Hohman, Siwei Li, Li Chen, Michael E. Kounavis, and Duen Horng (Polo) Chau ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). London, UK. Aug. 2018. GitHub | Video | Audience Appreciation Award, Runner-Up Diversified Strategies for Mitigating Adversarial Attacks in Multiagent Systems Maria-Florina Balcan, Avrim Blum, and Shang-Tse Chen (alphabetic order) International Conference on Autonomous Agents and Multiagent Systems (AAMAS). Stockholm, Sweden. July 2018. Predicting Cyber Threats with Virtual Security Products Shang-Tse Chen, Yufei Han, Duen Horng (Polo) Chau, Christopher Gates, Michael Hart, and Kevin Roundy Annual Computer Security Applications Conference (ACSAC). Orlando, FL. Dec. 2017. Patented Firebird: Predicting Fire Risk and Prioritizing Fire Inspections in Atlanta Michael Madaio, Shang-Tse Chen, Oliver Haimson, Wenwen Zhang, Xiang Cheng, Matthew Hinds-Aldrich, Duen Horng (Polo) Chau, and Bistra Dilkina. ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). San Francisco, CA. Aug. 2016. Site | GitHub | Video | Best Student Paper Award, Runner-Up Communication Efficient Distributed Agnostic Boosting Shang-Tse Chen, Maria-Florina Balcan, and Duen Horng (Polo) Chau International Conference on Artificial Intelligence and Statistics (AISTATS). Cadiz, Spain. May 2016. Boosting with Online Binary Learners for the Multiclass Bandit Problem Shang-Tse Chen, Hsuan-Tien Lin, and Chi-Jen Lu International Conference on Machine Learning (ICML). Beijing, China. June 2014. An Online Boosting Algorithm with Theoretical Justifications Shang-Tse Chen, Hsuan-Tien Lin, and Chi-Jen Lu International Conference on Machine Learning (ICML). Edinburgh, Scotland. June 2012. Code Journal Articles and Book Chapters Ensuring Bidirectional Privacy on Wireless Split Inference Systems Chia-Che Sa, Li-Chen Cheng, Hsing-Huan Chung, Te-Chuan Chiu, Chih-Yu Wang, Ai-Chun Pang, and Shang-Tse Chen IEEE Wireless Communications Magazine, 2024. Chronodes: Interactive Multi-focus Exploration of Event Sequences Peter J. Polack, Shang-Tse Chen, Minsuk Kahng, Kaya De Barbaro, Rahul Basole, Moushumi Sharmin, and Duen Horng (Polo) Chau ACM Transactions on ",
  "content_length": 18828,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:23"
}