{
  "name": "Shaoliang Peng",
  "homepage": "http://csee.hnu.edu.cn/people/pengshaoliang",
  "status": "success",
  "content": "彭绍亮-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 彭绍亮 我的位置在： 首页 > 学院概况 > 师资力量 > 彭绍亮 教师介绍 彭绍亮，国家重大人才工程第一层次，2024年全球前2%顶尖科学家（人工智能），2023年湖南省首届“湘江榜样”（10位），2023年度湖南省数字化十大杰出人物。主持湖南省“创新群体“和”“杰出青年”基金，湖南大学二级教授/博导，国家超级计算长沙中心副主任，高性能分布式账本与数字金融教育部重点实验室副主任。从事高性能计算、大数据、生物信息、人工智能、区块链等研究。出版专著8部，发表学术论文两百余篇，论文引用10000余次，授权发明专利50余项。获2019年国家科技进步二等奖，2019年湖南省技术发明一等奖（排名1），2013年军队科技进步一等奖1项，2021年CCF技术发明二等奖（排名1），2018年CCF自然科学二等奖（排名1），2016年荣立三等功。是中央军委、国家科技部/工信部/教育部会评专家、中国计算机学会理事、CCF计算机应用和生物信息专委副主任和YOCSEF总部AC委员、CCF高性能计算、大数据专委常委、大模型论坛常委、区块链专委委员，湖南省生物医学工程学会理事长，任2个SCI期刊执行主编，创立全球首个《Metaverse》元宇宙国际期刊，Editor-in-Chief主编。 中文名： 彭绍亮 英文名： 学历： 博士 职称： 教授 联系电话： 电子邮件： slpeng@hnu.edu.cn pengshaoliang@gmail.com 研究方向： 高性能计算、大数据、人工智能、生物信息、区块链、Web3.0 联系地址： 湖南省长沙市岳麓区国家超算长沙中心0号楼（410082） 所属机构： 智能计算系 学院教师 个人主页 彭绍亮教授课题组长期招聘教授、副教授、博士后、博硕士研究生、本科生、技术人员、工程师、财务行政、综合管理等，计算机类、人工智能、大数据，区块链、生物信息等专业优先，本课题组主要研究方向为高性能计算、大数据、生物信息、区块链、人工智能。学习工作地点：长沙、深圳、杭州、上海、北京、郑州、桂林等。欢迎转发和推荐！简历发送和联系邮箱 slpeng@hnu.edu.cn 详情请见：https://rrx.cn/view-vm3czs（1）http://csee.hnu.edu.cn/people/pengshaoliang团队招聘博士后：A.赫曦博士后：薪酬不低于47万/年+导师配套经费6-10万/年B.重点资助类：薪酬不低于24万/年+导师配套经费6-10万/年C.一般资助类：薪酬不低于16万/年+导师配套经费6-10万/年团队常年招聘博士后，每年计划招收2-3位，推荐申请国家级人才和项目。一、学校对全职博士后实行分类资助：1. 特别资助类：“博士后创新人才支持计划”、“博士后国际交流计划”(引进项目)入选者，国家资助期内学校30万元/年（含国家资助），学院和导师分别配套支持6-10万/年，1800元/月租房补贴；2. 重点资助类：学校按20万/年标准拨付人员经费，学院和导师分别配套支持6-10万/年，1800元/月租房补贴；3. 国际联合培养类：学校按20万/年标准拨付人员经费，学院和导师分别配套支持6-10万/年，外方课题组经费。二、支持保障：1. 按政策享受长沙市人才补贴（包括生活补贴和购房补贴13-20万元）；在站期间学校计算工作年限，进站前无工作经历的博士后人员参加工作时间从进站之日起计算；3. 博士后期间认定副研究员指标单列；4. 学校特设“杰出博士后”奖。入选者出站后可申请事业编制教学科研岗位；5. 享受本校教师同等科研成果奖励。在站期间可在我校落户，子女享受我校教职工子女入托、入学待遇。 联系方式 l邮箱：     slpeng@hnu.edu.cn     pengshaoliang@nudt.edu.cn     pengshaoliang@gmail.coml通讯地址和邮编：    National Supercomputer Center in Changsha, Hunan University, Changsha 410082, China   国家超级计算长沙中心，湖南大学，长沙，410082      School of ComputerScience, National University of Defense Technology, Changsha 410073, China  计算机学院，国防科技大学，长沙，410073 学术服务 担任多个国际期刊主编和副主编，包括：            Program Committee and Official Area Chair for AAAI-26           Metaverse (MET) 元宇宙, Editor-in-Chief （主编）           International Journal of Biological Sciences (SCI期刊，IF=10.75), Executive Editors （ 执行主编）           Interdisciplinary Sciences: Computational Life Sciences (SCI期刊，IF=3.5) Executive Editors-in-Chief （执行主编）           Health Information Science and Systems(SCI期刊, IF=5.02)  Associate Editors （副主编）           International Journal of High Performance Computing and Networking(IJHPCN) Editorial Board Members            Blockchain Research and Applications, Editorial Board Members           CCF Transactions on High Performance Computing, Editorial Board Members           Frontier of Information Technology & Electronic Engineering,  Corresponding Expert 中国工程院院刊《信息与电子工程前沿（英文）》         《大数据》（Big Data Research，BDR），中华人民共和国工业和信息化部，编委2025年：2025年11月22日，2025湖南省生物医学工程学会年会—柔性电子与智慧医疗创新论坛”，长沙，授课嘉宾2025年11月8日，HNSBME2025湖南省生物医学工程学会2025学术年会，长沙，演讲嘉宾2025年11月6-9日，中华医学会第三十一次医学信息学术会议，专题讲座2025年10月入选中国产学研合作促进会创新人才库2025年11月28-30日，2025年IEEE第四节人工智能、人机交互和机器人国基学术会议（IEEE AIHCIR 2025），浙江宁波，Program Chairs 2025年10月17-19日，2025年世界生物医药与人工智能大会（ICBAI），上海，大会主席 2025年9月20日，2025年第十八届健康服务业大会暨中华医学会第十六次健康管理学学术会议—“5G+三早健康管理论坛”，成都，演讲嘉宾 2025年9月23日至9月27日，2025年中小学教师科学素质提升培训，长沙，授课专家 2025年9月19日，2025年中国抗癌协会CACA-CGD肿瘤基因诊断学术大会，主题报告 2025年9月12日-14日，2025年第十三届CCF大数据学术会议—数据智能计算论坛，论坛主席 2025年8月-至今，中国计算机学会计算机应用专业委员会委员 2025年6月-至今，广东省人工智能与机器人产业联盟专家委员会委员  2025年7月13日，2025年中国计算机学会第三届CCF黄河科技大会，特邀讲者  2025年4月19日，2025年湖南省生物医学工程学会数智病理专委会成立暨第一届学术研讨会，主题报告   2025年4月-至今，湖南省生物医学工程学会数智病理专委会，名誉主任委员   2025年4月20日，2025年AI+医生：人机协同，共创心血管诊疗新未来，主题报告2024年：    2024年全球前2%顶尖科学家（人工智能）   2024年11月21，2024年首届紫荆中医药国际峰会，多模态生物医药大数据和人工智能大模型分论坛演讲报告    2024年10月-至今，中国工商银行股份有限公司湖南省分行    科技金融战略专家    2024年11月2日，2024年湖南省生物医学工程大会暨医工融合创新学术交流大会，主题报告    2024年10月26日，2024 年世界生物医药与人工智能大会，大会主席和大会主题报告人    2024年10月至今，中国生物医学工程学会-科技经济融合工作第十一届委员会  委员    2024年出版科普专著《AIGC+元宇宙/Web3.0 100问：洞悉数字经济时代的底层技术》入选CCF第五期“科普阅读推荐图书”（10部）     2024年9月-至今，中国传媒大学数据科学与智能媒体学院智能学科发展战略咨询委员会特聘顾问     2024年9月-至今，雄安国创中心科技有限公司大数据与人工智能特聘专家      2024年10月12日，中华预防医学会生物信息学会回第二届学术会议，苏州，多模态生物医药大数据和人工智能大模型学术讲座      2024年9月，湖南省医学会放射学专业委员会第二十六届学术年会暨医学会影响技术专业委员会第十一届学术年会，长沙，人工智能医学影新技术：大模型训练大模型，魔法打败魔法学术讲座      2024年7月，中国指挥与控制学会首届全国大模型与决策职能大会（CCLD 2024），杭州，元宇宙Web3.0 时代下的生成式人工智能大模型主题演讲      2024年6月26日，中国计算机学会CCF学生领航计划，演讲嘉宾      2024年5月24日，中国生物信息学学会（筹）技术生物学与生物信息算法研究专委学术大会暨第二届山东省生物信息学学术大会，青岛，神农GPT:多模态药物大模型   特邀报告      2024年3月至今，CCF大模型论坛常委-执行委员       2024 15th IEEE International Conference on Software Engineering and Service Science，Conference Chairs2023年：        2023年12月21日，2023中国大数据技术大会，北京，大会报告        2023年12月24日，大数据专委2023中国大数据技术大会BDTC，广州，Web 3.0时代下的健康数字孪生和电子药主题演讲        2023年12月23日，2023年信息技术类学院院长联席会暨八桂科技讲坛，桂林，Web3.0 时代下的算力网络和人工智能应用与推断关键技术研究主题演讲        2023年12月22日，大数据专委2023中国大数据技术大会BDTC，广州，算力网络和人工智能应用主题演讲       2023年12月16日，“理工融合 创新发展”高端学术论坛，长沙，Web3.0 时代下的人工智能教育大模型主题演讲        December 15, 2023，18th International Conference on Bioinspired Computing: Theory and Applications，Changsha，ShennongGPT: A Fine-tuning LLM Model for Medication Guidance        2023年11月19日，2023第六届中国教育创新成果公益博览会，珠海，算力网络和教育元宇宙主题演讲        2023年10月27日，CNCC论坛报告，沈阳，药物发现人工智能大模型主题演讲        2023年3月，聘请为国防科技大学军队高层次科技创新人才工程青年科技英才带教导师        2023年9月24日，华中科技大学计算机科学与技术专业学术报告会，武汉，大会报告         2023年8月21日，2023年首届中国林草高新技术应用大会，张家口，基于人工智能算力的林草新技术应用主题演讲          2023年8月20日，2023年第二届国防基础理科“基石”青年学者论坛，长沙，大会报告         2023年7月21日-23日，2023年光合基金开发者大会，昆山，大会报告         2023年7月22日，2023年第三届湖南省数字产业高峰论坛，长沙，Web3.0时代下的算力网络和应用主题演讲           2023年7月15日，2023年第六届CCF中国区块链技术大会暨区块链专业委员会成立五周年庆典，南京，Web3.0时代下的算力网络和应用主题演讲           2023年6月30日，2023年重庆市第四届互联网医院建设暨健康医疗大数据应用交流大会，重庆，Web3.0时代下的健康数字孪生和电子药主题演讲             2023年6月17日，2023年第二届湾区“互联网医疗”高峰论坛暨健康160第6届医生影响力年度盛典，深圳，Web3.0时代下的健康数字孪生和电子药主题演讲           2023年6月2日，2023年首届粤港澳医药创新发展大会，广州，人工智能与新药研发论坛报告           2023年5月至今，中国元宇宙技术与应用创新平台成立大会副理事长           2023年5月21-23日，南京2023元宇宙应用共创大会-中国元宇宙技术与应用创新平台成立大会，南京，大会报告            2023年5月，中国联通追光行动发布会，长沙，“Web3.0时代下的算力网络”主题演讲            2023年5月12日-15日，第九届全国计算生物学与生物信息学学术会议暨生物医学大数据与人工智能大会，徐州，大会报告            2023年5月11日，CCF计算机应用专委走进华南师范大学CCF@U第948场，华南师范大学软件学院，大会报告            2023年5月9日-12日，第五届中国生命电子学术年会，佛山，大会特邀报告            2023年03月，中国电子学会第17期“CIE电子信息云讲堂”优秀讲者            2023年03月，中国计算机学会中国数字经济产业发展大会（CCDE）专题论坛讲者            2023年03月，湖南省长沙天心区经济开发区管理委员会园区顾问            2023年02月，中国计算机学会2022年度CCF杰出演讲者—DSP三星讲者            2023年02月，机械工业出版社专家委员会成员           2023年01月，湖南省科学技术馆首席专家顾问2022年：           制定专病数据库建库和应用标准-《专科疾病标准数据集建设规范》标准链接；            2022年11月，湖南省元宇宙产业创新联盟联合发起人、联席理事长                 2022年11月，全国高校人工智能与大数据创新联盟元宇宙专业委员会副主任委员            2022年10月至今，中国计算机学会开源发展委员执行委员           2022年10月至今，中国计算机学会计算艺术分会执行委员            2022年10月至今，中国计算机学会科学普及工作委员会执行委员            2022年10月至今，中国计算机学会标准工作委员会执行委员            2022年10月12日至今，全国高校人工智能与大数据创新联盟元宇宙专委会副主任            2022年9月23日-25日，第十八届全国高性能计算学术年会 (简称CCF HPCChina2022)，济南，大会特邀报告             2022年8月25日-28日，湖南省医师协会放射医师年会，长沙，大会特邀报告             2022年8月21日-23日，International Conference on Internet of Things, Communication and Intelligent Technology，Keynote Speaker            2022年7月，中国计算机应用大会（CCF NCCA 2022）大会监督委员会主席            2022年07月25日，第八届全国计算生物学与生物信息学学术会议（NCCBB），广州，大会特邀报告            2022年7月23日，2022未来计算机教育峰会(FCES 2022 )，苏州，论坛报告            2022年7月2日，湖南省医学会放射学专业委员会第二十四届年会，长沙，大会特邀报告            2022: InternationalConference on Internet of Things, Communication and Intelligent Technology (GeneralChairs大会主席), http://www.iotcit.org/committee/            2022: 4thInternational Conference on Blockchain Technology(第四届区块链技术国际会议) (Confernece Co-Chairs 大会联合主席), http://www.icbct.org/com.html2021年：2021.12.28: The 11th International Conference on Image and Graphics (ICIG) ，Symposium: Big Data Analysis and Modeling for the Brain Atlas, invited talk         2021.12.27: CCF中国区块链技术大会（CCF CBCC2021），大会特邀报告        2021.12.26: CCF第十一届太湖论坛——自主可控高性能与智能计算大会, 大会特邀报告2021.12.09：2021年智慧康养职业技术教育国际学术研讨会，主题报告2021.11.26：ISBRA 2021 : International Symposium on Bioinformatics Research and Applications, Keynote Talk （第17届生物信息学研究与应用国际研讨会，大会报告）2021.10.26：第十届全国生物信息学与系统生物学学术大会/大会报告2021：“如何利用人工智能实现医疗影像多病种识别并进行辅助诊疗？”入选2021中国科协十大工程技术难题2021：第四届区块链技术国际会议(The 2022 4th International Conference on Blockchain Technology, ICBCT 2022)大会联合主席2021.7.31：第七届中国中医药信息大会主旨演讲2021.7.16：第七届全国计算生物学与生物信息学学术会议程序委员会主席/大会特邀报告2021.6.15：健康医疗大数据中国50人2021.5- 中国生物工程学会计算生物学与生物信息学专业委员会副主任  2021：中国通信工业协会区块链专业委员会终身副主任委员；2021：吴文俊人工智能科学技术奖十周年颁奖盛典暨2020中国人工智能产业年会杰出贡献者2020年：制定国内人工智能诊疗标准-《智能医疗影像辅助诊断系统技术要求和测试评价方法》标准链接；    IEEE EDGE 2020: IEEE International Conference on Edge Computing (CCF C区国际会议) Program                        Committee   ICPADS 2020: International Conference on Parallel and Distributed Systems (CCF C区国际会议) TPC                    Committee of the System Track            2020：湖南省人工智能协会专家委员会副主任2020.6.12-14：第七届全国计算生物学与生物信息学暨国际人工智能与生物医学信息学学术会议大会程序委员2019年：2020-2022：中国计算机学会（CCF）第十二届理事会理事2019.12.27-28：济南国际超级计算产业博览会“超算产业分论坛”特邀嘉宾（报告题目：医疗大数据驱动下的智慧医疗-AI辅助诊疗、边缘计算、区块链等）2019.10.17：CNCC-“大数据时代下的智能计算”论坛讲者2019.10.17：CNCC-“生命在于计算——CCF生物信息专委分论坛”主席2019.10.19-20：第一届全国生物信息与传染病交叉论坛特邀讲者2019.9.11-13：OFweek2019中国智慧医疗产业大会医疗人工智能专场主持人和报告人2019.9.9-11：2019世界计算机大会“新型计算：再造数字经济活力”特邀讲者            2019: 2019世界计算机大会 \"新型计算：再造数字经济活力\" 论坛特邀讲者2019: 2019 CCF青年精英大会（YEF 2019）“深度学习技术如何推动产业升级”论坛特邀讲者2019.3-2022.3: 上海健康医学院双加应急医学救援技术研究院人工智能与超算专家APBC 2019: The 17th Asia Pacific Bioinformatics Conference (CCF C区国际会议) PC Committee Chairs2018年：2018.12-2022.12：湖南省神经科学学会第二届委员会常务理事2018-至今：鹏城实验室智慧医疗子课题负责人2018：新一代人工智能院士高峰论坛智慧医疗论坛特邀嘉宾2018-至今：中国老年医学学会智慧医疗技术与管理分会会长2018：CNCC-“E级超算——E级计算时代下的HPC与AI融合之路”论坛主席2018：中国计算机学会（CCF） Young Elite Forum“科技创业秀”特邀评委2018：CNCC-“面向E级超级计算机的应用算法与软件”论坛讲者2018：HPC China 2018 第十四届全国高性能计算学术年会大会特邀演讲者2018：新华小记者湖南顾问委员会科普教育高级导师2017年：2017-至今：湖南省生物信息学会（一级学会）理事长2017：第2届中国计算机学会生物信息学会议程序委员会主席2017-至今：CCF YOCSEF总部AC委员2017：2017中国大数据技术大会组委会主席2017：CCF CNCC 2017“HPC+AI”论坛主席2017：CCF CNCC 2017“第",
  "content_length": 85881,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:30"
}