{
  "name": "Shaojie Zhang 0001",
  "homepage": "http://www.cs.ucf.edu/~shzhang",
  "status": "success",
  "content": "Shaojie Zhang's Homepage Shaojie Zhang Professor Department of Computer Science University of Central Florida Office: HEC 311 (building 116) Office Hours (Summer 2022): by appointments Phone: (407) 823-6095 Fax: (407) 823-5835 E-mail: shzhang(at)cs.ucf.edu My research group: Computational Biology and Bioinformatics Group Street Address (UPS, FedEx delivery): 4328 Scorpius Street Building 116 - Room 346 Orlando, FL 32816-2362 Postal Address: Department of Computer Science University of Central Florida 4000 Central Florida Blvd PO Box 162362 Orlando, FL 32816-2362 Educational Background: Ph.D., Computer Science, University of California, San Diego, 2007 (Advisor: Vineet Bafna) M.Eng., Information Engineering, Nanyang Technological University, 2001 B.S., Computer Science, Peking University, 1997 Research Interests: Computational biology, bioinformatics, and algorithms, particularly: RNA structural motifs Non-coding RNA discovery and RNA genomics RNA biology Comparative and computational genomics Biological sequence analysis Molecular and genome evolution Computational genetics Metagenomics Computational transcriptomics and epigenetics Combinatorial algorithms and approximation algorithms Netlist analysis Bioinformatics Tools Developed:Software Packages Teaching: CAP5510 Introduction of Bioinformatics COT5405 Design and Analysis of Algorithms COT3100 Intro to Discrete Structures CAP6515 Algorithms in Computational Biology CAP6517 Computational Genomics CAP4543 Introduction to Bioinformatics Algorithms Current Group Members: Yuan Wei (Postdoc) Ahsan Sanaullah (Postdoc) Nabila Khan (Ph.D. student) Pramesh Shakya (Ph.D. student) Arun Deegutla (Undergraduate student) Graduated Ph.D. Students: Yuan Li (2007-2012), Ph.D. 2012, Final Defence: Summer 2012, Dissertation Title: \"Computational Methods For Analyzing RNA Folding Landscapes And Its Applications\", From October 2012 Engineer II, Algorithms. at Pacific BioSciences Cuncong Zhong (2007-2013), Ph.D. 2013, Final Defense: Summer 2013, Dissertation Title: \"Computational methods for comparative non-coding RNA analysis: from structural motif identification to genome-wide functional classification\" (2013-14 College Outstanding Dissertation Award), From September 2013 Post Doctoral Fellow at the J. Craig Venter Institute, Now an Assistant Professor at the Universtiy of Kansas. Ping Ge (2012-2016), Ph.D. 2016, Final Defense: Spring 2016, Dissertation Title: \"Computational Methods for Comparative Non-coding RNA Analysis: from Secondary Structures to Tertiary Structures\"; First Job: Scientist at Advanced Cell Diagnostics. Gene Sher (2013-2017), Ph.D. 2017 (Co-Chair: Damian Dechev), Final Defense: Summer 2017, Dissertation Title: \"Data Representation in Machine Learning Methods with its Application to Compilation Optimization and Epitope Prediction\"; First Job: SMART Fellowship. Travis Meade (2014-2017), Ph.D. 2017 (Co-Chair: Yier Jin), Final Defense: Fall 2017, Dissertation Title: \"Novel Computational Methods for Integrated Circuit Reverse Engineering\"; First Job: UCF, Lecturer. Ardalan Naseri (2013-2018), Ph.D. 2018, Final Defense: Fall 2018, Dissertation Title: \"Analysis of large-scale population genetic data using efficient algorithms and data structures\"; First Job: UTHealth, Postdoc/Scientist Shahidul Islam (2013-2020), Ph.D. 2020, Final Defense: Summer 2020, Dissertation Title: \" Computational methods for discovery and analysis of RNA structure motifs\"; First Job: Assistant Professor, California State University, Monterey Bay Xiaoli Chen Ph.D., Fall 2021 Mahfuzur Rahaman Ph.D., Summer 2025 Kecong Tang Ph.D., Summer 2025 Yuan Wei Ph.D., Summer 2025 Ahsan Sanaullah Ph.D., Spring 2023 James Geist Ph.D., Spring 2023 Graduated M.S. Students: Dan DeBlasio (2007-2010), M.S. 2009 by Thesis, Master's Thesis Title: \"New Computational Approaches to Multiple RNA Alignment and RNA Search\", Now at the University of Arizona Computer Science Ph.D. Program Matt Finch (M.S. 2010 by Courses) Erik Ladewig (M.S. 2010 by Courses, Now in Columbia University's Computational Biology Ph.D. Program) Albert Steppi (M.S. 2013 by Courses, Now at Florida State University Biostatistics Ph.D. Program) Joshua Burbridge (M.S. 2015 by Thesis, Master's Thesis Title: \"Finding Consensus Energy Folding Landscapes Between RNA Sequences\", now at the University of Arkansas Computer Science Ph.D. Program) Brook Stacy (M.S. 2017 by Courses, Research Assistant Oct 2014 - Aug 2015, Aug 2016 - May 2017, Starting Fall 2017 join in the University of Maryland College Park Computer Science Ph.D. Program) Michael Kirsche M.S. 2016 by Courses, Research Assitant Aug 2016 - May 2017, Starting Fall 2017 join in Johns Hopkins Universtiy Computer Science Ph.D. Program) Graduated B.S. Students: Peter Tonner (Undergraduate Researcher, RAMP Scholar, B.S. 2012, Duke University Computational Biology & Bioinformatics Ph.D. Program) Jacob Martinek (B.S. 2015 Honors in the Major Thesis Title: \"Improving fMRI Classification Through Network Deconvolution\") Other Former Group Members at UCF: Joshua Keller (Undergraduate researcher, EXCEL URE program, Jan 2013 - May 2014) Erwin Holzhauser (Undergraduate researcher, EXCEL URE program, Jan 2013 - May 2014) Ryan Villaflores (EXCEL URE program, Jan-May 2014) Brook Stacy (Undergraduate researcher, Summer 2014) Jason Portillo (Undergradute student, Fall 2018 - Spring 2019) John Hacker (Undergradute student, Fall 2018 - Spring 2019) UCF CS PhD applicants to my group should have strong algorithm development and programming skills (C/C++/Java and Perl/Python) and strong interest in biology. But no biology knowledge is required. We are interested in solving biological problems through algorithmic approaches. Please apply for admission first and indicate you are interested in my research in your statement. Please get in touch by sending email to shzhang at cs.ucf.edu after getting admitted by the UCF CS PhD program. Selected Publications (Google Scholar, ORCID): Ardalan Naseri, Xiaoming Liu, Kecong Tang, Shaojie Zhang*, and Degui Zhi*. \"RaPID: ultra-fast, powerful, and accurate detection of segments identical by descent (IBD) in biobank-scale cohorts\". Genome biology, 20(1), 143, 2019. Full text Ardalan Naseri, Erwin Holzhauser, Degui Zhi*, and Shaojie Zhang*. \"Efficient haplotype matching between a query and a panel for genealogical search\". Bioinformatics, 35(14), i233-i241, 2019. (ISMB 2019)Full text Ardalan Naseri, Degui Zhi, and Shaojie Zhang*. \"Multi-allelic positional Burrows-Wheeler transform\". BMC bioinformatics, 20(11), 279, 2019. Full text Cuncong Zhong and Shaojie Zhang. \"Accurate and Efficient Mapping of the Cross-Linked microRNA-mRNA Duplex Reads.\" iScience, 18, 11-19, 2019. (RECOMB-Seq 2019) Full text Hanhui Ma, Li-Chun Tu, Yu-Chieh Chung, Ardalan Naseri, David Grunwald, Shaojie Zhang, and Thoru Pederson. \"Cell cycle - and genomic distance - dependent dynamics of a discrete chromosomal region.\" Journal of Cell Biology, jcb-201807162, 2019. Full text Xiaoli Chen, Sarah A. Castro, Qiuying Liu, Wenqian Hu, Shaojie Zhang*. \"Practical considerations on performing and analyzing CLIP-seq experiments to identify transcriptomic-wide RNA-Protein interactions.\" Methods, 155, 49-57, 2019. Full text Hanhui Ma, Li-Chun Tu, Ardalan Naseri, Yu-Chieh Chung, David Grunwald, Shaojie Zhang, and Thoru Pederson. \"CRISPR-Sirius: RNA scaffolds for signal amplification in genome imaging\". Nature Methods, 15, 928--931, 2018. Full text Travis Meade, Kaveh Shamsi, Thao Le, Jia Di, Shaojie Zhang, and Yier Jin. \"The Old Frontier of Reverse Engineering: Netlist Partitioning.\" Journal of hardware and Systems Security (HASS), 2(3), 201-213, 2018. Full text Ping Ge, Shahidul Islam, Cuncong Zhong, Shaojie Zhang*; \"De novo discovery of structural motifs in RNA 3D structures through clustering\", Nucleic Acids Research, 09 March 2018, gky139. Full text Ardalan Naseri, Degui Zhi and Shaojie Zhang*, \"Multi-allelic positional burrows-wheeler transform\", IEEE 7th International Conference on Computational Advances in Bio and Medical Sciences (ICCABS), 2017. Full text, Source Code Shahidul Islam, Ping Ge, and Shaojie Zhang*. \"CompAnnotate: A comparative approach for RNA base-pair annotation\". Nucleic Acids Research. 2017, 45(14):e136. Full text, Source Code Xu Zhang, Xiaoli Chen, Qiuying Liu, Shaojie Zhang, Wenqian Hu. \"Translation repression via modulation of the cytoplasmic poly(A)-binding protein in the inflammatory response\". eLife. 2017, 6:e27786. Full text Gene Sher, Degui Zhi, and Shaojie Zhang. \"DRREP: deep ridge regressed epitope predictor\". BMC Genomics. 2017, 18(Suppl 6):676. Full text, Source Code Bongyong Lee, Anupama Sahoo, John Marchica, Erwin Holzhauser, Xiaoli Chen, Jian-Liang Li,Tatsuya Seki, Subramaniam Shyamala Govindarajan, Fatu Badiane Markey, Mona Batish, Sonali J. Lokhande, Shaojie Zhang, Animesh Ray, and Ranjan J. Perera, \"The long noncoding RNA SPRIGHTLY acts as an intranuclear organizing hub for pre-mRNA molecules\", Science Advances, 03 May 2017, Vol. 3, no. 5, e1602505. Full text Ardalan Naseri, Xiaoming Liu, Shaojie Zhang* and Degui Zhi*, \"Ultra-fast Identity by Descent Detection in Biobank-Scale Cohorts using Positional Burrows-Wheeler Transform\", Annual International Conference on Research in Computational Molecular Biology (RECOMB), 2017. Full text, Source Code Travis Meade, Zheng Zhao, Shaojie Zhang, David Pan, and Yier Jin, \"Revisit Sequential Logic Obfuscation: Attacks and Defenses,\" IEEE International Symposium on Circuits and Systems (ISCAS), 2017. Full text Travis Meade, Shaojie Zhang, and Yier Jin, \"IP protection through gate-level netlist security enhancement\", Integration, the VLSI Journal, Available online 5 November 2016. Full text Hanhui Ma, Li-Chun Tu, Ardalan Naseri, Maximiliaan Huisman, Shaojie Zhang, David Grunwald, and Thoru Pederson, \"CRISPR-Cas9 nuclear dynamics and target recognition in living cells\", Journal of Cell Biology, August 22, 2016. Full text Erwin Holzhauser, Ping Ge",
  "content_length": 19635,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:30"
}