{
  "name": "Shaogang Gong",
  "homepage": "http://www.eecs.qmul.ac.uk/~sgg",
  "status": "success",
  "content": "Shaogang Gong Professor Shaogang Gong FREng, FIEE, DPhil (Oxon) School of Electronic Engineering and Computer Science Queen Mary University of London London E1 4NS, United Kingdom Tel: +44 (0)20-7882 5249 Fax: +44 (0)20-7882 7064 Email: s.gong AT qmul.ac.uk Sean Gong is Professor of Visual Computation at Queen Mary University of London. He established the Queen Mary Computer Vision Laboratory in 1993 and has enjoyed immensely working with PhD students and postdoctoral researchers. His research is in Computer Vision and Machine Learning (Google Scholar, DBLP, Research.com), with a focus on Object Recognition, Action Recognition, and Video Analysis. His brief bio, publications with pdf download, and guide to PhD study. BOOKS Shaogang Gong, Marco Cristani, Shuicheng Yan, Chen Change Loy (Eds.). Person Re-Identification, Springer, January 2014. Caifeng Shan, Fatih Porikli, Tao Xiang, Shaogang Gong (Eds.). Video Analytics for Business Intelligence, Springer, March 2012. Shaogang Gong, Tao Xiang. Visual Analysis of Behaviour: From Pixels to Semantics, Springer, May 2011. Shaogang Gong, Stephen J. McKenna, Alexandra Psarrou. Dynamic Vision: From Images to Face Recognition, Imperial College Press, June 2000. S. Kevin Zhou, Wenyi Zhao, Xiaoou Tang, Shaogang Gong (Eds.). Analysis and Modelling of Faces and Gestures, Springer, October 2007. Wenyi Zhao, Shaogang Gong, Xiaoou Tang (Eds.). Analysis and Modelling of Faces and Gestures, Springer, October 2005. Shaogang Gong, Hong-Jiang Zhang, Stan Li, Andrew Senior, Thomas Vetter, Wenyi Zhao (Eds.). Analysis and Modelling of Faces and Gestures, IEEE Computer Society, October 2003. SPECIAL ISSUES 2021 IEEE Transactions on Circuits and Systems for Video Technology Special Issue on \"Large-Scale Visual Sensor Networks: Architectures and Applications\", Vol. 31, No. 4; Paolo Spagnolo, Hamid Aghajan, George Bebis, Shaogang Gong, Amy Loutfi, Leonid Sigal, Wei-Shi Zheng. Editorial: Introduction to Large-Scale Visual Sensor Networks: Architectures and Applications, Vol. 31, No. 4, pp. 1249-1252, April 2021. 2017 Computer Vision and Image Understanding Special Issue on \"Image and Video Understanding in Big Data\", Vol. 156; Vittorio Murino, Shaogang Gong, Chen Change Loy, Loris Bazzani. Editorial: Image and Video Understanding in Big Data, Vol. 156, pp. 1-3, March 2017. 2002 Image and Vision Computing Special Issue on \"Understanding Visual Behaviour\", Vol. 20, No. 12; Shaogang Gong, Hilary Buxton. Editorial: Understanding Visual Behaviour, Vol.20, No.12, pp. 825-826, October 2002. WORKSHOPS 2019 IEEE International Conference on Computer Vision (ICCV), Second International Workshop and Challenge on Real-World Face and Object Recognition from Low-Quality Images and Videos (FOR-LQ), Seoul, Korea, October 2019. 2019 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Second International Workshop on Target Re-identification and Multi-Target Multi-Camera Tracking, Long Beach, CA, USA, June 2019. 2017 IEEE International Conference on Computer Vision (ICCV), First International Workshop on Cross-Domain Human Identification (CHI), Venice, Italy, October 2017. 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), First International Workshop on Target Re-Identification and Multi-Target Multi-Camera Tracking, Honolulu, USA, July 2017.2014 European Conference on Computer Vision (ECCV), International Workshop on Surveillance and Re-Identification, Zurich, Switzerland, September 2014.2012 European Conference on Computer Vision (ECCV), First International Workshop on Person Re-Identification, Florence, Italy, October 2012. RECENT PUBLICATIONS (full listing with pdf download) Jian Hu, Zixu Cheng, Shaogang Gong, Isabel Guan, Jianye Hao, Jun Wang, Kun Shao. \"Uncertainty-quantified Rollout Policy Adaptation for Unlabelled Cross-domain Temporal Grounding\". In Proc. Advances in Neural Information Processing Systems, San Diego, California, USA, December 2025. Jiayi Lin, Shitong Sun, Shaogang Gong. \"GridCLIP: One-Stage Object Detection by Grid-Level CLIP Representation Learning\". Pattern Recognition, Vol. 171, Part B, pages 112187, March 2026. Qilei Li, Shitong Sun, Weitong Cai, Shaogang Gong. \"Leverage Cross-domain Variations for Generalizable Person ReID Representation Learning\". Pattern Recognition, Vol. 171, Part B, pages 112292, March 2026. Ruiyang Ha, Songyi Jiang, Ben Li, Bikang Pan, Yihang Zhu, Junjie Zhang, Xiatian Zhu, Shaogang Gong, Jingya Wang. \"Multi-modal Multi-platform Person Re-Identification: Benchmark and Method\". In Proc. IEEE International Conference on Computer Vision, Honolulu, Hawaii, October 2025 (https://mp-reid.github.io). Jian Hu, Shaogang Gong, Weitong Cai, Junchi Yan. \"Class-Aware Diversified Augmentation for Open-Set Single Domain Generalization\". IEEE Transactions on Multimedia, 2025. Xiaoyu Zheng, Xu Chen, Shaogang Gong, Xavier Griffin, Greg Slabaugh. \"XFMamba: Cross-Fusion for Multi-View Medical Image Classification\". In Proc. International Conference on Medical Image Computing and Computer Assisted Intervention, Daejeon, Korea, September 2025. Jian Hu, Zixu Cheng, Shaogang Gong. \"INT: Instance-Specific Negative Mining for Task-Generic Promptable Segmentation\". In Proc. International Joint Conference on Artificial Intelligence, Montreal, Canada, August 2025. Yu Cao, Zengqun Zhao, Ioannis Patras, Shaogang Gong. \"Temporal Score Analysis for Understanding and Correcting Diffusion Artifacts\". In Proc. IEEE Conference on Computer Vision and Pattern Recognition, Nashville, TN, June 2025 (https://yucao16.github.io/ASCED/). Zengqun Zhao, Ziquan Liu, Yu Cao, Shaogang Gong, Ioannis Patras. \"AIM-Fair: Advancing Algorithmic Fairness via Selecting Fine-Tuning Biased Models with Contextual Synthetic Data\". In Proc. IEEE Conference on Computer Vision and Pattern Recognition, Nashville, TN, June 2025 (https://zengqunzhao.github.io/AIMFair). Weitong Cai, Jiabo Huang, Shaogang Gong, Hailin Jin, Yang Liu. \"MLLM as video narrator: Mitigating modality imbalance in video moment retrieval\". Pattern Recognition, Vol. 166, pages 111670, April 2025. Dezhao Luo, Shaogang Gong, Jiabo Huang, Hailin Jin, Yang Liu. \"Generative Video Diffusion for Unseen Novel Semantic Video Moment Retrieval\". In Proc. AAAI Conference on Artificial Intelligence, Philadelphia, March 2025. Jiayi Lin, Jiabo Huang, Jian Hu, Shaogang Gong. \"InvSeg: Test-Time Prompt Inversion for Semantic Segmentation\". In Proc. AAAI Conference on Artificial Intelligence, Philadelphia, March 2025 (https://jylin8100.github.io/InvSegProject/). Zengqun Zhao, Yu Cao, Shaogang Gong, Ioannis Patras. \"Enhancing Zero-Shot Facial Expression Recognition by LLM Knowledge Transfer\". In Proc. IEEE Winter Conference on Applications of Computer Vision, Tucson, Arizona, February 2025. Shitong Sun, Chenyang Si, Guile Wu, Shaogang Gong. \"Federated zero-shot learning with mid-level semantic knowledge transfer\". Pattern Recognition, Vol. 156, pages 110824, December 2024. Jian Hu, Jiayi Lin, Junchi Yan, Shaogang Gong. \"Leveraging Hallucinations to Reduce Manual Prompt Dependency in Promptable Segmentation\". In Proc. Advances in Neural Information Processing Systems, Vancouver, December 2024 (https://lwpyh.github.io/ProMaC/). Yu Cao, Shaogang Gong. \"Few-Shot Image Generation by Conditional Relaxing Diffusion Inversion\". In Proc. European Conference on Computer Vision, Milan, October 2024 (https://yucao16.github.io/CRDI/). Zixu Cheng, Yujiang Pu, Shaogang Gong, Parisa Kordjamshidi, Yu Kong. \"SHINE: Saliency-aware Hierarchical Negative Ranking for Compositional Temoral Grounding\". In Proc. European Conference on Computer Vision, Milan, October 2024 (https://github.com/zxccade/SHINE). Guan'an Wang, Xiaowen Huang, Shaogang Gong, Jian Zhang, Wen Gao. \"Faster Person Re-Identiﬁcation: One-shot-Filter and Coarse-to-Fine Search\". IEEE Transactions on Pattern Analysis and Machine Intelligence, Vol. 46, No. 5, pp. 3013-3030, May 2024. DATASETS Person Re-ID, Vehicle Re-ID, and Face Recognition Datasets: Native Unconstrained Low-Resolution Face Dataset (TinyFace), 169,403 face images of 5,139 identities in native low-resolution (not down-sampled) with average size of 20×16 pixels for 1:N face recognition algorithm evaluation, collected from public web data across a large variety of uncontrolled viewing conditions in pose, illumination, occlusion and background (ACCV 2018) Vehicle Re-Identification In Context datatset (VRIC), vehicle re-id images from videos of unconstrained resolution, motion blur, illumination, occlusion, and viewpoint, with 60,430 images of 5,622 vehicle identities captured by 60 different cameras at road traffic scenes from both day-time and night-time (GCPR 2018) Surveillance Face Recognition Dataset (QMUL-SurveFace), a large scale surveillance face recognition challenge of native low-resolution face images from surveillance videos, with 463,507 facial images of 15,573 identities (2018 arXiv) iLIDS Video re-IDentification (iLIDS-VID) Dataset (ECCV 2014, PAMI 2016) Mobile Re-identification Platform (MRP) Drone Dataset (ECCV 2014 Workshop on Visual Surveillance and Re-ID) Underground Re-Identification (GRID) Dataset (CVPR 2009, IJCV 2010, PR 2014, IJCAI 2017) QMUL i-LIDS Re-Identification Dataset (\"Associating Groups of People\" (BMVC 2009), \"Relative Distance Comparison\" (CVPR 2011, PAMI 2013), \"Group Association: Assisting Re-Identification by Visual Context\", Person Re-Identification Springer 2014) QMUL i-LIDS Pedestrian Detection Dataset (\"Quantifying Contextual Information for Object Detection\" (ICCV 2009) and \"Quantifying and Transferring Contextual Information in Object Detection\" (PAMI 2012)) QMUL Re-Identification Attribute Labelling (for VIPeR, GRID and PRID datasets) (BMVC 2012, Person Re-Identification Springer 2014) QMUL Multiview Face Dataset (FG 1996, BMVC 1998, Dynamic Vision: From Images to Face Recognition Imperial College Press 2000) Logo Recognition Datasets: QMUL OpenLogo Challenge (\"Open Logo Detection Challe",
  "content_length": 12618,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:30"
}