{
  "name": "Shaowen Bardzell",
  "homepage": "https://shaowenbardzell.com",
  "status": "success",
  "content": "Shaowen Bardzell Skip to content Search for: Press Enter / Return to begin your search. close search form open search form Shaowen Bardzell is a Professor and Chair at Georgia Institute of Technology’s School of Interactive Computing. Previously, she was a professor of information sciences and technology at Penn State College of Information Sciences and Technology, where she was also the “Professor-in-charge” of the human-computer interaction (HCI) faculty group (2020-2023). Before that, she was a Professor of Informatics in the School of Informatics, Computing, and Engineering at Indiana University and an Affiliate Faculty of the Kinsey Institute and the Department of Gender Studies (2018-2020). She was the Vice President at Large (2019-2021) and the Executive Vice President (2021-2022) on the ACM SIGCHI Executive Committee. Bardzell holds a Ph.D. in Comparative Literature from Indiana University and pursues a humanistic research agenda within the research and practice of Human-Computer Interaction (HCI). A common thread throughout her work is the exploration of the contributions of feminism, design, and social science to support technology’s role in social change. Her work is supported by the National Science Foundation, Intel Corporation, and the Mellon Foundation, among others. She is the co-editor of Critical Theory and Interaction Design (MIT Press, 2017) and co-author of Humanistic HCI (Morgan & Claypool, 2015). Bardzell was honored with the ACM SIGCHI Societal Impact Award in 2023 for contributing to developing the feminist HCI and justice/emancipation-oriented computing research agenda in Human-Computer Interaction. In 2024, she was elected to the ACM SIGCHI Academy. Shaowen Bardzell Sign up Log in Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 1857,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:30"
}