{
  "name": "Shaoyi Huang",
  "homepage": "https://www.shaoyihuang.com",
  "status": "success",
  "content": "Shaoyi Huang Shaoyi Huang Openings: I am looking for highly motivated PhD students (will be fully-funded) and remote interns. If you are interested, please send your CV, trasncripts, research interests to shaoyi.hiring@gmail.com Application link: https://www.stevens.edu/program/computer-science-doctoral-program Shaoyi is a tenure-track assistant professor in CS department at Stevens Institute of Technology. She received her PhD degree from the School of Computing at University of Connecticut under the supervision of Prof. Caiwen Ding and Prof. Omer Khan. Her research agenda is grounded in advancing AI systems, including algorithm-system co-design for AI acceleration, emerging deep learning models inference acceleration (i.e., Transformer and LLM), privacy preserving machine learning, and machine learning for EDA. Shaoyi’s work has been published in high-impact conferences such as HPCA, ASPLOS, SC, ICS, DAC, ICCAD, ACL, ICCV, NeurIPS, IJCAI, etc. She was selected as a Machine Learning and Systems Rising Star 2024. She was awarded Marion and Frederick Buckman Engineering Fellowship for outstanding academic achievement in 2024 and both Predoctoral Prize for Research Excellence, GE Fellowship for Excellence from UConn in 2023 and 2022. She was the recipient of Eversource Energy Graduate Fellowship in 2022, Synchrony Fellowship in 2022, and Cigna Graduate Fellowship in 2021. Her work on FPGA-based language models acceleration through sparse attention and dynamic pipelining won DAC'22 Publicity Paper Award. She was invited as a student panelist to share experience with the female researchers and K-12 students at the 6th Workshop for Women in Hardware and Systems Security (WISE). Email  / Google Scholar  / LinkedIn Publications Teaching Team Internship Talks Awards Services Research Interests Efficient machine learning algorithm Algorithm-system co-design for AI acceleration (including emerging deep learning models, such as GNNs, LLMs, Diffusion models, etc.) Large-scale machine learning for chip design Energy efficient privacy preserving machine learning News 10/2025: Invited to serve as a TPC member for DAC 2026. 08/2025: Hengyi joined our group with Provost fellowship. Welcome! 08/2025: Invited to serve as a TPC member for ISQED 2026. 07/2025: One paper is accepted to ECAI 2025. 06/2025: One paper is accepted to ICCAD 2025. 06/2025: Invited to serve as a TPC member for DATE 2026. 06/2025: One paper is accepted to ICML MAS 2025. Congrats to Zhendong! 05/2025: Invited to serve as a TPC member for IEEE SOCC 2025. 05/2025: One proposal is awarded by NSF NAIRR Pilot as a Co-PI. Thanks for the support from NSF, DOE, AWS, and OpenAI! 04/2025: Zhendong is selected as a DAC 2025 Young Fellow. Congratulations! 04/2025: Invited to serve as a TPC member for ICCAD 2025. 04/2025: One paper is accepted to ICS 2025. See you in Salt Lake City! 04/2025: One proposal is awarded by NSF NAIRR Pilot. Thanks for the support from NSF, DOE, AWS, and SambaNova! 02/2025: Awarded the Google Cloud Research Credits Program. 02/2025: Invited to serve as a TPC member for IEEE COINS 2025. 01/2025: Awarded the OpenAI Researcher Access Program. 01/2025: Invited to serve as a panelist on the NSF Panel. 12/2024: Invited to be a keynote speaker of GenAI@Edge Symposium at the AAAI 2025 Spring Symposium. 12/2024: Invited to be a speaker of HackMHS at Millburn High School in Millburn, New Jersey. Looking forward to discussing with the hackers! 11/2024: One proposal is funded by Stevens Bridging Program as PI. Thanks for the generous support from Stevens! 11/2024: Glad to be invited as a speaker at The 3rd Women in Quantitative Finance Americas Conference. Looking forward to connecting with people in Quantitative Finance! See you in New York City! 11/2024: One poster is accepted to NSF AI for EDA Workshop at NeurIPS 2024, congratulations to my students and interns, Zhendong, Renming and Haowen! 11/2024: Invited to serve as a TPC member for ISQED 2025. 11/2024: I will give a mini-TED talk at WISE 2024. 11/2024: Invited to serve as Program Committee Track Chair for IEEE Cloud Summit 2025. 10/2024: I will serve as a session chair for ICCAD 2024. 10/2024: Invited to serve as a TPC member for DAC 2025. 09/2024: Invited to serve as a Guest Editor of Special Issue, High-Performance Computing for AI: Architecture, Systems, and Algorithm. 09/2024: Invited to serve on the 2024 WISE organizing committee. See u in IBM T.J. Watson Research Center, New York. 09/2024: Shaoyi joined Stevens CS department. 08/2024: Invited to join the Program Committee of IPDPS’25 - the 39th IEEE International Parallel & Distributed Processing Symposium. 05/2024: Honored to be selected as a Machine Learning and Systems Rising Star 2024, see u in NVIDIA, Santa Clara, CA. 05/2024: Glad to volunteer at NSF IUCRC Center for Hardware and Embedded Systems Security and Trust (CHEST). 05/2024: Honored to receive Marion and Frederick Buckman Engineering Fellowship for outstanding academic achievement from the School of Computing. 04/2024: Invited to write an article for ACM Sigda newsletter \"what is column\". 10/2023: One paper was accepted to ASPLOS 2024. 10/2023: One paper was accepted to HPCA 2024. 10/2023: Received travel grant from CACC. Thanks, CACC! 09/2023: Honored to be invited to be the student panelist and to receive the student travel grant from WISE 2023. 09/2023: One proposal on Efficient Multi-party Computation-based Private Inference was accepted to WISE 2023 (The 6th Workshop for Women in Hardware and Systems Security). 09/2023: One paper was accepted to NeurIPS 2023. 09/2023: Honored to be invited to give a guest lecture at the University of Rochester. 09/2023: Invited to serve as a PC member for SDM 2024. 09/2023: Honored to present at TechCon organized by Semiconductor Research Corporation (SRC). See u in Austin. 07/2023: One paper was accepted to ICCAD 2023. 07/2023: One paper was accepted to ICCV 2023. 07/2023: Invited to serve as a PC member for AAAI 2024. 06/2023: Received the GE Fellowship for Excellence from UConn School of Engineering. 05/2023: Honored to give a talk and a poster presentation at Semiconductor Research Corporation (SRC) AIHW & CADT Annual Review in IBM Research. See u in San Jose. 05/2023: Received the Predoctoral Prize for Research Excellence from UConn CSE. 03/2023: Honored to be invited to give a talk at MLNLP. 03/2023: One paper was accepted to IJCAI 2023. 03/2023: Two papers on sparse training were accepted to DAC 2023. See u in San Francisco. 01/2023: Invited to serve as a reviewer for the First Workshop on DL-Hardware Co-Design for AI Acceleration at AAAI 2023. 12/2022: Invited to serve as a PC member for KDD 2023. 08/2022: Received the GE Fellowship for Excellence from the School of Engineering. Thanks for the support! 07/2022: Invited to serve as a PC member for AAAI 2023. 07/2022: Received the Synchrony Fellowship from Connecticut Advanced Computing Center. Thanks, CACC! 05/2022: Started to work at TikTok (ByteDance) as a research intern. 05/2022: Received the Predoctoral Prize for Research Excellence from UConn CSE. 05/2022: Received the Eversource Energy Graduate Fellowship from Eversource Energy Center. Thanks, Eversource! 04/2022: Our DAC 22 paper “A Length Adaptive Algorithm-Hardware Co-design of Transformer on FPGA Through Sparse Attention and Dynamic Pipelining” was recognized as a Publicity Paper. 02/2022: One paper was accepted to ACL 2022. 02/2022: One paper was accepted to DAC 2022. 02/2022: One paper was accepted to ISQED 2022. 08/2021: Received the Cigna Graduate Fellowship from UConn CSE. Thanks, Cigna! 07/2021: One paper was accepted to ICCAD 2021. 06/2021: One paper was accepted to SC 2021. 04/2021: Three papers were accepted to GLSVLSI 2021. 02/2021: One paper was accepted to ISQED 2021. Selected Publications Full publication list 2024 MaxK-GNN: Towards Theoretical Speed Limits for Accelerating Graph Neural Networks Training H. Peng, X. Xie, K. Shivdikar, M. A. Hasan, J. Zhao, S. Huang, O. Khan, D. Kaeli, C. Ding [ASPLOS 2024] Paper PruneGNN: An Optimized Algorithm-Hardware Framework for Graph Neural Network Pruning D. Gurevin, M. Shan, S. Huang, M. A. Hasan, C. Ding, O. Khan [HPCA 2024] Paper (Acceptance rate: 75/410=18.3%) 2023 Dynamic Sparse Training via Balancing the Exploration-Exploitation Trade-off S. Huang, B. Lei, D. Xu, H. Peng, Y. Sun, M. Xie, C. Ding [DAC 2023] Paper (Acceptance rate: 263/1156=22.7%) Neurogenesis Dynamics-inspired Spiking Neural Network Training Acceleration S. Huang, H. Fang, K. Mahmood, B. Lei, N. Xu, B. Lei, Y. Sun, D. Xu, W. Wen, C. Ding [DAC 2023] Paper (Acceptance rate: 263/1156=22.7%) AutoReP: Automatic ReLU Replacement for Fast Private Network Inference H. Peng*, S. Huang*, T. Zhou*, W. Wen, X. Xu, C. Ding, et al. [ICCV 2023] Paper / Code (Acceptance rate: 26.8%) Towards Lossless Head Pruning through Automatic Peer Distillation for Large Language Models B. Li, Z. Wang, S. Huang, M. Bragin, J. Li, C. Ding [IJCAI 2023] Paper (Acceptance rate: 15%) Accel-GCN: High-Performance GPU Accelerator Design for Graph Convolution Networks X. Xie, H. Peng, A. Hasan, S. Huang, J. Zhao, H. Fang, W. Zhang, T. Geng, O. Khan, C. Ding [ICCAD 2023] Paper / Code LinGCN: Structural Linearized Graph Convolutional Network for Homomorphically Encrypted Inference H. Peng, R. Ran, Y. Luo, J. Zhao, S. Huang, K. Thorat, T. Geng, C. Wang, X.lin Xu, W. Wen, C. Ding [NeurIPS 2023] Paper / Code (Acceptance rate: 26.1%) 2022 Sparse Progressive Distillation: Resolving Overfitting under Pretrain-and-Finetune Paradigm S. Huang, D. Xu, I. E. Yen, S. Chang, B. Li, C. Ding, et al. [ACL 2022] Paper / Code (Acceptance rate: 714/3350=21.3%) In collaboration with Moffett AI A Length Adaptive Algorithm-Hardware Co-design of Transformer on FPGA Through Sparse Attention and Dynamic Pipelining H. Peng*, S. Huang*, S. Chen, B. Li, T. Geng, A, Li, W. Jiang, W, Wen, J, Bi, H. Liu, C. Ding [DAC 2022] Paper Publicity paper award Towards Sparsifi",
  "content_length": 15243,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:31"
}