{
  "name": "Shaolei Ren",
  "homepage": "https://shaoleiren.github.io",
  "status": "success",
  "content": "Shaolei Ren E-mail: shaolei@ucr.edu I am an Associate Professor of Electrical and Computer Engineering at the University of California, Riverside, where I am also a cooperating faculty member in the Computer Science and Engineering department. My research broadly focuses on AI, systems, and society, striving to build a resilient, safe and healthy future. Towards this goal, I study both algorithmic foundations and empirical methodologies, centered on: Reliable AI-augmented decision making: Infusing domain knowledge to robustify machine learning predictions for reliable decision making in highly dynamic, uncertain, and/or adversarial environments (SIGMETRICS’25, SIGMETRICS’24, SIGMETRICS’22b, NeurIPS’25, NeurIPS’24a, NeurIPS’23a, NeurIPS’23b, ICML’23a, ICLR’24) Health-informed AI: Quantifying and minimizing the public health impact of AI data centers and leveraing AI to improve public health (Harvard Business Review, IEEE Spectrum, Federation of American Scientists). More results will be posted soon! Efficient AI and data centers: Developing principled methodologies to measure and minimize AI’s resource usage and lifecycle footprint (Communications of the ACM, e-Energy’24a, e-Energy’24b, ASPLOS’24, SIGMETRICS’22a, CPAL’25, DAC’22, tinyML’22, IEEE Spectrum, OECD AI) Safe AI: Safeguarding AI from malicious and adversarial exploitation (NeurIPS’24b, ICLR’24, ICML’23b, ICCAD’22) AI fairness: Building responsible AI to tackle societal challenges (ICML’24, Communications of the ACM, e-Energy’24c, Harvard Business Review) I received the 2015 NSF CAREER award and paper awards from multiple conferences, including ACM e-Energy 2024 and 2016, the flagship conference of the ACM SIG on Energy Systems and Informatics. I have also writen semitechnical articles for multiple magzines and organizations such as Harvard Business Review (1, 2), IEEE Spectrum (1, 2), and OECD AI Policy Observatory (1, 2). Occasionally, I share my research findings on policy forums, public events and media, such as expert panels organized by US Government Accountability Office, UN Trade and Development, UN Environment Programme, MIT Technology Review, AP (1, 2), WSJ (1, 2, 3), Bloomberg (1, 2, 3), CNN (1, 2), NBC (1, 2), CNBC (1, 2), NPR (1, 2), and BBC (1, 2, 3). I was a speaker at TED AI. to new students Our group is looking for multiple PhD students (in ECE or CS) to work on exciting projects related to machine learning, optimization, efficient AI, or gigawatt-scale data centers. Students with interests in theory, algorithms, or empirical system building are welcome to contact: shaolei@ucr.edu news 09/2025 Our paper \"Fairness-Regularized Online Optimization with Switching Costs\" is accepted by NeurIPS'25. This paper studies robust online decison-making with long-term fairness consideration and is motivated by many real-world applications such as balancing the public health impact of AI data centers across different regions. 09/2025 Our guest article \"The Real Story on AI's Water Use\" is published in IEEE Spectrum and clarifies some key facts of AI's water footprint to facilitate evidence-based public discussions. A longer version is published in OECD AI Policy Observatory. 02/2025 My TED talk is live now! 09/2024 I'm glad to share four recent papers accepted by SIGMETRICS'25 and NeurIPS'24. (1) The SIGMETRICS'25 paper \"Learning-Augmented Decentralized Online Convex Optimization in Networks\" proposes a novel algorithm to provably robustify machine learning predictions for decentralized optimization in networks. (2) The NeurIPS'24 paper \"Bileve: Securing Text Provenance in Large Language Models Against Spoofing with Bi-level Signature\" proposes a novel anti-spoofing watermarking method to safeguard LLM-generated content. (3) The NeurIPS'24 paper \"Online Budgeted Matching with General Bids\" proposes provably-competitive online algorithms for budgeted matching with arbitrary bid sizes. (4) The NeurIPS'24 paper \"Safe Exploitative Play in Stochastic Bayesian Games with Untrusted Type Beliefs\" quantifies the impact of potentially incorrect type beliefs on an agent's payoff in Bayesian games. recent highlights NeurIPS Fairness-Regularized Online Optimization with Switching Costs Pengfei Li, Yuelin Han, Adam Wierman, and Shaolei Ren NeurIPS, 2025 Abstract Bib HTML Fairness and action smoothness are two crucial considerations in many online optimization problems, but they have yet to be addressed simultaneously. In this paper, we study a new and challenging setting of fairness-regularized smoothed online convex optimization with switching costs. We propose FairOBD (Fairness-regularized Online Balanced Descent), which reconciles the tension between minimizing the hitting cost, switching cost, and fairness cost. Concretely, FairOBD decomposes the long-term fairness cost into a sequence of online costs by introducing an auxiliary variable and then leverages the auxiliary variable to regularize the online actions for fair outcomes. Based on a novel approach to account for switching costs, we prove that FairOBD offers a worst-case asymptotic competitive ratio against the optimal offline algorithm with parameterized constraints by considering the problem episode length T\\to∞. Finally, we run trace-driven experiments of dynamic computing resource provisioning for socially equitable AI inference to empirically evaluate FairOBD, showing that FairOBD can effectively reduce the total fairness-regularized cost and better promote fair outcomes compared to existing baseline solutions. @article{Fairness_SOCO_FairOBD_NeurIPS_2025, title = {Fairness-Regularized Online Optimization with Switching Costs}, author = {Li, Pengfei and Han, Yuelin and Wierman, Adam and Ren, Shaolei}, journal = {NeurIPS}, month = {}, year = {2025}, url = {https://neurips.cc/virtual/2025/poster/115291}, } SIGMETRICS Learning-Augmented Decentralized Online Convex Optimization in Networks Pengfei Li, Jianyi Yang, Adam Wierman, and Shaolei Ren SIGMETRICS, 2025 Abstract Bib HTML This paper studies learning-augmented decentralized online convex optimization in a networked multi-agent system, a challenging setting that has remained under-explored. We first consider a linear learning-augmented decentralized online algorithm (LADO-Lin) that combines a machine learning (ML) policy with a baseline expert policy in a linear manner. We show that, while LADO-Lin can exploit the potential of ML predictions to improve the average cost performance, it cannot have guaranteed worst-case performance. To address this limitation, we propose a novel online algorithm (LADO) that adaptively combines the ML policy and expert policy to safeguard the ML predictions to achieve strong competitiveness guarantees. We also prove the average cost bound for LADO, revealing the tradeoff between average performance and worst-case robustness and demonstrating the advantage of training the ML policy by explicitly considering the robustness requirement. Finally, we run an experiment on decentralized battery management for sustainable computing. Our results highlight the potential of ML augmentation to improve the average performance as well as the guaranteed worst-case performance of LADO. @article{Decentralized_SOCO_SIGMETRICS_2025, title = {Learning-Augmented Decentralized Online Convex Optimization in Networks}, author = {Li, Pengfei and Yang, Jianyi and Wierman, Adam and Ren, Shaolei}, journal = {SIGMETRICS}, month = {}, year = {2025}, url = {https://arxiv.org/abs/2306.10158}, } CACM Making AI Less \"Thirsty\": Uncovering and Addressing the Secret Water Footprint of AI Models Pengfei Li, Jianyi Yang, Mohammad A. Islam, and Shaolei Ren Communications of the ACM, 2025 Abstract Bib HTML The growing carbon footprint of artificial intelligence (AI) models, especially large ones such as GPT-3, has been undergoing public scrutiny. Unfortunately, however, the equally important and enormous water (withdrawal and consumption) footprint of AI models has remained under the radar. For example, training GPT-3 in Microsoft’s state-of-the-art U.S. data centers can directly evaporate 700,000 liters of clean freshwater, but such information has been kept a secret. More critically, the global AI demand might be accountable for 4.2 – 6.6 billion cubic meters of water withdrawal in 2027, which is more than the total annual water withdrawal of 4 – 6 Denmark or half of the United Kingdom. This is very concerning, as freshwater scarcity has become one of the most pressing challenges shared by all of us in the wake of the rapidly growing population, depleting water resources, and aging water infrastructures. To respond to the global water challenges, AI models can, and also must, take social responsibility and lead by example by addressing their own water footprint. In this paper, we provide a principled methodology to estimate the water footprint of AI models, and also discuss the unique spatial-temporal diversities of AI models’ runtime water efficiency. Finally, we highlight the necessity of holistically addressing water footprint along with carbon footprint to enable truly sustainable AI. @article{AI_Water_CACM_2025, title = {Making AI Less \"Thirsty\": Uncovering and Addressing the Secret Water Footprint of AI Models}, author = {Li, Pengfei and Yang, Jianyi and Islam, Mohammad A. and Ren, Shaolei}, journal = {Communications of the ACM}, month = {}, year = {2025}, url = {https://dl.acm.org/doi/10.1145/3724499}, } SIGMETRICS Online Allocation with Replenishable Budgets: Worst Case and Beyond Jianyi Yang, Pengfei Li, Mohammad J. Islam, and Shaolei Ren SIGMETRICS, 2024 Abstract Bib HTML This paper studies online resource allocation with replenishable budgets, where budgets can be replenished on top of the initial budget and an agent sequentially chooses online allocation decisions without violating the available budget constraint at each round. We propose a novel online algorithm, called OACP (Opportunistic Allocation with Conservative Pricing), that conservati",
  "content_length": 25905,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:30"
}