{
  "name": "Shao-Yuan Lo",
  "homepage": "https://shaoyuanlo.github.io",
  "status": "success",
  "content": "Shao-Yuan Lo Shao-Yuan Lo   羅紹元 I am an Assistant Professor at National Taiwan University. My research interests include Trustworthy AI, Machine Learning, and Multimodal Models, with a recent focus on Multimodal Large Language Models and Reasoning. Prior to joining NTU, I was a Research Scientist at the Honda Research Institute USA. I received my Ph.D. from Johns Hopkins University in 2023, and my M.S. and B.S. degrees from National Chiao Tung University in 2019 and 2017, respectively. I also had wonderful experiences as an Applied Scientist Intern with the Amazon Just Walk Out team in summer 2022 and the Amazon Astro team in summer 2021. Email  / CV  / Google Scholar  / Github / LinkedIn / Twitter Hiring Undergrad, Master's, and Ph.D. Students!! If you are interested in working with me, please don't hesitate to drop me an email along with your resume and and transcripts. News 08/2025:   Joined National Taiwan University as an Assistant Professor!! Awarded as a Yushan Young Fellow!! 06/2025:   1 paper accepted to IJCV. Serving as an Area Chair for BMVC 2025. Invited talks at ProtagoLabs (remote). 05/2025:   1 paper accepted to ICML 2025 (Spotlight!). Recognized as an Outstanding Reviewer for CVPR 2025! 04/2025:   1 paper accepted to CVIU. Invited talks at UC Santa Cruz and CSIG Wuhan Center (virtual). 03/2025:   1 paper accepted to IEEE T-MI. Invited talks at UC Riverside and WACV 2025 COOOL Workshop. 02/2025:   2 papers accepted to CVPR 2025 (both are Highlight!). Serving as a Tutorial Chair for AVSS 2025. 01/2025:   1 paper accepted to ICLR 2025. 11/2024:   Invited talk at National Taiwan University. Serving as an Associate Editor for ICRA 2025. 09/2024:   Invited talk at Jilin University (remote). 07/2023:   1 paper accepted to ECCV 2024. 02/2024:   2 papers accepted to CVPR 2024. Won the Best Student Paper Award at SPIE Medical Imaging 2024!! 01/2024:   Invited talks at Academia Sinica and National Yang Ming Chiao Tung University. 07/2023:   Joined Honda Research Institute USA as a Research Scientist. See you in San Jose, CA!! 03/2023:   Defended my PhD dissertation!! 02/2023:   1 paper accepted to CVPR 2023. 09/2022:   Accepted to the Google CS Research Mentorship Program. 07/2022:   1 paper accepted to IEEE T-PAMI, and 1 paper accepted to IROS 2022. 05/2022:   Joined Amazon (Just Walk Out team) as an Applied Scientist Intern. See you in Seattle, WA!! 01/2022:   Invited talks at Academia Sinica and National Yang Ming Chiao Tung University. 12/2021:   1 paper accepted to IEEE T-IP. 06/2021:   Invited talk at CVPR 2021 Tutorial on Adversarial Machine Learning in Computer Vision. 05/2021:   Joined Amazon (Astro team) as an Applied Scientist Intern. See you in Bellevue, WA!! 12/2019:   Won the Best Paper Award at ACM Multimedia Asia 2019!! 08/2019:   Joined Johns Hopkins University as a PhD student. See you in Baltimore, MD!! Publications Overcoming Multi-step Complexity in Multimodal Theory-of-Mind Reasoning: A Scalable Bayesian Planner Chunhui Zhang,   Zhongyu Ouyang,   Kwonjoon Lee,   Nakul Agarwal,   Sean Dae Houlihan,   Soroush Vosoughi,   Shao-Yuan Lo International Conference on Machine Learning (ICML), 2025 [Spotlight] paper / code / poster / bibtex Filter Images First, Generate Instructions Later: Pre-Instruction Data Selection for Visual Instruction Tuning Bardia Safaei,   Faizan Siddiqui,   Jiacong Xu,   Vishal M. Patel,   Shao-Yuan Lo IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Highlight] paper / project / code / podcast / bibtex Towards Zero-Shot Anomaly Detection and Reasoning with Multimodal Large Language Models Jiacong Xu,   Shao-Yuan Lo,   Bardia Safaei,   Vishal M. Patel,   Isht Dwivedi IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Highlight] paper / project / code / slides / bibtex Bridging Compressed Image Latents and Multimodal Large Language Models Chia-Hao Kao,   Cheng Chien,   Yu-Jen Tseng,   Yi-Hsin Chen,   Alessandro Gnutti, Shao-Yuan Lo,   Wen-Hsiao Peng,   Riccardo Leonardi International Conference on Learning Representations (ICLR), 2025 paper / project / code / poster / bibtex StimuVAR: Spatiotemporal Stimuli-aware Video Affective Reasoning with Multimodal Large Language Models Yuxiang Guo,   Faizan Siddiqui,   Yang Zhao,   Rama Chellappa,   Shao-Yuan Lo International Journal of Computer Vision (IJCV), 2025 paper / code / bibtex Egocentric and Exocentric Methods: A Short Survey Anirudh Thatipelli,   Shao-Yuan Lo,   Amit K. Roy-Chowdhury Computer Vision and Image Understanding (CVIU), 2025 paper / bibtex CBCT Reconstruction using Single X-ray Projection with Cycle-domain Geometry-integrated Denoising Diffusion Probabilistic Models Shaoyan Pan,   Junbo Peng,   Yuan Gao,   Shao-Yuan Lo,   Tianyu Luan,   Junyuan Li,   Tonghe Wang, Chih-Wei Chang,   Zhen Tian,   Xiaofeng Yang IEEE Transactions on Medical Imaging (T-MI), 2025 paper / bibtex TTT-Vnet: A 3D Vision Test-Time Training Model for Medical Image Analysis Shaoyan Pan,   Vanessa Su,   Shao-Yuan Lo,   Mingzhe Hu,   Yuheng Li,   Chih-Wei Chang, Tonghe Wang,   Richard L. J. Qiu,   and Xiaofeng Yang SPIE Medical Imaging (SPIE MI), 2025 paper / bibtex Follow the Rules: Reasoning for Video Anomaly Detection with Large Language Models Yuchen Yang,   Kwonjoon Lee,   Behzad Dariush,   Yinzhi Cao,   Shao-Yuan Lo European Conference on Computer Vision (ECCV), 2024 paper / code / talk / bibtex Uncertainty-aware Action Decoupling Transformer for Action Anticipation Hongji Guo,   Nakul Agarwal,   Shao-Yuan Lo,   Kwonjoon Lee,   Qiang Ji IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024 [Highlight] paper / bibtex Can’t Make an Omelette without Breaking Some Eggs: Plausible Action Anticipation using Large Video-Language Models Himangi Mittal,   Nakul Agarwal,   Shao-Yuan Lo,   Kwonjoon Lee IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024 paper / bibtex Patient-specific 3D Volumetric CBCT Image Reconstruction with Single X-ray Projection Using Denoising Diffusion Probabilistic Model Shaoyan Pan,   Shao-Yuan Lo,   Chih-Wei Chang,   Ella Salari,   Tonghe Wang,   Justin Roper, Aparna H. Kesarwala,   Xiaofeng Yang SPIE Medical Imaging (SPIE MI), 2024 [Best Student Paper Award] paper / bibtex Adaptive Batch Normalization Networks for Adversarial Robustness Shao-Yuan Lo,   Vishal M. Patel IEEE International Conference on Advanced Video and Signal-based Surveillance (AVSS), 2024 [Oral] paper / slides / poster / bibtex Spatio-Temporal Pixel-Level Contrastive Learning-based Source-Free Domain Adaptation for Video Semantic Segmentation Shao-Yuan Lo,   Poojan Oza,   Sumanth Chennupati,   Alejandro Galindo,   Vishal M. Patel IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2023 paper / slides / poster / bibtex Deep Learning-based Multi-Organ CT Segmentation with Adversarial Data Augmentation Shaoyan Pan,   Shao-Yuan Lo,   Min Huang,   Chaoqiong Ma,   Jacob Wynne,   Tonghe Wang, Tian Liu,   Xiaofeng Yang SPIE Medical Imaging (SPIE MI), 2023 paper / bibtex Adversarially Robust One-class Novelty Detection Shao-Yuan Lo,   Poojan Oza,   Vishal M. Patel IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI), 2022 [Featured in IEEE CTSoc News on Consumer Technology, April 2024] paper / slides / IEEE CTSoc News / bibtex Learning Feature Decomposition for Domain Adaptive Monocular Depth Estimation Shao-Yuan Lo,   Wei Wang,   Jim Thomas,   Jingjing Zheng,   Vishal M. Patel,   Cheng-Hao Kuo IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2022 paper / blog / bibtex Exploring Adversarially Robust Training for Unsupervised Domain Adaptation Shao-Yuan Lo,   Vishal M. Patel Asian Conference on Computer Vision (ACCV), 2022 paper / slides / bibtex Defending Against Multiple and Unforeseen Adversarial Videos Shao-Yuan Lo,   Vishal M. Patel IEEE Transactions on Image Processing (T-IP), 2021 [Journal presentation at ICIP 2022] paper / slides / bibtex Error Diffusion Halftoning Against Adversarial Examples Shao-Yuan Lo,   Vishal M. Patel IEEE International Conference on Image Processing (ICIP), 2021 paper / slides / bibtex Overcomplete Representations Against Adversarial Videos Shao-Yuan Lo,   Jeya Maria Jose Valanarasu,   Vishal M. Patel IEEE International Conference on Image Processing (ICIP), 2021 paper / slides / bibtex MultAV: Multiplicative Adversarial Videos Shao-Yuan Lo,   Vishal M. Patel IEEE International Conference on Advanced Video and Signal-based Surveillance (AVSS), 2021 paper / slides / bibtex Efficient Dense Modules of Asymmetric Convolution for Real-Time Semantic Segmentation Shao-Yuan Lo,   Hsueh-Ming Hang,   Sheng-Wei Chan,   Jing-Jhih Lin ACM International Conference on Multimedia in Asia (ACM MM Asia), 2019 [Best Paper Award] paper / project page / slides / bibtex Exploring Semantic Segmentation on the DCT Representation Shao-Yuan Lo,   Hsueh-Ming Hang ACM International Conference on Multimedia in Asia (ACM MM Asia), 2019 [Oral] paper / slides / bibtex Multi-Class Lane Semantic Segmentation using Efficient Convolutional Networks Shao-Yuan Lo,   Hsueh-Ming Hang,   Sheng-Wei Chan,   Jing-Jhih Lin IEEE International Workshop on Multimedia Signal Processing (MMSP), 2019 paper / slides / bibtex Incorporating Luminance, Depth and Color Information by a Fusion-based Network for Semantic Segmentation Shang-Wei Hung,   Shao-Yuan Lo,   Hsueh-Ming Hang IEEE International Conference on Image Processing (ICIP), 2019 [Oral] paper / project page / slides / bibtex Efficient Road Lane Marking Detection with Deep Learning Ping-Rong Chen*,   Shao-Yuan Lo*,   Hsueh-Ming Hang,   Sheng-Wei Chan,   Jing-Jhih Lin IEEE International Conference on Digital Signal Processing (DSP), 2018 paper / slides / bibtex Dissertations Robust Computer Vision Against Adversarial Examples and Domain Shifts Shao-Yuan Lo Ph.D. Thesis, Johns Hopkins University, 2023 thesis / bibtex Real-Time Semantic Segmentation Networ",
  "content_length": 14864,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:28"
}