{
  "name": "Shaohua Wang 0002",
  "homepage": "https://davidshaohuawang.wordpress.com",
  "status": "success",
  "content": "David Shaohua Wang | Recording my journey in research Dear Visitors, Welcome! This is David Shaohua Wang. I am with Central University of Finance and Economics in Beijing China now. I was an Assistant Professor in the Department of Informatics, Ying Wu College of Computing, New Jersey Institute of Technology (NJIT) (R1 research school, ranked at 97th in US (2020), and the largest technological university in the Tri-state area). In software engineering, NJIT was ranked 36th in USA , 43th in North America , and 76th in the world, using csranking.org as of 9/7/2021. I lead the SPACE lab @ NJIT SPACE = Software Engineering, Program Analysis, and Artificial IntelligenCE lab Email: davidshwang{at}ieee{.}org {News} August 2023 [Conference.] Two papers got accepted in ASE 2023 July 2023 [Conference.] One paper got accepted in FSE 2023 after the major revision. May 04 2023 [Conference]. One paper got accepted in FSE 2023 (direct acceptance rate 15%) Dec 09 2022 [Conference]. Three papers got accepted in ICSE 2023 August 22 [Conference]. One paper accepted in ASE 2022 July/August 2022 [PC]. Happy to serve as a PC for FSE23 and AAAI23 June 14th 2022 [Conference]. Two papers accepted by ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE). Congrats to Yi and Tien. Stay Tuned for our pre-prints. Jan 2022 [Journal]. One paper accepted in the Journal: Environment and Planning B: Urban Analytics and City Science, impact factor: 3.619, https://doi.org/10.1177/23998083211064624 December 2021 [Conference]. Our paper on deep learning for automated program repair got accepted into ICSE 2022. Stay tuned for our pre-print. November 2021 [Journal]. Congrats to Jiaxing, Xinyue, Diana, and Karen. One journal paper “GIS-KG: Building a large-scale hierarchical knowledge graph for geographic information science” accepted in International Journal of Geographical Information Science (IJGIS), link , impact factor: 4.186 (2020) October 2021 [Journal]. Congrats to Yi, Wenbo, Tien, Yan, Xinyue. One journal paper “Rap4DQ: Learning to Recommend Relevant API Documentation for Developer Questions” has been accepted in the International Journal of Empirical Software Engineering (EMSE), paper link is here October 2021 [Journal]. Congrats to Huan Ning, Zhenlong, Xinyue, Wenbo, and Xiao Huang. One journal paper “Exploring the vertical dimension of street view image based on deep learning: a case study on lowest floor elevation estimation” accepted in International Journal of Geographical Information Science (IJGIS), https://www.tandfonline.com/doi/abs/10.1080/13658816.2021.1981334 July 2021 [Journal]. Congrats to my collaboration with Professors Ye, Lu, Song, and Yu. One journal paper “Towards an AI-driven framework for multi-scale urban flood resilience planning and design” accepted in Computational Urban Science A Springer Journal. Link is here May 2021 [Conference and Journal]. Congrats to Yi. One research paper on vulnerability detection with interpretable AI accepted in FSE’21. Pre-print is here: https://arxiv.org/pdf/2106.10478.pdf Congrats to Wenbo, Yi, and Professor Xinyue Ye. One research journal paper on Q&A system for GIS developers, https://doi.org/10.1111/tgis.12798, accepted in Transactions in GIS. Jan 2021 [Conference]. Congrats to my collaboration with Professor Yan Wang and his team. One paper accepted in DASFAA 2021 Dec 2020 [Conference]. Congrats to Yi. Two papers accepted in ICSE’21. Pre-prints can be found on icse accepted papers page. Link Nov 2020 [Workshop]. Our FSE workshop has been successfully concluded. here. April 2020 [Workshop]. Our FSE workshop accepted. Please check our website here. Stay tuned. Mar and April 2020 [Reviewer]. Invited to review one article in IEEE Software and one in JSS Mar 2020 [Conference]. Congrats to Jiahao and Yi. One data paper accepted in MSR 2020. Feb 2020 [Industry]. visited NEC labs in Princeton NJ. Feb 2020 [Conference]. Congrats to Yi. One paper accepted in ICSE’20 Student competition track. Dec 2019 [NSF funding]. Our NSF funding news coverage. Link Dec 2019 [Conference]. Congrats to Yi. One paper accepted in ICSE’20. Pre-print is here, Data and Code Nov 2019 [NSF Panel]. Invited to be a NSF panelist Our team has some openings. Please check here: JOBS Unfortunately, I do not have openings in my lab at this moment. Research interests: My research spans the study of software engineering from system, empirical, and machine learning perspectives. More specifically,  I am interested in the following fields: (1) Machine and Deep Learning for Software Engineering and Program Analysis; (2) Software quality, evolution, clone and maintenance; (3) Service-oriented computing; and (4) Software Security and Privacy Very Short Bio: Assistant Professor New Jersey Institute of Technology   September 2017-Now Postdoc Fellow           Queen’s University         July 2016- July 2017 Under the supervision of Dr. Ying (Jenny) Zou in Software Re-engineering Research Group, ECE, Queen’s University, Ontario, Canada Ph.D in CS     Queen’s University           2012 – 2016 Thesis: Assisting End-users in Filling out Web Services My supervisor was Dr. Ying Zou. My PhD supervisory committee includes Dr. Ying (Jenny) Zou , Dr. Ahmed E. Hassan, and Dr. Mohammad Zulkernine. My PhD thesis examination committee includes Dr. Ying (Jenny) Zou, Dr. Kwei-Jay Lin, Dr. Hossam Saad Hassanein, Dr. Patrick Martin, Dr. Ahmad Afsahi Students Ph.D: Yi Li, BS Renmin University of China, MS Stevens Tech, USA, PhD 09/2017 – ? Wenbo Wang, BS from HeNan University China 10/2020 – ? Jiaxin Zhang, BS from Xi’an Jiaotong University China 09/2020 – ? MS: Chen Lin, BS NJIT 09/2019-06/2021 Teaching IS218 Building Web Applications, Spring, Fall 2018, Spring 2019, Fall 2019, Spring 2020, Fall 2020, Spring 2021, Fall 2021 IS698-002 AI in Software Engineering and Program Analysis Fall 2021, Spring 2022 IS390 System Design and Analysis, Fall 2017 It has been my pleasure to know the following great minds Dr. Tien N. Nguyen is a full professor in Computer Science Department, Erik Jonsson School of Engineering and Computer Science, The University of Texas at Dallas, USA. Dr. Ying (Jenny) Zou is a Canada Research Chair in Software Evolution, a visiting scientist of Canada IBM Centers for Advanced Studies, a full Professor in the Department of Electrical and Computer Engineering and cross-appointed to the School of Computing, Queen’s University, Canada. Ms. Joanna Ng was a Cognitive IoT strategy and Innovation Chair in IBM. She was the Head of Research at IBM Canada Software Laboratories, Center for Advanced Studies. Dr. Ahmed E. Hassan is a Canada Research Chair in Software Analytics, a NSERC/BlackBerry Industrial Research Chair in Software Engineering, and a Professor in the School of Computing, Queen’s University, Canada. He is an IEEE Fellow Dr. Foutse Khomh is a Professor at the Ecole Polytechnique de Montréal (Canada) where he leads the SWAT team on software analytics and cloud engineering research. You may see me in the following Conferences or Events 2023 ICSE Melbourne, ASE Luxembourg 2021 ICSE (Virtual), FSE (Virtual) 2020 ICSE and MSR (Virtual) 2019 MSR and ICSE, ICWS, ISSTA, ASE, and OOPSLA 2017 ICWS, Hasso Plattner Institue (HPI) Symposium by SAP Next-Gen. 2016 CSER, CASCON 2015 IBM University Days, ICWS (and all other co-located conferences, such as SCC, BigData), Annual Ultra-large Scale Services (ULySSes) meeting, CSER, CSCON 2014 ICWS, ICSOC 2013 ICWS, ICSE, MSR, Release Engineering, CASCON, CSER, Annual Ultra-large Scale Services (ULySSes) meeting 2012 WCRE, CASCON, CSER, IBM University Days, MSR Vision 2020 Academic Service Program Committee or Reviewer/Co-reviewer Journals Transactions on Software Engineering (TSE 2021,2022) ACM Transactions on Software Engineering and Methodology (TOSEM 2021,2022,2023) Transactions on Services Computing (TSC 2015, 2016, 2019, 2020,2022), Empirical Software Engineering (2020, 2021,2022,2023), Computers and Security (2021), Forensic Science International: Digital Investigation (2021) IEEE Access (2020), IEEE Software (2020), International Journal of Communication Systems (IJCS 2019), Journal of Computer Science and Technology (JSCT 2019), Journal of Software: Evolution and Process (JSME 2018), Journal of Systems and Software (JSS 2017 2018 2019 2020,2023), Behaviour & Information Technology (BIT 2019), Journal of Web Engineering (JWE 2017 2018), Journal of Central South University (2014) Conferences FSE 2023 AAAI 2023, 2024 SANNER 2023 IEEE International Conference on Web Services (ICWS), research track (2017, 2018, 2019, 2020,2023), International Conference on Mining Software Repositories (MSR 2016, 2017, 2022), International Conference on Mobile Software Engineering and Systems (MobileSoft 2022) IEEE International Conference on Web Services (ICWS), early submission track (2019, 2020), IEEE International Conference on Web Services (ICWS), work-in-progress track (2020), International Conference on Software Engineering (ICSE), demo track (2020), International Conference on service-oriented computing (ICSOC) research/industry (2019), International Conference on service-oriented computing (ICSOC), demo track (2018, 2019), IEEE International Conference on Services Computing (SCC), research track (2020), IEEE International Conference on Services Computing (SCC), early submission track (2020), The International Conference on Advances in Databases, Knowledge, and Data Applications (DBKDA) 2020, 2021,2022 International Conference on Advances and Trends in Software Engineering (SOFTENG) 2021 2022 The International Conference on Data Analytics (DATA ANALYTICS) 2020, 2021, 2022 2nd ACM SIGSPATIAL Workshop on Advances In Resilient and Intelligent Cities (ARIC) 2019, 2020 Annual meetings of Geoinformatics in Sustainable Ecosystem and Society (GSES) and Geospatial Artificial Intelligence for Urban Computing (GeoAI-UC) (2019), International Working Confer",
  "content_length": 10973,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:29"
}