{
  "name": "Shaowen Wang 0001",
  "homepage": "https://ggis.illinois.edu/directory/profile/shaowen",
  "status": "success",
  "content": "Shaowen Wang | Department of Geography & Geographic Information Science | Illinois Skip to main content School of Earth, Society & Environment Department of Geography & Geographic Information Science Search Admissions Why Study Geography & GIS @Illinois? Apply to our Graduate Programs Student Financial Aid Graduate Funding Visit Illinois Academics Course catalog Career Resources Graduate Programs Undergraduate Programs Undergraduate Advising Scholarships for Geography & GIS Students Research Geographic Information Science River, Watershed, and Landscape Dynamics Space, Society, and the Built Environment People Faculty Graduate Students Administration & Staff Research Staff Undergraduate Spotlight Resources Career Resources Department News Event Calendar Friday Colloquium Faculty/Staff Resources Graduate Student Resources Diversity, Equity, and Inclusion Gamma Theta Upsilon (GTU) Alumni Alumni Awards Alumni Newsletters Alumni Profiles & News Donate to GGIS Graduate Placement Illinois Alumni Association Shaowen Wang shaowen@illinois.edu Research AreasOnline Graduate Programs in CyberGIS and Geospatial Data ScienceSpace, Society, and the Built EnvironmentCyberGIS and Geospatial Data ScienceGeographic Information ScienceGIS and SocietyRiver, Watershed, and Landscape DynamicsSpace-Time Analytics Edit Your Profile Professor and Associate Dean for Natural and Mathematical Sciences, College of Liberal Arts & Sciences View CV Prof. Wang's Homepage BiographyShaowen Wang is a Professor in the Department of Geography and Geographic Information Science and the Siebel School of Computing and Data Science at the University of Illinois Urbana-Champaign. He also holds affiliate faculty appointments in the Department of Urban and Regional Planning and the School of Information Sciences. He currently serves as Associate Dean for Natural and Mathematical Sciences in the College of Liberal Arts and Sciences and as a Senior Faculty Fellow in the Office of the Vice Chancellor for Research and Innovation. He is the founding director of the CyberGIS Center for Advanced Digital and Spatial Studies and leads the national Institute for Geospatial Understanding through an Integrative Discovery Environment (I-GUIDE) funded by the National Science Foundation. He previously served as Head of the Department of Geography and Geographic Information Science (2017-2023) and as Associate Director of the National Center for Supercomputing Applications for CyberGIS (2010-2017). He was a Visiting Scholar at Lund University (2006) and Harvard University (2023). His research focuses on advancing cyberGIS, geospatial data science, and spatial artificial intelligence (AI) to develop scalable solutions for complex geospatial problems and sustainability challenges. He served as President of the University Consortium for Geographic Information Science (UCGIS) from 2016 to 2017 and as a member of the National Academies’ Board on Earth Sciences and Resources from 2015 to 2020. He is a Fellow of the American Association for the Advancement of Science (AAAS), the American Association of Geographers (AAG), and UCGIS. EducationPhD, Geography, the University of IowaMaster of Computer Science, the University of IowaMS, Geography, Peking UniversityBS, Computer Engineering, Tianjin University Courses TaughtCoursera: Getting Started with CyberGISGGIS 595 - Advanced Digital and Spatial StudiesGGIS 480 - Principles of GISGGIS 479 - Advanced GISGGIS 407 - Foundations of CyberGIS and Geospatial Data ScienceGGIS 379 - Introduction to GIS Additional Campus AffiliationsAssociate Dean, College of Liberal Arts and Sciences Professor, Geography and Geographic Information Science Professor, School of Information Sciences Professor, Siebel School of Computing and Data Science Senior Faculty Fellow, Office of the Vice Chancellor for Research and Innovation Affiliate, Center for Social & Behavioral Science External Linkshttp://go.illinois.edu/ShaowenWang Recent PublicationsChoi, Y. D., Maghami, I., Goodall, J. L., Band, L., Nassar, A., Lin, L., Saby, L., Li, Z., Wang, S., Calloway, C., Yi, H., Seul, M., Ames, D. P., & Tarboton, D. G. (2025). Toward reproducible and interoperable environmental modeling: Integration of HydroShare with server-side methods for exposing large-extent spatial datasets to models. Environmental Modelling and Software, 183, Article 106239. https://doi.org/10.1016/j.envsoft.2024.106239Han, S. Y., Yoo, J., Michels, A., Kang, J. Y., Wang, S., & Kim, J. S. (2025). Vulnerable Neighborhood Explorer (VNE): An Open-Source Visual Analytics Tool for Exploring Social Vulnerability to Disasters across Different Neighborhoods. SoftwareX, 31, Article 102233. https://doi.org/10.1016/j.softx.2025.102233Lyu, F., Yang, Z., Diao, C., & Wang, S. (2025). Multistream STGAN: A Spatiotemporal Image Fusion Model With Improved Temporal Transferability. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 18, 1562-1576. https://doi.org/10.1109/JSTARS.2024.3506879Michels, A., Park, J., Kang, J. Y., & Wang, S. (2025). An Areal Approach to Spatial Accessibility Analysis. Geographical Analysis, 57(2), 233-269. https://doi.org/10.1111/gean.12415Wang, S., Baig, F., Kang, Y., Li, E., Michels, A., Jaroenchai, N., Padmanabhan, A., Kumar, A., Kalyanam, R., Oller Smith, N. S., Song, X. C., Zhao, L., Manson, S., Ramamurthy, M., Taghavikish, S., & Tarboton, D. (2025). I-GUIDE Platform for Geospatial Data-intensive Convergence Research and Education. In PEARC 2025 - Practice and Experience in Advanced Research Computing 2025: The Power of Collaboration Article 46 (PEARC 2025 - Practice and Experience in Advanced Research Computing 2025: The Power of Collaboration). Association for Computing Machinery. https://doi.org/10.1145/3708035.3736108View all publications on Illinois Experts School of Earth, Society & Environment Department of Geography & Geographic Information Science Natural History Building, Second Floor 1301 W. Green St., MC-150 Urbana, IL 61801 (217) 333-1880 Email: geography@illinois.edu College of Liberal Arts & Sciences Login",
  "content_length": 6094,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:31"
}