{
  "name": "Sharon Ding",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/xianghuading",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Xianghua (Sharon) Ding Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffXianghua (Sharon) DingMr Ethan KellyZhen Tian Dr Xianghua Ding Senior Lecturer in Healthcare Technologies (School of Computing Science) email: Sharon.Ding@glasgow.ac.uk Room SAWB306, Computing Science, Sir Alwyn Williams Bldg, University of Glasgow, G12 8QQ Import to contacts https://orcid.org/0000-0001-8122-6252 Biography Personal Website: Xianghua Sharon Ding's Personal Web Page I am a Senior Lecturer in Healthcare Technologies in the School of Computer Science at the University of Glasgow. Before moving to Glasgow, I was an Associate Professor at Fudan University, Shanghai, China. I received my Ph.D. from University of California, Irvine, USA. in 2010. At the University of Glasgow, I am running the Care Computing Group (CCG). I am interested in healthcare technologies, particularly in issues of preventive health, health literacy, mental wellbeing, patient-provider communication and peer-support approaches, and how ICTs such as self-tracking, new media and collaborative technologies, can be better employed to address some of these issues. My goal is that computing technologies can be designed to better unlock the potential of individuals and support collaboration to promote individual and social wellbeing, and create positive societal impact. My research falls in the areas of Human Computer Interaction(HCI),  Computer Supported Cooperative Work (CSCW), and Ubiquitous Computing (Ubicomp), and I am working at the intersection of computer science and social science.  As computing technologies are increasingly woven into the fabric of everyday lives, we cannot easily separate technical problems from their social context anymore. By combining social and technical approaches, I hope to better understand the roles computing technologies play and design technologies to fit into social practices. Research interests In recent years, my main research focus has been on social-technical approaches to empowering people for effective health data engagement and health management, with particular interest in intelligent sensing and collaborative technologies for preventive health, mental wellbeing and learning.Research groupsGlasgow Interactive Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005Number of items: 59.2025 Wang, Weiyun, Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570, Yu, Kejin and Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252 (2025) \"I Want to Keep My Phone Away From the Bed\": Designing a Smart Pillow for Sleep Onset. In: TEI 2026, Chicago, Illinois, USA, 08-11 Mar 2026, (Accepted for Publication) Wruk, Aleksandra ORCID: https://orcid.org/0000-0003-0077-1879 and Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252 (2025) \"It Doesn’t Feel Like Work\": Understanding the Use of General Over Specialised Digital Technologies for Mental Well-being Support. In: 16th Biannual Conference of the Italian SIGCHI Chapter (CHItaly 2025), Salerno, Italy, 6-10 October 2025, pp. 1-12. ISBN 9798400721021 (doi: 10.1145/3750069.3750108) Luo, Yuhan, Gui, Xinning, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Zheng, Xi, Hernandez, Rie Helene (Lindy), Li, Zhuoyang and Song, Qiurong (2025) Reflecting Upon the Unintended Consequences of Personal Informatics Systems: a Systematic Review of Empirical Studies. In: ACM Designing Interactive Systems Conference (DIS 2025), Funchal, Madeira, 05-09 Jul 2025, pp. 2847-2866. ISBN 9798400714856 (doi: 10.1145/3715336.3735746) Yu, Fangyu, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Zhang, Peng, Lu, Tun and Gu, Ning (2025) Cultivating a space for learning: a study of note-taking and sharing on a video-sharing platform Bilibili. Computer Supported Cooperative Work, 34(2), pp. 331-374. (doi: 10.1007/s10606-025-09511-7) Yi, Zhennan, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, You, Chenyang and Zhou, Xingchen (2025) Smiles, Frowns, and Everything In Between: Understanding User Experiences with Emotion Tracking in Daily Life through Facial Expression Recognition. In: ACM Designing Interactive Systems Conference (DIS 2025), Funchal, Madeira, 05-09 Jul 2025, (Accepted for Publication) Yu, Fangyu, Zhang, Peng, Qiao, Siyuan, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Lu, Tun and Gu, Ning (2025) BNoteToDanmu: Category-Guided Note-to-Danmu conversion method for learning on video sharing platforms. ACM Transactions on the Web, 19(2), 13. (doi: 10.1145/3723349) Huang, Jinling and Ding, Xianghua ORCID: https://orcid.org/0000-0001-8122-6252 (2025) Self-Management Support (SMS) in transition: the case of osteoporosis management support in a Chinese hospital. Computer Supported Cooperative Work, 34, pp. 1-39. (doi: 10.1007/s10606-024-09503-z) 2024 De Choudhury, Munmun, Ding, Xianghua ORCID: https://orcid.org/0000-0001-8122-6252, Guha, Shion, Pinatti de Carvalho, Aparecido Fabiano, Cardoso Llach, Daniel, Mustafa, Maryam, Quercia, Daniele and Wong-Villacres, Marisol (2024) PACMHCI V8, CSCW1, April 2024 editorial. Proceedings of the ACM on Human-Computer Interaction, 8(CSCW1), 10. (doi: 10.1145/3637287) Yu, Fangyu, Zhang, Peng, Ding, Xianghua ORCID: https://orcid.org/0000-0001-8122-6252, Lu, Tun and Gu, Ning (2024) BNoteHelper: a note-based outline generation tool for structured learning on video-sharing platforms. ACM Transactions on the Web, 18(2), pp. 1-30. (doi: 10.1145/3638775) 2023 Tang, Xinru, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252 and Zhou, Zhixuan (2023) Towards Equitable Online Participation: A Case of Older Adult Content Creators’ Role Transition on Short-form Video Sharing Platforms. In: 26th ACM Conference On Computer-Supported Cooperative Work And Social Computing (CSCW2023), Minneapolis, MN, USA, 13-18 October 2023, pp. 1-22. (doi: 10.1145/3610216) Gui, Xinning, Luo, Yuhan, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Abdullah, Saeed, Dixon, Emma and Bardzell, Shaowen (2023) Designing for and Reflecting upon Resilience in Health and Wellbeing. In: 2023 ACM Designing Interactive Systems Conference (DIS '23), Pittsburgh, PA, USA, 10-14 Jul 2023, pp. 135-137. ISBN 9781450398985 (doi: 10.1145/3563703.3591456) Wang, Weiyun, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252 and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2023) Everyday Space as an Interface for Health Data Engagement: Designing Tangible Displays of Stress Data. In: DIS '23: Designing Interactive Systems Conference, Pittsburgh, PA, USA, 10-14 July 2023, pp. 1648-1659. ISBN 9781450398930 (doi: 10.1145/3563657.3596096) Yu, Fangyu, Zhang, Peng, Ding, Xianghua ORCID: https://orcid.org/0000-0001-8122-6252, Lu, Tun and Gu, Ning (2023) Exploring how workspace awareness cues affect distributed meeting outcome. International Journal of Human–Computer Interaction, 39(8), pp. 1606-1625. (doi: 10.1080/10447318.2022.2064063) Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Tran, Linda, Liu, Yanling, O’Neill, Conor and Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676 (2023) Infrastructural Work Behind The Scene: A Study of Formalized Peer-support Practices for Mental Health. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 561. ISBN 9781450394215 (doi: 10.1145/3544548.3580657) Jiang, Yanqi, Ding, Xianghua ORCID: https://orcid.org/0000-0001-8122-6252, Ma, Xiaojuan, Sun, Zhida and Gu, Ning (2023) IntimaSea: Exploring Shared Stress Display in Close Relationships. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 428. ISBN 9781450394215 (doi: 10.1145/3544548.3581000) Liu, Guanhong, Ding, Xianghua ORCID: https://orcid.org/0000-0001-8122-6252, Cai, Jinghe, Wang, Weiyun, Wang, Xinyue, Diao, Yuting, Chen, Jin, Yu, Tianyu, Xu, Haiqing and Mi, Haipeng (2023) Digital Making for Inheritance and Enlivening Intangible Cultural Heritage: A Case of Hairy Monkey Handicrafts. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 635. ISBN 9781450394215 (doi: 10.1145/3544548.3581539) 2022 Zhang, Peng, Guan, Zhengqing, Liu, Baoxi, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Lu, Tun, Gu, Hansu and Gu, Ning (2022) Building user-oriented personalized machine translator based on user-generated textual content. Proceedings of the ACM on Human-Computer Interaction, 6(CSCW2), 280. (doi: 10.1145/3555171) Wu, Yiying, Ding, Xianghua(Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Dai, Xuelan, Zhang, Peng, Lu, Tun and Gu, Ning (2022) Alignment Work for Urban Accessibility: A Study of How Wheelchair Users Travel in Urban Spaces. Proceedings of the ACM on Human-Computer Interaction, 6(CSCW2), 274. (doi: 10.1145/3555165) Zhang, Peng, Liu, Baoxi, Lu, Tun, Gu, Hansu, Ding, Xianghua and Gu, Ning (2022) A semantic embedding enhanced topic model for ",
  "content_length": 51022,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:36"
}