{
  "name": "Sharon Goldberg",
  "homepage": "http://www.cs.bu.edu/~goldbe",
  "status": "success",
  "content": "Sharon Goldberg Sharon Goldberg Home / CV / Publications / Students / Teaching / Diversity / Funding Photo credit: AOB Photo goldbe||at||cs||bu||edu twitter: @goldbe Associate Professor Sloan Research Fellow Hariri Faculty Fellow Computer Science Boston University111 Cummington St, MCS135Boston, MA 02215 I am an associate professor in the Computer Science Department at Boston University, and a member of the BU Security Group. As a network security researcher, my work uses tools from theory (cryptography, game-theory, algorithms) and networking (measurement, modeling, and simulation) to understand the hurdles practitioners face when deploying new security technologies, and to develop solutions that surmount them. I received my Ph.D. from Princeton University in 2009, and my B.A.Sc. from the University of Toronto in 2003. I have worked as a researcher at IBM's crypto group, Cisco Research, and Microsoft Research, New England, as an engineer at Bell Canada and Hydro One Networks, and have served on working groups of the Federal Communications Commission (FCC) and the Internet Engineering Task Force (IETF). Here's an article and a video about our research group. I'm on sabbatical this year, co-founding Commonwealth Crypto! Selected Recent Publications: (all publications by topic) (chronological list) Surveillance without Borders: The Traffic Shaping Loophole and Why It Matters Sharon Goldberg. Report, The Century Foundation, June 2017. report Making NSEC5 Practical for DNSSEC Dimitrios Papadopoulos, Duane Wessels, Shumon Huque, Jan Včelák, Moni Naor, Leonid Reyzin, Sharon Goldberg, ePrint Cryptology Technical Report 2017/099 (February 2017). paper (on ePrint) IETF internet draft project page RWC'17 talk (YouTube) See also: NSEC5: Provably Preventing DNSSEC Zone Enumeration, NDSS'15, San Deigo, CA. See also: draft-goldbe-vrf, an IETF internet draft specifying Verifiable Random Functions. (slides) TumbleBit: An Untrusted Bitcoin-Compatible Anonymous Payment Hub Ethan Heilman, Leen Alshenibr, Foteini Baldimtsi, Alessandra Scafuro, Sharon Goldberg NDSS'17, San Diego, CA. Feb 2017. ePrint (Cryptology) Report 2016/575 (June 2016, revised August 2016.) GitHub NTumbleBit Project Project page Media:    Bitcoin Magazine Coin Journal btcmanager Attacking the Network Time Protocol Aanchal Malhotra, Isaac E. Cohen, Erik Brakke and Sharon Goldberg NDSS'16, San Diego, CA. Feb 2016. ePrint (Cryptology) Report (2015/1020) slides Media: CS Monitor, ars technica, threatpost, The Register See also Attacking NTP's Authenticated Broadcast Mode, SIGCOMM CCR, April 2016. See also The Security of NTP's Datagram Protocol, FC'17, April 2017. BU NTP Security Project Page Unrestrained Bulk Surveillance on Americans by Collecting Network Traffic Abroad. Axel Arnbak and Sharon Goldberg. Michigan Telecommunications and Technology Law Review (MTTLR). Vol 21(2), May 2015. Telecommunications Policy Research Conference (TPRC'42), Washington, DC. September 2014. Privacy Enhancing Technologies Symposium (HotPETS'14), Amsterdam, NL, July 2014. paper (SSRN) CBS News story + NSA response our reaction to the NSA response slides from TPRC'42 Other media: Boston Globe, Bruce Schneier's blog, CNET, ZDNET, reason.com, Network World. Why Is It Taking So Long to Secure Internet Routing? Sharon Goldberg. The Communications of the ACM (ACM Queue). October 2014. paper slides and video from 3-hr tutorial (2016) On the Risk of Misbehaving RPKI Authorities Danny Cooper, Ethan Heilman, Kyle Brogle, Leonid Reyzin and Sharon Goldberg. HotNets-XII, College Park, MD. November 2013. full technical report short HotNets paper project page Awarded a 2014 IETF/IRTF Applied Networking Research Prize. Is the Juice Worth the Squeeze? BGP Security in Partial Deployment Robert Lychev, Sharon Goldberg, Michael Schapira. SIGCOMM'13, Hong Kong, China. August 2013. SIGCOMM version full version Stanford Net Seminar video (YouTube) Awarded a 2014 IETF/IRTF Applied Networking Research Prize. Teaching Teaching FAQ: Q: Do I need CS455 or CS350 before taking CS558 (Network Security)? A: NO!! I'm on sabbatical 2017-2018, so not teaching. I'll be teaching again in Fall 2018. CS 558 - Network Security. (Spring 2017) CS237 - Probability in Computer Science. (Fall 2016) CS558 - Network Security and Applied Cryptography. (Fall 2015, co-taught with Foteini Baldimtsi) CS558 - Network Security. (Spring 2015) CS237 - Probability in Computing. (Fall 2014) CS558 - Network Security. (Spring 2014) CS558 - Network Security. (Privacy, Anonymity, and Online Censorship). (Spring 2013) CS237 - Probability in Computing (Fall 2012). Website on blackboard. CS558 - Network Security (Spring 2012) CS237 - Probability in Computing (Fall 2011). Website on blackboard. CS237 - Probability in Computing (Spring 2011). Website on blackboard. CS591 - Seminar in Network Security (Fall 2010) Postdocs, Students and Visitors My postdocs, students and I are part of the BU Security Group, (BUSEC). Yossi Gilad (BUSEC postdoc) Ethan Heilman (BU PhD student) Aanchal Malhotra (BU PhD student) Sarah Scheffler (BU PhD student) Omar Sagga (BU undergraduate) Yuval Marcus (Pitt undergradute) Alumni Foteini Baldimtsi (BUSEC postdoc, 2014-2016. Started as an assistant professor at George Mason University.) Davide Proserpio (BU PhD student. Co-advised with John Byers and Georgios Zervas. Graduated 2016. Started as an assistant professor at USC Marshall School of Business.) Dimitris Papadopoulos (BU PhD student. Mainly advised by Nikos Triandopoulos. Graduated 2016. Started as a postdoc as UMD before starting as an assistant professor at HKUST.) Robert Lychev (GATech PhD student, visited 2011-2013. Started as a researcher at MIT Lincoln Labs.) Phillipa Gill (University of Toronto PhD student, visited fall 2010. Started postdoc at Citizen Lab, before joining Stonybrook University as an assistant professor in 2013. Now at UMass Amherst.) Sachin Vasant. (BU MS. Co-advised with Leo Reyzin. Graduated 2014. Started as an engineer at Cisco.) Yun Sheng (BU MS. Co-advised with David Choffnes, started at Zoominfo.) Jef Guarente (BU MS. Co-advised with Leo Reyzin. Graduated 2013. Thesis: \"Study of the computational efficiency of single-server private information retrieval.\") Kyle Brogle. (BU undergraduate. Graduated 2012, started as a grad student at Stanford. Received an honorable mention for the 2012 CRA undergraduate research awards.) Danny Cooper (BU undergraduate. Graduated 2014, started as a security researcher at Akamai.) Anthony Faraco-Hadlock (BU undergraduate. Graduated 2015, started as a developer at Microsoft.) Adam Udi. (BU undergraduate BA/MA. Masters project. Graduated 2013, started as a developer at tripadvisor.) AJ Trainor (BU undergraduate. Now at Cambridge Blockchain.) Erik Brakke (BU undergraduate. Now at Carbonite.) Isaac Cohen (BU undergraduate. Received an honorable mention for 2016 CRA undergraduate research award. Started as a developer at Microsoft.) Alison Kendler (BU undergraduate. Named a finalist for the 2016 CRA undergraduate research awards. Started as a researcher at MITRE.) Ann Ming Samborski (BU undergraduate.) Leen Alshenibr (BU undergraduate. Now at Akamai.) Sean Smith (BU undergraduate.) Ethan Donowitz (Tufts undergraduate) Haydn Kennedy (BU undergraduate) Rahul Bazaz (BU undergraduate) Ezequiel Gomez (BU undergraduate) Daniel Gould (BU undergraduate) Lydia K. Goldberg. (High-school intern as part of MIT Research Science Institute, summer 2013. Her summer research was recognized as a semifinalist in the 2014 Intel Science Talent Search.) Hristo Stoyanov (MIT Research Science Institute high school intern, summer 2014. His summer research was recognized as a finalist in the 2015 International Science and Engineering Fair.) Applications: I am always looking for motivated students and postdocs interested in network security. I have several open positions for spring/summer undergrad or MS interns! See here and please apply! I especially enjoy working with motivated undergrads with strong programming skills. Several of my undergrads have won national awards for their research. If you are a BU undergrad and are interested in working with me, please take one of my courses, and drop by my office hours and tell me about yourself. I also welcome students from our M.S. in cybersecurity program. If you are a BU grad student are interested working with me or others in the BU Security Group, please enroll in my network security course or in one of the cryptography courses offered by faculty (Canetti, Reyzin) in our group. The best way to get to know us is to join our mailing list and start attending our BUsec seminars. If you are interested in graduate study and are not yet at BU, apply to the graduate program in Computer Science at Boston University. If you are interested in a postdoc with our group, please email me and describe your qualifications, and type of projects you'd like to work on if you came here. Updated Feb 24, 2018. Conferences Program committee chair:    ANRW'18 at IETF'102 in Montreal. (We are rebooting this conference!) Technical program committees: ANRP'18   | SIGCOMM'17   | HotCloud'17   | IMC'16   | 2015 Workshop on Surveillance and Technology (SAT)   | SIGCOMM'15   | NSDI'15   | IMC'14   | SIGCOMM'14   | NSDI'14   | NPsec'13   | CoNext'13   | NSDI'13 poster and demo session   | HotCloud'13   | IMC'12   | HotCloud'12   | SysStore'12   | SIGCOMM'11   | NetEcon'11   | CoNEXT Student Workshop'10   | HotCloud'10   | NetEcon'10   | NetEcon 2009 Organizing committees: 3rd Annual New England Networking and Systems Day (NENS'16) |   SIGCOMM'16 |   1st Annual New England Networking and Systems Day (NENS'14) |   BFOC'13 (Boston Freedom in Online Communications Day) |   SIGCOMM'12 Funding My research group is grateful for the support of two NSF awards from the Secure and Trusted Cyberspace (SaTC) program, an NSF CAREER award, a Sloan Research Fellowship, and gifts from Cisco and Verisign Labs.",
  "content_length": 9974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:37"
}