{
  "name": "Sharat Chandran",
  "homepage": "https://www.cse.iitb.ac.in/~sharat",
  "status": "success",
  "content": "This is the home page of Sharat श र त Chandran This is how I looked sometime ago. Quick Links: Bio Students/Staff Publications Research Areas Funded Projects Weekly Schedule PGP public key. Search my site Coordinates: Work: Room KR102 (aka A202) Rekhi Bldg, CSE Dept, IIT Campus Postal: Mumbai 400076, India Voice: 91-22-25767726 Fax: 91-22-25720022 Pre-deep-learning-era demos Hello, I'm a faculty member at IIT Bombay (more on my previous life appears here). Contacting me: Please visit this page (see office hours). Please read this page if you are a student and not a student from IITB. Directions appear here. Research: I have worked in, roughly speaking, two areas relating to Computers: Graphics, and Vision along with my students and staff. Follow this (sorry, old, dated) for some papers. Check out some of my (again older) talks too if you have time. You may also want to look at some infrequently updated publications, and the aforementioned talks and papers (check out the abstract to figure out what is going on). Teaching: I am teaching Math for Visual Computing (MVC) this semester. Please note that this course is strictly for entering post graduate students, and is not available for students with undergraduate preparation in (currently or earlier from) the older IITs. Courses I have offered in the past include (all course notes work under the Creative Commons model): CS101: Basic freshman programming , Software Systems, Parallel Programming Paradigms (PPP), Math for Visual Computing, Graphics I, Multimedia Systems, Computer Vision, Digital Image Processing, Graphics II, Digital Signal Processing, Algorithms, Spatial Data Structures, Multimedia (in distance mode), and (in the era when HTML did not exist) Data Structures and Algorithms, and Advanced Computer Graphics. Past admin/service work (In no particular order)(see Cartoon ): Department: Academic Rehabilitation Program Faculty Advisor PhD Faculty Advisor Awards_committee_chair New CSE Building Task Force NPTEL CSE Discipline Coordinator Faculty_search_chair Faculty_Advisor (Batch of 2002-2006/7) Space Committee Web_Team_Chair ViGIL_incharge DUGC DPGC Institute: Founding PMRF Coordinator Committee for implementing Excellence in Teaching Award Head, Application Software Centre IIT_Research_Fellowship_Initative Coordinator Professor in charge, Central School Swimming_Advisory_Board External: DST India Digital Heritage Project Coordinator Mysore Park Vision Conference Program_Co-Chair ICVGIP_Program_Co-Chair Regional_Contest_Director_ACM_ICPC Joint Seat Allocation Algorithm Community: Sanskriti @ IITB Taekwando @ IITB Core Group Class of 84 Sishu_Vihar Kendriya_Vidyalaya_PTA_Secretary Bye now -- gotta run :-) Sharat",
  "content_length": 2712,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:33"
}