{
  "name": "Sharon Levy",
  "homepage": "https://sharonlevy.github.io",
  "status": "success",
  "content": "About Me - Sharon Levy Sharon LevyAssistant Professor at Rutgers University Follow Email TwitterI am an Assistant Professor at Rutgers University Computer Science. My research focuses on natural language processing, with an emphasis on Responsible AI. I work on problems relating to fairness, trustworthiness, and safety. In addition to these topics, I am also interested in model reasoning and human-AI collaboration. My research is interdisciplinary, and I have worked with academics in other disciplines, such as public health, gender studies, and political science.Previously, I was a postdoctoral fellow at the Center for Language and Speech Processing (CLSP) at Johns Hopkins University, advised by Mark Dredze and Michelle Kaufman. I obtained my Ph.D. from the University of California Santa Barbara, where I worked with Professor William Wang.Note: I will not be recruiting new PhD students during the 2025-2026 academic year.Selected PublicationsIain Xie Weissburg, Sathvika Anand, Sharon Levy, Haewon Jeong. “LLMs are Biased Teachers: Evaluating LLM Bias in Personalized Education”. In Proceedings of Conference of the North American Chapter of the Association for Computational Linguistics (NAACL 2025) [paper]Sharon Levy, Tahilin Sanchez Karver, William D. Adler, Michelle R. Kaufman, Mark Dredze. “Evaluating Biases in Context-Dependent Sexual and Reproductive Health Questions”. In Proceedings of Conference on Empirical Methods in Natural Language Processing (EMNLP 2024) [paper]Sharon Levy, William D. Adler, Tahilin Sanchez Karver, Mark Dredze, Michelle R. Kaufman. “Gender Bias in Decision-Making with Large Language Models: A Study of Relationship Conflicts”. In Proceedings of Conference on Empirical Methods in Natural Language Processing (EMNLP 2024) [paper]Sharon Levy, Neha Anna John, Ling Liu, Yogarshi Vyas, Jie Ma, Yoshinari Fujinuma, Miguel Ballesteros, Vittorio Castelli, Dan Roth. “Comparing Biases and the Impact of Multilingual Training across Multiple Languages”. In Proceedings of Conference on Empirical Methods in Natural Language Processing (EMNLP 2023), Long Paper, ACL.[paper]Alex Mei*, Sharon Levy*, William Yang Wang. “ASSERT: Automated Safety Scenario Red Teaming for Evaluating the Robustness of Large Language Models”. In Findings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP 2023)[paper]Matthew Ho*, Aditya Sharma*, Justin Chang*, Michael Saxon, Sharon Levy, Yujie Lu and William Yang Wang. “WikiWhy: Answering and Explaining Cause-and-Effect Questions”. In Proceedings of the International Conference on Learning Representations (ICLR 2023), Oral Paper: Top 5% out of all 4019 submissions. [paper]Sharon Levy, Emily Allaway, Melanie Subbiah, Lydia Chilton, Desmond Patton, Kathleen McKeown and William Yang Wang. “SafeText: A Benchmark for Exploring Physical Safety in Language Models”. In Proceedings of Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), Long Paper, ACL. [paper]Sharon Levy, Robert E. Kraut, Jane A. Yu, Kristen M. Altenburger, Yi-Chia Wang. “Understanding Conflicts in Online Conversations”. In Proceedings of the ACM Web Conference 2022 (WWW ’22). [paper]Sharon Levy, Michael Saxon, William Yang Wang. “Investigating Memorization of Conspiracy Theories in Text Generation”. Findings of the Association for Computational Linguistics: ACL-IJCNLP 2021. [paper] [blog post]Sharon Levy, Wenhan Xiong, Elizabeth Belding, William Yang Wang. “SafeRoute: Learning to Navigate Streets Safely in an Urban Environment”. In ACM Transactions on Intelligent Systems and Technology (TIST) 2020. [paper]Sophie Groenwold*, Lily Ou*, Aesha Parekh*, Samhita Honnavalli*, Sharon Levy, Diba Mirza and William Yang Wang. “Investigating African-American Vernacular English in Transformer-Based Text Generation” In Proceedings of Conference on Empirical Methods in Natural Language Processing (EMNLP 2020), Short Paper, ACL. [paper]",
  "content_length": 3936,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:35"
}