{
  "name": "Shashank Sonkar",
  "homepage": "https://www.cecs.ucf.edu/faculty/shashank-sonkar",
  "status": "success",
  "content": "Shashank Sonkar Skip to main content Return to Directory Shashank Sonkar Assistant Professor Email Department Computer Science Office E-mail shashank.sonkar@ucf.edu Google Scholar Shashank Sonkar X/Twitter Biography & Research Education & Specialties News & Media Biography Shashank Sonkar is an assistant professor in the UCF Department of Computer Science and a faculty member at the Institute of Artificial Intelligence. His research focuses on understanding and advancing the reasoning capabilities of large language models, as well as the computational modeling of human learning and cognition. This work underpins the development of next-generation personalization technologies across multiple fields, with education as a primary domain of impact. Recent Publications Sankalan Pal Chowdhury, Nico Daheim, Ekaterina Kochmar, Jakub Macina, Donya Rooein, Mrinmaya Sachan, and Shashank Sonkar. 2025. Large Language Models for Education: Understanding the Needs of Stakeholders, Current Capabilities and the Path Forward. In Proceedings of the 20th Workshop on Innovative Use of NLP for Building Educational Applications (BEA 2025), pages 1–10, Vienna, Austria. Association for Computational Linguistics. Sonkar, Shashank, Naiming Liu, Xinghe Chen, and Richard Baraniuk. \"Turing-Like Test for Personalized Educational AI.\" In International Conference on Artificial Intelligence in Education, pp. 405-412. Cham: Springer Nature Switzerland, 2025. Liu, Naiming, Shashank Sonkar, and Richard Baraniuk. \"Do LLMs Make Mistakes Like Students? Exploring Natural Alignments Between Language Models and Human Error Patterns.\" In International Conference on Artificial Intelligence in Education, pp. 364-377. Cham: Springer Nature Switzerland, 2025. Shashank Sonkar, Naiming Liu, MyCo Le, and Richard Baraniuk. 2024. MalAlgoQA: Pedagogical Evaluation of Counterfactual Reasoning in Large Language Models and Implications for AI in Education. In Findings of the Association for Computational Linguistics: EMNLP 2024, pages 15554–15567, Miami, Florida, USA. Association for Computational Linguistics. Shashank Sonkar, Naiming Liu, and Richard Baraniuk. 2024. Student Data Paradox and Curious Case of Single Student-Tutor Model: Regressive Side Effects of Training LLMs for Personalized Learning. In Findings of the Association for Computational Linguistics: EMNLP 2024, pages 15543–15553, Miami, Florida, USA. Association for Computational Linguistics. Shashank Sonkar, Kangqi Ni, Sapana Chaudhary, and Richard Baraniuk. 2024. Pedagogical Alignment of Large Language Models. In Findings of the Association for Computational Linguistics: EMNLP 2024, pages 13641–13650, Miami, Florida, USA. Association for Computational Linguistics. Shashank Sonkar, Naiming Liu, Debshila Mallick, and Richard Baraniuk. 2023. CLASS: A Design Framework for Building Intelligent Tutoring Systems Based on Learning Science principles. In Findings of the Association for Computational Linguistics: EMNLP 2023, pages 1941–1961, Singapore. Association for Computational Linguistics. Education Ph.D. in Electrical and Computer Engineering, Rice University M.S. in Electrical and Computer Engineering, Rice University B.Tech in Computer Science and Engineering, Indian Institute of Technology, Kanpur Specialties Natural Language Processing Large Language Models Cognitive Modeling Artificial Intelligence in Education Learning Sciences In The News UCF Strengthens Investment in Engineering, Computer Science With 39 New Faculty (August 14, 2025)",
  "content_length": 3509,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:57"
}