{
  "name": "Shaun Wallace",
  "homepage": "https://shaunwallace.org",
  "status": "success",
  "content": "I am an Assistant Professor of Computer Science at the University of Rhode Island (URI). I lead the Human-Centered Experiential Technologies lab (HAX). My research starts with Human-Computer Interaction, and combines it with Systems, Data Science, Human-Centered AI, and Social Computing. I build public research systems as products to personalize and augment human information interactions. My research has been supported by The Readability Consortium, Adobe, Google, PLEJ, and NASA. I received my PhD in Computer Science from Brown University, advised by Jeff Huang at the Brown HCI Group. I received my masters degree from the University of Limerick in Music Technology. I also received my undergraduate degree from the University of Rhode Island in Management Science and Information Systems. Before joining URI, I worked in industry for over 15 years from junior to lead roles developing full-stack web applications, distributed systems, and data services. Papers Towards Fair and Equitable Incentives to Motivate Paid and Unpaid Crowd Contributions Shaun Wallace, Talie Massachi, Jiaqi Su, Dave B Miller, Jeff Huang CHI 2025 Chirp: The Impact of Private Online Self-Disclosure on Perceived Social Support Talie Massachi, John Roy, Lauren Choi, Gabriela Hoefer, Shaun Wallace, Jeff Huang CSCW 2024 Digital Reading Rulers: Evaluating Inclusively Designed Rulers for Readers With and Without Dyslexia Aleena Nickalus, Tianyuan Cai, Zoya Bylinskii, Shaun Wallace CHI 2023 Web Table Formatting Affects Readability on Mobile Devices Christopher Tensmeyer, Zoya Bylinski, Tianyuan Cai, Dave B Miller, Ani Nenkova, Aleena Niklaus, Shaun Wallace WWW 2023 Personalized Font Recommendations: Combining ML and Typographic Guidelines to Optimize Readability Tianyuan Cai, Shaun Wallace, Tina Rezvanian, Jonathan Dobres, Bernard Kerr, Samuel Berlow, Jeff Huang, Ben D Sawyer, Zoya Bylinskii DIS 2022 Towards Individuated Reading Experiences: Different Fonts Increase Reading Speed for Different Individuals Shaun Wallace, Zoya Bylinskii, Jon Dobres, Bernard Kerr, Sam Berlow, Rick Treitman, Kathleen Arpin, Dave B Miller, Jeff Huang, Ben Sawyer TOCHI 2022 Readability Research: An Interdisciplinary Approach * 27 co-authors who contributed equally FnT HCI 2022 The TESS Triple-9 Catalog: 999 uniformly vetted candidate exoplanets Luca Cacciapuoti, Veselin B. Kostov, Marc Kuchner, Elisa V. Quintana, Knicole D. Colón, Jonathan Brande, Susan E. Mullally, Quadry Chance, Jessie L. Christiansen, John P. Ahlers, Marco Z. Di Fraia, Hugo A. Durantini Luca, Riccardo M. Ienco, Francesco Gallo, Lucas T. de Lima, Michiharu Hyogo, Marc Andrés-Carcasona, Aline U. Fornear, Julien S. de Lambilly, Ryan Salik, John M. Yablonsky, Shaun Wallace, Sovan Acharya MNRAS 2022 Case Studies on the Motivation and Performance of Contributors Who Verify and Maintain In-Flux Tabular Datasets Shaun Wallace, Alexandra Papoutsaki, Neilly H. Tan, Hua Guo, Jeff Huang CSCW 2021 Optimizing Electronic Health Records Through Readability Rachel V Ball, Dave B Miller, Shaun Wallace, Kathlyn Camargo Macias, Mahmoud Ibrahim, Ernesto Robalino Gonzaga, Olga Karasik, Dekai R Rohlsen-Neal, Sarah Barrientos, Edward A Ross, Abdo Asmar, Ashley M Hughes, Peter A Hancock, Ben D Sawyer HFES 2021 Sketchy: Drawing Inspiration from the Crowd Shaun Wallace, Brendan Le, Luis Leiva, Aman Haq, Ari Kintisch, Gabrielle Bufrem, Linda Chang, Jeff Huang CSCW 2020 Drafty: Enlisting Users to be Editors who Maintain Structured Data Shaun Wallace, Lucy van Kleunen, Marianne Aubin-Le Quere, Abraham Peterkin, Yirui Huang, Jeff Huang HCOMP 2017 Short Papers and Workshops Priming at Scale: An Evaluation of Using AI to Generate Primes for Mobile Readers Namrata Srivastava, Jennifer Healey, Rajiv Jain, Guanli Liu, Ying Ma, Borano Llana, Dragan Gasevic, Tilman Dingler, Shaun Wallace CHI LBW 2025 Research Methods for People in a Hurry Dave B Miller, Shaun Wallace CHI Course 2025 VizieR Online Data Catalog: TESS Triple-9 Catalog (Cacciapuoti+, 2022) L Cacciapuoti, VB Kostov, M Kuchner, EV Quintana, KD Colon, J Brande, SE Mullally, Q Chance, JL Christiansen, JP Ahlers, MZ di Fraia, Luca HA Durantini, RM Ienco, F Gallo, LT de Lima, M Hyogo, M Andres-Carcasona, AU Fornear, JS de Lambilly, R Salik, JM Yablonsky, S Wallace, S Acharya VizieR 2025 AnVILMEDFORD: Documenting Cloud-Based Analysis Projects Using the MEDFORD Metadata Language Benjamin Stubbs, Polina Shpilker, Michael Sayers, Shaun Wallace, Noah M Daniels, Alva Couch IEEE Big Data 2024 Cross-Referencing Metadata Through an Extension of the MEDFORD Language Polina Shpilker, Benjamin Stubbs, Michael Sayers, Lenore Cowen, Shaun Wallace, Alva Couch, Noah M Daniels 2024 Generative Primes and Summaries for Reading in Distractive Environments Tilman Dingler, Namrata Srivastava, Shaun Wallace AMSWS 2023 Debiased Label Aggregation for Subjective Crowdsourcing Tasks Shaun Wallace, Tianyuan Cai, Brendan Le, Luis A Leiva CHI LBW 2022 Research Methods for People in a Hurry: An introduction to research methods in computer-human interaction, psychology, and human factors Dave B Miller, Shaun Wallace CHI Course 2022 Accelerating Adult Readers with Typeface: A Study of Individual Preferences and Effectiveness Shaun Wallace, Rick Treitman, Jeff Huang, Ben Sawyer, Zoya Bylinskii CHI LBW 2020 Visualizing Self-Tracked Mobile Sensor and Self-Reflection Data to Help Sleep Clinicians Infer Patterns Shaun Wallace, David Sasson, Hua Guo CHI LBW 2017 Assistant Professor Computer Science University of Rhode Island Tyler Hall, Kingston RI shaun.wallace [at] uri.edu Curriculum Vitae Research HAX Lab @ URI Drafty CS Professors CS Open Rankings Virtual Readability Lab Teaching Operating Systems and Networks Fall 23, Spring 24, Fall 24, Spring 25, Fall 25 Human-Computer Interaction Spring 24, Spring 26 Advanced Topics in Software Engineering Fall 24, Fall 25 Press Google Fonts How type influences readability The Washington Post What's your type? Try these tests to pick the perfect font for you. Nielsen Norman Group Best Font for Online Reading: No Single Answer My CS Ph.D. How To Interpret School Rankings Fast Company Are some fonts ageist? Adobe Readability Research: This New Field Can Help Us All Read Better EdTech Center World Education Readability Features & Technology for Better Reading Readability Matters Find Your Best Format Virtual Readability Lab",
  "content_length": 6369,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:55"
}