{
  "name": "Shawn Shan",
  "homepage": "https://www.shawnshan.com",
  "status": "success",
  "content": "Shawn Shan | Security, Privacy & Trustworthy AI Research @ Dartmouth CS About Me I am an incoming Assistant Professor of Computer Science at Dartmouth College, with a Ph.D. from the University of Chicago. My work address the most pressing challenges and concerns in AI. My research examines the technical fundations of AI systems, with a focus on evaluating their behavior, identifying limitations, and developing methods for security and accountability. My work has been featured in outlets including The New York Times, BBC, The Wall Street Journal, and TechCrunch. My contributions have been recognized with the Forbes 30 Under 30 award, MIT Technology Review Innovator of the Year, and MIT 35 Under 35. This research has also earned the USENIX Internet Defense Prize, Distinguished Paper Awards at top conferences, and the Concept Art Association’s Community Impact Award. 🚀 I am recruiting 2–3 fully funded PhD students to start in Fall 2026. If you are interested in security and trustworthy AI, apply in the Fall 2025 cycle through the Dartmouth CS system and mention me in your research statement. You are welcome to email me your CV beforehand. Email: Shawn.Shan AT dartmouth.edu LinkedIn » Google Scholar » News We are organizing the first ArtSec Workshop at Oakland'26. Please consider to submit your work. Glaze has been downloaded over 7.6 million times in 150+ countries; Nightshade has reached over 2.5 million downloads. Named the MIT Technology Review 2024 Innovator of the Year and 35 Under 35. Selected for the 2024 Forbes 30 Under 30 list. Featured in MIT Technology Review for the Nightshade project. Glaze recognized by TIME Magazine as a 2023 Best Invention (Special Mention). Awarded the Internet Defense Prize and a Distinguished Paper Award at USENIX Security. Some of my recorded talks Nightshade keynote Medientage München Conference'24 Glaze talk for creators British Screen Forum Conference'23 Glaze talk for security researchers USENIX Security Symposium'23 S",
  "content_length": 2000,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:58"
}