{
  "name": "Shayan Oveis Gharan",
  "homepage": "http://homes.cs.washington.edu/~shayan",
  "status": "success",
  "content": "Shayan Oveis Gharan's homepage In the name of God Shayan Oveis Gharan Lazowska Professor of Computer Science & Engineering Computer Science and Engineering University of Washington A short bio and my CV I am mainly interested in the design and analysis of algorithms using algebraic techniques. In Spring 2019 I co-organized a semester long program on Geometry of Polynomials. Here is a research vignette about my works on Log-concave polynomials with connections to the Geometry of Polynomials program. Recent/Selected Publications J. Leake, S. Oveis Gharan, Trickle-down Theorems via C-Lorentzian Polynomials II: Pairwise Spectral Influence and Improved Dobrushin's Condition, 2025. J. Leake, K. Lindberg, S. Oveis Gharan, Optimal Trickle-Down Theorems for Path Complexes via C-Lorentzian Polynomials with Applications to Sampling and Log-Concave Sequences, FOCS 2025. S. Oveis Gharan, A. Sahami, Unweighted Code Sparsifiers and Thin Subgraphs, submitted 2025. F. Ebrahimnejad, A. Nagda, S. Oveis Gharan, On approximability of the Permanent of PSD matrices, STOC 2025. D. Abdolazimi, K. Lindberg, S. Oveis Gharan, On Optimization and Counting of Non-Broken Bases of Matroids, Random 2023. A. Karlin, N. Klein, S. Oveis Gharan, A (Slightly) Improved Deterministic Approximation Algorithm for Metric TSP, IPCO, 2023. A. Abdolazimi, S. Oveis Gharan, An Improved Trickle-Down Theorem for Partite Complexes, CCC 2023. D. Abdolazimi, A. Karlin, N. Klein, S. Oveis Gharan, Matroid Partition Property and the Secretary Problem, ITCS 2023. A. Karlin, N. Klein, S. Oveis Gharan, A (Slightly) Improved Bound on the Integrality Gap of the Subtour LP for TSP, FOCS 2022. A. Karlin, N. Klein, S. Oveis Gharan, X. Zhang An Improved Approximation Algorithm for the Minimum k-Edge Connected Multi-Subgraph Problem, STOC 2022. D. Abdolazimi, K. Liu, S. Oveis Gharan, A Matrix Trickle-Down Theorem on Simplicial Complexes and Applications to Sampling Colorings, FOCS 2021. N. Anari, K. Liu, S. Oveis Gharan, Cynthia Vinzant, T. Vuong, Log-Concave Polynomials IV: Approximate Exchange, Tight Mixing Times, and Near-Optimal Sampling of Forests, STOC 2021. A. Karlin, N. Klein, S. Oveis Gharan, A (Slightly) Improved Approximation Algorithm for Metric TSP, STOC 2021. N. Anari, K. Liu, S. Oveis Gharan, Spectral Independence in High-Dimensional Expanders and Applications to the Hardcore Model, FOCS 2020, invited to special issue. N. Anari, K. Liu, S. Oveis Gharan, C. Vinzant, Log-Concave Polynomials III: Mason's Ultra-Log-Concavity Conjecture for Independent Sets of Matroids, submitted, 2018. N. Anari, K. Liu, S. Oveis Gharan, C. Vinzant, Log-Concave Polynomials II: High-Dimensional Walks and an FPRAS for Counting Bases of a Matroid, STOC 2019. N. Anari, S. Oveis Gharan, C. Vinzant, Log-Concave Polynomials I: Entropy and a Deterministic Approximation Algorithm for Counting Bases of Matroids, FOCS 2018. N. Anari, S. Oveis Gharan, Effective-Resistance-Reducing Flows, Spectrally Thin Trees, and Asymmetric TSP. See also our recent extension of the proof of Kadison-Singer conjecture by Marcus, Spielman, and Srivastava. See this note for a somewhat short exposition of the ideas. Also, here are short and long presentations of the ideas of the paper. See here for a nice article by Dana Mackenzie about this article. S. Oveis Gharan, New Rounding Techniques for the Design and Analysis of Approximation Algorithms , PhD thesis, Stanford 2013, ACM Doctoral Dissertation Award Honorable Mention. S. Oveis Gharan, A. Saberi, M. Singh, A Randomized Rounding Approach to the Traveling Salesman Problem. , FOCS 2011, best paper award. J. R. Lee, S. Oveis Gharan, L. Trevisan, Multi-way spectral partitioning and higher-order Cheeger inequalities , STOC 2012, JACM 2014. A. Asadpour, A. Madry, M. Goemans, S. Oveis Gharan, A. Saberi, An O(log n/ log log n)-approximation Algorithm for the Asymmetric Traveling Salesman Problem , SODA 2010, best paper award. See here for a full list of my publications. Awards and Honors: 2025 Michael and Sheila Held Prize 2024 Lazowska Endowed Professorship 2023 Smale Prize 2022 Simons Investigator Award 2021 Presburger Award 2021 Jean-Loup Baer Professorship 2019 Sloan Fellowship 2017 ONR Young Investigator Award 2016 10 scientist to watch by Science News 2016 NSF Career Award 2014 ACM Dissertation Award (honorable mention) Best paper award SODA 2010, FOCS 2011, STOC 2019, STOC 2021 Program Committee: SODA 2015, APPROX 2016, ESA 2017, ITCS 2018, FOCS 2019, SODA 2021, SODA 2023, FOCS 2023,ITCS 2024,FOCS 2025. Editor: Siam Journal of Computing Students / Mentee: Arvin Sahami. Dante Tjowasi Dorna Abdolazimi, now at Movable Ink. Nathan Klein (co-advised with Anna Karlin) Assitant Professor of Computer Science at Boston University. Kuikui Liu, Assitant Professor of Computer Science and Engineering at MIT. Farzam Ebrahimnejad (co-advised with James Lee) Robbie Weber, (co-advised with Anna Karlin) now Assistant Teaching Professor at Univeristy of Washington Alireza Rezaei, now at Volen group. Mert Saglam (co-advised with Paul Beame), now at Google. Nima Anari, now Assistant Professor of Computer Science at Stanford University. Teaching Approximate Counting and Mixing Time of Markov Chains, Fall 2024 Modern Spectral Graph Theory, Winter 2022 The Polynomial Paradigm in Algorithms, Winter 2020 Counting and Sampling, Fall 2017. Recent Developments in Approximation Algorithms (CSE 599), Spring 2015. Design and Analysis of Algoirthms I (CSE 521) Spring 2016, Winter 2017, Fall 2018, Fall 2019 Fall 2021. Design and Analysis of Algorithms (CSE 421) Winter 2018, Spring 2019, Spring 2020 Foundations of Computing I (CSE 311)Fall 2015, Fall 2016. Contact Information Room 636, Paul Allen Center for Computer Science & Engineering Box 352350, University of Washington, Seattle, WA 98195-2350. (206) 685-2181 email: shayan@cs.washington.edu",
  "content_length": 5869,
  "method": "requests",
  "crawl_time": "2025-12-01 14:26:59"
}