{
  "name": "Shazia Wasim Sadiq",
  "homepage": "http://researchers.uq.edu.au/researcher/792",
  "status": "success",
  "content": "Professor Shazia Sadiq | UQ Experts Skip to menu Skip to content Skip to footer Professor Shazia Sadiq Email: shazia@eecs.uq.edu.au Phone: +61 7 336 53481 Positions Affiliate of UQ Cyber Research Centre UQ Cyber Research Centre Faculty of Engineering, Architecture and Information Technology Centre Director of Centre for Enterprise AI Centre for Enterprise AI Faculty of Engineering, Architecture and Information Technology Centre Director of ARC Training Centre for Information Resilience ARC Training Centre for Information Resilience Faculty of Engineering, Architecture and Information Technology Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Shazia Sadiq FTSE is a Professor of Computer Science at the School of Information Technology and Electrical Engineering, The University of Queensland. Her research focusses on responsible data management and aims to reduce the socio-technical barriers to data driven transformation, by assisting organisations to create, protect and sustain agile data pipelines. Her work has contributed to advancing knowledge on data quality management, scalable data curation and cleaning, and bias mitigation for advanced opaque analytical models and techniques, and process improvements for data-driven organisations. She is part of the Data Science discipline that has received the highest ranking for excellence in research for Australia in every round of ERA. She has published over 200 peer-reviewed publications and attracted $20million in research funding from the Australian Research Council, industry and various national and international funding bodies. She has recieved numerous research awards including Test-of-Time award for influential work on Business Process Compliance, Best Use of Data award from Queensland Government, Distinguished Researcher Award from Women in Tech, and several best paper awards at international conferences. Shazia has been a devoted lecturer for two decades, and an advocate of learning analytics and AI in Education for improving personalized learning and equitable graduate outcomes. In 2012, she received an institutional award for teaching excellence and in 2016 she spearheaded the highly successful Master of Data Science program at UQ, that is helping overcome skill shortages in Queensland for qualified data scientists. She is currently leading UQ's AI Strategy and Capability Development work as the convenor of UQ's AI Research Network that brings together over 100 interdisciplinary researchers. Shazia is a Fellow of the Australian Academy of Technological Sciences and Engineering, immediate past chair of the National Committee on Information and Communication Sciences at the Australian Academy of Science 2019-2023, a member of The Australian Research Council College of Experts 2018-2021, and Centre Director for the ARC Industry Transformation Training Centre on Information Resilience 2020-2025. Read more Read less Availability Professor Shazia Sadiq is: Available for supervision Media expert Fields of research Information and Computing Sciences Qualifications Bachelor of Science, Quaid-i-Azam University Masters (Coursework), Quaid-i-Azam University Masters (Coursework), Asian Institute of Technology Thailand Research interests Data and Information Quality Read more Read less Database Mangement Read more Read less Business Process Management Read more Read less Conceptual Modelling Read more Read less Works Search Professor Shazia Sadiq’s works on UQ eSpace All (301) Book (2) Journal Article (86) Other Outputs (4) Edited Outputs (8) Conference Publication (188) Book Chapter (13) 2026 Journal Article Preface Bork, Dominik, Lukyanenko, Roman, Sadiq, Shazia, Bellatreche, Ladjel and Pastor, Oscar (2026). Preface. Lecture Notes in Computer Science, 16189 LNCS, v-vi. Preface 2025 Journal Article Leveraging Artificial Intelligence Technology for Mapping Publications to Sustainable Development Goals Yin, Hui, Aryani, Amir, Lambert, Gavin, Wu, Zhuochen, Nambiar, Nakul, White, Marcus, Salvador-Carulla, Luis, Sadiq, Shazia, Sojli, Elvira, Boddy, Jennifer, Murray, Greg and Tham, Wing Wah (2025). Leveraging Artificial Intelligence Technology for Mapping Publications to Sustainable Development Goals. Array, 27 100419, 100419-27. doi: 10.1016/j.array.2025.100419 Leveraging Artificial Intelligence Technology for Mapping Publications to Sustainable Development Goals 2025 Conference Publication Progressive Generalization Risk Reduction for Data-Efficient Causal Effect Estimation Wen, Hechuan, Chen, Tong, Ye, Guanhua, Chai, Li Kheng, Sadiq, Shazia and Yin, Hongzhi (2025). Progressive Generalization Risk Reduction for Data-Efficient Causal Effect Estimation. KDD '25: The 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining, Toronto, Canada, 3 - 7 August 2025. New York, NY United States: Association for Computing Machinery. doi: 10.1145/3690624.3709305 Progressive Generalization Risk Reduction for Data-Efficient Causal Effect Estimation 2025 Conference Publication ID-free not risk-free: LLM-powered agents unveil risks in ID-free recommender systems Wang, Zongwei, Gao, Min, Yu, Junliang, Gao, Xinyi, Nguyen, Quoc Viet Hung, Sadiq, Shazia and Yin, Hongzhi (2025). ID-free not risk-free: LLM-powered agents unveil risks in ID-free recommender systems. 48th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (ACM SIGIR 2025), Padua, Italy, 13-18 July 2025. New York, NY, United States: Association for Computing Machinery. doi: 10.1145/3726302.3730003 ID-free not risk-free: LLM-powered agents unveil risks in ID-free recommender systems 2025 Conference Publication Continual text-to-video retrieval with frame fusion and task-aware routing Zhao, Zecheng, Chen, Zhi, Huang, Zi, Sadiq, Shazia and Chen, Tong (2025). Continual text-to-video retrieval with frame fusion and task-aware routing. 48th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (ACM SIGIR 2025), Padua, Italy, 13-18 July 2025. New York, NY, United States: Association for Computing Machinery. doi: 10.1145/3726302.3729936 Continual text-to-video retrieval with frame fusion and task-aware routing 2025 Conference Publication How do experts make sense of&nbsp;integrated process models? Chen, Tianwa, Weber, Barbara, Shanks, Graeme, Demartini, Gianluca, Indulska, Marta and Sadiq, Shazia (2025). How do experts make sense of&nbsp;integrated process models?. 37th International Conference, CAiSE 2025, Vienna, Austria, 16-20 June 2025. Cham, Switzerland: Springer Switzerland. doi: 10.1007/978-3-031-94571-7_1 How do experts make sense of&nbsp;integrated process models? 2025 Conference Publication LLM-Based Semantic Augmentation for Harmful Content Detection Meguellati, Elyas, Zeghina, Assaad, Sadiq, Shazia and Demartini, Gianluca (2025). LLM-Based Semantic Augmentation for Harmful Content Detection. Nineteenth International AAAI Conference on Web and Social Media, Copenhagen, Denmark, 23-26 June 2025. Washington, DC United States: Association for the Advancement of Artificial Intelligence (AAAI). doi: 10.1609/icwsm.v19i1.35868 LLM-Based Semantic Augmentation for Harmful Content Detection 2025 Journal Article Enhancing peer feedback provision through user interface scaffolding: A comparative examination of scripting and self-monitoring techniques Lahza, Hatim Fareed, Demartini, Gianluca, Noroozi, Omid, Gašević, Dragan, Sadiq, Shazia and Khosravi, Hassan (2025). Enhancing peer feedback provision through user interface scaffolding: A comparative examination of scripting and self-monitoring techniques. Computers and Education, 230 105260, 1-22. doi: 10.1016/j.compedu.2025.105260 Enhancing peer feedback provision through user interface scaffolding: A comparative examination of scripting and self-monitoring techniques 2025 Conference Publication Let the Augmentation Path Speak Ji, Daomin, Luo, Hui, Bao, Zhifeng, Sadiq, Shazia and Culpepper, J. Shane (2025). Let the Augmentation Path Speak. New York, NY, USA: ACM. doi: 10.1145/3701716.3715183 Let the Augmentation Path Speak 2025 Conference Publication Are Large Language Models Good Data Preprocessors? Meguellati, Elyas, Pratama, Nardiena, Sadiq, Shazia and Demartini, Gianluca (2025). Are Large Language Models Good Data Preprocessors?. WWW '25: The ACM Web Conference 2025, Sydney, NSW Australia, 28 April - 2 May 2025. New York, NY United States: Association for Computing Machinery. doi: 10.1145/3701716.3717568 Are Large Language Models Good Data Preprocessors? 2025 Conference Publication BiasNavi: LLM-Empowered Data Bias Management Yu, Junliang, Huynh, Jay Thai Duong, Fan, Shaoyang, Demartini, Gianluca, Chen, Tong, Yin, Hongzhi and Sadiq, Shazia (2025). BiasNavi: LLM-Empowered Data Bias Management. ACM Web Conference 2025 (WWW'25), Sydney, NSW, Australia, 28 April - 2 May 2025. New York, NY, United States: ACM. doi: 10.1145/3701716.3715169 BiasNavi: LLM-Empowered Data Bias Management 2025 Journal Article Artificial Intelligence in Multimodal Learning Analytics: A Systematic Literature Review Mohammadi, Mehrnoush, Tajik, Elham, Martinez-Maldonado, Roberto, Sadiq, Shazia, Tomaszewski, Wojtek and Khosravi, Hassan (2025). Artificial Intelligence in Multimodal Learning Analytics: A Systematic Literature Review. Computers and Education: Artificial Intelligence, 8 100426, 100426. doi: 10.1016/j.caeai.2025.100426 Artificial Intelligence in Multimodal Learning Analytics: A Systematic Literature Review 2025 Journal Article AI-assisted co-creation: bridging skill gaps in student-generated content Pozdniakov, Stanislav, Brazil, Jonathan, Mohammadi, Mehrnoush, Dollinger, Mollie, Sadiq, Shazia and Khosravi, Hassan (2025). AI-assisted co-creation: bridging skill gaps in student-generated content. Journal of Learning Analytics, 12 (1), 129-151. doi: 10.18608/jla.2025.8601 AI-assisted co-creation: bridging skill gaps in ",
  "content_length": 23746,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:06"
}