{
  "name": "Sheila A. McIlraith",
  "homepage": "http://www.cs.toronto.edu/~sheila",
  "status": "success",
  "content": "Sheila McIlraith Professor, Department of Computer Science Canada CIFAR AI Chair (Vector Institute) Associate Director and Research Lead, Schwartz Reisman Institute for Technology and Society Affiliate Member, U of T Robotics Institute D.L. Pratt Building, Room 398D phone: 416-946-8484 Department of Computer Science email: sheila [at] cs [dot] toronto [dot] edu University of Toronto home page: http://www.cs.toronto.edu/~sheila/ admin: Gizelda Pereira, 416-946-0161 Name pronunciation Google Scholar CV Sheila McIlraith is a Professor in the Department of Computer Science, University of Toronto, a Canada CIFAR AI Chair (Vector Institute for Artificial Intelligence), and an Associate Director and Research Lead of the Schwartz Reisman Institute for Technology and Society. Prior to joining U of T, McIlraith spent six years as a Research Scientist at Stanford University, and one year at Xerox PARC. McIlraith is the author of over 150 scholarly publications in the area of knowledge representation, automated reasoning and machine learning. Her work focuses on AI sequential decision making, broadly construed, through the lens of human-compatible AI. McIlraith is a fellow of the ACM, a fellow of the Association for the Advancement of Artificial Intelligence (AAAI), and a past President of KR Inc., the international scientific foundation concerned with fostering research and communication on knowledge representation and reasoning. She is currently serving as Standing Committee Chair of the Stanford One Hundred Year Study on Artificial Intelligence (AI100) and a member of the Canadian AI Safety Institutes (CAISI) Research Council. McIlraith is an associate editor of the Journal of Artificial Intelligence Research (JAIR), a past associate editor of the journal Artificial Intelligence (AIJ), and a past board member of Artificial Intelligence Magazine. In 2018, McIlraith served as program co-chair of the 32nd AAAI Conference on Artificial Intelligence (AAAI-18). She also served as program co-chair of the International Conference on Principles of Knowledge Representation and Reasoning (KR2012), and the International Semantic Web Conference (ISWC2004). McIlraith’s early work on Semantic Web Services has had notable impact. In 2011 she and her co-authors were honoured with the SWSA 10-year Award, a test of time award recognizing the highest impact paper from the International Semantic Web Conference, 10 years prior; in 2022 McIlraith and co-authors were honoured with the 2022 ICAPS Influential Paper Award, recognizing a significant and influential paper published 10 years prior at the International Conference on Automated Planning and Scheduling; and in 2023 McIlraith and co-authors were honoured with the IJCAI-JAIR Best Paper Prize, awarded annually to an outstanding paper published in JAIR in the preceding five years. In 2024 she was recognized by CAIAC, the Canadian AI Society, with a Lifetime Achievement Award for research excellence in AI. In 2020, McIlraith catalyzed and continues to co-lead the highly successful Embedded Ethics Education Initiative (E3I) at UofT. The E3I leadership team has been honoured with the 2024 UofT Northrop Frye Award of Excellence, and a 2025 national D2L Award for Innovation in Teaching and Learning. UofT currently sees annual student enrollment numbers in courses with E3I programming of nearly 10,000. McIlraith’s areas of research include: (Data-intensive) sequential decision making in its many guises Human-compatible AI, AI Safety, and AI Alignment Knowledge and belief, Epistemic planning, Theory of Mind Commonsense reasoning Reinforcement learning with human tasking and advice Plan and program synthesis from preferences, safety constraints and sketches specified in LTL, Golog, HTNs, automata, … KRR for the Semantic Web, including representation and automated composition of customized and personalized Services and Processes on the Web and in the Cloud Cognitive robotics Diagnostic problem solving (diagnosis, testing and repair) of discrete and hybrid (discrete + continuous) dynamical systems Reasoning with logical theories, including detecting and exploiting structure in logical theories to improve the efficiency of reasoning Mathematical foundations of KRR Banner photo credit: Len Disenhouse",
  "content_length": 4288,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:03"
}