{
  "name": "Sheldon Andrews",
  "homepage": "http://profs.etsmtl.ca/sandrews",
  "status": "success",
  "content": "Professor Sheldon Andrews Sheldon Andrews Associate Professor of Software and IT Engineering École de technologie supérieure Ph.D. (Computer Science) McGill University 2015 M.A.Sc. (Electrical and Computer Eng.) University of Ottawa 2007 B.Eng. (Computer Engineering) Memorial University 2004 I am an Associate professor of Software and IT Engineering at the École de technologie supérieure and an Adjunct professor of Computer Science at McGill University in Montreal, Canada. I was previously a visiting researcher at Roblox Research. My research interests include real-time physics simulation, 3D character animation, motion capture, simulation of articulated mechanisms, computational contact mechanics, and measurement based modelling for virtual environments. A complete list of my publications, posters, talks, and demos is available here. Professional Activities Program Chair SCA 2025 MIG 2024 GI 2022 I3D 2020 VRIPHYS 2018 Conference Chair I3D 2019 Posters Chair GI 2018 I3D 2018 Steering Committee I3D 2019-2022 VRIPHYS 2018-2019 Program Committee SIGGRAPH Asia 2023 SIGGRAPH 2021, 2025 SIGGRAPH Unified Jury 2019, 2022 SCA 2018, 2019, 2020, 2021, 2022, 2023, 2024 MIG 2018, 2019, 2020, 2022, 2025 VRIPHYS 2018 IEEE AIVR 2018 Tertiary Reviewer (selected) SIGGRAPH 2016, 2017, 2018, 2019, 2020, 2022, 2023, 2024, 2025 SIGGRAPH Asia 2013, 2015, 2017, 2020, 2021, 2023, 2024 Eurographics 2012, 2016, 2017 Pacific Graphics 2024 IEEE/RSJ IROS 2018-2020 Computer Graphics Forum (CGF) Computers & Graphics Graphics Interface (GI) IEEE Transactions on Computer Graphics (TVCG) IEEE Robotics and Automation Letters (RA-L) IEEE Computer Graphics and Applications (CGA) Other Committees Secretary, Montreal SIGGRAPH Chapter 2018-2021 Previous and Current Students Current Students Matheus Cavazotti, PhD Hanad Elmi, MASc (co-supervised with Luc Duong) Melissa Katz, PhD (McGill, with Paul Kry) Nicolas Rosset, Post Doc Quoc-Minh Ton-That, PhD (co-supervised by Paul Kry) Hossein Feizollah Zadeh Khoiee, PhD (co-supervised by David Labbé) Loic Nassif, PhD (McGill, with Paul Kry) Yinchu Liu, PhD (co-supervised by Kenny Erleben) Yosr Takouti, MASc (co-supervised by David Labbé) Alex Minh Hoang-Cao, MASc Antoine Boucher, MASc Previous Graduate Students Pranav Agarwal, PhD - went to Wayve Joël Pelletier-Guénette, MASc Alexandre Mercier-Aubin, Post Doc - Professor at Sherbooke University Melissa Katz, M.Sc. (McGill, with Paul Kry) Andreas Enzenhoefer, M.Sc. (McGill, with Paul Kry) Yunhao Luo, MSc (McGill) Omar Zoubir, MEng Juliette Seminaro, MASc (with David Labbé) Benjamin Boineau, MEng (with Adrien Gruson) Anthony Frezzato, MASc Yinchu Liu, MASc Henry Ho, MSc (McGill, with Paul Kry) Abdesselam Guerroudj, MASc Marwen Kraiem, MASc - went to DNEG Nicolas Lefebvre, MASc - went to CM Labs Simulations Nabil Boukadida, MASc (co-supervised with Eric Paquette) - went to AMD Previous Undergraduate and Interns Nellou Michel, Université de Toulon (intern) Joël Pelletier-Guénette, BEng research intern Arsh Tangri, Undergraduate MITACS Globalinks (intern) Syrine Enneifer, McGill University (intern) Lanxuan Zhou, Undergraduate MITACS Globalinks (intern) Dmitri Kolytchev, BEng (intern) - founded Hekaton Studio Prospective Students I am currently looking for Ph.D. and Masters students who are interested in 3D character animation, real-time multibody dynamics, and computational contact mechanics. Please see the list of available projects. Selected Publications GEOPARD: Geometric Pretraining for Articulation Prediction in 3D Shapes P Goyal, D Petrov, S Andrews, Y Ben-Shabat, HT Derek Liu, E Kalogerakis ICCV, 2025 PDF Project Policy-space Interpolation for Physics-based Characters M Rocca, S Andrews, K Erleben PACM CGIT, 2025 PDF Project Real-Time Triangle-SDF Continuous Collision Detection J Pelletier-Guénette, A Mercier-Aubin, S Andrews SCA, 2025 PDF Video Rig My Ride: Automatic Rigging of Physics-based Vehicles for Games M Katz, PG Kry, S Andrews SCA, 2025 PDF Project Video Policy-Space Diffusion for Physics-Based Character Animation M Rocca, S Darkner, K Erleben, S Andrews ACM TOG, 2025 PDF Project Video Multiphysics Simulation Methods in Computer Graphics D Holz, SR Jeske, F Loschner, J Bender, Y Yang, S Andrews CGF, 2025 PDF Adaptive Distributed Simulation of Fluids and Rigid Bodies H Shi, V Zordan, Y Yang, S Andrews MIG, 2024 PDF Video Adaptive Sub-stepping for Constrained Rigid Body Simulations C Giles, S Andrews MIG, 2024 PDF Video Generalized eXtended Finite Element Method for Deformable Cutting via Boolean Operations QM Ton-That, PG Kry, S Andrews CGF, 2024 PDF Slides Video PartwiseMPC: Interactive Control of Contact-Guided Motions N Khoshsiyar, R Gou, T Zhou, S Andrews, M van de Panne CGF, 2024 PDF Video Learning to Play Atari in a World of Tokens P Agarwal, S Andrews, S Ebrahimi Kahou ICML, 2024 PDF Code Slides AdaptNet: Policy Adaptation for Physics-Based Character Control P Xu, K Xie, S Andrews, PG Kry, VB Zordan, M Neff, M McGuire, I Karamouzas, V Zordan SIGGRAPH Asia, 2023 PDF Video Too Stiff, Too Strong, Too Smart: Evaluating Fundamental Problems with Motion Control Policies K Xie, P Xu, S Andrews, VB Zordan, PG Kry PACM CGIT, 2023 PDF Slides Video Parallel Block Neo-Hookean XPBD using Graph Clustering QM Ton-That, PG Kry, S Andrews CAG, 2023 PDF Slides Video Constraint-based Simulation of Passive Suction Cups A Bernardin, E Coevoet, PG Kry, S Andrews, C Duriez, M Marchal ACM TOG, 2022 PDF Video Contact and Friction Simulation for Computer Graphics S Andrews, K Erleben, Z Ferguson SIGGRAPH Courses, 2022 PDF Code Video Synthesizing Get-Up Motions for Physics-based Characters A Frezzato, A Tangri, S Andrews CGF, 2022 PDF Video Graph Partitioning Algorithms for Rigid Body Simulations Y Liu, S Andrews EG, 2022 PDF Video Catching and Throwing Control of a Physically Simulated Hand Y Luo, X Kaixiang, S Andrews, PG Kry MIG, 2021 PDF Video Coupling Friction with Visual Appearance S Andrews, L Nassif, K Erleben, PG Kry PACM CGIT, 2021 PDF Video Distant Collision Response in Rigid Body Simulations E Coevoet, S Andrews, D Relles, PG Kry CGF, 2020 PDF Slides Video The Matchstick Model for Anisotropic Friction Cones K Erleben, M Macklin, S Andrews, PG Kry CGF, 2019 PDF Video Schur Complement-based Substructuring of Stiff Multibody Systems with Contact A Peiret*, S Andrews*, J Kovecses, PG Kry, M Teichmann ACM TOG, 2019 PDF Video Efficient block pivoting for multibody simulations with contact A Enzenhöfer, N Lefebvre, S Andrews I3D, 2019 PDF Video Inverse kinematics problems with exact Hessian matrices K Erleben, S Andrews CaG, 2019 PDF Video MIG'17 paper Supplementary notes GitHub repo Comparison of Mixed Linear Complementarity Problem Solvers for Multibody Simulations with Contact Andreas Enzenhofer, Sheldon Andrews, Marek Teichmann, Jozsef Kövecses VRIPHYS, 2018 PDF Video Task-based design of cable-driven articulated mechanisms J Li, S Andrews, K Birkas, PG Kry SCF, 2017 PDF Video Geometric stiffness for real-time constrained multibody dynamics S Andrews, M Teichmann, PG Kry CGF, 2017 PDF Slides Video Project page Real-time physics-based motion capture with sparse sensors S Andrews, I Huerta, T Komura, L Sigal, K Mitchell CVMP, 2016 PDF Video Project page Blended linear models for reduced compliant mechanical systems S Andrews, M Teichmann, PG Kry TVCG, 2016 PDF Video Publications P Goyal, D Petrov, S Andrews, Y Ben-Shabat, HT Derek Liu, E Kalogerakis. GEOPARD: Geometric Pretraining for Articulation Prediction in 3D Shapes. ICCV, 2025. PDF Project M Rocca, S Andrews, K Erleben. Policy-space Interpolation for Physics-based Characters. PACM CGIT, 2025. PDF Project J Pelletier-Guénette, A Mercier-Aubin, S Andrews. Real-Time Triangle-SDF Continuous Collision Detection. SCA, 2025. PDF Video M Katz, PG Kry, S Andrews. Rig My Ride: Automatic Rigging of Physics-based Vehicles for Games. SCA, 2025. PDF Project Video M Rocca, S Darkner, K Erleben, S Andrews. Policy-Space Diffusion for Physics-Based Character Animation. ACM TOG, 2025. PDF Project Video D Holz, SR Jeske, F Loschner, J Bender, Y Yang, S Andrews. Multiphysics Simulation Methods in Computer Graphics. CGF, 2025. PDF H Shi, V Zordan, Y Yang, S Andrews. Adaptive Distributed Simulation of Fluids and Rigid Bodies. MIG, 2024. PDF Video C Giles, S Andrews. Adaptive Sub-stepping for Constrained Rigid Body Simulations. MIG, 2024. PDF Video QM Ton-That, PG Kry, S Andrews. Generalized eXtended Finite Element Method for Deformable Cutting via Boolean Operations. CGF, 2024. PDF Slides Video N Khoshsiyar, R Gou, T Zhou, S Andrews, M van de Panne. PartwiseMPC: Interactive Control of Contact-Guided Motions. CGF, 2024. PDF Video P Agarwal, S Andrews, S Ebrahimi Kahou. Learning to Play Atari in a World of Tokens. ICML, 2024. PDF Code Slides P Xu, K Xie, S Andrews, PG Kry, VB Zordan, M Neff, M McGuire, I Karamouzas, V Zordan. AdaptNet: Policy Adaptation for Physics-Based Character Control. SIGGRAPH Asia, 2023. PDF Video K Xie, P Xu, S Andrews, VB Zordan, PG Kry. Too Stiff, Too Strong, Too Smart: Evaluating Fundamental Problems with Motion Control Policies. PACM CGIT, 2023. PDF Slides Video QM Ton-That, PG Kry, S Andrews. Parallel Block Neo-Hookean XPBD using Graph Clustering. CAG, 2023. PDF Slides Video A Bernardin, E Coevoet, PG Kry, S Andrews, C Duriez, M Marchal. Constraint-based Simulation of Passive Suction Cups. ACM TOG, 2022. PDF Video S Andrews, K Erleben, Z Ferguson. Contact and Friction Simulation for Computer Graphics. SIGGRAPH Courses, 2022. PDF Code Video A Frezzato, A Tangri, S Andrews. Synthesizing Get-Up Motions for Physics-based Characters. CGF, 2022. PDF Video Y Liu, S Andrews. Graph Partitioning Algorithms for Rigid Body Simulations. EG, 2022. PDF Video Y Luo, X Kaixiang, S Andrews, PG Kry. Catching and Throwing Control of a Physically Simulated Hand. MIG, 2021. PDF Video S Andrews, L Nassif, K Erleben, PG Kry. Coupling Friction with Visual Appearance. PACM CGIT, 2021. PDF Video E Coevoet, S A",
  "content_length": 13180,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:05"
}