{
  "name": "Sheldon H. Jacobson",
  "homepage": "http://shj.cs.illinois.edu",
  "status": "success",
  "content": "Sheldon Howard Jacobson Sheldon H. Jacobson Ph.D. University of Illinois Urbana-Champaign Founder Professor in Computer Science Director, Bed Time Research Institute Director, Institute for Computational Redistricting Director, Simulation and Optimization Laboratory 201 North Goodwin Avenue (MC-258) University of Illinois Urbana, Illinois 61801-2302 Telephone: (217) 244-7275 Fax: (217) 265-4035 Skype: sheldon.jacobson1 Email: shj@illinois.edu Blue Sky: @shjanalytics.bsky.social X: @shjanalytics Career Summary Professional Honors, Awards, and Recognitions Plenaries and Keynotes Delivered Opinion Essays Sheldon Jacobson - Recognizing Faculty at Illinois (video) Google Scholar Page Scopus Page Wikipedia Page Muck Rack Page (communication activities) Recent CV For the Media: Areas of Expertise ORCID ID: 0000-0002-9042-8750 Primary and Affiliate Appointments: Professor of Computer Science Professor of Electrical & Computer Engineering Professor of Industrial & Enterprise Systems Engineering Professor of Mathematics (College of Liberal Arts & Science) Professor of Statistics (College of Liberal Arts & Science) Professor, Carle Illinois College of Medicine Founding Director: Institute for Computational Redistricting (ICOR) Founding Director: Bed Time Research Institute (BTRI) Web Sites of Interest within the BTRI 1)       March Madness 2023... What are your bracket odds? Visit Bracketodds for help with your Mens and Womens brackets. 2)       What drives obesity? Visit Driving Obesity for the answer. 3)       Interested in ending gerrymandering? Visit the Institute for Computational Redistricting (ICOR). Information of Interest Broader Impacts: How research supported by the National Science Foundation makes the world better for all.  Read the Workshop Report: Setting a Broader Impacts Innovation Roadmap. In the News 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 and earlier Sample of recent media mentions (4 November 2025, CBS News, Megan Cerullo) US may be forced to close some airspace next week if government shutdown continues, Duffy said quotes Jacobson on the risks associated with a shutdown of any part of the air space. (4 November 2025, Reuters, David Shepardson and Rajesh Kumar Singh) Shutdown could close some US airspace, airline stocks fall quotes Jacobson on the risks associated with a shutdown of any part of the air space. (4 November 2025, USA Today, Zach Wichter) US Customs preclearance in the travel hack flyers swear by quotes Jacobson on the benefits of customs officers being located at foreign airports to clear passengers before they fly to the US. (3 November 2025, Associated Press, Eric Olson) The College Football Playoff tweaked its strength of schedule metric.  Will that help? quotes Jacobson on how the college football playoffs teams will be determined. (24 October 2025, AARP, Berit Thorkelson) Can you refuse a face scan at the airport quotes Jacobson on the rules around refusing a face scan at airport security checkpoints. (15 October 2025, CBS News MoneyWatch, Megan Cerullo) Is it safe to fly during the government shutdown?  Experts weigh in quotes Jacobson on the impact of the government shutdown on safety. (15 October 2025, Newsweek, Soo Kim) Major Airline Announces New Bag Checking Rules for Connecting Flights quotes Jacobson on Uniteds new bag checking policy on flights from Australia. (9 October 2025, USA Today, Zach Wichter and Kathleen Wong) Is it safe to fly during the government shutdown? What you should know quotes Jacobson on the impact of the government shutdown on air travel. (9 October 2025, Reuters, Doyinsola Oladipo) Air travelers rethink plans as US government shutdown causes flight delays, cancellations quotes Jacobson on the impact of the government shutdown on air travel. See the video US government shutdown will lead to unhappy travelers says professor. (20 August 2025, NBC Today, Alex Portee) Woman stunned after stranger refused to watch her bag at airport.  An expert weighs in. quotes Jacobson on sensible security procedures to follow at airports. (17 July 2025, Forbes, Mary Whitfill Roeloffs) TSA may change 3-ounce liquid limit: Kristi Noem suggests: Heres what else can change quotes Jacobson on the future of airport security policies. (11 June 2025, US News and World Report, Maryalene LaPonsie) What is skiplagging and should you do it to save money? quotes Jacobson on the benefits and risk of hidden city airplane ticket pricing. (12 May 2025, New York Times, Coral Murphy Marcos) Should you fly through Newark airport?  Heres what you need to know quotes Jacobson on the risks associated with Newark airport air traffic control problems. (7 May 2025, Associated Press, Josh Funk) Feds vow to overhaul US air traffic control system while fixing problems at troubled Newark airport quotes Jacobson on how past efforts to fix the air traffic control system have fallen short. Potential PhD Graduate Students Research Opportunities in Operations Research Secrets to Learn Before you Graduate Prospective Graduate Students Visit the Media and Outreach Presentation For a seminar on bracketology: March Madness and Advanced Analytics: Improving Your Bracket Odds Looking for a Ph.D. Advisor? Zen and the Art of Hiring and Advising Graduate Students Interested in Jacobsons TED-type Talk slides? Research Areas and Interests Theory/AI Interface (Operations Research) Advanced Analytics and Data Science (Big Data, Computational Public Health & Social Sciences, Health Informatics) Industrial Engineering Research (Peer Reviewed) Articles Computer Simulation Methodology and Modeling Discrete Optimization Algorithms (Exact and Approximation) Stochastic Models, On-line Optimization, and Sequential Decision-Making Aviation Security System Design and Analysis Health Care Systems Engineering, Modeling, and Analysis Immunization and Vaccine Economics Transportation, Obesity, and Public Health Causal Inference, Districting Problems, and Election Forecasting Sports Analytics: NCAA Bracketology Applications of Operations Research Commentaries and Viewpoints Other Publications Book Chapters Professional Magazines, Public Writings Conference Proceedings Papers Professional Activities Presentations, Seminars, and Posters Sponsored Research Dissertation, Theses, and Projects Directed Teaching and Service Activities Jacobson's Web Site on the Computer Science Web Page For more information, send a message to shj@illinois.edu He would be happy to hear from you. Sheldon H. Jacobson, Ph.D. 201 North Goodwin Avenue (MC-258) University of Illinois Urbana, Illinois 61801-2302 Telephone: (217) 244-7275 Fax: (217) 244-6869 Skype: sheldon.jacobson1 Email: shj@illinois.edu X: @shjanalytics Last Updated: 29 December 2025 First Posted: 25 June 1999",
  "content_length": 6842,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:07"
}