{
  "name": "Shengyao Lu",
  "homepage": "https://sluxsr.github.io",
  "status": "success",
  "content": "Shengyao Lu R5: Rule Discovery with Reinforced and Recurrent Relational ReasoningShengyao Lu*, Bang Liu*, Keith G. Mills, Shangling Jui, Di Niu. ICLR 2022 (Spotlight) [Paper] [Code] [Video] We propose R5, a relational reasoning framework based on reinforcement learning that r... Apr 26, 2022 Publications GOAt: Explaining Graph Neural Networks via Graph Output AttributionShengyao Lu, Keith G. Mills, Jiao He, Bang Liu, Di Niu. ICLR 2024 [Paper] [Code] [Video] We introduce Graph Output Attribution (GOAt), a novel method to attribute graph outputs to input graph fea... Jul 10, 2025 Publications EiG-Search: Generating Edge-Induced Subgraphs for GNN Explanation in Linear TimeShengyao Lu, Bang Liu, Keith G Mills, Jiao He, Di Niu. ICML 2024 [Paper] [Code] In this paper, we reveal that inducing subgraph explanations by edges is more comprehensive than other subgraph ind... Oct 10, 2024 Publications 次品球 (Defective ball)Q：12颗理应相同的球中存在一个次品球，该次品球可能略轻或略重。请用一个天平在三次测量中找出这个次品球，并给出其是略重（H）还是略轻（L）。 思路：若采用传统二分法，需要称四次，不合题目要求，因此需要另辟蹊径，即：将球分三份而不是两份，因为前两份的测量结果直接给出第三份的信息。 测量1，2，3，4 vs 5，6，7，8 相等：则9-12中存在坏球。这里要把这4个... Aug 25, 2024 过河 (River crossing)、猜生日（Birthday problem）River crossing Q：黑夜，ABCD四个人要过桥，桥同时只能上2人，手电只有一个，没有手电不能动，因此为了打手电走得快的和走得慢的要同速。单程过桥，A需10分钟，B需5分钟，C需2分钟，D需1分钟。最快多长时间全员过桥？ 思路是： 需要尽可能减少过桥时间：组队过桥时，AB、AC、AD要10min，BC、BD要5min，CD要2min。 黑夜时，对岸要派最快的人送手电... Aug 24, 2024 海盗分金 (Screwy pirates)假设总共有5个海盗，从A到E越来越Senior，总共有x金。每轮由最senior的人出一个分钱提案，如果半数或以上的人同意该提案，则提案通过，否则提案人被杀。所有海盗绝对理智，他们的第一优先级是活下来，第二优先级是拿尽可能多的金子，没有任何其余诉求。 在这个问题中，每次尝试分钱时，每个海盗的心态是： 如果到我的轮次时，我的提案必不会被接受，我会接受之前的轮次的提案，以确保自己不用死。... Aug 22, 2024 Recently Updated GOAt: Explaining Graph Neural Networks via Graph Output Attribution EiG-Search: Generating Edge-Induced Subgraphs for GNN Explanation in Linear Time 次品球 (Defective ball) 过河 (River crossing)、猜生日（Birthday problem） 海盗分金 (Screwy pirates)Trending Tags Chinese Publications Quant ICLR ICML SpotlightTrending Tags Chinese Publications Quant ICLR ICML Spotlight A new version of content is available. Update",
  "content_length": 2017,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:15"
}