{
  "name": "Sheng Wang 0012",
  "homepage": "https://homes.cs.washington.edu/~swang",
  "status": "success",
  "content": "Sheng Wang Sheng Wang Assistant Professor Paul G. Allen School of Computer Science & Engineering Department of Surgery (affiliate) University of Washington, Seattle Email: swang [at] cs (dot) washington (dot) edu We have openings for 3 Ph.D. students to work on developing generative AI methods for biomedical imaging and chromatin structure prediction, supported by our recent R01 and R21 grants. Research interests I am interested in using generative AI to solve biomedical problems. We use lots of GPUs to train biomedical models with lots of parameters using very large data of many modalities. If you have lots of biomedical data (ideally images) and would like to collaborate for developing generative AI models on them, please reach out to us! See our recent Nature paper GigaPath as an example. We use generative AI techniques to model extremely large whole-slide pathology images (40,000 * 40,000 pixels!). Media coverage: Forbes, Yahoo, Becker’s hospital review, Fierce biotech, CTOL digital solutions, HIT consultant, GeekWire, Cosmic log, HealthXL, RamaOnHealthcare, Providence, nikkei, cryptorank Teaching: AI for Drug Discovery (Spring) and AI for Medicine (Fall). Publications Group Education and experience Postdoctoral Researcher, Stanford University (Aug 2018 - Jan 2021) Advisor: Prof. Russ Altman. Ph.D. in Computer Science, University of Illinois at Urbana-Champaign (Aug 2013 - May 2018) Advisors: Prof. ChengXiang Zhai and Prof. Jian Peng. Thesis: Leveraging knowledge network for precision cancer therapy. B.S. in Computer Science, Peking University (Aug 2009 - May 2013) Advisor: Prof. Ming Zhang My career has been supported and inspired by many role models, including all of my advisors listed above, and many others, including Prof. William Noble, Dr. Hoifung Poon, Prof. Jiawei Han, Prof. Saurabh Sinha, and Prof. Jianzhu Ma.",
  "content_length": 1854,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:13"
}