{
  "name": "Shengwei An",
  "homepage": "https://answ.in",
  "status": "success",
  "content": "Shengwei's Homepage Shengwei An swan AT vt.edu \"Forget what is behind and strain toward what is ahead.\" About I am an Assistant Professor in the Department of Computer Science at Virginia Tech. My research focuses on Security, Privacy, and Intellectual Property Protection in Neural Networks. I received my Ph.D. degree from Purdue University, advised by Prof. Xiangyu Zhang. I received my M.S and B.S. degrees from Nanjing University (NJU), advised by Prof. Xiaoxing Ma. I am actively looking for self-motivated Ph.D. students interested in working on cutting-edge problems in AI security and privacy. If you're passionate about these areas, feel free to reach out to me! Publications BAIT: Large Language Model Backdoor Scanning by Inverting Attack Target Guangyu Shen*, Siyuan Chen*, Kaiyuan Zhang, Guanhong Tao, Shengwei An, Lu Yan, Zhuo Zhang, Shiqing Ma, Xiangyu Zhang Proceedings of the 46th IEEE Symposiums on Security and Privacy (S&P 2025) paper bibtex CENSOR: Defense Against Gradient Inversion via Orthogonal Subspace Bayesian Sampling Kaiyuan Zhang, Siyuan Cheng, Guangyu Shen, Bruno Ribeiro, Shengwei An, Pin-Yu Chen, Xiangyu Zhang, Ninghui Li Proceedings of the 32nd Network and Distributed System Security Symposium (NDSS 2025) paper bibtex code UNIT: Backdoor Mitigation via Automated Neural Distribution Tightening Siyuan Cheng*, Guangyu Shen*, Kaiyuan Zhang, Guanhong Tao, Shengwei An, Hanxi Guo, Shiqing Ma, Xiangyu Zhang The 18th European Conference on Computer Vision (ECCV 2024) paper code Rethinking the Invisible Protection against Unauthorized Image Usage in Stable Diffusion Shengwei An*, Lu Yan*, Siyuan Cheng, Guangyu Shen, Kaiyuan Zhang, Qiuling Xu, Guanhong Tao, Xiangyu Zhang Proceedings of the 33rd USENIX Security Symposium (USENIX Security 2024) paper bibtex code video LOTUS: Evasive and Resilient Backdoor Attacks through Sub-Partitioning Siyuan Cheng, Guanhong Tao, Yingqi Liu, Guangyu Shen, Shengwei An, Shiwei Feng, Xiangzhe Xu, Kaiyuan Zhang, Shiqing Ma, Xiangyu Zhang IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR 2024) paper bibtex code Elijah: Eliminating Backdoors Injected in Diffusion Models via Distribution Shift Shengwei An, Sheng-Yen Chou, Kaiyuan Zhang, Qiuling Xu, Guanhong Tao, Guangyu Shen, Siyuan Cheng, Shiqing Ma, Pin-Yu Chen, Tsung-Yi Ho, Xiangyu Zhang Proceedings of the 38th AAAI Conference on Artificial Intelligence (AAAI 2024) paper bibtex code poster Inspecting Prediction Confidence for Detecting Black-box Backdoor Attacks Tong Wang, Yuan Yao, Feng Xu, Miao Xu, Shengwei An, Ting Wang Proceedings of the 38th AAAI Conference on Artificial Intelligence (AAAI 2024) paper bibtex Exploring the Orthogonality and Linearity of Backdoor Attacks Kaiyuan Zhang*, Siyuan Cheng*, Guangyu Shen, Guanhong Tao, Shengwei An, Anuran Makur, Shiqing Ma, Xiangyu Zhang Proceedings of the 45th IEEE Symposium on Security and Privacy (S&P 2024) paper bibtex ODSCAN: Backdoor Scanning for Object Detection Models Siyuan Cheng*, Guangyu Shen*, Guanhong Tao, Kaiyuan Zhang, Zhuo Zhang, Shengwei An, Xiangzhe Xu, Yingqi Liu, Shiqing Ma, Xiangyu Zhang Proceedings of the 45th IEEE Symposium on Security and Privacy (S&P 2024) paper bibtex Django: Detecting Trojans in Object Detection Models via Gaussian Focus Calibration Guangyu Shen*, Siyuan Cheng*, Guanhong Tao, Kaiyuan Zhang, Yingqi Liu, Shengwei An, Shiqing Ma, Xiangyu Zhang Proceedings of 37th Conference on Neural Information Processing Systems (NeurIPS 2023) paper bibtex Remove Model Backdoors via Importance Driven Cloning Qiuling Xu, Guanhong Tao, Jean Honorio, Yingqi Liu, Shengwei An, Guangyu Shen, Siyuan Cheng, Xiangyu Zhang IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR 2023) paper bibtex ImU: Physical Impersonating Attack for Face Recognition System with Natural Style Changes Shengwei An, Yuan Yao, Qiuling Xu, Shiqing Ma, Guanhong Tao, Siyuan Cheng, Kaiyuan Zhang, Yingqi Liu, Guangyu Shen, Ian Kelk, Xiangyu Zhang Proceedings of the 44rd IEEE Symposiums on Security and Privacy (S&P 2023) paper bibtex code video Hard-label Black-box Universal Adversarial Patch Attack Guanhong Tao, Shengwei An, Siyuan Cheng, Guangyu Shen, Xiangyu Zhang Proceedings of the 32nd USENIX Security Symposium (USENIX Security 2023) paper bibtex code PELICAN: Exploiting Backdoors of Naturally Trained Deep Learning Models In Binary Code Analysis Zhuo Zhang, Guanhong Tao, Guangyu Shen, Shengwei An, Qiuling Xu, Yingqi Liu, Yapeng Ye, Yaoxuan Wu, Xiangyu Zhang Proceedings of the 32nd USENIX Security Symposium (USENIX Security 2023) paper bibtex FLIP: A Provable Defense Framework for Backdoor Mitigation in Federated Learning Kaiyuan Zhang, Guanhong Tao, Qiuling Xu, Siyuan Cheng, Shengwei An, Yingqi Liu, Shiwei Feng, Guangyu Shen, Pin-Yu Chen, Shiqing Ma, Xiangyu Zhang Proceedings of the Eleventh International Conference on Learning Representations (ICLR 2023) ECCV 2022 Workshop on Adversarial Robustness in the Real World (AROW 2023) Best Paper Award paper bibtex code BEAGLE: Forensics of Deep Learning Backdoor Attack for Better Defense Siyuan Cheng, Guanhong Tao, Yingqi Liu, Shengwei An, Xiangzhe Xu, Shiwei Feng, Guangyu Shen, Kaiyuan Zhang, Qiuling Xu, Shiqing Ma, Xiangyu Zhang Proceedings of the 30th Network and Distributed System Security Symposium (NDSS 2023) paper bibtex code An Invisible Black-Box Backdoor Attack Through Frequency Domain Tong Wang, Yuan Yao, Feng Xu, Shengwei An, Hanghang Tong and Ting Wang European Conference on Computer Vision (ECCV 2022) paper bibtex code Constrained Optimization with Dynamic Bound-scaling for Effective NLP Backdoor Defense Guangyu Shen, Yingqi Liu, Guanhong Tao, Qiuling Xu, Zhuo Zhang, Shengwei An, Shiqing Ma, Xiangyu Zhang Proceedings of Thirty-ninth International Conference on Machine Learning (ICML 2022) paper bibtex Model Orthogonalization: Class Distance Hardening in Neural Networks for Better Security Guanhong Tao, Yingqi Liu, Guangyu Shen, Qiuling Xu, Shengwei An, Zhuo Zhang, Xiangyu Zhang Proceedings of the 43rd IEEE Symposiums on Security and Privacy (S&P 2022) paper bibtex code PICCOLO: Exposing Complex Backdoors in NLP Transformer Models Yingqi Liu, Guangyu Shen, Guanhong Tao, Shengwei An, Shiqing Ma, Xiangyu Zhang Proceedings of the 43rd IEEE Symposiums on Security and Privacy (S&P 2022) paper bibtex code Better Trigger Inversion Optimization in Backdoor Scanning Guanhong Tao, Guangyu Shen, Yingqi Liu, Shengwei An, Qiuling Xu, Shiqing Ma, Pan Li, Xiangyu Zhang. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR 2022) paper bibtex code MIRROR: Model Inversion for Deep Learning Network with High Fidelity Shengwei An, Guanhong Tao, Qiuling Xu, Yingqi Liu, Guangyu Shen, Yuan Yao, Jingwei Xu, Xiangyu Zhang Proceedings of the 29th Network and Distributed System Security Symposium (NDSS 2022) paper appendix bibtex slides project code video Backdoor Scanning for Deep Neural Networks through K-Arm Optimization Guangyu Shen, Yingqi Liu, Guanhong Tao, Shengwei An, Qiuling Xu, Siyuan Cheng, Shiqing Ma, Xiangyu Zhang Proceedings of Thirty-eighth International Conference on Machine Learning (ICML 2021) paper bibtex Augmented Example-based Synthesis using Relational Perturbation Properties Shengwei An, Rishabh Singh, Sasa Misailovic, Roopsha Samanta Proceedings of the ACM on Programming Languages (POPL 2020) paper bibtex video Verifying Distributed Controllers with Local Invariants Yiqun Wang, Shengwei An, Xiaoxing Ma, Chun Cao, Chang Xu IEEE International Conference on Software Quality, Reliability and Security (QRS 2016) paper bibtex An Event-Based Formal Framework for Dynamic Software Update Shengwei An, Xiaoxing Ma, Chun Cao, Ping Xu, Chang Xu IEEE International Conference on Software Quality, Reliability and Security (QRS 2015) paper bibtex Teaching CS 6804: AI Security and Privacy, Virginia Tech (Fall 2025) Guest Lecture, CS546: Computer System Security, Rutgers University (Spring 2023) Services Reviewer TDSC 2022, AAAI 2023-26, NeurIPS 2023-25, ICLR 2024-25, CVPR 2024-25, ICML 2024-25, AISTATS 2024-26, RAID 2024, USENIX Security 2026, CCS 2025-26, WACV 2026, ICCV 2025, ACMMM 2025, ESORICS 2025, TMLR, TDSC, TOPS",
  "content_length": 8187,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:16"
}