{
  "name": "Shengli Liu 0001",
  "homepage": "https://www.cs.sjtu.edu.cn/PeopleDetail.aspx?id=96",
  "status": "success",
  "content": "上海交通大学计算机学院（网络空间安全学院、密码学院） 使用jAccount登录 English 学院概况 学院简介 历史沿革 学院领导 组织架构 党建工作 党委概况 支部风采 工会组织 理论学习 师资队伍 教师名录 院士学者 国家级人才 退休教师 人才招聘 科学研究 科研概况 研究机构 平台基地 科研合作 人才培养 本科生培养 研究生培养 教学成果 教学实践 学生工作 校友天地 知名校友 校友风采 季度简报 校友基金 新闻动态 学院新闻 学术活动 学院视频 办事指南 通知公告 规章制度 下载专区 投票系统 学院概况 学院简介 历史沿革 学院领导 组织架构 党建工作 党委概况 支部风采 工会组织 理论学习 师资队伍 教师名录 院士学者 国家级人才 退休教师 人才招聘 科学研究 科研概况 研究机构 平台基地 科研合作 人才培养 本科生培养 研究生培养 教学成果 教学实践 学生工作 校友天地 知名校友 校友风采 季度简报 校友基金 新闻动态 学院新闻 学术活动 学院视频 办事指南 通知公告 规章制度 下载专区 投票系统 学院动态 News 查看更多 28 2025-11 祝贺！计算机学院钱彦旻老师、陈全老师荣获第二届上海交通大学睿远青年科技奖 27 2025-11 计算机学院郑伟龙老师荣获亚太神经网络学会青年研究者奖 18 2025-11 2025年世界互联网大会乌镇峰会网安展：交大计算机学院引领可信AI创新，护航安全普惠数智未来 17 2025-11 “测体知健康，为她焕活力”——计算机学院与集成电路学院联合开展个性化体成分分析与健康指导活动 12 2025-11 计算机学院讲席教授谷大武当选中国密码学会会士 07 2025-11 上海交通大学2025年国际青年学者论坛——计算机学院分论坛欢迎您的加入！ 06 2025-11 上海交通大学计算机学院校友会成立公告 06 2025-11 上海交通大学计算机学院2025级永强班开班仪式顺利举行 04 2025-11 巅峰出道！计算机学子在“挑战杯”竞赛中满载而归！ 04 2025-11 上海交大迎来斯坦福图灵奖得主马丁·赫尔曼：共话科技风险与人类命运的国际担当 计算机学院高晓沨教授指导学子在2025年“国赛”再创佳绩！ 2025.11.26 计算机学院召开教育思想大讨论阶段性总结交流会——凝心聚力谋新篇，分层分类育英才 2025.11.20 上海交通大学数学建模培训营 2026年“美赛”培训招生了！ 2025.11.13 计算机学院成果获ACM MM '25 Systems Theme 领域杰出论文奖 2025.11.13 学术活动 Academic 查看更多 第十五届CCF优秀博士学位论文获奖者论坛 时间：2025.08.03 地点：浙江嘉兴 2025 CCF中国开源大会 时间：2025.08.02 地点：上海 主题：蓄势引领、众行致远 全球午餐会｜2025秋第9期:Sublinear Algorithms for Graph Optimization 时间：2025.11.28（周五）12:00 地点：电院3-414 报告人：Cliff Liu 大模型知识编辑前沿进展 时间：2025.11.27(周四)16:00 地点：电院3-412 报告人：王翔 基于混淆电路的安全两方计算 时间：2025.12.01(周日)10:30 地点：电院3-326A 报告人：杨糠 学院视频 Video 查看更多 侯文永：树因材施教典范，筑教学改革根基 侯文永：树因材施教典范，筑教学改革根基 同行聚力未来可计-热烈祝贺上海交通大学计算机学院成立 奋勇追梦七十载 智算未来启新章-上海交通大学计算机学院【宣传片】 AI Rudder任腾：做有价值的事 白英彩：力学笃行重实验，诲人不倦创新篇 盛焕烨：笃实基建重育人，创新教学志争先 孙永强：建系追梦四十载，青春无悔树品牌 学院研究所 Institute 查看更多 并行与分布式系统研究所 机器智能研究所 计算机应用研究所 可扩展计算研究所 空间智能软件研究所 理论计算机科学研究所 人工智能与认知安全研究所 通用人工智能研究所 网络空间安全研究所 系统安全研究所 先进计算研究所 先进人工智能研究所 先进网络研究所 信息安全与密码学研究所 智能软件与系统研究所 量子计算研究所（筹） 交叉前沿研究所（筹） 约翰·霍普克罗夫特计算机科学中心 清源研究院 公众号二维码 小红书二维码 哔哩哔哩二维码 学院地址：上海市东川路800号Email：scs@sjtu.edu.cn邮政编码：200240联系电话：021-34205058 / 34204728 （试行版）Copyright © 2025 计算机学院 沪交ICP备2010898",
  "content_length": 1977,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:14"
}