{
  "name": "Shengpu Tang",
  "homepage": "https://shengpu-tang.me",
  "status": "success",
  "content": "Shengpu Tang Shengpu Tang 唐笙普 Assistant Professor CS @ Emory Please check out the Lab sections above for info about my research group: Tang's AI Lab. Update Fall 2025: Students who are interested in working on a research project with me, please read this first: Reaching Out. I am a tenure-track assistant professor of computer science at Emory University. My research focuses on developing and applying artificial intelligence methods to enhance decision making in healthcare, with a particular emphasis on reinforcement learning. Inspired by specific real-world use cases, my work identifies technical challenges and proposes novel solutions that are broadly relevant to fundamental AI/ML research. My past contributions span various technical areas including reinforcement learning (RLC'25 workshops, NeurIPS'23, ICML'23 workshops, NeurIPS'22 oral, NeurIPS'22 workshop, MLHC'21, ICML'20), time-series and sequence data modeling (MLHC'19), dataset bias (HealthAffairs'21), as well as translating AI solutions to advance precision medicine (JMIR Med Inform'25, JAMA Network Open'25, IDWeek'24, AJS'21, JAMIA'20, JCO-CCI'20), with some work specifically addressing the COVID-19 pandemic (BMJ'22, AnnalsATS'20). I hope to apply my knowledge and expertise to interdisciplinary problems in healthcare and beyond. I served as a main organizer for MLHC 2025 and ML4H 2022-2023, Senior AC for CHIL 2025, and AC for CHIL 2024. I also regularly review for top-tier ML venues, including NeurIPS, ICML, ICLR, AAAI, AISTATS, KDD, MLHC, CHIL, TMLR, TKDD. I am a \"Triple Wolverine\" - having done my bachelor's, master's, and PhD degrees all at University of Michigan. During my PhD, I was a member of the Machine Learning for Data-Driven Decisions (MLD3) research group led by Prof. Jenna Wiens, under the Michigan AI Lab. I also collaborated with Prof. Maggie Makar at UMich, Prof. Sonali Parbhoo at Imperial, and Prof. Finale Doshi-Velez at Harvard. Interests Reinforcement Learning Machine Learning Artificial Intelligence Health & Medicine Education PhD in Computer Science & Engineering, 2024 University of Michigan, Ann Arbor MSE in Computer Science & Engineering, 2020 University of Michigan, Ann Arbor BSE in Computer Science, Minor in Mathematics, summa cum laude, 2018 University of Michigan, Ann Arbor Recent News Oct 2025: Congratulations to Yingchuan Sun on the acceptance of his ML4H proceedings paper! Jun 2025: 4 papers accepted at RLC 2025 workshops! Congratulations to students Sixing, Yingchuan, Rolf and Matthew! Feb 2025: Presented at AAAI-25 New Faculty Highlights, Philadelphia, PA. [Recording] Oct 2024: Gave an invited talk and also presented an oral abstract at IDWeek 2024 in Los Angeles, CA. Sept 2024: My PhD dissertation is available online at this link! Aug 2024: Gave an invited talk at RLC 2024 ICBINB workshop, Amherst, MA. June 3, 2024: 🎉 I defended my PhD thesis! Special thanks to my thesis committee for their valuable feedback and all my reserach collaborators who have spent time with me throughout my PhD! You can find the recordings at the following links: the Preamble and the Defense. Dec 2023: 🎉 I presented my latest work on Counterfactual Annotations and Semi-Offline Evaluation at NeurIPS 2023 in New Orleans, LA. I was also given a travel award at NeurIPS 2023! Dec 2023: 🙌 We successfully organized the ML4H 2023 Symposium, co-located with NeurIPS 2023 in New Orleans, LA. Kudos to the entire organizing team! July 2023: I attended ICML 2023 in Honolulu, Hawaii, where I presented Factored Actions for OPE at the Counterfactuals workshop and the Frontiers4LCD workshop. I also participated in the surfing social! June 2023: I attended the CHIL 2023 Doctoral Symposium in Cambridge, MA. Dec 2022: 🏆 I presented our paper on Factored Action Spaces for Offline RL in Healthcare at NeurIPS 2022 in New Orleans, LA. It was also selected as \"Oral\" and was presented during the NeurIPS 2022 virtual week. Dec 2022: 🎉 I presented my internship project Towards Data-Driven Offline Simulations of Online RL at the 3rd Offline RL workshop at NeurIPS 2022. Nov 2022: 🙌 We successfully organized the ML4H 2022 Symposium, co-located with NeurIPS 2022 in New Orleans, LA. Kudos to the entire organizing team! Oct 2022: 🥈 I was extremely honored to have been selected as the finalist representing the AI lab, and placing second in the 19th annual CSE Graduate Honors Competition. Jul-Aug 2022: Finally attended my first in-person conferences during PhD, ICML 2022 in Baltimore, MD and MLHC 2022 in Durham, NC. July 2022: I won a free registration to ICML 2022 as one of the top reviewers! May-Aug 2022: I worked with Microsoft's Azure Cognitive Services team as a Research Intern. February 2022: Our paper on M-CURES, an open-source machine learning model predicting deterioration of hospitalized COVID-19 patients was accepted to one of the world's leading medical journals, The BMJ! December 2021: Our paper on respecting autonomy & enabling diversity for medical databanks that drive precision health and clinical AI - was published in Health Affairs. December 2021: I co-organized a new workshop - Research2Clinics -- Bridging the Gap: From Machine Learning Research to Clinical Practice - at NeurIPS 2021. Thank you to everyone who contributed and attended! August 2021: Invited to give a talk on RL with Set-Valued Policy: A Framework for Clinician-in-the-Loop Decision Making at the PathCheck Global Health Innovators Talk Series! You can find the recording of the seminar here. July-August 2021: I presented our paper Practical Considerations for Offline RL Model Selection at both MLHC 2021 and RL4RealLife @ ICML 2021! Watch the spotlight talk here. December 2020: Won a free registration to NeurIPS 2020 as one of the top reviewers! Excited to see everyone there :) July 2020: I presented our paper on RL with Set-Valued Policy at ICML 2021. Check out the spotlight video here. Media Coverage Jun 16, 2025: New AI tool supports best practices to prevent spread of dangerous C. diff infections -- Emory News Center. Jun 13, 2025: AI Tool Shows Promise for Antimicrobial Stewardship, C Diff Prevention in Hospitals -- HCPLive. Jun 12, 2025: Clinically deployed AI guidance for preventing C. difficile spread -- UMich CSE. Sept 12, 2024: These CSE PhD alums have accepted faculty positions -- UMich CSE. Nov 10, 2022: 2022 CSE Graduate Student Honors Competition highlights outstanding research -- UMich CSE. Feb 22, 2022: AI Triage -- Digital Health Wire newsletter. Feb 22, 2022: How to train a clinical AI to predict bad health outcomes -- STAT Health Tech. Feb 17, 2022: Open-source patient model tops industry standard -- University of Michigan News. Dec 7, 2021: How bias can creep into medical databanks that drive precision health and clinical AI -- Michigan Health Lab. Jun 22, 2021: A hospital algorithm designed to predict a deadly condition misses most cases -- The Verge. Apr 21, 2021: In scramble to respond to Covid-19, hospitals turned to models with high risk of bias -- MedCityNews. Mar 30, 2021: From collaboration to validation: How a team of engineers, clinicians, programmers, and administrators evaluated one of the most widely implemented predictive models -- Precision Health at UM. Jan 22, 2021: Epic Deterioration Index May Identify High- and Low-Risk COVID-19 Patients -- Clinical Advisor. Oct 12, 2020: New framework helps streamline EHR data extraction -- Healthcare IT News. May 12, 2020: Faster than COVID: a computer model that predicts the disease’s next move -- The Mighican Engineer News Center. Apr 15, 2020: Computer scientists employ AI to help address COVID-19 challenges -- Michigan AI Lab. Publications (PhD-era) also see publications of the lab Optimizing loop diuretic treatment for mortality reduction in patients with acute dyspnea using a practical offline reinforcement learning pipeline for healthcare: a retrospective single center simulation study JMIR Medical Informatics, Sep 2025 Jung Min Lee, Shengpu Tang, Michael W. Sjoding, Jenna Wiens paper Guiding Clostridioides difficile Infection Prevention Efforts in a Hospital Setting With AI JAMA Network Open, Jun 2025 Shengpu Tang, Stephanie Shepard, Rebekah Clark, Erkin Ötleş, Chidimma Udegbunam, Josh Tran, Melinda Seiler, Justin Ortwine, Akbar K. Waljee, Jerod Nagel, Sarah L. Krein, Jacob E. Kurlander, Paul J. Grant, Jihoon Baang, Anastasia Wasylyshyn, Krishna Rao, Jenna Wiens paper Targeting Clostridioides difficile Infection Prevention Efforts with Artificial Intelligence IDWeek Oral Abstract, Oct 2024; Published in Open Forum Infectious Diseases Shengpu Tang, Rebekah Clark, Stephanie Shepard, Erkin Ötleş, Maxim Garifullin, Melinda Seiler, Justin Ortwine, Patrick Arnold, Jerod Nagel, Jeremy Jared, Sarah L Krein, Jacob E Kurlander, Paul J Grant, Jihoon Baang, Anastasia Wasylyshyn, Krishna Rao, Jenna Wiens paper CANDOR: Counterfactual ANnotated DOubly Robust off-policy evaluation under review Aishwarya Mandyam, Shengpu Tang, Jiayu Yao, Emma Brunskill, Jenna Wiens, Barbara E Engelhardt arXiv Counterfactual-Augmented Importance Sampling for Semi-Offline Policy Evaluation NeurIPS 2023 Shengpu Tang, Jenna Wiens paper code poster video website arXiv Leveraging Factored Action Spaces for Off-Policy Evaluation Frontiers4LCD @ ICML 2023, Counterfactuals @ ICML 2023 Aaman Peter Rebello, Shengpu Tang, Jenna Wiens, Sonali Parbhoo paper code Towards Data-Driven Offline Simulations for Online Reinforcement Learning Offline RL @ NeurIPS 2022 Shengpu Tang, Felipe Vieira Frujeri, Dipendra Misra, Alex Lamb, John Langford, Paul Mineiro, Sebastian Kochman preprint code Leveraging Factored Action Spaces for Efficient Offline Reinforcement Learning in Healthcare NeurIPS 2022 (Oral); also at DARL @ ICML 2022 Shengpu Tang, Maggie Makar, Michael W. Sjoding, Finale Doshi-Velez, Jenna Wiens paper code poster video website arXiv Early Identification of Patients Admitted to Hospital for COVID-19 at Risk of Clinical Deterioration: Model Development and Multisi",
  "content_length": 13376,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:15"
}