{
  "name": "Sheng Li 0001",
  "homepage": "http://sheng-li.org",
  "status": "success",
  "content": "Sheng Li's Homepage Sheng Li Quantitative Foundation Associate Professor, University of Virginia Reasoning and Knowledge Discovery (RISE) Lab Room 438, 1919 Ivy Road, Charlottesville, VA 22903 Email: shengli [AT] virginia.edu Research Interests: Trustworthy Representation Learning (e.g., Robustness, Fairness, Causality, Transferability); Computer Vision; Interdisciplinary Applications (Educational Measurement, Biomedical Informatics, Public Health, etc.) Openings: I am continuously looking for highly-motivated Ph.D. students to work on AI, ML, CV, and causal inference. Please send me your CV if interested. Due to a large volume of inquiries, I may not have a chance to reply to every email. Short Bio: Sheng Li is a Quantitative Foundation Associate Professor of Data Science and an Associate Professor of Computer Science (by courtesy) at the University of Virginia (UVA). He was an Assistant Professor of Data Science at UVA from 2022 to 2023, an Assistant Professor of Computer Science at the University of Georgia from 2018 to 2022, and a Data Scientist at Adobe Research from 2017 to 2018. He received his PhD degree in Computer Engineering from Northeastern University in 2017 under the supervision of Prof. Yun Raymond Fu. He received his Master degree and Bachelor degree from School of Computer Science at Nanjing University of Posts and Telecommunications in 2012 and 2010, respectively. His recent research interests include Trustworthy AI, Causal Inference, Large Foundation Models, and Vision-Language Modeling. He has published over 190 papers, and has received over 10 research awards, such as the INNS Aharon Katzir Young Investigator Award, Fred C. Davidson Early Career Scholar Award, Adobe Data Science Research Award, Cisco Faculty Research Award, and SDM Best Paper Award. He currently serves as Associate Editor for six journals such as Transactions on Machine Learning Research (TMLR) and IEEE Trans. Neural Networks and Learning Systems (TNNLS), and serves as an Area Chair for IJCAI, NeurIPS, ICML, and ICLR. News [more...] 09/2025, Received an NIH AIM-AHEAD Grant (as Co-I; PI: Prof. Stacy Zhang at NYU) to support our research on fair and explainable AI for population health. 09/2025, One paper on video temporal reasoning is accepted at NeurIPS 2025. 08/2025, One paper on fairness of retrieval-augmented generation in LLMs is accepted at Findings of EMNLP 2025. 08/2025, One paper on exploring the vulnerabilities of large pre-trained models via model editing is accepted at ACM CIKM 2025. 07/2025, One paper on few-shot fine-grained classification with interpretable prompt learning is accepted at ACM ICMI 2025. 05/2025, Two papers on multi-modal model editing and LLM safety alignment are accepted at ICML 2025. 04/2025, One survey paper on large language models for causal discovery is accepted at the survey track of IJCAI 2025. 04/2025, Received an NIH R01 Grant (as Co-I; PI: Prof. Wei Liu at Mayo Clinic) to develop computer vision models for adaptive radiation therapy. 03/2025, I've been invited to be a Plenary Speaker of the 7th International Conference on Statistics: Theory and Applications (ICSTA 2025). 02/2025, Three papers on multimodal LLM, unified dense prediction, and source-free domain adaptation are accepted at CVPR 2025. 01/2025, One paper on reasoning-aware self-consistency for efficient and faithful LLM reasoning is accepted at NAACL 2025. 01/2025, One paper on training clean models from poisoned datasets with causal analysis is accepted at ICLR 2025. 12/2024, I am appointed as a Senior Associate Editor for IEEE Trans. on Circuits and Systems for Video Technology. 12/2024, Received a Merck Grant to support our research on foundation models. 12/2024, One paper on black-box input-level backdoor detection on diffusion models is accepted at the AI Alignment Track of AAAI 2025. 12/2024, One proposal on trustworthy AI and educational assessment is accepted at the AAAI 2025 Senior Member Presentation Track. 12/2024, One paper on black-box backdoor detection with causal inference is accepted by TMLR. 11/2024, I am invited to give a talk at the AAAI 2025 Bridge Program on Continual Causality. 11/2024, Received a DOD DURIP Grant to support our research projects. 11/2024, I accepted the invitations to serve as Action Editor for the Transactions on Machine Learning Research (TMLR) and Area Chair for IJCAI 2025. 11/2024, One paper on individual-level continuous treatment effect estimation is accepted by TMLR. 10/2024, Our article on AI for K-12 education is published at The Virginian-Pilot. 09/2024, One paper on expressive representation learning with vision-language models is accepted at NeurIPS 2024. 09/2024, One paper on tag-grounded visual instruction tuning is accepted at EMNLP 2024. 08/2024, Received an ONR Grant to support our research on causal inference. 08/2024, We are organizing the First Workshop on Large Foundation Models for Educational Assessment at NeurIPS 2024. 08/2024, One paper on mixup virtual adversarial training for robust vision transformers is accepted at IEEE Transactions on Big Data. 07/2024, Received an NSF Grant to support our research on AI for controlled-environment agriculture. 07/2024, One paper on text-guided augmentation for domain generalization is accepted at ECCV 2024. 06/2024, One paper on class-imbalanced domain adaptation has been accepted by IEEE Transactions on Circuits and Systems for Video Technology (T-CSVT). 06/2024, One paper on large language models for food applications is accepted by IEEE Transactions on Big Data. 05/2024, One paper on dual-windowed vision transformer with angular self-attention is accepted by TMLR. 05/2024, Received an NSF I-Corps Grant to explore generative AI for educational assessment. 05/2024, My student Zhongliang Zhou received the Best PhD Dissertation Award from UGA School of Computing. Zhongliang has recently joined Merck as a Senior Scientist. 05/2024, One paper on class-incremental graph learning is accepted by TMLR. 04/2024, I'm invited to write a preview paper on deep learning for causal inference for the Patterns journal. 03/2024, One survey paper on trustworthy representation learning across domains is accepted by ACM TKDD; One demo paper is accepted at SIGIR 2024. 02/2024, I'm appointed as a Quantitative Foundation Associate Professor of Data Science at UVA. Awards and Honors Georgia CTSA Team Science Award, 2023 Fred C. Davidson Early Career Scholar Award, 2022 Best Associate Editor Award, IEEE TCSVT, 2022 CS Faculty Teaching Excellence Award, 2021 INNS Aharon Katzir Young Investigator Award, 2020 CS Faculty Research Excellence Award, 2020 M. G. Michael Award, 2020 Adobe Data Science Research Award, 2019 Baidu Research Fellowship, 2016-2017 Chinese Government Award for Outstanding Self-Financed Students Abroad, 2015-2016 NEU Outstanding Graduate Student Award, 2014-2015 Best Paper Award, SDM 2014 Best Paper Award Candidate, ICME 2014 Best Student Paper Honorable Mention Award, FG 2013 Services Panelist: NSF (III, RI, OAC, NAIRI, CRII, GRFP), CDC, NSERC, QRDI, RGC Senior Area Editor: IEEE Trans. on Circuits and Systems for Video Technology (2025 - ) Associate Editor: Transactions on Machine Learning Research (2024 - ), IEEE Trans. Neural Networks and Learning Systems (2022 - ), IEEE Trans. Cognitive and Developmental Systems (2024 - ), IEEE Trans. on Circuits and Systems for Video Technology (2021 - 2024), IEEE Trans. Consumer Electronics (2024 - ), IEEE Computational Intelligence Magazine (2019 - ), Neurocomputing (2017 - 2022), Journal of Electronic Imaging (2018 - 2022), IET Image Processing (2017 - 2020) Program Chair: NeurIPS-FM-EduAssess (2024), CVPR-AMFG (2021), IJCAI-Tusion (2020), IJCAI-Tusion (2019), CVPR-AMFG (2019) Tutorial Co-Chair: SDM (2023) Publicity Chair: ICMLA (2016), TCMFTL (2016), AMFG (2015-2017) Area Chair: ICML (2023 - ), IJCAI (2023 - ), NeurIPS (2022 - ), ICLR (2022 - ), ACL ARR (2025 - ), ICPR (2020-2022), VCIP (2017) SPC Member: IJCAI (2020-2021), AAAI (2019-2025), SDM (2023-2025) Sponsors",
  "content_length": 8044,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:10"
}