{
  "name": "Sheng Cao",
  "homepage": "https://sheng-cao.github.io",
  "status": "success",
  "content": "Prof. Sheng Cao Sheng Cao Professor, Ph.D. Supervisor caosheng@uestc.edu.cn, 7332517@qq.com News feed 25/11/2025 - Our paper \"GBShard: Adaptive Sharding for Blockchain Network via Granular-Ball Partitioning\" was accepted by IEEE Transactions on Network Science and Engineering. Congrats to Zirui! 11/09/2025 - Our paper \"A Unified Framework for Hybrid Network Intrusion Detection\" was accepted by IEEE Transactions on Network and Service Management. Congrats to Yan Wang! 18/02/2025 - Our paper \"Secure Data Delivery with Certificateless Homomorphic Network Coding Signature Scheme for Unmanned Aerial Vehicle Networks\" was accepted by IEEE Internet of Things Journal. Congrats to Hao Huang! 21/08/2024 - Our paper \"Adaptive Cost Weight-Enabled Federated Distillation for Network Intrusion Detection\" was accepted by IEEE International Symposium on Parallel and Distributed Processing with Applications (ISPA 2024). Congrats to Zidong Chen, Yan Wang! 01/08/2024 - Our paper \"A Two-Stage Class Incremental Learning Approach for Network Intrusion Detection\" was accepted by IEEE Global Communications Conference (GLOBECOM 2024). Congrats to Yan! 01/08/2024 - Our paper \"From Detection to Classification: A Coarse-to-Fine Framework for Network Intrusion Detection\" was accepted by IEEE Global Communications Conference (GLOBECOM 2024). Congrats to Yan! 01/08/2024 - Our paper \"Secure and Efficient Certificateless Homomorphic Signature Scheme for Network Coding\" was accepted by IEEE Global Communications Conference (GLOBECOM 2024). 01/07/2024 - Our paper \"Tightly Secure Linearly Homomorphic Signature Schemes for Subspace Under DL Assumption in AGM\" was accepted by International Conference on Information and Communications Security (ICICS 2024). 13/03/2024 - Our paper \"Internet of Vehicles data sharing scheme via blockchain sharding\" was accepted by Journal of Computer Research and Development. Congrats to Xiao Chen, Muhong Huang,Yifan Tian and Yan Wang! 22/01/2024 - Our paper \"A Sharding-Based Blockchain Model Based on Zero Trust for Industrial Internet\" was accepted by China Communications. Congrats to Haoqu! 25/12/2023 - Our paper \"Portfolio-Based Incentive Mechanism Design for Cross-Device Federated Learning\" was accepted by IEEE Wireless Communications and Networking Conference (WCNC 2024). Congrats to Jiaxi! 27/10/2023 - Our paper \"A Hash-Based Multidimensional Graph Neural Network Approach for Zero Trust Oriented Access Control Security\" was accepted by IEEE ICPADS 2023. Congrats to Fengfan! 21/06/2023 - Qian's master's thesis \"Research on Cross-Blockchain Anonymous Payment Based on Auction\" was judged as the excellent master's thesis in 2023, Congrats to Qian! 01/03/2023 - Our paper \"Heuristics to sift extraneous factors in Dixon resultants\" was selected as a highly cited paper by ESI (Essential Science Indicators) database in March 2023. 10/20/2022 - Congrats to Qian for being awarded National Scholarship and The First Prize Scholarship in School of Computer Science and Engineering, Univerisity of Electronic Science and Technology of China. 07/26/2022 - Our paper \"A Multi-factor Reverse Auction Routing Scheme for Cross-Blockchain Payment\" was accepted by Journal of Computer Research and Development(China). Congrats to Qian! 07/17/2022 - Our paper \"Multi-dimensional Data Quick Query for Blockchain-based Federated Learning\" was accepted by The 17th International Conference on Wireless Algorithms, System, and Applications (WASA 2022). Congrats to Jiaxi! 04/25/2022 - Congrats to Qian for being awarded Academic Young Crops of UESTC! 01/31/2022 - Our paper \"A Behavior-Aware Scheme for Personalized Credit Computing\" was accepted by IEEE International Conference on Computer Supported Cooperative Work in Design (CSCWD 2022). Congrats to Sixuan! 01/31/2022 - Our paper \"Get a sense of accomplishment in doing exercises: A reinforcement Learning Perspective\" was accepted by IEEE International Conference on Computer Supported Cooperative Work in Design (CSCWD 2022). Congrats to Songdeng! 01/21/2022 - Our paper \"Heuristics to sift extraneous factors in Dixon resultants\" was accepted by Journal of Symbolic Computation. 01/20/2022 - Our paper \"Defending Data Poisoning Attack via Trusted Platform Module and Blockchain Oracle\" was accepted by IEEE International Conference on Communications (ICC 2022). Congrats to Mingyuan! 01/20/2022 - Our paper \"Enabling Privacy-Preserving Off-chain Payment via Hybrid Multi-hop Mechanism\" was accepted by IEEE International Conference on Communications (ICC 2022). Congrats to Qian! 12/20/2021 - Congrats to Sixuan for being awarded Outstanding Graduate by Sichuan Province and UESTC! 12/15/2021 - Our paper \"Hybrid Smart Contracts for Privacy-Preserving-Aware Insurance Compensation\" was accepted by IEEE Wireless Communications and Networking Conference (WCNC 2022). Congrats to Qian! 10/28/2021 - Congrats to Sixuan for being awarded National Scholarship and The First Prize Scholarship in School of Computer Science and Engineering, Univerisity of Electronic Science and Technology of China! 10/20/2021 - Our paper \"Enabling Verifiable Privacy-Preserving Multi-Type Data Aggregation in Smart Grids\" was accepted by IEEE Transactions on Dependable and Secure Computing. 09/26/2021 - Our paper \"Enabling Auction-based Cross-Blockchain Protocol for Online Anonymous Payment\" was accepted by the 27th IEEE International Conference on Parallel and Distributed Systems (ICPADS 2021). Congrats to Qian! 08/31/2021 - Our paper \"Dynamic Incentive Mechanism Design for Regulation-Aware Systems\" was accepted by International Journal of Intelligent Systems. Congrats to Sixuan! 08/02/2021 - Our patent \"A Secure Auditing System, Method and Server for Database\" was granted. 07/22/2021 - Our paper \"Student Model and Clustering Research on Personalized E-learning\" was published on Journal of Internet Technology. Congrats to Songdeng! 07/08/2021 - Our paper \"Regulation-as-a-Service: Model Checking for Decision-Making Behaviors in Price-Sensitive Service Systems\" was accepted by IEEE International Conference on Services Computing (SCC 2021). Congrats to Sixuan! Experience school Deputy Director, Sichuan-Chongqing Co-construction Key Laboratory of Digital Economy Intelligence and Security Sichuan, China / 2023-present Deputy Director, Engineering Research Center of the Chinese Ministry of Education for Blockchain Security and Platform Technology Sichuan, China / 2022-present Director, Blockchain Storage and Trade Engineering Laboratory of Sichuan Province Sichuan, China / 2019-present School of Computer Science and Engineering (School of Information and Software Engineering) UESTC, China / 2008-present Visiting Scholar, Leiden Institute of Advanced Computer Science (LIACS) Leiden University, Netherlands / 2013-2014 Ph.D in Computer Science University of Chinese Academy of Sciences, China / 2003 - 2008 BS in Computer Science Sichuan University, China / 1999 - 2003 Publications book Journal/Conference Abroad GBShard: Adaptive Sharding for Blockchain Network via Granular-Ball Partitioning Zirui Wu, Sheng Cao*, Shuyin Xia, Butian Huang, Guoyin Wang, and Xiaosong Zhang IEEE Transactions on Network Science and Engineering (IEEE TNSE 2026) / 2026 Automating Function-Level TARA for Automotive Full-Lifecycle Security Yuqiao Yang, Yongzhao Zhang, Wenhao Liu, Jun Li, Pengtao Shi, Dingyu Zhong, Jie Yang, Ting Chen, Sheng Cao, Yuntao Ren, Yongyue Wu and Xiaosong Zhang Network & Distributed System Security Symposium (NDSS 2026) / 2026 A Universal and Dynamically Aware Multi-Attack Adversarial Patch Generation Framework Yiwen Wang, Sheng Cao* and Xiaosong Zhang The 31st International Conference on Parallel and Distributed Systems (ICPADS 2025) / 2025 A Unified Framework for Hybrid Network Intrusion Detection Yan Wang, Sheng Cao*, Jiawei Li and Xiaosong Zhang IEEE Transactions on Network and Service Management (IEEE TNSM 2025) / 2025 An Enhanced Linearly Homomorphic Network Coding Signature Scheme for Secure Data Delivery in IoT Networks Hao Huang, Xiaofen Wang, Man Ho Au, Sheng Cao, Qinglin Zhao and Jiguo Yu IEEE Transactions on Information Forensics & Security (IEEE TIFS) / 2025 Secure Data Delivery with Certificateless Homomorphic Network Coding Signature Scheme for Unmanned Aerial Vehicle Networks Hao Huang, Xiaofen Wang, Hong-Ning Dai, Sheng Cao, Ke Zhang, Man Ho Au and Rang Zhou IEEE Internet of Things Journal / 2025 Adaptive Cost Weight-Enabled Federated Distillation for Network Intrusion Detection Zidong Chen, Yan Wang, Sheng Cao* and Xiaosong Zhang IEEE International Symposium on Parallel and Distributed Processing with Applications (ISPA 2024) / 2024 A Two-Stage Class Incremental Learning Approach for Network Intrusion Detection Yan Wang, Sheng Cao* IEEE Global Communications Conference (GLOBECOM 2024) / 2024 From Detection to Classification: A Coarse-to-Fine Framework for Network Intrusion Detection Yan Wang, Sheng Cao* IEEE Global Communications Conference (GLOBECOM 2024) / 2024 Secure and Efficient Certificateless Homomorphic Signature Scheme for Network Coding Hao Huang, Xiaofen Wang, Man Ho Allen Au, Man Ho Au, Sheng Cao, Qinglin Zhao, Xiaosong Zhang IEEE Global Communications Conference (GLOBECOM 2024) / 2024 Tightly Secure Linearly Homomorphic Signature Schemes for Subspace Under DL Assumption in AGM Hao Huang, Xiaofen Wang , Ke Zhang, Man Ho Au, Sheng Cao, Qinglin Zhao, Xiaosong Zhang International Conference on Information and Communications Security (ICICS 2024) / 2024 Portfolio-Based Incentive Mechanism Design for Cross-Device Federated Learning Jiaxi Yang, Sheng Cao, Cuifang Zhao, Weina Niu, Li-Chuan Tsai IEEE Wireless Communications and Networking Conference (WCNC 2024) / 2024 A Hash-Based Multidimensional Graph Neural Network Approach for Zero Trust Oriented Access Control Security Fengfan Shi, Sheng Cao*, Xiaosong Zhang The 29th IEEE International Conference on Parallel and Distributed Systems (ICPADS 2023) / 2023 Monero With Multi-Grained ",
  "content_length": 26175,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:10"
}