{
  "name": "Shenghao Yang 0001",
  "homepage": "https://shhyang.github.io",
  "status": "success",
  "content": "Shenghao's Homepage Shenghao's Homepage About Me Associate Professor, School of Science and Engineering, The Chinese University of Hong Kong, Shenzhen. Co-Founder, n-hop technologies. See my bio and CV. Academic Degrees PhD in Information Engineering from The Chinese University of Hong Kong, 2008. Master's degree in Communication Engineering from Peking University, 2004. Bachelor's degree in Electronic Information from Nankai University, 2001. Professional Experiences Before joining CUHK(Shenzhen) in 2015, I had been: Assistant Professor at Institute for Interdisciplinary Information Sciences, Tsinghua University, from 2012 to 2015. Postdoctoral Fellow and Research Associate at the Institute of Network Coding, The Chinese University of Hong Kong, from 2010 to 2012. Postdoctoral Fellow at the University of Waterloo, from 2008 to 2009. I co-founded n-hop technologies in 2018 to develop coding-based network communication technologies. Research My research is mainly in the area of information theory and coding theory, including their applications in network communication and computation. Some of research topics we have done are further explained in the following links: Coding-based network communication Network scheduling with delay Network function computation Shift-XOR codes Optimal finite-length codes I am also spending more efforts to theories related to security, quantum information, and AI. See my publications listed on Google Scholar and dblp. Hiring Students For theoretical research, exceptional mathematical skills (beyond mere knowledge) are essential. For system/experimental research, strong programming and hands-on skills are required. No finantial support available for PhD students in 2026. If you are interested in quantum information, please reach out to Prof. Masahito Hayashi, with whom we are co-supervising PhD students. A master's degree is not required for admission to the PhD program. For detailed admission requirements, please visit the CUHK(SZ) website. Research Assistants We welcome undergraduate students from CUHK(SZ) to participate in our research projects, and they can also earn credits through capstone projects and independent study. We also accept visiting students from other universities who are interested in our PhD program. Engineers/Researchers n-hop technologies is hiring engineers and researchers in developing the next generation of networking technologies. Job opportunities are available for all levels and in both Hong Kong and Shenzhen. Please refer to the corresponding job advertisements for more details, or contact me. Contact Me You can contact me at shyang@cuhk.edu.cn. Author: Shenghao Yang Created: 2025-07-25 Fri 11:01 Validate",
  "content_length": 2710,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:14"
}