{
  "name": "Sherif G. Aly",
  "homepage": "https://www.aucegypt.edu/fac/sherifaly",
  "status": "success",
  "content": "Sherif Aly | The American University in Cairo Skip to main content Sherif Aly Position: Professor Department: Department of Computer Science and Engineering Email: sgamal@aucegypt.edu Brief Biography Sherif Aly is a professor at the Department of Computer Science, with significant industrial and governmental consultation experience. His prime research interests include the interdisciplinary aspect of mobile and pervasive computing. He served as the chair of the American University in Cairo (AUC) Council of information management, advising and reporting to the vice president of information management on issues of governance, technology and decision making. He is the former vice chair of the university senate, associate dean for graduate studies and research at the School of Sciences and Engineering, director of the PhD program and associate chair of the Department of Computer Science and Engineering. He also headed a taskforce to empower computer science and engineering education.Aly participated in university-wide strategic planning, contributed intensively to the program design and steering of multiple academic programs and is currently an active international expert for the Accreditation Board of Engineering and Technology (ABET) evaluating international programs for accreditation compliance. Aly received his undergraduate education in computer science with interdisciplinary studies in business administration, engineering management and electrical engineering, earning his doctorate of science and master of science degrees from George Washington University, and his bachelor of science from AUC.Aly has worked in both governmental entities and academia as a senior scientist of innovation and entrepreneurship for the Egyptian government, a senior member of technical staff for general dynamics, a research scientist at Telcordia Technologies (formerly Bellcore), and a visiting scientist at the National Institute of Standards and Technology in the United States. He is a recipient of numerous diverse national and international awards for outstanding performance, including the AUC President’s Catalyst for Change Award, the Egypt National Prize for scientific research and has earned international recognition for outstanding teaching. He is also a strong believer in diversity, and a solid proponent of effective techniques of high quality education. Research Interest Mobile and Pervasive ComputingOperating SystemsProgramming LanguagesSoftware QualitySoftware Systems Design and Architecture Selected Publications Soumaia Al Ayat, Sherif G. Aly, and  Khaled A. Harras, “On the Integration Of Interest and Power Awareness In Social-Aware Opportunistic Forwarding Algorithms”, ElSevier Computer Communications Journal, Vol 71, Issue C, pp. 97-110, 2015. Soumaia Al Ayat, Sherif G. Aly, and  Khaled A. Harras, “PIPeR: Impact of Power-Awareness on Social-Based Opportunistic Advertising, the IEEE Wireless Communications and Networking Conference, Istanbul, Turkey, 2014. Sherif G. Aly and Ahmed Hamza, (2012), Quality-Sensitive Web Service Profiling and Discovery: In Support of Mobile and Pervasive Applications in Mobile Context Awareness, (Tom Lovett and Eamonn O’Neill), London: Springer, 133-143. Amr Al Jarhi, Hend A. Arafa, Khaled A. Harras, and Sherif G. Aly, “Rethinking Opportunistic Routing using Space Syntax”, the 6th ACM MobiCom Workshop on Challenged Networks (CHANTS) in conjunction with the 17th ACM Annual Conference on Mobile Computing and Networking (MOBICOM), Las Vegas, Nevada, USA, 2011. Sherif G. Aly and Amal Elnahas, “Sustained Service Lookup in Areas of Sudden Dense Population”, The Wiley International Journal of Wireless Communications and Mobile Computing, vol. 8, no. 1, pp. 61-74, 2008. Aisha Elsafty, Sherif G. Aly, and Ahmed Sameh. The Context Oriented Architecture: An Augmentation of Context Awareness and Reactivity into Web Services. Springer Studies in Computational Intelligence: Advances in Semantic Media Adaptation and Personalization, vol. 93, pp. 199-219, 2007. Book Contributions Sherif G. Aly (2014) in Paul Dietel and Harvey Dietel, Java: How to Program, 10th Global Edition, Pearson Sherif G. Aly (2015) in Ian Sommerville, Software Engineering, 10th Edition, Pearson Education 2001 - DSc in computer science, George Washington University, sub-specializing in electrical engineering and engineering management 1998 - MSc in computer science, George Washington University, United States 1996 - BSc in computer science, The American University in Cairo, Egypt (summa cum laude), sub-specializing in business administration and electronics",
  "content_length": 4616,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:19"
}