{
  "name": "Shi-Kuo Chang",
  "homepage": "https://cs.pitt.edu/~chang",
  "status": "success",
  "content": "Information about Captain SK Captain SK Professor Emeritus and Captain of Chronobot Department of Computer Science School of Computing and Information University of Pittsburgh Pittsburgh, PA 15260, U.S.A. E-mail: schang@pitt.edu Current Affiliation: President, KSI Research Inc. E-mail: shikuochang@yahoo.com About the Captain (To view Captain SK's grandchildren click on the photo of Captain SK performing the wedding ceremony for his PhD student Ms. YingZe Wang and CMU graduate Dr. Xi Chen on July 7, 2013) Technical Publications Patents and Inventions Chronobot: Device and method for time and knowledge exchange and management (Patent US7827067 issued November 2, 2010) FaceAlive Icons: Icons for animated emotional expressions (Technology Review Today, March 27, 2007) Smart Image System: (Patent US5974201 issued Oct 26, 1999) Recognition Elected to 2022 Twenty Most Popular Writers by a top literary journal in Taiwan A Special Issue in honor of Caption SK was published in Journal of Visual Languages and Computing, Vol. 38, 2017 The 2017 S K Chang Best Paper Award went to: Situated Analytics: Demonstrating immersive analytical tools with Augmented Reality by Neven A. M.ElSayed, Bruce H. Thomas, Kim Marriott, Julia Piantadosi and Ross T. Smith (Journal of Visual Languages and Computing 36, 2016, 13-23) Caption SK's novel, The City Trilogy, was taught in ENGL 2400 World Literature in Spring 2017 and ENGL 3290 Asian Amer Lit/GRBK 2010 Great Books of Modern China in Fall 2017 by Prof. Su-ching Huang at East Carolina University Hewlett International Grant: International Collaborative Research on Slow Intelligence Systems (October 2011) IBM Faculty Innovation Award: Intelligent Interface Design for Smarter Healthcare (November 5, 2010) Journals edited by Caption SK Journal of Software Engineering & Knowledge Engineering edited by Captain SK (IJSEKE is covered in the CompuMath Citation Index CMCI) Journal of Visual Languages and Computing edited by Captain SK until 2016 Journal of Distance Education Technologies edited by Captain SK until 2010 (JDET is covered in Compendex of Elsevier Engineering Information) Journal of Computer Processing of Oriental Languages edited by Captain SK until 2004 Courses Currently or Recently taught by Captain SK CS2310 Multimedia Software Engineering CS2650 Distributed Multimedia Systems CS3650 Visual Languages and Programming CS1530 Software Engineering CS1555 Database Systems CS1631 Software Design Methodology CS1635 Interface Design Methodology CS0699 Visual Languages and Modelling CS0132 C and Unix CS0134 Web Design and Development Books, Novels and Short Stories Recent technical books: Handbook of Software Engineering and Knowledge Engineering (ed., Vol. I 2001, 926 pages, Vol. II 2002, 794 pages, Vol. III 2005, 518 pages), Multimedia Software Engineering (2000) and Symbolic Projection for Image Information Retrieval and Spatial Reasoning (1996) Captain SK's SciFi WebSite Literary publications, Empires and Taike (2008), science fiction lectures, essays V-topia (2001) and science fiction novel The City Trilogy (Columbia University Press, New York, 2003 ISBN 0-231-12852-5) Short story by Captain SK: Nocturne (A patent on chronobot described in this story was issued by US Patent Office in 2010. English version was published in Bridges Around the World: A Global Anthology of Short Stories, M. Lee, Ed. Temenos Pub. May 2012 ISBN 978-0984619955, and received a raving review from the International Short Story Forum) Short story by Captain SK: A Storm Wind's Blowing Short story by Captain SK: Fiery Mountain Short story by Captain SK: Strange Tale of the Black Stone Short story by Captain SK: Love Bridge Short story by Captain SK: Dragon Seed Captain SK (right) talking to Xinjian Gao (left), the Nobel laureate in literature The Joy of Computing (2001 new edition)",
  "content_length": 3847,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:23"
}