{
  "name": "Shi-Feng Sun 0001",
  "homepage": "https://infosec.sjtu.edu.cn/DirectoryDetail.aspx?id=164",
  "status": "success",
  "content": "孙士锋-上海交通大学网络空间安全学院 简体中文 | English 首 页 学院概况 欢迎辞 学院介绍 组织结构 学院领导 历任领导 学院办公室 联系我们 师资队伍 教师名录 两院院士 会士 国家级人才计划 国家网络安全奖 其他人才计划 学院新闻 科学研究 科研方向 科研基地 科研团队 科研成果 人才培养 三全育人 本科生 硕士研究生 博士研究生 工程硕士生 国际联合培养项目 教学研究室 党建工作 党建动态 学习园地 招聘专栏 教职招聘 博士后招聘 通知通告 通知通告 信息公开 师资队伍 教师名录 两院院士 会士 国家级人才计划 国家网络安全奖 其他人才计划 首页 » 师资队伍 » 教师名录 shifeng.sun@sjtu.edu.cn 个人主页 孙士锋 副院长，长聘教轨副教授 孙士锋，博士，现任上海交通大学网络空间安全学院长聘教轨副教授、博士生导师，曾任澳大利亚Monash大学信息技术学院助理教授（终身教职）。主要研究方向为密码学与数据隐私保护技术等，在ACM CCS、NDSS、USENIX Security、EUROCRYPT、ASIACRYPT、PKC、ESORICS、IEEE TDSC、DCC等密码安全领域主流国际会议或期刊上发表学术论文30余篇，主持/参与NSFC重点项目、面上项目等国家级项目10余项，荣获2019年中国密码学会优秀博士学位论文奖和2018年中办密码科技进步奖。担任中国密码学会大数据与人工智能安全专委会委员兼秘书、中国中文信息学会大数据安全和隐私计算专委会委员，以及ASIACRYPT、ACISP、ISC等国际密码安全会议程序委员会委员。 研究兴趣 教育背景 工作经验 教授课程 论文发表 项目资助 获奖信息 学术服务 密码学、数据安全、隐私保护技术 1.Yanxue Jia, Shi-Feng Sun*, Hong-Sheng Zhou, Dawu Gu. A Universally Composable Non-interactive Aggregate Cash System. ASIACRYPT 2022: 745-773. 2.Yanxue Jia, Shi-Feng Sun*, Hong-Sheng Zhou, Jiajun Du, Dawu Gu. Shuffle-based Private Set Union: Faster and More Secure. USENIX Security Symposium 2022: 2947-2964. 3.Jianfeng Wang, Shi-Feng Sun#, Tianci Li, Saiyu Qi, Xiaofeng Chen. Practical Volume-Hiding Encrypted Multi-Maps with Optimal Overhead and Beyond. ACM CCS 2022: 2825-2839. 4.Shi-Feng Sun, Ron Steinfeld, and Shangqi Lai, Xingliang Yuan, Amin Sakzad and Joseph K. Liu, Surya Nepal, Dawu Gu. Practical Non-Interactive Searchable Encryption with Forward and Backward Privacy. NDSS 2021. 5.Shi-Feng Sun, Amin Sakzad, Ron Steinfeld, Joseph K. Liu, Dawu Gu. Public-Key Puncturable Encryption: Modular and Compact Constructions. PKC 2020: 309-338. 6.Veronika Kuchta, Amin Sakzad, Damien Stehl′e, Ron Steinfeld, Shi-Feng Sun. Measure-Rewind-Measure: Tighter Quantum Random Oracle Model Proofs for One-Way to Hiding and CCA Security. EUROCRYPT 2020: 703-728. 7.Shi-Feng Sun, Cong Zuo, Joseph K. Liu, Amin Sakzad, Ron Steinfeld, Tsz Hon Yuen, Xingliang Yuan, Dawu Gu. Non-Interactive Multi-Client Searchable Encryption: Realization and Implementation. IEEE Transactions on Dependable and Secure Computing (IEEE TDSC). DOI: 10.1109/TDSC.2020.2973633 8.Cong Zuo, Shi-Feng Sun*, Joseph K. Liu, Jun Shao, Josef Pieprzyk. Dynamic Searchable Symmetric Encryption with Forward and Stronger Backward Privacy. ESORICS 2019: 283-303. 9.Shi-Feng Sun, Xingliang Yuan, Joseph K. Liu, Ron Steinfeld, Amin Sakzad, Viet Vo, Surya Nepal. Practical Backward-Secure Searchable Encryption from Symmetric Puncturable Encryption. ACM CCS 2018:763-780. 10.Shangqi Lai, Sikhar Patranabis, Amin Sakzad, Joseph K. Liu, Debdeep Mukhopadhyay, Ron Steinfeld, Shi-Feng Sun*, Dongxi Liu, Cong Zuo. Result Pattern Hiding Searchable Encryption for Conjunctive Queries. ACM CCS 2018: 745-762. 11.Shi-Feng Sun, Man Ho Au, Joseph K. Liu, Tsz Hon Yuen. RingCT 2.0: A Compact Accumulator-Based (Linkable Ring Signature) Protocol for Blockchain Cryptocurrency Monero. ESORICS 2017: 456-474. 12.Shi-Feng Sun, Joseph K. Liu, Amin Sakzad, Ron Steinfeld, Tsz Hon Yuen. An Efficient Non-interactive Multi-client Searchable Encryption with Support for Boolean Queries. ESORICS 2016: 154-172. 其中“#”表示共同第一作者，“*”表示通讯作者。 学院概况 优秀的师资团队，丰富的校园生活，温馨如家的环境，积极的学习氛围 科学研究 学院先后承担多项国家军事科研项目、国家信息安全应用示范工程等40余项 人才培养 国家教育部、科技部、上海市人民政府共同发起的国内首家信息安全专业人才培养基地 友情链接： 上海交通大学电子信息与电气工程学院 上海交通大学 Copyright © 2017 - 2019 上海交通大学网络空间安全学院 沪ICP备05052060号",
  "content_length": 3326,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:18"
}