{
  "name": "Shi Li 0001",
  "homepage": "https://tcs.nju.edu.cn/shili",
  "status": "success",
  "content": "Shi Li's Home Page Shi Li (栗师) Professor Theory Group School of Computer Science Nanjing University Email: shili[a]nju[o]edu[o]cn Ph.D: Princeton University (2014.1) BS: Tsinghua University (2008) Here is my CV (updated on Nov 08, 2025). Bio 2023.4 - current Professor Theory Group, Department of Computer Science and Technology, Nanjing University 2020.9 - 2023.1 Associate Professor Department of Computer Science and Engineering, University at Buffalo 2015.9 - 2020.8 Assistant Professor Department of Computer Science and Engineering, University at Buffalo 2013.9 - 2015.8 Research Assistant Professor Toyota Technological Institute at Chicago Education 2008.9 - 2014.1 Ph.D. Department of Computer Science, Princeton University,   advisor: Moses Charikar 2004.9 - 2008.6 BS Department of Computer Science and Technology, Tsinghua University 2005.9 - 2008.6 Andrew Chih-Chi Yao's Special Pilot Class Research Interests Theoretical Computer Science: design and analysis of algorithms on combinatorial optimization problems clustering, facility location, scheduling and network design online algorithms, learning augmented algorithms Teaching Advanced Algorithms (Fall 2025) (Co-teaching with Yitong Yin and Jingcheng Liu) Design and Analysis of Algorithms (Spring 2025) Advanced Algorithms (Fall 2024) (Co-teaching with Yitong Yin and Jingcheng Liu) Design and Analysis of Algorithms (Spring 2024) Advanced Algorithms (Fall 2023) (Co-teaching with Yitong Yin and Jingcheng Liu) Courses taught at University at Buffalo: CSE431/531: Analysis of Algorithms I (Fall 2022, Spring 2022, Fall 2021, Spring 2021, Spring 2020, Spring 2019, Spring 2018, Fall 2016, Spring 2016) CSE632: Analysis of Algorithms II (Topics Vary) (Fall 2017, Fall 2019, Fall 2020) CSE7xx Seminars (Topics Vary) (Fall 2015, Fall 2018, Fall 2019, Fall 2020) Other courses: EECS336: Design and Analysis of Algorithms at Northwestern University (Winter 2015) co-taught Information and Coding Theory at TTIC with Madhur Tulsiani (Fall 2014) Students PhD students: Yuda Feng (冯昱达）, Han Dai （代涵）, Zaixuan Wang（王在烜）, Weijiang Hu（胡伟江）, Yuhang Chen（陈煜航） Master students: Zihao Liang（梁梓豪）, Jia Ye（叶佳） Past Postdoc: Ruilong Zhang（张瑞龙） Past PhD students: Xiangyu Guo, Yunus Esencayi, Jiayi Xian Selecated Sample Publications Full List of Publications, Google Scholar Citations Page, DBLP Page Etienne Bamas, S. Li and Lars Rohwedder, Randomized Rounding over Dynamic Programs, ManuscriptXiaohui Bei, Yuda Feng, Yang Hu, S. Li and Ruilong Zhang, Nash Social Welfare with Submodular Valuations: Approximation Algorithms and Integrality Gaps, ManuscriptYuda Feng and S. Li, A Note on Approximating Weighted Nash Social Welfare with Additive Valuations, TheoretiCS, August 14, 2025, Volume 4, TheoretiCS:14642Yong Chen, S. Li and Zihao Liang, Complexity and Approximation Algorithms for Fixed Charge Transportation Problems, TAMC 2025Yinhao Dong, Shan Jiang, S. Li and Pan Peng, Learning-Augmented Streaming Algorithms for Correlation Clustering, NeurIPS 2025S. Li, Ruilong Zhang and Chengyang Xu, Logarithmic Approximations for Fair k-Set Selection, IJCAI 2025Nairen Cao, S. Li and Jia Ye, Simultaneously Approximating All Norms for Massively Parallel Correlation Clustering, ICALP 2025Yuda Feng, Yang Hu, S. Li and Ruilong Zhang, Constant Approximation for Weighted Nash Social Welfare with Submodular Valuations, STOC 2025Nairen Cao, Vincent Cohen-Addad, Euiwoong Lee, S. Li, David Rasmussen, Alantha Newman, Mikkel Thorup, Lukas Vogl, Shuyi Yan and Hanwen Zhang, Solving the Correlation Cluster LP in Nearly Linear Time, STOC 2025S. Li, Approximating Unrelated Machine Weighted Completion Time Using Iterative Rounding and Computer Assisted Proofs, SODA 2025Michael Dinitz, Guy Kortsarz and S. Li, Degrees and Network Design: New Problems and Approximations, APPROX + RANDOM 2024Yuda Feng and S. Li, A Note on Approximating Weighted Nash Social Welfare with Additive Valuations, ICALP 2024, Best Paper Award of Track AS. Li, Chenyang Xu and Ruilong Zhang, Polylogarithmic Approximation for Robust s-t Path, ICALP 2024Sungjin Im, Ravi Kumar, S. Li, Aditya Petety and Manish Purohit, Online Load and Graph Balancing for Random Order Inputs, SPAA 2024, Outstanding Paper AwardNairen Cao, Vincent Cohen-Addad, Euiwoong Lee, S. Li, Alantha Newman and Lukas Vogl, Understanding the Cluster Linear Program for Correlation Clustering, STOC 2024Vincent Cohen-Addad, Euiwoong Lee, S. Li and Alantha Newman, Handling Correlated Rounding Error via Preclustering: A 1.73-approximation for Correlation Clustering, FOCS 2023S. Li, Nearly-Linear Time LP Solvers and Rounding Algorithms for Scheduling Problems, ICALP 2023Ravishankar Krishnaswamy, S. Li and Varun Suriyanarayana, Online Unrelated-Machine Load Balancing and Generalized Flow with Recourse, STOC 2023Sungjin Im and S. Li, Improved Approximations for Unrelated Machine Scheduling, SODA 2023Vincent Cohen-Addad, Yunus Esencayi, Chenglin Fan, Marco Gaboardi, S. Li and Di Wang, On Facility Location Problem in Local Differential Privacy Model, AISTATS 2022S. Li and Bundit Laekhanukit, Polynomial Integrality Gap of Flow LP for Directed Steiner Tree, SODA 2022S. Li and Jiayi Xian, Online Unrelated Machine Load Balancing with Predictions Revisited, ICML 2021, long presentationXiangyu Guo, Janardhan Kulkarni, S. Li and Jiayi Xian, Consistent k-Median: Simpler, Better and Robust, AISTATS 2021S. Li, Towards PTAS for Precedence Constrained Scheduling via Combinatorial Algorithms, SODA 2021Xiangyu Guo, Janardhan Kulkarni, S. Li and Jiayi Xian, On the Facility Location Problem in Online and Dynamic Models, APPROX 2020Xiangyu Guo, Guy Kortsarz, Bundit Laekhanukit, S. Li, Daniel Vaz and Jiayi Xian, On Approximating Degree-Bounded Network Design Problems, APPROX 2020Di Wang, Xiangyu Guo, Chaowen Guan, S. Li and Jinhui Xu, Estimating Stochastic Linear Combination of Non-linear Regressions, AAAI 2020Janardhan Kulkarni, S. Li, Jakub Tarnawski and Minwei Ye, Hierarchy-Based Algorithms for Minimizing Makespan under Precedence and Communication Constraints, SODA 2020Yunus Esencayi, Marco Gaboardi, S. Li and Di Wang, Facility Location Problem in Differential Privacy Model Revisited, NeurIPS 2019Fabrizio Grandoni, Bundit Laekhanukit and S. Li, O(log2k/loglog k)-Approximation Algorithm for Directed Steiner Tree: A Tight Quasi-Polynomial-Time Algorithm, STOC 2019, invited to a special issue of SICOMPMichael Langberg, S. Li, Sai Vikneshwar Mani Jayaraman and Atri Rudra, Topology Dependent Bounds for (Some) FAQs, PODS 2019Shashwat Garg, Janardhan Kulkarni and S. Li, Lift and Project Algorithms for Precedence Constrained Scheduling to Minimize Completion Time, SODA 2019S. Li, On Facility Location with General Lower Bounds, SODA 2019Uri Feige, Janardhan Kulkarni and S. Li, A Polynomial Time Constant Approximation For Minimizing Total Weighted Flow-time, SODA 2019Xiangyu Guo and S. Li, Distributed k-Clustering for Data with Heavy Noise, NeurIPS 2018, SpotlightRavishankar Krishnaswamy, S. Li and Sai Sandeep, Constant Approximation for k-Median and k-Means with Outliers via Iterative Rounding, STOC 2018S. Li, Scheduling to Minimize Total Weighted Completion Time via Time-Indexed Linear Programming Relaxations, FOCS 2017, invited to a special issue of SICOMPDeeparnab Chakrabarty, Sanjeev Khanna and S. Li, On (1,ε)-Restricted Asgsignment Makespan Minimization, SODA 2015S. Li and Ola Svensson, Approximating k-Median via Pseudo-Approximation, STOC 2013Julia Chuzhoy and S. Li, A Polylogarithmic Approximation for Edge-Disjoint-Paths with Congestion 2, FOCS 2012, co-winner of best paper awardS. Li, A 1.488-Approximation Algorithm for the Uncapacitated Facility Location Problem, ICALP 2011, best student paper of Track A Professional Activities PC member for APPROX+RANDOM 2017, SWAT 2018, MAPSP 2019, ISAAC 2019, TAMC 2020, ESA 2020, SODA 2021, ICALP 2021, APPROX 2021, STOC 2022, SODA 2023, IJTCS-FAW 2023, COCOON 2024, ISAAC 2024, WAOA 2024, STOC 2025, ICALP 2025, ICALP 2026 (upcoming), ISAAC 2026 (upcoming) Editorial Board Member of the ACM Transactions on Algorithms (since March 2019) Guest Editor of A Special Issue of Journal of Scheduling Local Committee Member of FWCG 2015",
  "content_length": 8205,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:17"
}