{
  "name": "Shichao Pei",
  "homepage": "https://scpei.github.io",
  "status": "success",
  "content": "Shichao Pei Shichao Pei Assistant Professor Department of Computer Science University of Massachusetts Boston M-3-201-05, 3rd Floor, McCormack Hall shichao.pei@umb.edu Home | Publications | Group | Service I am an Assistant Professor in the Department of Computer Science at the University of Massachusetts Boston (UMass Boston). My research interests broadly lie in machine learning and AI, in particular foundation models, AI safety, AI agent, data-efficient machine learning, etc. Previously, I was a Postdoctoral Research Fellow at University of Notre Dame. And I received my Ph.D. in computer science from King Abdullah University of Science and Technology (KAUST) in Dec. 2021, where I was part of the Machine Intelligence and kNowledge Engineering (MINE) Lab in the Computational Bioscience Research Center (CBRC), advised by Prof. Xiangliang Zhang. I also received my M.S. degree in computer science from KAUST in Dec. 2017. Before that, I obtained a B.Eng. in software engineering from Xi'an Jiaotong University, where my research began under the supervision of Prof. Chao Shen. I am looking for self-motivated Ph.D. students to join my research group. Please drop me an email if you are interested in working with me! Openings Fully funded Ph.D. students (2026 Spring) Remote interns News Aug 2025: I have received a grant from Open Philanthropy to support my research on AI safety. Thank you, Open Philanthropy! Aug 2025: My team was accepted into the E2B for Research program. Thanks to E2B for the support on AI agent! June 2025: I received the National AI Research Resource Pilot Award to support the research on Foundation Multi-Step Models. Thanks NAIRR! June 2025: I received the NSF CRII Award to support the research on Collaborative Continual Learning. Thanks NSF! Jan 2025: One paper is accepted by ICLR 2025! Dec 2024: One paper is accepted by AAAI 2025! Sep 2024: One paper is accepted by EMNLP 2024! July 2024: One paper is accepted by CIKM 2024! July 2024: I received the Joseph P. Healey Research Grant to support the research on data-efficient learning! May 2024: One paper is accepted by KDD 2024! May 2024: One paper is accepted by ACL 2024! Apr 2024: Two papers are accepted by IJCAI 2024! Oct 2023: One tutorial is accepted by AAAI 2024! May 2023: One paper is accepted by KDD 2023! Apr 2023: One paper is accepted by IJCAI 2023! Apr 2023: One paper is accepted by SIGIR 2023! Mar 2023: I was invited to serve in the program committee of NeurIPS, ECML-PKDD, FAccT 2023. Dec 2022: I was invited to serve in the program committee of KDD, ICML, IJCAI 2023. Nov 2022: One paper is accepted by AAAI 2023! Aug 2022: One paper is accepted by CIKM 2022! Mar 2022: I was invited to serve in the program committee of AAAI, ICLR 2023. Apr 2022: One paper is accepted by IJCAI 2022! Mar 2022: I was invited to serve in the program committee of NeurIPS, ECML 2022. Jan 2022: One paper is accepted by TheWebConf 2022! Dec 2021: I was invited to serve in the program committee of KDD, ICML 2022. Dec 2021: One paper is accepted by AAAI 2022! Nov 2021: I have successfully defended my dissertation! Oct 2021: I was invited to serve in the program committee of SDM 2022. Aug 2021: I was invited to serve in the program committee of AAAI 2022. Jul 2021: I was invited to serve in the program committee of IJCAI 2022. Jun 2021: I was invited to serve in the program committee of ICLR 2022. Jun 2021: One paper is accepted by TKDE! Apr 2021: I gave a virtual spotlight talk at KAUST Conference on Artificial Intelligence for our work on knowledge association. Apr 2021: I was invited to serve in the program committee of NeurIPS 2021. Jan 2021: I was selected as one of the winners of CEMSE 2020/2021 PhD student awards! Dec 2020: I was invited to serve in the senior program committee (SPC) of IJCAI 2021. Nov 2020: I successfully passed my PhD proposal defense! Thanks to all of the committee members! Oct 2020: Finally came back to KAUST after spending 8 months in my hometown. Aug 2020: I was invited to serve in the program committee (PC) of ICML 2021. Aug 2020: I was invited to serve in the program committee (PC) of AAAI 2021. Apr 2020: I was invited to serve in the program committee of NeurIPS 2020. May 2020: One paper is accepted by KDD 2020! Jan 2020: I was invited to serve in the program committee of IJCAI 2020. Oct 2019: I was invited to serve in the program committee of ECAI 2020. May 2019: One paper is accepted by IJCAI 2019! Jan 2019: One paper is accepted by TheWebConf 2019! Professional Service Workshop Committee: DME2023-Publicity Chair, PSTDA2024-General Chair Conference Senior Program Committee (SPC): IJCAI 2021 Conference Program Committee (PC): (Not updating) AAAI 2025, KDD 2025, ICLR 2025, WWW 2025, NeurIPS 2024, ICML 2024, KDD 2024, ACL 2024, ECAI 2024, IJCAI 2024, ICLR 2024, WWW 2024, AAAI 2024, SDM 2024, NeurIPS 2023, ECML-PKDD 2023, FAccT 2023, KDD 2023, ICML 2023, IJCAI 2023, ICLR 2023, AAAI 2023, KDD 2022, ICML 2022, NeurIPS 2022, ICLR 2022, IJCAI 2022, AAAI 2022, SDM2022, ECML-PKDD 2022, AAAI 2021, ICML 2021, NeurIPS 2020-2021, ECAI 2020, IJCAI 2020, NLPCC 2020 Reviewer: ACM Transactions on Information Systems (TOIS), IEEE Transactions on Knowledge and Data Engineering (TKDE), IEEE Transactions on Neural Networks and Learning Systems (TNNLS), TheWebConf 2021, WSDM 2021, KDD 2019 Proposal Panelist: NSF 2023, 2025 Teaching Assistant: CS340 Computational Methods in Data Mining 2018, 2019, 2020 Teaching Assistant: CS229 Machine Learning 2020, 2021 Last update: Aug 2025. Webpage template borrows from Stephen Bach.",
  "content_length": 5578,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:20"
}