{
  "name": "Shih-Hao Hung",
  "homepage": "https://www.csie.ntu.edu.tw/~hungsh",
  "status": "success",
  "content": "Prof. Shih-Hao Hung's Home Page 洪士灝 教授 台灣大學資訊工程學系暨網路與多媒體研究所 台北市羅斯福路四段一號 資訊工程系館 320室 Shih-Hao Hung, Ph.D., Professor Dept of Computer Science and Information Engineering, Graduate Institute of Networking and Multimedia, National Taiwan University #1 Roosevelt Rd. Sec. 4, Taipei, Taiwan 106, ROC Phone : +886-2-3366-4888 ext. 320 FAX : +886-2-2362-8167 e-mail : hungsh@csie.ntu.edu.tw 位置資訊 Location Information Before joining NTU in Feb. 2005, I worked for Sun Microsystems in the San Francisco Bay Area for 5 years. During 1992-2000, I earned my Ph.D. and M.S. degrees in Computer Science and Engineering and completed a post-Doctorial study training Prof. Edward S. Davidson at the Advanced Computer Architectural Lab in The University of Michigan. I received my B.S. degree in Electrical Engineering at the NTU in 1989. When I arrived at NTU, I established the Performance, Applications, and Security Lab (PAS Lab) in the Department of Computer Science and Information Engineering and the Graduate Institute of Networking and Multimedia in 2005. I have served as the Section Director in the Computer and Information Network Center of NTU from 2012 to 2016. 2016-Present: Full Professor, Dept. of CSIE, NTU, Taipei, Taiwan. 2012-2016: Associate Professor, Dept. of CSIE, NTU, Taipei, Taiwan. 2005-2012: Assistant Professor, Dept. of CSIE, NTU, Taipei, Taiwan. 2000-2005: Staff Engineer, Sun Microsystems, Inc., Menlo Park, CA, USA. 1998-2000: Research Fellow, Dept. of EECS, U. of Michigan, Ann Arbor, MI, USA. 1992-1998: Graduate Student Research Assistant, U. of Michigan, Ann Arbor, MI, USA. 1991-1992: Teaching Assistant, Dept. of EE, NTU, Taipei, Taiwan. 1989-1991: Lieutenant, Marine, Taiwan. 1985-1989: Undergraduate Student, Dept. of EE, NTU, Taipei, Taiwan. 1982-1985: Chien-Kuo Senior High School, Taipei, Taiwan. I have studied computers since 1982 since my highschool days. My current research interests are in the following areas: 效能分析優化工程     Performance Analysis/Optimization Engineering 平行與分散式運算     Parallel and Distributed Computing Technologies 異質多核系統架構     Heterogeneous and Multicore System Architecture 開源系統軟體活用     Active Utilization of Open Source System Software 高效深度學習系統 High Performance Deep Learning Systems My most recent works can be found in the following talk: 深度學習系統之設計與加速 (Talk hosted by 科技部AI創新專案計畫推動辦公室, 2017/12/01) 以大數據反覆訓練複雜的人工神經網路模型，需要消耗非常多的計算資源，因此需要化約或加速的機制，加上平行與分散式處理，才能大幅縮短訓練所需時間。近年來深度學習加速器的發展可謂百花齊放，GPU雖然是時下熱門的解決方案，但專為特定人工智慧應用打造的ASIC，或是隨時可根據應用特性變換電路結構的FPGA，具有低能耗的優勢，符合需要低功率的行動裝置或是希望節省用電成本的資料中心的需求。然而，如何從應用面出發，選擇最合適的加速器，同時優化人工智慧軟體框架對應用與加速器的效率，則是在設計與佈署人工智慧系統的關鍵技術。當前的人工智慧軟體框架，也可謂百鳥爭鳴，大多數為開放原始碼計畫，皆有其設計理念、與眾不同的特色，但對於加速器的支援程度以及效能表現上，則差異甚大。我們以TensorFlow為個案，在以多台HGX-1節點所構成的叢集上量測與分析其效能表現，探討硬體架構與軟體參數對效能的影響，從中學習如何設計與加速深度學習系統。 We have been working with industry-leading partners, including IBM, Intel, AMD, NVIDIA, ARM, MediaTek (聯發科技), QNAP (威廉通), ADLINK (凌華), Foxconn (鴻海), Quanta (廣達) in researching advanced computing technologies and accelerating important applications. The collaboration constantly innovates technologies and contributes to the academia. Collaboration with QNAP on improving the performance of Network-Attached Storage (NAS) Servers based on open source system software 以GPGPU加速系統資料去重複運算 - Wei-Cheng Lin, Chia-Heng Tu, Chih Wei Yeh, Shih-Hao Hung:GPU acceleration for Kernel Samepage Merging. RTCSA 2017: 1-6 以GPGPU與RDMA加速Spark叢集的效能 - Yi-Wei Chen, Shih-Hao Hung, Chia-Heng Tu, Chih Wei Yeh:Virtual Hadoop: MapReduce over Docker Containers with an Auto-Scaling Mechanism for Heterogeneous Environments. RACS 2016: 201-206 Work with Foxconn on High-Performance Computing, Deep Learning and Precision Medicine 以異質計算（GPGPU/FPGA）加速醫學應用 - Shih-Hao Hung, Min-Yu Tsai, Bo-Yi Huang, Chia-Heng Tu:A Platform-Oblivious Approach for Heterogeneous Computing: A Case Study with Monte Carlo-based Simulation for Medical Applications. FPGA 2016: 42-47 Developing Performance Analysis and System Prototyping Tools for Heterogeneous Multicore Android Smartphones with MediaTek - Hao-Che Hsu, Chih Wei Yeh, Shih-Hao Hung, Wei-Chung Hsu, Chung-Ta King, Yeh-Ching Chung:HSAemu 2.0: Full System Emulation for HSA platforms with Soft-MMU. RACS 2016: 230-235 - Cheng-Kung Lai, Chih Wei Yeh, Chia-Heng Tu, Shih-Hao Hung:Fast profiling framework and race detection for heterogeneous system. Journal of Systems Architecture - Embedded Systems Design 81: 83-91 (2017) - Tsung-Han Chiang, Cheng-Yueh Liu, Chih Wei Yeh, Chia-Heng Tu, Shih-Hao Hung:Program Analysis with a Loop-Function-based Tracing Tool on Virtual Platforms. RACS 2017: 255-260 (Best Paper Award) 以機器學習偵測與防止Android惡意程式 - Chih Wei Yeh, Wan-Ting Yeh, Shih-Hao Hung, Chih-Ta Lin: Flattened Data in Convolutional Neural Networks: Using Malware Detection as Case Study. RACS 2016: 130-135 - Shih-Hao Hung, Shuen Wen Hsiao, Yu-Chi Teng, Roger Chien:Real-time and intelligent private data protection for the Android platform. Pervasive and Mobile Computing 24: 231-242 (2015) - Wen-Chieh Wu, Shih-Hao Hung:DroidDolphin: a dynamic Android malware detection framework using big data and machine learning. RACS 2014: 247-252 (Best Paper Award) For more information, please check out the follow links: 給新生的訊息 Recruiting Information 我的臉書首頁 My Facebook Homepage 我的部落格 My Blog 我的工作經歷 My LinkedIn Page 我的台大學術首頁 My Academic Hub@NTU 我的研究論文 My ResearchGate 我個課程網頁 My Courses Site 我的實驗室網站 My Research Lab Some recent non-academic articles: 系統優化的故事：為什麼我們做別人不（屑）做的研發? (Rocket Cafe, 2016/03) 電腦下贏世界圍棋冠軍又如何？（數位時代，2016/03) SUN的興衰，不是這樣看的 (Rocket Cafe, 2016/03) 改行做軟體與自學新專業 (數位時代，2016/03) 關於資訊科學納入通識教育的思考，與蘇文鈺的虛擬對談 (數位時代，2016/01) 開創台灣人工智慧產業發展需要三種人才，我們準備好了嗎？(2016/01) 別讓「主流安全牌思維」變創新絆腳石 （IThome, 2015/12） 轉型到Open Source的世界來尋寶 (2015/11) 悅讀程式：自學軟體開發的第一步 (2015/11) 給高中生的演講：大數據、小秘密，談資訊教育的重要性 (2015/10) 科技正在翻轉世界，但你還來得及準備！(Inside, 2015/10) 人才何去何從？迎接人才時代的降臨 (數位時代，2015/08) 台大資工畢業生，為何鬱鬱寡歡？(遠見，2015/06) 台灣高等教育與人才培育 學界業界與政府應負的責任 (台大政法中心研究報告, 2015/05) 科技大廠該擺脫「快老二」心態，才能在創新路上跨大步 (關鍵評論網，2015/03) Revised by Shih-Hao Hung, 2016.03.15",
  "content_length": 5987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:24"
}