{
  "name": "Shihao Ji 0001",
  "homepage": "https://sji.soc.uconn.edu",
  "status": "success",
  "content": "Jonathan Shihao Ji - Homepage Jonathan Shihao Ji, Ph.D. Director, Intelligent Systems Lab Associate Professor School of Computing, College of Engineering University of Connecticut (UConn) Office: ITE 361 Email: shihao.ji@uconn.edu >> Project Pepper >> Project Spot >> UAV3D Benchmark [Google Scholar, Publications, Teaching, Group, Software, Sponsor, Internal] Recuriting Multiple PhD student positions are available for Spring/Fall 2025. I am looking for self-motivated students with strong mathematical and programming skills to work with me on computer vision, natural language processing, and reinforcement learning projects. If interested, please read this page for details. For UConn students, you are welcome to reach out to me anytime. Short Bio I'm an Associate Professor in the School of Computing at University of Connecticut (UConn). My principal research interests lie in the area of deep learning and its applications to computer vision, natural language processing, and robotics, with an emphasis on high-performance computing. I'm interested in developing efficient algorithms that can learn from a variety of data sources (e.g., image, audio, text and time series) on large scale and automate decision-making processes in dynamic environments. I have published over 60 papers in top-ranked journals and prestigious conferences with high impact factors, including CVPR, NeurIPS, ICCV, ECCV, ICLR, ICML, AAAI, AIStats, BMVC, ECML, ICIP, IJCNN, EMNLP, SIGIR, CIKM, COLING, IEEE TPAMI, TSP, TKDE, TPDS, IEEE Internet of Things Journal etc. My research has been supported by federal agencies, including NSF, NIH, DoD, ARO, as well as industry companies, such as VMware, Cisco, Nvidia, and Bill & Melinda Gates Foundation. I received my Ph.D. in Electrical and Computer Engineering from Duke University, where I worked with Dr. Larry Carin. Before joining UConn, I was an Associate Professor in Computer Science at Georgia State University and Director of the DoD Center of Excellence (CiARE). Prior to returning to academia, I spent approximately 10 years in industry research labs. I am a Senior Member of the IEEE. Publications Refereed Publications Kaiyang Li, Shaobo Han, Qing Su, Wei Li, Zhipeng Cai, and Shihao Ji, \"Uni-LoRA: One Vector is All You Need,\" The 39th Conference on Neural Information Processing Systems (NeurIPS, IF: 42.3), San Diego, USA, Dec. 2025. [arXiv | code] (Spotlight) Khaled Mohammed Saifuddin, Shihao Ji, and Esra Akbas, \"HyperGCL: Multi-Modal Graph Contrastive Learning via Learnable Hypergraph Views,\" International Joint Conference on Neural Networks (IJCNN, 7.1), Rome, Italy, June 2025. [arXiv] Yang Li, Shaobo Han, and Shihao Ji, \"VB-LoRA: Extreme Parameter Efficient Fine-Tuning with Vector Banks,\" The 38th Conference on Neural Information Processing Systems (NeurIPS, IF: 42.3), Vancouver, Canada, Dec. 2024. [arXiv | code] Hui Ye, Raj Sunderraman, and Shihao Ji, \"UAV3D: A Large-scale 3D Perception Benchmark for Unmanned Aerial Vehicles,\" The 38th Conference on Neural Information Processing Systems (NeurIPS, IF: 42.3), Vancouver, Canada, Dec. 2024. [project website | arXiv] Qing Su, and Shihao Ji, \"Unsqueeze [CLS] Bottleneck to Learn Rich Representations,\" The 18th European Conference on Computer Vision (ECCV, IF: 38.7), Milano, Italy, Sept. 2024. [eccv | arXiv | code] Han Xu, Yutong Li, and Shihao Ji, \"LlamaF: An Efficient Llama2 Architecture Accelerator on Embedded FPGAs,\" The 10th IEEE World Forum on Internet of Things (WF-IoT), Ottawa, Canada, Nov. 2024. [arXiv] Hui Ye, Raj Sunderraman, and Shihao Ji, \"MatchXML: An Efficient Text-label Matching Framework for Extreme Multi-label Text Classification,\" IEEE Transactions on Knowledge and Data Engineering (TKDE, IF: 8.9), Mar. 2024. [IEEE | arXiv | code] Qing Su, Anton Netchaev, Hai Li, and Shihao Ji, \"FLSL: Feature-level Self-supervised Learning,\" The 37th Conference on Neural Information Processing Systems (NeurIPS, IF: 42.3), New Orleans, Louisiana, USA, Dec. 2023. [neurips | arXiv | code] Xiulong Yang, Qing Su, Shihao Ji, \"Towards Bridging the Performance Gaps of Joint Energy-based Models,\" IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR, IF: 63.1), Vancouver, Canada, June 2023. [paper | code] Yang Li, Xin Ma, Raj Sunderraman, Shihao Ji, Suprateek Kundu, \"Accounting for Temporal Variability in Functional Magnetic Resonance Imaging Improves Prediction of Intelligence,\" Human Brain Mapping (IF: 4.55), July 2023. [paper] Xiulong Yang, and Shihao Ji, \"M-EBM: Towards Understanding the Manifolds of Energy-Based Models,\" The 27th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), Osaka, Japan, May 2023. [paper] Yang Ye, Xiulong Yang, and Shihao Ji, \"APSNet: Attention Based Point Cloud Sampling,\" The 33rd British Machine Vision Conference (BMVC, IF: 5.94), London, UK, Nov. 2022. [paper | code] (Spotlight) Mingchen Li, Shihao Ji, \"Semantic Structure based Query Graph Prediction for Question Answering over Knowledge Graph,\" International Conference on Computational Linguistics (COLING, h5-index: 58), Gyeongju, Republic of Korea, Oct. 2022. [paper | code] Qing Su, Shihao Ji, \"Chitransformer: Towards Reliable Stereo From Cues,\" IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR, IF: 63.1), New Orleans, Louisiana, USA, June 2022. [paper | code] S. Lee, B. Keith, Y. Bey, Y. Wang, X. Yang, X. Li, and Shihao Ji, \"A Convenient Rhetoric or Substantial Change of Teacher Racial Diversity? A Text Mining Analysis of Federal, State, and District Documents,\" Education Policy Analysis Archives (EPAA), Vol. 30, No. 93, June 2022. [paper] Xiulong Yang, Shihao Ji, \"JEM++: Improved Techniques for Training JEM,\" IEEE/CVF International Conference on Computer Vision (ICCV, IF: 40.6), Montreal, Canada, Oct. 2021. [paper | code] Hui Ye, Xiulong Yang, Martin Takac, Raj Sunderraman, and Shihao Ji, \"Improving Text-to-Image Synthesis Using Contrastive Learning,\" The 32nd British Machine Vision Conference (BMVC, IF: 5.94), Virtual, Nov. 2021. [arXiv | code] Xiang Li, Shihao Ji, \"Generative Dynamic Patch Attack,\" The 32nd British Machine Vision Conference (BMVC, IF: 5.94), Virtual, Nov. 2021. [arXiv | code] Yang Li, Shihao Ji, \"Dep-L0: Improving L0-based Network Sparsification via Dependency Modeling,\" The European Conference on Machine Learning (ECML, IF: 4.95), Virtual, Sept. 2021. [arXiv | code] Xiulong Yang, Hui Ye, Yang Ye, Xiang Li, and Shihao Ji, \"Generative Max-Mahalanobis Classifiers for Image Classification, Generation and More,\" The European Conference on Machine Learning (ECML, IF: 4.95), Virtual, Sept. 2021. [arXiv | code] Yang Ye, Shihao Ji, \"Sparse Graph Attention Networks,\" IEEE Transactions on Knowledge and Data Engineering (TKDE, IF: 8.9), Apr. 2021. [IEEE | arXiv | code] Yang Li, Shihao Ji, \"Neural Plasticity Networks,\" International Joint Conference on Neural Networks (IJCNN, IF: 7.09), Virtual, July 2021. [IEEE | arXiv | demo] K. Sarker, X. Yang, Y. Li, S. Belkasim, and Shihao Ji, \"A Unified Density-Driven Framework for Effective Data Denoising and Robust Abstention,\" IEEE International Conference on Image Processing (ICIP, IF: 7.59), Alaska, USA, Sept. 2021. [arXiv] J. Chen, Xiang Li, V. D. Calhoun, J. A. Turner, T. G. M. van Erp, L. Wang, O. A. Andreassen, I. Agartz, L. T. Westlye, E. Jonsson, J. M. Ford, D. H. Mathalon, F. Macciardi, D. S. O'Leary, J. Liu, Shihao Ji, \"Sparse Deep Neural Networks on Imaging Genetics for Schizophrenia Case-Control Classification,\" Human Brain Mapping (IF: 4.55), March 2021. [paper] Xiulong Yang, Shihao Ji, \"Learning with Multiplicative Perturbations,\" 25th International Conference on Pattern Recognition (ICPR, IF: 4.29), Milan, Italy, Jan. 2021. [IEEE | arXiv | code] K. Sarker, S. Pandit, A. Sarker, S. Belkasim, and Shihao Ji, \"Reducing Risk and Uncertainty of Deep Neural Networks on Diagnosing COVID-19 Infection,\" AAAI 2021 Workshop on Trustworthy AI for Healthcare, Virtual, Feb. 2021. [arXiv] K. Sarker, S. Pandit, A. Sarker, S. Belkasim, and Shihao Ji, \"Towards Reliable and Trustworthy Computer-Aided Diagnosis Predictions: Diagnosing COVID-19 from X-Ray Images,\" ACM-CHIL Workshop. [arXiv] Xiang Li, Shihao Ji, \"Neural Image Compression and Explanation,\" IEEE Access (IF: 3.75), Vol. 8, Nov. 30, 2020. [IEEE | arXiv | code] Kaiyang Li, Guangchun Luo, Yang Ye, Wei Li, Shihao Ji, and Zhipeng Cai, \"Adversarial Privacy Preserving Graph Embedding against Inference Attack,\" IEEE Internet of Things Journal (IF: 9.94), Volume 8, Issue 8, Pages 6904-6915, Apr. 2021. [IEEE | arXiv | code] J. Chen, Xiang Li, V. Calhoun, J. Turner, T.G.M. Erp, L. Wang, O. Andreassen, I. Agartz, L. Westlye, J. Liu, and Shihao Ji, \"Sparse Deep Neural Networks on Imaging Genetics for Schizophrenia Discrimination,\" The Organization for Human Brain Mapping (OHBM), Montreal, June 2020. Yang Li, Shihao Ji, \"L0-ARM: Network Sparsification via Stochastic Binary Optimization,\" The European Conference on Machine Learning (ECML, IF: 4.95), Würzburg, Germany, Sept. 2019. [Springer | arXiv | demo | code] Xiang Li, Shihao Ji, \"Defense-VAE: A Fast and Accurate Defense against Adversarial Attacks,\" Machine Learning for Cybersecurity (ECML workshop on MLCS), Würzburg, Germany, Sept. 2019. [Springer | arXiv | code] A. Ahmadzadeh, S. Mahajan, D. Kempton, R. Angryk, and Shihao Ji, \"Toward Filament Segmentation Using Deep Neural Networks,\" 2019 IEEE International Conference on Big Data, Los Angeles, USA, Dec. 2019. [IEEE | arXiv] Shihao Ji, Nadathur Satish, Sheng Li, and Pradeep Dubey, \"Parallelizing Word2Vec in Shared and Distributed Memory,\" IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), Volume 30, Issue 9, Pages 2090-2100, Sept. 1 2019. [IEEE | arXiv | code] J. Zhang, P. Raman, Shihao Ji, H. Yu, S.V.N. Vishwanathan, I. S. Dhillon, \"Extreme Stochastic Variational Inference: Distributed Inference for Large Scale Mixture Models,\" The 22nd International Conference on Artificial Intelligence and Statistics (AIStats",
  "content_length": 17538,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:26"
}