{
  "name": "Shijian Lu",
  "homepage": "https://www3.ntu.edu.sg/home/shijian.lu/index.htm",
  "status": "success",
  "content": "LU Shijian Associate Professor (tenured) School of Computer Science and Engineering Nanyang Technological University, Singapore, 628798 Email: Shijian.Lu@ntu.edu.sg Phone: (65) 6790 4928 Office: N4-02C-101 Home Research Publications Teaching Patents Vacancies Prof Lu received his PhD in electrical and computer engineering from the National University of Singapore. His research interests include computer vision and deep learning. He has published more than 100 internationally refereed journal and conference papers and co-authored over 10 patents in these research areas. Before joining in NTU, he took a number of leadership roles in the Institute for Infocomm Research (I2R), under the Agency for Science, Technology, and Research (A*SATR) in Singapore, including Head of Visual Attention Lab, Deputy Head of Satellite Department, Co-Chair of the Image and Pervasive Access Laboratory (a CNRS overseas laboratory hosted by A*STAR in Singapore). Dr Lu is currently an Associate Editor for the journals of Pattern Recognition (PR) and Neurocomputing. He has also served in the program committee of a number of international conferences such as the Senior Program Committee of the International Joint Conferences on Artificial Intelligence (IJCAI) and AAAI Conference on Artificial Intelligence (AAAI) from 2018 to 2021, the General Chair of the IAPR International Workshop on Document Analysis System (DAS) in 2020, etc. Committee Members: o   Senior Program Committee (SPC) of the International Joint Conference on Artificial Intelligence (IJCAI18  IJCAI21) o   Senior Program Committee (SPC) of the AAAI Conference on Artificial Intelligence (AAAI18  AAAI21) o   Area Chair of 15th International Conference on Document Analysis and Recognition (ICDAR-19) o   Area Chair of IEEE Winter Conference on Applications of Computer Vision (WACV-17 and WACV-18) o   Area Chair of 14th IAPR International Conference on Document Analysis and Recognition (ICDAR-17) Awards and Recognitions: o       Top winner of the ICFHR2014 Competition on Word Recognition from Historical Documents o       Top winner of the ICDAR 2013 Robust Reading Competition (1st in the scene text segmentation task) o       Top winner of the ICDAR 2013 Document Image Binarization Contest (DIBCO 2013) o       Top winner of the H-DIBCO 2010  Handwritten Document Image Binarization Competition o       Top winner of the ICDAR 2009 Document Image Binarization Contest (DIBCO 2009)",
  "content_length": 2451,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:25"
}