{
  "name": "Shikui Wei",
  "homepage": "https://faculty.bjtu.edu.cn/8466",
  "status": "success",
  "content": "北京交通大学教师名录 韦世奎 博士 、教授 、博士生导师 基本信息 办公电话：010-51683695 电子邮件： shkwei@bjtu.edu.cn 通讯地址：北京交通大学 计算机科学与技术学院 信息科学研究所 邮编：100044 教育背景 韦世奎，国家高层次人才项目获得者，北京交通大学教授、博士生导师，计算机科学与技术学院党委副书记、副院长，“跨模态智能与视觉解析”教育部创新团队带头人，隶属信息科学研究所数字媒体信息处理研究中心（Mepro）。2010年获北京交通大学工学博士学位。2008至2010年公派到新加坡南洋理工大学联合博士培养。2010至2011年在南洋理工大学担任博士后研究员。2012年进入微软亚洲研究院访问半年。2015年进入中国移动研究院，担任副主任研究员。长期从事跨模态智能融合、机器学习等理论与技术研究，在T-PAMI、CVPR、AAAI等顶级期刊和会议上发表论文100余篇，相关科研成果应用于轨道交通和其它国家重点领域，2011年入选“CCF 优秀博士论文奖”，先后获得世界互联网大会领先科技奖、教育部自然科学一等奖、教育部技术发明二等奖以及中国图象图形学学会科技进步二等奖。 实验室主页：http://mic.bjtu.edu.cn/ 团队主页：http://mepro.bjtu.edu.cn/ 招生计划 欢迎报考北京交通大学MIC实验室博士、硕士研究生 MIC实验室依托国家级重点学科、北京市重点实验室、科技部重点领域创新团队、教育部创新团队、教育部创新团队，主要在跨模态智能融合、计算机视觉、机器学习等方面从事理论和应用研究。本研究组是高层次人才的培养基地，在学术界和产业界具有较高的知名度，毕业学生大多就职于高校、知名互联网公司、大型国企等。欢迎更多志同道合之士加入我们团队。 【博士招生】 1. 博士招生名额及学科方向 (1). 招生名额：1~2名学术型博士生、1名专业型博士生 (2). 招生专业：见下面招生专业栏 注：信息与通信工程对应的原二级学科为信号与信息处理、控制科学与工程对应的原二级学科为模式识别与智能系统。信息与通信工程为国家级重点学科，北京交通大学双一流学科群重点建设学科。 2. 招生流程 博士招生包含三种方式，即直博(面向应届推免生)、硕博连读(面向本校在读硕士生)和申请考核(面向硕士毕业生)，下面流程针对的是直博和申请考核。 (1). 尽快与我们建立联系。可将简历和自身详细情况通过邮件形式发给韦世奎教授(shkwei@bjtu.edu.cn)，实验室将尽快安排面试。 (2). 相互了解和熟悉。建议同学多渠道了解MIC实验室，特别建议同学通过直接渠道了解MIC实验室的研究方向、管理方式、培养模式、科研氛围等情况。MIC实验室会安排一些科研任务对您的科研潜力进行测试。一旦通过测试，我们将给出接收入组的承诺。 【硕士招生】 1. 硕士招生名额及学科方向 (1). 招生名额：3~4名学术型硕士生、1名专业型硕士生 (2). 招生生专业：见下面招生专业栏 2. 招生流程 (1). 尽快与我们建立联系。可将简历和自身详细情况通过邮件形式发给韦世奎教授(shkwei@bjtu.edu.cn)，实验室将尽快安排面试。 (2). 相互了解和熟悉。建议同学多渠道了解MIC实验室，特别建议同学通过直接渠道了解MIC实验室的研究方向、管理方式、培养模式、科研氛围等情况，比如联系在交大学习的学长学姐或直接Email MIC实验室的同学等。 (3). 发放Offer。在进行充分了解和熟悉后，符合进入MIC实验室条件的同学，我们将在名额内做出接收承诺。 工作经历 2021.09-至今，      北京交通大学计算机科学与技术学院，副书记/副院长 2017.01 - 至今，    北京交通大学计算机与信息技术学院，教授 2020.12-2021.09,   北京交通大学计算机与信息技术学院信息科学研究所，党支部书记/副所长 2017.12-2020.12,   北京交通大学计算机与信息技术学院信息科学研究所，副所长 2018.12--2019.12, 美国匹兹堡大学电子与计算机工程学院，访问学者 2011.09--2016.12, 北京交通大学计算机与信息技术学院, 副教授 2015.12--2016.05, 中国移动研究院副主任研究员(挂职锻炼) 2012.08--2013.02, 微软亚洲研究院访问研究员(微软铸星计划) 2010.09--2011.09, 新加坡南洋理工大学计算机工程学院计算机科学与技术专业, 博士后研究员 研究领域及课题 跨模态智能：指代图像分割、跨模态智能搜索、融合多传感器信息的机器人智能决策、无人驾驶中的跨模态协同推断、大规模跨模态预训练等 计算机视觉：遥感图像处理、目标检测/跟踪/识别、图像分割、视频浓缩、图像/视频伪造、无人驾驶中的视觉任务（3D环视拼接，畸变矫正、车道线检测、行人检测、车辆检测、车位检测等） 机器学习：深度神经网络、弱监督学习、小样本学习、深度神经网络轻量化、深度神经网络攻击与防御等 研究方向 数字媒体信息处理与智能分析 新一代电子信息技术 软件工程 人工智能 大数据技术与工程 低空航行安全保障 智能感知与具身智能 计算机技术 招生专业 新一代电子信息技术（含量子技术等）硕士 软件工程硕士 人工智能硕士 大数据技术与工程硕士 新一代电子信息技术（含量子技术等）博士 人工智能博士 计算机科学与技术硕士 计算机技术硕士 计算机技术博士 低空技术与工程硕士 计算机科学与技术博士 软件工程博士 科研项目 国家级科研项目 跨模态融合感知，2025-2030，项目主持人； 国家级科研项目 无人机跨模态协同检测，2023-2025，项目主持人； 国家级科研项目 多源信息协同方法研究，2023-2024，项目主持人； 企业委托项目 面向工业视觉的异物检测研究，2023-2024，项目主持人； 教育部联合基金创新团队项目 跨模态智能与视觉解析， 2021-2024  团队带头人 项目主持人； 企业委托项目 智能驾驶场景下的自动标注关键技术研发，2019-2023； 国家自然科学基金“面上”项目 复杂场景下视觉智能探测及解析关键技术研究 2019-2023 项目主持人； 国家重点研发计划-课题  2019-2021  项目主持人； 国家级科研项目  二期 2018-2019  项目主持人； 中国移动通信有限公司研究院  面向眼科领域应用的医疗大数据平台及新业务研发(二期)  2017-2020  项目主持人； 企业委托项目 复杂环境下高效能弱小目标跟踪系统研发 2017.01 - 2017.12 项目主持人 国家级科研项目 基于深度学习的信号特征提取技术研究 2017.01 - 2017.12 项目主持人 中国移动通信有限公司研究院 面向眼科领域应用的医疗大数据平台及新业务研发(一期)   2017.01 - 2017.12 项目主持人 教育部-中国移动联合基金 多媒体数字取证技术与语义实时处理技术在新型不良信息治理中的应用 2017.01 - 2018.12 项目主持人 国家自然科学基金“面上” 跨媒体协同计算及近邻可逆性问题研究 2016.01 - 2019.12 项目主持人 企业委托项目 汽车全自动泊车系统 2016.07 - 2017.12 项目主持人 企业委托项目   汽车高级驾驶辅助系统（ADAS） 2016.07 - 2017.06 项目主持人 教育部“创新团队” “数字媒体信息处理”教育部创新团队 2013.01 - 2015.12 项目骨干 国家自然科学基金“青年” 社交网络中数字媒体的扩散跟踪及关联建模 2013.01 - 2015.12 项目主持人 教学工作 本科教学： （1）机器人学导论 （2）无线网络与通信技术 （3）数字图像处理 研究生教学： （1）学术写作能力 （2）机器智能前沿理论与技术 （3）智能机器人系统 论文/期刊 部分期刊论文： Yuan Wang, Yakun Chang, Ying Qin, Yao Zhao, Shikui Wei, Unbiased Sample Selection and Label Improvement for Mitigating Noisy Labels in Class-imbalanced Datasets, IEEE Transactions on Circuits and Systems for Video Technology, 2024. Huaxin Pang, Shikui Wei, Zhuoran Du, Yufeng Zhao, Shengxing Cai, Yao Zhao, Graph Representation Learning Based on Specific Subgraphs for Biomedical Interaction Prediction, IEEE/ACM Transactions on Computational Biology and Bioinformatics, 2024. Sen Xu, Shikui Wei, Tao Ruan, Lixin Liao, Yao Zhao, Each Perform Its Functions: Task Decomposition and Feature Assignment for Audio-Visual Segmentation, IEEE Transactions on Multimedia, 2024. Ting Liu, Hongkun Zhu, Yunchao Wei, Shikui Wei, Yao Zhao, Yanning Zhang, Towards Accurate Human Parsing through Edge Guided Diffusion, IEEE Transactions on Image Processing, 2024. Huaxin Pang, Shikui Wei, Youru Li, Ting Liu, Huaqi Zhang, Ying Qin, Yao Zhao, Asymptotic Consistent Graph Structure Learning for Multivariate Time Series Anomaly Detection, IEEE Transactions on Instrumentation and Measurement, 2024. Gangjian Zhang, Shikun Li, Shikui Wei, Shiming Ge, Na Cai, Yao Zhao, Multimodal composition example mining for composed query image retrieval, IEEE Transactions on Image Processing, 2024.、 Jie Zhao, Shikui Wei, Yakun Chang, Tao Ruan, Yao Zhao, Model-Free Rectification via Cascaded Distortion Model and Enhanced Backward Flow Network, IEEE Transactions on Circuits and Systems for Video Technology, 2024. Shiyin Zhang，Shikui Wei，Jun Hao Liew，Kunyang Han，Yao Zhao，Yunchao Wei，Interactive Object Segmentation With Inside-Outside Guidance，IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 45, no. 7, pp. 8594-8605, 1 July 2023. Sen Xu, Shikui Wei, Tao Ruan, Yao Zhao, ESNet: An Efficient Framework for Superpixel Segmentation, IEEE Transactions on Circuits and Systems for Video Technology, 2024. Zhuoran Du, Shikui Wei, Ting Liu, Shunli Zhang, Xiaotong Chen, Shiyin Zhang, Yao Zhao，Exploring the applicability of spectral recovery in semantic segmentation of RGB images，IEEE Transactions on Multimedia，2023. Gangjian Zhang，Shikui Wei，Huaxin Pang，Shuang Qiu，Yao Zhao，Enhance Composed Image Retrieval via Multi-level Collaborative Localization and Semantic Activeness Perception，IEEE Transactions on Multimedia，Early Access，2023. Chuangchuang Tan, Yao Zhao, Shikui Wei, Guanghua Gu, Yunchao Wei，Learning on Gradients: Generalized Artifacts Representation for GAN-Generated Images Detection，IEEE/CVF Conference on Computer Vision and Pattern Recognition，2023. Huaxin Pang, Shikui Wei, Gangjian Zhang, Shiyin Zhang, Shuang Qiu, Yao Zhao，Heterogeneous Feature Alignment and Fusion in Cross-Modal Augmented Space for Composed Image Retrieval，IEEE Transactions on Multimedia, vol. 25, pp. 6446-6457, 2023. Chuangchuang Tan, Guanghua Gu, Tao Ruan, Shikui Wei, Yao Zhao，Dual-gradients localization framework with skip-layer connections for weakly supervised object localization，IEEE Transactions on Multimedia, vol. 25, pp. 4933-4942, 2023. Gangjian Zhang, Shikui Wei, Huaxin Pang, Shuang Qiu, Yao Zhao，Composed Image Retrieval via Explicit Erasure and Replenishment With Semantic Alignment，IEEE Transactions on Image Processing, vol. 31, pp. 5976-5988, 2022. Peng Sun, Ting Liu, Xiaotong Chen, Shiyin Zhang, Yao Zhao, Shikui Wei，Multi-source aggregation transformer for concealed object detection in millimeter-wave images，IEEE Transactions on Circuits and Systems for Video Technology, vol. 32, no. 9, pp. 6148-6159, Sept. 2022. Ting Liu, Jianfeng Zhang, Xuecheng Nie, Yunchao Wei, Shikui Wei, Yao Zhao, and Jiashi Feng, Spatial-aware Texture Transformer for High-fidelity Garment Transfer. IEEE Transactions on Image Processing, vol.30, pp.7499-7510, 2021. Lixin Liao, Yao Zhao, Shikui Wei, Yunchao Wei, Jingdong Wang, Parameter Distribution Balanced CNNs, IEEE Transactions on Neural Networks and Learning Systems, 2020. Xin Fu， Yao Zhao,  Yunchao Wei,Yufeng Zhao, Rich Features Embedding for Cross-modal Retrieval: A Simple Baseline，IEEE Transactions on Multimedia. 2020. Shikui Wei , Lixin Liao, Jia Li , Qinjie Zheng, Fei Yang, and Yao Zhao , Saliency Inside: Learning Attentive CNNs for Content-based Image Retrieval, IEEE Transactions on Image Processing, vol. 28, no. 9, pp. 4580-4593, 2019. Tao Ruan, Shikui Wei, Jia Li and Yao Zhao, Rearranging Online Tubes for Streaming Video Synopsis: A Dynamic Graph Coloring Approach, IEEE Transactions on Image Processing, vol. 28, no. 8, pp. 3873-3884, 2019. Ting Liu, Yunchao Wei, Yao Zhao, Si Liu, Shikui Wei, Magic-wall: Visualizing Room Decoration by Enhanced Wall Segmentation, IEEE Transactions on Image Processing, vol. 28, no. 9, pp. 4219-4232, 2019. Shuang Qiu, Yao Zhao, J Jiao, Yunchao Wei, Shikui Wei, Referring Image Segmentation by Generative Adversarial Learning, IEEE Transactions on Multimedia, 2019. Ruoyu Liu, Yao Zhao, Shikui Wei, Liang Zheng,  Yi Yang, Modality-Invariant Image-Text Embedding for Image-Sentence Matching. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), 15(1), 27. Ting, Liu, Yao Zhao, Yunchao Wei, Yufeng Zhao,Shikui Wei, Concealed object detection for activate millimeter wave image, IEEE Transactions on Industrial Electronics, Vol. 66, No. 12, pp.9909-9917, 2019. 部分会议论文： Zhuoran Du, Shaodi You, Cheng Cheng, Shikui Wei. Automatic Spectral Calibration of Hyperspectral Images: Method, Dataset and Benchmark, IEEE/CVF conference on computer vision and pattern recognition, 2025. Haoyu Chu, Shikui Wei, Ting Liu, Yao Zhao, Yuto Miyatake, Lyapunov-stable deep equilibrium models, Proceedings of the AAAI Conference on Artificial Intelligence, 2024. Chuangchuang Tan, Yao Zhao, Shikui Wei, Guanghua Gu, Ping Liu, Yunchao Wei, Frequency-aware deepfake detection: Improving generalizability through frequency space domain learning, Proceedings of the AAAI Conference on Artificial Intelligence, 2024. Sen Xu, Shikui Wei, Tao Ruan, Lixin Liao, Learning invariant inter-pixel correlations for superpixel generation, Proceedings of the AAAI Conference on Artificial Intelligence, 2024. Chuangchuang Tan, Yao Zhao, Shikui Wei, Guanghua Gu, Yunchao Wei, Learning on gradients: Generalized artifacts representation for gan-generated images detection, Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2023. Qifei Jia, Shikui Wei, Tao Ruan, Yufeng Zhao, Yao Zhao, GradingNet: Towards providing reliable supervisions for weakly supervised object detection by grading the box candidates, Proceedings of the AAAI Conference on Artificial Intelligence, 2021. Chuangchuang Tan, Guanghua Gu, Tao Ruan, Shikui Wei, Yao Zhao, Dual-gradients localization ",
  "content_length": 13515,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:24"
}