{
  "name": "Shimeng Yu",
  "homepage": "https://shimeng.ece.gatech.edu/professor",
  "status": "success",
  "content": "Professor – Laboratory for Emerging Devices and Circuits Skip to main navigation Skip to content Now in main content Shimeng Yu Dean’s Professor, IEEE Fellow School of Electrical and Computer Engineering Georgia Institute of Technology Address: 791 Atlantic Dr NW, Atlanta, GA 30332 Office: Pettit (MiRC) 116 Phone: 404-894-2571 LinkedIn    Email Education Ph.D., electrical engineering, Stanford University, 2013 M.S., electrical engineering, Stanford University, 2011 B.S., microelectronics, Peking University, 2009 Research Interests Advanced Logic and Non-volatile Memories VLSI Design and Chip Tape-out System/Design-Technology Co-optimization Monolithic and Heterogeneous 3D Integration AI Hardware and Neuro-inspired Computing Biosketch Shimeng Yu is a full professor of electrical and computer engineering at Georgia Institute of Technology, where he holds the Dean’s Professorship. He received the B.S. degree in microelectronics from Peking University in 2009, and the M.S. degree and Ph.D. degree in electrical engineering from Stanford University in 2011 and 2013, respectively. From 2013 to 2018, he was an assistant professor at Arizona State University. He is an elevated IEEE Fellow for contributions to non-volatile memories and in-memory computing. Prof. Yu’s research interests are semiconductor devices and integrated circuits for energy-efficient computing systems. His expertise is on the memory technologies and 3D integration for AI hardware. Among Prof. Yu’s honors, he was a recipient of National Science Foundation (NSF) CAREER Award in 2016, IEEE Electron Devices Society (EDS) Early Career Award in 2017, ACM Special Interests Group on Design Automation (SIGDA) Outstanding New Faculty Award in 2018, Semiconductor Research Corporation (SRC) Inaugural Young Faculty Award in 2019, IEEE Circuits and Systems Society (CASS) Distinguished Lecturer in 2021, IEEE EDS Distinguished Lecturer in 2022, Intel Outstanding Researcher Award in 2023, and SRC Rama Divakaruni Technical Excellence Award in 2025. Prof. Yu’s 500+ journal/conference publications received more than 36,000 citations (Google Scholar) with H-index 86. He is the theme lead of two SRC/DARPA JUMP 2.0 centers on intelligent memory/storage and heterogeneous/monolithic 3D integration. Prof. Yu has served as technical program committee for the leading conferences in the field, including IEEE International Electron Devices Meeting (IEDM), IEEE Symposium on VLSI Technology and Circuits, IEEE International Reliability Physics Symposium (IRPS), ACM/IEEE Design Automation Conference (DAC), ACM/IEEE Design, Automation & Test in Europe (DATE), ACM/IEEE International Conference on Computer-Aided-Design (ICCAD), etc. He also has served as an associate editor for IEEE Electron Device Letters (EDL), and the associate editor-in-chief for IEEE Journal on Emerging and Selected Topics in Circuits and Systems (JETCAS). Honors and Awards Semiconductor Research Corporation (SRC) Rama Divakaruni Technical Excellence Award 2025 Georgia Tech College of Engineering Outstanding Faculty Achievement in Research (Midcareer) Award 2025 IEEE Fellow for contributions to non-volatile memories and in-memory computing 2024 ACM Transactions on Design Automation of Electronic Systems (TODAES) Best Paper Award 2024 Intel Outstanding Researcher Award 2023 IEEE Transactions on Computer-Aided Design (TCAD) Donald O. Pederson Best Paper Award 2023 Georgia Tech Roger P. Webb ECE Outstanding Mid-Career Faculty Award 2022 IEEE Journal on Emerging and Selected Topics in Circuits and Systems Best Associate Editor 2022 IEEE Electron Devices Society (EDS) Distinguished Lecturer 2022-2023 IEEE Circuits and Systems Society (CASS) Distinguished Lecturer 2021-2022 IEEE Transactions on Nanotechnology (T-NANO) Best Paper Award 2021 ACM/IEEE Design Automation Conference (DAC) Under-40 Innovators Award 2020 Semiconductor Research Corporation (SRC) Young Faculty Award 2019 ACM Special Interest Group on Design Automation (SIGDA) Outstanding New Faculty Award 2018 IEEE Electron Devices Society (EDS) Early Career Award 2017 ASU Fulton Schools of Engineering Outstanding Assistant Professor 2017 IEEE Transactions on VLSI Systems’ Best Reviewers 2017 NSF Faculty Early Career Development (CAREER) Award 2016 DoD- Air Force Research Lab (AFRL) Summer Faculty Fellowship 2016 DoD-Defense Threat Reduction Agency (DTRA) Young Investigator Award 2015 Qualcomm Fellowship for Telluride Neuromorphic Engineering Workshop 2013 IEEE Electron Devices Society (EDS) PhD Student Fellowship 2012 IEEE Electron Devices Society (EDS) Masters Student Fellowship 2010 Stanford Graduate Fellowship (SGF) 2009-2012 Peking University Outstanding Undergraduate Student Award 2009 Recent Posts 13 IEDM papers accepted Prof. Yu received SRC Technical Excellence Award Prospective students and postdoc researchers Prof. Yu is appointed Dean’s Professor Prof. Yu is elevated to IEEE Fellow Back to top",
  "content_length": 4945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:27"
}