{
  "name": "Shimei Pan",
  "homepage": "https://nlp-lab.umbc.edu/home/shimei",
  "status": "success",
  "content": "NLP and Social Computing Lab – UMBC Skip to main content NLP and Social Computing Lab Menu Apply Search Search Context This Site All of UMBC Location 1000 Hilltop Circle, Baltimore, MD 21250 ITE 434 Contact Phone: 410-4556543Contact Us Short Bio: Dr. Shimei Pan is an Associate Professor at the Information Systems Department of UMBC. Before joining UMBC, Dr. Pan was a research scientist at IBM Watson Research Center in New York. Her primary research interests are  Natural Language Processing (NLP), Large-Scale Social Media Analytics and their applications in Human Behavior Modeling. She is also interested in fair AI/ML and Human-AI Interaction. Dr. Pan has authored 100+ peer-reviewed papers in major international conferences and journals. She has also served on the program committees for major international conferences (e.g.,  ACL, EMNLP, NAACL, IJCAI, IUI, CIKM and RecSys). She was the program co-chair of 2015 ACM International Conference on Intelligent User Interfaces (IUI), the conference co-chair of IUI 2019 and the program chair of IEEE ICTAI 2020.  Currently, she is an associate editor of ACM Transactions on Interactive Intelligent Systems (TIIS) and a member of the steering committee of IUI. Dr. Shimei Pan received a Ph.D. in Computer Science from Columbia University. News: Won a Fulbright Award to conduct research in Germany on Cross-cultural Analysis of Social Biases with Large Pre-trained Language Models (2022-2023). Travel to Germany to attend the Dagstuhl Seminar on “Visual Text Analytics” (May, 2022). Won an ATIP award to conduct research on “An AI-based Method to Assess and Monitor the Cognitive Functions in Persons with Dementia”. Our paper on “Do Humans Prefer Debiased AI Algorithms? A Case Study in Career Recommendation” has been accepted by ACM IUI 2022. Congratulations to the authors! The IEEE Data Engineering Bulletin (DEB) 2021 Special Issue on Responsible AI and Human-AI Interaction, co-edited by myself and James Foulds, is online. Our paper on “Incorporating medical knowledge in BERT for clinical relation extraction” has been accepted by EMNLP 2021. Congratulations to Arpita! Our paper on “Fair Representation Learning for Heterogeneous Information Networks” was accepted by ICWSM 2021. Co-editor of an IEEE Data Engineering Bulletin 2020 special issue on “Interdisciplinary Perspectives on Fairness and Artificial Intelligence Systems” (with James Foulds) (Dec. 2020). Received an NSF grant to study COVID-19-related discrimination against Chinese Americans (with Charissa Cheah and Cixin Wang), 2020. Our paper on “Incorporating Extra Knowledge to Enhance Word Embedding” was accepted by IJCAI 2020. Chairing the technical program committee of IEEE ICTAI 2020. Received an NSF grant to study Fairness for the Allocation of Healthcare Resources (with James Foulds), 2019. Co-chaired the NSF workshop on “Including Ethics in Data Science Pedagogy”, 2019, Alexandria, VA. Co-chaired the ACM International Conference on Intelligent User Interfaces (IUI), 2019 at Los Angeles, CA. Co-editor of the ACM TIIS journal special issue on “Data-driven Personality Modeling for Intelligent User Interfaces” (with Oliver Brdiczka, Andrea Kleinsmith and Yangqiu Song) (2019). Our paper “Social Media-based User Embedding: A Literature Review” has been accepted  by IJCAI (2019). Our paper “Predicting Malware Attributes from Cybersecurity Texts” was accepted by NAACL-HLT (2019). Received a NIST grant to study “Differential Fairness for Artificial Intelligence and Machine Learning Systems: Unbiased Decisions with Biased Data” (with James Foulds) Gave an invited talk at the 14th International Conference on Emerging Technologies for a Smarter World at Stony Brook University (Oct. 2018). Invited to a working group meeting at the National Institute on Alcohol Abuse and Alcoholism (NIAAA) of NIH to discuss High Intensity Drinking (Oct. 2018). Organized a workshop on “AI and Computational Psychology” at a joint workshop session of IJCAI/ICML/AAMAS 2018  in Stockholm in July 2018. Our paper on “Automated Detection of Substance Use-Related Social Media Posts Based on Image and Text Analysis” won a best student paper award at IEEE ICTAI 2017. Our paper on “Multi-View Unsupervised User Feature Embedding for Social Media-based Substance Use Prediction” was accepted by EMNLP 2017 (Aug. 2017). Our paper on “Analyzing and Preventing Bias in Text-based Personal Trait Prediction Algorithms” won the IEEE ICTAI 2016 C.V. Ramamoorthy Best Paper Award (Nov. 2016). Gave a talk at National Institute on Drug Abuse (NIDA) on “Social Media-based User Behavior and Trait Analysis for Drug Abuse Research” (September. 2016) Our paper on “Personalized Emphasis Framing for Persuasive Message Generation” was accepted by EMNLP 2016 (August, 2016) Gave a talk at Bloomberg LP Data Science Seminar (July 2016) Gave a talk at the CS department of Columbia University (July 2016) My student Yi Yang presented our paper at the IJCAI Sister Conference Best Paper Track (July 2016) Presented an invited paper at AAAI 2016 on “What’s Hot in Intelligent User Interfaces” (Feb 2016). Our paper on “Using Personal Traits for Brand Preference Prediction” was accepted by EMNLP 2015 (August 2015) Our paper on “An Uncertainty-Aware Approach for Exploratory Microblog Retrieval” was accepted by IEEE VAST 2015 (TVCG track) (July 2015) Our paper on “Expertise Signals for Public and Enterprise Social Q&A” was accepted by ICWSM 2015 (March 2015) Our paper on “User-Directed Non-Disruptive Topic Model Update for Effective Exploration of Dynamic Content” won “best paper honorable mention” at IUI 2015! (March 2015) Gave a keynote at the 4th Interactive Visual Text Analytics workshop in Atlanta (March 2015). Our paper “User-Directed Non-Disruptive Topic Model Update for Effective Exploration of Dynamic Content” was accepted by IUI’2015. Phd student Tao Ding received UMBC GSA student research grant. Congratulations! (Nov. 2014) Gave a keynote speech at the ACM CIKM’14 workshop on Interactive Mining of Big Data. (Nov. 2014) Location 1000 Hilltop Circle, Baltimore, MD 21250 ITE 434 Contact Phone: 410-4556543Contact Us © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 6490,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:26"
}