{
  "name": "Shimon Whiteson",
  "homepage": "http://www.cs.ox.ac.uk/people/shimon.whiteson",
  "status": "success",
  "content": "Shimon Whiteson | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyShimon WhitesonShimon Whiteson Professor Shimon Whiteson Professor of Computer ScienceE: shimon.whiteson@cs.ox.ac.ukT: +44 (0) 7443 287 697Themes:Artificial Intelligence and Machine LearningSee Also:Whiteson Research LabGoogle Scholar ProfileCurriculum VitaeOxford Machine Learning Reading GroupInterestsFor more information, visit the Whiteson Research Lab.Selected PublicationsView AllManage publications Deterministic and Discriminative Imitation (D2−Imitation): Revisiting Adversarial Imitation for Sample Efficiency Mingfei Sun‚ Sam Devlin‚ Katja Hofmann and Shimon Whiteson In AAAI 2022: Proceedings of the Thirty−Sixth AAAI Conference on Artificial Intelligence. February, 2022. Details about Deterministic and Discriminative Imitation (D2−Imitation): Revisiting Adversarial Imitation for Sample Efficiency | BibTeX data for Deterministic and Discriminative Imitation (D2−Imitation): Revisiting Adversarial Imitation for Sample Efficiency | Link to Deterministic and Discriminative Imitation (D2−Imitation): Revisiting Adversarial Imitation for Sample Efficiency Truncated Emphatic Temporal Difference Methods for Prediction and Control Shangtong Zhang and Shimon Whiteson In Journal of Machine Learning Research. Vol. 23. No. 153. Pages 1–59. 2022. Details about Truncated Emphatic Temporal Difference Methods for Prediction and Control | BibTeX data for Truncated Emphatic Temporal Difference Methods for Prediction and Control | Link to Truncated Emphatic Temporal Difference Methods for Prediction and Control Bayesian Bellman Operators Matthew Fellows‚ Kristian Hartikainen and Shimon Whiteson In NeurIPS 2021: Proceedings of the Thirty−fifth Annual Conference on Neural Information Processing Systems. December, 2021. Details about Bayesian Bellman Operators | BibTeX data for Bayesian Bellman Operators | Link to Bayesian Bellman Operators ActivitiesDeep Reinforcement Learning Current Students Zilin WangZheng  XiongAlexey Zakharov Past Students Yannis AssaelJacob BeckBenjamin  EllisGregory FarquharMatthew FellowsJakob FoersterTarun GuptaKristian HartikainenMaximilian IglVitaly KurinJelena LuketinaAnuj MahajanSupratik PaulTabish RashidMatthew SmithRisto VuorioShangtong ZhangLuisa Zintgraf Past Researchers Wendelin BoehmerKamil CiosekBei PengTim RocktäschelResearcherAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2652,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:26"
}