{
  "name": "Shin-ichi Minato",
  "homepage": "http://www.lab2.kuis.kyoto-u.ac.jp/minato/index-e.html",
  "status": "success",
  "content": "Shin-ichi Minato's Home Page Shin-ichi Minato (to Japanese page) Shin-ichi Minato is a Professor at Dept. of Communications and Computers Engineering, Graduate School of Informatics, Kyoto University (concurrently in Undergraduate School of Informatics and Mathematical Science, Faculty of Engineering). His research interests include efficient representations and manipulation algorithms for large-scale discrete structure data. He received the B.E., M.E., and D.E. degrees in Information Science from Kyoto University in 1988, 1990, and 1995, respectively. He had been working at NTT Laboratories since 1990 until March 2004. He was a Visiting Scholar at Computer Science Department of Stanford University in 1997. He was a Senior Researcher of NTT Network Innovation Laboratories in 1999. From 1999 to 2000, he concurrently served a Visiting Lecturer at Shonan-Fujisawa Campus of Keio University. On 2004, he joined Hokkaido University as an Associate Professor at Algorithm Laboratory in Graduate School of Information Science and Technology, and has been a Professor since Oct. 2010. From 2015 to 2018 he leads Large-Scale Knowledge Processing Laboratory. From Apr. 2018, he is a Professor at Kyoto University (present position). From 2011, he is also an Adjunct Researcher at Research Institute for Advanced Network Technology of Waseda University. From 2014, he also serves a Visiting Professor at National Institute of Informatics. From 2015, he is also a Professor at  Research Center of Mathematics for Social Creativity Research Institute for Electronic Science (MSC), Hokkaido University (Visiting Professor from 2018). From Oct. 2017, He is a member of Science Council of Japan (SCJ). From June 2018 to May 2020, he served a member of director board of IPSJ. From June 2020, he serves Editor in Chief of the Journal of Information Processing (JIP). He published \"Binary Decision Diagrams and Applications for VLSI CAD\" (Kluwer,1995). His original data structure \"ZDD\" is minutely discussed using many pages in the Knuth's book \"The Art of Computer Programming\" (Vol. 4, Fascicle 1, 2009). He supervised an exhibition \"The Art of 10^64 -Understanding Vastness-\" at \"Miraikan\" (National Future Science Museum of Japan) from Aug. 2012 to Apr. 2013. He served Workshop Chair of ALSIP-2008 and Co-organizer of ALSIP-2011, 2012, and 2014 . From Oct. 2009 to Mar. 2016, he served a Research Director of ERATO (Exploratory Research for Advanced Technology) MINATO Discrete Structure Manipulation System Project, executed by JST (Japan Science and Technology Agency). From 2020 to now, he serves a project leader of JSPS KAKENHI AFSA (Algorithmic Foundations for Social Advancement) Project. He is a senior member of IEEE, IEICE, and IPSJ, and a member of JSAI and JSCS. Minato Laboratory (Laboratory for Computer Algorithms) JSPS KAKENHI Project: \"AFSA\" (Algorithmic Foundations for Social Advancement) Publication list Open Software: Graphillion, PowerSetScan, SAPPOROBDD Minato supervised this animation video of Miraikan, having over 2.9 million views! (English captioned) This animation video shows the numbers of all simple paths in the grid graphs up to 16x16. (in Japanese) Shin-ichi Minato, Dr. Eng. Professor. Graduate School of Informatics, Kyoto University. Yoshida-Honmachi, Sakyo-ku, Kyoto 606-8501 Japan. E-mail: minato(at)i.kyoto-u.ac.jp, minato(at)ieee.org URL: http://www.lab2.kuis.kyoto-u.ac.jp/minato/ Last update: July 29, 2023.",
  "content_length": 3453,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:28"
}