{
  "name": "Shinji Kusumoto",
  "homepage": "https://sdl.ist.osaka-u.ac.jp/~kusumoto/index-e.htm",
  "status": "success",
  "content": "êåªì Department of Computer Science Graduate School of Information Science and Technology Software Design Laboratory Osaka University Shinji Kusumoto Dr. Eng. Professor Email: kusumotoist.osaka-u.ac.jpTel: +81-6-6879-4110 Fax: +81-6-6879-4114 Office: B324 Japanese Research Area: @@@Software Engineering Research Interests: Software process improvement Software quality assurance Software metrics Empirical Software Engineering Biography Selected Publications: Keisuke Hotta, Yukiko Sano, Yoshiki Higo, and Shinji Kusumoto, \"Is Duplicate Code More Frequently Modified than Non-duplicate Code in Software Evolution?: An Emprical Study on Open Source Software,\" In Proc. of the 4th International Joint ERCIM/IWPSE Symposium on Software Evolution, September 2010. Yoshiki Higo, Shinji Kusumoto, and Katsuro Inoue, \"A Metric-Based Approach to Identifying Refactoring Opportunities for Merging Code Clones in a Java Software System,\" Journal of Software Maintenance and Evolution: Research and Practice, vol. 20, no. 6, pages 435-461, November 2008. Shinji Kusumoto, Takuto Edagawa, and Yoshiki Higo, \"On an Automatic Function Point Measurement from Source Codes,\" In 2nd Workshop on Accountability and Traceability in Global Software Engineering (ATGSE2008), pages 27-28, December 2008. Yoshiki Higo, Yasushi Ueda, Shinji Kusumoto, and Katsuro Inoue, \"Simultaneous Modification Support Based on Code Clone Analysis,\" In Proc. of the 14th Asia-Pacific Software Engineering Conference (APSEC2007), pages 262-269, December 2007. Katsuro Inoue, Reishi Yokomori, Tetsuo Yamamoto, Makoto Matsushita, Shinji Kusumoto: \"Ranking significance of software components based on use relations'', IEEE Transactions on Software Engineering, Vol.31, No.3, pp.213-225(2005) Giedre Sabaliauskaite, Shinji Kusumoto, Katsuro Inoue: \"Assessing Defect Detection Performance of Interacting Teams in Object-Oriented Design Inspection'', Information and Software Technology, Vol. 46, 13, pp. 875-886(2004). Giedre Sabaliauskaite, Shinji Kusumoto, Katsuro Inoue: \"Assessing Defect Detection Performance of Interacting Teams in Object-Oriented Design Inspection'', Information and Software Technology, Vol. 46, 13, pp. 875-886(2004). Shinji Kusumoto, Fumikazu Matukawa, Katsuro Inoue, Shigeo Hanabusa, Yuusuke Maegawa: \"Effort estimation tool based on use case points method'', Proceedings of the 10th International Symposium on Software Metrics (Metrics2004), pp. 292-299(Chicago, September 2004). Takashi Ishio, Shinji Kusumoto, Katsuro Inoue: \"Debugging support for aspect-oriented program based on program slicing and call graph'', Proceedings of the 20th IEEE International Conference on Software Maintenance (ICSM2004), pp. 178-187(Chicago, September 2004). Yoshiki Higo, Toshihiro Kamiya, Shinji Kusumoto, Katsuro Inoue and Yoshio Kataoka: \"On refactoring for open source Java program'', Proceedings of the METRICS2003, Vol.2, pp246-256 (Sydney, September 2003). Takashi Ishio, Shinji Kusumoto and Katsuro Inoue: \"Program Slicing Tool for Effective Software Evolution Using Aspect-Oriented Technique\", 2003 International Workshop on Principles of Software Evolution (IWPSE 2003), Accepted (2003). Katsuro Inoue, Reishi Yokomori, Hikaru Fujiwara, Tetsuo Yamamoto, Makoto Matsushita and Shinji Kusumoto: \"Component Rank: Relative Significance Rank for Software Component Search\", Proceedings of the 25th International Conference on Software Engineering (ICSE2003), pp. 14-24(Portland, May, 2003). Hikaru Fujiwara, Shinji Kusumoto, Katsuro Inoue, Ayane Suzuki, Toshifusa Ootsubo and Katsuhiko Yuura: \"Case studies to evaluate a domain specific application framework based on complexity and functionality metrics,'' Information and Software Technology, Vol.45, Issue 1, pp. 43-49 (2003). Toshihiro Kamiya, Shinji Kusumoto and Katsuro Inoue: \"CCFinder: A multi-linguistic token-based code clone detection system for large scale source code'', IEEE Transactions Software Engineering, Vol. 28, No.6, pp. 654-670(2002). Yoshiki Higo, Yasushi Ueda, Toshihiro Kamiya, Shinji Kusumoto and Katsuro Inoue: \"On software maintenance process improvement based on code clone analysis'', 4th International Conference on Product Focused Software Process Improvement (Profes 2002), pp. 185-197 (Rovaniemi, December, 2002). Yasushi Ueda, Toshihiro Kamiya, Shinji Kusumoto and Katsuro Inoue: \"On detection of gapped code clones using gap locations '', 9th Asia-Pacific Software Engineering Conference (APSEC2002), pp. 327-336 (Gold Coast, December, 2002). Giedre Sabaliauskaite, Fumikazu Matsukawa, Shinji Kusumoto, Katsuo Inoue: \"Experimental comparison of Checklist-based reading and Perspective-based reading for UML design document inspection reading'', Proc. of the 1st International Symposium on Empirical Software Engineering, pp. 148-157 (Nara, December, 2002). Yasushi Ueda, Toshihiro Kamiya, Shinji Kusumoto and Katsuro Inoue: \"Gemini: Maintenance support environment based on code clone analysis'', 8th International Symposium on Software Metrics (Metrics2002), pp. 67-76, (Ottawa, June 2002). Shinji Kusumoto, Masahiro Imagawa, Katsuro Inoue, Shuuma Morimoto, Kouji Matsusita and Michio Tsuda: \"Function point measurement from Java programs'', Proc. of the 24th International Conference on Software Engineering, pp. 576-582 (Orland, May 2002). Shinji Kusumoto, Akira Nisimatsu, Keisuke Nishie and Katsuro Inoue: \"Experimental evaluation of program slicing for fault localization'', Empirical Software Engineering, Vol. 7, pp. 49-76(2002). Takuya Uemura, Shinji Kusumoto and Katsuro Inoue: \"Function point analysis for design specifications based on the Unified Modeling Language'', Journal of Software Maintenance and Evolution, Vol. 13, No. 4, pp.223-243 (2001). All publications Teaching: Programming AiFacultyj Software Development iFacultyj Software Design Engineetring iGraduate Schoolj Professional Services: Member: IPSJCIEICECIEEECJFPUG Program committee: OO98, OO99, OO2000, OO2001, APSEC2001, METRICS2002, APSEC2002, APSEC2003, METRICS2003, FSE2004, APSEC2004, METRICS2005, APSEC2005, ISESE2006, ATGSE2007, ESEM2008, ATGSE2008, ESEM2009 Referee of IEICE papers Others @ Back to Kusumoto lab. Jan. 15, 2011 Editor: (kusumotoist.osaka-u.ac.jp) @ @ @ @",
  "content_length": 6249,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:29"
}