{
  "name": "Shin Hwei Tan",
  "homepage": "http://www.shinhwei.com",
  "status": "success",
  "content": "Shin Hwei Tan Shin Hwei Tan 陈馨慧 Biography Research Projects Publications Teaching CV Awards and Recognition Service Shin Hwei Tan Associate Professor (Gina Cody Research Chair) Email: shinhwei.tan At concordia.ca Automated Program RepaIr and MaintEnance Lab (A-PRIME) Department of Computer Science and Software Engineering (CSSE) Concordia University Montreal, Canada Biography On May 2023, I moved to Concordia University as Associate Professor (Gina Cody Research Chair). On June 2018, I joined Southern University of Science and Technology (SUSTech) as Assistant Professor. On March 2018, I obtained my PhD degree from National University of Singapore. During my PhD studies, I was advised by Abhik Roychoudhury.  Previously, I received my BS and MS degrees from Department of Computer Science of University of Illinois at Urbana-Champaign. During my Master studies, I was co-advised by Darko Marinov and Lin Tan. My CV is available for download here. My research interests include: Automated Program Repair Open-source Software Development and Education Software Testing Genetic Improvement Program Analysis Comment Analysis I am always actively seeking new PhD students, Master students, and PostDocs with background in program analysis, software testing, and automated code generation (NLP, genetic algorithm or machine learning experience is a plus). If you are interested, please send me an email. News June 2025: We have started the ACM-W Montreal Professional Chapter where I am the chair! March 2025: I have been selected as the sole recipient for ACM-W Rising Star Award! March 2025: Our paper on \"Tumbling Down the Rabbit Hole: How do Assisting Exploration Strategies Facilitate Grey-box Fuzzing?\" have won the ICSE 25 Distinguished Paper Award! February. 2025: Our paper on \"Understanding and Enhancing Attribute Prioritization in Fixing Web UI Test with LLMs\" have won the ICST 25 IEEE TCSE Distinguished Paper Award! March. 2024: We have won the FSE26 bid! Foutse and I will be co-chairing FSE26 in Concordia University in Montreal! March. 2024: Our paper on \"Investigating and Detecting Silent Bugs in PyTorch Programs\" has won SANER24 Distinguished Paper Award! Jan. 2024: Please submit your new and exciting papers to our new TOSEM special section on New Frontier in Software Engineering where I am the Guest Editor in Chief! Jan. 2024: Our paper on \"Understanding and Detecting Annotation-induced Faults of Static Analyzers\" has been accepted to FSE2024! Dec. 2023: Our paper on \"Combining Structured Static Code Information and Dynamic Symbolic Traces for Software Vulnerability Prediction\" has been accepted to ICSE2024! Dec. 2023: Our paper on \"Investigating and Detecting Silent Bugs in PyTorch Programs\" has been accepted to SANER2024! Nov. 2023: Our paper on \"Statfier: Automated Testing of Static Analyzers via Semantic-preserving Program Transformations\" has been accepted to FSE2023! Nov. 2023: Our first paper on ethics in OSS \"Towards Automated Detection of Unethical Behavior in Open-source Software Projects\" has been accepted to FSE2023! Nov. 2023: Our paper on \"A Generative and Mutational Approach for Synthesizing Bug-exposing Test Cases to Guide Compiler Fuzzing\" has been accepted to FSE2023! Oct. 2023: Our paper on \"Concept-Based Automated Grading of CS-1 Programming Assignments\" has been accepted to ISSTA2023! Feb. 2023: Our paper on \"Recursive State Machine Guided Graph Folding for Context-Free Language Reachability\" has been accepted to PLDI2023! Feb. 2023: Our paper on \"CrossFix: Resolution of GitHub issues via Similar Bugs Recommendation\" has been accepted to Journal of Software: Evolution and Process 2012 (JSME)! Dec. 2022: Our paper on \"Automated Repair of Program from Large Language Models\" has been accepted to ICSE2023! Read our arXiv version! Dec. 2022: My first all-female authors paper on \"Efficient Pattern-based Static Analysis Approach via Regular-Expression Rules\" has been accepted to SANER2023! Dec. 2022: Our paper on \"Event-Aware Precise Dynamic Slicing for Automatic Debugging of Android Applications\" has been accepted to JSS! Dec. 2022: I am co-chairing the 4th International workshop on Automated Program Repair @ICSE 2023. Please submit to APR23! Older news: ... Services General Chair for FSE 2026. Workshop Co-chair for FSE 2025. Guest Editor in Chief for TOSEM special section on New Frontier in Software Engineering Associate Editor for ACM TOSEM. PC for ICSE 2025. PC for ISSTA 2024. PC for FSE 2024. Member of the CCF Open-source Development Committee. PC for ICSE 2024. PC for ISSTA 2023. PC for ESEC/FSE 2023. Co-chair for Ada workshop@FSE2022. PC for ASE 2022. PC for ESEC/FSE 2022. PC for ISSTA 2022. PC for ICSE-NIER 2022. (Won Best Reviewers Award) Co-chair for MOBILESoft-SRC 2022. PC for ICSE-NIER 2022. Co-chair for 3rd International Workshop on Automated Program Repair (APR 2022). Co-chair for 2nd International Workshop on Automated Program Repair (APR 2021). PC for Student Research Competition for ICSE 2021. PC for ASE 2020 (Won Distinguished Reviewers Award). Student Volunteer Co-Chair for ISSTA 2020. PC for FSE 2020 (Won Distinguished Reviewers Award). Organizer and Co-chair for 1st International Workshop on Automated Program Repair (APR 2020). PC for ICSE 2020. PC for ASE 2019. Program Chair for 6th Workshop on Genetic Improvement @ICSE2019. PC for ESEC/FSE 2019 Tool Demos. PC for Student Research Competition at ICSE 2019 PC for Genetic Improvement Workshop Genetic and Evolutionary Computation Conference (GECCO2018) Reviewer for Transactions on Software Engineering (TSE2017) Reviewer for Empirical Software Engineering (EMSE2017) Artifact Evaluation Committee for The ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA2014) Co-reviewer for International Conference on Software Engineering (NIER) Research Projects LMDefectsVisit Website LMDefects is a dataset that contains defects in programs auto-generated by Codex. GitHub-OSS FixitVisit Website GitHub-OSS Fixit is a project where students form teams to fix GitHub issues reported in open-source Java projects. DroixVisit Website Droix is a novel automated repair framework for Android apps. Droix could repair crashes based on one crashing UI input. We also propose Droixbench, a benchmark that contains a set of reproducible crashes in Android apps. CodeflawsVisit Website Codeflaws is a benchmark that allows objective evaluation of program repair tools across defect classes. Anti-patterns in Search-Based Program RepairsVisit Website Instead of using repair patterns obtained from human patches, our set of anti-patterns can be enforced on top of any search-based program repair tools. Enforcing anti-patterns in repair tools produces repairs faster, localizes better, and deletes less. relifix A test-driven automated repair tool that uses a novel set of contextual operators for automated repair of software regressions. Our set of operators uses syntactical information from changed statements. Repair more bugs than existing program repair tool, GenProg and our generated repairs are less less likely to introduce new regressions than GenProg. Software Change ContractVisit Website A language that could be used to specify intended effect of program changes. Change contract focuses only on the program changes and their intended semantic effect. Program behavior that is unchanged across version does not need to be captured. @tCommentVisit Website Novel approach that automatically generates unit tests that check for inconsistencies between Javadoc comments written in natural languages and Java source code. Reported 24 inconsistencies in 6 open-sources Java projects. ReAssertVisit Website A tool that automatically repair broken tests with the push of a button. Software Patents Software program repairPatent Hiroaki Yoshida, Shin Hwei Tan, Mukul R. Prasad (Abstract) According to an aspect of an embodiment, one or more systems or methods may be configured to locate a fault in a software program using a test suite. The systems or methods may be further configured to modify, using a repair template, the software program in response to locating the fault. In addition, the systems or methods may be configured to determine whether the modification satisfies an anti-pattern condition. The anti-pattern condition may indicate whether the modification is improper. The systems or methods may also be configured to disallow the modification in response to the modification satisfying the anti-pattern condition or perform further testing on the software program, as modified, in response to the modification not satisfying the anti-pattern condition. Chinese articles 基于开源软件的软件工程实践教学.软件导刊. 2022, Vol 21 (3), Selected as the cover article. 将开源和企业引入计算机课程教学——“把教学场景用起来”模式探讨 (CCF article) Grants Discovery Grant 2024-2028, Natural Sciences and Engineering Research Council of Canada (NSERC), $40k/year+12,500 ECR Young Researcher Fund 2019, National Natural Science Foundation of China, $270k PI for General Program 2020, Natural Science Foundation of Guangdong Province, $100k PI for Automated Repair of GUI tests (GUI自动化测试技术合作项目---界面变更自动化修复脚本) 2022, $40k Publications [ICSE2026] What Makes Code Generation Ethically Sourced ? Zhuolin Xu, Chenglin Li, Qiushi Li, Shin Hwei Tan (One-line Abstract) We introduce Ethically Sourced Code Generation (ES-CodeGen), a novel concept that encompasses managing all processes involved in code generation model development from data collection to post-deployment via ethical and sustainable practices.. [ASE2025] Coverage-Based Harmfulness Testing for LLM Code Transformation Honghao Tan, Haibo Wang, Diany Pressato, Yisen Xu, Shin Hwei Tan (One-line Abstract) We present the first coverage-based approach on harmfulness testing for automatically generated code. [FSE2025] Towards Diverse Program Transformations for Program Simplification Haibo Wang, Zezong Xing, Chengnian Sun, Zheng Wang, Shin Hwei Tan (One-line Abstract) We present a study of the diverse ",
  "content_length": 26347,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:26"
}