{
  "name": "Shion Guha",
  "homepage": "https://ischool.utoronto.ca/faculty-profile/shion-guha",
  "status": "success",
  "content": "Shion Guha - Faculty of Information Skip to content Dark Mode Light Mode Search Close Site Navigation HOME People Leadership Team Professors Staff Programs Undergraduate Programs Bachelor of Information Graduate Programs Master of Information Program Master of Information Concentrations Archives and Records Management Culture and Technology Critical Information Policy Studies Human-Centred Data Science Information Systems and Design Knowledge Management and Information Management Library and Information Science User Experience Design Master of Museum Studies Combined Degree Program PhD in Information PhD Funding Current PhD Students Collaborative Specializations Future Students Future Students Application Information Apply to the Bachelor of Information (BI) Apply to Master’s Programs (MI, MMSt, CDP) Apply to the PhD in Information General Information Undergraduate Admissions Events and Tours Graduate Admissions Events and Tours Newly Admitted Students Current Students Newly Admitted Students Undergraduate Students Graduate Students Graduate Students Graduate Course Timetable PhD Student Profiles All Students Course Directory Academic Dates and Deadlines Scholarships and Awards Office of the Registrar and Student Services Resources and Supports Student Life Research Research Research Areas All Research Areas Research Groups Centre for Culture and Technology Digital Curation Institute Knowledge Media Design Institute (KMDI) Student Research PhD Dissertations Master of Information Theses Master of Museum Studies Theses Postdoctoral Fellows Postdoctoral Fellows Directory Equity, Diversity and Inclusion Equity, Diversity and Inclusion Trainings, Workshops and Events EDI Complaints EDI Student Initiatives Fund Alumni Get Involved Volunteer Alumni News Faculty of Information Alumni Association Perks and Professional Development Giving Placeholder Donate Online Other Ways to Give Virtual Donor Wall Career Services Careers Access Symplicity For Students Career Services for Students Bachelor of Information Practicum Master of Information Co-op Master of Information Practicum Master of Museum Studies Internships Master of Museum Studies Capstone For Employers and Partners Career Services for Employers and Partners Bachelor of Information Practicum Master of Information Co-op Master of Information Practicum Master of Museum Studies Internships Master of Museum Studies Capstone (Partners) Strategic Plan 2025-2029 News Events About Us Intranet/SharePoint (limited access) Tech Support Featured News View All Dean Mostafa named Chair-Elect of iSchools Organization Faculty of Information Dean Javed Mostafa has been voted Chair-Elect of the iSchools Organization. A long-term participant in iSchools, Dean Mostafa  has been involved as both an independent academic member and as a dean, volunteering for key activities, providing organizational support, and helping to sponsor iSchools conferences and events.  His election reflects both his leadership at the Faculty of Information and the Faculty’s long-standing involvement […] Site Search Search the site Search Close Top Search Results View All Shion Guha Assistant Professor HCDS Concentration Coordinator View DiscoverResearch Profile Contact Details shion.guha@utoronto.caSt. George Campusshionguha.ca Social Media Research Areas Artificial Intelligence Data & Society Health Informatics Human Computer Interaction Youth & Digital Technology Show more (Research Areas) Show less (Research Areas) Bio Shion Guha is an Assistant Professor at the Faculty of Information and is also cross-appointed to the Department of Computer Science. His research interests include human-computer interaction, data science, and public policy. He’s been involved in developing the field of Human-Centred Data Science. This intersectional research area combines technical methodologies with interpretive inquiry to address biases and structural inequalities in socio-technical systems. He is the author of Human-Centered Data Science: An Introduction, an Amazon Best Selling textbook published by MIT Press in 2022. Shion wants to understand how algorithmic decision-making processes are designed, implemented and evaluated in public services. In doing so, he often works with marginalized and vulnerable populations, such as child welfare, homelessness, healthcare systems, etc. His work has been supported by grants from Canadian Institute for Advanced Research, National Science and Engineering Research Council, National Science Foundation, American Political Science Association etc. He has been featured in the media (Newsweek, Associated Press, ACLU, ABC, NBC, Gizmodo etc.) Shion has been awarded a Way-Klingler Early Career Award in 2019, a Connaught New Researcher Award in 2021 and a Schwartz-Reisman Institute for Technology and Society Faculty Fellowship from 2023-25. Previously, he received an MS from the Indian Statistical Institute in 2010 and a PhD from Cornell University in 2016. Shion Guha Teaching INF2178H Experimental Design for Data Science 0.5 Credits Supervision Current Supervision Ramaravind Kommiya Mothilal Supervisor: Ishtiaque Ahmed and Shion Guha Kelly McConvey Victoria Chui Seh Young (Erina) Moon",
  "content_length": 5202,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:30"
}