{
  "name": "Shiqi Wang 0001",
  "homepage": "https://www.cs.cityu.edu.hk/~shiqwang",
  "status": "success",
  "content": "Shiqi Wang Home Introduction Publications Services Honors Shiqi Wang Professor Dept. of Computer Science City University of Hong Kong [Google Scholar]  [DBLP]  [CV(.pdf)] Biography Shiqi Wang is a Professor of Computer Science, and serves as the Associate Dean for College of Computing at the City University of Hong Kong. He holds a Ph.D. (2014) from the Peking University under the supervision of Prof. Wen Gao and a B.Sc. in Computer Science from the Harbin Institute of Technology (2008). Before his current appointment, from Mar. 2014 to Mar. 2016, he was a Postdoc Fellow with the Department of Electrical and Computer Engineering, University of Waterloo, Waterloo, Canada. From Apr. 2016 to Apr. 2017, He was with the Rapid-Rich Object Search Laboratory (ROSE), Nanyang Technological University, Singapore, as a Research Fellow. His primary research interests include semantic and visual communication; AI generated content management; information forensics and security; and image/video quality assessment. Working Experience Dept. of Computer Science, City University of Hong Kong, Hong Kong SAR, China. 2025.07 - Now Professor Dept. of Computer Science, City University of Hong Kong, Hong Kong SAR, China. 2023.07 - 2025.06 Associate Professor Dept. of Computer Science, City University of Hong Kong, Hong Kong SAR, China. 2017.05 - 2023.06: Assistant Professor Rapid-Rich Object Search Laboratory, Nanyang Technological University (NTU), Singapore. 2016.04 - 2017.04: Research Fellow Dept. of Electrical & Computer Engineering, University of Waterloo, Canada. 2014.03 - 2016.03: Postdoctoral Fellow Media Computing Group, Microsoft Research Asia, Beijing, China. 2011.03 - 2011.08: Intern Education Ph.D. in Computer Application Technology (2014), Peking University, China Supervisor: Prof. Wen Gao B.Sc. in Computer Science and Technology (2008), Harbin Institute of Technology, China Contact Information Office: Y6414 YEUNG Phone: +(852)-3442-7341 Fax: +(852)-3442-0503 Email: shiqwang@cityu.edu.hk",
  "content_length": 2011,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:28"
}