{
  "name": "Shirin Nilizadeh",
  "homepage": "http://crystal.uta.edu/~shirin",
  "status": "success",
  "content": "` Shirin Nilizadeh Teaching Publications Students Lab Website Bio Latest News Febuary 2025: Congratulations to my Ph.D. students for leading and participating in OurCS@DFW and SCRF. Undergraduate students in our RobustSumm workshop received the runner-up award for their presentation. A special thanks to Poojitha Thota and Elham Pourabbas Vafa for their dedicated teaching and patient mentorship. Febuary 2025: Congratulations to Elham Pourabbas Vafa for winning the SCRF Best Ph.D. Lightning Talk Award! January 2025: Our paper \"DarkGram: A Large-Scale Analysis of Cybercriminal Activity Channels on Telegram\" has been accepted to The USENIX Security 2025. January 2025: Our paper \"Causal Insights into Parler's Content Moderation Shift: Effects on Toxicity and Factuality\" has been accepted to The Web Conference 2025. November 2024: Our paper \"Auditing Yelp’s Business Ranking and Review Recommendation Through the Lens of Fairness\" has been accepted to ICWSM 2025. November 2024: Gave a talk on \"Countering Harmful Content in the Digital Age of AI\" to an esteemed group of journalists as part of the Edward R. Murrow Program on Media Responsibility in an Age of Disinformation. September 2024: Serving on the program committee for the IEEE Symposium on Security and Privacy Workshops. September 2024: Our paper on \"Attacks against Abstractive Text Summarization Models through Lead Bias and Influence Functions,\" has been accepted to the EMNLP Findings. September 2024: Co-Led a Research Discussion Session on \"AI to Prevent Phishing, Scams, and Online Hate\" at NSF SaTC PI Meeting 2024. Thanks to Dr. Hongxin Hu's initative. August 2024: Serving on the Program Committee of USENIX Security 2025. August 2024: Our paper on LLM-generated phishing websites got featured on Orange Hello Future. June 2024: Serving on the PoPETs 2025 Editorial Board. June 2024: Our paper on AI phishing scams got featured on UTA news. May 2024: Our paper From Chatbots to Phishbots? received the Distinguished Paper Award from the IEEE S&P 2024. May 2024: Received a research grant from the Comcast Innovation Fund Program to study cybercrime on social media platforms. Thank you, Comcast! April 2024: Received the College of Engineering Outstanding Early Career Research award. Thanks, UTA, COE and CSE! April 2024: Our collaborative project with the School of Social Work to study technology-facilitated abuse has been awarded funding by the Wolens Foundation Impact Fund. March 2024: Our paper \"Users’ Behavioral and Emotional Response to Toxicity in Twitter Conversations\" got accepted to ICWSM 2024. March 2024: Our paper on \"From Chatbots to Phishbots?: Phishing Scam Generation in Commercial Large Language Models\" got accepted to IEEE S&P 2024. March 2024: Presented a talk on \"Countering Harmful Content in the Digital Age\" at the Greater Fort Worth Chapter of PRSA monthly luncheon. Teaching Spring 2nd Eight Week Session 2025: Fort Worth Program: CSE 6388: Special Topics in Advanced Information Security: Data-Driven Security and Privacy. Spring 2025: CSE 5388/6388: Special Topics in Advanced Information Security: Data-Driven Security and Privacy. Fall 2024: CSE 4380/5380: Information Security 1 Spring 2024: CSE 5388/6388: Special Topics in Advanced Information Security: Data-Driven Security and Privacy. Fall 2023: CSE 4380/5380: Information Security 1 Spring 2023: CSE 5388/6388: Special Topics in Advanced Information Security: Data-Driven Security and Privacy. Spring 2023: CSE 4380/ 5388: Information Security 1 Fall 2022: CSE 4380: Information Security 1 Spring 2022: CSE 4380: Information Security 1 Spring 2021: CSE 5388/6388: Special Topics in Advanced Information Security: Data-Driven Security and Privacy. Spring 2021: CSE 4380/ 5388: Information Security 1 Fall 2020: CSE 4380: Information Security 1 Spring 2020: CSE 5388/6388: Special Topics in Advanced Information Security: Data-Driven Security and Privacy. Fall 2019: CSE 4380: Information Security 1 Spring 2019: CSE 5388/6388: Special Topics in Advanced Information Security: Data-Driven Security and Privacy. Fall 2018: CSE 4380/5380: Information Security Bio Dr. Shirin Nilizadeh is an Associate Professor at the Department of Computer Science and Engineering at the University of Texas at Arlington. Her research focuses on security and privacy in the context of systems and social networks using techniques from machine learning and big data analytics. She takes a highly interdisciplinary approach to her research, incorporating ideas from artificial intelligence, natural language processing, psychology, social sciences, public health, privacy, and system security. She is the recipient of the Prestigious ational Science Foundation CAREER award (2023) and the Comcast Innovation Award (2022 and 2024). Her work has received multiple best paper awards, including at IEEE S&P 2024 and eCrime 2021. Her research has been covered by several news and technology outlets, such as WIRED, MIT Technology Review, Orange’s Hello Future, Communications of the ACM, as well as cited by official reports submitted to The Supreme Court and the Committee on Civil Liberties, Justice and Home Affairs in European Union. She has served on numerous program committees of the most prestigious international conferences and workshops on computer security, privacy, web, and social media.",
  "content_length": 5347,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:33"
}