{
  "name": "Shireen Y. Elhabian",
  "homepage": "http://www.sci.utah.edu/~shireen",
  "status": "success",
  "content": "Shireen Elhabian Shireen Y. Elhabian, M.Sc., Ph.D. Home Publications Book Chapters Refereed Journal Publications Peer Reviewed Conference Proceedings Workshops Abstracts Preprints Technical Reports Dissertation Research Deep Generative Models Particle-based Shape Modeling ShapeOdds for Grid-structured Shapes Appearance Modeling Statistical 3D Shape Recovery Biomedical Image Segmentation Motion Artifacts in Diffusion Imaging Invariant Object Descriptors and Matching Computational Biometrics for Face Recognition Projects Ongoing Research Projects Completed Research Projects Teaching Tutorials Talks Group Lab Structure PhD Students Master Students Software Developers Alumni Prospective Students Collaborators Shireen Elhabian Probabilistic Machine Learning for Image Analysis Recent advances in imaging data acquisition and the momentum in modern machine intelligence have led to exciting research into exploiting the power of images and solving problems that cannot be solved by manual analysis. Extracting and understanding information from images requires a multifaceted paradigm that leverages the complementarity of low-level image processing and high-level vision and machine learning approaches. Research interests. My research is at the intersection of image analysis and statistical machine learning, with an emphasis on probabilistic modeling and deep learning and a focus on clinical and biomedical applications of image-based computational methods. As well, I am fascinated with the implications of advances in these fields for society and industry. Meanwhile, I enjoy collaborating with scientists and domain experts of different disciplines and backgrounds to conduct interdisciplinary research projects. Vision. Deployable image analysis systems empowered by machine learning can transform the way biomedical researchers and clinicians interpret imaging data in an objective, thorough, efficient, and reproducible manner, thereby maximizing the benefit-to-cost of imaging technologies and enabling early diagnosis and patient-specific treatment and prognosis. Long-term goal. My long-term goal is to accelerate the adoption and increase the clinical utility of machine-learning-based image analysis systems that mitigate critical bottlenecks in attaining an expert-level understanding of the complexities of imaging data and have a broad impact in a range of clinical and biomedical research disciplines. Objective. The objective of my research has been establishing foundational methods to solve inverse problems in image analysis and quantitatively interpret imaging data using minimal expert supervision, and translating these methods to application domains through robust, flexible, and usable open-source software packages. Prospective students. We are often looking for motivated and enthusiastic students who are interested in conducting advanced research in machine/deep learning, image understanding, and statistical analysis. You might want to see this announcement from more details. Please apply to the MS/PhD program in School of Computing at the University of Utah. Postdoctoral researchers. We are looking for ambitious and motivated researchers to join the image analysis group at the SCI Institute and work as part of multidisciplinary teams. You might want to see this announcement from more details. Lab News In Fall 2022, Rachaell Nihalaani, Janmesh Ukey, Mokshagna Karanam, and Abu Zhid Bin Aziz has joined my research group. Welcome!! Our papers in statistical shape modeling for anatomies with shared boundaries and dynamic anatomies have been accepted for publication in MICCAI Statistical Atlases and Computational Modeling of the Heart (STACOM) workshop, 2022. New paper on deep generative modeling has been accepted for publication in the ML Journal track of the European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML-PKDD) 2022. In Summer 2022, Riddhish Bhalodia has successfully defended his PhD dissertation and joined Meta as a machine learning engineer. Congratulations Riddhish! New paper on statistical modeling of right ventricle shapes in patients with Tricuspid Regurgitation has been published in Frontiers of Phyiology, 2022. New paper on probablistic modeling for inferring statistical representations of shapes directly from images has been early accepted at the International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI), 2022. Our benchmarking study on statistical shape modeling tools in clinical applications has been publised in Medical Image Analysis (MedIA), 2022. In Fall 2021, Saradha Rajamani has successfully defended her master thesis and joined Pfizer. Congratulations Saradha! In Fall 2021, Nawazish Khan has joined my research group as a master student. New paper on assessing the morphology of the full femur and hemi-pelvis using an articulated statistical shape models in patients with hip dysplasia has been published in Journal of Orthopaedic Research, 2021. New paper on leveraging unsupervised image registration using deep networks for landmarks discovery has been publised in Medical Image Analysis (MedIA), 2021. New paper on improving the stability and diversity of generative adversarial networks has been published in the International Conference on Image Processing, Computer Vision, and Pattern Recognition, 2021. In Spring 2021, Tushar Kataria has joined my research group as a PhD student. In Spring 2021, Karthik Karanth has successfully defended his master project. Congratulations Karthik! In Spring 2021, Tushar Kataria has joined my research group as a PhD student. New paper on learning population-specific priors for variational autoencoders has been published in the Asian Conference on Computer Vision (ACCV), 2020. New paper on probablistic models for statistica shapes from images has been published at the International Workshop on Shape in Medical Imaging, ShapeMI-MICCAI, 2020. This paper has received the Runner-Up Paper Award, 2nd place. New paper on statistical modeling of articulated joints has been published at the International Workshop on Shape in Medical Imaging, ShapeMI-MICCAI, 2020. The first deep learning approach for automating the screening process for CryoEM sample acquistion has been publised at the International Conference of Medical Image Computing and Computer Assisted Intervention (MICCAI), 2020. First author has received the MICCAI NIH Award. In Fall 2020, Krithika Iyer has joined my research group as a PhD student. In Summer 2020, Saradha Rajamani has joined my research group as a master student. In Summer 2020, Oleks Korshak has successfully defended his master project. Congratulations Oleks! New paper on generative modeling of multi-label probabilistics maps has been accepted for publication in the IEEE Transaction of Medical Imaging, 2020. In Fall 2019, Praful Agrawal has successfully defended his PhD dissertation and joined Amazon as a research scientist. Congratulations Praful! New paper on nonparameteric Bayesian models for shape representation has been accepted for publication in the 34th AAAI Conference on Artificial Intelligence (AAAI), 2020. New paper on learning interpretable shared hidden structure across data spaces for design space analysis and exploration has been accepted for publication in ASME Journal of Mechanical Design, 2020. New paper on self-regularizing CNNs for image registration has been accepted for publication in the 22nd International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI), 2019. In Fall 2019, Jadie Adams has joined my research group as a PhD student. In Summer 2019, Anupama Goparaju has successfully defended her master thesis. Congratulations Anu! In Summer 2019, Atefeh Ghanaatikashani has joined my research group as a PhD student. In Summer 2019, Hong Xu has joined my research group as a PhD student. In Fall 2018, Xiaoni Cao has joined my research group as a PhD student. In Fall 2018, Kyli McKay-Bishop, Oleks Korshak, and Shalin Parikh have joined my research group as master students. New paper on predicting statistical shape models directly from images via deep learning has been accepted in ShapeMI-MICCAI 2018 (oral). New paper on evaluating different statistical shape modeling tools in a clinical scenario has been accepted in ShapeMI-MICCAI 2018 (oral). New paper on shape and appearance modeling for automatic left atrium segmentation has been accepted in STACOM-MICCAI 2018 (poster). New paper on predicting atrial fibrillation recurrence from MRI images using deep learning has been accepted in CinC 2018 (oral). New paper on population-level interactive visualization of left atrium shape in atrial fibrillation patients has been accepted in CinC 2018 (poster). In Summer 2018, Archanasri Subramanian has joined my research group as a master student. In Spring 2018, Riddhish Bhalodia and Tim Sodergren have joined my research group as PhD students. In Fall 2017, Anupama Goparaju has joined my research group as a master student. New paper on learning deep features for correspondence models has been accepted in the International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI) 2017 (oral). New paper on learning mixtures of shape models has been accepted in International Conference on Image Processing and Machine Intelligence (IPMI) 2017 (oral). New paper on Bayesian learning of shape models has been accepted in The IEEE / CVF Computer Vision and Pattern Recognition Conference (CVPR) 2017 (splotlight). Shireen Y. Elhabian, M.Sc., Ph.D.Â Associate Professor of Computer Science School of Computing SCI Institute University of Utah Contact: shireen-at-sci-dot-utah-dot-edu 72 South Central Campus Drive, Salt Lake City, Utah 84112 Room: WEB 3608 Phone: (801) 587-3206 Fax: (801) 585-6513 Useful Links: Google Scholar ResearchGate LinkedIn Twitter GitHub Software Releases: ShapeWorks 6.3 is now released! Support f",
  "content_length": 11293,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:31"
}