{
  "name": "Shivaram Kalyanakrishnan",
  "homepage": "https://www.cse.iitb.ac.in/~shivaram",
  "status": "success",
  "content": "Shivaram Kalyanakrishnan Shivaram Kalyanakrishnan I am an Associate Professor in the Department of Computer Science and Engineering, Indian Institute of Technology Bombay. I specialise in artificial intelligence. Driven by the goal of creating intelligent agents—especially ones that can learn—I consider questions in areas such as sequential decision making, multiagent learning, multi-armed bandits, and humanoid robotics. Application domains include robot soccer, computer games, and on-line advertising. Here is a copy of my CV. I do not have positions for internships and research projects open to students outside IIT Bombay. I apologise for not being able to respond individually to the numerous queries I receive in this regard. This semester (Autumn 2025), I teach CS 747: Foundations of Intelligent and Learning Agents. Teaching Spring 2025: CS 747: Foundations of Intelligent and Learning Agents Spring 2024: CS 101: Computer Programming and Utilization Autumn 2023: CS 747: Foundations of Intelligent and Learning Agents Spring 2023: CS 748: Advances in Intelligent and Learning Agents Spring 2023: Mathematical Foundations of Artificial Intelligence and Machine Learning. (NCM-CEP course.) Autumn 2022: CS 747: Foundations of Intelligent and Learning Agents Spring 2022: CS 748: Advances in Intelligent and Learning Agents (On-line course; lectures, assignments included.) Autumn 2021: CS 747: Foundations of Intelligent and Learning Agents (On-line course; lectures, assignments included.) Spring 2021: CS 748: Advances in Intelligent and Learning Agents (On-line course; lectures, assignments included.) Autumn 2020: CS 747: Foundations of Intelligent and Learning Agents (On-line course; lectures, assignments included.) Spring 2020: CS 748: Advances in Intelligent and Learning Agents Autumn 2019: CS 747: Foundations of Intelligent and Learning Agents Spring 2019: CS 337 and 335: Artificial Intelligence and Machine Learning Autumn 2018: CS 747: Foundations of Intelligent and Learning Agents Spring 2018: CS 344 and 386: Artificial Intelligence Autumn 2017: CS 747: Foundations of Intelligent and Learning Agents Spring 2017: CS 344 and 386: Artificial Intelligence Autumn 2016: CS 747: Foundations of Intelligent and Learning Agents Spring 2016: CS 748: Advances in Intelligent and Learning Agents Autumn 2015: CS 747: Foundations of Intelligent and Learning Agents Publications Journals Hybrids of Reinforcement Learning and Evolutionary Computation in Finance: A Survey Sandarbh Yadav, Vadlamani Ravi, and Shivaram Kalyanakrishnan, 2025 ACM Computing Surveys. [Publisher's on-line version  PDF  BibTeX] Upper Bounds for All and Max-Gain Policy Iteration Algorithms on Deterministic MDPs Ritesh Goenka, Eashan Gupta, Sushil Khyalia, and Shivaram Kalyanakrishnan, 2025. To appear. Mathematics of Operations Research. [Publisher's on-line version  PDF  BibTeX  Notes] Reinforcement Learning for Improving Chemical Reaction Performance Ajnabiul Hoque, Mihir Surve, Shivaram Kalyanakrishnan, and Raghavan B. Sunoj, 2024 Journal of the American Chemical Society. [Publisher's on-line version  BibTeX] Direction-Changing Fall Control of Humanoid Robots: Theory and Experiments Ambarish Goswami, Seung-kook Yun, Umashankar Nagarajan, Sung-Hee Lee, KangKang Yin, and Shivaram Kalyanakrishnan, 2014 Autonomous Robots. [PDF  BibTeX] Characterizing Reinforcement Learning Methods through Parameterized Learning Problems Shivaram Kalyanakrishnan and Peter Stone, 2011 Machine Learning. [PDF  BibTeX Publisher's on-line version  Notes] Learning to Predict Humanoid Fall Shivaram Kalyanakrishnan and Ambarish Goswami, 2011 International Journal of Humanoid Robotics. [PDF  BibTeX  Publisher's on-line version] Electronic version of an article published as: International Journal of Humanoid Robotics, Volume 8, Number 2, pp. 245-273, DOI: 10.1142/S0219843611002496, © copyright World Scientific Publishing Company. Conferences On the Efficiency of Algebraic Simplex Algorithms for Solving MDPs Dibyangshu Mukherjee and Shivaram Kalyanakrishnan, 2025. CPAIOR 2025. [PDF  BibTeX] A View of the Certainty-Equivalence Method for PAC RL as an Application of the Trajectory Tree Method Shivaram Kalyanakrishnan, Sheel Shah, and Santhosh Kumar Guguloth, 2025. AAMAS 2025. [PDF  BibTeX] Linear-Time Optimal Deadlock Detection for Efficient Scheduling in Multi-Track Railway Networks Hastyn Doshi, Ayush Tripathi, Keshav Agarwal, Harshad Khadilkar, and Shivaram Kalyanakrishnan, 2024. IJCAI 2024. [PDF  BibTeX  Code] This paper was also invited to be presented at the AI for Critical Infrastructure Workshop at IJCAI 2024, Jeju, Korea Optimal Stopping Rules for Best Arm Identification in Stochastic Bandits under Uniform Sampling Vedang Gupta, Yash Gadhia, Shivaram Kalyanakrishnan, and Nikhil Karamchandani, 2024. ISIT 2024. [PDF  BibTeX] PAC Mode Estimation using PPR Martingale Confidence Sequences Shubham Anand Jain, Rohan Shah, Sanit Gupta, Denil Mehta, Inderjeet Nair, Jian Vora, Sushil Khyalia, Sourav Das, Vinay J. Ribeiro, and Shivaram Kalyanakrishnan, 2022. AISTATS 2022. [PDF  BibTeX] Optimising a Real-time Scheduler for Indian Railway Lines by Policy Search Rohit Prasad, Harshad Khadilkar, and Shivaram Kalyanakrishnan, 2021 ICC 2021. [PDF  BibTeX] Intelligent and Learning Agents: Four Investigations Shivaram Kalyanakrishnan, 2021 IJCAI 2021. [PDF  BibTeX] Lower Bounds for Policy Iteration on Multi-action MDPs Kumar Ashutosh, Sarthak Consul, Bhishma Dedhia, Parthasarathi Khirwadkar, Sahil Shah, and Shivaram Kalyanakrishnan, 2020 CDC 2020. [PDF  BibTeX] Regret Minimisation in Multi-Armed Bandits Using Bounded Arm Memory Arghya Roy Chaudhuri and Shivaram Kalyanakrishnan, 2020 AAAI 2020. [PDF  BibTeX] A Tighter Analysis of Randomised Policy Iteration Meet Taraviya and Shivaram Kalyanakrishnan, 2019 UAI 2019. [PDF  BibTeX] PAC Identification of Many Good Arms in Stochastic Multi-Armed Bandits Arghya Roy Chaudhuri and Shivaram Kalyanakrishnan, 2019 ICML 2019. [PDF  BibTeX] Quantile-Regret Minimisation in Infinitely Many-Armed Bandits Arghya Roy Chaudhuri and Shivaram Kalyanakrishnan, 2018 UAI 2018. [PDF  BibTeX] Opportunities and Challenges for Artificial Intelligence in India Shivaram Kalyanakrishnan, Rahul Alex Panicker, Sarayu Natarajan, and Shreya Rao, 2018 AIES 2018. [PDF  BibTeX] Improved Strong Worst-case Upper Bounds for MDP Planning Anchit Gupta and Shivaram Kalyanakrishnan, 2017 IJCAI 2017. [PDF  BibTeX] PAC Identification of a Bandit Arm Relative to a Reward Quantile Arghya Roy Chaudhuri and Shivaram Kalyanakrishnan, 2017 AAAI 2017. [PDF  BibTeX] Batch-Switching Policy Iteration Shivaram Kalyanakrishnan, Utkarsh Mall, and Ritish Goyal, 2016 IJCAI 2016. [PDF  BibTeX] Randomised Procedures for Initialising and Switching Actions in Policy Iteration Shivaram Kalyanakrishnan, Neeldhara Misra, and Aditya Gopalan, 2016 AAAI 2016. [PDF  BibTeX  Notes] On Building Decision Trees from Large-scale Data in Applications of On-line Advertising Shivaram Kalyanakrishnan, Deepthi Singh, and Ravi Kant, 2014 CIKM 2014. [PDF  BibTeX] GEV-Canonical Regression for Accurate Binary Class Probability Estimation when One Class is Rare Arpit Agarwal, Harikrishna Narasimhan, Shivaram Kalyanakrishnan, and Shivani Agarwal, 2014 ICML 2014. [PDF  BibTeX] Information Complexity in Bandit Subset Selection Emilie Kaufmann and Shivaram Kalyanakrishnan, 2013 COLT 2013. [PDF  BibTeX  Notes] A short version of this paper was presented at the 8èmes Journées Francophones sur la Planification, la Décision et l'Apprentissage pour la conduite de systèmes (JFPDA 2013), Lille, France. PAC Subset Selection in Stochastic Multi-armed Bandits Shivaram Kalyanakrishnan, Ambuj Tewari, Peter Auer, and Peter Stone, 2012 ICML 2012. [PDF  BibTeX] UT Austin Villa 2011: A Champion Agent in the RoboCup 3D Soccer Simulation Competition Patrick MacAlpine, Daniel Urieli, Samuel Barrett, Shivaram Kalyanakrishnan, Francisco Barrera, Adrian Lopez-Mobilia, Nicolae Ştiurcă, Victor Vu, and Peter Stone, 2012 AAMAS 2012. [PDF  BibTeX  Supplementary page] On Optimizing Interdependent Skills: A Case Study in Simulated 3D Humanoid Robot Soccer Daniel Urieli, Patrick MacAlpine, Shivaram Kalyanakrishnan, Yinon Bentor, and Peter Stone, 2011 AAMAS 2011. [PDF  BibTeX  Supplementary page] A similar version of this paper was presented at The Fifth Workshop on Humanoid Soccer Robots at Humanoids 2010, Nashville, TN, U.S.A. Efficient Selection of Multiple Bandit Arms: Theory and Practice Shivaram Kalyanakrishnan and Peter Stone, 2010 ICML 2010. [PDF  BibTeX  Notes] Predicting Falls of a Humanoid Robot through Machine Learning Shivaram Kalyanakrishnan and Ambarish Goswami, 2010 IAAI 2010. [PDF  BibTeX] An Empirical Analysis of Value Function-Based and Policy Search Reinforcement Learning Shivaram Kalyanakrishnan and Peter Stone, 2009 AAMAS 2009. [PDF  BibTeX] Batch Reinforcement Learning in a Complex Domain Shivaram Kalyanakrishnan and Peter Stone, 2007 AAMAS 2007. [PDF  BibTeX  Notes] Nominee for Best Student Paper Award at AAMAS 2007, Honolulu, Hawai'i, U.S.A. Workshops and Symposia Half Field Offense: An Environment for Multiagent Learning and Ad Hoc Teamwork Matthew Hausknecht, Prannoy Mupparaju, Sandeep Subramanian, Shivaram Kalyanakrishnan, and Peter Stone, 2016 Adaptive and Learning Agents Workshop 2016. [PDF  BibTeX] On Learning with Imperfect Representations Shivaram Kalyanakrishnan and Peter Stone, 2011 ADPRL 2011. [PDF  BibTeX] Three Humanoid Soccer Platforms: Comparison and Synthesis Shivaram Kalyanakrishnan, Todd Hester, Michael Quinlan, Yinon Bentor, and Peter Stone, 2010 RoboCup 2009. Short paper. [PDF  BibTeX] Learning Complementary Multiagent Behaviors: A Case Study Shivaram Kalyanakrishnan and Peter Stone, 2010 RoboCup 2009. [PDF  BibTeX Supplementary page] Winner of Best Student Paper Award at the RoboCup International Symposium 2009, Graz, Austria. A similar version of this paper was presented at the Adaptive and Learning Agents Workshop at AAMAS 20",
  "content_length": 13003,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:38"
}