{
  "name": "Shiwei Zeng 0001",
  "homepage": "https://sites.google.com/view/shiweizeng",
  "status": "success",
  "content": "Shiwei ZengSearch this siteEmbedded FilesSkip to main contentSkip to navigationShiwei ZengEmail: szeng at augusta dot edu (effective Aug 2024); shiwei.vivi.zeng at gmail dot com (effective Jun 2024)Office: University Hall 131D (Summerville Campus), Augusta UniversityI am a tenure-track assistant professor at SCCS Augusta University, GA. I always look for self-motivated PhD students with strong math background and machine learning research experience. If interested, please drop me an email titled \"Interests in Ph.D. Positions - FirstName LastName\" with your research statement and transcripts.My area of research is on Machine Learning Theory and Algorithmic Robustness. I study scenarios when machine learning algorithms are faced with modern challenges such as malicious adversaries, data deficiency, and unreliable human feedbacks; meanwhile, my interest goes well beyond that, including but not limited to data privacy, algorithmic fairness, and algorithmic game theory. Recently, I have been concerned about multiclass learning problems.I obtained my Ph.D. in CS at Stevens Institute of Technology in 2024, advised by Professor Jie Shen. I earned my Bachelor's degrees from Sun Yat-sen University and Hong Kong Polytechnic University in 2015.PapersManuscriptsShiwei Zeng, Jie Shen. Attribute-Efficient PAC Learning of Sparse Halfspaces with Constant Malicious Noise Rate. [arxiv]PublicationsShiwei Zeng, Jie Shen. Attribute-efficient PAC Learning of Low-Degree Polynomial Threshold Functions with Nasty Noise, ICML 2023. [arxiv] [link]Shiwei Zeng, Jie Shen. Semi-verified PAC Learning from the Crowd, AISTATS 2023. [arxiv] [link]Shiwei Zeng, Jie Shen. List-Decodable Sparse Mean Estimation, NeurIPS 2022 [arxiv] [link]Shiwei Zeng, Jie Shen. Efficient PAC Learning from the Crowd with Pairwise Comparison, ICML 2022 [arxiv] [link]ThesisShiwei Zeng. Data-Efficiency and Robustness in Machine Learning, Doctoral Thesis [link]Research GroupDoctoral: Rita Adhikari (exp: Fall 2025 -)Undergrads: Adam Reynolds (Spring 2025)TeachingDASC 4850A - Machine Learning (Fall 2025)CSCI 3430A - Artificial Intelligence (Spring 2025)Academic ServicesConference Reviewer: IJCAI2021, IJCAI2022, ICML2022, ISIT2022, NeurIPS2022, ACML2022, AAAI2023, AISTATS2023, IJCAI2023, ICML2023, NeurIPS2023, AAAI2024, ICLR2024, AISTATS2024, IJCAI2024, ICML2024, NeurIPS2024, ACML2024, AAAI2025, ICLR2025, AISTATS2025, ICML2025, NeurIPS2025.Research SeminarI plan to resume the machine learning theory seminar from Fall 2025.MiscI enjoy dancing as a hobby, for which I was active in Hong Kong and New York City from 2013 to 2020. It teaches me hard-working is the key to any achievement.Meanwhile, I play ultimate frisbee to keep myself physically active.My Ph.D. CalendarAug 2024 - Joined the department of computer science at Augusta University as a tenure-track assistant professor.May 2024 - Received Excellence in Graduate Research Award (Class of 2024).April 2024 - Passed my thesis defense.May 2023 - Been selected for the Stevens Excellence Doctoral Fellowship for the 2023-24 academic year.May 2023 - Passed the thesis proposal defense.Apr 2023 - One paper studying robust learning sparse PTFs got accepted to ICML 2023.Jan 2023 - One paper studying crowdsourced PAC learning got accepted to AISTATS 2023.Sep 2022 - One paper studying robust sparse mean estimation got accepted to NeurIPS 2022. October: travel grant received.May 2022 - One paper studying crowdsourced PAC learning got accepted to ICML 2022. June: travel grant received.Feb 2022 - Received the Early-career AMS-NSF-Simons-ICM Travel Grant to participate in ICM2022 in Saint Petersburg. (ICM went virtual).Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3731,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:38"
}