{
  "name": "Shixia Liu",
  "homepage": "http://shixialiu.com",
  "status": "success",
  "content": "Shixia Liu's Homepage - Tsinghua University Shixia Liu (åä¸é) I am a professor in the School of Software, Tsinghua University. I received a B.S. and M.S. from Harbin Institute of Technology, a Ph.D. from Tsinghua University. Before I joined Tsinghua, I worked as a lead researcher at Microsoft Research Asia and a research staff member and research manager at IBM China Research Lab. I was named an IEEE Fellow in 2021. Email: shixia@tsinghua.edu.cn; liushixia@gmail.com Research My research tightly integrates interactive visualization with machine learning or data mining techniques to help users consume huge amounts of information. Explainable artificial intelligence Visual analytics techniques for machine learnig, including 1) understand, diagnose, and refine a machine learning model; 2) improve data quality and feature quality. Visual text analytics Combine the advantages of text mining and interactive visualization to facilitate visual analytics of large-scale textual data. Text mining Develop statistical text mining methods to understand complex text data, including evolutionary text clustering, topic modeling, and sentiment analysis. Students Current PhD Zhen Li (co-advised w/Hui Zhang), 2021~ Yukai Guo, 2022~ Jiangning Zhu, 2023~ Duan Li, 2023~ Xinyuan Guo, 2024~ Completed PhD Weikai Yang, 2019~2024, Assistant Professor at HKUST(gz). (Distinguished Doctoral Dissertation Award of Tsinghua University, Outstanding Graduate of Tsinghua University and Beijing) (He is now actively seeking PhD/RA, more information) Jun Yuan, 2019~2024, Tencent Changjian Chen, 2017~2022, Assistant Professor at Hunan University Mengchen Liu , 2013~2018, Senior Researcher at Microsoft Remond Xiting Wang, 2011~2016, Assistant Professor at Renmin University of China Honors and Awards 2024, AAIA Fellow 2024, Distinguished Doctoral Dissertation Advisor at Tsinghua University 2022, IEEE VGTC Visualization Technical Achievement Award 2021, IEEE Fellow 2020, IEEE Visualization Academy 2020, Best Mentor Award of Tsinghua University 2019, Excellent Class Teacher of Tsinghua university 2016, Best Associate Editor Award of IEEE TVCG 2012, Microsoft Ship-It Award 2011, Microsoft Ship-It Award 2010, IBM Research accomplishment 2006, IBM Master Inventor Books Visualization for Artificial Intelligence Shixia Liu; Weikai Yang; Junpeng Wang; Jun Yuan. Synthesis Lectures on Visualization, Springer Cham, 2025. Book BibTex Papers 2025 Hierarchical Fuzzy-Cluster-Aware Grid Layout for Large-Scale Data Yuxing Zhou; Changjian Chen; Zhiyang Shen; Jiangning Zhu; Jiashu Chen; Weikai Yang; Shixia Liu. IEEE Transactions on Visualization and Computer Graphics. 2025. Paper Video Code BibTex ReorderBench: A Benchmark for Matrix Reordering Jiangning Zhu; Zheng Wang; Zhiyang Shen; Lai Wei; Fengyuan Tian; Mengchen Liu; Shixia Liu. IEEE Transactions on Visualization and Computer Graphics. 2025. Paper Code BibTex RouteFlow: Trajectory-Aware Animated Transitions Duan Li; Xinyuan Guo; Xinhuan Shu; Lanxi Xiao; Lingyun Yu; Shixia Liu. CHI Conference on Human Factors in Computing Systems. 2025. (Best Paper). Paper Video Code BibTex Structural-Entropy-Based Sample Selection for Efficient and Effective Learning Tianchi Xie; Jiangning Zhu; Guozu Ma; Minzhi Lin; Wei Chen; Weikai Yang; Shixia Liu. International Conference on Learning Representations. 2025. Paper Code BibTex Dynamic Color Assignment for Hierarchical Data Jiashu Chen; Weikai Yang; Zelin Jia; Lanxi Xiao; Shixia Liu. IEEE Transactions on Visualization and Computer Graphics. 31(1): 338-348, 2025. (Honorable Mention). Paper Video Code BibTex 2024 RuleExplorer: A Scalable Matrix Visualization for Understanding Tree Ensemble Classifiers Zhen Li; Weikai Yang; Jun Yuan; Jing Wu; Changjian Chen; Yao Ming; Fan Yang; Hui Zhang; Shixia Liu. IEEE Transactions on Visualization and Computer Graphics. 2024. Paper Video Code BibTex Visual Analytics for Machine Learning: A Data Perspective Survey Junpeng Wang; Shixia Liu; Wei Zhang. IEEE Transactions on Visualization and Computer Graphics. 30(12): 7637-7656, 2024. Paper BibTex Enhancing Single Frame Supervision for Better Temporal Action Localization Changjian Chen; Jiashu Chen; Weikai Yang; Haoze Wang; Johannes Knittel; Xibin Zhao; Steffen Koch; Thomas Ertl; Shixia Liu. IEEE Transactions on Visualization and Computer Graphics. 30(6): 2903-2915, 2024. Paper Video Code BibTex Interactive Reweighting for Mitigating Label Quality Issues Weikai Yang; Yukai Guo; Jing Wu; Zheng Wang; Lan-Zhe Guo; Yu-Feng Li; Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 30(3): 1837-1852, 2024. Paper Video Code BibTex A Unified Interactive Model Evaluation for Classification, Object Detection, and Instance Segmentation in Computer Vision Changjian Chen, Yukai Guo, Fengyuan Tian, Shilong Liu, Weikai Yang, Zhaowei Wang, Jing Wu, Hang Su, Hanspeter Pfister, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 30(1): 76-86, 2024. Paper Video Code BibTex Cluster Aware Grid Layout Yuxing Zhou, Weikai Yang, Jiashu Chen, Changjian Chen, Zhiyang Shen, Xiaonan Luo, Lingyun Yu, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 30(1): 240-250, 2024. Paper Video Code BibTex Foundation Models Meet Visualizations: Challenges and Opportunities Weikai Yang, Mengchen Liu, Zheng Wang, Shixia Liu Computational Visual Media. 10(3): 399-424, 2024. Paper BibTex 2023 Visual Analysis of Neural Architecture Spaces for Summarizing Design Principles Jun Yuan, Mengchen Liu, Fengyuan Tian, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 29(1): 288-298, 2023. Paper Video BibTex Enhancing Training Data Quality With Visual Analytics Shixia Liu Computer. 56(11): 4-6, 2023. Paper BibTex åºäºå¯è§åæçè®­ç»æ°æ®è´¨éæåç ç©¶ æ¨ç»´é , éé¿å»º, æ±æ±å®, æç£, åé¹, åä¸é è®¡ç®æºè¾ å©è®¾è®¡ä¸å¾å½¢å­¦å­¦æ¥. 35(11): 1629-1642, 2023. Paper BibTex 2022 A Unified Understanding of Deep NLP Models for Text Classification Zhen Li, Xiting Wang, Weikai Yang, Jing Wu, Zhengyan Zhang, Zhiyuan Liu, Maosong Sun, Hui Zhang, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 28(12): 4980-4994, 2022. Paper Video BibTex Diagnosing Ensemble Few-Shot Classifiers Weikai Yang, Xi Ye, Xingxing Zhang, Lanxi Xiao, Jiazhi Xia, Zhongyuan Wang, Jun Zhu, Hanspeter Pfister, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 28(9): 3292-3306, 2022. Paper Video Code BibTex Towards Better Caption Supervision for Object Detection Changjian Chen, Jing Wu, Xiaohan Wang, Shouxing Xiang, Song-Hai Zhang, Qifeng Tang, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 28(4): 1941-1954, 2022. Paper Video Code BibTex Revisiting Dimensionality Reduction Techniques for Visual Cluster Analysis: An Empirical Study Jiazhi Xia, Yuchen Zhang, Jie Song, Yang Chen, Yunhai Wang, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 28(1): 529-529, 2022. Paper BibTex Real-Time Visual Analysis of High-Volume Social Media Posts Johannes Knittel, Steffen Koch, Tan Tang, Wei Chen, Yingcai Wu, Shixia Liu, Thomas Ertl IEEE Transactions on Visualization and Computer Graphics. 28(1): 879-889, 2022. (Honorable Mention). Paper BibTex 2021 Interactive Steering of Hierarchical Clustering Weikai Yang, Xiting Wang, Jie Lu, Wenwen Dou, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 27(10): 3953-3967, 2021. Paper Video BibTex Interactive Graph Construction for Graph-Based Semi-Supervised Learning Changjian Chen, Zhaowei Wang, Jing Wu, Xiting Wang, Lan-Zhe Guo, Yu-Feng Li, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 27(9): 3701-3716, 2021. Paper Video Code BibTex A Survey of Visual Analytics Techniques for Machine Learning Jun Yuan, Changjian Chen, Weikai Yang, Mengchen Liu, Jiazhi Xia, Shixia Liu Computational Visual Media. 7(1): 3-36, 2021. Paper BibTex Evaluation of Sampling Methods for Scatterplots Jun Yuan, Shouxing Xiang, Jiazhi Xia, Lingyun Yu, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 27(2): 1720-1730, 2021. Paper Code BibTex Preserving Minority Structures in Graph Sampling Ying Zhao, Haojin Jiang, Qi'an Chen, Yaqi Qin, Huixuan Xie, Yitao Wu, Shixia Liu, Zhiguang Zhou, Jiazhi Xia, Fangfang Zhou. IEEE Transactions on Visualization and Computer Graphics. 27(2): 1698-1708, 2021. (Honorable Mention). Paper BibTex Visual Analysis of Discrimination in Machine Learning Qianwen Wang, Zhenhua Xu, Zhutian Chen, Yong Wang, Shixia Liu, and Huamin Qu. IEEE Transactions on Visualization and Computer Graphics. 27(2): 1470-1480, 2021. Paper BibTex Analyzing the Noise Robustness of Deep Neural Networks Kelei Cao, Mengchen Liu, Hang Su, Jing Wu, Jun Zhu, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 27(7): 3289-3304, 2021. Paper Video BibTex OoDAnalyzer: Interactive Analysis of Out-of-Distribution Samples Changjian Chen, Jun Yuan, Yafeng Lu, Yang Liu, Hang Su, Songtao Yuan, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 27(7): 3335-3349, 2021. Paper Video Code BibTex 2020 Diagnosing Concept Drift with Visual Analytics Weikai Yang, Zhen Li, Mengchen Liu, Yafeng Lu, Kelei Cao, Ross Maciejewski, Shixia Liu IEEE VIS(VAST). 2020. Paper Video BibTex Visual Genealogy of Deep Neural Networks Qianwen Wang, Jun Yuan, Shuxin Chen, Hang Su, Huamin Qu, Shixia Liu IEEE Transactions on Visualization and Computer Graphics. 26(11): 3340-3352, 2020. Paper Demo åºäºä¼å å­¦ä¹ çäº¤äºå¼ç¹å¾éæ©æ¹æ³ éé¿å»ºï¼å§æµï¼é·å¨ï¼åä¸é ä¸­å½ç§å­¦. 50(6): 794-812, 2020. Paper Video 2019 Interactive Correction of Mislabeled Training Data Shouxing Xiang, Xi Ye, Jiazhi Xia, Jing Wu, Yang Chen, Shixia Liu IEEE VIS(VAST). 2019. Paper Video An Interactive Method to Improve Crowdsourced Annotations Shixia Liu, Changjian Chen, Yafeng Lu, Fangxin Ouyang, Bin Wang IEEE Transactions on Visualization and Computer Graphics. 25(1): 235-245, ",
  "content_length": 26055,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:41"
}