{
  "name": "Shixuan Sun",
  "homepage": "https://shixuansun.github.io",
  "status": "success",
  "content": "Biography - Shixuan’s Homepage Shixuan Sun 孙 世 轩Tenure-Track Associate Professor, Shanghai Jiao Tong University Follow Shanghai, China Email Github Google ScholarShixuan Sun is currently a Tenure-Track Associate Professor at the Department of Computer Science and Engineering, Shanghai Jiao Tong University. He is also a member of the EPCC Lab. His research interests are in parallel and distributed computing, database systems, machine learning and data-intensive applications.He received his Ph.D. in Computer Sciences from the Department of Computer Science and Engineering, Hong Kong University of Science and Technology (HKUST) in 2020, supervised by Prof. Qiong Luo. Prior to that, he got his M.S and B.S. in Computer Sciences from the School of Software Engineering, Tongji University in 2014 and 2011 respectively. From 2020 to 2023, he worked as a research fellow at the School of Computing, National University of Singapore, supervised by Prof. Bingsheng He. Additionally, he worked as a Software Development Engineer at Microsoft (Shanghai) from 2014 to 2015.ContactEmail: [sunshixuan] AT [sjtu] DOT [edu] DOT [cn]News[2025.6]: LiquidGEMM: Hardware-Efficient W4A8 GEMM for High Performance LLM Serving was accepted to SC’25. Congratulations to Mr. Huanqi Hu.[2025.6]: RapidStore: An Efficient Dynamic Graph Storage System for Concurrent Queries was accepted to VLDB’25. Congratulations to Mr. Chiyu Hao and Ms. Jixian Su.[2025.6]: Congratulations to Mr. Chiyu Hao on receiving the Outstanding Bachelor Thesis Award from the School of Computer Science, awarded to the top 1% of theses.[2025.5]: Honored to receive the Outstanding PC Award at ICDE 2025.[2025.2]: GES: High-Performance Graph Processing Engine and Service in Huawei was accepted to SIGMOD’25. Congratulations to Mr. Sen Gao.[2024.11]: Revisiting the Design of In-Memory Dynamic Graph Storage was accepted to SIGMOD’25. Congratulations to Ms. Jixian Su and Mr. Chiyu Hao.Open PositionsI’m looking for self-motivated PhD students, master’s students, and research assistants to join my group. If you’re interested in building high-performance, large-scale data processing and machine learning systems through algorithm-system co-design on modern hardware, please email me your CV. We currently have openings in the following research areas: 1. Large-scale data processing systems on emerging computing architectures, including serverless and disaggregated environments on data centers. 2. Efficient and effective retrieval-augmented generation (RAG) techniques, such as GraphRAG and vector databases. 3. High-performance LLM inference system deployment on cloud and edge platforms. 4. Accelerating Zero-Knowledge Proof systems with heterogeneous computing.Professional ServicesWeb Chair for APSys 2022PC Member for EuroSys 2026, ICDE 2026, SC 2025, VLDB 2025, ICDE 2024, IPDPS 2024, EDBT 2023, CCGrid 2021, HiPC 2021, 2022, 2023Invited Reviewer for TODS, VLDBJ, TKDE, ACM Transactions on Storage, ICDCS 2021, ACM Computing Surveys, DMKDTeaching ExperiencesLecturer, Shanghai Jiao Tong University CS1501 Programming Concepts and Methods (C++)Lecturer, Shanghai Jiao Tong University CS2310 Operating SystemGuest Lecturer, HKUST(GZ) DSAA6000D Graph Processing and Analytics, Accelerating Subgraph Query Processing on a Single Machine (2.5 hours tutorial in Sep 2022) [Slides]Teaching Assistant, HKUST COMP5311 Database Architecture and ImplementationTeaching Assistant, HKUST MSBD5009 Parallel ProgrammingHonors & AwardsOutstanding PC Award at ICDE 2025The Championship of Alibaba POLARDB High Performance Competition (1/1808) [News][Code][Slides]Hong Kong PhD Fellowship Award 2015-2019Outstanding Graduate of Shanghai 2011,2014China National Scholarship 2009,2013Google Excellent Student Scholarship 2010",
  "content_length": 3774,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:39"
}