{
  "name": "Shiyi Wei",
  "homepage": "http://utdallas.edu/~swei",
  "status": "success",
  "content": "Shiyi Wei's Homepage Shiyi Wei Associate Professor Department of Computer Science The University of Texas at Dallas Office:  ECSS 4.206 Phone:  (972) 883-4167 E-mail:  swei@utdallas.edu Short Biography I am an associate professor in the Computer Science Department at The University of Texas at Dallas. I received my Ph.D. degree in Computer Science from Virginia Tech and B.E. degree in Software Engineering from Shanghai Jiao Tong University. I spent two years as a post-doctoral associate affiliated with the PLUM lab in the Computer Science Department at the University of Maryland, College Park. My research interests span the areas of Programming Languages, Software Engineering and Security. The goal of my research is to improve the security and reliability of real-world software via automated software analysis and testing. I received NSF CAREER Award in 2021 and my work has been supported by NSF (1, 2, 3, 4, 5) and AWS cloud credits for research program. My research has been recognized with multiple best paper awards and my service has been recognized with several distinguished reviewer awards. RA positions available: I am looking for students who have strong insterets in compiler, program anlaysis, fuzz testing, and the applications in security and machine learning. Feel free to send me an email if you are insterested. Current projects in my group: Static/dynamic analysis of configurable systems, and web/mobile applications. Machine learning-based static analysis. Evaluation and benchmarking of static analysis and fuzz testing. Selected Publications (All) Variability-Aware Fuzzing. Meah Tahmeed Ahmed, Arnab Dev, and Shiyi Wei. ACM/IEEE International Conference on Software Engineering (ICSE), 2026. Is Call Graph Pruning Really Effective? An Empirical Re-evaluation. Mohammad Rafieian, Vlad Birsan, Kunal Katiya, Dylan Zhong, and Shiyi Wei. ACM/IEEE International Conference on Software Engineering (ICSE), 2026. SymFuzz: Symbolic Execution Guided Hardware Fuzzing. Samit Shahnawaz Miftah, Amisha Srivastava, Hyunmin Kim, Shiyi Wei, and Kanad Basu. IEEE/ACM International Symposium on Microarchitecture (MICRO), 2025. Program Feature-based Benchmarking for Fuzz Testing. Miao Miao, Sriteja Kummita, Eric Bodden, and Shiyi Wei. ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2025. Teaching AI the 'Why' and 'How' of Software Vulnerability Fixes. Amiao Gao, Zenong Zhang, Simin Wang, Liguo Huang, Shiyi Wei, and Vincent Ng. ACM International Conference on the Foundations of Software Engineering (FSE), 2025. An Extensive Empirical Study of Nondeterministic Behavior in Static Analysis Tools. Miao Miao, Austin Mordahl, Dakota Soles, Alice Beideck, and Shiyi Wei. ACM/IEEE International Conference on Software Engineering (ICSE), 2025. ECSTATIC: An Extensible Framework for Testing and Debugging Configurable Static Analysis. Austin Mordahl, Zenong Zhang, Dakota Soles, and Shiyi Wei. ACM/IEEE International Conference on Software Engineering (ICSE), 2023. DyCL: Dynamic Neural Network Compilation Via Program Rewriting and Graph Optimization. Simin Chen, Shiyi Wei, Cong Liu, and Wei Yang. ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2023. FIXREVERTER: A Realistic Bug Injection Methodology for Benchmarking Fuzz Testing. Zenong Zhang, Zach Patterson, Michael Hicks, and Shiyi Wei. USENIX Security Symposium, 2022. Distinguished Paper Award SugarC: Scalable Desugaring of Real-World Preprocessor Usage into Pure C. Zach Patterson, Zenong Zhang, Brent Pappas, Shiyi Wei, and Paul Gazzillo. ACM/IEEE International Conference on Software Engineering (ICSE), 2022. Retrieving Data Constraint Implementations Using Fine-Grained Code Patterns. Juan Manuel Florez, Jonathan Perry, Shiyi Wei, and Andrian Marcus. ACM/IEEE International Conference on Software Engineering (ICSE), 2022. SATune: A Study-Driven Auto-Tuning Approach for Configurable Software Verification Tools. Ugur Koc, Austin Mordahl, Shiyi Wei, Jeffrey S. Foster, and Adam Porter. IEEE/ACM International Conference on Automated Software Engineering (ASE), 2021. The Impact of Tool Configuration Spaces on the Evaluation of Configurable Taint Analysis for Android. Austin Mordahl, and Shiyi Wei. ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2021. An Empirical Study of Real-World Variability Bugs Detected by Variability-Oblivious Tools. Austin Mordahl, Jeho Oh, Ugur Koc, Shiyi Wei and Paul Gazzillo. ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), 2019. Evaluating Fuzz Testing. George T. Klees, Andrew Ruef, Benjamin Cooper, Shiyi Wei, and Michael Hicks. ACM Conference on Computer and Communications Security (CCS), 2018. Winner of the 7th annual NSA Best Scientific Cybersecurity Paper competition. Decomposition Instead of Self-Composition for Proving the Absence of Timing Channels. Timos Antonopoulos, Paul Gazzillo, Michael Hicks, Eric Koskinen, Tachio Terauchi, Shiyi Wei. ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI), 2017. Revamping JavaScript Static Analysis via Localization and Remediation of Root Causes of Imprecision. Shiyi Wei, Omer Tripp, Barbara G. Ryder and Julian Dolby. ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE), 2016. Teaching CS 6353: Compiler Construction (Spring 2021, Spring 2022, Spring 2023, Spring 2024, Spring 2025) CS 4386: Compiler Design (Fall 2020, Fall 2021, Fall 2022, Fall 2023, Fall 2025) CS/SE 6356: Software Maintenance Evolution and Re-Engineering (Spring 2024, Spring 2025) CS/SE 7301: Program Analysis and its Applications (Spring 2020) CS/SE 6301: Program Analysis and its Applications (Spring 2018, Spring 2019) CE/CS/SE 3354: Software Engineering (Fall 2017, Fall 2018, Fall 2019) Students Current Students Jaeseong Lee (Ph.D. student, since August 2021, co-advised with Gopal Gupta) Vlad Birsan (Ph.D. student, since August 2022) Miao Miao (Ph.D. student, since Janurary 2023, The Jonsson School Best Teaching Assistant Award in 2024, winner of ICSE 2025 ACM student research competition, Mary and Richard Templeton Graduate Fellowship) Meah Tahmeed Ahmed (Ph.D. student, since August 2023) Mohammad Rafieian (Ph.D. student, since August 2023) Cynthia Marie Rivera Sánchez (Ph.D. student, since August 2024) Safeer Ahmed Varikodan (M.S. student, since May 2025) Kishan Rakesh (M.S. student, since May 2025) Alumni Austin Mordahl (Ph.D., May 2018-August 2024, NSF Graduate Research Fellowship, winner of ICSE 2019 ACM student research competition, first job: Assistant Professor at University of Illinois Chicago) Zenong Zhang (Ph.D., Janurary 2019-March 2024, USENIX Security '22 Distinguished Paper, first job: Software Engineer at Google) Zach Patterson (Ph.D., September 2019-August 2023, USENIX Security '22 Distinguished Paper, first job: Applied Scientist at Amazon AWS) Dakota Soles (Undergraduate student, June 2020-December 2022; Ph.D. student, Janurary 2023-August 2023) Maliha Sarwat (M.S., August 2018-December 2020) Recent Program Committee Services USENIX Security 2026, ICSE 2026, CCS 2025, ASE 2025, FSE 2025, ICST 2025, USENIX Security 2025, ISSTA 2025, ICSE 2025, CCS 2024 (Top Reviewer), SecDev 2024, ASE 2024 (Distinguished Reviewer), ISSTA 2024, ISSTA 2023, ESEC/FSE 2023 (Distinguished Reviewer), ICSE 2023 Last updated: October 21, 2025",
  "content_length": 7438,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:42"
}