{
  "name": "Shiyu Chang",
  "homepage": "https://code-terminator.github.io",
  "status": "success",
  "content": "Shiyu Chang | UC Santa Barbara Shiyu Chang Associate Professor, Ph.D. UC Santa Barbara chang87 [AT] ucsb.edu Bio Shiyu Chang is an Associate Professor of Computer Science at UC Santa Barbara. His research focuses on machine learning, with applications in natural language processing and computer vision. Before joining UC Santa Barbara, Shiyu was a research scientist at the MIT-IBM Watson AI Lab, where he worked closely with Prof. Regina Barzilay and Prof. Tommi Jaakkola. He earned both his B.S. and Ph.D. from the University of Illinois at Urbana-Champaign. His Ph.D. advisor is Prof. Thomas S. Huang. Students Ph.D. Master Undergrad Ziyan Jiang ( 2025 - ) Congrui Du ( 2025 - ) Guanyu Yao ( 2024 - ) Jingbo Yang ( 2024 - ) Li An ( 2024 - ) Xinyi Gao ( 2024 - ) Jiabao Ji ( 2022 - ) Yujian Liu ( 2022 - ) Qiucheng Wu ( 2021 - ) Bairu Hou ( 2021 - ) Guanhua Zhang ( 2021 - 2023 ): now Ph.D. at Max Planck Institute for Intelligent Systems Jiajun Wang ( 2023 ) Luxiang Zhang ( 2025 - ) Congrui Du ( 2024 - 2025 ) Chris Riney ( 2023 - 2025 ) Edwin Yee ( 2022 - 2024 ) Yifan Ke ( 2023 ) Liliana Nguyen ( 2022 - 2023 ) Shamita Gurusu ( 2022 - 2023 ) Hugo Lin ( 2022 - 2023 ) Wesley Truong ( 2022 - 2023 ) Zhiyuan Ren ( 2021 - 2022 ) Selected Publications Full publications on Google Scholar. ‡ indicates authors with equal contribution. ☆ indicates my students or interns. Recent At UCSB Before UCSB Defending LLM Watermarking Against Spoofing Attacks with Contrastive Representation Learning Li An☆, Yujian Liu☆, Yepeng Liu, Yang Zhang, Yuheng Bu, Shiyu Chang COLM'25: Conference on Language Modelling Paper Code VSP: Assessing the Dual Challenges of Perception and Reasoning in Spatial Planning Tasks for VLMs Qiucheng Wu☆, Handong Zhao, Michael Saxon, Trung Bui, William Yang Wang, Yang Zhang, Shiyu Chang ICCV'25: International Conference on Computer Vision Paper Code Instruction-Following Pruning for Large Language Models Bairu Hou☆, Qibin Chen, Jianyu Wang, Guoli Yin, Chong Wang, Nan Du, Ruoming Pang, Shiyu Chang, Tao Lei ICML'25: International Conference on Machine Learning Paper Fictitious Synthetic Data Can Improve LLM Factuality via Prerequisite Learning Yujian Liu☆, Shiyu Chang, Tommi S. Jaakkola, Yang Zhang ICLR'25: International Conference on Learning Representations Paper Code A Probabilistic Framework for LLM Hallucination Detection via Belief Tree Propagation Bairu Hou☆, Yang Zhang, Jacob Andreas, Shiyu Chang NAACL'25: Annual Conference of the North American Chapter of the Association for Computational Linguistics Paper Code Reversing the Forget-Retain Objectives: An Efficient LLM Unlearning Framework from Logit Difference Jiabao Ji☆, Yujian Liu☆, Yang Zhang, Gaowen Liu, Ramana Rao Kompella, Sijia Liu, Shiyu Chang NeurIPS'24: Advances in Neural Information Processing Systems Paper Code Revisiting Who's Harry Potter: Towards Targeted Unlearning from a Causal Intervention Perspective Yujian Liu☆, Yang Zhang, Tommi S. Jaakkola, Shiyu Chang EMNLP'24: Conference on Empirical Methods in Natural Language Processing Paper Code Defending LLM Watermarking Against Spoofing Attacks with Contrastive Representation Learning Li An☆, Yujian Liu☆, Yepeng Liu, Yang Zhang, Yuheng Bu, Shiyu Chang COLM'25: Conference on Language Modelling Paper Code VSP: Assessing the Dual Challenges of Perception and Reasoning in Spatial Planning Tasks for VLMs Qiucheng Wu☆, Handong Zhao, Michael Saxon, Trung Bui, William Yang Wang, Yang Zhang, Shiyu Chang ICCV'25: International Conference on Computer Vision Paper Code Instruction-Following Pruning for Large Language Models Bairu Hou☆, Qibin Chen, Jianyu Wang, Guoli Yin, Chong Wang, Nan Du, Ruoming Pang, Shiyu Chang, Tao Lei ICML'25: International Conference on Machine Learning Paper Fictitious Synthetic Data Can Improve LLM Factuality via Prerequisite Learning Yujian Liu☆, Shiyu Chang, Tommi S. Jaakkola, Yang Zhang ICLR'25: International Conference on Learning Representations Paper Code A Probabilistic Framework for LLM Hallucination Detection via Belief Tree Propagation Bairu Hou☆, Yang Zhang, Jacob Andreas, Shiyu Chang NAACL'25: Annual Conference of the North American Chapter of the Association for Computational Linguistics Paper Code Reversing the Forget-Retain Objectives: An Efficient LLM Unlearning Framework from Logit Difference Jiabao Ji☆, Yujian Liu☆, Yang Zhang, Gaowen Liu, Ramana Rao Kompella, Sijia Liu, Shiyu Chang NeurIPS'24: Advances in Neural Information Processing Systems Paper Code Revisiting Who's Harry Potter: Towards Targeted Unlearning from a Causal Intervention Perspective Yujian Liu☆, Yang Zhang, Tommi S. Jaakkola, Shiyu Chang EMNLP'24: Conference on Empirical Methods in Natural Language Processing Paper Code Defending Large Language Models against Jailbreak Attacks via Semantic Smoothing Jiabao Ji☆ ‡, Bairu Hou☆ ‡, Alexander Robey‡, George J. Pappas, Hamed Hassani, Yang Zhang, Eric Wong, Shiyu Chang ArXiv Preprint Paper Code Decomposing Uncertainty for Large Language Models through Input Clarification Ensembling Bairu Hou☆, Yujian Liu☆, Kaizhi Qian, Jacob Andreas, Shiyu Chang, Yang Zhang ICML'24: International Conference on Machine Learning Paper Code Advancing the Robustness of Large Language Models through Self-Denoised Smoothing Jiabao Ji☆ ‡, Bairu Hou☆ ‡, Zhen Zhang‡, Guanhua Zhang☆ ‡, Wenqi Fan, Qing Li, Yang Zhang, Gaowen Liu, Sijia Liu, Shiyu Chang NAACL'24: Annual Conference of the North American Chapter of the Association for Computational Linguistics Paper Code Correcting Diffusion Generation through Resampling Yujian Liu☆, Yang Zhang, Tommi S. Jaakkola, Shiyu Chang CVPR'24: IEEE Computer Vision and Pattern Recognition Paper Code Improving Diffusion Models for Scene Text Editing with Dual Encoders Jiabao Ji☆ ‡, Guanhua Zhang☆ ‡, Zhaowen Wang, Bairu Hou, Zhifei Zhang, Brian Price, Shiyu Chang TMLR'24: Transactions on Machine Learning Research Paper Code Harnessing the Spatial-Temporal Attention of Diffusion Models for High-Fidelity Text-to-Image Synthesis Qiucheng Wu☆ ‡, Yujian Liu☆ ‡, Handong Zhao, Trung Bui, Zhe Lin, Yang Zhang, Shiyu Chang ICCV'23: International Conference on Computer Vision Paper Code Towards Coherent Image Inpainting Using Denoising Diffusion Implicit Models Guanhua Zhang☆ ‡, Jiabao Ji☆ ‡, Yang Zhang, Mo Yu, Tommi S. Jaakkola, Shiyu Chang ICML'23: International Conference on Machine Learning Paper Code PromptBoosting: Black-Box Text Classification with Ten Forward Passes Bairu Hou☆, Joe O'Connor, Jacob Andreas, Shiyu Chang, Yang Zhang ICML'23: International Conference on Machine Learning Paper Code Uncovering the Disentanglement Capability in Text-to-Image Diffusion Models Qiucheng Wu☆, Yujian Liu☆, Handong Zhao, Ajinkya Kale, Trung Bui, Tong Yu, Zhe Lin, Yang Zhang, Shiyu Chang CVPR'23: IEEE Computer Vision and Pattern Recognition Paper Code TextGrad: Advancing Robustness Evaluation in NLP by Gradient-Driven Optimization Bairu Hou☆, Jinghan Jia‡, Yihua Zhang‡, Guanhua Zhang☆ ‡, Yang Zhang, Sijia Liu, Shiyu Chang ICLR'23: International Conference on Learning Representations Paper Code Fairness Reprogramming Guanhua Zhang☆ ‡, Yihua Zhang‡, Yang Zhang, Wenqi Fan, Qing Li, Sijia Liu, Shiyu Chang NeurIPS'22: Advances in Neural Information Processing Systems Paper Code Revisiting and Advancing Fast Adversarial Training Through The Lens of Bi-Level Optimization Yihua Zhang‡, Guanhua Zhang☆ ‡, Prashant Khanduri, Mingyi Hong, Shiyu Chang, Sijia Liu ICML'22: International Conference on Machine Learning Paper Code Learning Stable Classifiers by Transferring Unstable Features Yujia Bao, Shiyu Chang, Regina Barzilay ICML'22: International Conference on Machine Learning Paper Code ContentVec: An Improved Self-Supervised Speech Representation by Disentangling Speakers Kaizhi Qian‡, Yang Zhang‡, Heting Gao, Junru Ni, Cheng-I Lai, David Cox, Mark A. Hasegawa-Johnson, Shiyu Chang ICML'22: International Conference on Machine Learning Paper Code Data-Efficient Double-Win Lottery Tickets from Robust Pre-training Tianlong Chen, Zhenyu Zhang, Sijia Liu, Yang Zhang, Shiyu Chang, Zhangyang Wang ICML'22: International Conference on Machine Learning Paper Code Linearity Grafting: How Neuron Pruning Helps Certifiable Robustness Tianlong Chen, Huan Zhang, Zhenyu Zhang, Shiyu Chang, Sijia Liu, Pin-Yu Chen, Zhangyang Wang ICML'22: International Conference on Machine Learning Paper Code DiffCSE: Difference-based Contrastive Learning for Sentence Embeddings Yung-Sung Chuang, Rumen Dangovski, Hongyin Luo, Yang Zhang, Shiyu Chang, Marin Soljačić, Shang-Wen Li, Wen-tau Yih, Yoon Kim, James Glass NAACL'22: Annual Conference of the North American Chapter of the Association for Computational Linguistics Paper Code Quarantine: Sparsity Can Uncover the Trojan Attack Trigger for Free Tianlong Chen‡, Zhenyu Zhang‡, Yihua Zhang‡, Shiyu Chang, Sijia Liu, Zhangyang Wang CVPR'22: IEEE Computer Vision and Pattern Recognition Paper Code Query and Extract: Refining Event Extraction as Type-oriented Binary Decoding Sijia Wang, Mo Yu, Shiyu Chang, Lichao Sun, Lifu Huang ACL-Finding'22: Annual Meeting of the Association for Computational Linguistics Paper Code How to Robustify Black-Box ML Models? A Zeroth-Order Optimization Perspective Yimeng Zhang, Yuguang Yao, Jinghan Jia, Jinfeng Yi, Mingyi Hong, Shiyu Chang, Sijia Liu ICLR'22: International Conference on Learning Representations Paper Code Adversarial Support Alignment Shangyuan Tong☆ ‡, Timur Garipov‡, Yang Zhang, Shiyu Chang, Tommi S. Jaakkola ICLR'22: International Conference on Learning Representations Paper Code Optimizer Amalgamation Tianshu Huang, Tianlong Chen, Sijia Liu, Shiyu Chang, Lisa Amini, Zhangyang Wang ICLR'22: International Conference on Learning Representations Paper Code Understanding Interlocking Dynamics of Cooperative Rationalization Mo Yu‡, Yang Zhang‡, Shiyu Chang‡, Tommi S. Jaakkola NeurIPS'21: Advances in Neural Information Processing Systems Paper Code TransGAN: Two Pure Transformers Can Make One Strong GAN, and That Can Scale",
  "content_length": 14614,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:40"
}