{
  "name": "Shizhu He",
  "homepage": "https://nlpr.ia.ac.cn/cip/shizhuhe",
  "status": "success",
  "content": "Shizhu He 何世柱 Toggle navigation Shizhu's Homepage Home Publications Associate Researcher Research Group of Speech and Language Technology, National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences Office: Room 711, Intelligence Building, Institute of Automation, Chinese Academy of Sciences, Zhongguancun East Road 95#, Beijing, China, 100190 Email: shizhu.he(at)nlpr(dot)ia(dot)ac(dot)cn I am an Associate Researcher in National Laboratory of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Sciences. I obtained my Ph.D. in Computer Science from NLPR in 2016. My advisor is Prof. Jun Zhao. News I have four papers about Knowledge Reasoning, Question Answering and Conversation accepted by ACL 2023. I have one demo paper about Conversation accepted by EMNLP 2022. I have two papers about Question Answering and Knowlege Reasoning accepted by COLING 2022. I have two papers about Question Answering accepted by ACL 2022. I have one paper about Conversation accepted by EMNLP 2021. I have one paper about Pre-trained Language Model accepted by COLING 2020. I have three papers about Conversation and Relation Extraction accepted by EMNLP 2019 and CoNLL 2019. I have two papers about Conversation and Question Answering accepted by ACL 2019. I have one long paper about Conversation accepted by AAAI 2019. I have one long paper about Relation Extraction accepted by ACL 2018. I obtain CCF-Tencent Open Research Fund 2018. I obtain DiDi GAIA Collborative Research Funds for Young Scholars 2018. I have one long paper about Question Answering accepted by IJCAI 2018. I have one long paper about Relation Extraction accepted by AAAI 2018. I obtain Huawei Innovation Research Program (HIRP) 2017. My select project is \"Automatic rule extraction from textual data\". I have two long papers about Question Answering accepted by ACL 2017. I have one paper about Gaokao accepted by ECAL 2017.",
  "content_length": 1944,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:40"
}