{
  "name": "Shizhe Zhou",
  "homepage": "https://shizhezhou.github.io",
  "status": "success",
  "content": "Shizhe Zhou home page Associate Professor College of Computer Science and Electronic Engineering Hunan University I focus my interests in computer graphics, computational geometrics and GPU-based algorithms. I did a postdoc in the School of Math, USTC from 2012-2015. Before that I did a postdoc at INRIA France, working with Dr.Sylvain Lefebvre's on digital content synthesis in 2012. I obtained a PH.D of Applied Mathematics from Zhejiang Univ. in 2011. I worked on a research project in City Univ. of Hong Kong in 2010. Email : shizhe@hnu.edu.cn shizhezhou2014@gmail.com Office : College of Computer Science and Electronic Engineering, Software Building, Hunan University, Lushan Nan Road, Changsha, Hunan Province, P.R.China, 410082. Topics: Computer graphics related algorithm, Network Optimization(continuous or discrete),Synthesis(Vector or pixel, both a lot of fun:)), Image, Physical Simulation. Also i am open minded to other topics . NEWS: I am looking for students[PHD position opening!]. Please contact me as soon as possible! -----------------------------------------------------------Publications-------------------------------------------------------------- 2023 Vision2Touch: Imaging Estimation of Surface Tactile Physical Properties. Jie Chen,Shizhe Zhou. ICCASP, 2023. (paper, poster) 2022 Novel View Synthesis of Transparent Object from a Single Image. Shizhe Zhou, Zezu Wang, Dongwei Ye. Computer Graphics Forum, 2022. (webpage, paper) 2020 Accurate Estimation of Body Height from a Single Kinect Depth Image via a Four-Stage Developing Network. Fukun Yin*, Shizhe Zhou* (*joint 1st authors).CVPR,2020. (paper) Sketch2Relief: Generating Bas-relief from Sketches with Deep Generative Networks. Shizhe Zhou, Zeyu Liu. ICTAI, 2020. (paper) 2019 DeepShapeSketch : Generating hand drawing sketches from 3D objects.Meijuan Ye, Shizhe Zhou Hongbo Fu. IJCNN, 2019. (paper) 2018 Interactive Sketch-Based Normal Map Generation with Deep Neural Networks. Wanchao Su, Dong Du, Xin Yang, Shizhe Zhou Hongbo Fu. i3D, 2018. (paper, video) PatchSwapper: A novel real-time single-image editing technique by region-swapping. Shizhe Zhou, Chengfeng Zhou, Yi Xiao, Guanghua Tan. Computers & Graphics, 2018, 47(9). (webpage) Automatic Image Style Transfer Using Emotion-Palette. Jing Huang, Shizhe Zhou* , Xianyi Zhu, Yiwen Li, Chengfeng Zhou.International Conference on Digital Image Processing, 2018. (paper) 2017 Face sorting and stripe texture mapping of triangle mesh based on spectral decomposition(in Chinese). Yan Li, Shizhe Zhou*, Jiansong Deng. Journal of Univ. of Sciene and Technology, 2017, 47(9). (paper) 2016 Efficient Simulation of Water Puddle(in Chinese). Jianfang Li, Shizhe Zhou*, Yan Li, Ligang Liu. Journal of Computer-Aided Design & Computer Graphics, 2016, 23(11). (paper, demo) Adaptive Tearing of Crumpled Thin Sheet(in Chinese). Qiqi Jiang, Shizhe Zhou*, Liqiang Shi.Journal of Univ. of Sciene and Technology, 2016, 46(11). (paper) 2014 Topology-constrained Synthesis of Vector Patterns. Shizhe Zhou, Changyun Jiang, Sylvain Lefebvre. ACM SIGGRAPH Asia 2014. ACM Transactions on Graphics,33(6), Article No.215:1-11,2014 [webpage] Real-time dynamic and pressure-sensitive brush rendering. Liqiang Shi, Shizhe Zhou*. The 4th International Conference on Electronics,Communications and Networks,2014.[paper] 2013 By–example synthesis of curvilinear structured patterns. Shizhe Zhou, Anass Lasram, Sylvain Lefebvre*. Computer Graphics Forum, 32(2), 2013. (Proc.of Eurographics 2013). [paper, overlapping avoidance, video, more results] 2011 Animated Construction of Line Drawings. Hongbo Fu, Shizhe Zhou*, Ligang Liu, Niloy Mitra. ACM SIGGRAPH Asia 2011. ACM Transactions on Graphics,30(6), Article No.133:1-10,2011.[video, Viewer's software and code, webpage] 2010 Parametric Reshaping of Human Bodies in Images. Shizhe Zhou, Hongbo Fu, Ligang Liu*, Daniel Cohen-Or, Xiaoguang Han. ACM SIGGRAPH 2010. ACM Transactions on Graphics, 29(4), Article No.126:1-10,2010. [software, webpage] 2009 Realtime Digital Bas-Relief Modeling(in Chinese). Shizhe Zhou, Ligang Liu*. Journal of Computer-Aided Design & Computer Graphics, 2010, 22(3). (paper, Editing session: 1, 2, img) Feature-Aligned Shape Texturing. Kai Xu*, Daniel Cohen-Or, Tao Ju, Ligang Liu*, Hao Zhang, Shizhe Zhou and Yueshan Xiong. ACM SIGGRAPH Aisa 2009. ACM Transactions on Graphics (TOG) ,2009. (webpage) 2007 Realtime Fluid Simulation Based on Multigrid Method(in Chinese). Shizhe Zhou, Jiaju Man*. Journal of Computer-Aided Design & Computer Graphics, 2007,19(7). (paper, video) ---------------------------------------------------------Teaching------------------------------------------------------------ 00125401 algorithm fundamentals (2013 Feb-July, 2014 Feb-July) MA06424 selected topics in geometric modeling (2012 Sep-2013 Jan, 2014 Sep-2015 Feb) @All Rights Reserved, Shizhe Zhou, HNU , 2017.",
  "content_length": 4885,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:40"
}