{
  "name": "Shoaib Akram 0001",
  "homepage": "https://cs.anu.edu.au/people/shoaib-akram",
  "status": "success",
  "content": "Shoaib Akram | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Research Storage systems for data-intensive applications Computer architecture Performance analysis Biography Shoaib Akram is a lecturer in the ANU School of Computing at the Australian National University, Canberra. He obtained his Ph.D. in Computer Science and Engineering from Ghent University (Belgium) under the advisement of Lieven Eeckhout. He also holds an M.S. in Electrical and Computer Engineering from the University of Illinois at Urbana-Champaign in the USA. He received the Fulbright Scholarship from the U.S. government and a Marie Curie Fellowship from the EU Commission. His research interests include computer systems in general and computer architecture, hardware/software interface, and optimizing storage-intensive applications for modern data-centric hardware in particular. He leads the ANU’s Vertically Integrated Computer Systems (VICS) research group advising Ph.D. and undergraduate students. His work has been published in top-tier computer architecture, operating systems, programming languages, and performance analysis conferences, including PLDI, ASPLOS, PACT, ISPASS, and SIGMETRICS. He has been a program committee member of prominent conferences in his area, including ISCA, MICRO, HPCA, ASPLOS, and ISPASS. His work has received nominations for a Best Paper award at multiple conferences and won the Memorable Paper Award. Between 2020 and 2024, he introduced courses on advanced computer architecture at ANU and convened and significantly restructured the foundational computer systems curriculum. He currently teaches ANU’s introductory computer architecture course to the 400+ College of Computing and Engineering students and an advanced computer architecture course to selected students. He previously taught systems, networks, and concurrency to 250+ students and a special topics course on computer microarchitecture. Teaching (current) Computer Architecture Advanced Topics in Computer Systems: Parallel Computer Architecture Academic and Research Awards NVMW Memorable Paper Award 2019 HiPEAC Paper Award for ASPLOS 2023 HiPEAC Paper Award for PLDI 2018 Nominated for Best Paper Awards at ISMM 2023 Nominated for Best Paper Awards at ISPASS 2016 Marie Curie Initial Training Networks Fellowship (2010-2012) Fulbright Scholarship (2007-2009) Rigorously Reviewed Publications (Selected) A. Hasnat, S. Akram, “SPIRIT: Scalable and Persistent In-Memory Indices for Real-Time Search,” ACM Transactions on Architecture and Code Optimization (TACO), 2025 I. Kolokasis, G. Evdorou, S. Akram, A. Papagiannis, F. Zakkak, C. Kozanitis, P. Pratikakis, A. Bilas, “TeraHeap: Exploiting Flash Storage for Mitigating DRAM Pressure in Managed Big Data Frameworks,” ACM Transactions on Programming Languages and Systems (TOPLAS), 2025 Aditya Chilukuri and Shoaib Akram, “Analyzing and Improving the Scalability of In Memory Indices for Managed Search Engines,” ACM SIGPLAN International Symposium on Memory Management (ISMM), 2023 I. Kolokasis, G. Evdorou, S. Akram, A. Papagiannis, F. Zakkak, C. Kozanitis, P. Pratikakis, A. Bilas, “TeraHeap: Reducing Memory Pressure in Managed Big Data Frameworks,” Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2023 W. Liu, W. Heirman, S. Eyerman, S. Akram, and L. Eeckhout, “Scale-Model Architectural Simulation,” IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS), 2022 S. Akram, “Performance Evaluation of Intel Optane Memory for Managed Workloads,” ACM Transactions on Architecture and Code Optimization (TACO), 2021 W. Liu, S. Akram, and L. Eeckhout, “Reliability-Aware Garbage Collection for Hybrid DRAM-HBM Memories,” ACM Transactions on Architecture and Code Optimization (TACO), 2021 S. Akram, “Exploiting Intel Optane Persistent Memory for Full Text Search,” ACM SIGPLAN International Symposium on Memory Management (ISMM), 2021 S. Pestel, S. Steen, S. Akram, and L. Eeckhout, “RPPM: Rapid Performance Prediction of Multithreaded Workloads on Multicore Processors,” IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS), 2019 S. Akram, J. Sartor, K. McKinley and L. Eeckhout, “Emulating and Evaluating Hybrid Memory for Managed Languages on NUMA Hardware,” IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS), 2019 S. Akram, J. Sartor, K. McKinley and L. Eeckhout, “Crystal Gazer: A Profile-Driven Garbage Collector to Manage Hybrid Memories,” ACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), 2019 S. Akram, J. Sartor, K. McKinley and L. Eeckhout, “Write-Rationing Garbage Collection for Hybrid Memories,” ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI), 2018 S. Akram, J. Sartor, and L. Eeckhout, “DEP+BURST: Online DVFS Performance Prediction for Energy-Efficient Managed Language Execution,” IEEE Transactions on Computers (TC), 2017 S. Akram, J. Sartor, and L. Eeckhout, “DVFS Performance Prediction for Managed MultiThreaded Applications,” IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS), 2016 S. Akram, J. Sartor, K. Van Craeynest, W. Heirman, and L. Eeckhout, “Boosting the Priority of Garbage: Scheduling Collection on Heterogeneous Multicore Processors,” ACM Transactions on Architecture and Code Op timization (TACO), 2016 Service on Program Committees (Recent) Program Committee, International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2026 Program Committee, IEEE/ACM International Symposium on Microarchitecture (MICRO), 2025 Program Committee, Scalable Optimization for Efficient and Adaptive Foundation Models (SCOPE), 2025 (workshop collocated with ICLR) Program Co-Chair, Virtual Machines and Language Implementations, 2025 (workshop collocated with SPLASH) Program Committee, International Symposium on Memory Management (ISMM), 2025 Invited Reviewer (multiple papers, 2024-2025), ACM Transactions on Architecture and Code Optimization (TACO) Program Committee, International Symposium on High-Performance Computer Architecture (HPCA), 2025 Program Committee, International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2025 External Program Committee, IEEE/ACM International Symposium on Microarchitecture (MICRO), 2024 Program Committee, ACM SIGPLAN International Conference on Managed Programming Languages and Runtimes (MPLR), 2024 Program Committee, International Symposium on Computer Architecture (ISCA), 2024 Program Committee, International Symposium on Performance Analysis of Systems and Software (ISPASS), 2024 ACM Student Research Competition (SRC) Selection Committee, International Conference on Parallel Architectures and Compilation Techniques (PACT), 2023 Program Committee, IEEE/ACM International Symposium on Microarchitecture (MICRO), 2023 Program Committee, High Performance Computational Biology (HiCOMB), 2023 (workshop collocated with IPDPS) Program Committee, Modern Language Runtimes, Ecosystems, and VMs (MoreVMs), 2023 (workshop collocated with <Programming>) Program Committee, International Symposium on Memory Management (ISMM), 2023 ACM Student Research Competition (SRC) Selection Committee, International Conference on Parallel Architectures and Compilation Techniques (PACT), 2022 External Expert Reviewer, ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA), 2022 Program Committee, IEEE/ACM International Symposium on Microarchitecture (MICRO), 2022 Program Committee, International Symposium on High-Performance Computer Architecture (HPCA), 2023 Program Committee, International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2023 Program Committee, International Symposium on Memory Management (ISMM), 2022 Program Committee, International Symposium on Performance Analysis of Systems and Software (ISPASS), 2022 External Review Committee, International Symposium on Computer Architecture (ISCA), 2022 External Review Committee, IEEE/ACM International Symposium on Microarchitecture (MICRO), 2021 Program Committee, International Symposium on Memory Management (ISMM), 2021 External Review Committee, International Symposium on Computer Architecture (ISCA), 2021 External Review Committee, International Symposium on High-Performance Computer Architecture (HPCA), 2021 External Review Committee, ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA), 2020 Shadow Program Committee, European Conference on Computer Systems (EuroSys), 2020 External Review Committee, International Symposium on Computer Architecture (ISCA), 2020 External Review Committee, International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2020 Program Committee, Virtual Machines and Language Implementations (VMIL), 2019 (workshop collocated with SPLASH) Student Volunteer Co-Chair, ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI), 2019 Program Committee, International Symposium on Memory Management (ISMM), 2019 Program Committee, Programming Across the System Stack (PASS), 2019 (workshop collocated with <Programming>) Program Committee, Programming Across the System Stack (PASS), 2018 (workshop collocated with <Programming>) Artifact Evaluation Committee, ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA), 2017 Artifact Evaluation Committee, ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA), 2016 Ar",
  "content_length": 10132,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:47"
}