{
  "name": "Shomir Wilson",
  "homepage": "https://shomir.net",
  "status": "success",
  "content": "Shomir Wilson About Me Who I Am I (he/him) am an associate professor in the Department of Human-Centered Computing and Social Informatics, part of the College of Information Sciences and Technology at Penn State. I am the program coordinator for our B.S. in Information Technology Ethics and Compliance. I also lead the Human Language Technologies Lab, with research spanning natural language processing, privacy, security, and computational social science. Contacting Me You can reach me at shomir _at_ psu.edu, but if you are a student, see the instructions below. If you're taking one of my classes, you might want to check out my Guide for Interacting With Faculty. If you're seeking help with the Information Technology Ethics and Compliance major, speak with your academic advisor and follow their instructions before contacting me. Advising has access to information and options that are specific to your needs. If you're interested in working with me on research, consult my Guide for Joining My Lab for how to contact me and what information to include. My office is E310 Westgate Building. Curriculum Vitae Here it is. Latest News I also sometimes post news and thoughts to Bluesky and LinkedIn. 2025-10-30: Thanks to Penn State's Center for Social Data Analytics for hosting my invited talk \"Natural Language Processing for Privacy Empowerment and Fairness\". 2025-10-28: Thanks to Lycoming College's Lycoming Scholars program for hosting my invited talk \"Case Studies of Sociodemographic Biases by Artificial Intelligence Models\". 2025-10-17: Thanks to West Virginia University's CSEE Department for hosting my invited talk \"Natural Language Processing for Privacy Empowerment and Fairness\". 2025-09-30: The report from the January 2025 Dagstuhl seminar that I led, titled \"Grand Challenges for Research on Privacy Documents\", has been published. 2025-09-25: The Pittsburgh Post-Gazette published my op-ed \"American strength in AI depends on international students\". 2025-09-17: I participated in the Computing Research Association's Congressional Visit Day. Together with other faculty from Pennsylvania universities, I visited the offices of our US representatives and senators in Washington, DC to make the case for funding the National Science Foundation to the greatest extent possible. 2025-09-16: I've been selected to participate in Penn State's Distinguished Honors Faculty Program. I'll give a series of dinner talks about being a researcher abroad, based on my experiences in Australia, Singapore, and the United Kingdom. 2025-09-15: Thanks to Marcos Zampieri for hosting me for an invited talk as part of the LLMs and Applications Seminar at George Mason University. 2025-08-21: I'm featured in an article and a video in the Summer 2025 edition of iConnect, my college's promotional magazine. Thanks to our Office of Marketing and Communications for their work. 2025-07-25: This news story by VTV 1 contains a video clip of me speaking about the White House's AI Action Plan. I appear toward the end of the video with a voiceover translation. 2025-07-21: I wrote an op-ed for the Pennsylvania Capital-Star titled \"Students are unsung heroes of university research, and federal research funding cuts hurt them most\". 2025-06-21: I wrote a Medium article explaining how students are important to STEM research at universities. This is common knowledge within academia, but it's less familiar to the general public. 2025-05-31: I was interviewed by Marlies Gabriele Prinzl of Otherwhere Editing about a wide range of topics including my research, academic careers, travel, books, and photography. 2025-05-15: Thanks to Bucknell University for hosting me to speak at their AI Symposium. 2025-05-05: I will be the inaugural program coordinator for my college's new undergraduate degree in Information Technology Ethics and Compliance. 2025-04-11: I will be a project lead in an upcoming NCEMS working group. Here's a Penn State News article about all of the working groups. 2025-03-27: I'm listed in this Penn State News article as a recent participant in Penn State Emerging Academic Leaders (PSEAL), a professional development program for mid-career faculty interested in leadership positions. 2025-03-11: I gave a keynote talk at the Carnegie Bosch Institute Symposium on Responsible & Sustainable AI in Pittsburgh. 2025-03-02: I've posted Where I'm From, an article that answers a frequent question. 2025-02-07: Congratulations to HLT lab PhD student Pranav Venkit, who passed his thesis defense today! Pranav has accepted an offer to join Salesforce in San Francisco as a Research Scientist. 2025-02-02: I was a live guest on \"Morning Wave\" on South Korea's BeFM (90.5 FM and webcast). I spoke on a segment titled \"DeepSeek Shakes Up AI World\". 2025-01-31: I will serve as the interim program coordinator for IST's Data Sciences degree, from February 1 until May 5. 2025-01-30: Several colleagues and I comment on DeepSeek in this Penn State News article. 2025-01-27: Here's a Penn State News article about the Dagstuhl seminar that I recently organized. 2025-01-18: For the benefit of junior faculty, I've released my narrative statement for tenure and promotion along with some companion notes. 2025-01-18: I was a live guest on \"Let's Talk\" on WFXS (98.7 FM). Host Scott Geesey and I had a 45-minute conversation about artificial intelligence and its impacts on society. 2025-01-10: I led the organizing team of Dagstuhl Seminar 25021: Grand Challenges for Research on Privacy Documents. Thanks to everyone who attended. For older news, check the archive.",
  "content_length": 5581,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:46"
}