{
  "name": "Shouvick Mondal",
  "homepage": "https://sites.google.com/view/shouvick",
  "status": "success",
  "content": "Shouvick MondalSearch this siteEmbedded FilesSkip to main contentSkip to navigationShouvick MondalSET: Software Engineering and Testing Group, AB13/402AAssistant Professor, Computer Science and EngineeringIIT Gandhinagar, Palaj, Gandhinagar - 382355, Gujarat, IndiaEmail: shouvick.mondal.cemk@gmail.com, shouvick.mondal@iitgn.ac.inGoogle Scholar, DBLP, ResearchGate, GitHub Last update: November 2025.Focus areas: Software Engineering using Generative AI, Empirical Software Engineering, Software Testing, Mining Software Repositories.I lead the Software Engineering and Testing Group at CSE, IIT Gandhinagar. Research activities focus on the improvement of existing and the development of new scalable and performant software analysis methodologies to ensure construction of high-quality and trustworthy software systems. Our work has been published and presented in conferences and journals such as ICSE, ASE, FSE, ICSME, ICST, JSS, EMSE, TSE, and TOSEM.Research interests (active):Software Testing, Evolution, and MaintenanceMining Software RepositoriesEmpirical Software EngineeringConference Deadlines (by CSE, IITM, India)Conference Deadlines (by CIn, UFPE, Brazil)Experience:Assistant Professor (CSE, IIT Gandhinagar) [February 2023-present]Post-Doctoral Researcher (CSSE, Concordia University) [August 2021-December 2022] (with: Prof. Dr. Tse-Hsun (Peter) Chen)Researcher (CIn, UFPE) [March 2021–June 2021] (with: Prof. Dr. Marcelo d'Amorim)Education:Ph.D. (CSE, IIT Madras) [2021] {Software Regression Testing Powered by Parallelization Windows} (Advised by: Dr. Rupesh Nasre)M.Tech. (CSE, IIEST Shibpur) [2016] {On Some Combinatorial Algorithms in Digital Geometry}B.Tech. (CSE, CEM Kolaghat) [2014] {Unsupervised Text Mining}Achievements, awards, memberships:Google Gemini Academic Program (March 2025)ANRF - Prime Minister Early Career Research Grant (February 2025)OpenAI DALL-E Detection Classifier Access (August 2024)OpenAI API Researcher Access Program (May 2024)Google Cloud Platform Research Credits (August 2023)Excellence-in-Research Fellowship at IIT Gandhinagar (February 2023, 2024, 2025)New Faculty Start-up Grant at IIT Gandhinagar (February 2023)Horizon Post-Doctoral Fellowship from Concordia University, Montreal (02/11/2021 - 31/12/2022)IBM Best Ph.D. Thesis Honorable Mention (declared on 15/07/2021)Institute Research Award (on recognition of quality and quantity of research work done during July-Nov 2020) at IIT Madras (awarded on 10/06/2021)ISOFT Member (since 04/07/2020)ACM Member (since 04/07/2020)IEEE Member (since 06/02/2020)Erdős number: 4 (Paul Erdős --> David M. Avis --> Binay Kumar Bhattacharya --> Arindam Biswas --> Shouvick Mondal)Silver medal for securing 1st rank in M.Tech. (CSE) at IIEST Shibpur (awarded on 04/03/2017)Funding:ANRFOpenAIGoogleIIT GandhinagarNewsSeptember 2025: Mukul's work on Interactive and Iterative Prompt Mutation Interface for LLM Developers and Evaluators gets accepted at India HCI 2025.July 2025: Devansh joins the group for his Ph.D.June 2025: Devansh's work on source code parallelization using LLMs gets accepted at The Journal of Systems & Software (JSS).June 2025: Mukul Paras Potta successfully defends his M.Tech. thesis.June 2025: Devansh Yadav successfully defends his M.Tech. thesis.May 2025: Isha wins the Director's Gold Medal in M.Sc. at Dayalbagh Educational Institute, Agra.March 2025: Our Research Project on Employing Generative AI in Software Development is approved for the Google Gemini Academic Program.February 2025: I received the ANRF - Prime Minister Early Career Research Grant for 3 years.January 2025: Drishti joins the group for her M.Tech. thesis.December 2024: VulNet is accepted in the Journal-first Track of ICSE 2025.October 2024: Minecraft has been included as a multilingual program repair benchmark in the area of Automated Program Repair (APR).August 2024: We received $200 research credits for OpenAI DALL-E Detection Classifier Access.July 2024: Vaishnav, and Isha join the group for their Ph.D.June 2024: Sai Krishna Avula wins Gold Medal for the outstanding research (M.Tech.) - 13th Convocation (IITGN).May 2024: Our Empirical Study on Database Access Bugs in Java is accepted at Transactions on Software Engineering and Methodology (TOSEM) Journal.May 2024: We received $2500 research credits for OpenAI API Researcher Access.May 2024: Sai Krishna Avula successfully defends his M.Tech. thesis.April 2024: Hetvi, Kevin, and Sagar have their posters accepted at FSE 2024 to be held at Porto de Galinhas, Brazil.April 2024: MineCPP is accepted at FSE 2024 (Tool Demo Track) to be held at Porto de Galinhas, Brazil.January 2024: VulNet is accepted at Empirical Software Engineering (EMSE) Journal.December 2023: Mukul Potta, and Devansh Yadav join the group for their M.Tech. projects.November 2023: We received $5000 research credits on Google Cloud Platform.September 2023: Joined EASE 2024 PC (Main Track), SANER 2024 PC (Demo. Track), ISEC 2024 PC (Main Track + Co-chair in Student Posters Session).September 2023: Invited to be a journal reviewer for the IEEE Transactions on Software Engineering (TSE).August 2023:  Sai Krishna et al. wins the first prize for their exemplary utilization of Large Language Models (LLMs) and ThirdAI's cutting-edge AI tools during the India Hackathon.August 2023:  Minecraft is accepted at ASE 2023 (Industry Challenge Track) to be held at Kirchberg, Luxembourg.May 2023:  Joined the Artifact Evaluation Committee (AE) of USENIX Security 2023.April 2023:  Joined the Artifact Evaluation Committee (AE) of ICSE 2024.March 2023: Darshi + Nishant (from IITGN), and Venkatesh (from NIT Raipur) join as Summer Interns in my group.February 2023: I joined CSE, IIT Gandhinagar as an Assistant Professor.January 2023: Our TSE 2021 paper (Colosseum) is accepted for a Journal-First presentation at ICST 2023.January 2023: Sai Krishna Avula joins the group for his M.Tech. project.December 2022:  Selected as a Junior Program Committee member for the technical research track of MSR 2023. Also, joined ICSE 2024 PC (Demo. Track).November 2022:  Joined the Artifact Evaluation Program Committee (AEC) of PPoPP 2023, and ESOP 2023.June 2022: Invited to be a journal reviewer for the Information and Software Technology (IST).January 2022: Indian patent (with IIT Madras) on consensus test-case prioritization is granted (Indian Patent 386511).January 2022: Invited to be a journal reviewer for the Journal of Systems and Software (JSS).November 2021: I joined Concordia University, Montreal, Canada for my PostDoc.September 2021: Our paper on \"Regression Test Prioritization by Delta Displacement in Test Coverage\" is accepted at TSE.August 2021: My Ph.D. thesis is now online.July 2021: I will be joining as a PostDoc. in the SPEAR Lab, Department of Computer Science and Software Engineering, Concordia University, Montreal, Canada.July 2021: My Ph.D. thesis receives the IBM Best Ph.D. Thesis Honorable Mention.Jun 2021: Our paper on PASTE (PArallel-Sequential Test Execution) is accepted at ICSME 2021.Jun 2021: Received the Institute Research Award (IIT Madras) for July-Nov 2020.May 2021: Successfully defended my Ph.D. Thesis online at CSE, IIT Madras.May 2021: Our patent on consensus test-case prioritization is filed (patent application Id. 202141018121).Mar 2021: I remotely joined CIn, UFPE, Brazil as a post-Ph.D. researcher.Jan 2021: Our JSS paper is accepted for presentation at ICST 2021.Oct 2020: Our Hansie is accepted at the Journal of Systems and Software.Jul 2020: I talked about Mahtab at SERI 2020.Jan 2020: Our JSS paper is accepted for presentation at ICST 2020.Aug 2019: Our work on parallel testing is accepted at the Journal of Systems and Software.Mar 2017: I won the Institute Silver Medal for topping MTech CSE at IIEST Shibpur.Aug 2016: I joined CSE, IIT Madras for Ph.D.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 7923,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:47"
}