{
  "name": "Shoude Lin",
  "homepage": "https://www.csie.ntu.edu.tw/~sdlin",
  "status": "success",
  "content": "ï»¿ Shou-De Lin Shou-De Lin Home Publications AwardsResearch Public Science Courses CV Dr. Shou-De Lin Professor Department of Computer Science and Information Engineering Graduate Institute of Networking and Multimedia National Taiwan University Tel: +886-2-33664888 ext.333, Fax: +886-2-33664898, Office: Rm333 Email: Recruiting: We Train AI Scientists !! Do you want to learn how to deal with Tera bytes of data coming from different sources? Do you want to learn how to predict what will happen in the future? Do you hope to design analytic models that can be used in real life? Do you feel excited about this area after reading my popular science article about big data? Do you want to know how we can beat hundreds of teams in KDD Cup year by year? If any of the above answer is yes, feel free to email me about the possibility to join MSLAB. NEWS(Note that most of them are out-of-date): Slides: Research and Writing Tips for Graduate Students MSLAB Summer 2016 Training The paper âInferring Air Quality for Station Location Recommendation Based on Urban Big Dataâ in KDD2015 The paper \"A Learning-based Framework to handle Multi-round Multi-party influence maximization on social networks \" in KDD2015 The paper \"A Dual-Augmented Block Minimization Framework for Learning with Limited Memory \" in NIPS2015 The paper \"LambdaMF: Learning Nonsmooth Ranking Functions in Matrix Factorization Using Lambda\" in ICDM2015 The paper \"Matching Users and Items Across Domains to Improve the Recommendation Quality\" in KDD2014 The paper \"Enriching Cold Start Personalized Language Model Using Social Network Information\" in ACL2014 The paper \"Robust Inverse Covariance Estimation under Noisy Measurements\" accepted in ICML2014 The paper \"Sparse Random Feature Algorithm as Coordinate Descent in Hilbert Space \" accepted in NIPS2014 Congratulate Dr. Cheng-Te Li for becoming a research assistant fellow in Sinica !! Congratulate Dr. Cheng-Te Li has received the best dissertation award in ACLCLP!!A long Paper (11%) and a short paper (19%) Accepted in ICDM 2013 \"Sampling Heterogeneous Networks\" âCommunication-Efficient Distributed Multiple Reference Pattern Matching for M2M Systemsâ Congratulate the NTU team wins KDD Cup 2013 Champions for both tracks. Our team (composed by different students every year) has won 5 KDD-Cup Champions from 2008~2013 except 2009 (3rd place). How to Write a proper SOP Two regular papers accepted in KDD13 (17% acceptance rate), which reflects the hard working and smartness of our students: âIndexed Block Coordinate Descent for Large-Scale Linear Classiï¬cation with Limited Memory â \"Unsupervised Link Prediction Using Aggregative Statistics on Heterogeneous Social Networksâ Congratulate Dr. Hung-Yi Lo has become the assistant professor in Shih Chien University. Congratulate the NTU team wins KDD Cup 2012 Track 2 Champion, this is the 5th consecutive win of our team from 2008-2012 (4 of them are champions). News: å°å¤§æ ¡å INTEL NEWS æ¬å¯¦é©å®¤ç®åç ç©¶è¨ç«ï¼ ç¤¾ç¾¤ç¶²è·¯æ¢å èªç¶èªè¨èç æ©å¨å­¸ç¿èè³ææ¢å ææ¸¬ç¶²è·¯è³æåæ æ¬å¯¦é©å®¤2012å¹´æ°çç ç©¶è¨ç«ï¼ data mining and machine learning for security (å©ç¨è³ææ¢åèæ©å¨å­¸ç¿æ¹æ³é²è¡è³è¨å®å ¨ç ç©¶ï¼ Location-based intelligent service (ä»¥å°çä½ç½®çºåºç¤çæºæ §åæåï¼ Champions for Both Tracks in KDDCUP 2011 One paper received the Best Full Paper Award in ASONAM 2011 Chien-Tung Ho, Cheng-Te Li and Shou-De Lin. Modeling and Visualizing Information Propagation in a Micro-blogging Platform One paper accepted by KDD 2011 Cheng-Te Li; Shou-De Lin \"Social Flocks: A Crowd Simulation Framework for Social Network Generation, Community Detection, and Collective Behavior Modeling\" Two papers accepted by ACL 2011 Cheng-Te Li, Chien-Yuan Wang, Chien-Lin Tseng, and Shou-De Lin. âMemeTube: A Sentiment-based Audiovisual System for Analyzing and Displaying Microblog Messages.â Jui-Yu Weng, Cheng-Lun Yang, Bo-Nian Chen, Yen-Kai Wang, Shou-De Lin \"IMASS: An Intelligent Microblog Analysis and Summarization System\" [01/2011] We were granted for Heterogeneous Sensor Network Analysis project by INTEL-NTU research Lab. http://www.intellab.ntu.edu.tw/index.php/research/project/modeling_and_analysis_of_large-scale_heterogeneous_data [07/2010] Our team is the dual-champion of ACM KDDCUP 2010!! https://pslcdatashop.web.cmu.edu/KDDCup/results.jsp [ Student Recruiting ] Prospective students please see FAQ [ 07/01/2009 ] We have received the 3rd place in the extended track of KDDCUP09 !! [ 04/2009 ] Tutorial Presented in PAKDD2009 !! [ 09/01/2008 ] Our Lab wins ACM KDDCUP 2008 !! [ 01/16/2008 ] \"Research as a graduate student: beyond a survival guide\" has been put online. [1/2008] æä»»Secretary General for TAAI [ 12/01/2007 ] Winner of Google Research Award 2007 For students and Postdoc/RA candidates Please email me if you have interests to work on a project in our Lab. I will also be supervising new undergraduate and graduate students. You are more than welcome to contact me if you feel there is a potential match between our research interests. Prospective projects ç¤¾ç¾¤ç¶²è·¯æ¢å (SNA)ï¼ Electronic Holmes (é»å­ç¦ç¾æ©æ¯): Identifying suspicious instances from complex networks Social Network Analysis (ç¤¾ç¾¤ç¶²è·¯åæ) Plurk, Facebook, data analysis (PTT/FB è³æåæ) Social Voting Theory and Analysis (ç¤¾ç¾¤æç¥¨è¡çºæ¨¡åï¼ ç¥è­ç¼ç¾èæ©å¨å­¸ç¿(ML/KDD) Knowledge Discovery and Data Mining (è³ææ¢åç¸é) Time sequence and event detection, Imbalance Data Mining, KDDCUP, etc. Machine Learning (æ©å¨å­¸ç¿): CRF, EM, Multi-label Learning, other applications Machine Discovery (æ©å¨ç¼æ): Discover interesting things automatically Network Forensics, Security with Machine learning èªç¶èªè¨èçï¼æå°å¼æï¼AI (NLP/IR) AutoEdit (èªåæ ¡å®ç³»çµ±): Edit a flawed English sentence into a more accurate one Connection Search Engine (é£çµæç´¢å¼æ): Finds social relationships from texts Poetry Writing (å¤å ¸è©©è©åµä½) Plagiarism Detection (æè¥²åµæ¸¬) CS methods for popular science writing (è³è¨æ¹æ³å¨å¯«ä½ä¸çéç¨) visitors",
  "content_length": 6194,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:46"
}