{
  "name": "Shrideep Pallickara",
  "homepage": "http://www.cs.colostate.edu/~shrideep",
  "status": "success",
  "content": "Shrideep Pallickara Shrideep Pallickara   [Professor] CV Research Publications Projects Themes Students Software Teaching Outreach Personal Home I am a Professor in the Department of Computer Science at Colorado State University. I direct the Center for eXascale Spatial Data Analytics and Computing (XSD). Agencies in the United States and United Kingdom have funded my research. These include the National Science Foundation, the Department of Homeland Security (including the Long Range program), the Environmental Protection Agency, Department of Agriculture, and the U.K's e-Science program. I am a recipient of the Board of Governors Award for Excellence in Undergraduate Teaching, the OLIE award, the N. Preston Davis award, a Monfort Professorship, and the National Science Foundation's CAREER award. My research encompasses methodological and algorithmic innovations at the intersection of machine learning and large-scale systems, where issues of tractability, numerical stability, convergence, timeliness, and throughput come sharply into focus. These investigations occur in three broad areas: (1) spatiotemporal data management and analytics, (2) extreme-scale storage systems, and (3) stream processing for Internet-of-Things and Cyber-Physical Systems. A key thrust is the extraction of patterns and the construction of models at scale over voluminous, high-dimensional datasets that are often several Petabytes in size with thousands to millions of dimensions. These models are used to understand processes (natural or otherwise) and to forecast phenomena, with applications ranging from identifying socio-economic and infrastructure vulnerabilities in urban areas, decision making in agricultural settings,  to detecting early signs of declining health in age-at-home settings. Many of these models are deep neural networks with 100s of millions of parameters. Within this space, a central thread is designing scientifically grounded deep neural networks. This includes designing differentiable loss functions that draw directly from domain knowledge: things like soil properties, hydraulic conductivity, graph structure, or patterns of disease progression. Alongside this, I have been pairing these networks with mechanistic, physics-based, or process-based models, letting the two work in tandem. The idea is to give the learning both a strong scientific compass and richer training data, while also ensuring effective parameterization. The goal is for the AI models not just to get the right answers, but to arrive there in ways that remain faithful to the science itself. Fitting such models over voluminous, multimodal, high-dimensional datasets introduces unique challenges involving computational tractability, efficient resource use, data movement, and completion times. My lab develops algorithms that balance multiple competing factors, including numerical stability, dispersion, load balancing, speed differentials across the memory hierarchy, GPUs, and RAM, as well as learning rates, convergence, and online updates. The goal is to enable the construction of models that are both faster to train and better able to generalize. Systems software resulting from my research efforts have been deployed in domains such as urban sustainability, agriculture, epidemiology, earthquake science, environmental and ecological monitoring, health care systems, high energy physics, defense applications, geosciences, GIS, and commercial internet conferencing systems. Research Themes: [Deep Learning] [Mining] [Sketching] [Orchestration] [Planninng Exercises] [Visualization] [Clouds] [File Systems] Contact: Department of Computer Science Colorado State University 1100 Center Avenue, Room 364 Fort Collins, CO 80523-1873 USA Office Computer Science Building, Room 364 Hours 3:00-4:00 pm Fridays [CS370, Spring-25] 4:00-5:00 pm Fridays [CS250, Spring-25] Phone 970.492.4209 E-mail shrideep.pallickara@colostate.edu",
  "content_length": 3932,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:49"
}