{
  "name": "Shuai Wang 0011",
  "homepage": "https://home.cse.ust.hk/~shuaiw",
  "status": "success",
  "content": "Shuai Wang Shuai Wang Associate Professor Department of Computer Science and Engineering Hong Kong University of Science and Technology Office: 3516 E-mail: shuaiw at cse.ust.hk I am an associate professor with substantiation (tenure) at CSE, HKUST. I am currently serving the PG coordinator role at CSE. Prior to that, I was an assistant professor at CSE, HKUST (2019-2024), and was a postdoctoral scholar in the AST lab at ETH Zurich (2018-2019). I received the Ph.D. degree from Penn State University, and the B.S. degree from Peking University. My research covers Computer Security and Privacy as well as Software Engineering. I study important attributes (security, privacy, satefy, ethics, fairness, etc.) in software, artificial intelligence, systems, and more importantly, their integrations, e.g., exploiting/hardening AI models from system perspectives, studying AI ethics with software testing/verification, supporting privacy computing via software and system infrastructures, and using LLMs for software fuzzing. I am the recipient of serveral research scholar awards from Google, Alibaba DAMO Academy, CCF-Tencent Rhino-Bird x 2, and a HK-UGC Early Career Award. Teaching CSIT5730: Principles of Cybersecurity (Fall 2025) COMP1021: Introduction of Computer Science (Summer 2025) COMP4634: Cybersecurity (Spring 2025) CSIT5730: Principles of Cybersecurity (Fall 2024) COMP2011: Programming with C++ (Fall 2024) COMP3632: Principles of Cybersecurity (Spring 2024) COMP3632: Principles of Cybersecurity (Fall 2023) COMP3632: Principles of Cybersecurity (Spring 2023) COMP4971A: Independent Work on Systems Security (Spring 2023) COMP4971B: Independent Work on Systems Security (Spring 2023) COMP3632: Principles of Cybersecurity (Fall 2022) COMP3632: Principles of Cybersecurity (Spring 2022) COMP3632: Principles of Cybersecurity (Fall 2021) COMP3632: Principles of Cybersecurity (Spring 2021) COMP6613C: Topics in Computer Security and Privacy (Spring 2021) COMP3632: Principles of Cybersecurity (Fall 2020) COMP3632: Principles of Cybersecurity (Fall 2019) COMP4971A: Independent Work on Software Fuzz Testing (Fall 2019) Current Team Members Postdoc Dr. Zhibo Liu (2023 Fall) Dr. Han Liu (2024 Fall) Co-hosted with Prof. Daoyuan Wu Dr. Qingyue Wang (2024 Fall) Dr. Pingchuan Ma (2024 Fall) Dr. Ruochen Zhou (2025 Spring) Co-hosted with Prof. Bo Li Dr. Huaijin Wang (2025 Fall) Dr. Dongwei Xiao (2025 Fall) Dr. Zongjie Li (2025 Fall) Ph.D. Students Yanzuo Chen (2021 Fall) Zhenlan Ji (2021 Fall) Yongkang Zhang (2021 Fall) Dong Chen (2022 Fall) Co-advised with Prof. Wei Wang Hongyi Lu (2022 Fall) Co-advised with Prof. Fengwei Zhang Sen Deng (2023 Fall) Yiteng Peng (2023 Fall) Xunguang Wang (2023 Fall) Zhaoyu Wang (2023 Fall) Kuan Li (2023 Fall) Co-advised with Prof. Minhao Cheng Yanbo Dai (2024 Fall) Ruixuan Huang (2024 Fall) Zongyi Lv (2024 Fall) Co-advised with Prof. Shing-chi Cheung Liwen Wang (2024 Fall) Yuchong Xie (2024 Fall) Co-advised with Prof. Dongdong She Zhantong Xue (2024 Fall) Kunpeng Zhang (2024 Fall) Yudong Gao (2025 Fall) Xing Han (2025 Fall) Mingyuan Huang (2025 Fall) Zimo Ji (2025 Fall) Co-supervised with Daoyuan Wu Gengyang Xu (2025 Fall) Zheng Zhang (2025 Fall) Yuguang Zhou (2025 Fall) Alumni Wai Kin WONG (Ph.D.#7) 2021-2024. Thesis: Enhancing Binary Analysis Tooling. Dongwei Xiao (Ph.D.#6) 2021-2024. Thesis: Improving the Reliability of Privacy-Enhancing Technology (PET) Systems. Zongjie Li (Ph.D.#5) 2021-2024. Thesis: Enhancing and Hardening Neural Code Model. 2025 Ant InTech Technology Scholarship (Ten Awardees Per Year). Ao Sun (MPhil @ CSE HKUST) 2023-2025. Thesis: Enabling Explainable AI with Transformer Models: Opportunities and Limitations in Visual and Textual Concept Generation. Dr. Daoyuan Wu (RAP) 2024-2025. Assistant Professor @ Lingnan University Dr. Wenxuan Wang (Postdoc) 2024-2025. Assistant Professor @ Remin University of China. LAU Pak Hin (2024 UG @ CSE). Co-op Thesis: red-blue team attack test and compromise assessment test. Yigit Sen (2024 UG @ CSE). Final Year Thesis: Using large language model for formal proof generation. Kaiwen Yang (2024 RA) Co-advised with Prof. Daoyuan Wu. Ph.D. student @ Australian National University Pingchuan Ma (Ph.D.#4) 2020-2024. Thesis: Algorithms, Applications, and Verification of Causal Structure Learning. HKUST Engineering PhD Research Excellence Award 2024-25 (One Awardee Per Year). Yuanyuan Yuan (Ph.D.#3) 2020-2024. Thesis: Side Channel Analysis for AI Infrastructures. 2024 CSE Best PhD Dissertation Award (One Awardee Per Year). Sen Li (MPhil @ CSE HKUST) 2022-2024. Co-advised with Prof. Minhao Cheng. Thesis: Towards Trustworthy Visual Generative Models: Reliable and Controllable Generation of Diffusion Models. Ph.D. Student @ Penn State Yichen Li (MPhil @ CSE HKUST) 2022-2024. Thesis: Testing Secure Multi-Party Computation Compilers. Ph.D. student @ SusTech Huaijin Wang (Ph.D.#2) 2019-2023. Postdoc (2023-2024). Thesis: Advanced Binary Similarity Analysis and Its Downstream Applications. Postdoc @ Ohio State University Zhibo Liu (Ph.D.#1) 2019-2023. Thesis: Towards Assessing and Enhancing Modern Software Reverse Engineering. 2023 CSE Best PhD Dissertation Award - Honorable Mention (Three Awardee Per Year). Zhaoyu Wang (UG@Tongji University) 2022-2023. Co-advised with Pingchuan Ma. Thesis: Program Analysis. Ph.D. student @ HKUST Ao Sun (UG@UIUC) 2023. Co-advised with Pingchuan Ma. Research on LLM Security. Ph.D. student @ HKUST Yiteng Peng (UG@USTC) 2023. Co-advised with Yuanyuan Yuan. Membership Inference Attack. Ph.D. student @ HKUST SINGHAL, Sarthak (2023 Spring UG@HKUST). COMP 4971 (Independent Work) on Intrusion Detection. Security Intern @ Deloitte Qi Wu (UG@HKUST). 2022-2023. Thesis: NFT Security: Rug Pull Detection. MS student @ CMU. Wenbo Li (UG@HKUST). 2022-2023. MS student @ USC. Qihao He (UG@HKUST). 2022-2023. MS student @ TAMU. Qi Pang (MPhil @ CSE HKUST). 2020-2022. Thesis: Testing Models Solving Markov Decision Processes. Ph.D. student @ CMU. Wai Kin WONG (MPhil @ CSE HKUST). 2019-2021. Thesis on software security. Ph.D. student @ HKUST. Kun Hung LUNG (MPhil @ CSE HKUST). Thesis on systems security. 2019-2021. Engineer @ a start-up cybersecurity company. Wei Chen (MPhil @ CSE HKUST). 2019-2021. Thesis on systems security. RA @ HKUST. Wangkai Jin (UG @ CSE UNottingham Ningbo). 2021 Summer intern on AI privacy projects. MSCS student @ Duke University. Yujie Wang (UG @ CSE HKUST). 2020-2021 Thesis: Privacy-Preserving Security Analysis. Ph.D. student @ Washington University in St. Louis. Xirui Nie (UG @ Fudan University). 2020 Summer intern on compiler & OS security projects. Ph.D. student @ CUHK. Reiff Loris (UG @ ETH Zurich, co-advised with Prof. Zhendong Su). Thesis: Context-Aware Obfuscation: A Step Towards Defeating Adversary Symbolic Analysis. Continued Masters study @ ETH Zurich. Nguyen Andy (UG @ ETH Zurich, co-advised with Prof. Zhendong Su). Thesis: Detecting Vulnerabilities in Real-World Software with Fuzz Testing. Information Security Engineer @ Google. Organization General Chair OpenHarmony CTF 2025 [link] Co-chair AISTA 2024 Co-chair AISTA 2022 Co-chair AISTA 2021 Program committees Due to significant departmental commitments, I will have limited capacityto take on additional external responsibilities starting in fall 2025. 2025: IEEE S&P, USENIX Security, CCS (Top Reviewer Award), ASE 2024: IEEE S&P, USENIX Security, FSE, ISSTA 2023: IEEE S&P, USENIX Security, CCS, FSE, ISSTA, ASE, PoPETs/PETS, PRDC 2022: CCS, ASE, ICSE (SEET), AsiaCCS, NDSS (BAR), DBTest 2021: ICSE (AE), AsiaCCS Selected Publications SoK: Evaluating Jailbreak Guardrails for Large Language Models.Xunguang Wang, Zhenlan Ji, Wenxuan Wang, Zongjie Li, Daoyuan Wu, and Shuai Wang. IEEE Security & Privacy 2026 Privacy-preserving and Verifiable Causal Prescriptive Analytics.Zhaoyu Wang, Pingchuan Ma, Zhantong Xue, Yanbo Dai, Zhenlan Ji, and Shuai Wang. SIGMOD 2026 Guardrail: Automated Integrity Constraint Synthesis From Noisy Data.Pingchuan Ma, Zhaoyu Wang, Zhenlan Ji, Zongjie Li, Ao Sun, and Shuai Wang. SIGMOD 2026 The Phantom Menace in PET-Hardened Deep Learning Models: Invisible Configuration-Induced Attacks.Yiteng Peng, Dongwei Xiao, Zhibo Liu, Zhenlan Ji, Daoyuan Wu, Shuai Wang, and Juergen Rahmel. CCS 2025 Have We Solved Access Control Vulnerability Detection in Smart Contracts? A Benchmark Study.Han Liu, Daoyuan Wu, Yuqiang Sun, Shuai Wang, and Yang Liu. ASE 2025 Metamorphic Testing for Audio Content Moderation Software.Wenxuan Wang, Yongjiang Wu, Junyuan Zhang, Shuqing Li, Yun Peng, Wenting Chen, Shuai Wang, and Michael Lyu. ASE 2025 Demystifying OpenZeppelin's Own Vulnerabilities and Analyzing Their Propagation in Smart Contracts.Han Liu, Daoyuan Wu, Yuqiang Sun, Shuai Wang, Yang Liu, and Yixiang Chen. ASE 2025 Extraction and Mutation at a High Level: Template-Based Fuzzing for JavaScript Engines.Wai Kin Wong, Dongwei Xiao, Cheuk Tung LAI, Yiteng Peng, Daoyuan Wu, and Shuai Wang. OOPSLA 2025 An Empirical Study Measuring In-The-Wild Cryptographic Microarchitectural Side-Channel Patches.Sen Deng, Zhibo Liu, Shuai Wang, Yinqian Zhang. CCS 2025 Differentiation-Based Extraction of Proprietary Data from Fine-tuned LLMs.Zongjie Li, Daoyuan Wu, Shuai Wang, Zhendong Su. CCS 2025 Measuring and Augmenting Large Language Models for Solving Offensive Security Challenges.Zimo Ji, Daoyuan Wu, Wenyuan Jiang, Pingchuan Ma, Zongjie Li, and Shuai Wang. CCS 2025 MOLE: Breaking GPU TEE with GPU-Embedded MCU.Hongyi Lu, Yunjie Deng, Sukarno Mertoguno, Shuai Wang, Fengwei Zhang. CCS 2025 Can't See the Forest for the Trees: Benchmarking Multimodal Safety Awareness for Multimodal LLMs.Wenxuan Wang, Xiaoyuan Liu, Kuiyi Gao, Jen-tse Huang, Youliang Yuan, Pinjia He, Shuai Wang, Zhaopeng Tu. ACL 2025 Chain-of-Jailbreak Attack for Image Generation Models via Step by Step Editing.Wenxuan Wang, Kuiyi Gao, Youliang Yuan, Jen-tse Huang, Qiuzhi Liu, Shuai Wang, Wenxiang Jiao, Zhaopeng Tu. ACL 2025 (finding)",
  "content_length": 26968,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:53"
}