{
  "name": "Shuang Hao",
  "homepage": "http://utdallas.edu/~shao",
  "status": "success",
  "content": "Shuang Hao - The University of Texas at Dallas Shuang Hao Home Publications Media Students Teaching Awards Service Shuang Hao Associate Professor Department of Computer Science Erik Jonsson School of Engineering & Computer Science University of Texas at Dallas Office: ECSS 3.705 Phone: (972) 883-4164 Email: shao -at- utdallas.edu Google scholar I am an Associate Professor in the Department of Computer Science at the University of Texas at Dallas. My research interests are in security and privacy, particularly developing data-driven and AI techniques to identify and mitigate adversarial attacks and illicit activities. My current work focuses on AI security, big data security, and security of next-generation network systems. I am a recipient of the NSF CAREER Award (2022), IETF Applied Networking Research Prize (ANRP 2020), IEEE/IFIP DSN Best Paper Award (2020), IMC Best Paper Award Runner-up (2019), CSAW Best Applied Security Paper Award Finalist (2022, 2017), and Yahoo! Key Scientific Challenges Program Award (2012). My research has been featured in media outlets, including MIT Technology Review, Slashdot, WIRED, New Scientist, Fortune, CNN, and The Wall Street Journal. I completed my undergraduate study at Tsinghua University. I obtained my Ph.D. in Computer Science at the Georgia Institute of Technology advised by Prof. Nick Feamster. I also worked closely with Prof. Vern Paxson at the University of California, Berkeley/ICSI. Before joining the University of Texas at Dallas, I was a postdoc at the University of California, Santa Barbara working with Prof. Giovanni Vigna and Prof. Christopher Kruegel. RA positions available I am looking for self-motivated PhD students who have strong interests in artificial intelligence and cybersecurity research. If you are interested, feel free to send me an email. Selected Recent Publications (Or see the full list of papers and talks, Google scholar). CCS'24 Unveiling Collusion-Based Ad Attribution Laundering Fraud: Detection, Analysis, and Security Implications PDF USENIX Security'24 Double Face: Leveraging User Intelligence to Characterize and Recognize AI-synthesized Faces PDF NDSS'24 A Duty to Forget, a Right to be Assured? Exposing Vulnerabilities in Machine Unlearning Services PDF SIGMETRICS'23 Detecting and Measuring Security Risks of Hosting-Based Dangling Domains PDF Media Coverage APNIC CCS'22 Don't Kick Over the Beehive: Attacks and Security Analysis on Zigbee PDF CCS'21 Understanding and Detecting Mobile Ad Fraud Through the Lens of Invalid Traffic PDF CSAW Best Applied Security Paper Award Finalist USENIX Security'21 Weak Links in Authentication Chains: A Large-scale Analysis of Email Sender Spoofing Attacks PDF NDSS'21 From WHOIS to WHOWAS: A Large-Scale Measurement Study of Domain Registration Privacy under the GDPR PDF CCS'20 Talking with Familiar Strangers: An Empirical Study on HTTPS Context Confusion Attacks PDF CCS'20 Lies in the Air: Characterizing Fake-base-station Spam Ecosystem in China PDF USENIX Security'20 Poison Over Troubled Forwarders: A Cache Poisoning Attack Targeting DNS Forwarding Devices PDF NDSS'20 CDN Judo: Breaking the CDN DoS Protection with Itself PDF S&P'19 Measuring and Analyzing Search Engine Poisoning of Linguistic Collisions PDF USENIX Security'18 Rampart: Protecting Web Applications from CPU-Exhaustion Denial-of-Service Attacks PDF Code USENIX Security'18 Who Is Answering My Queries: Understanding and Characterizing Interception of the DNS Resolution Path PDF Media Coverage The Register, Hackread, and Help Net Security S&P'18 Enumerating Active IPv6 Hosts for Large-scale Security Scans via DNSSEC-signed Reverse Zones PDF Data NDSS'18 Cloud Strife: Mitigating the Security Risks of Domain-Validated Certificates PDF NDSS'18 Smoke Screener or Straight Shooter: Detecting Elite Sybil Attacks in User-Review Social Networks PDF CCS'17 DIFUZE: Interface Aware Fuzzing for Kernel Drivers PDF CSAW Best Applied Security Paper Award Finalist CCS'16 Lurking Malice in the Cloud: Understanding and Detecting Cloud Repository as a Malicious Service PDF Media Coverage SC Magazine and Daily Mail CCS'16 PREDATOR: Proactive Recognition and Elimination of Domain Abuse at Time-Of-Registration PDF Media Coverage The Wall Street Journal, Dark Reading, and Daily Mail CCS'15 Drops for Stuff: An Analysis of Reshipping Mule Scams PDF Slides Media Coverage Krebs on Security, Schneier on Security, Slashdot, and CNN",
  "content_length": 4447,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:56"
}