{
  "name": "Shuai Li 0010",
  "homepage": "https://shuaili8.github.io",
  "status": "success",
  "content": "Shuai Li Home About me Teaching Students Research Publications Talks Services Shuai Li Shuai Li Tenured Associate Professor in the school of Artificial Intelligence, Shanghai Jiao Tong University Deputy Director of John Hopcroft Center, Shanghai Jiao Tong University Advisor at Shanghai Innovation Institute Email: shuaili8@sjtu.edu.cn CV GoogleScholar ResearchGate DBLP LinkedIn GitHub About me I am a tenured associate professor in the school of Artificial Intelligence of Shanghai Jiao Tong University. I received my PhD degree in the Chinese University of Hong Kong under the supervision of Prof. Kwong-Sak Leung and Prof. Shengyu Zhang. During the PhD, I received Google PhD Fellowship of year 2018 in the field of machine learning. Before that, I obtained my bachelor degree in Mathematics from Zhejiang University and my master degree in Mathematics from University of the Chinese Academy of Sciences. My research interest lies at reinforcement learning, multi-armed bandits, diffusion models and transformers. My current major research topics include reinforcement learning algorithms, online matching markets and focus on the algorithm design with the regret analysis. I am also interested in the analysis of diffusion models and transformers. 李帅，上海交通大学人工智能学院长聘副教授、约翰·霍普克罗夫特计算机科学中心副主任、上海创智学院全时导师，研究可自主决策适应动态环境的强化学习理论与方法、扩散模型与大模型的分析，迄今共发表学术论文90+篇，包含上海交通大学首篇机器学习理论顶会COLT论文等，其中第一/通讯作者发表CCF-A类论文40+篇，10余项理论提升成果仍保持理论最优。担任TMLR的执行编委（Action Editor）、AAMAS的高级领域主席（Senior Area Chair）机器学习顶会ICML、NeurIPS、ICLR、ACL、UAI等的领域主席（Area Chair），受邀于群体智能顶级会议AAMAS上给出多智能体在线学习（2024）与马尔可夫博弈理论基础（2025）的教程、IJCAI上给出多智能体在线学习（2025）的教程和DAI上给出多智能体在线学习的教程（2025），主持国自然重大培育项目、面上基金、青年基金，参与国自然重大研究计划、科技部2030新一代人工智能重大项目。曾获得AAAI-IAAI Deployed Application Award（2025）、上海市扬帆人才计划、上海徐汇光启人才、华为火花奖、香港政府外展合作奖、谷歌博士奖学金、国际SAT竞赛并行求解赛道铜牌、腾讯优秀导师奖等。首位博士生已入职南方科大担任助理教授（2024），指导学生获得CCF-多智能体优博（2025）、百度奖学金（全球仅10位）、商汤奖学金、腾讯犀牛鸟优秀学生奖、上海市优秀毕业生、国家奖学金等。",
  "content_length": 1897,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:52"
}