{
  "name": "Shuang Zhao",
  "homepage": "http://shuangz.com",
  "status": "success",
  "content": "Shuang Zhao: Home NCSA 4102B ... about me NCSA 4102B ... I am an Associate Professor at the Siebel School of Computing and Data Science of the University of Illinois Urbana-Champaign (UIUC). Before joining UIUC, I served as an Associate Professor at the University of California, Irvine (UCI). I earned my PhD from Cornell University in 2014, where I was advised by Kavita Bala. I was also honored to receive the NSF CAREER Award in 2023. Research focus: My group works broadly in 3D computer graphics and vision. We focus on devising numerical algorithms to simulate physical phenomena, such as light transport in complex environments. Additionally, we develop efficient solutions for inverse problems, specifically centering on the inference and optimization of geometric and material properties. Perspective students: Please check the research and opening pages. recent publications Robust Derivative Estimation with Walk on Stars cg Zihan Yu, Rohan Sawhney, Bailey Miller, Lifan Wu, Shuang Zhao ACM Transactions on Graphics (SIGGRAPH Asia 2025), 44(6), December 2025 Image-Space Adaptive Sampling for Fast Inverse Rendering cg Kai Yan, Cheng Zhang, Sébastien Speierer, Guangyan Cai, Yufeng Zhu, Zhao Dong, Shuang Zhao ACM SIGGRAPH 2025 (conference-track full paper), August 2025 Unbiased Differential Visibility Using Fixed-Step Walk-on-Spherical-Caps And Closest Silhouettes cg Lifan Wu, Nathan Morrical, Sai Bangaru, Rohan Sawhney, Shuang Zhao, Chris Wyman, Ravi Ramamoorthi, Aaron Lefohn ACM Transactions on Graphics (SIGGRAPH 2025), 44(4), August 2025 Guiding-Based Importance Sampling for Walk on Stars cg Tianyu Huang, Jingwang Ling, Shuang Zhao, Feng Xu ACM SIGGRAPH 2025 (conference-track full paper), August 2025 Convergence Estimation of Markov-Chain Monte Carlo Rendering cg Rui Yu, Guangzhong Sun, Shuang Zhao, Yue Dong Eurographics Symposium on Rendering (EGSR), July 2025 selected teaching State of the Art in Grid-Free Monte Carlo Methods for Partial Differential Equations Rohan Sawhney, Bailey Miller, Ioannis Gkioulekas, Keenan Crane, Wojciech Jarosz, Shuang Zhao,Mohammad Sina Nabizadeh, Zilu Li SIGGRAPH 2025 Course Physics-Based Differentiable Rendering Shuang Zhao, Ioannis Gkioulekas, Sai Bangaru CVPR 2021 Tutorial",
  "content_length": 2243,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:56"
}