{
  "name": "Shuang Li 0002",
  "homepage": "https://shuangli01.github.io",
  "status": "success",
  "content": "Shuang Li Home Publications People Teaching Awards Shuang Li Assistant Professor School of Data Science The Chinese University of Hong Kong (Shenzhen) Daoyuan Building, 508b Shenzhen, Guangdong, China Email: lishuang@cuhk.edu.cn Biography I am an Assistant Professor in the School of Data Science at The Chinese University of Hong Kong (Shenzhen). Previously, I was a postdoctoral fellow at Harvard University, working on mobile health with Prof. Susan Murphy. I earned my Ph.D. in Industrial Engineering from H. Milton Stewart School of Industrial & Systems Engineering at Georgia Tech in 2019, and earlier, I received B.E. in Automation from University of Science and Technology of China in 2011. [Google Scholar] [Curriculum Vitae] I’m recruiting Research Assistants year-round and have 1~2 PhD openings starting Fall 2026. If you are interested in working with me, and with good programming skills and math background, you can contact me via email with your CV. Research Interests My research delves into the development of knowledge-enhanced sequential models and sequential decision tools, which prioritize interpretability and trustworthiness in machine learning. More specifically, my research focuses on: Knowledge-Enhanced Sequential Models: By integrating domain-specific knowledge into machine learning algorithms, we aim to facilitate transparent decision-making processes and to create robust and reliable frameworks applicable in high-stakes systems. Human Cognitive Process Modeling: By incorporating Theory of Mind and spatial-temporal logical reasoning into AI systems, we aim to enable effective collaboration between humans and AI. Applications in Healthcare: We aim to apply machine learning tools to improve healthcare policies, clinical workflows, and patient outcomes through informed decision-making. People PhD students: — Chao Yang (2022 Fall- ) BS: Shandong University, MS: University of Edinburgh. First-author paper: ICML 2025, UAI 2025. — Wendi Ren (2023 Fall- ) BS: Sun Yat-sen University, MS: Georgia Institute of Technology. Second-author paper: ICLR 2024, ICLR 2025, NeurIPS 2024. — Xinye Chen (2023 Fall- ) BS: Zhejiang University of Finance & Economics, MS: Johns Hopkins University. — Yanwen Liu (2025 Fall- ) BS: Beihang University. — Tianjian Zhang (2025 Fall- ) BS: Sun Yat-sen University. Research Assistants: — Chengzhi Cao (2022 Dec-2024 Jan) Visiting student from the University of Science and Technology of China. Initial placement: PhD student in ECE at CMU. First-author paper: NeurIPS 2023, ICLR 2024. — Zitao Song (2022 Jun-2023 May) Master student at The Chinese University of Hong Kong (Shenzhen). Initial placement: PhD student in CS at Purdue University. First-author paper: ICLR 2024, ICML 2024. — Yang Yang (2022 Oct- 2024 Aug) Master student at The Chinese University of Hong Kong (Shenzhen). Initial placement: PhD student at the Hong Kong University of Science and Technology (Guangzhou). First-author paper: ICML 2024, NeurIPS 2024. — Yinghao Fu (2023 May- 2024 Aug) Master student at The Chinese University of Hong Kong (Shenzhen). Initial placement: PhD student in DS at the City University of Hong Kong. Co-first-author paper: ICLR 2024. — Shuting Cui (2023 July- 2023 Dec) Initial placement: PhD student in Hong Kong University of Science and Technology (Guangzhou). Second-author paper: ICML 2025. — Zhiren Gong (2025 March-2025 Aug) Initial placement: PhD student in the Nanyang Technological University. — Yuting Yan (2025 Jan- ) BS: Beihang University. Master student at The Chinese University of Hong Kong (Shenzhen). First-author paper: NeurIPS 2025 GenAI4Health Workshop (Award Candidate). — Wenjie Shen (2025 Aug- ) BS: University of Science and Technology of China. Undergraduate students in The Chinese University of Hong Kong (Shenzhen): — Minghao Mou (2022 Jun-2023 May) Initial placement: PhD student in ECE at Purdue University — Yiling Kuang (2022 Sep-2023 May) Initial placement: PhD student in Statistics at The Chinese University of Hong Kong. First-author paper: AISTATS 2024. — Zhaner Mou (2021 Dec-2022 May) Initial placement: Master student in Biostatisitcs at UC San Diego. Current placement: PhD student in DS at UC San Diego — Zilin Jing (2022 May-2023 May) Initial placement: PhD student in CS at the Columbia University. First-author paper: ICML 2023 Interpretable ML in Healthcare Workshop. — Junyu Leng (2024 Jan-2025 May) Initial placement: PhD student in ISE at the Texas A&M University. — Shuhan Zhang (2024 March- ) First-author paper: ICLR 2025, NeurIPS 2025 (spotlight). — Jinlong Li (2025 Jun- ) — Yongxi Feng (2025 Aug- ) — Yitong Ding (2025 Aug- ) Publications Conference Deep Context-Dependent Choice Model. S. Zhang, Z. Wang, R. Gao and S. Li Neural Information Processing Systems (NeurIPS), 2025. (Spotlight, acceptance rate: 3%) RKHS Choice Model Y. Yang, Z. Wang, R. Gao and S. Li. ACM Conference on Economics and Computation (EC), 2025. Flow-Based Delayed Hawkes Process C. Yang, W. Ren and S. Li. Conference on Uncertainty in Artificial Intelligence (UAI), 2025. Evolving Minds: Logic-Informed Inference from Temporal Action Patterns C. Yang, S. Cui, Y. Yang and S. Li. International Conference on Machine Learning (ICML), 2025. Convergence of Mean-Field Langevin Stochastic Descent-Ascent for Distributional Minimax Optimization Z. Liu, F. Liu, R. Gao and S. Li. International Conference on Machine Learning (ICML), 2025. (Spotlight, acceptance rate: 2.6%) Logic-Logit: A Logic-Based Approach to Choice Modeling S. Zhang, W. Ren and S. Li. International Conference on Learning Representations (ICLR), 2025. HyperLogic: Enhancing Diversity and Accuracy in Rule Learning with HyperNets Y. Yang, W. Ren and S. Li. Neural Information Processing Systems (NeurIPS), 2024. Neuro-Symbolic Temporal Point Processes Y. Yang, C. Yang, B. Li, Y. Fu and S. Li. International Conference on Machine Learning (ICML), 2024. Latent Logic Tree Extraction for Event Sequence Explanation from LLMs Z. Song, C. Yang, C. Wang, B. An and S. Li. International Conference on Machine Learning (ICML), 2024. Unveiling Latent Causal Rules: A Temporal Point Process Approach for Abnormal Event Explanation Y. Kuang *, C. Yang *, Y. Yang and S. Li. International Conference on Artificial Intelligence and Statistics (AISTATS), 2024. Enhancing Human-AI Collaboration Through Logic-Guided Reasoning C. Cao, Y. Fu, S. Xu, R. Zhang and S. Li. International Conference on Learning Representations (ICLR), 2024. Amortized Network Intervention to Steer Excitatory Point Processes Z. Song, W. Ren and S. Li. International Conference on Learning Representations (ICLR), 2024. Discovering Intrinsic Spatial-Temporal Logic Rules to Explain Human Actions C. Cao, C. Yang, R. Zhang and S. Li. Neural Information Processing Systems (NeurIPS), 2023. Explaining Point Processes by Learning Interpretable Temporal Logic Rules S. Li*, M. Feng *, L. Wang, A. Essofi, Y. Cao, J. Yan and L. Song. International Conference on Learning Representations (ICLR), 2022. Temporal Logic Point Processes S. Li, L. Wang, R. Zhang, X. Chang, X. Liu, Y. Xie, Y. Qi, and L. Song International Conference on Machine Learning (ICML), 2020. Continuous-Time Dynamic Graph Learning via Neural Interaction Processes X. Chang, X. Liu, J. Wen, S. Li, Y, Fang, L. Song, and Y. Qi The Conference on Information and Knowledge Management (CIKM), 2020. Generative Adversarial User Model for Reinforcement Learning Based Recommendation System X. Chen, S. Li, H. Li, S. Jiang, Y. Qi, and L. Song International Conference on Machine Learning (ICML), 2019. Learning Temporal Point Processes via Reinforcement Learning S. Li, S. Xiao, S. Zhu, N. Du, Y. Xie, and L. Song Neural Information Processing Systems (NIPS), 2018. (Spotlight, acceptance rate: 168/4856 = 3.5%) Recurrent Hidden Semi-Markov Model H. Dai, B. Dai, Y. Zhang, S. Li, and L. Song International Conference on Learning Representations (ICLR), 2017. Fake News Mitigation via Point Processes Based Intervention M. Farajtabar, J. Yang, X. Ye, R. Trivedi, E. Khalil, S. Li, H. Xu, L. Song, and H. Zha International Conference on Machine Learning (ICML), 2017. Online Seismic Event Picking Via Sequential Change-Point Detection S. Li, Y. Cao, C. Leamon, Y. Xie, L. Shi, and W. Song Allerton Conference on Control, Communications and Computing (Allerton), 2016. M-Statistic for Kernel Change-Point Detection S. Li, Y. Xie, H. Dai, and L. Song Neural Information Processing Systems (NIPS), 2015. Efficient Learning of Continuous-Time Hidden Markov Models for Disease Progression Y. Liu, S. Li, F. Li, L. Song, and J. Rehg Neural Information Processing Systems (NIPS), 2015. COEVOLVE: A Joint Point Process Model for Information Diffusion and Network Co-evolution M. Farajtabar, Y. Wang, M. Gomez-Rodriguez, S. Li, H. Zha, and L. Song Neural Information Processing Systems (NIPS), 2015. (Oral, acceptance rate: 15/1838 = 0.8%) Journal Micro-Randomized Trials for Promoting Engagement in Mobile Health Data Collection: Adolescent/Young Adult Oral Chemotherapy Adherence as an Example S. Li, A. Psihogios, E. McKelvey, A. Ahmed, M. Rabbi, and S. Murphy Current Opinion in Systems Biology, 2020. Scan B-statistic for Kernel Change-point Detection S. Li, Y. Xie, H. Dai, and L. Song Sequential Analysis, 38(4):503-544, 2019. — Finalist of 2018 INFORMS QSR Best Student Paper Competition Detecting Weak Changes in Dynamic Events over Networks S. Li, Y. Xie, M. Farajtabar, A. Verma, and L. Song IEEE Transactions on Signal and Information Processing over Networks, Vol. 3, No. 2, June 2017. — Finalist of 2018 INFORMS Social Media analytics Best Student Paper Competition COEVOLVE: A Joint Point Process Model for Information Diffusion and Network Co-evolution M. Farajtabar, Y. Wang, M. Gomez-Rodriguez, S. Li, H. Zha, and L. Song Journal of Machine Learning Research, 2017. Control for Time-Varying Delay Systems by Integrating Semi-Discretization and Hysteresis-Based Switching C. Shao, S. Li, H. Li, and J. Sheng Asi",
  "content_length": 14409,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:54"
}