{
  "name": "Shubhra Kanti Karmaker Santu",
  "homepage": "https://karmake2.github.io",
  "status": "success",
  "content": "Welcome to my personal homepage - Bridge-AI Lab Shubhra Kanti Karmaker (Santu)Assistant ProfessorL3Harris Engineering CenterRoom 255Department of CSUCF Follow Orlando, FL, USA Email ResearchGate Twitter LinkedIn Bitbucket Github Google Scholar DBLPMy name is Shubhra Kanti Karmaker (“Santu”). I am a Tenure-Track Assistant Professor in the Department of Computer Science at the University of Central Florida (UCF), and also affiliated with the Institute of Artificial Intelligence and Learning Science Faculty Cluster. My primary research interest lies at the intersection of Natural Language Processing and Information Retrieval. I am also the founding director of the Bridge-AI Lab at UCF, where my students and I work on creating bridges between the general public and AI tools in order to democratize AI beyond the tech-savvy communities.Before joining UCF, I was an Assistant Professor in the Department of Computer Science and Software Engineering at Auburn University, Alabama. Before joining Auburn University, I was a Postdoctoral Research Associate in the Laboratory for Information and Decision Systems at the Massachusetts Institute of Technology (MIT). Before joining MIT, I completed my Ph.D. in computer science from the University of Illinois Urbana-Champaign (UIUC) under the supervision of Prof. ChengXiang Zhai. During my Ph.D., I also worked as a research intern at Microsoft Research (Summer 2017 and 2018), Yahoo Research (Summer 2016), and @WalmartLabs (Summer 2015).You can download my full CV here.Research InterestsSpotlight! 1. Our Psycholinguistic Ranking of LLMs is now live. 2. Check out our TELeR Taxonomy for Prompting LLMs 3. Moved to UCF and founded the Bridge-AI Lab @UCF.Our Sponsors (Thank You!!)News and Announcements[October 2025] We just launched a new ranking system of LLMs based on their ability to resist cognitive biases with a large-scale study of 2.8M+ responses across 8 well-known biases (Anchoring, Availability, Confirmation, Framing, Prospect Theory & more). Explore the live rankings here.[August 2024] I have Moved to UCF and founded the Bridge-AI Lab @UCF.[March 2024] I have been selected for a DAAD (German Academic Exchange Service) Faculty Fellowship called “Research Stays for University Academics and Scientists”. I will visit the Technical University of Darmstadt during the summer of 2024 to collaborate with Prof. Iryna Gurevych.[March 2024] I have been selected to receive the 2024 100+ Women Strong Leadership in Diversity Faculty/Staff Award at the Samuel Ginn College of Engineering at AUBURN.Media CoverageMatthew Freestone and Matthew Williams were selected for Honorable Mention in the 2023-2024 Outstanding Undergraduate Researcher Award (URA) from Computing Research Association (CRA). News LinkCheck out our podcast with Professor Sean Ammirati from the CMU Business College, who found our TELeR taxonomy very useful and initiated this engaging conversation. Podcast LinkAuburn Engineering College featured me on August 2023. News VideoMy expert opinion on the Rise of the Chatbot and the Legal Dilemma. Al.com NewsAI expert opinion on the Large Language Models and Chatbots. NewsAuburn Engineering College reporting our championship in the “Food for Thought” National NLP challenge. NewsAuburn Agriculture College reporting our championship in the “Food for Thought” National NLP challenge. NewsOlder News[January 2024] Matthew Freestone and Matthew Williams were selected for Honorable Mention in the 2023-2024 Outstanding Undergraduate Researcher Award (URA) from Computing Research Association (CRA).[January 2024] I will give an Invited Talk on “Democratizing AI” at the University of Pittsburgh.[December 2023] Check out our podcast with Professor Sean Ammirati from the CMU Business College, who found our TELeR taxonomy very useful and initiated this engaging conversation. Podcast Link[December 2023] I gave an Invited Talk on “Democratizing AI” at the University at Buffalo.[November 2023] I gave an Invited Talk on “Democratizing AI” at the University of Central Florida.[November 2023] Mousumi Akter defended her Ph.D. thesis and has become the second Ph.D. graduate from my group. She will join TU Dortmund as an independent research lead in December. Congratulations Dr. Akter.[October 2023] Three papers from our group have been accepted to EMNLP 2023.[August 2023] I have created a crash course about ACL Rolling Review (ARR) Service for the ACL Community. Youtube Link[July 2023] Received $700,854 basic research grant as the lead PI from NSF. News/(Award)[July 2023] Received $542,485 basic research grant as the sole PI from AFOSR. News[July 2023] My first Ph.D. Student Dongji Feng graduated this Summer. He is joining as a tenure-track assistant professor at Gustavus Adolphus College in Minnesota.[May 2023] Journal paper accepted at Information Processing and Management (Impact Factor 7.5)!![March 2023] My students Naman Bansal and Mousumi Akter have been selected for Auburn University’s Outstanding Doctoral student award. Great Achievement!! Congratulations to them.[March 2023] My students Souvika Sakar and Mousumi Akter have been named 100+ Women Strong Outstanding Graduate Student Award recipients. Congratulations to them!!![February 2023] I am now serving as the Communication Chair of ACL Rolling Reviews (ARR) Initiative. ARR[December 2022] Champion in the “Food for Thought” National NLP challenge hosted by Coleridge Initiative in collaboration with the US Department of Agriculture. Engineering College News / Agriculture College News[October 2022] Awarded Short-Term Innovative Research (STIR) Grant as PI. Sponsor: Army Research Office (ARO).[October 2022] Paper accepted at ACM Transactions on Intelligent Systems and Technology (Impact Factor 10.5)!!![October 2022] Paper accepted at IEEE BigData 2022.[September 2022] Two Papers accepted at EMNLP 2022.[September 2022] Two Papers accepted at AACL/IJCNLP 2022.[September 2022] Paper accepted at COLING 2022.[March 2022] Paper accepted at ACL 2022.[October 2021] I am serving as an action editor for ACL rolling reviews (ARR)![February 2022] Survey paper accepted at ACM Computing Surveys (Impact Factor 14.3)!!!![October 2020] Best Poster Nomination at CIKM 2020 !!![September 2020] Awarded Seed Grant as PI. Sponsor: Arizona State University.[January 2020] Joined Auburn University.",
  "content_length": 6351,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:57"
}