{
  "name": "Shubham Jain",
  "homepage": "https://www3.cs.stonybrook.edu/~jain",
  "status": "success",
  "content": "Shubham Jain Toggle navigation Shubham Jain Home Publications Research Teaching Dataset Contact Office: 333, New Computer Science Building Email: jain[at]cs.stonybrook.edu I am an Associate Professor in the Computer Science Department at Stony Brook University. My research interests lie at the intersection of smart environments and cyber-physical systems (CPS), particularly in building software and architectural support for enabling large-scale analytics on pervasive sensing devices. My research has enabled ubiquitous devices to expand their role and innovate new services, ranging from large-scale video analytics to pedestrian safety. I am also interested in using wearable sensors for enabling low-cost scalable monitoring of health parameters. Prior to this, (Fall 2020-Summer 2025), I was an Assistant Professor in the CS department at Stony Brook University and from Fall 2017 - Summer 2020, I was an Assistant professor in the Department of Computer Science at Old Dominion University. I received my PhD in Electrical and Computer Engineering at Winlab, Rutgers University, in June 2017. I am looking for motivated PhD students to join my research group! Send me an email with your CV and a short statement of research interests, if you're interested. NEWS! 8/2025: Promoted to Associate Professor with tenure! 1/2025: Our new year started with a paper accepted to ICLR 2025! 9/2024: Two papers accepted to ACM/IEEE SEC 2024! 9/2024: Unvoiced has been conditionally accepted to ACM SenSys 2024! 8/2024: Our proposed work on designing and developing assistive wearable technology received an OVPR Seed grant. 1/2024: Recognized as a rising star in the 2023 list of N2Women: Rising Stars in Computer Networking and Communications. Thank you, N2Women! 10/2023: Our paper Jawthenticate: Microphone-free Speech-based Authentication using Jaw Motion and Facial Vibrations has been accepted to ACM SenSys 2023! 02/2023: NSF CAREER awarded for developing \"Closed-loop Health Behavior Interventions for Sparse Multi-device Environments\" 11/2022: Our paper on Making Smartphone Applications Accessible to Blind Users has been conditionally accepted to ACM MobiCom 2023! 7/2022: Our paper on Recognizing unvoiced commands has been accepted to ACM IMWUT! We will be presenting at UbiComp 2022 in Atlanta! 6/2022: Our paper on visual attention guided disease classification has been accepted to ECCV! 4/2022: Our Vi-Fi dataset is now publically available!",
  "content_length": 2455,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:57"
}