{
  "name": "Shuguang Cui",
  "homepage": "https://sse.cuhk.edu.cn/en/faculty/cuishuguang",
  "status": "success",
  "content": "CUI, Shuguang | School of Science and Engineering Search Search SEARCH CUHK-Shenzhen 简体中文 About the School Introduction of SSE Dean’s message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Students’ Activities Students’ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments About the School Introduction of SSE Dean’s message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Students’ Activities Students’ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments CUHK-Shenzhen 简体中文 CUI, Shuguang X.Q. Deng Presidential Chair Professor Fellow of Royal Society of Canada, Fellow of Canadian Academy of Engineering, IEEE Fellow Education Background PhD (Stanford University)ME (McMaster University)BE (Beijing University of Posts and Telecommunications) Research Field AI+Networking Academic Area Computer Engineering, Electrical Engineering, Artificial Intelligence and Robotics Personal Website (CUHK-Shenzhen) https://myweb.cuhk.edu.cn/cuishuguang Email shuguangcui@cuhk.edu.cn Biography Shuguang Cui received his Ph.D. in Electrical Engineering from Stanford University, California, USA, in 2005. Afterwards, he has been working as assistant, associate, full, Chair Professor in Electrical and Computer Engineering at the Univ. of Arizona, Texas A&M University, UC Davis, and CUHK at Shenzhen respectively. His current research interests focus on the merging between AI and communication networks. He was selected as the Thomson Reuters Highly Cited Researcher and listed in the Worlds’ Most Influential Scientific Minds by ScienceWatch in 2014. He was the recipient of the IEEE Signal Processing Society 2012 Best Paper Award. He was also the Vice Chair of the IEEE VT Fellow Evaluation Committee and a member of the IEEE ComSoc Award Committee. He was elected as an IEEE Fellow in 2013, an IEEE ComSoc Distinguished Lecturer in 2014, and IEEE VT Society Distinguished Lecturer in 2019. In 2020, he won the IEEE ICC best paper award, ICIP best paper finalist, the IEEE Globecom best paper award. In 2021, he won the IEEE WCNC best paper award. In 2023, he won the IEEE Marconi Best Paper Award, got elected as a Fellow of both Canadian Academy of Engineering and the Royal Society of Canada, and started to serve as the Editor-in-Chief for IEEE Transactions on Mobile Computing. Academic Publications Selected List:M. Chen, H. V. Poor, W. Saad, and S. Cui “Convergence Time Optimization for Federated Learning over Wireless Networks,” IEEE Transactions on Wireless Communications, 2020. (Highly Cited Paper)S. Zhang, S. Cui, and Z. Ding, “Hypergraph based Image Processing,” 2020 IEEE International Conference on Image Processing (ICIP), Oct. 2020. (Paper Award Finalist)Y. Hu, M. Chen, W. Saad, H. V. Poor, and S. Cui, “Meta-Reinforcement Learning for Trajectory Design in Wireless UAV Networks,” IEEE GLOBECOM, Taiwan, Dec. 2020. (IEEE Globecom Best Paper Award)Y. Ma, Y. Gao, C. Fu, W. Rong, Z. Xiong, and S. Cui, \"TV White Space Spectrum Analysis Based on Machine Learning,\" Journal of Communications and Information Networks, Vol. 4, No. 2, pp. 68-80. Jun. 2019. (Best Paper Award)C. Liu, C. Guo, Y. Yang, M. Chen, H. V. Poor, and S. Cui, \"Optimization of User Selection and Bandwidth Allocation for Federated Learning in VLC\\RF Systems,\"IEEE Wireless Communications and Networking Conference (WCNC), Nanjing,China, March 2021. (Best Paper Award)M. Chen, Z. Yang, W. Saad, C. Yin, H. V. Poor, S. Cui, “A Joint Learning and Communications Framework for Federated Learning over Wireless Networks,” IEEE Transactions on Wireless Communications, 2020. (Marconi Prize Paper Award)M. Chen, N. Shlezinger, H. V. Poor, Y. C. Eldar, and S. Cui, \"Communication-efficient federated learning,\" Proceedings: National Academy of Sciences of the United States of America (PNAS), vol. 118, no. 17, Apr. 2021.X. Cao, F. Wang, J. Xu, and Shuguang Cui, “Joint Computation and Communication Cooperation for Energy-Efficient Mobile Edge Computing,” IEEE Internet of Things Journal, Vol. 6, No. 3, pp. 4188-4200, June 2019. (Highly Cited Paper)Z. Wang, L. Liu, S. Cui, “Channel Estimation for Intelligent Reflecting Surface Assisted Multiuser Communications: Framework, Algorithms, and Analysis,” IEEE Transactions on Wireless Communications, Vol. 19, No. 10, pp. 6607-6620, Oct. 2020 (Highly Cited Paper) Follow us Get In Touch Campus Map Contact Us Join us Explore More Admissions Office Registry Office Office of Academic Links Research Administration Office Library Media School News Copyright © CUHK-Shenzhen All Rights Reserved.",
  "content_length": 7991,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:58"
}