{
  "name": "Shuheng Zhou 0002",
  "homepage": "https://sites.google.com/view/shuhengz",
  "status": "success",
  "content": "Shuheng Zhou's homepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationShuheng ZhouI am Professor of Statistics at the University of California, Riverside. My research spans high dimensional statistics, machine learning, algorithms and privacy.Teaching | Publications by year | Bio email: szhou@ucr.eduSelected PreprintsS. Zhou. Semidefinite programming relaxations and debiasing for MAXCUT-based clustering. Submitted, 2025. 86 pages. pdf This paper combines two arXiv preprints:Semidefinite programming on population clustering: a global analysis. January 2023. pdfDebiasing and a local analysis for population clustering using semidefinite programming. January 2024. This paper supersedes an earlier version dated Nov. 2023. pdf My 6th grader asked Gemini Deep Research to summarize \"Semidefinite programming relaxations and debiasing for MAXCUT-based clustering\" based on arXiv versions. Posted here  is a gently scrutinized version to eliminate some speculations from Section 4.1.Selected Journal PapersThe authors on theory papers are alphabetically listedTheoretical Computer ScienceT.H. Chan, A. Gupta, B.M. Maggs and S. Zhou. On hierarchical routing in doubling metrics. ACM Transactions on Algorithms (TALG) Vol. 12 (4), pp 1--22, 2016. pdfS. Rao and S. Zhou. Edge disjoint paths in moderately connected graphs. SIAM Journal on Computing, Vol. 39 (5), pp 1856--1887, 2010. Journal versionA. Blum, A. Coja-Oghlan, A. Frieze and S. Zhou. Separating populations with wide data: a spectral analysis. Electronic Journal of Statistics, Vol. 3, pp 76--113, 2009. Journal LinkStatistics Theory and MethodologyS. Zhou. Thresholded Lasso for high dimensional variable selection. Annals of the Institute of Statistical Mathematics, Accepted for Publication, October 2025. Preliminary abstract appeared in Advances in Neural Information Processing Systems 22. Preprint pdf S. Zhou. Concentration of measure bounds for matrix-variate data with missing values. Bernoulli 30(1), pp 198–226, 2024. Originally posted on arXiv 2008.03244 titled \"The tensor quadratic forms\" (71 Pages), August 2020. pdf/ Journal Link.S. Zhou. Sparse Hanson-Wright inequalities for subgaussian quadratic forms. Bernoulli, Vol. 25 (3), pp 1603--1639, 2019. pdfK. Greenewald, S. Zhou, and A. Hero. The tensor graphical Lasso (TeraLasso). Journal of Royal Statistical Society, Series B 81 (5), pp 901--931, 2019. pdf /Journal LinkM. Hornstein, R. Fan, K. Shedden, and S. Zhou. Joint mean and covariance estimation with unreplicated matrix-variate data. Journal of the American Statistical Association, Vol. 114 (526), pp 682--696, 2019. pdf / R packageM. Rudelson and S. Zhou. Errors-in-variables models with dependent measurements. Electronic Journal of Statistics, Vol. 11 (1), pp 1699--1797, 2017. pdfS. Zhou. Gemini: Graph estimation with matrix variate normal instances. Annals of Statistics, Vol. 42 (2), pp 532--562, 2014. Journal Link M. Rudelson and S. Zhou. Reconstruction from anisotropic random measurements. IEEE Transactions on Information Theory, Vol. 59. (6), pp 3434--3447, 2013. pdf / talk slidesT. Tsiligkaridis, A. Hero, and S. Zhou. On convergence of Kronecker graphical Lasso algorithms. IEEE Transactions on Signal Processing ,Vol. 61 (7), pp 1743–1755, 2013. pdfS. Zhou, P. Rutimann, M. Xu, and P. Bühlmann. High-dimensional covariance estimation based on Gaussian graphical models. Journal of Machine Learning Research, Vol. 12 (91), pp 2975--3026, 2011. pdf / Journal Link S. van de Geer, P. Bühlmann, and S. Zhou. The adaptive and the thresholded Lasso for potentially misspecified models (and a lower bound for the Lasso). Electronic Journal of Statistics 2011, Vol. 5, 688-749. Journal LinkL. Wasserman and S. Zhou. A Statistical framework for differential privacy. Journal of the American Statistical Association, Vol. 105 (489), pp 375--389, 2010 (Appeared as a featured article). pdfS. Zhou, J. Lafferty, and L. Wasserman. Time varying undirected graphs. Machine Learning Journal, Vol 80, Numbers 2--3, pp 295--319, 2010 (Invited and peer reviewed; Special Issue on Learning Theory). pdfS. Zhou, J. Lafferty, and L. Wasserman. Compressed and privacy sensitive sparse regression. IEEE Transactions on Information Theory, Vol. 55 (2), pp 846--866, 2009. Preliminary abstract appeared in Advances in Neural Information Processing Systems (NIPS) 20. pdfSelected Conference Papers (Machine Learning)S. Zhou and K. Greenewald. Sharper rates of convergence for the tensor graphical Lasso estimator. Proceedings of 2024 IEEE International Symposium on Information Theory (ISIT 2024), Athens, Greece. pdf / linkR. Fan, B. Jang, Y. Sun, and S. Zhou. Precision matrix estimation with noisy and missing data. Proceedings of the 22nd International Conference on Artificial Intelligence and Statistics (AISTATS), PMLR 89:2810–2819, 2019. LinkK. Greenewald, S. Park, S. Zhou, and A. Giessing. Time-dependent spatially varying graphical models, with application to brain fMRI data analysis. Advances in Neural Information Processing Systems 30, 2017. pdfA. Kalaitzis, J. Lafferty, N. D. Lawrence, and S. Zhou. The Bigraphical Lasso. Proceedings of the 30th International Conference on Machine Learning (ICML), PMLR 28(3):1229–1237, 2013. Link S. Zhou. Thresholding procedures for high dimensional variable selection and statistical estimation. Advances in Neural Information Processing Systems 22, Pages 2304–2312, 2009. pdfS. Zhou, K. Ligett, L. Wasserman. Differential privacy with compression. Proceedings of 2009 IEEE International Symposium on Information Theory, Seoul, Korea, 2009. Preprint arXiv:0901.1365 / Link Selected TalksTensor graphical models for complex and high dimensional data. Algorithmic Advances for Statistical Inference with Combinatorial Structure, Simons Institute for the Theory of Computing, Berkeley, CA, Oct. 11-15, 2021. Abstract, Video Reconstruction from anisotropic random measurements. Coding, Complexity, and Sparsity Workshop (SPARC), University of Michigan, Ann Arbor, MI, August 5-7, 2013.  slidesHigh-dimensional covariance estimation based on Gaussian graphical models. IMA workshop on High Dimensional Phenomena, University of Minnesota, Minneapolis, MN, September 2011.  slidesThresholded Lasso for high dimensional variable selection. Probability  and Geometry in High Dimensions, Université Paris-Est Marne-la-Vallée, May 2010. slidesAstronomy picture of the dayFall in love with the journey -- Jared L. CohonGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 6510,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:59"
}