{
  "name": "Shuibing He",
  "homepage": "https://shuibing9420.github.io",
  "status": "success",
  "content": "Shuibing He heshuibing [at] zju.edu.cn Shuibing He is a Tenured Professor at the College of Computer Science and Technology, Zhejiang University (ZJU), where he leads the Intelligent Storage and Computing Systems (ISCS) Laboratory. He also serves as the Vice President of the Zhejiang Lab and the Deputy Director of the Zhejiang Key Laboratory of Big Data Intelligent Computing. Dr. He received his Ph.D. in Computer System Architecture from Huazhong University of Science and Technology in December 2009. Following his doctoral studies, he pursued postdoctoral research at Illinois Institute of Technology (IIT) from December 2011 to February 2015. In addition to his postdoctoral work, Dr. He has held academic positions at various institutions: he was an Assistant Professor at Wuhan University from January 2010 to October 2015, an Associate Professor from November 2015 to May 2019, and then joined Zhejiang University as a ZJU100 Young Professor in June 2019, where he was promoted to Tenured Professor in July 2025. Dr. He’s research interests span storage systems, intelligent computing, computer architecture, and high-performance computing. He has published over 100 papers in top-tier conferences and journals, including FAST, ASPLOS, MICRO, HPCA, EuroSys, ATC, SC, VLDB, TOCS, TC, TPDS, TOS, and TKDE. His work has been recognized with numerous awards, such as the First Prize of Science and Technology Progress in Zhejiang Province (2023), the World Internet Conference Awards for Pioneering Science and Technology (2025), the First Prize of Invention and Entrepreneurship Achievements of China Invention Association (2025), the Computing Power China–Annual Breakthrough Achievement Award (2025), and the ACM ChinaSys Best Doctoral Dissertation Award (2025). He has also been awarded over 20 grants from various sources, including the National Science Foundation of China, the Key Project of the National Natural Science Foundation of China- Regional Innovation Development Joint Fund, the National Key Research and Development Program, and industry partners like Alibaba, Huawei, and Ant Group. In addition to his research contributions, Dr. He is actively involved in the academic community. He serves as an Associate Editor for IEEE Transactions on Computers (TC) and IEEE Transactions on Parallel and Distributed Systems (TPDS), and as an Editor for CCF Transactions on High Performance Computing (THPC). He has taken on key roles in academic conferences, such as Program Chair for NAS2024 and General Chair for ChinaSys2024, PC member for ICDCS, SRDS, ICPP, IPDPS, CLUSTER. The open-source code for some of his projects is available in ISCS-ZJU-code. Dr. He is currently seeking Master’s, Ph.D., and Post-Doc candidates interested in computer architecture, computer systems, and artificial intelligence systems research. Interested individuals are encouraged to contact him with their CV. News Nov 9, 2025 I delivered a keynote titled “AI and 3-Body Computing Constellation: An Exploration of Research-Paradigm Shift” at the Digital & Intelligent Aerospace Forum of the World Internet Conference. Nov 8, 2025 I presented Zhejiang Lab’s AI exploration and practice at the Zhejiang AI Industry Application press conference. Nov 6, 2025 We win the 2025 World Internet Conference Awards for Pioneering Science and Technology! Congratulations! Oct 24, 2025 We successfully hosted the Forum on Novel Computing and Storage Technologies for Ultra-Large-Scale AI Clusters at CNCC25 in Harbin. And I gave the talk entitled “Large-Model Storage Systems”. Oct 19, 2025 I give a keynote entitled “Intelligent Computing and It’s Storage Systems” at the 5th CCF Distributed Computing and Systems Symposium, hangzhou, China. Sep 20, 2025 Weijian Chen wins the 2025 ACM ChinaSys Best Doctoral Dissertation Award! Congratulations! Sep 20, 2025 I give a talk entitled “Intelligent Computing Storage Systems” at the Frontier Technology Forum in CCFSys25, Beijing, China. Aug 30, 2025 We successfully held a forum on top-tier storage conference papers in the era of large models at the China Storage Conference in Wuhan. Aug 29, 2025 Yi Zhang and Ping Chen win the Excellent Poster Award at the China Storage Conference in Wuhan. Congratulations! Aug 23, 2025 We win the Computing Power China–Annual Breakthrough Achievement Award. Selected Publications (Full list) VLDB’25 Effective and Efficient Distributed Temporal Graph Learning through Hotspot Memory Sharing Longjiao Zhang, Rui Wang, Tongya Zheng, Ziqi Huang, Wenjie Huang, Xinyu Wang, Can Wang, Mingli Song, Sai Wu, and Shuibing He In Proceedings of the International Conference of Very Large Databases Endowment, 2025 PDF FAST’25 LeapGNN: Accelerating Distributed GNN Training Leveraging Feature-Centric Model Migration Weijian Chen, Shuibing He, Haoyang Qu, and Xuechen Zhang In Proceedings of the 23rd USENIX Conference on File and Storage Technologies, 2025 PDF Slides Code FAST’25 IMPRESS: An Importance-Informed Multi-Tier Prefix KV Storage System for Large Language Model Inference Weijian Chen, Shuibing He, Haoyang Qu, Ruidong Zhang, Siling Yang, Ping Chen, Yi Zheng, Baoxing Huai, and Gang Chen In Proceedings of the 23rd USENIX Conference on File and Storage Technologies, 2025 PDF Slides HPCA’25 GOPIM: GCN-Oriented Pipeline Optimization for PIM Accelerators Siling Yang, Shuibing He, Wenjiong Wang, Yanlong Yin, Tong Wu, Weijian Chen, Xuechen Zhang, Xian-He Sun, and Dan Feng In Proceedings of the 31st IEEE International Symposium on High-Performance Computer Architecture, 2025 PDF Slides SC’24 Enumeration of Billions of Maximal Bicliques in Bipartite Graphs without Using GPUs Zhe Pan, Shuibing He, Xu Li, Xuechen Zhang, Yanlong Yin, Rui Wang, Lidan Shou, Mingli Song, Xian-He Sun, and Gang Chen In Proceedings of the ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis, 2024 PDF Slides Code ATC’24 Efficient Large Graph Processing with Chunk-Based Graph Representation Model Rui Wang, Weixu Zong, Shuibing He, Xinyu Chen, Zhenxin Li, and Zheng Dang In Proceedings of the USENIX Annual Technical Conference, 2024 PDF Slides Code Long Talk TOCS’24 PMAlloc: A Holistic Approach to Improving Persistent Memory Allocation Zheng Dang, Shuibing He, Xuechen Zhang, Peiyi Hong, Zhenxin Li, Xinyu Chen, Haozhe Song, Xian-He Sun, and Gang Chen ACM Transactions on Computer Systems, 2024 PDF EuroSys’24 CCL-BTree: A Crash-Consistent Locality-Aware B+-Tree for Reducing XPBuffer-Induced Write Amplification in Persistent Memory Zhenxin Li, Shuibing He, Zheng Dang, Peiyi Hong, Xuechen Zhang, Rui Wang, and Fei Wu In Proceedings of the European Conference on Computer Systems, 2024 PDF Slides Code SC’23 Efficient Maximal Biclique Enumeration on GPUs Zhe Pan, Shuibing He, Xu Li, Xuechen Zhang, Rui Wang, and Gang Chen In the ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis, 2023 PDF Slides Code ASPLOS’23 Mapping Very Large Scale Spiking Neuron Network to Neuromorphic Hardware Ouwen Jin, Qinghui Xing, Ying Li, Shuiguang Deng, Shuibing He, and Gang Pan In 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 3, 2023 PDF Slides Long Talk HPCA’23 iCache: An Importance-Sampling-Informed Cache for Accelerating I/O-Bound DNN Model Training Weijian Chen, Shuibing He, Yaowen Xu, Xuechen Zhang, Siling Yang, Shuang Hu, Xian-He Sun, and Gang Chen In 2023 IEEE International Symposium on High-Performance Computer Architecture, 2023 PDF Slides Code HPCA’23 BM-Store: A Transparent and High-Performance Local Storage Architecture for Bare-Metal Clouds Enabling Large-Scale Deployment Yiquan Chen, Jiexiong Xu, Chengkun Wei, Yijing Wang, Xin Yuan, Yangming Zhang, Xulin Yu, Yi Chen, Zeke Wang, Shuibing He, and Wenzhi Chen In 2023 IEEE International Symposium on High-Performance Computer Architecture, 2023 PDF Slides MICRO’22 XPGraph: XPline-Friendly Persistent Memory Graph Stores for Large-Scale Evolving Graphs Rui Wang, Shuibing He, Weixu Zong, Yongkun Li, and Yinlong Xu In 2022 55th IEEE/ACM International Symposium on Microarchitecture, 2022 PDF Slides Code Short Talk ASPLOS’22 NVAlloc: Rethinking Heap Metadata Management in Persistent Memory Allocators Zheng Dang, Shuibing He, Peiyi Hong, Zhenxin Li, Xuechen Zhang, Xian-He Sun, and Gang Chen In 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, 2022 PDF Slides Code Short Talk Long Talk The best way to reach me is via my email.",
  "content_length": 8563,
  "method": "requests",
  "crawl_time": "2025-12-01 14:27:59"
}