{
  "name": "Shujie Cui",
  "homepage": "https://research.monash.edu/en/persons/shujie-cui",
  "status": "success",
  "content": "Shujie Cui - Monash University View Scopus Profile Shujie Cui Dr Senior Lecturer, Department of Software Systems & Cybersecurity https://orcid.org/0000-0001-8124-6800 EmailShujie.Cuimonashedu Accepting PhD Students 20142025 Research activity per year Personal profile BiographyI am a Senior Lecturer in the Department of Software Systems and Cybersecurity at the Faculty of Information Technology. I obtained my PhD degree from the University of Auckland in 2019. Before joining Monash University, I was a Post-Doc researcher in the Large-Scale Data & Systems (LSDS) group in the Department of Computing at Imperial College London, UK.Research interestsMy main research interests include applied cryptography, information security in cloud computing and distributed systems, trusted execution environments, and privacy-preserving machine learning. Education/Academic qualificationComputer Science, PhD, University of Auckland1 Jun 2015 → 30 Sept 2018Award Date: 10 Jun 2019 Research area keywordsCloud SecurityDistributed SystemsTrusted execution environmentsSide channel attacksApplied cryptography Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2022 2023 2025 2027 1 Finished 3 Active Projects per year Signature: Efficient Weighted Threshold SignatureCui, S. (Primary Chief Investigator (PCI)), Liu, J. (Chief Investigator (CI)) & Yuen, J. (Chief Investigator (CI))22/09/25 → 21/09/26Project: Research CSIRO Next Generation Graduates Program: Privacy-Preserving Machine Learning: Technology Development and AdoptionYuan, X. (Primary Chief Investigator (PCI)), Liu, J. (Chief Investigator (CI)), Ge, Z. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Yang, R. (Chief Investigator (CI)), Yi, X. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Fang, Y. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Baiao Dowsley, R. (Associate Investigator (AI)), Du, X. (Associate Investigator (AI)), Salehi, M. (Associate Investigator (AI)), Han, F. (Associate Investigator (AI)), Wakefield, R. (Associate Investigator (AI)), Abuadbba, S. (Associate Investigator (AI)), Wu, T. (Associate Investigator (AI)) & Liu, X. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Quantum Information Technology: Quantum Information Technology: Industry Readiness & ApplicationsSteinfeld, R. (Primary Chief Investigator (PCI)), simmons, M. (Chief Investigator (CI)), Usman, M. (Chief Investigator (CI)), Phung, D. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Pas, E. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Aleti, A. (Associate Investigator (AI)), Garcia De La Banda Garcia, M. (Associate Investigator (AI)), Nakashima, P. (Associate Investigator (AI)), Schmidt, D. (Associate Investigator (AI)), Esgin, M. (Associate Investigator (AI)) & Fay, J. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Algorand Centre of Excellence (ACE) on Sustainability Informatics for the PacificLiu, J. (Primary Chief Investigator (PCI)), Rudolph, C. (Chief Investigator (CI)), Pink, S. (Chief Investigator (CI)), Yu, J. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Steinfeld, R. (Chief Investigator (CI)), Du, X. (Chief Investigator (CI)), Liebman, A. (Chief Investigator (CI)), Ma, X. (Chief Investigator (CI)), Luebbers, J. (Chief Investigator (CI)), Ince, P. D. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuan, X. (Chief Investigator (CI)), Baiao Dowsley, R. (Chief Investigator (CI)), He, W. (Chief Investigator (CI)), Ko, R. K. L. (Chief Investigator (CI)), Dong, N. (Chief Investigator (CI)), Kuchta, V. (Chief Investigator (CI)), Komarek, A. M. (Chief Investigator (CI)), Radke, A. (Chief Investigator (CI)), Carvalho, G. (Chief Investigator (CI)), Risius, M. (Chief Investigator (CI)), Dargusch, P. J. (Chief Investigator (CI)), Gramoli, V. (Chief Investigator (CI)), Salampasis, D. (Chief Investigator (CI)), Wang, Z. (Chief Investigator (CI)), Au, M. A. (Chief Investigator (CI)), Luo, X. D. (Chief Investigator (CI)), Ali, S. (Chief Investigator (CI)), Sharma, B. (Chief Investigator (CI)), Boorman, J. (Chief Investigator (CI)), Wainwright, T. (Chief Investigator (CI)), Esgin, M. (Chief Investigator (CI)), Cui, S. (Chief Investigator (CI)) & Cui, H. (Chief Investigator (CI))1/08/22 → 1/06/23Project: Research Research output Research output per year 2014 2017 2018 2021 2022 2023 2024 2025 2025 25 Conference Paper 9 Article Research output per year Research output per year CHIFRAUD: A Long-term Web Text Benchmark for Chinese Fraud DetectionTang, M., Zou, L., Liang, S. N., Jin, Z., Wang, W. & Cui, S., 2025, COLING 2025, The 31st International Conference on Computational Linguistics, Proceedings of the Main Conference. Rambow, O., Wanner, L., Apidianaki, M., Al-Khalifa, H., Di Eugenio, B. & Schockaert, S. (eds.). Stroudsburg PA USA: Association for Computational Linguistics (ACL), p. 5962-5974 13 p. (Proceedings - International Conference on Computational Linguistics, COLING; vol. Part F206484-1).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) Private Learning for Vertical Decision Trees: A Secure, Accurate, and Fast RealizationSong, A., Cheng, K., Fu, J., Cui, S., Zhang, T., Chang, Z. & Shen, Y., Nov 2025, In: IEEE Transactions on Dependable and Secure Computing. 22, 6, p. 6088-6103 15 p.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) Searchable Encryption for Conjunctive Queries with Extended Forward and Backward PrivacyZuo, C., Lai, S., Sun, S., Yuan, X., Liu, J. K., Shao, J., Wang, H., Zhu, L. & Cui, S., 2025, Proceedings on Privacy Enhancing Technologies Symposium 2025. Jansen, R. & Shafiq, Z. (eds.). 1 ed. Rochester NY USA: Privacy Enhancing Technologies, Vol. 2025. 16 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Sequential recommendation by reprogramming pretrained transformerTang, M., Cui, S., Jin, Z., Liang, S. N., Li, C. & Zou, L., Jan 2025, In: Information Processing and Management. 62, 1, 15 p., 103938.Research output: Contribution to journal › Article › Research › peer-review 9 Citations (Scopus) Verifiable Conjunctive Searchable Symmetric Encryption with Result Pattern HidingChung-Nguyen, H.-H., Yuan, D. & Cui, S., 2025, Provable and Practical Security - 18th International Conference, ProvSec 2024 Gold Coast, QLD, Australia, September 25–27, 2024 Proceedings, Part I. Liu, J. K., Chen, L., Sun, S.-F. & Liu, X. (eds.). Singapore Singapore: Springer, p. 85-105 21 p. (Lecture Notes in Computer Science; vol. 14903).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) View all 34 research outputs",
  "content_length": 7281,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:01"
}