{
  "name": "Shumo Chu",
  "homepage": "https://shumochu.com",
  "status": "success",
  "content": "Shumo Chu - Computer Science ResearcherI am an entreprenuer/computer scientist/angel investor. I am building a stealth mode AI startup, follow me on X and LinkedIn to know more. I have worked on database systems, cryptographically verifiable machine learning, and formal verication. I got my PhD at University of Washington, where I had the fortune to to be advised by Dan Suciu. Writings•System 1, System 2 and The Multi-Agents Future(2025)Exploring how System 1 and System 2 thinking modes apply to LLMs and shape the future of multi-agent AI systems coordinating fast intuitive responses with deep strategic reasoning.•Semaphore: the unsung hero behind Zuzalu Pass and Worldcoin(2023)Semaphore is your anonymous identity vault on Ethereum, powering privacy-preserving applications like ZuPass and Worldcoin through zero-knowledge proofs.•Tornado.cash and the Future of On Chain Privacy(2022)An analysis of Tornado.cash sanctions and the critical importance of privacy for the future of Web3, exploring technical solutions and killer applications for on-chain privacy.•Let's Build the Next Generation Database Systems Together(2020)A vision for building the next generation database systems with focus on provable correctness, trust minimization, and data privacy.Projects•ZEN (2021) — An optimizing compiler for verifiable, zero-knowledge neural network inferences that produces efficient verification schemes while maintaining privacy•Nebra UPA (2024) — The first Universal Proof Aggregation protocol that enables cheap verification of zero-knowledge proofs on Ethereum through recursive SNARKs•Manta (2021) — A privacy-focused DeFi framework featuring multi-asset anonymous payments and decentralized exchange with optimized zero-knowledge proofs•Cosette (2018) — An automated SQL solver for semantic query equivalence using SMT solvers and formal verification techniquesInvestments•CDimension (2025) — Semiconductor technology company advancing chip design through atomically-thin 2D materials and monolithic architecture, achieving up to 1,000x improvements in energy efficiency · Sector: Semiconductor / Advanced Materials · Status: Active•MegaETH (2024) — The first real-time blockchain with sub-millisecond latency and 100,000+ transactions per second throughput · Sector: Blockchain Infrastructure · Status: Active•Hyperbolic (2023) — Open-access AI cloud infrastructure platform providing GPUs up to 75% cheaper than legacy clouds, serving 200,000+ engineers and researchers · Sector: AI Infrastructure · Status: Active",
  "content_length": 2531,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:02"
}