{
  "name": "Shungeng Zhang",
  "homepage": "https://sgzhang.top",
  "status": "success",
  "content": "Welcome to Shungeng Zhang's Homepage To prospective students: I'm always looking for students who have a solid background in computer systems and share my research interests. If you are interested, please e-mail me with your CV and transcripts. About Me I am an assistant professor of Computer Science in the School of Computer and Cyber Sciences at Augusta University. I received my Ph.D. degree in Computer Science from Louisiana State University in 2021. Before that, I received my B.E. degree from Huazhong University of Science and Technology in 2014. Research Interests My research interests lie in the field of distributed systems, cloud computing, and cybersecurity, which focuses on improving the performance and scalability of large-scale web applications and IoT stream processing systems to simultaneously achieve both good performance and high resource utilization efficiency in the cloud. In my research, I actively adopt sophisticated timeline analysis methods with fine-grained monitoring data to find and study the transient bottlenecks which could lead to the long tail latency problem of the web-facing applications in the cloud. The transient bottlenecks (even with a very short lifespan such as 50ms) could lead to significant performance loss caused by the propagation and amplification effect, which is due to the complex dependency chains among components in web-facing applications. By correlating the transient bottlenecks with observed system performance metrics (e.g., throughput and load), the system can identify and remove the transient events which cause transient bottlenecks and bring better scalability and elasticity to web applications in the cloud. Teaching AIST 4720: Enterprise System Architectures (Spring 2022) CSCI 1200: Introduction to Computers and Programming (Fall 2021) Publications 2022 Shungeng Zhang, Qingyang Wang, Yasuhiko Kanemasa, Julius Michaelis, Jianshu Liu, and Calton Pu. 2022. \"ShadowSync: Latency Long Tail caused by Hidden Synchronization in Real-time LSM-tree based Stream Processing Systems.\" In 23rd ACM/IFIP International Middleware Conference (Middleware'22), November 7-11, 2022, Quebec, QC, Canada. ACM, New York, NY, USA, 14 pages. https://doi.org/10.1145/3528535.3565251. Jianshu Liu, Shungeng Zhang, Qingyang Wang, and Jingpeng Wei, \"Coordinating Fast Concurrency Adapting with Autoscaling for SLO-Oriented Web Applications.\", to appear in IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS). 2020 Shungeng Zhang, Qingyang Wang, Yasuhiko Kanemasa, Jianshu Liu, and Calton Pu, \"DoubleFaceAD: A New Datastore Driver Architecture to Optimize Fanout Query Performance.\", to appear in the 21st ACM/IFIP International Middleware Conference (Middleware'20), Delft, Netherlands, December 2020. Jianshu Liu, Shungeng Zhang, Qingyang Wang, and Jinpeng Wei, âMitigating Large Response Time Fluctuations through Fast Concurrency Adapting in the Cloud.â, to appear in the 34th IEEE International Parallel & Distributed Processing Symposium (IPDPS'20), New Orleans, LA, USA, May 2020. 2019 Shungeng Zhang, Huasong Shan, Qingyang Wang, Jianshu Liu, Qiben Yan, and Jinpeng Wei, âTail Amplification in n-Tier Systems: A Study of Transient Cross-Resource Contention Attacksâ, to appear in the 39th International Conference on Distributed Computing Systems (ICDCS'19), Dallas, Texas, July 2019. Shungeng Zhang, Qingyang Wang, Yasuhiko Kanemasa, Huasong Shan, and Liting Hu, âThe Impact of Event Processing Flow on Asynchronous Server Efficiencyâ, to appear in IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), vol.31, issue 3 (September 2019), 15 pages. Qingyang Wang§, Shungeng Zhang§, Yasuhiko Kanemasa, Calton Pu, Balaji Palanisamy, Lilian Harada, and Motoyuki Kawaba, \"Optimizing N-Tier Application Scalability in the Cloud: A Study of Soft Resource Allocation\", to appear in the ACM Transactions on Modeling and Performance Evaluation of Computing Systems (ACM TOMPECS) (§ Equal contribution), vol. 4, issue 2, Article 10 (June 2019), 27 pages. Qingyang Wang, Shungeng Zhang, Yasuhiko Kanemasa, Calton Pu, \"Mitigating Tail Response Time of n-Tier Applications: The Impact of Asynchronous Invocations\", to appear in ACM Transactions on Internet Technology (ACM TOIT), vol. 19, no. 3, Article 36 (July 2019), 25 pages. 2018 Qingyang Wang, Hui Chen, Shungeng Zhang, Liting Hu, and Balaji Palanisamy, âIntegrating Concurrency Control in n-Tier Application Scaling Management in the Cloudâ, to appear in IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), vol. 30, no. 4, pp. 855-869, April 1 2019. Shungeng Zhang, Qingyang Wang, and Yasuhiko Kanemasa, âImproving Asynchronous Invocation Performance in Client-server Systemsâ, to appear in the 38th International Conference on Distributed Computing Systems (ICDCS'18), Vienna, Austria, July 2018. (Acceptance rate < 20%) 2017 Qingyang Wang, Chien-An Lai, Yasuhiko Kanemasa, Shungeng Zhang, and Calton Pu, \"A Study of Long-Tail Latency in n-Tier Systems: RPC vs. Asynchronous Invocations\", to appear in the 37th International Conference on Distributed Computing Systems (ICDCS'17), Atlanta, GA, June 2017. (Acceptance rate: 90/531=16.9%) Experiences Aug. 2015 - Aug. 2021, Research Assistant at Louisiana State University, supervised by Prof. Qingyang Wang Jun. 2019 - Aug. 2019, Research Intern at FUJITSU LABORATORIES LTD. (Japan), supervised by Dr. Yasuhiko Kanemasa Jun. 2014 - Jan. 2015, Research Assistant at Huazhong University of Science and Technology, supervised by Prof. Gang Shen Jun. 2013 - Sep. 2014, Research Assistant at Huazhong University of Science and Technology, supervised by Prof. Wenyu Liu Updated Time: Tuesday, November 30, 2021",
  "content_length": 5723,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:02"
}