{
  "name": "Shun-Ren Yang",
  "homepage": "http://www.cs.nthu.edu.tw/~sryang",
  "status": "success",
  "content": "ï»¿ æ¥èä»èå¸« Contact Calendar Biography Teaching Research Interests Publication List Presentations/Talks Research Projects Professional Society Activities Awards Services æ¥èä»èå¸« Shun-Ren Yang, Ph.D. Professor, Wireless and Mobile Networking (WMNet) Lab, Department of Computer Science and Institute of Communications Engineering, National Tsing Hua University, No. 101, Sec. 2, Kuang Fu Rd., Hsinchu, Taiwan 300, R.O.C. Tel: +886-3-5731212, Fax: +886-3-5723694 Email: sryangcs.nthu.edu.tw Last updated: Mar. 4, 2020 Calendar: Semester of 2013 Spring ç¯æ¬¡ æé é±ä¸ é±äº é±ä¸ é±å é±äº 1 8:00 - 8:50 > > > > > 2 9:00 - 9:50 > > VoIP Meeting > > 3 10:10 -11:00 Office Hours Lab Meeting > CS5325(127) 4 11:10 -12:00 Office Hours Lab Meeting > 5 13:10 -14:00 > > > > > 6 14:10 -15:00 > > > ISA5362(125)> 7 15:20 -16:10 CS5325(127) Dept. Meeting CS5291(128) ISA5362(125)(236)> 8 16:20 -17:10 CS5325(127) CS5291(128) > CS5291(128) ISA5362(125)> 9 17:20 -18:10 Group Meeting > > > åå°é é¦ Biography B.S. in Computer Science and Information Engineering, National Chiao Tung University, Taiwan, R.O.C., June 1998. M.S. in Computer Science and Information Engineering, National Chiao Tung University, Taiwan, R.O.C., June 1999. Ph.D. in Computer Science and Information Engineering, National Chiao Tung University, Taiwan, R.O.C., February 2004.Dissertation title: Controlling Inactivity Counter/Timer for 3G Mobility Management and Power Saving (Dissertation Advisor: Professor Yi-Bing Lin). Visiting Scholar in Information Engineering, The Chinese University of Hong Kong, Hong Kong, April 1 ~ July 31, 2004. Assistant Professor in Dept. of Computer Science, National Tsing Hua University, Taiwan, R.O.C., August, 2004 ~ July, 2010. Visiting Scholar in Broadband Communications Research (BBCR) Group, Dept. of Electrical and Computer Engineering, University of Waterloo, Canada, July 1 ~ August 31, 2008. åå°é é¦ Teaching 2009 Spring, CS 5291 Stochastic Processes for Networking 2008 Fall, CS 7271 Special Topics in Network Performance Analysis 2008 Fall, CS 3332 Probability and Statistics 2008 Fall, COM 5342 Mobile Telecommunications Networks 2008 Spring, CS 5291 Stochastic Processes for Networking 2007 Fall, CS 3332 Probability and Statistics 2007 Fall, COM 5340 Wireless Communications Networks 2007 Spring, CS 5291 Stochastic Processes for Networking 2007 Spring, CS 1356 Introduction to Information Engineering 2006 Fall, COM 5340 Wireless Communications Networks 2006 Spring, CS 2336 Discrete Mathematics 2005 Fall, COM 5340 Wireless Communications Networks 2005 Fall, CS 5291 Stochastic Processes for Networking 2005 Spring, CS 2336 Discrete Mathematics 2004 Fall, COM 5115 Stochastic Processes for Networking åå°é é¦ Research Interests Mobile Telecommunications Networks Mobile Computing Wireless Internet Computer Telephony Integration Voice over IP (VoIP) Performance Modeling åå°é é¦ Copyright © Shun-Ren Yang all rights reserved.",
  "content_length": 2987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:01"
}