{
  "name": "Shuo Li 0001",
  "homepage": "https://case.edu/medicine/ccir/faculty/shuo-li",
  "status": "success",
  "content": "Shuo Li | CWRU Center for Imaging Research | School of Medicine | Case Western Reserve University Skip to main content Go to case.edu School of Medicine CWRU Center for Imaging Research Search × Warning message Shuo Li cannot be edited as it was published by another site. The content can only be edited at the source site here. Home faculty shuo li Shuo Li, PhD Email shuo.li11@case.edu Office Location: Wickenden 517B Leonard Case, Jr. Professorship in Engineering at Case Western Reserve University Biomedical Engineering Professor Department of Computer and Data Sciences Case School of Engineering Member Cancer Imaging Program Case Comprehensive Cancer Center Member CWRU Center for Imaging Research Research Information Research Interests Dr. Li is the Leonard Case, Jr. endowed chair professor in engineering at Case Western Reserve University. He is a global leader in conducting multi-disciplinary research to enable artificial intelligence (AI) in clinical imaging-centered healthcare, with a background in machine learning, medical data analytics, and imaging. His current research focuses on the development of image-centered AI systems. These systems are designed to solve the most challenging clinical and fundamental data analytics problems in various fields, including cardiology, radiology, urology, surgery, rehabilitation, and cancer. He emphasizes innovations in multiple learning schemes such as deep, regression, reinforcement, adversarial, sparse, spectral, and manifold learning. Dr. Li serves as a committee member for multiple highly influential conferences and societies. He is most notable for his role on the prestigious board of directors of the MICCAI Society, a position he held from 2015 to 2024, and as the general chair of the MICCAI 2022 conference. With over 300 publications, Dr. Li has also acted as the editor for six Springer books and is an associate editor for several prestigious journals. Throughout his career, he has received numerous awards from GE, various institutes, and international organizations. He is a Fellow of SPIE, AAIA, IET, AIMBE, and IAMBE, and a member of the National Academy of Artificial Intelligence (NAAI). Recent Activities Board of Scientific Counselors - NIH-National Library of Medicine Director, Center for Computational Imaging and Personalized Diagnostics (CCIPD) Co-director, Center for AI Enabling Discovery in Disease Biology (AID2B), Co-direct with Jacob Scott General Chair - MICCAI 2022 in Singapore Board of Directors (2016-2024) - MICCAI Society Awards and Honors Fellow of the International Academy of Medical and Biological Engineering (IAMBE), 2025 Member of the National Academy of Artificial Intelligence (NAAI), 2025 Case School of Engineering Faculty Research Award, 2025 Leonard Case, Jr. Chair Professorship, 2025 Fellow of the Institution of Engineering and Technology (IET), 2025 Fellow of the Society of Photo-Optical Instrumentation Engineers (SPIE), 2025 Fellow of the Asia-Pacific Artificial Intelligence Association (AAIA), 2025 Fellow of the American Institute for Medical and Biological Engineering (AIMBE), 2025 MICCAI Elsevier MedIA MICCAI 2022 Special Issue Best Paper Award, Runner Up (First author: Chenchu Xu) International Conference on Artificial Intelligence 2021 Best Student Paper (First author: Zhiyuan Zhu) MICCAI Young Scientist Award 2017 (First author: Wufeng Xue) Annual Award for Academic Excellence in Research, Department of Medical Imaging, Western University, 2017 Above & Beyond Award, General Electric, 2014 GE Innovation Award, 2008&2009 GE Management Award, 2008 GE Hero Award, 2008 Doctoral Prize – Distinction, Concordia University, 2007 Postdoc Hiring (Machine Learning and Medical Image Analysis) We are hiring multiple postdoc fellows in AI-in-imaging. Excellent candidates with strong machine learning and medical image analysis records are encouraged to apply. Email Dr. Shuo Li your CV and three representative publications for consideration. Social Media Google Scholar || Researchgate || Linkedin || Facebook || Twitter Featured in the News Oct. 21, 2025: Dr. Li's cardiac research is featured in think magazine Sept. 5, 2025: CWRU’s Shuo Li elected fellow of the IAMBE May 9, 2025: Shuo Li received the School of Engineering Research Award April 2, 2025: Shuo Li inducted into the 2025 Class of the AIMBE College of Fellows April 2, 2025: Research Brief: Harnessing AI to transform medical imaging Feb. 19, 2025: National Academy of Inventors named five CWRU researchers Jan. 16, 2025: Shuo Li elected SPIE fellow for pioneering work in medical AI January 14, 2025: Researchers harness AI to predict cardiovascular risk from CT scans May 20, 2024: Biomedical Engineering's Shuo Li explores health benefits of AI April 30, 2024: Biomedical engineering's Shuo Li featured in Nature April 23, 2024: Celebrate World Laboratory Day with a look into Dr. Li's lab January 29, 2024: Engineering's Shuo Li shares hope for medical imaging technology Publications Publication Date Tue, 03/04/2025 - 12:00 (Total: 229 journal articles; 149 conference papers; 16 patents; 8 books) Full Text Available at https://www.researchgate.net/profile/Shuo-Li-42/ Journal Articles Yuting He, Boyu Wang, Rongjun Ge, Yang Chen, Guanyu Yang, and Shuo Li (2025), Homeomorphism Prior for False Positive and Negative Problem in Medical Image Dense Contrastive Representation Learning. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 47: 4122-4139. Mingyuan Liu, Lu Xu, Yuzhuo Gu, Jicong Zhang, and Shuo Li (2025), Openness-Aware Multi-Prototype Learning for Open Set Medical Diagnosis. Medical Image Analysis (MedIA), In Press, Online Early Access Available. Sheng Zhang, Yang Nan, Yingying Fang, Shiyi Wang, Yongkai Liu, Giorgos Papanastasiou, Zhifan Gao, Shuo Li, Simon Walsh, Guang Yang (2025), Dynamical Multi-order Responses and Global Semantic-Infused Adversarial Learning: A Robust Airway Segmentation Method. Medical Image Analysis (MedIA), In Press, Online Early Access Available. Yongkai Liu, Bin Jiang, Henk van Voorst, Yannan Yu, Shuo Li, Helena Feng, Zhaosu Zhang, Sally Luo, David S. Liebeskind, Michael E. Moseley, Greg Albers, Max Wintermark, Maarten G. Lansberg, Jeremy J. Heit and Greg Zaharchuk, Both Infarcted and Noninfarcted Brain Regions Contribute to Deep Learning–Based MRI Prediction of Acute Stroke Outcome, American Journal of Neuroradiology, In Press, Online Early Access Available Mohammad Alkhaleefah, Rakesh Gullapelli, Budhaditya Bose, Elijah Rockers, Gourav Modanwal, Ammar Hoori, Anant Madabhushi, David Wilson, Kershaw Patel, Guha Balakrishnan, Shuo Li, Khurram Nasir, and Sadeer Al-Kindi (2025), AI-Derived Cardiac Morphometrics from CAC CT for Heart Failure Risk Prediction, Circulation, Volume: 152; Number: Suppl 3. Bin Huang, Zhong Liu, Ziyue Xu, Shing-Chow Chan, Huiying Wen, Chao Hou, Qicai Huang, Meiqin Jiang, Changfeng Dong, Jie Zeng, Ruhai Zou, Bingsheng Huang, Xin Chen, and Shuo Li (2025), Source-Resilient Joint Learning Framework for Preserving Stable Generalization on Diverse Ultrasonic Source Scenarios. IEEE Journal of Biomedical and Health Informatics(J-BHI), In Press, Online Early Access Available. Xinxin Wang, Mingrui Yang, Sercan Tosun, Kunio Nakamura, Shuo Li, Xiaojuan Li (2025), CalDiff: calibrating uncertainty and accessing reliability of diffusion models for trustworthy lesion segmentation. IEEE Journal of Biomedical and Health Informatics(J-BHI), In Press, Online Early Access Available. Ronghui Qi, Min Tao, Chenchu Xu, Xiaohu Li, Siyuan Pan, Jie Chen, and Shuo Li (2025), Knowledge-driven interpretative conditional diffusion model for contrast-free myocardial infarction enhancement synthesis. Medical Image Analysis (MedIA), 105: 103701. Jianfeng Zhao,  and Shuo Li (2025), When Evidence Modeling Meets Knowledge Distillation: Towards Reliable Contrast-Enhanced Knowledge Distillation for Non-Contrast Medical Image Segmentation. Medical Image Analysis, 105: 103677. Jianfeng Zhao, and Shuo Li (2025), Radiomics-Driven Diffusion Model and Monte Carlo Compression Sampling for Reliable Medical Image Synthesis. IEEE Journal of Biomedical and Health Informatics(J-BHI), In Press, Online Early Access Available. Yue Zhang, Dengqun Sun, Lei Li, Jian Zhou, Xiuquan Du, and Shuo Li (2025), LFVDNet: Low-frequency variable-driven network for medical time series. Journal of Biomedical Informatics, 171:104913. Xingyu Qiu, Dong Liang, Gongning Luo, Xiangyu Li, Wei Wang, Kuanquan Wang, and Shuo Li (2025), MeMGB-Diff: Memory-Efficient Multivariate Gaussian Bias Diffusion Model for 3D Bias Field Correction. Medical Image Analysis,  102:103560. Zehui Lin, Shuo Li, Shanshan Wang, Zhifan Gao, Yue Sun, Chan-Tong Lam, Xindi Hu, Xin Yang, Dong Ni, Tao Tan (2025), An orchestration learning framework for ultrasound imaging: Prompt-guided hyper-perception and attention-matching Downstream Synchronization. Medical Image Analysis (MedIA), 104:103639. Zhanshi Zhu, Qing Dong, Goning Luo, Wei Wang, Suyu Dong, Kuanquan Wang, Ye Tian, and Shuo Li (2025), Causality-Adjusted Data Augmentation for Domain Continual Medical Image Segmentation. IEEE Journal of Biomedical and Health Informatics(J-BHI), In Press, Online Early Access Available. Jiaju Huang, Xin Wang, Xiangyu Xiong, Shaobin Chen, Yue Sun, Ka-Hou Chan, Tong Tong, Qinquan Gao, Yi Xu, Shuo Li, and Tao Tan (2025), Synergistic perception: Fusing expert knowledge and foundation models for semi-supervised mammogram segmentation. Biomedical Signal Processing and Control, In Press, Online Early Access Available. Xiangyu Xiong, Yue Sun, Xiaohong Liu, Wei Ke, Chan-Tong Lam, Qinquan Gao, Tong Tong, Shuo Li, and Tao Tan (2025), VariMix: A variety-guided data mixing framework for explainable medical image classifications. Computer Methods and Programs in Biomedicine, In Press, Online Early Access Available Xihe Qiu, Shaojie Shi, Bin Li, Xiaoyu Tan, Yongbin Gao, and Shuo Li (2023), HLLM-GAODE: Large-language-model augmented neural ordinary differ",
  "content_length": 110264,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:04"
}