{
  "name": "Shuo Wang 0005",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/shuo-wang.aspx",
  "status": "success",
  "content": "Dr Shuo Wang - School of Computer Science - University of Birmingham Dr Shuo Wang PhD School of Computer ScienceAssociate Professor Contact details Emails.wang.2@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Shuo Wang is an Associate Professor in the School of Computer Science at the University of Birmingham. Her research interests include data stream classification, class imbalance learning and ensemble learning approaches in machine learning, and their applications in social media analysis, software engineering and fault detection. As the leading researcher in these areas, she proposed and formulated the problems of multi-class imbalance and online class imbalance. Her work has been published in internationally renowned journals and conferences, such as IEEE Transactions on Knowledge and Data Engineering, IEEE Transactions on Neural Networks and Learning Systems (impact factor: 7.982), IEEE Transactions on Cybernetics (impact factor: 8.803) and International Joint Conference on Artificial Intelligence (IJCAI). Please follow the link below to find out more about Shuo's work: Dr Shuo Wang- personal webpage. PhD in Computer Science, University of Birmingham, UK, 2011 BSc in Software Engineering, Beijing University of Technology, China, 2006 Staff and Educational Development Association (SEDA) teaching qualification Shuo Wang is a lecturer at School of Computer Science at University of Birmingham. Before that, she spent a year lecturing at Birmingham City University. She was a research fellow at the Centre of Excellence for Research in Computational Intelligence and Applications (CERCIA) at the University of Birmingham between 2011 and 2018. She received the Ph.D. degree in Computer Science from the University of Birmingham in 2011, sponsored by the Overseas Research Students Award (ORSAS) from the British Government. Dr. Wang's research interests include data stream classification, class imbalance learning and ensemble learning approaches in machine learning, and their applications in social media analysis, software engineering and fault detection. Her work has been published in internationally renowned journals and conferences, such as IEEE Transactions on Knowledge and Data Engineering and International Joint Conference on Artificial Intelligence (IJCAI). She has been a guest editor of Neurocomputing and Connection Science and the workshop organizer of IJCAI'17 and ICDM'19. A tutorial on learning from imbalanced data streams was given at WCCI'18. She had also given invited talks at UCL, Xi'dian University, Chinese Academy of Sciences (Institute of Oceanology), etc. MSc Software Engineering Data stream classification Class imbalance learning Automated software testing Chair the Workshop on Learning in the Presence of Class Imbalance and Concept Drift, in conjunction with International Joint Conference on Artificial Intelligence, Melbourne, Australia, 2017. Guest editor of the Special Issue \"Learning in the Presence of Class Imbalance and Concept Drift\" at journal Neurocomputing. Guest editor of the Special Issue \"Learning from Data Streams and Class Imbalance\" at journal Connection Science. Tutorial on Learning Class Imbalanced Data Streams, IEEE World Congress on Computational Intelligence (WCCI), Rio de Janeiro, Brazil, 2018. Regular Reviewer of IEEE Transactions on Knowledge and Data Engineering (TKDE) and IEEE Transactions on Neural Networks and Learning Systems (TNNLS). Take part in EU H2020 ITN-EID project ECOLE. Recent publications Article Lyu, H, Herring, D, Chen, H, Zhou, S, Zhang, J, Wang, L, Zuo, Z, Andrews, J, Kocvara, M, Spill, F, Ninic, J & Wang, S 2025, 'A Data-Driven Multi-Objective Optimisation Framework for Energy Efficiency and Thermal Comfort in Flexible Building Spaces', Energy and Buildings. https://doi.org/10.1016/j.enbuild.2025.116100 Cao, C, He, Y, Zhou, Y & Wang, S 2025, 'An online probabilistic combination framework for power load forecasting under concept-drifting scenarios', Applied Energy, vol. 399, 126518. https://doi.org/10.1016/j.apenergy.2025.126518 Wang, Z, Wang, S, Ernst, D & Xiao, C 2025, 'Automated Class Imbalance Learning via Few-Shot Multi-Objective Bayesian Optimization With Deep Kernel Gaussian Processes', IEEE Access, vol. 13, pp. 131839-131855. https://doi.org/10.1109/ACCESS.2025.3591034 Guo, Y, Zhang, W, Jiao, L, Wang, S, Wang, S & Liu, F 2025, 'Visible-infrared person re-identification with region-based augmentation and cross modality attention', Scientific Reports, vol. 15, 18225. https://doi.org/10.1038/s41598-025-01979-z Conference contribution Yang, G, Chen, X, Zhang, T & Wang, S 2025, A Multi-Model Approach for Handling Concept Drifting Data in Federated Learning. in 2024 20th International Conference on Mobility, Sensing and Networking (MSN)., 11036517, International Conference on Mobile Ad-hoc and Sensor Networks, MSN, IEEE, The 20th International Conference on Mobility, Sensing and Networking , Harbin, China, 20/12/24. https://doi.org/10.1109/MSN63567.2024.00153 Chen, X, Zhang, T, Yang, G & Wang, S 2025, A Study of Virtual Concept Drift in Federated Data Stream Learning. in 2024 20th International Conference on Mobility, Sensing and Networking (MSN)., 11036431, International Conference on Mobile Ad-hoc and Sensor Networks, MSN, IEEE, The 20th International Conference on Mobility, Sensing and Networking , Harbin, China, 20/12/24. https://doi.org/10.1109/MSN63567.2024.00149 Li, H & Wang, S 2025, A Two-Stage Multi-Source Transfer Learning Approach for Software Defect Prediction. in 2025 IEEE 23rd International Conference on Industrial Informatics (INDIN). IEEE International Conference on Industrial Informatics (INDIN), IEEE, 23rd IEEE International Conference on Industrial Informatics, KunMing, China, 12/07/25. Wang, Z, Wang, S & Ernst, D 2025, Automated Class Imbalance Learning via Few-shot Bayesian Optimization with Meta-learned Deep Kernel Surrogates. in 2025 International Joint Conference on Neural Networks (IJCNN). Proceedings of the International Joint Conference on Neural Networks (IJCNN), IEEE, pp. 1-10, 2025 International Joint Conference on Neural Networks (IJCNN), Rome, Italy, 30/06/25. https://doi.org/10.1109/IJCNN64981.2025.11228757 Zhou, S, Schöner, H, Lyu, H, Fouché, E & Wang, S 2025, BALM-TSF: Balanced Multimodal Alignment for LLM-Based Time Series Forecasting. in CIKM '25: Proceedings of the 34th ACM International Conference on Information and Knowledge Management. Proceedings of the ACM Conference on Information and Knowledge Management, Association for Computing Machinery (ACM), pp. 4498–4508, 34th ACM International Conference on Information and Knowledge Management, Seoul, Korea, Republic of, 10/11/25. https://doi.org/10.1145/3746252.3761278 Yang, L, Zhou, S, Cheng, J, Zhang, F, Wan, J, Wang, S & Lee, M 2025, DAEA: Enhancing Entity Alignment in Real-World Knowledge Graphs Through Multi-Source Domain Adaptation. in O Rambow, L Wanner, M Apidianaki, H Al-Khalifa, B Di Eugenio & S Schockaert (eds), Proceedings of the 31st International Conference on Computational Linguistics. International conference on computational linguistics, Association for Computational Linguistics, ACL, pp. 5890–5901, The 31st International Conference on Computational Linguistics, Abu Dhabi, United Arab Emirates, 19/01/25. <https://aclanthology.org/2025.coling-main.393/> Guo, X & Wang, S 2025, FedPAC: A Federated Semi-Supervised Learning Approach for Non-IID Data with Feature Shift. in 2025 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE International Conference on Systems, Man and Cybernetics, IEEE, 2025 IEEE International Conference on Systems, Man and Cybernetics, Vienna, Austria, 5/10/25. Zhang, T, Chen, X, Yang, G & Wang, S 2025, Incremental Sampling for Class Imbalanced Data Streams in Federated Learning. in 2024 20th International Conference on Mobility, Sensing and Networking (MSN)., 11036366, International Conference on Mobile Ad-hoc and Sensor Networks, MSN, IEEE, The 20th International Conference on Mobility, Sensing and Networking , Harbin, China, 20/12/24. https://doi.org/10.1109/MSN63567.2024.00159 Wentzel, F, Wang, S, Pourmirza, Z & Ramanathan, G 2025, Learning on the edge for sensor role allocation in BLE IoT devices. in BuildSys '25: Proceedings of the 12th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation. Proceedings of the ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation, Association for Computing Machinery (ACM), pp. 271-276, 12th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation, Golden, Colorado, United States, 19/11/25. https://doi.org/10.1145/3736425.3772007 Yuan, H & Wang, S 2025, SSDIR: A Novel Semi-Supervised Approach for Data Imbalanced Regression. in ICCPR '25: Proceedings of the 14th International Conference on Computing and Pattern Recognition. Association for Computing Machinery (ACM), 2025 14th International Conference on Computing and Pattern Recognition, Beijing, China, 24/10/25. Paper Xiao, C, Zuo, Z & Wang, S 2025, 'FedGA: Federated Learning with Gradient Alignment for Error Asymmetry Mitigation', Paper presented at The 39th Annual AAAI Conference on Artificial Intelligence, Philadelphia, United States, 27/02/25 - 4/03/25. https://doi.org/10.48550/arXiv.2412.16582 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 9633,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:04"
}