{
  "name": "Shuqun Zhang",
  "homepage": "http://www.cs.csi.cuny.edu/~zhangs",
  "status": "success",
  "content": "Dr. Shuqun Zhang | Computer Science | City University of New York Shuqun Zhang Professor, Dept. of Computer Science College of Staten Island , City University of New York Office: 1N-204 Phone: (718) 982-2852 Email: shuqun.zhang@csi.cuny.edu Fax: (718) 982-2856 Teaching CSC 126 Introduction to Computer Science CSC 220 Computer Organization CSC 228 Discrete Mathematical Structures for Computer Science CSC 346 Digital Systems Design CSC 347 Digital Systems Design Laboratory CSC 427 Advanced Comptuter Game Programming CSC 446 Comptuter Architecture CSC 475 Image Processing in Computer Science CSC 740 Computer Systems Design CSC 741 Digital Image Processing CSC 747 Digital Signal Processing Research Interests Image Processing, Computer Vision Pattern Recognition Digital Holography Optical Computing and Information Processing Publications S. Zhang and J. Zhou, \"A new estimation method for two-step-only quadrature phase-shifting digital holography,\" Optics Communications, Vol. 335, pp.183-188, 2015. S. Zhang, \"Digital hologram resolution enhancement using a fast reconstruction algorithm,\" Optics Communications, Vol. 332, pp.158-163, 2014. S. Zhang and B. Furia, “Real time soft-partition-based weighted sum filtering with GPU acceleration,” Proceedings of SPIE: Applications of Digital Image Processing, San Diego, CA, August 17-21, 2014. S. Zhang and B. Furia, “An object boundary detection system based on a 3D stereo monitor,” Proceedings of SPIE: Applications of Digital Image Processing, San Diego, CA, August 17-21, 2014. S. Zhang and J. Zhou, “Extraction of Direction Vector for Gradient and Direction Vector Flow Active Contours,” IEEE International Conference on Computer Science and Automation Engineering, Guangzhou, China, Nov 1-3. 2013. G. Zhu and S. Zhang, “Bidirectional Evolution of Morphological Level Set for Fast Image Segmentation,” World Multiconference on Systemics, Cybernetics and Informatics, Orlando, FL, July 19-22, 2011. G. Zhu, S. Zhang, Q. Zeng, and C. Wang, \"Gradient vector flow active contours with prior directional information,\" Pattern Recognition Letters, Vol. 31,No. 9, pp.845-856, 2010. G. Zhu, S. Zhang, X. Chen, and C. Wang, \"Novel Gradient vector flow-based balloon force for active contours,\" Journal of Electronic Imaging, Vol. 18, No. 2, pp. 023007 - 023007-8, 2009. Z. Huang, Y. Kawase-Koga, S. Zhang, J. Visvader, M. Toth, C. A. Walsh, T. Sun, “Transcription factor Lmo4 defines the shape of functional areas in developing cortices and regulates sensorimotor control,” Developmental Biology, Vol. 327, No 1, pp. 132-142, March 2009. G. Zhu, S. Zhang, Q. Zeng, and C. Wang, \"Anisotropic virtual electric field for active contours,\" Pattern Recognition Letters, Vol. 29, No. 11, pp. 1659-1666, August 2008. S. Zhang and M. Chen, “Compressed domain statistical snake segmentation for real-time tracking of objects in airborne videos,” Proceedings of SPIE: Applications of Digital Image Processing XXX, Vol. 6696, pp. 669624(1) – 669624(7), San Diego, CA, August 28, 2007. G. Zhu, S. Zhang, X. Chen, and C. Wang, \"Efficient illumination insensitive object tracking by normalized gradient matching,\" IEEE Signal Processing Letters, Vol. 14, No. 12, pp. 944-947, 2007. G. Zhu, S. Zhang, Q. Zeng, and C. Wang, \"Preserving the curve evolution property for the binary level set method,\" Journal of Electronic Imaging, Vol.16, No. 2, pp. 0205021- 0205023, April 2007. S. Zhang and G. A. Kahanda, “Energy saving in joint acoustic-video target detection and tracking,” Proceedings of SPIE: Unattended Ground, Sea, and Air Sensor Technologies and Applications IX Vol. 6562, pp. 65620G1- 65620G8, Orlando, Florida, April 9–13, 2007. G. Zhu, S. Zhang, Q. Zeng, and C. Wang, “Directional geodesic active contour for image segmentation,” Journal of Electronic Imaging, Vol. 16, No. 3, pp. 0305011 – 0305013, July 2007. S. Zhang, \"A non-iterative method for phase-shift estimation and wave-front reconstruction in phase-shifting digital holography,\" Optics Communications, Vol. 268, No. 2, pp. 231-234, 2006. S. Zhang, \"Application of super-resolution image reconstruction to digital holography,\" EURASIP Journal on Applied Signal Processing, Vol.2006, Article ID 90358, pp. 1-7, 2006. G. Zhu, S. Zhang, Q. Zeng, and C. Wang, “Boundary-based image segmentation using binary level set method,” Optical Engineering, vol. 46, No.5, pp. 0505011 - 0505013, May 2007. S. Zhang, “A fast level set implementation method for image segmentation and object tracking,” Proceedings of SPIE: Applications of Digital Image Processing, Vol. 6312, pp. 63121R1– 63121R18, San Diego, CA, August 13-17, 2006. S. Zhang, “Image preprocessing for fast multiple-frame superresolution reconstruction,” Proceedings of SPIE: Applications of Digital Image Processing, Vol. 6312, pp. 63121S1 - 63121S9, San Diego, CA, August 13-17, 2006. S. Zhang, “Increasing spatial resolution of holographic images using robust multiframe image reconstruction,” IEEE 8th International Conference on Signal Processing , Vol.2, Bejing, China, Nov. 16-20, 2006. S. Zhang, “Object tracking in unmanned aerial vehicle (UAV) videos using a combined approach,” IEEE International Conference on Acoustics, Speech, and Signal Processing, Vol. II, pp. 681- 684, Philadelphia, PA, March 22, 2005. S. Zhang, “Fast level-set image processing using optoelectronic technique,” Proceedings of SPIE Optical Information Processing III, Vol. 5908, pp. 400- 407, San Diego, CA, August 1-4, 2005. S. Zhang and Mo Chen, “Preprocessing and compression of digital holographic images,” Proceedings of SPIE Applications of Digital Image Processing, Vol. 5909, pp. 582-592, San Diego, CA, August 1-4, 2005. S. Zhang and Mo Chen, “Target detection and tracking in airborne video imagery using statistical snake and mean-shift,” Proceedings of SPIE Applications of Digital Image Processing, Vol. 5909, pp. 574-581, San Diego, CA, August 1-4, 2005. S. Zhang and A. A. Karim, \"Automatic target tracking for video annotation,\" Optical Engineering, Vol. 43, No. 8, pp. 1867-1873, 2004. M. Chen, S. Zhang and A. A. Karim, \"Modification of standard image compression methods for correlation-based pattern recognition,\" Optical Engineering, Vol. 43, No. 8, pp. 1723-1730, 2004. M. Chen, M. L. Fowler, and S. Zhang, “Standards-Compatible Compression for Automated Image Recognition in Sensor Networks and Surveillance Systems” Proceedings of SPIE Mathematics of Data/Image Coding, Compression, and Encryption, with Applications, Vol. 5208, pp. 46-57, San Diego, California, August 3-8, 2003. H. Lu, S. Zhang, and Susan Lu, “Online Ham auto-grading by knowledge-based color image recognition,” 12th Annual Industrial Engineering Research Conference IERC-2003, Portland, Oregon, May 18-20, 2003. S. Zhang, “Impulse Noise Detection Using Laplacian operators and fuzzy logic,” IEEE International Conference on Signal Processing, pp.845 – 848, Aug. 2002. S. Zhang and A. A. Karim, \"A new impulse detector for switching median filters,\" IEEE Signal Processing Letters, Vol.9, No. 11, pp. 360-363, 2002. S. Zhang and A. A. Karim, “Fractional correlation filter for fuzzy associative memories,\" Optical Engineering, Vol. 41, No. 1, pp. 126-129, 2002. S. Zhang and A. A. Karim, \"Parallel fuzzy inference and logic processing with a joint transform correlator,\" Optical Engineering, Vol. 40, No. 11, pp. 2400-2406, 2001. S. Zhang and A. A. Karim, \"Image distance transforms that use optical correlation,\" Applied Optics, Vol. 39, No. 5, pp. 796-802, 2000. S. Zhang and A. A. Karim, \"Normalized joint transform correlation for target recognition,\" Optical Engineering, Vol. 39, No. 5, pp. 1184-1189, 2000. S. Zhang and A. A. Karim, “Optical morphological correlation based on visual-area-coding technique,” Proceedings of SPIE Photonic Devices and Algorithms for Computing II, Vol. 4114, pp. 255- 261, San Diego, CA, July 30 - August 4, 2000. S. Zhang and A. A. Karim, Parallel optical fuzzy logic inference using a SLM-based architecture, Optical and Laser Technology, Vol. 32, No. 6, pp.407-412, 2000. S. Zhang and A. A. Karim, \"Euclidean distance transform by stack filters,\" IEEE Signal Processing Letters, Vol. 6, No. 10, pp. 253-255, 1999. S. Zhang and A. A. Karim, \"Illumination-invariant pattern recognition using joint transform correlator-based morphological correlation,\" Applied Optics, Vol. 38, No. 35, pp. 7228-7237, 1999. S. Zhang and A. A. Karim, \"Morphologically preprocessed joint transform correlation,\" Applied Optics, Vol. 38, No. 11, pp. 2182-2188, 1999. S. Zhang and A. A. Karim, \"Real-time digital optical matrix multiplication with a joint transform correlator,\" Applied Optics, Vol. 38, No. 2, pp. 399-408, 1999. S. Zhang and A. A. Karim, \"Optical implementation of cellular neural networks based on bias and joint correlation,\" Applied Optics, Vol. 38, No. 5, pp. 847-854, 1999. S. Zhang and A. A. Karim, \"Programmable modified-signed-digit addition module based on binary logic gates,\" Optical Engineering, Vol. 38, No. 3, pp. 456-461, 1999. S. Zhang and A. A. Karim, \"Optical arithmetic processing based on improved redundant binary algorithms,\" Optical Engineering, Vol. 38, No. 3, pp. 415-421, 1999. S. Zhang and A. A. Karim, \"High-security optical integrated stream ciphers,\" Optical Engineering, Vol. 38, No.1, pp. 20-24, 1999. S. Zhang and A. A. Karim, \"Optical triangular fuzzy systems based on a one-memory-matrix fuzzy associative memory,\" Optics Letters, Vol. 24, No. 7, pp. 484-486, 1999. S. Zhang and A.. A. Karim, \"Color image encryption using double random phase encoding,\" Microwave and Optical Technology Letters, Vol. 21, No. 5, pp.318-323, 1999. S. Zhang and A. A. Karim, \"Morphological correlation-based pattern recognition and its modifications,\" Asian Journal of Physics, Vol. 8, No.3, pp. 335-346, 1999. S. Zhang and A. A. Karim, \"One-step optical negabinary and modified signed digit adder,\" Optics & Laser Technology, Vol. 30, No. 3-4, pp. 193-198, 1998. S. Zhang and A. A. Karim, \"Optical fuzzy sys",
  "content_length": 12220,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:04"
}