{
  "name": "Shuyan Li",
  "homepage": "https://pure.qub.ac.uk/en/persons/shuyan-li",
  "status": "success",
  "content": "Shuyan Li - Queen's University Belfast Shuyan Li public CV View Scopus Profile Shuyan Li Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science Emailshuyan.liqub.acuk Accepting PhD StudentsPhD projectsI have a collaborative studentship opportunity, please contact me before Aug 17th 2024.Self-funded students are always welcome. 20202025 Research activity per year Personal profile Research Interests Broadly interested in deep learning and computer vision. Current research focuses on unsupervised learning, digital twins, video understanding, representation learning, and domain adaptation. Teaching Guest lecturer, Digital Innovation Built Asset Management MSc, University College London 2024 Instructor, Digital Twin Workshop, University of Cambridge 2024 Module co-designer, 4D4: Digital Construction, University of Cambridge 2023 Demonstrator & marking, 3F8: Inference, University of Cambridge Lent term 2023 Achievements Excellent Doctorate Dissertation, ShenZhen Association for Artificial Intelligence       2023 The First Prize Scholarship, Tsinghua University (Top 5%)     2020 National Scholarship, MOE of PRC (Top 2%)        2013 Fingerprint Dive into the research topics where Shuyan Li is active. These topic labels come from the works of this person. Together they form a unique fingerprint. Domain Adaptation Computer Science 100% Hashing Computer Science 100% Hashing Method Computer Science 100% Digital Twin Computer Science 100% Attention (Machine Learning) Computer Science 100% Text Expression Computer Science 75% Relationship Frame Computer Science 75% Video Retrieval Computer Science 75% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2020 2023 2024 2025 2025 10 Conference contribution 5 Article 2 Working paper Research output per year Research output per year EventVAD: Training-free event-aware video anomaly detectionShao, Y., He, H., Li, S., Chen, S., Long, X., Zeng, F., Fan, Y., Zhang, M., Yan, Z., Ma, A., Wang, X., Tang, H., Wang, Y. & Li, S., 27 Oct 2025, MM '25: Proceedings of the 33rd ACM International Conference on Multimedia. Association for Computing Machinery, p. 2586 - 2595 Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Anomaly Detection 100% Detect Anomaly 33% World Knowledge 33% Supervised Method 33% Final Decision 33% 1 Downloads (Pure) Seeing beyond dark-field RGB capabilities: deep spectral extrapolation of ultrasmall plasmonic nanogapsKazemzadeh, M., Zhang, B., He, T., Liu, H., Jiang, Z., Hu, Z., Dong, X., Sun, C., Jiang, W., He, X., Li, S., Alvarez-Perez, G., Pisanello, F., Hu, H., Chen, W. & Xu, H., 17 Apr 2025, arXiv.Research output: Working paper File Surface Plasmon 100% RGB Image 100% Image Analysis 100% Nanoparticle 100% Nanomaterial 100% 9 Downloads (Pure) Semantic-assisted object clustering for multi-modal referring video segmentationLiu, Y., Luo, Z., Xiao, Y., Wang, Y., Li, S., Li, X., Yang, Y. & Tang, Y., 29 Sept 2025, (Early online date) In: IEEE Transactions on Pattern Analysis and Machine Intelligence. 17 p.Research output: Contribution to journal › Article › peer-review Attention (Machine Learning) 100% Video Information 100% Segmentation Task 100% Temporal Modeling 100% Visual Representation 100% AV-GAN: attention-based varifocal generative adversarial network for uneven medical image translationLi, Z., Lin, Y., Fang, Z., Li, S. & Li, X., 09 Sept 2024, 2024 International Joint Conference on Neural Networks (IJCNN): Proceedings. Institute of Electrical and Electronics Engineers Inc., ( International Joint Conference on Neural Networks (IJCNN): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Generative Adversarial Networks 100% Image Translation 100% Translating (Language) 100% Kidney Tissue 100% Staining Technique 100% 3 Citations (Scopus) 9 Downloads (Pure) Connectivity detection for automatic construction of building geometric digital twinsDrobnyi, V., Li, S. & Brilakis, I., Mar 2024, In: Automation in Construction. 159, 14 p., 105281.Research output: Contribution to journal › Article › peer-review Open AccessFile 20 Citations (Scopus) 6 Downloads (Pure) View all 17 research outputs Prizes Excellent Doctorate DissertationLi, S. (Recipient), 18 Nov 2023Prize: Prize (including medals and awards) Forbes China 100 Most Influential Chinese Selection AwardLi, S. (Recipient), 07 Oct 2024Prize: Prize (including medals and awards) National ScholarshipLi, S. (Recipient), 01 Dec 2013Prize: Fellowship awarded competitively Outstanding Young Scholars Association FellowLi, S. (Recipient), 30 Nov 2024Prize: Prize (including medals and awards) United Kingdom 100% The First Prize ScholarshipLi, S. (Recipient), 01 Dec 2020Prize: Fellowship awarded competitively View all 6 prizes Activities Activities per year 2019 2024 2025 2025 8 Publication peer-review 6 Invited talk 3 Visiting an external academic institution 2 Hosting an academic visitor 3 More 1 Participation in workshop, seminar, course 1 Editorial activity 1 Oral presentation Activities per year Yi YeLi, S. (Host)15 Oct 2025Activity: Hosting a visitor types › Hosting an academic visitor AI for Medical ApplicationsLi, S. (Advisor)01 Apr 2025Activity: Talk or presentation types › Invited talk AI-Driven Innovations in Multidisciplinary Data AnalysisLi, S. (Advisor)28 Mar 2025Activity: Talk or presentation types › Invited talk Jiaxin LinLi, S. (Host)28 Feb 2025Activity: Hosting a visitor types › Hosting an academic visitor University of SouthamptonLi, S. (Advisor)10 Jan 2025Activity: Visiting an external institution types › Visiting an external academic institution View all 22 activities",
  "content_length": 6091,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:06"
}