{
  "name": "Shweta Yadav 0001",
  "homepage": "https://shwetanlp.github.io",
  "status": "success",
  "content": "Shweta Yadav I am an Assistant Professor of Computer Science at the University of Illinois Chicago (UIC). I earned my Ph.D. degree in computer science from the Indian Institute of Technology Patna, India. My research interests lie at the intersection of Natural Language Processing, Healthcare-informatics, Biomedical Text Mining, and Computational Social Science. I aim to develop effective and efficient machine learning algorithms to accelerate the development of artificial intelligence in the healthcare and medical domains. I have a strong commitment to interdisciplinary collaboration and have experience working on emerging real-world problems in healthcare and social sciences. My current research focuses on developing computational methods for medical document summarization, disease progression, and the prediction of health outcomes from electronic health records and social media. selected publications WWW Figurative-cum-Commonsense Knowledge Infusion for Multimodal Mental Health Meme Classification Abdullah Mazhar, Zuhair Hasan Shaik, Aseem Srivastava, Polly Ruhnke, Lavanya Vaddavalli, Sri Keshav Katragadda, Shweta Yadav, and Md Shad Akhtar In Proceedings of the ACM on Web Conference 2025 Bib @inproceedings{mazhar2025figurative, abbr = {WWW}, bibtex_show = {true}, title = {Figurative-cum-Commonsense Knowledge Infusion for Multimodal Mental Health Meme Classification}, author = {Mazhar, Abdullah and Shaik, Zuhair Hasan and Srivastava, Aseem and Ruhnke, Polly and Vaddavalli, Lavanya and Katragadda, Sri Keshav and Yadav, Shweta and Akhtar, Md Shad}, booktitle = {Proceedings of the ACM on Web Conference}, pages = {637--648}, year = {2025}, selected = {true} } ACL (Findings) No perspective, no perception!! Perspective-aware Healthcare Answer Summarization Gauri Naik, Sharad Chandakacherla, Shweta Yadav, and Md Shad Akhtar In Findings of the Association for Computational Linguistics ACL 2024 Bib @inproceedings{naik2024no, abbr = {ACL (Findings)}, bibtex_show = {true}, title = {No perspective, no perception!! Perspective-aware Healthcare Answer Summarization}, author = {Naik, Gauri and Chandakacherla, Sharad and Yadav, Shweta and Akhtar, Md Shad}, booktitle = {Findings of the Association for Computational Linguistics ACL}, pages = {15919--15932}, year = {2024}, selected = {true} } ACL Towards Identifying Fine-Grained Depression Symptoms from Memes Shweta Yadav, Cornelia Caragea, Chenye Zhao, Naincy Kumari, Marvin Solberg, and Tanmay Sharma In the Proceedings of the Association for Computational Linguistics (ACL) 2023 Bib @inproceedings{yadav2023acl, abbr = {ACL}, bibtex_show = {true}, title = {Towards Identifying Fine-Grained Depression Symptoms from Memes}, author = {Yadav, Shweta and Caragea, Cornelia and Zhao, Chenye and Kumari, Naincy and Solberg, Marvin and Sharma, Tanmay}, booktitle = {the Proceedings of the Association for Computational Linguistics (ACL)}, year = {2023}, selected = {true} } WWW Towards Understanding Consumer Healthcare Questions on the Web with Semantically Enhanced Contrastive Learning Shweta Yadav, Stefan Cobeli, and Cornelia Caragea In the Proceedings of the ACM Web Conference (WWW) 2023 Bib @inproceedings{yadav2023theweb, abbr = {WWW}, bibtex_show = {true}, title = {Towards Understanding Consumer Healthcare Questions on the Web with Semantically Enhanced Contrastive Learning}, author = {Yadav, Shweta and Cobeli, Stefan and Caragea, Cornelia}, booktitle = {the Proceedings of the ACM Web Conference (WWW)}, year = {2023}, selected = {true} } COLING Towards Summarizing Healthcare Questions in Low-Resource Setting Shweta Yadav, and Cornelia Caragea In the Proceedings of the 29th International Conference on Computational Linguistics (COLING) 2022 Bib @inproceedings{yadav2022coling, abbr = {COLING}, bibtex_show = {true}, title = {Towards Summarizing Healthcare Questions in Low-Resource Setting}, author = {Yadav, Shweta and Caragea, Cornelia}, booktitle = {the Proceedings of the 29th International Conference on Computational Linguistics (COLING)}, year = {2022}, selected = {true} } ACL Reinforcement Learning for Abstractive Question Summarization with Question-aware Semantic Rewards Shweta Yadav, Deepak Gupta, Asma Ben Abacha, and Dina Demner-Fushman In ACL 2021 Bib @inproceedings{yadav2021reinforced, abbr = {ACL}, bibtex_show = {true}, title = {Reinforcement Learning for Abstractive Question Summarization with Question-aware Semantic Rewards}, author = {Yadav, Shweta and Gupta, Deepak and Abacha, Asma Ben and Demner-Fushman, Dina}, booktitle = {ACL}, year = {2021}, selected = {true} } ACL Multimodal Graph-based Transformer Framework for Biomedical Relation Extraction Sriram Pingali, Shweta Yadav, Pratik Dutta, and Sriparna Saha In ACL Findings 2021 Bib @inproceedings{Sriram2021multimodal, abbr = {ACL}, bibtex_show = {true}, title = {Multimodal Graph-based Transformer Framework for Biomedical Relation Extraction}, author = {Pingali, Sriram and Yadav, Shweta and Dutta, Pratik and Saha, Sriparna}, booktitle = {ACL Findings}, year = {2021}, selected = {true} } JBI Question-aware transformer models for consumer health question summarization Shweta Yadav, Deepak Gupta, Asma Ben Abacha, and Dina Demner-Fushman Journal of Biomedical Informatics 2022 Bib @article{yadav2022question, abbr = {JBI}, bibtex_show = {true}, title = {Question-aware transformer models for consumer health question summarization}, author = {Yadav, Shweta and Gupta, Deepak and Abacha, Asma Ben and Demner-Fushman, Dina}, journal = {Journal of Biomedical Informatics}, volume = {128}, pages = {104040}, year = {2022}, publisher = {Elsevier}, selected = {true} } PLOS ONE “When they say weed causes depression, but it’s your fav antidepressant”: Knowledge-aware Attention Framework for Relationship Extraction Shweta Yadav, Usha Lokala, Raminta Daniulaityte, Krishnaprasad Thirunarayan, Francois Lamy, and Amit Sheth PLoS one 2021 Bib @article{yadav2021they, abbr = {PLOS ONE}, bibtex_show = {true}, title = {“When they say weed causes depression, but it’s your fav antidepressant”: Knowledge-aware Attention Framework for Relationship Extraction}, author = {Yadav, Shweta and Lokala, Usha and Daniulaityte, Raminta and Thirunarayan, Krishnaprasad and Lamy, Francois and Sheth, Amit}, journal = {PLoS one}, volume = {16}, number = {3}, pages = {e0248299}, year = {2021}, selected = {true}, publisher = {Public Library of Science San Francisco, CA USA} } ACL A Unified Multi-task Adversarial Learning Framework for Pharmacovigilance Mining Shweta Yadav, Asif Ekbal, Sriparna Saha, and Pushpak Bhattacharyya In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (ACL 2019) 2019 Bib @inproceedings{yadav2019unified, abbr = {ACL}, bibtex_show = {true}, title = {A Unified Multi-task Adversarial Learning Framework for Pharmacovigilance Mining}, author = {Yadav, Shweta and Ekbal, Asif and Saha, Sriparna and Bhattacharyya, Pushpak}, booktitle = {Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (ACL 2019)}, pages = {5234--5245}, year = {2019}, selected = {true} } The Web (WWW) EDarkFind: Unsupervised Multi-View Learning for Sybil Account Detection Ramnath Kumar, Shweta Yadav, Raminta Daniulaityte, Francois Lamy, Krishnaprasad Thirunarayan, Usha Lokala, and Amit Sheth In Proceedings of The Web Conference 2020 (WWW 2020) 2020 Abs Bib Darknet crypto markets are online marketplaces using crypto currencies (e.g., Bitcoin, Monero) and advanced encryption techniques to offer anonymity to vendors and consumers trading for illegal goods or services. The exact volume of substances advertised and sold through these crypto markets is difficult to assess, at least partially, because vendors tend to maintain multiple accounts (or Sybil accounts) within and across different crypto markets. Linking these different accounts will allow us to accurately evaluate the volume of substances advertised across the different crypto markets by each vendor. In this paper, we present a multi-view unsupervised framework (eDarkFind) that helps modeling vendor characteristics and facilitates Sybil account detection. We employ a multi-view learning paradigm to generalize and improve the performance by exploiting the diverse views from multiple rich sources such as BERT, stylometric, and location representation. Our model is further tailored to take advantage of domain-specific knowledge such as the Drug Abuse Ontology to take into consideration the substance information. We performed extensive experiments and demonstrated that the multiple views obtained from diverse sources can be effective in linking Sybil accounts. Our proposed eDarkFind model achieves an accuracy of 98% on three real-world datasets which shows the generality of the approach. @inproceedings{10.1145/3366423.3380263, abbr = {The Web (WWW)}, bibtex_show = {true}, author = {Kumar, Ramnath and Yadav, Shweta and Daniulaityte, Raminta and Lamy, Francois and Thirunarayan, Krishnaprasad and Lokala, Usha and Sheth, Amit}, title = {EDarkFind: Unsupervised Multi-View Learning for Sybil Account Detection}, year = {2020}, isbn = {9781450370233}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, url = {https://doi.org/10.1145/3366423.3380263}, doi = {10.1145/3366423.3380263}, booktitle = {Proceedings of The Web Conference 2020 (WWW 2020)}, pages = {1955–1965}, numpages = {11}, keywords = {Sybil Detection, Darknet Market, Correlation Analysis, Stylometry, Drug Trafficker Identification, Multi-view Learning}, location = {Taipei, Taiwan}, series = {WWW '20}, selected = {true} } IEEE TCBB Relation extraction from biomedical and clinical text: Unified multitask learning framework Shweta Yadav, Srivastsa Ramesh, Sriparna Saha, and Asif Ekbal IEEE/ACM Transactions on Computational Biology and Bioinformatics 2020 Bib @article{yadav2020relation, title = {Relation extraction from biomedical and clinical text: Unified multitask learning framework},",
  "content_length": 10259,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:06"
}