{
  "name": "Si Liu 0003",
  "homepage": "https://siliunobi.github.io",
  "status": "success",
  "content": "Si Liu Department of Computer Science & Engineering Texas A&M University PETR 225, 435 Nagle St College Station, TX 77843 [CV] I am Si Liu, though I often go by Nobi. I am an Assistant Professor in the Department of Computer Science & Engineering, Texas A&M University. My research lies at the intersection of formal methods, software engineering, systems, and security, with a strong focus on leveraging formal verification techniques to build reliable, secure, and performant distributed systems. In recent years, I have worked on verifying and validating both the designs and deployments of database systems and DNS, addressing not only qualitative (e.g., reliability and security) but also quantitative (e.g., availability and scalability) aspects. I am also deeply interested in the intersection of these areas with AI: both in applying AI techniques to strengthen testing and verification, and in developing rigorous methods for verifying AI-powered systems themselves. Before I came to Texas, I was a Senior Researcher (Deutsch: Oberassistent) in the Information Security Group at ETH Zurich, led by Prof. David Basin, where I received the Career Seed Award. I also previously worked as a postdoc in the same group. I completed my PhD in Computer Science from the University of Illinois Urbana-Champaign, advised by Prof. José Meseguer, where I worked on design, verification and automatic implementation of correct-by-construction distributed database systems. I am recruiting PhD, Master, and undergrad students to join my group. If you are passionate about research and interested in working with me, contact me at si.liu@tamu.edu with your CV and a brief statement of your research interests or future plans. news Nov 15, 2025 Our paper “Fast Verification of Strong Database Isolation” was accepted at VLDB 2026. Aug 11, 2025 I have joined Texas A&M University as a tenure-track Assistant Professor in the Department of Computer Science & Engineering! May 24, 2025 Our paper “Testing Graph Databases with Synthesized Queries” was accepted at SIGMOD 2026. Mar 26, 2025 Our paper “Boosting End-to-End Database Isolation Checking via Mini-Transactions” was accepted at ICDE 2025! Jan 15, 2025 Our paper “VerIso: Verifiable Isolation Guarantees for Database Transactions” was accepted at VLDB 2025! Dec 26, 2024 I was invited by the School of Computer Science and Technology at Nanjing University to share my insights on Making Distributed Systems Dependable and Performant. Dec 20, 2024 Our paper “Pushing the Limit: Verified Performance-Optimal Causally-Consistent Database Transactions” was accepted at TACAS 2025! Nov 08, 2024 Our paper “Reachability Analysis of the Domain Name System” was accepted at POPL 2025! Oct 23, 2024 I was presenting our Plume work at OOPSLA 2024. Pasadena, bathed in sunshine! Oct 01, 2024 We have been awarded a grant from the Swiss National Science Foundation (SNSF) for the project “Formal Verification of Isolation Guarantees in Database Systems.” Congrats, Christoph! I am excited to contribute as an official project partner! Aug 19, 2024 Our paper “Plume: Efficient and Complete Black-box Checking of Weak Isolation Levels” was accepted at OOPSLA 2024! Jul 01, 2024 I was honored to receive the Career Seed Award from ETH Zurich, along with research funding! Jun 13, 2024 I was presenting our work “NOC-NOC: Towards Performance-optimal Distributed Transactions” at SIGMOD 2024, setting foot on the mysterious continent of South America for the first time! May 28, 2024 Our paper “IsoVista: Black-box Checking Database Isolation Guarantees” was accepted at VLDB 2024. Feb 12, 2024 The Master thesis “NOCS-Optimal Distributed Transactions and Beyond” supervised by me was honored with the ETH Medal (top 2.5%) and a financial sum. Congrats to Luca Multazzu! Nov 20, 2023 Our paper “NOC-NOC: Towards Performance-optimal Distributed Transactions” was accepted at SIGMOD 2024! selected publications (all) VLDB 2026 Fast Verification of Strong Database Isolation Zhiheng Cai†, Si Liu, Hengfeng Wei, Yuxing Chen, and Anqun Pan Proc. VLDB Endow., 2026 Abs Strong isolation guarantees, such as serializability and snapshot isolation, are essential for maintaining data consistency and integrity in modern databases. Verifying whether a database upholds its claimed guarantees is increasingly critical, as these guarantees form a contract between the vendor and its users. However, this task is challenging, particularly in black-box settings, where only observable system behavior is available and often involves uncertain dependencies between transactions. In this paper, we present VeriStrong, a fast verifier for strong database isolation. At its core is a novel formalism called hyper-polygraphs, which compactly captures both certain and uncertain transactional dependencies in database executions. Leveraging this formalism, we develop sound and complete encodings for verifying both serializability and snapshot isolation. To achieve high efficiency, VeriStrong tailors SMT solving to the characteristics of database workloads, in contrast to prior general-purpose approaches. Our extensive evaluation across diverse benchmarks shows that VeriStrong not only significantly outperforms state-of-the-art verifiers on the workloads they support, but also scales to large, general workloads beyond their reach, while maintaining high accuracy in detecting isolation anomalies. SIGMOD 2026 Testing Graph Databases with Synthesized Queries Zijing Yin†, Si Liu, and David Basin Proc. ACM Manag. Data, 2026 Abs Graph databases (GDBs) are increasingly used in many applications. However, their advanced features make them prone to logic bugs. Despite recent advances in GDB testing, a common limitation of existing approaches is the lack of ground truth for their test oracles. This results in both incorrectly identified bugs and overlooked bugs. We introduce GQS (Graph Query Synthesis), the first automated testing approach for detecting logic bugs in graph databases (GDBs) based on an established ground truth. GQS starts by randomly generating a graph and selecting a set of properties associated with its elements, whose key-value pairs form the expected result set serving as the ground truth. It then synthesizes a query intended to retrieve these values from the graph. When the query is executed on the graph by the GDB under test, any discrepancy between the actual result set and the ground truth indicates a logic bug. To extensively test a GDB, we develop novel techniques that synthesize both syntactically and semantically complex queries. We implement GQS in a tool that incorporates the first Cypher query synthesizer specifically designed for testing GDBs. Overall, we find 36 previously unknown bugs across four production GDBs, of which 26 are logic bugs, with some remaining undetected for up to five years. Additionally, our tool demonstrates superior effectiveness in bug detection compared to the state-of-the-art testers. VLDB 2025 VerIso: Verifiable Isolation Guarantees for Database Transactions Shabnam Ghasemirad†, Si Liu, Christoph Sprenger, Luca Multazzu, and David Basin Proc. VLDB Endow., 2025 Abs Isolation bugs, stemming especially from design-level defects, have been repeatedly found in carefully designed and extensively tested production databases over decades. In parallel, various frameworks for modeling database transactions and reasoning about their isolation guarantees have been developed. What is missing however is a mathematically rigorous and systematic framework with tool support for formally verifying a wide range of such guarantees for all possible system behaviors. We present the first such framework, VerIso, developed within the theorem prover Isabelle/HOL. To showcase its use in verification, we model the strict two-phase locking concurrency control protocol and verify that it provides strict serializability isolation guarantee. Moreover, we show how VerIso helps identify isolation bugs during protocol design. We derive new counterexamples for the TAPIR protocol from failed attempts to prove its claimed strict serializability. In particular, we show that it violates a much weaker isolation level, namely, atomic visibility. POPL 2025 Reachability Analysis of the Domain Name System Dhruv Nevatia†, Si Liu, and David Basin Proc. ACM Program. Lang., 2025 Abs The high complexity of DNS poses unique challenges for ensuring its security and reliability. Despite continuous advances in DNS testing, monitoring, and verification, protocol-level defects still give rise to numerous bugs and attacks. In this paper, we provide the first decision procedure for the DNS verification problem, establishing its complexity as 2ExpTime, which was previously unknown. We begin by formalizing the semantics of DNS as a system of recursive communicating processes extended with timers and an infinite message alphabet. We provide an algebraic abstraction of the alphabet with finitely many equivalence classes, using the subclass of semigroups that recognize positive prefix-testable languages. We then introduce a novel generalization of bisimulation for labelled transition systems, weaker than strong bisimulation, to show that our abstraction is sound and complete. Finally, using this abstraction, we reduce the DNS verification problem to the verification problem for pushdown systems. To show the expressiveness of our framework, we model two of the most prominent attack vectors on DNS, namely amplification attacks and rewrite blackholing. OOPSLA 2024 Plume: Efficient and Complete Black-box Checking of Weak Isolation Levels Si Liu, Long Gu, Hengfeng Wei, and David Basin Proc. ACM Program. Lang., 2024 Abs Modern databases embrace weak isolation levels to cater for highly available transactions. However, weak isolation bugs have recently manifested in many production databases. This raises the concern of whether database implementations actually deliver their promised isolation guarantees in pr",
  "content_length": 18131,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:09"
}