{
  "name": "Siamak Mehrkanoon",
  "homepage": "https://sites.google.com/view/siamak-mehrkanoon/homepage",
  "status": "success",
  "content": "Siamak MehrkanoonSearch this siteEmbedded FilesSkip to main contentSkip to navigation\"  I don't know anything, but I do know that everything is interesting if you go into it deeply enough .\" ~ Richard Feynman.   About me:Siamak Mehrkanoon is an Assistant Professor at Utrecht University. Previously,  he was an Assistant Professor at Maastricht University. He received his PhD degree in Machine Learning in 2015 at KU Leuven, Belgium. He was a visiting researcher at the Department of Automation at Tsinghua University, Beijing, China, in 2014, a Post-Doctoral Research Fellow at University of Waterloo, Waterloo, ON, Canada, from 2015 to 2016, and a Visiting Post-Doctoral Researcher at Cognitive Systems Laboratory, University of Tübingen, Tübingen, Germany, in 2016. He was an FWO Post-Doctoral Research Fellow at Stadius Center for Dynamical Systems, Signal Processing and Data Analytics, KU Leuven from 2017-2018. His current research interests encompass deep learning, neural networks, kernel-based models, unsupervised and semis-supervised learning, pattern recognition, numerical algorithms, and optimization. He has received several Fellowships/Grants for supporting his scientific researches, including PDM from KU Leuven and prestigious Fund for Scientific Research from FWO Flanders. He currently serves as an Associate Editor for Neurocomputing and is a member of the European Laboratory for Learning and Intelligent Systems (ELLIS).Google Scholar: https://scholar.google.be/citations?user=sOSxU7sAAAAJ&hl=enResearchGate: https://www.researchgate.net/profile/Siamak_MehrkanoonLinkedIn: https://www.linkedin.com/in/siamak-mehrkanoon-04036069/UU link: https://www.uu.nl/medewerkers/SMehrkanoonSelected invited talks: \" Deep Learning for Short-Term Weather Forecasting\", at Aarhus University, Denmark , Feb 2025. [Slides]\" Deep Short-Term Weather Elements Forecasting\", at KU Leuven, Belgium , Sept 2024. [Slides]\" Deep Data-Driven Weather Forecasting and Nowcasting\", at Symposium AI for nowcasting, Delft, July 2024. \" Deep Short-Term Weather Elements Forecasting \", at Deep Learning and Artificial Intelligence Summer/Winter School 2023 (DLAI7), July 2023. [Slides]\" Semi-Supervised Learning and Applications \", Maastricht University, 2021 [Slides]  Invited Tutorial at https://cml.rhul.ac.uk/copa2020/  (Youtube)    \" Deep Learning: Artificial Neural Networks and Kernel based Models \" , Tutorial at IJCNN 2019, Budapest.  [Slides] \" LS-SVM based solutions to differential equations \" , May 2019, smai2019, Lorient, France. [Slides]Kernel based models and applications, May 2018, Shanghai Jiao Tong University, Shanghai, China. Incorporation of prior knowledge into Kernel based models\", Jun.2016, Institute of Control and Complex Systems (AKS), Duisburg, Germany.\" Teaching machines to learn solution of dynamical system \", Mar.2016,  CPAMI, University of Waterloo, Canada. [Slides]Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:10"
}