{
  "name": "Siamak Fayyaz Shahandashti",
  "homepage": "https://www-users.cs.york.ac.uk/~siamak",
  "status": "success",
  "content": "Siamak F. Shahandashti - Home Page Siamak F. Shahandashti PhD CS, MSc BSc EE Senior Lecturer (Associate Professor) Cyber Security and Privacy Research Group Dept. of Computer Science University of York, UK Quick Links Publications Student Supervision Teaching Academic Service Latest News 2025-11-11: Charles has passed his PhD viva today. Congratulations (soon-to-be) Dr. Dodd and his main supervisor Pooya Farshim (IOG and Durham)! Thanks to the examiners Behzad Abdolmaleki (Sheffield) and Detlef Plump (York). Charles's publications are coming up soon. 2025-09-22: Hina's work designing an lightweight DoS-resilient mempool for Bitcoin called Carbyne has been accepted to Blockchain: Research and Applications. See: ePrint, Code, Dataset, Journal Homepage 2025-09-02: Ibtihal's paper on the use of and concerns about authentication technologies among British university staff and students is accepted as late breaking work to BCS HCI 2025. See: ePrint, Conference Webpage Older:  News archive Selected Recent Publications [QWGS25] Aunam Quyoum, Mark Wong, Sebati Ghosh and Siamak F. Shahandashti. \"Minoritised Ethnic Peopleâs Security and Privacy Concerns and Responses towards Essential Online Services\". SOUPS 2025: 259â278, USENIX, 2025. ePrint |  Open Proceedings Version |  Presentation |  BibTeX [BAS25] Hina Binte Haq, Syed Taha Ali and Siamak F. Shahandashti. \"Cuckoo's Nest: An Ultra-Lightweight DoS-Resilient Bitcoin Mempool\". ICBC 2025, IEEE, 2025. ePrint |  DoI |  Code |  Dataset |  Slides [CBS24] Ali Cherry, Konstantinos Barmpis and Siamak F. Shahandashti. \"The Emperor is Now Clothed: A Secure Governance Framework for Web User Authentication through Password Managers\". ICICS 2024, LNCS 15057: 233â252, Springer, 2024. ePrint |  DoI |  Code |  BibTeX Full Publication List Selected Funded Projects (current) PRIME: Protecting Minority Ethnic Communities Online PHAWM: Participatory Harm Auditing Workbenches and Methodologies Selected Academic Service Program Committee (current): (Po)PETS'26 ICBC'26 SEC@SAC'26 University Service (current): Co-Chair, Physical Sciences Ethics Committee Member, Information Security Board Member, Academic Ethics Compliance Committee Departmental Service (selected, current): Lead, Cyber Security and Privacy Research Group Deputy Chair, Graduate School Board Programme Lead, MSc Cyber Security Full Academic Service List Student Supervision Current Research Students: Charles Dodd (with  Pooya Farshim) Najla Aldaraani (with  Helen Petrie) Ibtihal Alotaibi (with  Helen Petrie) Full Student Supervision List (and Information for Prospective Students) Teaching Current Module: Cryptography Theory and Practice ( CTAP-H / CTAP-M ) Full Teaching List On Other Platforms DBLP Google Scholar LinkedIn more platforms Contact Details Email: x.y@york.ac.uk where x = siamak and y = shahandashti Public Key:  OpenPGP File Office: CSE/133 ( map) Tel: +44 1904 325413 Postal Address Dept of Computer Science University of York York, YO10 5GH United Kingdom Previously at Newcastle Uni, UK ENS, Paris, France Victoria Uni, Australia Wollongong Uni, Australia",
  "content_length": 3107,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:12"
}