{
  "name": "Siau-Cheng Khoo",
  "homepage": "http://msba.nus.edu/our-schools/7-faculty",
  "status": "success",
  "content": "NUS Skip to content Shape Your Future with NUS MSBA Discover more about NUS MSBA Discover more about NUS MSBA Elevate Your Business Acumen with Analytics Excellence Discover More About NUS MSBA NUS MSc in Business Analytics (MSBA) wins the 2025 UPS George D. Smith Prize Recognised globally for excellence in analytics education See what sets us apart Be A Catalyst of Digital Transformation with NUS MSBA. Advance your career as data savvy business leaders with Asia’s top Master of Science in Business Analytics (MSBA) programme, co-designed by NUS Business School and NUS Computing.Dive into an immersive industrial learning experience designed to help you excel in the competitive world of business analytics and learn about topics such as LLMs, GenAI, deep learning and more. Why NUS MSBA? ⁠Interdisciplinary Education Learn More Strong Industrial Partnerships Learn More Diverse Community Learn More Download NUS MSBA Brochure First Name Last Name Email Company Country of Residence:--None--Afghanistan Aland Islands Albania Algeria Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Chinese Taipei Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cote d&#39;Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hong Kong SAR Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kuwait Kyrgyzstan Lao People&#39;s Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Norway Oman Others Pakistan Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Qatar Reunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Scotland Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Korea South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Vietnam Virgin Islands, British Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Nationality:--None--Afghan Albanian Algerian American American Samoan Andorran Angolan Antigua Argentinian Armenian Australian Austrian Azerbaijani Bahamas Bahraini Bangladeshi Barbados Belarussian Belgian Belize Benin Bhutan Bolivian Bosnian Botswana Brazilian British British National Overseas Bruneian Brunei Pr Bulgarian Burkina Faso Burmese Burundi Cambodian Cameroon Canadian Canarian Cape Verde Central African Rep Chadian Chilean Chinese Chinese/Hk Sar Chinese/Macau Sar Chinese/Taiwanese Colombian Comoros Congo Congolese Cook Islands Costa Rican Cote D'Ivoire Croatian Cuban Cypriot Czech Czechoslovak Danish Djibouti Dominica Dominican Republic Dutch East Timor Ecuador Egyptian Equatorial Guinea Eritrean Estonian Ethiopian Fijian Filipino Finnish French French Guiana French Polynesia Gabon Gambian Georgian German German, East German, West Ghanaian Greek Grenadian Guadeloupe Guam Guatemala Guinea Guinea-Bissau Guyana Haitian Hollander Honduran Hungarian Icelandic Indian Indonesian Iranian Iraqi Irish (Ireland) Irish (Northern Ireland) Israeli Italian Ivory Coast Jamaican Japanese Jordanian Kampuchean Kazakhstani Kenyan Kiribati Korean, North Korean, South Kosovar Kuwaiti Kyrghis Laotian Latvian Lebanese Lesotho Liberian Libyan Liechtenstein Lithuanian Luxembourg Macedonia Madagascar Malawi Malaysian Malaysia Pr Maldivian Mali Maltese Manchurian Marshallese Martinique Mauritanean Mauritian Mexican Micronesian Moldovan Monaco Mongolian Montenegrin Moroccan Mozambique Myanmar Namibia Nauruan Nepalese Netherlands Antilles New Caledonia New Zealander Nicaraguan Niger Nigerian Niue Island Norwegian Oman Others Pakistani Palauan Palestinian Panamian Papua New Guinea Paraguay Peruvian Pitcairn Polish Portuguese Puerto Rican Qatar Reunion Romanian Russian Rwanda Samoan Citizen Sao Tome And Principe Saudi Arabian Senegalese Serbia Serbian Seychelles Sierra Leone Singapore Citizen Singapore Pr Slavadoran Slovak Slovenian Solomon Islands Somali South African South Sudanese Spanish Sri Lankan St. Lucia St. Vincent Stateless Sudanese Suriname Swazi Swedish Swiss Syrian Tajikistani Tanzanian Thai Togo Tokelau Islands Tonga Trinidad And Tobago Tunisia Turk Turkmenistan Tuvalu Ugandan Ukrainean United Arab Emirates Uruguay Uzbek Vanuatu Venezuelan Vietnamese Wallis And Futuna Western Sahara Western Samoan Yemen, South Yemen Arab Republic Yugoslav Zairan Zambian Zimbabwean How did you hear about us?:--None--Alumnus/Student Recommendation (please specify the name of the student, if recommended) Educational Fair (please specify city/year) Facebook Google Ads Google Search Information Session (please specify city/year)tion> Others (please specify which source) Others_Please_Specify: I would like to receive marketing emails on future updates and events: ST (Asia) 1 NUS MSBAQS Business Master’s Ranking: Business Analytics 2021-2025 TH (Global) 11 NUS MSBAQS Business Master’s Ranking: Business Analytics 2025 ST (Asia) 1 NUS Business SchoolQS World University Rankings 2023 ST (Asia) 1 NUS ComputingQS World University Rankings by Subject 2023 Scholarships Available Choosing the NUS MSBA programme is a significant step towards transforming your personal and professional future. We offer a range of merit-based scholarships to support your journey to success. Find Out More Looking to advance your career in the field of business analytics? Join the NUS MSBA programme and tap into our extensive network of over 100 industry partners. Gain invaluable real-world experience and build connections within your desired industry domains. Many of our NUS MSBA alumni have successfully transitioned to careers with our partner companies. Apply to NUS MSBA Student Testimonials I actually feel that at the end of the day, we are not just developing tech people here. We are actually training the next generation of change makers, leaders, problem solvers — I think that is the real value of the NUS MSBA. It is not just about being technical, it is actually taking the tech, the business side, the people side, melding them together right and coming up with a great solution. I think that’s what’s unique about this programme. Gino Martelli Tiu NUS MSBA Graduate Class of 2022 The NUS MSBA programme was instrumental in equipping me with the necessary skills and knowledge to transition into a data science career. The programme’s emphasis on practical application through real-world projects was invaluable, as this prepared me to confidently apply my skills in a real-world setting. The unique blend of business acumen, technical proficiency, and strong industry partnerships sets the programme apart, making it a major contributor to developing the next generation of change-makers, critical thinkers, and leaders. Swetha Narayanan NUS MSBA Graduate Class of 2020 My first choice for a school was clear. With its strong industry partnerships in Singapore, a hands-on curriculum and consistent ranking among the world’s best, NUS was the perfect university for me to select my course from. Rachel Sng NUS MSBA Graduate Class of 2022 I wanted to become a specialist who can analyse and extract useful information from data. That is what prompted me to embark on the NUS MSBA programme. To me, the MSBA offers me the best of both worlds – the networking and soft skills one would gain from an MBA, and the hands-on and technical rigour of a computing programme. Vincent Lee NUS MSBA Graduate Class of 2018 NUS MSBA has given me an opportunity for extensive growth through close collaboration with people from different industriesI was able to sharpen my analytical skills, as well as develop useful interpersonal skills by communicating my thoughts with confidence and clarity. Tang Han NUS MSBA Graduate Class of 2019 The MSBA programme has been a powerful stepping stone for me. The classroom learnings, capstone project and participating in competitions such as the 2020 NUS-EMC Innovation Challenge has empowered me to fulfil my career aspirations. Li Fengzi NUS MSBA Graduate Class of ",
  "content_length": 11053,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:13"
}