{
  "name": "Siaw-Lynn Ng",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/siaw-lynn-ng",
  "status": "success",
  "content": "Siaw-Lynn Ng - Royal Holloway Research Portal Siaw-Lynn Ng Dr Senior Lecturer, Department of Information Security https://orcid.org/0000-0002-3215-187X Phone+44 1784 414397EmailS.Ngrhul.acuk TW20 0EX Personal profile Personal profileDr Siaw-Lynn Ng B.Sc. (Adelaide) Ph.D. (London) was awarded a B.Sc. (Hons.) degree in Mathematics from the University of Adelaide in 1995, and a Ph.D. in Mathematics from Royal Holloway, University of London in 1998. She was a post-doctoral research assistant at Royal Holloway from 1998 to 2001. Her research interests includes combinatorics and finite geometry and their applications in information security. Siaw-Lynn was appointed as a lecturer in 2001 and a senior lecturer in 2015.Research interestsMy research interest lies in combinatorics and finite geometry and their applications in information security. I have published research papers in the fields of finite geometry, secret sharing schemes and security protocols and many of them demonstrate the symbiosis between discrete mathematics and information security. I am interested in the combinatorial properties of privacy and security in storage of information (such as distributed storage systems, and coded caching for content delivery), and in combinatorial objects associated with codes for information storage and transmission.TeachingI am happy to supervise MSc projects in the areas of Applications of discrete mathematics in information security/cryptography.Any other areas of information security as long as they are interesting!Teaching2021- Module leader for the second/third year computer science course Introduction to Information Security (IY2760/DC3760).2017-2020 Spring term: Module leader for the third year and MSc course on Error-correcting codes (MT3610/MT5461).2015-2016 Module leader for a third year Mathematics undergraduate course (MT3620 Cipher Systems) and the postgraduate course (MT5462 Advanced Cipher Systems).2014 Autumn term: Sabbatical.2004-2013 Module leader for a third year Mathematics undergraudate course (MT3620 Cipher Systems) and the postgraduate course (MT5462 Advanced Cipher Systems).2001-2004 Module leader for two MSc in Information Security courses: Business and Security Issues Raised by Electronic Commerce, and Secure Electronic Commerce and Other Applications.Other workSeries editor (2015-2022), the Computer Weekly (Search Security) Royal Holloway Information Security Thesis Series. These articles can be found at https://royalholloway.ac.uk/research-and-teaching/departments-and-schools/information-security/research/explore-our-research/computer-weekly-search-security-awards/ Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 27 Article 6 Comment/debate 4 Conference contribution 2 Poster 2 More 1 Chapter 1 Abstract Research output per year Research output per year If parallel lines could meet: What exactly can a poet say about the Fano plane?Ng, S.-L. & Collins, K., 14 Oct 2025, (Accepted/In press) In: Journal of Mathematics and the Arts.Research output: Contribution to journal › Article › peer-review 33 Downloads (Pure) Non-disjoint strong external difference families can have any number of setsHuczynska, S. & Ng, S.-L., Jun 2024, In: Archiv der Mathematik. 122, p. 609-619 11 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 33 Downloads (Pure) Optical orthogonal codes from a combinatorial perspectiveHuczynska, S. & Ng, S.-L., Nov 2024, (Submitted) In: Discrete Applied Mathematics.Research output: Contribution to journal › Article › peer-review Securing emergent behaviour in swarm roboticsChen, L. & Ng, S.-L., Feb 2022, In: Journal of Information Security and Applications. 64, 103047.Research output: Contribution to journal › Article › peer-review Open AccessFile 62 Downloads (Pure) Anonymity and Rewards in Peer Rating SystemsGarms, L., Ng, S.-L., Quaglia, E. & Traverso, G., 4 Nov 2021, In: Journal of Computer Security. p. 1-57 57 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 69 Downloads (Pure) View all 41 research outputs Projects 1 Finished Projects per year Collaboration with Sophie HuczynskaNg, S.-L. (PI)1/06/17 → 30/06/18Project: Research Activities 15 Participation in a conference 3 Invited talk 1 Workshop, seminar, course or webinar. 1 Editor of research journal Activities per year Some connections between finite geometry and applications in information security.Ng, S.-L. (Speaker)27 May 2024 → 28 May 2024Activity: Talk, presentation or media contribution › Invited talk IMA International Conference on Cryptography and Coding 2023Ng, S.-L. (Member of programme committee)12 Dec 2023 → 14 Dec 2023Activity: Participating in or organising an event › Participation in a conference the 25th International Conference on Information and Communications Security (ICICS 2023)Ng, S.-L. (Member of programme committee)18 Nov 2023 → 20 Nov 2023Activity: Participating in or organising an event › Participation in a conference ESORICS 2022Ng, S.-L. (Member of programme committee)26 Sept 2022 → 30 Sept 2022Activity: Participating in or organising an event › Participation in a conference The 24th International Conference on Information and Communications SecurityNg, S.-L. (Member of programme committee)5 Sept 2022 → 8 Sept 2022Activity: Participating in or organising an event › Participation in a conference View all 20 activities",
  "content_length": 5723,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:13"
}