{
  "name": "Sicco Verwer",
  "homepage": "https://www.tudelft.nl/staff/s.e.verwer",
  "status": "success",
  "content": "Staff Zoeken Sluit zoek Dr.ir. S.E. (Sicco) Verwer Dr.ir. S.E. (Sicco) Verwer Elektrotechniek, Wiskunde en Informatica Software Technology Algorithmics Pure-profiel Contact S.E.Verwer@tudelft.nl +31 15 27 88435 Ruimte: 28.4.E340 Profiel I am an associate professor within the Algorithms group; I perform pioneering research in machine learning algorithms, focused on learning interpretable models such as automata and decision trees. In addition to being used to make predictions, such models can be visualized, understood, and analyzed. I have contributed to this field's foundations and applications in software engineering and cyber security. I lead the cyber data analytics lab (www.cyber-analytics.nl), which works on developing new tools and algorithms for interpretable machine learning. We apply our work in software engineering and cyber security. All code from my lab is available as open-source and easy-to-use tools on our GitHub page (https://github.com/tudelft-cda-lab). A highlight is the FlexFringe tool for state machines from trace data such as software logs. We have used FlexFringe to learn behavioral profiles of malware, better understand attacker actions from intrusion data, learn models for intrusion detection in industrial control systems, and discover bugs in payment systems. Key publications: Verwer, S., & Zhang, Y. (2019, July). Learning optimal classification trees using a binary linear program formulation. In Proceedings of the AAAI conference on artificial intelligence (Vol. 33, No. 01, pp. 1625-1632). Vos, D., & Verwer, S. (2021, July). Efficient training of robust decision trees against adversarial examples. In International Conference on Machine Learning (pp. 10586-10595). PMLR. Verwer, S., & Hammerschmidt, C. A. (2017, September). FlexFringe: a passive automaton learning package. In 2017 IEEE international conference on software maintenance and evolution (ICSME) (pp. 638-642). IEEE. Nadeem, A., Verwer, S., Moskal, S., & Yang, S. J. (2021). Alert-driven attack graph generation using s-pdfa. IEEE Transactions on Dependable and Secure Computing, 19(2), 731-746. Lin, Q., Adepu, S., Verwer, S., & Mathur, A. (2018, May). TABOR: A graphical model-based approach for anomaly detection in industrial control systems. In Proceedings of the 2018 on Asia conference on computer and communications security (pp. 525-536). Expertise Learning Model Data Algorithms Optimization Algorithms Detection Attack Machine learning Applications Publicaties 2026 An Active Learning Algorithm for Bidirectional Deterministic Finite Automata Simon Dieck / Sicco Verwer 2025 Automated Test-Case Generation for REST APIs Using Model Inference Search Heuristic C.S. Cao / A. Panichella / S.E. Verwer 2025 FlexFringe Modeling software behavior by learning probabilistic automata Sicco Verwer / Christian Hammerschmidt 2025 Preface Frans A. Oliehoek / Manon Kok / Sicco Verwer 2024 Black-box optimization for anticipated baseband-function placement in 5G networks Ligia Maria Moreira Zorello / Laurens Bliek / Sebastian Troia / Guido Maier / Sicco Verwer Meer publicaties Onderwijs 2025 Data Mining Automated Software Testing… Onderwijs 2024 Data Mining Automated Software Testing… Modelling and Problem… Media 2024-12-19 Reducing software errors with transparent AI Verscheen in: TU Delft Lees artikel Reducing software errors with transparent AI Nevenwerkzaamheden Directeur/Directielid/Vennoot/Partner/Eigenaar - self-employed 2023-01-02 - 2026-01-01 Informatie en communicatie Elektrotechniek, Wiskunde en Informatica Software Technology Algorithmics Pure-profiel Contact S.E.Verwer@tudelft.nl +31 15 27 88435 Ruimte: 28.4.E340",
  "content_length": 3654,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:15"
}