{
  "name": "Sicong Liu",
  "homepage": "https://sicongliu-deep.github.io",
  "status": "success",
  "content": "Liu Sicong I'm currently an associate professor in the School of Computer Science at Northwestern Polytechnical University (NPU). Before joining NPU, I received my Ph.D. degree from Xidian University, China, in 2020. And I had an experience as a joint PhD student at Rice University. 我们团队氛围充满活力，每年欢迎博士生（1-2名）和硕士生（2-4名）加入，无论你是对泛在智能应用、嵌入式智能计算、具身智能的前沿挑战充满兴趣，还是渴望参与头部企业系统研发的同学，只要你具备自驱力、富有探索精神，我们都热切期待与你携手共进 ！ 加入我们，你将与一群富有创造力和激情的伙伴一起，探索全球最前沿的技术，解决现实世界中的实际痛点问题。 Research: I care about the knowledge discoveries towards building ubiquitous deep learning system for benefiting common users and reducing the workload of developers. Efficient Deep Learning for Mobile, Embedded, and AIoT Systems. Automated Framework for Mobile and Embedded Deep Learning. Crowd Intelligence for Human-Machine-IoT. Deep Learning Algorithm and Mobile System Co-design. System Platform: Crowd Intelligence with the Fusion of Human, Machine, Things (CrowdHMT) Open Platform [Platform website] [Opensource projects] Selected Publications, (Full List) Book: Crowd Intelligence with the Fusion of Human, Machine, Things Bin Guo, Sicong Liu, Zhiwen Yu China Machine Press 机械工业出版社 2022, Excellent Author Award [Chapter slides download] [Introduction] Introduction to Artificial Intelligence of Things Bin Guo, Sicong Liu, Zhu Wang, Zhigang Li, Yan Liu China Machine Press 机械工业出版社 2023, Golden Code Award [Chapter slides download] [Introduction] 2025: Sicong Liu*, Weiye Wu, Xiangrui Xu, Teng Li, Bowen Pang, Bin Guo, Zhiwen Yu. Adaptive and Resource-efficient Agentic AI Systems for Mobile and Embedded Devices: A Survey. [Arxiv] Haoyu Bian, Bin Guo*, Sicong Liu*, Zhiwen Yu. UbiHR: Resource-efficient Long-range Heart Rate Sensing on Ubiquitous Devices. ACM UbiComp (IMWUT) 2025, CCF-A Yuzhan Wang, Sicong Liu*, Bin Guo*, Boqi Zhang, Ke Ma, Yasan Ding, Hao Luo, Yao Li, Zhiwen Yu. AdaScale: Dynamic Context-aware DNN Scaling via Automated Adaptation Loop on Mobile Devices. IEEE Journal of Internet of Things 2025, Q1, IF:9.515 Sicong Liu, Fengmin Wu, Yuan Gao, Bin Guo*, Zimu Zhou, Hongkai Wen, and Zhiwen Yu, Zhiwen Yu. AdaFlowLite: Scalable and Non-blocking Inference on Asynchronous Mobile Data, IEEE Transactions on Mobile Computing, 2025., CCF-A Sicong Liu, Bin Guo*, Shiyan Luo, Yuzhan Wang, Hao Luo, Cheng Fang, Yuan Xu, Ke Ma, Yao Li, Zhiwen Yu. CrowdHMTware: A Cross-level Co-adaptation Middleware for Context-aware Mobile DL Deployment. IEEE Trans. on Mobile Computing (TMC) 2025, CCF-A Ke Ma, Jiaqi Tang, Bin Guo, Fan Dang, Sicong Liu, Zhui Zhu, Lei Wu, Cheng Fang, Ying-Cong Chen, Zhiwen Yu, Yunhao Liu. SURGEON: Memory-Adaptive Fully Test-Time Adaptation via Dynamic Activation Sparsity. CVPR 2025, CCF-A 罗诗妍, 刘思聪*, 郭斌*,方程,王敏帆,郭赛,於志文. 一种可动态伸缩的移动端深度计算图算优化方法. 计算机研究与发展 2025, CCF T1 2024: Xiaochen Li, Sicong Liu*, Zimu Zhou, Bin Guo, Yuan Xu, Zhiwen Yu. EchoPFL: Asynchronous Personalized Federated Learning on Mobile Devices with On-Demand Staleness Control. ACM UbiComp (IMWUT) 2024, CCF-A [paper] Zhu Wang, Chendi Geng, Zhuo Sun, Zhen Chen, Sicong Liu, Bin Guo, Zhiwen Yu. Size Matters: Characterizing the Effect of Target Size on Wi-Fi Sensing Based on the Fresnel Zone Model. ACM UbiComp (IMWUT) 2024, CCF-A [paper] Fengmin Wu, Sicong Liu*, Kehao Zhu, Xiaochen Li, Bin Guo, Zhiwen Yu, Hongkai Wen, Xiangrui Xu, Lehao Wang, and Xiangyu Liu. AdaFlow: Opportunistic Inference on Asynchronous Mobile Data. ACM SenSys 2024, CCF-B (清华A类), Best Paper Run-up Award [paper][award] Cheng Fang, Sicong Liu*, Zimu Zhou, Bin Guo*, Jiaqi Tang, Ke Ma, and Zhiwen Yu. AdaShadow: Responsive Test-time Model Adaptation in Non-stationary Mobile Environments. ACM SenSys 2024, CCF-B (清华A类), Best Paper Honorable Mentions [paper][award] Sicong Liu*, Hao Luo, Yao Li, Bin Guo, Zhiwen Yu, Yuzhan Wang, Yasan Ding, Yuan Yao. AdaKnife: Flexible DNN Offloading for Inference Acceleration on Heterogeneous Mobile Devices. IEEE Transactions on Mobile Computing (TMC) 2024, CCF-A Xiaochen Li, Sicong Liu*, Zimu Zhou, Yuan Xu, Bin Guo, Zhiwen Yu. ClassTer: Mobile Shift-Robust Personalized Federated Learning via Class-Wise Clustering. IEEE Transactions on Mobile Computing (TMC) 2024, CCF-A Ziqi Wang, Sicong Liu, Bin Guo, Zhiwen Yu, and Daqing Zhang. CrowdLearning: A Decentralized Distributed Training Framework Based on Collectives of Trusted AIoT Devices, IEEE Transactions on Mobile Computing (TMC) 2024 CCF-A Yuan Gao, Sicong Liu*, Bin Guo*, Xiangrui Xu, Haoyu Bian, Jingyi Hao, Wangjin Xu, Zhiwen Yu, Research on Enhanced Lightweight Sensing, Computing, and Decision Coordination Intelligence for Multiple Mobile Devices, SCIENTIA SINICA Informationis, SSI (in Chinese) 2024 中国科学-信息科学, CCF-A [paper] Sicong Liu, Bin Guo, Ziqi Wang, Lehao Wang, Zimu Zhou, Xiaochen Li, Zhiwen Yu, DeepSwarm: Towards Swarm Deep Learning with Bi-directional Optimization of Data Acquisition and Processing, Frontiers of Computer Science, CCF-B Kang Xiong, Sicong Liu*, Hongtao Wang, Yuan Gao, Bin Guo, Zhiwen Yu, Deep Compilation Optimization for UAV Cooperative Localization. Journal of Frontiers of Computer Science and Technology (in Chinese) 2024 计算机科学与探索， CCF-B Sicong Liu, Wentao Zhou, Zimu Zhou, Bin Guo, Minfan Wang, Cheng Fang, Zheng Lin, Zhiwen Yu. Deep Learning Inference on Heterogeneous Mobile Processors: Potentials and Pitfalls. ACM MobiSys 2024 Workshop [paper] Zheng Lin, Bin Guo, Sicong Liu*, Wentao Zhou, Yasan Ding , Yu Zhang, and Zhiwen Yu, AdaOper: Energy-efficient and Responsive Concurrent DNN Inference on Mobile Devices. ACM MobiSys 2024 Workshop [paper] Lehao Wang, Zhiwen Yu*, Sicong Liu*, Chenshu Wu, Xiangrui Xu, Bin Guo, AdaBridge: Dynamic Data and Computation Reuse for Efficient Multi-task DNN Co-evolution in Edge Systems, USENIX NSDI 2024 poster [paper] Zheng Lin, Sicong Liu*, Bin Guo*, Yasan Ding, Zhiwen Yu, 面向智能物联网异构嵌入式芯片的自适应算子并行分割方法, 第二十届全国普适计算学术年会PCC 2024, 最佳论文奖 [paper] Zhaotie Hao，Bin Guo，Kaixing Zhao，Lei Wu，Yasan Ding，Zhetao Li，Sicong Liu, Zhiwen Yu, 从规则驱动到群智涌现：多机器人空地协同研究综述, 自动化学报2024, CCF-A [paper] Yu Zhang, Yingjun Si, Xi Zhang, Sicong Liu, Honghao Zhang, and Hui Yang. A finer-grained high altitude EEG dataset for hypoxia levels assessment. Scientific Data 2025, Nature 子刊 2023: Yanefei Wang, Zhiwen Yu, Sicong Liu, Zimu Zhou, Bin Guo. Genie in the Model: Automatic Generation of Human-in-the-Loop Deep Neural Networks for Mobile Applications. UbiComp (IMWUT), CCF-A Sicong Liu, Xiaochen Li, Zimu Zhou, Bin Guo, Meng Zhang, Haocheng Shen, Zhiwen Yu. AdaEnlight: Energy-aware Low-light Video Stream Enhancement on Mobile Devices. UbiComp (IMWUT), CCF-A [paper] Sicong Liu, Bin Guo, Cheng Fang, Ziqi Wang, Shiyan Luo, Zimu Zhou, Zhiwen Yu. Enabling Resource-efficient AIoT System with Cross-level Optimization: A survey. IEEE Communications Surveys & Tutorials, Q1, IF: 35.6 [paper] Lehao Wang, Zhiwen Yu*, Haoyi Yu, Sicong Liu*, Yaxiong Xie, Bin Guo, Yunxin Liu. AdaEvo: Edge-Assisted Continuous and Timely DNN Model Evolution for Mobile Devices. IEEE Transactions on Mobile Computing (TMC), CCF-A [paper] Bowen Pang, Sicong Liu, Hongli Wang, Bin Guo, Yuzhan Wang, Hao Wang, Sheng Zhenli, Wang Zhongyi, Zhiwen Yu. AdaMEC: Towards a Context-Adaptive and Dynamically-Combinable DNN Deployment Framework for Mobile Edge Computing. ACM Transactions Sensor Network (TOSN), CCF-B [paper] Lehao Wang, Sicong Liu*, Zhiwen Yu*, Haoyi Yu, Bin Guo. Research on a Co-evolution Method for Multi-terminal Video Streaming Models. Journal of Computer Science and Technology (in Chinese) 计算机学报， CCF-A [paper] Bin Guo，Sicong Liu，Yan Liu，Zhigang Li，Zhiwen Yu，Xingshe Zhou. AIoT: Concepts, Architecture, and Key Technologies. Journal of Computer Science and Technology (in Chinese) 计算机学报, CCF-A [paper] Bin Guo，Sicong Liu，Zhu Wang, Yu Zhang, Yuzhan Wang, Cheng Fang, Zhiwen Yu, Xingshe Zhou. Human-Computer Interaction Models and Methods for Ubiquitous OS. Journal of Computer Research and Development (in Chinese) 计算机研究与发展, CCF-A Lei Wu, Bin Guo, Ruonan Xu, Sicong Liu, Yasan Ding, Zhaohui Dang. Modular Robotics from the Perspective of Ubiquitous Computing. SCIENTIA SINICA Informationis, SSI (in Chinese) 中国科学-信息科学, CCF-A 2022: Sicong Liu, Yungang Wu, Bin Guo, Yuzhang Wang, Ke Ma, Liyao Xiang, Zhetao Li, Zhiwen Yu. CAQ: Towards Context-aware and Self-adaptive Deep Model Computation for AIoT Applications. IEEE Journal of Internet of Things, Q1, IF: 9.515 [paper] Bin Guo, Yan Liu, Sicong Liu, Zhiwen Yu, Xingshe Zhou. CrowdHMT: Crowd Intelligence with the Deep Fusion of Human, Machine, and IoT. IEEE Journal of Internet of Things, Q1, IF: 9.515 [paper] Bin Guo, Jiaqi Liu, Sicong Liu, Jiayao Wang, Mengyuan Li, Chen Wang, Zhiwen Yu. CrowdIM: Crowd-Inspired Intelligent Manufacturing Space Design. IEEE Journal of Internet of Things, Q1, IF: 9.515 [paper] Hao Wang, Bin Guo, Wei Wu, Sicong Liu, Zhiwen Yu. Towards information-rich, logical dialogue systems with knowledge-enhanced neural models. NeuroComputing, Q1, IF:4.438 2021: Sicong Liu, Bin Guo, Ke Ma, Zhiwen Yu, Junzhao Du. AdaSpring: Context-adaptive and Runtime-evolutionary Deep Model Compression for Mobile Applications. ACM UbiComp (IMWUT), CCF-A [paper] Hongli Wang, Bin Guo, Jiaqi Liu, Sicong Liu, Yungang Wu, Zhiwen Yu. Context-aware Adaptive Surgery: A fast and effective framework for adaptative model partition. ACM UbiComp (IMWUT), CCF-A [paper] [video] 2020 & before: Sicong Liu, Junzhao Du, Anshumali Shrivastava, Lin Zhong. Privacy Adversarial Network: Representation Learning for Mobile Data Privacy. ACM UbiComp (IMWUT) 2020, CCF-A [paper] [video] Sicong Liu, Junzhao Du, Kaiming Nan, Zimu Zhou, Atlas Wang, Yingyan Lin. AdaDeep: A Usage-Driven, Automated Deep Model Compression Framework for Enabling Ubiquitous Intelligent Mobiles. IEEE Transactions on Mobile Computing 2020, CCF-A [paper] Bin Guo, Yungang Wu，Hongli Wang，Hao Wang，Sicong Liu，Jiaqi Liu，Zhiwen Yu，Xingshe Zhou. Research on Adaptive Methods for Deep Learning Models in Edge Environments. SCIENTIA SINICA Informationis, SSI (in Chinese) 2020 中国科学-信息科学, CCF-A Kaiming Nan, Sicong Liu,",
  "content_length": 15086,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:14"
}