{
  "name": "Siddhartha V. Jayanti",
  "homepage": "https://sites.google.com/view/siddhartha-jayanti",
  "status": "success",
  "content": "Siddhartha JayantiSearch this siteEmbedded FilesSkip to main contentSkip to navigationSiddhartha Jayanti    సిద్ధార్థ జయంతి    सिद्धार्थ जयन्तिI am an Assistant Professor of computer science at Dartmouth College, where I lead the Distributed Computing and Verification Lab. My research spans algorithms, verification, and applications with a focus on designing simple, fast, scalable, and reliable solutions to challenging multidisciplinary problems. My work has touched several areas of inquiry, including distributed computing, algorithms, verification, relativistic physics, economics, security, and machine learning. Prior to Dartmouth, I worked as a research scientist at Google Research and Artificial Intelligence, where I designed and deployed fast and formally verified algorithms for large-scale data processing and clustering.I received my PhD from MIT's Computer Science and Artificial Intelligence, advised by Julian Shun. Prior to that, I received an MS from MIT, advised by Costis Daskalakis, and a BSE from Princeton University, where my thesis was advised by Bob Tarjan and my research on mathematics in Sanskrit was advised by Manjul Bhargava.I am a faculty advisor to Dartmouth Shanti, the Hindu Student Organization of Dartmouth. I am a Sakahari (Hindu Strict Vegetarian), and I aspire to contribute to the understanding of dharma and experience of ānanda.I am passionate about Telugu and Sanskrit. I wrote the first modern computer science research paper in Telugu, which is included in my MIT Ph.D. thesis with an abstract in Sanskrit. I was honored as the Salutatorian at the inaugural Hindu Students Council Commencement where I delivered a speech in Sanskrit addressing graduating students from around the world. I learnt Sanskrit through Samskirta Bharati's SAFL, at Princeton, and at MIT as the president of MIT Samskritam.EducationPh.D. MIT 2023: Thesis: Simple, Fast, Scalable, and Reliable Multiprocessor Algorithms, Minor: Machine LearningCommittee: Julian Shun (MIT, advisor), Charles Leiserson (MIT), Bob Tarjan (Princeton)ACM Principles of Distributed Computing Doctoral Dissertation AwardACM SIGACT Article: Distributed and Algorithmic Thinking across DomainsMIT News: Article on the Telugu and Sanskrit portion of the dissertationNDSEG FellowshipS.M. MIT 2020 Thesis: On Computing Nash Equilibria of Borel's Colonel Blotto Game for Multiple Players Including in Arbitrary Measure SpacesAdvisor: Costis Daskalakis (MIT)B.S.E. Princeton 2017Thesis: Concurrent Disjoint Set Union, Computer Science with a Certificate in Applied and Computational MathematicsAdvisor: Bob Tarjan (Princeton)Outstanding Senior Thesis Prize from Princeton Computer Science Department Calvin Dodd MacCracken Senior Thesis Award from Princeton School of Engineering and Applied ScienceRunner-Up for CRA Outstanding Undergraduate Research AwardBarry Goldwater Scholarship, NSF Center for Science of Information Channels ScholarshipSelected Publications (dblp)On Interplanetary and Relativistic Distributed ComputingSiddhartha Jayanti. ACM PODC 2025. Formal Machine-Verification of MemSnap: An Efficient, Far-Future Linearizable Snapshot AlgorithmSiddhartha Jayanti and Ugur Yavuz. ACM SPAA 2025. Distinguished Paper AwardConcurrent Disjoint Set UnionSiddhartha Jayanti and Robert Tarjan. Distributed Computing 2021. A Universal, Sound, and Complete Forward Reasoning Technique for Machine-Verified Proofs of LinearizabilityPrasad Jayanti, Siddhartha Jayanti, Ugur Yavuz, and Lizzie Hernandez. ACM POPL 2024. MemSnap: A Fast Adaptive Snapshot Algorithm for RMWable Shared MemoryPrasad Jayanti, Siddhartha Jayanti, and Sucharita Jayanti. ACM PODC 2024.The Multiplayer Colonel Blotto Game. Enric Boix-Adserà, Ben Edelman, and Siddhartha Jayanti. ACM EC 2020 and Games and Economic Behavior (GEB) 2021.The Samskritam Technical Lexicon Project: A Shared STEM Lexicon for Indian Languages and సామాన్య జాగృతి-పరిష్కారంSiddhartha Jayanti (సిద్ధార్థ జయంతి).contact: siddhartha.visveswara.jayanti@dartmouth.edu Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4083,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:18"
}