{
  "name": "Siddharth Krishnan",
  "homepage": "https://webpages.uncc.edu/~skrish21",
  "status": "success",
  "content": "Siddharth Krishnan, University of North Carolina - Charlotte Siddharth Krishnan Assistant Professor Computer Science Department University of North Carolina - Charlotte About Me I am an Assistant Professor in the Department of Computer Science at the University of North Carolina at Charlotte. Go 49ers!! At UNC-Charlotte, I direct the Network Analytics and Social Computing Lab (NASCL) [webpage under construction]. I am also an affiliate faculty member of the Complex Systems Instiute and the School of Data Science. I received a Ph.D. from the Computer Science Department at Virginia Tech. Prior to joining Virginia Tech, I obtained an M.S. (Computer Science) from the Computer Science department at Florida State University. So I guess I am a Seminole first and then a Hokie! I attended Sri Sathya Sai Univesity in India, where I obtained an integrated B.S./M.S. in Mathematics. Research Interests How do memes spread on Facebook? How and when does a hashtag become popular? Can we forecast/predict viral content? How can we harness information cascades to make 'real-world' predictions? I am broadly interested in web-mining, data analytics, computational social science, and applied machine learning with a primary emphasis on analyzing, characterizing, and forecasting information (news, rumors, memes, advertisements, etc.) dynamics on online social networks & social media. Furthermore, my research aims to leverage dynamical processes (like cascade propagation) to build explanatory & predictive models of actions of large groups of people and societies. Publications: Refereed Journals and Conference Proceedings (in reverse chronological order) Contrasting Misinformation and Real-Information Dissemination Network Structures on Social Media During a Health Emergency [PDF] L. Safarnejad, Q. Xu, Y. Ge, A. Bagavathi, S. Krishnan, and S. Chen in the American Journal of Public Health 110, S340-S347, 2020 DeL-haTE: A Deep Learning Tunable Ensemble for Hate Speech Detection [PDF] J. Melton, A. Bagavathi, and S. Krishnan in the IEEE International Conference on Machine Learning Applications (ICMLA), 2020 Detecting Online Hate Speech: Approaches Using Weak Supervision and Network Embedding Models [PDF] M. Ridenhour, A. Bagavathi, E. Raisi, and S. Krishnan in the Springer International Conference on Social Computing, Behavioral-Cultural Modeling & Prediction, and Behavior Representation in Modeling and Simulation (SBP-BRiMS), 2020 Identifying Influential Factors on Discussion Dynamics of Emerging Health Issues on Social Media: A Computational Study [PDF] L. Safarnejad, Q. Xu, Y. Ge, A. Bagavathi, S. Krishnan, and S. Chen; in the JMIR (Journal of Medical Internet Research) Public Health and Surveillance, 2020 ragamAI: A Network Based Recommender System to Arrange a Indian Classical Music Concert [PDF] Arunkumar Bagavathi, Siddharth Krishnan, Sanjay Subrahmanyan, and S.L. Narasimhan in the IEEE International Conference On Machine Learning Applications, Boca Raton, FL, 2019 Extracting Cryptocurrency Price Movements From the Reddit Network Sentiment [PDF] with A. Bagavathi, S. Wooley, A. Edmonds, and S. Krishnan in the IEEE International Conference On Machine Learning Applications, Boca Raton, FL, 2019 Examining Untempered Social Media: Analyzing Cascades of Polarized Conversation [PDF] with A. Bagavathi, P. Bashiri, S. Reid, M. Phillips, and S. Krishnan in the IEEE/ACM Advnaces in Social Network Analysis and Mining (ASONAM), Vancouver, Canada, 2019 MultiNet: Scalable Multilayer Network Embeddings [PDF] A. Bagavathi and S. Krishnan in the Springer International Conference on Complex Networks and Applications, Cambridge, UK, 2018 Dynamics of Health Agency Response and Public Engagement during Public Health Emergency: A Case Study of CDC Tweeting Pattern during 2016 Zika Epidemic in the U.S. [PDF] S. Chen, Q. Xu, J. Buchenberger, A. Bagavathi, G. Fair, S. Shaikh, and S. Krishnan in Journal of Medical Internet Research Public Health and Surveillance, Vol4 No 4, 2018 Comparative Analysis of Real vs Fake Health Information Dissemination Dynamics on Social Media [LINK] S. Chen, S. Krishnan, S. Shaikh, and J. Buchenberger in American Public Health Association Annual Meeting and Expo, San Diego, CA, 2018 Deep Learning Based Urban Analytics Platform: Applications to Traffic Flow Modeling and Prediction [PDF] with A. Parnami, P. Bavi, D. Papanikolaou, S. Akella. M. Lee, and S. Krishnan in ACM SIGKDD Workshop on Mining Urban Data (MUD3), London, UK, 2018 Social Sensors: Early Detection of Contagious Outbreaks in Social Media [PDF] A. Bagavathi and S. Krishnan in Springer International Conference on Applied Human Factors and Ergonomics, Orlando, USA, 2018 Seeing the Forest for the Trees: New approaches to forecasting cascades [PDF] Siddharth Krishnan, Patrick Butler, Ravi Tandon, Jure Leskovec, and Naren Ramakrishnan in ACM Web Science (WebSci'16), Hannover, Germany, 2016 Received ACM SIGWeb Travel Award A Mechanism Design Approach to Influence Maximization in Social Networks [PDF] Michael Levet and Siddharth Krishnan in EAI Intl. Conf. on Game Theory for Networks, British Columbia, Canada, 2016 Received VT@CS Travel Scholarship Inferring Multi-dimensional Ideal Points for US Supreme Court Justices [PDF] M. R. Islam, K.S.M.Tozammel Hossain, Siddharth Krishnan, and Naren Ramakrishnan in AAAI Conference on Artificial Intelligence (AAAI'16), Phoenix, AZ, 2016 Featured in ACM TechNews, The Conversation, and Daily Mirror Pricing a Protest: Forecasting the Dynamics of Civil Unrest Activity in Social Media [PDF] Siddharth Krishnan, Brian Goode, Michael Roan, and Naren Ramakrishnan PLoS ONE, Vol. 10, No. 10, 2015 The Dynamics of Competing Cascades in Social Media: Applications to Agenda Setting [PDF] Siddharth Krishnan, J. Cadena, and Naren Ramakrishnan in WSDM 2014 Workshop on Diffusion Networks and Cascade Analytics, New York, NY, 2014Press: [Phys.org article] Encouraging civic participation through local news aggregation. [PDF] Andrea Kavanaugh, Siddharth Krishnan, Manuel Perez-Quinones, et. al. Information Polity 19 (1-2): 35-56, 2014. Dynamic Load Balancing for Peta-scale Quantum Monte Carlo Applications [PDF] C.D. Sudheer, Siddharth Krishnan, Ashok Srinivasan, and Paul Kent Computer Physics Communications, 184, 284-292, 2013. Miscellaneous The daily use of Gab is climbing. Which talker might become as violent as the Pittsburgh synagogue gunman? The Monkey Cage, The Washington Post [LINK] with Matt Phillips, Arunkumar Bagavathi, and others Technical Report: A inventory of open and dark web marketplace for identity misrepresentation [PDF] with Arunkumar Bagavathi, Bojan Cukic, and others Using Cascades as Sensors: A non-network approach to forecast information contagion (manuscript)[e-mail for copy] Siddharth Krishnan, Arunkumar Bagavathi, and Lenwood Heath (under review) Analyzing and forecasting the growth of concurrent cascades: A forest of trees approach (manuscript) [e-mail for copy] Siddharth Krishnan and Jose Cadena (under preparation) Theses Seeing the Forest for the Trees: New Approaches to Characterizing and Forecasting Cascades Siddharth Krishnan Ph.D. Thesis, Virginia Tech, 2017 Dynamic Load Balancing for Peta-scale Quantum Monte Carlo ApplicationsSiddharth Krishnan M.S. Thesis, Florida State University, 2011 Teaching At UNC Charlotte ITIS 6520: Network Science [Fall 2018] DSBA 6156: Applied Machine Learning [Fall 2017, Spring 2018] At Virginia Tech CS4984: Capstone in Social Network Analytics [Spring 2017] (Instructor) CS5644: Machine Learning with Big Data [Fall 2016] (Teaching Assistant) CS5984: Introduction to Urban Computing [Fall 2015, Fall 2016] (Teaching Assistant) Contact Office Woodward Hall | 403B Mailing Address: UNC Charlotte | College of Computing and Informatics 9201 University City Blvd. Charlotte, NC 28223 Phone & Email +1-704-687-6170 invert(uncc.edu @ skrishnan) Primary laout designed by Polo Chau",
  "content_length": 7931,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:19"
}