{
  "name": "Sidd Kaza",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/skaza.html",
  "status": "success",
  "content": "Siddharth Kaza | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Sidd Kaza, Ph.D. Vice President for Research Contact Info Phone: 410-704-3701 Office: AD 325 Email: skaza@towson.edu @siddharthkaza https://www.linkedin.com/in/sidd-kaza-9ba805/ https://wp.towson.edu/skaza Education Ph.D., Management Information Systems, University of Arizona \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tM.S., Computer Science, Central Michigan University \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tB.Sc., Mathematical Sciences, University of Delhi Areas of Expertise Data Mining and Knowledge Discovery \t\t\t\t\t\t\t\t\t\t\t\tCybersecurity Education \t\t\t\t\t\t\t\t\t\t\t\tLearning Sciences Biography Sidd Kaza is the Vice President for Research at Towson University. He is the Maryland E-Nnovation Endowed Professor of Cybersecurity. His research interests lie in cybersecurity, data mining, and application development and he is a principal investigator on several cybersecurity projects. He has received over $13 million dollars in funding from the National Science Foundation, Department of Defense, Intel, and others. Dr. Kaza was on the ACM/IEEE/AIS/IFIP Joint Global Task Force on Cybersecurity Education that produced the first four-year cybersecurity curricular guidelines. In 2018, he received the University System of Maryland Regents Award for Excellence in Teaching and in 2014 he received the Excellence in Scholarship award. Dr. Kaza is the Co-Executive Director and Co-Founder of SecurEd, a not-for-profit startup organization focused on helping academic institutions build a cyber-ready workforce. Project Director Dr. Kaza serves as project director for the following cybersecurity projects: Security InjectionsEmail: injections AT_TOWSON Cyber4All   Email: Cyber4All AT_TOWSON CLARKâCybersecurity Curriculum Digital Library Funded Grants PI, âCyber4All: An Interdisciplinary Cybersecurity Minor for all Undergraduates,â Funded by: National Science Foundation (NSF), 2015, $280,706, 2015-2017. Co-PI, âCyberWorkshops: Resources and, Strategies, and Support for Teaching Cybersecurity in Computer Science Courses (CReST),â Funded by: National Science Foundation (NSF), 2014, $549,942 ($127,025 at TU), 2014-2016. PI, âSecurity Injections for CSO, CS1, and CS2:  Promoting Responsible Coding and Building a Community of Security Ambassadors,â Funded by: National Science Foundation (NSF), 2012, $451,879, 2012-2015 Co-PI, âRevitalizing the Computer Science Undergraduate Curriculum Inside and Outside of the Classroom Using Mobile Computing Platforms,â Funded by: National Science Foundation (NSF), 2012, $199,971, 2012-2014 Co-PI, âScholarship for Service at Towson University,â Funded by: National Science Foundation (NSF), 2012, $2,093,834, 2012-2016 Co-PI, âBasic Recruitment and Capacity Building,â Funded by:  Department of Defense (DOD) â Information Assurance Scholarship Program, 2010, $95,815, 2010-2011 Co-PI, âBuilding Security In: Injecting Security throughout the Undergraduate Computing Curriculum,â Funded by: National Science Foundation (NSF), 2008, $399,511, 2008-2011 Co-PI, âPiloting Pathways for Computational Thinking in a General Education Curriculum,â Funded by: National Science Foundation (NSF), 2008, $164,981, 2008-2011 Co-PI, âExpanding an Applied Information Technology Masters Program,â Funded by: Maryland Higher Education Commission (MHEC), 2008, $90,990, 2009-10 Selected Publications and Presentations Taylor, B. and Kaza, S. (2016), âSecurity Injections@Towson: Integrating Secure Coding into Introductory Computer Science Coursesâ, ACM Transactions on Computing Education (TOCE), 16(4) Siraj, A., B. Taylor, S. Kaza, S. Ghafoor (2015), âIntegrating security in the computer science curriculum,â ACM Inroads, 6(2), pp 77-81 Abbasi, A., F. Zahedi, S. Kaza (2012), âDetecting Fake Online Pharmacy Websites using Recursive Trust Labeling,â ACM Transactions on Information Systems (TOIS), 30 (4), Kaza, S., P. Hu, H. Hu, H. Chen (2011), âDesigning, Implementing, and Evaluating Information Systems for Law Enforcement â A Long-term Design-science Research Project,â Communications of the Association of Information Systems (CAIS), 29 Kaza, S., J. Xu, B. Marshall and H. Chen (2009), âTopological Analysis of Criminal Activity Networks: Enhancing Transportation Security,â IEEE Transactions on Intelligent Transportation Systems, 10(1). pp. 83-91. Kaza, S. and H. Chen (2008), âEvaluating ontology mapping techniques: An experiment in public safety information sharing: An Experiment in Public Safety Information Sharing,â Decision Support Systems, 45(4), pp. 714-728 Conference Publications Raina, S., Kaza, S., Taylor, B. (2014), âSegmented and Interactive Modules for Teaching Secure Coding: A Pilot Study,â International Conference on e-Learning e-Education and Online Training, Bethesda, MD Becker, A. B., Kaza, S., Goldberg A. (2014), âInterplay between Traditional Media, Social Media, and the Law-making Process: A Study on the Marriage Equality Issue in Maryland,â Proceedings of the International Conference for E-Democracy and Open Government, Krems, Germany Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 8249,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:15"
}