{
  "name": "Siddhartha Banerjee",
  "homepage": "https://people.orie.cornell.edu/sbanerjee",
  "status": "success",
  "content": "Sid Banerjee Search Siddhartha Banerjee Associate Professor Operations Research and Information Engineering Cornell University Beyond knowing how things are, There is no other understanding. A Song on the Six Perfections, Milarepa I am an associate professor in the School of Operations Research and Information Engineering (ORIE) at Cornell, as well as a field member in Departments of Computer Science, ECE, and the Center for Applied Mathematics. I work on topics at the intersection of data-driven decision-making and stochastic control, economics and computation, and large-scale network algorithms. Some of my current research interests include: New data-driven approaches for online decision-making [seminar] Non-monetary mechanisms and information design [seminar] Equity and fairness in online decision-making [seminar] Stochastic coupling techniques in control (tutorial: [part 1], [part 2]) Prior to Cornell, I received my PhD from the ECE Department at UT Austin, and was a postdoctoral researcher at Stanford MS&E. I also served as technical consultant at Lyft in 2014-18, where I helped develop and implement Lyft’s primetime pricing; the following tutorial and book chapter give an overview of my work on ridesharing platforms. I am currently on sabbatical at the Simons Institute in Berkeley as a co-organizer of the program on Data-Driven Decision-Making. Recent Publications See all publications But above all Always above all else: how does one act If one believes what you say? - The Doubter, Bertolt Brecht [conf] Sequential Fair Allocation: Achieving the Optimal Envy-Efficiency Tradeoff Curve (2021) SIGMETRICS ‘22. Sean Sinclair, Siddhartha Banerjee, Christina Lee Yu PDF Cite arXiv code [conf] Online Nash Social Welfare with Predictions (2021) SODA ‘22. Siddhartha Banerjee, Vasilis Gkatzelis, Artur Gorokh, Billy Jin PDF Cite arXiv [preprint] Pseudo-Competitive Games and Algorithmic Price Competition (2021) Preprint SSRN_id:3925242 Chamsi Hssaine, Siddhartha Banerjee, Vijay Kamble PDF Cite SSRN [conf] Threshold Tests as Quality Signals: Optimal Strategies, Equilibria, and Price of Anarchy (2021) WINE ‘21. Siddhartha Banerjee, David Kempe, Robert Kleinberg Cite arXiv [conf] The Remarkable Robustness of the Repeated Fisher Market (2021) EC ‘21. Artur Gorokh, Siddhartha Banerjee, Krishnamurthy Iyer PDF Cite Video SSRN [jour] Pricing and Optimization in Shared Vehicle Systems: An Approximation Framework (2021) Operations Research Siddhartha Banerjee, Daniel Freund, Thodoris Lykouris PDF Cite ArXiv [conf] Real-Time Approximate Routing for Smart Transit Systems (2021) SIGMETRICS ‘21. Siddhartha Banerjee, Chamsi Hssaine, Noemie Perivier, Samitha Samaranayake PDF Cite Link arXiv [preprint] The Limits of an Information Intermediary in Auction Design (2020) Preprint arXiv_id:2009.11841 Reza Alijani, Siddhartha Banerjee, Kamesh Munagala, Kangning Wang PDF Cite arXiv [jour] Computing Constrained Shortest-Paths at Scale (2020) Operations Research Alberto Vera, Siddhartha Banerjee, Samitha Samaranayake PDF Cite [conf] Adaptive Discretization for Model-Based Reinforcement Learning (2020) NeurIPS ‘20. Sean Sinclair, Tianyu Wang, Gauri Jain, Siddhartha Banerjee, Christina Lee Yu PDF Cite Video arXiv Code See all publications Again and as always, and as seen above there are no questions more urgent than the naive ones. - The Turn of the Century, Wislawa Szymborska Students and Collaborators And the point is, to live everything. Live the questions now. Perhaps then someday far in the future, you will gradually, without noticing, live your way into the answer. - Letters to a Young Poet #4, Rainer Maria Rilke Current PhD Advisees Chamsi Hssaine ORIE PhD Sean Sinclair ORIE PhD Co-advised by Christina Yu Matthew Eichhorn CAM PhD Past Advisees Alberto Vera Research Scientist, Amazon ORIE PhD (2020) Artur Gorokh Research Scientist, Facebook CAM PhD (2020) Co-advised by Kris Iyer Raga Gopalakrishnan Asst Prof, Queens University Postdoc (2019) Qi Luo Asst Prof, Clemson University Postdoc (2020) Other Past Student Collaborators Cristopher Archer ORIE undergraduate Carrie Rucker ORIE undergraduate (2021) Max Solberg ORIE/CS undergraduate (2021) Technology Analyst @ Morgan Stanley Gauri Jain CS undergraduate (2020) Data Scientist @ Facebook (joining Harvard CS for a PhD in 2022) Thodoris Lykouris Cornell CS PhD (2019) Assistant Professor @ MIT Sloan Clare Snyder IS undergraduate (2019) PhD student @ Michigan Ross Noemie Perivier Ecole Polytechnique intern (2019) PhD student @ Columbia IEOR Xiang (Felix) Fu CS undergraduate (2019) PhD student @ MIT EECS Daniel Freund Cornell CAM PhD (2018) Assistant Professor @ MIT Sloan Thibault Séjourné Ecole Polytechnique intern (2017) PhD student @ Ecole Normale Supériure Sid Reddy CS undergraduate (2017) PhD student @ Berkeley EECS Nitin Shyamkumar CS undergraduate (2017) PhD student @ NYU Courant Teaching May there be many summer mornings when, with what pleasure, what joy, you enter harbors you are seeing for the first time. - Ithaka, Constantine Cavafy Fa 2021 Online Decision-Making and Market Design ORIE 6180  [Graduate] Sp 2021 Information Theory & Bayesian ML ORIE 4742  [UG/Masters] Fa 2020 Simulation Modeling and Analysis ORIE 4580/5580/5581  [UG/Masters] Sp 2020 Information Theory and Bayesian ML ORIE 4742  [UG/Masters] Fa 2019 Applied Stochastic Processes ORIE 6500  [Graduate] Fa 2018 Simulation Modeling and Analysis ORIE 4580/5580/5581  [UG/Masters] Sp 2018 Markov Chain Mixing and Applications ORIE 7591  [Graduate topics] Fa 2017 Simulation Modeling and Analysis ORIE 4580/5580/5581  [UG/Masters] Sp 2017 Pricing and Market Design ORIE 4154  [UG/Masters] Fa 2016 Revenue Management ORIE 6154  [Graduate] Sp 2016 The Design of Online Marketplaces ORIE 6180  [Graduate] Fa 2015 Stochastics at Scale ORIE 4520  [UG/Masters] We shall not cease from exploration and the end of all our exploring will be to arrive where we started and know the place for the first time. - Little Gidding (from the Four Quartets), T. S. Eliot Bio Download complete CV Don't worry about the overall importance of the problem; work on it if it looks interesting. I think there's probably a sufficient correlation between interest and importance. - David Blackwell Sid Banerjee is an associate professor in the School of Operations Research at Cornell, working on topics at the intersection of data-driven decision-making, network algorithms and market design. His research is supported by grants from the NSF (including an NSF CAREER award, as well as CNS 1955997, CNS 1952011 and DMS 1839346), the ARL Network Sciences division, and Engaged Cornell. His work has received several awards, including the Erlang Prize, and the INFORMS APS Best Publication Award. Before coming to Cornell, Sid received his PhD from the ECE Department at UT Austin, and was a postdoctoral researcher in the Social Algorithms Lab at Stanford. He served as a technical consultant with the research science group at Lyft. Cite × Copy Download",
  "content_length": 7010,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:20"
}