{
  "name": "Siddharth Gupta 0002",
  "homepage": "https://guptasid.bitbucket.io",
  "status": "success",
  "content": "Siddharth Gupta I am currently an Assistant Professor at the Department of Computer Science & Information Systems at BITS Pilani, K K Birla Goa Campus, India. Before moving to Goa, I was a Postdoctoral Researcher at the Department of Computer Science at University of Warwick, UK advised by Professor Ramanujan Sridharan. Before that, I was a Zuckerman Postdoctoral Scholar at the Department of Computer Science at Ben-Gurion University, Israel advised by Professor Meirav Zehavi. I received my PhD in Computer Science from University of California, Irvine, USA in 2018, advised by Professor David Eppstein and Professor Michael T. Goodrich, and my Master in Mathematics and Bachelor in Computer Science from BITS Pilani, K K Birla Goa Campus, India in 2014, advised by Professor Ankit Agrawal and Professor Tarkeshwar Singh. Research Interests My research interests lie in Graph Algorithms and Computational Geometry, more specifically in Graph Drawing, Parameterized Complexity, Approximation Algorithms, Fine-Grained Complexity and Combinatorial Reconfiguration. Publications (All publications are in alphabetical order of author's last name, except when marked with * ) 2026 Parameterized Approaches to Orthogonal Compaction W. Didimo, S. Gupta, P. Kindermann, G. Liotta, A. Wolff, M. Zehavi Journal of Computer and System Sciences (JCSS), vol. 155 (special issue on SOFSEM 2023). A preliminary version of this article appeared in SOFSEM 2023. 2025 Efficient Distributed Algorithms for Shape Reduction via Reconfigurable Circuits N. Almalki, S. Gupta, O. Michail, and A. Padalkin To appear at SSS 2025. Preprint on arXiv. A brief announcement of this article appeared in SAND 2025. On the Exponential Growth of Geometric Shapes N. Almalki, S. Gupta, and O. Michail Theoretical Computer Science, vol. 1053 (special issue on ALGOWIN 2024). A preliminary version of this article appeared in ALGOWIN 2024. Brief Announcement: Efficient Distributed Algorithms for Shape Reduction via Reconfigurable Circuits N. Almalki, S. Gupta, O. Michail, and A. Padalkin SAND 2025. Preprint on arXiv. 2024 Exact Algorithms for Clustered Planarity with Linear Saturators G. Da Lozzo, R. Ganian, S. Gupta, B. Mohar, S. Ordyniak, M. Zehavi ISAAC 2024. Preprint on arXiv. On the Exponential Growth of Geometric Shapes N. Almalki, S. Gupta, and O. Michail ALGOWIN 2024. Preprint on arXiv. Best Student Paper Award. Invited to Theoretical Computer Science (TCS), special issue on ALGOWIN 2024. A brief announcement of this article appeared in SAND 2024. Collision Detection for Modular Robots - it is easy to cause collisions and hard to avoid them S. Gupta, M. J. V. Kreveld, O. Michail, and A. Padalkin ALGOWIN 2024. Preprint on arXiv. A brief announcement of this article appeared in SAND 2024. Weakly Leveled Planarity with Bounded Span M. Bekos, G. Da Lozzo, F. Frati, S. Gupta, P. Kindermann, G. Liotta, I. Rutter, and I. Tollis GD 2024. Preprint on arXiv. Bounding and Computing Obstacle Numbers of Graphs M. Balko, S. Chaplick, R. Ganian, S. Gupta, M. Hoffmann, P. Valtr, and A. Wolff SIAM Journal on Discrete Mathematics, vol. 38. A preliminary version of this article appeared in ESA 2022. Brief Announcement: On the Exponential Growth of Geometric Shapes N. Almalki, S. Gupta, and O. Michail SAND 2024. Preprint on arXiv. Brief Announcement: Collision Detection for Modular Robots - it is easy to cause collisions and hard to avoid them S. Gupta, M. J. V. Kreveld, O. Michail, and A. Padalkin SAND 2024. Preprint on arXiv. 2023 Drawn Tree Decomposition: New Approach for Graph Drawing Problems S. Gupta, G. Sa’ar, and M. Zehavi IPEC 2023. Preprint on arXiv. Collective Graph Exploration Parameterized by Vertex Cover S. Gupta, G. Sa’ar, and M. Zehavi IPEC 2023. Preprint on arXiv. The Parametrized Complexity of the Segment Number S. Cornelsen, G. Da Lozzo, L. Grilli, S. Gupta, J. Kratochvil, and A. Wolff GD 2023. Preprint on arXiv. Grid Recognition: Classical and Parameterized Computational Perspectives S. Gupta, G. Sa’ar, and M. Zehavi Journal of Computer and System Sciences (JCSS), vol. 136. A preliminary version of this article appeared in ISAAC 2021. Improved Kernels for Tracking Paths P. Choudhary, M. T. Goodrich, S. Gupta, H. Khodabandeh, P. Matias, and V. Raman Information Processing Letters (IPL), vol. 181. Parameterized Approaches to Orthogonal Compaction W. Didimo, S. Gupta, P. Kindermann, G. Liotta, A. Wolff, M. Zehavi SOFSEM 2023. Preprint on arXiv. Invited to Journal of Computer and System Sciences (JCSS), special issue on SOFSEM 2023. 2022 On Sparse Hitting Sets: from Fair Vertex Cover to Highway Dimension J. Blum, Y. Disser, A. Feldmann, S. Gupta, A. Zych-Pawlewicz IPEC 2022. Preprint on arXiv. Bounding and Computing Obstacle Numbers of Graphs M. Balko, S. Chaplick, R. Ganian, S. Gupta, M. Hoffmann, P. Valtr, and A. Wolff ESA 2022. Preprint on arXiv. Brief Announcement: Distributed Reconfiguration of Spanning Trees S. Gupta, M. Kumar, and S. Pai SSS 2022. 2021 Grid Recognition: Classical and Parameterized Computational Perspectives S. Gupta, G. Sa’ar, and M. Zehavi ISAAC 2021. Preprint on arXiv. Parameterized Complexity of Finding Subgraphs with Hereditary Properties on Hereditary Graph Classes (blog) D. Eppstein, S. Gupta, and E. Havvaei FCT 2021. Preprint on arXiv. C-Planarity Testing of Embedded Clustered Graphs with Bounded Dual Carving-Width G. Da Lozzo, D. Eppstein, M. T. Goodrich, and S. Gupta Algorithmica 2021, vol. 83 (special issue on IPEC 2019). A preliminary version of this article appeared in IPEC 2019. How to Catch Marathon Cheaters: New Approximation Algorithms for Tracking Paths M. T. Goodrich, S. Gupta, H. Khodabandeh, and P. Matias WADS 2021. Preprint on arXiv. Multivariate Analysis of Scheduling Fair Competitions S. Gupta and M. Zehavi AAMAS 2021. Preprint on arXiv. 2020 Parameterized Complexity of Motion Planning for Snake-Like Robots S. Gupta, G. Sa’ar, and M. Zehavi Journal of Artificial Intelligence Research (JAIR), vol. 69. Invited to the Journal Track of IJCAI 2021. A preliminary version of this article appeared in IJCAI 2019. 2019 C-Planarity Testing of Embedded Clustered Graphs with Bounded Dual Carving-Width G. Da Lozzo, D. Eppstein, M. T. Goodrich, and S. Gupta IPEC 2019. Preprint on arXiv. Best Paper Award. Invited to Algorithmica, special issue on IPEC 2019. Parameterized Complexity of Motion Planning for Snake-Like Robots S. Gupta, G. Sa’ar, and M. Zehavi IJCAI 2019. Preprint on arXiv. Exploiting Hopsets: Improved Distance Oracles for Graphs of Constant Highway Dimension and Beyond S. Gupta, A. Kosowski, and L. Viennot ICALP 2019. Preprint on arXiv. 2018 Subexponential-Time and FPT Algorithms for Embedded Flat Clustered Planarity (blog) G. Da Lozzo, D. Eppstein, M. T. Goodrich, and S. Gupta WG 2018. Preprint on arXiv. 2017 Crossing Patterns in Nonplanar Road Networks (blog) D. Eppstein and S. Gupta SIGSPATIAL 2017. Preprint on arXiv. 2016 A Topological Algorithm for Determining How Road Networks Evolve Over Time M. T. Goodrich, S. Gupta, and M. R. Torres SIGSPATIAL 2016. Preprint on arXiv. 2014 *A New Parallel Algorithm for Two-Pass Connected Component Labeling S. Gupta, D. Palsetia, M. Patwary, A. Agrawal, and A. Choudhary MTAAP 2014. Preprint on arXiv. Miscellaneous I am excited to introduce Creative Threads: my wife and mother’s crochet/knitting business. Explore the Gallery on Instagram. Order Your Treasures: Want anything from the page or any customized crochet or knitted product like sweater, birthday/anniversary banners, toranpatti, stuffed toys etc. plz DM on Instagram. If the stitches warm your heart, hit the like button. Follow our journey of creativity and share the yarn love! Let’s knit joy, one thread at a time :)",
  "content_length": 7757,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:17"
}