{
  "name": "Siddharth",
  "homepage": "https://ssiddharth.in/about-me",
  "status": "success",
  "content": "About Me | Siddharth About Me | Siddharth’s personal website. Siddharth Hi there, I am an Assistant Professor at Plaksha University where I lead the Human-Technology Interaction (HTI) Lab. To visit my lab's webpage, please click here. Before joining Plaksha, I was a Senior Human Factors Engineer in the Human Factors Center of Excellence at Microsoft USA. Earlier, I obtained my Ph.D. from the University of California San Diego (UC San Diego) in June 2020 working with Tzyy-Ping Jung, Terry Sejnowski, and Mohan Trivedi. My research focus spans Artificial Intelligence, Computational Neuroscience, and Affective Computing. Specifically, I work with multi-modal bio-sensing and vision-based sensor modalities for detecting, classifying, and studying the relationship between the cues representing human emotions. At UC San Diego, I also served as the Graduate Fellow Editor of the Prospect Journal of International Affairs and Graduate Student Member of the South Asia Initiative. Apart from writing articles on this and other platforms, my first book, Founding Generations: Democracy's Origins and Parallels in America and India, has been released recently. A long-term goal of my reading and writing is to understand the factors leading to the rise and fall of various human institutions like Nations, Religions, Companies, etc. My graduate research was awarded fellowships and research grants from various institutions including the National Science Foundation, Army Research Lab, Kavli Institute of Brain and Mind, and Chancellor's Research Excellence Scholarship. It was also published in many international conferences and reputed journals including IEEE Transactions and Nature Scientific Reports and has spawned multiple patent applications. Previously, I have undertaken research internships at the National University of Singapore, French National Center for Scientific Research (CNRS), Samsung Research America, and Facebook Reality Labs. Resume Curriculum Vitae Google Scholar Ph.D. Defense Presentation Ph.D. Thesis Testimonials",
  "content_length": 2042,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:15"
}