{
  "name": "Sidhanth Mohanty",
  "homepage": "https://sidhanthm.com",
  "status": "success",
  "content": "Sidhanth Mohanty Assistant Professor, Northwestern UniversityEmail: sidhanth (dot) mohanty (at) northwestern (dot) eduOffice: 3510 Mudd HallI am a mathematician/computer scientist, generally interested in theoretical computer science and probability theory. Most recently, I have been interested in mixing times of Markov chains, high-dimensional expansion, random matrix theory, and error-correcting codes.I am currently an Assistant Professor in the Computer Science department at Northwestern University.My academic journey began as an undergraduate at Carnegie Mellon University, where I was lucky to be advised by Ryan O’Donnell. My PhD education was in the Theory Group at UC Berkeley, under the amazing guidance of Prasad Raghavendra. I was later a postdoc in the Theory of Computation group at MIT, where I was hosted by Sam Hopkins.If you happen to encounter any of my work, feel free to reach out: questions and feedback are highly appreciated!Publications#Eigenvalue Bounds for Random Matrices via Zerofreeness [pdf]Sidhanth Mohanty, Amit Rajaraman  ManuscriptSparsifying Cayley Graphs on Every Group [pdf]Jun-Ting Hsieh, Daniel Z. Lee, Sidhanth Mohanty, Aaron Putterman, Rachel Yun Zhang  SODA 2026Explicit Lossless Vertex Expanders [pdf]Jun‑Ting Hsieh, Alexander Lubotzky, Sidhanth Mohanty, Assaf Reiner, Rachel Yun Zhang  FOCS 2025  Best Paper AwardExplicit Two‑Sided Vertex Expanders Beyond the Spectral Barrier [pdf]Jun‑Ting Hsieh, Ting‑Chun Lin, Sidhanth Mohanty, Ryan O’Donnell, Rachel Yun Zhang  STOC 2025  Invited to SICOMP Special Issue for STOC 2025Weak Poincaré Inequalities, Simulated Annealing, and Sampling from Spherical Spin Glasses [pdf]Brice Huang, Sidhanth Mohanty, Amit Rajaraman, David X. Wu  STOC 2025Locally Stationary Distributions: A Framework for Analyzing Slow‑Mixing Markov Chains [pdf]Kuikui Liu, Sidhanth Mohanty, Prasad Raghavendra, Amit Rajaraman, David X. Wu  FOCS 2024Fast Mixing in Sparse Random Ising Models [pdf]Kuikui Liu, Sidhanth Mohanty, Amit Rajaraman, David X. Wu  FOCS 2024Robust recovery for stochastic block models, simplified and generalized [pdf]Sidhanth Mohanty, Prasad Raghavendra, David X. Wu  STOC 2024Explicit two‑sided unique‑neighbor expanders [pdf]Jun‑Ting Hsieh, Theo McKenzie, Sidhanth Mohanty, Pedro Paredes  STOC 2024Small Even Covers, Locally Decodable Codes and Restricted Subgraphs of Edge‑Colored Kikuchi Graphs [pdf]Jun‑Ting Hsieh, Pravesh K. Kothari, Sidhanth Mohanty, David Munhá Correia, Benny Sudakov  International Mathematics Research Notices 2025Local and global expansion in random geometric graphs [pdf]Siqi Liu, Sidhanth Mohanty, Tselil Schramm, Elizabeth Yang  STOC 2023A simple and sharper proof of the hypergraph Moore bound [pdf]Jun‑Ting Hsieh, Pravesh K. Kothari, Sidhanth Mohanty  SODA 2023Testing thresholds for high‑dimensional sparse random geometric graphs [pdf]Siqi Liu, Sidhanth Mohanty, Tselil Schramm, Elizabeth Yang  STOC 2022  SIAM Journal on Computing 2024  SICOMP Special Issue for STOC 2022Many nodal domains in random regular graphs [pdf]Shirshendu Ganguly, Theo McKenzie, Sidhanth Mohanty, Nikhil Srivastava  Communications in Mathematical Physics 2023Certifying solution geometry in random CSPs: counts, clusters and balance [pdf]Jun‑Ting Hsieh, Sidhanth Mohanty, Jeff Xu  CCC 2022On statistical inference when fixed points of belief propagation are unstable [pdf]Siqi Liu, Sidhanth Mohanty, Prasad Raghavendra  FOCS 2021High‑girth near‑Ramanujan graphs with lossy vertex expansion [pdf]Theo McKenzie, Sidhanth Mohanty  ICALP 2021Local Statistics, Semidefinite Programming, and Community Detection [pdf]Jess Banks, Sidhanth Mohanty, Prasad Raghavendra  SODA 2021List Decodable Mean Estimation in Nearly Linear Time [pdf]Yeshwanth Cherapanamjeri, Sidhanth Mohanty, Morris Yau  FOCS 2020Lifting Sum‑of‑Squares Lower Bounds: Degree‑2 to Degree‑4 [pdf]Sidhanth Mohanty, Prasad Raghavendra, Jeff Xu  STOC 2020Explicit near‑Ramanujan graphs of every degree [pdf]Sidhanth Mohanty, Ryan O’Donnell, Pedro Paredes  STOC 2020  SIAM Journal on Computing 2021  SICOMP Special Issue for STOC 2020The SDP value for random two‑eigenvalue CSPs [pdf]Sidhanth Mohanty, Ryan O’Donnell, Pedro Paredes  STACS 2020Pseudo‑deterministic Streaming [pdf]Shafi Goldwasser, Ofer Grossman, Sidhanth Mohanty, David P. Woodruff  ITCS 2020High‑Dimensional Expanders from Expanders [pdf]Siqi Liu, Sidhanth Mohanty, Elizabeth Yang  ITCS 2020X‑Ramanujan graphs [pdf]Sidhanth Mohanty, Ryan O’Donnell  SODA 2020On Sketching the q to p norms [pdf]Aditya Krishnan, Sidhanth Mohanty, David P. Woodruff  APPROX 2018Algorithms for Noisy Broadcast with Erasures [pdf], [slides]Ofer Grossman, Bernhard Haeupler, Sidhanth Mohanty  ICALP 2018Other exposition#Local-to-global theorems for high-dimensional expansion [pdf]Teaching#CS 496: The Expansion Phenomenon in Computer Science",
  "content_length": 4843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:19"
}