{
  "name": "Sidharth Kumar",
  "homepage": "https://sidharthkumar.io",
  "status": "success",
  "content": "Sidharth's Home Page Sidharth Kumar Associate professor, Computer Science University of Illinois at Chicago sidharthkumar sidharthio Curriculum Vitae Google Scholar Email About me I am an associate professor at the Department of Computer science at UIC. My research lies at the intersection of high-performance computing (HPC) and Data visualization. More broadly, I work on problems in parallel I/O, big data processing, scalable algorithms, scientific visualiaztion, GPUs & performance modeling. I completed my Ph.D. in Computing at the SCI Institute at the University of Utah, advised by Valerio Pascucci. As an undergraduate at DAIICT, I was fascinated by computer graphics, ultimately leading me to join The University of Utah. While at the U, I spent a summer at Argonne National Lab, where I was exposed to the world of supercomputing. I was thrilled by the idea of using supercomputers to solve computationally massive problems. Ever since, I have worked at the intersection of HPC, analytics and visualization, helping domain scientists extract knowledge from massive amounts of complex data. Latest News October 2025: Paper Machine Learning Driven Auto-tuning for Non-uniform All-to-All Collectives accepted at HiPC 2025. October 2025: Paper Topology Assisted Clustering of Temporal fMRI Brain Networks With Use-Case in Mitigating Non-Neural Multi-Site Variability published at IEEE Access. August 2025: Paper Faster Annotation for Elevation-Guided Flood Extent Mapping by Consistency-Enhanced Active Learning accepted at IJCAI 2025. April 2025: Paper Parameterized Algorithms for Non-uniform All-to-all accepted at HPDC 2025. April 2025: Paper Multi-node Multi-GPU Datalog accepted at ICS 2025. April 2025: Paper Enabling Quick, Accurate Crowdsourced Annotation for Elevation-Aware Flood Extent Mapping received Honorable mention at Pacific Vis 2025. February 2025: Paper Enabling Quick, Accurate Crowdsourced Annotation for Elevation-Aware Flood Extent Mapping accepted at Pacific Vis 2025. February 2025: Paper Accelerating Web-Based Graph Layout Computation with Bottom-Up GPU Quadtree Construction accepted at Pacific Vis 2025. February 2025: Paper Column-oriented Datalog on the GPU accepted at AAAI 2025. October 2024: Paper Datalog with first-class facts accepted at VLDB 2025. October 2024: Paper Optimizing Datalog on the GPU accepted at ASPLOS 2025. August 2024: PhD candidate Ke Fan awarded the prestigious George Michael Fellowship, to be awarded at SC 2024. August 2024: Our research lab welcomes three new PhD students Kunting Qi, Jiaxin Lu and Charis Hulu. August 2024: Paper Interactive Isosurface Visualization in Memory Constrained Environments Using Deep Learning and Speculative Raycasting accepted at IEEE TVCG. July 2024: Paper TinyProf: Towards Continuous Performance Introspection through Scalable Parallel I/O presented at ISC 2024. July 2024: Paper Configurable algorithms for all-to-all collectives presented at ISC 2024. January 2024: Paper Bruck Algorithm Performance Analysis for Multi-GPU All-to-All Communication accepted at HPC Asia 2024. October 2023: Paper titled Speculative progressive raycasting for memory constrained isosurface visualization of massive volumes received the best paper award at LDAV 2023. October 2023: Served on the program committee (PC) of 38th IEEE International Parallel & Distributed Processing Symposium (IPDPS). November 2023: Poster Two-Phase IO Enabling Large-Scale Performance Introspection was the best poster award finalist at SC 2023. September 2023: Paper Communication-Avoiding Recursive Aggregation accepted at IEEE Cluster 2024. July 2023: Paper Towards iterated relational algebra on the GPU accepted at USENIX ATC 2023. October 2024: Paper Scalable, interactive and hierarchical visualization of virus taxonomic data accepted at workshop on Visual Analytics in Healthcare 2023. August 2023: Moved to Department of Computer science at University of Illinois at Chicago from University of Alabama at birmingham. June 2023: Paper titled The robustness of persistent homology of brain networks to data acquisition‐related non‐neural variability in resting state fMRI accepted at Human Brain Mapping (2023). July 2023: Served on the program committee (PC) of International Conference for High Performance Computing, Networking, Storage, and Analysis (SC 2023). Research Projects Data management at exascale The project aims to develop a scalable and extensible I/O runtime and tools for the next-generation adaptive data layouts that inherently imbibe compression and progressive data access, advancing the state of art in the field of high-performance data management. The work will lay the foundation for end-to-end data management solutions catering to the challenging needs of the simulation-analysis pipeline, accelerating science at exascale. ISC IPDPS ICPP HiPC MPI, Collectives Enabling effective data transfer among components, such as memory to CPU, between cores, and from CPU to GPU, is crucial for achieving optimal performance in exascale systems. MPI Collectives that require simultaneous data exchanges among all processes imposes additional strain on these systems. The project aims to tackle this challenge by developing novel algorithms to improve the performance of collective functions. As an example, we are exploring low-level application-agnostic algorithmic innovations to generalize the logarithmic time Bruck algorithm to support non-uniform all-to-all workloads. HPDC ISC HPDC HPC Asia EduHiPC GPU accelerated visualiaztion for the WEB The project aims to provide a software stack for interactive web-based scientific data visualization and analysis leveraging the computational capabilities of GPUs and data streaming. We are developing the building blocks necessary to advance analysis and visualization-specific applications, and also introduce necessary algorithmic innovations to overcome the limitations of constrained environments like web browsers. In particular, we are leveraging WebGPU to enable low-level control over the GPU. Pacific Vis TVCG LDAV EGPGV 2022 EGPGV 2018 Declarative analysis at Scale The project investigates full-stack implementation methodologies for expressive programming systems that effectively bridge the gap between human-level specification and high-performance implementation of complex reasoning tasks at scale. Declarative languages permit a programmer to provide high-level rules and declarations that define some sought-after solution as a latent implication to be materialized automatically by the computer. The project aims to scale this vision of high-performance declarative reasoning both to structured, higher-order, formulations and to next generation of supercomputers. AAAI VLDB ICS ISC USENIX HiPC CC Topology driven analytics The project aims to unify the study of mental illness across sites (and locations) by developing a topology driven analysis (TDA) cyberinfrastructure for weighted brain networks (FCNs). Topological data analysis (TDA) can extract the underlying shape (pattern) from a network, that can be used the then used in a statistical inferencing workflow to compare and classify brain networks effectively. The topology-based analysis and visualization framework will not only enable the study of fMRI data but will also make it possible to have a centralized curation of datasets. Pacific Vis IEEE Access Human brain mapping VAHC Awards Honorable Mention, Pacific Vis 2025 Enabling Fast and Accurate Crowdsourced Annotation for Elevation-Aware Flood Extent Mapping Best Research Paper Award, Winner, LDAV 2023 Speculative Progressive Raycasting for Memory Constrained Isosurface Visualization of Massive Volumes Best Research Poster, Finalist, SC 2023 Two-Phase IO Enabling Large-Scale Performance Introspection Best Research Poster Award (SRS), HiPC 2021 Parallel Implementations of Arithmetic Encoding on Shared Memory Systems Hans Meuer Best Research Paper Award, ISC 2020 Load-balancing Parallel Relational Algebra Best Research Paper Award, HiPC 2019 Distributed Relational Algebra at Scale Research grants NSF PPoSS large 2023-2028 A Full-stack Approach to Declarative Analytics at Scale Role: Principal Investigator, UIC, Share: $960,000 NSF EPSCoR RII Track4, 2022-2023 Relational Algebra on Heterogeneous Extreme-scale Systems. Role: Principal Investigator, UAB, Share: $264,755 NSF Software and Hardware Foundation Scalable and Extensible I/O Runtime and Tools for Next Generation Adaptive Data Layouts Role: Principal Investigator, UIC, Share: $300,165 NSF PPoSS Planning 2023-2028 A Full-stack Approach to Declarative Analytics at Scale Role: Principal Investigator, UIC, Share: $50,116 Directors Discretionary (DD) award, ANL, 2019-current Distributed Relational Algebra Role: Principal Investigator, UIC, 5+ million compute hours Current research team Ke Fan, PhD Candidate Ahmedur Rahman Shovon, PhD Student Kunting Qi, PhD Student Charis Hulu, PhD Student Jiaxin Lu, PhD Student Landon Dyken, PhD Student I am always looking for motivated undergraduate, masters, and doctoral students to work on research in high-performance computing (HPC) and data visualization. Feel free to email me! Selected Publications Machine Learning Driven Auto-tuning for Non-uniform All-to-All Collectives Kunting Qi, Ke Fan, Jens Domke, Seydou Ba, Venkatram Vishwanath, Michael Papka, Sidharth Kumar IEEE Conference On High Performance Computing, Data, and Analytics (HiPC 2025) Topology Assisted Clustering of Temporal fMRI Brain Networks With Use-Case in Mitigating Non-Neural Multi-Site Variability Ahmedur Rahman Shovon, Sidharth Kumar, Gopikrishna Deshpande IEEE Access Paper Faster Annotation for Elevation-Guided Flood Extent Mapping by Consistency-Enhanced Active Learning Saugat Adhikari, Da Yan, Tianyang Wang, Landon Dyken, Sidharth Kumar, Lyuheng Yuan, Akhlaque Ahmad, Jiao Han, Yang Zhou, Steve Petruzza International Joint Conference on Artificial Intelligence (IJCAI 2025) Parameterized Algorithms for N",
  "content_length": 20130,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:19"
}