{
  "name": "Sidney Karin",
  "homepage": "http://www.sdsc.edu/~skarin",
  "status": "success",
  "content": "Sid Karin Dr. Sidney Karin Professor Emeritus of Computer Science and EngineeringUniversity of California, San Diego 9500 Gilman Drive, MC 0505La Jolla, CA 92093-0505858-534-5064Fax: 858-534-5056 skarin@ucsd.edu Sidney Karin is Professor Emeritus of Computer Science and Engineering and Director Emeritus of the San Diego Supercomputer Center (SDSC) at the University of California, San Diego (UCSD). He was the Founding Director of SDSC, a national laboratory for computational science and engineering. In the early 1980s, Dr. Karin was one of the leaders in the creation of the Supercomputer Centers program of the National Science Foundation (NSF), This program eventually resulted in the establishment of SDSC and SDSCnet. Under Dr. Karins leadership SDCnet became Cerfnet, one of the original six ISPs, leading in turn to the establishment of NSFnet, a foundation of the present day internet. Dr. Karin grew SDSC from inception to a staff of 400+ and 65M$/year in revenue. In this role he foresaw the coming importance of ubiquitous telecommunications, data intensive computing and computational biology and set SDSC on a global leadership path in each of these technologies. Under Dr. Karins guidance SDSC took on leading roles in numerous other science and technology areas as well. Dr. Karin serves as a member of the Livermore National Security LLC and the Los Alamos National Security LLC Science and Technology Committees. Dr. Karin has served as a member or chair of numerous national policy boards and corporate advisory boards on computing and telecommunications. As a member of the Program Advisory Group for the Key Studies Development Project of the People's Republic of China, he helped to bring the Internet to the PRC. He has also served as an advisor and consultant on high performance computing to research universities and governmental bodies in several other countries including Australia, Canada, Switzerland, Sweden, Venezuela and the United Kingdom. Dr. Karin is a Fellow of the American Association for the Advancement of Science and a Fellow of the Association for Computing Machinery. Dr. Karin has held Distinguished Visiting Scientist positions at the Oak Ridge and Lawrence Livermore National Laboratories. Dr. Karin received Ph.D. and MSE degrees from the University of Michigan and a BME degree from the City College of New York. Dr. Karin holds DOE Q and DoD Top Secret clearances and he also holds FAA Airline Transport Pilot and Flight Instructor Certificates for Single and Multi-Engine aircraft and instruments. Dr. Karin is a registered Professional Engineer and is co-author, with Norris Parker Smith, of The Supercomputer Era, published by Harcourt Brace Jovanovich in 1987.",
  "content_length": 2720,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:21"
}