{
  "name": "Sihang Liu 0001",
  "homepage": "https://www.sihangliu.com",
  "status": "success",
  "content": "Sihang Liu's Homepage Sihang Liu I am an Assistant Professor in the School of Computer Science at the University of Waterloo. Prior to that, I was a visiting faculty at SystemsResearch@Google. I received my PhD degree from the University of Virginia, where I was advised by Dr. Samira Khan. My PhD research was generously supported by a Google Fellowship Award. My research interest lies broadly in computer architecture and systems. Email: <firstname><lastname>uwaterloo.ca Selected Publications * = equal contribution Disaggregated Speculative Decoding for Carbon-Efficient LLM Serving Tianyao Shi*, Yanran Wu*, Sihang Liu, Yi Ding IEEE Computer Architecture Letters (CAL), 2025 [PDF][Long arXiv version] HybridTier: an Adaptive and Lightweight CXL-Memory Tiering System Kevin Song, Jiacheng Yang, Zixuan Wang, Jishen Zhao, Sihang Liu, and Gennady Pekhimenko The ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2025 [PDF] Artifact Available, Artifact Functional, and Results Reproduced Compiler-Assisted Crash Consistency for PMEM Yun Joon Soh, Sihang Liu, Steven Swanson, and Jishen Zhao International Symposium on Memory Management (ISMM), 2025 [PDF] FreeRide: Harvesting Bubbles in Pipeline Parallelism Jiashu Zhang, Zihan Pan, Molly Xu, Khuzaima Daudjee, and Sihang Liu The ACM/IFIP International Middleware Conference (Middleware), 2025 [PDF] Artifact Available, Artifact Functional, and Results Reproduced EnsembleCI: Ensemble Learning for Carbon Intensity Forecasting Leyi Yan, Linda Wang, Sihang Liu, and Yi Ding The ACM International Conference on Future and Sustainable Energy Systems (e-Energy), 2025 [PDF][Source Code] Towards Sustainable Large Language Model Serving Sophia Nguyen*, Beihao Zhou*, Yi Ding, and Sihang Liu Workshop on Sustainable Computer Systems (HotCarbon), 2024 [PDF][Slides] Uncertainty-Aware Decarbonization for Datacenters Amy Li, Sihang Liu, and Yi Ding Workshop on Sustainable Computer Systems (HotCarbon), 2024 [PDF][Slides] A Cloud-Scale Characterization of Remote Procedure Calls Korakit Seemakhupt, Brent E. Stephens, Samira Khan, Sihang Liu, Hassan Wassel, Soheil Hassas Yeganeh, Alex C. Snoeren, Arvind Krishnamurthy, David E. Culler, and Henry M. Levy The ACM Symposium on Operating Systems Principles (SOSP), 2023 [PDF][Slides] Profiling Hyperscale Big Data Processing Abraham Gonzalez, Aasheesh Kolli, Samira Khan, Sihang Liu, Vidushi Dadu, Sagar Karandikar, Jichuan Chang, Krste Asanovic, and Parthasarathy Ranganathan The International Symposium on Computer Architecture (ISCA), 2023 [PDF][Source Code] Artifact Available, Artifact Functional, and Results Reproduced vPIM: Efficient Virtual Address Translation for Scalable Processing-in-Memory Architectures Amel Fatima, Sihang Liu, Korakit Seemakhupt, Rachata Ausavarungnirun, and Samira Khan The Design Automation Conference (DAC), 2023 [PDF] NearPM: A Near-Data Processing System for Storage-Class Applications Yasas Senevirathne, Korakit Seemakhupt, Sihang Liu, and Samira Khan The European Conference on Computer Systems (EuroSys), 2023 [PDF][Source Code (SW Part)][Source Code (HW Part)] Artifact Available and Artifact Functional Side-Channel Attacks on Optane Persistent Memory Sihang Liu, Suraaj Kanniwadi, Martin Schwarzl, Andreas Kogler, Daniel Gruss, and Samira Khan The USENIX Security Symposium (USENIX SEC), 2023 [PDF][Source Code][Slides] Artifact Available, Artifact Functional, and Results Reproduced Carbink: Fault-Tolerant Far Memory Yang Zhou, Hassan Wassel, Sihang Liu, Jiaqi Gao, James Mickens, Minlan Yu, Chris Kennelly, Paul Turner, David Culler, Hank Levy, and Amin Vahdat The USENIX Symposium on Operating Systems Design and Implementation (OSDI), 2022 [PDF] PMNet: In-network Data Persistence Korakit Seemakhupt, Sihang Liu, Yasas Senevirathne, Muhammad Shahbaz, and Samira Khan The International Symposium on Computer Architecture (ISCA), 2021 [PDF][Slides][Video][Source Code] PMFuzz: Test Case Generation for Persistent Memory Programs Sihang Liu*, Suyash Mahar*, Baishakhi Ray, and Samira Khan The International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2021 [PDF][summary slides][Source Code] Artifact Available, Artifact Functional, and Results Reproduced Cross-Failure Bug Detection in Persistent Memory Programs Sihang Liu, Korakit Seemakhupt, Yizhou Wei, Thomas Wenisch, Aasheesh Kolli, and Samira Khan The International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2020 [PDF][Talk][Slides][Source Code] Artifact Available and Artifact Functional, Featured at PIRL 2020 Janus: Optimizing Memory and Storage Support for Non-Volatile Memory Systems Sihang Liu, Korakit Seemakhupt, Gennady Pekhimenko, Aasheesh Kolli, and Samira Khan The International Symposium on Computer Architecture (ISCA), 2019 [PDF][Lightning Talk][Slides] 2019 MICRO Top Picks--Honorable Mention PMTest: A Fast and Flexible Testing Framework for Persistent Memory Programs Sihang Liu, Yizhou Wei, Jishen Zhao, Aasheesh Kolli, and Samira Khan The International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2019 [PDF][Lightning Talk][Slides][Source Code] NVMW Memorable Paper Award Finalist Crash Consistency in Encrypted Non-volatile Main Memory Systems Sihang Liu, Aasheesh Kolli, Jinglei Ren, and Samira Khan IEEE International Symposium on High Performance Computer Architecture (HPCA), 2018 [PDF][Lightning Talk][Slides] Other Publications * = equal contribution Long-Term Mentoring for Computer Science Researchers Emily Ruppel*, Sihang Liu*, Elba Garza, Sukyoung Ryu, Alexandra Silva, and Talia Ringer Communications of the ACM (CACM), 2023 [PDF] Efficient 2D Graph SLAM for Sparse Sensing Hanzhi Zhou, Zichao Hu, Sihang Liu, and Samira Khan The International Conference on Intelligent Robots and Systems (IROS), 2022 [PDF][Demo] Pavise: Integrating Fault Tolerance Support for Persistent Memory Applications Han Jie Qiu, Sihang Liu, Xinyang Song, Samira Khan, and Gennady Pekhimenko The International Symposium on Parallel Architectures and Compilation Techniques (PACT), 2022 [PDF][Source Code] Artifact Available, Artifact Functional, and Results Reproduced PIMProf: An Automated Program Profiler for Processing-in-Memory Offloading Decisions Yizhou Wei, Minxuan Zhou, Sihang Liu, Korakit Seemakhupt, Tajana Rosing, and Samira Khan The Design, Automation, and Test in Europe Conference (DATE), 2022 [PDF][Source Code] Write Prediction for Persistent Memory Systems Suyash Mahar, Sihang Liu, Korakit Seemakhupt, Vinson Young, and Samira Khan The International Symposium on Parallel Architectures and Compilation Techniques (PACT), 2021 [PDF][Slides][Video][Source Code] Artifact Available, Artifact Reusable, and Results Reproduced MultiPIM: A Detailed and Configurable Multi-Stack Processing-In-Memory Simulator Chao Yu, Sihang Liu, and Samira Khan Computer Architecture Letters (CAL), 2021 [PDF][Source Code] Side Channel Attacks in Computation Offloading Systems with GPU Virtualization Sihang Liu, Yizhou Wei, Jianfeng Chi, Faysal Hossain Shezan, and Yuan Tian IEEE Workshop on the Internet of Safe Things (SafeThings), held in association with IEEE Symposium on Security and Privacy (Oakland), 2019 [PDF][Slides] ARMOR: Towards Restricted Approximation with A Worst-Case Guarantee Sihang Liu, Kevin Angstadt, Mike Ferdman, and Samira Khan Workshop on Approximate Computing Across the Stack (WAX), held in association with the International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2018 [PDF][Slides] Deconstructing the Tail at Scale Effect Across Network Protocols Akshitha Sriraman, Sihang Liu, Sinan Gunbay, Shan Su, and Thomas F. Wenisch Workshop on Duplicating, Deconstructing, and Debunking (WDDD) held in association with the International Symposium on Computer Architecture (ISCA), 2016 [PDF] Delegated Persist Ordering Aasheesh Kolli, Jeff Rosen, Stephan Diestelhorst, Ali Saidi, Steven Pelley, Sihang Liu, Peter M. Chen, and Thomas F. Wenisch Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), 2016 [PDF] Invited Talks Towards Sustainable AI Systems At the 2024 Sustainable Data Systems for Data Science Workshop (DSDS) in Toronto, ON. Towards Sustainable Large Language Model Serving At the 2024 Workshop on Sustainable Computer Systems (HotCarbon) in Santa Cruz, CA. [Slides] Toward Failure Recoverable and Secured Persistent Memory Systems At the 2022 IEEE Data & Storage Symposium, Virtual. [Slides] PMFuzz: Test Case Generation for Persistent Memory Programs At the 2021 International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), Virtual Conference. [Slides] Cross-Failure Bug Detection in Persistent Memory Programs At the 2020 International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), Virtual Conference. [Slides] Janus: Optimizing Memory and Storage Support for Non-Volatile Memory Systems At the 2019 International Symposium on Computer Architecture (ISCA) in Phoenix, AZ. [Slides] Side Channel Attacks in Computation Offloading Systems with GPU Virtualization At the 2019 IEEE Workshop on the Internet of Safe Things (SafeThings), held in association with IEEE Symposium on Security and Privacy (Oakland) in San Francisco, CA. [Slides] PMTest: A Fast and Flexible Testing Framework for Persistent Memory Programs At the 2019 International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS) in Providence, RI. [Slides] ARMOR: Towards Restricted Approximation with A Worst-Case Guarantee At the 2018 Workshop on Approximate Computing Across the Stack (WAX), held in association with the International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS) in Williamsburg, VA. [Slides] Crash Consis",
  "content_length": 12695,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:22"
}