{
  "name": "Sijia Geng",
  "homepage": "https://pensa.engineering.jhu.edu",
  "status": "success",
  "content": "Home - Sijia Geng — PENSA Dr. Sijia Geng Assistant Professor, Department of Electrical and Computer Engineering, Johns Hopkins University Email: sgeng@jhu.edu Location: Barton Hall 207 FollowFollow Announcement: I’m seeking self-motivated students at all levels who are passionate about research and have strong mathematical skills to join my group. Click HERE for more information. I am an Assistant Professor in the Department of Electrical and Computer Engineering (ECE) at Johns Hopkins University and a Core Faculty with the Ralph O’Connor Sustainable Energy Institute (ROSEI). At Johns Hopkins, I am affiliated with the Department of Applied Mathematics & Statistics (AMS), the Department of Computer Science (CS), and the Mathematical Institute for Data Science (MINDS). I direct the Power and Energy Network Systems Analysis (PENSA) Laboratory and am co-PI of the Electric Power Innovation for a Carbon-free Society (EPICS) Center. My research integrates methodologies from system and control theory, mathematical analysis, and optimization to address pressing and fundamental challenges in complex networked energy systems. I develop theory and computational tools to enable the renewable energy transition and achieve autonomous, resilient, and sustainable next-generation energy systems. My research areas include: Dynamic analysis and stability of inverter-based power systems. Control theory and system theory. Nonlinear and hybrid dynamical systems. Data-driven and geometric methods. Electrified transportation and multi-energy systems. I completed my Ph.D. in Electrical & Computer Engineering from the University of Michigan-Ann Arbor in January 2022, advised by Prof. Ian A. Hiskens, and obtained two M.S. degrees in Mathematics and Electrical & Computer Engineering from the same university, both in 2021. In 2022, I worked as a Postdoctoral Associate at the MIT Laboratory for Information and Decision Systems (LIDS), collaborating with Dr. Audun Botterud. In Summer 2018, I interned at the Pacific Northwest National Laboratory (PNNL). In Summer 2024, I was a research member with the Institute for Mathematical and Statistical Innovation (IMSI) at the University of Chicago. I am the recipient of the Best Paper Award for the 2022 MIT/Harvard Applied Energy Symposium (MIT, Aug 2022, one of the top 6 out of 150 contributions), Rising Stars in EECS (MIT, Aug 2021), Barbour Scholarship (Umich, Mar 2021, among the oldest and most prestigious awards at Umich), Honorable Mention of Richard F. and Eleanor A. Towner Prize for Outstanding Ph.D. Research (Umich, Feb 2021), Finalist of Marian Sarah Parker Prize-Graduate (Umich, Feb 2021), Richard F. and Eleanor A. Towner Prize for Distinguished Academic Achievement (Umich, Feb 2018), and Gerald and Esther Forrest Graduate Student Fellowship (Umich, Sep 2016). Latest News 2023.10.03 – Two preprints are online. Oct 3, 2023The first one is on \"An integer clustering approach for modeling large-scale EV fleets with guaranteed performance\": https://arxiv.org/abs/2310.02208. The second one is on \"Approximating voltage stability boundary under high variability of renewables using... read more 2023.05.03 – Presentation to JHU ECE External Advisory Committee May 3, 2023I presented my research on \"Scalable methods for power systems with high-penetration of renewable energy\" to the JHU ECE External Advisory Committee. read more 2023.04.21 – Joint U.S.-European NSF Workshop Apr 21, 2023I'm excited to attend the Joint U.S.-European NSF Workshop in Philadelphia and engage in the discussion on \"Flexible electric grid critical infrastructure for resilient society\". read more MEDIA hIGHLIGHTS JHU LEADS a New $18M NSF Global Center Our ROSEI Grid team has been funded for five years by NSF and has launched the EPICS Global Center. EPICS brings together experts from academia and industry in the United States, the United Kingdom, and Australia and is dedicated to driving the transition of society towards 100% renewable energy for power grids. Learn More  Barbour Scholarship Sijia Geng receives Barbour Scholarship to further her research in renewable energy systems. Learn More g ROSEI Hosts G-PST Workshop In DC The G-PST Grid-Forming (GFM) Technology Implementation Council convened to identify and implement GFM demonstration projects in gigawatt-scale grids. The meeting included eight GFM demonstration presentations and discussion on GFM codification and standardization. Learn More ROSEI RESEARCHER Q&A Sijia Geng shares her academic journey in sustainability and renewable energy. Learn More",
  "content_length": 4575,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:25"
}