{
  "name": "Sijie Niu",
  "homepage": "https://sjniu.github.io/index-en.html",
  "status": "success",
  "content": "Sijie homepage @UJN About me News Research Members Collaborators 个人主页（中文版） East Lansing, MI Google Scholar Github ResearchGate ORCID Resume sjniu at hotmail dot com 0531-82767569 Sijie Niu Associate Professor Computational Intelligence Lab School of Information Science and Engineering, University of Jinan No. 336, West Road of Nan Xinzhuang, 250022, Jinan, China About me Hi! I am an associate professor in School of Infromation Science and Engineering at University of Jinan, and a member of CI2P LAB. I did a post-doc with Dinggang Shen in the IDEA LAB at the UNC. I completed my BS and PhD in 2007 and 2016, respectively, where I was advised by Prof. Qiang Chen. I am primarily interested in techniques for learning visual recognition models with less or no human supervision, such as weakly supervised learning, semi-supervised learning, webly supervised learning, transfer learning, and domain adaptation. My current research interests also include metric learning and its applications, visual recognition in extreme conditions, and medical image analysis. News [2020/09/17]   Welcome 6 students to join my team. [2020/08/25]   On paper is accepted by Information Fusion. [2020/04/28]   On paper is accepted by IEEE Journal of Biomedical and Health Informatics. [2020/01/02]   One paper is accepted by IEEE Geoscience and Remote Sensing Letters. Research Deep ensemble neural-like P systems for segmentation of central serous chorioretinopathy lesion Jie Xue, Zhuo Wang, Deting Kong, Yuan Wang, Xiyu Liu, Wen Fan, Songtao Yuan, Sijie Niu*, Dengwang Li Information Fusion, 65:84-94, January 2021. [PDF] Fast High-Order Sparse Subspace Clustering With Cumulative MRF for Hyperspectral Images Limei Wang, Sijie Niu*, Xizhan Gao, Kun Liu, Feixia Lu, Qi Diao, Jiwen Dong IEEE Geoscience and Remote Sensing Letters, 1-5,30 Jan 2020. [PDF] Adaptive-guided-coupling-probability Level Set for Retinal Layer Segmentation Yue Sun, Sijie Niu*, Xizhan Gao, Jie Su, Jiwen Dong, Yuehui Chen, Li Wang IEEE Journal of Biomedical and Health Informatics, March 27 2020 doi: 10.1109/JBHI.2020.298156. [PDF] Robust noise region-based active contour model via local similarity factor for image segmentation Sijie Niu, Qiang Chen*, Luis de Sisternes, Zexuan Ji, Zeming Zhou, Daniel L. Rubin Pattern Recognition, 61: 104–119, 2017. [PDF] more Members MS Students Xiaohui Li（2020） Wenyue Yu（2020） Xueying Zhou (2020，co-advised with Prof. Jiwen Dong) Tianhao Han (2020，co-advised with Prof. Jiwen Dong) Shenyuan Li (2020，co-advised with Prof. Jiwen Dong) Xiangyu Liu (2020，co-advised with Prof. Jiwen Dong) Bingfu Li（2019） Wenyang Kong（2019） Yingying Han (2019，co-advised with Prof. Jiwen Dong) Junting Chen (2019，co-advised with Prof. Jiwen Dong) Limei Wang（2018） Yue Sun（2018） Ruiwen Xing (2018，co-advised with Prof. Yuehui Chen) Undergraduate Students Tieqiao Wang (BS 2020, Now CANDIDATE PhD at Oregon State University) Haochen Yang (BS 2020, Now MASTER at ShanghaiTech University, 上海科技大学) Wei Tian (BS 2020, Now MASTER at www.hitwh.edu.cn Harbin Institute of Technology, 哈尔滨工业大学（威海）) Yitong Liu (BS 2020, Now MASTER at Jilin University, 吉林大学 ) Haohao Wang (BS 2020, Now at 今日头条) Alumni Xiaofeng Qu (MS 2019, Now CANDIDATE PhD at Shandong Normal University, 山东师范大学) Rongbin Xu (MS 2019, Now at 山东航空股份有限公司) Weifang Wang (MS 2019, now at Samsung) Collaborators Qiang Chen (Nanjing Uiversity of Science and Engineering) Daniel Rubin (Stanford University ) Dinggang Shen Li Wang",
  "content_length": 3459,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:22"
}