{
  "name": "Silas Richelson",
  "homepage": "https://www.cs.ucr.edu/~silas",
  "status": "success",
  "content": "Silas Richelson Silas Richelson About Me: I am an Assistant Professor in the CSE Department at UC Riverside. My research interests are in Cryptography, Computer Security and Complexity Theory. I got my Ph. D. in 2014 from UCLA under the supervision of Rafail Ostrovsky. From 2015 to 2017 I was a postdoctoral researcher with a joint appointment at the MIT CSAIL and BU Computer Science departments, working with Vinod Vaikuntanathan and Ran Canetti. Email: my_first_name@cs.ucr.edu Office: WCH 331 Selected Publications: Analyzing Ta-Shma's Code via the Expander Mixing Lemma with Sourya Roy; IEEE Transactions on Information Theory 2024. A High Dimensional Goldreich-Levin Theorem with Parker Newton, Chase Wilson; STOC'23. A Lower Bound for Proving Hardness of LWR with Polynomial Modulus with Parker Newton; CRYPTO'23. Gilbert and Varshamov Meet Johnson: List-Decoding Nearly-Optimal Binary Codes with Sourya Roy; FOCS'23. Haiku: Efficient Authenticated Key Agreement with Strong Security Guarantees for IoT with Abdulrahman Bin Rabiah, K.K. Ramakrishnan, Ahmad Bin Rabiah, Elizabeth Liri, Koushik Kar; ICDCN'21. MSS: Lightweight network authentication for resource constrained devices via Mergeable Stateful Signatures. with Abdulrahman Bin Rabiah, Yugarshi Shashwat, Fatemah Alharbi, Nael B. Abu-Ghazaleh; ICDCS'21. CSProp: Ciphertext and Signature Propagation: Low-Overhead Cryptosystems for IoT with Fatemah Alharbi, Arwa Alrawais, Abdulrahman Bin Rabiah, Nael B. Abu-Ghazaleh; USENIX'21. Locally Testable Non-Malleable Codes with Sourya Roy; preprint. Non-Malleable Commitments Using Goldreich-Levin List Decoding with Vipul Goyal; FOCS'19. How to Subvert Backdoored Encryption with Thibaut Horel, Sunoo Park, Vinod Vaikuntanathan; ITCS'19. Towards Doubly Efficient Private Information Retrieval with Ran Canetti, Justin Holmgren; TCC'17. Textbook Non-Malleable Commitments with Vipul Goyal, Omkant Pandey; STOC'16. On the Hardness of Learning with Rounding in Small Modulus with Andrej Bogdanov, Siyao Guo, Daniel Masny, Alon Rosen; TCC'16a. Adaptive Security with Quasi-Optimal Rate with Brett Hemenway, Rafail Ostrovsky, Alon Rosen; TCC'16a. Fast Non-Malleable Commitments with Hai Brenner, Vipul Goyal, Alon Rosen, Margarita Vald; CCS'15. Round-Optimal Black-Box Two-Party Computation with Rafail Ostrovsky, Alessandra Scafuro; CRYPTO'15. Topology-Hiding Computation with Tal Moran, Ilan Orlov; TCC'15. An Algebraic Approach to Non-Malleability with Vipul Goyal, Alon Rosen, Margarita Vald; FOCS'14. Concurrent Zero-Knowledge in the Bounded Player Model with Vipul Goyal, Abhishek Jain, Rafail Ostrovsky, Ivan Visconti; TCC'13.",
  "content_length": 2639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:24"
}