{
  "name": "Silja Renooij",
  "homepage": "http://www.staff.science.uu.nl/~renoo101",
  "status": "success",
  "content": "Homepage for Silja Renooij Personal Silja Renooij Homepage Contact Research • Publications • Presentations Projects Education • Teaching • Training Service Record Awards Links IS-group; ICS department; Faculty of Science; Universiteit Utrecht \"There are 10 types of people: those who understand binary, and those who do not.\" More (mostly in Dutch) personal stuff Why CS? Welcome! Welcome to my work-related website. These pages give an impression of me as a computer scientist, researcher and teacher. Current position I'm an Associate professor in the Department of Information and Computing Sciences, Faculty of Science, at the Universiteit Utrecht (The Netherlands). I am a member of the Intelligent Systems Group; until September 1 2019, I was a member of the former Decision Support Systems Group, headed by Linda van der Gaag. Former positions Former positions I held, at the same Department: March 2015 - September 2023: Lecturer/Assistant professor (Universitair Docent 1; UD 1 profile) January 2006 - February 2015: Lecturer/Assistant professor, level 2 (Universitair Docent 2; UD 2 profile) January 2001 - December 2005: Postdoc January 1997 - December 2000: PhD Student This website On these pages you can find information about: my research interests, publications and presentations; my involvement in various projects what I teach and have been taught; my academic service record; other ingredients from my CV, such as some tokens of appreciation; Interviews: - on AI: Fontys Hogeschool v. Journalistiek, 2017 - COSC brochure - U(U) en de media - on Bayesian networks in medical diagnosis: UN, 2001; RTV-Utrecht, Kijk op 9 You can navigate through these pages using the menu at the top. Those who are curious can also find out more about me personally, and about what got me into this field (both in Dutch). Enjoy! Adapted design by www.mitchinson.net | This work is licensed under a Creative Commons Attribution 3.0 License",
  "content_length": 1938,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:28"
}