{
  "name": "Silvio Amir",
  "homepage": "https://www.khoury.northeastern.edu/people/silvio-amir",
  "status": "success",
  "content": "Silvio Amir - Khoury College of Computer Sciences All People Silvio Amir (he/him/his) Assistant Professor Research interests Research interests Natural language processing Machine learning Information retrieval Social media analysis Education Education Postdoctoral Fellow, Center for Language and Speech Processing, Johns Hopkins University PhD in Information Systems and Computer Engineering, Instituto Superior Tecnico, Universidade de Lisboa — Portugal MS in Computer Science and Engineering, Faculdade de Ciencias da Universidade de Lisboa — Portugal Biography Biography Silvio Amir is an assistant professor in the Khoury College of Computer Sciences at Northeastern University, based in Boston. He is a core faculty member in Northeastern's Institute for Experiential AI and the NULab for Texts, Maps, and Networks. Amir's research develops natural language processing, machine learning, and information retrieval methods for personal and user-generated text, such as social media and clinical notes from electronic health records. He is primarily interested in methods for tasks involving subjective, personalized or user-level inferences (e.g. opinion mining and digital phenotyping). Through his work, Amir aims to improve the reliability, interpretability, and fairness of predictive models and analytics derived from personal and user-generated data — all part of efforts to develop human-centered AI for social good. To achieve these goals, he collaborates with domain experts on multidisciplinary projects to address real-world problems in the social sciences, medicine, and epidemiology. After completing his doctorate at the University of Lisbon — conducting part of his research as a visiting researcher at the University of Texas at Austin and at Northeastern University — Amir moved to John Hopkins University, where he researched at the Center for Language and Speech Processing and served as a lecturer at the Whiting School of Engineering. Recent publications Recent publications Published: August 1, 2024 Open (Clinical) LLMs are Sensitive to Instruction Phrasings Citation: Alberto Mario Ceballos-Arroyo, Monica Munnangi, Jiuding Sun, Karen Y. C. Zhang, Denis Jered McInerney, Byron C. Wallace, Silvio Amir. (2024). Open (Clinical) LLMs are Sensitive to Instruction Phrasings BioNLP@ACL, 50-71. https://aclanthology.org/2024.bionlp-1.5 Published: June 20, 2024 Investigating Mysteries of CoT-Augmented Distillation Citation: Somin Wadhwa, Silvio Amir, Byron C. Wallace. (2024). Investigating Mysteries of CoT-Augmented Distillation CoRR, abs/2406.14511. https://doi.org/10.48550/arXiv.2406.14511 Published: March 29, 2024 On-the-fly Definition Augmentation of LLMs for Biomedical NER Citation: Monica Munnangi, Sergey Feldman, Byron C. Wallace, Silvio Amir, Tom Hope, Aakanksha Naik. (2024). On-the-fly Definition Augmentation of LLMs for Biomedical NER CoRR, abs/2404.00152. https://doi.org/10.48550/arXiv.2404.00152 Published: July 1, 2023 SemEval-2023 Task 8: Causal Medical Claim Identification and Related PIO Frame Extraction from Social Media Posts Citation: Vivek Khetan, Somin Wadhwa, Byron C. Wallace, Silvio Amir. (2023). SemEval-2023 Task 8: Causal Medical Claim Identification and Related PIO Frame Extraction from Social Media Posts SemEval@ACL, 2266-2274. https://aclanthology.org/2023.semeval-1.311 Published: June 2, 2023 An Example of (Too Much) Hyper-Parameter Tuning In Suicide Ideation Detection Citation: Annika Marie Schoene, John E. Ortega, Silvio Amir, Kenneth Church . (2023). An Example of (Too Much) Hyper-Parameter Tuning In Suicide Ideation Detection ICWSM, 1158-1162. https://doi.org/10.1609/icwsm.v17i1.22227 Published: May 8, 2023 Revisiting Relation Extraction in the era of Large Language Models Citation: Somin Wadhwa, Silvio Amir, Byron C. Wallace. (2023). Revisiting Relation Extraction in the era of Large Language Models CoRR, abs/2305.05003. https://doi.org/10.48550/arXiv.2305.05003 Published: May 5, 2023 Jointly Extracting Interventions, Outcomes, and Findings from RCT Reports with LLMs Citation: Somin Wadhwa, Jay DeYoung, Benjamin E. Nye, Silvio Amir, Byron C. Wallace. (2023). Jointly Extracting Interventions, Outcomes, and Findings from RCT Reports with LLMs CoRR, abs/2305.03642. https://doi.org/10.48550/arXiv.2305.03642 Published: October 12, 2022 RedHOT: A Corpus of Annotated Medical Questions, Experiences, and Claims on Social Media Citation: Somin Wadhwa, Vivek Khetan, Silvio Amir, Byron C. Wallace. (2022). RedHOT: A Corpus of Annotated Medical Questions, Experiences, and Claims on Social Media CoRR, abs/2210.06331. https://doi.org/10.48550/arXiv.2210.06331 Published: August 16, 2022 UserNLP’22: 2022 International Workshop on User-centered Natural Language Processing Citation: Xiaolei Huang , Lucie Flek, Franck Dernoncourt, Charles Welch, Silvio Amir, Ramit Sawhney, Diyi Yang. (2022). UserNLP'22: 2022 International Workshop on User-centered Natural Language Processing WWW (Companion Volume), 1176-1177. https://doi.org/10.1145/3487553.3524879 Published: June 6, 2021 On the Impact of Random Seeds on the Fairness of Clinical Classifiers Citation: Silvio Amir, Jan-Willem van de Meent, Byron C. Wallace. (2021). On the Impact of Random Seeds on the Fairness of Clinical Classifiers NAACL-HLT, 3808-3823. https://doi.org/10.18653/v1/2021.naacl-main.299 Published: April 22, 2021 Demographic Representation and Collective Storytelling in the Me Too Twitter Hashtag Activism Movement Citation: Aaron Mueller, Zach Wood-Doughty, Silvio Amir, Mark Dredze, Alicia Lynn Nobles. (2021). Demographic Representation and Collective Storytelling in the Me Too Twitter Hashtag Activism Movement Proc. ACM Hum. Comput. Interact., 5, 107:1-107:28. https://doi.org/10.1145/3449181 Individual Details Tenured/Tenure-Track Faculty Campus Boston Google Scholar See Citations Areas of Interest Artificial Intelligence Natural Language Processing Contact s.amir@northeastern.edu Current PhD students Hiba Ahsan PhD Student Read bio Locations Close this dialog window Boston Monica Munnangi PhD Student Read bio Locations Close this dialog window Boston Somin Wadhwa PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 6199,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:30"
}