{
  "name": "Silvia R. Vergilio",
  "homepage": "https://www.inf.ufpr.br/silvia",
  "status": "success",
  "content": "GrES - UFPR Home Projects and Collaborations Teaching Documentation Contact us Short bio Silvia Regina Vergilio DInf-UFPRCV CNPq dblp Silvia Regina Vergilio received Master and Doctoral degress from University of Campinas (UNICAMP), Brazil. She is currently a professor of Software Engineering in the Computer Science Department of Federal University of Paraná (UFPR), Brasil, where she leads the Research Group on Software Engineering. She has involved in several projects and her research is mainly supported by CNPq (PQ Level 1D). Her research interests include software testing, software reliability, Software Product Lines (SPLs) and Search-based Software Engineering (SBSE). She serves as assistant editor of the Journal of Software Engineering: Research and Development, and acts as peer reviewer for diverse international journals. She serves on the Program Committe of diverse software engineering conferences. Editorial Boards Assistant editor of the Journal of Software Engineering: Research and Development Publications 2024 ROZA, E. A.; LIMA, J. A. P.; VERGILIO, S. R. On the use of contextual information for machine learning based test case prioritization in continuous integration development. INFORMATION AND SOFTWARE TECHNOLOGY, v. 171, p. 107-444, 2024. MENDONÇA, W. F.; ASSUNCAO, W. K. G.; VERGILIO, S. R. Feature-oriented test case selection and prioritization during the evolution of highly-configurable systems. JOURNAL OF SYSTEMS AND SOFTWARE, Volume 217, November 2024. Silva, R. de C.; Farah, P. R.; Vergilio, S. R. On the use of Change History Data to Enhance Class Change-Proneness Prediction Models. Journal of the Brazilian Computer Society, 30(1), 421--443. https://doi.org/10.5753/jbcs.2024.3782 FREIRE, W. M.; BOCCARDO, M.; NOUCHI, D.; AMARAL, A. M. M. M.; VERGILIO, S. R.; FERREIRA, T. N.; Colanzi, T.E. Large Language Model-based suggestion of objective functions for search-based Product Line Architecture design. In: XVIII Simpósio Brasileiro de Componentes, Arquiteturas e Reutilizacao de Software, 2024, Curitiba. v. 1. p. 21-30. FREIRE, W. M.; BOCCARDO, M.; NOUCHI, D.; AMARAL, A. M. M. M.; VERGILIO, S. R.; FERREIRA, T. N.; Colanzi, T.E. AIssistDM: A Plugin to Assist Non-specialist Decision-Makers in Search-Based Software Engineering Tools. In: Simpósio Brasileiro de Engenharia de Software, 2024, Curitiba. v. 1. p. 725-731. MENDONÇA, W. F.; ASSUNCAO, W. K. G.; VERGILIO, S. R. Feature-oriented Test Case Prioritization Strategies: An Evaluation for Highly Configurable Systems. In: SPLC '24: 28th ACM International Systems and Software Product Line Conference, 2024, Dommeldange Luxembourg. v. 1. p. 72-83. 2023 LIMA, J. A. P.; VERGILIO, S. R. An Evaluation of Ranking-to-Learn Approaches for Test Case Prioritization in Continuous Integration. Journal of Software Engineering Research and Development, 11(1), 4:1-20. 2023 BIBIANO, A.C.; UCHOA, A.; ASSUNCAO, W.K.G.; TENORIO, D.; COLANZI, T.E.; VERGILIO, S.R.; GARCIA, A. Composite refactoring: Representations, characteristics and effects on software projects, Information and Software Technology, Volume 156, pg 107-134, April 2023, FARAH, P.; VERGILIO, S.R. PerfoRT: A Tool for Software Performance Regression. ICPE'23: ACM/SPEC International Conference on Performance Engineering, ACM, New York. OLIVEIRA, B.G.; ENDO, A.T.; VERGILIO, S.R. Characterizing Security-related Commits of JavaScript Engines. International Conference on Enterprise Information Systems (ICEIS), 2023, Prague MENDONÇA, W. F.; ASSUNCAO, W. K. G.; VERGILIO, S. R. Feature-oriented Test Case Selection during Evolution of Highly-Configurable Systems. Software Product Line Conference 2023 (SPLC), Tokyo. ACM, New York. pg 76-86. August/September 2023. SILVA, H. N.; ENDO, A.; VERGILIO, S. R. Accessibility Mutation Testing of Android Applications. XXXVII Brazilian Symposium on Software Engineering (SBES) - Journal First Track. September, 2023. FARAH, P.R.; SILVA, R.C.; VERGILIO, S.R. An Assessment of Machine Learning Algorithms and Models for Prediction of Change-Prone Java Methods. In: Proceedings of the XXXVII Brazilian Symposium on Software Engineering (SBES). New York: ACM, September 2023 Colanzi, T.E. ; MASSAGO, M. ; VERGILIO, S. R. Optimizing Product-Line Architectures with MOA4PLA. In: OliveiraJr, Edson. (Org.). UML-Based Software Product Line Engineering with SMarty. 1ed.Cham: Springer International Publishing, 2023, v. 1, p. 241-263. ASSUNCAO, W. K. G. ; Vergilio, S. R. ; LOPEZ-HERREJON, R. E. Reengineering UML Class Diagram Variants into a Product Line Architecture. In: Edson OliveiraJr. (Org.). UML-Based Software Product Line Engineering with SMarty. 1ed.Cham: Springer International Publishing, 2023, v. 1, p. 393-414. 2022 MARIANI, T.; VERGILIO, S. R.; KESSENTINE, M. Generation of refactoring algorithms by grammatical evolution. EMPIRICAL SOFTWARE ENGINEERING, 2022. SILVA, H. N.; ENDO, A.; VERGILIO, S. R. Accessibility Mutation Testing of Android Applications. JOURNAL OF SOFTWARE ENGINEERING RESEARCH AND DEVELOPMENT, 2022. LIMA, J. A. P.; MENDONÇA, WILLIAN D. F.; ASSUNCAO, W. K. G.; VERGILIO, S. R. Cost-effective learning-based strategies for test case prioritization in Continuous Integration of Highly-Configurable Software. EMPIRICAL SOFTWARE ENGINEERING, 2022. FERREIRA, T. N.; VERGILIO, S. R.; KESSENTINI, M. Variability Testing of Software Product Line: A Preference-based Dimensionality Reduction Approach. Infromation and Software Technology, (2022) ROZA,E. A.; LIMA, J. A. P.; SILVA, R. C.; VERGILIO, S. R.. Machine Learning Regression Techniques for Test Case Prioritization in Continuous Integration Environment. IEEE International Conference on Software Analysis, Evolution and Reengineering, SANER 2022. MENDONÇA, W. F.; MICHELON, G.K.; VERGILIO, S. R.; ASSUNCAO, W. K. G.; EGYED, A. (2022) Test2Feature: Feature-based Test Traceability Tool for Highly Configurable Software, SPLC2022. (A2) MENDONÇA, W. F.; ASSUNCAO, W. K. G.; VERGILIO, S. R. Software Product Line Regression Testing: a Research Roadmap. International Conference on Enterprise Information Systems (ICEIS), 2022, Prague. SILVA, R.C.; FARAH, P.R.; VERGILIO, S.R. Machine Learning for Change-Prone Class Prediction: A History-Based Approach. In: Proceedings of the XXXVI Brazilian Symposium on Software Engineering (SBES). New York: ACM, 2022. v.1. p.289-298 ASSUNCAO, W. K. G.; Vergilio, S. R.; LOPEZ-HERREJON, R. E.; LINSBAUER, L. Search-Based Variability Model Synthesis from Variant Configurations. In: Lopez-Herrejon,R.E.; Martinez, J.; Guez Assuncao, W.K.; Ziadi, T.; Acher, M.; Vergilio, S. (Org.) Handbook of Re-Engineering Software Intensive Systems into Software Product Lines. 1ed.Cham: Springer, 2022, v. 1, p. 115-141. ASSUNCAO, W. K. G.; Vergilio, S. R.; LOPEZ-HERREJON, R. E. ModelVars2SPL: From UML Class Diagram Variants to Software Product Line Core Assets. In: Lopez-Herrejon, R.E.; Martinez, J.; Guez Assuncao, W.K.; Ziadi, T.; Acher, M.; Vergilio, S. (Org.) Handbook of Re-Engineering Software Intensive Systems into Software Product Lines. 1ed.Cham: Springer International Publishing, 2022, v. 1, p. 221-250. 2021 GUIZZO, G.; MARIANI, T.; VERGILIO, S. R.; POZO, A. An Approach for the Generation of Multi-Objective Algorithms Applied to the Integration and Test Order Problem. JOURNAL OF SOFTWARE ENGINEERING RESEARCH AND DEVELOPMENT. 2021. FERREIRA, T. N.; VERGILIO, S. R.; KESSENTINE, M. Nautilus: An Interactive Plug and Play Search Based Software Engineering Framework. IEEE SOFTWARE. 2021. SILVA, HENRIQUE NEVES; PRADO LIMA, JACKSON; Vergilio, Silvia Regina; ENDO, ANDRE TAKESHI A mapping study on mutation testing for mobile applications. SOFTWARE TESTING VERIFICATION & RELIABILITY. UCHOA, A; BARBOSA, C; COUTINHO, D.; OIZUMI, W.; ASSUNÇÃO, W.K.G.; VERGILIO, S.R.; PEREIRA, J.A.; OLIVEIRA, A.; GARCIA, A.; Predicting Design Impactful Changes in Modern Code Review: A Large-Scale Empirical Study. Mining Software Repositories (MSR) 2021 conference. CAMARA, B.H.P.; SILVA, M.A.G.; ENDO, A.T.; VERGILIO, S.R. What is the Vocabulary of Flaky Tests? An Extended Replication. 29th IEEE/ACM International Conference on Program Comprehension (ICPC 2021) Replications and Negative Results (RENE). FARAH, P.R.; MARIANI, T.; ROZA, E.A.; SILVA, R.C.; VERGILIO, S.R. Unsupervised Learning for Refactoring Pattern Detection IEEE CEC 2021. FERREIRA, T. N.; VERGILIO, S. R.; KESSENTINE, M. Implementing Search-Based Software Engineering Approaches with Nautilus. Brazilian Symposium on Software Engineering, SBES 2021 - Tools Track. CAMARA, BRUNO; SILVA, MARCO; ENDO, ANDRE; VERGILIO, S.R. On the use of test smells for prediction of flaky tests. In: SAST'21: Brazilian Symposium on Systematic and Automated Software Testing, 2021. GUIZZO, G.; SARRO, F.; KRINKE, J.; VERGILIO, S. R. Sentinel: A Hyper-Heuristic for the Generation of Mutant Reduction Strategies. ICSE Journal-First Paper, 2021. LIMA, J. A. P.; VERGILIO, S. R. A Multi-Armed Bandit Approach for Test Case Prioritization in Continuous Integration Environments. Journal-First paper for presentation at the 2021 ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2021). 2020 LIMA, J. A. P.; VERGILIO, S. R. A Multi-Armed Bandit Approach for Test Case Prioritization in Continuous Integration Environments. IEEE TRANSACTIONS ON SOFTWARE ENGINEERING, v. 1, p. 1-1, 2020. GUIZZO, G. ; SARRO, F. ; KRINKE, J. ; VERGILIO, S. R. Sentinel: A Hyper-Heuristic for the Generation of Mutant Reduction Strategies. IEEE TRANSACTIONS ON SOFTWARE ENGINEERING, v. 1, p. 1-1, 2020. ASSUNÇÃO, W. K. G. ; VERGILIO, S. R. ; LOPEZ-HERREJON, R. E. Automatic extraction of product line architecture and feature models from UML class diagram variants. INFORMATION AND SOFTWARE TECHNOLOGY, v. 117, p. 106198-138, 2020. LIMA, J. A. P. ; VERGILIO, S. R. Test Case Prioritization in Continuous Integration environments: A systematic mapping study. INFORMATION AND SOFTWARE TECHNOLOGY, v. 121, p. 10626",
  "content_length": 23561,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:27"
}