{
  "name": "Simeon Retalis",
  "homepage": "https://www.ds.unipi.gr/en/faculty/retal-en",
  "status": "success",
  "content": "Symeon Retalis - Department of Digital Systems Skip to content Symeon Retalis Phone +30 210-4142765 Email retal@unipi.gr Title Professor Links http://cosylab.gr/ Office Hours Thursday 16:00-18:00 Office 506 (150, Androutsou Str, Piraeus, 18532) wp_statistics_words_count 448 Courses Digital Innovation Management and Entrepreneurship — 8th semester Didactics of Informatics — 8th semester Brief CV Dr. Symeon Retalis a Professor of Design Models for Technology-Enhanced Lifelong Learning Environments at the University of Piraeus, Greece. AHe has been actively engaged in research, developmentand innovation in the field of interaction design and development of technology enhanced learning environments for the past 15 years. He has authored more than 150 research articles published in scientific books, journals and conferences and has delivered about 30 keynote/invited speeches in international conferences around the world. He has supervised over 90 honours and postgraduate research students to successful completion. He has been mentor and member of R&D teams that received 6 honors and awards at international competitions for innovative software (e.g. Microsoft Imagine Cup, Intel Business Challenge). He has been involved as a principal investigator (PI) and co-ordinator in more than 30 R&D projects with several Higher Educational Institutes all over the world funded by the European Union, national grants and software companies such as Smart Education and Google, thus attracting external funds to the value of about USD 18 million.He serves at the editorial board of the most highly ranked academic journals of the field of Learning Technologies. His review work was recognized by the ACM Computing Reviews journal which selected him to become featured reviewer on June 2017.  He has developed various innovative learning tools which havegained a lot of positive reviews such as i) the CADMOS graphical learning design tool, ii) the LAER learning analytics plug-in for Moodle and iii) the digital board game WWF Educational Atlas. He is scientific responsible of the CoSyLlab (Computer Supported Learning Engineering) research group (http://cosy.ds.unipi.gr). Publications Selected Recent Publications I) BOOKS Peter Goodyear & S. Retalis (2010). Technology-enhanced learning: design patterns and pattern languages, Sense Publishers, ISBN 978-94-6091-061-6. Y. Psaromiligkos, A. Spyridakos, S. Retalis (2012). Evaluation in e-Learning, Nova Science Publishers, ISBN: 978-1-61942-942 II) JOURNALS Malegiannaki, I., Daradoumis, T. & Retalis, S. (2021). Using a Story-Driven Board Game to Engage Students and Adults with Cultural Heritage. International Journal of Game-Based Learning, 11(2) Stagias, I., Retalis, S., & Sourgiadaki, M. (2021). Fostering business opportunity identification skills in secondary education via an orchestrated technology enhanced learning script. Entrepreneurship Education, 4, 89-116. Aloizou V., Chasiotou, T., Retalis, S., Daviotis, T. & Koulouvaris, P. (2021) Remote learning for children with Special Education Needs in the era of COVID-19: Beyond tele-conferencing sessions, Educational Media International, 58:2, 181-201, DOI: 10.1080/09523987.2021.1930477 Melliou, K. & Retalis, S. (2024). Exploring the connection between “Out of Eden Learn” and competency-based education. International Journal on Studies in Education (IJonSE), 6(1), 160-176. https://doi.org/10.46328/ijonse.196 Aloizou, V., Linardatou, S., Boloudakis, M., & Retalis, S. (2024). Integrating a movement-based learning platform as a core curriculum tool in kindergarten classrooms. British Journal of Educational Technology, 00, 1–27. https://doi.org/10.1111/bjet.13511 Recent announcements 2nd Application Submission period for the M.Sc. Program “E-Learning” until Monday 16 June 2025 May 30, 2025 Call for Applications for the M.Sc. Program “Information Systems & Services” (Extended until 21/07/2025) May 30, 2025 Announcement of Extension for the Distribution of Textbooks May 30, 2025 Extension of the deadline for applications for free student meals for the Academic Year 2024-2025 until Wednesday 4 June 2025 May 28, 2025 Announcement of the MSc in “Health Services Organisation and Management – Health Informatics” for the Academic Year 2025 – 2026 May 27, 2025 Start of course/teaching evaluations for the spring semester 2024-2025 May 20, 2025 Searching for students for Internship May 12, 2025 Update on the Entrepreneurship & Career Panorama 2025 May 12, 2025 Useful LinksInstitute of Electrical and Electronics Engineers (IEEE) The British Computer Society (BCS) Workflow Management Coalition (WfMC) International Medical Informatics Association (IMIA) The American Medical Informatics Association (AMIA) European Federation For Medical Informatics (EFMI) Hellenic Society of Computer and Information Scientists and Professionals Evdoxos Alumni Site We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok",
  "content_length": 5037,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:35"
}