{
  "name": "Simeon C. Ntafos",
  "homepage": "http://www.utdallas.edu/~ntafos",
  "status": "success",
  "content": "SIMEON NTAFOS Simeon Ntafos Associate Dean for Undergraduate Education, ECS Director, Office of Student Services, ECS Professor, Dept. of Computer Science E-mail: ntafos@utdallas.edu   Office: (972) 883-2809   FAX: (972) 883-2349    Mailing Address:  Computer Science Program, EC3.1                    The University of Texas at Dallas                    P.O. Box 0688                    Richardson, TX 75083-0688 Degrees Ph.D., Northwestern University, 1979    M.S. (Electrical Engineering), Northwestern University, 1977    B.S. (Electrical Engineering), Wilkes College, 1974 Research Interests Computational Geometry, Program Testing, Software Reliability Estimation. Selected Publications \"A Comparison of Some Structural Testing Strategies\", IEEE Transactions on Software Engineering, Vol. 14, No. 6, pp. 868-874, June 1988. \"Path Planning in the Presence of Vertical Obstacles\", IEEE Journal of Robotics and Automation, Vol. 6, No. 5, pp. 31-41, June 1990 (with L. Gewali and I. Tollis). \"Path Planning in 0/1 Weighted Regions with Applications\", ORSA Journal of Computing, Vol. 2, No. 3, pp. 153-172, Summer 1990 (with L. Gewali, A. Meng, J. Mitchell). \"Watchman Routes in Simple Polygons\", Discrete and Computational Geometry, Vol. 6, No. 1, pp. 9-31, Jan. 1991 (with W. Chin). \"On Partitioning Rectilinear Polygons into Star-Shaped Polygons\", Algorithmica, Vol. 6, No. 6, pp. 771-800, 1991 (with R. Liu). \"Watchman Routes with Limited Visibility\", Computational Geometry: Theory and Applications\", Vol. 1, No. 3, pp. 149-170, March 1992. \"On Some Reliability Estimation Problems in Random and Partition Testing\", IEEE Transactions on Software Engineering, Vol. 19, No. 7, pp. 687-697, July 1993 (with J. Duran and M. Tsoukalas). \"Optimum Guard Covers and m-Watchman Routes for Histograms\", Int'l Journal of Computational Geometry and Applications\", Vol. 3, No. 1, pp. 85-105, 1993 (with S. Carlsson, J. Nilsson). \"On Random and Partition Testing\", Proc. ISSTA-98 in ACM SIGSOFT Software Engineering Notes, Vol. 23, No. 2, pp. 42-48, March 1998. \"A Greedy Over-the-Cell Channel Router\", VLSI Design, Vol. 5, No. 1, pp. 23-36, 1996 (with G. Gudmundsson) \"On Comparisons of Random, Uniform, and Proportional Partition Testing\", IEEE Transactions on Software Engineering, Vol. 27, No. 10, pp. 949-960, October 2001. \"Guarding a Terrain with Two Watchtowers\", 21st Symp. on Computational Geometry, June 2005 (with Agarwal, Bereg, Daescu, Kaplan, Zhu).",
  "content_length": 2455,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:35"
}