{
  "name": "Siming Chen 0001",
  "homepage": "http://simingchen.me",
  "status": "success",
  "content": "Siming Chen - Fudan University Siming Chen 陈思明 Education Research Publications Awards Projects Services Activities Group Personal Associate Professor, Ph.D. Fudan Visualization Research Group, FDU-VIS School of Data Science Fudan University, Shanghai. P.R.China Email: simingchen3 [at] gmail [dot] com simingchen [at] fudan [dot] edu [dot] cn I am an Associate Professor at School of Data Science, Fudan University. I was a Research Scientist in Fraunhofer Institute for Intelligent Analysis and Information Systems (Fraunhofer IAIS), working with Dr. Gennady Andrienko and Dr. Nathaliyia Andrienko in Germany. I was also a Postdoctoral Researcher at University of Bonn, working with Prof. Stefan Wrobel. I received my Ph.D. on Computer Science at EECS, Peking University under my supervisor Prof. Xiaoru Yuan. My research interests are in general visualization and visual analytics techniques as well as human-centered artificial intelligence. My special focuses are large-language model-driven visual analytics, explainable AI, digital twin and storytelling techniques. My research applications include FinTech, social network visual analytics, autonomous driving, security visual analytics and digital humanity. I like computers, travelling and poems. I believe information can be spread widely through visual communication. [News] Our research group focusing on visual analytics and human-centered machine learning in Fudan University welcomes you. Undergraduate students, prospective graduate students and Post-docs, who want to do research with me, please feel free to drop me an email. Education Sep 2011 - 2017, Peking University (Graduated with Honors), Beijing, PRC, Ph.D on Computer and Information Technology Sep 2007 - 2011, Fudan University (Graduated with Honors), Shanghai, PRC, BS on Information Security, School of Computer Science and Technology, minor in World Economy and Trade, School of Economics. Research Experience 2020 - present, School of Data Science, Fudan University Focusing on general topics on visualization and visual analytics, storytelling and human-centered machine learning. 2017 - 2020, Knowledge Discovery Group (KD) of Fraunhofer IAIS Focusing on spatial-temporal data visualization, social media visualization and security visual analytics 2017 - 2020, Knowledge Discovery and Machine Learning Group (KDML) of University of Bonn Focusing on VGI (Volunteered Geographic Information) visualization research projects 2010 - 2017, Visualization and Visual Analysis Group of Peking University (PKUVIS) Focusing on spatial-temporal data visualization and information spreading and security visual analytics, supervisor: Prof. Xiaoru Yuan 2009 - 2010, Multimedia and Image Process Lab in Fudan University Focusing on routing protocols of Ad-hoc network and image processing, supervisor: Prof. Bo Yan Projects Visual Comparison of Social Media Streams Propose a bridge visual metaphor for exploring and comparing the keywords and context. Visual Evaluation for Autonomous Driving First propose an interactive visual evaluation method for all sensor data in autonomous driving. Storytelling: Life of Su Dongpo Tell the story of the up and downs of Su Dongpo's political life, food and poems. Contextualized Analysis of Movement Event Propose a workflow supporting the exploration of spatial-temporal events with trajectory context. LDA Ensembles for User Behavior Analysis Propose topic modeling techniques for interactive user behavior analysis. Informed Machine Learning Integrate experts' knowledge in the interactive machine learning process. Story Synthesis Framework Analysts can submit the findings and organize them in the multi-facet layout. Semantic Space Time Cube Propose a general framework for visual analytics of spatial temporal data with semantic information. User Behavior Map Construct the semantic map for user behaviors to identify patterns and detect outliers. D-Map+: Information Diffusion Visual Analytics Propose a general information visual analytics framework for both ego-centric and event-centric analysis. TopicWave: Visualizing People's Reaction to Events Investigate the spatial temporal and semantic patterns in social media to understand the reactions. Uncertainty-aware Spatial-temporal Visual Analytics Summarize the uncertainty and propose the possible solution to reduce it in visual analytics. E-Map: Map-like Visual Metaphor for Social Event Evolution Analysis Project the multi-faceted and complex features in social event onto a semantic, structured and explorable map. State-of-the-Art Report for Social Media Visual Analytics Provide visualization and visual analytics taxonomies for advanced social media visual analytics. Visual Analytics for Dynamic Graph with Topic Modeling Analyze the evolution of dynamic graph based on mining methods with the visual analytics approach. WeiboFootprint - Telling Stories of Geo-tagged Social Media Trajectories Crowd participating visualization system, making every social media users reflecting and analyzing his trajectories. Emergency Information Analysis with Geo-tagged Social Media Provide visualization system and case studies of Ludian/Yaan to support analyzing earthquake catalog with geo-tagged social media and help information. D-Map: Ego-centric Information Diffusion Visual Analytics in Social Media Provide a map-based metaphor for constructing the ego-centric social network, analyzing the information diffusion patterns among communities. Visual Analytics of Sparsely Sampled Geo-tagged Data Considering the uncertainty caused by the sparsely sampled geo-tagged data, derive reliable movement pattern with semantics. Multi-variate Law Visualization and Exploration Provide LawVis system to visualize the searching result of Chinese laws, enabling lawyer for better navigating and analyzing the laws in multiple aspects. Interactive Visual Classification and Analysis on Network Activity Provide an online visual analytics system to analyze the dynamic NetFlow data, to classify the network and detect abnormal events . IEEE VAST Challenge 2014 - Award for Excellent Comprehensive Visual Analysis System Provide MovementFinder system to solve the challenge of spatial temporal event detection from IEEE VAST Challenge 2014, Mini Challenge 2. IEEE VAST Challenge 2014 - Award for Excellent Detailed Analysis Provide Story Explorer system to solve the challenge of news, email and entity relationship analysis from IEEE VAST Challenge 2014, Mini Challenge 1. Visual Analytics of Origin-Destination Patterns from Geo-tagged Social Media Provide an online visual analytics system to analyze the spatial, temporal and text information based on geo-tagged Sina Weibo data . IEEE VAST Challenge 2013 - Award of Outstanding Situation Awareness Provide AnNetTe system to solve the challenge of network scurity from IEEE VAST Challenge 2013, Mini Challenge 3 Avianflu Visualization Visualization of spatial temporal events of Avianflu in China, providing understanding of the avian flu evolution. Visual Analysis of Ionospheric Disturbance Hypotheses on Earthquake Provide query-based system to illustrate the relationship between earthquake events and ionospheric disturbance. Publications Papers Zekai Shao, Leixian Shen, Haotian Li, Yi Shan, Huamin Qu, Yun Wang*, Siming Chen*. Narrative Player: Reviving Data Narratives with Visuals. IEEE Transactions on Visualization and Computer Graphics, Accepted, 2025. | Paper | | Fen Wang, Bomiao Wang, Xueli Shu, Zhen Liu, Zekai Shao, Chao Liu, Siming Chen*. ChartInsighter: An Approach for Mitigating Hallucination in Time-series Chart Summary Generation with A Benchmark Dataset. IEEE Transactions on Visualization and Computer Graphics (IEEE PacificVis'25), Accepted, 2025. | Paper | | Jun-Hsiang Yao, Mingzheng Li, Jiayi Liu, Yuxiao Li, Jielin Feng, Jun Han, Qibao Zheng, Jianfeng Feng, Siming Chen*. DTBIA: An Immersive Visual Analytics System for Brain-Inspired Research. IEEE Transactions on Visualization and Computer Graphics (IEEE PacificVis'25), Accepted, 2025. | Paper | | Yu Zhang, Xinyue Chen, Weili Zheng, Yuhan Guo, Guozheng Li, Siming Chen*, Xiaoru Yuan*. VisTaxa: Developing a Taxonomy of Old Visualizations. IEEE Transactions on Visualization and Computer Graphics (IEEE PacificVis'25), Accepted, 2025. | Paper | | Lin Gao, Jing Lu, Zekai Shao, Ziyue Lin, Shengbin Yue, Chiokit Ieong, Yi Sun, Rory James Zauner, Zhongyu Wei, Siming Chen*. Fine-tuned large language model for visualization system: A study on self-regulated learning in education. IEEE Transactions on Visualization and Computer Graphics (IEEE VIS24), Accepted, 2025. | Paper | | Yuheng Zhao, Junjie Wang, Linbin Xiang, Xiaowen Zhang, Zifei Guo, Cagatay Turkay, Yu Zhang, Siming Chen*. LightVA: Lightweight visual analytics with LLM agent-based task planning and execution. IEEE Transactions on Visualization and Computer Graphics, Accepted, 2024. | Paper | | Yuheng Zhao, Yixing Zhang, Yu Zhang, Xinyi Zhao, Junjie Wang, Zekai Shao, Cagatay Turkay, Siming Chen*. LEVA: Using large language models to enhance visual analytics. IEEE Transactions on Visualization and Computer Graphics, Accepted, 2024. | Paper | | Richen Liu, Hansheng Wang, Hailong Wang, Siru Chen, Chufan Lai, Ayush Kumar, Siming Chen*. ScaleTraversal: Creating Multi-Scale Biomedical Animation with Limited Hardware Resources. ACM Multimedia 2024: 2603-2612. | Paper | | Yihang Hu, Weixuan Song, Xingui Lai, Jie Li, Siming Chen*. Interactive Visual Analytics for Reward Function Setting of Reinforcement Learning: A Case Study of Soccer Games. VINCI (Honorable mention of best paper award) 2024: 26:1. | Paper | | Siming Chen, Liang Gou, Michael Kamp, Dong Sun. Visual Computing for Autonomous Driving. (Guest Editors' Introduction) IEEE Computer Graphics and Applications (CG&A), 44:11-13 2024, Accepted. | Paper | | Wenlian Lu, Xin Du, Jiexiang Wang, Longbin Zeng, Leijun Ye, Shitong Xiang, Qibao Zheng, Jie Zhang, Ningsheng Xu, Jianfeng Feng, Yubin Bao, Boyu Chen, Siming Chen",
  "content_length": 49234,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:36"
}