{
  "name": "Simon Razniewski",
  "homepage": "http://simonrazniewski.com",
  "status": "success",
  "content": "Prof. Simon Razniewski - ScaDS.AI Dresden/Leipzig JavaScript is required to use this site. Please enable JavaScript in your browser settings. EN | DE Search Home // About us // AI Professorships // Knowledge-Aware AI (KAAI) // Simon Razniewski AI ProfessorshipsKnowledge-Aware AI (KAAI)Simon RazniewskiTeamResearchTeachingPublicationsTheses Contact Prof. Dr. Simon Razniewski Chair of Knowledge-Aware Artifical Intelligence TUD Dresden University of Technology simon.razniewski@tu-dresden.de Secretariat Thomas Bruderrek Center for Interdisci­plinary Digital Sciences (CIDS) TUD Dresden University of Technology thomas.bruderrek1@tu-dresden.de Angèle Héliès Center for Interdisciplinary Digital Sciences (CIDS) TUD Dresden University of Technology angele.helies@tu-dresden.de Choose a page... Simon RazniewskiTeamResearchTeachingPublicationsTheses Simon Razniewski News 8/2025: We will co-organize a Dagstuhl seminar on LLMs+KGs next year 5/2025: Our GPTKB paper has been accepted to ACL main, and Pap2Pat to ACL Findings. Chair of Knowledge-Aware AI Prof. Dr. Simon RazniewskiE-Mail: simon.razniewski@tu-dresden.deOffice: Strehlener Str. 12-14, Room 646B, 01069 Dresden, Germany (Google Maps)Secretary: Thomas Bruderrek, Angèle HélièsPhone: +49 (0)351 463 40900 (Secretary) About Simon Razniewski Simon Razniewski is professor for knowledge-aware AI at ScaDS.AI Dresden/Leipzig and TU Dresden, where he develops novel methods for extracting and consolidating knowledge from and with language models and knowledge bases. Simon Razniewski was previously a research scientist at the Bosch Center for AI (2023-2024), senior researcher at the Max Planck Institute for Informatics (2017-2021), where he was heading the Knowledge Base Construction and Quality area, and assistant professor at the Free University of Bozen Bolzano¹ (2014-2017). He holds a PhD from the Free University of Bozen-Bolzano (2014), and a Diplom (MSc.) from TUD Dresden University of Technology (2010; not this Dresden). He spent time as visitor at the Max-Planck Institute for Informatics (2016), the University of Queensland (2015), AT&T Labs-Research (2013), the University of California, San Diego (2012), and has previous industrial experience from Globalfoundries (2010) and Siemens IT (2009). Simon Razniewski has published >20 papers at premier² conferences in the area of artificial intelligence (and more than 60 papers in total). Acquired grants (selection) DFG individual research grant of 312,000 € for compiling negative knowledge at web scale, 2021 Diffbot grant of $30,000 for KB construction in fiction, 2020 Google Cloud Credit grant of $5,000 for research on commonsense knowledge, 2019 NVIDIA hardware grant (~$1,100) for research on information extraction, 2018 Free University of Bozen-Bolzano, acquired projects grants Recall (20,000 €, 2016-17), TQTK (20,000 €, 2016-17), TaDaQua (50,000 €, 2016-18) Province of South Tyrol, open research call, coauthored project MAGIC (250,000 €, 2013-16) Other grant proposals ERC starting grant 2020: Proposal received grade A but not funded due to budget constraints Organization Guest editor of SWJ special issue on Wikidata (2023), on commonsense knowledge (2021) Co-organizer, Wikidata workshop at ISWC 2023, 2022, 2021 Co-organizer, KBC-LM workshop at ISWC 2023 Co-organizer, LM-KBC challenge at ISWC 2024, 2023, 2022 Website chair, ESSLLI 2016 summer school Reviewing 2025: Area chair for ACL RR, senior PC member of IJCAI, PC member of ACL RR, AAAI, WSDM Industry track, RepL4NLP, KI, KG-Star@ESWC 2024: senior PC member of CIKM, PC member of ACL RR, ISWC P/D, IJCAI demos, KaLLM workshop@ACL, KI, AKR³ workshop, TGDK 2023: Area chair of EMNLP and EACL, senior PC member of CIKM, ESWC, PC member of ACL ARR, neurIPS, VLDB demos, IJCAI demos, LDK, VLDB tutorials, board member of TGDK, reviewer for TODS 2022: Senior PC member of WWW, CIKM, PC member of WSDM, ESWC, EMNLP, VLDB demos, reviewer for neurIPS 2021: Area chair of IJCAI, senior PC member of CIKM, PC member of WSDM, ACL, NAACL, EMNLP, ESWC, WWW, TKDE, CSKGs workshop@AAAI, LDK, QOD 2020: Senior PC member of CIKM, IJCAI, ISWC, PC member of WSDM, ACL, ESWC, QOD, Wikidata workshop@ISWC, SemDeep-6@IJCAI 2019: PC member of WWW, ACL, AAAI, NAACL, ISWC, K-CAP, AKBC, LDK, Data Quality in Wikidata workshop, Quality of Open Data workshop, Commonsense Inference workshop@EMNLP 2018: PC member of ACL, CIKM, EMNLP, DASFAA, SemDeep-4, DL4KGs, QOD, RoD. Reviewer for VLDB Journal 2017: PC member of CIKM, WebDB. Reviewer for SWJ 2011-2016: External reviewer for AAMAS 2016, SEBD 2015, CIKM 2014, COOPIS 2013, TbiLLC 2013, CIKM 2011, BNCOD 2011. Grant reviewing DFG (2024, 2023, 2020) Jönköping University (2024) GACR (2021) Membership ELLIS (since 2025) Media appearances “Was ist wichtig, was ist richtig”, Südtiroler Wirtschaftszeitung, April 2018 (in German) “Knowledge expansion for computers”, Max Planck Society, 2021 Demo systems Ascent (2021): Advanced semantics for commonsense knowledge Wikinegata (2021): Negative knowledge for Wikidata Entyfi (2020): Entity typing in fiction Sandi (2020): Story-image alignment Dice (2020): Joint reasoning for multifaceted commonsense knowledge CounQER (2020): Counting queries and entity valued relations ReCoin (2017): A user script for adding relative completeness annotations to Wikidata. Developed by Vevake Balaraman and Albin Ahmeti in the context of the TaDaQua project (Video in Danish) COOL-WD (2017): A completeness tool for Wikidata. Developed by Radityo Eko Prasojo and Fariz Darari MAGIC (2012): A tool for reasoning about the completeness of relational databases, developed by Ognjen Savkovic, Paramita Mirza and Alex Tomasi Lookslikescanned: A website to make PDFs look appear like scanned Other scripts and datasets Cinex: Code, experiment data and SPARQL endpoint with Wikipedia results for counting quantifier extraction Property Ranking: Dataset of 350 (entity, property1, property2) pairs for humans in Wikidata, along with a preference judgment [O18] A dataset of about 2000 crowdsourced completeness assertions for YAGO and Wikidata. Other I love flying, I hold (inactive) glider and paraglider licenses, and once flew in the German Gliding Bundesliga (for Aeroclub Pirna), and the OLC Alps League (Aeroclub Bolzano). I also circled the globe three times, and was on world’s longest 2017 commercial flight (QR921). Did you know that the extent of Indonesia (main islands only) at 5300 km is more than the distance from Germany to China, Kenya, or the North Pole (4630, 5200, 3920 km, respectively)? funded by: ScaDS.AI Dresden/Leipzig (Center for Scalable Data Analytics and Artificial Intelligence) is a center for Data Science, Artificial Intelligence and Big Data with locations in Dresden and Leipzig. Dresden Visitor address Technische Universität Dresden ScaDS.AI Dresden/Leipzig Bürogebäude Strehlener Straße Strehlener Straße 12, 14 01069 Dresden Postal address Technische Universität Dresden Zentrum für Informationsdienste und Hochleistungsrechnen ScaDS.AI Dresden/Leipzig 01062 Dresden Leipzig Visitor address ScaDS.AI Dresden/Leipzig Löhrs Carré Humboldtstraße 25, Uferstr. 11 04105 Leipzig Postal address Universität Leipzig Data Science Zentrum Internes Postfach: 212104 04081 Leipzig Quicklinks:ContactEventsNewsletter Copyright 2025 © SCADS.AI Dresden/Leipzig – All rights reserved. AccessibilityImprintPrivacy",
  "content_length": 7386,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:49"
}