{
  "name": "Simone Diniz Junqueira Barbosa",
  "homepage": "http://www-di.inf.puc-rio.br/~simone",
  "status": "success",
  "content": "Simone Diniz Junqueira Barbosa, PUC-Rio Skip menu to content Simone Diniz Junqueira Barbosa home teaching publications students Home Prof. Simone Diniz Junqueira Barbosa Departamento de Informática, PUC-Rio R. Marquês de São Vicente, 225/501 RDC Gávea, Rio de Janeiro, RJ, 22451-900, Brasil E-mail: simone@inf.puc-rio.br Office: 501 RDC Current position: Associate professor Main research area: Human-Computer Interaction R&D Lab: IDEIAS-SERG (Investigações sobre o DEsign de Interação e Avaliação de Sistemas + Semiotic Engineering Research Group) Community: IHC-L (HCI mailing list of the Brazilian Computer Society) Short Bio Simone Diniz Junqueira Barbosa is Associate Professor at the Informatics Department of the Pontifical Catholic University of Rio de Janeiro (PUC-Rio). Level 1D researcher in CNPq (National Council for Scientific and Technological Development in Brazil), she works on Human-Computer Interaction (HCI) and Information Visualization, and her current research interests involve: model-based interactive systems design; data science, information visualization, and visual analytics; digital storytelling; increasing the quality of use (e.g. usability, communicability, accessibility) of interactive systems in diverse domains, by means of adaptation, analogy-making mechanisms, and other artificial intelligence techniques. In 2019, Simone received the IFIP TC13 Pioneer Award. In 2020, she was awarded the \"Outstanding HCI Career Award\" (\"Prêmio Carreira de Destaque em IHC\"), granted by the Special Comission for Human-Computer Interaction of the Brazilian Computer Society (Comissão Especial de Interação Humano-Computador (CEIHC) da Sociedade Brasileira de Computação). In 2022, she received an innovation award from the Brazilian Computer Society (Selo de Inovação SBC) for VisStoryMaker, a visual data exploration and communication tool by three of her Master's students. In 2024, Simone received the IFIP Fellow Award. She leads the IDEIAS + SERG lab, a merger of the IDEIAS lab (founded in 2010) and the Semiotic Engineering Research Group (SERG) (founded in 1996). Simone Barbosa has led and participated in several R&D projects, funded by CNPq, FAPERJ, Microsoft Research, Hewlett-Packard, Petrobras etc. She currently co-coordinates DasLab, ExACTa, and Americanas Futuro Lab PUC-Rio. She was the Brazilian Computer Society's representative in IFIP TC 13 from 2008 to 2013, when she became an expert member and later Vice-chair for Working Groups and Special Interest Groups. From 2013 to 2015, she was the chair of the Special Commission for HCI of the Brazilian Computer Society. In 2015, she co-proposed the creation of the IFIP TC 13 INTERACT Steering committee, of which she remains a member. In August 2019, she joined the CHI Steering Committee as a voting member. From October 2016 to September 2019, she was co-Editor-in-Chief of ACM Interactions Magazine. She was a member of several editorial boards: of the SBC Journal of Interactive Systems (2014-2019); of Interacting with Computers (2009-2020; formerly published by Elsevier, now by Oxford University Press); Springer's CCIS book series (2012-2020); and SBC's Journal of Software Engineering Research and Development (2016-2020; formerly published by Springer). In 2019, she was Associate Editor of the Journal of Computer Languages, by Elsevier, responsible for coordinating the Visual Languages and Computing Technology track. She is currently a member of the editorial boards of: IxD&A (since 2011) and Springer's HCI book series (since 2012). She has served in organization and technical program committees of several national and international conferences in various capacities, e.g., program co-chair of CLIHC 2003 (the first Latin-American Conference on Human-Computer Interaction), IHC 2013, and IS-EUD 2017; full papers co-chair for INTERACT 2015 and 2025; general co-chair of (IFIP TC 13) INTERACT 2007, (ACM SIGCHI) EICS 2012, and (ACM SIGCHI) CHI 2022. For more detailed information, please visit her Lattes CV in English or her Lattes CV in Portuguese.",
  "content_length": 4064,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:56"
}