{
  "name": "Simon Peter 0001",
  "homepage": "https://homes.cs.washington.edu/~simpeter",
  "status": "success",
  "content": "Simon Peter Simon Peter Paul G. Allen School of Computer Science and Engineering, University of Washington Office: CSE 540 simpeter@cs.washington.edu Contact Paul G. Allen School of Computer Science & Engineering 185 E. Stevens Way NE Box 352350 Seattle, WA 98195 USA About Me I am an associate professor in the Paul G. Allen School of Computer Science and Engineering at UW, since January 2022. I graduated with a Ph.D. (Dr. sc. ETH) in Computer Science at the Swiss Federal Institute of Technology, Zurich, in October 2012. Prior to that I graduated (Dipl.-Inf.) from the Carl-von-Ossietzky University of Oldenburg, Germany in 2006 with a major in Computer Science and a minor in Music. Prior to my position in the Allen School, I was an assistant professor at UT Austin, since 2016. Students and Postdocs I have the honor to be advising a number of exceptional graduate students and postdocs: Deukyeon Hwang Aditya Kamath Shihang (Vic) Li Jonggyu Park Rajath Shashidhara Yingbo Sun Shubham Tiwari Zezhou Wang Dedong Xie Graduated students and postdocs (and where they went): Antoine Kaufmann, Ph.D. (MPI-SWS) Youngjin Kwon, Ph.D. (KAIST) Cody Littley, MSc (Nutanix) Ming Liu, Ph.D. (UW-Madison) Syed Akbar Mehdi, Ph.D. (Google) Dhathri Purohith, MSc (Confluent) Kevin Puthusseri, MSc (Google) Amanda Raybuck, Ph.D. (UC Davis) Tim Stamler, Ph.D. (NVIDIA) Theano Stavrinos, Ph.D. (Databricks) Research My research interests are in Operating Systems and Networks. My current research projects are in low latency, scalable, and energy-efficient data center system design. VM, OS & runtime design:​ Quality of service in tiered memory management​ Transparent zero-copy IO Lightweight network stack virtualization Scalable power control plane for datacenter power resiliency Power-adaptive disaggregated storage Fine-grained OS power attribution Hardware/Software co-design:​ Flexible RDMA and TCP offload Reconfigurable network topologies Memory controller telemetry Teaching Fall 2025: CSE453/M553 Data Center Systems Spring 2025: CSE481A Operating Systems Capstone Spring 2024: CSE481A Operating Systems Capstone Fall 2023: CSE453/M553 Data Center Systems Spring 2023: CSE481A Operating Systems Capstone Fall 2022: CSE453/M553 Data Center Systems Spring 2022: CSE599 Datacenters Fall 2014: PMP Graduate Operating Systems (CSEP551) with Andrew Baumann (MSR) At UT Austin: Fall 2021: Data Centers (395T) Spring 2021: Multicore Operating Systems Implementation (378) Fall 2020: Data Centers (395T) Spring 2020: Multicore Operating Systems Implementation (378) Fall 2019: Data Centers (395T) Spring 2019: Multicore Operating Systems Implementation (378) Fall 2018: Data Centers (395T) Spring 2018: Multicore Operating Systems Implementation (378) Spring 2017: Multicore Operating Systems Implementation (378) Fall 2016: Multicore Operating Systems Implementation (395T) Vita and Publications Please, read my CV. It has all of the information and I keep it updated. I also have a Google Scholar page, if you prefer a quick overview of my publications, but it typically lags behind my CV. Personal Apart from CS, I enjoy making and listening to music. I used to play the violin and compose electronic music on the computer. The advent of reasonably precise DJ controllers recently allow me to resurrect many of the old sounds in new ways. I enjoy going skiing in the winter and hiking in the summer. I was born in Oldenburg, situated in north-west Germany, and enjoyed living a good deal of my youth in the cozy area of Bad Zwischenahn. In my teenage years, I used to be active in the Demoscene, a computer art subculture and I have fond memories of the good old times.",
  "content_length": 3663,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:46"
}