{
  "name": "Simon J. Gay",
  "homepage": "http://www.dcs.gla.ac.uk/~simon",
  "status": "success",
  "content": "Simon Gay's Home Page Professor Simon Gay MA PhD MBCS CITP Photo by Daniel Oi. School of Computing Science Sir Alwyn Williams Building University of Glasgow Glasgow G12 8QQ UK Phone: +44 141 330 6035 Fax: +44 141 330 4913 Email: Simon.Gay@glasgow.REMOVE.ac.uk Skype: SimonJGay ORCID: 0000-0003-3033-9091 I am a Professor and Head of the School of Computing Science, University of Glasgow. Research Interests My main research area is programming language foundations. This concerns the theory, design and practice of the languages in which computer software is developed and coded. I am particularly interested in the design of programming language features that make it easier for programmers to develop software that relies on communication: for example, communication between computers and devices across the internet. This is important because modern life is so dependent on large-scale software systems in which communication is an essential aspect of the design. I am also interested in quantum computing, which has the potential for a 21st century technological transformation similar to the development of digital computing in the 20th century. My interest here is in techniques for verifying the correctness of systems that combine classical and quantum computation and communcation. PhD Opportunities If you are interested in applying to do a PhD in one of my research areas, please contact me. There are numerous possible topics related to the projects listed below. You can find information about the application process here. Projects and Grants Current Stardust: Session Types for Reliable Distributed Systems (EPSRC EP/T014628/1) October 2020 - September 2024 (jointly with Phil Trinder, Nobuko Yoshida, Laura Bocchi and Simon Thompson). BehAPI: Behavioural Application Program Interfaces, an EU RISE network. Recent From Data Types to Session Types: A Basis for Concurrency and Distribution (EPSRC EP/K034413/1) June 2013 - November 2020 (jointly with Philip Wadler and Nobuko Yoshida). Exploiting Parallelism through Type Transformations for Hybrid Manycore Systems (EPSRC EP/L00058X/1) October 2013 - September 2018 (jointly with Wim Vanderbauwhede, Sven-Bodo Scholz, Nobuko Yoshida and Wayne Luk). Chair, COST Action IC1201: Behavioural Types for Reliable Large-Scale Software Systems (BETTY) October 2012 - October 2016. Conferences and Workshops Current PC Member: 32nd European Symposium on Programming (ESOP 2023). PC Member: European Conference on Object-Oriented Programming (ECOOP 2022). Recent PC Member: 17th International Workshop on Quantum Physics and Logic (QPL 2020). PC Member: European Symposium on Programming (ESOP 2019). Other Research Activities Scottish Programming Languages Seminar. Scottish Programming Languages Institute. Programming Languages Theme, University of Glasgow. Member of the EPSRC Peer Review College. Publications and my Google Scholar Profile Biographical Information",
  "content_length": 2926,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:42"
}