{
  "name": "Simon Lacoste-Julien",
  "homepage": "http://www.di.ens.fr/~slacoste",
  "status": "success",
  "content": "Simon Lacoste-Julien homepage - DIRO, Université de Montréal Simon Lacoste-Julien Full Professor and Associate CIFAR Fellow and Canada CIFAR AI (CCAI) chair holder Department of Computer Science and Operations Research (DIRO) Associate Scientific Director, Mila  Quebec Institute of Artificial Intelligence Université de Montréal VP Lab Director - Samsung AI Lab Montreal (SAIL Montreal) Mila office: 6666 rue Saint-Urbain (map) Montréal (QC) Canada office: D-11 (2nd floor) [Version française] Prospective students: *do not email* me directly about doing a PhD or internship with me. Unfortunately, I receive hundreds of requests like these and cannot reply individually. If you are interested in doing a PhD, Master or internship with me, please apply first through the Mila supervision request website and put in your selection there that you are interested in working with me. If your application is succesful, I will contact you. I might be taking new students for Fall 2026. News: 2025: NeurIPS 2025 Workshop on Constrained Optimization Promoted to full professor! I am acting as a co-program chair for ICML 2025. 2019: I started heading part-time a new machine learning research lab, SAIT AI Lab (SAIL) Montreal, from Samsung Advanced Institute of Technology (SAIT) located in Mila's corporate labs and was hiring research scientists. [May 1st 2019 inauguration video] NeurIPS 2018 and 2019 Workshops on Smooth Games Optimization and Machine Learning. Update August 2016: I just moved to the Université de Montréal. (Until August 2016) I was a researcher at INRIA in the SIERRA project team which is part of the Computer Science Department of École Normale Supérieure in Paris. I did my PhD in Computer Science at the University of California, Berkeley under the supervision of Michael I. Jordan, and (basically) a B.Sc. Triple Honours in Mathematics, Physics and Computer Science at McGill University. I then worked with Zoubin Ghahramani as a postdoc in the Machine Learning Group of the University of Cambridge. In September 2011, I got a Research in Paris fellowship to work with Francis Bach in the SIERRA project team, and then I joined as a researcher in September 2013. CV (June 2025) | Google Scholar citation profile Research Interests Structured prediction Optimization and machine learning; games Theory of deep learning Modern generative models Causality Performative Prediction Applications: NLP, information retrieval, computer vision, computational biology Students and Postdocs Vitória Barin Pacela Jose Gallego-Posada António Góis Pedram Khorsandi Rozhin Nobahari Juan Ramirez Mansi Rankawat Motahareh Sohrabi Tianyue (Helen) Zhang Alumni Jean-Baptiste Alayrac, Research Scientist, Deepmind, London Reza Babanezhad, Research Scientist, SAIL Montreal Aristide Baratin, Research Scientist, SAIL Montreal Hugo Berard, Postdoctoral Researcher, Université de Montréal Quentin Bertrand, Researcher (chargé de recherche), Inria Lyon Tatjana Chavdarova, Assistant Professor, Saarland University Golnoosh Farnadi, Assistant Professor, McGill University Gauthier Gidel, Associate Professor, Université de Montréal Gabriel Huang, Research Scientist, ServiceNow Sébastien Lachapelle, Research Scientist, SAIL Montreal Rémi Leblond, Research Scientist, Deepmind, Paris Rémi Le Priol, Analytics Engineer, Padam Mobility Lewis Liu, PhD Student, Stanford University Isabella Lukasewitz, Associate Partner, QuantumBlack / McKinsey Nicolas Loizou, Assistant Professor, Johns Hopkins University Anton Osokin, Assistant Professor, CS HSE, Moscow, Russia Anastasia Podosinnikova, Postdoctoral Researcher, MIT Damien Scieur, Research Scientist, SAIL Montreal Sharan Vaswani, Assistant Professor, Simon Fraser University Yassine Yaakoubi, Assistant Professor, Concordia University Teaching Grad classes at Université de Montréal: Fall 2024: IFT 6269 Probabilistic Graphical Models Winter 2024: IFT 6132 Advanced Structured Prediction and Optimization Fall 2023: IFT 6269 Probabilistic Graphical Models Winter 2023: IFT 6132 Advanced Structured Prediction and Optimization Fall 2022: IFT 6269 Probabilistic Graphical Models Fall 2021: IFT 6269 Probabilistic Graphical Models Winter 2021: IFT 6132 Advanced Structured Prediction and Optimization Fall 2020: IFT 6269 Probabilistic Graphical Models Winter 2020: IFT 6132 Advanced Structured Prediction and Optimization Fall 2019: IFT 6269 Probabilistic Graphical Models Winter 2019: IFT 6132 Advanced Structured Prediction and Optimization Fall 2018: IFT 6269 Probabilistic Graphical Models Winter 2018: IFT 6132 Advanced Structured Prediction and Optimization Fall 2017: IFT 6269 Probabilistic Graphical Models Winter 2017: IFT 6132 Advanced Structured Prediction and Optimzation Fall 2016: IFT 6269 Probabilistic Graphical Models Previously: 2015-2016: Machine learning programming project class - Master M2 MASH (Université Dauphine) Fall 2015: An introduction to graphical models - Master M2 \"Mathematiques, Vision, Apprentissage\" - Ecole Normale Superieure de Cachan Fall 2015: Statistical machine learning - Master M1 - Ecole Normale Superieure (Paris) 2014-2015: Machine learning programming project class - Master M2 MASH (Université Dauphine) Fall 2014: Statistical machine learning - Master M1 - Ecole Normale Superieure (Paris) Papers Technical Reports [new!] Position: Adopt Constraints Over Penalties in Deep Learning, Juan Ramirez, Meraj Hashemizadeh, Simon Lacoste-Julien, arXiv:2505.20628 [CS.LG], May 2025. [code] [new!] Cooper: A Library for Constrained Optimization in Deep Learning, Jose Gallego-Posada*, Juan Ramirez*, Meraj Hashemizadeh*, Simon Lacoste-Julien, arXiv:2504.01212 [CS.LG], Apr 2025. [code] [new!] Nonparametric Partial Disentanglement via Mechanism Sparsity: Sparse Actions, Interventions and Sparse Temporal Dependencies, Sébastien Lachapelle, Pau Rodríguez López, Yash Sharma, Katie Everett, Rémi Le Priol, Alexandre Lacoste, Simon Lacoste-Julien, arXiv:2401.04890 [CS.LG], Jan 2024. Partial Disentanglement via Mechanism Sparsity, Sébastien Lachapelle, Simon Lacoste-Julien, arXiv:2207.07732 [stat.ML], July 2022. Convergence Rates for the MAP of an Exponential Family and Stochastic Mirror Descent -- an Open Problem, Rémi Le Priol, Frederik Kunstner, Damien Scieur, Simon Lacoste-Julien, arXiv:2111.06826 [stat.ML], Nov 2021. To Each Optimizer a Norm, To Each Norm its Generalization, Sharan Vaswani, Reza Babanezhad, Jose Gallego-Posada, Aaron Mishkin, Simon Lacoste-Julien, Nicolas Le Roux, arXiv:2006.06821 [cs.LG], June 2020. Adaptive Gradient Methods Converge Faster with Over-Parameterization (and you can do a line-search), Sharan Vaswani, Frederik Kunstner, Issam Laradji, Si Yi Meng, Mark Schmidt, Simon Lacoste-Julien, arXiv:2006.06835 [cs.LG], June 2020. [code] Flight-Connection Prediction for Airline Crew Scheduling to Construct Initial Clusters for OR Optimizer, Y. Yaakoubi, S. Lacoste-Julien, F. Soumis, arXiv:2009.12501 [cs.LG], Les Cahiers du GERAD G-2019-26, April 2019. Are Few-Shot Learning Benchmarks too Simple ? Solving them without Task Supervision at Test-Time, G. Huang, H. Larochelle, S. Lacoste-Julien, arXiv:1902.08605 [cs.LG], Feb 2019. A Modern Take on the Bias-Variance Tradeoff in Neural Networks, B. Neal, S. Mittal, A. Baratin, V. Tantia, M. Scicluna, S. Lacoste-Julien, I. Mitliagkas, arXiv:1810.08591 [cs.LG], Oct 2018. Parametric Adversarial Divergences are Good Task Losses for Generative Modeling, G. Huang, H. Berard, A. Touati, G. Gidel, P. Vincent and S. Lacoste-Julien, arXiv:1708.02511 [cs.LG], August 2017. Convergence Rate of Frank-Wolfe for Non-Convex Objectives, S. Lacoste-Julien, arXiv:1607.00345 [math.OC], June 2016. An Affine Invariant Linear Convergence Analysis for Frank-Wolfe Algorithms, S. Lacoste-Julien and M. Jaggi, appeared at the NIPS 2013 Workshop on Greedy Algorithms, Frank-Wolfe and Friends, arXiv:1312.7864 [math.OC], December 2013. A Simpler Approach to Obtaining an O(1/t) Convergence Rate for the Projected Stochastic Subgradient Method, S. Lacoste-Julien, M. Schmidt and F. Bach, arXiv:1212.2002v2 [cs.LG], December 2012. Approximate Gaussian Integration using Expectation Propagation, J.P. Cunningham, P. Hennig and S. Lacoste-Julien, arXiv:11111.6832v1 [stat.ML], November 2011. A Kernel Approach to Tractable Bayesian Nonparametrics., F. Huszár and S. Lacoste-Julien, arXiv:1103.1761v3, [stat.ML], March 2011. Discriminative Machine Learning with Structure, S. Lacoste-Julien, PhD Thesis, University of California, Berkeley, 2009. A UC Berkeley class project which has been cited a few times as a tutorial: An introduction to Max-Margin Markov Networks. S. Lacoste-Julien, 2003. Published Papers [new!] Feasible Learning, Juan Ramirez*, Ignacio Hounie*, Juan Elenter*, Jose Gallego-Posada*, Meraj Hashemizadeh, Alejandro Ribeiro†, Simon Lacoste-Julien†, arXiv:2409.04434 [CS.LG], International Conference on Artificial Intelligence and Statistics (AISTATS 2025), Mai Khao, Thailand, May 2025. [open reviews] | [code] [new!] Performative Prediction on Games and Mechanism Design, António Góis, Mehrnaz Mofakhami, Fernando P. Santos, Gauthier Gidel†, Simon Lacoste-Julien†, arXiv:2408.05146 [CS.LG], International Conference on Artificial Intelligence and Statistics (AISTATS 2025), Mai Khao, Thailand, May 2025. [open reviews] | [code] [new!] Accelerating Training with Neuron Interaction and Nowcasting Networks, Boris Knyazev, Abhinav Moudgil, Guillaume Lajoie, Eugene Belilovsky, Simon Lacoste-Julien, arXiv:2409.04434 [CS.LG], International Conference on Learning Representations (ICLR 2025), Singapore, April 2025. [open reviews] | [code] [new!] On PI Controllers for Updating Lagrange Multipliers in Constrained Optimization, Motahareh Sohrabi*, Juan Ramirez*, Tianyue H. Zhang, Simon Lacoste-Julien, Jose Gallego-Posada, arXiv:2406.04558 [CS.LG], International Conference on Machine Learning (ICML 2024), Vienna, Austria, July 2024. [open reviews] [new!] Promoting Exploration in Memory-Augmented Adam using Critical Momenta, ",
  "content_length": 29878,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:48"
}