{
  "name": "Simon J. Puglisi",
  "homepage": "https://www.cs.helsinki.fi/u/puglisi",
  "status": "success",
  "content": "Simon J. Puglisi, Professor, Department of Computer Science, University of Helsinki Simon J. Puglisi [Home] [Publications] [Research Activities] [Simon J. Puglisi now lives way up North.] Professor Department of Computer Science University of Helsinki P. O. Box 68 (Pietari Kalmin katu 5) FI-00014 Finland email: simon [dot] puglisi [at] helsinki [.] fi office: A238, Kumpula Kampus I'm a Professor at the University of Helsinki in the Department of Computer Science. I lead the Compressed Data Structures group, and am a member of the Algorithmic Bioinformatics and the Practical Algorithms and Data Structures on Strings groups. I am also a visiting fellow at the RIKEN AIP in Tokyo. Before moving to Helsinki, I was a Newton Fellow in the Algorithms and Bioinformatics group at King's College London, and earlier still I held an Australian Postdoctoral Fellowship in the Search Engine Group at RMIT. My current research focuses on efficient algorithms and data structures for searching, storing, and manipulating strings, trees and graphs, and applications thereof (like bioinformatics, information retrieval, database systems, and data mining). I obtained my PhD from Curtin University, Western Australia, under the supervision of Bill Smyth and Andrew Turpin. Selected (+ Recent) Publications A fairly complete list is at DBLP. And then there is also Google Scholar. Research Activities I am on the steering committee of ESA, the European Symposium on Algorithms. I am on the steering committee of SEA, the annual Symposium on Experimental Algorithms. I am on the steering committee of DSB, the annual Workshop on Data Structures for Bioinformatics. I am organizing the 3rd edition of Sequences in London, wth Golnaz Badkobeh and Gabriele Fici. Sequences will be a two-day workshop held on 6-7 February, 2025, for recent results relating to algorithms, data structures, and combinatorics for sequences. Registration is free. I was PC co-chair (with Shunsuke Inenaga) of CPM 2024, in Fukuoka. I was PC co-chair (with Inge Li Gørtz and Martin Farach-Colton) of ESA 2023, held in beautiful Amsterdam. I was on the programme committee for ALENEX 2024. I was on the programme committee for ISMB 2023. I gave a keynote talk at ESA 2022, the 30th European Symposium on Algorithms. I was on the programme committee for SPIRE 2022. From 2014-2022, I served as an Associate Editor at the now disbanded ACM Journal of Experimental Algorithmics. From 2015-2022, I served on the steering committee of SPIRE, the annual Symposium on String Processing and Information Retrieval. I was PC co-chair (with Filippo Bonchi) of MFCS 2021 held in beautiful Tallinn. I was on the programme committee for ISMB/ECCB 2021 I was on the programme committee for SPIRE 2020 and ALENEX 2021. I was on the programme committee for WALCOM 2020, SEA 2020, FUN 2020, and ISMB 2020. I was PC co-chair (with Nieves Brisaboa) of SPIRE 2019, held in beautiful Segovia, 7-10 October, 2019. I was on the programme committee for CPM 2019. I gave a keynote talk at SEA 2018, the 17th International Symposium on Experimental Algorithms, in L'Aquila, 27-29 June, 2018. I was on the programme committee for ESA 2018, IWOCA 2018, and WALCOM 2018. I organised (with Veli Mäkinen) the 4th Workshop on Data Structures on Bioinformatics, May 16-17, 2018. Here is a news item about it. I organised (with Hideo Bannai and Yasuo Tabei) String Masters in Tokyo, October 13, 16, and 17, 2017. I gave a keynote talk at PSC 2017, the annual Prague Stringology Conference, 28-30 August, 2017. I was PC co-chair (with Rajeev Raman and Solon Pissis) of SEA 2017, held in wonderful London, June 21-23, 2017. I was co-chair (with Yasuo Tabei) of WCTA 2016, which was a satellite to SPIRE in Japan. I was PC co-chair (with Veli Mäkinen) of IWOCA 2016, which was held in Helsinki, August 17-19, 2016. I gave a keynote talk at MatBio 2016, the 1st Conference on Mathematical Foundations of Bioinformatics, in London, July 20, 2016. I was PC co-chair (with Emine Yilmaz and Costas Iliopoulos) of SPIRE 2015 in London in autumn 2015. I was co-chair (with Costas Iliopoulos and Maxime Crochemore) of the Royal Society meeting on Storage and Indexing of Massive Data, February 7-8, 2013. Here is a group photo. I was co-Chair (with Golnaz Badkobeh) of the organizing committee for LSD 2012. I was on the programme committee for CPM 2017, IWOCA 2017, CIBB 2017, SPIRE 2017, SPIRE 2016, CPM 2015, IWOCA 2015, SEA 2014, SPIRE 2014, SEA 2013, IWOCA 2013, SPIRE 2012, IWOCA 2012, CPM 2011, IWOCA 2011, IWOCA 2010, CIKM 2009, and SPIRE 2008. I was on the organizing committee for CPM 2012 and SPIRE 2008. I occasionally review papers for the following venues. Supervision Saska Dönges (PhD, U. Helsinki, current) Elena Biagi (PhD, U. Helsinki, current) Bella Zhukova (PhD, U. Helsinki, 2024, now at ePassi) Christopher Hoobin (PhD, RMIT, 2015, now at NASDAQ) Jasbir Dhaliwal (PhD, RMIT, 2014, now at Monash U., formerly at IBM) Shanika Kuruppu (PhD, U. Melbourne, 2013, now at Google) Ossi Siipola (MSc, U. Helsinki, 2022) Aki Uhtoslahti (MSc, U. Helsinki, 2022) Arttu Kilpinen (MSc, U. Helsinki, 2022) Martin Vidjeskog (MSc, U. Helsinki, 2022) Pekka Jylha-Ollila (MSc, U. Helsinki, 2020) Antti Karjalainen (MSc, U. Helsinki, 2020) Lauri Heino (MSc, U. Helsinki, 2020) Risto Haapasalmi (MSc, U. Helsinki, 2020) Juusi Timmonen (MSc, U. Helsinki, 2020) Joonas Nietosvaara (MSc, U. Helsinki, 2019) Alex Bowe (MSc, RMIT, 2013, now at Cruise Automation, PhD from U. Tokyo) Funding/Grants I hold or have held grants from the Academy of Finland, the National Science Foundation (NSF), and EU Horizon 2020, Royal Society, the Australian Research Council (ARC), and the Japan Society for the Promotion of Science (JSPS). Life I try to travel overseas as much as possible. I enjoy listening to Shintaro Sakamoto, Arvo Pärt, Colleen, Boards of Canada, and various other music. I love reading. Science on the Edge. The Long Now Foundation. The Saws by Robert Pinsky. First Idyll by Susan Stewart. Next Door and I Took Out the Part by Jessica Greenbaum. Solitaire by Deborah Landau. On Friendship by Hagit Grossman.",
  "content_length": 6130,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:41"
}