{
  "name": "Simon Hadfield",
  "homepage": "http://personal.ee.surrey.ac.uk/Personal/S.Hadfield/biography.html",
  "status": "success",
  "content": "Simon Hadfield's Personal Page Biography I am Associate Professor (Reader) in Robot Vision and Autonomous Systems within the Centre for Vision, Speech and Signal Processing (CVSSP) at the University of Surrey Electronic Engineering Department. I am also a Surrey AI Fellow at the Insititue for People Centred AI. A copy of my CV is available here (this may be updated infrequently). My current research team comprises 10 PhD and post-doctoral researchers. I have also supervised ten successfully completed PhD students, including the winners of the 2021, 2017 and 2016 Sullivan Thesis Prize (Dr. Jaime Spencer Martin, Dr. Oscar Mendez and Dr. Karel Lebeda). The research group as of October 2025. From left to right (top row): Layi Macaulay, Isaac Baglin, Frank Lu, Rogier Fransen, Simon Hadfield, Dipon Ghosh, and Tavis Shore. From left to right (bottom row): Chris Thirgood, Enis Baty, Alejandro Hernandez Diaz. My teaching responsibilities include the 2nd year module \"C++ and Object Oriented Design\" and the third year Robotics module. I also supervise several undergraduate and MSc projects each year, please get in touch if you are interested in projects relating to deep learning, robotics or the wider field of computer vision. My PhD thesis was titled \"The estimation and use of 3D information, for natural human action recognition\" and was completed in May 2013. My PhD supervisor was Prof. Richard Bowden and my secondary supervisor was Dr. John Collomosse. My examiners were Prof. Adrian Hilton and Prof. Andrew Davison. I received an MEng (distinction) in Electronics and Computer Engineering at the University of Surrey, in October 2009. I was also awarded the DTI MEng prize, for the highest scoring MEng graduate, and the Associateship of the University of Surrey (AUS) for my industrial placement at the Home Office Scientific Development Branch (HOSDB). S.Hadfield@surrey.ac.uk Validated HTML5 and CSS3",
  "content_length": 1920,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:40"
}