{
  "name": "Simon R. Blackburn",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/simon-blackburn",
  "status": "success",
  "content": "Simon Blackburn - Royal Holloway Research Portal Simon Blackburn Professor Professor of Pure Mathematics, Department of MathematicsAlgebraDiscrete Mathematics and its Applications https://orcid.org/0000-0003-0762-031X Phone+44 1784 443422EmailSimon.Blackburnrhul.acuk TW20 0EX Personal profile Personal profileMy research interests: combinatorics, cryptography, the mathematics of communication, and group theory. Personal homepage: https://simonblackburnmath.wordpress.com/ Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 65 Article 13 Chapter 4 Conference contribution 1 Book 2 More 1 Paper 1 Working paper Research output per year Research output per year An upper bound on the per-tile entropy of ribbon tilingsBlackburn, S., Chen, Y. & Kargin, V., 15 Sept 2025, In: Combinatorial Theory. 5, 3Research output: Contribution to journal › Article › peer-review Open Access Exponent-critical groupsBlackburn, S. R., Cocke, W., Misseldine, A. & Venkataraman, G., 24 Jan 2025, (E-pub ahead of print) In: Journal of Group Theory.Research output: Contribution to journal › Article › peer-review Subsets of free groups with distinct differencesBlackburn, S., Smith, E. & Stewart, L., 28 Apr 2025, (Accepted/In press) In: Combinatorial Theory. 12 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 9 Downloads (Pure) The Capacity of a Finite Field Matrix ChannelBlackburn, S. R. & Claridge, J., 29 Jan 2025, (E-pub ahead of print) In: IEEE Transactions on Information Theory.Research output: Contribution to journal › Article › peer-review Open AccessFile 92 Downloads (Pure) Permutations that separate close elements, and rectangle packings in the torusBlackburn, S. & Etzion, T., 1 Nov 2024, In: The Electronic Journal of Combinatorics. 31, 4, 17 p., P4.27.Research output: Contribution to journal › Article › peer-review Open Access 6 Downloads (Pure) View all 85 research outputs Projects 6 Finished Projects per year Travel GrantBlackburn, S. (PI)London Mathematical Society24/07/22 → 29/07/22Project: Research Private information retrieval with limited server storage: combinatorics and coding theoryBlackburn, S. (PI)Eng & Phys Sci Res Council EPSRC30/06/16 → 1/03/17Project: Research On network codingBlackburn, S. (PI)EPSRC/GCHQ1/07/13 → 30/09/16Project: Research The resilience of key predistribution schemes of wireless sensor networksBlackburn, S. (PI)Royal Society1/06/09 → 8/08/09Project: Research Combinatorics and Wireless Sensor NetworksBlackburn, S. (PI)Eng & Phys Sci Res Council EPSRC24/06/08 → 24/09/08Project: Research View all 6 projects",
  "content_length": 2918,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:48"
}