{
  "name": "Simon E. Dixon",
  "homepage": "http://www.eecs.qmul.ac.uk/~simond",
  "status": "success",
  "content": "Professor Simon Dixon - School of Electronic Engineering and Computer Science Skip to main content School of Electronic Engineering and Computer Science Prof. Simon Dixon Contact Details Position: Professor; Director of the UKRI Centre for Doctoral Training in Artificial Intelligence and Music; Deputy Director of the Centre for Digital Music Tel: Internal: [13] 7681 International: +44 20 7882 7681 Email: s.e.dixon@qmul.ac.uk Office: ENG 406 (access from ENG403 via 4th floor of Graduate Centre) Office Hours: Tue 3pm during semester. Please mail me in advance to confirm availability or to request an appointment at other times. Research Group: Centre for Digital Music Google Scholar: https://scholar.google.co.uk/citations?user=9GvyqXEAAAAJ ORCID ID: 0000-0002-6098-481X News Research & Projects Publications Research Team Downloads Teaching Biography News & Events 6 Dec 2024: Yukun Li passed his PhD viva on Segmenting and Analysing Pitch Contours across Singing Styles 14 Nov 2024: Two of the three best paper awards at the International Society for Music Information Retrieval Conference featured AIM PhD students and their supervisors: MuChoMusic: Evaluating Music Understanding in Multimodal Audio-Language Models (Benno Weck, Ilaria Manco, Emmanouil Benetos, Elio Quinton, George Fazekas, Dmitry Bogdanov) and ST-ITO: Controlling Audio Effects for Style Transfer with Inference-Time Optimization (Christian J. Steinmetz, Shubhr Singh, Marco Comunità, Ilias Ibnyahya, Shanxin Yuan, Emmanouil Benetos, Joshua D. Reiss) 6 Nov 2024: Yixiao Zhang passed his PhD viva on Improving Controllability and Editability for Pretrained Text-to-Music Generation Models 12 Jul 2024: the Best Paper Award at the Sound and Music Computing Conference (SMC 2024) was awarded to Alia Morsi (UPF), Huan Zhang (QMUL), Akira Maezawa (Yamaha), Simon Dixon (QMUL) and Xavier Serra (UPF) for our paper: Simulating Piano Performance Mistakes for Music Learning Contexts 26 Apr 2024: I will give a keynote presentation at the Northern Network for Empirical Music Research (NEMuR) at the University of Hull 7 Mar 2024: Brendan O'Connor passed his PhD viva on the topic of Analysis, Disentanglement, and Conversion of Singing Voice Attributes 26 Feb 2024: Applications close for a research assistent to work on the project Music Performance Assessment and Feedback 12 Jan 2024: Final workshop of JazzDAP (the Jazz Digital Archives Project, also known as New Directions in Digital Jazz Studies) at the Institute for Jazz Studies, Rutgers University, New Jersey. 11 Jan 2024: We (Adriana Cuervo, Pedro Cravinho, Simon Dixon, Haftor Medbøe, Gabriel Solis and Tillman Weyde) presented a panel on Artificial Intelligence and New Directions in Digital Jazz Studies at the Jazz Congress 2024, Lincoln Center, New York (the only time in my life I'll be on the same programme as Dee Dee Bridgewater, Marcus Miller, John Patitucci, etc.!) 28 Apr 2023: Carlos Lordelo passed his PhD viva on the topic of Deep Learning Methods for Instrument Separation and Recognition. Carlos was funded by the EU H2020 MIP-Frontiers project, and completed most of his PhD in Sweden with our industry partner DoReMIR Music Research, supervised by Emmanouil Benetos, Sven Ahlbäck from DoReMIR and me. His work is already in use in the ScoreCloud product range from DoReMIR. The examiners found his work on unsupervised domain adaptation particularly exciting, noting its potential beyond the immediate application areas of the thesis. 21 Nov 2022: I gave a Distinguished Lecture on Automatic Music Transcription and Music Understanding at McGill University, Centre for Interdisciplinary Research in Music Media and Technology (CIRMMT). 28 Apr 2022: Emir Demirel passed his PhD viva on the topic Deep Neural Networks for Automatic Lyrics Transcription, as part of the MIP-Frontiers project, in collaboration with DoReMIR Music Research. 12 Apr 2022: The New Directions in Digital Jazz Studies project, also known as JazzDAP (Jazz Digital Archive Project), is seeking a research assistant (postdoctoral or predoctoral) for a short-term (4-month) position analysing jazz recordings for main melody, chords and beats. Applications close on 5 May 2022. See advertisement here. 25 Mar 2022: Ruchit Agrawal passed his PhD viva on the topic Towards Context-Aware Neural Performance-Score Synchronisation, as part of the MIP-Frontiers project, in collaboration with Tido Music. 1 Dec 2021: At least 12 PhD studentships available for the Sept 2022 intake of the UKRI Centre for Doctoral Training in AI and Music. Application deadline: 30 Jan 2022. 1 Oct 2021: I was awarded Turing Fellow status by the Alan Turing Institute. 1 Apr 2021: The Journal of the American Musicological Society published a review of the Dig that Lick project by Chris Stover. 16 Dec 2020: Funding announced for a new project in collaboration with the University of Illinois, City University of London, Birmingham City University, the Institute of Jazz Studies at Rutgers University, and the Scottish Jazz Archive: New Directions in Digital Jazz Studies: Music Information Retrieval and AI Support for Jazz Scholarship in Digital Archives. 30 Nov 2020: At least 12 PhD studentships available for the Sept 2021 intake of the UKRI Centre for Doctoral Training in AI and Music. Application deadline: 27 Jan 2021. 14 Sep 2020: 15 students enrol as the second cohort of the UKRI Centre for Doctoral Training in AI and Music. 13 July 2020: Daniel Stoller successfully defends his PhD thesis Deep Learning for Music Information Retrieval in Limited Data Scenarios 20 Apr 2020: Daniel Stoller's paper Seq-U-Net: A One-Dimensional Causal U-Net for Efficient Sequence Modelling is accepted for presentation in the main track at IJCAI-PRICAI 2020. 20 Mar 2020: Francisco Rodríguez-Algarra successfully defends his PhD thesis A Critical Look at the Music Classification Experiment Pipeline: Using Interventions to Detect and Account for Confounding Effects 11 Feb 2020: Saumitra Mishra successfully defends his PhD thesis Interpretable Machine Learning for Machine Listening Jan 2020: funding announced for the Innovate UK Smart Grant (Project 43427) Hookslam: Making Hits with AI, 2020-2021 Dec 2019: 12 PhD studentships available for the Sept 2020 intake of the UKRI Centre for Doctoral Training in AI and Music. Deadline: 31 Jan 2020. Sept 2019: First 12 students enrol in the UKRI CDT in AI and Music July 2019: Funding announced for the Innovate UK Smart Grant (Project 30863) Development of Next-Generation Music Recognition Algorithm for Content Monitoring, in collaboration with Breathe Music Ltd, Nov 2019 - May 2021 April 2019: Dig That Lick project mentioned on Sandy Brown Jazz (scroll down / search for Weimar) 18 Mar 2019: 12 fully-funded PhD positions in Artificial Intelligence and Music starting in Sept 2019. Deadline for applications is 15 April. More details here 21 Feb 2019: Funding announced for the UKRI Centre for Doctoral Training in Artificial Intelligence and Music at Queen Mary University of London (2019-2027). This centre will fund over 70 PhD students spread over 5 cohorts starting each September from 2019. The AIM CDT involves over 20 industry partners and is open to expressions of interest from further prospective partners. PhD studentships for September 2019 start will be advertised in March. 15 Feb 2019: Jiajie Dai successfully defends her PhD thesis Modelling Intonation and Interaction in Vocal Ensembles 16 Jan 2019: Simon Dixon receives the Peter Claricoats Award for service as Director of Graduate Studies and for sustained high-quality research 4 Sep 2018: Launch of a new journal! The Transactions of the International Society for Music Information Retrieval (TISMIR) launched its first issue today. TISMIR is an open-access journal established to complement the widely cited ISMIR conference proceedings and provide a vehicle for the dissemination of the highest quality and most substantial scientific research in music information retrieval. 1 Apr 2018: EU H2020 MSCA ITN project New Frontiers in Music Information Processing (MIP-Frontiers) begins 26 Mar 2018: Adib Mehrabi successfully defends his PhD thesis Vocal Imitation for Query by Vocalisation 1 Mar 2018: Maria Panteli successfully defends her PhD thesis Computational Analysis of World Music Corpora 20 Dec 2017: Zulfadhli Mohamad successfully defends his PhD thesis Estimating Performance Parameters from Electric Guitar Recordings 30 Oct 2017: British Library Labs Research Award recognising \"outstanding and innovative work that has been carried out using the British Library's digital collections and data\" awarded to Maria Panteli, Emmanouil Benetos and Simon Dixon for the project A large-scale comparison of world music corpora with computational tools. 15 Sep 2017: Siying Wang successfully defends her thesis Computational Methods for the Alignment and Score-Informed Transcription of Piano Music, co-supervised by Sebastian Ewert 9 Aug 2017: Postdoctoral research position advertised here for the project Dig that Lick: Analysing large-scale data for melodic patterns in jazz performances . Deadline 15 September 2017. Jul 2017: Announcement of my promotion to Professor with effect from 1 October. 2 May 2017: Funding announced for New Frontiers in Music Information Processing, a Marie Sklodowska-Curie Innovative Training Network which will fund 15 PhD studentships between four universities (Queen Mary, Telecom ParisTech, Universitat Pompeu Fabra, Johannes Kepler University of Linz), three industry beneficiaries (Sony CSL, Roli Ltd, DoReMIR Music Research), and nine partner organisations (Native Instruments, Technicolor, Audionamix, Deezer, Karajan Institute, Wiener Staatsoper, Tido Music, BMAT Licensing, Jamendo). 29 March 2017: Funding announced by the Trans-Atlantic Program Digging into Data Challenge for the project: Dig that Lick: Analysing large-scale data for melodic patterns in jazz performances , a collaboration between Queen Mary University of ",
  "content_length": 92526,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:39"
}