{
  "name": "Simon Lucey",
  "homepage": "https://www.adelaide.edu.au/directory/simon.lucey",
  "status": "success",
  "content": "Staff Directory | Professor Simon Lucey × Search University staff directory Login Professor Simon Lucey Position Director Org Unit Australian Institute for Machine Learning Email simon.lucey@adelaide.edu.au Telephone 831 33495 Location Floor/Room Ground Floor , Australian Institute for Machine Learning Building , Lot 14 View My Researcher Profile Research Interests Simon Lucey Ph.D. is the Director of the Australian Institute for Machine Learning (AIML) and a professor in the School of Computer Science (SCS), at the University of Adelaide. Prior to this he was an associate research professor at Carnegie Mellon University's Robotics Institute (RI) in Pittsburgh USA; where he spent over 10 years as an academic. He was also Principal Research Scientist at the autonomous vehicle company Argo AI from 2017-2022. He has received various career awards, including an Australian Research Council Future Fellowship (2009-2013). Simon’s research interests span computer vision, machine learning, and robotics. He enjoys drawing inspiration from AI researchers of the past to attempt to unlock computational and mathematic models that underlie the processes of visual perception. See a recent talk of mine (YouTube - December 2023) gives a good break down of my current research interestes and directions. Research Funding I have numerous sources of funding from industry and the ARC. Please send me your CV if you are interested in pursuing a PhD or Post-Doc. Publications See my google scholar page for my latest list of publications. The information in this directory is provided to support the academic, administrative and business activities of the University of Adelaide. To facilitate these activities, entries in the University Phone Directory are not limited to University employees. The use of information provided here for any other purpose, including the sending of unsolicited commercial material via email or any other electronic format, is strictly prohibited. The University reserves the right to recover all costs incurred in the event of breach of this policy. Entry last updated: Thursday, 3 Oct 2024 To link to this page, please use the following URL: https://www.adelaide.edu.au/directory/simon.lucey",
  "content_length": 2220,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:45"
}