{
  "name": "Simon Rogers",
  "homepage": "http://www.dcs.gla.ac.uk/~srogers",
  "status": "success",
  "content": "Dr. Simon Rogers Dr. Simon Rogers School of Computing Science, University of Glasgow S123, Sir Alwyn Williams Building, G12 8RZ, UK 0141 330 1649 simon.rogers@glasgow.ac.uk Official University of Glasgow page Biography I'm a senior lecturer in the School of Computing Science at the University of Glasgow. Before starting a permanent post in Glasgow I did a couple of Post Doctoral positions (under Mark Girolami) and prior to that I did my Undergraduate degree (Electrical and Electronic Engineering) and PhD (Machine Learning Techniques for Microarray Analysis, supervisor Colin Campbell) at the University of Bristol. My research involves the development of Machine Learning and Statistical techniques to help with the analysis of complex datasets, particularly within the field of Metabolomics but also other -omics fields, Human-Computer Interaction and Information Retreival. My Metabolomics work is done in collaboration with many people, particularly Glasgow Polyomics (of which I'm an affiliate member). In 2011, Mark Girolami and I published a textbook: A First Course in Machine Learning which you might find useful if you want an introduction to modern (fairly probabilistic) Machine Learning but don't know a great deal of maths. A second edition with additional material (Gaussian Processes, Dirichlet Processes, was published in August 2016. I am always interested in hearing from potential PhD candidates. If any of the research below interests you, please get in touch. If you want to find my office, there are some instructions below. I vary rarely blog, but when I do it is at sirogers.wordpress.com. You can find me on github as sdrogers, my orcid is orcid.org/0000-0003-3578-4477 and if you like Google Scholar, I'm here. I review for many journals and conferences, as well as being an associate editor for PLoS One. I have acted as an internal and external examiner for several PhD theses (in the UK and abroad) and am currently one of the external examiners for the computing science taught masters programmes at the University of Manchester. I currently hold various non-research roles within the School of Computing Science: Graduate School Convenor (aka PG tutor), deputy senior adviser of studies and I'm a member of the College of Science and Engineering's appeals committee. I played a substantial role in the successful Athena Swan bronze application made by the School. Tweets by @sdrogers Research A full list of publications is available at Glasgow Universities online repository, Enlighten. You can also find a large selection of my publications on orcid, as well as a list of funding (my ID is 0000-0003-3578-4477), or Google Scholar. If you would like copies of anything, email me. Computational Metabolomics Latest News: MS2LDA+ is now published in Analytical Chemistry Latest News: Our recent work on the application of text modelling methods to metabolite fragment data has been published in PNAS: Topic modeling for untargeted substructure exploration in metabolomics. We are currently developing an web application to explore the results of this type of analysis: ms2lda.org My main research activities are in the application of machine learning and applied statistical techniques to problems in metabolomics. Metabolomics is the study of the small molecule content of an organism and I'm particularly interested in the analysis of mass spectrometry metabolomics data. Mass Spectrometry allows, in theory, the simultanoues measurement of the abundance of many metabolites but use of this technology is hindered by the difficuly in analysising the data, particularly in identifying the molecules present in the data from the measured masses. Some notable contributions in this area include a method for using the dependencies between metabolites to aid in identification, a probabilistic method for metabolite annotation / identification, and the use of peak groupe to improve alignment and differential expression computation. Currently, I'm working on novel ways of analysing molecular fragmentation data. Much of this work is done in collaboration with Glasgow Polyomics, of which I'm an affiliate member. Other Computational Biology Microarray analysis: The research in my PhD centered around developing Machine Learning techniques to analyse data from cDNA microarrays, including a 2003 paper on the number of arrays needed to be able to classify diseased from healthy samples which is still being cited. I also performed one of the first analyses on combine time series transcriptomic and proteomic data. Parameter inference: I am currently involved in an EPSRC funded project (EP/L020319/1) on parameter inference in mechanistic models of biological systems (with Dirk Husmeier and Maurizio Filippone) where we are interested in using gradient matching to speed up inference in systems of ordinary differential equations (ICML 2016) as well as a BBSRC funded project (BB/L001276/1) on stomatal dynamics with Mike Blatt (plant sciences, Glasgow) and others. Leaukaemia: I co-supervise two PhD students who are using bioinformatics tools to help learn about Chronic Myeloid Leukaemia, with Prof. Tessa Holyoake. Human-Computer Interaction I'm interested in how we can better model the uncertainty in user interactions with a goal towards making better systems. This work began with the work on FingerCloud, which used a particle filter to model the position of the finger in 3D above an array of capacitive sensors. This filter was used to control a map, where the less engaged the user was the more autonomous the map became. We extended this to AnglePose which inferred the pitch and yaw angles of the interacting finger, along with its position. This work was taken forward in Daryl Weir's PhD in which he looked at modelling uncertainty in touch. This started with a UIST paper that used Machine Learning to learn offset models for specific users and ended with a CHI paper demonstrating a keyboard that used both the learned offset and variability for specific users to improve typing performance. The offset work was built upon by Daniel Buschek, who published an interesting study in MobileHCI investigating how offset patterns varied across users and varied for the same user on different devices. With John Williamson, I have been co-supervising Faizuddin M.Noor's PhD on using back of device sensors for implicit interactions. We have shown that it is possible to detect where a user is going to touch a screen before they do so (CHI 2014) and, more recently showed that it is possible to detect user errors due to hand movement and changes in their grip patterns (CHI 2016). Other Information Retreival: Along with Iadh Ounis, I supervised Edwin Thuma's PhD on A semi-automated FAQ retrieval system for HIV/AIDS. Edwin built a system to which users could send an SMS including questions about HIV/AIDS that would attempt to send an answer from a FAQ handbook used by the department of health in Botswana. There were three publications arising from this thesis: Exploiting query logs and field-based models..., Detecting missing content queries..., and Evaluating bad query abandonment... Robotics: With Paul Siebert, I currently supervise Li Sun's PhD on using a robot to manipulate clothing. Older things Code and data for older work can be found at the following links: Metabolomic Sampler Combining mRNA and protein profiles Latent Process Decomposition Kernel Combinations Regulatory Networks Transcription Factor Activity PhD Students Current Students Lorna Jackson Eduardo Gómez Castañeda Alumni Dr. Faizuddin M. Noor Machine learning techniques for implicit interaction using mobile sensors toggle abstract Interactions in mobile devices normally happen in an explicit manner, which means that they are initiated by the users. Yet, users are typically unaware that they also interact implicitly with their devices. For instance, our hand pose changes naturally when we type text messages. Whilst the touchscreen captures finger touches, hand movements during this interaction however are unused. If this implicit hand movement is observed, it can be used as additional information to support or to enhance the users’ text entry experience. This thesis investigates how implicit sensing can be used to improve existing, standard interaction technique qualities. In particular, this thesis looks into enhancing front-of-device interaction through back-of-device and hand movement implicit sensing. We propose the investigation through machine learning techniques. We look into problems on how sensor data via implicit sensing can be used to predict a certain aspect of an interaction. For instance, one of the questions that this thesis attempts to answer is whether hand movement during a touch targeting task correlates with the touch position. This is a complex relationship to understand but can be best explained through machine learning. Using machine learning as a tool, such correlation can be measured, quantified, understood and used to make predictions on future touch position. Furthermore, this thesis also evaluates the predictive power of the sensor data. We show this through a number of studies. In Chapter 5 we show that probabilistic modelling of sensor inputs and recorded touch locations can be used to predict the general area of future touches on touchscreen. In Chapter 7, using SVM classifiers, we show that data from implicit sensing from general mobile interactions is user-specific. This can be used to identify users implicitly. In Chapter 6, we also show that touch interaction errors can be detected from sensor data. In our experiment, we show that there are sufficient distinguishable patterns between normal interaction signals and signals that are strongly correlated with interaction error. In all studies, we show that performance gain can be achieved by combining sensor inputs. Dr. Joe Wandy Bayesian methods for metabolomics toggle abstract Abstract to appear Dr. Daryl Weir Modelling Uncertainity i",
  "content_length": 31212,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:50"
}