{
  "name": "Simone Faro",
  "homepage": "https://www.dmi.unict.it/faro",
  "status": "success",
  "content": "Simone Faro - Home Page . Prof.Simone Faro Ph.D. Professore Associato presso il \t\t\t\tDipartimento di Matematica e Informatica, Università di Catania. Dottorato di Ricerca in Informatica (2004). Laurea in Informatica (2001). Membro del Consiglio del \t\t\t\tDottorato di Ricerca in Informatica, XXXIII-XXXIV-XXXV ciclo. Presidente della Commissione Orientamento del Dipartimento di Matematica e Informatica Coordinatore Scientifico del Progetto PLS (Piano Lauree Scientifiche) dell'Università di Catania per il settore Informatica Guest Editor del Topical Issue String Processing and Combinatorial Algorithms per la rivista Springer Nature Computer Science. Membro del Team Editoriale della rivista internazionale Le Matematiche. Membro del Comitato di Gestione del \t\t\t\tCEA (Centro per i sistemi di elaborazione e le applicazioni scientifiche e didattiche) dell'Università di Catania. Membro della Giunta del Dipartimento di Matematica e Informatica Membro del Gruppo di Coordinamento del Liceo Matematico Interessi di Ricerca Algoritmi per di string-processing, algoritmi di string-matching esatto ed approssimato, simulazione di automi a stati finiti non-deterministici, compressione dei dati ed algoritmi di matching su sequenze compresse, algoritmi combinatorici su grafi, linguistica computazionale. Attività Didattica Programmazione 2 (DMI, 9CFU) Algoritmi (DMI, 6CFU) Introduzione alla Linguistica Computazionale (DISUM, 6CFU) Informatica (DISUM, 9CFU) Abilità Informatiche (DISUM, 3CFU) Pensiero Comptazionale Altri corsi Calendario delle lezioni Calendario degli esami Principali contatti Stanza n.366, Dipartimento di Matematica e Informatica Stanza n.305, Ex Diseur, Dipartimento di Scienze Umanistiche +39 095 738 3053 faro@dmi.unict.it Altri contatti Ricevimento Studenti Articoli Pubblicati Lista delle principali pubblicazioni Lista delle pubblicazioni su DBLP Home page su Google Scholar Pagina su Scopus Articoli pubblicati su PSC Ultimi Articoli su Rivista Fast algorithms for single and multiple pattern Cartesian tree matching, in Theoretical Computer Science, 849 (6): 47-63, by Siwoo Songa, Geonmo Gua, Cheol Ryub, Simone Faro, Thierry Lecroq and Kunsoo Park (2021)Efficient Online String Matching Based on Characters Distance Text Sampling, in Algorithmica 82(11): 3390-3412, by Simone Faro, Francesco Pio Marino and Arianna Pavone (2020)The order-preserving pattern matching problem in practice, in Discrete Applied Mathematics 274: 11-25, by Domenico Cantone, Simone Faro and M. Oguzhan Külekci (2020) Ultimi Articoli su Conferenza Bit-Layers Text Encoding for Efficient Text Processing., in SOFSEM (Doctoral Student Research Forum) pp.13-24, by Domenico Cantone, Simone Faro and Stefano Scafiti (2020)Fast-Insertion-Sort: a New Family of Efficient Variants of the Insertion-Sort Algorithm, in SOFSEM (Doctoral Student Research Forum) pp. 37-48, by Simone Faro, Francesco Pio Marino and Stefano Scafiti (2020) Coding Contest Il Coding Management System del DMI da agosto risiede sul nuovo server ed è accessibile ad un nuovo indirizzo web. Special Issue of Algorithms Special Issue of Algorithms on \"String Matching and Its Applications\", co-edited by Simone Faro and Thierry Lecroq. The deadline for manuscript submissions is 28 February 2019. Go to the web site... The SMART research tool Thierry Lecroq and I present Smart, a tool which provides a standard framework for researchers in string matching. It helps users to test, design, evaluate and understand existing solutions for the exact string matching problem. Moreover it provides the implementation of (almost) all string matching algorithms and a wide corpus of text buffers. Go to the web site... Prossimi Eventi I'm member of the Program Committee of the 23rd International Symposium on String Processing and Information Retrieval (SPIRE 2016), which will take place in Beppu, Japan, October 18-20, 2016. I'm member of the Program Committee of the 20th Prague Stringology Conference (PSC 2016), which will take place in Prague, Czeck Republic, August 29-31, 2016. I'm member of the Organizing Committee of the 7th International Symposium on Games, Automata, Logics, and Formal Verification (GandALF 2016), which will take place in Catania, Italy, September 14-16, 2016.",
  "content_length": 4252,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:53"
}