{
  "name": "Simon Hippenmeyer",
  "homepage": "https://ist.ac.at/research/research-groups/hippenmeyer-group",
  "status": "success",
  "content": "ISTA | Hippenmeyer Group HomeResearchHippenmeyer Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Hippenmeyer Group Genetic Dissection of Cerebral Cortex Development The human cerebral cortex, the seat of our cognitive abilities, is composed of an enormous number and diversity of neurons and glia cells. How the cortex arises from neural stem cells is an unsolved but fundamental question in neuroscience. In the pursuit of mechanistic insights, the Hippenmeyer group genetically dissects corticogenesis at unprecedented single cell resolution using the unique MADM (Mosaic Analysis with Double Markers) technology.The Hippenmeyer group’s current objectives are 1) to establish a definitive quantitative and mechanistic model of cortical neural stem cell lineage progression; 2) to dissect the cellular and molecular mechanisms generating cell-type diversity; 3) to determine the role of genomic imprinting, an epigenetic phenomenon, in cortex development. In a broader context, the group’s research has the ultimate goal to advance the general understanding of brain function and why human brain development is so sensitive to disruption of particular signaling pathways in pathological neurodevelopmental diseases and psychiatric disorders Group Leader Simon Hippenmeyer Professor +43 2243 9000 5101 Simon.Hippenmeyer@ist.ac.at Administrative Support Judit Gazsi Assistant to Professors +43 2243 9000 1209 Judit.Gazsi@ist.ac.at Team Raquel Casado Polanco PhD Student Raquel.CasadoPolanco@ist.ac.at Sophie Gobeil PhD Student sophie.gobeil@ist.ac.at Hakan Kücükdereli Postdoctoral Visiting Scientist Hakan.Kucukdereli@ist.ac.at Osvaldo Miranda Romero Postdoc osvaldo.miranda@ist.ac.at Florian Pauler Research Technician Florian.Pauler@ist.ac.at Fabrizia Pipicelli Postdoc Fabrizia.Pipicelli@ist.ac.at Carmen Streicher Research Technician +43 2243 9000 7434 Carmen.Streicher@ist.ac.at Irene Varela Martínez Postdoc Irene.VarelaMartinez@ist.ac.at Ana Villalba Requena Postdoc Ana.VillalbaRequena@ist.ac.at Current Projects Determine neuronal lineages by clonal analysis | Mechanisms generating cell-type diversity | Probing genomic imprinting in cortex development Publications Miranda O. 2025. Unraveling the role of Pten in cortical stem cell lineage progression using MADM. Institute of Science and Technology Austria. View Yotova I, Proestling K, Pauler F, Rainer L, Kaup L, Heine J, Sandrieser L, Wenzl R, Hudson QJ. 2025. LINC01638 promotes epithelial-to-mesenchymal transition in endometriosis epithelial cells by up-regulating RHOB via HDAC1 suppression. Reproductive Biomedicine Online. 51(3), 104942. View Gao X, Li J-L, Chen X, Ci B, Chen F, Lu N, Shen B, Zheng L, Jia J-M, Yi Y, Zhang S, Shi Y-C, Shi K, Propson NE, Huang Y, Poinsatte K, Zhang Z, Yue Y, Bosco DB, Lu Y, Yang S, Adams RH, Lindner V, Huang F, Wu L-J, Zheng H, Han F, Hippenmeyer S, Stowe AM, Peng B, Margeta M, Wang X, Liu Q, Körbelin J, Trepel M, Lu H, Zhou BO, Zhao H, Su W, Bachoo RM, Ge W. 2025. Reduction of neuronal activity mediated by blood-vessel regression in the brain. Nature Communications. 16, 5840. View Pipicelli F, Villalba Requena A, Hippenmeyer S. 2025. How radial glia progenitor lineages generate cell-type diversity in the developing cerebral cortex. Current Opinion in Neurobiology. 93, 103046. View Bose M, Suresh V, Mishra U, Talwar I, Yadav A, Biswas S, Hippenmeyer S, Tole S. 2025. Dual role of FOXG1 in regulating gliogenesis in the developing neocortex via the FGF signalling pathway. eLife. 13, 101851. View View All Publications ReX-Link: Simon Hippenmeyer Career Since 2019 Professor, Institute of Science and Technology Austria (ISTA)2012 – 2019 Assistant Professor, Institute of Science and Technology Austria (ISTA)2011 – 2012 Research Associate, Stanford University, Palo Alto, USA2006 – 2011 Postdoctoral Fellow, Stanford University, Palo Alto, USA2004 – 2006 Postdoctoral Associate, University of Basel and Friedrich Miescher Institute for Biomedical Research, Basel, Switzerland2004 PhD, University of Basel, Switzerland Selected Distinctions 2016 ERC Consolidator Grant2014 HFSP Program Grant2013 Marie Curie Career Integration Grant2009 – 2011 Fellowship for Advanced Researchers, Swiss National Science Foundation, Bern, Switzerland2007 – 2009 HFSP Long-term Fellowship2006 EMBO Long-term Fellowship2005 Natural Sciences Faculty Prize for the best PhD thesis of the year2004, University of Basel, Switzerland2005 Edmond H. Fischer Prize Additional Information Download CVOpen Hippenmeyer group website Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6960,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:40"
}