{
  "name": "Simon J. E. Taylor",
  "homepage": "https://www.brunel.ac.uk/people/simon-taylor",
  "status": "success",
  "content": "Professor Simon Taylor | Introduction | Brunel University London Skip to Content Home People Professor Simon Taylor Professor Simon TaylorVice Dean Research/Professor Wilfred Brown Building 111 Email: simon.taylor@brunel.ac.uk Tel: +44 (0)1895 265994 Computer Science College of Engineering, Design and Physical Sciences Summary imon J E Taylor is a Professor of Computer Science specialising in Modelling & Simulation and Digital Infrastructures.  He has made many contributions to manufacturing, health care and international development.  He has worked with international consortia (in particular UNICT, WACREN and the UBUNTUNET ALLIANCE) to contribute to the development of National Research and Education Networks in Africa that has impacted over 3 million students and 300 universities. He has also worked with international consortia (in particular Saker Solutions, the University of Westminster, SZTAKI and CloudSME UG) to develop high performance simulation systems that are being used by over 30 European SMEs and large-scale enterprises such as the Ford Motor Company and Sellafield PLC.  He continues to work closely with industry - his work has led to over £30M of savings and new products in industry.  He also contributes to the development of Open Science principles and practice for Africa and for Modelling & Simulation as a field. He has led modules in distributed computing in the Department of Computer Science for many years with high module evaluations scores and is an enthusiastic teacher.  He has also led the development of several postgraduate degrees.  He has supervised over 20 doctoral students, has examined more than 25 doctoral students from across the world and has managed over 15 research fellows. Professor Taylor co-founded and is a former Editor-in-Chief of the Journal of Simulation and the UK Operational Research Society Simulation Workshop Series.  He chaired ACM SIGSIM between 2005-2008 and since then has been an active member of the ACM SIGSIM Steering Committee. He is also the General Chair for the 2025 Winter Simulation Conference. He has chaired international standardisation groups under the Simulation Interoperability Standards Organization and has conducted several organisational review panels (e.g., DSTL) and simulation audits. He is currently the executive chair for the annual Simulation Exploration Experience (https://www.exploresim.com/) and a member of the Computer Simulation Archive steering committee (https://d.lib.ncsu.edu/computer-simulation/).  He has also chaired several conferences and is the General Chair for the IEEE/ACM 2025 Winter Simulation Conference. Interested in the history of computer simulation?  Visit the Computer Simulation Archive hosted by NCSU and hear talks from some of the pioneers in computer simulation. Responsibility Vice Dean Research (College of Engineering, Design and Physical Sciences) Module Leader CS3004 Network Computing Co-director Modelling and Simulation Research Group (Computer Science) Adjunct Director Smart Technology Advancements for Health and Rehabilitation (STAHR) Centre Newest selected publications Robinson, S. and Taylor, SJE. (2022) 'Celebrating the 10th simulation workshop: The story of the conference series'. Journal of Simulation, 17 (5). pp. 524 - 531. ISSN: 1747-7778 Open Access Link Journal article Mustafee, N., Katsaliaki, K. and Taylor, SJE. (2021) 'Distributed Approaches to Supply Chain Simulation: A Review'. ACM Transactions on Modeling and Computer Simulation, 31 (4). pp. 1 - 31. ISSN: 1049-3301 Open Access Link Journal article Anagnostou, A. and Taylor, S. (2020) 'Can Open Science Change the World?'. IEEE Computer, 53 (10). pp. 13 - 22. ISSN: 0018-9162 Open Access Link Journal article Mahmood, I., Arabnejad, H., Suleimenova, D., Sassoon, I., Marshan, A., Serrano, A., Louvieris, P., Anagnostou, A., Taylor, S., Bell, D. and Groen, D. et al. (2020) 'FACS: A geospatial agent-based simulator for analyzing COVID-19 spread and public health measures on local regions'. Journal of Simulation, 16 (4). pp. 355 - 373. ISSN: 1747-7778 Open Access Link Journal article Ghorbani, M., Swift, S., Taylor, SJE. and Payne, AM. (2020) 'Design of a flexible, user friendly feature matrix generation system and its application on biomedical datasets'. Journal of Grid Computing, 18 (3). pp. 507 - 527. ISSN: 1570-7873 Open Access Link Journal article More publications(94)",
  "content_length": 4408,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:41"
}