{
  "name": "Simon Harper",
  "homepage": "https://www.research.manchester.ac.uk/portal/simon.harper.html",
  "status": "success",
  "content": "Simon Harper - Research Explorer The University of Manchester Simon Harper Prof Professor, Human Computer Systems https://orcid.org/0000-0001-9301-5049 Personal profile Further informationKeywordsHuman Computer Interaction (HCI / CHI)Human FactorsHypertext / HypermediaInformation SystemsWeb AccessibilityWeb ScienceWorld Wide WebBiographyExtended BiographyI founded the Web4All Conference Series (now in its 11th Edition) and organised the first four (2004-2007 inc.) as General Chair; Steering Committee - International ACM SIGACCESS Conference on Computers and Accessibility; Steering Committee - International Cross-Disciplinary Conference on Web Accessibility; and Steering Committee - International ACM Conference on Hypertext and Hypermedia. Programme Chair for ACM ASSETS (2006); Submissions Chair for the WWW Conference (2006) and Accessibility Chair for the 2012 edition; ACM Student Research Competition Grand Finals Judge (2012), General Chair for ACM Hypertext (2007) and ACM ASSETS (2008) and is also a member of the steering committee for these two conferences. I have served on the programme committees, doctoral consortium panels, and review panels for a number of international conferences including ACM HT, WWW, ISWC, ACM CHI, UIST, ACM ASSETS, and ACM SAC. I have guest edited the New Review of Hypermedia and Multimedia; Journal of Web Engineering; Journal of Disability and Rehabilitation, and Universal Access in the Information Society. He currently reviews for ACM Transactions on Computer Human Interaction, ACM Transactions on the Web, Elsevier Journal of Web Semantics, and IEEE Internet Computing. I have delivered invited talks to Loughborough University HCI 'GuruLecture' (2013), the Technical Superior Insitute, LaSIGE, Lisbon, Portugal (2012); Informatika Fakultatea, UPV-EHU, Spain (2011); Fujitsu Labs Europe (2010); IBM Tokyo Research Laboratory (2009); and keynoted the WebMedia conference (2008). I am also a recipient of the ACM Doug Engelbart prize (2000), the ADDW IBM Research prize (2005), the Microsoft Web Accessibility Judges Award at the W4A (2008), and the Best Paper Award at W4A (2010). My last book `Web Accessibility: A Foundation for Research' has for two years ranked in the Amazon - Human Computer Interaction top 40, and in the top 10 for six months after it's publication.Other researchImpact Ranking and ReachImpact (circa August 2013): Metrics for my full 11 year career can be summarised as follows: Papers — 176: Citations — 1229: Years — 15: Cites/year — 81.93: Cites/paper — 6.98/2.0/0: Cites/author — 450.33: Cites/author/year — 30.02: Papers/author — 74.01: Authors/paper — 2.78/3.0/3: h-index — 19: g-index — 29: hc-index — 14: hI-index — 6.12: hI-norm — 11: hI: annual — 0.73: AWCR — 191.75: AW-index — 13.85: AWCRpA — 70.17: e-index — 18.55: hm-index — 11.08. Ranking (circa August 2014): Both Google Scholar and Microsoft Research rank me first for Web Accessibility, in the top three for Accessibility, and in the top 0.5% for Human Computer Interaction (HCI) and WWW; while Scholarometer ranks me 38th for HCI (internationally) using their career and domain normalised hs-index measure. Further, the University rates me as REF 4* with an h-index of 20 and an i10 index of 42 (both excellent for Web Accessibility, Accessibility, and HCI). I have been successful in 15 grants since 2007 resulting in total funding over six years of 1.45 Million. Reach (circa August 2014): Finally, ACM Bibliometrics indicate the scope and influence my work has and of the 50 papers available for download I have achieved: Publication years 1999-2013 Available for download50 Downloads (6 Weeks)283 Downloads (12 Months)1,959 Downloads (cumulative)21,283 Average downloads per article425.66 Average citations per article4.95 My groupResearch Group(s)Data Science InstituteIAMInformation ManagementMy groupResearch GroupsInformation ManagementWeb Ergonomics LabOther researchResearch IdentificationACM: http://dl.acm.org/author_page.cfm?id=81100139139Google: http://scholar.google.co.uk/citations?user=SQEdResAAAAJORC-ID: http://orcid.org/0000-0001-9301-5049Research Gate: https://www.researchgate.net/profile/Simon_Harper/TeachingTeachingI believe that only by having a strong and leading research culture can we also ensure 'deep' and successful teaching. Not the superficial learning of facts and figures but the conveyance of a deeper understanding of the subject along with an ability and requirement for students to think. Fundamentally, I am committed to undertaking and disseminating this research based teaching and maintaining a central position in the delivery of high quality professional teaching. All my teaching are highly coupled with current thinking, and up-to-date industrial practice. Taking any of them will require a high degree of self discipline and high work through-put. This isn't intended to put you off; you'll learn a lot, and I'll teach you how its normally done in the real world (I was a consultant for seven years).BiographyI am an experimental Computer Scientist working in Human Computer Interaction and Information Systems as well as being a Senior Lecturer in Computer Science, a Senior Member of the Association for Computing Machinery (ACM), and Research Lead for the Web Ergonomics Laboratory here at the University of Manchester. My particular interest is in Web Accessibility with specific regard to profound blindness and visual disability. My work is centred around building computational models of human behaviour and includes understanding, predicting, and influencing a user’s interactions and flow through interfaces and information, while taking into account neurophysiological, cognitive, behavioural, perceptual, and technological factors. In this case, my contributions lay along two paths. The first investigates ‘facilitating access and enhancing interactive Web behaviours', while the second focuses on ‘understanding, evaluating, and modifying the Web experience'. I am Chair of the ACM Special Interest Group on Hypertext, Hypermedia and the Web (2011--present); Chair of the ACM SGB Task Force on Full Inclusion; Chair -- World Wide Web Consortium (International Standards Body for the Web), Research and Development Working Group (2010--Present); and Member of the World Wide Web Consortium Web Accessibility Initiative -- responsible for all Web accessible standards -- (2010--Present); Invited Expert -- RCUK EPSRC Digital Economy Inclusion Cluster (2009-2011); Invited Expert -- European Commission Information Society and Media Directorate-General ICT for Inclusion, eAccessibility and Assistive Technology, (2011); Invited Expert -- EU Challenge 7 ICT 2009 Coordination Action in R\\&D in Accessible and Assistive ICT (Inclusive Human-Machine Interaction), External Examiner for all Computer Science Programmes at the University of Abertay; Consultant -- Fujitsu Labs Europe (2006-2010); Reviewer for the Natural Sciences and Engineering Research Council of Canada, to review for grants in Computer Science (2007-Present); Responsive Mode Panel Member for the UK Engineering and Physical Science Research Council (EPSRC), 2012 -- Reviewer since 2008; Reviewer for the NWO, the Dutch National Research Council, to review for grants in Computer Science (2006-Present); Editorial Board Member of Journal of Interaction Science (Springer); Editorial Board Member of ACM Transactions in Accessible Computing (ACM); Editorial Board Member of PLoS One; Research Lead, Eclipse ACTF Project. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Areas of expertiseQA75 Electronic computers. Computer scienceQA76 Computer softwareResearch Beacons, Institutes and PlatformsChristabel Pankhurst InstituteHealthier FuturesInstitute for Data Science and AIDigital FuturesKeywordsDigital healthDiabetes Fingerprint Dive into the research topics where Simon Harper is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Web Page Computer Science 100% Visually Impaired User Computer Science 49% Web Accessibility Computer Science 48% Internet Computer Science 43% Ontology Computer Science 24% screen reader Computer Science 23% web user Computer Science 20% Annotation Computer Science 20% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 72 Article 51 Conference contribution 6 Commissioned report 5 Chapter 15 More 4 Paper 3 Meeting Abstract 2 Review article 2 Software 2 Other contribution 1 Book 1 Preprint Research output per year Research output per year A Longitudinal Multimodal Dataset of Type 1 DiabetesAlsuhaymi, A., Bilal, A., Gasca Garcia, D., Kongdee, R., Lubasinski, N., Thabit, H., Nutter, P. & Harper, S., 7 Aug 2025, In: Scientific Data. 12, p. 1-17 17 p., 1379.Research output: Contribution to journal › Article › peer-review Open Access Blood Glucose Level 100% Algorithm Development 50% Intensity Level 50% Collected Data 50% Coefficient of Variation to Assess the Reproducibility of Meal-Induced Glycaemic Responses.Lubasinski, N., Thabit, H., Nutter, P., Petrescu, D. & Harper, S., 2025, In: JMIR diabetes.Research output: Contribution to journal › Article › peer-review Glucose interpretation meaning and action: enhancing type 1 diabetes decision-making with textual descriptionsKongdee, R., Parsia, B., Thabit, H. & Harper, S., 2025, In: Therapeutic Advances in Endocrinology and Metabolism. 16, p. 20420188251362089Research output: Contri",
  "content_length": 12641,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:41"
}