{
  "name": "Simon Kent",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/simon.kent",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Simon KentFaculty Director for Higher and Degree Apprenticeships, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C12 School of Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKSimon.Kent@nottingham.ac.uk BiographySimon is an Associate Professor in the School of Computer Science. He teaches on the the Data Science Apprenticeship in the Faculty of Science and is the Faculty Director for Higher and Degree Apprenticeships. Before joining the University of Nottingham, he worked at Brunel University London where he was Director of Learning and Teaching in the Department of Computer Science. Before becoming an academic, Simon also worked a Senior Consultant and Software Architect in the Financial Services Industry in London and Continental Europe. Expertise SummarySimon's current focus is on Innovation in Learning and Teaching. This includes the use of technology in education. Simon co-lead the introduction of Bring Your Own Device (BYOD) Digital Examinations to Brunel University London.Recent Publications AMANDA HARVEY, SIMON KENT, ALICE LA ROOY, MARIANN RAND-WEAVER and DAVID TREE, 2021. A tale of two CATES – improving assessment through collaboration. In: DEBBIE TOLSON, NICOLA WATCHMAN SMITH, DAWNE IRVING-BELL and MILES WEAVER, eds., The CATE Collection: Together in Collaborative Educational Leadership Advance HE. 48-61FITZHARRIS, ROBYN and KENT, SIMON, 2020. Adoption of Bring-Your-Own-Device Examinations and Data Analytics. In: Adoption of Data Analytics in Higher Education Learning and Teaching Springer. 327-348AHMI, AIDI and KENT, SIMON, 2013. The utilisation of generalized audit software (GAS) by external auditors Managerial Auditing Journal. 28(2), 88-113GULLIVER, STEPHEN R and KENT, SIMON, 2013. Higher education: Understanding the impact of distance learning mode on user information assimilation and satisfaction In: Proceedings of the ITI 2013 35th International Conference on Information Technology Interfaces. 199-204 View all publications AMANDA HARVEY, SIMON KENT, ALICE LA ROOY, MARIANN RAND-WEAVER and DAVID TREE, 2021. A tale of two CATES – improving assessment through collaboration. In: DEBBIE TOLSON, NICOLA WATCHMAN SMITH, DAWNE IRVING-BELL and MILES WEAVER, eds., The CATE Collection: Together in Collaborative Educational Leadership Advance HE. 48-61FITZHARRIS, ROBYN and KENT, SIMON, 2020. Adoption of Bring-Your-Own-Device Examinations and Data Analytics. In: Adoption of Data Analytics in Higher Education Learning and Teaching Springer. 327-348AHMI, AIDI and KENT, SIMON, 2013. The utilisation of generalized audit software (GAS) by external auditors Managerial Auditing Journal. 28(2), 88-113GULLIVER, STEPHEN R and KENT, SIMON, 2013. Higher education: Understanding the impact of distance learning mode on user information assimilation and satisfaction In: Proceedings of the ITI 2013 35th International Conference on Information Technology Interfaces. 199-204MCVEAN, ANDREW, KENT, SIMON, BAKANOV, ALEXEI, HOBBS, TOM and ANDERSON, RHONA, 2012. Development and validation of'AutoRIF': software for the automated analysis of radiation-induced foci Genome integrity. 3(1), 1ALLAN TUCKER, STEPHEN SWIFT, STEVE COUNSELL, SIMON, ROBERT TURNER, 2010. Data Mining the Millennium Seedbank at Kew In: Industrial Conference on Data Mining - Workshops 2010. 85-94PAYNE, ANNETTE, KENT, SIMON and CARABLE, OPALYN, 2008. DEVELOPMENT AND EVALUATION OF A VIRTUAL LABORATORY: A SIMULATION TO ASSIST PROBLEM BASED LEARNING KENT, SIMON, BROADBENT, PETER, WARREN, NIGEL and GULLIVER, STEPHEN R, 2008. On-demand hd video using jini based grid In: 2008 IEEE International Conference on Multimedia and Expo. 1045-1048JOHNSON, ROBERT and KENT, SIMON, 2007. Designing universal access: web-applications for the elderly and disabled Cognition, Technology & Work. 9(4), 209-218JOHNSON, ROBERT and KENT, SIMON, 2007. Integration of ASP offerings: the perspective of SMES In: IMSA'07 IASTED European Conference on Proceedings of the IASTED European Conference: internet and multimedia systems and applications. GHINEA, G, KENT, S, FRANK, AO and CHANA, GS, 2007. Visualization of Back Pain Data—A 3-D Solution Information Technology in Biomedicine, IEEE Transactions on. 11(5), 595-597KENT, SIMON and PATEL, NAYNA, 2006. Artificial intelligence makes computers lazy PATEL, NAYNA, KENT, SIMON and RAI, SARUNJIT S, 2004. The use of IT to increase nutritional awareness in young children Journal of Computing and Information Technology. 12(4), 279-286JURIC, RADMILA, KENT, SIMON, KULJIS, JASNA and PAUL, RAY J, 2004. Simulation education with web-based discrete event simulation models In: Web-Based Education: Proceedings of the IASTED International Conference(WBE-2004). NYONGESA, HO, KENT, S and O'KEEFE, R, 2001. Genetic programming for anti-air missile proximity fuze delay-time algorithms Aerospace and Electronic Systems Magazine, IEEE. 16(1), 41-45KENT, S and STEWART, R, 2000. Evolutionary algorithms: a tool for addressing problems which humans cannot solve Cognition, Technology & Work. 2(1), 35-49KENT, SIMON, 1999. Evolutionary Approaches to Robot Path Planning ELLIOT, C, KENT, S, HAMMOND, P, DRACOPOULOS, D, DOWNER, MC and SPEIGHT, PM, 1997. A comparison of artificial intelligence techniques for the identification of people at high risk of oral cancer In: 44th Annual General Meeting of the British Society for Dental Research. DRACOPOULOS, DIMITRIS C and KENT, SIMON, 1997. Genetic programming for prediction and control Neural Computing & Applications. 6(4), 214-228DRACOPOULOS, DIMITRIS C and KENT, SIMON, 1996. Bulk synchronous parallelisation of genetic programming In: International Workshop on Applied Parallel Computing. 216-226KENT, SIMON, 1996. Diagnosis of Oral Cancer using Genetic Programming KENT, S and DRACOPOULOS, D, 1996. Bulk synchronous parallelisation of genetic programming DRACOPOULOS, DIMITRIS C and KENT, SIMON, Bulk Synchronous Parallelisation of Genetic Applied parallel computing: industrial strength. 216-226NYONGESA, HO, KENT, S and O’KEEFE, R, Proximity Fuze Delay-Time Algorithms Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 7036,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:43"
}