{
  "name": "Simon S. Lam",
  "homepage": "https://www.cs.utexas.edu/users/lam",
  "status": "success",
  "content": "Simon S. Lam Simon S. Lam (林善成) Regents Chair Emeritus in Computer Science #1 Department of Computer Science The University of Texas at Austin2317 Speedway, Stop D9500Austin, Texas 78712-1757 email: lam at cs dot utexas dot edu phone: 512 471 9531 fax: 512 471 8885 office: GDC 6.418 Internal Mail Code: D9500 Biography in Wikipedia Major Awards Biographical sketch Curriculum Vitae (pdf) Networking Research Laboratory     Publications 9/26/2023 Simon S. Lam was inducted into the Internet Hall of Fame for inventing secure sockets in 1991 and implementing the first secure sockets layer, named SNP, in 1993. Computer Scientist inducted into the Internet Hall of Fame Research contributions with the most useful applications: 1. Invention of secure sockets and prototype implementation of the first secure sockets layer (SNP) in 1993 for Internet applications (Wikipedia) --This work was published and presented in the 1994 USENIX Summer Technical Conference.  Subsequent secure sockets layers (SSL and TLS), re-implemented several years later using the same architecture and key ideas first presented in SNP, enabled secure e-commerce on WWW. TLS is now also widely used to secure email and other Internet applications.  For this contribution, Professor Lam and three students in his research project won the 2004 ACM Software System Award. He was elected to National Academy of Engineering in 2007 and inducted  into the Internet Hall of Fame in 2023. 2. Invention of atomic predicates and algorithms for scalable network verification (Software Downloads: networks without packet transformers, networks with packet transformers) -- This work has been re-implemented by Google for verifying its virtual private clouds. (The above download links have been disabled due to too much spam.) 2012 IEEE ICNP Keynote on Greedy Routing with Guaranteed Delivery and Low Stretch powerpoint file Interview in the textbook Computer Networking by Kurose and Ross (circa 2008) pdf Courses taught: CS 356 (Fall 2017) CS 396M (Spring 2017) Some former doctoral students (in order of graduation from UT-Austin) A. Udaya Shankar (1982), Professor of Computer Science, University of Maryland at College Park C. Edward Chow (1985), Professor of Computer Science, University of Colorado at Colorado Springs Kenneth L. Calvert (1991), IEEE Fellow, Gartner Group Endowed Chair in Network Engineering, Department of Computer Science, University of Kentucky (previous position: Director, Directorate for Computer and Information Science and Engineering, National Science Foundation, 2016-2019). Thomas Y. C. Woo (1994), IEEE Fellow, Bell Labs Fellow; Head, Scalable Data Processing, Nokia Bell Labs Geoffrey G. Xie (1996), Professor of Computer Science, Naval Postgraduate School, Monterey, CA David K. Y. Yau (1997), Professor of Information Systems, Singapore University of Technology and Design (previous position: Associate Professor of Computer Science, Purdue University) Y. Richard Yang (2001), Professor of Computer Science, Yale University Min Sik Kim (2005), Assistant Professor of Computer Science, Washington State University Chen Qian (2013), Professor of Computer Science and Engineering, UC Santa Cruz Supervisor of Simon Lam's doctoral dissertation (1974) Leonard Kleinrock, Distinguished Professor, UCLA",
  "content_length": 3297,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:50"
}