{
  "name": "Simone Aonzo",
  "homepage": "https://simoneaonzo.it",
  "status": "success",
  "content": "$ whoami - Simone Aonzo aka Packmad Simone Aonzo, PhD ~ Malware Hunter~ Assistant Professor~ Coffee fueled paper writer Follow Work Twitter GitHub Linkedin Medium Email Hello and welcome! My name is Simone Aonzo, but online I am also known as packm(a|4)d. I am an assistant professor at the Eurecom graduate school and research center, located in the Sophia Antipolis technology park on the French Riviera. I work in the Software and System Security (S3) Group, and my research areas are Mobile (Android) system security Malware analysis (Android and Windows) Human studies in security processes (Applied) Artificial Intelligence Phishing My publications are listed here. I have contributed to the academic community by serving on the program committees of conferences such as USENIX Security and RAID, and as a reviewer for ACM TOPS. As for teaching, I have two courses. A basic one, “Introduction to Cybersecurity”, and an advanced one, “Reverse Engineering Malware”. In the spirit of open source, all my course material is publicly available here. Beyond academia, I co-founded ThreatNemesis, a cybersecurity startup specializing in Android sandboxing technology - based on years of extensive research. Personal life I’m Italian, and I was born in 1988 in Savona. I studied, lived, and worked for many years in Genova. I have mixed feelings about this city, but it is undoubtedly one of the most charming cities I’ve ever seen [video]. At the moment, I live in Antibes, France. So I always woke up with the smell of the sea, I just can’t get rid of it! I’m a father of twins, Francesco and Alessandro, born in 2010. I have discovered a new world through their eyes. In my opinion, having children is the most difficult, but also, without a doubt, the most rewarding experience. I was a pro kickboxing K-1 fighter until 2015. I won two belts: amateur European Champion and professional Italian Champion [video]. I am still training, I have no intention to stop, but only to eat Italian food without getting fat! 🙂 I have a lot of hobbies, depending on the season (and sometimes I sleep): “Mental riddles”, like Capture the Flag and board games Sports: boxing, running, swimming, skiing, kayaking Motorbike trips (I own a Ducati Monster 695) Watching movies Reading books Chess (awful player)",
  "content_length": 2293,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:51"
}