{
  "name": "Sin'ichi Satoh",
  "homepage": "http://research.nii.ac.jp/~satoh",
  "status": "success",
  "content": "Home Page of Shin'ichi Satoh Shin'ichi Satoh National Institute of Informatics 2-1-2 Hitotsubashi, Chiyoda-ku, Tokyo 101-8430, Japan tel:+81-3-4212-2527, fax:+81-3-4212-2120 Email: satoh at nii.ac.jp My Japanese Page Satoh-lab page Publications DBLP Google Scholar ResearchGate Researchmap Research Group Members Shin'ichi Satoh, Group leader Duy-Dinh Le, Associate Professor Benjamin Renoust, JSPS/JFLI Postdoctoral Fellow Yusuke Matsui, Project Researcher Yasuhide Mori , PhD candidate, The Graduate University for Advanced Studies (SOKENDAI) / Hitachi Chien-Quang Le, PhD candidate, The Graduate University for Advanced Studies (SOKENDAI) Yusuke Uchida, PhD candidate, The University of Tokyo / KDDI Masaya Murata, PhD candidate, The University of Tokyo / NTT Shuhei Tarashima, PhD candidate, The University of Tokyo / NTT Ryota Hinami, PhD candidate, The University of Tokyo Shinnosuke Oshima, Master Student, The University of Tokyo Kei Ito, Master Student, The University of Tokyo Fan Yang, Master Student, The University of Tokyo Norihito Yanai, Master Student, The University of Tokyo Ngoc Thi Bao Nguyen, NII Internship student (Feb.-May 2016), University of Information Technology, VNU-HCM, Vietnam. Nam Van Hoang, NII Internship student (Mar.-Aug. 2016), MICA, Vietnam. Mehran Khodabandeh, NII Internship student (Mar.-Jun.. 2016), Simon Fraser University, Canada. Karla Andrea Trejo Ramiírez, NII Internship student (Mar.-Aug.. 2016), Universitat Politècnica de Catalunya, Spain. Yumi Awano, secretary Past Members João Renato Kavamoto Fayad, Project Researcher (Nov. 2014-Mar. 2016) Deming Zhai, Project Researcher (Nov. 2014-Feb. 2016) Sebastien Poullot, Visiting Researcher (Apr.-Jun. 2009) , Project Researcher (Oct. 2009-Dec. 2011, 2014), JSPS JFLI Postdoctoral Fellow (2012-2013) Cai-Zhi Zhu, Research Assistant Professor (2010-2014) Xiaomeng Wu, Project Researcher (2007-2013) Reiko Hamada, Project Researcher (-Oct. 2012) Bertrand Nouvel, Postdoctoral Fellow, JFLI, CNRS Jean Martinet, JSPS Postdoctoral fellow (Nov. 2005-Nov. 2007) Xiao Zhou, Visiting Researcher (Apr. 2010 - Mar. 2012) Tran Thi Thanh Hai, MOU invited researcher (Mar. 2010-Jun. 2010), MICA Center, Vietnam. Jan van Gemert, MOU invited researcher (Aug. 2008), ENS Nagul Cooharojananone, MOU invited researcher (Feb.-May 2008), Chulalongkorn University Alexis Joly, Visiting Researcher (Jul. 2005), INRIA Nizar Grira, Visiting Researcher (Nov.-Dec. 2004, Sep.-Oct. 2005), INRIA Marin Ferecatu, Visiting Researcher (Nov.-Dec. 2004), INRIA Siriwat Kasamwattanarote, PhD, The Graduate University for Advanced Studies (SOKENDAI) (Mar. 2016) Sang L. Phan, PhD, The Graduate University for Advanced Studies (SOKENDAI) (Sep. 2015) Ngo Duc Thanh, PhD, The Graduate University for Advanced Studies (SOKENDAI)   (-Sep. 2013) Masaki Takahashi , PhD, The Graduate University for Advanced Studies (SOKENDAI) / NHK STRL (- Mar. 2012) Molin Du, The Graduate University for Advanced Studies (SOKENDAI) Fuminori Yamagishi, The University of Tokyo / Project Engineer Masanori Sano, PhD, The Graduate University for Advanced Studies (SOKENDAI) (-Mar. 2009) / NHK STRL Tomoko Kajiyama, PhD, The Graduate University for Advanced Studies (SOKENDAI) (-Mar. 2007) Masao Takimoto, PhD, The University of Tokyo (-Mar. 2007) Chuan Yu,The University of Tokyo Tatsuya Sugimoto, Master Student, The University of Tokyo (Apr. 2014-Mar. 2016) Shunsuke Tsukatani, Master Student, The University of Tokyo (Apr. 2014-Mar. 2016) Hiroaki Yoshimatsu, Master Student, The University of Tokyo (Apr. 2013-Mar. 2015). Tai Nguyen Huu, NII Internship student (Nov. 2014-Apr. 2015), Hanoi University of Science and Technology (HUST), Vietnam. Theodore Boyd, NII Internship student (Mar.-Jul. 2015), Imperial College London, UK. Mehran Khodabandeh, NII Internship student (Feb.-Aug.. 2015), Simon Fraser University, Canada. Leslie Wöhler, NII Internship student (Mar.-Sep. 2015), Technische Universität Barunschweig, Germany. Amaia Salvador Aguilera, NII Internship student (Mar.-Jun. 2015), Universitat Politècnica de Catalunya, Spain. Wen-Feng Cheng, NII Internship student (Aug 2015-Feb. 2016), National Taiwan University, Taiwan. Tien Van Do, NII Internship student (Oct.. 2015-Apr. 2016), VNU-HCM, Vietnam. Runze Li, NII Internship student (Dec. 2015-Mar. 2016), University of Melbourne, Australia. Eduardo Marques, NII Internship student (Jan.-Apr. 2015), INESTEC, Portugal. Nitipat Sirikuntamat, NII Internship student (Sep. 2014-Feb. 2015), Chulalongkorn University. Wen-Yu Lee, NII Internship student (Sep. 2014-Feb., 2015), National Taiwan University. Xiaopeng Yang, Internship student (Sep. 2014-Feb., 2015), Institute of Computing Technology (ICT), Chinese Academy of Sciences (CAS), China. Merlin Zhang, NII Internship student (Mar.-Aug. 2014), NICTA, Australia Loi Mai Dinh, NII Internship student (Aug.-Nov. 2014), Hanoi University of Science and Technology (HUST), Vietnam. Nguyen, Duy Khanh, NII Internship student (Mar.-Aug. 2014), University of Information Technology, Vietnam Nguyen, Vinh Tiep, NII Internship student (Mar.-Aug. 2014), University of Science, Vietnam Nguyen, Phuong Anh, NII Internship student (Mar.-Aug. 2014), University of Information Technology, Vietnam Hai Ngoc Pham, NII Internship student (Aug. 2013-Feb. 2014), Hanoi University of Technology, Vietnam. Siyuan Chen, NII Internship student (Sep. 2013-Mar. 2014), NICTA, Australia. Yu-Hui Huang, NII Internship student (Jul. 2013-Jan. 2014), RWTH Aachen University, Germany Tien Dung Mai, NII Internship student (Mar.-Aug. 2013), Vietnam National University, HCMC Waqar Shahid Qureshi, NII Internship student (Jan.-May, 2013), Asian Institute of Technology Che-Chun Lee, NII Internship student (Feb.-Jul., 2013), National Taiwan University Ana Garcia Del Molino, NII Internship student (Mar.-Sep. 2013), Universitat Politecnica de Catalunya, Spain Minh Duc Nguyen, YES Internship student (Mar.-Jun. 2013), University of Engineering and Technology, Vietnam National University, Hanoi Akaraphan (Jack) Janetheerapong, NII Internship student (Oct. 2012-Mar. 2013), Chulalongkorn University Hoang Vu Nguyen, NII Internship student (Aug. 2012-Jan. 2013), Vietnam National University, HCMC Xiaofeng (Akatsuki) Liu, NII Internship student (Sep.-Nov. 2012), Tongji University Hao Lu, NII Internship student (Jun.-Aug. 2012), Indiana University Nhan Duong Chi, NII Internship student (Feb. 2012-Aug. 2012), University of Sciences, Ho Chi Minh City, Vietnam. Worapan Kusakunniran, NII Internship student (Mar. 2012-Aug. 2012), NICTA, Australia. Ferran Simon Cabrera, NII Internship student (Feb. 2012-Aug. 2012), Universitat Politecnica de Catalunya, Spain. Gary Mialaret, Internship student (Apr. 2012-Aug. 2012), Ecole Polytechnique, France. Bor-Chun (Sirius) Chen, MOU Internship student (Apr. 2012-Jul. 2012), National Taiwan University. Siriwat Kasamwattanarote, NII Internship student (Jan. 2012-Jun. 2012), Chulalongkorn University. Pakpoom Tanapichet, NII Internship student (Jan. 2012-Jun. 2012), Chulalongkorn University. Junaid Baber, NII Internship student (Jun. 2011-Apr. 2012), Asian Institute of Technology, Thailand. Sang L. Phan, NII Internship student (Aug. 2011-Feb. 2012), University of Natural Sciences, Ho Chi Minh City, Vietnam. Patprapa Tunkpien, NII Internship student (Sep. 2011-Mar. 2012), Chulalongkorn University. Yan Yang, NII Internship student (Dec. 2011-Mar. 2012), NICTA, Australia. Lam Quang Vu, MOU Internship student (Jul. 2011-Sep. 2011), University of Natural Sciences, Ho Chi Minh City, Vietnam. Shanshan Zhang, NII Internship student (Jun. 2010.-Sep. 2010), Tongji University Hung Thanh Vu, NII Internship student (Aug. 2010-Jan. 2011), University of Natural Sciences, Ho Chi Minh City, Vietnam. Hiep Hoang Van, NII Internship student (Aug. 2010-Dec. 2010), Hanoi University of Technology, Vietnam. Dinh Thang, NII Internship student (Sep. 2010-Feb. 2011), University of Natural Sciences, Ho Chi Minh City, Vietnam. Charly Collin , MOU Internship student (Jun.-Sep. 2010), IRISA, France. Tran Ngoc Trung, NII Internship student (Mar. 2010-Aug. 2010), University of Natural Sciences, Ho Chi Minh City, Vietnam. Narongsak Putpuek, NII Internship student (Nov. 2009.-Mar. 2010), Chulalongkorn University Nan Dong , NII Internship student (Jan. 2010.-Mar. 2010), Tongji University Nobuyuki Morioka, NII Internship student (Jul. 2009-Jan. 2010), NICTA, Australia. Jie Xu , NII Internship student (Sep. 2009-Feb. 2010), NICTA, Australia. Miao Xu, NII Internship student (Jul.-Sep. 2009), University of Washington, USA. Julien Fayolle, MOU Internship student (May-Sep. 2009), IRISA, France. Phong Vo Dinh , NII Internship student (Mar.-Aug. 2009), University of Natural Sciences, Ho Chi Minh City, Vietnam. Venkata Gopal Edupuganti, NII Internship student (Jun.-Aug. 2009), New Jersey Institute of Technology, USA. Tuan Hue Thi, NII Internship student (Mar.-Jun. 2009), NICTA, Australia. Gunawan Herman , NII Internship student (Mar.-Jun. 2009), NICTA, Australia. Nguyen Ngoc Thao, NII Internship student (Jan.-Jul. 2009), University of Natural Sciences, Ho Chi Minh City, Vietnam. Sheetal Neeraj Rajgure, NII Internship student (May-Aug. 2008), New Jersey Institute of Technology Narongsak Putpuek, NII Internship student (Dec. 2007.-May 2008), Chulalongkorn University Ngo Duc Thanh, NII Internship student (Aug. 2007-Feb. 2008), University of Natural Sciences, Ho Chi Minh City, Vietnam. Lila Yutthana, NII Internship student (Mar.-Sep. 2007), Chulalongkorn University Kittipong Thanasoontornler, NII Internship student (Oct.-Dec. 2006), Chulalongkorn University Stephane Ayache, NII Internship student (Apr.-Aug. 2005, Dec. 2005-Jun. 2006), INPG Hangzai Luo, MOU Internship student (Sep.-Dec. 2005), University of North Carolina at Charlotte Mako Taki, secretary Yumi Awano, secretary Akiko Kameno, secretary Research Topics Video Indexing and Understanding Detection of Important Segments in Cooking Videos, Reiko Hamada, Shin'ichi Satoh, ",
  "content_length": 14152,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:56"
}