{
  "name": "Sinan Kalkan",
  "homepage": "http://www.kovan.ceng.metu.edu.tr/~sinan",
  "status": "success",
  "content": "Sinan KALKAN's Web Page Research Projects Courses Home Links KOVAN Lab (Turkey) Computer Eng. (Turkey) COVIG Lab (Denmark) BCCN Center (Germany) Turkiye Robotik Konferansi (ToRK) Sinan KALKAN's Webpage Prof. Dr. Sinan Kalkan Dept. of Computer Engineering Middle East Technical University Inonu Bulvari, 06531 Ankara (Turkey) E-mail: skalkan [at] metu [dot] edu [dot] tr Office: A-209 Research Groups Proud member of the following research centers, labs and groups: METU Robotics and Artificial Intelligence Center [Webpage]. METU Image Analysis Center [Webpage]. METU Image Processing Laboratory [Webpage]. METU Balance [Webpage]. METU Energy [Webpage]. Cambridge University AFAR [Webpage]. Research Interests Computer Vision: Object Detection, Segmentation, Recognition. Machine/Deep Learning: Imbalance Problems, Bias and Fairness. Robotics. Selected Publications F. Yavuz, B. C. Cam, A. H. Dogan, K. Oksuz, E. Akbas*, S. Kalkan*, \"Bucketed Ranking-based Losses for Efficient Training of Object Detectors\", 18th European Conference on Computer Vision (ECCV), 2024. *Equal senior contribution. (Preprint | Code) B. Cetinkaya, S. Kalkan*, E. Akbas*, \"RankED: Addressing Imbalance and Uncertainty in Edge Detection Using Ranking-based Losses\", IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024. (Preprint | Publisher's webpage | Code) J. Cheong, S. Kalkan, H. Gunes, \"FairReFuse: Referee-Guided Fusion for Multi-Modal Causal Fairness in Depression Detection\", 32nd Int. Joint Conf. on Artificial Intelligence (IJCAI), 2024. Z. S. Baltaci, K. Oksuz, S. Kuzucu, K. Tezoren, B. K. Konar, A. Ozkan, E. Akbas*, S. Kalkan*, \"Class Uncertainty: A Measure to Mitigate Class Imbalance\", under review, 2023. (Arxiv). *Equal senior contribution. K. Oksuz, B. C. Cam, S. Kalkan*, E. Akbas*, \"One Metric to Measure them All: Localisation Recall Precision (LRP) for Evaluating Visual Detection Tasks\", IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), 44(12):9446-9463, 2022. (Arxiv | >Publisher's webpage | Code). *Equal senior contribution. K. Oksuz, B. C. Cam, S. Kalkan*, E. Akbas*, \"Imbalance Problems in Object Detection: A Review\", IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), 43(10):3388-3415, 2021. (Arxiv | Publisher's webpage/a> | Repository). *Equal senior contribution. K. Oksuz, B. C. Cam, E. Akbas*, S. Kalkan*, \"A Ranking-based, Balanced Loss Function Unifying Classification and Localisation in Object Detection\", Thirty-fourth Conference on Neural Information Processing Systems (NeurIPS), spotlight paper, 2020. (Arxiv | Conference page | Code). * Equal senior contribution. N. Krueger, P. Janssen, S. Kalkan, M. Lappe, A. Leonardis, J. Piater, A. J. Rodriguez-Sanchez, L. Wiskott, \"Deep Hierarchies in the Primate Visual Cortex: What Can We Learn For Computer Vision?\", IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), 35(8):1847-1871, August 2013. (Preprint | Publisher's Website) S. Kalkan, F. Woergoetter, N. Krueger, \"Statistical Analysis of Local 3D Structure in 2D Images\", IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2006. (PDF)",
  "content_length": 3158,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:02"
}