{
  "name": "Sina Fazelpour",
  "homepage": "https://sinafazelpour.com",
  "status": "success",
  "content": "Sina Fazelpour Skip to content I’m an Assistant Professor of Philosophy and Computer Science in the Department of Philosophy and in the Khoury College of Computer Sciences at Northeastern University. My research is at the intersection of philosophy, technology ethics, cognitive science, and artificial intelligence. It is motivated by a basic question: How should we evaluate and organize epistemic processes and practices in our diverse, interconnected, and technologically-mediated societies? I pursue this question through two main threads. The first examines how AI systems are integrated into social contexts, and how they should be evaluated and governed to advance epistemic, ethical, and political goals. The second investigates how diverse groups–from design teams to scientific communities–should be organized to appropriately leverage their differences, while managing normative trade-offs. Recent projects include: navigating model trade-offs in responsible AI; leveraging diversity and disagreement in AI evaluation and alignment; assessing AI’s cognitive impacts on imagination and the use of LLMs as surrogates for human participants in knowledge practices; or modeling the systemic effects of AI on knowledge communities. My work in these areas has been recognized through my selection to the inaugural cohort of Schmidt Sciences AI2050 Early Career Fellows, and supported by awards from the Social Sciences and Humanities Research Council of Canada and Amazon Research. From 2022 to 2025, I served as a Visiting AI Fellow at the National Institute of Standards and Technology (NIST), where, among other things, I contributed to the creation and operationalization of NIST AI Risk Management Framework (AI RMF) and its accompanying playbook. I was the 2020-21 Council Fellow on the World Economic Forum’s Global Future Council on Data Policy. I’m currently a Program Chair for ACM Conference on Fairness, Accountability, and Transparency (FAccT) 2025. Previously, I served as a Tutorial co-Chair for FAccT 2023 and a Philosophy Area Chair for FAccT 2024. I co-founded the Intelligence, Data, Ethics and Society (IDEAS) summer institute for undergraduate students to both broaden participation in and advance a cross-disciplinary approach towards the field of responsible AI. Here’s an interview about the program, which I ran with support from Omidyar Network and Public Interest Technology University Network. I also co-founded and serve on the organizing committee of two online seminar series, Computational Social Philosophy Seminars (CSPS) and The Philosophy of Artificial Intelligence Network Talks (PAINT). Before coming to Northeastern, I was a SSHRC Postdoctoral Fellow at Carnegie Mellon University in Philosophy and Machine Learning Departments. I hold a PhD in Philosophy (University of British Columbia), and a M.Sc in Medical Biophysics (University of Toronto). My CV: PDF Google Scholar: HTML Mailing Address Sina FazelpourDepartment of Philosophy and Religion, Northeastern University,360 Huntington Ave, Boston, MA, 02115United States Office Room 420S, Renaissance ParkNortheastern University1135 Tremont St,Boston, MA 02120 Email s.fazel-pour [at] northeastern.edu Sina Fazelpour Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 3365,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:56"
}