{
  "name": "Sinisa Todorovic",
  "homepage": "http://web.engr.oregonstate.edu/~sinisa",
  "status": "success",
  "content": "SINISA'S HOME PAGE Sinisa Todorovic sinisa@oregonstate.edu Professor School of EECS at Oregon State University Data Science and Engineering AI and Robotics Google Scholar PHD STUDENTS Tieqiao Wang A M Aahad ALUMNI'S THESES Ajay Krishna Nicolas Aziere Liqiang He Jun Li Khoi Nguyen Dimitrios Trigkakis Peng Lei Michael Lam Anirban Roy Xu Xu Chenyu Wang Yao Zhou Behrooz Mahasseni Shell Hu Xu Zhongyuan Feng Mohamed Amer Shravya Varakantham Nikhil Lingutla Venkata Amit Bawaskar Yaofei Feng Sharath Dhamodaran Tian Liu William Brendel Nadia Payet Jennifer Inouye SOME GREAT MOMENTS RECENT RESEARCH TOPICS End-to-End Action Segmentation Transformer Prior work typically uses pre-computed frame features. We introduce the first end-to-end solution to action segmentation grounded on raw pixels with the following key contributions: (1) adapter network for backbone fine-tuning; (2) a segmentation-by-detection framework for leveraging action proposals predicted over a coarsely downsampled video; and (3) action-proposal based data augmentation for robust training. ICCV '25 Presentation Paper Difformer for Action Segmentation We explicitly model uncertainty over framewise class predictions using the Dirichlet distribution to recalibrate initially predicted frame-level class distributions through a Dirichlet diffusion process. Our formulation is analytically tractable (closed-form) and hence computationally efficient. Diffusion parameters are estimated only at a sparse set of keyframes using a lightweight module, further reducing memory and runtime costs. ICCV '25 Presentation Paper A Dataset for Semantic and Instance Segmentation of Modern Fruit Orchards We introduce the first large-scale dataset for semantic and instance segmentation of fruit trees and their branches. The dataset consists of both synthetic and real-world video data, along with synthetic tree meshes, and provides annotations of foreground instances belonging to three classes: spur, branch, and leader. The dataset is benchmarked for unsupervised domain adaptation from synthetic to real data, and fully supervised learning. CVPR '25 Presentation Paper Github Page Attention Decomposition for Cross-Domain Semantic Segmentation We address cross-domain semantic segmentation with a new transformer that reduces the gap between the source and target domains by decomposing cross-attention in the decoder into domain-independent and domain-specific parts. This enforces the query tokens to interact with domain-independent aspects of the image tokens, shared by the source and target domains, rather than domain-specific counterparts which induce the domain gap. ECCV '24 Poster Paper Markov Game Video Augmentation for Action Segmentation For training, we use reinforcement learning (RL) to augment videos in the deep feature space rather than the visual spatiotemporal domain. RL is suitable since there are no reliable oracles to supervise optimal data augmentation in the deep feature space. ICCV '23 Poster Paper Cross-Domain Object Detection with Transformers We explicitly estimate domain-invariant and domain-specific features in the image-token and object-token sequences for bi-directional alignment of the source and target domains. This is aimed at reducing the domain gap in domain-invariant representations, while simultaneously increasing the distinctiveness of domain-specific features. ICCV '23 Poster Paper Object Detection with Split Transformer Self- and cross-attention in Transformers provide for high model capacity for object detection. We propose to split cross-attention into classification attention and box-regression attention, and also enable self-attention to account for pairs of adjacent object queries. CVPR '22 Poster Paper Incremental Few-shot Instance Segmentation We address incremental few-shot instance segmentation, where a few examples of new object classes arrive after access to training examples of old classes is not available anymore, and the goal is to perform well on both old and new classes. A new classifier based on the probit function and an uncertainty-guided bounding-box predictor are specified. CVPR '22 Poster Paper Weakly Supervised Amodal Segmentation We want to segment both visible (modal) and occluded (amodal) object parts, while training provides only ground-truth modal segmentations. A data manipulation is used to generate occlusions in training images, and predicted amodal segmentations of the manipulated training data are used as the pseudo-ground-truth amodal segmentation masks for the standard training of Mask-RCNN. An uncertainty map is estimated for each prediction for regularizing learning such that lower segmentation loss is incurred on regions with high uncertainty. ICCV '21 Poster Paper FAPIS: A Few-shot Anchor-free Part-based Instance Segmenter In few-shot instance segmentation, training and test images do not share the same object classes. We explicitly model latent object parts shared across training classes, which facilitates our few-shot learning on new classes in testing. A new network is specified for delineating and weighting latent parts by their importance for instance segmentation. CVPR '21 Poster Paper Action Shuffle for Unsupervised Action Segmentation We specify a new self-supervised learning of a feature embedding that accounts for both frame- and action-level structure of videos. An RNN is trained to recognize shuffled and unshuffled action sequences. As supervision of actions is not available, we specify an HMM and infer a MAP action segmentation for our self-supervised learning. CVPR '21 Poster Paper Anchor-Constrained Viterbi for Set-Supervised Action Segmentation We address set-supervised action segmentation with a new anchor-constrained Viterbi algorithm (ACV). The Viterbi algorithm is constrained by anchors which are salient action parts estimated for each action. CVPR '21 Poster Paper Self-Supervised GAN for Unsupervised Few-shot Object Recognition We are given one large dataset of unlabeled images, and another smaller dataset in which we conduct image retrieval for given queries. The two datasets do not share object classes. We specify a new self-supervised learning for a GAN that reconstructs the randomly sampled latent codes of ``fake'' images. ICPR'20 Poster Paper Set-Supervised Action Segmentation Training videos provide only the ground-truth set of actions present, but not their temporal ordering. In training, we estimate a set-constrained Viterbi loss from a MAP inference of an HMM which accounts for co-occurrences and temporal lengths of actions. CVPR'20 Poster Paper Riemannian Optimization on the Stiefel Manifold Enforcing orthonormality on parameter matrices (e.g., of a deep neural network) amounts to Riemannian optimization on the Stiefel manifold. To this end, we specify a new retraction map based on the Cayley transform, and implicit vector transport based on a projection of the momentum and the Cayley transform on the Stiefel manifold. ICLR'20 Presentation Paper Weakly Supervised Action Segmentation Training videos provide only the ground-truth ordering of actions present. For learning, we specify an efficient recursive algorithm for computing an energy-based loss that discriminates between all valid and invalid video segmentations. ICCV'19 Oral ICCV'19 Poster Paper Few-Shot Segmentation We address few-shot segmentation of foreground objects with an ensemble of experts guided with the gradient of loss incurred when segmenting labeled support images. ICCV'19 Poster Paper Explainable AI with Theory of Mind The Theory of Mind is used for modeling machine's mind, human's mind as inferred by the machine, and machine's mind as inferred by the human, for learning an optimal explanation policy and evaluating human's trust in the machine. CVPR'19 Poster Paper Deep Manifold Distance Learning Image distances are efficiently estimated on a manifold of select image representatives, using a closed-form convergence solution of the Random Walk, for image retrieval and clustering. CVPR'19 Poster Paper Learning to Learn Second-Order Back-Propagation Using LSTMs We derive an efficient back-propagation for computing both gradients and second derivatives of a CNN’s loss. These are then input to an LSTM for predicting optimal updates of CNN parameters. ICPR'18 Oral Paper Temporal Deformable Residual Networks for Action Segmentation Our TDRN computes deformable temporal convolutions in two parallel streams at short- and long-range scales for action segmentation. CVPR'18 Poster Paper Boundary Flow We specify a Siamese network for joint estimation of object boundaries and their motion in videos. Boundary flow is an important mid-level visual cue as boundaries and their flow more explicitly indicate objects' motions and interactions than common dense optical flow. CVPR'18 Poster Paper Recognition as HSnet Search for Informative Image Parts We specify a sequential search for informative object parts over a deep feature map in the image toward fine-grained recognition. CVPR'17 Oral CVPR'17 Poster Paper Combining Bottom-Up, Top-Down, and Smoothness Cues for Weakly Supervised Segmentation We fuse three processes toward semantic segmentation -- namely, (i) Bottom-up computation of neural activations in a CNN for the image-level class prediction; (ii) Top-down estimation of attention maps of the CNN's activations given the predicted objects; and (iii) Lateral attention-message passing among neighboring neurons at the same CNN layer. CVPR'17 Poster Paper Budget-Aware Semantic Video Segmentation We learn a budget-aware policy to optimally select a small subset of frames for pixelwise labeling by a CNN within a given time limit, and then efficiently interpolate the obtained segmentations to yet unprocessed frames. CVPR'17 Poster Paper Unsupervised Video Summarization We use a deep generative adversarial network to select a sparse subset of video frames which optimally represent the input video. CVPR'17 Poster Paper Confidence-Energy",
  "content_length": 30492,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:58"
}