{
  "name": "Siobhán North",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/siobhan-north",
  "status": "success",
  "content": "Dr Siobhán North | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Siobhán North PhD School of Computer Science Senior Lecturer Deputy Examinations Officer Member of the Testing research groups Open staff member portrait in a modal window s.north@sheffield.ac.uk +44 114 222 1835 Regent Court (DCS) Full contact details Dr Siobhán North School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-8478-8960 Google Scholar Personal website Profile Dr Siobhán North is a Senior Lecturer in Computer Science. She has a first degree in Mathematics and a PhD in Computer Science from the University of Sheffield. As well as her teaching role she is the Faculty of Engineering's Deputy Director of Learning and Teaching. Research interests Dr North currently works in two areas; XML databases and formal languages. The XML database work currently concerns indexing and compression techniques and the formal language work relates to translation between Z and SAL. Publications Books Eaglestone B, North S & Poulovassilis A (2002) Foreword. Journal articles Petrie J, Loban A, Turton E, Derebecka J, North S, Herbert E & Hind D (2024) “Reality is frequently inaccurate” A case study examining the whens and whys of post-live database changes in a UK clinical trials unit *Douglas Adams. Contemporary Clinical Trials, 142. View this article in WRRO Taylor R, Foster M & North S (2022) An automated framework for verifying or refuting trace properties of extended finite state machines. International Journal on Software Tools for Technology Transfer, 24(6), 949-972. View this article in WRRO Alsubai S & North S (2020) Solving the Intractable Problem: Optimal Performance for Worst Case Scenarios in XML Twig Pattern Matching. IEEE Access, 8, 192569-192586. Farooqi N & North S (2012) Evaluation of practical trust based access control for XML databases. 2012 International Conference for Internet Technology and Secured Transactions Icitst 2012, 336-340. Farooqi N & North S (2012) Logging in XML databases: Xlog file for trust based access control. World Congress on Internet Security Worldcis 2012, 174-175. Al-Badawi M, Ramadhan HA, North S & Eaglestorne B (2012) A performance evaluation of a new bitmap-based XML processing approach over RDBMS. International Journal of Web Engineering and Technology, 7(2), 143-172. Farooqi N & North S (2011) Trust-based access control for XML databases. 2011 International Conference for Internet Technology and Secured Transactions Icitst 2011, 764-765. Al-Badawi M, North S & Eaglestone B (2010) The 3D XML benchmark. Webist 2010 Proceedings of the 6th International Conference on Web Information Systems and Technology, 1, 13-20. Derrick J, North S & Simons AJH (2009) Z2SAL: a translation-based model checker for Z. Formal Aspects of Computing, 1-29. North SD (1985) Implementation of a Pascal Database Management System. Journal of Pascal, Ada and Modula-2, 4(5), 15-28. Ullmann JR & North SD (1984) A Pascal Database Management System. Journal of Pascal, Ada and Modula-2, 3(6), 15-22. ATKINSON LV & NORTH SD (1981) COPAS - A CONVERSATIONAL PASCAL SYSTEM. SOFTWARE PRACT EXPER, 11(8), 819-829. ATKINSON LV, MCGREGOR JJ & NORTH SD (1981) CONTEXT SENSITIVE EDITING AS AN APPROACH TO INCREMENTAL COMPILATION. COMPUT J, 24(3), 222-229. Farooqi N & North S () A Performance Evaluation of Logging in XML Databases Using an Xlog File for Trust Based Access Control. International Journal of Intelligent Computing Research, 4(2), 323-327. Farooqi N & North S () Performance Evaluation of Trust Based Access Control for XML Databases. Journal of Internet Technology and Secured Transaction, 2(1/2), 147-154. Book chapters Foster M, Brucker AD, Taylor RG, North S & Derrick J (2019) Incorporating Data into EFSM Inference, Lecture Notes in Computer Science (pp. 257-272). Springer International Publishing Conference proceedings Clegg B, North S, McMinn P & Fraser G (2019) Simulating student mistakes to evaluate the fairness of automated grading. 2019 IEEE/ACM 41st International Conference on Software Engineering: Software Engineering Education and Training (ICSE-SEET) (pp 121-125). Montreal, QC, Canada, 25 May 2019 - 25 May 2019. View this article in WRRO Alsubai S & North SD (2018) TwigStackPrime: A Novel Twig Join Algorithm Based on Prime Numbers. Web Information Systems and Technologies, Vol. 322. Porto, Portugal, 25 April 2017 - 25 April 2017. View this article in WRRO Al-khazraji S & North SD (2018) The Emergence Computation of Overflow in Dynamic XML Tree Based on Prefix and Interval Labelling Schemes. 2017 International Conference on Engineering and Technology (ICET). Akdeniz University, Antalya, Turkey, 21 August 2017 - 21 August 2017. View this article in WRRO Al-Khazraji S & North SD (2018) A relevance comparison between interval and prefix labelling schemes. 2017 International Conference on Engineering and Technology (ICET). Antalya, Turkey, 21 August 2017 - 21 August 2017. View this article in WRRO Alsubai S & North SD (2017) A Prime Number Approach to Matching an XML Twig Pattern including Parent-Child Edges. Proceedings of the 13th International Conference on Web Information Systems and Technologies (pp 204-211). Porto, Portugal, 25 April 2017 - 25 April 2017. View this article in WRRO Al Zadjali H & North S (2016) XML Labels Compression using Prefix-encodings. PROCEEDINGS OF THE 12TH INTERNATIONAL CONFERENCE ON WEB INFORMATION SYSTEMS AND TECHNOLOGIES, VOL 1 (WEBIST) (pp 69-75) Farooqi N & North S (2014) Time cost evaluation of trust based access control for XML databases. 2014 9th International Conference for Internet Technology and Secured Transactions, ICITST 2014 (pp 324-326). London, UK, 8 December 2014 - 8 December 2014. View this article in WRRO Siregar MU, Derrick J, North SD & Simons AJH (2014) Experiences using Z2SAL. Proceedings - ICACSIS 2014: International Conference on Advanced Computer Science and Information Systems (pp 225-231). Jakarta, Indonesia, 18 October 2014 - 18 October 2014. View this article in WRRO Al-Badawi M, Eaglestone B & North S (2009) PACD: A BITMAP-BASED FRAMEWORK FOR PROCESSING XML DATA. WEBIST 2009: PROCEEDINGS OF THE FIFTH INTERNATIONAL CONFERENCE ON WEB INFORMATION SYSTEMS AND TECHNOLOGIES (pp 66-71) Kader YA, Eaglestone B & North S (2008) An analysis of relational storage strategies for partially structured XML. WEBIST 2008: PROCEEDINGS OF THE FOURTH INTERNATIONAL CONFERENCE ON WEB INFORMATION SYSTEMS AND TECHNOLOGIES, VOL 1 (pp 165-170) Derrick J, North S & Simons AJH (2008) Z2SAL-Building a Model Checker for Z. ABSTRACT STATE MACHINES, B AND Z, PROCEEDINGS, Vol. 5238 (pp 280-293) Baravalle A, Chambers S, North S & Holcombe M (2006) Open source software in the desktop: The perspective of the public administrations in UK. WEBIST 2006: Proceedings of the Second International Conference on Web Information Systems and Technologies (pp 39-44) Derrick J, North S & Simons T (2006) Issues in implementing a model checker for Z. Formal Methods and Software Engineering, Proceedings, Vol. 4260 (pp 678-696) Shou XM & North S (2002) An integrated approach to handling collaborative diagram databases on the www. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 2405 (pp 58-61) Fan H (2002) Tracing Data Lineage Using Automed Schema Transformation Pathways.. BNCOD, Vol. 2405 (pp 50-53) Fu G, Shao J, Embury SM & Gray WA (2002) An Algorithm for Determining Related Constraints.. BNCOD, Vol. 2405 (pp 134-149) Gounaris A, Paton NW, Fernandes AAA & Sakellariou R (2002) Adaptive Query Processing: A Survey.. BNCOD, Vol. 2405 (pp 11-25) Engström H, Chakravarthy S & Lings B (2002) Implementation and Comparative Evaluation of Maintenance Policies in a Data Warehouse Environment.. BNCOD, Vol. 2405 (pp 90-102) (2002) Advances in Databases, 19th British National Conference on Databases, BNCOD 19, Sheffield, UK, July 17-19, 2002, Proceedings. BNCOD, Vol. 2405 Giannella C, Dalkilic MM, Groth DP & Robertson EL (2002) Improving Query Evaluation with Approximate Functional Dependency Based Decompositions.. BNCOD, Vol. 2405 (pp 26-41) Lodi S (2002) Fully Dynamic Clustering of Metric Data Sets.. BNCOD, Vol. 2405 (pp 73-76) Jasper E (2002) Global Query Processing in the AutoMed Heterogeneous Database Environment.. BNCOD, Vol. 2405 (pp 46-49) Couchot A (2002) Improving the Refined Triggering Graph Method for Active Rules Termination Analysis.. BNCOD, Vol. 2405 (pp 114-133) Zwol RV & Apers PMG (2002) Retrieval Performance Experiment with the Webspace Method.. BNCOD, Vol. 2405 (pp 150-165) Lepinioti K & McKearney S (2002) Implementing Data Mining in a DBMS.. BNCOD, Vol. 2405 (pp 70-71) Brisaboa NR, Penabad MR, Places ÁS & Rodríguez FJ (2002) A Document Database Query Language.. BNCOD, Vol. 2405 (pp 183-198) Boyd M, McBrien P & Tong N (2002) The AutoMed Schema Integration Repository.. BNCOD, Vol. 2405 (pp 42-45) Hull R, Kumar B, Sahuguet A & Xiong M (2002) Have It Your Way: Personalization of Network-Hosted Services.. BNCOD, Vol. 2405 (pp 1-10) Burgess M, Gray WA & Fiddian NJ (2002) Establishing a Taxonomy of Quality for Use in Information Filtering.. BNCOD, Vol. 2405 (pp 103-113) Ram S, Park J & Hwang Y (2002) CREAM: A Mediator Based Environment for Modeling and Accessing Distributed Information on the Web.. BNCOD, Vol. 2405 (pp 58-61) Medina E, Luján-Mora S & Trujillo J (2002) Handling Conceptual Multidimensional Models Using XML through DTDs.. BNCOD, Vol. 2405 (pp 66-69) Gupta A, Ludäscher B, Martone ME, Qian X, Ross E, Tran J & Zaslavsky I (2002) A System for Managing Alternate Models in Model-Based Mediation.. BNCOD, Vol. 2405 (pp 54-57) Veloso A, Rocha BG, Carvalho MD & Jr WM (2002) Real World Association Rule Mining.. BNCOD, Vol. 2405 (pp 77-89) Theodoratos D (2002) Semantic Integration and Q",
  "content_length": 11289,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:01"
}