{
  "name": "Siobhán Clarke",
  "homepage": "https://www.scss.tcd.ie/Siobhan.Clarke",
  "status": "success",
  "content": "Prof. Siobhán Clarke : Trinity College Dublin, the University of Dublin, Ireland Trinity College Dublin Skip to main content. Search TCD Your query: Top Level TCD Links TCD Home Faculties & Schools Courses Research Services Contact A – Z Prof. Siobhán Clarke School of Computer Science and Statistics Search Your query: You are here: Home Site map Home Research Publications Projects Students Service Teaching Courses Final Year Project Supervision MSc Dissertation Supervision Background Contact Siobhan Clarke (BSc, Phd, MRIA, FTCD) is Professor of Software Systems at Trinity College Dublin. (she/her) Her research focus is on software systems that enable the provision of smart and dynamic software services to urban stakeholders, addressing research challenges in the engineering of dynamic software in large-scale, ad hoc, mobile environments. She was elected Member of the Royal Irish Academy in 2023. Current Roles: Director, Enable: National SFI Research Programme on Connecting Communities to Smart Urban Environments through the Internet of Things. Director, Future Cities: Trinity Centre for Smart and Sustainable Cities Co-Lead, ADVANCE: SFI Centre for Research Training in Advanced Networks for Sustainable Societies Co-Principal Investigator, CONNECT: SFI Research Centre for Future Networks and Communications Co-Principal Investigator, Lero: SFI-funded Irish Software Research Centre Head, Networks and Distributed Systems Discipline in the School of Computer Science and Statistics Head, Distributed Systems Group Previous Roles: 2005-2012: Course Director for the M.Sc. in Computer Science (Networks and Distributed Systems), winner of the postgradireland IT \"Postgraduate Course of the Year\", 2011 2008-2011: School Director of Postgraduate Teaching and Learning Address: School of Computer Science and Statistics, Trinity College, Dublin 2. Location: Lloyd L2.15 Telephone: extension 2224 External: +353-1-8962224 Fax: +353-1-6772204 Last updated 9 April 2024 by Siobhan Clarke (Email). Trinity College Dublin, College Green, Dublin 2. Central Switchboard: +353 1 896 1000. Accessibility Privacy Disclaimer Contact",
  "content_length": 2135,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:58"
}