{
  "name": "Siqi Sun",
  "homepage": "https://intersun.github.io",
  "status": "success",
  "content": "Siqi Sun @ Fudan University Siqi Sun Associate Professor from IICS, Fudan University and Shanghai AI Lab 220 Handan Rd, Shanghai, China, 200437 Email: siqisun[AT] fudan.edu.cn OR sunsiqi1[AT] pjlab.org.cn Google Scholar LinkedIn Github Fudan Homepage Old Homepage About Me I am a tenure-track Associate Professor (Young PI) from Fudan University and Shanghai AI Lab. Previously, I was a Researcher from Knowledge and Language Team under Cognitive Services Research Group at Microsoft. I am mainly interested in deep learning and its applications in NLP and computational biology. More specifically, model compression/acceleration, knowledge graph, information retrieval, dialog response generation, protein/RNA structure prediction. Before that, I was a PhD student at TTI-Chicago, a philanthropically endowed computer science research institute in University of Chicago . For more about TTIC, please refer to About TTIC. And I am fortunate to work with Prof. Jinbo Xu. Prior to joining TTIC in 2011, I was a undergraduate student from School of Mathematics, Fudan University, China. For more details, please refer to my LinkedIn. Internships & Industrial Experiences Mar 2022 - present, Associate Professor, Fudan University Mar 2022 - present, - , Shanghai AI Lab Mar 2018 - Mar 2022, Researcher, Microsoft Jun 2015 - Sep 2015, Research Intern, Adobe Research , Mentor: Branislav Kveton, Hung Bui Mar 2011 - Jun 2011, Quant Research Intern, UBS Shanghai , Mentor: Wenfeng Cao Jul 2010 - Nov 2010, Quant Research Intern, Opera Solutions Shanghai , Mentor: Karl Xu News Our HGN algorithm achieves NO.1 on HotpotQA for both distractor setting and fullwiki setting. Our DialoGPT project was featured by Adweek, The Register, Synced and Jiqizhixin(机器之心, in Chinese). My manager and I were interviewed by The New York Times for our NO.1 leaderboard results on both ARC and CommonsenseQA.. Our FreeLB paper achieves NO.1 on GLUE benchmark and was reported by InfoQ. Our deep learning paper for contact prediction won the 2018 PLoS Computational Biology Research Prize in the category of Breakthrough/Innovation. I will join Microsoft(Redmond) in 2018! My work with Prof Jinbo Xu was reported by Science and The Economist . Our contact prediction algorithm won the 1st place in CASP12! Please see this paper for the official ranking table. Publications *-equal contribution Joint retrieval and generation training for grounded text generation Yizhe Zhang, Siqi Sun, Xiang Gao, Yuwei Fang, Chris Brockett, Michel Galley, Jianfeng Gao, Bill Dolan arxiv 2021 LightningDOT: Pre-training Visual-Semantic Embeddings for Real-Time Image-Text Retrieval Siqi Sun*, Yen-Chun Chen*, Linjie Li, Shuohang Wang, Yuwei Fang, Jingjing Liu NAACL 2021 Cluster-Former: Clustering-based Sparse Transformer for Long-Range Dependency Encoding Shuohang Wang, Luowei Zhou, Zhe Gan, Yen-Chun Chen, Yuwei Fang, Siqi Sun, Yu Cheng, Jingjing Liu Findings of ACL 2021 FILTER: An Enhanced Fusion Method for Cross-lingual Language Understanding Yuwei Fang, Shuohang Wang, Zhe Gan, Siqi Sun, Jingjing Liu AAAI 2021 Accelerating Real-Time Question Answering via Question Generation Yuwei Fang, Shuohang Wang, Zhe Gan, Siqi Sun, Jingjing Liu arxiv 2020 Cross-Thought for Sentence Encoder Pre-training Shuohang Wang, Yuwei Fang, Siqi Sun, Zhe Gan, Yu Cheng, Jingjing Liu and Jing Jiang EMNLP 2020 Contrastive Distillation on Intermediate Representations for Language Model Compression Siqi Sun, Zhe Gan, Yu Cheng, Yuwei Fang, Shuohang Wang, Jingjing Liu EMNLP 2020 Hierarchical Graph Network for Multi-hop Question Answering Yuwei Fang, Siqi Sun, Zhe Gan, Rohit Pillai, Shuohang Wang, Jingjing Liu EMNLP 2020 DialoGPT: Large-Scale Generative Pre-training for Conversational Response Generation Yizhe Zhang, Siqi Sun, Michel Galley, Yen-Chun Chen, Chris Brockett, Xiang Gao, Jianfeng Gao, Jingjing Liu, Bill Dolan ACL 2020 Demo [Code] FreeLB: Enhanced Adversarial Training for Language Understanding Chen Zhu, Yu Cheng, Zhe Gan, Siqi Sun, Tom Goldstein, Jingjing Liu ICLR 2020 (spotlight) Patient Knowledge Distillation for BERT Model Compression Siqi Sun, Yu Cheng, Zhe Gan, Jingjing Liu EMNLP 2019 [Code] Analysis of deep learning methods for blind protein contact prediction in CASP12 Sheng Wang, Siqi Sun and Jinbo Xu Proteins: Structure, Function, and Bioinformatics, 2018 Accurate De Novo Prediction of Protein Contact Map by Ultra-Deep Learning Model Sheng Wang*, Siqi Sun*, Zhen Li, Renyu Zhang, Jinbo Xu PLOS Computational Biology, 2017 [Server] Our server (RaptorX-Contact) was ranked 1st in contact prediction in the worldwide protein structure prediction (CASP) competition 12! Learning Nonparametric Forest Graphical Models with Prior Information Yuancheng Zhu, Zhe Liu and Siqi Sun Artificial Intelligence and Statistics Conference (AISTATS' 2017) Graphical Model Sketch Branislav Kveton, Hung Bui, Mohammad Ghavamzadeh, Georgios Theocharous, S. Muthukrishnan and Siqi Sun The European Conference on Machine Learning (ECML-PKDD' 2016) AUC-maximized Deep Convolutional Neural Fields for Sequence Labeling Sheng Wang, Siqi Sun and Jinbo Xu The European Conference on Machine Learning (ECML-PKDD' 2016) [Code] [Server] Learning structured densities via infinite dimensional exponential families Siqi Sun, Mladen Kolar and Jinbo Xu Neural Information Processing System (NIPS' 2015) [Supplementary Code] Predicting diverse M-best protein contact maps Siqi Sun, Jianzhu Ma, Sheng Wang and Jinbo Xu IEEE International Conference on Bioinformatics and Biomedicine (BIBM' 2015) Inferring Block Structure of Graphical Models in Exponential Families Siqi Sun*, Hai Wang* and Jinbo Xu Artificial Intelligence and Statistics Conference (AISTATS' 2015) Learning Scale-Free Networks by Dynamic Node Specific Degree Prior Qingming Tang*, Siqi Sun* and Jinbo Xu International Conference on Machine Learning (ICML' 2015) [Code] Adaptive Variable Clustering in Gaussian Graphical Models Siqi Sun*, Yuancheng Zhu* and Jinbo Xu Artificial Intelligence and Statistics Conference (AISTATS' 2014) [Code] An iterative network partition algorithm for accurate identification of dense network modules Siqi Sun*, Xinran Dong*, Yao Fu and Weidong Tian Nucleic Acids Research 2011 Professional Activities Reviewer of AISTATS 2016 - 2018, ECML 2016 - 2018, ICML 2015, NIPS 2015-2019, IEEE/ACM TCBB Program Committee of ECML-PKDD 2017 and 2018 for the Applied Data Science Track",
  "content_length": 6418,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:58"
}