{
  "name": "Siqiang Luo",
  "homepage": "https://siqiangluo.wixsite.com/homepage",
  "status": "success",
  "content": "Siqiang Luo | Siqiang Luo's Homepage top of page This website was built on Wix. Create yours today.Get StartedSiqiang Luo ​（骆思强）Assistant Professorsiqiang.luo@ntu.edu.sgGoogle ScholarThis homepage will not be maintained any more. Please visit my new homepage here at https://siqiangluo.com/ Short Bio. I am a Nanyang Assistant Professor at the School of Computer Science and Engineering, Nanyang Technological University. I am also affiliated with DANTE. I received my B.S. and M.S. degrees in computer science from Fudan University, and a Ph.D. degree in computer science from the University of Hong Kong (working with Prof. Ben Kao and Prof. Reynold Cheng). I also did a Postdoc at Harvard University (working with Prof. Stratos Idreos).Research Interest. I am broadly interested in big data management algorithms and systems, particularly in the following areas: 1) Scalable graph algorithms/systems. Focus on optimizing fundamental graph analytical problems, such as PageRanks, GNNs and Community Search. 2) Scalable key-value systems. Focus on optimizing the performance of key-value stores such as RocksDB, particularly in filter and index designs. 3) Machine-learning driven data management.Hiring. A few openings for Ph.D.s and PostDocs. Please send me your CV if you are interested in working with me. I regret that only shortlisted candidates will be contacted.Selected Publications (Full List in DBLP)​​​​ COCLEP: Contrastive Learning-based Semi-Supervised Community Search. Ling Li, Siqiang Luo, Yuhai Zhao, Caihua Shan, Zhengkui Wang, Qin Lu. In ICDE 2023. ​ Multi-Task Processing in Vertex-Centric Graph Systems: Evaluations and Insights. Siqiang Luo*, Zichen Zhu*, Xiaokui Xiao, Yin Yang, Chunbo Li, Ben Kao. (* Equal Contribution) In EDBT 2023. [Paper] ​ Example Searcher: A Spatial Query System via Example. Jun Xuan Yew, Ningyi Liao,  Dingheng Mo, Siqiang Luo. In ICDE 2023. [Demo Paper][Video] ​ Deep Graph Structural Infomax. Wenting Zhao, Gongping Xu, Zhen Cui, Siqiang Luo, Cheng Long, Tong Zhang. In AAAI 2023. ​ DMCS : Density Modularity based Community Search. Junghoon Kim, Siqiang Luo, Gao Cong, Wenyuan Yu. In SIGMOD 2022 [Paper]. ​ Proteus: A Self-Designing Range Filter. Eric Knorr*, Baptiste Lemaire*, Andrew Lim*, Siqiang Luo, Huanchen Zhang, Stratos Idreos, Michael Mitzenmacher. (* Equal Contribution) In SIGMOD 2022 [Paper]. ​ SCARA: Scalable Graph Neural Networks with Feature-Oriented Optimization. Ningyi Liao*, Dingheng Mo*, Siqiang Luo, Xiang Li, Pengcheng Yin. (* Equal Contribution) In PVLDB 2022 [Paper][Code]. ​ Single-Source Personalized PageRanks with Workload Robustness. Dingheng Mo, Siqiang Luo. In TKDE 2022. [Paper]​ ​ Example-based Spatial Search at Scale. Hanyuan Zhang, Siqiang Luo, Jieming Shi, Jing Nathan Yan, Weiwei Sun. In ICDE 2022. [Paper] [Code] ​ VC-Tune: Tuning and Exploring Distributed Vertex-Centric Graph Systems. Zichen Zhu, Siqiang Luo, Xiaokui Xiao, Yin Yang, Dingheng Mo, Yufei Han. In ICDE 2022. [Demo Paper][Video (From Zichen)] ​ Seesaw Counting Filter: An Efficient Guardian for Vulnerable Negative Keys During Dynamic Filtering.           Li Meng, Deyi Chen, Haipeng Dai, Rongbiao Xie, Siqiang Luo, Rong Gu, Tong Yang, Guihai Chen In WWW 2022. [Paper] ​ Spiking Graph Convolutional Networks. Zulun Zhu, Jiaying Peng, Jintang Li, Liang Chen, Qi Yu, Siqiang Luo In IJCAI 2022. [arXiv Paper] ​ Finding Global Homophily in Graph Neural Networks When Meeting Heterophily. Xiang Li, Renyu Zhu, Yao Cheng, Caihua Shan, Siqiang Luo, Dongsheng Li, Weining Qian. In ICML 2022. [Paper] ​ Agenda: Robust Personalized PageRanks in Evolving Graphs. Dingheng Mo, Siqiang Luo. In CIKM 2021. [Paper] [Slides] ​ Rosetta: A Robust Space-Time Optimized Range Filter for Key-Value Stores. Siqiang Luo, Subarna Chatterjee, Rafael Ketsetsides, Niv Dayan, Wilson Qin, Stratos Idreos. In SIGMOD 2020. [Paper] [Video] ​ Baton: Batch One-Hop Personalized PageRanks with Efficiency and Effectiveness. Siqiang Luo, Xiaokui Xiao, Wenqing Lin, Ben Kao. In TKDE 2020. [Paper] ​ Improved Communication Cost for Distributed PageRank Computation -- A Theorectical Study. Siqiang Luo In ICML 2020. [Paper] ​ ROAM: A Fundamental Routing Query on Road Networks with Efficiency. Siqiang Luo, Reynold Cheng, Ben Kao, Xiaokui Xiao, Shuigeng Zhou, Jiafeng Hu. In TKDE 2020. [Paper]​ ​ MPR - A Partitioning-Replication Framework for Multi-Processing kNN Search on Road Networks. Siqiang Luo, Ben Kao, Xiaowei Wu, Reynold Cheng. In ICDE 2019. [Paper] ​ Efficient Batch One-Hop Personalized PageRanks. Siqiang Luo, Xiaokui Xiao, Wenqing Lin, Ben Kao. In ICDE 2019. [Short Paper] ​ Distributed PageRank Computation: An Improved Theoretical Study. Siqiang Luo. In AAAI 2019. [Paper (long version)] ​ On Spatial-Aware Community Search. Yixiang Fang, Zheng Wang, Reynold Cheng, Xiaodong Li, Siqiang Luo, Jiafeng Hu, Xiaojun Chen. In TKDE 2019. [Paper] ​​​ TOAIN: A Throughput Optimizing Adaptive Index for Answering Dynamic kNN Queries on Road Networks. Siqiang Luo, Ben Kao, Guoliang Li, Jiafeng Hu, Reynold Cheng, Yudian Zheng. In PVLDB 2018. [Paper] ​ ROSC: Robust Spectral Clustering on Multi-scale Data. Xiang Li, Ben Kao, Siqiang Luo, Martin Ester. In WWW 2018. [Paper] ​ Effective Community Search over Large Spatial Graphs. Yixiang Fang, Reynold Cheng, Xiaodong Li, Siqiang Luo, Jiafeng Hu. In PVLDB 2017. [Paper] ​ C-Explorer: Browsing Communities in Large Graphs. Yixiang Fang, Reynold Cheng, Siqiang Luo, Jiafeng Hu, Kai Huang. In PVLDB 2017. [Demo Paper] ​ On Minimal Steiner Maximum-Connected Subgraph Queries. Jiafeng Hu, Xiaowei Wu, Reynold Cheng, Siqiang Luo, Yixiang Fang. In TKDE 2017. [Paper] ​ Effective and efficient attributed community search. Yixiang Fang, Reynold Cheng, Yankai Chen, Siqiang Luo, Jiafeng Hu. In VLDBJ 2017 [Paper] ​ On Embedding Uncertain Graphs. Jiafeng Hu, Reynold Cheng, Zhipeng Huang, Yixiang Fang, Siqiang Luo. In CIKM 2017. [Paper] ​ SEQ: Example-based Query for Spatial Objects. Siqiang Luo, Jiafeng Hu, Reynold Cheng, Jing Yan, Ben Kao. In CIKM 2017. [Paper] ​ Effective Community Search for Large Attributed Graphs. Yixiang Fang, Reynold Cheng, Siqiang Luo, Jiafeng Hu. In PVLDB 2016. [Paper] ​ Querying Minimal Steiner Maximum-Connected Subgraphs in Large Graphs. Jiafeng Hu, Xiaowei Wu, Reynold Cheng, Siqiang Luo, Yixiang Fang. In CIKM 2016. [Paper] ​ Distributed Spatial Keyword Querying on Road Networks. Siqiang Luo, Yifeng Luo, Shuigeng Zhou, Gao Cong, Jihong Guan. In EDBT 2014. [Paper]​ ​ Shortest path and distance queries on road networks: towards bridging theory and practice. Andy Diwen Zhu, Hui Ma, Xiaokui Xiao, Siqiang Luo, Youze Tang, Shuigeng Zhou. In SIGMOD 2013. [Paper] ​ DISKs: A System for Distributed Spatial Group Keyword Search on Road Networks. Siqiang Luo, Yifeng Luo, Shuigeng Zhou, Gao Cong, Jihong Guan. In VLDB 2012. [Demo Paper]Teams Postdocs Wang Kai (Sept 2022 - ) Yow Kai Siong (Jan 2022 - ) PhD from Monash U​ Awarded Southeast Asia Postdoc Fellowship ​ Ph.D. Students Wang Fan (2023 Spring) MS from Zhejiang University​ Liu Haoyu (2023 Spring)​ BS from Renmin University of China​ Zhu Zulun (2022 Spring) BS from Zhejiang University​ Yu Weiping (2022 Spring) MS from Beijing Institute of Technology​ Mo Dingheng (2021 Fall) BS from University of Science and Technology of China Liao Ningyi (2021 Fall) BS from Shanghai Jiao Tong University Zhang Zhaoqi (2022 Spring, co-supervised with Prof. Cong Gao) ​ Master Students​​ Li Chunbo (2021 Fall) BS from Tongji U​niversity Chen Mengshi (2022 Fall) BS from Shanghai Jiao Tong University​ ​ Visiting Students​​​ Dong Yixiang (Visiting PhD, Sept 2022) ​ Past Members Li Meng (Visiting PhD, July 2021 - July 2022) Li Ling (Visiting PhD, Nov 2021 - Nov 2022) Zhao Wenting (Visiting PhD, co-hosted with Prof. Long Cheng, Dec 2021 - Dec 2022) Fang Peng (Visiting PhD, co-hosted with Prof. Arijit Khan, Mar 2022 - Dec 2022) ​ ​​Teaching ​ CE/CZ4123 Big Data Management (NTU, 2022 Spring) CE/CZ2007 Introduction to Database (NTU, 2021 Fall) CE/CZ 2101 Algorithm Design & Analysis (NTU, 2021 Fall) Professional Services Program Committee Member/Reviewer Board 2023: KDD, PVLDB, EDBT, ICML, WWW, IJCAI 2022: KDD, ICML, WWW, ICDE, NeurIPS, CIKM 2021: CIKM, AAAI, WISE 2020: ACM TURC (SIGMOD China), WISE 2019: SIGMOD (Reproducibility), WISE ​ Journal Reviewer VLDB Journal IEEE TKDE​​ ​​ Publicity Co-Chair APWEB-WAIM 2022 ​ ​ ​ ​ ​ bottom of page",
  "content_length": 8400,
  "method": "requests",
  "crawl_time": "2025-12-01 14:28:59"
}