{
  "name": "Siting Liu 0001",
  "homepage": "https://sitingliu1.github.io/LiuSiting_hit.github.io",
  "status": "success",
  "content": "Siting Liu (刘思廷) This website is no longer maintained. For a updated version, see here. (Ph.D., UAlberta 2019; M.Eng., HIT 2014; B.Eng., HIT 2012; NEYC 2008) Assistant professor @ Shanghaitech University (tenure-track) Room 3-322, School of Information Science and Technology Email: liust at shanghaitech.edu.cn Tel: +86 (021)-20684852 Research interests: stochastic computing; spiking neural networks; AI accelerators; VLSI design. Research assistant/postdoc/graduate student positions are available. Interested candidate please send me an email with your CV and research statement (optional). Candidates from all identities and backgrounds are encouraged to apply. Publications Please see Google Scholar. Talks 1. Dynamic stochastic computing and its applications. Invited talk at ECNU, Shanghai, 2021-06-02. (slide) 2. Dynamic stochastic circuits for gradient descent with momentum. Hardware-aware efficient training (HAET) workshop at ICLR conference, virtual, 2021-05-08. (slide/poster) 3. Introduction to dynamic stochastic computing. Stochastic COmputing for Neuromorphic Architectures (SCONA) workshop at DATE conference, virtual, 2020-03-13. (slide) 4. Dynamic stochastic computing for digital signal processing applications. DATE'20 conference, virtual, 2020-03. (slide) 5. Hardware ODE solvers using stochastic circuits. DAC'17 conference, Austin, 2017-06. (slide/poster) 6. Energy efficient stochastic computing with Sobol sequences. DATE'17 conference, Lausanne, 2017-03. (slide/poster) Professional services 1. Reviewers for IEEE TCASI/II, TVLSI. 2. ACM member since 2017. 3. Session chair at NanoARCH 2021. Current students 1. Han Li (Master student) 2. Hongqiao Zhang (Master student) 3. Yutao Gong (Exam-exemplified master student) © 2021 - 2022, Siting Liu",
  "content_length": 1774,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:01"
}