{
  "name": "Sivaraman Balakrishnan",
  "homepage": "http://www.stat.cmu.edu/~siva",
  "status": "success",
  "content": "Sivaraman Balakrishnan I am a Professor with a joint appointment in the Department of Statistics and Data Science and in the Machine Learning Department at Carnegie Mellon. My research interests are broadly in statistical machine learning and algorithmic statistics. My interests span statistics, optimization, machine learning and information theory. Most recently, I have been excited about topics in: Robust Statistics and Domain Adaptation Minimax Hypothesis Testing Assumption-Light Inference (talk) Causal Inference (talk) Statistical Optimal Transport (talk1)(talk2) Non-Parametric Statistics Ranking, Crowdsourcing and Learning from Comparison Data Convex and Non-Convex Optimization Clustering and Topological Data Analysis A more complete list of publications can be found here. Before (re)-joining CMU, I was a postdoctoral researcher in the Department of Statistics, UC Berkeley, under the able guidance of Martin Wainwright and Bin Yu. I received my Ph.D. in Computer Science at Carnegie Mellon in the Language Technologies Institute working with Jaime Carbonell. I spent Fall 2024 at the Simons Institute in UC Berkeley, as a long-term visitor in the Modern Paradigms in Generalization program, and Spring 2025 on sabbatical in the Department of Statistics, UC Berkeley. I am an Associate Editor for JASA and JRSSB. I was a member of the Editorial Board of Foundations and Trends in Machine Learning, and am now a member of the Editorial Board of Foundations and Trends in Statistics. My research has been generously supported by an Amazon Research Award (2021), a Google Research Scholar Award (2021), and by the NSF (CCF-1763734, DMS-1713003, DMS-2113684 and DMS-2310632). I frequent the Statistics and Machine Learning Reading Group and the Causal Inference Working Group. Contact Information Email: siva@stat.cmu.edu Office: Baker Hall 132K",
  "content_length": 1858,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:04"
}