{
  "name": "Sivan Sabato",
  "homepage": "https://www.cas.mcmaster.ca/sivansabato",
  "status": "success",
  "content": "Sivan Sabato | Homepage Home Publications Code Dr. Sivan Sabato Associate ProfessorDepartment of Computing and Software, McMaster UniversityCanada CIFAR AI Chair, Vector Institutesabatos [at] mcmaster [dot] ca Overview I am an Associate Professor at the Department of Computing and Software at McMaster University. I am also a Canada CIFAR AI Chair and a Faculty Member at the Vector Institute of Artificial Intelligence. I hold an Associate Professor position at the Department of Computer Science at Ben-Gurion University of the Negev, where I am on an extended leave of absence. I was a post-doctoral fellow at Microsoft Research New England. I received my Ph.D. from the School of Computer Science and Engineering at the Hebrew University of Jerusalem. I am a recipient of the Alon Scholarship of the Council for Higher Education of Israel for excellent new faculty. I am also a recipient of the Google Anita Borg Memorial Scholarship, and an alumna of the Adams Fellowship Program of the Israel Academy of Sciences and Humanities. I served as an Action Editor for the Journal of Machine Learning Research and I am currently an Action Editor for the Transactions of Machine Learning Research, and routinely serve in senior positions at Machine Learning conferences such as ICML, COLT, ALT and AISTATS. I was the Publication Chair for ALT 2021, and a Publication co-Chair for ICML 2022 and ICML 2023. Machine Learning Research My research is in machine learning theory and algorithms. I focus mainly on active and interactive learning: a setting where the data source and the algorithm interact in an attempt to improve learning accuracy while decreasing information costs. Much of my work revolves around developing general-purpose algorithms that can be useful in many different applications. I am also interested in fairness in machine learning. The list of my publications is here. Code for published methods is available here. Open Positions In general, I supervise Computer Science Ph.D. and M.Sc. students who are interested in machine learning theory. Current graduate students can also apply for a research internship in my lab through Vector Institute. For current openings, please check under \"Open Positions\" in my Faculty of Engineering homepage. I am looking for students who are interested in machine learning theory. If you are interested, you are welcome to email me. In your email, please let me know why you are interested in being a part of my team, and what position you are looking for. Please also attach your CV, transcripts and any other supporting material that you think might be relevant. Please indicate any previous research experience, even if it is unrelated to machine learning. Note that I will not follow links to external material, due to computer security reasons. Please attach any relevant files directly to the email. Template design by Web-Kreation",
  "content_length": 2892,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:03"
}