{
  "name": "Siva Theja Maguluri",
  "homepage": "https://sites.google.com/site/sivatheja",
  "status": "success",
  "content": "Siva Theja MaguluriSearch this siteEmbedded FilesSkip to main contentSkip to navigationSiva Theja MaguluriI am Fouts Family Early Career Professor and an Associate Professor in the H. Milton Stewart School of Industrial & Systems Engineering at Georgia Tech.Before joining Georgia Tech, I spent two years in the Stochastic Processes and Optimization group, which is part of the Mathematical Sciences Department at the IBM T. J. Watson Research Center. I received my Ph.D. in ECE from the University of Illinois at Urbana-Champaign in 2014 and was advised by Prof R. Srikant. Before that, I received an MS in ECE from UIUC, which was advised by Prof R. Srikant and Prof. Bruce Hajek. I also hold an MS in Applied Maths from UIUC. I obtained my B.Tech in Electrical Engineering from Indian Institute of Technology Madras.I received the NSF CAREER award in 2021, 2017 Best Publication in Applied Probability Award from INFORMS Applied Probability Society, and the second prize in 2020 INFORMS JFIG best paper competition. Joint work with my students received the Stephen S. Lavenberg Best Student Paper Award at IFIP Performance 2021. As a recognition of my teaching efforts, I received the Student Recognition of Excellence in Teaching: Class of 1934 CIOS Award in 2020 for ISyE 6761 and the CTL/BP Junior Faculty Teaching Excellence Award, also in 2020, both presented by the Center for Teaching and Learning at Georgia Tech.I am actively looking for PhD students and Postdoctoral researchers with strong mathematical training. Candidates interested in PhD are encouraged to apply to one of the ISyE PhD programs and candidates looking for postdoctoral positions are encouraged to apply to the following three opportunities at GT: President's postdoc (not accepting applications this year unfortunately), ISyE Postdoc (apply here) and ARC postdoc. Please give me a heads up after you apply. Research InterestsReinforcement LearningOptimizationStochastic ProcessesQueueing TheoryConcentration InequalitiesRevenue OptimizationCloud Computing Data CentersCommunication NetworksRide hailingContactEmail: siva.theja @ gatech.eduPhone: 404-385-5518Office: Room 439 GrosecloseMailing Address:H. Milton Stewart School of Industrial and Systems EngineeringGeorgia Institute of Technology 765 Ferst Drive NWAtlanta, GA 30332-0205 Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2392,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:01"
}