{
  "name": "Siwei Lyu",
  "homepage": "https://cse.buffalo.edu/~siweilyu",
  "status": "success",
  "content": "Siwei Lyu home page Siwei Lyu, Ph.D. [CV] [Google Scholar] [DBLP] Fellow of IEEE and IAPR SUNY Distinguished Professor SUNY Empire Innovation Professor, Department of Computer Science and Engineering Director, UB Media Forensic Lab (UB MDFL)Co-Director, Center for Information Integrity (CII) School of Engineering and Applied Sciences University at Buffalo, State University of New York Phone: (716) 437-1587 Email: siweilyu AT buffalo DOT edu Office: 313 Davis Hall, Buffalo, NY14260 Home Publications Research Funding Service Media Downloads Lab Biography: Siwei Lyu is a SUNY Distinguished Professor and a SUNY Empire Innovation Professor at the Department of Computer Science and Engineering, the Director of the UB Media Forensic Lab (UB MDFL), and the founding Co-Director of the Center for Information Integrity (CII) at the University at Buffalo, State University of New York, USA. Before joining UB, Dr. Lyu served as an Assistant Professor (2008-2014), tenured Associate Professor (2014-2019), and Full Professor (2019-2020) at the Department of Computer Science at the University at Albany, State University of New York. He is the Founding Director of UAlbany's Computer Vision and Machine Learning Lab (CVML). From 2005 to 2008, he worked as a Post-Doctoral Research Associate at the Howard Hughes Medical Institute and the Center for Neural Science at New York University. In 2001, he was an Assistant Researcher at Microsoft Research Asia. Dr. Lyu earned his Ph.D. in Computer Science from Dartmouth College in 2005 and both his M.S. (2000) and B.S. (1997) degrees in Computer Science and Information Science, respectively, from Peking University, China. Dr. Lyu's research interests include media forensics, computer vision, and machine learning. He has published over 240 refereed journal and conference papers. His research projects are funded by NSF, DARPA, and the US Department of Homeland Security. Dr. Lyu has received numerous awards, such as the IEEE Signal Processing Society Best Paper Award (2011), the National Science Foundation CAREER Award (2010), SUNY Albany's Presidential Award for Excellence in Research and Creative Activities (2017), SUNY Chancellor's Award for Excellence in Research and Creative Activities (2018), Google Faculty Research Award (2019), and IEEE Region 1 Technological Innovation (Academic) Award (2021). Dr. Lyu has served on the IEEE Signal Processing Society's Information Forensics and Security Technical Committee and held editorial positions with several prestigious journals. Dr. Lyu holds prestigious memberships and distinctions, including being a Fellow of IEEE, IAPR, and AAIA. He is also a Distinguished Member of ACM, a Senior Member of the Sigma Xi Society, and a Member of the Omicron Delta Kappa society. News (08/25/2025) Xuanyi Zhou and Shengan Shi have successfully completed their stay at UBMDL as undergraduate interns. Good luck, Xuanyi and Shengan! (08/18/2025) The book I co-edited, \"Truth-Seeking in an Age of (Mis)Information Overload\" is featured as the CHOICE review of the week [Link]. (08/15/2025) Congratulations to Zhaofeng for his paper (co-authored with Prof. Kaiyi Ji, Yifang Yang, and Dr. Shu Hu) for receiving the Best Paper Award at the GLOW Workshop of IJCAI 2025. (08/11/2025) I delivered Keynote Speech at The 21st IEEE AVSS Conference at Tainan, Taiwan. (07/15/2025) Our lab has a successful year at ICCV 2025, with two papers in the regular conference and four papers in the workshops. Congratulations to all authors! (06/19/2025) Yan Ju has successfully defended her PhD thesis today. Congratulations Dr. Ju! She will go on to work as a Data Scientists at Walmart. (06/15/2025) Congratulations to Yu Cai and Shan Jia for their paper winning the Best Student Paper Award. (04/29/2025) I am promoted to a SUNY Distinguished Professor. I would not achieve this recognition without my colleagues, students, and mentors. I am immensely grateful of everyone who has helped me in my career to date. (04/07/2025) Our lab presented at the SUNY AI Summit at UB campus and was featured in the SUNY Provost's report to SUNY Board of Trustees. (04/09/2025) My student Soumyya Datta was interviewed for his work on detecting DeepFakes by local Channel 2 TV [Link]. Nice Job, Soumyya! (03/31/2025) Our K-12 article, \"Detecting deepfakes: how can we ensure that generative AI is used for good?\", has been hand-picked by the TES resources content team to be featured in March 2025 [Link]. (09/26/2024) Dr. Defang Chen joins UB MDFL as a post-doc and serves as the Assistant Lab Director. Welcome on board, Defang! (09/26/2024) After working in UB MDFL as Assistant Lab Director for three years, Dr. Shan Jia will join Google as a Research Scientist, Congratulations, Shan! (09/25/2024) This year our lab has THREE papers accepted to NeurIPS! [NEURIPS24A][NEURIPS24B][NEURIPS24C] (09/20/2024) I testified at the and NY State Assembly Public Hearing on the Impact of AI on Consumer Safety and Privacy. Read the UB News Story. [News Arxives]",
  "content_length": 5021,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:03"
}