{
  "name": "Sjur Didrik Flåm",
  "homepage": "https://www.uib.no/en/persons/Sjur.Didrik.Fl%C3%A5m",
  "status": "success",
  "content": "Sjur Didrik Flåm | UiB Skip to main content Edit Sjur Didrik Flåm Position Emeritus Affiliation Department of Informatics E-mail sjur.flaam@uib.no Phone number +47 55589217 Visitor address HIB - Thormøhlens gate 555006 Bergen Postal address P.O. Box 7803 NO-5020 Bergen Norway Sjur Didrik Flåm Position Emeritus Affiliation Department of Informatics Publications Academic article Flåm, Sjur Didrik (2024). Via Order Markets Towards Price-Taking Equilibrium. (external link) Flåm, Sjur Didrik (2023). Convexity, convolution and competitive equilibrium. (external link) Flåm, Sjur Didrik (2023). By Bid-Ask Spreads towards Competitive Equilibrium. (external link) Flåm, Sjur Didrik; Rückmann, Jan-Joachim (2022). The Lagrangian, constraint qualifications and economics. (external link) Flåm, Sjur Didrik (2021). Market equilibria and money. (external link) Flåm, Sjur Didrik (2021). Towards competitive equilibrium by double auctions. (external link) Ekerhovd, Nils-Arne; Flåm, Sjur Didrik; Steinshamn, Stein Ivar (2020). On shared use of renewable stocks. (external link) Flåm, Sjur Didrik (2020). Games and cost of change. (external link) Flåm, Sjur Didrik (2019). Generalized gradients, bid–ask spreads, and market equilibrium. (external link) Flåm, Sjur Didrik (2019). Emergence of price-taking Behavior. (external link) Flåm, Sjur Didrik (2018). Blocks of coordinates, stochastic programming, and markets. (external link) Flåm, Sjur Didrik (2018). On measures, pricing and sharing of risk. (external link) Flåm, Sjur Didrik (2017). Order books, markets and convex analysis. (external link) Flåm, Sjur Didrik (2016). Monotonicity and market equilibrium. (external link) Flåm, Sjur Dirik (2016). Bilateral exchange and competitive equilibrium. (external link) Flåm, Sjur Dirik (2016). Noncooperative games, coupling constraints, and partial efficiency. (external link) Flåm, Sjur Didrik (2016). Borch's theorem, equal margins, and efficient allocation. (external link) Flåm, Sjur Didrik; Wolfstetter, Elmar (2015). Liability insurance and choice of cars: A large game approach. (external link) Flåm, Sjur Didrik (2015). Risk measures, convexity, and max-min shortfalls. (external link) Bjerkholt, Olav; Flåm, Sjur Didrik (2015). Ragnar Frisch and interior-point methods. (external link) Flåm, Sjur Didrik; Godal, Odd; Soubeyran, Antoine (2014). Gradient differences and bilateral barters. (external link) Flåm, Sjur Didrik (2012). Coupled projects, core imputations, and the CAPM. (external link) Flåm, Sjur Didrik; Gramstad, Kjetil (2012). Direct exchange in linear economies. (external link) Flåm, Sjur Didrik (2011). Exchanges and measures of risk. (external link) Flåm, Sjur Didrik; Koutsougeras, Leonidas C. (2010). Private information, transferable utility, and the core. (external link) Flåm, Sjur (2010). Portfolio management without probabilities or statistics. (external link) Flåm, Sjur (2010). Cooperation Under Ambiguity. (external link) Flåm, Sjur Didrik; Hiriart-Urruty, JB; Jourani, A (2009). Feasibility in finite time. (external link) Flåm, Sjur Didrik; Ermoliev, Yuri M (2009). Investment, uncertainty, and production games. (external link) Flåm, Sjur Didrik (2009). Pooling, pricing and trading of risks. (external link) Flåm, Sjur Didrik (2009). Risk premium and non-smooth utility. (external link) Flåm, Sjur Didrik; Gaasland, Ivar; Vårdal, Erling (2009). On deregulating food prices. (external link) Flåm, Sjur Didrik; Ruszczynski, Andrzej (2008). Finding normalized equilibrium in convex-concave games. (external link) Flåm, Sjur Didrik; Jongen, HT; Stein, O (2008). Slopes of shadow prices and Lagrange multipliers. (external link) Flåm, Sjur Didrik; Godal, Odd (2008). Market clearing and price formation. (external link) Flåm, Sjur Didrik (2008). Option pricing by mathematical programming. (external link) Flåm, Sjur Didrik (2006). Upward slopes and inf-convolutions. (external link) Flåm, Sjur Didrik; Jourani, A (2006). Prices and Pareto optima. (external link) Flåm, Sjur Didrik (2006). Production games, core deficit, duality and shadow prices. (external link) Flåm, Sjur Didrik; Wieczorek, Andrzej (2006). Core solutions and nash equilibria in noncooperative games with a measure space of players. (external link) Flåm, Sjur Didrik (2006). Balanced environmental games. (external link) Flåm, Sjur Didrik; Cavazzuti, Ennio (2005). Entropic penalties in finite games. (external link) Flåm, Sjur Didrik; Owen, G; Sabyoa, M (2005). The not-quite non-atomic game: non-emptiness of the core in large production games. (external link) Flåm, Sjur Didrik; Cavazzuti, Ennio (2005). Entropic Penalties in Finite Games. (external link) Flåm, Sjur Didrik; Corvellec, Jean-Nöel (2004). Non-convex feasibility problems and proximal point methods. (external link) Flåm, Sjur Didrik; Morgan, J. (2004). Newtonian mechanics and Nash play. (external link) Flåm, Sjur Didrik; Risa, Alf Erling (2003). Ability, self-confidence, and search. (external link) Flåm, Sjur Didrik; Jourani, A. (2003). Strategic behavior and partial costs sharing. (external link) Evstigneev, Igor V.; Flåm, Sjur Didrik (2002). Convex stochastic duality and the Biting Lemma. (external link) Flåm, Sjur Didrik (2002). Stochastic programming, cooperation, and risk exchange. (external link) Ermoliev, Yu. M.; Flåm, Sjur Didrik (2002). Repeated play of potential games. (external link) Flåm, Sjur Didrik; Mallozi, Kina; Morgan, Jacqueline (2002). A new look for Stackelberg-Cournot equilibria in oligopolistic markets. (external link) Flåm, Sjur Didrik; Kaniovski, Y.M. (2002). Price expectations and cobwebs under uncertainty. (external link) Evstigeenev, I.V.; Flåm, Sjur Didrik (2001). Sharing nonconvex costs. (external link) Flåm, Sjur Didrik (2000). Looking for arbitrage. (external link) Flåm, Sjur Didrik; Sandvik, Bjørn (2000). Competitive equilibrium: Walras meets Darwin. (external link) Flåm, Sjur Didrik; Sandvik, Bjørn (2000). Competitive equilibrium: Walras meets Darwin. (external link) Flåm, Sjur Didrik (2000). Looking for arbitrage. (external link) Flåm, Sjur Didrik (1999). Learning Equilibrium Play: A Myopic Approach. (external link) Flåm, Sjur Didrik; Horvath, Charles (1998). Stochastic mean values, rational expectations, and price movemnets. (external link) Evstigeneev, I.V.; Flåm, Sjur Didrik (1998). Rapid growth paths in multivalued dynamical systems generated by homogeneous convex stochastic operators. (external link) Flåm, Sjur Didrik (1998). Restricted attention, myopic play, and the learning of equilibrium. (external link) Flåm, Sjur Didrik; Mirman, Leonard J. (1998). Groping for optimal growth. (external link) Flåm, Sjur Didrik (1998). Averaged predictions and the learning of equilibrium play. (external link) Flåm, Sjur Didrik (1998). 2 x 2 games, fictitious play and Green's theorem. (external link) Flåm, Sjur Didrik; Kjelby, Torhild; Rødseth, Tor (1997). Fiskeformue og forvaltningsstrategi. (external link) Flåm, Sjur Didrik (1997). Gradient approaches to equilibrium. (external link) Flåm, Sjur Didrik; Horvath, Charles (1996). Network games; adaptions to Nash-Cournot Equilibrium. (external link) Flåm, Sjur Didrik; Antipin, Anatoly S (1996). EQUILIBRIUM PROGRAMMING USING PROXIMAL-LIKE ALGORITHMS. (external link) Flåm, Sjur Didrik (1996). Approaches to Economic Equilibrium. (external link) Aspvall, B.; Flåm, Sjur Didrik; Villanger, K. P. (1995). Selecting among scheduled projects. (external link) Flåm, Sjur Didrik (1995). Successive averages of firmly nonexpansive mappings. (external link) Flåm, Sjur Didrik; Risa, Alf Erling (1995). Market insurance, social insurance, and education. (external link) Aspvall, Bengt; Flåm, Sjur Didrik; Villanger, Kåre P. (1995). Selecting among scheduled projects. (external link) Flåm, Sjur Didrik (1994). On variational stability in competitive economies. (external link) Flåm, Sjur Didrik; Seeger, Alberto (1994). Solving cone-constrained convex programs by differential inclusions. (external link) Flåm, Sjur Didrik (1994). Kor mykje er dei norske sildefiskeria verdt?. (external link) Aspvall, B.; Flåm, Sjur Didrik; Villanger, K. P. (1994). Selecting among scheduled projects. (external link) Flåm, Sjur Didrik (1993). Paths to constrained Nash equilibria. (external link) Flåm, Sjur Didrik (1992). Level-Constrained Programming. (external link) Flåm, Sjur Didrik (1992). Solving Convex Programs by Means of Ordinary Differential Equations. (external link) Flåm, Sjur Didrik (1992). Lagrange Multipliers in Stochastic Programming. (external link) Flåm, Sjur Didrik; Zowe, Jochem (1991). Exact Penalty Functions in Single-Stage Stochastic Programming. (external link) Flåm, Sjur Didrik; Fougeres, Alain (1991). Infinite Horizon Programs: Convergence of Approximate Solutions. (external link) Ben-Israel, A.; Flåm, Sjur Didrik (1990). A Bisection/Successive Approximation Method for Computing Gittins Indices. (external link) Flåm, Sjur Didrik; Zowe, Jochem (1990). Relaxed Outer Projections, Weighted Averages and Convex Feasibility. (external link) Flåm, Sjur Didrik; Ben-Israel, Adi (1990). A Continous Approach to Oligopolistic Market Equilibrium. (external link) Ben-Israel, A.; Flåm, Sjur Didrik (1989). Input Optimization for Infinite-Horizon Discounted Programs. (external link) Flåm, Sjur Didrik (1989). Approaching Saddle Points as Equilibria of Differential Inclusions. (external link) Ben-Israel, A.; Flåm, Sjur Didrik (1989). Support Prices of Activities in Linear Programming. (external link) Flåm, Sjur Didrik (1988). Stability of Convex Programs under a Distributed Constraint Qualification. (external link) Flåm, Sjur Didrik; Wets, Roger J.-B. (1987). Existence Results and Finite Horizon Approximations for Infinite Horizon Optimization Problems. (external link) Flåm, Sjur Didrik; Hastings, Kevin (1987). On Adjustment Costs, Profit Uncertainty and Investment Behavior. (external link) Flåm, Sjur Didrik; Moxness, Erling (1987). Exploration for Petroleum and the Inventory of Proven Reserves. (extern",
  "content_length": 26126,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:08"
}