{
  "name": "Sk Subidh Ali",
  "homepage": "https://www.iitbhilai.ac.in/index.php?pid=subidh",
  "status": "success",
  "content": "Dr. Sk Subidh Ali IIT Bhilai administration@iitbhilai.ac.in हिन्दी English A- A A+ Home Academic DepartmentsDepartment of Computer Science and EngineeringCSE Faculty Dr. Sk Subidh Ali Dr. Sk Subidh Ali Associate Professor Computer Science and Engineering Indian Institute of Technology (IIT), Bhilai subidh[at]iitbhilai[dot]ac[dot]in MIST Lab Research Interest Adversarial Machine Learning Deepfake Detection Cyber Security Hardware Security and Trust IoT and Smart Infrastructure Design and Security For more details on our research visit MIST Lab Academic Background PhD in CSE : Indian Institute of Technology (IIT) Kharagpur, India MTech in IT: West Bengal University of Technology, Kolkata, India BE in CSE: Bankura Unnayani Institute of Engineering, Burdwan University Subjects Taught CSL202: Data Structure: Monsoon 2025 CSL503: Computer System Engineering: Monsoon 2025 CSL607: Adversarial Machine Learning: Monsoon 2019, 2021, Winter 2022, 2024, 2025 CS550: Machine Learning: Winter 2020, 2021,2022 CSL204: Computer Organization and Architecture: Monsoon 2018, 2020, 2021 CSL100: Introduction to Programming: Monsoon 2022, 2023, 2024 CS301: Computer Network: Monsoon 2019 EE311: Advanced Digital Circuit: Winter 2019 CS555: Network and System Security: Winter 2019 Responsibilities Head MIST Lab, IIT Bhilai Guest Editor: Special Issue in Journal of Hardware and Systems Security, Springer Program Co-Chair: Security, Privacy, and Applied Cryptography Engineering - 7th International Conference, SPACE 2017, Goa, India, December 13-17, 2017, Proceedings Professional Experience Nov 2024 - till date: Associate Professor in the Department of Computer Science and Engineering, Indian Institute of Technology (IIT) Bhilai, India. Dec 2017 - Nov 2024: Assistant Professor in the Department of Computer Science and Engineering, Indian Institute of Technology (IIT) Bhilai, India. Aug 2016 - Dec 2017: Assistant Professor in the Department of Computer Science and Engineering, Indian Institute of Technology (IIT) Tirupari Nov, 2012-Aug, 2016: Postdoctoral Research Associate, Department of Computer Engineering, New York University Abu Dhabi, UAE. Intellectual Property Granted Patents Yogendra Sao and Sk Subidh Ali, “A System and Method for Defeating Scan Attacks on Cipher,” Indian Patent No. 538348, Granted on 16-May-2024 Brejesh Lall, Sk Subidh Ali, Debanka Giri, and Sudev Kumar Padhi, \"Systems and methods for verifying navigation signals\", Indian Patent No: 554204, Granted on 12-Nov-2024 Sudev Padhi, Mohit Kumar, Debanka Giri, and Sk Subidh Ali, “A system and method for enhanced grasp stability by detecting slip, crumple, and shape of the object in robotic hand,” Indian Patent No: 557306, Granted on 31-Dec-2024 Patents Under Review Sudev Kumar Padhi, Archana Tiwari, Sk SubidhAli, “a deep learning based system and method for dual watermarking of images”, Indian Patent Application No: 202421009753, Filed on 19-July-2024 Sudev Kumar Padhi, Archana Tiwari, Sk SubidhAli, “A system and method for detecting and localizing digital document forgery for reconstruction of tamper-region”, Indian Patent Application No: 202421094908, Filed on 3-Dec-2024 Sudev Kumar Padhi, Indrakumar Mhaski, Sk SubidhAli, “A system and method for detecting fake images with source attribution”, Indian Patent Application No: 202321079201, Filed on 25-April-2024 Brejesh Lall, Sk Subidh Ali, Debanka Giri, and Sudev Kumar Padhi, \"Systems and methods for verifying navigation signals\", US Application No.: 18/520,583, Filed on 12-Nov-2023 Selected Publications Journal Papers Umesh Kashyap, Sudev Kumar Padhi, Sk SubidhAli, “Is Perceptual Encryption Secure? A Security Benchmark for Perceptual Encryption Methods\" , IEEE Transactions on Artificial Intelligence, Year 2025, vol. PP, pp.1 - 10, Sudev Kumar Padhi, Archana Tiwari, Sk SubidhAli, “Deep Learning-Based Dual Watermarking for Image Copyright Protection and Authentication\" , IEEE Transactions on Artificial Intelligence, Year 2024, vol. 5, pp. 6134 - 6145, YogendraSao, Sk SubidhAli, “DefScan: Provably Defeating Scan Attack on AES-Like Ciphers\" , IEEE IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, Year 2024, vol. 43, pp. 2326 - 2339, YogendraSao, Sk SubidhAli, “Security Analysis of Scan Obfuscation Techniques\" , IEEE Transactions on Information Forensics and Security, Year 2023, vol. 18, pp. 2842-2855, Dipojjwal Ray, YogendraSao, Sk SubidhAli, Santosh Biswa, “On securing cryptographic ICs against scan-based attacks: A Hamming weight distribution perspective,” in ACM J. Emerg. Technol. Comput. Syst, vol. 19, no. 2, Mar 2023 YogendraSao, Sk SubidhAli, Dipojjwal Ray, Siddharth Singh, Santosh Biswasa, “Co-relation scan attack analysis (COSAA) on AES: A comprehensive approach\", Elsevier Microelectronics Reliability, Year 2021, Volume 123, Page 1-18. Sk Subidh Ali, Mohamed Ibrahim, J. Rajendran, Ozgur Sinanoglu, Krishnendu Chakrabarty, “Supply-Chain Security of Digital Microfluidic Biochips\", IEEE Computer, Year 2016, Volume 49, Issue 8, Page 36-43. Chandra KH Suresh, Sk Subidh Ali , M. Bodhisatwa, Ozgur Sinanoglu, “A Comparative Security Analysis of Current and Emerging Technologies\", IEEE Micro, Year 2016, Volume 36, Issue 5, Page 50-61. Bodhisatwa Mazumdar, Samah Mohamed Saeed, Sk Subidh Ali, Ozgur Sinanoglu: Timing Attack and Countermeasure on NEMS Relay Based Design of Block Ciphers. IEEE Trans. Emerging Topics Comput. 5(3): 317-328 (2017) Sk Subidh Ali, Mohamed Ibrahim, Ozgur Sinanoglu, Krishnendu Chakrabarty, Ramesh Karri: Security Assessment of Cyberphysical Digital Microfluidic Biochips. IEEE/ACM Trans. Comput. Biology Bioinform. 13(3): 445-458 (2016) Bodhisatwa Mazumdar, Sk Subidh Ali , Ozgur Sinanoglu: A Compact Implementation of Salsa20 and Its Power Analysis Vulnerabilities. ACM Trans. Design Autom. Electr. Syst. 22(1): 11:1-11:26 (2016) Sk Subidh Ali, Samah Mohamed Saeed, Ozgur Sinanoglu, Ramesh Karri: Novel Test-Mode-Only Scan Attack and Countermeasure for Compression-Based Scan Architectures. IEEE Trans. on CAD of Integrated Circuits and Systems 34(5): 808-821 (2015) Sk Subidh Ali, Bodhisatwa Mazumdar, Debdeep Mukhopadhyay: A Fault Analysis Perspective for Testing of Secured SoC Cores. IEEE Design & Test 30(5): 63-73 (2013) Sk Subidh Ali , Debdeep Mukhopadhyay, Michael Tunstall: Differential fault analysis of AES: towards reaching its limits. J. Cryptographic Engineering 3(2): 73-97 (2013) Editorial Sk Subidh Ali , Debdeep Mukhopadhyay: Guest Editorial SPACE 2017 Special Issue in the Journal of Hardware and Systems Security (HaSS). J. Hardware and Systems Security 3(1): 1-2 (2019) Sk Subidh Ali, Jean-Luc Danger, Thomas Eisenbarth: \"Security, Privacy, and Applied Cryptography Engineering\" - 7th International Conference, SPACE 2017, Goa, India, December 13-17, 2017, Proceedings. Lecture Notes in Computer Science 10662, Springer 2017, ISBN 978-3-319-71500-1 Book Chapter Sk Subidh Ali , Samah Mohamed Saeed, Ozgur Sinanoglu, and Ramesh Karri, “New Scan-Based Attack Using Only the Test Mode And An Input Corruption Countermeasure”, In \"VLSI-SoC:At the Crossroads of Emerging Trends\", edited by H. F. Ugurdag, Alex Orailoglu, R. Reis, M. Margala, L. Carro, L. M. Silveira, Springer, Chapter 3, p. 48-68, New York, USA, 2015. Sk Subidh Ali , Xiaofei Guo, D. Mukhopadhyay and Ramesh Karri, “Differential Fault Attacks on AES and Their Countermeasures” In “Secure System Design and Trustable Computing”, edited by M. Potkonjak and Y. Liu, Springer, Chapter 5, p. 163-208, New York, USA, 2015. S. Samah, Sk Subidh Ali , O Sinanoglu, “Scan Design: Basics, Advancements, and Vulnerabilities”, In “Hardware Security and Trust: Design and Deployment of Integrated Circuits in a Threatened Environment”, Nicolas Sklavos, Ricardo Chaves, Giorgio Di Natale, Francesco Regazzoni (editors), Springer 2017. Peer Review Conference Umesh Kashyap, and Sk Subidh Ali,\"Perceptually-Guided Adversarial Diffusion: Enhancing Visual Fidelity in Facial Privacy Protection,” 10th International Conference on Computer Vision and Image Processing (CVIP-2025), Ropar, India, December 10–13, 2025 (Accepted) Umesh Kashyap, and Sk Subidh Ali,\"Adversarial Malware Detection,” 14th International Conference on Security, Privacy, and Applied Cryptography Engineering (SPACE 2024),Kottayam, India, December 14–17, 2024, pp. 227-286, Yogendra Sao, Anjum Riaz, Satyadev Ahlawat, and Sk Subidh Ali, “Evaluating Security of New Locking SIB-based Architectures,” 2022 IEEE European Test Symposium (ETS), Barcelona, Spain, 2022, pp. 1-6, Yogendra Sao, Sk Subidh Ali,“Security Analysis of State-of-the-art Scan Obfuscation Technique,” 2021 IEEE 39th International Conference on Computer Design (ICCD), Storrs, CT, USA, 2021, pp.599-602 Yogendra Sao, Sk Subidh Ali, and S. Biswas,\"Opacity preserving Countermeasure using Finite State Machines against Differential Scan Attacks\", 2021 IEEE European Test Symposium (ETS), Bruges, Belgium, 2021, pp. 1-2 Yogendra Sao, K.K.Soundra Pandian, and Sk Subidh Ali, \"Revisiting the security of static masking and compaction: Discovering new vulnerability and Improved Scan Attack on AES\", 2020 IEEE Asian Hardware Oriented Security and Trust Symposium (AsianHOST), Kolkata, India, 2020, pp. 1-6 D. Ray, S. Singh, Sk Subidh Ali and S. Biswas, ``Co-relation Scan Attack Analysis (COSAA) on AES: A Comprehensive Approach\" 2019 IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems (DFT), Noordwijk, Netherlands, 2019, pp. 1-6. Sk Subidh Ali, Mohamed Ibrahim, Ozgur Sinanoglu, Krishnendu Chakrabarty, and Ramesh Karri, “Microfluidic encryption of on-chip biochemical assays”, 2016 IEEE Biomedical Circuits and Systems Conference (BioCAS 2016), p. 152-155. Chandra KH Suresh, M. Bodhisatwa, S. Samah, Sk Subidh Ali, and O. Sinanoglu, “Power-side-channel analysis of carbon nanotube FET-based design,\" 2016 IEEE 22nd International Symposium on On-Line Testing and Robust System Design (IOLTS 2016), p. 215-218, Spain. Sk S",
  "content_length": 15613,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:05"
}