{
  "name": "Slawomir Stanczak",
  "homepage": "https://www.netit.tu-berlin.de/menue/team/prof_dr_ing_slawomir_stanczak",
  "status": "success",
  "content": "Netzwerk-Informationstheorie - TU Berlin Am Lehrstuhl Netzwerk-Informationtheorie, der von Prof. Stanczak geleitet wird, konzentrieren wir uns auf die Erforschung und Entwicklung neuer Technologien für künftige Generationen drahtloser Netzwerke. Wir erforschen nicht nur die Theorie, sondern auch die Umsetzung dieser Technologien in praktische Systeme. Es besteht eine enge Zusammenarbeit mit der Abteilung Drahtlose Kommunikation und Netze am Fraunhofer Heinrich-Hertz-Institut.Ein wichtiges strategisches Ziel der Forschungsarbeit ist die Entwicklung neuartiger Technologien für Mobilfunknetze der sechsten Generation (6G). Wir sind hauptsächlich an Methoden für die unteren Schichten des Protokollstapels interessiert, einschließlich der Untersuchung und Entwicklung von KI-basierten Online-Algorithmen für robuste Funkzugangssysteme. Um diese Arbeit zu unterstützen, sind wir immer auf der Suche nach klugen Köpfen. Daher können Sie sich jederzeit per E-Mail mit Ihren Bewerbungsunterlagen an uns wenden. 5G/6G (xG) Research and Technology Transfer Prof. Slawomir Stanczak hält einen Vortrag beim Berlin Creative Tech Summit 2025 über \"5G/6G (xG) Research and Technology Transfer\" in Berlin. 07.11.2025 6G-RIC: Pioneering the Path to Energy-Efficient 6G Technologies Prof. Slawomir Stanczak hält auf dem Thinknet6G Summit 2025 in Nürnberg einen Vortrag zum Thema „6G-RIC: Pioneering the Path to Energy-Efficient 6G Technologies\". 29.10.2025 PhD Defense Navneet Agrawal Navneet Agrawal defended his PhD about: Dynamic Distributed Optimization and Fixed-Point Seeking via Over-the-Air Function Computation with Prof Stanczak as Evaluator 09.10.2025 Technologies Shaping Future Spectrum Use: From Sub-THz to RIS and ISAC Prof. Slawomir Stanczak will hold a Talk, about \"Technologies Shaping Future Spectrum Use: From Sub-THz to RIS and ISAC\" at the CEPT-ECC Workshop on the 30th of September 2025 in Copenhagen. 30.09.2025 PhD Defense Rodrigo Hernangómez Herrero Rodrigo Hernangómez Herrero defended his PhD about: Wireless Communication and Sensing: From Integration Challenges to Cross-Domain Learning 22.09.2025 Alle NeuigkeitenTechnische Universität Berlin Fachgebiet Netzwerk-Informationstheorie Fakultät IV Sekr. HFT 6-1, Einsteinufer 25 10587 BerlinProf. Dr.-Ing. Slawomir Stanczak HFT 400a  Einsteinufer 25 10587 Berlin  Tel.: +49(0)30 314-28465 Fax: +49(0)30 314-28320E-MailWebsiteKerstin Reinhardt Sekr. HFT 6-1 Einsteinufer 25 10587 Berlin e-mail queryWir bieten englischsprachige Lehrveranstaltungen in den Themenbereichen Maschinelles Lernen, Drahtloskommunikation und Signalverarbeitung an. Bitte informieren Sie sich auf unserer englischsprachigen Website.",
  "content_length": 2673,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:09"
}