{
  "name": "Slobodan Mitrovic",
  "homepage": "https://web.cs.ucdavis.edu/~mitrovic",
  "status": "success",
  "content": "Slobodan Mitrovic I am an assistant professor in the Department of Computer Science at UC Davis. I also hold a guest professor position in the Department of Mathematics and Informatics at the University of Novi Sad. Prior to that, I was a Postdoctoral Fellow at the Theory of Computation group, CSAIL, at MIT and I was fortunate to have Ronitt Rubinfeld as my host. I received my PhD degree from the Computer Science department at EPFL, advised by Aleksander MÄ dry. After finishing my PhD and prior to coming to MIT, I spent two months at ETH hosted by Mohsen Ghaffari. My research has been generously supported by the National Science Foundation (NSF) Faculty Early Career Development Program (CAREER) and Google Research Scholar Program. Research interests: Broadly speaking, I am interested in algorithmic graph theory and the combinatorial approach to optimization. My research focuses on designing efficient algorithms in the context of memory-constrained computation, such as parallel, distributed, streaming and local computation. Prospective students: If you are interested in my research and in working with me, please contact me. Please note that for a student to get admitted, it is necessary to submit the application through the official portal. Please check the instruction page for the deadline. Current group members: Srikkanth Ramachandran, PhD student, 2023 -- Wen-Horng (Ben) Sheu, PhD student, 2023 -- Theodore Pan, PhD student, 2024 -- (undergraduate student, 2022 -- 2024) Professional Activities Program Committees: STOC 2026, ICALP 2025, SOSA 2025, SAND 2023, STOC 2023, ICALP 2022, SWAT 2022. Organizing an algorithmic-puzzle solving event Aggie Competitive Programming Contest (ACPC): 2025, 2024, 2023 Teaching ECS 122A -- Algorithm Design and Analysis (Winter Quarter 2025) ECS 122A -- Algorithm Design and Analysis (Summer Session 1 2024) ECS 189A -- Special Topics in Computer Science Theory (Winter Quarter 2024) ECS 189A -- Special Topics in Computer Science Theory (Spring Quarter 2023) ECS 289A -- Special Topics in Computer Science Theory (Fall Quarter 2022) ECS 122A -- Algorithm Design and Analysis (Spring Quarter 2022) Publications Approximate counting of permutation patterns Omri Ben-Eliezer, Slobodan MitroviÄ, Pranjal Srivastava ACM - SIAM Symposium on Discrete Algorithms, SODA 2026 Simple Average-case Analysis of Recursive Randomized Greedy MIS Mina Dalirrooyfard, Konstantin Makarychev, Slobodan MitroviÄ 9th SIAM Symposium on Simplicity in Algorithms, SOSA 2026 New Parallel and Streaming Algorithms for Directed Densest Subgraph Slobodan MitroviÄ, Theodore Pan, Mahdi Qaempanah, Mohammad Amin Raeisi 39th Conference on Neural Information Processing Systems, NeurIPS 2025 Differentially Private Gomory-Hu Trees Anders Aamand, Justin Y. Chen, Mina Dalirrooyfard, Slobodan MitroviÄ, Yuriy Nevmyvaka, Sandeep Silwal, Yinzhan Xu 39th Conference on Neural Information Processing Systems, NeurIPS 2025 A framework for boosting matching approximation: parallel, distributed, and dynamic Slobodan MitroviÄ, Wen-Horng Sheu 37th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA 2025 Faster MPC Algorithms for Approximate Allocation in Uniformly Sparse Graphs Jakub ÅÄ cki, Slobodan MitroviÄ, Srikkanth Ramachandran, Wen-Horng Sheu 37th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA 2025 Breaking the n1.5 Additive Error Barrier for Private and Efficient Graph Sparsification via Private Expander Decomposition Anders Aamand, Justin Y. Chen, Mina Dalirrooyfard, Slobodan MitroviÄ, Yuriy Nevmyvaka, Sandeep Silwal, Yinzhan Xu 42nd International Conference on Machine Learning, ICML 2025 Sparse-pivot: Dynamic correlation clustering for node insertions Mina Dalirrooyfard, Konstantin Makarychev, Slobodan MitroviÄ 42nd International Conference on Machine Learning, ICML 2025 (Spotlight poster) Faster Semi-streaming Matchings via Alternating Trees Slobodan MitroviÄ, Anish Mukherjee, Piotr Sankowski, Wen-Horng Sheu 52nd International Colloquium on Automata, Languages, and Programming, ICALP 2025 A video presentation at WoLA 2024 Parallel Set Cover and Hypergraph Matching via Uniform Random Sampling Laxman Dhulipala, Michael Dinitz, Jakub ÅÄ cki, Slobodan MitroviÄ 38th International Symposium on Distributed Computing, DISC 2024 Locally computing edge orientations Slobodan MitroviÄ, Ronitt Rubinfeld, Mihir Singhal 32nd European Symposium on Algorithms, ESA 2024 Pruned Pivot: Correlation Clustering Algorithm for Dynamic, Parallel, and Local Computation Models Mina Dalirrooyfard, Konstantin Makarychev, Slobodan MitroviÄ 41st International Conference on Machine Learning, ICML 2024 (Oral presentation) Faster Streaming and Scalable Algorithms for Finding Directed Dense Subgraphs in Large Graphs Slobodan MitroviÄ, Theodore Pan 41st International Conference on Machine Learning, ICML 2024 Dynamic PageRank: Algorithms and Lower Bounds Rajesh Jayaram, Jakub ÅÄ cki, Slobodan MitroviÄ, Krzysztof Onak, Piotr Sankowski 51st International Colloquium on Automata, Languages, and Programming, ICALP 2024 Nearly Tight Bounds For Differentially Private Multiway Cut Mina Dalirrooyfard, Slobodan MitroviÄ, Yuriy Nevmyvaka 37th Conference on Neural Information Processing Systems, NeurIPS 2023 (Oral presentation) New Partitioning Techniques and Faster Algorithms for Approximate Interval Scheduling Spencer Compton, Slobodan MitroviÄ, Ronitt Rubinfeld 50th International Colloquium on Automata, Languages, and Programming, ICALP 2023 Invited to Algorithmica fast-track issue for ICALP 2023 papers. Near-Optimal Correlation Clustering with Privacy Vincent Cohen-Addad, Chenglin Fan, Silvio Lattanzi, Slobodan MitroviÄ, Ashkan Norouzi-Fard, Nikos Parotsidis, Jakub Tarnawski 36th Conference on Neural Information Processing Systems, NeurIPS 2022 Parallel Algorithms for Small Subgraph Counting Amartya Shankha Biswas, Talya Eden, Quanquan C. Liu, Slobodan MitroviÄ, Ronitt Rubinfeld International Conference on Approximation Algorithms for Combinatorial Optimization Problems, APPROX 2022 Massively Parallel Algorithms for b-Matching Mohsen Ghaffari, Christoph Grunau, Slobodan MitroviÄ 34th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA 2022 Deterministic (1+Îµ)-Approximate Maximum Matching with poly(1/Îµ) Passes in the Semi-Streaming Model Manuela Fischer, Slobodan MitroviÄ, Jara Uitto 54th ACM Symposium on Theory of Computing, STOC 2022 Online Page Migration with ML Advice Piotr Indyk, Frederik Mallmann-Trenn, Slobodan MitroviÄ, Ronitt Rubinfeld 25th International Conference on Artificial Intelligence and Statistics, AISTATS 2022 Correlation Clustering in Constant Many Parallel Rounds Vincent Cohen-Addad, Silvio Lattanzi, Slobodan MitroviÄ, Ashkan Norouzi-Fard, Nikos Parotsidis, Jakub Tarnawski 38th International Conference on Machine Learning, ICML 2021 (Oral presentation) Massively Parallel Algorithms for Distance Approximation and Spanners Amartya Shankha Biswas, Michal Dory, Mohsen Ghaffari, Slobodan MitroviÄ, Yasamin Nazari 33th ACM Symposium on Parallelism in Algorithms and Architectures, SPAA 2021 Fully Dynamic Algorithm for Constrained Submodular Optimization Silvio Lattanzi, Slobodan MitroviÄ, Ashkan Norouzi-Fard, Jakub Tarnawski, Morteza Zadimoghaddam 34th Conference on Neural Information Processing Systems, NeurIPS 2020 (Oral presentation) Fairness in Streaming Submodular Maximization: Algorithms and Hardness Marwa El Halabi, Slobodan MitroviÄ, Ashkan Norouzi-Fard, Jakab Tardos, Jakub Tarnawski 34th Conference on Neural Information Processing Systems, NeurIPS 2020 Walking Randomly, Massively, and Efficiently Jakub ÅÄ cki, Slobodan MitroviÄ, Krzysztof Onak, Piotr Sankowski 52nd ACM Symposium on Theory of Computing, STOC 2020 video Space Efficient Approximation to Maximum Matching Size from Uniform Edge Samples Michael Kapralov, Slobodan MitroviÄ, Ashkan Norouzi-Fard, Jakab Tardos ACM - SIAM Symposium on Discrete Algorithms, SODA 2020 Improved Local Computation Algorithm for Set Cover via Sparsification Christoph Grunau, Slobodan MitroviÄ, Ronitt Rubinfeld, Ali Vakilian ACM - SIAM Symposium on Discrete Algorithms, SODA 2020 Improved Parallel Algorithms for Density-Based Network Clustering Mohsen Ghaffari, Silvio Lattanzi, Slobodan MitroviÄ 36th International Conference on Machine Learning, ICML 2019 (Oral presentation) Weighted Matchings via Unweighted Augmentations Buddhima Gamlath, Sagar Kale, Slobodan MitroviÄ, Ola Svensson ACM Symposium on Principles of Distributed Computing, PODC 2019 Adversarially Robust Submodular Maximization under Knapsack Constraints Dmitrii Avdiukhin, Slobodan MitroviÄ, Grigory Yaroslavtsev, Samson Zhou 25th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, KDD 2019 Beyond 1/2-Approximation for Submodular Maximization on Massive Data Streams Ashkan Norouzi-Fard, Jakub M Tarnawski, Slobodan MitroviÄ, Amir Zandieh, Aida Mousavifar, Ola Svensson 35th International Conference on Machine Learning, ICML 2018 (Oral presentation) Improved Massively Parallel Computation Algorithms for MIS, Matching, and Vertex Cover Mohsen Ghaffari, Themis Gouleakis, Christian Konrad, Slobodan MitroviÄ, Ronitt Rubinfeld ACM Symposium on Principles of Distributed Computing, PODC 2018 Round Compression for Parallel Matching Algorithms Artur Czumaj, Jakub ÅÄ cki, Aleksander MÄ dry, Slobodan MitroviÄ, Krzysztof Onak, Piotr Sankowski 50th ACM Symposium on Theory of Computing, STOC 2018. Invited to the special issue. video TCS+ by Artur Czumaj A Fast Algorithm for Separated Sparsity via Perturbed Lagrangians Aleksander MÄ dry, Slobodan MitroviÄ, Ludwig Schmidt The 21st International Conference on Artificial Intelligence and Statistics, AISTATS 2018 Streaming Robust Submodular Maximization: A Partitioned Thresholding Approach Slobodan MitroviÄ, Ilija Bogunovic, Ashkan Norouzi-Fard, Jakub M Tarnawski, Volkan Cevher 31th Conference on Neural Information Processing Systems, NIPS",
  "content_length": 11521,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:07"
}