{
  "name": "Slobodan Vucetic",
  "homepage": "http://www.dabi.temple.edu/~vucetic",
  "status": "success",
  "content": "Slobodan Vucetic - Center for Data Analytics and Biomedical Informatics College of Science and Technology Center for Data Analytics and Biomedical Informatics Search Menu Temple-Logo-T-Header Center for Data Analytics and Biomedical Informatics Search Close Menu Slobodan Vucetic Home » Slobodan Vucetic Profile Director, Center for Hybrid Intelligence (CHI) (former Center for Cognitive Computing)Professor, Department of Computer and Information Sciences (CIS)Temple UniversityAddress: 1925 N. 12th St., 314 SERCPhiladelphia, PA 19122-6094Telephone: (215) 204-5535Fax: (215) 204-5082Email: vucetic@temple.eduOffice: 314 SERCResume: View News (December 2020) Co-organizing a NAACL Workshop on Data Science with Human in the Loop: Language Advances(October 2020) Our paper about job title normalization accepted at COLING 2020, the first author is Phong Ha, an undergraduate student(September 2020) New NSF Future of Work project aimed at helping young adults with neurodevelopmental disabilities have careers in IT(August 2020) Co-organizing a KDD Workshop on Data Science with Human in the Loop(Spring/Summer 2020) Two papers resulting from our NSF project about cancer epidemiology published in Epidemiology and in Cancer Epidemiology and Prevention Biomarkers(May 2020) Our paper about scalable SVMs got accepted at ICML 2020(May 2020) Our paper on the state of the art protein secondary structure prediction published in PLOS One(January 2020) New ONR research project aimed at advancing additive technology(December 2019) Congratulations to Maxim for defending his Ph.D. thesis(September 2019) New NSF Growing Convergence Research project aimed at better understanding epistasis in biology Research Interest Research Areas Highlights Representative Funded Research Projects Program Committee member (in 2019) Research Areas Human Factors in Artificial IntelligenceArtificial IntelligenceData ScienceApplied Machine LearningBiomedical InformaticsBioinformaticsI am interested in solving real-life data science problems through development of novel machine learning algorithms. I am also interested in building software that has intelligent behavior and can enhance human capabilities. My research is driven by open data science problems in a wide array of disciplines such as Public Health, Biomedicine, Physical Sciences, Education, Marketing, Social Sciences, Traffic Engineering, and Industrial Engineering. Highlights 2018 Ranking of the U.S. Computer Science Doctoral Programs Our recent study revealed that U.S. News ranking of CS doctoral programs, which is based purely on peer assessment, is surprisingly highly correlated with faculty citations. Our resulting ranking is available here.CAREER award from National Science FoundationOutstanding paper at IJCAI 2013: Best paper in the AI and Computational Sustainability TrackLeader of one of the top performing teams at Critical Assessment of Protein Function Annotation (CAFA) 2010-11, 2013-14, and 2016-17Member of a team with the best protein disorder predictor at Critical Assessment of protein Structure Prediction (CASP) 5, 6, and 7 (Protein Structure Prediction Assessment) Representative Funded Research Projects Personalized Virtual Job Assistant for Neurodiverse Individuals  (funded by the National Science Foundation) Understanding Epistasis: the Key for Genotype to Phenotype Mapping (funded by the National Science Foundation) Deep Learning for Representation of Medical Claims (funded by the National Institutes of Health) Space-Time Models for Health Geographic Analysis (funded by the National Science Foundation) Customizing Therapy for Individuals with Autism (funded by the National Science Foundation) Discriminative Modeling of Spatial-Temporal Data in Remote Sensing (funded by the National Science Foundation) Dynamic Evolution of Smart-Phone Based Emergency Communications Network (funded by the National Science Foundation) Computational Advertising (supported by Yahoo! Faculty Research and Engagement Program) Memory-Constrained Predictive Data Mining (funded by the National Science Foundation) Machine Learning for Distributed Fault Diagnosis (supported by ExxonMobil) Bioinformatics – Genomics, Analysis of Protein Disorder, Proteomics, Biomedical Text Mining (funded by Pennsylvania Department of Health, NIH) Program Committee member (in 2019) 36nd International Conference on Machine Learning (ICML)25st ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD)28th International Joint Conference on Artificial Intelligence (IJCAI)8th International Conference on Learning Representations (ICLR)22th International Conference on Artificial Intelligence and Statistics (AISTATS)57th Annual Meeting of the Association for Computational Linguistics (ACL)Empirical Methods in Natural Language Processing Conference 2019 (EMNLP)The World Wide Web Conference 2019 (WWW)28th ACM International Conference on Information and Knowledge Management (CIKM)27th International Conference on Intelligent Systems for Molecular Biology (ISMB) Recent Representative Publications (for the full list, check my Google Scholar page and a list with many preprints) Bai, T., Egleston, B.L., Bleicher, R., Vucetic, S., Medical Concept Representation Learning from Multi-Source Data, International Joint Conference on Artificial Intelligence (IJCAI), Macao, 2019.Zhang, S., He, L., Dragut, E., Vucetic, S., How to Invest my Time: Lessons from Human-in-the-Loop Entity Extraction, ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), Anchorage, 2019.Bai T., Vucetic, S., Improving Medical Code Prediction from Clinical Text via Incorporating Online Knowledge Sources, The World Wide Web Conference (WWW), San Francisco, 2019.Maiti, A., Vucetic, S., Spatial Aggregation Facilitates Discovery of Spatial Topics, Annual Meeting of the Association for Computational Linguistics (ACL), Florence, 2019.Shapovalov, M., Vucetic, S., Dunbrack, Jr, R.L., A New Clustering and Nomenclature for Beta Turns Derived from High-Resolution Protein Structures, PLoS Computational Biology, 15 (3), 2019.Vucetic, S., Chanda, A.K., Zhang, S., Bai, T., Maiti, A., Peer Assessment of CS Doctoral Programs Shows Strong Correlation with Faculty Citations, Communications of the ACM, 61:09, 70-77, 2018.Bai, T., Chanda, A.K., Egleston, B.L., Vucetic, S., EHR Phenotyping via Jointly Embedding Medical Concepts and Words into a Unified Vector Space, BMC Medical Informatics and Decision Making, 2018.Bai, T., Zhang, S., Egleston, B.L., Vucetic, S., Interpretable Representation Learning for Healthcare via Capturing Disease Progression through Time, ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), London, 2018. Zhang, S., He, L., Vucetic, S., Dragut, E., Regular Expression Guided Entity Mention Mining from Noisy Web Data, Empirical Methods in Natural Language Processing Conference (EMNLP), Brussels, 2018. Students Current Students Graduated Ph.D. Students For Prospective Students Current Students Aniruddha Maiti (Ph.D., joined 2015, M.S. from Indian Institute of Technology-Kharagpur)Ashis Chanda (Ph.D., joined 2016, M.S. from University of Dhaka)Ziyu Yang (Ph.D., joined 2017, B.S. from University of Science and Technology of China)Saman Enayati (Ph.D., joined 2017, B.S. from Amirkabir University of Technology)Sandro Hauri (Ph.D., joined 2018, M.S. from Swiss Federal Institute of Technology in Zurich)Tamara Katic (Ph.D. joined 2019, M.S. from University of Novi Sad)Sai Shi (Ph.D., joined 2019, M.S. from University of California-Irvine)Piyush Borole (P.D., joined 2019, M.S. from University of Pennsylvania)Beth Garrison (Ph.D., joined 2019, B.S. from Temple University)Hanzi Xu (Ph.D., joined 2020, M.S. from Georgetown University)Dalvir Singh (4+1 student)Shakirah Cooper (undergraduate)Abigail Liu (undergraduate)Tuan Lam (undergraduate)Sameera Rachakonda (undergraduate)Annica Chiu (undergraduate)Rachel Lazzaro (undergraduate)Carlos Gonzalez (undergraduate) Graduated Ph.D. Students Maxim Shapovalov (Ph.D., 2020, first position: Postdoc, Fox Chase Cancer Center)Tian Bai (Ph.D., 2019, first position: Software Engineer, Google)Shanshan Zhang (Ph.D., 2019, first position: Research Scientist, Facebook)Vladimir Coric (Ph.D., 2014, first position: Lead Data Scientist, SEI Investments)Nemanja Djuric (Ph.D., 2013, first position: Research Scientist, Yahoo! Labs, current: Uber ATC)Liang Lan (Ph.D., 2012, first position: Research Scientist, Huawei Noah Ark Lab, current: Assistant Prof., Hong Kong Baptist University)Mihajlo Grbovic (Ph.D., 2012, first position: Research Scientist, Yahoo! Labs, current: Airbnb)Vuk Malbasa (Ph.D., 2011, first position: Postdoc, Texas A&M University, current: Assistant Prof., University of Novi Sad)Zhuang Wang (Ph.D., 2010, first position: Research Scientist, Siemens Corporate Research, current: Facebook) For Prospective Students I am interested in advising self-motivated graduate students interested in machine learning, cognitive computing, and data science. I am looking both at the traditional computer science students and at the non-CS students with a strong background in mathematics (with degrees such as electrical engineering, physics, operations research, applied math, statistics). Interested students are encouraged to contact me by e-mail. Please, send me your CV and write a short description about your academic background and research interests. Recent Teaching Fall 2020: Machine Learning (CIS 5526)Spring 2020: Principles of Data Science (CIS 3715)Fall 2019: Machine Learning (CIS 5526)Spring 2019: Principles of Data Science (CIS 3715)Fall 2018: Machine Learning (CIS 5526)Spring 2018: Principles of Data Science (CIS 3715)Spring 2017: Principles of Data Science (CIS 3715)Fall 2015: Machine Learning (CIS 5526)Fall 2015: Math Concepts in Computing I (CIS 1166)Spring 2015: Principles of Data Science (CIS 3715)Spring 2015: Math Concepts in Computing II (CIS 2166)Fall 2014: Machine Learning (CIS 5526)Fall 2013: Introduction to Computer ",
  "content_length": 10337,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:12"
}