{
  "name": "Smruti Sarangi",
  "homepage": "http://www.cse.iitd.ac.in/~srsarangi",
  "status": "success",
  "content": "Homepage of Dr. Smruti Ranjan Sarangi Homepage Research Teaching articles& Views Open Positions Media Contact systems research at iit delhi Publications Research Projects Students Smruti Ranjan Sarangi Hi-Tech robotics and autonomous systems chair Professor in Computer science and Engg., Founder thought2Design Systems, Head Computer Services Center Prof. Smruti Ranjan Sarangi is a full Professor in the Computer Science and Engineering Department at IIT Delhi. He primarily works in the area of EDA/CAD, intelligent systems and cyber-security. He is an IEEE senior member. He is currently looking at the following sub-areas: AI-based design of large engineering systems: CAD models, drones, PCB designs Augmented, virtual reality and LLM-based applications in the scientific/data-oriented computing space. Accelerators for computer graphics, visualization and LLM applications ML-based algorithms for computer-aided design (CAD) applications Secure design of engineering systems using AI/ML: machines and PCBs Dr. Sarangi obtained his Ph.D in computer science from the University of Illinois at Urbana Champaign(UIUC), USA  in 2006, and a B.Tech in computer science from IIT Kharagpur in 2002. After completing his Ph.D he has worked in Synopsys Research, and IBM Research Labs. He is the founder of Thought2Design Systems Pvt. Ltd., a deep-tech startup on AI/ML-based CAD and HPC services incubated at IIT Delhi. He is also the Head of the Computer Services Center that manages and develops the entire IT system of IIT Delhi. He has been granted five US patents and five Indian patents (two more in the application stage), and has published 139 papers in reputed international conferences and journals. He has published two popular books on computer architecture:  (1) \"Basic Computer Architecture\", WhiteFalcon, 2021, (2) and \"Next-Gen Computer Architecture\", WhiteFalcon, 2023.  He is currently the Associate Editor of the Elsevier Journal of Systems Architecture. He takes an active interest in teaching and technology-enhanced learning. He is currently the HoD of the Educational Technology Services Center. He has gotten the teaching excellence award in IIT Delhi in 2014 and is the latest recipient of the ACM Outstanding Contributions to Computing Education Award (OCCE, 2022). He got the Qualcomm Faculty Award in 2021 and has numerous best paper awards and nominations to his credit. He currently directs the SRISHTI research group at IIT Delhi, which focuses on core systems and architecture research. The SRISHTI group has released the popular Tejas architectural simulator. Tejas can be used to simulate complex multicore processors. Its unique selling point is that it is written in Java, and is very easy to use and modify. In terms of performance, accuracy, and features it is competitive with other widely used simulators. Other widely used software include the emuArm ARM ISA emulator, and the UsiFe file system. He has been involved in major educational initiatives at the national level. These include co-designing the entire computer science curriculum for the CBSE board (largest school board in the world). It can be found here. He has also chaired the committee to design AICTE's vocational education curriculum in computer graphics and animation. He is a member of many other high-powered committees constituted by the Ministry of IT, CBSE, and UGC. He is perennially in search of smart student colleagues to solve challenging research problems of mutual interest. Please use this site to find relevant information about his research, publications, courses, advice to graduate students and summer interns, views about pursuing higher studies in India and abroad, and relevant contact information. Curriculum Vitae NEWS EVEnTS, Accomplishments Apr '22 Sandeep's paper accepted in Middleware Mar '22 Diksha Moolchandani's Ph.D defence on March 29th. Joined as a researcher in IMEC Belgium. Nov '21 Pallavi Sethi's IoT survey crosses 1000 citations Mar '20 5 papers accepted in DAC (4 posters and 1 full paper on thermal simulation). PINNED POSTS Information regarding admission, projects, ADVICE to prospective students and general trivia Why do a Ph.D? How to prepare for a Ph.D interview? Career options after a Ph.D in computer systems. Should I do a Ph.D in the US or Europe? Consultancy/ Sponsored research Why most Indian Startups Fail? Preparing for IIT JEE - My Way My academic family tree opyright (c) 2010. Smruti R. Sarangi. All rights reserved.",
  "content_length": 4482,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:08"
}