{
  "name": "Sneha Kumar Kasera",
  "homepage": "https://www.cs.utah.edu/~kasera",
  "status": "success",
  "content": "Sneha Kasera Faculty Site Skip to content Sneha Kumar Kasera Associate Dean for Academic Affairs, John and Marcia Price College of Engineering Professor, Kahlert School of Computing Academic Chair, Stena Center for Financial Technology About me: I joined the University of Utah in 2003. From 1999-2003, I was a member of technical staff in the Mobile Networking Research Department of Bell Laboratories. Earlier, I received a PhD in Computer Science from the University of Massachusetts Amherst (advisors: Jim Kurose and Don Towsley), and a master's degree in Electrical Communication Engineering from the Indian Institute of Science Bangalore (advisor: Utpal Mukherji). Research I am leading the Advanced Networked Systems Research (ANSR) Lab that I founded in 2003. My research interests include networks and systems - technologies, protocols and applications encompassing mobile and pervasive systems and wireless networks, artificial intelligence, security, privacy, and reliability, sensing, crowdsourcing, dynamic spectrum access, software-defined radios, network resource management, network measurements and models. Selected Papers Complete List Selected Professional Activities Program Co-Chair – IEEE WoWMoM Symposium 2020 Program Co-Chair – ACM WiSec Conference 2017 Program Co-Chair – ACM MobiCom Conference 2015 Steering Committee Member - IEEE SECON, 2012-2018 Associate Editor - IEEE/ACM Transactions on Networking, 2011-2015 Associate Editor - IEEE Transactions on Mobile Computing, 2009-2013 Program Co-Chair – IEEE ICNP 2011 Program Co-Chair – IEEE SECON 2011 Teaching Fall 2025: CS 6957: Secure Computing Projects Spring 2025: CS 6490: Network Security CS 6957: Secure Computing Projects Graduate Students PhD Students Current Students Ayaz Mahmud Aarushi Sarbhai J. Phillip Smith Past Students Arijit Banerjee (at Federated Wirele Aniqua Baset (at Aerospace Corporation) Mojgan Khaledi Jun Cheol Park (at Adobe) Phil Lundrigan (faculty member at BYU) Joe Novak (at Raytheon) Sriram Premnath (at Qualcomm) Matthew Probst (at Quantum Black) Rob Ricci (faculty member at University of Utah) Shamik Sarkar (postdoc at UCLA) Junxing Zhang (faculty member at Inner Mongolia University, China) MS Thesis Students Current Students Gaurav Sharma Past Students Pavithra Chidambaram (at Microsoft) Michael Clark (at Riverside Research) Anuj Dimri (at American Family Insurance) Naveen D.S. (at Amazon) Anneswa Ghosh (at Microsoft) Suman Jana (faculty member at Columbia University) Prarthana Lakshmane Gowda (at Cisco) Manas Maheshwari (at Apple) Shobhi Maheshwari (at Tableau) Swaminathan Pichumani (at Google) Siddharth Ramesh (at Microsoft) Aakanksha Saha (at Microsoft) Aarushi Sarbhai (PhD student at University of Utah) Manav Seth (at Microsoft) Harsimran Singh (at Microsoft)",
  "content_length": 2791,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:14"
}