{
  "name": "Snehanshu Saha",
  "homepage": "https://www.bits-pilani.ac.in/goa/snehanshus/profile",
  "status": "success",
  "content": "Snehanshu Saha - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Mechanical) B.E.(Electrical and Electronics) B.E.(Computer Science) M.Sc.(Biological Sciences) B.E.(Chemical) M.Sc.(Physics) B.E.(Electronics and Instrumentation) M.Sc.(Chemistry) M.Sc.(Mathematics) M.Sc.(Economics) B.E.(Electronics and Communication) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E.(Embedded Systems) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Microelectronics) M.E.(Biotechnology) M.E.(Chemical) M.E.(Mechanical) M.E.(Design Engineering) M.E.(Computer Science) M.E.(Environmental Engineering) Doctor Programmes Electrical & Electronics Engineering Economics & Finance Physics Biological Sciences Humanities & Social Sciences Chemical Engineering Mathematics Computer Science & Information Systems Chemistry Mechanical Engineering Admission Overview Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Sophisticated Instruments Repository Department Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Faculty Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Students Student Activities Events & Festivals BITScan Picture Gallery Video Gallery Annual Magazine Student Services Admissions Convocation Academic Undergraduate Studies Division (AUGSD) Student Welfare Division Anti Ragging Academic Calendar 2025-26 Prevention of sexual Harassment Wellness & Emergency Helplines For Prospective Students Campus Facilities View Campus Academic Bulletin 2025-26 PMP - A Students’ Initiative Students Club NIRMAAN - Social Responsibility Electronics and Robotics Club (ERC) Centers Teaching Learning Centre Center for Technical Education AI Centre Alumni Quick Links Wellness & Emergency Helplines BITS Goa Virtual Tour Login Links Divisions, Units and Cell Forthcoming Seminars & Workshops Campus Events Calendar About Us Administrative Contacts JRF/SRF/RA Positions Library BITS Media Outreach Hotels around BITS Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Snehanshu Saha K K Birla Goa Computer Science & Information Systems Professor, Department of Computer Science and Information Systems & Co-ordinator-APPCAIR Data Science and Artificial Intelligence Department of Computer Science and Information Systems, BITS Pilani K K Birla Goa Campus, Zuarinagar snehanshus@goa.bits-pilani.ac.in snehanshu.saha@ieee.org +91 08322580855 https://www.linkedin.com/in/snehanshusaha/?originalSubdomain=in Google-Scholar APPCAIR Old Profie About the Faculty Snehanshu SahaProfessor, Computer Science and Information Systems and Co-ordinator-APPCAIRBITS PILANI K K K BIRLA GOA CAMPUS (JOINED: 31/12/2019)https://www.bits-pilani.ac.in/goa/appcair/peoplehttps://github.com/sahamath/sym-netv1 (Codes/Data)Google-Scholar: https://scholar.google.com/citations?user=C-Qm2LcAAAAJ&hl=en (Full List of Publications)Citations: 1405; h-index: 17; i-10 index: 31 Email: snehanshus@goa.bits-pilani.ac.in; snehanshu.saha@ieee.org; T +91 08322580855Citations (As BITS PIlani Faculty): 131 Co-Founder and Director of Research-HappyMonk AI Labs (Bangalore and Goa); SM-IEEE, SM-ACMAcademic Training PhD in Shallow water Waves and Partial Differential Equations , Mathematical Sciences - University of Texas Arlington, 2008, Texas, USA. MS Computational Mathematics - Clemson University, , Clemson, SC, USA. 2003 BE (Computer Science and Engineering)-Jawharlal Nehru National College of Engineering (First Class with Distinction), 1999 I develop methods in Computational Learning Theory (COLT), Mathematics of Data Science (MDS), AstroInformatics (AIM) and novel ML/Modeling applications (AML). These and interpretable Deep learning techniques and acceleration in deep and wide neural networks, aided by chaos-causality paradigm are my current and future research interests. My Open Source Educational Initiatives include the following: 1. Machine Learning Blog: https://beginningwithml.wordpress.com/ 2. Youtube Channel: https://tinyurl.com/yyg7skpf I have contributed more than 100 articles in top ranked conferences and Journals including several IEEE and ACM Transactions and am a Senior Member-IEEE, Senior Member-ACM and a Fellow-IETE. I contributed to the theory of machine learning/deep learning and meta-heuristics and developed several state-of-the-art methods in Deep Learning based classification tasks, optimizers for non-convex problems, proposed a novel anomaly detection method for univariate and multivariate time series data and interpretable tools in Deep learning. I have 03 European Patents, several Sponsored Projects and contributed to Open Source Educational Initiatives. I have designed and introduced a new course, Computational Learning Theory for UG/PG students. I led IEEE Computer Society Bangalore chapter to new heights and helped secure them the best global chapter in 2019. I'm  a co-founder of HappyMonk AI, an AI product company. Note to students: Since I work in foundational machine learning, it is exceedingly difficult for me to accept semester-long projects/SOPs etc. If you're committed for the grind, spanning at least a year, let's talk!Research Interest I develop methods in Computational Learning Theory (COLT) and Mathematics of Data Science (MDS) Techniques I focus on: Pointwise smooth approximations of gradient, discovering activation functions from data, smoothness and convexity studies of loss functions, methods in interpretable deep learning, novel loss functions in back-propagation, Chaos-causality in Deep Neural Networks, pruning/compression in Deep Neural Networks, Kernels for Classical Learning Goals: Efficient, reliable and robust Inferences (One Landscape) Dreams: Porting methodological elegance of classical machine learning to deep learning Tools I use: Measure Theory, NonLinear Optimization, Functional Analysis, Econometrics, Dynamical Systems, Algorithms Applications: Biology, Healthcare, AstroInformatics, Transportation, Industrial Systems and Automation I have initiated a new focus group on Astroinformatics, in collaboration with a few colleagues in Indian Institute of Astrophysics and National Institute of Advanced Studies. All code bases related to the group's research are available at : https://github.com/sahamath Administrative Responsibilities Department-Level: DAC member: 2020-22; DRC member: 2020-24 Institute-Level: Chair- the Scientometrics and Ranking committee (2022-current); Member-Convocation committee (2022) University-Level: Core Committee: Website revamp",
  "content_length": 11682,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:10"
}