{
  "name": "Snigdha Chaturvedi",
  "homepage": "https://sites.google.com/site/snigdhac",
  "status": "success",
  "content": "Snigdha ChaturvediSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeI am an Associate Professor at UNC-Chapel Hill. I am also the Associate Chair for Research at UNC's CS department. Before this, I was an Assistant Professor at UC-Santa Cruz and a postdoctoral researcher in Dan Roth's group at the University of Pennsylvania and University of Illinois, Urbana-Champaign. I finished my PhD in Computer Science at the University of Maryland, College Park working with Dr. Hal Daume III. Before joining UMD, I was a Blue Scholar in the Information Management team at IBM-India Research Labs, New Delhi from Aug. 2009 to Aug. 2011. My undergraduate years were spent in Indian Institute of Technology (IIT), Kanpur from where I graduated in 2009 as a BTech in Computer Science and Engineering. My lab focuses on Nature Language Processing with a focus on narrative-like and socially aware understanding, summarization, and generation of language. You can find more details about and recent publications on my research page.Note for prospective graduate students: Please check out my research and advisees pages to know more about our work or chat with my awesome students. Depending on the pool of applicants and my funding situation, I intend to take a student or so every year. If you are interested in working with me, please apply to our graduate program and list me as a faculty of interest. Note for undergraduate students: If you are writing to me about working with me, introduce yourself (which year are you in) and your background (what you know about ML/NLP though this is not a pre-requisite), and include your resume and transcript. Also, I don't have summer internship positions in my lab. If you are a graduate or undergraduate student and you are writing to me with a question that was not answered here,  include \"CMPS\" in your subject so that it doesn't go to my spam folder and I know that you have read this :) Some useful links:Advice for prospective NLP PhD students. Some more grad-school application related advice.-----------------------------------------------------------------------------------------------------------------------------------------------News:-- May 2020: Our paper on MOOC forum analysis using multi-task learning has been accepted for EDM 2020. Congrats to Faeze Brahman.-- April 2020: Two papers accepted for ACL 2020 on data-to-text generation and depression prediction. Congrats to Chao Zhao and Alex Rinaldi. -- Jan 2020: Moved to UNC-CH.-- Nov 2019: Our paper on aspect-aware review summarization will appear in AAAI 2020. Congrats to Chao Zhao.   -- July 2019: Thanks to Creative Next for covering our lab's work on storytelling. Listen to the podcast here: https://creativenext.org/episodes/ai-augmented-storytelling/-- May 2019: Congratulations to my student, Faeze Brahman, for winning an award for her poster about automatic storytelling on UCSC's Data Science Day-- April 2018: Joining as an Assistant professor at UCSC-- April 8, 2016: Defended my dissertation!-- December 10, 2015: Magazine article on our work here-- November 12, 2015: 3 papers (on desire fulfillment and relationship modeling) accepted for presentation at AAAI 2016-- August 21, 2015: Selected for attending the WPI STEM Faculty Launch Program -- April 22, 2015: Awarded the Kulkarni Summer Research Fellowship by UMD for this summer.-- March 12, 2015: My IBM PhD Fellowship was renewed. Thanks IBM :) News on CS@UMD-- October 10, 2014: Won first place at the ACM SRC (Student Research Competition) held at Grace Hopper Conference, 2014.  News on ACM webpage. (experience) (slides) (poster) (twitter) -- April 18, 2014: Will be going back to IBM T J Watson Research Center in Yorktown Heights for internship this summer. I will be working with Dmitry Malioutov, Rick Lawrence and team.-- Mar 5, 2014: Our paper titled 'Predicting Instructor Intervention in MOOC Forums' was accepted for presentation at ACL 2014-- Feb 25, 2014: Won best poster award at Google DC PhD Summit, Washington DC-- Feb 18,2014: Received IBM PhD Fellowship, 2014-15. News on CS@UMD's webpage.-- December 27, 2013: Paper on 'Joint Question Clustering and Relevance Prediction for Open Domain Non-Factoid Question Answering' accepted at WWW2014-- October 5, 2013: Attended the Grace Hopper Conference, 2013-- September 18, 2013: Paper on 'Discriminatively Enhanced Topic Models' accepted in ICDM, 2013-- July 23, 2013: Got the Grace Hopper Scholarship to attend the conference (view my profile here) Will be in Minneapolis in October.-- Summer, 2013: I am an intern at IBM TJ Watson research Center working on QA with Vittorio Castelli and team.-- Got my RA appointment letter for Spring 2012. I'll be working with Dr. Hal Daume III--Attended Google Grad CS Forum at Mountain View, California, January 18-20, 2012-- Found links to the Google India Women in Engineering Award :) here, here and here and also to IITK convocation awards see page 39Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5037,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:09"
}