{
  "name": "Sobah Abbas Petersen",
  "homepage": "https://www.ntnu.edu/employees/sobah.a.petersen",
  "status": "success",
  "content": "Sobah Abbas Petersen - NTNU Sobah Abbas Petersen Download press photo Download press photo Foto: Close Sobah Abbas Petersen Associate Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering sap@ntnu.no +4792846595 310 PTS 2 Valgrinda, Trondheim Twitter Google Scholar About Sobah is an Associate Professor at the Information Systems and Software Engineering group, Department of Computer Science. Current research focus includes Smart and Sustainable Cities, Learning within and across cities and Enterprise Architecture and ecosystems. She has a PhD from NTNU and a MSc from University of Edinburgh (UK). Sobah has broad experience in multi-disciplinary research through International and national projects; a few examples are Accelerating Learning Through Technology/NFR; DESENT, SIMOLA, ProaSense, HUMAN, MIRROR, TARGET, GALA/EU. She has experience as project manager and unit leader. Link to recent Webinar on Designing Digital Transformation with Enterprise Architecture. Current projects SWELL Sustainable Built Environments for Health and WELL-being, NTNU Sustainability, Project Manager FME-ZEN Zero Emission Neighbourhoods, NFR,  Focus: ICT Coordination +CityxChange Positive Energy Districts, EU H2020, Focus: Digital ecosystems for smart city services URSA MAJOR Urban Sustainability in Action, NFR, Focus: Digital technologies for engagement and visualisation GES-App EU ERASMUS+ Design mobile game to support Global Employability Skills Teaching TDT4252 – Enterprise Architecture for Enterprise Innovation TD20 – Enterprise Architecture and Smart Cities TDT4857 - Experts in Teams Village on Smart Cities as Complex Systems Sobah is a member of the NTNU Centre for Sustainable ICT (CESICT), evaluates research proposals as an ERC Expert and has served as a member of the Steering Committee for the Institute of Psychology, NTNU. She recently participated in a panel discussion on NTNU and Sustainability. Publications 2025 Pham, Quynh-Lan Nguyen; Banerjee, Pradipta; Petersen, Sobah Abbas. (2025) Cities as Innovation Ecosystems – Game to Enhance City Learning Through Stakeholder Collaboration. Academic chapter/article/Conference paper Banerjee, Pradipta; Petersen, Sobah Abbas. (2025) Conceptual model of a set of ICT services to support city learning. Academic chapter/article/Conference paper Banerjee, Pradipta; Petersen, Sobah Abbas. (2025) A Conceptual Framework for City Learning to Drive City Transformations Utilising Contextual Knowledge Management: Insights from Theory and Practice. Proceedings of the European Conference on Knowledge Management Academic article Petersen, Sobah Abbas; Hæstad, Andreas; Lyngdal, Kay; Thingsaker, Thomas Evja. (2025) Managing resources and reducing Greenhouse Gas Emissions through Game-based Learning to achieve Zero Emission Farms. Academic chapter/article/Conference paper G., Bindu,; JP., Chandu,; Joseph, Ajith K.; Esau, Igor; Petersen, Sobah Abbas; Baklanov, Alexander. (2025) The Editors preface - Sustainable City Development – Environmental Scenarios in the Global South. Introduction Salaj, Alenka Temeljotov; Prabowo, Bintang Noor; Petersen, Sobah Abbas. (2025) Kochi Case study - Social group, practical outcome. Other presentation G., Bindu; PJ., Chandu; K., Joseph Ajith; Esau, Igor; Petersen, Sobah Abbas; Baklanov, Alexander. (2025) Sustainable City Development – Environmental Scenarios in the Global South - Report on the URSA MAJOR Hackathon 2024. Nansen Senter for Miljø og Fjernmåling (NERSC) Nansen Senter for Miljø og Fjernmåling (NERSC) Report Mishra, Sambeet; Silva, Thiago Lima; Hellemo, Lars; Jaehnert, Stefan; Egner, Lars Even; Petersen, Sobah Abbas. (2025) Agent-based modeling: Insights into consumer behavior, urban dynamics, grid management, and market interactions. Energy Strategy Reviews Academic literature review 2024 Banerjee, Pradipta; Petersen, Sobah Abbas. (2024) Designing Services for an ICT Platform to Support City Learning for Developing Smart Cities. Academic chapter/article/Conference paper Banerjee, Pradipta; Petersen, Sobah Abbas. (2024) Role of ICT in City Learning for Developing Smart Cities: A Review of the Literature. Academic chapter/article/Conference paper Banerjee, Pradipta; Petersen, Sobah Abbas. (2024) Key elements, processes and research gaps in city learning as an innovation ecosystem: A scoping review. ID&A Interaction design & architecture(s) Academic article Petersen, Sobah Abbas. (2024) Students’ Perspectives on Active Learning and Learning Sequences in Enterprise Architecture Modelling. Læring om læring Academic article Petersen, Sobah Abbas; Krogstie, John. (2024) The Interplay between Business Needs and Data Architecture Explored through Enterprise Architecture Models. CEUR Workshop Proceedings Academic article Fosvold, André; Petersen, Sobah Abbas. (2024) CitySIM – Agent-Based System for Modelling and Simulating Cities as Complex Adaptive Systems for Collaborative Governance. Academic chapter/article/Conference paper Krogstie, John; Petersen, Sobah Abbas; Oksavik, Odne Andreas; Skeie, Kristian. (2024) ICT-Architecture applied on pilot building. SINTEF akademisk forlag SINTEF akademisk forlag Report Rouvrais, Siegfried; Petersen, Sobah Abbas. (2024) An Architecture Framework for Higher Education. Academic chapter/article/Conference paper Ali, Gul Sher; Petersen, Sobah Abbas. (2024) Technology in Communal Spaces for Social Sustainability. ERCIM News Academic article 2023 Jacobsen, Bjørn Rude; Petersen, Sobah Abbas. (2023) Extended Reality for Sustainable Urban Development and Citizen Engagement. Academic chapter/article/Conference paper Petersen, Sobah Abbas; Iqbal, Maria; Williams, Alan; Baxter, Gavin. (2023) GES App - Mobile Application to support reflection and documentation of Global Employability Skills. IADIS International Journal on WWW/Internet Academic article Banerjee, Pradipta; Petersen, Sobah Abbas. (2023) Learning in Cities from Within and Across Cities: A Scoping Review. Triple Helix: A Journal of University-Industry-Government Innovation and Entrepreneurship Academic article Petersen, Sobah Abbas; Quayyum, Farzana; Krogstie, John. (2023) Criteria for selecting an Enterprise Modelling Method – Students' Perspectives on ArchiMate and 4EM. Enterprise Modelling and Information Systems Architectures - An International Journal Academic article Banerjee, Pradipta; Petersen, Sobah Abbas. (2023) How Cities Can Learn: Key Concepts, Role of ICT and Research Gaps. Academic chapter/article/Conference paper Petersen, Sobah Abbas; Iqbal, Maria; Williams, Alan; Baxter, Gavin. (2023) GES APP – SUPPORTING GLOBAL EMPLOYABILITY SKILLS FROM THE PERSPECTIVES OF STUDENTS, STAFF AND EMPLOYERS. Academic chapter/article/Conference paper Fjørtoft, Siw Olsen; Petersen, Sobah Abbas; Petersen, Per Storrø. (2023) Læringsbrett til alle elevene. Evaluering av bruk av læringsteknologier i Malvik-skolene. SINTEF Digital SINTEF Digital Report Petersen, Sobah Abbas; Evjen, Tor Åsmund; Krogstie, John. (2023) Adding value through enterprise building information models in health-care services. Journal of Facilities Management Academic article Petersen, Sobah Abbas; Banerjee, Pradipta. (2023) The Role of Digital Technologies in Engagement and Participation – Digital Divide or Inclusion?. Arctic Frontiers : Abstracts Abstract Turton, Jenny; Ezau, Igor; Pettersson, Lasse H.; Kuklina, Vera Vladimirovna; Salaj, Alenka Temeljotov; Petersen, Sobah Abbas. (2023) Urban Sustainability in Action - Multi-disciplinary Approach through Jointly Organised Research Schools (URSA MAJOR). EGU General Assembly Abstract 2022 Petersen, Sobah Abbas; Evjen, Tor Åsmund. (2022) Enterprise Architecture to Identify the Benefits of Enterprise Building Information Model Data: An Example from Healthcare Operations. Academic chapter/article/Conference paper Geirbo, Hanne Cecilie; Harboe, Lisbet; Hoelscher, Kristian; Petersen, Sobah Abbas. (2022) Interpretive Flexibility as an Approach to Designing Inclusive Urban Space: Learning from Medellín and Beirut. Nordic Journal of Urban Studies Academic article Bokolo, Anthony Junior; Petersen, Sobah Abbas. (2022) Using an Extended Technology Acceptance Model to Predict Enterprise Architecture Adoption in Making Cities Smarter. Environment Systems and Decisions Academic article Bokolo, Anthony Junior; Petersen, Sobah Abbas. (2022) Validation of a Developed Enterprise Architecture Framework for Digitalisation of Smart Cities: a Mixed‑Mode Approach. Journal of the Knowledge Economy Academic article Bokolo, Anthony Junior; Petersen, Sobah Abbas; Helfert, Markus. (2022) Improving Digitization of Urban Mobility Services with Enterprise Architecture. Academic chapter/article/Conference paper Alvsvåg, Rebekka; Bokolo, Anthony Junior; Petersen, Sobah Abbas. (2022) The Role of a Data Marketplace for Innovation and Value-Added Services in Smart and Sustainable Cities. Communications in Computer and Information Science (CCIS) Academic article Iqbal, Maria; Fredheim, Lars Jørgen; Olstad, Hege Annette; Abbas, Aisha; Petersen, Sobah Abbas. (2022) GRADUATE EMPLOYABILITY SKILLS DEVELOPMENT THROUGH REFLECTION AND SELF-ASSESSMENT USING A MOBILE APP. Academic chapter/article/Conference paper Hoelscher, Kristian; Geirbo, Hanne Cecilie; Harboe, Lisbet; Petersen, Sobah Abbas. (2022) What Can We Learn from Urban Crisis?. Sustainability Academic article Petersen, Sobah Abbas; Banerjee, Pradipta. (2022) Learning within and across cities: the role of Living Labs. Academic chapter/article/Conference paper 2021 Geirbo, Hanne Cecilie; Harboe, Lisbet; Hoelscher, Kristian; Petersen, Sobah Abbas. (2021) Kriseutsatte byer kan vise vei mot bærekraft. Bybloggen, OsloMet, https://blogg.hioa.no/byer/ Popular scientific article Kinsella, Stephen; Shams, Armin; Helfert, Markus; Ahlers, Dirk; Alloush, Iyas; Pourzolfaghar, Zohreh. (2021) D1.3: Report and catalogue on the ICT data integration and interoperability. +CityxChange +CityxChange Report Bokolo, Anthony Jun",
  "content_length": 88553,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:11"
}