{
  "name": "Sofya Raskhodnikova",
  "homepage": "https://cs-people.bu.edu/sofya",
  "status": "success",
  "content": "Sofya Raskhodnikova Professor of Computer Science, College of Arts and Sciences, Boston University My research interests include sublinear-time algorithms (in particular, property testing), private data analysis, approximation algorithms, randomized algorithms, and complexity theory. I am a member of the Algorithms and Theory group. Before joining BU, I was a professor in the CSE department at Penn State from 2007 to 2017. I got my PhD from MIT in 2003. From the fall of 2003 to 2006, I worked at the Hebrew University of Jerusalem, the Weizmann Institute of Science and the Institute for Pure and Applied Mathematics. In 2013--2014, I was on sabbatical leave at Boston University for a special Privacy Year and also participated in the Privacy Tools project at Harvard University in Spring 2014. I participated in Foundations of Data Science in Fall 2018 and Data Privacy: Foundations and Applications in Spring 2019 at Simons Institute for the Theory of Computing at Berkeley. If you are interested in joining our CS graduate program, please look at http://www.bu.edu/cs/phd-program/ for information on admissions and a description of the program. Research assistantships are available for strong candidates interested in working in algorithms and theory. Our department receives many applications, and I cannot review all of them personally. Check out this fun video video by Women In Theory. Courses Publications Professional activities Postdoc/Students Contact Info How to Pronounce My Name Courses CS 237 Probability in Computing, Spring 2022, 2023, Fall 2025 CS 537 Randomness in Computing, Spring 2018, 2020, 2026, Fall 2021, 2022, 2024 CS 599 Sublinear Algorithms, Spring 2025 CS 591 Sublinear Algorithms, Fall 2020 CS 332 Theory of Computation, Fall 2017, 2018, 2019 Courses Taught at Penn State CSE 597 Approximation Algorithms, Spring 2017 CSE 565 Algorithm Design and Analysis, Fall 2007, 2011, 2016 CMPSC 464 Introduction to the Theory of Computation, Fall 2008, 2009, 2010 and 2012, Spring 2016. CSE 597A Sublinear Algorithms, Fall 2015 CMPSC 360 Discrete Mathematics for Computer Science, Spring 2015. CSE 598B Theory Seminar (can be repeated for credit), Fall 2007 and 2009, Spring 2013, Fall 2014, Fall 2016. CSE 598A Sublinear Algorithms, Spring 2012 CSE 598A Algorithmic Aspects of Data Privacy, Spring 2010 CSE 598B Theory of Computation, Spring 2008 CSE 465 Data Structures and Algorithms, Spring 2007 A Course Taught at Weizmann Sublinear Algorithms Course, Weizmann Institute, Spring 2005. (The web page has been disactivated.) Professional activities Editor of journals: ACM Transactions on Computation Theory; Algorithmica. Program committee chair for CSR 2022 conference, a satellite event for the International Congress of Mathematicians (ICM2022) (June 2022, planed in Saint Petersburg, Russia, but moved online) WOLA 2021, June, 2021 RANDOM 2013 (August 21-23 2013, UC Berkeley, California) Program committee member for STOC 2026 (June 22-26, 2026 in Salt Lake City, Utah, USA) STOC 2025 (June 23-27, 2025, Prague, Czech Republic) TPDP 2025 (June 2-3, 2025, Google Mountain View, CA) TPDP 2024 (August 20-21, 2024, Boston, Massachusetts) FORC 2024 (June 12-14, 2024, Boston, Massachusetts) FOCS 2023 (November 6-9, 2023, Santa Cruz, California) ITCS 2022 (January 31-February 3, 2022, Berkeley, California) CSR 2021 (June 28–July 2, 2021, Sochi, Russia or online) STOC 2020 (June 22-26, 2020, Chicago, IL or online) RANDOM 2019 (September 20-22, 2019, MIT) ITCS 2019 (January 10-12, 2019, San Diego, California) FOCS 2017 (October 15-17, 2017, Berkeley, California) STOC 2016 (June 19-21, 2016, Cambridge, MA) FOCS 2012 (October 20-23, 2012, New Brunswick, New Jersey) SWAT 2012 (July 4-6, 2012, Helsinki, Finland) FOCS 2010 (October 23-26, 2010, Las Vegas, Nevada) RANDOM 2010 (September 1-3, 2010, Barcelona) SODA 2010 (January 17-19, 2010, Austin,Texas) RANDOM 2007 (August 20-22, 2007, Princeton University) Co-organizer of 4th TCS Women meeting at STOC 2021, June 22, 2021. 3rd TCS Women meeting at STOC 2020, June 25, 2020. 2nd TCS Women meeting at STOC 2019, June 26, 2019. Inaugural TCS Women meeting at STOC 2018 Theory Fest, June 26, 2018. Sublinear 2016 workshop at Johns Hopkins University, January 7-9, 2016. Mike Fest, a Symposium on Theoretical Computer Science on the occasion of Michael Sipser's 60th Birthday, October 26, 2014. Sublinear Algorithms 2014 at Bertinoro, May 25-29, 2014. Charles River Workshop on Private Analysis of Social Networks, May 19, 2014. Charles River Privacy Day, November 15, 2013. Faculty at math and CS summer camps and school-year programs for kids Sigma camp: lecture in 2020, faculty in 2021, 2022, 2023, 2024, 2025; helping with Problem of the Month (POM) contest in 2021-2025. Guest lecturer and panelist at Artemis (CS summer camp at BU) in 2023, 2024. Instructor for Berkeley Math Circle, spring 2019. First EECS PSU summer camp: Girls Solving Societal Problems Through Computer Science, 2017. Video C.A.M.P., 2017. Epsilon camp, 2016. Area editor for Encyclopedia of Algorithms, 2nd Edition Guest editor for SICOMP for the Special Issue on FOCS 2017; Theory of Computing (an open access journal) for the Special Issue on APPROX-RANDOM 2013. Lecturer for 2011 Program for Women and Mathematics (Institute for Advanced Study), a course on sublinear algorithms Slides: Lecture 1, Lecture 2, Lecture 3, Lecture 4 Postdocs Esty Kelman (from January 2023) Talya Eden (2021--2022) Current Ph.D. Students Ephraim Linder (co-advised with Adam Smith) Debanuj Nayak Diptaksho Palit Anatoly Zavyalov Alumni Iden Kalemaj (Ph.D. `24, Boston University, now at Meta Research) Ludmila Glinskih (Ph.D. `24, Boston University, co-advised with Mark Bun, now at Google) Ramesh Krishnan S. Pallavoor (Ph.D. `20, Boston University, now at Google) Nithin Varma (Ph.D. `19, Boston University, first position after graduation: postdoc at the University of Haifa, then an Assistant Professor at the Chennai Mathematical Institute, now at Max Planck Institute for Informatics) Meiram Murzabulatov (Ph.D. `17, Penn State, was an Assistant Teaching Professor at Penn State, now an Assistant Professor at Nazarbayev University) Kashyap Dixit (Ph.D. '15, Penn State, co-advised with Martin Fürer) Grigory Yaroslavtsev (Ph.D. '14, Penn State, first position after graduation: postdoc at Brown University, then an Assistant Professor at Indiana University, now faculty at George Mason) Madhav Jha (M.S. '10, Ph.D. '13, Penn State, first position after graduation: postdoc at Sandia National Labs, now at Sigma computing) Roksana Baleshzar (M.S. `17, Penn State, now at Google) Edward Lu (B.S. Honor's Thesis `13, Penn State) Ishan Behoora, research intern, Spring '10, Penn State Olena Melnychenko, research assistant, B.S. '09, Penn State Publications (presented in reverse chronological order of their initial publication) Fast Agnostic Learners in the Plane, Talya Eden, Ludmila Glinskih, Sofya Raskhodnikova Arxiv version Computational Complexity in Property Testing, Renato Ferreira Pinto Jr., Diptaksho Palit, Sofy Raskhodnikova. SODA 2026. Arxiv version Privately Evaluating Untrusted Black-Box Functions, Ephraim Linder, Sofya Raskhodnikova, Adam Smith, Thomas Steinke. STOC 2025: 2350-2361. Arxiv version A video of a plenary talk on this work at the Simons Institute for the Theory of Computing Fully Dynamic Graph Algorithms with Edge Differential Privacy, Sofya Raskhodnikova, Teresa Anna Steiner. PODS 2025. Proc. ACM Manag. Data 3(2): 99:1-99:28, 2025. Arxiv version Local Lipschitz Filters for Bounded-Range Functions, Jane Lange, Ephraim Linder, Sofya Raskhodnikova, Arsen Vasilyan. Proceedings of the 36th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), pp. 2881-2907, 2025. Arxiv version Online versus Offline Adversaries in Property Testing, Esty Kelman, Ephraim Linder, Sofya Raskhodnikova. Proceedings of the 16th Innovations in Theoretical Computer Science Conference (ITCS), Volume 325, pp. 65:1-65:18, 2025. Arxiv version A video of a survey talk on property testing with incomplete or manipulated inputs at the Simons Institute for the Theory of Computing Property testing with online adversaries, Omri Ben-Eliezer, Esty Kelman, Uri Meir, Sofya Raskhodnikova. Proceedings of the 15th Innovations in Theoretical Computer Science Conference (ITCS), 2024. Arxiv version Counting Distinct Elements in the Turnstile Model with Differential Privacy under Continual Observation, Palak Jain, Iden Kalemaj, Sofya Raskhodnikova, Satchit Sivakumar, and Adam Smith. Proceedings of 37th Conference on Neural Information Processing Systems, NeurIPS 23, 2023. Arxiv version Poster Testing Connectedness of Images, Piotr Berman, Meiram Murzabulatov, Sofya Raskhodnikova, and Dragos-Florian Ristache. Algorithmica 2024. Preliminary version appeared in Proceedings of the 26th RANDOM, 66:1--66:15, 2023. Arxiv version Triangle Counting with Local Edge Differential Privacy, Talya Eden, Quanquan C. Liu, Sofya Raskhodnikova, and Adam Smith. Random Struct. Algorithms 66(4) (2025) Preliminary version appeared in the Proceedings of 50th International Colloquium on Automata, Languages, and Programming (ICALP),52:1--52:21, 2023. Arxiv version Slides The Price of Differential Privacy under Continual Observation, Palak Jain, Sofya Raskhodnikova, Satchit Sivakumar, and Adam Smith. ICML 2023. Arxiv version Selected for presentation at ICML and FORC 2023. Selected talk at TPDP 2022. Slides Isoperimetric Inequalities for Real-Valued Functions with Applications to Monotonicity Testing, Hadley Black, Iden Kalemaj, and Sofya Raskhodnikova. Random Structures and Algorithms, volume 65, 191-219, 2024. Preliminary version appeared in Proceedings of 50th International Colloquium on Automata, Languages, and Programming (ICALP), 25:1--25:20, 2023. Arxiv version Slides Node-Differentially Private Estimation of the Number of Connected Components, Iden Kalemaj, Sofya Raskhodnikova, Adam Smith, Charalampos Tsourakakis. ACM Transactions",
  "content_length": 23260,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:11"
}