{
  "name": "Soham Sundar Chakraborty",
  "homepage": "https://www.st.ewi.tudelft.nl/sschakraborty",
  "status": "success",
  "content": "Soham Chakraborty Soham Chakraborty Assistant Professor EEMCS, TU Delft Email: s.s.chakraborty AT tudelft.nl About me I am broadly interested in programming languages, compilers, and verification with a focus on parallel and concurrent systems and architectures. I am an assistant professor at the Programming Languages Group, TU Delft since 2021 and currently also a Visiting Assistant Professor at CSE, IIT Bombay (2025-2026), with former position as an assistant professor at the CSE Department, IIT Delhi. Prior to joining IIT Delhi, I obtained my PhD from the Max Planck Institute for Software Systems (MPI-SWS) in 2019. Before my PhD, during 2008-2013, I worked in industrial research and development positions with AMD Inc, TCS Research, and IBM Research. In 2008, I obtained masters from CSE Department, IIT Kharagpur. Research I am currently exploring parallelism and concurrency at the intersection of programming languages and architectures: Formal semantics and compiler correctness [PLDI'20, POPL'19, CGO'17, CGO'16, POPL'15] Architecture-to-architecture translation [ASPLOS'23b, PLDI'22, FMCAD'21] Heterogeneous concurrency [PACT'24, PLDI'23a] Analysis and verification [POPL'24, PLDI'23a, ASPLOS'23b, PODC'22, CC'16, LMCS'15] Group I am privileged to work with some of the most talented and smart people. PhD. Dennis Sprokholt MSc. Michal Raczkiewicz, Alexandru Dumitriu, Huixuan Wu Alumni (MSc) Pieter van den Ham, Mingyu Gao, Jeroen Kloppenburg, Zhiyang Liu, Daan de Graaf, Casper Henkes, Matteo Meluzzi, Niels Mook, Siyuan Yu Intern. Sivaram D, GIACOMIN Micol Teaching CS2120 (Bachelor). 2024-25 Q3 Concepts of Programming Languages CS4555 (Master). 2024-25 Q3 Parallel and Concurrent Programming CS4555 (Master). 2024-25 Q2 Compiler Construction CS4405 (Master). 2022-2024 (Q3) Analysis of Concurrent and Distributed Programs CESE4000 (Master). 2022, 2023 (Q1) Software Fundamentals(Programming in Rust) CESE4200-A (Master) 2022-2024 (Q1,Q2) Compiler Construction CS4130 (Master). 2022-2024 Q1 Seminar Programming Languages COL 380 (Bachelor). 2021 II Introduction to Parallel and Distributed Programming COL 862 (Master). 2021 I Special topics in Software Systems (Applied Program Analysis) COL 869 (Master). 2020 II Special topics in Concurrency (Relaxed Memory Concurrency) Recent Publications (All Publications) CAV'25 GPUMC: A Stateless Model Checker for GPU Weak Memory Concurrency. [Technical Appendix] [Artifact] Soham Chakraborty, Krishna S, Andreas Pavlogiannis, Omkar Tuppe. POPL'25 Relaxed Memory Concurrency Re-executed. [Technical Appendix] [Artifact] Evgenii Moiseenko, Matteo Meluzzi, Innokentii Meleshchenko, Ivan Kabashnyi, Anton Podkopaev, Soham Chakraborty. Distinguished Paper Award DATE'25 Modeling and Analysis Technique for the Formal Verification of System-on-Chip Address Maps (Extended Abstract) Niels Mook, Erwin de Kock, Bas Arts, Soham Chakraborty, Arie van Deursen. CGO'25 Cage: Hardware-Accelerated Safe WebAssembly Martin Fink, Dimitrios Stavrakakis, Dennis Sprokholt, Soham Chakraborty, Jan-Erik Ekberg, Pramod Bhatotia. PACT'24 Toast: A Heterogeneous Memory Management System Maurice Bailleu, Dimitrios Stavrakakis, Rodrigo Rocha, Soham Chakraborty, Deepak Garg, Pramod Bhatotia. POPL'24 How Hard is Weak-Memory Testing? Soham Chakraborty, Shankaranarayanan Krishna, Umang Mathur, Andreas Pavlogiannis. PLDI'23a Compound Memory Models. [Artifact] Andres Goens, Soham Chakraborty, Susmit Sarkar, Sukarn Agarwal, Nicolai Oswald, Vijay Nagarajan. PLDI'23b Optimal Reads-From Consistency Checking for C11-Style Memory Model]. [Artifact] Hunkar Can Tunc, Parosh A. Abdulla, Soham Chakraborty, Shankaranarayanan Krishna, Umang Mathur, Andreas Pavlogiannis. ASPLOS'23a Probabilistic Concurrency Testing for Weak Memory Concurrency. [Artifact] Mingyu Gao, Soham Chakraborty, Burcu Kulahcioglu Ozkan. ASPLOS'23b Risotto: A Dynamic Binary Translator for Weak Memory Model Architectures. [Project page] Redha Gouicem*, Dennis Sprokholt*, Jasper Ruehl, Rodrigo Rocha, Tom Spink, Soham Chakraborty, Pramod Bhatotia. Distinguished Artifact Award PODC'22 Parameterized Verification under Release Acquire is PSPACE-complete. Shankaranarayanan Krishna, Adwait Godbole, Roland Meyer, Soham Chakraborty. PLDI'22 Lasagne: A Static Binary Translator for Weak Memory Model Architectures. [Project page] Rodrigo Rocha*, Dennis Sprokholt*, Martin Fink, Redha Gouicem, Tom Spink, Soham Chakraborty, Pramod Bhatotia. FMCAD'21 Robustness between Weak Memory Models. [Artifact] Soham Chakraborty. [Project page] Arxiv On Architecture to Architecture Mapping for Concurrency. Soham Chakraborty. Patents Automated test cycle estimation system and method. US9032370B2. Scalable partial vectorization. US9158511B2. Automated test execution plan derivation system and method. US9378120B2. Service FORTE 2026 (PC), PLDI 2026 (PC), CGO 2026 (PC), CompSys 2025 (PC), CAV 2025 (PC), Eurosys 2025 (Workshop chair), VMCAI 2025 (PC), VSTTE 2024 (PC), POPL 2024 (PC), APLAS 2023 (PC), APLAS 2020 (PC), OOPSLA 2020 (ERC), PLDI 2018 (AEC), CGO 2018 (AEC) Talks 2024. A Tale of Shared Memory Concurrency in Programming Languages. PLMW@PLDI 2024. 2024. Heterogeneous concurrency -- a new frontier for weak memory. FOWM 2024 Workshop. 2024. A Formal Foundation for Heterogeneous Concurrency. ASML 2024. Fundamentals and Advancements in Relaxed Memory Concurrency. TU Eindhoven. 2023. Fundamentals and Advancements in Relaxed Memory Concurrency. Utrecht University. 2023. Binary Translation for Weak Memory Model Architectures. Uppsala University. 2022. Binary Translation for Weak Memory Model Architectures. Aarhus University. Validating Optimizations of Concurrent C/C++ Programs SAT-SMT School 2019. Grounding Thin-Air Reads with Event Structures POPL 2019. Validating optimizations of concurrent C/C++ programs. Dagstuhl seminar Program Equivalence, 2018. Formalizing the concurrency semantics of an LLVM fragment. Concurrency Workshop 2017. Formalizing the concurrency semantics of an LLVM fragment. EuroLLVM 2017. Formalizing the concurrency semantics of an LLVM fragment. CGO 2017. Validating optimizations of concurrent C/C++ programs. CGO 2016.",
  "content_length": 6161,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:13"
}