{
  "name": "Sohini Ramachandran",
  "homepage": "https://www.brown.edu/Research/Ramachandran_Lab",
  "status": "success",
  "content": "Sohini Ramachandran Lab: homepage Determining the causes and consequences of human genetic variation, using population genetics, statistics, and evolutionary theory Sam (left) and Wei (middle) receiving their PhDs at Brown University's 2022 Commencement Exercises; Sahar (right) attended to support them. The Ramachandran Lab crew at the 2022 fall retreat in Newport. L to R: Cecile (rotating student), Brina, Cole, Elsie, and Carlos. Celebrating Sahar's thesis defense on April 1, 2021! The height distribution of the Ramachandran Lab, September 2018 (celebrating Priya; missing postdoc Kate Brunson). Sohini gives an invited talk at SMBE 2023 on learning genetic trait architecture, in the beautiful City Theatre in Ferrara, Italy. A meta-selfie outside our current home, Watson CIT at Brown Dinner during the 2018 lab retreat in St. George Maine. Recent News Sohini s recognized with a Blavatnik Award for Young Scientists! September 2024 Sam's last dissertation paper is out in eLife! June 2024 Post-bacc researcher Abby receives an NSF graduate fellowship! April 2024 Sahar's last dissertation paper is out in Histopathology! March 2024 Sohini is co-author on a review out in Cell! February 2024 Elsie's paper is out in PLoS Genetics! August 2023 Research in the Ramachandran lab addresses problems in population genetics and evolutionary theory, generally using humans as a study system. Our work uses mathematical modeling, applied statistical methods, and computer simulations to make inferences from genetic data. We ask a range of questions, such as: what features of human demographic history can we infer from genetic data alone? how can we detect genomic targets of selection? how is human genetic variation apportioned across chromosomes, and what does this teach us about past evolutionary processes shaping genetic variation? how does population genetics research highlight our shared humanity? Our research and a subset of lab members are currently funded by multiple grants from the National Institutes of Health.",
  "content_length": 2031,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:17"
}