{
  "name": "Sokrates T. Pantelides",
  "homepage": "https://my.vanderbilt.edu/sokratespantelides",
  "status": "success",
  "content": "Welcome to the Pantelides Research Group! | Professor Sokrates Pantelides Skip to content Welcome to the Pantelides Research Group! Professor Sokrates Pantelides HomeResearch Group Members Curriculum Vitae Recent Invited Talks Recent Publications Photos Videos Contact Info ← Older posts Congratulations to Matthew Lu – Goldwater Scholar! Posted on April 2, 2024 by Sokrates Pantelides Congratulations to Matthew! He won the 2024 Barry Goldwater scholarship award. Posted in News | Comments Off on Congratulations to Matthew Lu – Goldwater Scholar! Article published in 150th anniversary of Vanderbilt University Collection Posted on April 2, 2024 by Sokrates Pantelides To commemorate Vanderbilt University’s sesquicentennial and celebrate 150 years of high-quality research from the institution, this collection covers the most recent research progress across the breadth of nanoscience and nanotechnology from current faculty, esteemed alumni, and researchers with strong connections and extensive collaborations with the university. https://pubs.rsc.org/en/journals/articlecollectionlanding?sercode=nr&themeid=38b3b725 Posted in News | Comments Off on Article published in 150th anniversary of Vanderbilt University Collection International collaboration yields breakthrough that could revolutionize computing technologies Posted on March 28, 2023 by Sokrates Pantelides Posted in News | Comments Off on International collaboration yields breakthrough that could revolutionize computing technologies US–China partnerships bring strength in numbers to big science projects Posted on March 9, 2022 by Sokrates Pantelides https://www.nature.com/articles/d41586-022-00570-0 Posted in News | Comments Off on US–China partnerships bring strength in numbers to big science projects Breakthrough measurements/theory of vibrating atoms in nanostructures ushers in new class of technology Posted on January 22, 2022 by Sokrates Pantelides Posted in News | Comments Off on Breakthrough measurements/theory of vibrating atoms in nanostructures ushers in new class of technology BARRY GOLDWATER AWARD FOR OUR REU STUDENT Posted on December 20, 2021 by Sokrates Pantelides Nick Richardson, an undergraduate physics student at Fairfield University, Fairfield, CT, who spent the summer of 2020 as a research intern in our group under the National Science Foundation Research Education for Undergraduates (REU) program, received a prestigious Barry Goldwater Scholarship and Excellence in Education Award for undergraduates in the sophomore and junior level for his academic record at Fairfield and for his research experience at Vanderbilt where he was co-mentored by Dr. Andrew O’Hara and Professor Pantelides. Nick did a brilliant job in his nanoscience research project, which continued in the fall and spring semester and led to a talk at the prestigious American Physical Society annual meeting in March 2021. A paper on the project is currently being written. Posted in News | Comments Off on BARRY GOLDWATER AWARD FOR OUR REU STUDENT Preferential hole defect formation in monolayer WSe2 by electron-beam irradiation Posted on April 14, 2021 by Sokrates Pantelides https://journals.aps.org/prmaterials/abstract/10.1103/PhysRevMaterials.5.044002 Posted in News | Comments Off on Preferential hole defect formation in monolayer WSe2 by electron-beam irradiation New microscopy technique of electron distributions and theory unveils a feature that can shape applications of a class of quantum materials Posted on April 7, 2021 by Sokrates Pantelides Posted in News | Comments Off on New microscopy technique of electron distributions and theory unveils a feature that can shape applications of a class of quantum materials Congratulations to Graduate Student, Laura Nichols, on receiving the DOE CSGF Fellowship! Posted on June 11, 2020 by Sokrates Pantelides https://as.vanderbilt.edu/news/2020/06/11/physics-students-win-energy-department-research-fellowships/ Posted in News | Comments Off on Congratulations to Graduate Student, Laura Nichols, on receiving the DOE CSGF Fellowship! Professor Sokrates T. Pantelides Given the 2019 Award for International Scientific Cooperation of the Chinese Academy of Sciences on January 16, 2020 in Beijing, China Posted on January 16, 2020 by Sokrates Pantelides Professor Pantelides pictured here with Bai Chunli, President of the Chinese Academy of Sciences. Professor Pantelides is pictures here with his collaborators after the award ceremony at the Chinese Academy of Sciences (CA) on January 16, 2020. Posted in Recent Honors | Comments Off on Professor Sokrates T. Pantelides Given the 2019 Award for International Scientific Cooperation of the Chinese Academy of Sciences on January 16, 2020 in Beijing, China ← Older posts Search for: Archives April 2024 March 2023 March 2022 January 2022 December 2021 April 2021 June 2020 January 2020 September 2019 June 2016 Meta Log in Welcome to the Pantelides Research Group! Proudly powered by WordPress.",
  "content_length": 4987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:14"
}