{
  "name": "Somayeh Sojoudi",
  "homepage": "https://people.eecs.berkeley.edu/~sojoudi",
  "status": "success",
  "content": "Home Publications Group Teaching Biography Awards and Honors Professional Activities Google Scholar Somayeh Sojoudi Associate Professor Electrical Engineering & Computer Sciences Mechanical Engineering University of California, Berkeley Email: sojoudi (at) berkeley.edu Office: 5114 Etcheverry Hall Brief Biography I am an Associate Professor in the Electrical Engineering & Computer Sciences and Mechanical Engineering departments at UC Berkeley. I work on interdisciplinary problems in optimization theory, machine learning, power systems, and control. PhD Applicants: If you are interested in joining my research group, please apply through the EECS or ME PhD programs and mention your interest in working with me in your application. News November 2025: I have been elevated to IEEE Fellow, effective January 1, 2026. October 2025: Our paper “DRAGON: Distributional Rewards Optimize Diffusion Generative Models” to appear in Transactions on Machine Learning Research. September 2025: Three papers accepted at NeurIPS 2025: 1) Generalization or Hallucination? Understanding Out-of-Context Reasoning in Transformers, 2) OVERT: A Benchmark for Over-Refusal Evaluation on Text-to-Image Models, and 3) Revising and Falsifying Sparse Autoencoder Feature Explanations. August 2025: Four new PhD students have joined my research group: Alex Zalles, Kaiwen Hu, Srikar Babu Gadipudi, and Xutao Ma. July 2025: The paper “Evolutionary games on infinite strategy sets: Convergence to Nash equilibria via dissipativity” to appear in The IEEE Transactions on Automatic Control. July 2025: The paper “Coordinating Distributed Energy Resources with Nodal Pricing in Distribution Networks: a Game-Theoretic Approach” to appear in the 2025 IEEE Conference on Decision and Control. July 2025: The paper “Intent Demonstration in General-Sum Dynamic Games via Iterative Linear-Quadratic Approximations” has been conditionally accepted for publication in IEEE Transactions on Control Systems Technology (TCST). June 2025: The paper “OVERT: A Benchmark for Over-Refusal Evaluation on Text-to-Image Model” has been accepted for presentation at the MUGen Workshop, ICML 2025. May 2025: The paper “Towards optimal branching of linear and semidefinite relaxations for neural network robustness certification” to appear in the Journal of Machine Learning Research (JMLR). April 2025: New paper: DRAGON: Distributional Rewards Optimize Diffusion Generative Models. Visit the project website with generated music examples. April 2025: Three PhD students from my group (Yatong Bai, Samuel Pfrommer, and Jingqi Li) have completed their dissertation talks. April 2025: My PhD student, Jingqi Li (co-advised with Prof. Tomlin), received the 2024-2025 Leon O. Chua Award for outstanding achievement in nonlinear science from UC Berkeley. April 2025: My PhD student, Yatong Bai, received the 2024-2025 Outstanding Graduate Student Instructor Award from UC Berkeley. March 2025: New paper: Coordinating Distributed Energy Resources with Nodal Pricing in Distribution Networks: a Game-Theoretic Approach. February 2025: The paper “Distribution System Expansion Planning with Nonlinear Power Flow Models” to appear in IEEE PES General Meeting. January 2025: I have been appointed as the chair of the Women in Systems Engineering (WiSE) Committee of the IEEE Systems Council. January 2025: I have been appointed as an Associate Editor for Book Reviews of the IEEE Control Systems Magazine. January 2025: Our paper “Certifiable Reachability Learning Using a New Lipschitz Continuous Value Function” has been accepted for publication in the IEEE Robotics and Automation Letters. December 2024: Our paper “Distributionally Robust Joint Chance-Constrained Optimal Power Flow Using Relative Entropy” has been accepted for publication in the IEEE Transactions on Power Systems. September 2024: Our paper “Ranking Manipulation for Conversational Search Engines” has been accepted for presentation at the EMNLP 2024 (main conference). September 2024: Yixio Huang and George Ma have joined our research group as PhD students. September 2024: Our paper “The computation of approximate feedback Stackelberg equilibria in multi-player nonlinear constrained dynamic games” has been accepted for publication in the SIAM Journal on Optimization (SIOPT). August 2024: Our paper âMixedNUTS: Training-Free Accuracy-Robustness Balance via Nonlinearly Mixed Classifiersâ has been accepted for publication in the Transactions on Machine Learning Research. July 2024: Our paper Approximately Gaussian Replicator Flows: Nonconvex Optimization as a Nash-Convergent Evolutionary Game has been accepted at the 63rd IEEE Conference on Decision and Control. July 2024: I will serve as a Senior Program Committee member for AAAI 2025. June 2024: I will be delivering the keynote at the 2024 IEEE International Symposium on Systems Engineering (ISSE). June 2024: New paper: Ranking Manipulation for Conversational Search Engines. June 2024: Our paper ConsistencyTTA: Accelerating Diffusion-Based Text-to-Audio Generation with Consistency Distillation has been accepted to the 2024 INTERSPEECH conference (Live demo). May 2024: We have two papers accepted for presentation at ICML 2024: 1) Transport of Algebraic Structure to Latent Embeddings (Spotlight, top 12.5%); 2) Pausing Policy Learning in Non-stationary Reinforcement Learning (Oral Presentation, top 5.5%). May 2024: Three members of our research group have completed their PhD exit seminars: 1) Ziye Ma will join the CS department at City University of Hong Kong as a tenure-track Assistant Professor; 2) Brendon Anderson will join the ME Department at California Polytechnic State University, as a tenure-track Assistant Professor; 3) Tanmay Gautam will join Microsoft Research as a research scientist. April 2024: We have two papers accepted for presentation at the 2024 Learning for Dynamics and Control Conference (L4DC): 1) Mixing Classifiers to Alleviate the Accuracy-Robustness Trade-Off; 2)Soft Convex Quantization: Revisiting Vector Quantization with Convex Optimization. March 2024: Our paper “Improving the Accuracy-Robustness Trade-Off of Classifiers via Adaptive Smoothing” has been accepted for publication in SIAM Journal on Mathematics of Data Science (SIMODS). February 2024: New paper: Transport of Algebraic Structure to Latent Embeddings. February 2024: New paper: MixedNUTS: Training-Free Accuracy-Robustness Balance via Nonlinearly Mixed Classifiers. February 2024: New paper: Pausing Model Learning in Real-world Reinforcement Learning. January 2024: New paper: The computation of approximate feedback Stackelberg equilibria in multi-player nonlinear constrained dynamic games. January 2024: New paper: Distributionally Robust Joint Chance-Constrained Optimal Power Flow using Relative Entropy. January 2024: Our paper “Absence of spurious solutions far from ground truth: A low-rank analysis with high-order losses” has been accepted for oral presentation at the 26th International Conference on Artificial Intelligence and Statistics, AISTATS 2024. December 2023: My Ph.D. student, Brendon Anderson, won first place in INFORMS OR/MS Tomorrow Poster Competition for the paper Asymmetric Certified Robustness via Feature-Convex Neural Networks. December 2023: I will serve as an Area Chair for ICML 2024. November 2023: The blog post by my PhD student, Samuel Pfrommer, has been published on the BAIR blog: Asymmetric Certified Robustness via Feature-Convex Neural Networks. October 2023: Awarded a grant by the UC Noyce Initiative to enhance power grid security against cyberattacks. October 2023: I gave an online distinguished lecture (for the IEEE Systems Council) on computational methods for solving non-convex machine learning problems. September 2023: Three papers to appear in NeurIPS 2023: 1) Asymmetric Certified Robustness via Feature-Convex Neural Networks; 2) Algorithmic Regularization in Tensor Optimization: Towards a Lifted Approach in Matrix Sensing; 3) Tempo Adaptation in Non-stationary Reinforcement Learning. September 2023: The paper “Projected Randomized Smoothing for Certified Adversarial Robustness” to appear in Transactions on Machine Learning Research. August 2023: I will serve as an Area Chair for ICLR 2024. August 2023: The paper “A New Complexity Metric for Nonconvex Rank-one Generalized Matrix Completion” to appear in Mathematical Programming. July 2023: 6 papers have been accepted at the 62nd IEEE Conference on Decision and Control: 1) Tight Certified Robustness via Min-Max Representations of ReLU Neural Networks; 2) Initial State Interventions for Deconfounded Imitation Learning; 3) Meta-Learning Parameterized First-Order Optimizers using Differentiable Convex Optimization; 4) Leveraging the Physics of AC Power Flow in Support Vector Regression to Identify Power System Topology; 5) Distributionally Robust Optimization for Nonconvex QCQPs with Stochastic Constraints; 6) Scenario-Game ADMM: A Parallelized Scenario-Based Solver for Stochastic Noncooperative Games. May 2023: Our paper “Mixing Classifiers to Alleviate the Accuracy-Robustness Trade-Off” ranked second on Robust-Bench. April 2023: Elizabeth Glista has defended her Ph.D. thesis titled “Optimizing for the future smart grid: Efficient methods for nonconvex AC power flow problems” (dissertation slides). April 2023: Our paper âOver-parametrization via Lifting for Low-rank Matrix Sensing: Conversion of Spurious Solutions to Strict Saddle Pointsâ has been selected for a live presentation at the 2023 International Conference on Machine Learning (ICML). March 2023: I will serve as a Senior Associate Editor for the IEEE Systems Journal. March 2023: We are organizing the 5th annual NorCal Control Workshop at UC Berkeley. March 2023: Two of my PhD students (Brendon Anderson and Ziye Ma) received the 2023 Outstanding Graduate Student Instructor Award. March 2023: The 2nd Workshop on Formal Verification of Machine Learning has been accepted for ICML 2023. Mar",
  "content_length": 35498,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:21"
}