{
  "name": "Somak Aditya",
  "homepage": "https://adityasomak.github.io",
  "status": "success",
  "content": "Somak Aditya Search Somak Aditya Assistant Professor Department of CSE, IIT KGP Biography Latest News I am looking for motivated full-time Ph.D students who are interested in pursuing their thesis in the exciting juncture of classical and statistical AI (often dubbed as neuro-symbolic methods). I am an Assistant Professor (Grade I) at IIT Kharagpur Department of CSE. I was a Postdoctoral Researcher at Microsoft Research India advised by Dr. Monojit Choudhury. Prior to joining MSR India, I spent 1.5 years in Adobe Research as a full-time Researcher. I completed by Ph.D from CIDSE, Arizona State University in June 2018, under the supervision of Prof. Chitta Baral and Prof. Yezhou Yang. Deployable AI systems should be able to reason with knowledge that is commonplace to humans. Thus, my research aims to enhance, evaluate, and explain different types of complex reasoning abilities of AI systems. At MSRI, I explored evaluation and enhancement of reasoning capabilities of Transformers-based language models. Apart from end-to-end reasoning, I am paralley exploring multi-hop reasoning capabilities of neural methods in both symbolic and natural language domains. During my Ph.D, I have explored enhancement of reasoning capabilities of image understanding systems. Through a combination of Deep Learning, Knowledge Representation, and Probabilistic Logical Reasoning, I demonstrated the benefits of using reasoning and knowledge in Visual Question-Answering, Captioning, image puzzle solving and visual reasoning. Featured Publications AD$^2$: Analysis and Detection of Adversarial Threats in Visual Perception for End-to-End Autonomous Driving Systems Ishan Sahu, Somnath Hazra, Somak Aditya, Soumyajit Dey In WACV 2026 (Main). PDF vision News Nov 2025 WACV: 1 paper accepted on \"AD^2: Analysis and Detection of Adversarial Threats in Visual Perception for End-to-End Autonomous Driving Systems\" with Ishan Sahu, Somnath Hazra and Prof. Soumyajit Dey. Ishan is a joint working professional PhD student. Nov 2025 AAAI: 2 papers accepted. 1 main track and 1 alignment track. Posting details soon. Nov 2025 AAAI: My PhD student Sachin got accepted in AAAI DC. Nov 2025 Microsoft AARI: Proposal \"Agentic Verifiers: Provably Safe Test-time scaling for Reasoning Models\" accepted under Microsoft Agentic Research Initiative(AARI) with Amit Sharma Sourangshu Bhattacharya Uma Satya Ranjan (IIT Jammu) Vineeth N Balasubramanian Nagarajan Natarajan Sep 2025 Microsoft AFMR: USD 8000 Azure Credits funded towards \"Education Video Copilot: AI Teaching Assistant for Remote & MOOC Courses\" with Tanuja Ganu, Microsoft SCAI. August 2025 EMNLP 2025: NLKI: An initative towards lightweight VLMs capable of commonsense reasoning website is launched August 2025 EMNLP 2025: 1 Main (EduVidQA: Generating and Evaluating Long-form Answers to Student Questions based on Lecture Videos) and 1 findings (NLKI: A lightweight Natural Language Knowledge Integration Framework for improving small VLMs in Commonsense VQA tasks) accepted. Congratulations to all co-authors. Preprints will be out soon. July 2025 IIIT Summer School 2025: My slides presentend at IIIT-H CVIT Summer School of AI is now public Transformers and Large Language Models - A Primer and Reasoning and Large Language Models - Part II. Please do not use the slides without proper acknowledgement. June 2025 IIIT Summer School 2025: Invited as a speaker for a session at IIIT CVIT Summer School 2025 (List of Speakers, CVIT Summer School) May 2025 MSRI 2025: Invited as a speaker/participant at Microsoft Research India Academic Summit 2025. May 2025 ACL 2025: Paper on \"Evaluating LLMs' Mathematical and Coding Competency through Ontology-guided Interventions\" accepted in ACL Findings. Co-authors: Pengfei Hong, Deepanway Ghoshal, Navonil Majumdar, Rada Mihalcea, Soujanya Poria April 2025 CACM 2025: Invited to be part of CACM Reviewer Board Pilot project (to be announced on June 1st). Mar 2025 CODS 2025: Invited as a Demo Track co-chair. Feb 2025 IISc: Invited talk on \"Integrating Knowledge and Reasoning in Vision & NLP through Neurosymbolic Methods\". Jan 2025 NAACL 2025: One long paper in main track \"SMAB: MAB based word Sensitivity Estimation Framework and its Applications in Adversarial Text Generation\" with Saurabh Kumar Pandey, Sachin Vashishtha, and Monojit Choudhury (equal contribution from Saurabh and Sachin). Dec 2024 Invited talk at National Research Council, Canada. Host: Dr. Sowmya Vajjala. Topic: Evolution of Neurosymbolic NLP: From Integrating \"Knowledge\" to \"Skills\". Sep 2024 CONLL 2024: One Long Paper accepted in Main Track about Text2Afford: Probing Object Affordance Prediction abilities of Language Models solely from Text (with Sayantan Adak, Daivik Agarwal, Animesh Mukherjee). Sep 2024 EMNLP 2024: Two Long Papers accepted in Main Track about i) Code Prompting Elicits Conditional Reasoning Abilities in Text+Code LLMs (with Haritz Puerto, Martin Tutek, Xiaodan Zhu, & Iryna Gurevych), ii) ERVQA: A Dataset to Benchmark the Readiness of Large Vision Language Models in Hospital Environments (Sourjyadip Ray, Kushal Gupta, Soumi Kundu, Dr Payal Arvind Kasat, Somak Aditya, Pawan Goyal) June 2024 Invited for a talk at Saarland University on \"The lack of reasoning ability in LLMs, the promise of Neurosymbolic NLP, and the pitfalls of \"both\" (Host: Dr. Michael Hahn). June 2024 Invited for a talk at the Probability for AI-ML-NLP series, IIT Bombay (Host: Dr. Pushpak Bhattacharya). May 2024 Invited for a talk at UKP Day (Host: Dr. Iryna Gurevych). May 2024 TU Darmstadt: Visiting UKP Lab, TU Darmstadt for the summer (Host: Dr. Iryna Gurevych). Mar 2024 NAACL 2024: Long Paper accepted in Main Track about Tool-Augmented LLMs and Mathematical Reasoning MATHSENSEI: A Tool-Augmented Large Language Model for Mathematical Reasoning with Debrup Das, Debopriyo Banerjee, and Ashish Kulkarni. A shorter draft previously also published in ICLR 2024 ME-FOMO Workshop. Feb 2024 Tr$^2$AIL Lab: Tr$^2$AILer Atharva Naik received PhD offers from CMU, USC, UMass Amherst and Cornell. Feb 2024 Tr$^2$AIL Lab: Tr$^2$AILer Debrup Das received PhD offers from UIUC and UM Amherst. Feb 2024 ECAI 2024: Serving as an SPC member. Feb 2024 LREC-COLING 2024: 1 Paper accepted about Jailbreaks and LLMs Tricking LLMs into Disobedience: Understanding, Analyzing, and Preventing Jailbreaks with Abinav, Atharva, Sachin and Monojit. Jan 2024 Google Research @Week: Spent a wonderful time at Google Research India with stalwarts from the Indian AI community. Check out posts by Jeff Dean on Twitter. Jan 2024 Preprints: Two new preprints released on numeric and conditional reasoning: 1) \"STUCK IN THE QUICKSAND OF NUMERACY, FAR FROM AGI SUMMIT: EVALUATING LLMS’ MATHEMATICAL COMPETENCY THROUGH ONTOLOGY-GUIDED PERTURBATIONS\" with SUTD, University of Michigan and 2) Code Prompting Elicits Conditional Reasoning Abilities in Text+Code LLMs\" with UKP Lab, TU Dramstadt, Queen's University. Dec 2023 Microsoft: Thanks Microsoft for awarding additional Azure grant of USD 20000 under the \"Accelerate Foundation Models Academic Research\" initiative. Nov 2023 CoLM 2023: Invited as Area Chair in the new Conference on Langugage Models! Please submit your papers. Dec 2023 Microsoft: Thanks Microsoft for awarding additional Azure grant of USD 20000 under the \"Accelerate Foundation Models Academic Research\" initiative. Nov 2023 CoLM 2023: Invited as Area Chair in the new Conference on Langugage Models! Please submit your papers. Nov 2023 Tr$^2$AIL Lab: Tr$^2$AILer Sachin Vashishtha won the PMRF scholarship for 2023! Congratulations Sachin! Nov 2023 Tr$^2$AIL Lab: Tr$^2$AILer and MTech student Debrup Das's internship with Rakuten India got extended for the second time. He is working now for 8 months funded by Rakuten! Congratulations Debrup!! Sep 2023 AACL-IJCNLP 2023: Two Long papers accepted in Main Conference: 1) SYNC: A Structurally guided Hard Negative Curricula for Efficient Neural Code Search (with Atharva Naik, Soumitra Das, Jyothi Vedurada), 2) Prover: Generating Intermediate Steps for NLI with Commonsense Knowledge Retrieval and Next-Step Prediction (with Deepanway Ghosal, Monojit Choudhury). Stay tuned for code and preprints! Aug 2023 LREV 2023: LREV Journal on Logical NLI dataset accepted with Ishan Tarunesh and Monojit Choudhury (Updated preprint soon). Jun 2023 EMNLP 2023: Invited as an Area Chair. Jun 2023 AAAI 2024: Invited as a Senior PC member for the second time. May 2023 Microsoft: Received the \"Accelerate Foundation Models Academic Research\" 2023 by Microsoft jointly with Prof. Animesh Mukherjee. This comes with large Azure credits and OpenAI API access. May 2023 ACL 2023: Our work on \"A Robust Information-Masking Approach for Domain Counterfactual Generation\" with Prof. Soujanya Poria, Pengfei Hong, Rishabh Bhardwaj, and Navonil Majumdar. Full credit goes to my co-authors!!! Apr 2023 Ashoka: I was invited to give a talk at Ashoka University for the AI@Ashoka Workshop. The talk slides are available here: AI Progress & Hype under the lens of Reasoning (PDF 14.0 MB size). Mar 2023 CS60092 COURSE UPDATE: Recording of GUEST LECTURE BY Dr. Anirudh Kembhavi, Director of Computer Vision at Allen Institute for AI (AI2) is available here. Jan 2023 Toloka AI Grant: Received the Toloka AI Annotation Grant of USD 300 for data creation in the Toloka AI platform. Thanks Toloka AI! Jan 2023 IIT KGP FSRG: Received the FSRG Grant aproval from IIT Kharagpur on \"The Role of Feedback in Vision-Language enabled Embodied Agents towards Application to Disaster Management\"! Jan 2023 USPTO: Second patent granted (filed during Adobe Research) on Marketing Knowledge Graph Creation! Congratulations to my co-author (/co-inventor) Dr. Atanu Sinha! Dec 2022 IndoML 2022: My invited talk on \"The Relevance of Representation and Reasoning in the era of (Large) Language Models\" is available here. Sep 2022 AACL-IJCNLP 2022: Two papers accepted. \"Multilingual CheckList: Generation and Evaluation\" in AAC",
  "content_length": 14406,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:15"
}