{
  "name": "Somdyuti Paul",
  "homepage": "https://somdyuti2.github.io",
  "status": "success",
  "content": "Somdyuti Paul Hi, I am an Assistant Professor at the Department of Artificial Intelligence, Indian Institute of Technology Kharagpur, Kharagpur, West Bengal, India. My current research focuses on image/video processing and understanding using machine learning. I am also exploring the role of visual perception in modeling visual data processing tasks. I was an Applied Scientist at Amazon Prime Video, Seattle, Washington, USA between 2022-2023, where I worked on automating the tasks of video content promotion, curation and moderation using data driven machine learning. I received a Ph.D. in Electrical and Computer Engineering from the University of Texas at Austin, Austin, Texas, USA in 2022. At UT Austin, I was part of the Laboratory of Image and Video Engineering, led by Prof. Alan Bovik. During my PhD, I conducted research on developing next generation video coding technologies using deep learning. I enjoy solo traveling, especially to explore nature and natural landscapes. I am also fond of poetry and classic literature. Announcement for Prospective Students: If you have a background in at least one of the areas of image/video processing, computer vision, vision science or deep learning, and would like to work with me, please feel free to go through my research page and write me an email. Your email should describe your background and experience in the aforementioned areas, which research problem you would like to work on, and how you plan to contribute to it. If you would like to work on a visual computing research problem that is not specified on my research page, I would be happy to hear your thoughts as well. News Jul 01, 2025 JRF Recruitment for ANRF funded project on Video Compression Using Generative AI May 20, 2025 Our paper “RAISE: Realness Assessment for Image Synthesis and Evaluation” has been accepted at MIPR 2025",
  "content_length": 1859,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:20"
}