{
  "name": "Somindu C. Ramanna",
  "homepage": "https://cse.iitkgp.ac.in/~somindu",
  "status": "success",
  "content": "Somindu Chaya Ramanna Somindu Chaya Ramanna Assistant Professor Department of Computer Science and Engineering Indian Institute of Technology, Kharagpur West Bengal 721302. Email: somindu AT cse DOT iitkgp DOT ernet DOT in I have done my Ph.D. under the supervision of Prof. Palash Sarkar at the Applied Statistics Unit of Indian Statistical Institute, Kolkata. From February 2015 to November 2016, I was a post-doctoral researcher in the AriC team of LIP laboratory at ENS de Lyon hosted by Dr. Benoît Libert. I spent one semester at the School of Electrical Sciences, IIT Bhubaneswar as an assistant professor (on contract). Currently, I am an assistant professor in the Department of Computer Science and Engineering at IIT Kharagpur. Here is my Curriculum Vitae. Teaching Present: Autumn 2025 Algorithmic Game Theory (CS60025) Randomised Algorithm Design (CS60029) (jointly with Dr. Palash Dey) Past CS60094 Computational Number Theory, Spring 2025 CS60088 Foundations of Cryptography (jointly with Dr. Satrajit Ghosh), Spring 2025 Algorithmic Game Theory (CS60025), Autumn 2024 Randomised Algorithm Design (CS60029), Autumn 2024 (jointly with Dr. Palash Dey) Foundations of Computing Science (CS60005), Autumn 2023 Randomised Algorithm Design (jointly with Dr. Palash Dey) (CS60029), Autumn 2023 Computational Number Theory (CS60094), Spring 2023 Algorithms Laboratory (CS29003), Spring 2023 (jointly with Dr. Palash Dey) Theory of Computation (CS41001), Autumn 2022 (jointly with Dr. Sudeshna Kolay). Foundations of Computing Science (CS60005), Autumn 2022 (jointly with Dr. Aritra Hazra). Programming and Data Structures (CS10003), Spring 2022 Algorithms Laboratory (CS29003), Spring 2022 (jointly with Dr. Palash Dey) Theory of Computation (CS41001), Autumn 2021 (jointly with Dr. Sudeshna Kolay). Foundations of Computing Science (CS60005), Autumn 2021 (jointly with Dr. Aritra Hazra). Computational Number Theory (CS60094), Spring 2021 Algorithms Laboratory (CS29003), Spring 2021 (jointly with Dr. Palash Dey) Computational Number Theory (CS60094), Spring 2020 Theory of Computation (CS41001), Autumn 2019. Computational Number Theory (CS60094), Spring 2019 Foundations of Cryptography (CS60088), Spring 2019 Theory of Computation (CS41001), Autumn 2018. Foundations of Cryptography (CS60088), Spring 2018 Theory of Computation (CS41001), Autumn 2017 (jointly with Dr. Soumyajit Dey). For Students Please note that I DO NOT take interns. Neither do I respond to emails regarding the same. Publications Journals Bishnu Charan Behera and Somindu C. Ramanna. Unbounded non-zero inner product encryption. Theor. Comput. Sci. 1000: 114548 (2024). Somindu C. Ramanna, Palash Sarkar. Efficient Adaptively Secure IBBE from the SXDH Assumption (pdf). IEEE Trans. Information Theory 62(10): 5709-5726 (2016). Somindu C. Ramanna, Palash Sarkar. On Quantifying the Resistance of Concrete Hash Functions to Generic Multicollision Attacks (pdf). IEEE Trans. Information Theory 57(7): 4798-4816 (2011). Conferences Bishnu Charan Behera and Somindu C. Ramanna. Multi-input Functional Encryption for Unbounded Inner Products. (pdf) ProvSec 2023, LNCS Volume 14217, pp. 274–289. Sikhar Patranabis, Debdeep Mukhopadhyay and Somindu C. Ramanna. Function Private Predicate Encryption for Low Min-Entropy Predicates. PKC 2019, LNCS Volume 11443, pp. 189–219. Junqing Gong, Benoît Libert and Somindu C. Ramanna. Compact IBBE and Fuzzy IBE from Simple Assumptions. SCN 2018, LNCS Volume 11035, pp. 563-582. (available here). Jie Chen, Benoît Libert and Somindu C. Ramanna. Non-Zero Inner Product Encryption with Short Ciphertexts and Private Keys (pdf). SCN 2016, LNCS Volume 9841, pp. 23-41. Benoît Libert, Somindu C. Ramanna and Moti Yung. Functional Commitment Schemes: From Polynomial Commitments to Pairing-Based Accumulators from Simple Assumptions (pdf). ICALP 2016, LIPIcs Volume 55, pp. 30:1-30:14. Somindu C. Ramanna. More Efficient Constructions for Inner-Product Encryption (pdf). ACNS 2016, LNCS Volume 9696, pp. 231-248. Somindu C. Ramanna, Palash Sarkar. Efficient (Anonymous) Compact HIBE from Standard Assumptions (pdf). ProvSec 2014, LNCS Volume 8782, pp. 243-258. Somindu C. Ramanna, Palash Sarkar. Anonymous Constant-Size Ciphertext HIBE from Asymmetric Pairings (pdf). IMACC 2013, LNCS Volume 8308, pp. 344-363. Somindu C. Ramanna, Sanjit Chatterjee and Palash Sarkar. Variants of Waters' Dual System Primitives Using Asymmetric Pairings (pdf). PKC 2012, LNCS Volume 7293, pp. 298-315. Reports Somindu C. Ramanna. Bounded DFA-Based Functional Encryption with Adaptive Security (pdf). IACR Cryptology ePrint Archive 2013:638 (2013). Ph.D. Thesis",
  "content_length": 4652,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:24"
}