{
  "name": "Somnath Dey",
  "homepage": "http://www.iiti.ac.in/~somnathd",
  "status": "success",
  "content": "Home | Somnath top of page This website was built on Wix. Create yours today.Get StartedDr. Somnath DeyWelcome to my home page. I am glad you have found your way to this site and appreciate your taking the time to visit. Currently, I am working as a Professor in the Department of Computer Science and Engineering at Indian Institute of Technology Indore. ​ ​Read MoreAnnouncementLooking for highly motivated student for the sponsored projectDownload Advertisement Apply Here Recent Articles R. P. Sharma and S. Dey, \"Two-stage Quality Adaptive Fingerprint Image enhancement using Fuzzy C-means Clustering Based Fingerprint Quality Analysis\", Image and Vision Computing, Elsevier, vol. 83–84, pp. 1-16, 2019. (SCI, IF-2.747) R. P. Sharma and S. Dey, \"Fingerprint Image Quality Assessment and Scoring Using Minutiae Centered Local Patches\", Journal of Electronic Imaging, SPIE, vol. 28, no. 1, pp. 013016-1- 013016-14, 2019. (SCI IF: 0.924)QIP (AICTE) SPONSORED Short-Term Course on Machine Learning Techniques for Biometric Security June 20-25, 2022 [Download Brochure]Research HighlightsBiometric recognition system refers to automatic recognition of individuals based on their unique physical or behavioural traits. The recent advancement in technologies has made biometric systems more affordable and as a result they are deployed in a variety of smart consumer devices such as mobile phones and tablets. However, it suffers from security and privacy invasion challenges. The compromise of a biometric data may cause permanent loss of identity of a user since biometric data is irreplaceable and irrevocable. My research group is working to address these issues. They are looking for a sufficiently robust cancelable biometric system with provision of substantial template protection mechanism needs to be designed which must meet four design criteria (irreversibility, revocability, diversity and accuracy) for a practical biometric system.bottom of page",
  "content_length": 1958,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:26"
}