{
  "name": "Somya D. Mohanty",
  "homepage": "http://www.somyamohanty.com",
  "status": "success",
  "content": "Somya D. Mohanty – University of North Carolina – Greensboro Somya D. Mohanty University of North Carolina - Greensboro Home Research Teaching Publications / Presentations Contact Me CV Download Department of Computer Science, UNC-G About me I am interested in discovering patterns and latent knowledge in large-scale complex and evolving systems. Specifically, my research focuses on discovery of dynamic patterns in sequence based data with novel eXplainable AI (X-AI) and deep learning algorithms. I work in large interdisciplinary areas of Natural Language Processing, Health AI, Social Media, Geo-Spatial Intelligence, and Cyber-Security. I am also very interested in real-world applicability of Data Science. The goal here is to bring data science theories and principles to practice. Within my research group students explore development of large scale analytical tools which are used to by scientists (and general population) to understand human behavior, equity, biases, community health, etc. While the effort is small we aim to create a positive impact in our society. Education Ph. D. 2013 Computer Science and Engineering Mississippi State University M.S. 2009 Computer Science Florida State University Academic Positions Present2022 Associate Professor, Dept. of Computer ScienceUniversity of North Carolina - Greensboro Present2021 Co-Director, The Institute of Data, Evaluation, and AnalyticsUniversity of North Carolina - Greensboro 20222016 Assistant Professor, Department of Computer ScienceUniversity of North Carolina - Greensboro 20162013 Assistant Research Professor and Coordinator of Innovative Data LaboratoryMississippi State University 20132012 Research AssistantMississippi State University 20122009 Research AssistantMississippi State University 20092008 Research AssistantFlorida State University 20082006 WebmasterFlorida State University Honors, Awards, and Grants May. 2022 Grant - Course Ecosystem Mapping, GSU Somya Mohanty (PI). Developing Natural language Processing approaches towards understanding course descriptions and latent mappings. May. 2022 Danville Quality of Life Explorer Bruce Rich (PI) and Somya Mohanty (Co-PI). Analyzing Quality of Life in Danville County, VA. Deployment of a longitudinal dashboard with health, economic, and demographic metrics. Dec. 2020 Grant - Machine Learning and Earth Sciences, USGS Evan Goldstein (PI) and Somya Mohanty (Co-PI). Developing machine learning approaches for understanding complex geological systems Apr. 2020 Bernard-Glickman Dean’s Professors Prof. Somya Mohanty has recently been named one of the few Bernard-Glickman Dean’s Professors in the College of Arts and Sciences at UNC Greensboro. This award is in recognition of his outstanding accomplishments as a member of the college’s faculty and the great potentials that the college sees in his research. Apr. 2020 Grant - Google TensorFlow, Urban Environmental Sensing with TensorFlow Lite and TensorFlow Lite for Microcontrollers. Evan Goldstein (PI) and Somya Mohanty (Co-PI) Apr. 2020 Grant - NSF IRES Track II: The Coastal Processes & Machine Learning Advanced Studies Institute Evan Goldstein (PI) and Somya Mohanty (Co-PI) Dec. 2019 Microsoft Data Science Fellow A Big Data approach towards understanding the factors responsiblefor scientific citations. Microsoft Research. Oct. 2019 Grant - Complex Data Analysis. National Science Foundation - Research Education for Undergraduates Sat Gupta, Xiaoli Gao, and Somya D Mohanty(Senior-Personnel).Complex Data Analysis.National Science Foundation - Research Education for Undergraduates, Aug. 2019 Grant - MassMine Advancement Grant for Sustainable Data-Driven Humanities Research, National Endowment for the Humanities (NEH) Aaron Beveridge and Somya D Mohanty(Co-PI). MassMine Advancement Grant for Sustainable Data-Driven Humanities Research. Digital Humanities Advancement Grants, National Endowment for the Humanities (NEH), $324,865. Aug. 2019. Nov 2017 Leveraging Twitter and Big Data Analytics for Natural Disaster Management and Recovery. Somya D Mohanty (PI), Fereidoon Sadri, Rick Bunch, Richard Cox, and Lynda Kellam. Leveraging Twitter and Big Data Analytics for Natural Disaster Management and Recovery. UNCG Giant Steps, $25,000. Nov. 2017. Nov 2017 Grant Homeless Prevention/ Eviction Diversion Program Pilot. Stephen Sills, Kenneth Gruber, Jeremy Bray, and Somya D Mohanty(Co PI). Homeless Prevention/ Eviction Diversion Program Pilot. Community-Engaged Pathways and Partnerships (P2), University of North Carolina - Greensboro, $16,000. Nov. 2017. Oct 2017 Microsoft Azure Research: A Semantic Big Data Graph of Research - Connecting Research for Knowledge. Prashanti Manda, Somya D Mohanty (Co-PI), Shan Suthaharan, and Sujit Ghosh. South BD Hub: A Semantic Big Data Graph of Research - Connecting Research for Knowledge. #academicgraph. Microsoft Azure for Research, $20,000 in Azure cloud computing credits. Oct. 2017. Aug 2017 NSF REU - Statistical and Machine Learning Approach to Complex Data Analysis. Sat Gupta, Somya D Mohanty (Co-PI), and Xiaoli Gao. Statistical and Machine Learning Approach to Complex Data Analysis. American Statistical Association - REU, NSF - Grant No - 1560332, $38,600. Aug. 2017. May 2015 Grant - DoD Somya D Mohanty (PI) and Ramkumar Mahalingam. Anomaly/Event Detection in High Velocity Streaming Data. Idaho Bailiff Project - DASI/PNNL, $419,960. May 2015 June 2015 Grant - NIJ Colleen Sinclair, Rebecca M. Goldberg, Megan Stubbs-Richardson, Somya D Mohanty (Co-PI), David May, and Tawny McLeon. When does rejection trigger aggression? A multi- method examination of a multi-motive model. National Institute of Justice, $1,619,644. June 2015. Dec. 2014 Grant - DUI Progress Tracker Somya D Mohanty (PI). MAFES - DUI Progress Tracker. Social Science Research Center - Mississippi State University, $87,782. Dec. 2014. 2014 Research Fellow Research Fellow - Social Science Research Center, Mississippi State University July 2014 Grant - Pathfinders Somya D Mohanty (PI). Pathfinders Data System. Mississippi State University, $5,000. July 2014 July 2014 Grant - TRPS Somya D Mohanty (PI). Tobacco Reporting and Progress System. Mississippi Tobacco Control - Mississippi Department of Health, $150,000. July 2014. Dec. 2013 Grant - NOAA John F. Edwards, Somya D Mohanty (Co-PI), and Patrick FitzPatrick. Assessment of Social Media Usage During Sever Weather Events and the Development of a Twitter-based Model for Improved Communication of Storm-related Information. Coastal Storm Awareness Program - NOAA , $150,000. Dec. 2013. July 2013 Grant - SMTAS Somya D Mohanty (PI) and Arthur Cosby. Social Media Tracking and Analysis System. Mississippi Agricultural and Forestry Experiment Station - Mississippi State University, $140,000. July 2013 2009 CTF Top Team Capture the Flag winner for Information Security for a week long exercise. 2005 Srujani Creativity Awarded the “Srujani” gift for creativity during summer internship at Rourkela Steel Plant for Spare Parts Management System.",
  "content_length": 7040,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:25"
}