{
  "name": "Soner Önder",
  "homepage": "https://www.mtu.edu/cs/department/faculty-staff/faculty/s-onder",
  "status": "success",
  "content": "Soner Onder | Computer Science | Michigan Tech Skip to page content Skip to footer navigation Computer Science Michigan Tech Computing Computer Science Faculty Directory Soner Onder Also in this section Soner Onder Contact Soner Onder soner@mtu.edu 906-487-2123 Rekhi Hall 303 Professor, Computer Science Affiliated Professor, Electrical and Computer Engineering PhD, (Computer Science), University of Pittsburgh, 1999 Links of Interest Faculty Webpage  FASTSphinx Area of Expertise Computer Architecture Programming Languages Simulation Recent Publications Shuhan Ding and Soner Onder. \"Unrestricted code motion: A program representation and transformation algorithms based on future values\". In Rajiv Gupta, editor, Compiler Construction, volume 6011 of Lecture Notes in Computer Science, pages 26-45. Springer Berlin / Heidelberg, 2010. 10.1007/978-3-642-11970-5_3. Read More Peng Zhou and Soner Onder. \"Improving single-thread performance with fine-grain state maintenance\". In Proceedings of the 5th conference on Computing frontiers, CF '08, pages 251-260, New York, NY, USA, 2008. ACM. Read More Changpeng Fang, Steve Carr, Soner Onder, and Zhenlin Wang. \"Feedback-directed memory disambiguation through store distance analysis\". In Proceedings of the 20th annual international conference on Supercomputing, ICS '06, pages 278-287, New York, NY, USA, 2006. ACM. Read More Changpeng Fang, Steve Carr, Soner Onder, and Zhenlin Wang. \"Path-based reuse distance analysis\". In Alan Mycroft and Andreas Zeller, editors, Compiler Construction, volume 3923 of Lecture Notes in Computer Science, pages 32-46. Springer Berlin / Heidelberg, 2006. 10.1007/11688839_4. Read More Changpeng Fang, S. Carr, S. Onder, and Zhenlin Wang. \"Instruction based memory distance analysis and its application to optimization\". In Parallel Architectures and Compilation Techniques, 2005. PACT 2005. 14th International Conference on, pages 27 - 37, 2005. Read More Peng Zhou, Soner Onder, and Steve Carr. \"Fast branch misprediction recovery in out-of-order superscalar processors\". In Proceedings of the 19th annual international conference on Supercomputing, ICS '05, pages 41-50, New York, NY, USA, 2005. ACM. Read More Steve Carr and Soner Onder. \"A case for a working-set-based memory hierarchy\". In Proceedings of the 2nd conference on Computing frontiers, CF '05, pages 252-261, New York, NY, USA, 2005. ACM. Read More ©",
  "content_length": 2405,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:27"
}