{
  "name": "Soneya Binta Hossain",
  "homepage": "https://soneyahossain.github.io",
  "status": "success",
  "content": "Soneya Hossain · Soneya Hossain Soneya Hossain Assistant Professor Computer Science University of Texas at Dallas About I am an Assistant Professor of Computer Science in the Erik Jonsson School of Engineering and Computer Science at the University of Texas at Dallas, where I began on August 1, 2025. UTD is ranked #5 in Software Engineering in CSRankings. I earned my Ph.D. in Computer Science from the University of Virginia in Summer 2025, where I was advised by Dr. Matthew Dwyer. My research combines program analysis and artificial intelligence to automate and enhance various software engineering tasks—such as testing, debugging, and program repair—with the goal of making software more reliable and development more cost-efficient. During my Ph.D., I collaborated with Lockheed Martin and multiple teams at AWS, including CodeGuru, CodeCatalyst, and AWS AI Labs, and my work has been published in premier venues (e.g., ICSE, FSE, NeurIPS). 🚀 Join Us! I’m recruiting 2–3 fully funded PhD students in AI for Software Engineering — focusing on requirements, testing, debugging, and repair. If you’re passionate about building intelligent tools for reliable software, explore my recent papers and email me with ideas you’d love to pursue. 💡 UTD Undergraduates: Join my RIDE projects — email me or Joshua.Summers@UTDallas.edu . 🌍 International Students: Ask about our remote internship opportunities. ✨ Let’s advance Software Engineering with AI! Education Ph.D. in Computer Science, University of Virginia Advisor: Matthew Dwyer Committee: Sebastian Elbaum, Yangfeng Ji, Matthew Bolton, Antonio Filieri Thesis: Assessing and Improving Critical Properties of Test Oracles for Effective Software Bug Detection. Master of Computer Science (MCS), University of Virginia Project: TOGLL: Correct and Strong Test Oracle Generation with LLMs. B.Sc. in Computer Science and Engineering, Bangladesh University of Engineering and Technology (BUET) Thesis: Balanced Coverage in Fault-Tolerant Broadcasting for Wireless Multi-hop Networks. News August 1, 2025: Joined CS@UTD as a Tenure-track Assistant Professor. July 25, 2025: Relocated to Dallas, TX from beautiful Virginia. June 25, 2025: Attended FSE 2025 in Trondheim, Norway, and presented my paper Doc2OracLL. April 25, 2025: Attended ICSE 2025 in Ottawa, Canada, and presented my paper TOGLL. April 25, 2025: I successfully defended my PhD and officially became Dr. Soneya Binta Hossain! April 2025: My paper Doc2Oracle: Investigating the Impact of Javadoc Comments on Test Oracle Generation is accepted at FSE’25 Research Track. Nov 2024: My paper TOGLL: Correct and Strong Test Oracle Generation with LLMs is accepted at ICSE’25 Research Track. Sep 2024: Received travel grant to attend the SWE24 — the world’s largest conference for women in engineering and technology—from October 23–26 in Chicago, IL. Sep 2024: Received UVA’s most prestigious Endowed Fellowship! This fellowship is awarded to outstanding doctoral students with an award of $12,000. May 2024: Received Master of Computer Science (MCS) from UVA with a CGPA of 4.0/4.0! [gallery] May 2024: Defended my PhD dissertation proposal, titled Assessing and Improving Critical Properties of Test Oracles for Effective Software Bug Detection [gallery] April 2024: Attended ICSE’24 in beautiful Lisbon, Portugal, and presented my paper at the doctoral symposium [gallery] April 2024: Honored to be selected as one of the five finalists at UVA Research Computing Exhibition 2024! April 2024: My paper A Deep Dive into Large Language Models for Automated Bug Localization and Repair is accepted at FSE’24 Research Track. December 2023: My paper Ensuring Critical Properties of Test Oracles for Effective Bug Detection is accepted at the ICSE’24 Doctoral Symposium. December 2023: Presented our paper Neural-Based Test Oracle Generation: A Large-Scale Evaluation and Lessons Learned at FSE’23 (Dec 3-9) in San Francisco, CA [gallery] October 2023: Honored to receive Student Choice Research Award at CS Department Research Symposium 2023. July 2023: Our paper Neural-Based Test Oracle Generation: A Large-scale Evaluation and Lessons Learned is accepted at the FSE’23 research track. June 2023: Started summer internship at AWS CodeCatalyst team in Santa Clara, CA. May 2023: Presented our paper at ICSE’23 in Melbourne, Australia [gallery] May 2023: Received the John A. Stankovic Outstanding Graduate Research Award [gallery] April 2023: Attended CRA Grad Cohort in San Francisco, CA [gallery] February 2023: Our research artifact is accepted at the ICSE Artifact Evaluation Track. December 2022: Our paper on Measuring and Mitigating Gaps in Structural Testing is accepted at the ICSE’23 technical track. May 2022: Started summer internship at AWS Code Guru team in Seattle, WA. May 2022: Received Outstanding Graduate Service Award [gallery] April 2022: Attended ICSE’22 in Pittsburgh. December 2021: Received Outstanding Research Poster Award at CS Research Symposium. December 2021: Organized CS Department Research Symposium, News, Tweet. September 2021: Passed the Ph.D. Qualifying Exam with flying colors! April 2021: Attended the CRA-W Grad Cohort Workshop 2021 (virtual due to COVID-19). February 2021: Started working as a TA for graduate compilers (CS 6620) by Prof. Matt Dwyer. August 2019: Started Ph.D. in CS at the University of Virginia.",
  "content_length": 5364,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:25"
}