{
  "name": "Songqing Chen",
  "homepage": "https://cs.gmu.edu/~sqchen",
  "status": "success",
  "content": "Welcome to Songqing Chen's Home Page Songqing Chen Professor, IEEE Fellow Department of Computer Science George Mason University Office: 5319 Engineering Building Phone: 703-993-3176 Fax: 703-993-1710 Email: sqchen at gmu dot edu (replace at with @, dot with .) Biosketch Teaching CS 571: Operating Systems, Fall 2018 Research Interests Internet Streaming and Content Delivery Internet Measurement and Modeling Mobile and Cloud Computing Security and Privacy Distributed Systems SANG Seminars@Mason System and Networking Group Seminars@Mason.(invitation) Recent Publications (Publication List) Ruizhe Shi, Yuqi Fu, Ruizhi Cheng, Bo Han, Yue Cheng, and Songqing Chen. \"The Decentralization Dilemma: Performance Trade-Offs in IPFS and Breakpoints\". Proceedings of ACM Internet Measurement Conference (IMC'25), Madison, WI, October 28-31, 2025. Ruizhi Cheng, Surendra Pathak, Guowu Xie, Matteo Varvello, Songqing Chen, and Bo Han. \"Hello, GenAI? Dissecting Human to Generative AI Calling\". Proceedings of ACM Internet Measurement Conference (IMC'25), Madison, WI, October 28-31, 2025. Sthitadhi Sengupta, Nan Wu, Matteo Varvello, Krish Jana, Songqing Chen, and Bo Han. \"From WebGL to WebGPU: A Reality Check of Browser-based GPU Acceleration\". Proceedings of ACM Internet Measurement Conference (IMC'25), Madison, WI, October 28-31, 2025. Ruizhi Cheng, Jie Li, Songqing Chen, and Bo Han. \"Dissecting User Experience of Social Virtual Reality: A Tale of Five Platforms\". Proceedings of the 28th ACM SIGCHI Conference on Computer-Supported Cooperative Work & Social Computing (CSCW), Bergen, Norway, October 18-22, 2025. Nan Wu, Ruizhi Cheng, Songqing Chen, Bo Han. \"PIPE: Privacy-preserving 6DoF Pose Estimation for Immersive Applications\". Proceedings of the ACM SenSys 2025, Irvine, CA, May 6-9, 2025. Ruizhe Shi, Ruizhi Cheng, Yuqi Fu, Bo Han, Yue Cheng, Songqing Chen. \"Centralization in the Decentralized Web: Challenges and Opportunities in IPFS Data Management\". Proceedings of the ACM WWW 2025, Sydney, Australia, April 28 - May 2, 2025. Ruizhi Cheng, Yuetong Wu, Ashish Kundu, Hugo Latapie, Myungjin Lee, Songqing Chen, Bo Han. \"MetaFL: Privacy-preserving User Authentication in Virtual Reality with Federated Learning\". Proceedings of the ACM SenSys 2024, Hangzhou, China, November 4-7, 2024. Ruizhi Cheng, Nan Wu, Matteo Varvello, Eugene Chai, Songqing Chen, Bo Han. \"A First Look at Immersive Telepresence on Apple Vision Pro\". Proceedings of the ACM Internet Measurement Conference 2024 (IMC'24), Madrid, Spain, November 4-6, 2024. Yuqi Fu, Ruizhe Shi, Haoliang Wang, Songqing Chen, and Yue Cheng. \"ALPS: An Adaptive Learning, Priority OS Scheduler for Serverless Functions\". Proceedings of the USENIX Annual Technical Conference (USENIX ATC 24), Santa Clara, CA, July 10-12, 2024. Ruizhe Shi, Ruizhi Cheng, Bo Han, Yue Cheng, and Songqing Chen. \"A Closer Look into IPFS: Accessibility, Content, and Performance\". Proceedings of the ACM SIGMETRICS / IFIP Performance 2024, Venice, Italy, June 10 - 14, 2024. Na Wang, Jin Zhou, Jie Li, Bo Han, Fei Li, and Songqing Chen. \"HardenVR: Harassment Detection in Social Virtual Reality\". Proceedings of the 31st IEEE Conference on Virtual Reality and 3D User Interfaces (VR 2024), Orlando, FL, March 16-21, 2024. Ruizhi Cheng, Erdem Murat, Lap-Fai Yu, Songqing Chen, and Bo Han. \"Understanding Online Education in Metaverse: Systems and User Experience Perspectives\". Proceedings of the 31st IEEE Conference on Virtual Reality and 3D User Interfaces (VR 2024), Orlando, FL, March 16-21, 2024. Recent Professional Activities Co-organizer, NSF Workshop on Immersive Computing, March 31 - April 1, 2025 Chair, IEEE Computer Society Technical Community on the Internet (TCI), 2019-2024 Editorial Board: IEEE TPDS (2018-2022), IEEE IC, IEEE IoT-J (2020-2024), ACM TOIT Co-organizer, NSF CSR/NeTS 2019 Joint PI Meeting Conference Organizations TPC Co-Chair: IEEE ICDCS 2025 TPC Co-Chair: ACM/IEEE SEC 2024 (please submit your work) General Chair: ICDCS 2021 TPC Co-Chair: IEEE CIC 2020 General Co-Chair: ACM/IEEE SEC 2019 Finace Chair: ACM CoNEXT 2019 Publication Co-Chair: SecureComm 2019 Technical Program Committee Member KDD'2021, MM'2021, WWW'2021 (the Web Conference), CIKM'2021, MMSys'2021, CNS'2021, MM Asia'2021, WASA'2021, ICICS'2001, MetroCAD'2021, ICC'2021 KDD'2020, MM'2020, INFOCOM'2020, WWW'2020 (the Web Conference), CIKM'2020, SEC'2020, MMSys'2020, CNS'2020, WASA'2020, MetroCAD'2020, ICC'2020 KDD'2019, MM'2019, INFOCOM'2019, WWW'2019 (the Web Conference) NOSSDAV'2019, MMSys'2019, CNS'2019, WASA'2019, ICICS'2019 KDD'2018, MM'2018, INFOCOM'2018, CIKM'2018, NOSSDAV'2018, MMSys'2018, CNS'2018, ICME'2018, ICCCN'2018, WASA'2018, NSS'2018, CLOUD'2018, ICICS'2018, HotEdge'2018 Past Research Advisees Zili Zha, Ph.D., defended in July 2021, Facebook. Li Liu, Ph.D., defended in November 2020, Google. Mengbai Xiao, Ph.D., defended in May 2018, Qilu Young Professor of Computer Science at Shandong University. Wentao Chang, Ph.D., defended in May 2018, Google. An Wang, Ph.D., defended in April 2018, Assistant Professor of Computer Science at Case Western Reserve University (NSF CAREER Award, Google Faculty Research Award). Huangxin Wang, Ph.D., co-advising, defended in May 2017, Facebook. Mohammad Karami, Ph.D., co-advising, defended in May 2016, Google. Ming Zhang, M.S., May 2015, Amazon. Mohammed Hassan, Ph.D., defended in November 2014, Google. Xin Li, M.S., defended in April 2013, Samsung Research America Dallas. Yao Liu, Ph.D., defended in April 2013, Assistant Professor of ECE at Rutgers University (NSF CAREER Award). Kshitiz Bhattarai, M.S., December 2012, SAP Lab. Lei Liu, Ph.D., defended in December 2010, Vuclip. Dongyu Liu, Ph.D., defended in August 2009, MicroStrategy. Some Open Source Code ffmpeg360: It is a tool for rendering 360-degree videos and converting between projection types. Operations are performed on the GPU within a fork of the FFmpeg utility. Its GitHub repository is here. Please refer to our paper for more details. CAD (Content Assited Displaying for Mobile Device Power Saving): CAD for the online video calls is based on WebRTC. The implementation utilizes the GPU on mobile devices. Its GitHub repository is here. For more technical detail, please refer to our paper. UMON (User Defined Monitoring for SDN based networks): UMON implements a separate monitoring table that decouples monitoring from switching in the open vSwitches. Its GitHub repository is here. For more technical detail, please refer to our paper. XEN Scheduler: Cloud is subject to various side channel attacks due to underlying sharing of the physical resources. Our new schedulers can effectively mitigate such threats. Its GitHub repository is here. For more technical detail, please refer to our paper. rKube: Containers are widely used in clouds, but they often fail to deliver the anticipated performance with the allocated resources. Our new mechanism, rKube, can effectively address that on top of Kubernetes and Linux. Its GitHub repository is here. For more technical detail, please refer to our paper. SFS (Smart Function Scheduler): Serverless functions are typically short and their execution may get significantly prolonged due to contentions. SFS addresses this by using two level scheduling. Its GitHub repository is here. For more technical detail, please refer to our paper.",
  "content_length": 7370,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:29"
}