{
  "name": "Songqiao Han",
  "homepage": "http://simecv.sufe.edu.cn/page.aspx?id=53",
  "status": "success",
  "content": "韩松乔 教师介绍 韩松乔 姓名: 韩松乔 最后学位: 博士 职称: 教授 公共职务: 导师岗位: 博导 办公室: 406 电话: 021-65901457 Email: han.songqiao AT shufe.edu.cn 个人简介 上海财经大学信息管理与工程学院教授，博士生导师。上海交通大学计算机应用技术专业博士毕业，美国西北大学访问学者。主要研究方向为人工智能大模型和知识图谱在金融和经济领域的应用。主持和参加国家级和省部级项目10余项，大型企业项目数项。近年在国际顶会和知名期刊KDD、NeurIPS、AAAI、EMNLP、CIKM、KDS、FGCS、ECRA、CIE等发表学术论文50余篇。获上海市科技进步二等奖1项（3/10）、国家发明专利授权2项。指导学生获得国家和上海市计算机大赛一、二、三等奖近20项。多次获得上海财经大学校级嘉奖、先进工作者、“我心目中的好老师”等荣誉。 教授课程 研究生必修课：大数据平台与技术 本科生必修课：操作系统、Web程序设计、综合设计实验 本科生选修课：Python程序设计 本科高年级研讨课：深度探索大数据 科研项目 主持和主要参加的国家级项目： 数据资产的价值创造、会计实现及其经济后果研究 基于大数据的“第四张报表”构建及其应用研究 基于大数据的中国资本市场全息社会网络深度挖掘及研究 移动自组网中基于QoS和资源节约的分布式服务组合关键技术研究 面向海量数据语义标注众包的任务管理方法研究 社会资本与社会媒体使用行为的关系研究：以新浪微博、腾讯微博为例 基于理性行为理论的开放式在线外包市场中信任形成机制研究 主持和主要参加的省部级科研项目： 基于用户画像的证券投资和运营管理智能决策模型研究 基于大数据的新媒体广告策略优化关键技术研究 移动商务中服务自适应性及其关键技术研究 IT操作风险传导、度量和控制研究--以银行业为例 面向用户兴趣基于本体学习的网络舆情研判体系研究-以论坛为例 教育背景 2003 – 2008， 上海交通大学，计算机科学与技术系，博士 2013 – 2014,   美国西北大学，计算机科学系，访问学者 发表论文 Sample Design Engineering: An Empirical Study on Designing Better Fine-Tuning Samples for Information Extraction with LLMs，Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing （EMNLP 2024），2024. ADGym: Design Choices for Deep Anomaly Detection, Advances in Neural Information Processing Systems (NeurIPS 2023), 2023. Anomaly Detection with Score Distribution Discrimination, The 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2023), 2023. Source Code (Github). A group-dependent due window assignment scheduling problem with controllable learning effect. Asia-Pacific Journal of Operational Research (APJOR), 2023. Adbench: Anomaly detection benchmark. Advances in Neural Information Processing Systems (NeurIPS 2022), 35, pp.32142-32159, 2022.  Source Code (Github）[To the best of our knowledge, our ADBench stands as the most comprehensive tabular anomaly detection benchmark to date. We compare the performance of 30 anomaly detection algorithms across 57 datasets, culminating in a total of 98,436 experiments.] IDEA: Interactive Double Attentions from Label Embedding for Text Classification. In 2022 IEEE 34th International Conference on Tools with Artificial Intelligence (ICTAI 2022), pp. 233-238. IEEE, 2022. Core patent forecasting based on graph neural networks with an application in stock markets. Technology Analysis & Strategic Management, 2022. An Empirical Cross Domain-Specific Entity Recognition with Domain Vector. Proceedings of the 31st ACM International Conference on Information & Knowledge Management (CIKM 2022), 2022. Label Confusion Learning to Enhance Text Classification Models. Proceedings of the AAAI Conference on Artificial Intelligence (AAAI 2021), 35(14), 12929-12936, 2021. . Source Code (Github). Optimal operation and subsidies/penalties strategies of a multi-period hybrid system with uncertain return under cap-and-trade policy. Computers & Industrial Engineering (CIE), Vol.150, pp.1-15, December 2020. Knowledge of words: An interpretable approach for personality recognition from social media. Knowledge-Based Systems (KBS). Vol. 194, pp.1-20, April 2020. An event-extraction approach for business analysis from online Chinese news, Electronic Commerce Research and Applications (ECRA), Vol. 28, pp. 244-260, 2018. An Intelligent Service Collaboration Algorithm for Wireless Sensor Networks, Sensor Letters, Volume 9, Number 4, pp.1485-1489, 2011. A resource aware software partitioning algorithm based on mobility constraints in pervasive grid environments. Future Generation Computer Systems (FGCS), Elsevier Science, 2008, 24(6), pp.512-529. 基于大数据的企业“第四张报表”：理论分析、数据实现与研究机会, 管理科学学报，2023. 荣誉奖励 个人获上海财经大学“我心目中的好老师”、“校级嘉奖”、“校先进工作者”等 作为团队主要成员获上海市科技进步二等奖、上海市“教学成果一等奖”、上海财经大学“校级嘉奖” 指导学生获“中国大学生计算机设计大赛”和“上海市大学生计算机应用大赛”一、二、三等奖数十项 862ZrMjFUFyq",
  "content_length": 3739,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:28"
}