{
  "name": "Song Min Kim",
  "homepage": "https://sites.google.com/view/smilelab",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationWe are recruiting students (at all levels) and postdocs! Wireless Networks & Communication | RF & Radar Systems | Embedded Systems and IC Design Please email Prof. Song Min Kim (songmin[at]kaist.ac.kr) if you are passionate in one of the above areas! ■ Wireless Networks ■■ Internet of Things ■■ Mobile Computing ■(learn more, watch videos)Latest News[Jan '25] 1 new MS (Hyunhee) + 1 new PhD (Seokwon) in Spring '25. Welcome![Jan '25] Song Min is serving as a General Co-chair for ICNP '25[Sep '24] 1 new MS (Jongeun) from Fall '24. Welcome![Aug '24] Song Min is serving on the TPC for MobiCom '25[Jun '24] Kangmin and Hankyeol's work has won the best paper award at MobiSys '24. Congrats![May '24] Song Min is serving on the Advisory TPC for INFOCOM '25[Apr '24] Song Min is serving on the TPC for SenSys '24[Mar '24] Hankyeol and Kangmin's work has been accepted to MobiSys '24. Congrats![Feb '24] 1 new MS (Geonung) has joined the lab in Spring '24. Welcome![Dec '23] Minseok and Namjo's work has been accepted to NSDI '24. Congrats![Sep '23] Song Min is serving on the editorial board of the ACM Transactions on Sensor Networks, a premier journal in IoT[Aug '23] Song Min is serving on the TPC for MobiCom '24[Jul '23] Our grant from Samsung Research Funding & Incubation Center (삼성미래기술육성사업), one of the most prestigious grants in Korea, has been extended to 2026 for a total of 1.2M USD[May '23] Hankyeol and Kangmin's poster has been accepted to MobiSys '23. Congrats![May '23] Hankyeol and Kangmin's work has been accepted to MobiSys '23. Congrats![May '23] Song Min is serving on the Advisory TPC for INFOCOM '24[Apr '23] Kangmin's OmniScatter work has been selected as SIGMOBILE Research Highlight [link][Feb '23] Hankyeol and Kangmin's work has been conditionally accepted to MobiSys '23. Congrats![Feb '23] Seungwoo and Hyeonho's work has been accepted to IPSN '23. Congrats!CONTACT USEmail: sonhaksun10[at]kaist.ac.kr(Haksun Son(손학선) - Student Lead (랩대표)) Location: Room 918, N1 buildingPostal Address: 918 N1 building, KAIST, 291 Daehak-ro Yuseong-gu, Daejeon 34141, Republic of Korea Older News[Sep '22] 2 new PhDs (Minseok and Hakson) from Spring '23. Welcome![Sep '22] 1 new MS (Junbeom) has joined the lab in Fall '22. Welcome![Sep '22] Song Min received the departmental teaching award for Spring '22 (EE414 Embedded Systems)[Sep '22] Song Min is serving on the TPC for NSDI '23[Aug '22] Song Min will serve on the editorial board of IEEE/ACM Transactions on Networking[Jul '22]  Geumseo has joined the lab as a new undergraduate intern. Welcome![Jul '22]  Junbeom has joined the lab as a new MS student. Welcome! [Jun '22] Kangmin's work has won the best paper award at MobiSys '22. Congrats![May '22] Song Min is serving on the Adisory TPC for INFOCOM '23[May '22] Kangmin's work has been accepted to MobiSys '22. Congrats Kangmin![Mar '22] Hakson won Award of Excellence in the university-wide Undergraduate Research Program. Congrats![Mar '22] 3 new PhDs (Hyeonho, Seungwoo, Hankyeol) + 1 new MS (Hakson) joined the lab. Welcome![Aug '21] 2 new undergraduate interns (Jihyeon, Zhamaliddin Kalzhan). Welcome![Jul '21] 2 new and 2 continuing undergraduate interns (Seonkyu, Handong, Hakson, Myunggeun). Welcome![Jun '21] Song Min is serving on the TPC for MobiCom '22[May '21] Song Min is serving on the Adisory TPC for INFOCOM '22[Apr '21] Awarded grant from Samsung Research Funding & Incubation Center (삼성미래기술육성사업), one of the most prestigious grants in Korea.[Mar '21] Tool release - Cross-technology channel estimation[Mar '21] Song Min is serving on the TPC for WiNTECH '21[Feb '21] 2  new PhD (Kangmin, Namjo) + 4 new MS students (Seungwoo, Hankyeul, Seokwon, Minseok). Welcome aboard and enjoy your academic journey![Jan '21] Song Min will join the NSF Spectrum Innovation Initiative Workshop (Jan. 6) as a presenter and a panelist[Dec '20] 3 new and 1 continuing undergraduate interns (Hakson, Yookyum, Jaechan, Myunggeun). Welcome![Nov '20] Song Min is serving on the TPC for ICDCS '21[Oct '20] Shuai's work has been accepted to SenSys '20. Congrats Shuai![Sep '20] Seungwoo, Hankyeol, and Hakson have joined the lab as undergraduate intern, welcome![Aug '20] Woojae's work of SDR-Lite is now officially accepted to MobiCom '20. Congrats Woojae![Jul '20] Song Min is serving on the TPC for MobiCom '21[Jul '20] Song Min is serving on the Adisory TPC for INFOCOM '21[Jun '20] Song Min is serving on the Posters/Demos TPC for SIGCOMM '20[Jun '20] Woojae's work has been conditionally accepted to MobiCom '20. Congrats Woojae![Jun '20] Geonha has joined the lab as an PhD student, welcome![Jun '20] Jinhwan has defended his PhD dissertation. Congrats and best of luck in Jinhwan's future career![May '20] KAIST ranked 5th in the world in mobile computing research, based on 5-year (2015-2020) record. Check it out here.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4966,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:27"
}