{
  "name": "Song Guo 0001",
  "homepage": "https://cse.hkust.edu.hk/~songguo",
  "status": "success",
  "content": "Song Guo - Hong Kong University of Science and Technology SongGuo Song Guo Chair Professor FCAE, MAE, FIEEE, FAAIA HOME RESEARCH GRANTS SERVICE AWARDS TEACHING CYT-3006A (via lift 35/36) Department of Computer Science and Engineering The Hong Kong University of Science and Technology Clear Water Bay, Kowloon Hong Kong SAR Phone: +852 2358 8833 E-mail: songguo@cse.ust.hk Google Scholar ORCID: 0000-0001-9831-2202 Song Guo is a Chair Professor in the Department of Computer Science and Engineering (CSE) at the Hong Kong University of Science and Technology (HKUST). He also holds a Changjiang Chair Professorship awarded by the Ministry of Education of China. His research interests are mainly in Large Language Model, Edge AI, and Machine Learning Systems. As a Highly Cited Researcher (Clarivate Web of Science), he published many papers in top venues with wide impact in these areas and received over a dozen Best Paper Awards from IEEE/ACM conferences, journals and technical committees. He is also the recipient of Edward J. McCluskey Technical Achievement Award in 2024, First Prize in Natural Science (China Electronics Society) in 2023, Gold Medal of Geneva Inventions Expo in 2024 & 2023, etc. Prof. Guo is a world-renowned leader who made fundamental and pioneering contributions to the development of novel edge intelligence architectures, algorithms, and systems over ubiquitous mobile, IoT, and wearable devices. His work on edge AI, cloud-edge computing, and resilient computing has created significant impact from generation of new scientific knowledge to creation of innovative technologies, as featured widely in prominent public media. He is a Fellow of the Canadian Academy of Engineering (FCAE), Member of Academia Europaea (MAE), Fellow of the IEEE (FIEEE), Distinguished Member of the ACM, and Fellow of the Asia-Pacific Artificial Intelligence Association (FAAIA). Prof. Guo was an IEEE Communications Society (ComSoc) Distinguished Lecturer, a member of IEEE ComSoc Board of Governors, and the Chair of IEEE ComSoc Space and Satellite Communications Technical Committee. He has served on IEEE Fellow Evaluation Committee for both ComSoc and Computer Society. He is the Editor-in-Chief of IEEE Transactions on Cloud Computing and the founding Editor-in-Chief of IEEE Open Journal of the Computer Society. Prof. Guo has been named on editorial board of a number of prestigious international journals like IEEE TC, IEEE TPDS, IEEE TCC, IEEE TETC, IEEE TSUSC, ACM Computing Surveys, etc. He has also served as a chair of organizing and technical committees of numerous IEEE/ACM conferences, workshops and symposia. He delivered more than 100 keynote addresses. He has served on RGC engineering panel and been frequently invited for various national and international grant/award reviews. He is the Secretary General of China Computer Federation (CCF) Hong Kong. Recruitment I am looking for strongly motivated PhD students, Research Assistants and Postdoctoral Fellows to join our Pervasive Intelligence Lab to explore LLMs, VLMs, Embodied AI, and other exciting areas of AI research. News Edward J. McCluskey Technical Achievement Award, 2024 Gold Medal, Geneva Inventions Expo, 2023 Elected Member of Academia Europaea, 2022 RGC Areas of Excellence Scheme (AoE), \"6G: Wireless Access and Connectivity for an Intelligent and Sustainable World\", 2023-2027, Co-PI, 87,304,000 HKD Highly Cited Researcher, Clarivate Web of Science, 2020 & 2021 & 2022 & 2023",
  "content_length": 3477,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:25"
}