{
  "name": "Songhe Feng",
  "homepage": "https://faculty.bjtu.edu.cn/8407",
  "status": "success",
  "content": "北京交通大学教师名录 冯松鹤 博士 、教授 、博士生导师 基本信息 办公电话：N/A 电子邮件： shfeng@bjtu.edu.cn 通讯地址：北京交通大学计算机科学与技术学院 邮编：100044 个人简介 北京交通大学计算机科学与技术学院教授，博士生导师，入选首批北京交通大学青年英才培育计划(2015-2017)，获得2023年度北京图象图形学学会优秀导师提名奖。主要研究领域为多模态机器学习算法及在跨域图像语义理解中的应用。累计主持国家自然科学基金项目3项，北京市自然科学基金项目3项，河北省自然科学基金项目1项，教育部博士点基金1项，中国博士后科学基金特别资助项目及面上项目2项。在包括 IEEE TPAMI, IEEE TIP, IEEE TKDE, ACM TKDD, IEEE TMM, IEEE TCSVT, IEEE TCYB, IEEE TNNLS 等知名学术期刊以及 ICML, NeurIPS, CVPR, ICCV, AAAI, IJCAI, ACM SIGKDD, ACM Multimedia 等知名国际会议上累计发表各类研究论文近百篇。 教育背景 2003.09 - 2009.01  北京交通大学，计算机应用技术，直博，博士 (导师：须 德 教授)； 1999.09 - 2003.07  北京交通大学，计算机科学与技术，学士； 工作经历 2017.12 - 至今         北京交通大学，计算机科学与技术学院，教授； 2025.07 - 2025.08   特罗姆瑟大学(挪威)，高级研究学者； 2024.01 - 2024.02   康考迪亚大学(加拿大)，高级研究学者； 2017.09 - 2017.12   德累斯顿工业大学(德国)，访问学者； 2013.10 - 2014.10   密歇根州立大学(美国)，访问学者 (合作导师：Rong Jin)； 2012.12 - 2017.11   北京交通大学，计算机与信息技术学院，副教授； 2011.01 - 2012.11   北京交通大学，计算机与信息技术学院，讲师； 2009.04 - 2010.12   北京交通大学，计算机与信息技术学院，师资博士后； 研究生招生与培养 (A). 本人指导研究生（近五年来） ： 获得 北京图象图形学学会优博论文提名奖1人/次，校级优秀博士论文 1人/次， 校级优秀硕士论文 8人/次，知行奖学金(校最高奖学金) 2人/次，国家奖学金 10人/次； 发表CCF A类会议论文、 IEEE/ACM Trans系列汇刊论文近50篇； (B). 本人常年招收博士研究生(直博/硕博连读/申请考核：每年1名)，硕士研究生(每年2-4名)！欢迎 计算机科学与技术/ 数学 / 信息与计算科学 等专业同学邮件咨询！欢迎詹天佑学院的同学们联系！ 热爱科研，并有志于发表高水平论文(领域内的CCF A类系列会议或IEEE/ACM Trans系列汇刊)； 良好的数学基础/英文读写/编程能力； 善于沟通与合作； 在读研究生 博士研究生: 王   靖 (2022-，申请考核, 国家奖学金 | CVPR, AAAI, IJCAI, ACM MM) 张   阳 (2023-，硕博连读, IJCAI, ACM MM) 李嘉诚 (2024-,  詹院直博, AAAI) 朱   臻 (2024-,  定向普博, AAAI) 闫旭东 (2025-,  硕博连读, NeurIPS, IJCAI) 全日制硕士研究生: 张晓丽 (2023-) 时伟东 (2024-), 左臣 (2024-), 温昊楠 (2024-) 姜国祥 (2025-), 白京豫 (2025-), 王佳鑫 (2025-) 毕业研究生 博士： 2024：谷志斌 (ICML, NeurIPS, KDD, ACM TKDD*3) 2024：吴亚楠 (ICCV, AAAI*2, IJCAI, IEEE TCSVT*2) 2022：吕庚育 (北京图象图形学学会优博论文提名奖 |校级优秀博士论文 | 知行奖学金, AAAI, IJCAI, KDD, IEEE TKDE, IEEE TCYB*2) 2021：孙利娟 (IEEE TMM, AAAI, KAIS) 硕士： 2025：季津天 (校级优秀硕士论文 | 知行奖学金 | 国家奖学金*2, IEEE TPAMI, ICCV, KDD, ACM MM*2, Neural Networks*2), 吴婷婷 (校级优秀硕士论文 | 国家奖学金, AAAI*2) 2024：梁婧 (校级优秀硕士论文); 杨洪涛 2023:  邓响 (校级优秀硕士论文 | 国家奖学金, IEEE TMM); 刘威 (校级优秀硕士论文 | 国家奖学金)；孙伟华 (校级优秀硕士论文); 张展；王佳艺;  胡睿婷 2022:  陆迅 (校级优秀硕士论文, ACM TKDD*2); 刘馨媛 (国家奖学金); 王绍凯; 赵建国; 周彤；任博伟 2021：李子薇 (国家奖学金, IJCAI); 孙悦 (国家奖学金) 2020：叶苹; 刘燕; 季玲玲; 李艳青 2019：权洪林; 黄文英; 黄维雪 2018：王晓莹 (校级优秀硕士论文) 2017：李敬伟; 孙健 2016：罗骁原; 邢妍妍; 翟昱昊 2014：谢延涛 科研项目 主持多项  国家自然科学基金项目 / 北京市自然科学基金项目 / 教育部博士点基金项目 / 博士后科学基金特别资助项目 / 基本科研业务费重点项目。 部分代表性主持科研项目列表如下： 北京市自然科学基金面上项目：2024-2026，主持（在研） 河北省自然科学基金面上项目：2025-2027，主持（在研） 基本科研业务费重点资助项目：2022-2025，主持（已结题） 国家自然科学基金面上项目：2019-2022, 主持（已结题） 北京市自然科学基金面上项目：2020-2022, 主持（已结题） 基本科研业务费自由申报项目：2019-2021, 主持（已结题） 国家自然科学基金面上项目：2015-2018, 主持（已结题） 北京市自然科学基金面上项目：2016-2018, 主持（已结题） 基本科研业务费自由申报项目：2014-2015, 主持（已结题） 基本科研业务费自由申报项目：2012-2013, 主持（已结题） 国家自然科学基金青年项目：2012-2014, 主持（已结题） 教育部博士点基金新教师类项目：2012-2014, 主持（已结题） 基本科研业务费自由申报项目：2010-2011, 主持（已结题） 中国博士后科学基金特别资助项目：2010-2011, 主持（已结题） 中国博士后科学基金面上资助项目：2009-2010, 主持（已结题） 国家自然科学基金面上项目：2010-2012, 合作单位主持（已结题） 论文/期刊 (部分代表性CCF A类国际会议论文及CCF A/B类国际期刊论文， ^  表示作者均为本人指导的研究生， * 表示本人为通讯作者) 2026: Jiacheng Li^, Songhe Feng*. Bridging Modalities via Progressive Re-alignment for Multimodal Test-Time Adaptation. AAAI, 2026. (CCF A类, Oral) Zhen Zhu^, Kai Tang, Songhe Feng*, Yixuan Tang, Haobo Wang, Gengyu Lyu, Cheng Peng, Yining Sun. Dual Graph Disambiguation for Multi-Instance Partial-Label Learning. AAAI, 2026. (CCF A类) 2025: Xudong Yan^, Songhe Feng*. TOMCAT: Test-Time Conprehensive Knowledge Accumulation for Compositional Zero-Shot Learning. NeurIPS, 2025. (CCF A类) Jintian Ji^, Songhe Feng*. Anchors Crash Tensor: Efficient and Scalable Tensorial Multi-View Subspace Clustering. IEEE Trans. on Pattern Analysis and Machine Intelligence, 47(4), pp. 2660-2675, 2025. (CCF A类) Jing Wang^, Songhe Feng*, Kristoffer KnutsenWickstrom, Michael Kampffmeyer. AdaptCMVC: Robust Adaption to Incremental Views in Continual Multi-View Clustering. CVPR, 2025. (CCF A类) Jintian Ji^, Songhe Feng*. Anchors Bring Stability and Efficiency: Tensorial Multi-View Clustering on Shuffled Datasets. ACM Multimedia, 2025. (CCF A类) Xudong Yan^, Songhe Feng*, Yang Zhang, Jian Yang, Yueguan Lin, Haojun Fei. Leveraging MLLM Embeddings and Attribute Smoothing for Compositional Zero-Shot Learning. IJCAI, 2025. (CCF A类) Tingting Wu^, Zhendong Li^, Zhibin Gu^, Jiazheng Yuan, Songhe Feng*. KOALA: Kernel Coupling and Element Imputation Induced Multi-View Clustering. AAAI, 2025. (CCF A类) Gengyu Lyu^, Bohang Sun, Xiang Deng^, Songhe Feng*. Addressing Multi-Label Learning with Partial Labels: from Sample Selection to Label Selection. AAAI, 2025. (CCF A类) Gengyu Lyu^, Zhen Yang*, Xiang Deng^, Songhe Feng*.  L-VSM: Label Driven View-Specific Fusion for Multi-View Multi-Label Classification. IEEE Trans. on Neural Networks and Learning Systems, 36(4), pp. 6569-6583, 2025. (CCF B类) Jintian Ji^, Songhe Feng*, Jie Huang, Taotao Wei, Xiang Feng, Peiwu Lv, Bing Li. Incomplete Multi-View Clustering via Efficient Anchor Tensor Recovery Framework. Neural Networks, 190(10), pp. 1-12, 2025. (CCF B类) Jintian Ji^, Songhe Feng*. Partition-Level Fusion Induced Multi-View Subspace Clustering with Tensorial Geman Rank. Neural Networks, 182(2), pp. 1-13, 2025. (CCF B类) Zhibin Gu^, Songhe Feng*. Twin Tensor Learning for Consistency and Inconsistency:  A Unified Affinity Learning Framework for Multi-View Clustering. IEEE Trans. on Multimedia, 2025. (CCF B类) 2024: Zhibin Gu^, Songhe Feng*. From Dictionary to Tensor: A Scalable Multi-View Subspace Clustering Framework with Triple Information Enhancement. NeurIPS, 2024. (CCF A类) Zhibin Gu^, Zhendong Li^, Songhe Feng*. EDISON: Enhanced Dictionary-Induced Tensorized Incomplete Multi-View Clustering with Gaussian Rank Error Minimization. ICML, 2024. (CCF A类) Zhibin Gu^, Zhendong Li^, Songhe Feng*. Topology-Driven Multi-View Clustering via Tensorial Refined Sigmoid Rank Minimization. ACM SIGKDD, 2024. (CCF A类) Jintian Ji^, Songhe Feng, Yidong Li*. Tensorized Unaligned Multi-view Clustering with Multi-scale Representation Learning. ACM SIGKDD, 2024. (CCF A类) Jing Wang^, Songhe Feng*. Contrastive and View-Interaction Structure Learning for Multi-View Clustering. IJCAI, 2024. (CCF A类) Yang Zhang^, Songhe Feng*, Jiazheng Yuan*. Continual Compositional Zero-Shot Learning. IJCAI, 2024. (CCF A类) Gengyu Lyu^, Weiqi Kang, Haobo Wang, Zheng Li, Zhen Yang*, Songhe Feng*. Common-Individual Semantic Fusion for Multi-View Multi-Label Learning. IJCAI, 2024. (CCF A类) Yanan Wu^, Zhixiang Chi+, Yang Wang, Konstantinos Plataniotis, Songhe Feng*. Test-Time Domain Adaptation By Learning Domain-Aware Batch Normalization. AAAI, 2024. (CCF A类, Oral) Tingting Wu^, Songhe Feng*, Jiazheng Yuan*. Low-rank Kernel Tensor Learning for Incomplete Multi-View Clustering. AAAI, 2024. (CCF A类) Jing Wang^, Songhe Feng*, Gengyu Lyu, Jiazheng Yuan. SURER: Structure-Adaptive Unified Graph Neural Network for Multi-View Clustering. AAAI, 2024. (CCF A类) Yanan Wu^, Songhe Feng*, Gongpei Zhao, Yi Jin. Transformer Driven Matching Selection Mechanism for Multi-label Image Classification. IEEE Trans. on Circuits and Systems for Video Technology, 34(2), pp. 924-939, 2024. (CCF B类) Zhibin Gu^, Songhe Feng*, Zhendong Li, Jiazheng Yuan*, Jun Liu. NOODLE: Joint Cross-View Discrepancy Discovery and High-Order Correlation Detection for Multi-View Subspace Clustering. ACM Trans. on Knowledge Discovery from Data, 18(6), 151:1-23, 2024. (CCF B类) 2023: Bing Li, Haina Qin, Weihua Xiong, Yangxi Li, Songhe Feng, Weiming Hu*, Steven Maybank. Ranking-based Color Constancy with Limited Training Samples. IEEE Trans. on Pattern Analysis and Machine Intelligence, 45(10), pp. 12304-12320, 2023. (CCF A类) Jintian Ji^, Songhe Feng*. Anchor Structure Regularization Induced Multi-View Subspace Clustering via Enhanced Tensor Rank Minimization. ICCV, 2023. (CCF A类) Yanan Wu^, Zhixiang Chi+, Yang Wang, Songhe Feng*. MetaGCD: Learning to Continually Learn in Generalized Category Discovery. ICCV, 2023. (CCF A类) Jintian Ji^, Songhe Feng*. High-Order Complementarity Induced Fast Multi-View Clustering with Enhanced Tensor Rank Minimization. ACM Multimedia, 2023. (CCF A类) Yang Zhang^, Songhe Feng*. Enhancing Domain-Invariant Parts for Generalized Zero-Shot Learning. ACM Multimedia, 2023. (CCF A类) Jing Wang^, Songhe Feng*, Gengyu Lyu, Zhibin Gu. Triple-Granularity Contrastive Learning for Deep Multi-View Clustering. ACM Multimedia, 2023. (CCF A类) Yanan Wu^, Tengfei Liang+, Songhe Feng*. Yi Jin, Gengyu Lyu, Haojun Fei, Yang Wang. MetaZSCIL: A Meta-Learning Approach for Generalized Zero-Shot Class Incremental Learning. AAAI, 2023. (CCF A类) Haobo Wang, Shilong Yang, Gengyu Lyu, Weiwei Liu, Tianlei Hu, Ke Chen, Songhe Feng, Gang Chen*. Deep Partial Multi-Label  Learning with Graph Disambiguation. IJCAI, 2023. (CCF A类) Yanan Wu^, Songhe Feng*, Yang Wang. Semantic-Aware Graph Matching Mechanism for Multi-Label Image Recognition. IEEE Trans. on Circuits and Systems for Video Technology, 33(11), pp. 6788-6803, 2023. (CCF B类) Xiang Deng^, Songhe Feng*, Gengyu Lyu, Tao Wang, Congyan Lang. Beyond Word Embeddings: Heterogeneous Prior Knowledge Driven Multi-Label Image Classification. IEEE Trans. on Multimedia, pp. 4013-4025, 2023. (CCF B类) Xun Lu^, Songhe Feng*, Gengyu Lyu, Yi Jin, Congyan Lang. Distance-Preserving Embedding Bipartite Graph Multi-View Learning with Application to Multi-Label Classification. ACM Trans. on Knowledge Discovery from Data, 17(2), 19:1-21, 2023. (CCF B类) Xun Lu^, Songhe Feng*.  Structure Diversity-Induced Anchor Graph Fusion for Multi-View Clustering. ACM Trans. on Knowledge Discovery from Data, 17(2), 17:1-18, 2023. (CCF B类) Zhibin Gu^, Songhe Feng*. Individuality Meets Commonality: A Unified Graph Learning Framework for Multi-View Clustering. ACM Trans. on Knowledge Discovery from Data, 17(1), 7:1-21, 2023. (CCF B类) Zhibin Gu^, Songhe Feng*, Huiting Hu, Gengyu Lyu. ONION: Joint Unsupervised Feature Selection and Robust Subspace Extraction for Graph-based Multi-View Clustering. ACM Trans. on Knowledge Discovery from Data, 17(5), 70:1-23, 2023. (CCF B类) Gengyu Lyu^, Songhe Feng*, Yi Jin, Tao Wang, Congyan Lang, Yidong Li. Prior Knowl",
  "content_length": 13224,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:28"
}