{
  "name": "Song Fang 0001",
  "homepage": "https://cs.ou.edu/~songf",
  "status": "success",
  "content": "Welcome to Song's Homepage HOME TEACHING GROUP CV Song Fang Ph.D., Associate Professor School of Computer Science University of Oklahoma 110 W. Boyd St., DEH 232, Norman, OK 73019 Phone: 405-325-3536 Email: songf at ou.edu Hiring! I am looking for self-motivated students who are interested in security & privacy issues! What's New? [Sep 2025] I am invited to serve on the TPC of ACM CCS 2026. [Aug 2025] Our work on IoT (smart camera) security has been accepted by NDSS 2026. Congratulations to Yan and Guanchong! [Aug 2025] Congratulations to Lyndsey for being selected to receive the Engineering Research Fellowship from the Gallogly College of Engineering (GCoE) for Fall 2025 ($3,000)! [Aug 2025] Our work on VR security has been accepted by RAID 2025. Congratulations to Guanchong and Yan! [July 2025] Our work on a new side-channel attack for video identification has been accepted by PETS 2026. Congratulations to Guanchong! [July 2025] I am invited to serve on the TPC of IEEE EuroS&P 2026. [April 2025] I am invited to serve on the TPCs of NDSS 2026 and MILCOM 2025 Track 3 - Cyber Security and Trusted Computing. [Feb 2025] I have joined IEEE TDSC's Editorial Board as an Associate Editor. [Feb 2025] I am invited to serve on the TPCs of RAID 2025 and IEEE CNS 2025. [Dec 2024] Yan Zhou successfully defended her MS thesis. Congratulations to Yan! [Oct 2024] I am invited to serve on the TPC of IEEE EuroS&P 2025. [Aug 2024] Our work on a new GPS-based in-vehicle message dissemination scheme is to appear in IEEE CNS 2024. [Aug 2024] Our work on defenses agaist wireless breath and crowd inference has been accepted to IEEE/ACM ToN. [July 2024] I am invited to serve on the TPC of ACM AsiaCCS 2025. [April 2024] Congratulations to Qiuye, who has been selected to receive a Gallogly College of Engineering (GCoE) Dissertation Excellence Award ($5,000)! [Mar 2024] I will be promoted to Associate Professor with Tenure in the School of Computer Science, starting from July 1, 2024. [Mar 2024] Congratulations to our lab member Qiuye, who will join University of Missouri - Kansas City as a Tenure-Track Assistant Professor in Fall 2024! [Feb 2024] Our survey paper on wireless inference against privacy has been accepted to IEEE Communications Surveys and Tutorials (COMST). [Dec 2023] I am invited to serve on the TPC of ACM CCS 2024. [Nov 2023] Our work on camera localization has been accepted to IEEE TMC. [Aug 2023] Our work on smart camera security has been accepted by ACM CCS 2023. Congratulations to Yan and Qiuye! [July 2023] Our work on wireless liveness detection has been accepted by RAID 2023. Congratulations to Qiuye! [Dec 2022] Yan He successfully defended his MS thesis. Congratulations to Yan! He will stay in our group and pursue his Ph.D. degree! [Nov 2022] Our paper \"HoneyBreath: An Ambush Tactic Against Wireless Breath Monitoring\" won EAI MobiQuitous 2022 Best Paper Award! [Oct 2022] Qiuye He and Edwin Yang both won the ACM CCS travel grant. Congratulations to both! [Sep 2022] Thanks for the support of NSF to our project \"Exploiting Stimulus-response Correlation for Wireless Hidden Device Localization\"! [Sep 2022] Edwin Yang won the IEEE CNS travel grant and the CS Alumni Graduate Fellowship. Congratulations to Edwin! [Sep 2022] Our work on proactive defenses against wireless breath inference is to appear in EAI MobiQuitous 2022. Congratulations, Qiuye and Edwin! [Aug 2022] Our work on driving-assisted key establishment is to appear in IEEE CNS 2022. Congratulations, Edwin! [April 2022] Our work on inferring numerical keystrokes is to appear in ACM CCS 2022. Congratulations, Edwin and Qiuye! [April 2022] I received the Faculty Investment Program award from the Office of the Vice President for Research and Partnerships (OVPRP) at OU. Thanks to OU OVPRP for the support! More News >>> [Jan 2022] Our work on keystroke eavesdropping attack and defense has been accepted to IEEE/ACM ToN. [Jan 2022] Our work on a proactive anti-eavesdropping scheme has been accepted to IEEE TDSC. [Aug 2021] Our work on a new attack against ASR systems is to appear in ACSAC 2021. Congratulations, John and Edwin! [June 2021] I receive an REU supplement for the NSF CRII project. Thanks to NSF for the support! [May 2021] Our work on pinpointing wireless hidden cameras is to appear in ACM MobiSys 2021. Congratulations, Yan and Qiuye! [April 2021] I am invited to serve on the TPCs of IEEE CNS 2021 and IEEE INFOCOM 2022. [Mar 2021] I received the FY 21 Junior Faculty Fellowship Program award from the Office of the Vice President for Research and Partnerships (OVPRP) at OU. Thanks to OU OVPRP for the support! [Sep 2020] Our work on virtual step PIN pad is to appear in IEEE MASS 2020. [Jun 2020] I am invited to serve on the TPC of IEEE INFOCOM 2021. [Mar 2020] My CRII proposal is funded by NSF. Thanks to NSF for the support! [Mar 2020] I received the FY20 Junior Faculty Fellowship Program award from the Office of the Vice President for Research and Partnerships (OVPRP) at OU. Thanks to OU OVPRP for the support! [Oct 2019] I am invited to serve on the TPC of IEEE CNS 2020. [Aug 2019] Our work on wireless-assisted key establishment has been accepted to IEEE TMC. [Nov 2018] Our work on eavesdropper entrapment is to appear in IEEE INFOCOM 2019. [July 2018] Our work on training-agnostic keystroke inference is to appear in ACM CCS 2018. Short Bio Dr. Song Fang is an Associate Professor in the School of Computer Science, University of Oklahoma. He received his Ph.D. in Computer Science from the University of South Florida under the supervision of Dr. Yao Liu in July 2018. He received his B.Eng. from the South China University of Technology and M.Eng. from the Beijing University of Posts and Telecommunications. Research Interests Wireless and Mobile System Security Cyber Physical Systems and IoT Security Mobile Computing Application of Machine Learning in Cybersecurity Selected Papers The asterisk (*) marks students advised by me. PhantomMotion: Laser-Based Motion Injection Attacks on Wireless Security Surveillance Systems Yan He*, Guanchong Huang*, and Song Fang The Network and Distributed System Security Symposium (NDSS 2026), pp. 1-18, 2026. (Acceptance Rate: 17.49%=113/646) SilhouetteTell: Practical Video Identification Leveraging Blurred Recordings of Video Subtitles (pdf, BibTex) Guanchong Huang* and Song Fang The 26th Privacy Enhancing Technologies Symposium (PETS 2026), pp. 1-16, 2026. (Acceptance Rate: 23.56%=53/225) MotionDecipher: General Video-assisted Passcode Inference In Virtual Reality (pdf, BibTex) Guanchong Huang*, Yan He*, Shangqing Zhao, Yi Wu, and Song Fang The 28th International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2025), pp. 298-313, 2025. (Acceptance Rate: 22.06%=62/281) CommanderGPS: Practical Hidden Command Dissemination Through Pedal Operations (pdf, BibTex) Edwin Yang*, Guanchong Huang*, and Song Fang IEEE Conference on Communications and Network Security (IEEE CNS 2024), 2024. (Acceptance Rate: 29.4%=35/119) Revisiting Wireless Breath and Crowd Inference Attacks with Defensive Deception Qiuye He*, Edwin Yang*, Song Fang, and Shangqing Zhao IEEE/ACM Transactions on Networking (ToN), vol. 32, no. 6, pp. 4976-4988, Dec. 2024. A Survey on Human Profile Information Inference via Wireless Signals (pdf, BibTex) Qiuye He*, Edwin Yang*, and Song Fang IEEE Communications Surveys and Tutorials (COMST), vol. 26, no. 4, pp. 2577-2610, Fourthquarter 2024. Precise Wireless Camera Localization Leveraging Traffic-aided Spatial Analysis Yan He*, Qiuye He*, Song Fang, and Yao Liu IEEE Transactions on Mobile Computing (TMC), vol. 23, no. 6, pp. 7256-7269, June 2024. When Free Tier Becomes Free to Enter: A Non-Intrusive Way to Identify Security Cameras with no Cloud Subscription Yan He*, Qiuye He*, Song Fang, and Yao Liu (The first two authors are co-primary authors) ACM Conference on Computer and Communications Security (ACM CCS 2023), Nov. 2023. (Acceptance Rate: 19.1%=234/1222) Phantom-CSI Attacks against Wireless Liveness Detection Qiuye He* and Song Fang The 26th International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2023), Oct. 2023. (Acceptance Rate: 23.5%=50/213) A Data-Driven Respirator Fit Test Model via Human Speech Signal Jinmiao Chen, Zhaohe (John) Zhang*, Shangqing Zhao, Song Fang, Thomas M. Peters, Evan L. Floyd, and Changjie Cai IEEE/ACM international conference on Connected Health: Applications, Systems and Engineering Technologies (CHASE), Jun. 2023. Proactive Anti-Eavesdropping With Trap Deployment in Wireless Networks (pdf, BibTex) Qiuye He*, Song Fang, Tao Wang, Yao Liu, Shangqing Zhao, and Zhuo Lu IEEE Transactions on Dependable and Secure Computing (TDSC), vol. 20, no. 1, pp. 637-649, 1 Jan.-Feb. 2023. HoneyBreath: An Ambush Tactic Against Wireless Breath Monitoring Qiuye He*, Edwin Yang*, Song Fang, and Shangqing Zhao EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (EAI MobiQuitous 2022), 2022. (*Best Paper Award*) DASK: Driving-Assisted Secret Key Establishment (pdf, BibTex) Edwin Yang*, Song Fang, and Dakun Shen IEEE Conference on Communications and Network Security (IEEE CNS 2022), Oct. 2022. WINK: Wireless Inference of Numerical Keystrokes via Zero-Training Spatiotemporal Analysis (pdf, version with appendices, BibTex) Edwin Yang*, Qiuye He*, and Song Fang ACM Conference on Computer and Communications Security (ACM CCS 2022), Nov. 2022. (Acceptance Rate: 17.9%=58/324) GPSKey: GPS based Secret Key Establishment for Intra-Vehicle Environment (pdf) Edwin Yang* and Song Fang Fourth International Workshop on Automotive and Autonomous Vehicle Security (AutoSec), co-located at NDSS 22, 2022. Wireless Training-free Keystroke Inference Attack and Defense (BibTex) Edwin Yang*, Song Fang, Ian Markwood, Yao Liu, Shangqing Zhao, Zhuo Lu, and Haojin Zhu IEEE/ACM Transactions on Networking (ToN), vol. 30, no. 4, pp. 1733-1748, Aug. 2022. CommanderG",
  "content_length": 14635,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:26"
}