{
  "name": "Songtao Lu",
  "homepage": "https://songtaogithub.github.io",
  "status": "success",
  "content": "Songtao Lu Songtao Lu Home Short Bio Research Publications Group Members Awards Projects Mentorship Services Songtao Lu Assistant Professor Department of Computer Science and Engineering The Chinese University of Hong Kong Sha Tin, New Territories, Hong Kong stlu@cse.cuhk.edu.hk My research interests broadly lie in: Theoretical foundations of machine learning (ML) models Design and computational complexity analysis of optimization algorithms Application of ML models and algorithms in natural language processing, reinforcement learning, and multi-agent systems Recruitment I am currently recruiting self-motivated PhD students (starting in 2026) and postdoctoral scholars who are interested in machine learning, optimization, or related areas. If you are interested in joining my research group, please send me an email at songtaocuhk[@]gmail.com with your CV. Recent news 08/01/2025 Excited to have Pei and Zihao join my research group as PhD students. Welcome to both! May 2025 I'm truly honored to receive a research grant from the Shun Hing Institute of Advanced Engineering (SHIAE) to support my project on optimizing inference-time reasoning in large language models. Many thanks to SHIAE for their generous support! May 2025 I'm very pleased to receive The Chinese University of Hong Kong Direct Grant to support my research on bilevel models and methods for post-training. Sincere thanks to CUHK for their kind support. 12/14/2024 I am delighted to serve as an Area Chair for ICML 2025. 12/13-15/2024 Traveling to NeurIPS. Open to talk! 11/08/2024 Two proposals are funded under the RPI-IBM AI research collaboration program. 09/25/2024 Our work on a unified single-loop primal-dual framework for decentralized bilevel optimization is accepted by NeurIPS 2024. 09/18/2024 I am honored to be selected for Stanford University's 2024 World's Top 2% Scientists List. 09/12/2024 Our paper on graph neural networks with adaptive structures has been accepted by IEEE Journal of Selected Topics in Signal Processing. 08/27/2024 Our paper titled \"A stochastic linearized augmented Lagrangian method for decentralized bilevel optimization\" has been selected as an Honorable Mention in the IBM Pat Goldberg Memorial competition for best papers! 07/25/2024 Our research on in-context learning has been featured in IBM Research. Read more IBM and RPI researchers demystify in-context learning in large language models. 07/19/2024 I will serve as a Session Chair (Multiagent Optimization and Games) for ICCOPT 2025. 07/18/2024 I am currently serving as a Program Chair for NeurIPS 2024 Workshop on Federated Foundation Models. 05/16/2024 I will serve as an Area Chair for AAAI 2025. 05/01/2024 Five papers are accpeted by ICML 2024. 04/03/2024 Our work on toward Byzantine-robust decentralized federated learning is accepted by ACM CCS 2024. 03/27/2024 I will serve as an Area Chair for NeurIPS 2024. 01/16/2024 Our work on min-max optimization for policy evaluation with nonlinear function approximation is selected as a spotlight presentation by ICLR 2024. 12/13/2023 I am thrilled to have received an IBM Research Accomplishment Award for my contributions to advancing optimization techniques for next-generation distributed intelligence. 12/13/2023 Four papers were accepted by ICASSP 2024. 11/02/2023 It is my great pleasure to have received an IBM Plateau Invention Achievement Award. 08/21/2023 I have been elevated as an IEEE Senior Member. 07/03/2023 I am truly honored to receive an IBM Entrepreneur Award. 12/02/2022 Our work on conditional moment alignment for improved generalization in federated learning received the FL-NeurIPS Outstanding Paper Award! 07/29/2022 Our work on distributed adversarial training to robustify deep neural networks at scale received the UAI 2022 Best Paper Runner-Up Award! Recent Representative Works TSP: A Two-Sided Smoothed Primal-Dual Method for Nonconvex Bilevel Optimization Songtao Lu ICML, 2025. SLM: A Smoothed First-Order Lagrangian Method for Structured Constrained Nonconvex Optimization Songtao Lu NeurIPS, 2023. Bilevel Optimization with Coupled Decision-Dependent Distributions Songtao Lu ICML, 2023. A Stochastic Linearized Augmented Lagrangian Method for Decentralized Bilevel Optimization Songtao Lu, Siliang Zeng, Xiaodong Cui, Mark S. Squillante, Lior Horesh, Brian Kingsbury, Jia Liu, Mingyi Hong NeurIPS, 2022. A Single-Loop Gradient Descent and Perturbed Ascent Algorithm for Nonconvex Functional Constrained Optimization Songtao Lu ICML, 2022. Decentralized Policy Gradient Descent Ascent for Safe Multi-Agent Reinforcement Learning Songtao Lu, Kaiqing Zhang, Tianyi Chen, Tamer Basar, and Lior Horesh AAAI, 2021. Linearized ADMM Converges to Second-Order Stationary Points for Non-Convex Problems Songtao Lu, Jason Lee, Meisam Razaviyayn, Mingyi Hong IEEE Transactions on Signal Processing, 2021. Finding Second-Order Stationary Points Efficiently in Smooth Nonconvex Linearly Constrained Optimization Problems Songtao Lu, Meisam Razaviyayn, Bo Yang, Kejun Huang, Mingyi Hong NeurIPS, 2020. Hybrid Block Successive Approximation for One-Sided Non-Convex Min-Max Problems: Algorithms and Applications Songtao Lu, Ioannis Tsaknakis, Mingyi Hong, Yongxin Chen IEEE Transactions on Signal Processing, 2020. PA-GD: On the Convergence of Perturbed Alternating Gradient Descent to Second-Order Stationary Points for Structured Nonconvex Optimization Songtao Lu, Mingyi Hong, Zhengdao Wang ICML, 2019.",
  "content_length": 5461,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:29"
}