{
  "name": "Song Chong",
  "homepage": "https://sites.google.com/a/kaist.edu/song-chong",
  "status": "success",
  "content": "Song Chong Lab @ KAISTSearch this siteEmbedded FilesSkip to main contentSkip to navigationSong Chong, Ph.D.ICT Endowed Chair ProfessorHead,  Kim Jaechul Graduate School of AIDirector,  AI InstitutesDirector,  Edge AI Research CenterAdjunct Professor, School of Electrical Engineering and College of BusinessKorea Advanced Institute of Science and Technology (KAIST)Adjunct Professor, New York UniversityEmail: songchong (at) kaist (dot) eduOffice: Room 601Address: Kim Jaechul Graduate School of AI, KAIST, 108 Taebong-ro, Seocho-gu, Seoul 06764, Republic of KoreaPhone: +82-2-958-0751Google ScholarSong Chong is the ICT Endowed Chair Professor and Head of the Kim Jaechul Graduate School of Artificial Intelligence, the Adjunct Professor of the School of Electrical Engineering and the College of Business, all at Korea Advanced Institute of Science and Technology (KAIST), and he is also the Adjunct Professor of New York University. He is the Director of KAIST AI Institutes, the Founding Director of KAIST Edge AI Research Center and was the Founding Director of KAIST 5G Mobile Network Research Center. He is a Member of the Presidential Committee on National AI Strategy of Korea. Prior to joining KAIST, he was with AT&T Bell Laboratories, Holmdel, New Jersey, USA, as the Member of Technical Staff. His current research interests lie in decision making under uncertainty, human behavior modelling, mathematical optimization and machine learning with applications to artificial intelligence, data networks and mobile computing. He has served on the editorial boards of IEEE/ACM Transactions on Networking, IEEE Transactions on Mobile Computing, IEEE Transactions on Wireless Communications and Computer Communications, and the Program Committee of a number of top-tier international conferences including IEEE INFOCOM, ACM MobiCom, ACM CoNEXT, ACM MobiHoc, IEEE ICNP and ITC. He is the Steering Committee Chair of WiOpt, serves on the IEEE Alexander Graham Bell Medal Committee, and was the General Chair of ACM MobiHoc 2022 and WiOpt 2009, and the Program Committee Chair of IEEE WCNC 2020 and IEEE SECON 2015. He received the 2013 and 2016 IEEE William R. Bennett Prize Paper Awards, given to the best original paper published in IEEE/ACM Transactions on Networking in the previous three calendar years, the 2021 ACM MobiSys Best Paper Award, the 2013 IEEE SECON Best Paper Award, the 2016 KAIST Grand Prize Technology Innovation Award, and the 2016 Haedong Grand Prize Research Award, given to the Korean scholar who has made the most significant contribution to the advancement of communications research over the last 10 years. His research group at KAIST has won 3 gold, 6 silver and 4 bronze prizes at the Samsung Electronics HumanTech paper competitions. He received the B.S. and M.S. degrees from Seoul National University and the Ph.D. degree from the University of Texas at Austin, all in electrical and computer engineering.Report abusePage detailsPage updated Report abuse",
  "content_length": 2992,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:25"
}