{
  "name": "Song Chun Zhu",
  "homepage": "http://www.stat.ucla.edu/~sczhu",
  "status": "success",
  "content": "Song-Chun Zhu's homepage Home Biography Research Publications Invited Talks Collaborators Teaching Blogs hi-res image* Song-Chun Zhu Professor, jointly Statistics and Computer Science Research Areas: Computer Vision, Statistical Modeling & Computing, Cognition, Machine Learning,Natural Language and Dialogue, AI, Robot Autonomy. Director of: Center for Vision, Cognition, Learning and Autonomy VCLA@UCLA (No new students will be admitted) Textbooks: to build a framework Adrian Barbu and Song-Chun Zhu, Monte Carlo Methods, Springer, 2020. [Amazon Link] Song-Chun Zhu and Yingnian Wu, Computer Vision: Statistical Models for Marr's Paradigm, Springer, 2021 [Book_1_Marr][Book_1_Coverpage] Song-Chun Zhu and Siyuan Huang, Computer Vision: Stochastic Grammars for Parsing Objects, Scenes, and Events, Springer, 2021 [Book_2_Parsing][Book_2_Coverpage] Song-Chun Zhu and Yixin Zhu, Cognitive Models for Visual Commonsense Reasoning, Springer, 2021 [Book_3_FPICV][Book_3_Coverpage] Links to some Conferences / Workshops / Summer Schools that I was involved: IEEE Conf. on Computer Vision and Pattern Recognition, Long Beach, Los Angeles, CVPR 2019. Int'l Workshops on Vision Meet Cognition: Function, Physics, Intent and Causality .... FPIC workshop with cvpr2014 .... FPIC workshop with cvpr 2015 .... Workshop with CogSci 2015 ...FPIC workshop with cvpr 2017 Int'l Workshop on Language and Vision CVPR 2015. Int'l Mathematics Forum at Sanya, 2013 IEEE Conf. on Computer Vision and Pattern Recognition, Providence, Rhode Island, CVPR 2012 Int'l Workshop on Stochastic Image Grammar (SIG): .... SIG workshop, with cvpr 2009 .... SIG workshop with iccv 2011 ... SIG tutorial with cvpr 2012 Summer Schools on Vision and Learning in China: .... Lotus Hill 2005 .....Lotus Hill 2006 .... Lotus Hill 2008 .... Xi'an 2010 ,... Beijing 2012 Symposium on Vision/Neural/Cognitive Science in Honor of David Mumford 2007, and 2017. 6th Int'l Conference on EMMCVPR, 2007 Int'l Workshops on Statistical and Computational Theories of Vision (SCTV): .... 1st SCTV, Fort Collins 1999, .... 2nd SCTV, Vancouver 2001 .... 3rd SCTV, Nice, France, 2003 *The\tphoto\twas taken by photographer Reed Hutchinson, with oil style rendering by our software. A hi-res picture reveals the brush strokes. Top ^ © S.-C. Zhu Website template by Arcsin",
  "content_length": 2313,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:26"
}