{
  "name": "Sonia Fahmy",
  "homepage": "https://www.cs.purdue.edu/homes/fahmy",
  "status": "success",
  "content": "Sonia Fahmy Sonia Fahmy I am a professor in the Department of Computer Science at Purdue University. I am also a member of CERIAS (the Center for Education and Research in Information Assurance and Security). My research interests lie in the areas of network architectures and network protocols, specifically in designing network protocols to increase performance and security. Click here for a two-page resume (PDF), and click here for a biography. Address 305 N. University St., Purdue University, West Lafayette, IN 47907-2107, USA Office LWSN 2142H E-mail last name @purdue.edu Research Current and recent research projects include: (1) Network support for virtual reality applications: We are designing networking and systems techniques to support distributed virtual reality applications (NSF project; Meta project); (2) Network measurement and management: We are inferring and learning information about network traffic, topology, bottlenecks, bandwidth, latency, and loss, and exploiting this information for adapting and managing networks and applications (Juniper Networks project); (3) Cellular networks: We are designing approaches to optimize cellular network control plane performance and security (Phase 1; Phase 2); (4) Network experimentation: We are developing methodologies and benchmarks for network evaluation (NSF project). Our research projects are or have been funded by the National Science Foundation, the Department of Homeland Security, AT&T, Cisco Systems, GENI Project, Hewlett-Packard, Juniper Networks, Meta, Northrop Grumman Corp, Sandia National Labs, Schlumberger, CERIAS, and the Purdue Research Foundation. Publications and Talks Software and Datasets: Testbed mapping | NFV-VITAL and ENVI | Contain-ed | Routing tool suite | EMIST tool suite (for DETER/Emulab) | iHEED (for TinyOS) | FlowMate (for Linux) | Active queue management (for ns-2) Current Students: Umakant Kulkarni, Yufeng Chen, Akhil Prasad PhD Alumni: Danushka Menikkumbura (Microsoft; co-advisor: P. Eugster), Amit Sheoran (AT&T Labs), Lianjie Cao (Hewlett-Packard Labs), S. M. Iftekharul Alam (Intel Labs; co-advisor: Y.-C. Hu), Sriharsha Gangam (Comcast), Debbie Perouli (Marquette; co-advisor: O. Maennel), Wei-Min Yao (CTBC), Ethan Blanton (University at Buffalo), Ravish Khosla (Google; co-advisor: Y.-C. Hu), Roman Chertov (Arista; co-advisor: N. Shroff), Yan Wu (Rippling; co-advisor: N. Shroff), Ossama Younis, Minseok Kwon (RIT) Other Past Research Assistants: Mijanur Palash, Navin Modi, Raghuvir Songhela, Xiangyu Bu, Jiahong Zhu, Jackie Soenneker, David Bettis, Pankaj Kumar, Mohamed R. Fouad, Rupak Sanjel, Srinivas R. Avasarala, Venkatesh Prabhakar, Tapan Karwa Useful Links Teaching CS 422 (Fall 2022) Professional Service Steering committee member, IEEE International Conference on Network Protocols (ICNP), 2008-present Technical Program Committee Member: + 2024-2026: SIGMETRICS 2026, CoNEXT 2026, ICNP 2025 (ATPC chair), MOBICOM 2025, SIGMETRICS 2025, INFOCOM 2025, ZT-FutureG 2025, FutureG 2025, SIGMETRICS 2024, ICNP 2024 (ATPC chair), INFOCOM 2024 (ATPC chair), Secure-FutureG 2024 + 2020-2023: SIGMETRICS 2023, MOBICOM 2023, CoNEXT 2023, ITC 35, ICNP 2023 (ATPC chair), INFOCOM 2023 (ATPC chair), SOSR 2022, ICNP 2022 (ATPC chair), MOBICOM 2022, IFIP Networking 2022, INFOCOM 2022 (ATPC chair), INFOCOM 2021 (ATPC chair), ICNP 2021 (ATPC chair), MOBICOM 2021, CSET 2021, SOSR 2021, ANCS 2021, CoNEXT posters 2021, SOSR 2020, ICNP 2020 (ATPC chair), CSET 2020 + 2015-2019: INFOCOM 2019 (ATPC chair), ICNP 2019 (ATPC chair), INFOCOM 2018 (ATPC chair), ICNP 2018 (ATPC chair), INFOCOM 2017 (ATPC chair), SOSR 2017, CNERT 2017, ICNP 2017 (ATPC chair), CSET 2017, MOBICOM 2016, INFOCOM 2016 (ATPC chair), ICNP 2016 (ATPC chair), CoNEXT 2015, CSET 2015 + 2010-2014: INFOCOM 2014 (ATPC chair), INFOCOM 2013 (ATPC chair), SIGCOMM 2013, CSET 2013, INFOCOM 2012 (ATPC chair), ICNP 2012 (ATPC chair), CoNEXT 2012, ICCCN NACSD 2012, INFOCOM 2011 (ATPC chair), ICNP 2011 (ATPC chair), CSET 2011, SIGMETRICS 2010, INFOCOM 2010 + 2007-2009: INFOCOM 2009, ICDCS 2009, COMSNETS 2009, IWQoS 2009, ICNP 2009, CSET 2009, INFOCOM 2008, ICDCS 2007, WWIC 2007, Global Internet Symposium 2007, IWQoS 2007, NSTools 2007, ICNP 2007, LSAD 2007, DETER 2007 + 2005-2006: ICNP 2006, VoIP Security workshop 2006, INFOCOM 2006, IWQoS 2006, ICCCN 2006, WNS2 2006, MonAM 2006, NPSec 2006, Q2SWinet 2006, ICPADS 2006, WoWMoM 2006, COMPSAC 2006, ICENCO 2006, ICNP 2005, IWQoS 2005, INFOCOM 2005, SenMetrics 2005, Networking 2005, ICDCS 2005, WWIC 2005, WSNIA 2005 + 2000-2004: IWQoS 2004, INFOCOM 2004, ICDCS 2004, BroadNets 2004, ASWN 2004, HiPC 2004, ICENCO 2004, INFOCOM 2003, ICPP 2003, WLN 2002, PWC 2002, EESD 2002, INFOCOM 2001, ICNP 2001, ICC 2000, ICDCS 2000, and GLOBECOM 2000 Associate Editor, IEEE Transactions on Mobile Computing, 2016-2019; Associate Editor, IEEE/ACM Transactions on Networking, 2011-2015; Associate Editor, IEEE Transactions on Computers, 2007-2011 Steering committee chair, Workshop on Secure Network Protocols (NPSec), 2005-2015 Technical Program Committee Co-chair, INFOCOM 2015; Technical Program Committee Co-chair, International Conference on Future Internet Technologies (CFI) 2016 Technical Program Committee Co-chair, 18th IEEE International Conference on Network Protocols (ICNP) 2010 [Call for papers text] [Call for papers PDF] General Co-chair, 16th IEEE International Conference on Network Protocols (ICNP) 2008 Vice-chair, Technical Committee on Computer Communications (TCCC), 2008-2010 Editor, Computer Communications, 2004-2010; Editor, Journal of High Speed Networks, 2005-2006 Technical Program Committee Co-chair, USENIX CSET 2008; Technical Program Committee Co-Chair, BroadNets, Internet Technologies Symposium, 2007; Technical Program Committee Co-Chair, WWIC 2006 General Co-chair, LANMAN 2022; Technical Program Committee Co-chair, LANMAN 2021 General Chair, First Workshop on Secure Network Protocols (NPSec) 2005: Held in conjunction with IEEE ICNP Workshops Co-Chair, CoNEXT 2024; Tutorials Co-Chair, SIGCOMM 2014; Posters Chair, IEEE ICNP 2006; Panels Chair, IEEE IPCCC 2004; Tutorials Chair, IEEE Hot Interconnects 2002 Organizer, Central Indiana Celebration of Women in Computing 2004 Conference Co-Chair, First SPIE International Conference on Scalability and Traffic Control in IP Networks 2001 Last updated by: Sonia Fahmy July 2025",
  "content_length": 6389,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:31"
}