{
  "name": "Sonia Chernova",
  "homepage": "http://www.cc.gatech.edu/~chernova",
  "status": "success",
  "content": "Sonia Chernova Sonia Chernova Associate Professor School of Interactive Computing Email: chernova@cc.gatech.edu Phone: (404) 385-4753 Lab: rail.gatech.edu Bio I am an Associate Professor in the School of Interactive Computing at Georgia Tech. I direct the Robot Autonomy and Interactive Learning (RAIL) lab, where we work on developing robots that are able to effectively operate in human environments. My research interests span robotics and artificial intelligence, including semantic reasoning, adaptive autonomy, human-robot interaction and explainable AI. Please visit the RAIL lab website for a description of our latest projects. I also serve as the lead for the NSF AI Institute for Collaborative Assistance and Responsive Interaction for Networked Groups (AI-CARING), whose mission is to develop the next generation of personalized collaborative AI systems that improve the quality of life and independence of aging adults living at home. I am General Co-Chair for CoRL 2023, together with Byron Boots! Come join us in Atlanta!! Teaching I teach: CS 3630: Introduction to Robotics and Perception CS 7633 Human-Robot Interaction CS/ECE/ME/AE/BME 7785 Introduction to Robotics Research. Selected Honors 2021 Best Paper Award in Technical Advances in HRI at IEEE/ACM International Conference on Human-Robot Interaction (HRI) for Das, Banerjee & Chernova, “Explainable AI for Robot Failures: Generating Explanations that Improve User Assistance in Fault Recovery” 2020 Best Paper finalist in Service Robotics finalist at IEEE Conference on Robotics and Automation (ICRA) for Kent & Chernova, “Human-Centric Active Perception for Autonomous Observation” 2019 Best Paper finalist in Service Robotics finalist at IEEE Conference on Robotics and Automation (ICRA) for Erickson et al, “Classification of Household Materials via Spectroscopy” 2019 1st place, ICRA FetchIt! Mobile Manipulation Challenge 2018 National Academy of Engineering, Frontiers of Engineering Top 100 Researcher 2016 NASA Early Career Faculty Award 2015 Sigma Xi Junior Faculty Researcher, WPI 2015 Trustees' Award for Outstanding Academic Advising, WPI 2014 Office of Naval Research Young Investigator Award 2012 NSF CAREER Award © 2015 Sonia Chernova. All rights reserved.",
  "content_length": 2246,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:34"
}