{
  "name": "Sonia Chiasson",
  "homepage": "https://carleton.ca/scs/people/sonia-chiasson",
  "status": "success",
  "content": "Sonia Chiasson - School of Computer Science Skip to Main Content Home / PeopleSonia ChiassonProfessor & HCI Program Co-Director Sonia ChiassonProfessor & HCI Program Co-DirectorDegrees:PhD Carleton University (2009), MSc University of Saskatchewan (2004), BCS University of New Brunswick (1999)Phone:613-520-2600 x 1656Email:chiasson@scs.carleton.caOffice:HP5125aWebsite:Carleton's Human Oriented Research in Usable Security Lab (CHORUS)Research Interests Usable security, human-computer interaction, computer security, educational games Specific Research Interests Usable security and privacy for children, user authentication, usable security for mobile devices, improving mental models of security, visualizations of computer security, persuasive games to improve security behaviour of end-users, phishing and trust of web interfaces, collaborative security code reviews Current Research Dr. Chiasson’s research in usable security seeks to design computer security system that better fit into people’s daily lives. It combines human-computer interaction (HCI) and computer security  to design security applications and to explore how underlying system and interaction design choices can lead to more secure systems. It uses both quantitative and qualitative research methods. Dr. Chiasson’s uses her research to help software developers improve security measures in software development,  improve the usability of security systems to reduce risk of compromises, improve user authentication, and create games and educational material to teach users, particularly children, how to be safe online and how to think critically about privacy and security. Biography Dr. Chiasson is the Canada Research Chair in Human Oriented Computer Security. She is the Deputy Scientific Director of SERENE-RISC, a cybersecurity Network of Centers of Excellence of Canada funded under the Knowledge Mobilization program. She was previously the project leader for Human Behaviour and Computer Security with ISSNet, NSERC’s Internetworked Security Systems Network. Dr. Chiasson received her master’s from the University of Saskatchewan and then joined the university’s Department of Computer Science as a full time instructor. She then came to Carleton University where she received her Ph.D. and subsequently became a faculty member at Carleton’s School of Computer Science in 2011. Research Group Carleton’s Human Oriented Research in Usable Security (CHORUS) lab Share: Twitter, Facebook Short URL: https://carleton.ca/scs/?p=634 Close the search modal Search Search Search Magnifying glass",
  "content_length": 2574,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:31"
}