{
  "name": "Sonya H. Y. Hsu",
  "homepage": "https://people.cmix.louisiana.edu/hsu",
  "status": "success",
  "content": "Profile - Sonya H. Y. Hsu | people.cmix.louisiana.edu Skip to main content Image Dr. Sonya H. Y. Hsu Dr. Sonya Hsu is a dynamic and experienced scientist with a proven academic track record as an associate professor in the School of Computing and Informatics at the University of Louisiana Lafayette. Possesses strong administrative, negotiation, and logistics management skills, complemented by expertise in analytics, machine learning, S/4HANA, and ERP configuration. Her research focuses on health/business informatics, quantitative methods, and IT operational excellence in healthcare and business. Her quality publications are in the Journal of Business Research, Information & Management, and HICSS conferences. She was a recognized Fulbright Specialist working on an IoMT project in ERs in Malaysia and was awarded a Fulbright scholarship in Romania. Sonyahsu@louisiana.edu Biography 1. Quantitative research projects: In earlier projects in my career, the quantitative analyses were mainly in Structure Equation Modeling (SEM), partial least square (PLS), and multivariate data analysis, i.e., canonical analysis. Nowadays, machine learning is the trend. Therefore, recent collaborations with Ph.D. students set the tone for data analytics. Various research projects focused my research on patient care/management and information technology/system.VS Tida, S Hsu, X Hei (2024). A Unified Training Process for Fake News Detection Based on Finetuned Bidirectional Encoder Representation from Transformers Model, Big Data 12 (4), 331‐342.Vijay Tida, Sharon Hei, Sonya Hsu (2023). Privacy-Preserving Deep Learning Model for Covid-19 Disease Detection. Hawaii International Conference on System Sciences 56, 2023.Vijay Tida, Sharon Hei, Sonya Hsu (2023). Kernel-Segregated Transpose Convolution Operation. Hawaii International Conference on System Sciences 56, 2023.Rodrigue Rizk, Dominik Rizk, Fredric Rizk and Sonya Hsu (2023). 280 Characters to the White House: Predicting 2020 US Presidential Elections from Twitter Data, Computational and Mathematical Organization Theory, 29 (4), 542-569.Vijay Tida, Sonya Hsu (2022). Universal Spam Detection using Transfer Learning of BERT Model, Hawaii International Conference on System Sciences‐55, 2022.Udaysree Buchupalli, Ayokomi Lasisi, Sonya Hsu (2019). Exploration of CMS Open Payment Data -- Learning Techniques for Anomaly Detection of Relationships. Poster Presentation at the 6th Women in Cybersecurity; Pittsburg.Sonya HY Hsu, Songpol Kulviwat (2006). An Integrative Framework of Technology Acceptance Model and Personalization in Mobile Commerce. International Journal of Technology Marketing, 1 (4): 393 – 410.Sonya Hsu, Steven J. Dick, and Walter McDowell. (2008) \"Closing the Knowledge Gap in Financial Media Management.\" Association for Education in Journalism and Mass Communication (AEJMC) National Conference, Chicago, IL.Sonya Hsu, Siva K. Balasubramanian (2003). Telecommunication Infrastructure Investments and Firm Performance. Proceedings of the 36 Annual Hawaii International Conference on System Sciences.2. Information sharing and information security: Research regarding operational excellence was the primary focus. With a high-quality Enterprise Resources Planning (ERP) certification, I have been working on information technology, information systems, and information-sharing research projects. Recent publications have switched gears to data security, both information sharing and processing in innovative or disruptive technology protocols. These research projects are process focused and looking for innovative changes in better workflow management of any operations. Clement Okolo, Sonya Hsu (2025). Customer Segregation and Loyalty: A Hybrid Approach Using LRMF and ANN Methods. 35th Annual Production and Operational Management Society, Atlanta, GA.Sonya Hsu, Ayokomi Lasisi, Marym Beisafar (2020). Supply Chain Finance with Blockchain Technology, International Forum on Knowledge Assets Dynamics, Matera, Italy.Ayokomi Lasisi, Sonya Hsu (2019). Consensus Mechanism in Enterprise Blockchain in Proceeding of the of IEEE Intelligence and Security Informatics. Shenzhen, China.Sonya H.Y. Hsu, Steven Dick (2017). Information Sharing & Cyber Threats. Proceeding of IEEE Intelligence and Security Informatics. Beijing, China.Karen Burstein, Graig J Forsyth, Raymond Biggar, Sonya Hsu, Steven Dick, Paula Zeanah (2016). A Theoretical Model for preparing incarcerated youth for careers in an increasingly technological world: Computational logic as a vehicle for improving human decision-making skills. Journal of Criminal Justice Education: 411-427.Stephen Shih, Sonya Hsu, Zhiwei Zhu, and Siva K. Balasubramanian (2012). Beyond information sharing- knowledge is the key to the downstream supply chain: a case study. Information and Management, 49(2): 70-80.3. Application development in patient care processes: The below list of publications focused on the applied architecture based on qualitative research in patient care. The process of information flow and processing to demonstrate a useful architecture of an application. The application development is patient-centric and evidence-based. Data collection was conducted by observations of processes, in-depth interviews with various stakeholders, and focus groups with semi-structured questions. The behaviors of patients and the responsibilities of stakeholders were crucial to the research.Dominick Rizk, Rodrigue Rizk, and Sonya Hsu (2019).  Applied Layered-Security Model to IoMT in Proceeding of the IEEE Intelligence and Security Informatics. Shenzhen, China.Sonya H.Y. Hsu, Steven Dick (2018). A Workaround of EHR – A Logistics/Reporting System Development. Proceedings of the 51 Annual Hawaii International Conference on System Sciences. IEEE Publisher.Sonya H.Y. Hsu, Raju Gottumukkala, Ryan G. Benton (2015). Real-Time Flu Monitoring System and Decision Informatics. Proceedings of the 48 Annual Hawaii International Conference on System Sciences. IEEE Publisher.4. Patient care management: Focused on patient care workflow and how to implement patient care more effectively and efficiently. The research projects were conducted with healthcare professionals, C-level management, and information technology officers who improved patient care with evidence-based practices. In early 2010, the Obama care era, electronic health records (EHR), or any form of digital information sharing among stakeholders and patients were the driving forces of quality care and performance and revenue management, i.e., pay for performance program. Sonya H.Y. Hsu (2013). A Web Portal for Bariatric Patients – Effective Relationships Management. Proceedings of the 46 Annual Hawaii International Conference on System Sciences. IEEE Publisher.Sonya H.Y. Hsu (2013). A Root-Cause of Healthcare Reform – Behavioral Risk Factor Surveillance System.  Proceedings of the International Conference on Medical Innovation and Computing Service (MICS).Santiago Ontanon, Sonya Hsu, Yi-Ching Lee (2013) Behavior Model Extraction and Visualization from Health Care Data.  NSF Center of Visualization and Decision Informatics IAB meeting presentation, Lafayette, Louisiana, November 4-6.Ramendra Thakur, Sonya H.Y. Hsu, Gwen Fontenot (2012). Innovation in healthcare: Issues and future trends. Journal of Business Research, 65(4): 562-569. Education Ph.D. Southern Illinois University, Dept of Management -- Management Information Systems.MA Michigan State University, Telecommunication.",
  "content_length": 7500,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:33"
}