{
  "name": "Soontae Kim",
  "homepage": "http://www.ecl.kaist.ac.kr/members",
  "status": "success",
  "content": "Embedded Computing Laboratory - MembersSearch this siteEmbedded FilesSkip to main contentSkip to navigationMembersProfessorSoontae Kim (CV)Office: N1 Bldg. 903, KAISTEmail: kims@kaist.ac.krTel: 042-350-3554Fax: 042-350-7859Soontae Kim (김순태) has been with School of Computing since June 2007. He was in an assistant professor position in the Department of Computer Science and Engineering at University of South Florida at Tampa from fall 2004 to spring 2007. He earned the Ph.D. degree in Computer Science and Engineering from The Pennsylvania State University in Dec. 2003. His research interests include Embedded System/Software, Computer Architecture, Low-power, Reliability and Real-time systems. He is looking for motivated students who want to work with him. Students are encouraged to browse through the links in this site to be familiar with his research. Please feel free to contact him if you have any questions and/or want to talk to him.Administrative StaffDaun HanEmail: hdu85@kaist.ac.krPostdoctroal ResearchersPh.D. StudentsHaejin NamEmail: haejinnam@kaist.ac.krResearch InterestsProcessor MicroarchitectureGeneral Purpose Near Data Processing SystemSihyun KimEmail: sihyun.kim@kaist.ac.krResearch InterestsComputer ArchitectureFlash-based memory systemsM.S. StudentsChen YueEmail: yuechen@kaist.ac.krResearch InterestsComputer ArchitectureMohammad Zain Farooq GillEmail: zfgill@kaist.ac.krResearch InterestsComputer ArchitectureWoosung ChoiEmail: woosung.choi@kaist.ac.krResearch InterestsComputer ArchitectureFlash-based memory systemsAlumniJesung Kim, Ph.D. ('22 Fall)Postdoc (Aug. 2022 ~  Dec. 2024)Professor at Mokpo National UniversityEmail: jesung.kim@kaist.ac.krResearch InterestsReliable Embedded System DesignReliable Cache Architecture DesignSecure MemoryMyeongjae Jang, Ph.D. ('25 Spring)ETRI (Electronics and Telecommunications Research Institute)Email: myeongjae0409@etri.re.krResearch InterestsComputer ArchitectureNeural Processing Unit (NPU)Embedded and Secure AIJinkwon Kim, Ph.D. ('24 Spring)Cornell UniversityEmail: jinkwon.kim@cornell.eduResearch InterestsComputer ArchitectureCompressed DRAM/CacheSparse Tensor AcceleratorYongwook Lee, M.S. ('23 Spring)FADU TechnologyEmail: wooks1998@kaist.ac.krResearch InterestsComputer ArchitectureFlash-based memory systemsHyungsoon Kim, M.S. ('23 Spring)Koscom CorporationEmail: hyungsoon.kim@kaist.ac.krResearch InterestsComputer ArchitectureFlash-based memory systemsWonyoung Lee, Ph.D. ('23 Spring)Samsung Advanced Institute of TechnologyEmail: wy_lee@kaist.ac.krResearch InterestsReliabilty for Solid-State Drive (SSD)Computer ArchitectureMincheol Kang, Ph.D. ('22 Fall)Samsung Advanced Institute of TechnologyEmail: mincheolkang@kaist.ac.krResearch InterestsHigh Performance SSDComputer ArchitectureJunoh Moon, M.S. ('22 Spring)December & CompanyEmail: junoh.moon@kaist.ac.krResearch InterestsComputer ArchitecturePerformance efficient SSDsJehoon Park, M.S. ('22 Spring)Samsung ElectronicsEmail: jehoon315@kaist.ac.krResearch InterestsComputer ArchitectureImran Fareed, Ph.D. ('21 Spring)Interuniversity Microelectronics Centre (IMEC)Email: imranf45@kaist.ac.krResearch InterestsComputer ArchitectureFlash-based memory systemsPerformance and endurance efficient SSDsEmerging Non-volatile memoriesOperating systems, Virtual memoryMuhammad Avais Qureshi, Ph.D. ('20 Spring)Email: avais@kaist.ac.krResearch InterestsComputer ArchitectureSTT-RAM CacheMyoungjoon Lee, Ph.D. ('20 Spring)Samsung Electronics.Email: leemj@kaist.ac.krResearch InterestsCyber-physical SystemReal-time Embedded SystemJungwoo Park, Ph.D. ('19 Fall)Samsung ElectronicsEmail: jw.park@kaist.ac.krResearch InterestsLow-power Embedded System DesignHyeonggyu Kim, Ph.D. ('19 Spring)Samsung ElectronicsEmail: hyeonggyu@kaist.ac.krResearch InterestsEnergy Efficient DRAM System DesignEmerging Memory Technologies (STT-RAM)Low-Power Embedded System DesignYeji Kang, M.S. ('18 Spring)NAVEREmail: echo15@kaist.ac.krResearch InterestsComputer ArchitectureBohun Seo, M.S. ('18 Spring)Korea Financial Telecommunications & Clearings InstituteEmail: bo_hoon_e@kaist.ac.krResearch InterestsMobile System DesignRyunkyun Park, M.S. ('18 Spring)Samsung ElectronicsEmail: ryun.park@kaist.ac.krResearch InterestsMobile System DesignMuhammad Hassan, M.S. ('17 Fall)Email: m.hassan@kaist.ac.krResearch InterestsComputer Architecture & Embedded SystemsParallel Processing & High Performance ComputingJeongkyu Hong, Ph.D. ('17 Fall)Postdoc (Aug 2017 ~ Aug 2018)Professor at University of SeoulEmail: jhong@uos.ac.krResearch InterestsLow-power Embedded System DesignReliable Embedded System DesignYebin Lee, Ph.D. ('17 Spring)Founder & CEO of NextwaveEmail: smartcode@kaist.ac.krResearch InterestsEnergy-Efficient DRAM System DesignEnergy-Aware Emerging Memory Technologies (PCM, STT-RAM)Low-power Embedded System DesignMinho Ju, M.S. ('16 Spring)Samsung ElectronicsEmail: minhoju@kaist.ac.krResearch InterestsLow-Power Embedded System DesignHamed FarbehVisiting Researcher (Oct. 2014 ~ May 2015)Professor at Amirkabir University of Technology (AUT)Email: farbeh@aut.ac.irResearch InterestsFault-Tolerant Memory Hierarchy DesignDependable Embedded SystemsReliability Issues in Multi-Core SystemsHongsun Ahn, M.S. ('15 Spring)The Export-Import Bank of KoreaEmail: dyddnsrh@kaist.ac.krResearch InterestsLow-power Embedded System DesignComputer ArchitectureSeokin Hong, Ph.D. ('15 Spring)Professor at  Sungkyunkwan University Email: seokin@skku.eduResearch InterestsFault Tolerant Computer Architecture DesignEnergy Efficient Computer Architecture DesignMemory System Design (DRAM, PRAM, STT-RAM)Jongmin Lee, Ph.D. ('15 Spring)Professor at Wonkwang UniversityEmail: square55@wku.ac.krResearch InterestsEmbedded System DesignComputer ArchitecturePower Efficient Architecture DesignMohammad Abdur Rouf, Ph.D. ('14 Fall)Professor at Dhaka University of Engineering and Technology, BangladeshEmail: rouf7606@gmail.comResearch InterestsReliable Embedded SystemControl Flow ReliabilityTayyeb Mahmood, Ph.D. ('13 Spring)Postdoc (Sep 2014 ~ Feb 2015)Professor at RCET-UET, Lahore, PakistanEmail: tayyeb.mahmood@gmail.comResearch InterestsComputer ArchitectureKwangcheol ShinResearch ProfessorProfessor at Huree University, Ulan Bator, MongoliaEmail: kcshin2005@gmail.comResearch InterestsEmbedded SystemsDelay-tolerant NetworksSensor NetworksSeokgi Kim, M.S. ('12 Spring)National Security Research InstituteEmail: ksk3@kaist.ac.krResearch InterestsLow-power Embedded System DesignEnergy Aware DRAM Architecture DesignTaeju Park, M.S. ('11 Fall)University of Michigan, Ann ArborEmail: park8806@kaist.ac.krResearch InterestsCyber-physical SystemReal-time Embedded SystemGieil Lee, M.S. ('10 Fall)LG Electronics (LG전자)Email: leegieil@kaist.ac.krResearch InterestsComputer ArchitectureSecurityGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 6876,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:49"
}