{
  "name": "Sooyoung Cha",
  "homepage": "https://sal.skku.edu",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationSooyoung Cha (차수영)Associate ProfessorSoftware Analysis Laboratory,Dept. of Computer Science and Engineering,College of Computing and Informatics, Sungkyunkwan University.[CV]NewsI am always looking for motivated graduate/undergraduate students and postdocs to work with. For more detailed information, see recruitment, publications, talks, or send me an email.  Research AreasMy research aims to develop software analysis techniques for safe and reliable software. In particular, Data-driven software testing for automatically detecting software bugs [youtube] Machine learning guided static analysisNeural network testingEducational Background2016 ~ 2021, Ph.D. Computer Science and Engineering, Korea University2014 ~ 2016, M.S. Computer Science and Engineering, Korea University2008 ~ 2014, B.S. Computer Science and Engineering, Sejong UniversityEmployed Positions2025.09 ~ present,  Associate Professor, Dept. of Computer Science and Engineering, Sungkyunkwan University2021.09 ~ 2025.08,  Assistant Professor, Dept. of Computer Science and Engineering, Sungkyunkwan University2021.03 ~ 2021.08, Research Professor, Korea UniversityProgram CommitteeOOPSLA 2025: Conference on Object-Oriented Programming Systems, Languages, and ApplicationsAwardsACM SIGSOFT Distinguished Paper Award. ICSE 2022ACM SIGSOFT Distinguished Paper Award. ISSTA 2020PublicationsEnhancing Symbolic Execution with Self-Configuring ParametersMinjong Kim and Sooyoung ChaICSE 2026: International Conference on Software Engineering [pdf] [tool] TopSeed: Learning Seed Selection Strategies for Symbolic Execution from ScratchJaehyeok Lee and Sooyoung ChaICSE 2025: International Conference on Software Engineering [pdf] [tool] FeatMaker: Automated Feature Engineering for Search Strategy of Symbolic ExecutionJaehan Yoon and Sooyoung ChaFSE 2024: ACM International Conference on the Foundations of Software Engineering[pdf] [tool] Learning Seed-Adaptive Mutation Strategies for Greybox FuzzingMyungho Lee, Sooyoung Cha, and Hakjoo OhICSE 2023: International Conference on Software Engineering[pdf] [tool] Enhancing Dynamic Symbolic Execution by Automatically Learning Search HeuristicsSooyoung Cha, Seongjoon Hong, Jiseong Bak, Jingyoung Kim, Junhee Lee, and Hakjoo OhTSE: IEEE Transactions on Software Engineering,  Volume  48, No. 9, 2022, Pages  3640- 3663.[pdf] [tool]SymTuner: Maximizing the Power of Symbolic Execution by Adaptively Tuning External ParametersSooyoung Cha, Myungho Lee, Seokhyun Lee, and Hakjoo OhICSE 2022: International Conference on Software Engineering🏅ACM SIGSOFT Distinguished Paper Award[pdf] [tool] [slides] [video]Making Symbolic Execution Promising by Learning Aggressive State-Pruning StrategySooyoung Cha and Hakjoo OhESEC/FSE 2020: ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering.[pdf] [tool] [slides] [teaser video] [video]Effective White-Box Testing of Deep Neural Networks with Adaptive Neuron-Selection StrategySeokhyun Lee, Sooyoung Cha, Dain Lee and Hakjoo OhISSTA 2020: The ACM SIGSOFT International Symposium on Software Testing and Analysis.🏅ACM SIGSOFT Distinguished Paper Award[pdf] [tool]Concolic Testing with Adaptively Changing Search HeuristicsSooyoung Cha and Hakjoo OhESEC/FSE 2019: ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering.[pdf] [tool] [slides]A Scalable Learning Algorithm for Data-Driven Program AnalysisSooyoung Cha, Sehun Jeong, and Hakjoo OhInformation and Software Technology, Volume 104, 2018, Pages 1-13.[pdf] [link]Template-Guided Concolic Testing via Online LearningSooyoung Cha, Seonho Lee, and Hakjoo OhASE 2018: IEEE/ACM International Conference on Automated Software Engineering.[pdf] [tool] [slides]Automatically Generating Search Heuristics for Concolic TestingSooyoung Cha, Seongjoon Hong, Junhee Lee, and Hakjoo OhICSE 2018: International Conference on Software Engineering.[pdf] [tool] [slides]Learning a Strategy for Choosing Widening Thresholds from a Large CodebaseSooyoung Cha, Sehun Jeong, and Hakjoo OhAPLAS 2016: Asian Symposium on Programming Languages and Systems.[pdf] [slides]Contact InformationOffice 27318, Engineering Building 2 Sungkyunkwan University 2066, Seobu-ro, Jangan-gu, Suwon, South Korea(office) +82.31.290.7953(email) sooyoung.cha@skku.eduGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4485,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:48"
}