{
  "name": "Sophie Jörg",
  "homepage": "https://people.cs.clemson.edu/~sjoerg",
  "status": "success",
  "content": "Sophie Jörg Sophie Jörg Associate Professor Visual Computing Lab [VCL] Visual Computing Division [VC] Digital Production Arts [DPA] School of Computing [SoC] Clemson University [CU] Clemson, SC 29634 USA office: 318 McAdams Hall e-mail:sjoerg AT clemson.edu [news] [about me] [teaching] [publications] [group] About me Research interests: My primary research interests are in computer graphics, especially in animation and perception of virtual characters. I am furthermore interested in virtual reality, machine learning, and human-computer interaction. Character animation techniques and algorithms. I am particularly interested in developing new animation techniques using motion capture, statistical properties and learning through databases. Perception of lifelike virtual humans. Humans are capable of successfully distinguishing between human and computer-generated motions, even if the differences are marginal. This skill makes it a challenge to produce convincing animations, especially for very realistic human-like virtual characters. I aim to determine which components of human motion are crucial to lifelike appearance and which errors diminish this realism. Hand and finger motions. Hand and finger motions are omnipresent in daily life. Nevertheless, virtual characters often lack convincing hand and finger motions. Capturing, analyzing, understanding, and automatically generating these subtle movements are topics I address in my research. Past positions:I received my PhD in 2011 from the Graphics, Vision and Visualization Group at Trinity College Dublin, Ireland, advised by Carol O'Sullivan. I then spent a year as a postdoctoral researcher at Carnegie Mellon's Graphics Lab working with Alla Safonova and Jessica Hodgins. During my PhD, I also conducted research as a visiting student in the Graphics Lab at Carnegie Mellon University and as an intern at Disney Research, Pittsburgh. News June 2023: Our research on the role of detailed hand motions in communication is published in Transactions on Graphics! We will present it at SIGGRAPH 2023. February 2023: I am leaving Clemson for a new position at the University of Bamberg starting in March 2023. You will find me here. January 2023: Our paper on the effect of accurate hand motions in communication got published at TOG! December 2022: My PhD student Alex graduated. You can find her work here. Fall 2021: I am on sabbatical at TU Munich. August 2021: I received the College of Engineering, Computing and Applied Sciences Dean's Distinguished Professor Award! Dec 2020: We have updated our course \"Virtual Hands in VR: Motion Capture, Synthesis, and Perception\" for SIGGRAPH Asia 2020. July 2020: We just submitted the materials for our SIGGRAPH 2020 course \"Virtual Hands in VR: Motion Capture, Synthesis, and Perception\". July 2019: Hope to see you at SCA or SIGGRAPH! I am an invited speaker at SCA, serving as a member of the SIGGRAPH doctoral consortium, and chairing the Capture Control Session at SIGGRAPH. You will also find me at Clemson's DPA Reception. May 2019: My student Lorraine graduated. You can find her work here. Feb 2019: I received the Clemson Board of Trustees Faculty Award for Excellence! Aug 2018: I got tenure. Feb 2017: I got awarded a CAREER grant. July 31, 2016: My PhD student Lorraine won the Best Presentation Award at SAP 2016! July 10, 2016: Our two SAP-papers got added to the ACM digital library. [1] [2] March 12, 2015: Our STAR-paper was accepted for Eurographics 2015. Nov 10, 2014: Our paper won the Best Paper Award at MIG. August 15, 2014: Back from SAP and SIGGRAPH. Presented our paper on character responsiveness at SAP and our poster on VenvI at SIGGRAPH. August 1, 2014: My summer student, Dana Moore, is finishing her research experience with the DREU program. July 31, 2014: Our gaze modeling project received an award from the National Science Foundation (CHS Small, Co-PI Andrew Duchowski). [1] May 15, 2014: Responsiveness paper accepted at SAP 2014. Feb 26, 2014: Press coverage on VEnvI project: [1] [2] [3] Jan 29, 2014: Our project VEnvI (Virtual Environment Interactions) received funding from the National Science Foundation (NSF INSPIRE award). [1] [2] Teaching Fall 2022: CPSC 8110 Technical Character Animation Spring 2021: CPSC 1060.003 Introduction to Programming in Java Fall 2020: CPSC 1060.003 Introduction to Programming in Java Spring 2020: CPSC 4820/6820 3D Game Programming: Algorithms and Techniques Fall 2019: DPA 8070 3D Modeling and Animation Spring 2019: CPSC 8110 Technical Character Animation Spring 2018: CPSC 8110 Technical Character Animation Fall 2017: DPA 8070 3D Modeling and Animation Spring 2017: CPSC 8110 Technical Character Animation Fall 2016: CPSC 8070 3D Modeling and Animation Fall 2016: CPSC 8810 3D Game Development Spring 2016: CPSC 8110 Character Animation Fall 2015: CPSC 8070 3D Modeling and Animation Spring 2015: CPSC 4820/6820 Design & Implementation of Video Game Modules Fall 2014: CPSC 8070 3D Modeling and Animation Fall 2014: DPA 4000/6000 Technical Foundations of Digital Production I Spring 2014: CPSC 8080 Advanced Animation Fall 2013: CPSC 8070 3D Modeling and Animation Spring 2013: CPSC 881.005 Technical Foundations of Character Animation Fall 2012: CPSC 807 3D Modeling and Animation Selected Publications A more complete list can be found on my Google Scholar site Alex Adkins, Aline Normoyle, Lorraine Lin, Yu Sun, Yuting Ye, Massimiliano Di Luca, and Sophie Jörg How Important are Detailed Hand Motions for Communication for a Virtual Character Through the Lens of Charades? ACM Transactions on Graphics, Volume 42, Issue 3, Article No. 27, pp 1-16. [project] [paper] [appendix] [supplemental] [video] [bibtex] Alex Adkins, Lorraine Lin, Aline Normoyle, Ryan Canales, Yuting Ye, and Sophie Jörg Evaluating Grasping Visualizations and Control Modes in a VR Game. ACM Transactions on Applied Perception, October 2021, Volume 18, Issue 4, Article No. 29, pp. 1-14. [project] [paper] [supplemental] [video] [talk] [bibtex] Sophie Jörg, Yuting Ye, Franziska Mueller, Michael Neff, and Victor Zordan Virtual Hands in VR: Motion Capture, Synthesis, and Perception. SA '20: SIGGRAPH Asia 2020 Courses, November 2020, Article No. 2. [course-notes] [acm-website+video] Sophie Jörg, Yuting Ye, Michael Neff, Franziska Mueller, and Victor Zordan Virtual Hands in VR: Motion Capture, Synthesis, and Perception. SIGGRAPH '20: ACM SIGGRAPH 2020 Courses, August 2020, Article No. 16. [acm-website+video] Brendan John, Sophie Jörg, Sanjeev Koppal, and Eakta Jain The Security-Utility Trade-off for Iris Authentication and Eye Animation for Social Virtual Avatars. IEEE Transactions on Visualization and Computer Graphics (TVCG 2020), 2020, Volume 26, Issue 5, pages 1880-1890. [paper] [video] [slides] [bibtex] [IEEE] Ryan Canales, Aline Normoyle, Yu Sun, Yuting Ye, Massimiliano Di Luca, and Sophie Jörg Virtual Grasping Feedback and Virtual Hand Ownership. ACM Symposium on Applied Perception, 2019, Article No. 4, 9 pages. [paper] [video] [bibtex] Lorraine Lin, Aline Normovle, Alexandra Adkins, Yu Sun, Andrew Robb, Yuting Ye, Massimiliano Di Luca, and Sophie Jörg The Effect of Hand Size and Interaction Modality on the Virtual Hand Illusion. IEEE Conference on Virtual Reality and 3D User Interfaces (VR), 2019, pp. 510-518. [project] [paper] [bibtex] [video] Sophie Jörg, Andrew Duchowski, Krzysztof Krejtz, and Anna Niedzielska Perceptual Adjustment of Eyeball Rotation and Pupil Size Jitter for Virtual Characters. ACM Transactions on Applied Perception (TAP), October 2018, Volume 15, Issue 4, Article No. 24. [project] [paper] [acm-website+video] [bibtex] [data+models] Valentin Schwind, Lorraine Lin, Massimiliano Di Luca, Sophie Jörg, and James Hillis Touch with foreign hands: The effect of virtual hand appearance on visual-haptic integration. Proceedings of the ACM Symposium on Applied Perception (ACM SAP) 2018, 8 pages. [paper] [bibtex] Lorraine Lin, Dhaval Parmar, Sabarish V. Babu, Alison E. Leonard, Shaundra B. Daily, and Sophie Jörg How Character Customization Affects Learning in Computational Thinking. Proceedings of the ACM Symposium on Applied Perception (ACM SAP) 2017, 8 pages. [project] [project2] Dhaval Parmar, Joseph Isaac, Sabarish Babu, Nikeetha DSouza, Alison Leonard, and Sophie Jörg Programming moves: Design and evaluation of applying embodied interaction in virtual environments to enhance computational thinking in middle school students IEEE Virtual Reality (VR) 2016, pp. 131-140. [paper] Ellie Ebrahimi, Sabarish Babu, Christopher Pagano, and Sophie Jörg An empirical evaluation of visuo-haptic feedback on physical reaching behaviors during 3D interaction in real and immersive virtual environments ACM Transactions on Applied Perception (TAP) July 2016, Volume 13, Issue 4, Article No. 19. We won the Best Paper Award at ACM SAP 2016. [paper] Lorraine Lin and Sophie Jörg. Need a Hand? How Appearance Affects the Virtual Hand Illusion Proceedings of the ACM Symposium on Applied Perception (ACM SAP) July 2016, pp. 69-76. Lorraine won the Best Presentation Award. [project] [paper] [bibtex] Andrew T Duchowski, Sophie Jörg, Tyler N Allen, Ioannis Giannopoulos, Krzysztof Krejtz. Eye Movement Synthesis ACM Symposium on Eye Tracking Research & Applications (ETRA), March 2016, pp. 147154. [acm-website+video] Andrew Duchowski, Sophie Jörg, Aubrey Lawson, Takumi Bolte, Lech Swirski, and Krzysztof Krejtz. Eye Movement Synthesis with 1/f Pink Noise Proceedings of the 8th ACM SIGGRAPH Conference on Motion in Games 2015 (MIG) November 2015, pp. 47-56. [paper] [acm-website+video] Nkenge Wheatland, Yingying Wang, Huaguang Song, Michael Neff, Victor Zordan, and Sophie Jörg State of the Art in Hand and Finger Modeling and Animation Computer Graphics Forum, Volume 34, Issue 2, pp. 735-760 (Eurographics, May 2015). [paper] Shaundra B. Daily, Alison E. Leonard, Sophie Jörg, Sabarish Babu, Kara Gundersen, Dhaval Parmar Embodying computational thinking: Initial design o",
  "content_length": 14172,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:54"
}