{
  "name": "Sophia Yakoubov",
  "homepage": "https://pure.au.dk/portal/da/persons/sophia-yakoubov(818cd271-6e5e-4980-b248-4a337b7c0603).html",
  "status": "success",
  "content": "Sophia Yakoubov - Aarhus Universitet Sophia Yakoubov Lektor, Institut for Datalogi https://orcid.org/0000-0001-7958-8537 E-mailsophia.yakoubovcs.audk Åbogade 34, 5335, 2898200 Aarhus NDanmark 20202025 Publikationer pr. år Fingeraftryk Dyk ned i forskningsemnerne, hvor Sophia Yakoubov er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 6 Lignende profiler public key Computer Science 100% Secret Sharing Computer Science 69% ring signature Computer Science 46% Secure Communication Computer Science 46% Incomplete Networks Keyphrases 46% Corruption Keyphrases 44% Security Assurance Keyphrases 36% Encryption Scheme Computer Science 35% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Projekter Projekter pr. år 2024 2024 2027 1 Igangværende Projekter pr. år SCI: Secure Computation Infrastructures for the Retail IndustryAranha, D. F. (PI) & Yakoubov, S. (PI)01/08/2024 → 01/08/2027Projekter: Projekt › Forskning Publikation Publikationer pr. år 2020 2021 2022 2023 2025 19 Konferencebidrag i proceedings 2 Tidsskriftartikel 1 Paper Publikationer pr. år Publikationer pr. år Efficient Secure Communication Over Dynamic Incomplete Networks With Minimal ConnectivityDamgård, I. B., Ravi, D., Roy, L. D., Tschudi, D. & Yakoubov, S., 2025, Theory of Cryptography - 22nd International Conference, TCC 2024, Proceedings. Boyle, E., Boyle, E. & Mahmoody, M. (red.). Cham: Springer, s. 266–292 27 s. (Lecture Notes in Computer Science, Bind 15367).Publikation: Bidrag til bog/antologi/rapport/proceeding › Konferencebidrag i proceedings › Forskning › peer review Corruption 100% Secure Communication 100% Incomplete Networks 100% Communication Complexity 50% Secure Computation 50% Constant-Round YOSO MPC Without SetupKolby, S., Ravi, D. & Yakoubov, S., 2024, I: IACR Communications in Cryptology. 1, 3Publikation: Bidrag til tidsskrift/Konferencebidrag i tidsskrift /Bidrag til avis › Tidsskriftartikel › Forskning › peer review Åben adgang Multi Designated Verifier Ring SignaturesYakoubov, S., Pagnin, E. & Kolby, S., 2024, I: IACR Communications in Cryptology. 1, 3Publikation: Bidrag til tidsskrift/Konferencebidrag i tidsskrift /Bidrag til avis › Tidsskriftartikel › Forskning › peer review Åben adgang Threshold-Optimal MPC With Friends and FoesMelissaris Papanikolaou, N., Ravi, D. & Yakoubov, S., mar. 2024, Progress in Cryptology – INDOCRYPT 2023: 24th International Conference on Cryptology in India, Goa, India, December 10–13, 2023, Proceedings, Part II. Chattopadhyay, A., Bhasin, S., Picek, S. & Rebeiro, C. (red.). Springer, Bind 2. s. 3-24 22 s. (Lecture Notes in Computer Science, Bind 14460).Publikation: Bidrag til bog/antologi/rapport/proceeding › Konferencebidrag i proceedings › Forskning › peer review Corrupt 100% Adaptive Corruptions 100% Guaranteed Output Delivery 100% Construction-based 100% Mixed Adversary 100% Broadcast-Optimal Four-Round MPC in the Plain ModelCiampi, M., Damgård, I., Ravi, D., Siniscalchi, L., Xia, Y. & Yakoubov, S., nov. 2023, Theory of Cryptography: 21st International Conference, TCC 2023, Taipei, Taiwan, November 29 – December 2, 2023, Proceedings, Part II. Rothblum, G. & Wee, H. (red.). Springer, s. 3-32 30 s. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Bind 14370 ).Publikation: Bidrag til bog/antologi/rapport/proceeding › Konferencebidrag i proceedings › Forskning › peer review Security Assurance 100% Identifiable Abort 100% Black Box 100% Minimal Number 100% Simulation Box 100% Se alle 22 publikation",
  "content_length": 3919,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:50"
}