{
  "name": "Sophia Ananiadou",
  "homepage": "http://www.manchester.ac.uk/research/Sophia.ananiadou",
  "status": "success",
  "content": "Sophia Ananiadou - Research Explorer The University of Manchester Sophia Ananiadou Prof Chair in Computer Science, Natural Language Processing and Text Mining https://orcid.org/0000-0002-4097-9191 Accepting PhD StudentsPhD projectsContact [email protected] Personal profile My groupResearch Group(s)Data Science InstituteText MiningResearch interestsProf. Ananiadou's main contributions are in the area of natural language processing. She is director of The National Centre for Text Mining (NaCTeM) the first publicly funded centre of its type in the world. She played a leading role in the creation of the centre,  negotiating  strategic links with industry (e.g. Pacific Life, Unitis, Pfizer, AZ, Unilever, Atypon, Microsoft, IBM, Elsevier and Nature) which has helped to guide NaCTeM towards its current status of a fully sustainable centre that engages with both academia and industry. Her research covers computational terminology, information extraction, document classification and clustering, emotion detection, summarisation, query expansion and resource building using neurosymbolic methods. These have been applied in a number of domains, such as biology, medicine, environment, law, health, humanities and social sciences. Her research has resulted in over 400 peer-reviewed publications in journals and conferences. Her H-Index stands at 64 (Google Scholar) with over 17,000 citations, placing her in the top 20 most cited scholars worldwide in text mining. Important research outcomes have included the following: Computational terminology led to the development of the C-value method for automatic term recognition, which has been adopted as a standard for automatic term extraction internationally.  C-value has been packaged into the widely-used TerMine service.Work on acronym recognition has led to the development of the popular Acromine service.Work on direct and indirect association mining resulted in the deeopment of the FACTA+ service for which I was interviewed by New ScientistA major outcome of the AHRC Big Data project Mining the History of Medicine is the History of Medicine search engine, which provides semantically-enhanced search over the archives of the British Medical Journal (1840-present day) and the London-area Medical Officer of Health reports (1848-1972). This work featured in the Lancet.Collaboration with the National Institute for Health and Care Excellence (NICE) supported the development of a widely used tool, RobotAnalyst supporting search and screening of systematic reviews based on novel machine learning and text mining methods. RobotAnalyst is currently used by NICE, Cochrane teams and over 40 research institutes worldwide.Leading role in the development of interoperable text mining platforms to support research in several areas: the U-Compare and Argo platforms received funding from IBM, EU, BBSRC, AHRC, JISC and DARPA. Leading role in the interoperable platform funded by H2020 OpenMinTed.Role in making the University of Manchester a Hub in the UK of the META-NET Network of Excellence,  forging the Multilingual Europe TechnologyClosely involved with teams of psychology and mental health to provide text analytics for mental health onset prediction.At Salford Royal,  involved with the Lung Studies team on chronic obstructive pulmonary disease (COPD), extracting phenotypic information from literature and integrating knowledge from electronic health records and the literature. In 2010, she supervised NaCTeM in the critical assessment of information extraction in biology (BioCreAtIvE III) protein-protein interaction (PPI) challenge to achieve the best performance, in what was considered the most challenging task, the Interaction Method Task (IMT). In 2013, she supervised  NaCTeM in BioCreAtIvE IV. NaCTeM achieved the best results in the tasks related with the automatic recognition of chemicals and genes (Comparative Toxicogenomics Database) and Chemical and Drug Named Entity Recognition. NaCTeM’s event extraction system, EventMine, outperformed other systems in the BioNLP 2011 and 2013 tasks (pathway curation and infectious diseases, epigenetics) in the complex task of event extraction. In 2015, within the DARPA funded Big Cancer Mechanism project,  her team produced the top performing ‘federated system’ for reading, producing the best performing text mining solutions for extracting entities and events for cancer pathways. A co-instigator of the launch of a Special Interest Group within ACL (SIGBioMed) in 2008, dedicated to language processing in the biological, biomedical, and clinical domain bringing together researchers in NLP, bioinformatics, medical informatics, and computational biology, providing a venue for the promotion and dissemination of original research in this area. The BioNLP workshops are hubs of evaluation of text mining technology in biomedicine via the creation of shared tasks for which she acted as co-organiser.OverviewSophia Ananiadou is Professor in the School of Computer Science at the University of Manchester and is the director of The National Centre for Text Mining (NaCTeM)  the only centre of its type in the world. She has led the development of the text mining tools and services currently used in NaCTeM with the aim of providing scalable text mining services: information extraction, intelligent searching, association mining, etc. She has received the IBM UIMA innovation award 3 consecutive times and is also a Daiwa award winner. Education PhD Computational Linguistics, UMISTDEA, Linguistics, Paris VII, Jussieu, FranceDEA, Literature, Paris IV, Sorbonne, FranceBA, Language and Linguistics, University of Athens, Greece Employment history Research Associate, University of Geneva, Machine Translation (1983-1984)Research Assistant, Department of Computational Linguistics, UMIST (1985-1993)Research Fellow, Language and Engineering, UMIST (1999-2000)Senior Lecturer, Computing, Manchester Metropolitan University (1993-1999)Senior Lecturer, Computer Science, School of Computing Science and Engineering, University of Salford (2000-2005) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsTuring Fellow, Alan Turing Institute15 Oct 2018 → 14 Oct 2022Distinguished Research Fellow, Artificial Intelligence Research Center, AISTOct 2017 → Oct 2027 Research Beacons, Institutes and PlatformsDigital FuturesManchester Institute of BiotechnologyCreative ManchesterKeywordsNatural Language ProcessingText MiningArtificial IntelligenceMachine Learning Fingerprint Dive into the research topics where Sophia Ananiadou is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Text Mining Computer Science 100% Annotation Computer Science 55% Event Extraction Computer Science 28% Biomedical Literature Computer Science 24% Syntactics Computer Science 22% Information Extraction Computer Science 20% Named Entity Recognition Computer Science 20% Experimental Result Computer Science 17% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 213 Conference contribution 160 Article 25 Chapter 9 Paper 13 More 3 Other 3 Poster 2 Foreword/postscript 2 Review article 1 Book 1 Conference article 1 Other contribution Research output per year Research output per year Large Language Models in Mental Health Care: A Scoping ReviewAnaniadou, S. & Yang, K., 25 Jul 2025, In: Current Treatment Options in Psychiatry. 12, 27, 18 p., 27.Research output: Contribution to journal › Article › peer-review Mental Health Care 100% Rigor 20% EmoLLMs: A Series of Emotional Large Language Models and Annotation Tools for Comprehensive Affective AnalysisLiu, Z., Yang, K., Xie, Q., Zhang, T. & Ananiadou, S., 25 Aug 2024.Research output: Contribution to conference › Paper › peer-review Open Access Annotation 100% Large Language Model 100% Sentiment Analysis 40% Regression Task 40% Classification Task 40% Emotion detection for misinformation: A reviewLiu, Z., Zhang, T., Yang, K., Thompson, P., Yu, Z. & Ananiadou, S., 2024, In: Information Fusion. 107Research output: Contribution to journal › Article › peer-review Open Access MentaLLaMA: interpretable mental health analysis on social media with large language modelsYang, K., Zhang, T., Kuang, Z., Xie, Q., Huang, J. & Ananiadou, S., 13 May 2024, WWW '24: : Proceedings of the ACM Web Conference 2024. Association for Computing Machinery, p. 4489-4500 11 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open Access Large Language Model 100% Open Source 33% Discriminative Method 33% Zero-Shot Learning 33% Correctness 33% MetaAligner: Towards Generalizable Multi-Objective Alignment of Language ModelsYang, K., Liu, Z., Xie, Q., Huang, J., Zhang, T. & Ananiadou, S., Jul 2024.Research output: Contribution to conference › Paper › peer-review Open Access Graphics Processing Unit 100% Experimental Result 100% Reformulation 100% Model Parameter 100% Multi-Objective Model 100% View all 420 research outputs Projects 2 Active 15 Finished Projects per year BHF Centre for Research Excellence 2024-2029Keavney, B. (PI), Tomaszewski, M. (CoI), Hentges, K. (CoI), Buch, M. (CoI), Ananiadou, S. (CoI), Miller, C. (CoI), Oceandy, D. (CoI), Smith, C. (CoI), Allan, S. (CoI), Cartwright, E. (CoI), Revell, A. (CoI), Frangi, A. F. (CoI), Peek, N. (CoI), Greenstein, A. (CoI), Wang, X. (CoI), Trafford, A. (CoI), Morris, A. (CoI), Newman, W. (C",
  "content_length": 15052,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:54"
}