{
  "name": "Sophia Drossopoulou",
  "homepage": "https://wp.doc.ic.ac.uk/sd",
  "status": "success",
  "content": "Sophia Drossopoulou | Professor of Programming Languages Skip to content Department of Computing, Imperial, 180 Queen’s Gate, London SW7 2AZ, UK email: S dot Drossopoulou at imperial dt ac dot uk Also, unofficial member of the Verona Project. Green  Concerns  Blog     Τὸ τῷ σμήνει μὴ συμφέρον οὐδὲ τῇ μελίσσῃ συμφέρει. (The detrimental to the swarm, is also detrimental to the bee.) Marcus Aurelius, Meditations Dahl-Nygaard Senior Prize  for 2023, will be awarded at ECOOP, July 2023. Selected Recent Talks Pony: Actors, Causality, Types and Garbage Collection QCon, London, March 2020 Holistic Specifications for Robust Programs (talk) November 2018, Codemesch London Pony for Safe, Fast, Concurrent Programs November 2017, Codemesh, and May 2017 PLISS part1 and part 2 Towards Reasoning about Risk and Trust in the open world March 2016, Google Palo Alto and Specifying Attenuation OCAP/OOPSLA Vancouver 2017 Developing Inductive Proofs in Dafny MSR Seattle, May 2013 tel: (+44) 20 7594 8368,   fax: (+44) 20 75818024 email: S dot Drossopoulou at imperial dt ac dot uk Also unofficial member of the Verona Project. Green  Concerns  Blog     Τὸ τῷ σμήνει μὴ συμφέρον οὐδὲ τῇ μελίσσῃ συμφέρει. (The detrimental to the swarm, is also detrimental to the bee.) Marcus Aurelius, Meditations Dahl-Nygaard Senior Prize  for 2023, will be awarded at ECOOP, July 2023. Selected Recent Talks Pony: Actors, Causality, Types and Garbage Collection QCon, London, March 2020 Holistic Specifications for Robust Programs (talk) November 2018, Codemesch London Pony for Safe, Fast, Concurrent Programs November 2017, Codemesh, and May 2017 PLISS part1 and part 2 Towards Reasoning about Risk and Trust in the open world March 2016, Google Palo Alto and Specifying Attenuation OCAP/OOPSLA Vancouver 2017 Developing Inductive Proofs in Dafny MSR Seattle, May 2013",
  "content_length": 1847,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:49"
}