{
  "name": "Sophie Fellenz",
  "homepage": "https://ml.informatik.uni-kl.de/people/sophie-burkhardt.php",
  "status": "success",
  "content": "ML@RPTU Jun.-Prof. Dr. Sophie Fellenz (née Burkhardt) Junior professor Bio Since 2020 Sophie Fellenz is a junior professor at RPTU's department of computer science. Previously she was a research group leader at Johannes Gutenberg University Mainz (07/2020-10/2020) and before that a PostDoc in the research group of Stefan Kramer. She obtained a PhD from Uni Mainz in 2018 under the supervision of Stefan Kramer and a Magister in Philosophy and Computer Science in 2013 with a thesis on mental representation. Research interests Sophie Fellenz is interested in probabilistic machine learning methods, especially with applications on text data such as topic models, but also generative models and deep generative models in general. More recently, she is also interested in how to insert knowledge into neural models and models that bridge the fields of graphical models and neural networks. Her PhD was also concerned with multi-label classification, nonparametric Bayesian models and online models. Appointments and scientific matters =YWZsxWZupHQjNnL15WatsGbuQWZ Office RPTU, Building 36, Room 331 - 67663 Kaiserslautern Curriculum Vitae Education 2018 Doctoral Degree in Computer Science, Johannes Gutenberg University Mainz, Germany 2013 Magister in Philosophy and Computer Science, Johannes Gutenberg University Mainz, Germany Professional Experience since 2020 Junior Professor, RPTU Kaiserslautern-Landau, Kaiserslautern, Germany 2017-2020 Research Associate, Johannes Gutenberg University Mainz, Germany Activities and honors 2019 Best Dissertation Award, Uni Mainz 2013-2017 PhD Scholarship, PRIME Research 2010-2011 Scholarship German Academic Exchange Service (DAAD) Key publications Burkhardt, S., Siekiera, J., Glodde, J., Andrade-Navarro, M., Kramer, S. (2020) Towards identifying drug side effects from social media using active learning and crowd sourcing. Pacific Symposium for Biocomputing (PSB). Burkhardt, S., Kramer, S. (2019) A Survey of Multi-Label Topic Models. SIGKDD Explorations. Burkhardt, S., Kramer, S. (2019) Decoupling Sparsity and Smoothness in the Dirichlet Variational Autoencoder Topic Model. Journal of Machine Learning Research 20.131, pp. 1-27. Burkhardt, S. and Kramer, S. (2018) Multi-label Classification Using Stacked Hierarchical Dirichlet Processes with Reduced Sampling Complexity. Knowledge and Information Systems, pp. 1-23. Burkhardt, S. and Kramer, S. (2018) Online Multi-Label Dependency Topic Models for Text Classification. Machine Learning 107.5, pp. 859-886. Burkhardt, S. and Kramer, S. (2017) Online Sparse Collapsed Hybrid Variational-Gibbs Algorithm for Hierarchical Dirichlet Process Topic Models, ECML-PKDD. Skopje, Macedonia, pp. 189-204.",
  "content_length": 2699,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:51"
}