{
  "name": "Soroush Vosoughi",
  "homepage": "https://web.cs.dartmouth.edu/people/soroush-vosoughi",
  "status": "success",
  "content": "Soroush Vosoughi | Department of Computer Science Skip to main content Soroush Vosoughi Associate Professor Appointments Associate Professor of Computer Science Faculty Member, Institute for Security, Technology and Society Technical Associate Director, Dartmouth Center for Precision Health and Artificial Intelligence Faculty Affiliate, Quantitative Social Science (QSS) Faculty Affiliate, Quantitative Biomedical Sciences (QBS) Faculty Affiliate, The Arthur L. Irving Institute for Energy & Society Area of Expertise Natural Language Processing, Machine Learning, Computational Social Schience, Large Language Model, Social Media Analytics, Graph Representation Learning, Social Cyber-Security, Bioinformatics Biography I lead the Minds, Machine, and Society group in Dartmouth's Department of Computer Science.  Underpinning my work is a profound interest in developing computational models of cognition, employing language as a primary conduit. At a high level, our research primarily focuses on natural language processing (NLP) and machine learning (ML). Specifically, we delve into the intricacies of large language models (LLMs), such as those exemplified by ChatGPT, to understand and mitigate their anti-social tendencies like promoting stereotypes, spreading toxicity, and misalignment with human values. To increase their transparency and trustworthiness, we work on developing a range of interpretability methods, breaking down their inherent \"black box\" nature. Our pursuits also encompass techniques such as reinforcement learning for guiding pre-trained LLMs and grounding them using simulations. We also seek to harness the power of LLMs and classical NLP to create computational tools that offer new perspectives on social systems and issues. Our work studies phenomena such as political polarization, bias, propaganda, rumors, and hate speech, falling under the umbrella of \"computational social science.\" Our research horizons have recently broadened to include the integration of visual information into language models (i.e., visual-language models), aiming to create a more complex representation of the abundant, rich data that exists and drawing us closer to a deeper understanding of human cognition. Also, our exploration now extends to applying LLMs to the health and bioinformatics sectors, motivated by the intriguing parallels between genomic sequences and language. This venture is a collaborative effort with several other faculty at Dartmouth. I am a recipient of the Google Research Scholar Award in 2022, and Amazon Research Award in 2019, and my work has earned several Best Paper awards and nominations, including the Outstanding Paper Award at AAAI 2021. I am also a Technical Associate Director at the Dartmouth Center for Precision Health and Artificial Intelligence, a faculty member of the Institute for Security, Technology, and Society (ISTS), and a faculty affiliate of the Quantitative Social Science (QSS) program, the Quantitative Biomedical Sciences (QBS) program, and the Arthur L. Irving Institute for Energy & Society at Dartmouth. Previously, I was a postdoc at MIT, a fellow at the Berkman Klein Center at Harvard University, and a technical advisor to the non-profit startups Cortico and Public Mind. Check out more details about my research at https://www.cs.dartmouth.edu/~soroush/ View More Education B.Sc., Massachusetts Institute of Technology M.Sc., Massachusetts Institute of Technology Ph.D., Massachusetts Institute of Technology Postdoctoral Associate, Fellow, Massachusetts Institute of Technology Fellow, The Berkman Klein Center for Internet & Society, Harvard University View More Taught Courses COSC 74, Machine Learning and Statistical Data Analysis COSC 89.21 Data Mining and Knowledge Discovery COSC 76 Artificial Intelligence COSC 70.01 Foundations of Applied Computer Science COSC 89.23 Network Science and Complex Systems View More Publications See the full list of my publications here and my google scholar profile here. View More Contact Soroush.Vosoughi@dartmouth.edu Engineer and Comp Science Ctr, Room 212 HB 6211 Departments Computer Science Related Links Personal Website Connect Connect Contact Us Contact Us inclusivity at dartmouth Dartmouth is committed to academic excellence and encourages the open exchange of ideas within a culture of mutual respect. People with different backgrounds, life experiences, and perspectives make the Dartmouth community diverse, which enhances academic excellence.",
  "content_length": 4488,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:53"
}