{
  "name": "Sos S. Agaian",
  "homepage": "https://www.csi.cuny.edu/campus-directory/sos-agaian",
  "status": "success",
  "content": "Sos Agaian | | College of Staten Island Website Skip to main content Sos Agaian Distinguished Professor Sos S. Agaian, PhD in Mathematics, Dr, Engineering Science,  and is a Distinguished Professor of Computer Science at College of Staten Island and the Graduate Center, City University of New York (CUNY). Prior to joining CUNY, Dr. Agaian was the Peter T. Flawn Professor of Electrical and Computer Engineering at the University of Texas at San Antonio; Graduate School of Biomedical Sciences UTHSCSA at San Antonio; Professor, UT System Cyber and Cloud Security Initiative, and Director of Multimedia and Mobile Signal Processing Laboratory.  He has been a visiting faculty at the Tufts University, the Tampere Institute of Technology, and the Leading Scientist at the AWARE, Inc. at Bedford, MA. Dr. Agaian received his M.S. in Mathematics and Mechanics (summa cum laude) from the Yerevan State University, Armenia; his Ph.D. in Mathematics and Physics from the Steklov Institute of Mathematics, Russian Academy of Sciences (RAS); and his Doctor of Engineering Sciences degree from the Institute of Control Systems, RAS. Scholarly Interests.  Dr. Agaian’s interdisciplinary research has evolved from industrial mathematics to computer science; and from applied signal/image processing to data analytics and neurocomputing. Dr. Agaian’s research interests are in Big and Small Data Analytics, Computational Vision and Sensing, Machine Learning and Urban Computing, Multimodal Biometric and Digital Forensics, Information Processing and Fusion, and Fast Algorithms.  He has special interests in finding meaning in visual content-examine images for faces, text, objects, action, sciences, and other contents; and in the development of scientific systems and architectures in the theory and practice of engineering and computer sciences (emphasizing complex digital data processing, information sciences and systems technologies in the military, as well as medical and industrial information processing centers). Dr. Agaian has developed applications in Healthcare, Biomedical Data Mining, Object Recognition, Signal Processing, Computer-Aided Food Quality Inspection, 3D Imaging Visible and Thermal Sensors, Computational Photography, Multimedia Security, Needs-Driven Medical and Biomedical Technology, Finance, and Other Related Areas. Degrees PhD. in Mathematics and Physics, Steklov Institute of Mathematics, Russian Academy of Sciences (RAS) Doctor of Engineering Sciences, Institute of Control Systems, RAS MS, in Mathematics and Mechanics (summa cum laude), Yerevan State University, Armenia Scholarship and Publications Theoretical Scholarship Dr. Agaian’s research creates synergy between theory and practical solutions. His theoretical contributions are internationally known as Agaian’s Theorem (Craigen-Seberry-Chang, Journal of Combinatorial Theory, 59, 1992); Agaian's Family (Contemporary Design Theory; Wiley&Sons, 1992); Agaian's Method (Phoong-Chang, IEEE Transactions on Signal Processing, 2005); and Agaian’s Matrix (On Agaian Matrix, 2012, P.arxiv.org/pdf/1207.0695v1.pdf). Publications Dr. Agaian has authored over 650 peer-reviewed research papers, ten books, and nineteen edited proceedings: https://scholar.google.com/citations?user=FazfMZMAAAAJ&hl=en Editorship Dr. Agaian had served as an associate editor of: The Journal of Electronic Imaging (SPIE, IS&T); IEEE Transaction on Image Processing; IEEE Transaction on Systems, Man, and Cybernetics; Journal of Electrical and Computer Engineering (Hindawi Publishing Corporation); International Journal of Digital Multimedia Broadcasting (Hindawi Publishing Corporation); He is an Editorial Board Member for the Journal of Pattern Recognition and Image Analysis; He has been a Guest Editor for: IEEE Transactions-System Journal, Cancer Imaging System: IEEE transaction on Systems, 2012-2014; Signal Processing: Image Communication (Elsevier, 2014-2016); The International Journal of Biomedical Imaging, Hindawi Publishing Corporation 2013-2014; and IEEE Transactions on Systems, Man, and Cybernetics Society, Pattern Recognition Technologies for Anti-Terrorism Applications. Fellowships and Memberships Dr. Agaian holds the following Fellowships: SPIE Fellow for distinguished and valuable contribution to the filed optical engineering (2005); AAAS Fellow (The American Association for the Advancement of Science) for distinguished contributions to advances in the theory of intelligent imaging systems and applied science including fundamental methodology, service to the profession, and engineering education (2010); IS&T Fellow (Imaging Sciences & Technology) for his outstanding contributions to the fields of multimedia-imaging systems and security systems, including embedded data decryption processes and data hiding methods for mobile communications (2013); IEEE Fellow (Institute of Electrical and Electronics Engineers) for his contributions to biologically-inspired visual data processing systems (2017); He represented the U.S. and IEEE at NATO Meeting in 2005 Dr. Agaian holds the following Memberships: Foreign Member of the Armenian National Academy; TC-19 Technical Committee on Imaging Measurements; IEEE Instrumentation & Measurement Society and Multimedia Communications Technical Committee; IEEE Communications Society. Member at Large, IEEE-USA Awards & Recognition Committee (2012-2014). Chair and Vice-Chair, IEEE, Chapter System of Systems, Region 5, Central Texas Section (2006-2017); Co-Founder, Joint Chapter Chair, and Vice-Chair; IEEE Aerospace & Electronics Systems Society (2015-2016). Eta Kappa Nu. Awards Dr. Agaian is a recipient of: The Entrepreneurship Award (UTSA, 2016 and 2013); The Excellence in Teaching Award (2015); The Innovator of the Year Award (UTSA, 2014, http://www.gapfunding.org/utexas-san-antonio-honors-eight-researchers-at-second-annual-innovation-awards); The Tech Flash Titans-Top Researcher-Award (San Antonio Business Journal, 2014); Certificate of Merit, Franklin V.Taylor Award in Computation (IEEE-SMC ); Distinguished Research Award (University of Texas at San Antonio, (2006); Student-nominated The Most Influential Member-Award of the School of Engineering (Tufts University, 2005); MAEStro Educator of the Year, sponsored by the Society of Mexican American Engineers(2004) Mentorship and Research Funding Mentorship Dr. Agaian has the vision and ability to recognize professional talents in others. He has served as a mentor to over 30 PhD and over 60 Master’s students at Stanford University, Tufts University, and the University of Texas (UTSA). Many of his students received professional awards, including IEEE's and SPIE’s. His students are employed at Sony, Siemens, Mediatek, Raytheon, Intel, Boeing, Motorola, Cisco Systems, Freescale, Dell, MIT-LL, General Dynamics, Johns Hopkins, Armenia, Southwest Research Institute, UTSA, Tampere Institute of Technology and Tufts. Publication co-authored by Dr. Agaian and his students won awards from the IEEE Signal Processing Society; IEEE Systems, Man, and Cybernetics Society (SMC); and the International Society for Photo-Optical Instrumentations Engineers (SPIE).  For the past ten years, Dr. Agaian’s students had the opportunity to participate in “Lunch with the Expert” at SPIE Defense and Security Symposium. Dr. Agaian received numerous awards in teaching based on consistent high ratings by his students. Research Funding Dr. Agaian has received over seven million US dollars in grants from NSF, DARPA, US Department of Energy, US Army, NIJ, and AFOSR. Entrepreneurship and Public Service Entrepreneurship Dr. Agaian holds over 44 American and foreign issued or pending patents and disclosures. Several of Agaian’s IP are commercially licensed. Latakoo has licensed Dr. Agaian’s five IP’s patents/disclosures on recompression imaging systems and methods for simultaneous compression and encryption.  Latakoo’s service is used in over 50 media markets around the United States, including Nexstar Broadcasting and NBC. NBC used Latakoo to transfer all its news content from Sochi Olympics. Dr. Agaian Co-Founded BA Logix, Inc., in 2007.Company Overview of BA Logix, Inc. https://www.bloomberg.com/research/stocks/private/person.asp?personId=42192832&privcapId=38682824&previousCapId=38682824&previousTitle=BA%20Logix,%20Inc. Dr. Agaian’s efforts at UTSA contributed to its elevation to a national tier-one research university.  In 2009 the Department of Homeland Security designated UTSA as a “National Center of Academic Excellence in Information Assurance Research.” UTSA’s cyber security program has been ranked the best in the nation (http://www.ponemon.org/). Dr. Agaian co-founded the Center for Simulation, Visualization, and Real Time Prediction, which has trained over 300 students and has received a $5 million grant from NSF. Public Service Dr. Agaian has served as consultant to governments of Germany, Hong Kong, Israel, and the Chech Republic. He has served on boards and committees for numerous industrial, academic, and professional institutions, including UTSA and IEEE-SMC. Computational Vision, Machine Learning, and Data Analytics (CSMAD) Laboratory The last decade has seen a revolution in the theory and application of Computational Vision and Machine Learning (ML). The CSMAD research seeks to: find meaning in visual content of the data (video, images, signals, speech and text) and to uncover deep connections throughout the data; and to derive knowledge from big and small data (theory, efficient real-time algorithms, and software/hardware infrastructures).  The Lab’s innovative scientists and engineers are working on theoretical and applied research of real time data analytics and ML-algorithms to solve practical problems to advance cognitive abilities. The Lab’s research focus areas are: Computational Vision and Sensing; Machine Learning; Large, Medium, and Small Data Analytics and Visual Recognition; Neurocomputing; Multimodal 2D+3D Biometric and Digital Forensics",
  "content_length": 11443,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:53"
}