{
  "name": "Sotiris K. Moschoyiannis",
  "homepage": "https://www.surrey.ac.uk/people/sotiris-moschoyiannis",
  "status": "success",
  "content": "Dr Sotiris Moschoyiannis | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all LinkedIn Google Scholar Dr Sotiris Moschoyiannis Reader in Complex Systems +44 (0)1483 68913033 BB 02Wednesday 10-12; slots booked via emailAcademic and research departments Surrey Centre for Cyber Security, Surrey Institute for People-Centred Artificial Intelligence (PAI), Centre for Mathematical and Computational Biology, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyI am a mathematician (Maths, University of Patras) doing research in computer science (PhD in Theoretical Computer Science, University of Surrey). My work on Learning and Control in complex networks focuses on when and where to intervene in a network in order to steer to a desirable outcome. I am keen on mathematical methods (control theory, approximations methods) combined with computational methods such as Reinforcement Learning (rule-based, deep).I am a member of the executive committee of the IEEE Technical Committee on Cloud Computing and the technical committee on IEEE Industrial Informatics.On the Programme Committee for the annual conference on Complex Networks, the IEEE Service Oriented Computing and Applications (IEEE SOCA), and RuleML+RR   (co-Chair in 2020) and the International Rule Challenge (Chair in 2019) for the past 10 years or so. An IEEE Member (No. 41465193). Expand biography University roles and responsibilities Postgraduate Research Director (PGRD) in the School of Computer Science and Electronic Engineering Postgraduate Research Director (PGRD) in the Computer Science Research Centre EIT Liaison AcademicAffiliations and memberships IEEE Member (No. 41465193) Member of IEEE since 2010 IEEE Technical Committee on Cloud Computing Member of the Technical Committee since 2017 Technical committee on IEEE Industrial Informatics Member of the Technical Committee since 2009 News 03 FEB 2023New approach to “punishment and reward” method of training artificial intelligence offers potential key to unlock new treatments for aggressive cancers 19 JUL 2022Research offers solution to encrypted messages being hacked before sending or after receipt 22 JUL 2021New funding will unlock further vital support for UKs growth companies 21 JAN 2020Google Technical Director gives talk to MSc students 14 MAY 2019Computer science student shortlisted for Undergraduate of the Year 2019 Show all articlesResearchResearch interestsI am interested in devising the best way to act in problems modelled as complex networks, or more generally real-world situations represented as dynamical systems. The objective is to get a handle on how such systems may evolve over time. My formal methods and verification background means I come from an analytical and computational perspective. My research focuses on applying mathematical methods (e.g., control theory, approximation methods, stochastic optimisation) and computational techniques (rule-based machine learning, deep reinforcement learning) to the controllability of complex networks.  This video will give you a quick overview. This research is applicable to:Targeted therapeutics - Gene Regulatory Networks;  designing a control policy to guide therapeutic interventionsTransportation Systems -  Rail and Road networks; modelling and predicting flows of trains, cars, people, goods in urban environmentsCyber security - APTs in 5G networks and Location Proof Systems (LPS); resilience of networks to dynamic (re)configuration Here are some slides from the IEEE SOCA 2019 talk (19 November 2019) on serving AI workloads in resource constrained environments, more specifically AWS and lambda functions. Here are some slides on the Real Time Flow project, and CCTool, presented at the London Node of EIT Digital (January 2020).  The Complex Control tool (CCTool) combines results from structural controllability theory, network analysis and machine learning / AI to identify the most influential nodes (drivers), and develop control policies to direct the network to a desired state. This is joint work with Alexandra Penn and Nicholas Elia, Matthew Karlsen, George Papagiannis, Vlad Georgiev and Angelos Christidis and it originates in the EPSRC ERIE project. Expand research interests TeachingMachine Learning and Data Mining (COMM055) for Postgraduate Taught students on the MSc in Data Science programme in Semester 2 2024-25. Specifically, I teach Reinforcement Learning, and Rule-based Machine Learning.Database Systems (COMM051) for Postgraduate Taught students on the MSc in Data Science and MSc in Information Security programmes in Semester 1 2024-25.Lecture notes, exercises, and other related material on these courses can be found on SurreyLearn. Expand my teaching Sustainable development goalsMy research interests are related to the following: PublicationsCalum Robert MacLellan, Hristo Petkov, Conor McKeag, Feng Dong, David John Lowe, Roma Maguire, Sotiris Moschoyiannis, Jo Armes, Simon Skene, Alastair Finlinson, Christopher Sainsbury (2025)Emulating Real-World GLP-1 Efficacy in Type 2 Diabetes through Causal Learning and Virtual Patients, In: PLOS digital health Public Library of ScienceRandomized controlled trials (RCTs) remain the benchmark for assessing treatment effects but are limited to phenotypically narrow populations by design. We introduce a novel generative artificial intelligence (AI) driven emulation method that infers effect size through virtual clinical trials, which can emulate the RCT process and potentially extrapolate into wider populations. We validate the virtual trials by comparing the predicted impact of glucagon-like peptide-1 (GLP-1) agonists on HbA1c in type-2 diabetes (T2DM) with its true efficacy established in the LEAD-5 trial. Our emulation model learns treatment effects from real-world evidence data by a combined generative AI and causal learning approach. Training data comprised pre- and post-treatment outcomes for 5,476 people with T2DM. We considered three treatment arms: GLP-1 (Liraglutide), basal insulin (glargine), and placebo. After training, virtual trials were conducted by sampling 232 virtual patients per arm (according to the LEAD-5 inclusion criteria) and predicting post-treatment outcomes. We used difference-in-differences (DiD) for pairwise comparisons between arms. Our goal was to emulate LEAD-5 by demonstrating a significant DiD in post-treatment HbA1c reduction for GLP-1 compared to basal insulin and placebo. We found significant differences in HbA1c reduction for GLP-1 vs basal insulin (-1.21 mmol/mol (-0.11%); pVytenis Sliogeris, Leandros Maglaras, Sotiris Moschoyiannis (2023)Inferring Probabilistic Boolean Networks from Steady-State Gene Data Samples, In: Complex Networks and Their Applications XI SpringerDOI: 10.1007/978-3-031-21127-0_24Probabilistic Boolean Networks have been proposed for estimating the behaviour of dynamical systems as they combine rule-based modelling with uncertainty principles. Inferring PBNs directly from gene data is challenging however, especially when data is costly to collect and/or noisy, e.g., in the case of gene expression profile data. In this paper , we present a reproducible method for inferring PBNs directly from real gene expression data measurements taken when the system was at a steady state. The steady-state dynamics of PBNs is of special interest in the analysis of biological machinery. The proposed approach does not rely on reconstructing the state evolution of the network, which is com-putationally intractable for larger networks. We demonstrate the method on samples of real gene expression profiling data from a well-known study on metastatic melanoma. The pipeline is implemented using Python and we make it publicly available.Gayasha Somathilake, Elizabeth Ford, Jo Armes, Sotiris Moschoyiannis, Michelle Collins, Patrick Francsics, Agnieszka Lemanska (2024)Evaluating the quality of prostate cancer diagnosis recording in CPRD GOLD and CPRD Aurum primary care databases for observational research: A study using linked English electronic health records, In: Cancer epidemiology94102715 Elsevier LtdDOI: 10.1016/j.canep.2024.102715Primary care data in the UK are widely used for cancer research, but the reliability of recording key events like diagnoses remains uncertain. Although data linkage can improve reliability, its costs, time requirements, and sample size constraints may discourage its use. We evaluated accuracy, completeness, and date concordance of prostate cancer (PCa) diagnosis recording in Clinical Practice Research Datalink (CPRD) GOLD and Aurum compared to linked Cancer Registry (CR) and Hospital Episode Statistics (HES)",
  "content_length": 91087,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:56"
}