{
  "name": "Soumajit Pramanik",
  "homepage": "https://www.iitbhilai.ac.in/index.php?pid=soumajit",
  "status": "success",
  "content": "Dr. Soumajit Pramanik IIT Bhilai administration@iitbhilai.ac.in हिन्दी English A- A A+ Home Academic DepartmentsDepartment of Computer Science and EngineeringCSE Faculty Dr. Soumajit Pramanik Dr. Soumajit Pramanik Assistant Professor Office: B-010 Electrical Engineering and Computer Science Indian Institute of Technology (IIT), Bhilai soumajit[AT]iitbhilai.ac.in Research Interest Information Retrieval, Machine Learning, Complex Networks, Social Computing Academic Background Ph.D, Department of CSE, IIT Kharagpur (2013 - 2019) M.Tech, Department of CS, ISI, Kolkata (2011 - 2013) B.Tech, Department of CSE, St. Thomas' College of Engg. and Tech. (2007 - 2011) Professional Experience Assistant Professor, IIT Bhilai (Aug 2020 - Present) Postdoctoral Fellow, Max Planck Institute for Informatics, Saarbrucken (July 2019 - July 2020) Research Fellow, Max Planck Institute for Informatics, Saarbrucken (Nov 2018 - June 2019) Teaching CS200: Software Tools & Technologies Lab II: Dept. of EECS, IIT Bhilai, Winter'2020. [Jointly with Dr. Dhiman Saha] DS501: Information Retrieval: Dept. of EECS, IIT Bhilai, Winter'2021. CS102: Data Structures: Dept. of EECS, IIT Bhilai, Winter'2021 and Monsoon'2021. IC100: Introduction to Programming: Dept. of EECS, IIT Bhilai, Summer'2021. DS200: Architecture for Management of Large Datasets: Dept. of EECS, IIT Bhilai, Monsoon'2021. [jointly with Dr. Gagan Raj Gupta and Dr. Subhajit Siddhanta] DS501: Information Retrieval: Dept. of EECS, IIT Bhilai, Winter'2022. Selected Publications [Google Scholar] Zhen Jia, Soumajit Pramanik, Rishiraj Saha Roy and Gerhard Weikum, \"Complex Temporal Question Answering on Knowledge Graphs\", The 30th ACM International Conference on Information and Knowledge Management (CIKM), November 1-5, 2021 (To be held online). [Preprint] [Data+Demo] [Code] [Slides] [Video] [Poster] Ayan Kumar Bhowmick, Soumajit Pramanik, Sayan Pathak and Bivas Mitra, \"On the Role of Micro-categories to Characterize Event Popularity in Meetup\", The 15th International AAAI Conference On Web And Social Media (ICWSM), June 7-10, 2021 (held online). Azin Ghazimatin, Soumajit Pramanik, Rishiraj Saha Roy and Gerhard Weikum, \"ELIXIR: Learning from User Feedback on Explanations to Improve Recommender Models\", The 30th Web Conference (WWW), April 19-23, 2021 (held online). [Preprint] [Data+Code] [Slides] [Video] Ayan Kumar Bhowmick, Soumajit Pramanik, Sayan Pathak and Bivas Mitra, \"On the Splitting Dynamics of Meetup Social Groups\", The 14th International AAAI Conference On Web And Social Media (ICWSM), Atlanta, Georgia, USA, June 8-11, 2020. Xiaolu Lu, Soumajit Pramanik, Rishiraj Saha Roy, Abdalghani Abujabal, Yafang Wang and Gerhard Weikum, Answering Complex Questions by Joining Multi-Document Evidence with Quasi Knowledge Graphs, The 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR), Paris, France, July 21-25, 2019. [Code+Data] [Demo] [Amazon Blog] [Preprint] [Video] Soumajit Pramanik, Rajarshi Haldar, Anand Kumar, Sayan Pathak and Bivas Mitra, \"Deep Learning driven Venue Recommender for Event-based Social Networks\", Transactions on Knowledge and Data Engineering (TKDE), IEEE, April, 2019. Soumajit Pramanik, Surya Teja Gora, Ravi Sundaram, Niloy Ganguly and Bivas Mitra, \"On the Migration of Researchers across Scientific Domains\", The 13th International AAAI Conference On Web And Social Media (ICWSM), Munich, Germany, June 11-14, 2019. Soumajit Pramanik, Mohit Sharma, Maximilien Danisch, Qinna Wang, Jean-Loup Guillaume and Bivas Mitra, \"Easy-Mention: A model driven mention recommendation heuristic to boost your tweet popularity\", International Journal of Data Science and Analytics (JDSA), Springer, March, 2018. Soumajit Pramanik, Raphael Tackx, Anchit Navelkar, Jean-Loup Guillaume and Bivas Mitra, \"Discovering Community Structure in Multilayer Networks\", The 4th IEEE International Conference on Data Science and Advanced Analytics (DSAA), Tokyo, Japan, October 19-21, 2017. Soumajit Pramanik, Qinna Wang, Maximilien Danisch, Jean-Loup Guillaume and Bivas Mitra, \"Modeling Cascade Formation in Twitter amidst Mentions and Retweets\", Journal of Social Network Analysis and Mining (SNAM), Springer, August, 2017. Soumajit Pramanik, Maximilien Danisch, Qinna Wang, Sumanth Bandi, Anand Kumar, Jean-Loup Guillaume and Bivas Mitra, \"On the Role of Mentions on Tweet Virality\", The 3rd IEEE Data Science and Advanced Analytics (DSAA), Montreal, Canada, October 17-19, 2016. Soumajit Pramanik, Midhun Gundapuneni, Sayan Pathak and Bivas Mitra, \"Can I Foresee the Success of My Meetup group?\", IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM), San Francisco, CA, USA, August 18-21, 2016. Soumajit Pramanik, Midhun Gundapuneni, Sayan Pathak and Bivas Mitra, \"Predicting Group Success in Meetup\", The 10th International AAAI Conference On Web And Social Media (ICWSM), Cologne, Germany, May 17-20, 2016. (Short Paper) Awards Awarded SAP Labs India Doctoral Fellowship [July 2014 - June 2017]. Awarded Travel grants to attend CODS 2015 (from conference organizers), ICWSM 2016 (from conference organizers), ASONAM 2016 (from Microsoft Corporation), DSAA 2017 (from IEEE CIS), ICWSM 2019 (from conference organizers). Ranked 2nd in M.Tech. at ISI, Kolkata. Joint winner of the \"TCS Best Student Project Award\" in M.Tech. at ISI, Kolkata. Ranked 209th in GATE 2011 (Graduate Aptitude Test in Engineering 2011), conducted by IIT Madras. Related CSE Faculty Members Navigation Academics Administration Admissions Departments Institute Facilities Research and Development Faculty and Staff Prospective Faculty Prospective Staff Student Prospective Students Campus Media NIRF Report Contact Us Message From Director I am pleased to extend my greetings to students and their parents as well as colleagues near and far. IIT Bhilai was established on 7 August 2016. We are located in Chhattisgarh, the rice bowl of India, in a state rich in natural resources as well as cultural memory and heritage.\t\t\t\t\t\t\t\t\t Read More Institute All Stories Profile of IIT Bhilai Intranet OBC Cell Anti-Ragging Student Grievance Redressal AIMS Portal RTI Information Gallery Sitemap Polaris Directory Scholarships and Awards Newsletter Subscribe to our Newsletter and stay tuned. Subscribe Now! Copyright © 2017 - All Rights Reserved - IIT Bhilai",
  "content_length": 6390,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:57"
}