{
  "name": "Soumaya Cherkaoui",
  "homepage": "https://www.polymtl.ca/expertises/en/cherkaoui-soumaya",
  "status": "success",
  "content": "Cherkaoui, Soumaya | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Cherkaoui, Soumaya Poly Directory Courses Français Directory of Experts Cherkaoui, Soumaya Directory of Experts Back to search results Edit my profileHelp Publications Link(s) Soumaya Cherkaoui Publications Link(s) Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 4037 Fax: (514) 340-5139 Room: M-4109 soumaya.cherkaoui@polymtl.ca Areas of expertise Communications networks Artificial intelligence Information technology Student research project(s) I am recruiting Research interests and affiliations Research interests Convergence of communications and artifical intelligence, Quantum Computing and Machine Learning,  Quantum Communications,  Frugal edge intelligence and applications (e.g., autonomous vehicles, smart grid, IoT, industrial IoT). Affiliation(s) Institute for Data Valorization (IVADO), Member Interuniversity Research Centre on Enterprise Networks, Logistics and Transportation (CIRRELT), Member Mobile Computing and Networking Research Laboratory (LARIM), Member Expertise type(s) (NSERC subjects) 2508 Communications networks 2800 ARTIFICIAL INTELLIGENCE (Computer Vision, use 2603) 2700 INFORMATION TECHNOLOGY Publications Recent publications Journal article Naguib, K. M., Cherkaoui, S., Elmessalawy, M. M., El-Haleem, A. M. A., & Ibrahim, I. I. (2025). DRL-Driven Edge-Aware Utility Optimization for Multi-Slice 6G Networks. IEEE Networking Letters, 5 pages. Conference paper Tashman, D., & Cherkaoui, S. (2025, February). Dynamic Synergy: Leveraging RIS and Reinforcement Learning for Secure, Adaptive Underlay Cognitive Radio Networks [Paper]. Global Information Infrastructure and Networking Symposium (GIIS 2025), Dubai, United Arab Emirates. Conference paper El Hammami, W., Cherkaoui, S., & Wang, S. (2025, May). Enhancing Network Anomaly Detection with Quantum GANs and Successive Data Injection for Multivariate Time Series [Paper]. International Wireless Communications and Mobile Computing (IWCMC 2025), Abu Dhabi, United Arab Emirates. Conference paper Keyela, P., & Cherkaoui, S. (2025, February). Open RAN Slicing with Quantum Optimization [Paper]. Global Information Infrastructure and Networking Symposium (GIIS 2025), Dubai, United Arab Emirates. See all publications (205) Biography Pr. Soumaya Cherkaoui is a full professor in the Computer and Software Engineering departement at Polytechnique Montréal, where she leads the Lincs Lab.  The research and teaching interests of  Prof. Soumaya Cherkaoui focus on the convergence of artificial intelligence and communications, quantum computing and artificial intelligence, quantum communications, and frugal intelligence at the network edge for verticals such as connected and autonomous cars, IoT and industrial IoT. Prior to joining Polytechnique Montréal, Pr. Cherkaoui she held the position of Full Professor at Université de Sherbrooke.  Before joining academia as a professor in 1999, she worked in industry as an aerospace project manager. Prof. Cherkaoui has held several invited visiting positions including at the  University of California at Berkeley. Bell Laboratories, Monash University, and the University of Toronto, as well as an adjunct position at Lulea University, in Sweden. Prof. Cherkaoui has published over 200 research articles in reputed journals and conferences, and her research has led to transfers to industry and patented technologies. She has served on numerous national and international scientific committees and pannels. She was appointed member of the Board of Directors of the Canadian Network of Centres of Excellence Auto21, member of the MITACS Research Council (2017-2022), and member emeritus of the MITACS Scientific Advisory Board (2023-).  She has been associate editor of several IEEE, Wiley and Elsevier journals, including IET Quantum Communication, IEEE Systems, IEEE Journal on Selected Areas in Communications, and IEEE Network where she has also been Column Editor. Pr. Cherkaoui has chaired prestigious conferences such as IEEE LCN 2019, and has chaired or co-chaired technical committees for major conferences such as IEEE ICC2025 , as well as symposia for renowned conferences such as IEEE ICC 2021,  IEEE ICC 2018, IEEE Globecom 2018, IEEE Globecom 2015, IEEE ICC 2014, and IEEE PIMRC 2011.  She was the Chair of  the IEEE Communications Society IoT-Ad hoc and Sensor Networks Technical Committe 2020-2022, and is Advisor for the IEEE Communications Society SIG- IoT Tactile Internet. The work Pr. Cherkaoui has been recognized with honors and best paper awards, including at IEEE ICC 2017, IEEE LCN 2021 and ICCSPA 2024. Pr. Cherkaoui was awareded the title of  IEEE Communication Society Distinguished Lecturer in 2020. She is the recipient of the ACM Mirela Notare Award (2023), as well as the IEEE Bio-Inspired Computing STC Leadership Award (2023). She was named Star by the N2Women: Stars in Networking and Communications in 2023. Prof. Cherkaoui is an engineer in Quebec, Canada. Teaching Supervision at Polytechnique COMPLETED Master's Thesis (3) Hamhoum, W. (2024). Détection d'anomalies dans les réseaux véhiculaires en utilisant un LLM [Master's thesis, Polytechnique Montréal]. Kalfon, B. (2024). Réalisation d'un GAN quantique adapté à la détection d'anomalies pour les séries temporelles issues de données réseau [Master's thesis, Polytechnique Montréal]. Quéméneur, C. (2024). Méthodes d'apprentissage fédéré pour la détection d'objets en temps réel dans l'internet des véhicules [Master's thesis, Polytechnique Montréal]. News about Soumaya Cherkaoui NEWS | January 21, 2025 $6 million for quantum projects at Polytechnique Montréal | Read NEWS | September 23, 2022 Research projects of seven Polytechnique Montréal faculty members backed by the CFI and the Québec government | Read Press review about Soumaya Cherkaoui June 15, 2025, Revue « Plan », Informatique quantique : à la conquête de ses mystères Soumaya Cherkaoui, professeure titulaire au Département de génie informatique et génie logiciel, parle des défis et des promesses de l'informatique quantique (page 92). September 17, 2024, ICI Télé, La facture | La question de la semaine sur la fin du réseau 3G Soumaya Cherkaoui, professeure au Département de génie informatique et génie logiciel, explique que la 3G est une technologie cellulaire devenue désuète avec l'apparition de la 4G et de la 5G, et que les bandes de fréquences 3G peuvent s'adapter sur les réseaux plus rapides. Propective StudentStudent ZoneEmployee ZoneMediaFondation & AlumniEmergencyJobs Offers Studies Studies (Registrar)Programs of StudiesSchedule and Courses DirectoryLibraryDepartmentsFinancial Assistance & Bursaries*Technical Societies*Internships & JobsOffice of Student Affairs*Go-Poly Research General Informations*Directory of ExpertsChairs, Groups & LaboratoriesResearch Projects for Graduate Students Company Hiring an Intern or a GraduateAcquiring a TechnologyConducting Partnered Research*Accessing our Research Infrastructure#Develop your Employees About Us General InformationsOfficial DocumentsInternationalWomen & EngineeringSustainable Development*Propolys (Entrepreneuship Support)*GouvernanceDirectories & ServicesPrivacy Notice and Terms of useAccessibilityContact Information & Campus Maps 2500, chemin de Polytechnique Montréal (Québec) H3T 1J4 (514) 340-4711 Follow us! Make a donation",
  "content_length": 8049,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:58"
}