{
  "name": "Soumya Dutta",
  "homepage": "https://soumyadutta-cse.github.io",
  "status": "success",
  "content": "Soumya Dutta, Ph.D. Soumya DuttaAssistant Professor of Computer Science & Engg. at IIT Kanpur Email: soumyad [at] cse [dot] iitk [dot] ac [dot] in Follow Kanpur, Uttar Pradesh, India ResearchGate Twitter LinkedIn Google Scholar ORCID Soumya Dutta is an Assistant Professor in the Department of Computer Science and Engineering (CSE) at the Indian Institute of Technology, Kanpur (IITK). Soumya obtained his Ph.D. degree in Computer Science and Engineering from the Ohio State University in May 2018 where he was part of the GRAVITY research group. After his doctoral studies, Soumya worked as a postdoctoral researcher at the Applied Computer Sciences group (CCS-7) of Los Alamos National Laboratory (LANL) from June 2018-July 2019. Then he was converted to a full-time scientist in the Information Sciences group (CCS-3) at LANL where he worked from July 2019 - August 2022. For more details, please take a look at Soumya's CV. Dr. Dutta's current research interests include: (1) Machine Learning, (2) Visual Computing and Image Analysis, (3) Data Science and Big Data, (4) Data Visualization & Visual Analytics, (5) Machine Learning for Scientific Computing, (6) Explainable, Interpretable, & Trustworthy AI ** Open PhD/MS positions for ML/DL + Visual Computing + Big Data + HPC Research ** There are open positions for PhD/MS students to conduct exciting reserach on Machine learning and Deep learning with applications in visual computing, image analysis, data analysis and visualization. If you want to pursue your thesis with me, please email me at 'soumyad [at] cse [dot] iitk [dot] ac [dot] in' or meet me in my office @KD-224. Please click here or check the Openings page for more details. EducationDoctor of Philosophy (Ph.D.) and Master of Science (M.S.) (2011-2018)Computer Science and Engineering (CSE), The Ohio State University, USABachelor of Technology (B. Tech.) (2005-2009)Electronics and Communication Engineering (ECE), West Bengal University of Technology, IndiaExperienceIndian Institute of Technology, KanpurAssistant Professor of Computer Science and Engineering (Oct. 2022 - Present)Los Alamos National LaboratoryScientist II (Jul. 2019 - Aug. 2022)Postdoctoral Research Associate under Dr. James Ahrens and Dr. Roxana Bujack (Jun. 2018 - Jul. 2019)Graduate Summer Intern (May - Jul. 2015; May - Aug. 2016; May-Aug. 2017)The Ohio State UniversityGraduate Research Associate (GRA) under Prof. Han-Wei Shen (Aug. 2013 - May 2018)Heritage Institute of TechnologyIndependent Researcher under Prof. Madhurima Chattopadhyay (Nov. 2010-May 2011)Indian Statistical InstituteIndependent Student Researcher under Prof. Bidyut B. Chaudhuri (Dec. 2008 - Sep. 2009)Awards (Selected)Jan 2022: Best Reviewer, Honorary Mention Award for the journal IEEE Transactions on Visualization & Computer Graphics (TVCG), 2021.Nov 2021: Best Paper Award at ISAV 2021, co-located with Supercomputing (SC).Sep 2021: LAAP Award at Los Alamos National Laboratory.Jun 2019: Best Paper Award at TopoInVis 2019.Nov 2018: Best Paper Award at ISAV 2018, co-located with Supercomputing (SC).Mar 2018: Best Poster Award in 12th Annual CSE Student Poster Exhibition, The Ohio State University.May 2017: Best Poster Award in 11th Annual CSE Student Poster Exhibition, The Ohio State University.Aug 2016: Best Paper Honorable Mention Award at IEEE Visualization Conference (IEEE VIS) 2016.",
  "content_length": 3375,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:56"
}