{
  "name": "Sourabh Bhattacharya",
  "homepage": "https://www.cs.iastate.edu/people/sourabh-bhattacharya",
  "status": "success",
  "content": "Sourabh Bhattacharya | Department of Computer Science Skip to main content Sourabh Bhattacharya Position Graduate Faculty in Computer Science Courtesy Associate Professor Contact Email sbhattac@iastate.edu Social Media and Websites https://web.me.iastate.edu/sbhattac/ Research Area AI, ML, and Data Science Robotics and Autonomous Systems Education Ph.D., Electrical and Computer Engineering, University of Illinois, Urbana-Champaign, 9/2005-7/2010 M.S., Applied Mathematics, University of Illinois, Urbana-Champaign, 7/2009. M.S.E.E., University of Illinois, Urbana-Champaign, 7/2002-7/2005. B. Tech., Indian Institute of Technology, Bombay, 7/1998-7/2002. Interest Areas Robotics Motion Planning Publications Rui Zou and Sourabh Bhattacharya. “Visibility-Based Finite-Horizon Target Tracking Game.” IEEE Robotics and Automation Letters, 1 (1), 399-406, 2016. Mengzhe Zhang and Sourabh Bhattacharya. “Multi-agent Visibility Based Target Tracking Game.” Springer Tracts in Advanced Robotics, Distributed Autonomous Robotic Systems, 271-284, 2016. Sourabh Bhattacharya. Ali Khanafer and Tamer Başar. “A Double-Sided Jamming Game with Resource Constraints.” Annals of Dynamic Games, Birkhauser, Vol 14, 209-227, 2016. Rui Zou and Sourabh Bhattacharya. “Particle Swarm Optimization-Based Source Seeking.” IEEE Transactions on Automation Science and Engineering, 12(3):865-875, November 2015. Sourabh Bhattacharya, Tamer Başar and N. Hovakimyan. “On the Construction of Barrier in Visibility Based Pursuit Evasion Game.” Journal of Optimization Theory and Applications, Note: Under revision. Sourabh Bhattacharya, A. Khanafer and Tamer Başar. “Multi-Level Hierarchical Games in Double-sided Jamming among Mobile Networks.” IEEE Transactions on Mobile Computing, Note: Under review. G. Warnell, Sourabh Bhattacharya, R. Chellappa and Tamer Başar. “Compressive Sensing with Side Information.” IEEE Transactions on Image Processing, 24(11), 3846-3857, 2015. Sourabh Bhattacharya, Abhishek Gupta and Tamer Başar. “Jamming in mobile networks: A game-theoretic approach.” Journal of Numerical Algebra, Control and Optimization, 3(1):1-30, March 2013. Sourabh Bhattacharya and Tamer Başar. “Spatial Approaches to Broadband Jamming in Heterogeneous Mobile Networks: A Game-Theoretic Approach.” Search and Pursuit-Evasion, Autonomous Robots, 31(4):367-381, November, 2011. Sourabh Bhattacharya and Seth Hutchinson. “A Cell Decomposition Approach to Visibility-Based Pursuit Evasion among Obstacles.” International Journal of Robotics Research, 30(14):,1709-1727 December, 2011. Sourabh Bhattacharya and Seth Hutchinson. “On the existence of Nash Equilibrium for a visibility based pursuit evasion game.” International Journal of Robotics Research, pg 831-839, 29(7), June, 2010. Sourabh Bhattacharya, Rafael Murrieta-Cid and Seth Hutchinson. “Optimal Paths for Landmark-based Navigation by Differential Drive Vehicles with Field-of-View Constraints.” IEEE Transactions on Robotics, 23(1):47-59, 2007. R. Murrieta-Cid, T. Muppirala, A. Sarmiento, S. Bhattacharya, and S. Hutchinson. “Surveillance Strategies for a Pursuer with Finite Sensor Range.” Int’l Journal of Robotics Research, 26(3):233-253, 2007. G. Lopez-Nicolas, N. R. Gans, S. Bhattacharya, C. Sagues, J.J. Guerrero and S. Hutchinson. “An Optimal Homography-Based Control Scheme for Mobile Robots with Nonholonomic and Field-of-View Constraints.” IEEE Transactions on Systems, Man and Cybernetics, 1115 – 1127, Part B: Cybernetics,40(4), August, 2010",
  "content_length": 3499,
  "method": "requests",
  "crawl_time": "2025-12-01 14:29:59"
}