{
  "name": "Sourav Medya",
  "homepage": "https://souravmedya.github.io",
  "status": "success",
  "content": "Sourav Medya Sourav Medya Home Research Teaching Team Service Sourav Medya Sourav Medya Assistant Professor Department of Computer Science University of Illinois at Chicago (UIC) Email: medya at uic dot edu Email: sourav dot medya at gmail dot com Home My research focuses on the problems at the intersection of graphs, machine learning, and data science with a focus on bias, fairness, and interpretability. I also build machine learning based techniques that have high impact in the areas such as healthcare, infrastructure, and computational social science. Before joining UIC, I was a research assistant professor in the Kellogg School of Management at Northwestern University and the Northwestern Institute on Complex Systems (NICO). I received my Ph.D in Computer Science from University of California, Santa Barbara. I got my Master of Engineering degree in Computer Science and Automation Department from Indian Institute of Science (IISc), Bangalore, India. Recent Publications Full list of publications is here! Machine Learning (GNNs, Graphs, Explainable AI) Gregoire Fournier, Sourav Medya COMRECGC: Global Graph Counterfactual Explainer through Common Recourse International Conference on Machine Learning (ICML), 2025 Fangxin Wang, Kay Liu, Sourav Medya, Philip S. Yu BANGS: Game-theoretic Node Selection for Graph Self-Training International Conference on Learning Representations (ICLR), 2025 Burouj Armgaan, Manthan Dalmia, Sourav Medya, Sayan Ranu GraphTrail: Translating GNN Predictions into Human-Interpretable Logical Rules Thirty-eighth Conference on Neural Information Processing Systems (NeurIPS), 2024 Applications Rochana Chaturvedi, Peyman Baghershahi, Sourav Medya, Barbara Di Eugenio Temporal Relation Extraction in Clinical Texts: A Span-based Graph Transformer Approach The 63rd Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Brian Wilk, Homaira Huda Shomee, Suman Kalyan Maity, Sourav Medya Fact-based Counter Narrative Generation to Combat Hate Speech The Web Conference (WWW), 2025 Homaira Huda Shomee, Zhu Wang, Sathya N. Ravi, Sourav Medya IMPACT: A Large-scale Integrated Multimodal Patent Analysis and Creation Dataset for Design Patents Thirty-eighth Conference on Neural Information Processing Systems (NeurIPS), 2024 Page generated 2019-01-08 08:20:06 PST, by jemdoc.",
  "content_length": 2337,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:01"
}