{
  "name": "Sourav Chakraborty 0001",
  "homepage": "https://www.isical.ac.in/~sourav",
  "status": "success",
  "content": "Sourav Chakraborty Sourav Chakraborty I am a Professor in the Advanced Computing and Microelectronics Unit (ACMU) of the Computer and Communication Sciences Division (CCSD) at the Indian Statistical Institute (ISI) , Kolkata, India. Before joining ISI on July 2018 I was a faculty member at Chennai Mathematical Institute , India, from September 2010. Before that I was a postdoc at the Algorithms and Complexity department of Centrum Wiskunde & Informatica (CWI) , Amsterdam, Netherlands from September 2009 to August 2010. From October 2008 to August 2009 I was a postdoc at the Computer Science Department of Technion , Israel. In June 2008 I finished my Phd in Computer Science from University of Chicago under the supervision of Prof. László Babai . I received my Master's degree in Computer Science in March 2005 from University of Chicago and my Bachelor's degree in Mathematics in August 2003 from Chennai Mathematical Institute, India. Contact Information: Advanced Computing and Microelectronics Unit, 6th floor, Platinum Jubliee Auditorium (PJA) Building, Indian Statistical Institute (ISI) 203 Barrackpore Trunk Road, Kolkata - 700108 West Bengal, India Phone No.   +091-8939219122 Email:  sourav at isical.ac.in Fun Webpage: [click here] My field of research is Theoretical Computer Science. My focus has been in the classical and quantum complexity of Boolean functions (including property testing, sensitivity and block sensitivity of Boolean functions and quantum database search), in electronic commerce, in graph algorithms and in coding theory. My Curriculum Vitae [ps], [pdf]. My complete list of papers can be found in my \"Publications Page\". The list of my courses and the links to the course course webpages can be found in my \"Course Page\". SOME HONORS I HAVE RECEIVED: - Our work on Streaming caught the attention and got the praise of Donald E. Knuth. [The article] - Our work on Conditional Sampling and our work on Huge-Object Model got into the Oded Goldreich's \"my choices\" list. - The function I discovered in my early work on Sensitivity Conjecture has been given my name.",
  "content_length": 2108,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:02"
}