{
  "name": "Sourangshu Bhattacharya",
  "homepage": "http://cse.iitkgp.ac.in/~sourangshu",
  "status": "success",
  "content": "Sourangshu Bhattacharya's Homepage Sourangshu Bhattacharya ... somewhere something incredible is waiting to be known. Biosketch and Research Interests Current Position: Associate Professor, Computer Science and Engineering, IIT Kharagpur. Before joining IIT Kharagpur, I was a Scientist at Yahoo! Labs Bangalore, and a visiting scholar at the Helsinki University of Technology. I have a Ph.D. in Computer Science from Indian Insitute of Science, Bangalore , and M.Tech. in Computer Science from I.S.I. Kolkata and a B.Tech. from I.I.T. Roorkee . I am broadly interested in Machine Learning, with specific interests in Explainability and Data-centric AI, Multi-task Learning, Learning with Temporal Point Processes, Network Representation Learning, and Scalable Machine Learning. I have applied these techniques on problems in Computer Vision, Information Extraction, Opinion Dynamics and Sentiment Analysis, Computational Advertising, Health Informatics, Natural Language Processing, Web and Online Social Networks. Students seeking to work with me: I am looking for bright students interested in doing full-time PhD. Please email me. Unfortunately I am not able to reply to each student seeking internship positions individually. Updates Autumn 2025: Offering Scalable Data Mining (Course webpage) and Programming and Data Structures Laboratory New paper: Accepted in ICML 2025 Title: Sample Efficient Demonstration Selection for In-Context Learning Authors: Kiran Purohit, Venktesh V, Sourangshu Bhattacharya, Avishek Anand Github repository: link Spring 2025: Offering Machine Learning (Course webpage) and Programming and Data Structures Laboratory New paper: Accepted in IEEE Transactions on Artificial Intelligence (TAI) Title: CheckSelect: Online Checkpoint Selection for Flexible, Accurate, Robust, and Efficient Data Valuation Authors: Soumi Das , Manasvi Sagarkar , Suparna Bhattacharya , and Sourangshu Bhattacharya New paper: Accepted at EMNLP 2024 Title: EXPLORA: Efficient Exemplar Subset Selection for Complex Reasoning Authors: Kiran Purohit, Venktesh V., Raghuram Devalla, Krishna Mohan Yerragorla, Sourangshu Bhattacharya, Avishek Anand New paper: Accepted at TMLR Title: A Greedy Hierarchical Approach to Whole-Network Filter- Pruning in CNNs Authors: Kiran Purohit, Anurag Reddy Parvathgari, and Sourangshu Bhattacharya New paper: Accepted at ECAI 2024 Title: A Data-Driven Defense against Edge-case Model Poisoning Attacks on Federated Learning. Authors: Kiran Purohit, Soumi Das, Sourangshu Bhattacharya, and Santu Rana. We have an open research fellow position in our group. The candidate should be academically strong with a desire to publish in top venues in ML, e.g. Neurips, ICML, ICLR, etc. Link Offering Scalable Data Mining (Course webpage) and Advanced Machine Learning jointly with Prof. Pabitra Mitra. New paper: VTruST: Controllable value function based subset selection for Data-Centric Trustworthy AI. Soumi Das, Shubhadip Nag, Shreyyash Sharma, Suparna Bhattacharya, Sourangshu Bhattacharya Accepted in ICLR 2024 DMLR workshop Link Courses this semester (Spring 2024): Software Engineering Theory and Laboratory with Prof. Abir Das and Prof. Debasis Samanta. Offering this semester (Autumn 2023): Scalable Data Mining, and Programming and Data Structures New Preprint: Our new paper on Data-driven defense: LearnDefend: Learning to Defend against Targeted Model-Poisoning Attacks on Federated Learning. Kiran Purohit, Soumi Das, Sourangshu Bhattacharya, and Santu Rana. at https://arxiv.org/abs/2305.02022 New paper: Accurate and Efficient Channel pruning via Orthogonal Matching Pursuit. Kiran Purohit, Anurag Parvathgari, Soumi Das, and Sourangshu Bhattacharya. In Proceedings of the Second International Conference on AI-ML Systems, pp. 1-8. 2022. Link New Preprint: Checkout our latest paper on CheckSel: Efficient and Accurate Data-valuation Through Online Checkpoint Selection, authors: Soumi Das, Manasvi Sagarkar, Suparna Bhattacharya, Sourangshu Bhattacharya, at: https://arxiv.org/abs/2203.06814 Paper and code release: AR-BERT: Aspect-relation enhanced Aspect-level Sentiment Classification with Multi-modal Explanations. Sk Mainul Islam and Sourangshu Bhattacharya TheWebConf 2022. Paper link Code available at: https://github.com/mainuliitkgp/AR-BERT.git Paper acceptance: TMCOSS: Thresholded Multi-Criteria Online Subset Selection for Data-Efficient Autonomous Driving. Soumi Das, Harikrishna Patibandla, Suparna Bhattacharya, Kshounis Bera, Niloy Ganguly, and Sourangshu Bhattacharya. ICCV 2021. Paper link Paper acceptance: Finding High-Value Training Data Subset through Differentiable Convex Programming. Soumi Das, Arshdeep Singh, Saptarshi Chatterjee, Suparna Bhattacharya, and Sourangshu Bhattacharya. ECML 2021 Paper Link",
  "content_length": 4780,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:04"
}