{
  "name": "Sourav Kumar Mukhopadhyay",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=SOMUKHOPADHYAY",
  "status": "success",
  "content": "Sourav Mukhopadhyay - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Sourav Mukhopadhyay Assistant Professor Sourav Mukhopadhyay Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber Sciences BioSourav Kumar Mukhopadhyay has been an Assistant Professor in the School of Computer & Cyber Sciences at Augusta University since January 2025. Before joining Augusta University, he worked as a Research Associate and Postdoctoral Fellow at Toronto Metropolitan University and Concordia University in Canada. He earned his Ph.D. in Applied Physics from the University of Calcutta, Kolkata, India, in 2015.His area of research includes biomedical signal processing, application of machine learning, artificial intelligence and deep learning techniques in monitoring vital signs as well as early diagnosis of physiological anomalies. His long-term professional goal is to continue to extend the boundaries of biomedical signal processing, in association with industries and clinicians, towards creating innovative and applicable solutions for the healthcare industry.Feel free to connect him to discuss research, possibilities of collaboration, or insights into the future of biomedical engineering and signal processing.somukhopadhyay@augusta.edu SOMUKHOPADHYAY@augusta.edu (706) 667-4662 100 Grace Hopper Lane, Augusta, GA, 30901, RV1 -2818 Personal Website General Credentials Instruction Scholarship Service Education Ph.D., Instrumentation Technology/Tec University of Calcutta, 2015 MS, Electrical and Electronics Eng University of Calcutta, 2007 BS, Electrical and Electronics Eng University of Calcutta, 2005 Awards & Honors Community Member Award Toronto Police Services Board, Canada, 2024 Second place award, 3rd IEEE Research Boost poster and demo competition for Graduate Students and Postdoctoral Fellows Concordia University, Montreal, Quebec, Canada., 2017 Regroupement stratégique en microsystèmes du Québec (ReSMiQ) scholarship for Postdoctoral research ReSMiQ, Montréal, Quebec, Canada., 2017 Best paper award, First Michael Faraday IET India Summit IET India, Kolkata, India, 2012 Senior Research Assistantship (SRA) scholarship under TEQIP Phase-II University of Calcutta, Kolkata, India, 2012 Courses Taught Most Recent Academic Year BMSE 1901 Intro to Biomed Sys Eng CSCI 8940 Dissertation Research Teaching Interests Biomedical signal processingBiomedical instrumentationArtificial intelligence, Machine Learning, Deep LearningDigital electronicsAnalog electronicsSemiconductor devicesC, MATLAB, PythonI love doing biomedical signal processing. I love it with passion, and it is my zeal. As a teacher I have the opportunity to present the recent trends of modern science and technology to the students in a very practical manner. I use this opportunity to create an awareness so as to encourage students to think critically, analytically and independently about science. Besides explaining the theory and the underlying mathematical backbone of a particular topic, I always try to explain the topic elaborately by taking examples of our daily lives. Once an atmosphere of interest is created, students become more open to learning. Scholarship Selected Recent Publications Quality-guaranteed steganographed-MECG signal compression using adaptive truncation of DCT and SVD coefficients and ASCII encoding, 2025 Journal Article, Academic Journal Single-Beat Myocardial Infarction Detection and Localization Using PSO-Optimized Extra Trees on 15-Lead ECG, 2025 Journal Article, Academic Journal Development of an Atrial Fibrillation Detection Algorithm for ECG Collected with Textile Garment, 2022 Journal Article, Academic Journal Robust Identification of the QRS-Complexes in Electrocardiogram Signals Using Ramanujan Filter Bank-Based Periodicity Estimation Technique, 2022 Journal Article, Academic Journal Visual saliency detection approach for long-term ECG analysis, 2022 Journal Article, Academic Journal Research Interests Biomedical signal/image analysisWearables/textile computingHuman and animal activity recognitionSaliency detection in biosignals and imagesMachine learning and AIBiometric applications Department Service Faculty Development Committee 2025 - Present Role: Committee Member AUFS Student Affairs Committee 2025 - Present Role: Committee Member Web Oversight Committee 2025 - Present Role: Committee Member Professional Service Circuits, Systems, and Signal Processing 2022 - Present Role: Editor, Associate Editor Biomedical Signal Processing and Control (Elsevier) 2020 - Present Role: Reviewer, Journal Article Computers in Biology and Medicine (Elsevier) 2020 - Present Role: Reviewer, Journal Article Expert Systems with Applications (Elsevier) 2020 - Present Role: Reviewer, Journal Article IEEE Transactions on Broadcasting 2020 - Present Role: Reviewer, Journal Article",
  "content_length": 4987,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:02"
}