{
  "name": "Sowmya Somanath",
  "homepage": "https://celab.cs.uvic.ca",
  "status": "success",
  "content": "Creative Experiences Lab Creative Experiences Lab Hello! My name is Sowmya Somanath. I am an Associate Professor in the Computer Science Department at the University of Victoria, Canada. I lead the Creative Experiences Lab, which broadly focuses on topics in the area of Human-Computer Interaction. This includes understanding people's needs, building new systems, and evaluating those systems through user studies. Creative Experiences Lab is part of the composite HCI and Information Visualization research group Victoria Interactive Experiences with Information (VIXI) Lab at UVic. Check us out! My current research is focused on designing and evaluating digital tools for fostering happiness in specific contexts such as knowledge work, and creative activities. I also do research on helping people engage in everyday forms of creativity (such as learning, developing DIY projects, and making decisions) using tangible mediums. Some of our ongoing and past projects include: Systems that help people reflect on what makes them happy when engaged in computer-based tasks Interactive systems that incorporate specific interaction techniques for building happiness when engaged in computer-based tasks Adaptive systems that demonstrate dynamically changing workflows for building happiness when engaged in computer-based tasks Tools for makers Studies and tools that address social acceptability of wearables (such as e-textile garments and healthcare wearables) Data physicalization techniques and tools Interfaces for communicating information through fabricated products, wearable mechanical limbs, and on-vehicle devices Current PhD Students: Sabrina Lakhdhir Bahare Bakhtiari Yichun Zhao Current MSc Students: Molly Stewart Soyun Lee Phaedra Berger Visiting Students and Undergraduate Research Assistants: Mingao Cai Ian Robinson Publications Please see: Google Scholar Contact I am always happy to chat about research and collaborations. Feel free to reach out!",
  "content_length": 1968,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:05"
}