{
  "name": "Spiros Mancoridis",
  "homepage": "http://drexel.edu/cci/contact/Faculty/Mancoridis-Spiros",
  "status": "success",
  "content": "Spiros Mancoridis | Drexel CCI Skip to main content Spiros MancoridisThe Auerbach Berger Chair in Cybersecurity Distinguished Professor of Computer ScienceComputer Science Emailspiros@drexel.eduWebsite(s)cs.drexel.edu/~mancors/Curriculum VitaeDownload PDF Spiros MancoridisThe Auerbach Berger Chair in Cybersecurity Distinguished Professor of Computer ScienceComputer ScienceBiographyDr. Mancoridis serves as the Auerbach Berger Endowed Chair in Cybersecurity and Distinguished Professor of computer science at the College of Computing & Informatics (CCI). He holds a BCSH in computer science from Acadia University and MSc and PhD degrees from the University of Toronto. He joined Drexel's faculty in 1996, has served as interim department head of the Department of Computer Science, and then as senior associate dean of CCI, and interim dean of CCI. He is the recipient of the National Science Foundation’s 1998 CAREER Award. He served as interim dean of CCI from July 2015 to August 2016. He is a member of the IEEE (senior member), ACM and SIGSOFT. He has authored or co-authored more than 70 refereed technical publications. In 2008, Mancoridis was recognized with an Outstanding Researcher Award from the College of Engineering. His expertise includes autonomic computing, software design and architecture, reverse engineering, software clustering, software visualization, software security, genetic algorithms and software engineering education. Research AreasComputer Security and PrivacyResearch InterestsSoftware Security, Network SecurityAcademic Distinctions 1996: PhD (Doctor of Philosophy in Computer Science) University of Toronto, Department of Computer Science. CV Select Publications Carter, S. Mancoridis, P. Protopapas. \"sysBERT: Improved Behavioral Malware Detection using BERT Trained on sys2vec Embeddings\", In the Proceedings of the 58th Hawaii International Conference on System Sciences, (HICSS'25), Hawaii, USA, January 2025. Brian S. Mitchell, Ansh Chandnani, J. Carter, D. Roumelioti, S. Mancoridis. \"Malware Detection in Cloud Native Enviroments\", In the Proceedings of the 7th Artificial Intelligence and Cloud Computing Conference (AICCC'24), Tokyo, Japan, December 2024. Galinkin, E. Pountourakis, S. Mancoridis. \"The Price of Pessimism for Automated Defense\", In the Springer Verlag Proceedings of the Conference on Game Theory and AI for Security (GameSec'24), New York, USA, October 2024. Galinkin, Emmanouil Poutourakis, J. Carter, S. Mancoridis. “Simulation of Attacker Defender Interaction in a Noisy Security Game” , In the Proceedings of the 37th AAAI Conference on Artificial Intelligence: Artificial Intelligence for Cybersecurity (AAAI-AICS’23), Washington DC, February 2023. Research Activities IoT Malware Detection; Cloud Native Malware Detection; Malware Mitigation and Automated Response Grant Awards 2024-2026: (PI: Weber, co-PI: Mancoridis), Title: FAA ASSURE A82, ($405,000 sponsor; $405,000 Drexel U match), A82 - Data Driven Framework to Inform Safety Risk Management (SRM) Mitigation Credit Estimates. 2023-2024: (PI: Stamm, co-PIs: Mancoridis, Kim, Xu, Gallagher, Zelenkauskaite), Drexel’s Area of Excellence & Opportunity (AEO) Pilot Funding Competition, ($50,000), Defending the Real: Protecting Against Emerging Generative AI Cybersecurity Threats. 2022-2024: (PI: Weber, co-PIs: Dandekar, Mancoridis), Grant #950048 Title: FAA ASSURE A58, ($608,783), Illustrate the Need for UAS Cybersecurity Oversight and Risk. Awards & Recognition 1997: NSF CAREER Award Professional Activities & Associations ACM; IEEE",
  "content_length": 3565,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:08"
}