{
  "name": "Spyridon Mastorakis",
  "homepage": "https://sites.google.com/site/spyridonmastorakis",
  "status": "success",
  "content": "Spyridon MastorakisSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome!Spyridon (Spyros) MastorakisPrincipal Researcher @ MicrosoftFor inquiries, please contact me on LinkedIn.IntroductionI am a Principal Researcher at Microsoft, working on AI systems. My academic background includes faculty positions in Computer Science and Engineering at the University of Notre Dame and in Computer Science at the University of Nebraska, where I directed research groups of 10+ members, including software engineering and research staff, postdocs, as well as graduate and undergraduate students. Throughout my academic career, I was awarded multiple grants from federal, state, foundation, and industry sources. I hold a Ph.D. and an M.Sc. in Computer Science from UCLA and an M.Eng. in Electrical and Computer Engineering from the National Technical University of Athens.Select Awards and Distinctions2024: Lucy Family Institute Faculty Fellow2023: IEEE TCSC (Technical Committee on Scalable Computing) Award for Excellence in Scalable Computing (Early Career Researcher) Awarded annually to up to five individuals around the world within 5 years of receiving their PhD degrees “who have made outstanding, influential, and potentially long-lasting contributions in the field of scalable computing”. The contribution statement reads “for contributions to scalable edge computing architectures”.2023: ORISE Faculty Fellow2022: National Strategic Research Institute (NSRI) Fellow2022: Best paper runner-up award, IEEE PerCom2021: National Science Foundation, CISE Research Initiation Initiative (CRII) awardClick here for a complete list.Research GroupSifat Ut Taki (Ph.D. student)Daniel Worae (Ph.D. student)Sheikh Samit Muhaimin (Ph.D. student)Xinye Zhao (Ph.D. student)Click here for more information.Recent Select Publications[Middleware '24] S. U. Taki* and S. Mastorakis, \"Amalgam: A Framework for Obfuscated Neural Network Training on the Cloud\", ACM/IFIP Middleware, 2024[SEC '24] S. U. Taki*, A. Padmanabhan, S. Mastorakis, \"FusedInf: Efficient Swapping of DNN Models for On-Demand Serverless Inference Services on the Edge\", IEEE/ACM Symposium on Edge Computing (SEC), 2024[PerCom '22] M.W. Al Azad and S. Mastorakis, \"Reservoir: Named Data for Pervasive Computation Reuse at the Network Edge\", IEEE International Conference on Pervasive Computing and Communications (PerCom), 2022 Best Paper Runner Up Award[INFOCOM '21] A. C. Nicolaescu, S. Mastorakis, I. Psaras, \"Store Edge Networked Data (SEND): A Data and Performance Driven Edge Storage Framework\", IEEE International Conference on Computer Communications (INFOCOM), 2021[ICDCS '20] S. Mastorakis, T. Li, L. Zhang, \"DAPES: Named Data for Off-the-Grid File Sharing with Peer-to-Peer Interactions\", IEEE International Conference on Distributed Computing Systems (ICDCS), 2020Click here for a complete list of publications.Select Service ActivitiesUniversity of Notre Dame representative, U.S. AI Safety Institute Consortium (housed under NIST)University of Notre Dame representative, AI Alliance (international coalition on AI with the participation of tech companies, startups, research and government organizations, universities, and non-profit foundations)Associate Editor, IEEE Internet of Things Journal (IoT-J)TPC Member, IEEE INFOCOM 2024, ICCCN 2024, and IEEE ICNP 2024, among other conferencesClick here for a complete list.TeachingCSE 30264 (University of Notre Dame): Computer Networks (Spring 2023, Spring 2024)CSE 60749 (University of Notre Dame): Advanced and Secure Networks (Fall 2023, Fall 2024)CSCI 3550 (University of Nebraska): Communication Networks (Fall 2020, Spring 2020, Spring 2021, Spring 2022)CSCI 8210 (University of Nebraska): Advanced Communication Networks (Fall 2019, Fall 2021)CIST 9080 (University of Nebraska): Research Directions in Information Technology (Fall 2022)Click here for more information.Research SponsorsGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3976,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:06"
}