{
  "name": "Spyridon Samothrakis",
  "homepage": "https://www.essex.ac.uk/people/samot88004/spyros-samothrakis",
  "status": "success",
  "content": "Spyros Samothrakis | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Spyros Samothrakis People Dr Spyros Samothrakis Chief Scientific Adviser and Senior Lecturer (R) School of Computer Science and Electronic Engineering (CSEE) Email ssamot@essex.ac.uk Location PARKSIDE BLOCK C2, Colchester Campus Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Qualifications 2014, PhD Computer Science,University of Essex 2007, MSc Intelligent Systems, University of Sussex 2003, BSc Computer Science, University of Sheffield Research and professional activities Research interests Reinforcement Learning Open to supervise Machine Learning Open to supervise Neural Networks Open to supervise Role Playing Games Open to supervise Teaching and supervision Current supervision David Barragan Alcantar Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Damian Machlanski Thesis title: Understanding Hyperparameters in Machine Learning for Causal Estimation From Observational Data Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 1/10/2024 Mahrad Pisheh Var Thesis title: Minimalistic Adaptive Dynamic-Programming Agents for Memory-Driven Exploration Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 20/6/2024 Husam Malek Zaki Quteineh Thesis title: Text Generation for Small Data Regimes Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 16/9/2022 Mohammed Ali A Alshahrani Thesis title: Exploring Embedding Vectors for Emotion Detection Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 16/11/2020 Umar Isyaku Abdullahi Degree subject: Advanced Computer Science Degree type: Master of Science Awarded date: 5/10/2016 Publications Publications (5) Samothrakis, S., Soemers, DJNJ. and Machlanski, D., (2024). Games of Knightian Uncertainty as AGI testbeds Soemers, DJNJ., Samothrakis, S., Driessens, K. and Winands, MHM., (2024). Environment Descriptions for Usability and Generalisation in Reinforcement Learning Machlanski, D., Samothrakis, S. and Clarke, P., (2023). Hyperparameter Tuning and Model Evaluation in Causal Effect Estimation Machlanski, D., Samothrakis, S. and Clarke, P., (2023). Robustness of Algorithms for Causal Structure Learning to Hyperparameter Choice Machlanski, D., Samothrakis, S. and Clarke, P., (2022). Undersmoothing Causal Estimators with Generative Trees Show all Journal articles (31) Fairbank, M., Prokhorov, D., Barragan-Alcantar, D., Samothrakis, S. and Li, S., (2025). Neurocontrol for Fixed-Length Trajectories in Environments with Soft Barriers. Neural Networks. 184, 107034-107034 Hughes, L., Dwivedi, YK., Malik, T., Shawosh, M., Albashrawi, MA., Jeon, I., Dutot, V., Appanderanda, M., Crick, T., De’, R., Fenwick, M., Gunaratnege, SM., Jurcys, P., Kar, AK., Kshetri, N., Li, K., Mutasa, S., Samothrakis, S., Wade, M. and Walton, P., (2025). AI Agents and Agentic Systems: A Multi-Expert Analysis. Journal of Computer Information Systems. 65 (4), 489-517 Samothrakis, S., (2024). Artificial intelligence and modern planned economies: a discussion on methods and institutions. AI and Society. 39 (6), 2961-2972 Batsis, A. and Samothrakis, S., (2024). Contextual reinforcement learning for supply chain management. Expert Systems with Applications. 249, 123541-123541 Long, GEM., Perez-Liebana, D. and Samothrakis, S., (2024). STEP: A Framework for Automated Point Cost Estimation. IEEE Transactions on Games. 16 (4), 927-936 Machlanski, D., Samothrakis, S. and Clarke, P., (2024). Undersmoothing Causal Estimators With Generative Trees. IEEE Access. 12, 38562-38574 Soemers, DJNJ., Samothrakis, S., Piette, É. and Stephenson, M., (2023). Extracting tactics learned from self-play in general games. Information Sciences. 624, 277-298 Pisheh Var, M., Fairbank, M. and Samothrakis, S., (2023). A Minimal “Functionally Sentient” Organism Trained with Backpropagation Through Time. Adaptive Behavior. 31 (6), 531-544 Lotun, S., Lamarche, V., Samothrakis, S., Sandstrom, G. and Matran-Fernandez, A., (2022). Parasocial relationships on YouTube reduce prejudice towards mental health issues. Scientific Reports. 12 (1), 16565- Hernandez, D., Denamganai, K., Devlin, S., Samothrakis, S. and Walker, JA., (2022). A Comparison of Self-Play Algorithms Under a Generalized Framework. IEEE Transactions on Games. 14 (2), 221-231 Fairbank, M., Samothrakis, S. and Citi, L., (2022). Deep Learning in Target Space. Journal of Machine Learning Research. 23, 1-46 Dwivedi, YK., Hughes, L., Ismagilova, E., Aarts, G., Coombs, C., Crick, T., Duan, Y., Dwivedi, R., Edwards, J., Eirug, A., Galanos, V., Ilavarasan, PV., Janssen, M., Jones, P., Kar, AK., Kizgin, H., Kronemann, B., Lal, B., Lucini, B., Medaglia, R., Le Meunier-FitzHugh, K., Le Meunier-FitzHugh, LC., Misra, S., Mogaji, E., Sharma, SK., Singh, JB., Raghavan, V., Raman, R., Rana, NP., Samothrakis, S., Spencer, J., Tamilmani, K., Tubadji, A., Walton, P. and Williams, MD., (2021). Artificial Intelligence (AI): Multidisciplinary perspectives on emerging challenges, opportunities, and agenda for research, practice and policy. International Journal of Information Management. 57, 101994-101994 Samothrakis, S., (2021). Artificial Intelligence inspired methods for the allocation of common goods and services.. PLoS One. 16 (9), e0257399-e0257399 Samothrakis, S., (2020). Open Loop In Natura Economic Planning. CoRR. abs/2005.01539 Salge, C., Short, E., Preuss, M., Samothrakis, S. and Spronck, P., (2020). Applications of Artificial Intelligence in Live Action Role-Playing Games (LARP). 2020 IEEE Conference on Games (CoG). 2020-August, 612-619 Hernández, D., Denamganaï, K., Devlin, S., Samothrakis, S. and Walker, JA., (2020). A Comparison of Self-Play Algorithms Under a Generalized Framework.. CoRR. abs/2006.04471 Samothrakis, S., (2018). Viewpoint: Artificial Intelligence and Labour. Proceedings of the Twenty-Seventh International Joint Conference on Artificial Intelligence. 2018-July, 5652-5655 Samothrakis, S., (2018). Kathryn E. Merrick: Computational models of motivation for game-playing agents: Springer, 2016, 213 pp, ISBN: 978-3-319-33457-8. Genetic Programming and Evolvable Machines. 19 (4), 567-568 Samothrakis, S., (2018). Kathryn E. Merrick: Computational models of motivation for game-playing agents - Springer, 2016, 213 pp, ISBN: 978-3-319-33457-8.. Genet. Program. Evolvable Mach.. 19, 567-568 Samothrakis, S., Fasli, M., Perez, D. and Lucas, S., (2017). Default policies for global optimisation of noisy functions with severe noise. Journal of Global Optimization. 67 (4), 893-907 Tom Vodopivec, Samothrakis, S. and Brank Ster, (2017). On monte carlo tree search and reinforcement learning. The Journal of Artificial Intelligence Research. 60, 881-936 Samothrakis, S., Perez, D., Lucas, SM. and Rohlfshagen, P., (2016). Predicting Dominance Rankings for Score-Based Games. IEEE Transactions on Computational Intelligence and AI in Games. 8 (1), 1-12 Perez-Liebana, D., Samothrakis, S., Togelius, J., Schaul, T., Lucas, SM., Couetoux, A., Lee, J., Lim, C-U. and Thompson, T., (2016). The 2014 General Video Game Playing Competition. IEEE Transactions on Computational Intelligence and AI in Games. 8 (3), 229-243 Perez, D., Mostaghim, S., Samothrakis, S. and Lucas, SM., (2015). Multiobjective Monte Carlo Tree Search for Real-Time Games. IEEE Transactions on Computational Intelligence and AI in Games. 7 (4), 347-360 Samothrakis, S. and Fasli, M., (2015). Emotional Sentence Annotation Helps Predict Fiction Genre. PLoS One. 10 (11), e0141922-e0141922 Perez, D., Powley, EJ., Whitehouse, D., Rohlfshagen, P., Samothrakis, S., Cowling, PI. and Lucas, SM., (2014). Solving the Physical Traveling Salesman Problem: Tree Search and Macro Actions. IEEE Transactions on Computational Intelligence and AI in Games. 6 (1), 31-45 Perez, D., Togelius, J., Samothrakis, S., Rohlfshagen, P. and Lucas, SM., (2014). Automated Map Generation for the Physical Traveling Salesman Problem. IEEE Transactions on Evolutionary Computation. 18 (5), 708-720 Samothrakis, S., Lucas, S., Runarsson, T. and Robles, D., (2013). Coevolving Game-Playing Agents: Measuring Performance and Intransitivities. IEEE Transactions on Evolutionary Computation. 17 (2), 213-226 Friston, K., Samothrakis, S. and Montague, R., (2012). Active inference and agency: optimal control without cost functions. Biological Cybernetics. 106 (8-9), 523-541 Browne, CB., Powley, E., Whitehouse, D., Lucas, SM., Cowling, PI., Rohlfshagen, P., Tavener, S., Perez, D., Samothrakis, S. and Colton, S., (2012). A Survey of Monte Carlo Tree Search Methods. IEEE Transactions on Computational Intelligence and AI in Games. 4 (1), 1-43 Samothrakis, S., Robles, D. and Lucas, S., (2011). Fast Approximate Max-n Monte Carlo Tree Search for Ms Pac-Man. IEEE Transactions on Computational Intelligen",
  "content_length": 20458,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:09"
}