{
  "name": "Sreedevi Sampath",
  "homepage": "https://userpages.umbc.edu/~sampath",
  "status": "success",
  "content": "Sreedevi Sampath Sreedevi Sampath I'm About I am an Associate Professor in the Information Systems Department in the College of Engineering and Information Technology (COEIT) at the University of Maryland, Baltimore County (UMBC). I earned my Ph.D. degree in Computer and Information Sciences from the University of Delaware under the advisement of Dr. Lori Pollock. Associate Professor Email: sampath@umbc.edu Phone: +1-410-455-8845 Office: ITE 403, UMBC, Baltimore, USA Research Interests: Software Engineering, Software Security, Privacy Currently, I am the Director of IS Graduate Program in the Information Systems department. I am a member of the Empirical and Applied Software Engineering Lab (EASEL) lab at UMBC. I also collaborate through the Automated Combinatorial Testing for Software (ACTS) group at NIST. I am also affiliated with UMBC's Center for Cybersecurity. I am always looking for good undergraduate and graduate students to work with on research projects. I also have some independent studies to offer in the area of software engineering. If you are interested in any of the research areas mentioned above, or if you think I might be interested in a particular topic of your interest, stop by my office for a chat or drop me an email! Resume See latest CV here (pdf). Education Doctor of Philosophy 2002 - 2006 University of Delaware, Newark, DE Dissertation: Cost-effective techniques for user-session-based testing of web applications. Advisor: Dr. Lori Pollock Master of Science 2000 - 2002 University of Delaware, Newark, DE Computer and Information Sciences Bachelor of Engineering 2000 Osmania University, Hyderabad, India Computer Science and Engineering Professional Experience Associate Professor 2013 - Present University of Maryland Baltimore County (UMBC) Assistant Professor 2006-2013 University of Maryland Baltimore County (UMBC) Research My general research interests are in the areas of software engineering, software testing, software security and privacy. See my Google scholar page for an updated list of publications. Teaching I have taught the following undergraduate and graduate courses several times at UMBC. Graduate classes IS740: Fundamentals of Software testing IS600: Introduction to Information Systems and Implementation Undergraduate classes IS448: Markup and Scripting Languages IS470: Software testing IS472: Software security IS436: Structured Systems Analysis and Design IS147: Introduction to Programming Students I have the privilege of working with several illustrious graduate and undergraduate students over my years at UMBC. PhD students Chair of dissertation committee Venkat Ganapathy Member of dissertation committee Abdullah Aladeej Foteini Cheirdari Yuepu Guo Susan Mitchell David Trimm Quyin Fan Joyram Chakraborty PhD students graduated Ronald Perrella (Currently at: MITRE) Evelyn Kempe (Currently at: US Military Academy) MS students Nicole Dawson Rodrigo Castro Pierce MacMillan Andrea Zemp Katrina Chan Mengni Du Isaiah Yoon Nilesh Chaturvedi Mohammed Aziz Parande Nishant Samant Shama Khadpekar Jayalakshmi Subramanian Sachin Jain Nithya Jayakumar Gokul Viswanath Undergraduate students Bawi Sang Syeda Fatima Patrick Matejka John Dennison Jared Kierle Zachariah Dzielinski Priyanka Ranade Scott Thompson Maneet Sarai Ephrem Abebe Service I have been involved in professional service and service to the department and university. Here are some of my most recent professional service activities. ICST 2025 Industry track Co-Chair ICST 2023 General Co-Chair ICST 2021 Posters Co-chair ICSE 2021 Demonstrations track Program Committee Member IEEE Smart Computing 2020 PhD Symposium Co-chair ICSE 2020 Workshops Program Committee Member Journal STVR Editorial board SCAM 2019 Program Committee Member Contact Location: ITE 404 I, 1000 Hilltop Circle, Baltimore, MD 21250 Email: sampath@umbc.edu Call: +1-410-455-8845",
  "content_length": 3889,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:10"
}