{
  "name": "Sreepathi Pai",
  "homepage": "http://cs.rochester.edu/~spai4",
  "status": "success",
  "content": "Sreepathi Pai's homepage at URCS Sreepathi Pai Associate Professor, Computer Science Affiliate Faculty in the Goergen Institute for Data Science and Artificial Intelligence 3409 Wegmans Hall Department of Computer Science, University of Rochester sree [at] cs rochester edu 585 276 2391 (please e-mail instead) Nullius in verba Research I am an experimental computer systems researcher interested in the performance of computer programs. To that end, I work in compilers, computer architecture, and the implementation of programming languages for parallel computing. My research aims to make it easier to write high-performance programs on increasingly complex machines. I am on academic leave in Spring 2026. My work and my graduate students are graciously supported by the National Science Foundation. If you're a student wanting to work with me, please read this note for prospective students. I joined Rochester in 2017. Before Rochester, I was a Postdoctoral Research Fellow at The University of Texas at Austin. I obtained my PhD at the Indian Institute of Science. Current Projects ROCetta: Formal Semantics for all your GPUs GPU Performance Portability: Peak Performance on every GPU! Graph Computing and Analytics: Speedy Graphs on General-purpose Processors Additionally, I'm a member of the TriForce Center for Multiphysics Modeling where I contribute (primarily) GPU expertise to the codes being developed for use at the Laboratory for Laser Energetics. Recent Activities AI Use in the Workplace: Statistics and Studies (new!) Upward Bound Turtle Workshop (Summer 2024) Current and Recent Students PhD Benjamin Valpey (since Summer 2019) Rongcui Dong (since Fall 2020) Jingyu Qiu (since Fall 2023) Adam Brohl (since Fall 2024) Masters Alishba Gul More ... Undergraduates Sejad Al-Rubayie (McNair Scholar, Sum2025, with Prof. Yanan Guo), Overhead of Runtime checking for Indirect Array Out-of-Bounds Access Yumeng He (Fall23, Spring23, Sum23, Fall24, Spring25), Formalizing Linear Motion G-code for Invariant Checking and Differential Testing of Fabrication Tools More ... Recent Publications For a complete list, please check my publication archive. Yumeng He, Chandrakana Nandi, and Sreepathi Pai, Formalizing Linear Motion G-code for Invariant Checking and Differential Testing of Fabrication Tools, OOPSLA 2025, to appear. [pre-print] [artifact] Benjamin Valpey, Xinyi Li, Sreepathi Pai, and Ganesh Gopalakrishnan, An SMT Formalization of Mixed-Precision Matrix Multiplication, NASA Formal Methods 2025, June 2025 [pre-print] [Springer Link] (Best Paper) Rongcui Dong and Sreepathi Pai, Modeling Utilization to Identify Shared-Memory Atomic Bottlenecks, GPGPU 2025 (in conjunction with PPoPP 2025), February 2025 [pre-print] [ACM DL] Shoham Shitrit and Sreepathi Pai, Registered Report: Generating Test Suites for GPU Instruction Sets through Mutation and Equivalence Checking, FUZZING 2022 (in conjunction with NDSS 2022), April 2022 [Camera Ready] Current Teaching CSC 290/420: Machine Learning Systems for Efficient AI (Fall 2025) Past Teaching CSC 290/571: Topics in Systems: Machine Learning Systems (Fall 2024) CSC 293: CS Improves: 3D Printed Manufacturing (Fall 2023) CSC 2/452: Computer Organization (Fall 2022) (Fall 2019) CSC 2/455: Software Analysis and Improvement [aka Advanced Compilers] (Spring 2025) (Spring 2024) (Spring 2023) (Spring 2022) (Spring 2021) (Spring 2020) (Spring 2019) CSC 573/293: Synthesis of Systems (Fall 2018) CSC 2/458: Parallel and Distributed Systems (Spring 2018) CSC 573: Topics on Systems for Heterogeneous Architectures (Fall 2017) CSC 2/466 (ECE 2/406): Introduction to Parallel Computing using GPUs (Fall 2017) Recent Professional Service Tutorials/Workshop Chair: IISWC 2020 Program Committee: PPoPP 2026, ASPLOS 2026, OOPSLA 2024, CC 2023, IPDPS 2023 [Chairs PC], PLDI 2022, CGO 2020, HiPC SRS 2019, ICS 2019, IPDPS 2019 (Experiments) External Review Committee: OOPSLA 2025, PPoPP 2023, PPoPP 2020, PLDI 2019 Journals: ACM TOPLAS, IEEE TPDS, ACM TOPC Other Technical Stuff Microbenchmarking Unified Memory in CUDA 6.0, looks at CUDA Unified Memory performance on the Kepler K20Xm. \"How the Fermi Thread Block Scheduler Works (Illustrated)\", if you've ever wondered.",
  "content_length": 4228,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:12"
}