{
  "name": "Sri Parameswaran",
  "homepage": "http://www.cse.unsw.edu.au/~sridevan",
  "status": "success",
  "content": "Home Sri Parameswaran Professor - Computer Engineering School of Computer Science and EngineeringThe University of New South WalesUNSW, NSW 2033, AustraliaTel: +61 2 9385 7223email: sri dot parameswaran at unsw dot edu dot au Brief Biography Sri Parameswaran is a Professor in the School of Computer Science and Engineering at the University of New South Wales. He was in the role of Acting Head of School at the University of New South Wales from 2019 to 2020. He served as the Program Director for Computer Engineering and the Post Graduate Research coordinator for the school. Prior to the University of New South Wales, he was an academic at the University of Queensland. He has been a visiting academic at Kyushu University, Japan, and the University of California, in Irvine. He was a consultant at NEC Research Labs in Princeton and the Asian Development Bank. Sri Parameswaran is a current member of the Australian Research Council College of Experts. Sri Parameswaran served as the Editor in Chief of the IEEE Embedded Systems Letters from 2016 to 2019. He was the General Chair of IEEE/ACM International Conference on Computer-Aided Design (2017) and the Asia South Pacific Design Automation Conference (2012). He was an Executive Committee Member of the Design Automation Conference from 20212-2013. He serves or has served on the editorial boards of IEEE Transactions on Computer-Aided Design, ACM Transactions on Embedded Computing Systems, the EURASIP Journal on Embedded Systems, and the Design Automation of Embedded Systems. He has served on several Program Committees such as ones at Design Automation Conference (DAC), Design and Test in Europe (DATE), the International Conference on Computer-Aided Design (ICCAD), the International Conference on Hardware/Software Code-sign and System Synthesis (CODES-ISSS), and the International Conference on Compilers, Architectures, and Synthesis for Embedded Systems (CASES). His research interests are in Design Automation, System Level Synthesis, Low power systems, High-Level Synthesis Computer architectures for bioinformatics, and Network on Chips. Sri Parameswaran received his B.Eng degree from Monash University and his Ph.D. from The University of Queensland. Website Templates created with Website Builder Software .",
  "content_length": 2286,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:13"
}