{
  "name": "Sri Kurniawan",
  "homepage": "https://users.soe.ucsc.edu/~srikur",
  "status": "success",
  "content": "Sri Kurniawan – Professor, Computational Media, University of California Santa Cruz Skip to content . I am currently a Professor of the Computational Media Department, and the Associate Dean for Research of Baskin  Engineering, University of California Santa Cruz. I am also currently serving as (although they might be a bit out of date soon enough): Advisory board member of Immergo Lab, LLC. Affiliate faculty of the UCSC ‘s Global and Community Health Advisory board member of the UCSC Genomics Institute Appointments 2024-now: Associate Dean for Research, Baskin Engineering, UC Santa Cruz 2017-now: Professor, Computational Media Department, UC Santa Cruz 2011-2016: Associate Professor, Computational Media and Computer Engineering Departments, UC Santa Cruz July 16, 2012 – Aug 15, 2012: Visiting Professor, International Islamic University Malaysia 06/16/08 – 09/12/08 Visiting researcher, National Institute of Advanced Industrial Science and Technology (AIST), Japan 2007-2011: Assistant Professor, Computer Engineering Department, UC Santa Cruz 2001-2007: Lecturer (it’s Assistant/Associate Professor in US academic term), School of Informatics (formerly Department of Computation, UMIST) and Manchester Business School, The University of Manchester 1995-1997: Senior Field Engineer, Halliburton Energy Services 1993-1995: Wireline Field Engineer, Schlumberger S.A. Contact detail: Mailing address: SOE-3, 1156 High Street, Santa Cruz, CA 95060 Physical Office: Engineering 2 building, UCSC Santa Cruz campus, Room 371. Phone: +1-831-459-1037 (but email is preferred) Email: skurnia (at) ucsc.edu My lab is called ASSIST, which stands for Assistive Sociotechnical Solutions for Individuals with Special needs using Technology. Education 2006-now: Higher Education Academy Fellow 2004: A member of the Higher Education Academy through an accredited route 2003: Postgraduate Certificate in Academic Practice, The University of Manchester 2001: Ph.D. in Industrial and Manufacturing Engineering, major in HCI, minor in Computer Science from Department of Industrial and Manufacturing Engineering, Wayne State University, Detroit, USA. Dissertation: Using GOMS to model age-related differences in browsing online hierarchies 1998: MPhil in Human Factors from Department of Industrial Engineering and Logistics Management, Hong Kong University of Science and Technology, Hong Kong , China. Thesis: Evaluating Subjective Ratings of Computer Icons for Chinese Users 1993: BEng in Electronics Engineering, major in Telecommunications, minor in Computation from Department of Electronics Engineering, Satya Wacana Christian University, Salatiga, Indonesia. Search for: Recent CommentsArchives Categories No categories Meta Log in Entries RSS Comments RSS UCSC Faculty WordPress © 2023 Sri Kurniawan | Baskin Engineering | UC Santa Cruz | 1156 High St | Santa Cruz, CA 95064 Skip to toolbar Log InSearch",
  "content_length": 2905,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:15"
}