{
  "name": "Sri Devi Ravana",
  "homepage": "https://umexpert.um.edu.my/sdevi",
  "status": "success",
  "content": "UMEXPERT - ASSOCIATE PROF. TS. DR. SRI DEVI A/P RAVANA ASSOCIATE PROF. TS. DR. SRI DEVI A/P RAVANA Department of Information System Faculty of Computer Science and Information Technology sdevium.edu.my View CV View 1-Page CV Publons Scopus Link Biography Completed Bachelor of Information Technology (Information Science) in 2000 at Universiti Kebangsaan Malaysia (National University of Malaya), and my Master of Software Engineering in 2001 at Universiti Malaya. Completed PhD at the Department of Computer Science and Software Engineering, The University of Melbourne in 2011. PhD supervised by: Prof. Alistair Moffat PhD Advisory Committee: Prof. Justin Zobel and Prof. Tim Baldwin. Currently she is an Associate Professor at the Department of Information Systems, Faculty of Computer Science and Information Technology, Universiti Malaya, Malaysia. She is also serving as the Director, Centre for Integral Learning. She has also completed her tenure as the Head of Department from Aug 2017 - Sep 2019. She has also served as the Program Leader/Coordinator for Master of Computer Science from Jan 2012 to July 2017. Her research interest is in Information Retrieval Evaluation, Text Retrieval and Heuristics, Data Science, Data Mining and Machine Learning. She has won a couple of Best Paper Awards at International conferences. She actively delivers keynotes and guest lectures at International and National conferences and Research Seminars. She is also very active in having research collaboration with International researchers from well established Universities. Some of the universities she has collaborated with are Hong Kong University, The Chinese University of Hong Kong (HK), University fo Auckland (NZ), University of Melbourne (Aus), University of Leeds (UK), Alagappa University (India), Amity University (India), Akshaya College of Engineering and Technology (India), Shiraz University (Iran), Mulungushi University (Zambia) and National University of Science and Technology (Pakistan), University of Gunma (Japan). At National level, she is active in the Society of Information Retrieval and Knowledge Management (PECAMP) and has been appointed as commitee member (Assistant Secretary). She has also served as the Secratary for the conference (Fourth International Conference on Information Retrieval and Knowledge Management) organized by PECAMP in 2018. Recently in Dec 2020, she served as the General Chair for the virtually and internationally organized SIRKM 2020 (Seminar on Information Retrieval and Knowledge Management) She is also the recipient of the competative AUA Scholars Award 2019-2020 - Host Institution is The National University of Singapore (Host Professor CHUA Tat-Seng - https://www.chuatatseng.com/ Sri Devi Ravana is also actively involved in community services. She has served as the Vice Chairman (Women Wings) for the Telugu Association of Malaysia (TAM). She is a actively involved in Girl Guides activities locally and internationally. She was also awarded the Queen Guides Award in 1995. At Universiti Malaya she championed the establishment of the Universiti Malaya Girl Guide Movement (Pasukan Pandu Puteri Siswi) in 2020. She currently serves as the Mentor of the Pasukan Pandu Puteri Siswi Universiti Malaya (UM Girl Guides Clovers). Hide Collaborator azahnorman aznulqalid nurhairani liyanashuib ismailahmedy suraya_hamid vimala.balakrishnan amir tutut azy_mn nazean jendoss kasturi norisma tkchiew zeeda21 maizatul norjihan View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status The Integrated Study of Cross-Broder E-Commerce Differences in Visual Merchandising Design and Consumer&amp;#039;s Visual Perception end Simulation Framework To Model Large-scale Smart Farming Ecosystem For Sustainable Agriculture end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Chapter in book Proceeding 2025 A method utilizing deep learning and reinforcement learning for credit card fraud detection 2025 Legal Judgment Prediction using Natural Language Processing and Machine Learning Methods: A Systematic Literature Review 2025 Enhanced Distance-based Weighted K-Nearest Neighbor Algorithm for Data Classification 2025 Effective k-nearest neighbor models for data classification enhancement 2003 Online Examination System: An Overview 2003 Design and Development of a Web-based Application for Learning Mathematics On-line 2019 Exploring Topic Difficulty in Information Retrieval Systems Evaluation 2019 Bandit algorithms in information retrieval evaluation and ranking 2018 Information-Seeking Behaviour Model of International Students Use of Social Media 2018 Association between logical reasoning ability and quality of relevance judgments in Crowdsourcing",
  "content_length": 5023,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:19"
}