{
  "name": "Srikanta Bedathur",
  "homepage": "https://www.cse.iitd.ac.in/~srikanta",
  "status": "success",
  "content": "Srikanta Bedathur Search Srikanta Bedathur DS Chair of Artificial Intelligence IIT Delhi I am a professor and DS Chair Professor of Artificial Intelligence at the Department of Computer Science and Engineering at IIT Delhi. I hold a joint appointment with the YScAI - Yardi School of Artificial Intelligence and currently head the Amar Nath and Shashi Khosla School of Information Technology. I have previously worked as a research scientist at IBM Research as part of their AI Research team, as a faculty member at IIIT Delhi, and senior researcher at the Max-Planck Institute for Informatics (MPII) with Gerhard Weikum. My PhD (2005) was from the Indian Institute of Science where I worked with Jayant Haritsa. Interests Temporal Information Modeling Graph Data Mining and Management Information Retrieval Knowledge-bases - infrastructure, modelling and practical usage Data wrangling - data integration, relationship discovery and visualization Education PhD, 1998-2005 IISc BE, 1991-1995 Bangalore University Recent Posts More Posts Vinayak Gupta Apr 23, 2023 Vinayak Graduates! Vinayak graduated with flying colors! His thesis was highly rated by all reviewers who gave it an ``award quality”. He (remotely) defended the thesis from U Washington where he is doing his post-doc with Tim Althoff. CONTINUE READING Vinayak Gupta , Shubham Gupta , Sahil Manchanda , Abir De , Sayan Ranu , Srikanta Bedathur Dec 2, 2021 Two Papers Accepted in AAAI 2022! After waiting what seemed like an eternity (it was just 2 days due to delayed notifications), we got acceptance notifications for both of our submissions. Work led by wonderful Ph.D. students, Vinayak Gupta and Shubham Gupta!! CONTINUE READING Srikanta Bedathur Last updated on Oct 18, 2021 Congratulations Dr. Garima Gaur! Garima Gaur, my second Ph.D. student, advised jointly with Arnab Bhattacharya at IITK, successfully defended her thesis titled Provenance-Aware Computation and Maintenance of Graph Query Results under Dynamic Knowledge Graphs. Congratulations, Dr. Gaur! CONTINUE READING On Summer/Winter Internship Requests I am NOT offering any short-term projects for internships and I do not have the bandwidth to respond to requests about summer or winter internships. If you are interested in working with me, I recommend you apply for a short-term employment in one of my projects, or join the B.Tech./M.Tech./Ph.D. programs in IIT-Delhi. Calendar Please make an appointment based on my availability below Working Hours: 9:30AM - 12:30PM; 2:00PM - 5:30PM Recent Publications More Publications Prachi, Sumit Bhatia, Srikanta Bedathur. Being Positive about Negative Queries: Exclusion Aware Multimodal Retrieval using Disentangled Representations. Proc. of the of IEEE/CVF Winter Conference on Applications of Computer Vision, WACV 2026, 2026. Cite Srini Rohan Gujulla Leel, Nikhil Tumbde, Sumedh B G, Sonia Gupta, Srikanta Bedathur Govind Waghmare. Kernelized Edge Attention: Addressing Semantic Attention Blurring in Temporal Graph Neural Networks. Proc. of the 40th AAAI Conference on Artificial Intelligence (AAAI), 2026. Cite Ankit Mazumder, Srikanta Bedathur. CGLE: Class-label Graph Link Estimator for Link prediction. Proc. of the 25th IEEE Intl. Conference on Data Mining (ICDM), 2025. Cite Govind Waghmare, Sumedh BG, Sonia Gupta, Srikanta Bedathur. Efficient Graph Understanding with LLMs via Structured Context Injection. 2025. PDF Cite Prachi, Sumit Bhatia, Srikanta Bedathur. Learning Sparse Disentangled Representations for Multimodal Exclusion Retrieval. Proc. of the 11th International Conference on Innovative Concepts and Theories in Information Retrieval (ICTIR), 2025. PDF Cite Courses COL 106 - Datastructures and Algorithms (Semester II 2025-26) Datastructures and Algorithms using C++ COL 8385 / COL 870 - Special Topics in Machine Learning - I (2025-26 Sem. 1) Recommender Systems COL 106 - Datastructures and Algorithms (Semester II 2024-25) Datastructures and Algorithms using Java COL 764 - Information Retrieval and Web Search (2024-25 Sem 1) Understand and implement large-scale search systems effectively and efficiently COL 868 / AIL 841 - Special Topics in Data Science / Database Systems (2023-24 Sem. 2) Explore recent developments in Data Wrangling for Data Science COL 764 - Information Retrieval and Web Search (2023-24 Sem 1) Understand and implement large-scale search systems effectively and efficiently COL 362/632 - Introduction to Database Management Systems (2022-23 Sem 2) COL 865 - Spl Topics in Computer Applications (2022-23 Sem 1) Focus on Tabular and Multimodal Data COL 100 - Introduction to Computer Science (2021-22 Sem 2) Introduction to CS with Programming in Python COL 764 - Information Retrieval and Web Search (2021-22 Sem 1) Understand and implement large-scale search systems effectively and efficiently COL 873 - Spl Topics in NLP (2020-21 Sem 2) Advanced Information Retrieval COL 764 - Information Retrieval and Web Search (2020-21 Sem 1) Understand and implement large-scale text search systems effectively and efficiently COL 106 - Datastructures and Algorithms (2019-20 Sem 2) Datastructures and algorithms using Java. COL 864 - Spl Topics in AI (2019-20 Sem 1) Focus on Information Retrieval COV 888 - Spl. Module in Database Systems (2018-19 Sem 2) Focus on Knowledge Graph Management and IR COL 864 - Spl Topics in AI (2018-19 Sem 1) Focus on Information Retrieval Projects * Multimodel-Multimodal Indexing (2020-- ) Scalable Multi-modal Indexing in Multi-model DBs IBM-IITD AI Horizons Network (2019-- ) Neuro-Symbolic Information Systems Social Media Analysis (2018-2021) Building Platforms for Privacy-preserving and Aggregated Analysis of Media Students more Current Ph.D. Shubham Gupta (Part-time, IITD) Prerna Agrawal (Part-time, IITD) Rajat Singh (Full-time, TCS Fellow, IITD) Nishtha Madaan (Part-time, IITD) Aman Bharadwaj – jointly with Rahul Garg (Part-time, IITD) Sheetal (Full-time, IITD) Arijit Das (Full-time, IITD) Naveeta Maheshwari (Full-time, IITD) Dhawal Verma (Full-time, IITD) M.S(Research) Ankit Mazumder (Full-time, IITD) - CGLE: Class-label Graph Link Estimator for Link Prediction Anika Murarka (Part-time, IITD) - Temporal Link Prediction Lakshay Kakkar (Part-time, IITD) - Controllable Generation of Tabular Data Sagar Gangadhar Palled (Full-time, IITD) Harshit Budhiraja (Full-time, IITD) – jointly with Tanmoy Chakraborty Mayur Garg (Part-time, IITD) Sagar Santhosh Singh (Full-time, IITD) – RAG for Code Gen M.Tech./Dual Srushti Bhagavan Junghare Ayushman Kumar Singh Gaurav Meena Basil Labib Contact s r i k an ta [at] c s e [dot] iitd [dot] a c [dot] i n srikanta.bedathur 3B-22 Block III, 3rd Floor, IIT Delhi, New Delhi - 110 016 10:00 to 16:00 or email for appointment Cite × Copy Download",
  "content_length": 6762,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:15"
}