{
  "name": "Srikant Srinivasan",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-srikant-srinivasan",
  "status": "success",
  "content": "Dr. Srikant Srinivasan | Dean of Academics, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Srikant Srinivasan Srikant Srinivasan Dean of Academics, Plaksha University Professor, Plaksha University PhD, Purdue University Area of Expertise: IoT Systems Nanoelectronics Select About Awards About Srikant Srinivasan Prior to joining Plaksha, Dr. Srikant Srinivasan was an Associate Professor in the School of Computing & Electrical Engineering at the Indian Institute of Technology, Mandi, where he was also the Associate Dean (courses). He graduated with a PhD in Electrical and Computer Engineering from Purdue University, USA and was awarded an Outstanding Dissertation in Magnetism award by the American Physical Society, as well as a student innovator award for developing nanomagnet-based computing devices as an alternative to traditional silicon transistors.Subsequently, he worked as a Post-doc, Data Scientist and later as an Adjunct Assistant Professor in interdisciplinary engineering domains such as materials informatics and high-throughput plant phenotyping at the Iowa State University, before joining IIT Mandi. At IIT Mandi, he was working on sponsored research projects related to precision agriculture and was also strongly involved in interdisciplinary curriculum design and execution for undergraduate students. Dr. Srinivasan was the PI for the multi-institution collaboration – FarmerZone, which delivers agricultural advisories to farmers across multiple states in India. Awards Dr. Srinivasan is a recipient of the Ramalingaswami Re-Entry Fellowship by the Department of Biotechnology, and currently serves as a program review committee member for DBT’s flagship program Biotech Kisan. He is also an advisor and equity holder in Arnetta Technologies Pvt Ltd, an incubatee of IIT Mandi. Research Interests Precision Agriculture Computer Vision Machine Learning Beyond-CMOS devices Past Associations Associate Dean (courses), Indian Institute of Technology, Mandi Associate Professor, Indian Institute of Technology, Mandi Assistant Professor, Indian Institute of Technology, Mandi Adjunct Assistant Professor, Plant Sciences Institute, Iowa State University, USA Post-doctoral Fellow/Data Scientist, Iowa State University, USA Education PhD in Electrical & Computer Engineering, Purdue University, USA M.S. in Electrical & Computer Engineering, University of Cincinnati, USA B.Tech in Electronics & Communications Engineering, VNR-VJIET, JNTU - Hyderabad, India Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 5753,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:14"
}