{
  "name": "Srimanta Bhattacharya",
  "homepage": "https://www.iitpkd.ac.in/people/srimanta",
  "status": "success",
  "content": "srimanta | IIT Palakkad Englishहिन्दी A- A A+ 0491 209 2013 (Office) | info@iitpkd.ac.in INDIAN INSTITUTE OF TECHNOLOGY PALAKKAD Kanjikode | Palakkad | Kerala - 678623 0491 209 2001 (Office) | info@iitpkd.ac.in Dr. Srimanta Bhattacharya Assistant ProfessorComputer Science And Engineering Biosketch Additional Information Title Publications Description 1)S. Bhattacharya, S. Ruj and B. K. Roy, Combinatorial Batch Codes: A Lower Bound and Optimal Constructions, Advances in Mathematics of Communications 6(2), 165–174 (2012) 2)S. Sarkar, S. Bhattacharya and A. Çeşmelioğlu, On Some Permutation Binomials of the Form $x^{\\frac{2^n-1}{k}+1} +ax$ over $\\mathbb{F}_{2^n}$ : Existence and Count, in Arithmetic of Finite Fields, edited by F. Ozbudak and F. Rodriguez-Henriquez, volume 7369 of Lecture Notes in Computer Science, pages 236–246, Springer Berlin Heidelberg, 2012 3)N. Balachandran and S. Bhattacharya, On an extremal hypergraph problem related to combinatorial batch codes, Discrete Applied Mathematics 162, 373–380 (2014) 4)S. Bhattacharya, Derandomized Construction of Combinatorial Batch Codes, in Fundamentals of Computation Theory: 20th International Symposium, FCT 2015, Gdańsk, Poland, August 17-19, 2015, edited by A. Kosowski and I. Walukiewicz, volume 9210 of Lecture Notes in Computer Science, pages 269–282, Springer International Publishing, 2015 5)S. Bhattacharya and S. Sarkar, On Some Permutation Binomials and Trinomials Over F 2 ? , in The Ninth International Workshop on Coding and Cryptography (WCC), 2015, 2015 6)S. Bhattacharya and S. Sarkar, On some permutation binomials and trinomials over F 2 ? , Designs, Codes and Cryptography , 1–12 (2017) 7)S. Bhattacharya and M. Nandi, A note on the chi-square method: A tool for proving cryptographic security, Cryptography and Communications 10(5), 935–957 (Sep 2018) 8)S. Bhattacharya and M. Nandi, Revisiting Variable Output Length XOR Pseudo- random Function, IACR Transactions on Symmetric Cryptology 2018(1), 314–335 (2018) 9)S. Bhattacharya and M. Nandi, Full Indifferentiable Security of the Xor of Two or More Random Permutations Using the ? 2 -Method, in Advances in Cryptology – EUROCRYPT 2018, edited by J. B. Nielsen and V. Rĳmen, pages 387–412, Cham, 2018, Springer International Publishing 10)Srimanta Bhattacharya, Mridul Nandi: Luby-Rackoff Backwards with More Users and More Security. ASIACRYPT (3) 2021: 345-375 Address Indian Institute of Technology Palakkad Kanjikode | Palakkad Kerala | Pin: 678623 +91 491 209 2001 (Office) | +91 491 2092035 (Academic Section) netadmin@iitpkd.ac.in Copyright ©2023 Indian Institute of Technology Palakkad. All Rights Reserved.",
  "content_length": 2656,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:20"
}