{
  "name": "Srinivas Narayana",
  "homepage": "https://people.cs.rutgers.edu/~sn624",
  "status": "success",
  "content": "Srinivas Narayana Srinivas Narayana Associate ProfessorDepartment of Computer Science, Rutgers University srinivas.narayana@rutgers.edu CoRE 312 110 Frelinghuysen Road, Piscataway, NJ 08854, USA Teaching · Publications · Funding · Students · Software · Bio · CV · Failure CV · Scholar I build flexible, safe, and high-performance computer networks that meet the needs of the developers, operators, and users of emerging applications and networks. I take a full-stack approach, developing novel languages, optimizing compilers, algorithms, operating system designs, and hardware designs. My current research projects include designing optimizing compilers for programs processing network packets, verified network stack programming, and distributed system monitoring and control. You can watch my recent colloquium talk on programming computer networks safely and efficiently to get a summary of my main research thrusts over the past few years. News July 2025: Congrats Xiangyu Gao and Haseeb Ashfaq for upcoming papers at SIGCOMM 25 (ParserHawk; Onyx) Congrats Matan Shachnai and Harishankar Vishwanathan for their upcoming paper at the Static Analysis Symposium on comparing the precision of abstract operators in the eBPF verifier June 2025: Harishankar Vishwanathan's patch proposing a more precise abstract operator for the eBPF verifier is upstreamed to the Linux kernel. A research paper on automatically synthesizing precise abstract operators for the eBPF verifier will appear at the SIGCOMM eBPF workshop '25 June 2025: Congratulations Harishankar Vishwanathan, Bhavana Shobhana, and Matan Shachnai for upcoming papers at the eBPF workshop at SIGCOMM'25. June 2025: Aidan O'Gorman wins Rutgers School of Arts and Sciences (SAS) Honors (Henry Rutgers scholar) for undergraduate research on mechanized proofs of abstract interpretation operators May 2025:Promoted to tenured Associate Professor Jan 2025: Matan Shachnai's Linux kernel patch on making eBPF verifier more precise is upstreamed to mainline Linux Dec 2024: Invited to NSDI'26 program committee Dec 2024: Paper on performance-aware layer-4 load balancing accepted to CoNext 2025 Aug 2024: Congratulations Qiongwen Xu for successfully defending her Ph.D. dissertation \"Accelerating software packet processing for high-speed networks.\" Qiongwen will go on to improve cutting-edge RDMA networking at Microsoft Seattle. Aug 2024: SCR accepted to NSDI 2025 Aug 2024: Thanks to the eBPF foundation on funding our research on proving the soundness of algorithms in the eBPF verifier! Jul 2024: Paper on fixing latent unsound abstract operators in the Linux eBPF verifier accepted to Static Analysis Symposium (SAS) '24. Talk on Agni also accepted at the Linux Plumbers Conference Jul 2024: Thanks to the National Science Foundation for award on taking formal verification approaches to the Linux kernel's eBPF verifier Jun 2024: Invited to OSDI'25 program committee Jun 2024: Congratulations to Xiangyu Gao for successfully defending his Ph.D. dissertation \"Solver-Aided Compiler Design for Programmable Network Devices\"! Xiangyu will go on to a postdoctoral research position at the University of Washington Seattle. May 2024: Congratulations to Xiangyu Gao and co-authors for the upcoming paper on cross-hardware transpilation of pipelined packet-processing programs, accepted at Asia Pacific workshop on Networking (APNet) 2024 Apr 2024: Congratulations to Masters thesis students Adithya Murugadass, Sai Pradyumn Shrivastava, and Vijay Maddila for successfully defending their M.S. theses! Mar 2024: Invited to join HotNets 2024 PC Jan 2024: Invited to the NSDI 2025 program committee; NSF 2024 panel My retrospective on network measurement, making decisions at data plane speeds, is out on the ACM digital library, with the proceedings of the workshop on self-driving networks 2023 Oct 2023: Excited to present our work on the soundness of the Linux eBPF verifier at the networking and eBPF track of the Linux Plumbers Conference in Nov 2023. Congrats to students Harishankar Vishwanathan and Matan Shachnai and collaborator Prof. Santosh Nagarakatte May 2023: Invited to speak at the workshop on self-driving networks at SIGMETRICS 2023. Apr 2023: research paper on verifying the soundness of Linux eBPF range analysis accepted to CAV 2023 conference. Congrats to student authors Harishankar Vishwanathan and Matan Shachnai co-advised with my colleague Santosh Nagarakatte Mar 2023: poster on scaling stateful packet processing accepted to NSDI'23. Congrats Qiongwen Xu! Jan 2023: paper on optimizing compiler for packet-processing pipelines accepted to ASPLOS 2023. Congrats Xiangyu Gao! Sep 2022: paper on measurement and feedback control at load balancers accepted to HotNets'22. Congratulations Bhavana Shobhana! May 2022: Elasticity detection accepted to SIGCOMM 22. Congrats Prateesh Goyal! May 2022: Two undergraduates from RU NetSys win Rutgers CS departmental honors for AY 2021-22. Congratulations, Tanvi Wagle and Vaishnavi Manthena! April 2022: Our paper on eBPF static analysis won a distinguished paper award at CGO 2022. Congrats to the lead author Harishankar Vishwanathan and co-authors Matan Shachnai and Santosh Nagarakatte! Jan 2022: Invited to join the NSDI 2023 program committee Dec 2021: Rutgers NetSys team wins first place at Nvidia DPU hackathon 2021 Congratulations to Qiongwen Xu, Songyuan Zhang, Bhavana Shobhana, and Vaishnavi Manthena! Dec 2021: Paper on privacy-preserving video analytics accepted to NSDI'22. Congrats, Frank! Dec 2021: paper on BPF tristate numbers awarded ACM's results reproduced and results reusable badges at CGO'22 Nov 2021: our work on sound and optimal algorithms for static analysis within the Linux kernel accepted at Code Generation and Optimization (CGO) 2022. Congratulations to the leading student Harishankar Vishwanathan! Oct 2021: Invited to join the program committee of the Asia-Pacific Workshop on Networking (APNet 2022) Aug 2021: a full-length talk on our K2 project accepted for presentation at the Linux Plumbers Conference (LPC) 2021 Aug 2021: workshop paper on a low-overhead query system over distributed traces accepted at ACM Hot Topics in Networking (HotNets) 2021 Aug 2021: conference paper on providing developer insights for smartNIC offloading accepted at Symposium on Operating Systems Principles (SOSP) 2021 Jun 2021: K2 compiler artifact awarded all three badges by the SIGCOMM artifact evaluation committee: artifact available, artifact evaluated - functional, and results reproduced Jun 2021: Our Linux kernel patch introducing a new algorithm for sound and precise multiplication of tristate numbers (an abstract domain for static analysis within the kernel) has been upstreamed May 2021: the artifact for our K2 compiler, a Docker container with the source code of the compiler, exercise/evaluation scripts, and instructions for usage, is now publicly available May 2021: Our paper on K2, an optimizing compiler for BPF accepted to SIGCOMM'21. Congratulations to Qiongwen Xu, the leading student author on the paper. Apr 2021: Invited to be on the editorial board of the Journal of Systems Research (JSys) for 2021-22. Apr 2021: Received funding from the Network Programming Initiative. Thanks NPI! Mar 2021: Invited to join the HotNets 2021 program committee Aug 2020: NSF proposal on formally-verified sandboxing for packet-processing programs awarded (along with Santosh Nagarakatte) Jul 2020: Congestion Control Plane merged [1, 2] into Facebook's mvfst user-space transport stack May 2020: Paper on program synthesis for high-speed switches accepted to SIGCOMM 2020. Congrats Xiangyu! Jan 2020: Invited to be part of the Princeton-Cornell Network Programming Initiative Nov 2019: Congestion Control Plane (CCP) merged into mainline mTCP. Now you can experiment with different TCP flavors over DPDK (Intel's Data Plane Development Kit for high-speed packet processing) Sep 2019: Won Facebook Networking Systems Research Award 2019 (PI) with Prof. Santosh Nagarakatte (co-PI) for research on safe and efficient packet-processing with eBPF Sep 2019: Our paper on program synthesis to generate code for high-performance network substrates accepted to HotNets 2019. Congrats Xiangyu! Jun 2019: NSF proposal on programmable network hardware offload awarded (solo PI) Jun 2019: NSF Proposal on programmable networking for Rutgers edge cyberinfrastructure awarded (co-PI) with Dr. Barr Von Oehsen (PI) Teaching Spring 2025 Design of Internet Services (198:553, graduate-level course on the architecture, development, and deployment of large-scale Internet services) Fall 2024 Internet Technology (198:352, an undergraduate-level computer networks course) Spring 2024 Computer Networks (198:552, introductory graduate-level course) Fall 2023 Operating Systems (198:416/518, senior undergraduate/intro graduate course) Spring 2023 Design of Internet Services Fall 2022 Internet Technology Spring 2022 Internet Technology Spring 2021 Internet Technology All video lectures are publicly available. Fall 2020 Computer Networks Spring 2020 Internet Technology Fall 2019 Computer Networks Spring 2019 Internet Technology Fall 2018 Computer Networks Publications Measuring Round-Trip Response Latencies Under Asymmetric Routing Bhavana Vannarth Shobhana, Yen-lin Chien, Jonathan Diamant, Badri Nath, Shir Landau Feibish, and Srinivas Narayana Preprint [ preprint pdf ] ParserHawk: Hardware-aware parser generator using program synthesis Xiangyu Gao, Jiaqi Gao, Karan Kumar G, Muhammad Haseeb, Ennan Zhai, Bili Dong, Joseph Tassarotti, Srinivas Narayana, and Anirudh Sivaraman ACM SIGCOMM 2025 [ paper pdf ] Network Support For Scalable And High-Performance Cloud Exchanges Muhammad Haseeb, Jinkun Geng, Daniel Duclos-Cavalcanti, Xiyu Hao, Ulysses Butler, Radhika Mittal, Srinivas Narayana, and Anirudh Sivaraman ACM SIGCOMM 2025 [ paper pdf ] Automatic Synthesis of Abstract Operators for eBPF Harishankar Vishwanathan, Matan Shachnai, Srinivas Naraya",
  "content_length": 22751,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:22"
}