{
  "name": "Sriram V. Pemmaraju",
  "homepage": "https://www.cs.uiowa.edu/~sriram",
  "status": "success",
  "content": "Sriram Pemmaraju Sriram Pemmaraju Professor, Department of Computer Science, The University of Iowa Coordinates: 256 Macbride Hall, Department of Computer Science, The University of Iowa, Iowa City, IA 52242-1419 319 353 2956 (voice) sriram-pemmaraju@uiowa.edu Fall 2025 Office Hours: Mon 9:30-10:30, Thu 1:00-2:00, Fri 11:30-12:30 Research: I have a two-track research program. My primary research program is in theoretical computer science, more specifically in the foundations of distributed graph algorithms. Here I am interested in designing efficient distributed algorithms for graph problems in various models of distributed computing or showing that such efficient algorithms no not exist. I am also interested in exploring trade-offs between different resources used by distributed algorithms (e.g., rounds, messages, bandwidth, network topology, randomness, initial knowledge, etc.). My research in distributed graph algorithms has intersections with other areas in theoretical computer science such as approximation algorithms, combinatorial optimization, communication complexity, graph theory, information theory, and randomized algorithms. In addition, I am part of the interdisciplinary Computational Epidemiology Group at Iowa. As part of my work with this group, I work on problems related to disease-diffusion, disease-inference and disease-mitigation on contact networks. I design algorithmic solutions to these problems that have low-cost implementations in healthcare settings. A particular focus of our group is healthcare associated infections and we have been part of the CDC funded MInD Healthcare group. Openings for Spring and Fall 2026: I am looking for 1-2 PhD students in distributed graph algorithms and in computational epidemiology. Read on if you are interested... Recent Publications: Models and Algorithms for Balancing Efficiency and Equity in Vaccine Allocation with Madeline Bonner and Jeffrey Keithley AIES 2025   • conference version Analyzing greedy vaccine allocation algorithms for metapopulation disease models with Jeffrey Keithley, Akash Choudhuri, and Bijaya Adhikari PLOS Computational Biology 2025   • journal version   • medRxiv version Message Optimality and Message-Time Trade-offs for APSP and Beyond with Fabien Dufoulon, Shreyas Pai, Gopal Pandurangan, and Peter Robinson PODC 2025   • conference version   • arxiv Sublinear-Time Sampling of Spanning Trees in the Congested Clique with Sourya Roy and Joshua Z. Sobel PODC 2025   • conference version   • arxiv Fast Deterministic Massively Parallel Ruling Sets Algorithms with Hongyan Ji, Kishore Kothapalli, and Ajitanshu Singh ICDCN 2025   • conference version Faster Set Cover in the MPC Model with Hongyan Ji, Shreyas Pai, and Joshua Z. Sobel ICDCN 2025   • conference version The Message Complexity of Distributed Graph Optimizationi with Fabien Dufoulon, Shreyas Pai, Gopal Pandurangan, and Peter Robinson ITCS 2024   • conference version   • arxiv Towards Singular Optimality in the Presence of Local Initial Knowledge. with Hongyan Ji SIROCCO 2024   • conference version   • arxiv See my dblp page or my google scholar page for a more complete list of my theory publications. See compEpi publications for a list of publications of the Computational Epidemiology group at Iowa. Student mentoring: Current PhD advisees: Joshua Z. Sobel, Jeffrey Keithley, Hongyan Ji. Former PhD advisees: Hankyu Jang (2023, Amazon), Shreyas Pai (2021, IIT Madras), Talal Riaz (2019, Yelp), Vivek Sardeshmukh (2016, Google), Mauricio Monsalve (2015, CIGIDEN), Andrew Berns (2012, U of Northern Iowa), Donald Curtis (2011, Google), Saurav Pandit (2010, Pond5), Imran Pirwani (2008, Google), Kevin Lillis (2008, St.Ambrose University), Rajiv Raman (2007, IIIT Delhi), Mirela Damian (2000, Villanova University), Arobinda Gupta (1996, IIT Kharagpur) Current Teaching (Fall 2025): Computer Science I: Fundamentals Here you can find course pages of classes I have taught since 2001. Other Recent Activities: Recent conference organization: AAAI 2026 (Senior PC), PODC 2025 (PC), SSS 2025 (PC), ASONAM 2024 (PC). I am a mentor for the NSF REU on Computing for Health and Well Being. Fall 2025 Algorithms Reading Group. Graduate Programs in CS at the University of Iowa Visit the Graduate Programs pages to learn more about the graduate degrees (PhD and MCS) offered by the Department of Computer Science at the University of Iowa. Back to the departmental homepage. The views and opinions expressed in this page are strictly those of the page author. The contents of this page have not been approved by Mathematical Sciences, the College of Liberal Arts, or The University of Iowa.",
  "content_length": 4668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:32"
}