{
  "name": "Sriram Sankaranarayanan 0001",
  "homepage": "https://www.cs.colorado.edu/~srirams",
  "status": "success",
  "content": "Sriram Sankaranarayanan Engg. Center ECOT 717 University of Colorado Boulder Boulder, CO 80309-0430 Phone: (303) 492 6580 Students: Please Read Before Emailing. I am a Professor in the Computer Science department and the associate dean for digital education in the College of Engineering at the University of Colorado at Boulder. My research focuses on the design and analysis of cyber-physical systems: these are computations that involve a combination of programs that execute “discretely” interacting with a physical environment that “flows” continuously. I work on fundamental problems involving modeling and analysis using hybrid dynamical systems and formal methods with applications to artificial pancreas systems for treating type-1 diabetes, verification and validation of algorithms that control robotic systems and modeling/analyzing the interactions between humans and autonomous systems. I am part of the programming languages & verification group at CU Boulder. I teach a variety of courses in the areas of programming languages, algorithms, mathematical optimization and specialized courses pertinent to my research areas. I have been faculty at CU Boulder since 2009. Previously, I was a member of research staff at NEC Laboratories America from 2005-2009. I graduated with a PhD in (theoretical) Computer Science from Stanford University in 2005. Here is a link to a brief biography. news Jan 20, 2025 Organized VMCAI 2025 with Ashutosh Trivedi (University of Colorado Boulder) and S. Krishna (IIT Bombay). Jun 20, 2024 Congratulations to Drs. Emily Jensen, Monal Narasimhamurthy and Kandai Watanabe for successfully defending their PhD dissertations. selected publications Controlled Supermartingale Functions for Stochastic Differential Equations: Inference and Applications Masoumeh Ghanbarpour, Guillaume Berger, and Sriram Sankaranarayanan In IEEE Conference on Decision and Control (CDC), pp. TBA, 2025. Abs Bib URL We study the problem of constructing controlled supermartingale functions to synthesize feedback laws that guarantee safety properties of stochastic differential equations (SDE) with control inputs. SDEs are widely used to model continuous time stochastic processes with applications ranging from financial markets to biology. In this paper, we extend classic notions from martingale theory for stochastic processes to prove that a given SDE will not exit a safe region over some finite time horizon with high probability. Our notion considers time-varying supermartingale functions that provide sharper probability bounds when compared to those that are time-independent. Furthermore, we study the controlled version of these supermartingales and the problem of synthesizing feedback control law that will maintain the state within a safe set with high probability over a given finite time horizon. We provide a projection-based algorithm for synthesizing polynomial, time-varying controlled supermartingales and corresponding feedback laws using sum-of-square (SOS) programming techniques. We implement our approach on some challenging numerical examples to demonstrate how it can synthesize control feedback laws that provide upper bounds on the probability of safety violations over a given time horizon. @inproceedings{ Ghanbarpour+Berger+Sankaranarayanan/2025/Controlled, title = { Controlled Supermartingale Functions for Stochastic Differential Equations: Inference and Applications }, author = { Ghanbarpour, Masoumeh and Berger, Guillaume and Sankaranarayanan, Sriram }, booktitle= { IEEE Conference on Decision and Control (CDC) }, year = { 2025 }, pages = { TBA }, } Taylor-Model Physics-Informed Neural Networks (PINNs) for Ordinary Differential Equations Chandra Kanth Nagesh, Sriram Sankaranarayanan, Ramneet Kaur, Tuhin Sahai, and Susmit Jha In International Conference on Neuro-symbolic Systems (NeuS), 2025. Abs Bib URL We study the problem of learning neural network models for Ordinary Differential Equations (ODEs) with parametric uncertainties. Such neural network models capture the solution to the ODE over a given set of parameters, initial conditions, and range of times. Physics-Informed Neural Networks (PINNs) have emerged as a promising approach for learning such models that combine data-driven deep learning with symbolic physics models in a principled manner. However, the accuracy of PINNs degrade when they are used to solve an entire family of initial value problems characterized by varying parameters and initial conditions. In this paper, we combine symbolic differentiation and Taylor series methods to propose a class of higher-order models for capturing the solutions to ODEs. These models combine neural networks and symbolic terms: they use higher order Lie derivatives and a Taylor series expansion obtained symbolically, with the remainder term modeled as a neural network. The key insight is that the remainder term can itself be modeled as a solution to a first-order ODE. We show how the use of these higher order PINNs can improve accuracy using interesting, but challenging ODE benchmarks. We also show that the resulting model can be quite useful for situations such as controlling uncertain physical systems modeled as ODEs. @inproceedings{ Nagesh+Sankaranarayanan+Others/2025/TM, title = { Taylor-Model Physics-Informed Neural Networks (PINNs) for Ordinary Differential Equations }, author = { Nagesh, Chandra Kanth and Sankaranarayanan, Sriram and Kaur, Ramneet and Sahai, Tuhin and Jha, Susmit }, booktitle= { International Conference on Neuro-symbolic Systems (NeuS) }, year = { 2025 }, } Successive Control Barrier Functions for Nonlinear Systems Rameez Wajid, and Sriram Sankaranarayanan In Hybrid Systems: Computation and Control (HSCC), pp. 21:1-21:11, 2025. Abs Bib URL We present the idea of successive control barrier functions for nonlinear (polynomial) control systems. Control Barrier Functions (CBFs) can be used to maintain safety properties for a system through the online modification of control inputs to ensure that the state remains inside a controlled invariant set that excludes a set of unsafe states. However, the synthesis of CBFs is quite difficult in practice, especially for nonlinear dynamical systems. Computationally inexpensive approaches employ relaxed control barrier conditions that result in relatively small control invariant sets. In turn, this can result in unnecessary modification of the nominal control input to keep the dynamics inside this set. In this paper, we propose the concept of “successive” CBFs. Rather than rely on a single CBF, our approach uses a hierarchy of functions wherein functions at one level of a hierarchy become active only if the functions at the previous levels have “failed”. Using a well-known approach to finding barrier functions for polynomial dynamical systems using sum of squares optimization, we show how to adapt it to synthesize successive barrier functions. We also provide “transit time” guarantees to construct a “chattering-free” runtime enforcement scheme that avoids collisions with fixed obstacles. We demonstrate our approach on a set of interesting nonlinear benchmarks, while comparing it with state of the art approaches for synthesizing CBFs. @inproceedings{ Wajid+Sankaranarayanan/2025/Successive, title = { Successive Control Barrier Functions for Nonlinear Systems }, author = { Wajid, Rameez and Sankaranarayanan, Sriram }, booktitle= { Hybrid Systems: Computation and Control (HSCC) }, year = { 2025 }, pages = { 21:1-21:11 }, } Polyhedral Control Lyapunov Functions for Switched Affine Systems Sara Kamali, Guillaume O. Berger, and Sriram Sankaranarayanan In Hybrid Systems: Computation and Control (HSCC), pp. 10:1-10:11, 2025. Abs Bib URL We present a counterexample-guided approach for synthesizing convex piecewise affine control Lyapunov functions, obtained as the maximum over a finite number of affine functions, for stabilizing switched linear systems. Our approach considers systems whose dynamics are defined by a set of affine ODEs over different regions of the state-space. The goal is to synthesize a control feedback function that uses state-based switching by assigning a dynamical mode to each state from the set of available dynamics. This is achieved by synthesizing a piecewise affine control Lyapunov function that guarantees that for each state variable, the appropriate choice of a control input can cause an instantaneous decrease in the value of the Lyapunov function. Since piecewise affine functions are not smooth, we use a non-smooth analytic characterization of piecewise affine Lyapunov functions. The key contribution of our approach is a counterexample driven algorithm that alternates between verification that a given convex PWA function is a control Lyapunov function or generating a counterexample point where the Lyapunov conditions fail, and synthesis from a finite set of counterexamples generated in the past. We demonstrate that the two steps can be performed using mixed integer linear programming problems (MILP) although no termination guarantees are possible. We show that the branch and cut approach used inside a MILP solver can be adapted to yield a termination guarantee. Although the resulting approach is computationally expensive, it has the advantage of not requiring a “demonstrator” or a pre-existing controller. We provide an empirical evaluation that explores the results of this approach over a set of numerical examples. @inproceedings{ Kamali+Berger+Sankaranarayanan/2025/Piecewise, title = { Polyhedral Control Lyapunov Functions for Switched Affine Systems }, author = { Kamali, Sara and Berger, Guillaume O. and Sankaranarayanan, Sriram }, booktitle= { Hybrid Systems: Computation and Control (HSCC) }, year = { 2025 }, pages = { 10:1-10:11 }, } Anticipating Oblivious Opponents in Stochastic Games Shadi Tasdighi Kalat, Sriram Sankaranarayanan, and Ashutosh Trivedi In Workshop on Algorithmic Foundations of Robotics (WAFR), pp. TBA, 2024. Note:",
  "content_length": 11522,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:28"
}