{
  "name": "Sriraam Natarajan",
  "homepage": "http://utdallas.edu/~sxn177430",
  "status": "success",
  "content": "Sriraam Natarajan My research interests lie in the fields of Artificial Intelligence and Machine Learning and their application to healthcare problems. More specifically, I am interested in the areas of Relational Learning, Reinforcement Learning, Graphical Models, and Planning. Please read more about our projects and team on our team webpage. Excited to join IJCAI as the Secretary-Treasurer elect. I am humbled and honored to be selected as a AAAI Fellow this year (2025). It has been a dream come true to walk among the giants of AI. What made it doubly special this year was that I got elected to the AAAI executive council. I am humbled to be selected as a AAAI program co-chair and general co-chair of CODS-COMAD 2024. I am also a hessian.AI fellow, a RBDSCAI distinguished faculty fellow and a AAAI senior member. Till 2017, I was a faculty member at Indiana University and previously I was an Assistant Professor at Wake Forest School of Medicine. I was a Post-Doc earlier at the Department of Computer Science in the University of Wisconsin Madison, working with Professors Jude Shavlik and David Page. I completed my PhD in fall 2007 under Professor Prasad Tadepalli in the School of EECS at Oregon State University. Note to incoming students: If you are interested in working with me, please register for a course that I teach. Also, I do not have any internship/short-term positions. Updates Humbled to be selected as the AAAI program co-chair for 2024. Excited to be the program co-chair of CODS-COMAD 2024. Thanks to hessian.AI for making me a fellow. Two papers accepted at UAI -- one on integrating probabilistic circuits with information flows and the other on providing inductive bias for learning cutset networks. Check out the pdfs. Thanks to AAAI for selecting me as a AAAI senior member. Thanks to UTD ECSS for selecting me for the outstanding graduate teaching award. Congratulations Harsha Kokel for defending her PhD dissertation.",
  "content_length": 1957,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:26"
}