{
  "name": "Sriram Chellappan",
  "homepage": "http://www.cse.usf.edu/~shri",
  "status": "success",
  "content": "Sriram Chellappan - CSE @ USF Sriram Chellappan Professor Dept. of Computer Science and Engineering University of South Florida Academic Director of Cybersecurity Research Cyber Florida Mailing Address- 4202 E. Fowler Avenue Tampa, FL 33620, USA. Phone - 813-974-1379 Fax - 813-974-5456 Email -    sriramc@usf.edu WWW - https://cse.usf.edu/~sriramc/ Brief Bio Research Publications Teaching Invited Talks Students CV Brief Bio Sriram Chellappan is a Professor in The Department of Computer Science and Engineering at University of South Florida, where he directs the SCoRe (Social Computing Research) Lab. His primary interests lie in many aspects of how Society and Technology interact with each other, particularly within the realms of Smart Health, Cyber Safety and Privacy. He is also interested in Mobile and Wireless Networking, Cyber-Physical Systems, Distributed and Cloud Computing. Sriram's research is/has been supported by grants from National Science Foundation, Department of Education, Army Research Office, National Security Agency, DARPA and more. Prior to joining USF, he was a faculty member in the Computer Science Dept. at Missouri University of Science and Technology. Sriram received the PhD degree in Computer Science and Engineering from The Ohio-State University in 2007. Sriram received the NSF CAREER Award in 2013. He also received the Missouri S&T Faculty Excellence Award in 2014, the Missouri S&T Outstanding Teaching Commendation Award in 2014, and the Missouri S&T Faculty Research Award in 2015. Social Computing Research Lab Click Here to visit Research Lab page Current/ Recent Research Projects Integrating AI, Biology, Epidemiology and Citizen-Science for Surveillance and Control of Mosquito-borne Diseases - Source of Support: National Science Foundation [Project] Multi-disciplinary and Privacy Preserving Techniques to Combat Cyber Risks among Teens - Source of Support: National Science Foundation [Project] Assessing Human Behavior from Internet Usage - Source of Support: National Science Foundation [Project] Designing Citizen Science Applications for Water Management - Source of Support: National Science Foundation [Project] A Multi-disciplinary Framework to Model Cyber Criminals - Source of Support: National Science Foundation [Project] Designing Social Computing Applications for Healthcare and Cyber Security - Source of Support: National Science Foundation [Project] Selected Recent Publications Enhancing Fidelity of Quantum Cryptography using Maximally Entangled Qubits Proc. of IEEE Global Communications Conference (GLOBECOM), Taipei, Dec 2020.  [.pdf] Designing a Health Coach-Augmented mHealth System for the Secondary Prevention of Coronary Heart Disease Among Women IEEE Transactions on Engineering Management, 2020. A Framework based on Deep Neural Networks to Extract Anatomy of Mosquitoes from Images Scientific Reports 10, 13059 (2020).   [.pdf] High-accuracy detection of malaria mosquito habitats using drone-based multispectral imagery and Artificial Intelligence (AI) algorithms in an agro-village peri-urban pastureland intervention site (Akonyibedo) in Unyama Sub-County Gulu District Northern Uganda Journal of Public Health and Epdemiology, Vol 12/3, July 2020.   [.pdf] A Mobile Health Intervention System for Women With Coronary Heart Disease: Usability Study JMIR Formative Research, Vol 4/6, June 2020.   [.pdf] Automating the Surveillance of Mosquito Vectors from Trapped Specimens Using Computer Vision Techniques Proc. of ACM SIGCAS Conference on Computing and Sustainable Societies (COMPASS), Guayaquil, June 2020.   [.pdf] Learning from Tweets: Opportunities and Challenges to Inform Policy Making During Dengue Epidemic Proc. of the ACM on Human-Computer Interaction, Vol. 4, CSCW1, May 2020.  [.pdf] A Generalized Mechanism beyond NLP for Real-Time Detection of Cyber Abuse through Facial Expression Analytics Proc. of 16th ACM/EAI International Conference on Mobile and Ubiquitous System: Computing, Networking and Services (MobiQuitous), Houston, Nov 2019.  [.pdf] How Smart Your Smartphone Is in Lie Detection? Proc. of 16th ACM/EAI International Conference on Mobile and Ubiquitous System: Computing, Networking and Services (MobiQuitous), Houston, Nov 2019.  [.pdf] HEliOS: Huffman Coding Based Lightweight Encryption Scheme for Data Transmission Proc. of 16th ACM/EAI International Conference on Mobile and Ubiquitous System: Computing, Networking and Services (MobiQuitous), Houston, Nov 2019.  [.pdf] TussisWatch: A Smart-phone System to Identify Cough Episodes as Early Symptoms of Chronic Obstructive Pulmonary Disease and Congestive Heart Failure IEEE Journal of Biomedical and Health Informatics (J-BHI), Vol 23/4, July 2019.  [.pdf] HuMAn: Complex Activity Recognition with Multi-modal Multi-positional Body Sensing IEEE Transactions on Mobile Computing (TMC), Vol 18/4, April 2019.  [.pdf] Leveraging Smartphone Sensors to Detect Distracted Driving Activities IEEE Transactions on Intelligent Transportation Systems (T-ITS), Oct 2018.  [.pdf] Leveraging Smart-Phone Cameras and Image Processing Techniques to Classify Mosquito Species 15th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (MobiQuitous), New York, Nov 2018.  [.pdf] Watch-Dog: Detecting Self-Harming Activities from Wrist Worn Accelerometers IEEE Journal of Biomedical and Health Informatics (J-BHI), Vol 22/3, May 2018.  [.pdf] Click Here for a Complete List Teaching CIS 3363 - IT Systems Security [Syllabus] Fall 2018/ 2019, Spring 2018/ 2019/ 2020 CIS 6930 - Information Security and Privacy in Distributed Systems [Syllabus] Fall 2015/ 2016/ 2017, Spring 2016/ 2017/ 2018/ 2019/ 2020 COT 4210- Automata Theory and Formal Languages [Syllabus] Spring 2017 Invited Talks/ Tutorials Security, Privacy and Safety in Intelligent Transportation Systems Workshop on Cybersecurity in Public Transportation, Tampa, USA, April 2019. Brave New World: Privacy & Security in the Age of Machine Learning and Artificial Intelligence Panelist in Cyber Florida Research Symposium, Tampa, USA, April 2019. What Constitutes a Good BS in Cyber Security Program - An Academia-Industry Perspective Sunshine State Teaching & Learning Conference, Daytona Beach, USA, Jan 2019. Understanding and Addressing Cybersecurity from Different Angles: Computer Science, Education, and Social Science Florida Cyber Conference, Tampa, USA, Oct 2018. Human Centered Designs for Cyber Security IEEE Intl. Conf. on Networking, Systems and Security (NSysS), Dhaka, Bangladesh, Jan 2017. Wearable Sensing for Activity Recognition Towards Smarter Healthcare Indian Institute of Technology (IIT), Madras, India, Jan 2017. Smart and Connected Healthcare - Challenges, Wearables and Algorithms Tutorial at Intl. Conf. on Collaboration Technologies and Systems (CTS), Orlando, Oct 2016. Big-data Techniques for Smarter Mental Health Care National Institute of Mental Health and Neuro Sciences (NIMHANS), Bangalore, India, July 2014. Internet Forensics for Smarter Health and Cyber Security University of North Texas, May 2014. Combating Cyber Crimes via Human Behavior Assessment Interdisciplinary Conference on Cyber Crime at Michigan State University, March 2014. What Secrets can the Internet Reveal About Your Health? Duke University Center for Personalized and Precision Medicine, Feb 2014. Fingerprinting Human Behavior in Cyber Space Los Alamos National Laboratory, Feb 2014 Experimental Studies on Associating Internet Usage with Mood Disorders Marquette University, Nov 2013. Current Students Arup Dey (PhD) AI for Healthcare Hye-Seon Yi (PhD) AI for Sustainable Societies Tanvir Bhuiyan (PhD) AI for Biology Applications Ravi Sharma (PhD) Mining Social Media Jamshidbek Mirzakhalov(MS) Natural Language Processing Graduated Students Bharti Goel (PhD - 2020) - Data Scientist at Verb Surgical Inc. Mona Minakshi (PhD - 2020) - Cloud Solutions Engineer at Intel Anthony Windmon (PhD - 2020) - Senior Model Analyst/ Validator and Assistant Vice President at Citibank Adel Al Sheri (PhD - 2019) - Assistant Professor at King Abdul Aziz City of Science and Technology (KACST), Saudi Arabia Soheil Sarmadi (PhD - 2018)- Data/ AI Scientist at EverestLabs Pratool Bharti (PhD - 2017) - Assistant Professor at Northern Illinois University Srinivas Thandu (PhD - 2016) - Software Engineer at Amazon Mark Snyder (PhD - 2014) - Software Development Engineer at Microsoft Neelanjana Dutta (PhD - 2013) - Cloud R&D Engineer at Intel Sireesha Dadi (MS - 2018) - Software Developer II at Pasco County Sheriff's Office Karthik Siriyala (MS - 2018)- Software Developer II at Pasco County Sheriff's Office Surya Kamineni (MS - 2017) - Data Scientist at Cross Country Home Services Anurag Panwar (MS - 2016) - Data Scientist at Samsung Research America Jake Bielefeldt (MS - 2014) - Software Engineer at Sandia Natl. Labs Ashok Bolla (MS - 2014) - Data Scientist at Paypal Doyal Mukherjee (MS - 2014) - Software Engineer at The Cerner Corp. Sai Preethi Vishwanathan (MS - 2014) - Software Engineer at The Cerner Corp. Muhammad Al Mutaz (MS - 2013) Gerry Howser (MS - 2012) - Faculty at Kalamazoo College Raghavendra Kotikalapudi (MS - 2011) - Machine Learning Software Engineer at Google Selected Professional Services PC Chair: 9th International Conference on Computational Data and Social Networks (CSoNet), Dec 2020. PC Chair: 13th IEEE International Conference on Wireless Algorithms, Systems and Applications (WASA), Tianjin, June 2018. Guest Editor: IEEE Transactions on Network Science and Engineering (TNSE), Special Issue on Network Science for High-Confidence Cyber-Physical Systems 2017. Guest Editor: Special Issue on Big Data for Healthcare, Journal of Pervasive and Mobile Computing (PMC), 2016. Panelist: National Science Foundation (NSF), National Institutes of Health (NIH), National Institute on Disability, Independent Living, and Rehabilitation Research (NIDILRR). PhD Forum Chair: IEEE International Conference on ",
  "content_length": 10595,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:31"
}