{
  "name": "Sriram Kailasam",
  "homepage": "http://faculty.iitmandi.ac.in/~sriramk",
  "status": "success",
  "content": "Sriram Kailasam << IIT Mandi Sriram Kailasam Phone: 1905-267120 EMail: sriramk[at]iitmandi[dot]ac[dot]in Address: A11-5/12, School of Computing and Electrical Engineering IIT Mandi (Kamand Campus), VPO Kamand, Mandi district, HP - 175075 India Research interests Scalable algorithms for Formal Concept Analysis Irregular Tree processing Reactive frameworks Big Data Analytics Education Ph.D., IIT Madras, 2014 B.E., Mumbai University, 2005 Ongoing Project Distributed Algorithms for Formal Concept Analysis, funded by MHRD under SPARC 2019-2022. Other PI: Dr. Sergei Obiedkov (Higher School of Economics Moscow)Co-investigators: Dr. Astrid Kiehn, Dr. Aleksey Buzmakov (Higher School of Economics Perm). Completed Project Design of Advanced Big Data Analytics in the CygNet Management System for Large Telecom Networks, funded by MHRD, 2016-2021. Co-investigators: Dr. A D Dileep, Prof. Timothy A Gonsalves, Dr. Samar Agnihotri, Dr. Aditya Nigam, Dr. Varun Dutt, IIT Mandi. Teaching Design patterns for scalable systems (Feb-Jun 2022) Computing systems for data processing (Feb-Jun 2022) Introduction to communicating distributed processes (Aug-Dec 2021) Advanced CS practicum (Aug-Dec 2021) Publications Journal Publications Packiaraj, M., Kailasam, S, “HyPar-FCA: a distributed framework based on hybrid partitioning for FCA,” Journal of Supercomputing, Mar 2022. Abhigyan Khaund, Abhishek Sharma, Abhishek Tiwari, Shashwat Garg, and Sriram Kailasam, \"RD-FCA: A Resilient framework for Distributed Formal Concept Analysis,\" under submission in Journal of Parallel and Distributed Computing, 2022. Astrid Kiehn and Sriram Kailasam, \"Verification of an abstract algorithm for distributed irregular tree processing\" under submission in Acta Informatica, 2021. Harisankar Haridas, Sriram Kailasam, and Janakiram Dharanipragada, “Cloudy Knapsack Algorithm for Offloading Tasks from Large Scale Distributed Applications,” IEEE Transactions on Cloud Computing, vol. 7, no.4, 2019. Sriram Kailasam, Prateek Dhawalia, S J Balaji, Geeta Iyer, and Janakiram Dharanipragada, “Extending MapReduce across Clouds with BStream,” IEEE Transactions on Cloud Computing, vol. 2, no. 3, pp. 362-376, 2014. Janakiram Dharanipragada, Geeta Iyer, and Sriram Kailasam, “Generate-Map-Reduce: An extension to Map-Reduce to support shared data and recursive computations,” Concurrency and Computation: Practice and Experience, vol. 26, no. 2, pp. 561-585, 2014. Sriram Kailasam, N. Gnanasambandam, Janakiram Dharanipragada, and N. Sharma, “Optimizing ordered throughput using autonomic cloud bursting schedulers,” IEEE Transactions on Software Engineering, vol. 39, no. 11, pp. 1564-1581, 2013. Sriram Kailasam, Santosh Kumar, and Janakiram Dharanipragada, “Arogyasree: An enhanced grid-based approach to mobile telemedicine,” International Journal of Telemedicine and Applications, vol. 2010, Article ID 536237, 2010. Selected Conferences and Symposia Ganesan Ponnuswami, Sriram Kailasam and D. A. Dinesh, \"Evaluating Data-Parallel Distributed Training Strategies,\" in the 14th International Conference on COMmunication Systems & NETworkS (COMSNETS), pp. 759-763, Bangalore, 2022. Saurabh Bansal, Sriram Kailasam, and Sergei Obiedkov, \"Approximate Computation of Exact Association Rules,\" in the 16th International Conference on Formal Concept Analysis, France, 2021. Jyoti, Aleksey Buzmakov and Sriram Kailasam, “Towards Stable Significant Subgroup Discovery”, in the 15th International Conference on Concept Lattices and Their Applications, Estonia, 2020. Muneeswaran P, Jyoti and Sriram Kailasam, “A Hybrid Partitioning Strategy for Distributed FCA”, in the 15th International Conference on Concept Lattices and Their Applications, Estonia, 2020. S Patel, U Agarwal, and Sriram Kailasam, \"A Dynamic Load Balancing Scheme for Distributed Formal Concept Analysis,\" in the 24th IEEE International Conference on Parallel and Distributed Systems, 2018. Harisankar Haridas, Sriram Kailasam, and Janakiram Dharanipragada, “Cloudy Knapsack Problems: an Optimization Model for Distributed Cloud-assisted Systems,” in IEEE 14th International Conference on Peer-to-Peer Computing (P2P’14), London, England, 2014. Prateek Dhawalia, Sriram Kailasam, and Janakiram Dharanipragada, “Chisel++: Handling Partitioning Skew in MapReduce Framework Using Efficient Range Partitioning Technique,” in IEEE 6th International Workshop on Data-intensive Distributed Computing (DIDC’14) collocated with HPDC 2014, Vancouver, Canada, 2014. Prateek Dhawalia, Sriram Kailasam, and Janakiram Dharanipragada, “Chisel: A Resource Savvy Approach for Handling Skew in MapReduce Applications,” in IEEE 6th International Conference on Cloud Computing (CLOUD’13), Santa Clara, CA, USA, 2013. Harisankar Haridas, Sriram Kailasam, Prateek Dhawalia, Prateek Shrivastava, Santosh Kumar, and Janakiram Dharanipragada, “V-cloud: A Peer-to-peer Video Storage-Compute Cloud,” in the 21st International ACM Symposium on High-Performance Parallel and Distributed Computing (HPDC’12), Delft, The Netherlands, 2012 [Poster]. Sriram Kailasam, N. Gnanasambandam, Janakiram Dharanipragada, and N. Sharma, “Optimizing service level agreements for autonomic cloud bursting schedulers,” in IEEE 6th International Workshop on Scheduling and Resource Management for Parallel and Distributed Systems, pp. 285-294, San Diego, CA, USA, 2010. Sriram Kailasam, Santosh Kumar, and Janakiram Dharanipragada, “Mobile telemedicine using data grid,” in International Conference on Communication, Convergence, and Broadband Networking, IISC, Bangalore, India, 2008. Patent S. Gnanasambandam, Naveen Sharma, and Sriram Kailasam, “System And Method For Automated Handling Of Document Processing Workload”, US Patent 20,120,057,191, granted in 2012. . Credits : Web Development Team © 2017 IIT Mandi All rights reserved",
  "content_length": 5893,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:28"
}