{
  "name": "Sruti Srinivasa Ragavan",
  "homepage": "https://sruti-s-ragavan.github.io",
  "status": "success",
  "content": "Sruti S Ragavan Sruti S Ragavan Email: srutis at cse dot iitk dot ac dot in Hello! I am an Assistant Professor in the Department of Computer Science, and an Adjunct in the Department of Cognitive Sciences at IIT Kanpur, India. Before that, I was a HCI researcher in the Calc Intelligence group at Microsoft Research in their Cambridge (UK) lab. I graduated with a PhD (and a Masters too) in Computer Science, supervised by the legendary Margaret Burnett at Oregon State University. In a past life, I was a Senior Consultant in Application Development at ThoughtWorks, a place known for its uncoventional, but fun hiring processes . My research is in Human-Computer Interaction, with a specific interest in building systems for users that are not savvy with the technology they must use. This comes in various shades and flavors: making programming accessible, programming education targeted towards teachers' ability to learn and teach the subject, demystifying workings of AI as part of interface or digitizing small businesses. Most of this is in the form of classical research (papers, etc.), and some of it is translational / consulting in nature. I love building systems that work well for the humans that use them, and I care about building systems that blend seamlessly into users' work, while also being useful, usable and learnable. To that end, I stay hands on, and consult on UI/UX design and large-scale software engineering. I also maintain my interests in information foraging, but mostly in the context of AI. When I am not doing anything computer science, I am learning or teaching Sanskrit, indulging in some artistic endeavour or nerding out about one (music, painting, handicrafts and handlooms, cooking, kolam). Research Human-AI interaction: I am interested in how humans can better understand and use AI systems without underestimating or overrelying on their capabilities. CS Education: I am interested in improving CS education, especially computational thinking. The USP of my research group is our focus on what would work for teachers, especially in diverse Indian contexts. Design for non-WEIRD contexts: I conduct research and design technology that works for India. This involves digitizing kirana stores, building interfaces for Indian Healthcare systems, or supporting craftspeople in India. End-user programming: Making programming more accessible to people who are not programmers making programming usable for them excites me. I've built debuggers and natural language interfaces for these users, now I am working on voice interfaces for kirana stores to digitize their businesses in a manner that works for them. Information foraging: How people seek information is some of my earliest body of work. These days, I explore information seeking in the context of misinformation and Gen AI. Publications Patents Responding to task prompt on declarative code using language model, US Patent App. 17/849,056. Techniques for formula debugging. US Patent App. 18/401,217 Model Capability Extraction. US Patent App. 17/969,922. Generation of Interactive Utterances of Code Tasks. US Patent App. 17/976,570 Range preview with elisions. US Patent App. 18/401,240 Peer-reviewed publications Unveiling Value-Cost Dynamics in StackOverflow with IFT-Enhanced Clustering Abim Sedhain, Sruti Srinivasa Ragavan, Brett McKinney, Shahnewaz Leon, Sandeep Kuttal. HCI International, 2025. (To appear.) Predicting Information Foraging on Q&A Websites Abim Sedhain, Sruti Srinivasa Ragavan, Brett McKinney, Shahnewaz Leon, Sandeep Kuttal. HCI International, 2025. (To appear.) From Prompts to Propositions: A Logic-Based Lens on Student-LLM Interactions Ali Alfageeh, Sadegh AlMahdi Kazemi Zarkouei, Daye Nam, Daniel Prol, Matin Amoozadeh, Souti Chattopadhyay, James Prather, Paul Denny, Juho Leinonen, Michael Hilton, Sruti Srinivasa Ragavan, Mohammad Amin Alipour International Conference on Education Research (ICER), 2025 (To appear.) Block N Key: An Unplugged game for teaching hypothesis testing Shravani Agrawal, Indu Rallabhandi, Sruti Srinivasa Ragavan Annual Conference on Innovation and Technology in Computer Science Education (ITiCSE 2025) (To appear.) A Survey of Generative AI in Computer Science Education Matin Amoozadeh, David Daniels, Stella Chen, Daye Nam, Aayush Kumar, Michael Hilton, Sruti Srinivasa Ragavan, Amin Alipour. SIGCSE Technical Symposium, 2024. Trust in Generative AI among students: An Exploratory Study Matin Amoozadeh, David Daniels, Daye Nam, Stella Chen, Michael Hilton, Sruti Srinivasa Ragavan, Amin Alipour. SIGCSE Technical Symposium, 2024. FxD: a functional debugger for dysfunctional spreadsheets Ian Drosos, Nicholas Wilson, Andrew D Gordon, Sruti Srinivasa Ragavan, Jack Williams. 2023 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 2023. End-user programming is WEIRD: how, why and what to do about it Harshit Goel, Aayush Kumar, Sruti Srinivasa Ragavan 2023 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 2023. End-user encounters with lambda abstraction in spreadsheets: Apollo’s bow or Achilles’ heel? Advait Sarkar, Sruti Srinivasa Ragavan, Jack Williams, Andrew D Gordon. 2022 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 2022. What is it like to program with artificial intelligence? Advait Sarkar, Andrew D Gordon, Carina Negreanu, Christian Poelitz, Sruti Srinivasa Ragavan, Ben Zorn. 2022 Psychology of Programming Interest Group (PPIG). 2022. Gridbook: Natural language formulas for the spreadsheet grid Sruti Srinivasa Ragavan, Zhitao Hou, Yun Wang, Andrew D Gordon, Haidong Zhang, Dongmei Zhang. 27th ACM International Conference on Intelligent User Interfaces (IUI). 2022. Spreadsheet comprehension: Guesswork, giving up and going back to the author. Sruti Srinivasa Ragavan, Advait Sarkar, Andrew D Gordon. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI). 2021. Tweakit: Supporting end-user programmers who transmogrify code. Sam Lau, Sruti Srinivasa Srinivasa Ragavan, Ken Milne, Titus Barik, Advait Sarkar. 2021 ACM Conference on Human Factors in Computing Systems (CHI). 2021. Version control systems: An information foraging perspective. Sruti Srinivasa Ragavan, Mihai Codoban, David Piorkowski, Danny Dig, Margaret Burnett IEEE Transactions on Software Engineering (TSE). 2021. Pfis-v: modeling foraging behavior in the presence of variants. Sruti Srinivasa Ragavan, Bhargav Pandya, David Piorkowski, Charles Hill, Sandeep Kaur Kuttal, Anita Sarma, Margaret Burnett Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI). 2017. Foraging among an overabundance of similar variants. Sruti Srinivasa Ragavan, Sandeep Kaur Kuttal, Charles Hill, Anita Sarma, David Piorkowski, Margaret Burnett. 2016 CHI Conference on Human Factors in Computing Systems (CHI). 2016. Software history under the lens: A study on why and how developers examine it. Mihai Codoban, Sruti Srinivasa Ragavan, Danny Dig, Brian Bailey. 2015 IEEE International Conference on Software Maintenance and Evolution (ICSME). 2015. Posters, Extended Abstracts, Dissertations Pattern Recognition and Hypothesis Testing (A Blocks Game) Shravani Agrawal, Sruti Srinivasa Ragavan. ACM India 6th Conference on Computational Thinking in Schools (CTiS). 2024. Poster: End-User Programming is WEIRD Harshit Goel, Aayush Kumar, Sruti Srinivasa Ragavan. 2023 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 2023. Towards Characterizing Trust in Generative Artificial Intelligence among Students Matin Amoozadeh, David Daniels, Stella Chen, Daye Nam, Aayush Kumar, Michael Hilton, Mohammad Amin Alipour, Sruti Srinivasa Ragavan. 2023 ACM Conference on International Computing Education Research (ICER), Vol.2. 2023. Estimating Foraging Values and Costs in Stack Overflow Abim Sedhain, Sruti Srinivasa Ragavan, Brett McKinney, Sandeep Kaur Kuttal. 2022 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 2022. Using local, traditional games to foster computational thinking Sruti Srinivasa Ragavan. ACM India 5th Conference on Computational Thinking in Schools (CTiS). 2023. Version control: an information foraging perspective Sruti Srinivasa Ragavan. Masters Thesis. Oregon State University. 2018. Variations Foraging Sruti Srinivasa Ragavan. Ph.D. Dissertation. Oregon State University. 2019. Teaching At IITK CS698: Human AI Interaction I'm teaching a new course in 2025-26 Odd Semester. Geared towards PG, 3rd and 4th year students in CSE/Design/CGS, this is one of the first HAI courses in India. CS798H Human Computer Interaction Offered in the Even Semesters (Jan-May). Geared towards PG, 3rd and 4th year students in CSE/Design/CGS; open to other branches. Software Engineering Offered in the Even Semesters (Jul-Dec). Geared towards 4th year CSE students; open to 3rd and 4th year students in CS minor or other branches. Others Instructor at Sanskrit as a Foreign Language (SAFL) Geared towards US High school students, towards foreign language credits. Instructor at Software Technology Excellence Program (STEP) Alternate education and career path for students after 10th and 12th class, or 10+2 Diploma. Instructor at Samskrita Bharati (India, US, UK) Spoken Sanskrit camps and classes, geared towards adults. Open positions I am looking for a full-stack developer for the Gita Supersite. I am always looking for motivated M.Tech, MS and Ph.D. students interested in building systems and interdisciplinary work. Please write me an email if interested. The template is by Vasilios Mavroudis. Thanks!",
  "content_length": 9629,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:27"
}