{
  "name": "Stacey D. Scott",
  "homepage": "https://www.uoguelph.ca/computing/people/stacey-scott",
  "status": "success",
  "content": "Stacey Scott | School of Computer Science Stacey Scott Professor, Director Graduate Studies Email: stacey.scott@uoguelph.caPhone number: 519-824-4120 ext. 54153Office: Reynolds 3308Website links: Website Google Scholar Research StatementResearch KeywordsSelected Publications Interactions with digital information and media are part of everyday life in today’s modern digital information society. My research focuses on interaction and interface design, especially for emerging technologies. Past projects have involved the design of interactive large displays, such as digital tabletops and walls, and multi-display environment, that support small group interactions with digital media. Newer projects have focused on user-centred design of emerging technologies, including AI-based technologies, in the fields of entertainment (e.g., global fan experiences in Korean popular music - K-pop) and agriculture (e.g., precision agriculture and precision livestock farming). My research takes an interdisciplinary approach to the design of emerging technology, bringing relevant knowledge and methods for the specific research context that can best inspire user-centric technology innovation. Potential students and research staff work in my research group must have strong interest and background in psychology, sociology, and/or animal welfare and behaviour, as well as strong technical skills and knowledge. Human-computer interaction Interaction design User-centred design Computer-support communication and collaboration Precision livestock farming Animal-computer interaction Interdisciplinary sociotechnical system design Abbas, Z.J., Truong, P.S., Homaeian, L., Scott, S.D. (2023). Designing Emotive Translation Bubbles to Improve the Live Stream User Experience for Global K-pop Fans. Poster at 49th Graphics Interface Conference 2023, May 30-June 2, 2023, Victoria, ON. Makinde, A., Islam, M.M., Wood, K.M., Conlin, E., Williams, M., Scott, S.D. (2022). Investigating Perceptions, Adoption, and Use of Digital Technologies in the Canadian Beef Industry. Computers and Electronics in Agriculture (CompAg) (Elsevier), Volume 198, July 2022, article 107095. Islam, M.M., Scott, S.D (2021). Exploring the Effects of Precision Livestock Farming Notification Mechanisms on Canadian Dairy Farmers. Proceedings of EAI International Conference on Interactive Digital Media (ICIDM) 2021, July 30-August 1, 2021, Johor Bahru, Malaysia (online), 8 pages. Makinde, A., Islam, M.M., Scott, S.D. (2019). Opportunities for ACL in PLF: Applying Animal- and User-Centred Design to Precision Livestock Farming. Proceedings of ACI 2019: International Conference on Animal-Computer Interaction 2019, November 12-14, 2019. (doi) Pafla M., Wong C., Gillis D., Pfeil U., Scott, S.D. (2019). Jumping on the Bandwagon: Overcoming Social Barriers to Public Display Use. Proceedings of Graphics Interface 2019, May 28-31, 2019, Kingston, ON. (doi) Homaeian, L., Goyal, N., Wallace, J.R., Scott, S.D. (2018). Group vs Individual: Impact of TOUCH and TILT Cross-Device Interactions on Mixed-Focus Collaboration. Proceedings of CHI 2018: ACM Conference on Human Factors in Computing Systems, April 21-26, 2018, Montreal, QC, Canada. (doi) Chang, Y.-L.B, Scott, S.D., Hancock, M. (2017). Usage of Interactive Event Timelines in Collaborative Digital Tabletops Involving Automation. In Anslow, C., Campos, P., Jorge, J. (eds.). Collaboration Meets Interactive Spaces (CMIS). Springer. ISBN 978-3-319-45853-3. (pdf) Scott, S.D., Besacier, G., Goyal, N., and Cento, F. (2017). Investigating Device-Specific Visual Feedback for Cross-Device Transfer in Table-Centric Multi-Surface Environments. Concurrency and Computation: Practice and Experience (Wiley), March 2017. e4084. Cheung, V. & Scott, S.D. (2015). Studying Attraction Power in Proxemics-Based Visual Concepts for Large Public Interactive Displays. Proceedings of ITS 2015: ACM Conference on Interactive Tabletops and Surfaces, November 16-18, 2015, Madeira, Portugal, 93-102. Chang, Y.-L.B., Fong, C., Tse, E., Hancock, M., Scott, S.D. (2015). “Callout Bubble Saved My Life”: Workspace Awareness Support in BYOD Classrooms. Proceedings of ITS 2015: ACM Conference on Interactive Tabletops and Surfaces, November 16-18, 2015, Madeira, Portugal, 73-82 Scott, S.D., Besacier, G., McClelland, P., Tournet, J., Goyal, N., Cento, F. (2015). Cross-Device Content Transfer in Table-Centric Multi-Surface Environments. In F.O. Maurer (eds.). SURFNET: Designing Digital Surface Applications, NSERC SurfNet, University of Calgary, Calgary, AB, 53-79. ISBN 978-0-88953-388-2-(PDF). Scott, S.D., Besacier, G., Tournet, J., Goyal, N., Haller, M. (2014). Surface Ghosts: Promoting Awareness of Transferred Objects during Pick-and-Drop Transfer in Multi-Surface Environments. Proceedings of ITS 2014: ACM Conference on Interactive Tabletops and Surfaces, November 16-19, 2014, Dresden, Germany, 99-108. Chang, Y.-L.B., Scott, S.D., Hancock, M. (2014). Supporting Situation Awareness in Collaborative Tabletop Systems with Automation. Proceedings of ITS 2014: ACM Conference on Interactive Tabletops and Surfaces, November 16-19, 2014, Dresden, Germany Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 5251,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:30"
}