{
  "name": "Stacy M. Branham",
  "homepage": "https://stacybranham.com",
  "status": "success",
  "content": "Stacy Branham I am unfortunately unable to accept new doctoral students in Fall 2026, due to unprecedented federal grant terminations and budget cuts.Hello, World!Stacy Branham, PhDAssociate ProfessorUniversity of California, IrvineDepartment of informaticsI'm Stacy.I study, design, and build technologies with disabled people that make life better for all of us.NewsAward - Alumni Impact, Center for HCI|09/2025Nomination - Innovator of the Year Award|08/2025Award - UC Irvine School of ICS Service Award|05/2025$5.6MM NSF Award to Broaden CS Participation|09/2024Award – Learning Experience & Online Teaching|07/2024All NewsPubsInspiring Blind and Low Vision High School... |RESPECT 2025Creative Problem-Solving: A Study... |CHASE 2025The Dilemma of Building DIY Solutions... |CHI 2025Dude, Where's My Luggage? An Autoethnography... |ASSETS 2024Intersecting Liminality: Acquiring a Smartphone... |ASSETS 2024All PubsLinksSteckler CREATE Center at UCI|2022Connected Learning Lab at UCI|2022Accessibility Research Collective at UCI|2022Accessibility in the SIGCHI Research Community|2022Tenure and Promotion Materials|2021All LinksResearchI direct INsite, the INclusive Studio for Innovative Technology and Education. Learn more about our mission, projects, and members. I am also a founding member of UCI's Accessibility Research Collective (ARC).More ResearchTeaching2022 Recipient of UCI's Digital Accessibility Innovator Campuswide teaching awardMy goal as an educator is to create inclusive spaces where students are excited and empowered to learn skills that will advance social equity through computing.More TeachingServiceOur 2020-21 partnership with Toyota, Aira, and the DMC provided technology support for over 350 people with vision-based disabilities during the pandemicI am dedicated to expanding opportunities for people with disabilities in computing through service in my local community, in my research field, and at all levels of the university. More ServiceSITE MAPHomeBioResearchTeachingServiceGet InvolvedAll PubsAll NewsAll LinksCONTACTsbranham@uci.eduLinkedIn‍Department of Informatics Donald Bren School of Information & Computer Sciences University of California, Irvine Irvine, California 92697",
  "content_length": 2229,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:31"
}