{
  "name": "Stanislaw P. Radziszowski",
  "homepage": "https://www.cs.rit.edu/~spr/homepage.html",
  "status": "success",
  "content": "Faculty Home Page Stanisław P. Radziszowski Professor Department of Computer Science Rochester Institute of Technology Rochester, NY 14623 email spr@cs.rit.edu, bldg. 70B room 3657, phone (585) 475-5193 publications by time or subject, combinatorial computing theses/projects of MS advisees, topics/problems to work on up to: CS faculty * CS department * College of Computing * RIT * Rochester NY Fall 2025, term 2251 Office hours in person TuWe 6:30pm-8pm and Fr 2pm-3pm, @70-3657, on zoom, must prearrange day and time by email Current Courses CSCI-462: Introduction to Cryptography, TuTh 5:00pm-6:15pm, room 70-1445 CSCI-662: Foundations of Cryptography, MoWe 5:00pm-6:15pm, room 70-1445 Recent Courses CSCI-661: Foundations of CS Theory, last taught Spring 2024 CSCI-665: Foundations of Algorithms, last taught Spring 2017 CSCI-761: Topics in Algorithms - Combinatorial Computing, last taught Spring 2021 CSCI-762: Advanced Cryptography, last taught Spring 2020 CSCI-764: Quantum-Resistant Cryptography, jointly with Prof. Borrelli, last taught Spring 2025 Other Past Courses VCSS-380: Introduction to CS Theory, last taught Spring 2009 VCSG-704/VCSS-481: Complexity and Computability, last taught Spring 2001 VCSG-709/VCSS-590: Xtreme Theory, last taught Spring 2004 VCSG-801: Advanced Algorithms, Combinatorial Computing, last taught Fall 2011 VCSG-893: MS Project/Thesis Seminar, last taught Winter 2008/2009 4040-840: Security and Trust, Hashing, taught jointly with Prof. Hans-Peter Bischof, last taught Winter 2012/2013 main results * publications by (time | subject) * resume (ps | pdf) * student theses and projects * long ago * now * Primes are in P-time * gallery of Combinatorial People * CS-RIT Colloquia Series * pronunciation of Polish names * tigered Mobius strip * logo * logo * PaPiS * Lec What am I doing? My main interest is in combinatorial computing - solving classical problems in combinatorics, graph theory and design theory, usually with the help of long and/or tricky computations. Bounds on Ramsey numbers are my favorite. The survey of Small Ramsey Numbers is a regularly updated living article in Dynamic Surveys of the Electronic Journal of Combinatorics. Jointly with Brendan McKay, we have computed the Ramsey number R(4,5)=25 (paper/picture) and improved upper bounds for R(5,5) and R(4,6). For multicolor numbers, a joint work with Susan Fettes and Richard Kramer led to a new upper bound for R(3,3,3,3). My longtime collaboration on Ramsey and Folkman problems with Xiaodong Xu led to many of the publications listed here, most of them cited in a great book by Xiaodong et al. entitled Ramsey Theory. See also: Computational Ramsey Theory at RIT page, House of Graphs containing many interesting Ramsey graphs, designed and maintained by Jan Goedgebeur at the University of Ghent. My other favorite field is computational design theory, for example claims like that 4-(12,6,6) designs do not exist, and 2-(22,8,4) designs do not exist. And for teaching, look at the lectures on Combinatorial Computing and Cryptography in Gdańsk. From 1991 to 2009, I was organizing the CS Colloquia Series (html | ps | tiny-ps | tiny-pdf best viewed with 1000% zoom). Mini CV I was born in Gdańsk, Poland, in 1953. I earned a Ph.D. in mathematics and computer science in 1980, advised by Antoni Kreczmar and Andrzej Salwicki, at the Institute of Informatics at the University of Warsaw. During the years 1980-1984 I worked in IIMAS at the National Autonomous University of Mexico (UNAM) in Mexico City, and since the Fall of 1984 at the RIT. Zapal swieczke zamiast przeklinac ciemnosc. * * * P-time algorithm for recognizing primes",
  "content_length": 3654,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:35"
}