{
  "name": "Stanley Bak",
  "homepage": "http://stanleybak.com",
  "status": "success",
  "content": "Stanley Bak This website extensively uses Javascript; please enable it and refresh. Stanley Bak is an associate professor in the Department of Computer Science at Stony Brook University investigating the verification of autonomy, cyber-physical systems, and neural networks. He strives to develop practical formal methods that are both scalable and useful, which demands developing new theory, programming efficient tools and building experimental systems. Short Bio: Stanley Bak received his PhD from the the Department of Computer Science at the University of Illinois at Urbana-Champaign (UIUC) in 2013 and then worked for several years at the Air Force Research Laboratory (AFRL) in the Verification and Validation (V&V) group of the Aerospace Systems Directorate. He received the AFOSR Young Investigator Research Program (YIP) award in 2020 and the NSF CAREER award in 2023. He is currently an associate professor in the Department of Computer Science at Stony Brook University. Longer Bio: Stanley Bak received a Bachelor's degree in Computer Science from Rensselaer Polytechnic Institute (RPI) in 2007 (summa cum laude), and a Master's degree in Computer Science from the University of Illinois at Urbana-Champaign (UIUC) in 2009. He completed his PhD from the Department of Computer Science at UIUC in 2013. From 2013 to 2018, Stanley was a Research Computer Scientist at the US Air Force Research Lab (AFRL), both in the Information Directorate in Rome, NY, and in the Verification and Validation (V&V) group in the Aerospace Systems Directorate in Dayton, OH. He helped run Safe Sky Analytics, a research consulting company investigating verification and autonomous systems, and performed teaching at Georgetown University in 2019. He joined Stony Brook University in Fall 2020, where he is an associate professor in the Department of Computer Science. He received the US Air Force Office of Scientific Research (AFOSR) Young Investigator Research Program (YIP) award in 2020, the National Science Foundation (NSF) CAREER Award in 2023, and the Stony Brook Trustees Faculty Award in 2024. In 2024, he was also elected to the board of education in the Three Village Central School District, where he oversees the education of over 5000 K-12 students with an annual budget of over $230 million. Email: {{makeEmail()}}stonybrook.edu CV: pdf Google Scholar: link ({{gs_citations}} citations, h-index {{gs_hindex}} as of {{gs_date}}) Courses: CSE 352 - Artificial Intelligence (Sp24, Sp25) CSE 510 - Hybrid Systems (Sp21, Fa21, Fa23, Sp25) CSE 643 - Cyber-Physical Systems Verification Seminar (Fa21) Publications Conference Papers \"{{item.title}}\", {{item.authors}}, {{item.venue}} ({{item.acronym}} {{item.year}}), {{item.note}} {{item.boldnote}} (bib) ({{link[0]}}) Journal Articles \"{{item.title}}\", {{item.authors}}, {{item.venue}} ({{item.acronym}} {{item.year}}), {{item.note}} {{item.boldnote}} (bib) ({{link[0]}}) Other \"{{item.title}}\", {{item.authors}}, {{item.venue}} ({{item.acronym}} {{item.year}}), {{item.note}} {{item.boldnote}} (bib) ({{link[0]}}) Copyright Notice: This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and all rights therein are retained by authors or by other copyright holders. All persons copying this information are expected to adhere to the terms and constraints invoked by each author's copyright. In most cases, these works may not be reposted without the explicit permission of the copyright holder. For certain papers (see notices inside): The U.S. government is authorized to reproduce and distribute reprints for Governmental purposes notwithstanding any copyright notation thereon. These papers were authored by an employee(s) of the United States Government and are in the public domain. Non-exclusive copying or redistribution is allowed, provided that the article citation is given and the authors and agency are clearly identified as its source. For some of the above publications: The final publication is available at link.springer.com. Awards {{item.text}} ({{link[0]}}) ({{item.year}}) × Bibtex Code Raw File Close",
  "content_length": 4124,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:36"
}