{
  "name": "Stasha Lauria",
  "homepage": "https://www.brunel.ac.uk/people/stanislao-lauria",
  "status": "success",
  "content": "Dr stasha Lauria | Introduction | Brunel University London Skip to Content Home People Dr stasha Lauria Dr stasha LauriaLecturer Wilfred Brown Building 111 Email: stasha.lauria@brunel.ac.uk Tel: +44 (0)1895 266032 Computer Science College of Engineering, Design and Physical Sciences Summary Dr Stanislao Lauria has a Laurea awarded by The University of Studies “Federico II” of Napoli in Italy. He holds a Ph.D. in Cybernetics from The University of Reading, UK. Dr Stanislao Lauria is a Lecturer at Brunel University London. Previously he was research fellow at the University of Plymouth and at the University of Reading.Newest selected publications Tian, Y., Su, D., Lauria, S. and Liu, X. (2022) 'Recent advances on loss functions in deep learning for computer vision'. Neurocomputing, 497. pp. 129 - 158. ISSN: 0925-2312 Journal article Liu, W., Wang, Z., Tian, L., Lauria, S. and Liu, X. (2021) 'Melt pool segmentation for additive manufacturing: A generative adversarial network approach'. Computers and Electrical Engineering, 92. pp. 1 - 11. ISSN: 0045-7906 Open Access Link Journal article Dorudian, N., Lauria, S. and Swift, S. (2019) 'Moving Object Detection using Adaptive Blind Update and RGB-D Camera'. IEEE Sensors Journal, 19 (18). pp. 8191 - 8201. ISSN: 1530-437X Open Access Link Journal article Lauria, S., Dorudian, N. and Swift, S. (2018) 'Nonparametric background modelling and segmentation to detect Micro Air Vehicles (MAV) using RGB-D Sensor'. International Journal of Micro Air Vehicles, 11. ISSN: 1756-8293 Open Access Link Journal article Koulouri, T., Lauria, S. and Macredie, RD. (2015) 'Teaching introductory programming: a quantitative evaluation of different approaches'. ACM Transactions on Computing Education, 14 (4). pp. 1 - 28. ISSN: 1531-4278 Open Access Link Journal article More publications(25)",
  "content_length": 1838,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:39"
}