{
  "name": "Stavros D. Nikolopoulos",
  "homepage": "https://cs.uoi.gr/~stavros",
  "status": "success",
  "content": "Stavros D. Nikolopoulos' Homepage Home Publications Teaching Students Projects Links Professor Dept of Computer Science & Engineering (UoI) Director of the Algorithms Engineering Lab Phone: +30 265 100 8801 Fax: +30 265 100 8895 E-mail: stavros@cs.uoi.gr Research Intersets Design and Analysis of Algorithms - Graph Algorithms Algorithmic Graph Theory - Perfect Graphs Information Hiding - Codec Systems, Algorithms, and Data Structures Discrete Event Simulation - Data Structures and Algorithms Recent Publications M. Chroni, S.D. Nikolopoulos, and L. Palios, Encoding Watermark Numbers as Reducible Permutation Graphs using Self-inverting Permutations, Discrete Applied Mathematics (accepted) A.L. Konstantinidis, S.D. Nikolopoulos, and C. Papadopoulos, Strong Triadic Closure in Cographs and Graphs of Low Maximum Degree, Theoretical Computer Science, 2018 S.D. Nikolopoulos and I. Polenakis, Preventing Malware Pandemics in Mobile Devices by Establishing Response-time Bounds, Journal of Information Security and Applications, 2017 S.D. Nikolopoulos and I. Polenakis, A Graph-based Model for Malware Detection and Classification using System-call Groups, Journal of Computer Virology and Hacking Techniques, 2017 A. Konstantinidis, S.D. Nikolopoulos, and Ch. Papadopoulos, Strong Triadic Closure in Cographs and Graphs of Low Maximum Degree, 23rd International Computing and Combinatorics Conference (COCOON'17), LNCS Proceedings, 2017 A. Mpanti, S.D. Nikolopoulos, and M. Rini, Experimental Study of the Resilience of a Graph-based Watermarking System under Edge Modifications, 21st Panhellenic Conference on Info (PCI'17), ACM ICPS Proceedings, 2017 A. Mpanti, S.D. Nikolopoulos, and I. Polenakis, Defending Hardware-based Attacks on Trusted Computing using a Hardware-Integrity Attestation Protocol, 18th Int'l Conference on Computer Systems and Technologies (CompSysTech'17), ACM ICPS Proceedings, 2017 S.D. Nikolopoulos and I. Polenakis, A Model for Establishing Response-time Bounds to Prevent Malware Pandemics in Mobile Devices, 17th Int'l Conference on Computer Systems and Technologies (CompSysTech'16), ACM ICPS Proceedings, 2016 A. Mpanti and S.D. Nikolopoulos, Graph-structured Watermarking using Bitonic Sequences of Self-inverting Permutations, 20th Panhellenic Conference on Info (PCI'16), ACM ICPS Proceedings, 2016 S.D. Nikolopoulos and I. Polenakis, Preventing Malware Pandemics in Mobile Devices by Establishing Response-time Bounds, CoRR abs/1607.00827, July 2016. A. Mpanti and S.D. Nikolopoulos, Two RPG Flow-graphs for Software Watermarking using Bitonic Sequences of Self-inverting Permutations, CoRR abs/1607.02281, July 2016. Postal Address Dept of Computer Sci. & Engineering University of Ioannina P.O. Box 1186, University Campus GR-45100 Ioannina, Greece Office Location Computer Science Building 3rd floor, room G-04 Coordinates: 39º 37' 06'', 20º 50' 19'' Copyright (c) 2013 Stavros D. Nikolopoulos",
  "content_length": 2937,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:38"
}