{
  "name": "Stefan Biffl",
  "homepage": "http://qse.ifs.tuwien.ac.at/people/stefan-biffl",
  "status": "success",
  "content": "Ao. Univ.Prof. Dr. Stefan Biffl – Quality Software Engineering (QSE) Skip to content Stefan.Biffl (at) tuwien.ac.at Web: http://qse.ifs.tuwien.ac.at/ Telefon: +43-(0)1-588 01 – 188 10 By appointment via e-mail Office Location: Favoritenstr. 9-11, 2nd floor, room HC0205 Street address: Software Engineering Group Technische Universität Wien Favoritenstr. 9/194-1, A-1040 Wien Austria I am an Associate Professor of Software Engineering at the Institute of Information Systems Engineering, Technische Universität Wien. I received MS and PhD degrees in computer science from the Vienna University of Technology and an MS degree in social and economic sciences from the University of Vienna. In 2001 I received an Erwin-Schrödinger research scholarship and spent one year as researcher at the Fraunhofer Institute of Experimental Software Engineering (headed by Dieter Rombach), focusing on quality management and empirical software engineering. Also, in 2001 I received the Habilitation degree (Venia Docendi) in Praktische Informatik for work on empirical software engineering in project management and quality management. In 2006 I worked as guest researcher at Czech Technical University, Department of Cybernetics (headed by Vladimir Marik). I have served as guest editor on journals for software technology and quality. I has been involved in organizing and program committees for international software engineering conferences, including ECSA, ICSA, SPLC, SEAA, ESEM, EASE, ESEC/FSE, and ICSE; quality and process improvement conferences, including ICSSP and EurSPI; and software-intensive systems engineering conferences, including IECON, ETFA, IFAC, and INDIN. I have served as a reviewer on international software engineering journals, including TSE, TOSEM, JSS, and IST; software-intensive systems and knowledge engineering journals, including TII, IJSEKE, and TKDE; and on grant committees of the ERC and the Swiss National Foundation. I have headed basic and applied research projects on engineering software-intensive systems with public funding for over 4 Mill. Euro, including the 7-year Christian Doppler research laboratory Software Engineering Integration for Flexible Automation Systems. My research interests include Software and Systems Engineering Process Improvement Multi-view Model Quality Analysis and Improvement Knowledge-intensive processes: Knowledge representation, elicitation, management, transfer. Performance-Driven Knowledge Engineering for Software-Intensive Systems Business and Technology Improvement Architecting Architecture of software-intensive systems and processes, in particular, Collective Intelligence Systems Value-based Software Engineering, putting human concerns in the center of digitalization projects, by taking up principles of Digital Humanism. Empirical Software Engineering Collaboration in Software and Systems Engineering and Operation Quality assurance for AI applications in software-intensive systems and processes Engineering of Cyber-Physical Production Systems (Industry 4.0) Application focus: engineering, monitoring, and coordination of heterogeneous software-intensive systems in production, healthcare, and administration. Recent Research Project Experience Co-lead at TU Wien Center for AI and Machine Learning (CAIML), special interest group for Business, on projects to explore improving business performance with AI applications, since 2025. Supervisor in the TU Wien Doctoral College Trustworthy Autonomous Cyber-Physical Systems since 2024. Senior advisor in the FFG project on Secure Risk Analysis in Digitalization, on combining financial risk analysis with security threat analysis and mitigation, with Secure Business Austria in 2025. Principal researcher and senior advisor in the Comet Center for Digital Production at TU Wien, projects to improve the business performance of automotive production with data analysis, with company partners Volkswagen and Neuman Aluminium, 2021 to 2025. Module lead in the Christian Doppler Laboratory for Security and Quality Improvement in the Production System Lifecycle 2023 to 2024, senior domain expert and advisor 2018 to 2024. Principal researcher in the TU Wien Doctoral College Cyber-Physical Production Systems from 2015 to 2017. Key researcher at the Comet Competence Center Secure Business Austria since 2012. Foundational Research Project Experience Head of the Christian Doppler Laboratory for Software Engineering Integration for Flexible Automation from 2010 to 2016 with 4+Mill. Euro funding. In the CD Laboratory 10+ researchers worked for 7 years on application-oriented basic research for software and systems engineering environment integration with industry partners in the automation engineering domain. Principal researcher in the Complex Systems Design and Engineering Laboratory, 2008 to 2009. Principal researcher at TUW in several nationally funded research projects (FWF, FFG) and an EU Marie Curie Transfer of Knowledge project. Guest researcher at the Czech Technical Universty in Prague, Department of Cybernetics (2006) on software process design for automation systems engineering, agent-based simulation of production automation systems, and software test automation for production systems. Guest researcher at the Fraunhofer Institute for Empirical Software Engineering (IESE), Germany, on software defect detection methods and defect prediction models (2001). Publishing I have co-authored more than 250 publications in the areas of software-intensive systems engineering, quality improvement, and software architecture. I was lead editor for the book Value-Based Software Engineering (Springer, September 2005) in collaboration with my co-editors A. Aurum, B.W. Boehm, H. Erdogmus, and P. Grünbacher. In 2010, I co-authored the book Best Practice Software Engineering with A. Schatten, M. Demolsky, E. Gostischa-Franta, T. Östreicher, and Winkler D. (Spektrum Akademischer Verlag). In 2016, I co-edited the book Semantic Web Technologies for Intelligent Engineering Applications with M. Sabou (Springer Verlag). In 2017, I co-edited the book Multi-Disciplinary Engineering for Cyber-Physical Production Systems with A. Lüder and D. Gerhard (Springer Verlag). In 2019, I co-edited the book Security and Quality in Cyber-Physical Systems Engineering with A. Lüder, M. Eckhart, and E. Weippl (Springer Verlag). Outreach Business and Technology Improvement, architecting services for practitioners:  workshops, project monitoring, and improvement of business performance that depends on technical contributions. Coaching for researchers on ProWriting: How to design, plan, and communicate a research project with high-value impact to clients and society. Involvement in the Research Community Being a researcher means to be involved in activities that advance science and research and help transfer the state-of-the-art into practice. I contribute with the following activities. I am currently involved in the organization of following scientific events: Co-chair of the Software Product and Process Improvement (SPPI) Track at the Euromicro Conference on Software Engineering and Advanced Applications (SEAA) 2025. I have been involved in the organization and program committees of the following academic events: Steering Committee member of the European Conference on Software Architecture (ECSA) since 2021. Steering Committee member of the Conference on Software Engineering and Advanced Applications (SEAA) since 2014. Program Co-chair of the Research Track at the European Conference on Software Architecture (ECSA) 2021 in Vasjo, Sweden. Program Committee member of the Working Conference on Variability Modeling of Software-Intensive Systems (VaMoS) 2021. Program Committee member of the Conference on Current Trends in Theory and Practice of Computer Science (SofSem) 2021. Program Chair of the Track Software Engineering: Methods, Applications, and Tools (SEMAT) at the 44th International Conference on Current Trends in Theory and Practice of Computer Science (SofSem) 2018 in Krems, Austria. Program Co-chair of the Full Paper Track at the ACM/IEEE Symposium on Empirical Software Engineering and Measurement (ESEM) 2017 in Toronto. Scientifc Program Chair of the Software Quality Days conference 2012 to 2019. Co-Chair of the special session on Mechatronical Engineering at the IEEE Int. Conf. on Emerging Technologies and Factory Automation (ETFA) 2012 conference. Guest editor of the special issue of best papers at the SEAA 2011 conference at the journal Information and Software Technology. Program Chair of the Euromicro Conference on Software Engineering and Advanced Applications (SEAA) 2011 in Oulu, Finland. Co-chair of the “Software Product and Process Improvement” (SPPI) Track at Euromicro Conference on Software Engineering and Advanced Applications (SEAA) since 2012. Program Committee member of the Int. Conference on Software Architecture (ICSA) 2020. Program Committee member of the Int. ACM/IEEE Symposium on Empirical Software Engineering and Measurement (ESEM) since 2020. Program Committee member of the International Conference on Product-Focused Software Process Improvement (Profes) since 2020. Program Committee member of the IEEE Int. Conf. on Emerging Technologies and Factory Automation (ETFA) conference since 2020. Program Committee member of the IEEE Industrial Informatics Conference (IndIn) 2016. Program Committee member of the IEEE Int. Conf. on Software Engineering (ICSE) 2016. Program Committee member of the IEEE Int. Conf. on Software Product Lines (SPLC) 2015. I have acted as a reviewer for the following journals: IEEE Transactions on Software Engineering (TSE) ACM Trans. on SE Methodology (TOSEM) IEEE Trans. on Knowledge and Data Engineering (TKDE) IEEE Trans. on Industrial Informatics (TII) IEEE Journal on Systems, Man, and Cybernetics (SMCC) Empirical Software Engineering: An International Journal (ESEM, Springer) Requirements Engineering Journal Software Testing, Verification, and Re",
  "content_length": 11202,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:42"
}