{
  "name": "Stefano Leonardi 0001",
  "homepage": "https://sites.google.com/a/uniroma1.it/stefanoleonardi-eng",
  "status": "success",
  "content": "stefanoleonardiSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeStefano LeonardiFull ProfessorAlgorithm Theory, Algorithms and Data Science, Economics and ComputationDepartment of Computer, Control and Management EngineeringAntonio Ruberti,  Sapienza Università di RomaVia Ariosto 2500185 Roma, Italy phone: +39-06-7727 4022fax: +39-06-7727 4022e-mail: leonardi -- at -- diag.uniroma1.it Algorithmic and Mechanism Design Research in Online MArkets (AMDROMA) ERC Advanced Grant 2018-2024Research interests: Approximation and Online algorithms,  Algorithmic Game Theory and Mechanism Design, Web Algorithmics and Data MiningNew! Conference Chair,  53rd ACM Symposium on Theory of Computing, June 21-26 2021, Rome.New! Conference Chair,  NETSCI 2020, September 2020, Sapienza University of Rome.New! Chair of the Steering Committee of Highlights of AlgorithmsNew! ERC Advanced Grant 2018 - 2023: Algorithmic and Mechanism Design Research for Online Markets (AMDROMA)New! Fellow of the European Association for Theoretical Computer ScienceNew! PhD in Data Science, Sapienza University of Rome New! PRIN 2019-2022 Project ALGADIMAR \"Algorithms, Games, and Digital Markets\"  DataScience@Sapienza Data Science First Graduation Ceremony , October 2017Highlights of Algorithms - HALG 2017Sapienza School of Advanced Studies - Academic Class of Science and Technology, Coordinator 2016-2018Workshop on Google Technologies for Cloud and Web Development AA 2016/2017Fall 2016 Semester on \"Algorithms and Uncertainty\" at the Simons Institute for the Theory of Computing, BerkeleyMsc Program in Data Science, Chair 2014-2018Entrepreneurs Track at WWW 2015Conference General Chair WWW 2015, Florence, April 2015Google Focused Award 2014 - 2017, Web Algorithmics for Large-scale Data AnalysisLaboratory on Web Algorithmics and Data MiningRecent Program Committees: WWW 2014, Crowd Phenomena, Track Chair, EC 2014, SAGT 2014, WINE 2015, Highlights of Algorithms 2016, EC 2016, ICALP 2016, Approx 2016, EC 2017 SPC, ESA 2017 Highlights of Algorithms - HALG 2017 Program Chair, Fun with Algorithms 2018 - FUN 2018, Program Chair, WINE 2018, WWW 2019,  ICALP 2019 Program Chair, ACM-SIAM SODA 2021Report abusePage detailsPage updated Report abuse",
  "content_length": 2249,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:21"
}