{
  "name": "Stefan Leue",
  "homepage": "https://www.sen.uni-konstanz.de/members/prof-dr-stefan-leue",
  "status": "success",
  "content": "Prof. Dr. Stefan Leue | Members | Software and Systems Engineering - Prof. Dr. Stefan Leue Stefan Leue has been a professor for Software and Systems Engineering at the Department of Computer and Information Science at the University of Konstanz since 2004. In 2022 he was elected as a member of the Extended Directorate of the Centre for Human | Data | Society. After studying Computer Science and Economics at the University of Hamburg, he received his doctorate in 1995 (thesis: Methods and Semantics for Telecommunications Systems Engineering) at the University of Bern (Switzerland). From 1995 to 2000 he was first an assistant Professor and then a tenured associate professor in the Department of Electrical and Computer Engineering of the University of Waterloo (Canada). In 1998 he was a member of technical staff at Bell Laboratories in Murray Hill, USA. From 2000 to 2004 he was a professor of Computer Networks and Telematics of the University of Freiburg. Since 2007 he has been a member of the Steering Committee of the SPIN Symposium on Model Checking of Software (SPIN) Since 2018 he has been a member of the Cluster of Excellence Centre for the Advanced Study of Collective Behaviour. Stefan Leue has expert knowledge in Legal Tech, Formal Reasoning, Machine Learning as well as general Software and Systems Engineering. His research focuses on the use of formal methods in the design and analysis of complex systems, with a special focus on embedded software systems and system architectures, the algorithmics and application of model checking, analysis and repair of timed systems, causality analysis and data-centric software engineering. Research Interests Use of formal methods in the design and analysis of complex systems, with a special focus on embedded software systems and system architectures verification of machine learning / AI based software data-centric software engineering automotive software engineering analysis and repair of timed systems (TarTar) formal models of collective behavior formal methods in functional safety analysis (QuantUM) causality analysis and fault localization (Causality Checking)  legal tech case studies in the design and verification of concurrent software systems (GIOP, telecommunication systems, Airbag control units, Automated Driving System (ADS) architectures) algorithmics and application of model checking heuristic search in system verification (directed model checking) abstraction and incomplete verification techniques visual specification formalisms for concurrent systems (Message Sequence Charts) semantics and verification of object-oriented modeling techniques, including UML, UML-RT and SysML protocol engineering and design avionics and automotive software and safety enigeering (DO-178C, AutoSAR, ISO 26262, ISO PAS 21448 (SOTIF)) verification of real-time and probabilistic system properties (DiPro) For more information see our research pages. Research and Technology Transfer Director of the Steinbeis Transfer Center Complex Systems Engineering at the University of Konstanz (2010 - 2020) Current and Former Memberships in Research Networks DFG Excellence Cluster Centre for the Advanced Study of Collective Behaviour, since 2018. DFG Graduate School on Explorative Analysis and Visualization of Large Information Spaces. (DFG Graduiertenkolleg Explorative Analyse und Visualisierung großer Informationsräume), 2004-2012. Transregional Collaborative Research Center 14 Automatic Verification And Analysis of Complex Systems (AVACS), 2004-2007. Publications current publications Academic Degrees January 1995 Dr. phil. nat., University of Berne, Switzerland. October 1990 Master Degree in Computer Science (Diplom-Informatiker), University of Hamburg, Germany. Academic Appointments and Research Positions Since April 2004 Professor, Chair for Software Engineering, Department of Computer and Information Science, University of Konstanz, Germany. July - December 2000 Associate Professor (tenured), Department of Electrical and Computer Engineering of the University of Waterloo. On leave of absence. December 1999 - \t\t\tApril 2004 Associate Professor (tenured) of Computer Networks and Telematics at the Institute for Informatics (Computer Science) of the Albert-Ludwigs-University in Freiburg, Germany. March 1995 - \t\t\tJune 2000 Assistant Professor (tenure track) at the Department of Electrical and Computer Engineering, University of Waterloo. Cross-appointment at Department of Computer Science, University of Waterloo, July 1998. Leave of absence starting January 1, 2000. November 1991- \t\t\tMarch 1995 Research Assistant and Doctoral Candidate at the Institute for Computer Science of the University of Bern, Switzerland. Visiting Positions April - May 2017 Visiting Scholar, Courant Institute of Mathematical Sciences, Department of Computer Science, Analysis of Computer Systems Group, New York University September - December 2008 Visiting Professor, Institute of Information Security, Department of Computer Science, Swiss Federal Institute of Technology, Zurich, Switzerland July - September 2003 Visiting Professor, School of Computer Science, University of Waterloo, Kanada. January 2000 - \t\t\tAugust 2002 Adjunct Professor, at the International University in Germany, Bruchsal. 1999/2000 Visiting Professor, École Nationale Supérieure d'Informatique et de Mathématiques Appliquées de Grenoble (ENSIMAG) and Institut VERIMAG, Grenoble, France. May - December 1998 Member of Technical Staff, Computing Sciences Research Center, Bell Laboratories, Murray Hill, New Jersey (during sabbatical leave). Industrial work experience October 1990 - \t\t\tNovember 1991 Computer Science consulting in industry, consulting on individual information systems for major German life insurance companies. 1982 - 1990 Consulting for German life insurance companies, various internships at IBM Germany. Personal Date and place of birth 1962 in Hamburg, Germany. Marital status married, 2 children Nationality German Languages German, English, French Interests Tennis, alpine skiing, hiking, mountain biking, paintings by Paul Klee, mountains! Teachings see our current teachings Students and Alumni Current PhD Students - David Boetius - Raffael Senn Alumni (Master and PhD) - Dr. Martin Kölbl (now with CertiK) - Adrian Beer (now with KARL STORZ, Schaffhausen) - Alina Bey - Dr. Florian Leitner-Fischer (now with ZF TRW Automotive GmbH, Radolfzell) - Yang Sen - Dr. Husain Aljazzar (now with Bosch) - Dr. Wei Wei (now with SAP) - Dr. Richard Mayr (Habilitation, now with University of Edinburgh, UK) - Prof. Dr. Alberto Lluch Lafuente (now with DTU Copenhagen, DK) - Piotr Tysowski - Moataz Kamel Memberships Steering Committee of the SPIN Workshop Series IEEE, Computer Society ACM Gesellschaft für Informatik / German Informatics Society (their choice of name...) GIBU (GI Beirat der Universitätsprofessoren) IFIP WG 6.1 Contact Prof. Dr. Stefan Leue Software and Systems Engineering Room: PZ 902 Phone: +49 7531 88-2893 Send email Current Courses Publications Hide search Search University of Konstanz Search terms Search Results Suggestions",
  "content_length": 7119,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:58"
}