{
  "name": "Stefan Nagy",
  "homepage": "https://www.cs.utah.edu/~snagy",
  "status": "success",
  "content": "Stefan Nagy Stefan Nagy Assistant Professor Kahlert School of Computing University of Utah Salt Lake City, Utah About Me I'm an Assistant Professor in the Kahlert School of Computing at The University of Utah. I earned my Ph.D. in Computer Science from Virginia Tech in 2022, and my Bachelor's in Computer Science from The University of Illinois Urbana-Champaign in 2016. Broadly, I lead research and teach students in the areas of Software Engineering, Software Quality Assurance, and Computer Systems. Key topics I work on include software testing, program analysis, and bug repair. I'm especially interested in making efficient and effective quality assurance possible for opaque and otherwise challenging software and systems. Contact Information 3446 Merrill Engineering (MEB) 50 Central Campus Drive Salt Lake City, UT 84112 snagy@cs.utah.edu +1 801-581-8224 Research Summary Program Analysis and Automated Bug Discovery: ACSAC'25 ASE'25 ICSE'25b ICSE'25a ISSTA'25 CCS'23 Analysis and Fuzzing of Closed-source Software: ATC'25 USENIX'23 CCS'21 USENIX'21 Oakland'19 Security Ethics and Education: ISTAS'19 ICSE'18 ICDF2C'15 Digital Forensics: SADFE'15 ICDF2C'15 Teaching CS 4440: Introduction to Computer Security Website CS 5493 / 6493: Applied Software Security Testing Website Recent Publications A full and up-to-date publications list is available on the FuTURES3 Lab website. Names of my advised students are underlined. 2025 TeTRIS: General-purpose Fuzzing for Translation Bugs in Source-to-Source Code Transpilers. Yeaseen Arafat and Stefan Nagy. Annual Computer Security Applications Conference (ACSAC'25). 2025 GUIFuzz++: Unleashing Grey-box Fuzzing on Desktop Graphical User Interfacing Applications. Dillon Otto, Tanner Rowlett, and Stefan Nagy. IEEE/ACM International Conference on Automated Software Engineering (ASE'25). 2025 Bin2Wrong: a Unified Fuzzing Framework for Uncovering Semantic Errors in Binary-to-C Decompilers. Zao Yang and Stefan Nagy. USENIX Annual Technical Conference (ATC'25). 2025 No Harness, No Problem: Oracle-guided Harnessing for Auto-generating C API Fuzzing Harnesses. Gabriel Sherman and Stefan Nagy. International Conference on Software Engineering (ICSE'25). 2025 A Little Goes a Long Way: Tuning Configuration Selection for Continuous Kernel Fuzzing. Sanan Hasanov, Stefan Nagy, and Paul Gazzillo. International Conference on Software Engineering (ICSE'25).",
  "content_length": 2406,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:01"
}