{
  "name": "Stefan Feuerriegel",
  "homepage": "https://www.ai.bwl.uni-muenchen.de/personen/professoren/feuerriegel/index.html",
  "status": "success",
  "content": "Contact page - Institute of Artificial Intelligence (AI) in Management - LMU Munich Prof. Stefan Feuerriegel Head of Institute Institute of Artificial Intelligence (AI) in Management Office address: Ludwigstr. 28/ RG 80539 Munich Directions Send an email Institute of AI in Management Office hours: By arrangement Postal address: Geschwister-Scholl-Platz 1 80539 Munich Publications Google Scholar Open Access LMU Publications Research Focus Research Overview Read more Ar­ti­fi­cial In­tel­li­gence for busi­nesses and pub­lic or­gan­iz­a­tions New algorithms for data-driven decision-makingAI for good Co-Affiliations Stefan's Team Read more LMU Faculty of Mathematics, Informatics and Statistics (dual affiliation) Principal investigator, Munich Center for Machine Learning (MCML) Member, LMU Innovation & Entrepreneurship Center (IEC) Fellow, DAAD Konrad Zuse Schools of Excellence in AIMember, ELLIS Society & ELLIS Unit Munich Cur­riculum Vitae Stefan Feuerriegel heads the new Institute of Artificial Intelligence (AI) in Management. He holds a dual affiliation as a full professor at LMU Munich School of Management and the Faculty of Mathematics, Informatics, and Statistics at LMU Munich. In 2024, he visited the Stanford University in the USA as a Visiting Scholar. In 2025, he was a visiting scholar at the Cambridge Centre for AI in Medicine (CCAIM) at the University of Cambridge.Previously, Stefan was an assistant professor at ETH Zurich. He gaduated in 2015 with a Ph.D. at the Chair for In­form­a­tion Sys­tems Re­search (Prof. Dr. Dirk Neu­mann), Uni­ver­sity of Freiburg. Dur­ing his re­search stays, he partnered with re­search­ers from the Uni­ver­sity of New South Wales (UNSW), Sydney, the Na­tional In­sti­tute of In­form­at­ics (NII), Tokyo, Mc­Combs School of Busi­ness at the Uni­ver­sity of Texas at Aus­tin, and Carne­gie Mel­lon Uni­ver­sity (CMU), Pitt­s­burgh. He has also been in­vited as a lec­turer to teach in the Re­search Sprint at Berkman Klein Cen­ter for In­ter­net and So­ci­ety, Har­vard Uni­ver­sity. Achievements Stefan has co-au­thored 70+ journal art­icles and 80+ peer-re­viewed con­fer­ence pa­pers. These works have ap­peared in top out­lets from gen­eral sci­ence (e.g. Nature, PNAS), man­age­ment (e.g Man­age­ment Sci­ence, Mar­ket­ing Sci­ence) and machine learning (e.g. NeurIPS, ICML, ICLR, WWW, KDD, ACL, EMNLP, AAAI). Ac­cord­ing to Google Scholar, his works count 10,000+ cita­tions. Stefan currently serves as methodological expert for the Academy of Management Journal (AMJ).His group is sup­por­ted by vari­ous com­pan­ies (e.g. Google, Mi­crosoft, Or­acle, Nvidia, Amazon) and mul­tiple grants, for which the fund­ing volume totals to more than EUR 5.5 mil­lion. In particular, he received an SNSF Eccellenza Grant, which is the equivalent in Switzerland to the ERC Starting Grant. Impact In the Media Read more Stefan’s re­search is driven by the de­sire to make a dis­tinct­ive im­pact in prac­tice. For this, Stefan was ad­vising SDG Fin­an­cing Lab of the Or­gan­isa­tion for Eco­nomic Co-op­er­a­tion and De­vel­op­ment (OECD) and organized workshops with the International Committee of the Red Cross (ICRC). He was a mem­ber of a COVID-19 Work­ing Group of the World Health Or­gan­iz­a­tion (WHO) and an agenda con­trib­utor of the World Eco­nomic Forum (WEF). Stefan’s research further led to the founding of 3 spin-offs: TonalityTech, BLP Digital, and ethonAI. up What are you looking for? More information about Google data transfer in LMU's Privacy Policy. close",
  "content_length": 3654,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:51"
}