{
  "name": "Stefan Schlobach",
  "homepage": "http://www.few.vu.nl/~schlobac",
  "status": "success",
  "content": "Stefan Schlobach Stefan Schlobach home publications cv Department of Computer Science Faculty of Sciences room: T 3.65 Vrije Universiteit Amsterdam de Boelelaan 1081a 1081HV Amsterdam The Netherlands (+31) - 20 - 598 7678 Email: k.s.schlobach{at} vu.nl Welcome I am working as an Associate Professor (UHD) at the Knowledge Representation and Reasoning group at the Vrije Universiteit Amsterdam, as part of the Network Institute of the VU University Amsterdam. Before, I was a member of the Information and Language Processing Systems group at the Universteit van Amsterdam. Before I joined ILPS I  was a research associate in the Department of Computer Science at King's College London, where I did my PhD with Dov Gabbay and H.J.Ohlbach. With my former collegues in the Pionier project I worked on the use of knowledge sources for Question Answering. Later I was involved in a large number of projects (STITCH, SEKT, KnowledgeWeb, LarKC, etc) using and developing Semantic technology in various domains. I used to work on non-standard reasoning techniques in Description Logics, such as explanation or the support of debugging, and to develop logical criteria for modelling of ontologies or terminiologies. Now I am most interested in the relation between structure, usage and semantics of complex Knowledge Bases, such as the Web of Data. Very important is the music and previously, I sang with the Royal Metro Singers, a 7 person a cappella group, and ExMoor Singers, a London based chamber choir (Sainsbury's Mixed Choir of the Year 1998), in which I used to sing from 1997 'til 2001. Nowadays I'm a tenor in the Lelikoor, an Amsterdam based mixed chamber choir of about 24 singers. Research Knowledge Bases as Complex Systems (particularly Semantics and Structure) The Web of Data has become so complex, dynamic, contextualised and large that it starts to exhibit complex systems’ behaviour: the interactions between individual data items influence the global structure in an emergent way. Classical Knowledge Representation has no answer on how to give formal semantics to such complex systems, and on how to define which new knowledge should be automatically derived and which one not. Traditional accounts of the meaning of knowledge graphs are based on model-theoretic semantics. This describes the denotation of symbols, the meaning of logical connectives, and of logical entailment. But there is more to it: the WoD graph has a power-law degree distribution, is a single connected component, that the connectivity of the graph depends on a small number of nodes, and that its structure varies between aggregation levels. In short: the Web of Data has the making of a Complex System. Important fundamental and practical AI questions follow: Do such properties contribute to the semantics of the knowledge graph? Is the meaning of densely connected nodes more \"important\" or more \"certain\"? Is the meaning of a node dependent on the cluster (\"context\") in which it appears? How does the graph structure affect algorithms for storing, querying and analysing the knowledge graph? Research to answer those questions is driven by a common theme: to study Knowledge Bases as Complex Systems.",
  "content_length": 3195,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:08"
}