{
  "name": "Stefan Savage",
  "homepage": "http://cseweb.ucsd.edu/~savage",
  "status": "success",
  "content": "Stefan Savage Stefan Savage Professor Department of Computer Science and Engineering University of California, San Diego Office: EBU3B 3106 Email: savage AT cs.ucsd.edu ssavage AT ucsd.edu Mail: UCSD Dept of CSE 9500 Gilman Drive, MC 0404, La Jolla, CA  92093-0404 Voice (858)-822-4895 FAX (858)-534-7029 Systems and Networking Group Security Group Recent publications âTock: Verified Isolation in a Production Embedded OS, Vivien Rindisbacher, Evan Johnson, Nico Lehmann, Tyler Potyondy, Pat Pannuto, Stefan Savage, Deian Stefan, and Ranjit Jhala, Proceedings of the 31st ACM Symposium on Operating Systems Principles (SOSP), Seoul, Republic of Korea, October 2025. Canvassing the Fingerprintters: Characterizing Canvas Fingerprinting Use Across the Web, Elisa Luo, Tom Ritter, Stefan Savage, and Geoffrey M. Voelker, Proceedings of the ACM Internet Measurement Conference (IMC), Madison, Wisconsin, October 2025. Somesite I Used To Crawl: Awareness, Agency and Efficacy in Protecting Content Creators From AI Crawlers, Enze Liu, Elisa Luo, Shawn Shan, Geoffrey M. Voelker, Ben Y. Zhao, and Stefan Savage, Proceedings of the ACM Internet Measurement Conference (IMC), Madison, Wisconsin, October 2025. Patient Care Technology Disruptions Associated With the CrowdStrike Outage, Jeffrey L. Tully, Sumanth Rao, Isabel Straw, Rodney A. Gabriel, Chris Longhurst, Stefan Savage, Geoffrey M. Voelker, and Christian J. Dameff, JAMA Network Open 8(7):e2530226-e2530226, July 2025. Understanding the Efficacy of Phishing Training in Practice, Grant Ho, Ariana Mirian, Elisa Luo, Khang Tong, Euyhyun Lee, Lin Liu, Christopher A. Longhurst, Christian Dameff, Stefan Savage, and Geoffrey M. Voelker, Proceedings of the IEEE Symposium on Security and Privacy, May 2025. An Empirical Analysis on the Use and Reporting of National Security Letters, Alex Bellon, Miro Haller, Andrey Labunets, Enze Liu, and Stefan Savage, Proceedings of ACM Sympoisum on Computer Science and Law (CSLAW), Munich, Germany, March 2025. Give and Take: An End-To-End Investigation of Giveaway Scam Conversion Rates, Enze Liu, George Kappos, Eric Mugnier, Luca Invernizzi, Stefan Savage, David Tao, Kurt Thomas, Geoffrey M. Voelker, and Sarah Meiklejohn, Proceedings of the ACM Internet Measurement Conference (IMC), Madrid, Spain, November 2024. Using Honeybuckets to Characterize Cloud Storage Scanning in the Wild, Katherine Izhikevich, Geoffrey M. Voelker, Stefan Savage, and Liz Izhikevich, Proceedings of the IEEE European Symposium on Security and Privacy, Vienna, Austria, July 2024. Unfiltered: Measuring Cloud-based Email Filtering Bypasses, Sumanth Rao, Enze Liu, Grant Ho, Geoffrey M. Voelker, and Stefan Savage, Proceedings of the Web Conference (WWW), Singapore, May 2024. An Empirical Analysis of Enterprise-Wide Mandatory Password Updates, Ariana Mirian, Grant Ho, Stefan Savage, and Geoffrey M. Voelker, Proceedings of Annual Computer Security Applications Conference (ACSAC), Austin, TX, December 2023. Understanding the Viability of Gmail's Origin Indicator for Identifying the Sender, Enze Liu, Lu Sun, Alex Bellon, Grant Ho, Stefan Savage, Geoffrey M. Voelker, and Imani N. S. Munyaka, Proceedings of the Symposium on Usable Privacy and Security, Anaheim, CA, August 2023. In the Line of Fire: Risks of DPI-triggered Data Collection, Ariana Mirian, Alisha Ukani, Ian Foster, Gautam Akiwate, Taner Halicioglu, Cindy Moore, Alex C. Snoeren, Geoffrey M. Voelker, and Stefan Savage, Proceedings of Workshop on Cyber Security Experimentation and Test (CSET), Marina del Rey, CA, August 2023. No Privacy Among Spies: Assessing the Functionality and Insecurity of Consumer Android Spyware Apps, Enze Liu, Sumanth Rao, Sam Havron, Grant Ho, Stefan Savage, Geoffrey M. Voelker, and Damon McCoy, Proceedings of the 23rd Privacy Enhancing Technologies Symposium, Lausanne, Switzerland, July 2023. Forward Pass: On the Security Implications of Email Forwarding Mechanism and Policy, Enze Liu, Gautam Akiwate, Mattijs Jonker, Ariana Mirian, Grant Ho, Geoffrey M. Voelker, and Stefan Savage, Proceedings of the IEEE European Symposium on Security and Privacy, Delft, The Netherlands, July 2023, pages 373-391. (Best paper award). WaVe: a Verifiably Secure WebAssembly Sandboxing Runtime, Evan Johnson, Evan Laufer, Zijie Zhao, Shravan Narayan, Stefan Savage, Deian Stefan, and Fraser Brown, Proceedings of the IEEE Symposium on Security and Privacy, May 2023. (Distinguished Paper Award). Ransomware Attack Associated With Disruptions at Adjacent Emergency Departments in the US, Christian Dameff, Jeffrey Tully, Theodore C. Chan, Edward M. Castillo, Stefan Savage, Patricia Maysent, Thomas M. Hemmen, Brian J. Clay, and Christopher A. Longhurst, JAMA Network Open 6(5):e2312270-e2312270, May 2023. All publications Research I'm part of the Systems & Networking and Security research groups. My interests are all over the map, ranging from the economics of e-crime, to automotive and aviation systems, to routing protocols and data center virtualization and back again. I have very broad interests (i.e. try me if you have a crazy idea). Students Paul Chung Michelina Hanlon Katherine Izhikevich Seoyoung Kweon Elisa Luo Sumanth Rao Ye Shu Enze \"Alex\" Liu (Ph.D. 2025) → CMU postdoc Evan Johnson (Ph.D. 2025) → NYU Ariana Mirian (Ph.D., 2023) → Censys Audrey Randall (Ph.D. 2023) → Google Gautam Akiwate (Ph.D., 2022) → Stanford postdoc → Apple Guo \"Vector\" Li (Ph.D., 2020) → Google Louis Dekoven (Ph.D., 2019) → Facebook Wilson Lian (Ph.D., 2016) → Google → Loon → Anyscale Neha Chachra (Ph.D., 2015) → Facebook Matthew Der (Ph.D., 2015) → Notch → Capital One Tristan Halvorson (Ph.D., 2015) → Google Ian Foster (BS/MS, 2015) → Salesforce He Liu (Lonnie) (Ph.D., 2015) → Google David Wang (Ph.D, 2014) → Google → Etsy → Uber Sarah Meiklejohn (Ph.D., 2014) → University College London Daniel Turner (Ph.D., 2013) →TurboSquid → Shopify → Robinhood Andreas Pitsillidis (Ph.D., 2013) → Google → Bridgewater Associates Chris Kanich (Ph.D., 2012) → University of Illinois, Chicago Damon McCoy (postdoc 2009-2011) → George Mason University → NYU Marti Motoyama (Ph.D., 2011) → FitBit → Stripe → Google Michael Vrable (Ph.D., 2011) → Google Sushma Bannur (M.S., 2011) → Microsoft → Facebook Kourosh Derakshan (M.S., 2011) → Qualcomm → Google Justin Ma (Ph.D., 2010) → Berkeley Postdoc → Google Ge \"Grace\" Wang (M.S., 2010) → Qualcomm Ryan Roemer (M.S., 2009) → Microsoft → IP Street → Curiosity Media → Formidable Labs → Nearform Kirill Levchenko (Ph.D., 2008) → UCSD Research Scientist → University of Illinois David Moore (2008) → Cisco → Google → Vectra AI Varun Almaula (M.S., 2008) → Cisco → Health Technology Forum → Cyber Defenders → Chan Zuckerberg Initiative Yu-Chung Cheng (Ph.D., 2007) → Google Alper Mizrak (Ph.D., 2007) → VmWare John Bellardo (Ph.D., 2006) → Cal Poly SLO Sumeet Singh (2006) → NetSift → Cisco → Microsoft → AppFormix→ Juniper Networks → Aptori Chris Tuttle (M.S., 2006) → Google → Ableton → Fastly Ishwar Ramani (M.S., 2005) → Juniper Networks → VUDU → Lab126 → Amazon → A9 Ranjita Bhagwan (Ph.D., 2004) → IBM Research → Microsoft Research→ Google Doug Brown (M.S., 2003) → NYU Law School → Asst U.S. Attorney → Chapin Fitzgerald LLP → Abelson Herron Halpern LLP→ Halpern May Ybarra Gelberg LLP dd Recent teaching Spring 25: CSE 291-E Security, Privacy and US Law (grad) Winter 25: CSE 291-C Measuring Things (grad, co-ctaught with Geoff Voelker) Fall 24: CSE 127 Computer Security (undergrad) Spring 23: CSE291-J Blockchain Security (grad, co-taught with Deian Stefan) Winter 24: CSE291-C Cybercrime (grad, co-taught with Alex Gantman) Fall 23: CSE 127 Computer Security (undergrad) Spring 23: CSE291-B Security, Privacy and US Law (grad) Winter 23: CSE291/DSC291 Information Manipulation: Trustworthiness of Information in Cyberspace (grad, co-taught w/Molly Roberts) Fall 22: CSE 127 Computer Security (undergrad) Winter 22: GPA 477 Cyber Security (grad policy course -- materials on Canvas, co-taught w/Peter Cowhey) Winter 22: CSE 291-6 Ransomware (grad) Fall 21: CSE 227 Computer Security (grad) Spring 21: GPA 477 Cyber Security (grad policy course -- materials on Canvas, co-taught w/Peter Cowhey) Spring 21: CSE 127 Computer Security (undergrad) Winter 21: CSE291-C Security, Privacy and US Law (grad) Spring 20: GPA 477 Cyber Security (grad policy course -- materials on tritonEd, co-taught w/Peter Cowhey) Spring 20: CSE 127 Computer Security (undergrad) Professional Activities ACM CCS Steering Committee, 2015-present USENIX Enigma Steering Committee, 2016-2021 Program Co-chair, 2016 USENIX Security Symposium Progrm Committee, 2015 ACM SIGCOMM Program Committee, 2012 USENIX Symposium on Operating System Design and Implementation (OSDI) Program Committee, 2011 ACM SIGCOMM Conference Program Committee, 2011 USENIX LEET Workshop Program Committee, 2010 USENIX Networked Systems Design and Implementation (NSDI) Program Committee, 2010 USENIX LEET Workshop Program Committee, 2009 ACM Symposium on Operating System Principles (SOSP) Program Committee, 2009 IEEE Symposium on Security and Privacy Program Co-chair, 2008 ACM SIGCOMM Conference Steering Committee, 2008-present USENIX LEET Workshop Program Committe, 2008 USENIX WOWCS Workshop Member, NSF GENI Science Council, 2007-2008 Program Co-chair, 2007 ACM HotNets Workshop Program Committee, 2007 ACM Workshop on Recurring Malcode (WORM) Program Committee, 2007 ACM Symposium on Operating System Principles (SOSP) Program Committee, 2007 ACM SIGCOMM Conference Program Committee, 2006 IEEE Symposium on Security and Privacy NRC/CSTB Study: Improving Cybersecurity Research in the United States (2004-2005) Program Committee, 2005 USENIX Networked Systems Design and Implementation (NSDI) Program Committee, 2005 ACM Symposium on Operating System Principles (SOSP) Program Committee, 2004 ACM Workshop on Rapid Malcode (WORM) Program Co-chair, 2004 USENIX/ACM Networked Systems Design and Implementation (NSDI) Co-Organizer, 2003 DIMA",
  "content_length": 10979,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:05"
}