{
  "name": "Stefan Wermter",
  "homepage": "https://www.inf.uni-hamburg.de/en/inst/ab/wtm/people/wermter.html",
  "status": "success",
  "content": "Prof. Dr. Stefan Wermter : Knowledge Technology : University of Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußPhoto: UHH/Knowledge TechnologyPeopleProf. Dr. Stefan WermterPhoto: UHH/Knowledge TechnologyDirectorKnowledge TechnologyAddressUniversity of HamburgDepartment of InformaticsKnowledge Technology Research GroupVogt-Koelln-Str. 3022527 HamburgOfficeRoom: F-230ContactTel: +49 40 42883-2434Fax: +49 40 4273-14634Email: stefan.wermter\"AT\"uni-hamburg.deMain Current Roles Full Professor in Computer Science Head of Knowledge Technology Institute President of European Neural Network Society (ENNS) Coordinator of the International Doctoral Network TRAIL Co-Coordinator of DFG Collaborative Research Centre / Transregio 169 (Crossmodal learning) Research Interests Neural Networks, Artificial Intelligence, Hybrid Knowledge Processing, Neurocognitive Robotics, Multimodal Integration, Data Mining, Machine Learning. My objective is to research into neural knowledge technology for intelligent systems. Our approaches are often motivated by nature, e.g. from biology, cognition and neuroscience. We want to study and understand nature-inspired, in particular hybrid neural and symbolic representations, in order to build next-generation systems, for instance adaptive interactive knowledge discovery systems, continually learning multimodal neural agents, and neuroscience-inspired robots. Short Curriculum Vitae Diplom, Department of Computer Science, University of Dortmund, Germany (1987) Award Fellowship of the German Academic Exchange Service, Department of Computer Science, University of Massachusetts at Amherst, USA (1987-1988) Research Assistant, Department of Computer Science, University of Massachusetts, USA (1988-1989) Master of Science, Department of Computer Science, University of Massachusetts, USA (1989) Research Associate and Lecturer, Department of Computer Science, University of Dortmund, Germany (1990-1991) PhD, Department of Computer Science, University of Hamburg, Germany (1993) Research Scientist, Department of Computer Science, University of Hamburg, Germany; leading working group on hybrid neural processing (1991-1997) Visiting Research Scientist, International Computer Science Institute, Berkeley, California, USA (1997) Higher Doctorate (Habilitation), Department of Computer Science, University of Hamburg, Germany. Learning of robust language processing in hybrid neural architectures (1998) Professor of Computer Science, Chair for Intelligent Systems, School of Computing and Technology, University of Sunderland, England (1998-2010) Professor of Computer Science, Chair for Knowledge Technology,  Department of Computer Science, University of Hamburg, Germany (2010-) Research ProjectsI have coordinated and participated in many research projects. A list of current and recent projects can be found at the Project page of the Knowledge Technology research group.Current or previous Editorial Boards and Program Committees International Advisory Committee Member for 32nd International Conference on Neural Information Processing 2025 Honorary Chair and as ENNS President leading the Steering Committee for the 34th International Conference on Artificial Neural Networks (ICANN 2025) Honorary Chair and as ENNS President leading the Steering Committee for the 33rd International Conference on Artificial Neural Networks (ICANN 2024) Honorary Chair and as ENNS President leading the Steering Committee for the 32nd International Conference on Artificial Neural Networks (ICANN 2023) Honorary Chair and Member of the Steering Committee for the 31st International Conference on Artificial Neural Networks (ICANN 2022) Honorary Chair, International Conference on Artificial Neural Networks (ICANN 2021) Honorary Chair, International Conference on Artificial Neural Networks (ICANN 2020) Award Chair for the World Conference on Computational Intelligence (WCCI 2022) Associate Editor for 8th Joint IEEE International Conference on Development and Learning and on Epigenetic Robotics (ICDL-EPIROB 2018), Tokyo. Associate Editor of Frontiers in Neurorobotics Associate Editor of Transaction on Neural Networks and Learning Systems Associate Editor of Hybrid Intelligent Systems Associate Editor of Connection Science Associate Editor of Knowledge and Information Systems Editorial Board and Action Editor of Neural Networks Editorial Board of Cognitive Systems Research Editorial Board of International Journal of Computational Intelligence and Applications Editorial Board of Natural Computing Editorial Board of Neural Computing Surveys Editorial Board of Neural Information Processing - Letters and Reviews Editorial Board of Neurosymbolic Artificial Intelligence Editorial Board of International Journal of Computational Intelligence Editorial Board of Cognitive Computation Editorial Board of AI Open Board of European Neural Network Society (elected for 2007-2016 period) Member of IEEE Autonomous Mental Development Technical Committee (AMDTC) Member of the EPSRC College Prioritization Panel of Engineering and Physical Sciences Research Council 2006-2010 Recent Programme Committees Job Openings and Research TopicsIf you are looking for an interesting Postdoc or PhD research project, e.g. PhD around the following research topics, you could email(%20wermter\"AT\"informatik.uni-hamburg.de). Sometimes there are a restricted number of PhD studentships available on related and other topics. Furthermore, research / training opportunities exist from the EU for European researchers as Marie Curie Fellowships at different levels: predoc, postdoc, or advanced senior researcher. We are interested to host researchers who would like to strengthen the research in our team.TeachingI have taught mainly in the areas of: Neural Networks Bioinspired Artificial Intelligence Knowledge Processing Machine Learning Knowledge-based Systems Information Systems Intelligent Systems Hybrid Neural Symbolic Systems Natural Language Processing Automatic Knowledge Acquisition Cognitive Robotics In 2011 I have founded and since then I lead our International MSc and I am Chair and Head of the Examination Board of the International MSc Programme Intelligent Adaptive Systems at the University of Hamburg.Organised Events 2025 International Conference on Artificial Neural Networks (ICANN 2025), organised by the following Organising committee. 2024 International Conference on Artificial Neural Networks (ICANN 2024), organised by the following Organising committee. 2023 International Conference on Artificial Neural Networks (ICANN 2023), organised by the following Organising committee. 2022 International Conference on Artificial Neural Networks (ICANN 2022), organised by the following Organising committee. 2021 International Conference on Artificial Neural Networks (ICANN 2021), organised by Igor Farkaš, Paolo Masulli, Sebastian Otte, Stefan Wermter. 2020 International Conference on Artificial Neural Networks (ICANN 2020), organised by Igor Farkaš, Paolo Masulli, Stefan Wermter. 2019 Workshop on Personal Robotics and Secure Human-Robot Collaboration (at ICDL-EPIROB 2019), organised by Angelo Cangelosi, Stefan Wermter, Alban Lafraquiere, Sven Magg; Oslo, Norway. 2018 Workshop on Intelligent Assistive Computing (at IEEE WCCI 2018), organised by Pablo Barros, Francisco Cruz, German I. Parisi, Bruno Fernandes; Rio de Janeiro, Brazil. 2018 One-Minute Gradual-Emotion Behavior Challenge (OMG-Emotion), organised by Pablo Barros, Egor Lakomkin, Henrique Siqueira, Alexander Sutherland, Stefan Wermter 2018 Workshop on Personal Robots for Exercising (at HRI Conference 2018), organised by Sascha Griffiths, Stefan Wermter, Sebastian Schneider, Britta Wrede, Carlos A. Cifuentes G.; Chicago, IL, USA. 2017 Workshop on Computational Models for Crossmodal Learning (at IEEE ICDL-EPIROB 2017), organised by Pablo Barros, German I. Parisi, Doreen Jirak and Bruno Fernandes; Lisbon, Portugal. 2017 Workshop towards Intelligent Social Robots: Social Cognitive Systems in Smart Environments (at RO-MAN 2017), organised by Amir Aly, Sascha Griffiths, Verena Nitsch, Tadahiro Taniguchi, Stefan Wermter, Adriana Tapus; Lisbon, Portugal. 2016 Workshop on Bio-inspired Social Robot Learning in Home Scenarios (on IROS 2016), organised by Francisco Cruz, Jimmy Baraglia, Stefan Wermter, Yukie Nagai, Daejeon, KR 2014 International Conference on Artificial Neural Networks, organised by General Chair Stefan Wermter, the Program Co-Chairs and Local Organising Committee, Hamburg, DE 2012 Postgraduate Conference on Robotics and Development of Cognition (RobotDoC-PhD), organised by Angelo Cangelosi, Francesca Stramandinoli, Stefan Wermter, Lausanne, CH 2009 Meeting of Natural Computing Application Forum: Intelligent Robotics, organised by Stefan Wermter, Michael Knowles, Martin Page, Sunderland, UK 2008 International Workshop on Minds, brains, networks, communication and robots, organised by Stefan Wermter, Vittorio Gallese, Friedemann Pulvermueller, Edinburgh, Scotland 2007 International Workshop on what it means to communicate based on neural, cognitive and computational evidence, organised by Stefan Wermter, Vittorio Gallese, Friedemann Pulvermueller, Porto, Portugal 2005 International AI Workshop on Neurobotics, Ulm, Germany organised by Guenther Palm, Stefan Wermter, Mark Elshaw, Ulm, Germany 2000 International Workshop on Current Computational Architectures Integrating Neural Networks and Neuroscience, organized by Stefan Wermter, David Willshaw, Durham, UK 1999 EmerNet International Workshop on Emergent Neural Computational Architectures based on Neuroscience organized by Stefan Wermter, Jim Austin, David Willshaw, Edinburgh, Scotland 1999 AAAI Conference workshop on Neuroscience and Neural Computation organized by Jim Austin, Stefan Wermter, and Vasant Honavar, Orlando, USA 1998 Interdisciplinary conference, Hybrid Neural and Symbolic Language Processing, Invited Lecture Session, Stefan Werm",
  "content_length": 11893,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:13"
}