{
  "name": "Stefan Kiefer",
  "homepage": "https://www.cs.ox.ac.uk/people/stefan.kiefer",
  "status": "success",
  "content": "Stefan Kiefer | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyStefan KieferStefan Kiefer Professor Stefan Kiefer Professor of Computer ScienceTutorial Fellow, St John's CollegeE: ste delete this fan.kiefer at cs.ox.ac.ukT: +44 (0)1865 273 864Wolfson Building, Parks Road, Oxford OX1 3QD Themes:Automated VerificationInterestsVerification, probabilistic models, infinite-state systems, program analysis, automata theory. Publications, Publications up to 2020 Research Blog Recent talks On the State Complexity of Complementing Unambiguous Finite Automata ICALP 2020 (invited talk): How to Play in Infinite MDPs Teaching Probability and Computing (with S. Živný): Michaelmas 2013, Michaelmas 2014, Michaelmas 2015 Linear Algebra: Michaelmas 2021, Michaelmas 2022, Michaelmas 2023, Michaelmas 2024 Professional Service co-PC chair of FoSSaCS'21 Invited speaker at TASE'23, Trends in Concurrency Theory'22, ICALP'20, Highlights of Logic, Games and Automata'18 PC member of MFCS'24, LICS'23, ICALP'23, Concur'22, MFCS'21, FSTTCS'19, LICS'19, TACAS'19, Concur'18, CAV'18, FoSSaCS'18, FCT'17, ICALP'17, CAV'17, STACS'16, MEMICS'15, Highlights'15 Instructor at the ENS Lyon winter school 2015 on Probabilistic Techniques and Models in Computer Science Member of the EPSRC Peer Review College, since 2014 BiographyI received my undergraduate degree in computer science at the University of Stuttgart in 2005. I completed my doctoral degree (Dr. rer. nat., summa cum laude) at the TU München in 2009 under the supervision of Javier Esparza. From 2009 to 2013 I had postdoctoral positions, including a DAAD postdoctoral fellowship, at the University of Oxford. From 2013 to 2021 I held a Royal Society University Research Fellowship for my project on Quantitative Analysis of Infinite-State Systems. In 2013 I became a Research Lecturer and in 2014 an Associate Professor at the Oxford University Department of Computer Science. Since 2017 I am the Tutorial Fellow in Computer Science at St John's College, and since 2023 Professor of Computer Science at the University of Oxford. Postdocs Mahsa Shirmohammadi: 2014-2017 Qiyi Tang: 2019-2021 DPhil Students Ines Marusic (co-supervised with M. Benedikt and J. Worrell), graduated 02/2017 Cas Widdershoven: 2017-2022 Oscar Darwin: 2018-2023 Syyeda Zainab Fatmi: 2023- Grants EPSRC grants Royal Society URF: 2013-2021 ActivitiesQuantitative Analysis and Verification Current Student Zainab Fatmi Past Students Oscar DarwinJulian D'CostaInes MarusicCas WiddershovenAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:53"
}