{
  "name": "Stefan Manegold",
  "homepage": "http://homepages.cwi.nl/~manegold",
  "status": "success",
  "content": "Mane's homepage Prof. Dr. Stefan Manegold The CWI Database Architectures group (DA) is hiring! Tenure-track position in Data Science Systems Architecture Function: (0.8 fte) Senior ResearcherScientific Staff Member Function: (0.2 fte) Professor for Data Management Centrum Wiskunde & Informatica (Wiskunde = Mathematics Informatica = Computer Science) LeidenUniversity Faculty of Science Database Architectures (DA) Institute: Leiden Institute of Advanced Computer Science (LIACS) Info: profile Info: profile Address: P.O.Box 94079 1090 GB Amsterdam The Netherlands Visit: Science Park 123 / Room L321 1098 XG Amsterdam phone: +31 (0)20 592-4212 email: Stefan.Manegold@cwi.nl Xing: LinkedIn: (former) Function: (2008-2020) Co-Founder ResearchGate: B.V. Curriculum  Vitae: 25 February 2021 Navigation: Professional & Research Interests Present Projects Past Projects Awards Publications The Dutch-Belgian DataBase Day (DBDBD) 2024 Friday, 22 November 2024, CWI, Amsterdam Professional & Research Interests Column-store Database Architectures and Technologies Data Management for Sciences Analytical Database Systems Parallel and Distributed Information Systems Cost Models for Database Query Optimization XML storage & XQuery processing using RDBMS technology Hardware-aware Database Technology Processor Achitectures and Hierarchical Cache Memories Optimization, Scalability, Performance, and Benchmarking Multi-Architecture/Cross-Platform Software-Development & -Testing Present Projects --- Query Processing at Light-Speed --- Database Technology to advance Science PROMIMOOC --- Process mining for multi-objective online control (NWO/NLeSC) DAMIOSO --- Data Mining on High Volume Simulation Output (NWO) CIMPLO --- http://natcomp.liacs.leidenuniv.nl/index.php?page=PROMIMOOC (NWO/TTW) Past Projects --- TimeTrails (P19): Spatiotemporal Data Warehouses for Trajectory Exploitation (NL/FES) --- Roadmap for European Technologies in Hardware and Networking for Big Data (EU-FP7-CSA) --- Linked Open Earth Observation Data for Precision Farming (EU-FP7-ICT) --- Virtual Observatory Infrastructure for Earth Observation Data (EU-FP7-ICT) Pathfinder --- MonetDB/XQuery: An XQuery Implementation MultimediaN --- Multimedia is the Message BRICKS --- Basic Research in Informatics for Creating the Knowledge Society MIA --- Multimedia Information Analysis Conquer --- Multi-Query Optimization for Data Mining Applications Awards 2020 ACM SIGMOD Contributions Award CWI press release VLDB'2011: Challenges & Visions Track Best Paper Award CWI press release Paper VLDB'2009: 10-year Best Paper Award Pictures CWI press release VLDB 2009 paper VLDB 1999 paper Publications @ Institutional Digital Repository of CWI by Stefan Manegold(et al.): Papers, Lectures, Software, PhD Thesis, (All) by DA members(et al.): Papers, Lectures, Software, Theses, (All) related to   : Papers, Lectures, Software, Theses, (All) @ dblp.uni-trier.de Stefan Manegold @ Google Scholar Stefan Manegold @ ACM Digital Library Stefan Manegold @ ResearchGate Stefan Manegold @ PubZone Stefan Manegold @ citeulike Stefan Manegold @ CiteSeerx (appears to cover only publications before 2007) Stefan Manegold ACM SIGMOD Experimental Repeatability and Workability Evaluation 2012 (Scottsdale) 2011 (Athens)   (advisor) 2010 (Indianapolis)   (co-chair) 2009 (Providence)   (co-chair) 2008 (Vancouver)   (pc member) ACM SIGMOD Workshop Series --- Data Management on New Hardware (2024: Santiago, 2023: Seattle, 2022: Philadelphia (hybrid), 2021: Xi'an (hybrid), 2020: Portland (online/virtual), 2019: Amsterdam, 2018: Houston, 2017: Chicago, 2016: San Francisco, 2015: Melbourne, 2014: Snowbird, 2013: New York, 2012: Scottsdale, 2011: Athens, 2010: Indianapolis, 2009: Providence, 2008: Vancouver, 2007: Beijing, 2006: Chicago, 2005: Baltimore) --- Performance and Evaluation of Data Management Systems (2007: Beijing, 2006: Chicago) --- Testing Database Systems (2018: Houston, 2013: New York, 2012: Scottsdale, 2011: Athens, 2010: Indianapolis, 2009: Providence, 2008: Vancouver) --- XQuery Implementation, Experience and Perspectives (2008: Vancouver, 2007: Beijing, 2006: Chicago, 2005: Baltimore, 2004: Paris) Software \"The Calibrator\" (a Cache-Memory and TLB Calibration Tool) (CWI's disclaimer)",
  "content_length": 4261,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:01"
}