{
  "name": "Stefan K. Muller",
  "homepage": "http://www.cs.iit.edu/~smuller",
  "status": "success",
  "content": "Stefan Muller About Research Advising Publications Teaching Personal CV Stefan K. Muller Gladwin Development Chair Assistant Professor Stuart Building 218E Computer Science Department Illinois Institute of Technology 10 W 31st Street Chicago, IL (first initial) (last name) 2 (at) iit (dot) edu I'm an assistant professor in the Computer Science Department at Illinois Institute of Technology. My research broadly aims to use programming language techniques to make it easier to write correct and efficient software in many application domains, especially parallel computing. While the techniques I use to solve these problems are primarily drawn from PL, my interests have touched on algorithm design and computer systems as well. My interest in application domains spans from AI to computer science education. Interests: Language and type system design Static resource analysis Parallel computing Before Illinois Tech: Postdoc Carnegie Mellon University 2018-20 Advisor: Jan Hoffmann PhD Carnegie Mellon University 2018 Advisor: Umut A. Acar AB Harvard University 2012 Advisor: Stephen Chong Github | Google Scholar | DBLP | MGP Research Graph Types Statically approximate the dependency structure of a parallel program, and use this approximation to construct efficient and language-agnostic analyses for important properties of parallel programs. Responsive Parallelism Extend elegant models of parallel software to account for important features of interactive programs such as responsiveness and priority. Resource-aware GPU Programming Develop tools and analyses to help programmers write more robust, efficient General-Purpose GPU programs. Students and Researchers Current Marelle León (BS) Godha Pallavi Bhogadi (MS, with Farzaneh Derakhshan) Alex Friedman (PhD) Former Anusha Sonte Parameshwar (MS) - Now at Apple Francis Rinaldi (BS) - Now PhD at UPenn Baoshu Feng (visitng researcher) Xiangwei (Shawn) Li (MS) - Now at IGT Deepika Padmanabhan (MCS) - Now at Amazon Aman Luqman (BS) - Now at physIQ Isa Muradli (MS) Pranjal Naik (MCS) My Dinh (BS) - Now at Bloomberg Mark Lou (BS) - Now at American Express Edman Alicea-Marrero (BS) Publications View all publications by year / by topic Recent publications: Teaching At Illinois Tech Spring 2024: CS534. Types and Programming Languages Fall 2023: CS536. Science of Programming Spring 2023: CS440. Programming Languages and Translators. Fall 2022: CS443. Compiler Construction Spring 2022: CS536. Science of Programming Fall 2021: CS 595. Topics and Applications in Programming Languages Spring 2021: CS 440. Programming Languages and Translators At Carnegie Mellon Summer 2018: 15-150. Principles of Functional Programming. Personal My wife, Hannah Ringler, is a faculty member in Illinois Tech's Humanities department. Hobbies Running (still learning routes around Chicago, tell me if you have any favorites!) Homebrewing beer Singing Fun Facts My Bacon number is lower than my Erdős number: Erdős: 4, through Guy Blelloch, Gary Miller and Daniel J. Kleitman, or alternately through Bob Harper, Joseph Yehuda Halpern and Nathan Linial. Bacon: 2, through Tom Hanks (I was an extra in A Beautiful Day in the Neighborhood). Languages Human: English (native), Spanish (intermediate) Programming: OCaml/Standard ML (fluent), Java (intermediate), Python (for prototypes), HTML/JS (when my website needs a redesign), Bash (working knowledge, except of how to write a for loop, which I need to google every single time), Haskell (beginner), C/C++ (if I really have to) Copyright © 2021 Stefan Muller. No framework, but Hugo helped.",
  "content_length": 3586,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:55"
}