{
  "name": "Steffen Bondorf",
  "homepage": "http://steffenbondorf.com",
  "status": "success",
  "content": "Steffen Bondorf | DNet@RUB Skip to main content DNet Home / Team / Steffen Bondorf Prof. Dr.-Ing. Steffen Bondorf DNet | Distributed and Networked Systems Faculty of Computer Science Ruhr University Bochum Building MC, 1st floor, office 95 campus map email: steffen.bondorf(at)rub.de Inquiries not sent from official university email addresses will probably be ignored. web: dnet.rub.de Selected Publications (ordered by publication date) Fabien Geyer and Steffen Bondorf. Network Synthesis under Delay Constraints: The Power of Network Calculus Differentiability. In Proc. of IEEE INFOCOM 2022. [@IEEE, bib, dataset] Fabien Geyer, Alexander Scheffler and Steffen Bondorf. Tightening Network Calculus Delay Bounds by Predicting Flow Prolongations in the FIFO Analysis. In Proc. of IEEE RTAS 2021. [@IEEE, bib, dataset] Steffen Bondorf, Binbin Chen, Jonathan Scarlett, Haifeng Yu and Yuda Zhao. Cross-Sender Bit-Mixing Coding. In Proc. of ACM/IEEE IPSN 2019. [@ACM, IEEE, bib] Fabien Geyer and Steffen Bondorf. DeepTMA: Predicting Effective Contention Models for Network Calculus using Graph Neural Networks. In Proc. of IEEE INFOCOM 2019. [@IEEE, bib] Steffen Bondorf, Paul Nikolaus and Jens B. Schmitt. Quality and Cost of Deterministic Network Calculus â Design and Evaluation of an Accurate and Fast Analysis. In Proc. of ACM SIGMETRICS 2017. [@ACM, bib] Kai Lampka, Steffen Bondorf, Jens B. Schmitt, Nan Guan and Wang Yi. Generalized Finitary Real-Time Calculus. In Proc. of IEEE INFOCOM 2017. [@IEEE, bib] Steffen Bondorf and Jens B. Schmitt. Boosting Sensor Network Calculus by Thoroughly Bounding Cross-Traffic. In Proc. of IEEE INFOCOM 2015. [@IEEE, bib] Publication Lists: DBLP, Google Scholar, Semantic Scholar, Web of Science, disco@RPTU, DNet, RUB Bio Steffen Bondorf is the Professor of distributed and networked systems in the Faculty of Computer Science at Ruhr University Bochum, Germany. His main research interests are in performance modeling and analysis of determinsitic networking, in particular, using network calculus. Steffen studied computer science at TU Kaiserslautern (TUK), Germany. He was the first student who enrolled into a B.Sc. program at TUK before finishing secondary education. Subsequently, Steffen received his B.Sc., M.Sc. and Dr.-Ing. (equivalent to Ph.D.) in Computer Science from TUK, where he was part of the distributed computer systems lab. After graduation, Steffen was a postdoctoral researcher, lecturer and Carl-Zeiss Fellow in the Dept. of Computer Science at TUK, a research fellow in the School of Computing at the National University of Singapore as well as visiting researcher in the Dept. of Electrical and Computer Engineering at the University of Toronto, Canada. From fall 2018 to fall 2019, Steffen was funded by an ERCIM (European Research Consortium for Informatics and Mathematics) Alain-Bensoussan fellowship to join the Dept. of Information Security and Communication Technology at NTNU Trondheim, Norway, and took a sojourn in the Kopernic group at INRIA Paris. Steffen Bondorf was appointed as assistant professor at RUB on 01 October 2019, becoming the university’s first hire in the joint tenure-track program of the federal and state governments for the promotion of young scientists. Since 01 December 2021, Steffen Bondorf is a tenured full professor. gdoc_arrow_left_alt Team Wlad Pesotsky gdoc_arrow_right_alt",
  "content_length": 3386,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:31"
}