{
  "name": "Stefan Weber 0003",
  "homepage": "https://www.scss.tcd.ie/Stefan.Weber",
  "status": "success",
  "content": "Stefan Weber Prof Stefan Weber School of Computer Science & Statistics Professor Stefan Weber Email: stefan.weber@tcd.ie Phone +353-1-896 8423 School of Computer Science and Statistics Lloyd Institute, Room 1.41, Trinity College Dublin 2, Ireland Research Research Interests Distributed Systems - Internet of Things - Communication Protocols - Virtual Networks & Deployments - Security & Botnets Information-Centric Networking (ICN) ICN provides and alternative networking approach to the host-based communication of the Internet Protocol (IPv4/v6). The idea is to focus on data that is to be exchanged between endpoints and to make the network infrastructure itself the source for and storage of data. So, instead of asking the network to transport a data unit to an endpoint, the network can be asked to retrieve information given a specific name either from a producer of this information or a cached version of the information from an element of the network infrastructure. This change in approach from traditional networking brings with it opportunities and challenges. I'm interested in exploring the development of applications and approaches that adopt to and exploit the capabilities of ICN and in the management of infrastructure elements that make up the topology of an ICN-based topology. Caching in ICN (Andriana Ioannou) Fault-Management in ICN (Paul Duggan) Integration of OpenFlow in ICN (Jeeva Ravachendra) Game-Development on ICN (Stefano Lupo) Security, Botnets & Honeypots Botnets represnt one of the most successful widespread (and under-estimated) application of distirbuted systems. I'm interested in this overlap of networking and distributed systems where network resources are exploited to establish a loosely-coupled, widely-distributed solutions. The migration to container-based solutions hosted in virtual topologies in data centre infrastructures represents a new interesting breeding ground for these types of applications. Honeypots in container-based deployments (Amber Higgins) Widely-Distributed Network Telescope (Joseph O'Hara) Mobile Ad hoc Networks (MANETs) Nodes in an ad hoc network form a temporal topology of loosely-coupled nodes - generally using wireless communication while changing their locations. These characteristics are at odds with assumptions that underly protocols used in most other networks and may cause significant problems for traditional protocols. My interest in this area has been driven by the challenge to establish a mechanism that maximises communication throughput in the presence of mobility and disconnection while exploiting the advantages of wireless communication and mobility. Real-Time Ad hoc Networks (Mark Gleeson) Service-based Communication (Warren Kenny) Cooperative Routing (Guoxian Yang) Delay-Tolerant Networking Current protocols such as the Transmission Control Protocol (TCP) rely on closely-synchronised communication that require endpoints to be contemporanously available to react to transmission events. Scenarios where endpoints are not available to react to transmission events are - similar to MANETs - an interesting area where traditional protocols tend to fail and alternative apporoaches are needed. Discovery of DTN Endpoints (Alex McMahon) Combining MQTT and DTN (Cal Martin) EU FP7 N4C Project (Stephen Farrell) Papers Google Scholar, Orcid Teaching CSU33031 Computer Networks CS7NS2 Internet of Things * Based on a webpage by Doug Leith",
  "content_length": 3439,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:14"
}