{
  "name": "Stefan Milius",
  "homepage": "https://www8.cs.fau.de/doku.php?id=milius",
  "status": "success",
  "content": "Prof. Dr. Stefan Milius - Lehrstuhl für Informatik 8 (Theoretische Informatik) Organisationsmenü öffnen Organisationsmenü schließen Friedrich-Alexander-Universität Lehrstuhl für Informatik 8 (Theoretische Informatik) Prof. Dr. Stefan Milius Prof. Dr. Stefan Milius Phone: +49 (0)9131 / 85 64058 Email: stefan [dot] milius [at] fau [dot] de Address: Friedrich-Alexander Universität Erlangen-NürnbergLehrstuhl für Informatik 8 (Theoretische Informatik)Martensstr. 3D-91058 Erlangen Room: 11.152 About Me I am a Senior Lecturer (german: Akademischer Direktor) at the Chair for Theoretical Computer Science of FAU Erlangen-Nürnberg. Research Publications My research interests include: coalgebras and their application in computer science semantics of iteration and recursion universal algebra and category theory logic and formal verification of systems Awards Best Theory Paper at FM 2019 for „Generic Partition Refinement and Weighted Tree Automata“ (with H.-P. Deifel, L. Schröder and T. Wißmann) EATCS Best Paper Award at MFCS 2017 for „Eilenberg Theorems for Free“ (with J. Adamek and H. Urbat) CALCO 2015 Best Paper Award for „Syntactic Monoids in a Category“ (with J. Adamek and H. Urbat) Ackermann Award 2006 for my PhD thesis. Braunschweig Preis für hervorragende Leistungen im Studium, 2000. Editorial Activities Member of the Advisory Board of TheoretiCS (since 2019) Editor-in-Chief of Logical Methods in Computer Science (since 2020) Editorial board member of Applied Categorical Structures (since 2020) Conference on Algebra and Coalgebra in Computer Science (CALCO), Steering Committee cochair (with M. Roggenbach, 2015-2022) International Workshop on Coalgebraic Methods in Computer Science (CMCS), Steering Committee chair (2015-2022) Executive Editor of Logical Methods in Computer Science (since 2014) Program Committees 29th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS 2026), PC co-chair 41st Conference on Mathematical Foundations of Programming Semantics MFPS XLI (MFPS 2025), PC co-chair 40th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2025), PC member 26th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS 2023), PC member 47th International Symposium on Mathematical Foundations of Computer Science (MFCS 2022), PC member 46th International Symposium on Mathematical Foundations of Computer Science (MFCS 2021), PC member 29th EACSL Annual Conference on Computer Science Logic (CSL 2021), PC member 14th International Workshop on Coalgebraic Methods in Computer Science (CMCS 2018), PC member 32th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2017), PC member 7th Conference on Algebra and Coalgebra in Computer Science (CALCO 2017), PC member 37th IFIP WG 6.1 International Conference on Formal Techniques for Distributed Objects, Components, and Systems (FORTE 2017), PC member 13th International Workshop on Coalgebraic Methods in Computer Science (CMCS 2016), PC member 6th Conference on Algebra and Coalgebra in Computer Science (CALCO 2015), PC member 21st Workshop on Expressiveness in Concurrency and 11th Workshop on Structural Operational Semantics (EXPRESS/SOS 2014), PC member 30th Conference on Mathematical Foundations of Programming Semantics (MFPS XXX), PC member 12th International Workshop on Coalgebraic Methods in Computer Science (CMCS 2014), PC member 5th Conference on Algebra and Coalgebra in Computer Science (CALCO 2013), PC co-chair 11th International Workshop on Coalgebraic Methods in Computer Science (CMCS 2012), PC member 10th International Workshop on Coalgebraic Methods in Computer Science (CMCS 2010), PC member 3rd Conference on Algebra and Coalgebra in Computer Science (CALCO 2009), PC member 8th International Workshop on Coalgebraic Methods in Computer Science (CMCS 2006), PC member Current Teaching Concerning topics for thesis projects ask me directly. Theoretische Informatik für Wirtschaftsinformatik und Lehramt Old Projects Projekt VerSyKo Master thesis Relations in Categories Student research project in computer science on Multiplication of sparse matrices with an instruction systolic array Alan – a simulator for Turing machines that was developed during the software engineering practicum in 1997. Graphics Vision: a library for graphical user interfaces with Turbo Pascal developed between 1992 and 1996.",
  "content_length": 4414,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:00"
}