{
  "name": "Stefanie Müller 0001",
  "homepage": "https://www.csail.mit.edu/user/4778",
  "status": "success",
  "content": "Stefanie Mueller | MIT CSAIL Skip to main content PI Core/Dual Stefanie Mueller Associate Professor Email stefanie.mueller@mit.edu Phone 715-5831 Room 32-211 Stefanie Mueller is the TIBCO Career Development Associate Professor in the MIT EECS department and a member of the Computer Science and Artificial Intelligence Laboratory. In her research, she develops novel hardware and software systems that advance personal fabrication technologies. Stefanie publishes her work at the most selective HCI venues CHI and UIST and has received several best paper and honorable mention awards. Stefanie was named a Forbes 30 under 30, an MIT Technology Review Innovator under 35 (TR35), and has received a Sloan Fellowship, Microsoft Research Fellowship and NSF CAREER Award. Stefanie has served as both an ACM CHI 2023 paper chair as well as an ACM UIST 2020 paper chair. Stefanie has been an invited speaker at universities and research labs, such as Harvard, Stanford, UC Berkeley, CMU, Microsoft Research, Disney Research, and Adobe Research. Stefanie directs the HCI Engineering group at CSAIL and is actively recruiting Postdocs, PhD students, and interns interested in helping to kickstart this new lab. Interested Postdocs can email her directly. For a PhD position please apply through MIT's PhD admission page. Related Links Website Last updated Sep 17 '24 Research Areas Human-Computer Interaction Impact Areas Manufacturing Related Links Website Projects Project FoldTronics: Creating 3D Objects with Integrated Electronics Using Foldable Honeycomb Structures HCI Engineering Group FoldTronics creates shape-changing 3D objects with integrated electronics. Stefanie Mueller Leads Stefanie Mueller Research Areas Human-Computer Interaction Impact Areas Internet of Things Manufacturing Stefanie Mueller Project SensiCut: Material-Aware Laser Cutting Using Speckle Sensing and Deep Learning HCI Engineering Group SensiCut augments standard laser cutters with a speckle sensing add-on that can identify common workshop materials, including visually similar ones. Stefanie Mueller Leads Stefanie Mueller Research Areas AI & ML Graphics & Vision Human-Computer Interaction Robotics Impact Areas Manufacturing Stefanie Mueller Project G-ID: Identifying 3D Prints Using Slicing Parameters HCI Engineering Group G-ID is a method that utilizes the subtle patterns left by the 3D printing process to distinguish and identify objects that otherwise look similar to the naked eye. Faraz Faruqi Stefanie Mueller Leads Faraz Faruqi Stefanie Mueller Research Areas Graphics & Vision Human-Computer Interaction Impact Areas Internet of Things Manufacturing Faraz Faruqi Stefanie Mueller Project New Interaction Models for Personal Fabrication Interfaces Human-Computer Interaction Community of Research Inspired by the history of the user interface for personal computing, we are developing new interaction models for personal fabrication. Stefanie Mueller Leads Stefanie Mueller Research Areas Human-Computer Interaction Impact Areas Manufacturing Stefanie Mueller 1 More Groups Community of Research Human-Computer Interaction Community of Research The focus of the HCI CoR is inventing new systems and technology that lie at the interface between people and computation, and understanding their design, implementation, and societal impact. +3 David Karger Leads David Karger Research Areas Graphics & Vision Human-Computer Interaction Programming Languages & Software Engineering Impact Areas Education Entertainment Manufacturing Lead David Karger +3 David Karger Research Group HCI Engineering Group We work at the intersection of human computer interaction and personal fabrication tools. Stefanie Mueller Leads Stefanie Mueller Research Areas Human-Computer Interaction Impact Areas Education Energy Entertainment Health Care Internet of Things Manufacturing Lead Stefanie Mueller Stefanie Mueller Research Group Human-Computer Interaction HCI faculty and researchers in CSAIL. Leads Randall Davis Fredo Durand Daniel Jackson David Karger Rob Miller Stefanie Mueller Research Areas Human-Computer Interaction Lead Randall Davis Fredo Durand Daniel Jackson David Karger Rob Miller Stefanie Mueller News AI & ML Graphics & Vision Human-Computer Interaction Entertainment Manufacturing September 19 '25 CSAIL research at the intersection of holographic art and human-computer interaction MIT CSAIL team creates a special program at the MIT Museum, featuring talks and new holographic sculptures. It links CSAIL’s color-changing research to MIT’s holographic history. CSAIL research at the intersection of holographic art and human-computer interaction Human-Computer Interaction Energy Entertainment September 10 '25 MIT software tool turns everyday objects into animated, eye-catching displays The FabObscura system helps users design and print barrier-grid animations without electronics, and can help produce dynamic household, workplace, and artistic objects. MIT software tool turns everyday objects into animated, eye-catching displays AI & ML Human-Computer Interaction Energy Entertainment Health Care Manufacturing September 04 '25 A greener way to 3D print stronger stuff MIT CSAIL researchers developed SustainaPrint, a system that reinforces only the weakest zones of eco-friendly 3D prints, achieving strong results with less plastic. A greener way to 3D print stronger stuff Human-Computer Interaction Manufacturing Wireless August 18 '25 A shape-changing antenna for more versatile sensing and communication You can adjust the frequency range of this durable, inexpensive antenna by squeezing or stretching its structure. A shape-changing antenna for more versatile sensing and communication Graphics & Vision Human-Computer Interaction Entertainment Manufacturing April 22 '25 3D modeling you can feel TactStyle, a system developed by CSAIL researchers, uses image prompts to replicate both the visual appearance and tactile properties of 3D models. 3D modeling you can feel Graphics & Vision Human-Computer Interaction Education Entertainment Health Care April 07 '25 A new way to bring personal items to mixed reality “InteRecon” enables users to capture items in a mobile app and reconstruct their interactive features in mixed reality. The tool could assist in education, medical environments, museums, and more. A new way to bring personal items to mixed reality Human-Computer Interaction Entertainment Manufacturing March 18 '25 3D printing approach strings together dynamic objects for you “Xstrings” method enables users to produce cable-driven objects, automatically assembling bionic robots, sculptures, and dynamic fashion designs. 3D printing approach strings together dynamic objects for you Human-Computer Interaction Entertainment January 08 '25 Images that magically transform through heat The Thermochromorph printmaking technique developed by CSAIL researchers allows images to transition into each other through changes in temperature. Images that magically transform through heat Algorithms & Theory Graphics & Vision Human-Computer Interaction Education Entertainment July 14 '22 3 Questions: Teaching computational maker skills through gaming With FabO, PhD student Dishita Turakhia wants to empower students to learn digital fabrication by making video game objects and characters come alive. 3 Questions: Teaching computational maker skills through gaming 6 More",
  "content_length": 7394,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:20"
}