{
  "name": "Stefan Conrad 0001",
  "homepage": "https://dbs.cs.uni-duesseldorf.de/mitarbeiter.php?id=conrad",
  "status": "success",
  "content": "Universität Düsseldorf: Informatik - Lehrstuhl Datenbanken und Informationssysteme Heinrich-Heine-Universität Düsseldorf Datenbanken und Informationssysteme Portale ULB-Katalog Intranet HHU Start Fakultäten MNF Fächer Informatik Lehrstühle und Arbeitsgruppen Datenbanken & Informationssysteme Zurück zur Informatik Aktuelles / Termine Unser Team Lehre Unsere Forschung Publikationen Datasets Sonstiges Kontakt Datenschutz Impressum Serviceseiten Shortcuts Transaktionsverwaltung DBS-Praktikum Abschlussarbeiten Mitarbeiter am Lehrstuhl Prof. Dr. Stefan Conrad Email: Stefan.Conrad@uni-duesseldorf.de Telefon:+49.211.81-14088 Raum:25.12.02.24 Heinrich-Heine-Universität Düsseldorf Institut für Informatik Datenbanken und Informationssysteme Universitätsstr. 1 D-40225 Düsseldorf, Germany Forschungsprojekte Publikationen - Weitere Informationen - https://orcid.org/0000-0003-2788-3854 Research interests: knowledge discovery / data mining / machine learning natural language processing multimedia information retrieval data and schema integration database design federated databases, P2P databases, ... ... Participation in larger Projects (ongoing): Mediating Machines supported by Volkswagenstiftung Entscheidungsfindung mit Hilfe von Methoden der Künstlichen Intelligenz supported by Manchot-Stiftung NRW-Fortschrittskolleg Online-partizipation support by Ministerium für Kultur und Wissenschaft, Federal State North Rhine-Westphalia Zurück zur Übersicht Heinrich Heine Universität Datenbanken und Informationssysteme Lehrstuhlinhaber Prof. Dr. Stefan Conrad Universitätsstr. 1 40225 Düsseldorf Gebäude: 25.12 Etage/Raum: 02.24 Tel.: +49 211 81-14088 E-Mail senden Sekretariat Lisa Lorenz Universitätsstr. 1 40225 Düsseldorf Gebäude: 25.12 Etage/Raum: 02.22 Tel.: +49 211 81-11312 E-Mail senden Verantwortlich für den Inhalt: Datenbanken & Informationssysteme © Copyright 2002-2023 Datenbanken & Informationssysteme Impressum Datenschutz Kontakt",
  "content_length": 1947,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:47"
}