{
  "name": "Stefanie Roos",
  "homepage": "https://sds.cs.rptu.de/pages/stef.html",
  "status": "success",
  "content": "AG Secure Decentralized Systems Stefanie Roos Office: 36/432 Office Hours: Friday 14:00 (during lecture period) or by appointment Email: stefanie.roos AT cs.rptu.de Mailing address: Rheinland-Pfaelzische Technische Universitaet Kaiserslautern-Landau FB Informatik/AG Sichere Dezentrale Systeme PO box 3049, 67663 Kaiserslautern, Germany Starting from April 2023, I lead the group Secure Decentralized Systems at RPTU Kaiserslautern-Landau. Before joining the CS department in Kaiserlautern, I was an assistant professor at TU Delft (2018-2023) and a post-doctoral researcher at University of Waterloo, working with Prof. Ian Goldberg (2016-2018). My PhD thesis, supervised by Prof. Dr. Thorsten Strufe at TU Dresden, won the KuVS award for the best PhD thesis in the area of networks and distributed systems in Germany. My research focuses on trade-offs between privacy, security, and performance in decentralized systems. My work includes P2P Networks, with a focus on anonymity and censorship resistance. For instance, I contributed to the censorship-resistant P2P Network Freenet. Furthermore, I have worked on payment channel networks like Lightning, which improve the scalability of blockchains by allowing some transactions to be conducted locally. In particular, I designed SpeedyMurmurs, a local payment routing algorithm. At the moment, I am involved in various projects that analyze and improve the security and privacy of distributed machine learning systems such as Federated Learning and Multi-Discriminator GANs. For more information about on-going projects, please consult our Research page. Selected publications: Stefanie Roos, Pedro Moreno-Sanchez, Aniket Kate, Ian Goldberg: Settling Payments Fast and Private: Efficient Decentralized Routing for Path-Based Transactions, NDSS 2018 Stefanie Roos, Martin Beck, Thorsten Strufe: Anonymous Addresses for Efficient and Resilient Routing in F2F Overlays, INFOCOM 2016 Stefanie Roos, Benjamin Schiller, Stefan Hacker, Thorsten Strufe: Measuring Freenet in the Wild: Censorship-Resilience under Observation, PETS 2014 Lewis Gudgeon, Pedro Moreno-Sanchez, Stefanie Roos, Patrick McCorry, Arthur Gervais: SoK: Layer-Two Blockchain Protocols, FC 2020 Jiyue Huang, Zilong Zhao, Lydia Y. Chen, Stefanie Roos: Fabricated Flips: Poisoning Federated Learning without Data, DSN 2023",
  "content_length": 2335,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:17"
}