{
  "name": "Stefan Voß",
  "homepage": "https://www.bwl.uni-hamburg.de/iwi/team/mitglieder/stefan-voss.html",
  "status": "success",
  "content": "Prof. Dr. Stefan Voß : Institut für Wirtschaftsinformatik : Universität Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußFoto: UHH/SchwartzProf. Dr. Stefan VoßFoto: Stefan VoßProfessorDekanatsmitglied der Fakultät für BetriebswirtschaftAnschriftUniversität HamburgUniversity of Hamburg Business SchoolInstitut für Wirtschaftsinformatik IVon-Melle-Park 520146 HamburgBüroVMP 5Raum: 3064SprechzeitenBitte beachten Sie die Hinweise auf der TitelseiteKontaktTel.: +49 40 42838-3062Fax: +49 40 42838-5535E-Mail: stefan.voss\"AT\"uni-hamburg.deSchwerpunkteWirtschaftsinformatikAuszeichnungenLifetime Achievement Award der INFORMS SocietyBegleitung von Doktoranden, Habilitanden und StipendiatenTätigkeit als Doktorvater Name Promotion Universität aktuelle Tätigkeit Yingjing Yu 23.06.2023 UHH Forschungsstelle Ahoi-Digital, UHH Philip Cammin 20.01.2023 UHH Branko Bubalo 18.12.2020 UHH Consultant KPMG, Berlin Sascha Ruja 19.12.2019 UHH Business Development Director - Consulting & Operations at Egis, Saint-Quentin-en-Yvelines, Frankreich Adriana Moros-Daza 19.12.2019 UHH, Universidad del Norte, Barranquilla Assistant Professor, Universidad del Norte, Barranquilla Andreas Görler 23.02.2018 UHH Business Manager, Innovation & Digital MRO @ Lufthansa Industry Solutions, Hamburg Leonard Heilig 11.09.2017 UHH Co-Founder DriveMyBox, Forschungsgruppenleiter im IHATEC Projekt \"Twin-Sim\", UHH Frederik Schulte 30.10.2017 UHH Associate Professor, TU Delft, Niederlande Yingjie Fan 19.06.2017 UHH Assistant Professor, Universität Leiden Alessandro Hill April 2016 UHH Assistant Professor, California Polytechnic State University-San Luis Obispo, USA Julia Pahl 18.05.2012 UHH Associate Professor, Syddansk University, Odense, Dänemark Xiaoning Shi 13.10.2011 UHH Deutsches Zentrum für Luft- und Raumfahrt, Berlin Torsten Reiners Mai 2005 UHH Curtin University, Perth, Australien Imke Sassen Andreas Witt 2004 UHH, TU Braunschweig Professor, Hochschule Fulda Jürgen Böse 2002 UHH, TU Braunschweig Professor, Ostfalia Hochschule für angewandte Wissenschaften Kai Gutenschwager 2001 TU Braunschweig Professor, Ostfalia Hochschule für angewandte Wissenschaften Andreas Fink 2000 TU Braunschweig Professor, Helmut-Schmidt Universität, Hamburg Tätigkeit als Habilitationsvater Name Habilitation Universität aktuelle Tätigkeit Marco Caserta 18.01.2018 UHH Assistant Professor, IE University, Madrid, Spanien Silvia Schwarze 2015 UHH Dakosy, Hamburg Stefan Lessmann 2013 UHH Professor, HU Berlin Betreuer Alexander von Humboldt-Stipendiaten Name Zeitraum des Stipendiums Universität aktuelle Tätigkeit Malek Sarhani September 2019 - Januar 2022 UHH Assistant Professor, Al Akahwayn University, Ifrane, Marokko Eduardo Lalla-Ruiz Januar 2016- Juli 2018 UHH Assistant Professor, University of Twente, Niederlande LehreDie universitären Lehrveranstaltungen des Instituts konzentrieren sich auf alle studentischen Ebenen aus der Wirtschaftsinformatik, Betriebswirtschaftslehre, Mathematik, Informatik und Wirtschaftsingenieurwesen.Neben der Einführung in die Wirtschaftsinformatik vertiefen weitere Kurse das Bachelor- und Masterstudium mit klassischen und modernen Themen wie Projektmanagement, Planung und Entscheidungsanalyse und aktuellen Entwicklungen in der Wirtschaftsinformatik. Das Ziel des Studiums ist die Fähigkeit analytisches Denken für komplexe Zusammenhänge in den entsprechenden Bereichen zu entwickeln und kreative Lösungsansätze durch fundierte Kenntnisse in der Methodik zu generieren. Im Promotionsstudium werden Schwerpunkte in den Bereichen Computational Logistics und Metaheuristiken gesetzt.ForschungsinteressenHerr Prof. Voß hat besonderes Interesse an den Bereichen Wirtschaftsinformatik, Supply Chain Management und Logistik sowie Intelligent Search. Aufgrund zahlreicher Publikationen auf diesen Gebieten genießt er einen internationalen Ruf. Aktuelle Forschungsprojekte sind beispielsweise Problemstellungen im Bereich von Informationssystemen im Transportwesen und Supply Chain Management sowie Meta-Heuristiken und intelligente Suchalgorithmen in praktischen Anwendungen. Prof. Voß beteiligt sich an Gutachterkommissionen und Herausgeberschaften für Fachzeitschriften wie dem Public Transport Journal und der Zeitschrift Netnomics.MitgliedschaftenAuswahl: PublikationenAuswahl einiger Veröffentlichungen (fast komplette Publikationsliste): Bücher: Computational Logistics (Lecture Notes in Computer Science 10572/Ed.; with T. Bektas, S. Coniglio, A. Martinez-Sykora). Springer, Berlin (2017). [DOI 10.1007/978-3-319-68496-3] Computational Logistics (Lecture Notes in Computer Science 9855/Ed.; with A. Paias and M. Ruthmair). Springer, Berlin (2016). Computational Logistics (Lecture Notes in Computer Science 9335/Ed.; with F. Corman and R.R. Negenborn). Springer, Berlin (2015). Computational Logistics (Lecture Notes in Computer Science 8760/Ed.; with R. Gonzalez, F. Schulte and J. Ceroni). Springer, Berlin (2014). Hybrid Metaheuristics (Lecture Notes in Computer Science 8457/Ed.; with M.J. Blesa and C. Blum). Springer, Berlin (2014). Computational Logistics (Lecture Notes in Computer Science 8197/Ed.; with D. Pacino and R.M. Jensen). Springer, Berlin (2013). Computational Logistics (Lecture Notes in Computer Science 7555/Ed.; with H. Hu, X. Shi and R. Stahlbock). Springer, Berlin (2012). Network Optimization (Lecture Notes in Computer Science 6701/Ed.; with J. Pahl and T. Reiners). Springer, Berlin (2011). [ISBN: 978-3-642-21526-1] [DOI: 10.1007/978-3-642-21527-8] Computational Logistics (Lecture Notes in Computer Science 6971/Ed.; with J. Böse, H. Hu, C. Jahn, X. Shi, R. Stahlbock). Springer, Berlin (2011). [ISBN: 978-3-642-24263-2] [DOI 10.1007/978-3-642-24264-9] Zeitschriften- und Sammelbandartikel: Decomposition based matheuristic for airline crew rostering problems with fair working time (with T. Doi and T. Nishi). European Journal of Operational Research, online available. [DOI 10.1016/j.ejor.2017.11.046] A dynamic programming-based matheuristic for the dynamic berth allocation problem (with T. Nishi, T. Okura and E. Lalla-Ruiz). Annals of Operations Research, online available. [DOI 10.1007/s10479-017-2715-9] Generalized local branching heuristics and the capacitated ring tree problem (with A. Hill). Discrete Applied Mathematics, online available. [DOI https://doi.org/10.1016/j.dam.2017.09.010] A POPMUSIC-based approach for the berth allocation problem under time-dependent limitations (with E. Lalla-Ruiz, C. Exposito-Izquierdo, B. Melian-Batista and J. M. Moreno-Vega). Annals of Operations Research 253 (2017), 871 - 897. Modeling the parallel machine scheduling problem with step deteriorating jobs (with E. Lalla-Ruiz). European Journal of Operational Research  255 (2016), 21 - 33. An improved formulation for the multi-depot open vehicle routing problem (with E. Lalla-Ruiz, C. Exposito-Izquierdo and S. Taheripour). OR Spectrum 38 (2016) 175 - 187.weitere Aktivitäten Mehrere Consulting-Projekte Gastprofessuren (z.B. in Graz, Österreich und Valenciennes, Frankreich) Mitbegründer der ICCL-Konferenz (International Conference on Computational Logistics: www.computational-logistics.de) Organisationen weiterer Konferenzen (z. B. der MH und HM 2014 in Hamburg, der GPRA Global Port Alliance 2016 in Hamburg oder der IAME 2016) und Mitglied in Ausschüssen von zahlreichen internationalen Konferenzen (z.B. der HICSS). Book Series Editor Operations Research / Computer Science Interfaces und Integrated Series in Information Systems IS2 (Springer) WerdegangProf. Voß hat einen Abschluss in Mathematik (Diplom) und Betriebswirtschaftslehre an der Universität Hamburg und promovierte und habilitierte an der TU Darmstadt. Vorherige Positionen sind ordentlicher Professor und geschäftsführender Direktor des Lehrstuhls für allgemeine Betriebswirtschaftslehre, Wirtschaftsinformatik und Informationsmanagement an der Technischen Universität Braunschweig von 1995 bis 2002.",
  "content_length": 7967,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:12"
}