{
  "name": "Stefan Wolfgang Pickl",
  "homepage": "https://www.unibw.de/comtessa",
  "status": "success",
  "content": "Comtessa — comtessa Skip to main content Forschungsgruppe COMTESSA Core Competence CenterOperations ResearchTenacity - Management - ExcellenceSafety & Security ALLIANCE Die Professur für Operations Research an der Universität der Bundeswehr München hat in den letzten Jahren das Kompetenzzentrum COMTESSA (Core Competence Center for Operations Research, Management-Tenacity-Excellence, Safety & Security ALLIANCE) begleitend entwickelt. Im wissenschaftlichen Interesse steht die Analyse und Simulation komplexer Systeme sowie die Entwicklung von Optimierungsverfahren zur IT-basierten Entscheidungsunterstützung. Die Arbeitsgruppe von Prof. Dr. Stefan Pickl ist Mitglied der internationalen Forschungszentren MUNICH AEROSPACE, CENETIX-NPS, CITA und CODE - Cyber Defence and Smart Data, dtec.bw und SENS. Prof. Pickl leitete im Rahmen des BMBF-Sicherheitsprogrammes 2012-2018 die beiden BMBF Projekte „RIKOV“ (Risiken und Kosten der terroristischen Bedrohungen des schienengebundenen ÖPV) und „REHSTRAIN“ (REsilience of the Franco-German High Speed TRAIn Network), die große internationale Aufmerksamkeit erhielten. Prof. Pickl ist der Auslandsbeauftragte der UniBw M für die Fakultät Informatik. Prof. Dr. Stefan W. Pickl Chair for Operations Research März 2022 Das Team Comtessa Andrei-Cristian Florea B. Eng. Techn.Ang. Juniorprof. Dr. rer. nat. Maximilian Moll Professor(in) Rohan Krishna Saxena B. Eng. Gast Rudy Milani M.Sc. Wiss.Mitarbeiter(in) Matthias Schilling M.Sc. Wiss.Mitarbeiter(in) Andrei Darii B. Eng. Techn.Ang. Tino Krug Systemadministrator Stefan Klug M.Sc. Wiss.Mitarbeiter(in) Philipp Triebold M.Sc. Wiss.Mitarbeiter(in) Univ.-Prof. Dr. Stefan Pickl Univ.-Prof. Dr. Brigitte Buchetmann Wiss.Mitarbeiter(in) Dr. oec. troph. Andrea Ferstl Team Coordination Joshua Arnold M.Sc. Wiss.Mitarbeiter(in) Sascha-André Schuster M.Sc. Wiss.Mitarbeiter(in) Dr. Marian Sorin Nistor Wiss.Mitarbeiter(in) Caroline Iliadi Sekretär(in) Ulrike Stein Teamassistenz Aktuelles DigiTwin 2025 The 5th Digital Twin International Conference (DigiTwin 2025) will be held from Oct 14th to 18th, 2025, at Garmisch-Partenkirchen, Germany. Promotion Jake Ehrlich Stellenausschreibungen Exciting PhD Opportunity: Enhance Resilience in Critical Infrastructure and Counter Hybrid Threats with Advanced Operations Research Alle anzeigen Links SENS SENS Forschungszentrum SENS akademie akademie Programm zur Frühförderung von Hochbegabten GLL GLL George-Leitmann-Lecture GOR GOR Gesellschaft für Operations Research e.V.",
  "content_length": 2506,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:13"
}