{
  "name": "Stefan Kramer 0001",
  "homepage": "https://www.datamining.informatik.uni-mainz.de/stefan-kramer",
  "status": "success",
  "content": "Prof. Dr. Stefan Kramer | Data Mining Skip to contentNavigationsmenüProf. Dr. Stefan KramerRoom: 03-617 Johannes Gutenberg – Universität Mainz Institut für Informatik Staudingerweg 9 55128 Mainz, Germany For requests and questions regarding my role as AI Pilot of Rhineland-Palatinate (KI-Lotse des Landes Rheinland-Pfalz) for the life sciences, please contact: E-Mail: ki-lotse-rlp@uni-mainz.de Julia Reichenpfader Phone: +49 6131 39-36094 E-Mail: kramer [at] informatik [dot] uni [dash] mainz [dot] de Office Phone: +49 6131 39-26787 (Sylvia Steinmetz) or +49-6131-39-27851 (Kaija Krüger) For requests concerning thesis topics, lectures or teaching related inquiries, please write to datamining@uni-mainz.de Research Interests Data mining and machine learning on structured data: sequences, strings/text, trees, graphs, logics, time series, ... Knowledge and (machine) learning Stream mining Data mining and machine learning under constraints like privacy, confidentiality and transparency Computational scientific discovery \"So good\" applications: applications of data mining and machine learning for social good, in medicine/in the life sciences, in computational sustainability (energy, mobility, ...), ... Current Activities Program Chair of the European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML/PKDD) 2021 in Bilbao Spokesperson of the Network for Deep Continuous-Discrete Machine Learning (DeCoDeML) of the Rhein-Main universities (Johannes Gutenberg University Mainz, Technische Universität Darmstadt, Goethe University Frankfurt) BMBF Plattform Lernende Systeme AG2: Technologische Wegbereiter und Data Science BMBF Plattform Industrie 4.0: AG2/Projektgruppe Künstliche Intelligenz KI Board Rheinland-Pfalz ZIRP Advisory Board Projektgruppe Data Literacy Education (DLE) @ JGU Projektgruppe der Koordinationsstelle Digitaler Wandel in Studium und Lehre (DWSL) @ JGU Projektgruppe KI@JGU Further and past activities: see below Publications Computer science publications (DBLP):  https://dblp.uni-trier.de/pers/hd/k/Kramer_0001:Stefan Life science publications (PubMed collection): https://www.ncbi.nlm.nih.gov/myncbi/browse/collection/57464698/?sort=date&direction=descending Google scholar: https://scholar.google.de/citations?user=0QXx46sAAAAJ&hl=de&oi=ao Bio 1994-1999 Austrian Research Institute for Artificial Intelligence (group of Prof. Gerhard Widmer), 1994-1999 Siemens AG Austria Program and Systems Engineering (group of Prof. Hermann Kaindl), 1999 Dr. techn. from Technische Universität Wien, 2000-2002 University of Freiburg (chair of Prof. Luc De Raedt), 2003-2011 Associate Professor at the Computer Science Department of Technische Universität München, 2011- Full Professor at the Institute of Computer Science of Johannes Gutenberg University Mainz, 2012-2016 Vice General Manager of the Institute of Computer Science, 2016-2018 General Manager of the Institute of Computer Science, 2017- Honorary Professor of the University of Waikato As of 1/2018: more than 200 peer-reviewed publications, thereof 150 conference and journal publications; program committee member of more than 120 conferences or workshops; supervision of more than 90 BSc, MSc, diploma theses and 14 completed PhD theses; acquisition of more than 30 projects, funded by the European union, the DFG, BMBF, the Carl Zeiss foundation, industry, and others. Only active university professor in the German speaking countries with contributions to the first international conferences on data mining (KDD '95, KDD '96, KDD '97). Awards Best Application Paper Runner-Up: 7th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD-2001); Best Theory Paper: 16th International Conference on Inductive Logic Programming (ILP-2006); Best Application Paper: 8th IEEE International Conference on Data Mining (ICDM-2008); Senior Author of Best Student Paper: 8th IEEE International Conference on Big Knowledge (ICBK-2017); Best Paper: 10th IEEE International Conference on Big Data (ICBK-2019) Professional Activities General 2008-2016, 2018- Editorial Board of Machine Learning; Vice-Chair of the 13th IEEE International Conference on Data Mining (ICDM-2013); (Co-)Organizer of the first ECML/PKDD in 2001 in Freiburg; Workshop and Tutorial Chair of the 14th European Conference on Machine Learning (ECML-2003) and the 7th European Conference on Principles and Practice of Knowledge Discovery in Databases (PKDD-2003); Highlights Track Area Chair of: ISMB 2012, ISMB/ECCB 2013, ISMB 2014, ISMB/ECCB 2015; Area Chair of the European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases: ECML/PKDD-2017, ECML/PKDD-2014, ECML/PKDD-2013, ECML/PKDD 2007, ECML/PKDD-2006; Data Mining Track Chair of the ACM Symposium on Applied Computing (SAC-2014, SAC-2015, SAC-2016, SAC-2017); senior PC member of IJCAI/ECAI-2018, IJCAI-2015, IJCAI-2013, IJCAI-2011; Organizer of the Predictive Toxicology Challenge 2000-2001 Program (Co-)Chair of Events 15th International Conference on Inductive Logic Programming (ILP-2005); 5th International Workshop on Machine Learning in Systems Biology (MLSB-2011); OpenTox Euro 2013 Meeting; OpenTox Euro 2011; ECML/PKDD-2017 Workshop on Data Mining for Social Good (SoGood-2017); ECML/PKDD-2017 Workshop on Data Mining with Secure Computation; ICML-2007 Workshop on the Induction of Process Models (IPM-2007); ECML/PKDD-2008 Workshop on the Induction of Process Models (IPM-2008); ECML/PKDD-2001 Workshop on The Predictive Toxicology Challenge; ICML-2000 Workshop on Attribute-Value and Relational Learning: Crossing the Boundaries News News and events in Q1/2025 21. May 2025 News and events in Q4/2024 17. February 2025 News and events in Q3/2024 2. September 2024 KI-Lotse of the State of Rhineland-Palatinate 23. August 2024 News and events in Q2/2024 12. June 2024",
  "content_length": 5901,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:58"
}