{
  "name": "Stefan C. Kremer",
  "homepage": "https://www.uoguelph.ca/computing/people/stefan-kremer",
  "status": "success",
  "content": "Stefan Kremer | School of Computer Science Stefan Kremer ProfessorEmail: skremer@uoguelph.caPhone number: x58913Office: Reynolds 3309Website links: Google Scholar Research StatementResearch KeywordsSelected Publications My lab works on the problem of learning to recognize, categorize and generate structural patterns based on examples (this is called induction).  Structural patterns refers to patterns in data that are not easily represented by a fixed-length sequence of numbers (i.e. a vector). Examples:  English text, the shape of a molecule, a sequence of DNA, a radio signal, a system log, a video.  The lab is problem-driven (not solution driven), so we use a number of methods and tools like artificial neural networks, support vector machine, deep belief networks, hidden Markov models, evolutionary algorithms and deep learning.  Problems are drawn from a variety of domains, but problems related to biology are especially welcome. GRADUATE APPLICANTS:  Unfortunately, I receive far too many expressions of interest from potential graduate students to reply individually to each potential student.  If you wish to apply please make sure to include all relevant information including: a statement that you have read this research statement, your grades, your publications, your major software projects (GitHub links), programming languages that you have mastered, language abilities, writing sample, references, and a personalized statement about why you are applying to my lab.  Do not use form letters; if I see two applications that use the same sentences, I discard both.  Please send only one e-mail; multiple e-mails decrease your chance or receiving a reply.  Thank you for your interest. deep-learning deep belief networks recurrent networks spatio temporal pattern recognition pattern induction bioinformatics DOI: 10.1111/mec.13219 DOI: 10.1016/j.dsp.2015.08.007 DOI: 10.1162/089976601300014538 DOI: 10.1162/089976603321780281 ISBN: 978-0-7803-5369-5 Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 2057,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:45"
}