{
  "name": "Steffen Becker",
  "homepage": "http://www.iste.uni-stuttgart.de/rss.html",
  "status": "success",
  "content": "Software Quality and Architecture Group | Institute of Software Engineering | University of Stuttgart jump to content jump to footer back close navigation For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Teampicture of the SQA Group Research related picture Teaching related picture 1 2 3 4 TEAM RESEARCH TEACHING INDUSTRY Our methods help software architects, developers, and operators to design systems efficiently to meet their quality reqirements and to help them monitor and ensure them at runtime. SQA Group Software Quality and Architecture The Software Quality and Architecture Group deals with almost all aspects of engineering software quality. We develop methods, languages, and tools to model, analyse, or enforce quality requirements of software systems. Research Objectives The Software Quality and Architecture Group deals with methods, languages, and tools to engineer the quality of software systems. Software quality is the level to which a software system meets its requirements beyond the functional correctness, i.e., performance, reliability, safety, maintainability, scalability, elasticity, cost- and energy-efficiency, etc. Our methods help software architects, developers, and operators to design systems efficiently to meet their quality requirements and to help them monitor and ensure them at runtime. Find out more Teaching We are involved in teaching computer science, software engineering, and related study programmes, both on the bachelor and master level. Our main teaching subjects cover software engineering, software quality, software architecture, and requirements engineering. We teach in lectures, seminars, practial labs, and when supervising student theses. Find out more (Icon: twitter) News Follow us @sqaUStuttgart to keep up to date with the latest news and updates! Members of the Software Quality and … The group members are structured by area of responsibilities. Research Objectives Research at SQA deals with the development of methods, languages, and tools to engineering the … Teaching Activities Teaching at SQA covers topics related to general software engineering, software architecture, … Industry Services The Software Quality and Architecture group offers a broad range of industry collaborations, ranging … How to Reach Us Contact details and information on your arrival can be found on this page Steffen Becker Prof. Dr.-Ing. Head of the Software Quality and Architecture Group Profile page +49 711 685 88273 Write e-mail [Image: U. Regenscheit / University of Stuttgart] Elisabeth Ibach Secretary of the Software Quality and Architecture Group (Prof. Becker) Profile page +49 711 685 88471 Write e-mail Office hours: 9:00 a.m. - 11:00 a.m. To the top of the page",
  "content_length": 2822,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:32"
}