{
  "name": "Stefan Gumhold",
  "homepage": "https://tu-dresden.de/ing/informatik/smt/cgv",
  "status": "success",
  "content": "Startseite Professur für Computergraphik und Visualisierung — Professur für Computergraphik und Visualisierung — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Ludwig Schmutzler Professur für Computergra­phik und Visualisie­rung Weiterlesen Professur für Computergraphik und Visualisierung Wichtige Themen im Überblick © Ludwig Schmutzler Inhaber der Professur Prof. Dr. rer. nat. Stefan Gumhold leitet die Professur für Computergraphik und Visualisierung seit 2005... Weiterlesen Inhaber der Professur © Ludwig Schmutzler 26th Internatio­nal Symposium on Vision, Modeling, and Visualiza­tion We are pleased to be the host of this year's VMV. The symposium will take place as virtual-only event September 27-28, 2021 at the Faculty of Computer Science of the Technische Universität Dresden, Germany. Weiterlesen 26th International Symposium on Vision, Modeling, and Visualization © Ludwig Schmutzler Themen für Abschlussa­rbeiten Vorschläge für Bachelor-, Master-, Beleg- und Diplomthemen. Bei Interesse sollten Sie sich die angegebenen Links zu Veröffentlichungen ansehen und direkt den entsprechenden Mitarbeiter ansprechen. Weiterlesen Themen für Abschlussarbeiten © Ludwig Schmutzler Forschungs­schwerpunk­te Hier finden Sie alle wichtigen Informationen zu den aktuellen Forschungsinteressen der Professur Computergraphik und Visualisierung. Weiterlesen Forschungsschwerpunkte © Sebastian Grottel Herzlich willkommen auf der Webseite der Professur für Computergraphik und Visualisierung Die zentrale Aufgabe der Computergraphik ist die computerunterstützte Erstellung von Bildern. Es gibt eine vage Unterteilung in 2D- und 3D-Computergraphik. Der Fokus unserer Arbeit liegt auf der 3D-Computergraphik, bei der es sich um folgende Fragestellungen dreht: Welche diskrete Darstellung wählt man für eine dreidimensionale Szene, wie entwirft man eine visuell ansprechende Szene, wie nimmt man dreidimensionale Strukturen aus der realen Welt auf, wie simuliert man die Ausbreitung von Licht in einer Szene, wie können komplexe Szenen interaktiv dargestellt werden, wie baut man interaktive Systeme, wie simuliert man natürliche Phänomene, wie vereinfacht man die aufwendigen Berechnungen ohne Einbußen in der Bildqualität,...? In der Visualisierung nutzt man Techniken der Computergraphik zur Darstellung von meist numerischen Daten in Form von anschaulichen und leicht verständlichen Bildern. Dabei werden Untersuchungen der menschlichen Wahrnehmung ausgenutzt, um dem Betrachter der Visualisierung so viel Information wie möglich zu vermitteln. Das Interesse unserer Professur konzentriert sich auf die wissenschaftliche Visualisierung, bei der Techniken der Computergraphik und Visualisierung auf wissenschaftliche Datensätze angewendet werden. Name Sekretariat E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Webseite besuchen Adresse work Besuchsadresse: Andreas Pfitzmann Bau, Raum 2105 Nöthnitzer Str. 46 01187 Dresden Zeige Karte von diesem Ort. Adresse postal Postadresse: Technische Universität Dresden Professur für Computergraphik und Visualisierung 01062 Dresden work Tel. fax Fax +49 351 463-38396 Öffnungszeiten: Nach persönl. Vereinbarung. Briefkasten für Prüfungsanmeldungen oder SHK-Anträge finden Sie vor dem Büro! 26th International Symposium on Vision, Modeling, and Visualization We are pleased to be the host of this year's VMV. The symposium will take place as virtual-only event September 27-28, 2021 at the Faculty of Computer Science of the Technische Universität Dresden, Germany. The VMV is well-established as Germany’s premier scientific meeting that covers the full spectrum of visual computing. VMV offers researchers the opportunity to discuss a wide range of topics within an open, cross-cutting, international, and interdisciplinary environment. As in previous years, the proceedings will be published in cooperation with Eurographics and archived in the EG digital library. Selected papers will be invited to submit an extended version to Computer Graphics Forum. Authors are encouraged to submit their original research papers, empirical and comparative studies, as well as reports on practical and novel applications. Weitere Informationen Visit our website Call for Papers Projekte © CeTI Zur Webseite © 6G-life Zur Webseite © CPEC Zur Webseite © PoL Zur Webseite © ScaDS Zur Webseite CGV Youtube Channel © Ludwig Schmutzler Zur Webseite Datenschutzrichtlinie",
  "content_length": 4522,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:50"
}