{
  "name": "Stefan Böttcher",
  "homepage": "http://cs.uni-paderborn.de/ecdb",
  "status": "success",
  "content": "Datenbanken und Electronic Commerce - Datenbanken und Electronic Commerce | Universität Paderborn Prof. Dr. Stefan Böttcher Leiter - Büro: F2.217 Telefon: +49 5251 60-6662 E-Mail: stb@uni-paderborn.de Petra Schaefermeyer Sekretärin - Sekretariat Prof. Dr. Stefan Böttcher E-Mail: petra.schaefermeyer@uni-paderborn.de Enno Adler Büro: F2.413 Telefon: +49 5251 60-6323 E-Mail: eadler@mail.uni-paderborn.de Dr. Rita Hartel Büro: F2.124 Telefon: +49 5251 60-6612 E-Mail: rita.hartel@uni-paderborn.de Aktuelle Lehre (WS 2025/26) Vorlesung (Basisstudium Bachelor, Deutsch) Dozent: Prof. Dr. Stefan Böttcher Vorlesung (Basisstudium Bachelor, Deutsch) Dozentin: Dr. Rita Hartel Vorlesung (Vertiefungsstudium Bachelor, Englisch) Dozenten: Prof. Dr. Stefan Böttcher, Dr. Rita Hartel Geplante Lehre (SS 2026) Vorlesung (Basisstudium Bachelor, Deutsch) Dozentin: Dr. Rita Hartel Vorlesung (Master, Englisch) Dozent: Prof. Dr. Stefan Böttcher Sommersemester 2025 Vorlesung (Basisstudium Bachelor, Deutsch) Dozentin: Dr. Rita Hartel Vorlesung (Basisstudium Bachelor, Deutsch) Dozent: Prof. Dr. Stefan Böttcher Projektgruppe (Master, Deutsch) Dozent: Prof. Dr. Stefan Böttcher String Partition for Building Long BWTs E. Adler, S. Böttcher, R. Hartel, in: 2025 Data Compression Conference (DCC), IEEE, 2025. DOI IBB: Fast Burrows-Wheeler Transform Construction for Length-Diverse DNA Data E. Adler, S. Böttcher, R. Hartel, C.A. Steininger, in: 23rd International Symposium on Experimental Algorithms, Schloss Dagstuhl - Leibniz-Zentrum für Informatik, Venice, Italy, 2025, p. 2:1--2:18. ITR: Grammar-based graph compression supporting fast triple queries E. Adler, S. Böttcher, R. Hartel, in: 2024 Data Compression Conference (DCC), IEEE, 2024. DOI QSGG: query simulation in grammar-compressed graphs S. Böttcher, R. Hartel, S. Peeters, in: Proceedings of The International Workshop on Semantic Big Data, 2020. DOI Pattern Search in Grammar-Compressed Graphs S. Böttcher, R. Hartel, S. Peeters, in: 2020 Data Compression Conference (DCC) (Poster), 2020. DOI RECUT: RE-Compressing partially Unordered Trees S. Böttcher, R. Hartel, in: 2018 IEEE International Conference on Big Data (Big Data), 2018, pp. 3996–4005. DOI A column-oriented text database API implemented on top of wavelet tries S. Böttcher, R. Hartel, J. Manuel, in: DBKDA 2017, 2017. S2CX: From relational data via SQL/XML to (Un-)Compressed XML S. Böttcher, R. Hartel, D. Wolters, Information Systems 56 (2016) 198–213. DOI Incremental updates on compressed XML S. Böttcher, R. Hartel, T. Jacobs, S. Maneth, in: 2016 IEEE 32nd International Conference on Data Engineering (ICDE), IEEE, 2016, pp. 1026–1037. DOI OnlineRePair: A Recompressor for XML Structures S. Böttcher, R. Hartel, T. Jacobs, S. Maneth, in: 2015 Data Compression Conference, Springer, 2015, p. 439. DOI Alle Publikationen anzeigen Petra Schaefermeyer Datenbanken und Electronic Commerce Sekretariat Prof. Dr. Stefan Böttcher E-Mail schreiben Mehr zur Person",
  "content_length": 2973,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:46"
}