{
  "name": "Stefan Bruckner",
  "homepage": "https://vis.uib.no/team/bruckner",
  "status": "success",
  "content": "Stefan Bruckner – Visualization Research Group Stefan Bruckner HomeTeam Stefan Bruckner Professor Visualization stefan.bruckner@gmail.com +47 555 84 109 HiB, room 310M2 Stefan Bruckner is a full professor of visualization at the Department of Informatics of the University of Bergen, Norway. He received his master's degree (2004) and Ph.D. (2008), both in Computer Science, from the TU Wien, Austria, and was awarded the habilitation (venia docendi) in Practical Computer Science in 2012. Before his appointment in Bergen in 2013, he was an assistant professor at the Institute of Computer Graphics and Algorithms of the TU Wien. His research interests include all aspects of data visualization, with a particular focus on interactive techniques for the exploration and analysis of complex heterogeneous data spaces. He has made significant contributions to areas such as illustrative visualization, volume rendering, smart visual interfaces, biomedical data visualization, and visual parameter space exploration. In addition to his contributions in basic research, he has successfully led industry collaborations with major companies such as GE Healthcare and Agfa HealthCare, and has 7 granted patents. He is a recipient of the Eurographics Young Researcher Award, the Karl-Heinz-Höhne Award for Medical Visualization, and his research has received 11 best paper awards and honorable mentions at international events. He was program co-chair of EuroVis, PacificVis, the Eurographics Workshop on Visual Computing for Biology and Medicine, the Eurographics Medical Prize, and is a member of the editorial boards of IEEE Transactions on Visualization and Computer Graphics as well as Computers & Graphics. He currently serves on the Eurographics Executive Committee, and is a member of ACM SIGGRAPH, Eurographics, and the IEEE Computer Society. Starting February 2023, I’m heading the Chair of Visual Analytics at the University of Rostock in Germany. Please update your contact information. Publications 2024 H. Pokojná, T. Isenberg, S. Bruckner, B. Kozlíková, and L. Garrison, \"The Language of Infographics: Toward Understanding Conceptual Metaphor Use in Scientific Storytelling,\" IEEE Transactions on Visualization and Computer Graphics, 2024. [Bibtex] @article{pokojna2024language, title={The Language of Infographics: Toward Understanding Conceptual Metaphor Use in Scientific Storytelling}, author={Pokojn{\\'a}, Hana and Isenberg, Tobias and Bruckner, Stefan and Kozl{\\'i}kov{\\'a}, Barbora and Garrison, Laura}, journal={IEEE Transactions on Visualization and Computer Graphics}, year={2024}, month={Oct}, publisher={IEEE}, abstract={We apply an approach from cognitive linguistics by mapping Conceptual Metaphor Theory (CMT) to the visualization domain to address patterns of visual conceptual metaphors that are often used in science infographics. Metaphors play an essential part in visual communication and are frequently employed to explain complex concepts. However, their use is often based on intuition, rather than following a formal process. At present, we lack tools and language for understanding and describing metaphor use in visualization to the extent where taxonomy and grammar could guide the creation of visual components, e.g., infographics. Our classification of the visual conceptual mappings within scientific representations is based on the breakdown of visual components in existing scientific infographics. We demonstrate the development of this mapping through a detailed analysis of data collected from four domains (biomedicine, climate, space, and anthropology) that represent a diverse range of visual conceptual metaphors used in the visual communication of science. This work allows us to identify patterns of visual conceptual metaphor use within the domains, resolve ambiguities about why specific conceptual metaphors are used, and develop a better overall understanding of visual metaphor use in scientific infographics. Our analysis shows that ontological and orientational conceptual metaphors are the most widely applied to translate complex scientific concepts. To support our findings we developed a visual exploratory tool based on the collected database that places the individual infographics on a spatio-temporal scale and illustrates the breakdown of visual conceptual metaphors.}, pdf = {pdfs/garrisonVIS24.pdf}, images = {images/garrisonVIS24.png}, thumbnails = {images/garrisonVIS24thumb.png}, project = {VIDI}, git={https://osf.io/8xrjm/} } 2023 S. Mittenentzwei, V. Weiß, S. Schreiber, L. A. Garrison, S. Bruckner, M. Pfister, B. Preim, and M. Meuschke, \"Do Disease Stories need a Hero? Effects of Human Protagonists on a Narrative Visualization about Cerebral Small Vessel Disease,\" Computer Graphics Forum, 2023. [Bibtex] @article{mittenentzwei2023heros, journal = {Computer Graphics Forum}, title = {{Do Disease Stories need a Hero? Effects of Human Protagonists on a Narrative Visualization about Cerebral Small Vessel Disease}}, author = {Mittenentzwei, Sarah and Weiß, Veronika and Schreiber, Stefanie and Garrison, Laura A. and Bruckner, Stefan and Pfister, Malte and Preim, Bernhard and Meuschke, Monique}, year = {2023}, publisher = {The Eurographics Association and John Wiley & Sons Ltd.}, ISSN = {1467-8659}, DOI = {10.1111/cgf.14817}, abstract = {Authors use various media formats to convey disease information to a broad audience, from articles and videos to interviews or documentaries. These media often include human characters, such as patients or treating physicians, who are involved with the disease. While artistic media, such as hand-crafted illustrations and animations are used for health communication in many cases, our goal is to focus on data-driven visualizations. Over the last decade, narrative visualization has experienced increasing prominence, employing storytelling techniques to present data in an understandable way. Similar to classic storytelling formats, narrative medical visualizations may also take a human character-centered design approach. However, the impact of this form of data communication on the user is largely unexplored. This study investigates the protagonist's influence on user experience in terms of engagement, identification, self-referencing, emotional response, perceived credibility, and time spent in the story. Our experimental setup utilizes a character-driven story structure for disease stories derived from Joseph Campbell's Hero's Journey. Using this structure, we generated three conditions for a cerebral small vessel disease story that vary by their protagonist: (1) a patient, (2) a physician, and (3) a base condition with no human protagonist. These story variants formed the basis for our hypotheses on the effect of a human protagonist in disease stories, which we evaluated in an online study with 30 participants. Our findings indicate that a human protagonist exerts various influences on the story perception and that these also vary depending on the type of protagonist.}, pdf = {pdfs/garrison-diseasestories.pdf}, images = {images/garrison-diseasestories.png}, thumbnails = {images/garrison-diseasestories-thumb.png}, project = {VIDI} } L. A. Garrison, M. Meuschke, B. Preim, and S. Bruckner, \"Current Approaches in Narrative Medical Visualization,\" in Approaches for Science Illustration and Communication, M. Roughley, Ed., Gewerbestrasse 11, 6330 Cham, Switzerland: Springer, 2023. [Bibtex] @incollection{garrison2023narrativemedvisbook, title = {Current Approaches in Narrative Medical Visualization}, author = {Garrison, Laura Ann and Meuschke, Monique and Preim, Bernhard and Bruckner, Stefan}, year = 2023, booktitle = {Approaches for Science Illustration and Communication}, publisher = {Springer}, address = {Gewerbestrasse 11, 6330 Cham, Switzerland}, pages = {}, editor = {Mark Roughley}, chapter = 4, pdf = {pdfs/garrison2023narrativemedvisbook.pdf}, images = {images/garrison2023narrativemedvisbook.png}, thumbnails = {images/garrison2023narrativemedvisbook-thumb.png}, project = {VIDI} } S. Mittenentzwei, L. A. Garrison, E. Mörth, K. Lawonn, S. Bruckner, B. Preim, and M. Meuschke, \"Investigating user behavior in slideshows and scrollytelling as narrative genres in medical visualization,\" Computers & Graphics, 2023. [Bibtex] @article{mittenentzwei2023investigating, title={Investigating user behavior in slideshows and scrollytelling as narrative genres in medical visualization}, author={Mittenentzwei, Sarah and Garrison, Laura A and M{\\\"o}rth, Eric and Lawonn, Kai and Bruckner, Stefan and Preim, Bernhard and Meuschke, Monique}, journal={Computers \\& Graphics}, year={2023}, publisher={Elsevier}, abstract={In this study, we explore the impact of genre and navigation on user comprehension, preferences, and behaviors when experiencing data-driven disease stories. Our between-subject study (n=85) evaluated these aspects in-the-wild, with results pointing towards some general design considerations to keep in mind when authoring data-driven disease stories. Combining storytelling with interactive new media techniques, narrative medical visualization is a promising approach to communicating topics in medicine to a general audience in an accessible manner. For patients, visual storytelling may help them to better understand medical procedures and treatment options for more informed decision-making, boost their confidence and alleviate anxiety, and promote stronger personal health advocacy. Narrative medical visualization provides the building blocks for producing data-driven disease stories, which may be presented in several visual styles. These different styles correspond to different narrative genres, e.g., a Slideshow. Narrative genres can employ different navigational approaches. For instance, a Slideshow may rely on click interactions to advance through a story, while Scrollytelling typically uses vertical scrolling for navigation. While a common goal of a narrative medical visualization is to encourage a pa",
  "content_length": 257349,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:45"
}