{
  "name": "Stefan Woltran",
  "homepage": "https://www.dbai.tuwien.ac.at/staff/woltran",
  "status": "success",
  "content": "Homepage of Stefan Woltran Skip to Content Top-level Navigation: Staff Education research Contact Services Current-level Navigation: Path: DBAI > staff > Tools: Drucken Homepage of Stefan Woltran About me Research Teaching Other Activities Contact About me I studied Computer Science at TU Wien (Vienna University of Technology) and received my diploma in February 2001. In May 2003, I received my PhD in Computer Science. From July 2001 to May 2007 I was working as a project research assistant in the Knowledge-Based Systems Group. Since June 2007, I am an assistant professor at the Database and Artificial Intelligence Group. In November 2008, I received my Habilitation in the area of ``Information Systems'' at the Faculty of Computer Science of TU Wien. From August 2013 to January 2015, I have been associate professor at the Database and Artificial Intelligence Group. In Winter Term 2013, I held a deputy professorship at Leipzig University. Since February 2015, I am full professor for \"Formal Foundations of Artificial Intelligence\" at the Database and Artificial Intelligence Group. Since January 2020, I am head of the group and Vicedean of Academic Affairs of the Faculty of Computer Science. Since 2022, I act as co-director of the Center for Artificial Intelligence and Machine Learning (CAIML) of TU Wien. Current projects I am involved in: REVEAL-AI: Revealing and Utilizing the Hidden Structure for Solving Hard Problems in AI (WWTF ICT19-065) (Project leader together with S. Szeider) HYPAR - Hybrid Parameterized Problem Solving in Practice (FWF P32830)(Project leader) Decodyn: Treating Hard Problems with Decomposition and Dynamic Programming (FWF Y698) (Project leader) Previous projects (selection): EMBArg: Extending Methods in Belief Change to Advance Dynamics in Argumentation (FWF 30168) (Project partner) GRAPPA: A Semantical Framework for Graph-Based Argument Processing (DFG/FWF I2854) (Project leader together with G. Brewka (Univ. Leipzig)) Fragment-Driven Belief Change (FWF P25521) (Project leader) DFLAT: Extending the Answer-Set Programming Paradigm to Decomposed Problem Solving (FWF P25607) (Project leader) Abstract Dialectical Frameworks: Advanced Tools for Formal Argumentation (DFG/FWF I1102) (Project leader together with G. Brewka (Univ. Leipzig)) New Methods for Analyzing, Comparing, and Solving Argumentation Problems (WWTF ICT08-028)(Project leader) dynASP - Dynamic Programming and Answer Set Programming (TU Wien 9006.09/008) (Project leader) Bilateral Project \"Towards tractable belief merging\" (Amadee FR 12/2013) with O. Papini (Univ. Marseille) and R. Pichler (TU Wien) Bilateral Project \"New Directions in Abstract Argumentation\" (OEAD/SAIA 2012-03-15-0001) with J. Siska (Comenius Univ. Bratislava) CV (in German); and a shorter version (in English). Research My research concentrates on problems in the areas of Knowledge Representation and Reasoning; complexity analysis in AI, Logic Programming, and the Semantic Web; design and analysis of algorithms. Selected Publications (at the DB&LP Bibliography Server). Awards: In 2002, I received the OCG-Förderpreis, an award for oustanding master theses in the field of Computer Science (Photo). Best paper awards at RR'10, COMMA'10, KR'12 (distinguished student paper prize) (Photo), and ICLP'21. In 2013, I received the prestigous START Prize of the Austrian Science Fund (FWF) (Photo). In 2018, I became a fellow of the European Association for Artificial Intelligence (Photo). Steering Commitee member: KR Inc., COMMA (2013--2020), FoIKS, and NMR. Associate Editor: Artificial Intelligence Journal. Editorial Board member: JAIR, A&C. Area Editor of the ALP Newsletter (2012-2013). Editor of special issues on Argumentation in Argument and Computation, Multi-Agent Systems in JLC, and on Answer-Set Programming in AICOM and Künstliche Intelligenz, and selected papers of FoIKS 2018 and LPNMR 2019. Full member of the Wolfgang Pauli Institute (WPI) Vienna. Faculty member: Doctoral Program \"COFUND LogiCS\". Faculty member: Doctoral Program \"Logical Methods in Computer Science\". Faculty member: Doctoral Program \"Mathematical Logic in Computer Science\". Local Board member: Vienna Center for Logic and Algorithms (VCLA). Slides: Abstract Argumentation - All Problems Solved? (ECAI 2014 - Frontiers of Artificial Intelligence) Slides: Dynamic Programming on Tree Decompositions in Practice -- Some Lessons Learned (SYNASC 2015 - Invited Talk) Slides: Towards Advanced Systems for Abstract Argumentation (SAFA 2016 - Invited Talk) Slides: Dynamic Programming on Tree Decompositions in Practice (STAIRS 2016 - Invited Talk) Slides: Towards Preprocessing for Abstract Argumentation Frameworks (DARe 2017 - Invited Talk) Slides: Expressibility of Argumentation Frameworks and its Relation to the Dynamics of Argumentation (AMANDE 2018 - Invited Talk) Slides: Solving (Q)SAT Problems via Tree Decomposition and Dynamic Programming (JIAF/JFPC 2018 - Invited Talk) Slides: Computational Argumentation -- Formal Models and Complexity Results (CILC 2020 - Invited Talk) Slides: Abstract Argumentation with Focus on Argument Claims -- An Overview (LPNMR 2022 - Invited Talk) Survey: Methods for solving reasoning problems in abstract argumentation - A survey (AIJ 220:28-63, 2015) Survey: Abstract Dialectical Frameworks. An Overview (IfCoLog Journal of Logics and their Applications 4(8):2263-2318, 2017) Activities: Co-organizer of ASAI/CAIML Summerschool'23, DPSW'20, NTFA'19, TAASP'18, ÖGAI Prize 2013--2016, ICCMA'17 NTFA'17, NTBC'16, TAASP'16, KR'14, CLIMA XIV, GKR'13, COMMA'12, ICLP'12 DC. ICLP'11 DC, ASPOCP'11, ASPOCP'10, PCCR'10, CENT'07, WLP'06. Associate Program Chair for IJCAI 2024. Local (co-)Chair for IJCAI-ECAI 2022. (co-) PC-Chair for LPNMR'19, FoIKS'18, NMR'12. Area-Chair/Senior PC-member for IJCAI'20, AAAI'20, ECAI'20, KR'20, IJCAI'19, IJCAI-ECAI'18, KR'18, IJCAI'17, KR'16, IJCAI'15 (KR-track), ECAI'14. Workshop-Chair for ICLP'18 at FLoC'18. PC-member (recent) for COMMA'20, FoIKS'20, CLAR'20, STACS'19, AAAI'19, JELIA'19, ICLP'19, ADT'19, ECSQARU'19, KI'19, IEA/AIE'19, EPIA'19, RCRA'19, ASPOCP'19, EduAI'19, EELP'19, DKB/KIK'19, PADL'18, SAC'18 (KRR Track), NMR'18, SAFA'18, LaSh 2018, LPNMR'17, Commonsense'17, TAFA'17, ... Journals: Reviews for AIJ, ACM TOCL, AMAI, TPLP, FI, KER, Semantic Web Journal, JANCL, A&C, JAIR, IJAR, JETAI, AI Magazine,... Teaching See the teaching and courses sections for my current courses and seminars. Former PhD Students: Michael Abseher, Bernhard Bliem, Günther Charwat, Martin Diller, Wolfgang Dvořák, Sarah Alice Gaggl, Adrian Haret, Markus Hecher, Thomas Linsbichler, Jan Maly, Sylwia Polberg, Anna Rapberger, Johannes Wallner. Other Activities and Interests FAK, ostliga, FavAC, theater, sektion8, BSA,... [earlier life: SID Music (Games, Demos)] Contact Information Institute of Logic and Computation Database and Artificial Intelligence Group 192/2 Favoritenstraße 9-11 A-1040 Vienna Phone: (43) 1 58801 18429 Fax: (43) 1 58801 18493 Email: woltran@dbai.tuwien.ac.at Room: HD0309 Top Home / Kontakt / Webmaster / Offenlegung gemäß § 25 Mediengesetz: Inhaber der Website ist die Fakultät für Informatik an der Technischen Universität Wien, 1040 Wien. Die TU Wien distanziert sich von den Inhalten aller extern gelinkten Seiten und übernimmt diesbezüglich keine Haftung. Disclaimer / Datenschutzerklärung",
  "content_length": 7369,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:14"
}