{
  "name": "Stefan Nastic",
  "homepage": "https://dsg.tuwien.ac.at/team/snastic",
  "status": "success",
  "content": "Asst. Prof. Dr. Stefan Nastic Assistant Professor snastic @ dsg.tuwien.ac.at +43 1 58801 18417 LinkedIn Google Scholar Other links: ResearchGate ORCiD Web of Science DBLP Scopus *** Recent News: I am organizing this year’s Conference on the Internet of Things (IoT 2025). The conference will take place in Vienna, Austria, from November 19–21, 2025. The paper submission deadline is 18th July 2025. We warmly invite you to submit your work! Click here for more details! Our recent paper, “GoldFish: Serverless Actors with Short-Term Memory State for the Edge-Cloud Continuum” received the Best Paper Award at the IoT2024 conference!. I am excited to announce 2 open PhD student positions (fulltime) as part of my new Horizon Europe project. Start 1.1.2025. Duration 3 years. Please get in touch if interested! I have an open student staff position (paid part time position for Master Students). Drop me a line if you would like to work on Serverless computing and Graph Neural Networks together with me and Prof. Matthias Lanzinger. Click here for more details! A video recording of my keynote “Serverless Compute Fabric for Edge-Cloud Continuum: Opportunities and Challenges”, which I delivered at ICEIS 2023 is now available online. Short Curriculum Vitae Dipl.-Ing. Dr.techn. Stefan Nastic is an Assistant Professor on a tenure track at TU Wien, Institute of Information Systems Engineering, Distributed Systems Group (DSG). He joined DSG in August 2022 and started the tenure track in November 2022. Since 2021 Stefan is also a co-founding member and a Technical Steering Committee member in Linux Foundation’s Project Centaurus. He is also a founder and Managing Director of IntelliEdge GmbH. Stefan earned a Doctoral degree (PhD) summa cum laude (“mit Auszeichnung”) in 2016 from TU Wien, with a thesis: “Programming, Provisioning and Governing IoT Cloud Systems”. During the last decade, Stefan has been involved in a number of large research and commercial projects related to Edge Computing, Cloud Computing, Artificial Intelligence, and Internet of Things, such as a multi-million Pacific Controls Cloud Computing Lab (PC3L), H2020 U-Test, Urban Europe SMART-FI and Futurewei Polaris Cloud. The main results of his research have been published in 60+ scholarly publications and 1 book, leading to the h‑index of 27 as tracked by Google Scholar. Research Agenda in a Nutshell The next-generation Clouds are already expanding beyond traditional data centers into the far edges of the network. This is completely transforming how we perceive the notion of compute infrastructures and other digital resources such as storage or network. Additionally, novel types of Edge-based and IoT resources, such as sensors are becoming an integral part of this novel compute fabric. We are witnessing a shift, in which digital resources are becoming truly ubiquitous commodities and first-class citizens available across the entire Edge-Cloud-IoT continuum. This is quickly disrupting our understanding of many engineering techniques and system properties, some of which are traditionally known as cloud-native flagship properties. Examples include compute and execution models (e.g., serverless computing), Service Level Objectives (SLOs), reliability engineering, performance engineering, design architectures (e.g., microservice architectures), and elasticity. Furthermore, embedding intelligence in the Edge plays a decisive role in enabling efficient and cost-effective application development and operations in the novel Edge-Cloud-IoT continuum. A novel software-defined, intelligence-driven, and Internet-scale solution is required to address the challenges of the next-generation Edge-Cloud-IoT systems and enable the raise of the next-generation systems and service offerings. I refer to such a solution as Intelligent Compute and Data Fabric for Edge-Cloud-IoT. Such an Intelligent Fabric represents a paradigm shift from traditional services and platforms computing to fabric-centric computing where digital resources, infrastructures, and systems become commodities, which permeate the entire compute and data continuum. At the same time Intelligent Fabric represents a natural evolution of my past research, but also requires addressing several key research challenges in distributed systems. My main research topics at a glance Serverless Computing Compound AI & Edge AI 3D & Edge-Cloud Continuum Reliability Engineering Software Defined Internet of Things Academic Teaching Lectures and Courses No. Title Type 194.151 Serverless Computing VU, 3.0 ECTS 194.024 Distributed Systems VU, 6.0 ECTS 184.194 Seminar in Distributed Systems SE, 3.0 ECTS 180.777 Seminar for Master Students in Software Engineering & Internet Computing SE, 1.5 ECTS 193.052 Scientific Research and Writing SE, 3.0 ECTS 194.058 Project in Computer Science 1 PR, 6.0 ECTS 194.059 Project in Computer Science 2 PR, 6.0 ECTS 184.714 Bachelor Thesis for Informatics and Business Informatics PR, 10.0 ECTS The most recent list of my courses in the current and the past semesters can be found here. Students and Thesis Supervision I am regularly supervising PhD, Master’s and Bachelor’s Theses with topics related to my research areas. If you are interested in doing your thesis with me, please drop me a line. Current PhD Students Milos Gravara (supervisor) Andrija Stanisic (supervisor) Cynthia Marcelino (supervisor) Finished PhD Students Amirali Amiri (examiner) Thomas Pusztai (co-supervisor) Philipp Raith (co-supervisor) Current Master Students Jack Shahhoud (supervisor, MSc) Meiko Prilop (supervisor, MSc) Valentin Goronjic (supervisor, MSc) Raphael Fleischmann (supervisor, MSc) Rastko Gajanin (supervisor, MSc) Leonard Guelmino (supervisor, MSc) The link to all supervised Master’s Thesis can be found at the TU Wien Library Online Catalogue. Academic Community Editorial Boards and Steering Committees International Journal of Networked and Distributed Computing (Springer) [Editorial Board mem. ] Frontiers in the Internet of Things – IoT Computing Paradigms [Associate Editor] Journal of Edge Computing [Associate Editor] International Journal of Ad Hoc and Ubiquitous Computing [Editorial Board mem. ] Journal of Cloud Computing and Data Science [Associate Editor] Linux Foundation Centaurus Cloud [Technical Steering Committee mem.] MDPI Sensors. Special Issue “Serverless Continuum: Serverless Computing for the Edge-Cloud-IoT Continuum” [Guest Editor] MDPI Sensors. Special Issue “Edge AI for Next Generation Cloud-Edge-IoT Systems” [Guest Editor] Conference Chair Appointments The 26th IEEE international Symposium on Cluster, Cloud and Internet Computing (CCGrid 2026) [Poster session Chair] The 15th International Conference on the Internet of Things (IoT 2025) [General Chair] The 33rd International Symposium on High-Performance Parallel and Distributed Computing (HPDC 2024) [Publicity Chair] The 18th Intelligent Environment Conference (IE 2022) [Industrial Forum Chair] Keynotes and Invited Talks “At the Intersection of Next-Generation Computing Paradigms and Novel Computing Landscapes.” Joint keynote at the 30th EMMSAD Conference and the 26th BPMDS Conference. [Keynote] “Computing Paradigms for the Next-Generation Computing Landscapes”. The 2nd AIoTwin Summer School. [Keynote] “Developing Compound AI Systems: Challenges, Opportunities, and Best Practices”. The 7th International Conference on Information Science and Systems (ICISS 2024). [Invited Talk] “Serverless Compute Fabric for Edge-Cloud Continuum”. Invited talk at Software Architecture Group at University of Vienna [Invited Talk] “Serverless Compute Fabric for Edge-Cloud Continuum: Opportunities and Challenges”. The 25th International Conference on Enterprise Information Systems (ICEIS 2023) [Keynote] [Video recording] “Serverless Compute Fabric for the Next-generation Edge-Cloud-IoT Systems”. The 6th International Conference on Information Science and Systems (ICISS 2023) [Invited Talk] Technical Program Committees The 34rd International Symposium on High-Performance Parallel and Distributed Computing (HPDC 2025) [TPC mem.] The 25h IEEE International Conference on Data Mining (ICDM 2025). [TPC mem.] The 3rd International Workshop on Scalable Compute Continuum (WSCC 2025). Workshops and Minisymposia of Euro-Par 2025 [TPC mem.] The 23rd Mediterranean Communication and Computer Networking Conference (MedComNet 2025). [TPC mem.] The Workshop on Adaptable Cloud Architectures (WACA 2025). [TPC mem.] The 19th ACM International Conference on Distributed and Event‐Based Systems (DEBS 2025). [TPC mem.] The 2nd International Workshop on the Orchestration of the Serverless Edge-Cloud Continuum (COHERENT 2025). [TPC mem.] The 44th IEEE International Conference on Distributed Computing Systems (ICDCS 2025). [TPC mem.] The 14th International Conference on the Internet of Things (IoT 2024). [TPC mem.] The 7th International Conference on Information Science and Systems (ICISS 2024). [TPC mem.] The 2st International Workshop on Scalable Compute Continuum (WSCC 2024). Workshops and Minisymposia of Euro-Par 2024 [TPC mem.] The 2024 IEEE Intenational Conference on Big Data (IEEE BigData 2024). [TPC mem.] The 22st Mediterranean Communication and Computer Networking Conference (MedComNet 2024). [TPC mem.] The 44th IEEE International Conference on Distributed Computing Systems (ICDCS 2024). [TPC mem.] The 1st International Workshop on the Orchestration of the Serverless Edge-Cloud Continuum (COHERENT 2024). [TPC mem.] The 8th IEEE International Conference on Fog and Edge Computing (ICFEC2024 ). [TPC mem.] International Workshop on Quality of Service-Aware Serverless Computing (QServ ‘23). Co-located with IEEE/ACM UCC 2023. [TPC mem.] The 13th International Conference on the Internet of Things (IoT 2023). [TPC mem.] The 1st International Workshop on Scalable Compute Continuum (WSCC 2023). Workshops and Minisymposia of Euro-Par 2023 [",
  "content_length": 31042,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:00"
}