{
  "name": "Stefan Dietze",
  "homepage": "http://stefandietze.net",
  "status": "success",
  "content": "/ stefandietze.net / stefandietze.net About Research Committees Publications Teaching & Talks About Stefan Dietze is Professor for Data & Knowledge Engineering at Heinrich-Heine-University Düsseldorf (HHU), and scientific director of the department Knowledge Technologies for the Social Science (KTS) at GESIS – Leibniz Institute for the Social Sciences. He also is deputy director at the Heine Center for Artificial Intelligence & Data Science (HeiCAD), and affiliated member at the Düsseldorf Institute for Internet & Democracy (DIID) and the L3S Research Center of the Leibniz University Hanover, Germany. Previous positions include the Knowledge Media Institute (KMI) of The Open University (UK) and the Fraunhofer Institute for Software and Systems Engineering (ISST, now part of Fraunhofer FOKUS). His research interests are at the intersection of information retrieval, knowledge graphs, NLP and machine learning, and his work is concerned with the extraction, fusion and search of knowledge and data, in particular, on the Web. His work has been published in top tier conferences such as CIKM, EMNLP, ISWC, SIGIR, NAACL or WebConf, where he also frequently serves as PC and/or organisation committee member. For further details please have a look at previous and current projects & grants (not well-maintained), research labs pages of KTS, a list of selected publications, or committee memberships. Beyond being a data scientist, he is a freelance writer for magazines & blogs. To get in touch, please see the contact details below. E-mail (HHU): stefan.dietze@hhu.de Google Scholar: Stefan Dietze LinkedIn: Stefan Dietze X/Twitter: @stefandietze Contact X/Twitter: @stefandietze LinkedIn: StefanDietze Email: stefan.dietze@hhu.de Blog at WordPress.com. Subscribe Subscribed / stefandietze.net Sign me up Already have a WordPress.com account? Log in now. / stefandietze.net Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 2091,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:47"
}