{
  "name": "Stefan Bauer",
  "homepage": "https://www.professoren.tum.de/bauer-stefan",
  "status": "success",
  "content": "Bauer_Stefan Prof. Dr. Stefan Bauer Professur Algorithmisches Maschinelles Lernen & Erklärbare KI School TUM School of Computation, Information and Technology Kontakt Visitenkarte in TUMonline Wissenschaftliche Laufbahn und Forschungsgebiete Wir arbeiten an der Entwicklung von Algorithmen, die kausale Zusammenhänge aus hochdimensionalen Eingaben lernen, ihre Entscheidungen erklären und sich schnell an neue Probleme anpassen können: All diese Anforderungen sind Schlüsselvoraussetzungen für robuste und transformative KI-basierte Technologien in vielen Anwendungsdomänen.Stefan Bauer ist Associate Professor an der TU München und senior PI bei Helmholtz AI. Er ist ein CIFAR Azrieli Global Scholar und vor seiner Berufung nach München war er Assistenzprofessor an der KTH Stockholm sowie Gruppenleiter am Max-Planck-Institut für Intelligente Systeme in Tübingen. Stefan Bauer erhielt seine Doktorwürde in Computer Science 2018 von der ETH Zürich. Zuvor studierte er Mathematik an der ETH Zürich und Economics and Finance an der University of London. Wichtigste Auszeichnungen CIFAR Azrieli Fellowship Learning in Machines and Brains Program (2020)Best paper International Conference for Machine Learning (ICML) (2019)ETH medal for outstanding doctoral thesis (2018) Schlüsselpublikationen (alle Publikationen)N. Pfister, S. Bauer and J. Peters. \"Identifying Causal Structure in Large-Scale Kinetic Systems“. Proceedings of the National Academy of Sciences (PNAS) (2019).AbstractB. Schölkopf, F. Locatello, S. Bauer, R. Nan Ke, N. Kalchbrenner, A. Goyal and Y. Bengio. \"Towards Causal Representation Learning“.  Proceedings of the IEEE - Advances in Machine Learning and Deep Neural Networks (2020).AbstractS. Bauer*, M. Wüthrich*, F. Widmaier*, N. Funk, J. De Jesus, J. Peters, J. Watson, C. Chen, K. Srinivasan, J. Zhang, J. Zhang, M. Walter, R. Madan, C. Schaff, T. Maeda, T. Yoneda, D. Yarats, A. Allshire, E. Gordon, T. Bhattacharjee, S. Srinivasa, A. Garg, A. Buchholz, S. Stark, T. Steinbrenner, J. Akpo, S. Joshi, V. Agrawal and B. Schölkopf. \"A Robot Cluster in the Cloud for Reproducible Research in Dexterous Manipulation“. NeurIPS Competition Track (2021).AbstractP. Tigas, Y. Annadani, A. Jesson, B. Schölkopf, Y. Gal and S. Bauer. \"Interventions, Where and How? Experimental Design for Causal Models at Scale“. Neural Information Processing Systems (NeurIPS) (2022).AbstractZ. Rao, P-Y. Tung, R. Xie, Y. Wei, H. Zhang, A. Ferrari, T. Klaver, F. Körmann, P. Sukumar, A. Kwiatkowski da Silva, Y. Chen, Z. Li, D. Ponge, J. Neugebauer, O. Gutfleisch, S. Bauer and D. Raabe. \"Machine learning enabled fast high-entropy alloy discovery - a case study on novel INVAR alloys“. Science (2022).Abstract Bei Änderungs- oder Aktualisierungswünschen wenden Sie sich bitte an Franz Langer. Achtung: JavaScript im Browser deaktiviert Bitte aktivieren Sie JavaScript um alle Funktionen der Website (u.a. Suche) im vollen Umfang nutzen zu können!",
  "content_length": 2945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:41"
}