{
  "name": "Stefan Klein 0002",
  "homepage": "https://www.wi.uni-muenster.de/de/institut/wi",
  "status": "success",
  "content": "Lehrstuhl für Wirtschaftsinformatik und Interorganisationssysteme (Prof. Klein) | Institut für Wirtschaftsinformatik Lehrstuhl für Wirtschaftsinformatik und Interorganisationssysteme (Prof. Klein) Our research studies the impact of information and communication technology in an organizational context. We are interested in the development of the digital organization and the social organization: how do organizations and leaders respond to the challenges and opportunities of an informated society and economy. In particular we look at new modes of organizing, coordination and collaboration from the micro level of work practices, group and community practices to the macro level of infrastructure development. We pursue this agenda in three, interrelated fields of research: communication and collaboration management, information management and leadership, interorganizational systems and infrastructures. We aim to understand the dynamics of transformation in a historical, societal, regulatory, and economic context. Our work is theoretically and empirically grounded, we employ multiple methods and research approaches with an emphasis on qualitative, interpretative approaches. It is our research philosophy that the implications of integratinginnovative ICT into existing practices and communities need to be studied in situ. We therefore advocate a Living Laboratory approach emphasizes research and experimentation in complex real world settings addressing business or societal innovation. Typically multi stakeholders and researchers from different disciplinary backgrounds are involved. Research Profile Interorganisational Systems The research group studies ICT enabled networked modes of organizations and organizing. Empirically this covers a diverse range of meso level phenomena such as EDI networks, virtual organizations, electronic markets or Living Labs. We have studied pharmaceutical distribution and the tourism industry extensively. We take a particular interest in the development and transformation of interorganizational infrastructures. Specifically we study how to facilitate collective action in heterogeneous actor constellations, how standards are developed, how the proliferation of ICT transforms industry structures and markets. We take an interdisciplinary approach, with a strong social sciences perspective and use mainly qualitative methods of data collection. Communication and Collaboration We have a long tradition in researching and investigate communication and collaboration phenomena in the Information Systems and Management domains. Specifically we look into research questions on different levels of analysis: On the inter-organisational or network level we are dealing with the impact of (new) ICTs on organisational forms (e.g. the proliferation of virtual organisations) and the practices of network and cooperation management. On the business process level we are investigating the potentials and application of novel systems such as real-time collaboration (RTC) systems or Social Software. On the team or group level we are looking into the adoption and appropriation of communication and collaboration infrastructure. On the individual level we are interested in questions of systems acceptance and perception. We apply a broad spectrum of research methods: We have a certain preference for qualitative methods, due to the complexity of the research questions and the nature of constructs we investigate. We often use a practice theoretical lens on information systems and apply methods such as rich semi-structured interviews or user observations. In addition, we have also worked with traditional experimental designs or questionnaire-based surveys. These quantitative methods are applied in areas that are already well understood and are mainly used to collect additional evidence. A major part of our research on communication and collaboration phenomena takes place under the auspices of the Competence Center Smarter Work. For more information, click here: Competence Center Smarter Work",
  "content_length": 4051,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:54"
}