{
  "name": "Stefan Goetze",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/stefan-goetze",
  "status": "success",
  "content": "Dr Stefan Goetze | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Stefan Goetze School of Computer Science Visiting Professor Member of the Speech and Hearing (SpandH) research group Open staff member portrait in a modal window s.goetze@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Stefan Goetze School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-1044-7343 Google Scholar Personal webpage Profile Stefan Goetze was a Senior Lecturer in the School of Computer Science at Sheffield from 2020 - 2025. He obtained the degree 'Dipl.-Ing' in 2004 and 'Dr.-Ing.' in 2013 in Electrical/Communication Engineering from the University of Bremen, Germany. From 2008 to 2020 he was with the Fraunhofer-Institute for Digital Media Technology IDMT in Oldenburg, Germany where he was first Head of \"Audio System Technology for Audiology and Assistive Systems\" (2010-2017) and later Head of \"Automatic Speech Recognition\" as well as Dept. Head of the Department \"Hearing, Speech and Audio Technology\" (2017-2020). Research interests His research interests include machine learning, signal analysis, enhancement and classification as well for large scale applications as for resource-limited IoT (Internet of Things) and assistive devices. Publications Journal articles Hao L, Goetze S, Alessa T & Hawley MS (2023) Effectiveness of computer-tailored health communication in increasing physical activity in people with or at risk of long-term conditions: systematic review and meta-analysis. Journal of Medical Internet Research, 25(1). View this article in WRRO Ravenscroft W, Goetze S & Hain T (2022) Att-TasNet: attending to encodings in time-domain audio speech separation of noisy, reverberant speech mixtures. Frontiers in Signal Processing, 2. View this article in WRRO Cauchi B, Siedenburg K, Santos JF, Falk TH, Doclo S & Goetze S (2019) Non-intrusive speech quality prediction using modulation energies and LSTM-network. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 27(7), 1151-1163. View this article in WRRO Cauchi B, Siedenburg K, Santos JF, Falk TH, Doclo S & Goetze S (2019) Non-Intrusive Speech Quality Prediction Using Modulation Energies and LSTM-Network. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 27, 1151-1163. Xiong F, Goetze S, Kollmeier B & Meyer BT (2019) Joint estimation of reverberation time and early-to-late reverberation ratio from single-channel speech signals. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 27(2), 255-267. View this article in WRRO Goetze S (2019) Intelligente Erkennersysteme für die Pflege. Pflegezeitschrift, 72(1-2), 17-19. View this article in WRRO Xiong F, Goetze S, Kollmeier B & Meyer BT (2018) Exploring auditory-inspired acoustic features for room acoustic parameter estimation from monaural speech. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 26(10), 1809-1820. View this article in WRRO Moritz N, Adiloğlu K, Anemüller J, Goetze S & Kollmeier B (2017) Multi-Channel Speech Enhancement and Amplitude Modulation Analysis for Noise Robust Automatic Speech Recognition. Computer Speech & Language, 46, 558-573. Schröder J, Moritz N, Anemüller J, Goetze S & Kollmeier B (2017) Classifier architectures for acoustic scenes and events : implications for DNNs, TDNNs, and perceptual features from DCASE 2016. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 25(6), 1304-1314. View this article in WRRO Kodrasi I, Cauchi B, Goetze S & Doclo S (2017) Instrumental and perceptual evaluation of dereverberation techniques based on robust acoustic multichannel equalization. Journal of the Audio Engineering Society, 65(1/2), 117-129. View this article in WRRO Spriet A, Goetze S & van Waterschoot T (2017) Special Issue on Dereverberation and Reverberation of Audio, Music, and Speech. JOURNAL OF THE AUDIO ENGINEERING SOCIETY, 65(1-2), 6-7. Asmare FM, Xiong F, Bode M, Mayer B & Goetze S (2016) Joint beamforming and spectral enhancement for robust automatic speech recognition in reverberant environments. Journal of the Acoustical Society of America, 139(4_Supplement), 2224-2225. Schroder J, Goetze S & Anemuller J (2015) Spectro-Temporal Gabor Filterbank Features for Acoustic Event Detection. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 23(12), 2198-2208. Xiong F, Meyer BT, Moritz N, Rehr R, Anemüller J, Gerkmann T, Doclo S & Goetze S (2015) Front-end technologies for robust ASR in reverberant environments—spectral enhancement-based dereverberation and auditory modulation filterbank features. EURASIP Journal on Advances in Signal Processing, 2015(1). Cauchi B, Kodrasi I, Rehr R, Gerlach S, Jukić A, Gerkmann T, Doclo S & Goetze S (2015) Combination of MVDR beamforming and single-channel spectral processing for enhancing noisy and reverberant speech. EURASIP Journal on Advances in Signal Processing, 2015(1). Ruhland M, Bitzer J, Brandt M & Goetze S (2015) Reduction of Gaussian, Supergaussian, and Impulsive Noise by Interpolation of the Binary Mask Residual. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 23(10), 1680-1691. Haux R, Hein A, Kolb G, Künemund H, Eichelberg M, Appell J-E, Appelrath H-J, Bartsch C, Bauer JM, Becker M , Bente P et al (2014) Information and communication technologies for promoting and sustaining quality of life, health and self-sufficiency in ageing societies – outcomes of the Lower Saxony Research NetworkDesign of Environments for Ageing(GAL). Informatics for Health and Social Care, 39(3-4), 166-187. Gerlach S, Bitzer J, Goetze S & Doclo S (2014) Joint estimation of pitch and direction of arrival: improving robustness and accuracy for multi-speaker scenarios. EURASIP Journal on Audio, Speech, and Music Processing, 2014(1). Kodrasi I, Goetze S & Doclo S (2013) Regularization for Partial Multichannel Equalization for Speech Dereverberation. IEEE Transactions on Audio, Speech, and Language Processing, 21(9), 1879-1890. Schröder J, Hollosi D, Goetze S & Bitzer J (2013) Notrufsysteme mit automatischer akustischer Gefahrendetektion. Science^2 - Safety and Security, 1, 12-18. Goetze S, Schroder J, Gerlach S, Hollosi D, Appell J-E & Wallhoff F (2012) Acoustic Monitoring and Localization for Social Care. Journal of Computing Science and Engineering, 6(1), 40-50. Goetze S, Moritz N, Appell J-E, Meis M, Bartsch C & Bitzer J (2010) Acoustic user interfaces for ambient-assisted living technologies. Informatics for Health and Social Care, 35(3-4), 125-143. Haux R, Hein A, Eichelberg M, Appell J-E, Appelrath H-J, Bartsch C, Bisitz T, Bitzer J, Blau M, Boll S , Buschermöhle M et al (2010) The Lower Saxony research networkdesign of environments for ageing: towards interdisciplinary research on information and communication technologies in ageing societies. Informatics for Health and Social Care, 35(3-4), 92-103. Goetze S, Moritz N, Appell J-E, Meis M, Bartsch C & Bitzer J (2010) Acoustic User Interfaces for Ambient Assisted Living Technologies. Informatics for Health and Social Care, SI Ageing & Technology, 35, 161-179. Haux R, Hein A, Eichelberg M, Appell J-E, Appelrath H-J, Bartsch C, Bisitz T, Bitzer J, Blau M, Boll S , Buschermöhle M et al (2010) The Lower Saxony Research Network Design of Environments for Ageing (GAL) - Towards Interdisciplinary Research on ICT in Ageing Societies. Informatics for Health and Social Care, SI Ageing & Technology, 35, 92-103. Goetze S, Kammeyer K-D, Kallinger M & Mertins A (2006) A study on combining acoustic echo cancelers with impulse response shortening. The Journal of the Acoustical Society of America, 120(5_Supplement), 3258-3258. Goetze S & et al () Speech Quality Assessment for Listening-Room Compensation. Journal of the Audio Engineering Society, 62(6), 386-399. Book chapters Wolf KI, Goetze S & Wallhoff F (2017) Computer-Based Adaption of Cooking Recipes Integrated in a Speech Dialogue Assistance System, Advanced Technologies and Societal Change (pp. 163-172). Springer International Publishing Rennies J, Goetze T & Appell J-E (2012) Innovative Hörunterstützung in Kommunikationssystemen In Schick A, Meis M & Nocke C (Ed.), Beiträge zur psychologischen Akustik, Akustik in Büro und Objekt (pp. in press-in press). Oldenburg: Isensee Verlag. Hollosi D, Goetze S, Appell JE & Wallhoff F (2011) Acoustic Applications and Technologies for Ambient Assisted Living Scenarios, Ambient Assisted Living (AAL) Forum (pp. 337-342). Lecce, Italy. Moritz N, Goetze S & Appell J-E (2011) Ambient Voice Control for a Personal Activity and Household Assistant, Ambient Assisted Living (pp. 63-74). Springer Berlin Heidelberg Rennies J, Goetze S & Appell J-E (2011) Considering Hearing Deficiencies in Human-Computer Interaction In Ziefle M & Röcker C (Ed.), Human-Centered Design of E-Health Technologies: Concepts, Methods and Applications (pp. 180-207). IGI Global Schröder J, Wabnik S, Hengel PWJV & Goetze S (2011) Detection and Classification of Acoustic Events for In-Home Care (Best-Paper Award) In Wichert R & Eberhardt B (Ed.), Ambient Assisted Living - Advanced Technologies and Societal Change, Springer Lecture Notes in Computer Science (LNCS) (pp. 181-196). Springer Science Schroeder J, Wabnik S, van Hengel PWJ & Goetze S (2011) Detection and Classification of Acoustic Events for In-Home Care, Ambient Assisted Living (pp. 181-195). Springer Berlin Heidelberg Rennies J, Goetze S & Appell J-E (2011) Personalized Acoustic Interfaces for Human-Computer Interaction, Advances in Healthcare Information Systems and Administration (pp. 180-207). IGI Global Rennies J, Albertin E, Goetze S & Appell J-E (2010) Automatic Live Monitoring of Communication Quality for Normal-Hearing and Hearing-Impaired Listeners, Lecture Notes in Computer Science (pp. 568-575). Springer Berlin Heidelberg Goetze S, Rennies J & Appell J-E (2010) ",
  "content_length": 48141,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:54"
}