{
  "name": "Stefanie Gerke",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/stefanie-gerke",
  "status": "success",
  "content": "Stefanie Gerke - Royal Holloway Research Portal Stefanie Gerke Professor Centre for Algorithms and ApplicationsDiscrete Mathematics and its ApplicationsProfessor, Department of Mathematics Phone+44 1784 276225EmailStefanie.Gerkerhul.acuk TW20 0EX Personal profile Research interestsMy main interests are in the area of graph theory in general, and in random graph theory and algorithms in particular. I started my research career at the University of Oxford after obtaining a Diplom in Mathematics at the FU Berlin. After my PhD in Mathematics at Oxford, I spent some enjoyable and productive years in Angelika Steger's group, first at the TU Munich (as a winner of the Bavarian Habilitationsfoerderpreis) and then at the ETH Zurich.  I joined Royal Holloway in 2007. Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 37 Article 1 Chapter 1 Conference contribution Research output per year Research output per year On k-anti-tracebility of oriented graphsChen, B., Gerke, S., Gutin, G., Lei, H., Parker-Cox, H. & Zhou, Y., Mar 2025, In: Discrete Mathematics. 348, 3, 9 p., 114331.Research output: Contribution to journal › Article › peer-review Open Access Bounds on Maximum Weight Directed CutAi, J., Gerke, S., Gutin, G., Yeo, A. & Zhou, Y., 2024, In: SIAM Journal on Discrete Mathematics. 38, 3, p. 2370-2391 22 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 38 Downloads (Pure) Public goods in networks with constraints on sharingGerke, S., Gutin, G., Hwang, S.-H. & Neary, P., Jul 2024, In: Journal of Economic Theory. 219, 22 p., 105844.Research output: Contribution to journal › Article › peer-review Open Access On Seymour’s and Sullivan’s Second Neighbourhood ConjecturesAi, J., Gerke, S., Gutin, G., Wang, S., Yeo, A. & Zhou, Y., 20 Oct 2023, (E-pub ahead of print) In: Journal of Graph Theory.Research output: Contribution to journal › Article › peer-review Open Access Results on the Small Quasi-Kernel ConjectureAi, J., Gerke, S., Gutin, G., Yeo, A. & Zhou, Y., Jul 2023, In: Discrete Mathematics. 346, 7, 113435.Research output: Contribution to journal › Article › peer-review Open Access View all 39 research outputs Projects 3 Finished Projects per year Successive Shortest Structures in Random GraphsGerke, S. (PI)Eng & Phys Sci Res Council EPSRC1/04/22 → 31/03/23Project: Research Probabilistic Combinatorics: Marking Colin McDiarmid's RetirementGerke, S. (PI)London Mathematical Society9/04/16 → 10/04/16Project: Research Collaboration CMU and RHULGerke, S. (PI)London Mathematical Society1/04/12 → 30/06/12Project: Research",
  "content_length": 2909,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:16"
}