{
  "name": "Stefan Stieglitz",
  "homepage": "https://www.uni-due.de/proco/stieglitz.php",
  "status": "success",
  "content": "Prof. Dr. Stefan Stieglitz | Digital Communication and Transformation Prof. Dr. Stefan Stieglitz | Digital Communication and Transformation Prof. Dr. Stefan Stieglitz Anschrift: Forsthausweg 2, 47057 Duisburg Raum: LE 310 Telefon: +49 203 379 1341 Mail: stefan.stieglitz@uni-due.de Werdegang seit 02/2015 Universitätsprofessor für Digital Communication and Transformation, Universität Duisburg-Essen 04/2010-01/2015 Juniorprofessor für Wirtschaftsinformatik, insbesondere Kommunikations- und Kollaborationsmanagement, Westfälische Wilhelms-Universität Münster 10/2009 - 08/2011 Dozent am Hasso-Plattner-Institut, School of Design Thinking, Universität Potsdam 04/2008 - 03/2010 Akademischer Assistent, Corporate Governance und E-Commerce, Universität Potsdam 08/2006 - 07/2007 Stipendiat im Graduiertenkolleg Modern Governance, Universität Potsdam 11/2003 - 02/2008 Akademischer Mitarbeiter, Corporate Governance und E-Commerce, Universität Potsdam 10/1998 - 09/2003 Studium der Betriebswirtschaftslehre, Universitäten Köln, Paderborn, Potsdam Funktionen & Mitgliedschaften seit 2018 Honorary Professor The University of Sydney Business School, Discipline of Business Information Systems seit 2017 Mitglied der Leitung Fachgruppe \"CSCW & Social Computing\" der Gesellschaft für Informatik seit 2017 Mitglied der Ethikkommission der Abteilung für Informatik und Angewandte Kognitionswissenschaft seit 2017 Mitglied der Projektgruppe Forschungsdatenmanagement an der Universität Duisburg-Essen seit 2016 Mitglied der Leitung Akademische Gesellschaft für Unternehmensführung & Kommunikation seit 2015 Principal Investigator DFG-Graduiertenkolleg \"User-centred Social Media\" seit 2015 Sprecher des wissenschaftlichen Beirats NRW-Projekts SCIEBO seit 2013 Direktor Competence Center Connected Organization 2015, 2016 Visiting Professor The University of Sydney Business School, Discipline of Business Information Systems 2012, 2014 Visiting Scholar The University of Sydney Business School, Discipline of Business Information Systems 2010-2015 Mitglied des Vorstands Deutsche Gesellschaft Juniorprofessur e.V. 2009-2010 Associate Stiftung Neue Verantwortung e.V. Herausgeberschaften seit 2019 Department Editor \"Human Computer Interaction and Social Computing\", Business and Information Systems Engineering (BISE) seit 2019 Editorial Board Member, Media and Communication 2018-2019 Special Issue on \"Social Media in Conflicts and Crises\", Behaviour & Information Technology 2017 Book \"Gamification - Using game elements in serious contexts\", Berlin, Springer, Stieglitz S., Lattemann, C., Robra-Bissantz, S., Zarnekow, R., Brockmann T. Preise & Auszeichnungen 2020 Stafford Beer Medal 2020 2018 Best Paper 51st Hawaii International Conference on System Sciences (HICSS), Track \"E-Government\" 2016 AIS Senior Scholars Best IS Publications Award 2015 Elite Award for Excellence, European University Information Systems, Project „sciebo – the Campuscloud for NRW” 2014 Best-Of-Mobile-Award (BOM) 2014 für das Projekt \"Mobile Learning\", M-Days (Frankfurt a. M.), Haymarket Media GmbH 2012 Best Paper 46th Hawaii International Conference on System Sciences (HICSS), Track \"Internet and the Digital Economy\" 2009 Innovationspreis E-Learning, Universität Potsdam 2007 Outstanding Research Paper, International Academy of E-Business (IAEB), 7th Annual Conference 2007 Weitere Informationen Vollständige Publikationsliste Geleitete Forschungsprojekte",
  "content_length": 3435,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:10"
}