{
  "name": "Stefan Dessloch",
  "homepage": "http://wwwlgis.informatik.uni-kl.de/cms/his/staff/dessloch",
  "status": "success",
  "content": "Lehrgebiet Informationssysteme: Prof. Dr.-Ing. Stefan Deßloch Lehrgebiet Informationssysteme AG DBISAG HISStaffMichael HohensteinGajendra DoniparthiTim OttoStefan DeßlochYong HuWeiping QuSteffen ReithermannHeike NeuFormer MembersProjectsCoursesPublications AG DBISPublications AG HISContactImpressumNewsIntern Prof. Dr.-Ing. Stefan Deßloch Contact University of Kaiserslautern Department of Computer Science Heterogenous Information Systems Group P.O. Box 3049 67653 Kaiserslautern, GERMANY Mail: stefan.dessloch (at) cs.rptu.de Room: 36/329 Phone: +49-631-205-3275 Fax: +49-631-205-3299 36/329 Scientific Career 08/1988 Diploma in Computer Science from the University of Kaiserslautern 09/1993 PhD (Dr.-Ing.) in Computer Science from the University of Kaiserslautern 1993 – 1995 Post-doctoral Researcher at the IBM Almaden Research Center and the IBM Database Technology Institute, San Jose, California 1995 – 1996 Software Engineer at IBM Deutschland Entwicklung GmbH, Böblingen Lab 1996 – 2002 Senior Software Engineer and Manager, Database Standards at the IBM Silicon Valley Lab, San José, California since 04/2002 Professor (C3), University of Kaiserslautern 05-09/2006 Visiting scientist at IBM Almaden Research Center, San José, California Stefan Deßloch is a professor at the University of Kaiserslautern, Germany, where he is heading the research group Heterogeneous Information Systems. Until 2002, he was a database architect at the IBM Database Technology Institute in San Jose, California, where he conducted projects in the areas of information integration architecture and programming models, database & application server integration, and object-relational database extensions, whose outcome helped to shape database-related standards, directly contributed to IBM's product directions and implementations, and resulted in a number of patents. From 2001 to 2002, as a manager, he was responsible for IBM's database-related standardization efforts in the areas of SQL, XML, and Java. Research Interests Major areas of interest include information integration, (DB-) middleware technologies, databases and the web, XML and databases, database and application server integration, extensible and object-relational DBMS. Ongoing research projects are described in our projects section. AdditionalActivities, Responsibilities, and Memberships Editorial board member of the \"Int. Journal of Web Services Research (JWSR)\", Idea Group Publishing/Information Science Publishing.Electronic proceedings chair and co-editor of the ACM SIGMOD 2004 conference. Held tutorials on database standards at BTW Datenbank Tutorientage in 2005, 2001, 1999.Program committee and organisation committee member of numerous national and international conferences. Head of the PhD Study Program, Dept. of Computer Science.Member of ACM SIGMOD and the German Informatics Society (GI). Publications A full list of publications of our research group can be found in our publications section. A list of publications is also available at the DBLP Bibliography Server. Patents A list of issued patents and published patent applications can be found at the US Patent and Trademark Office web site. CSS Layout: YAML",
  "content_length": 3195,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:49"
}