{
  "name": "Stefan Wolf 0001",
  "homepage": "http://search.usi.ch/people/eefbe656c9dfacf0e1a1e15bf8893bcb/Wolf-Stefan",
  "status": "success",
  "content": "Wolf, Stefan | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Stefan Wolf http://usi.to/nbk Biography Stefan Wolf is an associate professor for Informatics at USI since 2011. Born in Schaffhausen, Switzerland, he received a Dipl. Math. ETH, followed by a PhD in Computer Science from ETH Zurich under the supervision of Professor Ueli Maurer. After a postdoc at McGill University, Montreal, he was Assistant Professor at University of Waterloo, Ontario, and Université de Montréal, Quebec. From 2005 to 2011, he was an SNF Professor for Quantum Information at ETH Zürich.His research domain lies in the fields of cryptography, information theory, and quantum information processing. In particular, he is interested in an efficient realization of provably secure cryptographic and other information-processing functionalities based on weak classical or quantum-physical primitives. Contact stefan.wolf@usi.ch tel +41 58 666 4121 East Campus, Sector D, Office D5.06 (Level P5) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Links Website or personal page Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 1839,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:20"
}