{
  "name": "Stefan Heinrich",
  "homepage": "https://stefanheinrich.net",
  "status": "success",
  "content": "Overview - Dr. Stefan Heinrich Stefan HeinrichScholar & IT Tinkerer, Associate Professor at the IT University of Copenhagen, Denmark Follow Copenhagen, Denmark Google Scholar LinkedIn ORCID ResearchGate Github Email OverviewHi, I’m Dr. rer. nat. Dipl.-Inform. Stefan Heinrich, a scholar and IT tinkerer from Germany, currently appointed as associate professor of the Computer Science Department at IT University of Copenhagen and affiliate researcher at Pioneer Centre for Artificial Intelligence. These are what I consider my key skills and experiences in a nutshell:Extensive experience in scientific research in the fields of Computer Science, Cognitive Psychology, and Computational Neuroscience, with Master and PhD degreesFourteen years of academic research in Computational Modelling, Natural Language Processing, and Machine Learning — current focus on Temporal Dynamics and Probabilistic Neural NetworksTwelve years of teaching at undergraduate and postgraduate levels in Artificial Intelligence, Neural Networks, Data Mining, and Human–Robot Interaction, as well as supervision of more than 30 individual PhD, MSc, and BSc dissertationsCoordination and team building of research and student teams for short- to mid-term projectsResourceful, creative, goal-oriented, organised, independent, as well as a team player and team builderResearch Interests and BackgroundMy research interest is located in between artificial intelligence, cognitive psychology, and computational neuroscience. Here, I aim to understand the computational principles underlying brain function but also to utilise them in developing AI systems. In particular, I study the processes and mechanisms in the brain that form representations in temporally dynamic composition and decomposition as well as in multi-modal integration. As a central approach, I develop computational cognitive models such as artificial neural networks with plausible timescale mechanisms and probabilistic learning schemes on tasks and phenomena in music and language processing, neurodiversity, and cognitive development. These models have practical applications in machine learning, natural language processing, and data science as inductive biases in AI frameworks, and implications for cognitive science as priors and constraints in models of sequence generation, sequence prediction, and compositionality.",
  "content_length": 2367,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:51"
}