{
  "name": "Stefan Leutenegger",
  "homepage": "https://mlr.in.tum.de/members/leuteneg",
  "status": "success",
  "content": "Machine Learning for Robotics - Prof. Dr. Stefan Leutenegger Direkt zum Inhalt springen Login Machine Learning for Robotics TUM School of Computation, Information and TechnologyTechnical University of Munich Technical University of Munich Menu Links Informatik IX Professorship for Machine Learning for Robotics Smart Robotics Lab Boltzmannstrasse 3 85748 Garching info@srl.cit.tum.de Follow us on: SRL CVG DVL Navigation Home Members Prof. Dr. Stefan Leutenegger Dr. Jaehyung Jung Simon Boche Simon Schaefer Hanzhi Chen Sebastian Barbas Laina Jiaxin Wei Anran Zhang Yannick Burkhardt Leonard Freissmuth News Research Areas Multi-Sensor SLAM Dense Map Representations Semantic, Object-level and Dynamic SLAM Machine Learning (Including Deep Learning) Robot Navigation Physical Interaction Drones People Tracking & Human-Robot Interaction Publications Teaching Student Projects Winter Semester 24/25 Gems of Informatics I Seminar: Robot Perception & Intelligence Material Summer Semester 24 Remote Machine Intelligence Lab Seminar: Robot Perception & Intelligence Material Winter Semester 23/24 Gems of Informatics I Mobile Robotics Mobile Robotics Practicals Remote Machine Intelligence Lab Seminar: Robot Perception & Intelligence Material Summer Semester 23 Remote Machine Intelligence Lab Seminar: Robot Perception & Intelligence Material Winter Semester 22/23 Gems of Informatics I Mobile Robotics Mobile Robotics Practicals Seminar: Beyond Deep Learning Seminar: Multi-Modal Perception for Mobile Robotics Material Summer Semester 22 Block Seminar: Deep-learning-based 3D scene representation and understanding for mobile robots Material Seminar: Multi-Modal Perception for Mobile Robotics Material Winter Semester 21/22 Mobile Robotics Mobile Robotics Practicals Seminar: Recent Advances in Perception for Mobile Robotics Material Awards Software & Datasets Workshops & Tutorials Prof. Dr. Stefan Leutenegger OrdinariusTechnical University of MunichSchool of Computation, Information and TechnologyInformatics 9Boltzmannstrasse 385748 GarchingGermanyTel: +49-89-289-17700Fax: +49-89-289-17757Mail: Stefan.Leutenegger@tum.de Rechte Seite Informatik IX Professorship for Machine Learning for Robotics Smart Robotics Lab Boltzmannstrasse 3 85748 Garching info@srl.cit.tum.de Follow us on: SRL CVG DVL Find more topics on the central web site of the Technical University of Munich: www.tum.de About TUMOur UniversityNewsCoronavirusPublicationsDepartmentsAwards and HonorsUniversity HospitalsTeaching and QMSWorking at TUMGivingTUM Fan?Contact & DirectionsResearchDepartmentsResearch CentersExcellence StrategyResearch projectsResearch PartnersResearch promotionDoctorate (Ph.D.)PostdocsCareer openingsInnovationEntrepre­neurshipTechnology transferIndustry Liaison OfficeContactsStudiesLifelong learningDegree programsInternational StudentsAdvisingApplicationFees and Financial AidDuring your StudiesCompleting your StudiesContactsUniversity LifeStudent LifeAccommo­dationSportsMusic and ArtsEventsAlumni ServicesCareer ServiceMentoringTUM for schoolsTUM ShopGlobalInternational LocationsTUM AsiaInternational StudentsExchangeInternational AlliancesLanguage CenterContacts Jobs Feedback Presse Datenschutz Impressum",
  "content_length": 3216,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:59"
}