{
  "name": "Stefan Lee",
  "homepage": "http://web.engr.oregonstate.edu/~leestef",
  "status": "success",
  "content": "Stefan Lee | Oregon State University Stefan Lee About Press Teaching Research Contact me at leestef[at]oregonstate[dot]edu Office: KEC 3013 CV About I'm an Associate Professor in the School of Electrical Engineering and Computer Science (EECS) at Oregon State University. My focus is the development of agents that can perceive their environment and communicate about this understanding with humans in order to coordinate their actions to achieve mutual goals -- in short, agents that can see, talk, and act. Consequently, I work on problems in computer vision, natural language processing, and deep learning in general. Lab PhD Students Zijiao Yang  •   Xiangxi Shi   •   Hunter Brown    •   Skand    •   Abhinav Jain •   Akhil Perincherry • Joe Nguyen Career 2025 Associate Professor @ Oregon State - School of Electrical Engineering and Computer Science 2019 Assistant Professor @ Oregon State - School of Electrical Engineering and Computer Science 2017 Research Scientist II @ Georgia Tech - School of Interactive Computing 2016 Postdoctoral Associate @ Virginia Tech - Bradley Department of Electrical and Computer Engineering 2016 Earned PhD @ Indiana University - School of Informatics & Computing Teaching Oregon State CS435 - Applied Deep Learning (Winter 2024) (Instructor) AI535 - Deep Learning (Spring 2022-2023) (Instructor) CS434 - Machine Learning and Data Science (Spring 2021, Fall 2021-2024) (Instructor) CS539 - Natural Language Processing with Deep Learning (Winter 2021, Spring 2023-2025) (Instructor) CS539 - Embodied AI (Fall 2019) (Instructor) Georgia Tech CS8903 - Special Problems (Fall 2017 - Spring 2019) (Faculty Advisor) Virginia Tech EECE 5424/4425 CS 5824/4824 - Introduction to Machine Learning (Fall 2016) (Instructor) Research Press Coverage - Coverage of our emergence of maps in blind navigation agents work from New Scientist - Coverage of embodied AI work at Facebook including our Semantic MapNet effort - ZDNET MIT Technology Review Digital Trends VentureBeat 2020 - Coverage of our Vision-and-Language Navigation in Continuous Environments project - ZDNET 2020 - Facebook, Georgia Tech & OSU ViLBERT Achieves SOTA on Vision-and-Language Tasks - SyncedReview 2019 - Meet ViLBERT, The Task-Agnostic Model Inspired From BERT for Visual Grounding - Analytics India 2019 - Facebook helped create an AI scavenger hunt that could lead to the first useful home robots - MIT Technology Review 2018 - How A Virtual Scavenger Hunt Could Train Robots To Find Things In Your Home - FastCompany 2018 - Facebook is training AI to answer questions like humans do -- Digital Journal 2018 - Research Scientist, Assistant Professor Represent IC in DARPA Risers Event - ML@GT Blog 2018 - What is Graph R-CNN? - ML@GT Blog 2018 - Choose Your Neuron: Incorporating Domain Knowledge through Neuron-Importance - ML@GT Blog 2018 - Embodied Question Answering - ML@GT Blog 2018",
  "content_length": 2894,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:57"
}