{
  "name": "Stefan Harmeling",
  "homepage": "https://ai.cs.tu-dortmund.de/staff/harmeling-lab/prof-dr-stefan-harmeling",
  "status": "success",
  "content": "Prof. Dr. Stefan Harmeling - AI - TU Dortmund To path indicator Subpages of “Staff“ To navigation To quick access To footer with other services To content Artificial Intelligence Fakultät für Informatik © Wolfram Scheible Curriculum Vitae: 1998: Dipl. Math. with specialization in Mathematical Logic, Universität Münster 2000: M.Sc. in Computer Science with specialization on Artificial Intelligence, Stanford University, USA 2005: Dr. rer. nat. in Machine Learning, Universität Potsdam 2005-2007: Postdoc at the University of Edinburgh, Schottland 2007-2014: Postdoc at the Max-Planck-Institut für Biologische Kybernetik and at the Max-Planck-Institut for Intelligent Systems in Tübingen 2014-2022: Professor for Machine Learning at Universität Düsseldorf since 2022: Professor for Artificial Intelligence at TU Dortmund Research interest: Machine Learning Deep Learning Reinforcement Learning Causality Lectures available online: 10 Lectures \"KI für Alle\" at Heinrich-Heine Universität Düsseldorf, WS 2019 https://mediathek.hhu.de/watch/6b27cb1d-619a-4be3-a042-e834d21ac736 28 Lectures \"Machine Learning\" at Heinrich-Heine Universität Düsseldorf, WS 2021 https://www.youtube.com/watch?v=HZ6PNyjq0Fs&list=PLzrCXlf6ypbxS5OYOY3EN_0u2fDuIT6Gt 28 Lectures \"Probabilistic Reasoning and Machine Learning\" at TU Dortmund, WS 2022 https://www.youtube.com/watch?v=PmhJCl_DWH8&list=PLzrCXlf6ypbzDYKDchKfM-I9s20mFCL0q Publications: Google Scholar DBLP ArXiv ORCiD Prizes and awards: 2022: First place at the \"Helsinki Tomography Challenge 2022\" with Thomas Germer, Jan Robine, Sebastian Konietzny, Tobias Uelwer 2012: Günter Petzow prize in appreciation of outstanding scientific work at the Max Planck Institute for Intelligent Systems 2011: DAGM prize in appreciation of the outstanding work \"Improving Denoising Algorithms via a Multi-Scale Meta-Procedure\" with Christopher Burger 2009: Award for Best Contribution at the International Conference \"COSMOSTAT -- Statistical Challenges in Cosmology\" for the poster entitled \"Online Blind Deconvolution with Super-Resolution and Saturation Correction\" with Michael Hirsch, Suvrit Sra, Bernhard Schölkopf 2009: Top Score in category \"low noise\" of the \"International GREAT08 challenge: An image analysis competition for cosmological lensing\" with Michael Hirsch, Bernhard Schölkopf To top of page",
  "content_length": 2335,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:52"
}