{
  "name": "Stefan Frank",
  "homepage": "https://www.ru.nl/english/people/frank-s",
  "status": "success",
  "content": "Dr S.L. Frank (Stefan) | Radboud University Dr S.L. Frank (Stefan) Associate professor - Centre for Language Studies Associate professor - Department of Modern Languages and Cultures Contact stefan.frank@ru.nl 024-3615491 To Mastodon Personal profile Visiting address Erasmusplein 1 6525 HT NIJMEGEN Postal address Postbus 9103 6500 HD NIJMEGEN Working days Monday, Tuesday, Thursday, Friday Language comprehension, computational cognitive modelling, multilingualism, computational linguistics, and any combination of these. Tags: Psycholinguistics, Computational modeling, Language processing Publications Key publications Grzyb, B., Frank, S.L., & Vigliocco, G. (2024). Communicative efficiency in multimodal language directed at children and adults. Journal of Experimental Psychology: General, 153, 1904-1919 Full text Khoe, Y.H., Tsoukala, C., Kootstra, G.J., & Frank, S.L. (2023). Is structural priming between different languages a learning effect? Modeling priming as error-driven implicit learning. Language, Cognition and Neuroscience, 38, 537-557 Full text Frank, S.L. (2021). Towards computational models of multilingual sentence processing. Language Learning, 71, 193-218 Full text Tsoukala, C., Broersma, M., Van den Bosch, A., & Frank, S.L. (2021). Simulating code-switching using a neural network model of bilingual sentence production. Computational Brain & Behavior, 4, 87-100 Full text Frank, S.L. & Willems, R.M. (2017). Word predictability and semantic similarity show distinct patterns of brain activity during language comprehension. Language, Cognition and Neuroscience, 32, 1192-1203 Full text Publication lists Radboud Repository Research Information Services (RIS) Research grants and prizes 2022 - NWO Social Sciences and Humanities Open Competition Projects 2023 - 2028 The Language Leak: People who speak multiple languages do not have a “fire wall” in their brain to keep the languages apart: knowledge of one language affects use of the other. The researchers will develop a precise, mathematical description of this “language leak” by having a computer simulate its causes and consequences. More information 2022 - 2026 Enabling multilingual eye-tracking data collection for human and machine language processing research. This EU COST Action aims to develop a large multilingual eye tracking corpus and enable researchers to collect data by sharing infrastructure and their knowledge between various fields, including linguistics, psychology, and computer science. More information 2017 - 2024 The nature of the mental lexicon: How to bridge neurobiology and psycholinguistic theory by computational modelling? This project is \"Big Question 1\" of the \"Language in Interaction\" NWO Gravitation Programme. More information Teaching Courses Bachelor Thesis Linguistics Computational Psycholinguistics Master Linguistics Internship Master's Thesis Psycholinguistics Semantics and Morphology Ancillary activities Action Editor for scientific journal Language, Cognition and Neuroscience (05 June 2018) Taylor & Francis",
  "content_length": 3047,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:49"
}