{
  "name": "Stefan Kopp",
  "homepage": "https://www.techfak.uni-bielefeld.de/~skopp",
  "status": "success",
  "content": "Stefan Kopp's homepage Social Cognitive Systems AG Kognitive Systeme und soziale Interaktion Faculty of Technology  – Bielefeld University Home Research Members Publications Teaching Theses Contact Prof. Dr.-Ing. Stefan Kopp Dean of the Faculty of Technology, Full professor (W3) of \"Cognitive and Socially Interactive Systems\" and head of the Social Cognitive Systems Group at the Faculty of Technology and the Research Center for \"Cognitive Interaction Technology\" (CITEC) of Bielefeld University. Contact Mail: skopp[at]techfak[dot]uni-[city][dot]de Phone: +49 (0)521 106-12144 Phone (Secretary): +49 (0)521 106-12153 Room: 2.040 (CITEC Building) Office hours: by arrangement More information: U Bielefeld directory https://orcid.org/0000-0002-4047-9277 Google scholar entry Selected roles and affiliations (current and former) Dean of the Faculty of Technology [since Oct 2025] Deputy coordinator of CITEC (Research Center for \"Cognitive Interaction Technology\") [since 2022] Member of EU network of excellence ELLIS Board member of TRR 318 \"Constructing Explainability\" [since 2021] Coordinator Master's prorgamme \"Intelligent Interactive Systems\" (M.Sc.) at Bielefeld U Member of the Senate of Bielefeld University [2020-2022] Deputy coordinator of SFB 673 \"Alignment in Communication\" [2014/16] Head of Advisory Board German Cognitive Science Society (GK) [2015-2018] Chairman of the German Cognitive Science Society (GK) [2013/14] Head of Independent Junior Research Group \"Sociable Agents\" (CITEC) [2007-2011] Research fellow at the Center for Interdisciplinary Research (ZiF) in Embodied Communication [2005/06] Postdoc at the ArticuLab (Northwestern U, now at CMU) [2004] Member of SFB 360 \"Situated Artificial Communicators\" Research assistant and faculty staff at the A.I. Group at Bielefeld U [1998-2006] Selected scientific activities ACM IVA 2026 program chair ACM IVA 2023 program chair Lorentz Center Workshop \"Artificial Social Intelligence\" (2022) HRI 2020 Workshop on \"Exploring the relationship between mindreading and social attunement in HRI\" (2020) IVA 2019 program chair IVA 2017 program chair 3rd Workshop on Virtual Social Interaction, chair Ass. Editor \"Cognitive Processing\" Ass. Editor \"Cognitive Systems Res.\" Ass. Editor \"Frontiers in ICT\" Editorial board \"Gesture\"",
  "content_length": 2298,
  "method": "requests",
  "crawl_time": "2025-12-01 14:30:55"
}