{
  "name": "Stefan Szeider",
  "homepage": "https://www.ac.tuwien.ac.at/people/szeider",
  "status": "success",
  "content": "Stefan Szeider – Algorithms and Complexity Group Stefan Szeider Professor Head of the Algorithms and Complexity Group Faculty of Informatics Technische Universität Wien (TU Wien) Favoritenstraße 9–11, E192-01 1040 Vienna, Austria Room HC0401 Phone: +43(1)58801–192100 sz@ac.tuwien.ac.at AI-readable profile Biography News MCP-DBLP: An MCP server that provides Large Language Models access to the DBLP computer science bibliography database. Paper accepted to AI4SC @ AAAI 2026. Sofware on PiPy. SAT 2026 PC co-chair: website is online New paper on arxiv: What Do LLM Agents Do When Left Alone? MCP Solver, version 3.4 released. A Model Context Protocol (MCP) server that exposes SAT, SMT, and constraint-solving capabilities to Large Language Models. Supports MiniZinc (CP), PySAT (SAT, MaxSAT),  Z3 (SMT), and clingo (ASP).  Paper published at SAT 2025. Agentic Python Coder, version 1.0.0 released [GitHub] [paper] Invited speaker at SC2 2025. Workshop affiliated with CADE 2025, 10th International Workshop on Satisfiability Checking and Symbolic Computation, August 2, 2025, Stuttgart, Germany Invited speaker at LLM-Solve 2025. Joint talk with PTHG, Workshop on LLMs meet Constraint Solving, CP/SAT 2025,  August 11, 202,5 Glasgow, Scotland Invited speaker at PTHG 2025. Joint talk with LM-Solve, Workshop on Progress Towards the Holy Grail,  CP/SAT 2025,  August 11, 202,5 Glasgow, Scotland Co-organizer of ML4SP 2025. Workshop on Machine Learning for Solvers and Provers, CP/SAT 2025,  August 10, 202,5 Glasgow, Scotland Invited speaker at NSE 2025. Workshop on Neuro-Symbolic Software Engineering, affiliated with ICSE 2025, May 5, 2025, Ottawa, Canada Academic Affiliations. I am a full professor and chair at TU Wien, Vienna, Austria, and head of the Algorithms and Complexity Group, and I am a visiting scientist at the Simons Institute for the Theory of Computing, UC Berkeley. Previously, I held academic positions at the University of Durham (UK), the University of Toronto (Canada), and the Austrian Academy of Sciences (Austria). Academic Activities.  I am a founding co-chair of the Vienna Center for Logic and Algorithms (VCLA),  the chair of the Marie Skłodowska-Curie COFUND  doctoral programme logicCS@TUWien, a key researcher of the Cluster of Excellence Bilateral AI, a full member of the Wolfgang Pauli Institute, a board member of the Center for Artificial Intelligence and Machine Learning (CAIML), the scientific co-organizer of the Vienna Gödel Lectures, and the chair of the jury for the Heinz Zemanek Dissertation Price of the Austrian Computer Society. I am the speaker of the full professors in Computer Science at TU Wien. Previously, I was the deputy speaker of the Doctoral Program Logical Methods in Computer Science (LogiCS),  and coordinator of the research focus Logic and Computation at the Faculty of Informatics, TU Wien. Research. In my research, I combine algorithmic and logic-based methods to solve hard computational problems that arise in Artificial Intelligence, Automated Reasoning, and Combinatorial Optimization. The design of efficient algorithms is complemented by complexity-theoretic methods for establishing theoretical limits and lower bounds. I have been the principal investigator of several research projects, including projects from the ERC (EU), the EPSRC (UK), the Nuffield Foundation (UK), the FWF (Austria), and the WWTF (Austria). My Erdős Number is 2, and I have published over 200 articles in scientific journals and conference proceedings. Publications. A list of my publications can be found here. Editorial. I am an Associate Editor of the Journal of Computer and System Sciences (JCSS) and the Journal of Artificial Intelligence Research (JAIR). Previously, I have served on the editorial boards of the Journal of Discrete Algorithms (2014—2018),  Fundamenta Informaticae (2012—2018), and I was a guest editor of Algorithmica (2015) and Discrete Applied Mathematics (2022). I have co-edited the Proceedings of MFCS 2022, IPEC 2013, COMMA 2012, and SAT 2010. Public Outreach. I'm engaged in dissemination activities of Computer Science to children and interested people;  I am a founding member of the initiative ADA (Algorithms Think Differently), curator of the world record human sorting network,  and the initiator of the video competition Algorithms in 60 Seconds. In 2021, I gave a lecture on Algorithms to the Austrian Parliament. I have created a contemporary version of the Garey-Johnson Cartoon and an OBDD representation of the US presidential election 2020 and 2024. Recently, I co-authored a survey article in the Communications of the ACM, which was downloaded over 45000 times. I designed an educational interactive Shannon Linguistic Playground. Here is some recent media coverage. Awards and Prizes. I received a Highlighted Paper Award at SAT 2023 (with Katalin Fazekas, Aina Niemetz, Mathias Preiner, Markus Kirchweger,  and Armin Biere), a Best Paper Award at CP 2020 (with Tomas Peitl), and a first prize in the PACE 2019 competition (with Andre Schidler). I was the first Austrian Computer Scientist to receive an award from the European Research Council (ERC Start 2009). Graduate Students and Postdocs. My current students and postdocs are Markus Kirchweger (PhD),  Tianwei Zhang (PhD), Hai Xia (PhD), Alexis de Colnet (Postdoc), Andre Schidler (PhD 2023, received the Best Dissertation Award 2024, now Postdoc at TU Wien), Vaidyanathan P. R. (PhD 2023, now Postdoc),  Leroy Chew (postdoc),  Tomas Peitl (PhD 2019, now Postdoc), and Jan Dreier (Postdoc). Former Postdocs were Robert Ganian (now Prof. at TU Wien), Sebastian Ordyniak (now Prof. at U Leeds), Simone Bova, Ramanujan Sridharan (now Prof. at U Warwick), Serge Gaspers (now Prof. at UNSW), Neeldhara Misra (now Prof. at IIT Gandhinaga), and Marko Samer. My former graduate students were Neha Lodha (PhD 2019, Best Student paper at SAT 2016, now Mondi Group), Eduard Eiben (PhD 2018, received Austria's Award of Excellence, now Prof. at RHUL, U London),  Ronald de Haan (PhD 2016, received the Beth Dissertation Prize, now Prof. at U Amsterdam), Johannes Fichte (PhD 2015, now Prof . at Linköping U), Friedrich Slivovsky (PhD 2015, now Prof. at U Liverpool), Luke Mathieson (PhD 2010, now Prof at UT Sydney). Organization of Scientific Events. I co-organized the Dagstuhl Seminar SAT Encodings and Beyond (2023) and the Workshop on Logic-based Methods in Machine Learning, part of FLoC 2022.  I was the general chair and co-organzier of  the 47th International Symposium on Mathematical Foundations of Computer Science MFCS 2022),  I co-organized the 9th Workshop on Graph Classes, Optimization, and Width Parameters (GROW 2019), I was the chair of the Congress on Algorithms (ALGO 2017), the Symposium on New Frontiers in Knowledge Compilation (2015), the First Symposium on Structure in Hard Combinatorial Problems (2013), the Third Workshop on Kernelization (2011), and the first Workshop on the Parameterized Complexity of Computational Reasoning (2010).  I was the workshop chair at FLoC 2014, overseeing 74 workshops. Programm Committees. SAT 2026 (PC co-chair), ICLR 2026 (PC), AAAI 2026 (area chair),  IJCAI 2025 (area chair),  NSE@ICSE 20256 (PC), SAT 2025 (PC), AAAI 2025 (area chair), NSE@ICSE 2025 (PC), CP 2024 (PC),  SAT 2024 (PC), AAAI 2024 (area chair) UAI 2023 (PC), SAT 2023 (PC), MFCS 2022 (general chair),  AAAI 2022 (SPC), UAI 2022 (PC), SEA 2022 (PC), UAI 2021 (PC), SOCS 2021 (PC), SAT 2021 (PC),   AAAI 2021 (SPC), NeurIPS 2021 (PC), SOCS 2020 (PC),  NeurIPS 2020 (PC), CP 2020 (PC),  IJCAI-PRICAI 2020 (SPC),  SAT 2020 (PC), CPAIOR 2020 (PC), GROW 2019 (co-chair), SoCS 2019 (PC),  CP 2019 (PC), IJCAI 2019 (SPC), ICALP 2019 (PC), SAT 2018, IJCAI-ECAI 2018 (SPC), ALGO 2017 (chair),  SAT 2017 (PC),  IPEC 2016 (PC), STACS 2016 (PC), SAT 2016 (PC), BeyondNP 2016 (PC), IJCAI 2016 (SPC),  SAT 2015 (PC), IJCAI 2015 (SPC), FLoC 2014 (workshop chair),  ECAI 2014 (PC),  SAT 2014 (PC), STAIRS 2014 (PC),  ECAI 2014 (PC),  ISAIM 2014 (PC),  IPEC 2013 (co-chair),  SAT 2013 (PC), CP 2013 (SPC), QBF 2013 (PC), IJCAI 2013 (SPC), CP 2012 (PC),  AAAI 2012 (PC),  MEMICS 2012 (PC),  SAT 2012 (PC),  SAT 2011 (PC),  NECTAR 2011 (PC),  MFCS 2010 (PC), ISAIM 2010 (PC),  NECTAR 2010 (PC),  SAT 2010 (PC co-chair),  IWPEC 2009 (PC),  IJCAI 2009 (PC),  SAT 2009 (PC),  CATS 2009 (PC), ASCW 2009,  IWPEC 2008 (PC),  AAAI 2008 (PC),  SAT 2008 (PC),  SAT 2007,  SAT 2006 (PC),  WADS 2005 (PC),  SAT 2005 (PC). Teaching. I am responsible for the Algorithms and Data Structures course (Bachelor's) and Algorithmics (Master's).  The former course was nominated for the Best Teaching Award 2022 and the Best Distance Learning Award 2020. I'm also part of the course Ways of Thinking in Informatics , which won a Special Award for Digital Teaching in 2022. Offenlegung (§25 MedienG) Inhaber der Website ist das Institut für Logic and Computation an der Technischen Universität Wien, 1040 Wien. Die TU Wien distanziert sich von den Inhalten aller extern gelinkten Seiten und übernimmt diesbezüglich keine Haftung. – Disclaimer – Datenschutzerklärung Log in requires cookies.",
  "content_length": 9130,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:11"
}