{
  "name": "Stephen O. Mussmann",
  "homepage": "https://steve.mussmann.us",
  "status": "success",
  "content": "Steve MussmannSearch this siteEmbedded FilesSkip to main contentSkip to navigationSteve MussmannAssistant Professor, School of Computer Science, Georgia Techmussmann@gatech.eduKACB 3320Research interests: data-centric machine learning and active learningGoogle Scholar, CVMy research focuses on data-centric machine learning, emphasizing the often-overlooked aspects of data such as sourcing, annotation, and validation, which critically impact the reliability and usability of ML systems. I combine theoretical and experimental methods to develop conceptual insights with practical relevance.Within data-centric machine learning, I am especially interested in:Active Learning and Experimental Design (methods to select data to collect supervision)Statistical aspects of data algorithms and data-centric ML (e.g., noise, domains, concept shift)Task specifications with instructions (e.g., prompts, concepts) and demonstrations (e.g., labeled examples)If you are a prospective student interested in working together, please see Prospective Students for instructions.Teaching(Fall 2025) CS 7545 Machine Learning Theory (tentative syllabus, HW1.1-4)(Fall 2024) CS 8803-DML Data-centric Machine Learning (syllabus)StudentsCurrentKangping Hu: PhD student in CSHangyu Zhou: PhD student in MLKabir Kang: MS student in CSKalp Vyas: MS student in CSSaloni Bedi: BS student in CSFormerWei-Liang (Edison) Liao: BS student in CSBioPrior to starting at Georgia Tech in Fall 2024, Steve spent a year as a machine learning researcher at Coactive AI. He finished a postdoc at the Paul Allen School of Compute Science and Engineering at the University of Washington with Kevin Jamieson and Ludwig Schmidt in September 2023. Steve graduated with a PhD in computer science from Stanford University in 2021, advised by Percy Liang, and a BS in math, statistics, and computer science from Purdue University in 2015.Other linksAffiliations: Foundations of AI (FoAI), ML@GT ORCID Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2030,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:02"
}