{
  "name": "Stephanie Weirich",
  "homepage": "https://www.cis.upenn.edu/~sweirich",
  "status": "success",
  "content": "Stephanie Weirich Stephanie Weirich ENIAC President's Distinguished Professor of Computer and Information Science School of Engineering and Applied Science University of Pennsylvania email: sweirich at seas.upenn.edu office: 510 Levine Hall office hours: please contact for an appointment postal mail: School of Engineering and Applied Science Department of Computer and Information Science Levine Hall 3330 Walnut Street Philadelphia, PA 19104-6389 Quick Links My publications (including drafts) My github Slides and videos from talks and tutorials CV Penn's Programming Languages group (plclub) Current Ph. D. Students Yiyun Liu Jonathan Chan Daniel Sainati (joint with Benjamin Pierce) PhD Graduates Pritam Choudhury, May 2023 Dependency and Linearity Analyses in Pure Type Systems Yao Li, Aug. 2022 Mechanized Reasoning About \"How\" Using Functional Programs and Embeddings Antal Spector-Zabusky, May 2021 Don't Mind the Formalization Gap: The Design and Usage of hs-to-coq Richard A. Eisenberg, Sep. 2016 Dependent Types in Haskell: Theory and Practice 2017 Morris and Dorothy Rubinoff Award Vilhelm Sjöberg, May 2015 A Dependently Typed Language with Nontermination 2016 John C. Reynolds Doctoral Dissertation award Brent Yorgey, Dec. 2014 Combinatorial Species and Labelled Structures Chris Casinghino, Dec. 2014 Combining Proofs and Programs Dimitrios Vytiniotis, Aug. 2008 Practical type inference for first-class polymorphism Geoffrey Washburn, Dec. 2007 Principia Narcissus: How to avoid being caught by your reflection Recent Courses Fall 25 - Programming Languages: Semantics and Types (CIS 7000-1) Spring 25 - Programming Languages and Techniques I (CIS 1200) Fall 24 - Advanced Programming (CIS 5520) Spring 24 - Programming Languages and Techniques I (CIS 1200) Fall 23 - Advanced Programming (CIS 5520) Spring 23 - Advanced Topics in Programming Languages (CIS 6700) Fall 22 - Advanced Programming (CIS 5520) Spring 22 - Programming Languages and Techniques I (CIS 120) Fall 21 - Advanced Programming (CIS 552) Spring 21 - Programming Languages and Techniques I (CIS 120) Fall 20 - Advanced Programming (CIS 552) Spring 20 - Programming Languages and Techniques I (CIS 120) Fall 19 - Advanced Programming (CIS 552) Spring 18 - Programming Languages and Techniques I (CIS 120) Fall 17 - Advanced Programming (CIS 552) Spring 17 - Advanced Programming (CIS 552) Fall 16 - Advanced Topics in Programming Languages (CIS 670)",
  "content_length": 2436,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:43"
}