{
  "name": "Stephen Lindsay",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/stephenlindsay",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Stephen Lindsay Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffStephen LindsayMr Ethan KellyZhen Tian Dr Stephen Lindsay Lecturer in Healthcare Technologies (School of Computing Science) email: Stephen.Lindsay@glasgow.ac.uk 502B, Sir Alwyn Williams Building, Glasgow, Glasgow City, Scotland, United Kingdom, G12 8QN Import to contacts https://orcid.org/0000-0001-6063-3676 Research interests I'm a human-computer interaction (HCI) researcher focused on digital health and wellbeing. I look at collaborativem and social elements of healthcare, empowering marginalised groups through participatory action research and making, and working with people living with variouss cognitive impariments. I'm interested in how people collaborate with each other to manage health problems and the differernt rolls that digital technology can play in those proceses. At the moment, my research focuses on helping people make their own technology while living with cognitive challenges like aquired brian injuries. I explore techniques to open up makerspaces to groups of people to build new skills, communities and technologies. In my previous work, I have looked at how to design digital aids to help promote safe walking for people living with dementia who are at risk of wandering, how to design and deploy in-home monitoring systems for older adults in ways that respect their privacy, and looked at barriers to using assistive technology for various groups.Research groupsGlasgow Interactive Systems Publications List by: Type | Date Jump to: 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017Number of items: 19.2024 Gray, Andy, Rahat, Alma, Crick, Tom and Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676 (2024) A Bayesian active learning approach to comparative judgement within education assessment. Computers and Education: Artificial Intelligence, 6, 100245. (doi: 10.1016/j.caeai.2024.100245) Saha, Manika, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Watterson, Jessica L., Bartindale, Tom, Varghese, Delvin, Oliver, Gillian C., Ishtiaque, Syed, Ahmed, Syed Ishtiaque and Olivier, Patrick (2024) Hearing Community Voices in HCI4D: Establishing Safe Places to Co-Create Counter-Collective Narratives with Women Farmers in Bangladesh. In: ACM CHI Conference on Human Factors in Computing Systems (CHI 2024), Oʻahu, Hawaiʻi, USA, 11-16 May 2024, (doi: 10.1145/3613904.3642532) 2023 Saha, Manika, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Varghese, Delvin, Bartindale, Tom and Oliver, Patrick (2023) Benefits of Community Voice: a Framework for Understanding Inclusion of Community Voice in HCI4D. In: 2023 ACM Conference On Computer-Supported Cooperative Work And Social Computing (CSCW '23), Minneapolis, MN, USA, 14-18 Oct 2023, (doi: 10.1145/3610174) Tzanidou, Alexandra, Abosaleh, Al Husein Sami, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Durrant, Abigail C. and Vlachokyriakos, Vasilis (2023) From Inclusive Theatre to Inclusive Technologies: Lessons Learnt From Co-designing Touch Tours With an Inclusive Theatre Group. In: 2023 ACM Designing Interactive Systems Conference (DIS '23), Pittsburgh, PA, USA, 10-14 Jul 2023, pp. 1367-1382. ISBN 9781450398930 (doi: 10.1145/3563657.3596094) Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252, Tran, Linda, Liu, Yanling, O’Neill, Conor and Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676 (2023) Infrastructural Work Behind The Scene: A Study of Formalized Peer-support Practices for Mental Health. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 561. ISBN 9781450394215 (doi: 10.1145/3544548.3580657) Ellis, Kirsten, Kruesi, Lisa, Ananthanarayan, Swamy, Senaratne, Hashini and Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676 (2023) \"Piece it Together\": Insights From One Year of Engagement With Electronics and Programming for People With Intellectual Disabilities. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 219. ISBN 9781450394215 (doi: 10.1145/3544548.3581401) Saha, Manika, Bartindale, Tom, Varghese, Delvin, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Richardson, Dan, Ishtiaque Ahmed, Syed and Olivier, Patrick (2023) Community Voice as Data: Affordances of Participatory Videos for International Program Development. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 792. ISBN 9781450394215 (doi: 10.1145/3544548.3581458) Siddiqui, Farheen, Varghese, Delvin, Singh, Pushpendra, Bapuji Bayyavarapu, Sunita, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Chandrasekara, Dharshani, Kulkarni, Pranav, Wu, Ling, Alshehri, Taghreed and Olivier, Patrick (2023) Exploring the Digital Support Needs of Caregivers of People With Serious Mental Illness. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 560. ISBN 9781450394215 (doi: 10.1145/3544548.3580674) Abdulgalimov, Dinislam, Kirkham, Reuben, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Nicholson, James, Vlachokyriakos, Vasilis, Dao, Emily, Kos, Daniel, Jitnah, Daniel, Briggs, Pam and Olivier, Patrick (2023) Designing for the embedding of employee voice. Proceedings of the ACM on Human-Computer Interaction, 7(CSCW1), 45. (doi: 10.1145/3579478) 2022 Bleakley, Anna, Rough, Daniel, Roper, Abi, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Porcheron, Martin, Lee, Minha, Nicholson, Stuart Alan, Cowan, Benjamin R. and Clark, Leigh (2022) Exploring Smart Speaker User Experience for People Who Stammer. In: 24th International ACM SIGACCESS Conference on Computers and Accessibility, Athens, Greece, 23-26 Oct 2022, ISBN 9781450392587 (doi: 10.1145/3517428.3544823) Alabdulqader, Ebtisam, Stockwell, Katy, Montague, Kyle, Jackson, Dan, Monk, Andrew, Pennington, Lindsay, McNaney, Roisin, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Wu, Ling and Olivier, Patrick (2022) Understanding the Therapeutic Coaching Needs of Mothers of Children with Cerebral Palsy. In: 2022 ACM Designing Interactive Systems Conference (DIS '22), 13-17 Jun 2022, pp. 1788-1801. ISBN 9781450393584 (doi: 10.1145/3532106.3533576) Howard, Jonathan, Fisher, Zoe, Kemp, Andrew H., Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Tasker, Lorna H. and Tree, Jeremy J. (2022) Exploring the barriers to using assistive technology for individuals with chronic conditions: a meta-synthesis review. Disability and Rehabilitation: Assistive Technology, 17(4), pp. 390-408. (doi: 10.1080/17483107.2020.1788181) (PMID:32663110) 2021 Ellis, Kirsten, Dao, Emily, Smith, Osian, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676 and Olivier, Patrick (2021) TapeBlocks: A Making Toolkit for People Living with Intellectual Disabilities. In: 2021 CHI Conference on Human Factors in Computing Systems (CHI '21), Yokohama, Japan, 08-13 May 2021, ISBN 9781450380966 (doi: 10.1145/3411764.3445647) 2020 Price, M. et al. (2020) Construal beliefs moderate the usability and effectiveness of a novel healthy eating mobile app. Physiology and Behavior, 222, 112941. (doi: 10.1016/j.physbeh.2020.112941) (PMID:32407831) Clark, Leigh, Cowan, Benjamin R., Roper, Abi, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676 and Sheers, Owen (2020) Speech diversity and speech interfaces: considering an inclusive future through stammering. In: 2nd Conference on Conversational User Interfaces (CUI ’20), Bilbao, Spain, 22-24 July 2020, ISBN 9781450375443 (doi: 10.1145/3405755.3406139) 2019 Zeb, Kehkashan, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Shahid, Suleman, Riaz, Waleed and Jones, Matt (2019) Sugar ka Saathi – a case study designing digital self-management tools for people living with diabetes in Pakistan. In: Lamas, David, Loizides, Fernando, Nacke, Lennart, Petrie, Helen, Winckler, Marco and Zaphiris, Panayiotis (eds.) Human-Computer Interaction – INTERACT 2019: 17th IFIP TC 13 International Conference, Paphos, Cyprus, September 2–6, 2019, Proceedings, Part III. Series: Lecture notes in computer science (11748). Springer: Cham, pp. 161-181. ISBN 9783030293864 (doi: 10.1007/978-3-030-29387-1_10) 2018 Price, Menna, Collier, Jordan, Keable-Steer, Samuel, Reitmaier, Thomas, Hamill, Alexandra, Wilkinson, Laura, Higgs, Suzanne, Mukhopadyay, Sabarna, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676 and Lee, Michelle (2018) The development of a healthy eating mobile app to enhance self-control using personalised cues: a feasibility study. Appetite, 130, p. 312. (doi: 10.1016/j.appet.2018.05.220) Zeb, Kehkashan, Lindsay, Stephen ORCID: https://orcid.org/0000-0001-6063-3676, Shahid, Suleman and Jones, Matt (2018) Verbal Design: a Participatory Design Approach with Illiterate Patient User Groups. In: 2018 ACM Conference Companion Publication on Designing Interactive Systems (DIS '18), Hong Kong, China, 09-13 Jun 2018, pp. 271-275. ISBN 9781450356312 (doi: 10.1145/3197391.3205448) 2017 Wall, Matthew, Costello, Rory and Lindsay, Stephen ORCI",
  "content_length": 19172,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:01"
}