{
  "name": "Stephen D. Wolthusen",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/stephen-d-wolthusen",
  "status": "success",
  "content": "Stephen D. Wolthusen - Royal Holloway Research Portal View Scopus Profile Stephen D. Wolthusen Professor Professor, Department of Information SecurityEngineering Research Centre https://orcid.org/0009-0000-6565-6797 Phone+44 1784 443270EmailStephen.Wolthusenrhul.acuk TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsProfessor, Norwegian University of Science and Technology1 Jan 2016 → … Research output 95 Conference contribution 7 Paper 7 Article 2 Chapter 2 More 1 Anthology 1 Other contribution Research output per year Research output per year Adversary Model for Attacks Against IEC 61850 Real-Time Communication ProtocolsNweke, L. O., Kahsay Weldehawaryat, G. & Wolthusen, S. D., 11 May 2020, (E-pub ahead of print) 2020 16th International Conference on the Design of Reliable Communication Networks, DRCN 2020. Institute of Electrical and Electronics Engineers Inc., p. 1-8 8 p. 9089346. (2020 16th International Conference on the Design of Reliable Communication Networks, DRCN 2020).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Modelling Adversarial Flow in Software-Defined Industrial Control Networks Using a Queueing Network ModelNweke, L. O. & Wolthusen, S. D., 7 Aug 2020, 2020 IEEE Conference on Communications and Network Security, CNS 2020. Institute of Electrical and Electronics Engineers Inc., 6 p. 9162191. (2020 IEEE Conference on Communications and Network Security, CNS 2020).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Resilience Analysis of Software-Defined Networks Using Queueing NetworksNweke, L. O. & Wolthusen, S. D., 30 Mar 2020, 2020 International Conference on Computing, Networking and Communications (ICNC): Communications and Information Security Symposium. IEEE, p. 1-7 7 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Driver-Node based Security Analysis for Network ControllabilityZhang, S. & Wolthusen, S., 15 Aug 2019, p. 1-6. 6 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile 153 Downloads (Pure) Modelling the Privacy Impact of External Knowledge for Sensor Data in the Industrial Internet of ThingsDarwish, S., Nouretdinov, I. & Wolthusen, S., 14 May 2019, (E-pub ahead of print) Security and Privacy Trends in the Industrial Internet of Things. p. 223-243 21 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter View all 113 research outputs Projects 3 Finished Projects per year NHS Health and Care Test Beds: TIHM - Technology Integrated Health ManagementWolthusen, S. D. (PI)1/04/16 → 31/03/18Project: Research Resilient Control Systems in Distributed Energy Systems RECONSYDERWolthusen, S. D. (PI)Eng & Phys Sci Res Council EPSRC1/12/15 → 31/05/19Project: Research Internet of Energy for Electric Mobility ARTEMIS Joint Technology InitiativeWolthusen, S. D. (PI)Innovate UK, ARTEMIS Joint Undertaking1/05/11 → 30/04/14Project: Research Activities 1 Examination Activities per year External ExaminerWolthusen, S. D. (Examiner)1 Jan 2016 → 31 Dec 2020Activity: Examination",
  "content_length": 3367,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:51"
}