{
  "name": "Stephen G. Ware",
  "homepage": "http://stephengware.com",
  "status": "success",
  "content": "Stephen G. Ware - Home Stephen G. Ware Artificial Intelligence. Narrative. Games. Home CV Publications Projects About I research computational models of narrative phenomena for Artificial Intelligence applications, especially games and other kinds of multi-agent virtual environments. Contact E-Mail: sgware@cs.uky.edu Google Scholar: Stephen G. Ware Facebook: Stephen G. Ware Twitter: @sgware welcome AI Research I am an Associate Professor at The University of Kentucky. There I direct the Narrative Intelligence Lab, teach classes on Artificial Intelligence and Game Development, and do research on intelligent systems that reason about narratives. Narrative pervades the way we think and communicate. By empowering computers to reason about them we can build interactive systems which teach, train, and entertain more effectively. Specifically, I work with automated planning systems. My work combines the cognitive richness of partially ordered causal link plan models with the speed of fast forward-chaining state space heuristic planning algorithms. Games My work is often done in the context of video games and other interactive digital environments. Games are an excellent testbed to investigate narrative problems and carry out user studies. Also, they're just plain fun! Working on video games is enjoyable, and game programming attracts interested, hard-working CS students. The fast-growing video game industry is increasinly in need of tools for generating and adapting stories, and my research aims to provide that. For Example Imagine you asked a computer to write Hamlet. Because planning algorithms were originally designed for things like robot movement, the computer would give you a short, efficient, and probably uninteresting story (e.g. everyone stabs one another in the first scene; curtain!). My work involves studying important narrative phenomena such as the importance of conflict and character development, and then encoding the knowledge of human experts (like screen writers) into something a computer can work with. Applications What are the uses of this technology? Well, imagine a video game that tells a story. Or imagine an intelligent tutoring system that adapts to the needs of an individual student. Or imagine a military training simulation which responds to the choices of the trainee. All of these systems need to change the narrative as they are used, and to make those changes they need some way to reason about narrative. Defining, testing, and implementing computational models for reasoning about narrative is the kind of work I do.",
  "content_length": 2580,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:51"
}