{
  "name": "Stephane Durocher",
  "homepage": "http://www.cs.umanitoba.ca/~durocher",
  "status": "success",
  "content": "Steph Durocher - personal home page Stephane Durocher personal home page Lisez cette page en français. I work as a professor in the GADA Lab in the Department of Computer Science at the University of Manitoba in Winnipeg, Canada. My research is in computational geometry, discrete algorithms, and data structures. contact coordinates Stephane Durocher office EITC E2-474 Department of Computer Science University of Manitoba Winnipeg, Manitoba, Canada R3T 2N2 firstname [dot] lastname [at] umanitoba [dot] ca phone: +001 204.474.8674 fax: +001 204.474.7609 N 49° 48.51', W 97° 08.06' photo by Matthew Brown, 2003 research My research is in computational geometry, data structures, geometric optimization, and discrete algorithms. My recent work includes theoretical results in geometric covering, local geometric routing, range searching, polygon reconstruction, graph drawing, online algorithms, geometric models for wireless communication, kinetic data structures, geometric depth measures, and facility location. I am also interested graph theory, computational complexity, combinatorial algorithms, combinatorial geometry, and discrete mathematics. See my research projects, my publications, or the lab for more information. I have funding available for graduate students interested in pursuing a M.Sc. or Ph.D. on a thesis topic related to my research expertise. A list of students and postdoctoral fellows working with me can be found here. I have served on program committees for LATIN 2010, CCCG 2010 (conference co-chair), CCCG 2011, WALCOM 2012, COCOA 2012, CCCG 2015, ALGOSENSORS 2015, CCCG 2016, WADS 2017, GD 2017, SoCG YRF 2017, CCCG 2018 (conference co-chair), WALCOM 2019, CCCG 2020, EuroCG 2022, CCCG 2023, WALCOM 2024, CCCG 2024, CCCG 2025, WALCOM 2026, and GD 2026, and as a guest editor for the journal Computational Geometry: Theory and Applications. teaching winter 2026: Advanced Data Structures (COMP 4420) fall 2025: Automata Theory and Formal Languages (COMP 3030) winter 2025: Computational Geometry (COMP 7922) fall 2024: Automata Theory and Formal Languages (COMP 3030) winter 2024: Advanced Design and Analysis of Algorithms (COMP 4420) fall 2023: Automata Theory and Formal Languages (COMP 3030) winter 2023: Advanced Design and Analysis of Algorithms (COMP 4420) personal interests I enjoy a variety of outdoor activities, including cycling, climbing, mountaineering, backpacking, backcountry skiing, canoeing, and photography. These pages include trip reports and a list of peaks summited. I ride with Red River Cycling Club and Green Route Cycling Club. This page was last modified on 19 November 2025. links publications curriculum vitae GADA Lab (2016-) computational geometry lab (2009-2016) students and postdoctoral fellows prospective graduate students research projects department seminar",
  "content_length": 2829,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:38"
}