{
  "name": "Stephen Melczer",
  "homepage": "https://melczer.ca",
  "status": "success",
  "content": "Stephen Melczer Search Office - MC 6028 smelczer (at) uwaterloo.ca 1-519-888-4567 x41282 I’m an associate professor in the Department of Combinatorics and Optimization at the University of Waterloo (with a cross-appointment in the School of Computer Science), interested in leveraging computational algebraic geometry, analysis, and topology to create effective tools for combinatorics, computer science, and mathematics. An overview of some of my research interests can be found in the first chapter of An Invitation to Enumeration or the slides of my recent talk at FPSAC 2025. More details can be found on my research page. Previously I was a CRM-ISM postdoctoral fellow at UQAM (2019 – 2020) and a postdoc at the University of Pennsylvania (2017 – 2019). I received doctorates from the École normale supérieure de Lyon and the University of Waterloo in 2017. As of September 1, 2025 I am the associate chair for undergraduate studies in C&O. For advising during the F25 term, you can email questions to coundergrad.officer@uwaterloo.ca (do not send advising questions to my personal email) or book a virtual appointment on Thursday or Friday afternoon through this link. Virtual meetings use Microsoft Teams – please make sure Teams is installed and updated to the latest version before the start of our call. I’ve written a set of lecture notes and two textbooks, An Invitation to Enumeration (online lecture notes). An elementary introduction to enumerative combinatorics for math undergrads working up to the basics of analytic combinatorics. An Invitation to Analytic Combinatorics: From One to Several Variables (Springer). A gentle introduction to analytic combinatorics and analytic combinatorics in several variables (ACSV), focused on explicit computational methods. Analytic Combinatorics in Several Variables, 2nd Edition (Cambridge, with R. Pemantle and M. C. Wilson). The most complete and expansive treatment of ACSV, making use of topological methods to present a comprehensive framework for studying multivariate generating functions. These references give a pathway from first year university mathematics to the frontiers of research in analytic combinatorics. You should also try our sage_acsv package that will rigorously do (much of it) for you – feedback always welcome! News / Events Joined CanaDAM Executive Committee, May 2025 Next event in Kelowna, BC (2027) FPSAC 2025 (Plenary Speaker), July 2025 At Hokkaido University, Japan AofA 2025 (Organizing Committee Co-Chair), May 2025 At the Fields Institute, Toronto Joined AofA Steering Committee, June 2024 Next events in Toronto (2025) and Munich (2026) Jeremy Chizewer wins 2024 Governor General Gold Medal Congratulations Jeremy! Analytic Combinatorics in Several Variables, 2nd Edition Now Available An Invitation to Analytic Combinatorics hits 13k chapter downloads Map to Office My office is MC 6028 (click for a larger version). Coauthors Yuliy Baryshnikov, Alin Bostan, Mireille Bousquet-Mélou, Sophie Burrill, Jeremy Chizewer, Julien Courtiel, Ruiwen Dong, Éric Fusy, Torin Greenwood, Benjamin Hackl, Kevin Hyun, Veronika Irvine, Manuel Kauers, Jessica Khera, Alexander Kroitor, Kisun Lee, Andreas Lenz, Erik Lundberg, Andrew Luo, Marc Mezzarobba, Marcus Michelen, Marni Mishna, Somabha Mukherjee, J. Ian Munro, Greta Panova, Robin Pemantle, Ava Pun, Kilian Raschel, Cyrus Rashtchian, Frank Ruskey, Tiadora Ruza, Bruno Salvy, Éric Schost, Jesse Selover, Paul H. Siegel, Josip Smolčić, Catherine St-Pierre, Armin Straub, Mark Wilson, Elaine Wong Cite × Copy Download",
  "content_length": 3552,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:01"
}