{
  "name": "Stephan Meisel",
  "homepage": "https://www.wi.uni-muenster.de/de/institut/qm-logistik",
  "status": "success",
  "content": "Forschungsgruppe Quantitative Methoden in der Logistik | Institut für Wirtschaftsinformatik Forschungsgruppe Quantitative Methoden in der Logistik Zur Digitalisierung betrieblicher Prozesse und Abläufe werden in immer größerem Maße moderne, intelligente Informationssysteme eingesetzt, die das Treffen operativer Entscheidungen unterstützen. Solche Decision Support Systeme müssen schnell und weitestgehend automatisiert optimale Entscheidungen berechnen und dem Entscheider vorschlagen. Die Entwicklung solcher Systeme stellt vor allem für die heutigen von Dynamik, Volatilität und Unsicherheit geprägten Prozesse eine wesentliche Herausforderung dar. Die Aktivitäten der von Stephan Meisel geleiteten Arbeitsgruppe Quantitative Methoden in der Logistik zielen auf Lösungen für diese Herausforderung. Die Arbeitsgruppe forscht vor allem an der Nutzung, Entwicklung und Integration von quantitativen Methoden zur Steigerung der Leistungsfähigkeit von Decision Support Systemen. Neben der Erforschung von Systemen für klassische Logistikprozesse, liegt ein besonderer Fokus der Arbeitsgruppe auf der Unterstützung von Entscheidungen in energiewirtschaftlichen Prozessen. Die aktuellen Forschungsschwerpunkte der Arbeitsgruppe sind: Bewirtschaftung von Energiespeichern: Die Nutzung erneuerbarer Energien nimmt weltweit rapide zu. Da erneuerbare Energiequellen, wie etwa Wind oder solare Strahlung, jedoch meist kaum steuerbar sind, werden verstärkt Energiespeicher eingesetzt. Um die mit einem Speicher ermöglichte Flexibilität bestmöglich ausnutzen zu können, sind intelligente Decision Support Systeme erforderlich, die im Zeitverlauf kontinuierlich Entscheidungen über das Be- und Entladen des Speichers vorschlagen und dabei Energiepreisvolatilitäten, Nachfrage- und Erzeugungsschwankungen sowie die folgenden Entscheidungen antizipieren. Effiziente Elektromobilität: Elektrofahrzeuge sollen Fahrzeuge mit konventionellem Antrieb mittel- bis langfristig fast vollständig ersetzen. Ein entscheidender Faktor für das Gelingen dieses Übergangs ist jedoch die Rentabilität von E-Fahrzeugen. Um das ökonomische Potential von E-Fahrzeugen in ihren Nutzungskontexten voll ausschöpfen zu können, werden Decision Support Systeme benötigt, die Fahrzeugnutzern und Aggregatoren Entscheidungen (z.B. über Ladevorgänge und Fahrzeugbewegungen) vorschlagen und dabei den Zustand des Smart Grids, Strompreisvolatilitäten sowie die folgenden Entscheidungen antizipieren. Dynamische Tourenplanung: Online-Bestellungen, die Globalisierung von Supply Chains und die erhöhte Nachfrage nach Vor-Ort-Service machen den kosteneffizienten Einsatz von Liefer- und Servicefahrzeugen zu einem erfolgskritischen Faktor. Durch ständig neu eintreffende Bestellungen und Verkehrsinformationen müssen die Tourenpläne der Fahrzeuge im Tagesverlauf oft mehrfach angepasst werden. Um kostenoptimale Anpassungsentscheidungen zu ermöglichen, werden Decision Support Systeme benötigt, die sowohl die künftige Informationslage als auch die folgenden Entscheidungen antizipieren.",
  "content_length": 3041,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:36"
}