{
  "name": "Stephen Viller",
  "homepage": "http://researchers.uq.edu.au/researcher/1060",
  "status": "success",
  "content": "Associate Professor Stephen Viller | UQ Experts Skip to menu Skip to content Skip to footer Associate Professor Stephen Viller Email: viller@eecs.uq.edu.au Phone: +61 7 336 51190 Positions Affiliate of UQ Cyber Research Centre UQ Cyber Research Centre Faculty of Engineering, Architecture and Information Technology Affiliate of Research Centre in Creative Arts and Human Flourishing Research Centre in Creative Arts and Human Flourishing Faculty of Humanities, Arts and Social Sciences Associate Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Human-centred design of interactive systems Stephen Viller is a researcher and educator in human-centred design methods, particularly applied to designing social, domestic and mobile computing technologies, and understanding how people's interactions in everyday settings inform the design of such technologies. He has over 30 years of experience in Computer Supported Cooperative Work (CSCW), Interaction Design, and Human-Computer Interaction (HCI) research, where he has focused on bridging disciplines and diverse methodological perspectives. He has concentrated on qualitative methods, particularly observational fieldwork, contextual interviews, diary studies and field trips, but also increasingly on more ‘designerly’ approaches such as cultural probes, low-fidelity prototypes, speculative design. Stephen is an Associate Professor in the School of Electrical Engineering & Computer Science (EECS), where he leads the Human-Centred Computing discipline. He is also UQ's Theme Leader for the Digital Worlds and Disruptive Technologies theme in the QUEX Institute, and national chair of CHISIG, the Computer-Human Interaction Special Interest Group of the Human Factors and Ergonomics Society of Australia (HFESA). From 2016-2019 he was the EECS (ITEE at the time) Director of Coursework Studies (Chair of T&L committee) and from 2011-2016 he was Program Director of the Bachelor of Multimedia Design and Master of Interaction Design. His publications span various interdisciplinary journals and conferences in HCI/CSCW and technology design. He has a BSc (Hons) Computation (UMIST), MSc Cognitive Science (Manchester) and PhD Computing (Lancaster). Read more Read less Availability Associate Professor Stephen Viller is: Available for supervision Media expert Fields of research Affective computing Built Environment and Design Collaborative and social computing Communication and media studies Design Distributed computing and systems software Education Educational technology and computing Fairness, accountability, transparency, trust and ethics of computer systems Graphics, augmented reality and games Human-centred computing Human-computer interaction Information and Computing Sciences Information visualisation Language, Communication and Culture Library and information studies Mobile computing Organisational, interpersonal and intercultural communication Pervasive computing Requirements engineering Social and community informatics Social robotics Software engineering Specialist studies in education Virtual and mixed reality Qualifications Bachelor (Honours) of Computer Science, University of Manchester Institute of Science and Technology Masters (Coursework) of Cognitive Science, The University of Manchester Doctor of Philosophy of Computer-Human Interaction, The University of Lancaster Research interests Computer Supported Cooperative Work (CSCW) I am interested in all aspects of the understanding of social interaction, methods of studying people in social settings, and informing the design of social technologies. Read more Read less Interaction Design I am interested in people-centred methods for informing the design of interactive technologies. In particular, I explore how methods from other disciplines can be adopted and adapted to improve the software design process. Read more Read less Emerging technologies Technology is only really interesting to me in terms of what it allows people to achieve. I am interested in various technologies in order to prototype and explore novel applications to solve problems in specific contexts. Current technologies I am working with include Internet of Things (IoT), Mixed and Augmented Reality (AR), Physical Computing, and mobile social software. Read more Read less Application contexts Interaction design research takes place in everyday settings where we can understand current practice/activities and prototype and evaluate solutions. My research has involved a wide range of contexts, including dependable and safety-critical systems, office work, tourism, health, behaviour change, and education. In all these domains, my approach is to inform the design of technologies that not only meet the functional and usability needs/requirements of the people in the context, but that are also technologies that people would actually want to use. Read more Read less Works Search Professor Stephen Viller’s works on UQ eSpace All (110) Journal Article (23) Other Outputs (6) Edited Outputs (4) Conference Publication (70) Book Chapter (7) Featured 2016 Conference Publication Trust me: doubts and concerns living with the internet of things Worthy, Peter, Matthews, Ben and Viller, Stephen A. (2016). Trust me: doubts and concerns living with the internet of things. DIS 2016 - Proceedings of the 2016 ACM Conference on Designing Interactive Systems: Fuse, Brisbane, Australia, 4-8 June 2016. New York, NY, United States: Association for Computing Machinery. doi: 10.1145/2901790.2901890 Trust me: doubts and concerns living with the internet of things Featured 2015 Journal Article SonicAIR: supporting independent living with reciprocal ambient audio awareness Baharin, Hanif, Viller, Stephen and Rintel, Sean (2015). SonicAIR: supporting independent living with reciprocal ambient audio awareness. ACM Transactions on Computer-Human Interaction, 22 (4) 18, 18:1-18:23. doi: 10.1145/2754165 SonicAIR: supporting independent living with reciprocal ambient audio awareness Featured 2013 Conference Publication Augmenting play and learning in the primary classroom Boden, Marie, Dekker, Andrew, Viller, Stephen and Matthews, Ben (2013). Augmenting play and learning in the primary classroom. IDC 2013, New York, NY, United States, 24-27 June 2013. Danvers, MA, United States: ACM Press. doi: 10.1145/2485760.2485767 Augmenting play and learning in the primary classroom Featured 2013 Conference Publication Rhythms of the domestic soundscape: Ethnomethodological soundwalks for phatic technology design Baharin, Hanif, Rintel, Sean and Viller, Stephen (2013). Rhythms of the domestic soundscape: Ethnomethodological soundwalks for phatic technology design. 14th IFIP TC 13 International Conference on Human-Computer Interaction, INTERACT 2013, Cape Town, South Africa, 2 - 6 September 2013. Heidelberg, Germany: Springer. doi: 10.1007/978-3-642-40498-6_36 Rhythms of the domestic soundscape: Ethnomethodological soundwalks for phatic technology design Featured 2011 Conference Publication Building sensitising terms to understand free-play in open-ended interactive art environments Morrison, Ann, Viller, Stephen and Mitchell, Peta (2011). Building sensitising terms to understand free-play in open-ended interactive art environments. CHI 2011: The 29th CHI Conference on Human Factors in Computing Systems, Vancouver, BC, Canada, 7-12 May 2011. New York, NY, U.S.A.: Association for Computing Machinery (ACM). doi: 10.1145/1978942.1979285 Building sensitising terms to understand free-play in open-ended interactive art environments 2025 Edited Outputs OzCHI '24: Proceedings of the 36th Australasian Conference on Human-Computer Interaction Stephen Viller, Jenni Paay, Joel Fredericks, Jane Turner, Nicole Vickery, Greg Wadley, Diego Muñoz, Tara Capel, Arzoo Atiq, Hilary Davis, Marie Bodén, Joel Hardman and Bernd Ploderer eds. (2025). OzCHI '24: Proceedings of the 36th Australasian Conference on Human-Computer Interaction. OzCHI 2024, Brisbane, QLD Australia, 30 November - 3 December 2024. New York, NY United States: Association for Computing Machinery. OzCHI '24: Proceedings of the 36th Australasian Conference on Human-Computer Interaction 2025 Journal Article Welcome from the Conference Co-Chairs Viller, Stephen, Paay, Jeni and Fredericks, Joel (2025). Welcome from the Conference Co-Chairs. Proceedings of the 36th Australasian Conference on Human-Computer Interaction, OzCHI 2024. Welcome from the Conference Co-Chairs 2025 Conference Publication Serious games: charting refugee entrepreneurial journeys through novel analytic mapping Lee, Chuike, Khan, Awais Hameed, Viller, Stephen and Vyas, Dhaval (2025). Serious games: charting refugee entrepreneurial journeys through novel analytic mapping. DIS '25: ACM Designing Interactive Systems Conference, Funchal, Portugal, 5-9 July 2025. New York, NY, United States: ACM. doi: 10.1145/3715336.3735443 Serious games: charting refugee entrepreneurial journeys through novel analytic mapping 2025 Journal Article Embedded and situated visualisation in mixed reality to support interval running Li, A., Perin, C., Knibbe, J., Demartini, G., Viller, S. and Cordeil, M. (2025). Embedded and situated visualisation in mixed reality to support interval running. Computer Graphics Forum, 44 (3) e70133, 1-12. doi: 10.1111/cgf.70133 Embedded and situated visualisation in mixed reality to support interval running 2025 Other Outputs Conversational agent mediator design bundle Hou, Mengyan, Viller, Stephen, Dobbins, Chelsea, Porter-Steele, Janine, Balaam, Sarah and McCarthy, Sandie (2025). Conversational agent mediator design bundle. Brisbane, QLD, Australia: The University of Queensland. Conversational agent mediator design bundle 2024 Conference Publication Using annotated portfolios to interrogate speculative designs: the case of emergent personal data trails Snow, Stephen, Khan, Awais Hameed, Matthews, Ben,",
  "content_length": 21650,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:11"
}