{
  "name": "Stephen Cooper",
  "homepage": "http://cse.unl.edu/~scooper",
  "status": "success",
  "content": "Stephen Cooper Stephen Cooper Faculty Director, Jeffrey S. Raikes School of Computer Science and Management Chancellor's Professor Professor, School of Computing Professor (by courtesy), Teaching, Learning & Teacher Education Ph.D., Computer Science, Syracuse University M.S., Computer Science, Syracuse University B.A., Mathematics and Chemistry, Cornell University Brief bio Steve comes to Nebraska from the Computer Science Department at Stanford University (where he also held a courtesy appointment in the School of Education). His research areas lie in computer science education, with particular interests in program visualization and in trying to understand how students learn to program. He is most well-known for his work with Alice and developing Alice-related curricular materials. Along with Wanda Dann and the late Randy Pausch, he has written many technical papers on Alice, as well as two texts, Learning to Program with Alice (2012, Prentice-Hall) and Exploring Wonderland (2010, Prentice-Hall). The latter text, which includes Barbara Ericson as a co-author, integrates Alice and Media Computation into a single CS1 course. From 2007-2009, Steve worked in NSF's Division of Undergraduate Education, within its Education and Human Resources Directorate. There, he worked as a program manager, and worked on the CCLI, ATE, NSDL, SFS, and S-STEM programs. It is probably best to check Google Scholar or the ACM Digital Library for the most recent list of his publications. Please send an e-mail if a paper is not available. The Teaching, Learning & Teacher Education (TLTE) department's Innovative Learning Technologies group maintains a site for students interested in pursuing Masters and Doctoral degrees. PhD students Current: Alex Enersen Rachel Michaela Mettenbrink Fahim Shahriar Former: Colton Harper Bhuvana Gopal Ryan Bockmon Shuchi Grover Fall term, 2025 - 2026 Contact: Phone: 402-472-6000 Office: Kauffman 130 University of Nebraska-Lincoln Lincoln, NE 68588-0690 email: scooper22 \"at\" unl \"dot\" edu Courses: See Canvas (UNL login required) for details. Office Hours: By appointment. Please e-mail to set up a time to meet. Research projects Alice-related work Spatial skills and student performance in introductory computing Secure Coding Foundations for Advancing Computational Thinking (FACT). Please contact Shuchi Grover for further information about middle school CS curricula. Technical reports Thesis work School of Computing, University of Nebraska - Lincoln",
  "content_length": 2495,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:49"
}