{
  "name": "Stephan Mandt",
  "homepage": "http://www.stephanmandt.com",
  "status": "success",
  "content": "Stephan Mandt - Homepage Biography Stephan Mandt is an Associate Professor of Computer Science and Statistics at the University of California, Irvine, where he leads research at the intersection of deep generative modeling, uncertainty quantification, neural data compression, and AI for science. His work advances the foundations and applications of generative AI, with a particular focus on resource-efficient learning and inference algorithms, as well as AI-driven scientific discovery. Before joining UCI, Stephan directed the machine learning group at Disney Research in Pittsburgh and Los Angeles. He previously held postdoctoral positions at Princeton and Columbia University. He earned his Ph.D. in Theoretical Physics from the University of Cologne as a recipient of the German National Merit Scholarship. Stephan's research is supported by NSF, DARPA, IARPA, DOE, Disney, Intel, and Qualcomm. He has been recognized as a Chan Zuckerberg Investigator and AI Resident, and he has received the NSF CAREER Award, the UCI ICS Mid-Career Excellence in Research Award, and the German Research Foundation's Mercator Fellowship. He is also a Kavli Fellow of the U.S. National Academy of Sciences, a member of the ELLIS Society, and a former visiting researcher at Google Brain. An active contributor to the machine learning community, Stephan serves as an Action Editor for the Journal of Machine Learning Research and Transactions on Machine Learning Research. He has organized tutorials at NeurIPS, AAAI, and UAI and regularly serves as Senior Area Chair for NeurIPS, ICML, and ICLR. He recently served as Program Chair for AISTATS 2024 and as General Chair for AISTATS 2025. Short Bio Stephan Mandt is an Associate Professor of Computer Science and Statistics at the University of California, Irvine. His research contributes to the foundations and applications of generative AI, with a focus on generative modeling of 2D, 3D, and sequential data, compression, resource-efficient learning, inference algorithms, and AI-driven scientific discovery. He is a Chan Zuckerberg Investigator and AI Resident and has received the NSF CAREER Award, the UCI ICS Mid-Career Excellence in Research Award, and a Kavli Fellowship. Before UCI, he led the machine learning group at Disney Research and held postdoctoral positions at Princeton and Columbia. Stephan frequently serves as a Senior Area Chair for NeurIPS, ICML, and ICLR and was most recently Program Chair for AISTATS 2024 and General Chair for AISTATS 2025. Research Interests My research focuses on foundational and applied problems in generative AI. Generative models, especially diffusion models, have transformed how we synthesize and reconstruct complex data such as images, video, text, audio, and various scientific modalities. In my group, we study the mathematical and algorithmic foundations of these models while also exploring how they can solve pressing problems in science and engineering. A central theme in our work is that generation, compression, and inference are closely connected. If a model can generate data realistically, it can also be used to represent that data efficiently and to reason about hidden variables or uncertainties. This perspective drives four main directions in our research. Foundation models and test-time control. We derive new algorithms for generative modeling, often by connecting diffusion models with ideas from stochastic optimal control. This perspective has led to foundational methods that dramatically improve the test-time performance of diffusion models for tasks such as deblurring, super-resolution, and stylization. We also pioneered video diffusion models, developed concurrently with Google's first paper in this area, helping to establish video generation as a central direction in the field. More broadly, we aim to design generative algorithms that are both mathematically principled and broadly applicable across domains. Uncertainty and inference. Teaching AI models to know what they don't know is a high-stakes goal of machine learning. Bayesian statistics offers one path toward this goal by replacing fixed model parameters with a posterior distribution, thereby quantifying uncertainty. Our work develops new approaches to variational inference in generative models, with a particular focus on diffusion processes. A key direction is extending these methods to conditional generative modeling tasks that demand reliable uncertainty estimates, for example, rain forecasting or the super-resolution of geospatial data. More broadly, this line of research contributes to the theory of inference in deep learning while delivering practical tools for scientific applications. Compression. Modern science generates massive datasets, from climate simulations to astronomical images. We design neural compression methods--including diffusion-based codecs and lossless models--that dramatically reduce storage and transmission costs while preserving semantic or scientific content. Recently, we introduced benchmarks for astrophysical data compression that demonstrate the practical potential of these approaches. AI for Science. We actively collaborate with domain experts to apply generative AI to open problems in Earth system science, chemistry, biology, and physics. For example, we build models that detect rare events in climate simulations, help interpret single-cell transcriptomics data, and provide new tools for modeling physical systems. These applications both inspire new foundational questions and show how generative AI can become a core part of the scientific process. PhD student applicants: Unfortunately, I will not be able to respond to most inquiries regarding PhD openings or comment on your applications to my group. If you indicate your interests to work with me in the application questions, I will make sure to review them carefully. Online Application page. UCI undergraduate students, read this first: Thank you for your interest in working on research projects with us. Due to the high demand for generative AI opportunities we can only accommodate a limited number of students each year. When reaching out, kindly include your resume and UCI transcript and describe what kind of research interests you the most. You should have already excelled in CS 178 with a top grade (A or A+) and ideally have taken additional courses in AI/ML. Your understanding of these constraints is greatly appreciated. News Serving as General Chair for AISTATS 2025 and Program Chair for AISTATS 2024 (with Yingzhen Li). Appointed Guest Professor at ETH Zurich (2025). Named a Chan Zuckerberg AI Resident (2024), supporting a group of several PhD students and postdocs at UCI. Awarded the Outstanding Paper Award at NeurIPS 2023. Awarded the Mercator Fellowship of the German Research Foundation (DFG). Received the Dean's Mid-Career Award for Excellence in Research. Honored with the NSF CAREER Award for Variational Inference for Resource-Efficient Learning. Visiting Professor, Google Brain (2019). Tutorials Neural Compression Tutorial at NeurIPS 2022",
  "content_length": 7082,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:36"
}