{
  "name": "Stephen J. Wright 0001",
  "homepage": "http://pages.cs.wisc.edu/~swright",
  "status": "success",
  "content": "Stephen J Wright, University of Wisconsin Stephen J. Wright Computer Sciences Department University of Wisconsin 1210 West Dayton Street Madison, WI 53706 [directions] Optimization Online Mackay, December 2008 Research Interests Numerical optimization, especially problems involving continuous variables. I'm interested in the theory, algorithms, and implementations, and in applications of all types. Positions Chair, Department of Computer Sciences at UW-Madison. George B. Dantzig Prize from the Mathematical Optimization Society and SIAM, 2024. National Academy of Engineering, 2024. Khachiyan Prize from INFORMS Optimization Society, 2020. Hilldale Professor, UW-Madison. George B. Dantzig Professor of Computer Sciences. Sheldon B. Lubar Chair of Computer Sciences. Amar and Balinder Sohi Professor of Computer Sciences. Discovery Fellow in the Wisconsin Institute for Discovery at UW-Madison. Past Chair of the Mathematical Optimization Society . SIAM Fellow and former member of the Board of Trustees of SIAM (2005-2014). Site Director of the Institute for Foundations of Data Science. Current Research Being Department Chair. Design and analysis of algorithms for continuous optimization. Optimization in machine learning and other areas. Some Past Research Projects Optimization software: PCx (linear programming), OOQP (convex quadratic programming). Compressed sensing software: GPSR, SpaRSA. Also GPU codes for signal and image processing, and TV denoising software, and the LPS code for regularized logistic regression. Teaching Current: Not these days, baby! Previously Taught: CS726: Nonlinear Optimization I (UW, Fall 2019) CS525: Linear Programming (UW, Fall 2015) CS730: Nonlinear Optimization II (Spring 2020) CS524: Introduction to Optimization (Fall 2018) Publications Google Scholar page Optimization for Data Analysis, with Ben Recht, published by Cambridge University Press in 2022. Here's a list of typos. Primal-Dual Interior-Point Methods, published by SIAM in 1997 (see a somewhat dated list of corrections). Numerical Optimization, Second edition, with Jorge Nocedal, was published in August 2006. Here is a list of typos. You can buy it here, for example. Linear Programming with MATLAB, with Michael Ferris and Olvi Mangasarian, published by SIAM in 2007. See also this page of Matlab programs discussed in the book. Talks and Links Some talks on YouTube OLD talks on Videolectures. MW and the earlier metaNEOS project: Grid Computing and Optimization NEOS Server, and NEOS Guide / Wiki, now hosted at the Wisconsin Institutes for Discovery after many successful years at Argonne National Lab. Optimization Online, the latest and greatest eprints on optimization (be sure to post your finest work!) Interior-Point Methods Online, an older archive of interior-point papers and stuff Mathematical Optimization Society and SIAM Activity Group on Optimization GPSR: Gradient Projection for Sparse Reconstruction and SpaRSA: Sparse Reconstruction by Separable Approximation. We also have a GPU implementation of SpaRSA. TV Denoising Software Sampling methods for Stochastic Programming",
  "content_length": 3112,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:57"
}