{
  "name": "Stephen E. Reichenbach",
  "homepage": "http://cse.unl.edu/~reich",
  "status": "success",
  "content": "Stephen E. Reichenbach Stephen E. Reichenbach Professor Emeritus Computer Science & Engineering Dept. University of Nebraska–Lincoln Lincoln NE 68588-0115 voice: 1.402.472.2401 fax: 1.402.472.7767 email: reich@unl.edu Director GC Image, LLC PO Box 57403 Lincoln NE 68505-7403 voice: 1.402.310.4503 email: reich@gcimage.com Education Ph.D., Computer Science, William and Mary, Williamsburg VA (1989) M.S., Computer Science, Washington University, St. Louis MO (1985) B.A., English, University of Nebraska, Lincoln NE (1976) Distinctions Department Recognition Award, UNL CSE Department, 2018. Startup Company of the Year Award (GC Image), NUtech Ventures, 2017. [video] Founding Director and President, GC Image, LLC, 2002–2016. Innovation, Development and Engagement Award (IDEA), University of Nebraska, 2015. [video] Member, Nebraska Innovation Campus Faculty Advisory Committee, UNL, 2010–2012. Member, Board of Directors, Zoex Corporation, 2004–2012. Member, Technology Strategic Planning Committee, Lincoln Public Schools, 2012. Member, Strategic Planning Committee, Lincoln Public Schools, 2011. Co-Chair, Visual Information Processing XI – XX, Proceedings of the SPIE, 2002–2011. Visiting Professor, Manchester Interdisciplinary Biocentre, University of Manchester, 2007. Senator, Academic Senate, UNL, 2004–2007. Technology Professor of the Year, AIM Institute, 2005. Founding Director and President, Internet Nebraska Corporation, 1994–2005. Program Committee, SPIE Investigative Image Processing III, 2003. J.D. Edwards Professorship, UNL, 2002. Promoted to Professor of Computer Science and Engineering, UNL, 2001. Department Chair, Computer Science and Engineering Department, UNL, 1996–2000. Associate Editor, IEEE Transactions on Image Processing, 1996–98. Technical Program Committee, International Conference on Image Processing, 1997. CDROM Chair, Steering Committee, Technical Program Committee, International Geoscience and Remote Sensing Symposium, 1993–1996. Promoted to Associate Professor of Computer Science and Engineering, UNL, 1996. ASEE Summer Faculty Fellowship, NASA Goddard Space Flight Center, 1995. Outstanding Researcher (Ass't Prof.), College of Engineering and Technology, UNL, 1994. George Holmes Research Fellowship, 1991. National Research Council Associateship, NASA Langley Research Center, 1989–90. Appointed Assistant Professor of Computer Science and Engineering, UNL, 1989. Current Research Interests Informatics and chemometrics for multi-dimensional chemical separations and three-dimensional mass-spectrometric imaging. Image restoration, resampling, and data fusion for infrared images and remotely sensed, multispectral data. Digital image processing algorithms and architectures that integrate restoration, compression, coding, and enhancement for optimal end-to-end performance subject to explicit implementation constraints. Scene modeling and artificial scene generation. Imaging system design, analysis, and simulation. Research methodology for digital image processing and computer vision. Visual information processing in multimedia systems, especially for web-based decision support. Journal and Book Publications S. Reichenbach. \"GCxGC Data Visualization, Processing, and Analysis.\" In Characterization of Odorant Patterns by Comprehensive Two-Dimensional Gas Chromatography, Ed. C. Cordero, Chap. 7, pp. 185-229, Elsevier, 2022. DOI:10.1016/bs.coac.2021.10.006 E. Gabetti, B. Sgorbini, F. Stilo, C. Bicchi, P. Rubiolo, F. Chialva, S. Reichenbach, V. Bongiovanni, and A. Cavallero. \"Chemical fingerprinting strategies based on comprehensive two-dimensional gas chromatography combined with gas chromatography-olfactometry to capture the unique signature of Piemonte peppermint essential oil (Mentha x piperita var Italo-Mitcham).\" Journal of Chromatography A, 1645:462101, 2021. DOI:10.1016/j.chroma.2021.462101 M. Rosso, F. Stilo, C. Bicchi, M. Charron, G. Rosso, R. Menta, S. Reichenbach, C. Weinert, C. Mack, S. Kulling, and C. Cordero. \"Combined untargeted and targeted fingerprinting by comprehensive two-dimensional gas chromatography to track compositional changes on hazelnut primary metabolome during roasting.\" Applied Sciences, 11:525, 2021. DOI:10.3390/app11020525 F. Stilo, M. Segura-Borrego, C. Bicchi, S. Battaglino, R. Callejon-Fernadez, M. Morales, S. Reichenbach, J. McCurry, D. Peroni, and C. Cordero. \"Delineating the extra-virgin olive oil aroma blueprint by multiple headspace solid phase microextraction and differential-flow modulated comprehensive two-dimensional gas chromatography.\" Journal of Chromatography A, 1650:462232. DOI:10.1016/j.chroma.2021.462232 F. Stilo, C. Bicchi, A. Robbatt, S. Reichenbach, and C. Cordero. \"Untargeted approaches in food-omics: the potential of comprehensive two-dimensional gas chromatography/mass spectrometry.\" Trends in Analytical Chemistry, 135:116162, 2021. DOI:10.1016/j.trac.2020.116162 F. Stilo, C. Bicchi, A. Jimenez-Carvelo, L. Cuadros-Rodriguez, S. Reichenbach, and C. Cordero. \"Chromatographic fingerprinting by comprehensive two-dimensional chromatography: Fundamentals and tools.\" Trends in Analytical Chemistry, 134:116113, 2021. DOI:10.1016/j.trac.2020.116133 F. Stilo, E. Liberto, N. Spigolon, G. Genova, G. Rosso, M. Fontana, S. Reichenbach, C. Bicchi, and C. Cordero. \"An Effective chromatographic fingerprinting workflow based on comprehensive two-dimensional gas chromatography - mass spectrometry to establish volatiles patterns discriminative of spoiled hazelnuts (Corylus avellana L.).\" Food Chemistry, 340:128135, 2021. DOI:10.1016/j.foodchem.2020.128135 F. Stilo, C. Bicchi, S. Reichenbach, C. Cordero. \"Comprehensive two-dimensional gas chromatography as a boosting technology in food-omic investigations.\" Journal of Separation Science, 44:1592-1611, 2021. DOI:10.1002/jssc.202100017 B. Weggler, L. Duboisa, N. Gawlitta, T. Gröger, J. Moncur, L. Mondello, S. Reichenbach, P. Tranchida, Z. Zhao, R. Zimmermann, M. Zoccali, and J. Focant. \"A unique data analysis framework and open source benchmark data set for the analysis of comprehensive two-dimensional gas chromatography software.\" Journal of Chromatography A, 1635:461721, 2020. DOI:10.1016/j.chroma.2020.461721 M. Rosso, F. Stilo, S. Squara, E. Liberto, S. Mai, C. Mele, P. Marzullo, G. Aimaretti, S. Reichenbach, M. Collino, C. Bicchi, C. Cordero. \"Exploring Extra-Dimensions to Capture Saliva Metabolite Fingerprints from Metabolically Healthy and Unhealthy Obese Patients by Comprehensive Two-Dimensional Gas Chromatography Featuring Tandem Ionization Mass Spectrometry.\" Analytical and Bioanalytical Chemistry, 2020. DOI:10.1007/s00216-020-03008-6 C. Cordero, F. Stilo, E. Gabetti, C. Bicchi, A. Carretta, D. Peroni, S. Reichenbach, and J. McCurry. \"A step forward in the equivalence between thermal and differential-flow modulated comprehensive two-dimensional gas chromatography methods.\" Journal of Chromatography A, 1627:461396, 2020. DOI:10.1016/j.chroma.2020.461396 F. Stilo, C. Cordero, C. Bicchi, D. Peroni, Q. Tao, and S. Reichenbach. \"Chromatographic Fingerprinting by Template Matching for Data Collected by Comprehensive Two-Dimensional Gas Chromatography.\" Journal of Visualized Experiments, 163:e61529, 2020. DOI:10.3791/61529 F. Stilo, E. Liberto, S. Reichenbach, Q. Tao, C. Bicchi, and C. Cordero. \"Exploring the extra-virgin olive oil volatilome by adding extra dimensions to comprehensive two-dimensional gas chromatography and time of flight mass spectrometry featuring tandem ionization.\" Journal of AOAC International, 2020. DOI:doi: 10.1093/jaoacint/qsaa095 M. Rosso, M. Mazzucotelli, C. Bicchi, M. Charron, F. Manini, R. Menta, M. Fontana, S. Reichenbach, C. Cordero. \"Adding extra-dimensions to hazelnuts primary metabolome fingerprinting by comprehensive two-dimensional gas chromatography combined with time-of-flight mass spectrometry featuring tandem ionization: insights on the aroma potential.\" Journal of Chromatography A, 1614:460739, 2020. DOI:10.1016/j.chroma.2019.460739 S. Reichenbach, Q. Tao, C. Cordero, C. Bicchi. \"A Data-Challenge Case Study of Analyte Detection and Identification with Comprehensive Two-Dimensional Gas Chromatography with Mass Spectrometry (GCxGC-MS).\" Separations, 6:38, 2019. DOI:10.3390/separations6030038 C. Cordero, A. Guglielmetti, C. Bicchi, E. Liberto, L. Baroux, P. Merle, Q. Tao, and S. Reichenbach. \"Comprehensive two-dimensional gas chromatography coupled with time of flight mass spectrometry featuring tandem ionization: Challenges and opportunities for accurate fingerprinting studies\". Journal of Chromatography A, 1597:132-141, 2019. DOI:10.1016/j.chroma.2019.03.025 S. Reichenbach, C. Zini, K. Nicolli, J. Welke, C. Cordero, and Q. Tao. \"Benchmarking Machine Learning Methods for Comprehensive Chemical Fingerprinting and Pattern Recognition.\" Journal of Chromatography A, 1595:158-167, 2019. DOI:10.1016/j.chroma.2019.02.027 C. Cordero, J. Kiefl, S. Reichenbach, and C. Bicchi. \"Characterization of Odorant Patterns by Comprehensive Two-Dimensional Gas Chromatography: A Challenge in Omic Studies.\" Trends in Analytical Chemistry, 113:364-378, 2019. F. Stilo, E. Liberto, S. Reichenbach, Q. Tao, C. Bicchi, and C. Cordero. \"Untargeted and targeted (UT) fingerprinting of extra virgin olive oil volatiles by comprehensive two-dimensional gas chromatography with mass spectrometry: Challenges in long-term studies,\" Journal of Agricultural and Food Chemistry, 67:5289-5302, DOI:10.1021/acs.jafc.9b01661, 2019. F. Stilo, E. Liberto, C. Bicchi, S. Reichenbach, C. Cordero. \"GCxGC-TOF-MS and Comprehensive Fingerprinting of Volatiles in Food: Capturing the Signature of Quality.\" LCGC Europe, 32:234-242, 2019. D. Bressanello, E. Liberto, C. Massimo, F. Chiazza, R. Mastrocola, S. E. Reichenbach, C. Bicchi, and C. Cordero. \"Combined Untargeted and Targeted Fingerprinting by Comprehensive Two-Dimensional Gas Chromatography: Revealing Fructose-Induced Changes in Mice Urinary Metabolic Signatures.\" Analytical and Bioa",
  "content_length": 56931,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:50"
}