{
  "name": "Stephen Cameron",
  "homepage": "http://www.cs.ox.ac.uk/stephen.cameron",
  "status": "success",
  "content": "Stephen Cameron (1958-2019) | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyStephen Cameron (1958-2019)Stephen Cameron (1958-2019) Dr Stephen Cameron Reader in Computing ScienceAssociate ProfessorTutorial Fellow, Keble CollegeThemes:Computational Biology and Health InformaticsData, Knowledge and ActionCompleted Projects:Robot Footballmillipedemore…InterestsGeometric reasoning Robot programming and planning Scheduling BiographyThe Department of Computer Science is very sad to announce the death of Professor Stephen Cameron. Stephen was one of the longest-serving members of the Department, joining us in 1988 as a University Lecturer in Computer Science and Tutorial Fellow at Keble College. A book of condolence is available to sign in Keble College Chapel. Alternatively, memories or photos of Stephen can be sent via email to news@cs.ox.ac.uk to be passed on to his family. Stephen Cameron obtained his PhD in Artificial Intelligence at Edinburgh University, working on the geometric modelling of robots and on collision detection. His general area of interest is in spatial reasoning, although this covers a wide range which includes the planning of tasks and motions for robot vehicles and manipulators, the use of geometric models, and the scheduling of fleets of robots. Some of his work is in collaboration with members of the Oxford University Robotics Research Group in the Department of Engineering Science. He is a member of the AISB, the IEEE Robotics and Automation Society, the Geometric Modelling Society, the IAM and CAMRA.Selected PublicationsView AllManage publications Simplifying TugGraph using Zipping Algorithms Stuart Golodetz‚ Anurag Arnab‚ Irina Voiculescu and Stephen Cameron In Pattern Recognition. Vol. 103. Pages 107257. 2020. Details about Simplifying TugGraph using Zipping Algorithms | BibTeX data for Simplifying TugGraph using Zipping Algorithms | DOI (https://doi.org/10.1016/j.patcog.2020.107257) | Link to Simplifying TugGraph using Zipping Algorithms Simpler Editing of Graph−Based Segmentation Hierarchies using Zipping Algorithms Stuart Golodetz‚ Irina Voiculescu and Stephen Cameron In Pattern Recognition. Vol. 70. Pages 44−59. October, 2017. Details about Simpler Editing of Graph−Based Segmentation Hierarchies using Zipping Algorithms | BibTeX data for Simpler Editing of Graph−Based Segmentation Hierarchies using Zipping Algorithms Towards Robot−Assisted Rehabilitation of Upper Limb Dysfunction Irina Voiculescu‚ Stephen Cameron‚ Manfred Zabarauskas and Piotr Kozlowski In Advances in Robot Design and Intelligent Control. Vol. 371 of Advances in Intelligent Systems and Computing. Springer. 2015. Details about Towards Robot−Assisted Rehabilitation of Upper Limb Dysfunction | BibTeX data for Towards Robot−Assisted Rehabilitation of Upper Limb Dysfunction | DOI (10.1007/978-3-319-21290-6_35) ActivitiesSpatial ReasoningCompleted ProjectsRobot FootballmillipedeSensing, Unmanned, Autonomous Aerial VEhiclesMolecular modellingRoboCupPast StudentsHelen FlynnAndrej PancikVictor SpirinPaul WardZhilong YangAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3360,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:49"
}