{
  "name": "Stephen Xia",
  "homepage": "http://www.stephenxia.com",
  "status": "success",
  "content": "Stephen Xia Stephen XiaAssistant Professor, ECE, Northwestern University Follow Email LinkedIn Google Scholar ORCIDI am an assistant professor in the Department of Electrical and Computer Engineering and Computer Science (by courtesy) at Northwestern University, where I direct the Intelligent Mobile and Embedded Computing (IMEC) Lab. We work on a variety of exciting problems in embedded AI, mobile and embedded systems, and smart health.Our goal is to realize truly intelligent, health-aware, and safer environments by embedding intelligent percpetion and reasoning into common objects and devices found all around us and utilizing them in efficient ways to provide useful services and improve quality of life. Our work spans a number of domains, including cyber-physical systems, edge computing, signal processing, machine learning, data science, wearables, robotics, health, etc.Prior to Northwestern, I was a postdoctoral scholar in the Department of Electrical Engineering and Computer Sciences at UC Berkeley (2023). I received the Ph.D. in Electrical Engineering from Columbia University (2022) and the B.S. in Electrical Engineering from Rice University (2016).Selected PublicationsAvA: An Adaptive Audio Filtering Architecture for Enhancing Mobile, Embedded, and Cyber-Physical Systems Stephen Xia and Xiaofan Jiang ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN), 2022CSafe: An Intelligent Audio Wearable Platform for Improving Construction Worker Safety in Urban Environments Stephen Xia, Jingping Nie, and Xiaofan Jiang ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN), 2021Improving Pedestrian Safety in Cities using Intelligent Wearable Systems Stephen Xia, Daniel de Godoy, Bashima Islam, Md Tamzeed Islam, Shahriar Nirjon, Peter R. Kinget, Xiaofan Jiang IEEE Internet of Things Journal, 2019",
  "content_length": 1884,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:10"
}