{
  "name": "Stephanie Wehner",
  "homepage": "https://www.tudelft.nl/staff/s.d.c.wehner",
  "status": "success",
  "content": "Staff Zoeken Sluit zoek Dr. S.D.C. Wehner Dr. S.D.C. Wehner Elektrotechniek, Wiskunde en Informatica Software Technology Quantum Computer Science Pure-profiel Contact S.D.C.Wehner@tudelft.nl +31 15 27 87746 Expertise Quantum entanglement Qubits Quantum Dot Distribution Architecture Quantum Networks Performance Performance Applications Model Publicaties 2025 A Modular Quantum Network Architecture for Integrating Network Scheduling with Local Program Execution Thomas R. Beauchamp / Hana Jirovská / Scarlett Gauthier / Stephanie Wehner 2025 An operating system for executing applications on quantum network nodes C. Delle Donne / M. Iuliano / B. van der Vecht / H. Jirovská / T. J.W. van der Steenhoven / A. Dahlberg / M. Skrzypczyk / A. R.P. Montblanch / J. Fischer / H. B. van Ommen / N. Demetriou / I. te Raa / W. Kozlowski / T. H. Taminiau / P. Pawełczak / R. Hanson / S. Wehner / More Authors 2025 Arqon suite of quantum network control applications Scarlett Gauthier / Thomas R. Beauchamp / Stephanie Wehner 2025 Convexification of the Quantum Network Utility Maximization Problem Sounak Kar / Stephanie Wehner 2025 Entanglement improves coordination in distributed systems Francisco Ferreira Da Silva / Stephanie Wehner Meer publicaties Onderwijs 2025 Introduction to Quantum… Quantum Communication and… Onderwijs 2024 Quantum Communication and… Introduction to Quantum… Media 2025-06-24 Stephanie Wehner awarded the €1 million Körber European Science Prize Verscheen in: TU Delft Lees artikel Stephanie Wehner awarded the €1 million Körber European Science Prize Prijzen 2025-9-19 Körber-Preis 2025 Lees meer Körber-Preis 2025 Nevenwerkzaamheden Directeur/Directielid/Vennoot/Partner/Eigenaar - N/A 2024-07-10 - 2026-07-10 Informatie en communicatie Directeur/Directielid/Vennoot/Partner/Eigenaar - Delft Networks 2025-10-01 - 2026-11-01 Informatie en communicatie Elektrotechniek, Wiskunde en Informatica Software Technology Quantum Computer Science Pure-profiel Contact S.D.C.Wehner@tudelft.nl +31 15 27 87746",
  "content_length": 2021,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:43"
}