{
  "name": "Stephen Chong",
  "homepage": "http://people.seas.harvard.edu/~chong",
  "status": "success",
  "content": "Stephen Chong Stephen Chong Gordon McKay Professor of Computer Science, Harvard SEAS Co-Director of Undergraduate Studies, Computer Science Faculty Dean, Winthrop House Email: Turn on JavaScript to view the email address Pronouns: He/him/his Office: SEC 4.414 Office hours: See below More contact details... Home Publications Software Schedule Contact Research Interests My research helps programmers write trustworthy programs. My primary area of interest is language-based information security: using programming language techniques to provide information security assurance. Recent publications Extending Dynamic Logics with First-Class Relational Reasoning, NFM 2025 (with Jian Xiang). Accountability, Involvement, and Mediation for Information Flow, CSF 2025 (with Elisavet Kozyri and Fred B. Schneider). Measuring Robustness in Cyber-Physical Systems under Sensor Attacks, Nonlinear Analysis: Hybrid Systems 56, 2025 (with Jian Xiang, Ruggero Lanotte, Simone Tini, and Massimo Merro). Making Formulog Fast: An Argument for Unconventional Datalog Evaluation, OOPSLA 2024 (with Aaron Bembenek and Michael Greenberg). Parallel Assembly Synthesis, LOPSTR 2024 (with Jingmei Hu and Margo Seltzer). Guess & Sketch: Language Model Guided Transpilation, ICLR 2024 (with Celine Lee, Abdulrahman Mahmoud, Michal Kurek, Simone Campanoni, David Brooks, Gu-Yeon Wei, and Alexander Rush). Expressive Authorization Policies using Computation Principals, ACM SACMAT 2023 (with Anitha Gollamudi). Quantitative Robustness Analysis of Sensor Attacks on Cyber-Physical Systems, HSCC 2023 (with Ruggero Lanotte, Massimo Merro, Simone Tini, and Jian Xiang). From SMT to ASP: Solver-Based Approaches to Solving Datalog Synthesis-as-Rule-Selection Problems, POPL 2023 (with Aaron Bembenek and Michael Greenberg). More... Co-Director of Undergraduate Studies I am the co-Director of Undergraduate Studies (co-DUS) for Harvard Computer Science, with co-DUS Eddie Kohler, Associate DUS Adam Hesterberg, and Undergraduate Program Administrator Beth Musser. For DUS-related issues, please email Turn on JavaScript to view the email address , which goes to all the Computer Science DUS team. Information about the Harvard SEAS undergraduate program in Computer Science is available at https://csadvising.seas.harvard.edu/. This website answers a lot of common questions, and has links to forms. See below for my office hours. You are also welcome to attend the office hours of anyone in the CS DUS Team. Office Hours My office hours for the next two weeks are listed here. Please note that these office hours are intended for current Harvard community members. If you are not currently a member of the Harvard community and would like to contact me, please email me. dummy Loading... See my schedule for full details. My office hours are typically individual meetings. Some of my office hours are drop-in (no appointment needed), others can be self-scheduled by following the instructions on this page about self-scheduling appointments with me. Currently, the self-scheduled appointments can be either in person (in SEC 4.414) or on Zoom; all drop-in appointments are on Zoom. For Zoom meetings, please use this URL to join: https://harvard.zoom.us/my/stevechong. You may be in a waiting room if I am currently meeting with someone else. If you are unable to attend my office hours, or have an urgent matter, you are welcome to email me to arrange an appointment. For matters related to undergraduate studies in Computer Science, you can attend the office hours of anyone in the CS DUS Team. Teaching In Fall 2025 I am teaching CS1530 (Compilers). Previous courses: CS51: Spring 2022 (co-taught with Brian Yu). CS61: Systems Programming and Computer Organization Fall 2010, Fall 2011. CS152: Programming Languages Spring 2010, Spring 2013, Spring 2014, Spring 2015, Spring 2016, Spring 2018, Spring 2019, Spring 2023. CS1530: Compilers (formerly CS153) Fall 2018, Fall 2019, Fall 2021, Fall 2023, Fall 2025. CS252r: Advanced Topics in Programming Languages Fall 2009, Spring 2011, Spring 2012, Fall 2013, Fall 2014, Fall 2015, Fall 2017, Spring 2019, Spring 2020, Spring 2021. CS2540: Formal Methods for Computer Security (formerly CS254) Spring 2024, Spring 2025. Prospective students Information for (undergraduate and graduate) students that are interested in joining my research group can be found here. Please read this page before contacting me. General information for Harvard undergraduates interested in research in Computer Science is available here. Selected Projects Formulog: Extends Datalog with mechanisms to construct and reason about SMT formulas. Previous projects PRINCESS: Autonomous adaptation of software to changes in its environment. Computing Over Distributed Sensitive Data: Achieve many benefits of data sharing without data owners having to share the data. Privacy Tools for Sharing Research Data: Enhance technologies and policies to protect personal data used in research studies. Shill: a secure shell scripting language. Accrue: Providing language-based security guarantees proportional to programmer effort. CHILI: Enabling the execution of code of unknown origin while guaranteeing that the code is not vulnerable to various classes of security attacks. People Varun Gandhi Kevin Zhang Haoyi Zeng Alumni... Affiliations Programming Languages at Harvard Professional activities SIGPLAN-M Chair 2025-2026 CSF 2026 Program Committee Past activities: PLMW @ PLDI 2021 Co-chair SecDev 2019 Program Committee Co-chair (with Nikhil Swamy). SecDev 2018 PC Co-chair (with Daphne Yao). CSF 2018 Co-chair (with Stéphanie Delaune). CSF 2017 Co-chair (with Boris Köpf). POPL 2017 Artifact Evaluation Committee co-chair (with Jean Yang). Co-chair of the NSF Workshop on Formal Methods for Security (with Joshua Guttman). POPL 2016 Artifact Evaluation Committee co-chair (with Arjun Guha). General chair CSF 2012 and CSF 2013. Co-chair of APLWACA 2010 (with Ben Livshits). Co-chair of PLAS 2009 (with David Naumann). Program committees: SLE 2024, Datalog 2.0 2024, PLDI 2023, CSF 2023, PLMW @ PLDI 2020, PriSC 2020, PLAS 2019, PLDI 2019 (ERC), HILT 2018, IEEE Security & Privacy 2018, POST 2018, APLAS 2017, SecDev 2017, PLMW @ PLDI 2017, POST 2017, ASPLOS 2017 (ERC), PLAS 2016, AAAI Fall Symposium on Privacy and Language Technologies, HILT 2016, SecDev 2016, OOPSLA 2016, SPLASH 2016 Workshops, FCS 2016, ECOOP 2016, EuroS&P 2016, POPL 2016 (ERC), PLAS 2015, POST 2015, POPL 2015 (ERC), OOPSLA 2014, TGC 2014, HILT 2014, PSP 2014, CSF 2014, FMS 2014, PLDI 2014 (ERC), ASPLOS 2014 (ERC), SEC@SAC14, HILT 2013, FOOL 2013, CCS 2013, SEC@SAC13, PLAS 2012, PPCloud 2011, FAST 2011, CCS 2010, CSF 2010, FCS-PrivMod 2010, WebApps ’10, Bytecode 2010, ASIAN 2009, HotSec ’09, FCS09, CSF 2008, PLAS 2007. Funding and Conflicts My research has been supported by IARPA, an Alfred P. Sloan Research Fellowship, DARPA (BRASS,CHESS, and CSL programs), AFOSR, NSF Awards 1054172, 1551249, 1237235, 1421770, 1524052, 1565387), and a Google Faculty Research Award. I also engage in paid and pro bono consulting on software security and programming language technologies. Brief bio (Bio suitable for talk announcements, etc.) I completed a Ph.D. at Cornell University in August 2008, under the guidance of Andrew Myers. Prior to graduate school, I spent several years working as a consultant and contractor. I received a B.Sc.(Hons) and B.A. from Victoria University of Wellington, in Wellington, New Zealand. My wife, Kiran Gajwani, is a Faculty Dean at Winthrop House and a Lecturer/Advisor and Associate Director of Undergraduate Advising in the Economics Department at Harvard. This site last updated Sep 2025.",
  "content_length": 7694,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:50"
}