{
  "name": "Stephen J. Payne",
  "homepage": "http://www.bath.ac.uk/comp-sci/contacts/academics/stephen_payne",
  "status": "success",
  "content": "Stephen Payne - the University of Bath's research portal View Scopus Profile Stephen Payne Prof Professor Emeritus, Department of Computer Science Personal profile Research interestsResearch interests in cognitive science and human-computer interaction. Currently researching how individuals allocate time and effort across multiple tasks; how technology supports and shapes collaborative problem solving and the formation and maintenance of friendships; emotional and motivational constraints on the exploration of novel interactive services. Fingerprint Dive into the research topics where Stephen Payne is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Computer-Mediated Communication Computer Science 100% Interactive Computer Science 100% Mental Arithmetic Psychology 100% Collaborative Arts and Humanities 100% Search Engine Computer Science 75% Decision Making Computer Science 75% Satisficing Arts and Humanities 75% Time Pressure Arts and Humanities 66% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects 5 Finished Projects per year The Language of Collaborative ManufactureJohnson, P. (PI), Jones, S. (CoI), Payne, S. (CoI) & Watts, L. (CoI)Engineering and Physical Sciences Research Council1/06/13 → 31/07/18Project: Research council Engineering Work 100% Engineering 73% Collaborative Engineering 52% Digital Object 47% Management Support 47% The Language of Collaborative ManufactureJohnson, P. (PI), Payne, S. (CoI) & Watts, L. (CoI)Engineering and Physical Sciences Research Council1/02/13 → 30/05/13Project: Research council Coevolution 100% Digital Object 100% Engineering 54% Real Time 33% Engineering Work 33% sKTP with Bath Institute of Medical Engineering LimitedDekoninck, E. (PI), Hicks, B. J. (CoI) & Payne, S. (CoI)Designability4/11/12 → 17/08/13Project: UK charity sKTP with Bath Institute of Medical Engineering LimitedDekoninck, E. (PI), Hicks, B. J. (CoI) & Payne, S. (CoI)Innovate UK, Innovate UK Business Connect3/11/12 → 17/08/13Project: Central government, health and local authorities Inhibited Exploration in Older Customers of Digital ServicesPayne, S. (PI)Arts and Humanities Research Council12/01/09 → 11/03/09Project: Research council Research output 14 Article 9 Paper 6 Chapter in a published conference proceeding 3 Book chapter 2 More 1 Other 1 Poster Research output per year Research output per year Decade effects in mental additionNeth, H. & Payne, S., 20 Oct 2025, In: Philosophical Transactions of the Royal Society B: Biological Sciences. 380, 1937, 20240220.Research output: Contribution to journal › Article › peer-review Open Access Mental Arithmetic 100% Psychological Explanation 100% Dynamic Interplay 100% 2 Citations (SciVal) Effects of trust and perceived self-efficacy on aided judgement: an experiment on spelling and grammar checkingZijlstra, M. & Payne, S., 17 Mar 2025, (E-pub ahead of print) In: Behaviour & Information Technology. 15 p.Research output: Contribution to journal › Article › peer-review Open Access Signal Detection Theory 100% Decision Making 100% Self-Efficacy 100% Text Editing 50% Experimental Paradigm 50% Reasoning about privacy in mobile application install decisions: Risk perception and framingTay, S. W., Teh, P. S. & Payne, S., 1 Jan 2021, In: International Journal of Human-Computer Studies. 145, 102517.Research output: Contribution to journal › Article › peer-review Open AccessFile Data Sharing 100% Privacy Concern 100% Mobile Technology 100% Mobile Application 100% Privacy Practice 100% 14 Citations (SciVal) 154 Downloads (Pure) Emotional Utility and Recall of the Facebook News FeedNontasil, P. & Payne, S., 6 May 2019, (Acceptance date) CHI 2019 - Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. p. 1-9 9 p. (Conference on Human Factors in Computing Systems - Proceedings).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Facebook 100% Memory Bias 33% Emotional Memory 33% 13 Citations (SciVal) The influence of multiple trials and computer-mediated communication on collaborative and individual semantic recallHinds, J. M. & Payne, S. J., 2018, In: Memory. 26, 4, p. 415-423 9 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Computer-Mediated Communication 100% Collaborative 100% Cognitive Psychology 100% Information Retrieval 66% Group Members 33% 9 Citations (SciVal) 190 Downloads (Pure) View all 34 research outputs",
  "content_length": 4882,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:59"
}