{
  "name": "Stephen R. Marschner",
  "homepage": "http://www.cs.cornell.edu/~srm",
  "status": "success",
  "content": "Steve Marschner Steve Marschner Professor Computer Science Department Field of Applied Mathematics Field of Eletrical and Computer Engineering Associate Dean for Research Bowers College of Computing and Information Science publications research teaching contact cv home My research and teaching are in computer graphics and vision, centered around how optics and mechanics determine the appearance of materials. I got my Ph.D. from Cornell in 1998, and held research positions at HP Laboratories, Microsoft Research, and Stanford University before I rejoined Cornell in 2002. I work part-time in the Real-Time Graphics Research group at NVIDIA Research. Recent publications Self-calibrating gaussian splatting for large field of view reconstruction Youming Deng, Wenqi Xian, Guandao Yang, Leonidas Guibas, Gordon Wetzstein, Steve Marschner, Paul Debevec ICCV 2025 Quadric-based silhouette sampling for differentiable rendering Mariia Soroka, Christoph Peters, Steve Marschner SIGGRAPH 2025 Accurate differential operators for hybrid neural fields Aditya Chetan, Guandao Yang, Zichen Wang, Steve Marschner, Bharath Hariharan CVPR 2025 Appearance modeling of iridescent feathers with diverse nanostructures Yunchen Yu, Andrea Weidlich, Bruce Walter, Eugene d'Eon, Steve Marschner SIGGRAPH Asia 2024 A simple approach to differentiable rendering of SDFs Zichen Wang, Xi Deng, Ziyi Zhang, Wenzel Jakob, Steve Marschner SIGGRAPH Asia 2024 Selected publications A wave optics based fiber scattering model Mengqi (Mandy) Xia, Bruce Walter, Eric Michielssen, David Bindel, and Steve Marschner. SIGGRAPH Asia 2020 Manifold Exploration: A Markov Chain Monte Carlo technique for rendering scenes with difficult specular transport Wenzel Jakob and Steve Marschner SIGGRAPH 2012 Simulating Knitted Cloth at the Yarn Level Jonathan M. Kaldor, Doug L. James, and Steve Marschner SIGGRAPH 2008 Light Scattering from Human Hair Fibers Stephen R. Marschner, Henrik Wann Jensen, Mike Cammarano, Steve Worley, and Pat Hanrahan SIGGRAPH 2003 A Practical Model for Subsurface Light Transport Henrik Wann Jensen, Stephen R. Marschner, Marc Levoy, and Pat Hanrahan SIGGRAPH 2001 Awards 2004: NSF CAREER Award 2004: Technical Achievement Award, Academy of Motion Picture Arts and Sciences 2006: Sloan Research Fellowship 2015: SIGGRAPH Computer Graphics Achievement Award Recent Teaching CS5625: Interactive Computer Graphics, Spring 2015, 2016, 2019, 2020 CS4620: Introduction to Computer Graphics, Spring 2017, 2018; Fall 2018, 2019 CS6630: Realistic Image Synthesis, Fall 2015 Funding National Science Foundation Autodesk; Google; Adobe Professional activities Technical Papers Chair for SIGGRAPH Asia 2015 Papers co-chair for EGSR 2008 SIGGRAPH papers committee 2018, 2017, 2014, 2013, 2011, 2010, 2007, 2005, 2003, 2002 CVPR program committee 2010, 2006, 2005, 2003 EGSR program committee 2011, 2009, 2007, 2006 Links scholar | courses | classes | mathworld | gvsem | library | Ph.D.",
  "content_length": 2963,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:06"
}