{
  "name": "Stephen S. Intille",
  "homepage": "http://www.ccs.neu.edu/home/intille",
  "status": "success",
  "content": "Stephen Intille Home Page Stephen S. Intille, Ph.D.he/him Professor Khoury College of Computer Sciences & Dept. of Public Health and Health Sciences, Bouvé College of Health Sciences Khoury College Area Chair for Human-Centered Computing Research Northeastern University 910-177 (9th Fl) (Office 924) 360 Huntington Avenue Boston, Massachusetts 02115 USA Tel: 617-373-3711 The best way to reach me is email: ...@northeastern.edu Research  Short bio  Teaching/Advising  Projects  Publications  CV  Education  Past affiliations  Past courses Advice for students Grants  Mailing lists Other Interested in personal health technologies and health behavior? My research group will likely be recruiting new Ph.D. students to enter in September of 2026 (not 2025). More information can be found on my group's website (Join!). PhD students from personal health informatics, computer science, and population health could all work with the group. We are also interested in recruiting Northeastern students to work on research projects. Contact me if you are interested in learning more. We have a great group of students and are always looking for more. If you are looking for faculty positions, we have open positions for faculty working on HCI and health and related areas. See my research group website for examples of the type of projects we work on. Research interests Computationally detecting and modeling health-related behavior using interactive systems; combining wearable sensing and user interface systems to support preventive medicine and personal, behavioral informatics; novel technologies and algorithms for real-time and longitudinal measurement of behavior; persuasive user interfaces for motivating behavior change; sensor-enabled mobile health technologies; context-aware ecological momentary assessment; experimental ubiquitous and mobile computing; active transportation (via bicycle). I am exploring the development and evaluation of personal, behavioral health informatics – how sensor data acquired throughout everyday life from smartwatches, smartphones, wearable monitors, and in-home sensors might be used to improve wellness via novel human-computer interfaces. This research involves merging ideas from the computer science subfields of human-computer interaction, applied pattern recognition and machine learning, and computational sensing and artificial intelligence with ideas from behavioral science, behavioral medicine, social psychology, and preventive medicine. I am particularly interested in how algorithms that reliably recognize everyday activities and habits can drive the development of interactive preventive health tools that could ultimately be applied at the population scale in a cost-effect manner. Within computer science, this requires developing new user-driven activity detection algorithms that use context and common-sense information, without requiring large training sets; a focus is on person-in-the-loop interactive, explanatory behavior recognition interfaces. Within preventive medicine, this requires building and deploying pilot systems and demonstrating that the technology has a meaningful impact on health outcomes; a focus is on demonstrating that technology can support long-term engagement with behavior change and maintenance. As part of this work, my research group has worked to create new tools that can be used to both measure and motivate behavior change using novel sensor-based technologies. [Short bio] Current teaching/advising In the spring of 2025, I am teaching HINF 5301 (Personal Health Interfaces Evaluation) and HSCI 4740 (Health Sciences Capstone). In the fall of 2025, I will be teaching IS 4300 (Human-computer interaction). I am open to the possibility of advising students interested in directed studies on mobile/wearable computing or sensing projects (including using smartphones, smartwatches, head-mounted computers, a virtual bicycle simulator, or in-home sensors) as well as health projects that explore new ways of measuring or motivating behavior change. Contact me if you are interested and check out the pages on getting involved on my research group's site. See my past courses. Select projects Current projects For a list of current projects, check out my research group's website, which has a bit of information about each project. My current research foci are: Developing novel systems for measuring physical activity (type, duration, and intensity), sedentary behavior, and sleep using mobile phones and wearable sensors in adults, children, older adults, and people with special needs Creating new methods for real-time, longitudinal measurement of health behaviors using microinteractions and microinteraction ecological momentary assessment Prototyping and testing systems that could detect habits in real-time and allow end-users to train and use such systems effectively Real-time health interventions to help people change and maintain health-related behaviors Innovative methods using ecological momentary assessment technology Practical methods for real-time, human-in-the-loop activity recognition on mobile phones and smartwatches, using common sense knowledge and limited training data Using games and the crowd to improve the utility of personal health data collected from mobile devices/sensors Technology to promote active transportation via bicycling Select publications My research group does highly interdisciplinary work and we aim to publish in both computer science conference venues (e.g., IMWUT/Ubicomp and CHI) and health journals (e.g., MSSE, Health Psychology). For a list of my publications, see my CV (most up-to-date, currently) or my group website's publication page (less up-to-date). Education Ph.D. Media Arts and Sciences Massachusetts Institute of Technology, 1999 Area: Computational Perception / Computer Vision Thesis: Visual Recognition of Multi-Agent Action Advisor: Aaron Bobick S.M., Media Arts and Sciences Massachusetts Institute of Technology, 1994 Research: Computer Vision B.S.E., Computer Science and Engineering University of Pennsylvania, 1992 Lab affiliations mHealth Lab September 2010 - present House_n September 1999 - 2012 The MIT Media Laboratory, Vision and Modeling Group 1992-1999 The UPenn GRASP Laboratory 1991-1992 Previous courses Health Science Capstone: Active Transportation via Cycling (HSCI 4740) (Spring 2022, Spring 2023, Spring 2024, Spring 2025) Evaluating Health Technologies (HINF 5301) (Spring 2023, Spring 2024, Spring 2025) Creating the Future: Transforming Healthcare with Mobile Health (mHealth) (HONR 3310) (Fall 2021) Programming with Data Health Practicum (DS 2001) (Fall 2018, Spring 2019, Fall 2019, Fall 2020, Spring 2021) Computer/Human Interaction (IS 4300/CS 5340 joint) (Spring 2020, Spring 2021) and (CS 5340) (Spring 2012) and (IS 4300) (Fall 2023, Fall 2024) Empirical Research Methods (IS 4800/CS 6350) (Spring 2019) Advances in Measuring Behavior (PHTH 5228) (Fall 2011, Spring 2013, Spring 2014, Spring 2015, Spring 2016) Mobile Application Development (CS 4520/5520) (Summer 2011, Fall 2012, Spring 2013, Fall 2013, Spring 2014, Fall 2014, Spring 2015, Spring 2016, Spring 2017) Personal Health Interfaces Design and Development (HINF 5300) (Fall 2013, Fall 2014, Fall 2015, Fall 2016, Fall 2017, Fall 2018, Fall 2019) Personal Health Technologies: Field Deployment and System Evaluation (HINF 5301) (Assisted teaching in Spring 2014) MIT 4.208 Designing Persuasive Environments and Technologies (Fall 2004, Fall 2003, Fall 2002) Building Interactive Environments (with C.S. Pinhanez) (SIGGRAPH 2003 San Diego, SIGGRAPH 2002 San Antonio) MIT 4.208 User Interface Design Studio for Future Computing Environments (Fall 2001, Fall 2000) MIT 4.184 Home of the Future / Community of the Future (with K. Larson) (Fall 1999) MIT IAP events: Visions of the Future: Screening and Making Concept Videos; IAP 2005, IAP 2004); Movie Making: Inventing the Future of Ubiquitous Computing (IAP 2003); Ubiquitous Computing Design Contest (IAP 2003); Designing a User Interface \"Age Suit\" (IAP 2002); Hack a Home of the Future Computer Interface (IAP 2001); Inventing a Home of the Future lunchtime seminar (IAP 2000) Advice for students I recommend that all my students or potential students read the following materials: Stephen's Thesis Development and Writing Tips Grants See my CV... Mailing Lists If you are local, consider joining the Personal Health Informatics (personal/behavioral health technologies and health informatics) or Mobile (novel mobile phone technologies) mailing lists. I forward relevant announcements to those lists. Other interests Cooking for my family, FIRST robotics with my daughter, indoor cycling on Zwift, canine clicker training and walking my dog, exploring Boston and surroundings. Most wishes to have dinner with Benjamin Franklin \"The best way to predict the future is to invent it.\" - Alan Kay, computing pioneer \"A prototype is worth a thousand meetings.\" - Mike Davidson, former VP of Design and Research, Twitter",
  "content_length": 9030,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:06"
}