{
  "name": "Stephen MacNeil",
  "homepage": "http://stevemacn.github.io",
  "status": "success",
  "content": "Stephen MacNeil | Professor of HCI, Computing Education, and Accessibility Curri: Visualizating the Curriculum S. MacNeil M. Dorodchi E. Al-Hossami A. Benedict MJ Mahzoon D. Desai ASEE 2020, IEEE FIE 2018 PDF Curriculum design can be more of an art than science. Decisions are seldom made based on data. Instead, they are often made based on the expertise of academic advisors and curriculum designers. Curri combines student data with information from the course catalog to visualize when, on average, students take specific courses. This allowed curriculum designers to identify bottlenecks (areas where many courses are taken at the same time) and inversions (areas where a class is taken before the pre-requisites) which can delay graduation. Curriculum designers can adjust to ensure that the courses are more evenly spread out temporally. Curri was designed for curriculum designers and advisors, but might also provide students with data about their own trajectories. Keywords: machine learning, visualization Close ProbMap: Automatically constructed design galleries S. MacNeil Z. Ding K. Quan Z. Huang K. Chen S. Dow ACM UIST 2021 Making sense of large unstructured problem spaces is cognitively demanding. Structure can help, but adding structure to a problem space also takes significant effort. ProbMap is a novel application for automatically constructing a design gallery from unstructured text input. Given a list of problem statements, ProbMap extracts and semantically groups the stakeholders to construct hierarchical search facets which enables designers to more efficiently navigate the problem statements. We contribute a novel feature extraction algorithm using natural language processing and a technique for automatically constructing a design gallery. These stakeholders are grouped semantically by clustering stakeholders with higher pairwise similarity together. Preliminary trials show that these techniques, which mirror traditional design activities like stakeholder identification and affinity mapping, provide an initial structure to a large unstructured problem space. This resulted in similar features that would be extracted by humans and sensible clusters. Close CoNotate: Adaptive Query Suggestions Support Learning S. Palani Z. Ding A. Nguyen A. Chuang S. MacNeil S. Dow ACM CHI 2021 PDF When exploring a new domain through web search, people often struggle to articulate queries because they lack domain-specific language and well-defined informational goals. Perhaps search tools rely too much on the query to understand what a searcher wants. Towards expanding this contextual understanding of a user during exploratory search, we introduce a novel system, CoNotate, which offers query suggestions based on analyzing the searcher’s notes and previous searches for patterns and gaps in information. To evaluate this approach, we conducted a within-subjects study where participants (n=38) conducted exploratory searches using a baseline system (standard web search) and the CoNotate system. The CoNotate approach helped searchers issue significantly more queries, and discover more terminology than standard web search. This work demonstrates how search can leverage user-generated content to help people get started when exploring complex, multi-faceted information spaces. Close End-User Design in Canvas S. MacNeil Z. Ding A. Boone A. Grubbs S. Dow ACM CSCW 2021 PDF Many organizations have adopted design processes that integrate community voices to discover the real problems that communities face through online discussion forums. However, we lack understanding about what information community members share, how that information is structured, and how social interactions affect the design processes at scale. This paper presents a mixed-methods analysis of Canvas, a learning management system, which enables users to contribute to the design of the platform by sharing and deliberating on problems and solutions in a discussion forum. We collected and analyzed 1412 ideas and 18,335 associated comments shared on the Canvas discussion forum. We found that 56.8% of posted ideas articulated a clear problem and only 40.4% included a comprehensive set of information (problem, solution, and contextual details) sufficient to make design decisions. Many of the ideas were duplicates (at least 11.6%); some members posted duplicates to garner attention for their ideas. Finally, we observed that 5% of posters contributed 19.9% of ideas. The distributed nature of design information, the presence of duplicate ideas, and gaming behaviors made it difficult for the community to get oriented to the discussion Close IneqDetect: Visualizing Student Conversations S. MacNeil K. Kiefer D. Takle B. Thompson C. Latulipe ACM CompEd '19 PDF IneqDetect records students’ group conversations that occur during peer learning activities and then visualizes these conversations temporally. In addition to showing the detected speech by group member, IneqDetect shows summaries of the total talk time per speaker and an overall measure of conversational equity. This work builds on prior research that has identified sociocultural inequities between students during peer learning activities. I hypothesized that presenting data to students about their social interactions would help students to communicate more equitably and lead to better team performance and cohesion. Keywords: machine learning, hardware, visualization Close",
  "content_length": 5461,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:00"
}