{
  "name": "Stephen Guy Pulman",
  "homepage": "https://www.cs.ox.ac.uk/people/stephen.pulman",
  "status": "success",
  "content": "Stephen Pulman | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleEmeritus FacultyStephen PulmanStephen Pulman Professor Stephen Guy Pulman FBAEmeritus ProfessorProfessorial Fellow, Somerville CollegeThemes:Artificial Intelligence and Machine LearningCompleted Projects:EuropaSAFeSEAInterests formal and computational semantics for natural language automated reasoning and language combining statistical and symbolic models of language BiographyStephen Pulman was a Lecturer in Linguistics at the University of East Anglia from 1978-1984, then a Lecturer and Reader in Computational Linguistics at the University of Cambridge Computer Laboratory from 1984 to 2000. From 2000 to 2006 he was Professor of General Linguistics in the Humanities Division, Oxford University, and from 2006 to 2017, Professor of Computational Linguistics in the Department of Computer Science, Oxford University. From 1988 to 1997 he was also Director of SRI International's Cambridge Computer Science Research Centre, and he has held visiting professorships at the Institut für Maschinelle Sprachverarbeitung, University of Stuttgart; and at Copenhagen Business School. He is a Fellow of the British Academy. Stephen Pulman was a co-founder of TheySay Ltd, a sentiment analysis company which was spun out of the Department of Computer Science in 2010, and acquired by Aptean in 2017. After retirement from Oxford University in 2017, he became an Emeritus Professorial Fellow of Somerville College, Oxford, and Emeritus Professor of the Department of Computer Science. He also took up a position as Senior Natural Language Research Scientist for Apple Inc. See alsoSAFeSEA project web pageComputational Linguistics Group web pageTheySay LtdRecent talk on Compositional Sentiment AnalysisSelected PublicationsView AllManage publications Second order inference in natural language semantics Stephen G. Pulman In J. Language Modelling. Vol. 6. No. 1. Pages 1–40. 2018. Details about Second order inference in natural language semantics | BibTeX data for Second order inference in natural language semantics | DOI (10.15398/jlm.v6i1.185) | Link to Second order inference in natural language semantics Leveraging User Engagement Signals For Entity Labeling in a Virtual Assistant Deepak Muralidharan‚ Justine Kao‚ Xiao Yang‚ Lin Li‚ Lavanya Viswanathan‚ Mubarak Seyed Ibrahim‚ Kevin Luikens‚ Stephen Pulman‚ Ashish Garg‚ Atish Kothari and Jason Williams In NeurIPS 2018 Workshop on Conversational AI. 2018. Details about Leveraging User Engagement Signals For Entity Labeling in a Virtual Assistant | BibTeX data for Leveraging User Engagement Signals For Entity Labeling in a Virtual Assistant | Link to Leveraging User Engagement Signals For Entity Labeling in a Virtual Assistant Price sensitive ripples and chain reactions: tracking the impact of corporate announcements with real−time multidimensional opinion streaming Moilanen K. and Pulman S. In F. A. Pozzi‚ E. Fersini‚ E. Messina and B. Liu, editors, Sentiment Analysis in Social Networks. Chapter 15. Pages 223−237. Elsevier (Morgan Kaufman). 2017. ISBN 978−0−12−804412−4 Details about Price sensitive ripples and chain reactions: tracking the impact of corporate announcements with real−time multidimensional opinion streaming | BibTeX data for Price sensitive ripples and chain reactions: tracking the impact of corporate announcements with real−time multidimensional opinion streaming ActivitiesCompositional Distributional Models of MeaningComputational LinguisticsPast StudentsJan BothaGregory DubbinNal KalchbrennerDimitri KartsaklisAfifah WaseemPia-Ramona WojtinnekLei Yu (DeepMind) About UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3914,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:53"
}