{
  "name": "Stephan Olariu",
  "homepage": "http://www.cs.odu.edu/~olariu",
  "status": "success",
  "content": "Professor Olariu's Home Page Professor Olariu's Home Page Professor of Computer Science Ph.D. Computer Science, McGill University, Montreal, 1986 Address Department of Computer Science Old Dominion University Norfolk, VA 23529-0162 U.S.A. Phone: (757) 683-4417 FAX: (757) 683-4900 Email: olariu@cs.odu.edu \"Far and away the best prize that life offers is the chance to work hard at work worth doing\" -- Theodore Roosevelt \"Play the hand you're dealt. Don't bother to be better than your contemporaries or predecessors. Try to be better than yourself\" -- William Faulkner RESEARCH INTERESTS Vehicular clouds Wireless sensor networks Vehicular communications Stochastic modeling RECENT PUBLICATIONS Book Chapters S. Olariu, R. Florin, and D. C. Marinescu, Toward Platoon-Aware Retiming of Traffic Lights in a Smart City, Chapter 7, pages 143-166, in Vehicle-to-Vehicle and Vehicle-to-Infrastructure Communications: A Technical Approach, F. Hu, (Ed.), Chapman & Hall/ CRC Computer and Information Science Series, Boca Raton, Florida, 2018 L. Wang, X. Wang and S. Olariu, Approximation algorithm for clustering in mobile ad-hoc networks, Chapter 21, pages 505-540, in Handbook of Approximation Algorithms and Metaheuristics: Contemporary and Emerging Applications, T. Gonzales, (Ed.), Chapman & Hall/ CRC Computer and Information Science Series, Boca Raton, Florida, 2018 X. Wang and S. Olariu, Towards aggregating time-discounted information in sensor networks, Chapter 26, pages 383-417, in Handbook of Approximation Algorithms and Metaheuristics: Contemporary and Emerging Applications, T. Gonzales, (Ed.), Chapman & Hall/ CRC Computer and Information Science Series, Boca Raton, Florida, 2018 A. Ghazi Zadeh and S. Olariu, Vehicular Clouds: A survey and future directions, Chapter 17, pages 435-463, in Cloud Computing for Optimization: Foundations, Applications, and Challenges, B. Mishra, H. Das, S. Dehuri, and A. Jagadev, A. (Eds.), Springer-Verlag, Berlin, May 2018 R. Florin and S. Olariu, Vehicular clouds: A view from above, Chapter 1, pages 1-29, in Vehicular Cloud Computing for Traffic Management Systems, J. Grover, P. Vinod, and C. Lal (Eds.), IGI Global, Hershey, PA, USA, May 2018 R. Florin, S. Abolghasemi, A. Ghazi Zadeh and S. Olariu, Big Data in the parking lot, Chapter 21, pages 425-449, in Big Data Managament and Processing, Kuan-Ching Li, Hai Jiang, and A. Y. Zomaya, (Eds.), Chapman & Hall/ CRC, Boca Raton, Florida, May 2017, ISBN: 9781498768078 H. AbdelSalam and S. Olariu, Energy-efficient task management in sensor networks, in The Art of Sensor Networks, H. Ammari, (Ed.), Springer-Verlag, Berlin, 2014 S. Olariu, T. Hristov and G. Yan, The next paradigm shift: From vehicular networks to vehicular clouds, in Mobile Ad hoc Networking: Cutting Edge Directions, S. Basagni, M. Conti, S. Giordano and I. Stojmenovic, (Eds.), Wiley, Second Edition, 2013 M. Almalag, M. C. Weigle and S. Olariu, MAC protocols for VANET, in Mobile Ad hoc Networking: Cutting Edge Directions, S. Basagni, M. Conti, S. Giordano and I. Stojmenovic, (Eds.), Wiley, Second Edition, 2013 Archival Journals M. Aljohani, R. Mukkamala, and S. Olariu, Autonomous Strike UAVs in Support of Homeland Security Missions: Challenges and Preliminary Solutions, Â  IEEE Access, 12, 2024, pp. 90979-90996 A. Alali, S. Olariu, and S. Jain, ADOPT: A system for Alerting Drivers to Occluded Pedestrian Traffic, Vehicular Communications, 41, 2023, 100601 S. Olariu, A Theoretical Validation of the Moving Observer Method, IEEE Transactions on Intelligent Transportation Systems, 24(12), 2023, 14633-146419 A. Ghazizadeh, P. Ghazizadeh, R. Mukkamala, and S. Olariu:, Reasoning About Expected Job Completion Time in Dynamic Vehicular Clouds, IEEE Transactions on Intelligent Transportation Systems, 24(8), 2023, 8279-8289 R. Florin and S. Olariu, Real-Time Traffic Density Estimation: Putting on-Coming Traffic to Work, IEEE Transactions on Intelligent Transportation Systems, 24(1), 2023, 1374-1383 S. Olariu and S. El-Tawab, Introduction to the Special Issue on Real-Time Traffic State Estimation, IEEE Transactions on Intelligent Transportation Systems, 24(1), 2023, 1356-1358 M. Aljohani, S. Olariu, A. Alali, and S. Jain, A Survey of Parking Solutions for Smart Cities, IEEE Transactions on Intelligent Transportation Systems, 23(8), 2022, 10012-10029 S. H. Bouk, D. B. Rawat, S. Olariu, R. Hussain, Guest Editorial Introduction to the Special Issue on Communication and Computing Technologies, IEEE Transactions on Intelligent Transportation Systems, 23(11), 2022, 22436-22441 A. Iqbal and S. Olariu, A survey of enabling technologies for smart communities, Smart Cities, 4(1), 2021, 54-77 S. Olariu, Vehicular Crowdsourcing for Congestion Support in Smart Cities, Smart Cities, 4(2), 2021, 662-685 R. Florin, P. Ghazizadeh, A. Ghazi Zadeh, R. Mukkamala, and S. Olariu, A tight estimate of job completion time in vehicular clouds, IEEE Transactions on Cloud Computing, 8(3), July-September 2020, 721-734 S. Rizvi, S. Zehra, and S. Olariu, MAPark: a multi-agent auction-based parking system in the internet of things, IEEE Intelligent Transportation Systems Magazine, 12, 2020, 2-13 R. Florin and S. Olariu, Towards real-time traffic density estimation using vehicle-to-vehicle communications, Transportation Research, Part B, 138, August 2020, 431-456 S. Olariu, A survey of vehicular cloud research: Trends, applications, and challenges, IEEE Transactions on Intelligent Transportation Systems, 21(6), June 2020, 2648-2663 D. C. Marinescu and S. Olariu, Guest Editorial, Special Issue on Vehicular Clouds, IEEE Transactions on Intelligent Transportation Systems, 21(6), June 2020, 2637-2639 S. Rizvi, S. Zehra, and S. Olariu, ASPIRE: An agent-oriented smart parking recommendation system for smart cities, IEEE Intelligent Transportation Systems Magazine, 11(4), November 2019, 48-61 R. Florin and S. Olariu, Towards approximating job completion in vehicular clouds, IEEE Transactions on Intelligent Transportation Systems, 20(7), July 2019, 3168-3177 R. Florin, P. Ghazizadeh, A. Ghazi Zadeh, S. Olariu, and D. Marinescu, Enhancing reliability and availability through redundancy in vehicular clouds, IEEE Transactions on Cloud Computing, early access 2019 R. Florin, P. Ghazizadeh, A. Ghazi Zadeh, and S. Olariu, Towards approximating the mean time to failure in vehicular clouds, IEEE Transactions on Intelligent Transportation Systems, 19(7), July 2018, 2045-2054 R. Florin, P. Ghazizadeh, A. Ghazi Zadeh, S. El-Tawab, and S. Olariu, Reasoning about job completion time in vehicular clouds, IEEE Transactions on Intelligent Transportation Systems, 18(7), July 2017, 1762-1771 R. Florin and S. Olariu, On a variant of the mobile observer method, IEEE Transactions on Intelligent Transportation Systems, 18(2), 441-449, 2017 D. C. Marinescu, A. Paya, J. P. Morrison, and S. Olariu, An approach for scaling cloud resource management, Cluster Computing, 20(1), 909-924, 2017 E. C. Whelan, A. C. Nwala, C. Osgood, and S. Olariu, Selective mutation accumulation: a computational model of the parental age effect, Bioinformatics, 32(24), 3790-3797, 2016 X. Wang, S. El-Tawab, A. Alhafhi, M. Almalag, and S. Olariu, Towards probabilistic data collection in the NOTICE architecture, IEEE Transactions on Intelligent Transportation Systems, 17(12), 3354-3363, 2016 P. Ghazizadeh, R. Florin, A. Ghazi Zadeh and S. Olariu, Reasoning about mean time to failure in vehicular clouds, IEEE Transactions on Intelligent Transportation Systems, 17(3), 751-761, 2016 R. Florin and S. Olariu, A survey of vehicular communications for traffic signal optimization, Vehicular Communications, 2(2), 70-79, 2015 El-Tawab, A. Alfadhi, D. Treeumnuk, D. P. Popescu and S. Olariu, Physical layer aspects of information exchange in the NOTICE architecture, IEEE Intelligent Transportation Systems Magazine, 7(1), 8-18, 2015 G. Yan, S. Olariu, J. Wang and S. Arif, Towards providing scalable and robust privacy in vehicular networks, IEEE Transactions on Parallel and Distributed Systems, 15(7), 1896-1906, 2014 S. Olariu, S. Mohrekesh, X. Wang and M. C. Weigle, On aggregating information in actor networks, SIGMOBILE Mobile Computing and Communications Review, 18(1), 85-96, 2014 G. Yan, D. Wen, S. Olariu and M. C. Weigle, Security challenges in vehicular cloud computing, IEEE Transactions on Intelligent Transportation Systems, 14(1), 284-294, 2013 G. Yan, S. Olariu and D. Popescu, NOTICE: An architecture for the notification of traffic incidents, IEEE Intelligent Transportation Systems Magazine, 4(4), 6-16, 2012 S. Arif, S. Olariu, J. Wang, G. Yan, W. Yang and I. Khalil, Datacenter at the airport: Reasoning about time-dependent parking lot occupancy, IEEE Transactions on Parallel and Distributed Systems, 23(11), 2067-2080, 2012 H. S. AbdelSalam and S. Olariu, BEES: bio-inspired backbone selection in wireless sensor networks, IEEE Transactions on Parallel and Distributed Systems, 23(1), 44-51, 2012 H. S. AbdelSalam and S. Olariu, Towards adaptive sleep schedules for balancing energy consumption in wireless sensor networks, IEEE Transactions on Computers, 61(10), 1443-1458, 2012 G. Yan and S. Olariu, A probabilistic analysis of link stability in vehicular ad hoc networks, IEEE Transactions on Intelligent Transportation Systems, 12(4), 1227-1236, 2011 G. Yan, W. Yang, D. B. Rawat and S. Olariu, SmartParking: A secure and intelligent parking system, IEEE Intelligent Transportation Systems Magazine, 3(1), 18-30, 2011 H. S. AbdelSalam and S. Olariu, Toward efficient task management in wireless sensor networks, IEEE Transactions on Computers, 60(11), 1638-1651, 2011 F. Barsi, A. A. Bertossi, C. Lavault, A. Navarra, S. Olariu, M. C. Pinotti, and V. Ravelomanana, Efficient location training for heterogeneous sensor and actor networks, IEEE Transaction on Mobile Computing, 10(3), 377-391, 2011 D. R. Rawat, D. C. Popescu, G. Yan, S. Olariu, Enhancing VANET performance by joint adaptation of transmission power a",
  "content_length": 11559,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:37"
}