{
  "name": "Stephen Kell",
  "homepage": "https://www.humprog.org/~stephen",
  "status": "success",
  "content": "Stephen Kell About Me I'm an academic at King's College London's Department of Informatics, where I teach topics in computer systems and software development, and do research within the Software Systems group. I'm also an independent researcher, software developer, educator and consultant. There's a little about that below, and I'll say more in a future update. Contact information is at the bottom of this page. For my publications, click here or keep reading. I am a practical “computer scientist” who builds things; I'd argue this makes me more engineer than scientist per se. I have wide interests: my goal is to make it easier and cheaper to develop useful, high-quality software systems. So far, my work has mostly focused on programming languages and the systems that support them—including language runtimes and operating systems. Micro-blog and calendar November 2025. You can now crowdfund my independent research, development and writing... read more. January 2025. Back to normality... still mostly doing strange things with debugging information. September 2024. I'm in Glasgow now, Canberra for 12 weeks from late September, except when I'm in Pasadena / US west coast for the last week of October (SPLASH of course). Lots to keep up with! September 2024. A new paper about supporting debugging of optimised code (with Ryan Stinnett) will be presented next month at Onward!... preprint below. July 2024. I was honoured to receive Distinguished Reviewer awards for my service on the PCs of <Programming> '24 and PLDI '24. Misspend time, me? January 2024. A new paper (with Ryan Stinnett) about debug info metrics will appear at CC in March; preprint to appear soon (below). May 2023. Should really update more often. Been working on DIADEM project (some output to appear soon) and also liballocs and libcrunch as always. July 2021. I appeared on Manuel Rigger's ‘GAP’ interview series, talking about how (unbelievably) I've applied for academic positions, at times successfully. July 2021. Started at King's College London. March 2021. I appeared on Henry Zhu's ‘Hope in Source’ podcast, talking about Ivan Illich's ideas applied to software. January 2021. Still alive... belatedly added a couple of workshop papers from 2020 here and here February 2020. I'll be lecturing at the Programming Language Implementation Summer School (PLISS) in Bertinoro this May. September 2019. Delighted that work on robust DWARF frame info by Théophile Bastian, Francesco Zappa Nardelli and (a little help from) myself will be presented at OOPSLA 2019. Recent blog entries 11 November 2025, Support for Stephen (to be measured out in coffee spoons?), in meta 10 November 2025, Reversing abstractions: an existential crisis, in research 7 November 2025, The art of appearing research-productive as an academic, in highered 7 October 2025, Academic promotion in the time of (arguable) underfunding, in highered 12 September 2025, Software substrates: should there be only one?, in research (all entries) Informative oddments Although my forename is very common in English-speaking countries, increasingly even English-speakers seem to have trouble pronouncing it. Try the following mouseover-assisted IPA, due to Wikipedia, if you're not sure: /ˈstiːvən/ . Although it confuses some non-UK people, my job title of Lecturer (in Computer Science) is traditional here for research-active academics such as myself. Some UK institutions have started using American-style titles, but note that in the UK, academics no longer receive tenure. Research overview My primary research goal is to make possible increasingly humane, programmable computer systems. Currently, I am pursuing this through a humane evolution of the Unix-like operating system. If I had to limit myself to only a dozen research areas, they would be these. run-time checking in unsafe languages compiler and runtime support for debugging and live programming multi-language toolchains and runtimes tools for system interface specification and testing infrastructure for building instrumentation-based tools data description and schema languages/tools infrastructure for repeatable and reversible execution decentralised Internet applications and their construction radically modular programming software build and deployment infrastructure hybrid program analysis/execution engines big questions about programming and software Most of my research concerns programming, but I identify as a “systems” researcher. For me, “systems” is a mindset rather than a research topic. It means I am primarily interested in the practical consequences of an idea; its abstract properties are of interest only subserviently. (If you can come up with a better definition, let me know.) I generally hesitate to identify as a “programming languages” researcher, not because I dislike languages but because they're only one piece of the puzzle. I'd identify as a “programming systems” researcher if that were a thing. You can read more below about what I'm working on. A recurring theme is that I prefer pushing innovations into the software stack at relatively low levels, to the extent that this is sensible (which I believe can be surprising). Another is the pursuit of infrastructure that is well-integrated, observable, simple, flexible, and designed for human beings—particularly if we believe (as I do) that computers are for augmenting the human intellect, not just for high-performance data crunching. I believe that technology cannot be pursued in isolation. “Good” engineering research is done with an understanding of history, human culture, and that research's place in them. This might mean asking small questions, like the impact of a technical change on a wider software ecosystem. It also means asking bigger questions of the human and social assumptions behind the work: who might use it; who it will benefit; why this is an overall good; and so on. By its answers to such questions, perhaps implicitly, all technical work invariably subscribes to what one could call a “philosophical basis”. I believe that understanding these bases can lead to more valuable technical work. Some of the relevant questions are so big that they cannot be answered by experimental methods. I do not subscribe to the view that to be “scientific” is an unalloyed good, or that the methods of the humanities are faulty. To do good engineering research is to be more than purely a scientist. Very brief biography I did my Bachelor's degree in computer science in Cambridge, graduating in 2005. I then stayed on for a year as a Research Assistant, before starting my PhD in 2006. My PhD work was based in the Networks and Operating Systems group under the supervision of Dr David Greaves, and centred on the problem of building software by composition of ill-matched components, for which I developed the Cake language. During summer 2007 I took an internship at Fraser Research, doing networking research. From January 2011 until March 2012 I was a research assistant in the Department of Computer Science at the University of Oxford. There I worked within the research programme of the Oxford Martin School's Institute for the Future of Computing. My work mostly focused on constucting a continuum between state-space methods of program analysis (notably symbolic execution) with syntactic methods (such as type checking). I ended up moving on before I could see this to fruition, but in 2019 I was awarded some funding from VeTSS and it was briefly taken up in the (now aborted) PhD work of Justus Adam (see the paper at TAPAS '20). From May 2012 to May 2013, I was a postdoctoral researcher at USI's Faculty of Informatics in Lugano, Switzerland, within the FAN project. From May until October 2013 I was temporarily a Research Assistant at Oracle Labs, on the Alphabet Soup project. I returned to Cambridge in October 2013, as a Research Associate (later Senior Research Associate) at the Computer Laboratory (now become the Department of Computer Science and Technology). I worked within the REMS project, and participated in both the Programming, Logic and Semantics group and the Systems Research Group (particularly its Networks and Operating Systems subgroup). As of January 2024 I continue to be a visiting researcher at the Department. In 2018 I took up the job of Lecturer (again, “Assistant Professor” in US English) at the University of Kent. In 2021 I moved to “the same” job (but one somewhat different in practice) at King's College London. In my industrial life, I enjoyed some spells working for Opal Telecom (now TalkTalk) and ARM (now Arm) around my Bachelor's studies. More recently, I have consulted for Ellexus (now part of Altair), Petagene (now part of Storj), and conducted some industrial research (in reality rather development-heavy) for Oracle Labs. I maintain (sometimes neglectfully) two CVs: a snappy two-page one here, and a longer academic one here. Please be aware that both may be a little rough or incomplete at times. If you're recruiting for jobs in the financial sector, even technical ones, please don't bother reading my CV or contacting me—I promise I am not interested. Research Current work Here's what I'm working on as of April 2020. In most cases these are my own individual projects; a few are with collaborators, as I describe. Making the Unix process environment more descriptive and reflective Unix-like processes are with us to stay, but are impoverished in ways that hold us back. It is too difficult to build robust tools and systems which automate or abstract meta-level programming tasks, such as debugging, profiling, visualisation, instrumentation, composition, error reproduction and dynamic update. In turn, this massively hampers software development generally! In large part, the root problem is that the state of a Unix process is too opaque. Unix lacks adequate meta-level facilities for describing user-supplied abstractions such as data representation, memory layouts, procedural interfaces, fil",
  "content_length": 98497,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:58"
}