{
  "name": "Stephen Swift",
  "homepage": "https://www.brunel.ac.uk/people/stephen-swift",
  "status": "success",
  "content": "Dr Stephen Swift | Introduction | Brunel University London Skip to Content Home People Dr Stephen Swift Dr Stephen SwiftReader Wilfred Brown Building 218 Email: stephen.swift@brunel.ac.uk Tel: +44 (0)1895 266934 Personal Website Computer Science College of Engineering, Design and Physical Sciences Summary Dr. Stephen Swift is a Research Lecturer in the School of Information Systems, Computing and Mathematics at Brunel University London. He received a B.Sc. degree in Mathematics and Computing from the University of Kent, Canterbury, U.K., an M.Sc. in Artificial Intelligence from Cranfield University, Cranfield, U.K. and a Ph.D. degree in Intelligent Data Analysis from Birkbeck College, University of London, London, U.K. He has four years post-doctoral research experience on an EPSRC funded project entitled “Modelling Short Multivariate Time Series” (involving Moorfields Eye Hospital) GR/M94120) and a BBSRC funded project entitled “Analysing Virus Gene Expression Data to understand Regulatory Interactions” (BIO14300) in collaboration with the Departments of Virology and Biochemistry at University College London and the School of Computer Science and Information Systems, Birkbeck College. He has also spent four years in industry as a web designer, programmer and technical architect. Newest selected publications Aondoakaa, D., Cosmas, J. and Swift, S. (2020) 'Exploiting heterogeneity for cost efficient 5G base station deployment using metaheuristics'. IET Networks, 9 (5). pp. 270 - 275. ISSN: 2047-4954 Open Access Link Journal article Ghorbani, M., Swift, S., Taylor, SJE. and Payne, AM. (2020) 'Design of a flexible, user friendly feature matrix generation system and its application on biomedical datasets'. Journal of Grid Computing, 18 (3). pp. 507 - 527. ISSN: 1570-7873 Open Access Link Journal article Yousefi, L., Swift, S., Arzoky, M., Saachi, L., Chiovato, L. and Tucker, A. (2020) 'Opening the black box: Personalizing type 2 diabetes patients based on their latent phenotype and temporal associated complication rules'. Computational Intelligence, 37 (4). pp. 1460 - 1498. ISSN: 0824-7935 Open Access Link Journal article Ghorbani, M., Pousset, F., Tucker, A., Swift, S., Giunti, P., Parkinson, M., Gilbert, D., Liu, XH. and Payne, A. et al. (2019) 'Analysis of Friedreich's ataxia patient clinical data reveals importance of accurate GAA repeat determination in disease prognosis and gender differences in cardiac measures'. Informatics in Medicine Unlocked, 17 (2019). pp. 1 - 8. ISSN: 2352-9148 Open Access Link Journal article Dorudian, N., Lauria, S. and Swift, S. (2019) 'Moving Object Detection using Adaptive Blind Update and RGB-D Camera'. IEEE Sensors Journal, 19 (18). pp. 8191 - 8201. ISSN: 1530-437X Open Access Link Journal article More publications(60)",
  "content_length": 2801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:08"
}