{
  "name": "Stephanie Brandl",
  "homepage": "https://researchprofiles.ku.dk/en/persons/stephanie-brandl",
  "status": "success",
  "content": "Stephanie Brandl - University of Copenhagen Research Portal Stephanie Brandl Tenure Track Assistant Professor, SODAS, SODASGuest Researcher, Department of Computer Science, Natural Language Processing Phone+4535328858Emailstephanie.brandlsodas.kudk, brandldi.kudk Øster Farimagsgade 5, bygning 1, 2. sal1353 København KUniversitetsparken 12100 København Ø Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 9 Article in proceedings 2 Preprint 1 Journal article 1 Conference article Research output per year Research output per year Evaluating Webcam-based Gaze Data as an Alternative for Human Rationale AnnotationsBrandl, S., Eberle, O., Ribeiro, T., Søgaard, A. & Hollenstein, N., 2024, 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation, LREC-COLING 2024 - Main Conference Proceedings. Calzolari, N., Kan, M.-Y., Hoste, V., Lenci, A., Sakti, S. & Xue, N. (eds.). European Language Resources Association (ELRA), p. 6544-6556 13 p.Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 1 Citation (Scopus) 2 Downloads (Pure) Llama meets EU: Investigating the European Political Spectrum through the Lens of LLMsChalkidis, I. & Brandl, S., 2024, Proceedings of the 2024 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (Volume 2: Short Papers). Association for Computational Linguistics, p. 481-498 18 p.Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 4 Citations (Scopus) 14 Downloads (Pure) On the Interplay between Fairness and ExplainabilityBrandl, S., Bugliarello, E. & Chalkidis, I., 2024, arXiv.org, 15 p.Research output: Working paper › Preprint Open AccessFile 27 Downloads (Pure) Domain-Specific Word Embeddings with Structure PredictionLassner, D., Brandl, S., Baillot, A. & Nakajima, S., 2023, In: Transactions of the Association for Computational Linguistics. 11, p. 320-335Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile 3 Citations (Scopus) 21 Downloads (Pure) Evaluating Bias and Fairness in Gender-Neutral Pretrained Vision-and-Language ModelsCabello, L., Bugliarello, E., Brandl, S. & Elliott, D., 2023, Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics (ACL), p. 8465-8483 Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 6 Citations (Scopus) 23 Downloads (Pure) Rather a Nurse than a Physician - Contrastive Explanations under InvestigationEberle, O., Chalkidis, I., Cabello, L. & Brandl, S., 2023, Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics (ACL), p. 6907-6920 Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 4 Citations (Scopus) 17 Downloads (Pure) WebQAmGaze: A Multilingual Webcam Eye-Tracking-While-Reading DatasetNunes Ribeiro, T. F., Brandl, S., Søgaard, A. & Hollenstein, N., 2023, arXiv.org, 14 p.Research output: Working paper › Preprint Open AccessFile 27 Downloads (Pure) A Cross-lingual Comparison of Human and Model Relative Word ImportanceMorger, F., Brandl, S., Beinborn, L. & Hollenstein, N., 2022, Proceedings of the 2022 CLASP Conference on (Dis)embodiment. Association for Computational Linguistics (ACL), p. 11-23 13 p.Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 36 Downloads (Pure) View all 13 research outputs",
  "content_length": 4115,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:41"
}