{
  "name": "Stephen C. Hirtle",
  "homepage": "http://www.pitt.edu/~hirtle/hirtle.html",
  "status": "success",
  "content": "Stephen C Hirtle Stephen C. Hirtle Pitt | SCI | DINS | BSIS | SIRG About Dr. Stephen C. Hirtle is Professor in School of Computing and Information at the University of Pittsburgh, with joint appointments in the Department of Psychology and Intelligent Systems Program. He directs the Spatial Information Research Group at the University of Pittsburgh, which conducts research on the structure of cognitive maps, navigation in real and virtual environments, and both applied and theoretical models for spatial cognition. Spring 2020 INFSCI 1044: Human Factors in System Design Spring 2020 INFSCI 2300: Human Information Processing Spring 2020 Previous Classes INFSCI 2460: Spatial Reasoning for GIS ... for complete list, see teaching links Contact Information School of Comptuing and Information 135 N. Bellefield Ave 2B01 IS Bldg University of Pittsburgh Pittsburgh PA 15260 hirtle -at- pitt.edu Voice: 412-624-9434 Fax: 412-624-5231 www.pitt.edu/~hirtle LinkedIn Recent Conferences COSIT 2019,14th International Conference on Spatial Information Theory Regensburg, Germany, September 9th-13th 2019 Recent Publications Bahm, C. R., & Hirtle, S. C. (2017). Global Landmarks in a Complex Indoor Environment. In Leibniz International Proceedings in Informatics, forthcoming. Hirtle, S. C., & Bahm, C. R. (2015). Cognition for the Navigation of Complex Indoor Environments. In H. A. Karimi (Ed.) Indoor Wayfinding and Navigation, CRC Press, pp. 1-12. Srinivas, S., & Hirtle, S. C. (2015). The Role of Affect on Expanding Indoor Spatial Knowledge. In H. A. Karimi (Ed.) Indoor Wayfinding and Navigation, CRC Press, pp. 13-34. Hirtle, Stephen; Raubal, Martin. (2013). Many to Many Mobile Maps. In M. Raubal, D. Mark & A. Frank (Eds.): Cognitive and Linguistic Aspects of Geographic Space - New Perspectives on Geographic Information Research. Springer Berlin, Heidelberg, pp. 141-157. Hirtle, S. C. (2012). Models of Spatial Cognition. In Waller, D. & Nadel, L. (Eds). Handbook of Spatial Cognition. APA. ...more Home Teaching Research Service Biographical Sketch Spatial Research Group Related Links University of Pittsburgh School of Computing and nformation UCGIS CSNA COSIT GIScience Contact Us | Copyleft 04-Jan-2018",
  "content_length": 2216,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:48"
}