{
  "name": "Stephen Flowerday",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=SFLOWERDAY",
  "status": "success",
  "content": "Stephen Flowerday - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Stephen Flowerday Professor Stephen Flowerday Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesAdministrationDepartment of The Graduate School BioStephen Flowerday is a professor of Information Systems at Augusta University. His research interests focus on the management, behavioral, and human aspects of cybersecurity. He has received funding for his work from IBM, THRIP, NRF, SASUF, Erasmus, GMRDC, and others. SFLOWERDAY@augusta.edu Summerville Campus General Credentials Instruction Scholarship Service Education DIT, Information Technology Nelson Mandela Metropolitan Un, 2007 MBA, Business Administration and Management Oxford Brookes University, 1995 BS, Business Administration and Management Century University, 1993 Awards & Honors College Senior Researcher Award Rhodes University, 2021 Vice-Chancellor’s Senior Researcher Award University of Fort Hare, 2014 Courses Taught Most Recent Academic Year AIST 4720 Enterprise System Architecture Teaching Interests • Research Methods in Cyber (graduate)• Cybersecurity Capstone (undergraduate)• Cyber Defensive Technologies & Management (undergraduate)• Information Systems Management (undergraduate)• Strategic Information Systems (graduate)• Threat Modeling (undergraduate) Scholarship Selected Recent Publications Malicious Insider Threats in Cybersecurity: A Fraud Triangle and Machiavellian Perspective, 2026 Other Understanding User Susceptibility to Risks in AI Companionship Applications, 2026 Other The Vigilance Paradox: Automation Reliance Inside the Modern SOC, 2026 Journal Article, Academic Journal Cybercrime and virtual laundering in video game marketplaces: A Bayesian P-inductive argument, 2025 Journal Article, Academic Journal Exploring the Risks of AI on Human Worth, 2025 Other Research Interests My research focuses on cybersecurity management, cybercrime, behavioral information security, and human-centric cybersecurity at the intersection of technology, processes, and people. Professional Service Journal: Computers and Security 2025 - Present Role: Editor, Associate Editor The Journal of Social Media 2025 - Present Role: Editor, Associate Editor Journal of Cybersecurity 2022 - Present Role: Editor, Associate Editor Journal of Information and Computer Security 2022 - Present Role: Editor, Associate Editor",
  "content_length": 2535,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:51"
}