{
  "name": "Stephen Brooks",
  "homepage": "https://web.cs.dal.ca/~sbrooks",
  "status": "success",
  "content": "Dr. Stephen Brooks Dr. Stephen Brooks Professor Faculty of Computer Science Dalhousie University 6050 University Avenue Halifax, Nova Scotia Canada, B3H 1W5 (902) 494-2512 (email is better!) (902) 492-1517 (fax) Biography I received my Ph.D. in Computer Science at the University of Cambridge in 2004, my M.Sc. from the University of British Columbia in 2000 and my B.Sc. from Brock University in 1998.  I am currently a professor at Dalhousie University.  Before arriving at Dalhousie, I worked primarily on semi-automatic image editing, but I also dabbled in sound synthesis and human motion editing. My current interests lie in the areas of non-photorealistic rendering, image editing, animation and visualization. For fun, I like to draw, walk dogs and occasionally ski without style. Here's a few examples of my drawings for the curious: Research Projects Ocean Science Visualization Part of a Dal-led research program, titled Transforming Climate Action: Addressing the Missing Ocean, is set to bring an ocean-first approach to climate science, innovation and solutions. It unites more than 170 researchers across Dalhousie and its partner institutions Université du Québec à Rimouski, Université Laval and Memorial University of Newfoundland. And with additional investment activated by this CFREF grant bringing its total funding to nearly $400 million, it represents a monumental financial contribution to Canada-led climate science. Our interdisciplinary research program involves experts in education, ocean science, ocean literacy, information science, computer science, and public administration, bringing a rich suite of theories and methods to investigate this complex problem. 3D Clouds Given the expanding use of 3D Objects in a variety of fields such as animation, gaming, virtual worlds, commerce, augmented reality and 3D printing, we present a novel system for object browsing and searching. Specifically, the system packs objects into an interactive 3D cloud for browsing and searching. It was designed with the aim of increasing search efficiency in a variety of active environments, while providing a visually engaging layout, and we evaluated this by conducting a comparative user study. We show that our system can significantly decrease search times compared to the classic grid-based layout, and it has been suggested by subjects that cloud-based searching is more interesting and visually-engaging. Dynamic Network for GIS A dynamic approach for revealing the underlying information in locally cluttered areas within a geo-spatial connected graph while maintaining global edge trends. Two time series data-flow visualization approaches at both local and global scales are proposed respectively: a stream model focuses on data flows within the local area while a hub model addresses the relations between groups of nodes across the graph. The computational complexity and quantitative performance analysis on three different datasets were conducted to examine the scalability of the visualization model. The simulation results show that the central algorithms in our approach are able to achieve acceptable performance in real world test cases. Interactive Text Analytics User generated content is different from traditional documents in structure, length, and semantics. Consequently, applying traditional natural language processing and text mining methods to emerging and challenging text mining problems does not always achieve satisfactory results. This thesis studies the impact of actively involving the user in the analytical process of such data on overcoming related challenges and improving the quality of the analysis. We investigate whether employing active learning and visualization techniques increases the benefits gained from incorporating user knowledge, and whether these techniques enhance user involvement. Moreover, our ultimate objective is to assist users to better understand the data and make decisions. Perceptual Tone Mapping High dynamic range (HDR) images provide the capacity to represent the luminance in real scenes with much higher precision than standard image formats. With advances in hardware and computer graphics technologies, HDR images are rapidly becoming more commonplace, and they have successfully been used for many applications, such as digital photography, physical-based rendering, and virtual reality. But to visualize HDR images on contemporary display devices, the dynamic range needs to be adapted to the much smaller range of the devices. This is accomplished through tone mapping, with the goal of reproducing the visual appearance of HDR scenes based on human perception and automatic optimization. Real-time Ocean Modelling Realistic simulations of the ocean surface based on statistical wave models typically rely on very large Fourier grids. Real-time requirements severely limit the size of the grids that can be used, even if the FFT is implemented on the GPU. Moreover, none of the grids used so far are sufficient for capturing the entire dynamic range of ocean waves, which can easily span four to five orders of magnitude. Our approach removes the FFT as the computational bottleneck of sea surface simulations. By splitting the wave number range into a small number of non-overlapping, relatively narrow bands within which the samples are equidistantly spaced allows making use of the FFT while having some of the flexibility of the adaptive approaches that concentrate wave number samples in high-energy regions of the spectrum. Real-time River Rendering In this work we present a new method for the realistic real-time simulation of rivers. Our solution includes a 2D fluid solver that simulates the flow of a river's surface, an efficient method for adaptively computing 3D flow information and an animated 3D procedural wave texture that is advected through the fluid via advection particles in order to mimic the highly detailed fluid surfaces that are characteristic of rivers. Our technique that couples animated texture advection with a pseudo-3D fluid simulation produces stable results that are representative of large scale real-world rivers and suitable for use in real-time applications. Our system surpasses prior work on real-time river rendering both with regards to efficiency and visual quality, which we establish through the rendering of rivers tens of kilometers long. Genomic Geospatial Information Systems With the advent of ever-cheaper genome sequencing technologies, a wide range of organisms can now be examined at the genetic level, and biodiversity can be expressed in quantitative terms of genetic similarity and shared function. These techniques are now being applied to samples collected directly from the environment to give a cross-section of the diversity that exists at different locations in different habitats. We are developing an open source, 3D geospatial information system to examine and test relationships between biodiversity, geography, and the environment. The goal is to acquire cartographic and environmental data from many sources, and overlay user-provided genomic sample sites and genetic sequences. Network Flow Visualization NetFlow data is being accumulated from the borders between private networks and the public internet. The data aggregate grows at the rate of gigabytes per day, stored in SiLK repositories. While tools exist to look for known malicious activities such as scanning, the volume of the data, its volatility, and the difficulty of establishing its “ground truth” preclude the use of conventional anomaly detection approaches for detecting malicious activity. To aid analysts in understanding this data, we are developing a comprehensive and extensible set of visualization tools, integrated with the SiLK tool suite via a relational database that stores data such as sets and multisets (“bags”), derived from NetFlow and similar sources. Mixed Media Painting and Portraiture This work presents a technique to transform digital images into renderings that approximate the appearance of mixed media artwork, which incorporates two or more traditional visual media. This is achieved this by first separating an input image into distinct regions based on the detail present in the image. Each region is then processed independently with a user-selected NPR filter. This allows the user to treat highly detailed regions differently from regions of low frequency content. The separately processed regions are then blended in the gradient domain. In addition, the work is extended to the rendering of mixed media portraits. Portraits pose unique challenges that we address with our method of segmentation, which is based on a composite of face detection and image detail. Our approach offers the user a great deal of flexibility over the end result, while at the same time requiring very little input. Image-Based Stained Glass A stained glass window possesses a distinctive style partly due to the unique color ranges produced through the interaction of color enamels, glass and light. The imposition of lead calmes further separates the appearance of stained glass from other mediums. This project presents a method of re-styling an image so that it approximates the appearance of a work of stained glass. To this end, a novel approach has been developed which involves image warping, segmentation, querying, and colorization along with texture synthesis. In the method, a given input image is first segmented. Each segment is subsequently transformed to match real segments of stained glass queried from a database of image exemplars. By using real sources of stained glass, the method produces high quality results in this nascent area of non-photorealistic rendering. The generation of the stained glass requires only modest amounts of user interaction. This interaction is facilitated with a unique region-merging tool. Hybrid 2D-3D Geospatial Information Systems In many interactive computer graphics applications, maps in three d",
  "content_length": 40349,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:47"
}