{
  "name": "Stephen Smith 0001",
  "homepage": "https://researchers.mq.edu.au/en/persons/stephen-smith",
  "status": "success",
  "content": "Stephen Smith - Macquarie University View Scopus Profile Stephen Smith Dr Lecturer in Information Systems, School of Computing https://orcid.org/0000-0003-2966-5762 Emailstephen.smithmq.eduau h-index 484 Citations 9 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20052025 Research activity per year Personal profile BiographyInformation Systems, Green IS, IS Security, Emergency Management, eGovernment Fingerprint Dive into the research topics where Stephen Smith is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Information Systems Computer Science 100% Information Technology Social Sciences 55% Information System Security Computer Science 53% Wireless Sensor Network Computer Science 36% Activity Theory Social Sciences 31% e-government Computer Science 31% Climatic Change Computer Science 27% Classification Models Computer Science 26% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2016 2016 2017 1 Finished Projects per year Designing a program based career information literacy learning systemLin-Stephens, S. (Primary Chief Investigator), Richards, D. (Other) & Smith, S. (Other)1/01/16 → 30/06/17Project: Teaching Research Outputs Research output per year 2005 2009 2013 2014 2017 2019 2020 2021 2022 2024 2025 57 Conference proceeding contribution 9 Article 4 Paper 1 Chapter 2 More 1 Conference abstract 1 Review article Research output per year Research output per year Mitigating cyberloafing through employee adaptability: the roles of temporal leadership, teamwork attitudes, and competitive work environmentHessari, H., Daneshmandi, F., Busch, P. & Smith, S., 2025, In: Asia-Pacific Journal of Business Administration. 17, 2, p. 303-336 40 p.Research output: Contribution to journal › Article › peer-review Work Environment 100% Temporal Leadership 100% Resource Model 20% Competitive Pressure 20% 11 Citations (Scopus) Tackling nomophobia: the influence of support systems and organizational practicesHessari, H., Busch, P. & Smith, S., 2025, In: Psychology, Health and Medicine. 30, 3, p. 572-601 30 p.Research output: Contribution to journal › Article › peer-review Social Interaction 100% Mobile Phone 100% Mobile Device 100% 1 Citation (Scopus) Australian bachelor of information technology curricula vs. employability skills: a misalignmentAlavi, H., Smith, S. & Busch, P., 23 Jul 2024, (Submitted) In: European Journal of Education. 35 p.Research output: Contribution to journal › Article › peer-review Employability Skill 100% Information Technology 100% Employability 100% Information Systems 33% Information Literacy 25% Developing a predictive model for COVID-19 in UgandaSebiranda, S. M., Busch, P. & Smith, S., 19 Aug 2024, (Submitted) Australasian Conference on Information Systems (ACIS). University of Canberra, 11 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Learning System 100% Sustainable Development 25% Predictive tools for house fire instance preparationEdwards, A., Smith, S. & Busch, P., 2024, AMCIS 2024 proceedings. Online: Association for Information Systems, 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Decision Making 100% Information Systems 100% Artificial Intelligence 100% Activity Theory 100% World Problem 50% View all 73 research outputs Prizes Winner - Faculty of Science and Engineering Award for Inter-School Collaboration - 2023Nayak, A. (Recipient), Mahmood, A. (Recipient), Beheshti, A. (Recipient), McIver, A. (Recipient), Bilgin, A. (Recipient), Liquet-Weiland, B. (Recipient), Svensson, C. (Recipient), Ramakrishnan, C. (Recipient), Smith, C. (Recipient), Molla-Aliod, D. (Recipient), Vatsalan, D. (Recipient), Xue, E. (Recipient), Gupta, G. (Recipient), Sofronov, G. (Recipient), Baker, G. (Recipient), Liu, G. (Recipient), Asghar, H. (Recipient), Doosti, H. (Recipient), Zhu, H. (Recipient), Jiang, I. (Recipient), Zheng, J. (Recipient), Lin, H. (Recipient), Wu, J. (Recipient), Ma, J. (Recipient), Binkowski, K. (Recipient), Dras, M. (Recipient), Manuguerra, M. (Recipient), Orgun, M. (Recipient), Lay, M. (Recipient), Zou, N. (Recipient), Kordzakhia, N. (Recipient), Busch, P. (Recipient), Graham, P. (Recipient), Schwitter, R. (Recipient), Chen, S. (Recipient), Smith, S. (Recipient), Cassidy, S. (Recipient), Prvan, T. (Recipient), Fung, T. (Recipient), Li, Y. (Recipient), Wang, Y. (Recipient), Zhang, Y. (Recipient) & Zhou, Y. (Recipient), 2023Prize: Other distinction School Collaboration 100%",
  "content_length": 4999,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:07"
}