{
  "name": "Stephen F. Siegel",
  "homepage": "http://vsl.cis.udel.edu/siegel.html",
  "status": "success",
  "content": "VSL | Stephen F. Siegel Stephen F. Siegel’s Home Page About Me I am an associate professor in the Department of Computer and Information Sciences at the University of Delaware. I also hold a joint appointment in the Department of Mathematical Sciences. My research focuses on formal methods for software verification, with a particular emphasis on verification of parallel and scientific software. As a recovering mathematician (having worked in the cohomology and representation theory of finite groups), I am always looking for new applications of mathematics and logic to problems in computer science. I direct the Verified Software Laboratory, which conducts research and develops tools targeting the problems above. The CIVL Model Checker, a verifier for parallel scientific/HPC programs, is our flagship product. Our software, publications, and experimental artifacts are all available on the VSL web page. We are always looking for motivated undergraduate and graduate students to join our team. If you are interested, consider visiting us on one of the VSL Lab Days listed on the calendar below. See my publications on Google Scholar and read my blog. News I presented the paper Verifying PETSc vector components using CIVL (slides) at CAV 2025 in Zagreb, Croatia. The authors are VSL student Venkata Dhavala, Argonne's Jan Hückelheim and Paul Hovland, and me. I will be teaching CISC 404/604: Logic in Computer Science, Fall 2025. Class meets Tue/Thu 12:45–2:05 PM, Purnell Hall 328. This class is offered only once every 2 years so if you are interested in logic and all the amazing ways it interacts with computer science, sign up now! Ganesh Gopalakrishnan and I are organizing the first International Workshop on Verification of Scientific Software (VSS 2025). Consider submitting a paper (deadline Feb. 1, 2025) and/or attending (May 4, 2025, at ETAPS, McMaster University, Hamilton, Ontario, Canada). I am presenting a paper by Ziqing Luo and myself at CAV 2024 on Collective Contracts for Message-Passing Parallel Programs. I was a co-organizer of the DOE/NSF Workshop on Correctness in Scientific Computing, held at PLDI 2023. See our post-workshop report. Xavier Denis and I co-chaired the VerifyThis 2023 international program verification competition. See our competition report. If you can solve any of the challenges, definitely contact me about a research assistantship or postdoc. I presented a paper by Wenhao Wu, Jan Huckelheim, Paul Hovland, Ziqing Luo, and myself at CAV 2023 on Model Checking Race-Freedom When “Sequential Consistency for Data-Race-Free Programs” is Guaranteed. The CIVL Model Checker took second place at VerifyThis 2022! Service Program Committee, CAV 2025 Publication Chair, CAV 2025 Co-organizer, International Workshop on Verification of Scientific Software (VSS 2025) Organizing Committee, CoDaC: Correct Data Compression Workshop (at CAV 2024) Program Committee, SPIN 2024 Organizing Committee, DOE/NSF Workshop on Correctness in Scientific Computing (CSC 2023) Co-Chair, VerifyThis 2023 Program Committee, SPIN 2021 Program Committee, International Workshop on Software Correctness for HPC Applications (Correctness 2020) Associate Editor, IEEE Transactions on Software Engineering, 2015–2019 Program Committee, TACAS 2018 Program Committee, International Workshop on Software Correctness for HPC Applications (Correctness 2018) Program Committee, Technical Program, SC16 External Review Committee, PLDI 2014 External Review Committee, PPoPP 2014 Program Committee, NFM 2013 Program Committee, EuroMPI 2012 Program Committee, BOOGIE 2012 Program Committee, NSV-2011 Organizing Committee, Workshop on Exploiting Concurrency Efficiently and Correctly (EC)2, held at CAV, 2008–2012 Program Committee, Technical Program, systems area, SC10 Program Committee, Tutorials Program, SC09 Program Committee, EuroPVM/MPI 2009, EuroMPI 2010 Classes I Teach CISC 366/466: Independent Study. For undergraduate students who want to take part in the research of the VSL. Contact me if you are interested. CISC 372: Parallel Computing. MPI, OpenMP, Pthreads, CUDA, fundamental concepts of concurrency for both message-passing and shared-memory models. Here is a recent syllabus. Learn more about the course here. CISC 401/601: Elements of Theory of Computation. Recent syllabus. CISC 404/604: Logic in Computer Science. Recent syllabus. CISC 414/614: Formal Methods in Software Engineering. This class gives an overview of formal methods, with emphasis on practical applications of tools such as Alloy, Spin, and Frama-C. CISC 475/675: Software Engineering Principles and Practices. Recent syllabus. CISC 849 and 879: Advanced Topics. Topics have included Advanced Topics in Software Verification, Abstract Interpretation, Advanced Parallel Computing, and Model Checking. Recent syllabus (model checking). Contact Mailing Address: Department of Computer & Information Sciences 18 Amstel Ave 101 Smith Hall Newark, DE 19716 USA Office: Smith Hall, room 432 Office Hours: Fall 2024: by appointment Email: siegel@udel.edu Phone: +1 302 831 0083 Fax: +1 302 831 8458 Dela-where? Delaware is a small state on the east coast of the United States, in the “mid-Atlantic” region. It borders Maryland, Pennsylvania, and New Jersey. Most people have no idea where Delaware is, including most Americans. Delaware is known as “The First State” because it was the first state to ratify the U.S. Constitution, on Dec. 7, 1787. By this definition, Pennsylvania is “The Second State” (Dec. 12, 1787) and New Jersey is “The Third State” (Dec. 18, 1787). (Sorry, Rajeev Alur and Aarti Gupta.) Delaware (land area: 2,489 square miles) is not the smallest of the 50 states. That honor goes to Rhode Island (1,545 square miles). Delaware is the second smallest. We do have the least number of counties (3) of any state. I live in the charming city of Wilmington, Delaware, near the Aubrey Plaza Plaza, named for the most famous Wilmingtonian, the actress Aubrey Plaza, who really loves Wilmington. (The second most famous Wilmingtonian is Joseph R. Biden, Jr.) Wilmington was a critical stop on the Underground Railroad. Our beautiful riverfront features the Tubman-Garret Riverfront Park, a stop on the Harriet Tubman Byway. Inspiration On Work, from Khalil Gibran, The Prophet (1923) Then a ploughman said, Speak to us of Work. And he answered, saying: You work that you may keep pace with the earth and the soul of the earth. For to be idle is to become a stranger unto the seasons, and to step out of life’s procession, that marches in majesty and proud submission towards the infinite. When you work you are a flute through whose heart the whispering of the hours turns to music. Which of you would be a reed, dumb and silent, when all else sings together in unison? Always you have been told that work is a curse and labour a misfortune. But I say to you that when you work you fulfil a part of earth’s furthest dream, assigned to you when that dream was born, And in keeping yourself with labour you are in truth loving life, And to love life through labour is to be intimate with life’s inmost secret. But if you in your pain call birth an affliction and the support of the flesh a curse written upon your brow, then I answer that naught but the sweat of your brow shall wash away that which is written. You have been told also that life is darkness, and in your weariness you echo what was said by the weary. And I say that life is indeed darkness ‘save when there is urge, And all urge is blind save when there is knowledge, And all knowledge is vain save when there is work, And all work is empty save when there is love; And when you work with love you bind yourself to yourself, and to one another, and to God. And what is it to work with love? It is to weave the cloth with threads drawn from your heart, even as if your beloved were to wear that cloth. It is to build a house with affection, even as if your beloved were to dwell in that house. It is to sow seeds with tenderness and reap the harvest with joy, even as if your beloved were to eat the fruit. It is to charge all things you fashion with a breath of your own spirit, And to know that all the blessed dead are standing about you and watching. Often have I heard you say, as if speaking in sleep, “He who works in marble, and finds the shape of his own soul in the stone, is nobler than he who ploughs the soil. And he who seizes the rainbow to lay it on a cloth in the likeness of man, is more than he who makes the sandals for our feet.” But I say, not in sleep but in the overwakefulness of noontide, that the wind speaks not more sweetly to the giant oaks than to the least of all the blades of grass; And he alone is great who turns the voice of the wind into a song made sweeter by his own loving. Work is love made visible. And if you cannot work with love but only with distaste, it is better that you should leave your work and sit at the gate of the temple and take alms of those who work with joy. For if you bake bread with indifference, you bake a bitter bread that feeds but half man’s hunger. And if you grudge the crushing of the grapes, your grudge distils a poison in the wine. And if you sing though as angels, and love not the singing, you muffle man’s ears to the voices of the day and the voices of the night. Last modified: Sat Aug 2 11:00:22 CEST 2025",
  "content_length": 9367,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:51"
}