{
  "name": "Stephen A. Edwards",
  "homepage": "http://www.cs.columbia.edu/~sedwards",
  "status": "success",
  "content": "Prof. Stephen A. Edwards Stephen A. EdwardsHome Home Publications Presentations Software Classes Personal Contact Information sedwards@cs.columbia.edu +1 212 853 8344 +1 212 853 8440 (fax) 462 Computer Science Building 1214 Amsterdam Ave MC 0401 New York, NY 10027-7003 Curriculum Vitæ Now Teaching COMS 4995 005 Parallel Functional Programming Office Hours By appointment: email me The Sparse Synchronous Model: A deterministic real-time execution technique that allows explicit, precise timing control The Runtime System, described in our FDL 2020 paper SSLANG: An under-development language and compiler for describing sparse synchronous systems The GAPS CLOSURE Project The FHW Compiler: A compiler that translates a subset of the Haskell functional language into synthesizable System Verilog suitable for FPGAs. The Columbia Esterel Compiler Advanced 6502 Assembly Programming for the Apple II A presentation given at VCF West, August 1, 2020 Assembly Instructions and Firmware for an inexpensive Arduino robot car kit Apple2fpga: A reconstruction of an Apple II+ on a FPGA Some press: My Office • Actual Wisdom • Facebook Advice • CUPLA Reviews Advice for 3-2 Combined Plan CS Students Stephen A. Edwards is a tenured associate professor in the Computer Science Department of Columbia University. He obtained his Ph.D from the University of California, Berkeley in 1997, his MS from Berkeley in 1994, and his BS from the California Institute of Technology in 1992, all in Electrical Engineering. Before pursuing his academic career in 2001, he worked for two Electronic Design Automation (EDA) companies, Simplex Solutions, now part of Cadence, and Synopsys. Professor Edwards and his group explore automating the creation of software for embedded systems: application-specific computers hiding in a growing number of industrial and consumer systems. They have developed numerous compilation techniques for the Esterel synchronous language for real-time control and are also developing domain-specific languages for device drivers and communication protocols. My group does not offer internships, summer or otherwise. Consulting/Litigation Support/Expert Witness Services I have been engaged as an expert witness in various patent litigation cases involving software and computer architecture, including ITC cases. I am always interested to hear about new opportunities. My consulting CV: PhD Students John Hui, 2021-2024, now with Apple Max Levatich, 2020- Richard Townsend, 2013-2019, now with Tufts Nalini Vasudevan, 2007-2011, now with Google Marcio Buss, 2004-2008 Jia Zeng, 2002-2008 Cristian Soviani, 2002-2007, now with Synopsys Postdocs Olivier Tardieu, 2004-2006, now with IBM Relatives Brother, Ryan Edwards, UC Berkeley Wife, Nina Edwards, Illustrator",
  "content_length": 2769,
  "method": "requests",
  "crawl_time": "2025-12-01 14:31:44"
}