{
  "name": "Steven Whang 0001",
  "homepage": "http://stevenwhang.com",
  "status": "success",
  "content": "Data Intelligence Lab @ KAISTSearch this siteEmbedded FilesSkip to main contentSkip to navigationData Intelligence LabWelcome to the Data Intelligence Lab!Mission statement: to push the boundaries of data intelligence research and train the next leaders from KAIST The Data Intelligence Lab is pioneering the inevitable trend of Responsible/Trustworthy/Safe AI, Data-centric AI, and Big Data – AI Integration in all of machine learning including Large Language Models (LLMs). We work closely with the industry (Google Research, Microsoft Research, Samsung Research and Electronics, SK Hynix, and SK Telecom). Check out our vision paper Responsible AI Challenges in End-to-end Machine Learning (IEEE Data Eng. Bull '21) and a video summarizing our recent research.We are looking for highly-motivated Masters and PhD students. If you are interested in joining the DI Lab, please read this first. Here is a lab poster designed by my students, a list of recommended courses, a short article on conducting research with the KAIST Times (in Korean), and a video introducing of our lab (in Korean). Logo designed by Dayun Lee and studentsLatest News[2025/11] Fair Class-Incremental Learning using Sample Weighting and GradMix: Gradient-based Selective Mixup for Robust Data Augmentation in Class-Incremental Learning accepted to ACM SIGKDD 2026 (Top Data Mining conference). Congrats Jaeyoung Park, Minsu Kim, and Seong-Hyeon Hwang![2025/10] Gave a Tech Talk at Systems Research @ Google (SRG) titled Data-centric Responsible AI from General ML to LLMs[2025/10] Gave a Stanford CS145 (Intro to Big Data Systems) Guest Lecture titled Data-centric AI and Database Design: Knowing Your Data[2025/9] MIDAS: Misalignment-based Data Augmentation Strategy for Imbalanced Multimodal Learning accepted to NeurIPS 2025 (Top Machine Learning conference). Congrats Seong-Hyeon Hwang and So Young Choi![2025/9] Gave the keynote talk Data-centric Responsible AI from General ML to LLMs at the Data-driven AI (DATAI) workshop @ VLDB 2025.[2025/7] Started sabbatical as a Visiting Associate Professor at the Stanford University Computer Science department (host: Prof. Christopher Ré).[2025/6] Happy to be part of the creation of the Hector Garcia-Molina SIGMOD Distinguished Mentorship Award.[2025/4] SHAP-based Explanations are Sensitive to Feature Representation  accepted to ACM FAccT 2025 (Top AI ethics conference). Congrats Hyunseung Hwang! [2025/3] The IEEE Data Engineering Bulletin 2025 March Special Issue on Large Language Models and Data Systems is now available (I am the Associate Editor). [2025/3] Geon Heo will start his professional career at the Samsung Research AI Productivity team. Congrats and looking forward to a very bright future![2025/3] T-CIL: Temperature Scaling using Adversarial Perturbation for Calibration in Class-Incremental Learning accepted to CVPR 2025 (Top Computer Vision conference). Congrats Seong-Hyeon Hwang and Minsu Kim![2025/2] Suyeon Seong joined our lab. Welcome![2025/1] PFGuard: A Generative Framework with Privacy and Fairness Safeguards accepted to ICLR 2025 (Top Machine Learning conference). Congrats Soyeon Kim, Yuji Roh, and Geon Heo![2025/1] Two new videos (lab introduction and recent research) have been posted. [2024/12] Elected as a Y-KAST (Young Korean Academy of Science and Technology) member. Articles in Korean and English.[2024/12] Talked about ERBench (NeurIPS'24 Spotlight) on the Microsoft Research Abstracts podcast.[2024/10] Gave the talk Recent Advances in Data-centric Responsible AI and the NYU-KAIST Collaboration at the NYU Center for Responsible AI.[2024/10] Supported by a new Google Research Award for a year in collaboration with the Core ML team![2024/9] ERBench: An Entity-Relationship based Automatically Verifiable Hallucination Benchmark for Large Language Models accepted to NeurIPS 2024 (Spotlight ≈ Top-3% of all submissions; Top Machine Learning conference). Congrats Jio Oh, Soyeon Kim, and Junseok Seo![2024/8] Jaeyoung Park presented our Falcon paper at VLDB 2024 (Top Database conference), and Seong-Hyeon Hwang and Minsu Kim presented our RC-Mixup paper at ACM SIGKDD 2024 (Top Data Mining conference).[2024/7] Our lab attended the first Data Intelligence Workshop in Korea.[2024/6] Gave the keynote talk Towards a Holistic Framework for  Data-centric Responsible AI at the Guide-AI workshop @ ACM SIGMOD 2024.[2024/5] RC-Mixup: A Data Augmentation Strategy against Noisy Data for Regression Tasks accepted to ACM SIGKDD 2024 (Top Data Mining conference). Congrats Seong-Hyeon Hwang and Minsu Kim![2024/5] LEVI: Generalizable Fine-tuning via Layer-wise Ensemble of Different Views accepted to ICML 2024 (Top Machine Learning conference). Congrats Yuji Roh![2024/4] The IEEE Data Engineering Bulletin 2024 March Special Issue on Data-centric Responsible AI is now available. [2024/3] Seungjun Oh joined our lab. Welcome![2024/3] Promoted to Tenured Associate Professor.[2024/2] Ki Hyun Tae and Yuji Roh are the first Ph.D. graduates from our lab employed to Samsung Research and Google, respectively. Congrats and looking forward to a very bright future!Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 5175,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:48"
}