{
  "name": "Steven Sam",
  "homepage": "https://www.brunel.ac.uk/people/steven-sam",
  "status": "success",
  "content": "Dr Steven Sam | Introduction | Brunel University London Skip to Content Home People Dr Steven Sam Dr Steven SamLecturer in Computer Science Wilfred Brown Buillding 215 Email: steven.sam@brunel.ac.uk Tel: +44 (0)1895 266250 Computer Science College of Engineering, Design and Physical Sciences Summary Dr Steven Sam (PhD, FHEA) is an academic and researcher, focusing on computing for social good, data ethics and responsible AI, ICTs in society and Human-Computer Interaction (HCI). He earned his PhD from the University of Queensland (Australia), receiving the UQ Outstanding Higher Degree by Research Theses Dean’s Award in 2016. As the founder and co-leader of Computer Science for Social Good, he has led an interdisciplinary team dedicated to addressing societal challenges through research, innovation, and capacity-building. His work centres on advancing social and context-aware technology that addresses real-world issues and enhances positive societal impact. Steven has collaborated with academic institutions, industry partners, development agencies, and government bodies on innovative research projects in healthcare, agriculture, food systems and education particularly in Africa. In addition to his academic role, Steven is an experienced consultant, guiding organisations in the ethical design and deployment of responsible AI and data-driven technologies. His expertise spans ethical assessments, risk mitigation, compliance and regulation, responsible design, policy development and stakeholder training. He combines theory, practical experience and human-centred approaches to help clients create AI and data strategies that drive innovation, respect public trust and protect individual rights, guiding organisations through the ethical challenges of new technologies. Responsibility Founder and Co-Lead Computer Science for Social Good Research Group Co-Lead African Regional Working Group Department Admission Group Member Newest selected publications Ayebare, J. and Sam, S. (2026) 'The Socio-Technical Factors That Influence the Use of E-Participation in Rural Uganda'. Springer Nature Switzerland. pp. 19 - 35. ISSN: 0302-9743 Conference paper Abdulhamid, NG., Ogunyemi, A., Perry, M., Bauters, M., Rephisti, J., Sam, S., Maina, SC., Ocheing, M., Muchai, M., Nyairo, S., Gandhi, R. and O'Neill, J. et al. (2025) 'Advancing Sustainable Agricultural Practices in Africa with AI: Interdisciplinary Approaches to Inclusivity and Resilience'.Africhi 2025: The 5th Biennial African Human Computer Interaction Conference. ACM. pp. 415 - 418. Conference paper Ayebare, J. and Sam, S. (2025) 'A Multi-Dimensional E-Participation Model to Boost Public Confidence in Democracy in Rural Uganda: Participatory Approach'.2025 Eleventh International Conference on eDemocracy & eGovernment (ICEDEG). Bern, Switzerland. 18 - 20 June. IEEE. pp. 255 - 264. ISSN: 2573-2005 Open Access Link Conference paper Sam, S., Sengul, C., Bodini, A., Macauley, S. and Fasuluku, S. (2023) 'Participatory Co-Design of Wearable Solutions for Monitoring Infants in Remote Environments in Sierra Leone'.3rd Africa Digital Health Summit (ADHS 2023). Lagos, Nigeria. 22 - 23 June. Reports & Recommendations from the 3rd Africa Digital Health Summit (ADHS 2023). pp. 29 - 29.Open Access Link Conference paper Sam, S., Mostéfaoui, SK., Piccolo, L., Macauley, S. and Jalloh, T. (2022) 'Policy Brief: Designing a multisectoral user-centred technology system for tackling violence against women.'. Available at: https://zenodo.org/records/6957232#.Y6Lc8NXP1PY.Open Access Link Report More publications(25)",
  "content_length": 3588,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:44"
}