{
  "name": "Steven Holtzen",
  "homepage": "https://www.khoury.northeastern.edu/home/sholtzen",
  "status": "success",
  "content": "Steven Holtzen Assistant Professor Khoury College of Computer Sciences, Northeastern University. PhD. Computer Science, University of California, Los Angeles. Email: s.holtzen@northeastern.edu Office: West Village H Room 320 Address: Northeastern University Khoury College of Computer Sciences 320 West Village H 440 Huntington Avenue Boston, MA 02115 overview My research is at the intersection of programming languages and artificial intelligence. I am part of the Programming Research Laboratory at Northeastern University, and I guide the Northeastern Probabilistic Programming Laboratory (NeuPPL). Brief biography. I like designing systems that make probabilistic modeling fast, accessible, and useful for solving every day reasoning tasks. My research focuses on: The design, implementation, and applications of probabilistic programming languages. I am currently the lead developer for dice; see this blog post for more information. Foundations of probabilistic inference and tractable probabilistic modeling. Check out this paper on exploiting symmetry and this paper on unifying probabilistic circuits with determinantal point processes. My group develops rsdd, a high-performance implementation of tractable probabilistic models in rust. Automated reasoning and probabilistic verification; see this paper for our latest work on program logics for probabilistic program verification. news May 1, 2025 Roulette accepted to PLDI 2025. Mar 5, 2025 Congratulations Sam and John on the accepted OOPSLA paper Multi-Language Probabilistic Programming, and congratulations Minsung and John on his accepted OOPSLA paper Scaling Optimization Over Uncertainty via Compilation! Dec 31, 2024 Received the NSF Faculty Early Career Development (CAREER) Award. Thank you NSF! Apr 17, 2024 Congratulations John on his accepted LICS paper “A Nominal Approach to Probabilistic Separation Logic”, and congratulations Poorva on her accepted PLDI paper “Bit Blasting Probabilistic Programs”. Mar 20, 2024 I am excited to be lecturing at OPLSS in 2024 on probabilistic programming. Sep 5, 2023 I am co-organizing LAFI 2024 at POPL 2024 in London! Jul 3, 2023 Congratulations Minsung for his first-place finish in the PLDI 2023 Student Research Competition Mar 1, 2023 John Li’s paper Lilac: a Modal Separation Logic for Conditional Probability was accepted to PLDI 2023. Sep 5, 2022 I am co-organizing LAFI 2023 at POPL 2023 in Boston – please submit your work! Jul 1, 2022 New funding: We received an NSF Formal Methods in the Field (FMiTF) award for exploring separation logic and type systems for scaling probabilistic reasoning (co-PI: Amal Ahmed). Thank you NSF!",
  "content_length": 2653,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:34"
}