{
  "name": "Steve Cassidy",
  "homepage": "https://researchers.mq.edu.au/en/persons/steve-cassidy",
  "status": "success",
  "content": "Steve Cassidy - Macquarie University View Scopus Profile Steve Cassidy Associate Professor Honorary Associate Professor, School of Computing https://orcid.org/0000-0003-2357-9652 Phone+61 2 9850 9581Emailsteve.cassidymq.eduau h-index 455 Citations 10 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1993 …2025 Research activity per year Personal profile BiographyResearch data discovery, supporting reproducability, building accessible research tools for language sciences. Standards for linguistic annotation, annotation query, interoperability of langauge processing tools. Speech analysis, speech technology applications. Education/Academic qualificationHigher Education, Postgraduate Certificate, Macquarie UniversityAward Date: 1 Jan 2008Computer Science, PhD, A Computer Model of Reading Development, Victoria University of WellingtonAward Date: 1 Jan 1993Knowledge Based Systems, MSc, University of EdinburghAward Date: 1 Oct 1984Physics with Astrophysics, BSc. Honours, The University of LeicesterAward Date: 1 Oct 1983 Fingerprint Dive into the research topics where Steve Cassidy is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Annotation Computer Science 100% Virtual Laboratory Computer Science 57% Corpus Arts and Humanities 43% English Social Sciences 42% Communication Science Social Sciences 33% Named Entity Recognition Computer Science 25% Australian English Arts and Humanities 25% Learning System Computer Science 22% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2009 2010 2015 2016 2023 11 Finished Projects per year FAIMS 3.0 Electronic Field Notebooks: A platform for field research supporting digital data capture and management in diverse situationsRoss, S. (Primary Chief Investigator), Betbeder-Matibet, L. (Chief Investigator), Karskens, G. (Chief Investigator), Crook, P. (Chief Investigator), Stern, N. (Chief Investigator), Salmon, M. (Chief Investigator), Wyborn, L. (Chief Investigator), Sobotkova, A. (Chief Investigator), Klump, J. (Partner Investigator), Fraser, R. (Partner Investigator), Theil, S. (Partner Investigator), Robertson, K. (Partner Investigator), Lehner, J. (Chief Investigator), Heinson, G. S. (Chief Investigator), Parkes, R. (Partner Investigator), Flad, R. (Partner Investigator), VanValkenburgh, P. (Partner Investigator), Thompson, J. (Partner Investigator), Kansa, E. (Partner Investigator), Nicholson, C. (Chief Investigator), Aben, G. (Partner Investigator), Ballsun-Stanton, B. (Chief Investigator) & Cassidy, S. (Chief Investigator)30/06/20 → 30/03/23Project: Research Nectar funding for Alveo Phase III Software DevelopmentCassidy, S. (Primary Chief Investigator)14/10/16 → 29/11/16Project: Research Field Acquired Information Management Systems (FAIMS) Project (RAAP)Ross, S. (Primary Chief Investigator), Cassidy, S. (Chief Investigator), Sobotkova, A. (Chief Investigator) & Ballsun-Stanton, B. (Chief Investigator)25/05/16 → 31/12/18Project: Research HuNI and Alveo Virtual Lab use of Trove Digitised Newspaper collectionCassidy, S. (Primary Chief Investigator) & Verhoeven, D. (Chief Investigator)1/02/15 → 31/07/15Project: Research Community Engagement for Reproducable Workflow PlatformsCassidy, S. (Primary Chief Investigator), Abramson, D. (Chief Investigator), Ceguerra, A. (Chief Investigator), Manos, S. (Chief Investigator), Cook, R. (Chief Investigator) & Chen, G. (Chief Investigator)20/01/15 → 30/06/15Project: Research View all 11 projects Research Outputs Research output per year 1993 2001 2005 2007 2014 2017 2024 2025 2025 35 Conference proceeding contribution 11 Article 4 Chapter 3 Meeting abstract 10 More 3 Conference paper 2 Abstract 1 Edited Book/Anthology 1 Book 1 Paper 1 Software 1 Other contribution Research output per year Research output per year Analysis of students' GenAI prompts during a practical SQL testRamakrishnan, C., Cassidy, S. & Bower, M., 2025, Artificial Intelligence in Education: 26th International Conference, AIED 2025, Palermo, Italy, July 22–26, 2025, proceedings, part VI. Cristea, A. I., Walker, E., Lu, Y., Santos, O. C. & Isotani, S. (eds.). Cham: Springer, Springer Nature, p. 180-187 8 p. (Lecture Notes in Computer Science; vol. 15882).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Generative Artificial Intelligence 100% Structured Query Language 100% Artificial Intelligence 100% AI Tools 30% Test Environment 10% A support vector regression model can predict maximal mass lifted during a military manual materiel handling assessmentMcCarthy, A., Wills, J. A., Fuller, J. T., Cassidy, S., Nindl, B. C. & Doyle, T. L. A., 2025. 1 p.Research output: Contribution to conference › Abstract › peer-review Evaluating student performance and interactions in generative AI-integrated SQL practical testsRamakrishnan, C., Cassidy, S. & Bower, M., 2025, ITiCSE 2025: proceedings of the 30th ACM Conference on Innovation and Technology in Computer Science Education V. 2. New York: Association for Computing Machinery, p. 786 1 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Student Performance 100% Generative Artificial Intelligence 100% Structured Query Language 100% Artificial Intelligence 100% Best Practice 12% Predicting maximal military occupational task performance from physical fitness tests using machine learningMcCarthy, A., Wills, J. A., Fuller, J. T., Cassidy, S., Nindl, B. C. & Doyle, T. L. A., 1 Sept 2025, In: Medicine and Science in Sports and Exercise. 57, 9, p. 1877-1885 9 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Machine Learning 100% Learning System 100% Task Performance 100% Coefficient of Variation 100% Outcome Assessment 100% 1 Citation (Scopus) 13 Downloads (Pure) Strength, jump height, landing, and mobility metrics predict high and low performers of a fire and move assessment: a machine learning approachMccarthy, A., Fuller, J. T., Wills, J. A., Cassidy, S., Lovalekar, M., Nindl, B. C. & Doyle, T. L. A., 18 Jul 2025, (E-pub ahead of print) In: Medicine and Science in Sports and Exercise. 03822.Research output: Contribution to journal › Article › peer-review Predictive Model 100% Machine Learning Approach 100% Logistic Regression 100% Multilayer Perceptron 100% Random Decision Forest 100% View all 63 research outputs Prizes Highly Commended Finalist - Vice-Chancellor's Learning and Teaching - Teaching Excellence Award - 2024Cassidy, S. (Team leader), Ramakrishnan, C. (Recipient) & Roberts, M. (Recipient), 25 Nov 2024Prize: Teaching award Learning Experiences 100% Vice Chancellor 100% Teaching Excellence 100% Occupational Career 33% Educational Attendance 33% Winner - Faculty of Science and Engineering Award for Inter-School Collaboration - 2023Nayak, A. (Recipient), Mahmood, A. (Recipient), Beheshti, A. (Recipient), McIver, A. (Recipient), Bilgin, A. (Recipient), Liquet-Weiland, B. (Recipient), Svensson, C. (Recipient), Ramakrishnan, C. (Recipient), Smith, C. (Recipient), Molla-Aliod, D. (Recipient), Vatsalan, D. (Recipient), Xue, E. (Recipient), Gupta, G. (Recipient), Sofronov, G. (Recipient), Baker, G. (Recipient), Liu, G. (Recipient), Asghar, H. (Recipient), Doosti, H. (Recipient), Zhu, H. (Recipient), Jiang, I. (Recipient), Zheng, J. (Recipient), Lin, H. (Recipient), Wu, J. (Recipient), Ma, J. (Recipient), Binkowski, K. (Recipient), Dras, M. (Recipient), Manuguerra, M. (Recipient), Orgun, M. (Recipient), Lay, M. (Recipient), Zou, N. (Recipient), Kordzakhia, N. (Recipient), Busch, P. (Recipient), Graham, P. (Recipient), Schwitter, R. (Recipient), Chen, S. (Recipient), Smith, S. (Recipient), Cassidy, S. (Recipient), Prvan, T. (Recipient), Fung, T. (Recipient), Li, Y. (Recipient), Wang, Y. (Recipient), Zhang, Y. (Recipient) & Zhou, Y. (Recipient), 2023Prize: Other distinction School Collaboration 100%",
  "content_length": 8359,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:12"
}