{
  "name": "Steve Uhlig",
  "homepage": "http://www.eecs.qmul.ac.uk/~steve",
  "status": "success",
  "content": "Steve UhligProfessor of Networks & Head of SchoolSchool of Electronic Engineering and Computer ScienceQueen Mary, University of LondonPeter Landin Building, 10 Godward PlaceLondon E1 4FZUnited KingdomOffice: CS.311Phone: +44 (0)20 7882 5989Fax: +44(0)20 7882 7997E-mail: steve AT eecs.qmul.ac.ukGoogle scholar profileDBLP Research Publications Talks Student projects Short biography Steve Uhlig obtained a Ph.D. degree in Applied Sciences from the University of Louvain, Belgium, in 2004. From 2004 to 2006, he was a Postdoctoral Fellow of the Belgian National Fund for Scientific Research (F.N.R.S.). His thesis won the annual IBM Belgium/F.N.R.S. Computer Science Prize 2005. Between 2004 and 2006, he was a visiting scientist at Intel Research Cambridge, UK, and at the Applied Mathematics Department of University of Adelaide, Australia. Between 2006 and 2008, he was with Delft University of Technology, the Netherlands. Prior to joining Queen Mary, he was a Senior Research Scientist with Technische Universität Berlin/Deutsche Telekom Laboratories, Berlin, Germany. Starting in January 2012, he is the Professor of Networks and Head of the Networks Research group at Queen Mary, University of London. Between 2012 and 2016, he was a guest professor at the Institute of Computing Technology, Chinese Academy of Sciences, Beijing, China. He's currently the Head of School of Electronic Engineering and Computer Science, QMUL. Research interests: Internet measurements, Software-defined networking, Scalable data structures for networking, Content delivery, DNS Teaching · Applied Statistics (ECS764, semester A, 2020-2021, QMUL) · Internet Protocols and Applications (ECS524, semester B, 2019-2020, QMUL) Prospective students I am interested in students with timely and out-of-the-box ideas, at all levels (B.Sc., M.Sc., Ph.D.). As my main interest is evidence-based and typically measurements-driven research, you are expected to handle real and often large/complex datasets. Therefore, being proficient with programming languages such as Python, C(++), or Perl, is a must. As for PhD theses, most projects I supervise either involve measurements as well as real-world data, or deal with network engineering (e.g., using SDN). Only in very limited circumstances will simulations be considered, and only to complement observations from the real-world. For some random ideas about topics for projects or theses, please go to my “research” area to get a flavor of the type of topics you might want to work on. Team PhD students (current) · Kejue Cai Alumni · Dr. Zafar Gilani · Christos Nikolaou · Dr. Mohammad Mahdip Tajiki (Sky UK) · Eder Leao Fernandes (graduated 2020, Cloud Engineer at Platform.sh) · Timm Boettger (graduated 2019, Network Optimization Engineer at Facebook) · Jie Deng (graduated 2018, China Unicom) · Shan Huang (Mphil, graduated 2017) · Marjan Falahrastegar (graduated 2017) ·       Xueke Lu (graduated 2016, JP Morgan) · Hamed Saljooghinejad (Mphil, graduated 2016) ·       Ingmar Poese (graduated 2013, CTO at BENOCS) · Nadi Sarrar (graduated 2012, Data Scientist at TradeBlock) ·       Amir Mehmood (graduated 2012, Assistant Prof. at UET, Lahore, Pakistan) · Bingjie Fu (graduated 2009, Alcatel-Lucent) · Almerima Jamakovic (graduated 2008, Swisscom) PhD thesis committee member · Ondrej Tomanek (Czech Technical University in Prague, 2019): Multidimensional Cloud Latency Monitoring and Applications. · Martino Trevisan (Politecnico di Torino, February 2019): Big Data for Traffic Monitoring and Management. · Yves Vanaubel (Universite de Liege, October 2018): Revealing and Characterizing MPLS Networks. · Philipp Tiesel (Technische Universitat Berlin, March 2018): Multi-Path Aware Internet Transport Selection. · Philipp Richter (Technische Universitat Berlin, August 2017): Empirical Analysis of the Effects and the Mitigation of IPv4 Address Exhaustion. · Tobias Fiebig (Technische Universitat Berlin, June 2017): An Empirical Evaluation of Misconﬁguration in Internet Services. · Xuan-Nam Nguyen (INRIA, April 2016): The OpenFlow Rules Placement Problem: a Black Box approach. · Yi “Aaron” Ding (University of Helsinki, November 2015): Collaborative Traffic Offloading for Mobile Systems. ·      Alexandre Jaron (King's College London, November 2015): QoS-routing in Future All-IP Access Networks. · He Peng (Universite de Savoie/Chinese Academy of Sciences, May 2015): Design and Evaluation of High Performance Software-based Packet Classification Systems. · Haiyang Jiang (Universite de Savoie/Chinese Academy of Sciences, May 2015): Research on parallelization of network intrusion detection system. · Jordan Auge (Telecom ParisTech, France, November 2014): Flow-aware networking: garanties de performance pour le trafic IP. · Benjamin Frank (Technische Universitat Berlin, Germany, December 2013): Dynamic Content Delivery Infrastructure Deployment using Network Cloud Resources. ·       Doris Schioberg (Technische Universitat Berlin, Germany, November 2013): From online social network usage to the design of distributed online social networks. ·       Ingmar Poese (Technische Universitat Berlin, Germany, April 2013): Towards Collaborative Internet Content Delivery. ·       Peter Dely (Karlstad University, Karlstad, Sweden, December 2012): Architectures and Algorithms for Future Wireless Local Area Networks. · Nadi Sarrar (Technische Universitat Berlin, Germany, November 2012): On Workload-driven Router Designs. ·       Amir Mehmood (Technische Universitat Berlin, Germany, July 2012): Impact of Network Effects on Application Quality. ·       Stefano Vissicchio (Universita di Roma Tre, Italy, April 2012): Governing Routing in the Evolving Internet. · Virginie Van Den Schriek (Universite catholique de Louvain, Belgium, December 2010): Improving internal BGP routing. ·       Pedro Casals Hernandez (Telecom Bretagne, France, July 2010): Statistical analysis of network traffic for anomaly detection and Quality of Service provisioning. ·       Ashley Flavel (University of Adelaide, Australia, April 2009): BGP is not easy as 1, 2, 3. · Marc-Olivier Buob (Orange Labs/Leria, France, October 2008): Intra and inter-domain routing in core networks. ·       Anders Gunnar (licentiate thesis, KTH, Sweden, December 2007): Towards robust traffic engineering in IP networks. · Mickael Meulle (France Telecom R&D, April 2007): Inference of business relationships between Autonomous Systems. · Bamba Gueye (LIP6, France, December 2006): Geolocation of Internet hosts using multilateration. Professional activities · ACM/SIGCOMM member ·       Editor in Chief of ACM SIGCOMM Computer Communication Review (CCR) ·       ACM SIGCOMM Executive Committee member ·       Fellow of the Higher Education Academy (FHEA) ·       Steering committee member of the Passive and Active Measurement conference (PAM) ·       Steering committee member of the Traffic Monitoring and Analysis workshop (TMA) (2011-2016) · Co-organizer of Dagstuhl seminar on \"Critical Internet Infrastructure\", August 2013 & December 2017 ·       Guest editor of IEEE network magazine special issue (March/April 2008) on “Internet scalability: properties and evolution” ·       General chair: IMC 2017 SIGCOMM 2015 SIMPLEX 2011 PAM 2007 · TPC chair: IEEE ICNP 2019 IFIP Networking 2019 Global Internet Symposium 2019 ITC 2018 (Area 1) PAM 2017 SIGMETRICS shadow 2010 SIMPLEX 2009 & 2010 TMA 2011 & 2014 ·       Local organizer: 2014: TMA 2011: IMC 2010: SIMPLEX 2009: SIMPLEX ·       TPC member: 2022: SIGMETRICS, SIGCOMM, ICNP (area chair) 2021: SIGMETRICS, PAM, ICNP (area chair), IMC 2020: PAM, ICNP (area chair), ITC, Networking 2019: PAM, Networking (PC chair), Global Internet Symposium (PC chair), ITC 2018: PAM, Networking, SOSR, ICNP, Globecom, ITC, SecSoN 2017: INFOCOM, ITC (area 1 chair), SIGMETRICS, PAM, ICNP, ANRW, Globecom 2016: INFOCOM, Networking, ITC, Globecom, ICC, TRAC, NetSoft 2015: INFOCOM, Globecom, NetSoft, AINTEC, TRAC, EWSDN, IWCMC 2014: INFOCOM, CoNEXT, NETWORKING, IWQoS, TMA, EWSDN, TRAC 2013: CoNEXT, TMA, TRAC, NETWORKING, IWQoS, MPM, CsoNet, PADE, FhMN 2012: CoNEXT, NETWORKING, IWQoS, TMA, CCNC, SDN, MPM, TRAC, CNSM, PADE, EWSDN, COMPLEX, WASA-NGI 2011: IMC, CoNEXT, IWQoS, TRAC, DNS-EASY 2010: CoNEXT, IWQoS, TMA, TRAC, SIMPLEX, SIGMETRICS shadow 2009: TMA, COMPLEX, ALGOTEL, SIMPLEX 2008: PAM, GLOBECOM, NTMS 2007: INFOCOM, CoNEXT, PAM, NTMS 2006: PAM 2005: PAM Awards · Best paper at ACM SIGCOMM Internet Measurement Conference, 2011. · Annual IBM Belgium/F.N.R.S. Computer Science Prize, 2005. Patents · US Patent 20,120,314,575: Network traffic engineering. Benjamin Frank, Georgios Smaragdakis, Ingmar Poese, Anja Feldmann, Steve Uhlig. 2012. · US Patent 20,120,226,734: Collaboration between Internet Service Providers and Content Distribution Systems. Ingmar Poese, Georgios Smaragkdakis, Benjamin Frank, Anja Feldmann, Steve Uhlig. 2012. · EP Patent 2,495,940: Collaboration between an internet service provider (ISP) and a content distribution system as well as among plural ISP. Ingmar Poese, Georgios Smaragkdakis, Benjamin Frank, Anja Feldmann, Steve Uhlig. 2012. · EP Patent 2,355,423: System and method for routing data packets over an Internet Protocol network. Steve Uhlig, Anja Feldmann, Nadi Sarrar, Robert Sherwood. 2011.",
  "content_length": 9289,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:30"
}