{
  "name": "Steve Drew",
  "homepage": "https://denoslab.com",
  "status": "success",
  "content": "DENOS Lab A sunny day at DENOS Lab ICT Building, UCalgary The Distributed Edge LearNing and Orchestration Systems Lab was founded in 2021 by Dr. Steve Drew. DENOS Lab has the following research priorities: Federated Learning for Edge Service Orchestration With federated learning (FL) systems gaining wider adoption for privacy-preserving machine learning in such a a mixture of infrastructure, the heterogeneity is expected to cause lowered performance of the trained models with longer convergence time, leading to excessive energy consumption for both the cloud infrastructure and battery-powered edge IoT devices. Can carefully designed FL methods guide cloud-edge service orchestration to tackle these challenges? Our vision is to develop resilient, sustainable, and privacy-preserving distributed machine learning methods with the outlook of broader adoption of learning from distributed data repositories. Inspired by the challenge of computing node availability, we want to answer the research question with three significant new components that distinguish it from existing studies: novel models that dynamically budget FL client participation based on availability and carbon footprints from FL, innovative algorithms for FL task replication with minimal impact of data privacy and an original prototype service orchestration scheduler for evaluating the proposed methods in actual cloud-edge service orchestration. Federated Learning for Electrical Health Records (EHRs) Federated learning can be valuable for training machine learning models on electronic health records (EHR) data while preserving patient privacy and complying with regulatory requirements like HIPAA (Health Insurance Portability and Accountability Act). We aim to develop novel methods and prototypes. to address key challenges for better utilizing the knowledge from EHRs, including missing data, interoperability, and fairness. Students Guojun Tang (PhD Student) Hossein Khadem (PhD Student) Jiajun Wu (PhD Student) Yunkai Bao (PhD Student) Ali Abassi (MSc Student) Fan Dong (MSc Student) Leo Wei (MSc Student) News Apr 2023 Three of my graduate students teamed up and won the 3rd place of the CANIS Hackathon for Data Visualization. Congratulations, Leo, Yunkai, and Jiajun! It was an incredible opportunity for my students to work with misinformation data and explore new techniques. I want to thank Schulich Ignite for organizing this fantastic event. Apr 2023 My research group teamed up with Illidan Lab at Michigan State University and won the 3rd place in the U.S. Privacy-enhancing Technologies Prize Challenge. Our solution based on a secure federated learning method was profiled at the second Summit for Democracy, convened by U.S. President Joe Biden in March 2023. Congratulation, Fan Dong! Jan 2023 Our paper “UltraMotion: High-precision Ultrasonic Arm Tracking for Real-world Exercises” has been accepted to IEEE Transactions on Mobile Computing for publication. Jan 2023 Our paper “FedLE: Federated Learning Client Selection with Lifespan Extension for Edge IoT Networks” has been accepted to 2023 IEEE International Conference on Communications (ICC) for presentation. Congratulations to Jiajun Wu! Nov 2022 Our paper “USDNL: Uncertainty-based Single Dropout in Noisy Label Learning” has been accepted to Thirty-Seventh AAAI Conference on Artificial Intelligence (AAAI-23) for publication. Selected Publications JMLC MORE: Toward Improving Author Name Disambiguation in Academic Knowledge Graphs Gong, Jibing, Fang, Xiaohan, Peng, Jiquan, Zhao, Yi, Jinye, Zhao, Wang, Chenglong, Li, Yangyang, Jingyi, Zhang, and Drew, Steve Accepted to International Journal of Machine Learning and Cybernetics 2022 MASS’22 PPGC: A Path Planning System by Grid Caching based on Cloud-Edge Collaboration for USV Yan, Linjie, Chen, Haiming, Tu, Youpeng, Zhou, Xinyan, and Drew, Steve In The 19th IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2022) 2022 ICML’22 Resilient and Communication Efficient Learning for Heterogeneous Federated Systems Zhu, Zhuangdi, Hong, Junyuan, Drew, Steve, and Zhou, Jiayu In Proceedings of Thirty-ninth International Conference on Machine Learning (ICML 2022) 2022 IEEE Access Parked Vehicles Task Offloading in Edge Computing Nguyen, Khoa, Drew, Steve, Huang, Changcheng, and Zhou, Jiayu IEEE Access 2022 ICC’21 EdgePV: Collaborative Edge Computing Framework for Task Offloading Nguyen, Khoa, Drew, Steve, Huang, Changcheng, and Zhou, Jiayu In ICC 2021-IEEE International Conference on Communications 2021 AAAI’20 Shoreline: Data-Driven Threshold Estimation of Online Reserves of Cryptocurrency Trading Platforms Zhang, Xitong, Zhu, He, and Zhou, Jiayu In Proceedings of the AAAI Conference on Artificial Intelligence 2020 CloudNet’20 Collaborative Container-based Parked Vehicle Edge Computing Framework for Online Task Offloading Nguyen, Khoa, Drew, Steve, Huang, Changcheng, and Zhou, Jiayu In 2020 IEEE 9th International Conference on Cloud Networking (CloudNet) 2020 Blockchain’18 Distributed data vending on blockchain Zhou, Jiayu, Tang, Fengyi, Zhu, He, Nan, Ning, and Zhou, Ziheng In 2018 IEEE International Conference on Internet of Things (iThings) and IEEE Green Computing and Communications (GreenCom) and IEEE Cyber, Physical and Social Computing (CPSCom) and IEEE Smart Data (SmartData) 2018 Netsoft’18 Edgechain: Blockchain-based multi-vendor mobile edge application placement Zhu, He, Huang, Changcheng, and Zhou, Jiayu In 2018 4th IEEE Conference on Network Softwarization and Workshops (NetSoft) 2018 Globecom’17 Availability-aware mobile edge application placement in 5g networks Zhu, He, and Huang, Changcheng In GLOBECOM 2017-2017 IEEE Global Communications Conference 2017 ETT EdgePlace: availability-aware placement for chained mobile edge applications Zhu, He, and Huang, Changcheng Transactions on Emerging Telecommunications Technologies 2018 WCMC Iot-b&b: Edge-based nfv for iot devices with cpe crowdsourcing Zhu, He, and Huang, Changcheng Wireless Communications and Mobile Computing PIMRC’17 vNF-B&B: Enabling edge-based NFV with CPE resource sharing Zhu, He, and Huang, Changcheng In 2017 IEEE 28th Annual International Symposium on Personal, Indoor, and Mobile Radio Communications (PIMRC) 2017 VTC-Fall’17 Cost-efficient VNF placement strategy for IoT networks with availability assurance Zhu, He, and Huang, Changcheng In 2017 IEEE 86th Vehicular Technology Conference (VTC-Fall) 2017 Email is the preferred contact method.",
  "content_length": 6496,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:13"
}