{
  "name": "Steven L. Salzberg",
  "homepage": "https://salzberg-lab.org",
  "status": "success",
  "content": "Salzberg Lab – Computational biology and genomics @JHU Skip to content Search Search for: We are a computational biology lab that develops novel methods for analyzing DNA and RNA sequences, and that analyzes genomes to make biomedical discoveries. Our research includes software for aligning and assembling genomes, gene and transcriptome analysis, and microbiome analysis. We work closely with biomedical scientists to apply our methods to current problems arising in a broad spectrum of biological and medical research areas. We’re part of the Center for Computational Biology, a group of 20+ faculty members and their labs at Hopkins working on computational, statistical, and mathematical methods that can turn massive genomic data sets into biologically and clinically useful information. Research Project Areas. Our lab currently works in four related but distinct areas: Computational gene finding and genome annotation. We have been working for many years on methods to identify genes, ranging from methods for bacterial and human gene finding to the development of a new human gene database, called CHESS. You can read more about the CHESS project here. We also use AlphaFold2 and ColabFold to identify functional gene variants. We are also part of the T2T project that sequenced and published the first complete human genome, and we are currently working with the consortium to create comprehensive annotation of multiple humans. Transcriptome (RNA sequencing) analysis. Over the past 15 years, members of the lab along with our collaborators have developed multiple programs for RNA-seq analysis that have been adopted around the world. These include the Bowtie, TopHat, and Cufflinks programs, and more recently the HISAT and StringTie programs, with over 100,000 citations collectively. Together these programs align and assemble RNA sequencing data to reconstruct a detailed picture of all the genes and gene variants that are expressed in a tissue sample. The Bowtie project is led by CS Prof. Ben Langmead and the StringTie project is led by BME Prof. Mihaela Pertea. Metagenomics and microbiome analysis.  We have developed a variety of tools to analyze metagenomics data sets, including the widely-used Kraken, KrakenUniq, and Centrifuge systems. We have a special focus on using metagenomic sequencing to diagnose infections in human patients. Here’s a paper that describes one of our early efforts to use direct DNA sequencing to diagnose brain infections. We have also focused our efforts on re-evaluating recent claims of a cancer microbiome, some of which have turned out to be incorrect. Genome Assembly. We have developed genome assembly tools to use the latest generation of sequencing technologies, pushing the technology to take on ever-larger and more complex genomes, such as our recent projects assembling the genomes of the redwood and sequoia trees. We apply these methods in collaborations with biologists to sequence the genomes of species ranging from bacteria to plants and animals. See our Genome Projects page for a partial list of the many genomes we have assembled and published over the years. For a broader look at our software, see our software page or the the CCB website. Interested in joining the lab? The lab will be admitting students for the fall semester in 2026. For information about applying as a graduate student, please see this page. We do not admit students directly; we admit them through the Biomedical Engineering, Computer Science, and Biology Ph.D. programs, and you can apply to any of those. Be sure to mention your interest in this lab on your application. If you’re interested in a postdoctoral position, please write to Prof. Salzberg directly Looking for a summer intern position? We take a small number of undergraduate summer interns each year through the BDP HOUR program. To learn more, visit the HOUR website. (Note: the HOUR website will start taking applications in early 2026.) The Salzberg lab is supported in part by the NIH under grants R35-GM130151, R01-HG006677, and R01-MH123567, and in the past by multiple NSF grants. Lab newsOct 2025: New lab member! Harun Mustafa joins the lab as a postdoctoral fellow, joining us from his previous postdoc at ETH Zürich. Sept 2025: Lab member Peter Ge leads a major new paper in Science Translational Medicine debunking recent claims of a microbiome in cancer. Sept 2025: New lab member! Nikola Zadorozhny joins the Salzberg and Pertea labs as a Ph.D. candidate in Computer Science. Aug 26 2025: Kuan-Hao Chao successfully defends his Ph.D. thesis! Apr 2025: Postdoctoral fellow Ilia Minkin publishes a new analysis of splice site conservation across 470 mammals, in the journal Nucleic Acids Research. Jan 2025: Kuan-Hao Chao and 3 other lab members publish LiftOn, a new genome annotation system, in the journal Genome Research. Nov 2024: Hayden (Hyun Joo) Ji publishes a paper describing 100s of novel human exons found in upstream ORFs, in the journal PLoS Computational Biology. Sept 2024: Kuan-Hao Chao publishes a paper on Splam, a new, highly accurate splice site prediction program, in the journal Genome Biology. June 2024: New lab member! David Bass joins the lab as a Ph.D. candidate in Cell, Molecular, and Developmental Biology (CMDB). February 2024: Congratulations! to former postdoc Martin Steinegger, who was announced as the 2024 winner of the Overton Prize from ISCB. October 7 2023: In \"Major data analysis errors invalidate cancer microbiome findings\", published in mBio, we describe how a major cancer microbiome study was fatally flawed. October 4 2023: Our Nature paper on \"The status of the human gene catalog\", provides a broad look at how complete and accurate today's human annotation is. August 7 2023: Markus Sommer successfully defends his Ph.D. thesis! August 1 2023: Ales Varabyou successfully defends his Ph.D. thesis! Ales was jointly advised by Mihaela Pertea and Steven Salzberg. July 2023: A new paper in Nature Computational Science, led by Ales Varabyou, describes ORFanage, a system that finds protein-coding regions in RNA-seq assemblies, guided by annotation. Salzberg Lab Sign up Log in Copy shortlink Report this content Manage subscriptions",
  "content_length": 6209,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:37"
}