{
  "name": "Steve Oney",
  "homepage": "http://from.so",
  "status": "success",
  "content": "Spot Research Group Computer programming skills are becoming indispensable for a variety of professions. However, computer programming is often prohibitively difficult to learn or do correctly. Many programming languages and tools were designed around the needs and limitations of the computers executing code, which can lead to design features that are counterintuitive for the people who use those tools. We are a research group at the University of Michigan, primarily in the School of Information and Computer Science. Our research focuses on understanding the factors that make programming tools usable and designing & building new tools for programmers.News [+]Oct '24: Excited to welcome Dr. Maryam Arab as a new Postdoctoral Researcher!Jun '24: Congratulations to Dr. Lei Zhang on his wonderful Ph.D. defense!Jun '24: Ashley will be presenting her paper on representing code at scale at Learning @ Scale in Atlanta!Apr '24: Several group members (and alumni) will be in Hawaii for CHI 2024. Say \"hi\" if you're there!People [+]Steve OneyAssociate Professor Michigan SI & CSEMaryam ArabPostdoctoral Scholar Michigan SIAshley ZhangPh.D. Student Michigan SIJiacheng ZhangPh.D. Student Michigan SIXiangyu ZhouPh.D. Student Michigan CSERecent Publications [+]ConvoMap: Interactive Visualizations for Exploring Complex Conversations in Multi-Agent SystemsAshley Zhang, Victor Bursztyn, Gromit Chan, Shunan Guo, Eunyee Koh, Steve Oney, and Jane HoffswellA visualization system that helps developers understand and debug large collections of conversations between AI agents in Multi-Agent Systems (MASs). ConvoMap contains visualizations to show the flow of interactions between agents and the topics covered. ConvoMap allows MAS developers to spot behavioral patterns, trace errors, and compare outcomes at scale.VL/HCC 2025  PDFSPARK: Real-Time Monitoring of Multi-Faceted Programming ExercisesYinuo Yang, Ashley Zhang, Steve Oney, and April WangA dashboard for programming instructors that lets them monitor student progress on complex, multi-step programming exercises. SPARK lets instructors define checkpoints, automatically generates tests for each step, and visualizes progress across students. SPARK also enables inspection of intermediate outputs and runtime states to reveal common challenges and misconceptions.VL/HCC 2025  Honorable Mention  PDFCo-Advisor: Learning Programming Strategies in ContextMaryam Arab, Hanning Li, Rushal Butala, and Steve OneyA context-aware learning tool that helps programmers develop strategic problem-solving skills like debugging and program design. Integrated with Visual Studio Code, it analyzes the learner’s code, runtime state, and actions to recommend expert strategies tailored to a developer's context. As learners follow these strategies, Co-Advisor provides real-time feedback to make it easier for developers to understand strategic knowledge in context.VL/HCC 2025  PDFMulti-Click: Cross-Tab Web Automation via Action GeneralizationJiacheng Zhang, Jiawen Li, Maryam Arab, and Steve OneyProposes \"action generalization\"---a technique for applying the same action across multiple contexts automatically. Multi-click lets users select a \"generalization strategy\" to determine which elements a given action (e.g., click or text entry) will apply to within a given page or across multiple tabs. Unlike prior web automation tools, multi-click works at the *interaction* level, rather than requiring a separate script representation of automation macros, which can improve the directness and understandability of bulk actions.UIST 2025  PDF VRCopilot: Authoring 3D Layouts with Generative Models in VRLei Zhang, Jin Pan, Jacob Gettig, Steve Oney, and Anhong GuoA mixed-initiative tool for immersive 3D layout design in VR. It integrates generative AI to assist users in co-creating room layouts using voice commands, multimodal interactions, and wireframe-based representations. VRCopilot supports three modes: manual creation, automatic AI generation, and scaffolded creation with wireframes, balancing user control and automation.UIST 2024  PDFScrapeViz: Hierarchical Representations for Web Scraping MacrosRebecca Krosnick and Steve OneyA programming-by-demonstration tool that helps users create and visualize web scraping macros across multiple pages. ScrapeViz offers a visual storyboard of scraping behaviors, making it easier to understand, trace data sources, and identify errors. VL/HCC 2024  PDFCFlow: Supporting Semantic Flow Analysis of Students' Code in Programming Problems at ScaleAshley Zhang, Xiaohang Tang, Steve Oney, and Yan ChenIntroduces CFlow, a system for visualizing and analyzing large numbers of student code submissions to help instructors understand common mistakes and patterns. CFlow uses semantic labeling and code structure analysis to cluster code lines across submissions and present them in a visualization that resembles a single code sample, allowing instructors to see the overall semantic flow while still being able to dive into individual submissions.L@S 2024  Best Paper  PDFTowards Inclusive Source Code Readability Based on the Preferences of Programmers with Visual ImpairmentsMauli Pandey, Steve Oney, and Andrew BegelExplores the code readability preferences of blind and visually impaired (BVI) developers and how they differ from sighted developers, through a qualitative study. Contributes an inclusive taxonomy for code readability and recommendations for programming tools, code standards, and languages to better support BVI developers.CHI 2024  PDF\tRunEx: Augmenting Regular-Expression Code Search with Runtime ValuesAshley Zhang, Yan Chen, and Steve OneyA system that improves code search by augmenting regular expressions with the ability to specify constraints on runtime values of specific expressions.VL/HCC 2023  PDFVizProg: Identifying Misunderstandings by Visualizing Students' Coding ProgressAshley Zhang, Yan Chen, and Steve OneyVizProg is a tool that allows instructors of large programming classes to monitor students' progress at scale. It represents students' code in a 2D map where dots representing students move further to the right as they get closer to a correct solution. VizProg uses vertical space to represent different approaches to solving the problem (so students towards the bottom of the map are using a different approach than students at the top of the map).CHI 2023  Honorable Mention  PDFVRGit: A Version Control System for Collaborative Content Creation in Virtual RealityLei Zhang, Ashutosh Agrawal, Steve Oney, and Anhong GuoA version control system designed especially for Virtual Reality (VR). VRGit allows users to view and navigate the version history of a 3-D scene while immersed in VR. It also allows users to share and discuss history graphs collaboratively.CHI 2023  PDFColaroid: A Literate Programming Approach for Authoring Explorable Multi-Stage TutorialsApril Wang, Andrew Head, Ashley Zhang, Steve Oney, and Christopher BrooksColaroid is an extension to the Visual Studio Code IDE that makes it easier to create mutli-step tutorials about a large code sample. Developers can write their code in the IDE and as they are writing their code, Colaroid allows them to divide their work into steps. Colaroid tutorials are augmented computational notebooks, where snippets and outputs represent a snapshot of a project, with source code differences highlighted, complete source code context for each snippet, and the ability to load and tinker with any stage of the project in a linked IDE.CHI 2023  Honorable Mention  PDFParamMacros: Creating UI Automation Leveraging End-User Natural Language ParameterizationRebecca Krosnick and Steve OneyParamMacros is a PBD system where users specify a natural language question about a website. ParamMacros then leverages the DOM structure to help generalize and parameterize to similar natural language questions.VL/HCC 2022  PDFAccessibility of UI Frameworks and Libraries for Programmers with Visual ImpairmentsMauli Pandey, Sharvari Bondre, Sile O'Modhrain, and Steve OneyTwo studies into the accessibility and challenges of developing interfaces with UI frameworks and libraries. Accessibility barriers in programming tools and UI frameworks can complicate the processes of writing UI code, debugging, testing, and collaborating with sighted colleagues. This paper presents recommendations grounded in empirical findings to improve the accessibility of frameworks and libraries.VL/HCC 2022  PDF PuzzleMe: Leveraging Peer Assessment for In-Class Programming ExercisesApril Wang, Yan Chen, John Chung, Christopher Brooks, and Steve OneyA tool that enhances in-class programming exercises by (1) enabling students to write unit tests that can be shared with the rest of the class (and used to test other students' code), (2) enables peer code reviews where students are intelligently grouped with other students to perform code reviews. PuzzleMe is intended for introductory classes and also includes a design to make testing more lightweight. CSCW 2021  PDFUnderstanding Accessibility and Collaboration in Programming for People with Visual ImpairmentsMauli Pandey, Vaishnav Kameswaran, Hrishikesh Rao, Sile O'Modhrain, and Steve OneyA study into how programmers with visual impairments work in the context of programming teams. We describe how some collaborative practices can impede collaboration and required invisible work and articulation work on the part of the programmers with visual impairments.CSCW 2021 Recognition for Contribution to Diversity and Inclusion  PDFUnderstanding the Challenges and Needs of Programmers Writing Web Automation ScriptsRebecca Krosnick and Steve OneyTwo studies to better understand the challenges of writing web automation code (particularly the kinds of context and feedback that are helpful when writing web automation code).VL/HCC 2021  PDFThink-Aloud Computing: Supporting Rich and Low-Effort Knowledge CaptureRebecca Krosnick, Fraser Anderson, Justin Matejka, Steve",
  "content_length": 14899,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:22"
}