{
  "name": "Steven Salzberg",
  "homepage": "https://engineering.jhu.edu/faculty/steven-salzberg",
  "status": "success",
  "content": "Steven Salzberg - Johns Hopkins Whiting School of Engineering Contact 410-516-8246 salzberg@jhu.edu Location S261 Wyman Park Building Connect Google Scholar Lab Website Twitter Website Research Areas Biomedical data science Genomics and systems biology Steven L. Salzberg is the Bloomberg Distinguished Professor of Computational Biology and Genomics. He is also the director of the Center for Computational Biology in the Whiting School of Engineering and holds an affiliate appointment in the Department of Genetic Medicine at the School of Medicine. The Salzberg Lab studies computational biology and genomics, focusing on the development of new computational methods for DNA analysis from the latest sequencing technologies. Salzberg’s team has developed and applied software to many problems in gene finding, genome assembly, comparative genomics, evolutionary genomics, and sequencing technology itself. The lab’s current work emphasizes the analysis of DNA and RNA sequenced with next-generation technology. Salzberg is a fellow of the American Association for the Advancement of Science (elected 2004), and the International Society for Computational Biology (elected 2013), and the ACM (elected 2020). He was elected to the American Academy of Arts and Sciences in 2018 and in 2020 he received the Accomplishment by a Senior Scientist Award from the ISCB. He has been named a Highly Cited Researcher, a list of the 1% most-cited researchers in their fields, in 2001 and for every year since 2014. Salzberg earned a master’s degree in computer science from Yale University in 1984 and completed his PhD in computer science at Harvard University in 1989. Related News View All News In Extensive Sequencing Study, Scientists Find Few Links Between Cancer and Microbiome Categories Research Large-scale genome study finds scant evidence connecting microbes to most cancers. New AI Tool Pinpoints Gene Splicing with Unmatched Precision Categories Research AI/Data Science Johns Hopkins’ innovation enables deeper insights into gene function and disease-linked mutations. Expert: It’s time to stop creating ‘superbugs’ in the lab Categories School News Johns Hopkins computational biologist Steven Salzberg says controversial Boston University study that created a potentially deadly form of the omicron coronavirus variant should never have happened Site Menu Search Submit Close ﻿",
  "content_length": 2385,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:44"
}