{
  "name": "Steven Kelk",
  "homepage": "http://skelk.sdf-eu.org",
  "status": "success",
  "content": "Steven Kelk's homepage Steven Kelk's homepage I am an Associate Professor at the Department of Department of Advanced Computing Sciences (formerly Data Science and Knowledge Engineering) at Maastricht University in the Netherlands, where I am the area coordinator of the Algorithms (formerly Algorithms, Complexity and Optimization (ALGOPT)) group. I am also the contact person at Maastricht for, and acting chair of, the Dutch discrete mathematics cluster DIAMANT (a current list of DIAMANT members at Maastricht can be found at the start of this presentation). My contact details are here. I was vice-chair of the Maastricht Young Academy (MYA) from 2017-2019. Between 2004 and 2010 I was a postdoc in the Life Sciences cluster of the Centrum voor Wiskunde en Informatica (CWI) in Amsterdam, in the subgroup Combinatorial Problems in Biology. I obtained my PhD in late 2003 from the Algorithms and Computational Complexity Research Group at the University of Warwick. My supervisor was Leslie Goldberg. My main research interests are graph theory, phylogenetics, fixed parameter tractability, combinatorics, algorithm engineering, computational biology and (more recently) formalisation of mathematics and automated theorem proving. Here is a short video from a few years ago about my research. Outside university I am active on issues relating to public services and social justice, particularly housing and education, and I am a board member of Housing Association Soweto. In 2024 I signed these statements (1,2) concerning the suffering of the Palestinians in Gaza. Maastricht students: I am also available for bachelor and masters projects, see these slides for my preferred generic research topics. More detailed topics will be announced each year via the Bachelor/Master thesis coordinators. 2018 Lorentz workshop: The Future of Phylogenetic Networks 15 – 19 October 2012 Leiden, Netherlands Scientific organizers: Leo van Iersel (Amsterdam) Steven Kelk (Maastricht) David Morrison (Uppsala) Leen Stougie (Amsterdam) Follow-up in July 2014! Click image below: The Dutch Day on Optimization was held on 9th November 2023 in Maastricht, see this webpage. There is a news item here and there are some photos here. Publications/Papers See also my Google Scholar and DBLP pages -- note that DBLP only indexes my computer science publications, some bio(informatics) and math publications are missing. There is also a PDF of all my publications with full bibliographical information here (updated June 2025). IMProofBench: Benchmarking AI on Research-Level Mathematical Proof Generation, Johannes Schmitt and many others (I contributed a benchmark problem), September 30th 2025. To appear in the 5th Workshop on Mathematical Reasoning and AI at NeurIPS 2025 (MATH-AI). My contribution to this article has its origins in my attendance of the Lorentz workshop on Mechanization and Mathematical Research in September 2025. An inspiring and extremely timely workshop. A branch-&-price approach to the unrooted maximum agreement forest problem, Martin Frohn, Steven Kelk and Simona Vychytilova. Submitted 5 october 2024, to appear in Operations Research Letters 2025. Bounding the SNPR distance between two tree-child networks using generalised agreement forests. Steven Kelk, Simone Linz and Charles Semple, submitted 12th March 2025, to appear in the Electronic Journal of Combinatorics 2025. Very happy that on July 3rd 2025 my PhD student Ruben Meuwese succesfully defended his PhD thesis! The thesis is available here. Coconvex characters on collections of phylogenetic trees. Eva Czabarka, Steven Kelk, Vincent Moulton and Laszlo A. Szekely, to appear in Advances in Applied Mathematics 2025 (journal version). A strengthened bound on the number of states required to characterize maximum parsimony distance, Mareike Fischer, Steven Kelk and Sofia Vazquez Alferez, submitted 5th June 2025. Reconstructing semi-directed level-1 networks using few quarnets, Martin Frohn, Niels Holtgrefe, Leo van Iersel, Mark Jones, Steven Kelk. Submitted 9th September 2024. Accepted 13th March 2025: to appear in Journal of Computer and System Sciences 2025. A 2-approximation algorithm for the softwired parsimony problem on binary, tree-child phylogenetic networks, Martin Frohn and Steven Kelk, submitted 10th October 2023, to appear in Annals of Operations Research 2025. (This is a primal-dual approximation algorithm -- there are not that many in phylogenetics!) The version on arXiv is the accepted version. Split-or-decompose: Improved FPT branching algorithms for maximum agreement forests. David Mestel, Steven Chaplick, Steven Kelk and Ruben Meuwese. 26th September 2024. Submitted to journal March 2025. I gave a talk about this at the Dutch Days of Combinatorics 2025, the slides can be found here. Approximation Ratio of the Min-Degree Greedy Algorithm for Maximum Independent Set on Interval and Chordal Graphs, Steven Chaplick, Martin Frohn, Steven Kelk, Johann Lottermoser, Matus Mihalak, submitted 15th March 2024. To appear in Discrete Applied Mathematics 2025, link. Invariants for level-1 phylogenetic networks under the random walk 4-state Markov model, M. Frohn, N. Holtgrefe, L. van Iersel, M. Jones, and S. Kelk, submitted 16th July 2024. Agreement forests of caterpillar trees: complexity, kernelization and branching. Steven Kelk and Ruben Meuwese, to appear in Theoretical Computer Science (2024). Deep kernelization for the Tree Bisection and Reconnnect (TBR) distance in phylogenetics. Steven Kelk, Simone Linz and Ruben Meuwese, 9th June 2022. To appear in Journal of Computer and System Sciences, 2024. I gave a presentation about this work to the Algorithms group at the University of Utrecht in June 2022: Utrecht_Kelk_2022_Web_Version.pdf. It describes (only) the high-level idea behind the reduction rules. An even shorter (15 minute) version of the talk was given at the \"Emerging Mathematical Frontiers in Molecular Evolution\" workshop at the Institut Mittag-Leffler in Sweden in August 2022. Here are the slides. There is a video of this talk here. Convex characters, algorithms and matchings, Steven Kelk, Ruben Meuwese and Stephan Wagner, submitted late November 2021. To appear in SIDMA, September 2023. I gave a presentation about this at the DIAMANT Autumn Symposium 2022, the slides are here. There is a PDF of the accepted version of the article here. Relaxed agreement forests. Virginia Aardevol Martinez, Steven Chaplick, Steven Kelk, Ruben Meuwese, Matus Mihalak, Georgios Stamoulis, pre-print 1 september 2023, to appear in SOFSEM 2024. There is accompanying code and data here. An expaned version has been submitted to Journal in early September 2024. Snakes and ladders: a treewidth story. Steve Chaplick, Steven Kelk, Ruben Meuwese, Matus Mihalak, Georgios Stamoulis. Pre-print released February 2023. To appear at the conference WG2023. (As a spin-off, this proves that the common chain reduction applied to two unrooted trees preserves treewidth in the display graph, resolving an open question mentioned here). Cyclic generators and an improved linear kernel for the rooted subtree prune and regraft distance, Steven Kelk, Simone Linz, Ruben Meuwese, submitted February 21st 2022. To appear in Information Processing Letters (accepted October 2022). An improved kernel for the flip distance problem on simple convex polygons, Miguel Bosch Calvo and Steven Kelk, May 2022. To appear in Information Processing Letters 2023. A preliminary, shorter version (without experiments) appeared in the Canadian Conference on Computational Geometry 2021. Proceedings are here. New FPT algorithms for finding the temporal hybridization number for sets of phylogenetic trees, Sander Borst, Leo van Iersel, Mark Jones, Steven Kelk, July 2020. Accepted January 2022: to appear in Algorithmica. Applicability of several rooted phylogenetic network algorithms for representing the evolutionary history of SARS-CoV-2, Rosanne Wallin, Leo van Iersel, Steven Kelk and Leen Stougie, to appear in BMC Biology and Evolution, link Reflections on kernelizing and computing unrooted agreement forests. Rim van Wersch, Steven Kelk, Simone Linz and Georgios Stamoulis, 14th December 2020. To appear in Annals of Operations Research 2022. There is some supporting data/code here, including the lower-bounds-via-sampling code. A copy of Tubro is available on request. Sharp upper and lower bounds on a restricted class of convex characters, Steven Kelk and Ruben Meuwese, submitted 22nd July 2021. To appear in Electronic Journal of Combinatorics, 2022, DOI: https://doi.org/10.37236/10589 There is a video talk here about this paper, given as part of the online seminar on algorithms and complexity in phylogenetics. The slides are here. A modified Integer Linear Programming formulation for the construction of classification trees, Van Dijk et al, unpublished manuscript, march 2021. This blog posting by Rosanne Wallin, Leo van Iersel, Mark Jones, myself and Leen Stougie summarizes the MSc work of Roseanne Wallin, in which she constructs rooted phylogenetic networks for SARS-CoV-2. November 16th 2020. Short opinion piece: \"Phylogenetics and parameterized complexity\" in the October 2020 edition of the Parameterized Complexity newsletter. In July 2020 I was awarded an NWO KLEIN 1 grant for 1 PhD student to work on kernelization in phylogenetics. Formal recruitment has begun, please apply here. Informal queries from (serious) candidates are welcome. The main goal of the project is to extend the work in the 'New reduction rules for the tree bisection and reconnection distance' article, below. Update 22nd December 2020: The position has now been filled. New reduction rules for the tree bisection and reconnection distance, Steven Kelk and Simone Linz, Annals of Combinatorics (2020), DOI Here is a presentation about this work that I gave at Oxford Computer Science department in June 2019. I gave a talk about this work - and empiricial experiments - at the Algorithms and C",
  "content_length": 33631,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:38"
}