{
  "name": "Steven L. Franconeri",
  "homepage": "https://psychology.northwestern.edu/people/faculty/core/profiles/steven-franconeri.html",
  "status": "success",
  "content": "Steven Franconeri: Department of Psychology - Northwestern University Skip to main content HomePeopleFacultyCore FacultyProfilesSteven Franconeri Steven FranconeriProfessorCurriculum Vitaefranconeri@northwestern.eduWebsite847-467-1259Swift 317Research Interests We study visual thinking and communication: how it works, and how we can make it work better. At our Visual Thinking Laboratory, a team of researchers explore how leveraging the visual system - the largest single system in your brain - can help people think, remember, and communicate more efficiently. Our basic research is inspired by real-world problems, guiding our laboratory toward the most interesting theoretical questions, while producing results that translate directly to science, education, design, and industry. Selected Publications (See lab page for all publications) Franconeri, S. L., Padilla, L. M., Shah, P., Zacks, J. M., & Hullman, J. (2021). The Science of Visual Data Communication: What Works. Psychological Science in the Public Interest, 22(3), 110–161. https://doi.org/10.1177/15291006211051956 Franconeri, S. L. (2021). Three Perceptual Tools for Seeing and Understanding Visualized Data. Current Directions in Psychological Science.Franconeri, S. L., Padilla, L. M., Shah, P. D., Zacks, J. M., Hullman, J. (2021). The Science of Visual Data Communication: What Works. Psychological Science in the Public Interest.Dimara, E., Zhang, H., Tory, M., Franconeri, S. (2021). The Unmet Data Visualization Needs of Decision Makers within Organizations. IEEE Transactions on Visualization and Computer GraphicsXiong, C., van Weelden, L., Franconeri, S. (2019). The Curse of Knowledge in Visual Data Communication. IEEE Transactions on Visualization and Computer Graphics. Lovett, A. Franconeri, S. L. (2017). Topological Relations Between Objects Are Categorically Coded. Psychological Science.Xu, Y., Franconeri S. L. (2015). Capacity for Visual Features in Mental Rotation. Psychological Science. Office Access For our updated office hours, visit our contact page below View our office Hours Close",
  "content_length": 2081,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:38"
}