{
  "name": "Steven J. Zeil",
  "homepage": "http://www.cs.odu.edu/~zeil",
  "status": "success",
  "content": "Steven J Zeil home page Dr. Steven J. Zeil Associate Professor, Old Dominion University Ph.D., 1981, Ohio State University Contact Information Office: E&CS 3208 Phone: (757) 683-4928 E-mail: zeil@cs.odu.edu Office hours and Appointments Research My research interests in the past have focused on software testing and reliability measurement. More recently, I have been focussing on issues in distance learning and in digital libraries: Some of my projects are Extract: metadata extraction from large document collections AlgAE - an algorithm animation engine for computer science instruction. Reliability Growth During Non-Representative Testing Knowledge-Based Refinement During Testing Perturbation Testing Teaching Current and Recent Courses Students enrolled in my courses can access the course materials through ODU's Canvas system. Students thinking of enrolling in one of my course can use the links below to access the course syllabus. Upcoming courses may link to earlier syllabi until I have set up that semester's website, particularly if I do not anticipate much in the way of policy changes. SemesterCourseSyllabus Fall 2025: CS 260, C++ for Programmers syllabus CS 261, Java for Programmers syllabus CS 350, Software Engineering syllabus CS 355, Principles of Programming Languages syllabus Summer 2025: CS 252, Introduction to Unix for Programmers syllabus CS 361, Advanced Data Structures and Algorithms syllabus Spring 2025: CS 260, C++ for Programmers syllabus CS 261, Java for Programmers syllabus CS 350, Software Engineering syllabus CS 355, Principles of Programming Languages syllabus Many of my courses are distance learning courses offered on-line. If you are trying to register for one of these and have questions or problems getting registered, please read my Distance Learning Registration FAQ. Course Websites Students are welcome to peruse my course websites at any time. These sites typically provide access to all lecture notes, slides, readings, and ungraded labs. CourseWebsite from: CS 250, Problem Solving and Programming II Fall 2014 CS 252, Introduction to Unix for Programmers Summer 2025 CS 330, Object-oriented Programming and Design Fall 2019 CS 333, Problem Solving and Programming in C++ Summer 2017 CS 350, Introduction to Software Engineering Spring 2025 CS 361, Advanced Data Structures and Algorithms Summer 2025 CS 382, Introduction to Java Fall 2022 CS 390, Introduction to Theoretical Computer Science Spring 2025 CS 795/895, Devops, Containers, & the Cloud Fall 2020 CS 795/895, Software Development Spring 2013 CS 795/895, Software Reliability Spring 2012 CS 795/895, Machine Learning Fall 2010 For Dept. Faculty Only Tools for web courses GTA assignments (includes work in progress) In my Spare Time Making music... St. Nicholas Choir Autoharp Hammer Dulcimer Guitar",
  "content_length": 2820,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:37"
}