{
  "name": "Steven Bedrick",
  "homepage": "http://www.ohsu.edu/xd/education/schools/school-of-medicine/departments/basic-science-departments/csee/csee-people/bedrick.cfm",
  "status": "success",
  "content": "Steven D. Bedrick Ph.D. | OHSU People | OHSU Biography My work falls into two broad areas of work: Applying speech and language technologies to problems relating to communication disorders, both in terms of assessment as well as Augmentative and Alternative Communication applications Automated analysis of scientific literature and electronic medical record data Research Interests From a clinical perspective, my research interests include: Patient cohort discovery from electronic medical records Information extraction and data mining in free-text clinical notes Automated summarization of clinical text, both for providers and for patients Automated approaches to screening for and otherwise assessing language and communication disorders, both in pediatric and adult populations Language deficits in post-stroke aphasia Confrontation naming tests Autism Spectrum Disorder Augmentative and alternative communication Automation to support systematic reviews and evidence-based medicine Brain-computer interfaces for communication From a computational perspective, my research interests include: Evaluation of machine learning algorithms, particularly including large language models Information retrieval Text normalization Computational analysis of dialogues & discourse Vector-space models of lexical and document semantics Hierarchical and temporal document representations Human-computer interaction Language modeling (including both classical finite-state approaches as well as modern neural methods) CS curriculum development From both perspectives, I also have a strong research interest in the societal and ethical implications that arise from speech and language technology, particularly regarding healthcare. Education As an instructor in the Biomedical Informatics graduate program, I teach the following courses: BMI 5/625 Principles and Practice of Data Visualization CS 562/662 Natural Language Processing I also carry out ad hoc educational activities around a wide range of informatics topics at OHSU via workshops, guest lectures, etc. Areas of interest Natural Language Processing Information Retrieval Data Visualization Assistive Technology Augmentative & Alternative Communication Aphasia Machine Learning and Artificial Intelligence Publications Publications",
  "content_length": 2284,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:29"
}