{
  "name": "Steven Chamberland",
  "homepage": "https://www.polymtl.ca/expertises/chamberland-steven",
  "status": "success",
  "content": "Chamberland, Steven | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Chamberland, Steven Poly Bottin Cours English Répertoire des expertises Chamberland, Steven Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Steven Chamberland B.Ing. (Polytechnique), MBA (McGill) (HEC Montréal), MIR (Queen's), Ph.D. (Montréal) (Polytechnique) Publications Professeur titulaire Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 2996 Téléc. : (514) 340-5139 Local : M-6111 steven.chamberland@polymtl.ca Domaines d'expertise Recherche opérationnelle et science de la gestion Optimisation Modélisation mathématique Télécommunications mobiles et personnelles Intérêts de recherche et affiliations Intérêts de recherche Conception et planification des réseaux Architecture des réseaux Gestion et optimisation des réseaux Affiliation(s) Laboratoire de recherche en réseautique et informatique mobile (LARIM), Membre Type(s) d'expertises (sujets CRSNG) 1601 Recherche opérationnelle et science de la gestion 2521 Télécommunications mobiles et personnelles 2715 Optimisation 2960 Modélisation mathématique Publications Publications récentes Article de revue Falahatraftar, F., Pierre, S., & Chamberland, S. (2023). An intelligent congestion avoidance mechanism based on generalized regression neural network for heterogeneous vehicular networks. IEEE Transactions on Intelligent Vehicles, 8(4), 3106-3118. Article de revue Elgaroui, L., Pierre, S., & Chamberland, S. (2023). New routing protocol for reliability to intelligent transportation communication. IEEE Transactions on Mobile Computing, 22(4), 2281-2294. Article de revue Falahatraftar, F., Pierre, S., & Chamberland, S. (2021). A centralized and dynamic network congestion classification approach for heterogeneous vehicular networks. IEEE Access, 9, 122284-122298. Article de revue Falahatraftar, F., Pierre, S., & Chamberland, S. (2021). A conditional generative adversarial network based approach for network slicing in heterogeneous vehicular networks. Telecom, 2(1), 141-154. Voir toutes les publications (111) Enseignement INF3405 Réseaux informatiques INF6470 Conception et planification des réseaux informatiques INF6900 Communication scientifique et technique I INF7900 Communication scientifique et technique II Encadrement à Polytechnique TERMINÉ Thèse de doctorat (8) El Garoui, L. (2021). Approches de routage basées sur les technologies émergentes SDN et IoT pour les environnements intelligents [Thèse de doctorat, Polytechnique Montréal]. Falahatraftar, F. (2021). Congestion Prediction and Avoidance Mechanisms for Heterogeneous Vehicular Networks [Thèse de doctorat, Polytechnique Montréal]. Jaramillo Herrera, R. (2016). Reliable, Context-Aware and Energy-Efficient Architecture for Wireless Body Area Networks in Sports Applications [Thèse de doctorat, École Polytechnique de Montréal]. Lemamou, E. A. (2014). Planification globale des réseaux mobiles de la quatrième génération (4G) [Thèse de doctorat, École Polytechnique de Montréal]. Abou-Khalil, G. (2013). Support des applications multimédia dans les réseaux de prochaine génération [Thèse de doctorat, École Polytechnique de Montréal]. Bahri, A. (2007). Planification globale des réseaux WDM avec agrégation de trafic [Thèse de doctorat, École Polytechnique de Montréal]. Oulaï, K. D. Y. (2007). Architecture et mécanismes pour la gestion de la qualité de service dans les réseaux de prochaines générations [Thèse de doctorat, École Polytechnique de Montréal]. St-Hilaire, M. (2006). Planification globale des réseaux mobiles de troisième génération [Thèse de doctorat, École Polytechnique de Montréal]. Mémoire de maîtrise (12) Moussa, M. (2014). Vérification et configuration automatiques de pare-feux par Model Checking et synthèse de contrôleur [Mémoire de maîtrise, École Polytechnique de Montréal]. Mourchid, F. (2010). Nouveau modèle pour le positionnement des senseurs avec contraintes de localisation [Mémoire de maîtrise, École Polytechnique de Montréal]. Ntareme, A. (2010). Planification du réseau d'accès pour l'amélioration de la rentabilité de l'infrastructure d'un réseau FTTN [Mémoire de maîtrise, École Polytechnique de Montréal]. Gagnon, C. (2008). Approche innovatrice de conception pour les réseaux de télécommunications basée sur l'architecture modulaire [Mémoire de maîtrise, École Polytechnique de Montréal]. Feki, S. (2007). Détection de panne dans les réseaux optiques [Mémoire de maîtrise, École Polytechnique de Montréal]. Ouellet, M. (2007). Planification des réseaux locaux sans fil avec antennes directionnelles [Mémoire de maîtrise, École Polytechnique de Montréal]. Bahri, A. (2003). Conception des réseaux d'ordinateurs sans fil [Mémoire de maîtrise, École Polytechnique de Montréal]. Lefebvre, J. (2003). Conception d'une architecture de gestion de réseaux à l'aide d'agents mobiles [Mémoire de maîtrise, École Polytechnique de Montréal]. Pomerleau, Y. (2003). Conception topologique de réseau cellulaire par une approche hybride de programmation par contraintes et de recherche locale [Mémoire de maîtrise, École Polytechnique de Montréal]. Quinn, D. (2003). Exploration architecturale pour la conception de processeurs réseaux basée sur l'utilisation de processeurs configurables [Mémoire de maîtrise, École Polytechnique de Montréal]. St-Hilaire, M. (2003). Planification et optimisation des points de présence dans les réseaux IP [Mémoire de maîtrise, École Polytechnique de Montréal]. Oulaï, K. D. Y. (2002). Routage et affectation de longueurs d'onde dans les réseaux optiques WDM [Mémoire de maîtrise, École Polytechnique de Montréal]. Nouvelle(s) concernant Steven Chamberland NOUVELLES | 29 septembre 2017 Transport durable : Polytechnique Montréal récompensée pour son leadership | Lire MAGAZINE POLY | 15 mai 2016 La réinstallation des étudiants réfugiés | Lire Revue de presse concernant Steven Chamberland 25 janvier 2018, La Presse +, Bond des inscriptions dans les écoles de génie Selon Steven Chamberland, directeur des affaires académiques et de la vie étudiante à Polytechnique Montréal, \"C’est certain que les gens comprennent maintenant avec le rayonnement de l’intelligence artificielle que les TI ont un impact sur tous les secteurs de la société, de la radiologie à l’énergie, et qu’il y a de la place pour eux dans ces différents types d’emplois où il y a un grand volet créatif\". 29 octobre 2016, Les Affaires, La technologie ouvre de nouvelles voies de spécialisation «Aujourd'hui, un ingénieur doit avoir une solide connaissance dans son domaine de spécialisation, tout en sachant ce qui se passe dans les autres secteurs du génie», mention de Steven Chamberland, directeur des affaires académiques et de la vie étudiante et professeur en génie logiciel et informatique à Polytechnique Montréal. 14 juillet 2015, EMBA McGill-HEC Montréal, Nouvelles. Steven Chamberland, participant actuel de l'EMBA McGill-HEC Montréal, est nommé directeur des affaires académiques et de la vie étudiante de Polytechnique Montréal. 8 mai 2015, ICI Radio-Canada Première, Écoutez l'Estrie - 17:24. La limite de la fibre optique pourrait être atteinte d'ici 8 ans. Propos du Pr Steven Chamberland, directeur du Département de génie informatique et génie logiciel. Sur le même sujet, écoutez Au coeur du monde - Gaspésie et Îles-de-la-Madeleine - 17:46, L'heure de pointe - Saguenay - 16:46 Futur étudiantZone étudianteZone employéMédiasFondation et AlumniRetraitésUrgenceOffres d'emploi Études Études (Registrariat)Programmes d'études offertsRépertoire des cours et horairesBibliothèqueDépartementsAide financière et boursesSociétés techniquesStages et emploisServices aux étudiantsGo-Poly Recherche Informations généralesRépertoire des expertisesChaires, laboratoires et groupesProjets de recherche pour étudiants aux études supérieuresSoutien aux chercheursProjets de recherche en partenariatStagiaires postdoctoraux Entreprises Embaucher un stagiaire ou recruter un étudiantFaire de la recherche en partenariatAcquisition d'une technologieAccéder à notre infrastructure de rechercheFormation continue À propos Renseignements générauxDocuments officielsInternationalFemmes et génieDéveloppement durablePropolys (soutien à l'entrepreneuriat)Direction et gouvernanceServicesAvis de confidentialité et conditions d’utilisationAccessibilitéNous joindre 2500, chemin de Polytechnique Montréal (Québec) H3T 1J4 (514) 340-4711 Suivez-nous! Faire un don",
  "content_length": 9192,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:33"
}