{
  "name": "Steve Goddard",
  "homepage": "https://cs.uiowa.edu/people/steve-goddard",
  "status": "success",
  "content": "Steve Goddard, Ph.D. | Computer Science - College of Liberal Arts and Sciences | The University of Iowa Skip to main content Steve Goddard, Ph.D. Professor Director of Graduate Studies Biography Steve Goddard is the former Dean of the College of Liberal Arts and Sciences at the University of Iowa where he held the UI Alumni Association Dean's Chair. Prior to joining the faculty at Iowa in 2019, Goddard was the the John E. Olsson Professor of Computer Science & Engineering at the University of Nebraska-Lincoln (UNL) and served in multiple administrative roles there, including Vice Chancellor for Research, Dean and Department Chair.Prior to joining the faculty at UNL, Dr. Goddard worked in the computer industry for 13 years, including nine years as president of his own company. He received the B.A. degree in computer science and mathematics from the University of Minnesota, Duluth (1985) and the M.S. and Ph.D. degrees in computer science from the University of North Carolina at Chapel Hill (1995, 1998).Research InterestsDr. Goddard's primary research interests are embedded, real-time, and distributed systems with emphases in cyber-physical systems and rate-based scheduling. He has published over 100 articles, including 10 patent applications, and received more than $22M in external funding for his research from the U.S. Department of Agriculture (USDA), the National Aeronautics and Space Administration (NASA), the Department of Defense (DoD) and the National Science Foundation (NSF).Research Interests (Keywords)Real-Time and Embedded Systems; Wireless Networking; Cyber-Physical SystemsSelected PublicationsAdversarial Robustness and Explainability of Machine Learning Models. Jamil Gafur, Steve Goddard, William Lai, Proceedings of Practice and Experience in Advanced Research Computing 2024: Human Powered Computing (PEARC ’24), July 2024.From Schedules to Programs—Reimagining Networking Infrastructure for Future Cyber-Physical Systems. Md Kowsar Hossain, Ryan Brummet, Octav Chipara, Ted Herman, Steve Goddard, 8th International Conference on Networking, Systems and Security (NSysS 2021), December 2021.WARP: On-the-fly Program Synthesis for Agile, Real-time, and Reliable Wireless Networks. Ryan Brummet, Md Kowsar Hossain, Octav Chipara, Ted Herman, Steve Goddard, IPSN ’21: Proceedings of the 20th International Conference on Information Processing in Sensor Networks, May 2021, Pages 254–267.A city-wide experimental testbed for the next generation wireless networks. Zhongyuan Zhao, Mehmet C Vuran, Baofeng Zhou, Mohammad MR Lunar, Zahra Aref, David P Young, Warren Humphrey, Steve Goddard, Garhan Attebury, and Blake France, Ad Hoc Networks, Volume 111, 1 February, 2021.STOOP: Stochastically-Dominant Access Point Selection in Enterprise WLANs. Yu Bai, Mehmet Can Vuran, Demet Batur, and Steve Goddard, Proceedings of the IEEE Int. Conf. on Smart Comput- ing (SMARTCOMP 2017), Hong Kong, China, May 2017, pp. 195 - 202.Biofuels From Crop Residue Can Reduce Soil Carbon and Increase CO2 Emissions. Adam J. Liska, Haishun Yang, Maribeth Milner, Steve Goddard, Humberto Blanco-Canqui, Matthew P. Pelton, Xiao X. Fang, Haitao Zhu and Andrew E. Suyker, Nature Climate Change, 4, 398–401, 2014.Cross-layer Analysis of the End-to-end Delay Distribution in Wireless Sensor Networks. Yunbo Wang, Mehmet C. Vuran and Steve Goddard, IEEE/ACM Transactions on Networking, 20 (1): 305- 318, January 2012.A Self-Calibrating Palmer Drought Severity Index. Nathan Wells, Steve Goddard, and Michael J. Hayes, Journal of Climate, 17 (12): 2335-2351, June 2004. Research areas Systems Email steve-goddard@uiowa.edu Phone 319-467-1979 Website Personal Website, Google Scholar Education Ph.D., University of North Carolina, 1998 Contact Information Office Address 201B MacLean Hall (MLH) Iowa City, IA 52242 United States",
  "content_length": 3836,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:15"
}