{
  "name": "Steven J. Zilora",
  "homepage": "http://ist.rit.edu/~sjz",
  "status": "success",
  "content": "Steve Zilora's Homepage Home Capstone Work Curriculum Vitae Courses Links Research Professor Stephen J. Zilora Capstone Work Curriculum Vitae Courses Links Research Welcome to my website. My goals as a university professor and educator are fourfold. First, I aim to demystify the material for students. Throughout my years of industrial experience I was continually amazed at computer professionals who would exalt themselves and their expertise. Sorry, but I don't think this is rocket science. Anyone who is willing to work can master this material. Second, I strive to bring a grounding to the subject matter. If we're not careful, the work we do in an academic environment can stand in idealic isolation. I believe it is important to have this foundation, but we must also temper it with a generous dose of reality. I regularly cite actual industrial applications in my classes and even bring in industry experts in order to achieve this goal. Third, there is the research end of the business. There is so much fun stuff going on in information technology today, I don't know where to begin. At heart, I am an application developer. So, many of the areas I'm interested in have to do with application development. The Web is one of the more exciting platforms we have available to us. I enjoy investigating the appropiate use of web-based applications. Some of the applications I have been involved with include reservation systems, election ballots, and sales-support tools. Recently, I have been working on developing systems to aid healthcare workers and researchers. I have also been playing with some new ideas regarding databases and how we represent certain types of information. If you have any interest working with me on any of these ideas, please contact me. I have more ideas than time so all help is appreciated. Finally, my schedule allows me to spend a great deal of time \"giving back\" to the community. I coach youth sports, I work with Habitat for Humanity, and I serve on the boards of several for-profit and non-profit organizations. If you would like me to serve on your capstone committee, please review the material under Capstone Work. There you'll find my expectations as well as some sample proposals. If you would like to know what courses I teach from time to time, look under Courses. I hope that you enjoy browsing this site.  Please feel free to contact me anytime. Department of Information Sciences and Technologies Office Location: 70-2109 Golisano College of Computing and Information Science Office Hours: see Schedule Rochester Institute of Technology Phone Number: 585-475-7643 Rochester, NY 14623 email: stephen.zilora@rit.edu",
  "content_length": 2668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:39"
}