{
  "name": "Steve Schneider",
  "homepage": "https://www.surrey.ac.uk/people/steve-schneider",
  "status": "success",
  "content": "Prof Steve Schneider | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Twitter LinkedIn Google Scholar ORCID Professor Steve Schneider Director of Computer Science Research Centre PhD, FBCS, FIET s.schneider@surrey.ac.uk PA: Denise Myers+44 (0)1483 686058d.myers@surrey.ac.ukAcademic and research departments Surrey Centre for Cyber Security, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyI am Director of Computer Science Research Centre which is comprised of the Surrey Centre for Cyber Security (SCCS) and the Nature Inspired Computing and Engineering (NICE) Research Group. I joined the Department of Computer Science in September 2004 and was Head of Department 2004-2010.  I was Associate Dean Research and Innovation in the Faculty of Engineering and Physical Sciences from 2015-2019.  I was previously in the Department of Computer Science at Royal Holloway, University of London over the period 1994-2004.  I gained my doctorate from the University of Oxford, and held post-doctoral positions there prior to joining Royal Holloway. Expand biography Areas of specialism Secure Electronic Voting; Distributed Ledger Technologies; Rail and Automotive Security; Security and Privacy; Formal modeling and verification University roles and responsibilities Director of the Computer Science Research CentrePrevious roles 2004 - 2010 Head of Department of Computer Science University of Surrey 2015 - 2019 Associate Dean (Research and Innovation), Faculty of Engineering and Physical Sciences University of SurreyAffiliations and memberships General Chair, WISEC 2023 The 16th ACM Conference on Security and Privacy in Wireless and Mobile Networks General Chair, ESORICS 2020 General Chair of the 25th European Symposium on Research in Computer Security, September 2020, University of Surrey Programme Chair, ESORICS 2019 Programme Chair of the 24th European Symposium on Research in Computer Security, September 2019, Luxembourg General Chair of ISC 2018 General Chair of 21st International Information Security Conference, ISC 2018, University of Surrey Programme Chair, iFM 2017 Programme Chair of 13th International Conference on integrated Formal Methods (iFM 2017), Turin General Chair, ACNS 2016 General Chair of 14th International Conference on Applied Cryptography and Network Security, University of Surrey, 2016 General Chair, Vote-ID 2013 General chair of the 4th International Conference on e-Voting and Identity, Vote-ID University of Surrey, 2013 Co-chair AVOCS 2013 Co-chair of 13th International Workshop on Automated Verification of Critical Systems, AVOCS, University of Surrey, 2013 Show allNews 24 MAR 2025 Defence Data Research Centre named finalist in British Data Awards 2025 13 NOV 2024CyBOK enters ‘exciting new chapter’ 17 FEB 2022Project protecting online privacy for people going through serious life events secures major funding 15 DEC 2020Surrey Security Network successfully launched 09 DEC 202010 top tips for staying safe online this Christmas 30 NOV 2020Six top tips to stay safe online on Computer Security Day 03 NOV 2020Surrey Business School receives funding for new research centre to develop a fairer digital economy 26 OCT 2020Cybersecurity and transparency of system designs are crucial to making internet voting a reality in the UK 01 JUN 2020Clever computing puts millions into charities’ hands 10 APR 2018World-leading cyber security expert moves to Surrey Show all articlesResearchResearch interestsI have been working in the area of Secure Electronic Voting since 2004. Since then I have been involved in the design and development of the Prêt à Voter verifiable voting system including its implementation for use in the vVote system used in the 2014 State Election in the State of Victoria, Australia. I am interested in more general approaches to secure electronic voting, and the use of Distributed Ledger Technologies in this domain, and more generally.I am also researching in security and privacy in the transportation domain. In Rail, we are focusing on the challenges around customer data privacy in the context of increased use of customer information to support journeys. Other work in rail has focused on the application of formal modelling approaches to establishing safety requirements within rail networks. In the Automotive domain we are focusing on security within vehicle-to-vehicle communications, These interests are grounded in earlier work in formal methods and in security around modelling and verification of security protocols, and in non-interference. In particular this has focused on methods for analysis of protocols between agents interacting in an insecure environment, and proving that they provide critical authentication and confidentiality properties.My formal methods work originated in concurrency theory, specifically the process algebra Communicating Sequential Processes (CSP), and its timed version Timed CSP. I also work with the B-Method and with Event-B, their relationship to CSP, and their application to safety and security verification. Expand research interests Research projects Centre for the Decentralised Digital Economy (DECaDE) DECaDE is a partnership between the University of Surrey, University of Edinburgh, and the Digital Catapult.It builds upon world-leading expertise at the intersection of Artificial Intelligence (AI) and Distributed Ledger Technologies (DLT) within Surrey’s Centre for Vision Speech and Signal Processing (CVSSP). These technical capabilities fuse with expertise in socio-economic modelling and digital business transformation within Surrey Business School’s Centre for Digital Economy (CoDE), and people-centric security and trusted systems within the Surrey Centre for Cybersecurity (SCCS). Edinburgh brings world-class human factors and design expertise via Centre for Design Informatics (CDI). DECaDE incorporates SCRIPT within Edinburgh Law School; an AHRC law and technology research centre focusing on the relationship between law, technology, commerce and society. Co-creation is driven through the Digital Catapult via both its DLT Field Labs and machine intelligence garage engaging diverse private and public sector end-users. Defence Data Research Centre Awarded through competition and operating under the SERAPIS framework, the DDRC comprises a consortium led by the University of Exeter, supported by the Universities of Liverpool and Surrey, the Digital Catapult and the Defence AI Centre. Over three years, the consortium will bring together a strong combination of talent to advance the technical and cultural capabilities at the Defence Science and Technology Laboratory (Dstl) in their use of data science and AI.The Centre will focus on problems related to the use of data for Artificial Intelligence applications, which can often be inaccessible or unusable in its raw state; up to 80% of time can be spent on getting data in a state where it can be used, and some projects never start at all due to insurmountable data issues. VOLT: Voting On Ledger Technologies A collaboration between the University of Surrey and King's College London, together with industrial partners Monax Industries, Crowdcube Limited, and Electoral Reform Services.The project aims to explore applications of distributed ledger technologies (DLT) in domains involving voting and collective decision making. There are many domains in which some form of balloting is required, such as voting on proposals or electing in charities, professional organisations, clubs, trades unions, political parties, and private companies. It is important to run such ballots in a way to ensure that the result is trusted.  The project also focuses on management of more complex voting rights, for example in the context of company shareholdings, and the role that can be played by smart contracts.  Secure Electronic VotingI am currently working on secure electronic voting (see video), in particular on the Prêt à Voter secure verifiable electronic voting system. I lead the Surrey e-voting group, which produced the first prototype implementation of Prêt à Voter, awarded `best design' at the voting systems competition conference VoComp 2007.I led an international collaboration to provide secure electronic voting to the State of Victoria, Australia for their November 2014 State election. I was also an investigator on the 2009-2014 EPSRC grant `Trustworthy Voting Systems'. :\tAP4L: Adaptive PETs to Protect & emPower People during Life Transitions AP4L’s aim is to protect people from online dangers they are exposed to when going through serious real-life transitions such as relationship breakdowns, developing a",
  "content_length": 142737,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:29"
}