{
  "name": "Steve Counsell",
  "homepage": "https://www.brunel.ac.uk/people/steve-counsell",
  "status": "success",
  "content": "Professor Steve Counsell | Introduction | Brunel University London Skip to Content Home People Professor Steve Counsell Professor Steve CounsellProfessor Wilfred Brown Building 114 Email: steve.counsell@brunel.ac.uk Tel: +44 (0)1895 266740 Personal Website Computer Science College of Engineering, Design and Physical Sciences Summary Steve Counsell is a Professor in the Department of Computer Science at Brunel University London. He received his PhD from Birkbeck, University of London in 2002. Before joining Brunel University London, he was a Lecturer in the Department of Computer Science at Birkbeck and prior to his PhD was a developer in industry. Professor Counsell is a Fellow of the British Computer Society.Newest selected publications Counsell, S., Dashkevich, N. and Destefanis, G. (2020) 'Blockchain Application for Central Banks: A Systematic Mapping Study'. IEEE Access, 8. pp. 1 - 37. ISSN: 2169-3536 Open Access Link Journal article Capiluppi, A., Ajienka, N. and Counsell, S. (2020) 'The effect of multiple developers on structural attributes: A Study based on java software'. Journal of Systems and Software, 167 (September 2020). pp. 1 - 19. ISSN: 0164-1212 Open Access Link Journal article Mendes, E., Bin Ali, N., Counsell, S. and Baldassare, MT. (2019) 'Special issue on evaluation and assessment in software engineering'. Journal of Systems and Software, 151. pp. 224 - 225. ISSN: 0164-1212 Journal article Shepperd, M., Ajienka, N. and Counsell, S. (2018) 'The role and value of replication in empirical software engineering results'. Information and Software Technology, 99. pp. 120 - 132. ISSN: 0950-5849 Open Access Link Journal article Destefanis, G., Arzoky, M., Counsell, S., Swift, S., Ortu, M., Tonelli, R. and Marchesi, M. et al. (2018) '113 times tomcat: A dataset'. Peerj, 6. Journal article More publications(85)",
  "content_length": 1851,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:14"
}