{
  "name": "Steven Cutchin",
  "homepage": "https://www.boisestate.edu/coen-cs/people/faculty/steven-cutchin",
  "status": "success",
  "content": "Steven Cutchin, Ph.D. - Computer Science Skip to main content Computer Science People Faculty Steven Cutchin, Ph.D. Steven Cutchin, Ph.D. Steven Cutchin, Ph.D. Associate Professor Visit Steve’s website CCP 356 Call: (208) 426-5766 stevencutchin@boisestate.edu Visit Steve’s website About Steven Cutchin Bio Education Publications Areas of Interest Bio Dr. Steve Cutchin joined the faculty at Boise State University in August 2013 From 2008 to 2013 he was manager of the KAUST Visualization Laboratory Core Facility and the Supercomputer Facility at King Abdullah’s University of Science and Technology (KAUST) in Thuwal, Saudi Arabia. At KAUST he recruited a technical team of engineers and visualization scientists while managing the building of the state of the art scientific data visualization laboratory on the KAUST campus, forged relationships with international university and corporate partners, continued to improve the laboratory and recruit new staff. Prior to his work in Saudi Arabia, Dr. Cutchin worked at the University of California, San Diego (UCSD) first as manager of Visualization Services at the San Diego Supercomputer Center and later at California Institute for Telecommunications and Information Technology (Calit2). He has worked as a Sr. Software Engineer at Walt Disney Feature Animation developing software tools to improve animation production on feature films. He has published articles on Computer Graphics and Visualization, created animations for Discovery Channel and images for SIGGRAPH and Supercomputing conferences and journals. He received his doctorate from Purdue University in Computer Science. Education Ph.D. Computer Science, Purdue University 2000 Publications Research Interests: Parallel computing, Beowulf clusters, Parallel application development, Parallel algorithms and data structures, Computer Science Education. Research Highlights: Applications of parallel computing technology to benefit various areas of research outside of computer science. Projects include working with researchers from Materials Science & Engineering, Biology, Electrical Engineering, Civil Engineering, Biomedical Engineering, Geophysics, Community and Regional Planning and others. Received over $11 million in grants (over $5.5 million as PI) from National Science Foundation, Higher Education Research Council (HERC, idaho), Google, NASA and others. Supervised 25 masters students, with 21 in the last ten years. PI of CS10K: IDoCode project funded by NSF. See the project website here. The project was highlighted by the White House in 2015. Areas of Interest Scientific Data Visualization Immersive Environments Serious Games High Performance Computing Multi-terabyte data visualization Computer Science computerscience@boisestate.edu (208) 426-5766 City Center Plaza (CCP), RM 364 Back To Top",
  "content_length": 2830,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:31"
}