{
  "name": "Steve C. Maddock",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/steve-maddock",
  "status": "success",
  "content": "Dr Steve Maddock | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Steve Maddock PhD School of Computer Science Senior Lecturer Acting Head of the Computer Vision research group Open staff member portrait in a modal window s.maddock@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Steve Maddock School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-3179-0263 Google Scholar Personal website Profile Dr Steve Maddock is a Senior Lecturer in Computer Graphics and is Head of the Visual Computing research group. He has a Class I Degree in Computer Science, a PGCE (Maths, 11-18) and a PhD in computer graphics modelling and animation, all from the University of Sheffield.He has over 30 years’ experience in developing computer graphics software and spent six months on secondment at Gremlin/Infogrames which gave him valuable insights into the computer games industry Research interests Dr Maddock’s research interests are in facial modelling and animation, augmented and virtual reality, and, more generally, in 3D computer graphics. Publications Journal articles Alzahrani F, Maddock S & Christensen H (2025) Analysis of facial cues for cognitive decline detection using in-the-wild data. Applied Sciences, 15(11). View this article in WRRO He Y, Cooney CR, Maddock S & Thomas GH (2025) PhenoLearn: a user-friendly toolkit for image annotation and deep learning-based phenotyping for biological datasets. Journal of Evolutionary Biology. View this article in WRRO Ioannou E & Maddock S (2024) Evaluation in neural style transfer: a review. Computer Graphics Forum, 43(6). View this article in WRRO Ioannou E & Maddock S (2024) Towards real-time G-buffer-guided style transfer in computer games. IEEE Transactions on Games. View this article in WRRO Cogurcu YE, Douthwaite JA & Maddock S (2023) A comparative study of safety zone visualisations for virtual and physical robot arms using augmented reality. Computers, 12(4). Ioannou E & Maddock S (2023) Depth-aware neural style transfer for videos. Computers, 12(4). View this article in WRRO He Y, Cooney CR, Maddock S & Thomas GH (2023) Using pose estimation to identify regions and points on natural history specimens. PLOS Computational Biology, 19(2). View this article in WRRO Millward B, Maddock S & Mangan M (2022) CompoundRay, an open-source tool for high-speed and high-fidelity rendering of compound eyes. eLife, 11. View this article in WRRO He Y, Varley Z, Moody C, Nouri L, Jardine M, Maddock S, Thomas G & Cooney C (2022) Deep learning image segmentation reveals patterns of UV reflectance evolution in passerine birds. Nature Communications, 13. View this article in WRRO Zhang T, Aftab W, Mihaylova L, Langran-Wheeler C, Rigby S, Fletcher D, Maddock S & Bosworth G (2022) Recent advances in video analytics for rail network surveillance for security, trespass and suicide prevention— a survey. Sensors, 22(12). View this article in WRRO Montana Gonzalez LR & Maddock S (2021) A sketch-based interface for real-time control of crowd simulations that incorporate dynamic knowledge. Journal of Virtual Reality and Broadcasting, 16(3). View this article in WRRO Shui W, Zhou M, Maddock S, Ji Y, Deng Q, Li K, Fan Y, Li Y & Wu X (2020) A computerized craniofacial reconstruction method for an unidentified skull based on statistical shape models. Multimedia Tools and Applications, 79, 25589-25611. Charlton J, Gonzalez LRM, Maddock S & Richmond P (2020) Simulating crowds and autonomous vehicles. Transactions on Computational Science XXXVII, 2020, 129-143(12230), 129-143. View this article in WRRO Chisholm R, Maddock S & Richmond P (2020) Improved GPU near neighbours performance for multi-agent simulations. Journal of Parallel and Distributed Computing, 137, 53-64. Heywood P, Maddock S, Bradley R, Swain D, Wright I, Mawson M, Fletcher G, Guichard R, Himlin R & Richmond P (2019) A data-parallel many-source shortest-path algorithm to accelerate macroscopic transport network assignment. Transportation Research Part C: Emerging Technologies, 104, 332-347. Charlton JA, Maddock S & Richmond P (2019) Two-dimensional batch linear programming on the GPU. Journal of Parallel and Distributed Computing, 126, 152-160. View this article in WRRO Leach M & Maddock S (2019) An evaluation approach for a physically-based sticky lip model. Computers, 81(1). View this article in WRRO Towers A, Field J, Stokes C, Maddock S & Martin N (2019) A scoping review of the use and application of virtual reality in pre-clinical dental education. British Dental Journal, 226(5), 358-366. View this article in WRRO Alghamdi N, Maddock S, Marxer R, Barker J & Brown GJ (2018) A corpus of audio-visual Lombard speech with frontal and profile views. Journal of the Acoustical Society of America, 143(6), 523-529. View this article in WRRO Marxer R, Barker JP, Alghamdi N & Maddock S (2018) The impact of the Lombard effect on audio and visual speech recognition systems. Speech Communication, 100, 58-68. View this article in WRRO Heywood P, Maddock S, Casas J, Garcia D, Brackstone M & Richmond P (2018) Data-parallel agent-based microscopic road network simulation using graphics processing units. Simulation Modelling Practice and Theory, 83, 188-200. Alghamdi N, Maddock S, Barker J & Brown GJ (2017) The impact of automatic exaggeration of the visual articulatory features of a talker on the intelligibility of spectrally distorted speech. Speech Communication, 95, 127-136. View this article in WRRO Shui W, Zhou M, Maddock SC, He T, Wang X & Deng Q (2017) A PCA-Based Method for Determining Craniofacial Relationship and Sexual Dimorphism of Facial Shapes. Computers in Biology and Medicine, 90, 33-49. View this article in WRRO Warburton M, Omar Ali , Liong WC, Othusitse AM, Abdullah Zubir AZ, Maddock S & Wong TS (2015) OneClick: A Program for Designing Focused Mutagenesis Experiments. AIMS Bioengineering, 2(3), 126-143. Warburton M & Maddock SC (2015) Physically-Based Forehead Animation including Wrinkles. Computer Animation and Virtual Worlds, 26(1), 55-68. Warburton M & Maddock S (2015) Physically-based forehead animation including wrinkles. Computer Animation and Virtual Worlds, 26(1), 55-68. Gamito MN & Maddock SC (2009) Accurate Multidimensional Poisson-Disk Sampling. ACM T GRAPHIC, 29(1). Gamito MN & Maddock SC (2008) Topological Correction of Hypertextured Implicit Surfaces for Ray Casting. The Visual Computer, 24(6), 397-409. Gamito MN & Maddock SC (2008) Topological correction of hypertextured implicit surfaces for ray casting. VISUAL COMPUTER, 24(6), 397-409. BinSubaih A & Maddock SC (2008) Game Portability Using a Service-Oriented Approach. International Journal of Computer Games Technology, 2008. Martinez Lazalde O, Maddock SC & Meredith M (2008) A Constraint-Based approach to Visual Speech for a Mexican-Spanish Talking Head. International Journal of Computer Games Technology, 2008. Gunnarsson O & Maddock S (2007) A statistically-assisted sketch-based interface for creating arbitrary 3D faces. Theory and Practice of Computer Graphics 2007 Tpcg 2007 Eurographics Uk Chapter Proceedings Celebrating 25 Years of the Eurographics Uk Chapter, 123-130. Meredith M & Maddock S (2007) Approximating character biomechanics with real-time weighted inverse kinematics. Computer Animation and Virtual Worlds, 18(4-5), 349-359. Gamito MN & Maddock SC (2007) Progressive refinement rendering of implicit surfaces. COMPUT GRAPH-UK, 31(5), 698-709. Gamito MN & Maddock SC (2007) Ray casting implicit fractal surfaces with reduced affine arithmetic. VISUAL COMPUT, 23(3), 155-165. Meredith M & Maddock S (2006) Inverse skinning. Iet Conference Publications(516 CP), 163-172. BinSubaih A, Maddock SC & Romano D (2006) A Serious Game for Traffic Accident Investigators. International Journal of Interactive Technology & Smart Education, 3(4), 329-346. Gamito MN & Maddock SC (2006) Anti-aliasing with stratified B-spline filters of arbitrary degree. COMPUT GRAPH FORUM, 25(2), 163-172. BinSubaih A, Maddock S & Romano D (2005) Game logic portability. ACM International Conference Proceeding Series, 265, 458-461. Meredith M & Maddock SC (2005) Adapting motion capture data using weighted real-time inverse kinematics.. Comput. Entertain., 3, 5-5. Watt A & Maddock SC (2005) Technologies for characters in computer games. Scientia, Estudos Interdisciplinares em Computação, 16(1), 5-12. Edge JD & Maddock S (2004) Constraint-based synthesis of visual speech. ACM SIGGRAPH 2004 Sketches SIGGRAPH 04. Enrique S, Watt A, Maddock SC & Policarpo F (2003) Using Synthetic Vision for Autonomous Non-Player Characters.. Inteligencia Artif., 7, 19-25. Enrique S, Watt A, Maddock SC & Policarpo F (2003) Using Synthetic Vision for Autonomous Non-Player Characters in Computer Games. Inteligencia Artificial, Revista Iberoamericana de Inteligencia Artificial, 21, 19-25. Maddock S (2000) Computer cames. Virtual Reality, 5(4), 183-184. Watt A & Maddock SC (2000) Computer Games Technology and Higher Education. Virtual Reality, 5(4), 185-194. MADDOCK SC (1995) PERSONAL CAL WORKBOOKS - THE NEXT CHAPTERS. COMPUT GRAPH, 19(4), 631-635. MADDOCK SC (1994) A PERSONAL CAL WORKBOOK. COMPUT GRAPH, 18(3), 299-304. Book chapters BinSubaih A, Maddock SC & Romano DM (2009) Developing a Serious Game for Police Training In Ferdig RE (Ed.), Handbook of research on effective electronic gaming in education (pp. 451-477). Information Science Publishing House D, Rockwood A, Ebert D, Watt A, Maddock S, Wolberg G, Magnenat Thalmann N, Thalmann D, Kaufman A, Mueller K , Bryson S et al (2004) Computer Vision, Computer Science Handbook, Second Edition CD-ROM CRC Press Watt A & Maddock S (2004) Mainstream rendering techniques, Computer Science Handbook Second Edition (pp. 38-38-32). Watt A & Maddock S () Visual Realism Wiley Conference proceedings Dennison R & Maddock S (202",
  "content_length": 25075,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:18"
}