{
  "name": "Steven Wu 0001",
  "homepage": "https://zstevenwu.com",
  "status": "success",
  "content": "Home Page for Zhiwei Steven Wu Steven Wu Associate Professor School of Computer Science Carnegie Mellon University Email: zstevenwu [at] cmu.edu Office: TCS Hall 424 I am an Associate Professor in the School of Computer Science at Carnegie Mellon University, with my primary appointment in the Software and Societal Systems Department (with the Societal Computing program), and affiliated appointments with the Machine Learning Department and the Human-Computer Interaction Institute. I am also affiliated with the CyLab and the Theory Group. My broad research interests are in algorithms and machine learning. These days I am excited about: Foundations of responsible AI, with emphasis on privacy, bias, and uncertainty considerations. Interactive learning, including imitation and reinforcement learning, and its interactions with causal inference, game theory, econometrics, and language modeling. My research has been generously supported by the National Science Foundation (NSF) (including an NSF CAREER Award), the Okawa Foundation, Open Philanthropy, CMU’s Block Center for Technology and Society, an Amazon Research Award, a Google Faculty Research Award, J.P. Morgan Faculty Awards, Meta Research awards, a Mozilla Research Grant, Apple, and Cisco Research. Quick Links: For more details of my work, please see Papers Google Scholar CV If you are interested in working in my research group, please read For Prospective Students NEWS RecentInterests Selected recent papers: Doubly-Robust LLM-as-a-Judge: Externally Valid Estimation with Imperfect Personas L. Guerdan, J. Whitehouse, K. Truong, K. Holstein, Z. S. Wu All Roads Lead to Likelihood: The Value of Reinforcement Learning in Fine-Tuning G. Swamy, S. Choudhury, W. Sun, Z. S. Wu, J. A. Bagnell Generate-then-Verify: Reconstructing Data from Limited Published Statistics T. Liu, E. Xiao, A. Smith, P. Thaker, Z. S. Wu. S&P 2026. Orthogonal Causal Calibration J. Whitehouse, C. Jung, V. Syrgkanis, B. Wilder, Z. S. Wu. COLT 2025. Kandinsky Conformal Prediction: Beyond Class- and Covariate-Conditional Coverage K. Bairaktari, J. Wu, Z. S. Wu. ICML 2025. A Minimaximalist Approach to Reinforcement Learning from Human Feedback G. Swamy, C. Dann, R. Kidambi, Z. S. Wu, A. Agarwal. ICML 2024. GROUP I am extremely fortunate to be able to work with several excellent students and postdocs. PhD students Gokul Swamy (co-advised by Drew Bagnell) Luke Guerdan (co-advised by Ken Holstein) Terrance Liu Jingwu Tang (co-advised by Fei Fang) Anusha Sinha (co-advised by Hoda Heidari) Kimberly Truong (co-advised by Hoda Heidari) Jiahao Zhang Keltin Grimes Rui Melo Jiayun Wu (co-advised by Andrew Ilyas) Postdocs Pratiksha Thaker, CBI Fellow, (co-advised by Virginia Smith) Undergrad &Master's Students Yifei Pang (MS) Alumni Keegan Harris (PhD student), joining UC Berkeley as a post-doc Daniel Ngo (PhD student), now at J.P. Morgan AI Research Justin Whitehouse (PhD student), now a post-doc at Stanford Logan Stapleton (PhD student), now on the Vassar College CS Faculty Giuseppe Vietri (PhD student), now at Amazon Hao-Fei Cheng (PhD student), now at Amazon Shuran Zheng (Post-doc), now on the IIIS faculty at Tsinghua University Past CMU master's and undergrads Xin Gu (MS), now a PhD student at Penn State Ken Ziyu Liu (MS), now a PhD student at Stanford Konwoo Kim (undergrad, winner of the Allen Newell Award), now a PhD student at Stanford Ally Du (undergrad), now a PhD student at Univ. of Washington Kevin Ren (undergrad), now a PhD student at Cornell Tech Past visiting and REU students Joonhyuk Ko (visiting undergrad from UVA) Xiaoyuan Zhu (visiting undergrad from USC) Matteo Boglioni (visiting master's student ETH-Zurich) Yuanchen Tang (visiting undergrad from Peking U.), now a PhD student at UIUC Henry Jin (visiting undergrad from Tsinghua), now a PhD student at UCLA Xiaoyu Wu (visiting master's student from Shanghai Jiaotong U.), now a PhD student at Rice Univ. Yuqi Pan (visiting undergrad from Peking U.), now a PhD student at Harvard Huiying Zhong (visiting undergrad from Peking U.), now a PhD student at MIT Xinyan Hu (visiting undergrad from Peking U.), now a PhD student at UC Berkeley Leijie Wang (visiting undergrad from Tsinghua), now a PhD student at Univ. of Washington Jocelyn Chou (REU student from Rutgers) Diana Qing (REU student from Berkeley), now an MS student at Stanford Harry Tian (REU student from Carleton), now a PhD student at Purdue Grace Tian (REU student from Harvard), now an ML engineer at Hive Allen Marquez (REU student from Cal State LA), now a software engineer at Northrop Grumman TEACHING Fall 2025 18734 / 17731: Foundations of Privacy Spring 2025 17-740: Algorithmic Foundations of Interactive Learning Fall 2024 18734 / 17731: Foundations of Privacy Spring 2024 17757: Modern Techniques in Uncertainty Quantification Courses before 2024 Fall 2023 18734 / 17731: Foundations of Privacy Fall 2022 18734 / 17731: Foundations of Privacy Fall 2021 18734 / 17731: Foundations of Privacy 05-318 / 05-618: Human AI Interactions Spring 2021 17880: Algorithms For Private Data Analysis Fall 2020 05-318 / 05-618: Human AI Interaction Spring 2020 CSCI 5525: Machine Learning (UMN) Fall 2019 CSCI 5525: Machine Learning (UMN) Fall 2018 CSCI 8980: The Algorithmic Foundations of Data Privacy (UMN) SERVICE Conference Program Committee NeurIPS 2025, 2022, 2021, 2020 (area chair) ICML 2022, 2020 (area chair) ICLR 2024, 2022, 2021, 2020 (area chair) AISTATS 2021 (area chair) COLT 2025, 2024, 2023 (SPC) EC 2025 (SPC) ITCS 2022 SODA 2022 ALT 2021 FORC 2020, 2024 FAccT 2019, 2021, 2023 (area chair) TheWebConf 2020, 2018 Workshop Program Committee TPDP 2021, 2019 NIPSML4H18 HAI-GEN 2020 Workshop Organizer Intersectionality in Fair Machine Learning: Where Are We and Where Should We Go from Here? MOSAIC 2020: An Annual Conference on Intersectionality. Nov. 1, 2020. Recent Developments in Research on Fairness. The Simons Institute for the Theory of Computing, Berkeley, CA. July 8-10, 2019. Other I co-organize differentialprivacy.org. During my undergraduate, I was involved in the Bard Prison Initiative as a math tutor at the Eastern New York Correctional Facility. Check out this amazing four-part documentary film series, College Behind Bars, about this initiative. TALKS Feb 2022 Of Moments and Matching: Trade-offs and Treatments in Imitation Learning Simons Institute Workshop on Adversarial Approaches in Machine Learning YouTube Mar 2021 A Geometric View on Private Gradient-Based Optimization Federated Learning One World Seminar (FLOW) Google TechTalks FLOW Video Google Video Mar 2021 Feb 2021 Involving Stakeholders in Building Fair ML Systems Foundations of Algorithmic Fairness Workshop IDEAL Quarterly Theory Workshop: Algorithms and their Social Impact Trustworthy ML Initiative (TrustML) Seminar YouTube Panopto Mar 2021 Feb 2021 Leveraging Heuristics in Private Synthetic Data Generation CMU Crypto/Applied crypto seminar PPAI workshop 2021 Boston-area Data Privacy Seminar PPAI Video CMU Cryto Video Nov 2019 Between Individual and Group Fairness Three Decades of DIMACS: The Journey Continues Video Oct 2019 Tutorial: Differential Privacy Techniques Beyond Differential Privacy FOCS 2019 workshop A TCS Quiver Slides Jan 2018 Competing Bandits: Learning under Competition ITCS 2018 Video Aug 2017 Meritocratic Fairness for Cross-Population Selection ICML 2017 Video June 2017 Fairness Incentives for Myopic Agents EC 2017 Video June 2017 Multidimensional Dynamic Pricing for Welfare Maximization EC 2017 Video",
  "content_length": 7538,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:46"
}