{
  "name": "Steven R. Bagley",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/steven.bagley",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Steven BagleyAssistant Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C55 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKsteven.bagley@nottingham.ac.uk Selected Publications HUGHES, JACOB, BRAILSFORD, DAVID F, BAGLEY, STEVEN R and ADAMS, CLIVE E, 2014. Generating summary documents for a variable-quality PDF document collection In: Proceedings of the 2014 ACM symposium on Document engineering. 49-52 View all publications HUGHES, JACOB, BRAILSFORD, DAVID F, BAGLEY, STEVEN R and ADAMS, CLIVE E, 2014. Generating summary documents for a variable-quality PDF document collection In: Proceedings of the 2014 ACM symposium on Document engineering. 49-52BAGLEY, STEVEN R and HARDY, MATTHEW RB, 2014. DOCENG 2014: PDF tutorial In: Proceedings of the 2014 ACM symposium on Document engineering. 213-214PINKNEY, ALEXANDER J, BAGLEY, STEVEN R and BRAILSFORD, DAVID F, 2013. No need to justify your choice: pre-compiling line breaks to improve eBook readability In: Proceedings of the 2013 ACM symposium on Document engineering. 237-240BAGLEY, STEVEN R, BRAILSFORD, DAVID F and KERNIGHAN, BRIAN W, 2013. Revisiting a summer vacation: digital restoration and typesetter forensics In: Proceedings of the 2013 ACM symposium on Document engineering. 3-12PINKNEY, A.J., BAGLEY, S.R. and BRAILSFORD, D.F., 2011. Reflowable documents composed from pre-rendered atomic components In: DocEng '11: proceedings of the 11th ACM Symposium on Document Engineering. 163-166OLLIS, J.A., BRAILSFORD, D.F. and BAGLEY, S.R., 2010. Optimized reprocessing of documents using stored processor state In: DocEng '10: proceedings of the 10th ACM Symposium on Document Engineering. 135-138BAGLEY, S.R., 2010. Lessons from the dragon: compiling PDF to machine code In: DocEng '10: proceedings of the 10th ACM Symposium on Document Engineering. 65-68OLLIS, J., BAGLEY, S. and BRAILSFORD, D., 2008. Tracking sub-page components in document workflows In: DocEng '08: proceedings of the eighth ACM Symposium on Document Engineering. 86-89BAGLEY, S., BRAILSFORD, D. and OLLIS, J., 2007. Extracting Reusable Document Components for Variable Data Printing PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING. 2007, 44-52MACDONALD, A., BRAILSFORD, D., BAGLEY, S. and LUMLEY, J., 2007. Speculative Document Evaluation PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING. 2007, 56-58BAGLEY, S. R., 2006. COG Extractor PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING. 2006, 31BAGLEY, S. R. and BRAILSFORD, D. F., 2005. The COG Scrapbook PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING. 2005, 31MACDONALD, A. J., BRAILSFORD, D. F. and BAGLEY, S. R., 2005. Encapsulating and Manipulating Component Object Graphics (COGs) using SVG PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING. 2005, 61-63BAGLEY, S. R. and BRAILSFORD, D. F., 2005. Demo Abstract: The COG Scrapbook PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING. 2005, 233-234BAGLEY, S. and BRAILSFORD, D.F., 2004. Page Composition Using PPML as a Link Editing Script In: Proceedings of The ACM Symposium on Document Engineering (DocEng 2004). BAGLEY, S., BRAILSFORD, D.F. and HARDY, M., 2003. Creating Reuable Well Structured PDF as a Sequence of Component Object Graphic COG Elements In: Proceedings of the ACM Symposium on Document Engineering (DocEng 03). Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 4313,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:42"
}