{
  "name": "Steven Pemberton",
  "homepage": "http://homepages.cwi.nl/~steven",
  "status": "success",
  "content": "Steven Pemberton Steven Pemberton Contents Latest and upcoming talks Brief Biography Projects: current: ixml, XForms, iot, declarative techniques; web; programming languages; interactive documents Publications Talks Organisations Blatant Self Promotion: awards, the press, radio/tv, film Other Stuff Contact Latest Terug naar Toen: Nederland verbonden met het internet: I was interviewed for ten minutes (in Dutch) on Dutch National Radio on the anniversary of the day Europe was connected to the internet for the first time. Python: The Documentary: I appear in this 90 minute documentary on the origins of Python. The SIGCHI Bulletin: A Retrospective: For several years I was editor-in-chief of the SIGCHI Bulletin, their main membership publication. It was later discontinued, but they have recently started a new membership publication, Voices of SIGCHI. They asked me to write a retrospective on the SIGCHI Bulletin to open the new publication. Allerdaagse Vragen: I was interviewed by the Dutch broadcaster BNNVara for their podcast on \"Everyday Questions\", namely why computers only work with 0s and 1s. Personally I think I explained it much better than what they used, but they did use my summary at the end. (8 minutes, in Dutch). The Demise of Skype: I was interviewed on NOS, Dutch national television news. (Starts at 37:58, about a minute, in Dutch). They also turned a pre-filming telephone interview into an article that quotes me saying words that I don't remember saying, but sort of covers the meaning. Declarative Amsterdam: the 6th annual conference on declarative techniques, was at the Science Park Amsterdam, 7-8 November 2024. Next one: 6-7 November 2025. XForms Techniques Hands-on: new tutorial presenting XForms techniques and idioms. There is also an introductory tutorial: XForms Hands On and Advanced XForms Hands-On: A generic application. Advanced ixml Hands On: A tutorial dealing with advanced concepts and techniques for ixml, with a number of case studies. There is a video. The earlier introductory tutorial is here: ixml Hands On, also available as a video. ixampl: the source code for my ixml processor, transformed using an ixml grammar, and then displayed using an XForms app. Want to learn XForms? See XForms: An Introduction. Want to learn ixml? See Invisible XML Recent and Upcoming Talks Invited Talk: Early Web Content Authoring, at Boye Conference Calls, online, 22 April. Video. Blog. Talk: Modular ixml, at Markup UK, London, UK, 6 June. The paper (XHTML). The paper (pdf). Demo: An Application of a Generic XForms Application (Recipes), at Markup UK, London, UK, 6 June. The app. Tutorial: XForms Techniques Hands-on, at Markup UK, London, UK, 5 June. The Tutorial. Talk: The Book of Doublends Jined: Parsing Finnegans Wake with ixml, at Balisage, (online), 7 August. I love this talk. This was great. Great presentation. Invited Talk: Directions of ixml, at Balisage, (online), 7 August. Tutorial: XForms Hands-on, at XML Summer School, Oxford, UK, 14-19 September. The Tutorial. Talk: There's no I in AI, at XML Summer School, Oxford, UK, 14-19 September. Talk: AI and the Evolution of Programming, at XML Summer School, Oxford, UK, 14-19 September. Invited Talk: Will AI Kill Us, and How?, at Science Park Open Day, Science Park, Amsterdam NL, 4 October. I really enjoyed [it] — and I could tell the audience did too! Keynote: Programming, Past and Future, at PyCon NL, Jaarbeurs Utrecht, NL, 16 October. Invited Talk: Declarative Programming, at Department of Informatics Engineering, University of Porto, Portugal, 23 October. Keynote: The Internet of Things and the Coming Robot Rebellion, at Semana de Informática - FEUP Informatics week NL, Porto, Portugal, 23 October. Invited Talk: How AI Will Kill Us, at GenAI Nightmares, (online), 31 October. Video. What a great speaker Entertaining and scary Tutorial: Advanced ixml, hands-on, at Declarative Amsterdam, Science Park, Amsterdam, NL, 6 November. Talk: Generalised Invisible Markup, at Declarative Amsterdam, Science Park, Amsterdam, NL, 7 November. The paper. Invited Talk: History of the CWI, at NWO Visit, CWI, Amsterdam, 12 November. Invited Talk: History of Programming Languages, at MLA Metis, Amsterdam, 26 November. Brief Biography Now: I am a researcher, author, public speaker, and broadcaster, affiliated with the CWI, The Dutch National Research Centre for Mathematics and Informatics. My research is broadly in interaction, and how the underlying software architecture can better support users. I am an ACM Distinguished Speaker. Before: At university my tutor was Richard Grimsdale, who built the first transistorised computer, and was tutored himself by Alan Turing. I was a research programmer at the University of Sussex before going to implement Algol 68 for the research computer MU5 at the University of Manchester, in Turing's old department, and was later a lecturer in computing at the University of Brighton, and wrote a book on Pascal Implementation. Programming languages: Coming to the CWI, I co-designed the programming language ABC, the forerunner of Python, and co-wrote a book on ABC. I wrote part of gcc. Human Computer Interaction: I was a member of the SIGCHI Executive Committee for a decade, and editor in chief of the SIGCHI Bulletin, and later ACM/interactions. I chaired the CHI conference in 1997. I co-founded sigchi.nl, and co-organised their early conferences. In 2009 I was awarded the ACM SIGCHI Lifetime Service Award; in 2022 the ACM SIGCHI Lifetime Practice Award. Internet and Web: I was the first user of the open internet in Europe (the first to use it who wasn't involved with setting it up) when the CWI established the first European open internet connection in 1988. Involved with the Web from the beginning I organised two workshops at the first Web Conference at CERN in 1994. From there I became involved in W3C, and co-designed HTML, CSS, XHTML, XForms, RDFa, and several other Web technologies. I chaired the HTML and XForms working groups for a decade, and still chair the XForms group, and the ixml group. I have also been a member of the ODF technical committee. In order to poke fun at it, I asked ChatGPT to write a bio for me, and apparently I'm a fellow of the ACM, and have several honary doctorates, which is fantastic news! Steven Pemberton is a renowned researcher in the field of computer science and information technology. He is currently affiliated with the Centrum Wiskunde & Informatica (CWI) in Amsterdam, where he has been actively involved in cutting-edge research and development for several years. Pemberton is best known for his contributions to the development of the World Wide Web, particularly in the areas of markup languages and web standards. He is a co-author of several key web technologies, including HTML, XHTML, and CSS, and has been instrumental in driving the evolution of these standards over the years. In addition to his work on the web, Pemberton has also made significant contributions to other areas of computer science, such as the design of programming languages, the development of software engineering methodologies, and the study of human-computer interaction. Pemberton is a highly respected figure in the academic community, and has received numerous awards and accolades for his work. He is a fellow of the Association for Computing Machinery (ACM) and the Royal Society of Edinburgh, and has been awarded honorary doctorates by several prestigious universities. As a speaker, Pemberton is known for his engaging and informative presentations, which draw on his deep knowledge of computer science and his passion for technology. His talks are always thought-provoking and entertaining, and he has been invited to speak at numerous conferences and events around the world. Projects If there is one thread that runs through these projects, it is about people. In particular, what are the changes that need to be made to the system architecture to make the resulting system more human-oriented. Current projects Invisible Markup: We choose which representations of our data to use, JSON, CSV, XML, or whatever, depending on habit, convenience, or the context we want to use that data in. On the other hand, having an interoperable generic toolchain such as that provided by XML to process data is of immense value. How do we resolve the conflicting requirements of convenience, habit, and context, and still enable a generic toolchain? Invisible XML (ixml) is a method for treating non-XML documents as if they were XML, enabling authors to write documents and data in a format they prefer while providing XML for processes that are more effective with XML content. This is an ongoing project to provide software that lets you treat any parsable format as if it were XML, without the need for markup. This work is beautiful and ground-breaking Ideal for acting as a bridge between data formats and data representations, providing transformations that are easier to write, easier to debug, and more robust than using imperative code I'm not exaggerating when I say that Invisible XML is the most exciting innovation to have happened to XML since, well, since XML was invented! There is a W3C working group you can join; meets bi-weekly. And a tutorial. And an advanced tutorial. And the official Invisible XML Specification. Igor - an Internet of Things Framework: The Internet of Things is driven by many tiny low-powered processors that produce data in a variety of different formats, and produce the data in different ways, sometimes on demand (such as thermostats), sometimes by pushing (such as presence detectors). Traditionally, applications have to be a mash up of accesses to devices and formats. To use the data in a cohesive application, the data has to be collected and integrated; this allows very low demands to be put on the devices themselves. The Igor architecture places a thin layer around a diverse collection of Internet of Things devices, hiding the data-",
  "content_length": 88305,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:45"
}