{
  "name": "Steve B. Furber",
  "homepage": "https://www.research.manchester.ac.uk/portal/steve.furber.html",
  "status": "success",
  "content": "Steve Furber - Research Explorer The University of Manchester Steve Furber, CBE FRS FREng DFBCS FIET CITP CEng Prof Emeritus Professor, Advanced Processor Technology https://orcid.org/0000-0002-6524-3367 Personal profile Memberships of committees and professional bodiesMemberships Royal SocietyRoyal Academy of EngineeringBritish Computer Society (BCS)IETAcademia EuropaeaIEEEMy groupAdvanced Processor Technologies (APT)Research interestsAPT ProjectsBiographySee personal web page. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital Futures Fingerprint Dive into the research topics where Steve Furber is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Neural Network Computer Science 100% Power Efficiency Computer Science 27% Chip Multiprocessor Computer Science 25% Microprocessor Chips Engineering 24% Simulation Time Computer Science 24% Many-Core Computer Science 22% Interconnects Engineering 20% Power Management Computer Science 18% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 134 Conference contribution 99 Article 12 Chapter 6 Paper 10 More 4 Poster 2 Book 1 Abstract 1 Editorial 1 Review article 1 Software Research output per year Research output per year BitBrain and Sparse Binary Coincidence (SBC) memories: Fast, robust learning and inference for neuromorphic architecturesFurber, S., Hopkins, M., Jones, E. & Fil, J., 21 Mar 2023, In: Frontiers in neuroinformatics. 17, p. 1-24 24 p., 17:1125844.Research output: Contribution to journal › Article › peer-review Open AccessFile IoT Application 100% Supervised Learning 100% Adaptive Learning 100% Memory Architecture 100% Parameter Space 100% 82 Downloads (Pure) Instrumental Conditioning with Neuromodulated Plasticity on SpiNNakerEnuganti, P. K., Bhattacharya, B. S., Gait, A., Rowley, A., Brenninkmeijer, C., Fellows, D. K. & Furber, S. B., 2023, Neural Information Processing - 29th International Conference, ICONIP 2022, Proceedings. Tanveer, M., Agarwal, S., Ozawa, S., Ekbal, A. & Jatowt, A. (eds.). p. 148-159 12 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 13624 LNCS).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Reinforcement Learning 100% Operant Conditioning 100% Behavior (Neuroscience) 50% Classical Conditioning 50% Neural Network 50% 2022 roadmap on neuromorphic computing and engineeringFurber, S. & et, A., 20 May 2022, In: Neuromorphic Computing and Engineering. 2, 2, 112 p.Research output: Contribution to journal › Review article › peer-review Open AccessFile Neuromorphic Computing 100% Electronic Circuit 33% 309 Downloads (Pure) Error driven synapse augmented neurogenesisPerrett, A., Furber, S. & Rhodes, O., 28 Oct 2022, In: Frontiers in Artificial Intelligence . 5, 19 p., 949707.Research output: Contribution to journal › Article › peer-review Open AccessFile Gradient Descent 100% Artificial Intelligence 100% Reinforcement Learning 100% Acquire Knowledge 100% Data-Stores 33% 39 Downloads (Pure) Event driven bio-inspired attentive system for the iCub humanoid robot on SpiNNakerD’Angelo, G., Perrett, A., Iacono, M., Furber, S. & Bartolozzi, C., 1 Jun 2022, In: Neuromorphic Computing and Engineering.Research output: Contribution to journal › Article › peer-review Open AccessFile 140 Downloads (Pure) View all 261 research outputs Projects 1 Finished 1 Not started Projects per year RAI: Centre for Robotics and Artificial IntelligenceCangelosi, A. (PI), Lennox, B. (PI), Weightman, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Fisher, M. (CoI), Herrmann, G. (CoI), Dickson, A. (CoI), Lanzon, A. (CoI), Stancu, A. (CoI), Miller, A. (CoI), Freitas, A. (CoI), Nini, A. (CoI), Voronkov, A. (CoI), Brass, A. (CoI), Vijayaraghavan, A. (CoI), Parslew, B. (CoI), crowther, W. (CoI), Grieve, B. (CoI), Adorno, B. (CoI), Jay, C. (CoI), Wang, C. C. L. (CoI), Todd, C. (CoI), Soutis, C. (CoI), Arsene, C. (CoI), Dresner, D. (CoI), Barrett, E. (CoI), Gowen, E. (CoI), Arvin, F. (CoI), Podd, F. (CoI), Brown, G. (CoI), Reger, G. (CoI), Cooper, G. (CoI), Mairs, H. (CoI), Yin, H. (CoI), Kinloch, I. (CoI), Eleftheriou, I. (CoI), Li, J. (CoI), Carrasco Gomez, J. (CoI), Ainsworth, J. (CoI), Sinha, J. (CoI), Ozanyan, K. (CoI), Smith, K. (CoI), Twomey, K. (CoI), Margetts, L. (CoI), Ren, L. (CoI), Zhang, L. (CoI), Cordeiro, L. (CoI), Rattray, M. (PI), Bissett, M. (CoI), Elliot, M. (CoI), Alvarez, M. (CoI), Luján, M. (CoI), Nabawy BSc, MSc, PhD, MRAeS, SMAIAA, FHEA, M. (CoI), Peek, N. (CoI), Marjanovic, O. (CoI), Dorn, O. (CoI), Dudek, P. (CoI), Green, P. (CoI), Connolly, P. (CoI), Da Silva Bartolo, P. J. (CoI), Gardner, P. (CoI), Martin, P. (CoI), Potluri, P. (CoI), Curtis, R. (CoI), Schmidt, R. (CoI), Banach, R. (CoI), Batista-Navarro, R. T. (CoI), Kaski, S. (CoI), Midson, S. (CoI), Watson, S. (CoI), Holm, S. (CoI), Furber, S. (CoI), Schlegel, V. (CoI), Mirihanage, W. (CoI), Mansell, W. (CoI), Pan, W. (CoI), Sampson, B. (CoI), Sellers, W. (CoI), Yang, W. (CoI), Cai, P. (CoI), Sun, Y. (CoI), Alharthi, A. (Researcher), Macario Rojas, A. (Researcher), Serhan, B. (Researcher), Yu, C. (Researcher), Abara, D. (Researcher), Lopez Pulgarin, E. (Researcher), Faruq, F. (Researcher), Tavella, F. (Researcher), Semeraro, F. (Researcher), Liu, G. (Researcher), Fang, G. (Researcher), Niu, H. (Researcher), Taylor, H. (PI), Zhu, H. (PGR student), Collenette, J. (Researcher), Amano, K. (Researcher), Lo, K. C. J. (PGR student), Raggioli, L. (Researcher), Romeo, M. (Researcher), Ruocco, M. (PGR student), Ghaffari Saadat, M. (Researcher), Walmsley, M. (Researcher), Mubarik, A. (Researcher), Vinanzi, S. (Researcher), Su, Y.-H. (PGR student), McAleese, H. (PGR student), Stringer, P. (PGR student), Stoican, R. (PGR student), Ye, R. (PGR student), Kurawa, S. S. (PGR student), Zhang, T. (PGR student), Krywonos, W. (PGR student), Xu, Y. (PGR student), Tian, Y. (PGR student), Henderson, A. (Technical team), Morley, D. (Support team), Tallentire, J. (Support team), Smith, J. (Support team), Hawthornthwaite, S. (Support team), Carlson, J. (Support team) & Baniqued, P. D. (Researcher)Project: Research Robot 100% Human Robot Interaction 22% Digital Twin 20% Cognitive Architecture 17% Autonomous System 17% Robotics and Artificial Intelligence for Nuclear (RAIN)Lennox, B. (PI), Arvin, F. (CoI), Brown, G. (CoI), Carrasco Gomez, J. (CoI), Da Via, C. (CoI), Furber, S. (CoI), Luján, M. (CoI), Watson, S. (CoI), Watts, S. (CoI) & Weightman, A. (CoI)2/10/17 → 31/03/22Project: Research Robot 100% Robotic System 37% Mobile Robot 26% Swarm Robotics 26% Formal Verification 23% Impacts SpiNNaker – enabling brain-inspired AIFurber, S. (Participant), Garside, J. (Participant), Lester, D. (Participant) & Rhodes, O. (Participant)Impact: Economic, Technological Datasets Supporting Data and Software for Event-based computation: Unsupervised elementary motion decompositionBogdan, P. (Contributor), Pineda Garcia, G. (Contributor), Davidson, S. (Contributor), Hopkins, M. (Contributor), James, R. (Contributor) & Furber, S. B. (Contributor), Mendeley Data, 11 Mar 2019DOI: 10.17632/wpzxh93vhx.1, https://data.mendeley.com/datasets/wpzxh93vhxDataset Implementation of BitBrain algorithm in CFil, J. (Creator), Hopkins, M. (Creator), Furber, S. (Creator) & Jones, E. (Creator), University of Manchester Figshare, 9 Dec 2022DOI: 10.48420/21679610, https://figshare.manchester.ac.uk/articles/software/Implementation_of_BitBrain_algorithm_in_C/21679610Dataset Spiking Neural Networks for Computer VisionBogdan, P. A. (Creator), Furber, S. B. (Contributor), Pineda-Garcia, G. (Contributor) & Hopkins, M. (Contributor), Mendeley Data, 9 Mar 2018DOI: 10.17632/84pvnm3rj3.1, https://data.mendeley.com/datasets/84pvnm3rj3Dataset Stochastic rounding and reduced-precision fixed-point arithmetic for solving neural ODEsHopkins, M. (Contributor), Mikaitis, M. (Contributor), Lester, D. (Contributor) & Furber, S. B. (Contributor), Mendeley Data, 25 Apr 2019DOI: 10.17632/wxx2mf6n5n.1, https://data.mendeley.com/datasets/wxx2mf6n5nDataset Structural plasticity on the SpiNNaker many-core neuromorphic systemBogdan, P. A. (Creator), Rowley, A. G. D. (Contributor), Rhodes, O. (Contributor) & Furber, S. B. (Contributor), Mendeley Data, 8 Mar 2018DOI: 10.17632/xfp84r5hb7.1, https://data.mendeley.com/datasets/xfp84r5hb7Dataset View all 6 datasets Press/Media MAIL ONLINE: Bring tech firm Arm back to the London stock market, demand City grandees, leading scientists and MPsFurber, S.17/02/221 Media contributionPress/Media: Expert comment NEW STATESMAN: Will a £100m investment solve the coding crisis in Britain’s schools?Furber, S.17/02/201 item of Media coveragePress/Media: Expert comment THE TELEGRAPH: How the end of Moore's Law will usher in a new era in computingFurber, S.6/12/191 Media contributionPress/Media: Expert comment THE GUARDIAN: Bionic neurons could enable implants to restore failing brain circuitsFurber, S.3/12/191 Media contributionPress/Media: Expert comment BUSINESS INSIDER: Pair of advisers appointed at DigitalBridgeShah, V. & Furber, S.14/10/191 item of Media coveragePress/Media: Expert comment View all 14 press/media",
  "content_length": 9866,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:13"
}