{
  "name": "Steven A. Wright",
  "homepage": "https://www-users.cs.york.ac.uk/~saw",
  "status": "success",
  "content": "Steven A. Wright CSE/135 Computer Science University of York YO10 5GH, UK Phone: +44 (0)1904 325583 I am a Senior Lecturer in Computer Science at the University of York, having joined the department in July 2018. I am a member of the Real-Time and Distributed Systems research group. My research is broadly focussed on High Performance Computing, in particular looking at the performance, programmability, and energy efficiency of supercomputers and the scientific computing applications running on them. Throughout my career I have collaborated widely with colleagues from national laboratories, universities and industry, including the US Department of Energy, the UK Atomic Energy Authority, the York Plasma Institute, Rolls-Royce, Intel, NVIDIA, ARM, and IBM. Prior to joining York, I was a Research Fellow within the High Performance and Scientific Computing (HPSC) research group at the University of Warwick, working on projects with the Centre for Fusion, Space and Astrophysics, Sandia National Laboratories and Rolls-Royce. I completed my Ph. D. at Warwick in 2014 with a thesis titled âMonitoring, Analysis and Optimisation of I/O in Parallel Applicationsâ. At York I have taught across the degree programme, and I currently serve as the Chair of the Board of Examiners. I currently lead the High-Performance Parallel and Distributed Systems (HIPC) module, and previously led the Software Testing (SOTE) module. While at Warwick, I led the Programming for Computer Scientists (CS118) module. Selected Publications TACO The Power-Optimised Software Envelope S. I. Roberts,Â S. A. Wright,Â S. A. Fahmy ,Â and S. A. Jarvis ACM Transactions on Architecture and Code Optimization (TACO) Aug 2019 URL DOI CPC EMPIRE-PIC: A Performance Portable Unstructured Particle-in-Cell Code M. T. Bettencourt,Â D. A. S. Brown,Â K. L. Cartwright,Â E. C. Cyr,Â C. A. Glusa,Â P. T. Lin,Â S. G. Moore,Â D. A. O. McGregor,Â R. P. Pawlowski,Â E. G. Phillips,Â N. V. Roberts,Â S. A. Wright,Â S. Maheswaran,Â J. P. Jones,Â and S. A. Jarvis Computer Physics Communications Aug 2021 URL DOI ICPP OP-PIC â an Unstructured-Mesh Particle-in-Cell DSL for Developing Nuclear Fusion Simulations Zaman Lantra,Â Steven A. Wright,Â and Gihan R. Mudalige In Proceedings of the 53rd International Conference on Parallel Processing Aug 2024 DOI CPC Developing performance portable plasma edge simulations: A survey Steven A. Wright,Â Christopher P. Ridgers,Â Gihan R. Mudalige,Â Zaman Lantra,Â Josh Williams,Â Andrew Sunderland,Â H. Sue Thorne,Â and Wayne Arter Computer Physics Communications Aug 2024 DOI",
  "content_length": 2583,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:30"
}