{
  "name": "Stuart M. Shieber",
  "homepage": "http://www.eecs.harvard.edu/shieber",
  "status": "success",
  "content": "Stuart M. Shieber / Harvard University Overview Stuart Shieber is a computer scientist whose primary research area is computational linguistics, the study of natural language from the standpoint of computer science. Research in the field pursues both scientific and engineering goals, undergirded by foundational formal and mathematical tools. Professor Shieber works on all of these aspects of the field. How natural languages are structured to permit efficient communication is a difficult and multi-faceted question, involving issues in linguistics (the syntactic and semantic structure of natural languages), theoretical computer science (the inherent complexity of aspects of human language); computer systems (in connection with the design and deployment of algorithms for natural-language analysis and generation); psychology (human sentence processing and misprocessing); and artificial intelligence (the encoding of general knowledge and its application to the understanding of utterances). To answer such difficult questions, Shieber synthesizes knowledge from several of these fields. In work on the computational properties of grammar formalisms — formal metalanguages for specifying the syntactic and semantic structure of natural languages — he uses techniques from theoretical computer science to analyze the expressivity and computational effectiveness of the formalisms, and builds on algorithms from the field of computer systems. (Such studies can shed light on computer languages as well as natural languages. For example, they reveal some deep similarities between the grammar formalisms proposed for natural languages and the static semantics of programming languages.) In his research on psycholinguistics, a simpler model of human misparsing of sentences was developed by applying technology from the efficient parsing of programming languages. Similarly, his research on semantics has made use of the technology of higher-order logic to explicate the workings of elliptical constructions of natural language. His current research on synchronous grammars for describing the relations between languages has application in a variety of natural-language-processing areas, such as machine translation and sentence compression. Beyond computational linguistics, Professor Shieber has attacked problems in a wide range of other areas as well, including such varied topics as automatically laying out charts, maps, and other informational graphics; novel interaction techniques for reading documents, laying out diagrams, or writing articles; the design of mechanisms that guarantee that online auctions are both fair and private; predicting which library books will need to be accessed, so as to store them in the optimal locations; reconstructing the tree structure of biological evolution; and the philosophical basis for Alan Turing’s test for machine intelligence. The range of topics is indicated in the accompanying listing of representative publications by research area.",
  "content_length": 2996,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:52"
}