{
  "name": "Stuart Russell 0001",
  "homepage": "http://www.cs.berkeley.edu/~russell",
  "status": "success",
  "content": "Stuart Russell Stuart Russell, OBE, FRS Zoom link for CS294 Distinguished Professor of Computer Science, University of California, Berkeley, and Smith-Zadeh Professor in Engineering; Professor of Cognitive Science; Professor of Computational Precision Health, UCSF; and Honorary Fellow of Wadham College, Oxford Mailing address: Computer Science Division 387 Soda Hall University of California Berkeley, CA 94720-1776 Office location: 8040 Berkeley Way West Office hours: by appointment Email: please contact my assistant, JP, at jp@humancompatible.ai Information for prospective MS and PhD students Information for prospective interns Research group (Russell's Unusual Group of Students) Research centers and affiliations: Center for Human-Compatible AI (CHAI) Kavli Center for Ethics, Science, and the Public (KCESP) Berkeley Artificial Intelligence Research (BAIR) Institute for Cognitive and Brain Sciences (ICBS) AI Institute for Agent-Based Cyber Threat Intelligence and Operation (ACTION) Program in Computational Precision Health (CPH) Research areas, including publications by area Publications in chronological order CV Biography: long (350 words), short (175 words), very short (75 words) Other useful pointers: 2021 Reith Lectures: Living With Artificial Intelligence Human Compatible: AI and the Problem of Control Artificial Intelligence: A Modern Approach Have the machines taken over? Video of interview by Richard Sargeant, Westminster Abbey, November 20, 2018. Rationality and Intelligence, slides from the IJCAI 95 Computers and Thought lecture. Learning in Rational Agents, slides from NIPS 97 invited talk. What is to be done?, slides from AAAI 08 invited talk. Life: Play and Win in 20 Trillion Moves , slides from SARA 2011 invited talk. Unifying Logic and Probability; A New Dawn for AI? , slides from the Colloquium Sorbonne-Universités, Jan 2013. The Long-Term Future of (Artificial) Intelligence, slides from AAAI 2015 invited talk. Artificial Intelligence: Implications for Autonomous Weapons, address to the United Nations meeting on Lethal Autonomous Weapons Systems, Geneva, April 2015. Killer Robots, the End of Humanity, and All That: What's a Good AI Researcher to Do?, slides from IJCAI 2015 invited talk. Future of Artificial Intelligence and the Human Race, video from TEDxYouth@EB, Ecole Bilingue de Berkeley, November 14, 2015. Three principles for creating safer AI, TED talk, Vancouver, April 25, 2017. Provably Beneficial Artificial Intelligence (starts at 55.25), IJCAI 2017 invited talk (slides here). Uncertainty in Objectives, slides from UAI 2018 invited talk. How Not to Destroy the World With AI, slides from AAAI 2020 keynote talk. Artificial Intelligence: Some Thoughts?, slides from IJCAI 2022 Research Excellence Award talk. How Not to Destroy the World With AI, slides from 2023 talk at Berkeley.",
  "content_length": 2850,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:54"
}