{
  "name": "Stuart Walker 0001",
  "homepage": "https://www.essex.ac.uk/people/walke72201/stuart-walker",
  "status": "success",
  "content": "Stuart Walker | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Stuart Walker People Professor Stuart Walker Professor School of Computer Science and Electronic Engineering (CSEE) Email stuwal@essex.ac.uk Telephone +44 (0) 1206 872413 Location 1NW.3.16, Colchester Campus Academic support hours Monday 1-3 pm 2601046169 Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Prof. Stuart Walker obtained his degree in Physics from Manchester University in 1973 and subsequently was awarded an M.Sc. in Telecommunications Systems and a Ph.D. in Electronics in 1975 and 1981 respectively; both from the University of Essex. In 1982 he joined British Telecom Research Laboratories in their submarine optical transmission systems division. At BT he pioneered the concept of unrepeatered transmission systems and in 1987 was promoted to head the transatlantic link repeater group. In 1988, he became Senior Lecturer at Essex University where his research interests widened to also include access network technologies. He was promoted to Full Professor in 2004. Recent involvement with the EPSRC included the platform grants EP/E04610X/1: Future Photonic Networks and GR/S82695/01: Next Generation Photonic Networks. He has maintained extensive involvement in EU projects projects such as MUSE-1, MUSE-2, UROOF, OASE, STRONGEST, FIVER, and SODALES. He has also been active in the Networks of Excellence, e-Photon/One, e-Photon/One+ and BONE. He leads the Access Group at Essex University which conducts research on wireless and wireline media for the last mile. Member of the Future Networks Research Group Access Networks Lab web pages (See also:staff research interests by category) Qualifications BSc MSc PhD Research and professional activities Research interests High-capacity optical network systems Open to supervise semiconductor laser characteristics Open to supervise broadband optical receiver design Open to supervise optical transmission Open to supervise local access architectures based on arrayed waveguide gratings Open to supervise video compression Open to supervise Current research active remote nodes for access networks Conferences and presentations 4. Femi-Jemilohun, Oladunni J and S.D.Walker Investigation of beam-forming effectiveness in 802.11ac indoor wireless links. Network Communications 2013. June 1st 2013 Istanbul. Istanbul, Turkey, 2013 5.Femi-Jemilohun, Oladunni J and S.D.Walker: OPTIMIZATION OF BEAMFORMING TECHNOLOGY FOR COGNITIVE SPATIAL ACCESS IN MILLIMETRE WAVE Applications ICTRS 2013 July 2013 Netherlands 6. S.D.Walker et al. On-the-Field Demonstration of Quintuple-Play Service Provision in Long-Reach OFDM-based WDM-PON Access Networks ECOC2013, September 2013 London. London, United Kingdom, 2013 1.Terence Quinlan, Nick Warren, Stuart Walker,A 1.5 GHz Bandwidth, Linear Polarisation Switchable, 5 GHz Crossed Rectangular Patch Antenna, Loughborough Antennas & Propagation Conference, Loughborough, November 2012. Loughborough, United Kingdom, 2012 2. Fariborz Mahmouli and S.D.Walker, Orbital Angular Momentum Generation in a 60- GHz Wireless Radio Channel, TELFOR 2012, Belgrade, November 2012 3. Anthony O. Adeyemi-Ejeye and Stuart D. Walker Ultra-High Definition Wireless Video Transmission using H.264 over 802.11n WLAN Challenges and Performance Evaluation. Zagreb CONTEL 2013 June 28-30,2013. Belgrade, Serbia, 2012 Teaching and supervision Current teaching responsibilities Analogue Circuit Design (CE263) Analogue Circuit Design (CE268) Networking Principles (CE703) Current supervision Joshua Oseremen Uduagbomen Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Geza Koczian Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision David Townend Thesis title: Wireless Transport for Centralised Mobile Network Architectures. Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 5/6/2024 Matthew Stephen Stanley Evans Thesis title: Rapid Dynamic Power Rail Switching of Ofdm Signal Amplifiers Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 15/3/2024 Salma Al-Mabrok S Al Arefi Thesis title: An Investigation of Micro-Hydro Power Generator Characteristics Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 9/11/2018 Adewale Abe Thesis title: High Speed 802.11Ad Wireless Video Streaming Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 2/7/2018 Yasser Obaid H Alharbi Thesis title: A Network-Aware Virtual Machine Placement Approach for Data-Intensive Applications in a Cloud Environment. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 12/2/2018 Naseem Mohammad Ramli Thesis title: An Investigation of Photovoltaic Power Optimization Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 7/8/2017 Akeem Aderibigbe Adebomehin Thesis title: Ultra-Wideband Ieee802.15.4A Cognitive Localization Methods for the 5G Environment. Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 3/7/2017 Cornelius Onuvoye Saiki Thesis title: A Novel Physical Layer Key Generation and Authenticated Encryption Protocol Exploiting Shared Randomness Degree subject: Electronic Systems Engineering Degree type: Master of Science (by Dissertation) Awarded date: 16/11/2016 Ali Mohammed S Alshahrani Thesis title: Tesseract: A 4D Symmetric Block Cipher Cryptography Solution for Real Time Applications Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 30/7/2015 Anthony Olufemi Tesimi Adeyemi-Ejeye Thesis title: Ultra-High Definition Wireless Video Streaming Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 23/3/2015 Oladunni Juliet Femi-Jemilohun Thesis title: Non-Line-Of-Sight Wireless Access Networks with Gigabit Throughput Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 5/3/2015 Geza Koczian Thesis title: Use of Visible Lasers in Standard and Few-Mode Fibre Networks Degree subject: Computing and Electronic Systems Degree type: Master of Science (by Dissertation) Awarded date: 22/9/2014 Ibrahim Kabiru MUSA Thesis title: Optimized Self-Service Resource Containers for Next Generation Cloud Delivery Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 11/8/2014 Publications Publications (3) Parker, MC., Jeynes, C. and Walker, SD., (2025). A Metric for the Entropic Purpose of a System Parker, MC., Jeynes, C. and Walker, SD., (2024). A Hyperbolic Sum Rule for Probability: Solving Recursive (“Chicken & Egg”) Problems Parker, MC., Jeynes, C. and Walker, SD., (2024). A Metric for the Entropic Purpose of a System Journal articles (125) Parker, MC., Jeynes, C. and Walker, SD., (2025). A Metric for the Entropic Purpose of a System. Entropy. 27 (2), 131-131 Townend, D., Walker, SD., Parkin, N. and Tukmanov, A., (2025). C-RAN and Optical Fronthaul Latency in Representative Network Topologies. IEEE Open Journal of the Communications Society. 6, 1438-1445 Parker, MC., Jeynes, C. and Walker, SD., (2025). A Hyperbolic Sum Rule for Probability: Solving Recursive (\"Chicken and Egg\") Problems.. Entropy. 27 (4), 352-352 Ngobigha, F., Koczian, G. and Walker, SD., (2024). Towards Mobile Data Centres: Provision of End-to-End 10 and 40 Gbit/s Ethernet Train Backbones on International Rolling Stock. IEEE Transactions on Vehicular Technology. 73 (2), 1890-1898 Ngobigha, F., Evans, M., Cummines, I., Koczian, G. and Walker, SD., (2024). Stochastic Power Supply Technologies for Energy-Efficient, Networked, and Sound-Reinforcement Systems. IEEE Access. 12, 119937-119945 Townend, D., Walker, SD., Tukmanov, A. and Sutton, A., (2024). Cell Site Densification Using mmWave and sub-THz Line-of-Sight Wireless Fronthaul: A Deployment Feasibility Study. IEEE Transactions on Antennas and Propagation. 72 (12), 9451-9461 Townend, D., Husbands, R., Walker, SD. and Sutton, A., (2023). Challenges and Opportunities in Wireless Fronthaul. IEEE Access. 11, 106607-106619 Townend, D., Walker, SD., Sharples, A. and Sutton, A., (2022). A Unified Line-of-Sight Probability Model for Commercial 5G Mobile Network Deployments. IEEE Transactions on Antennas and Propagation. 70 (2), 1291-1297 Kaka, AO., Toycan, M., Walker, SD. and Kavaz, D., (2020). Dual band, miniaturized, implantable antenna design with on-body antennas for wireless health monitoring. Applied Computational Electromagnetics Society Journal. 35 (4), 443-452 Niknia, E., Toycan, M. and Walker, SD., (2018). Energy efficient operation for a reconfigurable and self-interleaved optical access network. Computers and Electrical Engineering. 66, 189-199 Habib, U., Aighobahi, AE., Quinla",
  "content_length": 78623,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:53"
}