{
  "name": "Stuart Reeves",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/stuart.reeves",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Stuart ReevesAssociate Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom C15 School of Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/astuart.reeves@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~str Research SummaryI did my undergraduate degree in Computer Science and PhD in HCI at Nottingham. Having then held postdoc positions at University of Glasgow and subsequently the Horizon Digital Economy Research… read moreRecent Publications STUART REEVES, 2019. How UX practitioners produce findings in usability testing ACM Trans. Comput.-Hum. Interact.. 26(1), 3:1-3:38STUART REEVES and JORDAN BECK, 2019. Talking about interaction* International Journal of Human-Computer Studies. 131, 144-151STUART REEVES, 2019. Conversation considered harmful? In: Proceedings of the 1st International Conference on Conversational User Interfaces. 10:1-10:3JOEL E. FISCHER, STUART REEVES, MARTIN PORCHERON and REIN SIKVELAND, 2019. Progressivity for Voice Interface Design In: Proceedings of the 1st International Conference on Conversational User Interfaces. 26:1-26:8 View all publications Current ResearchI did my undergraduate degree in Computer Science and PhD in HCI at Nottingham. Having then held postdoc positions at University of Glasgow and subsequently the Horizon Digital Economy Research Institute, I was awarded an EPSRC Fellowship in 2013, and then became an Assistant Professor in 2017. I am currently a member of the Mixed Reality Lab and Horizon, as well as a Co-I for the Horizon CDT. In general I research social and collaborative technologies, investigating how people use diverse kinds of interactive devices and systems in real world situations and places. STUART REEVES, 2019. How UX practitioners produce findings in usability testing ACM Trans. Comput.-Hum. Interact.. 26(1), 3:1-3:38STUART REEVES and JORDAN BECK, 2019. Talking about interaction* International Journal of Human-Computer Studies. 131, 144-151STUART REEVES, 2019. Conversation considered harmful? In: Proceedings of the 1st International Conference on Conversational User Interfaces. 10:1-10:3JOEL E. FISCHER, STUART REEVES, MARTIN PORCHERON and REIN SIKVELAND, 2019. Progressivity for Voice Interface Design In: Proceedings of the 1st International Conference on Conversational User Interfaces. 26:1-26:8FISCHER, JOEL E, MARTINDALE, SARAH, PORCHERON, MARTIN, REEVES, STUART and SPENCE, JOCELYN, eds., 2019. HTTF 2019: Proceedings of the Halfway to the Future Symposium 2019 ACM. MARTIN PORCHERON, JOEL E. FISCHER, STUART REEVES and SARAH SHARPLES, 2018. Voice Interfaces in Everyday Life In: Proceedings of the 2018 ACM Conference on Human Factors in Computing Systems (CHI '18). PORCHERON, MARTIN, FISCHER, JOEL E., REEVES, STUART and SHARPLES, SARAH, 2018. Voice Interfaces in Everyday Life In: Proceedings of the 2018 ACM Conference on Human Factors in Computing Systems. STUART REEVES and MARTIN PORCHERON, 2018. Talking with Alexa The Psychologist. 31, 37-39STUART REEVES, CHRISTIAN GREIFFENHAGEN and ERIC LAURIER, 2017. Video Gaming as Practical Accomplishment: Ethnomethodology,\tConversation Analysis, and Play Topics in Cognitive Science. 9(2), 308-342RAPHAEL VELT, STEVE BENFORD and STUART REEVES, 2017. A Survey of the Trajectories Conceptual Framework: Investigating\tTheory Use in HCI In: Proceedings of the SIGCHI Conference on Human Factors in\tComputing Systems. 2091-2105STUART REEVES, 2017. Some conversational challenges of talking with machines In: Talking with Conversational Agents in Collaborative Action,\tWorkshop at the 20th ACM conference on Computer-Supported Cooperative Work\tand Social Computing (CSCW '17). BURAK TEKIN and STUART REEVES, 2017. Ways of spectating: Unravelling spectator participation in Kinect play In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1558-1570STUART REEVES and BARRY BROWN, 2016. Embeddedness and sequentiality in social media research In: Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing. STUART REEVES, MURRAY GOULDEN and ROBERT DINGWALL, 2016. The future as a design problem Design Issues. 32(3), BØDKER, SUSANNE, HORNBÆK, KASPER, OULASVIRTA, ANTTI and REEVES, STUART, 2016. Nine Questions for HCI Researchers in the Making interactions. 23(4), 58-61REEVES, STUART, GREIFFENHAGEN, CHRISTIAN, FLINTHAM, MARTIN, BENFORD, STEVE, ADAMS, MATT, ROW-FARR, JU and TANDAVANITJ, NICK, 2015. I’d Hide You: Performing Live Broadcasting in Public In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. JOEL FISCHER, STUART REEVES, TOM RODDEN, STEVE REECE AND\tSARVAPALI RAMCHURN and DAVID JONES, 2015. Building a Birds Eye View: Collaborative work in disaster\tresponse In: Proceedings of the SIGCHI Conference on Human Factors in\tComputing Systems. SUS LUNDGREN, JOEL FISCHER, STUART REEVES and OLOF\tTORGERSSON, 2015. Designing mobile systems for collocated interactions In: Proceedings of the ACM 2015 conference on Computer\tSupported Cooperative Work (CSCW). STUART REEVES, SARAH MARTINDALE, PAUL TENNENT, STEVE\tBENFORD, JOE MARSHALL and BRENDAN WALKER, 2015. The challenges of using biodata in promotional filmmaking ACM Transactions on Computer-Human Interaction. 22(3), 11REEVES, STUART, 2015. Locating the 'Big Hole' in HCI Research interactions. 22(4), 53-56STUART REEVES, 2015. Human-computer interaction as science In: Proceedings of the 5th decennial conference on Critical\tcomputing. LESLEY FOSH, STEVE BENFORD, STUART REEVES and BORIANA\tKOLEVA, 2014. Gifting Personal Interpretations in Galleries In: Proceedings of the SIGCHI Conference on Human Factors in\tComputing Systems. ABIGAIL DURRANT, DAVE KIRK and STUART REEVES, 2014. Human Values in Curating a Human Rights Media Archive In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. PETER TOLMIE, STEVE BENFORD, CHRIS GREENHALGH, TOM\tRODDEN and STUART REEVES, 2014. Supporting Group Interactions in Museum Visiting In: CSCW. ERIC LAURIER and STUART REEVES, 2014. 6 Cameras in video games: Comparing play in Counter-Strike and the\tDoctor Who Adventures. In: MATHIAS BROTH, ERIC LAURIER and LORENZA MONDADA, eds., Studies of Video Practices: Video at Work Routledge. PETR SLOVÁK, PAUL TENNENT, STUART REEVES and GERALDINE FITZPATRICK, 2014. Exploring Skin Conductance Synchronisation in Everyday\tInteractions In: NordiCHI '14: Proceedings of the 8th Nordic conference on \tHuman-computer interaction. 511-520JOEL E. FISCHER, STUART REEVES, STUART MORAN, CHRIS GREENHALGH and STEVE BENFORD, 2013. Understanding Mobile Notification Management in Collocated Groups In: European Conference on Computer Supported Cooperative Work (ECSCW '13). FOSH, L., BENFORD, S., REEVES, S., KOLEVA, B. and BRUNDELL, P., 2013. ‘See me, feel me, touch me, hear me’: trajectories and interpretation in a sculpture garden In: CHI '13 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, April 27–May 2, 2013, Paris, France. 149-158STUART REEVES, 2013. Building the future with envisioning interactions. 20(1), 26-29STUART REEVES, 2013. Human computer interaction issues in human computation. In: PIETRO MICHELUCCI, ed., Handbook of Human Computation Springer. 411-420REEVES, S., 2012. Envisioning ubiquitous computing In: CHI '12: proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1573-1582ALISTAIR MORRISON, DONALD MCMILLAN, STUART REEVES, SCOTT\tSHERWOOD and MATTHEW CHALMERS, 2012. A Hybrid Mass Participation Approach to Mobile Software Trials In: Proceedings of SIGCHI Conference on Human Factors in Computing\t\tSystems (CHI). BROWN, B., REEVES, S. and SHERWOOD, S., 2011. Into the wild: challenges and opportunities for field trial\tmethods In: CHI '11: proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1657-1666REEVES, S., 2011. Designing interfaces in public settings: understanding the role of the spectator in human-computer interaction Springer. LEIF OPPERMANN, MARTIN FLINTHAM, STUART REEVES, STEVE\tBENFORD, CHRIS GREENHALGH, JOE MARSHALL, MATT ADAMS, JU ROW\tFARR and NICK TANDAVANITJ, 2011. Lessons from Touring a Location-Based Experience In: Ninth International Conference on Pervasive Computing. 232-249MARTIN FLINTHAM, STUART REEVES, PATRICK BRUNDELL, TONY\tGLOVER, STEVE BENFORD, DUNCAN ROWLAND, BORIANA KOLEVA, CHRIS\tGREENHALGH, MATT ADAMS, NICK TANDAVANITJ and JU ROW FARR, 2011. Flypad: Designing Trajectories in a Large-Scale Permanent Augmented\tReality Installation In: European Conference on Computer-Supported Cooperative Work. 233-252SCOTT SHERWOOD, STUART REEVES, JULIE MAITLAND, ALISTAIR MORRISON,\tAND MATTHEW CHALMERS, 2011. Large Scale User Trials. In: JOANNA LUMSDEN, ed., Human-Computer Interaction and Innovation in Handheld, Mobile\tand Wearable Technologies IGI Global. 138-54STUART REEVES and SCOTT SHERWOOD, 2010. Five design challenges for human computation In: NordiCHI `10: Proceedings of the 6th Nordic conference on \tHuman-computer interaction. 383-392STUART REEVES, SCOTT SHERWOOD and BARRY BROWN, 2010. Designing for crowds In: NordiCHI `10: Proceedings of the 6th Nordic conference on \tHuman-computer interaction. 393-402STUART REEVES, BARRY BROWN and ERIC LAURIER, 2009. Experts at Play: Understanding skilled expertise Games and Culture. 4(3), 205-227DAVE WILLS and STUART REEVES, 2009. Facebook as a political weapon: Information in Social Networks British Politics. 4(2), BELL, M., REEVES, S., BROWN, B., SHERWOOD, S., MACMILLAN, D., FERGUSON, J. and CHALMERS",
  "content_length": 12368,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:52"
}