{
  "name": "Stéphane Deny",
  "homepage": "https://research.aalto.fi/en/persons/stephane-deny",
  "status": "success",
  "content": "Stephane Deny - Aalto University's research portal Contact expert Stephane Deny Assistant Professor Assistant Professor, Department of Computer ScienceAssistant Professor, Department of Neuroscience and Biomedical EngineeringAssistant Professor, Professorship Deny StephaneAssistant Professor, Computer Science Professors https://orcid.org/0000-0003-4707-128X Phone+358 50 9112153 Konemiehentie 2, Computer Science buildingFinland 20232025 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Stephane Deny is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Human Performance Computer Science 100% Deep Feed-Forward Network Computer Science 100% Self-Supervised Learning Computer Science 100% Data Augmentation Computer Science 100% World Application Computer Science 100% Average Accuracy Computer Science 100% Image Classification Computer Science 100% Large Data Set Computer Science 100% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2023 2025 2025 4 Article 1 Conference article in proceedings Research output per year Research output per year A comparison between humans and AI at recognizing objects in unusual posesOllikka, N., Abbas, A., Perin, A., Kilpeläinen, M. & Deny, S., Jan 2025, In: Transactions on Machine Learning Research. 2025, January, p. 1-32 32 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Language Modeling 100% And-States 100% Object Recognition 100% Generative Pre-Trained Transformer 4 100% Artificial Intelligence 100% 2 Citations (Scopus) 43 Downloads (Pure) On the Ability of Deep Networks to Learn Symmetries from Data – A Neural Kernel TheoryPerin, A. & Deny, S., 2025, In: Journal of Machine Learning Research. 26, p. 1-70 70 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Deep Network 100% Kernel Theory 100% Cyclic Group 100% Convolutional Neural Network 100% data 100% 3 Downloads (Pure) ViewFusion: Learning Composable Diffusion Models for Novel View SynthesisSpiegl, B., Perin, A., Deny, S. & Ilin, A., 2025, In: Transactions on Machine Learning Research. 2025-MayResearch output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Variable Number 100% 1 Downloads (Pure) Blockwise Self-Supervised Learning at ScaleSiddiqui, S. A., Krueger, D., Lecun, Y. & Deny, S., 2024, In: Transactions on Machine Learning Research. 2024Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Self-Supervised Learning 100% Supervised Learning 100% Hardware Design 33% Residual Neural Network 33% Energy Consumption 33% 20 Downloads (Pure) Progress and Limitations of Deep Networks to Recognize Objects in Unusual PosesAbbas, A. & Deny, S., 26 Jun 2023, AAAI-23 Technical Tracks 1. Williams, B., Chen, Y. & Neville, J. (eds.). AAAI Press, p. 160-168 (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 37, no. 1).Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open Access Large Data Set 100% World Application 100% Image Classification 100% Average Accuracy 100% Synthetic Datasets 100% Projects Projects per year 2023 2023 2027 2 Active Projects per year -: Deny NIDLDeny, S. (Principal investigator)01/09/2023 → 31/08/2027Project: Academy of Finland: Other research funding Deny NIDL: Moving away from pattern recognition towards visual reasoning with bio-inspired deep learningDeny, S. (Principal investigator), Perin, A. (Project Member), Khazoum, R. (Project Member), Popadina, A. (Project Member), Krylov, S. (Project Member) & Pöllänen, R. (Project Member)01/09/2023 → 31/08/2027Project: RCF Academy Project Human Performance 100% Deep Feed-Forward Network 100% Language Modeling 100% And-States 100% Object Recognition 100% Your message has successfully been sent. Your message was not sent due to an error. x Contact Stephane Deny Subject:* Message:* Your name:* Your email:* Send me a copy of this message *required field See privacy policy in the footer of the page Cancel Send",
  "content_length": 4831,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:57"
}