{
  "name": "Stéphane Ducasse",
  "homepage": "http://stephane.ducasse.free.fr",
  "status": "success",
  "content": "Dr. Stéphane Ducasse Stéphane Ducasse Home Home Pharo Publications Books Free Smalltalk Books Downloads/Resources Lectures and Presentations Coordinates INRIA RMOD email Current responsibilitiesSince September 2007, I'm research director at INRIA Lille leading the RMoD Team. During 10 years, I co-directed with O. Nierstrasz the Software Composition Group. I'm the president of ESUG. I co-founded Synectique a company that offered specific tools for Software analysis. I'm one of the leader of Pharo: a new exciting dynamic language. Check the Pharo consortium. Here is a short CV. My ORCID Number is 0000-0001-6070-6599.Awards and IndexesSome people consider that h-index is not a good criteria for researcher evaluation. To me this is just one among others. Trying to understand it, it looks like it shows a bit the width of your research (i.e., that several topics got reasonance within a community). Personally I do not work with this metrics in mind, I just try to publish the best results I have with my co-workers and thank them for their energy. According to google scholar my h-index is 61 (schoolar.g). I got laureate 2023 of \"Prix FIEEC Bpifrance de la Recherche appliquee 2023\" I got the \"Test of Time ECOOP 2023\" award for Traits: Composable Units of Behavior I got the Most Influencial Paper of Vissoft 2013 for Performance Evolution Blueprint I got laureate of ERC-Generator of I-Site financed by Programmes d'Investissements d'Avenir (I was the only CS researcher awarded). Since December 2012, I was promoted first class Directeur de Recherche. I received a \"Prime d'excellence scientifique\" from INRIA (2016). I got distinguished Visiting Fellowship Award of the Royal Academy of Engineering (2011). Veronica Uquillas Gomez won the Benevol most promising young research Award (2011). Mariano Martinez-Peck and Martin Diaz won for Fuel the 2011 ESUG Technology Award. Dynamic web development with Seaside: Our new free open-source Seaside book won the ESUG member 2010 best book Award. Michele Lanza (2003) and Alexandre Bergel (2006) PhD theses won the Ernest Denert foundation for Software Engineering Award. \"Learning Programming with Robots\" received the Award of PCPlus magazine of September 2005 and the Bitwise Recommended Award in February 2006. Reflection about UsersPharo 9.0 has 790 packages for 10658 classes and 143420 methods. It has around 250 forks on github https://github.com/pharo-project/pharo/ and Pharo is composed out of several github projects such as pharo-vcs, pharo-graphics, or pharo-spec. Pharo has around 18 regular contributors and up to 100 occasional ones. In addition Pharo has many users (we roughly estimate around 10 000) and Pharo is taught is around 30-40 universities worldwide and used by aroudn 30 research teams. It has also an industrial consortium. Pharo runs on 11 different platforms and multiple architectures 32/64 bits, / Intel/ARM. This raises the important question of how many citations is worth one real user (not one of our students). I do not have definitive answer on that point but it is important to understand that there is a Huge difference between a research prototype and a real system and Pharo is a real system with real customers. This requires a large development effort. We are lucky because Inria researcher evaluation takes this into account. Now this is an important question for funding agencies and any evaluation of my team.News Our paper: A New Generation of Class Blueprint received the Best paper award at VISSOFT'22 Our paper: Interpreter-guided Differential JIT Compiler Unit Testing has been accepted to PLDI'22 I was PC Chair of International conference on Software Reuse. New version of the Pharo Mooc is out Immersive and Agile Programming with Pharo. I gave a keynote at SCAM 2020 Powerful Tools for Live Development in Pharo. I gave a Master Class on Pharo for Inria Academy and Inria Chile. ICSE 2019: Our \"rotten green tests\" paper has been accepted . HCERES evaluation: \"Le GT GL produit une recherche qui couvre de nombreux aspects du Genie Logiciel. Sa recherche est d'excellente qualite et est connue et reconnue nationalement et internationalement. La production scientifique, le rayonnement et l'attractivite [...] sont exceptionnels pour les equipes RMoD et Spirals.\" I'm editor of a booklet collection. Check http://books.pharo.org My new book: Learning OOP, design and TDD in Pharo is out http://books.pharo.org New lectures on Object-Oriented Programming and Design is out. Check http://lectures.pharo.org Pharo Mooc got super appreciated. Check testimonies and all the files are freely accessible at http://mooc.pharo.org Join Pharo consortium http://consortium.pharo.org! There is also an academic partnership. Pharo By Example (Updated) is free and out (in spanish, french, english and japanese)! Check the Updated version for Pharo 50 (Working on the version for Pharo 90) Entreprise Pharo: a Web perspective is available and contains many really good chapters. Moose. Moose is a data and software analysis meta-described platform. Check the newest version! Research My research statement is double: (1) How can we help companies to support the evolution and maintenance of their large applications and (2) how can we improve languages to better support evolution? Maintenance and Software EvolutionI'm interested in all the aspects of software evolution and maintenance of large systems. I consulted for companies. Do not hesitate to contact me. I'm interested in your problems. Software engineering for the blockchain Software Evolution and Migration Software remodularisation Software Visualization Meta Modeling Supporting Merging Cycle and Layer Identification Integrated Software Developments Software Metrics and Quality Models Dynamic information and feature analysis Identification of Duplicated Code Reengineering Tools, Interexchange, and Infrastructure (Parsing...) Rules Checking and Testing Architecture Extraction and Validation Evolution, Reengineering Challenges and Patterns History-based Analyses and Mining Repositories Language DesignI'm interested in revisiting foundational bricks of object-oriented languages such as encapsulation, reuse, message passing. Now I start to work on isolation and security in reflective object-oriented languages. Components, Encapsulation and Language Features and Infrastructure Related Topics Traits: Intraclass reuse Scoping class extensions: Classboxes Software Modules and Aspects Dynamic Web Development Reflective Programming, Code Manipulation, and Bootstrap Virtual machines and other low-level concerns Clutter collector Object Dependencies Pharo benefits from our research and the inverse Some other work Editorial, teaching and vulgarisation Workshop Proceedings Teaching and Educative Support Computer Science Vulgarisation Program CommitteesHere are some of the international conferences I was PC member. I declined more often committee participation for health reason. I declined for ICSE 2013, ECOOP 2013, ECOOP 2014, ECOOP 2015 (but I was be the workshop chair), PLDI 2007, and OOPSLA 2006. I declined to be associate editor of SCP Journal because of the Elsevier policy regarding articles access. I also think that people should have less power and that there is a too large concentration in PCs. Some recent experiences showed that a PC would reject 60% of the papers than another would accept. Therefore we should really pay attention to our process in general and the conclusions we draw about them. ECOOP 2022. PC chair of International conference on Software Reuse. Onward 18, Program commity of APSEC 14. European Conference on Object-Oriented Programming (ECOOP 05, 07, 10) -- Core A *. International Conference on Software Maintenance (ICSM 05, 06, 07, 08, 10, 11) -- Core A. European Conference on Software Maintenance and Reengineering (CSMR 06, 07, 08). International Conference on Program Comprehension (ICPC 06, 07, 08). International Conference on the Unified Modeling Language (UML 03, 04, Models/UML 05, Models 06, 07, 09, 10) -- Core A. International Dynamic Languages Symposium (DLS 05, 06, 2020). International Symposium on Software Variability: a Programmers Perspective (SVPP 08). International Conference on Extreme Programming (XP 00, 01). International Conference on Objects, Models, Components, Patterns (TOOLS 2009, 2010, 2011). Working Conference on Reverse Engineering (WCRE 02, 05, 06, 10). International Conference on Software Composition (SC 09).",
  "content_length": 8468,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:56"
}