{
  "name": "Stéphane Demri",
  "homepage": "http://www.lsv.ens-cachan.fr/~demri",
  "status": "success",
  "content": "Laboratoire Spécification et Vérification Stéphane Demri Senior researcher, CNRS Publications on HAL Recent talks Lecture notes Course \"Logical Aspects of AI\" (2023 -- 2024). See the page of the course here. Course \"Initiation to research -- Scientific watch: uncertainty/temporal reasoning in AI\" (2023--2024). See the page of the course here. Proud member of the group Theory of structured data in the LIA SINFIN. GDR RADIA: Raisonnement, Apprentissage, et Décision en Intelligence Artificielle How to submit an article to Fundamenta Informaticae How to submit an article to Bulletin of the Section of Logic Second Workshop on Automated Deduction for Separation Logics (ADSL 2020) New Orleans, Louisiana, USA, January 20th, 2020. 34th AAAI Conference on Artificial Intelligence (AAAI-20) New York, NY, USA, February 7-12, 2020. International Joint Conference on Automated Reasoning (IJCAR 2020), Paris, France, July 2020 29th International Joint Conference on Artificial Intelligence (IJCAI'20), Yokohama, July 2020. 13th International Conference on Advances in Modal Logic (AiML 2020), Helsinki, Finland, August 2020 Highlights of Logic, Games and Automata 2020 (Highlights 2020), Aachen, Germany, September 14-18, 2020 Third International Workshop on Formal Methods in Artificial Intelligence (FMAI 2021), April 2021, London, UK 28th International Conference on Automated Deduction (CADE-28), July 2021, Pittsburgh, USA 30th International Conference on Automated Reasoning with Analytic Tableaux and Related Methods (Tableaux'21), Birmingham, UK, September 6-9, 2021 PGP Key About LSV News People Research Seminars Teaching Contact Private Pages English Français Contact Address LMF, CNRS & ENS Paris-Saclay4, avenue des Sciences 91190 Gif-sur-Yvette, France Office 2S53 Phone +33 1 81 87 54 37",
  "content_length": 1798,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:57"
}