{
  "name": "Stéphan Thomassé",
  "homepage": "http://perso.ens-lyon.fr/stephan.thomasse",
  "status": "success",
  "content": "Stéphan Thomassé homepage Stéphan Thomassé Professeur au département d'informatique de l'Ecole Normale Supérieure de Lyon Laboratoire / Laboratory : Laboratoire de l'informatique du parallélisme (LIP) Equipe / Research Team : Modèles de calcul, Complexité, Combinatoire (MC2) Membre de l'Institut Universitaire de France 2016-2021 Contact & Vita : LIP, ENS Lyon, 46 allée d'Italie, 69364 Lyon Cedex 07 - France. Tél. : 04 72 72 86 83 (de France) +33 472 728 683 (from abroad) Bureau / Office : 316 GN1 SUD Mail : firstname.name (no accents) at ens-lyon.fr (very old) Curriculum vitae : In french . En anglais. Enseignement / Teaching : Documents here are (often) only preliminary versions of the course notes, exams, midterms, etc. Use at your own risks. Algorithmique 1. L3 Informatique Fondamentale (2021-...). Exams: 2022, 2023, 2024, 2025 Midterms: 2022, 2023, 2024, 2025, 2026 Optimization and Approximation. M1 Informatique Fondamentale (2013-2016, 2021-...). Exams: 2013, 2014, 2015, 2016, 2022, 2023, 2025 Midterms: 2013, 2014, 2015, 2016, 2025 Introduction à l'Informatique. M2 Systèmes Complexes (2015-2016, 2021-...). Exams: 2012, 2022, 2023, 2024 Décompositions Arborescentes et Algorithmes FPT. M2 Informatique Fondamentale (2011-2013). Graphs and Polynomials. M2 Informatique Fondamentale (2013-2015). Probabilistic methods, with Applications to Graphs. M2 Systèmes Complexes (2014-2016). Fondements de l'Informatique. L3 Informatique Fondamentale (2015-2016). Information Theory. M1 Informatique Fondamentale (2017-2018). Computer Algebra. M1 Informatique Fondamentale (2018-2019). Lower bound methods. M2 Informatique Fondamentale (2017-2019). Graph Decompositions. M2 Informatique Fondamentale (2021-2023). Some course notes here Responsabilités Collectives / Admin / Contracts: Responsable du M2 Informatique Fondamentale (2013-2015). Directeur adjoint du département d'informatique. (2013-2015) Chef d'équipe MC2. (2015-2017, 2023-2025) Ancien membre des ANR GRAAL, AGAPE, STINT, COMPA. Membre de l'ANR Digraphs. Membre de l'ANR TWIN-WIDTH. Membre de l'ANR GODASse. Conférences / Workshops : Une liste de ceux auxquels j'ai participé. Séminaires / Seminars : Journées structures discrètes 1 et 2 du LIP. Graphes@Lyon Groupe de travail Graphes et Structures discrètes. GRAA Séminaire virtuel de théorie des graphes et combinatoire en Rhône-Alpes et Auvergne. G-Scop Seminar Le Séminaire de Mathématiques Discrètes de Grenoble. GT Graphes et Optimisation Le Séminaire de Graphes de Bordeaux. Combinatorics lectures online Link to many talks. Preprints and Drafts : Small hitting sets for longest paths and cycles. With S. Norin, R. Steiner and P. Wollan. Two-block paths in oriented graphs of large semidegree. With I. Penev, S Taruni, A. Trujillo-Negrete and M. Tyomkyn. Lollipops, dense cycles and chords. With Z. Dvorák, B. Martins and N. Trotignon. A tamed family of triangle-free graphs with unbounded chromatic number. With É. Bonnet, R. Bourneuf, J. Duron, C. Geniet and N. Trotignon. Twin-width VII: groups. With É. Bonnet, C. Geniet and R. Tessera. Graphs with large chromatic number induce 3k-cycles. With M. Bonamy and P. Charbit. Edge growth in graph cubes. With M. DeVos. Coloring dense graphs via VC-dimension. With T. Łuczak. Dense triangle-free graphs are four colorable: A solution to the Erdős-Simonovits problem. With S. Brandt. Computer Science Conferences : Dense Neighborhood Lemma: Applications of Partial Concept Classes to Domination and Chromatic Number . With R. Bourneuf and P. Charbit, FOCS 2025. A Polynomial-Time Approximation Algorithm for Complete Interval Minors. With R. Bourneuf, J. Cocquet and C. Tang, APPROX 2025. A structural description of Zykov and Blanche Descartes graphs. With M. Marin, N. Trotignon and R. Watrigant, WG 2025. On the complexity of Client-Waiter and Waiter-Client games. With V. Gledel, N. Oijid and S. Tavenas, ICALP 2025. Vertex-minor universal graphs for generating entangled quantum subsystems. With M. Cautrès, N. Claudet, M. Mhalla, S. Perdrix and V. Savin, ICALP 2024. Temporalizing digraphs via linear-size balanced bi-trees. With S. Bessy and L. Viennot, STACS 2024. Factoring Pattern-Free Permutations into Separable ones. With É. Bonnet, R. Bourneuf and C. Geniet, SODA 2024. Maximum Independent Set When Excluding an Induced Minor: K1 + tK2 and tC3 U C4. With É. Bonnet, J. Duron, C. Geniet and A. Wesolek, ESA 2023. Lossy Kernelization for (Implicit) Hitting Set Problems. With F. Fomin, T.N. Le, D. Lokshtanov, S. Saurabh and M. Zehavi, ESA 2023. First Order Logic and Twin-Width in Tournaments. With C. Geniet, ESA 2023. Twin-width V: linear minors, modular counting, and matrix multiplication. With É. Bonnet, U. Giocanti and P. Ossona de Mendez, STACS 2023. Sparse graphs with bounded induced cycle packing number have logarithmic treewidth. With M. Bonamy, É. Bonnet, H. Déprés, L. Esperet, C. Geniet, C. Hilaire and A. Wesolek, SODA 2023. Twin-width VIII: delineation and win-wins. With É. Bonnet, D. Chakraborty, E.J. Kim, N. Köhler and R. Lopes, IPEC 2022. Twin-width IV: ordered graphs and matrices. With É. Bonnet, U. Giocanti, P. Ossona de Mendez, P. Simon and S. Toruńczyk, STOC 2022. Twin-width VI: the lens of contraction sequences. With É. Bonnet, E.J. Kim and A. Reinald, SODA 2022. Twin-width and polynomial kernels. With É. Bonnet, E.J. Kim, A. Reinald and R. Watrigant, IPEC 2021. Twin-width III: Max Independent Set, Min Dominating Set and Coloring. With É. Bonnet, C. Geniet, E.J. Kim and R. Watrigant, ICALP 2021. Twin-width II: small classes. With É. Bonnet, C. Geniet, E.J. Kim and R. Watrigant, SODA 2021. Testing Balanced Splitting Cycles in Complete Triangulations. With V. Despré and M. Rao, CCCG 2020. Twin-width I: tractable FO model checking. With É. Bonnet, E.J. Kim and R. Watrigant, FOCS 2020. An Algorithmic Weakening of the Erdős-Hajnal Conjecture. With É. Bonnet, X.T. Tran and R. Watrigant, ESA 2020. Quasi-polynomial time approximation schemes for the Maximum Weight Independent Set Problem in H-free graphs. With M. Chudnovsky, M. Pilipczuk and M. Pilipczuk, SODA 2020. When Maximum Stable Set Can Be Solved in FPT Time. With É. Bonnet, N. Bousquet and R. Watrigant, ISAAC 2019. The independent set problem is FPT for even-hole-free graphs. With E. Husić and N. Trotignon, IPEC 2019. EPTAS for Max Clique on Disks and Unit Balls. With M. Bonamy, É. Bonnet, N. Bousquet and P. Charbit, FOCS 2018. Parameterized Complexity of Independent Set in H-Free Graphs. With É. Bonnet, N. Bousquet, P. Charbit and R. Watrigant, IPEC 2018. Subquadratic Kernels for Implicit 3-Hitting Set and 3-Set Packing Problems. With T.N. Le, D. Lokshtanov, S. Saurabh and M. Zehavi, SODA 2018. On the complexity of partial derivatives. With I. Garcia-Marco, P. Koiran and T. Pecatte, STACS 2017. A note on the minimum distance of quantum LDPC codes. With N. Delfosse and Z. Li, MFCS 2014. Parameterized algorithm for weighted independent set problem in bull-free graphs. With N. Trotignon and K. Vušković, WG 2014. Parameterized domination in circle graphs. With N. Bousquet, D. Gonçalves, G. Mertzios, C. Paul and I. Sau, WG 2012. Linear vertex-kernels through conflict packing: Application to FAST and RTI problems. With C. Paul and A. Perez, MFCS 2011. Multicut is FPT. With N. Bousquet and J. Daligault, STOC 2011. Hitting and harvesting pumpkins. With G. Joret, C. Paul, I. Sau and S. Saurabh, ESA 2011. Simultaneously satisfying linear equations over F2. With R. Crowston, M. Fellows, G. Gutin, M. Jones, E.J. Kim, F. Rosamond, I.Z. Ruzsa and A. Yeo, FSTTCS 2011. Kernel bounds for disjoint cycles and disjoint paths. With H. Bodlaender and A. Yeo, ESA 2009. A quadratic kernel for feedback vertex set, SODA 2009. Kernels for Feedback Arc Set in Tournaments. With S. Bessy, F. Fomin, S. Gaspers, C. Paul, A. Perez and S. Saurabh, FSTTCS 2009. A 3k kernel for Maximum Internal Spanning Tree. With F. Fomin, S. Gaspers and S. Saurabh, ISAAC 2009. On finding directed trees with many leaves. With J. Daligault, IWPEC 2009. A polynomial kernel for Multicut In Trees. With N. Bousquet, J. Daligault and A. Yeo, STACS 2009. Guarding art galleries: The extra cost for sculptures is linear. With L. Addario-Berry, O. Amini and J.S. Sereni, SWAT 2008. Three min-max theorems concerning cyclic orders of strong digraphs. With S. Bessy, IPCO 2004. Journals : First order logic and twin-width in tournaments and dense oriented graphs. With C. Geniet, European J. Combin., 132 (2026), 104247. Bounded twin-width graphs are polynomially chi-bounded. With R. Bourneuf, Advances in Combinatorics, (2025). Graphs without a 3-Connected Subgraph are 4-Colourable. With É. Bonnet, C. Feghali, T. Nguyen, A. Scott, P. Seymour and N. Trotignon, Electron. J. Comb, 32 (2025). (P6, triangle)-free digraphs have bounded dichromatic number. With P. Aboulker, G. Aubian and P. Charbit, Electron. J. Comb, 31 (2024). A quasi-quadratic vertex-kernel for Cograph Edge Editing. With C. Crespelle and R. Pellerin, Discrete Applied Mathematics, 357 (2024), 282-296. Clique covers of H-free graphs. With T. Nguyen, A. Scott and P. Seymour, European J. Combin., 118 (2024), 103909. Twin-width IV: ordered graphs and matrices. With É. Bonnet, U. Giocanti, P. Ossona de Mendez, P. Simon and S. Toruńczyk, J. ACM, 71 (2024), 3:21. Twin-width III: Max Independent Set, Min Dominating Set and Coloring. With É. Bonnet, C. Geniet, E.J. Kim and R. Watrigant, SIAM J. Comput., 53 (2024), 1602-1640. Sparse graphs with bounded induced cycle packing number have logarithmic treewidth. With M. Bonamy, É. Bonnet, H. Déprés, L. Esperet, C. Geniet, C. Hilaire and A. Wesolek, J. Combin. Theory Ser. B, 167 (2024), 215-249. Twin-width and permutations. With É. Bonnet, J. Nešetřil, P. Ossona de Mendez and S. Siebertz, Log. Methods Comput. Sci., 20 (2024), 3. Quasi-polynomial time approximation schemes for the Maximum Weight Independent Set Problem in H-free graphs. With M. Chudnovsky, M. Pilipczuk and M. Pilipczuk, SIAM J. Comput., ",
  "content_length": 23637,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:55"
}