{
  "name": "Su-In Lee",
  "homepage": "http://suinlee.cs.washington.edu",
  "status": "success",
  "content": "AIMS LabSearch this siteEmbedded FilesSkip to main contentSkip to navigation  AI for bioMedical SciencesJoin Our Lab – Available PositionsAbout the LabOur mission is to transform how AI is integrated with biomedicine, pushing the boundaries of both AI and science by addressing novel, forward-looking biomedical questions enabled by AI advances.Led by Professor Su-In Lee, the AIMS Lab is renowned for pioneering explainable AI (XAI)—including the SHAP framework and subsequent algorithms that have shaped the field—and for driving transformative discoveries in computational biology and medicine, recognized by honors such as the 2024 ISCB Innovator Award (full list here) and a strong record of highly cited publications.Our research spans from developing core AI/ML innovations to applying them in biomedical domains. Some projects are purely AI-focused, while others integrate AI with diverse biomedical data—including multi-omic, single-cell, images, sequence, and clinical data, and text—to open new frontiers in understanding health, disease, and therapeutics.Our Impact – ABCOur approach enables us to make impactful contributions across three areas:A. AI/ML: advancing XAI principles, interpretable representation, and controllable foundation modelsB. Biology: uncovering molecular drivers of complex phenotypes; discovering therapeutics for Alzheimer’s, cancer, and moreC. Clinical & healthcare: developing and auditing clinical AI models for safety, interpretability, and transparency📄 Learn more: Publications | Google ScholarCurrent Research ThemesAI & XAI InnovationFoundation Models: interpretability, controllability, and multimodalityExplainable agentic AI for Science: enabling autonomous scientific discoveryTransparency & Safety: ensuring reliable AI in high-stakes domainsInterpretable Representation Learning: embedding complex biological and clinical data into meaningful, trustworthy structuresTranslating AI to BiomedicineAlzheimer’s Targets: Uncover early cellular drivers and accelerate therapeutic target discovery.Aging & Rejuvenation: Identify molecular drivers of aging, biomarkers, and interventions for healthy aging.Cancer Precision Medicine: Identify interpretable biomarkers to guide precision therapy.Biological Embeddings: Generate interpretable embeddings for genes, proteins, cells, and images.Medical Image AI: Audit and interpret clinical AI models for safe, trustworthy use.Report abuseReport abuse",
  "content_length": 2441,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:00"
}