{
  "name": "Su White",
  "homepage": "https://www.ecs.soton.ac.uk/people/su",
  "status": "success",
  "content": "Dr Su White | Electronics and Computer Science | University of Southampton Electronics and Computer Science Dr Su White Publications Davis, H.C.D., Carr, L.A., Hey, J.M.N., Francois, S., Miles-Board, T., White, S.A. and Morris, D. (2009) Sharing and the institution: choosing, changing and engaging. ALT-C 2009 In Dreams Begin Responsibility: choice, Evidence and Change, Manchester, United Kingdom. 07 - 09 Sep 2009. 13 pp . Pau, Reena, Argles, David, White, S.A. and Lovegrove, Gillian (2005) Computer geek versus computer chic: IT career and IT education. 6th International Women into Computing Conference. 13 - 15 Jul 2005. Light, P, Nesbitt, E, Light, V and White, S (2000) Variety is the spice of life: Student use of CMC in the context of campus based study. Computers and Education, 34 (3-4), 252-267. Hall, Wendy, White, Su and Woolf, Beverly Park (1998) Interactive Systems for Learning and Teaching. Furht, Borko (ed.) In Handbook of Internet and Multimedia Systems and Applications. CRC Press LLC. pp. 375-398 . Hall, W and White, S (1997) Teaching and Learning Technology: Shifting the Culture. Armstrong, S, Thompson, G and Brown, S (eds.) In Facing up to Radical Changes in Universities and Colleges. Kogan Page. pp. 18-28 . Hall, W, Hutchings, GA and White, SA (1995) Breaking Down the Barriers: an Architecture for Developing and Delivering Resource-Based Learning Materials. Proceedings of the World Conference on Computers in Education, WCCE'95. pp. 623-634 . Hutchings, GA, Hall, W and White, SA (1994) Resource-Based Learning using an Open Hypermedia System. Proceedings of AETT'94, Exeter. Hutchings, GA, Hall, W, Davis, HC and White, SA (1994) Resource Based Learning: Creating Reusable Hypermedia for Education. Proceedings onf MediaActive'94, Liverpool. Hall, W, White, SA and Hutchings, GA (1994) The Resource-Based Approach to Teaching & Learning. Proceedings of the TLTP/CTI Conference on Evaluation, Dissemination and Implementation, Cardiff. Hall, W, White, SA and Hutchings, GA (1995) Shifting the Culture: the SCHOLAR Project. Proceedings of CAL'95, Cambridge, England. Piper, A, Wright, V, Hall, W and White, S (1995) Using Hypermedia for Language Learning: A Resource-Based Environment. Innovations in Education and Teaching International, 32 (3), 220-228. Hall, W and White, SA (1994) The SCHOLAR Project. Proceedings of ECHT'94, Glasgow. Wellington, S.J., Davis, H.C. and White, S.A. (2001) Populating the Testbank: Experiences within the Electrical and Electronic Engineering Curriculum. The 5th International Computer Assisted Assessment Conference., Loughborough. Davis, H.C. and White, S.A. (2001) Linking Experiences: Issues Raised Developing Linkservices for Resource Based Learning and Teaching. Okamoto, T., Hartley, R., Kinshuk, None and Klus, J (eds.) Second IEEE International Conference on Advanced Learning Technologies, Madison, United States. 0401-0405 . d'Inverno, Ray A, Davis, Hugh C and White, Su (2003) Using a personal response system for promoting student interaction. Teaching Mathematics and its Applications, 22 (4), 163-169. White, Su and Davis, Hugh C (2002) Harnessing Information Technology for Learning. In, Ketteridge, Steve, Marshall, Stephanie and Fry, Heather (eds.) The Efffective Academic: a handbook for enhanced academic practice. Kogan Page/Times Higher Education Supplement, pp. 232-246. Carr, LA, Davis, HC and White, SA (2004) AnnAnn - a Tool to Scaffold Learning about Programs. LTSN-ICS Fifth Annual Conference, Ulster, United Kingdom. Bull, Joanna, Danson, Myles, Conole, Grainne, Davis, Hugh, White, Su and Sclater, Niall (2002) Rethinking Assessment Through Learning Technologies. Proceedings of Winds of Change in the Sea of Learning: Charting the Course of Digital Learning (ASCILITE 2002) UNITEC, Institute of Technology, Auckland, New Zealand.. Davis, HC, Carr, LA, Cooke, EC and White, SA (2001) Managing Diversity: Experiences Teaching Programming Principles. The 2nd LTSN-ICS Annual Conference, London. 27 - 29 Aug 2001. White, SA, Davis, HC, Anslow, M, Green, R and Milne, I (2002) An Evaluation of the Impact of C&IT in Engineering Education. 2nd IEE Annual Symposium on Engineering Education, London. Davis, HC, White, SA and Dickens, KP (2001) Focusing on the Question: an XML Testbank. The 8th International Conference ALT-C, Edinburgh. Davis, HC, White, SA and Dickens, KP (2002) Engineering a Testbank of Engineering Questions. ICEE 2002: The International Conference on Engineering Education, Manchester. Davis, HC, Carr, LA and White, SA (2004) Conducting Examinations On-line. The 11th International Conference ALT-C, Exeter. White, SA and Davis, HC (2004) Continuing Professional Development for the Computing Academic: Wheeling in the Trojan Horse. In, Irons, A and Alexander, S (eds.) Effective Learning and Teaching in Computing. RoutledgeFalmer, pp. 161-171. White, Su (2004) New beginnings for CS1: the experience of a introducing a socially focussed pre-term group activity for Computing undergraduates. ACM SIGCSE 2005 Technical Symposium on Computer Science Education, St. Louis, Missouri, United States. 23 - 27 Feb 2005. Davis, Hugh C and White, Su (2005) A Research-Led Curriculum in Multimedia: Learning about Convergence. ACM ITiCSE: The 10th Annual Conference on Innovation and Technology in Computer Science Education, Universidade Nova de Lisboa, Portugal. 26 - 28 Jun 2005. pp. 29-33 . White, Su (2003) An examination of the impact of organisational constraints on change in UK Higher Education brought about by the introduction and use of learning technologies. University of Southampton, ECS, Doctoral Thesis. White, Su , Conole, Grainne and Oliver, Martin (eds.) (2000) Quality assurance and learning technologies:intersecting agendas in UK higher education. Quality Assurance in Education, 8 (1), 7-15. White, S A and Carr, L A (2005) Brave New World: Can We Engineer a Better Start for Freshers? 35th Annual ASEE/IEEE Frontiers in Education Pedagogies and Technologies for the Emerging Global Economy, Indianapolis, IN. 18 - 20 Oct 2005. pp. 26-31 . Sclater, N, Boyle, E, Bull, J, Church, C, Craven, P, Young, R, Danson, M, Halliday, M, Howie, L, Kelly, J.X, Lay, S, Massey, M, McAlpine, M, McDonald, M, Rogers, S and White, S.A. (2005) Defining the Infrastructure for a National Item Bank Service. Danson, M (ed.) Ninth International Computer Assisted Assessment Conference, Loughborough University, United Kingdom. 04 - 05 Jul 2005. pp. 1-19 . Wright, V and White, S (2001) Technology and Language Learning. In, Arthur, L and Hurd, S (eds.) in Supporting Lifelong Language Learning; theoretical and practical approaches. CILT, London. Light, Paul, Crook, Charles and White, S.A. (2000) Learning Sites: Networked Resources and the Learning Community. The New Review of Information Networking, 6, 187-194. Maier, Pat, White, Su and Barnet, E (1997) Using Educational Development Strategies to Integrate Learning Technologies within an HE institution. Active Learning, 6, 10-14. White, S , Tucker, Gillian (ed.) (1997) Shifting the Culture: Models of Institutional Change. TLTSN Case Studies - Technology in Teaching and Learning: Some Senior Management Issues, 10-11. Light, P, Crook, C, White, S, Nesbitt, E, Barrowcliff, D and Light, V , Tolmie, A (ed.) (1998) Learning sites: networked resources and the learning community. Journal of Computer Assisted Learning: Research Notes, 14 (2). White, S, Robinson, A, Udall, M and Dickens, K (2002) Increasing the Impact of Feedback from Assessments: The Mexican Hat Model. The International Conference on Engineering Education 2002, Manchester, United Kingdom. White, S A and Liccardi, I (2006) Harnessing Insight Into Disciplinary Differences To Refine E-Learning Design. 36th Annual ASEE/IEEE Frontiers in Education, San Diego CA. 27 - 31 Oct 2006. S3J5-S3J10 . White, Susan A and Liccardi, I (2006) DISCIPLINARY DIFFERENCES – Frameworks For Better Learning Design. IEEE ICALT2006 - The 6th International Conference on Advanced Learning Technologies, Kerkrade, The, Netherlands. 04 - 06 Jul 2006. McDowell, Liz, White, Su and Davis, Hugh C (2004) Changing assessment practice in engineering: how can understanding lecturer perspectives help? European Journal of Engineering Education, 29 (2), 173-181. White, SA, Carr, LA, Davis, HC, Hooper, CJ, Griffith, TP and Wills, GB (2006) ANNANN – Next Steps for Scaffolding Learning About Programs. The 6th IEEE International Conference on Advanced Learning Technologies (ICALT 2006), Kerkrade, The, Netherlands. 04 - 06 Jul 2006. Conole, Grainne, Smith, Janice and White, Su (2006) A Critique of the Impact of Policy and Funding. In, Conole, Grainne and Oliver, Martin (eds.) Contemporary Perspectives in e-learning Research. London. Routledge. Cook, John, White, Susan A, Sharples, Mike, Sclater, Niall and Davis, Hugh C (2006) The Design of Learning Technologies. In, Conole, Grainne and Oliver, Martin (eds.) Contemporary Perspectives in E-learning Research: Themes, methods and impact on. London. Routledge. White, Susan A and Irons, Alastair (2006) The Shape of Informatics: A UK Perspective. McGettrick, Andrew and McAlister, Gerry (eds.) Informatics Education Europe, Montpellier, France. Liccardi, Ilaria, Davis, Hugh and White, Su (2007) CAWS: A wiki system to improve workspace awareness to advance effectiveness of co-authoring activities. ACM CHI 2007 Work-in-Progress, San Jose, California, United States. 27 Apr - 02 May 2007. pp. 2555-2560 . Wang, Chu, Davis, Hugh, Dickens, Kate, Wills, Gary and White, Su (2007) Finding the Right Tool for the Community:Bringing a Wiki-Type Editor to the World of Reusable Learning Objects. The 7th IEEE International Conference on Advanced Learning Technologies (ICALT 2007), Niigata, Japan. 17 - 19 Jul 2007. v-xix . White, Su and Irons, Alastair , McGettrick, Andrew (ed.) (2007) Informatics in the UK: Current Perspectives. Innovation in Teaching And Learning in Information and Computer Sciences, 6 (3), 12-26. White, Su , Davis, H",
  "content_length": 30150,
  "method": "requests",
  "crawl_time": "2025-12-01 14:32:59"
}