{
  "name": "Suat Özdemir",
  "homepage": "https://web.cs.hacettepe.edu.tr/~ozdemir",
  "status": "success",
  "content": "Prof. Dr. Suat Ozdemir Suat Özdemir Professor Department of Computer Engineering Faculty of Engineering Hacettepe University Beytepe, Ankara, TURKEY. Office: 110 Office Hours: Appointment by email Email:ozdemir (at) cs.hacettepe.edu.tr Tel.: +90 (312) 297 7500 ext. 145 Fax: +90 (312) 297 7502 [CV] [Projects] [Publications] [Teaching] [Students] [Professional Activities] [AIoT Lab] [Google Scholar] [Publons] [DBLP] [Contact] Short Bio I have been with the Department of Computer Engineering at Hacettepe University, Ankara, Turkey since May 2020. Before joining Hacettepe University, I worked at the Computer Engineering Department at Gazi University between 2007 and 2020. Prior to that I received my MSc degree in Computer Science from Syracuse University (August 2001) and PhD degree in Computer Science from Arizona State University (December 2006). During my graduate study, I worked on wireless sensor network security. My dissertation title is \"Secure data aggregation and false data detection for wireless sensor networks\". In Gazi University, I served as assistant department head between 2010 and 2015. I also worked for TUBITAK from 2010 to 2014 as senior researcher. I am a member of IEEE and currently serving as editor/TPC member/reviewer for various leading IEEE and ACM journals and conferences. Click here for my full list of professional and administrative activities. You can also download my detailed CV. For my postal address and other details please click here. Research My research areas mainly include Internet of Things (IoT), IoT data analysis, wireless sensor networks, network security and data mining. I lead Artificial Intelligence of Things (AIoT) Lab (formerly known as KAVEM) where we are currently working on fog computing, IoT data analytics, IoT QoS, complex event processing and smartgrid security. I am also affiliated with WISE Lab. Here is the list of graduate students and postdocs I work/ed with. If you would like to be a part of my research group, please send your CV to me. Please follow below links for more information about my research laboratory, list of publications and projects. Artificial Intelligence of Things (AIoT) Lab List of Continuing and Past Projects List of Publications Sorted in Chronological Order List of Publications and Citation Data from Google Scholar List of Publications and Citation Data from ISI Thomson Reuters Teaching I regularly teach graduate and undergraduate level courses on Algorithms, AI, IoT, Machine Learning, Wireless Networks, Data Mining and Network Security. Most of my course material are available online. You can see my past courses here. Currently, I am teaching the following courses. Fall 2022: AIN427 Introduction to Data Mining Fall 2022: VBM683 Makine Öğrenmesi Fall in love with some activity, and do it! Nobody ever figures out what life is all about, and it doesn’t matter. Explore the world. Nearly everything is really interesting if you go into it deeply enough. Work as hard and as much as you want to on the things you like to do the best. Don’t think about what you want to be, but what you want to do. Keep up some kind of a minimum with other things so that society doesn’t stop you from doing anything at all. –Richard Feynman",
  "content_length": 3241,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:06"
}