{
  "name": "Subbarao Kambhampati",
  "homepage": "http://rakaposhi.eas.asu.edu",
  "status": "success",
  "content": "1Subbarao Kambhampati Subbarao Kambhampati ( సుబ్బారావు కంభంపాటి ) Professor! Dept. of Computer Science & Engg.,(Office: BY560) Fulton School of Engineering Arizona State University, Tempe Arizona 85287-5406 Phone: (480) 965-0113, Fax: (480) 965-2751, Email: rao who lives at asu.edu (Former President, AAAI; Fellow, AAAI, AAAS, ACM) Research: Yochan | Students | Robots | Publications | Surveys | Yochan | Yochan-I3 | Model-lite | Planning List | Press Teaching: Student Comments| Intro to AI | Info. Integ | Grad AI | Planning | ASU101 | Outreach.. | YouTube Channel Personal: CV| Bio | Travel | Usenet Postings | Doctors in the family | Photos Other: Blog! | Bibfinder | QUIC/QPIAD | ET-I3 | ICAPS Festivus Tutorials: Synthesizing Explainable and Deceptive Behavior for Human-AI Interaction (AAAI-20)| Preferences and Partial Satisfaction in Planning (AAAI-10) | Information Integration (AAAI-07) | Planning Graph Heuristics (IJCAI-07) | Learning for Planning (MLSS-06) | Advances in Planning (AAAI-00) | more.. I have written several columns on the impacts of AI for The Hill An interview with me in the series Humans of AI:Stories, Not Stats Polanyi's Revenge and AI's New Romance with Tacit Knowledge (CACM Viewpoint) Various media statements/interviews related to AI Videos of my recent research talks.. Checkout my over-the-top opening statement at the AAAI 2020 debate on Academic AI Research in an age of Industry Labs Talk at the 2020 Samsung AI Forum on Human-Aware AI Polanyi vs. Planning (Planning around AI's New Romance with Tacit Knowledge) (Invited talk at ICAPS 2020 DC). Defending Our Reality In the Era of Deep Fakes Talk at Big Data & AI Toronto Synthesizing Explainable Behavior for Human-AI Collaboration AAMAS 2019 Keynote (Montreal, May 15, 2019). (Here is a version of the talk given at the annual meeting of Taiwan Association of AI Challenges of Human-Aware AI Systems AAAI Presidential Address. (New Orleans, Feb 4, 2018) Distinguished lecture at Jonsson School; UT Dallas; Feb 2019) AI: Current and Emerging Capabilities and Research (A presentation given at National Academy of Science in March 2019) Keynote Presentation on AI/ML given at FCC Forum on AI/ML (Nov 30, 2018) Rise of AI: Status, Challenges, Impacts. A plenary public lecture given at TU Delft as part of ICAPS/CPAIOR 2018. (June 27, 2018) Our Relationship with AI Panel at the Computer History Museum, Mountain View, CA. September 2017. (on YouTube) AI & Cyber Security Presentation at National Academy of Science, August 2017. Origins Great Debate on \"Future of AI: Who is in Control?\" My \"Last Lecture\": You Can't Do That, Dave! Collaeral Lessons from a Computational Quest to Design HAL Check me out on the AI episode (Episode 3) of Bill Nye Saves The World on Netflix! ..yet more public talks (with videos) Visitor number since yesterday. Subbarao Kambhampati (Rao) was born a long long time ago in Peddapuram in Andhra Pradesh, India. After formative education at \"the school next to Cinema Hall\" (where he liked the teacher of the 1st grade so much that he stayed in that class for 2nd and 3rd grades too), the \"School behind Anjaneyaswamy Temple\" (which has since been demolished to make way for a sweet stall), Sri Veeraraju High School (S.V. Highschool), and Sri Raja Vatsavaayi Buchchi Seetayamma Jagapati Bahaddur Maharanee College (S.R.V.B.S.J.B.M.R. College, no less!), he survived JEE and did his Bachelors in Electrical Engineering (Electronics!--although he still couldn't repair the tape recorder to his father's satisfaction) at the Indian Institute of Technology, Madras (Alakananda, Jamuna & Tapati). Continuing along his degree grabbing spree, he landed a Masters and a Ph.D. degree in Computer Science from the University of Maryland, College Park. After a brief post-doctoral stint at Stanford, Rao has been having a blast crawling up the faculty hierarchy in the Computer Science department at ASU since 1991. He started as a quarter professor, became a half Professor in 1996 and a FULL (!) Professor in 2000. Continuing this geometric rise, his current goal is to become two professors very soon (he is waiting for the furlough season to pass first though, lest he be hit with two furloughs). Rao directs the Yochan research group which is associated with the AI Lab at ASU. In the good old days, he used to be mostly interested in planning and decision-making capabilities for autonomous agents. Lately he discovered humans, and decided they are fun to keep around as AI takes over the world. Accordingly, his current research agenda revolves mainly around human-aware AI systems. He is the recipient of a 1992 NSF Research Initiation Award, a 1994 NSF young investigator award, a 2001-2002 College of Engineering teaching excellence award, and a 2004 IBM Faculty Award and multiple Google Research Awards (2007, 2010, 2013 & 2016). In 2004, he was named a Fellow of AAAI (Association for Advancement of Artificial Intelligence). In 2011, he was selected by ASU students to give a Last Lecture. In 2017, he was elected a fellow of the American Association for the Advancement of Science (AAAS). In 2018, he was dubbed a \"distinguished almnnus\" by the Computer Science Department of University of Maryland, College Park (with his own wall plaque and all!). In 2019, he was named a fellow of the Association for the Computing Machinery (ACM). In 2022, IIT Madras also relented and recognized him as a \"distinguished alumnus\" of the Institute!. He is also the recipient of the 2025 AAAI/EAAI Patrick H. Winston Oustanding Educator Award. Within his department, he has been recognized both for his teaching (Teacher of the year, 2012) and research (Best Researcher, 2005, 2017). What Rao lacks in a Wikipedia page, he more than makes up with his IMDB page. He has been an invited speaker at multiple conferences starting way back with AAAI 1996 and . He also gave a couple of well received tutorials on planning and databases, including one on automated planning (AAAI-2000), one on information integration on the web (AAAI-2002 and AAAI-2007), and one on planning graph heuristics (ICAPS 2006, IJCAI 2007). Click here for further biographical information. Here is a detailed CV in pdf. Professional service: Rao served as the president of AAAI, the Association for the Advancement of Artificial Intelligence, and did his bit to save the world from the impending Robot armageddon. He was also a founding board of director of Partnership on AI . More recently, he is serving as the chair of AAAS Section T (Information, Communication and Computation). In 2013, Rao has been elected to the IJCAI Board of Trustees, and had great fun program-chairing the first-ever leap year edition of IJCAI 2016 that just concluded in New York. In the past, Rao served as the program co-chair for the 2005 National Conference on Artificial Intelligence AAAI-05, which in the impartial opinion of many people such as him was the best AAAI ever (at least in 2005..). More, recently he co-chaired the 2010 AAAI special track on AI & Web, and served as a councilor for AAAI for a thr ee year term 2009-2012. He served as the conference committee chair for AAAI during 2012-2014. Rao served as the program co-chair for ICAPS 2013 and as an area chair for IJCAI 2013. He will be a senior program committee member for AAAI and ICAPS in 2014. He also co-chaired the 2000 AI Planning and Scheduling (AIPS) Conference, sat on the exalted ICAPS executive committee (2002-2008). He is on the editorial board of ACM Transactions on Intelligent Systems and Technology and IEEE Intelligent Systems, and serves on the advisory board of JAIR (for which, he was an associate editor earlier). He also served on the editorial board for the AI Magazine. He had been on the progam committees of most AAAIs since 1992; all AIPS, (most) ECP and all ICAPS conferences, as well as a smattering of database conferences. He served on the senior program committees of AAAI 2006,2008,2011,2012 and IJCAI 2007 (area chair) and 2009. His professional service and his late-night TV viewing intersected for once recently when he agreed to run the first-ever Festivus at an academic conference! Publications: Here are online versions of Rao's (okay, mostly his students') publications. There is mounting evidence that at least some of these are actually read by others. One of them even received a runner-up award for 10 year influential paper at ICAPS 2010. You can also find Rao's tutorials/survey talks and such here Talks & Tutorials: Here are some of the recent overview talks and tutorials: Wittgenstein's papers and Faraday's talks: Maxims for a Milk-fed Researcher (An invited talk given at IJCAI 2013 Doctoral Consortium) Back to the Future of Planning, talk at ACAI/ICAPS Summer School on Automated Planning and Scheduling Incomplete Domain Models, Uncertain Users and Open Worlds: Model-Lite Planning for Autonomy in the Presence of Humans, talk at ONR/IPAM Machine Reasoning workshop. Oct 2010. Preferences and Partial Satisfaction in Planning. A tutorial delivered at AAAI 2010 (with J. Benton and Jorge Baier). Incomplete domain models, uncertain users and open worlds: Foundations of Model-lite Planning Seminar at CMU Robotics Institute; 4/2/2010 (Streaming video) How to write a good paper (An invited mentoring talk at ICAPS 2009 Doctoral consortium) Real World Planning: Soft Constraints & Incomplete Models (Colloquium talk given at IHMC and WUSTL CSE during Sept/Oct 2007) and IIT Madras in July 2008. Slides (pdf and ppt) and Audio (WUSTL). Human-Aware AI (talk given at UW seminar on \"Future of AI\", Nov 2007) (ppt and audio) Do Robots need a Bill of Rights? (A Science Cafe Discussion with Attorney David Calverley at AZ Science Center, Nov 2007) (Audio). Learning for Planning, a tutorial given at ICAPS 2007 (joint with Sungwook Yoon). Information Integration on the Web (AAAI 2007 Tutorial with Craig Knoblock) Planning & Scheduling with Oversubscribed Resources, Preferences and Soft Constraints (AAAI 20",
  "content_length": 28464,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:00"
}