{
  "name": "Subbayyan Venkatesan",
  "homepage": "https://www.utdallas.edu/~venky",
  "status": "success",
  "content": "U.T.Dallas Computer Science Program S. Venkatesan E-mail:  venky@utdallas.edu Office: (972) 883-2452 S. Venkatesan (Venky)  received the B.Tech. and M.Tech. degrees from the Indian Institute of Technology, Madras in 1981 and 1983, respectively, and the M.S. and Ph.D. degrees in Computer Science from the University of Pittsburgh in 1985 and 1988, respectively. He joined the Computer Science Program at UTD in January 1989 where he is currently a Professor. Venky has been a consultant for a number of companies in the Dallas area. Courses he is teaching: CS 6390 Advanced Computer Networks CS 4348 Operating Systems Concepts CS 6380 Distributed Computing Research Interests Current research efforts are in wireless sensor networks and its application to medical instrumentation, cognitive radio networks, mobile ad hoc networks (MANETs), fault tolerance, distributed algorithms, telecommunication networks, and mobile computing. Recent Research Projects Wireless Mesh Networks, State of Texas Emerging Technologies Fund, $2,000,000. Prime: AgileMesh, Sub: Utd. UTD's part: $157,049, 2010-2011, PI: Ravi Prakash, Co-PI: S. Venkatesan. MRI Consortium: Development of Wireless Networking Testbed and Emulator (WiNeTestEr), National Science Foundation, 09/15/10-09/14/14, $1,139,039. Consortium proposal with Southern methodist University. UTD's part: $498,230, PI: Ravi Prakash, Co-PIs: Baskar Banerjee, Neeraj Mittal, S. Venkatesan. Research in Wireless Networks, $40,000 Unrestricted Gift, 2008--2010, Research in Motion. ``Texas Networking Testbed,\" $1,500,000 (UTD's component: $673,000; $385,000 in cash and $288,0000 in equipment), Defense Microelectronic Activity, Prime: Crane Aerospace, Subcontractor: UTD), June 1, 2008--May 31, 2009, PI: S. Venkatesan, Co-PIs: R. Prakash and N. Mittal. ``Texas Networking Testbed,\" $1,008,000 (UTD's component: $326,017), Defense Microelectronic Activity, Prime: Crane Aerospace, Subcontractor: UTD), June 1, 2007--May 31, 2008, PI: S. Venkatesan, Co-PIs: R. Prakash and N. Mittal. ``Techniques for node registrations,\" $15,120, xG Technology, Inc. February 1--May 31, 2007. ``Development of sensor hardware and wireless network testbeds,\" $20,000, Information Warfare Directorate (Prime: Signal Technology), 10/16/06 - 4/2/07, PI: S. Venkatesan , Co-PI: Ravi Prakash. ``Network-Centric Operations and Warfare Modeling and Simulation Integration Center,\" $200,000, Rockwell Collins, Inc. , September 1, 2005--August 31, 2007 (with R. Prakash and N. Mittal). ``Research and Development of 3GE-WLAN Seamless Handover for 3GPP Evolution User Equipment,\" ETRI, Korea ($100,000), September 2005--August 2006 (with R. Prakash). ``Development of sensor hardware and wireless network test beds,\" $90,000 ($78,000 in cash and $12,000 in new equipment), Signal Technology, September 2005--August 31, 2007 (with R. Prakash) ``Research in search technologies,\" $17,000, Unrestricted Gift, Sabre Holdings. ``Environment Monitoring in Warehouses using Sensors and Sensor Networks,\" Crystal Technology & Industries, Inc., $35,000, September 1 2005--August 31, 2006. ``A Sensor Network and Mobile Ad hoc Network Testbed,\" $25,000, Unrestricted Gift, Rockwell Collins, Inc. ``Smart Transducers for Sensor Networks\", Williams-Pyro (Prime) from National Institute of Science and Technology, $14,289, December 2003-May 2004. ``Mobile Collaboration in Multi-Security Level Domains\" (With Duncan MacFarlane), Department of Navy (as a subcontract; Prime: Asier Technology Corp.) July 2003-August 2005, $23,727. ``Advanced Radar and Electro-Optical Sensor Systems\" (with A. Fumagalli, P. Balsara, F. Bastani, D. Bhatia and I-L. Yen), US Army Space and Missile Defense Command, $210,000, June 2002 to June 2004. `` Causally ordered broadcast in mobile wireless networks,'' Raytheon-E Systems, $35,000, January - December 1997. ``Research in mobile computing (Matching grant),'' Electrospace Systems, Inc., $15,000, May 1996 - December 1996. ``Research in mobile computing,'' Texas Instruments, Unrestricted, $7,500. ``A framework for the design and development of wireless networks and mobile computing systems,'' Texas Advanced Technology Program, $136,790, January 1996 - August 1998. ``Data management in mobile wireless environments,'' Electrospace Systems, Inc., $30,000, June 1994 - October 1995 ``Efficient on-line restoration in telecommunication networks,'' Alcatel Network Systems, $46,500, March 1993 - February 1994. ``Network modeling and optimization problems,'' Alcatel Network Systems, $90,000, May 1992 - February 1993 (with G.R. Dattatreya). ``Validating protocols by software testing,'' Texas Advanced Technology Program, $88,670, January 1992 - August 1994. ``Design of reliable distributed systems through software testing and crash recovery,'' Research Initiation Award, National Science Foundation, $36,626, September 1991 - August 1995. Patents ``Method and system for restoring a distributed telecommunications network'' U.S. Patent 5,999,286, Issued on December 1999. ``Skeletal node rules for connected dominating set in ad hoc networks,\" U.S.Patent 7,606,171, issued October 2009. Recent Journal Publications Human Abnormal Detection PDF Version Golf Training Using Sensors PDF Version Dynamic Signature Verification PDF Version S. Krishnamurthy, N. Mittal, R. Chandrasekaran, and S. Venkatesan, \"Neighbor discovery in multi-receiver cognitive radio networks,\" International Journal of Computers and Applications, Vol 31, Number 1, pages 50-57, January 2009 S. Krishnamurthy, N. Mittal, R. Chandrasekaran, S. Venkatesan and Y. Zeng, \"On Neighbor Discovery in Cognitive Radio Networks,\" Journal of Parallel and Distributed Computing, Volume 69, Issue 7, pages 623-637, July 2009. N. Mittal, F. Freiling, S. Venkatesan and L. Penso, ``On Termination Detection in Crash-Prone Distributed Systems with Failure Detetors,\" Journal of Parallel and Distributed Computing, Volume 68 (2008) pp 855--875. S. Krishnamurthy, M. Thoppian, S. Kuppa, R. Chandrasekaran, N. Mittal, S. Venkatesan and R. Prakash, ``Time-efficient Distributed Layer-2 Auto-configuration for Cognitive Radio Networks,\" Computer Networks, Vol 52, Issue 4, pp 831--849, 2008. ``M. Patel, R. Chandrasekaran, and S. Venkatesan, Improved quasi path restoration in mesh networks,\" IEEE/ACM Transaction on Networks Vol 16, Number 1 (2008), pp 143--155. ``A family of optimal termination detection algorithms\" (with N. Mittal and S. Peri), Distributed Computing, 2007, 20:141--16. ``Efficient Minimum-Cost Bandwidth-Constrained Routing in Wireless Sensor Networks\" (with M. Patel and R. Chandrasekaran), Special Issue on \"Wireless Networks and Pervasive Computing, Journal of Pervasive Computing and Communications (JPCC), vol 2, no 2, 2006. PDF Version ``Low-Intrusive consistent disk checkpointing: A tool for digital forensics'' (with S. Sitaraman), Journal of Universal Computer Science (in Volume 11, Issue 1)pp 20--36, 2005. PDF Version ``A Feedback Based Scheme For Improving TCP Performance In Ad-Hoc Wireless Networks'' (with K. Chandran, S. Raghunathan and R. Prakash), IEEE Communications Magazine, February 2001, pp 34-39. PDF Version ``Techniques to Tackle State Explosion in Global Predicate'' (with S. Alagar) IEEE Transactions on Software Engineering, Volume 27, Number 8 August 2001, pp 704--714. PDF Version ``Spare Capacity Assignment in Telecom Networks using Path Restoration and Further Improvement using Traffic Splitting'' (with J. Veerasamy and J. Shah), Journal of Systems and Software, Vol 47 (1999), pp 27--33. ``Causal ordering in distributed mobile systems'' (with S. Alagar) IEEE Transactions on Computers, Volume 46, Number 3, March 1997, pp 353--361. PDF Version ``Optimistic crash recovery without changing application messages'' (with T. Juang and S. Alagar), IEEE Transactions on Parallel and Distributed Systems, Volume 8, Number 3, March 1997, pp. 263--271. PDF Version ``Testing and debugging distributed programs using global predicates'' (with B. Dathan), IEEE Transactions on Software Engineering, Volume 21, Number 2, February 1995, pp. 163--177. PDF Version ``Making fault-sensitive algorithms tolerate link failures'' (with K. Ramarao), Journal of Parallel and Distributed Computing, Vol 30, No. 1, Oct 1995, pp 64--75. \"Efficient algorithms for optimistic crash recovery\" (with T. Juang), Distributed Computing,, Vol. 8, 1994, pp 105--114. \"Computing associative functions distributively in spite of link failures\" (with K. Ramarao), Journal of Parallel and Distributed Computing,, Vol. 23, No. 3, 1994, pp 399--410. \"Optimistic crash recovery without rolling back non-faulty processors\" (with T. Juang), Information Sciences, 78 (1994), pp. 49-68. \"An optimal algorithm for recording snapshots using casual message delivery\" (with S. Alagar), Information Processing Letters, 50 (1994), pp. 311-316. \"Two lower bounds on distributed shortest path\" (with K. Ramarao), Information Processing Letters, 48 (1993), pp. 145-149. \"Time and message optimal crash recovery in tree networks\" (with T. Juang), Journal of Information Science and Engineering, Vol. 9, pp. 103-122, 1993. \"Message-optimal incremental snapshots,\" Journal of Computer and Software Engineering 1 (1993), pp. 211-231. \"On finding and updating shortest paths distributively\" (with K. Ramarao), Journal of Algorithms, Vol. 13, No. 2, June 1992, pp. 235-257. \"A Message optimal algorithm for distributed termination detection\" (with S. Chandrasekaran), Journal of Parallel and Distributed Computing, Vol. 8, pp 245--252, 1990. \"Reliable protocols for distributed termination detection,\" IEEE Transactions on Reliability, Vol. 38, No. 1, April 1989, pp 103--110. PDF Version Book Chapter \"Computer and Network Forensics\" (with S. Sitaraman), Digital Crime and Forensic Science in Cyberspace. Recent Conference Publications Burchfield, R., Venkatesan, S. A Framework for Golf Training Using Low-Cost Inertial Sensors, Proceedings of Body Sensor Networks June 2010, Singapore. Nourbakhsh, E., ",
  "content_length": 29012,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:04"
}