{
  "name": "Subhankar Mishra",
  "homepage": "https://www.niser.ac.in/~smishra",
  "status": "success",
  "content": "Subhankar Mishra What's New Project positions at Lab (Deadline 09 Dec, 2025 2pm IST) CS2404 02 Research Scholars CS2403 02 Research Scholars 11/25 CS Katha Barta concludes for this year. See you all next year! 11/25 (Paper) Discover Robotics Multimodal two-wheeler driving dataset for autonomous driving applications Jyothish, Shriman, Anubhav 11/25 (Paper) QC+AI 2026 (AAAI) - QGShap: Quantum Acceleration for Faithful GNN Explanations Haribandhu, Jyotirmaya 11/25 (Paper) NLDL 2026 - HetGSMOTE: Oversampling for Heterogeneous Graphs Adhilsha, Deependra, Rucha [OpenReview] 11/25 (Paper) TMLR - Robustness in Large Language Models: A Survey of Mitigation Strategies and Evaluation Metrics Pankaj [OpenReview] 10/25 (Paper) CODS 2025 - Fast and Memory-Efficient GPU Tensor Train Decomposition via Parallel TT-SVD Archana, Sagar 10/25 (Paper) CODS 2025 - iWatchRoad: Scalable Detection and Geospatial Visualization of Potholes for Smart Cities Rishiraj, Surbhi [arXiv] 09/25 (Paper) DAACH - Digitising temples for heritage conservation: Kalinga architecture Annada [ScienceDirect] 09/25 (Paper) 16th ICKG, 2025 - Label Informativeness-based Minority Oversampling in Graphs (LIMO) Rishav, Sikta, Rucha | [OpenReview] 06/25 (Paper) Journal of Insect Conservation - Image-based South Asian bee species identification: A machine learning approach Srinivas C L, Sreerag M, Ronita Mukherjee, Soubhadra M Dey, Ritik Deb | [Springer] 05/25 Hackduino 4.0 results are out. [Link] 04/25 (Paper) Artificial Intelligence in Oral Health Harishankar, Shithij, Antonin | [Springer] 03/25 (Paper) Retinal Fundus Multi-Disease Image Classification Using Hybrid CNN-Transformer-Ensemble Architectures Deependra, Saksham | [Springer] | [arXiv] 02/25 (Paper) PAKDD 2025 - Graph Neural Networks at a Fraction Rucha, Sagar, Nidhi (Microsoft) | [arXiv] 01/25 Became a member, National Working Group (NWG)-12 2025-2028, International Telecommunication Union (ITU-T) | SG12 Archive - 2024, 2023, 2022, 2021, 2020",
  "content_length": 1985,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:10"
}