{
  "name": "Subhransu Maji",
  "homepage": "http://people.cs.umass.edu/~smaji",
  "status": "success",
  "content": "subhransu maji - umass amherst - computer vision Subhransu Maji Professor CICS, UMass Amherst smaji@cs.umass.edu office: 274 cs home group research teaching About me I am Professor in the Manning College of Information and Computer Sciences at the University of Massachusetts Amherst, where I also serve as Co-Director of the Computer Vision Lab. Prior to joining UMass Amherst, I was a Research Assistant Professor at TTI Chicago. I obtained my PhD under the supervision of Jitendra Malik from the University of California, Berkeley, in 2011, and a BTech in Computer Science and Engineering from IIT Kanpur in 2006. In the past, I have enjoyed working at the University of Amsterdam, AWS AI, Google, INRIA, Microsoft Research, the CLSP Center at JHU, and Oxford University. My research is funded by the National Science Foundation, including a CAREER award, NASA, and awards from Climate Change AI, Facebook, NVIDIA, Dolby, and Adobe. My research focuses on high-level visual recognition algorithms. I am also interested in AI applications for science, particularly in ecology and remote sensing. For an overview of my research, take a look at my recent publications, CV, and research statement (visualized as a word cloud). I am also on Google Scholar. A better computer science department rankings for PhD students: http://csrankings.org. News 11/25 We organized NECV at UMass Amherst this year. 9/25 Upcoming talks at Yale, CV4E Workshop at ICCV, and University of Virginia. 9/25 Two papers accepted at NeurIPS'25. Congrats Aaron and Max! 9/25 Promoted to a Full Professor. Thank you everyone for the support! 9/25 Received new NSF grants (1, 2, 3) to improve AI for scientific use. 6/25 Three papers accepted to ICCV'25. Congrats Oindrila, Rangel and Justin! 5/25 Co-organizing FGVC'12 and CV4Science workshops @ CVPR'25. 5/25 Upcoming papers at ICML'25 on species range estimation, JSTARS on water masking, RSEC on right-whale mophometrics. 5/25 I am an Area Chair for NeurIPS'25. 2/25 Teaching Intro to Computer Vision @ UMass. 9/24 Three papers accepted to NeurIPS'24. Congrats Max, Mustafa and Yuefeng! 9/24 Gave a talk at Cornell University. 9/24 I am an Area Chair for CVPR'25 and ICCV'25. 9/24 Invited speaker at the Climate Change AI workshop @ NYC. 9/24 Teaching Neural Networks @ UMass with Chuang Gan this Fall. 8/24 One paper accepted to ECCV'24 on population size estimation using Re-ID systems. Congrats Gustavo! 6/24 Co-organizing FGVC11 and CV4Science workshops at CVPR'24. 6/24 Upcoming papers at ApJ and Remote Sensing in Ecology and Conservation. Congrats Gustavo, Zezhou! 6/24 I am an Area Chair for ECCV'24 and NeurIPS'24. 5/24 Congrats Rangel and Oindrila for successfully passing the PhD portfolio with distinction! 3/24 Best paper award at AAAI 2024 (AI for Social Impact Track) for DisCount. 3/24 Two papers accepted at CVPR'24. Congrats Rangel, Aaron, and Oindrila! 2/24 Attended the AI for Social Good Workshop at Dagstuhl. 2/24 Teaching Intro to Computer Vision @ UMass. Older news 12/23 Congratulations to Gustavo Perez for successfully defending his Ph.D.! Gustavo is off to a post-doc at UC Berkeley. 9/23 Our team will be at ICCV'23: + Zezhou will present the LU-NeRF at the main conference. + At the R6D workshop, Zezhou and Matheus will present accidental turntables. + Rangel and Aaron will present COSE, a explanability bechmark, and Oindrila will present PARTICLE, a self-supervised technique for fine-grained tasks, at the VIPriors workshop. + I am also an invited speaker at the VIPriors workshop. 9/23 Welcome Grant Van Horn and Chuang Gan as faculty at UMass, adding to our strengths in computer vision and machine learning! 9/23 Thank you NSF for a new grant on modeling and relating visual tasks. 9/23 Teaching Neural Networks @ UMass with Chuang Gan this Fall. 8/23 Invited speaker at the CV for Ecology Workshop at Caltech 8/23 New work on computer vision predicting adsorption in materials appears at Journal of Material Chemistry. The work was funded by CCAI. 8/23 Congrats Zezhou Cheng for succesfully defending his PhD! He is off to a post-doc at Caltech before starting as an Assistant Professor at UVA. 6/23 I am a Program Chair for WACV'24, and an Area Chair for CVPR'23 and ICCV'23. 6/23 Invited speaker at the Open World Recognition workshop at CVPR'23. 2/23 Co-organizing FGVC10 @ CVPR'23. Consider submitting your work here by March 20, 2023, participate in one of the many competitions, or simply attend the exciting talks. 2/23 Teaching Intro to Computer Vision @ UMass. 9/22 Our papers appeared at CVPR, ECCV, ICPR, ACMMM, IJCV, NeurIPS, Astrophysical Journal and Global Change Biology this year. 9/22 I am back from a sabbatical at the University of Amsterdam and will be teaching Computer Vision @ UMass. 9/22 NASA grant on mapping rivers from satellite imagery. 5/22 Congrats Gopal Sharma for succesfully defending his PhD! Gopal was co-advised by Evangelos Kalogerakis and is off to a post-doc at University of British Columbia. 5/22 Climate Change AI grant for material design with Prof. Peng Bai. 5/22 Guest lecture at the CV summer school at Amsterdam. 3/22 I will be an Area Chair for ECCV'22 and WACV'23. 3/22 Attended the AI for the Social Good Dagstuhl Seminar. 3/22 Recent papers @ CVPR22 and IJCV22. 3/22 Co-organizing FGVC9 workshop @ CVPR22. Submit your ongoing work by 3/25 via CMT. 12/21 I was a program chair for ICVGIP'21. 11/21 Congrats Gustavo Perez for winning the CICS Outstanding Synthesis Award for the StarcNet project, and Jong-Chyi for winning the CICS Outstanding TA Award (Press). 10/21 Jong-Chyi will present a paper at BMVC 21. Zezhou and Matheus will present their papers at ICCV 21. 10/21 Recent talks at UVA, TU Delft, KU Leuven, CVIT Summer School, AIBee. 9/21 I'm on a sabbatical during AY 21-22 visiting the University of Amsterdam. 6/21 Zityan, Jong-Chyi, Zhaowei will present their papers at CVPR'21. Jong-Chyi organized the Semi-Supervised iNaturalist challenge @ FGVC8. Tech report and dataset released. 2/21 StarcNet appears at the Astrophysics journal. Congrats Gustavo and Matteo. 12/20 I'll serve as an Area Chair for CVPR 2021 and ICCV 2021. 9/20 Promoted to Associate Professor with Tenure! Many thanks to students, collaborators, mentors, colleagues, friends and family for their support along the way. 8/20 Teaching Computer Vision @ UMass 8/20 NSF grant awarded in collaboration with Colarado State and Univ. of Oklahoma on using CV and ML to study aerial insectivores. 7/20 Four papers accepted to ECCV 2020. PrGAN appears at IJCV. 7/20 Official code for Task2Vec available. 6/20 CVPR 2020 updates: + I gave a talk at the deep declarative networks workshop. + Chenyun and Matheus presented their papers at the main conference. + Matheus and Jong-Chyi presented their papers at the visual learning with limited labels workshop. + Jong-Chyi co-organized the semi-supervised challenge at the FGVC7 workshop. + Talks and competetion results from the FGVC7 workshop posted. 2/20 Organizing Fine-grained Visual Categorization (FGVC7) workshop at CVPR 2020. Call for papers posted. 12/19 How has nocturnal bird migration shifted in the last 20+ years? See our latest paper at Nature Climate Change. 12/19 Our bird roost detection project will appear at AAAI 2020. 12/19 Congrats to Zezhou and Matheus for winning the best poster and an honorable mention at the New England Computer Vision Workshop held at Brown University this year. 12/19 I will serve as an Area Chair for CVPR 2020 and ECCV 2020 10/19 At ICCV I'll be (1) giving invited talks at the Extreme Vision Modeling workshop, the Computer Vision for Wildlife Conservation workshop, and a tutorial on higher-order image representations; and (2) presenting two papers. 9/19 Teaching Computer Vision @ UMass 9/19 NSF grant awarded on 3D shape understanding with Rui Wang 8/19 Recent preprints and upcoming papers (see publications): + MistNet appears in Methods in Ecology and Evolution (press release) + Two papers to appear at ICCV 19 and one at 3DV 19 + Two papers to appear at CVPR 19 and one at AAAI 19, UBICOMP 19, KDD 19 + Journal accepted on IEEE Trans. on Info. Theory + ArXiv highlights: Task2Vec, PrGAN++ 2/19 Invited talk at ICERM @ Brown University. Talk slides. 1/19 Co-organizing FGVC6 workshop at CVPR 19. + Several competetions are live. Participate to win prizes! + Call for papers posted. 1/19 I'll serve as an area chair for CVPR 19 and on the SPC for IJCAI 19. 1/19 Teaching Intro to Computer Vision (370) @ UMass 10/18 NSF grant awarded for machine learning for Astronomy. 8/18 A recent talk at Caltech summarizing our work on 3D shape generation. 7/18 Two papers and a workshop paper accepted to ECCV 18. 6/18 SPLATNet won the best paper\thonorable mention at CVPR 18. Popular press: UMass, NVIDIA, Medium 6/18 NSF CAREER grant awarded. University press release. 5/18 Upcoming papers and workshops: + VisemeNet to appear @ SIGGRAPH 18 + Two papers: SPLATNet, CSGNet to appear @ CVPR 18 + Fine-Grained Visual Categorization (FGVC5) workshop @ CVPR 18 4/18 Invited talk at the annual data science resesarch symposium. 1/18 Teaching Intro to Computer Vision (370) @ UMass 12/17 I will serve as an area chair for CVPR 2018. 10/17 Invited talk at the Manifold Learning Workshop @ ICCV 17. 7/17 Dark ecology project funded by NSF. Link to the press release. 7/17 Upcoming papers and recent preprints: + 2 papers at 3DV, 3 papers at BMVC 17, 1 at ICCV 17 (see publications) + Bilinear CNNs PAMI preprint, arXiv v6, Jun 2017 + 3D Shape Segmentation with Projective Convolutional Networks, CVPR 17 (oral presentation) + 3D Shape Reconstruction from Sketches via Multi-view Convolutional Networks, arXiv, July 17 4/17 Department colloquium speaker at RIT and UoR. 9/16 Teaching Computer Vision @ UMass 6/16 Received NSF grant for language-based understanding of textures, and a gift from Facebook. Recent research highlights Active Measurement: Efficient Estimation at Scale, Hamilton et al., NeurIPS 2025 Generate, Transd",
  "content_length": 10784,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:10"
}