{
  "name": "Subhasish Mitra",
  "homepage": "https://web.stanford.edu/~subh",
  "status": "success",
  "content": "Subhasish Mitra's Profile | Stanford Profiles Subhasish Mitra William E. Ayer Professor of Electrical Engineering and Professor of Computer Science Web page: http://web.stanford.edu/people/subh Print Profile Email Profile View Stanford-only Profile Tab Menu Bio Publications Bio Subhasish Mitra holds the William E. Ayer Endowed Chair Professorship in the Departments of Electrical Engineering and Computer Science at Stanford University. He directs the Stanford Robust Systems Group, serves on the leadership team of the Microelectronics Commons AI Hardware Hub funded by the US CHIPS and Science Act, leads the Computation Focus Area of the Stanford SystemX Alliance, and is the Associate Chair (Faculty Affairs) of Computer Science. His research ranges across Robust Computing, NanoSystems, Electronic Design Automation (EDA), and Neurosciences. Results from his research group have influenced almost every contemporary electronic system and have inspired significant government and research initiatives in multiple countries. He has held several international academic appointments — the Carnot Chair of Excellence in NanoSystems at CEA-LETI in France, Invited Professor at EPFL in Switzerland, and Visiting Professor at the University of Tokyo in Japan. Prof. Mitra also has consulted for major technology companies including AMD (XIlinx), Cisco, Google, Intel, Merck (EMD Electronics), and Samsung.In the field of Robust Computing, he has created many key approaches for circuit failure prediction, CASP on-line diagnostics, QED system validation, soft error resilience, and X-Compact test compression. Their adoption by industry is growing rapidly, in markets ranging from cloud computing to automotive systems, under various names (Silicon Lifecycle Management, Predictive Health Monitoring, In-System Test Architecture, In-field Scan, In-fleet Scan). His X-Compact approach has proven essential to cost-effective manufacturing and high-quality testing of almost all 21st century systems. X-Compact and its derivatives enabled billions of dollars of cost savings across the industry. In the field of NanoSystems, with his students and collaborators, he demonstrated several firsts: the first NanoSystems hardware among all beyond-silicon nanotechnologies for energy-efficient computing (the carbon nanotube computer), the first 3D NanoSystem with computation immersed in data storage, the first published end-to-end computing systems using resistive memories (Resistive RAM-based non-volatile computing systems delivering 10-fold energy efficiency versus embedded flash), and the first monolithic 3D integration combining heterogeneous logic and memory technologies in silicon foundry. These received wide recognition: cover of NATURE, several Highlights to the US Congress, and highlight as \"important scientific breakthrough\" by news organizations worldwide. Prof. Mitra's honors include the Harry H. Goode Memorial Award (by IEEE Computer Society for outstanding contributions in the information processing field), Newton Technical Impact Award in EDA (test-of-time honor by ACM SIGDA and IEEE CEDA), the University Researcher Award (by Semiconductor Industry Association and Semiconductor Research Corporation to recognize lifetime research contributions), the EDAA Achievement Award (by European Design and Automation Association, for outstanding lifetime contributions to electronic design, automation and testing), the Intel Achievement Award (Intel’s highest honor), and the Distinguished Alumnus Award from the Indian Institute of Technology, Kharagpur. He and his students have published over 15 award-winning papers across 5 topic areas (technology, circuits, EDA, test, verification) at major venues including the Design Automation Conference, International Electron Devices Meeting, International Solid-State Circuits Conference, International Test Conference, Symposia on VLSI Technology/VLSI Circuits, and Formal Methods in Computer-Aided Design. Stanford undergraduates have honored him several times \"for being important to them.\" He is a Fellow of the Association for Computing Machinery (ACM) and the Institute of Electrical and Electronics Engineers (IEEE), and a Foreign Member of Academia Europaea. Academic Appointments Professor, Electrical Engineering Professor, Computer Science Member, Bio-X Member, Wu Tsai Human Performance Alliance Member, Wu Tsai Neurosciences Institute Administrative Appointments Associate Chair, Faculty Affairs, Department of Computer Science, Stanford University (2021 - Present) Honors & Awards Achievement Award, lifetime honor for outstanding contributions to design/design automation/testing, European Design and Automation Association (EDAA) (2025) Roger A. Haken Best Student Paper Award, IEEE International Electron Devices Meeting (with Stanford advisee) (2024) Top Picks in Hardware Security, IEEE (2024) Best Student Paper Award, Symposium on VLSI Technology (with Stanford advisees) (2023) Top Picks in Test and Reliability, IEEE (2023) William E. Ayer Endowed Chair Professorship, Stanford University (2023) Distinguished Alumnus Award, Indian Institute of Technology, Kharagpur (2022) Harry H. Goode Memorial Award, IEEE Computer Society (2022) Best Student Paper Award, Symposium on VLSI Circuits (with Stanford advisees) (2021) Foerign Member, Academia Europaea (2021) University Researcher Award for lifetime research contributions to the U.S. semiconductor industry, Jointly by Semiconductor Industry Association (SIA) and Semiconductor Research Corporation (SRC) (2021) Honorable Mention Paper, Formal Methods in Computer-Aided Design (2020) Humboldt Prize (Humboldt Research Award), Alexander von Humboldt Foundation, Germany (2019) Faculty Research Award, Google (2018) Ten Year Retrospective Most Influential Paper Award, IEEE International Conference on Computer-Aided Design (2018) Carnot Chair of Excellence in NanoSystems, CEA-LETI, Grenoble, France (2017-2020) Best of SELSE, IEEE International Conference on Dependable Systems and Networks (2016) Special recognition for carbon nanotube research, SEMI, the global microelectronics industry association (2016) Best Paper Award, IEEE International Test Conference (2015) Technical Excellence Award, Semiconductor Research Corporation (SRC) (2015) A. Richard Newton Technical Impact Award in Electronic Design Automation (test of time honor), ACM SIGDA & IEEE CEDA (2014) Fellow, Association for Computing Machinery (ACM) (2014) Fellow, Institute of Electrical and Electronics Engineers (IEEE) (2013) Jack Raper Award for Outstanding Technology Directions Paper, IEEE International Solid-State Circuits Conference (2013) Kavli Foundation Fellow, United States National Academy of Sciences (2013) World Economic Forum Young Scientist, World Economic Forum (2013) Chambers Faculty Scholar, Stanford School of Engineering (2011) Best Paper Award, IEEE VLSI Test Symposium (2010) Best Student Paper Award, IEEE International Test Conference (with Stanford advsees) (2010) Research Highlight, Communications of the ACM (2010) Honored by graduating seniors as a Stanford professor who had been important to them, Stanford University School of Engineering (2009-2021) Invited Participant, National Academy of Engineering, US Frontiers of Engineering Symposium (2009) Okawa Foundation Research Grant, Okawa Foundation for Information and Telecommunications, Japan (2009) Best Paper Award, ACM/IEEE Design Automation Conference (2008) Best Student Paper Award, Symposium on VLSI Technology (with Stanford advisees) (2008) Outstanding New Faculty Award, ACM SIGDA (2008) Presidential Early Career Award for Scientists and Engineers (PECASE), The White House, the United States government (2008) IBM Faculty Award, IBM (2006, 2007, 2008) Terman Fellow, Stanford University (2006) Best Paper Award, Intel Design and Test Technology Conference (2005) Divisional Recognition award (for Breakthrough Soft Error Protection Technology), Intel Corporation (2005) Donald O. Pederson Outstanding Paper Award, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (2005) Inaugural S. Seshu Scholar Lecturer, Coordinated Science Laboratory, University of Illinois at Urbana-Champaign (2005) Intel Achievement Award, Intel’s highest corporate honor, Intel Corporation (For the development and deployment of a breakthrough test compression technology) (2004) Divisional Recognition award, Intel Corporation (For Development and Proliferation of Industry Leading Response Compactor Design) (2002) Silver medal recipient for highest rank among all M. Tech students, Indian Institute of Technology, Kharagpur (1996) Cadence Fellowship, Indian Institute of Technology, Kharagpur (1994-1996) Gold medals for Rank 1 in engineering during all four years of undergraduate study, Jadavpur University, India (1994) Program Affiliations Stanford SystemX Alliance Contact Academic subh@stanford.edu University - Faculty Department: Electrical Engineering Position: Wiiliam E. Ayer Professor 353 Jane Stanford Way Gates 411 Stanford, California 94305 University - Faculty Department: Computer Science Position: William E. Ayer Professor 353 Jane Stanford Way Gates 411 Stanford, California 94305 Administrator Maria Hu Administrative Associate mariasal@stanford.edu (650) 723-1458 (office) Additional Info Mail Code: 9030 ORCID: https://orcid.org/0000-0002-5572-5194 Links https://rsg.stanford.edu/ All Publications CLEAR Cross-Layer Resilience: A Retrospective IEEE DESIGN & TEST Cheng, E., Cho, H., Mirkhani, S., Szafaryn, L., Abraham, J., Bose, P., Cher, C., Lilja, K., Skadron, K., Stan, M., Mitra, S. 2025; 42 (3): 74-85 View details for DOI 10.1109/MDAT.2024.3483028 View details for Web of Science ID 001471147300009 Monolithic 3-D Integration of Diverse Memories: Resistive Switching (RRAM) and Gain Cell (GC) Memory Integrated on Si CMOS IEEE TRANSACTIONS ON ELECTRON DEVICES Liu, S., Radway, R. M., Wang, X., Moro, F., Nodin, J., Jana, K., Yan, L., Du, S., Upton, L. R",
  "content_length": 145807,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:11"
}