{
  "name": "Subodh Vishnu Sharma",
  "homepage": "http://www.cse.iitd.ernet.in/~svs",
  "status": "success",
  "content": "Academic Search Subodh Sharma Associate Professor and Pankaj Gupta Chair Professor in Privacy and Decentralisation CSE@IIT Delhi Biography My research is primarily in the area of software engineering and formal methods. I am interested in ensuring the reliability of parallel software via static and dynamic program analyses, model checking, and PL solutions. I am also interested in employing HPC towards the creation of scalable verification technology. My recent research investigations have been in the area of systems security, data privacy, and Blockchain. Prior to joining the Department of Computer Science and Engineering at IIT Delhi, I worked as a post-doctoral researcher in the Systems Verification group at the University of Oxford. I am associated with the VerTeCS research group@IITD and also an associated faculty member in the School for Public Policy. Interests Formal Verification Program Analysis Systems Security, Data Privacy High Performance Computing Education PhD in Computer Science University of Utah News Our work on “Publicly auditable privacy-preserving electoral rolls” is accepted in IEEE Computer Security Foundations Symposium, 2024. Congratulations to Prashant; this work can have a significant impact on electronically-administered elections. Prashant’s work on “Traceable Mixnets” gets accepted in Privacy Enhancing Technologies Symposium, 2024. Dhriti’s work on analysing exception handing for Concurent libraries gets accepted in APSEC 2023. Our work on robustness analysis of Neural Nets is accepted in PRDC 2023. Congratualtions to Tooba, the lead author of this work. Our work on smart contract verification is accepted in 20th International Conference on Software Engineering and Formal Methods,SEFM 2022. Congratulations to Namrata (currently at Microsoft). Our work on exploiting symmetries to verify message passing programs has been accepted in 37th IEEE/ACM International Conference on Automated Software Engineering, ASE 2022. Congratulations to Rishabh Ranjan and Ishita Agrawal. Sanjana’s work on “Fence Synthesis for the C11 Memory Model” is accepted for publication in The 20th International Symposium on Automated Technology for Verification and Analysis (ATVA) 2022. Ridhi’s work on “BiRD: Race Detection in Software Binaries under Relaxed Memory Models” is accepted for publication in ACM Transactions on Software Engineering and Methodology (TOSEM). I am serving on the PC of SAT 2022, CAV 2022, HiPC(SRS)-2021, and EduHiPC-2021. Consider submitting Our sidenote on “Privacy Concerns with Aadhaar” appeared in the November'19 issue of Communications of the ACM. Note for prospective students (MS/PhD/Interns) I am looking for motivated students who are good in mathematics and programming and are interested in pursuing research (MSR/PhD) in the broad areas of verification, program synthesis, and security. If you are interested, drop me an email with your resume with the subject tag [ResearchApplicant]. Note that the admission in to the program will be through the regular admission process for MSR/PhD students (refer the cse@iitd admissions page for details). For internships, the expected time commitment from students is at least six months. Recent Publications Quickly discover relevant content by filtering publications. Dhriti Khanna, Rahul Purandare, Subodh Sharma (2021). Synthesizing Multi-threaded Tests from Sequential Traces to Detect Communication Deadlocks. In ICST 2021. Sanjiva Prasad, Y. Madhukar, Subodh Sharma (2020). Security Types for Synchronous Data Flow Systems.. Accepted in MEMOCODE 2020. Dhriti Khanna, Rahul Purandare, Subodh Sharma (2020). Verifying and Testing Concurrent Programs using Constraint Solver based Approaches. In ICSME 2020. PDF Cite Subhashis Banerjee, Subodh Sharma (2020). Privacy concerns with Aadhaar. In ACM CACM 2019. PDF Cite Dhriti Khanna, Subodh Sharma, Cesar Rodriguez, Rahul Purandare (2018). Dynamic Symbolic Verification of MPI Programs. In FM'18. PDF Cite See all publications Students Current Dhriti Khanna (Co-advised with Prof. Rahul Purandare) Y. Madhukar (Co-advised with Prof. Sanjiva Prasad) Divyanjali Pankaj Upadhyay (Co-advised with Prof. Guangdong Bai) Former Prashant Agrawal (Graduation Year: 2024) PhD Dissertation: Securing Democracies: Building Trust in Large Public Elections First employment: Max Plank Institute for Security and Privacy Sanjana Singh (Graduation year: 2023) PhD Dissertation: Program Analysis of Relaxed Memory Concurrency First employment: Intel Formal Verification Team, Bengaluru Ritesh Srivastava (Graduation year: 2024) MTech Thesis: Robustness Analysis of Neural Networks First Employment: Ministry of Electronics and Information Technology Tooba Khan (Graduation year: 2023) MTech Thesis: Automated Security Analysis of Machine Learning Systems First employment: PhD student in USC Deepak Kunwar (Graduation year: 2022) MTech Thesis: Automatic Verification of Sequential Consistent Memory Concurrency First employment: Microsoft Namrata Jain (Graduation year: 2021) MTech Thesis: Verification and Synthesis of Smart Contracts First employment: Microsoft Arpit Aggarwal MTech Thesis: Bounded Model Checking of Go Concurrency First employment: Oracle Deepanker Mishra MTech Thesis: Parameterized Verification of Message Passing Programs First employment: Nutanix Garvit Jain MTech Thesis: Parameterized Verification of Message Passing Programs Abhishek Khuntwal MTech Thesis: Efficient Parallelization of DPOR First employment: Nutanix Ronak Khandelwal MTech Thesis: Runtime Verification of C11 Concurrency First employment: Worldquant Guarav Gupta MTech Thesis: Accelarating SSL Computations Via GPUs First employment: Adobe Contact svs [@] cse.iitd.ac.in 419 Bharti Bldg. IIT Delhi, New Delhi, Hauz Khas 110016 Enter Bharti Building and take the stairs to Office 419 on Floor 3 DM Me Skype Me Cite × Copy Download",
  "content_length": 5877,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:15"
}