{
  "name": "Subodh Kumar 0001",
  "homepage": "http://www.cse.iitd.ac.in/~subodh",
  "status": "success",
  "content": "Subodh Kumar Subodh Kumar Office: II-A 429 (Bharti) Phone: +91 11 2659 6032, +91 11 2659 1291 Email: s u b o d h cse.iitd.ac.in Department of Computer Science and Engineering IIT Delhi Announcements: Interested in Hi-tech? We have open project positions for computer graphics programmers. If you are a software engineer with knowledge of OpenGL, Shaders, Cuda, and 3D game programming, and would like to advance your career by working in our high-tech medical simulation lab, please send an email. Education: BTech 1991 Computer Sc. & Engg., Indian Inst. of Technology Delhi, New Delhi PhD 1996 Computer Science, University of North Carolina, Chapel Hill My research interests include three dimensional interactive computer graphics. We try to produce realistic images of large geometric models. This includes developing representations for shape and appearance. Application areas we investigate encompass medical and scientific visualization, virtual worlds, tele-robotics and physical simulations. I also work on parallel algorithms and systems. In particular, we investigate paradigms that reduce parallel programming complexity by separating core logic from supporting infrastructure. Teaching: 2024-25 Sem II: COL380: Introduction to Parallel and Distributed Computing 2025-25 Sem I: COL730: Parallel Computation 2023-24 Sem I: JRL302: Introduction to Robotics Previous Semesters We cover a comprehensive curriculum in visual computing and parallel computing at IIT Delhi at both undergraduate and graduate levels. These courses include fundamentals of computer graphics and animation, geometric modeling, image processing, computer vision, distributed systems, concurrency, parallel programming, and current research topics in these areas. Current Research Projects: Interactive surface-detail rendering and virtual walkthrough Surgical simulation Medical visualization for diagnosis, planning and education Highly parallel simulation and rendering Robot tele-operation and human-robot interaction More projects are listed on the research page. (See the lab page for further information) Join Us: PhD/Postdoc (I am looking for people candidates interested in virtual environments for medical applications and for those interested in high performance computation.) Employment (I look for people with expertise in computer games, parallel programming, high performance computation, and HPC system management. For current projects, please see the top of the page.) ** Revised: 15 Apr 2023 by Subodh Kumar",
  "content_length": 2507,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:12"
}