{
  "name": "Subrota K. Mondal",
  "homepage": "https://fie.must.edu.mo/id-1444/person/view/id-441.html",
  "status": "success",
  "content": "創新工程學院 - 學院團隊 - 教研團隊 Subrota Kumar Mondal 副教授 所在部門： 計算機科學與工程學院 聯繫電話： 8897 3007 辦公室： A304a 電子信箱： skmondal@must.edu.mo Academic QualificationPh.D. in Computer Science and Engineering, Hong Kong University of Science and TechnologyB.Sc. in Computer Science and Engineering, Khulna University of Engineering and Technology Teaching AreaOperating Systems, Deep Learning, Software Engineering, Software Project Management Research AreaCloud/Serverless Computing, Deep Learning, NLP, Cybersecurity, Smart City Working ExperienceSep 2018 - Present, Assistant Professor, Macau University of Science and Technology, Macao, ChinaSep 2017 - Aug 2018, Postdoctoral Fellow, The Hong Kong Polytechnic University, Hong Kong, ChinaDec 2016 - Aug 2017, Software Developer, iSunCloud Limited, Hong Kong, ChinaSep 2015 - Nov 2016, Instructional Assistant, HKUST, Hong Kong, ChinaSep 2011 - Aug 2015, Research Assistant and Teaching Assistant, HKUST, Hong Kong, ChinaJun 2013 - Aug 2013, Summer Intern, Infosys Lab, IndiaApr 2009 - Aug 2011, Lecturer, Pabna University of Science and Technology (PUST), BangladeshJan 2008 - Mar 2009, Services Engineer, LM Ericsson Bangladesh Limited, Bangladesh Academic Publication (selected)[Articles Published in Journals]1.      Mondal, S. K., Pan, W., Dai, H. N., Chen, Y., & Wang, H. (2025). An Empirical Study of Container Escape: Penetration Test, Root Cause Analysis, Defense Mechanism, and Further Study. China Communications, 0-40. 2.      Ni, K., Mondal, S. K., Kabir, H. D., Tan, T., & Dai, H. N. (2024). Toward security quantification of serverless computing. Journal of Cloud Computing, 13(1), 140.3.      Kabir, H. D., Mondal, S. K., Alam, S. B., & Acharya, U. R. (2024). Transfer learning with spinally shared layers. Applied Soft Computing, 163, 111908.4.      Mondal, S. K., Zheng, Z., & Cheng, Y. (2024). On the Optimization of Kubernetes toward the Enhancement of Cloud Computing. Mathematics, 12(16), 2476.5.      Mondal, S. K., Wang, C., Chen, Y., Cheng, Y., Huang, Y., Dai, H. N., & Kabir, H. D. (2024). Enhancement of English-Bengali Machine Translation Leveraging Back-Translation. Applied Sciences, 14(15), 6848. 6.      Kabir, H. D., Mondal, S. K., Khanam, S., Khosravi, A., Rahman, S., Qazani, M. R. C., ... & Acharya, U. R. (2023). Uncertainty aware neural network from similarity and sensitivity. Applied Soft Computing, 149, 111027. 7.      Mondal, S. K., Zhang, H., Kabir, H. D., Ni, K., & Dai, H. N. (2023). Machine translation and its evaluation: a study. Artificial Intelligence Review, 56(9), 10137–10226. 8.      Song, Y., Wang, T., Cai, P., Mondal, S. K., & Sahoo, J. P. (2023). A comprehensive survey of few-shot learning: Evolution, applications, challenges, and opportunities. ACM Computing Surveys, 55(13s), 1-40.9.      Mondal, S. K., Wu, X., Kabir, H. M. D., Dai, H. N., Ni, K., Yuan, H., & Wang, T. (2023). Toward Optimal Load Prediction and Customizable Autoscaling Scheme for Kubernetes. Mathematics, 11(12), 2675. 10.  Kabir, H. D., Abdar, M., Khosravi, A., Nahavandi, D., Mondal, S. K., Khanam, S., ... & Suganthan, P. N. (2023). Synthetic Datasets for Numeric Uncertainty Quantification: Proposing Datasets for Future Researchers. IEEE Systems, Man, and Cybernetics Magazine, 9(2), 39-48. 11.  Mondal, S. K.; Tan, T.; Khanam, S.; Kumar, K.; Kabir, H.M.D.; Ni, K. Security Quantification of Container-Technology-Driven E-Government Systems. Electronics 2023, 12, 1238. 12.  Guan, M., Mondal, S. K., Dai, H. N., & Bao, H. (2023). Reinforcement learning-driven deep question generation with rich semantics. Information Processing & Management, 60(2), 103232.13.  Mondal, S. K., Pan, R., Kabir, H. M., Tian, T., & Dai, H. N. (2022). Kubernetes in IT administration and serverless computing: An empirical study and research challenges. The Journal of Supercomputing, 78(2), 2937-2987. 14.  Kabir, H.D., Khanam, S., Khozeimeh, F., Khosravi, A., Mondal, S. K., Nahavandi, S. & Acharya, U.R., 2022. Aleatory-aware deep uncertainty quantification for transfer learning. Computers in Biology and Medicine, p.105246.15.  Chen, Z., Wang, T., Cai, H., Mondal, S. K., & Sahoo, J. P. (2021). BLB-gcForest: A High-Performance Distributed Deep Forest with Adaptive sub-Forest Splitting, IEEE Transactions on Parallel & Distributed Systems, (01), 1-1, (2021).     16.  Zhang, Z., Dai, H. N., Zhou, J., Mondal, S. K., García, M. M., & Wang, H., Forecasting Cryptocurrency Price Using Convolutional Neural Networks with Weighted and Attentive Memory Channels, Expert Systems with Applications, 115378, 2021.17.  Kabir, H.D., Khosravi, A., Mondal, S. K., Rahman, M.M., Nahavandi, S. and Buyya, R., Uncertainty-aware Decisions in Cloud Computing: Foundations and Future Directions, ACM Computing Surveys (CSUR), 54(4), 1-30. 2021.18.  King-Hang Wang, Mondal, S. K., Ki Chan, and Xiaoheng Xie, A Review of Contemporary E-voting: Requirements, Technology, Systems and Usability, Data Science and Pattern Recognition, vol. 1(1), pp. 31-47, 2017.19.  Mondal, S. K.; Muppala, J. K.; Machida, F., Virtual Machine Replication on Achieving Energy-Efficiency in a Cloud, Electronics, 5(3), 37, 2016.20.  Mondal, S. K.; Xiaoyan Yin; Muppala, J.K.; Alonso Lopez, J.; Trivedi, K.S., Defects per Million Computation in Service-Oriented Environments, IEEE Transactions on Services Computing, vol.8, no.1, pp.32-46, Jan.-Feb. 2015.[Book Chapter]1.      Mondal, S. K.; Machida, F.; Muppala, J.K., Service Reliability Enhancement in Cloud by Checkpointing and Replication, In Principles of Performance and Reliability Modeling and Evaluation, pp.425-448. Springer International Publishing, 2016.[Articles in Conference Proceedings]1.      Li, H., & Mondal, S. K. (2024, September). Automation Framework Foundation for Continuous Integration with Docker. In Proceedings of the 2024 4th International Conference on Artificial Intelligence, Automation and Algorithms (pp. 70-75).2.      Mondal, S. K., Wu, X., & Pan, R. (2024, September). On Rapid Application Deployment with Kubernetes. In Proceedings of the 2024 4th International Conference on Artificial Intelligence, Automation and Algorithms (pp. 76-80).3.      Zhou, Y., & Mondal, S. K. (2024, September). On Optimization of Traffic Sign Recognition using Improved YOLOv5 Algorithm. In Proceedings of the 2024 4th International Conference on Artificial Intelligence, Automation and Algorithms (pp. 104-109).4.      Dai, F., & Mondal, S. K. (2024, July). Toward Automatic Number Plate Recognition: A Deep Learning Based Study for Macau. In 2024 IEEE International Conference on Software Services Engineering (SSE) (pp. 303-312). IEEE. 5.      Huang, Y., Mondal, S. K., Cheng, Y., & Wang, C. (2024, July). On Optimization of Traditional Chinese Character Recognition. In 2024 IEEE International Conference on Software Services Engineering (SSE) (pp. 293-302). IEEE.6.      He, J., Zhao, W., Li, Z., Huang, J., Li, P., Zhu, L., ... & Mondal, S. K. (2023, August). Reference-Based Line Drawing Colorization Through Diffusion Model. In Computer Graphics International Conference (pp. 362-372). Cham: Springer Nature Switzerland.7.      Mohanty, S., Dash, A., Mohapatra, S., Sahoo, A., & Mondal, S. K. (2023). Performance Enhancement of the Healthcare System Using Google Cloud Platform. In Advances in Distributed Computing and Machine Learning: Proceedings of ICADCML 2023 (pp. 175-186). Singapore: Springer Nature Singapore.8.      Khanam, S., Qazani, M. R. C., Mondal, S. K., Kabir, H. D., Sabyasachi, A. S., Asadi, H., ... & Nahavandi, S. (2022, October). CoV-TI-Net: transferred initialization with modified end layer for COVID-19 diagnosis. In 2022 IEEE International Conference on Systems, Man, and Cybernetics (SMC) (pp. 2237-2243). IEEE.9.      Mondal, S. K., Sahoo, JP., Wang J., Mondal, K., & Rahman, M. (2022, Jan), Fake News Detection exploiting TF-IDF Vectorization with Ensemble learning Models, In Advances in Distributed Computing and Machine Learning (pp. 261-270).  Springer, Singapore, 2022.10.  Kumar, K., Khanam, S., Bhuiyan, M. M. I., Qazani, M. R. C., Mondal, S. K., Asadi, H., ... & Nahavandi, S. (2021, December), SpinalXNet: Transfer Learning with Modified Fully Connected Layer for X-Ray Image Classification, In 2021 IEEE International Conference on Recent Advances in Systems Science and Engineering (RASSE) (pp. 1-7). IEEE, 2021.11.  Sabyasachi, A. S., Kabir, H. M. D., & Mondal, S. K., (2021, March). Dynamic Spot Pricing and Instance Acquisition in Public Clouds, In 2020 International Conference on High Performance Computing & Simulation (HPCS). IEEE, 2020.12.  Mondal, S. K., Pei, Y., Dai, H. N., Kabir, H M D., & Sahoo, J. P. (2020, Dec). Boosting UI Rendering in Android Applications, In 2020 IEEE International Conference on Software Quality, Reliability and Security (QRS)-Industry Track, IEEE, 2020.13.  Chang, N., Wang, L., Pei, Y., Mondal, S. K, & Li, X. (2018, July). Change-Based Test Script Maintenance for Android Apps, In 2018 IEEE International Conference on Software Quality, Reliability and Security (QRS) (pp. 215-225). IEEE.14.  Sabyasachi, A. S., Kabir, H. M. D., Abdelmoniem, A. M., & Mondal, S. K. (2017, September). A Resilient Auction Framework for Deadline-Aware Jobs in Cloud Spot Market, In Reliable Distributed Systems (SRDS), 2017 IEEE 36th Symposium on (pp. 247-249). IEEE.15.  Mondal, S. K., Sabyasachi, A. S., & Muppala, J. K. (2017, January). On Dependability, Cost and Security Trade-Off in Cloud Data Centers, In Dependable Computing (PRDC), 2017 IEEE 22nd Pacific Rim International Symposium on (pp. 11-19). IEEE, 2017   16.  Mondal, S. K.; Abadhan S. S.; Muppala J. K., On Boosting Cloud Service Dependability through Optimized Checkpointing, 2016 International Conference On Cloud Computing And Big Data (CloudCom-Asia)., The Hong Kong Polytechnic University, Hong Kong, 201617.  Mondal, S. K.; Muppala, J.K.; Trivedi, K.S., Defects Per Million (DPM): A user-oriented perspective of telecommunication systems, Globecom Workshops (GC Wkshps), 2014 , vol.,",
  "content_length": 11971,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:12"
}