{
  "name": "Suchi Saria",
  "homepage": "https://suchisaria.jhu.edu",
  "status": "success",
  "content": "Suchi Saria – Machine Learning, Computational Health Informatics Home Suchi Saria – Machine Learning, Computational Health Informatics Suchi Saria John C. Malone Associate Professor Johns Hopkins University Department of Computer Science Department of Applied Math & Statistics Department of Health Policy & Management Research Director, Malone Center for Engineering and Healthcare Contact: prefix@suffix where prefix=ssaria and suffix=cs.jhu.edu Twitter: Follow @suchisaria Other Affiliations: Mathematical Institute for Data Science (MINDS),Institute for Computational Medicine,Laboratory for Computational Sensing and Robotics, Armstrong Institute for Patient Safey and Quality,Center for Population Health Information Technology,and Center for Language and Speech Processing Formal Bio:See here Research Interests: At Hopkins, I direct the Machine Learning and Healthcare Lab at Johns Hopkins University. We are interested in enabling new classes of diagnostic and treatment planning tools for healthcare—tools that use artificial intelligence and statistical machine learning techniques to tease out subtle information from “messy” observational datasets, and provide reliable inferences for individualizing care decisions. My work spans the continuum from machine learning foundations and theory to demonstrating novel applications in the real-world to informing policy around safe ML adoption. Prior to joining Johns Hopkins, I did my PhD at Stanford with the brilliant Dr. Daphne Koller. I also spent a year at Harvard University collaborating with wonderful healthcare informatics researchers Dr. Ken Mandl and Dr. Zak Kohane as a NSF Computing Innovation Fellow. Prior to that, I did research with reinforcement learning pioneers Dr. Sridhar Madhavan and Dr. Andy Barto at UMass. While in the valley, I also spent time as an early employee at Aster Data Systems , a big data startup acquired by Teradata. At the end of 2018, we spun out Bayesian Health, a health AI startup focused on dramatically improving health outcomes and provider experience. I also sit on advisory boards of several organizations focused on innovative uses of AI or analytics to bring significant societal benefit (see LinkedIn for a partial list). Example press on our lab’s work: Recent: Press list 2018 and prior: NSF Science Nation, Baltimore Sun, IEEE Spectrum, Hopkins Magazine, Science, Hopkins Engineering Magazine, Healhcare IT News, Popular Science, NSF Bits and Bytes, Stanford Medicine, Pittsburgh Post-Gazette on the Frontiers meeting, Talking Machines podcast, Popular Science, and TEDxBoston. PhD applicants: If you’re interested in working with me, please apply to the Hopkins program and call me out as a potential advisor explaining why. I get a very high volume of emails from students so I cannot respond to each one individually. If you haven’t heard from me, please don’t assume it to mean lack of interest. Apply here. Postdoc applicants: Over the last 4 years, the lab has done very exciting work in ML/AI Safety. It has led to 15+ papers (at NeurIPS/ICML/AISTATS/Nature Medicine/NEJM) describing new methods for learning, evaluation, and real-world monitoring. Further, this work has been referenced by several regulatory bodies including the FDA in designing frameworks for AI-based medical devices. I’m accepting postdocs who are interested in advancing the theory, practice and policy around real-world monitoring. If you’re interested, please send me a note. Selected Honors, Awards and Notable Events (only lists awards prior to 2018): 2018 Honored to be named a Sloan Research Fellow. To read more about this highly competitive award, see here, here, and here. 2018 Selected as one of World Economic Forum’s Young Global Leader. To learn more about this recognition, see here. 2017 In National Science Foundation (NSF) Director Dr. France Cordova’s testimony to the Commerce, Justice and Science Appropriations Committee, our lab’s work was one of four pieces of research presented across all areas of NSF (two from CISE) on discussing the NSF budget. It’s a privilege be able to help make the case for increased funding for scientific innovation and research. 2017 Invited tutorial at Uncertainty in Artificial Intelligence (UAI) on machine learning and counterfactual reasoning for “Personalized” Decision-Making in Healthcare. More here. Slides. Video. 2017 Excited to speak on “Machines that Learn to Spot Diseases” at the National Academy of Engineering Frontier’s of Engineering Meeting. More here. 2017 Honored to be included in MIT Technology Review’s 35 Innovators Under 35 (TR35). More here. 2017 Excited to speak on Machine Learning and its Impact at the upcoming National Academy of Sciences Annual Meeting. More here. 2016 Invited Tutorial at NIPS on “ML Methods for Personalization with Application to Medicine.” More here. 2016 DARPA Young Faculty Award. More here and here. 2016 Excited to speak on AI and Healthcare at the White House Frontiers Meeting in the National Track. More here. 2016 Selected to Popular Science’s “Brilliant 10”. More here and here. 2016 Excited to speak at the CCC, AAAI and White House’s Office of Science and Technology Policy (OSTP) workshops on the Future of Artificial Intelligence. I gave a talk at the AI for Social Good meeting held in DC on making “meaningful use” of healthcare data using machine learning. More here. 2015 AI’s 10 to Watch. Selected by the IEEE Intelligent Systems once every two years to celebrate “young stars” in the field of artificial intelligence (AI). Selected for research on “Reasoning Engine for Individualizing Healthcare” here. 2016 IJCAI’s Early Career Spotlight. Invited by IJCAI to the “early career spotlight”. Here are the other spotlight presenters. 2015 Science Transtional Medicine Cover article for work on early detection of patients at high risk for septic shock using routinely collected EHR data. 2015 Discovery Award Our work received two (!) of the Hopkins Discovery awards, the first on a new computational framework for large-scale discovery of autoimmune regulators in rheumatic diseases and the second for translating our models for sepsis. These are highly competitive awards and ours were 2 of the 23 that were selected from a pool of 230 submissions. 2014 National Science Foundation Smart and Connected Health Research Grant award for developing computational models for prediction in complex, chronic conditions. More here. 2014 Google Research Award for developing machine learning tools for extracting information from electronic health records. More here. 2014 Annual Scientific Award given to the top submission by the Society of Critical Care for our work on early detection of sepsis (selected from 1000+ submissions). 2013 Betty and Gordon Moore Foundation Research award on building safer ICUs. More here. 2011 National Science Foundation Computing Innovation Fellowship; 17 awarded nationally. 2010 Science Transtional Medicine Cover article. More here and here. 2010 American Medical Informatics Association Best Paper Finalist for work on automated annotation of outcomes from electronic health record data. 2007 Uncertainty in Artificial Intelligence Best Student Paper for work on inference for continuous time discrete space models. 2004 Rambus Fellowship awarded for 3 years. 2002 Microsoft Full Scholarship. here. Selected Publications (partial list prior to 2019; full list in google scholar): ML=Machine Learning, HI=Health Informatics [ML] A. Subbaswamy, P. Schulam, S. Saria. Learning Predictive Models that Transport. Artificial Intelligence and Statistics (AISTATS), 2019. pdf. NEW [ML] P. Schulam, S. Saria. Auditing Pointwise Reliability Subsequent to Training. Artificial Intelligence and Statistics (AISTATS), 2019. pdf. NEW [ML] A. Subbaswamy, S. Saria. Counterfactual Normalization: Proactively Addressing Dataset Shift Using Causal Mechanisms. Uncertainty in Artificial Intelligence (UAI), 2018. pdf. NEW [ML] P. Schulam, S. Saria. Discretizing Logged Interaction Data Biases Learning for Decision-Making. arXiv preprint arXiv:1810.03025, 2018. pdf. NEW [ML] P. Schulam, S. Saria. Reliable Decision Support Using Counterfactual Models. Neural Information Processing Systems (NIPS), 2017. pdf. (Selected for an oral presentation) NEW Prior version: [ML] P. Schulam, S. Saria. Reliable What-If Reasoning with Counterfactual Gaussian Processes. Preprint. pdf. NEW [ML] H. Soleimani, J. Hensman, S. Saria. Scalable Joint Models for Reliable Uncertainty-Aware Event Prediction. Transactions of Pattern Analysis and Machine Intelligence (in press), 2017. pdfNEW [ML] H. Soleimani, A. Subbaswamy, S. Saria. Treatment-Response Models for Counterfactual Reasoning with Continuous-time, Continuous-valued Interventions. Uncertainty in Artificial Intelligence (UAI), 2017. pdfNEW [ML] Y. Xu, Y. Xu, S. Saria. A Bayesian Nonparametic Approach for Estimating Individualized Treatment-Response Curves. pdfNEW Related work: [ML] Y. Xu, Y. Xu, S. Saria. A Bayesian Nonparametric Approach for Estimating Individualized Treatment-Response Curves. Conference on Machine Learning and Health Care (MLHC), Aug. 2016. pdf [ML] Q. Liu, K. Henry, Y. Xu, S. Saria. Using Causal Inference to Estimate What-if Outcomes for Targeting Treatments. NIPS workshop on “What if” Reasoning, 2016. pdf. [ML] P. Schulam, S. Saria. Integrative Analysis Using Coupled Latent Variable Models for Individualizing Prognoses. Journal of Machine Learning Research 17 (234):1−35. pdfNEW [ML] D. Robinson*, S. Saria*. Trading-Off Cost of Deployment Versus Accuracy in Learning Predictive Models. International Joint Conference of Artificial Intelligence (IJCAI), 2016. pdf *equal contribution [ML] P. Schulam, S. Saria. A Framework for Individualizing Predictions of Disease Trajectories by Exploiting Multi-resolution Structure. Neural Information Processing Systems (NIPS), 2015. pdf [ML] K. Dyagilev, S. Saria. Learning (Predictive) Risk Scores in the Presence of Censoring due to Intervention",
  "content_length": 24607,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:15"
}