{
  "name": "Sudarshan Chawathe",
  "homepage": "https://umaine.edu/scis/faculty-and-staff/sudarshan-s-chawathe",
  "status": "success",
  "content": "School of Computing and Information Science - Maine College of Engineering and Computing - University of Maine Skip to main navigation Skip to site navigation Skip to content Apply to UMaine A-Z Calendar Give Map News Careers myUMaine School of Computing &Information Science Design, Develop, Code, Create, Implement, Manage, Innovate, Thrive Educating for The Future The future business and societal climates in Maine and the rest of the nation will be characterized by rapid technological change, intense global competition, faster product life cycles, more complex, networked, distributed and specialized markets, and both physical and societal disruption. In such environments the computing and information needs of organizations and individuals will be increasingly complex and rapidly changing. Individuals with computing and information systems expertise who can design, code, develop, and/or implement information systems, manage sophisticated information resources, work on interdisciplinary teams, and communicate effectively with product and service designers, business managers, engineers, creative artists, and other end-users will be and are in short supply. Explore many of the undergraduate and graduate degrees offered in the School of Computing and Information Science. Undergraduate Graduate Research Faculty & Staff Undergraduate Degree Programs: Computer Science Preparing you to excel in the rapidly evolving tech world. Our cutting-edge program blends rigorous academics with hands-on learning, empowering you to design systems, networks, and technologies that shape society. Graduates are highly sought after in Maine and beyond—because a UMaine degree means you’re ready to lead. Learn More New Media Preparing students to lead in the fast-evolving digital world, this program blends technology and creativity. Graduates gain skills in design, coding, and innovation while tackling real-world challenges. With a strong foundation in both tech and problem-solving, they are prepared to drive change and shape the future. Learn More Human Centered Technology Design Blending creativity, technology, and human insights to design innovative solutions for real-world problems. Students explore emerging technologies such as AI, AR, and VR while gaining hands-on experience in user-centered design, creating tech products that enhance user experiences and address societal needs. Learn More Computer Science and Business Computer Science and Business combines tech expertise with strategic thinking. Students develop skills in programming, data analysis, and software while mastering business concepts like marketing, finance, and management. Graduates excel in tech industries, entrepreneurship, and leadership, driving innovation and digital transformation. Learn More Incoming Student Information Computer recommendations Computer Science vs. Computing Fields: What’s the Difference? Incoming StudentsFAQ’s & Support Computing Community for Good (CCG) Scholars Program & Scholarship The Computing Community for Good (CCG) Scholars Program and Scholarship is an extraordinary opportunity for aspiring computer scientists looking to make a difference. This program provides a comprehensive support system, including financial aid, mentorship, and professional development. With the aim of building a diverse and inclusive community, we invite you to join us on this exciting journey towards a rewarding career in the ever-evolving world of computer science. Learn more Computing and design Living Learning Communities Living Learning Communities (LLCs) are specialized communities located in the residence halls based on enrollment in a specific college or academic program. The Computing and Design Living Learning community is available to first-year Computer Science, Human Centered Technology Design, and New Media students. Learn more READY TO JOIN US? APPLY TODAY! Current Student Resources The Boardman Learning Lab and Lounge is a supportive, flexible workspace for SCIS students. It’s staffed by senior undergraduates, graduate teaching assistants (TAs), and faculty, and equipped with desktop computers, articulating monitors, printers, and a poster plotter. Whether you’re working independently or collaborating with others, the space accommodates a range of needs—from introductory to advanced courses. Location: Boardman Hall, Room 138Managed by: Chris Dufour, Senior Lecturer in Computer ScienceContact: Christopher.Dufour@maine.edu 207.581.2951 Large Workspaces & MonitorsEach station includes articulating monitors for easy connection. Great for multitasking or detailed work. Poster PrintingComputer Science majors can request poster printing for research and class presentations. Contact Chris Dufour for approval and details. Connect with ClassmatesMeet students in your courses, form study groups, and build your academic support network right in the lab or nearby study lounge. In-Person SupportGet help from lab monitors and TAs—many of whom have taken the same courses and understand the material firsthand.If a scheduled helper is not present, email Christopher.Dufour@maine.edu. Office HoursTAs and Maine Learning Assistants (MLAs) from SCIS courses regularly hold office hours here—perfect for asking questions, getting unstuck, and debugging. Graduate Programs Computer Science Our graduate offerings in Computer Science include an MS program, providing advanced knowledge in software development, algorithms, and systems; a PhD program, focused on original research in computing and innovation; and an accelerated MS option, allowing students to complete both a bachelor’s and master’s degree in just five years. Learn More Cooperating MSIS and MBA Programs We offer cooperating graduate programs combining Information Systems and Business, including an MS in Information Systems (MSIS) with a Graduate Certificate in Business, a Master of Business Administration (MBA) with a Graduate Certificate in Information Systems, and dual MBA and MSIS degrees for integrated advanced study in both fields. Learn More Graduate Certificate Programs We offer graduate certificate programs in Computing for Educators, Digital Curation, Geographic Information Systems, Information Systems, and Data Science and Engineering to provide focused expertise and skills in these specialized areas. Learn More Information Systems We offer MS degrees in the following areas: Information Systems, which prepares students for careers in IT management, systems analysis, and business intelligence; an accelerated MS option in Information Systems, an accelerated program that allows students to earn both a bachelor’s and master’s degree in five years; and Data Science and Engineering, which provides advanced training in analytics, computing, and engineering for data-driven decision making. Learn More Spatial Computing Our graduate program includes MS degrees in Spatial Informatics, which focuses on the design and use of spatial technologies and information systems, and Spatial Information Science and Engineering, offering advanced study in spatial data, GIS, and computational modeling. Learn More Data Science and Engineering The private, public, and research sectors rely heavily on data science and engineering for analyzing and translating massive, complex, heterogeneous, and dynamic data into manageable forms, creating new information, and providing insights in order to better understand phenomena and guide decision-making. The advanced knowledge gained through graduate-level data science and engineering programs is needed across a wide range of commercial, non-profit, government, and academic settings. Learn More School of Computing & Information Science Research The School of Computing & Information Science conducts research at the intersection of technology, data, and human experience. Our work in human-centered computing explores human-computer interaction, immersive technologies, user experience, accessibility, and wearable computing. In data and intelligence, we focus on artificial intelligence, machine learning, data science, computer vision, and information systems. Our research in privacy, security, and systems addresses ethical computing, privacy, security, and the responsible development of technology. Additionally, we leverage AI and digital tools to enhance creativity, innovation, and community-driven solutions. Human-Centered Computing Human-Computer Interaction: Giudice, Ranasinghe, Nelson Augmented & Virtual Reality (AR/VR): Giudice, Ranasinghe User Experience (UX) & Interaction Design: Ranasinghe Ubiquitous & Wearable Computing: Giudice, Ranasinghe Accessibility & Inclusive Design: Giudice Artificial Intelligence & Data Science AI-based Spatial Knowledge Representation & Information Integration: Hahmann Geo-sensor Networks: Nittel Autonomous & Semi-structured Databases: Chawathe Explainable Machine Learning: Chen Data Visualization: Rheingans, Yoo Computer Vision: Yoo Ethics & Privacy Privacy Engineering: Ghanavati Computing Ethics: Woersdoerfer Creative Technologies & Digital Innovation Generative AI for Creative Work: Ippolito, Nelson, Schotter Digital Tools for Regenerative Communities: Blais, Nelson Our Faculty & Staff At SCIS, our faculty and staff is the heartbeat of our academic community. Dedicated, inspiring, and deeply knowledgeable, our professors go beyond the traditional classroom experience to foster real-world skills and a passion for learning. Whether mentoring, leading innovative research, or providing personalized support, our faculty members are committed to empowering students to achieve their highest potential Professor of Computer Science, Director School of Computing and Information ScienceAssociate Professor of New MediaSenior Lecturer of New MediaAssociate Professor of Computer ScienceAssociate Professor of Computer ScienceSenior Lecturer of Computer ScienceAdministrative Specialist, New Media – School of Computing & Information ScienceAssociate Professor of Computer Sc",
  "content_length": 12294,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:19"
}