{
  "name": "Sudarsun Kannan",
  "homepage": "https://www.cs.rutgers.edu/~sk2113",
  "status": "success",
  "content": "Rutgers Systems Research Lab Overview Group Updates Research Teaching Advisees Publications Service Patents Tools CV I am an Associate Professor @ Rutgers University's CS department. I also work on Operating Systems (OS) and their implications on Computer Architecture, Distributed Systems, and High-performance Computing systems. My group is currently building systems for efficiently managing memory and storage heterogeneity. Prospective Students: I will be hiring 1–2 Ph.D. students with strong interests in operating systems and computer architecture. The focus will be students wih OS kernel hacking expertise and low-level systems building. If interested, please email me your CV and, if available, links to open-source contributions or past system projects. Prior publications are not required. Group Updates 2025 - Our joint work with MSR on VM Allocation (Kamino), is accepted to OSDI '25! Congrats, David and the team! - PolyStore, Yujie's final thesis work, is accepted to FAST '25 and is also patented. Congrats Yujie! - Excited to receive the NSF CAREER Award! Thanks to NSF, students, mentors, and collaborators! - Invited to present our vision on Disruptive Memory Technologies at the Dagstuhl Seminar! 2024 - OmniCache accepted to FAST '24! Congrats to Jian and team! - Cross-layered I/O Prefetching accepted to ASPLOS '24! Congrats Shaleen, Jian, and team! - Jian’s paper on Context-aware Prefetching accepted to HotStorage '24. - Invited to serve on PC for SOSP '24, OSDI '25, HPCA '25. - Honored to co-organize SysDW @ SOSP '24 with Ramanathan Alagappan and Stephanie Wang. - Redesigning MicroDCs presented at ACM HotInfra '24! 2023 - Our paper TRIO receives Best Paper Award at SOSP '23! Congrats to Diyu and all authors! - Mosaic wins Distinguished Paper Award at ASPLOS '23. Congrats Krishnan, Jaehyun, and team! - TENET accepted to FAST '23. Congrats Madhav! - Received Samsung Research Award (2023). Thanks Samsung! - Honored to serve on program committees for FAST, ASPLOS, ATC. 2022 - FusionFS accepted to FAST '22 and open-sourced. Congrats Jian and Yujie! [Code] - Received Google Research Scholar Award (2022). Thanks Google! - HotStorage '22: I served as Program Co-Chair. - Received Samsung Research Collaboration Grant '22. 2021 and Earlier - pFSCK, a file system checker for faster storage, accepted to FAST '21. Congrats David! - CrossFS accepted to OSDI '20. Congrats Yujie! - Congrats Shaleen for MemSys paper on memory budgeting in HPC systems. - Delivered keynote at Heterogeneous Memory Workshop '21. - WiSER and TimeStone appeared at FAST '20 and ASPLOS '20. - Received NSF CNS Grant for work on virtual memory. - Multiple summer internships at NVIDIA, MSR, Samsung by group members. Recent Research Topics Direct-access and Smart Storage [FAST '18–'22, OSDI '20, SOSP '21] Memory Management and Heterogeneity [ISCA '17–ASPLOS '23] File System Correctness and Reliability [FAST '21] Data Durability and Transactions [ASPLOS '20–FAST '23] Geo-Distributed Heterogeneity [HotStorage '20] Selected Publications [Complete List] | [Google Scholar] 2025 Analyzing and Enhancing ArckFS: An Anecdotal Example of Benefits of Artifact Evaluation. Jonguk Jeon, Subeen Park, Sanidhya Kashyap, Sudarsun Kannan, Diyu Zhou, and Jeehoon Kang SOSP 2025 [Paper] [Slides] Kamino: Efficient VM Allocation at Scale with Latency-Driven Cache-Aware Scheduling David Domingo, Hugo Barbalho, Marco Molinaro, Kuan Liu, Abhisek Pan, David Dion, Thomas Moscibroda, Sudarsun Kannan, Ishai Menache USENIX OSDI 2025 [Paper] [Slides] Don't Melt Your Cache: Low-Associativity with Heat-Sink Michael A. Bender, Alex Conway, Daniel DeLayo, Martin Farach-Colton, Jaehyun Han, Linfeng He, Rob Johnson, Sudarsun Kannan, William Kuszmaul, Donald E. Porter, Evan West ACM SPAA 2025 [Distinguished Paper Award!] [Paper] PANGOLIN: a Comprehensive Testing Framework for Configuration-Rich Key-Value Stores. Shaohua Duan, Sudarsun Kannan, Andrea C Arpaci-Dusseau, Remzi H Arpaci-Dusseau SYSTOR 2025 [Paper] [Slides] Are Edge-Centric MicroDCs Ready for a Memory Mashup? Long Tran, River Bartz, Ram Durairajan, Ulrich Kremer, Sudarsun Kannan USENIX HotStorage 2025 [Paper] [Slides] Can a Client–Server Cache Tango Accelerate Disaggregated Storage? Linjie Ma, Jian Zhang, Marie Nguyen, Sudarsun Kannan USENIX HotStorage 2025 [Paper] [Slides] PolyStore: Exploiting Combined Capabilities of Heterogeneous Storage Yujie Ren, David Domingo, Jian Zhang, Paul John, Rekha Pitchumani, Sanidhya Kashyap, Sudarsun Kannan USENIX FAST 2025 [Paper] [Slides] [Code] 2024 Redesigning Edge-Centric Micro-Datacenters for Efficient Multitenancy Sudarsun Kannan, River Bartz, Ramakrishnan Durairajan, Uli Kremer ACM HotInfra 2024 (Poster) Context-aware Prefetching for Near-Storage Accelerators Jian Zhang, Marie Nguyen, Sanidhya Kashyap, Sudarsun Kannan USENIX HotStorage 2024 [Paper] [Slides] OmniCache: Collaborative Caching for Near-storage Accelerators Jian Zhang, Yujie Ren, Marie Nguyen, Changwoo Min, Sudarsun Kannan USENIX FAST 2024 [Paper] [Slides] [Video] [Code] CrossPrefetch: Accelerating I/O Prefetching for Modern Storage Shaleen Garg, Jian Zhang, Rekha Pitchumani, Manish Parashar, Bing Xie, Sudarsun Kannan ASPLOS 2024 2023 Enabling High-Performance and Secure Userspace NVM File Systems with the Trio Architecture Diyu Zhou, Vojtech Aschenbrenner, Tao Lyu, Jian Zhang, Sudarsun Kannan, Sanidhya Kashyap SOSP 2023 [Best Paper Award] Mosaic Pages: Big TLB Reach with Small Pages Krishnan Gosakan, Jaehyun Han, William Kuszmaul, Ibrahim Nael Mubarek, Nirjhar Mukherjee, Karthik Sriram, Guido Tagliavini, Evan West, Michael Bender, Abhishek Bhattacharjee, Alex Conway, Martin Farach-Colton, Jayneel Gandhi, Rob Johnson, Sudarsun Kannan, Donald Porter ASPLOS 2023 [Distinguished Paper Award] [Paper] [Code] TENET: Memory Safe and Fault-tolerant Persistent Transactional Memory R. Madhava Krishnan, Diyu Zhou, Wook-Hee Kim, Sudarsun Kannan, Sanidhya Kashyap, Changwoo Min USENIX FAST 2023 2022 FusionFS: Fusing I/O Operations in Firmware File Systems Jian Zhang*, Yujie Ren*, Sudarsun Kannan (* joint first authors) USENIX FAST 2022 [Paper] [Slides] [Code] 2021 Accelerating Filesystem Checking and Repair with pFSCK David Domingo, Sudarsun Kannan USENIX FAST 2021 [Paper] [Code] KLOCs: Kernel-Level Object Contexts for Heterogeneous Memory System Sudarsun Kannan, Yujie Ren, Abhishek Bhattacharjee ASPLOS 2021 2020 CrossFS: A Cross-layered Direct-Access File System Yujie Ren, Changwoo Min, Sudarsun Kannan USENIX OSDI 2020 [Paper] [Code] [Video] Read as Needed: Building WiSER, a Flash-Optimized Search Engine Jun He, Kan Wu, Sudarsun Kannan, Andrea Arpaci-Dusseau, Remzi H. Arpaci-Dusseau USENIX FAST 2020 [Paper] [Code] Durable Transactional Memory Can Scale with TimeStone R. Madhava Krishnan, Jaeho Kim, Ajit Mathew, Anthony Demeri, Xinwei Fu, Changwoo Min, Sudarsun Kannan ASPLOS 2020 Teaching CS 416 - Operating Systems Design: Spring 2019–2022 CS 519 - Operating Systems Theory: Fall 2018–2021 RISE Summer School Current Advisees PhD Students: David Domingo, Jian Zhang, Linfeng He, Haoyu Li, Devon Lewis, Long Tran, Minrui Tian, Linjie Ma, Abhilash Nambissan Undergraduates: Sumanta Das Alumni: Yujie Ren, Krishnan Gosakan, Shaleen Garg Conference and Journal Service Program Committees: SOSP '23–'24, ASPLOS '23–'24, FAST '23–'25, OSDI '24–'25 HotStorage '22 (Chair), USENIX ATC '20–'23, ISCA, ISPASS, IPDPS Patents Checkpoint Generation – US Patent No. 13/755,664 (2013) Active NVM Post Processing – US Patent No. 20,130,227,194 Multi-Tenant Cloud Applications – US Patent App. 2012/0047,239 Tools and Software AppBench Memory Throttler NVM Memory Manager Memory Latency Benchmark",
  "content_length": 7679,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:18"
}