{
  "name": "Sudeep Pasricha",
  "homepage": "https://www.engr.colostate.edu/~sudeep",
  "status": "success",
  "content": "Sudeep Pasricha – Aram and Helga Budak Endowed ECE Professor Skip to content Aram and Helga Budak Endowed ECE Professor (CV, Google Scholar) IEEE Fellow, AAIA Fellow, AIIA Fellow, ACM Distinguished Member ACM Distinguished Speaker, IEEE CEDA Distinguished Lecturer Director of Embedded, High Performance, and Intelligent Computing (EPIC) Lab Department of Electrical and Computer Engineering Departments of Computer Science, Systems Engineering (Joint appointments) Office: B119 Engineering        Email: sudeep@colostate.edu Phone: 970-491-0254                Fax: 970-491-2249 Office Address: 1373 Campus Delivery, Colorado State University Fort Collins, CO 80523-1373 Sudeep Pasricha is the Aram and Helga Budak Endowed Professor in the Department of Electrical and Computer Engineering, the Department of Computer Science, and the Department of Systems Engineering at Colorado State University. He is currently Director of the Embedded, High Performance, and Intelligent Computing (EPIC) Laboratory and the Chair of Computer Engineering. He is a former University Distinguished Monfort Professor and College of Engineering Rockwell-Anderson Endowed Professor. Short Bio: Prof. Pasricha received the B.E. degree in Electronics and Communication Engineering from Delhi Institute of Technology, India, in 2000, and his Ph.D. in Computer Science from the University of California, Irvine in 2008. He joined Colorado State University (CSU) in 2008. Prior to joining CSU, he spent several years working in STMicroelectronics and Conexant Inc. His research focuses on the design and application of innovative software algorithms (particularly AI and machine learning), hardware architectures, and hardware-software co-design techniques for energy-efficient, fault-tolerant, real-time, and secure computing. He has co-authored seven books, multiple patents, and published more than 350 research articles in peer-reviewed journals and conferences, workshops, and books. His research has been recognized with several awards, including the AFOSR Young Investigator Award, George T. Abell Outstanding Research Faculty Award, IEEE Computer Society TCVLSI Mid-Career Research Achievement Award, and the IEEE TCSC Award for Excellence for a Mid-Career researcher. He is a Fellow of the IEEE, Fellow of AAIA, Fellow of AIIA, Distinguished Member of the ACM, an IEEE CEDA Distinguished Lecturer, and an ACM Distinguished Speaker. Research Interests: Prof. Pasricha’s research efforts span multiple computing scales, from computing chips to embedded/IoT/cyber-physical systems and high performance datacenters. Specific search focus areas include: 1) electronic design automation (EDA) and architectures for AI/ML acceleration and emerging manycore computing (silicon photonic and advanced electronic network-on-chip design, memory architectures, resource management, 3D ICs); 2) energy-efficient, secure, fault-tolerant, and real-time embedded and IoT systems, (across the domains of automotive, medical, and mobile applications); and 3) AI/ML driven resource management for high performance computing (exascale datacenters and supercomputers). He has given multiple invited keynotes at IEEE and ACM conferences on a variety of research topics that span optical computing, AI accelerator design, machine learning for IoT applications, sustainable datacenters, robust chip-scale networks, and the future of computing. His research has been funded by various sponsors including NSF, SRC, AFOSR, DOE, ORNL, DoD, Fiat-Chrysler, HPE, and NASA. He has served as General Chair and Program Committee Chair for multiple IEEE and ACM conferences, and also served in the Editorial board of multiple IEEE and ACM journals. Some details of ongoing research projects on these themes can be found here. A brief 5 minute overview of the EPIC lab can be found here. Selected videos from various projects can be found here. Prof. Pasricha’s academic lineage can be found here. Awards: Prof. Pasricha has received 19 Best Paper Awards and Nominations at various IEEE and ACM conferences, including at DAC, ASPDAC, NOCS, GLSVLSI, IGSC, SLIP, AICCSA, and ISQED. Other notable awards include: 2025 CSU Board of Governors Excellence in Graduate Teaching Award, 2025 ECE Excellence in Teaching Award, 2024 IEEE CEDA Distinguished Lecturer, 2024 ECE Excellence in Teaching Award, 2022 ACM Distinguished Speaker, 2019 George T. Abell Outstanding Research Faculty Award, the 2016-2018 University Distinguished Monfort Professorship, 2016-2019 Walter Scott Jr. College of Engineering Rockwell-Anderson Professorship, 2018 IEEE-CS/TCVLSI mid-career research Achievement Award, the 2015 IEEE/TCSC Award for Excellence for a mid-career researcher, the 2014 George T. Abell Outstanding Mid-career Faculty Award, and the 2013 AFOSR Young Investigator Award. For professional service, he has received the 2019 ACM SIGDA Distinguished Service Award, the 2015 ACM SIGDA Service Award, and the 2012 ACM SIGDA Technical Leadership Award. Professional Service: Prof. Pasricha is currently a Senior Associate Editor for the ACM Journal of Emerging Technologies in Computing (JETC). He is in the Steering Committee of multiple conferences and journals, including IEEE Transactions on Sustainable Computing (TSUSC), IEEE/ACM Design Automation Conference (DAC), and IEEE/ACM Embedded Systems Week (ESWEEK). He is currently an Associate Editor for IEEE Transactions on Computers, IEEE Transactions on Sustainable Computing, ACM Transactions on Embedded Computing Systems (TECS), and IEEE Design & Test of Computers (D&T). He has served as Associate Editor for other journals in the past, including IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD) and IEEE Consumer Electronics (CM). He has served as the Vice Chair and Conference Chair of ACM SIGDA. He has also served as the General Chair and Technical Program Chair for various IEEE/ACM conferences, and been part of the Organizing Committee of several IEEE/ACM conferences such as DAC, ESWEEK, ICCAD, GLSVLSI, NOCS, RTCSA, ICESS, etc. He holds an affiliate faculty member position at the Center for Embedded and Cyber-Physical Systems at UC Irvine. Consulting: Prof. Pasricha has consulted with companies and venture capitalists and worked as an expert witness on topics related to electronic chip design (with a focus on accelerators/processors, memory, chip-scale networks, emerging technologies), AI and machine learning, and embedded and IoT systems. He has more than two decades of experience in industry and academia as a leading researcher in these areas, with hands-on skills that span software design, digital hardware design, and hardware/software system co-design. As an accomplished author (seven books and over 350 peer-reviewed published articles), he has written articles and reports that explain complex technology to non-engineers. He is an award winning teacher, with presentation skills that have been honed by more than 15 years of teaching computing courses on software and hardware design, and more than 20 years of presenting papers at conferences (including keynote speeches) and seminars to broad audiences. Note for Graduate Students:I have multiple PhD positions available in my lab. In particular, I am looking for students to work on projects related to deep machine learning for sustainable datacenters, silicon photonic accelerators, chip-scale network and memory architectures, mobile indoor navigation, automotive security and environment perception, and multicore security. See here for more details. Recent News (~past year): Nov 2025: Abhishek’s paper on AI-driven 3D fusion for automotive platforms accepted at IEEE/ACM DATE 2026 Nov 2025: Akhil’s paper on unified domain- and class-incremental machine learning accepted at IEEE/ACM DATE 2026 Nov 2025: Salma and Olu’s work on stochastic photonic transformer acceleration accepted at ECI Workshop 2026 Nov 2025: Salma and Bipin’s work on In-DRAM transformer acceleration accepted at ECI Workshop 2026 Nov 2025: I gave a plenary talk on ‘AI at the speed of light’ at the GDR I-GAIA event in Besancon, France Nov 2025: CSU Source article on how we are engineering a world of difference featuring an excerpt on my professorship Nov 2025: Habib and Tharini’s paper on in-Flash computing to be presented at IEEE ICCD 2025 Nov 2025: Tharini and Salma’s paper on sustainable GenAI acceleration with photonics to be presented at IEEE ICCD 2025 Oct 2025: I gave a plenary talk on ‘AI Impact on University Research and Education’ at the IEEE High Plains Engineering AI event Oct 2025: I participated in an open panel for the Fort Collins community on ‘AI Impacts on Sustainability’ Oct 2025: I gave a plenary talk on ‘AI for Computing and Computing for AI: A Symbiotic Journey’ at the CSU Ignites AI event Oct 2025: Anjali and Misha’s paper on NOR flash sanitization accepted at IEEE HOST 2026 Sep 2025: Danish’s paper on explainable AI for indoor localization wins the Best Paper Award at IEEE IPIN 2025 Sep 2025: Salma and Oluwaseun’s paper on in-DRAM LLM acceleration accepted in the ACM TECS journal Sep 2025: Survey paper on 3D NAND flash reliability, security, and sustainability accepted in IEEE Design&Test journal Aug 2025: Danish’s paper on explainable indoor localization nominated for Best Paper Award at IEEE IPIN 2025 Aug 2025: Congrats to Dr. Danish Gufran for successfully defending his PhD dissertation! Aug 2025: A recent CSU Source article on our new $1.8M Air Force project for IoT and AI-driven weather monitoring Aug 2025: Tharini and Salma’s paper on Generative AI acceleration with silicon photonics accepted at IEEE ICCD 2025 Aug 2025: Habib and Tharini’s paper on In-Flash processing accepted at IEEE ICCD 2025 Aug 2025: Danish’s paper on graph neural network based localization at IEEE/ACM CASES 2025 nominated for Best Paper Award Aug 2025: Akhirul’s paper on RL-based edge/cloud offloading accepted in IEEE TNSM journal Jul 2025: Danish’s paper on graph neural n",
  "content_length": 11946,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:18"
}