{
  "name": "Sudha Ram",
  "homepage": "https://mis.eller.arizona.edu/people/sudha-ram",
  "status": "success",
  "content": "Department of Management Information Systems | Eller College of Management Skip to main content Department of Management Information Systems Revolutionary is just the beginning. Consistently ranking among the top five in the nation, the Eller Department of Management Information Systems is leading its field—and revolutionizing every step of the way. Department Research Here, research goes beyond groundbreaking. Our world-renowned research brings MIS faculty and students together to change the world through labs and centers like the Center for the Management of Information, INSITE: Center for Business Intelligence and Analytics and the Artificial Intelligence Lab—the only lab of its kind in a business school in the U.S. Explore MIS Department Research Online MIS Graduate Certificates Get a valuable professional credential from our top-ranked program. Not only will the certificate build skills that directly apply to your line of work, but your resume will stand out among recruiters. Choose between Business Intelligence and Analytics or Enterprise Security, completing three courses in as little as five months, all online. Explore Online MIS Certificates Image In Eller, students gain more than technical and professional training for their chosen career, but also gain a strong sense of community and service through various clubs, honor societies and community outreach. Helping our students develop skills, insight and empathy so they can be great leaders and colleagues in whatever vocation or activity they choose to pursue is an important outcome for making meaningful change in the world.Joe Valacich, Eller Professor of Management Information Systems Academic Programs Undergraduate Programs The fourth industrial revolution is upon us, and it hinges on the intersection of business and technology. An MIS or operations management major from our top-ranked MIS program can land you a career with lasting impact. Explore MIS Undergraduate Programs » Master's Programs Solve the most pressing problems in business by serving as the expert who bridges the gap to IT. You’ll gain more than technical skills and hands-on experience with master’s programs in MIS (both on-ground and online), business analytics and cybersecurity (online). Explore MIS Master's Programs » Doctoral Program Rise to the top of your field in a pioneering department that brings in more research funding than any other MIS department in the world. Working alongside faculty mentors, you’ll develop critical skills and perform cutting-edge research at the forefront of MIS academics. Explore the MIS PhD » Invest in students. In academics. And in the future of IT. Image Through generous contributions from friends, alumni and industry partners who are committed to our success, the MIS Department remains one of the best in the nation. Your support maintains this momentum and amplifies our impact through entire industries and fields. Thanks to you, our faculty and students will continue to lead. Make A Gift Centers and Labs Artificial Intelligence Laboratory The only lab of its kind within a business school in the U.S., our AI Lab looks at problems differently to uncover revolutionary solutions and insights in everything from cybersecurity to health informatics to business intelligence. Artificial Intelligence Lab Center for the Management of Information By researching the art and science of collaboration, CMI is changing the way people work and communicate. As a global leader, it brings dynamic interdisciplinary teams together to solve problems that are equally essential and challenging. Center for the Management of Information INSITE: Center for Business Intelligence and Analytics Big data is more than a buzzword. It's a critical resource that differentiates leaders from followers. Learn how the center uses scaling techniques for data analysis from any source imaginable—then translates hard numbers into world-changing insights. INSITE: Center for Business Intelligence and Analytics Visit MIS Research Centers and Labs » Student Success Image News Profiles Alumni Arizona Online Alumni Feature: Angela Kirby '21 BSBA, '22 MIS Nov. 21, 2025 Read more Image News Profiles Students Eller MIS Student Receives McCord Scholarship Sept. 11, 2025 Read more Image News Profiles Alumni Dual MIS and Cybersecurity Degrees Help Alumna Break Barriers and Build a Career in National Security July 2, 2025 Read more News Image Sudha Ram Receives Extraordinary Faculty Award Monday Read more Image Arizona Online Alumni Feature: Angela Kirby '21 BSBA, '22 MIS Nov. 21, 2025 Read more Image Cybersecurity Isn’t Just for IT Professionals: Why Business Students Need to Care Nov. 5, 2025 Read more Events Dec 02 Eller MS in MIS Information Session 6:00 - 7:00pm View event Feb 13 Career Immersion Day 9:00 - 11:30am View event Contact Us520-621-2748 office520-626-7334 faxGeneral Inquiriescontactmis@eller.arizona.eduCorporate Inquirieswwienhoff@email.arizona.eduMcClelland Hall 430The University of ArizonaP.O. Box 210108Tucson, AZ 85721-0108Staff DirectoryFaculty Directory",
  "content_length": 5075,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:20"
}