{
  "name": "Sudipto Ghosh 0001",
  "homepage": "http://www.cs.colostate.edu/~ghosh",
  "status": "success",
  "content": "Homepage Navigation home| cs department| csu Main Home CV UPE Contact Research Projects FundingPublications Teaching Fall 2025 CS501: Introduction to CS Research Service Service Record Sudipto Ghosh Professor of Computer Science Affiliate appointment: Systems Engineering Computer Science Graduate Program Director Colorado State University Office: CSB 468 Phone: Phone: (970) 491-4608 Fax: (970) 491-2466 Email: sudipto.ghosh@colostate.edu Welcome! Dr. Sudipto Ghosh is a Professor of Computer Science at Colorado State University with an affiliate appointment in Systems Engineering. He is also the Graduate Program Director of the Computer Science Department. He received the Ph.D. degree in Computer Science from Purdue University in 2000. His research interests are in software engineering (design and testing) and computer science education. He is on the editorial boards of Software and Systems Modeling, Software Quality Journal, and Information and Software Technology. Previously he was on the editorial boards of the IEEE Transactions on Reliability and Journal of Software Testing and Reliability. He was a general co-chair of MODELS 2009 (Denver) and Modularity 2015 (Fort Collins). He was a program co-chair of ICST 2010 (Paris), DSA 2017 (Beijing), ISSRE 2018 (Memphis), ISEC 2024 (Bangalore), and QRS 2024 (Cambridge). He has served on program committees of multiple conferences. He is a member of the ACM and a Senior Member of the IEEE. Erdős number: 3 Editorial Boards Information and Software Technology Software Quality Journal Journal of Software and Systems Modeling Journal of Software Testing, Verification, and Reliability (past) IEEE Transactions on Reliability (past) Conference Organization Program co-chair: QRS 2024 Program co-chair: ISEC 2024 Program co-chair: ISSRE 2018 Program co-chair: DSA 2017 General co-chair: Modularity'15 Program co-chair: IWPD'14 General co-chair: MODELS 2009 Program co-chair:ICST 2010 Current Conferences ISSRE 2025 Program Board INCOSE TS 2025 ICECCS 2025 ICETC 2025 Mutation workshop at ICST 2025 Navigation home| cs department| csu © Copyright 2013, Sudipto Ghosh",
  "content_length": 2127,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:24"
}