{
  "name": "Sudip Misra",
  "homepage": "http://cse.iitkgp.ac.in/~smisra",
  "status": "success",
  "content": "Prof. Sudip Misra HOME AWARDS PUBLICATIONS PATENTS PROJECTS RESEARCH LABORATORY DEVELOPMENT DISTINGUISHED TALKS EDITORSHIP CONFERENCE CHAIRMANSHIP TEACHING Dr. Sudip MisraFACM, FIEEE, FAAIA FNASc (India), FNAE (India), FIET (UK), FBCS (UK), FIETE (India), FRSPH (UK), Humboldt Fellow (Germany)Professor Department of Computer Science and EngineeringIndian Institute of TechnologyKharagpur-721302West Bengal, IndiaTel : +91-3222-282338 Fax : +91-3222-255303Email Id: sudipm@iitkgp.ac.inOfficial Website: http://cse.iitkgp.ac.in/~smisra/SWAN Group: http://cse.iitkgp.ac.in/~smisra/swan/ News [August, 2024] Congratulations to Dr. Anudipa Mondal for defending her PhD Thesis ! [July, 2024] Congratulations to Anshita Gupta for being awarded the Chanakya Fellowship ! [December, 2023] Congratulations to Prof. Sudip Misra for being elected a Fellow of the West Bengal Academy of Science & Technology (WAST) ! [October, 2023] Congratulations to Prof. Sudip Misra for being awarded the ACM India Outstanding Contribution to Computing Education (OCCE) 2023 ! [September, 2023] Congratulations to Aishwariya Chakraborty for defending her PhD Thesis ! [August, 2023] Congratulations to Rituparna Saha for defending her PhD Thesis ! [January, 2023] Congratulations to Nidhi Pathak, Dr. Anandarup Mukherjee, and Prof. Sudip Misra for being awarded the IEEE ComSoc eHealth TC Best Conference Paper Award ! [May, 2022] Congratulations to Pallav Kumar Deb for defending his PhD Thesis ! [December, 2021] Happy to share that I have been awarded the Outstanding Volunteer Award by IEEE India Council ! [November, 2021] Happy to share that I have been elected a Fellow of the IEEE ! [October, 2021] Congratulations to Riya Tapwal for receiving the PMRF Fellowship 2021 ! [September, 2021] Congratulations to Aishwariya Chakraborty for receiving the Google PhD Fellowship 2021 (Systems and Networking) ! [July, 2021] Congratulations to Sumana Maiti for defending her PhD Thesis ! [April, 2021] Congratulations to Satendra Kumar for defending his PhD Thesis ! [April, 2021] Congratulations to Anandarup Mukherjee for defending his PhD Thesis ! [March, 2021] Congratulations to Abhishek Bera for defending his PhD Thesis ! [January, 2021] Congratulations to Ilora Maity for defending his PhD Thesis ! [December, 2020] Congratulations to Ayan Mondal for defending his PhD Thesis ! [December, 2020] Selected as Editor of IEEE Transactions on Sustainable Computing ! [November, 2020] Congratulations to Tamoghna Ojha for defending his PhD Thesis ! [November, 2020] Congratulations to Arijit Roy for defending his PhD Thesis ! [November, 2020] Congratulations to Chandana Roy for defending her PhD Thesis ! [September, 2020] Elected as Fellow of the India National Academy of Engineering (INAE), 2020 ! [January, 2020] Selected as Editor of IEEE Network ! Research Group  Research Areas  White Papers Short Term Course Short Term Course on Introduction to IoT with AI-ML and Cloud Computing New Short Term Course on Introduction to IoT with AI-ML and Cloud Computing Short Term Course on Hands-on Introduction to Internet of Things (IoT) With Generative AI and Cloud Computing Short Term Course on Hands-on Introduction to Internet of Things (IoT) with Machine Learning (ML) Short Term Course on Hands-on Introduction to Internet of Things (IoT) with Machine Learning (ML) Short Term Course on Introduction to Cloud Computing Short Term Course on 5G and Beyond in Smart Manufacturing Short Term Course on Hands-on Introduction to Internet of Things (IoT) with Machine Learning (ML) Service in the National / International Committees set up by the Government of India Coordinator, “Swayam Prabha, free DTH channel for education”, MHRD, Govt. of India. Chair, Working Group on “IoT Security Guidelines for e-Governance Applications”, Ministry of Electronics and Information Technology (MeitY), Government of India, (2021-Present). Member, Regional Advisory Group (RAG), “National Bank for Agriculture and Rural Development (NABARD)”, Government of India, 2019. Vacancies Project Positions: Interested candidate can send his/her CV to smisra.editor@gmail.com Internships: Bright students may contact with CV for possible internship positions. BIOGRAPHY: Sudip Misra is the INAE Chair Professor in the Department of Computer Science and Engineering at the Indian Institute of Technology Kharagpur. He received his Ph.D. degree in Computer Science from Carleton University, Ottawa, Canada. His current research interests include Wireless Sensor Networks and the Internet of Things. Professor Misra has published over 550 scholarly research papers and 12 books. He has won over a dozen research paper awards in different conferences and IEEE journals. Formerly, he was the INAE Abdul Kalam Technology Innovation National Fellow. He was awarded the IEEE ComSoc Asia Pacific Outstanding Young Researcher Award at IEEE GLOBECOM 2012, California, USA. He was also the recipient of several academic awards and fellowships such as the Faculty Excellence Award (IIT Kharagpur), Young Scientist Award (National Academy of Sciences, India), Young Systems Scientist Award (Systems Society of India), Young Engineers Award (Institution of Engineers, India), (Canadian) Governor General’s Academic Gold Medal at Carleton University, the University Outstanding Graduate Student Award at the Doctoral level at Carleton University, the National Academy of Sciences, India – Swarna Jayanti Puraskar (Golden Jubilee Award), Samsung Innovation Awards-2014 at IIT Kharagpur, IETE-Biman Behari Sen Memorial Award-2014, and the Careers360 Outstanding Faculty Award in Computer Science for the year 2018 from the Honourable Minister for Human Resource Development (MHRD) of India. Thrice consecutively, he was the recipient of the IEEE Systems Journal Best Paper Award in 2018, 2019, and 2020. He was awarded the Canadian Government’s prestigious NSERC Post Doctoral Fellowship and the Alexander von Humboldt Research Fellowship in Germany. His team received the GYTI Award 2018 in the hands of the President of India for socially relevant innovations. Dr. Misra has served as the Associate Editor of different journals such as the IEEE Transactions on Mobile Computing, IEEE Transactions on Vehicular Technology, IEEE Transactions on Sustainable Computing, IEEE Transactions on Network Science and Engineering, IEEE Transactions on Cognitive Communications and Networking, ACM Journal on Distributed Ledger Technologies, IEEE Network, and IEEE Systems Journal. He is a Fellow of the ACM, IEEE, National Academy of Sciences India (NASI), Indian National Academy of Engineering (INAE), the Institution of Engineering and Technology (IET), UK, British Computer Society (BCS), UK, Royal Society of Public Health (RSPH), UK, and the Institution of Electronics and Telecommunications Engineering (IETE), India. Professor Misra was the Distinguished Lecturer of the IEEE Communications Society. He has been serving on the Executive Committee of IEEE Kharagpur Section since 2008 in different capacities and was the Chair of the IEEE Kharagpur Section. He is also the Director and Co-Founder of the IoT startup, SensorDrops Networks Private Limited (http://www.sensordropsnetworks.com). SELECTED AWARDS/HONOURS RECEIVED : Awarded the ACM India Outstanding Contribution to Computing Education 2023. Awarded the Outstanding Volunteer Award by IEEE India Council, 2021. Elected a Fellow of IEEE, 2021. Named ACM Distinguished Member, 2020. Received the IEEE TCSC Award for Excellence in Scalable Computing (Mid-Career Researcher), 2020. Selected as IEEE ComSoc Distinguished Lecturer, 2020-2021. Elected as Fellow of the Indian National Academy of Engineering (INAE), 2020. Received the 2020 IEEE Systems Journal Best Paper Award for the paper entitled \"MEGAN: Multipurpose Energy-Efficient, Adaptable, and Low-Cost Wireless Sensor Node for the Internet of Things\". Received the 2020 IEEE Systems Journal Best Paper Award for the paper entitled \"RILoD: Reduction of Information Loss in a WSN System in the Presence of Dumb Nodes\". Elected as Fellow of the British Computer Society (BCS), UK, 2019. Recipient of the highly prestigious National Award, INAE-DST “Abdul Kalam Technology Innovation National Fellowship”, 2019, in recognition of his ‘outstanding translational research in Internet of Things and Wireless Sensor Networks as well as for his leadership role in the growth of the engineering profession in India’. Received the 2019 IEEE Systems Journal Best Paper Award for the paper entitled “Soft-WSN: Software-Defined WSN Management System for IoT Applications”. Elected as Fellow of the Royal Society of Public Health (RSPH), UK, 2018. Elected as Fellow of the Institution of Engineering and Technology (IET), UK, 2018. Elected as Fellow of the Institution of Electronics and Telecommunications Engineers (IETE), India, 2018. Received the 2018 IEEE Systems Journal Best Paper Award for our paper entitled \"Learning Automata-Based Fault-Tolerant System for Dynamic Autonomous Unmanned Vehicular Networks”. Received the Careers360 \"Outstanding Faculty Award\" in Computer Science for the year 2018 from the Honourable Minister for Human Resource Development, Mr. Prakash Javdekar, based on the h-index, citations, number of papers published during 2015-2017. The GYTI Award – 2018, which was received from the President of India for the socially relevant innovation \"Batteryless IoT Sensing Node\", was guided by him. It can be used by farmers for monitoring agricultural field parameters. Elected as “Fellow” of the National Academy of Sciences India (NASI), 2017. Received the “Faculty Excellence Award” of IIT Kharagpur at the Associate Professor level, 2017. Received the \"UGC-UKIERI Thematic Partnership Award\" awarded by UK-India Education and Research Initiative (UKIERI) for our project entitled \"SAFE: Secure and Usable IoT Ecosystem\", April 2017. Received the Distinguished Service Award in IEEE CITS 2016, July 6-8, Kunming, China Guided the pr",
  "content_length": 16283,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:25"
}