{
  "name": "Sudipan Saha",
  "homepage": "https://web.iitd.ac.in/~sahasudipan",
  "status": "success",
  "content": "Sudipan Saha Sudipan Saha Assistant Professor, IIT Delhi Office: Academic Complex East, 5th floor Email: sudipan.saha at scai.iitd.ac.in I am a faculty member in the Yardi School of Artificial Intelligence at IIT Delhi. Before this, I was a postdoc at the Technical University of Munich, Germany. I obtained my Ph.D. from University of Trento, Italy, where my advisors were Dr. Francesca Bovolo and Prof. Lorenzo Bruzzone. I am a researcher in Earth observation, computer vision, and climate AI. In more details, my research interests include multi-sensor learning and adaptation, multi-temporal image analysis, unsupervised representation learning, understanding of evolution of meteorological variables and land surface, and uncertainty quantification. Teaching Special Topics in Applications (AIL 861) : Semester II, 2022-23. Students' rating: 4.48/5 Mathematical foundations of MINDS (AIL 701) : Semester I, 2023-24. Students' rating: 2.5/5 Special Topics in Applications (AIL 861) : Semester II, 2023-24. Students' rating: 4.26/5 Mathematical foundations of MINDS (AIL 701) : Semester I, 2024-25. Students' rating: 4.17/5 Special Topics in Computer Vision (AIL 862) : Semester II, 2024-25. Students' rating: 4.17/5 Mathematical foundations of MINDS (AIL 7001) : Semester I, 2025-26. Publications Google Scholar See selected topic wise publication list here Indian Urban Maps portal: here Students at IIT Delhi PhD (Current): Ritik Kumar Das, Harsh Kumar (ScAI). Masters by Research (Current): Kanishk Awadhiya (ScAI, expected graduation: 2026). Masters (Current): Shubhojit Naskar, Shreyas Shimpi (ScAI, expected graduation: 2026). Masters by Research (Graduated): Tushar Verma, Naimish P. Machchar (ScAI, 2025 graduating batch). Masters (Graduated): Pulkit Singal (ScAI, 2024 graduating batch), Pratik Vora, Braj Raj Nagar, Sangam Kumar, Swaransh Patel (ScAI, 2024 graduating batch). Bachelors (Graduated): Bismandeep Singh (EE, 2024 graduating batch). You can expect a recommendation letter from me only if one of the following is satisfied You did a thesis with me and performed satisfactorily. You are a co-author in a paper with me and you contributed significantly to the paper. You spent 6+ months with me as a JRF or RA and performed satisfactorily. Currently looking for PhD students to work on topics in computer vision, Earth observation, and climate AI. Currently not looking for Short term internship students. Online internship students. Mini project students. On-going/recently concluded funded projects as PI SERB (GoI) funded project on urban mapping (ongoing). IIT Delhi MFIRP project with TU Delft on plastic hotspot detection (concluded). ITC Limited funded project on burned area mapping (concluded). Administrative roles at IIT Delhi Department MTech Coordinator, since 2024 July. Convenor of Department/School Research Committee, since 2025-2026 Academic Year. Member of Department/School Space Committee, since 2023 February. Member of Department/School Research Committee, since 2023-2024 Academic Year. Department Website & Social Media Coordinator, from 2023 April to 2025 July. Member of Admission Committee, 2024 Summer, 2024 Winter, and 2025 Summer. PGCIC Nominee, 2025 (played key role in designing revised MTech and MSR curriculum). Hostel Proctoring Team Member, 2023 Summer, 2024 Summer, and 2025 summer. Department representative for Open House held on November 2023. Department representative for Anveshan held on March 2025. As of December 2024, serving in Research Committee of 4 PhD students, one at ScAI, one at Department of Civil Engg., one at Transportation Research and Injury Prevention Centre, one at Center of Atmospheric Sciences. GATE/JAM institute representative: 2024,2025. Member of committee for ACM India Doctoral Dissertation Award Nomination: 2025. Editorial roles Associate Editor, IEEE JSTARS (since 2024). Topical Associate Editor, IEEE TGRS (since 2024). Before writing to me, consider the following Are you a student looking for an internship? I generally do not provide internship. You will most probably not receive a reply. Are you a faculty member looking to collaborate on a project on AI-based remote sensing? Sure, please write to me. Depending on the proposal, we may or may not collaborate. Are you a faculty member looking to collaborate on a project on computer vision (excluding video analysis)? Sure, please write to me. Depending on the proposal, we may or may not collaborate. Are you a faculty member looking to collaborate on a project on video analysis related topics? I generally do not work in this area. You are requested to search for alternate collaborator. Are you a faculty member looking to collaborate on a project on topics that are not covered above? I generally do not work in these areas. You are requested to search for alternate collaborator. Do you want to invite me to give an invited talk? Please write to me providing sufficient details and credentials and from an official email. Do you want to invite me to some government or private event or ceremony, just as a guest without a more specific role? I generally do not attend such events, please do not invite. Do you want to invite me to review papers for a conference? I regularly support IEEE TGRS, JSTARS, and GRSL by reviewing numerous papers each year. Additionally, I review for either CVPR or ECCV/ICCV annually, as well as for conferences where I am a submitting author. Please refrain from sending additional review requests unless you are seeking my involvement in a broader capacity.",
  "content_length": 5549,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:23"
}