{
  "name": "Sue B. Moon",
  "homepage": "http://an.kaist.ac.kr/~sbmoon",
  "status": "success",
  "content": "Sue Moon - ANLABSue Bok MoonProfessorCV | Blog | TwitterNoticeWe are recruiting researchers to work on networking systems for heterogeneous AI accelerators and social computing. Prospective undergrad/grad students and postdoc should contact me via email along with the CV and transcripts.이종 AI 반도체 지원을 위한 네트워킹 기술과 소셜 컴퓨팅에 관심있는 연구원 모집합니다. 학부 연구생, 석사, 박사, 석박 편입, 포닥 다 가능합니다. CV와 성적표 포함해서 이멜주세요.BiographySue Moon received her B.S. and M.S. from Seoul National University, Seoul, Korea, in 1988 and 1990, respectively, all in computer engineering. She received a Ph.D. degree in computer science from the University of Massachusetts at Amherst in 2000. From 1999 to 2003, she worked in the IPMON project at Sprint ATL in Burlingame, California. In August 2003, she joined KAIST and now teaches in Daejeon, South Korea.Her research interests are: networking systems and online social networks2023 Best Paper Award at ACM SIGCOMM APNet2022 ACM SIGCOMM Internet Measurement Conference Test of Time Award2022 Full Member at National Academy of Engineering in Korea2019 Presidential Commendation by the Ministry of Science and ICT (대통령 표창)2016 Ministry Commendation by the Ministry of Gender Equality and Family (제1회 미래 여성인재 양성 여성가족부 장관표창)2015 Best Student Paper Award at EuroSys (1st author Joongi Kim)2014 KAIST Award for Academic Excellence (학술상)2013 KAIST Award for International Service (국제협력상)2012 4th Knowledge Creation Award by the Ministry of Education, Science, and Technology (지식창조대상)2012 16th Young Engineer's Award by National Academy of Engineering of Korea (한국공학한림원 젊은 공학인상)2011 ~ 2014 KAIST Endowed Chair (KAIST 석좌교수)2010 Best Poster at ACM SIGCOMM Conference2010 KAIST Award for Technology Breakthrough Achievements (기술혁신 우수상)2009 Amore Pacific Award for Outstanding Women in the Sciences (아모레퍼시픽 여성과학자상)2007 Best Paper at ACM SIGCOMM Internet Measurement Conference2012.8. ~ 2013.1. Visitor at Microsoft Research Cambridge Systems and Networking Group2012.3 ~ Full Professor2008.3. Visitor at Telefonica Research Lab2007.9. ~ 2008.2. and 2008.4. ~ 2008.8. Visitor at SysNet Group, UCSD2006.9. ~ 2012.2. Associate Professor2003.8. ~ 2006.8. Assistant Professor at Div. of Computer Science, KAIST1999.10. ~ 2003.7. Principal MTS in the IP group at Sprint ATL, Burlingame, California1992.9. ~ 2000.2. Ph.D. from the Dept. of Computer Science at University of Massachusetts in Amherst1990.3. ~ 1991.12 Engineer at IMIGE Systems, Inc., Seoul, Korea1988.3. ~ 1990.2. MS same as BS1984.3. ~ 1988.2. BS from Dept. of Computer Engineering (now Dept. of CSE) at Seoul National University in Seoul, KoreaTeaching2023 Office Hours: On Demand by Email (off teaching throughout the academic year of 2023)Please check my calendar for my availability.[Fall 2022] Distributed Algorithms and Systmes (분산 알고리즘 및 시스템) (CS341)[Spring 2022] Introduction to Computer Networks (전산망개론) (CS341)[Fall 2021] Introduction to Computer Networks (전산망개론) (CS341)[Spring 2021] Introduction to Computer Networks (전산망개론) (CS341)Link to older courses.YouTube Videos, Interviews, Talks, and Tutorials“2022년 튜링상 수상자 Robert Metcalfe 업적 해설,” 제1회 카이스트, 서울대, 포항공대 공동 주최 ‘열린 튜링: 튜링상 업적 해설 강연’ 2023년“2022년, 2018년, 2012년 튜링상 수상자들 (R. Metcalfe, Y. Bengio, G. Hinton, Y. Lecun, L. Adleman, R. Rivest, A. Shamir) 업적 해설”“대한민국 여성1호 온라인강연,” 양성평등 및 여성사회참여확대 공모사업 지원 아.루다 사회적협동조합 2023년“대한민국 여성1호 온라인 강연회,” 유튜브 쇼츠“압축의 시간: 토큰에서 다양성의 시대로,” 카이스트 여성리더십 강좌 시리즈 2022년“매일 쓰는 인터넷, 어떻게 동작하나요?,” 2021 카오스 강연 “과학과 희열” 9강“Q&A 양자내성암호?,” 2021 카오스 강연 “과학의 희열” 석학 인터뷰“She Did It! 데이터센터에서의 초고성능 통신을 연구하는 네트워크 전문가,” WISET 한국여성과학기술인육성재단“She Did It! 인터뷰 발췌”“25년전의 나에게 (대학원 신입생이 꼭 알아야할 연구실 생활의 팁),” KAIST Grad Student Org Orientation, March 29th, 2015.“Why Korea Needs More Women in STEM,” International Women’s Day 2023 by UN Women Centre of Excellence for Gender Equality“A few tips I wish I had when I was an undergrad,” SNU CSE Seminar for Undergrads, October 23rd, 2014.My How-to series:How to be an effective editor for non-native speaker studentsHow to give a good talkHow to communicate with your advisor wellHow to have a successful internship영어 논문 작성법처음 논문쓰는 학생들을 위한 논문 작성법석사 논문 발표 준비하는 학생들을 위한 가이드Link to previous talksServicesKB Kookmin Bank Board of Directors (2022.3 ~ )KISTEP (Korea Institute of S&T Evaluation and Planning) Board of DirectorsMinistry of Science and ICT In-house Committee for Performance Review (과기정통부 제3기 자체평가위) (2022.9.~2024.8)Co-Chair of Leaders’ Forum at KOFWST (Korea Federationof Women’s Science and Technology Assocations) (2022.3.~2024.2)Vide President of WiTECK (Women in Science, Engineering and Technology in Korea)3rd Deliberative Council of Presidential Advisory Council on Science and Technology (2020.6.~2021.8)Director of KAIST Information Service for Knowledge and Culture (2019.3.~2021.8.)General Co-Chair with Rajesh Balan (SMU) and Animesh Mukhergh (IIT Kharagpur) for COMSNETS 2019Member of ACM Publications BoardGeneral Co-Chair with Taekyung “Ted” Kwon (SNU) for ACM SIGCOMM CoNEXT 2017KIISE Women's Committee Chair (2016.1. ~ 2017.12.)Head of Cyber Security Research Center (2015.3. ~ 2017.12)Head of Graduate School of Information Security (2014.7. ~ 2016.2.)IEEE Internet Award Chair (2013-2014)Vice Co-Chair with Sang-Goo Lee (SNU) and In-Soo Park (MOTIE/KATS) for WWW2014Steering Committee for BigData Innovators Gathering (BIG) 2014 co-located with WWW2014TPC Co-Chair wth Ricardo Baeza-Yates for WWW 2013Link to past professional servicesArticles in Korean [updates needed]문수복, 네트워크 분야에서의 TPC 활동 경험, 한국정보과학회 뉴스레터 제438호 2011년 9월 21일.곽해운, 이창현, 박호성, 문수복, 트위터는 소셜네트워크인가? 네트워크 구조와 정보 전파의 관점, 서울대학교 언론정보연구소 언론정보연구 48권 1호, 2011년 87~113.박호성, 곽해운, 차미영 문수복, 소셜 네트워크에서의 인플루엔셜 랭킹, 한국정보과학회 정보과학회지 2010년 3월호, 제28권 제3호.문수복, 미래 인터넷 서밋 참석 보고서, 한국정보과학회 정보과학회지 2010 년 1월호, 제28권 제1호.문수복, 장건, 미래 인터넷 관련 해외 학회 탐방기, Standards & Technology Review 2009년 제4호, 제37권 (통권75호), pp 52-59.김대영, 변성혁, 이순석, 신명기, 정일영, 문수복 (편집), 박성용 (편집), \" 네트워크 가상화에 대한 고찰\", 2008년 8월 미래 인터넷 (Future Internet Forum) 메일링 리스트 토론 내용 정리. * 정보과학회지 제 26권 제 10호 통권 제 233호 [PDF] (위의 내용을 좀더 정리)문수복, \" 인터넷의 미래와 진화방향\", KT 경영연구소 통신시장 2006년 Vol.2 (통권 제 63호), pp. 27-32.정진완, 문수복, 민상렬, 이재용, 최진영, “SCI: 과연 정보과학 분야에서도 유효한 연구업적 평가척도인가?”, 한국정보과학회지, 제22권 제8호 통권 제183호.ScheduleContactOffice AddressN1 (Kim Beang-Ho and Kim Sam-Youl IT Convergence Bldg) Room #608School of ComputingKAISTDaehakro 291, Yuseong-GuDaejeon 305-701, Republic of KoreaOffice Phone: +82-42-350-3548Office Fax: +82-42-350-3510 | +82-42-350-7748 (call before faxing)Email: sbmoon _at_ kaist dot ac dot kran.kaist.ac.krAdvanced Networking LaboratoryRoom #621 (Student Lab) / #608 (Prof. Office)IT Convergence Building (N1), KAISTDaehakro 291, Yuseong-gu, Daejeon34141, Republic of Korea(TEL) +82-42-350-7748",
  "content_length": 6700,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:26"
}