{
  "name": "Suely Oliveira",
  "homepage": "https://www.cs.uiowa.edu/~oliveira",
  "status": "success",
  "content": "Dr. Suely Oliveira, Professor Department of Computer Science, 14 MLH. The University of Iowa. Iowa City, IA 52242-1419, USA Email: suely-oliveira@uiowa.edu Office: 101 MLH Phone:  319-335-0731 Fax:      319-335-3624 RESEARCH: Machine Learning, Scientific Computing  and Parallel Algorithms. Professor Oliveira is a Full Professor in Computer Science at the University of Iowa, member of the Informatics and the Applied Mathematical and Computational Sciences programs. She was awarded her PhD at the University of Colorado, was previously an Assistant Professor at Texas A&M, has taught at and visited many Universities, including the Australian National University and University of São Paulo. Professor Oliveira's research is interdisciplinary, on the computational and theoretical aspects of algorithms in Scientific Computing and Machine Learning. She is particularly interested in genetics, biology, chemistry, and medicine applications. Projects have included clustering algorithms for protein-protein networks, neural networks for antibiotic resistance, and interpretable neural networks for test assessments. Professor Oliveira has  published two books (one with Cambridge University Press and one with World Scientific). More details below. RESEARCH: Publications Book: Building Proofs: A Practical Guide, World Scientific Book: Writing Scientific Software, Cambridge University Press Current and Past PhD Students Research Group: Optimization, Machine Learning and High Performance Computing TEACHING: Algorithms, Discrete Structures, Data Structures, Parallel Computing, Large Data Analysis. SOME RECENT COURSES: CS:2230 Computer Science II Data Structures: (Fall2022, Summer2022, Fall2021, Fall 2020, Spring 2020) CS:4740/MATH:4740/STAT:4740  Large Data Analysis  ( Spring 2019,  2018,  2017, 2016 ) CS:3330 Algorithms  ( Fall 2018 sec 1 & sec 2 ) CS:4700/MATH:4860 High Performance and Parallel Computing ( Fall 2017 ) CS:2210 Discrete Structures  ( Fall 2015 sec1 & sec 2) REU Computing for Health and Well-being (Summer 2021) Big Data Summer School (2015-2018) RECENT SUPPORT: Machine Learning in Quantum Information Science University of Iowa QSim initiative (internal grant) PIs: David Stewart, Denis Candido, and Suely Oliveira (2022) Machine Learning for Antibiotic Resistance Private Industry gift from JMI Laboratories, North Liberty PIs: Suely Oliveira and Cory Kromer-Edwards (2020-2021) Double strand break repair maelstrom: causes, mechanisms and genome destabilizing consequences R35 GM127006-01. NIGMS. Investigator/s Anna Malkova (Principal Investigator), Suely P Oliveira (Collaborator). (2018-2023) Large Data Analysis & Visualization at the University of Iowa NSF EXTREMS-QED DMS-1407216 PI: Suely Oliveira, co-PIs: Mary Kathryn Cowles, Isabel Darcy, Bruce Ayati, and David Stewart. (2014-2020) Developing efficient algorithms to process massive spatial data Private Industry grant from John Deere, Moline PIs: Suely Oliveira and Rahil Sharma (2015-2016) SOME RECENT TALKS: FSDM 2019 - October 19, 2019, Kitakyushu, Japan IJCNN 2019 - July 2019, Budapest, Hungary UIOWA 2018- October, 2019, Iowa City, IA SIAM 2018  - July 2018, Portland, Oregon MCA 2017 - July 2017, Montreal, Canada RECENT UIOWA ACTIVITIES: Informatics Program, Executive Committee (2022-present) Information Technology Advisory Charter Committee (2021-2024) Applied Mathematical and Computational Sciences Program Large Data Analysis Undergraduate Certificate Coordinator (2014-2019), Daily Iowan, Office of Research SOME RECENT OUTSIDE ACTIVITIES: TPC for the 11th Annual Computing and Communication Workshop and Conference, IEEE CCWC 2022,  Virtual, USA, January 2021 TPC for the International International Conference on Fuzzy Systems and Data Mining FSDM, October 2020, Xiamen, China TPC for the 20th IEE International Paralllel and Distributed Scientific and Engineering Computing (PDSEC19), jointly with 33rd IEEE International Parallel and Distributed Processing Symposium (IPDPS) May 2019, Rio de Janeiro, Brazil. TPC for the International International Conference on Fuzzy Systems and Data Mining FSDM, October 2019, Kitakyushu City, Japan TPC for the International Conference on Fuzzy Systems and Data Mining FSDM, November 2018, Bangkok, Thailand. Sci Advisory Board (2018-present) Big Data and Cognitive Computing Special Issue Guest Editor, 2018 Big Data and Cognitive Computing, Editor and Advisory Board",
  "content_length": 4419,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:30"
}