{
  "name": "Suguman Bansal",
  "homepage": "https://suguman.github.io",
  "status": "success",
  "content": "Suguman Bansal suguman@gatech.edu Home CV Publications [Scholar] [DBLP] BansalLab Service Contact Suguman Bansal I am an Assistant Professor in the School of Computer Science at Georgia Institute of Techology. Previously, I was an NSF/CRA Computing Innovation Postdoctoral Fellow at University of Pennsylvania, mentored by Rajeev Alur. I completed Ph.D at Rice University, advised by Moshe Y. Vardi. I lead the BansalLab at Georgia Tech. We are growing. Look here for open positions. I am broadly interested in Formal Methods and Logic, and their applications to Artificial Intelligence, Machine Learning, and Programming Languages. The long-term research goal is to build Trustworthy AI by simplifying the design-development-deployment pipeline of safe and reliable AI systems. My current research thrusts include: Formal Methods for Reinforcement Learning [ICML24, AAAI23Tutorial, SAS22Keynote, CAV22, NeurIPS21, Henzinger60] Reactive Synthesis from High-Level Specifications [FMCAD 2024, ATVA23 (Best Paper), CAV21, POPL20, AAAI20, CAV18a] Symbolic Quantitative Reasoning [IJCAI23, AAAI22, TACAS21, CAV19, CAV18b, FoSSaCS18] Recent and Upcoming Talks. Invited Speaker ActSynt@ECAI, October 2024 | Simons Institute, June 2024 | Invited Speaker FSTTCS 2024, December 2024 I am married to fellow computer science professor Kuldeep S. Meel. Teaching Courses CS 8803: Logic in Computer Science. Fall 2023, Georgia Tech CS 4510: Automata and Complexity. Spring 2024, Spring 2023, Georgia Tech Tutorials AAAI 2023: Specification-Guided Reinforcement Learning [Description] [Link] Selected Awards and Honors Best Paper Award at ATVA 2023 (Paper) Keynote Speaker at the 29th Static Analysis Symposium (SAS 2022) NSF/CRA Computing Innovation Fellow 2020 accompanied with a USD ~250K grant MIT EECS Rising Star (2021, 2018) Future Faculty Fellow 2019, Rice School of Engineering Among 10 Ph.D students worldwide invited to Microsoft Research Faculty Summit 2016 Gold Medal, ACM Student Research Competition at POPL 2016 Andrew Ladd Graduate Fellowship 2015 - 2016 News July 18, 2024Ramneet Singh successfully defended his Master's thesis on INTERLEAVE : An Empirically Faster Symbolic Algorithm for Maximal End Component Decomposition of MDPs. July 9, 2024Lisa2.0 improving the conversion of LTLf formulas to DFAs has been accepted to FMCAD 2024. This work was led by my undergraduate student Yash Kankariya. June 15-23 2024 We are hosting S Akshay from IIT Bombay this week. May 1, 2024New paper on theoretical guarantees on learning from reachability goals in RL has been accepted to ICML 2024. This is joint work with Jakub Svoboda and Krishnendu Chatterjee. Paper out soon! April 1-4, 2024 We are excited to host Jakub Svoboda from ISTA Austria this week. November 16, 2023Rice CS tells the story behind our ATVA 2023 Best Paper Award. Read the article here. October 28, 2023 Our ATVA 2023 paper has been awarded the Best Paper Award at ATVA 2023! June 24, 2023Our LTLf synthesis tool Lisa has secured third position in the LTLf track at SYNTCOMP 2023! Find the results here. Already looking forward to next year's competition. :) February 7, 2023Tutorial on Specification-Guided Reinforcement Learning accepted to AAAI 2023. All news…",
  "content_length": 3231,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:26"
}