{
  "name": "Suhang Wang",
  "homepage": "https://faculty.ist.psu.edu/szw494",
  "status": "success",
  "content": "﻿ Suhang Wang - Penn State University - PSU Suhang Wang Home Publications Students Projects Teaching CV Suhang Wang Associate Professor College of Information Sciences and Technology Penn State University Office: E387 Phone: (814)-865-2453 Email: szw494 at psu.edu Google scholar Multiple PhD student positions available I have several fully-funded Ph.D student positions in the area of data mining, machine learning and social media mining. Students with strong backgrounds in machine learning, data mining, mathematics, statistics and programming are encouraged to apply. If interested in the position, please send me a resume with your transcript. About me I am an Associate Professor with the College of Information Sciences and Technology at Penn State University - University Park. I obtained my Ph.D. in Computer Science from Arizona State University in July 2018. My advisor is Professor Huan Liu. I received my BS degree in ECE from Shanghai Jiao Tong University in 2012 and MS degree in EE:System from University of Michigan, Ann Arbor, in 2013. Research My research interests are machine learning, data mining and social media mining. News 11/2024: One paper accepted by KDD 2025 11/2024: Two papers accepted by COLING 2025 10/2024: One Paper accepted by WSDM 2025 8/2024: One paper accepted by TKDE 8/2024: One paper accepted by TKDD 7/2024: Two papers accepted by CIKM 2024 7/2024: One paper accepted by ECCV 2024 5/2024: Two papers accepted by KDD 2024 5/2024: One paper accepted by KDD ADS 2024 5/2024: One paper accepted by ACL Findings 2024 5/2024: Two papers accepted by ICML 2024 3/2024: Glad to be recognized as the 2024 AI 2000 Most Influential Scholar Honorable Mention in Data Mining 3/2024: One paper accepted by NAACL 2024 2/2024: One paper accepted by WWW 2024 Industry Track 2/2024: One paper accepted by WWW 2024 1/2024: One paper accepted by ICLR 2024 12/2023: One paper accepted by SDM 2024 12/2023: One paper accepted by AAAI 2024 10/2023: Two papers accepted by WSDM 2024 10/2023: One paper accepted by ICDE 2024",
  "content_length": 2046,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:29"
}