{
  "name": "Sujaya Maiyya",
  "homepage": "https://cs.uwaterloo.ca/~smaiyya",
  "status": "success",
  "content": "Sujaya Maiyya I am an assistant professor at Cheriton School of Computer Science at University of Waterloo. Prior to joining Waterloo, I did a short postdoc at Cornell University. I received my PhD from UC Santa Barbara where I was co-advised by Amr El Abbadi and Divy Agrawal. Research Interests: My research interests broadly lie in distributed systems & databases and data privacy & security. I, along with my wonderful students, design, prototype and evaluate protocols for managing large-scale data in a performance efficient and secure manner. Currently, my group is solving prolems across different aspects of oblivious databases such as tunable-privacy, scalability and fault tolerance, and support for relation queries. Please see more details in the Ongoing Research tab. New Area of Research: Recently, I have been working on building platfoms to execute genomics algorithms privately using trusted execution environments (TEEs)! If you are interested to work on TEEs or in transforming insecure genomics algorithms to secure ones, please reach out to me! Prospective Students: I am looking for highly-motivated PhD students and Postdoctoral Researchers. If you are interested in working with me on systems research, please send me an email and for grad applicants, mention my name as a potential advisor in your application. Recent News July 2025 : Our paper, OasisDB, that proposes an oblivious and scalable framework to support relational data and queries was accepted at VLDB 2025! May 2025 : Our paper, Treebeard, that develops scalable and fault tolerant ORAM system was accepted at USENIX Security 2025! May 2025 : Our vision paper on building oblivious graph database system was accepted at GRADES-NDA workshop at SIGMOD 2025! December 2024: Thank you CFI and ORF for awarding our infrastructure grant proposal! News article December 2024: I co-organized Ontario Database Day OnDBD-2024! Thanks to all participants for making the event a huge success! November 2024: Was invited to speak at the CS-CAN DSDS workshop! October 2024: Thank you NCC for awarding two research proposals - one on securely managing outsourced data and one on genomic data privacy! News article April 2024 : Our paper, ORTOA, that develops a mechanism to hide the type of operation was accepted and presented at EDBT 2024! Education PhD in Computer Science University of California, Santa Barbara (Jan 2018 - June 2022) MSc in Computer Science University of California, Santa Barbara (Sept 2016 - Dec 2017) BE in Information Science PESIT, Bangalore (Aug 2010 - May 2014) Awards CFI/ORF Infrastructure Grant 2024-2029. NCC Research and Development Awards 2024-2028. NSERC Discovery Grant 2023-2027. MIT EECS Rising Stars 2021. IBM PhD Fellowship 2020 award. Google PhD Fellowship 2020 award (declined). Outstanding Graduate Student 2018-19 award in the CS department at UCSB. Elected Graduate Student Representative for 3 consecutive years at UCSB. SAP Labs Scholarship (4 times) for securing the highest CGPA in the department at PESIT. Publications Haseeb Ahmed, Nachiket Rao, Ablekarim Kati, Florian Kerschbaum Sujaya Maiyya \"OasisDB: An Oblivious and Scalable System for Relational Data\" VLDB 2025 Amin Setayesh, Cheran Mahalingam, Emily Chen, Sujaya Maiyya \"Treebeard: A Scalable and Fault Tolerant ORAM Datastore\" USENIX Security 2025 Bishwajit Bhattacharjee, Nafis Ahmed, Renee Miller, Sujaya Maiyya \"Towards oblivious graph database\" GRADES-NDA workshop SIGMOD 2025 Sujaya Maiyya, Sharath Vemula, Divyakant Agrawal, Amr El Abbadi, Florian Kerschbaum \"Waffle: An Online Oblivious Datastore for Protecting Data Access Patterns\" SIGMOD 2024 [pdf] Sujaya Maiyya, Yuval Steinhart, Adrian Davila, Jason Du, Prabhanjan Ananth, Divyakant Agrawal, Amr El Abbadi \"ORTOA: A Family of One Round Trip Protocols For Operation-Type Obliviousness\" EDBT 2024 [pdf]. Mohammad Javad Amiri, Daniel Shu, Sujaya Maiyya, Divyakant Agrawal, Amr El Abbadi \". Ziziphus: Scalable Data Management Across Byzantine Edge Servers\" ICDE 2023 [pdf]. Sujaya Maiyya, Seif Ibrahim, Caitlin Scarberry, Divyakant Agrawal, Amr El Abbadi, Rachel Lin, Stefano Tessaro, Victor Zakhary \"QuORAM: A Quorum-based Replicated ORAM Datastore\" USENIX Security 2022 [pdf] [video]. Sujaya Maiyya, Ishtiyaque Ahmad, Divyakant Agrawal, Amr El Abbadi \"Samya: Geo-Distributed Data System for High Contention Data Aggregates\" ICDE 2021 [pdf][slides]. Fuheng Zhao, Sujaya Maiyya, Ryan Wiener, Divyakant Agrawal, Amr El Abbadi \"KLL±: Approximate Quantile Sketches over Dynamic Datasets\" VLDB 2021 [pdf]. Sujaya Maiyya, Danny HB Cho, Divyakant Agrawal, Amr El Abbadi \"Fides: Managing Data on Untrusted Infrastructure\" ICDCS 2020 [pdf]. Mohammad Javad Amiri, Sujaya Maiyya, Divyakant Agrawal, Amr El Abbadi \"SeeMoRe: A Fault-Tolerant Protocol for Hybrid Cloud Environments\" ICDE 2020 [pdf]. Sujaya Maiyya, Faisal Nawab, Divyakant Agrawal, Amr El Abbadi \"Unifying Consensus and Atomic Commitment for Effective Cloud Data Management\" VLDB 2019 [pdf][ppt]. Victor Zakhary, Mohammad Javad Amiri, Sujaya Maiyya, Divy Agrawal, Amr El Abbadi \"Towards Global Asset Management in Blockchain Systems\" BCDL co-located with VLDB 2019 (Demo) [pdf]. Sujaya Maiyya, Victor Zakhary, Mohammad Javad Amiri, Divy Agrawal, Amr El Abbadi \"Database and Distributed Computing Foundations of Blockchains\" SIGMOD 2019 (Tutorial) [pdf]. Sujaya Maiyya, Victor Zakhary, Divy Agrawal, Amr El Abbadi \"Database and Distributed Computing Fundamentals for Scalable, Fault-tolerant, and Consistent Maintenance of Blockchains\" VLDB 2018 (Tutorial) [pdf] [slides]. Vaibhav Arora, RKS Babu, Sujaya Maiyya, Divyakant Agrawal, Amr El Abbadi, Xun Xue, Yanan Zhi and Jianfeng Zhu \"Dynamic Timestamp Allocation for Reducing Transaction Aborts\" IEEE Cloud 2018 [pdf]. Ongoing Research Private Vector Database With the advent of large AI and language models, managing data in an embedding or a vectorized form is becoming increasingly common. Vector databases are customized DBMSs that effectively store and search embeddings. However, an embedding can reveal much about the underlying data, raising privacy concers. In this line of research, we are developing data systems that enable securely storing and searching on data embeddings. Oblivious Query Execution Hardware enclaves such as Intel SGX/TDX and AMD SEV enable applications outsource their data storage and processing needs to the cloud without compromising data confidentiality. However, side channel attacks on hardware enclaves effectively uncover the plaintext data process within the enclaves. We are building highly efficient and parallelizable primitives to process data securely in hardware enclaves without side channel leakages. Our primitives use vectorized query execution (this vectorization is different from representing data embeddings as a vector) and SIMD instructions to securely parallelize query execution. Building a scalable and fault-tolerant ORAM system Oblivious RAM or ORAM is a well known technique that preserves data access privacy by hiding access patterns. While there exists many variants of ORAM solutions, most are not scalable nor fault-tolerant - two vital features necessary for any practical data system. This project proposes the first scalable and fault-tolerant ORAM system that uses replication to tolerate bounded number of crash failures, while preserving privacy. Students Nafis Ahmed (MMath - thesis) 2024-2026 Bishwajit Bhattacharjee (MMath - thesis - co-supervision) 2024-2026 Amin Setayesh (MMath - thesis) 2023-2025 Haseeb Ahmed (MMath - thesis) 2023-2025 Joseph Boulis (MMath - thesis) 2023-2025 Undergraduate Students Ben Frey (URF) Nachiket Rao Malav Mehta Mikaela Tang Aaryan Shroff Cheran Mahalingam Adrian Davila Jason Du Srihari Vishnu Eddy Yang Joline Cheng Emily Chen Teaching CS848: Building private data systems - Fall 2025 CS348: Introduction to databases - Spring 2023, Spring 2024, Fall 2025 CS848: Privacy enhancing data systems - Winter 2024 Professional Service Chairs 2024: Ontario Database Day 2023: SoCC Publicity Chair Program Committee 2026: SIGMOD, EDBT, VLDB (rapid reviewer) 2025: VLDB, EDBT 2024: VLDB, ICDE Industry Track, CODS COMAD 2023: ICDE, SoCC, SIGMOD Demo Frequent reviewer: TKDE Jornal, DKE Journal, FGCS Journal",
  "content_length": 8257,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:29"
}