{
  "name": "Sujoy Sinha Roy",
  "homepage": "https://www.iaik.tugraz.at/person/sujoy-sinha-roy",
  "status": "success",
  "content": "Sujoy Sinha Roy – ISEC Sujoy Sinha Roy Assoc.Prof. PhD Secure Systems, Associate Professor Dr. Sujoy Sinha Roy is an Associate Professor at TU Graz, leading the CryptEng group which specializes in secure and efficient cryptographic algorithms on hardware and software platforms. Dr. Sinha Roy is known for his work in post-quantum cryptography (SABER KEM design, efficient software and hardware implementations, and side-channel security assessment) and Fully Homomorphic Encryption (FHE design, hardware acceleration, and application). Dr. Sinha Roy earned his PhD in 2017 from KU Leuven, receiving the IBM Innovation Award for his thesis. Before TU Graz, he was an assistant professor at the University of Birmingham. He obtained his habilitation in January 2024. Teaching Digital System Design Cryptography on Hardware Platforms Cryptography on Software Platforms Focus Area Post-quantum cryptography Privacy-preserving cryptographic techniques Cryptographic proofs Past PhD Students Andrea Basso (co-supervised, currently a postdoc at IBM Zurich) Past Postdocs Ahmet Can Mert (Founded company) Current PhD Researchers Aikata Anisha Mukherjee Maciej Czuprynko David Jacqemin Florian Hirner Florian Krieger Photo taken when we were trying to find a patent idea in Tesla's research lab. Achievements by CryptEng Students Aikata won the ÖAW Critical Infrastructure Award 2025 (Austrian Academy of Sciences) for PhD research in PQC and FHE. Florian Krieger received the Austrian \"Würdigungspreis\" (2024), a federal award recognizing top 55 graduates among 16,000+ across all Austrian universities. Aloha-HE named finalist in the Open Hardware Competition 2024. Florian Krieger received WKO Steiermark Research Grant for his master's thesis on client-side FHE. Aikata awarded 1st prize for Best Master's Thesis at TU Graz Forum Technology and Society 2022 for her work on efficient polynomial arithmetic for Saber and Dilithium. Reviewer in Conference PC Asiacrypt 2025, TCHES 2025, DATE 2025, IACR-CIC 2025, TCHES 2024, DAC 2024, DATE 2024, ICCD 2024, SAC 2024, CT-RSA 2024, ... Associate Editor Elsevier Journal of Information Security and Applications Publications in 2021-25 David Jacquemin, Anisha Mukherjee, Ahmet Can Mert, Sujoy Sinha Roy, \"Accelerating Isogeny Walks for VDF Evaluation\". IACR Communications in Cryptology 2025, volume 2. Aikata Aikata, Ahmet Can Mert, Sunmin Kwon, Maxim Deryabin, Sujoy Sinha Roy, \"REED: Chiplet-Based Accelerator for Fully Homomorphic Encryption\". IACR TCHES 2025. Florian Krieger, Florian Hirner, Sujoy Sinha Roy, \"Exploring Large Integer Multiplication for Cryptography Targeting In-Memory Computing\". DATE 2025. Aikata Aikata, Daniel Sanz Sobrino and Sujoy Sinha Roy, \"PASTA on Edge: Cryptoprocessor for Hybrid Homomorphic Encryption\". DATE 2025. Aikata Aikata, Sujoy Sinha Roy, \"Secure and Efficient Outsourced Matrix Multiplication with Homomorphic Encryption\". Indocrypt 2024. Florian Hirner, Michael Streibl, Florian Krieger, Ahmet Can Mert, Sujoy Sinha Roy, \"Whipping the MAYO Signature Scheme using Hardware Platforms\". Accepted in ACM CCS 2024. Florian Krieger, Florian Hirner, Ahmet Can Mert, Sujoy Sinha Roy, \"OpenNTT - An Automated Toolchain for Compiling High-Performance NTT Accelerators in FHE\". Invited Paper in ACM/IEEE ICCAD 2024. Andrey Kim, Ahmet Can Mert, Anisha Mukherjee, Aikata, Maxim Deryabin, Sunmin Kwon, HyungChul Kang, Sujoy Sinha Roy, \"Exploring the Advantages and Challenges of Fermat NTT in FHE Acceleration\". CRYPTO 2024. Samuel Pagliarini, Aikata Aikata, Malik Imran, and Sujoy Sinha Roy, “REPQC: Reverse Engineering and Backdooring Hardware Accelerators for Post-quantum Cryptography”. AsiaCCS 2024. Florian Hirner, Ahmet Can Mert and Sujoy Sinha Roy, \"PROTEUS: A Tool to generate pipelined Number Theoretic Transform Architectures for FHE and ZKP applications\". IEEE Transaction on VLSI 2024. Anisha Mukherjee, Aikata, Ahmet Can Mert, Yongwoo Lee, Sunmin Kwon, Maxim Deryabin, Sujoy Sinha Roy, \"ModHE: Modular Homomorphic Encryption Using Module Lattices: Potentials and Limitations\". TCHES 2024. Florian Krieger, Florian Hirner, Ahmet Can Mert, and Sujoy Sinha Roy, \"Aloha-HE: A Low-Area Hardware Accelerator for Client-Side Operations in Homomorphic Encryption\". DATE 2024. Malik Imran, Aikata Aikata, Sujoy Sinha Roy, Samuel Pagliarini: High-speed Design of Post Quantum Cryptography with Optimized Hashing and Multiplication. IEEE Transactions on Circuits and Systems II: Express Briefs ( Volume: 71, Issue: 2, February 2024). Aikata, Ahmet Can Mert, Sunmin Kwon, Maxim Deryabin, Sujoy Sinha Roy: REED: Chiplet-Based Scalable Hardware Accelerator for Fully Homomorphic Encryption. CoRR abs/2308.02885 (2023) David Jacquemin, Anisha Mukherjee, Sujoy Sinha Roy, Péter Kutas: Towards a constant-time implementation of isogeny-based signature, SQISign. IACR Cryptol. ePrint Arch. 2023: 807 (2023) Florian Hirner, Michael Streibl, Ahmet Can Mert, Sujoy Sinha Roy: A Hardware Implementation of MAYO Signature Scheme. IACR Cryptol. ePrint Arch. 2023: 1267 (2023) David Jacquemin, Anisha Mukherjee, Ahmet Can Mert, Sujoy Sinha Roy: Parallel Hardware for Isogeny-based VDF: Attacker's Perspective. IACR Cryptol. ePrint Arch. 2023: 1396 (2023) Aikata Aikata and Andrea Basso and Gaetan Cassiers and Ahmet Can Mert and Sujoy Sinha Roy: Kavach: Lightweight masking techniques for polynomial arithmetic in lattice-based cryptography. IACR Trans. Cryptogr. Hardw. Embed. Syst. 2023(3). Ahmet Can Mert and Aikata and Sunmin Kwon and Youngsam Shin and Donghoon Yoo and Yongwoo Lee and Sujoy Sinha Roy: Medha: Microcoded Hardware Accelerator for computing on Encrypted Data. IACR Trans. Cryptogr. Hardw. Embed. Syst. 2023(1). Aikata Aikata and Ahmet Can Mert and Malik Imran and Samuel Pagliarini and Sujoy Sinha Roy: KaLi: A Crystal for Post-Quantum Security Using Kyber and Dilithium. IEEE Transactions on Circuits and Systems 1 (2023). Aikata Aikata, Ahmet Can Mert, David Jacquemin, Amitabh Das, Donald Matthews, Santosh Ghosh, Sujoy Sinha Roy: A Unified Cryptoprocessor for Lattice-based Signature and Key-exchange. Accepted for publication in IEEE Transactions on Computers (2023). Malik Imran, Felipe Almeida, Andrea Basso, Sujoy Sinha Roy, Samuel Pagliarini: High-speed SABER Key Encapsulation Mechanism in 65nm CMOS. Journal of Cryptographic Engineering 2023. Sujoy Sinha Roy and Utsav Banerjee: Preventing a Crypto-Apocalypse -- From Mathematics to Circuits for Post-Quantum Cryptography. IEEE Solid-State Circuits Magazine ( Volume: 15, Issue: 1, winter 2023) Prasanna Ravi, Shivam Bhasin, Anupam Chattopadhyay, Aikata, Sujoy Sinha Roy: Backdooring Post-Quantum Cryptography: Kleptographic Attacks on Lattice-based KEMs. IACR Cryptol. ePrint Arch. 2022: 1681 (2022). David Jacquemin and Ahmet Can Mert and Sujoy Sinha Roy: Exploring RNS for Isogeny-based Cryptography. IACR Cryptol. ePrint Arch. 2022: 1289 (2022) Jipeng Zhang and Junhao Huang and Zhe Liu and Sujoy Sinha Roy: Time-memory Trade-offs for Saber+ on Memory-constrained RISC-V. IEEE Transactions on Computers 2022. Prasanna Ravi, Martianus Frederic Ezerman, Shivam Bhasin, Anupam Chattopadhyay, Sujoy Sinha Roy: Will You Cross the Threshold for Me? Generic Side-Channel Assisted Chosen-Ciphertext Attacks on NTRU-based KEMs. IACR Trans. Cryptogr. Hardw. Embed. Syst. 2022(1): 722-761 (2022). Prasanna Ravi, Shivam Bhasin, Sujoy Sinha Roy, Anupam Chattopadhyay: On Exploiting Message Leakage in (few) NIST PQC Candidates for Practical Message Recovery and Key Recovery Attacks. IEEE Transactions on Information Forensics and Security 2021. Sujoy Sinha Roy, Ahmet Can Mert, Aikata, Sunmin Kwon, Youngsam Shin, Donghoon Yoo: Accelerator for Computing on Encrypted Data. IACR Cryptol. ePrint Arch. 2021: 1555 (2021) Zhuang Xu, Owen Pemberton, Sujoy Sinha Roy, David F. Oswald: Magnifying Side-Channel Leakage of Lattice-Based Cryptosystems with Chosen Ciphertexts: The Case Study of Kyber. IEEE Transactions on Computers 2021. Malik Imran, Felipe Almeida, Jaan Raik, Andrea Basso, Sujoy Sinha Roy, Samuel Pagliarini: Design Space Exploration of SABER in 65nm ASIC. ASHES@CCS 2021: 85-90 Andrea Basso, Sujoy Sinha Roy: Optimized Polynomial Multiplier Architectures for Post-Quantum KEM Saber. DAC 2021: 1285-1290 +43 316 873 - 5501 +43 (0)316 / 873 - 5520 sujoy.sinharoy@tugraz.at https://www.isec.tugraz.at IF02028 TUGRAZ online Publications Accelerating Hash-Based Polynomial Commitment Schemes with Linear Prover Time Hirner F., Krieger F., Piber C., Sinha Roy S.IACR Transactions on Cryptographic Hardware and Embedded Systems, Vol. 2025(4), 2025 Stealthy Hardware Trojan Attacks on MQ-Based Post-Quantum Digital Signatures Sinha Roy S., Aikata A., Mukherjee A.2025 A Flexible Hardware Design Tool for Fast Fourier and Number-Theoretic Transformation Architectures Krieger F., Hirner F., Mert A., Sinha Roy S.IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 2025 Simple Power Analysis Attack on SQIsign Mukherjee A., Czuprynko M., Jacquemin D., Kutas P., Sinha Roy S.Progress in Cryptology - AFRICACRYPT 2025 Correlation power analysis of LESS and CROSS Czuprynko M., Mukherjee A., Sinha Roy S.Progress in Cryptology - AFRICACRYPT 2025 More Publications Scroll to top Subscribe News & Events Email By continuing, you accept the privacy policy ×",
  "content_length": 9312,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:37"
}