{
  "name": "Sukhendu Das",
  "homepage": "http://www.cse.iitm.ac.in/~sdas",
  "status": "success",
  "content": "Prof. Sukhendu Das, Computer Science and Engineering, IIT Madras Sukhendu Das Name Sukhendu Das E-mail Designation Professor EPABX Office (91) - 44 - 2257 4367 Room SSB 302 EPABX Res. (91) - 44 - 2257 4367 Address C-09-02 13 Cross Road, IIT Madras, Chennai - 600036, India Interests Visual Perception, Computer Vision, Image Intelligence, Graphics and Visualization, Biometry, Computational Science and Engineering, Analog and Digital Systems, Soft Computing On going projects Past Projects IMPRINT (MHRD) DRDO (GOI): Scene Understanding for Identification of Covert Geo-location in a Scene, using a Hyper-Classifier based Visual Intelligent System 2017 - 2022. Cloudphysician Healthcare Private Limited, Bangalore; Technical Proposal for your Consultancy Services for Collaborative Research on Analyzing ventilator images to detect respiratory abnormalities; 2020-21. Nathan Research Systems Pvt Ltd, Chennai; Identification and Detection of spatial layouts of fixed set of fixtures in images; 2020-21. DRDO (GOI): Localization and Identification of Targets 2011 - 2014. DIT (GOI): Service Oriented Architecture and its implementation for the Linux Kernel, middleware (NRCFOSS Phase II); (Collaboration with DOS-LAB) 2009 - 2012. DRDO (GOI): Smart segmentation of objects in images 2009 - 2011. MIT (GOI): Research and development of multi-camera algorithms for security and surveillance (Collaboration with CV-LAB) 2008 - 2011. ICMR (INDO-GERMAN): Telemedicine station for Rural health monitoring and diagnosis for epidemic diseases (Collaboration with DOS-LAB) 2008 - 2010. ATB (GOI): Sizing of Sensors for Tracking Trainee Movements in Simulation Arena; 2008-09. DRDO (GOI): Combining Classifiers using Decision Fusion: An approach to Probabilistic Landform Segmentation; 2006-2009 DST(GOI): Integration Knowledge system on soil Nutrient management through Image Processing of Chromatograms (Collaboration withAIDB-LAB). 2005 - 2008. MIT(GOI) : Minimal Object Oriented Linux (Collaboration with DOS-LAB). Jan 2005 - Dec 2007. DRDO (GOI): Recovery of 3D shapes based on multiview textures; 2006 - 2007. DRDO(GOI): Probabilistic Classification of Satellite Images to Obtain Landform Patterns. March 2005 - Dec. 2006. MHRD (GOI): Multi-modal biometrics based secured access system using face and fingerprint recognition; March 2004 - February 2006 DRDO(GOI): SAR image exploitation, Classification of Man-made and Natural regions, Automatic Target Detection ; July 2004 - Jan. 2006 Metricone Technologies, India: Algorithms for fingerprint identification, 2001 HCL Technologies, India: Traffic Signal Identification, 2000-2001. ISRO (GOI): Road detection from satellite images Courses Concepts in Statistical Learning Theory Optimization Methods for Computer Vision Applications Computer Vision Computer Graphics Modern Trends in Computer Graphics Introduction to Computer Science and Engineering Data Structures & Algorithms Advanced Programming Lab Advances in Visual Perception Switching Theory and Digital Design Digital Logic and Design Laboratory SOFT Computing Digital Video Processing Computer Organization Operating System Students SONAM GUPTA (Ph.D) RIYA VERMA (Ph.D) POOJA KUMARI (Ph.D) S MEENA PADNEKAR (Ph.D) SADBHAVANA BABAR (MS) ARTI KESHARI (MS) BINOY SHANKAR SAHA (MS) SHIVANGI SHREYA (MS) SAURABH KUMAR JAIN (MS) Research Activities Visualization and Perception Lab Publications Link to Publications Awards Link to Awards Students (Graduated) Graduated Students List Brief CV Click here to download Checklist For Tasks to be performed by a Classroom TA Checklist For Tasks to be performed by a Course TA This page is copyrighted to IIT Madras                                                                                                                       Last updated on 04/04/2022",
  "content_length": 3806,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:35"
}