{
  "name": "Sukumar Nandi",
  "homepage": "https://www.iitg.ernet.in/sukumar",
  "status": "success",
  "content": "Prof. Sukumar Nandi Home Page Professor Sukumar Nandi, FNAE, FAAIA, FAIIA, FIETE, FIE, SM-ACM, SM-IEEE Senior Professor Department of Computer Science & Engineering and Dean of Administration Indian Institute of Technology Guwahati Guwahati – 781039 India. E-mail : doad @ iitg.ac.in, sukumar @ iitg.ac.in, sukumar.nandi @ gmail.com, sukumar @ nandifamily.in Phone: +91 – 361 – 2582357 (Dept CSE), 2582010 (Dean) +91 – 361 – 2919005 (Res) Fax: +91 – 361 – 2692787, 2690762 Area of Research: Computer Networks, Computer and Network Security, Machine Learning, VLSI, Computer Architecture, and Computational Linguistic Brief Introduction Fellow of Indian National Academy of Engineering Fellow of the Asia-Pacific Artificial Intelligence Association Fellow of the International Artificial Intelligence Industry Alliance Senior Member ACM Senior Member IEEE Fellow of the Institution of Engineers (India) Fellow of the Institution of Electronics and Telecommunication Engineers (India) Senior Professor, Dept. of Computer Science and Engineering Indian Institute of Technology Guwahati, Guwahati-781039, India Professional Experience Working as Professor (HAG scale) in Department of Computer Sc. & Engg. IIT Guwahati from 1st September 2009. Worked as Professor in Department of Computer Sc. & Engg. IIT Guwahati from 17th May 2002 to 31st August 2009. Worked as Visiting Senior Fellow in Division of Computer Systems, School of Computing Engineering, Nanyang Technology University, Singapore from 2nd June 2002 to 1st June 2003 (on-leave from IIT Guwahati). Worked as Associate Professor in Dept. of computer Sc. & Engg., IIT Guwahati from 30th May 1998 to 16th May 2002. Worked as Assistant Professor in Dept. of computer Sc. & Engg., IIT Guwahati from 8th November 1995 to 29th May 1998. Worked as Junior Scientific Officer/Junior Project Officer in the DOE-sponsored Projects January 1991 to 6th November 1995, at Dept. of Computer Sc. & Engg. IIT Kharagpur. Worked as Assistant Professor in the Dept. of Computer Engg., Birla Institute of Technology , Mesra, Ranchi from October 1989 to December 1990. Academic Qualification Ph D in Computer Science and Engineering from Indian Institute of Technology Kharagpur. M Tech in Computer Science from Calcutta University. B Tech (Applied Physics) in Electrical Engineering (Specialization in Instrumentation) form Calcutta University. B Sc (Honours) in Physics from Calcutta University Administrative Experience Dean of Administration, IIT Guwahati from 18th September 2024 to 17th September 2026. Dean Infrastructure, Planning and Management, IIT Guwahati from 24th February 2021 to 23rd February 2022. Head, Centre for Linguistic Science and Technology, IIT Guwahati from 31st December 2014 to 7th June 2020. Deputy Director, IIT Guwahati from September 3, 2012 to March 31, 2015. Dean of Academic Affairs, IIT Guwahati from July 7, 2008 to September 2, 2012. Dean of Research and Development, IIT Guwahati from January 3, 2009 to February 9, 2009. Head, Computer Science and Engineering (including Head Computer and Communication Centre), IIT Guwahati from September 2004 to September 2007. Member, Board of Governor, IIT Guwahati from January 2005 to December 2006. Head, Centre for Educational Technology, IIT Guwahati and Coordinator, National Programme on Technology Enhanced Learning, IIT Guwahati from May 2004 to March 2006. Served as Point-of-Presence Coordinator of the IIT Guwahati ERNET Node from June 2003 to July 2009. Faculty Advisor for Techniche'99, Techniche'2k and Techniche'2k1 of IIT Guwahati (Annual All India Technical Festival of students). Served as Vice-Chairman JEE-2000 of IIT Guwahati. Served as Hostel Warden of IIT Guwahati from June 1997 to May 2000. Served as Chairman GATE-99 of IIT Guwahati. Community Service General Chair of the SPACE 2025: Fifteenth International Conference on Security, Privacy and Applied Cryptographic Engineering. General Chair of the IEEE ANTS 2024. General Chair of the IEEE GCON 2023. General Co-Chair of the IEEE INDICON 2021. General Chair of the Third ISEA International Conference on Security and Privacy 2020. General Co-Chair of the Bhartiya Education, Science and Technology (BEST) 2018. Co-Convener and Advisor of the National Symposium on Cognitive Science 2017. Program Co-Chair of the 2nd ISEA International Conference on Security and Privacy (ISEA-ISAP 2018). Program Co-Chair of the ISEA Asia Security and Privacy Conference (Asia S&P 2017). General Co-Chair of the International Conference on Accessibility to Digital World (ICADW 2016). Convener of the 38th International Conference of the Linguistic Society of India (ICOLSI-38) 2016. Convener of the 22nd Himalayan Languages Symposium (HLS22) 2016. General Co-Chair of the 20th International Symposium on VLSI Design and Test (VDAT 2016). General Co-Chair of the 8th International Conference on Information Systems Security (ICISS 2012) Organizing Secretary, the Twenty-sixth National Convention of Computer Engineers 2012 (https://sites.google.com/site/ncieiassam) Track Co-Chair of the I-SPAN 2011. Track Co-Chair of the TENCON 2009. Publicity Co-Chair of the COMSNETS 2009. Network Symposium Track Co-Chair, NCC 2009. General Co-Chair of the 15th International Conference on Advanced Computing and Communication (ADCOM) 2007. General Vice Chair of International Conference on Distributed Computing and Networking (ICDCN) 2006. Reviewer for IEEE Transactions on CAD, IEEE Transactions on Wireless Communications, IEEE Transactions on Mobile Computing, IEEE Transactions on Wireless Networks, IEEE Transactions on Systems, Man, and Cybernetics, IEEE Communications Letters, IEE Proceedings-Computer and Digital techniques, IET proceedings, Computer Networks, IETE Technical review, and several conferences such as VLSI design, NCC, PReMi, HiPC, ISWCS, AEWiNS, ICDCIT, CIT, ADCOM, ICISS, ICDCS, WCNC, ISCC, INDICON, ICISIP, IWDC, ICDCN, ATNAC, CCSEIT, ACSAC, NETCoM, SIN, IEEE ANTS, IEEE COMSNETS, NGMAST, Q2SWinet, WiMOA, ICCSEA, InfoSecHiComNet, VDAT, ATNAC, IEEE TENSYMP, ISWPC, ISWCS, and TENCON etc. Other Information Since March 2025, I am serving as a Member of the Executive Council of JSS University, Noida, UP. Since July 2024, I am serving as a Member of the Academic Council of Dhirubhai Ambani Institute of Information and Communication Technology (DA-IICT). In September 2022, I have been elected as Fellow of the Asia-Pacific Artificial Intelligence Association. From January 2021 to December2022, I was a Member of the Finance Committee of Gauhati University. From January 2020 to December 2022, I was a Member of the Executive Council of Gauhati University. Our Ph D student received the Young Scientist Award for our paper in the 20th International Conference on Innovations for Community Services (I4CS 2020). Second best paper award in the 19th International Conference on Innovations for Community Services (I4CS 2019). Since April 2019, I am serving as Member Board of Management of the Centre for Computer Science and Applications of Dibrugarh University. From March 2019 to December 2022, I was a Member Board of Governors, CIT Kokrajhar. Since July 2018, I am serving as an Expert Member of Board of Undergraduate (ECE) of Tezpur University, Tezpur. From 26th July 2017 to 25th July 2019, Member School Board of SOCIS, IGNOU. From 20th December 2017 to 19th December 2020, Member Senate, CIT Kokrajhar. In November 2016, I have been elected as Fellow of Indian National Academy of Engineering. Since January 2015, I am serving as a Member Board of Governors, Triguna Sen School of Technology, Assam University, Silchar. From May 2013 to February 2023, Member Senate, National Institute of Technology, Mizoram. From May 2013 to February 2017, Member Senate, National Institute of Technology, Manipur. From December 2012 to March 2015, Member Board of Governors, National Institute of Technology, Arunachal Predesh. From April 2012 to March 2015, Member Academic Council, Bodoland University, Assam. From April 2011 to March 2015, Member Academic Council, North Eastern Regional Institute of Science & Technology, Arunachal Pradesh. Best paper award in the 16th International Conference on Distributed Computing and Networking 2015. Best paper award in the second international conference on business and information management 2014. Best paper award in the Seventh IEEE International Conference on Advanced Networks and Telecommunication Systems 2013. Best paper award in the second international conference on Recent advances in Engineering and Technology 2013. Best paper award in the First International Conference on Security of Internet of Things 2012. Best paper award in the International conference on soft computing for problem solving 2011. IETE K S Krishna Memorial Award for the best system oriented paper in Journal IETE Technical Review 2008. Best paper award in the 15th International Conference on Advanced Computing and Communications 2007. Best paper award in the International Conference on Embedded Systems, Mobile Communication and Computing, 2007. From January 2011 to December 2014, an Expert Member of Board of Studies (CSE), North Eastern Regional Institute of Science & Technology, Arunachal Pradesh. In August 2009, I have been elevated as a Senior Member ACM. In April 2009, I have been elected as Fellow of the Institution of Electronics and Telecommunication Engineers (India). From April 2009 to July 2014, an Expert Member of Board of Studies for the Dibrugarh University Institute of Engineering & Technology, Dibrugarh University, Dibrugarh. In August 2007, I have been elected as Fellow of the Institution of Engineers (India). From July 2006 to June 2009, an Expert Member of Board of Undergraduate (CS) of Assam University, Silchar. From April 2006 to July 2014, an Expert Member of Board of Undergraduate/Post graduate Studies (CS) of Rajib Gandhi University, Itanagar. Since April 2006, I am serving as an Expert Member of Board of Undergraduate (CSE) of Tezp",
  "content_length": 180503,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:40"
}