{
  "name": "SuKyoung Lee",
  "homepage": "http://winet.yonsei.ac.kr/home/professor",
  "status": "success",
  "content": "Professor – Winet Lab Skip to content Winet Lab SuKyoung Lee Professor ▶ Affiliation Department of Computer Science College of Engineering, Yonsei University 50 Yonsei-ro, Seodaemoon-gu, Seoul 120-749 Republic of Korea ▶ Office: 4th Engineering Building D912 ▶ Tel: +82-2-2123-5722 ▶ Email: sklee@yonsei.ac.kr Bio SuKyoung Lee is currently a professor with Yonsei University. She received her B.S., M.S. and Ph.D. degrees in Computer Science from Yonsei University, Seoul, Korea, in 1992, 1995, and 2000, respectively. Before starting her Ph.D. course, she joined Korea Telecom (KT) R&D center during the year 1995. During the summer of 2004 and 2005 as well as from 2000 to 2003, she worked as a researcher at the National Institute of Standards and Technology (NIST), Advanced Networking Technologies Division in Gaithersburg, Maryland, USA where she investigated issues relating to vertical handoff in integrated WLAN and cellular networks and routing in optical Internet. She also worked as a part-time lecturer at Yonsei, Kookmin and DukSung Womens’ Universities. She worked as an assistant professor with Sejong University from 2003 to 2005. Her current research interests include Integration of WLAN and cellular networks, Mobile IP and Optical Internet. Industrial Experience Researcher at NIST, Advanced Networking Technologies Division, Emerging & Mobile Network Technologies Group, 2011.7 – 2012.6 Researcher at NIST, Advanced Networking Technologies Division, Emerging & Mobile Network Technologies Group, 2004.7 – 2009.8 Assistant professor at Sejong University, Graduate School of Information & Communications, 2003.9 – 2005.8 Researcher at NIST, Advanced Networking Technologies Division, High Speed Network Group, 2000.8 – 2003.8 Research Associate at Industrial Technology Researcher Center in Yonsei University, 1997.3 – 2001.2 Researcher at Korea Telecommunication R&D Center, 1995.8 – 1996.3 Academic and Standards Activities IEEE Wireless Communications Magazine, Associate Editor-in-Chief: 2023. 1. 1. ~ 현재 Journal of Communications and Networks, Publication Editor: 2015. 1. 1. ~ 현재 Journal of Communications and Networks, Editorial Board: 2015. 1. 1. ~ 현재 Frontiers in High Performance Computing, Associate Editor: 2023. 1. 1. ~ 현재 NIST (National Institute of Standards and Technology), High Speed Network Group – Vertical handover over wireless networks로 공동 연구 수행 중 개방형 통신 학회 (OSIA), 협동이사: 2005. 3. 1 ~ 현재 한국정보과학회 정보통신연구회, 협동이사: 2004. 7. 1 ~ 현재 한국통신학회 교환 및 라우팅 연구회, 운영위원: 2004. 1. 1 ~ 현재 한국통신학회 여성위원회, 운영위원: 2004. 1. 1 ~ 현재 한국통신학회 Wireless Access Networks and NS-2 워크샵, 프로그램 위원: 2005 7.23-24 한국통신학회 워크샵, 행사위원: 2005. 6.2 한국통신학회 교환 및 라우팅 연구회 BcN 워크샵, 학술 위원: 2005. 3. 3 ~ 4 광 인터넷 우수연구센터 (ERC: Engineering Research Center) 참여: 2005. 2 한국통신학회 <통신기술의 이해- Home Network> 워크샵, 행사위원: 2004. 10. 29 한국통신학회 워크샵, 행사위원: 2004. 6. 4 한국통신학회 Wireless Access Networks and NS-2 단기강좌, 홍보위원: 2004. 4. 13 ~ 14 Awards 연세대학교 우수강의 교수상: 2025 Mobihoc Best Poster Award: 2022 Okawa Foundation Research Grant 수상: 2013 한국정보과학회 추계학술대회 우수논문상: 2009 한국정보과학회 추계학술대회 우수논문상: 2008 전자정보통신 학술대회 우수논문상: 2008 IEEE Seoul Section HMPC: 2008 연세대학교 우수강의 교수상: 2007 Best paper award by Yonsei University: 2001",
  "content_length": 3184,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:01"
}