{
  "name": "Sumanto Dutta",
  "homepage": "https://ksca.kiit.ac.in/profiles/sumanto-dutta",
  "status": "success",
  "content": "Sumanto Dutta – School of Computer Applications Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Sumanto Dutta Sumanto Dutta Sumanto Dutta Assistant ProfessorSumanto Dutta is an Assistant Professor at the School of Computer Applications, KIIT University. Before joining KIIT University in December 2023, he was a PhD research scholar with the National Institute of Technology Rourkela. He did his MTech in Computer Science from the National Institute of Technology, Rourkela, Odisha, India, in 2019. He has a total of 4.3 years of teaching experience. He has been an assistant professor at the Institute of Industrial and Computer Management and Research and Maharashtra Institute of Technology - School of Management in Pune, India. His main research interests are Spatiotemporal Data Analysis, Data Mining, Machine Learning, and Artificial Intelligence. Profile LinksEmail :[email protected]Scopus Id :57209181426 Social LinksProfileRecent PublicationsProfileResearch InterestsData Mining, Machine Learning, Data Science, Spatio-Temporal Data Analysis, Artificial Intelligence, Signal ProcessingRecent PublicationsJournals/Conferences :\"Dutta, S., & Patra, B. K. (2023). Inferencing transportation mode using unsupervised deep learning approach exploiting GPS point-level characteristics. Applied Intelligence, 53(10), 12489-12503. Dutta, S., Das, A., & Patra, B. K. (2022). CLUSTMOSA: Clustering for GPS trajectory data based on multi-objective simulated annealing to develop mobility application. Applied Soft Computing, 130, 109655. Dutta, S. (2021, November). TrajNet: Outlier Detection in Vehicle Trajectory Data using Capsule Network based One-Shot Learning. In Proceedings of the 29th International Conference on Advances in Geographic Information Systems (pp. 670-671). Hazra, S., Dutta, S., & Nandy, A. (2021). A study on understanding cognitive states through gait analysis. Cognitive Systems Research, 69, 41-49. Agrawal, S., Dutta, S., & Patra, B. K. (2021, July). Sentiment analysis of short informal text by tuning BERT-Bi-LSTM model. In IEEE EUROCON 2021-19th International Conference on Smart Technologies (pp. 98-102). IEEE. Dutta, S., Hazra, S., & Nandy, A. (2020, July). A Smart Ambulatory Cognitive State Taxonomy System Through EEG Signal Analysis. In 2020 11th International Conference on Computing, Communication and Networking Technologies (ICCCNT) (pp. 1-7). IEEE. Dutta, S., & Nandy, A. (2020). An extensive analysis on deep neural architecture for classification of subject-independent cognitive states. In Proceedings of the 7th ACM IKDD CoDS and 25th COMAD (pp. 180-184). Dutta, S., & Nandy, A. (2019, November). Data augmentation for ambulatory EEG based cognitive state taxonomy system with RNN-LSTM. In International Conference on Innovative Techniques and Applications of Artificial Intelligence (pp. 468-473). Cham: Springer International Publishing. Dutta, S., Hazra, S., & Nandy, A. (2019). Human cognitive state classification through ambulatory eeg signal analysis. In Artificial Intelligence and Soft Computing: 18th International Conference, ICAISC 2019, Zakopane, Poland, June 16–20, 2019, Proceedings, Part II 18 (pp. 169-181). Springer International Publishing.\"Delve into the world of rolex sky dweller replica! Understand the benefits of these stylish alternatives, from affordability to design accuracy, and elevate your accessory game today! sachi2024-09-02T19:29:57+05:30 Page load link Go to Top",
  "content_length": 3505,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:46"
}