{
  "name": "Sumon Biswas",
  "homepage": "https://sumonbis.github.io",
  "status": "success",
  "content": "Sumon Biswas Search Sumon Biswas Assistant Professor Department of Computer and Data Sciences Case School of Engineering Case Western Reserve University Email: sumon@case.edu About I’m a tenure-track Assistant Professor at Case Western Reserve University, in the Department of Computer and Data Sciences. Before joining CWRU, I was a Postdoctoral Researcher at Carnegie Mellon University, where I worked with Dr. Eunsuk Kang in the Institute for Software Research (ISR). I received my Ph.D. in Computer Science from Iowa State University (ISU) under the supervision of Dr. Hridesh Rajan. For my dissertation, I worked on verifying and reasoning algorithmic fairness in ML pipeline. My research interests are broadly at the intersection of Software Engineering (SE) and AI, focusing on engineering responsible AI systems. I’m currently working on formal verification and design of fairness and safety of AI systems. [For prospective students] I’m seeking multiple self-motivated students (Ph.D. and M.S.) to join my research group. If you are interested, please email me your CV and unofficial transcripts. Research I adopt both formal and empirical approaches to achieve safety and fairness through analysis of software abstractions and their real-world implementations. Formal verification and reasoning: fairness verification of DNN (ICSE'23), causal reasoning in ML (FSE'21), compositional fairness (ICSE'23) Designing fair and safe AI: Long-term fairness (ICSE'25), safety in presence of feedback loop (FSE'23), root cause analysis of bias (FSE'20), fair AutoML (FSE'23) AI engineering and analysis: AI software architecture (ICSE'22), ML technical debts (FSE'22), Repaying debts using LLM (ICSE'24), mining open-source ML (MSR'19) Currently, I’m focusing on foundation models and LLMs, with an emphasis on safety and responsible deployment of AI agents and systems. Our lab runs the state-of-the-art AISC2 cluster, comprising five HGX H200 servers featuring 40 NVIDIA H200 GPUs (141GB memory each). Fueled by ultra-fast InfiniBand fabric, the cluster delivers industry grade LLM development, multi-tenant runs, and seamless scale for LLM training, fine-tuning, and inference. If you’re excited to push the frontiers of LLMs, let’s talk. Publications Yining She, Sumon Biswas, Christian Kästner, Eunsuk Kang FairSense: Long-Term Fairness Analysis of ML-Enabled Systems In 47th International Conference on Software Engineering (ICSE), Ottawa, Canada, 2025. Cite Code DOI PDF David OBrien, Sumon Biswas, Sayem Imtiaz, Rabe Abdalkareem, Emad Shihab, Hridesh Rajan Are Prompt Engineering and TODO Comments Friends or Foes? An Evaluation on GitHub Copilot In 46th International Conference on Software Engineering (ICSE), Lisbon, Portugal, 2024. Cite DOI PDF Sumon Biswas, Hridesh Rajan Fairify: Fairness Verification of Neural Networks In 45th International Conference on Software Engineering (ICSE), Melbourne, Australia, 2023. Cite Code DOI PDF Usman Gohar, Sumon Biswas, Hridesh Rajan Towards Understanding Fairness and its Composition in Ensemble Machine Learning In 45th International Conference on Software Engineering (ICSE), Melbourne, Australia, 2023. Cite Code DOI PDF Giang Nguyen, Sumon Biswas, Hridesh Rajan Fix Fairness, Don't Ruin Accuracy: Performance Aware Fairness Repair using AutoML In 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), San Francisco, California, 2023. Cite Code DOI PDF Sumon Biswas, Yining She, Eunsuk Kang Towards Safe ML-Based Systems in Presence of Feedback Loops International Workshop on Dependability and Trustworthiness of Safety-Critical Systems with Machine Learned Components at (ESEC/FSE), San Francisco, California, 2023. Cite DOI PDF Sumon Biswas, Mohammad Wardat, Hridesh Rajan The Art and Practice of Data Science Pipelines: A Comprehensive Study of Data Science Pipelines In Theory, In-The-Small, and In-The-Large In 44th International Conference on Software Engineering (ICSE), Pittsburgh, Pennsylvania, 2022. Cite Code DOI PDF arXiv Talk David OBrien, Sumon Biswas, Sayem Imtiaz, Rabe Abdalkareem, Emad Shihab, Hridesh Rajan 23 Shades of Self-Admitted Technical Debt: An Empirical Study on Machine Learning Software In 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), Singapore, 2022. Cite Code DOI PDF Sumon Biswas, Hridesh Rajan Fair Preprocessing: Towards Understanding Compositional Fairness of Data Transformers in Machine Learning Pipeline In 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), Athens, Greece, 2021. Cite Code DOI PDF arXiv See all publications Services Grants Served in the National Science Foundation (NSF) Panel for grant proposal review. Journal Reviewer TOSEM: Serving in the Board of Distinguished Reviewers for ACM Transactions on Software Engineering and Methodology (TOSEM). TSE: Serving as the reviewer for IEEE Transactions on Software Engineering (TSE). IEEE Software: Reviewer for IEEE Software. EMSE: Serving as a reviewer for Springer Journal - Empirical Software Engineering (EMSE). Other review services: Transactions on Affective Computing (TAC) Conference Program Committees (PC) FSE'26: Serving as the Program Committee member of Technical Track of FSE 2026. ICSE'25: Serving as the Program Committee member of Technical Track of ICSE 2025. ICSE'24: Served as the Program Committee member of Technical Track of ICSE 2024. ASE'24: Serving as the Program Committee member of Technical Track of ASE 2024. ASE'23: Serving as the Program Committee member of Technical Track of ASE 2023. ASE'23: Serving as the Program Committee member of Industry Showcase (Papers) Track of ASE 2023. ICSE'23: Served as the Program Committee member of Student Research Competition track of ICSE 2023. ASE'22: Served as the Program Committee member of Industry Showcase track of ASE 2022. ASE'22: Served as the Program Committee member of Late Breaking Results track of ASE 2022. ESEC/FSE'22: Served as the Program Committee member of Doctoral Symposium track of ESEC/FSE 2022. OOPSLA'21 AEC: Served in the program committee of Artifact Evaluation Track of ACM SIGPLAN conference on Object-Oriented Programming, Systems, Languages & Applications (OOPSLA'21). MSR'21: Served as the shadow program committee member of the Technical Track of International Conference on Mining Software Repositories (MSR 2021). Organizing Committees Mentor @ ICSE SMeW : Served as a Mentor in ICSE 2023 SMeW - Student Mentoring Workshop. Onsite Judge @ ICSE'23 SRC: Served as the Onsite Judge of ICSE SRC held at Melbourne, Australia. Accessibility Chair @ SPLASH'20-21: Served the organizing committee of ACM SIGPLAN conference on Systems, Programming, Languages, and Applications (SPLASH 2020 and SPLASH 2021) with OOPSLA, ECOOP and REBASE in Chicago, IL. Web Chair @ Midwest Big Data Summer School: Served in the organizing committee of the Midwest Big Data Summer School 2021 in Ames, IA, United States. WiDS Ambassador: Served as the WiDS Ambassador (Women in Data Science) to organize and promote ISU event as part of the annual WiDS Worldwide Conference organized by Stanford University. Panelist @ ESEC/FSE'20: Served the panel discussion of the session on Fairness at ACM ESEC/FSE 2020 in Sacramento, CA. Research Projects * All Verification ML Fairness SE for AI/ML BigCode Mining Long-Term Safety Other Long-Term Risks in ML Systems This project investigates how feedback loops in ML systems can cause long-term, harmful impacts, and develops tools to detect, analyze, and prevent them before deployment. Design and Architecture of Data Science Pipelines We study, design, and analyze the DS pipeline architecture consisting stages such as preprocessing, modeling, training, evaluation, etc. Safety Assurance of Predictive Systems We built abstractions of ML systems and inferred preconditions to provide assurance in safety-critical predictions. Verifying Neural Networks for Individual Fairness A modular approach to formally verify neural networks. We specified individual property for SMT solver and verified fairness for specific subpopulations. Causal Fairness in Machine Learning Pipeline We used causal reasoning to measure fairness of components and remove them from machine learning pipeline. Fairness Engineering in ML Models We have studied the software engineering concerns of fairness in real-world machine learning models. ML Repo Dataset from GitHub This dataset is created by mining 5M Python program snapshots. The code is transformed to AST for static analysis. Large-Scale Mining of Data-Science Software from GitHub Mining and analyzing data-science repositories can provide insights from historical data. Teaching CSDS 447 - Responsible AI Engineering Introduces methods for designing and maintaining AI-enabled software systems that meet key responsible AI principles—fairness, robustness, explainability, and safety. Students learn how to identify risks such as bias, unsafe autonomy, and hallucinations, and apply software engineering techniques for requirement analysis, testing, verification, and mitigation. Topics: 🔘 introduction to responsible AI and AI engineering 🔘 fairness (metrics, bias mitigation, verification) 🔘 robustness (design and testing for resilient AI) 🔘 safety (requirements for safety-critical AI, production safety) 🔘 explainability (black-box vs. white-box analysis, trustworthiness) 🔘 synergy/trade-offs between properties and accuracy CSDS 393/493 - Software Engineering Covers the principles, processes, and practices of building high-quality software systems. Students work on a semester-long team project while learning about requirements, design, implementation, testing, and maintenance. Topics: 🔘 software development processes (Waterfall, Agile) 🔘 requirements engineering and design principles 🔘 implementation best practices and version control 🔘 te",
  "content_length": 15785,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:47"
}