{
  "name": "Sundaraja Sitharama Iyengar",
  "homepage": "http://users.cis.fiu.edu/~iyengar",
  "status": "success",
  "content": "Dr. S.S. Iyengar Skip to content Research Commercialization and Impact 40 years of Discoveries, Innovations, and Scholarship. 1. Brief Bio 5. Tactical Environmental Support System 2. Cognitive Information Processing (CIM) 6. Sensor-Based Autonomous Mobile Robotics 3. The FuseCPA (Brooks-Iyengar) Algorithm 7. Computational Medicine 7a. Computational DNA Mutation 7b. Cancer Treatment 7c. Glaucoma Detection 4. Optimal Sensor Placement Technique 8. NSF I/UCRC Center for Knowledge Enablement 1. Brief Bio Prof. Dr. S.S. Iyengar is currently the Distinguished University Professor, Founding Director of the Discovery Lab, and Director of the US Army-funded Center of Excellence in Digital Forensics at Florida International University, Miami. He is also the Distinguished Chaired Professor at National Forensics Sciences University, Gandhinagar, India. He was honored as the ‘Founding Father of AI Science in Digital Forensics’ by the Soft Computing Research Society in February 2025. This prestigious recognition is a testament to his lifelong contributions to artificial intelligence, cybersecurity, and digital forensics. He was recently awarded the 2025 Distinguished Career Award in Computer Science and Fellow of the Washington Academy of Sciences. He was awarded the 2023 Karnataka Rajyotava Award (Karnataka State’s 2nd Highest Civilian Award) on November 1st, 2023. He has been involved with research and education in high-performance intelligent systems, Data Science and Machine Learning Algorithms, Sensor Fusion, Data Mining, and Intelligent Systems. Since receiving his Ph.D. degree in 1974 from Missi. State Univ., USA, he has directed over 65 Ph.D. students, many number of postdocs, and many research undergraduate students who are now faculty at Major Universities worldwide or Scientists or Engineers at National Labs/Industries around the world. He has published more than 600 research papers, has authored/co-authored and edited 32 books, and hold various patents. Over the lifetime, his work, Brooks-Iyengar Algorithm has over 5223 publications(s) within this topic and has received 138,976 citation(s). The topic is also known as the Brooks–Iyengar hybrid algorithm. His h-index is 68 and is identified among the top 2% cited scholars and world scientists (from Stanford University and EBMs of JSAN journal. The book titled “Fundamentals of Brooks-Iyengar Distributed Sensing Algorithm” authored by Prof. Pawel (Poland) and others and published by Springer in 2020 celebrates S.S. Iyengar’s accomplishments that led to his 2019 Institute of Electrical and Electronics Engineers (IEEE) Cybermatics Congress “Test of Time Award” for his work on creating Brooks-Iyengar Algorithm and its impact in advancing modern computing. His work has been featured on the cover of many scientific journals like IEEE Transactions and the National Science Foundation’s Breakthrough Technologies report to the US Congress by his research group in both 2014 and again in 2016. He has served on many scientific committees and panels worldwide and has served as the editor/guest editor of various IEEE and ACM journals. His books are published by MIT Press, John Wiley and Sons, CRC Press, Prentice Hall, Springer Verlag, IEEE Computer Society Press, etc. One of his books titled “Introduction to Parallel Algorithms” has been translated into Chinese. During the last thirty years Dr. Iyengar has brought in over 65 million dollars for research and education. More recently in Spring 2021, Dr. Iyengar in collaboration with HBCUs were awarded a $2.25 M funding for setting up a Digital Forensics Center of Excellence over a period of 5 years (2021-2026). He received four (4) honorary Doctor of Science, one recently from Poznan University of Technology in Poland in May 2023. He has been awarded three (3) Lifetime Achievement Awards (INTERPOL, BHU, IEEE), recently for his contribution to the field of Digital Forensics on November 8, 2022, during the 7th INTERPOL DIGITAL FORENSICS EXPERT GROUP (DFEG) MEETING at the National Forensics Sciences University, Gandhinagar, Gujarat, India. He has provided the students and faculty with a vision for active learning and collaboration at Jackson State University, Louisiana State University, Florida International University, and across the world. Dr. Iyengar’s career is a distinguished one, marked by his incredible record of success in groundbreaking research, inspirational teaching, and excellence in community service. It is his consistent drive to fight for and promote the minority and underrepresented groups that is his passion. Dr. Iyengar is a Member of the European Academy of Sciences, Member of the European Academy of Arts and Sciences, a Life Fellow of the Institute of Electrical and Electronics Engineers (IEEE), a Fellow of the Association of Computing Machinery (ACM), a Fellow of the American Association for the Advancement of Science (AAAS), a Fellow of the Society for Design and Process Science (SDPS), a Fellow of the National Academy of Inventors (NAI), a Fellow of the American Institute for Medical and Biological Engineering (AIMBE) and a Fellow of the Washington Academy of Sciences (WAS). He has received various national and international awards including the crowning Test of Time Research (for his seminal work which has impacted billions of computer and internet users worldwide) and Scholarly Contribution Award from 2019 IEEE Congress on Cybermatics, the distinguished Fulbright Scientist, the Times Network NRI (Non-Resident Indian) of the Year Award for 2017, IEEE Meritorious Service award, most distinguished CVR Award at the Society for Design and Process Science (SDPS 2017), Innovation-2-Industry Award, Distinguished Rain Makers for Leadership and Research Award, World’s Best Technology Showcase award, Technology Innovation Award Louisiana Tech University Research Foundation Inventor Award, Distinguished Research Master Award, IBM Distinguished Faculty Award, and the NRI Mahatma Gandhi Pradvasi Medal at the House of Lords in London in 2013 among others. He was awarded Satish Dhawan Chaired Professorship at IISc, then Roy Paul Daniel Professorship at LSU. He has received the Distinguished Alumnus Award of the Indian Institute of Science. In 1998, he was awarded the IEEE Computer Society’s McCluskey Technical Achievement Award and is an IEEE Golden Core Member. Professor Iyengar is an IEEE Distinguished Visitor, SIAM Distinguished Lecturer, and ACM National Lecturer. In 2006, his paper entitled, A Fast-Parallel Thinning Algorithm for the Binary Image Skeletonization, was the most frequently read article in the month of January in the International Journal of High-Performance Computing Applications. His innovative work called the Brooks-Iyengar algorithm along with Professor Richard Brooks from Clemson University is applied in industries to solve real-world applications. Dr. Iyengar’s work had a big impact; in 1988, when he and his colleagues discovered “NC algorithms for Recognizing Chordal Graphs and K-trees” [IEEE Trans. on Computers 1988]. This breakthrough result led to the extension of designing fast parallel algorithms by researchers like J. Naor (Stanford), M. Naor (Berkeley), and A. A. Schaffer (AT&T Bell Labs). His research has been funded by National Science Foundation (NSF), Defense Advanced Research Projects Agency (DARPA), Multi-University Research Initiative (MURI Program), Office of Naval Research (ONR), Department of Energy / Oak Ridge National Laboratory (DOE/ORNL), Naval Research Laboratory (NRL), National Aeronautics and Space Administration (NASA), US Army Research Office (URO), and various state agencies and companies. He has served on US National Science Foundation and National Institute of Health Panels to review proposals in various aspects of Computational Science and has been involved as an external evaluator (ABET-accreditation) for several Computer Science and Engineering Departments across the country and the world. Dr. Iyengar has also served as a research proposal evaluator for the National Academy. Dr. Iyengar has been a Visiting Professor or Scientist at Oak Ridge National Laboratory, Jet Propulsion Laboratory, Naval Research Laboratory, and has been awarded the Satish Dhawan Visiting Chaired Professorship at the Indian Institute of Science, the Homi Bhaba Visiting Chaired Professor (IGCAR), and a professorship at the University of Paris-Sorbonne. ===================================================================== Dr. S.S. Iyengar is an interdisciplinary computational scientist of international repute who has been a pioneer in multiple fields. Marked by his incredible record of success in the areas of world-class research, superb teaching, and excellence in community service, he has also significantly impacted industry, through his many discoveries and patents. His distinguished international and national research work have consistently been recognized by US government agencies, industry pioneers, and his research colleagues. His work has been featured on the cover of the National Science Foundation’s breakthrough technologies in both 2014 and again in 2016. Dr. Iyengar has garnered multiple awards for his work and made fundamental contributions in a variety of areas that impact our lives today. His seminal contributions continue to be seen in places like Raytheon, Telcordia, Motorola the United States Navy, DARPA and other universities and research laboratories around the world. HONORARY DOCTORATE OF SCIENCE TO DR. S. S. IYENGAR – Poznan University of Technology (PUT), Poznan, Poland [Link] Poznan University of Technology (PUT), Poznan, Poland, bestowed an Honorary Doctorate of Science to Dr. S. S. Iyengar, Distinguished University Professor and Ryder Professor of the Knight Foundation School of Computing & Information Science. To formally make this announcement to FIU’s leadership, a delegation of high-ranking university officials, including Rector Professor Teofil Jesionowski, PUT, and ",
  "content_length": 78519,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:57"
}