{
  "name": "Sung-Eui Yoon",
  "homepage": "http://sglab.kaist.ac.kr/~sungeui",
  "status": "success",
  "content": "﻿ Sungeui Yoon (윤성의, KAIST Computer Graphics, 카이스트 컴퓨터 그래픽스, 비젼 Vision, 로보틱스 Robotics, 렌더링 Rendering, 이미지 검색 Image search, Image retrieval) Sung-Eui Yoon (윤 성의) Professor Scalable Graphics, Vision, & Robotics Lab. Dept. of Computer Science KAIST 291 Daehak-ro(373-1 Guseong-dong), Yuseong-gu, Daejeon, 305-701 South Korea +82-42-350-3531 (office) +82-42-350-3510 (fax) Email : sungeui 'at' gmail.com Office: 3432 at CS building Other affiliations: KAIST AI, KAIST Robotics Program, CS Robotics Old pictures About Me CV, publications, Google scholar profile, blog. Hi, I'm Sung-Eui Yoon(윤 성의) and professor at KAIST (Korea Advanced Institute of Sci. and Tech.) Currently, I am leading Scalable Graphics, Vision, & Robotics (SGVR Lab.) at KAIST. My research interests span scalable graphics, vision, robotics, and AI problems. I received my Ph.D. degree from Dept. of Computer Science, University of North Carolina at Chapel Hill under the advisory of Dr. Dinesh Manocha and did post. doc at Lawrence Livermore National Lab. I also received my B.S. and M.S. degree from Dept. of Computer Science, Seoul National University. Here is my academic lineage. Fortunately, I received Outstanding Planning Paper Award at ICRA 23, Outstanding Navigation Award Finalist at ICRA 22, Excellent class at KAIST, 20, Next-Generation Scientist Award (in the category IT category), 2019, Technical Innovation, KAIST, 2018, Best Paper Honorable Mention at PG 18, etc. I am married, and have one daughter and one son (pictures). Job opening I am actively looking for self-motivated graduate students and post docs. If you are interested in my research areas, please feel free to contact me. Check out the current postdoc opening. Books Rendering Sung-eui Yoon 1st edition, July 2018, 148 pages Freely available on the internet Copyright 2018 Real-Time Massive Model Rendering Synthesis Lectures on Computer Graphics\tand Animation Sung-eui Yoon, Enrico Gobbetti, David Kasik, and Dinesh Manocha 2008, 122 pages Morgan & Claypool Publishers Other ongoing draft on image search and motion planning. Teaching Graduate-level Web-Scale Image Retrieval: S21, S20, F18, F16, F14, F12, F11 Its videos are available at KLMS Motion planning: F20, F19, S17, F15, F13, F11, Fall 09 Graduate-level CG: S22, S19, S16, S13 Advanced Rendering: Fall 2010 , Fall 2008 Scalable Computer Graphics: Fall 2007 Undergraduate-level CS482, Interactive CG: F21 F18 F15 CS380, Computer Graphics: S20, S17, S14, S11, S10, S09, S08 Its videos (S14) are available at KLMS CS206, Data Structure: S19, F14, F13 CS101, Introduction to Programming: S15, S14 Tutorials/Workshops at conf. Motion Planning and Application: KROS 25, KCC 24, KROS 14 Sound Source Localization for Robots and AI speakers: KCC 21, ICRA 19 Heterogeneous Parallel Computing: KSC 18 Image Search and Classification: KSC 21, CVPR 16, S14 at KIISE Open SWs to Our Research: Korea HCI 16, KCC 15 Photo-Realistic Rendering: SIGGRAPH 15, Eurographics 15, KCGS 14 Massive Model Rendering: Visualization 09, SPM 08, SIG. Asia 08, SIGGRAPH 08, 07, 06, EG 06, Ray tracing: SIGGRAPH 06 Collision detection: EG 12, SSIGGRAPH and SIG. Asia 06 Conf., Workshop, and Tutorial at Conferences Sound Source Localization for Robots Sound Source Localization and Its Applications for Robots IEEE ICRA (International Conference on Robotics and Automation) 2019 Workshop chai: Sung-eui Yoon Course on image search and classification: Recent Image Search Techniques IEEE CVPR 2016 Sung-eui Yoon and Zhe Lin Conference for Computer Graphics ACM Symp. on Interactive 3D Graphics and Games 2012 Sung-eui Yoon, Conf. co-chair for ACM I3D 2012 ACM Symp. on Interactive 3D Graphics and Games 2013 Sung-eui Yoon, Program co-chair for ACM I3D 2013 Course on high-quality rendering: Denoising Your Monte Carlo Renders: Recent Advances in Image-Space Adaptive Sampling and Reconstruction ACM SIGGRAPH 2015 Nima Kalantari, Fabrice Rousselle, Pradeep Sen, Sung-Eui Yoon, and Matthias Zwicker State of the Art in Interactive Ray Tracing ACM SIGGRAPH 2006, Co-speaker Course on proximity query: Recent Advances in Real-Time Collision and Proximity Computations for Games and Simulations Organizer: Sung-eui Yoon and Dinesh Manocha Lecturers: Erwin Courmans, Richard Tonge, Dinesh Manocha, Young J. Kim, Sung-eui Yoon ACM SIGGRAPH 2010 This was offered at ACM SIGGRAPH Asia 2010 Organizer: Sung-eui Yoon and Young J. Kim Lecturers: Takahiro Harada, Young J. Kim, Sung-eui Yoon This was offered at EG 2012 Organizer: Sung-eui Yoon Lecturers: Erwin Coumans, Stephen Frye, Takahiro Harada, Sung-eui Yoon Course on massive model rendering: Tutorial: Interactive Massive Model Rendering Organizer: David Kasik and Sung-eui Yoon Lecturers: E. Gobbetti, D. Kasik, D. Manocha, R. Pajarola, P. Slusallek, and S.-E. Yoon IEEE Visualization 2009 Tutorial: Interactive Massive Model Rendering Organizer: Sung-eui Yoon Lecturers: TBA ACM SIGGRAPH Asia 2008 Class: Massive Model Visualization Techniques Organizer: David Kasik Lecturers: A. Dietrich, E. Gobbetti, D. Manocha, F. Marton, P. Slusallek, A. Stephens, S-E, Yoon ACM SIGGRAPH 2008 Mini-Symposium: Technical Strategies for Massive Model Visualization Summary paper Enrico Gobbetti, David Kasik, and Sung-eui Yoon ACM Solid and Physical Modeling Symposium, 2008 Course 4: State of the Art in Massive Model Visualization Organizer: David Kasik Lecturers: B. Bruderlin, W. Correa, A. Dietrich, E. Gobbetti, D. Manocha, F. Marton, I. Quilez, P. Slusallek, A. Stephens, S-E, Yoon ACM SIGGRAPH 2007 Tutorial 2: Real-time Interactive Massive Model Visualization D. Kasik, D. Manocha, S. Yoon, A. Stephens. B. Bruderlin, P. Slusallek, A. Dietrich, E. Gobbetti, F. Marton, W. Correa, I. Quilez Eurographics 2006, Vienna Thesis Interactive Visualization and Collision Detection using Dynamic Simplification and Cache-Coherent Layouts Sung-Eui Yoon, Department of Computer Science, University of North Carolina at Chapel Hill, 2005 Links that I'm occasionally visiting. This document is last updated in Apr, 2017.",
  "content_length": 6097,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:57"
}