{
  "name": "Sung Ju Hwang",
  "homepage": "http://www.sungjuhwang.com",
  "status": "success",
  "content": "Sung Ju Hwang Sung Ju Hwang Brief Bio I am an associate professor in the Kim Jaechul School of Artificial Intelligence and School of Computing at KAIST. Prior to working at KAIST, I was an assistant professor in the School of Electric and Computer Engineering at UNIST, and before that I was a postdoctoral research associate at Disney Research, working under the supervision of Professor Leonid Sigal. I did my Ph.D. in computer science at University of Texas at Austin, under the supervision of Professor Kristen Grauman. During my Ph.D. I also closely collaborated with Professor Fei Sha at University of Southern California. I am also the CEO of DeepAuto, An AI startup focused on building autonomous agents for efficient workflow automation. Vacancies To prospective master students If you want to join our research group, please contact me as early as possible, so that you can have an internship for at least 6 months to one year before applying to the master program. Also, please be aware that I will only hire students planning to pursue Ph.D. study under my supervision (around half of the M.S. students can advance to the Ph.D. program due to the Ph.D. quotas). For this year and next year, I am planning to recruit students who are interested in working on Agentic AI, Self-evolving AI, AI for finance and AI for scientific discovery (protein-design AIs) . To prospective Ph.D. students If you want to do Ph.D. study under my supervision, then I recommend you to apply to the master’s program first (The master program at KAIST is an academic degree program and you will be fully supported). Please note that I can take only a limited number of Ph.D. students each year as advisees (currently three), and will put higher priorities on students who have done master’s study under my supervision. However I will still consider few qualified applicants outside my group as my advisees (e.g. applicants with more than one top-tier ML/AI papers). To prospective postdocs I am looking for postdocs with strong background in deep learning, preferably with multiple top-tier ML/AI papers, and experience on AI-based drug discovery or agentic AI. You will get involved in multiple ongoing projects and will have a chance to directly advise some of my students. Please send me your CV if you are interested. News 11/24/2025: I have been appointed as an Associate Editor for TPAMI. 9/19/2025: Seven papers accepted to NeurIPS 2025. I have 23 papers this year (7 NeurIPS, 5 ICLR, 2 ICML, 2 CVPR, 3 EMNLP, 1 NAACL, 1 ACL, 2 ACL Findings). 8/20/2025: Three papers accepted to EMNLP 2025 main conference. 8/20/2025: I will be serving as a senior area chair at ICLR 2026 and ICML 2026. 5/16/2025: One paper accepted to ACL 2025 and two to ACL Findings. 5/2/2025: Two papers accepted to ICML 2025. 2/27/2025: Two papers accepted to CVPR 2025. 1/22/2025: Five papers accepted to ICLR 2025 and one to NAACL. 9/25/2024: Four papers accepted to NeurIPS 2024. I have 22 papers this year (7 ICML, 4 NeurIPS, 4 ICLR, 1 CVPR, 1 EMNLP, 1EMNLP Findings, 2 NAACL, 1 New Phytologist, 1 TPAMI). 9/20/2024: One paper accepted to EMNLP 2024, and one to the Findings of EMNLP 2024. 7/30/2024: One paper published at New Phytologist. 7/22/2024: I will be serving as a senior area chair at ICLR 2025 and an area chair at CVPR 2025. I am also serving as an area chair for AAAI 2025. 5/2/2024: Seven papers accepted to ICML 2024. 3/14/2024: Two papers accepted to NAACL 2024. 2/27/2024: One paper accepted to CVPR 2024. 1/17/2024: Four papers accepted to ICLR 2024. 10/8/2023: One papers accepted to EMNLP 2023 and two to EMNLP Findings. I have 29 papers this year (6 ICLR, 5 ICML, 4 NeurIPS, 2 ACL, 1 EMNLP, 1 CVPR, 1 ICCV, 1 UbiComp, 1 SaTML, 1 Interspeech, 1 ICASSP, 2 ACL Findings, 2 EMNLP Findings and 1 EACL). 9/22/2023: Four papers accepted to NeurIPS 2023. 8/21/2023: I will serve as an area chair for AAAI 2024 and ICLR 2024. 7/14/2023: One paper accepted to ICCV 2023. 5/18/2023: One paper accepted to Interspeech 2023. 5/2/2023: Two papers accepted to ACL 2023, and two to the Findings of ACL 2023. 4/25/2023: Five papers accepted to ICML 2023. 3/7/2023: I will serve as an area chair for NeurIPS 2023. I am also serving as an AC for ICML 2023/ICCV 2023, and as a reviewing chair for CoLLAs 2023. 2/28/2023: One paper accepted to CVPR 2023. 2/16/2023: One paper accepted to ICASSP 2023. 1/21/2023: Six papers accepted to ICLR 2023 (one spotlight) 12/21/2022: I will serve as an area chair for ICML 2023 and ICCV 2023. I also served as an area chair for ICLR 2023. 11/15/2022: One paper accepted to SaTML 2023. 9/15/2022: Four papers accepted to NeurIPS 2022. I have 21 papers this year (7 ICLR, 4 ICML, 4 NeurIPS, 2 AAAI, 1 CVPR, 1 ACL, 1 NAACL and 1 CVIU) 5/15/2022: Four papers accepted to ICML 2022. 4/8/2022: One paper accepted to NAACL 2022. 3/31/2022: 3/2/2022: I am appointed as a KAIST Endowed Chair Professor. 3/1/2022: One paper accepted to CVPR 2022. 2/28/2022: One paper accepted to ACL 2022 (short paper). 1/21/2022: Seven papers accepted to ICLR 2022 (1 oral, 1 spotlight). 12/1/2021: Two papers accepted to AAAI 2022. 9/30/2021: Five papers accepted to NeurIPS 2021 (two spotlights). I have 23 papers this year (5 NeurIPS, 5 ICML, 7 ICLR, 1 ACL, 1 ICCV, 2 AAAI, 1 IJCAI, and 1 Interspeech) 9/1/2021: I am officially tenured. 7/23/2021: One paper accepted to ICCV 2021. 5/8/2021: Five papers accepted to ICML 2021. 5/6/2021: One paper accepted to ACL 2021 (long paper). 4/29/2021: One paper accepted to IJCAI 2021. 1/13/2021: Seven papers accepted to ICLR 2021 (one spotlight). 12/02/2020: Two papers accepted to AAAI 2021. I am serving as an area chair for ICLR 2021, IJCAI 2021, ICML 2021, and NeurIPS 2021. 7/25/2020: Nine papers accepted to NeurIPS 2020 (one spotlight). I have 22 papers this year (9 NeurIPS, 4 ICML, 4 ICLR, 1 ACL, 1 EMNLP, 1 AAAI, 1 ICRA, and 1 Interspeech). 7/18/2020: Our paper “Federated Semi-Supervised Learning with Inter-Client Consistency” received the Best student paper award at the ICML 2020 Workshop on Federated Learning for User Privacy and Data Confidentiality. Research Interests My research interest is mainly on developing novel models and algorithms for tackling new challenges in deploying artificial intelligence systems to various real-world application domains. Regarding machine learning problems, I am mostly interested in the following topics: Generative AIs and LLMs: language modeling, multi-modal foundation models, text-to-image synthesis Self-Evolving AI: neural network generation, code generation, self-training of LLMs, automatic research agents AI for scientific discovery: molecule generation, material discovery, protein representation learning On-device learning: neural network compression (pruning, quantization, and knowledge distillation), online continual learning, federated learning Safe and secure learning: uncertainty modeling & quantification, robustness to distributional shifts, defense against diverse attacks The application domains of interests include but are not limited to, visual recognition, natural language understanding, speech recognition, automatic drug/material discovery, healthcare and finance. Education The University of Texas at Austin, TX, USA Ph.D., Computer Science (Aug 2013) Thesis: ‘Discriminative Object Categorization with External Semantic Knowledge’ The University of Texas at Austin, TX, USA M.A., Computer Science (May 2010) Thesis: ‘Reading Between The Lines: Object Localization Using Implicit Cues from Image Tags.’ Seoul National University, Seoul, Korea B.S., Computer Science and Engineering (Feb 2008) Work Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea KAIST Endowed Chair Professor, Graduate School of AI / School of Computing (Mar 2022 ~ ) Associate Professor, Graduate School of AI / School of Computing (Mar 2020 ~ ) Assistant Professor, School of Computing (Jan 2018 ~ Feb 2020) Ulsan National Institute of Science and Technology (UNIST), Ulsan, Korea Assistant Professor, School of Electric and Computer Engineering (Aug 2014 ~ Dec 2017) Disney Research, Pittsburgh, PA, USA Postdoctoral Research Associate, Computer Vision Group (Sep 2013 ~ Aug 2014) Microsoft Research, Redmond, WA, USA Research Intern, Interactive Media Group (June 2011 ~ Sep 2011) Mentors: Sing Bing Kang, Ashish Kapoor Professional Service Senior Area Chair ICLR 2025, ICLR 2026 Area Chair ICML 2020, ACML 2020, ICLR 2021, IJCAI 2021, ICML 2021, NeurIPS 2021, ICLR 2022, AAAI 2022, ICML 2022, NeurIPS 2022, ICLR 2023, ICML 2023, ICCV 2023, NeurIPS 2023, AAAI 2024, ICLR 2024, ICML 2024, NeurIPS 2024, AAAI 2025, CVPR 2025, ICML 2025, NeurIPS 2025, AAAI 2026 Senior Program Committee AAAI 2020, IJCAI 2020, AAAI 2021, IJCAI 2022, AAAI 2023 Reviewer & Program Committee I was a regular program committee member (or a reviewer) for the following journals and conferences: IEEE Transactions on Pattern Analysis and Machine Intelligence, CVPR, ICCV, ECCV, ACL, EMNLP, UAI, AISTATS. I also (less frequently) reviewed for the following journals/conferences: Journal of Machine Learning Research, IEEE Transactions on Multimedia, Neural Networks, SIGGRAPH, SIGGRAPH ASIA, ACCV, EG Contact Office: E3-1 1427 KAIST School of Computing 291 Daehak-ro, Yuseong-gu, Daejeon, Korea 34141 Email: sungju.hwang at kaist dot ac dot kr",
  "content_length": 9335,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:54"
}