{
  "name": "Sungjin Im",
  "homepage": "https://campusdirectory.ucsc.edu/cd_detail?uid=sim9",
  "status": "success",
  "content": "Campus Directory - UC Santa Cruz UC Santa Cruz MyUCSC People Calendars Maps A-Z Index Search Campus Directory About Admissions Academics Research Campus Life Visit UCSC Quick Start Guides Current Students Faculty & Staff Alumni Prospective Students Parents & Family Community Home » Find People » Campus Directory Search for people, departments, or email addresses. « Back To Search Results Sungjin Im Associate Professor sim9@ucsc.edu sungjin@ucsc.edu Division Baskin School of Engineering Department/College/Unit Computer Science and Engineering Title Associate Professor Affiliation Faculty Faculty Type Regular Faculty Web Site Sungjin Im Primary Office Location Engineering Building 2541B Mail Stop SOE3 Summary of Expertise My area of expertise lies in the design and analysis of algorithms, along with their various applications. My current research focuses on two main areas. Firstly, I'm interested in strengthening traditional worst-case algorithms by incorporating machine learning predictions. This involves exploring how machine learning can improve the performance of algorithms in situations where the worst-case scenario might not be the most common. Secondly, I'm passionate about developing meta-algorithms that can be easily adapted to solve a wide range of problems. This research has a particular emphasis on scheduling and resource allocation. In addition to these current interests, I also maintain a strong interest in database theory and the development of big data algorithms, particularly those that leverage massively parallel processing. Overall, I'm driven by a passion for tackling fundamental algorithmic problems. My research encompasses a broad spectrum of areas, including approximation algorithms, online algorithms, combinatorial optimization, scheduling algorithms, game theory, machine learning, and database theory. Awards, Honors and Grants Best paper finalist. ACM Symposium on Parallelism in Algorithms and Architectures, 2021, 2024 NSF Career Award, 2019 Best student paper award, ACM-SIAM Symposium on Discrete Algorithms, SODA 2010 If you have the proper permissions, you can edit this entry This campus directory is the property of the University of California at Santa Cruz. To protect the privacy of individuals listed herein, in accordance with the State of California Information Practices Act, this directory may not be used, rented, distributed, or sold for commercial purposes. For more details, please see the university guidelines for assuring privacy of personal information in mailing lists and telephone directories. If you have any questions please contact the ITS Support Center. UC Santa Cruz, 1156 High Street, Santa Cruz, Ca 95064 ©2018 Regents of the University of California. All Rights Reserved. (2) Feedback Accreditation Non-Discrimination Policy Employment Privacy Policy & Terms of Use Sexual Violence Prevention & Response Last modified: July 30, 2018",
  "content_length": 2923,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:02"
}