{
  "name": "Sungjin Ahn",
  "homepage": "http://www.sungjinahn.com",
  "status": "success",
  "content": "Sungjin AhnHomeKAIST-Mila AIResearchPublicationsPeopleAGI Seminar SeriesScientist AIGalleriesApplyingHomeKAIST-Mila AIResearchAGI Seminar SeriesScientist AIPublicationsPeopleGalleriesApplyingSungjin AhnKAISTAssociate Professor School of Computing Graduate School of AI KAIST-Mila Prefrontal AI CenterNew York UniversityJoint Appointment Professor I am currently an Associate Professor in the School of Computing at KAIST and a joint appointment professor at New York University. Prior to joining KAIST, I served as an Assistant Professor of Computer Science at Rutgers University, where I was also affiliated with the Center for Cognitive Science. I direct the Machine Learning and Mind Lab, which operates at both KAIST and Rutgers, as well as the KAIST-Mila Prefrontal AI Research Center. You can find my research interests here. My academic journey includes earning a Ph.D. from the University of California, Irvine, where I studied scalable approximate Bayesian inference under Prof. Max Welling's supervision. Subsequently, I completed a postdoctoral fellowship at MILA, focusing on deep learning under the mentorship of Prof. Yoshua Bengio. My complete CV is available here.Biography [short] ContactEmail: sjn.[lastname]@gmail.com or [firstname].[lastname]@kaist.ac.krOffice: E3-1 3435, KAIST Publication [Click]Google ScholarServicesConference Organization Committee•NeurIPS 2022 (Workshop Chair)Workshop Organizing Committee•ICML 2020, Object-Oriented Learning: Perception, Representation, and Reasoning•ICLR 2022 Workshop on the Elements of Reasoning: Objects, Structure and CausalityArea Chair•NeurIPS (2021~)•ICML (2021~)•ICLR (2023~)•AAAI(2021~)Reviewer•NeurIPS (2015-2020)•ICML (2015-2020)•ICLR(2015-2022)•AISTATS(2015 - 2020)•AAAI(2015 - 2020) Awards•2024, KAIST Future-Leading Technologies in Artificial Intelligence [News]•2023, KAIST Breakthroughs, “AI self-learns to discover the structure of the world like humans”•2016, Best Paper Award, International Workshop on Parallel and Distributed Computing for Large Scale Machine Learning and Big Data Analytics (ParLearning)•2012, Best Paper Award, International Conference on Machine Learning (ICML) Teaching•2024-Spring, CS492, Deep Reinforcement Learning, KAIST•2023-Fall, CS672, Reinforcement Learning (Graduate-Level), KAIST•2023-Spring, CS492, Deep Reinforcement Learning, KAIST•2022-Fall, CS570: Artificial Intelligence and Machine Learning, KAIST•2022-Spring, CS376: Machine Learning, KAIST•2021-Spring, CS536: Machine Learning, Rutgers University•2020-Fall, CS444: Topics in Computer Science: Deep Learning, Rutgers University•2020-Spring, CS536: Machine Learning, Rutgers University•2019-Fall, CS535: Pattern Recognition, Rutgers University•2019-Spring, CS671: Probabilistic Agent Learning, Rutgers University•2012-Fall, Project in AI, UC Irvine (Teaching Assistant)•2012-Summer, Undergraduate Summer Research in Machine Learning, UC Irvine (Teaching Assistant)•2012-Spring, Recommender Systems, UC Irvine (Teaching Assistant) Invited Talks•“In Search of Neural Language of Thought Models,” Language Intelligence Research Lab, ETRI, July, 2024•“In Search of Neural Language of Thought Models,” Embodied Intelligence Research Lab, ETRI, June, 2024•“In Search of Neural Language of Thought Models,” CVPR Workshop on Causal and Object-Centric Representations for Robotics, June 17, 2024•“World Models for High-Level Cognition”, CNIR Symposium on Brain, Mind, and Computation, Sungkyunkwan University, July, 2022•“Unsupervised Discovery of World Structure”, KCC Machine Learning Workshop, Jeju, July 11, 2022•“Deep Learning for Understanding the World like Humans”, Colloquium at KAIST Software Graduate Program, Mar 31, 2022•“Unsupervised Discovery of World Structure”, Samsung Research, Mar 31, 2022•Handong Global University, Feb. 2021•Element AI, Canada, Nov. 2019•Center for Cognitive Science, Rutgers University, Nov. 2019•New York University, USA, Nov. 2019•KAIST, Korea, Aug. 6, 2018•Naver, Korea, Aug. 3, 2018•Kakao Brain, Korea, Aug. 2, 2018•Kakao Brain, Korea, Aug. 18, 2017•Vector Institute, Toronto, May. 9, 2017•Rutgers University, New Jersey, May. 1, 2017•Microsoft Research, Redmond, Apr. 28, 2017•Microsoft Maluuba, Montreal, Apr. 19, 2017•Element AI, Montreal, Apr. 7, 2017•IBM T. J. Watson Research, New York, Mar. 6, 2017•Naver Labs, Korea, Jan. 24, 2017•University of Southern California, Jan. 17, 2017•Yonsei University, Korea, Jan. 13, 2017•Seoul National University, Korea, Jan. 12, 2017•SK T-Brain, Korea, Jan. 11, 2017•KAIST, Korea, Jan. 6, 2017•SK-Telecom Research, Korea, Dec. 2016•Agency for Defence Development, Korea, Dec. 2016•KAIST, Korea, 2015•University of Toronto, Toronto, Machine Learning Group, Spring 2015•University of Montreal, MILA, Montreal, Spring 2015•ID Analytics Inc., San Diego, 2012 Students Supervision [Click]",
  "content_length": 4993,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:03"
}