{
  "name": "Sungjoon Choi",
  "homepage": "https://sites.google.com/view/sungjoon-choi/home",
  "status": "success",
  "content": "Robot Intelligence LabSearch this siteEmbedded FilesSkip to main contentSkip to navigationAny sufficiently advanced technology is indistinguishable from magic.- Arthur C. ClarkeRILAB, 2024-03-08Robot Intelligence Lab  (RILAB)RILAB has been focussing on (but not limited to) the following topics. Motion retargeting for humanoids and quadruped robotsPhysically plausible motion generation of both legged robots and neuromuscular modelsHuman-robot interaction focussing on a companion robot Embodied AI utilizing multimodal large language models Shared autonomy for robotic tasksOur lab is co-advised by Sungjoon Choi (Department of Artificial Intelligence) and Kyungjae Lee (Department of Statistics)(notice) We are actively seeking undergraduate interns! Sungjoon Choi (Dept. of AI)My passion lies in the future of robots that coexist with human beings. I am an Associate Professor at the Department of Artificial Intelligence at Korea University and a Principal Scientist at RLWRLD. Before joining Korea University, I was a Postdoctoral Researcher at Disney Research, Los Angeles, from 2018 to 2020, and a Research Scientist at Kakao Brain, Korea, in 2018. My research interests include, but are not limited to, the following areas: human-robot interaction (HRI), conditioned motion generation, and foundation models for robotics. I previously received my Ph.D. degree in Electrical Computer Engineering at Seoul National University in Seoul, Korea, advised by Songhwai Oh. Before that, I received my Bachelor's degree in Electrical Engineering and Computer Sciences at Seoul National University. During my undergraduate years, I worked at Hanool Robotics in Bucheon, Korea, as a software engineer for three years. Kyungjae Lee (Dept. of Statistics)I am on a journey to explore the principles of intelligent decision-making. I am currently an assistant professor in the Department of Statistics at Korea University, Seoul. Previously, I was an assistant professor in the Department of Artificial Intelligence at Chung-Ang University (2021–2024). I completed my B.S. in Electrical Engineering and Computer Science at Seoul National University in 2015 and earned my Ph.D. in Electrical and Computer Engineering from the same institution in 2021 under the supervision of Prof. Songhwai Oh.Updates (selected)(2025-07) Our paper on Text-to-Humanoid Motion Generation has been accepted to Humanoids 2025.(2025-07) Our paper on Spatio-Temporal Motion Retrageting (STMR) has been accepted to T-RO 2025 / ICRA 2026.(2025-06) Our paper on Motion-Language Models (VIM) has been accepted to ICCV 2025.(2025-06) Our paper on Humanoid Motion Retargeting has been accepted to IROS 2025.(2025-06) Our paper on Tendon-driven Soft Robot Hand has been accepted to IROS 2025.(2025-01) Our paper on Dynamic Robot-to-Human Handover has been accepted to ICRA 2025.(2024-07) Our paper on Quality-Diversity Reinforcement Learning (SMORE) has been accepted to Neural Networks.(2024-07) Our paper on Persona-based Interactive Robotic Agent (MASK) has been accepted to RA-L / ICRA 2025.(2024-06) Our paper on Text-based Human Search using Spot (SOCRATES) has been accepted to RO-MAN 2024.(2024-06) Our paper on Visual Preference Inference (VPI) has been accepted to IROS 2024.(2024-01) Two papers on Prosthetic Hand Motion Generation and Tapping Sound Generation have been accepted to EMBC 2024.(2024-01) Our paper on Semi-autonomous Teleoperation with LLMs and Simulators (SPOTS) has been accepted to ICRA 2024.(2024-01) Our paper on Soft Robot Model Identification and Control (KINN) has been accepted to RA-L / IROS 2024.(2024-01) Our paper on Robust Uncertainty Estimation has been accepted to Neurocomputing.(2023-11) Our paper on LLM-based interactive robot agent (CLARA) has been accepted to RA-L / ICRA 2024.(2023-11) Our paper on Diffusion Models in Hilbert Spaces (Hilbert Diffusion) has been accepted to NeurIPS 2023 (Spotlight).(2023-2) Our paper on Uncertainty Estimation and Robust Learning has been accepted to Pattern Recognition.(2023-1) Our paper on Active Visual Search (ZAVIS) has been accepted to ICRA 2023.(2023-1) Our paper on Diffusion-based Human Motion Synthesis (FLAME) has been accepted to AAAI 2023.(2022-9) Our paper on Conditional Motion In-Betweening (CMIB) has been accepted to Pattern Recognition. (2022-6) Our paper on the uncertainty-aware autonomous driving dataset has been accepted to IROS 2022.(2022-3) Our paper on Semi-autonomous Teleoperation has been accepted to ICRA 2022.(2021-3) Our paper on Self-Supervised Motion Retargeting has been accepted to ICRA 2021. (2020-11) Our work on HRI is on CNN, IEEE Spectrum, Designboom, and TheVerge. (2020-9) I am actively looking for motivated Ph.D. students to join Robot Intelligence Lab (RIL).(2020-7) I will be joining Korea University (Department of Artificial Intelligence) as an assistant professor from September.(2020-7) Our paper on human-robot interaction has been accepted to IROS 2020. (2020-5) Our paper on non-parametric motion retargeting has been accepted to RSS 2020. (2020-5) Our paper on entropy-regularized reinforcement learning has been accepted to RSS 2020. (2020-4) Our paper on semi-supervised robust learning has been accepted to CVPR 2020 as an oral presentation. (2020-3) Our paper on latent space modeling for motion re-targeting has been accepted to RA-L / ICRA 2020. Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5430,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:02"
}