{
  "name": "Sungkil Lee 0002",
  "homepage": "http://cg.skku.edu/slee",
  "status": "success",
  "content": "CGLab@SKKU Computer Graphics Lab Research    Publications    Funding    Professor    People    Course    Cal Sungkil Lee (이성길), Ph.D. Professor Director, Computer Graphics Lab. Dept. of Computer Science and Engineering (소프트웨어학과) Leader, BK21 Four Project Division (지속성장미래컴퓨팅교육연구단) College of Computing and Informatics (소프트웨어융합대학) Sungkyunkwan University (성균관대학교) Suwon, South Korea Office: 27328, Eng. Bldg. 2 (제2공학관 27동 27328호) Email: sungkil at skku.edu Phone: +82 31-290-7126 Curriculum Vitae: Sungkil Lee is a professor at Sungkyunkwan University, Korea. He obtained his PhD (2009) and BS (2002) degrees in computer science and engineering and materials science and engineering at POSTECH, Korea. He was a postdoctoral researcher at the Max-Planck-Institut (MPI) Informatik (2009--2011), and a visiting professor at Delft University of Technology (2017). His research interests include real-time GPU rendering, deep learning, view synthesis, GPU computing, optics, synthetic data, and virtual reality. Publication Author Profiles You can find my up-to-date public publication profiles in what follows. Google Scholar User Profile: T-MZWXwAAAAJ ORCiD: 0000-0003-0123-9382 Scopus Author Profile: 8608800400 ACM Author Profile: 81423594461 DBLP: Lee_0002:Sungkil Web of Science: AAJ-8474-2021/4346530 OpenReview Profile: ~Sungkil_Lee2 Education Mar. 2002 - Feb. 2009: Ph.D. in Computer Science and Engineering at the POSTECH, Korea Dissertation: Real-Time Perceptual Rendering with Computational Visual Attention Tracking in Virtual Environments Advisors: Profs. Seungmoon Choi (POSTECH) and Gerard Jounghyun Kim (Korea University) Mar. 1994 - Feb. 2002: B.S. in Materials Science and Engineering at the POSTECH, Korea Minors: Computer Science and Engineering Experiences Apr. 2021 - present: Professor at Sungkyunkwan University, Suwon, Korea. Apr. 2015 - Mar. 2021: Associate Professor at Sungkyunkwan University, Suwon, Korea. Feb. 2017 - Jan. 2018: Visiting Professor at Computer Graphics and Visualization Group, Delft University of Technology, Delft, Netherlands. Mar. 2011 - Mar. 2015: Assistant Professor at Sungkyunkwan University, Suwon, Korea. Mar. 2009 - Feb. 2011: Postdoc. researcher at Computer Graphics Dept., Max-Planck-Institut Informatik, Germany. Academic Activities Membership: ACM, ACM SIGGRAPH, IEEE, IEEE/CS, Eurographics, Asia Graphics, KCGS, KHCI, KIPS, KIISE International Program Committee: EG Symp. Rendering (EGSR) 2025/2023, ACM/EG High Performance Graphics (HPG) 2025/2023/2022/2021, AAAI 2026, 3D Systems and Applications (3DSA) 2023, Pacific Graphics (PG) 2022/2019/2014, ACM Web3D 2020, CAD/Graphics 2017/2015, Eurographics (EG) 2015/2014, IEEE VR 2014, ISMAR 2009 Served as a conference referee for: SIGGRAPH, SIGGRAPH ASIA, CVPR, ICCV, SIGCHI, Eurographics (EG), IEEE Visualization, Pacific Graphics (PG), EG Symp. Rendering (EGSR), High Performance Graphics (HPG), EuroVis, Graphics Interface (GI), IEEE Virtual Reality (VR), ISMAR, WorldHaptics, Eurohaptics, CAD/Graphics, IEEE 3DUI, IEEE ICCE, DASFAA Served as a journal referee for: ACM TOG, IEEE TVCG, IEEE CGA, Computer Graphics Forum, Computers and Graphics, IEEE TCI, Visual Computer, Graphical Models, IEEE TCSVT, Elsevier JVCI, Journal of Supercomputing Served as a program chair for: KCGS 2021, KCGS 2020 Served as an award referee for: Samsung HumanTech Awards Courses 2025. CG, Advanced CG, VR 2023. CG, Advanced CG, VR 2022. CG, CG Theory, Advanced CG, VR 2021. CG, CG Theory, VR 2020. CG, CG Theory, CSE Seminar, Freshmen Seminar 2019. CG, CG Project, Advanced CG, CSE Seminar 2018. CG, CG Theory, ECP 2016. CG, CG Theory 2015. CG, Advanced CG, Algorithm Analysis 2014. CG, CG Theory, Algorithms, Algorithm Analysis 2013. CG, CG Theory, BPP, Algorithm Analysis 2012. CG, Algorithms, BPP, CG Theory 2011. Undergraduate Seminar, Advanced Software, Creative Engineering Design * Note. CG = Computer Graphics, VR = Virtual Reality, BPP = Basis and Practice in Programming, ECP = Engineering Computer Programming Invited Talks 2024.10.29: Samsung MX, Introduction to AI-based graphics (Part IV). 2024.08.27: Samsung MX, Introduction to AI-based graphics (Part III). 2024.06.19: Samsung MX, Introduction to AI-based graphics (Part II). 2024.04.16: Samsung MX, Introduction to AI-based graphics (Part I). 2023.08.09: ACM SIGGRAPH 2023, Potentially Visible Hidden-Volume Rendering for Multi-View Warping. 2019.10.14: Pacific Graphics 2019, Depth Warping and Its Applications. 2019.07.30: ACM SIGGRAPH 2019 Technical Papers, Iterative Depth Warping. 2018.04.13: Kyunghee University, Effective Rendering of Optical Effects. 2017.10.18: GFZ Potsdam, Germany. Perceptually Driven Visibility Optimization for Categorical Data Visualization 2017.05.23: CGV Group Seminar, Delft University of Technology, Netherlands. Effective Rendering of optical Effects. 2016.10.27: K-Global Connect Pangyo Festival, Realistic High-Performance Lens-Flare Rendering for Virtual Reality 2016.09.30: Kyunghee University, Introduction to Modern Real-Time Rendering. 2016.05.31: Modern AR/VR Tutorials, The Institute of Electronic and Information Engineers. Real-Time Global Illumination for VR. 2015.04.22: Nexon, Inc. Practical Real-Time Lens-Flare Rendering. 2014.07.11: Samsung Advanced Institute of Technology . Real-Time Postfiltering Effects. 2014.06.03: UNIST, Real-Time Optical Effect Rendering for Computer Graphics. 2014.04.11: Workshop on Realistic Media, The Korean Society of Broadcast Engineering. Real-Time Optical Effect Rendering. 2014.01.16: CT Forum, Daegu. Real-Time Optical Effect Rendering for Realistic Contents. 2013.11.07: Inha Univ., Real-Time Optical Effect Rendering for Computer Graphics. 2013.10.17: Atlanta GA, IEEE VIS 2013. Perceptually Driven Visibility Optimization for Categorical Data Visualization. 2013.06.17: Zaragoza Spain, EGSR 2013. Practical Real-Time Lens-Flare Rendering. 2012.09.27: KIST. GPU-Based Real-Time Lens Effects Rendering. 2012.09.19: Korea Univ., Getting started with GPGPU. 2012.04.25: Korea Univ., Korea. GPU-Based Real-Time Lens Effects Rendering. 2011.06.10: ETRI, Korea. GPU-Based Real-Time Lens Effects Rendering. 2011.06.10: KAIST, Korea. Real-Time Lens Effects. 2011.06.08: POSTECH, Korea. Real-Time Lens Blur Effects and Focus Control. 2011.04.14: ICAT, Korea. Real-Time Lens Blur Effects. 2010.07.25: Los Angeles CA, SIGGRAPH 2010. Real-time Lens Blur Effects and Focus Control. 2009.12.09: Yokohama Japan, SIGGRAPH ASIA 2009. Depth-of-Field Rendering with Multiview Synthesis. 2008.10.10: Tokyo, Pacific Graphics 2008. Real-Time Depth-of-Field Rendering using Point Splatting on Per-Pixel Layers. 2007.11.03: Los Angeles CA, VRST 2007. Real-Time Tracking of Visuallyl Attended Objects in Interactive VEs. 2004.10.13: Valencia Spain, Presence Workshop 2004. Formation of Spatial Presence: By Form or Content? 27336, College of Software, Sungkyunkwan University, Tel. +82 31-299-4917, Seobu-ro 2066, Jangan-gu, Suwon, 16419, South Korea Campus map (how to reach CGLab)",
  "content_length": 7006,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:02"
}