{
  "name": "Sungbin Lim",
  "homepage": "https://www.sungbin-lim.net",
  "status": "success",
  "content": "Sungbin LimSearch this siteEmbedded FilesSkip to main contentSkip to navigation임성빈(林聖彬)Lim, SungbinPh.D. in Mathematics, Associate ProfessorDepartment of StatisticsCollege of Political Science and EconomicsKorea UniversityE-mail: sungbin at korea dot ac dot krOffice: #613, Sangnam Political Science & Economics Bldg. Other Information[DBLP] [ORCID] [Scopus] [OpenReview] [MathSciNet] [Math Genealogy] [GitHub] [Linkedin] [Facebook]Bio안녕하세요, 고려대학교 통계학과 임성빈 교수입니다.Currently, I am an associate professor at the Department of Statistics at Korea University. I obtained bachelor's degrees in mathematics and political science in 2010 and a Ph.D. degree in mathematics from Korea University in 2016, under the supervision of Prof. Kyeong-Hun Kim. My early studies are mostly on analytic probability theory and stochastic partial differential equations. After graduation, I worked in the industry, at Samsung Fire and Marine Insurance as a data scientist in 2016-2017, at DeepBio as a research engineer in 2017, and at Kakao Brain as an AI scientist in 2018-2019. I joined as an assistant professor in the Artificial Intelligence Graduate School and the Department of Industrial Engineering at UNIST in 2020-2023.Research Area & CollaborationMy recent research focuses on a Computational Statistics approach to incomplete data problems in Machine Learning (including Deep Learning) from the Trustworthy & Causal AI perspective. I am recently interested in the following topics:Probabilistic Machine Learning: Generative Models (NeurIPS '23, NeurIPS '23, NeurIPS '24)Robust Learning (ICRA '18, CVPR '20, NeurIPS '21, EACL '23)Stochastic OptimizationBandit (NeurIPS '20 , TNNLS '22, NeurIPS `25) & Reinforcement Learning (RSS '20, TR Part C '23)Black-box Optimization (AAAI '20) & AutoML (NeurIPS '19, MICCAI '19)Causal Learning & Machine ReasoningGenerative Model based Causal Reasoning (ACML '17 Machine Learning for AI Platforms Workshop, NeurIPS `25)Large Language Model based Causal Discovery (NeurIPS '24  Causality & Large Models Workshop)AI for Scientific Computing and DiscoveryCollaboration with LG AI Research(Important Notice)현재 고려대학교 인공지능학과 김성웅 교수님과 Artificial General Intelligence Lab 을 공동지도하고 있습니다. 연구실에서는 기계학습 이론 연구를 희망하는 석·박사과정 학생 중 수학, 통계학, 최적화, 알고리즘, 기계학습 및 프로그래밍 적성이 우수한 지원자를 인터뷰를 통해 선발하여 집중적인 연구 지도를 합니다. 연구실 소속 없이 지도교수를 희망하는 통계학과 대학원생 분들은 KUBIG 학회원에 한하여 선발하고 있으니 참고 바랍니다.프로그래밍(C++, Python, Julia), 기계학습 모델링, 고성능 컴퓨팅에 숙달한 소프트웨어 개발자나 박사후 연구원은 기업 협업을 통해 공동연구 프로젝트에 참여할 수 있는 기회를 제공하고 있습니다.Office Hour & Consulting ServiceAMA(Ask Me Anything) 상담을 포함한 개인 면담은 당분간 진행하고 있지 않습니다. Selected PublicationsSee [Google Scholar] for other publications.(new) Quantum Advantages in Ground State Preparation, Combinatorial Optimization, and Quantum State Preparation, 2025 [paper](new) Pareto Optimal Risk-Agnostic Distributional Bandits with Heavy-Tail Rewards, NeurIPS, 2025 [paper](new) Score-informed Neural Operator for Enhancing Ordering-based Causal Discovery, NeurIPS, 2025 [paper](new) ReactionReasoner: Towards Reasoning LLM for Chemical Reaction Prediction, NeurIPS Workshop on AI for Science, 2025 [paper](new) Mol-LLM: Multimodal Generalist LLM with Improved Graph Utilization, NeurIPS Workshop on AI for Science, 2025 [paper]On Incorporating Prior Knowledge Extracted from Pre-trained Language Models into Causal Discovery, NeurIPS Workshop on Causality and Large Models, 2024 [paper]Stochastic Optimal Control for Diffusion Bridges in Function Spaces, NeurIPS, 2024 [paper]Score-based Generative Modeling through Stochastic Evolution Equations in Hilbert Spaces, NeurIPS (Spotlight), 2023 [paper]Score-based Generative Models with Lévy Processes, NeurIPS (Spotlight), 2023 [paper]Neural Bootstrapper, NeurIPS, 2021 [paper] [code]Optimal Algorithms for Stochastic Multi-Armed Bandits with Heavy Tailed Rewards, NeurIPS, 2020 [paper]Task Agnostic Robust Learning on Corrupt Outputs by Correlation-Guided Mixture Density Network, CVPR (Oral), 2020 [video] [paper] [code] Fast AutoAugment, NeurIPS, 2019 [paper] [code]Scalable Neural Architecture Search for 3D Medical Image Segmentation, MICCAI, 2019 [paper]A Sobolev space theory for stochastic partial differential equations with time-fractional derivatives, Ann. Probab., 2019 [paper]An Lq(Lp)-theory for the time fractional evolution equations with variable coefficients, Adv. Math., 2017 [paper]Neural Stain-Style Transfer Learning using GAN for Histopathological Images, ACML Workshop on Machine Learning for AI Platforms, 2017 [paper]NewsOur lab students ranked 2nd on the Global Leaderboard and 1st on the Student Leaderboard at ML4CO NeurIPS 2021 Competition. [Leaderboard] [News]Open SourceAutoCLINT: The Winning Method in AutoCV Challenge 2019, 2020 [paper] [code]torchgpipe: On-the-fly Pipeline Parallelism for Training Giant Models, 2020 [paper] [code]Selected Presentation SlidesCausal Discovery with Generative AI [dropbox] @ DS+ Tutorial Series: AI 시대의 인과추론Advances in Score-based Generative Models [dropbox] @ AI Frontiers Summit, 한국인공지능학회, 신진 통계학자 학술대회Beyond Gaussian: Heavy-Tail Distributions in Machine Learning [dropbox] @ 한국인공지능학회 & NAVER 공동추계학술대회 AI Theory 세션Automated Machine Learning for Visual Domain [dropbox]  @ 한국인공지능학회 동계단기강좌 [link]Causal Learning for AI Research [dropbox] @ 서울과학기술대학교, 고려대학교Advanced Topics [Slide1] [Slide2] @ Principles of Deep Learning (AI502/IE408/IE511)Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5435,
  "method": "requests",
  "crawl_time": "2025-12-01 14:33:58"
}