{
  "name": "Sunita Chauhan",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-sunita-chauhan",
  "status": "success",
  "content": "Dr. Sunita Chauhan | Founding Director, CEPH, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Sunita Chauhan Sunita Chauhan Dean of Research, Plaksha University Professor, Plaksha University PhD, Imperial College London Area of Expertise: Medical and Surgical Robotics Robotics and Automated Systems Select About Research Awards About Sunita Chauhan Dr. Sunita Chauhan has recently joined as Professor and Founding Director - Center for Equitable & Personalized Health at Plaksha University. She serves on the boards of directors and advisory of several organizations/institutions globally. Her work caught international media attention several times and was published in leading newspapers and scientific magazines. Dr. Chauhan has supervised national and internationally-funded research projects and is a sole/principal inventor of several patents granted/pending related to her research. She delivered more than 70 invited talks and participated in various short courses/workshops conducted by local as well as overseas organizations. She is a reviewer of multiple international journals and conferences, and participates actively in their program and organizing committees as specialized session-chair, track-chair, publicity-chair etc. Research Dr. Chauhan's current research interests include: Medical/Surgical Robotics (comprising state of the art surgical assistance technologies such as Computer Assisted and Integrated Surgery (CAS/CIS) systems including safety driven design, development (using both subtractive and additive manufacturing) and intelligent control of novel medical/surgical robotic systems for minimally invasive and non-invasive surgery, Robotic exoskeletons, Intern-replacement, system safety etc.; Surgical training and automated assessment using AI based deep-learning methodologies; Intelligent Diagnostics and Robotics in Infrastructural Healthcare for inspection and proactive maintenance (Railways, Aerospace, Defence, Agriculture, Buildings, Solar farms etc); Sports Eng.- high performance swimming, cycling, archery etc. Awards Dr. Chauhan has been conferred various awards and accolades internationally, notably - IEEE Asia Pacific Most Inspiring Engineer of the Year Award -by IEEE R10 (Asia and Pacific region) for contribution towards advancing technology for humanity through her work on Surgical Robotic Systems for Management of Breast Cancers; ROAR & OASIS fellowship with professional attachments in Europe; the Public-sector Innovation award (TEC -The Entrepreneur Challenge), Prime minister office, SG along with her enterprising students, 2006; Hind Rattan Award (Jewel of India), by NRI Soc., c/o Govt. of India, nominated for Sword of Honor (Pravasi Bhartiya Divas) and Mahatama Gandhi Samman (organized at the House of Commons London), Commonwealth scholarship/Fellowship award to pursue PhD in Robotics & AI by British Council. Research Interests Medical/Surgical Robotics, Biomechatronics Robotics, Mechatronics and AI - in Structural Healthcare, Agriculture, Smart Buildings, Sports Engineering etc. Ultrasound - Imaging & Diagnostics (Medical/Industrial), Therapeutics and Surgical Ultrasound Flexible and Soft Robotics - configuration system development for applications in Industrial and Healthcare systems Intelligent/Smart Systems - Sensing, Monitoring, Manufacturing Past Associations Director, Robotics and Mechatronics Engineering, Monash University, Australia Professor, Dept. of Mechanical and Aerospace Engineering, Monash University, Australia Assoc. Professor (Mechatronics & Design); Asst. Prof. (Systems & Eng. Management), School of Mechanical and Aerospace Engineering, NTU, Singapore Academic, Visiting Fellowships/Roles, Newcastle University, Newcastle upon Tyne, UK, Klinikum Mannheim, Karl Ruprecht Uni. of Heidelberg, Germany, King's College, London, NTU, Singapore Director R&D, Robotics and High Tech Instruments (P) Ltd. Delhi. SRA (CSIR), IIT Delhi, Scientist Fellow, CSIO, RA, National Physical Laboratory, Various other Research and visiting positions, India Education PhD and DIC (Medical Robotics) from Dept. of Mechanical Engineering, Imperial College of Science, Technology and Medicine, London, United Kingdom Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 7467,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:06"
}