{
  "name": "Sunjae Lee",
  "homepage": "https://sites.google.com/view/fclab-skku",
  "status": "success",
  "content": "FCLab @ SKKUSearch this siteEmbedded FilesSkip to main contentSkip to navigationFuture Computing labWelcome to Future Computing Lab!At FC Lab, we explore the future of computing at the intersection of mobile systems, artificial intelligence, and human-computer interaction. Our mission is to design and build next-generation computing technologies that go beyond traditional paradigms and enable more seamless, intelligent, and human-centered digital experiences.Our research focuses on (but not limited to) following areas:Agentic AI Systems: Building AI Agents and their underlying systems that can understand and automate user tasks (e.g., Computer-use agents, Agents for Smart Factory, etc)Mobile Computing: Redesigning mobile systems to support more efficient, intuitive, and intelligent interaction with mobile devices, including smartphones, IoT devices, and wearables.Human-AI-Computer Interaction (HCAI): Rethinking the interface between humans, computers, and AI to support more intuitive and collaborative experiences. NOTICEWe are looking for enthusiastic researchers (B.S., M.S., Ph.D. students)Feel free to contact me (sunjae.lee@skku.edu) NEWS2025Team AutoPhone (FCLAB@SKKU–Fluiz Corp.–MES@Korea Univ.) Wins the Grand Prize at AI Champion Competition! (1/630 Teams) – Press [Oct. 2025] Jeonghyeon Kim joined FCLAB@SKKU[July. 2025] Seungwoo Baek joined FCLAB@SKKU[June. 2025] Our Paper \"VeriSafeAgent: Safeguarding Mobile GUI Agent via Logic-based Action Verification\" got accepted to ACM MobiCom '25[Mar. 2025] FCLab@SKKU launched[Mar. 2025] Sunjae Lee joined Sungkyunkwan University. 2024[Aug. 2024] Our Paper “MobileGPT: Augmenting LLM with Human-like App Memory for Mobile Task Automation” got accepted to ACM MobiCom ‘24.[May. 2024] Our Paper “FLUID-IoT : Flexible and Fine-Grained Access Control in Shared IoT Environments via Multi-user UI Distribution” got accepted to ACM CHI ‘24.2022[July. 2022] Our Paper “A-Mash: Providing Single-App Illusion for Multi-App Use through User-centric UI Mashup” has been accepted to ACM MobiCom ‘22.2021[Aug. 2021] Our Paper “FLUID-XP: Flexible User Interface Distribution for Cross-Platform Experience” has been  accepted to ACM MobiCom ‘21Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2271,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:06"
}