{
  "name": "Sunoo Park",
  "homepage": "https://sunoopark.com",
  "status": "success",
  "content": "Sunoo Park Sunoo Park ▪  Assistant Professor (New York University) ▪  J.D. (Harvard Law School) ▪  Ph.D., Computer Science (MIT) Background. I’m an Assistant Professor in Computer Science at the NYU Courant Institute of Mathematical Sciences, and Affiliated Faculty at the NYU School of Law. I do research in computer science and in technology law and policy, especially related to security, privacy, and transparency in digital technologies. I run the DeTaIL Lab at NYU; you can learn more about my research group at our lab website. I received my J.D. at Harvard Law School, my Ph.D. in computer science at MIT (advised by Shafi Goldwasser), and my B.A. in computer science at the University of Cambridge. I am a licensed attorney in New York State. Guide to Security Research Legal Risks, 2024 Update. In August 2024, Kendra Albert and I released an updated version of our Researcher's Guide to Some Legal Risks of Security Research (alternate archived link), which takes into account the latest legal developments. The Guide is jointly published by the Cyberlaw Clinic at Harvard Law School, the Technology Law & Policy Clinic at the NYU School of Law, and the Electronic Frontier Foundation (EFF). See our Cyberlaw Clinic blog post here. Manuscripts. ▾ How To Think About End-to-End Encryption and AI [ePrint] [arXiv]*Mallory Knodel, Andrés Fábrega, Daniella Ferrari, Jacob Leiken, Betty Li Hou, Derek Yen, Sam de Alfaro, Kyunghyun Cho, and Sunoo ParkSoK: \"Interoperability vs Security\" Arguments: A Technical Framework [arXiv]*Daji Landis, Elettra Bietti, and Sunoo ParkCryptographic Verifiability for Voter Registration Systems [arXiv]*Andrés Fábrega, Jack Cable, Michael Specter, and Sunoo Park Law Review Publications. ▾ The Right to Vote Securely [published pdf]Sunoo ParkIn the University of Colorado Law Review, Spring 2023.Compelled Decryption and the Fifth Amendment: Exploring the Technical Boundaries [SSRN] [published pdf]Aloni Cohen and Sunoo ParkIn the Harvard Journal of Law and Technology (JOLT), Fall 2018 issue. Computer Science Publications. ▾ The Pitfalls of \"Security by Obscurity\" And What They Mean for Transparent AI [arXiv]*Peter Hall, Olivia Mundahl, and Sunoo ParkIn the 39th Annual AAAI Conference on Artificial Intelligence (AAAI 2025).Scan, Shuffle, Rescan: Two-Prover Election Audits [ePrint]Douglas W. Jones, Sunoo Park, Ronald L. Rivest, and Adam SealfonIn the 28th Int'l Conference on Financial Cryptography and Data Security (Financial Crypto 2024).A Systematization of Voter Registration System Security [ePrint] [published pdf]Jack Cable, Andrés Fábrega, Sunoo Park, and Michael SpecterIn the Journal of Cybersecurity (2023).The Superlinearity Problem in Post-Quantum Blockchains [ePrint]Sunoo Park and Nicholas SpoonerIn the 27th Int'l Conference on Financial Cryptography and Data Security (Financial Crypto 2023).Cryptography, Trust, and Privacy: It's ComplicatedEro Balsa, Helen Nissenbaum, and Sunoo ParkIn the 2nd ACM Symposium on Computer Science and Law (CSLAW 2022).KeyForge: Non-Attributable Email from Forward-Forgeable Signatures [ePrint]*Michael Specter, Sunoo Park, and Matthew GreenIn the 30th USENIX Security Symposium (USENIX Security 2021).Going from Bad to Worse: from Internet Voting to Blockchain Voting [published pdf]*Sunoo Park, Michael Specter, Neha Narula, and Ronald L. RivestIn the Journal of Cybersecurity (2021).Fully Deniable Interactive Encryption [ePrint]Ran Canetti, Sunoo Park, and Oxana PoburinnayaIn the 20th Annual Int'l Cryptology Conference (CRYPTO 2020).Data Structures Meet Cryptography: 3SUM with Preprocessing [arXiv]Alexander Golovnev, Siyao Guo, Thibaut Horel, Sunoo Park, and Vinod VaikuntanathanIn the 52nd ACM Symposium on the Theory of Computing (STOC 2020).It Wasn't Me! Repudiability and Unclaimability of Ring Signatures [ePrint]Sunoo Park and Adam SealfonIn the 39th Annual Int'l Cryptology Conference (CRYPTO 2019).How to Subvert Backdoored Encryption: Security Against Adversaries that Decrypt [ePrint]Thibaut Horel, Sunoo Park, Silas Richelson, and Vinod VaikuntanathanIn the 10th Innovations in Theoretical Computer Science conference (ITCS 2019).Static-Memory-Hard Functions and Modeling the Cost of Space vs. Time [ePrint]Thaddeus Dryja, Quanquan C. Liu, and Sunoo ParkIn the 16th IACR Theory of Cryptography Conference (TCC 2018).Practical Accountability of Secret Processes [ePrint]*Jonathan Frankle, Sunoo Park, Daniel Shaar, Shafi Goldwasser, and Daniel J. WeitznerIn the 27th USENIX Security Symposium (USENIX Security 2018).Proactive Secure Multiparty Computation with a Dishonest MajorityKarim Eldefrawy, Rafail Ostrovsky, Sunoo Park, and Moti YungIn the 11th Conference on Security and Cryptography for Networks (SCN 2018).SpaceMint: A Cryptocurrency Based on Proofs of Space [pdf] [ePrint]*Sunoo Park, Albert Kwon, Georg Fuchsbauer, Peter Gaži, Joël Alwen, and Krzysztof PietrzakIn the 22nd Int'l Conference on Financial Cryptography and Data Security (Financial Crypto 2018).Public Accountability vs. Secret Laws: Can They Coexist? [ePrint]Shafi Goldwasser and Sunoo ParkIn the 16th Workshop on Privacy in the Electronic Society (WPES) at CCS 2017.Towards Secure Quadratic Voting [pdf] [ePrint]Sunoo Park and Ronald L. RivestIn Public Choice 2017.How to Incentivize Data-Driven Collaboration Among Competing Parties [pdf] [ePrint] [arXiv]Pablo Daniel Azar, Shafi Goldwasser, and Sunoo ParkIn the 7th Innovations in Theoretical Computer Science Conference (ITCS 2016).Adaptively Secure Coin-Flipping, Revisited [pdf] [ePrint] [arXiv]Shafi Goldwasser, Yael Tauman Kalai, and Sunoo ParkIn the 42nd Int'l Colloquium on Automata, Languages, and Programming (ICALP 2015).Cryptographically Blinded Games: Leveraging Players' Limitations for Equilibria and Profit [pdf] [arXiv]Pavel Hubáček and Sunoo ParkIn the 15th ACM Conference on Economics and Computation (EC 2014). NB: In computer science, conferences and symposia are peer reviewed, and they are the primary publication outlets. In law, journals and law reviews are the primary publication outlets. Authors are listed alphabetically by last name, except where indicated by an asterisk. Teaching. ▾ In spring 2024, I taught a new course, Digital Technology Law, at the NYU School of Law. In fall 2023, I taught: in the Technology Law and Policy Clinic at the NYU School of Law (with Jason Schultz, Esha Bhandari, Jake Karr, and Melodi Dincer), where we do pro bono legal work on technology matters working with law students, and a graduate seminar on AI: Challenges in Law, Policy, and Ethics (co-organized with Kyunghyun Cho), based at the Courant Institute and aimed at computer-science and data-science students. Service. ▾ I am a member of the New York City Bar Association’s Task Force on Digital Technologies, in the Subcommittee on Generative Artificial Intelligence and the Law. My Program Committee service includes: IACR Real World Cryptography (RWC) 2025 ACM Symposium on Computer Science & Law (CSLAW) 2022, 2024, & 2025 Symposium on the Foundations of Responsible Computing (FORC) 2025 IEEE Security and Privacy (“Oakland”) 2022 & 2023 IEEE Security and Privacy (“Oakland”) 2022 & 2023 — Research Ethics Committee Neural Information Processing Systems (NeurIPS) 2022 & 2023 — Research Ethics Committee ACM Conference on Fairness, Accountability, and Transparency (FAccT) 2021 Journal of Cryptoeconomic Systems 2020 IACR Theory of Cryptography Conference (TCC) 2020 In the past, I co-organized a Workshop on Encryption, Surveillance, and Transparency at Johns Hopkins University in August 2018, in collaboration with Matt Green and Mike Specter. Interested in working with me? ▾ Thank you for your interest! I really appreciate it. I am not able to reply to all emails I receive from prospective Ph.D. students, due to volume of email. If you’re thinking about emailing me because you’re interested in being my Ph.D. student at NYU Courant, and we don’t already know each other, please fill out this contact form instead of emailing me. This helps me keep your info organized. (Important: the link is just a form to contact me personally; it’s not a formal application to do a Ph.D. To apply for the Ph.D. program at NYU Courant, you must submit an application to NYU GSAS directly.) If you’re interested in working with me in some other capacity (such as a postdoc, postgraduate law fellowship, J.S.D., or law student RA) then please email me and circle back once if I haven’t replied after two weeks. I appreciate your patience with my inbox, and your interest in working with me. Contact. sunoo·park at nyu·edu (PGP key / fingerprint) 60 Fifth Avenue, Room 316, New York, NY 10011, USA",
  "content_length": 8661,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:07"
}