{
  "name": "Suparna De",
  "homepage": "https://www.surrey.ac.uk/people/suparna-de",
  "status": "success",
  "content": "Dr Suparna De | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Google Scholar LinkedIn Twitter Dr Suparna De Senior Lecturer in Computer Science Ph.D, MSc (distinction), B.Sc. (honours), FHEA Book a meeting during term time04 BB 02Academic and research departments Surrey Institute for People-Centred Artificial Intelligence (PAI), School of Computer Science and Electronic Engineering. AboutBiographySuparna De is a Senior Lecturer in Computer Science, a Surrey AI Fellow in the Surrey Institute for People-Centred AI and an Honorary Senior Research Fellow in the Social Research Institute at UCL, UK. She is also a visiting lecturer at the Research Center for Information and Communications Technologies (CITIC), University of Granada, Spain.She is a member of the Nature Inspired Computing and Engineering (NICE) research group. She serves on the editorial board of Nature Scientific Reports (Computational Science division) and Elsevier High-Confidence Computing journals. She completed her Ph.D. and MSc. (with distinction) degrees at the Dept. of Electronic Engineering from the University of Surrey. Expand biography Areas of specialism Natural language understanding for longitudinal data; Computational Social Science; Semantic sensor search and modelling; IoT Big Data analysis University roles and responsibilities Computer Science Admissions Tutor (UG)Affiliations and memberships IEEE Member IEEE Standards Association: P3800 WG Working Group member of the IEEE P3800 - Standard for a Data-Trading System ACM Invited MemberAcademic networks Google Scholar ResearchGateNews 05 JUN 2025Five reasons to study computer science at Surrey In the media 23 February 2022 Dr Suparna De joins the CLOSER team ResearchResearch interestsSuparna's research interests are in natural language processing (NLP) and graph networks, that she applies to the domains of computational social science, including NLP for longitudinal text (derived from social networks and social science/biomedical datasets), graph modelling and construction to complex longitudinal population studies and community networks.Her current work focusses on researching machine comprehension and information extraction for longitudinal text, applied to metadata extraction and uplift for social science questionnaires, and adaptive privacy-preserving models for online social networks.Previous work has included research in Big Data analytics, visualisation and data fusion techniques for understanding city dynamics from multimodal spatio-temporal data. Expand research interests Research projects Metadata Uplift In Longitudinal Population Studies (Provenance, Discovery And Disclosure)EPSRC-funded, £403k, October 2025 - March 2026This inter-disciplinary collaboration between CS (Surrey) and social scientists (UCL, UKDS, ScotCen) aims to retrieve metadata from social survey questionnaires to increase both volume and interoperability of these data sources to enhance discovery and create a FAIR enabled RDF store / knowledge graph to store and make accessible the metadata generated for use by AI technologies. This metadata will enable knowledge enhancement through concept extraction and classification into standard vocabularies which are supported and used by the social science, health and statistical community METACURATE-ML - Extraction and Utilisation of Metadata from Non-machine-actionable Documents to Improve Data Curation and Discovery ESRC-funded, (Surrey) Principal-Investigator (PI), April 2024 - September 2025.Grant ref: ES/Z502935/1, £757kThis project is a multi-disciplinary collaboration between social survey specialists, survey data curators/archivists and computer scientists, with partners from the University of Surrey, CLOSER, UCL, ScotCen and the UK Data Archive (UKDA) at the University of Essex. This project aims to develop novel ML models tailored to the specific challenges of semantically rich survey data collection and research datasets. The project is aimed at the alignment of both structural (standards) and semantic metadata (controlled vocabularies and conceptual frameworks), where the output from the developed ML models will be used to create metadata resources. These metadata resources, realised as knowledge graphs of the questionnaire items, will extend recent advances in text-layout ML models. Additionally, the project contributes to enabling automated risk disclosure assessments in large UKDA datasets by developing novel algorithms for question text equivalence, addressing the challenge of semantic shifts in large longitudinal studies. The project meets the evolving needs of researchers from a range of disciplines who utilise longitudinal population survey (LPS) and other survey data. AP4L (Adaptive PETs to Protect & emPower People during Life Transitions) EPSRC-funded, Co-Investigator (Co-I), April 2022 - March 2025.This three-year, £3.4 million project will produce Privacy-Enhancing Technologies (PETs) to support the online privacy and safety of people navigating significant life transitions. The researchers on the project are comprised of a multi-disciplinary team of experts in Cybersecurity, Psychology, Law, Business, and Criminology from the Universities of Cambridge, Edge Hill, Edinburgh, Queen Mary University of London, Strathclyde and Surrey. KTP - Predictive Maintenance for Rail InfrastructureInnovateUK-funded, Co-Principal Investigator (PI) and Academic Lead, August 2023 - Jan 2026. Grant number: 10054741This 30-month, £212k Knowledge Transfer partnership (KTP) grant, funded by Innovate UK, will develop novel machine learning algorithms and models for a cloud-based predictive maintenance platform that also enables real-time monitoring and risk prediction of IoT multi-sensors that sense critical parts of the rail infrastructure (i.e. tracks, bridges, structures supporting overhead lines). Understanding the multiple dimensions of prediction of concepts in social and biomedical science questionnairesScience and Technology Facilities (STFC) DiRAC-funded, PI, Oct. '21 - March '22. Part of Grant Number: ST/S003916/1This grant is a collaboration with CLOSER (Cohort and Longitudinal Studies Enhancement Resources), UCL, and RITS (Research IT Services), UCL. The project investigates various dimensions of concept prediction: against a range of different types of unseen data from UK Data Archive's longitudinal studies, e.g. social science vs biomedical, 1995 vs 2015; and to build up an understanding of different predictions rate by category. Hierarchical approaches for topic classification against the European Language Social Science Thesaurus (ELSST) thesaurus were developed. Automating capturing structured content from questionnaires ESRC-funded, PI, Feb. 2021 - Feb. 2022.Total funding amount: £81,500. Part of Grant Number: ES/K000357/1This grant is a collaboration with CLOSER, UCL. The project investigates automated capture of metadata from the CLOSER longitudinal population studies. Automation of question extraction from paper questionnaires will form part of a pipeline to populate question banks and other metadata repositories and provide a low cost solution to the manual processes undertaken as part of the CLOSER project and UKDA (and other archives) to enhance survey metadata alongside the data description. Machine learning to enhance metadata in cohort studies Science and Technology Facilities (STFC) DiRAC-funded, PI, Feb. - Dec. 2021. Part of Grant Number: ST/S003916/1.This grant is a collaboration with CLOSER, UCL, and RITS, UCL. The project will utilise the questions and linked concepts (based on the European Language Social Science Thesaurus (ELSST)) held in CLOSER Discovery. The aim is to create a model that will be able to classify existing questions (and predict from new questions) to these existing concepts in ELSST. TagItSmart TagItSmart (2015-18) is a Smart Tags driven service platform for enabling ecosystems of connected objects that dynamically change their status in response to a variety of environmental factors and be seamlessly tracked during their lifecycle. TagItSmart is developing smart tags that combine the power of functional inks with the pervasiveness of digital and electronic markers, e.g. dynamic QR codes, NFC tags, in order to capture new contextual information. Beside this, the ubiquitous presence of smartphones with their cameras and NFC readers facilitates seamless observation measurements and lifecycle tracking of smart tag big data.I design and develop semantic models and reasoning algorithms for capturing the characteristics of the Smart Tags and to provide decision-support mechanisms for connecting their lifecycle data to semantically-e",
  "content_length": 76885,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:10"
}