{
  "name": "Suprio Ray",
  "homepage": "http://www.cs.unb.ca/~sray",
  "status": "success",
  "content": "Homepage of Suprio Ray [ About me | Research | Teaching | Publications | Awards | Talks ] Suprio Ray Ph. D. (Univ. of Toronto), M.Sc (Univ. of British Columbia), B. E. (NIT) Professor Faculty of Computer Science University of New Brunswick Fredericton, Canada Email: sray at unb dot ca Phone: 7280 Office: GE117 ABOUT ME I am a Professor at the Faculty of Computer Science, University of New Brunswick, Fredericton. I lead the Big Data Systems and Analytics Lab. I received my Ph.D. from the Computer Science Department, University of Toronto. I obtained an M.Sc. (Computer Science) from University of British Columbia and a Bachelor of Engineering (Computer Science and Engineering) from NIT, Trichy. Previously, I worked for a number of years as a software engineer, in companies including, Oracle, Lucent Technologies (Bell Labs), and Webtech Wireless. I also did a PhD research internship at SAP. A detailed CV can be provided on request. RESEARCH I am interested in various aspects of Big Data management, including the management of spatial and spatio-temporal data, as well as, various analytical workloads. I explore how to build scalable data science systems and develop novel approaches for query processing and analytics. I am a member of CASA and an associate member of CIC. Besides FCS, I also collaborate with researchers from ECE, GGE and other departments. I am grateful to NBIF, NSERC, ACOA, Mitacs and other Govt. and industry partners for supporting my research. My current research interests include: - Big Data and database systems - Scalable data science - Spatial and spatio-temporal data processing - Query processing on modern hardware - Privacy, security and provenance in database systems; Blockchain data management - Parallel and distributed systems, and Cloud computing If you are interested in any of these research areas, please feel free to contact me. I am particularly looking for potential graduate students who have strong programming and software implementation skills. Previous research experience or work experience in the software industry is a plus. PhD students usually receive full funding. Current projects Project Summary Scalable Data Science and Advanced Analytics The volume and velocity of data generated from a variety of sources are far outpacing the available storage and processing capacity â the term Big Data is used to signify this. Data science enables one to bring structure to large quantities of data and make analysis possible. However, existing data systems are not able the meet the computational challenges of Data Science applications. The goal of the research is to devise new approaches to data processing that can support analysis on data at massive scales. • Presently, data scientists use different frameworks and systems. To evaluate and compare their performance, we have developed a data science benchmark, called Sanzu, which is accessible here. • Increasingly, data scientists utilize interactive data analysis environments like Jupyter Notebook and RStudio. However, they must spend substantial time learning the libraries and their programming interfaces. To address this we propose, PySnippet, an automatic code snippet feature for Jupyter Notebook. • We recently developed DaskDB, a scalable data science system to support data analytics and in situ query processing. Data Management on Modern Hardware We are looking into query processing in the changing landscape of modern hardware. The advent of multi-core processors, along with the ever growing main memory, has fundamentally changed how Big Data is processed. In this research, we are exploring how to exploit the growing memory, core count and GP-GPUs in the context of in-memory databases. • Join is one of the most expensive database operations. We demonstrated that in-memory hash joins are acutely affected by dataset skew and we proposed a solution for this. •\tAggregation is a critical operation in data analytics. We conducted a six dimensional analysis of in-memory aggregation. Our results show that the ideal approach in a given situation depends on the input and the workload. • Modern computers increasingly rely on NUMA architectures to achieve scalability. However, many existing software solutions are not aware of the underlying NUMA topology and thus do not take full advantage of the hardware. In a recent work, we demonstrate how to accelerate memory-intensive data analytics workloads on NUMA systems. We have alo explored NUMA-aware query processing in the context of spatial join and spatio-textual similarity join. Scalable Spatio-temporal Data Systems With the rapid rise in the volume and variety of spatial data, âspatial analyticsâ is no longer just a niche in scientific organizations and academia. The popularity of on-line services are also contributing to the growth of spatial analysis applications. • We developed Niharika, a spatial data analysis system for the Cloud. Previously we introduced a spatial database benchmark called Jackpine, which can be accessed here. Recently, we have proposed a benchmark to evaluate big spatial data systems. • Spatial join is a compute-intensive operation. We developed a parallel in-memory spatial query execution system called  SPINOJA. • With the proliferation of GPS-enabled mobile devices and sensors, Location-Based Services (LBS) have become pervasive in our society. We developed an in-memory spatio-temporal index PASTIS that supports order of magnitude better update throughput than the state-of-the-art, while supporting thousands of concurrent historical, present and predictive spatio-temporal range queries. Rich Geo-spatial Query Processing With the growing data volume and popularity of Web services and Location-Based Services (LBS) new spatio-textual applications are emerging. These applications are contributing to a deluge of geo-tagged data. Increasingly, this data integrates multiple types of data, such as, textual data, location data, social information, scientific measurements and multimedia data. This \"enriched\" geo-referenced data offers significant potential for knowledge discovery. • We are exploring efficient processing\tof novel spatio-textual queries. We have proposed dynamically ranked top-k spatial keyword search and ways to improve its parallel performance. • Presently, different indexes exist to deal with spatial, spatio-temporal, spatio-textual and temporal-textual data. We introduced a generalized, multi-dimensional index called STILT, which unifies spatial, textual, and temporal components within a single structure. It can support queries with any combination of dimensions involving location, time and text. Data privacy and security With the rising data volume, companies are increasingly using the Cloud to stage and process their data. In future, Edge computing is expected to offer new opportunities and challenges for query processing and data analytics. • Cloud and Edge computing comes with the challenges of privacy and information security. In this project we are interested in addressing the question of how to support privacy-conscious efficient query execution in the Cloud. Recently we developed a system, Pystin, to enable privacy-preserving top-k spatial-textual query processing. Blockchain data management • Blockchain is heralded as a transformational technology. We proposed a scalable privacy-preserving blockchain query processing system over Ethereum. • Modern Blockchain systems with smart contract support are continuing to be adopted rapidly. As the size and complexity of smart contract applications increases, it becomes increasingly important to efficiently manage the system's historic execution information to enable efficient analysis. We proposed a system that enables to efficiently manage historic information of smart contracts calls. Past projects As part of my MSc thesis, I developed a realistic mobility model generator called GEMM. TEACHING CS6999/CS4999 Directed Studies and CS4997 Honours Thesis:  please contact me for exciting projects. Course Id Title Semester taught CS2545 Data Science for Big Data Analysis Fall 2016, Fall 2017, Fall 2018, Fall 2019, Fall 2020, Fall 2021, Winter 2024 CS4545/CS6545 Big Data Systems Winter 2016, Winter 2017, Winter 2018, Winter 2019, Winter 2020, Winter 2021, Fall 2021, Winter 2022, Winter 2024 CS3543 Database Systems and Administration Winter 2021, Fall 2023 INFO3403 Information System Administration Winter 2017, Winter 2018, Winter 2019 CS6585 Database Foundations Fall 2016 INFO1103 Data and Information Management Fall 2015, Winter 2016 PUBLICATIONS  [ Google scholar ] Conferences and Journals Elyes Lounissi, Suvam Das, Ronnit Peter, Xiaozheng Zhang, Suprio Ray, Lianyin Jia. FunDa: scalable serverless data analytics and in situ query processing. Journal of Big Data, 2025    [pdf] Geetesh More, Suprio Ray, Kenneth B. Kent. Accelerating Learned Join with FPGAs in Relational Databases. International Symposium on Highly Efficient Accelerators and Reconfigurable Technologies (HEART), 2025  Best paper award.    [pdf] Lianyin Jia, Shiqi Luo, Jiaman Ding, Suprio Ray, Mengjuan Li, Xiuxing Li. A Length Enhanced B+ tree based index for Efficient Set Similarity Query. IEEE ICDE, 2025 Ralf Hartmut Güting, Suvam Kumar Das, Fabio Valdés, Suprio Ray. Exact Trajectory Similarity Search With N-tree: An Efficient Metric Index for kNN and Range Queries. ACM Transactions on Spatial Algorithms and Systems, 2025  [pdf] Mohammadmasoud Shabanijou, Vidit Sharma, Suprio Ray, Ronxing Lu, Pulei Xiong. Large Language Model Empowered Spatio-Visual Queries for Extended Reality Environments. IEEE International Workshop on Big Spatial Data (BSD), held in conjunction with IEEE BigData, 2024  [pdf] Rahul Sahni, Xiaozheng Zhang, Sudip Chatterjee and Suprio Ray. Scalable Big Spatial Data Processing with SQL Query Compilation and Distributed Morsel-driven Parallelism. IEEE BigData, 2024  [pdf] Erfan Ghiasvand, Suprio Ray, Shahrear Iqbal, Sajjad Dadkhah,",
  "content_length": 35434,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:11"
}