{
  "name": "Suprakash Datta",
  "homepage": "http://www.cse.yorku.ca/~datta",
  "status": "success",
  "content": "Suprakash Datta's homepage Suprakash Datta's homepage Contact Information Suprakash Datta CSEB 3043 Computer Science and Engineering Department York University 4700 Keele Street Toronto, ON M3J 1P3 Phone: (416) 736-2100 ext 77875 Fax: (416) 736-5872 Email: [my last name][at]cs.yorku.ca Education: B.Tech (E&ECE), IIT, Kharagpur, India, M.Tech (CSE), IIT, Kharagpur, India, Ph.D. (CS), University of Massachusetts at Amherst, USA . Research Interests: My research revolves around understanding different aspects of communication in parallel and distributed systems. I am interested in computer networks and parallel computing. Very recently, I have become very interested in several aspects of Bioinformatics. An old research page that is no longer updated but contains resources useful for students is here. Publications A list of my publications is available here. Teaching: Current courses: CSE 2001 Past Undergraduate courses : CSE 4482 (Fall 11), Math/CSE 1560 (Winter '11) CSE 1019 (winter '07, fall '11), CSE 2001 (winter '06, Summer '07), COSC 3101 (summer '03, summer '04, fall '05, Summer '07, Summer, '10), COSC 3212 (winter '01), COSC 3213 (fall '01, winter '02 [two sections], winter 03), COSC 4213 (fall '03, winter '05, winter '06, fall '07, winter '07), COSC 4201 (winter 03), CSE 4215 (Winter '10, Winter '11). Past Graduate courses : COSC 6501 (winter 02), COSC 6590 (fall '03), COSC 6002 (fall '05), CSE 5290 (Fall 09, Fall 11), CSE 5431 (Winter 10). Teaching evaluations : 2003-07. Student feedback (non-numeric): please see pg2 of this document . Past and current students: Past M.Sc. students: Haoyuan Wang (M.Sc., August 2004) Co-supervised with Professor Amir Asif. Masoomeh Rudafshani (M.Sc., June 2006). Kashif Ali (M.Sc., July 2006) Co-supervised with Professor Mokhtar Aboelaze. Bohdan Krushelnytskyy, (M.Sc., February 2008) Md. Tareq Adnan - M.Sc. (September 2012) Wendy Ashlock (Ph.D. August 2013), Stuart Maclean (Ph.D. June 2013) Past undergraduate students (4080 projects): Kashif Ali: Distributed computing environment for a network of workstations (Fall 2001) Vijay Dheap: Experiments for Computer Network courses (Winter 2002) Hui Wang: The dynamics of the propagation of computer viruses and other malware (Summer 2003) Bahman Eksiri: Energy-efficient routing in sensor networks (Summer 2004) Maryah Safi: Change detection in sensor networks for oceanic monitoring - cosupervised with Professor Amir Asif (Winter 2005) Chris Klinowski: Localization in sensor networks (Summer 2005) Shaker Khaleque: Localization in mobile sensor networks (Fall 2005) Israel Kochman: Improved exon detection using Fourier spectra (Fall 2005) Enrico Bianco: Time synchronization in sensor networks (Fall 2006). Payal Bhatia: Genome identification from a DNA sequence - co-supervised with Professor Amir Asif (Winter 2007) Arsalan Bahojb: Imputation of Microarray Data (Fall 2009) Mohamad Alsabbagh: Detection of Tandem repeats in Genomic data (Winter 2010) Roozbeh Takhayorie: Visualization of high-dimensional clusters (Winter 2010) Stephen Leong : Range-based localization in wireless sensor networks (Fall 2010). Michael Larin: Imputation of missing values in microarray data (Summer 2011). Osman Arfeen: Localizing nodes in wireless ad hoc networks securely (Summer 2012) Herman Badwal : Detecting Nested Tandem Repeats in DNA sequences (Fall 2013) Past undergraduate students (NSERC USRA): Zhilin Su (2001) Hassan Massoom (2005) - cosupervised with Professor A. Asif and Professor G. Wu Alexandr Bezginov (2006). Stephen Leong (2010). Current students: PhD: Albina Rahim MSc: Kowsar Hossain - cosupervised with Professor J. Edmonds BSc: Rostislav Kitsis Other professional activities: I am a coach of the ACM Programming Contest teams at York. Please see this page if you want more information on this.",
  "content_length": 3825,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:10"
}