{
  "name": "Supreeth Shastri",
  "homepage": "https://facultyinfo.unt.edu/faculty-profile?profile=ss4875",
  "status": "success",
  "content": "Faculty Profile | Faculty Information System Skip to main content Faculty Name Search By: Faculty Name Courses Search Supreeth Shastri Title: Assistant Professor Department: Computer Science and Engineering College: College of Engineering Discovery Park Building F246 supreeth.shastri@unt.edu Lawful Computing Lab General Information Previous Courses Publications Research Curriculum Vitae Curriculum Vitae Link Education PhD, University of Massachusetts Amherst, 2018 Major: Electrical and Computer Engineering MS, Columbia University, 2009 Major: Computer Science MS, Columbia University, 2008 Major: Electrical Engineering Current Scheduled Teaching CSCE 3530.002Introduction to Computer NetworksSpring 2026 CSCE 6940.879Individual ResearchFall 2025 CSCE 3530.002Introduction to Computer NetworksFall 2025 Syllabus CSCE 6900.879Special ProblemsFall 2025 Texas Education Code 51.974 (HB 2504) requires each institution of higher education to make available to the public, a syllabus for undergraduate lecture courses offered for credit by the institution. Previous Scheduled Teaching CSCE 6940.879Individual ResearchSummer 10W 2025 CSCE 6940.979Individual ResearchSpring 2025 CSCE 3530.001Introduction to Computer NetworksSpring 2025 Syllabus SPOT CSCE 5934.879Directed StudyFall 2024 CSCE 3530.003Introduction to Computer NetworksFall 2024 Syllabus SPOT Texas Education Code 51.974 (HB 2504) requires each institution of higher education to make available to the public, a syllabus for undergraduate lecture courses offered for credit by the institution. Published Intellectual Contributions Conference Proceeding Shastri, S., Irwin, D. (2018). Cloud Index Tracking: Enabling Predictable Costs in Cloud Spot Markets. ACM Symposium on Cloud Computing (SoCC 2018). Shastri, S., Irwin, D. (2017). HotSpot: Automated Server Hopping in Cloud Spot Markets. ACM Symposium on Cloud Computing (SoCC 2017). Shastri, S., Rizk, A., Irwin, D. (2016). Transient Guarantees: Maximizing the Value of Idle Cloud Capacity. SC16: International Conference for High Performance Computing, Networking, Storage and Analysis. Shastri, S., Guo, T., Sharma, P., Irwin, D., Shenoy, P. (2015). SpotOn: A Batch Computing Service for the Spot Market. ACM Symposium on Cloud Computing (SoCC 2015). Journal Article Sun, C., Jacobs, E., Lehmann, D., Crouse, A., Shastri, S. (2023). GDPRxiv: Establishing the State of the Art in GDPR Enforcement. Other. 2023 (4) 484-499. Privacy Enhancing Technologies Symposium Advisory Board. https://doi.org/10.56553/popets-2023-0121 Shastri, S., Wasserman, M., Chidambaram, V. (2021). GDPR anti-patterns. Communications of the ACM. 64 (2) 59-65. Shastri, S., Banakar, V., Wasserman, M., Kumar, A., Chidambaram, V. (2020). Understanding and benchmarking the impact of GDPR on database systems. Proceedings of the VLDB Endowment. 13 (7) 1064-1077. , OverallSummative Rating Challenge andEngagement Index Response Rate out of 5 out of 7 % of students responded Overall Summative Rating (median): This rating represents the combined responses of students to the four global summative items and is presented to provide an overall index of the class’s quality. Overall summative statements include the following (response options include a Likert scale ranging from 5 = Excellent, 3 = Good, and 1= Very poor): The course as a whole was The course content was The instructor’s contribution to the course was The instructor’s effectiveness in teaching the subject matter was Challenge and Engagement Index: This rating combines student responses to several SPOT items relating to how academically challenging students found the course to be and how engaged they were. Challenge and Engagement Index items include the following (response options include a Likert scale ranging from 7 = Much higher, 4 = Average, and 1 = Much lower): Do you expect your grade in this course to be The intellectual challenge presented was The amount of effort you put into this course was The amount of effort to succeed in this course was Your involvement in course (doing assignments, attending classes, etc.) was CLOSE",
  "content_length": 4100,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:10"
}