{
  "name": "Suraiya Pervin",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1761",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Suraiya Pervin (Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. communication Engg Indian institute of Technology India 2001 Masters Applied Physics & Electronics University of Dhaka Bangladesh 1990 Bachelor Applied Physics & Electronics University of Dhaka Bangladesh 1989 Title Organization Location From Date To Date Professor University of Dhaka Dhaka 25, Jun 2007 Currently Working Associate Professor University of Dhaka Dhaka 06, Jan 2003 24-06-2007 Assistant Professor University of Dhaka Dhaka 29, Dec 2001 05-01-2003 Lecturer University Of Dhaka Dhaka 06, Dec 1994 28-12-2001 Research Interest Subject Description Research Interest (Goal, Target Indicator) Digital Signal Processing Natural Language Processing Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Ph.D. A New Approach of Bangla News Document Summarization Dr. Suraiya Pervin Dr. Zerina Begum Md. Majharul Haque 2018 Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found Journal Article 1 M. M. Haque, Suraiya Pervin and Zerina Begum : An Innovative Approach of Bangla text summarization by introducing pronoun replacement and improved sentence ranking, Journal of Information Processing Systems , vol.13 , no.4 , 2017 . 2 Anna Fariha, C. F. Ahmed, C. K. Leung, Md. Samiullah and Suraiya Pervin : A new framework for mining frequent interaction patterns gor meeting databases, Engineering Applications of Artificial Intelligence , vol.45 , pp.103-118 , 2015 . 3 M Haque, Suraiya Pervin and Zerina Begum : Literature review of automatic multiple documents text summarization, International Journal of Innovation and Applied Studies , vol.3 , no.1 , pp.121-129 , 2013 . 4 M. M. Haque, Suraiya Pervin and Zerina Begum : Literature review of automatic single documents text summarization using NLP, International Journal of Innovation and Applied Studies , vol.3 , no.3 , pp.857-865 , 2013 . 5 Imran Ahmed, S. Sadeque and Suraiya Pervin : Margin adaptivre resource allocation for multiuser OFDM systems by particle swarm optimization and differential evolution, International Journal of Engineering And Technology , 2011 . 6 Suraiya Pervin and Subrata Kr. Aditya : A Pipelined Architecture for Computing Eigenvectors, Dhaka University Journal of Science , vol.56 , no.1 , pp.17-22 , 2008 . 7 Suraiya Pervin : A Hyperbolic Formulation of the LMS Algorithm., The Dhaka University Journal of Science. , vol.55 , no.1 , pp.71-74 , 2007 . 8 Suraiya Pervin, and Subta Kr. Aditya : A Pipelined Architecture to Compute Eigenvalues of Data Covariance Matrix., The Dhaka University Journal of Science. , vol.55 , no.1 , pp.75-79 , 2007 . 9 Meher Nigar, Md. Mahmudul Hasan, Rashed Mazumder and Suraiya Pervin : Computation of DFT using CORDIC algorithm., The Journal of the Bangladesh Electronics Society. 6(2): 33-40 (2006) , vol.6 , no.2 , pp.33-40 , 2006 . 10 Suraiya Pervin and Subrata Kumar Aditya : Cordic Realization of the Karhunen-Loeve Transform Based LMS Adaptive Equalizer., The Dhaka University Journal of Science. , vol.54 , no.1 , pp.39-42 , 2006 . 11 Suraiya Pervin and Subrata Kr. Aditya : An Area Efficient Adaptive Equalizer., Journal of Bangladesh Electronics Society. , vol.5 , no.2 , pp.45-50 , 2005 . 12 Suraiya Pervin and Subrata Kr. Aditya : A Cordic Realization of the Complex LMS Based Adaptive Equalizer., The Dhaka University Journal of Science. , vol.53 , no.2 , pp.25-32 , 2005 . 13 M. Shamim Kaiser, Suraiya Pervin, S. K. Aditya and R. K. Mazumder : A Predictive Digital Filter based Zero Crossing Detection Technique for PV Inverter., Journal of Bangladesh Electronics Society. , vol.5 , no.1 , pp.127-130 , 2005 . 14 Suraiya Pervin, Taslim Taher and Tariqul Islam : CORDIC Realization of the ADFE., Journal of Bangladesh Electronics Society. , vol.5 , no.1 , pp.49-54 , 2005 . 15 Suraiya Pervin,, Kaniz Fatema and Nasrin Akhter : A Time Efficient Architecture for the CTLMS based Adaptive Equalizer., Journal of Bangladesh Electronics Society , vol.5 , no.1 , pp.9-16 , 2005 . 16 Suraiya Pervin and Subrata K. Aditya : A Latency Free Pipelined Architecture of VSLMS based Equalizer, The Dhaka University Journal of Science. 52(3): 309-316 , vol.52 , no.3 , pp.309-316 , 2004 . 17 S. K. Aditya, D. Das and Suraiya Pervin : Load Frequency Controller Design of Multi-Turbine Generator System Using Genetic Algorithm., Journal of Bangladesh Electronics Society. , vol.4 , no.1 , pp.34-39 , 2004 . 18 Suraiya Pervin and Subrata Kumar Aditya : A Real Time Architecture for KLT Based Adaptive Equalizer., The Dhaka University Journal of Science. , vol.52 , no.2 , pp.207-213 , 2004 . 19 Suraiya Pervin and M. Chakroborty : Pipelining the Adaptive Decision Feedback Equalizer., International Journal of Signal Processing, Elseviar. 83: 2675–2681 (2003) , vol.83 , pp.2675-2681 , 2003 . 20 Suraiya Pervin and Subrata Kumar Aditya : A Very High Throughput Architecture for the Trigonometric LMS Based Adaptive Equalizer, The Dhaka University Journal of Science. , vol.51 , no.2 , pp.221-226 , 2003 . 21 Suraiya Pervin and Subrata Kumar Aditya : A Hardware Efficient Systolic Architecture for Adaptive Decision Feedback Equalizer., The Dhaka University Journal of Science. , vol.51 , no.1 , pp.117-125 , 2003 . 22 Suraiya Pervin and S. K. Aditya : A Pipelined Architecture for Updating Normalized Covariance Matrix in Real Time Signal Processing., The Dhaka University Journal of Science. , vol.51 , no.1 , pp.109-115 , 2003 . 23 Suraiya Pervin, and M. Chakroborty : A Systolic Array Realization of the Adaptive Decision Feedback Equalizer., International Journal of Signal Processing, Elseviar. , vol.80 , pp.2633-2640 , 2000 . 24 Suraiya Pervin, S. K. Ghafoor, M. Lutfor Rahman and Farruk Ahmed : Design of a Microprocessor Based Function Generator., The Dhaka University Journal of Science. , vol.44 , no.2 , pp.235-242 , 1996 . Conference Proceedings 1 M. M. Haque, Suraiya Pervin and Zerina Begum \"Enhancement of keyphrase based approach of automatic Bangla text summarizartion.\" IEEE Region 10 conference Singapore: 2016 . 2 M. M. Haque, Suraiya Pervin and Zerina Begum \"Automatic Bengali news documents summarization by introducing sentence frequency and clustering.\" 18th International Conference on computers and information technology , pp. 156-160. Dhaka: 2015 . 3 Imran Ahmed, Sonia Sadeque and Suraiya Pervin \"Margin adaptive resource allocation for multiuser OFDM systems by modified particle swarm optimization and differential evolution.\" 21st International Conference of Electrical communications and Computers, ieeexplore.ieee.org , pp. 227-231. USA: 2011 . 4 A. Hossain, M. L. Rahman, F. Ahmed and Suraiya Pervin \"New Approach to Automatic Segmentation of Bangla Speech..\" 1st International Conference on Computer Processing of Bangla (ICCPB). 2006 . 5 S. M. Khaled, A. K. Biswas, M. L. Rahman and Suraiya Pervin \"An Analysis on Human Resource Development in the ICT Sector of Bangladesh..\" International Conference on Computer and Information Technology (ICCIT 2005). Dhaka: 2005 . 6 Suraiya Pervin and Subrata Kr. Aditya \"A Pipelined Architecture for Computing Eigenvectors..\" International Conference on Computer and Information Technology (ICCIT 2005). Dhaka: 2005 . 7 Suraiya Pervin and Subrata Kr. Aditya \"An Area-efficient Equalizer based on the Complex TLMS..\" International Conference on Computer and Information Technology (ICCIT 2005). Dhaka: 2005 . 8 Suraiya Pervin, and Subrata Kr. Aditya \"A CORDIC Realization of the Complex LMS based Adaptive Equalizer..\" Conference of Bangladesh Electronics Society. Dhaka: 2003 . 9 Suraiya Pervin, Taslim Taher and Tariqul Islam \"CORDIC Realization of the ADFE..\" International Conference on Computer and Information Technology (ICCIT 2003). Dhaka: 2003 . 10 Suraiya Pervin and Subrata Kr. Aditya \"A High Speed Architecture for Computing Eigenvalues of Data Covariance Matrix..\" International Conference on Computer and Information Technology (ICCIT 2003). Dhaka: 2003 . 11 Suraiya Pervin and Subrata Kr. Aditya \"A Latency Free Architecture for VSLMS based Adaptive Equalizer..\" International Conference on Computer and Information Technology (ICCIT 2002). (2002) Dhaka: 2002 . 12 Suraiya Pervin, A. S. Dhar and M. Chakraborty \"An Area-efficient Pipelined Architecture for the Trigonometric LMS based Adaptive Equalizer..\" International Conference on Communications and Information Technology (ICCIT 2001). Dhaka: 2001 . 13 Suraiya Pervin, A. S. Dhar and M. Chakraborty \"A High Speed CORDIC based Architecture for the Complex Adaptive Equalizer..\" International Conference on Energy, Automation and Information Technology (EAIT 2001). IIT, Kharagpur, India: 2001 . 14 Suraiya Pervin, M. Chakraborty and T. S. Lamba \"A Hyperbolic LMS Algorithm for CORDIC based Realization..\" IEEE workshop on Statistical Signal Processing (SSP 2001). Singapore: 2001 . 15 Suraiya Pervin, M. Chakraborty and A. S. Dhar \"A Trigonometric Formulation of the LMS Algorithm.\" National conference on Communication (NCC 2001). Kanpur, India: 2001 . 16 Suraiya Pervin, M. Chakraborty and A. S. Dhar \"CORDIC Realization of the Transversal Adaptive Filter using a Trigonometric LMS Algorithm..\" IEEE Conference on Acoustics, Speech and Signal Processing (ICASSP 2001). USA: 2001 . 17 Suraiya Pervin, A. S. Dhar and M. Chakraborty \"Pipelining of VSLMS Based Adaptive Equalizer with Minimum Output Latency..\" International conference on Image and Sign",
  "content_length": 11658,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:10"
}