{
  "name": "Suranjan Chakraborty",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/schakraborty.html",
  "status": "success",
  "content": "Suranjan Chakraborty | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Suranjan Chakraborty Professor & Director, School of Emerging Technologies Contact Info Phone: 410-704-4769 Office: YR-489 Email: schakraborty@towson.edu https://scholar.google.com/citations?user=IoDHDz8AAAAJ&hl=en Education Ph.D., Washington State University, Information Systems, 2008 \t\t\t\t\t\t\t\t\tM.S., BITS, Pilani, Software Engineering, 2001 \t\t\t\t\t\t\t\t\tB.Sc., University of Calcutta (Presidency College), Physics (Hons), 1997 Areas of Expertise Requirements Engineering, Socio-cognitive process in Software Engineering, Applied machine learning in Software Engineering, Distributed ISD Teams, Organizations and IS, Grounded Theory Method, Qualitative Research Methods Biography Suranjan Chakraborty, PhD, is a Professor in the Department of Computer and Information Sciences and the Director of the School of Emerging Technologies at Towson University. His primary research area relates to systems development processes, particularly those related to requirements engineering. His focus has been on understanding socio-cognitive processes underlying systems development. He has recently become interested in examining applications of machine-learning based natural language processing in software engineering. His other research interests include distributed ISD teams, information systems design, and organizational ethics. His research has been published in Journal of Management Information Systems, Journal of Strategic Information Systems, Information Systems Journal, ACM Transactions on Management Information Systems, Journal of the Association of Information Systems, European Journal of Information Systems, Decision Sciences Journal, Decision Support Systems, and Group Decision and Negotiation. His work has also been presented or has appeared in the proceedings of information systems, IEEE, and ACM conferences. He has been a Senior Editor for IJIM data insights and a past Associate Editor for Journal of the AIS. HE has also been past associate editors for leading IS conferences. His research has been funded by federal agencies such as the US Department of Justice. Memberships / Affiliations: Association of Information Systems (AIS) AIS-SIG Grounded Theory Method AIS-SIG Systems Analysis and Design AIS-SIG Philosophy Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 5457,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:11"
}