{
  "name": "Suresh Jagannathan",
  "homepage": "https://www.cs.purdue.edu/homes/suresh",
  "status": "success",
  "content": "Suresh Jagannathan's homepage Suresh Jagannathan Samuel D. Conte Professor Department of Computer Science 305 North University Street West Lafayette, IN 47907 Purdue University Room: LWSN 3154J Phone: 765-494-0971 email: suresh@cs.purdue.edu Research Interests Programming Languages - Design, Implementation, Semantics, and Analysis program verification, analysis, and synthesis functional programming and type systems concurrent and distributed programming machine learning and programming languages Teaching Fall 2025: Programming Languages (undergraduate) Spring 2025: Programming Languages (graduate) Publications Projects Recent and Upcoming Professional Service ACM SIGPLAN Symposium on Principles of Programming Languages (POPL) 2026 PC chair European Conference on Object-Oriented Programming (ECOOP) 2024 PC member ACM SIGPLAN Conference on Programming Language Design and Implementations (PLDI) 2024 PC member ACM SIGPLAN Symposium on Principles of Programming Languages (POPL) 2023 PC member ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA) 2022 PC member Support Students and Post-Doctoral Researchers Current Joseph Eappen Rachit Kumar Aadi Rave (undergraduate) Anmol Sahoo Asha Soroushpoor Kartavya Vashishtha (undergraduate) Zikang Xiong Yongwei Yuan Zhe Zhou Julia Belyakova (post-doc) Former (last known position) Ashish Mishra (post-doc), 2023 (IIT-Hyderabad) Kia Rahmani, 2022 (Durable AI) Gowtham Kaki, 2020 (U. Colorado) Kartik Nagar (post-doc), 2019 (IIT-Madras) Mahsa Najafzadeh (post-doc), 2018 (Microsoft) He Zhu, 2016 (Rutgers) Gustavo Petri (post-doc), 2015 (Amazon) K.C. Sivaramakrishnan, 2014 (Tarides) Dasarath Weeratunge, 2012 (Intel) Lukasz Ziarek, 2011 (SUNY Buffalo) Armand Navabi, 2011 (Google) Nicholas Kidd (post-doc), 2010 (Google) Muralikrishna Ramanathan, 2008 (Amazon) Deepak Rao Bobbarjung, 2007 (Uber) Ronaldo Ferreria, 2006 (Universidade Federal de Mato Grosso Do Sul, Brazil) Adam Welc, 2006 (Mysten Labs)",
  "content_length": 2002,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:13"
}