{
  "name": "Suresh Venkatasubramanian",
  "homepage": "https://vivo.brown.edu/display/suresh",
  "status": "success",
  "content": "Venkatasubramanian, Suresh Back to search Advanced search… Manage your Profile Suresh Venkatasubramanian title=\"Email suresh_venkatasubramanian@brown.edu Overview Background Teaching View All × Website information Text: URL: Save Cancel Suresh Venkatasubramanian Professor of Data Science and Computer Science, Professor of Humanities Overview Suresh Venkatasubramanian directs the Center for Technological Responsibility, Reimagination, and Redesign (CNTR) with the Data Science Institute at Brown University, and is a Professor of Computer Science and Data Science. Suresh's background is as a computer scientist and his current research interests lie in algorithmic fairness, and more generally the impact of automated decision-making systems in society. Suresh recently finished a stint in the Biden-Harris administration, where he served as Assistant Director for Science and Justice in the White House Office of Science and Technology Policy.  In that capacity, he helped co-author the Blueprint for an AI BIll of Rights. Prior to Brown University, Suresh was at the University of Utah, where as an assistant professor he was the John and Marva Warnock Assistant Professor. He has received a CAREER award from the NSF for his work in the geometry of probability, a test-of-time award at ICDE 2017 for his work in privacy, and a KAIS Journal award for his work on auditing black-box models. His research on algorithmic fairness has received press coverage across the globe, including NPR’s Science Friday, NBC, and CNN, as well as in other media outlets. He is a past member of the Computing Community Consortium Council of the CRA, spent 4 years (2017-2021) as a member of the board of the ACLU in Utah, and is a past member of New York City’s Failure to Appear Tool (FTA) Research Advisory Council, the Research Advisory Council for the First Judicial District of Pennsylvania and the Utah State Auditor's Commission on protecting privacy and preventing discrimination. He was recently named by Fast Company to their AI20 list of thinkers shaping the world of generative AI. Brown Affiliations Cogut Institute for the Humanities Computer Science Background Education and Training Year Degree Institution 1999 PhD Stanford University Affiliations Visualize it Teaching Teaching CSCI 1951Z - Fairness in Automated Decision Making",
  "content_length": 2334,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:13"
}