{
  "name": "Suresh Neethirajan",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/Suresh-Raja-Neethirajan.html",
  "status": "success",
  "content": "Dr. Suresh Raja Neethirajan - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events Dr. Suresh Raja Neethirajan Associate Professor & Dalhousie University Research Chair Connect with me My research cluster: Big Data Analytics, AI & Machine Learning My website I have fellowship opportunities available Faculty of Computer Science Email: sureshraja@dal.ca Mailing Address: Faculty of Computer Science Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Digital Agriculture Artificial Intelligence Big Data Analytics Animal-Computer Interaction Sensors & Bio-Instrumentation Education: PhD - University of Manitoba, 2009 Bio: Prior to his tenure at Dalhousie, Dr. Neethirajan held significant roles at Wageningen University and Research, where he served as an Associate Professor, and at the University of Guelph in Canada, where he worked for eight years. He also has experience as a Research Engineer at the Oak Ridge National Laboratory in the USA and the National Agricultural Research Organization in Tsukuba, Japan. Dr. Neethirajan's research is at the cutting edge of the digitalization of livestock farming. He is dedicated to developing sensor technologies and artificial intelligence-based solutions aimed at enhancing animal welfare and livestock health, and improving sustainable animal production systems. His work is characterized by a forward-thinking approach that seeks to leverage digital tools to optimize animal health and productivity, thereby promoting precision livestock farming. His team's past research accomplishments are testament to his innovative approach. They have developed a facial coding platform for measuring emotions in cows and pigs, on-farm sensing platforms for rapid detection of avian influenza and poultry coronaviruses, and a hand-held rapid sensor system for identifying allergens in food samples. They have also developed a cow-side detection test for ketosis and metabolic disease disorders. Furthermore, his team has made significant strides in digital livestock farming, developing facial recognition systems for detecting emotions in cows and pigs, and artificial intelligence-based platforms for measuring behaviors and welfare indicators in cows, pigs, and chickens. As a University Research Chair at Dalhousie University, Dr. Neethirajan leads pioneering research that seeks to address pressing challenges in the field of Digital Livestock Farming. His dedication to his field, combined with his innovative research, continues to make a significant impact on both academia and the broader agricultural industrial sector. His work stands as a testament to the transformative potential of digital tools in promoting sustainable and resilient agricultural practices. Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 3830,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:12"
}