{
  "name": "Surjya Ghosh",
  "homepage": "https://surjya-ghosh.github.io",
  "status": "success",
  "content": "Surjya Ghosh Surjya Ghosh Assistant Professor Computer Science and Information Systems BITS Pilani K K Birla Goa Campus Goa, India Email: surjyag [AT] goa [dot] bits-pilani [dot] ac [dot] in CV | Research@IHMI Lab | Publications | Teaching | Experience | Services | Achievements I am an Assistant Professor in the Department of Computer Science and Information Systems at BITS Pilani K K Birla Goa Campus. Prior to this, I worked as a Postdoctoral researcher at CWI Amsterdam. I did my Ph.D. from the Department of Computer Science and Engineering of IIT Kharagpur, India. Before joining PhD, I have worked at several IT organizations (TCS, IBM, Capgemini) for more than 10 years. My research interests lie in the areas of Human-Computer Interaction, Applied AI, Affective Computing, and Computer Systems. The focus of my research is to design and develop intelligent computing systems, which can improve user experience and influence human behavior. My research has two broad themes: (a) to customize and deploy state-of-the-art AI models in computing systems to solve various human-centered research problems, (b) to facilitate user engagement (e.g. survey fatigue and interruption management, better interaction method) by addressing through a wide range of HCI methods (design, prototyping, user studies). Latest Update Mar-2025: SandDune receives Best Work-in-Progress runner up award at IEEE Percom 2025 Feb-2025: New project proposal (CONNECT application) approved by Alexander von Humboldt Foundation and Indo-German Science and Technology Centre Feb-2025: New paper at ACM CHI 2025 (LBW): \"Influence of Demographics and Personality Traits on Physiological Responses to Improve Continuous Emotion Annotation in Video Applications\" Jan-2025: New paper at IEEE Percom 2025 (WIP): \"SandDune: Single ANtenna Device for Detecting User’s Natural Eating Habits\" Dec-2024: New paper at COMSNETS 2025 (Demo track): \"PResCon: Physiological Response Augmented Continuous Emotion Annotation Tool\" Oct-2024: New paper at IEEE UIC 2024: \"WhoAmIOn: A Technique To Determine Whether All Devices Are Being Used By The Same Person\" PUBLICATIONS [Back to top] Google Scholar | DBLP 2025 Swarnali Banik, Sougata Sen, Snehanshu Saha, and Surjya Ghosh; Influence of Demographics and Personality Traits on Physiological Responses to Improve Continuous Emotion Annotation in Video Applications, ACM CHI Conference on Human Factors in Computing Systems (ACM CHI EA 2025), Yokohama, Japan, Apr 2025 (Late-breaking Works). [Paper] Shreyans Jain, Yash Bhisikar, Surjya Ghosh, Timothy Pierson, and Sougata Sen; SandDune: Single ANtenna Device for Detecting User’s Natural Eating Habits, The 23rd International Conference on Pervasive Computing and Communications (IEEE PerCom 2025), Washington DC, USA, Mar 2025 (Work in Progress). (Best Runner Up Award) Swarnali Banik, Akhilesh Adithya, Bivas Mitra, Sougata Sen, Snehanshu Saha, and Surjya Ghosh; PResCon: Physiological Response Augmented Continuous Emotion Annotation Tool, 17th International Conference on COMmunication Systems & NETworkS (COMSNETS 2025), Bangalore, India, Jan 2025 (Demo). [Paper] 2024 Anuja Pinge, Vinaya Gad, Dheryta Jaisighani, Surjya Ghosh, and Sougata Sen; Detection and monitoring of stress using wearables: a systematic review, Frontiers in Computer Science (Mobile and Ubiquitous Computing), Vol. 6, 2024. [Article] Anuja Achyut Pinge, Amey Damle, Rishav Mukherji, Bhargav Nagaraj, Surjya Ghosh, and Sougata Sen; WhoAmIOn: A Technique To Determine Whether All Devices Are Being Used By The Same Person, 21st IEEE International Conference on Ubiquitous Intelligence and Computing (IEEE UIC 2024), Denarau Island, Fiji, Dec 2024. [Paper] [Slide] Swarnali Banik, Sougata Sen, Snehanshu Saha, and Surjya Ghosh; Towards Reducing Continuous Emotion Annotation Effort during Video Consumption: A Physiological Response Profiling Approach, Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (ACM IMWUT), Volume 8, Issue 3, 2024. [Paper] [Slide] [Dataset] Swarnali Banik, Sougata Sen, Snehanshu Saha, and Surjya Ghosh; Improving Continuous Emotion Annotation in Video Platforms via Physiological Response Profiling, 12th International Conference on Affective Computing and Intelligent Interaction (ACII 2024), Glasgow, UK, Sep 2024. [Paper] [Slide] Alfiya M. Shaikh, Hrithik Nambiar, Kshitish Ghate, Swarnali Banik, Sougata Sen, Surjya Ghosh, Vaskar Raychoudhury, Niloy Ganguly, and Snehanshu Saha; Self-SLAM: A Self-Supervised Learning Based Annotation Method to Reduce Labeling Overhead, European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML PKDD 2024), Vilnius, Lithuania, Sep 2024. [Paper] [Slide] [Poster] Surjya Ghosh, Salma Mandi, Sougata Sen, Bivas Mitra, and Pradipta De; Towards Estimating Missing Emotion Self-reports Leveraging User Similarity: A Multi-task Learning Approach, ACM CHI conference on Human Factors in Computing Systems (ACM CHI 2024), Hawai'i, USA, May 2024. [Paper] [Slide] [Video Preview] Anuja Pinge, Dheryta Jaisinghani, Surjya Ghosh, Aditya Challa, and Sougata Sen; mTanaaw: A System for Assessment and Analysis of Mental Health with Wearables, Workshop on Networking Humanitarian Technology for Healthcare at COMSNETS (NetHealth 2024), Bangalore, India, Jan 2024. [Paper] Hrishikesh Govindrao Kusneniwar, Surjya Ghosh, and Sougata Sen; SonicGlass: An Obstacle Detection and Navigation System Using Smartglass-Based Ultrasonic Sensors, 16th International Conference on COMmunication Systems & NETworkS (COMSNETS 2024), Bangalore, India, Jan 2024. (Poster) [Paper] 2023 M. Prajwal, Ayush Raj, Sougata Sen, Snehanshu Saha, and Surjya Ghosh; Towards Efficient Emotion Self-report Collection Using Human-AI Collaboration: A Case Study on Smartphone Keyboard Interaction, Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (ACM IMWUT), Volume 7, Issue 2, 2023. [Paper] [Dataset] Shruti Rao, Surjya Ghosh, Gerard Pons Rodriguez, Thomas Röggla, Pablo Cesar, and Abdallah El Ali; From Video to Hybrid Simulator: Exploring Affective Responses toward Non-Verbal Pedestrian Crossing Actions using Camera and Physiological Sensors, International Journal of Human-Computer Interaction (IJHCI), 2023. (IF: 4.902) [Paper] Salma Mandi, Surjya Ghosh, Pradipta De, and Bivas Mitra; SELFI: Evaluation of Techniques to Reduce Self-report Fatigue by Using Facial Expression of Emotion, 19th International Conference of Technical Committee 13 (Human-Computer Interaction) of IFIP (INTERACT 2023), York, UK, Sep 2023. [Paper] Harman M. Singh, Shrishailya Agashe, Shreyans Jain, Surjya Ghosh, Aditya Challa, Sravan Danda, and Sougata Sen; Insights from Executing TinyML Models on Smartphones and Microcontrollers, 19th Annual International Conference on Distributed Computing in Smart Systems and the Internet of Things (DCOSS-IoT 2023), Pafos, Cyprus, Jun 2023. (Poster) [Paper] Saumya Mathkar, Prakhar Karsh, Udit Baluja, Surjya Ghosh, Sougata Sen, and Vinayak Naik; A Smartphone-based Application to Detect Parkinson's Disease Using Audio, 15th International Conference on COMmunication Systems & NETworkS (COMSNETS 2023), Bangalore, India, Jan 2023. (Demo) [Paper] 2022 Satchit Hari, Ajay N, Sayan Sarcar, Sougata Sen, and Surjya Ghosh; AffectPro: Towards Constructing Affective Profile Combining Smartphone Typing Interaction and Emotion Self-reporting Pattern, 24th ACM International Conference on Multimodal Interaction (ACM ICMI 2022), Bangalore, India, Nov 2022. [Paper] Surjya Ghosh, Bivas Mitra, and Pradipta De; ALOE: Active Learning based Opportunistic Experience Sampling for Smartphone Keyboard driven Emotion Self-report Collection, 10th International Conference on Affective Computing & Intelligent Interaction (ACII 2022), Nara, Japan, Oct 2022. [Paper] Shruti Rao, Surjya Ghosh, Gerard Pons Rodriguez, Thomas Röggla, Abdallah El Ali, and Pablo Cesar; Investigating Affective Responses toward In-Video Pedestrian Crossing Actions using Camera and Physiological Sensors, 14th International ACM Conference on Automotive User Interfaces and Interactive Vehicular Applications (ACM AutomotiveUI 2022), Seoul, South Korea, Sep 2022. [Paper] Surjya Ghosh, Gerard Pons Rodriguez, Shruti Rao, Abdallah El Ali, and Pablo Cesar; Exploring Emotion Responses toward Pedestrian Crossing Actions for Designing In-vehicle Empathic Interfaces, ACM CHI Conference on Human Factors in Computing Systems (ACM CHI EA 2022), New Orleans, USA, Apr 2022 (Late-breaking Works). [Paper] Salma Mandi, Surjya Ghosh, Pradipta De, and Bivas Mitra; Emotion Detection from Smartphone Keyboard Interactions: Role of Temporal vs Spectral Features, The 37th ACM/SIGAPP Symposium On Applied Computing (ACM SAC 2022), Brno, Czech Republic, April 2022. [Paper] Akhilesh Adithya, Snigdha Tiwari, Sougata Sen, Sandip Chakraborty, and Surjya Ghosh; OCEAN: Towards Developing an Opportunistic Continuous Emotion Annotation Framework, The 20th International Conference on Pervasive Computing and Communications (IEEE PerCom 2022), Pisa, Italy, Mar 2022 (Work in Progress). [Paper] [Slide] Anuja Achyut Pinge, Soumyadip Bandyopadhyay, Surjya Ghosh, and Sougata Sen; A Comparative Study between ECG-based and PPG-based Heart Rate Monitors for Stress Detection, Workshop on Networking Humanitarian Technology for Healthcare at COMSNETS (NetHealth 2022), Bangalore, India, Jan 2022. [Paper][Slide][Talk] 2021 Surjya Ghosh, Niloy Ganguly, Bivas Mitra, and Pradipta De; Designing An Experience Sampling Method for Smartphone based Emotion Detection, IEEE Transactions on Affective Computing, 2021. (IF: 13.99) [Article] Tejal Karnavat, Jaskaran Bhatia, Surjya Ghosh, and Sougata Sen; Exploring the challenges of using food journaling apps: A case-study with young adults, 18th International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (MobiQuitous 2021), Beppu, Japan, Nov 2021. [Paper] Surjya Ghosh, and Tanaya Gu",
  "content_length": 20355,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:12"
}