{
  "name": "Surya Prakash 0001",
  "homepage": "http://www.iiti.ac.in/~surya",
  "status": "success",
  "content": "Home Page of Dr. Surya Prakash Home | Teaching Interests | Research Interests | Publications | Sponsored Projects | Students | Short-Term Courses | Join Us PhD and Internship aspirants, click here Dr. Surya Prakash Professor Department of Computer Science and Engineering, School of Engineering, Indian Institute of Technology Indore Indore-453552, Madhya Pradesh, India E-mail: surya AT iiti DOT ac DOT in, spagnihotri AT gmail DOT com Phone: +91-731-660-3242 Welcome to my homepage! My broad research interest includes Biometrics, Machine Learning, Deep Learning, Pattern Recognition, Computer Vision, Image Processing, Big Data, and 3D Point Cloud Processing. I am also interested in the use of modern technologies for the preservation of traditional Indian Heritage. Education PhD, 2013, Department of Computer Science & Engineering, Indian Institute of Technology Kanpur, Kanpur, UP, INDIA. MS, 2008, Department of Computer Science & Engineering, Indian Institute of Technology Madras, Chennai, TN, INDIA. BTech, 2001, Department of Computer Science & Engineering, Institute of Engineering and Technology Kanpur, UP, INDIA. Experience Professor, Indian Institute of Technology Indore, Indore, MP, INDIA. [August 2024 - till date] Associate Professor, Indian Institute of Technology Indore, Indore, MP, INDIA. [August 2019- August 2024] Assistant Professor, Indian Institute of Technology Indore, Indore, MP, INDIA. [June 2013-August 2019] Visiting Assistant Professor, Indian Institute of Technology Indore, Indore, MP, INDIA. [January 2013-June 2013] Project Associate/Senior Project Associate, Indian Institute of Technology Kanpur, Kanpur, UP, INDIA. [March 2002-Dec 2004] Lecturer, Harcourt Butler Technological Institute Kanpur, UP, INDIA. [July 2001-March 2002] Honors Associate Editor, International Journal of Intelligent Systems, Wiley. [November 2021 – continuing] Associate Editor, International Journal on Semantic Web and Information Systems (IJSWIS). [August 2021 – continuing] Editorial Review Board Member, International Journal of Cloud Applications and Computing (IJCAC). [August 2021 – continuing] Sir Visvesvaraya Young Faculty Research Fellow (YFRF), 2019. Senior Member, IEEE Teaching Please check here for my teaching interests. Research Research Interests Publications Sponsored Projects Students Link to My Google Scholar Page Link to My DBLP Page Miscellaneous Links How to write a good research paper Wikipedia: The Free Encyclopedia MathWorld: Web's most extensive mathematics resource Conversion & Calculation, Current Time in 1000 Places",
  "content_length": 2572,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:18"
}