{
  "name": "Susanne Bødker",
  "homepage": "http://pure.au.dk/portal/en/persons/id(87d4fbb6-b38c-449e-b87d-59f693b7d6f0).html",
  "status": "success",
  "content": "Susanne Bødker - Aarhus University My CV View Scopus Profile Susanne Bødker Professor, Department of Computer Science https://orcid.org/0000-0002-3571-1617 Phone+4540247988Emailbodkercs.audk Åbogade 34, 5342, 1298200 Aarhus NDenmark 1984 …2025 Research activity per year Personal profile KeywordsUser participation in systems development (participatory design)Design as learningDesign processesExperimental systems developmentComprehensive technologyInteraction designForms of interactionIt-based knowledge workplaceIT support for cooperation (CSCW)Systems development methodsTheories on use and interactionWork, Organisation and ITDesign and Systems DevelopmentMan-machine Interaction Fingerprint Dive into the research topics where Susanne Bødker is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Participatory Design Computer Science 100% Human-Computer Interaction Computer Science 69% Case Study Computer Science 46% Artifact Ecology Keyphrases 45% Human Computer Interaction Computer Science 43% Research Project Computer Science 34% Interactive Computer Science 34% Conceptual Arts and Humanities 29% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2012 2012 2014 2017 2023 3 Finished Projects per year CIO: Common Interactive ObjectsBødker, S. (Participant)01/12/2017 → 30/05/2023Project: Research Shared Objects 100% Non-formal Learning 100% Programming Workshop 100% Citizen Science Project 100% Biodiversity Monitoring 100% CIBIS: Creativity In Blended Interaction SpacesHalskov, K. (Award holder), Dalsgaard, P. (Project manager), Bødker, S. (Project manager), Biskjaer, M. M. (Participant), Klokmose, C. N. (Participant), Hansen, N. B. (Participant) & Baader, S. (Participant)01/07/2014 → 30/06/2018Project: Research Design Research 100% Creativity Support 92% Human Computer Interaction 76% Case Study 76% Human-Computer Interaction 71% Participator Information TechnologyPold, S. B. (Project manager), Halskov, K. (PI), Bødker, S. (PI) & Andersen, C. U. (Participant)01/09/2012 → 31/08/2021Project: Research Research output Research output per year 1984 1988 1991 1993 1998 2000 2002 2003 2005 2006 2007 2008 2011 2012 2013 2015 2016 2017 2018 2020 2021 2025 89 Article in proceedings 46 Journal article 27 Book chapter 15 Working paper 54 More 12 Paper 9 Anthology 6 Conference abstract in proceedings 3 Report 3 Conference abstract for conference 3 Conference article 3 Review 2 Book 2 Report chapter 2 Poster 2 Comment/debate/letter to the editor 2 Editorial 1 Encyclopedia entry 1 Preface/postscript 1 Other contribution 1 PhD thesis 1 Preprint Research output per year Research output per year The Human-Artifact Model: An Activity Theoretical Approach to Artifact EcologiesBødker, S. & Klokmose, C. N., 2011, In: Human-Computer Interaction. 26, 4, p. 315-371 57 p.Research output: Contribution to journal/Conference contribution in journal/Contribution to newspaper › Journal article › Research › peer-review Open AccessFile Artifact Model 100% Interactive 100% Action Possibilities 50% 116 Citations (Scopus) 2279 Downloads (Pure) While working around securityMathiasen, N. R., Bødker, S. & Petersen, M. G., 2011.Research output: Contribution to conference › Paper › Research › peer-review File Conceptual Model 100% Recent Literature 100% Design Perspective 100% Starting Point 100% Research Project 100% 349 Downloads (Pure) Experiencing Security in Interaction DesignMathiasen, N. R. & Bødker, S., 2011, Proceedings of the 2011 annual Conference on Human Factors in Computing Systems. Association for Computing Machinery, p. 2325-2334 10 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Security Experience 100% Acting out 100% Participatory Design 50% Digital Signature 50% Security Strategy 50% 15 Citations (Scopus) Timeline CollaborationBohøj, M., Borchorst, N. G., Bouvin, N. O., Bødker, S. & Zander, P.-O., 2010, Proceedings of the 28th International Conference on Human factors in computing Systems. CHI '10 . Association for Computing Machinery, p. 523-532 10 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Case Study 100% Parental Leave 100% Human-Computer Interaction 50% Information Space 50% Visualization Tool 50% 29 Citations (Scopus) Public deliberation in municipal planning: supporting action and reflection with mobile technologyBohøj, M., Borchorst, N. G., Bødker, S., Korn, M. & Zander, P.-O., 2011, Proceedings of the 5th International Conference on Communities and Technologies . Association for Computing Machinery, p. 88-97 10 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Mobile Technology 100% Participatory Design 100% Municipal Planning 100% Citizen Deliberation 50% 47 Citations (Scopus) View all 231 research outputs Activities Activities per year 1984 2007 2008 2009 2010 2012 2014 2024 71 Member of committee, council or board 35 Lecture and oral contribution 28 Member of evaluation panel 15 Participation in or organisation af a conference 22 More 9 Participation in or organisation of workshop, seminar or course 4 Peer review of manuscripts 3 Visiting an external academic institution 2 Editor of Research journal 2 Member of board or management of company or organisation 1 Member of research network 1 Other Activities per year 2024 PhD Seminar on Participatory Design: Contemporary Issues and Concerns Bossen, C. (Organizer), Smith, R. C. (Organizer), Winschiers-Theophilus, H. (Speaker), Bødker, S. (Speaker), Talhouk, R. (Speaker) & Huybrechts, L. (Participant)10 Jun 2024 → 12 Jun 2024Activity: Participating in or organising an event types › Participation in or organisation of workshop, seminar or course Independent Research Fund DenmarkBødker, S. (Member)1 Aug 2020 → 31 Jul 2026Activity: Presentations, memberships, employment, ownership and other activities › Member of committee, council or board New Approaches to Research & Design - breaking away from waves through generative HCI research Bødker, S. (Lecturer)20 Nov 2019Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Fostering Historical Research in CSCW & HCIBødker, S. (Participant)10 Nov 2019Activity: Participating in or organising an event types › Participation in or organisation of workshop, seminar or course Humanising AIBødker, S. (Lecturer)31 May 2018Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution View all 171 activities Prizes EUSSET awardBødker, S. (Recipient), 22 Sept 2015Prize: Prizes, scholarships, distinctions IFIP-TC13 Pioneer AwardBødker, S. (Recipient), 28 Sept 2016Prize: Prizes, scholarships, distinctions Optagelse ACM CHI academyBødker, S. (Recipient), 10 Apr 2010Prize: Prizes, scholarships, distinctions ACM SigDOC RIGO award for lifelong achievementBødker, S. (Recipient), 23 Sept 2008Prize: Prizes, scholarships, distinctions Best paper award HICSS 1999Bødker, S. (Recipient), 1 Jan 1999Prize: Prizes, scholarships, distinctions View all 9 prizes Press/Media How do we know: Can Machines Think?Bødker, S.26/08/20241 Media contributionPress/Media: Press / Media HarddiskenBødker, S.17/05/20131 item of Media coveragePress/Media: Press / Media Om Studerendes UdenlandsopholdBødker, S.07/09/20101 Media contributionPress/Media: Press / Media OrienteringBødker, S.11/10/20071 Media contributionPress/Media: Press / Media Morgenradio ØstjyllandsradioBødker, S.26/03/20071 Media contributionPress/Media: Press / Media View all 6 press/media",
  "content_length": 8078,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:29"
}