{
  "name": "Susanne E. Hambrusch",
  "homepage": "https://www.cs.purdue.edu/people/seh",
  "status": "success",
  "content": "Susanne E. Hambrusch - Department of Computer Science - Purdue University Skip to content Home People Faculty Susanne E. Hambrusch Faculty & Lecturers Staff Offices Susanne E. Hambrusch Susanne E. Hambrusch is professor of Computer Sciences at Purdue University. She received the Diplom Ingenieur in Computer Science from the Technical University of Vienna, Austria, in 1977, and a Ph.D. in Computer Science from Penn State in 1982. In 1982, she joined the faculty at Purdue University. She served as the Department Head of from 2002-07 and as the Interim Head 2018-20. She has held visiting appointments at the Technical University of Graz, Austâ¦ âMore Joined department: Fall 1982 Research Areas Databases and Data Mining Theory of Computing, Algorithms, and Quantum Computing Education MS, Technical University of Vienna, Computer Science (1977) PhD, The Pennsylvania State University, Computer Science (1982) Susanne E. Hambrusch is professor of Computer Sciences at Purdue University. She received the Diplom Ingenieur in Computer Science from the Technical University of Vienna, Austria, in 1977, and a Ph.D. in Computer Science from Penn State in 1982. In 1982, she joined the faculty at Purdue University. She served as the Department Head of from 2002-07 and as the Interim Head 2018-20. She has held visiting appointments at the Technical University of Graz, Austria, and the International Computer Science Institute at the University of California, Berkeley. From 2010 to 2013, she served as the Director of the Computing and Communication Foundations (CCF) Division in the CISE Directorate at NSF. Professor Hambrusch's research interests are in analysis of algorithms, computer science education, and query and data management in mobile environments. She has lead a number of projects in computer science education, including \"Science Education in Computational Thinking (SECANT)\" and \"Computer Science for Education (CS4EDU)\", \"Assessing a Just-in-Time Professional Development Approach for Teacher Knowledge Growth in Computer Science (PD4CS)\", and \"Exploring Pathways of Future CS Education Researchers (CSEdGrad)\". Hambrusch has served on the CRAâs Board of Directors 2008-10 and 2014-20 and as vice chair 2015-19. She is one of the co-founders of CRAâs Education Committee (CRA-E) and has served as its Co-Chair since 2013. She served on CRAâs Committee on the Status of Women in Computing Research (CRA-W) from 2007-10 and 2014â18. She was a member of the editorial boards of Information Processing Letters and Parallel Computing, and she currently is a co-chair for CACM's Viewpoints section. Her recognitions include inaugural membership in the Purdue University Book of Great Teachers, a 2003 Outstanding Engineering Alumni Award from Pennsylvania State University, 2004 TechPoint Mira Education Award Winner, 2015 College of Science Team Award, and the 2019 Violet Haas Award (for contributions towards the advancement of woman in academia). Hambrusch is a Fellow of the Association of Computing Machinery (ACM). Selected Publications National Academies of Sciences, Engineering, and Medicine. Assessing and Responding to the Growth of Computer Science Undergraduate Enrollments. J. Cohon, S. Hambrusch (co-chairs). National Academies Press. DOI:10.17226/24926. 227 pages. 2018.Â T. Camp, W.R. Adrion, E. Bizot, S. Davidson, M. Hall, SE Hambrusch, E. Walker, S. Zweben. Â Â CRA Report, Generation CS: The growth of computer science.Â  Â Also in Inroads. 8(2), 8(3), and 8(4), 2017. C. Mayfield, N. Zhou, S. Hambrusch, J.T. Korb, A. Yadav. Computational Thinking in Elementary and Secondary Teacher Education. ACM Transactions on Computing Education, Vol. 14 (1), 1-16, 2014. Aman Yadav, Ninger Zhou, Chris Mayfield, Susanne Hambrusch, J.T. Korb, \"Introducing Computational Thinking in Education Courses\",Â 42nd ACM Technical Symposium on Computer Science Education, 465-470, 2011. Contact Info seh@cs.purdue.edu LWSN 1179 Websites My Homepage",
  "content_length": 3977,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:28"
}