{
  "name": "Susanne Wetzel",
  "homepage": "https://www.stevens.edu/profile/swetzel",
  "status": "success",
  "content": "Susanne Wetzel | Stevens Institute of TechnologySkip to ContentSusanne WetzelProfessorCharles V. Schaefer, Jr. School of Engineering and ScienceDepartment of Computer ScienceGateway Center S331(201) 216-5610(201) 216-8249[email protected]WebsiteEducationPhD (1998) Saarland University (Computer Science) ResearchMy research interests are in cryptography and algorithmic number theory. In the field of cryptography, my research is focused on wireless security, secret sharing, privacy, secure multi-party computation, security economics, and biometrics, and my contributions range from analysis to protocol design (with applications in bartering, reconciliation, electronic voting, and auctions). In algorithmic number theory, my research is centered on lattice theory, in particular on developing new algorithms and heuristics for lattice basis reduction.ExperienceI have developed and directed the department’s undergraduate degree program in cybersecurity which graduated its first class in Spring 2011. Also, I am heading the Stevens’ Cybercorps®: Scholarship for Service program. My work in cybersecurity education and research has been supported by grants from NSF, DHS, and DoD. Recently, I have served as Program Director at the National Science Foundation for the Secure and Trustworthy Cyberspace (SaTC) program. I have received my Diploma in Computer Science from the University of Karlsruhe (Germany) and my Ph.D. in Computer Science from the Saarland University (Germany).Institutional ServiceDepartment P&T MemberDepartment P&T MemberIT Advisory Committee - Senate IT Sub-Committee MemberIT Advisory Committee - Senate IT Sub-Committee MemberCS Curriculum Committee MemberDepartment P&T MemberRedesignation for NSA/DHS CAE-CD ChairIT Advisory Committee - Senate IT Sub-Committee MemberProfessional ServiceExecutive Committee DIMACS MemberJournal of Mathematical Cryptology Member Editorial Advisory BoardExecutive Committee DIMACS MemberJournal of Mathematical Cryptology Member Editorial Advisory BoardProfessional SocietiesACM MemberDIMACS – Center for Discrete Mathematics and Computer Science (DIMACS) MemberGI – Gesellschaft fuer Informatik MemberIEEE MemberIACR – International Association for Cryptologic Research MemberWiCyS – Women in Cybersecurity MemberACM MemberDIMACS – Center for Discrete Mathematics and Computer Science (DIMACS) MemberGI – Gesellschaft fuer Informatik MemberIEEE MemberIACR – International Association for Cryptologic Research MemberWiCyS – Women in Cybersecurity MemberACM MemberDIMACS – Center for Discrete Mathematics and Computer Science (DIMACS) MemberGI – Gesellschaft fuer Informatik MemberIEEE MemberIACR – International Association for Cryptologic Research MemberWiCyS – Women in Cybersecurity MemberACM MemberDIMACS – Center for Discrete Mathematics and Computer Science (DIMACS) MemberGI – Gesellschaft fuer Informatik MemberIEEE MemberIACR – International Association for Cryptologic Research MemberWiCyS – Women in Cybersecurity MemberPatents and InventionsJakobsson, M., Wetzel, S.: Method and Apparatus for Ensuring Security of Users of Bluetooth-enabled Devices. United States Patent 6,574,455 - June 3, 2003.Bohannon P.L., Jakobsson, M., Monrose, F., Reiter, M.K., Wetzel, S.: Generation of Repeatable Cryptographic Key Based on Varying Parameters. United States Patent 6,901,145 - May 31, 2005.Jakobsson, M., Wetzel, S.: Secure Distributed Computation in Cryptographic Applications. United States Patent 6,950,937 - September 27, 2005.Jakobsson, M., Wetzel, S.: Method and Apparatus for Ensuring Security of Users of Short Range Wireless Enable Devices. United States Patent 6,981,157 - December 27, 2005.Selected PublicationsConference ProceedingBreuer, M.; Meyer, U.; Wetzel, S. (2024). Efficient Integration of Exchange Chains in Privacy-Preserving Kidney Exchange. 21st Annual International Conference on Privacy, Security, and Trust (PST2024). 21st Annual International Conference on Privacy, Security, and Trust (PST2024).Breuer, M.; Meyer, U.; Wetzel, S. (2024). Efficient Privacy-Preserving Approximation of the Kidney Exchange Problem (Best Paper Award). 19th ACM ASIA Conference on Computer and Communications Security (ACM ASIACCS 2024. 19th ACM ASIA Conference on Computer and Communications Security (ACM ASIACCS 2024.Garay, S.; Chan, A.; Wetzel, S.; White, G. (2024). A Study on Exploring the Challenges of the CyberCorps®: Scholarship for Service Program to Support PhD Level Scholarships. 16th IFIP WG 11.8 World Conference on Information Security Education (WISE 2024). 16th IFIP WG 11.8 World Conference on Information Security Education (WISE 2024).Drazovich, L.; Wetzel, S.. Cyber Insurance in the Maritime Transportation System. IEEE LCN Workshop on Maritime Communication and Security (IEEE LCN MarCaS 2024). IEEE LCN Workshop on Maritime Communication and Security (IEEE LCN MarCaS 2024).Breuer, M.; Hein, P.; Pompe, L.; Temme, B. C.; Meyer, U.; Wetzel, S. (2022). Solving the Kidney Exchange Problem Using Privacy-Preserving Integer Programming. 19th Annual International Conference on Privacy, Security & Trust (PST 2022). 19th Annual International Conference on Privacy, Security & Trust (PST 2022).Breuer, M.; Meyer, U.; Wetzel, S. (2022). Privacy-Preserving Maximum Matching on General Graphs and its Application to Enable Privacy-Preserving Kidney Exchange. Twelveth ACM Conference on Data and Application Security and Privacy (CODASPY). Twelveth ACM Conference on Data and Application Security and Privacy (CODASPY).Breuer, M.; Meyer, U.; Wetzel, S. (2021). Introducing a Framework to Enable Anonymous Secure Multi-Party Computation in Practice. 18th International Conference on Privacy, Security and Trust (PST 2021). 18th International Conference on Privacy, Security and Trust (PST 2021).Drazovich, L.; Brew, L.; Wetzel, S. (2021). Advancing the State of Maritime Cybersecurity Guidelines to Improve the Resilience of the Maritime Transportation System. 2021 IEEE CSR Workshop on Maritime Cyber Security. 2021 IEEE CSR Workshop on Maritime Cyber Security.Brew, L.; Drazovich, L.; Wetzel, S. (2021). The Impact of COVID-19 on the Security and Resilience of the Maritime Transportation System. 2021 IEEE CSR Workshop on Maritime Cyber Security. 2021 IEEE CSR Workshop on Maritime Cyber Security.Breuer, M.; Meyer, U.; Wetzel, S.; Muehlfeld, A. (2020). A Privacy-preserving Protocol for the Kidney Exchange Probblem. Workshop on Privacy in the Electronic Society (WPES 2020). ACM Workshop on Privacy in the Electronic Society (WPES 2020).Wueller, S.; Assadsolimani, B.; Meyer, U.; Foerg, F.; Wetzel, S. (2019). Privacy-Preserving Multi-Party Conditional Random Selection . 17th Annual Conference on Privacy, Security and Trust, PST 2019. IEEE.Damopoulos, D.; Wetzel, S. (2019). Introducing Research into the Undergraduate Curriculum in Cybersecurity. Information Security Education. Education in Proactive Information Security - 12th IFIP WG 11.8 World Conference WISE 12, 2019. Wueller, S.; Breuer, M.; Meyer, U.; Wetzel, S. (2018). Privacy-Preserving Trade Chain Detection. Data Privacy Management Workshop DPM 2018. Wueller, S.; Assadsolimani, B.; Meyer, U.; Wetzel, S. (2018). Privacy-Preserving Subgraph Checking. 16th Annual Conference on Privacy, Security and Trust, PST 2018. Journal ArticleBreuer, M.; Meyer, U.; Wetzel, S. (2024). Prioritization and Exchange Chains in Privacy-Preserving Kidney Exchange. Journal of Computer Security (4 ed., vol. 32). Journal of Computer Security.Breuer, M.; Meyer, U.; Wetzel, S.; Floege, J.; Muehlfeld, A. (2022). Wenn der eigene Spender nicht passt ... Nierentransplantation als Crossover-Lebendnierenspende. Nieren- und Hochdruckerkrankungen (9 ed., vol. 51). Nieren- und Hochdruckerkrankungen.CoursesCS306 Introduction to IT SecurityCS425/CS426 Cybersecurity Capstone I+IICS578 Privacy in a Networked World",
  "content_length": 7849,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:30"
}