{
  "name": "Susanne Boll",
  "homepage": "https://uol.de/en/susanne-boll",
  "status": "success",
  "content": "Prof. Dr. techn. Susanne Boll // University of Oldenburg School II Department of Computing Science Media informatics and multimedia systems Prof. Dr. techn. Susanne Boll University of Oldenburg Department of Computing Science Media Informatics and Multimedia Systems Escherweg 2 26121 Oldenburg Mail: Susanne.Boll(at)informatik.uni-oldenburg.de Phone: +49 (0) 441 - 97 22 213 Fax:+49 (0) 441 - 97 22 202  Room: OFFIS O 47 Web: medien.informatik.uni-oldenburg.de Prof. Dr. techn. Susanne Boll I am professor for Media Informatics and Multimedia Systems and Member of the Board of the OFFIS Institute for IT in Oldenburg. In my basic research, I develop new interaction paradigms for cyber-physical systems that focus on people and are embedded in social contexts. I create interactive technologies that prioritize people. With my expertise in human-computer interaction, digital transformation, and responsible technology, I advise research, industry, and policymakers—shaping a digital future that is innovative, ethical, and socially impactful. I am a Full Professor of Media Informatics and Multimedia Systems at the University of Oldenburg and a member of the Board of Directors of the OFFIS Institute for Information Technology in Oldenburg, Germany.  I earned a doctorate with distinction from the Technical University of Vienna, Austria and received my Diploma in Computer Science with distinction from the Technical University of Darmstadt, Germany in 1996. My research lies at the intersection of human-computer interaction and interactive multimedia, where I have built an excellent scientific track record. My passion is developing interactive technology for people—placing user needs and social acceptance at the center of my research while integrating innovative technological advancements. I am dedicated to creating novel interaction technologies that foster respectful and beneficial collaboration between humans and technology in an increasingly automated world. My research projects maintain strong connections with industry and application partners, addressing critical challenges in automation for transportation systems, interactive healthcare technologies, and Industry 4.0. My scientific results have been published in competitive peer-reviewed international conferences, such as Multimedia and CHI, as well as in internationally recognized journals. I have authored more than 300 articles in competitive conferences, workshops, journals, and books. As an active member of the scientific community, I have served on the technical program committees of many renowned conferences and workshops. Over the past two decades, my expertise in multimedia and human-computer interaction, digital transformation, and responsible technology development has been recognized by research institutions, industry leaders, and policymakers alike. I have been entrusted with advisory, expert, jury, and board roles, shaping strategic decisions, funding priorities, and the future of digital innovation. Through these positions, I contribute to advancing scientific excellence, responsible technology, and interdisciplinary collaboration on both national and international levels. Core Education and Academic PositionsFull Professor for Media Informatics and Multimedia Systems, University of Oldenburg (since 2013)Associate Professor for Media Informatics and Multimedia Systems, University of Oldenburg (2006–2012)Assistant Professor for Multimedia and Internet Technologies, University of Oldenburg (2002–2006)PhD in Computer Science (Dr. techn.), TU Wien, 2001 (with distinction)Diploma in Computer Science (Dipl.-Inform.), TU Darmstadt, 1996 (with distinction) My research is at the intersection of systems engineering, human-machine interaction and computer science with the aim of developing interactive systems that are both technically efficient and human-centred. In my projects, I combine technical system design with user-centred methods to create complex digital systems that are efficient, understandable and socially acceptable. A particular focus of my work is the integration of intelligent systems into people's everyday professional and private lives - be it in production, healthcare or mobility. The central question is how systems can not only be technically optimised, but also transparent, trustworthy and supportive in their interaction with people. My research focuses  on interactive systems and multimodal interfaces in complex cyber-physical systems, automation and people as part of the team. This requires not only a thorough system analysis, but also innovative interface and interaction concepts that place people at the centre of technology design. I have been very successful in acquiring and leading over 60 research projects at the University of Oldenburg and the associated OFFIS–Institute for Information Technology, funded by national and international research foundations as well as industry partners. Some recent core research projects:Coordinator of the DFG Priority Programme Scalable Interaction Paradigms for Pervasive Computing Environments“, SPP 2199 (DFG) 2020-2026Co-Spekaer of the PIZ – Center for Innovation in Care, funded by the Federal Ministry of Education and Research (BMBF), 2017-2027SEAS – Social and Cultural Embeddedness of Automated Cyber-Physical Systems, Graduate School funded by the University of Oldenburg, 2019-2023Interdisciplinary Research Center on Critical Systems Engineering for Socio-technical Systems (CSE), Socio-technical Automotive Systems – The Car That Cares, funded by Ministry of Science and Culture of Lower Saxony (MWK), 2013 – 2018 My innovative approach to academic teaching combines theoretical foundations with hands-on research and interdisciplinary collaboration. I emphasize research-oriented learning, where students are actively involved in current scientific projects early on and develop their own innovative solutions. Digital and interactive teaching methods, such as project-based learning, hybrid formats, and the use of modern technologies, foster a practice-oriented and application-driven education. A key component of my teaching is the set of courses I offer in Human-Computer Interaction, Interactive Systems, Digital Fabrication, and Ubiquitous Computing. These courses not only provide technical knowledge but also focus on user-centered design, ethical considerations, and the societal impact of digital technologies. Furthermore, I coordinate the interdisciplinary Master’s program in Engineering Socio-Technical Systems, which is situated at the intersection of computer science, social sciences, and psychology. In this program, I teach students how to design complex socio-technical systems that are both technologically innovative and socially responsible. Another major focus of my teaching is supervising thesis projects on research-driven topics. Together with my team, I mentor numerous students who work closely with ongoing research projects to address real-world challenges. This enables them to develop scientifically grounded solutions for the pressing issues of digital transformation. Additionally, I place great importance on diversity and inclusion in education, fostering an inspiring learning environment that motivates and empowers students from diverse backgrounds to actively shape the digital future. Core classes in BSc Computer Science, MSc Computer Science and MSc Engeineering Socio-Technical Systems which i teach with my team.Experiments and studies: Students learn to design, conduct and analyse empirical user studies, gaining early hands-on experience with a wide range of scientific methods in HCI research.Human-Computer Interaction: This module introduces the core concepts of HCI, with a strong focus on user-centred design, usability and UX, combined with a project-based approach that integrates design thinking with technical prototyping.Interactive Systems: Students learn the fundamentals of interactive systems and understand how interactive applications are designed and developed.Digital Fabrication / Makers Lab: In our open lab environment, students explore creative technology making using fabrication tools to build functional physical-digital prototypes.Pervasive and Wearable Computing: This module explores ubiquitous computing and wearables, combining technical implementation with a critical perspective on human experience and context. My research in Human-Computer Interaction, interactive multimedia technology, and ubiquitous computing is internationally recognized and has significantly shaped the discourse on human-centered digital technologies. With over 300 peer-reviewed publications, including conference papers, journal articles, and book chapters, I have made substantial contributions to the field. My scientific impact is reflected in more than 10,000 citations on Google Scholar and an h-index of 54​. I have received numerous prestigious awards, including Best Paper Awards and Honorable Mentions at leading international conferences such as CHI, MobileHCI, and AutoUI​. Beyond academia, my research has a strong application-oriented focus, influencing key domains such as mobility, healthcare technologies, and the design of interactive systems for everyday societal use​. In addition to my research, I have led and successfully managed over 50 national and international research and industry projects​. As a scientific leader, I have supervised and guided 25 PhD students to completion, building an internationally renowned and interdisciplinary research team that is among the leading groups in Germany in the field of Human-Computer Interaction​. My involvement in scientific committees, including my role as Chair of the Computer Science Review Board at the German Research Foundation (DFG) and as a board member of the OFFIS Institute for Information Technology, contributes to the strategic development of computer science and digital transformation​. My long-term vision is to shape an inclusive and social",
  "content_length": 16536,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:27"
}