{
  "name": "Susan Landau 0001",
  "homepage": "https://privacyink.org",
  "status": "success",
  "content": "Susan Landau Publications Teaching Activities Honors/Awards Contact Susan Landau is Professor of Cyber Security and Policy in the Department of Computer Science at Tufts University. Formerly, as Bridge Professor of Cyber Security and Policy at The Fletcher School and the School of Engineering, Department of Computer Science, Tufts University, she founded Tufts's innovative MS degree in Cybersecurity and Public Policy. Landau's research lies at the intersection of privacy, surveillance, cybersecurity, and law. She has testified before Congress and frequently briefed US and European policymakers on encryption, surveillance, and cybersecurity issues. She has been a Senior Staff Privacy Analyst at Google, a Distinguished Engineer at Sun Microsystems, and a faculty member at Worcester Polytechnic Institute, the University of Massachusetts, and Wesleyan University. An interdisciplinary scholar, Landau has won the McGannon Book Award for Social and Ethical Relevance in Communication Policy Research for Privacy on the Line: The Politics of Wiretapping and Encryption, co-authored with Whitfield Diffie, the Surveillance Studies Book Prize for Surveillance or Security: The Risks Posed by New Wiretapping Technologies, the USENIX Lifetime Achievement Award, shared with Steven Bellovin and Matt Blaze, and the American Mathematical Society's Bertrand Russell Prize. Landau has served on committees of the National Academies of Sciences, Engineering, and Medicine, on the National Science Foundation Computer and Information Science Engineering Advisory Board, the National Institute of Standards and Technology Information Security and Privacy Advisory Board, and on editorial boards for mathematics and computer science journals. She is a Guggenheim fellow, a fellow of Association for Computing Machinery and the American Association for the Advancement of Science, and an inductee of the Information System Security Hall of Fame and the Cybersecurity Hall of Fame. Landau received her BA from Princeton University, MS from Cornell University, and PhD from MIT. Photo by Ben Barnhart CV Landau is strongly committed to the success of women and members of underrepresented groups in science. She currently serves on the External Advisory Board for the Spelman College program in cyber security and policy. Her previous activities have included co-creating the graduate student GREPSEC workshops in privacy and security for women and members of underrepresented groups, conceiving of and co-creating the ACM Athena Lectureship, which honors senior women researchers, starting researcHers, a mailing list for women computer science researchers in academia, industry and government labs and conceiving of and co-organizing the first MIT Celebration of Women in Math meeting. Landau received the 2008 Women of Vision Social Impact Award from the Anita Borg Institute for Women and Technology. MIT Press Amazon Yale University Press Amazon MIT Press Amazon MIT Press Amazon [top] Publications (Publications are arranged by subject and may be listed in more than one category if appropriate.) Cryptography and Cryptography Policy Susan Landau, Testimony, Hearing on Foreign Influence on Americans' Data Through the Cloud Act, House Judiciary Subcommittee on Crime and Federal Government Surveillance, House of Representatives, June 5, 2025. Harold Abelson, Ross Anderson, Steven M. Bellovin, Josh Benaloh, Matt Blaze, Jon Callas, Whitfield Diffie, Susan Landau, Peter G. Neumann, Ronald L. Rivest, Jeffrey I. Schiller, Bruce Schneier, Vanessa Teague, and Carmela Troncoso, Bugs in our Pocket: The Risks of Client-Side Scanning, Journal of Cybersecurity, Vol. 10, Issue 1, 2024. Susan Landau, The Development of a Crypto Policy Community: DiffieHellmans Impact on Public Policy, Rebecca Slayton, ed., Democratizing Cryptography: The Work of Whitfield Diffie and Martin Hellman, Association for Computing Machinery, 2022, 214-256. Nadiya Kostyuk and Susan Landau, Dueling over Dual_EC_DRBG: The Consequences of Corrupting a Cryptographic Standardization Process, Harvard National Security Journal, Volume 13, Issue 2 (2022). Encryption Working Group, Carnegie Endowment for International Peace, Moving the Encryption Policy Debate Forward, September 2019. Committee on Law Enforcement and Intelligence Access to Plaintext Information in an Era of Widespread Strong Encryption: Options and Trade Offs, Computer Science and Telecommunications Board, National Academies of Sciences, Engineering, and Medicine, Decrypting the Encryption Debate: A Framework for Decisionmakers, 2018. Susan Landau, Listening In: Cybersecurity in an Insecure Age, Yale University Press, 2017. Some podcasts: an in-depth Hoover Book Soiree discussion with Ben Wittes and a short Science blog interview with Jen Golbeck. Susan Landau, The Real Security Risks of the iPhone Case, Science, Vol. 352, Issue 6292, June 17, 2016. Susan Landau, Testimony, Hearing on \"The Encryption Tightrope: Balancing Americans' Security and Privacy\", Judiciary Committee, United States House of Representatives, March 1. 2016. Harold Abelson, Ross Anderson, Steven M. Bellovin, Josh Benaloh, Matt Blaze, Whifield Diffie, John Gilmore, Matt Green, Susan Landau, Peter Neumann, Ronald L. Rivest, Jeffrey I. Schiller, Bruce Schneier, Michael A. Specter, and Daniel J. Weitzner, Keys under Doormats: Mandating insecurity by requiring government access to all data and communications, Journal of Cybersecurity, Vol. 1, 2015. Susan Landau, ``NSA and Dual EC_DRBG: Deja Vu All Over Again?,'' Mathematical Intelligencer, Vol. 37, Issue 4 (December 2015), 72-83. Susan Landau, Under the Radar: NSA's Efforts to Secure Private-Sector Telecommunications Infrastructure, Journal of National Security Law and Policy, Vol. 7, No.3 (2014), 411-442; one section, , was reprinted in Intelligence, translation by Junichi Hiramatsu, Vol. 15, March, 2015. Susan Landau, Making Sense of Snowden Part II: What's Significant in the NSA Surveillance Revelations , IEEE Security and Privacy, Vol. 12, No. 1, January/February 2014; a short version, Highlights from Making Sense of Snowden Part II: What's Significant in the NSA Surveillance Revelations, (behind payment wall) appeared in IEEE Security and Privacy, Vol. 12, No. 1, January/February 2014. Steven M. Bellovin, Matt Blaze, Sandy Clark, Susan Landau, Lawful Hacking: Using Existing Vulnerabilities for Wiretapping on the Internet, Northwestern Journal of Technology and Intellectual Property, Vol. 12, Issue 1 (2014). Susan Landau, Making Sense of Snowden: What's Significant in the NSA Surveillance Revelations , IEEE Security and Privacy, Vol. 11, No. 4, July/August 2013, 54-63. Steven M. Bellovin, Matt Blaze, Sandy Clark, and Susan Landau, Going Bright: Wiretapping without Weakening Communications Infrastructure, IEEE Security and Privacy, Vol. 11, No. 1, January/February 2013. [Cited in New York Times editorial, May 20, 2013.] Susan Landau, Testimony, Hearing on Going Dark: Lawful Electronic Surveillance in the Face of New Technologies, Subcommittee on Crime, Terrorism, and Homeland Security, Judiciary Committee, United States House of Representatives, February 17, 2011. Whitfield Diffie and Susan Landau, The Export of Cryptography in the 20th Century and the 21st, The History of Information Security: A Comprehensive Handbook, Karl De Leeuw and Jan Bergstra (eds.), Elsevier, 2007, 725-736. Originally appeared in Treichel, Jeanie and Mary Holzer (eds.), Sun Microsystems Laboratories: the First Ten Years, 2001. Sun Labs Tech Report 2001-102. A modified version of this paper, September 11th Did Not Change Cryptography Policy, appeared in the Notices of the American Mathematical Society, April 2002. Susan Landau, entries for \"Clipper and Capstone\"; \"cryptography\"; \"digital signatures,\" in William Staples, ed. Encyclopedia of Privacy, Greenwood Press, 2007. Susan Landau, Find Me a Hash, Notices of the American Mathematical Society, March 2006, 330-332; Mathematical Advance in Translation, Chinese Academy of Sciences, 3 (2010). Susan Landau, RSA and Public-Key Cryptography; Introduction to Cryptography; Cryptography: Theory and Practice; Algebraic Aspects of Cryptography; Elliptic Curves: Number Theory and Cryptography; Elliptic Curves in Cryptography; Modern Cryptography, Probabilistic Proofs, and Pseudorandomness; Foundations of Cryptography: Basic Tools; The Design of Rijndael: AES—the Advanced Encryption Standard; Handbook of Applied Cryptography, Bulletin of the American Mathematical Society, Vol. 41, No. 3 (2004), 357-367. Susan Landau, Polynomials in the Nation's Service: Using Algebra to Design the Advanced Encryption Standard, American Mathematical Monthly, February 2004. Whitfield Diffie and Susan Landau, September 11th Did Not Change Cryptography Policy, Notices of the American Mathematical Society, April 2002. Susan Landau, \"Cryptography.\" Computer Sciences, Ed., Roger R. Flynn. Vol. 4: Electronic Universe. New York: Macmillan Reference USA. Susan Landau, Advanced Encryption Standard Choice is Rijndael, Notices of the American Mathematical Society, Jan. 2001. Susan Landau, Communications Security for the Twenty-First Century: the Advanced Encryption Standard, Notices of the American Mathematical Society, April 2000, 450-459. Reprinted, in translation, in \"Surveys in Applied and Industrial Mathematics,\" TVP Publishers (Moscow), Vol. 7, No. 2 (2000). Susan Landau, Standing the Test of Time: the Data Encryption Standard, Notices of the American Mathematical Society, March 2000, 341-349. Reprinted, in translation, in \"Surveys in Applied and Industrial Mathematics,\" TVP Publishers (Moscow), Vol. 7, No. 2 (2000). Susan Landau, Designing Cryptography for the New Century, Communications of the Association for Computing Machinery, Vol. 43, No. 5, May 2000. Susan Landau, Cryptography in Crisis, Commentary (In My Opinion), Notices of the American Mathematical Society, April 1998. Whitfield Diffie and Susan Landau, Privacy on the Line: The Po",
  "content_length": 64968,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:19"
}