{
  "name": "Susanne Still",
  "homepage": "http://www2.hawaii.edu/~sstill",
  "status": "success",
  "content": "S. Still: Welcome Susanne Still Publications Selected research interests Short Bio Research Group Teaching and Service CV Contact Professor Department of Physics and Astronomy University of Hawaii at Mānoa Physics of Information Processing and Machine Learning Laboratory Cooperating Faculty Information and Computer Sciences Member Foundational Questions Institute (FQXi) Fellow European Center for Living Technology (ECLT) News (planned) 07/07-11/2025 Quantum Thermodynamics, Singapore. (planned) 03/10-21/2025 ICTP School on the Origins of Life, Behavior and Cognition, ICTP-SAIFR, São Paulo, Brazil. (planned) 02/28/2025 Dorian Daimer's PhD Defense. 07/10/2024 Seminar, University of Potsdam, Potsdam, Germany. 08/07-11/2023 Invited conference talk, Foundational Questions Institute, Yorkshire, England. 07/24-28/2023 Invited lectures, Mathematical Methods in Computational Neuroscience, Kavli Science Center, Eresfjord, Norway. 07/2023 Thomas Redford joins the group. 06/14/2023 Dorian Daimer passes Thesis proposal Oral Exam 03/05/2023 Invited tutorial, American Physical Society (APS) Topical Group on Statistical & Nonlinear Physics (GSNP) Short Course on Computational Modeling and Machine Learning, APS March Meeting, Las Vegas. 07/18-22/2022 Invited Keynote, ALIFE, virtually from Trento University, Italy. 06/14-17/2022 Invited conference talk, Stochastic Thermodynamics: Recent developments, ICTS, Bengaluru, India. 02/25/2022 Invited talk, Symposium on Entropy production, thermodynamic uncertainty, and dynamical control. Center for the Physics of Biological Function at at Princeton University and CUNY. 01/2022 Chris Haring joins the group. 09/27-30/2021 Invited conference talk, Models of Consciousness conference (MoCx2-2021) 7/1-2/2021 Invited conference talk, Physics of Emergent Behaviour III, Physics of Life Network, Imperial College (virtual conference). 5/17-21/2021 Invited conference talk, Workshop on Stochastic Thermodynamics, Santa Fe Institute (virtual conference). 4/19/2021 Princeton Biophysics Seminar. 4/13/2021 Invited talk, Center for Bits and Atoms, MIT. 10/2/2020 Invited conference talk, IBM Research Informational Lens Workshop. 08/2020 Dorian Daimer joins the group. 7/29/2020 Invited conference talk, Joint Structures and Common Foundations of Statistical Physics, Information Geometry and Inference for Learning, Les Houches School of Physics, France (remote talk). 2/6/2020 Thermodynamic Cost and Benefit of Memory, Phys. Rev. Lett. 124, 050601 1/29/2020 Invited conference talk, Combining information-theoretic perspectives on agency (CIPA), University of Tokyo, Japan (remote talk). Archive Mānoa Seminar Series on Physics of Information Processing",
  "content_length": 2696,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:29"
}