{
  "name": "Susanne Albers",
  "homepage": "http://www14.in.tum.de/personen/albers",
  "status": "success",
  "content": "Susanne Albers English | Deutsch Lehrstuhl für Algorithmen und KomplexitätPersonenSusanne Albers Home Aktuelles Personen Prof. Dr. Susanne Albers Lebenslauf Wissenschaftliche Ämter Forschung Publikationen Lehre Forschung Publikationen Projekte Kontakt Susanne Albers Email: albers@in.tum.de Telefon: +49-89-289-17702 Fax: +49-89-289-17707 Adresse: Lehrstuhl für Algorithmen und Komplexität Institut für Informatik Technische Universität München Boltzmannstr. 3 D-85748 Garching Raum: 03.09.054 Juli 2022: Jens Quedenfeld hat seine Promotion abgeschlossen. Juni 2022: Maximilian Janke hat seine Promotion abgeschlossen. March 2022: Alexander Eckl hat seine Promotion abgeschlossen. Juni 2021: Leon Ladewig hat seine Promotion abgeschlossen. Februar 2020: Susanne Albers ist Vorsitzende des Programmkomitees der SWAT 2020. Februar 2020: Susanne Albers ist eingeladene Sprecherin auf dem ACM India Annual Event. ESA/ALGO 2019 wird von Susanne Albers und ihrer Gruppe organisiert. Juli 2019: Susanne Albers ist Festrednerin der Tagung SIROCCO 2019, Italien. Mai 2019: Susanne Albers ist Festrednerin des Symposiums 50 Years Informatics Dezember 2017: Susanne Albers hält Festvortrag am Tag der Informatik, Absolventenfest der RWTH Aachen. April 2017: Neues DFG Graduiertenkolleg AdONE. Susanne Albers erhaelt ERC Advanced Grant. Pressemitteilung Bayerisches Staatsministerium f. Bildung u. Kultus, Wissenschaft u. Kunst. August 2016: Susanne Albers hält einen Plenarvortrag auf Euro-Par 2016, Grenoble. Susanne Albers, Nicole Megow und Andreas S. Schulz organisieren MAPSP 2017. Juni 2016: Susanne Albers hält einen eingeladenen Vortrag in der Akademie der Wissenschaften und der Literatur, Mainz. September 2015: Susanne Albers ist eingeladene Sprecherin auf dem MPI-INF – 25th Anniversary. Vortragende im Programm sind mehrere Turing-Preisträger, Leibniz-Preisträger, Humboldt-Preisträger und Gewinner von ERC Grants. Juni 2015: Susanne Albers hält einen Plenarvortrag auf dem 31st International Symposium on Computational Geometry (SOCG15), Eindhoven. Juni 2015: Susanne Albers ist eingeladene Sprecherin des Tutorials Network Creation Games: How Does the Internet Form?, organisiert von Erik D. Demaine (MIT) und MohammadTaghi Hajiaghayi (University of Maryland). 16th Conference on Electronic Commerce (EC15), Portland, Oregon. Lehrstuhl für Algorithmen und Komplexität Prof. Dr. Susanne Albers Boltzmannstr. 3 85748 Garching bei München Tel +89.289.17706 Fax +89.289.17707 E-Mail Aktuelles Impressum",
  "content_length": 2501,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:31"
}