{
  "name": "Sushil Prasad",
  "homepage": "http://www.cs.utsa.edu/~sprasad",
  "status": "success",
  "content": "Home - Dr. Sushil K. Prasad Dr. Sushil K. Prasad Professor of Computer Science and ACM Distinguished Scientist Former Program Director, Office of Advanced Cyberinfrastructure (CISE/OAC), National Science Foundation (NSF) Project Director, NSF/TCPP Curriculum Initiative on Parallel and Distributed Computing Former Chair, IEEE Computer Society Technical Committee on Parallel Processing (TCPP) Director, ParInt Lab University of Texas at San Antonio (UTSA) Email: sushil.prasad@utsa.edu Full CV Biographical Sketch: Sushil K. Prasad (BTechâ85 IIT Kharagpur, MSâ86 Washington State, Pullman; PhDâ90 Central Florida, Orlando - all in Computer Science/Engineering) is a Professor and Chair of Computer Science at The University of Texas at San Antonio and Director of Distributed and Mobile Systems (DiMoS) Lab. He was at Georgia State University (GSU) until 2019. He has carried out theoretical as well as experimental research in parallel and distributed computing, resulting in 150+ refereed publications, several patent applications, and about $3M in external research funds as principal investigator and over $6M overall (NSF/NIH/GRA/Industry). Sushil has been honored as an ACM Distinguished Scientist in Fall 2013 for his research on parallel data structures and applications. He was the elected chair of IEEE Technical Committee on Parallel Processing for two terms (2007-11), and received its highest honors in 2012 - IEEE TCPP Outstanding Service Award. Currently, he is leading the NSF/IEEE-TCPP curriculum initiative on parallel and distributed computing, in coordination with ACM/IEEE CS 2013 curriculum taskforce, with a vision to ensure that all computer science and engineering graduates are well-prepared in parallelism through their core courses in this era of multi- and many-cores desktops and handhelds. Over the last 25+ years, Sushil has researched on the parallel, distributed, and data intensive computing and systems. Over the past several years his group has explored data intensive computation on Geospatial datasets over cloud, multicore, and GPU, leading to a parallel GIS system for overlay computation over polygonal data on each of these platforms (using Azure API, MPI, Hadoop, and CUDA), and parallelized R-tree over GPUs, and several new algorithms and software systems including GPU-based spatial join. He has helped steer Georgia State Universityâs computer science program since 1990 from a small program to now an NRC-ranked PhD program in top 40-80. Sushil led an interdisciplinary team of nine faculty members and about two-dozen students from GSU and Georgia Tech on about $1M embedded software and mobile middleware research program during 2000-04 funded by Georgia Research Alliance (GRA), supervising a dedicated 6000 sq. ft. research facility, which helped seed the PhD program and recruit outstanding faculty, several with NSF CAREER awards. Sushil has been very active in the professional community, serving on the organizations of top conferences, on NSF and other review panels, on advisory committees of conferences and State of Georgia funding agency Yamacraw/GRA, and carrying out editorial activities of conference proceedings and journal special issues. Sushil has received invitations for talks from a variety of organizations nationally and internationally and for funded research visits internationally. In May 2007, he was conferred an Honorary Adjunct Professorship at University of New Brunswick, Canada, for his collaborative research on ACENET project to establish high performance computing infrastructures in Atlantic Canada. Sushil led the Office of Advanced Cyberinfrastructure (OAC) Learning and Workforce Development cluster during 2015-19, with a budget of about $18M, in coalescing its emerging research and education programs such as CAREER, CRII, and REU sites around translational, multidisciplinary research agenda, and helping develop two new programs, namely, CyberTraining and OAC Core research. OAC's research program has been in formative stage with transitions from independent OCI to ACI division within the CISE directorate, and recently to an office within CISE. With renewed focus and dissemination efforts, OAC had two to three times as many proposals for the aforementioned programs. Current Research Interests: Parallel, Distributed, and Data Intensive Computing and Software Systems: Data Intensive Computation over SpatioTemporal Datasets, Parallel Data Structures and Algorithms, Middleware and Collaborative Applications for Heterogeneous Mobile Devices, P2P Systems, Distributed Algorithms over Sensor Networks, Parallel Discrete Event Simulation, Web-based Distributed and Collaborative Computing and Workflows. © Sushil K. Prasad 2022",
  "content_length": 4735,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:32"
}