{
  "name": "Sushil J. Louis",
  "homepage": "https://www.cse.unr.edu/~sushil",
  "status": "success",
  "content": "Sushil J. Louis Research I work in Genetic Algorithms, Evolutionary Computing and their applications to Artificial Intelligence, Machine Learning, and Optimization. My current work investigates adaptive AI for RTS-games, interaction design for controlling large numbers of heterogenous, semi-autonomous entities, and generating real-time micro for game and real-world agents. The Evolutionary Computing Systems Lab (ECSL), which I direct, has investigated new techniques for machine learning using Case-Injected Genetic AlgoRithms (CIGAR), new techniques for playing to learn to play computer games, and new techniques for evolving Real-Time Strategy (RTS) game micro and macro . The Dept. of Computer Science offers a Minor in Digital Interactive Games. For those interested in games, simulations, and AI, I wrote a short document on games, their impact on society, and on our research at UNR. Three unofficial but useful links on the corona virus' status, information, and modeling Dashboard to track growth Information, misinformation, and great information Modeling the spread: what is happening, what should you do, when? We will now learn much more about artificial intelligence from developing computer-game players than we did from developing chess players. If you are a graduate student or want to be one, I am looking for graduate students interested in evolving Game AI for RTS games. Send email. Learn More I got my Ph.d. from the Department of Computer Science at Indiana University, Bloomington in 1993. My thesis (html) (and pdf ) advisor was Greg Rawlins. Others on my committee were Doug Hofstadter, Chris Haynes, and Esther Thelene. Projects Co-evolving multi-objective RTS micro Can we co-evolve cooperative team micro? Hellions versus Zealots in SC2 Read more Bridge Inspection Can we control robots to optimally inspect steel trusses? Bridge Inspection Read more NEAT RTS Can we evolve NEAT micro? Hellions versus Zealots in SC2 Read more Videos Coevolved micro in FastEcslent Navin Adhikari Take a look Bridge Inspection Siming Liu Take a look Neat Micro Aavaas Gajurel Take a look Contact Address: 1664 N. Virginia, Reno, NV, United States of America Phone: +1 775 784-4315 Fax: +1 775 783-1877 Email: sushil at cse dot unr dot edu Social Tech news || CSE IT || Ars Technica | Engadget | Gizmodo | Kotaku | Uncrate | Lifehacker | Jezebel | Register Based on © 2014 Basica Bootstrap HTML Template. By Vactual Art.",
  "content_length": 2435,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:30"
}