{
  "name": "Susmita Sur-Kolay",
  "homepage": "https://www.isical.ac.in/~ssk",
  "status": "success",
  "content": "Susmita Sur-Kolay Biography Education Experience Awards Publications Activities Contact: ACM Unit, Indian Statistical Institute 203, B. T. Road, Kolkata - 700108 INDIA. Email : ssk AT isical DOT ac DOT in Phone no.: (+91) (033) 2575-3005/3006 Brief Biography: Susmita Sur-Kolay received the B.Tech.(Hons.) degree in Electronics and Electrical Communications Engineering from Indian Institute of Technology Kharagpur and the Ph.D. degree in Computer Science and Engineering from Jadavpur University India. She has been a faculty member in the Advanced Computing and Microelectronics Unit of the Indian Statistical Institute, Kolkata, India since 1999 and is presently a Professor. During the period 1993-99, she was a Reader in the Department of Computer Science and Engineering of Jadavpur University. Prior to that, she was a post-doctoral fellow at University of Nebraska-Lincoln, and a Research Assistant at the Laboratory for Computer Science in Massachusetts Institute of Technology. She was also on sabbatical at Princeton University and Intel Corp., USA. Her research contributions are in the areas of algorithmic design automation for VLSI physical design, fault modeling and testing, synthesis of quantum computers, and graph algorithms. She has co-authored several technical papers in leading international journals and refereed conference proceedings, and a chapter in the Handbook on Algorithms for VLSI Physical Design Automation. She was the Technical Program Co-Chair of the 18th International Conference on VLSI Design (2005),the 11th Symposium on VLSI Design and Test (2007), ISVLSI 2011 and has served on the program committees of several international conferences. She has served on the editorial board of the IET Computers and Digital Techniques, and IEEE Transactions on VLSI Systems. She is a Distinguished Visitor of IEEE Computer Society (India), Senior Member of IEEE, Fellow of Indian National Academy of Engineering, Member of ACM, IET and VLSI Society of India. Among other awards, she was the recipient of the President of India Gold Medal (summa cum laude) at IIT Kharagpur (1980), IBM Faculty Award (2009), Distinguished Alumnus Award (2020), Women in Technology Leadership from VLSI Society of India 2022. Susmita Sur-Kolay Professor (Higher Academic Grade) Copyright © 2009. All Rights Reserved. Template from Free CSS Templates",
  "content_length": 2361,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:35"
}