{
  "name": "Susu Xu",
  "homepage": "http://susu-xu.com",
  "status": "success",
  "content": "Introduction Home About me Research Experiences Group Resources Introduction I am an assistant professor at Department of Civil and Systems Engineering and faculty member of Data Science and AI Institute at Johns Hopkins University. Before that, I was an assistant professor joint at the Department of Civil Engineering and the Department of Computer Science, Stony Brook University. I have been a Postdoctoral Research Fellow at Stanford University during 2020-2021, and a Machine Learning Researcher at Qualcomm AI research during 2019-2020. I received Ph.D. in Advanced Infrastructure Systems and M.S. in Machine Learning from Carnegie Mellon University in 2019, and Bachelor's degree from Tsinghua University in 2014. The foci of my research include multi-modal collaborative sensing, remote sensing, machine learning, smart infrastructure systems, and system resilience to extreme events. I am particularly interested in (1) incorporating multi-modal dedicated sensing data (e.g., remote sensing data) and crowdsourced data (social media data) for rapid emergency response and long-term community recovery; (2) collaborative sensing and spatio-temporal learning algorithms for smart and resilient infrastructure systems; (3) actuation/incentive mechanisms/control methods to improve efficiency of swarm robot networks for large-scale sensing and actuation. Target applications include near-real-time disaster information systems for natural hazards (earthquakes, hurricanes, wildfires), spatio-temporal urban sensing and data mining (air pollution, traffic, energy), large-scale infrastructure monitoring (buildings, bridges, and railway tracks). [Google Scholar], and [Github]. I'm currently looking for undergraduate researchers, graduate/Ph.D. students, postdocs, and visiting students in disaster information systems, remote sensing, statistical machine learning, and cyber-physical systems. Please feel free to contact me at susuxu at jhu dot edu.",
  "content_length": 1957,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:33"
}