{
  "name": "Sutanu Chakraborti",
  "homepage": "http://www.cse.iitm.ac.in/~sutanuc",
  "status": "success",
  "content": "Sutanu Chakraborti Sutanu Chakraborti I am a Professor at the Department of Computer Science and Engineering at IIT Madras. I am part of the Artificial Intelligence and Databases (AIDB) Lab in our department. My research interests are broadly in computational models of language, memory and learning. I offer four electives in these areas: Computational Models of Cognition (CMC), Natural Language Processing (NLP), Memory Based Reasoning in AI (MBR) and Introduction to Machine Learning (IML). Prof. Deepak Khemani, Dr. Ravindran Balaraman and Dr. Ashish Tendulkar teach (or have taught in the past) part of MBR, NLP and ML courses with me. A Note for Students: I do not have any open internship positions now. Sorry about this, but I may not be able to respond individually to requests for internships in our lab.   Research Questions   Educational Background   Research Scholars and Students   Teaching Experience   Industry Research Experience   Publications   Beyond Academics   Contact Research Questions Here are some fairly open-ended questions that drive my research. I am not equally active on all of these, but I wish I were. I have also been involved in shorter term problems, some derived out of these long term challenges, and some others which are independently motivated. How can we build real world applications that can help big organizations make best use of the wealth of wisdom hidden in their unstructured data repositories (project documentations, proposals, white papers, user groups, blogs, research reports, employee feedback, resumes)? Can machines reasoning over unstructured text learn by introspecting over failures? Instead of working hard at solving problems end to end, can they seek our help intelligently at times? How best can we exploit the complementary abilities of humans and machines in building conversational problem solvers? This may need us to take a broader look at systems, the way they represent knowledge to enable transparency and interpretability, the way they interact with us (user interfaces and visualizations) and the way they facilitate learning and evolution - ours and theirs. Yet another challenge is to estimating complexity of tasks so that we can effectively involve humans to examine hard cases and provide feedback, which can be used by the system for introspective learning. I walk into a camera store, see the products on display and finally turn to the assistant to help me finalize my choice. In course of my chat with her, my model of the world of cameras evolves, and her model of my requirements evolves. How can the design of recommender systems benefit from a better understanding of the how these models (should) co-evolve? How do language and memory interact? Even before you read an assassination report in your morning newspaper, you would have glossed through the news heading and begun anticipating the questions the report aims at answering (Who killed whom? Where? How? Why? What is unique about the manner in which the crime is committed?) Can we build cognitive/computational models that model learning through interaction of memory and language? How can different sources of knowledge (statistical, background, linguistic) integrate to facilitate better text analysis over tasks like classification or question answering? I see this line of work deriving inspiration from cognitive studies on humor. I believe jokes illustrate beautifully what goes wrong when we fail to combine the knowledge sources appropriately. How can knowledge mined from text be represented at various levels of abstraction (general through specific)? How can a system identify which level is appropriate for a task? A classification task may need knowledge at a very different level of abstraction, when compared to a question answering task which may need a very high level of granularity. Also, when we talk to novices, we use level of abstraction very different from the one we use when we talk to experts. So the problem of choosing the right level of representation is as important to generation (NLG) as it is to understanding (NLU). Educational Background Degree Year University / Institute Specialization Ph. D. 2004-2007 The Robert Gordon University, Aberdeen, U.K. Computer Science M.S. (by Research) 2002-2004 Indian Institute of Technology, Madras Computer Science and Engineering B.E. (Hons.) 1994-1998 Regional Engineering College (now NIT), Rourkela Applied Electronics and Instrumentation Engineering Prior to my engineering education, I did my schooling at Holy Cross School, Agartala (high school) and Shishu Bihar School, Agartala (higher secondary school). I was state topper in the ICSE exam, and stood second in state in the Higher Secondary Examination. Students and Research Scholars PhD (completed): Deepak Padmanabhan (external scholar from IBM IRL, jointly with Prof. Deepak Khemani), Ditty Mathew, Swapnil Hingmire (external scholar from TRDDC, Pune), PhD (submitted thesis): Devi G., PhD (ongoing): Anbarasu, Ashika Naidu (external scholar from CAIR, Bangalore, jointly with Prof. P Sreenivasa Kumar), Adwait Parsodkar M.S. (completed): Anil Patelia, Saurabh Gupta (winner of Biswajit Sain Best MS thesis award) , Bibekananda Kundu (external, CDAC Kolkata), Debarun Kar (jointly with Prof. B. Ravindran), Bhautik Patel (jointly with Dr. Ashish Tendulkar), Shubhranshu Shekhar (jointly with Prof. Deepak Khemani), Abhijit Sahoo, Ayesha S., Shashank Srivastava (jointly with Dr. Mitesh Khapra), Neha Dubey (jointly with Prof. Deepak Khemani), Nitin Gupta (primarily supervised by Prof. Sukhendu Das), MS (ongoing): Arup Das, Srashti Kaurav Mtech, Dual Degree and Btech Students : To be updated Teaching Experience In addition to the four elective courses mentioned, I have taught Principles of Communication, an undergraduate level core course comprising introduction to signals and systems, probability theory and random processes, and information theory. I also taught an undergraduate core course introducing Computing (largely C programming) to first year students. Industry Research Experience Approximately 7 years at Tata Research Development and Design Centre as a scientist (and later as project leader of a Case-Based Reasoning Research Team). Publications List of Publications Beyond Academics Once upon a time, I wished I could write poems. Here is one attempt. Book of Life My book of life gets written Every passing day By things I couldn't do Words I couldn't say. The undone and the unsaid A silent life do share Where the said and the done Seek meaning in despair. I can feel it not so quite, I can hear it not so clear; How my deal for days to come, Their silent life does steer. That indeed is silence within, That indeed is joy profound; The book is written all over, And the author never found. Contact Room No. BSB 304 Department of Computer Science and Engineering IIT Madras, Chennai 600 036 Email: sutanuc AT cse DOT iitm DOT ac DOT in (alternately sutanuc AT iitm DOT ac DOT in)",
  "content_length": 6999,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:34"
}