{
  "name": "Suzanne Embury",
  "homepage": "http://www.cs.man.ac.uk/~embury",
  "status": "success",
  "content": "Suzanne Embury's Home Page Go to main content | contact the university | help | You are here: Computer Science > ~embury University home Suzanne Embury Home Publications Research Projects Research Students Teaching Administration Contact Details School of Computer Science Intranet Suzanne Embury's Home Page I'm a Reader in the Department of Computer Science at Manchester University. I previously worked as a lecturer in the Department of Computer Science at Cardiff University. Prior to that, I worked as a Research Fellow at Aberdeen University, where I also gained my PhD. I graduated from the University of Kent at Canterbury with a BSc in Computer Science in 1990. I am a member of the Information Management Research Group. My main area of interest is in the evolution of data-intensive systems - systems in which multiple software applications must cooperate in the management and use of large amounts of persistent data. Amongst other things, I am currently fascinated by behaviour driven development (especially as linked with the management of data or business rules), the problems caused by poor data quality, end-user-oriented techniques for low-cast, fast data integration, and in the evolution of data semantics in the form of business rules. Verification of correct program behaviour after change is another major strand of my work. For details of my publications, check my DBLP entry. Research Projects I am currently running or working on the following projects: The RoboTA Continuous Feedback and Marking project, supported by the Institute of Coding at Manchester. KTP with Heat Trace Ltd UK, using BDD principles to safely migrate business rules in a mission critical software system. SOURCERY: User Driven Multi-Criteria Source Selection Red Green Go!: a coaching game for teaching TDD Data Journeys: a lightweight methodology for making go/no go decisions on software development in complex organisations SEED: an Eclipse plug-in for identifying and refactoring smells in Cucumber feature sets. miniRECH: a checklist for improving methods reporting quality in scientific publications I also worked on the following completed projects, in various capacities: DSToolkit: On-Demand Data Integration: Dataspaces by Refinement QuASAR: Quality Assurance for Semantic Annotations for Web Services Qurator: Describing the Quality of Curated E-Science Information Resources ISPIDER: In Silico Proteome Integrated Data Environment Resource Data-Oriented Testing: a Toolkit for Testing Database Applications BRULEE: Business RULe Extraction and Exploitation. LITCHI: Logic-Based Integration of Taxonomic Conflicts in Heterogeneous Information Sources. CONSNET: the UK Constraints Network. KRAFT: Knowledge Reuse and Fusion/Transformation. P/FDM: The Prolog/Functional Data Model Database System. Research Students I am currently supervising the following research students: Leonard Peter Binamungu (Detecting and Correcting Duplication in BDD Specifications) - co-supervised by Nikos Konstantinou. Nurzety Binti Ahmad Azuan (Pay-As-You-Go Approaches to Information Quality) - co-supervised by Norman Paton. Mariam Alqasab (Amplifying Data Curation Efforts in Linked Open Data) - co-supervised by Sandra Sampaio. Anthony Higginson (Data Migration in the Cloud) - co-supervised by Norman Paton. Iliada Eleftheriou (Barriers to Data Movement in Large, Complex Organisations) - co-supervised by Andy Brass. Past students who have now graduated: Ruhaila Maskat (PhD in Pay-As-You-Go Approaches to Information Integration in the Life Sciences) - co-supervised by Norman Paton. Ravinder Singh (MPhil in Semantic Annotation of Web Services by Probing) - co-supervised by Sean Bechofer. Nurul Emran (PhD, Definition and Analysis of Population-Based Data Completeness Measurement) - co-supervised by Paolo Missier. Qiuwei Yu (MPhil, Provenance Publication in e-Science) - co-supervised by Carole Goble. Paolo Missier (PhD, Modelling and Computing the Quality of Information in e-Science). Paolo's thesis was runner-up in the 2008 BCS Distinguished Dissertation competition. It was also received the ICIQ 2009 Ballou Pazer Best Dissertation Award David Willmor (PhD, An Intensional Approach to the Specification of Test Cases for Database Systems). Liwen Lin (PhD, Evolution of Business Rules) - co-supervised by Brian Warboys. Binling Jin (PhD, Non-Intrusive Assessment of Organisational Data Quality - DLOIS). Nic J. Caine (PhD, LOIS - the Lights Out Integrity Subsystem) - co-supervised by W. Alex Gray, of Cardiff University. I'm always happy to be contacted by potential research students wanting to work on aspects of agile software development, test-driven development, software change, data quality or business rules. It is sometimes possible for funding to be obtained locally for promising candidates. Teaching I teach the following course units: COMP33711: Agile Software Engineering COMP23311: Software Engineering I Contact Details Suzanne M. Embury School of Computer Science University of Manchester Oxford Road Manchester M13 9PL United Kingdom Room number: Kilburn Building 2.105 email: Suzanne.Embury@manchester.ac.uk Tel: +44 161 275 6128 Fax: +44 161 275 6204 Return to top of page",
  "content_length": 5203,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:40"
}