{
  "name": "Suzanne M. Shontz",
  "homepage": "http://people.eecs.ku.edu/~shontz",
  "status": "success",
  "content": "Suzanne M. Shontz Dr. Suzanne M. Shontz Associate Dean for Graduate and Online Education, School of Engineering Professor, Department of Electrical Engineering and Computer Science Professor, Department of Mechanical Engineering Director, Computational Bioengineering Track, Bioengineering Program Director, Mathematical Methods in Interdisciplinary Computing Center, Information Sciences Institute University of Kansas Contact information: Engineering Administration The University of Kansas 1520 West 15th Street 1 Eaton Hall Lawrence, KS 66045 Administrative Office: 1C Eaton Hall EECS Faculty Office: 3016 Eaton Hall I2S Researcher Office: 203 Nichols Hall E-mail address: shontz@ku.edu Phone: 785-864-8816 Curriculum Vitae: [PDF] (Updated on 9/16/25.) Biography Suzanne Shontz received her Ph.D. in applied mathematics from Cornell University in 2005. She received her B.A. in mathematics and B.S. in chemistry from the University of Northern Iowa in 1999 and her M.S. degrees in computer science and applied mathematics from Cornell University in 2002. Prior to joining The University of Kansas in August 2014, she was on the faculty at Mississippi State and The Pennsylvania State University. Previously, Dr. Shontz was a postdoctoral associate in the Department of Computer Science and Engineering and a Minnesota Supercomputing Institute Research Scholar at the University of Minnesota. Professor Shontz is the recipient of a 2011 NSF Presidential Early CAREER Award (NSF PECASE Award) from the White House for her 2010 NSF CAREER Project on parallel dynamic meshing algorithms, theory, and software for simulation-assisted medical interventions. NSF recently featured Prof. Shontz's research in this video. The citation for Dr. Shontz's NSF PECASE Award is as follows: Suzanne M, Shontz of Pennsylvania State University \"For exemplary research in computational and data-enabled science and engineering that bridges applied mathematics, computer science, and scientific applications, and for contributions to education, including new curricula and approaches that encourage diversity in this emerging field.\" Photos from the PECASE Ceremonies. Top row, left to right: Dr. Shontz receiving her NSF PECASE Award; Dr. Shontz with NSF OCI CAREER Program Director, Gabrielle Allen, and Future NSF OCI CAREER Program Director, Daniel Katz; Dr. Shontz on the White House steps after meeting with President Obama and the 95 other PECASE Awardees. Bottom row: President Barack Obama addresses 2011 Presidential Early Career Awards for Scientists and Engineers (PECASE) recipients in the East Room of the White House, July 31, 2012. (Official White House Photo by Pete Souza). Prof. Shontz received the International Meshing Roundtable Fellow Award in 2021; the award recognizes an individual with a distinguished record of research accomplishments in the field of Mesh Generation and exceptional service to the meshing community. The same year, she received the School of Engineering Miller Professional Award for Service from the University of Kansas. In 2017, she received the Young Alumnus Award from the University of Northern Iowa in 2017; the award recognizes alumni who have demonstrated success early in their career (age 40 and under) and who has been active in the life of the university. In 2016, she received the Miller Scholar Award at the University of Kansas; the award is for for research excellence, including a DURIP award for high-performance computing and visualization instrumentation. She received a Big 12 Faculty Fellowship in 2015 which enabled her to collaborate with faculty at Iowa State University on a computational materials science project. In 2012, Prof. Shontz was selected as the December 2012/January 2013 College of Arts and Sciences Researcher of the Month at Mississippi State University. In 2009, she received an Office of Naval Research Summer Faculty Fellowship for her research in computational materials science. In 2007, she was selected as the Computer Engineering Faculty Marshall for the Spring Commencement exercises at Penn State. Prof. Shontz received a National Physical Science Consortium Fellowship from 1999-2004 and an Honorable Mention for the Alice T. Schafer Prize for Women in Mathematics in 1999. Prof. Shontz has presented her research at several international and national venues. Selected recent presentations include plenary talks at the 2023 International Conference on Adaptive Modeling and Simulation in Gothenburg, Sweden; the 2021 International Meshing Roundtable, a virtual event, and the 2018 International Symposium on Isogeometric Analysis and Mesh Generation in Dalian, China. She has also given invited presentations on her research at the University of California - Santa Barbara, Texas Tech University, the Politecnico di Milano (Italy), the Scuola Internazionale Superiore di Studi Avanzati (Italy), the Universidade da Coruna (Spain), and the Universita della Svizzera italiana (Switzerland). Research Professor Shontz's research interests lie in the area of parallel scientific computing. In particular, her research focuses on the development of unstructured meshing and numerical optimization algorithms and their applications to computational medicine, imaging sciences, materials, radar, acoustics, and electronic circuits, among others. Recent projects have included the design of efficient algorithms for high-order mesh generation, parallel meshing, dynamic mesh generation, mesh optimization, mesh untangling, and mesh adaptation for applications ranging from medical devices to elasticity to solid mechanics. Other recent projects have involved the development of optimization algorithms for effective generation of computational meshes and model order reduction techniques to reduce electronic circuit networks for use in circuit simulations. Click here for results of my NSF CDS&E project (2018-2021). Click here for results of my NSF CISE project (2017-2021). Click here for results of my NSF CAREER project (2011-2017). Click here for recent publications. Research Group and Collaborators Sumit Kumar (Postdoc, The University of Kansas; joining in early Fall 2025) Moein Moradi (Ph.D. Student, Mechanical Engineering, The University of Kansas) Christina Hymer (Ph.D. Student, Bioengineering, The University of Kansas) Lily Gray (Ph.D. Student, Computer Science, The University of Kansas) Zhihui Qi (Visiting Ph.D. Student, Computer Science, Dalian University of Technology, China) Alumni Dr. Sayaka Akioka (Visiting Scholar, Full Professor, Meiji University, Tokyo, Japan) Dr. Aruquia Barbosa Matos Peixoto (Visiting Faculty from Centro Federal de Educacao Tecnologica Celso Suckow da Fonseca (CEFET/RJ), Brazil; Information and Telecommunication Technology Center, The University of Kansas) Dr. Maurin Alberto Lopez Varilla (Postdoctoral Researcher, Information and Telecommunication Technology Center, The University of Kansas; September 2015-December 2016) Lexi Simar (Ph.D. in Bioengineering, The University of Kansas; August 2025; co-advised with Eduardo Rosa-Molinar. First position: TBD.) Mikala Heon (Ph.D. in Bioengineering, The University of Kansas; August 2025; co-advised with Eduardo Rosa-Molinar. First position: TBD.) Fariba Mohammadi (Ph.D. in Mechanical Engineering, The University of Kansas; December 2022; Co-advised with Ken Fischer; First position: Postdoc at the University of Michigan) Michael Stees (Ph.D. in Computer Science, The University of Kansas; May 2020; First position: Postdoc at Los Alamos National Laboratory) Thap Panitanarak (Ph.D. in Computer Science and Engineering, The Pennsylvania State University; August 2017. Co-advised with Kamesh Madduri.) Jibum Kim (Ph.D. in Computer Science and Engineering, The Pennsylvania State University; December 2012; First position: Postdoc at Los Alamos National Laboratory) Shankar Prasad Sastry (Ph.D. in Computer Science and Engineering, The Pennsylvania State University; August 2012; First position: Postdoc at the Scientific Computing and Imaging Institute at the University of Utah) Jonathan Rogers (M.S. in Computer Science, The University of Kansas; August 2023; Co-advised with Adam Rouse, Department of Neurosurgery, University of Kansas Medical Center. First position: Ph.D. student in Computer Science at The University of Kansas.) Brian Wentz (M.S. in Bioengineering, The University of Kansas; May 2021.) Kenneth Czuprynski (Co-advised with John Fahnline (ARL); M.S. in Computer Science and Engineering, The Pennsylvania State University; May 2012; First position: Ph.D. student in Applied Mathematics at the University of Iowa) Dragos Mihai (\"Mike\") Nistor (M.S. in Computer Science and Engineering, B.S. Honors in Computer Science and Statistics, The Pennsylvania State University; May 2012; First position: Mathworks) Malek Kchaou (B.S. Student, Computer Science, The University of Kansas) Leo Cabezas Amigo (B.S. Student, Computer Engineering, The University of Kansas) Abir Haque (B.S. in Computer Science, The University of Kansas; May 2025. First position: Ph.D. student in Computational Science and Engineering, Georgia Tech.) Taylor Slade (B.S. in Interdisciplinary Computing with Biology, The University of Kansas; May 2025. First position: Nursing student.) Suhaan Syed (B.S. in Computer Science, The University of Kansas; May 2025. First position: Industry.) Gabriella (Gabi) Kruger (B.S. in Interdisciplinary Computing with Biology, The University of Kansas; May 2024. First position: Analytical Associate Scientist, MilliporeSigma) Isaac Lee (B.S. in Computer Science, The University of Kansas; May 2024.) Henry Williams (B.S. in Computer Science, The University of Kansas; May 2022. First position: Software developer at Tradebot.) Rodrigo Figueroa Justiniano (B.S. Student, Computer Science and Mathematics, The University of Kansas) Zachary Misic (B.S. Student, Interdisciplinary Computing - Biology, The University of Kansas). Myra Dotzel (B.S. Student, Computer Science and Mathematics, Minor: Vis",
  "content_length": 15205,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:37"
}