{
  "name": "Svein-Olaf Hvasshovd",
  "homepage": "https://www.ntnu.edu/employees/sophus",
  "status": "success",
  "content": "Svein-Olaf Hvasshovd - NTNU Svein-Olaf Hvasshovd Download press photo Download press photo Foto: Close Svein-Olaf Hvasshovd Tilknyttet/affiliated sophus@ntnu.no +4773590770 IT-bygget, 210, Gløshaugen, Sem Sælands vei 9 Publications 2019 Fuchs, Boris; Sørheim, Kristin; Chincarini, Matteo; Brunberg, Emma; Stubsjøen, Solveig Marie; Bratbergsengen, Kjell. (2019) Heart rate sensor validation and seasonal and diurnal variation of body temperature and heart rate in domestic sheep. Veterinary and Animal Science Academic article 2018 Ekseth, Ole Kristian; Hvasshovd, Svein-Olaf. (2018) An Empirical Study of Strategies Boosts Performance of Mutual Information Similarity. Lecture Notes in Computer Science (LNCS) Academic article 2017 Ekseth, Ole Kristian; Hvasshovd, Svein-Olaf. (2017) A new database for drug-discovery address key-issues in mining of knowledge. CEUR Workshop Proceedings Academic article 2008 Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Main-Memory Commit Processing: The Impact of Priorities. Lecture Notes in Computer Science (LNCS) Academic article Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Efficient Execution of Small (Single-Tuple) Transactions in Main-Memory Databases. Lecture Notes in Computer Science (LNCS) Academic article Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Main Memory Commit Protocols for Multiple Backups. Academic chapter/article/Conference paper Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Efficient High-Availability Commit Processing. Academic chapter/article/Conference paper 2007 Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2007) Preventing Orphan Requests by Integrating Replication and Transactions. Lecture Notes in Computer Science (LNCS) Academic article Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2007) Performance of Main Memory Commit Protocols. Institutt for datateknikk og informasjonsvitenskap Institutt for datateknikk og informasjonsvitenskap Report Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2007) The Circular Two-Phase Commit Protocol. Lecture Notes in Computer Science (LNCS) Academic article 2006 Løland, Jørgen; Hvasshovd, Svein-Olaf. (2006) Online, Non-Blocking Relational Schema Changes. Lecture Notes in Computer Science (LNCS) Academic article Løland, Jørgen; Hvasshovd, Svein-Olaf. (2006) Non-Blocking Materialized View Creation and Transformation of Schemas. Lecture Notes in Computer Science (LNCS) Academic article Løland, Jørgen; Hvasshovd, Svein-Olaf. (2006) Non-blocking Creation of Derived Tables. Academic chapter/article/Conference paper 2005 Zhu, Feng; Sun, Xiaowei; Salzberg, Betty; Hvasshovd, Svein-Olaf. (2005) Supporting Load Balancing and Efficient Reorganization During System Scaling. Academic chapter/article/Conference paper 1999 Sabaratnam, Maitrayi; Torbjørnsen, Øystein; Hvasshovd, Svein-Olaf. (1999) Evaluating the Effectiveness of Fault Tolerance in Replicated Database Management Systems. Fault Tolerant Computing : annual international symposium Academic article Sabaratnam, Maitrayi; Torbjørnsen, Øystein; Hvasshovd, Svein-Olaf. (1999) Cost of Ensuring Safety in Distributed Database Management Systems. IEEE Pacific Rim International Symposium on Dependable Computing (PRDC) Academic article Journal publications Fuchs, Boris; Sørheim, Kristin; Chincarini, Matteo; Brunberg, Emma; Stubsjøen, Solveig Marie; Bratbergsengen, Kjell. (2019) Heart rate sensor validation and seasonal and diurnal variation of body temperature and heart rate in domestic sheep. Veterinary and Animal Science Academic article Ekseth, Ole Kristian; Hvasshovd, Svein-Olaf. (2018) An Empirical Study of Strategies Boosts Performance of Mutual Information Similarity. Lecture Notes in Computer Science (LNCS) Academic article Ekseth, Ole Kristian; Hvasshovd, Svein-Olaf. (2017) A new database for drug-discovery address key-issues in mining of knowledge. CEUR Workshop Proceedings Academic article Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Main-Memory Commit Processing: The Impact of Priorities. Lecture Notes in Computer Science (LNCS) Academic article Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Efficient Execution of Small (Single-Tuple) Transactions in Main-Memory Databases. Lecture Notes in Computer Science (LNCS) Academic article Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2007) Preventing Orphan Requests by Integrating Replication and Transactions. Lecture Notes in Computer Science (LNCS) Academic article Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2007) The Circular Two-Phase Commit Protocol. Lecture Notes in Computer Science (LNCS) Academic article Løland, Jørgen; Hvasshovd, Svein-Olaf. (2006) Online, Non-Blocking Relational Schema Changes. Lecture Notes in Computer Science (LNCS) Academic article Løland, Jørgen; Hvasshovd, Svein-Olaf. (2006) Non-Blocking Materialized View Creation and Transformation of Schemas. Lecture Notes in Computer Science (LNCS) Academic article Sabaratnam, Maitrayi; Torbjørnsen, Øystein; Hvasshovd, Svein-Olaf. (1999) Evaluating the Effectiveness of Fault Tolerance in Replicated Database Management Systems. Fault Tolerant Computing : annual international symposium Academic article Sabaratnam, Maitrayi; Torbjørnsen, Øystein; Hvasshovd, Svein-Olaf. (1999) Cost of Ensuring Safety in Distributed Database Management Systems. IEEE Pacific Rim International Symposium on Dependable Computing (PRDC) Academic article Part of book/report Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Main Memory Commit Protocols for Multiple Backups. Academic chapter/article/Conference paper Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2008) Efficient High-Availability Commit Processing. Academic chapter/article/Conference paper Løland, Jørgen; Hvasshovd, Svein-Olaf. (2006) Non-blocking Creation of Derived Tables. Academic chapter/article/Conference paper Zhu, Feng; Sun, Xiaowei; Salzberg, Betty; Hvasshovd, Svein-Olaf. (2005) Supporting Load Balancing and Efficient Reorganization During System Scaling. Academic chapter/article/Conference paper Report Kolltveit, Heine; Hvasshovd, Svein-Olaf. (2007) Performance of Main Memory Commit Protocols. Institutt for datateknikk og informasjonsvitenskap Institutt for datateknikk og informasjonsvitenskap Report Outreach 2018 Academic lecture Grøva, Lise; Fuchs, Boris; Brunberg, Emma; Lande, Unni Støbet; Sørheim, Kristin; Hvasshovd, Svein-Olaf. (2018) SENSOR TECHNOLOGY TO DETECT TICK-BORNE FEVER IN SHEEP ON RANGE PASTURES. NJF conference 2018 , Kaunas, Litauen 2018-06-26 - 2018-06-29 Academic lecture Grøva, Lise; Fuchs, Boris; Brunberg, Emma; Lande, Unni Støbet; Sørheim, Kristin; Hvasshovd, Svein-Olaf. (2018) Sensor technology to detect tick-borne fever in sheep on range pastures. 20th Meeting of the FAO-CIHEAM Mountain Pasture , Lofoten 2018-09-09 - 2018-09-12 2017 Poster Fuchs, Boris; Sørheim, Kristin; Chincarini, Mattheo; Bjarnason, Asgeir; Brunberg, Emma; Stubsjøen, Solveig S.. (2017) Heart Rate Logging In Free-Ranging Mammals. The 12th International Mammalogical Congress , Perth 2017-07-09 - 2017-07-14 1997 Academic lecture Humborstad, Rune; Sabaratnam, Maitrayi; Hvasshovd, Svein-Olaf; Torbjørnsen, Øystein. (1997) 1-safe algorithms for symmetric site configurations. 23rd International Conference on Very Large Data Bases , Athen",
  "content_length": 7224,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:39"
}