{
  "name": "Svein Erik Bratsberg",
  "homepage": "https://www.ntnu.edu/employees/sveinbra",
  "status": "success",
  "content": "Svein Erik Bratsberg - NTNU Svein Erik Bratsberg Download press photo Download press photo Foto: Close Svein Erik Bratsberg Professor, databases and distributed systems Department of Computer Science Faculty of Information Technology and Electrical Engineering sveinbra@ntnu.no +4773550382 +4799539963 Kontor 307, IT-bygget, Sem Sælands veg 9, Gløshaugen Twitter About Professor at NTNU/IDI since aug 2001 in distributed systems with focus on databases and search engines. Previously employed in Clustra which developed highly available, scalable real-time databases. In the years 2007-14 I worked on the SFI iAD - information access disruptions, where Microsoft was the centre leader. This was work on next generation search engines, where the focus at NTNU was on scalabale indexes and structured queries. The research focus now is on velocity in Big data. I am currently involved with the SFU Excited Excited SFU - NTNU My courses are the following: TDT4145 Data modeling and database management systems (500 students) TDT4225 Very large, distributed data volumes (200 students) TDT02 Advanced, distributed systems (15 students) Publications 2017 Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2017) Entity Linking in Queries: Efficiency vs. Effectiveness. Lecture Notes in Computer Science (LNCS) Academic article Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2017) Dynamic Factual Summaries for Entity Cards. Academic chapter/article/Conference paper Hasibi, Faegheh; Nikolaev, Fedor; Xiong, Chenyan; Balog, Krisztian; Bratsberg, Svein Erik; Kotov, Alexander. (2017) DBpedia-Entity v2: A Test Collection for Entity Search. Academic chapter/article/Conference paper 2016 Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2016) On the Reproducibility of the TAGME Entity Linking System. Lecture Notes in Computer Science (LNCS) Academic article Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2016) Exploiting Entity Linking in Queries for Entity Retrieval. Academic chapter/article/Conference paper 2015 Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2015) Entity Linking in Queries: Tasks and Evaluation. Academic chapter/article/Conference paper 2014 Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2014) A greedy algorithm for finding sets of entity linking interpretations in queries. Academic chapter/article/Conference paper 2013 Jonassen, Simon; Bratsberg, Svein Erik. (2013) Improving the performance of pipelined query processing with skipping—and its comparison to document-wise partitioning. World wide web (Bussum) Academic article 2012 Jonassen, Simon; Bratsberg, Svein Erik. (2012) Improving the Performance of Pipelined Query Processing with Skipping. Lecture Notes in Computer Science (LNCS) Academic article Jonassen, Simon; Bratsberg, Svein Erik. (2012) Intra-Query Concurrent Pipelined Processing for Distributed Full-Text Retrieval. Lecture Notes in Computer Science (LNCS) Academic article Bratsberg, Svein Erik; Hetland, Magnus Lie. (2012) Dynamic optimization of queries in pivot-based indexing. Multimedia Tools and Applications Academic article 2011 Jonassen, Simon; Bratsberg, Svein Erik. (2011) Efficient Compressed Inverted Index Skipping for Disjunctive Text-Queries. Lecture Notes in Computer Science (LNCS) Academic article 2010 Jonassen, Simon; Bratsberg, Svein Erik. (2010) A Combined Semi-Pipelined Query Processing Architecture for Distributed Full-Text Retrieval. Lecture Notes in Computer Science (LNCS) Academic article 2009 Jonassen, Simon; Bratsberg, Svein Erik. (2009) Impact of the Query Model and System Settings on Performance of Distributed Inverted Indexes. Academic chapter/article/Conference paper 2001 Bratsberg, Svein Erik. (2001) Online Scaling in a Highly Available Database. Academic chapter/article/Conference paper Journal publications Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2017) Entity Linking in Queries: Efficiency vs. Effectiveness. Lecture Notes in Computer Science (LNCS) Academic article Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2016) On the Reproducibility of the TAGME Entity Linking System. Lecture Notes in Computer Science (LNCS) Academic article Jonassen, Simon; Bratsberg, Svein Erik. (2013) Improving the performance of pipelined query processing with skipping—and its comparison to document-wise partitioning. World wide web (Bussum) Academic article Jonassen, Simon; Bratsberg, Svein Erik. (2012) Improving the Performance of Pipelined Query Processing with Skipping. Lecture Notes in Computer Science (LNCS) Academic article Jonassen, Simon; Bratsberg, Svein Erik. (2012) Intra-Query Concurrent Pipelined Processing for Distributed Full-Text Retrieval. Lecture Notes in Computer Science (LNCS) Academic article Bratsberg, Svein Erik; Hetland, Magnus Lie. (2012) Dynamic optimization of queries in pivot-based indexing. Multimedia Tools and Applications Academic article Jonassen, Simon; Bratsberg, Svein Erik. (2011) Efficient Compressed Inverted Index Skipping for Disjunctive Text-Queries. Lecture Notes in Computer Science (LNCS) Academic article Jonassen, Simon; Bratsberg, Svein Erik. (2010) A Combined Semi-Pipelined Query Processing Architecture for Distributed Full-Text Retrieval. Lecture Notes in Computer Science (LNCS) Academic article Part of book/report Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2017) Dynamic Factual Summaries for Entity Cards. Academic chapter/article/Conference paper Hasibi, Faegheh; Nikolaev, Fedor; Xiong, Chenyan; Balog, Krisztian; Bratsberg, Svein Erik; Kotov, Alexander. (2017) DBpedia-Entity v2: A Test Collection for Entity Search. Academic chapter/article/Conference paper Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2016) Exploiting Entity Linking in Queries for Entity Retrieval. Academic chapter/article/Conference paper Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2015) Entity Linking in Queries: Tasks and Evaluation. Academic chapter/article/Conference paper Hasibi, Faegheh; Balog, Krisztian; Bratsberg, Svein Erik. (2014) A greedy algorithm for finding sets of entity linking interpretations in queries. Academic chapter/article/Conference paper Jonassen, Simon; Bratsberg, Svein Erik. (2009) Impact of the Query Model and System Settings on Performance of Distributed Inverted Indexes. Academic chapter/article/Conference paper Bratsberg, Svein Erik. (2001) Online Scaling in a Highly Available Database. Academic chapter/article/Conference paper Teaching Courses TDT4225 - Very Large, Distributed Data Volumes TDT4145 - Data Modelling, Databases and Database Management Systems Outreach 2014 Lecture Hasibi, Faegheh; Bratsberg, Svein Erik. (2014) Non-hierarchical Structures: How to Model and Index Overlaps?. Balisage: The markup Conference , Washington, DC, USA 2014-08-05 - 2014-08-08 2012 Academic lecture Stålhane, Tor; Midtstraum, Roger; Bratsberg, Svein Erik. (2012) Course Improvement the TQM way. NIK 2012 , Bodø 2012-11-19 - 2012-11-21 2011 Academic lecture Jonassen, Simon; Bratsberg, Svein Erik. (2011) Efficient Compressed Inverted Index Skipping for Disjunctive Text-Queries. The 33RD European Conference On Information Retrieval (ECIR 2011) , Dublin 2011-04-18 - 2011-04-21 2010 Academic lecture Jonassen, Simon; Bratsberg, Svein Erik. (2010) A Combined Semi-Pipelined Query Processing Architecture for Distributed Full-Text Retrieval. The 11th International Conference on Web Information Systems Engineering (WISE 2010) , Hong Kong 2010-12-12 - 2010-12-14 2004 Academic lecture Bratsberg, Svein Erik. (2004) Scaling a Highly-Available DBMS beyond a Dozen Nodes. Norsk informatikkonferanse 2004 , Stavanger 2004-11-29 - 2004-12-01 1993 Academic lecture Bratsberg, Svein Erik. (1993) Transparent evolution and integration of classes in object-oriented databases. Norsk informatikk konferanse (1993 : Halden) , [Mangler data] Academic lecture Bratsberg, Svein Erik. (1993) Integrating independently developed classes. International Workshop on Distributed Object Management (1992 : Edmonton) , [Mangler data]",
  "content_length": 8105,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:40"
}