{
  "name": "Sven Nahnsen",
  "homepage": "https://uni-tuebingen.de/forschung/forschungsinfrastruktur/zentrum-fuer-quantitative-biologie-qbic/team/prof-dr-sven-nahnsen",
  "status": "success",
  "content": "QBiC Zum Inhalt springen Welcome to the Quantitative Biology Center TÜBINGEN // Our Vision What We Do The Quantitative Biology Center provides a one-stop-shop for access to high-throughput technologies in the life sciences and the required bioinformatics analysis.We assist you in the planning of your projects, realize them together with our member labs, annotate and integrate your data in our easy-to-use web-based services and smart data solutions. As a bioinformatics core facility, we provide advanced data analysis techniques to help you achieve your project goals. // Our Service What We Offer Project Management We guide you from finding a suitable design to data analysis of your project. Data Generation Our extensive partner lab network will provide you with a multi-dimensional perspective on your sample. Data Management We take care of your data and help you to comply to scientific standards. Bioinformatic Services We provide data analysis support, ranging from basic to project tailored statistical analysis. Long-Term Accessibility We provide you with a sustainable storage infrastructure that guarantees the availability of your data over years. Watch video // EVENTS Workshop: Reducing Carbon Emissions in Large-Scale Computational Data Analysis When: November 25–26, 2025Where: Humboldt University BerlinOfficial event website The workshop is organized by the DFG Collaborative Research Center FONDA (Foundations of Workflows for Large-Scale Scientific Data Analysis) in collaboration with QBiC. It will bring together experts from computational science, bioinformatics, and sustainability research to present their work, exchange ideas, and explore strategies for making scientific computing more energy-efficient and environmentally responsible.The event will take place in a hybrid format – both in person and online. Further details, including the agenda and registration form, are available on the official event website. // Partner Facilities Our Partners Center for Plant Molecular Biology NGS Competence Center Proteome Center Tübingen Core Facility for Medical Proteomics The Natural and Medical Sciences Institute Reutlingen Max-Planck-Institute for Biology Tübingen Flow Cytometric Core Facility // Contact Us Need More Information? Name E-Mail Message Data consent You agree that your data will be used to process your request. Further information and revocation instructions can be found in the data protection declaration. Send",
  "content_length": 2463,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:49"
}