{
  "name": "Sven Tomforde",
  "homepage": "https://www.ins.informatik.uni-kiel.de/en/team",
  "status": "success",
  "content": "Intelligente Systeme Technische Systeme sollen immer mehr Aufgaben selbstständig und zuverlässig übernehmen. Sie sollen möglichst im Hintergrund agieren, dem Menschen dienen und intelligente Entscheidungen treffen. Dabei geht es vor allem darum, auf unbekannte Situationen angemessen zu reagieren oder Dienstleistungen auch unter stark gestörten Bedingungen zu erbringen. Aufgaben, zu deren Lösung der Mensch seine Kreativität einsetzt. Die Arbeitsgruppe „Intelligente Systeme“ der Christian-Albrechts-Universität zu Kiel entwickelt Ansätze und Verfahren, die technische Systeme in die Lage versetzen, auch ohne menschliche Kreativität angemessene und immer bessere Antworten auf Herausforderungen zu finden. © Sven Tomforde, Arbeitsgruppe Intelligente SystemeUnsere Arbeit basiert auf der Beherrschung komplexer Systeme der Informations- und Kommunikationstechnologie (IKT) und der Lösung konkreter Probleme. Unsere Arbeit stützt sich daher auf eine breite Palette von Anwendungen:Verkehrssteuerung und -managementDatenkommunikationsnetzeZukünftige dezentrale Energiesysteme / Smart GridInternet der DingeÜberwachungsnetzeIntelligente GeräteWas ist ein intelligentes System?Wir definieren den Begriff „Intelligentes System“ wie folgt: „Ein intelligentes System ist ein Computersystem, das ein bestimmtes Leistungsniveau erreicht oder beibehält, auch wenn es in einer sich mit der Zeit verändernden Umgebung arbeitet und Störungen oder neuen Situationen ausgesetzt ist. Ein solches intelligentes System ist selbstadaptiv und verbessert sein Verhalten mit der Zeit.Dies setzt insbesondere voraus, dass technische Systeme über Mechanismen des autonomen Lernens verfügen, d.h. über Methoden des selbstständigen, opportunistischen Lernens ohne (oder mit nur minimalem) Eingriff des menschlichen Nutzers und mit nur minimalem Vorwissen zur Entwurfszeit. Prof. Dr.-Ing. Sven TomfordeSven.Tomforde@informatik.uni-kiel.de+49 431 880-4844Hermann-Rodewald-Straße 324118 KielRaum: 307a (HRS 3) © Sven Tomforde, Arbeitsgruppe Intelligente SystemeArchitekturen Intelligenter SystemeVerlagerung von Entwurfsentscheidungen in die Systeme und zur LaufzeitIntegration von Techniken des maschinellen Lernens, Sicherheitskonzepten und SelbstorganisationsmusternVernetzte Systemstrukturen und Selbstintegrationsprozesse autonomer (Teil-)Systeme © Sven Tomforde, Arbeitsgruppe Intelligente SystemeTechniken zur Angriffserkennung und Bewertung von auffälligem VerhaltenMethoden zum Aufbau von technischem Vertrauen zwischen autonomen TeilsystemenVertrauensbasierte Organisation von SystemenMethoden zur Erkennung gegenseitiger BeeinflussungseffekteSicherheitsorientierte Kommunikationsprotokolle und Selbstorganisationsmodelle © Sven Tomforde, Arbeitsgruppe Intelligente SystemeQuantifizierung von Systemeigenschaften, d.h. Metriken für Selbstorganisation, Adaptivität, Emergenz etc.Modellierung der Wahrnehmung eines technischen Systems auf Basis von SensordatenDatenaufbereitung, -analyse und -verarbeitung zur LaufzeitErkennen wechselseitiger Beeinflussungseffekte und deren Berücksichtigung in Lern- und Entscheidungsprozessen © Sven Tomforde, Arbeitsgruppe Intelligente SystemeMethoden des Lernens zur Laufzeit ohne/mit sehr geringer externer Steuerung (durch den Benutzer)Verstärkungslernen (Lernen durch Feedback, Vergleich von Beobachtung und Erwartung) auf der Basis von NutzenfunktionenAnomalie-ErkennungTransfer-LernenAktives Lernen (aktives Abfragen von Wissen bei Orakeln), selbständige Bewertung von vorhandenem Wissen Forschungsthemen und -projekte ForschungForschung Lehrveranstaltungen, AbschlussarbeitenLehre Veröffentlichungen der ArbeitsgruppePublikationenPublikationen Mitglieder der ArbeitsgruppeTeamTeam Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 4239,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:58"
}