{
  "name": "Sven Apel",
  "homepage": "https://www.se.cs.uni-saarland.de/apel",
  "status": "success",
  "content": "Sven Apel, Professor, Saarland University Sven Apel, Prof. Dr. Professor of Computer Science Chair of Software Engineering Director of the Saarbrücken Graduate School of Computer Science Saarland Informatics Campus Saarland University Coordinates Saarland University Chair of Software Engineering Building E1.1, Room 2.11Phone: +49 681 302 57211 66123 Saarbrücken, GermanyE-Mail: Please activate Javascript Curriculum vitae, short bio, DBLP, Google Scholar, ACM, ORCiD, Bluesky News Our new CACM article \"The Silent Scientist: When Software Research Fails to Reach Its Audience\" is out! It comes with a very nice video! Research A key vision driving my research is to empower software engineering practice to enter an era of intensive automation. I develop and evaluate methods, tools, and theories for the construction and analysis of efficient, reliable, maintainable, and configurable software systems. In this endeavor, I pay special attention to the human factor and interdisciplinary research questions. In particular, I am interested in: Software variability and configuration AI-based program generation and optimization Socio-technical software analysis Empirical and neurophysiological methods I apply my research results routinely to real-world software systems and projects from various domains, both from the open-source realm or in collaborations with partners from industry, such as Siemens AG, Bosch Engineering, and Airbus Helicopters. Awards & Honors ERC Advanced Grant “Brains On Code” ASE Fellow ACM Distinguished Member for Outstanding Scientific Contributions to Computing Hugo Junkers Award for Research and Innovation, awarded by the State of Saxony-Anhalt Appointment to the Young Academy of Europe Heisenberg Professorship of the German Research Foundation Emmy-Noether Fellowship of the German Research Foundation Award of the University of Magdeburg and the Karin-Witte Foundation for the Best Doctoral Dissertation 2007 Software-Engineering Award of the Ernst-Denert Foundation for the Best Doctoral Dissertation 2007 Award of the School of Computer Science, University of Magdeburg for Outstanding Scientific Achievements 2006 Most Influential Paper Awards @ SPLC'19, ICPC'22, GPCE'23 ACM SIGSOFT Distinguished Paper Awards @ ICSE'15, ICSE'21 Best Paper Awards @ SPLC'11, Modularity'15, Academy of Management'18 Distinguished Reviewer Awards @ ASE'18, ICSE'24, FSE'24 Grants & Projects Brains On Code (ERC Advanced Grant, 2 500 000 Euro, 2022–2027) CPEC (DFG, TRR 248, Principal Investigator, Projects C2 & E3, 2022–2026) Congruence (DFG, 620 000 Euro, 2020–2024) Pervolution (DFG, 520 000 Euro, 2017–2024) ExaStencils (DFG, SPP 1648, 510 000 Euro, 2013–2018) SafeSPL++ (DFG, Heisenberg Program, 660 000 Euro, 2013–2018) Pythia (DFG, SPP 1593, 700 000 Euro, 2012–2017) FeatureOpt (FFG, 100 000 Euro, 2015–2018) SafeSPL (DFG, Emmy-Noether Program, 1 300 000 Euro, 2010–2015) MapReduceFoundation (DFG, 160 000 Euro, 2011–2013) FeatureFoundation (DFG, 320 000 Euro, 2009–2013) Service(complete list) Program Committees: ASE'25 (Area Chair), FSE'24, ICSE'24 Selected Publications(complete list) Youssef Abdelsalam, Norman Peitek, Anna-Maria Maurer, Mariya Toneva, and Sven Apel. Are Humans and LLMs Confused by the Same Code? An Empirical Study on Fixation-Related Potentials and LLM Perplexity. In Proceedings of the International Conference on Software Engineering (ICSE). ACM, April 2026. Johannes Dorn, Stefan Mühlbauer, Stefan Jahns, Sven Apel, and Norbert Siegmund. Bayesian Multi-Level Performance Models for Multi-Factor Variability of Configurable Software Systems. In Proceedings of the International Conference on Software Engineering (ICSE). ACM, April 2026. To appear. Alina Mailach, Janet Siegmund, Sven Apel, and Norbert Siegmund. Views on Internal and External Validity in Empirical Software Engineering: 10 Years Later and Beyond. In Proceedings of the International Conference on Software Engineering (ICSE). ACM, April 2026. To appear. Annabelle Bergum, Norman Peitek, Maurice Rekrut, Janet Siegmund, and Sven Apel. On the Influence of the Baseline in Neuroimaging Experiments on Program Comprehension. ACM Transactions on Software Engineering and Methodology (TOSEM), 2025. To appear. Alisa Welter, Niklas Schneider, Tobias Dick, Kallistos Weis, Christof Tinnes, Marvin Wyrich, and Sven Apel. An Empirical Study of Knowledge Transfer in AI Pair Programming. In Proceedings of the International Conference on Automated Software Engineering (ASE). IEEE, November 2025. Acceptance rate: 22% (245 / 1136); to appear. Marvin Wyrich, Christof Tinnes, Sebastian Baltes, and Sven Apel. The Silent Scientist: When Software Research Fails to Reach Its Audience. Communications of the ACM (CACM), 68(11):24–27, October 2025. Max Weber, Alina Mailach, Sven Apel, Janet Siegmund, Raimund Dachselt, and Norbert Siegmund. Understanding Debugging as Episodes: A Case Study on Performance Bugs in Configurable Software Systems. In Proceedings of the ACM on Software Engineering, Volume 2, Issue: ACM International Conference on the Foundations of Software Engineering (FSE), pages 1409–1431. ACM, June 2025. Acceptance rate: 22% (135 / 612). Roman Haas, Michael Sailer, Mitchell Joblin, Elmar Jürgens, and Sven Apel. Prioritizing Test Gaps by Risk in Industrial Practice: An Automated Approach and Multimethod Study. IEEE Transactions on Software Engineering (TSE), 51(5):1554–1568, May 2025. Ruchit Rawal, Victor-Alexandru Pădurean, Sven Apel, Adish Singla, and Mariya Toneva. Hints Help Finding and Fixing Bugs Differently in Python and Text-based Program Representations. In Proceedings of the International Conference on Software Engineering (ICSE), pages 1230–1242. IEEE, April 2025. Acceptance rate: 21% (245 / 1150). Christof Tinnes, Alisa Welter, and Sven Apel. Software Model Evolution with Large Language Models: Experiments on Simulated, Public, and Industrial Datasets. In Proceedings of the International Conference on Software Engineering (ICSE), pages 950–962. IEEE, April 2025. Acceptance rate: 21% (245 / 1150). Kallistos Weis, Leopoldo Motta Teixeira, Clemens Dubslaff, and Sven Apel. Blackbox Observability of Features and Feature Interactions. In Proceedings of the International Conference on Automated Software Engineering (ASE), pages 1120–1132. ACM, October 2024. Acceptance rate: 27% (155 / 568). Roman Haas, Raphael Nömmer, Elmar Jürgens, and Sven Apel. Optimization of Automated and Manual Software Tests in Industrial Practice: A Survey and Historical Analysis. IEEE Transactions on Software Engineering (TSE), 50(8):2005–2020, August 2024. Clemens Dubslaff, Kallistos Weis, Christel Baier, and Sven Apel. Feature Causality. Journal of Systems and Software (JSS), 209(3):111915, March 2024. Thomas Bock, Nils Alznauer, Mitchell Joblin, and Sven Apel. Automatic Core-Developer Identification on GitHub: A Validation Study. ACM Transactions on Software Engineering and Methodology (TOSEM), 32(6):138, November 2023. Florian Sattler, Sebastian Böhm, Philipp Schubert, Norbert Siegmund, and Sven Apel. SEAL: Integrating Program Analysis and Repository Mining. ACM Transactions on Software Engineering and Methodology (TOSEM), 32(5):121, September 2023. Mitchell Joblin, Barbara Eckl-Ganser, Thomas Bock, Angelika Schmid, Janet Siegmund, and Sven Apel. Hierarchical and Hybrid Organizational Structures in Open-Source Software Projects: A Longitudinal Study. ACM Transactions on Software Engineering and Methodology (TOSEM), 32(4):86, July 2023. Stefan Mühlbauer, Florian Sattler, Christian Kaltenecker, Johannes Dorn, Sven Apel, and Norbert Siegmund. Analyzing the Impact of Workloads on Modeling the Performance of Configurable Software Systems. In Proceedings of the International Conference on Software Engineering (ICSE), pages 2085–2097. IEEE, May 2023. Acceptance rate: 26% (209 / 796). Max Weber, Christian Kaltenecker, Florian Sattler, Sven Apel, and Norbert Siegmund. Twins or False Friends? A Study on Energy Consumption and Performance of Configurable Software. In Proceedings of the International Conference on Software Engineering (ICSE), pages 2098–2110. IEEE, May 2023. Acceptance rate: 26% (209 / 796). Johannes Dorn, Sven Apel, and Norbert Siegmund. Mastering Uncertainty in Performance Estimations of Configurable Software Systems. Empirical Software Engineering (EMSE), 28(2):33, January 2023. Gustavo do Vale, Claus Hunsen, Eduardo Figueiredo, and Sven Apel. Challenges of Resolving Merge Conflicts: A Mining and Survey Study. IEEE Transactions on Software Engineering (TSE), 48(12):4964–4985, December 2022. Norman Peitek, Annabelle Bergum, Maurice Rekrut, Jonas Mucke, Matthias Nadig, Chris Parnin, Janet Siegmund, and Sven Apel. Correlates of Programmer Efficacy and their Link to Experience: A Combined EEG and Eye-Tracking Study. In Proceedings of the ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), pages 120–131. ACM, November 2022. Acceptance rate: 22% (99 / 449). Georg Seibt, Florian Heck, Guilherme Cavalcanti, Paulo Borba, and Sven Apel. Leveraging Structure in Software Merge: An Empirical Study. IEEE Transactions on Software Engineering (TSE), 48(11):4590–4610, November 2022. Wolfgang Mauerer, Mitchell Joblin, Damian Tamburri, Carlos Paradis, Rick Kazman, and Sven Apel. In Search of Socio-Technical Congruence: A Large-Scale Longitudinal Study. IEEE Transactions on Software Engineering (TSE), 48(8):3159–3184, August 2022. Mitchell Joblin and Sven Apel. How Do Successful and Failed Projects Differ? A Socio-Technical Analysis. ACM Transactions on Software Engineering and Methodology (TOSEM), 31(4):67, July 2022. Sven Apel, Christian Kästner, and Eunsuk Kang. Feature Interactions on Steroids: On the Composition of ML Models. IEEE Software, 39(3):120–124, May 2022. Clemens Dubslaff, Kallistos Weis, Christel Baier, and Sven Apel. Causality in Configurable Software Systems. In Proceedings of the International Conference on Software",
  "content_length": 31467,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:40"
}