{
  "name": "Sven Strickroth",
  "homepage": "https://www.tel.ifi.lmu.de/team/professor/sven-strickroth",
  "status": "success",
  "content": "Sven Strickroth - Professur für Technology Enhanced Learning (deutsch) - LMU München Links und Funktionen www.lmu.de LMU-Portal Institut für Informatik Sitemap Navigationspfad Startseite Team Professor Sven Strickroth Hauptnavigation Team Professor Sven Strickroth Mitarbeitende Sekretariat Studium und Lehre Forschung Publikationen Software Kontakt drucken Inhaltsbereich Prof. Dr. Sven Strickroth Extraordinarius Kontakt Ludwig-Maximilians-Universität MünchenInstitut für InformatikLehr- und Forschungseinheit für Programmierung und KIOettingenstraße 67D-80538 München Raum: E110 Telefon: +49-89-2180-9300 Fax: +49-89-2180-999300 E-Mail: sven.strickroth@ifi.lmu.de Sprechstunde: nach Vereinbarung Sven Strickroth studierte von 2006 bis 2011 Informatik an der TU Clausthal. Als Teil der Forschungsgruppe \"Didaktik der Informatik/Informatik und Gesellschaft\" an der Humboldt-Universität zu Berlin wurde er 2016 mit seiner Dissertation über die Konzeption und Evaluation eines Unterrichtsplanungssystems zum Dr. rer. nat. promoviert. Im Anschluss arbeitete er als Postdoc an der Universität Potsdam bei der Professur \"Komplexe Multimediale Anwendungsarchitekturen\", wo er ein uni-weites E-Learning Projekt koordinierte. Seit Oktober 2020 hat er die Professur für \"Technology-Enhanced Learning\" an der LMU München inne und ist Leiter der Gruppe der Lehramtsausbildung. Weiterhin ist Prof. Strickroth Mitglied im Programmkomitee verschiedener wissenschaftlicher Konferenzen sowie Workshops, Mitinitiator des Workshops \"Automatische Bewertung von Programmieraufgaben\", Mitglied im Expertise Team \"Digital Learning\" des Munich Center of the Learning Sciences und ist Nachwuchsverantwortlicher im Leitungsgremium der Fachgruppe Bildungstechnologien GI e.V.. Weitere Informationen Sie erreichen mich derzeit am besten per E-Mail. Bitte versuchen Sie keine langen E-Mails zu schreiben und zeitkritische Punkte bereits am Beginn der E-Mail anzubringen. Publications ORCID (Publications): https://orcid.org/0000-0002-9647-300X Research interests Technology-Enhanced Learning/Educational Technologies E-Assessment Computer-Supported Collaborative Learning Learning Analytics Current Teaching (Co-)Chair Bildungstechnologie-Konferenz der Fachgruppe Bildungstechnologien der GI (DELFI): 2025 Special Session “Learning Analytics in Engineering Education” (LAEE2021) auf der WEEF-GEDC 2021 Workshop „Automatische Bewertung von Programmieraufgaben“ (ABP2025) Workshop „Automatische Bewertung von Programmieraufgaben“ (ABP2023) Workshop „Automatische Bewertung von Programmieraufgaben“ (ABP2021) Workshop „Software Engineering für E-Learning-Systeme“ (SEELS2021) Workshop „Automatische Bewertung von Programmieraufgaben“ (ABP2019) Workshop „Software Engineering für E-Learning-Systeme“ (SEELS2018) Workshop „Automatische Bewertung von Programmieraufgaben“ (ABP2017) Workshop „Audience Response Systems“ (ARS2017) Program Committee/Reviewer Bildungstechnologie-Konferenz der Fachgruppe Bildungstechnologien der GI (DELFI): 2017–2025 CHI-LBW: 2023 DELFI-Workshop „Learning Analytics“: 2019, 2023 DELFI-Workshop „Nuts & Bolts of Educational Research Projects“: 2021–2024 DELFI-Workshop VR-AR-Learning: 2021–2023 CSEE&T: 2024 GMW: 2019-2021 Internationale Tagung Wirtschaftsinformatik (WI): 2013; Associate Editor: 2021 ITiCSE: 2022–2025 (APC since 2025) ICETC: 2023 ICL: 2024 SIGCSE TS: 2024–2025 Special Session “Games in Engineering Education (GinEE)” auf der ICL (International Conference on Interactive Collaborative Learning): 2021–2023 Tagung „Junges Forum für Medien und Hochschulentwicklung“ (JFMH) 2021, 2023 WEEF-GEDC 2021 (World Engineering Education Forum International Federation of Engineering Education Societies The Global Engineering Deans Council) Workshop „Automatische Bewertung von Programmieraufgaben“ (ABP): 2013, 2015, 2017, 2019, 2023, 2025 World Learning Summit/Learning Innovations and Quality (WLS/LINQ): 2017 diverse Journals, darunter: IJAIED, iJEP, JCAL, IJERP, Medienpädagogik (medienpaed), eleed, Frontiers, Computer Science Education (CSE), Transactions on Computing Education (TOCE) Promotionen Dr. rer. nat. (Amy) Yanhong Li: \"Tangible User Interfaces to Support Collaborative Learning\" drucken nach oben Fußzeile Impressum Datenschutzerklärung Kontakt Barrierefreiheit",
  "content_length": 4285,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:48"
}