{
  "name": "Sven Overhage",
  "homepage": "https://www.uni-bamberg.de/iis/mitarbeiter/overhage",
  "status": "success",
  "content": "Prof. Dr. Sven Overhage - Lehrstuhl für Wirtschaftsinformatik, insbesondere Industrielle Informationssysteme Prof. Dr. Sven Overhage Zur Person Sven Overhage ist Universitätsprofessor und Inhaber des Lehrstuhls für Wirtschaftsinformatik, insbesondere Industrielle Informationssysteme an der Fakultät Wirtschaftsinformatik und Angewandte Informatik der Otto-Friedrich-Universität Bamberg. Er studierte Wirtschaftsinformatik an der Technischen Universität Darmstadt. Anschließend promovierte und habilitierte er an der Wirtschaftswissenschaftlichen Fakultät der Universität Augsburg. Vor seinem Ruf an die Universität Bamberg hat er dort die W3-Professur für Betriebswirtschaftslehre, insb. Wirtschaftsinformatik und Systems Engineering vertreten. Darüber hinaus war er Lehrbeauftragter an der Technischen Universität Darmstadt und der Universität Liechtenstein. Sven Overhage ist Autor über 75 wissenschaftlicher Veröffentlichungen, die in Fachzeitschriften (u.a. DSS, IEEE TEM, BISE, EM), Konferenzbänden (u.a. ICIS, ECIS, WI) und Sammelwerken erschienen sind. Praktische Erfahrungen sammelte er in zahlreichen Projekten mit der Wirtschaft, die er im Zuge seiner Tätigkeit an der Universität oder als selbständiger Berater durchführte. Forschungsinteressen Der Tätigkeitsschwerpunkt von Sven Overhage liegt auf der Erforschung und Evaluierung innovativer Methoden für die Gestaltung, Entwicklung und den Betrieb Industrieller Informationssysteme. Zu seinen Forschungsinteressen gehören insbesondere serviceorientierte Entwicklungsmethoden, agile Vorgehensmodelle, Methoden der Advanced Analytics, Ansätze zur Geschäftsprozessmodellierung sowie Ansätze für das Management der digitalen Transformation. Funktionen und Ämter Vorsitzender des Ständigen Promotionsausschusses der Fakultät WIAI Vertrauensdozent der Bayerischen EliteAkademieVormals Prodekan der Fakultät WIAI Mitglied des Fakultätsrats der Fakultät WIAI Studiengangsbeauftragter für den Masterstudiengang Wirtschaftspädagogik-WI Studiengangsbeauftragter für den Bachelorstudiengang Wirtschaftsinformatik Studiengangsbeauftragter für den Masterstudiengang Wirtschaftsinformatik Kapazitätsbeauftragter der Fakultät WIAI Vorsitzender des Prüfungsausschusses für die Studiengänge WI, IISM und WiPäd-WI Vorsitzender der Zulassungskommission für die Masterstudiengänge WI, IISM und WiPäd-WI Mitglied des Prüfungsausschusses für die Studiengänge WI, IISM und WiPäd-WI BAföG-Beauftragter der Fakultät WIAI Auszeichnungen / Nominierungen Best Reviewer Award der Internationalen Tagung Wirtschaftsinformatik (WI) 2015 Best Paper Award der Fachtagung Modellierung betrieblicher Informationssysteme (MobIS) 2008 Nominierung für den GI-Dissertationspreis 2006 Best Paper Award der Internationalen Tagung Wirtschaftsinformatik (WI) 2005 Zweiter Platz beim Microsoft XML Web Service Wettbewerb (Deutschland) 2002 Ausgewählte Veröffentlichungen Klicken Sie hier, um eine Liste aller Veröffentlichungen anzuzeigen.Raab, M.; Schlauderer, S.; Overhage, S.; Friedrich, T.: More than a Feeling: Investigating the Contagious Effect of Facial Emotional Expressions on Investment Decisions in Reward-Based Crowdfunding. In: Decision Support Systems 135 (2020).Friedrich, T.; Schlauderer, S.; Overhage, S.: The Impact of Social Commerce Feature Richness on Website Stickiness Through Cognitive and Affective Factors: An Experimental Study. In: Electronic Commerce Research and Applications 36 (2019).Schlauderer, S.; Overhage, S.: BoSDL: An Approach to Describe the Business Logic of Software Services in Domain-Specific Terms. In: Business & Information Systems Engineering 60 (2018) 5, S. 393-413.Weidinger, J.; Schlauderer, S.; Overhage, S.: Is the Frontier Shifting into the Right Direction? A Qualitative Analysis of Acceptance Factors for Novel Firefighter Information Technologies. In: Information Systems Frontiers 20 (2018) 4, S. 669-692.Overhage, S.; Birkmeier, D.; Schlauderer, S.: Quality Marks, Metrics, and Measurement Procedures for Business Process Models: The 3QM-Framework. In: Business & Information Systems Engineering 4 (2012) 5, S. 229-246. Kontaktdaten Mail an Sven OverhageTelefon: +49 951 863 2910 Telefax: +49 951 863 2710 Raum: WE5 / 04.042Adresse: An der Weberei 5 96047 BambergSprechzeiten: Donnerstag, 13 - 14 Uhr (Anmeldung im Sekretariat) Externe Profile Google ScholarResearchGateDBLPORCIDXingLinkedIn",
  "content_length": 4370,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:45"
}