{
  "name": "Sven Behnke",
  "homepage": "http://www.ais.uni-bonn.de/behnke",
  "status": "success",
  "content": "University of Bonn, Computer Science VI, Autonomous Intelligent Systems Home Persons Teaching Research Publications News Jobs Prof. Dr. Sven Behnke - Head of Computer Science Department VI - Intelligent Systems and Robotics - Head of Autonomous Intelligent Systems Group - PI and Area Chair Embodied AI of Lamarr Institute for Machine Learning and Artificial Intelligence- Fellow of European Laboratory for Learning and Intelligent Systems (ELLIS) - Founding Member of Center for Robotics Address: Prof. Dr. Sven Behnke University of  Bonn Computer Science Institute VI Friedrich-Hirzebruch-Allee 8 53115 Bonn Tel: +49 (0) 228 73-4116 Fax: +49 (0) 228 73-4425 Email: behnke _at_ cs.uni-bonn.de Office: 0.046 Google Scholar Profile Short CV Prof. Dr. Sven Behnke holds since 2008 the chair for Autonomous Intelligent Systems at the University of Bonn and heads the Computer Science Institute VI – Intelligent Systems and Robotics. He graduated in 1997 from Martin-Luther-Universität Halle-Wittenberg (Dipl.-Inform.) and received his doctorate in computer science (Dr. rer. nat.) from Freie Universität Berlin in 2002. In his dissertation \"Hierarchical Neural Networks for Image Interpretation\" he extended forward deep learning models to recurrent models for visual perception. In 2003 he did postdoctoral research on robust speech recognition at the International Computer Science Institute in Berkeley, CA. In 2004-2008 Professor Behnke led the Emmy Noether Junior Research Group \"Humanoid Robots\" at Albert-Ludwigs-Universität Freiburg. His research interests include cognitive robotics, computer vision, and machine learning. Prof. Behnke received several Best Paper Awards, three Amazon Research Awards (2018-20), a Google Faculty Research Award (2019), and the Ralf-Dahrendorf- Prize of BMBF for the European Research Area (2019). His team NimbRo has won numerous robot competitions (RoboCup Humanoid Soccer, RoboCup@Home, MBZIRC, ANA Avatar XPRIZE). A list of his program committee memberships, meeting organizations, and invited talks can be found here. Selected Projects 2024-2028: BMBF project \"Robotics Institute Germany (RIG)\", coordinator of University of Bonn subproject 2024-2026: BMBF project \"UMDenken: Supportive monitoring of turntable ladder operations for firefighting using IR images\", sub-project \"Autonomous flying robot for firefighting support\" 2023-2026: KAIST project \"Immersive Televisualization\" 2022-2025: BMBF project \"WestAI – Service Center for Artificial Intelligence\" 2022-2026: BMBF project \"Autonomous flying robot swarms for real-time situational awareness\" 2022-2028: The Lamarr Institute for Machine Learning and Artificial Intelligence, principal investigator 2021-2025: BMBF project \"BNTrAinee: Bonn Transdisciplinary Education in Artificial Intelligence\" 2021-2025: BMBF project \"RimA: Roboter im Alltag (Robots in Everyday Environments)\" 2021-2025: BMBF/ANR project \"Learn2Grasp: Learning Human-like Interactive Grasping based on Visual and Haptic Feedback\" 2021-2022: European H2020 FSTP project \"EUROBENCH – EUropean ROBotic framework for bipedal locomotion bENCHmarking\" 2021-2023 DFG Research Unit 2535 “Anticipating Human Behaviour”, projects “Semantic Video Prediction\" and \"Anticipative Human-Robot Collaboration\" 2019-2025: DFG Cluster of Excellence “PhenoRob–Robotics and Phenotyping for Sustainable Crop Production”, principal investigator, co-lead of Core Project 1: “In-field 4D Crop Reconstruction” 2020-2022: BMBF Competence Center “Machine Learning Rhine-Ruhr (ML2R)”, project \"Self-Supervised Learning of Structured Visual Representations\" 2018-2022: BMBF Competence Center “German Center for Rescue Robots”, project „Autonomous Assistance Functions for Flying Robots” 2020-2021: Fraunhofer project \"Collaborative Perception and Prediction with Smart Edge Sensors\" 2020-2021: Amazon Research Award project “Learning Structured Scene Modeling and Physics-based Prediction” 2019-2020: Google Faculty Research Award project “Collaborative Perception using Smart Edge Sensors” 2019-2020: Amazon Research Award project “Generalizing Scene Parsing for Cluttered Bin Picking” 2018-2020: Khalifa University project “Mohamed Bin Zayed International Robotics Challenge (MBZIRC)” 2017-2020: DFG Research Unit 2535 “Anticipating Human Behaviour”, projects “Learning Hierarchical Representations for Anticipative Human-Robot Collaboration” and “Activity Prediction at Varying Timescales” 2016-2020: DFG project “Automatic Reconstruction of Plant Root Systems from MRI” 2017-2019: Korea Research Institute of Standards and Science (KRISS) project “Development of the Artificial Electronic Skin that Mimics Human Skin Structure and Functions for Tactile and Kinesthetic Feedback in Robotic Surgery or Prosthetic Arms” 2018-2019: Amazon Research Award project “Learning Scene Parsing for Cluttered Bin Picking” 2016-2017: Khalifa University project “Mohamed Bin Zayed International Robotics Challenge (MBZIRC)” 2015-2018: European H2020 project “CENTAURO – Robust Mobility and Dexterous Manipulation in Disaster Response“, coordinator 2012-2018: DFG Research Unit 1505 “Mapping on Demand”, projects “Local Perception for the Autonomous Navigation of Multicopters” and “Autonomous Navigation for Object Capture with Multicopters” 2012-2018: DFG Priority Programme SPP 1527 “Autonomous Learning”, projects “ALROMA - Autonomous Active Object Learning Through Robot Manipulation” and “Autonomous Learning of Bipedal Walking Stabilization” 2014-2017: BMWi project “InventAIRy - Identification with autonomous flying robots” 2015-2017: European FP7 project “European Robotics Challenges (EuRoC)”, projects “robolink® feeder – Flexible Energy Chain Assembly Automation with a Lightweight Cable-driven Robot”, “KittingBot – Mobile Manipulation for Part Sequencing and Kitting in Automotive Logistics”, and “ChimneySpector – Inside/outside chimney and smoke pipe inspection by aerial robots” 2013-2016: European FP7 project “STAMINA – Sustainable and reliable robotics for part handling in manufacturing automation“ 2012-2016: DFG project „Open-source Humanoid Soccer Robot for the RoboCup TeenSize Class” 2012-2013: DFG Graduate School GRK 1572 “Bionics – Interactions across Boundaries to the Environment”, project “Learning of Invariant Representations in a Hierarchy for Action Recognition” 2010-2013 NRW Graduate School “Bonn-Aachen International Research School of Applied Information Technology”, two projects in area “Data Mining, Pattern Recognition and Machine Learning” 2004-2011 DFG Emmy Noether Excellency Grant \"Learning Humanoid Robots” 2006-2009 DFG project \"Humanoid Soccer Robots for the RoboCup KidSize League\" DE University of Bonn, Institute for Computer Science, Computer Science VI - Intelligent Systems and Robotics Imprint Data Privacy Statement",
  "content_length": 6805,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:41"
}