{
  "name": "Swamit Tannu",
  "homepage": "https://swamittannu.com",
  "status": "success",
  "content": "Swamit Tannu – Quantum Computing Systems Swamit Tannu — Quantum Computing Systems About I lead the QUEST Research Group at UW–Madison. My group co-designs software, compilers, control, architecture, and error correction to make quantum computers scalable, reliable, and useful. We emphasize rigorous systems thinking—from algorithms and compilers to real-time decoders and run-time control—grounded in concrete hardware. Teaching CS 758 (Fall 2025) — Advanced Topics in Computer Architecture: Fault-Tolerant Quantum Architecture. CS 639 (Spring 2026) — Systems Architecture for Quantum Computers. Research We treat designing quantum computers as a systems problem. Our work is organized into three broad, thrusts that make real machines faster, more reliable, and easier to program: Classical quantum control at scale: Understand and optimize the hardware overheads of controlling quantum devices—from calibration and readout to real‑time feedback—to enable effective quantum error correction. Efficient, heterogeneous fault‑tolerant architectures : Design and evaluate architectures that mix codes, decoders, and accelerators to run applications efficiently and reliably. Quantum runtime & compilers: Build runtimes and compilers that map, route, schedule, and optimize programs for real devices, exposing the right abstractions while meeting hardware timing and error‑rate constraints. Publications 2026 Efficient Unitary Synthesis for Early Fault-Tolerant Architectures Tianyi Hao, Amanda Xu, Swamit Tannu International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2026) PropHunt: Automated Optimization of Quantum Syndrome Measurement Circuits Joshua Viszlai, Satvik Maurya, Swamit Tannu, Margaret Martonosi, Fred Chong International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2026) Generating Compilers for Qubit Mapping and Routing Abtin Molavi, Amanda Xu, Ethan Cecchetti, Swamit Tannu, Aws Albarghouthi Symposium on Principles of Programming Languages (POPL 2026) 2025 Accurate Leakage Speculation for Quantum Error Correction Chaithanya Naik Mude, Swamit Tannu Annual IEEE/ACM International Symposium on Microarchitecture (MICRO 2025) Synchronization for Fault-Tolerant Quantum Computers Satvik Maurya, Swamit Tannu International Symposium on Computer Architecture (ISCA 2025) Efficient and Scalable Quantum Circuit Simulator using Computational Reuse Meng Wang, Swamit Tannu, Prashant Nair International Symposium on Computer Architecture (ISCA 2025) Efficient and Scalable Architecture for Multi-level Superconducting Qubit Readout Chaithanya Naik Mude, Satvik Maurya, Benjamin Lienhard, Swamit Tannu ACM/IEEE Design Automation Conference (DAC 2025) Optimizing Quantum Circuits, Fast and Slow Amanda Xu, Abtin Molavi, Swamit Tannu, Aws Albarghouthi International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2025) Dependency-Aware Compilation for Surface Code Quantum Architectures Abtin Molavi, Amanda Xu, Swamit Tannu, Aws Albarghouthi Object-oriented Programming, Systems, Languages, and Applications (OOPSLA 2025) Crosstalk-induced Side Channel Threats in Multi-Tenant NISQ Computers Navnil Choudhury, Chaithanya Naik Mude, Sanjay Das, Preetham Chandra Tikkireddi, Swamit Tannu, Kanad Basu The Network and Distributed System Security (NDSS 2025) 2024 Variational Quantum Algorithm Landscape Reconstruction by Low-Rank Tensor Completion Tianyi Hao, Zichang He, Ruslan Shaydulin, Marco Pistoia, Swamit Tannu IEEE International Conference on Quantum Computing & Engineering (QCE 2024) Understanding Side-Channel Vulnerabilities in Superconducting Qubit Readout Architectures Satvik Maurya, Chaithanya Naik Mude, Benjamin Lienhard, Swamit Tannu IEEE International Conference on Quantum Computing & Engineering (QCE 2024) 2023 Scaling Qubit Readout with Hardware Efficient Machine Learning Architectures Satvik Maurya, Chaithanya Naik Mude, William Oliver, Benjamin Lienhard, Swamit Tannu International Symposium on Computer Architecture (ISCA 2023) Enabling High Performance Debugging for Variational Quantum Algorithms using Compressed Sensing Kun Liu*, Tianyi Hao*, Swamit Tannu International Symposium on Computer Architecture (ISCA 2023) Synthesizing Quantum-Circuit Optimizers Amanda Xu, Abtin Molavi, Lauren Pick, Swamit Tannu, Aws Albarghouthi ACM SIGPLAN International Conference on Programming Language Design and Implementation (PLDI 2023) SuperBP: Design Space Exploration of Perceptron-Based Branch Predictors for Superconducting CPUs Haipeng Zha, Swamit Tannu, Murali Annavaram International Symposium on Microarchitecture (MICRO 2023) 2022 COMPAQT: Compressed Waveform Memory Architecture for Scalable Qubit Control Satvik Maurya, Swamit Tannu 55th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO 2022) Qubit Mapping and Routing via MaxSAT Abtin Molavi, Amanda Xu, Martin Diges, Lauren Pick, Swamit Tannu, Aws Albarghouthi 55th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO 2022) HAMMER: Boosting Fidelity of Noisy Quantum Circuits by Exploiting Hamming Behavior Swamit Tannu, Poulami Das, Ramin Ayanzadeh, Moinuddin Qureshi ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2022) The Dirty Secret of SSDs: Embodied Carbon Swamit Tannu, Prashant Nair Workshop on Sustainable Computer Systems Design and Implementation (HotCarbon 2022) 2021 ADAPT: Mitigating Idling Errors in Qubits via Adaptive Dynamical Decoupling Poulami Das*, Swamit Tannu*, Siddarth Dangwal, Moinuddin Qureshi Proceedings of the 54th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO 2021) JigSaw: Boosting Fidelity of NISQ Programs via Measurement Subsetting Poulami Das, Swamit Tannu, Moinuddin Qureshi Proceedings of the 54th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO 2021) 2019 Ensemble of Diverse Mappings: Improving Reliability of Quantum Computers by Orchestrating Dissimilar Mistakes Swamit Tannu, Moinuddin Qureshi 52nd Annual IEEE/ACM International Symposium on Microarchitecture (MICRO’19) Mitigating Measurement Errors in Quantum Computers by Exploiting State-Dependent Bias Swamit Tannu, Moinuddin Qureshi 52nd Annual IEEE/ACM International Symposium on Microarchitecture (MICRO’19) A Case for Multi-Programming Quantum Computers Poulami Das, Swamit Tannu, Prashant Nair, Moinuddin Qureshi 52nd Annual IEEE/ACM International Symposium on Microarchitecture (MICRO’19) Not all Qubits Are Created Equal: A Case for Variability-Aware Policies for NISQ-Era Quantum Computers Swamit Tannu, Moinuddin Qureshi 24th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS’19) A Case for Superconducting Accelerators Swamit Tannu, Poulami Das, Michael Lewis, Robert Krick, Douglas Carmean, Moinuddin Qureshi ACM International Conference on Computing Frontiers 2019 (CF’19) [Best Paper Award] 2017 Taming the Instruction Bandwidth of Quantum Computers via Hardware-Managed Error Correction Swamit Tannu, Zachery Myers, Prashant Nair, Douglas Carmean, Moinuddin Qureshi 50th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO’17) Cryogenic-DRAM based memory system for scalable quantum computers: a feasibility study Swamit Tannu, Douglas Carmean, Moinuddin Qureshi International Symposium on Memory Systems (MEMSYS’17) [Best Presentation Award] Teaching CS 758 — Advanced Topics in Computer Architecture: Fault-Tolerant Quantum Architecture. CS 639 — Systems Architecture for Quantum Computers. CS 838 Seminar: Quantum Computing — weekly talks/panels on state‑of‑the‑art research. CS 552: Introduction to Computer Architecture. CS 752: Advanced Computer Architecture. Selected Service & Awards NSF CAREER Award Program Committee Member: ISCA (2021-2026), MICRO (2021-2025), ASPLOS (2022-2025), HPCA (2021-2026) Inducted in MICRO Hall of Fame Best Paper Award — ACM Computing Frontiers (2019) Contact Department of Computer Sciences University of Wisconsin–Madison 1205 University Ave, Madison, WI 53706, USA swamit@cs.wisc.edu Prospective students: Please email with a brief background and how your interests align with our current thrusts (readout & sensing, decoders, compilers, FTQC systems).",
  "content_length": 8353,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:55"
}