{
  "name": "Swamy Ananthanarayan",
  "homepage": "https://research.monash.edu/en/persons/swamy-ananthanarayan",
  "status": "success",
  "content": "Swamy Ananthanarayan - Monash University View Scopus Profile Swamy Ananthanarayan Dr Senior Lecturer, Department of Human Centred Computing https://orcid.org/0000-0002-9808-5844 EmailSwamy.Ananthanarayanmonashedu Accepting PhD Students 20102025 Research activity per year Personal profile BiographyI am interested in designing and evaluating interactive systems that address the needs of underserved or marginalized populations (e.g., older adults, children, indigenous groups, people with disabilities, low socioeconomic status groups). My research often takes the shape of tangible or physical technologies such as intelligent artifacts, ambient displays, computational toolkits or wearable devices.Some examples of my work include electronic toolkits for supporting healthy behaviors in low SES children, tangible programming environments for facilitating computational thinking, intergenerational storytelling platforms, and multimodal interfaces for bicycle safety. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science and Cognitive Science, PhD, University of Colorado BoulderAward Date: 19 Dec 2015 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2022 2023 2026 1 Active 2 Finished Projects per year Making eMaking Accessible for People with Intellectual DisabilitiesEllis, K. (Primary Chief Investigator (PCI)), Kidman, G. (Chief Investigator (CI)), Ananthanarayan, S. (Chief Investigator (CI)), Tan, H. (Chief Investigator (CI)) & Callaway, L. (Chief Investigator (CI))1/02/23 → 31/01/26Project: Research MakerVan: A mobile makerspace delivering STEM engagement to disability communities across VictoriaEllis, K. (Primary Chief Investigator (PCI)) & Ananthanarayan, S. (Chief Investigator (CI))1/11/22 → 26/05/23Project: Research AICPAIRTWP2: Digital Health Inclusion: Supporting Access to Healthcare for People with DisabilityAnwar, M. (Primary Chief Investigator (PCI)), Sebastian, E. (Chief Investigator (CI)), Areni, I. S. (Chief Investigator (CI)), Fadilah, N. (Partner Investigator (PI)), Indrabayu (Partner Investigator (PI)), Erika, K. A. (Partner Investigator (PI)) & Ananthanarayan, S. (Chief Investigator (CI))12/04/22 → 11/08/22Project: Research Research output Research output per year 2010 2012 2017 2018 2019 2020 2022 2023 2024 2025 35 Conference Paper 3 Article Research output per year Research output per year The Sky is the Limit: Understanding How Generative AI can Enhance Screen Reader Users' Experience with Productivity ApplicationsPerera, M., Ananthanarayan, S., Goncu, C. & Marriott, K., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 17 p. 1165Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) Designing Accessible Adaptations for an Electronic Toolkit with Blind and Low Vision UsersJohnstone, J., Nadeeshani, M., Chen, H., Vemula, M., Tandori, E. J., Stephens, K., Senaratne, H., Ellis, K. & Ananthanarayan, S., 2024, ASSETS 2024 - Proceedings of the 26th International ACM SIGACCESS Conference on Computers and Accessibility. Guerreiro, T. & Brewer, R. (eds.). New York NY USA: Association for Computing Machinery (ACM), 15 p. 43Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 4 Citations (Scopus) Grand challenges in WaterHCIMueller, F. '., Montoya, M. F., Pell, S. J., Oppermann, L., Blythe, M., Dietz, P. H., Marshall, J., Bateman, S., Smith, I., Ananthanarayan, S., Mazalek, A., Verni, A., Bakogeorge, A., Simonnet, M., Ellis, K., Semertzidis, N. A., Burleson, W., Quarles, J., Mann, S. & Hill, C. & 2 others, Clashing, C. & Elvitigala, D. S., 2024, Proceedings of the 2024 CHI Conference on Human Factors in Computing Sytems. L. Wilson, M., Toups Dugas, P. & Shklovski, I. (eds.). New York NY USA: Association for Computing Machinery (ACM), 18 p. 225Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 10 Citations (Scopus) WaterHCI: Water in Human-Computer InteractionVega, M. M., Smith, I., Clashing, C., Patibanda, R., Ananthanarayan, S., Pell, S. J. & Mueller, F., 11 Dec 2024, In: Foundations and Trends in Human-Computer Interaction. 18, 4, p. 338-412 75 p.Research output: Contribution to journal › Article › Other › peer-review 2 Citations (Scopus) Designing conversational multimodal 3D printed models with people who are blindReinders, S., Ananthanarayan, S., Butler, M. & Marriott, K., 2023, Proceedings of the 2023 ACM Designing Interactive Systems Conference. Luo, Y. & Gui, X. (eds.). New York, NY, USA: Association for Computing Machinery (ACM), p. 2172–2188 17 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review View all 38 research outputs Prizes 2024 Good Design Award, Social Impact: Co-Designing STEAM experiences with and for people with intellectual disabilities: The Accessible MarkervanJohnstone, J. (Recipient), Ellis, K. (Recipient), Ananthanarayan, S. (Recipient) & Mcgee, T. (Recipient), Sept 2024Prize: Prize (including medals and awards)",
  "content_length": 5840,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:51"
}