{
  "name": "Swaprava Nath",
  "homepage": "https://www.cse.iitb.ac.in/~swaprava",
  "status": "success",
  "content": "Swaprava Nath - Academic Homepage I am a faculty member at the Department of Computer Science and Engineering, IIT Bombay and an associated faculty member of Centre for Machine Intelligence and Data Science (CMInDS) and IITB Trust Lab. Previously, I was a faculty member at the Department of Computer Science and Engineering, IIT Kanpur. Even before, I spent two beautiful stints as postdoc at the Computer Science Department, Carnegie Mellon University and at the Economics and Planning Unit, Indian Statistical Institute, New Delhi. I did my PhD from the Department of Computer Science and Automation, at the mesmerizing campus of Indian Institute of Science, Bangalore. My research interest lies at the intersection of Economics and Computation, that has applications in Internet economics, crowdsourcing, resource allocation, online advertising, auctions, matching, social networks, and many more. To know more about my research, please see the research page, and to know about our research group, see the group page. Prospective students: I'm always looking for enthusiastic and self-motivated students for my group. If you are a student and want to work with me, please read this first. My research is generously supported by IIT Bombay's Seed Grant, Science and Education Research Board, Government of India, Tata Consultancy Services, State Bank of India and IIT Bombay Innovation Hub, Amazon Research India, Technocraft Centre for Applied Artificial Intelligence, IITB Trust Lab, and Dr. Gauri Shah Endowment Fund. I express my heartfelt gratitude for their support. Full CV: [PDF] \"If you believe too much you'll never notice the flaws; if you doubt too much you won't get started. It requires a lovely balance.\"-- Richard W. Hamming June 2025: Taught a course on \"Strategic Multi-Agent Artificial Intelligence\" at the IIT Bombay International Summer School 2025. This LinkedIn post has more details. January 2025: Drashthi Doshi, a Ph.D. student advised by Prof. Swaprava Nath, gets the prestigious Asha Navani Ph.D. Fellowship. Congratulations Drashthi! December 2024: Two full papers with four students of the group, Ramsundar Anandanarayanan, Pulkit Agarwal, Harshvardhan Agarwal, Vaibhav Raj, get accepted in AAMAS 2025, the flagship conference in mechanism design. The papers address the questions of truthfully and efficiently charge-scheduling electric vehicles and fairly dividing teams. Congratulations to all of them! August 2024: Three students advised by Prof. Swaprava Nath gets CSE Department's Student Research Excellence Awards: Kartik Pratap Gokhale, Thomas Dooie Class of 1974 Award, Rupasai Rangaraju (co-advised with Prof. Pushpak Bhattacharyya), Nilesh Vashee Award, Sri Raghava Ravindra Muddu (co-advised with Prof. Pushpak Bhattacharyya), Winifred B. Fernandes Award. Congratulations to all the award recipients! July 2024: PhD student of the group Drashthi Doshi wins CHANAKYA (Comprehensive and Holistic Advancement of National Knowledge Yield and Analytics) Doctoral Fellowship supported by iHub Anubhuti-IIITD Foundation under the National Mission on Interdisciplinary Cyber-Physical Systems (NM-ICPS). Congratulations Drashthi! July 2024: 1 paper with student co-authors Kartik Gokhale, Ankit Kumar Misra, and Amit Kumar Mallik is published in ECAI 2024 (European Conference on Artificial Intelligence). Congratulations Kartik, Ankit, Amit! May 2024: 3 papers with student co-authors Ramsundar Anandanarayanan and Parvik Dave are published in AAMAS 2024 (Autonomous Agents and Multi-Agent Systems). Congratulations Ram and Parvik! July 2024: New Course CS 405: Game Theory and Algorithmic Mechanism Design. CS 6001 is now also listed as an UG elective course CS 405. UG students are advised to register only for this course and not CS 6001. Pre-registration is enforced for CS 405. Please do the needful when pre-registration opens on ASC. Only students from certain departments are allowed to be registered for this course. For full details of the rules, read this. December 31, 2023: The year ends with several interesting notes that uniquely identify the CompEcon group. First, in academics, a record enrollment of 250+ students in CS 6001, one full paper each in AAMAS 2023, ECAI 2023, and IJCAI 2023, and upcoming one full paper and two extended abstracts in AAMAS 2024. Second, the group is now funded with three SERB, one TCS, one TCAAI, and one Amazon grants -- heartfelt thanks to the funding agencies. Third, in sports, a silver medal in the 28th inter-IIT staff sports meet 2023 (in football) held at IIT Gandhinagar. Finally, a refreshing time out with the group members for food and fun. CompEcon believes in working hard, playing hard, and partying moderate! May - July 2023: I'm open to mentor an intern under the IKDD Research Internship Program. Here you can find more details about the project. This will be a project in the area of mechanism design. You must have done CS6001 or a similar course (self-study is also okay) as preparation towards this project. For an overview of working with me, please read this first. If you are 'game' for this, I highly encourage you to apply. July 2022: CS6001 (that's double zero, the first 4 digit course in CSE, IITB): Game Theory and Algorithmic Mechanism Design: an introductory PG elective course which is also open for the second to final year UG and dual degree students (4-minute intro video here). Course details are available here. The course is also accessible from outside IIT Bombay as the same content will be offered via NPTEL. If you are interested, you may consider signing up here. June, 2022: More accolades to Satyanweshi/सत्यान्वेषी, the truth-seeking chatbot. See below for its details and the team involved in it. The students, Ankur, Yash, and Nithya received the Ranjan Kumar Memorial Award at the 55-th convocation at IIT Kanpur for the best socially relevant project [official notification, page 11]. May 2022: Our work on truthful ownership transfer with expert advice gets accepted in Mathematical Programming. February 2022: received two grants from MATRICS, SERB, and TCAAI, IIT Bombay. Grateful acknowledgments to the funding agencies. December 13, 2021: Joined CSE, IIT Bombay At IIT Kanpur: January, 2021: When robots are intelligent, one needs mechanism design to prioritize their movements avoiding collision. Here is our paper on competitive robot prioritization that got accepted in ICAPS. September-November, 2020: The course lectures of \"Introduction to Game Theory and Mechanism Design\" are now online. See this YouTube playlist. April-May, 2020: We have developed Satyanweshi/सत्यान्वेषी, the truth-seeking chatbot. Set it up easily and truth-check suspicious messages before forwarding to others. Our solution secured the second place in MHRD AICTE SAMADHAN competition in response to COVID-19 among more than 2500 participants. See this IIT Kanpur twitter announcement or the video. Good work by Ankur, Yash, Nithya, and Prarthana who are currently working towards improving and maintaining Satyanweshi/सत्यान्वेषी. This project is mentored by Prof. Hamim Zafar and myself. Also visit (and \"like\" if you like) Satyanweshi/सत्यान्वेषी's Facebook page. February, 2020: Paper on the blockchain-based skill evaluation tool SkillCheck gets accepted in IEEE ICBC. Congratulations to Jay. January, 2020: Paper on the peer-grading tool SwaGrader gets accepted in CoDS-COMAD. Congratulations to Somu, Ayushi, and Shubham. January-April, 2020: Teaching Computer Networks. May, 2019: Press coverage of our work on surprise in elections. May, 2019: Garima's (PhD student) second paper gets into IJCAI. Congratulations again! May, 2019: Garima (PhD student) is traveling to Montreal to present her paper in AAMAS. Congratulations Garima! January-April, 2019: Flown an A380, said differently, taught ESC101: Fundamentals of Computing. The crew after landing it successfully. August-November, 2018: Taught Introduction to Game Theory and Mechanism Design. January-April, 2018: Taught a new course, Selected Areas of Mechanism Design. December 15, 2017: Co-organized a workshop on Computational Social Choice Theory at IIT Kanpur.",
  "content_length": 8242,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:54"
}