{
  "name": "Swaroop Joshi",
  "homepage": "https://swaroopjoshi.in",
  "status": "success",
  "content": "Swaroop JoshiSearchस्वरूप जोशीAssistant ProfessorCS & IS, BITS Pilani, GoaI am a Researcher and Educator interested in a range of topics in Computing Education, Software Engineering, and Accessibility. Check out my Projects for more details.I am one of the lead researchers at the Technology, Research, and Innovation In Education (TRIE) Lab at BITS Pilani, KK Birla Goa Campus.Latest updates: Received the DST-NSF Joint Project Grant!Start here if you want to work with me.Interests Computing Education Software Engineering Accessibility Mobile Apps DevelopmentEducationPh.D. in Computer Science & EngineeringThe Ohio State UniversityM.Tech. in Computer Science & EngineeringIIT Bombay, IndiaB.E. in Computer EngineeringNITK Surathkal, IndiaNewsLast updated on Jul 15, 2025 1 min read Received the DST-NSF Grant for the 'GameSignAI' ProjectOur team of researchers –Profs. Sougata Sen, Surjya Ghosh, Swaroop Joshi, and Sravan Danda– from the Department of CS & IS, BITS Pilani, K K Birla Goa Campus, along with Prof.ProjectLast updated on Mar 17, 2025 1 min read Received ACM SIGCSE Special Projects GrantI am glad to share that my project titled Serious Games for Teaching Accessibility was recently selected to receive the ACM SIGCSE Special Projects Grant.Project Related Post Related TweetLast updated on Sep 14, 2024 1 min read Teaching Excellene Award 2024I am honoured to receive the Teaching Excellence Award 2024 🏆 from the BITS Pilani KK Birla Goa Campus Teaching Learning Center. I thank my department leadership and colleagues for the continued encouragement of my teaching innovation and the institute for recognizing these efforts.Last updated on Jul 28, 2024 1 min read Two of our papers accepted for ACM ICER'24!Two of our research papers are accepted for the ACM Conference on International Computing Education Research conference (ICER'24), to be held in Melbourne, Australia, in August 2024. ICER is a CORE A conference and a prestigious Computing Education research community venue.Last updated on Apr 3, 2024 1 min read MOU with NCISM on AI in ASUS EducationBITS Goa and NCISM signed an MOU with NCISM on integrating AI in medical education in NCISM instituresProjectSee all posts Experience     Assistant ProfessorComputer Science and Information Systems, BITS Pilani–KK Birla Goa CampusFebruary 2021 – Present Goa India     Assistant Professor, LecturerSchool of Computing, University of UtahAugust 2019 – December 2020 Salt Lake City UT USA     Senior LecturerComputer Science & Engineering, The Ohio State UniversityJanuary 2017 – July 2019 Columbus OH USAProjectsCheck out the list of my current and past students. .js-id-current-projectCurrent PastISL RecognitionAutomatic recognition of Indian Sign Language gestureAI in ASUS EducationExploring the use of AI in Ayurveda and other Indian Sciences of MedicineComputational Thinking for Children with DisabilitiesCurrently exploring the existing literatureAuto-assessment toolchain for Introductory Programming CoursesDeveloping a testing mechanism that is simple to adaptStudents(Listed alphabetically by their first name.) Current Students PhD Arun Velaayudhan Ganesan Parthasarathy PD Sowmya Rani Sridari Iyer Sukanya Roychowdhury Undergrads Aditya Gupta (BE CS 2026) Agastya Sen (BE CSIS 2025) Amogh Tarun V (BE ECE 2026) Balasubramanian G (BE CS 2026) Dhruv Patel (BE CS 2025) Garvit Jain (BE CSIS 2025) Govind S Nambiar Jahnavi Rishikesh Mohor Ghosal (MSc Bio+ BE ENI 2027) Nirvan Patil (BE ECE 2026) Priyashi Chaudhary (B.Accessible Science LabsAssistive Technology for making highschool science labs accessible for visually impaired.SugamyataTeaching Accessibility: Primarily through game based learningCONSIDERConflict-driven Collaborative-LearningGeogameA Virtual Simulation Workbench for Teaching and Learning through a Real-World Spatial PerspectivegdfaA generic data-flow analyzer in GCCRecent PublicationsDennis J. Bouvier, Ellie Lovellette, Eddie Antonio Santos, Brett A. Becker, Venu G. Dasigi, Jack Forden, Olga Glebova, Swaroop Joshi, Stan Kurkovsky, Seán RussellJune, 2025 Proceedings of the 30th ACM Conference on Innovation and Technology in Computer Science Education V. 2Error Messages Are Here to Help!Programming Error Messages (PEMs) are often misunderstood by students who then miss the opportunity to benefit from them. We have developed and used ’error hunt’ lessons using Java, Python, and C PEMs. The activities are supported by videos. The materials are targeted at novice programmers.Cite DOI ACM DLP D Parthasarathy, Rachel F Adler, Devorah Kletenik, Swaroop Joshi, Anshu M MittalApril, 2025 Proceedings of the Extended Abstracts of the CHI Conference on Human Factors in Computing SystemsSkill, Will, or Both? Understanding Digital Inaccessibility from Accessibility Professionals' ViewpointThis survey of 160 accessibility professionals provides an updated perspective on the state of digital accessibility. The results highlight the need for stronger leadership commitment, investment in training, and integration of accessibility into core business strategies.Cite Project DOI Preprint ACM DLWajdi Aljedaani, P D Parthasarathy, Swaroop Joshi, Marcelo Medeiros ElerFebruary, 2025 Proceedings of the 56th ACM Technical Symposium on Computer Science Education (SIGCSE 2025)Accessibility Insights from Student's Software Engineering ProjectsThis study, conducted over three semesters, focused on teaching digital accessibility to computing students. The study identified common accessibility mistakes, easily resolved issues, and persistent challenges, providing insights for integrating accessibility instruction into computing curricula.Cite Project DOI ACM DLWajdi Aljedaani, P D Parthasarathy, Marcelo Medeiros Eler, Swaroop JoshiFebruary, 2025 Proceedings of the 56th ACM Technical Symposium on Computer Science Education (SIGCSE 2025)Sprint to Inclusion: Embedding Accessibility Sprint in a Software Engineering CourseAccessibility should be integrated into core computing courses, not just specialized electives. A study found that including an accessibility-focused sprint in a software engineering course improved students technical skills and commitment to inclusive software.Cite Project DOI ACM DLP D Parthasarathy, Swaroop JoshiDecember, 2024 Proceedings of the 2024 ACM Virtual Global Computing Education Conference (SIGCSE-V 2024) V. 1Reflections on Incorporating Digital Accessibility in an Operating Systems CourseWe integrated accessibility topics into a graduate-level Operating Systems course, with interventions including awareness, assistive technology knowledge, and implementation. While the intervention showed short-term effectiveness, long-term retention requires continued emphasis on accessibility.Cite Project DOISee all publications Recent PostsTwo of our papers accepted for ICSE'24!Two of our papers are accepted for the ICSE'24 conference’s Software Engineering Education and Training Track, to be held in Lisbon, Portugal in April, 2024. The International Conference on Software Engineering (ICSE) is a CORE A* conference, a flagship conference in software engineering.Last updated on Jul 28, 2024 1 min read ProjectSeeking Letters of RecommendationWriting letters recommending students to graduate schools, fellowships, internships, and such is a part of my academic job. Advice like this is neither new nor unique. I am building on more detailed posts from more experienced academicians and my personal experience as a reader of several recommendation letters.Last updated on Nov 5, 2023 2 min read Ramayana: Abilities, not resources, determine successThe life of śrīrāma continues to inspire millions like me across the world. The lesson I remembered this year is it’s abilities, not resources, that determine success.Last updated on Apr 1, 2023 3 min read See all posts Talks | EventsUsing Game-based Learning for Teaching AccessibilityPart of a panel discussion on Researching Accessibility EducationLast updated on Feb 14, 2025ProjectAndroid App Development Workshop @ YEB 2023A glimpse into the world of mobile app development for the participants of the Young Enterpreneurs’ Bootcamp at BITS Goa. The students developed a simple dice game Cho Han.Last updated on Mar 31, 2023Code SlidesIntegrating Accessibility Topics in Computing EducationI presented our work on integrating accessibility in a mobile app development course at BITS Goa (published in SIGCSE’23) and discussed our other ongoing work in the area of computing education and accessibility.Last updated on Mar 31, 2023PDF ProjectCPS in Computing Education: Current TrendsCyber-physical systems provide new ways of interacting with the engineered systems around us. Computing Education Researchers are leveraging these tangible systems for new interactions and teaching computing to demographics that are typically underrepresented in computing education. In this talk, I present three such examples.Last updated on Oct 10, 2020PDF VideoIUCEE Principles of Programming Languages10-part webinar on how to teach a Principles of Programming Languages course, attended by more than 50 CS faculty from IndiaLast updated on Apr 24, 2020See all Popular TopicsAccessibility Accessibility Education Asee Cedr Collaborative-Learning Comped Compiler Error Messages Computing Education Current-Project Education-Research Error Messages Game-Based Learning Global Computing Education Icer Icse News Novice Programmers Past-Project Programming Error Messages SigcseContact swaroopj@goa.bits-pilani.ac.in +91-832-2580-864 NAB D-161, BITS Pilani KK Birla Goa Campus, Zuarinagar, Goa 403726 Mondays and Wednesdays 12:15 to 1:00 pm Book an appointmentCite × Copy Download",
  "content_length": 9668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:34:55"
}