{
  "name": "Syamantak Das",
  "homepage": "http://faculty.iiitd.ac.in/~syamantak",
  "status": "success",
  "content": "Syamantak Das Syamantak Das Assistant Professor, Indraprastha Institute of Information Technology Delhi (IIIT-Delhi) Previously: Postdoc, University of Bremen, Germany Visiting Postdoc, Max Planck-Institut für Informatik, Germany PhD, Department of Computer Science and Engineering, IIT Delhi, India Contact: firstname at iiitd dot ac dot in Research Interests: Combinatorial optimization, Approximation algorithms, Online algorithms I am primarily interested in working on the following class of problems : Graph problems/ network design Clustering Scheduling Teaching: Modern Algorithm Design (CSE 319/519) Monsoon 2021 , 2020, 2019, 2018 Approximation Algorithms Winter 2018 Winter 2019 Analysis and Design of Algorithms Winter 2022, Winter 2021, Winter 2020, Winter 2019 Manuscripts: Distributional Individual Fairness in Clustering (PDF) with Nihesh Anderson, Suman K. Bera and Yang Liu Publications: Metric Clustering and Graph Optimization Problems using Weak Comparison Oracles# with Rahul Raychaudhury, Wenzhi Li, Sainyam Galhotra and Stavros Sintos COLT 2025 Nearly-Tight Bounds for Flow Sparsifiers in Quasi-Bipartite Graphs with Nikhil Kumar and Daniel Vaz MFCS 2024 Tight Approximation Algorithms for Ordered Covering with Jatin Batra and Agastya Vibhuti Jha WADS 2023 The Multi-Vehicle Dial-A-Ride Problem with Kelin Luo, Alexandre Florio and Xiangyu Guo VLDB 2023 Fair Rank Aggregation with Diptarka Chakraborty, Arindam Khan and Aditya Subramanian NeurIPS 2022 A simpler QPTAS for scheduling jobs with precedence constraints with Andreas Wiese ESA 2022 (Track S) Fair k-Center Clustering in MapReduce and Streaming (PDF Soon) with Suman K. Bera, Sainyam Galhotra, Sagar Kale WWW 2022 The Multi-vehicle Ride-Sharing Problem (PDF Soon) with Kelin Luo, Chaitanya Agarwal, Xiangyu Guo WSDM 2022 Vertex Reduction for Edge Connectivity (PDF) with Parinya Chalermsook, Bundit Laekhanukit, Yunbum Kook, Yang P. Liu, Richard Peng, Mark Sellke and Daniel Vaz SODA 2021 A constant factor approximation for capacitated min-max tree cover with Lavina Jain and Nikhil Kumar APPROX 2020 Survivable Network Design for Group Connectivity in Low-Treewidth Graphs with Parinya Chalermsook, Guy Even, Bundit Laekhanukit and Daniel Vaz APPROX 2018 On minimizing the makespan when some jobs cannot be assigned on the same machine with Andreas Wiese ESA 2017 Beyond Metric Embedding : Approximating Group Steiner Trees on Bounded Treewidth Graphs with Parinya Chalermsook, Bundit Laekhanukit and Daniel Vaz SODA 2017 Rejecting Jobs to Minimize Load and Maximum Flow-time with A Roy Choudhury, Amit Kumar and Naveen Garg SODA 2015 Minimizing Weighted Lp-norm of Flow-time in the Rejection Model with A Roy Choudhury and Amit Kumar FSTTCS 2015 Minimizing Average Flow-time under Knapsack Constraint with Suman K Bera and Amit Kumar Theoretical Computer Science 2016 (Preliminary version in COCOON 2014) Professional Activities: Subreviewer: ESA, SODA. Education: Ph.D, Department of Computer Science, Indian Institute of Technology Delhi, India. Master of Science, Information Technology, Indian Institute of Technology Kharagpur, India. Bachelor of Engineering, Jadavpur University, Kolkata, India.",
  "content_length": 3190,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:00"
}