{
  "name": "Syed Waqar Nabi",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/syedwaqarnabi",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Syed Waqar Nabi Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Syed Waqar NabiMr Ethan KellyZhen Tian Dr Syed Waqar Nabi Lecturer (School of Computing Science) telephone: 01413307104 email: Syed.Nabi@glasgow.ac.uk 510A, Sir Alwyn Williams Building, 18 Lilybank Gardens, School of Computing Science, G12 8RZ Import to contacts https://orcid.org/0000-0003-3835-4851 Biography Dr S Waqar Nabi is a Lecturer at the School of Computing Science, University of Glasgow. He is a member of Glasgow Parallelism research group (GPG) of Systems Research Centre (GLASS), and also the Centre for Computing Science Education (CCSE).He teaches primarily for the BSc (Hons) Software Engineering (Graduate Apprenticeship) program, covering foundational courses in the area of: logic design, computer architecture, operating systems, network systems, data structures, algorithms, and discrete maths. He is also deeply involved in structuring and coordinating the \"work-based learning\" aspect of the apprenticeship program.Earlier at the School, he worked as a post-doc on the EPSRC funded project “Exploiting Parallelism through Type Transformations for Hybrid Manycore Systems”, with a focus on automatically targeting FPGA devices for accelerating legacy scientific code.More on his LinkedIn profile. Research interests Improve accessibility to heterogeneous platforms (CPUs, GPUs and FPGAs) via smarter tools and compilers. Cost models, Code generation, and Optimization for heterogeneous devices. Acceleration of Scientific Models and Machine Learning on Heterogeneous Platforms. Low-carbon and sustainable computing. Exploring High-level Programming and Synthesis for FPGAs. FPGA-based embedded systems. Computing Science and Software Engineering Education. Work-Based & Competency-Based Learning. Higher education in Low and Middle Income Countries. Research groupsGlasgow SystemsEducation & Practice Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014Number of items: 36.2025 Ullah, Rahim, Abbas, Hasan ORCID: https://orcid.org/0000-0002-5951-9603 and Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 (2025) Exploring Advanced Deep Learning Models for Super Resolution of 3D Dental CBCT Volumes. AiIH 2025 : International Conference on AI in Healthcare, Cambridge, UK, 8-10 September 2025. (doi: 10.5281/zenodo.17038615) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 (2025) The Development of Reflective Practice on a Work-Based Software Engineering Program: a Longitudinal Study. In: 37th IEEE Conference on Software Engineering Education and Training (CSEE&T), Ottowa, Canada, 27 April - 3 May 2025, pp. 53-61. ISBN 9798331537098 (doi: 10.1109/CSEET66350.2025.00012) Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Cutts, Quintin ORCID: https://orcid.org/0000-0002-6368-9912, Maguire, Joseph ORCID: https://orcid.org/0000-0002-3718-7679, Morrison, Alistair, Parkinson, Jack ORCID: https://orcid.org/0000-0001-6175-7638, Somerville, Derek and Storer, Tim ORCID: https://orcid.org/0000-0002-4026-097X (2025) Assessing Work-Based Learning in the Senior Years of a Software Engineering Graduate Apprenticeship Program. In: IEEE Conference on Software Engineering Education and Training (CSEE&T), Ottawa, Ontario, Canada, 28-29 April 2025, pp. 30-40. ISBN 9798331537098 (doi: 10.1109/CSEET66350.2025.00010) Thamsen, Lauritz ORCID: https://orcid.org/0000-0003-3755-1503, Elkhatib, Yehia ORCID: https://orcid.org/0000-0003-4639-436X, Harvey, Paul ORCID: https://orcid.org/0000-0003-1243-938X, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Singer, Jeremy ORCID: https://orcid.org/0000-0001-9462-6802 and Vanderbauwhede, Wim ORCID: https://orcid.org/0000-0001-6768-0037 (2025) Energy-aware workflow execution: an overview of techniques for saving energy and emissions in scientific compute clusters. arXiv, 2506.04062. (doi: 10.48550/arXiv.2506.04062) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Morrison, Alistair (2025) Understanding Skill Transfer Between University and Workplace Through Reflective Practice: A Software Engineering Work-Based Learning Experience. In: 30th ACM Conference on Innovation and Technology in Computer Science Education (ITiCSE ’25), Nijmegen, Netherlands, 30 June- 2 July 2025, pp. 368-374. ISBN 9798400715679 (doi: 10.1145/3724363.3729119) Szafarczyk, Robert, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Vanderbauwhede, Wim ORCID: https://orcid.org/0000-0001-6768-0037 (2025) Dynamic Loop Fusion in High-Level Synthesis. In: 2025 ACM/SIGDA International Symposium on Field Programmable Gate Arrays (FPGA ’25), Monterey, CA, USA, 27 Feb - 01 Mar 2025, pp. 211-222. ISBN 9798400713965 (doi: 10.1145/3706628.3708871) Szafarczyk, Robert, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Vanderbauwhede, Wim ORCID: https://orcid.org/0000-0001-6768-0037 (2025) Compiler Support for Speculation in Decoupled Access/Execute Architectures. In: 34th ACM SIGPLAN International Conference on Compiler Construction (CC ’25), Las Vegas, NV, USA, 01-02 Mar 2025, pp. 192-204. ISBN 9798400714078 (doi: 10.1145/3708493.3712695) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 and Petrovska, Olga (2025) Integrating Socially Responsible Computing Competencies in Computer Science and Software Engineering Education. 9th Conference on Computing Education Practice (CEP 2025), Durham, UK, 07 Jan 2025. pp. 36-37. ISBN 9798400711725 (doi: 10.1145/3702212.3702225) 2024 Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Somerville, Derek (2024) The role of reflection in effective work-based learning and assessment. In: Barr, Matthew (ed.) Approaches to Work-Based Learning in Higher Education: Improving Graduate Employability. Routledge, pp. 179-196. ISBN 9781003496779 (doi: 10.4324/9781003496779-11) Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673, Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219, Morrison, Alistair and Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 (2024) The Development of Students' Professional Competencies on a Work-Based Software Engineering Program. In: 55th ACM Technical Symposium on Computer Science Education (SIGCSE TS), Portland, OR, USA, 20-23 March 2024, pp. 81-87. ISBN 9798400704239 (doi: 10.1145/3626252.3630944) Szafarczyk, Robert, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Vanderbauwhede, Wim ORCID: https://orcid.org/0000-0001-6768-0037 (2024) A High-Frequency Load-Store Queue with Speculative Allocations for High-Level Synthesis. In: International Conference on Field Programmable Technology (FPT'23), Yokohama, Japan, 11-14 December 2023, pp. 115-124. ISBN 9798350359114 (doi: 10.1109/ICFPT59805.2023.00018) 2023 Szafarczyk, Robert, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Vanderbauwhede, Wim ORCID: https://orcid.org/0000-0001-6768-0037 (2023) Compiler Discovered Dynamic Scheduling of Irregular Code in High-Level Synthesis. In: 33rd International Conference on Field-Programmable Logic and Applications (FPL 2023), Gothenburg, Sweden, 4-8 September 2023, ISBN 9798350341515 (doi: 10.1109/FPL60245.2023.00009) Andrei, Oana ORCID: https://orcid.org/0000-0002-1306-0219 and Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 (2023) On Students’ Experiences with Algorithm Tracing using Pair Programming. In: 19th ACM Conference on International Computing Education Research (ICER 2023), Chicago, Illinois, USA, 8-10 October 2023, ISBN 9781450399753 (doi: 10.1145/3568812.3603477) Szafarczyk, Robert, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 and Vanderbauwhede, Wim ORCID: https://orcid.org/0000-0001-6768-0037 (2023) Reducing FPGA Memory Footprint of Stencil Codes through Automatic Extraction of Memory Patterns. In: 32nd International Conference on Field-Programmable Logic and Applications (FPL 2022), Belfast, United Kingdom, 29 August - 2 September 2022, pp. 148-152. ISBN 9781665473903 (doi: 10.1109/FPL57034.2022.00033) 2022 Barr, Matthew ORCID: https://orcid.org/0000-0002-5147-0673 and Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851 (2022) The Development of Students' Employability Skills on a Work-Based Software Engineering Degree Programme. In: 2022 IEEE Frontiers in Education Conference (FIE), Uppsala, Sweden, 8-11 October 2022, ISBN 9781665462440 (doi: 10.1109/FIE56618.2022.9962611) 2021 Cohen, Clara ORCID: https://orcid.org/0000-0002-7308-671X, Nabi, Syed Waqar ORCID: https://orcid.org/0000-0003-3835-4851, Higham, Catherine F. ORCID: https://orcid.org/0000-0002-2580-4115, Putnam, Michael, Kootstra, Gerrit Jan and van Hell, Janet (",
  "content_length": 35102,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:04"
}