{
  "name": "Syed Rafiul Hussain",
  "homepage": "https://syed-rafiul-hussain.github.io",
  "status": "success",
  "content": "Syed Rafiul Hussain Syed Rafiul Hussain Assistant ProfessorDepartment of Computer Science and Engineering, School of EECSThe Pennsylvania State University W305 Westgate Bldg, University Park, PA 16802 E-mail: hussain1_AT_psu_DOT_edu Phone: 814-865-6454 About Me I am an Assistant Professor in the Department of Computer Science and Engineering at Pennsylvania State University. Prior to joining Penn State in fall 2020, I worked as a postdoc at Purdue University from where I received my Ph.D. in fall 2018. I received the NSF CAREER Award from the National Science Foundation (NSF) and the DARPA Young Faculty Award (YFA) from the Defense Advanced Research Projects Agency (DARPA) in 2022. My research interest broadly lies in the areas of network and systems security. I lead the Systems and Network Security (SyNSec) research group and I am incredibly grateful to work with the students who are smarter than me. Our group focuses on improving the security and privacy of the design and software implementations of emerging networks and complex systems. We take a holistic approach to fundamentally enhance the security investigation of a system from the ground up, i.e., starting from analyzing designs, evaluating implementations, monitoring the runtime, and building verified/high-assurance defenses. As part of this process, we combine theory and practice by drawing inspiration from formal methods, program analysis, software testing, signal processing, and cryptography. Our research results have led to a number of changes in the design of 4G and 5G cellular standards. In addition, our work has been discussed by the Federal Communication Council (FCC)  as well as covered by more than 100+ media outlets worldwide, including the New York Times, Forbes, The Washington Post, ACM Technews, and MIT Technology Review. The software artifacts from my research group have also been made open-source. Recent News June ‘25: O-RAN security  has been accepted to BlackHat USA’25. Congratulations to  Tianchang and all co-authors! May ‘25: Loris  has been accepted to BlackHat USA’25. Congratulations to  Ali, Tianchang, and all co-authors! March ‘25: Loris and CoreScan have been accepted to IEEE S&P’25. Congratulations to  Ali, Mujtahid, and all co-authors! January ‘25: CoreCrisis has been accepted to USENIX Security’25. Congratulations to  Yilu and all co-authors! December ‘24: Congratulations to Abdullah Al Ishtiaq, Tianchang Yang, Mujtahid Akon, Syed Md Mukit Rashid, and Ali Ranjbar for passing the PhD comprehensive exam! August ‘24: 5GBaseChecker has received the Distinguished Paper Award USENIX Security ’24. Congratulations to Kai and all the co-authors! July ’24: Proteus has been accepted to CCS ’24. Congratulations to Mukit and all co-authors!July ’24: Privacy-Preserving Authentication for 5G MVNOs has been accepted to CCS ’24. July ’24: Congrats, Ishtiaq, Kai, and Tianchang, for securing the USENIX Security ’24 travel grant! June ’24: Athena has been accepted to USENIX Security ’24. Congratulations to Feiyang and all co-authors!May ’24: ORANalyst has been accepted to USENIX Security ’24. Congratulations to Tianchang and all the co-authors! May ’24: Cracking the 5G Fortress: Peering Into 5G’s Vulnerability Abyss” has been accepted to BlackHat USA 2024. February ’24: 5GBaseChecker has been accepted to USENIX Security’24. Congratulations to Kai and all the ao-authors!February ’24: Bypassing the Digital Wallets Payment Security for Free Shopping has been accepted to USENIX Security’24!January ’24: National Telecommunication and Information Administration (NTIA) proposal has been awarded!October ’23: HERMES has been accepted to USENIX Security’24. Congratulations to Ishtiaq and all the ao-authors!September ’23: NSF Convergence Accelerator on 5G: Phase 2 proposal has been awarded! July ’23: 5GCVerif has been accepted to ACM CCS’23. Congratulations to Mujtahid, Tianchang, and Yilu! December ’22: BLEDiff has been accepted to IEEE S&P (Oakland)’23! December ’22: Invited to serve on the PC of CCS’23! August ’22: NSF Convergence Accelerator on 5G proposal has been awarded! August ’22: NSF CNS Large proposal on sustainability has been awarded!May ’22: DARPA Young Faculty Award proposal has been awarded! May ’22: Selected as a DARPA Riser! March ’22: NSF CAREER proposal has been awarded!February ’22: Invited to serve on the PC of IEEE S&P’23.October ’21: CacTUs – Building Privacy-Preserving Smart Camera Systems has been accepted to PETS’22. Congratulations, Yohan! September ’21: DIKEUE – Noncompliance as Deviant Behavior: An Automated Black-box Noncompliance Checker for 4G LTE Cellular Devices – has been accepted to CCS’21. July ’21: Acknowledged by GSMA on their Mobile Security Research Acknowledgments (formerly known as Hall of Fame) page for uncovering and fixing implementation flaws/weaknesses in 4G and 5G networks.July ’21: ProChecker accepted for publication to ICDCS’21 has been nominated for the Best Paper Award.March ’21: Inducted by GSMA in the Mobile Security Research Hall of Fame for identifying design flaws/weaknesses in 4G and 5G networks. March ’21: A paper dubbed ProChecker on security analysis of 4G LTE protocol implementations has been accepted to ICDCS’21. February ’21: Paper on defense against 5G fake base station has been accepted to AsiaCCS’21. January ’21: Gave a talk at Ohio State Cybersecurity Lecture Series.January ’21: Invited to serve on the PC of ICNP’21.December ’20: PHOENIX has been accepted to NDSS’21. December ’20: Invited to serve on the PC of ESORICS’21 and SACMAT’21. December ’20: Presented the keynote talk at the IEEE VNC’20.December ’20: Gave an invited talk at the NSysS’20. November ’20: Intel has awarded $27K for our IoT protocol security work. November ’20: Invited to serve on the PC of Usenix Security’21 (fall and winter cycles). August ’20: ATFuzzer (journal version) has been accepted for publication to Digital Threats: Research and Practice.August ’20: Invited to serve on the PC of NDSS’21-fall.August ’20: Invited to serve on the PC of ASIACCS’21.August ’20: PatrIoT has been conditionally accepted to Runtime Verification’20.July ’20: Invited to serve on the PC of WebConf’21.April ’20: Paper on Zigbee security has been accepted to WiSec’20. Congratulations to Weicheng and Fabrizio!January ’20: Invited to serve on the PC of ESORICS’20. January ’20: PKI based defense against fake base stations has been featured by Wired and News Dio.December ’19: ATFuzzer has been awarded the Best Paper Award at ACSAC’19.November ’19: 5GReasoner has been featured by Wired, TechCrunch, Forbes, MIT Technology Review, Yahoo Finance, and 70+ other media outlets worldwide.November ’19: ATFuzzer has been featured in TechCrunch, Xiaomi, Deep Security News, My Digi Tech, Android Police, and 40+ other media outlets all over the world.October ’19: Intel awarded $72K for our work on IoT security.October ’19: Inducted by GSMA in the Mobile Security Research Hall of Fame for identifying design flaws/weaknesses in 5G network.October ’19: Side Channel Attacks in 4G and 5G Cellular Networks got accepted for presenting in Black Hat Europe’19.August ’19: ATFuzzer got accepted to ACSAC’19. Congrats to Imtiaz and Fabrizio! My first work as a mentor!August ’19: “Protecting the 4G and 5G Cellular Paging Protocols against Security and Privacy Attacks” got accepted to PETS’20. Congrats to Ankush!July ’19: 5GReasoner got accepted to CCS’19.March ’19: “Securing the Insecure Link of Internet-of-Things Using Next-Generation Smart Gateways” got accepted to DCOSS’19.March ’19: “Insecure Connection Bootstrapping in Cellular Networks: The Root of All Evil” got accepted to WiSec’19.February ’19: Our NDSS’19 paper has been featured by Washington Post, Wired, TechCrunch, MSN News, The Hacker News, and 100+ other media outlets worldwide.December ’18: Qualcomm awarded $10K for our work on cellular network security.December ’18: Intel awarded $65K for our work on cellular network security.November ’18: “Privacy Attacks to the 4G and 5G Cellular Paging Protocols Using Side-Channel Information” got accepted to NDSS’19. Best Paper Award Honorable Mention.March ’18: Our NDSS’18 paper has been featured by New York Times, Forbes, CNet, ACM Tech News, ZDNet, The Register, and 100+ other media outlets worldwide. Postdoc Openings: I am looking for Postdocs who are experts in formal methods (e.g., model checking, interactive theorem proving), programming languages (e.g., program analysis and synthesis), or binary analysis, and are interested in applying theories of formal methods and programming languages to systems and networking. Contact me if you are interested in the position. Graduate Research Openings: I am looking for self-motivated students interested in security to join in Spring’26 or Fall’26. Drop me an email with your CV if you want to share your interests with me. If you are not currently at Penn State but are interested in my research, please apply to the program and make sure to mention my name as a faculty member you are interested in working with. Undergraduate Research Openings: I have openings for Penn State undergraduates to take part in research projects and have hands-on experiences. Drop me an email to further discuss. Honors & Awards 2024 Distinguished Paper Award at USENIX Security Symposium https://www.usenix.org/conference/usenixsecurity24/presentation/tu USENIX Security Best Paper Awards 2022 National Science Foundation Early CAREER Award CAREER: Principled Approaches to Securing Next-Generation Cellular Networks Proposal Abstract 2022 DAPRA Young Faculty Award (YFA) The objective of the DARPA Young Faculty Award (YFA) program is to identify and engage rising stars in junior research positions, emphasizing those without prior DARPA funding, and expose them to DoD needs and DARPA’s program development process. DARPA YFA 2022 Selected as a DARPA Riser DARPA recognizes the up-and-coming standouts whose research is related to national security and dem",
  "content_length": 11901,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:01"
}