{
  "name": "Sylvie Hamel",
  "homepage": "http://www.iro.umontreal.ca/~hamelsyl",
  "status": "success",
  "content": "Page personnelle de Sylvie Hamel Sylvie Hamel Professeure titulaire et directrice Département d'informatique et de recherche opérationnelle Université de Montréal C.P. 6128, Succ. Centre-Ville Montréal, Québec, Canada, H3C 3J7 Bureau professeur: Pavillon André-Aisenstadt, local 3161 Téléphone: 1 514 343-6111 (3504) Bureau directrice: Pavillon André-Aisenstadt, local 2163 Téléphone secrétaire direction: 1 514 343-7090 Boursière APU du CRSNG (2003 - 2008) hamelsyl AT iro.umontreal.ca To English Page Domaines de recherche: Bioinformatique. Membre du Laboratoire de biologie informatique et théorique Théorie des langages et des automates. Combinatoire des mots. Polynômes de Macdonald et fonction symétriques. Membre du Laboratoire de Combinatoire et d'Informatique Mathématique de l'UQAM Publications: Articles récents. Mémoire de maîtrise: Représentations bigraduées et polynômes de Macdonald. (.ps.gz) Thèse de doctorat: Algorithmes vectoriels et bioinformatique. (.pdf) Enseignement 2021-2022: BIN7006 - Automne 2021 et Hiver 2022 (sur StudiUM) IFT2125 - Hiver 2022 (sur StudiUM) Étudiants actuellement sous ma supervision: Étudiants à la maîtrise: Xuan Kien Phung (M.Sc. en informatique). Ahmed Imed Eddine Rabah (M.Sc. en informatique). Étudiants au doctorat: Mame Seynabou Diop (M.Sc. en bio-informatique). (Ph.D. bio-informatique) Mashael Etaiwi (Ph.D. informatique), co-direction avec Yann-Gaël Guéhéneuc, Université Concordia Étudiants diplômés Les femmes et les mathématiques et/ou l'informatique : La page \"Les femmes du DIRO\" est accessible ici . Un événement annuel pour les jeunes filles du secondaire intéressées par les sciences: \" Les filles et les sciences, un duo électrisant\" Quelques photos du kiosque du DIRO pour l'année 2007 (cryptologie et imagerie) sont disponibles ici, ici et là . Un superbe programme dans lequel j'ai eu l'occasion de participer comme démonstratrice (1998) puis comme professeure (2003): Summer Program for Women in Mathematics . La page web des femmes en mathématiques de la Société Mathématique du Canada est ici La page web sur le status des femmes en informatique est ici Curriculum Vitae (.pdf) Sylvie Hamel hamelsyl AT iro.umontreal.ca",
  "content_length": 2191,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:10"
}