{
  "name": "Sylvia Xueni Pan",
  "homepage": "https://www.gold.ac.uk/computing/people/pan-sylvia-xueni",
  "status": "success",
  "content": "Professor Sylvia Xueni Pan | Goldsmiths, University of London Main menu Staff & students In this section Sylvia has extensive experience working in VR researching Virtual Reality technology and social neuroscience. Staff details Position Professor of Virtual Reality Department Computing Email x.pan (@gold.ac.uk) Website http://panxueni.com Xueni Pan is a Professor of Virtual Reality. Working in VR for almost 20 years she developed a unique interdisciplinary research profile with journal and conference publications in both VR technology and social neuroscience. Her work in training and education in VR has been featured multiple times in the media, including BBC Horizon and the New Scientist magazine. More info can be found on Xueni Pan's website. Academic qualifications 2009 PhD in Virtual Reality, Computer Science Department, UCL 2005 MSc in Vision, Imaging, and Virtual Environments, Computer Science Department, UCL 2004 BEng in Computer Science, Beihang University, Beijing, China Teaching Before joining Goldsmiths in 2015, she worked as a research associate in Computer Science, UCL from 2009-2013, and in the Institute of Cognitive Neuroscience (ICN), UCL from 2013-2015, where she remains an honorary research fellow. Modules she taught/is current teaching at Goldsmiths include: 3D Virtual Environments and Animation (previously Advanced Graphics and Animation) Data Visualisation Audio-Visual Computing Perception and Multimedia Computing Areas of supervision The use of Immersive Virtual Reality in: Cognitive Neuroscience, Social Interaction, Training, Education, and Psychotherapy. VR technology: Character Animation (facial expression, motion capture), Photogrammetry built Virtual Environment. Professional activities Xueni Pan has participated in the following projects Picking up ethical challenges within the humdrum of professional practice: can 3D avatars help? Funded by the Leverhulme Trust, HENCEL (Health Education North and Central London), and the Wellcome Trust. In Collaboration with UCL Laws and UCL Computer Science. More info can be found on the Virtual Realities and Professions page. INTERACT: ERC funded project looking at how we subconsciously copy each other, using Virtual Reality. The project was based at the Institute of Cognitive Neuroscience (ICN), UCL. More info can be found on INTERACT's webpage. Moral Judgement and Virtual Reality: funded by the Leverhulme Trust to investigate how we make moral judgements - and more importantly whether our moral judgements are aligned with our moral action, in Virtual Reality. The project was based at the Department of Computer Science, UCL. More info can be found on UCL's project page. Featured work Xueni Pan, Mel Slater, Alejandro Beacco, Xavi Navarro, Anna I. Bellido Rivas, David Swapp, Joanna Hale, Paul A. Forbes, Catrina Denvir, Antonia Hamilton, Sylvie Delacroix. The Responses of Medical General Practitioners to Unreasonable Patient Demand for Antibiotics-A Study of Medical Ethics Using Immersive Virtual Reality. PloS one 11, no. 2 (2016): e0146837. Responses of Medical General Practitioners YouTube. Xueni Pan, & Antonia Hamilton (2015): Automatic imitation in a rich social context with virtual characters. Frontiers in Psychology. 6, 790 Automatic imitation YouTube. Xueni Pan, Marco Gillies, & Mel Slater (2015). Virtual Character Personality Influences Participant Attitudes and Behavior - An Interview with a Virtual Human Character about Her Social Anxiety. Frontiers in Robotics and AI 2. Virtual Character Personality Influences YouTube. Pan, X., Gillies, M., Barker, C., Clark, D. M., & Slater, M. (2012). Socially anxious and confident men interact with a forward virtual woman: an experimental study. PloS one, 7(4), e32931. Pan, X., & Slater, M. (2011, July). Confronting a moral dilemma in virtual reality: a pilot study. In Proceedings of the 25th BCS Conference on Human-Computer Interaction (pp. 46-51). British Computer Society. Publications and research outputs Book SectionSemi-Autonomous Avatars: A New Direction for Expressive User Embodiment Gillies, Marco ; Ballin, Daniel; Pan, Xueni ORCID logo ; and Dodgson, Neil. 2008. Semi-Autonomous Avatars: A New Direction for Expressive User Embodiment. In: Lola Cañamero and Ruth Aylett, eds. Animating Expressive Characters for Social Interaction. John Benjamins Publishing Company, pp. 235-255. ISBN 9789027252104 ArticleAvatars in mixed-reality meetings: A longitudinal field study of realistic versus cartoon facial likeness effects on communication, task satisfaction, presence, and emotional perception Dobre, Georgiana Cristina ORCID logo ; Wilczkowiak, Marta; Gillies, Marco ; Pan, Xueni ORCID logo ; and Rintel, Sean. 2025. Avatars in mixed-reality meetings: A longitudinal field study of realistic versus cartoon facial likeness effects on communication, task satisfaction, presence, and emotional perception. International Journal of Human-Computer Studies, 205, 103632. ISSN 1071-5819 A Multidisciplinary Approach to Understanding the Technology, Opportunities, Challenges, and Implications for Society of the Metaverse Slater, Mel; Di Dalmazi, Michele; Friedman, Doron; Galissaire, Jessica; Isaac, Henri; Kobusinska, Anna; Lopez-Tarruella-Martinez, Aurelio; Luciao, Lamberti; Lucas, Jean-François; Aziz Niamut, Omar; +8 more...Pan, Xueni ORCID logo ; Prie, Yannick; Quent, Matthias; Ruiz Rodriguez, Raul; Sanchez-Vives, Maria V.; Skrzypczyński, Piotr; Steed, Anthony; and Wannerberg, Petter. 2025. A Multidisciplinary Approach to Understanding the Technology, Opportunities, Challenges, and Implications for Society of the Metaverse. Frontiers in Virtual Reality, 6, 1566419. ISSN 2673-4192 Shaping the future: principles for policy recommendations for responsible innovation in virtual worlds Cork, Alicia G; Richardson, Mike; Lukosch, Heide K; Khamis, Mohamed; Katins, Christopher; Krauss, Veronika; Ruffin, Lauren; Papazoglakis, Sarah; Sanchez, Victoria; Pan, Xueni ORCID logo ; +2 more...Proulx, Michael J; and Stanton Fraser, Danaë. 2025. Shaping the future: principles for policy recommendations for responsible innovation in virtual worlds. Frontiers in Virtual Reality, 6, 1645330. ISSN 2673-4192 Show more information Protocol for biomimetic tumoroid models by plastic compression using centrifugation Devereaux, Sam; Lam, Ashley; Upadhyay, Anuja; Fallows, Megan; Qiu, Lianqi; Pan, Xueni ORCID logo ; and Cheema, Umber. 2025. Protocol for biomimetic tumoroid models by plastic compression using centrifugation. STAR Protocols, 6(2), 103718. ISSN 2666-1667 Digital twin embodied interactions design: Synchronized and aligned physical sensation in location-based social VR Zhang, Ju ORCID logo ; Ma, Fang ORCID logo ; Pi, Yuke ORCID logo ; Du, Haoyang ORCID logo ; and Pan, Xueni ORCID logo . 2025. Digital twin embodied interactions design: Synchronized and aligned physical sensation in location-based social VR. Frontiers in Virtual Reality, 6, 1499845. ISSN 2673-4192 Setting the Stage: Using Virtual Reality to Assess the Effects of Music Performance Anxiety in Pianists ThompSon, Nicalia; Pan, Xueni ORCID logo ; and Herrojo Ruiz, Maria ORCID logo . 2025. Setting the Stage: Using Virtual Reality to Assess the Effects of Music Performance Anxiety in Pianists. IEEE Transactions on Visualization and Computer Graphics, 31(5), 2504 -2514. ISSN 1077-2626 Embodied time travel in VR: from witnessing climate change to action for prevention Pi, Yuke ; Pan, Xueni ORCID logo ; Slater, Mel; and Świdrak, Justyna. 2025. Embodied time travel in VR: from witnessing climate change to action for prevention. Frontiers in Virtual Reality, 5, 1499835. ISSN 2673-4192 Immersive Intergroup Contact: Using Virtual Reality to Enhance Empathy and Reduce Stigma Towards Schizophrenia Yin, Jiaqi ORCID logo ; Liu, Shihan ORCID logo ; Lee, Shao-Wen ORCID logo ; Kitsios, AndreasORCID logo; Gillies, Marco ORCID logo ; Birtel, Michèle DeniseORCID logo; Farmer, HarryORCID logo; and Pan, Xueni ORCID logo . 2025. Immersive Intergroup Contact: Using Virtual Reality to Enhance Empathy and Reduce Stigma Towards Schizophrenia. IEEE Transactions on Visualization and Computer Graphics (TVCG), 31(11), pp. 9656-9666. ISSN 1077-2626 A randomized controlled experiment testing the use of virtual reality to trigger cigarette craving in people who smoke Rovira, Aitor; Lambe, Sinead; Beckwith, Helen; Ahmed, Memoona; Hudson, Felicity; Haynes, Phoebe; Yu, Chun-Jou ; Williams, Kira; Saidel, Simone; Iredale, Ellen; +4 more...McBride, Sapphira ; Waite, Felicity; Pan, Xueni ORCID logo ; and Freeman, Daniel. 2024. A randomized controlled experiment testing the use of virtual reality to trigger cigarette craving in people who smoke. Scientific Reports, 14, 19445. ISSN 2045-2322 Immersive Machine Learning for Social Attitude Detection in Virtual Reality Narrative Games Dobre, Georgiana Cristina ORCID logo ; Gillies, Marco ; and Pan, Xueni ORCID logo . 2022. Immersive Machine Learning for Social Attitude Detection in Virtual Reality Narrative Games. Virtual Reality, 26(4), pp. 1519-1538. ISSN 1359-4338 A Comparison of the Effects of Haptic and Visual Feedback on Presence in Virtual Reality Gibbs, Janet K. ; Gillies, Marco ; and Pan, Xueni ORCID logo . 2022. A Comparison of the Effects of Haptic and Visual Feedback on Presence in Virtual Reality. International Journal of Human-Computer Studies, 157, 102717. ISSN 1071-5819 Meeting Remotely-The Challenges of Optimal Avatar Interaction in VR Zibrek, Katja; Pan, Xueni ORCID logo ; and Orel, Marko. 2021. Meeting Remotely-The Challenges of Optimal Avatar Interaction in VR. Frontiers in Virtual Reality, 2, 773258. ISSN 2673-4192 The Impact of Self-Representation and Consistency in Collaborative Virtual Environments Collingwoode-Williams, Tara ; O'Shea, Zoe ; Gillies, Marco ; and Pan, Xueni ORCID logo . 2021. The Impact of Self-Representation and Consistency in Collaborative Virtual Environments. Frontiers in Virtual Reality, 2, 648601. ISSN 2673-4192 Positive i",
  "content_length": 27986,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:12"
}