{
  "name": "Sylvain Martel",
  "homepage": "https://www.polymtl.ca/expertises/en/martel-sylvain",
  "status": "success",
  "content": "Martel, Sylvain | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Martel, Sylvain Poly Directory Courses Français Directory of Experts Martel, Sylvain Directory of Experts Back to search results Edit my profileHelp Publications Link(s) Sylvain Martel B.Ing. (UQTR), M.Sc.A., Ph.D. (McGill) Publications Link(s) Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 5098 Fax: (514) 340-5139 Room: M-4103 sylvain.martel@polymtl.ca Research interests and affiliations Research interests Micro and nanosystems Nanorobotics Development of novel medical interventional platforms Affiliation(s) NanoRobotics Laboratory, Director Institut de génie biomédical, Member Institute for Data Valorization (IVADO), Member Publications Recent publications Journal article Zamanidoost, Y., Rivron, M., Ould-Bachir, T., & Martel, S. (2025). DA OMS-CNN: Dual-Attention OMS-CNN with 3D Swin Transformer for Early-Stage Lung Cancer Detection. Informatics, 12(3), 65-65. Journal article Li, N., Fei, P., Tous, C., Rezaei Adariani, M., Hautot, M.-L., Ouedraogo, I., Hadjadj, A., Dimov, I. P., Zhang, Q., Lessard, S., Nosrati, Z., Ng, C. N., Saatchi, K., Häfeli, U. O., Tremblay, C., Kadoury, S., Tang, A., Martel, S., & Soulez, G. (2024). Human-scale navigation of magnetic microrobots in hepatic arteries. Science Robotics, 9(87), 8702. Journal article Zamanidoost, Y., Ould-Bachir, T., & Martel, S. (2024). OMS-CNN: Optimized Multi-Scale CNN for Lung Nodule Detection Based on Faster R-CNN. IEEE Journal of Biomedical and Health Informatics, 1-13. Journal article Li, N., Tous, C., Dimov, I. P., Fei, P., Zhang, Q., Lessard, S., Tang, A., Martel, S., & Soulez, G. (2023). Design of a Low-cost, Self-adaptive and MRI-compatible Cardiac Gating System. IEEE Transactions on Biomedical Engineering, 70(11), 3126-3136. See all publications (277) Teaching Électronique. Architecture des ordinateurs. Supervision at Polytechnique COMPLETED Ph.D. Thesis (14) Gagné, K. (2020). Applications de la résonance magnétique nucléaire dans le champ magnétique de fuite des appareils cliniques d'imagerie par résonance magnétique [Ph.D. thesis, Polytechnique Montréal]. Azizi, A. (2019). Using the Fringe Field of MRI Scanner for the Navigation of Microguidewires in the Vascular System [Ph.D. thesis, Polytechnique Montréal]. Li, N. (2019). Flow Control and MRI-Compatible Particle Injector: Application to Magnetic Resonance Navigation [Ph.D. thesis, Polytechnique Montréal]. Latulippe, M. (2017). Guidage magnétique par champs de dipôles pour l'administration ciblée d'agents thérapeutiques [Ph.D. thesis, École Polytechnique de Montréal]. Bigot, A. (2015). Navigation multi-bifurcations de corps ferromagnétiques avec un scanner d'imagerie par résonance magnétique [Ph.D. thesis, École Polytechnique de Montréal]. Olamaei, N. (2015). 3D Visualization of Microvascular Networks Using Magnetic Particles: Application to Magnetic Resonance Navigation [Ph.D. thesis, École Polytechnique de Montréal]. Sharafi Tafreshi Moghaddam, A. (2015). MRI-Based Communication with Untethered Intelligent Medical Microrobots [Ph.D. thesis, École Polytechnique de Montréal]. Tabatabaei Shafie, S. N. (2015). Transient and Local Increase in the Permeability of the Blood-Brain Barrier and the Blood-Retinal Barrier by Hyperthermia of Magnetic Nanoparticles in a Rat Model [Ph.D. thesis, École Polytechnique de Montréal]. Taherkhani, S. (2015). Attachment of Therapeutic and Imaging Agents to Magnetotactic Bacteria Acting as Self-Propelled Bio-Carriers for Cancer Treatment [Ph.D. thesis, École Polytechnique de Montréal]. Lu, Z. (2012). Towards Single Bacterium Detection: A Microelectronic/Microfluidic Hybrid System Based on a CMOS Technology [Ph.D. thesis, École Polytechnique de Montréal]. Felfoul, O. (2011). MRI-Based Tumour Targeting Enhancement with Magnetotactic Bacterial Carriers [Ph.D. thesis, École Polytechnique de Montréal]. Pouponneau, P. (2011). Microparticules magnétiques thérapeutiques pour la chimio-embolisation ciblée du foie [Ph.D. thesis, École Polytechnique de Montréal]. André, W. (2009). Conception et fabrication d'un microrobot sans fil autonome opérant dans un milieu aqueux [Ph.D. thesis, École Polytechnique de Montréal]. Mathieu, J.-B. (2009). Étude des paramètres physiques en vue d'applications médicales de l'actionnement magnétique de dispositifs médicaux par un système d'imagerie par résonance magnétique [Ph.D. thesis, École Polytechnique de Montréal]. Master's Thesis (27) Majedi, Y. (2018). Attachment of Therapeutic and Imaging Agents to Flagellated Magneto-Aerotactic Bacteria Cells for Tumor Treatment and Targeting Purposes [Master's thesis, École Polytechnique de Montréal]. Loghin, D. (2016). Études des configurations spatio-temporelles du champ magnétique sur le contrôle des bactéries magnétotactiques [Master's thesis, École Polytechnique de Montréal]. Mandal, K. K. (2016). Intra-Operative Needle Tracking Using Optical Shape Sensing Technology [Master's thesis, École Polytechnique de Montréal]. Salama, H. (2015). Studying the Characteristics of Liposomes Composed of DMPC by Lipid Film Hydration Technique to be Manipulated as Carriers for Magnetotactic Bacteria [Master's thesis, École Polytechnique de Montréal]. de Lanauze, D. (2013). Contrôle tridimensionnel de bactéries magnétotactiques agissant comme microrobots pour le transport actif de médicament vers une tumeur [Master's thesis, École Polytechnique de Montréal]. Vidal Ibacache, G. (2013). Therapeutic Magnetic Microcarriers Characterization by Measuring Magnetophoretic Attributes [Master's thesis, École Polytechnique de Montréal]. Lalande, V. (2012). Conception, caractérisation et validation d'un embout de fil-guide magnétique dirigé par un appareil d'imagerie à résonance magnétique amélioré [Master's thesis, École Polytechnique de Montréal]. Lapointe, J. (2012). Fabrication et caractérisation d'hydrogels thermosensibles pour des applications de livraison ciblée de médicament et d'embolisation [Master's thesis, École Polytechnique de Montréal]. Vonthron, M. (2012). Plateforme pour le guidage de dispositifs thérapeutiques sub-millimétriques par IRM [Master's thesis, École Polytechnique de Montréal]. Bringout, G. (2011). Actionneur pour le guidage de micro-particules magnétiques et thérapeutiques dans le système vasculaire : bobines de gradients pulsés pour des essais pré-cliniques [Master's thesis, École Polytechnique de Montréal]. Peng, K. (2011). Design and Implementation of a Fuzzy Controller for Steering Microparticles Inside Blood Vessels by Using a MRI System [Master's thesis, École Polytechnique de Montréal]. Tabatabaei Shafie, S. N. (2010). Evaluation of Hyperthermia Using Magnetic Nanoparticles and Alternating Magnetic Field [Master's thesis, École Polytechnique de Montréal]. Bey-Oueslati, R. (2007). Intégration industrielle de la méthode d'écriture directe d'encre pour la dissipation thermique de composants électroniques [Master's thesis, École Polytechnique de Montréal]. Aboussouan, É. (2006). Positionnement dynamique d'un dispositif endovasculaire ferromagnétique dans un système d'imagerie par résonance magnétique [Master's thesis, École Polytechnique de Montréal]. Chanu, A. (2006). Conception d'une architecture logicielle pour l'intégration des systèmes de positionnement, contrôle et propulsion d'un dispositif ferromagnétique endovasculaire autonome guidé par IRM [Master's thesis, École Polytechnique de Montréal]. Hannoyer, P. (2006). Caractérisation du refroidissement par convection forcée horizontale d'une flotte de robots miniatures [Master's thesis, École Polytechnique de Montréal]. Pouponneau, P. (2006). Biocompatibilité de matériaux magnétiques candidats pour la réalisation de micro/nano dispositifs thérapeutiques [Master's thesis, École Polytechnique de Montréal]. Tamaz, S. (2006). Conception et implémentation d'un contrôleur pour l'asservissement d'une bille ferromagnétique à l'intérieur du système cardiovasculaire à l'aide d'un appareil d'IRM [Master's thesis, École Polytechnique de Montréal]. Truong, O.-D. (2006). Fabrication et intégration d'un micromoteur électrostatique avec un soc dans un microrobot [Master's thesis, École Polytechnique de Montréal]. Zhang, J. Y. (2006). Nanowalker software system development [Master's thesis, École Polytechnique de Montréal]. Felfoul, O. (2005). Techniques de positionnement d'objets ferromagnétiques en IRM [Master's thesis, École Polytechnique de Montréal]. Fortin, M.-A. (2005). Alimentation intermittente d'un robot miniature et sans fil, synchronisée avec ses déplacements [Master's thesis, École Polytechnique de Montréal]. Delafosse, M. J.-A. (2004). Conception et fabrication d'un micromoteur électrostatique en vue de son intégration dans un microrobot [Master's thesis, École Polytechnique de Montréal]. Macicior, H. (2004). Contrôle de température de la chambre de refroidissement des nanowalkers [Master's thesis, École Polytechnique de Montréal]. Mathieu, J.-B. (2004). Méthode de propulsion d'un corps ferromagnétique à l'aide d'un système d'imagerie par résonance magnétique [Master's thesis, École Polytechnique de Montréal]. Pigeon, S. (2004). Conception et fabrication d'une matrice de microélectrodes corticales implantables [Master's thesis, École Polytechnique de Montréal]. St-Jacques, D. (2004). Conception d'une architect",
  "content_length": 36430,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:08"
}