{
  "name": "Sylvia L. Herbert",
  "homepage": "http://sylviaherbert.com",
  "status": "success",
  "content": "The Safe Autonomous Systems Lab The Safe Autonomous Systems LabOur lab works to provide scalable safety assurances and control policies based on available models and data about the system and environment. These techniques must be able to quickly adapt to unexpected changes and new information in the autonomous system or the environment. We use tools from optimal control theory and dynamics games, machine learning, and cognitive science to develop new techniques for safety and efficiency in autonomous systems. These techniques are backed by both rigorous theory and physical testing on robotic platforms. News - Papers and Graduations[September 2025] - We have 5 accepted workshop papers at CoRL 2025! Congratulations to all the authors, especially undergraduate Matthew Kim, who led one of the workshop papers. These papers will appear in both the 2nd Workshop on Safe and Robust Robot Learning for Operation in the Real World, and Beyond Rigid Worlds: Representing and Interacting with Non-Rigid Objects Workshop. Please come visit and chat with our in-person attendees Sander Tonkens, Nikhil Shinde, and Azra Begzadić![September 2025] - The paper by Dylan Hirsch called Control of Subpopulation Fractions in a Population of Bistable Cells was accepted to LCSS![August 2025] - The paper by Sander Tonkens, Nikhil Shinde, and Azra Begzadić called Space to Time: Out-of-Distribution Generalization of Safety Filters via Temporal Disturbance Encoding was accepted to CoRL 2025. The students came up with a clever idea to handle uncertain windscapes for UAVs. The robot does predictive planning based on a pessimistic view of the world: it believes that as it travels, the wind will increase at a parameterized rate. Therefore, the safe set that it can operate within is assumed to shrink over time. However, while the robot is pessimistic about the future to maintain recursive safety, it is realistic about the current time: at each timestep, it evaluates the current wind level and rate of change and uses those to “reset” the shrinking safe set and corresponding safe control policy. This pairing of realism in the now with pessimism about the future allows the robot to navigate in a manner that is less conservative than worst-case safety, without losing recursive safety guarantees. This work is in collaboration with Jorge Cortés and Michael Yip.[July 2025] - The paper by Dylan Hirsch called Approximate Hamilton-Jacobi Reachability Analysis for a Class of Two-Timescale Systems, with Application to Biological Models was accepted to CDC 2025. This paper explores how to decompose reachability problems (reach a goal and/or avoid obstacles) in time. The idea is that certain dynamics of a system may operate on a fast scale (e.g. binding and unbinding of proteins in a cell) and other aspects of the system may evolve on a slower timescale (e.g. cell growth). Under certain assumptions, we can decompose these two timescales using singular perturbation techniques into subproblems that are more tractable to solve. When we recompose the solutions, we are able to obtain the analysis for the original full-scale system. We demonstrate the utility of our results on two examples involving biological systems, where dynamics fitting the identified class are frequently encountered.[July 2025] - The paper by Azra Begzadić called Learning High-Order CBFs using Gaussian processes for systems in Brunovský canonical form was accepted to CDC 2025. Signed distance functions are useful for providing directional information about obstacles of other constraints in the state space via their gradients. However, for many constraint sets, the signed distance function is not differentiable everywhere. This is an issue for two reasons: a) there are no longer gradients that inform the direction of safety, and b) the nonsmooth function cannot be approximated and learned by Bayesian online learning techniques such as Gaussian Processes (GPs). This paper introduces a smoothing technique to resolve both of these issues and shows theoretical and empirical results in simulation on a planar system and a robotic manipulator. This paper is in collaboration with Jorge Cortés at UCSD and Armin Lederer at NUS.[July 2025] - The paper by Zheng Gong and Boyang Li called Reach-Avoid-Stabilize Using Admissible Control Sets was accepted to CDC 2025. This paper introduces an approach to generate a value function (and corresponding reachable set and control policy) for the problem of finite-time stabilization to a target while avoiding obstacles. A compositional approach using “admissible control sets” is introduced that maintains conservative guarantees and allows for modularity/generalizability.[June 2025] - Zheng Gong is officially the first student to graduate from our group with a PhD! His thesis is titled \"Practical and Efficient Stabilizability and Returning to Safety.\"As one of the first students in the group, Zheng's personality helped shape the culture in the lab; his positivity, focus, and eagerness to discuss ideas led to many novel research directions and fun collaborations across different departments and universities. He has also always been eager to work with undergraduate and master's students, including Chong He (now a PhD student at SFU), Milan Ganai (now a PhD student at Stanford), Joe Jeong (now a PhD student at CMU), and current students Yeiry Melendez and Colleen Wang. Congratulations to Dr. Zheng Gong![May 2025] - Congratulations to Nikhil Shinde, who won the Best Paper Award at the ICRA Workshop on Reflections on Representations and Manipulating Deformable Objects![April 2025] - Congratulations to our graduating undergrad Marfred Barrera! Marfred received the NSF GRFP and will be starting as a PhD student with Prof. Negar Mehr’s group at Berkeley.[April 2025] - Congratulations to our graduating undergrad Hyun Joe Jeong! Joe received the NSF GRFP and will be starting as a PhD student with Prof. Andrea Bajcsy’s group at CMU.[March 2025] - Will Sharpless’ paper (below) was nominated for Best Paper at L4DC![February 2025] - The paper by Will Sharpless called Linear Supervision for Nonlinear, High-Dimensional Neural Control and Differential Games was accepted to L4DC 2025. This focuses on how physics-informed neural network approaches like DeepReach are more scalable than grid-based approaches for solving differential games, but struggle to find solutions with highly nonlinear dynamics. Will uses two different methods that use rapidly generated linear solutions to the partial differential equation (PDE) arising in the problem to accelerate and improve learned value functions for guidance in high-dimensional, nonlinear problems. This paper is in collaboration with Somil Bansal at Stanford.[February 2025] - The paper by Azra Begzadić, Nikhil Sihnde, Sander Tonkens, and Kaleb Ugalde called Back to Base: Towards Hands-Off Learning via Safe Resets with Reach-Avoid Safety Filters was accepted to L4DC 2025. This focuses on maintaining safety and the ability to “return to base” during online reinforcement learning. This is done by computing a time-varying reach-avoid value function used as a safety filter that minimally modifies the learning procedure to ensure both safety and goal satisfaction. This paper is in collaboration with Jorge Cortés and Michael Yip.[July 2024] - The paper led by Will Sharpless on State-Augmented Linear Games with Antagonistic Error for High-Dimensional, Nonlinear Hamilton-Jacobi Reachability was accepted to CDC 2024. This paper employs a tool from the applied math community (Hopf reachability) to perform very fast reachability analysis. The catch is that this tool requires the system to be linear time varying. By linearizing a nonlinear system (by lifting it to a higher dimension), Will shows that we can bound the resulting linearization error and treat this error as an adversarial disturbance in the reachability computation. This results in guaranteed conservative results on the true nonlinear system with the speedup available using the linear approach. This paper is in collaboration with Professor Yat Tin Chow at UC Riverside.[July 2024] - The paper led by Zheng Gong and Hyun Joe Jeong on Synthesizing Control Lyapunov-Value Functions for High-Dimensional Systems Using System Decomposition and Admissible Control Sets was accepted to CDC 2024. This paper builds on previous work that demonstrates how to construct “control Lyapunov value functions” that can be used to stabilize a system to a control invariant set. The approach to construct these methods is computationally intensive, thus this paper focuses on how decomposition techniques can be used to recover exact reconstructions for certain classes of systems, providing significant speedup to computed such functions.[July 2024] - The paper led by Sander Tonkens on Patching Approximately Safe Value Functions Leveraging Local Hamilton-Jacobi Reachability Analysis was accepted to CDC 2024. This paper shows how scalable but invalid safety filter approximations generated by learning-based methods (e.g. neural CBFs) can be locally “patched” using rigorous control theoretic techniques (Hamilton-Jacobi reachability) to provide safety guarantees. This paper is in collaboration with Professor Sicun Gao and his students.[July 2024] - The paper led by Nikhil Shinde on SURESTEP: An Uncertainty-Aware Trajectory Optimization Framework to Enhance Visual Tool Tracking for Robust Surgical Automation was accepted to IROS 2024. This paper provides an algorithm through which a surgical robot can plan trajectories that maximize accurate estimation of its end effectors and tools based on possible perception issues from the endoscopic camera used for sensing. This paper is in collaboration with Professor Michael Yip.[June 2024] - Congratulations to those who just graduated from our group!Judy Mohamad (BS, MAE) will be starting her MS/PhD at Tokyo TechSosuke Kojima (BS, MAE) will be starting his MS at ETH ZurichZihang (River) He (",
  "content_length": 23473,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:08"
}