{
  "name": "Sylvain Malacria",
  "homepage": "http://www.malacria.com",
  "status": "success",
  "content": "Sylvain Malacria - Research Scientist at Inria Home Publications Jobs Teachings CV Sylvain Malacria Loki group Inria Centre at the University of Lille Batiment B, bureau B102 40, avenue Halley - Park Plaza 59650 Villeneuve d'Ascq, France Phone: +33 (0)3 59 35 8785 sylvain dot malacria at inria dot fr Latest news: 2025 Nov. 13th: Very happy for Vincent Lambert who successfully defended his PhD on Representation of interactions based on hand microgestures. Congratulations Dr. Lambert! 2025 Nov. 6th: Raphaël Perraud's work on metrics for estimating perceptual distances between interfaces and collaboration with Gilles Bailly on the the role of social interactions in the discovery of keyboard shortcuts have respectively received best Work-in-progress and best paper awards at the 36th IHM conference. Great job guys! 2025 Mar. 3rd: Looking forward to CHI 2025 in Yokohama, where Eva Mackamul will present her paper on interaction discoverability (she also received a Honorable mention award! Congrats), Alice Loizeau her TOCHI paper on interaction interferences, Xinrui Fang his Late-Breaking-Work on scientific bibliography practice, and Kazuhiro Shinoda will demonstrate his work on tactile design. I will also take part in the Meta-HCI workshop to collectively reflect on how HCI can refine its methodologies. Really can't wait! I am a research scientist (Chargé de Recherche, HDR) at Inria, in the Loki group, currently visiting Prof. Koji Yatani 's' Interactive Intelligent Systems Laboratory at the University of Tokyo as a JSPS Invited fellow . Prior to that, I was a post-doctoral researcher at the University College London and at the University of Canterbury (New-Zealand). I did my Ph.D. at Télécom ParisTech, and passed my Master Degree at UPMC in Artificial Intelligence with a speciality in HCI. I am also an adjunct assistant professor at the University of Waterloo, Canada (2021-2028). My research interests are in the areas of human-computer interaction (HCI), with additional focus on designing interactive systems and interaction techniques that can be easily discovered and learned by novice users, while still yielding high performance to more practiced users. More generally, I am highly interested in how interaction can be communicated to the user to foster its discovery. If you are curious about my research, giving a look at the selected recent publications below should provide a decent overview. I currently am the Principal Investigator of the ANR JCJC Discovery project (2020-2025) that investigates the design of Graphical User Interfaces that would better support the discovery of their interactive principles. Selected recent Publications Does Adding Visual Signifiers in Animated Transitions Improve Interaction Discoverability? (CHI '25) [PDF] Studying the Simultaneous Visual Representation of Microgestures (MobileHCI '24) [PDF] Tutorial Mismatches: Investigating the Frictions due to Interface Differences when Following Software Video Tutorials (DIS '24) [PDF] Clarifying and Differentiating Discoverability (HCI' 24) [PDF] Statslator: Interactive Translation of NHST and Estimation Statistics Reporting Styles in Scientific Documents (UIST '23) [PDF] Exploring Visual Signifier Characteristics to Improve the Perception of Affordances of In-Place Touch Inputs (MobileHCI '23) [PDF] Studying the Visual Representation of Microgestures (MobileHCI '23) [PDF] Charagraph: Interactive Generation of Charts for Realtime Annotation of Data-Rich Paragraphs (CHI '23) [PDF] Ongoing student supervisions Raphaël Perraud (PhD Student funded by the Discovery project ) Suliac Lavenant (PhD Student funded by the ANR MIC project, co-supervised with Laurence Nigay, Alix Goguey and Thomas Pietrzak) Antoine Nollet (PhD Student funded by the University of Lille, co-supervised with Bruno Fruchard and Carla Griggio) Maëva Calmettes (PhD Student at University of Lyon, co-supervised with Aurélien Tabard and Mathieu Nancel, funded by the PEPR Ensemble ) Previous student supervisions Vincent Lambert (Defended Nov. 13th 2025, co-supervised with Laurence Nigay and Alix Goguey) Constant Yuan Chen (Defended Sep. 20th 2024, co-supervised with Géry Casiez, Daniel Vogel and Edward Lank) Eva Mackamul (Defended Dec. 21st 2023, co-supervised with Géry Casiez) -- Now Post Doc at Université Grenoble Alpes Damien Masson (Defended Aug. 2nd 2023, co-supervised with Géry Casiez, Daniel Vogel and Edward Lank) -- Now Assistant Professor at the Université de Montréal Axel Antoine (Defended Jan. 29th 2021, co-supervised with Géry Casiez) -- Now lead software engineer at Stereograph Nicole Pong (Defended Oct. 21st 2020, co-supervised with Stéphane Huot and Nicolas Roussel) © S. Malacria, Loki group",
  "content_length": 4737,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:07"
}