{
  "name": "Sylvia Perez-Hardy",
  "homepage": "https://www.rit.edu/gccis/sylvia-perez-hardy",
  "status": "success",
  "content": "Sylvia Perez-Hardy | Golisano College of Computing and Information Sciences | RIT RIT Logo with Text Sylvia Perez-Hardy Associate Professor School of Information Golisano College of Computing and Information Sciences sphics@rit.edu 585-475-7941 Office Hours Monday through Thursdays from 9am - 4:30 pm by appointment Schedule Appointment via Calendly link below: https://calendly.com/perez-hardy/30min Office Location GOL-2311 Office Mailing Address 152 Lomb Memorial Drive Rochester, NY 14623 Sylvia Perez-Hardy Associate Professor School of Information Golisano College of Computing and Information Sciences Education BS, MBA, Cornell University sphics@rit.edu 585-475-7941 Personal Links Curriculum Vitae Select Scholarship Published Conference ProceedingsPerez-Hardy, Sylvia, et al. \"The Security Implications of IMSI Catchers.\" Proceedings of the 2015 International Conference on Security and Management. Ed. Dr. Kevin Daimi. Detroit, MI: n.p., Web. Currently Teaching ISTE-230Introduction to Database and Data Modeling3 CreditsA presentation of the fundamental concepts and theories used in organizing and structuring data. Coverage includes the data modeling process, basic relational model, normalization theory, relational algebra, and mapping a data model into a database schema. Structured Query Language is used to illustrate the translation of a data model to physical data organization. Modeling and programming assignments will be required. Note: students should have one course in object-oriented programming.ISTE-608Database Design And Implementation3 CreditsAn introduction to the theory and practice of designing and implementing database systems. Current software environments are used to explore effective database design and implementation concepts and strategies. Topics include conceptual data modeling, methodologies, logical/physical database design, normalization, relational algebra, schema creation and data manipulation, and transaction design. Database design and implementation projects are required.MEDI-735Clinical Information Systems3 CreditsA study of the component approach to clinical information systems. Students will learn about the evolution of Health Information Systems, and the variety of systems offered by vendors at the present time. The importance of the Electronic Health Record (EHR), the Computerized Physician Order Entry (CPOE) and Clinical Decision Support will be stressed as they become the focal points in clinical information systems. The following components will be studied in detail: patient, activity, health record, knowledge, and security components. The role of imaging management and integration will also be reviewed.NSSA-241Introduction to Routing and Switching3 CreditsThis course provides an introduction to wired network infrastructures, topologies, technologies, and the protocols required for effective end-to-end communication. Basic security concepts for TCP/IP based technologies are introduced. Networking layers 1, 2, and 3 are examined in-depth using the International Standards Organization’s Open Systems Interconnection and TCP/IP models as reference. Course topics focus on the TCP/IP protocol suite, the Ethernet LAN protocol, switching technology, and routed and routing protocols common in TCP/IP networks. The lab assignments mirror the lecture content , providing an experiential learning component for each topic covered. In the News September 15, 2021 Student presents at international conference, publishes articles More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 3720,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:11"
}