{
  "name": "Szymon M. Rusinkiewicz",
  "homepage": "https://www.cs.princeton.edu/~smr",
  "status": "success",
  "content": "Szymon Rusinkiewicz Szymon Rusinkiewicz (he/him) David M. Siegel '83 Professor Chair, Department of Computer Science Associated Faculty, Program in Applied and Computational Mathematics PACM Email smr at princeton Office CS building, room 222 Address Department of Computer Science Princeton University 35 Olden St. Princeton, NJ  08540-5233 Office hours make an appointment (in-person or virtual) Teaching Fall, 2025 No teaching. Older classes... Fall, 2023 COS 217 - Introduction to Programming Systems Fall, 2022 COS 426 - Computer Graphics Fall, 2021 COS 217 - Introduction to Programming Systems Spring, 2021 COS 217 - Introduction to Programming Systems Fall, 2020 COS 302 / SML 305 - Mathematics for Numerical Computing and Machine Learning Spring, 2019 COS 217 - Introduction to Programming Systems Fall, 2018 COS 526 - Advanced Computer Graphics Spring, 2018 COS 217 - Introduction to Programming Systems Fall, 2017 COS 597C - Advances in Image Processing Spring, 2017 COS 426 - Computer Graphics Fall, 2016 COS 429 - Computer Vision Spring, 2016 COS 598D - Geometric Representations for 3D Fabrication Fall, 2015 COS 226 - Algorithms and Data Structures Spring, 2014 COS/ART/HLS 496 - Modeling the Past - Technologies and Excavations in Polis, Cyprus Fall, 2013 COS 323 - Computing for the Physical and Social Sciences Spring, 2013 COS 598A - 3D Capture and Fabrication Fall, 2012 COS 323 - Computing for the Physical and Social Sciences Spring, 2012 COS 426 - Computer Graphics Spring, 2012 COS/ART/HLS 495 - Modeling the Past - Technologies and Excavations in Polis, Cyprus Fall, 2011 COS 429 - Computer Vision Spring, 2011 COS 426 - Computer Graphics Fall, 2010 COS 323 - Computing for the Physical and Social Sciences Spring, 2010 COS 226 - Algorithms and Data Structures (Preceptor) Fall, 2009 COS 429 - Computer Vision Spring, 2008 COS 226 - Algorithms and Data Structures (Preceptor) Fall, 2007 COS 597B - Reading and Writing Papers in Computer Graphics Spring, 2007 COS/HLS 598C - Reconstructing the Thera Frescoes Fall, 2006 FRS 123 - Technology in Art and Cultural Heritage Spring, 2006 COS 323 - Computing for the Physical and Social Sciences Fall, 2005 COS 429 - Computer Vision Spring, 2005 COS 323 - Computing for the Physical and Social Sciences Fall, 2004 COS 526 - Advanced Computer Graphics Spring, 2004 COS 429 - Computer Vision Fall, 2003 COS 526 - Advanced Computer Graphics Spring, 2003 COS 496 - Computer Vision Fall, 2002 COS 597B - 3D Photography Spring, 2002 COS 496 - Computer Vision Fall, 2001 COS 597D - Sensing for Graphics Research I am a professor in the Computer Science Department and a member of the Graphics Group and Princeton ImageX Labs (PIXL). I am also affiliated with the interdepartmental Robotics at Princeton Group and am associated faculty in the Program in Applied and Computational Mathematics. My work focuses on the interface between computers and the visual and tangible world: acquisition, representation, analysis, and fabrication of 3D shape, motion, surface appearance, and scattering. I am interested in topics including computational fabrication; 3D scan acquisition, registration, and reconstruction; learning for low-level image and shape analysis; robotic localization and planning; and BRDF capture and representation. Applications of this work include documentation of cultural heritage artifacts and sites, appearance and performance capture for digital humans, and illustrative depiction through line drawings and non-photorealistic shading models. If you are interested in joining the PhD program at Princeton: Please be aware that application to the program is evaluated at the department level, and unfortunately I can neither make any promises about the outcome nor evaluate your qualifications outside of that process. Please look here for more information, and apply to Princeton if you are interested. I appreciate that you may have been told that it's a good idea to contact potential advisors ahead of time, but unfortunately I am not able to respond to such emails. Publications and Preprints Recent \"Mobile robotic rebar cage assembly via imitation learning,\" (with Tao Sun, Beining Han, Jimmy Wu, and Yi Shao), Automation in Construction Vol. 181, Part C, Jan. 2026. \"Rebar grasp detection using a synthetic model generator and domain randomization,\" (with Tao Sun, Beining Han, and Yi Shao), Automation in Construction Vol. 176, Aug. 2025. \"TidyBot++: An Open-Source Holonomic Mobile Manipulator for Robot Learning,\" (with Jimmy Wu, William Chong, Robert Holmberg, Aaditya Prasad, Yihuai Gao, Oussama Khatib, Shuran Song, and Jeannette Bohg), Conference on Robot Learning (CoRL), 2024. Also presented at the 2024 Workshop on Mastering Robot Manipulation in a World of Abundant Data. \"Region-Aware Simplification and Stylization of 3D Line Drawings,\" (with Vivien Nguyen, Matt Fisher, and Aaron Hertzmann), Computer Graphics Forum (Proc. Eurographics) Vol. 43, No. 2, Apr. 2024. \"TidyBot: Personalized Robot Assistance with Large Language Models,\" (with Jimmy Wu, Rika Antonova, Adam Kan, Marion Lepert, Andy Zeng, Shuran Song, Jeannette Bohg, and Thomas Funkhouser), Autonomous Robots, special issue on \"Large Language Models in Robotics\", Vol. 47, 2023. Also presented at the 2023 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), and at the RSS 2023 Articulate Robots and ICRA 2023 L-DOD workshops. \"UltraGlove: Hand Pose Estimation with MEMS-Ultrasonic Sensors,\" (with Qiang Zhang, Yuanqiao Lin, and Yubin Lin), Proc. SIGGRAPH Asia, 2023. \"Clutter Detection and Removal in 3D Scenes with View-Consistent Inpainting,\" (with Fangyin Wei and Thomas Funkhouser), International Conference on Computer Vision (ICCV), 2023. \"Gradient-Based Dovetail Joint Shape Optimization for Stiffness,\" (with Xingyuan Sun, Chenyue Cai, and Ryan P. Adams), Proc. ACM Symposium on Computational Fabrication, 2023. \"More Stiffness with Less Fiber: End-to-End Fiber Path Optimization for 3D-Printed Composites,\" (with Xingyuan Sun, Geoffrey Roeder, Tianju Xue, and Ryan P. Adams), Proc. ACM Symposium on Computational Fabrication, 2023. \"Constructing Printable Surfaces with View-Dependent Appearance,\" (with Maxine Perroni-Scharf), Proc. SIGGRAPH, 2023. Older... \"Differentiable Point-Based Radiance Fields for Efficient View Synthesis,\" (with Qiang Zhang, Seung-Hwan Baek, and Felix Heide), Proc. SIGGRAPH Asia, 2022. \"Learning Pneumatic Non-Prehensile Manipulation with a Mobile Blower,\" (with Jimmy Wu, Xingyuan Sun, Andy Zeng, Shuran Song, and Thomas Funkhouser), IEEE Robotics and Automation Letters, Vol. 7, No. 3, 2022. \"Closed-Loop Control of Direct Ink Writing via Reinforcement Learning,\" (with Michal Piovarči, Michael Foshey, Jie Xu, Timothy Erps, Vahid Babaei, Piotr Didyk, Wojciech Matusik, and Bernd Bickel), ACM Transactions on Graphics (Proc. SIGGRAPH) Vol. 41, No. 4, 2022. \"Self-supervised Neural Articulated Shape and Appearance Models,\" (with Fangyin Wei, Rohan Chabra, Lingni Ma, Christoph Lassner, Michael Zollhöfer, Chris Sweeney, Richard Newcombe, and Mira Slavcheva), Computer Vision and Pattern Recognition (CVPR), 2022. \"Amortized Synthesis of Constrained Configurations Using a Differentiable Surrogate,\" (with Xingyuan Sun, Tianju Xue, and Ryan P. Adams), Advances in Neural Information Processing Systems (NeurIPS) spotlight, 2021. \"Spatial Intention Maps for Multi-Agent Mobile Manipulation,\" (with Jimmy Wu, Xingyuan Sun, Andy Zeng, Shuran Song, and Thomas Funkhouser), IEEE International Conference on Robotics and Automation (ICRA), 2021. \"ECHO: Extended Convolution Histogram of Orientations for Local Surface Description,\" (with Thomas W. Mitchel, Gregory S. Chirikjian, and Michael Kazhdan), Computer Graphics Forum, Vol. 40, No. 1, 2021. \"Learned Feature Embeddings for Non-Line-of-Sight Imaging and Recognition,\" (with Wenzheng Chen, Fangyin Wei, Kiriakos N. Kutulakos, and Felix Heide), ACM Transactions on Graphics (Proc. SIGGRAPH Asia) Vol. 39, No. 6, 2020. \"SymmetryNet: Learning to Predict Reflectional and Rotational Symmetries of 3D Shapes from Single-View RGB-D Images,\" (with Yifei Shi, Junwen Huang, Hongjia Zhang, Xin Xu, and Kai Xu), ACM Transactions on Graphics (Proc. SIGGRAPH Asia) Vol. 39, No. 6, 2020. \"Towards Spatially Varying Gloss Reproduction for 3D Printing,\" (with Michal Piovarči, Michael Foshey, Vahid Babaei, Wojciech Matusik, and Piotr Didyk), ACM Transactions on Graphics (Proc. SIGGRAPH Asia) Vol. 39, No. 6, 2020. \"Learning to Infer Semantic Parameters for 3D Shape Editing,\" (with Fangyin Wei, Elena Sizikova, Avneesh Sud, and Thomas Funkhouser), International Conference on 3D Vision (3DV) 2020. \"Poisson Surface Reconstruction with Envelope Constraints,\" (with Misha Kazhdan, Ming Chuang, and Hugues Hoppe), Computer Graphics Forum (Proc. Eurographics Symposium on Geometry Processing), Vol. 39, No. 5, 2020. \"Spatial Action Maps for Mobile Manipulation,\" (with Jimmy Wu, Xingyuan Sun, Andy Zeng, Shuran Song, Johnny Lee, and Thomas Funkhouser), Robotics: Science and Systems (RSS), 2020. \"Efficient Spatially Adaptive Convolution and Correlation,\" (with Thomas W. Mitchel, Benedict Brown, David Koller, Tim Weyrich, and Michael Kazhdan), arXiv:2006.13188, 2020. \"Learning Local Descriptors with a CDF-Based Dynamic Soft Margin,\" (with Linguang Zhang), International Conference on Computer Vision (ICCV) oral presentation, 2019. \"Accelerating Large-Kernel Convolution Using Summed-Area Tables,\" (with Linguang Zhang and Maciej Halber), arXiv:1906.11367, 2019. \"A Symmetric Objective Function for ICP,\" ACM Transactions on Graphics (Proc. SIGGRAPH), Vol. 38, No. 4, 2019. \"High-Precision Localization Using Ground Texture,\" (with Linguang Zhang and Adam Finkelstein), IEEE International Conference on Robotics and Automation (ICRA), 2019. \"Deep Multispectral Painting Reproduction via Multi-Layer, Custom-Ink Printing,\" (with Liang Shi, Vahid Babaei, Changil Kim, Michael Foshey, Yuanming Hu, Pitchaya Sitthi-Amorn, and Wojciech Matus",
  "content_length": 32047,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:12"
}