{
  "name": "Sándor Kisfaludi-Bak",
  "homepage": "https://www.aalto.fi/en/people/sandor-kisfaludi-bak",
  "status": "success",
  "content": "Sándor Kisfaludi-Bak | Aalto University People Sándor Kisfaludi-Bak Assistant Professor Assistant Professor T313 Dept. Computer Science I am an assistant professor in the Theoretical Computer Science group (TCS) at Aalto University. I create and analyse algorithms that deal with geometric content, such as points, curves, or shapes, as well as porblems involving spatial networks. My field, computational geometry, is the theoretical basis for several areas, including computer graphics and vision, robot motion planning, computer aided design and manufacturing. I aim to discover many ways of using geometric structure to our advantage when designing algorithms. Full researcher profile https://research.aalto.fi/... Email sandor.kisfaludi-bak@aalto.fi Publications Computing smallest convex intersecting polygons Antonios Antoniadis, Mark de Berg, Sándor Kisfaludi-Bak, Antonis Skarlatos 2025 Journal of Computational Geometry Structure and Independence in Hyperbolic Uniform Disk Graphs Thomas Bläsius, Jean Pierre Von Der Heydt, Sándor Kisfaludi-Bak, Marcus Wilhelm, Geert Van Wordragen 2025 41st International Symposium on Computational Geometry, SoCG 2025 A Quadtree, a Steiner Spanner, and Approximate Nearest Neighbours in Hyperbolic Space Sandor Kisfaludi-Bak, Geert van Wordragen 2025 Journal of Computational Geometry Euclidean TSP in Narrow Strips Henk Alkema, Mark de Berg, Remco van der Hofstad, Sándor Kisfaludi-Bak 2024 Discrete & Computational Geometry Subexponential Parameterized Directed Steiner Network Problems on Planar Graphs : A Complete Classification Esther Galby, Sándor Kisfaludi-Bak, Dániel Marx, Roohani Sharma 2024 51st International Colloquium on Automata, Languages, and Programming, ICALP 2024 A Quadtree, a Steiner Spanner, and Approximate Nearest Neighbours in Hyperbolic Space Sándor Kisfaludi-Bak, Geert van Wordragen 2024 40th International Symposium on Computational Geometry (SoCG 2024) Separator Theorem and Algorithms for Planar Hyperbolic Graphs Sándor Kisfaludi-Bak, Jana Masaříková, Erik Jan van Leeuwen, Bartosz Walczak, Karol Węgrzycki 2024 40th International Symposium on Computational Geometry, SoCG 2024 An ETH-Tight Exact Algorithm for Euclidean TSP Mark de Berg, Hans L. Bodlaender, Sándor Kisfaludi-Bak, Sudeshna Kolay 2023 SIAM JOURNAL ON COMPUTING Clique-Based Separators for Geometric Intersection Graphs Mark de Berg, Sándor Kisfaludi-Bak, Morteza Monemizadeh, Leonidas Theocharous 2023 Algorithmica Computing Smallest Convex Intersecting Polygons Antonios Antoniadis, Mark De Berg, Sándor Kisfaludi-Bak, Antonis Skarlatos 2022 30th Annual European Symposium on Algorithms, ESA 2022",
  "content_length": 2642,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:14"
}