{
  "name": "Sándor P. Fekete",
  "homepage": "https://www.ibr.cs.tu-bs.de/users/fekete",
  "status": "success",
  "content": "Menü Suche IBR LoginInstitut für Betriebssysteme und Rechnerverbund News Wir über uns Gesamtes Team Anreise Raumplan Projekte Veröffentlichungen Software News Archiv Connected and Mobile Systems Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Software Datensätze Verlässliche Systemsoftware Übersicht Team Lehre Arbeiten & Jobs Forschung Publikationen Algorithmik Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Mikroprozessorlabor Studium Wintersemester 2025/2026 Sommersemester 2025 Abschlussarbeiten Service Bibliothek Mailinglisten Webmail Knowledgebase Wiki Account Management Service-Status Spin-Offs Docoloc bliq (formerly AIPARK) Confidential Technologies Forschungsverbünde IST.hub Home Research Publications Teaching Projects Committees Group Vita Fun Stuff Kontakt Sándor Fekete Technische Universität Braunschweig Institut für Betriebssysteme und Rechnerverbund Abteilung Algorithmik Phone: +49 531 391 3111 Fax: +49 531 391 3109 Email: s.fekete@tu-bs.de Zimmer 335 Mühlenpfordtstraße 23, 3. Stockwerk 38106 Braunschweig Deutschland Sprechstunde: Mi 13:15-14:00 aktualisiert am 31.07.2019, 10:23, verwaltet von Prof. Dr. Sándor P. Fekete Für alle Stellen der TU Braunschweig Jobbörse des Career Service Merchandising Sponsoring- & Spendenleistungen Drittmittelgeförderte Forschungsprojekte Vertrauenspersonen für Hinweisgeber Für Studierende Semestertermine Lehrveranstaltungen Studiengänge von A-Z Informationen für Erstsemester TUCard Interne Tools Status GITZ-Dienste Handbuch für TYPO3 (Intern) Corporate Design-Toolbox (Intern) Glossar (DE-EN) Meine Daten ändern Hochschulöffentliche Bekanntmachungen Kontakt Technische Universität Braunschweig Universitätsplatz 2 38106 Braunschweig Postfach: 38092 Braunschweig Telefon: +49 (0) 531 391-0 Anreise © Technische Universität Braunschweig Impressum Datenschutz Barrierefreiheit",
  "content_length": 1887,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:14"
}