{
  "name": "Sébastien Gambs",
  "homepage": "https://sebastiengambs.openum.ca",
  "status": "success",
  "content": "Sébastien Gambs | Canada Research Chair in Privacy-preserving and Ethical Analysis of Big Data About Biography and research interests Curriculum vitae Contact Biography and research interests Short biography : I hold currently the Canada Research Chair (Tier 2) in Privacy-preserving and Ethical Analysis of Big Data since December 2017. I have joined the Computer Science Department of the Université du Québec à Montréal (UQAM) in January 2016, after having held a joint Research chair in Security of Information Systems between Université de Rennes 1 and Inria from September 2009 to December 2015. Before that, I was a CNRS postdoctoral researcher in LAAS-CNRS collaborating with Yves Deswarte on the concept of the “privacy-preserving identity card”, after having defending in 2008 my PhD thesis in computer science at the Université de Montréal under the supervision of Gilles Brassard. I have defended in June 2014 my HDR (Habilitation à Diriger les Recherches) titled “Protection of Privacy in the Information Society“. As a part of my sabbatical, from January to May 2023 I was  a visiting professor in the SPICY team in the IRISA laboratory (Rennes, France) after having been a visiting professor at the Systopia lab from the University of British Columbia (UBC) from July to December 2022. I am a member of the LATECE laboratory as well as the SERENE RISC cybersecurity network. Research interests : My main research area is the Protection of Privacy as well as the associated ethical issues related to the use of Big Data. In particular, I am interested to solve long-term scientific questions such as addressing the tension between privacy and the analysis of Big Data as well as the fairness, accountability and transparency issues raised by machine learning models and personalized systems. In the past, my research had a strong focus on location privacy but I have also studied and contributed to privacy research in the following contexts : differential privacy, privacy issues in social networks, privacy in distributed systems, privacy-preserving data mining and privacy-preserving identity management. To draw an analogy with computer security, on the “attack” side, I have investigated the privacy issues raised by the development of information technologies (e.g., location-based services), studying the potential inferences that can be performed on the data collected by such services or the security weaknesses existing in their design. On the “defense” side, I have worked on Privacy Enhancing Technologies (PETs) enabling users to have a better control on their personal data. During my PhD, the research that I have conducted was in the area of Quantum Learning, which is located at the crossings of Artificial Intelligence, Machine Learning and Quantum Information Processing. While still curious about the topic, I have not maintained active research on this field. This content has been updated on 4 August 2023 at 14 h 56 min.",
  "content_length": 2957,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:14"
}