{
  "name": "Sören Schwertfeger",
  "homepage": "https://robotics.shanghaitech.edu.cn/people/soeren",
  "status": "success",
  "content": "Sören Schwertfeger 师泽仁 | Mobile Autonomous Robotic Systems Lab Skip to main content Sören Schwertfeger 师泽仁 Tenured Associate Professor at the School of Information Science and Technology of ShanghaiTech UniversityPh.D. in Computer Science (Advisor: Prof. Dr. Andreas Birk, Jacobs University, Germany)Diplom Informatiker (FB3, University of Bremen, Germany)Contact:Office: SIST building, Room 1D-201.A (directions)Address:  393 Huaxia Middle Road, Pudong, Shanghai 201210, ChinaBaidu maps, Google mapsLab: SIST building, Room 1D-203 (floor plan)Directions how to reach the STAR Center: pdfE-Mail: soerensch (at) shanghaitech.edu.cn View my profileLab assistant: Shen Yongxia 沈永霞Websites:This site: robotics.shanghaitech.edu.cnFaculty list: sist.shanghaitech.edu.cn/sist_en/Professors/list.htm Private (with my older robotics projects): s-schwertfeger.euPublications: Google ScholarChinese name: 师泽仁 : 师 Shī (for Schwertfeger - means Teacher) 泽 zé 仁 rén (for Sören - zé: beneficence; rén: benevolence)If you want to know a little more about my background you can read an article about me in the 6th SIST newsletter. Some of my previous robotics projects from my time at the Jacobs Robotics Group are shortly presented here.My CV is available here.ResearchI am interested in mobile robotics, especially in intelligent robotic capabilities like mapping and autonomy. As a computer scientist my focus is on programming novel algorithms for robotic applications. I am interested in algorithms research as well as creating fully working robotic (demo) systems, for example in the area of mobile manipulation. Another particular application of special interest is search and rescue robotics. The Rescue Robotics Project aims to build very small and affordable robots that can autonomously explore an area and search for vicitms - in very difficult terrain. For that, the robots will use a smartphone as a main controller and advanced algorithms developed by the Robotics Group.In another line of research I concentrate on the mapping part of SLAM (Simultaneous Localization and Mapping). I work on novel kinds of map representations, especially topological, hierachical and semantic map representations. Those can be applied to various applications like map merging or planning. I also use those to evaluate the performance of robotic mapping. In particular, I am interested in the assessment of the quality of robot generated maps. Creating maps and localization in the map is an essential task for most robotics applications, thus my great interest in this topic. The evaluation of generated maps is very important to be able to make assessments about the performance of mapping algorithms. One approach uses a topology representation that is extracted from the 2D grid maps and compared to the topology of a ground truth map. My aim is to make the algorithms proposed in my PhD thesis more robust and extend them to 3D.Sören Schwertfeger 师泽仁",
  "content_length": 2936,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:16"
}