{
  "name": "Sören Auer",
  "homepage": "https://vivo.tib.eu/fis/display/n0000-0002-0698-2864",
  "status": "success",
  "content": "Auer, Sören Close Prof. Dr. Auer, Sören Positions Director, TIB - Leibniz Information Centre for Science and Technology and University Library 2017 - Professor for Data Science and Digital Libraries, University of Hanover 2017 - Lead, Programmbereich D - Open Research Knowledge Graph , TIB - Leibniz Information Centre for Science and Technology and University Library 2022 - Lead, Programmbereich C - Forschung und Entwicklung , TIB - Leibniz Information Centre for Science and Technology and University Library 2017 - 2022 Professor for Enterprise Information Systems (EIS), University of Bonn 2013 - 2017 PostDoc, University of Pennsylvania 2006 - 2009 PhD in Computer Science, University of Leipzig 2006 CEO, adVIS GmbH 2000 - 2002 research areas Digital humanities (LCSH) Knowledge representation (Information theory) (LCSH) Linked data (LCSH) Semantic Web (LCSH) Software engineering (LCSH) Overview Affiliation Publications Research Teaching Service Contact Identity View All Overview overview Following stations at the universities of Dresden, Ekaterinburg, Leipzig, Pennsylvania, Bonn and the Fraunhofer Society, Prof. Auer was appointed Professor of Data Science and Digital Libraries at Leibniz Universität Hannover and Director of the TIB in 2017. Prof. Auer has made important contributions to semantic technologies, knowledge engineering and information systems. He is the author (resp. co-author) of over 100 peer-reviewed scientific publications. He has received several awards, including an ERC Consolidator Grant from the European Research Council, a SWSA ten-year award, the ESWC 7-year Best Paper Award, and the OpenCourseware Innovation Award. He has led several large collaborative research projects, such as the EU H2020 flagship project BigDataEurope. He is co-founder of high potential research and community projects such as the Wikipedia semantification project DBpedia, the OpenCourseWare authoring platform SlideWiki.org and the innovative technology start-up eccenca.com. Prof. Auer was founding director of the Big Data Value Association, led the semantic data representation in the Industrial/International Data Space, is an expert for industry, European Commission, W3C and member of the advisory board of the Open Knowledge Foundation. Affiliation head of Content- and Media Engineering Director Agile Knowledge Engineering and Semantic Web founder 2013 - 2016 member of Big Data Value Association founding member (representative of Fraunhofer society) of the board of directors Open Knowledge International advisory board member Steering committee (European Data Forum) Co-Chair Fraunhofer-Institut fuer Intelligente Analyse- und Informationssysteme member of the leadership council 2013 - 2017 attended event 12th International Conference on Semantic Systems (SEMANTiCS 2016) 2016 - 2nd European Semantic Web Conference (ESWC 2005) 2005 - 3rd International Semantic Web Conference (ISWC2004) 2004 - 4th European Semantic Web Conference (ESWC 2007) 2007 - 4th International Semantic Web Conference (ISWC2005) 2005 - 5th International Semantic Web Conference (ISWC2006) 2006 - 6th International Semantic Web Conference and the 2nd Asian Semantic Web Conference (ISWC2007 + ASWC2007) 2007 - 7th Extended Semantic Web Conference (ESWC 2010) 2010 - IV Congresso Internacional Software Livre e Governo Electronico (CONSEGI 2011) 2011 - International Conference on Intelligent Semantic Web-Serivces and Applications (ISWSA 2011) 2011 - Publications selected publications erratum Correction: ORKG-Leaderboards: a systematic workflow for mining leaderboards as a knowledge graph. International Journal on Digital Libraries. 857-857. 2024 abstract \"FAIR-by-Design\" Artifacts: Enriching Publications and Software with FAIR Scientific Information at the Time of Creation. Proceedings of the NFDI4Ing Conference 2023 - Innovation in Research Data Management: Bridging the gaps between disciplines and opening new perspectives for research in engineering science. 34-35. 2023 academic article Better models, better treatment? a systematic review of current three dimensional (3D) in vitro models for implant-associated infections. Frontiers in Bioengineering and Biotechnology. 13. 2025 KI-Methoden verbessern Gesundheitsversorgung. Wissen Hoch N. 2024 SENS: Semantic Synthetic Integrated Model for Sustainable Supply Chain Analysis and Benchmarking. Enterprise Modelling and Information Systems Architectures (EMISAJ). Vol. 19 (2024). 2024 DataDesc: A framework for creating and sharing technical metadata for research software interfaces. Patterns. 101064. 2024 Food information engineering. AI Magazine. 2024 ORKG-Leaderboards: a systematic workflow for mining leaderboards as a knowledge graph. International Journal on Digital Libraries. 25:41-54. 2024 Organizing Scientific Knowledge from Engineering Sciences Using the Open Research Knowledge Graph: The Tailored Forming Process Chain Use Case. Data Science Journal. 23. 2024 Quality Assessment of Research Comparisons in the Open Research Knowledge Graph. JLIS.it. 15:126-143. 2024 Creating and validating a scholarly knowledge graph using natural language processing and microtask crowdsourcing. International Journal on Digital Libraries. 2023 FAIR scientific information with the Open Research Knowledge Graph. FAIR Connect. 1:19-21. 2023 Impact of COVID-19 research: a study on predicting influential scholarly documents using machine learning and a domain-independent knowledge graph. Journal of Biomedical Semantics. 14:18. 2023 Information extraction pipelines for knowledge graphs. Knowledge and Information Systems. 65:1989-2016. 2023 Ranking facts for explaining answers to elementary science questions. Natural Language Engineering. 29:228-253. 2023 The SciQA Scientific Question Answering Benchmark for Scholarly Knowledge. Scientific Reports. 13:7240. 2023 A Scholarly Knowledge Graph-Powered Dashboard: Implementation and User Evaluation. Frontiers in Research Metrics and Analytics. 7. 2022 Creation of a Knowledge Space by Semantically Linking Data Repository and Knowledge Management System - a Use Case from Production Engineering. IFAC-PapersOnLine. 55:2030-2035. 2022 Knowledge Annotation within Research Data Management System for Oxygen-Free Production Technologies. Proceedings of the Design Society. 2:525-532. 2022 SKG4EOSC - Scholarly Knowledge Graphs for EOSC: Establishing a backbone of knowledge graphs for FAIR Scholarly Information in EOSC. Research Ideas and Outcomes. 8. 2022 A comprehensive quality assessment framework for scientific events. Scientometrics. 126:641-682. 2021 Analysing the evolution of computer science events leveraging a scholarly knowledge graph: a scientometrics study of top-ranked events in the past decade. Scientometrics. 126:8129-8151. 2021 Analysing the requirements for an Open Research Knowledge Graph: use cases, quality requirements, and construction strategies. International Journal on Digital Libraries. 2021 Compact representations for efficient storage of semantic sensor data. Journal of Intelligent Information Systems. 57:203-228. 2021 Evaluating BERT-based scientific relation classifiers for scholarly knowledge graph construction on digital library collections. International Journal on Digital Libraries. 2021 ORKG: Facilitating the Transfer of Research Results with the Open Research Knowledge Graph. Research Ideas and Outcomes. 7. 2021 Sentence, Phrase, and Triple Annotations to Build a Knowledge Graph of Natural Language Processing Contributions—A Trial Dataset. Journal of Data and Information Science. 0. 2021 Compacting frequent star patterns in RDF graphs. Journal of Intelligent Information Systems. 55:561-585. 2020 Scholarly event characteristics in four fields of science: a metrics-based analysis. Scientometrics. 677-705. 2020 Die TIB: Mehr als eine Bibliothek. BIBLIOTHEK Forschung und Praxis. 2020 Development of a Domain-Specific Ontology to Support Research Data Management for the Tailored Forming Technology. Procedia Manufacturing. 52:107-112. 2020 Die TIB: Mehr als eine Bibliothek. BIBLIOTHEK Forschung und Praxis. 44:474-484. 2020 Improving Access to Scientific Literature with Knowledge Graphs. BIBLIOTHEK Forschung und Praxis. 44:516-529. 2020 Targeting precision: A hybrid scientific relation extraction pipeline for improved scholarly knowledge organization. Proceedings of the Association for Information Science and Technology. 57:e303. 2020 FAIR.ReD: Semantic knowledge graph infrastructure for the life sciences. Biodiversity Information Science and Standards. 3. 2019 Towards Semantic Integration of Federated Research Data. Datenbank-Spektrum. 19:87-94. 2019 Evaluating the quality of the LOD cloud: An empirical investigation. Semantic Web. 9:859-901. 2018 Wikidata through the eyes of DBpedia. Semantic Web. 9:493-503. 2018 ExConQuer: Lowering barriers to RDF and Linked Data re-use. Semantic Web. 9:241-255. 2018 DESERT: A Continuous SPARQL Query Engine for On-Demand Query Answering. International journal of semantic computing. 12:373-397. 2018 Experience: Open Fiscal Datasets, Common Issues, and Recommendations. Journal of Data and Information Quality. 9:1-10. 2018 Ontology-Based Representation for Accessible OpenCourseWare Systems. Information. 9:302. 2018 SemSur: A Core Ontology for the Semantic Representation of Research Findings. Procedia Computer Science. 137:151-162. 2018 A semi-automatic approach for detecting dataset references in social science texts. Information Services & Use. 36:171-187. 2017 Towards a Knowledge Graph based Speech Interface 2017 Use of Knowledge Graph in Rescoring the N-Best List in Automatic Speech Recognition 2017 A Semi-Automatic Approach for Detecting Dataset References in Social Science Texts 2016 Co-evolution of RDF Datasets 2016 Disintermediation of Inter-Blockchain Transactions 2016 Git4Voc: Git-based Versioning for Collaborative Vocabulary Development 2016 Interview with Frank van Harmelen on \"Linked Data and Business Information Systems\". Bus",
  "content_length": 100245,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:21"
}