{
  "name": "Søren Debois",
  "homepage": "https://pure.itu.dk/portal/en/persons/soeren-debois(d3b41838-e2bf-4735-b1cd-03f60b49c7e5).html",
  "status": "success",
  "content": "Søren Debois - IT-University of Copenhagen Søren Debois Associate Professor, Theoretical Computer ScienceCenter for Information Security and Trust https://orcid.org/0000-0002-4385-1409 Emaildeboisitudk 20042022 Research activity per year Personal profile KeywordsSecurityDistributed systemsBlockchain Fingerprint Dive into the research topics where Søren Debois is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Dynamic Condition Response Graphs Keyphrases 100% Reactive System Computer Science 76% Declarative Processes Keyphrases 75% Process Model Computer Science 69% Liveness Computer Science 69% DCR Graphs Keyphrases 61% Bigraphical Reactive Systems Keyphrases 61% Process Mining Computer Science 46% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2005 2015 2017 2018 2019 2022 22 Article in proceedings 9 Conference article 7 Journal article 6 Report 6 More 2 Book chapter 2 Paper 1 PhD thesis 1 Working paper Research output per year Research output per year Incentive Alignment Through Secure ComputationsHaagensen, F. & Debois, S., 2022, Business Process Management : 20th International Conference, BPM 2022, Münster, Germany, September 11–16, 2022, Proceedings. Remco, C. D. C., Adela del Río Ortega, D. & Rinderle-Ma, S. (eds.). 1 ed. Springer, Vol. 20. p. 343–360 18 p. (Lecture Notes in Computer Science).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Incentive Alignment 100% Motor Vehicles 100% Interorganizational 100% Theoretic Approach 100% Timely Delivery 50% Preface to the special issue on process querying and declarative, decision and hybrid approaches to processes 2019Ciccio, C. D., Debois, S., Polyvyanyy, A., Slaats, T., ter Hofstede, A. H. M. & Vanthienen, J., 2021, In: Journal of Data Semantics. 10, 1, p. 107 1 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research Open Access ReGraDa: Reactive graph dataGalrinho, L., Seco, J. C., Debois, S., Hildebrandt, T. T., Norman, H. & Slaats, T., 2021, In: Lecture notes in computer science. 12717, p. 188-205 18 p.Research output: Journal Article or Conference Article in Journal › Conference article › Research Open Access Zoom and enhance: Action refinement via subprocesses in timed declarative processesNorman, H., Debois, S., Slaats, T. & Hildebrandt, T. T., 2021, Business process management - 19th international conference, BPM 2021, rome, italy, september 06-10, 2021, proceedings. Polyvyanyy, A., Wynn, M. T., Looy, A. V. & Reichert, M. (eds.). Springer, Vol. 12875. p. 161-178 18 p. (Lecture notes in computer science).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access On the Subject of Non-Equivocation: Defining Non-Equivocation in Synchronous Agreement SystemsMadsen, M. F. & Debois, S., Jul 2020, PODC '20: Proceedings of the 39th Symposium on Principles of Distributed Computing. Association for Computing Machinery, Vol. 39. p. 159-168 10 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Non-equivocation 100% fault-tolerance 100% Equivocation 100% Fault Tolerance 100% Byzantine Fault 50% View all 50 research outputs Projects Projects per year 2004 2004 2014 2015 2016 2017 2018 2019 2020 2025 11 Finished Projects per year Software Tool for GDPR Compliance CheckingDebois, S. (PI), Ibsen, P. (Admin) & Oppermann, N. (Admin)Innovation Fund Denmark01/09/2020 → 01/06/2022Project: Research Compliance Checking 100% Software Development Tool 100% General Data Protection Regulation 100% Regulation Compliance 50% IT Systems 50% InfinIT Innovationsnetværk for Finans ITGodskesen, J. C. (PI), Sestoft, P. (CoI), Beck, R. (CoI), Dittrich, Y. (CoI), Debois, S. (CoI) & Madsen, F. (CoI)Danish Agency for Higher Education and Science01/07/2014 → 31/12/2020Project: Research Contract-/Blockchain based Digital CashSestoft, P. (PI), Beck, R. (CoI), Debois, S. (CoI), Gentile, L. (CoI) & Madsen, F. (CoI)Danish Agency for Higher Education and Science03/09/2018 → 31/12/2018Project: Research Rekvireret forskningDebois, S. (PI)Exformatics01/02/2016 → 31/01/2017Project: Research Hvorfor siger juristerne nej? Juridiske barrierer for digitaliseringDupont, C. (PI), Schmidt, J. (PI), Debois, S. (CoI) & Kræmmergaard, P. (CoI)ATP01/04/2019 → 31/12/2021Project: Research View all 11 projects Press/Media Digital sikkerhed i små og mellemstore virksomheder halterDebois, S.17/11/20231 Media contributionPress/Media: Press / Media It-ekspert: Tænk før du klikkerDebois, S.17/09/20211 Media contributionPress/Media: Press / Media Ekspert efter globalt cloud-nedbrud: Det skal vi vænne os tilDebois, S.09/06/20211 Media contributionPress/Media: Press / Media Russere mistænkes for at stå bag cyberangreb mod verdens største kødproducentDebois, S.02/06/20211 Media contributionPress/Media: Press / Media Lær at frygte Clop, Ranzy, Maze og DarksideDebois, S.20/05/20211 Media contributionPress/Media: Press / Media View all 71 press/media",
  "content_length": 5544,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:20"
}