{
  "name": "Søren Lauesen",
  "homepage": "https://pure.itu.dk/portal/en/persons/soeren-lauesen(ea6d10cf-6bb5-4414-8966-f1ed2591f794).html",
  "status": "success",
  "content": "Søren Lauesen - IT-University of Copenhagen Søren Lauesen Cand. scient, math and physics Professor Emeritus, Software Engineering https://orcid.org/0000-0003-2300-6934 Emailslauesenitudk 20072022 Research activity per year Personal profile CurriculumWorked 20 years in the IT industry plus 30 years as a professor. Experience as consultant in many areas. Industry projects: Compilers, operating systems, process control, quality assurance. Research areas: User interface design, data visualization, electronic health records, requirements specification for large systems, acquisition of large systems and why they often fail, connecting business and IT. http://www.itu.dk/people/slauesen/index.html KeywordsUser interface designData visualizationElectronic health recordsRequirements specificationAcquisition of large systemsBusiness and IT Fingerprint Dive into the research topics where Søren Lauesen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 2 Similar Profiles Problem-based Keyphrases 100% Requirement Specification Computer Science 91% Visualization Tool Computer Science 63% Visualization Tools Keyphrases 61% Starting Point Computer Science 58% Requirements Specification Keyphrases 47% Spreadsheets Keyphrases 44% Building-Blocks Computer Science 44% View full fingerprint Research output Research output per year 2008 2011 2018 2020 2022 7 Journal article 6 Book 3 Conference article 2 Poster 1 More 1 Article in proceedings Research output per year Research output per year Problem-oriented Requirements SL-07 Guide and Contract Version 9Lauesen, S., 1 Feb 2022, Amazon Kindle. 128 p.Research output: Book / Anthology / Report › Book › Research Problem-based 100% Starting Point 100% Requirement Specification 100% Electronic Health Record System 50% Requirements Patterns 50% User Story Quality in Practice: A Case StudyLauesen, S. & Kuhail, M. A., 28 Jun 2022, In: Software. 1, 3, p. 223-243 20 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Case Study 100% Analysis Report 100% User Stories 100% Research Question 33% User Interfaces 33% IT Project Failures, Causes and CuresLauesen, S., Apr 2020, In: IEEE Access. 8, 10 p., //doi.org/10.1109/ACCESS.2020.2986545.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Project Management 100% IT Project Failure 100% Failure Cause 100% Accident Investigation 100% Project Failure 100% IT Project Failures, Causes and CuresLauesen, S., 2020, In: IEEE Access. 8, p. 72059-72067 9 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Project Management 100% IT Project Failure 100% Failure Cause 100% Accident Investigation 100% Project Failure 100% Uvis: A Formula-Based End-User Tool for Data VisualizationKuhail, M. A. & Lauesen, S., 2020, In: IEEE Access. 8, p. 110264-110278 15 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Data Visualization 100% Visualization Tools 100% End-user Programmers 100% Visualization Tool 100% Scientific Visualization 100% View all 19 research outputs Projects Projects per year 2007 2007 2008 2013 2015 2020 4 Finished Projects per year Fra visuel procesdesign og kravspecifikation til fleksible digitale arbejdsgangeHildebrandt, T. (PI) & Lauesen, S. (CoI)Innovationsnetværk for IT - InfinIT01/04/2013 → 31/05/2014Project: Research IT project failure and how to learn from itSchmidt, J. (PI) & Lauesen, S. (PI)Digitaliseringsstyrelsen01/04/2015 → 11/05/2020Project: Research The S-EHR : Serious Games on a Global Market PlaceLauesen, S. (PI), Henriksen, C. N. O. (CoI), Lippert, S. (CoI), Xu, S. (CoI), Pantazos, K. (CoI), Kuhail, M. A. (CoI) & Andersen, M. B. (CoI)01/01/2007 → 31/12/2011Project: Research S-EHR: The Successful Electronic Health RecordLauesen, S. (PI)Villum Kann Rasmussen Holding A/S01/01/2008 → 31/12/2012Project: Research Press/Media Netcompany vinder milliardaftale med britisk skatte- og toldvæsenLauesen, S.13/05/20241 Media contributionPress/Media: Press / Media It-systemer fra Netcompany skrider med 15 pct.Lauesen, S.07/05/20241 Media contributionPress/Media: Press / Media Netcompanys statslige it-systemer er samlet gået 15 pct. over prisLauesen, S.07/05/20241 Media contributionPress/Media: Press / Media 62 procent af statslige it-projekter med Netcompany er gået over budget: Vil kalde minister i samrådLauesen, S.06/05/20241 Media contributionPress/Media: Press / Media Medie: It-systemer til staten fra Netcompany skriderLauesen, S.06/05/20241 Media contributionPress/Media: Press / Media View all 234 press/media",
  "content_length": 4806,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:22"
}