{
  "name": "T. C. Hu",
  "homepage": "http://cseweb.ucsd.edu/~hu",
  "status": "success",
  "content": "T. C. Hu T. C. Hu Professor above-scale Department of Computer Science and Engineering University of California, San Diego 9500 Gilman Drive La Jolla, CA 92093-0114 Email: hu@cs.ucsd.edu http://www-cse.ucsd.edu/users/hu Telephone: (831) 620-0586 Fax: (858) 534-7029 BIBLIOGRAPHY (Ps file) (PDF file) New CAREER SUMMARY (Ps file) (PDF file) New SHORT BIOGRAPHY EDUCATION B.S. (Engineering)\tNational Taiwan University\t1953 M.S. (Engineering)\tUniversity of Illinois\t1956 Ph.D. (Applied Math.)\tBrown University\t1960 POSITIONS 1954-1956\tProgrammer, University of Illinois 1960-1966\tResearch Mathematician, IBM Research Center 1964-1965\tVisiting Associate Professor, Electrical Engineering and Operations Research Center, University of California, Berkeley (on leave from IBM) 1965-1966\tAdjunct Associate Professor, Columbia University (part-time) 1966-1968\tAssociate Professor, University of Wisconsin 1968-1974\tProfessor, Computer Sciences Department and Mathematics Research Center, University of Wisconsin-Madison 1974-present\tProfessor, Department of Computer Science and Engineering, University of California, San Diego OTHER ACTIVITIES Associate Editor, Journal of SIAM Associate Editor, Journal of ORSA Consultant, RAND Corporation, Summer 1965 Consultant, Office of Emergency Preparedness, Exec. Office of the President, 1968-72 Editor, IEEE Transactions on Computers Advisory Editor, Journal of Heuristics Advisory Editor, Journal of Graphs and Applications RESEARCH INTERESTS Combinatorial Algorithms Mathematical Programming Networks and Graphs VLSI Circuit Layout MEMBERSHIP IN PROFESSIONAL SOCIETIES ACM, SIAM, ORSA, Mathematical Programming, IEEE. RECENT INVITED LECTURES AND HONORS Workshop on VLSI Layout Theory, Dagstahl, Germany, Sept. 9-11, 1991. \"Combinatorial Problems in VLSI,\" 16th International Symposium on Operations Research, Trier, Germany, Sept. 9-11, 1991. Second ORSA Telecommunications Conference, Boca Raton, Florida, March 9-11, 1992, (90-minute tutorial). Plenary lecture, 17th Symposium on Operations Research, Hamburg, Germany, Aug. 25-28, 1992. Mathematische Optimierung, Mathematishes Forschungsinstitut Oberwolfach, Germany, January 8-14, 1995. John von Neuman Professorship, University of Bonn, Germany, 1994-95. Senior Professor, Fulbright, 1994-95. Keynote address, 1st International Symposium on Physical Design, April 14-16, 1997, Napa Valley CA. IEEE Circuits and Systems Society, Best Paper Award, 1997. PUBLICATIONS Books Integer Programming and Network Flows, by T. C. Hu, published by Addison-Wesley, 1969. Translated into German by H. P. Kunzi and G. Uebe, published by Oldenbourg Verlag, 1972. Translated into Russian, published by Mir, 1974. Translated into Japanese by Mr. Iri H. Konn and T. Tanahashi, published by Baifukan, 1975. Mathematical Programming, edited by T. C. Hu and S. M. Robinson, Academic Press, 1973. Combinatorial Algorithms, by T. C. Hu, Addison-Wesley, 1982. Theory and Concepts of Circuit Layout, edited by T. C. Hu, and E. S. Kuh, IEEE Press, 1985. Chapters in Books \"Some Results and Problems in Binary Trees,\" by T. C. Hu, in Combinatorial Algorithms, edited by Randall Rusting, Algorithmics Press, 1973. \"Multi-Terminal Flows in a Network,\" by R. E. Gomory and T. C. Hu, in Studies in Graph Theory, Part I, edited by D. R. Fulkerson, volume 11 of the MAA Studies in Mathematics, the Mathematical Association of America, 1975. \"Computational Complexity of Layout Problems,\" by M. T. Shing and T. C. Hu, Chapter 8 of Layout Design and Verification, edited by T. Ohtsuki, volume 4 of Advances in CAD for VLSI, North-Holland, 1986. Papers in Journals 1.\t\"Network Analysis of Production Smoothing,\" by T. C. Hu and W. Prager, Naval Research Logistics Quarterly, Vol. 6, No. 1, 1959, pp. 17-23. 2.\t\"Uniqueness in the Optimum Design of Structures,\" T. C. Hu and R. T. Shield, Transactions of the ASME: Journal of Applied Mechanics, Vol. 28, No. 2, 1961, pp. 284-287. 3.\t\"Minimum-Volume Design of Discs,\" T. C. Hu and R. T. Shield, Zeitschrift fur Angewandte Mathematik und Physik, Vol. 12, No. 5, 1961, pp. 414-433. 4.\t\"Parallel Sequencing and Assembly Line Problems,\" T. C. Hu, Operations Research, Vol. 9, No. 6, 1961, pp. 841-848. 5.\t\"The Maximum Capacity Route Problem,\" T. C. Hu, Operations Research, Vol. 9, No. 6, 1961, pp. 898-900. 6.\t\"Multi-Terminal Network Flows,\" R. E. Gomory and T. C. Hu, Journal of SIAM, Vol. 9, No. 4, 1961, pp. 551-570. (Honorable Mention as an outstanding paper in 1961 by Operations Research Society.) 7.\t\"An Application of Generalized Linear Programming to Network Flows,\" R. E. Gomory and T. C. Hu, Journal of SIAM, Vol. 10, No. 2, 1962, pp. 260-283. 8.\t\"Multi-Commodity Network Flows,\" T. C. Hu, Operations Research, Vol. 11, No. 3, 1963, pp. 344-360. 9.\t\"Analysis and Synthesis of Communication Networks,\" R. T. Chian, R. E. Gomory and T. C. Hu (Invited Survey), IEEE Transactions on Circuit Theory, 1964, CT-11, No. 1, pp. 19-22. 10.\t\"Synthesis of a Communication Network,\" R.E. Gomory and T. C. Hu, Journal of SIAM, Vol. 12, No. 2, 1964, pp. 348-369. 11.\t\"On the Feasibility of Simultaneous Flows in a Network,\" T. C. Hu, Operations Research, Vol. 12, No. 2, 1964, pp. 359-360. 12.\t\"Minimum-Cost Flows in Convex Cost Networks,\" T. C. Hu, Naval Research Logistics Quarterly, Vol. 13, No. 1, 1966, pp. 1-9. 13.\t\"Decomposition in Traveling Salesman Type Problems,\" T.C. Hu, Proceedings of IFORS, Session A, Theory of Graphs, pp. A-34-A-44, 1966. 14.\t\"Laplace's Equation and Network Flows,\" T. C. Hu, Operations Research, Vol. 15, No. 2, 1967, pp. 348-356. 15.\t\"Revised Matrix Algorithms for Shortest Paths,\" T. C. Hu, SIAM Journal on Applied Mathematics, Vol. 15, No. 1, 1967, pp. 207-218. 16.\t\"A Decomposition Algorithm for Shortest Paths in a Network,\" T. C. Hu, Operations Research, Vol. 16, No. 1, 1968, pp. 91-102. 17.\t\"Recent Advances in Network Flows,\" T. C. Hu, SIAM Review, Vol. 10, No. 3, 1968, pp. 354-359. 18.\t\"Shortcut in the Decomposition Algorithm for Shortest Paths in a Network,\" T. C. Hu and W. T. Torres, IBM Journal of Research Development, Vol. 13, No. 4, 1969, pp. 387-390. 19.\t\"On the Asymptotic Integer Algorithm,\" T. C. Hu, Linear Algebra and its Applications, Vol. 3, No. 3, 1970, pp. 279-294. 20.\t\"Optimal Computer Search Trees and Variable-Length Alphabetical Codes,\" T. C. Hu and A. C. Tucker, SIAM Journal on Applied Mathematics, Vol. 21, No. 4, 1971, pp. 514-532. 21.\t\"Path Length of Binary Search Trees,\" T. C. Hu and K. C. Tan, SIAM Journal on Applied Mathematics, Vol. 22, No. 2, 1972, pp. 225-234. 22.\t\"Some Problems in Discrete Optimization,\" T. C. Hu, Mathematical Programming, Vol.1, No. 1, 1971, pp. 102-112. 23.\t\"A Comment on the Double-Chained Tree,\" T. C. Hu, Communications of ACM, Vol. 15, No. 4, 1972, p. 276. 24.\t\"Least Upper Bound on the Cost of Optimum Binary Search Trees,\" T. C. Hu and K. C. Tan, ACTA Informatiica Vol. 1, 1972, pp. 307-310. 25.\t\"A New Proof of the T-C Algorithm,\" T. C. Hu, SIAM Journal on Applied Mathematics, Vol. 25, No. 1, 1973, pp. 83-94. 26.\t\"Some Results and Problems in Binary Trees,\" by T. C. Hu, in Combinatorial Algorithms, edited by Randall Rustin, Algorithmics Press, 1973, pp. 11-15. 27.\t\"Multi-Terminal Flows in a Network,\" by R. E. Gomory and T. C. Hu, in Studies in Graph Theory, Part I, edited by D. R. Fulkerson, Vol. 11 of the MAA Studies in Mathematics, The Mathematical Association of America, 1975, pp. 172-199. 28.\t\"Two-Commodity Cut-Packing Problem,\" T. C. Hu, Mathematical Programming, Vol. 4, No. 1, 1973, pp. 108-109. 29.\t\"Optimal Linear Ordering,\" D. Adolphson and T. C. Hu, SIAM Journal on Applied Mathematics, Vol. 25, No. 3, 1973, pp. 403-423. 30.\t\"R-Separating Sets,\" R. E. Gomory, T. C. Hu and J. M. Yohe, Canadian Journal of Mathematics, Vol. 26, No. 6, 1974, pp. 1418-1429. 31.\t\"Optimum Communication Spanning Trees,\" T. C. Hu, SIAM Journal on Computing, Vol. 3, No. 3, 1974, pp. 188-195. 32.\t\"Shortest String Containing All Permutations,\" P. J. Koutas and T. C. Hu, Discrete Mathematics, Vol. 11, 1975, pp. 125-132. 33.\t\"Optimality of a Heuristic Solution for a class of Knapsack Problems,\" T. C. Hu and M. Lenard, Operations Research, Vol. 24, No. 1, 1976, pp. 193-196. 34.\t\"Generating Permutations with Nondistinct Items,\" T. C. Hu and B. N. Tien, American Mathematical Monthly, Vol. 83, No. 8, 1976, pp. 629-631. 35.\t\"Tree Decomposition Algorithm in Large Networks,\" W. Blewett and T. C. Hu, Networks, Vol. 7, No. 4, 1977, pp. 289-296. 36.\t\"Generating Binary Trees Lexicographically,\" F. Ruskey and T. C. Hu, SIAM Journal on Computing, Vol. 6, No. 4, 1977, pp. 745-758. 37.\t\"Error Bounds and the Applicability of the Greedy Solution to the Coin-Changing Problem,\" B. N. Tien and T. C. Hu, Operations Research, Vol. 25, No. 3, 1977, pp. 404-418. 38.\t\"Binary Trees Optimum under Various Criteria,\" T. C. Hu, D. J. Kleitman and J. Tamaki, SIAM Journal on Applied Mathematics, Vol. 37, No. 2, 1979, pp. 246-256. 39.\t\"Assignment of Tasks in a Distributed Processor System with Limited Memory,\" G. S. Rao, H. S. Stone and T. C. Hu, IEEE Transactions on Computers, Vol. C-28, No. 4, 1979, pp. 291-299. 40.\t\"Circular Cuts in a Network,\" T. C. Hu and F. Ruskey, Mathematics of Operations Research, Vol. 5, No. 3, 1980, pp. 422-434. 41.\t\"Some Theorems about Matrix Multiplication,\" T. C. Hu and M. T. Shing, in Proceedings of the 21st Annual Symposium on the Foundations of Computer Science, 1980, pp. 28-36. 42.\t\"An O(n) Algorithm to Find a Near Optimum Partition of a Convex Polygon,\" T. C. Hu and M. T. Shing, Journal of Algorithms, Vol. 2, No. 2, 1981, pp. 122-138. 43.\t\"An Optimum Algorithm for Matrix Chain Product, Part I,\" T. C. Hu and M. T. Shing, SIAM Journal on Computing, Vol. 11, No. 2, 1982, pp. 362-373. 44.\t\"An Optimum Algorithm for Matrix Chain Product, Part II,\" T. C. Hu and M. T. Shing, SIAM Journal on Computing, Vol. 13, No. 2, 1984, pp. 228-251. 45.\t\"Beauty Contests, College Admissions, and Bargaining,\" T. C. Hu, Journal of Recreational Mathematics, Vol. 14, No. 4, 1981-",
  "content_length": 17934,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:22"
}