{
  "name": "T. K. Srikanth",
  "homepage": "http://www.iiitb.ac.in/faculty_page.php?name=TKSrikanth",
  "status": "success",
  "content": "NIRF IQAC Academics Departments Department of Computer Science & Engineering Department of Digital Humanities and Societal Systems Department of Data Science and Artificial Intelligence Department of Electronics and Communication Engineering Centre for Applied Sciences Programmes B.Tech. Integrated M.Tech. M.Tech. Master of Science by Research Ph.D. PG Diploma in Digital Product Design and Management M.Sc. (Digital Society) Fellowships Admissions B.Tech. & Integrated M.Tech. M.Tech. Ph.D. & Master of Science by Research Post Graduate Diploma Domains Computer Science Data Sciences Software Engineering Mathematics and Basic Sciences Networking, Communication and Signal Processing VLSI Systems Digital Society Exchange Program Verification Process Curriculum Programme Outcomes Academic Calendar Online Education Continuing Professional Education Long Term Programmes (11-14 months) Short Term Programme (5-8 months) Research Centres E-Health Research Centre (EHRC) Machine Intelligence & Robotics CoE (MINRO) Centre for IT & Public Policy (CITAPP) Cognitive Computing CoE (CCC) Centre for Accessibility in the Global South (CAGS) COMET Tech Innovation Hub (NM-ICPS) IIITB Innovation Centre Modular Open-Source Identity Platform (MOSIP) Centre for Open Societal Systems (COSS) Centre for Digital Public Infrastructure | CDPI Labs Surgical and Assistive Robotics Lab Scalable Data Science and AI Lab Graphics-Visualization-Computing-Lab Web Science Lab Multimodal Perception Lab Software Engineering Lab High Density Electronic Systems Lab Networking and Communication Lab Remote Sensing, GIS and Spatial Computing Lab Indian Knowledge System (IKS) Lab Smart City Lab Ascend Studio Radar Sensing Lab CSSMP Advanced Wireless Communications Lab Speech Lab Connected Devices and Wearables Lab Outreach Samvaad RISE Avalokana Summer Internship Publications Policy Placements Overview Placement Team Placement Statistics Recruiting Companies Click To Recruit Campus Life Committees & Clubs Students Events and Festivals Cafeteria Library Collection Media Faculty Articles IIIT-B in the Press Naviiina Annual Reports Press Releases Media Kit People Faculty Staff IIIT-B Innovation Center IIIT-B COMET Foundation IIIT-B MOSIP IIIT-B EHRC IIIT-B MINRO MS by Research Scholars Ph.D. Scholars Integrated PhD Scholars Visvesvaraya PhD Scheme Scheme 1 Scheme 2 Alumni Code of Conduct About Us Explore IIIT-B Governing Body Administration Industry Advisory Board Institute Industry Interaction Cell Partnership AICTE Mandatory Disclosure IIIT-B Calendar Page Not Found Home ∣   Page Not Found Page Not Found Error 404 The page you requested could not be found, either contact your webmaster or try again. Use your browsers Back button to navigate to the page you have prevously come from Or you could just press this neat little button: Take Me Home Contact us × First Name: Last Name: Email: Phone: Date of Birth: Gender: Male Female City: State: Country: -- Select Country -- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivarian Republic of Venezuela Bolivia, Plurinational State Of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Cook Islands Costa Rica Côte D'Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States Of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Republic of Macedonia Republic of Moldova Republic of the Congo Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan Da Cunha Saint Kitts And Nevis Saint Lucia Saint Martin (French Part) Saint Pierre And Miquelon Saint Vincent And The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard And Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province Of China Tajikistan Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United Republic of Tanzania United State Of America United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Vatican City Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Programme: -- Select Programme -- Executive Diploma in Data Science & AI Executive Diploma in Machine Learning & AI Executive Program in Digital Public Infrastructure Executive Post Graduate Certificate in Data Science & AI Advanced Executive Program in Cybersecurity Advanced Certification in UI/UX Design with Generative AI Chief Technology & AI Officer Program Executive Program in Digital Public Infrastructure Professional Certificate Programme in Data Science with Generative AI Executive Post Graduate Programme in Applied AI and Agentic AI Captcha: + = Close Submit",
  "content_length": 6560,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:24"
}