{
  "name": "T. M. Murali 0001",
  "homepage": "https://bioinformatics.cs.vt.edu/~murali",
  "status": "success",
  "content": "T. M. Murali Home Research Publications Research group Software Collaborators Teaching News T. M. Murali Professor Dept. of Computer Science Virginia Tech murali at cs dot vt dot edu (540) 231-8534 (phone) 432 Data and Decision Sciences Building (office address) 1160 Torgersen Hall (mailing address) 620 Drillfield Drive (mailing address) Blacksburg, VA 24061 I am a Professor and the Associate Department Head for Research in the Department of Computer Science at Virginia Tech. I direct the NSF COMPASS Center, supported by the Prediction Intelligence for Pandemic Prevention program. We are a group of faculty members, staff, and students whose vision is to reach an aspirational destination: A world where we accurately foresee pandemics and proactively minimize their impact. We seek to reach this goal by addresssing the grand challenge of uncovering the rules of life that underly virus-host interactions through community-based and ethically grounded research. I also lead the closely-related Destination Area on Pandemic Prediction and Prevention, which receives support from the Office of the Provost at Virginia Tech. I am also the associate director for the Computational Tissue Engineering interdisciplinary graduate education program. I am affiliated with the Interdisciplinary Ph.D. Program in Genetics, Bioinformatics, and Computational Biology. I joined Virginia Tech in 2003 as an Assistant Professor. From 2001 to 2003, I was a Senior Research Associate in the Bioinformatics Programme at Boston University, where I worked with Simon Kasif. Before joining Boston University, I worked at Compaq's Cambridge Research Lab. Till July 1999, I was a post-doc in the Computer Science Department at Stanford University. I worked with Leo Guibas and Jean-Claude Latombe on problems arising in computational geometry, computer graphics, and robotics. In particular, I was working on the Tactical Mobile Robots project. Before I came to Stanford, I was a Ph.D. student at the Department of Computer Science at Brown University. From July 1993 to August 1998, I was a visiting scholar at the Department of Computer Science at Duke University, where my advisor Jeff Vitter moved from Brown University. I was a member of the Center for Geometric Computing at Duke. Before I started my graduate studies at Brown in 1991, I spent four years at the Indian Institute of Technology, Madras (IITM) getting a Bachelor of Technology degree in Computer Science and Engineering. My last two years in high school were spent at the pride of Luz Circle, Vidya Mandir, Madras. In my research, I focus on problems in computational systems biology. I develop phenomenological and predictive models dealing with the function, behaviour, and properties of large-scale molecular interaction networks in the cell. In my first 10-odd years at Virginia Tech, I worked on cellular response networks and their building blocks (network legos), gene function prediction (GAIN, Art, MENGO), host-pathogen protein-protein interactions (prediction, landscape) biclustering algorithms and their applications (xMotif, visualisation, XcisClique, Arabidopsis CO2, RankGene), and conserved protein interaction modules (GraphHopper). I also worked on identifying ligand migration pathways in proteins such as myoglobin. In previous research, I studied problems in computational geometry, especially those motivated by applications in computer graphics, robotics, and geographic information systems. In my Ph.D. thesis, I studied the problem of hidden-surface removal. T. M. Murali (murali at cs DOT vt DOT edu)",
  "content_length": 3581,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:24"
}