{
  "name": "Tachio Terauchi",
  "homepage": "http://www.f.waseda.jp/terauchi/index.html",
  "status": "success",
  "content": "Tachio Terauchi [Japanese Version] Tachio Terauchi Professor Department of Computer Science and Engineering, Waseda University (+81)-3-5286-3198 terauchi AT waseda DOT jp [Researchmap.jp, Waseda University Researchers Database] Bio Tachio Terauchi is a professor in the Department of Computer Science and Engineering at Waseda University. He received his M.S. and Ph.D. from University of California, Berkeley in 2004 and 2006, and B.S. from Columbia University in 2000, all in computer science. Before joining Waseda, he was a professor at JAIST from 2014 to 2017, an associate professor at Nagoya University from 2011 to 2014, and an assistant professor at Tohoku University from 2007 to 2011. Terauchi is interested in techniques for building reliable computational systems. His work draws from, and contributes to the areas of programming languages, program verification and synthesis, mathematical logic and automated deduction, formal languages and automata theory, security, and type systems. Teaching Design and Implementation of Programming Languages (Fall Semester) Information for Prospective Students Information for Prospective Students (in Japanese) Laboratory introduction slides (in Japanese) Undergraduate research projects description Lab visits for 2025 will be appointment basis. Please send me an email to make an appointment. Lab visits will be at room 209B of Building 62W (or online, if preferred). Professional Activities CSF 2026 : Program Committee ASIACCS 2026 : Track Co-Chair APLAS 2025 : Program Committee CAV 2025 : Program Committee CCS 2025 : Program Committee OOPSLA 2025 : Program Committee CSF 2025 : Program Committee PPL 2025 (Japanese) : Program Committee POPL 2025 : Program Committee ATVA 2024 : Program Committee FMCAD 2024 : Program Committee PLDI 2024 : Program Committee FSCD 2024 : Program Committee FLOPS 2024 : Program Committee CSF 2024 : Program Committee NII Shonan Meeting 180 : Co-Organizer APLAS 2023 : SRC & Posters Selection Committee ATVA 2023 : Program Committee ICCQ 2023 : Program Committee CSF 2023 : Program Committee ESOP 2023 : Program Committee OOPSLA 2022 : Program Committee PLDI 2022 : Program Committee CSF 2022 : Program Committee LICS 2022 : Program Committee POPL 2022 : Program Committee TMPA 2021 : Program Committee APLAS 2021 : Program Committee ATVA 2021 : Program Committee CAV 2021 : Program Committee CSF 2021 : Program Committee VSTTE 2020 : Program Committee ATVA 2020 : Program Committee FLOPS 2020 : Program Committee PPL 2020 (Japanese) : Program Committee TMPA 2019 : Program Committee APLAS 2019 : Program Committee ATVA 2019 : Program Committee SAS 2019 : Program Committee VSTTE 2019 : Program Committee APLAS 2018 : Program Committee VSTTE 2018 : Program Committee NII Shonan Meeting 115 : Co-Organizer POPL 2018 : Program Committee VMCAI 2018 : Program Committee APLAS 2017 : Program Committee RP 2017 : Program Committee VSTTE 2017 : Program Committee ESOP 2017 : Program Committee TMPA 2017 : Program Committee POPL 2017 : External Review Committee APLAS 2016 : Program Committee ICALP 2016 : Program Committee VMCAI 2016 : Program Committee POPL 2016 : External Review Committee NII Shonan Meeting 069 : Co-Organizer HOPA 2015 : Program Committee PLAS 2015 : Program Committee LICS 2015 : Program Committee FCS-FCC 2014 : Program Committee HOPA 2014 : Program Committee FLOPS 2014 : Program Committee VMCAI 2014 : Program Committee CSL 2013 : Program Committee POPL 2013 : External Review Committee APLAS 2012 : Program Committee POPL 2012 : Program Committee TLCA 2011 : Program Committee ESOP 2011 : Program Committee PLPV 2011 : Program Committee VMCAI 2011 : Program Committee TLDI 2011 : Program Committee PLDI 2010 : External Review Committee PPL 2010 (Japanese) : Program Co-Chair PLAS 2009 : Program Committee PPL 2009 (Japanese) : Program Committee SAC 2009 : Program Committee SAS 2008 : Program Committee Show more Show less Students Nariyoshi Chida (Visiting Scholar) Tianrui Chen (D3) Taisei Nogami (D2) Yuta Uchijo (M2) Naoya Anada (M2) Yuki Nakayama (M1) Taisei Iida (M1) Riru Oda (B4) Riku Ito (B4) Haruto Ishiyama (B4) Rei Tomori (B3) Rio Onoda (B3) Kyosuke Irie (B3) Naoto Takanohashi (B3) Past Students Publications [Google Scholar, DBLP] Daisuke Yamaguchi, Shinobu Saito, Takuya Iwatsuka, Nairyoshi Chida, and Tachio Terauchi. A Secure Mocking Approach Towards Software Supply Chain Security. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering, New Ideas and Emerging Results Track (ASE-NIER 2025), To Appear. [pdf] Ryunosuke Endo and Tachio Terauchi. Reachability is Decidable for ATM-Typable Finitary PCF with Effect Handlers. In Proceedings of the 23rd Asian Symposium on Programming Languages and Systems (APLAS 2025), Lecture Notes in Computer Science 16201, pp.67-87, Springer, Oct, 2025. [pdf (Full version with appendices)] Taisei Nogami and Tachio Terauchi. Efficient Matching of Some Fundamental Regular Expressions with Backreferences. In Proceedings of the 50th Mathematical Foundations of Computer Science (MFCS 2025), Leibniz International Proceedings in Informatics (LIPIcs) 345, pp.81:1-81:19, Schloss Dagstuhl Leibniz-Zentrum für Informatik, August, 2025. [pdf (Full version with appendices)] Tachio Terauchi. On DoS Vulnerability of Regular Expressions, with and without Backreferences. In Proceedings of the 38th IEEE Computer Security Foundations Symposium (CSF 2025), pp.159-173, IEEE Computer Society, June, 2025. [pdf (With minor bug fixes)] Taisei Nogami and Tachio Terauchi. Measuring the Expressive Power of Practical Regular Expressions by Classical Stacking Automata Models. Information and Computation 305: pp.105303 (2025). [pdf] Nariyoshi Chida and Tachio Terauchi. Repairing Regex-Dependent String Functions. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering (ASE 2024), pp.294-305, ACM, Oct, 2024. [pdf] Fuga Kawamata, Taro Sekiyama, Hiroshi Unno, and Tachio Terauchi. Answer Refinement Modification: Refinement Type System for Algebraic Effects and Handlers. In Proceedings of the 51st ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL 2024), PACMPL 8(POPL): pp.115-147, ACM, Jan, 2024. [pdf (Full version with appendices)] Taisei Nogami and Tachio Terauchi. On the Expressive Power of Regular Expressions with Backreferences. In Proceedings of the 48th Mathematical Foundations of Computer Science (MFCS 2023), Leibniz International Proceedings in Informatics (LIPIcs) 272, pp.71:1-71:15, Schloss Dagstuhl Leibniz-Zentrum für Informatik, August, 2023. [pdf (Full version with appendices)] Nariyoshi Chida and Tachio Terauchi. Repairing Regular Expressions for Extraction. In Proceedings of the 44th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2023), PACMPL 7(PLDI): pp.1633-1656, ACM, June, 2023. [pdf (Full version with appendices)] Nariyoshi Chida and Tachio Terauchi. On Lookaheads in Regular Expressions with Backreferences. (Extended Version) IEICE Transactions on Information and Systems E106-D (5), pp.959-975, (2023). Fuga Kawamata and Tachio Terauchi. Trace Effects for a Language with Algebraic Effect Handlers. (in Japanese) JSSST Computer Software 40 (2), pp.19-48, (2023). Hiroshi Unno, Tachio Terauchi, Yu Gu, and Eric Koskinen. Modular Primal-Dual Fixpoint Logic Solving for Temporal Verification. In Proceedings of the 50th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL 2023), PACMPL 7(POPL): pp.2111-2140, ACM, January, 2023. [pdf (Full version with appendices)] Nariyoshi Chida and Tachio Terauchi. On Lookaheads in Regular Expressions with Backreferences. In Proceedings of the 7th International Conference on Formal Structures for Computation and Deduction (FSCD 2022), Leibniz International Proceedings in Informatics (LIPIcs) 228, pp.15:1-15:18, Schloss Dagstuhl Leibniz-Zentrum für Informatik, August, 2022. [pdf] Nariyoshi Chida and Tachio Terauchi. Repairing DoS Vulnerability of Real-World Regexes. In Proceedings of the 43rd IEEE Symposium on Security and Privacy (S&P 2022), IEEE Computer Society, pp.2060-2077, May, 2022. [pdf (With bug fixes), Notes on a claim made by Li et al. USENIX Security 2022] Hiroshi Unno, Tachio Terauchi, and Eric Koskinen. Constraint-based Relational Verification. In Proceedings of the 33rd International Conference on Computer-Aided Verification (CAV 2021), Lecture Notes in Computer Science 12759, pp.742-766, Springer, July, 2021. [pdf (Full version with appendices)] Tachio Terauchi and Timos Antonopoulos. Bucketing and Information Flow Analysis for Provable Timing Attack Mitigation. Journal of Computer Security 28 (6): pp.607-634 (2020). [pdf] Daisuke Kimura, Koji Nakazawa, Tachio Terauchi, and Hiroshi Unno. Failure of Cut-Elimination in Cyclic Proofs of Separation Logic. JSSST Computer Software 37 (1), pp.39-52, (2020). [pdf] Timos Antonopoulos and Tachio Terauchi. Games for Security under Adaptive Adversaries. In Proceedings of the 32nd IEEE Computer Security Foundations Symposium (CSF 2019), pp.216-229, IEEE Computer Society, June, 2019. [pdf] Tachio Terauchi and Timos Antonopoulos. A Formal Analysis of Timing Channel Security via Bucketing. In Proceedings of the 8th International Conference on Principles of Security and Trust (POST 2019), Lecture Notes in Computer Science 11426, pp.29-50, Springer, April, 2019. [pdf (With bug fixes)] Yoji Nanjo, Hiroshi Unno, Eric Koskinen, and Tachio Terauchi. A Fixpoint Logic and Dependent Effects for Temporal Property Verification. In Proceedings of the 33rd Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2018), pp.759-768, ACM, July, 2018. [pdf] Hiroshi Unno, Yuki Satake, and Tachio Terauchi. Relatively Complete Refinement Type System for Verification of Higher-Order Non-deterministic Programs. In Proceedings of the 45th ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL 2018), PACMPL 2(POPL): pp.12:1-12:2",
  "content_length": 18377,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:27"
}