{
  "name": "Tadayoshi Kohno",
  "homepage": "http://homes.cs.washington.edu/~yoshi",
  "status": "success",
  "content": "Tadayoshi Kohno (aka Yoshi Kohno) Tadayoshi Kohno (Yoshi Kohno) (he/him) Professor Paul G. Allen School of Computer Science & Engineering University of Washington Associate Dean, Faculty Success College of Engineering University of Washington UW CSE Security and Privacy Research Lab UW Tech Policy Lab \"Navigating Academia\" Blog [ This page is being retired; a new page will be at Georgetown University ] Home Students Teaching Research Other Publications Dissertations \"Our Reality\" Contact At UW. Professor in the Allen School of Computer Science & Engineering. Adjunct Professor in Electrical & Computer Engineering, the School of Information, and the School of Law. Associate Dean for Faculty Success in the UW College of Engineering. Former Associate Director for Diversity, Equity, Inclusion, and Access in the Allen School. Co-director of the Security & Privacy Research Lab. Co-director of the Tech Policy Lab. Prior to UW. BS, University of Colorado (with Hal Gabow and Evi Nemeth). PhD, UC San Diego (with Mihir Bellare). Committees. USENIX Security Steering Committee (2012-Present). Electronic Frontier Foundation (EFF) Advisory Board (2020-Present). Partnership on AI (PAI) AI Safety Steering Committee (2022-Present). The International Academy of Digital Arts and Sciences (2022-Present). Network and Distributed System Security Symposium (NDSS) Steering Group (2011-2014). National Academies Cyber Resilience Forum Member (2014-2018). Awards. Technology Review TR-35 Award (2007). Alfred P. Sloan Research Fellowship (2008). NSF CAREER Award (2009). IEEE S&P Test of Time Award (2019 and 2020). ACSAC Test of Time Award (2019). NSDI Test of Time Award (2023). AAAS Golden Goose Award (2021). Allen School ACM Teaching Award (2022). IEEE Fellow (2023). Personal. Martial arts, and the \"budo\" way of life, are a big part of who I am. If one reads my blog -- largely focused on academia and advice for PhD students -- one will see how my philosophy on martial arts (and yoga and the traditions that swirl around and through them) influence my approach to academia. As time allows, I teach karate and aiki budo, and I used to teach yoga. I am addicted to cold water, and I try to swim in Puget Sound at least once a week. I enjoy bicycling and running, and I recommend the annual Seattle to Portland bicycle ride. I also enjoy writing and, in an alternate universe, might have explored a life path as a fiction writer. Research. I strive to envision what the world might be like in 5, 10, or 15 years, anticipate what risks and harms might arise (under various possible futures), and then proactively and ethically study those risks+harms and explore mitigations. I am particularly interested in (1) exploring new, previously unexplored technologies and research areas, (2) exploring existing research areas with novel, new approaches, (3) exploring issues of contemporary importance, (4) conducting work that is cross-disciplinary, (5) leveraging the best methodologies to explore the questions at hand (e.g., user studies, Internet crawlers, or experimental attack explorations), and (6) conducting work that is import to society and that recognizes that society and technology are deeply intertwined. Example technology areas of study include: Electronic Voting Security: In 2003, my colleagues and I conducted the first academic security analysis of real electronic voting machine software. Our work played a pivotal role in the emerging national discussion of electronic voting security. I continued to work in electronic voting security until 2006, including co-chairing the USENIX/ACCURATE Electronic Voting Technology Workshop in 2008. I also testified before the U.S. House of Representatives, on the topic of electronic voting security. Remote Physical Device Fingerprinting, Clock Skews, and Side Channels: In 2005, my colleagues and I discovered and studied mechanisms to remotely fingerprint physical devices by inferring information about their clock skews from their network packets. I have been told that the credit card industry uses my methods to help detect online credit card fraud. I continue to be interested in other forms of information leakage and side channels. For example, we studied the ability to infer what one is watching on TV by monitoring their powerline. We studied the ability to fingerprint automotive drivers by the ways in which they operated their vehicles. We also studied information leakage in the DNA sequencing pipeline. Wireless Medical Device Security: In 2008, my colleagues and I published the first academic security analysis of a real, wireless implantable medical device. This work helped initiate the field of medical device security and resulted in significant changes within industry and government. The executive producers of Homeland incorporated medical device security into their TV show after reading about our research. My subsequent work includes studies with patients and medical providers, and encompasses cardiac devices, insulin pumps and glucose monitors, telerobotic surgery, and brain-machine interface devices. For the latter, we coined the term neurosecurity. Our vision is outlined in a 2010 New England Journal of Medicine article. We co-founded the USENIX HealthSec conference in 2010. Automotive Computer Security: In 2010 and 2011, my colleagues and I published the first experimental computer security analyses of a modern automobile, including research results demonstrating the ability to remotely compromise a vehicle over cellular, Bluetooth, and other non-contact means. This work has been cited as the impetus for the creation of a $70M DARPA effort (HACMS) as well as significant changes within the automotive industry and government. In the 60 Minutes segment on the DARPA HACMS effort, they included footage of the car that we used in our experiments. This work also received the 2021 American Association for the Advancement of Science (AAAS) Golden Goose Award. This is our project page. Augmented and Mixed Reality, Computer Security, and Privacy: In 2011, my colleagues and I initiated a research program focused on computer security and privacy risks with next-generation augmented and mixed reality technology. Our program began at a time before Google Glass (and many more recent technologies) were announced. Our research is broad and includes, for example, the design of systems, evaluation of systems, studies with users, a collaboration with neuroscientists, and hosting an academic-industry workshop. This is our project page. Computer Security and Smarthome Technologies: In 2012, my colleagues and I published a paper titled \"Computer Security in the Modern Home.\" This paper articulated our vision for computer security and privacy for smarthome technologies, for the decades to come. Our 2012 article is based on work that we did prior to 2012. We continue to conduct research in this space. Example works include our discovery of security and privacy risks with wireless toy robots, our discovery that it is possible for devices monitoring a home’s powerline to infer information about what is being displayed on a TV, our discovery that it is possible for a compromised device controlling an electrical outlet to \"pop\" lightbulbs, our study of security and privacy risks and practices when the owners of a residence are not the occupants (e.g., in the case of vacation rentals by owners), our study of the use of technologies in smart cities, our study of deceptive design patterns with voice assistants, and our study of 3D digital twins of personal residences. Web Tracking, Privacy, and Ads: In 2012, my colleagues and I published one of the first measurement studies of the privacy risks with online web tracking. We continue to study the advertising ecosystem from a security and privacy lens. We used the Wayback Machine to retroactively study web tracking in the past. We explored the means by which the purchasers of ads can use the advertising ecosystem as a large-scale surveillance platform (see also minute 21:00 and onward of Last Week Tonight). We have also studied clickbait and deceptive ads on news and misinformation sites and the interactions between ads and screen readers. Tricking Computer Vision Algorithms with Physical Objects: In 2017, my colleagues and I wrote a paper studying the ability to trick computer vision algorithms with alterations to physical objects. Specifically, by strategic placement of stickers, we tricked a computer vision algorithm into interpreting a stop sign as a speed limit sign. This paper was published in 2018 and has been cited as part of the motivation for the creation of a $70M DARPA program (GARD). Our Stop Sign has been on display in at the Science Museum in London, in their exhibit on autonomous driving. This work inspired us to explore, from a legal perspective, whether tricking a robot is considered \"hacking\". DNA + Biology + Computer Security: In 2017, my colleagues and I published a paper that studied, for the first time, the ability to compromise computer software with exploit code encoded in synthesized DNA. Figure 1 in our paper provides a photo of a test tube containing our synthesized DNA. In 2020, we published a study of privacy risks with genetic genealogy systems. We are calling this field \"CyBio Security\". I continue to research cybio security risks and defenses; this is our project page. Computer Security and Ethics: I have interrogated questions of ethics throughout my career. In 2023, my colleagues and I published a paper titled \"Ethical Frameworks and Computer Security Trolley Problems: Foundations for Conversations\". This paper explores moral dilemmas in computer security research using frameworks from ethics and moral philosophy. While we were not the first to consider ethics and computer security, nor will we be the last, it is our hope that this paper -- and our ongoing work at the intersection of ethics, moral philosophy, and computer security research -- will contribute t",
  "content_length": 19509,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:29"
}