{
  "name": "Tae-Kyun Kim 0001",
  "homepage": "https://sites.google.com/view/tkkim",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationKAIST Computer vision and Learning lab (KCVL)Tae-Kyun (T-K) Kim, PhDProfessorSchool of Computing, KAISTTae-Kyun (T-K) Kim is Professor and the director of Computer Vision and Learning Lab at School of Computing, KAIST since 2020, and has been an adjunct reader of Imperial College London (ICL), UK for 2020-2024. He led Computer Vision and Learning Lab at Imperial College during 2010-2020. He obtained his PhD from Univ. of Cambridge in 2008 and Junior Research Fellowship (governing body) of Sidney Sussex College, Univ. of Cambridge during 2007-2010. His BSc and MSc are from KAIST in 1998 and 2000, he worked at Samsung AIT for 2000-2004 (military duty). His research interests primarily lie in machine (deep) learning for 3D computer vision, generative AI and Physics-based AI, including: articulated 3D hand/body reconstruction, face analysis and recognition, 6D object pose estimation, activity recognition, object detection/tracking, active robot vision, which lead to novel active and interactive visual sensing. He has co-authored over 100 academic papers in top-tier conferences and journals in the field, and has co-organised series of HANDS workshops and 6D Object Pose workshops (in conjunction with CVPR/ICCV/ECCV) since 2015 to 2020. He was the general chair of BMVC17 in London, the program co-chair of BMVC23, and is Associate Editor of IEEE Trans on PAMI, Pattern Recognition Journal, Image and Vision Computing Journal. He regularly serves as an Area Chair for top-tier vision/ML conferences. He received KUKA best service robotics paper award at ICRA 2014, and 2016 best paper award by the ASCE Journal of Computing in Civil Engineering, and the best paper finalist at CVPR 2020, and his co-authored algorithm for face image representation is an international standard of MPEG-7 ISO/IEC.Affiliated to: School of Computing, Kim Jaechul Graduate School of AI, Robotics Graduate Program, Metaverse Graduate Program @ KAISTResearch InterestsMachine (Deep) Learning for 3D Computer Vision, Generative AI, Physics-based AI, Man-Machine Interface, and RoboticsContact Details504 N1, School of Computing, KAIST, 291 Daehak-ro, Yuseong-gu, Daejeon, KoreaWebpage: https://sites.google.com/view/tkkim/ , https://labicvl.github.ioE-mail: kimtaekyun@kaist.ac.krOpen positions:  PhD students and Postdocs in Computer Vision and Machine LearningWe are always looking for strong candidates for PhD and postdoc positions. Topics include (not limited to) 6D object/hand pose estimation, 3D object detection and tracking, GANs, data augmentation, 2D/3D face, deep reinforcement learning, robotics. Applicants should have a first-class degree and a strong track record in CVPR/ICCV/ECCV, NIPS/ICML/ICLR, or PAMI/IJCV/TIP. Candidates who are able to carry highest quality research independently are pursued. If you are interested, please send me an email titled ‘phd/postdoc application’, where you include your CV and indicate the earliest starting date.Tae-Kyun (T-K) KimGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3093,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:29"
}