{
  "name": "Tae-Eui Kam",
  "homepage": "http://mailab.korea.ac.kr",
  "status": "success",
  "content": "MAILAB | Medical Artificial Intelligence ìë£ì¸ê³µì§ë¥ ì°êµ¬ì¤ ìì¬ ë° ë°ì¬ê³¼ì  ëª¨ì§ ìë´ ìë£ì¸ê³µì§ë¥ ì°êµ¬ì¤(ì§ëêµì: ê°íì)ììë ì¸ê³µì§ë¥ ê¸°ë° ìë£ë¬¸ì  í´ê²°ì ê´ì¬ ìë ì°êµ¬ìì ëª¨ì§í©ëë¤. ì°êµ¬ì£¼ì  ADMET ìì¸¡ì í¬í¨í ì ì½ê°ë° ì ì£¼ê¸°ììì ì¸ê³µì§ë¥ ìì© ë¶ìêµ¬ì¡° ë° ì§ëë¶ì ë°ì´í°ë¥¼ íì©í ë¥ë¬ë ëª¨ë¸ ê°ë° ëì í¸ ê¸°ë° ë í´ì ê¸°ì  (brain decoding) ìë£ VQA ë± ë©í°ëª¨ë¬ ìë£ ì¸ì´ ëª¨ë¸ ì°êµ¬ ìë£ìì, ìì²´ì í¸ ë±ì íì©í AI ê¸°ë° ë° ëì§í ë¶ì ì°ëìê±´ ë¨¸ì ë¬ë/ë¥ë¬ëì ëí ìµì  ê¸°ì  ëí¥ íì Pythonì ì´ì©í ë°ì´í° ë¶ì ë° ëª¨ë¸ë§ ê²½í íí/ìë¬¼ì ë³´í ì ê³µì ê¾¸ì¤í ì°êµ¬ ì°¸ì¬ê° ê°ë¥í ì± ìê° ìë ì§ìì ë¬¸ì ë° ì§ì ê´ì¬ ìë ë¶ì ìë ì´ë©ì¼ë¡ ì´ë ¥ì(ìì ìì)ì í¨ê» ê°ë¨í ìê¸°ìê°ë¥¼ ë³´ë´ì£¼ìê¸° ë°ëëë¤. ð§ mailab.korea@gmail.com Research Areas Medical Image Analysis Our team conducts research on deep learning-based medical image analysis, focusing on MRI and related modalities. Cross-modality Image Translation Post-operative MRI Generation Multi-modality fusion Survival prediction Brain-Computer Interface Our team applies deep learning methods to analyze EEG signals in Brain-Computer Interfaces (BCIs). We aim to provide personalized solutions for individual users, while also working on frameworks that have broader applicability. Visual Brain Decoding Epileptic Seizure Diagnosis & Prediction Emotion Recognition, Motor Imagery Brain Disease Diagnosis Our team conduct comprehensive research into a range of complex neurological disorders, working to advance the field of diagnosis techniques using various deep learning techniques. Synthetic FC Generation Multi-Atlas Integrationn Graph Structure Learning Domain Generalization Cell Image Analysis To gain a deeper understanding of brain function, our team aimed to enhance the accuracy of calcium signals by refining the processing of calcium imaging data. We employ deep learning techniques for the processing of calcium imaging data. Isotropic 3D reconstruction in volumetric microscopy imaging 3D reconstruction from sparse 2D microscopy images Molecular AI Our team excels in the field of Molecular AI, unraveling the intricacies of molecular behaviors through innovative research. We are now pioneering research in Molecular Optimization, aiming to automate the refinement of molecular structure. ADME/T Prediction Mass spectrum analysis Offline molecular optimization Computational lithography for semiconductor Reinforcement Learning Our team leverages reinforcement learning for personalized medical decision-making, continuous learning, and research in areas like ROI and EEG-based medical traits, with a focus on enhancing care and patient outcomes. Personalized Decision Making with Reinforcement Learning Feature Selection with Multi-Agent Reinforcement Learning Medical Vision-language Model Our team focuses on multimodal learning in Medical AI by developing vision-language models that integrate imaging, signals, clinical text, and knowledge to tackle real-world clinical tasks. Optimizing medical VLMs via clinical-aware preference alignment Clinical knowledge-guided refinement framework with retrieval-augmented generation (RAG) Pathology-aligned radiology report generation Interpretable reasoning ability for medical VLMs Semi-supervised Learning in Medical Imaging Our team develops robust semi-supervised segmentation frameworks that address annotation scarcity in medical imaging, aiming for practical deployment in real-world clinical AI settings. Semi-supervised Image Segmentation with Pseudo-label Refinement Semi-supervised Image Segmentation for Domain Generalization",
  "content_length": 3843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:28"
}