{
  "name": "Taesoo Kwon",
  "homepage": "http://calab.hanyang.ac.kr/cgi-bin/home.cgi?node=Taesoo",
  "status": "success",
  "content": "| calab.hanyang.ac.kr Skip to main content Control & Animation Lab Main menu Home People Publications Courses Research projects Taesoo Kwon ProfessorCALab (Control & Animation Laboratory) Department of Computer ScienceHanyang University 222 Wangsimni-ro, Seongdong-gu, Seoul 04763, Korea Office : 401 IT/BT bldg E-mail : taesoo at hanyang dot ac dot kr Education Ph. D., Computer Science (08/2002-09/2007) advised by Prof. Sung Yong Shin, Korea Advanced Institute of Science and Technology (KAIST). M. S., Computer Engineering (03/2000 - 02/2002) advised by Prof. Yeong-Gil Shin, Seoul National University. B. S., Computer Science (03/1996 - 02/2000) Seoul National University. Professional Experience Postdoctoral researcher (12/2008 - 1/2012) The Robotics Institute, Carnegie Mellon University. Performed research on character animation using robot control algorithms and dynamics simulation under the supervision of Prof. Jessica K. Hodgins. Postdoctoral researcher (11/2007 - 12/2008) Movement Research Lab (MRL), Dept. Computer Engineering, Seoul National University. Performed research on motion editing and motion classification under the supervision of Prof. Jehee Lee. Research assistant (7/2002 - 5/2006, 8/2006 - 8/2007) Theory and Computation Lab, Div. Computer Science, KAIST. Performed research in the area of on-line character animation under the supervision of Prof. Sung Yong Shin. Visiting researcher (6/2006 - 8/2006) Computer Graphics Lab, Dept. Complexity Science and Engineering, University of Tokyo. Software engineer (3/2000 - 2/2002) Lead programmer, Zoiment(R). Developed a rendering engine and user-interfaces for use in a 3D game (MagicBuilder). Publications Link Theses Motion Modeling for On-Line Motion Synthesis Taesoo Kwon, Ph. D. thesis, Dept. of Electrical Engineering and Computer Science, KAIST, August, 2007. View-dependent Shadow Maps using Projective Geometry (Written in Korean) Taesoo Kwon, M. S. thesis, Dept. of Computer Science, Seoul National University, February, 2002. Open source projects luna-gen Lua binding code generator written in pure lua. gitv git + vim + etags made easy. PaperCrop reformats PDF fies to be viewed on small screen devices. Links http://www.ogre3d.org (Rendering Engine) http://www.lua.org (Scripting Language for Embedding) http://luvit.io (Asynchronous I/O for Lua) http://www.boost.org (Useful Stuffs) http://www.fltk.org (Simple UI Toolkit)",
  "content_length": 2416,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:31"
}