{
  "name": "Taesoo Kim",
  "homepage": "https://taesoo.gtisc.gatech.edu",
  "status": "success",
  "content": "Taesoo Kim Taesoo Kim (ê¹íì) Professor, School of Cybersecurity and Privacy (SCP) & School of Computer Science (SCS), College of Computing, Georgia Tech CV email https://github.com/tsgates ( ★) PGP Key / Keybase SSLab / GTS3 / Team Atlanta / r00timentary / LinkedIn Contacts S0925, CODA Bldg, Georgia Tech. 756 West Peachtree Street NW Atlanta, GA 30332-4016 (404) 385-2934 Research Interests Systems Security, Operating Systems, Programming Languages, and Distributed Systems. Teaching (all) Fall 2025: Information Security Lab (CS 4803/6365) Fall 2024: Information Security Lab (CS 4803/6365) Fall 2023: Information Security Lab (CS 6365) Spring 2023: Exploiting Smart Contracts and DeFi (CS 8803) Fall 2020: Information Security Lab (CS 6265 A/O01/OCY) Spring 2020: Design Operating Systems (CS 3210 A) Fall 2019: Information Security Lab (CS 6265 A/O01/OCY) Fall 2018: Information Security Lab (CS 6265 A (8803)) Fall 2017: Information Security Lab (CS 6265 A (8803)) Fall 2016: Information Security Lab (CS 6265 A) Spring 2016: Design Operating Systems (CS 3210 A/GR1) Fall 2015: Information Security Lab (CS 6265 E) Fall 2014: Special Topics: Building Secure Systems (CS 8803 BSS) Publications (all/25/24/23/22/21/20/19/18/17/16/15/...) Agentic Specification Generator for Move Programs (to appear). Yu-Fu Fu, Meng Xu and Taesoo Kim. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE), Seoul, Korea, Nov 2025. ATLANTIS: AI-driven Threat Localization, Analysis, and Triage Intelligence System. [ paper ] Taesoo Kim, HyungSeok Han, Soyeon Park, Dae R. Jeong, Dohyeok Kim, Dongkwan Kim, Eunsoo Kim, Jiho Kim, Joshua Wang, Kangsu Kim, Sangwoo Ji, Woosun Song, Hanqing Zhao, Andrew Chin, Gyejin Lee, Kevin Stevens, Mansour Alharthi, Yizhuo Zhai, Cen Zhang, Joonun Jang, Yeongjin Jang, Ammar Askar, Dongju Kim, Fabian Fleischer, Jeongin Cho, Junsik Kim, Kyungjoon Ko, Insu Yun, Sangdon Park, Dowoo Baik, Haein Lee, Hyeon Heo, Minjae Gwon, Minjae Lee, Minwoo Baek, Seunggi Min, Wonyoung Kim, Yonghwi Jin, Younggi Park, Yunjae Choi, Jinho Jung, Gwanhyun Lee, Junyoung Jang, Kyuheon Kim, Yeonghyeon Cha and Youngjoon Kim. Arxiv, Oct 2025. Principles and Methodologies for Serial Performance Optimization. [ paper | slides ] Sujin Park, Mingyu Guan, Xiang Cheng, and Taesoo Kim. In Proceedings of the 19th Symposium on Operating Systems Design and Implementation (OSDI 2025), Boston, MA, July 2025. PORTAL: Fast and Secure Device Access with Arm CCA for Modern Arm Mobile System-on-Chips (SoCs). [ paper | slides ] Fan Sang, Jaehyuk Lee, Xiaokuan Zhang, and Taesoo Kim. In Proceedings of the 46th IEEE Symposium on Security and Privacy (S&P 2025), San Francisco, CA, May 2025. TikTag: Breaking ARM's Memory Tagging Extension with Speculative Execution. [ paper | slides | code ] Juhee Kim, Jinbum Park, Sihyeon Roh, Jaeyoung Chung, Youngjoo Lee, Taesoo Kim, and Byoungyoung Lee. In Proceedings of the 46th IEEE Symposium on Security and Privacy (S&P 2025), San Francisco, CA, May 2025. Dark Reading, The Register, Security Week, Low Level Learning, Apple RUG: Turbo LLM for Rust Unit Test Generation. [ paper | slides | code ] Xiang Cheng, Fan Sang, Yizhuo Zhai, Xiaokuan Zhang, and Taesoo Kim. In Proceedings of the 47th International Conference on Software Engineering (ICSE 2025), Ottawa, Canada, May 2025. RAKIS: Secure Fast I/O Primitives Across Trust Boundaries on Intel SGX. [ paper | slides | code ] Mansour Alharthi, Fan Sang, Dmitrii Kuvaiskii, Mona Vij, and Taesoo Kim. In Proceedings of the 20th ACM European Conference on Computer Systems (EuroSys 2025), Rotterdam, Netherlands, March 2025. MALintent: Coverage Guided Intent Fuzzing Framework for Android. [ paper | slides | code ] Ammar Askar, Fabian Fleischer, Christopher Kruegel, Giovanni Vigna and Taesoo Kim. In Proceedings of the 2025 Network and Distributed System Security Symposium (NDSS 2025), San Diego, CA, February 2025. Heterogeneous Graph Neural Network on Semantic Tree. [ paper | slides | code ] Mingyu Guan, Jack W Stokes, Qinlong Luo, Fuchen Liu, Purvanshi Mehta, Elnaz Nouri and Taesoo Kim. In Proceedings of the 39th Annual AAAI Conference on Artificial Intelligence (AAAI 2025), Philadelphia, PA, Feb 2025. Statically Discover Complex Cross-Entry Use-After-Free Vulnerabilities in the Linux Kernel and Beyond. [ paper | slides | code ] Hang Zhang, Jangha Kim, Chuhong Yuan, Zhiyun Qian and Taesoo Kim. In Proceedings of the 2025 Network and Distributed System Security Symposium (NDSS 2025), San Diego, CA, February 2025. Selective Generation for Controllable Language Models. [ paper | slides | code ] Minjae Lee, Kyungmin Kim, Taesoo Kim, and Sangdon Park. In Proceedings of the Neural Information Processing Systems (NeurIPS 2024) - Spotlight, Vancouver, B.C., Canada, Dec 2024. PeTAL: Ensuring Access Control Integrity against Data-only Attacks on Linux. [ paper | slides ] Juhee Kim, Jinbum Park, Yoochan Lee, Chengyu Song, Taesoo Kim, and Byoungyoung Lee. In Proceedings of the 28th ACM Conference on Computer and Communications Security (CCS 2024), Salt Lake City, UT, October 2024. I Experienced More than 10 DeFi Scams: On DeFi Users' Perception of Security Breaches and Countermeasures. [ paper | slides ] Mingyi Liu, Jun Ho Huh, HyungSeok Han, Jaehyuk Lee, Jihae Ahn, Frank Li, Hyoungshick Kim and Taesoo Kim. In Proceedings of the 33rd USENIX Security Symposium (Security 2024), Philadelphia, PA, August 2024. The Conversation Bypassing ARM's Memory Tagging Extension with a Side-Channel Attack. [ paper | slides | code ] Juhee Kim, Jinbum Park, Sihyeon Roh, Jaeyoung Chung, Youngjoo Lee, Taesoo Kim, and Byoungyoung Lee. BlackHat USA 2024, Las Vegas, NV, August 2024. Dark Reading, The Register, Security Week, Low Level Learning, Apple Sense: Enhancing Microarchitectural Awareness for TEEs via Subscription-Based Notification. [ paper | slides ] Fan Sang, Jaehyuk Lee, Xiaokuan Zhang, Meng Xu, Scott Constable, Yuan Xiao, Michael Steiner, Mona Vij, and Taesoo Kim. In Proceedings of the 2024 Network and Distributed System Security Symposium (NDSS 2024), San Diego, CA, February 2024. AEX-Notify: Thwarting Precise Single-Stepping Attacks through Interrupt Awareness for Intel SGX Enclaves. [ paper | slides ] Scott Constable, Jo Van Bulck, Xiang Cheng, Yuan Xiao, Cedric Xing, Ilya Alexandrovich, Taesoo Kim, Frank Piessens, Mona Vij and Mark Silberstein. In Proceedings of the 31st USENIX Security Symposium (Security 2023), Anaheim, CA, August 2023. Chips & Salsa Episode 58: AEX-Notify, GT News ACon2: Adaptive Conformal Consensus for Provable Blockchain Oracles. [ paper | slides | code ] Sangdon Park, Osbert Bastani and Taesoo Kim. In Proceedings of the 31st USENIX Security Symposium (Security 2023), Anaheim, CA, August 2023. autofz: Automated Fuzzer Composition at Runtime. [ paper | slides | code ] Yu-Fu Fu, Jaehyuk Lee and Taesoo Kim. In Proceedings of the 31st USENIX Security Symposium (Security 2023), Anaheim, CA, August 2023. Memory Protection Keys: facts, key extension perspectives, and discussions. [ paper ] Soyeon Park, Sangho Lee and Taesoo Kim. IEEE Security & Privacy, May/June 2023. PyFET: Forensically Equivalent Transformation for Python Binary Decompilation. [ paper | slides ] Ali Ahad, Chijung Jung, Ammar Askar, Doowon Kim, Taesoo Kim and Yonghwi Kwon. In Proceedings of the 44th IEEE Symposium on Security and Privacy (S&P 2023), San Francisco, CA, May 2023. UTOPIA: Automatic Fuzz Driver Generation using Unit Tests. [ paper | slides | code ] Bokdeuk Jeong, Joonun Jang, Hayoon Yi, Jiin Moon, Junsik Kim, Intae Jeon, Taesoo Kim, WooChul Shim and Yong Ho Hwang. In Proceedings of the 44th IEEE Symposium on Security and Privacy (S&P 2023), San Francisco, CA, May 2023. POPKORN: Popping Windows Kernel Drivers At Scale. [ paper | slides | code ] Rajat Gupta, Lukas Dresel, Noah Spahn, Giovanni Vigna, Christopher Kruegel and Taesoo Kim. In Proceedings of the Annual Computer Security Applications Conference (ACSAC), Austin, TX, Dec 2022. RoboFuzz: Fuzzing Robotic Systems over Robot Operating System (ROS) for Finding Correctness Bugs. [ paper | slides | code ] Seulbae Kim and Taesoo Kim. In Proceedings of the 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), Singapore, November 2022. Scalable and Secure Virtualization of HSM With ScaleTrust. Juhyeng Han, Insu Yun, Seongmin Kim, Taesoo Kim, Sooel Son and Dongsu Han. IEEE/ACM Transactions on Networking (ToN), November 2022. Fuzzing@Home: Distributed Fuzzing on Untrusted Heterogeneous Clients. [ paper ] Daehee Jang, Ammar Askar, Insu Yun, Stephen Tong, Yiqin Cai and Taesoo Kim. In Proceedings of the 25th International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2022), Limassol, Cyprus, October 2022. Modulo: Finding Convergence Failure Bugs in Distributed Systems with Divergence Resync Models. [ paper | slides ] Beom Heyn Kim, Taesoo Kim and David Lie. In Proceedings of the 2022 USENIX Annual Technical Conference (ATC 2022), Carlsbad, CA, July 2022. Pridwen: Universally Hardening SGX Programs via Load-Time Synthesis. [ paper | slides | code ] Fan Sang, Ming-Wei Shih, Sangho Lee, Xiaokuan Zhang, Michael Steiner, Mona Vij, and Taesoo Kim. In Proceedings of the 2022 USENIX Annual Technical Conference (ATC 2022), Carlsbad, CA, July 2022. Application-Informed Kernel Synchronization Primitives. [ paper | slides | code ] Sujin Park, Diyu Zhou, Yuchen Qian, Irina Calciu, Taesoo Kim, and Sanidhya Kashyap. In Proceedings of the 16th Symposium on Operating Systems Design and Implementation (OSDI 2022), Carlsbad, CA, July 2022. DynaGraph: Dynamic Graph Neural Networks at Scale. [ paper | slides ] Mingyu Guan, Anand Padmanabha Iyer and Taesoo Kim. Joint Workshop on Graph Data Management Experiences and Systems and Network Data Analytics (GRADES-NDA), Philadelphia, PA, June 2022. In-Kernel Control-Flow Integrity on Commodity OSes using ARM Pointer Aut",
  "content_length": 40076,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:34"
}