{
  "name": "Tai Sing Lee",
  "homepage": "http://www.cnbc.cmu.edu/~tai",
  "status": "success",
  "content": "Dr.. Tai Sing Lee's Homepage Dr. Tai Sing Lee Professor in Computer Science Computer Science Department and Center for the Neural Basis of Cognition Carnegie Mellon University Pittsburgh, PA 15213 Office: Mellon Institute Rm 115 Phone: 412-268-1060 Email: tai at cnbc dot cmu dot edu Faculty member in the Computer Science Department, Center for the Neural Basis of Cognition , and Machine Learning Department, Carnegie Mellon University, and adjunct faculty member of the Department of Neuroscience, University of Pittsburgh. Director of Lee Laboratory for Biological and Machine Intelligence Research at Carnegie Mellon Director of Intercolledge Undergraduate Minor in Neural Computation, Carnegie Mellon University. Coordinator of Undergraduate Training fellowship in Computational Neuroscience (Program in Neural Computation). Director of Peking University - Carnegie Mellon University Summer Program in Computer Science, School of Computer Science, Director of Tsinghua University - Carnegie Mellon University Summer Program in Computer Science, School of Computer Science Research interests: computational neuroscience, computational vision, neurophysiology of the primate visual systems, active and adaptive vision, hierarchical coding and inference, mid-level vision, development of infant vision, learning and adaptation, structure of neural codes. Courses and Seminars Artificial Intelligence (15-381/681) Fall 2017 Machine Learning from Neural Cortical Circuits (15-874) Spring 2016 Neural Computation (15-386/686) Spring 2021 Spring 2022 Spring 2023 Spring 2023 Spring 2023 Computer Vision (15-385/685) Spring 2011, Spring 2013. Computational Perception (86-375/675) (15-387) Fall 2020 , Fall 2021 Fall 2022 , Fall 2023 Fall 2024 , Fall 2025 Computational Neuroscience of Vision (86-712) Fall 2012 Advanced Topics in Computational Neuroscience (2002-2008) with Mike Lewicki Lee Lab meeting Presentations Projects Project MICrONS at Carnegie Mellon. Carnegie Mellon joins IARPA project to reverse engineering brain algorithms . Education S.B. Engineering Physics, Harvard College (1986) . Ph.D. Engineering Sciences, Harvard University (1993) . Ph.D. Medical Physics and Engineering, Harvard-MIT Division of Health Science and Technology (1993) Postdoc. Biomedical Physics and Neurophysiology, Harvard University (DAS) and Massachusetts Institute of Technology (BCS) (1993-96) . Honors Society of Harvard Engineers and Scientists Honor Scholar (1985) . Harvard-MIT HST Fellowship Award (1986) . McDonnell Pew Foundation Young Investigator Research Award (1996) . NSF Faculty Career Development (CAREER) Award (2000). ICCV Helmholtz prize (2013) . Current Postdoctoral Fellows Current Ph.D. and M.S. Students Ge (Summer) Huang Neural Computation, Carnegie Mellon. (on leave) Tianqin Li Computer Science, Carnegie Mellon. Zhiwen Bian Computational Biology, Carnegie Mellon. Jinyi Ye Computational Biology, Carnegie Mellon. Xirui Liu Computational Biology, Carnegie Mellon. Yue Li Artificial intelligence engineeering, Carnegie Mellon. Yingjue Bian Biomedical Engineering, Carnegie Mellon. Dongfeng Li Biomedical Engineering, Carnegie Mellon. Yize Wu Biomedical Engineering, Carnegie Mellon. David Wang Computer Science, Carnegie Mellon. Yuxuan Zhu Computaitonal Biology, Carnegie Mellon. Haifei Guo Biomedical Engineering, Carnegie Mellon. Current Undergraduate Research Fellows Issac Lin , Computer Science, Carnegie Mellon, CMU Alan Ramirez , Computer Science, Carnegie Mellon, CMU George Liu , Computer Science, Carnegie Mellon, CMU Soham Raychaudhuri, Computer Science, Carnegie Mellon, CMU Ronav Jaiwal Computer Science, Carnegie Mellon. Husain Raja Computer Science, Carnegie Mellon. Om Kathira Neuroscience, Carnegie Mellon. Former Ph.D. and M.S. Students Stella Yu , Ph.D. Robotics 2002, CMU. Assistant professor in computer science, Boston college, MA. Brian Potetz , Ph.D. Computer Science, 2008, CMU. Assistant professor in computer science, University of Kansas. Google Research CA. Ryan Kelly , Ph.D. Computer Science, 2010, CMU. Google Research New York. Tom Stepleton , Ph.D. Robotics 2010, CMU. Deep Mind, London. Xiong Li , Ph.D. Automation 2013, Shanghai JiaoTong. Start-up. China Yimeng Zhang , Ph.D. Computer Science, 2021. Carnegie Mellon. Pinterest. Andrew Luo Neural Computation, 2021. Ph.D. program, Carnegie Mellon. Liyuan Liang Neural Computation, 2021. Ph.D. program, Carnegie Mellon. Richard Romero , M.S. Computer Science. 1999. Co-Founder, Eizel Technology Ryan Poplin, M.S. in Neural Computation. 2009. Broad Institute, Boston. Google Research Gaya Mohankumar , M.S. 2017. in Biomedical engineering, Boston. Esha Uboweja , M.S. 2015. in Computer Science and Computer Vision, Amazon, Google Research. Shefali Umrania , M.S. 2017. in Computational Biology, Boston. Jingyuan Li , M.S. in Biomedical engineering, 2019. Ph.D. program in Biomedical Engineering, University of Washington. Yuanyuan Wei , M.S. in EECS, Ph.D. program in Biomedical Engineering, 2019. SUSTech- University of British Columbia. Mert Inan M.S. Computational Biology, 2019. Carnegie Mellon. Ph.D. program in University of Pittsburgh Jiaxin Wang M.S. Computaitonal Biology, 2021. Carnegie Mellon. Yusen Zhu M.S. Biomedical Engineering, 2021. Carnegie Mellon. Ph.D. program at George Tech Xiaoqi Zhang M.S. Computaitonal Biology, 2021. Carnegie Mellon. Ph.D. program at Purdue Sicheng Dai M.S. Biomedical Engineering, 2022. Carnegie Mellon. Ph.D Program Chinese Academy of Sciences. Mirudhula Mukundan M.S. Comutational Biology 2022, Carnegie Mellon. Biotech Zitong Wang MS. Biomedical Engineering, 2023. Carnegie Mellon. Ph.D. Program University of Pittsburgh. Yung Ying Chen MS. Biomedical Engineering, 2023. Carnegie Mellon. Ph.D. Program at Biomedical Engineering, GeorgiaTech Ziqi Wen M.S. Biomedical Engineering, 2024 Carnegie Mellon. Ph.D. Program Cognitive Science/Brain Computer Interface at UC Santa Barbara Weifan Wang M.S. Biomedical Engineering, 2023 Carnegie Mellon. Ph.D. program in Biomedical engineering. Carnegie Mellon Junru Zhao M.S. Biomedical Engineering, 2024 Carnegie Mellon. Ph.>D. program in Psychology, Carnegie Mellon Shang (Gale) Gao M.S. Biomedical Engineering, 2023. Carnegie Mellon. Ph.D. program. in Caltech (CNS) Hadrien Helfgott M.S. Computer Science, 2025. Carnegie Mellon. PH.d. Program in University of Edinburgh (Bioacoustics) Dunhan Jiang MS. Computational Biology, 2025 Carnegie Mellon. Leiran Song MS Electrical Engineering, 2025, Carnegie Mellon. Jingtao Zhang MS Computer Science, 2025, Carnegie Mellon. Former Postdoctoral Fellows Wenhao Zhang Ph.D. Biophysics (2016) Institute of Neuroscience, China. Asistant Professor, University of Texas SW Medical Center, Dallas. Jason Samonds , Ph.D. Electrical Engineering (2004) Vanderbilt University. Currently in U. Texas, Austin. Corentin Massot , Ph.D. Congitive Science, University of Glasgow & McGill University. Research assistant professor in U. Pittsburgh. Matthew Smith , Ph.D. Neuroscience (2002), New York University. Assistant Professor in Ophthalmology, University of Pittsburgh. Associate Professor in Biomedical Engineering, Carnegie Mellon. Xiaogang Yan , Ph.D. Biomedical Engineering (1990), Zhejiang University, PRC. York University. Yugou Yu , Ph.D. Physics (2001) Nanjing University, PRC. Professor in Computational Neuroscience, Fudan University, Shanghai, China. Former Undergraduate Research Fellows (and their next steps) Gil Bartholomew, Music and Physics, Carnegie Mellon, CMU MS in ML program, Imperial College London Zixin Sha , Computational Neuroscience, Carnegie Mellon, CMU. MD. Program, University of Florida. Wentao Qiu, YuanPi College, Computer Science, Peking University. Ph.D. program in Neuroscience at Northwestern. Danial Wang , Computer Science, CMU, Ph.D. program in Computer Science at Yale. Nicholas McNeal Computer Science, Ohio State University. Ph.D. program in Computer Science, Georgia Tech Hal Rockwell, Computational Biology, CMU. Ph.D. program in Neuroscience, University of Chicago Deying Song , Yuanpei College, Mathematics, Peking Univeristy . Ph.D. program in Neural Computation, Carnegie Mellon Aniekan Umoren , BCS and EECS, MIT. Ph.D. Program in Computational Neuroscience, Columbia University. Chen Guo , Computer Science, Tsinghua University, Ph.D. program, Tsinghua University Jennifer Huang , Computer Science, CMU. Facebook Simin Li , Computer Science, CMU. Amazon Yuqi Zhang , Computer Science, CMU. Apple Ho-Yin Chau, Physics, Mathematics, Computer Science, UC Berkeley , Ph.D. program in Theoretical Neuroscience, Columbia University. Julie Xueyan Niu , Mathematics, Hong Kong University, Ph.d. program in Theoretical Neuroscience, New York University Zinui Wu , Mathematics, Statistics and Machine Learning, Carnegie Mellon University, Master in Machine Leearning, Oxford University. Ph.D. program in EECS, MIT. Yue Xu , Computer Science, Carnegie Mellon University, CNS Ph.D. program at Caltech. Siming Yan , Computer Science, Peking University, Ph.D. program in Computer Science. UT Austin. Jielin Qiu , EE Shanghai Jiaotung University, Ph.D program in CS, Carnegie Mellon. Bowen Xiao , Computer Science, Peking University. Xuyang Fang , Computer Science, Peking University, MS program in Computer Science, Carnegie mellon. Hao Wang , Computer Science, Peking University. M.S. Program in CS, Stanford University. Xingyu Lin , Computer Science, Peking University. Ph.D. Program in CS, CMU. Tiancheng Zhi , Computer Science, Peking University. Ph.D. Program in CS, CMU. Elizabeth Ottens , Electrical and Computer Engineering, CMU, Apple Machine Learning Core Engineer Lingzhang Jiang , Computer Science, CMU, Singapore Dan Howarth , Computer Science, CMU, Ph.D. program in Robotics, CMU. Mingmin Zhao , Computer Science, Peking University. Ph.D. Program in EECS, MIT. Chengxu Zhuang , Electronics Engineering, Tsinghua University, Ph.D. Program in computational neuroscience, Stanford University. Elizabeth Ottens , Electrical and Comput",
  "content_length": 31892,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:36"
}