{
  "name": "Taisook Han",
  "homepage": "https://cs.kaist.ac.kr/people/view?idx=32&kind=faculty&menu=160",
  "status": "success",
  "content": "한태숙 - KAIST School of Computing, 카이스트 전산학부 주메뉴로 이동 메인본문내용으로 이동 본문내용으로 이동 바닥글로 이동 홈 소개 ㆍ학부소개 ㆍㆍ 학부장 인사말 ㆍㆍ 학부구성 ㆍㆍ 연혁 ㆍㆍ 학부환경 ㆍㆍ 학부위원회 ㆍ소개자료 ㆍㆍ 학부동영상 ㆍㆍ 학부포토앨범 ㆍㆍ 애뉴얼리포트 ㆍㆍ 뉴스레터 ㆍ교수초빙 ㆍ학부발전기금 ㆍ학부연락처 ㆍㆍ 오시는 길 ㆍ전산학부 명예규정 포용성 ㆍ전산학부 ㆍKAIST ㆍㆍ 학내 인권기구 ㆍㆍ 장애학생 지원 서비스 ㆍㆍ 교내 접근성 ㆍ타대학 소식 ㆍ전체소식 ㆍㆍ 학부소식 ㆍㆍ 수상소식 ㆍㆍ 연구소식 ㆍㆍ 교육소식 ㆍㆍ 온 미디어 ㆍ공지사항 ㆍㆍ 전산학부공지사항 ㆍㆍ KAIST 공지사항 ㆍㆍ KAIST 학사공지 ㆍㆍ 기타 공지사항 ㆍ구성원소식 ㆍㆍ 교수진소식 ㆍㆍ 학생소식 ㆍㆍ 동문소식 ㆍ행사 캘린더 ㆍㆍ 전체행사 ㆍㆍ 세미나 ㆍㆍ 콜로퀴움 ㆍㆍ 박사학위논문심사 ㆍㆍ 기타행사 ㆍㆍ 외부행사 ㆍ뉴스제보 연구 ㆍ리서치 하이라이트 ㆍ연구분야 ㆍㆍ 전산이론 ㆍㆍ 시스템·네트워크 ㆍㆍ 소프트웨어디자인 ㆍㆍ 시큐어컴퓨팅 ㆍㆍ 비주얼컴퓨팅 ㆍㆍ 인공지능·정보서비스 ㆍㆍ 소셜컴퓨팅 ㆍㆍ 인터랙티브컴퓨팅 ㆍ연구실/센터 ㆍㆍ 전체 연구실 ㆍㆍ 전체 연구센터 ㆍ연구논문 ㆍㆍ 학술논문 ㆍㆍ 테크니컬리포트 ㆍㆍ 학부 우수논문상 ㆍ산학협력프로그램 ㆍㆍ 회원사 가입 안내 ㆍㆍ 회원사 소개 교육 ㆍ입학 ㆍㆍ 대학원 입학 ㆍㆍ 학부 입학 ㆍㆍ 장학금 ㆍ교육분야 ㆍㆍ 전산이론 ㆍㆍ 시스템-네트워크 ㆍㆍ 소프트웨어디자인 ㆍㆍ 시큐어컴퓨팅 ㆍㆍ 비주얼컴퓨팅 ㆍㆍ 인공지능·정보서비스 ㆍㆍ 소셜컴퓨팅 ㆍㆍ 인터랙티브컴퓨팅 ㆍ교육프로그램 ㆍㆍ 학부프로그램 ㆍㆍㆍ AI분야 중점이수 ㆍㆍㆍ 정보보호 중점이수 ㆍㆍㆍ 인턴십프로그램 ㆍㆍ 국제협력프로그램 ㆍㆍㆍ DTU/TUB프로그램 ㆍㆍㆍ CQUT프로그램 ㆍ교과과정 ㆍㆍ 학부과정 ㆍㆍ 대학원과정 ㆍㆍ 학사이수요건 ㆍㆍ 대학원이수요건 ㆍㆍㆍ 박사자격시험 ㆍ부가정보 ㆍㆍ 학부생활 ㆍㆍ 학부동아리 ㆍㆍ 취업정보 ㆍㆍㆍ 인턴십모집 ㆍㆍ 연구실인턴십 ㆍㆍ 연구실 배정 ㆍ학사 캘린더 AI is CS ㆍAI 하이라이트 ㆍㆍ AI 리서치 하이라이트 ㆍㆍ AI 소식 하이라이트 ㆍAI 연구 ㆍㆍ 전산이론 ㆍㆍ 시스템-네트워크 ㆍㆍ 소프트웨어디자인 ㆍㆍ 시큐어컴퓨팅 ㆍㆍ 비주얼컴퓨팅 ㆍㆍ 인공지능-정보서비스 ㆍㆍ 소셜컴퓨팅 ㆍㆍ 인터랙티브컴퓨팅 ㆍAI 교육 ㆍㆍ AI 교과목 리스트 ㆍㆍ AI 분야 중점이수 ㆍAI+X 포럼 구성원 ㆍ교수진 ㆍㆍ 전산이론 ㆍㆍ 시스템-네트워크 ㆍㆍ 소프트웨어디자인 ㆍㆍ 시큐어컴퓨팅 ㆍㆍ 비주얼컴퓨팅 ㆍㆍ 인공지능·정보서비스 ㆍㆍ 소셜컴퓨팅 ㆍㆍ 인터랙티브컴퓨팅 ㆍ행정팀/연구원 ㆍㆍ 행정팀 ㆍㆍㆍ 일반행정 ㆍㆍㆍ 학사지원 ㆍㆍㆍ 입학지원 ㆍㆍㆍ 시설지원 ㆍㆍㆍ 예산지원 ㆍㆍ 연구원 자료실 ㆍ공용장비 ㆍㆍ KCLOUD ㆍㆍㆍ KCLOUD1 ㆍㆍㆍ KCLOUD2 ㆍ시설 ㆍㆍ 시설안내 ㆍㆍ 시설예약 ㆍㆍㆍ 세미나실 예약 ㆍㆍㆍ 강의실 예약 ㆍㆍㆍ 소회의실 예약 ㆍㆍㆍ 다용도실험실 예약 ㆍㆍㆍ 복지시설 예약 ㆍ행정업무 ㆍㆍ 원내양식 ㆍㆍ 홍보자료 ㆍ관련사이트 ㆍㆍ 학부페이스북 ㆍㆍ 학부유튜브 ㆍㆍ AI + X 사이트 ㆍㆍ KRAFTON X SoC Directions Home > People > Faculty 한태숙 명예교수 연구분야 전산이론 전공 프로그래밍언어, 컴파일러 학위 PhD, Univ of North Carolina, 1990 웹사이트 http://plus.kaist.ac.kr/~han/ 이메일 전화번호 3533 교수연구실 E3-1, 1419 연구실 한태숙 교수는 서울대학교에서 전자공학과 학사를, KAIST에서 전산학과 석사를 취득하였으며, 1990년 UNC Chapel Hill에서 전산학 박사학위를 취득하였다. 그 뒤 1991년부터 KAIST 전산학부 교수로 재직하고 있으며, 프로그래밍 언어 및 컴파일러 등을 강의해 왔다. 프로그래밍 언어 이론을 기반으로 프로그램 분석 도구 및 소프트웨어 보안 분석 등에 관한 연구를 수행해 왔다. 현재는 바이너리코드의 분석 기법에 초점을 맞추어 연구 과제들을 진행하고 있다. 한국과학기술원(KAIST) 전산학부 34141 대전광역시 유성구 대학로 291(구성동373-1) 한국과학기술원 공과대학 콜로퀴움 KCLOUD 연락처 오시는길 ⓒ KAIST School of Computing. All Rights Reserved. 로그인 개인정보처리방침",
  "content_length": 2181,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:35"
}