{
  "name": "Takahiko Satoh",
  "homepage": "https://sites.google.com/view/satoh-quantum-lab",
  "status": "success",
  "content": "Satoh Quantum Lab.Search this siteEmbedded FilesSkip to main contentSkip to navigationTakahiko Satoh Group慶應義塾大学理工学部情報工学科 佐藤貴彦研究室About Our Lab.量子インターネットとは参画中のプロジェクトお問い合わせAbout Our Lab.当研究室は量子コンピュータ・量子インターネットを用いたアプリケーション開発・ユースケース開拓を中心に，古典・量子ハイブリッド型サイバーフィジカルシステムの実現に貢献する技術開発に取り組んでいます．量子インターネットとは詳細な解説はこちらから量子インターネットは，任意の地点間で量子情報の送受信を可能とする未来の情報流通ネットワークを指す．量子コンピュータに比べて現段階での知名度は低いが，量子情報社会の高度化に向けた重要なインフラになることが想定される．既存のネットワークシステム，従来のいわゆる古典インターネットや量子鍵配送（Quantum Key Distribution, QKD）のためのトラステッドノード・ネットワーク*では原理的に実装できない量子インターネット・アプリケーションの運用・提供を目的とする．量子状態を光ファイバで直接転送すると，距離に応じて指数関数的に伝送レートが低下してしまう．遠距離間量子通信を担うデバイスとして，Briegelらは1998年に量子中継器**を提案した．量子中継器は量子もつれを生成・制御する機能を持ち，光ファイバによって相互接続されることでネットワークを構成する．量子通信の準備として，通信距離に対して多項式的な数の量子もつれの生成と局所量子操作を経て，任意の量子中継器間に高忠実度の量子もつれを共有する．ユーザはこの量子もつれを用いて，量子テレポーテーション***によって量子情報を送受信することが出来る．現段階の量子中継器は開発途上であり，量子もつれの忠実度を回復させることが困難であるため通信距離・品質に大きな制限を持つ．量子インターネットに向けた挑戦として2018年にはQuTechが初のテストベッドとしてハーグ〜デルフト間に４基の環状ネットワークの建設を開始するなど，各国で取り組みが進んでいる．黎明期の量子インターネット・アプリケーションは拡張されたQKDプロトコルが中心になると想定される．高性能量子メモリの実装や耐故障性の獲得など，ネットワークの機能が向上すると共に運用可能なアプリケーションも高度化するだろう．将来的に，簡易端末を持つエンドユーザがセキュアな量子計算を実行可能なブラインド量子計算****や量子コンピュータ同士を接続して行う分散量子計算，匿名性と信頼性を両立しうる量子投票などが登場するだろう．量子インターネットの建設には，量子ビットを直接取り扱うハードウェア部分だけでなく，ソフトウェアの開発も重要となる．経路制御のようなネットワーク管理のソフトウェアだけでなく，量子資源の管理や確保，同期信号の共有など将来的に標準化が必要な技術も多い。量子インターネット建設の機運は各国で活発化しており，山積した技術的課題も徐々に解決されるだろう．日本でも2019年に本研究室も所属する量子インターネットタスクフォース（QITF）が設立された，本研究室はアプリケーション技術の開発や国内テストベッド構築への参画などを通じて，量子インターネットの発展に貢献していくことを目指している．*量子鍵配送ネットワークにおいて，中間ノードを信頼できる場合に安全性が保証される方式．具体的には中継ノードにおいて古典ビット列からなる暗号鍵が生成されており，ここにアクセスされたら安全性が崩れる．量子中継においては、中間ノードが信頼できなくても問題ないという点が異なる．** エンドノード間での量子もつれ共有が量子インターネットの基本機能である．しかし，量子もつれ光子の伝送距離には限界があり，遠距離のエンドノード間では直接共有することができない．そのため，エンドノード間を短距離で区切って中継ノードを設定し，まずはそれらの間で量子もつれ共有を行う．さらに，量子もつれ交換による共有距離の延長や，量子もつれ純粋化による伝送時に低下したもつれ忠実度の回復を行う．これらの手法の繰り返しで長距離もつれ共有を可能にする方式を量子中継と呼び，量子中継器によって実行される．***量子もつれと古典通信を用いて量子状態（量子ビット）を転送する手法． 量子もつれが量子状態の送受信者間で共有されていれば，量子状態を直接通信路に通すことなく転送することができる．****大規模な量子もつれと測定を用いて計算を実行する，測定型量子計算の応用手法．ユーザは簡易な測定デバイスがあれば，量子計算機のホストに計算内容・結果を秘匿したまま量子計算を実行できる．参画中のプロジェクトNEDO「量子・AIハイブリッド技術のサイバー・フィジカル開発事業」における「量子回路分割ライブラリ」（Webpage）2023年度よりPwC社とのアライアンスに基づき共同で研究開発を実施（再委託）．JST ムーンショット型研究開発事業 目標６「2050年までに、経済・産業・安全保障を飛躍的に発展させる誤り耐性型汎用量子コンピュータを実現」における「スケーラブルで強靭な統合的量子通信システム」（Webpage）  2022年度より課題推進者として開発項目「分散量子環境が可能とするネットワーク型量子アプリケーション」を担当．科学研究費補助金 挑戦的研究（萌芽）「量子インターネットアプリケーションのユースケース開拓と必要リソースの定量化」（Webpage）2022年度より研究代表者として実施中．JST「共創の場形成支援プログラム（COI-NEXT）」の政策重点分野（量子技術分野）における「量子ソフトウェアとHPC・シミュレーション技術の共創によるサスティナブルAI研究拠点」（Webpage）2022年度より研究開発課題5 量子HPCに参画中．お問い合わせ研究室: 矢上キャンパス 26棟1階 112BEmail: satoh[at]ics.keio.ac.jpGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2645,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:37"
}