{
  "name": "Takahiro Wada",
  "homepage": "https://sites.google.com/view/humanroboticslab/takahiro-wada?authuser=0",
  "status": "success",
  "content": "Human Robotics Lab - Takahiro WadaSearch this siteEmbedded FilesSkip to main contentSkip to navigation和田隆広，博士（工学），教授Takahiro Wada, Ph.D., Professor[Education]1994, Bachelor of Engineering, Dept. Mechanical Engineering, College of Science and Engineering, Ritsumeikan University1996, Master of Engineering, Dept. or Information Systems, Graduate School of Science and Engineering, Ritsumeikan University1999, Ph.D. in Robotics, Graduate School of Science and Engineering, Ritsumeikan University[Professional experience]1999-2000 Research Associate, Department of Robotics, Ritsumeikan University2000-2003 Assistant Professor, Department of Intelligent Mechanical Systems, Kagawa University2003-2012 Associate Professor, Department of Intelligent Mechanical Systems, Kagawa University2012-2021 Full Professor, College of Information Science and Engineering, Ritsumeikan University (Vice Dean of Graduate Studies and Research, 2018-2019)2021- Full Professor, Nara Institute of Science and Technology[Others]2016-2017 Visiting scholar at University of Michigan, Transportation Research Institute (UMTRI)2012- Visiting Professor, Kagawa University2021- Visiting Professor, Ritsumeikan University2018-2019 Chair of Technical Committee of Shared Control, IEEE Systems, Man, and Cybernetics Society[Publication]<Academic Journal Papers>2021Chenkai Zhang, Yuki Okafuji, and Takahiro Wada, ``Reliability Evaluation of Visualization Performance of Convolutional Neural Network Models for Automated Driving'', International Journal of Automotive Engineering (accepted)Akihito Nagahama, Takahiro Wada, \"Detection of leader-follower combinations frequently observed in mixed traffic with weak lane-discipline\", Physica A; Statistical Mechanics and its Applications, 2021 (accepted)Takahiro Wada, Computational Model of Motion Sickness Describing the Effects of Learning Exogenous Motion Dynamics, Frontiers in Systems Neuroscience, 15, DOI:10.3389/fnsys.2021.634604, 2021尾杉竜正，岡藤勇希，和田隆広，\"深層学習を用いた車両の速度制御に関するドライバの認知特性の解析\", Analysis of Driver's Cognitive Characteristics for Speed Control Using Deep Learning，自動車技術会論文集 (accepted)Akihito Nagahama, Takahiro Saito, Takahiro Wada, Kohei Sonoda, \"Autonomous Driving Learning Preference of Collision Avoidance Maneuvers\", IEEE Transactions on Intelligent Transportation Systems, 2020, DOI:10.1109/TITS.2020.2988303 (online first)2020Akihito Nagahama, Yuki Suehiro, Takahiro Wada, Kohei Sonoda, \"Assistance Method for Merging based on a Probability Regression Model\", IEEE Transactions on Intelligent Transportation Systems, 2020, DOI:10.1109/TITS.2020.2977691 (online first)Masashi Yukawa, Kohei Sonoda, Takahiro Wada, “Auditory Assist Method to Indicate Steering Start Timing in Reverse Parking for Improvement of Driver Performance”, IEEE Transactions on Intelligent Vehicle, Vol.5, No.1, pp.32-40, 2020, DOI: 10.1109/TIV.2019.29553632019長崎，福井，和田，「周波数応答を使った同次有限時間整定制御が持つ対外乱減衰性能の解析」，システム制御情報学会論文誌，vol.32, no.11, pp.408-416, 2019Yuki Suehiro, Takahiro Wada, Kohei Sonoda, “Assistance Method for Merging by Increasing Clarity of Decision Making”, IEEE Transactions on Intelligent Vehicle, Vol.4, No.1, pp.48-58, 2019Takahiro Wada, “Simultaneous Achievement of Driver Assistance and Skill Development in Shared and Cooperative Controls”, Cognition, Technology & Work, Vol.21, No.4, pp.631-642, 20192018Takahiro Wada, Satoru Fujisawa, Shunichi Doi, “Analysis of Driver’s Head Tilt Using a Mathematical Model of Motion Sickness”, International Journal of Industrial Ergonomics, Vol.63, pp.89-97, 2018Takahiro Saito, Takahiro Wada, Kohei Sonoda, “Control Authority Transfer Method for Automated-to-Manual Driving via Shared Authority Mode”, IEEE Transactions on Intelligent Vehicles, Vol.3, No.2, pp.198-207, 20182017Hiroshi Sano, Takahiro Wada, “Knee Motion Generation Method for Transfemoral Prosthesis based on Kinematic Synergy and Inertial Motion”, IEEE Transactions on Neural Systems and Rehabilitation Engineering, Vol.25, No.12, pp. 2387-2397, 2017Kohei Sonoda, Takahiro Wada, “Displaying system situation awareness increases driver trust in automated driving”, IEEE Transactions on Intelligent Vehicles, vol.2, no.3, pp.185-193, 2017-2016Shintaro Tada, Kohei Sonoda, Takahiro Wada, “Simultaneous Achievement of Workload Reduction and Skill Enhancement in Backward Parking by Haptic Guidance”, IEEE Transactions on Intelligent Vehicles, Vol.1, No.4, pp.292 – 301, 2016Takahiro Wada, Keigo Yoshida, “Effect of passengers’ active head tilt and opening/closure of eyes on motion sickness in lateral acceleration environment of cars”, Ergonomics, Vol.59, No.8, pp.1050-1059, 2016Shohei Ueda, Takahiro Wada, “A Haptic Communication Method for A Preceding Vehicle Following System”, International Journal of Automotive Engineering, vol.7, no.3, pp.99-105, 2016Ryota Nishimura, Takahiro Wada, Seiji Sugiyama, “Haptic Shared Control in Steering Operation Based on Cooperative Status Between a Driver and a Driver Assistance System”, Journal of Human-Robot Interaction,4(3), pp.19-37, 2015Takahiro Wada, Hiroyuki Konno, Satoru Fujisawa, Shunichi Doi, “Can Passenger’s Active Head Tilt Decrease The Severity of Carsickness?: Effect of Head Tilt on Severity of Motion Sickness in a Lateral Acceleration Environment”, Human Factors, Vol. 54, No. 2, pp. 226-234, 2012Shigeyoshi Tsutsumi, Takahiro Wada, Shunichi Doi, “A Methodology to Increase Drivers’ Trust on Rear-Obstacle Warning System with Imperfect Sensing Results – Proposal of Warning System using Sensor Reliability Information -”, IATSS Research, Vol. 35, No. 2, pp. 71-78, 2012藤澤智，和田隆広，今野寛之，土居俊一, “ドライバの頭位制御戦略の解析と姿勢制御装置への応用”，計測自動制御学会論文集，Vol. 48, No. 1, pp. 60-66, 2012堤成可，和田隆広，秋田時彦，土居俊一, “センサ信頼度情報に基づく衝突警報システムの信頼感向上手法”, 計測自動制御学会論文集，Vol. 47, No. 11, pp. 557-562, 2011髙原美和，國分三輝，和田隆広，土居俊一, “高齢ドライバーにおける一時停止支援システムの研究”, IATSS Review，Vol. 36, No. 1 pp. 6-13, 2011竹内豊計，和田隆広，向原真斗，土居俊一, “仮想環境を用いた筋電義手訓練システムにおけるタスク難易度調整の効果”，ライフサポート，Vol. 23, No. 3, pp. 101-107, 2011高原美和，國分三輝，武市芳才，和田隆広，土居俊一, “高齢ドライバにおける一時停止標識見落とし要因の検討”，自動車技術会論文集, Vol. 42, No. 2, pp. 625-630, 2011高原美和，國分三輝，武市芳才，和田隆広，土居俊一, “交差点通過時における左右確認行動の齢差”，交通科学, Vol. 41, No. 2, pp. 24-29, 2010Tokihiro Akita, Shigeyoshi Tsutsumi, Takahiro Wada, Shunichi Doi, “Lane Change Assist System Considering Recognition Reliability of Sensor”, Review of Automotive Engineering, Vol. 31, No. Final（雑誌名変更にあたり，最終号がNo.finalと定められた）, pp. 156-162, 2010福家広幸，後藤武志，和田隆広，土居俊一, “ドライバ特性を考慮した緊急時の操舵支援制御の効果に関する研究”，日本機械学会論文集論文集 C編，Vol. 76, No. 770, pp. 2508-2513, 2010堀井泰聡，森川慶祐，和田隆広，土居俊一, “予見時間可変モデルを用いた可変配光前照灯（AFS)制御時の運転行動解析”，自動車技術会論文集，Vol. 41, No. 5, pp. 987-992, 2010和田隆広，藤澤智，今泉克哉，上地徳昌，土居俊一, “ドライバ頭部運動の動揺病抑制効果の解析”，自動車技術会論文集，Vol. 41, No. 5, pp. 999-1004, 2010Takahiro Wada, Shunichi Doi, Naohiko Tsuru, Kazuyoshi Isaji, Hiroshi Kaneko, “Characterization of Expert Drivers’ Last-Second Braking and Its Application to A Collision Avoidance System”, IEEE Transactions on Intelligent Transportation Systems, Vol. 11, No. 2, pp. 413-422, 2010伊佐治和美，津留直彦，和田隆広，土居俊一，金子弘，”接近離間状態評価指標を用いたブレーキ開始タイミングの解析”，自動車技術会論文集，Vol. 41, No. 3, pp. 593-598, 2010和田隆広，吉田誠，土居俊一，堤成可，”衝突リスクと注意配分特性に基づく先急ぎ運転行動の解析”，計測自動制御学会論文集，Vol. 46, No. 5, pp. 289-295, 2010Takahiro Wada, Shoji Hiraoka, Shunichi Doi, “A Control Method of Deceleration Assistance System for Collision Avoidance based on Driver’s Perceptual Risk”, International Journal of Industrial Robot, Vol. 37, No. 4, pp. 347-353, 2010Akihito Nishiyama, Takahiro Wada, Shigeyoshi Tsutsumi, Shunichi Doi, “Proposal of A Warning Method for Rear-Side Obstacles using Drivers’ Perceptual Risk Model”, International Journal of Information Acquisition, Vol. 6, No. 4, pp. 249-256, 2009Yoshinori Kurata, Takahiro Wada, Norimasa Kamiji, Shunichi Doi, “Modeling of Driver Steering Operations in Lateral Wind Disturbances toward Driver Assistance System”, Journal of Mechanical Systems for Transportation and Logistics, Vol. 2, No. 2, pp. 182-191, 2009堀井泰聡，土居俊一，和田隆広，森川慶佑, “可変配光前照灯(AFS)の有効性評価に関する研究”，自動車技術会論文集，Vol. 40, No. 6, pp. 1593-1598, 2009秋田時彦，堤成可，和田隆広，土居俊一, “センサ認識信頼度を考慮した車線変更支援システム”，自動車技術会論文集，Vol. 40, No. 6, pp. 1581-1586, 2009和田隆広，土居俊一，平岡祥史, “接近リスク感覚に基づく追突防止減速制御手法”，自動車技術会論文集，Vol. 40, No. 5, pp. 1375-1380, 2009上地徳昌，丸尾知之，和田隆広，土居俊一, “乗員の動揺知覚特性に基づく車酔いのモデル化に関する研究”，自動車技術会論文集，Vol. 39, No. 2, pp. 381-386, 2008Takahiro Wada, Shunichi Doi, Keisuke Imai, Naohiko Tsuru, Kazuyoshi Isaji, Hiroshi Kaneko, “Analysis of Drivers’ Behaviors in Car Following Based on A Performance Index for Approach and Alienation”, SAE Transactions, Journal of Passenger Cars – Mechanical Systems, SAE paper 2007-01-0440, pp. 306-320, 2008朝尾隆文，和田隆広，土居俊一，塚本一義, “リーチング動作時の運転行動の解析”，自動車技術会論文集，Vol. 38, No. 6, pp. 271-276, 2007田中聡，和田隆広，塚本一義, “仮想環境における異なる歩行パターンの消費カロリー量の決定手法”，日本医科器械学会論文誌，Vol. 77, No. 8, pp. 468-475, 2007田中聡，和田隆広, “ＶＲテニスシステムの運動療法効果の検証”，リハビリテーションエンジニアリング, Vol. 22, No. 3, pp. 163-170, 2007伊佐治和美，津留直彦，和田隆広，今井啓介，土居俊一，金子弘, “前後方向の接近に伴う危険状態評価に関する研究（第１報） －ドライバ操作量に基づく接近離間状態評価指標の提案－”，自動車技術会論文集，Vol. 38, No. 2, pp. 25-30, 2007和田佳郎，山地裕子，和田隆広, “動体視力に対する左右方向の受動的頭部直線運動の効果”，Equilibrium Research, Vol. 65, No. 4, pp. 229-237, 2006假谷明弘，和田隆広，塚本一義, “バーチャルリアリティスノーボードにおけるVR酔いに関する考察”，日本バーチャルリアリティ学会論文誌，Vol. 11，No. 2, pp. 331-338, 2006Takafumi Asao, Takahiro Wada, Shunichi Doi and Kazuyoshi Tsukamoto, , “Influence of Physical Workloads on Driving Performance”, Review of Automotive Engineering, Vol. 27, No. 2, pp. 361-364, 2006吉井暢彦，和田隆広，塚本一義，田中聡, “運動療法に向けたVRスノーボードシステムの開発”，日本バーチャルリアリティ学会論文誌，Vol. 9, No. 4, pp. 397-404, 2004朝尾隆文，石村潤，和田隆広，塚本一義, “会話内容が運転行動に及ぼす影響について”，自動車技術会論文集， Vol. 35, No. 2, pp. 205-210，2004朝尾隆文，上地徳昌，和田隆広，塚本一義，”認知・判断・運動の機能低下とドライバの緊急回避行動の相関”，自動車技術会論文集，Vol. 34, No. 4, pp. 207-212, 2003Takahiro Wada, Brenan J. McCarragher, Hidefumi Wakamatsu, Shinichi Hirai, “Modeling of Shape Bifurcation Phenomena in Manipulations of Deformable String Objects”, International Journal of Advanced Robotics, Vol. 15, No.8, pp. 833-846, 2001和田隆広，平井慎一，川村貞夫, “面状伸縮柔軟物体上の複数点の間接的同時位置決め作業の解析とプランニング”, 日本ロボット学会誌, Vol. 18, No. 5, pp. 675–682, 2000Shinichi Hirai, and Takahiro Wada, “Indirect Simultaneous Positionin",
  "content_length": 14159,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:38"
}