{
  "name": "Takashi Kurimoto",
  "homepage": "https://www.nii.ac.jp/en/faculty/architecture/kurimoto_takashi",
  "status": "success",
  "content": "KURIMOTO Takashi - Information Systems Architecture Science Research Division - Faculty - Research - å½ç«æ å ±å­¦ç ç©¶æ / National Institute of Informatics ACCESS CONTACT æ¥æ¬èª About NII Introduction Greeting from the Director-General Mission & Strategies Overview of NII History Administrative Council Organization Charts Intellectual Properties Staff / Budget Outline and Catalogue of National Institute of Informatics PR Video International Exchange International Exchange based on MOU Conclusion of International Exchange Agreements or MOUs NII International advanced lectures series on ICT NII Shonan Meeting Global Liaison Office (GLO) - DAAD Alumni NII Library NII Library Usage Guide(For General Public) NII Library Accessing databases via GakuNin International Seminar House for Advanced Studies Advanced ICT Center Publications NII Today PR Video Recruitment Access National Institute of Informatics (National Center of Sciences) Kashiwa Annex International Seminar House Contact News Event Link Sitemap Research Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division Information Systems Architecture Science Research Division Digital Content and Media Sciences Research Division Information and Society Research Division Directory of Faculty and Staff index Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education:A New Approach Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports Service Network SINET6 Research Data Cloud GakuNin RDM JAIRO Cloud CiNii Research CiNii Books IRDB Authentication Infrastructure GakuNin eduroam JP UPKI Notice of Authentication Service Maintenance Cloud GakuNin Cloud GakuNin Cloud Adoption Support Service GakuNin Cloud Gateway Service GakuNin Cloud On-Demand Configuration Service SINETStream Information Security NII Security Operation Collaboration Services (NII-SOCS) Princess Rinrin's information security column Scholarly Communication NACSIS-CAT/ILL E-resources Data Sharing Services KAKEN NII-REO Collaboration Collaboration with University Libraries Japan Alliance of University Library Consortia for E-Resources Future Scholarly Information Systems Committee Japan Consortium for Open Access Repository SPARC Japan Research Data Ecosystem Development Project to Promote the Use of AI HPCI mdx Academic Information Infrastructure Open Forum Human Resource Development GakuNin LMS Education and Training Services NII JMOOC | gacco Experts in Information Science Computer Science Park Graduate Program Research Research Faculty Information Systems Architecture Science Research Division KURIMOTO Takashi Information Systems Architecture Science Research Division KURIMOTO Takashi Information Systems Architecture Science Research Division, Professor Research Fields: Network system architecture; Network protocols Degrees: Ph.D. (Engineering) Detail: http://researchmap.jp/tkurimoto/ Introduction Tough, and Flexible--Toward the Ideal Next-Generation Research Network Now I am engaged in the network study area, but I did research on atomic and molecular collisions in my master's degree program at graduate school. I had made various experiments through the research, I started to get the strong feeling that I wanted to do research that would have something to do with product manufacturing and would actually be used out in the world. Network technologies were starting to attract attention around this time. The idea of the broadband network were very exciting and innovative network infrastructure was expected to improve people's life styles. And I thought it would help fulfill my dreams of being able to work while living on some warm southern island. So I set my sights on network research. And I joined NTT and began working at NTT laboratories. This was just after 1990. Making new social environment through Next-Generation Network At NTT's research institute, I worked for research and development of the high-speed, high-capacity and high reliability network system. After that, I moved to NTT's business divisions and I was engaged in deploying the next generation data network which could handle the huge data volumes economically. Based on an overarching vision, we conceived the outline and structure of the next-generation network. The process from conception to realization would take about five years. After it was completed, the network was to be used for a long time. This was challenging and very interesting work. Network development is similar to urban planning. It is started by contemplating the future and asking where and how many roads are required. And just like as it would be hard to redo a road construction, it is hard to redo a deployed network systems. Therefore network systems have to be used for a long time. However users demand will be changed. Thus some areas of network systems have to be modified to accommodate changing demands. So how do we separate the core portion from the flexible portion? This the question was how to separate hardware--which can't be changed easily but is great at large-scale data communications--from software--which has the flexibility to accommodate various new functions, but which isn't so proficient at large-scale data communications. Another was how to meet the diverse requirements of customers for high security, easy handling of large-volume data, minimal delays in monetary transactions, and so on. There was no end to the challenges involved. Pioneering the Future of International Research with NII's SINET What I work on at NII is SINET, an academic network that links universities and research institutions. The network links universities and research institutions and allows them to share experimental data, and data from research institutions is forwarded to universities for analysis--the network is used in various ways. At particle research facilities like KAMIOKANDE and for a radio telescope astronomy project that involves researchers from several countries, dozens to hundreds of gigabytes of data have to be transferred within a second. There's no way to do this without a network capable of sending and receiving large volumes of data at high speed. The people and institutions connected to the network aren't limited to Japan. With the new SINET set to launch in 2016, virtual intra-research-project networks between, for example, Japan, the US, and Germany, can be created whenever they're needed, and we can also embed systems that enable data transfers on demand requirements and functions that enable this across multiple countries. I think this will prove beneficial for international experimental research. Up to this point, my research and development activities have involved practical applications. Networks are next to useless if they are not used. I listen to what people need and develop things to meet those needs. I think it's great when those things are put into an application for a useful purpose. Of course, we also need to carefully consider cost and feasibility issues, but I hope to be able to continue doing practical research to meet everyone's increasingly sophisticated needs and, ultimately, to create things that can be used. PDF Download Article researched and organized by Yoshiko Miwa View research contents with researchmap ãã¤ã¼ã Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division FUJII Kaito HIRAHARA Shuichi KAWARABAYASHI Ken-ichi KOBAYASHI Taisuke KUROIWA Ryo MATSUMOTO Keiji SATO Ryoma SHIGAKI Shunsuke SOEDA Akihito SUGIYAMA Mahito TAKEDA Hideaki TATSUTA Makoto UNO Takeaki WATANABE Kazuki WELLNITZ Philip YOSHIDA Yuichi Information Systems Architecture Science Research Division AIDA Kento AOKI Shunsuke FUJIWARA Ikki FUKUDA Kensuke GOSHIMA Masahiro HASUO Ichiro ISHIKAWA Fuyuki JI Yusheng KANEKO Megumi KATO Hiroyuki KITAGAWA Naoya KOIBUCHI Michihiro KURIMOTO Takashi SAKANE Eisaku SATO Hiroyuki SEKIYAMA Taro SHIMIZU Sayako TAKAKURA Hiroki TAKEFUSA Atsuko Digital Content and Media Sciences Research Division AIZAWA Akiko ANDRES Frederic ASANO Yuta HUANG Lang IKEHATA Satoshi KANAZAWA Teruhito KATAYAMA Norio ",
  "content_length": 11389,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:39"
}