{
  "name": "Taku Hachisu",
  "homepage": "http://hachisu.net/en/profile",
  "status": "success",
  "content": "Profile | Taku Hachisu Skip to the content Skip to the Navigation Taku Hachisu (蜂須 拓, born 1987) is a Japanese computer scientist. He is an assistant professor at the Institute of Systems and Information Engineering, the University of Tsukuba. He received his PhD (Eng) at the University of Electro-Communications in 2015. Google Scholar researchmap Hachisu is taking a exciting bite of meat Experience INRIA Oct. 2010 – Dec. 2010 at Rennes, France Visiting student Bunraku team Advisor: Dr. Anatole Lécuyer，Associate Professor Maud Marchal，Mr. Gabriel Cirio Scholarship for Internship: Institutional Program for Young Researcher Overseas Visits by JSPS. Japan Society for the Promotion of Science (JSPS) Apr. 2012 – Mar. 2015 at Japan Research Fellow (DC1) Microsoft Research May 2013 – Nov. 2013 at Beijing, China Internship fellow Human-Computer Interaction group Advisor: Dr. Masaaki Fukumoto Aug. 2015 at Beijing, China Visiting PD fellow Advisor: Dr. Masaaki Fukumoto University of California, Santa Barbara Jan. 2019 – Dec. 2019 at Santa Barbara, California, USA Visiting Scholar RE Touch Lab Advisor: Assistant Professor Yon Visell University of Tsukuba Apr. 2015 – Dec. 2019 at Ibaraki, Japan Researcher Faculty of Engineering, Information and Systems JST CREST Project “Social Imaging” Principle Investigator: Professor Kenji Suzuki Jan. 2020 – present at Ibaraki, Japan Assistant Professor Department of Intelligent Interaction Technologies, Institute of Systems and Information Engineering Education University of Electro-Communications Apr. 2006 – Mar. 2010 in Tokyo, Japan Bachelor (Eng.) Supervisor: Associate Professor Hiroyuki Kajimoto Apr. 2010 – Mar. 2012 in Tokyo, Japan Master (Eng.) Supervisor: Associate Professor Hiroyuki Kajimoto Apr. 2012 – Mar. 2015 in Tokyo, Japan Ph.D. (Eng.) Supervisor: Associate Professor Hiroyuki Kajimoto Thesis Title: Exaggeration-Based Haptic Interaction (in Japanese) Committee Associate Professor Hiroyuki Kajimoto Professor Masakatsu Kaneko Professor Naoaki Itakura Associate Professor Maki Sakamoto Associate Professor Takuya Nojima Publications（Five selected papers） Taku Hachisu, Kenji Suzuki: Representing Interpersonal Touch Directions by Tactile Apparent Motion using Smart Bracelets, IEEE Transactions on Haptics, vol. 12, no. 3, pp. 327-338, 2019. Taku Hachisu, Baptiste Bourreau, Kenji Suzuki: EnhancedTouchX: Smart Bracelets for Augmenting Interpersonal Touch Interactions, in Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI) 2019, 321, Glasgow, UK, May 4-9, 2019. Taku Hachisu, Yadong Pan, Soichiro Matsuda, Baptiste Bourreau, Kenji Suzuki: FaceLooks: a Smart Headband for Signaling Face-to-Face Behavior, MDPI Sensors, vol. 18, no. 7, 2066, 2018. Taku Hachisu, Masaaki Fukumoto: SpiroSurface: A Repulsive and Attractive Force Display for Interactive Tabletops Using a Pneumatic System, IEEE Computer Graphics and Applications, vol. 38, no. 4, pp. 54-70, 2018. Taku Hachisu, Hiroyuki Kajimoto: Vibration Feedback Latency Affects Material Perception during Rod Tapping Interactions, IEEE Transactions on Haptics, vol. 10, issue 2, pp. 288-295, 2017. More… Invited Talks and Misc. Wearable Devices for Augmenting Interpersonal Touch Interactions, Summer School on HAPCOR, Technische Universität Dresden, Germany, Sep. 7, 2023. Introduction to Haptics- sensing, feedback, and sensory evaluation, The SICE Annual Conference (SICE) 2019, Hiroshima, Japan, Sep. 10, 2019. Introduction to Haptics- sensing, feedback, and sensory evaluation, IEEE International Conference on Systems, Man, and Cybernetics (SMC) 2018, Miyazaki, Japan, Oct. 7, 2018. Whole-body Wearable Haptics for Navigation and Immersive Contents, IEEE Haptics Symposium2014 Workshop Wearable Haptics: from Neurophysiology Foundations to New Wearable Haptic Designs and Exoskeletons, Texas, USA, Feb. 23, 2014. Who? Research Contact Links bu-ta MENU",
  "content_length": 3911,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:42"
}