{
  "name": "Tal Malkin",
  "homepage": "http://www.cs.columbia.edu/~tal",
  "status": "success",
  "content": "Tal Malkin's Home Page Tal Malkin Professor Department of Computer Science Columbia University Office: 514 CSB 500 West 120th Street New York, NY 10027 Email: firstname@cs.columbia.edu Crypto Lab Research Teaching Professional Activities Students & Visitors Biography Research I am a cryptography researcher. Much of my work is on the foundations of cryptography, and as such I fit right in with our Theory Group. I also work on practical aspects and applications of cryptography, and am a member of our Systems Security Center. Additionally, I'm interested in connections between cryptography and other areas such as complexity theory, information theory, and machine learning. Example areas I've worked on include secure computation, private search, non-malleable codes, leakage and tamper resilient cryptography, and strong public key encryption. The webpage for my group, the Crypto Lab, has our publications, as well as the latest news from my group, including new papers in preprint form. You can also check out my dblp and Google Scholar pages, or find my older papers (up to 2011) here. If you want to work with me, please start by reading my information for prospective students and visitors. Teaching Spring 2020: COMS E6261 Advanced Cryptography: Information Theoretic Cryptography. Past classes at Columbia: Introduction to Cryptography (COMS W4261) (most recently, Fall 19) Computer Science Theory (COMS W3261) (most recently, Spring 18) Advanced Cryptography (COMS E6261): Spring 16: Minimalist Cryptography Spring 13: Homomorphic Encryption and Lattices Spring 10: Data Privacy Spring 08: The Black-Box Complexity of Cryptographic Primitives Spring 04: Secure Multiparty Computation (Some) Professional Activities Program Committee chair: Crypto 2021 (co-chair), CCS 2017 (co-chair), TCC 2016A (co-chair), ACNS 2015, CT-RSA 2008 Steering Committee member: Theory of Crytpography Conference (TCC) 2017-current, DIMACS/Simons Special Focus on Cryptography 2015-2017, Cryptographers' Track at the RSA Conference (CT-RSA) 2009-2011 General Chair and Local Arrangements: Real World Crypto 2020, Real World Crypto 2017, PKC 2006 (general co-chair) Program Committee member: FOCS 2020, Eurocrypt 2020, TCC 2018, Eurocrypt 2017, CCS 2016, ITCS 2015, Crypto 2012, TCC 2012, Financial Cryptography 2012, CCS 2010, FOCS 2010, PETS 2010, SCN 2010, CT-RSA 2010, PETS 2009, Crypto 2008, Crypto 2006, STOC 2006, TCC 2006, Crypto 2005, USENIX Security 2005, TCC 2005, CT-RSA 2005, WOLFASI 2004, Crypto 2004, STOC 2004, PKC 2003, SAC 2002 Other events I am/was involved in organizing (open attendance to all interested): New York Area Theory Day, New York City Crypto Day, Columbia Theory Seminar. Past events include DIMACS Workshop on Complexity of Cryptographic Primitives and Assumptions in June 2017, and DIMACS/Columbia DSI Workshop on Cryptography for Big Data in December 2015. Students and Visitors Current PhD Students: Marshall Ball Chengyu Lin Negev Shekhel Nosatzki (co-advised with Alex Andoni) Current Visitors: Eran Tromer, research scientist (and a prof at Tel Aviv University) Graduated PhD Students: Ghada Almashaqbeh, PhD 2019 (co-advised with Allison Bishop) Thesis: CacheCash: A Cryptocurrency-based Decentralized Content Delivery Network Lucas Kowalczyk, PhD 2019 (co-advised with Allison Bishop) Thesis: Attribute-Based Encryption for Boolean Formulas George Argyros, PhD 2019 (co-advised with Angelos Keromytis) Thesis: Symbolic Model Learning: New Algorithms and Applications Fernando Krell, PhD 2016 Thesis: Secure Computation Towards Practical Applications Igor Carboni Oliveira, PhD 2015 (co-advised with Rocco Servedio) Thesis: Unconditional Lower Bounds in Complexity Theory Mariana Raykova, PhD 2012 (co-advised with Steven Bellovin) Thesis: Secure Computation for Heterogeneous Environments: How to Bring Multiparty Computation Closer to Practice? Dana Dachman-Soled, PhD 2011. Thesis: On the Black-Box Complexity of Basic Cryptographic Primitives and On Adaptive UC-Security Seung Geol Choi, PhD 2010 (co-advised with Moti Yung) Thesis: On Adaptive Security and Round Efficiency in Secure Multi-Party Computation Andrew Wan, PhD 2010 (co-advised with Rocco Servedio) Thesis: Learning, Cryptography, and the Average Case Homin Lee, PhD 2009 (co-advised with Rocco Servedio) Thesis: Complexity Measures and Computational Learning Theory Ariel Elbaz, PhD 2009 Thesis: Round-Efficient Secure Computation, and Applications Past Postdocs and Visitors: Fabrice Benhamouda Hoeteck Wee Ben Fisch Seung Geol Choi Kwangsu Lee Wesley George Dov Gordon Yevgeniy Vahlis Geetha Jagannathan Isamu Teranishi Francois-Xavier Standaert Benoit Libert Satoshi Obana Past MS theses supervised: Ryan Moriarty, MS 2005 Devang Thakkar, MS 2004 I've also supervised research projects of many other talented Columbia students: Alex Lamy, Lali Devadas, Alex Nicita, Seungwook Han, Abhishek Shah, Daniel Jaroslawicz, Hsin Pei Toh, Benjamin Kuykendall, Jiahui Liu, Aubrey Alston, Kailash Meiyappan, Hosanna Fuller, Yi-Hsiu Chen, Steven Goldfeder, Zachary Newman, Christian Moscardi, Krzysztof Choromanski, Noah Youngs, Rajesh Venkataraman, Catherine Lennon, Matthew Raibert, Nikolai Yakovenko, Marzia Niccolai, Noel Codella, Bhargav Bhatt, George Philip Atzemoglou. Do you want to work with me? Biography Tal Malkin is a professor of Computer Science at Columbia University, where she directs the Cryptography Lab, and was the inaugural chair of the Cybersecurity Center at the Data Science Institute. She holds a BS in Math and Computer Science from Bar-Ilan University, an MS in Computer Science from the Weizmann Institute of Science, and a PhD in Computer Science from the Massachusetts Institute of Technology. Prior to joining Columbia, she worked as a research scientist at AT&T Labs Research. She has chaired the CRYPTO, CCS, TCC, ACNS, and CT-RSA conferences, chairs the Theory of Cryptography Conference streering committee, and has served on the program and steering committees for many other leading conferences on cryptography, theoretical computer science, and security. She is an IACR fellow, the recipient of the NSF CAREER Award, and faculty awards from JP Morgan, IBM, and Google, in addition to the Avanessians Diversity Award from the Fu Foundation School of Engineering and Applied Science, and the Presidential Teaching Award at Columbia University. Tal Malkin is married to Erich Nahum and they have two children. Last update: June 2019.",
  "content_length": 6462,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:44"
}