{
  "name": "Tal Rabin",
  "homepage": "https://en.wikipedia.org/wiki/Tal_Rabin",
  "status": "success",
  "content": "Tal Rabin - Wikipedia Jump to content From Wikipedia, the free encyclopedia American cryptographer Tal Rabinטל רביןTal RabinBorn1962 (age 62–63)Newton, Massachusetts, United StatesAlma materHebrew University of JerusalemAwardsAmerican Academy of Arts and Sciences (2016) Woman of Vision (2014)Scientific careerFieldsComputer scienceInstitutionsUniversity of Pennsylvania, Thomas J. Watson Research CenterThesis Fault Tolerant and Secure Computations in Distributed Systems[1]  (1995)Doctoral advisorMichael Ben-Or Tal Rabin (Hebrew: טל רבין; born 1962) is a computer scientist and Professor of Computer and Information Science at the University of Pennsylvania and a Director at Amazon Web Services (AWS). She was previously the head of research at the Algorand Foundation and the head of the cryptography research group at IBM's Thomas J. Watson Research Center. Biography[edit] Rabin was born in Massachusetts and grew up in Jerusalem, Israel. As a child, she enjoyed solving riddles and playing strategic games.[2] Her father, Michael Rabin, is a celebrated computer scientist who is responsible for many breakthroughs in the fields of computability and cryptography. She and her father have co-authored a paper together.[3] She is the mother of two daughters. Career[edit] In 1986, she received her BSc from the Hebrew University of Jerusalem. She continued her studies there for her MSc (1988) and PhD (1994) degrees under the supervision of Professor Michael Ben-Or. Between 1994 and 1996, she was an National Science Foundation postdoctoral fellow at MIT. She later joined the cryptography group at the Thomas J. Watson Research Center and became head of the group in 1997.[4] In 2020, she joined the University of Pennsylvania as the Rachleff Family Professor of Computer and Information Science.[5] Rabin's research focuses on cryptography and network security, specifically the design of efficient and secure encryption algorithms. In addition, she studies secure distributed protocols and the theoretical foundations of cryptography, as well as number theory and the theory of algorithms and distributed systems. She has co-authored over 100 papers. She has also registered five patents in the US.[6] Her research focuses on making communications over the Internet more secure. Her most cited works in this field focus on the design of digital signature schemes, which are widely used, among other applications, in protocols for secure web communication. Another focus is on a different scheme of encrypted communications called secret sharing. A sizable part of her work on these subjects is done in collaboration with Rosario Gennaro and Hugo Krawczyk.[7] Rabin has been on the committees of many leading cryptography conferences, including TCC, Crypto, PKC and Eurocrypt.[8] She was a council member of the Computing Community Consortium (2013–2016),[9] a member of the executive committee of SIGACT (2012–2015),[10] and a member of the editorial board of the Journal of Cryptology.[11] She is a founder and organizer of the Women in Theory Workshop, a biennial event for graduate students in theoretical computer science.[12] She is also involved in activities to make the field of encryption more accessible to the general public. In 2011, she took part in the World Science Festival, a popular science event held in New York City.[13] In 2014, she took part in a similar event, the WNYC Science Fair.[14] Awards[edit] 2014: One of the 22 most powerful women engineers in the world by Business Insider[15] 2014: Woman of Vision for innovation by the Anita Borg Institute[16] 2015: IACR Fellow (International Association for Cryptologic Research)[17] 2016: Fellow of the American Academy of Arts and Sciences[18] 2017: ACM Fellow[19] 2018: One of America's Top 50 Women In Tech by Forbes[20] 2019: The RSA Award for Excellence in Mathematics[21] 2023: The Dijkstra Prize for work in secure multiparty computation (MPC)[22] References[edit] ^ Tal Rabin at the Mathematics Genealogy Project ^ Gina Kolata (6 June 2011). \"Women Atop Their Fields Dissect the Scientific Life\". The New York Times. ^ Gennaro, Rosario; Rabin, Michael O.; Rabin, Tal (1 January 1998). \"Simplified VSS and fast-track multiparty computations with applications to threshold cryptography\". Proceedings of the seventeenth annual ACM symposium on Principles of distributed computing - PODC '98. New York: ACM. pp. 101–111. CiteSeerX 10.1.1.27.3164. doi:10.1145/277697.277716. ISBN 978-0897919777. S2CID 6981623. ^ \"Tal Rabin, IBM cryptographer\". The Valentina Project. 9 June 2014. Retrieved 10 August 2014. ^ \"Tal Rabin, Professor of Computer and Information Science\". ^ \"Tal Rabin - Patents and Patent Applications\". IBM Research. 25 July 2016. ^ \"Tal Rabin\". Google Scholar. ^ \"Tal Rabin\". International Association for Cryptologic Research. ^ \"CCC Council\". Computing Community Consortium. ^ \"ACM SIGACT: People\". www.sigact.org. Archived from the original on 27 July 2014. Retrieved 8 September 2014. ^ \"Journal of Cryptology - Editors\". Springer. Archived from the original on 15 September 2010. ^ \"WIT 2022\". Women in Theory. ^ \"Tal Rabin\". World Science Festival. ^ \"Science Fair: The Codebreakers\". The Greene Space. Archived from the original on 25 January 2014. ^ Julie Bort (9 July 2014). \"22 Of The Most Powerful Women Engineers In The World\". Business Insider. ^ \"The Anita Borg Institute Recognizes Three Leading Women Technologists With 2014 Women of Vision ABIE Awards\". MarketWatch (Press release). Anita Borg Institute. Archived from the original on 1 September 2013 – via Market Watch. ^ \"IACR Fellows\". International Association for Cryptologic Research. Retrieved 7 June 2016. ^ \"Newly Elected Members\". American Academy of Arts and Sciences. April 2016. Retrieved 20 April 2016. ^ \"ACM Recognizes 2017 Fellows for Making Transformative Contributions and Advancing Technology in the Digital Age\" (Press release). Association for Computing Machiner. 11 December 2017. Retrieved 13 November 2017. ^ \"Tal Rabin\". Forbes. ^ \"RSA Conference 2019 Announces Recipient of Annual Award for Excellence in the Field of Mathematics\" (Press release). RSA Conference. Retrieved 5 March 2019.[dead link] ^ Larry Hardesty (8 February 2024). \"Amazon's Tal Rabin wins Dijkstra Prize in Distributed Computing\". Amazon science. Retrieved 6 March 2024. External links[edit] Tal Rabin's homepage Archived 19 September 2014 at the Wayback Machine, on the IBM research website A blog post about Tal Rabin in the blog A Smarter Planet a TEDx talk given by Tal Rabin ABIE Women of Vision Award Acceptance Speech Authority control databases InternationalISNIVIAFWorldCatNationalUnited StatesCzech RepublicNetherlandsIsraelAcademicsMathematics Genealogy ProjectAssociation for Computing MachineryScopuszbMATHGoogle ScholarDBLPMathSciNetOtherIdRefYale LUX Retrieved from \"https://en.wikipedia.org/w/index.php?title=Tal_Rabin&oldid=1319938093\" Categories: Living peopleHebrew University of Jerusalem School of Computer Science & Engineering alumniIsraeli women computer scientistsIsraeli computer scientistsIsraeli cryptographersModern cryptographersFellows of the American Academy of Arts and Sciences2017 fellows of the Association for Computing MachineryIBM Research computer scientists1962 birthsUniversity of Pennsylvania Department of Computer and Information Science facultyHidden categories: All articles with dead external linksArticles with dead external links from September 2023Articles with short descriptionShort description is different from WikidataUse dmy dates from August 2016Articles with hCardsArticles containing Hebrew-language textWebarchive template wayback links Search Search Tal Rabin 5 languages Add topic",
  "content_length": 7711,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:43"
}