{
  "name": "Talal Rahwan",
  "homepage": "https://www.trahwan.com",
  "status": "success",
  "content": "Research | Talal Rahwan top of page Talal RahwanWelcome to my webpage. I am an Associate Professor of Computer Science, and Director of the Data Science and AI Lab at New York University Abu Dhabi. I received my Ph.D. in Computer Science in 2007 from the University of Southampton in the UK. My research interests include: Artificial Intelligence, Data Science, and Computational Social Science. Click here to view my CV.Selected publications Y Duan, S Memon, B AlShebli, Q Guan, P Holme, T Rahwan (2025). “Postdoc publications and citations link to academic retention and faculty success.” PNAS (Proceedings of the National Academy of Sciences). Media coverage: Nature, Times Higher Education, The Scientist, Phys.org, Inside Higher Ed, Wonkhe, Physics World, The Transmitter, American Physical Society. ​​​ F Liu, T Rahwan, B AlShebli (2023). \"Non-White scientists appear on fewer editorial boards, spend more time under review, and receive fewer citations.\" PNAS (Proceedings of the National Academy of Sciences). Media coverage: University World News, Nature, Physics World, EurekAlert!, Phys.org, Science & Development Network, American Physical Society. ​​​ F Liu, P Holme, M Chiesa, B AlShebli, T Rahwan (2023). \"Gender inequality and self-publication are common among academic editors.\" Nature Human Behaviour. Media coverage: Nature; Times Higher Education; Nature Middle East; University World News; Khaleej Times; Nature News and Views; EurekAlert; New Scientist. ​ M Chaqfeh, B AlShebli, MF Zaffar, T Rahwan, Y Zaki (2023). \"Towards a World Wide Web without digital inequality.\" PNAS (Proceedings of the National Academy of Sciences). Media coverage: Nature Middle East.​ ​ H Ibrahim, F Liu, T Rahwan, Y Zaki and colleagues (2023). \"Perception, Performance, and Detectability of Conversational Artificial Intelligence Across 32 University Courses.\" Scientific Reports. Media coverage: Scientific American, The Times, The Independent, Nature Asia, Daily Mail, GovTech, New Scientist, The Daily Beast, EurekAlert!, Phys.org, The National, Neuroscience News, Nature Middle East.​​ ​ K Makovi, A Sargsyan, W Li, J Bonnefon, T Rahwan (2023). \"Trust within human-machine collectives depends on the perceived consensus about cooperative norms.\" Nature Communications. Media coverage: PsyPost.org ​ ​F Ishowo-Oloko, J Bonnefon, Z Soroye, J Crandall, I Rahwan, T Rahwan (2019). \"Behavioural Evidence for a Transparency-Efficiency Tradeoff in Human-Machine Cooperation.\" Nature Machine Intelligence. Media coverage: Boston Globe, Nature Middle East, WIRED, Psychology Today, New Statesman, Khaleej Times, Scientific American. ​ B AlShebli, T Rahwan, W Woon (2018). \"The Preeminence of Ethnic Diversity in Scientific Collaborations\". Nature Communications. Media coverage: Nature News, Physics World. ​​​​ M Waniek, T Michalak, M Wooldridge, T Rahwan (2018). \"Hiding Individuals and Communities in a Social Network.\" Nature Human Behaviour. Media: Vice's Motherboard, Polish Ministry of Higher Education​ ​​Awards & media coveragePostdoctoral success Our paper analyzing postdoctoral success was published in PNAS and received media coverage from numerous outlets worldwide, including Nature, Times Higher Education, The Scientist, Phys.org, Inside Higher Ed, Wonkhe, Physics World, The Transmitter, and American Physical Society. Citation manipulation We went under cover, contacted a \"citation boosting service\", and managed to buy citations that appeared in a Scopus-Indexed journal. Our sting operation provided conclusive evidence that citations can be bought in bulk. The findings were covered by Nature (here) and by Science (here and here). See the paper for details. Recognition at IC2S2 I was invited as a keynote speaker at IC2S2 (the International Conference on Computational Social Science). We received the Best Parallel Talk award for our paper evaluating ChatGPT on university-level homework. We also received the Best Poster award for our paper examining the dominance of Big Tech companies. Racial disparity in academia Our paper \"Non-White scientists appear on fewer editorial boards, spend more time under review, and receive fewer citations\" was published in PNAS, receiving media coverage from Nature, EurekAlert!, Phys.org, Physics World, University World News, Science and Development Network, and American Physical Society. Gender inequality among editors Our paper \"Gender inequality and self-publication are common among academic editors\" showed that women are underrepresented on editorial boards. The paper appeared in Nature Human Behaviour and received media coverage from several outlets: Nature, Times Higher Education, Nature Middle East, University World News, Khaleej Times, Nature News & Views, EurekAlert!, New Scientist. Homework using ChatGPT Our paper \"Perception, Performance, and Detectability of Conversational Artificial Intelligence Across 32 University Courses\" evaluated ChatGPT's ability to solve homework assignment. It was covered by news outlets worldwide: Scientific American, The Times, The Independent, Nature Asia, Government Tech, Daily Mail, The Daily Beast, New Scientist, EurekAlert!, Phys.org, The National, Neuroscience News, Nature Middle East. Bias in YouTube's recommendation algorithm Our paper \"YouTube’s recommendation algorithm is left-leaning in the United States\" revealed a political bias in YouTube's algorithm. The paper was published in PNAS Nexus, and received media coverage from Daily Caller, American Council on Science and Health, The College Fix, PsyPost.​​ Weaponizing disinformation Our paper, titled \"How weaponizing disinformation can bring down a city's power grid\" showed that disinformation can be weaponized to bring down a city's power grid. The study was covered by Science Alert and Fast Company. In a follow-up study titled Traffic Networks are Vulnerable to Disinformation Attacks, in Scientific Reports, we showed that traffic jams can be created using fake news. The paper was cited by the Executive Office of the President of the United States. A year after publishing our findings, the attack we predicted actually happened in Russia; see Cyber News. Transparency in human-bot interaction Our paper, titled \"Behavioural Evidence for a Transparency-Efficiency Tradeoff in Human-Machine Cooperation\" showed that people cooperate more with machines that pretend to be human. The paper made the cover of the November issue of Nature Machine Intelligence. Selected media coverage: Boston Globe, Nature Middle East, New Statesman, Psychology Today, WIRED, Scientific American. Ethnic diversity & scientific collaboration Our paper \"The preeminence of ethnic diversity in scientific collaboration\" in Nature Communications studied various forms of diversity in academic collaborations and found that ethnic diversity predicts scientific impact. The paper was covered by Physics World, and the pre-print version was covered in a News feature by Nature. Hiding in social networks Our paper, Hiding Individuals and Communities in a Social Network, published in Nature Human Behaviour, was covered by Vice's Motherboard and by the Polish Ministry of Higher Education. Our follow-up study, titled \"How to Hide One’s Relationships from Link Prediction Algorithms\" (published in Scientific Reports) was covered by El País. AI's 10 to watch I was selected by IEEE Computer Society as one of AI's 10 to Watch. The list is published every two years by IEEE Intelligent Systems in recognition of the 10 most promising, young Artificial Intelligence (AI) researchers in the world. Meet the teamHere are the talented researchers whom I am proud to call my team:Marcin Waniek Postdoctoral Associate. Works on identifying ways in which private information can be hidden from attribute inference algorithms. His work got published in Nature Human Behaviour and Scientific Reports; see Marcin's webpage.Balaraju Battu Postdoctoral Associate. Interested in human machine interaction in the context of social and ethical dilemmas. His work got published in Scientific Reports and in Royal Society Open Access. See Balaraju's Google Scholar profile.Sid Benabderrahmane Postdoctoral Associate. Examines social phenomena through the lens of Machine Learning and Data Mining. See Sid's Google Scholar profile.Fengyuan (Michael) Liu PhD student: Studies scientific collaborations an journal editors. His work got published in PNAS and Nature Human BehaviourLab alumniHere are the talented researchers and students whom I was fortunate enough to work with as part of my lab. Bedoor AlShebli Previously a postdoc in my lab, now an Assistant Prof. at NYU Abu Dhabi. She published in Nature Communications, PNAS, and Science Advances; see Bedoor's webpage.Mayada Oudah Following her PhD under my supervision, Mayada joined New York University Abu Dhabi as a Postdoctoral Associate. Her work on Human-Bot interaction got published in Nature Communications.Maria Sahakyan Formerly a postdoc at my lab, now a Postdoctoral Associate at New York University Abu Dhabi. Her research falls at the intersection of Explainable AI and Computational Social Science.Russell Coke After working as a research engineer in my lab, Russell joined the Computer Networks Lab at New York University Abu Dhabi. His work focused on improving web-access for users in developing regions.bottom of page",
  "content_length": 9340,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:44"
}