{
  "name": "Talia Ringer",
  "homepage": "https://dependenttyp.es",
  "status": "success",
  "content": "Talia Ringer About How can we build a world in which programmers of all skill levels across all domains can prove the absence of costly or dangerous bugs in software systems---that is, formally verify them? I am an Assistant Professor with the PL/FM/SE group at Illinois, and I like to build proof engineering technologies to make that world a reality. In so doing, I love to use the whole toolbox---everything from dependent type theory to program transformations to neural proof synthesis---all in service of real humans. Next Asterisks next to names indicate shared first, last, or corresponding authorship. Jilin Hu, Jianyu Zhang, Yongwang Zhao*, and Talia Ringer*. HybridProver: Augmenting Theorem Proving with LLM-Driven Proof Synthesis and Refinement. Under Submission. Talia Ringer. Mathematicians put AI model AlphaProof to the test (News & Views). Nature (Nov 2025). Saketh Ram Kasibatla, Arpan Agarwal, Yuriy Brun, Sorin Lerner, Talia Ringer, and Emily First. Cobblestone: Iterative Automation for Formal Verification. ICSE 2026. Cosmo Viola, Max Fan, and Talia Ringer. Proof Repair across Quotient Type Equivalences. OOPSLA 2025. Borhane Blili-Hamelin, Christopher Graziul, Leif Hancox-Li, Hananel Hazan, El-Mahdi El-Mhamdi, Avijit Ghosh, Katherine Heller, Jacob Metcalf, Fabricio Murai, Eryk Salvaggio, Andrew Smart, Todd Snider, Mariame Tighanimine, Talia Ringer*, Margaret Mitchell*, and Shiri Dori-Hacohen*. Stop Treating ‘AGI’ as the North-Star Goal of AI Research. ICML 2025 (Position Track). Alex Sanchez-Stern, Abhishek Varghese, Zhanna Kaufman, Dylan Zhang, Talia Ringer, and Yuriy Brun. QEDCartographer: Automating Formal Verification Using Reward-Free Reinforcement Learning. ICSE 2025. Talia Ringer. Proofs and Conversations (Early Career). Notices of the American Mathematical Society 71, 9 (Oct 2024). Audrey Seo*, Chris Lam*, Dan Grossman, and Talia Ringer. Correctly Compiling Proofs About Programs Without Proving Compilers Correct. ITP 2024. Dylan Zhang, Curt Tigges, Zory Zhang, Stella Biderman, Maxim Raginsky, and Talia Ringer. Transformer-Based Models Are Not Yet Perfect At Learning to Emulate Structural Recursion. TMLR 2024. (2023 short whitepaper version here.) Tom Reichel and Talia Ringer. ProofDB: A Prototype Natural Language Coq Search Engine. AITP 2024. Dylan Zhang, Emily First, and Talia Ringer. Getting More out of Large Language Models for Proofs. AITP 2023. Emily First, Markus Rabe, Talia Ringer, and Yuriy Brun. Baldur: Whole-Proof Generation and Repair with Large Language Models. ESEC/FSE 2023. Distinguished Paper Award. Tom Reichel, R. Wesley Henderson, Andrew Touchet, Andrew Gardner*, and Talia Ringer*. Proof Repair Infrastructure for Supervised Models: Building a Large Proof Repair Dataset. ITP 2023. Alex Sanchez-Stern*, Emily First*, Timothy Zhou, Zhanna Kaufman, Yuriy Brun, and Talia Ringer. Passport: Improving Automated Formal Verification Using Identifiers. TOPLAS Volume 45, Issue 2: No. 12, pp 1-30. Presented at PLDI 2023. Tool repository. Arpan Agrawal, Emily First, Zhanna Kaufman, Tom Reichel, Shizhuo Zhang, Timothy Zhou, Alex Sanchez-Stern, Talia Ringer, and Yuriy Brun. Proofster: Automated Formal Verification. ICSE 2023 (Demo Track). Demo video, tool website. Hannah Leung, Talia Ringer, and Chris Fletcher. Towards Formally Verified Path ORAM in Coq. CoqPL 2023. Emily Ruppel*, Sihang Liu*, Elba Garza, Sukyoung Ryu, Alexandra Silva, and Talia Ringer. Long-Term Mentoring for Computer Science Researchers. Communications of the ACM (CACM): Volume 66: No. 5, pp 33-35. May 2023. Seth Poulsen, Matthew West, and Talia Ringer. Autogenerating Natural Language Proofs for Proof Education. The Coq Workshop 2022. Talia Ringer. Proof Repair. Ph.D. Thesis, University of Washington, 2021. Defense video. Talia Ringer, RanDair Porter, Nathaniel Yazdani, John Leo, and Dan Grossman. Proof Repair across Type Equivalences. PLDI 2021. Talk video. Talia Ringer, Alex Sanchez-Stern, Dan Grossman, and Sorin Lerner. REPLICA: REPL Instrumentation for Coq Analysis. CPP 2020. Talk video. Talia Ringer, Karl Palmskog, Ilya Sergey, Milos Gligoric and Zachary Tatlock. QED at Large: A Survey of Engineering of Formally Verified Software, Foundations and Trends® in Programming Languages: Vol. 5: No. 2-3, pp 102-281. 2019. Errata, Q & A. Talia Ringer, Nathaniel Yazdani, John Leo, and Dan Grossman. Ornaments for Proof Reuse in Coq. ITP 2019. Talk Video. Talia Ringer, Nathaniel Yazdani, John Leo, and Dan Grossman. Adapting Proof Automation to Adapt Proofs. CPP 2018. Talk video. Talia Ringer, Dan Grossman, Daniel Schwartz-Narbonne, and Serdar Tasiran. A Solver-Aided Language for Test Input Generation. OOPSLA 2017. Talk video. Talia Ringer, Dan Grossman, and Franziska Roesner. AUDACIOUS: User-Driven Access Control with Unmodified Operating Systems. CCS 2016. Talk video. Next My current research emphasis is on how to use proof assistants to empower correct collaboration at scale, targeting both mathematicians and engineers. Some common themes: Proof Repair: How can we extend proof repair to make it more powerful and practical, so that it reaches proof engineers of all levels of expertise, across many different domains? I have several collaborations exploring this question, with techniques ranging from dependent type theory and proof term transformations to machine learning. Machine Learning for Proofs: What can machine learning do for proof engineers, and how can this advance the state of the art in machine learning? What would it take to make machine learning tools for proofs much more practical---to infer and apply deep semantic relations, and to handle the tasks most difficult for proof engineers? How can we use machine learning to help people not just prove, but also specify what they want to prove to begin with? This is an exciting and hot topic I'm having a lot of fun exploring with many collaborators. Proof Engineering: How can we advance the state of the art in proof engineering, and use it to drive the development of large, secure, and robust verified software and hardware systems? I have several collaborations exploring new domains and new kinds of proof engineering, looking at everything from compilation of proofs to verification of critical security properties of computer architectures. Next I lead the Illinois Theorem Provers (ITP) lab (huge credit to Yao Li for the name), part of the PL/FM/SE group. Current members: Cosmo Viola (Ph.D.), Chris Lam (Ph.D.), Hannah Leung (Ph.D., coadvised with Christopher Fletcher), Trey Plante (Ph.D.), Eric Paul (Ph.D.), Jamie Fulford (Ph.D.), Jasper Lee (Ph.D.), Kevin Fisher (Ph.D.), Evan Marzion (researcher), and Priyam Sahoo (masters student). Past members: Kiran Gopinathan (postdoc, 2024-2025), Arpan Agrawal (visiting research programmer, 2022-2024), Jilin Hu (visiting Ph.D., 2024-2025), Dylan Zhang (Ph.D., coadvised with Maxim Raginsky, 2022-2024), Thomas Reichel (masters student, class of 2024), Eeshan Zele (undergraduate), Eyad Loutfi (undergraduate), Max Fan (undergraduate, class of 2024, now at Cornell), Sankar Gopalkrishna (undergraduate), Timothy Zhou (undergraduate, class of 2024, now at UCSD), and Zory Zhang (undergraduate). We also welcome folks at Illinois who are super interested in proof assistants to hang out and come to lab events, chat in our Discord, and so on---let me know if this is you! While at UW, I advised two amazing undergraduates on their own projects: Jasper Hugunin and Taylor Blau. I also mentored two fantastic students on projects related to my thesis work: RanDair Porter and Nate Yazdani. Those experiences really inspired me to become faculty! Next Interested in doing research with me? Undergraduate Students: Please get in touch! We have many Ph.D. students who may be interested in mentoring you on projects. Everyone Else: My lab is really big right now, so I am not recruiting new Ph.D. students this upcoming cycle. Depending on funding, I may have a postdoc position available at some point, but this is up in the air right now. If you aren't in a hurry, though, feel free to reach out! Next I am the founder and president of the Computing Connections Fellowship, a fellowship that provides institution-independent transitional funding for computer science PhD students who need help escaping unhealthy environments. We are in the process of a two year pilot in the programming languages research community. I am also the founder and previous chair of the SIGPLAN Long-Term Mentoring Committee (SIGPLAN-M). SIGPLAN-M pairs mentors and mentees in the programming languages research community for cross-institutional mentoring relationships lasting a year by default. It currently reaches more than 200 mentors and more than 300 mentees across more than 44 countries, and has been described by mentees as \"life changing\" and \"a career saver.\" I do a lot of other leadership in the international programming languages community, as well as more traditional service. Service is a core important part of my career since it is so much bigger than my own research. My service work was formally recognized when I received the 2023 ACM SIGPLAN Distinguished Service Award. Please see my CV for more details. Next I am currently teaching a seminar on formal mathematics. Next semester, I plan to teach a course on building your own proof assistant from scratch! In Spring 2022, I taught my new course on proof automation. I taught it again in Fall 2022. In Fall 2023, I taught CS 421 (undergraduate programming languages)! In Spring 2024, I taught a dependent type theory reading group. Next My daughter takes up most of my time these days. She is amazing and I love her more than anything ever. I used to run competitively for Club Northwest, and I also used to play Judo (hopefully one day again). I have a preference for they/them pronouns, but any pronouns are OK. I am openly bisexual, and always happy to talk to LGBTQ students. I was the writer and interviewer behind The Identity Function, a blog ",
  "content_length": 10629,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:44"
}