{
  "name": "Tamara Munzner",
  "homepage": "https://www.cs.ubc.ca/~tmm",
  "status": "success",
  "content": "Tamara Munzner, UBC Home Page Tamara Munzner InfoVis Group DFP: Designing for People CAIDA: Centre for Artificial Intelligence Decision-making and Action DSI: Data Science Institute Professor Department of Computer Science, University of British Columbia Imager Graphics, Visualization and HCI Lab Email: tmm (at) cs.ubc.ca, Phone: 604-827-5200, Fax: 604-822-5485, Twitter: @tamaramunzner, Mastodon: @tamara@cosocial.ca Snailmail: 201-2366 Main Mall, Vancouver, BC, V6T 1Z4, Canada Office: X661, in X-Wing extension behind ICICS/CS building Office Hours: after class in IBLC 261 (Tue 5pm), or by appointment in X661 or Zoom (email me) Calendar: My potential availability (aka maybe/no or free/busy) calendar LinkedIn: LinkedIn Scholar: Google Scholar Other pages: VAD Book | Blog | Publications | Talks | Software | Videos | CV | Bio Jump to: Research | Teaching | Students | Books | Press | More Information Research My research interests include the development, evaluation, and characterization of visualization systems and techniques from both user-driven and technique-driven perspectives. See the Publications page for papers about recent projects. Teaching Undergrad CPSC 447, Intro to Visualization: current Jan 2025, old Sep 2023, Jan 2023; old number 436V: Jan 2022, Jan 2021, Jan 2020. CPSC 314, Computer Graphics: Jan 2016, Jan 2013, Jan 2010, Jan 2008, Jan 2007, May 2005, Jan 2005; old number 414: Sep 2003 CPSC 213, Intro to Computer Systems: Sep 2012, Jan 2012, Sep 2010 CPSC 111, Intro to Computation: Jan 2010, Jan 2006 Grad CPSC 547, Information Visualization: Sep 2025, Sep 2022, Sep 2021, Sep 2020, Sep 2019, Sep 2017, Jan 2017, Sep 2015, Sep 2014; old number 533C: Sep 2011, Sep 2009, Sep 2007, Sep 2006, Sep 2005, Sep 2004, Jan 2004, Jan 2003 MDS/DSCI 531, Data Visualization I, Nov 2016 MDS/DSCI 532, Data Visualization II, Jan 2018, Mar 2017 JRNL 520M, Special Topics Visualization for Journalists: Sep 2016, Sep 2015 Stanford University CS448B: Special Topics Visualization: Apr 2002 General Writing Pet Peeves: Correctness, References, and Style Cheating: The List Of Things I Never Want To Hear Again Current Students PhD Steve Kasica Francis Nguyen Mara Solen Ryan Smith Matt Oddo Former Students Postdoc Charles Berret, 2021-2022, then postdoc at Linkoping University Jürgen Bernard, 2019-2020, then Assistant Professor at University of Zurich Michelle Borkin, 2014-2015, then Assistant/Associate Professor at Northeastern Stephen Ingram, 2013-2014, then startup Coho Data, then RISC Networks Michael Sedlmair, 2010-2012, then Assistant Professor University of Vienna, then Associate Professor Jacobs, then Professor at Stuttgart Miriah Meyer, at Harvard co-supervised by Hanspeter Pfister, 2008-2011, then Assistant/Associate Professor at University of Utah, then Professor at Linkoping Melanie Tory, co-supervised by Kelly Booth, 2004-2006, then Assistant/Associate Professor at University of Victoria, then Tableau Research, then Director of the Northeastern Roux Institute PhD Zipeng Liu 2015-2021, graduated 2021, then Assistant Prof at Beihang thesis: Visualizing Multi-Level Structures in Data Michael Oppermann 2016-2021, graduated 2021, then at Virtual Identity, then at Austrian Institute of Technology thesis: Data-Driven Prototyping in Information Visualization Anamaria Crisan co-supervised by Jennifer Gardy, 2015-2019, graduated 2019, then Tableau Research, then Assistant Prof at Waterloo thesis: Visualizing Heterogeneous Data in Genomic Epidemiology Georges Hattab, 2016-2017 visiting from Bielefeld, supervised by Tim Nattkemper, graduated 2018 Matt Brehmer co-supervised by Joanna McGrenere, 2011-2016, graduated 2016, then Microsoft Research postdoc, then Tableau Research, then Assistant Prof at Waterloo thesis: Why Visualization? Task Abstraction for Analysis and Design Stephen Ingram 2007-2013, graduated 2013, then postdoc thesis: Practical Considerations for Dimensionality Reduction: User Guidance, Costly Distances, and Document Data Penny McLachlan 2006-2009, then at Mobify (as co-founder), then at Google Daniel Archambault co-supervised by David Auber (LaBRI, Universite de Bordeaux I), 2004-2008, graduated 2008, then postdoc at Bordeaux/INRIA and Dublin, then lecturer at Swansea, now Professor at Newcastle. thesis: Feature-Based Graph Visualization Heidi Lam 2004-2008, graduated 2008, then at Google, then Tableau Research, then Google thesis: Visual exploratory analysis of large data sets: evaluation and application James Slack 2005-2008, then Affordable Affiliates, then Oracle MSc Kimberly Dextras-Romagnino 2015-2018, graduated 2018, now at Kabam. thesis: Segmentifier: Interactively Refining Clickstream Data into Actionable Segments Dylan (Wenqiang) Dong 2015-2017, graduated 2017, then at The Sky Guys. Johanna Fulda visiting student from Andreas Butz's group in Munich, 2014-2015, graduated 2015, then at Cumul8, then at Clir. thesis: TimeLineCurator: Interactive Authoring of Visual Timelines from Unstructured Text Jessica Dawson co-supervised by Joanna McGrenere, 2011-2013, graduated 2013, then UBC CS lecturer, then UBC med school thesis: A Search Set Model of Path Tracing In Graphs Joel Ferstay co-supervised by Cydney Nielsen, 2012-2013, graduated 2013, then at AeroInfo thesis: Variant View: Visualizing Sequence Variants in their Gene Context Aaron Barsky 2006-2008, graduated 2008, then at BC Cancer Agency, then Hemisphere Games, then LionsGate, then Aimsio, now at Rivian thesis: Cerebral: Visualizing Multiple Experimental Conditions on a Graph with Biological Context Stephen Ingram co-supervised by Marc Olano, 2006-2007, graduated 2007, then PhD thesis: Multilevel Multidimensional Scaling on the GPU Penny McLachlan2005-2006, graduated 2006, then UBC CS PhD student, then at Mobify, then at Google thesis: LiveRAC - Live Reorderable Accordion Drawing Qiang Kong co-supervised by Raymond Ng, 2004-2006, graduated 2006, then at Electronic Arts, then Microsoft thesis: Visual Mining of Powersets with Large Alphabets Dmitry Nekrasovski co-supervised by Joanna McGrenere, 2004-2005, graduated 2005, then at IBM Burnaby, then at Elastic Path, then at OpenText, now at Atlas thesis: A Comparison of Pan and Zoom and Rubber-Sheet Navigation Adam Bodnar co-supervised by Joanna McGrenere, 2004-2005, graduated 2005, then Oculus, then Infor, then Black Coral, now ESRI thesis: An Evaluation of Overviews for Large Tree Navigation James Slack 2003-2005, graduated 2005 thesis: A Partitioned Rendering Infrastructure for Stable Accordion Navigation Kristian Hildebrand co-supervised by Bernd Fröhlich, visiting student 2003-2004, graduated 2005 from Bauhaus University, Weimar/Berlin, then PhD student at TU Berlin, then prof at Beuth Univ. Applied Sci. Matt Williams 2003-2004, graduated 2004, then at Vancouver public schools thesis: QuestVis and MDSteer: The Visualization of High-Dimensional Sustainability Data Dale Beermann co-supervised by Greg Humphreys, 2003-2004, graduated 2004 from University of Virginia, then at Emageon, then at Imago, then at Sharendipity, then at StudyBlue thesis: Scalable, Robust Visualization of Very Large Trees Undergrad Sam Fraser, fall 2022 - spring 2023, graduated 2023, then Datadog. Directed studies project. OpenRefine Edris Wu. spring 2022, graduated 2022, then CreateApe. COGS directed studies project. The Development of Plover: Visualizing Language Level Provenance Shabab Khan. summer 2021, graduated 2021. Summer co-op project: Visicorn Mara Solen, 2020-2021, graduated 2021, then PhD Directed studies project: VIVA. Luce Liu, spring 2021, graduated 2021, then Mark43 COGS directed studies project: TimeElide: Visual Analysis of Non-Contiguous Time Series Slices. Jude Shamsi, spring 2021, then Tesla. Directed studies project: Visicorn Shannah Fisher, summer 2019, then USask Directed studies project: MinCombinR Yann Dubois, summer 2017, graduated 2017, then at Grab, then grad school at Cambridge Parmida Esmaeilpour, directed studies 2016, graduated 2016, then in UBC Political Science MSc program Jessica Dawson, co-supervised by Joanna McGrenere, 2009-2011, graduated 2011, then MSc Anton Zoubarev, directed studies 2009-2010 survey paper: Tools for visual analysis of biological networks Ciarán Llachlan Leavitt, part-time 2004-2008, graduated 2011, then Slant Six Games, now Richmond County Literacy Network Alex Vostrov, co-supervised with Ken Elwood, honors thesis 2005-2006, graduated 2006 thesis: EqkVis: Visualization For Earthquake Simulation Data David Westrom, summer and directed studies 2004-2005, graduated 2005, then at Electronic Arts, then Zynga, then Massdrop Janek Klawe, summer and honours thesis 2003-2004, graduated 2004, then Princeton thesis: Compression for Power Set Visualization using Accordion Drawing Keith Lau, co-supervised by Ron Rensink, summer and honours thesis 2003-2004, graduated 2004, then MS from Cornell, then at Bloomberg thesis: Perceptual Invariance of Nonlinear Focus+Context Transformations Jordan Lee, co-op 2003-2004, graduated 2004, then at Electronic Arts Dragana Radulovic, co-op 2003-2004, graduated 2004, then at Joule, then Tatara, then Smith Micro, then Trader Jeffrey Zhihui Zhang, co-op 2003-2004, graduated 2006, then at Business Objects Prospective Students If you are interested in working with me as a graduate student at UBC, please see my directions on how to apply. Jim Whitehead has some excellent advice for contacting faculty. Although some of his points are specific to UCSC (the differential cost of foreign and native students, the exact details of how to apply), most of the rest is very valid. I have written down some policies of how I run my group. Books GoodReads profile GoodReads, books read, ordered chronologically, covers view GoodReads, books read, ordered chronologically, table view with per-book ratings GoodReads, favorites (5-star ratings), ordered alphabetically List of Books Read, Chronological List of Books Read, By Author, with some per-author blurbs I read way too ",
  "content_length": 13526,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:51"
}