{
  "name": "Tamal K. Dey",
  "homepage": "https://www.cs.purdue.edu/homes/tamaldey",
  "status": "success",
  "content": "Tamal K. Dey's Home Page Tamal Krishna Dey (Curriculum  Vitae) Professor (Fellow ACM,  Fellow IEEE, Fellow SMA) I am looking for motivated PhD students to work in Computational Topology, Topological Data Analysis If you are interested, drop a note at my Purdue email Department of Computer Science Courtesy Appointment: Department of Mathemtics Purdue University e-mail: tamaldey at purdue.edu Previous affiliation (1999-2020) Department of Computer Science and Engineering The Ohio State University 1. A Book on Curve and Surface Reconstruction : Algorithms with Mathematical Analysis Tamal. K. Dey Published by Cambridge University Press, October 2006 Preface and contents Two chapters 2. A Book on Delaunay Mesh Generation Siu-Wing Cheng, Tamal K. Dey, Jonathan R. Shewchuk Published by CRC Press, December 2012 See Details including sample chapters 3. A Book on Computational Topology for Data Analysis Tamal K. Dey, Yusu WangPublished by Cambridge University Press, 2022 A free electronic copy available here Education Post Doctorate U. of Illinois, U-C 1991-1992 PhD Purdue University 1988-1991 M.E. IISC, Bangalore 1985-1987 B.E. Jadavpur University, Calcutta 1981-1985 Research I lead the Computational Geometry and Topology for Data Analysis (CGTDA) research group at Purdue I belong to Theory, Graphics, and ML groups at Purdue I belonged to Theory, Graphics, and TGDA (topology, geometry, data analysis) groups at OSU Personnel Projects Software Current Shreyas Samaga, PhD Gilberto Gonzalez, PhD Andrew Haas, PhD Shubhankar Varshney, PhD Maxim Lavrenko, MS Past Simon Zhang, Phd, Post-doc, CSE, Ohio State U. Soham Mukherjee Phd, Candence Cheng Xin, Phd, Post-doc, CS, Rutgers U. Tao Hou, Phd, Asst. Prof. U. Oregon Ryan Slechta, Phd, U.Michigan. Tianqi Li, Phd, Linkedin Sayan Mandal, Phd Jiayuan Wang, Phd Alfred Rossi, Phd, post-docMickael Buchet, post-doc, currently at Tohoku Univ., Japan Abhishek Rathod, post-doc Ramsay Dyer, post-doc, currently at INRIA,France Hyuckje Woo, Post-doc, Prof. KINST, Korea Joachim Giesen, Post-doc, Prof. U. Jena, GermanyDayu Shi, Phd, Google Lei Wang, Phd, Google Andrew Slatton, Phd Fengtao Fan, Phd, Google Oleksiy Busaryev, PhD, Google Kuiyu Li, PhD, post-doc at Texas A&M Pawas Ranjan, PhD Joshua Levine, PhD, post-doc at U. Utah, Prof. U. of Arizona Jian Sun, PhD, post-doc at Stanford and Princeton, Prof. Tsinghua U., China Tathagata Ray, PhD, Prof. BITS, Pilani,India Samrat Goswami, PhD, post-doc at UT-Austin Wulue Zhao, PhD James Hudson, PhD, Prof. at Swansee U. Naveen Leekha, Masters, NVIDA Luke Molnar, Masters Computational Geometry and Topology in Geometric Modeling and Graphics Reconstruction Curve reconstruction Surface reconstruction Non-smooth, non-manifold surface reconstruction Boundary reconstruction Meshing Polyhedra Smooth surface Remeshing Isosurface Piecewise smooth complexes Localized Delaunay refinement Homology features Handle and tunnel loops Shortest homology bassis Optimal homologous cycles Shape features Medial axis Curve skeletons Dimension detection Shape segmentation and matching Normal and feature approximation Data sparsification Graph Induced complex Simplification Computational and combinatorial geometry Computational topology (NSF report) TDA software TDA-Jyamiti Github contains recent TDA software FastZigzag : Software for computing zigzag persistence based on paper GRIL : Software for computing vectorization for 2-parameter persistence modules for ML applications based on paper SimBa software (computes persistence of Rips filtration efficiently) Reconstruction Cocone: Software for surface reconstruction based on paper. AMLS software for noisy point cloud smoothing based on paper. SingularCocone software for reconstructing surfaces with singular features Peel software for reconstructing surfaces with boundaries based on paper Meshing DelPSC: software for Delaunay meshing of surfaces, volumes, complexes based on paper, talk slides, [video] LocPSC: Localized version of DelPSC, runs faster. based on paper. Qualmesh: Software for quality Delaunay meshing of polyhedra based on paper. SurfRemesh: software for Delaunay meshing of polygonal surfaces based on paper. DelIso: software for Delaunay meshing of isosurfaces LocDel software for generating large Delaunay meshes Homology Features HanTun software for computing handle and tunnel loops on surfaces based on paper [video] ReebHanTun software for handle and tunnel loops that does not require 3D tessellation, paper, web-page ShortLoop software for computing loops in a shortest homology basis based on paper.PersLoop software for persistent  1-cycles Data Sparsification GIC software SimpPers software (computes persistence for simplicial maps) SimBa software (computes persistence of Rips filtration efficiently) Shape features Medial: Software for 3D medial axis based on paper SegMatch: Software for shape segmentation and shape matching based on paper NormFet software for normal and feature size estimation from point cloud based on paper. CurveSkel software for curve skeleton of 3D shapes based on paper. Gathan software for curve reconstruction based on paper. Nearest neighbor curve reconstruction Applet based on paper and a topology clean up. Publications For book chapters and papers visit  Publications Teaching Purdue courses: Introduction to Analysis of Algorithms, CS 381 (Fall 2025) Foundations of Computing: CS182 (Fall 2022) Algorithm Design, Analysis, and Implementation: CS580 (Spring 2022, Fall 2023, Spring 2025) Topological Data Analysis : CS 59000-TDA (Spring 2021, 2023) Computational Geometry: CS53100 (Spring 2023, Fall 2024) OSU courses: Data Structure & Algorithms (CSE 2331) (Au 15) Algorithms (6331) (Au 12) Advanced Algorithms (6332) (Spring 19) Computational Topology and Data Analysis (5339) (Au 13) (5559) (Sp 17) Geometric Modeling (5543) (Sp18) Shape Modeling in graphics and visualization (Sp00) Subdivision surfaces (888) (Wi00) Formal Languages and Automata Theory (Wi '09) Sample Based Modeling for Graphics and Visualization (Au05) Professional Activities Program Committee Member Invited Talks Other Activities STOC 2024 SoCG 2012  , SoCG 2019, 2024 NASAGEM 07 ISAAC 06 Pacific Graphics 06 SPM 04 05 06 07 08 09 10 1112 13, 14, 15, 17 SMI 04 05 06   07 08 09 10 11 12 13,14,15, 17 Point Graphics 04 05 06 07 08 3DPVT 04 , 08 SOCG 98 03 Solid Modeling 03 SODA 03 , 14, FSTTCS 95, 96, 97, 03 WALCOM 09 SGP 09,10, 11, 12, 13, 14 15, 16, 17 ISVD 09, 13 GMP 10 12 SoCG Video 10 TopoInfoVis 11 CAD graphics 2011 EuroCG 2013 SWAT 2014 BIRS workshop Cycle Representatives in Homological Algebra, 2025 Combinatorial Topological Dynamics, Krakow, Poland, 2025 Applied Topology in Poznan, 2025 AMS meeting, Applied and Computational Topology, 2024 Frontiers of Geometric Algorithms, IISC, Bangalore, India, 2024 Combinatorial topological non-linear dynamics, CRM, U. Montreal, 2024 Combinatorial topological dynamics, ICIAM 2023, Japan Metrics in Multiparameter Persistence, Lorentz Center, 2021 Multiparameter persistent homology,  BIRS-CMO, Mexico, August, 2018. Computational Topology and Data Analysis, Intensive Research Program in Discrete, Combinatorial and Computational Geometry, CRM, Spain, 2018A tool for approximating the persisitence of Rips filtrations efficiently, SoCG workshop on Compu. Topo, 2016   [talk slides] Multiscale Mapper, ACAT workshop, IST-Austria, 2015, [talk slides] Computational topology in reconstruction, mesh generation, and data analysis, Keynote in Canad. Conf. Computational Geometry, 2014 [talk slides] Computing persistence for simplicial maps with application to data sparsification, IMA workshop on Topology and Geomtry of Networks and Discrete Metric Spaces, 2014, [talk slides] Graph Induced Complex, IMA workshop on Modern application of homology and Cohomology, 2013 [talk slides] Better handles and tunnels, workshop  on geometric computing, SoCG 2013[talk slides] Delaunay mesh generations, workshop on mesh generation, SoCG 2013 [talk slides] Delaunay mesh generation, Oberwolfach workshop on Triangulations, 2012 [talk slides] Computing homology cycles with certified geometry, Computational Topology workshop, Fields Institute, 2011, and Institute of Advanced Studies, Princeton, 2012[talk slides] Computational geometry and topology meet geometric modeling, SIAM-GD 2011, [talk slides] Delaunay refinement and its localization for meshing, IMR 2011 [talk slides] Geometry and topology from point cloud data, WALCOM 2011 [talk slides] Computing homology cycles with certified geometry, Workshop on Geometric Computing, IIT Delhi, Nov. 2010[talk slides] Convergence, stability, and approximation of Laplace spectra, Discrete Differential Geometry workshop, U. Tennessee, May 10 Cut locus and topology from point data, BIRS workshop on data analysis, March 09 Lifting the curse of slivers from surface reconstruction (Video), BIRS workshop on Computational Mathematics on Discrete Surfaces, February 09 Computing handles and tunnels in 3D models, Colloquium, WUSTL, February 08 [talk slide] Geometric and topological approaches to data analysis , October, 2007 [talk slide]. GeoTopAl 2007 ISAAC 2006 Tessellations in the Sciences, Lorentz Center, Lieden Univ., March 2006 15th Fall workshop on Computational Geometry, 2005 Othmer Institute seminar, 2005 ALGO2002 ECG Final Workshop 03 DIMACS workshop on Surface Reconstruction DIMACS workshop on computer aided design and manufacturing Conference on Algebraic Topological Methods in Computer Science Department of Mathematics Stanford University July 30 - August 3, 2001 Colloquiam Department of Computer Science Univ. of Notre Dame September, 2004 Workshop on Algorithm Engineering as a New Paradigm Oct 30 - Nov 2, 2000 RIMS, Kyoto University, Kyoto, Japan Solid Modeling Technology and Applications, SME Detroit, MI Nov. 16-17,  2000 Organizer, ComPer2024 ComPer2023, 2022, 2021 Co-Chair, SoCG 2012 Editorial Board Discrete & Comput. Geom Computational Geometry Theory & Applications Past Jo",
  "content_length": 11151,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:46"
}