{
  "name": "Tamara Silbergleit Lehman",
  "homepage": "https://experts.colorado.edu/display/fisid_165649",
  "status": "success",
  "content": "Lehman, Tamara Silbergleit | CU Experts | CU Boulder Close Contact Info Email Curriculum Vitae Webpage LinkedIn Publications in VIVO Co-author Network Map of Science Research Areas Computer Architecture Computer Operating Systems Computer Systems Analysis Computer/Data/Network Security Data Analysis Democracy Distributed Systems Research research overview With the emergence of public cloud computing and the internet of things, modern computer architectures are inadequate to address the security and privacy concerns of users. In this work, we look for innovative solutions to secure the computer from the hardware up. By designing the computer architecture with security as a number one priority, along with performance, we can provide additional guarantees about the security and privacy of data. In addition we look to reinforce the public' resilience to polluted information considering that social media has now taken on a new role with respect to democracy around the world. keywords Hardware security, computer architecture security, computer performance analysis, simulation technologies, Democracy and technology, social media data analysis Publications selected publications chapter Understanding How Readers Determine the Legitimacy of Online Medical News Articles in the Era of Fake News 2022 conference proceeding A Midsummer Night's Tree: Efficient and High Performance Secure SCM. 22-37. 2024 SpecCheck: A Tool for Systematic Identification of Vulnerable Transient Execution in gem5. Parallel Architectures and Compilation Techniques - Conference Proceedings, PACT. 265-278. 2023 Eliminating Micro-Architectural Side-Channel Attacks using Near Memory Processing. 179-189. 2022 Acuerdo: Fast Atomic Broadcast over RDMA. Proceedings of the International Conference on Parallel Processing. 2022 Analyzing behavioral changes of Twitter users after exposure to misinformation. 591-598. 2021 A New Foe in GPUs: Power Side-Channel Attacks on Neural Network. Proceedings - International Symposium on Quality Electronic Design, ISQED. 313-313. 2021 Understanding How Readers Determine the Legitimacy of Online News Articles in the Era of Fake NewsY. 768-775. 2020 Classifying and Mitigating Side-Channel Vulnerabilities between VMs 2019 MAPS: Understanding Metadata Access Patterns in Secure Memory. 33-43. 2018 PoisonIvy: Safe Speculation for Secure Memory. Micro -Annual Workshop then Annual International Symposium-. 2016 journal article A Survey of Hardware-Based AES SBoxes: Area, Performance, and Security. ACM Computing Surveys. 2025 Baobab Merkle Tree for Efficient Secure Memory. IEEE Computer Architecture Letters. 33-36. 2024 Do Twitter users change their behavior after exposure to misinformation? An in-depth analysis. Social Network Analysis and Mining. 2022 Analyzing Twitter Users' Behavior Before and After Contact by the Russia's Internet Research Agency. Proceedings of the ACM on Human-Computer Interaction. 1-24. 2021 scholarly edition Design Strategies for Efficient and Secure Memory 2019 Teaching courses taught CSCI 3593 - Computer Organization Primary Instructor - Fall 2023 / Fall 2024 Studies computer design at the microarchitecture level. Discusses instruction set architecture design, arithmetic and logic unit design, control logic, memory design and caches, simple pipelining, I/O and peripheral devices. Briefly covers aspects of modern computer architecture, such as multicore processors and hardware security. Same as ECEN 3593. Degree credit not granted for this course and ECEN 5590. CSCI 4593 - Computer Organization Primary Instructor - Fall 2021 / Fall 2022 Studies computer design at the microarchitecture level. Discusses instruction set architecture design, arithmetic and logic unit design, control logic, memory design and caches, simple pipelining, I/O and peripheral devices. Briefly covers aspects of modern computer architecture, such as multicore processors and hardware security. Formerly ECEN 4593. CSCI 4950 - Senior Thesis Primary Instructor - Fall 2021 / Spring 2022 Provides an opportunity for senior computer science majors to conduct exploratory research in computer science as an option for the capstone requirement. Department enforced prerequisites: 35 hours of Computer Science coursework including Foundation courses, Upper-Division writing, CS GPA 3.0. Department consent required, contact academic advisor for details. May be repeated up to 8 total credit hours. CSCI 5593 - Advanced Computer Architecture Primary Instructor - Spring 2023 / Spring 2024 Provides a broad-scope treatment of important concepts in the design and implementation of high-performance computer systems. Discusses important issues in the pipelining of a processor, out-of-order instruction issue and superscalar designs, design of cache memory systems and architectural features required for multicore processor designs. Also studies current and historically important computer architectures, including hardware security concepts. Recommended prerequisite: CSCI 4593 or instructor consent required. Same as ECEN 5593 and ECEN 4693. CSCI 6950 - Master's Thesis Primary Instructor - Fall 2022 / Spring 2023 ECEN 1100 - Exploring ECE Primary Instructor - Fall 2023 Introduces students to areas of emphasis with the ECE department through seminars presented by faculty and outside speakers. Emphasizes career opportunities, professional ethics and practices, history of the profession, and resources for academic success. Several sessions promote team building and problem solving, and provide opportunities for first year students to meet their classmates. ECEN 3593 - Computer Organization Primary Instructor - Fall 2020 / Fall 2021 / Fall 2022 / Fall 2023 / Fall 2024 Studies computer design at the microarchitecture level. Discusses instruction set architecture design, arithmetic and logic unit design, control logic, memory design and caches, simple pipelining, I/O and peripheral devices. Briefly covers aspects of modern computer architecture, such as multicore processors and hardware security. Same as CSCI 3593. Degree credit not granted for this course and ECEN 5590. ECEN 4013 - Special Topics Primary Instructor - Spring 2022 Examines a special topic in Electrical, Computer and Energy Engineering. May be repeated up to 9 total credit hours. ECEN 4693 - Advanced Computer Architecture Primary Instructor - Spring 2023 / Spring 2024 Provides a broad-scope treatment of important concepts in the design and implementation of high-performance computer systems. Discusses important issues in the pipelining of a processor, out-of-order instruction issue and superscalar designs, design of cache memory systems for such systems, and architectural features required for multicore processor designs. Also studies current and historically important computer architectures. Recommended prerequisite: knowledge of C/C++ and Assembly programming languages, and computer organization and experience using a Linux system for programming and its associated capabilities of compilation and debugging. Same as ECEN 5593 and CSCI 5593. ECEN 5033 - Special Topics Primary Instructor - Fall 2019 Examines a special topic in Electrical, Computer and Energy Engineering. May be repeated up to 9 total credit hours. ECEN 5593 - Advanced Computer Architecture Primary Instructor - Spring 2021 / Spring 2022 / Spring 2023 / Spring 2024 Provides a broad-scope treatment of important concepts in the design and implementation of high-performance computer systems. Discusses important issues in the pipelining of a processor, out-of-order instruction issue and superscalar designs, design of cache memory systems and architectural features required for multicore processor designs. Also studies current and historically important computer architectures, including hardware security concepts. Recommended prerequisite: ECEN 3593, ECEN 5090. Same as CSCI 5593 and ECEN 4693. ECEN 5793 - Secure Computer Architecture Primary Instructor - Fall 2022 Explore cutting-edge secure architectures that look to protect the system from the hardware up. This course covers advanced topics in security with an emphasis on computer architecture on both the attack and defense sides. Discussion oriented classes will deepen understanding of weekly technical reading assignments, enhance the ability to analyze technical papers, and help carry out a semester long research project. Background education and training Ph.D., Duke University 2019 M.Eng., Duke University 2013 B.S., University of Florida 2007 awards and honors Faculty Early Career Development Program (CAREER), conferred by National Science Foundation, 2025 International Activities geographic focus Argentina  Country Spain  Country Other Profiles Github https://github.com/tamisil",
  "content_length": 8764,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:51"
}