{
  "name": "Tamar Shinar",
  "homepage": "http://www.cs.ucr.edu/~shinar",
  "status": "success",
  "content": "Tamar Shinar Tamar Shinar Associate Professor Computer Science & Engineering Department Interdisciplinary Center for Quantitative Modeling in Biology University of California - Riverside Riverside, CA 92521 shinar@cs.ucr.edu Curriculum Vitae Research My research interests include physics-based animation, fluid-structure interaction, and modeling and simulation of the mechanics of biological cells. Courses SIGGRAPH 2019 Physics-based animation (with A. Bargteil) SIGGRAPH 2018 Physics-based animation (with A. Bargteil) Videos Neural network-based surfacing of particle simulation data (with C. Zhao, and C. Schroeder) An extended partitioned method for conservative solid-fluid coupling (with M. Akbay, N. Nobles, and V. Zordan) Emergent phenomena in micro-macro models of microtubule gliding assays (with C. Hohenegger, and S. Cook) Microtubule-based motion in the single-celled C. elegans embryo (with M. Mana, F. Piano, and M. Shelley) Stokes flow in a complex geometry coupled to dynamic rigid structures and filaments (with M. Shelley) Deformable creatures with articulated, actuated rigid skeletons (with C. Schroeder and R. Fedkiw) Full two-way coupling of rigid and deformable bodies (with C. Schroeder and R. Fedkiw) Two-way coupling of fluids to rigid and deformable solids and shells (with A. Robinson-Mosher, J. Gretarsson, J. Su, and R. Fedkiw) Hybrid simulation of deformable solids (with E. Sifakis, G. Irving, and R. Fedkiw) Wrinkled flames and cellular patterns (with J.-M. Hong and R. Fedkiw) Multiple interacting liquids (with F. Losasso, A. Selle, and R. Fedkiw) Publications Full, current publication list can be found on my google scholar page. Zhao, C., Shinar T., and Schroeder, C. Reconstruction of implicit surfaces from fluid particles using convolutional neural networks, Symposium on Computer Animation, 2024. Goulding, J., Shinar, T., and Schroeder, C. Conservative, bounded, and nonlinear discretization of the Cahn-Hilliard-Navier-Stokes equations, submitted. Goulding, J., Ayazi, M., Shinar, T., and Schroeder, C. Simplified conservative discretization of the Cahn-Hilliard-Navier-Stokes equations, 2023, submitted. Chowdhury, R. R., Shinar T., and Schroeder, C. Higher order divergence-free and curl-free interpolation on MAC grids, 2024, Journal of Computational Physics 503, 112831. Schroeder, C., Chowdhury, R. R., and Shinar T. Local divergence-free polynomial interpolation on MAC grids, Journal of Computational Physics 468, 111500, 2022 Cook, S., and Shinar, T. Enabling simulation of high-dimensional micro-macro biophysical models through hybrid cpu and multi-gpu parallelism, Concurrency and Computation: Practice and Experience 33 (17), 2021 Akbay, M., Schroeder, C., and Shinar T. Boundary pressure projection for partitioned solution of fluid-structure interaction with incompressible Dirichlet fluid domains, accepted to Journal of Computational Physics, 2021 Sun Y., Shinar T., and Schroeder, C. Effective time step restrictions for explicit MPM simulation, (Best Paper Honorable Mention), ACM SIGGRAPH / Eurographics Symposium on Computer Animation 2020, Volume 39, Number 8, 2020 Ding, O., Shinar, T., and Schroeder, C. Affine particle in cell method for MAC grids and fluid simulation, Journal of Computational Physics, Volume 408, May 2020, 109311, 2020 Bargteil, A., Shinar T. An introduction to physics-based animation, ACM SIGGRAPH 2018 Courses, 2018 Akbay, M., Nobles, N., Zordan, V., Shinar T. An extended partitioned method for conservative solid-fluid coupling, SIGGRAPH 2018, ACM Trans. Graph., Vol. 37, No. 4, Article 86, 2018 Falkenstein, M., Jones B., Levine, J.A., Shinar T., Bargteil, A.W. Reclustering for large plasticity in clustered shape matching, Proceedings of the 10th ACM SIGGRAPH Conference on Motion in Games, 2017 Jones B., Levine, J.A., Shinar T. , Bargteil, A.W. Efficient collision detection for example-based deformable bodies, Proceedings of the 10th ACM SIGGRAPH Conference on Motion in Games, 2017 Cook, S., Hohenegger, C., and Shinar, T. A micro-macro framework for analyzing steric and hydrodynamic interactions in gliding assays, SIAM Multiscale Modeling and Simulation, Vol. 15, No. 4, pp. 1768–1796, 2017 Jones B., Thuerey N., Shinar T. , Bargteil A.W. Example-based plastic deformation of rigid bodies, SIGGRAPH 2016, ACM TOG 35, 2016 Jones B., Martin A., Levine J.A., Shinar T., Bargteil A.W. Ductile fracture for clustered shape matching, Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, Redmond, WA, 2016 Jones B., Martin A., Levine J.A., Shinar T., Bargteil A.W. Clustering and collision detection for clustered shape matching, Proceedings of the 8th ACM SIGGRAPH Conference on Motion in Games, 199-204, 2015 Hohenegger, C., Cook, S. and Shinar, T. Dimensional reduction of a multiscale continuum model of microtubule gliding assays, SIAM Journal on Applied Mathematics 74 (5), 2014 Robinson-Mosher, A., Shinar, T., Silver, P. and Way J. Dynamics simulations for engineering macromolecular interactions, AIP Chaos 23 (2), 2013 Shinar, T., Mana, M., Piano, F. and Shelley, M., A model of cytoplasmically-driven microtubule-based motion in the single-celled C. elegans embryo, Proceedings of the National Academy of Sciences 108 (26), pp. 10508-10513, 2011 Robinson-Mosher, A., Shinar, T., Gretarsson, J., Su, J. and Fedkiw, R., Two-way coupling of fluids to rigid and deformable solids and shells, SIGGRAPH 2008, ACM TOG 27, 2008 Shinar, T., Schroeder, C., and Fedkiw, R., Two-way coupling of rigid and deformable bodies, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), edited by D. James and M. Gross, pp. 95-103, 2008 Sifakis, E., Shinar, T., Irving, G. and Fedkiw, R., Hybrid simulation of deformable solids, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), edited by D. Metaxas and J. Popovic pp. 81-90, 2007 Hong, J.-M., Shinar, T. and Fedkiw, R., Wrinkled flames and cellular patterns, SIGGRAPH 2007, ACM TOG 26, 47.1-47.6, 2007 Hong, J.-M., Shinar, T., Kang, M. and Fedkiw, R., On boundary condition capturing for multiphase interfaces J. Sci. Comput. 31, 99-125, 2007 Losasso, F., Shinar, T. Selle, A. and Fedkiw, R., Multiple interacting liquids SIGGRAPH 2006, ACM TOG 25, 812-819, 2006 Thesis Shinar, T., Simulation of Coupled Rigid and Deformable Solids and Multiphase Fluids, Scientific Computing and Computational Mathematics, Stanford, 2008 Students Current Students Mehrnaz Ayazi, Ph.D. candidate Chen Zhao, Ph.D. candidate Yitong Dai, Ph.D. candidate Former Students Jason Goulding, Ph.D., 2024 Steven Cook, Novartis, Ph.D., 2018 Muzaffer Akbay, Oculus VR, Ph.D., 2018 Steven Cook, Novartis Research Foundation, Ph.D., 2017 Nicholas Nobles, M.S., 2017 Wojciech Karas, M.S., 2016 Paul Cernea, M.S., 2015 Lingli Wang, M.S., 2014 Teaching CS 210 : Scientific Computing (Fall 2021, Fall 2020, Fall 2019, Fall 2018, Spring 2018, Spring 2017, Spring 2016, Winter 2015, Fall 2012) CS 179N : Computer Graphics (Summer 2021, Summer 2021, Spring 2020, Spring 2019) CS 130 : Computer Graphics (Winter 2021, Winter 2020, Winter 2019, Winter 2018, Fall 2017, Fall 2015, Winter 2013, Spring 2012) CS 230 : Computer Graphics (Winter 2016, Fall 2014, Winter 2012) CS 30 : Introduction to Computational Science and Engineering (Spring 2015, Spring 2014) CS 260 : Physics-Based Simulation for Computer Graphics (Spring 2013) Outreach Project Lead the Way Mentor, Martin Luther King High School, Riverside, CA I was a mentor in the Technovation Challenge program in NYC. Our team won 1st place in NYC and went on to the national competition at Google HQ where we placed 3rd overall! Go Firebirds! Read about the team and our winning app in this Huffington Post article. Links drawings",
  "content_length": 7739,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:48"
}