{
  "name": "Tamara Broderick",
  "homepage": "http://www.tamarabroderick.com",
  "status": "success",
  "content": "Tamara Broderick Tamara Broderick Short bio (plaintext) Google Scholar LinkedIn Affiliations Accessibility About me I am an Associate Professor with tenure at MIT. I work in the areas of machine learning and statistics. Before coming to MIT, I completed my PhD at UC Berkeley. You can learn more about my background in the following (plaintext) short bio. In my research, I am interested in understanding how we can quickly, easily, and reliably quantify uncertainty and robustness in modern data analysis procedures. Current PhD Students and Postdocs Madelyn Andersen Elizabeth Bersson Renato Berlinghieri David Burt Jenny Y. Huang Manuel Quintero Shahzar Rizvi Yunyi Shen Eric Weine Past PhD Students and Postdocs Raj Agrawal, Cofounder, Traversal Trevor Campbell, Associate Professor, University of British Columbia Sameer Deshpande, Assistant Professor, University of Wisconsin–Madison Sam Elder, Machine Learning Scientist, Kebotix Ryan Giordano, Assistant Professor, UC Berkeley Jonathan Huggins, Assistant Professor, Boston University Mikołaj Kasprzak, Assistant Professor, ESSEC Business School Lorenzo Masoero, Applied Research Scientist, Amazon Yaroslav Mukhin, Postdoctoral Researcher, IDSS Tin Danh Nguyen, Quantitative Researcher, Quantbot Technologies LP Miriam Shiffman, Senior Scientist in Data & Machine Learning, biotech startup William Stephenson, Member of Technical Staff, MIT Lincoln Labs Brian Trippe, Assistant Professor, Stanford Interested in working with me? In Spring 2025, I am teaching 6.7830 Bayesian Modeling and Inference. To apply to work with me as a PhD student, submit your application to MIT EECS; more info at this link. I can also advise PhD students accepted to other appropriate programs at MIT; e.g., I have advised PhDs in Math and CSB. Affiliations Electrical Engineering and Computer Science (EECS) Department Laboratory for Information and Decision Systems (LIDS) Statistics and Data Science Center Institute for Data, Systems, and Society (IDSS) MachineLearning@MIT MIT Institute for Foundations of Data Science (MIFODS) Accessibility Plain Academic",
  "content_length": 2097,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:50"
}