{
  "name": "Tamas Hausel",
  "homepage": "https://ist.ac.at/research/research-groups/hausel-group",
  "status": "success",
  "content": "ISTA | Hausel Group HomeResearchHausel Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Hausel Group Geometry and Its Interfaces How can we understand spaces too large for traditional analysis? Combining ideas from representation theory and combinatorics, the Hausel group develops tools to study the topology of spaces arising from string theory and quantum field theory.Suppose you have many particles, and consider the space made up of all the ways each particle can move between two points. Now, play the same game with more complicated objects, such as vector fields. The resulting spaces are too large to analyze, but it is possible to simplify them along structural symmetries, giving rise to moduli spaces that are finite-dimensional, but non-compact – again, defying traditional methods. The Hausel group studies the topology, geometry, and arithmetic of these moduli spaces, which include the moduli spaces of Yang-Mills instantons in four dimensions, and Higgs bundles in two dimensions, among others. One question is the number of high-dimensional holes of the spaces. Using methods from representation theory and combinatorics, Hausel and his team are able to give results and conjectures that have previously been described by physicists and number theorists in other terms – connecting a wide variety of fields and ideas. Group Leader Tamas Hausel Professor +43 2243 9000 2032 Tamas.Hausel@ist.ac.at Administrative Support Birgit Oosthuizen-Noczil Assistant to Professors +43 2243 9000 2150 Birgit.Oosthuizen-Noczil@ist.ac.at Team Mischa Elkner PhD Student mischa.elkner@ist.ac.at Daniel Holmes PhD Student daniel.holmes@ist.ac.at Jakub Löwit PhD Student Jakub.Loewit@ist.ac.at Nhok Ngo PhD Student Nhok.Ngo@ist.ac.at Shiyu Shen Postdoc Shiyu.Shen@ist.ac.at Olga Trapeznikova Postdoc Olga.Trapeznikova@ist.ac.at Tanguy Vernet Postdoc Tanguy.Vernet@ist.ac.at Current Projects Geometry, topology, and arithmetic of moduli spaces arising in supersymmetric quantum field theories | Representation theory of quivers, finite groups, Lie and Hecke algebras Publications Kapoor L, Ruzickova N, Zivadinovic P, Leitner V, Sisak MA, Mweka CN, Dobbelaere JA, Katsaros G, Schanda P. 2025. Quantifying the carbon footprint of conference travel: The case of NMR meetings. Magnetic Resonance. 6(2), 243–256. View Nessonov N, Ngo NT. 2025. Indecomposable characters of inductive limits of symmetric groups. Representation Theory. 29(8), 256–288. View Groechenig M, Shen S. 2025. Complex K-theory of moduli spaces of Higgs bundles. Journal of the European Mathematical Society. View Hausel T, Rychlewicz KP. 2025. Spectrum of equivariant cohomology as a fixed point scheme. Epijournal de Geometrie Algebrique. 9, 1. View Löwit J. 2025. On modulo ℓ cohomology of p-adic Deligne–Lusztig varieties for GLn. Journal of Algebra. 663(2), 81–118. View View All Publications ReX-Link: Tamas Hausel Career Since 2016 Professor, Institute of Science and Technology Austria (ISTA)2012 – 2016 Professor and Chair of Geometry, EPFL, Lausanne, Switzerland2007 – 2012 Tutorial Fellow, Wadham College, Oxford, UK2007 – 2012 University Lecturer, University of Oxford, UK2005 – 2012 Royal Society University Research Fellow, University of Oxford, UK2002 – 2010 Assistant, Associate Professor, University of Texas, Austin, USA1999 – 2002 Miller Research Fellow, Miller Institute for Basic Research in Science, University of California, Berkeley, USA1998 – 1999 Member, Institute for Advanced Study, Princeton, USA1998 PhD, Trinity College, University of Cambridge, UK Selected Distinctions 2013 ERC Advanced Grant2009 EPSRC First Grant2008 Whitehead Prize2005 Sloan Research Fellow Additional Information Download CVOpen Hausel group websiteMathematics at ISTA Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6179,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:54"
}