{
  "name": "Tamer A. ElBatt",
  "homepage": "https://www.aucegypt.edu/fac/tamerel-batt",
  "status": "success",
  "content": "Tamer El Batt | The American University in Cairo Skip to main content Additional Links CV Tamer El Batt Position: Professor, Computer Science and Engineering Department: Department of Computer Science and Engineering Email: tamer.elbatt@aucegypt.edu Brief Biography Tamer ElBatt joined the Department of Computer Science and Engineering (CSE) at The American University in Cairo (AUC) as an associate professor in July 2017. He received his BSc and MSc degrees in Electronics and Communications Engineering (ECE) from Cairo University, Egypt in 1993 and 1996, respectively, and his PhD degree in ECE from the University of Maryland, College Park, USA, in 2000. From 2000 to 2009, he was with HRL Labs, United States, Argon ST (now part of The Boeing Company), United States, and Lockheed Martin ATC, the United States at various positions. From 2009 to 2017, he was with the EECE Department, Cairo University, as an assistant professor and later as an associate professor (currently on leave). He held a joint appointment with Nile University, Egypt, from 2009 to 2017 and served as the director of the wireless center (WINC) from 2012 to 2017. In Fall 2019, ElBatt had been promoted to professor. His research has been supported by NTRA, ITIDA, QNRF, FP7, H2020, GM, Microsoft, Google, Vodafone Foundation, and DARPA and is currently supported by the NTRA, ITIDA, and ASRT. He has published 130 publications and holds seven issued US patents and one WIPO patent.ElBatt is the vice-chairman of the IEEE Egypt Section (2020-2021), a senior member of the IEEE. He has served on the TPC of numerous wireless and networking IEEE and ACM conferences. He also serves as a Member of the council on communications and information technology, ASRT (July 2018 - present). He served as the publicity co-chair of IEEE VTC-spring 2020, demos co-chair of ACM Mobicom 2013, and the publications co-chair of IEEE Globecom 2012 and EAI Mobiquitous 2014. He currently serves on the editorial board of IEEE TCCN and Wiley IJSCN and has previously served on the editorial board of IEEE TMC. ElBatt has also served on USA NSF and Fulbright review panels. He was a visiting professor at Politecnico di Torino, Italy, Sabanci University, Turkey and University of Padova, Italy. He is the recipient of the 2014 Egypt’s state incentive award in Engineering Sciences, the 2012 Cairo University incentive award in Engineering Sciences and the Google faculty research award in 2011. His research interests lie in the broad areas of performance analysis, design and optimization of wireless, mobile and IoT networks. Research Interest 5G Networks and beyondInternet of ThingsMachine Learning in networksPerformance AnalysisModeling and OptimizationMobile Computing Education PhD, Electrical and Computer Engineering, University of Maryland College Park, USA, Dec. 2000.MS, Electronics and Communications Engineering, Faculty of Engineering, Cairo University, June 1996.BS Electronics and Communications Engineering, Faculty of Engineering, Cairo University, June 1993. Selected Publications A. Girgis, O. Ercetin, M. Nafie, T. ElBatt, Fundamental limits of Memory-Latency Tradeoff in Fog Radio Access Networks under Arbitrary Demands, IEEE Transactions on Wireless Communications, vol. 18, no. 8, pp. 3871-3886, Aug. 2019.Mariam Aboelwafa, M. Abd-Elmagid, A. Biason, K. Seddik, T. ElBatt, M. Zorzi, Towards Optimal Resource Allocation in Wireless Powered Communication Networks with Non-Orthogonal Multiple Access, Elsevier Ad hoc Networks, vol. 85, pp. 1-10, March 2019.M. Emre Ozfatura, S. ElAzzouni, O. Ercetin, T. ElBatt, Optimal Throughput Performance in Full-Duplex Relay Assisted Cognitive Networks, Springer Wireless Networks, vol. 25, pages 1931–1947, 2019.M. Abad, O. Ercetin, T. ElBatt, M. Nafie, SWIPT using Hybrid ARQ over Time Varying Channels, IEEE Transactions on Green Communications and Networking, vol. 2, no. 4, pp. 1087-1100, Dec. 2018.M. Abd-Elmagid, T. ElBatt, K. Seddik, O. Ercetin, Stable Throughput of Cooperative Cognitive Networks with Energy Harvesting: Finite Relay Buffer and Finite Battery Capacity, IEEE Transactions on Cognitive Communications and Networking, vol. 4, no. 4, pp. 704-718, Dec. 2018.A. Fahim, T. ElBatt, A. Mohamed, A. Al-Ali, Towards Extended Bit Tracking for Scalable and Robust RFID Tag Identification Systems, IEEE Access, vol. 6, May 2018.M. Ali, T. ElBatt, M. Youssef, SenseIO: Realistic Ubiquitous Indoor Outdoor Detection System Using Smartphones, IEEE Sensors Journal, vol. 18, no. 9, pp. 3684-3693, May 2018.M. El-Sherief, B. Alipour, M. Al Qathrady, T. ElBatt, A. Zahran, A. Helmy, A Novel Mathematical Framework for Similarity-based Opportunistic Social Networks, Elsevier Pervasive and Mobile Computing, vol. 42, pp. 134-150, Dec. 2017.Y. Khazbak, M. Izz, T. ElBatt, A. Fahim, A. Guirguis, M. Youssef, Cost-Effective Data Transfer for Mobile Healthcare, IEEE Systems Journal, accepted for publication, Feb. 2016.A. Ibrahim, O. Ercetin, T. ElBatt, Stability Analysis of Slotted Aloha with Opportunistic RF Energy Harvesting, IEEE Journal on Selected Areas in Communications, Series on Green Communications and Networking, vol. 34, no. 5, pp. 1477-1490, May 2016.",
  "content_length": 5194,
  "method": "requests",
  "crawl_time": "2025-12-01 14:35:54"
}