{
  "name": "Tanir Özçelebi",
  "homepage": "http://www.win.tue.nl/~tozceleb",
  "status": "success",
  "content": "Tanir Ozcelebi Tanir Ozcelebi Associate Professor Interconnected Resource-aware Intelligent Systems Department of Mathematics and Computer Science Eindhoven University of Technology visit : TU/e MetaForum (MF) 6.066, Eindhoven post : PO Box 513, 5600 MB Eindhoven tel : +31 (40) 247 4426 e-mail : t.ozcelebi (SPAM) tue.nl About I am an associate professor of intelligent Internet of Things (IoT) systems at the Interconnected Resource-aware Intelligent Systems (IRIS) research cluster of TU/e Computer Science. My research is on the network architectures and life-cycle management for resource-constrained smart spaces and intelligent Internet of Things (IoT), including the relevant data analytics aspects needed for intelligence. Activities Programme manager of Master Embedded Systems at TU/e (2021-present). Programme manager of the EIT Digital Embedded Systems programme at TU/e (until 2024). Co-chair, Smart Cities and the Internet of Everything track, IEEE International Symposium on Networks, Computers and Communications, 2020. Former chairman of the Educational Committee Bachelor Computer Science (OC BTI) of TU/e. Former member of the Advisory Committee for the Bachelor Education at TU/e. Core team member of the Internet of Things research program of the Data Science Center Eindhoven (DSC/e). Research program manager for the Bright Environments research program of TU/e Intelligent Lighting Institute (2015-2023) . Guest editor for the Energies Journal, Special Issue \"Smart Lighting Environments: Sensing and Control\", 2017. Co-organizer for the Smart Lighting Environments: Sensing and Control (SLESC) special session of the IEEE International Conference on Networking, Sensing and Control (ICNSC 2017). Co-organizer for the Workshop on Ambient Intelligence Infrastructures (WAmIi) 2012 that took place in Pisa, Italy on 13 November 2012. TPC member of SAINT 2012 (The 12th IEEE/IPSJ International Symposium on Applications and the Internet). TPC member of the Semantic Information for Smart Spaces (SISS'11) workshop, organized in conjunction with SAINT 2011. TPC member of the International Workshop on Self-managing Solutions for Smart Environments (S3E 2011), organized in conjunction with GPC 2011. TPC member of the first International Workshop on Semantic Interoperability for Smart Spaces (SISS 2010), part of the IEEE Symposium on Computers and Communications (ISCC 2010). TPC member of the first International Workshop on Measurability of Security in Software Architectures (MeSSa 2010), co-located with the 4th European Conference of Software Architecture (ECSA).",
  "content_length": 2592,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:05"
}