{
  "name": "Tanja Mitrovic",
  "homepage": "http://www.cosc.canterbury.ac.nz/tanja.mitrovic",
  "status": "success",
  "content": "Computer Science and Software Engineering | University of Canterbury Skip to main content Use the Tab and Up, Down arrow keys to select menu items. Tanja Mitrovic Position Professor, Head of Department Qualifications B.Eng., M.Sc., Ph.D. Room Erskine Building 202 Contact Details Phone: +64 3 369 4269 Internal: 94269 Tanja.Mitrovic@canterbury.ac.nz Undergraduate Courses COSC265 Relational Database Systems INFO125 Introduction to Programming with Databases Graduate Courses COSC420 Intelligent Tutoring Systems News The Handbook on Artificial Intelligence in Education is out! Recent invited talk,Distinguished Visiting Professors Series, Faculty of Education and Human Development, Education University of Hong Kong, (2023), The effect of nudges on video-based traning for soft skill Tanja was inducted as the new APSCE Fellow at ICCE 2022 ICCE 2017 was held in Christchurch, 4-8 December 2017 Read about our Marsden grant \"Adaptive computer-based training for post-stroke rehabilitation\" and the results Research Interests I am the leader of ICTG (Intelligent Computer Tutoring Group) (see also old Web page). Active Video Watching, a project on supporting active video watching with personalized nudges using the AVW-Space platform. Funded by Ako Aotearoa and the University of Canterbury. ASPIRE, an authoring system for constraint-based tutors SQL-Tutor, an Intelligent Tutoring System for SQL EER-Tutor an Intelligent Tutoring System for conceptual database design using the EER model NORMIT, an Intelligent Tutoring System for data normalization A Virtual reality environment for rehabilitation of prospective memory CV. My earlier work on INSTRUCT, Object-Oriented GIS and Machine Learning is also available. Recent papers: Galster, M., Mitrovic, A., Malinen, S., Holland, J. (2024) Video-based Training for meeting communication skills. Proc. 46th Int. Conf. on Software Engineering: Software Engineering Education and Training (SEET 2024), April 14-20, Lisbon, Portugal. ACL Distinguished paper award. Clarke, A., Mitrovic, A. Explaining Problem Recommendations in an ITS. Proc. Intelligent Tutoring Systems ITS 2024, LNCS 14798, pp. 291-299. https://doi.org/10.1007/978-3-031-63028-6_23 Mitrovic, A., Galster, M., Malinen, S., Holland, J., Lumapas, R. V., Mohammadhassan, N., Musa, J. (2023) Effectiveness of video-based training for communication skills: evidence from a three-year study. ACM Transactions on Computing Education, 23(4), 1-25. https://doi.org/10.1145/3631532. Matthias Galster, Antonija Mitrovic, Sanna Malinen, Sreedevi Sankara Iyer, Jaafaru Musa, and Jay Holland. 2024. Video-based Training for Meeting Communication Skills. In 46th International Conference on Software Engineering: Software Engineering Education and Training (ICSE-SEET 2024), April 14  20, 2024, Lisbon, Portugal. ACM, New York, NY, USA, 10 pages. https://doi.org/10.1145/3639474.3640080 Matthias Galster, Antonija Mitrovic, Sanna Malinen, Jay Holland, Pasan Peiris (2023) Soft skills required from software professionals in New Zealand. Information and Software Technology, 107232, ISSN 0950-5849. Mitrovic, A., Holland, J. (2022) How much support is necessary for self-regulated learning? Iyer, S et al. (Eds.) Proc. 30th Int. Conf on Computers in Education ICCE 2022, Kuala Lumpur, Nov 28  Dec 2, pp. 101 - 110. Mohammadhassan N., Mitrovic A. (2022) Investigating the effectiveness of visual learning analytics in Active Video Watching. In: Rodrigo, M.M., Matsuda, N., Cristea, A.I., Dimitrova, V. (Eds.) Artificial Intelligence in Education, Lecture notes in computer science, vol. 13355, pp. 127-139. Springer, Cham. https://doi.org/10.1007/978-3-031-11644-5_11 Tahir, F., Mitrovic, A., Sotardi, V. (2022) Investigating the Causal Relationships between Badges and Learning Outcomes in SQL-Tutor. Research and Practice in Technology Enhanced Learning, 17(7) (Open access) Mohammadhassan, N., Mitrovic, A., Neshatian, K. (2022) Investigating the Effect of Nudges for Improving Comment Quality in Active Video Watching. Computers & Education, 176, 104340 (open access) Aust, J. Pons, D. Mitrovic, A. (2022) Evaluation of Influence Factors on the Visual Inspection Performance of Aircraft Engine Blades. Aerospace, 9, 18. Dimitrova, V., Mitrovic, A. Choice Architecture for Nudges to Support Constructive Learning in Active Video Watching. Int. J. Artificial Intelligence in Education. Online first 24 August 2021 (open access) Mohammadhassan N., Mitrovic A. (2022) Discovering Differences in Learning Behaviours During Active Video Watching Using Epistemic Network Analysis. In: Wasson B., Zörg? S. (Eds.) Advances in Quantitative Ethnography. ICQE 2021. Communications in Computer and Information Science, vol 1522, pp. 362-377. Springer, Cham Aust, J., Mitrovic, A., Pons, D. (2021) Comparison of Visual and VisualTactile Inspection of Aircraft Engine Blades\". MDPI Aerospace, Special issue on Aircraft fault detection, 8(11), 313. https://www.mdpi.com/2226-4310/8/11/313/pdf Aust, J., Mitrovic, A., Pons, D. (2021) Assessment of the Effect of Cleanliness on the Visual Inspection of Aircraft Engine Components: An Eye Tracking Study. MDPI Sensors, 21 (18), 6135, Special issue on Eye tracking techniques, applications and challenges. Aust, J., Shankland, S., Pons, D., Mukundan, R., Mitrovic, A. (2021) Automated Defect Detection and Decision-Support in Gas Turbine Blade Inspection. Aerospace, 8(2), 30 (open access) Mitrovic, A., Holland, J. (2020) Effect of Non-mandatory Use of an Intelligent Tutoring System on Students Learning. In I. Bittencourt et al. (Eds.): Proc. Int. Conf. Artificial Intelligence in Education AIED 2020. Lecture Notes in Computer Science vol. 12163, pp. 386.397. https://doi.org/10.1007/978-3-030-52237-7_31 Mohammadhassan, N., Mitrovic, A., Neshatian, K., Dunn, J. (2020) Automatic quality assessment of comments in active video watching using machine learning techniques. In: So, H.J. et al. (Eds.) Proceedings of the 28th International Conference on Computers in Education, pp. 1-10. Asia-Pacific Society for Computers in Education. ISBN978-986-97214-5-5. Nominated for the Best overall paper and Best student paper awards. Tahir, F., Mitrovic, A., Sotardi, V. (2020) Investigating the Effects of Gamifying SQL-Tutor. In: So, H.J. et al. (Eds.) Proceedings of the 28th International Conference on Computers in Education, pp. 416-425. Asia-Pacific Society for Computers in Education. ISBN978-986-97214-5-5. Nominated for the Best overall paper and Best student paper awards. Mitrovic, A., Gordon, M., Piotrkowicz, A., Dimitrova, V. (2019) Investigating the effect of adding nudges to increase engagement in active video watching. In: S. Isotani et al. (Eds.) Proc. 20th Int. Conf. AIED 2019, LNAI 11625, pp. 320-332, Springer Nature Switzerland. Fabic, G., Mitrovic, A., Neshatian, K. Evaluation of Parsons problems with menu-based self-explanation prompts in a mobile Python tutor. International Journal on Artificial Intelligence in Education, 29(4), 507-535, 2019. Online first 10.1007/s40593-019-00184-0 Chen, X., Mitrovic, A., Mathews, M. (2019) Investigating the Effect of Agency on Learning from Worked Examples, Erroneous Examples and Problem Solving. IJAIED, 29(3), 396-424. First online 23 May 2019. https://doi.org/10.1007/s40593-019-00179-x Chen, X., Mitrovic, A., Mathews, M. (2019) Learning from Worked Examples, Erroneous Examples and Problem Solving: Towards Adaptive Selection of Learning activities. IEEE TLT, vol. 12. 10.1109/TLT.2019.2896080 Taskin, Y., Hecking, T., Hoppe, H.U., Dimitrova, V., Mitrovic, A., Characterizing comment types and levels of engagement in video-based learning as a basis for adaptive nudging. ECTEL 2019, Delft, 16-19 September 2019, LCNS 11722, pp. 362-376. Tahir, F., Mitrovic, A., Sotardi, V. (2019) Towards adaptive provision of examples during problem solving. In: Chang, M. et al. (Eds.) Proceedings of the 27th International Conference on Computers in Education, pp. 57-62. Taiwan: Asia-Pacific Society for Computers in Education. Fabic, G. V. F., Mitrovic, A., & Neshatian, K. (2018) Investigating the effects of learning activities in a mobile Python tutor for targeting multiple coding skills. Research and Practice in Technology Enhanced Learning, 13(1), 23. Abolkasim E., Lau L., Dimitrova V., Mitrovic A. (2018) Diversity Profiling of Learners to Understand Their Domain Coverage While Watching Videos. In: Pammer-Schindler V., Perez-Sanagustin M., Drachsler H., Elferink R., Scheffel M. (eds) Lifelong Technology-Enhanced Learning. EC-TEL 2018. Lecture Notes in Computer Science, vol 11082. Springer, Cham (pp 561-565). Mitrovic, A., Dimitrova, V., Lau, L., Weerasinghe, A., Mathews, M. (2017) Supporting Constructive Video-based Learning: Requirements Elicitation from Exploratory Studies. In: E. Andre, R. Baker, X. Hu, M. Rodrigo, B. du Boulay (Eds.), Proc. 18th Int. Conf. Artificial Intelligence in Education, LNAI 10331, pp. 224-237. Dimitrova, V., Mitrovic, A., Piotrkowicz, A., Lau, L., Weerasinghe, A. (2017) Using Learning Analytics to Devise Interactive Personalised Nudges for Active Video Watching . In: Bielikova, M., Herder, E., Cena, F., Desmarais, M. (Eds.) Proc. 25th ACM UMAP conference, Bratislava, Slovakia, 9-12 July 2017, pp. 22-31, ACM. ISBN: 978-1-4503-4635-1 Hecking, T., Dimitrova, V., Mitrovic, A., Hoppe, U. Using Network-Text analysis to characterise learner engagement in active video watching. In: Chen W. et al. (Eds), Proceedings of the 25th International Conference on Computers in Education ICCE 2017, Christchurch, 4-9 December 2017, pp. 326-335. Asia-Pacific Society for Computers in Education. Best Technical Design Paper Award Fabic, G., Mitrovic, A., Neshatian, K. A comparison of different types of learning activities in a mobile Python tutor. In: Chen W. et al. (Eds), Proceedings of the 25th International Conference on Computers in Education ICCE 2017, Christchurch, 4-9 December 2017, pp. 604-613. Asia-Pacific Society for Computers in Education. Best",
  "content_length": 16301,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:01"
}