{
  "name": "Tanya Y. Berger-Wolf",
  "homepage": "https://cse.osu.edu/people/berger-wolf.1",
  "status": "success",
  "content": "Berger-Wolf, Tanya | Computer Science and Engineering Skip to main content Tanya Berger-Wolf Academic Director, Academic Affairs Administration Professor, Computer Science and Engineering Professor, Evolution Ecology and Organismal Biology Professor, Electrical and Computer Engineering Pomerene Hall1760 Neil Ave Columbus, OH 43210-1221 berger-wolf.1@osu.edu Download CV Translational Data Analytics Institute Imageomics Institute AI and Biodiversity Change (ABC) Global Climate Center Google Scholar Conservation X Labs Biography Dr. Tanya Berger-Wolf is the Director of the Translational Data Analytics Institute  and a Professor of Computer Science Engineering, Electrical and Computer Engineering, as well as  Evolution, Ecology, and Organismal Biology at the Ohio State University.  She is leading the US National Science Foundation funded Imageomics Institute and the US-Canada funded AI and Biodiversity Change (ABC) Global Climate Center. As a computational ecologist, her research is at the unique intersection of computer science, wildlife biology, and social sciences. Berger-Wolf is a member of the US National Academies Board on Life Sciences, US National Committee for the International Union of Biological Sciences (IUBS), as well as the Advisory Boards of The Nature Conservancy, Conservation X Labs, and the FathomNet project. She served on the Global Partnership on AI (GPAI) working group on AI and Biodiversity, WWF working group on AI Collaboration to End Wildlife Trafficking, AAAS-FBI Big Data in the Life Sciences and National Security Working Group, and the organizing committee of the National Academies First U.S.-Africa Frontiers of Science, Engineering, and Medicine Symposium, among many others. Berger-Wolf is also co-founder of the AI for wildlife conservation software non-profit Wild Me (now part of Conservation X Labs), home of the Wildbook project, which has been chosen by UNSECO as one of the top AI 100 projects worldwide supporting the UN Sustainable Development Goals. It has been featured in media, including Forbes, National Geographic, The New York Times, CNN, and The Economist. Prior to coming to OSU in January 2020, Berger-Wolf was at the University of Illinois at Chicago. She holds a Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign. She is widely published and is a sought-after invited speaker. She has given hundreds of talks, including at TED/TEDx, UN/UNESCO AI for the Planet, and SXSW EDU. Berger-Wolf has received numerous awards for her research and mentoring, including the highest honor of University of Illinois Scholar, UIC Distinguished Researcher of the Year, US National Science Foundation CAREER, Association for Women in Science Chicago Innovator, and the UIC Mentor of the Year. Expertise Data science, computational ecology, imageomics, AI for good, AI for conservation, AI and biodiversity, network analysis, applied machine learning",
  "content_length": 2934,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:03"
}