{
  "name": "Tao Yang 0009",
  "homepage": "http://www.cs.ucsb.edu/~tyang",
  "status": "success",
  "content": "Tao Yang Homepage Tao Yang Professor of Computer Science Harold Frank Hall, Room 5113 Department of Computer Science University of California Santa Barbara, CA 93106 Phone: (805) 893-4321 (Dept) Fax: (805) 893-8553 (Dept) tyang at cs dot ucsb Tao Yang received the B.S. degree in Computer Science from Zhejiang University, China, in 1984, the M.E. degree in Artificial Intelligence from Zhejiang University in 1987. He received the M.S. and Ph.D. degrees in Computer Science from Rutgers University in 1990 and 1993. He joined the Department of Computer Science at UCSB in 1993. His most recent research is in the areas of information retrieval. His past work has been in the areas of web search, parallel and distributed systems, cluster-based network services, and high performance computing. During last 15 years, he served on the program committees of information retrieval related conferences including WWW, SIGIR, KDD, WSDM, CIKM, ECIR, and EMNLP and was the Systems and Infrastructure track co-chair for the WWW 2021 program committee. In the past, he served on program/organization committees of high performance computing related conferences including SC, IPDPS, PPoPP, SPAA, and INFOCOM, and was on the editorial board of IEEE Transactions on Parallel and Distributed Systems. He received the Research Initiation Award from NSF in 1994, UC Regents' Junior Faculty Award in 1994, the Computer Science Faculty Teacher Award in 1995 from the UCSB College of Engineering, and the CAREER Award from NSF in 1997, and Noble Jeeviant Award from AskJeeves, 2002, and a Google faculty research award in 2019. He served as Chief Scientist for Ask.com (formally Ask Jeeves) from 2001 to earlier 2010, and also VP/SVP of ASK as the head of its search engineering division in various periods. He was the founding Chief Scientist and Vice President of Research and Development from 2000 to 2001 for Teoma, an Internet search startup company acquired by Ask Jeeves in 2001. At Ask.com/Teoma, he has led teams of scientists and engineers for the design and implementation of a top-rated search engine and vertical products that power Ask.com, Ask Kids , Teoma , and other Ask network sites with over 100 million users. He has co-developed scalable search algorithms and systems for page indexing, retrieval, ranking, classification, and anti-spamming. He has been directly responsible for scaling search architectures for handling billions of documents in terms of relevancy, performance, and freshness. He has visited Microsoft Bing for search technology R&D in 2010 and 2011. Publications UCSB undergraduates interested in research? If you are passionate on search systems with a good academic standing, you can contact me on possible research projects. Current and Past Projects : Neural document ranking, Privacy-aware Search, Versioned Data and Search, Similarity Computing, Ask.com/Teoma web search, Neptune clustering infrastructure, Sorrento self-organizing storage cluster, Alexandria digital library TMPI: Compile/run-time support for fast MPI execution, S+: Fast sparse LU, RAPID: Scheduling and run-time support for parallel irregular computations , PYRROS DAG scheduling. Students Graduated Recent Courses: CS170 Operating Systems ( Spring 2024 ). 291A Neural Information Retrieval ( Fall 2024 ) CS140 Parallel computing (Winter 2025). UCSB CS Department",
  "content_length": 3360,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:09"
}