{
  "name": "Tao Gu 0001",
  "homepage": "https://taogu.site",
  "status": "success",
  "content": "Prof Tao Gu's homepageSearchTao GuProfessorIEEE FellowAAIA FellowACM Distinguished MemberEmail: firstname dot lastname AT mq.edu.auPhone: +61-2-9850-4357Address: Room 267, 4 Research Park Drive, North Ryde, NSW 2109, AustraliaSchool of Computing, Macquarie UniversityBiographyI am currently a Professor in School of Computing at Macquarie University, Sydney, and the Founder/Director of Deego Technology Pty Ltd. I obtained my Ph.D. in Computer Science from National University of Singapore, M.Sc. in Electrical and Electronic Engineering from Nanyang Technological University, and B.Eng. in Automatic Control from Huazhong University of Science and Technology. I have served as an Editor of Proc. of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), an Associate Editor of IEEE Transactions on Mobile Computing (TMC) and IEEE Internet of Things Journal (IoT-J). I am currently serving as an Editor of IEEE Transactions on Wireless Communications.My research foscuses on advancing intelligent sensing and AI technologies—spanning edge, embedded, and embodied systems—to create autonomous solutions that seamlessly perceive and interact with the physical world. My current research interests include Edge, Embedded, and Embodied AI, Intelligent Sensing, Mobile and Ubiquitous Computing, Wireless Networks, and Internet of Things. We usually publish our work in journals and conferences, including MobiCom, MobiSys, SenSys, UbiComp, IPSN, and INFOCOM. Please visit the Projects page for the specific research we are doing.We are hiring multiple PhD students! Please see Hiring.Research ProjectsEdge, Embedded, and Embodied AIFoundation model design, model fine-tuning and re-training, lightweight and resource-efficient model design, multimodal model training, cross-domain model transfer.[MobiCom'24] Kai Huang, Xiangyu Yin, Tao Gu, and Wei Gao. Perceptual-Centric Image Super-Resolution using Heterogeneous Processors on Mobile Devices, in Proc. of the 30th International Conference on Mobile Computing and Networking (MobiCom 2024), Washington, D.C., USA, September 30–October 4, 2024.[SenSys'23] Huanqi Yang, Mingda Han, Mingda Jia, Zehua Sun, Pengfei Hu, Yu Zhang, Tao Gu, and Weitao Xu. XGait: Cross-Modal Translation via Deep Generative Sensing for RF-based Gait Recognition , in Proc. of the 21st ACM Conference on Embedded Networked Sensor Systems (SenSys 2023), Istanbul, Turkey, 12-17 November 2023.[ToN'21] Yu Zhang, Tao Gu, and Xi Zhang. MDLdroid: a ChainSGD-reduce Approach to Mobile Deep Learning for Personal Mobile Sensing, IEEE/ACM Transactions on Networking (ToN), 2021.[SenSys'20] Yu Zhang, Tao Gu, and Xi Zhang. MDLdroidLite: a Release-and-Inhibit Control Approach to Resource-Efficient Deep Neural Networks on Mobile Devices, in Proc. of the 18th ACM Conference on Embedded Networked Sensor Systems (SenSys 2020), Yokohama, Japan, November 16-19, 2020. [Demo Video]Intelligent SensingNew sensors, multi-modal sensing, fusion algorithms, and novel intelligent sensing systems powered by edge/embedded AI models.[MobiCom'25] Zehua Sun, Tao Ni, Pengfei Hu, Tao Gu, and Weitao Xu. SpaceSched: A Constellation-Wide Scheduling System for Resolving Ground Track Congestion in Remote Sensing, in Proc. of the 31st International Conference on Mobile Computing and Networking (MobiCom 2025), Hong Kong, November 4–8, 2025.[UbiComp'24] Lei Wang, Xingwei Wang, Yu Zhang, Xiaolei Ma, Haipeng Dai, Yong Zhang, Zhijun Li, and Tao Gu. Accurate Blood Pressure Measurement Using Smartphone’s Built-in Accelerometer, the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), 2024.[MobiCom'23] Xi Zhang*, Yu Zhang*, Zhenguo Shi, and Tao Gu. mmFER: Millimetre-wave Radar based Facial Expression Recognition for Multimedia IoT Applications, in Proc. of the 29th International Conference on Mobile Computing and Networking (MobiCom 2023), Madrid, Spain, October 2-6, 2023. (* Equal Contribution)[MobiSys'23] Lei Wang, Tao Gu, Wei Li, Haipeng Dai, Yong Zhang, Dongxiao Yu, Chenren Xu, and Daqing Zhang. DFSense: Dual Forming based Multi-user Acoustic Sensing for Heartbeat Monitoring , in Proc. of the 21st ACM International Conference on Mobile Systems, Applications, and Services (MobiSys 2023), Helsinki, Finland, June 18-22, 2023.Wireless NetworksSpace-air-ground integrated networks, low-power wide-area networks, integration of sensing, communication and computing.[JSAC'25] Jingbo Zhao, Zhaoming Lu, J. Andrew Zhang, Jiaxi Zhou, Weicai Li, and Tao Gu. Subspace-Based Super-Resolution Sensing for Bi-Static ISAC with Clock Asynchronism, IEEE Journal on Selected Areas in Communications (JSAC), 2025.[MobiCom'25] Ruonan Li, Ziyue Zhang, Xianjin Xia, Ningning Hou, Wenchang Chai, Shiming Yu, Yuanqing Zheng, and Tao Gu. From Interference Mitigation to Toleration: Pathway to Practical Spatial Reuse in LPWANs, in Proc. of the 31st International Conference on Mobile Computing and Networking (MobiCom 2025), Hong Kong, Nov 2025.[MobiCom'24] Shiming Yu, Xianjin Xia, Ningning Hou, Yuanging Zheng, and Tao Gu. Revolutionizing Loa Gateway with XGate: Scalable Concurrent Transmission across Massive Logical Channels, in Proc. of the 30th International Conference On Mobile Computing And Networking (MobiCom 2024), Washington, D.C., USA, September 30 - October 4, 2024.[TWC'24] Jingbo Zhao, Zhaoming Lu, J. Andrew Zhang, Weicai Li, Yifeng Xiong, Zijun Han, Xiangming Wen, and Tao Gu. Performance Bounds for Passive Wireless Sensing in Asynchronous ISAC Systems, IEEE Transactions on Wireless Communication, 2024.Recent News12/2024: We have one paper accepted at MobiCom 2025. Congratulations to Ruonan!11/2024: We secured an Australian Research Council (ARC) Linkage Project Grant with a total funding amount of AU$509,991.09/2024: Prof Gu has been again listed in Stanford’s World Top 2% Scientists in Networking and Telecommunications and AI, published by Stanford University and Elsevier on 17 September 2024.06/2024: Our ARC Research Hub in the Internet of Things for Water IH240100014 was successfully funded by Australian Research Council. The total investment is AU$10 million.03/2024: The ARC Research Hub for Future Digital Manufacturing was funded by Australian Research Council. The total investment is AU$10.64 million.02/2024: Prof Gu was invited to serve the Editor of IEEE Transactions on Wireless Communications.12/2023: Our Solving Plastic Waste Cooperative Research Centre bid is successfully funded by the Australian Federal Government. The total investment is AU$140.6 million.11/2023: We have one paper accepted at MobiCom 2024. Congratulations to Shiming!11/2023: Congratulations to Prof. Tao Gu received the 2023 Research Excellence Awards！10/2023: Yu and Ningning will join Macquarie University as a Lecturer! Congratulations to both and well done!03/2023: We have one paper accepted at MobiSys 2023. Congratulations to Lei!02/2023: We have one paper accepted at IPSN 2023. Congratulations to Zehua!01/2023: We have one paper accepted at MobiCom 2023. Congratulations to Yu and Xi!12/2022: We have one paper accepted at INFOCOM 2023.10/2022: We won the MobiCom 2022 Best Poster Award. Congratulations to Yao! The video can be accessed via here .10/2022: We have one paper accepted at SenSys 2022. Congratulations to Zhenguo!08/2022: We have one paper accepted at MobiCom 2022. Congratulations to Yao!04/2022: We have succesfully secured a $1.7M fund from CSRIO.Artificial Intelligence of Things for Resilient and Sustainable Smart Cities, funded by CSRIO under the Next Generations Graduates programs, Next Generation Emerging Technologies challenges, April 2022 - Oct 2025.02/2022: We have one paper accepted at IPSN 2022. I was invited to serve the TPC of SenSys 2022.12/2021: We have two papers accepted at INFOCOM 2022.12/2021: Prof Gu will give a keynote speech at ADHOCNETS 2021 on 6 December 2021.11/2021: It is the great pleasure to serve as a General Co-Chair of ACM MobiCom 2022 to be held in Sydney next year.07/2021: We have two papers accepted by ACM/IEEE ToN. Congratulations to Yu and Xianjin!07/2021: Congratulations to Yu Zhang for receiving the Research Achievement Award for outstanding research performance in 2020!06/2021: We have two MobiCom 2021 papers accepted!05/2021: Critical Supply Chain CRC Melbourne Workshop will be held on 25 May 2021.04/2021: Critical Supply Chain CRC Sydney Workshop will be held on 7 May 2021.03/2021: Critical Supply Chain CRC bid is now officially started.12/2020: We have a paper accepted by INFOCOM 2021. Congratulations to Jiuwu!11/2020: We have two papers accepted by ACM/IEEE ToN. Congratulations to Xianjin and Zhiwei!09/2020: Several month’s lockdown in Melbourne can really drive people mad, but nothing could encourage people better than sharing good news. Congratulation to Yu for his SenSys 2020 paper! I believe this is the world-first on-device deep learning framework with both training and inference that is fully enabled on commercial smartphones.06/2020: Prof Gu was invited to serve as the TPC Chair of IoTDI 2021.05/2020: Prof Gu was appointed as an Editor of IMWUT.02/2020: We have two papers accepted by IPSN 2020. Congratulations to Yu and Yuxiang!12/2019: We have an INFOCOM 2020 paper accepted. Congratulations to Xianjin!09/2019: We will have two PhD students and two visiting overseas students joining our team. Welcome!07/2019: Our paper on Lora parallel decoding will appear in SenSys 2019. Congratulations to Xianjin!04/2019: One paper is accepted by ACM/IEEE ToN. Congratulations to Xianjin!01/2019: Our ARC DP grant application on decimetre-level indoor positioning which has a total funding amount of AUD280,000 is successful.11/2018: Two papers are accepted by TMC.10/2018: We have three papers in UbiComp 2018. Congratulations to Yu, Liang, and Tianben!04/2018: We have a paper accepted by INFOCOM 2018. Congratulations to Zhiwei!HiringNew: We are hiring multiple PhD students!In this new project, we aim to research, develop and deliver novel I",
  "content_length": 12272,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:05"
}