{
  "name": "Tao Ju 0001",
  "homepage": "https://www.cs.wustl.edu/~taoju",
  "status": "success",
  "content": "Home of Tao Ju Home Bio Teaching Advising Service Projects Software Publications Music Tao Ju Professor Department of Computer Science and Engineering Washington University in St. Louis Office: McKelvey 2035 Phone: 314-935-6648 Email: taoju at wustl.edu Bio Sketch I joined Washington University in 2005. I finished my undergraduate study in 2000 in Tsinghua University (China) with a major in English and a minor in Computer Science, obtained my PhD degree in 2005 from Rice University in Computer Science under the supervision of Dr. Joe Warren, and pursued a short post-doctoral training in the summer of 2005 in the National Center for Macromolecular Imaging (now at Stanford) in Baylor College of Medicine directed by Dr. Wah Chiu. My primary research area is computer graphics, with particular interests in geometric modeling, mesh processing, and shape understanding. The other focus of my research is on bio-medical applications, in particular geometric algorithms for analyzing bio-medical images and volumes. I have received a number of grant awards from NSF and NIH, including an NSF CAREER award in 2009. Ph.D thesis Curriculum Vitae Google Scholar citations Teaching CSE 330: Rapid Prototyping and Creative Programming (Fall 2009) CSE 450: Video Game Programming I (Fall 2005, 2007, 2008) CSE 451: Video Game Programming II (Spring 2006, 2008) CSE 452: Computer Graphics (Fall 2006-2011, Spring 2013, 2015) CSE 546: Computational Geometry (Spring 2014, Fall 2017, 2019, 2021, Spring 2023, 2024) CSE 5504: Geometric Computing for Biomedicine (Fall 2010-2016, 2018, 2020, 2022, 2023, 2024, 2025) CSE 591: Introduction to Graduate Study in CSE (Fall 2023) Seminar: Computer graphics and computer vision (since Spring 2006) Advising Current Yiwen Ju (PhD) Peter Rong (PhD) Jianjun Xia (PhD) Past Sasakthi Abeysinghe (PhD, 2010, last known at OLiVE) Lu Liu (PhD, 2011, last known at Meta) Ming Zou (PhD, 2016, last known at Waymo) Michelle Holloway (PhD, 2016, last known at Partek) Hang Dou (PhD, 2017, now at Nvidia) Yajie Yan (PhD, 2018, now at Apple) Zhiyang Huang (PhD, 2019, now at Huawei) Huayi Zeng (PhD, 2020, now at Waymo) Dan Zeng (PhD, 2022, now at Meta Research) Xingyi Du (PhD, 2023, now at Tencent Americas) Gustavo Gratacos Hernandez (PhD, 2024) Tim Simpson (MS., 2008) Trung D. Nguyen (MS, 2011, last known at Microsoft) Stephen Schuh (MS, 2011, last known at Google) Ruosi Li (MS, 2011, last known at Meta) Derek Burrows (MS, 2013, last known at Boeing) Service University and Department Responsibilities Associate Chair of Research, Department of Computer Science and Engineering (2022-2023) Vice Dean of Research, McKelvey School of Engineering (2016-2021) Ambassador to Tsinghua University, McDonnell International Scholars Academy (2013-present) Technical Report Series Coordinator (2008-2016) ACM chapter Faculty Advisor (2010-2016) School of Engineering Undergraduate Board member (2006-2015) Journal Editorial Boards IEEE Transactions on Visualization and Computer Graphics (2015-2022; Associate EIC 2019-2022) Computer Graphics Forum, Associate Editor (2011-2014; 2019-2022) Computer-Aided Design, Associate Editor (2012-present) Graphical Models, Associate Editor (2010-present) Computational Visual Media, Associate Editor (2015-present) Program Committees Siggraph Siggraph Asia Eurographics Symposium on Geometry Processing (PC Co-chair: 2018) Pacific Graphics (PC Co-chair: 2007) ACM Symposium on Solid and Physical Modeling Geometric Modeling and Processing (PC Co-chair: 2019; Conference co-chair: 2025) International Conference on Shape Modeling and Applications (PC Co-chair: 2024) Sketch-Based Interfaces and Modeling International Symposium on Visual Computing Computer Graphics International Conference Professional Societies ACM, Distinguished Member ACM SIGGRAPH Nomination Committee member (2024-2025) IEEE, Senior Member AsiaGraphics, executive committee member (2016-2021) Software and Websites Education Computational Geometry Demos: A suite of Javascript-based, in-browser demos for learning computational geometry algorithms with step-by-step animations. Algorithms include convex hulls, Voronori diagrams, Delaunay triangulations, segment intersections, arrangements and k-D trees. Research VIPSS: A command-line tool for reconstructing an implicit surface from an unoriented point set. Based on Siggraph 2019 paper. (Developed by Zhiyang Huang) Voxel Cores: A command-line tool for computing the medial axis of a 3D shape. Based on Siggraph 2018 paper. (Developed by Yajie Yan) Erosion Thickness: A GUI program for creating a family of descriptive, clean skeletons from a possibly noisy medial axis. Based on Siggraph 2016 paper. (Developed by Yajie Yan) TopoInterp: A software for reconstructing a closed surface from cross-section curves with topological guarantees. Based on Siggraph 2015 paper. (Developed by Ming Zou) Livewire3D: An interactive tool for curve drawing and segmentation on meshes. Based on Pacific Graphics 2014 paper. (Developed by Yixin Zhuang and Ming Zou) CycleDisc: A graphical tool for finding possible cycles bounding surface patches in a 3D wireframe, optionally allowing user interaction and surfacing the found cycles. Based on Siggraph Asia 2013 paper. (Developed by Yixin Zhuang and Ming Zou) TriMultPoly: A tool for optimally triangulating one or multiple 3D polygons. Based on SGP 2013 paper. (Developed by Ming Zou) CC Skeleton: An efficient and robust tool for computing curve, surface and mixed curve-and-surface skeletons from a voxelized model. Based on Pacific Graphics 2011 paper. (Developed by Lu Liu) Ctr2Suf: A tool for smooth surface reconstruction from cross-section curves (or curve networks) that lie on either parallel or non-parallel planes. Based on Eurographics 2008 paper. (Developed by Lu Liu) PolyMender: A robust, efficient program for removing cracks, holes, T-junctions and self-intersections from arbitrary polygonal models. Based on SIGGRAPH 2004 paper. Biomedical applications TopoRoot: A software pipeline for computing branching hierarchy and fine-grained traits of maize (corn) root crowns from X-ray CT images. Gorgon: An interactive molecular modeling system specifically geared towards cryo-EM and other low resolution structures of macromolecular complexes. StackAligner: A graphical toolkit for reconstructing smooth 3D volumes from serially sectioned tissue images. Based on Journal of Neuroscience Methods paper \"3D Volume Reconstruction of a Mouse Brain from Histological Sections using Warp Filtering\". Selected Publications 2025 Lifted Surfacing of Generalized Sweep Volumes ACM Transactions on Graphics (Proc. ACM Siggraph Asia 2025), 44(6): No. 248 (Paper, Project, Code and data) Yiwen Ju, Qingnan Zhou, Xingyi Du, Nathan Carr, Tao Ju. Computing the boundary surface of the 3D volume swept by a rigid or deforming solid remains a challenging problem in geometric modeling. Existing approaches are often limited to sweeping rigid shapes, cannot guarantee a watertight surface, or struggle with modeling the intricate geometric features (e.g., sharp creases and narrow gaps) and topological features (e.g., interior voids). We make the observation that the sweep boundary is a subset of the projection of the intersection of two implicit surfaces in a higher dimension, and we derive a characterization of the subset using winding numbers. These insights lead to a general algorithm for any sweep represented as a smooth time-varying implicit function satisfying a genericity assumption, and it produces a watertight and intersection-free surface that better approximates the geometric and topological features than existing methods. Variational Surface Reconstruction Using Natural Neighbors ACM Transactions on Graphics (Proc. ACM Siggraph 2025, Best Paper Honorable Mention), 44(4): No. 85 (Paper, Project, Code and data) Jianjun Xia and Tao Ju. Surface reconstruction from points is a fundamental problem in computer graphics. While numerous methods have been proposed, it remains challenging to reconstruct from sparse and non-uniform point distributions, particularly when normals are absent. We present a robust and scalable method for reconstructing an implicit surface from points without normals. By exploring the locality of natural neighborhoods, we propose local reformulations of a previous global method, known for its ability to surface sparse points but high computational cost, thereby significantly improving its scalability while retaining its robustness. Experiments show that our method achieves comparable speed to existing reconstruction methods on large inputs while producing fewer artifacts in under-sampled regions. VHS: a package for homological simplification of voxelized plant root data for skeletonization Computational Geometry, 130: No. 102198 (Paper link, Code) Erin Chambers, Tao Ju, David Letscher, Hannah Schreiber, Dan Zeng. In this work, we present VHS (Voxelized Homological Simplification), a C++ package whose purpose is to de-noise voxelized data and output a topologically accurate simplified shape. In contrast to previous work on voxelized homological simplification tools, our main goal is offering a better starting point for computing curve skeletons for shape analysis. This goal necessitates additional simplification beyond what other packages provide, although our approach extends and improves prior work on heuristic methods which compute approximate solutions for the homological simplification problem. Our tool is designed for and tested on voxelized plant roots, although it is potentially useful beyond this data set. While the homological simplification problem is NP-hard in general, our package is able to simplify almost all of the topological noise when used on data from plant root systems. Compared with existing simplification tools, our method strikes a better balance between topological simplicity and geometric accuracy, resulting in higher usability of the resulting skeletons. 2024 Large-scale",
  "content_length": 133857,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:09"
}