{
  "name": "Tao Hou 0001",
  "homepage": "https://tao-hou.com",
  "status": "success",
  "content": "Home - Tao Hou | Assistant Professor at University of North Texas (UNT) Tao Hou, Ph.D. Assistant Professor Department of Computer Science and Engineering, University of North Texas UNT Discovery Park, Denton, TX 76207-7102 Office: NTDP F278 Email: [email protected] Multiple positions are available for PhD, MS, and undergraduate students: I am always looking for capable, dedicated, and hard-working students who want to solve real-world problems. Please send me an email with your CV, transcripts, and other relevant documents if you are interested. About Dr. Tao Hou is an Assistant Professor in the Department of Computer Science and Engineering at the University of North Texas, where he co-directs the Intelligent Security and Privacy (ISnP) Lab. Dr. Hou received his Ph.D. in Computer Science and Engineering from University of South Florida in 2022, under the supervision of Dr. Zhuo Lu and Dr. Yao Liu. Prior to that, he obtained his M.E. and B.E. degrees from Jilin University (China) in 2016 and 2013, respectively. His research interests are in the areas of cybersecurity and machine learning. He is especially interested in research problems that arise from practical domains, with a focus on both experimental/empirical study and sound theoretical footings. Recently, he is working on web security, intrusion detection, IoT security, binary analysis, malware detection, and trustworthy machine learning. News [June, 2025] I will serve on the program committees of INFOCOM 2026 and USENIX Security 2026. [Mar, 2025] I will serve on the program committees of INFOCOM DeepWireless 2025, REUNS 2025, and ACSAC 2025. [Aug, 2024] I will serve on the program committee of USENIX Security 2025. [Aug, 2024] I will serve on the program committee of 2025 International Conference on Computing, Networking and Communications. [Feb, 2024] I will serve on the technical program committee of IEEE Conference on Communications and Network Security (CNS) 2024. [Feb, 2024] I will serve on the program committee and artifact evaluation committee of ACSAC 2024. [Jan, 2024] The proposal aimed at securing intelligent IoT systems has been funded by the U.S. DEVCOM Army Research Laboratory (ARL). [Dec, 2023] I will serve on the technical program committee of INFOCOM DeepWireless 2024. [Aug, 2023] I will serve on the program committee of USENIX Security 2024. [Aug, 2023] Congratulations to Sean, Jaelyn, and Kevin on the acceptance of their REU research paper for the REUNS workshop. [Aug, 2023] The SecDINT paper, which focuses on preventing data-oriented attacks via Intel SGX escorted data integrity, is accepted to IEEE CNS 2023. [Aug, 2023] The work on attention-based LSTM enpowered adaptive feature engineering is to appear in IEEE MILCOM 2023. [Feb, 2023] I will serve on the technical program committee of IEEE Conference on Communications and Network Security 2023. [Aug, 2022] Our work on examining the security and privacy of third-party JavaScript caching is accepted to IEEE CNS 2022. [Mar, 2022] \"Dynamic and Lightweight Data-Channel Coupling towards Confidentiality in IoT Security\" has been accepted to ACM WiSec 2022. [Dec, 2021] Our paper entitled \"MUSTER: Subverting User Selection in MU-MIMO Networks\" has been accepted to IEEE INFOCOM 2022. [Nov, 2021] The work on deceiving ML based IoT device identification by automated traffic camouflage has been accepted to IEEE DySPAN 2021. [Oct, 2021] I will serve on the technical program committee of IEEE ICCCN 2022. [Jul, 2021] Our paper on combating adversarial network inference has been accepted by IEEE/ACM Transactions on Networking (ToN). [Jan, 2021] I will serve on the artifact evaluation committee of EuroSys 2021. [Jul, 2020] I will serve on the artifact evaluation committee of ACSAC 2020. [Dec, 2019] The paper on proactive network topology obfuscation has been accepted by IEEE INFOCOM 2020. [Nov, 2019] Our paper \"Smart Spying: Inferring Your Activities from Encrypted Wireless Traffic\" won the Best Paper Award at IEEE GlobalSIP'19. [Nov, 2019] I have been selected to receive a 2019 ACSAC Student Travel Grant. [Oct, 2019] I received the International Travel Grant from USF OGS to attend the IEEE GlobalSIP'19 conference in Ottawa, Canada. Research Interests Network Security: Intrusion Detection, Traffic Fingerprinting, IoT Security, 5G Security System Security: Web Security, User Privacy, Malware Detection, Binary Analysis Machine Learning: Machine Learning for Cybersecurity, Trustworthy Machine Learning, Adversarial Machine Learning Top",
  "content_length": 4525,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:06"
}