{
  "name": "Tao Zhang",
  "homepage": "https://site.nyit.edu/bio/tzhang",
  "status": "success",
  "content": "Tao Zhang | New York Tech Staff & Faculty Directory Tao Zhang Professor; Computer Science, College of Engineering & Computing Sciences Professor; Electrical & Computer Engineering, College of Engineering & Computing Sciences Education Credentials: Ph.D.Expertise: Wireless Communications and NetworkingJoined New York Tech: 2005 Tao Zhang received her M.S. and Ph.D. degrees in computer science from the University of Texas at Dallas in 2003 and 2005, respectively. Her research interests span Artificial Intelligence focusing on Internet of Thing (IoT), Machine Learning with a particular focus on biomedical data, Mobile Edge Computing for Vehicular Networks, and Wireless Networks focusing on the design and analysis of network architectures and protocols. Zhang was the principal investigator of two National Science Foundation (NSF)-funded projects. She frequently serves on NSF proposal review panels. She is a senior member of the IEEE since 2007. She serves as a program chair of many IEEE conferences. She has been a technical committee member in numerous IEEE conferences, including ICC, Globecom, and Infocom. In addition, Zhang has served as a reviewer for numerous IEEE journals including IEEE Transactions on Network, IEEE Transactions on Wireless Communications, IEEE Selected Areas in Communications, and IEEE Communication Magazine. Recent Projects/Research NSF MRI grant, ECCS-1337965, “MRI: Acquisition of a DC/RF Sputtering System to Support Multidisciplinary Research on Medical Sensors and Micro-generators in WBAN”, PI: Dr. Tao Zhang, $230,063, 9/1/2013 – 8/31/2016. NSF TUES grant DUE-1044596, “Enhancing the Electrical and Computer Engineering Curriculum by Integrating Applications of Wireless Technology”, PI: Tao Zhang, $134,794, 10/1/2011 – 09/30/2015. Publications Yanlin Zhang, Peng Li, Tao Zhang, Jing Liu, Weiyi Huang, Lei Nie, “Dynamic User Recruitment in Edge-aided Mobile Crowdsensing,” IEEE Transactions on Vehicular Technology, Volume 72, Issue 7, Page(s): 9351 – 9365, 19 January, 2023. Weiyi Huang, Peng Li, Bo Li, and Tao Zhang, “DMP: Content Delivery with Dynamic Movement Pattern in Vehicular Networks,” IEEE Transactions on Big Data, Volume: 8, Issue 5, Page(s): 1371 – 1386, 01 October 2022. Heng He, Ji Zhang, Peng Li, Yu Jin, Tao Zhang, “A Lightweight Secure Conjunctive Keyword Search Scheme in Hybrid Cloud,” Future Generation Computer Systems, Volume 93, Pages 727-736, April 2019. Peng Li, Tao Zhang, Chuanhe Huang, Chen Xi, and Bin Fu, “RSUs-Assisted Geocast in Ve- hicular Ad Hoc Networks,” IEEE Wireless Communications, Volume: 24, Issue: 1, Page(s): 53 – 59, 28 February 2017. Chris DelBello, Kazi Raihan, and Tao Zhang, “Reducing Energy Consumption of Mobile Phones During Data Transmission and Encryption for WBAN Applications,” Security and Communication Networks, Volume 8, Issue 17, Pages: 2973-2980, 25 November 2015. Jinguo Li, Mi Wen, and Tao Zhang, “Group-based authentication and key agreement with dynamic policy updating for MTC in LTE-A Networks,” IEEE Internet of Things Journal, Volume: PP, Issue: 99, Pages: 1, ISSN: 2327-4662, October 27, 2015. Tao Zhang, Kejie Lu, Shengli Fu, Yi Qian, Wang Liu, and Jianping Wang, “Improving the Capacity of Large-Scale Wireless Networks with Network Assisted-Coding Schemes,” IEEE Transactions on Wireless Communications, VOL. 11, NO. 1, Pages 88-96, January 2012. Wang Liu, Kejie Lu, Jianping Wang, Yi Qian, Tao Zhang, and Liusheng Huang, “Capacity of Distributed Content Delivery in Large-Scale Wireless Ad Hoc Networks,” IEEE INFOCOM 2012, Orlando, FL, USA, March 25-30, 2012. Courses Taught at New York Tech CSCI 891 MS Thesis II CSCI 890 MS Thesis I CSCI 870 Project EENG 755 Computer Networks EENG 491 Senior Design Projects II EENG 489 Senior Design Projects I CSCI 690 Computer Networks CSCI 651 Algorithm Concepts CSCI 345 Computer Networks CSCI 310 C and Unix CSCI 235 Discrete Structures CSCI 185 Programming II CSCI 125 Programming I Professional Honors and Awards New York Institute of Technology Annual Faculty Scholars Award, New York Institute, 2007–2021 Contact Information Email: tzhang@nyit.edu Phone: 516.686.1088 Office: Long Island, NY Website: iris.nyit.edu By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 4308,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:09"
}