{
  "name": "Tao Wang 0026",
  "homepage": "https://tao-wang.com",
  "status": "success",
  "content": "ï»¿ Home - Tao Wang | Assistant Professor at University of North Texas (UNT) Tao Wang Assistant Professor Department of Computer Science and Engineering, University of North Texas UNT Discovery Park, Denton, TX 76207-7102 Email: [email protected]      Office: NTDP F262 Interested in working with us? I am always looking for capable, dedicated, and self-motivated students to involve in my research. Multiple positions are available for PhD, MS, and undergraduate students. Please send me an email with your CV, transcripts, and other relevant documents if you are interested. News [Nov, 2025] My proposal on using AI to enhance the security of next-generation wireless communication systems has received the UNT Research Seed Grant. [Aug, 2025] I will serve on the program committees of IEEE INFOCOM 2026 and ACM CCS 2026. [Mar, 2025] I will serve on the program committees of IEEE INFOCOM DeepWireless 2025, IEEE GLOBECOM 2025, and ACSAC 2025. [Aug, 2024] I will serve on the program committee of USENIX Security 2025. [Aug, 2024] I will serve on the program committee of 2025 International Conference on Computing, Networking and Communications. [Feb, 2024] I will serve on the technical program committee of IEEE Conference on Communications and Network Security (CNS) 2024. [Jan, 2024] Our project to enhance the security of networks and communications utilizing AI has been selected for support by the Microsoft AFMR program. [Aug, 2023] The paper on preventing data-oriented attacks through Intel SGX escorted data integrity has been accepted for IEEE CNS 2023. [Feb, 2023] I will serve on the technical program committee of IEEE Conference on Communications and Network Security 2023. [Dec, 2022] Our \"WeCARE\" project towards securing wireless IoT (WIoT) networking is funded by DoD Office of Naval Research. (Sole PI) [Nov, 2022] The project on trustworthy and resilient energy internet of things (eIOT) has been funded by The U.S. Department of Energy (PI: Dr. Misra). [Aug, 2022] Our work on examining the security and privacy of third-party JavaScript caching is accepted to IEEE CNS 2022. [Mar, 2022] My proposal towards IoT confidentiality is funded by NSF Engineering Research Initiation (ERI) award. Thank you, NSF! (Sole PI) [Mar, 2022] Our project in collaboration with Northeastern University is funded by U.S. Army Research Laboratory. [Mar, 2022] Our work on dynamic and lightweight data-channel coupling has been accepted to ACM WiSec 2022. Congratulations, Shengping! [Feb, 2022] I will serve on the technical program committee of IEEE Conference on Communications and Network Security (CNS) 2022. [Jan, 2022] The work on proactive anti-eavesdropping is to appear in IEEE Transactions on Dependable and Secure Computing (TDSC). [Dec, 2021] The paper on examining user selection in MU-MIMO networks is accepted to IEEE INFOCOM 2022. Congratulations, Shengping! [Dec, 2021] Interviewed by Las Cruces Sun-News on ransomware attacks and potientional countermeasures. Here is the Link of the article. [Nov, 2021] Our work on deceiving machine learning based IoT device fingerprinting has been accepted to IEEE DySPAN 2021. [Oct, 2021] I will serve on the technical program committee of IEEE International Conference on Computer Communications and Networks (ICCCN) 2022. [Jul, 2021] The paper on combating adversarial network inference has been accepted by IEEE/ACM Transactions on Networking (ToN). [Oct, 2020] I will serve on the technical program committee of IEEE International Conference on Communications (ICC) 2021. [Dec, 2019] Our work on proactive network topology obfuscation is to appear in IEEE INFOCOM 2020. [Nov, 2019] The paper on inferring user activities from encrypted wireless traffic won the Best Paper Award at IEEE GlobalSIP. [Oct, 2019] Our paper \"Far Proximity Identification in Wireless Systems\" has been accepted by IEEE Transactions on Dependable and Secure Computing (TDSC). [Nov, 2018] Our paper on evesdropping entrapment has been accepted by IEEE INFOCOM 2019. Short Biography Dr. Tao Wang is an Assistant Professor in the Department of Computer Science and Engineering at University of North Texas, where he co-directs the Intelligent Security and Privacy (ISnP) Lab. Dr. Wang received his Ph.D. degree from University of South Florida under the supervision of Dr. Yao Liu in 2019, and received his B.S. degree from Jilin University, China. His research focuses on network and cyber-physical security with an emphasis on designing defense methods that can protect emerging wireless technologies (e.g., IoT, 5G network) from being undermined by adversaries. Recently, he has been working on the adversarial machine learning towards secure resource allocation in Multi-user MIMO systems. His research is also related to web security, specifically, on identifying security threats and developing countermeasures to improve web security. Research Interests Network Security, Web Security, 5G Security, Cyber-physical System Security and IoT Security Wireless Networking and Wireless Communication Machine Learning for Cybersecurity, Trustworthy Machine Learning, and Adversarial Machine Learning Sponsors Top",
  "content_length": 5153,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:07"
}