{
  "name": "Tao Guo 0004",
  "homepage": "https://cocogt96.github.io",
  "status": "success",
  "content": "Tao Guo The Hong Kong Polytechnic University, Hung Hom, Kowloon Hong Kong cocotao.guo AT connect.polyu.hk Google Scholar : click me Thank you for stopping by. Tao Guo was a member of the Pervasive Edge Intelligence Lab at The Hong Kong Polytechnic University (PEILab), directed by Prof. Song Guo. She obtained her Ph.D. degree in Computer Science from The Hong Kong Polytechnic University in 2024. Prior to that, she obtained her B.E. degree from Huazhong University of Science and Technology in 2017, and M.S. degree from Columbia University in the City of New York in 2019. Her research interests mainly lie in Federated foundation model, Federated Learning, Large Vision-Language Models, Edge Learning and Trustworthy Machine Learning. She published papers in top venues like WWW, ATC, NeurIPS, TMC, etc. I am currently an assitant professor at Shenzhen University. Graduate and undergraduate students interested in the research directions mentioned above are welcome to join us. Please send your resume, transcript, and any relevant representative works (if any) to cocogt@szu.edu.cn Selected publications 2024 TMC Explore and Cure: Unveiling Sample Effectiveness with Context-Aware Federated Prompt Tuning Tao Guo, Song Guo, and Junxiao Wang IEEE Transactions on Mobile Computing, 2024 WWW Poisoning Attack on Federated Knowledge Graph Embedding Enyuan Zhou, Song Guo, Zhixiu Ma, and 3 more authors Proceedings of the ACM Web Conference, 2024 2023 TMC Promptfl: Let federated participants cooperatively learn prompts instead of models-federated learning in age of foundation model Tao Guo, Song Guo, Junxiao Wang, and 2 more authors IEEE Transactions on Mobile Computing, 2023 WWW pFedPrompt: Learning Personalized Prompt for Vision-Language Models in Federated Learning Tao Guo, Song Guo, and Junxiao Wang Proceedings of the ACM Web Conference, 2023 TMC Tree Learning: Towards Promoting Coordination in Scalable Multi-Client Training Acceleration Tao Guo, Song Guo, Feijie Wu, and 5 more authors IEEE Transactions on Mobile Computing, 2023",
  "content_length": 2045,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:05"
}