{
  "name": "Tapas Pandit",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-tapas-pandit",
  "status": "success",
  "content": "Dr. Tapas Pandit | Assistant Professor, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Tapas Pandit Tapas Pandit Assistant Professor, Plaksha University PhD, ISI Kolkata Area of Expertise: Quantum Computing Cryptography Select About About Tapas Pandit Dr. Tapas Pandit recently joined Plaksha as an Assistant Professor in Communication Security. His research interests include quantum computing, designing security protocols in post-quantum settings, blockchain, and online voting schemes. He received his M.Tech and PhD in computer science from ISI, Kolkata. Dr. Pandit's doctoral thesis focuses on the design of predicate-based cryptosystems. As a postdoctoral researcher at IISc Bangalore, he worked on quantum computing and designing post-quantum cryptosystems. Research Interests Post-Quantum Cryptography Signatures in Multivariate setting Lattice-Based Signatures and Key-Exchange protocols Quantum Cryptanalysis Blockchain Online Voting Scheme Past Associations Assistant Professor, SRM University, AP Postdoctoral Researcher, IISc Bangalore Assistant Professor, IIIT Sri City, Chittoor Education M.Tech and PhD in Computer Science, ISI, Kolkata, India Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 4431,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:09"
}