{
  "name": "Tapan Kumar Saha",
  "homepage": "http://researchers.uq.edu.au/researcher/83",
  "status": "success",
  "content": "Professor Tapan Saha | UQ Experts Skip to menu Skip to content Skip to footer Professor Tapan Saha Email: saha@eecs.uq.edu.au Phone: +61 7 336 53962 Positions Affiliate of UQ Cyber Research Centre UQ Cyber Research Centre Faculty of Engineering, Architecture and Information Technology Affiliate of Dow Centre for Sustainable Engineering Innovation Dow Centre for Sustainable Engineering Innovation Faculty of Engineering, Architecture and Information Technology Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Prof Tapan Saha was born in Bangladesh and immigrated to Australia in 1989. Tapan received his PhD from the University of Queensland in 1994. Previously, Tapan obtained a B. Sc in Electrical & Electronic Engineering from Bangladesh University of Engineering and Technology (BUET), Dhaka in 1982 and a Master of Technology in Electrical Engineering from Indian Institute of Technology, New Delhi in 1985. He has been with the University of Queensland since 1996, where he has been a Professor of Electrical Engineering since 2005. Previously he was an Adjunct Professor of Xi'an Jiaotong University and Hunan University in China. Previously he worked in James Cook University of North Queensland, Townsville for two and a half years and in BUET for three and a half years. Tapan Saha is a Fellow of the Institute of Electrical and Electronic Engineers (IEEE) and the Institution of Engineers Australia. He is a Chartered Professional Engineer (CPEng) of Engineers Australia and a Registered Professional Engineer of the State of Queensland (RPEQ). He is on the National Engineering Register (NER). Prof Saha is on the APEC Engineer Register and on the Register of International Professional Engineers. His current research projects are in the fields of: Renewable energy integration to electricity grid Smart condition monitoring for transformers and other ageing assets Prof Saha is actively involved with a number of organisations: Leader: Power, Energy and Control Engineering Discipline Leader: UQ Solar Founding Director: Australasian Transformer Innovation Centre Leader: Industry 4.0 UQ Energy TestLab IEEE Power & Energy Society Distinguished Lecturer ARC College of Expert Member Editorial Board Member, IEEE Transactions on Power Delivery Editorial Board Member & Consulting Editor, IEEE Transactions on Sustainable Energy Associate Editor, IEEE Transactions on Dielectrics and Electrical Insulation Senior Editor, IEEE Access Electrical College Board (Engineers Australia) Member (2015-2020) CIGRE Australian Panel A2 Member IEEE Power & Energy Society Queensland Chapter: Chair (2021-2022) Faculty Adviser: IEEE MU Kappa Chapter (UQ) Student Counsellor: IEEE PES/DEIS UQ Student Branch Member, Queensland Electrical Branch (Engineers Australia, till 2023) Read more Read less Availability Professor Tapan Saha is: Available for supervision Media expert Fields of research Engineering Qualifications Bachelor of Science, Bangladesh University Masters (Research) of Research, Indian Institute of Technolgy, Delhi Doctor of Philosophy, The University of Queensland Engineers Australia, Engineers Australia Institute of Electrical and Electronics Engineers, Institute of Electrical and Electronics Engineers Research interests Power systems analysis-renewable energy integration (Solar PV and wind) Read more Read less Long distance transmission connection from renewnable energy sources to the main electricity grid Read more Read less Intelligent Diagnostics of Aged Power Transformers & other ageing assets Read more Read less Solar PV forecasting and large scale solar farm fault detection and diagnosis Read more Read less Research impacts Prof Tapan Saha has more than thirty years of research/teaching experience within the Australian universities. He has been a Professor of Electrical Engineering since 2005, and has established himself as an internationally recognised research expert in power & energy systems. He has published more than 660 papers in IEEE, IET and Elsevier Transactions & major power engineering peer reviewed conferences. He has successfully supervised 57 PhD & 11 MPhil students as a principal adviser and currently supervises 15 PhD students. He has also been supervising three PhD students through UQIDAR (https://www.uqidar.org/), which is a joint PhD program between UQ and IIT Delhi, India. He has been supervising two PhD students through UQ-DTU joint PhD program. He has received numerous grants from ARC, ARENA and other competitive agencies and also from the Australian electricity supply industry. He serves in a number of professional organisations, which includes IEEE, Engineers Australia and CIGRE. He has established a strong research collaboration with universities in Australia, India, China, USA and Canada. He works very closely with the Australian electricity supply industry. A Brisbane start-up company Aurtra, founded on University of Queensland technology developed by Professor Tapan Saha, Dr Hui Ma, Dr Chandima Ekanayake and Dr Dan Martin to monitor the health of electricity network transformers has been acquired by French multinational Schneider Electric in a multi-million-dollar deal. Prof Saha has published his 25 years research outcome on transformer in a book: Transformer Ageing : Monitoring and Estimation Techniques, which is published by Wiley & IEEE. This book is available through Amazon & also through this link New Book A New report has been published Comparing High Voltage Overhead and Underground Transmission Infrastructure for Powerlink. Read more Read less Works Search Professor Tapan Saha’s works on UQ eSpace All (689) Book (3) Journal Article (260) Other Outputs (6) Edited Outputs (1) Conference Publication (411) Book Chapter (8) 2025 Journal Article Optimal VSG BESS sizing for improving grid-following converter stability under various dispatch scenarios and grid strengths Xu, Yunda, Yan, Ruifeng and Saha, Tapan Kumar (2025). Optimal VSG BESS sizing for improving grid-following converter stability under various dispatch scenarios and grid strengths. IEEE Transactions on Sustainable Energy, 16 (3), 2210-2223. doi: 10.1109/tste.2025.3546294 Optimal VSG BESS sizing for improving grid-following converter stability under various dispatch scenarios and grid strengths 2025 Journal Article A review on network-aware control of distributed energy resources under the dynamic operating envelopes framework Lankeshwara, Gayan, Sharma, Rahul, Yan, Ruifeng, Tushar, Wayes and Saha, Tapan K. (2025). A review on network-aware control of distributed energy resources under the dynamic operating envelopes framework. Renewable and Sustainable Energy Reviews, 217 115696, 1-27. doi: 10.1016/j.rser.2025.115696 A review on network-aware control of distributed energy resources under the dynamic operating envelopes framework 2025 Journal Article Development and validation of a dynamic operating envelopes-enabled demand response scheme in low-voltage distribution networks Lankeshwara, Gayan, Sharma, Rahul, Alam, M.R., Yan, Ruifeng and Saha, Tapan K. (2025). Development and validation of a dynamic operating envelopes-enabled demand response scheme in low-voltage distribution networks. Applied Energy, 382 125150, 1-16. doi: 10.1016/j.apenergy.2024.125150 Development and validation of a dynamic operating envelopes-enabled demand response scheme in low-voltage distribution networks 2025 Journal Article Coordinated Frequency Control Based on Hierarchical MPC Considering Tie-line Power Flow Ma, Ning, Bai, Feifei and Saha, Tapan K. (2025). Coordinated Frequency Control Based on Hierarchical MPC Considering Tie-line Power Flow. IEEE Transactions on Power Systems, PP (99), 1-14. doi: 10.1109/TPWRS.2025.3612368 Coordinated Frequency Control Based on Hierarchical MPC Considering Tie-line Power Flow 2024 Journal Article DeeBBAA: a benchmark deep black box adversarial attack against cyber-physical power systems Bhattacharjee, Arnab, Bai, Guangdong, Tushar, Wayes, Verma, Ashu, Mishra, Sukumar and Saha, Tapan K. (2024). DeeBBAA: a benchmark deep black box adversarial attack against cyber-physical power systems. IEEE Internet of Things Journal, 11 (24), 40670-40688. doi: 10.1109/jiot.2024.3454257 DeeBBAA: a benchmark deep black box adversarial attack against cyber-physical power systems 2024 Conference Publication Performance analysis of hybrid power plant under varying grid conditions Bandara, Ashan Imantha M. H., Shahnazian, Fatemeh, Yan, Ruifeng and Saha, Tapan Kumar (2024). Performance analysis of hybrid power plant under varying grid conditions. 2024 IEEE 34th Australasian Universities Power Engineering Conference (AUPEC), Sydney, Australia, 20-22 November 2024. Piscataway, NJ, United States: Institute of Electrical and Electronics Engineers. doi: 10.1109/aupec62273.2024.10807586 Performance analysis of hybrid power plant under varying grid conditions 2024 Conference Publication Capacity planning for virtual synchronous generator batteries to enhance small-signal stability of grid-following converters Xu, Yunda, Cui, Hankun, Yan, Ruifeng and Saha, Tapan Kumar (2024). Capacity planning for virtual synchronous generator batteries to enhance small-signal stability of grid-following converters. 2024 IEEE 34th Australasian Universities Power Engineering Conference, AUPEC 2024, Sydney, Australia, 20-22 November 2024. Piscataway, NJ, United States: Institute of Electrical and Electronics Engineers. doi: 10.1109/aupec62273.2024.10807526 Capacity planning for virtual synchronous generator batteries to enhance small-signal stability of grid-following converters 2024 Journal Article On image transformation for partial discharge source identification in vehicle cable terminals of high‐speed trains Liu, Kai, Jiao, Shibo, Nie, Guangbo, Ma, Hui, Gao, Bo, Sun, Chuanming, Xin, Dongli, Saha, Tapan K. and Wu, Guangning (2024). On image transformation for partial discharge ",
  "content_length": 39415,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:14"
}