{
  "name": "Tara Javidi",
  "homepage": "https://tjavidi.eng.ucsd.edu",
  "status": "success",
  "content": "Tara JavidiSearch this siteEmbedded FilesSkip to main contentSkip to navigationTara JavidiJerzy (George) Lewak Chair and ProfessorElectrical & Computer Engineering and Halicioglu Data ScienceUCSDFounding CTOKavAI (formerly Soter AI)Founding Co-DirectorCenter for Machine Intelligence, Computing and SecurityEditor in ChiefIEEE Journal of Selected Areas in Information TheoryOther Center AffiliationsTILOS NSF AI Institute (CoPI), CWC, ITA, CNS, CALIT2Faculty DirectorUCSD's Schmidt AI in Science Postdoctoral FellowshipResearchInformation Theory for Active (Machine) LearningAdaptive Signal/Information Acquisition and ProcessingDecentralized (Statistical/Reinforcement/Federated) Learning Optimization for Machine Integrated Compute & CommWireless Communication NetworksStochastic and Decentralized ControlIEEE FellowResearchMy research area involves stochastic analysis, design, and control of information collection, processing, and transfer in modern networked systems. This covers broad theoretical questions as well as practical implementation of various solutions. In my research group, we often prove theorems but we also build and test our theoretical findings when possible (graduate applicants, please refer to this link!). In particular, the work can be broadly broken into the following areas: 1. Active Learning, Active Hypothesis Testing and Sequential Information Theory, 2. Stochastic Control and Optimization of Networks, and 3. AI and Learning-enabled Optimization of Wireless Communications and NetworksOn the theoretical front, I am most concerned with the problem of sequential information acquisition and interactive learning where the cost of data collection and/or labeling can be substantially reduced. Here the challenge is to deal with imperfect and noisy data as well as the dynamics of data. Here our objective has been to 1) develop algorithms that acquire the most informative features with the minimum cost and 2) design queries and data collections that account for the uncertainty and inconsistency (of humans) in the loop. On the more practical front, I am interested to apply our developed algorithms in the following three application domains: 1) next generation wireless networks , 2) service drones, and other 3) decentralized learning and control systems.  Learn more ›NewsProf. Tara Javidi has been appointed as the inaugural holder of the Jerzy (George) Lewak Endowed Chair In the Jacobs School of Engineering.Prof. Tara Javidi and UCSD have been selected to join the Eric and Wendy Schmidt AI in Science Postdoctoral Fellowship, a program of Schmidt Futures, to accelerate the next scientific revolution by applying AI to research in science, technology, engineering and mathematics (STEM).  The fellowship will support postdoctoral scholars in applying AI technology to research in STEM fields. The U.S. National Science Foundation recently announced 11 new artificial-intelligence research institutes, including The Institute for Learning-enabled Optimization at Scale (TILOS) lead by Prof Tara Javidi as one of the 4 coPIs. The AI research institutes are part of a $220 million investment spanning seven research areas in AI. Each institute receives about $20 million over five years. Congratulations to TILOS Team!ContactTara Javidi, Ph.D., Professor, Electrical and Computer Engineeringemail: tjavidi@ucsd.eduPhone:  (858) 822-4924 Fax: (858) 534-24864501 Franklin Antonio Hall 4306 Atkinson HallUC San Diego, MC 0407         9500 Gilman DrLa Jolla, CA 92093-0407Women in Information Theory Society ProductionCongratulations to newly graduated Dr Nancy Ronquillo! Report abuseReport abuse",
  "content_length": 3637,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:11"
}