{
  "name": "Tarek F. Abdelzaher",
  "homepage": "http://web.engr.illinois.edu/~zaher",
  "status": "success",
  "content": "﻿ Tarek Abdelzaher Tarek Abdelzaher Professor of Computer Science, University of Illinois A versatile collection of research directions are investigated in this group, ranging from social sensing to the Internet of Things and from signal processing to edge AI, with applications from autonomous cars to future defense systems. These avenues of investigation share one fundamental goal: empower computing systems that are better integrated with the physical and social environment. Such integration has reprecussions on time, space, energy, and performance dimensions. New theory, design tools, development paradigms, and run-time services are needed to understand, optimize, and deploy these systems, leading to a broad set of research challenges, a rich source of inspiration, and great opportunities for societal impact. Social and Information Dynamics Internet of Things (and Applications) Developing the foundations for intelligent mission-critical software to make transportation safer, faster, smarter, and more sustainable. Delivering a vision of ubiquitous (machine) intelligence at the point of need to empower the future Internet of things. Scheduling algorithms, models, and theory for intelligent real-time and cyber-physical systems. Mitigating information disorder by developing the signal processing algorithms for social media. A real-time social media data analysis toolkit for situation understanding from noisy streaming social media data. Empowering safe and reliable automation in distributed hostile environments with resource constraints. A vehicular navigation app that finds the most fuel-efficient route for one's car, as opposed to the shortest or fastest. The project developed a novel schedulability analysis technique for distributed real-time systems. Get in touch",
  "content_length": 1797,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:15"
}