{
  "name": "Tarek Ould Bachir",
  "homepage": "https://www.polymtl.ca/expertises/ould-bachir-tarek",
  "status": "success",
  "content": "Ould-Bachir, Tarek | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Ould-Bachir, Tarek Poly Bottin Cours English Répertoire des expertises Ould-Bachir, Tarek Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Tarek Ould-Bachir B. Ing. M.Sc.A., Ph.D. (Poly) Publications Professeur agrégé Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 2452 Téléc. : (514) 340-5139 Local : M-5107 tarek.ould-bachir@polymtl.ca Domaines d'expertise Traitement des signaux numériques Matériel informatique Organisation des systèmes informatiques Traitement réparti et simultané Architecture d'ordinateur et conception Systèmes intégrés à très grande échelle (VLSI) Modélisation mathématique Modélisation et simulation Études de modélisation et de simulation Pôle(s) d'excellence secondaire(s) Industrie du futur et société numérique Nouvelles frontières en technologies de l'information et communications Intérêts de recherche et affiliations Intérêts de recherche Systèmes numériques Synthèse à haut niveau Systèmes temps-réel Systèmes embarqués Systèmes cyber-physiques Sécurite des systèmes cyber-physiques Arithmétique des ordinateurs Calcul haute performance Architecture des ordinateurs Architectures spécialisées Circuits intégrés programmables (FPGA) Type(s) d'expertises (sujets CRSNG) 2514 Traitement des signaux numériques 2701 Matériel informatique 2702 Organisation des systèmes informatiques 2704 Traitement réparti et simultané 2719 Architecture d'ordinateur et conception 2722 Systèmes intégrés à très grande échelle (VLSI) Publications En vedette Article de revue Hajizadeh, F., Ould-Bachir, T., & David, J. P. (2024). CuFP: An HLS Library for Customized Floating-Point Operators. Electronics, 13(14), 2838 (22 pages). Article de revue Chalangar, H., Ould-Bachir, T., Sheshyekani, K., & Mahseredjian, J. (2022). Methods for the Accurate Real-Time Simulation of High Frequency Power Converters. IEEE Transactions on Industrial Electronics, 69(9), 9613-9623. Article de revue Ould-Bachir, T., Blanchette, H., & Al-Haddad, K. (2014). A network tearing technique for FPGA-based real-time simulation of power converters. IEEE Transactions on Industrial Electronics. Article de revue Ould-Bachir, T., & David, J. P. (2013). Self-alignment schemes for the implementation of addition-related floating-point operators. ACM Transactions on Reconfigurable Technology and Systems, 6(1), 1-21. Voir toutes les publications (68) Biographie Tarek Ould-Bachir a obtenu sa maîtrise et son doctorat en génie électrique à Polytechnique Montréal, à Montréal (Québec), respectivement en 2008 et 2013. Il est actuellement professeur agrégé au Département de génie informatique et génie logiciel de Polytechnique Montréal, où il est également le coordonnateur des programmes d’études supérieures de son département. Les travaux de recherche du professeur Ould-Bachir portent sur la conception d’architectures programmables pour les systèmes embarqués haute performance, avec des applications en simulation en temps réel, en accélération sur FPGA et en traitement de paquets à haut débit. Il a contribué de manière significative à la simulation des transitoires électromagnétiques (EMT), à la modélisation de l’électronique de puissance et aux plateformes de type matériel dans la boucle (HIL). Ses recherches récentes portent aussi sur la cybersécurité des systèmes de transport, notamment les véhicules autonomes et les plateformes avioniques, où les contraintes temps réel et la résilience des systèmes sont essentielles. En parallèle, il explore des paradigmes de calcul non conventionnels, tels que le calcul stochastique et les machines d’Ising, afin de résoudre en matériel des problèmes complexes d’optimisation combinatoire. Le professeur Ould-Bachir est auteur ou coauteur de plus d’une cinquantaine de publications évaluées par les pairs dans des revues et conférences de premier plan. Il est activement impliqué dans la IEEE Industrial Electronics Society (IES), où il occupe actuellement la présidence du Comité technique sur les systèmes électroniques sur puce (Electronic Systems on Chip – ESoC) pour le mandat 2023–2025. Il contribue régulièrement à l’organisation d’ateliers et de conférences internationales portant sur les systèmes FPGA, les architectures embarquées et les technologies de simulation cyber-physique. Il est membre en règle de l’Ordre des ingénieurs du Québec (OIQ), ainsi que membre de l’IEEE, de l’Association for Computing Machinery (ACM) et du Regroupement Stratégique en Microsystèmes du Québec (ReSMiQ), un regroupement provincial stratégique soutenant l’innovation dans le domaine des microsystèmes. Il est également membre de l’Institut multidisciplinaire en cybersécurité et cyberrésilience (IMC²), une initiative hébergée à Polytechnique Montréal qui réunit des partenaires académiques, industriels et gouvernementaux pour faire progresser la cybersécurité. Enfin, il est codirecteur du Groupe de recherche en microélectronique (GRM), spécialisé dans la conception et la validation de systèmes intégrés performants et sécuritaires. Enseignement ELE1300, Circuits logiques INF1500, Logique des systèmes numériques INF1600, Architecture des micro-ordinateurs INF2010, Algorithmes et structures de données INF3500, Conception et réalisation de systèmes numériques INF3610, Systèmes embarqués INF8503, Concepts avancés en architecture des ordinateurs Encadrement à Polytechnique EN COURS Doctorat (9) Allabadi, Ahmad. Méthodes numériques robustes pour la simulation des transitoires dans les convertisseurs de puissance. Mashreghi Moghadam, Parisa. Architecture de recouvrement programmable en P4. Zamanidoost, Yadollah. Détection de maladies pulmonaires par apprentissage machine, algorithmes et implémentations matérielles. Alavoine, Loic. Ajustement et simulation des câbles électriques d'un avion par circuits équivalent dépendant des fréquences. Meddah, Karim. Plateforme FPGA pour la simulation en temps réel de convertisseurs de puissances rapides. Hajizadeh, Fahimeh. Simulation sur FPGA de modèles de câbles d'avion à haute fidélité pour des applications aéronautiques. Abbasmollaei, Mostafa. Applications P4 sur plateforme hétérogène CPU/FPGA. Allahdini, Mobin. Cybersécurité des systèmes avioniques. Proulx, Alexandre. Accélérer la rétro-ingénierie du bitstream FPGA grâce à l’apprentissage automatique: Une méthodologie multiplateforme. Maîtrise recherche (3) Gay, Robin. Implémentations matérielles des approches d'inspiration quantique. Lakhdari, Koceila. Accélération des simulation EMT sur GPU. Deloumeau, Nicolas. Mise en œuvre et caractérisation de mécanismes de traçage efficaces sur des dispositifs FPGA et ASIC. Maîtrise professionnelle (1) Talabong, Willy . Détection d’activités malveillantes par modélisation contextuelle via des graphes appliqués aux journaux de sécurité. TERMINÉ Thèse de doctorat (3) Chalangar, H. (2021). Methods for FPGA-based real-time simulation of fast transients in power electronics systems and fault locating applications [Thèse de doctorat, Polytechnique Montréal]. Masoom, A. (2021). High-Level Programming Methods for the Simulation of Power System Transients [Thèse de doctorat, Polytechnique Montréal]. Montano, F. (2021). Architectures and Methodology for the Design of Real-time Power Converter Simulators on FPGAs [Thèse de doctorat, Polytechnique Montréal]. Mémoire de maîtrise (7) Allard, F. J. X. (2024). Extension du langage P4 pour faciliter l'utilisation de structures à états [Mémoire de maîtrise, Polytechnique Montréal]. Morantin, B. R. M. (2024). Sécurité véhiculaire: Une approche par système de détection d'intrusion hybride [Mémoire de maîtrise, Polytechnique Montréal]. Yan, Z. (2024). Simulation en temp réel sur FPGA d'un double pont actif à convertisseurs trois niveaux à point neutre calé [Mémoire de maîtrise, Polytechnique Montréal]. Elharti, M.-A. (2023). Conception et implémentation en langage P4 de la fonction de passerelle d'accès de la 5G, et caractérisation de ses performances sur un commutateur logiciel [Mémoire de maîtrise, Polytechnique Montréal]. M'Hammedi Alaoui, A. (2023). Résolution de problèmes d'optimisation combinatoire par des approches d'inspiration quantique [Mémoire de maîtrise, Polytechnique Montréal]. Makhroute, E. M. (2023). Conception, implémentation et caractérisation des performances de la fonction passerelle d'accès AGF de la 5G programmée en langage P4 [Mémoire de maîtrise, Polytechnique Montréal]. Dourid, I. (2022). Caractérisation et modélisation d'un réacteur de pyrolyse micro-ondes en vue de son contrôle en temps-réel [Mémoire de maîtrise, Polytechnique Montréal]. Maîtrise professionnelle (5) Cassedanne, Mélanie: Vérification de l'IP Etehrnet MAC Barrette-Laganière, Hubert: Machine de Ising en infonuagique Gravey, Thibaut: Système d'acquisition des données basé sur PYNQ pour des applications en simulation HIL sur cible FPGA à bas coût Ndiongue, Ndeye-Penda: Analyse et détection des attaques par déni de service (DoS) et des attaques de l’homme du milieu (MITM) à l’aide des réseaux de neurones LSTM Tale Kenfack, Maxime Pavix: Extraction et analyse des données 5G pour l'identification des comportements malveillants grâce aux IDS et l'intelligence artificielle Nouv",
  "content_length": 11242,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:16"
}