{
  "name": "Tari Zahir",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/t/tari-professor-zahir",
  "status": "success",
  "content": "Zahir Tari - RMIT University Zahir Tari SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Zahir Tari Professor Zahir Tari Professor See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia zahir.tari@rmit.edu.au ORCID: 0000-0002-1235-9673 Google Scholar LinkedIn Open to Media enquiries Masters Research or PhD student supervision About Prof. Zahir Tari is one of the leading international experts in several core areas of Computer Science, including performance, scalability, and reliability of large-scale systems, as well as cybersecurity of critical systems such as SCADA and Smart Grids. As the Research Director of the RMIT Centre of Cyber Security Research and Innovation (CCSRI), Prof. Tari leads major Research and Development (R&D) activities in cybersecurity across various RMIT colleges, including STEM, COBOL, and Design. He works closely with experienced and early-career researchers at RMIT to address complex cybersecurity challenges from technical, human, and organisational perspectives. Prof. Tari is particularly recognised for his leadership in integrating contextual preferences from both human and system perspectives into cybersecurity concepts and methods. Over the past two decades, he has developed groundbreaking solutions that address core challenges in anomaly detection and the survivability of large-scale systems, as well as their impact on end-users. Some of these innovations have been commercialised through partnerships or research translation, such as MetaCDN. Prof. Tari has secured over AUD 21 million in research funding, including 1 ARC Research Hub (Co-Lead), 1 CRC-P (Lead), 2 ARC LIEF, 19 ARC DP/LP grants, and a large grant from the Department of Industry, Innovation, and Science. He has supervised 31 PhD students to completion and mentored 6 postdoctoral fellows and 3 research assistants. To date, Prof. Tari has published a total of 279 papers (120 in journals and 159 in conferences) and has an h-index of 49 with over 10,800 citations. In the past, Prof. Tari served as Associate Dean (Discipline Head) of the Distributed Systems and Networking (DSN) discipline (now called CSS — Cloud, System, and Security) for over 14 years, managing a large team of academics who contributed to excellence in teaching and research in key areas of Computer Science, including Networking, Security, and Cloud Computing. The discipline was ranked 4 in the 2018 ERA ranking in the field of 0804 Distributed Systems. Its members have also successfully collaborated with various IT industries and have been awarded several funding grants, including CRC-P, ARC Linkage, and Discovery grants. Prof. Tari has been closely collaborating with many local and international IT industries (e.g., Siemens in Germany) on various aspects of Cloud/Edge computing and Cybersecurity technologies. He has successfully led over twelve substantial collaborative projects with local IT industries through the ARC Linkage scheme, CRC-P and ARC Research Hub and some of the foundational work carried out in these projects has led to product commercialisation, such as MetaCDN. More recently, Prof. Tari expanded his industry collaborations to larger enterprises and successfully secured significant funding (over AUD 1 million each) to address new challenges related to the security, performance, and scalability of Blockchain systems. Recently, Prof. Tari was appointed as a member of the ARC College of Experts (CoE), serving from 2022 to 2025. Expand for full bio Collapse bio Research fields 460402 Data and information privacy 460403 Data security and protection 460603 Cyberphysical systems and internet of things Supervisor projects Deep Fusion-Driven Social Network Behavior Analysis for Disaster Management 21 Jul 2025 A Self-Adaptive Streams Processing Framework in Edge Computing for Digital Manufacturing 1 Jul 2025 Fraud Detection in Digital Payment Systems : Adaptive Systems for Longevity 7 Oct 2024 Deep Learning for Fraud Detection in Large-Scale Digital Payments Systems 18 Jul 2024 Anomaly Detection for in Large Dynamic Networks 15 Jul 2024 Security Protection for Green Blockchain Technologies 12 Jan 2024 Multi-Modal Information Fusion for Situational Awareness in Dynamic Environments 24 Nov 2023 Examining the Challenges and Opportunities in developing dApps for Digital Assets Decentralized Exchange (Marketplace) and Management under Regulatory Constraints 24 Oct 2023 Designing a Novel PoST Consensus Protocol for Green Cryptocurrency Platforms 31 Aug 2023 A Regulatory Template Engine for Real-time Constraint Enforcement in Decentralised Finance Platforms 4 Jul 2022 Towards AI Enabled Energy Efficient and Secure Blockchain 3 Jun 2022 Towards a Scalable Consensus Algorithm to Meet the Green Cryptocurrency Requirements 23 May 2022 Towards Effective and Adaptive Anomaly-based Intrusion Detection Methods for Industrial Network Systems 2 Apr 2019 Towards Secure and Efficient Blockchain-based Peer-to-Peer Energy Trading Systems 1 Feb 2019 Towards a Secure and Scalable Blockchain Protocol for Data-Intensive Applications 8 Jan 2019 A Holistic Approach for Efficient Host-based Data Exfiltration Detection 1 Jun 2017 Dynamic resource allocation scheme for distributed stream processing engines 4 Mar 2016 Energy-Efficient Resources Management for Cloud-based Computing Environments 12 Dec 2015 Proactive Auto-Scaling Techniques for Containerised Applications 2 Mar 2015 Reliable and Secure Low Energy Sensed Spectrum Communication for Time Critical CloudComputing Applications 1 Jun 2014 Towards An Efficient Unsupervised Feature Selection Methods for High-Dimensional Data 3 Mar 2014 A System for the Visual Detection and Analysis of Obsessive Compulsive Disorder 4 Mar 2013 Teaching interests Supervisor interest areas: Cybersecurity. Performance. Scalability. Reliability Supervisor projects Effective Countering cyber threats over Smart-Grid Infrastructures.  Smart-grids are the cornerstones of future energy infrastructure. Today's ageing power grids have had their inadequacies exposed by challenges such as: the rising cost of fuels, need for lower greenhouse emissions, and the rise of renewable energy. Tomorrow’s Smart Grids will incorporate increased sensing, communication, and distributed control systems to accommodate renewable generation, EV (Electric Vehicle) loads, peak demand reduction and energy loss minimization. Of the various impediments affecting smart-grids, security is the foremost concern for all stake holders, estimating economic losses at $6B annually. This project aims to research a distributed and multi-granular framework for effective data security that is achieved through anomaly detection over smart-grid sensing systems. This will evaluate cyber threats from a data centric point of view for effective protection, and the framework will be compatible with and cater to the dynamic and non-homogeneous data typically present in multi-faceted smart-grid environments. Preventing Exfiltration of Sensitive Data by Malicious Insiders or Malware. Data exfiltration is the unauthorised leakage of data from computers by sophisticated malware and malicious insiders. Data exfiltration is a serious problem since it may have catastrophic effect on businesses, governments as well as individuals if such exfiltration involves sensitive data. Examples include exfiltration of data involving business inventions, national intelligence, classified research, individual’s credit card and biometric profile. Specifically, data exfiltration has resulted in huge economic losses as well as unprecedented breaches of national security. A study by the Ponemon Institute reported that the average per-incident cost of reported data leakage by businesses was $14 million, and the number of reported data breaches surpassed all previous years. The aim of this project is to develop solutions to detect sensitive data exfiltration attempts by malware, as well as human users, and block those attempts without affecting legitimate users’ normal usage of computers. Low-Latency High-Throughput Computational Models for Heavily Data-Driven. The need to process a huge volume of data during in a small amount of time is dramatically increasing especially as the size of the data moves into Exabyte in the near. While use of such applications was previously confined to the finance sector, it is becoming now prevalent in almost every industry where analytical processing over mass",
  "content_length": 13235,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:16"
}