{
  "name": "Taro Watanabe",
  "homepage": "https://sites.google.com/site/tarowtnb",
  "status": "success",
  "content": "Taro's Home PageSearch this siteEmbedded FilesSkip to main contentSkip to navigationTaro WatanabeI am a professor at Nara Institute of Science and Technology (NAIST) and lead a natural language processing laboratory. I'm mainly working for machine translation, language modeling and other areas, such as machine learning and natural language processing (curriculum vitae). I received B.E. from Kyoto University, M.E. from Kyoto University, M.S. from CMU, and Ph. D. from Kyoto University. I was previously affiliated with ATR, NTT, NICT and Google. You can reach me via taro at is.naist.jp.BookMachine Translation (in Japanese)Talks, Lectures, TutorialsLecture at YANS 2021 [slide].Lecture at ALAGIN 2015 (in Japanese) [introduction, decoding, optimization, deep learning]Short History of SMT. Talk at the 20th anniversary for the Association of NLP (in Japanese) [slide].Lecture at ALAGIN 2014 (in Japanese) [introduction1, introduction2, decoding, scfg, optimization1, optimization2].Grammar Induction for MT. invited talk at IWPT2013 [slide].Statistical Approach for MT. Talk at U. Tokyo (in Japanese) [slide].Optimization for MT. Talk at IBIS2012 [slide].SMT12. talk at HIT-MSRA summer school 2012 [slide].Structures in Statistical Machine Translation. A tutorial talk at NAIST [slide].Cutting Edge in Statistical Machine Translation. A tutorial talk at NLP 2012 (in Japanese) [slide].A set of slides for HIT-MSRA Summer School 2011 [introduction, alignment-model, phrase-model, tree-model].Foundations of Statistical Machine Translation: Past, Present and Future. A tutorial talk at INTERSPEECH 2010 [slide].Statistical Machine Translation Tutorial. A tutorial talk at NLP 2004 (in Japanese) [slide].Activitiesexecutive board member: AACL (2025-2026)editorial board (action editor): Computational Linguistics (2013-2015), Machine Translation (2016-2021), TASL (2018-2021), TALLIP (2017-), ARR (2021-), TACL (2022-)program (co-)chair: IJCNLP2017(senior) area (co-)chair:  ACL2008, ACL2011, EMNLP2013, ACL2015, COLING2016, NAACL2018, EMNLP2018, ACL2019, ACL2020, AACL2020, EMNLP2021, ACL2022, EMNLP2022 and manyco-organizer: MONOMT (AMTA2012 workshop)committee: IPSJ-Kansai (2012-2013, in Japanese)program committee: NLP2013, NLP2014 (in Japanese)Softwaretrance: a transition-based neural network constituent parsercicada: a hypergraph-based machine translation toolkit which supports {string,tree}-to-{string, tree} modelexpgram: yet-another ngram toolkit with succinct storagepialign: phrasal ITG aligner for phrase table inductionlader: latent derivation reorder for pre-reordering of MT inputa head-driven transition-based dependency parserSupervising, CollaboratingStudents: Many.Interns: Katsuhiko Hayashi (2008, 2010-2012, NAIST), Graham Neubig (2010-2012, Kyoto U.),  Isamu Fujiwara (2011, Tottori U.), Daniel Flannery (2011, Kyoto U.), Lemao Liu (2012-2013, Harbin Institute of Tech.), Hidetaka Kamigaito (2013, 2014-2015, Tokyo Institute of Tech.), Hitoshi Otsuki (2014-2015, Kyoto Institute of Tech.)Visiting researchers: Conghui Zhu (2012-2013, Harbin Institute of Tech.)Colleagues: Chooi-Ling Goh (2009,2011), Akihiro Tamura (2011-2014), Hideya Mino (2013-2015), Youzheng Wu (2014), Shumpei Kubosawa (2014-2015), Lemao Liu (2014-2015)Publications2025Aitaro Yamamoto, Hiroyuki Otomo, Hiroki Ouchi, Shohei Higashiyama, Hiroki Teranishi, Hiroyuki Shindo and Taro Watanabe. 2025. Graph-Structured Trajectory Extraction from Travelogues. ACL 2025. [paper]Zhi Qu, Yiran Wang, Jiannan Mao, Chenchen Ding, Hideki Tanaka, Masao Utiyama and Taro Watanabe. 2025.  Registering Source Tokens to Target Language Spaces in Multilingual Neural Machine Translation. ACL 2025. [paper]Yusuke Ide, Joshua Tanner, Adam Nohejl, Jacob Hoffman, Justin Vasselli, Hidetaka Kamigaito and Taro Watanabe. 2025. CoAM: Corpus of All-Type Multiword Expressions. ACL 2025. [paper]Hidetaka Kamigaito, Hiroyuki Deguchi, Yusuke Sakai, Katsuhiko Hayashi and Taro Watanabe. 2025. Diversity Explains Inference Scaling Laws: Through a Case Study of Minimum Bayes Risk Decoding. ACL 2025. [paper]Yusuke Sakai, Hidetaka Kamigaito and Taro Watanabe. 2025. Revisiting Compositional Generalization Capability of Large Language Models Considering Instruction Following Ability. ACL 2025. [paper]Shintaro Ozaki, Kazuki Hayashi, Miyu Oba, Yusuke Sakai, Hidetaka Kamigaito and Taro Watanabe. 2025. BQA: Body Language Question Answering Dataset for Video Large Language Models. ACL 2025. [paper]Takumi Goto, Yusuke Sakai and Taro Watanabe. 2025. Rethinking Evaluation Metrics for Grammatical Error Correction: Why Use a Different Evaluation Process than Human?. ACL 2025. [paper]Yusuke Sakai, Takumi Goto and Taro Watanabe. 2025. IMPARA-GED: Grammatical Error Detection is Boosting Reference-free Grammatical Error Quality Estimator. ACL 2025 Findings. [paper]Haruki Sakajo, Yusuke Ide, Justin Vasselli, Yusuke Sakai, Yingtao Tian, Hidetaka Kamigaito and Taro Watanabe. 2025. Dictionaries to the Rescue: Cross-Lingual Vocabulary Transfer for Low-Resource Languages Using Bilingual Dictionaries. ACL 2025 Findings. [paper]Takumi Goto, Yusuke Sakai, and Taro Watanabe. 2025. gec-metrics: A Unified Library for Grammatical Error Correction Evaluation. ACL 2025 System Demonstrations. [paper]Zhi Qu, Chenchen Ding and Taro Watanabe. 2025. Languages Transferred Within the Encoder: On Representation Transfer in Zero-Shot Multilingual Translation. MT Summit 2025.Genta Indra Winata, Frederikus Hudi, Patrick Amadeus Irawan, David Anugraha, Rifki Afina Putri, WANG YUTONG, Adam Nohejl, Ubaidillah Ariq Prathama, Nedjma Ousidhoum, Afifa Amriani, Anar Sabuhi Rzayev, Anirban Das, Ashmari Pramodya, Aulia Adila, Bryan Wilie, Candy Olivia Mawalim, CHENG Ching Lam, Daud Abolade, Emmanuele Chersoni, Enrico Santus, Fariz Ikhwantri, Garry Kuwanto, Hanyang Zhao, Haryo Akbarianto Wibowo, Holy Lovenia, Jan Christian Blaise Cruz, Jan Wira Gotama Putra, Junho Myung, Lucky Susanto, Maria Angelica Riera Machin, Marina Zhukova, Michael Anugraha, Muhammad Farid Adilazuarda, Natasha Christabelle Santosa, Peerat Limkonchotiwat, Raj Dabre, Rio Alexander Audino, Samuel Cahyawijaya, Shi-Xiong Zhang, Stephanie Yulia Salim, Yi Zhou, Yinxuan Gui, David Ifeoluwa Adelani, En-Shiun Annie Lee, Shogo Okada, Ayu Purwarianti, Alham Fikri Aji, Taro Watanabe, Derry Tanti Wijaya, Alice Oh and Chong-Wah Ngo. 2025. WorldCuisines: A Massive-Scale Benchmark for Multilingual and Multicultural Visual Question Answering on Global Cuisines. NAACL 2025. [paper]Yusuke Ide, Yuto Nishida, Justin Vasselli, Miyu Oba, Yusuke Sakai, Hidetaka Kamigaito and Taro Watanabe. 2025. How to Make the Most of LLMs’ Grammatical Knowledge for Acceptability Judgments. NAACL 2025. [paper]Peinan Zhang, Yusuke Sakai, Masato Mita, Hiroki Ouchi and Taro Watanabe. 2025. AdTEC: A Unified Benchmark for Evaluating Text Quality in Search Engine Advertising. NAACL 2025. [paper]Haruki Sakajo, Yusuke Sakai, Hidetaka Kamigaito and Taro Watanabe. 2025. Tonguescape: Exploring Language Models Understanding of Vowel Articulation. NAACL 2025. [paper]Shintaro Ozaki, Kazuki Hayashi, Yusuke Sakai, Hidetaka Kamigaito, Katsuhiko Hayashi and Taro Watanabe. 2025. Towards Cross-Lingual Explanation of Artwork in Large-scale Vision Language Models. NAACL 2025 Findings. [paper]Wataru Hashimoto, Hidetaka Kamigaito and Taro Watanabe. 2025. Efficient Nearest Neighbor based Uncertainty Estimation for Natural Language Processing Tasks. NAACL 2025 Findings. [paper]Yuto Nishida, Makoto Morishita, Hiroyuki Deguchi, Hidetaka Kamigaito and Taro Watanabe. 2025. Long-Tail Crisis in Nearest Neighbor Language Models. NAACL 2025 Findings. [paper]Kosuke Doi, Katsuhito Sudoh, Satoshi Nakamura and Taro Watanabe. 2025. Enhancing Automated Essay Scoring with Grammatical Features using Multi-task Learning and Item Response Theory. Journal of Natural Language Processing. [paper]Zhiyu Guo, Hidetaka Kamigaito and Taro Watanabe. 2025. Dependency-Aware Semi-Structured Sparsity of GLU Variants in Large Language Models. Transactions on Machine Learning Research. [paper]Justin Vasselli, Adam Nohejl and Taro Watanabe. 2025. Measuring the Robustness of Reference-Free Dialogue Evaluation Systems. In COLING 2025. [paper]Hibiki Nakatani, Hiroki Teranishi, Shohei Higashiyama, Yuya Sawada, Hiroki Ouchi and Taro Watanabe. 2025. A Text Embedding Model with Contrastive Example Mining for Point-of-Interest Geocoding. In COLING 2025. [paper]Adam Nohejl, Frederikus Hudi, Eunike Andriani Kardinata, Shintaro Ozaki, Maria Angelica Riera Machin, Hongyu Sun, Justin Vasselli and Taro Watanabe. 2025. Beyond Film Subtitles: Is YouTube the Best Approximation of Spoken Vocabulary?. In COLING 2025. [paper]Iqra Ali, Jesse Atuhurra, Hidetaka Kamigaito and Taro Watanabe. 2025. HLU: Human Vs LLM Generated Text Detection Dataset for Urdu at Multiple Granularities. In COLING 2025. [paper]Kazuki Hayashi, Kazuma Onishi, Toma Suzuki, Yusuke Ide, Seiji Gobara, Shigeki Saito, Yusuke Sakai, Hidetaka Kamigaito, Katsuhiko Hayashi and Taro Watanabe. 2025. Evaluating Image Review Ability of Vision Language Models. In COLING 2025. [paper]Zhiyu Guo, Hidetaka Kamigaito and Taro Watanabe. 2025. Dependency-Aware Semi-Structured Sparsity of GLU Variants in Large Language Models. In Transactions on Machine Learning Research. [paper]2024Seiji Gobara, Hidetaka Kamigaito and Taro Watanabe. 2024. Do LLMs Implicitly Determine the Suitable Text Difficulty for Users?. In PACLIC 38 (to appear).Hiroyuki Deguchi, Yusuke Sakai, Hidetaka Kamigaito and Taro Watanabe. 2024. mbrs: A Library for Minimum Bayes Risk Decoding. In EMNLP 2024 System Demonstration. [paper]Wataru Hashimoto, Hidetaka Kamigaito and Taro Watanabe. 2024. Are Data Augmentation Methods in Named Entity Recognition Applicable for Uncertainty Estimation?. In EMNLP 2024.  [paper]Miyu Oba, Yohei Oseki, Akiyo Fukatsu, Akari Haga, Hiroki Ouchi, Taro Watanabe and Saku Sugawara. 2024. Can Language Models Induce Grammatical Knowledge from Indirect Evidence?. In EMNLP 2024.  [pa",
  "content_length": 38819,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:18"
}