{
  "name": "Taskin Padir",
  "homepage": "https://coe.northeastern.edu/people/padir-taskin",
  "status": "success",
  "content": "Taskin Padir - Northeastern University College of Engineering Download Taskin Padir Professor, Electrical and Computer Engineering Amazon Scholar, Amazon Contact t.padir@northeastern.edu 360 Huntington Avenue Boston, Massachusetts 02115 Social Media googlescholar linkedin youtube Office 120 EXP 617.373.8114 Lab EXP 101 Related Links Robotics and Intelligent Vehicles Research Laboratory Research Focus Experiential robotics, human-robot teaming at the extremes, embodied artificial intelligence Biography Research Publications Related News Toggle Accordion Biography About Taskin Padir holds concurrent positions as a Professor in the Electrical and Computer Engineering Department at Northeastern University, and an Amazon Scholar. He received his PhD and MS degrees from Purdue University. He was the Founding Director of the Institute for Experiential Robotics at Northeastern University. His research focuses on shared autonomy, human-in-the-loop robotics, humanoids, collaborative robotics, embodied AI, and human-robot teaming at the extremes. He led teams at the DARPA Robotics Challenge, NASA Sample Return Challenge. His research was funded by NSF, DARPA, NASA, DoD, DoE, ONR, USACE, the ARM Institute, Commonwealth of Massachusetts, and numerous industry partners including Amazon Robotics, Verizon, MathWorks, and Intel. Education PhD (2004), Purdue University, Electrical and Computer Engineering MS (1997), Purdue University, Electrical and Computer Engineering BS (1993), Middle East Technical University, Electrical and Electronic Engineering Honors & Awards 2024 Faculty Research Team Award 2023 Impact Award 2022 Amazon Scholar 2022 Faculty Research Team Award 2020 Faculty Research Team Award Kalenian Award for Entrepreneurial Spirit Romeo L. Moruzzi Young Faculty Award for Innovation in Undergraduate Education Leadership Positions Executive Committee of the Robotics and Remote Systems Division of the American Nuclear Society, 2021-2022 Editor, International Conference in Robotics and Automation, 2019-2024 Professional Affiliations IEEE Robotics and Automation Control Systems Computer; Engineering in Medicine and Biology ACM Association for Unmanned Vehicle Systems International Sigma Xi Toggle Accordion Research Research Overview Experiential robotics, human-robot teaming at the extremes, embodied artificial intelligence Robotics and Intelligent Vehicles Research Laboratory The Robotics and Intelligent Vehicles Research Laboratory (RIVeR Lab) at Northeastern University, originally founded in 2010 at Worcester Polytechnic Institute, aims to advance the capabilities of autonomous robots and intelligent vehicles. Research activities focus on design, analysis, implementation and control of intelligent vehicles, mobile robots, walking robots, manipulators and adaptive systems. Aligned with Northeastern University core values of contribution, diversity, engagement, integrity, and opportunity, our projects bring science and technology together with real-world problems. RIVeR Lab Selected Research Projects Co-worker Robots to Impact Seafood Processing (CRISP): Designs, Tools and Methods for Enhanced Worker Experience – Principal Investigator, NSF Future of Work, Human-Technology Frontier Automation for Characterization and Evaluation of Personal Protective Equipment in Manufacturing Plants – Principal Investigator, ARM Institute (DoD) Coordination of Dyadic Object Handover for Human-Robot Interactions – Co-Principal Investigator, NSF M3X Research Centers and Institutes Director Institute for Experiential Robotics Department Research Areas Robotics Toggle Accordion Publications Selected Publications R. Luo, M. Zolotas, D. Moore and T. Padır, “User-customizable Shared Control for Robot Teleoperation via Virtual Reality,” 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), Abu Dhabi, United Arab Emirates, 2024, pp. 12196-12203, doi: 10.1109/IROS58592.2024.10802544. A. Trivedi, M. Zolotas, A. Abbas, S. Prajapati, S. Bazzi and T. Padır, “A Probabilistic Motion Model for Skid-Steer Wheeled Mobile Robot Navigation on Off-Road Terrains,” 2024 IEEE International Conference on Robotics and Automation (ICRA), Yokohama, Japan, 2024, pp. 12599-12605, doi: 10.1109/ICRA57147.2024.10611343. A. Allison, N. Hanson, S. Wicke and T. Padır, “HASHI: Highly Adaptable Seafood Handling Instrument for Manipulation in Industrial Settings,” 2024 IEEE International Conference on Robotics and Automation (ICRA), Yokohama, Japan, 2024, pp. 4191-4197, doi: 10.1109/ICRA57147.2024.10611022. Toggle Accordion Related News Faculty Nov 06, 2025 Autonomous Wheelchair Project Positively Impacts Individuals ECE Professor Taskin Padir talks about an AI-powered autonomous wheelchair that could be an impactful technological advancement for individuals with quadriplegia and other physical conditions. Faculty Oct 29, 2025 Patent for the Next Generation of Smart Robotic Grippers ECE Professor Taskin Padir, Associate Professor Kris Dorsey, and Distinguished Professor Deniz Erdogmus were awarded a patent for “Systems and methods for robotic grippers with fiber optic spectroscopy.” Faculty Oct 22, 2025 SpaceX and NASA Partnership Makes Positive Progress in Aerospace Industry ECE Professor Taskin Padir talks about NASA’s partnership with SpaceX and how it will positively progress NASA’s research and help advance technology in the aerospace industry. Spotlight Story Aug 18, 2025 Discovering a Passion for Research Rania Alshawabkeh, E’25, MS’26, electrical and computer engineering, had the opportunity to be a part of four different research labs during her academic career. With each experience, she was able to expand her research skills and abilities and discover her passion for research. Students Feb 07, 2025 Spring 2025 PEAK Experiences Awardees for Undergrad Research Several COE, COS, and Khoury students mentored by COE faculty are recipients of the Spring 2025 PEAK Experiences Awards from Northeastern’s Office of Undergraduate Research and Fellowships. Faculty Jul 19, 2024 Innovating Through Artificial Intelligence Massachusetts Gov. Maura Healey, Boston Mayor Michelle Wu, state economic development and technology leaders, and other officials visited Northeastern to learn from faculty how AI can solve some of the most pressing issues in the state and the world. CEE Distinguished Professor Auroop Ganguly, ECE/Khoury Distinguished Professor Jennifer Dy, and ECE Professor Taskin Padir were in attendance. MS Jul 10, 2024 Robotics Student Awarded Amazon Robotics Day One Fellowship Oscar De La Garza, MS’25, robotics, is participating in an internship at Amazon Robotics as part of being named one of just seven students awarded the 2023 Amazon Robotics Day One Fellowship. The fellowship supports emerging leaders in science from backgrounds underrepresented in STEM, awarding scholarships, mentorship, and career opportunities. Undergraduate May 08, 2024 2024 URF Scholars Recipients Several engineering students received 2024 URF Scholars Awards from Northeastern’s Office of Undergraduate Research and Fellowships. URF Scholars are students who are graduating this year and who have earned a PEAK Experiences Award, applied for a distinguished fellowship, or participated in graduate school advising. Faculty Feb 01, 2024 Faculty and Staff Awards 2024 The College of Engineering recognized faculty and staff at the annual faculty and staff awards event and thanked everyone for their hard work and dedication in support of our students, college, and university during the 2023-2024 academic year. View award recipients and photo gallery. Faculty Nov 30, 2023 New Robotics Lab To Lead Innovative Research The newly opened space in EXP for the Institute of Experiential Robotics will allow for interdisciplinary collaboration in the advancement of robotics. View All Related News",
  "content_length": 7863,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:22"
}