{
  "name": "Tasmina Islam",
  "homepage": "https://www.kcl.ac.uk/people/tasmina-islam",
  "status": "success",
  "content": "Tasmina Islam | King's College London Skip to main contentDr Tasmina Islam Senior Lecturer in Cybersecurity EducationResearch interestsComputer scienceContact detailstasmina.islam@kcl.ac.ukBiographyTasmina is a Senior Lecturer in Cybersecurity Education in the Department of Informatics at King's College London. Before joining King's she was a Postdoctoral Research Fellow in an EPSRC-funded project on Cybesecurity at Kent Interdisciplinary Research Centre for Cybersecurty (ACE-CSR), University of Kent.  She also obtained her PhD from the same institution in Biomeric security. Research Interests Cybersecurity Privacy and security Digital forensics Human factors in cybersecurity Biometrics Behavioural biometrics and security PublicationsResearchResearchKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.CybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.Security HubThe Security Hub consolidates the research related to securityComputing Education Research Centre (CERC)The Computing Education Research Centre at King's College London carries out research, develops tools, conducts studies, creates pedagogy, and supervises PhD projects related to computer science education.PublicationsResearchResearchKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.CybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.Security HubThe Security Hub consolidates the research related to securityComputing Education Research Centre (CERC)The Computing Education Research Centre at King's College London carries out research, develops tools, conducts studies, creates pedagogy, and supervises PhD projects related to computer science education.(N)6.04Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering SciencesComputing Education Research Centre (CERC)",
  "content_length": 2374,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:21"
}