{
  "name": "Tatjana Chavdarova",
  "homepage": "https://chavdarova.github.io",
  "status": "success",
  "content": "Tatjana Chavdarova – Game Theory, Machine Learning, Variational Inequalities Hello! I’m Tatjana (pronounced /tatiana/), currently a Visiting Professor in the Department of Electronics, Information and Bioengineering (DEIB) at Politecnico di Milano (Polimi), where I research and teach in the areas of game theory, machine learning, variational inequalities, multi-agent systems, and optimization algorithms. I collaborate with Nicola Gatti and Nicolò Cesa-Bianchi. I hold a Ph.D. from EPFL, and Idiap, advised by François Fleuret. During my doctoral studies, I interned at (i) Mila with Yoshua Bengio and Simon Lacoste-Julien, and at (ii) DeepMind under Irina Jurenka (Higgins). After my Ph.D., I was a Postdoctoral Researcher at EPFL’s MLO Lab with Martin Jaggi, and later at UC Berkeley EECS with Michael Jordan. » We’re excited to host the DynaFront Workshop at NeurIPS 2025! Visit the workshop website for details. » The Games in ML '25 course materials are available here. Research Interests I work at the intersection of game theory and machine learning, developing AI systems that learn, strategize, and interact in multi-agent environments. My research spans: Learning in Games – How do AI models (e.g., neural networks) adapt and compete in strategic settings? Can we design better learning algorithms for stability and efficiency? Reinforcement Learning – learning dynamics in competitive multi-agent and actor-critic settings. Generative Modeling & Robustness – Studing and improving generalization and adversarial resilience in AI. Algorithmic Game Theory – modeling complex multi-agent systems such as from microeconomics, mechanism design, and developing learning algorithms. » Outside of research, I’m passionate about the broader implications of games—not just for AI, but for developing human inteligence and society. (For fun: I recommend this talk by Kelly Clancy on how games shape our world!) News: second-half, 2025: Dynamical systems tools for ML are in vogue! We're hosting a NeurIPS workshop titled Dynamics at the Frontiers of Optimization, Sampling, and Games (DynaFront). Also super excited about the special 20th anniversary edition of the WiML workshop -- keep an eye on WiML announcements ;) See you in San Diego! July, 2025: I'll be at ICML! Come check out our work on game-theoretic federated learning, where agents operate without full knowledge of others' strategies. We're also organizing the WiML workshop/symposium on Wednesday and co-hosting a social event on Thursday—plus more! Looking forward to seeing you in Vancouver! May, 2025: I am giving \"Games in Machine Learning\" PhD-level course at PoliMi, starting from late May. Course materials are available here! Sept., 2024: Very excited to be working with Nicola Gatti, Alberto Marchesi, Matteo Castiglioni, and the remaining game theory and reinforcement learning team at PoliMi and Milano! July, 2024: I will be at the ISMP conference and talk about HRDEs for VIs (slides below). See you in Montrèal! PS - if you're attending ICML, don't miss out WiML's events! Jan, 2024: You have two- or multi-player problem with constraints? use our ACVI method -> accepted at ICLR 2024. See you in Vienna! 🏅 Thanks to the Swiss National Science Foundation for supporting my research, through the Early.Postdoc.Mobility (in 2021) and the Postdoc.Mobility (in 2023) fellowships. Selected Research (preprint) The Invisible Handshake: Tacit Collusion between Adaptive Market Agents Luigi Foscari, Emanuele Guidotti, Nicolò Cesa-Bianchi, Tatjana Chavdarova, Alfio Ferrara ArXiv, 2025 • Paper • BibTex @article{foscari2025invisiblehandshake, title = {The Invisible Handshake: Tacit Collusion between Adaptive Market Agents}, author = {Luigi Foscari and Emanuele Guidotti and Nicolò Cesa-Bianchi and Tatjana Chavdarova and Alfio Ferrara}, journal = {ArXiv:2510.15995}, year = {2025}, } (workshop) Understanding Lookahead Dynamics Through Laplace Transform Aniket Sanyal and Tatjana Chavdarova HiLD-2025 Workshop at ICML, 2025 • ArXiv • BibTex @article{sanyal2025, title = {Understanding Lookahead Dynamics Through Laplace Transform}, author = {Aniket Sanyal and Tatjana Chavdarova}, journal = {ArXiv:2506.13712}, year = {2025}, } Decoupled SGDA for Games with Intermittent Strategy Communication Ali Zindari, Parham Yazdkhasti, Anton Rodomanov, Tatjana Chavdarova, Sebastian U. Stich ICML, 2025 • Paper • BibTex @inproceedings{zindari2025decoupled, title = {Decoupled SGDA for Games with Intermittent Strategy Communication}, author = {Ali Zindari and Parham Yazdkhasti and Anton Rodomanov and Tatjana Chavdarova and Sebastian U Stich}, booktitle = {ICML}, year = {2025}, } (preprint) Learning Variational Inequalities from Data: Fast Generalization Rates under Strong Monotonicity Eric Zhao, Tatjana Chavdarova, Michael I. Jordan ArXiv, 2024 • Paper • BibTex @article{zhao2024learningvariationalinequalities, title = {Learning Variational Inequalities from Data: Fast Generalization Rates under Strong Monotonicity}, author = {Eric Zhao and Tatjana Chavdarova and Michael I. Jordan}, journal = {ArXiv:2410.20649}, year = {2024}, } (workshop) Variational Inequality Methods for Multi-Agent Reinforcement Learning: Performance and Stability Gains Baraah A. M. Sidahmed, Tatjana Chavdarova OWA-2024 Workshop at NeurIPS, 2024 • Paper • BibTex @article{sidahmed2024vimarl, title = {Variational Inequality Methods for Multi-Agent Reinforcement Learning: Performance and Stability Gains}, author = {Baraah A. M. Sidahmed and Tatjana Chavdarova}, journal = {ArXiv:2410.07976}, year = {2024}, } (workshop) On the Hypomonotone Class of Variational Inequalities Khaled Alomars, Tatjana Chavdarova OPT-2024 Workshop at NeurIPS, 2024 • Paper • BibTex @article{alomar2024hypomonotone, title = {On the Hypomonotone Class of Variational Inequalities}, author = {Khaled Alomar and Tatjana Chavdarova}, journal = {ArXiv:2410.09182}, year = {2024}, } (workshop) Decoupled Stochastic Gradient Descent for N-Player Games Ali Zindari, Parham Yazdkhasti, Tatjana Chavdarova, Sebastian U. Stich ARLET Workshop at ICML, 2024 • Paper • BibTex @article{zindari2024decoupled, title = {Decoupled Stochastic Gradient Descent for N-Player Games}, author = {Ali Zindari and Parham Yazdkhasti and Tatjana Chavdarova and Sebastian U Stich}, journal = {ICML 2024 Workshop: Aligning Reinforcement Learning Experimentalists and Theorists}, year = {2024}, } A Primal-Dual Approach to Solving Variational Inequalities with General Constraints Tatjana Chavdarova*, Tong Yang*, Matteo Pagliardini, Michael I. Jordan ICLR, 2024 • Paper • Poster • Code • BibTex @inproceedings{chavdarova2024acvi, title = {A Primal-dual Approach for Solving Variational Inequalities with General-form Constraints}, author = {Chavdarova, Tatjana and Yang, Tong and Pagliardini, Matteo and Jordan, Michael I.}, booktitle = {ICLR}, year = {2024}, } Last-Iterate Convergence of Saddle Point Optimizers via High-Resolution Differential Equations Tatjana Chavdarova*, Michael I. Jordan*, Manolis Zampetakis* MTA journal, 2023 & early version at OPT NeurIPS workshop, 2021 • Paper • ArXiv • Poster • BibTex @article{chavdarova2023hrdes, title = {Last-Iterate Convergence of Saddle Point Optimizers via High-Resolution Differential Equations}, author = {Tatjana Chavdarova and Michael I. Jordan and Manolis Zampetakis}, journal = {Minimax Theory and its Applications}, year = {2023}, } Solving Constrained Variational Inequalities via a First-order Interior Point-based Method—Notable Paper (top 25%) Tong Yang*, Michael I. Jordan*, Tatjana Chavdarova* ICLR, 2023 • Paper • Slides • Poster • Code • BibTex @inproceedings{yang2023acvi, title = {Solving Constrained Variational Inequalities via a First-order Interior Point-based Method}, author = {Tong Yang and Michael I. Jordan and Tatjana Chavdarova}, booktitle = {ICLR}, url={https://openreview.net/forum?id=RQY2AXFMRiu}, year = {2023}, } (workshop) Continuous-time Analysis for Variational Inequalities: An Overview and Desiderata Tatjana Chavdarova*, Ya-Ping Hsieh*, Michael I. Jordan* Continuous time methods for ML, ICML workshop, 2022 • ArXiv • Poster • BibTex @article{chavdarova2022contVIs, title = {Continuous-time Analysis for Variational Inequalities: An Overview and Desiderata}, author = {Tatjana Chavdarova and Ya-Ping Hsieh and Michael I. Jordan}, booktitle= {ICML Workshop on Continuous time methods for Machine Learning}, year = {2022}, } (workshop) The Peril of Popular Deep Learning Uncertainty Estimation Methods Yehao Liu*, Matteo Pagliardini*, Tatjana Chavdarova, Sebastian U. Stich BDL NeurIPS workshop, 2021 • Paper • Code • Poster •\tBibTex @article{liu2021peril, title = {The Peril of Popular Deep Learning Uncertainty Estimation Methods}, author = {Yehao Liu and Matteo Pagliardini and Tatjana Chavdarova and Sebastian U. Stich}, journal = {NeurIPS Workshop on Bayesian Deep Learning}, year = {2021}, } (workshop) Improved Adversarial Robustness via Uncertainty Targeted Attacks Gilberto Manunza*, Matteo Pagliardini*, Martin Jaggi, Tatjana Chavdarova UDL ICML workshop, 2021 • Paper • Poster •\tBibTex @article{ManunzaPagliardini2021, title = {Improved Adversarial Robustness via Uncertainty Targeted Attacks}, author = {Gilberto Manunza and Matteo Pagliardini and Martin Jaggi and Tatjana Chavdarova}, journal = {ICML Workshop on Uncertainty and Robustness in Deep Learning}, year = {2021}, url = {http://www.gatsby.ucl.ac.uk/~balaji/udl2021/accepted-papers/UDL2021-paper-096.pdf} } Semantic Perturbations with Normalizing Flows for Improved Generalization Oguz K Yüksel, Sebastian U. Stich, Martin Jaggi, Tatjana Chavdarova ICCV 2021 • Paper • Code • Video •\tBibTex @InProceedings{Yuksel_2021_ICCV, author = {Y\\\"uksel, Oguz Kaan and Stich, Sebastian U. and Jaggi, Martin and Chavdarova, Tatjana}, title = {Semantic Perturbations With Normalizing Flows for Improved Generalization}, booktitle = {Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV)}, month = {October}, year = {2021}, pa",
  "content_length": 19770,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:20"
}