{
  "name": "Tatsuya Harada",
  "homepage": "http://www.mi.t.u-tokyo.ac.jp/harada",
  "status": "success",
  "content": "Tatsuya Harada Tatsuya Harada Doctor of Engineering, Professor Research Center for Advanced Science and Technology The University of Tokyo Team leader at RIKEN AIP Vice director of Research Center for Medical Bigdata at National Institute of Informatics (NII), Japan Japanese page is here. News Sept. 19, 2025. Three papers have been accepted for publication in NeurIPS 2025. May 1, 2025. One paper has been accepted for publication in ICML 2025. Feb. 27, 2025. Two papers have been accepted for publication in CVPR 2025. Jan. 23, 2025. One paper has been accepted for publication in ICLR 2025. Sept. 26, 2024. One paper has been accepted for publication in NeurIPS 2024. July 1, 2024. Three papers have been accepted for publication in ECCV 2024. May 2, 2024. One paper has been accepted for publication in ICML 2024. Mar. 14, 2024. One paper has been accepted for publication in NAACL 2024. Jan. 17, 2024. One paper has been accepted for publication in ICLR 2024. Dec. 16, 2023. Our paper has been accepted for publication in IJCV. Dec. 9, 2023. Two papers have been accepted for publication in AAAI 2024. Sep. 22, 2023. One paper has been accepted for publication in NeurIPS 2023. July. 14, 2023. One paper has been accepted (1 oral) for publication in ICCV 2023. Sep. 15, 2022. One paper has been accepted for publication in NeurIPS 2022. July. 4, 2022. Four papers have been accepted for publication in ECCV 2022. Mar. 3, 2022. Three papers have been accepted for publication in CVPR 2022. Dec. 1, 2021. One paper has been accepted for publication in AAAI 2022. July. 23, 2021. Two papers have been accepted for publication in ICCV 2021. Mar. 4, 2021. Two papers have been accepted for publication in CVPR 2021. Feb. 28, 2021. Two papers have been accepted for publication in ICRA 2021. Jan. 13, 2021. One paper has been accepted for publication in ICLR 2021. Dec. 2, 2020. One paper has been accepted for publication in AAAI 2021. Sep. 26, 2020. One paper has been accepted for publication in NeurIPS 2020. July. 3, 2020. One paper has been accepted (1 spotlight) for publication in ECCV 2020. Feb. 24, 2020. Two papers have been accepted (1 oral, 1 poster) for publication in CVPR 2020. Dec. 20, 2019. One paper has been accepted for publication in ICLR 2020. Nov. 11, 2019. One paper has been accepted for publication in AAAI 2020. July 23, 2019. Three papers have been accepted for publication in ICCV 2019. Feb. 25, 2019. Five papers have been accepted (3 orals, 2 posters) for publication in CVPR 2019. Jul. 3, 2018. Two papers have been accepted for publication in ECCV 2018. Feb. 19, 2018. Five papers have been accepted (1 oral, 3 spotlights, 1 poster) for publication in CVPR 2018. Jan. 31, 2018. Two papers have been accepted for publication in ICLR 2018. Oct. 26, 2017. We got Honorable Mention Open source software Award 2017 for WebDNN at ACM Multimedia 2017. July 17, 2017. Our paper has been accepted for publication in ICCV 2017. May 28, 2017. We have released WebDNN which executes DNN on a modern browser without installing any software. May 25, 2017. My textbook \"image recognition (in Japanese)\" has been published. May 13, 2017. Our paper has been accepted for publication in ICML 2017. June 26, 2016. We win the VQA challenge (Abstract Scenes) at CVPR 2016, Las Vegas, USA. March 5, 2016. Three papers have been accepted for publication in CVPR 2016. Dec. 10, 2015. Third place in Object Detection (DET) with \"external\" data, ImageNet Large Scale Visual Recognition Challenge 2015 (ILSVRC2015) Sep. 3, 2015. Our paper has been accepted for publication in ICCV 2015. April 13, 2014. Our paper has been accepted for publication in ICML 2014. Feb. 25, 2014. Two papers have been accepted for publication in CVPR 2014. Projects Visual recognition Machine learning Multimedia learning (vision, natural language, sound, etc.) Causality Intelligent robot Teaching May 31, 2017. Special Topics in Mechano‐Informatics II[pdf] Publications 2025 Ryo Umagami, Liu Yue, Xuangeng Chu, Ryuto Fukushima, Tetsuya Narita, Yusuke Mukuta, Tomoyuki Takahata, Jianfei Yang, Tatsuya Harada. Intend to Move: A Dataset for Intention and Scene Aware Human Motion Prediction. The Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS), accepted, 2025. Shuhong Liu, Lin Gu, Ziteng Cui, Xuangeng Chu, Tatsuya Harada. I2-NeRF: Learning Neural Radiance Fields Under Physically-Grounded Media Interactions. The Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS), accepted, 2025. Wenjun Huang, Ziteng Cui, Yinqiang Zheng, Yirui He, Tatsuya Harada, Mohsen Imani. Dr. RAW: Towards General High-Level Vision from RAW with Efficient Task Conditioning. The Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS), accepted, 2025. Haruki Abe, Takayuki Osa, Yusuke Mukuta, Tatsuya Harada. Analysis of Learning Dynamics on Heterogeneous Robot Datasets with Suboptimal Data. Workshop on Making Sense of Data in Robotics: Composition, Curation, and Interpretability at Scale at CoRL 2025, accepted, 2025. Xuangeng Chu, Nabarun Goswami, Ziteng Cui, Hanqin Wang, Tatsuya Harada. ARTalk: Speech-Driven 3D Head Animation via Autoregressive Model. SIGGRAPH Asia, accepted, 2025. Tomoyuki Araki, Yusuke Mukuta, Takayuki Osa, Tatsuya Harada. Few-shot Imitation Learning by Variable-length Trajectory Retrieval from a Large and Diverse Dataset. IEEE-RAS 24th International Conference on Humanoid Robots (Humanoids), accepted, 2025. Nabarun Goswami, Tatsuya Harada. FUSE: Universal Speech Enhancement using Multi‐Stage Fusion of Sparse Compression and Token Generation Models for the URGENT 2025 Challenge. Interspeech, accepted, 2025. Nabarun Goswami, Yusuke Mukuta, Tatsuya Harada. HyperVQ: MLR-based Vector Quantization in Hyperbolic Space. Transactions on Machine Learning Research (TMLR), accepted, 2025. Nabarun Goswami, Hanqin Wang, Tatsuya Harada. EDM-TTS: Efficient Dual-Stage Masked Modeling for Alignment-Free Text-to-Speech Synthesis. Transactions on Machine Learning Research (TMLR), accepted, 2025. Motoki Omura, Yusuke Mukuta, Kazuki Ota, Takayuki Osa, Tatsuya Harada. Offline Reinforcement Learning with Wasserstein Regularization via Optimal Transport Maps. Reinforcement Learning Conference (RCL), accepted, 2025. Motoki Omura, Kazuki Ota, Takayuki Osa, Yusuke Mukuta, Tatsuya Harada. Gradual Transition from Bellman Optimality Operator to Bellman Operator in Online Reinforcement Learning. Forty-second International Conference on Machine Learning (ICML), accepted, 2025. Dexuan Zhang, Thomas Westfechtel, Tatsuya Harada. A Theory of Learning Unified Model via Knowledge Integration from Label Space Varying Domains. Conference on Computer Vision and Pattern Recognition (CVPR), accepted, 2025. Ziteng Cui, Xuangeng Chu, Tatsuya Harada. Luminance-GS: Adapting 3D Gaussian Splatting to Challenging Lighting Conditions with View-Adaptive Curve Adjustment. Conference on Computer Vision and Pattern Recognition (CVPR), accepted, 2025. Nabarun Goswami, Hanqin Wang, Tatsuya Harada. T2V2: A Unified Non-Autoregressive Model for Speech Recognition and Synthesis via Multitask Learning. The Thirteenth International Conference on Learning Representations (ICLR), accepted, 2025. Yusuke Kurose, Haruto Chiba, Lin Gu, Junichi Iho, Youji Tokunaga, Makoto Horie, Keisuke Nishizawa, Yusuaku Hayashi, Yasushi Koyama, Tatsuya Harada. Coronary Artery Segmentation With Partial Annotations in Coronary CT Angiography Images. IEEE 22nd International Symposium on Biomedical Imaging (ISBI), accepted, 2025. Thomas Westfechtel, Dexuan Zhang, Tatsuya Harada. Combining inherent knowledge of vision-language models with unsupervised domain adaptation through weak-strong guidance. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), accepted, 2025. Yizhe Ruan, Lin Gu, Yusuke Kurose, Junichi Iho, Youji Tokunaga, Makoto Horie, Yusaku Hayashi, Keisuke Nishizawa, Yasushi Koyama,Tatsuya Harada. Physiology-aware PolySnake For Coronary Vessel Segmentation. IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), accepted, 2025. 2024 Xuangeng Chu, Tatsuya Harada. Generalizable and Animatable Gaussian Head Avatar. Thirty-eighth Conference on Neural Information Processing Systems (NeurIPS), accepted, 2024. Tanachai Anakewat, Yusuke Mukuta, Thomas Westfechtel, Tatsuya Harada. Self-Stitching: Widely Applicable and Efficient Transfer Learning Using Stitching Layer. NeurIPS 2024 Workshop Fine-Tuning in Modern Machine Learning: Principles and Scalability (FITML), accepted, 2024. Haruki Abe, Takayuki Osa, Motoki Omura, Jen-Yen Chang, Tatsuya Harada. Latent Space Curriculum Reinforcement Learning in High-Dimensional Contextual Spaces and Its Application to Robotic Piano Playing. 2024 IEEE-RAS 23rd International Conference on Humanoid Robots (Humanoids), accepted, 2024. Jen-Yen Chang, Thomas Westfechtel, Takayuki Osa, Tatsuya Harada. Offline Deep Reinforcement Learning for Visual Distractions via Domain Adversarial Training. Transactions on Machine Learning Research (TMLR), accepted, 2024. Xiaoxiao Wu, Zehong Huang, Lin Gu, Zhicong Liang, Zheng Li, Tatsuya Harada, Yingying Zhu. Defender of privacy and fairness: tiny but reversible generative model via mutually collaborative knowledge distillation. Neurocomputing, accepted, 2024. Haruo Fujiwara, Yusuke Mukuta, Tatsuya Harada. Style-NeRF2NeRF: 3D Style Transfer from Style-Aligned Multi-View Images. SIGGRAPH Asia, accepted, 2024. Linwei Chen, Ying Fu, Lin Gu, Chenggang Yan, Tatsuya Harada, Gao Huang. Frequency-aware Feature Fusion for Dense Image Prediction. IEEE Transactions on Pattern Analysis and Machine Intelligence, accepted, 2024. Kazuma Kobayashi, Yasuyuki Takamizawa, Mototaka Miyake, Sono Ito, Lin Gu, Tatsuya Nakatsuka, Yu Akagi, Tatsuya Harada, Yukihide Kanemitsu, Ryuji Hamamoto. Can Physician Judgment Enhance Model Trustworthiness? A Case Study on Predicting Pathological Lymph Nodes in Rectal Cancer. Artificial Intelligence In Me",
  "content_length": 51711,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:22"
}