{
  "name": "Tatsuo Nakajima",
  "homepage": "https://waseda.pure.elsevier.com/en/persons/tatsuo-nakajima",
  "status": "success",
  "content": "Tatsuo Nakajima - Waseda University View Scopus Profile Tatsuo Nakajima 教授 Professor 教授, School of Fundamental Science and Engineering Websitehttps://w-rdb.waseda.jp/html/100000434_en.html h-index 3389 Citations 27 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1988 …2025 Research activity per year Fingerprint Dive into the research topics where Tatsuo Nakajima is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Virtual Reality Computer Science 100% Case Study Computer Science 93% Home Appliance Computer Science 85% Embedded Systems Computer Science 81% Ubiquitous Computing Computer Science 71% Digital Platform Computer Science 62% Robot Computer Science 53% Computing Environment Computer Science 49% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1988 2004 2005 2007 2008 2009 2010 2011 2012 2013 2015 2016 2017 2019 2020 2021 2022 2023 2024 2025 2025 327 Conference contribution 58 Article 30 Paper 7 Conference article 11 More 6 Chapter 5 Editorial Research output per year Research output per year A Multipurpose VR-Based Skill-Transfer for Robotic PlatformAburajouh, H. K. S., Iskandar, A., Fuchino, K., Halabi, O., Al-Jaber, F., Al-Sada, M. & Nakajima, T., 2025, Distributed, Ambient and Pervasive Interactions - 13th International Conference, DAPI 2025, Held as Part of the 27th HCI International Conference, HCII 2025, Proceedings. Streitz, N. A. & Konomi, S. (eds.). Springer Science and Business Media Deutschland GmbH, p. 189-202 14 p. (Lecture Notes in Computer Science; vol. 15803 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Transferability 100% Coaching 40% VR Environment 40% Robot Arm 20% Transfer System 20% Development and Evaluation of a Treadmill-Based Video-See-Through and Optical-See-Through Mixed Reality Systems for Obstacle Negotiation TrainingMiyake, T., Al-Sada, M., Iskandar, A., Itano, S., Kamezaki, M., Nakajima, T. & Sugano, S., 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 9, p. 4953-4967 15 p.Research output: Contribution to journal › Article › peer-review Treadmill 100% Optical See-through 100% See-through 100% Obstacle Negotiation 100% Mixed Reality Systems 100% 2 Citations (Scopus) Embodying a Mixed-Reality Agent with a Wearable Snake-Shaped Robotic AppendageIskandar, A., Aburajouh, H. K. S., Abdullah, H. A., Yafei, R. A., Wadaani, N. A., Halabi, O., Al-Sada, M. & Nakajima, T., 2025, Virtual, Augmented and Mixed Reality - 17th International Conference, VAMR 2025, Held as Part of the 27th HCI International Conference, HCII 2025, Proceedings. Chen, J. Y. C. & Fragomeni, G. (eds.). Springer Science and Business Media Deutschland GmbH, p. 336-355 20 p. (Lecture Notes in Computer Science; vol. 15790 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Visual Feedback 100% virtual agent 100% Realism 100% Artificial Intelligence 100% Robotics 100% Enhancing Telexistence Control Through Assistive Manipulation and Haptic FeedbackHalabi, O., Al-Sada, M., Abourajouh, H., Hoque, M., Iskandar, A. & Nakajima, T., 2025 Feb, In: Applied Sciences (Switzerland). 15, 3, 1324.Research output: Contribution to journal › Article › peer-review Open Access Haptic Feedback 100% Grasping 100% Telepresence 75% Inverse Kinematics 50% Robot 25% Evaluating the Impact of Color and Sound Combinations on Cognitive Performance in Virtual RealityNakao, R. & Nakajima, T., 2025, Advances in Mobile Computing and Multimedia Intelligence - 22nd International Conference, MoMM 2024, Proceedings. Delir Haghighi, P., Fedushko, S., Kotsis, G. & Khalil, I. (eds.). Springer Science and Business Media Deutschland GmbH, p. 86-91 6 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 15341 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Virtual Environment 100% Virtual Reality 100% Virtual Environments 100% Work Environment 100% Sensory Stimulus 100% View all 433 research outputs",
  "content_length": 4565,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:25"
}