{
  "name": "Tauhidur Rahman",
  "homepage": "https://www.tauhidurrahman.com",
  "status": "success",
  "content": "Tauhidur RahmanSearch this siteEmbedded FilesSkip to main contentSkip to navigationAssistant ProfessorHalıcıoğlu Data Science InstituteComputer Science and EngineeringUniversity of California San DiegoEmail: trahman@ucsd.eduCV | MOSAIC LabBio: Tauhidur Rahman is an Assistant Professor at the Halıcıoğlu Data Science Institute and Computer Science and Engineering at the University of California San Diego, where he directs the Mobile Sensing and Ubiquitous Computing (MOSAIC) Lab. His research focuses on designing novel mobile and ubiquitous sensing technologies using on-body and off-body sensors to capture fine-grained physiological and behavioral signals. He develops generative AI-enabled digital twin architectures that translate these signals into meaningful biological and behavioral insights, enabling trend forecasting, risk assessment, and just-in-time interventions for individuals and teams. Rahman has an extensive track record working with large-scale, multimodal sensor data, particularly in digital epidemiology, substance use disorder, mental health, and sleep. His work has been featured in The Wall Street Journal, MIT Technology Review, New Scientist, Daily Mail (UK), Hindustan Times (India), and public television in the U.S. His research has been supported by the NSF, NIH, DARPA, and industry collaborators. He is a recipient of the Google Research Scholar Award (2023), a Google PhD Fellowship (2016) in mobile computing, and was a finalist for the Qualcomm Innovation Fellowship (2015). He has received multiple accolades, including a Best Paper Award at ACM Digital Health (2016), an Honorable Mention at ACM UbiComp (2015), a Distinguished Paper Award from ACM IMWUT (2021), and an Outstanding Teaching Award from Cornell University (2015). Rahman earned his PhD in Information Science from Cornell University, MS in Electrical Engineering from the University of Texas at Dallas, and BS in Electrical and Electronic Engineering from the Bangladesh University of Engineering and Technology.NewsI don't maintain the news section in this personal website. For latest research, publication and other updates, please visit my MOSAIC laboratory website.[June 2023] Wonderful experience to be part of the Qualcomm Women in ML HackOverflow Expert Panel focusing on ML for Health![June 2023] Lighting talk at the 5 year anniversary of HDSI! [May 2023] Thrilled to receive the Google Research Scholar Award 2023! The Research Scholar Program provides unrestricted gifts to support research at institutions around the world, and is focused on funding world-class research conducted by early-career professors.[May 2023]  New Paper \"Zoom-Based Mindfulness-Oriented Recovery Enhancement Plus Just-in-Time Mindfulness Practice Triggered by Wearable Sensors for Opioid Craving and Chronic Pain\"[May 2023] NEW NEUROCOMPUTING Paper \"Neuromorphic High-Frequency 3D Dancing Pose Estimation in Dynamic Environment\". Congrats Zhongyang![March 2023] Excited to teach \"Practice and Application of Data Science\" DSC80 to a group of 130 students![September 2022] Relocated to sunny San Diego! Setting up the lab in the newly built Franklin and Antonio Hall at UCSD![September 2022] NEW ACII 2022 Paper \"Extracting Multimodal Embeddings via Supervised Contrastive Learning for Psychological Screening\" Congrats Manasa![August 2022] NEW npj Digital Medicine Paper \"Impact of individual and treatment characteristics on wearable sensor-based digital biomarkers of opioid use\" Congrats Bhanu![July 2022] NEW IMWUT 2022 Paper: \"Calico: Track Based Interactive and Relocatable Wearables with Fast, Reliable, and Precise Locomotion\"[June 2022] I will be joining HDSI at UCSD from Summer 2022. It has been a great pleasure to serve at CICS UMass and now looking forward to the new adventure at UCSD![May 2022] NEW IMWUT 2022 Paper: \"EarlyScreen: Multi-scale Instance Fusion for Predicting Neural Activation and Psychopathology in Preschool Children\" Congrats Manasa![April 2022] We (Dr. Adam Grabell and I as joint-PIs) received UMass System’s Office of Technology Commercialization & Ventures (OTCV) Technology Development Research Grant ($23K) for our work on a mobile video game-based early psychopathology screening tool for pre-school children.[April 2022] More Press Coverage on our work to fight opioid epidemic with wearable signals. [March 2022] Delighted to participate the first Public Interest Technology Symposium as a panelist at UMass. We discussed about large scale mobile sensor data, data privacy, the need for open science and maker culture.[February 2022] Excited to be co-organizing the 3rd Digital Biomarker workshop with MobiSys 2021. Come join us in July 1st in Portland Oregon. Call for paper available here.[January 2022] mHealth Intelligence (a popular healthcare media) features our work. Wearable Sensor May Help Curb Opioid Relapses, Overdoses[December 2021] UMass Press coverage on our recent and ongoing work on Addiction Computing Technologies.[October 2021] FluSense received Distinguished Paper Award from PACM IMWUT vol 4 in Ubicomp 2021. Congrats to Forsad and team. Thanks to our public health and clinical collaborators![September 2021] Excited to teach CICS 256: Make: Introduction to Physical Computing class in Fall 2021. Course website.[September 2021] NEW NIH R21 proposal as Co-I with PI Dr. Adam Grabell (Cognitive and Brain Sciences). We are developing mobile sensing tools for emotion regulation psychopathology and early screening for pre-school children. Currently at the negotiation stage. Official announcement soon![August 2021] NEW DARPA TAMI proposal funded. Working on design and development of a novel Machine Reflex mechanism with my colleague Hava Siegelmann.[July 2021] NEW NSF Smart and Connected Health proposal ($1.1 million) on opioid craving modeling and management has been recommended for funding. Official annoucement soon![July 2021] Congrats to my PhD student Bhanu for his acceptance in Yale's Innovation to Impact program. This is a highly selective entrepreneurship training program for substance use disorder.[July 2021] Congrats to my PhD student Forsad for the Computing for Common Good Fellowship. Forsad will be working on a generalized computational platform for syndromic surveillance.[June 2021] NEW IMWUT 2021 Paper: \"OpiTrack: A Wearable-based Clinical Opioid Use Tracker with Temporal Convolutional Attention Networks\" Congrats Bhanu! Paper will be available soon.[May 2021] NEW IROS 2021 Paper: \"Knowledge Transfer across Imaging Modalities Via Simultaneous Learning of Adaptive Autoencoders for High-Fidelity Mobile Robot Vision\" Paper Link.[April 2021] co-chairing a workshop on the Future of Digital Biomarkers with ACM MobiSys 2021.[March 2021] Our book \"Contactless Human Activity Analysis\" published by Springer is out. I served as a editor of the book. The chapters cover areas from rf sensing to computational photography and are written by experts from 15 different organizations around the world. Pre-order link and comments on the book from experts.[February 2021] NEW JMIR paper: \"Effect of Sleep and Biobehavioral Patterns on Multidimensional Cognitive Performance: Longitudinal, In-the-Wild Study\" Paper It was a NSF  Future of Work funded work.[January 2021] Serving on the TPC of MobiSys 2021[October 2020] Serving on the TPC of PerIoT 2021[September 2020] Co-organizing the virtual Mental Health: Sensing and Intervention workshop, collocated with Ubicomp 2020.[July 2020] NEW ACM UIST 2020 Paper \"MechanoBeat: Monitoring Interactions with Everyday Objects using 3D Printed Harmonic Oscillators and Ultra-Wideband Radar\" Paper and Video[June 2020] Received a grant from Intel Pandemic Response Technology Initiative to work on COVID-19 resurgence modeling with contactless syndromic signal sensing from crowds at public spaces in Western MA.[May 2020] NSF Smart and Connected Society planning grant was awarded. Looking forward to working on \"Extreme temperature and it's impact on human physiology, psychology and our community-level behaviors\" with colleagues at UMASS, ASU and NAIST (Japan). A UMass press release on our project.[April 2020] Thrilled to talk about FluSense in an interview with the Public Television for Western New England (WGBY). Link[April 2020] FluSense received an alomost world-wide press coverage. Techcrunch, UMass, Daily Mail (UK), Science Daily, Hindustan Times (India), Science Node, Digital Trends, Masslive, Photonics, ibitimes (Singapore). Full List[January 2020] New IMWUT/Ubicomp 2020 Paper \"FluSense: A Contactless Syndromic Surveillance Platform for Influenza-Like Illness in Hospital Waiting Areas\". This is our first paper in the new space of digital epidemiology. This will be a major thrust of our research going forward. The paper is going through camera-ready process and can be made available upon request.[September 2019] Excited to teach a new course CICS 290M: Make at UMass.[August 2019] MOSAIC lab website is live now. http://mosaic.cs.umass.edu[April 2019] Serving as a Poster, Video and Demo Chair of Ubicomp 2019. [April 2019] New IMWUT/Ubicomp 2019 Paper \"NOSE: A Novel Odor Sensing Engine for Ambient Monitoring of the Frying Cooking Method in Kitchen Environments\"[April 2019] Congrats Bhanu for the new IMWUT/Ubicomp 2019 Paper \"On-body Sensing of Cocaine Craving, Euphoria and Drug-Seeking Behavior using Cardiac and Respiratory Signals\".[April 2019] New CVPR 2019 Workshop paper on \"Pedestrian Detection in Thermal Images using Saliency Maps\".[March 2019] TPC at WearSys 2019[Feb 2019] Thrilled to start the Laboratory for Mobile Sensing and Ubiquitous Computing (MOSAIC) at UMass. I will be co-directing the lab with my colleague Deepak Ganesan. The Website will be available soon at mosaic.cs.umass.edu.[Jan 2019] New IMWUT/Ubicomp 2019 Paper \"W!NCE: Unobtrusive Sensing of Upper Facial Action Units with EOG-based Eyewear.\"[Sep 2018] Serving as TPC chair at ICCCN 2019.[Aug 2018] NSF Future of Work-Human Technology Frontier grant proposa",
  "content_length": 12095,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:23"
}