{
  "name": "Te-Yen Wu",
  "homepage": "http://teyenwu.com",
  "status": "success",
  "content": "Te-Yen Wu Te-Yen Wu Assistant Professor at Florida State University My research lies in the intersection areas of Human-Computer Interaction, Cyber-Physical Systems, and AI Technologies. The objective of my career is to establish the scientific and technical foundations for the material-centric paradigm of Physical AI. My research takes a highly interdisciplinary approach, combining electrical engineering and materials science to design and fabricate low-cost intelligent materials, computer science to develop lightweight operating systems and algorithms, and human-centered design to create tools and evaluate usability and performance in real-world contexts. In addition to it, I have also worked on other topics such as text entry systems and Human-AI interactions in VR/AR. My research is generally published in top HCI venues like CHI and UIST, while I also contribute to top AI conferences such as ICLR. My research has attracted considerable public interests via Internet News (e.g. Engadget, Times). Currently, I direct the MakeX Lab at FSU. I am looking for PhD students who are highly motivated and interested in Human-Computer Interaction research. If you're interested in working with me, please send an email to [tw23l (at) fsu (dot) edu] with your CV and a one-page research statement about the topic you wish to explore. Selected Publications Intelligent Materials and Objects BIT: Battery-free, IC-less and Wireless Smart Textile Interface and Sensing System Weiyi Xu, Tony Li, Yuntao Wang, Xing-Dong Yang, Te-Yen Wu (CHI 2025) [Video] [PDF] BIT is a smart textile interface that operates without the need for embedding batteries, ICs and connectors into textiles. BIT can be designed to accommodate sensors based on capacitance, resistance, or inductance and support concurrent operations of up to three sensors. IntelliLining: Activity Sensing through Textile Interlining Sensors Using TENGs Mahdie Ghane Ezabadi, Aditya Shekhar Nittala, Xing-Dong Yang, Te-Yen Wu (CHI 2025) [PDF] IntelliLining is a novel sensing component for smart garments, designed to sense user activities through vibration sensing. Tagnoo: Enabling Smart Room-Scale Environments with RFID-Augmented Plywood Yuning Su, Tingyu Zhang, Jiuen Feng, Yonghao Shi, Xing-Dong Yang, Te-Yen Wu (CHI 2024) [Video] [PDF] [DOI] Tagnoo is a computational plywood augmented with RFID tags, aimed at empowering woodworkers to effortlessly create room-scale smart environments. Unlike existing solutions, Tagnoo does not necessitate technical expertise or disrupt established woodworking routines. This battery-free and cost-effective solution seamlessly integrates computation capabilities into plywood, while preserving its original appearance and functionality. WooDowel: Enhancing Triboelectric Plywood Sensors with Electromagnetic Shielding Yonghao Shi, Chenzheng Li, Yuning Su, Xing-Dong Yang, Te-Yen Wu (CHI 2024) [Video] [PDF] [DOI] WooDowel presents a new approach that enables the woodworker to manually isolate short-circuited electrodes. This method facilitates the creation of sensors using overlapping electrodes, while also incorporating EM shielding, thereby resulting in a substantial improvement in the sensor's robustness when detecting user activities. iWood: Makeable Vibration Sensor for Interactive Plywood Te-Yen Wu , Xing-Dong Yang. (UIST 2022) [Video] [DOI] [PDF] [Github] iWood is interactive plywood that can sense vibration based on triboelectric effect. As a material, iWood survives common woodworking operations, such as sawing, screwing, and nailing and can be used to create furniture and artifacts. Body-Centric NFC: Body-Centric Interaction with NFC Devices Through Near-Field Enabled Clothing Te-Yen Wu , Huizhong Ye, Chi-Jung Lee, Xing-Dong Yang, Bing-Yu Chen, Rong-Hao Liang(DIS 2022) [Video] [DOI] [PDF] This paper presents an investigation of body-centric interactions between the NFC device users and their surroundings, and an accessible method for fabricating fexible, extensible, and scalable NFC extenders on clothing pieces, and an easy-to-use toolkit for facilitating designers to realize the interactive experiences. Project Tasca: Enabling Touch and Contextual Interactions with a Pocket-based Textile Sensor Te-Yen Wu , Zheer Xu, Xing-Dong Yang, Steve Hodges, Teddy Seyed(CHI 2021) [Video] [DOI] [PDF] Project Tasca presents a pocket-based textile sensor that detects user input and recognizes everyday objects usually carried in the pockets of a pair of pants (e.g., keys, coins, electronic devices, or plastic items). By creating a new fabric-based sensor capable of detecting in-pocket touch and pressure, and recognizing metallic, non-metallic, and tagged objects inside the pocket, we enable a rich variety of subtle, eyes-free, and always-available input, as well as context-driven interactions in wearable scenarios Capacitivo: Contact-Based Object Recognition on Interactive Fabrics using Capacitive Sensing Te-Yen Wu , Lu Tan, Yuji Zhang, Teddy Seyed, Xing-Dong Yang (UIST 2020) [Video] [DOI] [PDF] Capacitivo is a contact-based object recognition technique developed for interactive fabrics, using capacitive sensing. Unlike prior work that has focused on metallic objects, our technique recognizes non-metallic objects such as food, different types of fruits, liquids, and other types of objects that are often found around a home or in a workplace. Fabriccio: Touchless Gestural Input on Interactive Fabrics Te-Yen Wu , Shutong Qi, Junchi Chen, MuJie Shang, Jun Gong, Teddy Seyed, Xing-Dong Yang (CHI 2020) [Video] [DOI] [PDF] Fabriccio is a a touchless gesture sensing technique developed for interactive fabrics using Doppler motion sensing. ThreadSense: Locating Touch on an Extremely Thin Interactive Thread Pin-Sung Ku, Qijia Shao, Te-Yen Wu , Jun Gong, Ziyan Zhu, Xia Zhou, Xing-Dong Yang (CHI 2020) [Video] [DOI] [PDF] We propose a new sensing technique for one-dimensional touch input workable on an interactive thread of less than 0.4 mm thick. Our technique locates up to two touches using impedance sensing with a spacing resolution unachievable by the existing methods. Zippro: The Design and Implementation of An Interactive Zipper Pin-Sung Ku, Jun Gong, Te-Yen Wu , YiXin Wei, Yiwen Tang, Barrett Ens, Xing-Dong Yang (CHI 2020) [Video] [DOI] [PDF] This paper explored the possibilities of interaction with ubiquitous zipper-bearing objects, with a focus on opportunities for foreground and background interactions. Based on the findings, we built a self-contained prototype, Zippro that can replace a common zipper slider. Text Entry System BiTipText: Bimanual Eyes-Free Text Entry on a Fingertip Keyboard. Zheer Xu, Weihao Chen, Dongyang Zhao, Jiehui Luo, Te-Yen Wu , Jun Gong, Sicheng Yin, Jialun Zhai, Xing-Dong Yang (CHI 2020) [Video] [DOI] [PDF] We present a bimanual text input method on a miniature fingertip keyboard, that invisibly resides on the first segment of a user’s index finger on both hands. TipText: Eyes-Free Text Entry on a Fingertip Keyboard Zheer Xu, Pui Chung Wong, Jun Gong, Te-Yen Wu , Aditya Shekhar Nittala, Xiaojun Bi, Jurgen Steimle, Hongbo Fu, Kening Zhu, Xing-Dong Yang (UIST 2019) [Video] [DOI] [PDF] Best Paper Award In this paper, we propose and investigate a new text entry technique using micro thumb-tip gestures. Our technique features a miniature QWERTY keyboard residing invisibly on the first segment of the user’s index finger. Text entry can be carried out using the thumb-tip to tap the tip of the index finger. Prototyping Tools AccessibleCircuit: Adaptive Add-On Circuit Components for People with Blindness or Low Vision Ruei-Che Chang, Wen-Ping Wang, Chi-Huan Chiang, Te-Yen Wu , Zheer Xu, Justin Luo, Bing-Yu Chen, Xing-Dong Yang (CHI 2021) [Video] [DOI] [PDF] In this paper, we propose the designs for low cost and 3D-printable add-on components to adapt existing breadboards, circuit components and electronics tools for blind or low vision (BLV) users. TangibleCircuits: An Interactive 3D Printed Circuit Education Tool for People with Visual Impairments. Josh Urban Davis, Te-Yen Wu , Bo Shi, Hanyi Lui, Anthina Panotopoulou, Emily Whiting, Xing-Dong Yang (CHI 2020) [Video] [DOI] [PDF] Honorable Mention Award We present a novel haptic and audio feedback device that allows blind and visually impaired (BVI) users to understand circuit diagrams. TangibleCircuits allows users to interact with a 3D printed tangible model of a circuit which provides audio tutorial directions while being touched. Proxino: Enabling Prototyping of Virtual Circuits With Physical Proxies Te-Yen Wu , Jun Gong, Teddy Seyed, Xing-Dong Yang (UIST 2019) [Video] [DOI] [PDF] In this paper, we propose blending the virtual and physical worlds for prototyping circuits using physical proxies. With physical proxies, real-world components (e.g. a motor, or light sensor) can be used with a virtual counterpart for a circuit designed in software. CurrentViz: Sensing and Visualizing Electric Current Flows of Breadboarded Circuits. Te-Yen Wu , Hao-Ping Shen, Yu-Chian Wu, Yu-An Chen, Pin-Sung Ku, Ming-Wei Hsu, Jun-You Liu, Yu-Chih Lin, Mike Y. Chen (UIST 2017) [Video] [DOI] [PDF] We present CurrentViz, a system that can sense and visualize the electric current flowing through a circuit, which helps users quickly understand otherwise invisible circuit behavior. CircuitSense: Automatic Sensing of Physical Circuits and Generation of Virtual Circuits to Support Software Tools. Te-Yen Wu , Bryan Wang, Jiun-Yu Lee, Hao-Ping Shen, Yu-Chian Wu, Yu-An Chen, Pin-Sung Ku, Ming-Wei Hsu, Yu-Chih Lin, Mike Y. Chen (UIST 2017) [Video] [DOI] [PDF] CircuitSense is a system that automatically recognizes the wires and electronic components placed on breadboards. CircuitStack: Supporting Rapid Prototyping and Evolution of Electronic Circuits Chiuan Wang, Hsuan-Ming Yeh, Bryan Wang, Te-Yen Wu , Hsin-Ruey Tsai, Rong-Hao Liang, Yi-Ping Hung, Mike Y. Chen (UIST 2016) [Video] [DOI] [PDF] CircuitStack is a system that com- bin",
  "content_length": 14762,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:25"
}