{
  "name": "Ted Briscoe",
  "homepage": "https://mbzuai.ac.ae/study/faculty/ted-briscoe",
  "status": "success",
  "content": "Ted Briscoe - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Ted Briscoe Ted Briscoe Deputy Department Chair and Professor of Natural Language Processing Research Interests Professor Briscoe has worked on statistical and robust parsing algorithms, computational approaches to lexicon acquisition and to representation of lexical, syntactic and semantic knowledge, textual information extraction from scientific articles and regulatory documents, models of human language learning and processing, and evolutionary models of language development and change. His recent work has mostly focussed on NLP and ML techniques in support of language learning. Email Share Prior to joining MBZUAI, Professor Briscoe was Professor of Computational Linguistics at the University of Cambridge where he was a member of faculty for 33 years. He led the Natural Language and Information Processing (NLIP) research group in the Department of Computer Science and Technology for more than 20 years, and was co-founder and inaugural director of the university's interdisciplinary Automated Language Teaching and Assessment (ALTA) Institute. In 2003, he co-founded iLexIR Ltd, a NLP consultancy and technology provider, and was its CEO until 2022. In 2013, he co-founded English Language iTutoring and was its chief scientist until 2019, and from 2020 until 2022 he was chief scientist for RegGenome Ltd. He has been an area chair for five conferences of the Association of Computational Linguistics (ACL) and served on the programme committees of many more ACL conferences and workshops, as well as of EMNLP, COLING, CoNLL, LREC and EVOLANG. Professor Briscoe has been principal investigator on 16 externally funded UK and European research grants, taught at four European Summer Schools, and been a technical advisor or consultant to more than a dozen companies. He currently advises Cambridge Innovation Capital on investment in the AI/ML/NLP space. He has presented his research in invited talks at conferences and workshops at more than 30 events including two Dagstuhl Seminars, the Royal Statistical Society, the American Association for Advancement of Science, the Beckman Frontiers of Science Symposium, National Academy of Sciences, and the ESPRIT, eLex, CLIN, CLUK, STIL and Iberamia annual conferences. Professor Briscoe has been on the editorial boards of the journals: Computational Linguistics, Natural Language Engineering, and Lingua and was a senior editor of Computer Speech and Language from 2001 to 2015. He is a member of the NCCR Evolving Language Review Board and of the Sheffield EPSRC CDT for Speech and Language Technology Advisory Board. Ph.D. in computational linguistics from University of Cambridge, England Master’s in linguistics from University of Cambridge, England Bachelor of linguistics/philosophy/English from University of Lancaster, England Briscoe is the (co-)author of more than 150 internationally peer-reviewed research papers and three books on topics in natural language processing and computational linguistics, and of one patent on automated assessment of exam scripts. Language learning, power laws, and sexual selection, T Briscoe, Mind & Society 7 (1), 65-76, 2008 The second release of the RASP system, T Briscoe, J Carroll, R Watson, Proc. of the COLING/ACL, 2006 Grammatical Error Correction: A Survey of the State of the Art, C Bryant, Z Yuan, MR Qorib, H Cao, HT Ng, T Briscoe, Computational Linguistics, submitted, 2022 Neural automated essay scoring and coherence modeling for adversarially crafted input, Y Farag, H Yannakoudakis, T Briscoe, Proc. of Nth Am. ACL, 2018 Developing an automated writing placement system for ESL learners, H Yannakoudakis, ØE Andersen, A Geranpayeh, T Briscoe, D Nicholls, Applied Measurement in Education 31 (3), 251-267, 2018 Grammatical error correction using neural machine translation, Z Yuan, T Briscoe, Proc. of Nth Am. ACL, 2016 Google Scholar Related Tuesday, June 03, 2025 Bringing ideas to life with a new writing tool for Arabic language learners ARWI – or Arabic Write and Improve – aims to help learners hone their writing abilities in… assistant interactive writing linguistics language Arabic language llms llm education nlp natural language processing Read more Thursday, January 09, 2025 LLMs 101: Large language models explained LLMs are a staple of AI, but what exactly are they? Our 101 guide breaks down the… llms tokens LLM360 llm large language models nlp natural language processing open source Read more Monday, May 27, 2024 Words at work: New directions in natural language processing with Ted Briscoe Ted Briscoe has focused his efforts on solving fundamental problems in NLP, such as parsing and syntactic… natural language processing applications faculty nlp llm Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 6421,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:28"
}