{
  "name": "Teemu Roos",
  "homepage": "https://www.cs.helsinki.fi/u/ttonteri",
  "status": "success",
  "content": "Teemu Roos Teemu Roos Professor of Computer Science Coleader of the Complex Systems Computation (CoSCo) research group Leader of the AI Education program in the Finnish Center for AI Department of Computer Science and Helsinki Institute for Information Technology HIIT Exactum building, A322 PO Box 68 FI-00014 University of Helsinki Finland photo: Maarit Kytöharju contact: teemu.roos@helsinki.fi CV (pdf) troos teemu-roos My Profile on the University Research Portal (projects, awards, publications) What's up? Tiedeykkönen: \"Tekoäly perustuu todennäköisyyslaskentaan ja muokkaa itse itseään\" (in Finnish) Listen on Yle Areena (49 min) Host: Mari Heikkilä SAS Pondering AI Podcast: \"AI Education for All\" Listen on Pondering AI Podcast (29 min) Host: Kimberly Nevala OECD Podcast: \"Why everyone in Finland's teaching themselves AI.\" Listen on Soundcloud (14 min) Host: Clara Young NEW: Want to understand AI? Join more than 1 700 000 other students in our free on-line courses created together with MinnaLearn. No maths or programming required. Start learning at Elements of AI. \"Tekoälyn lukutaito\" (\"AI Literacy\"; in Finnish), pääkirjoitus, Tieteessä tapahtuu 36(1), 2018: Tavoitteena ei ole kouluttaa koko kansasta tekoälykoodareita. Sen sijaan perusteiden avulla saavutetaan kyky osallistua tekoälyyn liittyvään yhteiskunnalliseen keskusteluun ja arvioida kriittisesti esitettyjä väitteitä – \"tekoälyn lukutaito\". (Teemu Roos) The aim is not to train the entire population as AI developers. Instead, knowing the basics enables one to engage in the public discourse on AI and to critically evaluate arguments about it – \"AI literacy\". (Teemu Roos) Selected conference and workshop involvement (program committee or equivalent): AISTATS-2011/2014/2015/2022 ICML-2018/2019/2020/2021/2022/2024 IJCAI-2013/2015/2018 NeurIPS-2014/2015/2016/2017/2018/2019/2020/2021/2022/2023/2024/2025 UAI-2008/2009/2010/2011/2012/2013/2014/2015/2016/2017/2018/2019/2020/2021/2022/2023/2024/2025. Teaching I teach the following courses: DATA11001 Introduction to Data Science in period I Past students: Petri Suurnäkki (MSc 2025) Christian Cardin (MSc 2025) Joel Nummelin (MSc 2025) Matti McGill (MSc 2024) Sathianpong Trangcasanchai (MSc 2024) Ville Hyvönen (PhD 2023) Fanni Franssila (MSc 2023) Daniel Holmberg (MSc 2021) Janne Leppä-aho (PhD 2020) Ioanna Bouri (MSc 2019) Ilse Tse (MSc 2019) Juho Lamminmäki (MSc 2019) Biyun Huang (MSc 2018) Carlos Santana Vega (MSc 2018) Sean Lang (MSc 2018) Sebastian Falk (MSc 2017) Joe Niemi (MSc 2017) Elias Jääsaari (MSc 2017) Tommi Jalkanen (MSc 2017) co-supervised with Dr Jutta Jokiranta (Theology) Laura Uusitalo (MSc 2017) Elaine Zosa (MSc 2017) Yuan Zou (PhD 2017) Teemu Pitkänen (MSc 2016) Jussi Määttä (PhD 2016) Antti Takalahti (MSc 2016) co-supervised with Prof Edward Haeggström (Physics) Risto Tuomainen (MSc 2016) Simo Linkola (MSc 2016) Kaj Sotala (MSc 2015) Quan Nguyen (MSc 2015) Peter Hedman (MSc 2015), co-supervised with Prof Jaakko Lehtinen (Aalto/NVIDIA)Acad. Assoc. for Maths and Natural Sciences (MAL) MSc Thesis Award Arttu Modig (MSc 2014), co-supervised with Prof Jouko Lampinen (Aalto) Janne Leppä-aho (MSc 2014), co-supervised with Prof Jukka Corander Henning Lübbers (MSc 2012), co-supervised with Prof Jyrki Kivinen Anupam Arohi (MSc 2011) Yuan Zou (MSc 2011) Teemu Pulkkinen (MSc 2011) Toni Merivuori (MSc 2009) Lari Latvala (MSc 2009), co-supervised with Prof Jouko Laasasenaho Students interested in MSc/PhD thesis topics related to information theory, statistical modeling, machine learning, artificial intelligence, and digital humanities are welcome to contact me by e-mail (but see disclaimer below). Disclaimer: If you currently not enrolled at the University of Helsinki, please do not send me e-mail, but contact the Department of Computer Science for information about the application process. Unfortunately I cannot reply to all e-mail inquiries. Research I am a coleader of the Complex Systems Computation (CoSCo) research group together with Petri Myllymäki. I'm also affiliated with the Finnish Center for AI (FCAI). My research group: Elias Jääsaari (doctoral researcher; 1st year) Fanni Franssila (doctoral resarcher; 2nd year) Daniel Holmberg (doctoral resarcher; 3rd year) Ioanna Bouri (doctoral resarcher; 6th year) Topics of my interest include machine learning probabilistic graphical models information theory applications in physics, neuroscience, medicine, and humanities AI education Recent and ongoing work: D. Holmberg, I. Zaitsev, M. Alho, I. Bouri, F. Franssila, H. Jeong, M. Palmroth, T. Roos (2025), Graph-based neural space weather forecasting, NeurIPS 2025 Workshop on Machine Learning and the Physical Sciences. D. Holmberg, E. Clementi, I. Epicoco, T. Roos (2025). Accurate Mediterranean Sea forecasting via graph-based deep learning, in review. D. Holmberg, M. Airaksinen, V. Marchi, A. Guzzetta, A. Kivi, L. Haataja, S. Vanhatalo, T. Roos (2025). Learning developmental age from 3D infant kinetics using adaptive graph neural networks, IEEE Trans Neural Syst Rehabil Eng 33:1939–1950. E. Jääsaari, V. Hyvönen, M. Ceccarello, T. Roos, M. Aumüller (2025). VIBE: Vector index benchmark for embeddings, in review. → website O. Hilke, N. Pope, J. Kahila, H. Vartiainen, T. Roos, T. Parkki, M. Tedre (2025), Breakable Machine: A K-12 classroom game for transformative AI literacy through spoofing and explainable AI (XAI), in review. N. Pope, A. Lin, J. Kahila, H. Vartiainen, T. Roos, J. Laru, M. Tedre (2025). Pre-service teachers' experiences with using an (X)AI education tool for teaching social media mechanisms, EdMedia-2025. Outstanding paper award. N. Pope, J. Kahila, H. Vartiainen, M. Saqr, S. López-Pernas, T. Roos, J. Laru, M. Tedre (2025). An XAI social media platform for teaching K-12 students AI-driven profiling, clustering, and engagement-based recommending, EAAI-2025. A. Etholén, T. Roos, M. Hänninen, I. Bouri, J. Kulmala, O. Rahkonen, A. Kouvonen, T. Lallukka (2025), Forecasting subjective cognitive decline: AI approach using dynamic Bayesian networks, J Med Internet Res, 2025;27:e65028. Other selected publications (full list, Google Scholar): E. Jääsaari, V. Hyvönen, T. Roos (2024). LoRANN: Low-rank matrix factorization for approximate nearest neighbor search, NeurIPS-2024 → github V. Hyvönen, E. Jääsaari, T. Roos (2024). A multilabel classification framework for approximate nearest neighbor search, Journal of Machine Learning Research 25(46):1–51 R.M. Ballardini, K. He, and T. Roos (2018), Digital distribution of AI-generated content: Authorship and inventorship in the age of artificial intelligence, in T. Pihlajarinne, J. Vesala, and O. Honkkila (editors), Online Distribution of Content in the EU, Edward Elgar Publishing Ltd. A. Oulasvirta, T. Roos, A. Modig, and L. Leppänen, (2013). Information capacity of full-body movements, in Proc. 2013 ACM SIGCHI Conference on Human Factors in Computing Systems (CHI-2013), ACM, pp. 1289–1298. Best paper honorable mention award. Past Events I have held visiting positions at CWI Amsterdam (2003 & 2005), UC Berkeley (2008, 2015), MIT (2010), University of Cambridge (2012), and the Finnish Institute in Rome (2013). My traveling/conference schedule in 2020: 🇧🇪 European Parliament, Elements of AI Exhibition, Brussels, February 4–5, 2020 🇺🇸 AAAS Annual Meeting, Seattle, February 10–15, 2020 🇬🇧(online) Embedding AI into Teaching Curriculums, All Party Parliamentary Group on AI, London, March 23, 2020 My traveling/conference schedule in 2019: 🇸🇪 AI Innovation of Sweden, Official Opening, Gothenburg, Sweden, February 6, 2019. 🇳🇴 ICDE-2019 Lifelong Learning Summit, Keynote on \"AI Education for All: the Finnish Way\", Lillehammer, Norway, February 11–13, 2019 🇫🇷 Artificial Intelligence for Sustainable Development, Keynote at the Policy Forum, UNESCO Headquarters, Paris, March 5, 2019 🇬🇧 Studia Stemmatologica VIII, University of Cambridge, April 4–5, 2019 🇬🇧 CogX, London, June 10–12, 2019 🇳🇴 Big Challenge, Trondheim, Norway, June 16–19, 2019 🇳🇱 World Summit AI, Amsterdam, October 9–10, 2019 🇪🇸 Club de Madrid: Digital Transformation and the Future of Democracy, Madrid, October 21–22, 2019 🇬🇧 Think Talks, the Finnish Institute in London, October 23–24, 2019 🇩🇪 The Finnish Institute in Germany, Berlin, October 31–November 1, 2019 🇫🇮 Slush, November 21–22, 2019 🇫🇮 EU High-Level Conference on Data Economy, November 25–26, 2019 🇺🇸 Fantastic Futures, Stanford, December 4–6, 2019 I hosted the Machine Learning Coffee Seminar together with Sami Kaski and H. Afrabandpey in 2017–2018. Janne Leppä-aho received the best student paper honorable mention at PGM-2018 with the paper 'Learning non-parametric Markov networks with mutual information'. Our joint proposal with M-Brain was accepted by Business Finland and we joined the NSF Industry–University Cooperative Research Center on Visual & Decision Informatics in 2018. My traveling/conference schedule in 2018: ITA-2018, San Diego, February 11–16 UCSD, February 1–21 UC Berkeley, February 26–March 22 Apple, Cupertino, March 21 Targeted Discovery in Brain Data Workshop, Simons Institute, Berkeley, March 19–22 Princeton, March 23 CMU, Pittsburgh, March 26–30 Google AI, Pittsburgh, March 26 ALT 2018, Lanzarote, April 7–9 AISTATS 2018, Lanzarote, April 9–11 WiFiUS Meeting and Summer School, Boston, June 11–16 UCSC Milano, Milan, October 24–November 14 6/2017: The Academy of Finland has awarded two new grants to our research group. TensorML project (4 years) will study non-standard machine learning problems with applications in drug design, and MachQu project (2 years) will apply probabilistic machine learning to quantum-mechanics based material design. 4/2017: Our joint proposal with Prof. Pulkit Grover (CMU) on ''Efficient and Robust Cognitive IoT Systems using Unreliable Sensors'' is funded by the Academy of Finland and NSF. My traveling/conference schedule in 2017: Workshop on Evolutionary Networks, Banff Intl. Research Station, Canada, February 13–1",
  "content_length": 19337,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:29"
}