{
  "name": "Tegan Brennan",
  "homepage": "https://web.stevens.edu/facultyprofile/?id=2427",
  "status": "success",
  "content": "Tegan Brennan | Stevens Institute of TechnologySkip to ContentTegan BrennanAssistant ProfessorCharles V. Schaefer, Jr. School of Engineering and ScienceDepartment of Computer ScienceGateway Center S254(201) 216-5544[email protected]EducationPhD (2020) University of California Santa Barbara (Computer Science) ResearchSoftware verification, side-channel analysis, computer security, program analysis.ExperienceApplied Scientist at Amazon, 2020Institutional ServiceDepartment of Computer Science Marketing and Communications Committee MemberSES Faculty Advisory Council MemberProfessional Service2025 IEEE Computer Security Foundations Symposium (CSF 2025) Reviewer2023 IEEE Security and Privacy (S&P 2023) Awards Chair2023 Workshop on Binary Analysis Research (BAR 2023) Program Committee Member 17th Workshop on Programming Languages and Analysis for Security (PLAS 2022) Program Committee Member2023 IEEE Computer Security Foundations Symposium (CSF 2023) Reviewer2022 IEEE Security and Privacy Awards Chair2022 Workshop on Binary Analysis Research (BAR) Program Committee Member2022 ACM SIGSOFT International Symposium on Software Testing and Analysis Program Committee Member2021 Workshop on Foundations of Computer Security Program Committee Member2021 IEEE Security and Privacy Awards ChairAppointmentsStevens Institute of Technology, Assistant Professor, 2021 - presentHonors and AwardsUniversity of California Santa Barbara Outstanding Dissertation Award, 2020International Conference on Software Engineering (ICSE) Student Research Competition Third Place, 2020Rising Stars Workshop Participant, UIUC 2019UCSB Outstanding Student in Computer Science, 2019NCWIT Collegiate Award Honorable Mention, 2018Professional SocietiesIEEE – Institute of Electrical and Electronics Engineers MemberACM – Association for Computing Machinery MemberGrants, Contracts and FundsCAREER: SaTC: Privacy-Aware Just-in-Time CompilationCRII: SaTC: Timing Channels in Adaptive Neural NetworksSelected PublicationsAkinsanya, Ayomide and Tegan Brennan. Efficiency Attacks Against Federated Learning of Adaptive Neural Networks. Proceedings of the 6th MICCAI Workshop onDistributed, Collaborative and Federated Learning, Daejeon, South Korea (DeCaF 2025).Akinsanya, Ayomide, and Tegan Brennan. Timing Channels in Adaptive Neural Networks. Proceedings of the 2024 Network and Distributed System Security Symposium, San Diego, California, USA (NDSS 2024).Chen, Adam, Parisa Fathololumi, Mihai Nicola, Jared Pincus, Tegan Brennan, and Eric Koskinen. Better Predicates and Heuristics for Improved Commutativity Synthesis. Proceedings of the 2023 International Symposium on Automated Technology for Verification and Analysis (ATVA 2023).Seemanta Saha, Mara Downing, Tegan Brennan, Tevfik Bultan. PReach: A Heuristic for Probabilistic Reachability to IdentifyHard to Reach Statements. Proceedings of the 44th International Conference on Software Engineering, Seoul, South Korea (ICSE 2022).Tegan Brennan, Seemanta Saha, Tevfik Bultan. JVM Fuzzing for JIT-Induced Side-Channel Detection. Proceedings of the 42nd International Conference on Software Engineering, Seoul, South Korea (ICSE 2020).Tegan Brennan, Nicolas Rosner, Tevfik Bultan. JIT Leaks: Inducing Timing Side Channels Through Just-in-Time Compilation. Proceedings of the 41st IEEE Symposium on Security and Privacy, San Francisco, California, USA (S&P 2020).William Eiers, Seemanta Saha, Tegan Brennan, Tevfik Bultan. Subformula Caching for Model Counting and Quantitative Program Analysis. Proceedings of the 34th IEEE/ACM International Conference on Automated Software Engineering, San Diego, California, USA (ASE 2019).Abdulbaki Aydin, William Eiers, Lucas Bang, Tegan Brennan, Miroslav Gavrilov, Tevfik Bultan, Fang Yu. Parameterized Model Counting for String and Numeric Constraints. Proceedings of the 2018 ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering, Lake Buena Vista, FL, USA (FSE 2018) 400--410.Tegan Brennan, Seemanta Saha, Tevfik Bultan, Corina S. Pasareanu. Symbolic Path Cost Analysis for Side Channel Detection. Proceedings of the 27th ACM SIGSOFT International Symposium on Software Testing and Analysis, Amsterdam, The Netherlands (ISSTA 2018) 27--37.Matthew Cieslak, Wendy Meiring, Tegan Brennan, Clint Greene, Lukas Volz, Jean Marie Vettel, Subhash Suri, Scott Grafton. Compositional measures of diffusion anisotropy and asymmetry. 15th IEEE International Symposium on Biomedical Imaging, Washington, DC, USA (ISBI 2018)123–126.Matthew Cieslak, Tegan Brennan, Wendy Meiring, Lukas J. Volz, Alex Asturias, Subhash Suri, Scott Grafton. Analytic tractography: A closed-form solution for estimating local white matter connectivity with diffusion MRI. NeuroImage 2018 169: 473--484.Tegan Brennan, Nestan Tsiskaridze, Nicolas Rosner, Abdulbaki Aydin, Tevfik Bultan. Constraint Normalization and Parameterized Caching for Quantitative Program Analysis. Proceedings of the 2017 11th Joint Meeting on Foundations of Software Engineering, Paderborn, Germany (FSE 2017) 535--546.CoursesCS284, Spring 2021CS516, Fall 2021CS284, Spring 2022CS284, Fall 2022CS396, Spring 2023CS284, Fall 2023CS396, Spring 2024CS810-E, Spring 2024CS396, Fall 2024CS810, Spring 2025CS396, Fall 2025",
  "content_length": 5295,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:30"
}