{
  "name": "Teh Ying Wah",
  "homepage": "https://umexpert.um.edu.my/tehyw",
  "status": "success",
  "content": "UMEXPERT - PROF. DR. TEH YING WAH PROF. DR. TEH YING WAH Department of Information System Faculty of Computer Science and Information Technology tehywum.edu.my View CV View 1-Page CV Publons Scopus Link Biography As a highly accomplished computer scientist and data mining expert with over 35 years of experience, I have demonstrated exceptional leadership, expertise, and vision in the field. Over the course of my career, I have achieved numerous successes and made significant contributions to the industry. I began as an entry-level computer programmer in 1988 and advanced to become a Professor of Data Mining at the Faculty of Computer Science and Information Technology at the University of Malaya. I obtained my tertiary academic qualifications from Oklahoma City University and the University of Malaya, and I have published more than 90 academic papers in top-tier journals, including Information Fusion and the International Journal of Information Management. I have a remarkable H-index and number of citations in Web of Science, Scopus, and Google Scholars databases, and I have supervised numerous students at all levels of study. My areas of research include data warehouse, data mining, deep learning, IoT, activity recognition, wearable sensors, accelerometers, heart arrhythmia, electrocardiograph, supraventricular premature beat, multivariate time series, edge computing, task scheduling, data streams, mobile computing, speaker verification, language recognition, clustering algorithms, MapReduce, stock market, and sentiment analysis. I have received several grants of more than RM one million, including public, international, and private grants, and I have completed two commercial data science projects for Petronas GTD and Air Liquide. I serve as an Associate Editor for Human-Media Interaction - Frontiers in Psychology and a reviewer for several high-quality journals. I am also an Expert Advisory Panel for Master of Science (Data Science) Degree Program at UTP, Programme Advisory Panel for Bachelor of Business (Honors) in Business Analytics at TARUC, and an external assessor of Swinburne University of Technology (BS of Computer Science program). Additionally, I am an External Assessor for Programme Master Sciences (Computer and Information Engineering), IIUM, and a technical assessor of Swiss National Science Foundation. I have been teaching data mining since 2002, and have produced many highly qualified data scientists and Ph.D. graduates who have gone on to work for top companies like IBM, Amazon Web Services, and Google. As a highly respected and accomplished computer scientist, I have demonstrated exceptional dedication to the industry, and I am confident that my expertise, leadership, and vision make me a highly qualified computer scientist. Hide Collaborator juliana_78 uzairiqbal liyanashuib vimala.balakrishnan esbi cswoo rizal tutut uzair mawpin faizahn gsiewli kslimum saaidal misslaiha View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status Quality Assurance (qa) Services For Artificial Intelligence(ai) Wood Grader Project end Deep Learning Model For Automatic Feature Representation For Assessing Human Activity And Health Monitoring In Elderly Using Smartphone, Wearable Sensors And Iot end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Book Chapter in book 2025 Credibility-Adjusted Data-Conscious Clustering Method for Robust EEG Signal Analysis 2025 A Holistic Anti-Counterfeiting Platform Using NFC and Blockchain Technologies 2024 A scoping review of applications of artificial intelligence in kinematics and kinetics of ankle sprains - current state-of-the-art and future prospects 2022 Mobile and wearable sensors for data-driven health monitoring system: State-of-the-art and future prospect 2006 INTRODUCTION TO DATA MINING 2012 A Comparative Study of Density-based Clustering Algorithms on Data Streams: Micro-clustering Approaches 2007 Development of Specific Disease Data Warehouse for Developing Content from General Guide for Hypertension Screening, Referral and Follow Up.",
  "content_length": 4368,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:36"
}