{
  "name": "Tei-Wei Kuo",
  "homepage": "https://www.csie.ntu.edu.tw/~ktw",
  "status": "success",
  "content": "Welcome to Tei Tei-Wei Kuo Distinguished Professor, ACM Fellow & IEEE Fellow Department of Computer Science and Information Engineering Graduate Institute of Networking and Multimedia National Taiwan University Email: ktw@csie.ntu.edu.tw Tel: +886-223625336 ext. 315 Fax: +886-223628167 Prof. Kuo received his B.S.E. degree in Computer Science and Information Engineering from National Taiwan University in Taipei, Taiwan, in 1986. He received his M.S. and Ph.D. degrees in Computer Sciences from the University of Texas at Austin in 1990 and 1994, respectively. He is currently a distinguished professor of the Department of Computer Science and Information Engineering  of the National Taiwan University and also take a temporary leave to join the City University of Hong Kong as Lee Shau-Kee Chair Professor of Information Engineering, Advisor to President (Information Technology), and Dean of College of Engineering. He served as the Interim President (October 2017 - January 2019) and  the Executive Vice President for Academics and Research (August 2016 ¡V January 2019) of the National Taiwan University, Taipei, Taiwan, ROC, where he was promoted to a full professor in August 2001 and promoted again to a distinguished professor in 2009. He was a distinguished research fellow and the Director of the Research Center for Information Technology Innovation, Academia Sinica between January 20, 2015, and July 31, 2016. He was the chairman of his department between August 2005 and July 2008 and a deputy dean of the College of the Electronic Engineering and Computer Science between Feb 2006 and July 2008, National Taiwan University, Taipei, Taiwan, ROC.  He served as the vice chairman of his department between August 2002 and July 2005. He was an Associate Professor at the Department of Computer Science and Information Engineering, National Taiwan University, between August 2000 and July 2001, and the Department of Computer Science and Information Engineering of the National Chung Cheng University in Chiayi, Taiwan, ROC between August 1994 and July 2000. The research interests of Prof. Kuo include embedded systems, non-volatile memory storage/memory software designs (such as those of flash memory and PCM), neuromorphic computing, and real-time systems. Dr. Kuo is a Fellow of ACM, IEEE, and US Academy of Inventors. He is also now an executive committee member of the IEEE Technical Committee on Real-Time Systems and the Vice Chair of SIGAPP. He also served as a member in the IEEE Fellow Evaluation Committee (Computer Society, 2011, 2013). He received the highest honor from the IEEE Technical Committee on Real-Time Systems in 2017: The Outstanding Technical Achievement and Leadership Award. He also received the Distinguished Leadership Award from the IEEE Technical Committee on Cyber-Physical Systems in 2017. He received the Distinguished Research Award from the Pan Wen Yuan Foundation and the Y. Z. Hsu Scientific Chair Professorship from the  Far Eastern Y. Z. Hsu Science and Technology Memorial Foundation both in 2018, the TECO Award in 2015, the Distinguished Research Award from the ROC National Science Council/Ministry of Science and Technology in 2003, 2011, and 2014, the Distinguished EE Professor Award from the Chinese Institute of Electrical Engineering in 2007, the ROC Ten Young Outstanding Persons Award in 2004, the Young Research Investigators Award from Academia Sinica, Taiwan, ROC, in 2001, and the Investigative Research Award from the Pan Wen Yuan Foundation, Taiwan, ROC, in 1999, and received teaching awards from the National Taiwan University in 2003, 2004, 2005, 2010, 2011, 2012, 2014, and 2015, including the Distinguished Teaching Award (top 1%; 2005).   Prof. Kuo was a chair of the Embedded Systems Group of the Networked Communication Program Office. He is the Program Director of the Computer Science Division of the ROC National Science Council/Ministry of Science and Technology since January 2013. Prof. Kuo serves as the founding Editor-in-Chief of the ACM Transactions on Cyber-Physical Systems. He was an Associate Editor of the Journal of Real-Time Systems (SCI)  (1998-2020), IEEE Transactions on Industrial Informatics (SCI) (2007-2019), and ACM Transactions on Design Automation of Electronic Systems (TODAES) (2014-2020), and a program committee member of many top conferences around the world. Prof. Kuo serves as the General Chair (2008) and Program Chair (2007) of IEEE Real-Time Systems Symposium (RTSS), where RTSS is the flagship conference in real-time systems in the world. He also served as a Program Co-Chair of the Seventh International Conference on Real-Time Computing Systems and Applications (RTCSA 2000), Cheju Island, Korea, December 12-14, 2000, and a Program Co-Chair of the IEEE Real-Time Technology and Applications Symposium (RTAS), Taipei, Taiwan, in 2001. Starting from 2003, he served as a member of the steering committee of IEEE RTCSA, and he served as the steering committee chair of IEEE RTCSA between 2004 and 2008. Since 2014, he also serves as the steering committee chair of IEEE Non-Volatile Memory Systems and Applications Symposium (NVMSA) . He has over 300 technical papers published or been accepted in international journals and conferences and has a book \"Real-Time Database Systems: Architecture and Techniques\" published by Kluwer Academic Publishers (ISBN 0-7923-7218-2, USA). ¡@ Services & Academic Accomplishments Publication List Research & Projects Embedded Systems & Wireless Networks Laboratory Our Students & Alumni Courses at NTU Interesting Links ¡@revised on December 20th, 2020.",
  "content_length": 5612,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:28"
}