{
  "name": "Temiloluwa O. Prioleau",
  "homepage": "https://www.t-prioleau.com",
  "status": "success",
  "content": "t-prioleau.comSearch this siteEmbedded FilesSkip to main contentSkip to navigationAbout MeTemiloluwa PrioleauAssistant Professor, Computer Science Emory UniversityEmail: tpriole@emory.eduI am an Assistant Professor in the Department of Computer Science at Emory University. My research centers around digital and computational health, the use of mobile/wearable technology, and advanced data analytics to develop human-centered computing solutions that enable personalized health. I direct the Augmented Health Lab - a consortium of interdisciplinary researchers working together to tackle grand challenges in healthcare. I am also a core faculty with Emory Global Diabetes Research Center at Emory University, and a faculty affiliate with the Center for Technology and Behavioral Health (CTBH) at Dartmouth College.Open Positions: I am actively recruiting new Ph.D. students to join the my research team. Prospective applicants should apply to the Emory CSI PhD program. I also encourage interested applicants to reach out to me directly via email (tpriole@emory.edu) before applying AND list me as a potential advisor on their application.I was previously an assistant professor in the department of computer science at Dartmouth College and continue to be a research assistant professor in the department. Before joining Dartmouth, I was a Postdoctoral Fellow in the Scalable Health Labs at Rice University. I obtained my M.S. & Ph.D. in Electrical and Computer Engineering from Georgia Institute of Technology, and my B.Sc. also in Electrical and Computer Engineering from The University of Texas at Austin.Recent News2025July - Spotlight article on the DiaTrend dataset and Glucose-ML collection published by Emory Global Diabetes Research Center (EGDRC)July - Joined the Computer Science Department at Emory University.May - Our paper \"One Size Does Not Fit All: The Need for Sex-Specific Precision Medicine in Diabetes Technology\" was published. Congrats to the Diabetes Center Berne team and the larger team of experts in the field.April - Our paper \"Seasonal, weekly, and individual variations in long-term use of wearable medical devices for diabetes management\" was published in Scientific Reports.March - June: Visiting faculty with Emory Global Diabetes Research Center (EGDRC)February - Our DiaTrend project was selected for the Dartmouth OSCARRs award (Open Scholarship Commitment Award for Reproducible Research).February - Our paper \"Empowering Self-Management of Diabetes through Long-Term Wearable Data and Seasonal Visualizations\" was accepted to CHI 2025 as a Late Breaking Work. Congrats to Yanjun Cui and the team!February - Our paper \"Clinical Evaluation of a Polarization-Based Optical Noninvasive Glucose Sensing System\" was accepted to Scientific Reports. Congrats to Colman Leung and the team.2024August - Our paper \"Mealtime Prediction using Wearable Insulin Pump Data to Support Diabetes Management\" was accepted for publication at Scientific Reports.July - Our REFLECT2D project was funded by the NIH. The goal of this work is to develop and evaluate a digital health intervention for adolescents and young adults with type 2 diabetes. Congrats to the amazing team and PI Vajravelu.July - Gave an Invited Talk to EMBS YP (Engineering in Medicine and Biology Society Young Professionals).February - Gave an Invited Talk to the endocrine department at Dartmouth Health.2023September - Our work on Seasonal Patterns in Diabetes Care was featured in Dartmouth News and 10+ other media outlets such as Verve Times and Tech Explorist.September - Our paper \"Understanding Temporal Changes and Seasonal Variations in Glycemic Trends using Wearable Data\" was published in Science Advances (impact factor: 13.6).August - Our paper \"DiaTrend: A dataset from Advanced Diabetes Technology to Enable Development of Novel Analytic Solutions\" was published in Scientific Data.July - Gave an invited talk to the Texas A&M Research for Undergraduates in Computer Science and Data Science program.June - Gave an invited talk at Dartmouth Health on Leveraging Digital Technology and Data Science to Understand and Transform Disease Management.March - Released our first open source dataset - DiaTrend - to advance research & development of novel analytic solutions for diabetes and beyond.See more news!2022November - Attended and presented our research at Health Data Science Symposium at Harvard.September - Our research was featured in Dartmouth News.August - Keynote Speaker at KDD Health Day.August - Our paper \"A Computational Framework for Discovering Digital Biomarkers of Glycemic Control\" was published in npj Digital Medicine (impact factor: 15.3 in 2021).August - Taught a mini-course on \"Computing for Healthcare\" as part of the Dartmouth Adventures in STEM program.July - Gave an invited talk on \"Opportunistic Use of Digital Devices and Data to Improve Diabetes Care\" at IEEE Engineering in Medicine and Biology Conference 2022.May - Participated and gave an invited talk at the CHI Workshop on Grand Challenges in Personal Informatics and AI.April - Accepted to the mHealth Training Institute 2022 (mHTI).March - Our paper \"Investigating Temporal Patterns of Glycemic Control around Holidays,\" was accepted to EMBC 2022.March - Gave an invited talk for Women's History Month at NSF PATHS-UP.March - Our paper \"A Hybrid Approach to Realizing Personalized Healthcare\" was accepted to CHI 2022 workshop on \"Grand Challenges for Personal Informatics and AI\".January - Gave an invited talk on research in the AH-Lab to graduate students in the Masters in Digital Arts program.2021October - Invited Speaker to 2021 Project iSWEST (Innovating Solutions with Engineering Science and Technology) Mentoring SessionSeptember - Awarded NSF subaward to mentor new postdoc, Prajakta Belsare, who was selected as a 2021 Computing Innovation Fellow (CIFellow)August - Gave an invited talk on our GlucoMine paper at the Endocrinology Ground Rounds at Dartmouth Hitchcock Medical Center (DHMC)August - Co-PI on NSF Research Trainee (NRT) grant for developing graduate students in sensor science, technology, and innovation (award #: 2125733)July - Our paper \"GlucoMine: A Case for Improving the Use of Wearable Device Data in Diabetes Management\" was accepted to IMWUT (see paper)May - Our paper Learning from the Experiences of COVID-19 Survivors was published in JMIR Formative ResearchApril - Our paper \"SymptomID: A Framework for Rapid Symptom Identification in Pandemics\" was accepted to TMIS (see paper)February - Gave an invited talk as the PHT180 Distinguished Speaker for Personalized Healthcare Technology at Rochester Institute of Technology (RIT) (see video)February - Featured in a news story by alma mater - The University of Texas at AustinJanuary - Invited Speaker to the Women in Computer Science and Engineering (W-CSE) Mentoring SeminarJanuary - Gaven an invited talk titled \"Enhancing the utility of Personal Health Data to Improve Diabetes Management\" at the CTBH (Center for Technology and Behavioral Health)2020November - Invited speaker to \"Inferential Methods and Epidemiology (PH100/101)\" class for Masters in Public Health students at The Dartmouth InstituteNovember -  Invited professor at Virtual Shabazz LLC ProgramOctober - Featured on The Africa I Know: an amazing initiative to \"positively change the narrative about Africa\" (see my story)October - Panelist for \"Picture a Scientist,\" discussing topics on women and diversity in Science.September - Gave an invited talk titled \"Leveraging Data Science in the Fight against COVID-19\" at the 2020 virtual Grace Hopper Celebration (abstract here)August - Co-PI on NSF SenSE grant for improving closed-loop artificial pancreas systems used in diabetes management (award # 2037267)July - C19 Insider Scoop project was featured on Dartmouth NewsJuly - Presented two of our papers on Data-driven Insights and Blood Glucose Prediction at IEEE Engineering in Medicine & Biology Conference July - Gave an invited talk titled \"Data Science for Health: Applications for Diabetes and COVID-19\" at the Summer Web-Based Institute for Technologies in CompSci & Healthcare (SWITCH) - A 5-week summer research program for middle & high school teachers.June - Awarded NSF RAPID Grant for C19 Insider Scoop project (award # 2031546)April - Awarded Dartmouth Spark Funding for C19 Insider ScoopMarch - Two of our papers on Adherence to Personal Health Devices and Reflection on Health Data in Diabetes were accepted to Pervasive Health2019August - Received the Walter and Constance Burke Research Initiation Award from Dartmouth College (2019 - 2022)May - Awarded pilot research funding from the Center for Technology and Behavioral Health (CTBH) for the Digital SMD project (2019 - 2020)EarlierRice Academy Post-doctoral Fellow, Rice University (2016 - 2018)Sam Chih Foundation Award, Georgia Institute of Technology (2016)Graduate Research Fellowship, National Science Foundation (NSF), (2013 - 2016)Graduate  Research Fellowship, Achievement Rewards for College Scientists (2012 - 2016)1st Place in Student Paper Competition, IEEE Engineering in Medicine and Biology Conference (2014)Research Poster Competition Winner, Georgia Tech Research & Innovation Conference (2014)IEEE Signal Processing Society (SPS) Travel Grant, International Conference on Acoustics, Speech and Signal Processing (ICASSP)Google United Negro College Fund - UNCF Scholar (2013)Google Anita Borg Scholarship Finalist (2013)Ford Foundation Fellowship Honorable Mention (2013)Texas Instruments Analog Minority Scholarship (2010)Marathon Oil Company Scholarship (2008 - 2010)Academic Leaders Hall of Fame, University of Texas at Austin (2009)Boeing Diversity Scholarship (2009)Rockwell Collins Diversity Scholarship (2008)Cisco Diversity Scholarship (2007)Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 9875,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:30"
}