{
  "name": "Temuulen Sankey",
  "homepage": "https://nau.edu/cefns/natsci/seses/faculty/teki-sankey",
  "status": "success",
  "content": "School of Earth and Sustainability | Protecting our environment at NAU NAU offers almost 250 sustainability courses across academic departments — Green NAU 4–5.3% projected career growth over the next decade — Hanover Digital Gold award winner for being a Bicycle Friendly University — The League of American Bicyclists Where ideas take root If you’re asking big questions about the planet’s future and your role in shaping it, the School of Earth and Sustainability (SES) is for you. Whether you’re collecting water samples in the field, coding climate models in the lab, or designing sustainable systems with community partners, your education will be as immersive as the landscapes around you at NAU. Why study Earth and Sustainability at NAU Flagstaff offers a unique landscape, surrounded by forests, mountains, rivers, and deserts. You’ll study at some of the world’s most extraordinary natural laboratories: The Grand Canyon, the San Francisco Peaks, the Colorado Plateau, and volcanic fields across the Southwest. At SES, you’ll be joining a community of explorers, problem-solvers, and changemakers tackling challenges like climate change, biodiversity loss, natural hazards, and sustainable design. Ready to plant the seeds of change? SES students are naturally curious, bolder thinkers and highly driven. You’ll explore the planet from every angle: coding climate models, collecting data in the field, mapping groundwater, or designing sustainable systems. Our interdisciplinary programs help you connect science, people, and policy to tackle global challenges from the ground up. What you can expect Studying in the Grand Canyon Coursework will be a blend of classroom learning with labs, field experiences, and independent research. Learn through applied research, capstone projects, and internships. Deepen your expertise with thesis research, assistantships, and conferences Learning outcomes for undergraduates At the School of Earth and Sustainability you will: explore the concept of global and local sustainability using examples from natural science, social science, and humanities perspectives. identify and effectively communicate environmental issues and sustainable solutions using natural science, ethical, and social science principles. learn about the components of, and the interactions between, the Earth system such as lithosphere, hydrosphere, soils, atmosphere, and how people and society interact with these systems. investigate the effects of resource use and management within linked natural and social systems and learn ways to maintain healthy ecosystem services. Dedicated support Faculty who teach through discovery Partner with faculty experts who guide hands-on learning in the field, lab, and beyond. Our professors support student success through active involvement in internships, collaborative research and professional development. Meet the faculty Supportive community SES programs are designed with student support in mind. Alumni- and donor-funded scholarships help cover expenses and open doors to opportunities like summer fieldwork and research projects. At SES, you’ll get an education that’s both personal and transformative. Graduate study at SES You can pursue advanced training in Environmental Sciences & Policy, Geology, Climate Science & Solutions, and a PhD in Earth Sciences & Environmental Sustainability. Whether your goal is deep research, applied solutions, or policy leadership, you’ll find programs designed to expand your expertise and impact. Before applying to a thesis-based program, you must connect with a faculty sponsor whose research aligns with your interests. This ensures your graduate experience is both personal and purposeful from the start. Once you have identified and confirmed a faculty sponsor to work with, you’ll need to complete the following steps to apply to an SES graduate or PhD program. Steps to apply to an SES graduate or PhD program Complete the online application for the NAU Office of Graduate and Professional Students and pay the required application fee. Submit transcripts for all undergraduate and graduate coursework. Provide three letters of recommendation from academic or professional supervisors. Write a statement of your interests, goals, and reasons for pursuing an advanced degree at SES. Be sure to include the name of your faculty sponsor for all thesis-based programs (ESP MS, GLG MS, and ESE PhD) Apply by the January 1 deadline. Take the next step Tour campus Request info Apply now School of Earth and Sustainability degrees School of Earth and Sustainability undergraduate degrees BS in Environmental Sciences BS in Environmental Sciences with Environmental Geology emphasis BS in Environmental Sciences with Applied Statistics emphasis BS in Environmental Sciences with Environmental Administration and Policy emphasis BS in Environmental Sciences with Biology emphasis BS in Environmental Sciences with Chemistry emphasis BS in Environmental Sciences with Environmental Communication emphasis BS in Environmental Sciences with Environmental Management emphasis BS in Environmental Sciences with Climate emphasis BA in Environmental and Sustainability Studies BS in Environmental and Sustainability Studies BS in Geology BSED in Secondary Education - Earth Science BSED in Secondary Education - General Science School of Earth and Sustainability graduate degrees MS in Climate Science and Solutions MS in Environmental Sciences and Policy MS in Environmental Sciences and Policy with Science and Policy emphasis MS in Environmental Sciences and Policy with Paleoenvironmental Sciences emphasis MS in Geology PHD in Earth Sciences and Environmental Sustainability PHD in Earth Sciences and Environmental Sustainability with Climate and Environmental Change emphasis PHD in Earth Sciences and Environmental Sustainability with Earth Systems emphasis PHD in Earth Sciences and Environmental Sustainability with Ecology, Evolution and Conservation Biology emphasis PHD in Earth Sciences and Environmental Sustainability with Engineering Sustainable Systems emphasis PHD in Earth Sciences and Environmental Sustainability with Environment and Society emphasis \"Going through college as a first-generation student has been much more challenging and isolating than I imagined, especially since I started NAU as an undeclared student uncertain of my future. Geologic Disasters became the highlight of my day. For once, school did not feel like an obligation, and instead was something I enjoyed doing. By the fifth week of the semester, I had officially declared geology as my major and identified myself as a scientist for the first time in my life.\" Ready to apply? If you're excited to explore big questions, tackle real challenges, and make a lasting difference, we’re ready for you. Apply to the School of Earth and Sustainability and start building the future you believe in. Apply now Follow School of Earth and Sustainability on social media Support the next generation of environmental leaders Your gift helps students turn their passion for the planet into real-world impact. From hands-on research in Flagstaff’s forests to climate data analysis that reaches decision-makers, SES students are working to understand and shape a sustainable future. When you give, you’re investing in their growth—and the future of our world. Give now Accreditation Explore the School of Earth and Sustainability’s accredited programs. View accredited programs Northern Arizona University Contact our admissions team 928-523-5511 admissions@nau.edu Request information School of Earth and Sustainability 624 S Knoles Dr Flagstaff, AZ 86011",
  "content_length": 7647,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:30"
}