{
  "name": "Tengyu Ma 0001",
  "homepage": "http://ai.stanford.edu/~tengyuma",
  "status": "success",
  "content": "Tengyu Ma's Homepage Tengyu Ma (马腾宇) pronunciation The first name is pronounced as Tung-ü, where ü is roughly a mixture of i and u, as in German. I'm more than happy to accept any approximation, so please feel free to use your favorite variants/surrogates! Assistant Professor of Computer Science Stanford University Office: Gates 328 Email: first name last name@stanford.edu. An FAQ for students who email the first time. Twitter, Google Scholar Papers (by Topic) / Teaching & Service / Awards About Hi! I am an assistant professor of computer science at Stanford. My research interests broadly include topics in machine learning, algorithms and their theory, such as deep learning, (deep) reinforcement learning, pre-training / foundation models, robustness, non-convex optimization, distributed optimization, and high-dimensional statistics. Current Ph.D. students and post-docs Caroline Choi (co-advised with Ludwig Schmidt) Luke Bailey (co-advised with Tatsunori Hashimoto) Kaiyue Wen (co-advised with Percy Liang) Thomas Chen Arvind Mahankali Neil Band (co-advised with Tatsunori Hashimoto) Garrett Thomas Alumni Kefan Dong (Ph.D. 2025, Member of Technical Staff at OpenAI) Hong Liu (Co-founder of Voyage AI, Senior Staff Researcher at MongoDB) Sang Michael Xie (Ph.D. 2024, co-advised with Percy Liang, research scientist at Meta GenAI) Jeff Z. HaoChen (Ph.D. 2024, Member of Technical Staff at Anthropic) Margalit Glasgow (Ph.D. 2024, co-advised with Mary Wootters, postdoc at MIT) Zhiyuan Li (postdoc, assistant professor at TTIC) Ananya Kumar (Ph.D. 2023, co-advised with Percy Liang, Research Lead at OpenAI) Yining Chen (Ph.D. 2023, research scientist at OpenAI) Shibani Santurkar (postdoc, now Member of Technical Staff at OpenAI) Colin Wei (Ph.D. 2022, now Member of Technical Staff at OpenAI) Honglin Yuan (Ph.D. 2022, now quantitative researcher at Citadel Securities) Yuanzhi Li (postdoc, now research scientist at Meta) Publications Most Recent Works Pretraining / Foundation Models / Language Models Robustness / Out-of-Domain Generalization Deep Learning Theory (Generalization and Non-convex Optimization) Reinforcement Learning Uncertainty Quantification Provable Machine Learning Algorithms Distributed Machine Learning Other Papers Teaching Statistical/Machine Learning Theory (CS229T/STATS231, CS229M/STATS214), Autumn 2018, Winter 2021 Machine Learning (CS229/STATS229), Spring 2019-2020, Autumn 2020 Introduction to Nonparametric Statistics (STATS205), Autumn 2019, Spring 2021 Service Area Chair or PC committee: AAAI 2019-2020, ICLR 2019-2021, NeurIPS 2019-2021, ALT 2017-2018, ITCS 2018, STOC 2020, COLT 2020-2021 Awards 2022 Samsung AI Researcher of the Year Sloan Research Fellowships 2021 NSF CAREER Award ACM Doctoral Dissertation Award Honorable Mention 2018 COLT Best Paper Award 2018 NIPS Best Student Paper Award 2016 Siebel Scholarship Princeton Honorific Fellowship 8th Place in William Lowell Putnam Mathematical Competition 2010 Silver Medal in International Mathematical Olympiad (IMO) 2007 Last update: 2021/02. Template adapted from Danqi Chen's.",
  "content_length": 3091,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:32"
}