{
  "name": "Teresa K. Attwood",
  "homepage": "https://www.research.manchester.ac.uk/portal/teresa.k.attwood.html",
  "status": "success",
  "content": "Terri Attwood - Research Explorer The University of Manchester Terri Attwood, BSc, PhD Prof Emeritus Professor, Computer Science Teaching https://orcid.org/0000-0003-2409-4235 Personal profile Biography1982BSc Biophysics, University of Leeds 1984PhD Biophysics, University of Leeds 1985-1993Postdoctoral Research Associate, University of Leeds 1993-1999Royal Society University Research Fellow, University College London 1999-2002Royal Society University Research Fellow, University of ManchesterResearch interestsBioinformatics My research lies in the field of bioinformatics, specifically in the area of protein sequence analysis. I maintain a database of protein fingerprints (PRINTS), which is accessible for searching via the Web and available for local installation via anonymous ftp. PRINTS is a companion resource to PROSITE, providing both a detailed annotation resource for protein families, and a diagnostic tool for newly-determined sequences (it therefore has particular relevance in the current drive to analyse, and functionally annotate, data from the various genome projects). Central to my research is the provision of a diagnostic resource for G-protein-coupled receptors. For this diverse group of proteins, ~250 fingerprints have been designed, allowing us to distinguish receptors at the clan, superfamily, family and receptor subtype levels. Future detailed analyses will show whether it is possible to discriminate between receptors on the basis of the ligands they bind, or the particular G-proteins to which they couple. Another important avenue of research is the investigation of methods to improve fingerprint diagnostic performance, with a view to identifying distant family relationships and penetrating deeper into the Twilight Zone (e.g., by explicit consideration of structural information and generating PRINTS-derived substitution matrices). An essential aspect of the work involves manual manipulation of protein sequence alignments. To facilitate this process, we have developed a suite of visualisation tools called Utopia. The newest of the tools is Utopia Documents, a novel PDF reader that adds interactive functionality to static PDF articles. Utopia Documents powers the Semantic Biochemical Journal published by Portland Press Ltd. Projects within the group include: Design of tools for linking research articles with their underlying dataAnalysis of functional motifs that distinguish GPCR subtypesStructural and functional analysis of kinasesNew approaches for sequence alignment Research Group(s) Advanced InterfacesLazarus Research in my group involves using computers to analyse and understand biological information. Our focus is on the amino acid sequences of proteins, how these can be grouped into related families, and what these family relationships can tell us about protein function, structure and evolution. Members of a family in which we have a keen interest (G protein-coupled receptors) are acted upon by more than 50% of prescription drugs – this makes them especially interesting to pharmaceutical companies. We have developed an analysis method (protein fingerprinting) that allows us to uniquely diagnose new members of this and many other important families; it is used today in international projects to help annotate the results of newly-sequenced genomes. We are also interested in using computers to allow readers to make better use of scientific articles. In particular, we have developed software that ‘brings life’ to electronic versions of papers by adding interactive capabilities to them: e.g., by directly linking what is written with interactive software tools and online databases. The software (called Utopia) offers readers the best of both worlds – i.e., access both to the original research and to analysis tools that allow them to explore research findings in real time. Teaching2015/16BIOL10000Academic Tutorials Year 1Teaching Assistant2015/16BIOL21090DissertationTeaching Assistant2015/16BIOL22020Science Ethics and Society (Level 2)Teaching Assistant2015/16BIOL30000Academic Tutorials Year 3Teaching Assistant2015/16BIOL30030ProjectsTeaching Assistant2015/16BIOL30101Project Literature ReviewTeaching Assistant2015/16BIOL60791BioinformaticsCourse Leader Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Terri Attwood is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Protein Family Biochemistry, Genetics and Molecular Biology 100% Annotation Computer Science 69% Peptide Sequence Biochemistry, Genetics and Molecular Biology 61% Web Service Computer Science 55% PROSITE Biochemistry, Genetics and Molecular Biology 46% G Protein Coupled Receptor Biochemistry, Genetics and Molecular Biology 43% SWISS-PROT Biochemistry, Genetics and Molecular Biology 39% Proteomics Biochemistry, Genetics and Molecular Biology 23% View full fingerprint Research output 115 Article 27 Conference contribution 13 Chapter 8 Book 11 More 4 Anthology 2 Entry for encyclopedia/dictionary 2 Letter 1 Commentary/debate 1 Other contribution 1 Preprint Research output per year Research output per year TeSS: a platform for discovering life-science training opportunitiesBeard, N., Bacall, F., Nenadic, A., Thurston, M., Goble, C. A., Sansone, S.-A., Attwood, T. K. & Wren, J. (Editor), 11 Feb 2020, In: Bioinformatics.Research output: Contribution to journal › Article › peer-review Open Access Content Provider 100% A global perspective on bioinformatics training needsAttwood, T., 17 Feb 2017, bioRxiv, 19 p.Research output: Preprint/Working paper › Preprint Open Access Short Courses 100% Students 100% Occupations 100% Occupational Career 100% Educational Level 100% A global perspective on evolving bioinformatics and data science training needsAttwood, T., Blackford, S., Brazas, M. D., Davies, A. & Schneider, M. V., 2017, In: Briefings in Bioinformatics.Research output: Contribution to journal › Article › peer-review Open Access Short Courses 100% Occupations 100% Occupational Career 100% Educational Level 100% Data Transmission 100% A new pan-European Train-the-Trainer programme for bioinformatics: Pilot results on feasibility, utility and sustainability of learningAttwood, T., 2017, In: Briefings in Bioinformatics.Research output: Contribution to journal › Article › peer-review Open Access Training Material 100% Training Session 100% Teaching Practice 100% Computational Approach 100% Train-The-Trainer 100% BioCIDER: a Contextualisation InDEx for bio-logical Resources discoveryHorro, C., Cook, M., Attwood, T., Brazas, M. D., Hancock, J. M., Palagi, P., Corpas, M. & Jimenez, R., 2017, In: Bioinformatics.Research output: Contribution to journal › Article › peer-review Open Access Training Material 100% Resource Discovery 100% Shopping Online 100% Database Software 100% Software Development Tool 100% View all 174 research outputs Activities 19 Participating in a conference, workshop, exhibition, performance, inquiry, course etc 7 Organising a conference, workshop, exhibition, performance, inquiry, course etc 3 Invited talk 2 Other Activities per year H3ABioNet Scientific Advisory BoardAttwood, T. (Other)2018 → 2022Activity: Internal positions, career professional development, other peer review and other › Other › Research GOBLET Annual Meeting 2017 and satellite eventsAttwood, T. (Chair)21 Nov 2017Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research ELIXIR-UK Annual All-Hands MeetingAttwood, T. (Chair)1 Nov 2017Activity: Participating in or organising event(s) › Participating in a conference, workshop, exhibition, performance, inquiry, course etc › Research NBIS Training workshopAttwood, T. (Chair)21 Sept 2017Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research ISMB/ECCB 2017Attwood, T. (Chair)21 Jul 2017Activity: Participating in or organising event(s) › Participating in a conference, workshop, exhibition, performance, inquiry, course etc › Research View all 31 activities Impacts PRINTS and InterPro – online resources that facilitate discovery of pharmaceutical and commercially relevant information in proteomic and genomic data-setsAttwood, T. (Participant), Mitchell, A. (Participant), Mabey, J. (Participant), Croning , M. (Participant), Scordis, P. (Participant), Bradley, P. (Participant), Uddin, A. (Participant), Selley, J. (Participant), Maudling, N. (Participant), Moulton , G. (Participant), Gaulton, A. (Participant) & Wright, W. (Participant)Impact: Economic, Health and wellbeing, Technological The Utopia Suite: realising semantic knowledge discovery and data linkage in the publishing and pharmaceutical industriesAttwood, T. (Participant), Pettifer, S. (Participant), Sinnott, J. (Participant), Thorne, D. (Participant), Marsh, J. (Participant) & Mcdermott, P. (Participant)Impact: Technological, Economic",
  "content_length": 9256,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:39"
}