{
  "name": "Terry R. Payne",
  "homepage": "https://www.liverpool.ac.uk/computer-science/staff/terry-payne",
  "status": "success",
  "content": "Dr Terry Payne | Our people | University of Liverpool Skip to main content About Terry has been research in the area of agent-based computing and knowledge-based systems and services for the last 30 years, and has published more than 195 peer-reviewed papers in the area. His specific interest is in the use of ontological knowledge for the support of agent-based service discovery and provision and is currently exploring the exploration of dialogue-based negotiation approaches to establish contextually-relevant ontological alignment between interacting agents on the fly. This supports the longer term aim of describing, discovering and utilising capability descriptions that agents offer or exploit when collaborating within open and pervasive environments, such as the Internet of Things. He has received numerous research awards, including a Best Industrial Paper award in 2006, and two Distinguished Research paper awards in 2011 & 2012 that recognised his fundamental contribution to his research field his research. He was Program co-chair for the International Semantic Web Conference in 2023, and is a member of SWSA - the Semantic Web Science Association, responsible for promoting and exchanging scholarly work in Semantic Web and related fields throughout the world. He is a Senior Fellow of the Higher Education Authority (SFHEA), and was also awarded a University Learning & Teaching Excellence award in 2013, 2016, 2019 and 2022 for innovative and technology enhanced teaching. His teaching was also recognised by the student body in 2016 when he was awarded the Guild of Students Best Teacher (Faculty of Science) Award. Prizes or Honours 2022: Faculty Learning, Teaching and Student Experience Award (Faculty of Science and Engineering, University of Liverpool, 2022) Learning, Teaching and Student Experience Award (Faculty of Science & Engineering) (University of Liverpool, 2019) Liverpool University Guild of Students Teacher of the Year Award (Science & Engineering) (University of Liverpool Guild of Students, 2016) University Learning & Teaching Excellence award for Technology Enhanced Learning (University of Liverpool, 2016) 2017: EAPC Best Poster Award (2016) University Learning & Teaching Excellence award for innovative teaching (University of Liverpool, 2013) SWSA 2012 10-yr Distinguished Paper Award (SWSA - Semantic Web Science Association, 2012) SWSA 2011 10-yr Distinguished Paper Award (SWSA - Semantic Web Science Association, 2011) 2006: AAMAS 2006 DARPA Award for Best Industrial and Applied Paper (Autonomous Agents and Multi Agent Systems Conference, 2006)",
  "content_length": 2602,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:47"
}