{
  "name": "Teruki Honma",
  "homepage": "http://www.clst.riken.jp/en/science/labs/ssb/biof/sbmd",
  "status": "success",
  "content": "Structure-based Molecular Design Team | 理化学研究所 ライフサイエンス技術基盤研究センター Large Small language About CLST > CLST Logo > Pamphlet > STAFF > CLST Advisory Council Report > Organization > History of RIKEN CLST Jobs at CLST Access Contact us Links Labs Labs & Program Center Director's Strategic Program RIKEN CLST-JEOL Collaboration Center RIKEN CLST-DAIKIN Collaboration Center Publications FANTOM Technologies & Facilities Technologies of CLST Service of CLST NMR facility GeNAS PET Academy Radiosynthesis Database of PET Probes Topics Research Latest publications from CLST. News Awards, agreements, and other news. Events Upcoming and past events including seminars, symposiums, open days. For Public To let you know about our research, this area contains 4 types of information about CLST; “Article”, “Videos”, “Event” and “Study”. At “Article”, you can read articles on interviews and lectures, and you can enjoy the videos about CLST at “Videos”. If you want to meet and talk directly with the researcher, “Visit” give you some information of such events. You can find more difficult contents to know about our research deeply at “Study”. Team LeaderTeruki Honma  Ph.D. 1-7-22 Suehiro-cho, Tsurumi-ku, Yokohama, 230-0045 JAPAN Tel: 045-503-9433 Research AreaWe plan to develop methods for designing novel small molecules, nucleic acids, and proteins, in order to help to accelerate drug development and the elucidation of living systems, and also develop an FBDD (Fragment based Drug Discovery) method for targeting biomolecules currently difficult to make susceptible of binding to small molecules. Main Publications List 1A small-molecule AdipoR agonist for type 2 diabetes and short life in obesity.Okada-Iwabu M, Yamauchi T, Iwabu M, Honma T, Hamagami K, Matsuda K, Yamaguchi M, Tanabe H, Kimura-Someya T, Shirouzu M, Ogata H, Tokuyama K, Ueki K, Nagano T, Tanaka A, Yokoyama S, Kadowaki T.Nature, 503(7477), 493-499 (2013).2A Pyrrolo-Pyrimidine Derivative Targets Human Primary AML Stem Cells in VivoSaito Y, Yuki H, Kuratani M, Hashizume Y, Takagi S, Honma T, Tanaka A, Shirouzu M, Mikuni J, Handa N, Ogahara I, Sone A, Najima Y, Tomabechi Y, Wakiyama M, Uchida N, Tomizawa-Murasawa M, Kaneko A, Tanaka S, Suzuki N, Kajita H, Aoki Y, Ohara O, Shultz LD, Fukami T, Goto T, Taniguchi S, Yokoyama S, Ishikawa F.Sci Transl Med, 5(181), 181ra52 (2013).3Structure of the trypanosome cyanide-insensitive alternative oxidase.Shiba T, Kido Y, Sakamoto K, Inaoka DK, Tsuge C, Tatsumi R, Takahashi G, Balogun EO, Nara T, Aoki T, Honma T, Tanaka A, Inoue M, Matsuoka S, Saimoto H, Moore AL, Harada S, Kita K.Proc Natl Acad Sci U S A, 110(12), 4580-4585 (2013).4Prediction of ligand-induced structural polymorphism of receptor interaction sites using machine learning.Takaya D, Sato T, Yuki H, Sasaki S, Tanaka A, Yokoyama S, Honma T.J Chem Inf Model, 53(3), 704-716 (2013).5Identification of novel drug-resistant EGFR mutant inhibitors by in silico screening using comprehensive assessments of protein structures.Sato T, Watanabe H, Tsuganezawa K, Yuki H, Mikuni J, Yoshikawa S, Kukimoto-Niino M, Fujimoto T, Terazawa Y, Wakiyama M, Kojima H, Okabe T, Nagano T, Shirouzu M, Yokoyama S, Tanaka A, Honma T.Bioorg Med Chem, 20(12), 3756-3767 (2012).6A novel Pim-1 kinase inhibitor targeting residues that bind the substrate peptide.Tsuganezawa K, Watanabe H, Parker L, Yuki H, Taruya S, Nakagawa Y, Kamei D, Mori M, Ogawa N, Tomabechi Y, Handa N, Honma T, Yokoyama S, Kojima H, Okabe T, Nagano T, Tanaka A.J Mol Biol, 417(3), 240-252 (2012).7Prediction of sites of metabolism in a substrate molecule, instanced by carbamazepine oxidation by CYP3A4.Yuki H, Honma T, Hata M, Hoshino T.Bioorg Med Chem, 20(2), 775-783 (2012).8Combining machine learning and pharmacophore-based interaction fingerprint for in silico screening.Sato T, Honma T, Yokoyama S.J Chem Inf Model, 50(1), 170-185 (2010).9In silico functional profiling of small molecules and its applications.Sato T, Matsuo Y, Honma T, Yokoyama S.J Med Chem, 51(24), 7705-7716 (2008).10Predicting human liver microsomal stability with machine learning techniques.Sakiyama Y, Yuki H, Moriya T, Hattori K, Suzuki M, Shimada K, Honma T.J Mol Graph Model, 26(6), 907-915 (2008). >>>ALL Publications Member  *concurrent Teruki Honma\t\t\t\tTeam Leader Tomohiro Sato\t\t\t\tResearch Scientist Daisuke Takaya\t\t\t\tResearch Scientist Hitomi Yuki\t\t\t\tResearch Scientist Labs & ProgramDivision of Structural and Synthetic BiologyStructural Biology GroupProtein Functional and Structural Biology TeamSupramolecular Structural Biology TeamStructural Bioinformatics TeamPost-transcriptional Control Research UnitTranslation Factors Structural Biology UnitBio-functional Molecule Development GroupNonnatural Amino Acid Technology TeamStructure-based Molecular Design TeamEpigenetics Drug Discovery UnitNMR FacilityNMR Facility　ALL PublicationsDrug Discovery Platform UnitsDrug Discovery Structural Biology Platform UnitDrug Discovery Computational Chemistry Platform UnitDivision of Genomic TechnologiesLife Science Accelerator Technology GroupTranscriptome Technology TeamGenome Information Analysis TeamGenomics Algorithms Development UnitGenomics Miniaturization Technology UnitLarge Scale Data Managing UnitOmics Application Technology GroupCellular Function Conversion Technology TeamCell Conversion Technology TeamGenetic Diagnosis Technology UnitEpigenome Technology Exploration UnitGenome Network Analysis Support FacilityPreventive Medicine & Diagnosis InnovationNucleic Acid Diagnostic System Development UnitDivision of Bio-Function Dynamics ImagingImaging Platform and Innovation GroupLabelling Chemistry TeamChemical Biology TeamBio-Function Imaging TeamCellular Function Imaging TeamPathophysiological and Health Science TeamNext-Generation Imaging TeamFunctional Architecture Imaging TeamMolecular Dynamics Imaging UnitMicro-Signaling Regulation Technology UnitBiosystem Dynamics GroupUltrastructural Research TeamGenetic Engineering TeamAnimal Resource Development UnitCellular Dynamics Analysis UnitPhyloinformatics UnitDrug Discovery Platform UnitsDrug Discovery Chemistry Platform UnitDrug Discovery Imaging Platform UnitCenter Director's Strategic ProgramMolecular Network Control Research ProjectMolecular Network Control Factors Development UnitMolecular Network Control Genomics UnitMolecular Network Control Imaging UnitRIKEN CLST-JEOL Collaboration CenterAdvanced Solid-State NMR UnitAdvanced Solid-State NMR Unit - Publication ListSuper-High Magnetic Field NMR Utilization UnitMulti-Modal Microstructure Analysis UnitRIKEN CLST-DAIKIN Collaboration CenterHealth Estimation UnitHealth Solution Unit CLST was reorganized into three centers according to the RIKEN 4th Medium-Term Plan from April 1, 2018. For the latest information of Structure-based Molecular Design Team, please visit the following websites.> The webpage of Laboratory for Structure-Based Molecular Design, Center for Biosystems Dynamics Research [http://www.bdr.riken.jp/en/research/labs/honma-t-labo/index.html]> If you continue to browse this site, click here.",
  "content_length": 7070,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:43"
}