{
  "name": "Teruhito Kanazawa",
  "homepage": "https://www.nii.ac.jp/en/faculty/digital_content/kanazawa_teruhito",
  "status": "success",
  "content": "KANAZAWA Teruhito - Digital Content and Media Sciences Research Division - Faculty - Research - å½ç«æ å ±å­¦ç ç©¶æ / National Institute of Informatics ACCESS CONTACT æ¥æ¬èª About NII Introduction Greeting from the Director-General Mission & Strategies Overview of NII History Administrative Council Organization Charts Intellectual Properties Staff / Budget Outline and Catalogue of National Institute of Informatics PR Video International Exchange International Exchange based on MOU Conclusion of International Exchange Agreements or MOUs NII International advanced lectures series on ICT NII Shonan Meeting Global Liaison Office (GLO) - DAAD Alumni NII Library NII Library Usage Guide(For General Public) NII Library Accessing databases via GakuNin International Seminar House for Advanced Studies Advanced ICT Center Publications NII Today PR Video Recruitment Access National Institute of Informatics (National Center of Sciences) Kashiwa Annex International Seminar House Contact News Event Link Sitemap Research Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division Information Systems Architecture Science Research Division Digital Content and Media Sciences Research Division Information and Society Research Division Directory of Faculty and Staff index Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education:A New Approach Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports Service Network SINET6 Research Data Cloud GakuNin RDM JAIRO Cloud CiNii Research CiNii Books IRDB Authentication Infrastructure GakuNin eduroam JP UPKI Notice of Authentication Service Maintenance Cloud GakuNin Cloud GakuNin Cloud Adoption Support Service GakuNin Cloud Gateway Service GakuNin Cloud On-Demand Configuration Service SINETStream Information Security NII Security Operation Collaboration Services (NII-SOCS) Princess Rinrin's information security column Scholarly Communication NACSIS-CAT/ILL E-resources Data Sharing Services KAKEN NII-REO Collaboration Collaboration with University Libraries Japan Alliance of University Library Consortia for E-Resources Future Scholarly Information Systems Committee Japan Consortium for Open Access Repository SPARC Japan Research Data Ecosystem Development Project to Promote the Use of AI HPCI mdx Academic Information Infrastructure Open Forum Human Resource Development GakuNin LMS Education and Training Services NII JMOOC | gacco Experts in Information Science Computer Science Park Graduate Program Research Research Faculty Digital Content and Media Sciences Research Division KANAZAWA Teruhito Digital Content and Media Sciences Research Division KANAZAWA Teruhito Digital Content and Media Sciences Research Division, Associate Professor Research Fields: Information Access Technology, Bibliographic and Human Identification, Machine Learning, Big Data Processing Degrees: Ph.D. (Engineering) Detail: http://researchmap.jp/tkana/ Introduction Developing log infrastructure for better services Who used what, when, and where? National Institute of Informatics (NII) offers various content services. One of these is the Japanese article search service CiNii (Scholarly and Academic Information Navigator), which has the largest database of its kind in Japan and sees the greatest number of access attempts. A worldwide trend has emerged in recent years for \"open science,\" which aims to make information on scientific research available to the public whenever possible. In response, NII is seeking to greatly expand the service content of CiNii. Meanwhile, we are supporting the growth of CiNii utilizing logs. In the case of CiNii, logs record details such as who looked at what, when, and where. \"What does the use of logs enable us to do differently to before?\"-this is the question that I am suggesting and implementing answers to. Improvement and stability in service operation There are two ways of using logs. One is to find out about increases and decreases in users from the logs, and use the results to create attractive content and devise ways to get more people to use the service; I call this \"deep log data utilization for service improvement.\" Logs can also be used to find out the operation status of the system; for example, checking whether the system has become unstable. Focusing on this allows \"log-based homeostasis\" aimed at operating the existing content service appropriately.It is particularly necessary to devise strategies regarding what kind of information should be collected in logs, as well as what other information when analyzed in combination with the log information will produce meaningful results in service improvement. Therefore, many discussions with companies and internal researchers are being held as we try to create an overall picture of the kind of service that CiNii will be developed into. Figure 1 shows access status at one-minute intervals based on current CiNii log information displayed on a world map. This was created to assist the discussions, but it alone makes the circumstances of CiNii very clear. I am looking forward to seeing what will be revealed when we start exploiting logs fully. Implementing search technologies in services NII is full of talented researchers in the field of informatics, and I have been carrying out research for creating search systems since before the arrival of Google. Even after starting a business in 2002, I created services based on search technologies. With this background, my role is to ensure that the research results at NII do not end up simply as research but are implemented in services such as CiNii. Also, I am currently concentrating on improving the accuracy of name identification in my specialism of search technologies. Name identification determines whether similar items are one and the same, which is essential when dealing with large amounts of information. I want us to be proactive in adding this kind of technology to the services provided by NII. View research contents with researchmap ãã¤ã¼ã Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division FUJII Kaito HIRAHARA Shuichi KAWARABAYASHI Ken-ichi KOBAYASHI Taisuke KUROIWA Ryo MATSUMOTO Keiji SATO Ryoma SHIGAKI Shunsuke SOEDA Akihito SUGIYAMA Mahito TAKEDA Hideaki TATSUTA Makoto UNO Takeaki WATANABE Kazuki WELLNITZ Philip YOSHIDA Yuichi Information Systems Architecture Science Research Division AIDA Kento AOKI Shunsuke FUJIWARA Ikki FUKUDA Kensuke GOSHIMA Masahiro HASUO Ichiro ISHIKAWA Fuyuki JI Yusheng KANEKO Megumi KATO Hiroyuki KITAGAWA Naoya KOIBUCHI Michihiro KURIMOTO Takashi SAKANE Eisaku SATO Hiroyuki SEKIYAMA Taro SHIMIZU Sayako TAKAKURA Hiroki TAKEFUSA Atsuko Digital Content and Media Sciences Research Division AIZAWA Akiko ANDRES Frederic ASANO Yuta HUANG Lang IKEHATA Satoshi KANAZAWA Teruhito KATAYAMA Norio KITAMOTO Asanobu KODAMA Kazuya KOMIYAMA Yusuke KOYAMA Shoichi KURITA Shuhei MO Hiroshi PRENDINGER Helmut SATO Imari SATOH Shin'ichi SUGAWARA Saku SUGIMOTO Akihiro TAKASU Atsuhiro YAMAGISHI Junichi YAMAJI Kazutsuna Information and Society Research Division ARAI Noriko BONO Mayumi ECHIZEN Isao FUNAMORI Miho FURUKAWA Masako GOTODA Hironobu KANDO Noriko KATAOKA Hiroshi KATO Makoto MIZUNO Takayuki NISHIZAWA Masaki OKADA Hitoshi SANO takiko SATOH Ichiro SUN Yuan UEKI Kouichirou Directory of Faculty and Staff index Research staff Other research staff Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports SPECIAL Overview of NII 2025 Summary of NII 2024 NII Today No.104(EN) NII Today No.103(EN) Overview of NII 2024 Guidance of Informatics Program, SOKENDAI 24-25 NII Today No.102(EN) SINETStream Use Case: Mobile Animal Laboratory [Bio-Innovation Research Center, Tokushima Univ.] The National Institute of Information Basic Principles of Respect for LGBTQ DAAD News Event Site Policy Link Recruit ã Nati",
  "content_length": 10139,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:42"
}