{
  "name": "Tesca Fitzgerald",
  "homepage": "https://cpsc.yale.edu/people/tesca-fitzgerald",
  "status": "success",
  "content": "Tesca Fitzgerald | Professor | Yale Engineering Skip to Content Tesca Fitzgerald Assistant Professor of Computer Science Email Room / Office:AKW 502 Office Address:51 Prospect Street New Haven, CT 06511 Mailing Address:P.O. Box 208285 New Haven, CT 06520 Website: Research Website About Tesca Fitzgerald Degrees Ph.D., Georgia Institute of Technology B.S., Portland State University Perspectives Broadly, my interests include interactive robot learning, cognitive robotics, human-robot interaction, transfer learning, and active learning. As our expectations for robots' adaptive capacities grow, it will be increasingly important for them to reason about the novel objects, tasks, and interactions inherent to everyday life. Rather than attempt to pre-train a robot for all potential task variations it may encounter, we can develop more capable and robust robots by assuming they will inevitably encounter situations that they are initially unprepared to address. My work enables a robot to address these novel situations by learning from a human teacher's domain knowledge of the task, such as the contextual use of an object or tool. Meeting this challenge requires robots to be flexible not only to novelty, but to different forms of novelty and their varying effects on the robot's task completion. My research focuses on: the implications of novelty, and its various causes, on the robot's learning goals, methods for structuring its interaction with the human teacher in order to meet those learning goals, and modeling and learning from interaction-derived training data to address novelty. Selected Awards & Honors 2014-2017 National Science Foundation Graduate Research Fellowship 2017 IBM Ph.D Fellowship 2017 Georgia Tech GVU Center Foley Scholars Award Recipient 2017 Rising Stars in EECS 2014 Microsoft Research Graduate Women's Scholarship 2013 Georgia Tech Institute Fellowship Selected Publications For a complete list, please visit my Google Scholar. Fitzgerald, T., Goel, A., Thomaz, A. \"Learning and Modeling Constraints for Creative Tool Replacement\". Frontiers in Robotics and AI. 2021. Fitzgerald, T., Goel, A., Thomaz, A. \"Abstraction in Data-Sparse Task Transfer\". Artificial Intelligence Journal (AIJ). 2021. (Invited for full presentation at IJCAI 2022.) Cui, Y.*, Koppol, P.*, Admoni, H., Niekum, S., Simmons, R., Steinfeld, A., Fitzgerald, T. \"Understanding the Relationship between Interactions and Outcomes in Human-in-the-Loop Machine Learning\". International Joint Conference on Artificial Intelligence (IJCAI). Aug 2021. Fitzgerald, T., Short, E., Goel, A., Thomaz, A., \"Human-Guided Trajectory Adaptation for Tool Transfer\", Presented at the Eighteenth International Conference on Autonomous Agents and Multiagent Systems (AAMAS). Montréal, Québec. May 2019. Fitzgerald, T., Goel A., Thomaz A. \"Human-Guided Object Mapping for Task Transfer\". ACM Transactions on Human-Robot Interaction (THRI). 2018 Oct 9;7(2):17. (Invited for full presentation at HRI 2019.) Related Content Tesca Fitzgerald: Helping robots ask for help",
  "content_length": 3059,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:45"
}