{
  "name": "Tessa Verhoef",
  "homepage": "https://sites.google.com/view/tessa-verhoef/home",
  "status": "success",
  "content": "Tessa VerhoefSearch this siteEmbedded FilesSkip to main contentSkip to navigationTessa VerhoefI am an Assistant Professor at the Leiden Institute of Advanced Computer Science (LIACS) where I lead the Emergent Communication Group, co-founded the Creative Intelligence Lab and conduct research at the intersection of language, cognition, cultural evolution and computation. On this page you will find information about my group, our research interests, publications and contact information.Current projectsEmergence of Language Universals with Neural AgentsA collaborative project with Arianna Bisazza in which we developed a novel framework for simulating language learning and change with artificial languages and neural network learners: NeLLCom (Neural-agent Language Learning and Communication). We have used it to simulate the emergence of the word-order/case-marking trade-off, and are currently expanding it to other domains and more complex population set-ups.Socially embedded AIThis research project explores several adaptive machine learning methods which can give insight into the interaction between humans and machines. The ultimate goal is open and natural communication between humans and AI that should result in mutual trust, cooperation and coordination possibilities between both. This project is funded by SAILS, Leiden University's interfaculty AI program.Neural measures of emerging space-time languageWhile many results in the field of language evolution suggest that language adapts to the brain, the brain responses of participants in typical language evolution experiments has rarely been directly measured. With Tyler Marghetis (UC Merced) and Seana Coulson (UC San Diego) I investigate the role of cognitive biases by exploring participants’ brain responses as they learn a lab-evolved artificial language containing space-time mappings.Gendering AlgorithmsAn interdisciplinary project with Eduard Fosch-Villaronga funded by a seed grant from the Global Transformations and Governance Challenges Initiative, bringing together the Faculty of Law and Computer Science to understand how algorithms impact different communities, focusing for instance on gender biases and other issues related to equity and inclusion in AI.Past workFor my BSc and MSc I studied Artificial Intelligence at the University of Groningen, the Netherlands. I wrote my MSc thesis at the Affective Social Computing lab at Florida International University in Miami, to learn about natural human-machine interaction. Obviously, a good source to look at in this context is human-human interaction, but I quickly discovered that we actually knew quite little about the origins of the unique and intricate way in which humans communicate and how it developed into the languages we use today.Language is a major characteristic that makes us unique as a species. Understanding its origins became one of my favorite topics and I decided to pursue a PhD in Language Evolution. In 2013, I obtained my PhD degree at the Amsterdam Center for Language and Communication (ACLC) of the University of Amsterdam. My project was about the evolution of speech and I worked with Prof. Bart de Boer and Prof. Simon Kirby. My PhD thesis can be found here.Since then I have worked on various other domains of language, such as sign language, space-time mappings and iconicity, and I have been developing quantitative and experimental methods to study the evolution of language further. Most of this happened while I was a postdoc at the Center for Research in Language and worked with Prof. Carol Padden at UC San Diego. For more details, see my publications and CV.ContactMy office is in the Gorlaeus Building at Leiden University and you can find me in room BE 3.08.Alternatively, please get in touch at: t.verhoef [at] liacs.leidenuniv [dot] nl. I am also on LinkedIn, and this is my CV© Portrait made by Patricia Nauta - Robot icon created by Candy Design: FlaticonGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3993,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:43"
}