{
  "name": "Tetsuya Sakai",
  "homepage": "http://sakailab.com/tetsuya",
  "status": "success",
  "content": "sakailab.com sakailab.com/english/ Professor Tetsuya Sakai Tetsuya Sakai the Professor/Researcher Last updated: 29th November, 2025 To AO admission applicants: I no longer have a vacancy for Spring/Autumn 2026 intakes. BIOGRAPHY Tetsuya Sakai is a professor at the Department of Computer Science and Engineering, Waseda University, Japan. He is also a General Research Advisor of Naver Corporation, Korea (2021-), and a visiting professor at the National Institute of Informatics, Japan (2015-). He joined Toshiba in 1993 and obtained a Ph.D from Waseda in 2000. From 2000 to 2001, he was supervised by the late Karen Sparck Jones at the Computer Laboratory, University of Cambridge, as a visiting researcher. In 2007, he joined NewsWatch, Inc. as the director of the Natural Language Processing Lab. In 2009, he joined Microsoft Research Asia. He joined the Waseda faculty in 2013. He was Associate Dean (IT Strategies Division) from 2015 to 2017, and Department Head from 2017 to 2019. He is an ACM distinguished member and an IPSJ Fellow. In 2023, he was inducted into the SIGIR Academy. He has been serving as a senior associate editor/acting editor-in-chief of ACM TOIS since 2021. Twitter: @tetsuyasakai Email: tetsuyasakai AT acm DOT org See also Tetsuya Sakai the Singer/Songwriter (YouTube) (Please do NOT post your admission inquiries to my YouTube channel.) SOME VIDEOS NTCIR-17 Panel on Responsible Information Access (Panelists: Haruka Maeda, Paul Thomas, Mark Sanderson; Moderator: Tetsuya Sakai) YouTube (about 63 minutes) moderator slides A Practical Guide to Computing Evaluation Measures and Comparing Systems: Twelve Small Tips (invited tutorial@NTCIR-17, 2023) YouTube (about 45 minutes) slides 高校生向け「夢ナビ」講義ビデオ：その検索・対話システムの返答は皆を幸せにするか？ ビデオ約26分 平均値の差の検定と効果量: 実験結果の適切な報告の仕方 (DEIM 2023チュートリアル、ビデオ約1時間7分 スライド61枚) 公平な世の中を目指した検索 (研究紹介、約6分、2023) Evaluating Evaluation Measures, Evaluating Information Access Systems, Designing and Constructing Test Collections, and Evaluating Again (invited tutorial@NTCIR-16, 2022) videos (100 minutes in total) slides Evaluating Evaluation Measures for Ordinal Classification and Ordinal Quantification (ACL-IJCNLP 2021) videos (88 minutes in total) slides 検索エンジンの仕組みと課題 (模擬講義、約23分、2020) LINKS ACM author Google scholar Sakai Lab’s publications (2014-) Tetsuya Sakai’s publications (1994-2013) Tools and Data Research project opportunities at the Sakai Lab (for Waseda Students only) Department of Computer Science and Engineering, Waseda university Laboratory Experiments in Information Retrieval: Sample Sizes, Effect Sizes, and Statistical Power (Springer) by Tetsuya Sakai (2018) 情報アクセス評価方法論: 検索エンジンの進歩のために(コロナ社) by Tetsuya Sakai (2015) CURRENT RESPONSIBILITIES NTCIR R2C2 task organiser ACM WSDM 2026 PC co-chair ACM SIGIR sustainability co-chair (2023-2025) ACM TOIS Senior Associate Editor/Acting Editor-in-Chief (2021-) AWARDS SIGIR Academy (2023) 45-second thank you video DEIM 2020 Excellent Paper Award (second author) FIT 2020 Excellent Paper Award (first author) CSS 2019 Best Paper Award (fifth author) ACM Distinguished Member (2018) WASEDA e-Teaching Award 2017 ACM Recognition of Service Award (SIGIR’17 Co-chair) ACM Senior Member (2016) Waseda University Presidential Teaching Award (2016 Spring Semester) Waseda University Teaching Award (2014 Autumn Semester) MobileHCI 2014 Honorable Mention (second author) CSS 2014 Student Paper Award (third author) ACM SIGIR 2013 Best Paper Shortlisted Nominee (first author) AIRS 2012 Best Paper Award (first author) WebDB Forum 2010 Excellent Paper Award and NTT Resonant Award (second author) FIT 2008 Funai Best Paper Award (first author) IPSJ 2007 Best Paper Award (single author) IEICE ESS 2007 Merit Award IPSJ 2006 Best Paper Award (single author) IPSJ 2006 Yamashita SIG Research Award (single author) FIT 2005 Excellent Paper Award (single author) INVITED TALKS WITHOUT PAPERS Sakai. T.: Information Access Evaluation: Some Recent Topics, iDB Workshop 2009, 2009. Sakai, T.: Towards Evaluating Exploratory Search, FIRE 2008, December 2008. Sakai, T. and Kando, N.: Why All of You Should Attend NTCIR-7 Next Week, FIRE 2008, 2008. Sakai, T.: Evaluation: From Traditional Search to Exploratory Search (keynote), ECIR 2008 Workshop on Novel Methodologies for Evaluation in Information Retrieval, 2008. Sakai, T.: How to Evaluate Information Retrieval: Why is it Receiving Attention Now? (keynote), The Twelfth Australasian Document Computing Symposium (ADCS 2007), 2007. SLIDES WITHOUT PAPERS 酒井哲也: Ordinal Classification/Quantificationというタスクに適した評価指標…にまつわる裏話, NLPコロキウム, 2022. slides Sakai, T.: Graded Relevance Assessments and Graded Relevance Measures of NTCIR, EVIA 2019@NTCIR-14, 2019. slides Sakai, T.: Evaluation I: System-Oriented, Asian Summer School in Information Access 2015, 2015. slides 酒井哲也: 情報検索研究における失敗分析・進歩の検証, Project Next Kickoff, 2014. slides PAST RESPONSIBILITIES ACM SIGIR-AP 2024 General co-chair ACM SIGIR-AP 2023 PC co-chair ICTIR Steering Committee member (2022-2024) ACM SIGIR 2013, 2021 PC co-chair ACM SIGIR Vice Chair (2019-2022) ICTIR Steering Committee chair (2020-2021) Information Retrieval Journal Editor-in-Chief (Asia/Australasia) (2014-2021) NTCIR ACLIA, CQA, GeoTime, INTENT, 1CLICK, MobileClick, STC, CENTRE, We Want Web, DialEval, FairWeb task organizer ICTIR Steering Committee Chair (2020-2021) 情報処理学会調査研究運営委員会運営委員 (2017-2021) Information Retrieval Journal Co-editor-in-chief (2014-2020) ACM TOIS Associate Editor (2015-2020) AIRS steering committee advisor SPIRE Steering Committee member (2017-2019) SIGIR Tokyo Chapter vice chair (2018-2019) SIGIR 2019 OSIRRC workshop co-organiser AIRS 2018 PC co-chair ACM SIGIR Tokyo Chapter Vice Chair (2017-2019) ACM SIGIR 2017 General Co-chair ISITA 2016 Co-secretary SPIRE Steering Committee member (2017-2019) SPIRE 2016 PC Co-chair SIGIR 2015 Ecol workshop co-organiser Information Processing and Management, editorial board (2010-2015) TREC Temporal Summarisation track coordinator OAIR (RIAO) 2013 PC co-chair EVIA 2007, 2008, 2010 PC co-chair AIRS 2009 general co-chair SIGIR 2009 Workshop on The Future of IR Evaluation co-organiser NTCIR-11, -12, -13 general co-chair NTCIR-9, -10 PC co-chair NTCIR-6, -7 information logistics chair IPSJ TOD co-editor-in-chief, editorial board IPSJ SIG-FI/IFAT chair, secretary, committee member IPSJ Journal editorial board IPSJ Magazine editorial committee FWG IEICE ESS director, news letter The Journal of the IEICE editorial committee WG-A",
  "content_length": 6485,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:44"
}