{
  "name": "Tevfik Bultan",
  "homepage": "http://www.cs.ucsb.edu/~bultan",
  "status": "success",
  "content": "Tevfik Bultan - Home Page Tevfik Bultan Professor Department of Computer Science University of California, Santa Barbara Verification Laboratory Short Biography CV Publications DBLP Google Scholar Talks Musical Activities Previously Committed, Sofar Sonear Professional Activities ICSE 2022, ICSE 2021, CAV 2021, ISSTA 2021, ICSE, ISSTA, ASE, ACM TOSEM Courses and Seminars this Quarter: CS 267: Computer Aided Verification Undergraduate Courses: CS 16: Problem Solving with Computers I (S'14) (S'16) CS 160: Translation of Programming Languages (W'99) (F'99) (F'00) (F'01) (W'04) (F'10) (W'11) (F'11) (W'12) (W'13) (F'13) (F'15) (S'17) (F'17) (F'24) CS 189A/189B/172: Capstone Project/Software Engineering (W'00) (W'02) (W'03) (W'04) (W'06) (W'07) (W'08) (W'09) (W'10) (W'19) (F'23) Graduate Courses: CS 292: Quantitative Information Flow and Side Channels (S'19) (F'21) CS 290C/292C: String Analysis (W'16) (W'18) CS 290C: Formal Models for Web Software (S'10) (S'13) CS 267: Automated Verification (S'99) (W'01) (F'02) (S'06) (S'08) (F'09) (S'10) (S'11) (S'12) (W'14) (W'17) (S'23) (W'25) CS 272: Software Engineering (S'03) (S'07) (F'08) (F'12) (F'18) (W'24) CS 260: Advanced Topics in Translation (S'04) (S'02) CS 290: Concurrent Program Design and Verification (S'00) Seminars: CS 595C: Neural Network Verification (S'22) CS 595C: Quantitative Verification (S'21) CS 595I: Testing and Verification Techniques for Machine Learning (S'19) CS 595C: Side Channel Analysis via Model Counting Constraint Solvers (F'16) CS 595C: Automated Worst Case and Side Channel Analysis for Software (F'15) INT 94PL Freshman Seminar: What is Computing? (S'14) INT 94PL Freshman Seminar: What is Computing? (S'13) CS 595C: Automated Decision Procedures (W'13) INT 94PL:Freshman Seminar: What is Computing? (S'12) I have a blog for this seminar: http://whatiscomputing.blogspot.com/ CS 595C: Analysis and Verification Techniques for Improving Dependability of Web Software (F'11) CS 595C: Domain Specific Languages and Analyses for Web Applications (S'10) CS 595C: Dependable Web Applications via String Analysis (S'09) CS 595C: Static String Analysis (S'08) CS 595C: Architectural Support for Dynamic Software Analysis (S'07) CS 595: Environment Generation and Model Based Testing (S'06) CS 595: Web Services and Security (W'06) CS 595: Topics in Automated Verification (F'00) (S'02) (S'04) CS 595: Web Services (S'03) (F'03) CS 595: Interfaces, Web Services and Verification (W'03) CS 595: Faculty Research Seminar (W'00) CS 595: Automated Verification of Infinite State Systems (F'99) CS 595: Workflow Specification Languages (W'99) Current Students and Postdocs Mara Downing, PhD candidate Laboni Sarker, PhD candidate MD Shafiuzzaman, PhD candidate Achintya Desai , PhD candidate Past Students, Postdocs Postdoctoral Researchers Yanju Chen, Postdoctoral researcher, 2024-2025 Armin Moin, Postdoctoral researcher, 2023 Current position: Assistant Professor, University of Colorado, Colorado Springs Yilmaz Vural, Postdoctoral researcher, 2019-2021 Current position: Cyber Security Analyst, City of Santa Maria Nicolas Rosner, Postdoctoral researcher, 2016-2019 Current position: Senior Applied Scientist at AWS Automated Reasoning, Amazon Nestan Tsiskaridze, Postdoctoral researcher, 2016-2018 Current position: Research Scientist, Stanford Sylvain Hallé, Postdoctoral researcher, 2008-2010 Current position: Associate Professor, Université du Québec à Chicoutimi, Canada PhD Students William Eiers, Ph.D., 2023 Dissertation: Quantitative Access Control Policy Analysis and Repair Using Model Counting Position after graduation: Assistant Professor, Stevens Institute of Technology Ismet Burak Kadron, Ph.D., 2022 Dissertation: Detection, Quantification, and Mitigation of Network Side Channels Position after graduation: Research Scientist at Veridise Seemanta Saha, Ph.D., 2022 Dissertation: Symbolic Quantitative Analysis for Software Testing and Security Position after graduation: Software Development Engineer, Intel Tegan Brennan, Ph.D., 2020 Dissertation: Static and Dynamic Software Side-Channels Position after graduation: Assistant Professor, Stevens Institute of Technology Lucas Bang, Ph.D., 2018 Dissertation: Software Side-Channel Analysis Current Position: Assiociate Professor, Harvey Mudd College Abdulbaki Aydin, Ph.D., 2017 Dissertation: \"Automata-based Model Counting String Constraint Solver for Vulnerability Analysis.\" Position after graduation: Software Engineer, Microsoft. Ivan Bocic, Ph.D., 2016 Dissertation: \"Data Model Verification via Theorem Proving.\" Position after graduation: Software Engineer, Google. Muath Alkhalaf, Ph.D., 2014 Dissertation: \"Automatic Detection and Repair of Input Validation and Sanitization Bugs.\" Defense presentation. Position after graduation: Assistant Professor, Computer Science Department, King Saud University. Jaideep Nijjar, Ph.D., 2014 Dissertation: \"Analysis and Verification of Web Application Data Models.\" Fang Yu, Ph.D., 2010 Dissertation: \"Automatic Verification of String Manipulating Programs.\" Current position: Associate Professor, Department of Management Information Systems, National Chengchi University, Taiwan Graham Hughes, Ph.D., 2009 Dissertation: \"Interface Grammars for Modular Software Veriﬁcation.\" Position after graduation: Research Scientist, Acelot, Inc. Aysu Betin Can, Ph.D., 2005 Dissertation: \"Design for Verification for Concurrent and Distributed Programs.\" Current position: Teaching Associate Professor, Computer Science, Colorado School of Mines. Constantinos Bartzis, Ph.D., 2004 Dissertation: \"Symbolic Representations for Integer Sets in Automated Verification.\" Position after graduation: Post Doctoral Fellow, School of Computer Science, Carnegie Mellon University. Xiang Fu, Ph.D., 2004, co-advised with Jianwen Su Dissertation: \"Formal Specification and Verification of Asynchronously Communicating Web Services.\" Current position: Professor, Department of Computer Science, Hofstra University. Tuba Yavuz-Kahveci, Ph.D., 2004 Dissertation: \"Specification and Automated Verification of Concurrent Software Systems.\" Current Position: Associate Professor, Electrical and Computer Engineering Department, University of Florida, Gainesville. Zhe Dang, Ph.D., 2000, co-advised with Richard A. Kemmerer Dissertation: \"Debugging and Verification of Infinite State Real-time Systems.\" Current position: Professor, School of Electrical Engineering and Computer Science, Washington State University. MS Students Lucas Nguyen, M.S. 2023. Project Title: Firmware Fuzzing: Detecting Vulnerabilities in UEFI Ganesh Sankaran, M.S. 2022. Project Title: Quacky: An Open-Source Tool for Quantitatively Analyzing Access Control Policies for the Cloud Albert Li, M.S. 2022. Project Title: State Machine Inference for Electronic Control Units in Cars Using Communication Traces Nicholas Chen, M.S. 2019. Project Title: Pattern-Based Alignment for Network Traces Abhabongse Janthong, M.S. 2017. Project Title: Safety Checking for Domain Relational Calculus Queries Using Alloy Analyzer Zachary Stengel, M.S. 2010. Project Title: Analyzing Singularity Channel Contracts Ben Rubinger, M.S. 2010. Project Title: A Code Contracts Case Study for a Facebook Application Muath Alkhalaf, M.S. 2008. Project title: Automated Web Service Testing Using Interface Grammars Chris Ferguson, M.S. 2008. Project title: Collaboration Diagram Analysis Toolkit. Elliot Barlas, B.S./M.S., 2007. Project title: A Framework for Verification of Distributed Java Programs Using Java PathFinder. Jennifer Choe, M.S., 2006. Project title: An Extended Finite State Machine Approach to Automated GUI Testing. Undergradute Researchers Kaitlyn Tom, 2023-2024, Early Research Scholars project: Vulnerability Signature Generation Rick Zhang, 2023-2024, Early Research Scholars project: Vulnerability Signature Generation Shelly Zhu, 2023-2024, Early Research Scholars project: Vulnerability Signature Generation Suhrit Padakanti, 2023-2024, Early Research Scholars project: Vulnerability Signature Generation Adrian Lindell, 2022-2023, Early Research Scholars project: Advancing Binary Analysis Through Compositional Symbolic Execution Erica Liu, 2022-2023, Early Research Scholars project: Advancing Binary Analysis Through Compositional Symbolic Execution Jeffrey Mun, 2022-2023, Early Research Scholars project: Advancing Binary Analysis Through Compositional Symbolic Execution Erin DeLong, 2021-2022, Early Research Scholars project: Evaluating the Robustness of Quantized Neural Networks to Adversarial Attacks Anushka Lodha, 2021-2022, Early Research Scholars project: Evaluating the Robustness of Quantized Neural Networks to Adversarial Attacks Brian Ozawa Burns, 2021-2022, Early Research Scholars project: Evaluating the Robustness of Quantized Neural Networks to Adversarial Attacks Olivia Gillam, 2020-2021, Early Research Scholars project: Quantitative Program Analysis with KLEE, Surendra Ghentiyala, 2020-2021, Early Research Scholars project: Quantitative Program Analysis with KLEE Victoria Reed, 2020-2021, Early Research Scholars project: Quantitative Program Analysis with KLEE Kunal Handa, 2020-2021, Early Research Scholars project: Quantitative Program Analysis with KLEE Chaofan Shou, 2019–2021, Project: Network Side Channel Analysis with IoT and Checking Browser Security Policies with Fuzzing Shihua Lu, 2019–2020, Distinction in Major Project: Quantitative program analysis using KLEE and ABC Ganesh Sankaran, 2019–2020, Early Research Scholars and NSF REU project: Quantitative analysis of access control policies for the cloud Albert Li, 2019–2020, Early Research Scholars and NSF REU project: Quantitative analysis of access control policies for the cloud Emily O’Mahony, 2019–2020, Early Research Scholars and NSF REU project: Quantitative analysis of access control policies for the cloud Benjamin Prince, 2019–2020, Early Research Scholars and NSF REU project: Quantitative analysis of access control policies for th",
  "content_length": 10718,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:46"
}