{
  "name": "Thai Son Mai",
  "homepage": "https://pure.qub.ac.uk/en/persons/thai-son-mai",
  "status": "success",
  "content": "Thai Son Mai - Queen's University Belfast View Scopus Profile Thai Son Mai Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer Science Phone+44 (0)28 9097 4285EmailThaiSon.Maiqub.acuk Room 01.007 - Computer Science BuildingUnited Kingdom Accepting PhD StudentsPhD projectsData Mining, Machine Learning, High Performance Computing, Data Mining and Machine Learning applications in other fields such as Medicine, Neuroscience, Environment, and Transportation. 20092025 Research activity per year Personal profile Fingerprint Dive into the research topics where Thai Son Mai is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Algorithms Computer Science 100% Clustering Algorithm Computer Science 84% Model Earth and Planetary Sciences 50% Clustering Result Computer Science 46% User Computer Science 43% Cluster Structure Computer Science 31% Scalability Computer Science 29% Large Data Set Computer Science 29% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2020 2020 2022 2023 1 Active 5 Finished Projects per year R1142ECS: RELAX: Relaxed Semantics Across the Data Analytics StackVandierendonck, H. (PI), Mai, T. S. (CoI) & Padmanabhan, D. (CoI)14/12/2022 → …Project: Research Compressed Graph 100% Search Space 100% Human Perception 100% Global Barrier 100% Peak Performance 100% R1906ECS: Calculating The Human Proteoform Maximum Theoretical Peptide Index as A Novel Commercial Resource for Industry and AcademiaMai, T. S. (PI) & Hardiman, G. (CoI)23/03/2023 → 02/09/2023Project: Research R1751CCE: Active Learning for Cost-Efficient Reaction Prediction using Kinetic DataDingwall, P. (PI) & Mai, T. S. (CoI)27/09/2022 → 30/08/2023Project: Research R3229ECS: Drought AI: Artificial Intelligence for Enhancing Livelihood Resilience in the coastal areas of Vietnamese Mekong Delta Mai, T. S. (PI) & Duong, T. Q. (CoI)06/10/2020 → 30/11/2021Project: Research R1248CCE: Active Learning for Cost Efficient Reaction Prediction using Kinetic DataDingwall, P. (PI) & Mai, T. S. (CoI)20/05/2020 → 30/04/2021Project: Research View all 6 projects Research output Research output per year 2009 2023 2024 2025 2025 33 Conference contribution 28 Article 2 Poster 1 Other report 4 More 1 Chapter 1 Chapter (peer-reviewed) 1 Paper 1 Other contribution Research output per year Research output per year DeepPUFSCA: deep learning for physical unclonable function attack based on side channel analysis supportDoan, N. P., Pham, T. D., Zhang, Z., Tran, H. V., Miskelly, J., Vandierendonck, H., Hoang, A.-T., O'Neill, M. & Mai, T. S., 15 Sept 2025, 2025 62nd ACM/IEEE Design Automation Conference (DAC): Proceedings. IEEE, (Design Automation Conference (DAC): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Side Channel 100% Channel Analysis 100% Learning System 100% Machine Learning 100% Deep Learning Method 100% 29 Downloads (Pure) Efficient integer-only-inference of gradient boosting decision trees on low-power devicesAlsharari, M., Mai, T. S., Woods, R. & Reano, C., 2025, In: IEEE Transactions on Circuits and Systems I: Regular Papers. 72, 1, p. 241-253 13 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Bandwidth Efficiency 100% Clock Speed 100% 1 Citation (Scopus) 66 Downloads (Pure) Enhancing daily runoff forecasting in hydropower basins with a voting ensemble model using historical dataLe , N. A., Thanh, P. N., Pham, N. T., Huy, L. Q., Mai, S. T., Do, D. D., Nguyen, H. A. & Anh, D. T., 24 Feb 2025, In: Hydrological Sciences Journal / Journal des Sciences Hydrologiques. 70, 5, p. 833-845 13 p.Research output: Contribution to journal › Article › peer-review Self Organizing Systems 100% 1 Citation (Scopus) InteDisUX: intepretation-guided discriminative user-centric explanation for time seriesTran, V.-H., Zhang, Z., Pham, T. D., Doan, N. P., Hoang, A.-T., Li, P., Vandierendonck, H., Assent, I. & Mai, S. T., 11 Apr 2025, 39th AAAI Conference on Artificial Intelligence (AAAI-25): Proceedings. Walsh, T., Shah, J. & Kolter, Z. (eds.). AAAI Press, p. 20921-20928 8 p. (Proceedings of the AAAI Conference on Artificial Intelligence).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Human Perception 100% 37 Downloads (Pure) Integrating Intelligent Hydro-informatics into an effective Early Warning System for risk-informed urban flood managementDang, T. Q., Tran, B. H., Le, Q. N., Tanim, A. H., Bui, V. H., Mai, S. T., Thanh, P. N. & Anh, D. T., Jan 2025, In: Environmental Modelling and Software. 183, 12 p., 106246.Research output: Contribution to journal › Article › peer-review Urban Flooding 100% Web GIS 16% Ho Chi Minh City 16% 3 Citations (Scopus) View all 68 research outputs Datasets uk-2007.mtxD'Antonio, M. (Creator), Mai, T. S. (Creator) & Vandierendonck, H. (Creator), Zenodo, 19 Jun 2025DOI: 10.5281/zenodo.15698175Dataset urand.mtxD'Antonio, M. (Creator), Mai, T. S. (Creator) & Vandierendonck, H. (Creator), Zenodo, 19 Jun 2025DOI: 10.5281/zenodo.15697819Dataset road-eu.mtxD'Antonio, M. (Creator), Mai, T. S. (Creator) & Vandierendonck, H. (Creator), Zenodo, 19 Jun 2025DOI: 10.5281/zenodo.15697670Dataset uk-union-06.mtxD'Antonio, M. (Creator), Mai, T. S. (Creator) & Vandierendonck, H. (Creator), Zenodo, 19 Jun 2025DOI: 10.5281/zenodo.15697486Dataset mawi.mtxD'Antonio, M. (Creator), Mai, T. S. (Creator) & Vandierendonck, H. (Creator), Zenodo, 19 Jun 2025DOI: 10.5281/zenodo.15697326Dataset View all 13 datasets Prizes Best Poster Award - Marco D'AntonioD'Antonio, M. (Recipient), Vandierendonck, H. (Recipient) & Mai, T. S. (Recipient), 07 Jun 2025Prize: Other distinction Doctor of Philosophy 100% Activities Activities per year 2011 2013 2018 2021 2023 28 Publication peer-review 1 Participation in workshop, seminar, course Activities per year Workshop on Discovery AI for Health: Accelerating Health Research and InnovationWang, H. (Organiser), Styles, I. (Speaker), Bengoechea, J. (Speaker), McNulty, H. (Speaker), Hughes, C. (Speaker), Yang, G. (Speaker), Zwiggelaar, R. (Speaker), Diaz-Ordaz, K. (Speaker), Hospedales, T. (Speaker), Liang, X. (Organiser), Mai, T. S. (Participant), Gault, R. (Participant) & Hughes, C. (Participant)23 Jun 2023Activity: Participating in or organising an event types › Participation in workshop, seminar, course International Conference on Data Mining (Event)Mai, T. S. (Peer reviewer)2021Activity: Publication peer-review and editorial work types › Publication peer-review International Journal of Data Science and Analytics (Journal)Mai, T. S. (Peer reviewer)2021Activity: Publication peer-review and editorial work types › Publication peer-review Computers & Electrical Engineering (Journal)Mai, T. S. (Peer reviewer)2021Activity: Publication peer-review and editorial work types › Publication peer-review IEEE Transactions on Knowledge and Data Engineering (Journal)Mai, T. S. (Peer reviewer)2021Activity: Publication peer-review and editorial work types › Publication peer-review View all 29 activities",
  "content_length": 7501,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:50"
}