{
  "name": "Thanh-Toan Do",
  "homepage": "https://research.monash.edu/en/persons/toan-do",
  "status": "success",
  "content": "Toan Do - Monash University View Scopus Profile Toan Do Dr Senior Lecturer, Department of Data Science & AI EmailToan.Domonashedu Accepting PhD Students 20152025 Research activity per year Personal profile BiographyThanh-Toan (Toan) Do is a Senior Lecturer at the Faculty of Information Technology, Monash University. He obtained his Ph.D. in computer science at the French National Institute for Research in Computer Science and Control (INRIA) in 2012. From 2013 to 2016, he was a Research Fellow at the Singapore University of Technology and Design. From 2016 to 2018, he was a Research Fellow at the Australian Centre for Robotic Vision and the University of Adelaide. From 2018 to 2020, he was a Lecturer at the University of Liverpool. His research interests are in the fields of computer vision and machine learning. Some particular research problems are visual search, visual question answering, metric learning, and compact deep learning. His personal webpage can be found at this link. His Google Scholar profile can be found at this link. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research area keywordsComputer VisionMachine Learning Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2022 2025 1 Finished Projects per year Large-scale multimodal knowledge management: From organization and user modeling to fast contextual presentationGasevic, D. (Primary Chief Investigator (PCI)), Swiecki, Z. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Hayat, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Tsai, Y.-S. (Chief Investigator (CI)), Do, T. (Chief Investigator (CI)), Zhuang, B. (Chief Investigator (CI)) & Wang, T. (Chief Investigator (CI))2/09/22 → 1/09/25Project: Research Research output Research output per year 2015 2018 2019 2020 2023 2025 49 Conference Paper 25 Article 2 Chapter (Book) Research output per year Research output per year Conditional Distribution Modelling for Few-Shot Image Synthesis with Diffusion ModelsGupta, P., Hayat, M., Dhall, A. & Do, T.-T., 2025, Computer Vision – ACCV 2024 - 17th Asian Conference on Computer Vision Hanoi, Vietnam, December 8–12, 2024 Proceedings, Part V. Cho, M., Laptev, I., Tran, D., Yao, A. & Zha, H. (eds.). Singapore Singapore: Springer, p. 3-20 18 p. (Lecture Notes in Computer Science; vol. 15476).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Instance-Dependent Noisy-Label Learning with Graphical Model Based Noise-Rate EstimationGarg, A., Nguyen, C., Felix, R., Do, T.-T. & Carneiro, G., 2025, Computer Vision – ECCV 2024 - 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part IV. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 372-389 18 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 15062 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Learning to Complement and to Defer to Multiple UsersZhang, Z., Ai, W., Wells, K. D., Rosewarne, D., Do, T.-T. & Carneiro, G., 2025, Computer Vision – ECCV 2024 - 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part LVI. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 144-162 19 p. (Lecture Notes in Computer Science; vol. 15114).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 5 Citations (Scopus) MetaAug: Meta-Data Augmentation for Post-Training QuantizationPham, C., Anh Dung, H., Nguyen, C. C., Le, T., Phung, D., Carneiro, G. & Do, T.-T., 2025, Computer Vision – ECCV 2024, 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part XXVII. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: European Conference On Computer Vision, p. 236–252 17 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Self-supervised Learning for Acoustic Few-Shot ClassificationLiang, J., Meyer, B., Lee, I. N. & Do, T. T., 2025, 2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). D Rao, B., Trancoso, I., Sharma, G. & B. Mehta, N. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, 5 p. (ICASSP, IEEE International Conference on Acoustics, Speech and Signal Processing - Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review View all 76 research outputs",
  "content_length": 5352,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:54"
}