{
  "name": "Thanuja D. Ambegoda",
  "homepage": "https://thanuja.ambegoda.staff.uom.lk",
  "status": "success",
  "content": "Thanuja D. Ambegoda Dr. Sc. ETH Zurich, MSc ETH Zurich, BSc Engineering (Hon's), University of Moratuwa Senior Lecturer at the Department of Computer Science and Engineering, University of Moratuwa. Former co-founder of Enway GmbH, Berlin, Germany: Autonomous Street Sweeping Vehicles Alumnus of the Swiss Federal Institute of Technology (ETH Zurich), Switzerland. Publications Projects Artificial Intelligence Translational Research Lab Dr. Thanuja Ambegoda leads the Artificial Intelligence Translational Research Lab (AITR Lab) at the Department of Computer Science and Engineering, University of Moratuwa. The group's focus is on applying foundational AI and machine learning methods to solve real-world problems across domains such as document analysis, computer vision, and medical imaging. Research conducted at AITR Lab bridges theory and practice, resulting in both high-impact academic publications and practical systems. Current projects include AI-powered document digitization for low-resource languages, medical image analysis, and intelligent automation solutions. Meenadchisundaram Saranyan Isuru Senevirathne Indrajith Ekanayake Purushoth Velayuthan Dilith Jayakody Anjana Wijesinghe Computer Vision My key research areas are medical image analysis, satellite image analysis (remote sensing) and video analytics Machine Learning Machine learning methods are a core part of all my research project. In terms of ML research I'm interested in few-shot learning, continual learning, explainable AI and AI safety Data Science There are several data science projects (on going and finished) ranging from medical applications to preventive diagnostics and business intelligence applications I have mainly worked with undergraduate and postgraduate students Robotics and IoT From my time as cofounder of Enway GmbH, Berlin, Germany, I have been working on several robotics and IoT related projects ranging from real-time object detection on embedded hardware to smart agriculture and manufacturing applications Introduction to Artificial Intelligence Introduction to Machine Learning Data Mining Data Science and Engineering Project Data Mining and Information Retrieval Programming Fundamentals Computer Organization and Digital Design Machine Learning Data Mining Advanced Data Mining Advanced Databases Business Intelligence Institute of Electrical and Electronic Engineers (IEEE) - Member Institute of Engineers Sri Lanka (IESL) - Associate Member Computer Society of Sri Lanka (CSSL) - Member Senior Lecturer - Department of Computer Science and Engineering Data Science and Engineering Stream Coordinator, Department of Computer Science and Engineering Coordinator of MSc in Data Science and Artificial Intelligence, Department of Computer Science and Engineering Quality Assurance Coordinator - Representative for the Department of Computer Science and Engineering Member of the Engineering Research Unit, Faculty of Engineering Member of the Orientation Committee, Faculty of Engineering Member of the Exhibitions Committee, Faculty of Engineering Cofounder and Head of AI - Enway GmbH, Berlin, Germany Doctoral Candidate - Swiss Federal Institute of Technology (ETH Zurich), Switzerland IT Manager - Telejob.ch (online job platform for students) Research Assistant - Swiss Federal Institute of Environmental Research (EAWAG) Engineer - IP Core Network - Dialog Axiata, Colombo thanuja at cse.mrt.ac.lk LinkedIn Department of Computer Science and Engineering University of Moratuwa, Sri Lanka",
  "content_length": 3509,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:55"
}