{
  "name": "Tharindu Ranasinghe",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/tharindu-ranasinghe",
  "status": "success",
  "content": "Tharindu Ranasinghe - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Tharindu Ranasinghe Lecturer in Security and Protection Science Research Overview My research focuses on developing Machine Learning (ML) approaches for Natural Language Processing (NLP) tasks, particularly emphasising NLP for Social Good. My work has various applications, such as computational social science, digital humanities and text adaptation. I have published in top natural language processing journals and conferences, including ACL, EMNLP, NAACL, and COLING. I am an Associate Editor of Natural Language Processing (previously Journal of Natural Language Engineering) and as an Area Chair for ACL, NAACL, EMNLP, and EACL. Additionally, I co-chair the New Trends in Translation and Technology (NeTTT) conference series (https://nettt-conference.com/) and the LoResLM workshop (https://loreslm.github.io/). For an up-to-date list of my publications, please visit my Google Scholar page: https://scholar.google.co.uk/citations?hl=en&user=9t7WhIIAAAAJ Publications Activities PhD Students Research Groups Towards Responsible Machine Translation with Quality Estimation Invited talk Best Paper Award at the First Workshop on Bangla Language Processing Prize (including medals and awards) Best System in WMT QE Shared Task 2020 Prize (including medals and awards) Best Paper Award for Qur’an QA shared task at the 5th Workshop on Open-Source Arabic Corpora and Processing Tools Prize (including medals and awards) Damith Dola Mullage PhD student, Associate Lecturer SCC (Data Science), UCREL - University Centre for Computer Corpus Research on Language enable JavaScript to view email address SCC (Data Science) UCREL - University Centre for Computer Corpus Research on Language Back to listing Contact Details Department: Computing and Communications enable JavaScript to view email address Back to listing",
  "content_length": 2139,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:56"
}