{
  "name": "Theodore S. Norvell",
  "homepage": "https://www.mun.ca/engineering/about/people/theodoresnorvell.php",
  "status": "success",
  "content": "Theodore S. Norvell | Faculty of Engineering and Applied Science | Memorial University of Newfoundland Home AboutOur PeopleTheodore S. Norvell Theodore S. Norvell B.Sc.(Hons.) (Dalhousie), M.Sc., PhD (Toronto), P.Eng. Associate Professor Contact Information Ph: 709-864-8962 Em: theo[at]mun.ca Office: CSF4117 Expertise Digital Hardware Software, Robotics and Vision Research Interests Formal development and verification of software and hardware systems. Concurrent programming language design, implementation, and verification. Program and algorithm animation. Personal Profile Theodore Norvell started programming at a young age and has been interested in the science, engineering, and practice of programming ever since. These days his research focuses on the question of how we can prove, with the help of computers, that our programs are error free. This problem is particularly important when programs are concurrent, which is the rule these days rather than the exception. That is because testing concurrent programs is not an effective alternative to proof. Concurrency also makes the problem harder and therefore more interesting. Other areas of research that Theodore works in include implementation of concurrent languages in hardware and software, design of distributed systems, and the use of program and algorithm animation in teaching. His teaching interests include software design, software correctness, algorithm design and analysis, and formal methods. He is co-creator of The Teaching Machine program and algorithm animation system. His other interest include fencing, sailing, and running. Had he not gone into computer engineering and computer science, he would have liked to have become a pirate. More information can be found at his true home page. Honours/Awards/Accreditation P. Eng, Newfoundland and Labrador Other Contacts http://www.engr.mun.ca/~theo/ Message from the Interim DeanVision and MissionStrategic PlanSafetyHistoryAwards and HonoursNewsEngineering ExchangeEmployment OpportunitiesDates and DeadlinesMemorial Centre for EntrepreneurshipFinanceEngineering Computing ServicesMediaContact Us50th Anniversary CelebrationsCelebrating Women in Engineering",
  "content_length": 2190,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:00"
}