{
  "name": "Theodora Chaspari",
  "homepage": "https://www.colorado.edu/cs/theodora-chaspari",
  "status": "success",
  "content": "Theodora Chaspari | Computer Science | University of Colorado Boulder Skip to main content Computer ScienceHomeAcademicsResearchPeopleNews & EventsAdmissionsInclusionTranslateEnglishSpanishChineseFrenchGermanKoreanLaoNepaliJapaneseTibetanSearchEnter the terms you wish to search for.This siteAll of Colorado.eduOther ways to search:Events CalendarCampus MapStudentsEngage with UsFaculty/Staff ResourcesAboutAdmissionsContact UsJobsFunding OpportunitiesMS-CS + MS-AI Required Notification and SARAAccreditationStrategic VisionTheodora ChaspariAssociate ProfessorCo-Associate Chair for Graduate Education Theodora.Chaspari@colorado.eduTheodora Chaspari's Google Scholar profileTheodora Chaspari is an Associate Professor in Computer Science and the Institute of Cognitive Science (ICS) at University of Colorado Boulder. Before that, she was an Assistant Professor in Computer Science & Engineering at Texas A&M University (TAMU). She has received a B.S. (2010) in Electrical & Computer Engineering from the National Technical University of Athens, Greece and M.S. (2012) and Ph.D. (2017) in Electrical Engineering from the University of Southern California (USC). Theodora’s research focuses on affective computing, human-centered and responsible machine learning, and health analytics. She is a recipient of the TEES Dean of Engineering Excellence Award (2022), NSF CAREER Award (2021), TAMU Montague Teaching Award (2021), and USC Women in Science and Engineering Merit Fellowship (2015). Papers co-authored with her students have been nominated and won awards at the ACM BuildSys 2019, IEEE ACII 2019, ASCE i3CE 2019, and IEEE BSN 2018 conferences. She is serving as an Editor of the Elsevier Computer Speech & Language and Guest Editor of the IEEE Transactions on Affective Computing. Her work is supported by federal and private funding sources, including the NSF, NIH, NASA, IARPA, AFOSR, General Motors, and the Engineering Information Foundation.",
  "content_length": 1953,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:57"
}