{
  "name": "Theodore P. Pavlic",
  "homepage": "https://search.asu.edu/profile/1995237",
  "status": "success",
  "content": "Ted Pavlic | ASU Search Ted Pavlic Associate Professor, School of Computing and Augmented Intelligence Other ASU affiliations Associate Professor, School of Life Sciences School of Life Sciences Organismal Biology School of Complex Adaptive Systems Social Insect Research Group Biomimicry Center Affiliated Faculty, Center for Biodiversity Outcomes ASU SFI Center ASU-SFI Fellow ASU-SFI Center for Biosocial Complex Systems Water Institute Affiliated Faculty, The Beyond Center Associate Faculty, Biodesign Center for Biocomputing, Security and Society Biosocial Complexity Initiative Center for Social Dynamics and Complexity (CSDC) Senior Global Futures Scientist, Global Futures Scientists and Scholars [email protected] Phone: 480-965-2899 Fax: +1-480-965-2751 Mail code: 8809 Campus: Tempe ‌ Long Bio Associate Professor Theodore (Ted) Pavlic has an interdisciplinary background, starting with a decade of experience in industry in software engineering followed by a doctorate in electrical and computer engineering  (with further industrial experience in analog electronics) and postdoctoral training in computer science and life sciences. He began his faculty appointment at ASU jointly appointed in the School of Computing, Informatics, and Decision Systems Engineering, the School of Sustainability, and the School of Complex Adaptive Systems. After receiving tenure, he shifted into his current joint appointment in the School of Computing and Augmented Intelligence and the School of Life Sciences. His research focuses on understanding adaptive decision-making strategies in autonomous systems. To this end, his laboratory does empirical work with natural systems, such as social-insect colonies, and does engineering work building decision-making algorithms for artificial systems, such as decentralized energy management systems for the built environment. Just as the biological models provide inspiration for novel engineering solutions, the engineering problems inspire new lines of scientific inquiry about those biological systems. This bidirectional flow is facilitated by solid mathematical models of fundamental decision-making processes in common with both the natural and engineered systems. Professor Pavlic was the founding associate director of research for The Biomimicry Center at Arizona State University and continues to be closely associated with the center. He is also active in several professional organizations and publication venues across engineering and life sciences. Pavlic's lab has hosted a broad disciplinary range of postdoctoral scholars and students, and Pavlic is a faculty member in a large number of programs, including Sustainability, Industrial Engineering, Computer Science, Computer Engineering, Applied Math in the Life and Social Sciences, Biology, and Animal Behavior, and he is active in several of the complexity-related groups across ASU's campus. SOCIAL MEDIA AND OTHER RELEVANT EXTERNAL SITES Lab Web Page: https://pavliclab.org/ Personal Web Page: https://tedpavlic.com/ YouTube Channel: @TedPavlic Twitter/X: @TedPavlic BlueSky: @tedpavlic.bsky.social Mastodon: @[email protected] LinkedIn: tedpavlic ORCID ID: 0000-0002-7073-6932 Education POSTDOCTORAL TRAINING Postdoctoral Scholar / Associate Research Scientist, School of Life Sciences, Arizona State University, 2012–2015 Postdoctoral Researcher, Computer Science and Engineering, The Ohio State University, 2010–2012 FORMAL EDUCATION Ph.D., Electrical and Computer Engineering, The Ohio State University, 2007–2010 Dissertation topic: \"Design and Analysis of Optimal Task-Processing Agents\" Advisor: Professor Kevin M. Passino Major Area of Study: Control Engineering Minor Area of Study: Behavioral Ecology and Animal Behavior M.S., Electrical and Computer Engineering, The Ohio State University, 2004–2007 Thesis topic: \"Optimal Foraging Theory Revisited\" Advisor: Professor Kevin M. Passino Area of Study: Control Engineering B.S., Electrical and Computer Engineering, The Ohio State University, 1999–2004 Magna cum Laude, with Honors in Engineering Electrical specialization (emphasis on electromagnetics and digital computers) Minor in Computer and Information Systems (programming and algorithms track) CV Curriculum Vitae Video Research Website URL https://pavliclab.org/ Google Scholar URL https://scholar.google.com/citations?user=UAmGg-cAAAAJ&hl=en Experts.asu.edu URL https://asu.pure.elsevier.com/en/persons/theodore-paul-pavlic ORCID Profile ID https://orcid.org/0000-0002-7073-6932 Research Interests complex adaptive systems collective behavior organismal biology social insects (ants, social bees, social wasps, termites) behavioral ecology optimal foraging theory macronutrient regulation risk-sensitive foraging artificial intelligence (AI) brain-inspired AI machine learning for social data robotics and automation systems biology inspired algorithms control systems nonlinear control optimal control hybrid systems cyber-physical systems applications of software engineering formal methods to verification and validation of physical systems Research Group Pavlic leads the Bringing Ecology and Engineering Together (BEET) lab at Arizona State University (ASU). The laboratory takes an interdisciplinary approach to understanding how natural and artificial complex adaptive systems perceive their environment and make effective decisions autonomously. There is equal focus in the BEET lab on discovery and scientific inference as there is on technological design and engineering. Lab members from a variety of different backgrounds: (a) conduct empirical lab and field behavioral research with living systems (e.g., ant colonies); (b) develop mathematical (theoretical) models of natural cognitive phenomena; (c) design and implement beyond state-of-the-art computational tools for understanding socio-ecological systems; and (d) develop bio-inspired distributed algorithms for decentralized control of engineered systems in the built environment. Methods that are particularly well represented in the BEET lab come from optimization, distributed algorithms, artificial intelligence/machine learning, behavioral ecology, cognitive psychology, and bio-inspired algorithmic design. Target application areas include collective intelligence, the built environment, multi-robot systems, and human–computer augmented intelligence. Publications ORCID ID: 0000-0002-7073-6932 SELECTED JOURNAL PUBLICATIONS [REFEREED] Navas Zuloaga, M.G., K.M. Baudier, J.H. Fewell, N. Ben-Asher, T.P. Pavlic, and Y. Kang. A Modeling Framework for Adaptive Collective Defense: Crisis Response in Social-Insect Colonies. Journal of Mathematical Biology (IF=2.0), 87:87. doi:10.1007/s00285-023-01995-5 Burchill, A.T., T.P. Pavlic, S.C. Pratt, and C.R. Reid. Weaver ants regulate the rate of prey delivery during collective vertical transport. Journal of Experimental Biology (IF=3.2), 226(19):jeb245634. doi:10.1242/jeb.245634 Navas Zuloaga, M.G., T.P. Pavlic, and B.H. Smith. Alternative model systems for cognitive variation: eusocial-insect colonies. Trends in Cognitive Sciences (IF=15.4), 26(10):836–848. 2022. Invited. doi:10.1016/j.tics.2022.06.011 Hunter, A.H., T.P. Pavlic, M.J. Angilletta Jr., R.S. Wilson. Identifying the best strategy for soccer penalty success: A predictive model for optimizing behavioural and biomechanical trade-offs. Journal of Biomechanics (IF=1.617), 141:111208. 2022. doi:10.1016/j.jbiomech.2022.111208 Baudier, K.M., M.M. Bennett, M. Barrett, F.J. Cossio, R.D. Wu, S. O’Donnell, T.P. Pavlic, and J.H. Fewell. Soldier neural architecture is temporarily modality specialized but poorly predicted by repertoire size in the stingless bee Tetragonisca angustula. Journal of Comparative Neurology (IF=3.331), 530(4):672–682. 2022. doi:10.1002/cne.25273 X. Guo, M.R. Lin, L.P. Saldyt, A. Azizi, Y. Kang, T.P. Pavlic, and J.H. Fewell. Decoding alarm signal propagation of seed-harvester ants using automated movement tracking and supervised machine learning. Proceedings of the Royal Society B: Biological Sciences (IF=4.637), 289:20212176. 2022. doi:10.1098/rspb.2021.2176 Baudier, K.M., and T.P. Pavlic. Multi-Level Instrumentation of Bivouac Thermoregulation: Current Methods and Future Directions. Artificial Life and Robotics (IF=1.04), 27:308–315. 2022. doi:10.1007/s10015-022-00759-6 Valentini, G, T.P. Pavlic, S.I. Walker, S.C. Pratt, D. Biro, and T. Sasaki. Naïve individuals promote collective exploration in homing pigeons. eLife (IF=7.080), 10:e68653. 2022. doi:10.7554/eLife.68653 Caetano-Anollés, K., B. Ewers, S. Iyer, J.R. Lucas, T.P. Pavlic, A.P. Seale, and Y. Zeng. A minimal framework for describing living systems: a multi-dimensional view of life across scales. Integrative and Comparative Biology (IF=2.637), 61(6):2053–2065. 2021. Authors in alphabetical order. doi:10.1093/icb/icab172 Pavlic, T.P., J. Hanson, G. Valentini, S.I. Walker, and S.C. Pratt. Quorum sensing without deliberation: Biological inspiration for externalizing computation to physical spaces in multi-robot systems. Swarm Intelligence (IF=2.556), 15(1):171–203. 2021. doi:10.1007/s11721-021-00196-4 Baudier, K.M., and T.P. Pavlic. Incidental interactions among Neotropical army-ant colonies are met with self-organized walls of ants (Hymenoptera: Formicidae). Myrmecological News (IF=2.6, 15/111 in Entomology), 30:251–258. 2020. doi:10.25849/myrmecol.news_030:251 Wheatley, R., T.P. Pavlic, O. Levy, and R.S. Wilson. Habitat features and performance interact to determine the outcomes of terrestrial predator–prey pursuits. Journal of Animal Ecology (IF=5.07), 89(12):2951–2971. 2020. doi:10.1111/1365-2656.13353 Valentini, G., N. Mizumoto, S.C. Pratt, T.P. Pavlic, and S.I. Walker. Revealing the structure of information flows discriminates similar animal social behaviors. eLife (IF=7.080), 9:e55395. 2020. doi:10.7554/eLife.55395 Baudier, K.M., M.M. Bennett, M.M. Ostwald, S. Hart, T.P. Pavlic, and J.H. Fewell. Age-based changes in kairomone response mediate ta",
  "content_length": 32653,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:57"
}