{
  "name": "Theodore S. Rappaport",
  "homepage": "http://wireless.engineering.nyu.edu/tedrappaport",
  "status": "success",
  "content": "Ted Rappaport | NYU WIRELESS Skip to content THEODORE (Ted) S. RAPPAPORT NYU WIRELESS FOUNDING DIRECTOR David Lee/Ernst Weber Professor Prof. of Electrical and Computer Eng, NYU Tandon Prof. of Computer Science, NYU Courant Prof. of Radiology Medicine, NYU Langone New York University Phone: 646.997.3403 · 646.997.3404 Email: pat.donohue@nyu.edu · tlw335@nyu.edu Office: 370 Jay Street, 9th Fl, Brooklyn, NY 11201 home classes about research mmWave publications students & staff in the news Home Theodore (Ted) Rappaport is the David Lee/Ernst Weber Professor at New York University (NYU) and holds faculty appointments in the Electrical and Computer Engineering department of the NYU Tandon School of Engineering, the Courant Computer Science department, and the NYU Grossman School of Medicine. He is the founder and director of NYU WIRELESS, a multidisciplinary research center focused on the future of wireless communications and applications. He is also a Hagler Fellow at Texas A&M University and a Neil Armstrong Distinguished Professor at Purdue University. Rappaport is a pioneer in the fields of wireless communication, radio propagation measurement, channel modeling, antennas, and software. He has made seminal contributions in radio propagation measurements, statistical and site-specific channel modeling, millimeter wave and THz wireless communications with beamforming, communications system design, and physical layer simulation. Throughout his lifetime, he has continually created revolutionary channel sounding systems and software that explore, model, design, and explain wireless communications in the modern era. His PhD at Purdue University in 1987 provided the world’s first propagation measurements inside factory buildings, and was pivotal for the creation of the world’s first IEEE Wi-Fi standard, IEEE 802.11. His propagation measurements and channel models led the US cellular telephone industry to adopt TDMA and CDMA for the first digital 2G US cellular standards. His work influenced the Federal Communications Commission (FCC) to open up the world’s first mobile telephone spectrum in the millimeter wave bands in 2014-2016 as part of the FCC Spectrum Frontiers ruling, and he again led the FCC to open up spectrum in the sub-Terahertz bands above 95 GHz with the FCC Spectrum Horizons ruling in 2018-2019. The global wireless industry adopted his millimeter wave vision for 5th generation (5G) cell phone networks. He founded two businesses that were sold to publicly traded companies — TSR Technologies, Inc. which pioneered software defined radios for cellphone/paging over-the-air intercept and the first Emergency-911 (E911) cell phone position location system, and Wireless Valley Communications, Inc., a leader in site-specific wireless deployment that ushered in the Wi-Fi and microcell/indoor cellular revolutions, and was an advisor to Straight Path Communications which sold 5G millimeter wave spectrum to Verizon. He has authored or edited over 20 books including the best-selling textbooks on wireless communications, adaptive antennas, simulation, and millimeter-wave wireless communications. He is a licensed Professional Engineer and is in the Wireless Hall of Fame of both the Wireless History Foundation and the IEEE Vehicular Technology Society, a member of the U.S. National Academy of Engineering, a Fellow of the U.S. National Academy of Inventors, a recipient of IEEE’s Eric Sumner Award, and a life member of the American Radio Relay League. His ham radio call sign is N9NB. Read more about Ted Rappaport To reach Prof. Rappaport, please contact Pat Donohue at 646-997-3403. Please contact Teresa Wang at 646-997-3404 if you are interested in inviting Prof. Rappaport to give a presentation or attend a meeting. NYU WIRELESS FOUNDER TED RAPPAPORT: RECENT KEYNOTES AND PRESENTATIONS Waste Figure, Waste Factor – 2024 IEEE World Microwave Congress Keynote – May 3, 2024 The Expanding World of Wireless Delivery: New Spectrum and Evolving Delivery Approaches – 2024 IEEE Wireless Communications and Networking Conference Keynote – April 22, 2024, Dubai, UAE View Presentation Slides “Channel Explorers” video of Dr. Rappaport’s students conducting channel measurements EUCNC Keynote – June 6-9, 2023, Gothenburg Sweden Spectrum Frontiers: Terahertz – Feb. 17, 2021 View Presentation Slides Y. Xing and T. S. Rappaport, “Terahertz Wireless Communications: Research Issues and Challenges for Active and Passive Systems in Space and on the Ground above 100 GHz (Invited Paper),” submitted to 2021 IEEE Communications Letters, Feb. 2021, pp. 1-5 https://arxiv.org/abs/2103.00604 Y. Xing, T. S. Rappaport, and A. Ghosh, “Millimeter Wave and sub-THz Indoor Radio Propagation Channel Measurements, Models, and Comparisons in an Office Environment (Invited Paper),” submitted to 2021 IEEE Communications Letters, Feb. 2021, pp. 1-5. https://arxiv.org/abs/2103.00385 Y. Xing and T. S. Rappaport, “Propagation Measurements and Path Loss Models for sub-THz in Urban Microcells,” 2021 IEEE International Conference on Communications, June 2021, pp. 1-6. https://arxiv.org/pdf/2103.01151.pdf FCC Presentation: Wireless Communication and Applications Above 100 GHz:Opportunities and Challenges for 6G and Beyond – March 15, 2019 ﻿ Download Ted Rappaport’s presentation here. Landmark vision paper on 6G and Beyond. Moving to Terahertz T.S. Rappaport, Y. Xing, O. Kanhere, S. Ju, et al, “Wireless Communications and Applications Above 100 GHz: Opportunities and Challenges for 6G and Beyond,” IEEE, June 2019 Theodore (Ted) Rappaport Presents Wireless Communication and Applications Above 100 GHz Feb 28, 2019 Future Wireless Technologies: mmWave, THz, & Beyond – mmWave Coalition, Oct 2018 ECE Distinguished Lecture Series: Ted Rappaport – 2012 “Use Your Tower as A Dual-Band, Low-Band DX Antenna” – Presentation & Article “Use Your Tower as a Dual-Band DX Antenna for 75/80 and 160 Meters,” Theodore (Ted) S. Rappaport, N9NBand James (Jim) Parnell, W5JAW, Dayton Hamvention Antenna Forum by K3LR Friday May 17, 2019 “Use Your Tower as A Dual-Band, Low-Band DX Antenna,” Theodore (Ted) Rappaport, N9NB, and Jim Parnell, W5JAW, QST May 2019. Currently Teaching: Microwave Journal is now providing Professor Ted Rappaport’s 2-day online course, slides and eBook. Previously recorded by IEEE Com Soc, the course covers the fundamental communications, circuits, antennas and propagation issues surrounding emerging 60 GHz wireless LAN and mmWave cellular/backhaul applications. The course, notes and eBook bundle is $499 for individuals and $399 for orders of 10 or more people. Visit www.microwavejournal.com/5Gcourse for more information and ordering. Visit Professor Rappaport’s class page for more information on his current class. Prentice Hall Book Series by Prof. Rappaport View the Prentice Hall Book Series by Prof. Rappaport Prentice Hall Wireless Communications: Principles & Practice, 2nd Edition Website Available The official website for the 2nd edition of Wireless Communications: Principles & Practice is available at http://authors.phptr.com/rappaport. The site includes helpful supplemental downloads for academic and industry course instructors. This book is the world’s most popular textbook for wireless communication engineering, and has been used by over 300 universities and companies in classes and short courses. Pearson/Prentice Hall’s Communications Engineering and Emerging Technologies book series Pearson/Prentice Hall’s Communications Engineering and Emerging Technologies book series features over 20 books in communications and information technology from the world’s leading authors. Award-winning books that cover the technical areas of circuits, simulation, cognitive radio, propagation, space-time channels, communications, wireline and wireless standards, antennas, networks, and emerging future trends, as well as all aspects of communications engineering are included in this book series. Pearson/PH is the Number 1 book publisher for industry and academia – contact me if you wish to have a book title considered for publication. Professor Ted Rappaport is in search of prospective authors for the Prentice Hall PTR “Communications Engineering and Emerging Technologies” book series. Click here for more information. JOURNAL ARTICLES CitationD. Shakya, M.Ying, T.S. Rappaport, “Waste Figure and Waste Factor: New Metrics for Evaluating Power Efficiency in Any Circuit or Cascade”, Microwave Journal Theodore S. Rappaport, Mingjun Ying, Nicola Piovesan, Antonio De Domenico, and Dipankar Shakya, “Waste Factor and Waste Figure: A Unified Theory for Modeling and Analyzing Wasted Power in Radio Access Networks for Improved Sustainability”, (Submitted) IEEE Open Journal of the Communications Society (OJ-COMS), May 2024, pp. 1–26. D.Shakya, M.Ying, T.S.Rappaport, “Using Waste Factor to Optimize Energy Efficiency in Multiple-Input Single-Output (MISO) and Multiple-Input Multiple-Output (MIMO) Systems”, 2024 IEEE Global Communications Conference (GLOBECOM), Cape Town, South Africa, Dec. 2024, pp. 1–6. Radio Propagation Measurements and Statistical Channel Models for Outdoor Urban Microcells in Open Squares and Streets at 142, 73, and 28 GHz, D. Shakya, S. Ju, O. Kanhere, H. Poddar, Y. Xing, T.S. Rappaport, IEEE Transactions on Antennas and Propagation. D. Shakya, T. S. Rappaport, D. Shahrjerdi, M. E. Knox, S. Nie, A. Madanayake, Z. Popovic, H. Wang, ” Exploring Millimeter-Wave and Terahertz Circuits and Systems With a Novel Multiuser Measurement Facility: Multiuser Terahertz Measurement Facility (THz Lab),” IEEE Microwave Magazine, February 2024, DOI: 10.1109/MMM.2023.3320820. H. Poddar, S. Ju, D. Shakya, and T. S. Rappaport, “A Tutorial on NYUSIM: Sub-Terahertz and Millimeter-Wave Channel Simulator for 5G, 6G and Beyond,” IEEE Communications Surveys and Tutorials, December 2023, DOI: 10.1109/COMST.2023.3344671 S. Ju, D. Shakya, H. Poddar, Y. Xing, O. Kanhere, and T. S. Rappaport, “142 GHz Sub-Teraher",
  "content_length": 118062,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:04"
}