{
  "name": "Theophilus A. Benson",
  "homepage": "https://www.andrew.cmu.edu/user/theophib",
  "status": "success",
  "content": "Theophilus A. Benson Theophilus A. Benson Home Publications Software And Datasets Grants Outreach Projects CV CONTACT Email: theophilus [at] cmu [dot] edu Google Scholar About Me I am a professor in the Electrical and Computer Engineering Department at Carnegie Mellon University and at Carnegie Mellon University-Africa. My group focuses on developing models and designing algorithms and frameworks to improve the performance and availability of computer networks. In particular, my group explores the critical role that network state plays in determining network performance and availability with the state’s inherent semantics and emergent state management techniques by investigating designs and algorithms to more holistically understand and manage this state. More recently, we have applied this approach to addressing the digital divide, improving microservices/clouds, managing software defined networks, and rethinking CDN designs. Our designs and systems have been deployed at web scale companies, adopted by opensource systems, and acquired by a large hardware manufacturer. Hiring: I am actively recruiting MS, PhD, and Post-Docs. Post-Docs: I am looking to hire a post-doc researcher on network measurements PhD: We are actively seeking highly motivated PhD students interested. Send me an email. For CMU-MS students, you can find project descriptions here and on ECE's SPT portal. News Paper Oct 2025 Our work on using eBPF for diagnosizing RDMA NIC issues accepted at LPC'25. Paper Sept 2025 Our work on motivating African Observatory accepted at HotNets'25. Invited Keynote/Talk Sept 2025 Keynote the Turing institute's conference on trustworthy digital infrastructure. Invited Keynote/Talk Sept 2025 Our work on CI/CD pipeline for eBPF accepted at KubeCON NA'25. Invited Keynote/Talk Aug 2025 Presented our work on measuring the impact of infrastructure changes at AFPIF'25. Paper Jul 2025 Our work on subsea cable resilience accepted at TPRC '25. Paper Jul 2025 Our work on SmartNIC-based approach to reducing observability bloat accepted NSDI '26 . Paper Jul 2025 Our work on cloud abstractions for collaborative management of AI workloads accepted at APSYS '25 . Awards May 2025 CMU awarded $450K to support our work on network resilience by ICANN . Outreach May 2025 Selected as an ISOC mentor for three IPv6 fellows . Paper Jan 2025 Our analyzing the perform of one of the largest mobile networks in Brazil accepted at TheWebConf'25 Symposium . Outreach Nov 2024 Organizing and participating in a webinar on Network Measurements and Resilience in Africa. Outreach Nov 2024 Hosting IMC remote pod in Rwanda. Outreach Aug 2024 Presented our work on subsea cable analysis at AFPIF 2024! Come find us in Kinshasa. Poster Aug 2024 Two posters on our African Internet Observatory accepted at IMC 2024. Paper Aug 2024 Presented our empirical analysis of Stack Overflow to identify eBPF developer pain-points at SIGCOMM's eBPF workshop. Paper May 2024 Presented our synthetic bench, i.e., JSBench, at TheWebConf Symposium. Paper May 2024 Our framework, NetEdit, on managing eBPF Programs at scale accepted at SIGCOMM'24!! (Joint work with Meta Host Networking Team) Current Research Group Lucas Castanheira, PhD Isabel Suizo, PhD (Co-advised with Justine Sherry) Pragna Mamidipaka, PhD Semebia Wurah, Research Associate Mike Mwanje, Research Associate Heran Equbay, Research Associate Research Broadly, my group focuses on improving the reliability of distributed systems and networks. Reliable Wide Area Networks Data-driven Protocol Optimizations:[DRL-TCP, IWQoS'25] [Hydra, EuroSYS MLSYS'23] [TCP-QOS, IWQoS'23] [ConfigTron, NSDI'22] [ZeroDownTimeUpdates, SIGCOMM'20] Testing/Debugging Protocols: [JSCapsules, SIGMETRICS'23] [ProductionQUIC, WWW'21] [WebPerfOpt, HotMobile'21] [InspectorGadget-TCP, TMA'20] Networks in Global South: [African Internet Observatory, HotNets'25] [WebMedic, HotMobile'21] [AnazlyingMobileBottlenecks, CCR'20] Reliable Cloud Native Applications Cloud Observability: [uView, NSDI'26],[XProbe, LPC'23], [Viperprobe, CloudNet'20] AI Workloads: [BPFRDMATracer, LPC'25] Reliable Programmable Infrastructures Fault Tolerance and Diagnosis: [FoxHound, EuroSYS'23],[Tardis, SoSR'21] [Mozart, SoCC'19] [Chopin, APNet'17] [LegoSDN, SoSR'16] Management Abstractions: [NetEDIT, SIGCOMM'24] [Nimble, INFOCOM'23] [SCC, EuroSYS'19] [Hermes, CoNEXT'17] [ Mecury, SoSR'17] [ SwitchVisor, CAN'17] Software and Datasets Data Center Characteristics [IMC'2010]: data set LegoSDN (Fault Tolerant Controller) [SoSR'16]: source code Dapper (Data Plane diagnosis of TCP) [SoSR'17]: source code P4Visor [CoNEXT'18]: source code Hermes [CoNext'17]: Coming soon! Funding: Grants & Gifts ICANN Foundation, 2025 - 2026. Google Faculty Research Awards, 2018 - 2019. NeTS: Small: Data Driven Mobile Web Performance., 2018 - 2022. NeTS: Small: Network-centric IoT Security., 2018 - 2022. NSF CAREER: Bug Tolerant Networking: Enabling Highly-Available Network Infrastructures through Semantic Transformations., 2018 - 2023. Democratizing Web Performance: Principled Measurements and Optimizations for Performance in Developing Regions, 2018 - 2019. NSF Medium:Towards Finer-Grained Cloud Computing., 2014 - 2019. Facebook Faculty Award, 2015, 2016. Google Cloud Resource Usage Grant, 2015. Yahoo! FREP, 2014, 2015. Yahoo! ACE, 2014. 2014 Equipment Gift from Yahoo, 300 servers. Facebook Gift, 2014-2016. Duke Bass Connections, 2014. Selected Publications Full list of publications can be found here. Configanator: A Data-driven Approach to Improving CDN Performance. Usama Naseer, Theophilus A. Benson [Proceedings of USENIX Networked Systems Designs & Implementation (NSDI), Renton, Washington, Apr 2022] Dissecting Performance of Production QUIC. Alexander Yu, Theophilus A. Benson [Proceedings of The Web Conference (WWW), Ljubljana, Slovenia, Apr 2021] Zero Downtime Release: Disruption-free Load Balancing of a Multi-Billion User Website. Usama Naseer, Luca Niccolini, Udip Pant, Alan Frindell, Ranjeeth Dasineni,Theophilus A. Benson [Proceedings of ACM Special Interest Group on Data Communication (SIGCOMM), New York, New York, Aug 2020] In-Network Compute: Considered Armed and Dangerous. Theophilus A. Benson [Proceedings of ACM Workshop on Hot Topics in Operating Systems (HotOS), Bertinoro, Italy, May 2019] Efficient and Safe Network Updates with Suffix Causal Consistency. Sheng Liu, Theophilus A. Benson, and Michael Reiter [Proceedings of ACM European Conference on Computer Systems (EUROSYS), Dresden, Germany, Mar 2019] Performance Characterization of a Commercial Video Streaming Service. Mojgan Ghasemi, Partha Kanuparthy, Ahmed Mansy, Theophilus Benson and Jennifer Rexford [Proceedings of ACM Internet Measurement Conference (IMC), Santa Monica, CA, Nov 2016]",
  "content_length": 6793,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:02"
}