{
  "name": "Theo P. van der Weide",
  "homepage": "http://www.cs.ru.nl/~tvdw/index.php",
  "status": "success",
  "content": "Homepage Theo van der Weide Homepage Theo van der Weide Publication list Address Info Radboud University Nijmegen Institute for Computing and Information Sciences (iCIS) Instituut voor Informatica en Informatiekunde Short Curriculum Vitae IRIS was the winged goddess ofthe rainbow and the messengerof the Olympian gods. Th.P. (Theo) van der Weide received his masters degree Mathematics at the Technical University Eindhoven, the Netherlands in 1975, and the degree of Ph.D. in Mathematics and Physics from the University of Leiden, the Netherlands in 1980. He also is a recipient of the Dutch order of chivalry: Officer of Orange-Nassau. He is currently emeritus professor in Information Retrieval and Information Systems (IRIS) in the section Data Science (DaS) of the Institute for Computing and Information Sciences (iCIS) at the Faculty of Science from the Radboud University in Nijmegen, the oldest city in the Netherlands. Research His main research interests include information systems, information retrieval and knowledge based systems. Currently he is mainly involved in building support tools for policy makers for complex decision making. Typical application areas are environmental problems and the introduction of eGovernance. Recent work Best publications Bommel, P. van and Hofstede, A.H.M. ter and Weide, Th.P. van derSemantics and verification of object-role modelsInformation Systems, Nr: 5, Vol: 16, Pages: 471-495, October, 1991. (295)Hofstede, A.H.M. ter and Proper, H.A. and Weide, Th.P. van derFormal definition of a conceptual language for the description and manipulation of information modelsInformation Systems, Nr: 7, Vol: 18, Pages: 489-523, October, 1993. (267)Arampatzis, A.T. and Tsoris, T. and Koster, C.H.A. and Weide, Th.P. van derPhrase-based Information RetrievalInformation Processing & Management, Nr: 6, Vol: 34, Pages: 693-707, December, 1998. (232)Arampatzis, A.T. and Weide, Th.P. van der and Koster, C.H.A. and Bommel, P. vanLinguistically-motivated Information RetrievalEncyclopedia of Library and Information Science, published by Marcel Dekker, Inc. - New York - Basel, Pages: 201-222, 2000. (230)Frederiks, P.J.M. and Weide, Th.P. van derInformation Modeling: the process and the required competencies of its participantsIn: Data & Knowledge Engineering, Nr: 1, Vol: 58, Pages: 4-20, July, 2006, Best paper award in NLDB 2004 conference. (202)Hofstede, A.H.M. ter and Weide, Th.P. van derExpressiveness in conceptual data modellingData & Knowledge Engineering, Nr: 1, Vol: 10, Pages: 65-100, February, 1993. (187)Hofstede, A.H.M. ter and Weide, Th.P. van derFormalisation of techniques: chopping down the methodology jungleInformation and Software Technology, Nr: 1, Vol: 34, Pages: 57-65, January, 1992. (162)Bruza, P.D. and Weide, Th.P. van derTwo Level HypermediaProceedings of the Data Base and Expert System Applications Conference (DEXA 90), Vienna, Austria, EU, Berlin, Germany, EU, Edited by: A.M. Tjoa, and R.R. Wagner. Pages: 76-83, Springer, 1990, ISBN 3211822348. (160)Hoppenbrouwers, S.J.B.A. and Proper, H.A. and Weide, Th.P. van derA Fundamental View on the Process of Conceptual ModelingConceptual Modeling - ER 2005 - 24 International Conference on Conceptual Modeling, Lecture Notes in Computer Science, Vol: 3716, Pages: 128-143, June, 2005, ISBN 3540293892. (146)Bruza, P.D. and Weide, Th.P. van derStratified Hypermedia Structures for Information DisclosureThe Computer Journal, Nr: 3, Vol: 35, Pages: 208-220, 1992. (132)Grootjen, F.A. and Weide, Th.P. van derConceptual Query ExpansionIn: Data and Knowledge Engineering, Nr: 2, Vol: 56, Pages: 174-193, februari 2006. (123)Bruza, P.D. and Weide, Th.P. van derThe Semantics of Data Flow DiagramsProceedings of the International Conference on Management of Data (CISMOD), Hyderabad, India, Edited by: N. Prakash. Pages: 66-78, McGraw-Hill, New York, New York, USA, 1989. (121)Omona, W. and Weide, Th.P. van der and Lubega, J.T.Using ICT to enhance Knowledge Management in higher education: A conceptual framework and research agendaInternational Journal of Education and Development using Information and Communication Technology (IJEDICT), 2010, Vol. 6, Issue 4, pp.83-101. (112)Arampatzis, A.T. and Beney, J. and Koster, C.H.A. and Weide, Th.P. van derIncrementality, Half-Life, and Threshold Optimization, for Adaptive Document FilteringThe Nineth Text REtrieval Conference (TREC-9), Edited by: Ellen M. Voorhees, and Donna K. Harman. November 1, Department of Commerce, National Institute of Standards and Technology (NIST), Gaithersburg, Maryland, USA, Pages 13-16, 2000. (91)Leijenhorst, D.C. van and Weide, Th.P. van derA formal derivation of Heaps' LawInformation Sciences Volume 170, Issues 2-4, 25 February 2005, Pages 263-272. (85)Hofstede, A.H.M. ter and Proper, H.A. and Weide, Th.P. van derQuery formulation as an information retrieval problemThe Computer Journal, Nr: 4, Vol: 39, Pages: 255-274, September, 1996. (82)Hoppenbrouwers S.J.B.A. and Proper, H.A. and Weide, Th.P. van derFormal Modelling as a Grounded ConversationThe Language Action Perspective on Communication Modelling, Kiruna, Sweden, June 19-20, 2005. (80)Proper, H.A. and Weide, Th.P. van derEVORM - A Conceptual Modelling Technique for Evolving Application DomainsData & Knowledge Engineering, Vol: 12, Pages: 313-359, 1994. (77)Wondergem, B.C.M. and Bommel, P. van and Huibers, T.W.C. and Weide, Th.P. van derTowards an Agent-Based Retrieval Engine (Profile-Information Filtering Project)Proceedings of the 19th BCS-IRSG Colloquium on IR Research, Edited by: J. Furner, and D.J. Harper. Pages: 126-144, April, 1997. (61)Proper, H.A. and Weide, Th.P. van derInformation Disclosure in Evolving Information Systems: Taking a shot at a moving targetData & Knowledge Engineering, Vol: 15, Pages: 135-168, 1995. (57)Arampatzis, A.T. and Weide, Th.P. van der and Koster, C.H.A. and Bommel, P. vanAn Evaluation of Linguistically-motivated Indexing SchemesProceedings of the 22nd BCS-IRSG Colloquium on IR Research, Pages: 34-45, April, 2000. (52)Bruza, P.D. and Weide, Th.P. van derThe Modelling and Retrieval of Documents using Index ExpressionsACM SIGIR FORUM (Refereed Section), Nr: 2, Vol: 25, 1991. (52)Bommel, P. van and Weide, Th.P. van derReducing the search space for conceptual schema transformationData & Knowledge Engineering, Vol: 8, Pages: 269-292, 1992. (47)Bommel, P. van and Hoppenbrouwers, S.J.B.A. and Proper, H.A. and Weide, Th.P. van derExploring Modelling Strategies in a Meta-modelling ContextEdited by: R. Meersman, Z. Tari, and P. Herrero. Pages: 1128-1137, October/November, Springer, 2006. (46)Bommel, P. van and Hoppenbrouwers, S.J.B.A. and Proper, H.A. and Weide, Th.P. van derGiving Meaning to Enterprise Architectures - Architecture Principles with ORM and ORCOTM Workshops 2006, Edited by: R. Meersman, Z. Tari, and P. Herrero. October/November, Springer, 2006, Pages: 1138-1147. (43)Proper, H.A. and Weide, Th.P. van derA General Theory for the Evolution of Application ModelsIEEE Transactions on Knowledge and Data Engineering, Nr: 6, Vol: 7, Pages: 984-996, December, 1995. (38)Muyinda, P.B. and Lubega, J.T. and Lynch, K. and Weide, Th.P. van derMobile Learning Objects Deployment and Utilization in Developing CountriesIADIS International Conference Mobile Learning 2010. (38)Pande, R. and Weide, Th.P. van derGlobalization, Technology Diffusion, and Gender Disparity: Social Impacts of ICTsIGI, Feb. 2012, ISBN:978-1-4666-0020-1. (37)Weide, Th.P. van der and Hofstede, A.H.M. ter and Bommel, P. vanUniquest: Determining the Semantics of Complex Uniqueness ConstraintsThe Computer Journal, Nr: 2, Vol: 35, Pages: 148-156, April, 1992. (36)Hofstede, A.H.M. ter and Proper, H.A. and Weide, Th.P. van derExploiting Fact Verbalisation in Conceptual Information ModellingInformation Systems, Nr: 6/7, Vol: 22, Pages: 349-385, September, 1997. (35)Wondergem, B.C.M. and Bommel, P. van and Weide, Th.P. van derMatching Index Expressions for Information RetrievalInformation Retrieval Journal, Nr: 4, Vol: 2, Pages 337-360, 2000. (34)Vrieze, P.T. de and Bommel, P. van and Weide, Th.P. van derA Generic Adaptive Model in Adaptive HypermediaTechnical report: NIII-R0424, May, Radboud University Nijmegen, 2004. (34)Bagarukayo, E. and Weide, Th.P. van der and Mbarika, V. and Kia, M.The Impact of Multimedia on the Perceived Higher Order Cognitive Skills ImprovementInternational Journal of Education and Development using ICT (IJEDICT), Vol 8, Issue 2, August 2012. (32)Mir, Omid and Weide, Th.P. van der and Lee, Cheng-ChiA Secure User Anonymity and Authentication Scheme Using AVISPA for Telecare Medical Information SystemsJournal of Medical Systems, accepted June 16, 2015, 39:89. (32)Bommel, P. van and Hoppenbrouwers, S.J.B.A. and Proper, H.A. and Weide, Th.P. van derQoMo - a modelling process quality framework based on SEQUALWorkshop of conference on advanced information systems engineering, Trondheim, 2007. (31) [ All publications ] Address Info Prof.em. dr.ir. Th.P. van der Weide Information Retrieval and Information Systems (Iris) Section: Data Science (DaS) Nijmegen Institute for Computing and Information Sciences Radboud University Nijmegen, email: Th.P.vanderWeide@cs.ru.nl www: http://www.cs.ru.nl/Th.P.vanderWeide For more information, please contact me. © WeCo Productions 2005 - 2025",
  "content_length": 9334,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:57"
}