{
  "name": "Theo Gevers",
  "homepage": "https://staff.fnwi.uva.nl/th.gevers",
  "status": "success",
  "content": "Prof. dr. Theo Gevers Prof. dr. Theo Gevers About me CV Publications Press Theo Gevers is a professor of Computer Vision (Artificial Intelligence) at the University of Amsterdam. He is director of the Computer Vision Research Group and co-director of the Atlas Lab (UvA-TomTom) and Delta Lab (UvA-Bosch). His research area is (generative) artificial intelligence with the focus on computer vision and deep learning, and in particular image understanding, 3D (object) reconstruction and recognition with industrial and societal applications. He is a VICI laureate (prestigious Dutch research grant). He is the co-founder of 3DUniversum, Scanm (Sold in 2020), and Sightcorp (Sold in 2022). He has published over 300 scientific articles and 3 books with a total number of citations of more than 30,000. For current information regarding his H-index and number of publications, consult Google Scholar. He is organizer, general chair, and program committee member of a various number of conferences, and an invited speaker at major conferences. He is actively engaged in media and dissemination activities with contributions on TV, newspapers, and magazines. Our BBQ 2025 Team (UvA-3DU) Our Delta Lab 2025 Team (UvA-Bosch) Our 3DUniversum 2025 Product Team (weScan) Scientific Labs Computer Vision Lab Atlas Lab Delta Lab Companies 3DUniversum ScanM (sold) Sightcorp (sold) Theo Gevers in Media-Press (Highligths) DeMorgen: 07-11-25, de Volkskrant: 06-11-25, Trouw: 24-10-25, AD: 02-09-25, DeMorgen: 25-08-2025, AD: 18-07-25, NRC: 07-04-2025 Omroep Max: 07-04-2025, DeMorgen: 01-04-2025, de Volkskrant: 24-03-2025, Eenvandaag:09-06-2024, DeMorgen:05-06-2024 , Focus:28-03-2024, de Volkskrant:15-03-2024, de Volkskrant:05-02-2024, NPO:09-12-2023, de Volkskrant:14-11-2023, RTL News:10-10-2023, NOS News:08-10-2023, de Volkskrant:19-08-2023, Trouw:28-02-2023, nu.nl:16-12-2022, de Volkskrant:02-12-2022, NPO:13-11-2022 (time 09:30), Trouw:13-11-2022, Leidsch Dagblad:13-11-2022 , NOS 8 uur Journaal:23-05-2022 (time 11:33), NOS:23-05-2022, Trouw:23-05-2022, NPO2:22-09-2021, NPO Zapp:16-09-2021, NTR:15-07-2021, Volkskrant:03-07-2021 NOS:28-05-2021, Volkskrant:28-05-2021, Financieel Dagblad:29-04-2021, NOS Jornaal:28-04-2021 (Time 4:15), NOS1:28-04-2021, NOS2:28-04-2021, Volkskrant:28-04-2021, Trouw:28-04-2021, Trouw:02-03-2021, AD:25-02-2021, NOS Nieuwsuur:21-02-2021, Zondag met Lubach:07-02-2021, Bram Krikke Show Videoland:07-02-2021, Zondag met Lubach:22-11-2020, NOS:22-11-2020, Nieuwsuur NOS:10-11-2020, Klaas Kan Alles:27-10-2020, NPO3 KRO-NCRV:25-10-2020, Max Vandaag:01-09-2020, Volkskrant:31-07-2020, Klaas Kan Alles:07-12-2019, Opgelicht?!, AvroTros:03-12-2019, Het Parool:14-11-2019, De Telegraaf:14-11-2019, Nu.nl:14-11-2019, Algemeen Dagblad:14-11-2019, deVolkskrant:12-09-2019, NOS Journaal:06-09-201, RTL Nieuws:01-09-2019, AD:03-08-2019, RTL News:12-06-2019. (Time 17:21), AvroTros:22-05-2019\", TV-VPRO Tegenlicht:18-11-2018, De Wereld Draait Door (DWDD):09-11-2018, TV-VPRO Tegenlicht:21-10-2018., de Volkskrant:21-04-2018, EenVandaag:29-01-2018, NRC::29-01-2018, TV-VPRO Tegenlicht:18-11-2018, De Wereld Draait Door (DWDD):09-11-2018, TV-VPRO Tegenlicht:21-10-2018, de Volkskrant:21-04-2018, EenVandaag:29-01-2018, page1:22-09-2017, page2:22-09-2017, NOS:20-09-2017, Volkskrant:20-09-2017, NPO:20-09-2017. Delegation of the Computer Vision Research Group at ICCV Recent Theses Theo Gevers News (Overview) 06-11-25: Does AI Discriminate? Scientists Tested It with Photos of 2,000 People Worldwide. de Volkskrant, DeMorgen 24-10-25: First CDA, now D66? How TikTok shapes the youth vote. Trouw 02-09-25: TV Program B&B | full of AI: are these kinds of videos even allowed? AD 25-08-2025: YouTube secretly adds AI filter to short videos. DeMorgen 18-07-25: This \"sniper\" wasn't really there: how can you actually recognize a fake photo? AD 02-06-2025: Plenty of warnings about voice cloning scams, but few victims. NRC 07-04-2025: Spotting Deepfakes: Outsmarting the Computer. id.nl 07-04-2025: Recognizing deepfake videos: how do you do that? Omroep Max 01-04-2025: What is at hand? Here's how you can learn to recognize AI-generated images yourself. DeMorgen 24-03-2025: Deepfake videos are improving at lightning speed. How can you tell what's fake with the naked eye? de Volkskrant 09-06-2024: How to recognize deepfake videos? If you pay attention to these 8 things, you'll get a long way. Eenvandaag, BM, Elblog 05-06-2024: Disinformation during election time. ECP. 21-05-2024: Talking to your grandmother who has been dead for seven years? Thanks to artificial intelligence, it's possible. DeMorgen en Humo. 28-03-2024: Research shows that talking about it or writing it off can help, but there are also fascinating new techniques for processing grief. For instance, you can create a deepfake of a deceased loved one and communicate with it. Broadcast on the topic of 'the new mourning' Focus . Focus is a science program by NTR from the Dutch public broadcaster NPO. 15-03-2024: Text to video, the new AI hype, how does it work? Article in de Volkskrant 05-02-2024: Financial employee in Hong Kong pays 24 million after video call with deepfake. Articles in de Volkskrant and De Morgen 09-12-2023: 3DUniversum on National TV (NPO) featuring Morris Franken and Anja Rosner. AI is taking over jobs? WNL - State of the Netherlands - Generation Next. TV item and Article. 01-12-2023: On perpetrator-victim dialogues: WNL 14-11-2023: Why we see AI Faces as 'more real' than human faces. Articles in de Volkskrant and DeMorgen. See also deepfake detection software by 3DUniversum Deepfact. 17-10-2023: This is what you didn't know about smiling. Metro World News, La Plata1. 10-10-2023: Issues with deepfakes: 4 questions and answers. RTL News 08-10-2023: Deepfakes of Tom Hanks and Bunq's CEO show the risk of AI-generated videos. NOS News 19-08-2023: How do programs like Midjourney and DALL-E 2 create this type of images? And how can you tell that they are not real photos? Article in de Volkskrant 18-08-2023: What are deepfakes and how dangerous are they? vpngids 28-02-2023: Forget Google, a touchy chatbot will help us to search better. Article in Trouw 30-01-2023: Deepfake therapie: quand les victimes d'agression sexuelle peuvent dialoguer avec leur agresseur. Article dans Le Vif 29-01-2023: Processing sexual abuse with deepfake therapy: victims talk to robot version of the perpetrator. Articles vrt.be and msn.com 16-12-2022: The House of Representatives wants to ban deepfakes, but that can hardly be enforced. Article nu.nl 16-12-2022: Deepfakes can also be helpful DataNews 02-12-2022: Article in de Volkskrant about deepfake therapy and the question whether talking to a perpetrator or deceased partner can help to process a trauma or unpleasant event. 13-11-2022: Perpetrator confrontation using deepfake technology with victims with sexual violence-related PTSD and moral injury. The platform deeptherapy.ai, is developed by 3DUniversum. Article in Frontiers in Psychiatry, A live intervention was broadcast on TV: Welmoed and the sexfakes (time 09:30), and the topic is covered in different newspapers: Trouw, Leidsch Dagblad , KIJK . 23-09-2022: Delta Lab 2 was officially opened. The UvA and world-leading technology company Bosch have agreed to extend their established collaboration with the launch of a new public-private research lab. Within this collaboration, I am happy to act as the scientific co-director together with Dr Jan-Willem van de Meent. Dr. Eric Nalisnick will be the daily lab manager. Delta Lab 2 will focus on the use of artificial intelligence and machine learning for applications in computer vision, generative models and causal learning. 15-09-2022: The Atlas Lab (https://icai.ai/atlas-lab/) was festively opened. Within this collaboration, I am happy to act as the scientific co-director together with Prof. dr. Cees Snoek, and Dr. Martin Oswald as the lab manager. The Atlas Lab is a collaboration between TomTom and the Universiteit van Amsterdam (UvA). The public-private research lab focuses on using Artificial Intelligence (AI) for developing advanced, highly accurate and safe high definition (HD) maps for self-driving vehicles. 09-09-2022: 3DUniversum, spin-off of the Informatics Institute awarded EUR 1M grant. 3DUniversum founded by Theo Gevers and Sezer Karaoglu of the Informatics Institute, is awarded EUR 1M grant to co-develop the first self-test STD kit that you can do at home with instant results. The grant is for the FASTDetection project (with a total amount of EUR 2,7M) through the Eurostars Programme. Partners are Testmate Health SA and University Hospital of Geneva. Read more: Article at IvI-UvA 23-05-2022: Police have posted a deepfake video online in which a 13-year-old victim calls on his killer and witnesses to come forward: (1) Paudal, and (in Dutch): (2) NOS 8 uur Journaal (time 11:33), (3) NOS, (4) Trouw, and (5) Digitale overheid. 18-03-2022: Theo Gevers, co-director of new research lab (EUR 5.2 million funding for a total of 10 PhD students for 4 years) - Delta Lab - collaboration between UvA and Bosch 12-01-2022: Sightcorp (spin-off Informatics Institute) acquired by Raydiant. Sightcorp has been founded by prof. dr. Theo Gevers and dr. Roberto Valenti as a spin-off of the Informatics Institute. The years of its founding, technical development and commercialization have been inspiring, fun and challenging. Sightcorp has now been sold to Raydiant who will take over the team, company name and technology. Sightcorp's product and related academic research have received attention and appreciation from all over the world. It has shined in the (inter) national press at DWDD, RTL, BBC, CNN, Bloomberg, TV5, etc. 22-09-2021: TV item featuring 3DUniversum technology, NPO 2 16-09-2021: Faceswap by 3DUniversum of Britt Dekker (deepfake starts at 3:00 minutes) to inform children about deepfakes: NPO Zapp. 15-07-2021: The truth of deepfake. De Kennis van Nu: TV science specials 03-07-",
  "content_length": 29671,
  "method": "requests",
  "crawl_time": "2025-12-01 14:36:58"
}