{
  "name": "Therese Graversen",
  "homepage": "https://pure.itu.dk/portal/da/persons/therese-graversen(1578b20c-b5d0-466f-b114-2582529ddc53).html",
  "status": "success",
  "content": "Therese Graversen - IT-Universitetet i København Therese Graversen Lektor, Data ScienceMachine LearningUddannelsesleder, Bachelor i Data Science https://orcid.org/0000-0002-2323-8965 E-mailthegitudk 20192022 Publikationer pr. år Personlig profil EmneordStatisticsBayesian networksGraphical modelsDNA forensicsForensic science Fingeraftryk Dyk ned i forskningsemnerne, hvor Therese Graversen er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 4 Lignende profiler Educational Activities Keyphrases 100% High School Student Social Sciences 75% Computing Task Keyphrases 50% Programming Experience Keyphrases 50% University Students Keyphrases 50% High School Students Keyphrases 41% Male Students Keyphrases 33% Educators Keyphrases 33% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2021 2021 2022 2022 3 Konferencebidrag i proceedings Publikationer pr. år Publikationer pr. år Predicting Bearings Degradation Stages for Predictive Maintenance in the Pharmaceutical IndustryJuodelyte, D., Cheplygina, V., Graversen, T. & Bonnet, P., 2022, KDD '22: The 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, Washington, DC, USA, August 14 - 18, 2022. Zhang, A. & Rangwala, H. (red.). Association for Computing Machinery, s. 3107-3115 9 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Computing Educational Activities Involving People Rather Than Things Appeal More to Women (CS1 Appeal Perspective)Marcher, M. H., Christensen, I. M., Grabarczyk, P., Graversen, T. & Brabrand, C., 17 aug. 2021, Proceedings of the 17th ACM Conference on International Computing Education Research (ICER 2021). Association for Computing Machinery, s. 145–156 Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang University Students 100% Educational Activities 100% Computing Task 100% High School Student 100% Educators 50% Computing Educational Activities Involving People Rather Than Things Appeal More to Women (Recruitment Perspective)Christensen, I. M., Høegh Marcher, M., Grabarczyk, P., Graversen, T. & Brabrand, C., 17 aug. 2021, Proceedings of the 17th ACM Conference on International Computing Education Research (ICER 2021). Association for Computing Machinery, s. 127–144 Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Educational Activities 100% Programming Experience 100% High School Student 100% High School Students 33% Secondary Schools 33% Projekter Projekter pr. år 2019 2019 2022 2027 1 Afsluttet 1 Igangværende Projekter pr. år Statistical and Computational Aspects of Forensic Identification using DNAGraversen, T. (PI)Danmarks Frie Forskningsfond01/11/2019 → 31/07/2020Projekter: Projekt › Forskning A Unified Statistical Framework for Complex Forensic DNA EvidenceGraversen, T. (PI) & Budrikas, K. (CoI)Danmarks Frie Forskningsfond01/03/2022 → 28/02/2027Projekter: Projekt › Forskning Forensic Identification 100% Forensic DNA Evidence 100% DNA Evidence 100% Statistical Framework 100% Identification Problem 100% Presse/medier Nyt i Emilie Meng-sagen: Dette kan blive et afgørende bevisGraversen, T.05/03/20241 MediebidragPresse/medie Fængsles i 27 dageGraversen, T.07/02/20241 MediebidragPresse/medie Ekspert betegner ny DNA-metode i drabssag som nybrud hos dansk politi (v.2)Graversen, T.07/02/20241 MediebidragPresse/medie Ritzau Plus: DNA-analyser giver nyt lys på gamle sagerGraversen, T.07/02/20241 MediebidragPresse/medie RETSMEDICIN: Forbrydelsens genetikGraversen, T.04/05/20231 MediebidragPresse/medie Se alle 14 presse/medier",
  "content_length": 4124,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:06"
}