{
  "name": "Thibault Langlois",
  "homepage": "https://ciencias.ulisboa.pt/perfil/tnlanglois",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Contactos Departamento de Informática Ext. Principal 26376 Telefone Direto 217500000 Email tnlanglois@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Auxiliar Indicadores Orcid Google Scholar Currículo Resumido 1. Formação académica- 1994: DOUTORAMENTO Equivalência do Doutoramento obtido em França pela Universidade Técnica de Lisboa, Instituto Superior TécnicoTítulo da tese: Algorithmes d'apprentissage par renforcement pour la commande adaptative- 1992 DOUTORAMENTO Université de Technologie de CompiègneTítulo da tese: Algorithmes d'apprentissage par renforcement pour la commande adaptativeDomínio científico: Apendizagem Automática, Redes Neuronais, Aprendizagem por reforçoDesignação do curso:- 1988 MESTRADOInstituição que conferiu o grau: Université de Technologie de Compiègne1987 LICENCIATURA Engenharia Informática Université de Technologie de Compiègne2. Actividades anteriores e situação actual1989 a 1992\tAssistente, Université de Technologie de Compiègne1993 a 1994\tAssistente, Instituto Superior Técnico1994 a 2001\tProfessor Auxiliar, Instituto Superior Técnicodesde 2001 Professor Auxiliar, Universidade de Lisboa Interesses Científicos Aprendizagem Autómatica, Aprendizagem por Reforço, Redes Neuronais, Data Mining Music Information Retrieval e, de uma maneira geral, a aplicação dessas tecnologias a resolução de problemas nas àreas das tecnologias da informação e processamento de dados multimedia. Scientific Interests Machine Learning, Reinforcement Learning, Neural Networks, Music Information Retrieval, Audio Classification Publicações selecionadas Pedro Reis Santos, Thibault Langlois, Compiladores: da Teoria à Prática. FCA, Lisboa, ISBN: 978-972-722-768-6, 2014 Bob L. Sturm, Rolf Bardeli, Thibault Langlois, Valentin Emiya, Formalizing the Problem of Music Description. Proc. Int. Symposium on Music Information Retrieval. 2014. João Lobato Oliveira, Keisuke Nakamura, Thibault Langlois, Fabien Gouyon, Kazuhiro Nakadai, Angelica Lim, Luis Paulo Reis, and Hiroshi G. Okuno, Making a Robot Dance to Diverse Musical Genre in Noisy Environment, IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) September 14-18, 2014. Chicago, IL, USA, 2014 Parameter adaptation in stochastic optimization LB Almeida, T Langlois, JD Amaral, A Plakhov On-Line Learning in Neural Networks, Publications of the Newton Institute, 1998 A Music Classification Method based on Timbral Features. T Langlois, G Marques ISMIR, 81-86, 2009 Ver todas as Publicações",
  "content_length": 2688,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:12"
}