{
  "name": "Thiemo Voigt",
  "homepage": "https://katalog.uu.se/empinfo/?id=N2-279",
  "status": "success",
  "content": "Thiemo Voigt - Uppsala universitet Thiemo Voigt Professor vid Institutionen för elektroteknik; Nätverksbaserade inbyggda system Mobiltelefon: 070-633 09 40E-post: thiemo.voigt@angstrom.uu.seBesöksadress: Ångström, Lägerhyddsvägen 1752 37 UppsalaPostadress: Box 65751 03 Uppsala Ladda ned kontaktuppgifter för Thiemo Voigt vid Institutionen för elektroteknik; Nätverksbaserade inbyggda system Akademiska meriter: Docent i datavetenskap med inriktning mot datorkommunikation Kort presentation I am professor for wireless sensor networks at Uppsala University where I lead the Division of networked Embedded Systems at the Department of Electrical Engineering Please look there for further information. Publikationer Senaste publikationer Fault Tolerance in Space with Heterogeneous Hardware: Experiences from a 68-day CubeSat Deployment in LEO El Yaacoub, Ahmed; Voigt, Thiemo; Ruemmer, Philipp; Mottola, Luca 2025 Desynchronized Querying of Analog Backscatter Tags Piumwardane, Dilushi; Padmal, Madhushanka; Rohner, Christian; Voigt, Thiemo 2025 Detecting Energy Attacks in the Battery-Less Internet of Things Mottola, Luca; Voigt, Thiemo Ingår i FOUNDATIONS AND PRACTICE OF SECURITY, FPS 2024, PT II, s. 156-173, 2025 DOI för Detecting Energy Attacks in the Battery-Less Internet of Things Effects on Power-plane Communications: Case Study on Textile and Spacecraft Media Akbari, Saba; Lindner, Andreas; Voigt, Thiemo; Bergman, Jan et al. Ingår i 2025 IEEE SENSORS APPLICATIONS SYMPOSIUM, SAS, 2025 DOI för Effects on Power-plane Communications: Case Study on Textile and Spacecraft Media On the Performance of Harmonic Backscattering for Zero-Energy Devices Foti, Paschalina; Mouris, Boules A.; Voigt, Thiemo; Zaher, Mahmoud et al. Ingår i 2025 IEEE WIRELESS POWER TECHNOLOGY CONFERENCE AND EXPO, WPTCE, 2025 DOI för On the Performance of Harmonic Backscattering for Zero-Energy Devices Alla publikationer Artiklar i tidskrift Anthropomorphic Torso Phantoms and Validation of Their Physical and Digital Twins for Body-Area Radio-Communication Applications Joseph, Laya; Zradzinski, Patryk; Chezhian, Arvind Selvan; Mandal, Bappaditya et al. Ingår i IEEE Transactions on Biomedical Engineering, s. 1858-1871, 2025 DOI för Anthropomorphic Torso Phantoms and Validation of Their Physical and Digital Twins for Body-Area Radio-Communication Applications Design and Analysis of Low Profile Antenna Shielding to Enhance the Performance of Wearable Fat-IBC System Shaw, Tarakeswar; Mandal, Bappaditya; Engstrand, Johan; Karlsson, Roger L. et al. Ingår i IEEE Sensors Journal, s. 13785-13796, 2025 DOI för Design and Analysis of Low Profile Antenna Shielding to Enhance the Performance of Wearable Fat-IBC System An Experimental Study of Byzantine-Robust Aggregation Schemes in Federated Learning Li, Shenghui; Ngai, Edith C.-H.; Voigt, Thiemo Ingår i IEEE Transactions on Big Data, s. 975-988, 2024 DOI för An Experimental Study of Byzantine-Robust Aggregation Schemes in Federated Learning Rotation insensitive implantable wireless power transfer system for medical devices using metamaterial-polarization converter Shaw, Tarakeswar; Mandal, Bappaditya; Samanta, Gopinath; Voigt, Thiemo et al. Ingår i Scientific Reports, 2024 DOI för Rotation insensitive implantable wireless power transfer system for medical devices using metamaterial-polarization converter Ladda ner fulltext (pdf) av Rotation insensitive implantable wireless power transfer system for medical devices using metamaterial-polarization converter On-device Training: A First Overview on Existing Systems Zhu, Shuai; Voigt, Thiemo; Rahimian, Fatemeh; Ko, Jeonggil Ingår i ACM transactions on sensor networks, 2024 DOI för On-device Training: A First Overview on Existing Systems Secure opportunistic routing in 2-hop IEEE 802.15.4 networks with SMOR Krentz, Konrad-Felix; Voigt, Thiemo Ingår i Computer Communications, s. 57-69, 2024 DOI för Secure opportunistic routing in 2-hop IEEE 802.15.4 networks with SMOR Ladda ner fulltext (pdf) av Secure opportunistic routing in 2-hop IEEE 802.15.4 networks with SMOR Scheduling Dynamic Software Updates in Mobile Robots El Yaacoub, Ahmed; Mottola, Luca; Voigt, Thiemo; Rümmer, Philipp Ingår i ACM Transactions on Embedded Computing Systems, s. 1-27, 2023 DOI för Scheduling Dynamic Software Updates in Mobile Robots Ladda ner fulltext (pdf) av Scheduling Dynamic Software Updates in Mobile Robots Realization of a Portable Semi-Shielded Chamber for Evaluation of Fat-Intrabody Communication Rangaiah, Pramod; Karlsson, Roger L.; Chezhian, Arvind Selvan; Joseph, Laya et al. Ingår i IEEE Access, s. 72743-72755, 2023 DOI för Realization of a Portable Semi-Shielded Chamber for Evaluation of Fat-Intrabody Communication Ladda ner fulltext (pdf) av Realization of a Portable Semi-Shielded Chamber for Evaluation of Fat-Intrabody Communication Byzantine-Robust Aggregation in Federated Learning Empowered Industrial IoT Li, Shenghui; Ngai, Edith; Voigt, Thiemo Ingår i IEEE Transactions on Industrial Informatics, s. 1165-1175, 2023 DOI för Byzantine-Robust Aggregation in Federated Learning Empowered Industrial IoT Auto-weighted Robust Federated Learning with Corrupted Data Sources Li, Shenghui; Ngai, Edith; Ye, Fanghua; Voigt, Thiemo Ingår i ACM Transactions on Intelligent Systems and Technology, s. 1-20, 2022 DOI för Auto-weighted Robust Federated Learning with Corrupted Data Sources Fat-IntraBody Communication at 5.8 GHz: Verification of Dynamic Body Movement Effects Using Computer Simulation and Experiments Asan, Noor Badariah; Hassan, Emadeldeen; Perez, Mauricio D.; Joseph, Laya et al. Ingår i IEEE Access, s. 48429-48445, 2021 DOI för Fat-IntraBody Communication at 5.8 GHz: Verification of Dynamic Body Movement Effects Using Computer Simulation and Experiments Ladda ner fulltext (pdf) av Fat-IntraBody Communication at 5.8 GHz: Verification of Dynamic Body Movement Effects Using Computer Simulation and Experiments Improving Sensor Network Performance with Directional Antennas: A Cross-layer Optimization Schandy, Javier; Olofsson, Simon; Gammarano, Nicolas; Steinfeld, Leonardo et al. Ingår i ACM transactions on sensor networks, 2021 DOI för Improving Sensor Network Performance with Directional Antennas: A Cross-layer Optimization Assessment of Blood Vessel Effect on Fat-Intrabody Communication Using Numerical and Ex-Vivo Models at 2.45 GHZ Asan, Noor Badariah; Hassan, Emadeldeen; Perez, Mauricio David; Shah, Syaiful Redzwan Mohd et al. Ingår i IEEE Access, s. 89886-89900, 2019 DOI för Assessment of Blood Vessel Effect on Fat-Intrabody Communication Using Numerical and Ex-Vivo Models at 2.45 GHZ Ladda ner fulltext (pdf) av Assessment of Blood Vessel Effect on Fat-Intrabody Communication Using Numerical and Ex-Vivo Models at 2.45 GHZ EcoVibe: On-Demand Sensing for Railway Bridge Structural Health Monitoring Ye, Liu; Voigt, Thiemo; Wirström, Niklas; Höglund, Joel Ingår i IEEE Internet of Things Journal, s. 1068-1078, 2019 DOI för EcoVibe: On-Demand Sensing for Railway Bridge Structural Health Monitoring makeSense: Simplifying the Integration of Wireless Sensor Networks into Business Processes Mottola, Luca; Picco, Gian Pietro; Oppermann, Felix; Eriksson, Joakim et al. Ingår i IEEE Transactions on Software Engineering, s. 576-596, 2019 DOI för makeSense: Simplifying the Integration of Wireless Sensor Networks into Business Processes Characterization of the Fat Channel for Intra-Body Communication at R-Band Frequencies Asan, Noor Badariah; Hassan, Emadeldeen; Velander, Jacob; Redzwan, Syaiful et al. Ingår i Sensors, 2018 DOI för Characterization of the Fat Channel for Intra-Body Communication at R-Band Frequencies Ladda ner fulltext (pdf) av Characterization of the Fat Channel for Intra-Body Communication at R-Band Frequencies Velox VM: A safe execution environment for resource-constrained IoT applications Tsiftes, Nicolas; Voigt, Thiemo Ingår i Journal of Network and Computer Applications, s. 61-73, 2018 DOI för Velox VM: A safe execution environment for resource-constrained IoT applications SecureSense: End-to-End Secure Communication Architecture for the Cloud-connected Internet of Things Raza, Shahid; Helgason, Tomas; Papadimitratos, Panos; Voigt, Thiemo Ingår i Future Generation Computer Systems, s. 40-51, 2017 DOI för SecureSense: End-to-End Secure Communication Architecture for the Cloud-connected Internet of Things An Ontology-based Context-aware System for Smart Homes: E-care@ home Alirezaie, Marjan; Renoux, Jennifer; Köckemann, Uwe; Kristoffersson, Annica et al. Ingår i Sensors, 2017 Data Packet Transmission through Fat Tissue for Wireless Intra-Body Networks Asan, Noor Badariah; Carlos, Pérez Penichet; Redzwan, Syaiful; Noreland, Daniel et al. Ingår i IEEE Journal of Electromagnetics, RF and Microwaves in Medicine and Biology, s. 43-51, 2017 DOI för Data Packet Transmission through Fat Tissue for Wireless Intra-Body Networks Ladda ner fulltext (pdf) av Data Packet Transmission through Fat Tissue for Wireless Intra-Body Networks Intra-body microwave communication through adipose tissue Asan, Noor Badariah; Noreland, Daniel; Hassan, Emadeldeen; Redzwan, Syaiful et al. Ingår i Healthcare Technology Letters, s. 115-121, 2017 DOI för Intra-body microwave communication through adipose tissue Ladda ner fulltext (pdf) av Intra-body microwave communication through adipose tissue Building the Internet of Things with bluetooth smart Raza, Shahid; Misra, Prasant; He, Zhitao; Thiemo, Voigt Ingår i Ad hoc networks, s. 19-31, 2017 DOI för Building the Internet of Things with bluetooth smart Analysis and experimental evaluation of IEEE 802.15.4e TSCH CSMA-CA Algorithm De Guglielmo, Domenico; Al Nahas, Beshr; Duquennoy, Simon; Voigt, Thiemo et al. Ingår i IEEE Transactions on Vehicular Technology, s. 1573-1588, 2017 DOI för Analysis and experimental evaluation of IEEE 802.15.4e TSCH CSMA-CA Algorithm Fusion: Coalesced Confidential Storage and Communication Framework for the IoT Bagci, Ibrahim Ethem; Raza, Sh",
  "content_length": 71895,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:11"
}