{
  "name": "Thomas Kirste",
  "homepage": "http://cpr.uni-rostock.de/resolve/id/cpr_person_00001930",
  "status": "success",
  "content": "Kirste, Thomas - Catalogus Professorum Rostochiensium Kirste, Thomas direkt zum Inhalt Start Login Menü Start Personenindex Epochenzugang Suche Einfach Erweitert nach Fachgebiet nach Fakultät / Sektion Weitere Kataloge Rektoren Kanzler IHS / HfS Über das Projekt Mitwirkende Projektdokumentation Abkürzungen / Glossar Literatur Verwandte Projekte Aktuelles Start Personenindex Epochenzugang Suche Weitere Kataloge Über das Projekt Kirste, Thomas Prof. Dr.-Ing. seit 2004 Professor für Mobile Multimediale Informationssysteme Katalogeintrag Dokumente/Anhang Langeintrag Fakultät: seit 2004 Fakultät für Informatik und Elektrotechnik seit 2007 Interdisziplinäre Fakultät Institut: Institut für Informatik (IEF) Department Aging Science and Humanities (INF) Lehr- und Forschungsgebiete: Mobile Computing, Ubiquitous Computing, Intelligente Umgebungen, Assistenzsysteme, Aktivitätserkennung Fachgebiet: 54 Informatik E-Mail-Adresse: ed.kcotsor-inu(ta)etsrik.samoht Homepage: (Link öffnen ) weitere Vornamen: Rudolf Lebensdaten: geboren am 01.10.1962 in Mainz Konfession: evangelisch Kurzbiographie: 1983-1988 Informatikstudium, TU Darmstadt 1989-1994 wiss. Mitarbeiter am Zentrum für Graphische Datenverarbeitung, Darmstadt 1995-1996 wiss. Mitarbeiter am Department of Computer Graphics, TU Darmstadt 1996-2002 Leiter der Abteilung Mobile Multimedia Technologien am Fraunhofer-Institut für Graphische Datenverarbeitung (IGD), Rostock 2002-2004 Leiter der Abteilung Interactive Multimedia Appliances am Fraunhofer-Institut für Graphische Datenverarbeitung (IGD), Darmstadt 2002-2003 Vertretungsprofessor (C3) für Graphische Datenverarbeitung am Department of Computer Graphics, TU Darmstadt seit 2004 Professor für Mobile Multimediale Informationssysteme am Institut für Informatik, Univ. Rostock akademische Abschlüsse: Studium 1988 Dipl.-Informatiker, TU Darmstadt Promotion 1994 Dr.-Ing., TU Darmstadt Titel der Arbeit: INCH - ein Konzept für Interactive Computational Hypermedia auf der Basis einer funktionalen Objektinterpretation. akademische Selbstverwaltung: 2004-2007 Leiter Öffentlichkeitsarbeit (IEF) 2007-2011 Leiter des Departments Aging Science and Humanities (INF) seit 2011 Vorstandsmitglied des Departments Aging Science and Humanities (INF) Mitglied des Institutsrates Mitglied des Fakultätsrates (IEF) Funktionen: Sprecher des Graduiertenkollegs der Deutschen Forschungsgemeinschaft (DFG) \"MuSAMA\" Leiter / wiss. Koordinator in verschiedenen Konsortialprojekten seit 2013 Vorstandsmitglied der GI Fachgruppe Mobilität und Mobile Informationssysteme weitere Mitgliedschaften: Association for Computing Machinery (ACM) Gesellschaft für Informatik (GI) Werke (Auswahl): Kirste T, Hoffmeyer A, Koldrack P, Bauer A, Schubert S, Schröder S, Teipel S.: Detecting the effect of Alzheimer’s disease on everyday motion behavior. Journal of Alzheimer’s Disease, 38(1):121–132, 2014. Krüger F, Yordanova K, Hein A, Kirste T: Plan Synthesis for Probabilistic Activity Recognition. In Proceedings of the 5th International Conference on Agents and Artificial Intelligence (ICAART 2013), Barcelona, Spain, 2013. Krüger F, Yordanova K, Burghardt Ch, Kirste T: Towards creating assistive software by employing human behavior models. Journal of Ambient Intelligence and Smart Environments, 4(3):209-226, 2012. Plociennik C, Wandke H, Kirste T: What Influences User Acceptance of Ad-hoc Assistance Systems? -- A Quantitative Study. Mobile und Ubiquitäre Informationssysteme - Technologien, Anwendungen und Dienste zur Unterstützung von mobiler Kollaboration, pp. 57--70. Gesellschaft für Informatik, 2010. Heider T, Kirste T: Supporting goal-based interaction with dynamic intelligent environments. In Proc. 15th European Conference on Artificial Intelligence (ECAI’2002), Lyon, France, July 22–26 2002. Quellen: eigene Angaben (Stand: Dezember 2013) Internet-Ressourcen: GND: 137244754 [GND-Link auf diese Seite: https://cpr.uni-rostock.de/resolve/gnd/137244754] Einordnung: Epoche 1990-heute eingestellt / geändert: 03.12.2007, ccwahrmann / 17.11.2022, administrator Achtung: Die hier bereitgestellten Dokumente und Bilder sind überwiegend urheberrechtlich geschützt. Sollten Sie diese oder Teile davon nutzen wollen, wenden Sie sich bitte zur Klärung der Nutzungsbedingungen an: Universitätsarchiv Rostock, Universitätsplatz 1, 18055 Rostock, universitaetsarchiv@uni-rostock.de Anhang: Thomas Kirste (Foto, Privatbesitz) kirste_thomas_pic.jpg(33.5 KB) MD5 (als Portrait anzeigen) Dokument: Empfohlene Zitierweise: Eintrag von \"Thomas Kirste\" im Catalogus Professorum Rostochiensium, https://purl.uni-rostock.de/cpr/00001930 (abgerufen am 01.12.2025) Ihre Anmerkungen ... Druck XML SOLR Thomas Kirste (Foto, Privatbesitz) Kontakt Universitätsarchiv Rostock Universitätsplatz 1 18055 Rostock universitaetsarchiv(at)uni-rostock.de Service Impressum Datenschutzerklärung Barrierefreiheit MyCoRe Homepage GitHub © 2022 Universitätsarchiv Rostock",
  "content_length": 4938,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:44"
}