{
  "name": "Thomas Stützle",
  "homepage": "https://iridia.ulb.ac.be/~stuetzle",
  "status": "success",
  "content": "Home Page Thomas Stützle / Thomas Stuetzle Thomas Stützle's Home Page Thomas Stützle Université Libre de Bruxelles (ULB) IRIDIA, CP 194/6 Av. F. Roosevelt 50 B-1050 Brussels Belgium Phone: ++32 (0)2 650-3167 Fax: ++32 (0)2 650-2715 Email: stuetzle ulb.ac.be Office: C5.123 News My GECCO 2002 paper on A Racing Algorithm For Configuring Metaheuristic (co-authored by Mauro Birattari, Luis Paquete, and Klaus Varrentrap) has received the 2012 SIGEVO Impact Award. The irace software package for automatic algorithm configuration is available here. It implements various variants of racing algorithms for algorithm configuration. The ACOTSPQAP software is available; it implements various ACO algorithms for the TSP and the QAP and is an extension of the earlier ACOTSP software, which is available through the ACO-Software page. The EAF Graphical Tools software is available; it plots summary attainment surfaces and differences between the first-order empirical attainment functions of bi-objective optimizers. General Info I'm a Research Director with the Belgian F.R.S.-FNRS, working at the IRIDIA lab. I received my \"Habilitation\" for computer science (2004) and my PhD (1998) from the Computer Science Department of Darmstadt University of Technology, Darmstadt, Germany. I received my Master's degree (german Diplom) in Business Engineering (Wirtschaftsingenieurwesen) in 1994 from the School of Economics and Business Engineering of the University of Karlsruhe, Germany. For more details, please see my CV (April 2017). Publications Ant Colony Optimization MIT Press, 2004 Stochastic Local Search-Foundations and Applications Morgan Kaufman, 2004 Many of my papers are also listed in DB/LP; you may also check my google scholar profile for a list of my publications according to number of citations. Publications are also available from my publication page (though not updated very frequently). Activities I'm associate editor of Applied Mathematics and Computation, Computational Intelligence, Evolutionary Computation, and Swarm Intelligence and member of the editorial board of the journals European Journal of Industrial Engineering, Journal of Artificial Intelligence Research, Operations Research Perspectives, Soft Computing, and International Journal of Applied Metaheuristic Computing. Together with Holger Hoos I have created SATLIB, an online collection of benchmark instances and solvers for propositional satisfiability problems. Teaching The second semester of the academic year 2017/18 I'm teaching Heuristic Optimization, 5 ECTS The course introduces heuristic techniques for the effective solution of hard decision and optimization problems. A main focus of the course is on stochastic local search methods. Links of Interest Operations Research, Ants et. al. INFORMS OR/MS Resource Collection ANT COLONY OPTIMIZATION The Genetic Algorithms Archive Global Optimization Memetic Algorithms' Home Page Opt-Net Home page Constraint Satisfaction, Satisfiability SATLIB SAT Live! Problems, Benchmarks SATLIB CSPLIB OR-LIBRARY TSP-LIB Home Page Traveling Salesman Problem. 8th DIMACS Implementation Challenge: TSP QAPLIB Home Page __________________________________________ Thomas Stützle Université Libre de Bruxelles IRIDIA, CP 194/6 50 Av. F. Roosevelt 1050 Brussels, Belgium ts, last update May 25, 2018.",
  "content_length": 3323,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:03"
}