{
  "name": "Thomas Hurtut",
  "homepage": "http://www.professeurs.polymtl.ca/thomas.hurtut",
  "status": "success",
  "content": "Thomas Hurtut Contact • Short Bio • People • Dataviz • Publications • Projects • Teaching • Duties Thomas Hurtut Full Professor at Computer Science Dpt. of Polytechnique Montréal 2900, boul. Édouard-Montpetit, Montréal (Québec), H3T 1J4, Canada +1 (514) 340-4711 #7109 - Office M-3113 - thomas.hurtut [at] polymtl.ca Affiliations: jData laboratory, IVADO, RÉPARTI Co-founder of Kashika Studio Interested in attending \"INF8808/INF8808E - Data Visualization\" in Winter or Summer 2026 ? Check course website for more details. Short Bio My R&D interests mostly lie in data visualization and information design. The quantity and complexity of data produced in our lives and all types of industrial activities are phenomenal. Presenting, understanding, analyzing, decision making are some of the of goals one can seek to achieve with data. A visualization can be a powerful user-centred tool in that perspective, for a lot of data-based applications and contexts. However, if a visualization is poorly designed, the user can misinterpret the data and be misled in his conclusions, hence decisions. Among the applications my students and I tackle are: help creative people to create more and new things with new tools, design visualizations of any kind of data (geolocalized, textual, budget data, etc.), image content manipulation, stylization and production (transferring colors, stylize maps, synthesize textures etc.). In other words, all kinds of algorithms and methodology to design/create/modify/analyze/render/simulate some images. @Polytechnique, I conduct research projects and teaching in those domains. @Kashika studio, I design interactive data visualizations. I presently collaborate, or have collaborated recently, with the following companies or institutions: OCDE, Engie, Institut Énergie Trottier, Le Devoir, Radio-Canada, Canadiens de Montréal (CH), Ministère de la Culture Québec, TMX, Synapse C, Chaire de recherche en fiscalité et finances publiques, Cinémathèque, BAnQ, Bombardier, Inria, IGN. If you like visual things and coding + seek to do an internship, M.Sc., Ph.D. please contact me ! I am presently a professor at Polytechnique Montréal in the Computer Science department. From 2009 to mid-2014, I was a tenured assistant professor (maître de conférences) at Paris Descartes University in the Mathematics and Computer Science department. From november 2008 until july 2009, I was a post-doc at INRIA in the MAVERICK team with Joëlle Thollot. I have obtained my Ph.D. at the TélécomParisTech school and Polytechnique Montréal under the guidance of the late Francis Schmitt, Yann Gousseau and Farida Cheriet. Recently, I obtained a diploma of higher specialized studies in journalism from Université de Montréal. A long time ago, I got my Bachelor of Engineering from the CentraleSupélec school in France. People I have the pleasure of working with the following students: Maki Furue from Ochanomizu University, Japan Satomi Hasegawa from Ochanomizu University, Japan Lilou Lagrede Drai @Polymtl with Le Devoir Anabelle Montaudon Domenech from X, France Yunfan Shang @Polymtl Former students (reverse chronological order): Justin Caisse Hasti Ghader-Azad Qiang Xu Théo Lecardonnel Samuel Ouvrard Sullivan Collomb Louri Compain Morteza Asgari Jean-Romain Roy Antoine Noreau Jérémie Tousignant Philippe Bourbeau-Allard Javad Yaali François Lévesque Gautier Dervaux Marina Menghetti Jorge Gutierrez Konstantinos Lambrou-Latreille Jean-Philippe Corbeil Sandrine Viera (IVADO data journalism scholarship) Olivia Gélinas (IVADO data journalism scholarship) Justine Pépin (IVADO data journalism scholarship) Antoine Béland (NSERC fellowship) Alexandre Bléron Antoine Moevus Alexandre Chenieux Hossein Moussavi Maxime Schmitt Argyrios Christodoulidis Adrien Dessinges Benoît Arbelot (thesis manuscript) Robin Paquet Aude Nazaire Clément Guiol Quentin Fardet Thomas Jan Mahamad (thesis manuscript) Florent Derville Olivier Pinon Hugo Loi (thesis manuscript) Thomas Richaudeau Maya Alsheh-Ali (thesis manuscript) Mickaël Garnier (thesis manuscript) Cosmin Ludusan Pierre-Edouard Landes Legend: undergrad/internship master ph.d. master+phd postdoc or research assistant Data visualizations On the data visualization side of my research topics, my students and I regularly collaborate with Quebec media and institutions to produce some interactive visualizations on various news subjects. https://www.oecd-nea.org/jcms/pl_108128/nea-launches-interactive-smr-dashboard NEA SMR Dashboard with François Lévesque (Kashika Studio), Niji and NEA, 2025 Explorateur de trajectoires with François Lévesque (Kashika Studio), IET and ESMIA, 2024 ChatGPT peut-il résoudre vos problèmes de santé? with Jean-Romain Roy Le Devoir, 2023 Un an de guerre en Ukraine : une chronologie en cartes with Jean-Romain Roy Le Devoir, 2023 Musical data visualization based on open and linked data. with François Lévesque, Michel Gagnon, Dominique Piché, Marielle St Germain, and Jean-François Gauvin BAnQ, 2021 This work received the prize for Open Data Innovation at Canadian Open Data Awards in 2021 Comment évoluent les prélèvements fiscaux, les prestations et les dépenses publiques pour une contribuable au cours de sa vie? with François Lévesque Chaire en fiscalité et en finances publiques, 2020 Radio-Canada, La Presse and Le Devoir talked about it. Exploration des données de la Cinémathèque Québecoise with Konstantinos Lambrou-Latreille Cinémathèque Québecoise, 2020 25 ans d'accès restreint à l'eau potable au Canada with Sandrine Viera and Olivia Gélinas Le Devoir, 2019 Que vous promettent les partis ? with Sandrine Viera and Olivia Gélinas Le Devoir, 2019 Décortiquer le comportement électoral des jeunes canadiens with Sandrine Viera and Justine Pépin Le Devoir, 2019 Plus d'élèves, moins de profs. Survol d'une pénurie with Sandrine Viera and Justine Pépin Le Devoir, 2019 Portrait des pannes de métro with Jean-Philippe Corbeil Le Devoir, 2019 Le discours sur l'état de l'Union 2019 en chiffres et analyses with Jean-Philippe Corbeil Le Devoir, 2019 Après les élections de mi-mandat, une Union divisée with Jean-Philippe Corbeil Le Devoir, 2018 L'assemblée nationale montre un nouveau visage with Jean-Philippe Corbeil Le Devoir, 2018 Quel a été l'effet de l'abstention sur les élections ? with Jean-Philippe Corbeil Le Devoir, 2018 Du chômage à la langue: le vote des Québécois à travers 10 indicateurs with Jean-Philippe Corbeil Le Devoir, 2018 Comment décortiquer la victoire de la CAQ with Jean-Philippe Corbeil Le Devoir, 2018 Le débat électoral en chiffres with Jean-Philippe Corbeil Le Devoir, 2018 Les promesses des partis sont-elles financièrement réalisables? with Antoine Béland Le Devoir, 2018 Perdez-vous plus de temps que les autres dans vos déplacements? with Antoine Béland Le Devoir, 2018 La carte de tous les ouragans et typhons depuis 1851 with Antoine Béland Le Devoir, 2017 Les pluies de l'ouragan «Irma» en une carte with Antoine Béland Le Devoir, 2017 Quels sont les risques d'un voyage sur Mars with Antoine Béland Le Devoir, 2017 La face cachée de l'automobile with Robin Paquet Le Devoir, 2016 La Cour suprême des États-Unis réaffirme le droit à l'avortement with Aude Nazaire Le Devoir, 2016 Les candidats à la chefferie du PQ sont-ils plus jeunes qu'avant? with Aude Nazaire Le Devoir, 2016 La petite histoire des démissions à l'Assemblée nationale with Aude Nazaire Le Devoir, 2016 Des toponymes à longue portée with Aude Nazaire Le Devoir, 2016 Pour qui ont voté vos voisins à l'élection fédérale de 2015? with Olivier Pinon and Thomas Richaudeau (see also this post from Florent Daudens) Radio-Canada, 2015 Combien a dépensé votre député? with Thomas Richaudeau Radio-Canada, 2015 À quoi ressemble votre nouvelle circonscription ? with Olivier Pinon (see also this post from Florent Daudens) Radio-Canada, 2015 L'histoire des partis politique with Olivier Pinon Radio-Canada, 2015 Aurons-nous un Noël blanc? On a fouillé jusqu'en 1955 with Olivier Pinon Radio-Canada, 2015 Scientific publications Territories in Crisis: Is Urban Resilience to Industrial Crises Possible? An Analysis of the Evolution of Land Use in Fukushima since 2011 Cécile Asanuma-Brice, Thomas Hurtut IntechOpen, Asian Studies - Current Issues and Resolutions, 2025 How Journalists Make Maps Lilou Lagrede-Drai, Christophe Hurter, Thomas Hurtut IEEE VIS (Poster), 2025 Enhancing Student Engagement through Learning Analytics: A User-Centered Dashboard for LMS Platforms Hasti Ghader Azad, Amel Guedid, Bruno Poelluber, Thomas Hurtut ECEL (European Conference on e-Learning), 2025 GenQA : A Method for Generating and Validating Question/Answer Pairs from Journalistic Data Material Théo Le Cardonnel, Christophe Hurter, Thomas Hurtut IEEE PacificVis, 2025 Pathways Explorer: Interactive Visualization of Climate Transition Scenarios Francois Levesque, Louis Baumier, Thomas Hurtut IEEE VIS, EnergyVis Workshop, 2024 From Graphs to Words: A Computer-Assisted Framework for the Production of Accessible Text Descriptions Qiang Xu, Thomas Hurtut IEEE VIS Short Paper, 2024 CuratedDDS: A Taxonomy and a Dataset of Data-Driven Stories to Support Journalists' Inspiration Louri Glen Kae Compain, Thomas Hurtut Computation + Journalism Symposium, 2024 A Design Language for Prototyping and Storyboarding Data-Driven Stories Morteza Asgari, Thomas Hurtut Applied Sciences, 2024 Territoires en crise : une résilience urbaine aux crises industrielles est-elle possible ? Analyse et bilan de l'évolution de l'occupation des sols à Fukushima (2011-2023) Cécile Asanuma-Brice, Thomas Hurtut Territoire en mouvement Revue de géographie et aménagement, 2024 Audio Describing Tables and Charts: A Re-visualization Process for Sharing Complex Data Sets with People Who are Blind or Who Have Low-Vision Brett Oppegaard, Qiang Xu, Thomas Hurtut STC Intercom, 2023 Waffster: Hierarchical Waffle Charts for Budget Visualization Antoine Béland, Florent Daudens, Thomas Hurtut Information Visualization journal, 2023 Un ",
  "content_length": 24328,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:35"
}