{
  "name": "Thomas Gilray",
  "homepage": "https://thomas.gilray.org",
  "status": "success",
  "content": "Thomas Gilray's Research (what?) X Office: EME B49 (map) thomas.gilrawsu.edu @tomgilray Thomas Gilray Computer Scientist Associate Professor at Washington State University My research focuses on the design and implementation of scalable systems for reasoning about code. I work on foundations of tunable, correct-by-design program analysis and on declarative logic-programming languages that help to bridge the gap between specifying such reasoning systems and implementing them in a scalable parallel manner. Recently, my work has focused on improving the expressivity of Datalog and on how to accelerate such languages on supercomputers and using GPUs. More broadly, I am very interested in compilers, verification, optimization, and programming language design and implementation. Please reach out if you want to chat! I am looking to hire a PhD student and a Postdoc. News I have moved to Washington State University in Pullman, WA, starting Fall 2024. I am hiring! The HARP lab, with key collaborators at WSU, OSU, and UT, has won a PPoSS (Principles and Practice of Scalable Systems) Large award from the NSF, to develop Slog and related techniques into a full-stack approach to modern declarative programming. This ~$5M award will provide reliable support to roughly ten PhD students and seven faculty for its five year duration. Read more ↠ The HARP lab has won a PPoSS (Principles and Practice of Scalable Systems) planning-grant award from the NSF, to develop a Large proposal on scaling Datalog-based compute platforms like Slog. See our preprint on the Slog language for more details. The HARP lab has won an award, through subcontract with Galois, inc., to work on the DARPA V-SPELLS program: Verified Security and Performance Enhancement of Large Legacy Software. We will be exploring the use of AI-based programming languages for reasoning about code at scale—in the cloud and on supercomputers. Read more ↠ (view cv .pdf) Selected Publications (view all publications) All Publications (view selected publications) Copyright (c) Thomas Gilray, 2025, Some Rights Reserved.",
  "content_length": 2086,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:31"
}