{
  "name": "Thomas Lukasiewicz",
  "homepage": "https://informatics.tuwien.ac.at/people/thomas-lukasiewicz",
  "status": "success",
  "content": "Thomas Lukasiewicz — TU Wien Informatics People Overview Professors Scientific Staff Administrative Staff Student Staff External Lecturers By Responsibilities By Committee By Name Related Guest Professors Honoraries Alumni (LinkedIn) #5qw Thomas Lukasiewicz Univ.Prof. Dipl.-Inf. Dr.rer.nat. Research Focus Information Systems Engineering: 100% Research Areas Artificial Intelligence, Machine Learning, Computer Vision, Natural Language Processing About Our research aims at enabling machines to mimic human-like intelligence, via models and algorithms to process vast amounts of data, recognize patterns, and make decisions, using techniques from machine and deep learning as well as symbolic reasoning.In our research activities, we cover all modalities, including natural language processing and computer vision. We focus especially on (i) explainable AI, (ii) deep learning with logical constraints for safe AI , (iii) hybrid model-based approaches to explainable, fair, and robust AI, (iv) general AI via predictive coding and active inference, and (v) intelligent applications, such as in healthcare and law. Roles Head of Research Unit Artificial Intelligence Techniques, E192-07 Full Professor Artificial Intelligence Techniques, E192-07 Affiliated Knowledge-Based Systems, E192-03 Contact thomas.lukasiewicz@tuwien.ac.at vCard from TISS informatics.tuwien.ac.at/people/thomas-lukasiewicz tiss.tuwien.ac.at/person/41293 Courses 2025W Bachelor Thesis for Computer Science and Business Informatics / 192.143 / PR Deep Learning for Natural Language Processing / 192.039 / VU Introduction to Deep Learning / 192.151 / VU Project in Computer Science 1 / 192.021 / PR Project in Computer Science 2 / 192.022 / PR Scientific Research and Writing / 193.052 / SE Seminar for Master Students in Logic and Artificial Intelligence / 180.773 / SE Seminar for PhD Students / 192.031 / SE 2026S Bachelor Thesis for Computer Science and Business Informatics / 192.143 / PR Introduction to Deep Learning / 192.151 / VU Project in Computer Science 1 / 192.021 / PR Project in Computer Science 2 / 192.022 / PR Seminar for PhD Students / 192.031 / SE Seminar in Artificial Intelligence (Neuroscience-based Artificial Intelligence) / 192.047 / SE Seminar in Knowledge Representation and Reasoning : Neurosymbolic Artificial Intelligence / 192.048 / SE Projects Explainable Artificial Intelligence in Healthcare 2023 – 2027 / AXA Game-Theoretic Agent Programming 2005 – 2008 / Austrian Science Fund (FWF) Publications 2025 Aggregated Mutual Learning between CNN and Transformer for semi-supervised medical image segmentation / Xu, Z., Wang, H., Yang, R., Yang, Y., Liu, W., & Lukasiewicz, T. (2025). Aggregated Mutual Learning between CNN and Transformer for semi-supervised medical image segmentation. Knowledge-Based Systems, 311, Article 113005. https://doi.org/10.1016/j.knosys.2025.113005 Hybrid Reinforced Medical Report Generation With M-Linear Attention and Repetition Penalty / Xu, Z., Xu, W., Wang, R., Chen, J., Qi, C., & Lukasiewicz, T. (2025). Hybrid Reinforced Medical Report Generation With M-Linear Attention and Repetition Penalty. IEEE Transactions on Neural Networks and Learning Systems, 36(2), 2206–2220. https://doi.org/10.1109/TNNLS.2023.3343391 Self-Supervised Medical Image Segmentation Using Deep Reinforced Adaptive Masking / Xu, Z., Liu, Y., Xu, G., & Lukasiewicz, T. (2025). Self-Supervised Medical Image Segmentation Using Deep Reinforced Adaptive Masking. IEEE Transactions on Medical Imaging, 44(1), 180–193. https://doi.org/10.1109/TMI.2024.3436608 2024 Fool Me Once? Contrasting Textual and Visual Explanations in a Clinical Decision-Support Setting / Kayser, M., Menzat, B. I., Emde, C., Bercean, B., Novak, A., Espinosa, A., Papiez, B. W., Gaube, S., Lukasiewicz, T., & Camburu, O.-M. (2024). Fool Me Once? Contrasting Textual and Visual Explanations in a Clinical Decision-Support Setting. In Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing (pp. 18891–18919). Association for Computational Linguistics. https://doi.org/10.18653/v1/2024.emnlp-main.1051 CCN⁺: A Neuro-symbolic Framework for Deep Learning with Requirements / Giunchiglia, E., Tatomir, A., Stoian, M. C., & Lukasiewicz, T. (2024). CCN+: A Neuro-symbolic Framework for Deep Learning with Requirements  . International Journal of Approximate Reasoning, 171, Article 109124. https://doi.org/10.1016/j.ijar.2024.109124 Correcting Flaws in Common Disentanglement Metrics / Mahon, L., Sha, L., & Lukasiewicz, T. (2024). Correcting Flaws in Common Disentanglement Metrics. Transactions on Machine Learning Research, 2024. Evaluating Language Models for Mathematics through Interactions / Collins, K. M., Jiang, A. Q., Frieder, S., Wong, L., Zilka, M., Bhatt, U., Lukasiewicz, T., Wu, Y., Tenenbaum, J. B., Hart, W., Gowers, T., Li, W., Weller, A., & Jamnik, M. (2024). Evaluating Language Models for Mathematics through Interactions. Proceedings of the National Academy of Sciences of the United States of America, 121(24), Article e2318124121. https://doi.org/10.1073/pnas.2318124121 Pre-training and diagnosing knowledge base completion models / Kocijan, V., Jang, M., & Lukasiewicz, T. (2024). Pre-training and diagnosing knowledge base completion models. Artificial Intelligence, 329, Article 104081. https://doi.org/10.1016/j.artint.2024.104081 Hard Regularization to Prevent Deep Online Clustering Collapse without Data Augmentation / Mahon, L., & Lukasiewicz, T. (2024). Hard Regularization to Prevent Deep Online Clustering Collapse without Data Augmentation. In Proceedings of the 38th AAAI Conference on Artificial Intelligence : AAAI-24 Technical Tracks 13 (pp. 14281–14288). AAAI Press. https://doi.org/10.1609/aaai.v38i13.29340 Automatic data augmentation for medical image segmentation using Adaptive Sequence-length based Deep Reinforcement Learning / Xu, Z., Wang, S., Xu, G., Liu, Y., Yu, M., Zhang, H., Lukasiewicz, T., & Gu, J. (2024). Automatic data augmentation for medical image segmentation using Adaptive Sequence-length based Deep Reinforcement Learning. Computers in Biology and Medicine, 169, Article 107877. https://doi.org/10.1016/J.COMPBIOMED.2023.107877 The IMO Small Challenge: Not-Too-Hard Olympiad Math Datasets for LLMs / Frieder, S., Olšák, M., Berner, J., & Lukasiewicz, T. (2024). The IMO Small Challenge: Not-Too-Hard Olympiad Math Datasets for LLMs. In The Second Tiny Papers Track at ICLR 2024. The Twelfth International Conference on Learning Representations (ICLR 2024), Wien, Austria. http://hdl.handle.net/20.500.12708/210292 Multi-ConDoS: Multimodal Contrastive Domain Sharing Generative Adversarial Networks for Self-Supervised Medical Image Segmentation / Zhang, J., Zhang, S., Shen, X., Lukasiewicz, T., & Xu, Z. (2024). Multi-ConDoS: Multimodal Contrastive Domain Sharing Generative Adversarial Networks for Self-Supervised Medical Image Segmentation. IEEE Transactions on Medical Imaging, 43(1), 76–95. https://doi.org/10.1109/TMI.2023.3290356 How Realistic Is Your Synthetic Data? Constraining Deep Generative Models for Tabular Data / Stoian, M. C., Dyrmishi, S., Cordy, M., Lukasiewicz, T., & Giunchiglia, E. (2024). How Realistic Is Your Synthetic Data? Constraining Deep Generative Models for Tabular Data. In The Twelfth International Conference on Learning Representations. 12th International Conference on Learning Representations (ICLR 2024), Wien, Austria. http://hdl.handle.net/20.500.12708/210296 A Stable, Fast, and Fully Automatic Learning Algorithm for Predictive Coding Networks / Tommaso Salvatori, Song, Y., Yordanov, Y., Millidge, B., Sha, L., Emde, C., Xu, Z., Bogacz, R., & Thomas Lukasiewicz. (2024). A Stable, Fast, and Fully Automatic Learning Algorithm for Predictive Coding Networks. In The Twelfth International Conference on Learning Representations (p. 25). http://hdl.handle.net/20.500.12708/211106 Predictive Coding beyond Correlations / Salvatori, T., Pinchetti, L., M’Charrak, A., Millidge, B., & Lukasiewicz, T. (2024). Predictive Coding beyond Correlations. In Forty-first International Conference on Machine Learning. Forty-first International Conference on Machine Learning, ICML 2024, Wien, Austria. http://hdl.handle.net/20.500.12708/210295 Inferring neural activity before plasticity as a foundation for learning beyond backpropagation / Song, Y., Millidge, B., Salvatori, T., Lukasiewicz, T., Xu, Z., & Bogacz, R. (2024). Inferring neural activity before plasticity as a foundation for learning beyond backpropagation. Nature Neuroscience. https://doi.org/10.1038/s41593-023-01514-1 Download: Article (6.58 MB) PiShield: A NeSy Framework for Learning with Requirements / Stoian, M. C., Tatomir, A., Lukasiewicz, T., & Giunchiglia, E. (2024). PiShield: A NeSy Framework for Learning with Requirements. In K. Larson (Ed.), IJCAI ’24: Proceedings of the Thirty-Third International Joint Conference on Artificial Intelligence (pp. 8805–8809). Association for Computing Machinery. https://doi.org/10.24963/ijcai.2024/1037 Minimum description length clustering to measure meaningful image complexity / Mahon, L., & Lukasiewicz, T. (2024). Minimum description length clustering to measure meaningful image complexity. Pattern Recognition, 145, Article 109889. https://doi.org/10.1016/j.patcog.2023.109889 Download: Article (3.29 MB) Bad Predictive Coding Activation Functions / Frieder, S., Pinchetti, L., & Lukasiewicz, T. (2024). Bad Predictive Coding Activation Functions. In The Second Tiny Papers Track at ICLR 2024. The Twelfth International Conference on Learning Representations (ICLR 2024), Wien, Austria. http://hdl.handle.net/20.500.12708/210293 PhaCIA-TCNs: Short-Term Load Forecasting Using Temporal Convolutional Networks With Parallel Hybrid Activated Convolution and Input Attention / Xu, Z., Yu, Z., Zhang, H., Chen, J., Gu, J., Lukasiewicz, T., & Leung, V. C. M. (2024). PhaCIA-TCNs: Short-Term Load Forecasting Using Temporal Convolutional Networks With Parallel Hybrid Activat",
  "content_length": 70004,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:43"
}