{
  "name": "Thomas Engel 0001",
  "homepage": "http://wwwen.uni.lu/snt/people/thomas_engel",
  "status": "success",
  "content": "Thomas ENGEL - FSTM - University of Luxembourg I Uni.lu Full professor Contact thomas.engel@uni.lu (+352) 46 66 44 5263 Details Profile Profile CV Functions Full professor In detail Faculty of Science, Technology and Medicine Department of Computer Science Computer Networks | Network and System Security | PKI | Peer-to-Peer | Wireless and Ad hoc Networks | Computer Networks and Telecommunications Maison du Nombre6, avenue de la FonteL-4364 ESCH MNO, E04 0445080 thomas.engel@uni.lu (+352) 46 66 44 5263 Publications on ORBilu Prof. Dr. Thomas Engel is Professor for Computer Networks and Telecommunications at the University of Luxembourg. Between 1996 and 2003, as joint founder, he was a member of the board of directors and vice-director of the Fraunhofer-guided Institute for Telematics e.V. in Trier, Germany, co-responsible for the scientific orientation and development of the institute, definition, acquisition and realization of all research projects, which were 70% industry-financed. Since 2002, he has taught and conducted research as a professor at the IST/University of Luxembourg. His SECAN-Lab team deals with performance, privacy and identity handling in Next Generation Networks. As a member of the European Security Research Advisory Board (ESRAB) of the European Commission in Brussels, he advised the Commission on the structure, content and implementation of the FP7 Security Research Programme. He was coordinator of three European projects, including the Integrated Project u-2010 with 16 partners, about Next Generation Networks using IPv6. Prof. Dr. Thomas Engel was member of the Information and Communication Security Panel ICS of NATO (2007-2011), and has been appointed Civil High-Level Expert for Electronic Communications (representing Europe) of NATO CEP/CCPC since 2008. He is speaker of the regional group Trier/Luxemburg of the German Society for Computer Science (GI). Since 2009 he is chairman of the National IPv6 Council Luxembourg. From 2009 to 2016 Thomas Engel was Vice- and Deputy-Director of the first Interdisciplinary Center at the University of Luxembourg, named Security, Reliability and Trust (SnT). Further information From 1987 to 1995 he studied Physics and Computer Science at the University of Saarbruecken, Germany, where he graduated in 1992 and received the title Dr. rer. nat. in 1996. Stay connected and subscribe to our newsletter All fields are mandatory Choose among our mailing list(s) Mailing list 0 items selected University of Luxembourg – News and events FSTM – News and events Enter your email address Example: contact@uni.lu Please provide a valid email address. Example: jean.dupont@gmail.com I agree to the use of my email address in the context of subscribing to the University of Luxembourg’s newsletters. I am aware that I can unsubscribe or update my profile by clicking the unsubscribe or update profile link in the email communication. More information about data processing. Subscribe now To the top",
  "content_length": 2982,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:32"
}