{
  "name": "Thomas Brox",
  "homepage": "https://lmb.informatik.uni-freiburg.de/people/brox/index.en.html",
  "status": "success",
  "content": "Homepage of Thomas Brox Home Team Social Events Research Publications Teaching Software/Datasets Job Offers Contact Internal Pattern Recognition and Image Processing Dept. of Computer Science Faculty of Engineering Thomas Brox Professor for Pattern Recognition and Image Processing Head of the Computer Vision Group Department of Computer Science University of Freiburg Germany Office location: Georges-Köhler-Allee, Building 052, room 01-29/30 79110 Freiburg Contact and consultation: make an appointment Personal Contact Publications Curriculum Vitae Research Interests Thomas Brox is interested in computer vision and deep learning with focus on visual representation learning and video analysis. In particular, he explores ways to train deep networks without manual supervision, which is today the bottleneck for most application domains. He is also investigating the underlying mechanisms how deep networks learn particular capabilities. He is further interested in exploring learned representations for action-perception cycles in robotics. Google Scholar Profile Brief Bio Thomas Brox received his Ph.D. in computer science from Saarland University, Germany in 2005. He was a postdoc at the University of Bonn, the University of Dresden and the University of California at Berkeley. In 2010, he moved to the University of Freiburg, where he is heading the Computer Vision Group. Prof. Brox was program chair of ECCV 2020 and area chair for the major computer vision conferences. He received the Longuet-Higgins Best Paper Award in 2004 and the Koenderink Prize for Fundamental Contributions in Computer Vision in 2014 for his work on optical flow estimation. He authored seminal works in deep learning, such as U-Net and FlowNet. He is an ELLIS fellow and a member of the Heidelberg Academy of Sciences. Webmaster  Disclaimer | Datenschutz © Copyright 2011 – 2025, LMB, University of Freiburg",
  "content_length": 1899,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:19"
}