{
  "name": "Thomas Emrys Williams",
  "homepage": "http://inside.mines.edu/~twilliams",
  "status": "success",
  "content": "Tom Williams | Colorado School of Mines Tom Williams Associate ProfessorDepartment of Computer ScienceDirector, MIRRORLab Bio Tom Williams is an Associate Professor of Computer Science at the Colorado School of Mines, where he directs the Mines Interactive Robotics Research Lab. Prior to joining Mines, Tom earned a joint PhD in Computer Science and Cognitive Science from Tufts University in 2017. Tom’s research focuses on enabling and understanding natural language based human-robot interaction that is sensitive to environmental, cognitive, social, and moral context. His work is funded by grants from NSF, ONR, and ARL, as well as by Early Career awards from NSF, NASA, and AFOSR. Education BA in Computer Science, Hamilton College, 2011 MS in Computer Science, Tufts University, 2013 PhD in Computer Science: Cognitive Science, Tufts University, 2017 Teaching Human-Robot Interaction (F19,F20,F21) Robot Ethics (S19, S20,S21,S22) Linguistic Human-Robot Interaction (S18) Computer Vision (F17, F18, F19,F20) De-Coding the Human Race (S22) Research Areas Human-Robot Interaction Natural Language Understanding and Generation Artificial Intelligence Cognitive Science Robot Ethics Augmented Reality Selected Publications Below are some select publications circa 2020. For a more up to date list, visit mirrorlab.mines.edu or click Publications above. Williams, T., Zhu, Q., Wen, R., & de Visser, E. (2020). The Confucian Matador: Three Defenses Against the Mechanical Bull. In Proceedings of the 15th ACM/IEEE International Conference on Human-Robot Interaction (HRI). ACM. [alt.HRI track] Jackson, R.B., Williams, T., & Smith, N.  (2020). Exploring the Role of Gender in Perceptions of Robotic Noncompliance. In Proceedings of the 15th ACM/IEEE International Conference on Human-Robot Interaction (HRI). ACM. Jackson, R. B., & Williams, T. (2019). Language-capable robots may inadvertently weaken human moral norms. In Proceedings of the 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI) (pp. 401-410). IEEE. [alt.HRI track] Williams, T., & Scheutz, M. (2019). Reference in robotics: A givenness hierarchy theoretic approach. The Oxford handbook of reference. Scheutz, M., Williams, T., Krause, E., Oosterveld, B., Sarathy, V., & Frasca, T. (2019). An overview of the distributed integrated cognition affect and reflection DIARC architecture. In Cognitive Architectures (pp. 165-193). Springer, Cham. Williams, T., Tran, N., Rands, J., & Dantam, N. T. (2018). Augmented, mixed, and virtual reality enabling of robot deixis. In International Conference on Virtual, Augmented and Mixed Reality (pp. 257-275). Springer, Cham. Williams, T., Thames, D., Novakoff, J., & Scheutz, M. (2018). ” Thank You for Sharing that Interesting Fact!” Effects of Capability and Context on Indirect Speech Act Use in Task-Based Human-Robot Dialogue. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (pp. 298-306). Best Paper Nominee Williams, T., & Scheutz, M. (2017). The state-of-the-art in autonomous wheelchairs controlled through natural language: A survey. Robotics and Autonomous Systems, 96, 171-183. Williams, T., Briggs, G., Oosterveld, B., & Scheutz, M. (2015). Going beyond literal command-based instructions: Extending robotic natural language interaction capabilities. In Twenty-Ninth AAAI Conference on Artificial Intelligence. Contact1600 Illinois StreetBrown Building 280-JColorado School of MinesGolden, CO 80401T: 303-273-3820M: twilliams@mines.edu@williamstome@MIRRORLab Tweets by @MIRRORLab",
  "content_length": 3558,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:29"
}