{
  "name": "Thomas Jansen 0001",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/thj10",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityDr Thomas Jansen Reader Head of Department (Computer Science) Department of Computer Science Contact Details Email: thj10@aber.ac.uk ORCID: 0000-0002-1596-086X Office: B47, Llandinam Building Phone: +44 (0) 1970 622445 Personal Website: http://users.aber.ac.uk/thj10 Twitter: jansen_th Google Scholar: https://scholar.google.co.uk/citations?user=eXdrAtQAAAAJ Research Portal Profile Teaching Module Coordinator CS10720 - Problems and Solutions CS31920 - Advanced Algorithms CSM1920 - Advanced Algorithms Moderator SEM5640 - Developing Advanced Internet-based Applications CSM6420 - Machine Learning for Intelligent Systems CS39930 - Web-Based Major Project CS12020 - Introduction to Programming Coordinator CSM1920 - Advanced Algorithms CS31920 - Advanced Algorithms CS10720 - Problems and Solutions Lecturer CS39440 - Major Project CS18120 - Study Skills for Computer Science CS10220 - Introduction to Computer Infrastructure CC18120 - Sgiliau Astudio ar gyfer Cyfrifiadureg Research Groups Advanced Reasoning Group Athena SWAN Publications Jansen, T & Zarges, C 2024, Experimental and Theoretical Analysis of Local Search Optimising OBDD Variable Orderings. in T Stützle & M Wagner (eds), Evolutionary Computation in Combinatorial Optimization: 24th European Conference, EvoCOP 2024; Held as Part of EvoStar 2024; Aberystwyth, UK, April 3–5, 2024, Proceedings. vol. 14632, Lecture Notes in Computer Science, vol. 14632, Springer Nature, GEWERBESTRASSE 11, CHAM, CH-6330, SWITZERLAND, pp. 177-192, 24th European Conference on Evolutionary Computation in Combinatorial Optimization, EvoCOP 2024, held as part of EvoStar 2024, Aberystwyth, United Kingdom of Great Britain and Northern Ireland, 03 Apr 2024. 10.1007/978-3-031-57712-3_12Jansen, T, Jensen, R, MacParthaláin, N & Lin, C-M (eds) 2021, Advances in Computational Intelligence Systems: Contributions Presented at the 20th UK Workshop on Computational Intelligence, September 8-10, 2021, Aberystwyth, Wales, UK. Advances in Intelligent Systems and Computing, vol. 1409, Springer Nature. 10.1007/978-3-030-87094-2Jansen, T 2019, Analysing Stochastic Search Heuristics Operating on a Fixed Budget. in B Doerr & F Neumann (eds), Theory of Evolutionary Computation. Natural Computing Series, Springer Nature, pp. 249-270. 10.1007/978-3-030-29414-4_5He, J, Jansen, T & Zarges, C 2019, Unlimited Budget Analysis. in GECCO 2019 Companion: Proceedings of the 2019 Genetic and Evolutionary Computation Conference. Proceedings of the Genetic and Evolutionary Computation Conference, Association for Computing Machinery, pp. 427-428, GECCO 2019: The Genetic and Evolutionary Computation Conference, Prague, Czech Republic, 13 Jul 2019. 10.1145/3319619.3322009Jansen, T & Zarges, C 2018, Theoretical Analysis of Lexicase Selection in Multi-Objective Optimization. in CM Fonseca, N Lourenco, P Machado, L Paquete, A Auger & D Whitley (eds), Parallel Problem Solving from Nature – PPSN XV: 15th International Conference, Coimbra, Portugal, September 8–12, 2018, Proceedings, Part II. Lecture Notes in Computer Science, vol. 11102 LNCS, Springer Nature, pp. 153-164, Parallel Problem Solving from Nature, Coimbra, Portugal, 08 Sept 2018. 10.1007/978-3-319-99259-4_13More publications on the Research Portal",
  "content_length": 3323,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:37"
}