{
  "name": "Thomas Rose 0001",
  "homepage": "https://dbis.rwth-aachen.de/dbis/index.php/user/rose",
  "status": "success",
  "content": "Prof. Dr. Thomas Rose | DBIS DBIS Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in Categories Pages - - Courses i5 Jobs Labs Lectures News Projects Research Fields RFC Seminars Theses Uncategorized Working Groups - Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in DBIS Prof. Dr. Thomas Rose This user account status is Approved This user has not added any information to their profile yet.Contact Information:AddressLehrstuhl Informatik 5 Building: E2 Room: Ahornstraße 55 52074 Aachen E-mail Addressthomas.rose@fit.fraunhofer.deShort BioThomas Rose is Professor for Media Processes at RWTH Aachen and head of the research group on business process management at Fraunhofer FIT. He received his Diploma in Computer Science from the University of Dortmund in 1985, and the Doctoral degree in Computer Science from the University of Passau in 1991. From 1990 through 1993 he was as a Research Associate with the Department of Computer Science at the University of Toronto, Ontario, Canada. From October 1993 until 2002, he has been a Senior Researcher with the Research Institute for Applied Knowledge Processing (FAW) at the University of Ulm, Germany. Since 2002, he is with FIT (Fraunhofer Institute for Applied Information Technology). Thomas Rose has been project co-ordinator of Apnee as well as Apnee-Tu and served as technical co-ordinator for a number of projects. Apnee (-Tu) has been selected as one of the success stories of European IST research by Commissioner Vivian Reding in 2005. The research group is endowed by the German B-IT Foundation. B-IT (Bonn-Aachen International Center for Information Technology) Foundation is a 56 million Euro endowment, complemented by additional federal project funds and matching funds from North Rhine-Westphalia. Research Interests Media processes for information capture and dissemination Process management and customisation Projects Setric (Security and Trust in Cities) – collaboration platform for the exchange of best practices in the domain of risk management: http://www.fit.fraunhofer.de/projects/prozesse/setric_en.html ERMA (Electronic Risk Management Architecture) – collaboration and process management platform for rescue organisations and forces: http://www.fit.fraunhofer.de/projects/prozesse/erma_en.html Olga (Online Guideline Assist for Intensive Care) – support of intensive care units in the the definition and use of Standard Operating Procedures (SOP): http://www.fit.fraunhofer.de/projects/prozesse/olga_en.html ZAMOMO (Integration of model-based software and control engineering) – integrated modelling of functional and non-functional requriements for electronic control units: http://www.fit.fraunhofer.de/projects/prozesse/zamomo_en.html Links Business area on decision and process management support at FIT http://www.fit.fraunhofer.de/services/processes.htmlPast Teachings:Data Visualisation and Analytics (WS 2023)Data Visualisation and Analytics (WS 2022)Distributed Ledger Technology (SS 2022)Prozess Management (SS 2022) Entries Comments SearchSearch Quick Links News Staff Job Offers Thesis Projects Resources Featured Videos How to find us ContactProf. Dr. S. DeckerRWTH Aachen UniversityLehrstuhl Informatik 5Ahornstr. 5552074 AachenTel +49/241/80-21509Fax +49/241/80-22321 Recent News Inaugural Meeting of the JUPITER AI Factory (JAIF) Call for Papers: Semantics in Dataspaces (SDS25) @ESWC 2025 Best Academic Reviewer Award at the iLRN 2024 Call for Papers: LLMs4MI2024 Workshop in Dubai Nachruf auf Prof. Dr. rer.pol. Matthias Jarke Recent Publications Loading publications top RWTH Main Page Faculty of Mathematics, Computer Science and Natural Sciences Department of Computer Science Knowledge-Based Systems Group Fraunhofer FIT",
  "content_length": 3905,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:56"
}