{
  "name": "Thomas R. Gross",
  "homepage": "http://www.lst.inf.ethz.ch/people/personal-pages/trg.html",
  "status": "success",
  "content": "Thomas R Gross – Laboratory for Software Technology | ETH Zurich Homepage Navigation Search Content Footer Contact Sitemap Thomas R Gross Phone:  +41 44 632 7342 Admin: +41 44 632 7311 EMail: FirstName Dot LastName @ inf.ethz.ch Office: CAB H 69.2 This is my minimal web page.  You find my recent papers on my group's page.  Sometimes external page dblp is more up to date than my page .... Ultra short bio I have  worked on the software and architecture of a variety of experimental computer systems. As a graduate student at Stanford, I participated in the (Stanford) MIPS project.  At Carnegie Mellon, I was part of the external page Warp, iWarp  and Fx projects. My current projects focus on compilers, programming tools, and (in collaboration with external page Disney Research) on using  software instead of (complicated) hardware (e.g., for  low-cost networking based on external page visible light communication or external page body channel communication). Links external page Informatik Stiftung Schweiz: The Swiss Informatics Foundation supports projects that target the general population’s knowledge about the development, technology, application and effects of Informatics and related areas; I am a member of the board. Laboratory for Software Technology (LST): The LST pages contain information about papers, ongoing projects, and classes. external page NCCR MICS (Mobile Information and Communication Systems):  I was the deputy director of this center, which is funded by the Swiss National Science Foundation. external page Computing, Media, and Communication Laboratory (CMCL) at CMU:  The CMCL pages contain information about past and present projects.  You'll find there pages for papers and software that you can download. JavaScript has been disabled in your browser",
  "content_length": 1789,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:54"
}