{
  "name": "Thomas Ludwig 0002",
  "homepage": "https://wr.informatik.uni-hamburg.de/people/thomas_ludwig",
  "status": "success",
  "content": "Prof. Dr. Thomas Ludwig [Scientific Computing // Wissenschaftliches Rechnen] people:thomas_ludwig Table of Contents Biography Projects Publications Posters Talks Supervised Theses Teaching Prof. Dr. Thomas Ludwig E-mailludwig@dkrz.de PGPC7F5 EC20 77C1 1682 E4BD D360 9044 79B4 E650 1A1A AddressDKRZ, room 119 Telephone+49 40 460094-200 Biography Thomas Ludwig received his doctoral degree and the German habilitation degree at the Technische Universität München, where he conducted research on HPC from 1988 to 2001. From 2001 to 2009 he had a chair for parallel computing at the Universität Heidelberg. 2009 he moved to Hamburg. He is now director of the German Climate Computing Center (DKRZ) and professor at the Universität Hamburg. His research activity is in the fields of high volume data storage, energy efficiency, and performance analysis concepts and tools for parallel systems. At DKRZ Prof. Ludwig takes the responsibility for accomplishing its mission: to provide high performance computing platforms, sophisticated and high capacity data management, and superior service for premium climate science. Projects Aktuelles Schlagwort im Informatik Spektrum Publications 2023 Editorial Themenheft Digitale Landwirtschaft (Thomas Ludwig, Jannek Squar), In Informatik Spektrum (46), pp. 1–2, 2023-02 Publication details – DOI – Publication Vecpar – A Framework for Portability and Parallelization (Georgiana Mania, Nicholas Styles, Michael Kuhn, Andreas Salzburger, Beomki Yeo, Thomas Ludwig), In Computational Science – ICCS 2023, pp. 253–267, (Editors: Jiri Mikyska, Clelia de Mulatier, Maciej Paszynski, Valeria V. Krzhizhanovskaya, Jack J. Dongarra, Peter M.A. Sloot), Springer Nature Switzerland (Cham), ICCS 2023, Prague, 2023 Publication details – URL – DOI 2022 Data-Aware Compression for HPC using Machine Learning (Julius Plehn, Anna Fuchs, Michael Kuhn, Jakob Lüttgau, Thomas Ludwig), In ACM SIGOPS Operating Systems Review (56), pp. 62–69, 2022-06-14 Publication details – DOI Content queries and in-depth analysis on version-controlled software (Jannek Squar, Niclas Schroeter, Anna Fuchs, Michael Kuhn, Thomas Ludwig), In Knowledge-Based and Intelligent Information & Engineering Systems: Proceedings of the 26th International Conference KES2022, Procedia Computer Science (207), pp. 1261–1270, (Editors: Matteo Cristani, Carlos Toro, Cecilia Zanni-Merk, Robert J. Howlett, Lakhmi C. Jain), Elsevier, KES2022, Verona, Italy, 2022 Publication details – DOI – Publication Automated performance analysis tools framework for HPC programs (Maximilian Keiff, Frederic Voigt, Anna Fuchs, Michael Kuhn, Jannek Squar, Thomas Ludwig), In Knowledge-Based and Intelligent Information & Engineering Systems: Proceedings of the 26th International Conference KES2022, Procedia Computer Science (207), pp. 1067–1076, (Editors: Matteo Cristani, Carlos Toro, Cecilia Zanni-Merk, Robert J. Howlett, Lakhmi C. Jain), Elsevier, KES2022, Verona, Italy, 2022 Publication details – DOI – Publication Data-Aware Compression for HPC using Machine Learning (Julius Plehn, Anna Fuchs, Michael Kuhn, Jakob Lüttgau, Thomas Ludwig), In Proceedings of the Workshop on Challenges and Opportunities of Efficient and Performant Storage Systems, pp. 8–15, ACM, CHEOPS2022, Rennes, France, 2022 Publication details – DOI – Publication 2020 Improving Energy Efficiency of Scientific Data Compression with Decision Trees (Michael Kuhn, Julius Plehn, Yevhen Alforov, Thomas Ludwig), In ENERGY 2020: The Tenth International Conference on Smart Grids, Green Communications and IT Energy-aware Technologies, pp. 17–23, IARIA XPS Press, ENERGY 2020, Lisbon, Portugal, ISBN: 978-1-61208-788-7, ISSN: 2308-412X, 2020-09-27 Publication details – URL Compiler Assisted Source Transformation of OpenMP Kernels (Jannek Squar, Tim Jammer, Michael Blesel, Michael Kuhn, Thomas Ludwig), In 2020 19th International Symposium on Parallel and Distributed Computing (ISPDC), pp. 44–51, IEEE, ISPDC 2020, Warsaw, Poland, ISBN: 978-1-7281-8947-5, 2020-07-05 Publication details – URL – DOI – Publication State of the Art and Future Trends in Data Reduction for High-Performance Computing (Kira Duwe, Jakob Lüttgau, Georgiana Mania, Jannek Squar, Anna Fuchs, Michael Kuhn, Eugen Betke, Thomas Ludwig), In Supercomputing Frontiers and Innovations, Series: Volume 7, Number 1, pp. 4–36, (Editors: Jack Dongarra, Vladimir Voevodin), Publishing Center of South Ural State University (454080, Lenin prospekt, 76, Chelyabinsk, Russia), 2020-04 Publication details – URL – DOI 2019 Towards an HPC Certification Program (Julian Kunkel, Kai Himstedt, Nathanael Hübbe, Hinnerk Stüben, Sandra Schröder, Michael Kuhn, Matthias Riebisch, Stephan Olbrich, Thomas Ludwig, Weronika Filinger, Jean-Thomas Acquaviva, Anja Gerbes, Lev Lafayette), In Journal of Computational Science Education, (Editors: Steven I. Gordon), ISSN: 2153-4136, 2019-01 Publication details – URL – DOI 2018 Towards Green Scientific Data Compression Through High-Level I/O Interfaces (Yevhen Alforov, Anastasiia Novikova, Michael Kuhn, Julian Kunkel, Thomas Ludwig), In 30th International Symposium on Computer Architecture and High Performance Computing, pp. 209–216, IEEE (Los Alamitos, California), SBAC-PAD 2018, Lyon, France, ISBN: 978-1-5386-7769-8, 2018-09 Publication details – DOI Mission possible: Unify HPC and Big Data stacks towards application-defined blobs at the storage layer (Pierre Matri, Yevhen Alforov, Álvaro Brandon, María S. Pérez, Alexandru Costan, Gabriel Antoniu, Michael Kuhn, Philip Carns, Thomas Ludwig), In Future Generation Computer Systems, (Editors: Peter Sloot), Elsevier, 2018-07 Publication details – URL – DOI A Survey of Storage Systems for High-Performance Computing (Jakob Lüttgau, Michael Kuhn, Kira Duwe, Yevhen Alforov, Eugen Betke, Julian Kunkel, Thomas Ludwig), In Supercomputing Frontiers and Innovations, Series: Volume 5, Number 1, pp. 31–58, (Editors: Jack Dongarra, Vladimir Voevodin), Publishing Center of South Ural State University (454080, Lenin prospekt, 76, Chelyabinsk, Russia), 2018-04 Publication details – URL – DOI 2017 Could Blobs Fuel Storage-Based Convergence Between HPC and Big Data? (Pierre Matri, Yevhen Alforov, Alvaro Brandon, Michael Kuhn, Philip Carns, Thomas Ludwig), In 2017 IEEE International Conference on Cluster Computing, pp. 81–86, IEEE Computer Society, CLUSTER 2017, Honolulu, USA, ISBN: 978-1-5386-2326-8, 2017-09 Publication details – URL – DOI A Novel String Representation and Kernel Function for the Comparison of I/O Access Patterns (Raul Torres, Julian Kunkel, Manuel Dolz, Thomas Ludwig), In International Conference on Parallel Computing Technologies, Lecture Notes in Computer Science (10421), pp. 500–512, (Editors: Victor Malyshkin), Springer, PaCT, Nizhni Novgorod, Russia, ISBN: 978-3-319-62932-2, 2017 Publication details – DOI 2016 Data Compression for Climate Data (Michael Kuhn, Julian Kunkel, Thomas Ludwig), In Supercomputing Frontiers and Innovations, Series: Volume 3, Number 1, pp. 75–94, (Editors: Jack Dongarra, Vladimir Voevodin), Publishing Center of South Ural State University (454080, Lenin prospekt, 76, Chelyabinsk, Russia), 2016-06 Publication details – URL – DOI 2015 ArduPower: A low-cost wattmeter to improve energy efficiency of HPC applications (Manuel F. Dolz, Mohammad Reza Heidari, Michael Kuhn, Thomas Ludwig, Germán Fabregat), In Sixth International Green Computing Conference and Sustainable Computing Conference (IGSC) 2015, pp. 1–8, IEEE, IGSC 2015, Las Vegas, USA, 2015-12 Publication details – DOI MPI-Checker - Static Analysis for MPI (Alexander Droste, Michael Kuhn, Thomas Ludwig), In Proceedings of the Second Workshop on the LLVM Compiler Infrastructure in HPC, LLVM '15, ACM (New York, USA), SC15, Austin, Texas, USA, ISBN: 978-1-4503-4005-2, 2015-11 Publication details – URL – DOI A Best Practice Analysis of HDF5 and NetCDF-4 Using Lustre (Christopher Bartz, Konstantinos Chasapis, Michael Kuhn, Petra Nerge, Thomas Ludwig), In High Performance Computing, Lecture Notes in Computer Science (9137), pp. 274–281, (Editors: Julian Martin Kunkel, Thomas Ludwig), Springer International Publishing (Switzerland), ISC 2015, Frankfurt, Germany, ISBN: 978-3-319-20118-4, ISSN: 0302-9743, 2015-06 Publication details – DOI Speicherung großer Datenmengen und Energieeffizienz (Thomas Ludwig, Manuel Dolz, Michael Kuhn, Julian Kunkel, Hermann Lenhart), Max-Planck-Gesselschaft (München), 2015 Publication details – URL 2014 Exascale Storage Systems – An Analytical Study of Expenses (Julian Kunkel, Michael Kuhn, Thomas Ludwig), In Supercomputing Frontiers and Innovations, Series: Volume 1, Number 1, pp. 116–134, (Editors: Jack Dongarra, Vladimir Voevodin), Publishing Center of South Ural State University (454080, Lenin prospekt, 76, Chelyabinsk, Russia), 2014-06 Publication details – URL – DOI Compression By Default - Reducing Total Cost of Ownership of Storage Systems (Michael Kuhn, Konstantinos Chasapis, Manuel Dolz, Thomas Ludwig), In Supercomputing, Lecture Notes in Computer Science (8488), (Editors: Julian Martin Kunkel, Thomas Ludwig, Hans Werner Meuer), Springer International Publishing (Berlin, Heidelberg), ISC 2014, Leipzig, Germany, ISBN: 978-3-319-07517-4, ISSN: 0302-9743, 2014-06 Publication details – DOI Evaluating Power-Performace Benefits of Data Compression in HPC Storage Servers (Konstantinos Chasapis, Manuel Dolz, Michael Kuhn, Thomas Ludwig), In ENERGY 2014: The Fourth International Conference on Smart Grids, Green Communications and IT Energy-aware Technologies, pp. 29–34, (Editors: Steffen Fries, Petre Dini), IARIA XPS Press, ENERGY 2014, Chamonix, France, ISBN: 978-1-61208-332-2, ISSN: 2308-412X, 2014-04-20 – Awards: Best Paper Publication details – URL Evaluating Lustre's Metadata Server on a Multi-socket Platform (Konstantinos Chasapis, Manuel Dolz, Michael Kuhn, Thomas Ludwig), In Proceedings of the 9th Parallel Data Storage Workshop, PDSW (2014), pp. 13–18, IEEE Press (Piscataway, NJ, USA), SC14, ",
  "content_length": 57052,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:43"
}