{
  "name": "Thomas Keßelheim",
  "homepage": "http://tcs.cs.uni-bonn.de/doku.php?id=staff:thomaskesselheim",
  "status": "success",
  "content": "Prof. Dr. Thomas Kesselheim [Informatik-Abteilung V] University of Bonn · Institute of Computer Science · Algorithms and Complexity Sidebar Home People Research Research Seminar Teaching Portfolio By semester (including past and future semesters) Current Semester (WiSe 2025/26) Bachelor BA-INF 032 - Algorithmen und Berechnungskomplexität I BA-INF 011 - Logik und diskrete Strukturen Master MA-INF 1218 - Algorithms and Uncertainty MA-INF 1323 - Computational Topology MA-INF 1203 - Discrete and Computational Geometry Prof. Dr. Thomas Kesselheim University of Bonn Institute of Computer Science, Dept. V Room 2.058 Friedrich-Hirzebruch-Allee 8 D-53115 Bonn Phone+49 228 73 69678 Fax +49 228 73 4440 Email thomas.kesselheim@uni-bonn.de Virtual Office Hour Zoom Meeting Meeting ID: 685 2407 0922 Passcode: 305903 Research Interests Online Algorithms Algorithmic Game Theory Algorithms and Uncertainty Publications Full List DBLP Google Scholar Teaching Summer 2023: Algorithmische Grundlagen des Maschinellen Lernens (in German) Summer 2023: Algorithmic Game Theory Summer 2022: Algorithmische Grundlagen des Maschinellen Lernens (in German) Winter 2021/22: Randomisierte und Approximative Algorithmen (in German) Winter 2021/22: Algorithmic Game Theory Summer 2021: Algorithmische Grundlagen des Maschinellen Lernens (in German) Summer 2021: Algorithms and Uncertainty Winter 2020/21: Randomisierte und Approximative Algorithmen (in German) Winter 2020/21: Algorithmic Game Theory Summer 2020: Algorithmische Grundlagen des Maschinellen Lernens (in German) Summer 2020: Algorithms and Uncertainty Winter 2019/20: Algorithmen und Berechnungskomplexität I (in German) Summer 2019: Algorithmic Game Theory and the Internet Winter 2018/19: Algorithms and Uncertainty Summer 2018: Algorithmic Game Theory and the Internet Winter 2017/18: Algorithms and Uncertainty (TU Dortmund, in German) Summer 2017: Algorithmic Game Theory (TU Dortmund, in German) Summer 2016: Randomized Algorithms and Probabilistic Analysis of Algorithms (Saarland University) Summer 2015: Algorithmic Game Theory (Saarland University) Brief CV Since 04/2018: Professor for Theoretical Computer Science, University of Bonn 04/2017–03/2018: Junior Professor for Algorithmic Theory, TU Dortmund 08/2014–03/2017: Postdoc, Max Planck Institute for Informatics, Saarbrücken 08/2016–12/2016: Fellow, Simons Institute for the Theory of Computing, University of California, Berkeley, CA, USA 02/2013–07/2014: Postdoc, Department of Computer Science, Cornell University, Ithaca, NY, USA 04/2009–01/2013: PhD Student, Department of Computer Science, RWTH Aachen University Page Tools Imprint/Impressum",
  "content_length": 2660,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:39"
}