{
  "name": "Thomas Begin",
  "homepage": "http://perso.ens-lyon.fr/thomas.begin",
  "status": "success",
  "content": "Thomas Begin's home page Thomas Begin I am a Professor at Université Claude Bernard Lyon 1, and a member of the LIP lab. I am the scientific head of the Hownet team (before I was a member of the Dante team). I am the deputy director of the Computer Science department of Univ. Lyon 1. I received the ACM MSWiM'20 Rising Star Award. My research is in the area of performance evaluation as applied to computer networks and systems. I am particularly interested in applying queueing theory, stochastic modeling, and machine learning techniques to practical problems in order to better understand and configure existing systems. Active topics of interests include: Wireless local area networks; Cloud Computing; Internet of Things; Multi-server queues. Together with Alexandre Brandwajn, we deployed a web application that produces the solution of certain queueing systems using our research material (e.g., G/M/c-like, M/G/1-like, and M/G/c-like queues). Click here to access the tool. Together with Alexandre Brandwajn, we authored a textbook on the performance modeling of computer systems. It covers techniques, principles, and applications, focusing on approximation methods and recent multi-server model advancements. Click here to access the book. News Our submitted ANR project NEMIoT with Orange, and Polytechnique Paris has been funded for 3 years by ANR! Starting in January 2024. I have a Master internship proposal on low-consuption Wi-Fi for IoT. Contact me for more information. During the 2015-2016 academic year, I was on research leave at DIVA lab - University of Ottawa (uOttawa) - Canada. This leave was funded through a CNRS grant. Current and past collaborators with whom I was privileged to work with: Alexandre Brandwajn Bruno Baynat Azzedine Boukerche Anthony Busson Paulo Goncalves Isabelle Guérin Lassous Patrick Loiseau Luiz de la Cruz Llopis Jean-Marie Gorce Rémi Watrigant Contact information Bâtiment Nautibus 23 Avenue Pierre de Coubertin 69622 Villeurbanne Cedex - France Office UCBL (Bât. Nautibus): Room 12.004 (previously 226) Phone UCBL: +33(0)4 72 44 81 91 E-Mail Address: firstname.name@univ-lyon1.fr Laboratoire de l'informatique du parallélisme (LIP) UMR 5668 Ecole Normale Supérieure de Lyon (ENSL) 46 allée d'Italie 69364 Lyon Cedex 07 - France Office ENS: Main Building, Floor 3, Room GN1.354 Phone ENS: +33 (0)4 26 23 38 03 Fax ENS: +33 (0)4 72 72 80 80 E-Mail Address: firstname.name@ens-lyon.fr Orcid number: 0000-0002-7272-1195 Curriculum Vitae Télécharger mon CV en français Download my Résumé in English Enseignements (Teaching info, sorry available only in French ) Je suis le responsable du Master 2 parcours SRS (ex parcours SRIV) de l'Université Claude Bernard Lyon 1. Formation en alternance ouverte à lapprentissage. Réseaux Avancés (M2 SRS RA) DI Lyon 1 - M2 SRS Page web du cours Login : SRSRA Mot de passe : RESEAUX Responsable Sécurité Réseaux (M2 SRS SR) DI Lyon 1 - M2 SRS Page web du cours Login : SRSSR Mot de passe : RESEAUX Responsable Ingénierie des Systèmes et Réseaux (M2 SRS ISR) DI Lyon 1 - M2 SRS Page web du cours Login : SRSISR Mot de passe : RESEAUX Responsable Réseaux Avancés (M2 SRIV RA) DI Lyon 1 - M2 SRIV Page web du cours Login : SRIVRA Mot de passe : RESEAUX Responsable Sécurité des Systèmes d'Information (M2 CCI SSI) DI Lyon 1 - M2CCI Page web du cours Login : CCIRA Mot de passe : RESEAUX Intervenant Initiation aux Systèmes d'Information Répartis et Réseaux (M2 CCI SIRR) DI Lyon 1 - M2CCI Page web du cours Login : CCIRA Mot de passe : RESEAUX Intervenant Réseaux (LIF 8) DI Lyon 1 - Licence Informatique Page web du cours Intervenant Publication list (HAL List) Books Computer Performance Modeling. A. Brandwajn, T. Begin - World Scientific, 2025. Journals Assessing the Performance of NOMA in a Multi-Cell Context: A General Evaluation Framework. A. Bardou, J.M. Gorce, T. Begin - IEEE Transactions on Wireless Communications, 2025. Strategic Deployment of RSUs in Urban Settings: Optimizing IEEE 802.11p Infrastructure. J.P. Astudillo Leon, A. Busson, L. de la Cruz Llopis, T. Begin, A. Boukerche - Ad Hoc Networks, 2024. NS+NDT: Smart integration of Network Simulation in Network Digital Twin, application to IoT networks. S. Si-Mohammed, A. Bardou, T. Begin, I. Guérin Lassous, P. Vicat-Blanc - Future Generation Computer Systems, 2024. An approximation method for a non-preemptive multiserver queue with quasi-Poisson arrivals. A. Brandwajn, T. Begin - ACM Transactions on Modeling and Performance Evaluation of Computing Systems, 2023. Analysis of a decentralized Bayesian optimization algorithm for improving spatial reuse in dense WLANs. A. Bardou, T. Begin - Computer Communications, 2023. An overview of MAC energy-saving mechanisms in Wi-Fi. E. Guérin, T. Begin, I. Guérin Lassous - Computer Communications, 2023. HINTS: A methodology for IoT network technology and configuration decision. S. Si-Mohammed, T. Begin, I. Guérin Lassous, P. Vicat-Blanc - Internet of Things Elsevier, 2023. Mitigating Starvation in Dense WLANs: A Multi-Armed Bandit Solution. A. Bardou, T. Begin, A. Busson - Ad Hoc Networks, 2022. Analysis of a Multi-Armed Bandit solution to improve the spatial reuse of next-generation WLANs. A. Bardou T. Begin, A. Busson - Computer Communications, 2022. Assigning Channels in WLANs with Channel Bonding: A Fair and Robust Strategy. A. Chadda, M. Stojanova, T. Begin, A. Busson, I. Guérin Lassous - Computer Networks, 2021. A Markov Model for Performance Evaluation of Channel Bonding in IEEE 802.11. M. Stojanova, T. Begin, A. Busson - Ad Hoc Networks, 2021. Delivering Video-on-Demand services with IEEE 802.11p to major non-urban roads: a stochastic performance analysis. T. Begin, A. Busson, I. Guérin Lassous, A. Boukerche - Computer Networks, 2020. A Fair and Distributed Congestion Control Mechanism for Smart Grid Neighborhood Area Networks. J.P. Astudillo Leon, T. Begin, A. Busson, L. de la Cruz Llopis - Ad Hoc Networks, 2020. Performance Analysis of Video on Demand in an IEEE 802.11p-based Vehicular Network. T. Begin, A. Busson, I. Guérin Lassous, A. Boukerche - Computer Communications, 2019. Conflict graph-based model for IEEE 802.11 networks: A Divide-and-Conquer approach. M.Stojanova, T. Begin, A. Busson - Performance Evaluation, 2018. First-Come-First-Served Queues with Multiple Servers and Customer Classes. A. Brandwajn, T. Begin - Performance Evaluation, 2018. An accurate and efficient modeling framework for the performance evaluation of DPDK-based virtual switches. T. Begin, B. Baynat, G. Artero Gallardo, V. Jardin - IEEE Transactions on Network and Service Management, 2018. A Study of Systems with Multiple Operating Levels, Probabilistic Thresholds and Hysteresis. A. Brandwajn, T. Begin, H. Castel-Taleb, T.Atmaca - IEEE Transactions on Parallel and Distributed Systems, Volume 29, 2018. Multi-server preemptive priority queue with general arrivals and service times. A. Brandwajn, T. Begin - Performance Evaluation, Volume 115, 2017. Safety Message Generation Rate Adaptation in LTE-based Vehicular Networks. H. Soleimani, T. Begin, A. Boukerche - Computer Networks, Volume 128, 2017. Breaking the dimensionality curse in multi-server queues. A. Brandwajn, T. Begin - Computers & Operations Research, Volume 73, 2016. Performance analysis of multi-hop flows in IEEE 802.11 networks: A flexible and accurate modeling framework. T. Begin, B. Baynat, I. Guérin Lassous, T. Abreu - Performance Evaluation, Volume 96, 2016. Performance Evaluation of Cloud Computing Centers with General Arrivals and Service. T.Atmaca, T. Begin, A. Brandwajn, H. Castel-Taleb - IEEE Transactions on Parallel and Distributed Systems, Volume 27, 2016. Reduced complexity in M/Ph/c/N queues. A. Brandwajn, T. Begin - Performance Evaluation, Volume 78, 2014. A recurrent solution of Ph/M/c/N-like and Ph/M/c-like queues. A. Brandwajn, T. Begin - Journal of Applied Probability, Volume 49, Issue 1, 2012. Dynamic Resource Management in Clouds: A Probabilistic Approach. P. Gonçalves, S. Roy, T. Begin, P. Loiseau - IEICE Transactions on Communications, 2012 (Invited Paper). High-level Approach to Modeling of Observed System Behavior. T. Begin, A. Brandwajn, B. Baynat, B. Wolfinger, S. Fdida - Performance Evaluation, Volume 67, Issue 5, 2010 A DFO technique to Calibrate Queueing Models. T. Begin, B. Baynat, A. Brandwajn, F. Sourd - Computers & Operations Research, Volume 37, Issue 2, 2010. Higher-order distributional properties in closed queueing networks. A. Brandwajn, T. Begin - Performance Evaluation, Volume 66, Issue 11, 2009. Conferences Model Placement for Quality Inference of Video Streaming Traffic over a Cellular Network . F. Faticanti, L. Desgeorges, R. Watrigant, T. Begin, F. Bronzino - IEEE LCN 2025 - Sydney (Australia). Studying the Benefits of Hybrid Wi-Fi/LiFi Networks for Indoor WLANs. M. Ghali, A. Busson, T. Begin - IEEE ICC 2025 - Montréal (Canada). Lighting Up Dynamic Networks: AP Assignment Strategy for QoS and Energy Efficiency in HLWNets. M. Ghali, A. Busson, T. Begin - WiMob 2024 - Paris (France). De l'intérêt de spécialiser les bandes de fréquences Wi-Fi pour différentes classes de stations. L. Desgeorges, T. Begin, I. Guérin Lassous - CoRes 2024 - Saint-Briac-sur-Mer (France). Relaxing the Additivity Constraints in Decentralized No-Regret Bayesian Optimization. A. Bardou, P. Thiran, T. Begin - ICLR 2024 - Vienna (Austria). Performance analysis of MAC energy-saving strategies for WLANs. E. Guérin, T. Begin, I. Guérin Lassous, A. Busson - ACM MSWiM 2023 - Montréal (Canada). Strategies to Plan the Number and Locations of RSUs for an IEEE 802.11 p-based Infrastructure in Urban Environment.  J.P. Astudillo Leon, A. Busson, L. de la Cruz Llopis, T. Begin, A. Boukerche - ACM MSWiM 2023 - Montréal (Canada). COSMEA : Combiner Simulation et Apprentissage Automatique pour Optimiser la Configuration des Réseaux IoT. S. Si-Mohammed, T. Begin, I. Guérin Lassous, P. Vicat-Blanc - CoRes 2023 - Cargèse (France). StackNet: IoT Netw",
  "content_length": 24858,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:18"
}