{
  "name": "Thomas Liebig",
  "homepage": "https://www-ai.cs.tu-dortmund.de/PERSONAL/liebig.html",
  "status": "success",
  "content": "Juniorprof. Dr. Thomas Liebig LS 8 General Research Teaching Staff Internal SFB876 German Suche > Hauptnavigation General Research Teaching Staff Prof. Morik Prof. Schubert Staff Alumni Email: thomas.liebig cs.tu-dortmund.de Phone: 0231/755-8117 Fax: 0231/755-5105 Room-No.: OH14 R216 About My Erdős-number is 3 (via P. Sanders - N. C. Wormald - P. Erdős, via S. Funke - B. Aronov - P. Erdős) private website Courses Lecture Knowledge Discovery in Databases (summer 2019) Lecture Knowledge Discovery in Databases (summer 2018) Fachprojekt Data Mining und Datenanalyse (winter 2015) Research Topics Distributed Data Mining Reinforcement Learning Multi-Agent Learning Privacy Preserving Learning, Privacy-by-Design p-adic Models Graph Neuronal Networks Publications Becker/Liebig/2022a Alexander Becker and Thomas Liebig. Certified Data Removal in Sum-Product Networks. In IEEE International Conference on Knowledge Graph (ICKG), pages (accepted), Orlando, Florida, USA, IEEE, 2022. Boiar/etal/2022a Daniel Boiar and Nils Killich and Lukas Schulte and Victor Hernandez Moreno and Jochen Deuse and Thomas Liebig. Forecasting Algae Growth in Photo-Bioreactors using Attention LSTMs. In Proceedings of the Workshop on Artificial Intelligence for Engineering Applications 2022, pages (accepted), Springer, 2022. Roth/Liebig/2022a Roth, Andreas and Liebig, Thomas. Transforming PageRank into an Infinite-Depth Graph Neural Network. In Joint European Conference on Machine Learning and Knowledge Discovery in Databases, Springer, 2022. Roth/Liebig/2022b Roth, Andreas and Liebig, Thomas. Forecasting Unobserved Node States with spatio-temporal Graph Neural Networks. In International Conference on Data Mining Workshops, IEEE, 2022. Sachweh/etal/2022a Timon Sachweh and Daniel Boiar and Thomas Liebig. Distributed LSTM-Learning from Differentially Private Label Proportions. In Data Mining Workshops, 2022. ICDMW'22. IEEE International Conference on, pages (accepted), IEEE, 2022. Shao/etal/2021a Xiaoting Shao and Alejandro Molina and Antonio Vergari and Karl Stelzner and Robert Peharz and Thomas Liebig and Kristian Kersting. Conditional Sum-Product Networks: Modular Probabilistic Circuits via Gate Functions. In International Journal of Approximate Reasoning, pages 298-313, 2022. Haritz/etal/2021a Haritz, Pierre and Pfahler, Lukas and Liebig, Thomas and Kotthaus, Helena. Self-Supervised Source Code Annotation from Related Research Papers. In Proceedings of the PhD Forum of the 21st IEEE International Conference on Data Mining, pages 1083-1084, 2021. Klumpp/etal/2021a Klumpp, Matthias and Hintze, Marcus and Immonen, Milla and Ródenas-Rigla, Francisco and Pilati, Francesco and Aparicio-Martínez, Fernando and Çelebi, Dilay and Liebig, Thomas and Jirstrand, Mats and Urbann, Oliver and others. Artificial Intelligence for Hospital Health Care: Application Cases and Answers to Challenges in European Hospitals. In Healthcare, Vol. 9, No. 8, pages 961, Multidisciplinary Digital Publishing Institute, 2021. Sachweh/etal/2021a Timon Sachweh and Daniel Boiar and Thomas Liebig. Differentially Private Learning from Label Proportions. In Proceedings of the ECML Workshop on Parallel, Distributed, and Federated Learning, pages accepted, 2021. Sanders/Liebig/2020a Sanders, Cedric and Liebig, Thomas. Knowledge Discovery on Blockchains: Challenges and Opportunities. In Proceedings of the ECML Workshop on Parallel, Distributed, and Federated Learning, 2020. Shao/etal/2020a Xiaoting Shao and Alejandro Molina and Antonio Vergari and Karl Stelzner and Robert Perharz and Thomas Liebig and Kristian Kersting. Conditional Sum-Product Networks: Composing Neural Networks into Probabilistic Tractable Models. In Proceedings of the 10th International Conference on Probabilistic Graphical Models, 2020. Ziegler/etal/2020a Ziegler, Florian and Freund, Maurice and Rydzek, Andreas and Liebig, Thomas. Towards Truck Parking Lot Occupancy Estimation. In arXiv preprint arXiv:2002.00244, 2020. Buschjaeger/etal/2019a Buschjäger, Sebastian and Liebig, Thomas and Morik, Katharina. Gaussian Model Trees for Traffic Imputation. In Proceedings of the International Conference on Pattern Recognition Applications and Methods (ICPRAM), pages 243 - 254, SciTePress, 2019. Sanders/Liebig/2019a Sanders, Cedric and Liebig, Thomas. Knowledge Discovery on Blockchains: Challenges and Opportunities. In arXiv preprint arXiv:1904.07104, 2019. Shao/etal/2019a Xiaoting Shao and Alejandro Molina and Antonio Vergari and Karl Stelzner and Robert Peharz and Thomas Liebig and Kristian Kersting. Conditional Sum-Product Networks: Imposing Structure on Deep Probabilistic Architectures. In Proceedings of the 3rd Workshop on Tractable Probabilistic Modeling at ICML2019, pages accepted, 2019. Sliwa/etal/2019b Benjamin Sliwa and Thomas Liebig and Tim Vranken and Michael Schreckenberg and Christian Wietfeld. System-of-systems modeling, analysis and optimization of hybrid vehicular traffic. In 2019 Annual IEEE International Systems Conference (SysCon), Orlando, Florida, USA, IEEE, 2019. Sliwa/etal/2019c Sliwa, Benjamin and Falkenberg, Robert and Liebig, Thomas and Piatkowski, Nico and Wietfeld, Christian. Boosting Vehicle-to-cloud Communication by Machine Learning-enabled Context Prediction. In IEEE Transactions on Intelligent Transportation Systems, 2019. Rieke/etal/2018a Rieke, Matthes and Bigagli, Lorenzo and Herle, Stefan and Jirka, Simon and Kotsev, Alexander and Liebig, Thomas and Malewski, Christian and Paschke, Thomas and Stasch, Christoph. Geospatial IoT -- The Need for Event-Driven Architectures in Contemporary Spatial Data Infrastructures. In ISPRS International Journal of Geo-Information, Vol. 7, No. 10, 2018. Roemer/etal/2018a Römer, Christian and Hiry, Johannes and Kittl, Chris and Liebig, Thomas and Rehtanz, Christian. Charging control of electric vehicles using contextual bandits considering the electrical distribution grid. In Proceedings of the 2nd International Workshop on Knowledge Discovery from Mobility and Transportation Systems, KNOWme, co-located with the European Conference on Machine Learning and Principles and Practice of Knowledge Discovery (ECML PKDD), pages (accepted), 2018. Sliwa/etal/2018a Sliwa, Benjamin and Liebig, Thomas and Falkenberg, Robert and Pillmann, Johannes and Wietfeld, Christian. Efficient machine-type communication using multi-metric context-awareness for cars used as mobile sensors in upcoming 5G networks. In Proceedings of the 87th Vehicular Technology Conference: VTC2018-Spring, IEEE, 2018. Sliwa/etal/2018c Benjamin Sliwa and Thomas Liebig and Robert Falkenberg and Johannes Pillmann and Christian Wietfeld. Machine learning based context-predictive car-to-cloud communication using multi-layer connectivity maps for upcoming 5G networks. In 2018 IEEE 88th IEEE Vehicular Technology Conference (VTC-Fall), Chicago, USA, 2018. Sliwa/etal/2018d Benjamin Sliwa and Thomas Liebig and Robert Falkenberg and Johannes Pillmann and Christian Wietfeld. Resource-efficient transmission of vehicular sensor data using context-aware communication. In 19th IEEE International Conference on Mobile Data Management (MDM), Aalborg, Denmark, 2018. Tomaras/etal/2018a Dimitrios Tomaras and Vana Kalogeraki and Thomas Liebig and Dimitrios Gunopulos. Crowd-based ecofriendly trip planning. In Proceedings of the 19th IEEE International Conference on Mobile Data Management, Aalborg, pages (accepted), IEEE Press, 2018. Heppe/2017a Heppe, Lukas and Liebig, Thomas. Real-Time Public Transport Delay Prediction for Situation-Aware Routing. In Kern-Isberner, Gabriele and Fürnkranz, Johannes and Thimm, Matthias (editors), KI 2017: Advances in Artificial Intelligence: 40th Annual German Conference on AI, Dortmund, Germany, September 25--29, 2017, Proceedings, pages 128--141, Cham, Springer, 2017. Liebig/2017a Liebig, Thomas. Smart navigation - chances, risk and challenges. In M. Jankowska and M. Pawelczyk and S. Augustyn and M. Kulawiak (editors), Navigation and Earth Observation - Law & Technology, pages (accepted), Warsaw, IUS PUBLICUM, 2017. Liebig/2017b Liebig, Thomas. Report on Data Privacy. No. H2020-688380 D4.1, VAVEL Consortium, Dortmund, Germany, 2017. Liebig/etal/2017b Liebig, Thomas and Piatkowski, Nico and Bockermann, Christian and Morik, Katharina. Dynamic Route Planning with Real-Time Traffic Predictions. In Information Systems, Vol. 64, pages 258--265, Elsevier, 2017. Liebig/Sotzny/2017a Liebig, Thomas and Sotzny, Maurice. On Avoiding Traffic Jams with Dynamic Self-Organizing Trip Planning. In Clementini, Eliseo and Donnelly, Maureen and Yuan, May and Kray, Christian and Fogliaroni, Paolo and Ballatore, Andrea (editors), 13th International Conference on Spatial Information Theory (COSIT 2017), Vol. 86, pages 17:1--17:12, Dagstuhl, Germany, Schloss Dagstuhl--Leibniz-Zentrum fuer Informatik, 2017. Shaik/etal/2017a Shaik, Nayabrasul and Liebig, Thomas and Kirsch, Christopher and Müller, Heinrich. Dynamic Map Update of Non-static Facility Logistics Environment with a Multi-robot System. In Kern-Isberner, Gabriele and Fürnkranz, Johannes and Thimm, Matthias (editors), KI 2017: Advances in Artificial Intelligence: 40th Annual German Conference on AI, Dortmund, Germany, September 25--29, 2017, Proceedings, pages 249--261, Cham, Springer, 2017. Panagiotou/etal/2016a Panagiotou, Nikolaos and Zygouras, Nikolas and Katakis, Ioannis and Gunopulos, Dimitrios and Zacheilas, Nikos and Boutsis, Ioannis and Kalogeraki, Vana and Lynch, Stephen and O'Brien, Brendan and Kinane, Dermot and Mare\\vcek, Jakub and Yu, Jia Yuan and Verago, Rudi and Daly, Elizabeth and Piatkowski, Nico and Liebig, Thomas and Bockermann, Christian and Morik, Katharina and Schnitzler, Francois and Weidlich, Matthias and Gal, Avigdor and Mannor, Shie and Stange, Hendrik and Halft, Werner and Andrienko, Gennady. INSIGHT: Dynamic Traffic Management Using Heterogeneous Urban Data. In Berendt, Bettina and Bringmann, Björn and Fromont, Élisa and Garriga, Gemma an",
  "content_length": 21051,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:45"
}