{
  "name": "Thomas F. J.-M. Pasquier",
  "homepage": "https://tfjmp.org",
  "status": "success",
  "content": "Thomas Pasquier Search Thomas Pasquier Assistant Professor University of British Columbia Biography Thomas Pasquier is an Assistant Professor in the Department of Computer Science at the University of British Columbia. He is affiliated with the UBC Security & Privacy Group and the Systopia Lab, UBC’s systems research group. His work focuses on the design and implementation of computer systems that are inherently observable and transparent. His research interests include digital provenance, system auditing and accountability, intrusion detection, and performance optimization. Thomas Pasquier est professeur adjoint au Département d’informatique de l’Université de la Colombie-Britannique (UBC). Il est affilié au Security & Privacy Group de l’UBC et au Systopia Lab, le groupe de recherche en systèmes de l’UBC. Ses travaux portent sur la conception et la mise en oeuvre de systèmes informatiques intrinsèquement observables et transparents. Ses intérêts de recherche incluent la provenance numérique, l’audit et la responsabilité des systèmes, la détection d’intrusion et l’optimisation des performances. Interests Computer Security Intrusion Detection Digital Provenance Operating Systems Distributed Systems Data Protection and Privacy Education PhD in Computer Science, 2016 University of Cambridge MPhil in Advanced Computer Science, 2012 University of Cambridge Diplôme d'Ingénieur (apprenticeship), 2011 Institut Supérieur d'Electronique de Paris Diplôme Universitaire de Technologie (apprenticeship), 2008 Conservatoire National des Arts et Métiers Experience Assistant Professor University of British Columbia Jul 2021 – Present Canada Member of the Department of Computer Science, member of the Security & Privacy Group, and member of the Systopia Lab. Assistant Professor University of Bristol Aug 2018 – Jun 2021 United Kingdom Member of the School of Computer Science. Research Associate University of Cambridge Dec 2017 – Aug 2018 United Kingdom Member of the Digital Technology Group and Junior Fellow at St Edmund’s College. Advisor Sir Andy Hoper. Postdoctoral Fellow Harvard University Jul 2016 – Dec 2017 United States of America Fellow of the Center for Research on Computation and Society and member of the System Research at Harvard Group. Advisor Prof. Margo Seltzer Research Assistant University of Cambridge Jan 2013 – Jul 2016 United Kingdom Member of the Opera Research Group and the Networks and Operating Systems group. Advisor Prof. Jean Bacon Apprentice Software Engineer Gemalto Sep 2008 – Aug 2011 France R&D Team member (Gemalto is now Thales Digital Identity and Security). Apprentice Electronic Engineer SRETT Sep 2006 – Sep 2008 France R&D Team member (SRETT specialize in industrial and health IoT solutions) Joining my lab If you are a PhD student interested by my work and a collaboration, I am always happy to welcome Visiting International Research Student in my lab. Please, review carefully the information provided on UBC website before contacting me. You may want to explore the MITACS’ Globalink Research Award program as a potential source of funding. Ensure you have discussed with your home institution and supervisor first. Contacting me If you are planning to apply, please, do so through the UBC system, if you select me as a potential supervisor in the online form, I will review your application. I cannot process applications sent via e-mail and I will not review application packages sent by e-mail. I do not process applications before the closing deadline (December 15th). The department receive around 2,000 applications every year and it takes a non-trivial amount of time to review them carefully. We aim (but cannot guarantee) for all applicants to hear back from us by mid-April. I will not discuss admission outside of the departmental admission process. Please feel free to contact me if you have specific research questions. I am looking to work with students from all background (first generation students, and students from underrepresented and marginalized groups are encouraged to apply). Please, visit the prospective applicant page on UBC website and on the CS website. You can also find information about: financial support, application fee waivers, minimum requirements for admission into graduate studies, and minimum English proficiency requirements. You may also look at this page which describes my expectations when working with graduate students. Finally, you should have a look at UBC cost calculator. The Master of Science in Computer Science at UBC is a research degree. Students are expected to conduct research, submit papers for publication, and eventually write a thesis. You can find more information on the university website. While applications are not reviewed with the same expectations as those of PhD applicants, you should clearly demonstrate you have an interest and the capacity to conduct research. A few facts You must apply online. Do check the application deadline on UBC’s website. The department starts processing applications in January for the next academic year. Students are admitted by the department, not by individual faculty members. Master and PhD applications are reviewed by the same committee. The PhD track is ideal for candidates who ultimately want to do a PhD, but do not feel ready yet. Even if you are well fitted for my group, I cannot guarantee admission. Before applying Have a look at my publications. Identify matching interests. Understand that I will not supervise students outside of my area of expertise. Find a set of papers which aligns with your interests. Read the abstracts. Read at least one paper in full. What to address in your statement of intent? Start with the official guidance. Review the department website for any required information, length limits, or formatting. Cover three essentials. Demonstrate you understand research; describe the research you have done; outline the research you want to pursue. Mention funding. Briefly note scholarships you hold or plan to apply for. Stay focused. The SoI is not your life story; prioritize intellectual trajectory, evidence of research ability, and where the degree fits in your career plans. Emphasize advisor fit. The advisor–student relationship is crucial and often lasts for years. Your SoI should make the commonality of interests obvious. Be selective about potential advisors. Listing many names across unrelated areas usually weakens your case. If you are considering co-supervision explain the intellectual thread that links advisors. Make the match explicit. Clearly connect specific faculty to your past experience and future aims: why this lab, why now, and what you would contribute. All else equal, specificity wins. Applicants who can articulate why a particular advisor and research direction are the right fit are more likely to be successful. These points reflect my personal perspective and may not be universally true. If you get an offer letter Do not hesistate to get in touch to discuss specific details. Funding amounts on the offer letter is a guaranteed minimum, do contact me to discuss the actual amount. Apply for graduate accomodation as early as possible. Check the information online. Selected Publications Sometimes Simpler is Better: A Comprehensive Analysis of State-of-the-Art Provenance-Based Intrusion Detection Systems Provenance-based intrusion detection systems (PIDSs) have garnered significant attention from the research community over the past … T Bilot, B Jiang, Z Li, N El Madhoun, K Al Agha, A Zouaoui, T Pasquier PDF Cite Project ORTHRUS: Achieving High Quality of Attribution in Provenance-based Intrusion Detection Systems Past success in applying machine learning to data provenance graphs – a structured representation of the history of operating … B Jiang, T Bilot, N El Madhoun, K Al Agha, A Zouaoui, S Iqbal, X Han, T Pasquier PDF Cite Project SafeBPF: Hardware-assisted Defense-in-depth for eBPF Kernel Extensions The eBPF framework enables execution of user-provided code in the Linux kernel. In the last few years, a large ecosystem of cloud … SY Lim, T Prasad, X Han, T Pasquier PDF Cite Project FetchBPF: Customizable Prefetching Policies in Linux with eBPF Monolithic operating systems are infamously complex. Linux in particular has a tendency to intermingle policy and mechanisms in a … X Cao, S Patel , SY Lim, X Han, T Pasquier PDF Cite Project Kairos: Practical Intrusion Detection and Investigation using Whole-system Provenance Provenance graphs are structured audit logs that describe the history of a system’s execution. Recent studies have explored a … Z Cheng, Q Lv, J Liang, Y Wang, D Sun, T Pasquier, X Han PDF Cite Project A large-scale study on research code quality and execution This article presents a study on the quality and execution of research code from publicly-available replication datasets at the Harvard … A Trisovic, M K Lau, T Pasquier, M Crosas PDF Cite DOI Recent Publications T Bilot, T Pasquier (2025). Toward Practical and Usable Provenance-based Intrusion Detection Systems. USENIX ;login:. PDF Cite Project T Bilot, B Jiang, Z Li, N El Madhoun, K Al Agha, A Zouaoui, T Pasquier (2025). Sometimes Simpler is Better: A Comprehensive Analysis of State-of-the-Art Provenance-Based Intrusion Detection Systems. USENIX Sec'25. PDF Cite Project B Jiang, T Bilot, N El Madhoun, K Al Agha, A Zouaoui, S Iqbal, X Han, T Pasquier (2025). ORTHRUS: Achieving High Quality of Attribution in Provenance-based Intrusion Detection Systems. USENIX Sec'25. PDF Cite Project T Abrar, A Shamail, M J Iqbal, M Iqbal, A Zouaoui, A Ahmed, M Abdullah, M Shayan, F Zaffar, T Pasquier, D Eyers, A Gehani (2025). On the Reproducibility of Provenance-based Intrusion Detection that uses Deep Learning. ACM REP'25. PDF Cite SY Lim, T Prasad, X Han, T Pasquier (2024). SafeBPF: Hardware-assisted Defense-in-depth for eBPF Kernel Extensions. ACM CCSW'24. PDF Cite Project X Cao, S Patel , SY Lim, X Han, T Pasquier (2024). FetchBPF: ",
  "content_length": 13602,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:27"
}