{
  "name": "Thomas Reps",
  "homepage": "http://pages.cs.wisc.edu/~reps",
  "status": "success",
  "content": "Home Page of Prof. Thomas W. Reps My UW | UW Search Computer Science Home Page > ~reps Contact  Information Biography Summary of Past Research Recent Items of Note (Last updated: 3/27/25) Popular Papers Categorized Index to Publications Disclaimer List of Publications · Books · Journal Publications · Invited Papers · Book Chapters · Reprinted in Collections · Edited Books · Conference Publications · Tutorials · Patents · Pending Submissions · Magazine Articles · Other Publications and Reports Software Visitors, Post-Doctoral Associates, and Students C.S. Dept.  Home Page Thomas W. Reps Honorary Fellow J. Barkley Rosser Professor & Rajiv and Ritu Batra Chair Emeritus Computer Sciences Department University of Wisconsin-Madison 1210 West Dayton Street Madison, WI 53706-1685 USA Contact Information: E-mail: reps at cs.wisc.edu Telephone: (608) 262-2091 Department: (608) 262-1204 Some Maps: Campus Map | Campus-to-Capitol Map | City Map Ph.D., Cornell University, 1982 (CV, Wikipedia, Biography, Summary of Past Research, Benefunder Profile) Research Interests: Program slicing, differencing, and merging Interprocedural dataflow analysis Alias analysis, pointer analysis, and shape analysis Analysis of multi-threaded programs Symbolic abstraction and decision procedures Other program-analysis problems Path problems Model checking Computer security Quantum computing Code instrumentation Computational differentiation and computational divided differencing Program-development environments Incremental computing Attribute grammars Miscellaneous See also Google Scholar, DBLP, Semantic Scholar, Guide2Research, LinkedIn, CiteSeer, ACM Digital Library, Internet Archive Scholar, and MathSciNet. ORCID: https://orcid.org/0000-0002-5676-9949 Page at the Mathematics Genealogy Project Projects: Rice-UT-UW-GrammaTech Pliny Project Wisconsin Program-Slicing Project Wisconsin Safety Analyzer Project CMU-UW Software Model Checking Project Other Affiliations: GrammaTech, Inc. madPL (UW Programming Languages Group) Recent Items of Note Recent Publications ``Context-free-language reachability for almost-commuting transition systems'' ``Scalable equivalence checking and verification of shallow quantum circuits'' ``Software model checking via summary-guided search'' ``SAQR-QC: A logic for scalable but approximate quantitative reasoning about quantum circuits'' ``Automated abstract transformer synthesis for reduced product domains'' ``Verifying solutions to semantics-guided synthesis problems'' ``Semantics of sets of programs'' ``Polynomial bounds of CFLOBDDs against BDDs'' ``Synthesizing abstract transformers for reduced-product domains'' ``Weighted context-free-language ordered binary decision diagrams'' ``Automating pruning in top-down enumeration for program synthesis problems with monotonic semantics'' ``Synthesizing formal semantics from executable interpreters'' ``Automating unrealizability logic: Hoare-style proof synthesis for infinite sets of programs'' ``Newtonian program analysis of probabilistic programs'' ``CFLOBDDs: Context-free-language ordered binary decision diagrams'' ``Prompt tuning strikes back: Customizing foundation models with low-rank prompt adaptation'' ``The SemGuS Toolkit'' [Back to the top] Miscellaneous Tips on writing a research paper (video recording from PLMW@PLDI21) Some notes on automatic differentiation and back-propagation (PDF, Slides) My favorite lecture is about \"retrograde debugging,\" in which I use several \"retrograde chess puzzles\" from the Raymond Smullyan book \"The Chess Mysteries of Sherlock Holmes\" to illustrate the concept of retrograde debugging. (Smullyan also wrote a second book of such problems, titled \"The Chess Mysteries of the Arabian Knights.\") You can find links to two recordings of the Nov. 3, 2023 version of the lecture here. The slides from the 2023 version are available here. A recording of the April 2020 version is available here. (The password is Rptp6tSh.) In the 2020 version, the chess problems start at 9:56, 33:39, and 45:40, with a fourth one toward the end. (The accompanying text was auto-generated by Webex, and is pretty funny: \"chess problems\" became \"just problems\" or \"chest problems,\" etc. Not sure how to turn it off though.) I recommend watching at 1.25x speed though (or even faster) because I talked quite slowly that day. Material from CAV 2021 tutorial ``Introduction to Algebraic Program Analysis'' (Z. Kincaid and T. Reps): Part 1 (Kincaid) Part 2 (Kincaid) Part 3 (Reps) Part 4 (Kincaid) Reps interview for People of Programming Languages (2018) The Reps At Sixty Workshop was held in Edinburgh, UK on September 11, 2016. Slides for most of the talks given at the workshop are now available on the website. Some post-workshop reflections about (i) my work on machine-code analysis, and (ii) differences between academic and industry research are available here. Information about the life of Susan Horwitz (1955-2014) can be found here. The paper Horwitz, S., Reps, T., and Binkley, D., Interprocedural slicing using dependence graphs. In Proceedings of the ACM SIGPLAN 88 Conference on Programming Language Design and Implementation, (Atlanta, GA, June 22-24, 1988), ACM SIGPLAN Notices 23, 7 (July 1988), pp. 35-46. [abstract; ACM Author-Izer Link.] was selected for inclusion in a special SIGPLAN collection of the 50 most influential papers from the SIGPLAN Conference on Programming Language Design and Implementation from 1979 to 1999: Horwitz, S., Reps, T., and Binkley, D., Interprocedural slicing using dependence graphs. 20 Years of the ACM SIGPLAN Conference on Programming Language Design and Implementation (1979 - 1999): A Selection, K.S. McKinley, ed., ACM SIGPLAN Notices 39, 4 (April 2004), 232-243. A retrospective on the paper was published as Horwitz, S., Reps, T., and Binkley, D., Retrospective: Interprocedural slicing using dependence graphs. 20 Years of the ACM SIGPLAN Conference on Programming Language Design and Implementation (1979 - 1999): A Selection, K.S. McKinley, ed., ACM SIGPLAN Notices 39, 4 (April 2004), 229-231. [retrospective (PS); retrospective (PDF); ACM Author-Izer Link.] An extended version of the PLDI 88 paper later appeared as the following journal paper: Horwitz, S., Reps, T., and Binkley, D., Interprocedural slicing using dependence graphs. ACM Transactions on Programming Languages and Systems 12, 1 (January 1990), 26-60. [abstract; paper; ACM Author-Izer Link.] [Back to the top] Popular Papers ``Interprocedural slicing using dependence graphs'', TOPLAS 1990 ``The Cornell Program Synthesizer: A syntax-directed programming environment'', CACM 1981 ``Parametric shape analysis via 3-valued logic'', TOPLAS 2002 ``Precise interprocedural dataflow analysis via graph reachability'', POPL 1995 ``The Synthesizer Generator: A System for Constructing Language-Based Editors'', Springer 1989 ``Integrating noninterfering versions of programs'', TOPLAS 1989 ``Solving shape-analysis problems in languages with destructive updating'', TOPLAS 1998 ``The use of program dependence graphs in software engineering'', ICSE 1992 ``An incremental algorithm for a generalization of the shortest-path problem'', J. Alg 1996 ``WYSINWYX: What You See Is Not What You eXecute'', TOPLAS 2010 ``Program analysis via graph reachability'', IST 1998 ``The use of program profiling for software maintenance with applications to the Year 2000 Problem'', FSE 1997 ``Speeding up slicing'', FSE 1994 ``Identifying modules via concept analysis'', TSE 1998 ``Weighted pushdown systems and their application to interprocedural dataflow analysis'', SCP 2005 ``Symbolic implementation of the best transformer'', VMCAI 2004 ``WYSINWYX: What You See Is Not What You eXecute'', VSTTE 2005 ``DIVINE: DIscovering Variables IN Executables'', VMCAI 2007 ``Reducing concurrent analysis under a context bound to sequential analysis'', FMSD 2009 ``Recency-abstraction for heap-allocated storage'', SAS 2006 [Back to the top] Categorized Index to Publications Program Slicing, Differencing, Merging, etc. Overview ``Program analysis via graph reachability'', IST (also ``Program analysis via graph reachability'', TR-1386, and ``Program analysis via graph reachability'', ILPS 97) ``The use of program dependence graphs in software engineering'' The Wisconsin Program-Slicing Tool The Wisconsin Program-Slicing Tool License for the Wisconsin Program-Slicing Tool ``The Wisconsin Program-Slicing Tool 1.0, Reference Manual'' Man page for the batch version of the Wisconsin Program-Slicing Tool CodeSurfer System Short description of the CodeSurfer system CodeSurfertm web page Slicing ``Specialization slicing'' ``Program specialization via program slicing'' ``Speeding up slicing'' ``Interprocedural slicing of computer programs using dependence graphs'' ``Multi-procedure program integration'' ``Efficient comparison of program slices'' ``Interprocedural slicing using dependence graphs'', TOPLAS 1990 (also ``Interprocedural slicing using dependence graphs'', PLDI 1988) Chopping ``Precise interprocedural chopping'' Differencing ``Identifying semantic differences in programs with procedures'' ``A new algorithm for semantics-based program integration'' Merging ``Program integration for languages with procedure calls'' ``A program integration algorithm that accommodates semantics-preserving transformations'', TOSEM 1992 (also ``A program integration algorithm that accommodates semantics-preserving transformations'', SIGSOFT 1990) ``Multi-procedure program integration'' ``A new algorithm for semantics-based program integration'' ``Illustrating interference in interfering versions of programs'' ``Integrating noninterfering versions of programs'', TOPLAS 1989 (also ``Integrating noninterfering versions of programs'', POPL 1988, ``Semantics-based program integration'', and ``Support for integrating program variants in an environment for programming in the large'') Algebra of slices (and applications to program merging) ``New programs from old'' ``Al",
  "content_length": 118345,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:53"
}