{
  "name": "Thomas Dandekar",
  "homepage": "https://www.biozentrum.uni-wuerzburg.de/bioinfo/research/groups/funct-genomics-systems-biology/people/thomas-dandekar",
  "status": "success",
  "content": "Thomas Dandekar - Chair of Bioinformatics Animation stoppen Chair of Bioinformatics Bioinformatik, Biozentrum, Am Hubland, D-97074 Universitaet Wuerzburg Tel.: +49 (0)931 31-84551, Fax: +49 (0)931 31-84552 Name: \tProf. Thomas Dandekar Born: \tJuly 23rd, 1960; Alpen/Moers, Germany (German citizen) Dept.: \tBioinformatics Address: \tBiocenter, Am Hubland \tUniversity of Würzburg \t97074 Würzburg, Germany Current position: \thead, dept. of bioinformatics (since Dec. 2001) \tmember of the board of directors of the Biocenter (since Feb. 2002) \t  Education \t1994        Habilitation in Biochemistry: University of Heidelberg \t1982-86  MD: Max Planck Institute of Psychiatry, Department of Neuropharmacology, Martinsried \t1979-86  Studies in Medicine: University of Munich \t  Professional Career and Research Experience \t2001-present    Full professor (C4), chair of Bioinformatics, Biocenter, University of Würzburg \t2000-01             Reader (AR) for Bioinformatics, Medical School Freiburg \t1988–present  Scientist at the European Molecular Biology Laboratory Heidelberg \t1987–1988       Postdoctoral Fellow, Institute Pasteur, Paris, France Honors and Awards \t\t10/2021-9/2025 vice-dean, faculty of biology \t\tSince 2019    Partner of the NFDI (Nationale Forschungsdaten Initiative) \t\t2018-2019     Advisor to the President of the DFG on Digitalization \t\t2017               Appointment as member of the priority inititative \"Digital Information\" of the Alliance  of Science Organisations in Germany \t\t2015-4/2025 Member of the Alexander v. Humboldt Foundation (Selection Board) \t\t2015               Emerging Technology Finalist Royal Society (Nanocellulose Chip) \t\t2009–2011   Dean, faculty of biology (2007-2009; 2011-2013 vice dean) \t\t2007               BMC Hot 100 Scientist Award for Top Open Access Publications \t\t2005–2007   Speaker of the Biocenter, University of Würzburg (2003-2005 vice-speaker) \t\t1989–1991   Boehringer Ingelheim Fellow Editorial Boards \t\t2015–present  Scientific Reports (Nature Publ.) \t\t2013–present  Frontiers in Synthetic Biology \t\t2013–present  Frontiers in Microbiology \t\t2013–present  Biology Direct \t\t2008–present  Associate Editor BMC Bioinformatics Publications Kontakt Lehrstuhl für Bioinformatik Am Hubland 97074 Würzburg Tel.: +49 931 31-84550 Fax: +49 931 31-84552 E-Mail Suche Ansprechperson Hubland Süd, Geb. B1 Hubland Nord, Geb. 32 Julius-von-Sachs-Platz 2 Fabrikschleichach Hubland Süd, Geb. B2 Campus Medizin StartseiteUniversitätStudiumForschungLehreEinrichtungenInternationalUniversitätFristen und TermineStudienangebotNachrichtenKarriereportalBeschäftigteVerwaltungsABCAmtliche VeröffentlichungenServiceUniversitätsbibliothekIT-DiensteHochschulsportStudienberatungPrüfungsamtStudierendenkanzleiStudierendenvertretungCareer CentreDiensteWueStudyWueCampusVorlesungsverzeichnisOnline-Bewerbung und Online-EinschreibungKatalog der BibliothekKontaktTelefon- und AdressverzeichnisStandorte und AnfahrtPresseStudienberatungStörungsannahmeTechnischer BetriebHilfe im Notfall Seitenoptionen Sitemap Bildnachweise Nach oben Letzte Änderung: 23.06.2025 Seite: 192990/128 Bildnachweise DatenschutzBarrierefreiheit",
  "content_length": 3146,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:27"
}