{
  "name": "Thomas A. Runkler",
  "homepage": "https://www7.in.tum.de/~runkler",
  "status": "success",
  "content": "TUM - Chair VII - Foundations of Software Reliability and Theoretical Computer Science Chair for Foundations of Software Reliability and Theoretical Computer Science Home Contact Teaching People professors secretaries scientific staff associate members sysadmins affiliated scientists affiliated students former staff former students Publications Student Projects Research Help People personal data Prof. Dr.-Ing.Thomas A. Runkler mail-address: Prof. Dr.-Ing. Thomas A. RunklerSiemens AGOtto-Hahn-Ring 681739 München / Germany phone:email:www: +49(89)636-633806thomas.runkler@siemens.comhttp://www.model.in.tum.de/~runkler/ CV: Thomas Runkler received his MS and PhD in electrical engineering from the Technical University of Darmstadt, Germany, in 1992 and 1995, respectively, and was a postdoctoral researcher at the University of West Florida from 1996-1997. He is teaching computer science at the Technical University of Munich, Germany, since 1999, and was appointed adjunct professor in 2011. Since 1997 he is working for Siemens in various expert and management functions, currently as a Senior Principal Research Scientist. Thomas authored and co-authored more than 200 scientific publications. His main research interests include machine learning, data analytics, pattern recognition, and optimization. He is speaker of the Fuzzy Systems and Soft Computing group of the German Association for Computer Science (GI), member of the IEEE CIS Strategic Planning Committee, member of the IEEE CIS Industry Liaison Committee, and member of the IEEE CIS Fuzzy Systems Technical Committee. Teaching: Data Mining and Knowledge Discovery Some recent publications: T. A. Runkler: Data Analytics - Models and Algorithms for Intelligent Data Analysis, third edition, Springer 2020 T. A. Runkler: Sequential Cluster Estimation: A Generalized Model for Finding Large Numbers of Clusters in Data, IEEE Systems, Man, and Cybernetics Magazine 6(2):6-9 (2020) T. A. Runkler: PrefMap: Visualization of Fuzzy Pairwise Preference Structures, Journal of Intelligent and Fuzzy Systems (2020) M. Kaiser, C. Otte, T. A. Runkler, C. H. Ek: Bayesian Decomposition of Multi-Modal Dynamical Systems for Reinforcement Learning, Neurocomputing (2020) M. Kaiser, C. Otte, T. A. Runkler, C. H. Ek: Data Association with Gaussian Processes, European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases 2019, 548-564 P. Gupta, S. Rajaram, H. Schütze, T. A. Runkler: Neural Relation Extraction Within and Across Sentence Boundaries, AAAI Conference on Artificial Intelligence 2019, 6513-6520 T. A. Runkler: Canonical Fuzzy Preference Relations, International Fuzzy Systems Association World Congress 2019, 542-555 M. Kaiser, C. Otte, T. A. Runkler, C. H. Ek: Bayesian Alignments of Warped Multi-Output Gaussian Processes, Advances in Neural Information Processing Systems 31 (NIPS 2018), 6995-7004 M. Hildebrandt, S. S. Sunder, S. Mogoreanu, I. Thon, V. Tresp, T. A. Runkler: Configuration of Industrial Automation Solutions Using Multi-Relational Recommender Systems, Joint European Conference on Machine Learning and Knowledge Discovery in Databases 2018, 271--287 D. Hein, S. Udluft, T. A. Runkler: Interpretable Policies for Reinforcement Learning by Genetic Programming, Engineering Applications of Artificial Intelligence 76:158-169 (2018) T. A. Runkler, C. Chen, R. John: Type Reduction Operators for Interval Type-2 Defuzzification, Information Sciences 267C:464-476 (2018) T. A. Runkler: Mapping Utilities to Transitive Preferences, International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems 2018, 127-139 D. Hein, A. Hentschel, T. Runkler, S. Udluft: Particle Swarm Optimization for Generating Interpretable Fuzzy Reinforcement Learning Policies, Engineering Applications of Artificial Intelligence 65:87-98 (2017) D. Hein, S. Depeweg, M. Tokic, S. Udluft, A. Hentschel, T. A. Runkler, V. Sterzing: A Benchmark Environment Motivated by Industrial Control Problems, IEEE Symposium Series on Computational Intelligence 2017 G. Mehdi, E. Kharlamov, O. Savković, G. Xiao, E. G. Kalaycı, S. Brandt, I. Horrocks, M. Roshchin, T. Runkler: Semantic Rule-Based Equipment Diagnostics, International Semantic Web Conference 2017, 314-333 T. A. Runkler, J. M. Keller: Sequential Possibilistic One-Means Clustering, IEEE International Conference on Fuzzy Systems 2017 T. A. Runkler, S. Coupland, R. John: Interval Type-2 Fuzzy Decision Making, International Journal of Approximate Reasoning 80:217-224 (2017) J. C. Bezdek, M. Moshtaghi, T. A. Runkler, C. Leckie: The Generalized C Index for (Internal) Fuzzy Cluster Validity, IEEE Transactions on Fuzzy Systems 24(6):1500-1512 (2016) D. Hein, A. Hentschel, T. A. Runkler, S. Udluft: Reinforcement Learning with Particle Swarm Optimization Policy (PSO-P) in Continuous State and Action Spaces, International Journal of Swarm Intelligence Research 7(3):23-42 (2016) T. A. Runkler: Generation of Linguistic Membership Functions From Word Vectors, IEEE International Conference on Fuzzy Systems 2016 T. A. Runkler: Constructing Preference Relations from Utilities and Vice Versa, International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems 2016 J. Kroß, A. Brunnert, C. Prehofer, T. A. Runkler, H. Krcmar: Stream Processing on Demand for Lambda Architectures, European Workshop on Performance Engineering 2015 T. A. Runkler, S. Coupland, R. John: Properties of Interval Type-2 Defuzzification Operators, IEEE International Conference on Fuzzy Systems 2015 T. A. Runkler, V. Ravindra: Fuzzy Graph Clustering Based on Non-Euclidean Relational Fuzzy c-Means, Joint IFSA World Congress and EUSFLAT Conference 2015 J. Kroß, A. Brunnert, C. Prehofer, T. A. Runkler, H. Krcmar: Model-based Performance Evaluation of Large-Scale Smart Metering Architectures, International Workshop on Large-Scale Testing 2015 S. Spieckermann, S. Udluft, T. A. Runkler: Data-Efficient Temporal Regression with Multi-Task Recurrent Neural Networks, NIPS 2015 Workshop on Transfer and Multi-Task Learning T. A. Runkler, J. C. Bezdek: Multidimensional Scaling with Multiswarming, IEEE Congress on Evolutionary Computation 2014 S. Grimm, T. Hubauer, T. A. Runkler, C. Pachajoa, F. Rempe, M. Seravalli, P. Neumann: A CEP Technology Stack for Situation Recognition on the Gumstix Embedded Controller, INFORMATIK 2013, International Workshop on Applications of Semantic Technologies T. A. Runkler, J. C. Bezdek: Topology Preserving Feature Extraction with Multiswarm Optimization, IEEE International Conference on Systems, Man, and Cybernetics 2013 H.-G. Zimmermann, C. Tietz, R. Grothmann, T. A. Runkler: Recurrent Neural Networks for Industrial Procurement Decisions, Künstliche Intelligenz 26(4): 403-406 (2012) T. A. Runkler, R. Sollacher, A. Szabo: Learning and Self-Organization for Spatiotemporal Systems, Künstliche Intelligenz 26(3): 269-274 (2012) T. A. Runkler, J. M. Keller: Fuzzy Approaches To Hard c-Means Clustering, IEEE World Congress on Computational Intelligence 2012 A. Flexeder, M. Putz, T. A. Runkler: Support Vector Machines for Program Analysis, IEEE World Congress on Computational Intelligence 2012 T. A. Runkler: Controlling Discrete Manufacturing Processes Using Kanban and Heijunka Approaches, IEEE International Conference on Industrial Informatics 2011 T. A. Runkler: Partially Supervised k-Harmonic Means Clustering, IEEE Symposium on Computational Intelligence and Data Mining 2011 Thomas Runkler's publications on Google Scholar",
  "content_length": 7585,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:16"
}