{
  "name": "Thomas Wies",
  "homepage": "http://cs.nyu.edu/wies",
  "status": "success",
  "content": "Thomas Wies: Homepage New York University COURANT - Computer Science I am a Professor of Computer Science at the Courant Institute of New York University and a member of the Analysis of Computer Systems Group. See my curriculum vitae for further details. I presently serve as Chair of the Computer Science Department. Contact wies at cs.nyu.edu +1 (212) 998 3293 60 Fifth Avenue Room 403 New York, NY 10011 Group Members Faculty Fellows Elaine Li Ph.D. Students Devora Chait-Roth Ekanshdeep Gupta Jacob Salzberg (co-advisor) Group Alumni Kshitij Bansal (co-advisor) Siddharth Krishna Chanseok Oh Zvonimir Pavlinovic Nisarg Patel Daniel Schwartz-Narbonne Yan Shvartzshnaider Wei Wang (co-advisor) Sebastian Wolff I am a Professor of Computer Science at the Courant Institute of New York University and a member of the Analysis of Computer Systems Group. See my curriculum vitae for further details. I presently serve as Chair of the Computer Science Department. Research My research focuses on program analysis and verification, automated deduction, and concurrency. Selected Publications Consistent Updates for Scalable Microservices D. Chait-Roth, K.S. Namjoshi, and T. Wies To appear in PACMPL, 10(Principles of Programming Languages (POPL)), 2026 The Privacy Quagmire: Bridging Computer Science and Legal Nuance pdf Y. Zhao, V. Chandrasekaran, T. Wies, and L. Subramanian In Proceedings of ACM Workshop on Hot Topics in Networks (HOTNETS), 2025 Abstract Interpretation of Temporal Safety Effects of Higher Order Programs pdf M. Nicola, C. Agarwal, E. Koskinen, and T. Wies PACMPL, 9(Object-oriented Programming, Systems, Languages, and Applications (OOPSLA)), 2025 Characterizing Implementability of Global Protocols with Infinite States and Data pdf E. Li, F. Stutz, T. Wies, and D. Zufferey PACMPL, 9(Object-oriented Programming, Systems, Languages, and Applications (OOPSLA)), 2025 Certified Implementability of Global Multiparty Protocols pdf E. Li and T. Wies In Proceedings of Interactive Theorem Proving (ITP), 2025 Raven: An SMT-Based Concurrency Verifier pdf E. Gupta, N. Patel, and T. Wies In Proceedings of Computer Aided Verification (CAV), 2025 Sprout: A Verifier for Symbolic Multiparty Protocols pdf E. Li, F. Stutz, T. Wies, and D. Zufferey In Proceedings of Computer Aided Verification (CAV), 2025 Arithmetizing Shape Analysis pdf S. Wolff, E. Gupta, Z. Esen, H. Hojjat, P. R체mmer, and T. Wies In Proceedings of Computer Aided Verification (CAV), 2025 Verifying Lock-free Search Structure Templates pdf N. Patel, D. Shasha, and T. Wies In Proceedings of European Conference on Object-Oriented Programming (ECOOP), 2024 Less is more: refinement proofs for probabilistic proofs pdf K. Jiang, D. Chait-Roth, Z. DeStefano, M. Walfish, and T. Wies In Proceedings of IEEE Symposium on Security and Privacy (IEEE S&P), 2023 Embedding Hindsight Reasoning in Separation Logic pdf R. Meyer, T. Wies, and S. Wolff PACMPL, 7(Programming Language Design and Implementation (PLDI)), 2023 Make flows small again: revisiting the flow framework pdf R. Meyer, T. Wies, and S. Wolff In Proceedings of Tools and Algorithms for the Construction and Analysis of Systems (TACAS), 2023 A Concurrent Program Logic with a Future and History pdf R. Meyer, T. Wies, and S. Wolff PACMPL, 6(Object-oriented Programming, Systems, Languages, and Applications (OOPSLA)), 2022 Inverse-Weighted Survival Games pdf M. Goldstein, X. Han, A.M. Puli, T. Wies, A.J. Perotte, and R. Ranganath In Proceedings of Conference on Neural Information Processing Systems (NeurIPS), 2021 Automated Verification of Concurrent Search Structures pdf S. Krishna, N. Patel, D. Shasha, and T. Wies Morgan & Claypool Publishers, 2021 Automating Separation Logic using SMT pdf R. Piskac, T. Wies, and D. Zufferey In Proceedings of Computer Aided Verification (CAV), 2013 Complete list of publications Selected Invited Talks and Lectures International Conference on Concurrency Theory, Calgary, Canada, September 2024 Eleventh Summer School on Formal Techniques, Menlo Park, CA, USA, June 2022 Simons Institute Seminar on \"Theoretical Foundations of Computer Systems\", February 2021 Effective Verification: Static Analysis Meets Program Logics, Leiden, Netherlands, May 2019. 16th International Workshop on Satisfiability Modulo Theories, Oxford, UK, July 2018. Summer School on Verification Technology, Systems, & Applications, Saarbr체cken, Germany, July-August 2017. International Summer School on Satisfiability, Satisfiability Modulo Theories, and Automated Reasoning, Lisbon, Portugal, June 2016. International Conference on Verification, Model Checking, and Abstract Interpretation, San Diego, CA, USA, January 2014. Tools As a byproduct of my research, I have developed and contributed to a number of tools. Raven A deductive verifier for concurrent programs based on concurrent separation logic. GRASShopper A verification tool that checks functional correctness of programs manipulating heap-allocated data structures. Vermeer An automated debugging tool that traces and explains faults in C programs. Picasso A static analyzer for depth-bounded concurrent systems. It has been used to verify properties of non-blocking concurrent data structures and distributed message passing algorithms with an unbounded number of threads and messages. Teaching Principles of Programming Languages (undergraduate) Fall 2023 Fall 2021 Fall 2016 Fall 2015 Spring 2015 Programming Languages (graduate) Fall 2022 Spring 2019 Fall 2018 Fall 2012 Computer Systems Organization (undergraduate) Fall 2019 Object-Oriented Programming (graduate) Spring 2018 Object-Oriented Programming (undergraduate) Fall 2017 Spring 2017 Fall 2013 Rigorous Software Development (graduate) Spring 2016 Spring 2013 Spring 2012 Programming Paradigms for Concurrency (graduate) Spring 2014 Professional Activities Organizer Co-organizer of VerifyThis 2025 Program co-chair of NETYS 2023 Program chair of ESOP 2023 Program co-chair of VMCAI 2022 Fellowship chair of CAV 2021 Fellowship chair of CAV 2020 Program co-chair of SYNT 2019 Fellowship chair of CAV 2019 Program co-chair of VSTTE 2017 Program chair of TAPAS 2017 Program co-chair of WING 2012 Program Committee Member VMCAI 2026 POPL 2024, FMCAD 2024 IEEE S&P 2023 PLDI 2022 FMCAD 2021, VSTTE 2021 POPL 2020, VMCAI 2020, ADSL 2020, NETYS 2020, VSTTE 2020, VDS 2020 (co-chair) TACAS 2019, SYNT 2019 (co-chair) CAV 2018, TACAS 2018, VMCAI 2018, VSTTE 2018, ADSL 2018 ECOOP 2017, TACAS 2017, TMPA 2017, VSTTE 2017 (co-chair), CREST 2017, CONCUR 2017, Onward! 2017, TAPAS 2017 (chair) POPL 2016 (ERC), VMCAI 2016, CAV 2016 VMCAI 2015 POPL 2014, SMT 2014, FOOL 2014 VSTTE 2013 WING 2012 (co-chair), BOOGIE 2012, FTfJP 2012, SAS 2012, VSTTE 2012 WING 2010 WING 2009 Publications See also my DBLP entry for a complete list of my publications. Books Automated Verification of Concurrent Search Structures pdf S. Krishna, N. Patel, D. Shasha, and T. Wies Morgan & Claypool Publishers, 2021 In Journals Consistent Updates for Scalable Microservices D. Chait-Roth, K.S. Namjoshi, and T. Wies To appear in PACMPL, 10(Principles of Programming Languages (POPL)), 2026 Abstract Interpretation of Temporal Safety Effects of Higher Order Programs pdf M. Nicola, C. Agarwal, E. Koskinen, and T. Wies PACMPL, 9(Object-oriented Programming, Systems, Languages, and Applications (OOPSLA)), 2025 Characterizing Implementability of Global Protocols with Infinite States and Data pdf E. Li, F. Stutz, T. Wies, and D. Zufferey PACMPL, 9(Object-oriented Programming, Systems, Languages, and Applications (OOPSLA)), 2025 Embedding Hindsight Reasoning in Separation Logic pdf R. Meyer, T. Wies, and S. Wolff PACMPL, 7(Programming Language Design and Implementation (PLDI)), 2023 A Concurrent Program Logic with a Future and History pdf R. Meyer, T. Wies, and S. Wolff PACMPL, 6(Object-oriented Programming, Systems, Languages, and Applications (OOPSLA)), 2022 Verifying Concurrent Multicopy Search Structures pdf N. Patel, S. Krishna, D. Shasha, and T. Wies PACMPL, 5(Object-oriented Programming, Systems, Languages, and Applications (OOPSLA)), 2021 Dataflow Refinement Type Inference pdf talk Z. Pavlinovic, Y. Su, and T. Wies PACMPL, 5(ACM Symposium on the Principles of Programming Languages (POPL)), 2021 Go with the Flow: Compositional Abstractions for Concurrent Data Structures pdf S. Krishna, D. Shasha, and T. Wies PACMPL, 2(ACM Symposium on the Principles of Programming Languages (POPL)), 2018 Complete Instantiation-Based Interpolation pdf N. Totla and T. Wies Journal of Automated Reasoning, 57(1), 2016 Preface - Invariant Generation pdf G. Grov and T. Wies Science of Computer Programming (SCICO), 93, 2014 Doomed Program Points pdf J. Hoenicke, K.R.M. Leino, A. Podelski, M. Sch채f, and T. Wies Formal Methods in System Design (FMSD), 37(2-3), 2010 In Conferences The Privacy Quagmire: Bridging Computer Science and Legal Nuance pdf Y. Zhao, V. Chandrasekaran, T. Wies, and L. Subramanian In Proceedings of ACM Workshop on Hot Topics in Networks (HOTNETS), 2025 Certified Implementability of Global Multiparty Protocols pdf E. Li and T. Wies In Proceedings of Interactive Theorem Proving (ITP), 2025 Raven: An SMT-Based Concurrency Verifier pdf E. Gupta, N. Patel, and T. Wies In Proceedings of Computer Aided Verification (CAV), 2025 Sprout: A Verifier for Symbolic Multiparty Protocols pdf E. Li, F. Stutz, T. Wies, and D. Zufferey In Proceedings of Computer Aided Verification (CAV), 2025 Arithmetizing Shape Analysis pdf S. Wolff, E. Gupta, Z. Esen, H. Hojjat, P. R체mmer, and T. Wies In Proceedings of Computer Aided Verification (CAV), 2025 Verifying Lock-free Search Structure Templates pdf N. Patel, D. Shasha, and T. Wies In Proceedings of European Conference on Object-Oriented Programming (ECOOP), 2024 Deciding Subtyping for Asynchronous Multiparty Sessions pdf E. Li, F. Stutz, and T. Wies In Proceedings of European Symposium on Programming (ESOP), 2024 Complete Multiparty Session Type Projection with Automata ",
  "content_length": 21879,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:11"
}