{
  "name": "Thomas Heinis",
  "homepage": "http://wp.doc.ic.ac.uk/theinis",
  "status": "success",
  "content": "Thomas Heinis | Professor in Computing Department of Computing Distributed Software Engineering Thomas Heinis Professor in Computing About Me I am a Professor in Computing at Imperial College where I lead the SCALE Lab – check it out here and also lead research in DNA data storage – see here for more details. My research focuses on the management and processing of data in general and HPC data analytics, data visualisation, spatial data, indexing, new hardware for data processing and novel storage technology. I hold a Ph.D. and a M.Sc. in Computer Science, both from the Swiss Federal Institute of Technology in Zürich (ETH Zürich), and was a Postdoctoral fellow in the DIAS Lab at EPFL. In 2004 I was awarded a Fulbright scholarship to visit Purdue University. Tackling Data Challenges My current research revolves around developing novel data management algorithms for querying and analyzing big data. The unprecedented size and growth of datasets makes analyzing them a challenging data management problem. Current algorithms are not efficient for today’s data and will not scale to analyze the rapidly growing datasets of the future. I therefore want to develop next generation data management tools and techniques able to manage tomorrow’s data, thereby putting efficient and scalable big data analytics at the fingertips of users so they can again focus on their work, unperturbed by the challenges of big data. More specifically, my research focuses on all challenges around data. I am particularly interested in high performance data analytics (i.e., data analytics on HPC infrastructure), indexing and analysing spatial and geographical data, data visualisation on new user interfaces, data processing on novel hardware and new storage technology (DNA data storage and data processing). I am also interested in particular applications for data analytics and storage. These entail medical applications – we recently published a book about this (check it out on Amazon), spatial and geographical applications as well as generally scientific data and applications. During my Ph.D. my research focused on developing tools to process big scientific data. Only with a massive scale-out, i.e., through distributing computations in a cluster, can scientific data be processed and queried on a massive scale. I consequently conceived algorithms and developed tools to process data distributed in a cluster or the cloud. The results are available in my dissertation. Research Interests My research interests broadly touch the following subjects: Big Data, Distributed Processing Scientific Data Management, Spatial Data, Spatial Indexing Data Analytics, High Performance Data Analytics Data Management on Novel Hardware Novel Storage Technology, DNA Storage and Data Processing We are hiring! We are currently looking to find junior researchers interested to complete a Ph.D. in the broadly defined area of scientific data management. If interested, please check out the jobs page. Print Email to a Friend Email to a Friend Page URL: http://wp.doc.ic.ac.uk/theinis/ Your Information: Your Name Your Email Friend’s Information: Friend’s Name Friend’s Email Close Login Main campus address: Imperial College London, South Kensington Campus, London SW7 2AZ, tel: +44 (0)20 7589 5111 Campus maps and information About this site This site uses cookies © Copyright 2014 – Imperial College London",
  "content_length": 3393,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:35"
}