{
  "name": "Thomas C. Nicholas Graham",
  "homepage": "http://www.cs.queensu.ca/~graham",
  "status": "success",
  "content": "T.C. Nicholas (Nick) Graham's Home Page T.C. Nicholas Graham School of Computing Queen's University Kingston, Ontario Canada K7L 3N6 Goodwin Hall, Room 629 Phone: (613) 533-6526 Fax: (613) 533-6513 nicholas.graham@queensu.ca [ Research | Publications | Teaching | Personal | Equis Lab ] Research My research concentrates on the technology underlying the design and development of the next generation of digital game. Current projects related to this work include: Computer-Aided Exercise: looking at how digital games can increase enjoyment of physical exercise. Game networking: focusing on novel techniques for specifying networking and consistency algorithms in distributed games. Simulation Games examining how gaming technology can improve simulation-based training. For more information, see the EQUIS Lab home page. I am director of the EQUIS lab and member of the Software Technology Laboratory. These students are current and past members of the group. I am a member and former Chair of IFIP Working Group 2.7 on User Interface Engineering. Teaching In Fall 2012, I am teaching: CISC 326: Game Architecture CISC 877: Developing Digital Games In Winter 2013, I am teaching: CISC 226: Game Design Personal I am a Professor of Computer Science at Queen's University.  I received the Doctorate of Engineering (Dr.-Ing.) degree from the T.U. Berlin in 1995. I performed most of my thesis work at the GMD in Karlsruhe, Germany. I hold an M.Sc. from Queen's University (1988) and a B.Sc. from the University of Toronto (1985). I have worked on the Turing project as a Computer Systems Programmer at the Computer Systems Research Institute (1985-86), as a Research Associate on the Nial project at Queen's University (1988-89), as a Visiting Researcher at the GMD (1989-92), as an Assistant Professor at York University (1993-1997) and as VP Research and Development at Namzak Labs (2000-present.) I was born in Dundee (Scotland), and have since lived in Kingston (Jamaica), Toronto (Canada), Kingston (Canada), Karlsruhe (Germany), Trondheim (Norway) and Grenoble (France). [ Research | Publications | Teaching | Personal | Equis Lab ]",
  "content_length": 2137,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:24"
}