{
  "name": "Thomas Griffiths 0001",
  "homepage": "https://cocosci.princeton.edu/tom/index.php",
  "status": "success",
  "content": "Computational Cognitive Science Lab - Tom Griffiths Home | Research | People | Publications | Resources | Participate Tom Griffiths Professor of Psychology and Computer Science I am the Director of the Computational Cognitive Science Lab, a research group focused on understanding the mathematical foundations of human cognition, and the Princeton Laboratory for Artificial Intelligence, a new effort that supports innovative research efforts in AI and related fields. I work with graduate students in Psychology, Computer Science, and Neuroscience, as well as other units on campus. Here is a reasonably up-to-date curriculum vitae. Research interests As machines become increasingly capable of doing things that previously only humans could do, it's natural to ask what makes human intelligence special. My research aims to develop mathematical models of human cognition, with a particular focus on the aspects of human minds that are meaningfully different from modern AI systems. One way to think about those differences is in terms of the kinds of computational problems that human minds have to solve, and in particular the limitations that shape those problems. Humans have limited time (we have finite lives), limited computational resources (just our brains), and limited bandwidth for communication (we can't transfer our brain-states to others). These limitations define a set of human-scale computational problems, and lead to the distinctive characteristics of human intelligence: we can learn from small amounts of data, we make efficient use of our cognitive resources, and we develop strategies and protocols for working together to try to overcome those constraints. Human minds do more with less, and understanding these abilities requires a particular set of mathematical tools, as outlined below. The insights we get from studying human minds in this way feed back into creating machines that come closer to human intelligence. Representative publications A full list of academic publications is available chronologically and by topic or from Google Scholar. The general approach of my lab is summarized in this paper: Griffiths, T. L. (2020). Understanding human intelligence via human limitations. Trends in Cognitive Sciences, 24(11), 873-883. (pdf) To understand how people learn from small amounts of data, we use ideas from Bayesian statistics to characterize human inductive biases. This approach is presented in the book Bayesian models of cognition. We have recently been exploring how to give similar abilities to machines using metalearning, as outlined in these papers: Grant, E., Finn, C., Levine, S., Darrell, T., & Griffiths, T. L. (2018). Recasting gradient-based meta-learning as hierarchical Bayes. In Proceedings of the 6th International Conference on Learning Representations (ICLR). (pdf) Griffiths, T. L., Callaway, F., Chang, M. B., Grant, E., Krueger, P. M., & Lieder, F. (2019). Doing more with less: meta-reasoning and meta-learning in humans and machines. Current Opinion in Behavioral Sciences, 29, 24-30. (pdf) McCoy, R. T., & Griffiths, T. L. (2023). Modeling rapid language learning by distilling Bayesian priors into artificial neural networks. (preprint) Ideas that come from creating Bayesian models of human cognition are also useful for making sense of the behavior of intelligent machines, such as large language models. This perspective is described in these papers: McCoy, R. T., Yao, S., Friedman, D., Hardy, M., & Griffiths, T. L. (2023). Embers of autoregression: Understanding large language models through the problem they are trained to solve. (preprint) Griffiths, T. L., Zhu, J. Q., Grant, E., & McCoy, R. T. (2023). Bayes in the age of intelligent machines. (preprint) To understand how people make good use of limited cognitive resources, we developed an approach called resource rational analysis which formulates good reasoning as an optimization problem and solves that problem using tools from machine learning and AI as a source of models of human behavior. This approach is summarized in: Lieder, F., & Griffiths, T. L. (2020). Resource-rational analysis: Understanding human cognition as the optimal use of limited computational resources. Behavioral and Brain Sciences, 43, e1. (pdf) (Response to Commentaries) Other papers on this topic are collected here. The spirit of this approach also underlies the general-audience book Algorithms to Live By, which outlines efficient and practical strategies for making decisions that arise in everyday life. Having better tools for understanding human errors can also lead to new ways to improve human decisions: Lieder, F., Chen, O. X., Krueger, P. M., & Griffiths, T. L. (2019). Cognitive prostheses for goal achievement. Nature Human Behaviour, 3(10), 1096-1106. (pdf) Callaway, F., Hardy, M., & Griffiths, T. L. (2023). Optimal nudging for cognitively bounded agents: A framework for modeling, predicting, and controlling the effects of choice architectures. Psychological Review. (preprint) To understand how people combine data and cognitive resources across minds, we study cultural evolution and language. Our work on cultural evolution uses a combination of theoretical analysis and large-scale behavioral experiments simulating evolutionary processes, as illustrated by these papers: Griffiths, T. L., Kalish, M. L., & Lewandowsky, S. (2008). Theoretical and experimental evidence for the impact of inductive biases on cultural evolution. Philosophical Transactions of the Royal Society, 363, 3503-3514. (pdf) Hardy, M. D., Thompson, B., Krafft, P. M., & Griffiths, T. L. (2023). Resampling reduces bias amplification in experimental social networks. Nature Human Behavior, 7, 2084-2098. (pdf) Thompson, B., van Opheusden, B., Sumers, T., & Griffiths, T. L. (2022). Complex cognitive algorithms preserved by selective social learning in experimental populations. Science, 376(6588), 95-98. (pdf) Recently we have been exploring how ideas from distributed computer systems can be used as a theoretical framework for understanding human collaboration, as outlined in this paper: Vélez, N., Christian, B., Hardy, M., Thompson, B. D., & Griffiths, T. L. (2023). How do humans overcome individual computational limitations by working together? Cognitive Science, 47(1), e13232. (pdf) I am also interested in how access to increasing amounts of behavioral data can change psychological research, as outlined in these papers: Griffiths, T. L. (2015). Manifesto for a new (computational) cognitive revolution. Cognition, 135, 21-23. (pdf) Almaatouq, A., Griffiths, T. L., Suchow, J. W., Whiting, M. E., Evans, J., Watts, D. J. Beyond playing 20 questions with nature: Integrative experiment design in the social and behavioral sciences. Behavioral and Brain Sciences. (pdf) Some demonstrations of the power of bigger datasets are provided by these papers: Agrawal, M., Peterson, J. C., & Griffiths, T. L. (2020). Scaling up psychology via Scientific Regret Minimization. Proceedings of the National Academy of Sciences. (pdf) Battleday, R. M., Peterson, J. C., & Griffiths, T. L. (2020). Capturing human categorization of natural images by combining deep networks and cognitive models. Nature Communications, 11(1), 1-14. (pdf) Peterson, J. C., Bourgin, D., Agrawal, M., Reichman, D., & Griffiths, T. (2021). Using large-scale experiments and machine learning to discover theories of human decision-making. Science, 372(6547), 1209-1214. (pdf) © 2025 Computational Cognitive Science Lab  |  Department of Psychology  |  Princeton University",
  "content_length": 7561,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:32"
}