{
  "name": "Thomas H. W. Bäck",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/thomas-back#tab-2",
  "status": "success",
  "content": "Thomas Bäck - Leiden University Skip to main content Thomas Bäck Professor of Natural Computing artificial intelligence evolutionary computation explainable artificial intelligence health machine learning multiple criteria decision making optimization predictive maintenance smart industry sustainable production Name Prof.dr. T.H.W. Bäck Telephone +31 71 527 7108 E-mail t.h.w.baeck@liacs.leidenuniv.nl ORCID iD 0000-0001-6768-1478 Thomas Bäck (Fellow, IEEE) received the Diploma degree in Computer Science in 1990 and the Ph.D. degree in Computer Science in 1994, both from the University of Dortmund, Germany. He is Professor of Computer Science with the Leiden Institute of Advanced Computer Science (LIACS), Leiden University, Netherlands. His research interests include evolutionary computation, machine learning, and their real-world applications, especially in sustainable smart industry and health. He is also a member of the interdisciplinary programme Society, Artificial Intelligence and Life Sciences (SAILS). More information about Thomas Bäck PhD Candidates Zhengtian Ai PhD candidate / guest Marie Anastacio PhD candidate Kirill Antonov PhD candidate Mathieu Cherpitel PhD candidate Inês Isabel Correia Gomes PhD candidate / guest Linus Ekstrøm Self Funded PhD Candidate / Guest Sebastian Ellmaier PhD candidate / self funded Lucas Ferreira Correia Guest PhD candidate / Self Funded Qi Huang PhD candidate Zhuang Kang PhD candidate Wei Liu Contract PhD Candidate / Guest Jacob de Nobel Postdoc Shuaiqun Pan PhD candidate / self funded Yash Patel Postdoc Ksenia Pereverdieva PhD candidate Sander van Rijn PhD candidate Waheeda Saib PhD candidate Roberta Tamponi PhD candidate Diederick Vermetten Postdoc Maarten Vonk PhD Candidate / Self Funded Annie Wong PhD Candidate / Guest Furong Ye Postdoc Haoran Yin PhD candidate / contract News 03 September 2025 Two young researchers win Krijn Rietveld Award for innovative research on blood donation and colorectal cancer 12 August 2025 Award for a method that can create even better algorithms 01 August 2025 New project explores how engineers and AI can truly work together 07 October 2024 Better ship designs thanks to smart algorithms 19 September 2024 Largest research project on sustainable hydrogen production kicks off 13 June 2024 Arteriosclerosis and drug discovery: two young researchers win Krijn Rietveld Award for innovative research 02 November 2023 Thomas Bäck and Hao Wang new Editors in chief of the Evolutionary Computation Journal 11 April 2023 Leiden University hosts conference uniting 80 world-class scientists 30 November 2021 Thomas Bäck appointed to IEEE Fellow 05 October 2021 Quantum Leiden creates potential for a great quantum future 13 September 2021 New lecture series: Joint Lectures on Evolutionary Algorithms (JoLEA) 31 May 2021 AI in port and maritime research in Leiden, Delft and Rotterdam 06 May 2021 PROACT project improves security of Internet of Things devices 28 April 2021 Seven Leiden professors elected new members of KNAW 22 April 2021 TEMPORAL project helps improving hearing of the deaf 09 November 2020 Technique from new cars helps with surgery selection Parkinson's disease 05 October 2020 LIACS part of European consortium to boost industrial quantum computing 08 April 2020 Hora est through a computer speaker: Leiden’s first fully online PhD defence 30 August 2019 Gravitation Grant for innovative outlook on the social and ethical challenges of new technology 14 November 2018 Algorithm Data Science student designs best ship in less time 16 September 2018 PhD on research on an industrial production process 24 March 2017 New project on maintenance prediction for industries 26 January 2017 Unexpected data are good for business 19 December 2016 'Leiden' awarded for computational intelligence 02 October 2016 Multiple-criteria landscapes with valleys and hills 30 November 2015 Annual Business Event 2015 16 January 2015 Thomas Bäck holds Cleveringa lecture in Calgary, Canada 07 November 2014 Thomas Bäck wint IEEE Award 30 October 2014 LIACS receives NWO grant in Challenging Big Data program See also Personal website Books Handbook of Natural Computing Former PhD candidates Samineh Bagheri Koen van der Blom Ron Breukelaar Martina Echtenbruck Ramin Etemadi Idgahi Daniel Gaida Theodoros Georgiou Alexander Hagg Marios Kefalas Nataša Kieft Milan Koch Patrick Koch Jiawen Kong Johannes Willem Kruisselbrink Zhong Li Rui Li Hugo Manuel Proença S.C. Marshall Ingo Matthias Asep Maulana Dirk Meijer Charles Moussa Duc Anh Nguyen Edgar Julius Jeronimus Reehuis Ofer Michael Shir Andrea Skolik Mozhan Soltani Bas van Stein André Thomaser Mohamed Tleis Sibghat Ullah Diederick Vermetten Yali Wang Hao Wang Roy de Winter Kaifeng Yang Zhiwei Yang Sheir Yarkoni Thiago de Jesus de Araujo Rio External PhD Candidates Anna van Oosterzee Thomas Bäck (Fellow, IEEE) received the Diploma degree in Computer Science in 1990 and the Ph.D. degree in Computer Science in 1994, both from the University of Dortmund, Germany. He is Professor of Computer Science with the Leiden Institute of Advanced Computer Science (LIACS), Leiden University, Netherlands. His research interests include evolutionary computation, machine learning, and their real-world applications, especially in sustainable smart industry and health. In 2021, Dr. Bäck has been elected as member of the Royal Netherlands Academy of Arts and Sciences (KNAW) and as IEEE Fellow (class of 2022). He was a recipient of the IEEE Computational Intelligence Society (CIS) Evolutionary Computation Pioneer Award in 2015, was elected as Fellow of the International Society of Genetic and Evolutionary Computation in 2003, and received the best Ph.D. thesis award from the German society of Computer Science (GI) in 1995. He currently serves as an Associate Editor for the IEEE Transactions on Evolutionary Computation and Artificial Intelligence Review journals and area editor for the ACM Transactions on Evolutionary Learning and Optimization. He is editorial board member of the Natural Computing Journal (Springer), Artificial Intelligence Journal, and Journal of Intelligent Manufacturing (Springer). He is also co-editor-in-chief of the Handbook of Evolutionary Computation (CRC Press/Taylor & Francis 1997), co-editor of the Handbook of Natural Computing (Springer, 2013), co-editor of the Natural Computing Book Series (Springer), author of Evolutionary Computation in Theory and Practice (OUP, New York, 1996) and co-author of Contemporary Evolution Strategies (Springer, 2013). Thomas has a strong interest in real-world applications of his research. In his research projects, he collaborates with many companies, including e.g. ASML, BMW Group, C-Job Naval Engineers, Heerema, Honda Research Institute Europe GmbH, KLM, Mercedes-Benz, TataSteel Europe. Professor of Natural Computing Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact +31 71 527 7108 t.h.w.baeck@liacs.leidenuniv.nl Publications International Artificial Intelligence and Quantum Technology (AIQT) Foundation Member of foundation advisory board and executive board NORCE Scientific research DIVIS Scientific research consulting, CEO DIVIS Directeur Share on Facebook Share by Bluesky Share on LinkedIn Share by WhatsApp Share by Mastodon Research Algorithms and Software Technology Organisation Science Leiden Institute of Advanced Computer Science (LIACS) Human AI Natural Computing and Optimization Visit our website! Smart searching in data Research in the spotlight This website uses cookies. More information. Accept cookies Reject cookies",
  "content_length": 7660,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:35"
}