{
  "name": "Thomas Eisenbarth 0001",
  "homepage": "https://www.its.uni-luebeck.de/mitarbeiterinnen/thomas-eisenbarth.html",
  "status": "success",
  "content": "Thomas Eisenbarth: Institut: ITS Zur Navigation springenZum Content springenAktuelles | Impressum | Datenschutz | English InstitutMitarbeiter*innenThomas EisenbarthEsfandiar MohammadiSebastian BerndtPaula ArnoldJoseph BienhülsJeremy BoyTill EifertMohamed ElGhamrawyTim GellersenJonah HellerKristoffer HempelEike HoffmannTimothy ImortMoritz KirschteNiklas KlingerMarven KummerfeldtJohannes LiebenowNils LooseFelix MächtleFelix MaurerSebastian MeiserAkhil NarahariAnna PätschkePajam PaulsThorsten PeinemannChristopher PeredyMarcel PflaegingTammo PolleClaudius PottAnja RabichJonas SanderInes SchiebahnYara SchüttJan-Niclas SerrFlorian SieckAnnika StrangThore TiemannAlexander TreffJan WichelmannLehreLehrveranstaltungenAbschlussarbeitenAustauschprogramm USAKooperation Universität HamburgCapture The FlagForschungPublikationenDissertationenToolsSeminarProjekteStellenKontaktAdresseAnfahrt ITS | Institut für IT Sicherheit Universität zu Lübeck - Institut für IT Sicherheit - Mitarbeiter*innen - Thomas Eisenbarth Prof. Dr.-Ing. Thomas Eisenbarth Institutsdirektor Ratzeburger Allee 160 23562 Lübeck Gebäude 64, 1. OG, Raum 043 Email: thomas.eisenbarth(at)uni-luebeck.de Phone: +49 451 3101 6600 Fax: +49 451 3101 6604 Thomas Eisenbarth ist Professor für IT Sicherheit an der Universität zu Lübeck. Er studierte bis 2006 Elektro- und Informationstechnik an der Ruhr Universität Bochum, wo er bis 2009 am Horst Görtz Institut für IT-Sicherheit promovierte. Ab 2010 forschte er als Assistant Professor am Center for Cryptography and Information Security (CCIS) an der Florida Atlantic University. 2012 wechselte er an das Worcester Polytechnic Institute (WPI). Seit August 2017 ist er als Direktor des Instituts für IT Sicherheit an der Universität zu Lübeck.Seit Oktober 2024 ist er der Vorsitzende der MINT Sektionen.Seine Forschungsinteressen umfassen:Systemsicherheit , Softwaresicherheit und Code-AnalyseAngewandte KryptografieSichere Vortualisierung, Mikroarchitekturen und Trusted Execution EnvorinmentsSeitenkanalangriffe, physische Sicherheit und Gegenmaßnahmen CHES 2022 Program Co-ChairCARDIS 2021 General ChairCARDIS 2020 General ChairSPACE 2017 TPC Co-chairCARDIS 2017 TPC Co-chairLightSEC 2014 TPC Co-chairCHES 2013 General Co-ChairWESS 2013 TPC Co-chair CHES: 2013-2016, 2022-2025CARDIS: 2017-2024uAsc: 2025 - 2025: EuroS&P, CHES, ACM CCS, USENIX Security2024: SysTEX, ACM CCS, USENIX Security2023: ACM CCS, USENIX Security, CRYPTO2022: USENIX Security, IEEE Security & Privacy, RWC2021: EuroCRYPT, USENIX Security2020: CRYPTO, EuroCRYPT2019: CARDIS, CHES, PQCrypto, DATE2018: Kangacrypt, CHES, PQCrypto2017: AsiaCRYPT, CHES, VLSISoC, COSADE, SEMS2016: RFIDsec, AsiaCRYPT, CARDIS, TrustED, COSADE, TRUDEVICE2015: CARDIS, CHES, Latincrypt, RFIDsec, COSADE, TrustED2014: CHES, ReConFig, CARDIS, M2MSec, WESS, RFIDsec2013: RFIDsec, ICICS2012: CHES2010: ISC 2026 Jonah Heller, Marcel Pflaeging, Thore Tiemann, and Thomas Eisenbarth, CTRL+ALT+TLB: Exploring Microarchitectural Weird Machines on Translation Look-aside Buffers, in Proceedings of the 21th ACM Asia Conference on Computer and Communications Security (to appear), ASIA CCS 2026 , ACM, 2026. Bibtex: @inproceedings{heller2026ctrlalttlb, author = {Jonah Heller and Marcel Pflaeging and Thore Tiemann and Thomas Eisenbarth}, title = {CTRL+ALT+TLB: Exploring Microarchitectural Weird Machines on Translation Look-aside Buffers}, booktitle = {Proceedings of the 21th {ACM} Asia Conference on Computer and Communications Security, {ASIA} {CCS} 2026, Bangalore, India, June 1-5, 2026}, publisher = {{ACM}}, year = {2026}, timestamp = {Wed, 24 Nov 2025 09:46:47 +0100} }2025 Thorsten Peinemann, Paula Arnold, Sebastian Berndt, Thomas Eisenbarth, and Esfandiar Mohammadi, Non-omniscient backdoor injection with a single poison sample: Proving the one-poison hypothesis for linear regression and linear classification, arXiv , Aug. 2025. DOI:10.48550/arXiv.2508.05600 Datei: 2508.05600 Christian Ewert, Andrija Neskovic, Carsten Heinz, Felix Muuss, Alexander Treff, Marc Gourjon, Rainer Buchty, Thomas Eisenbarth, Andreas Koch, Mladen Berekovic, and Saleh Mulhem, Lightweight Authenticated Integration and In-Field Secure Operation of System-in-Package, ACM Trans. Des. Autom. Electron. Syst. , Jun. 2025. Association for Computing Machinery. DOI:10.1145/3745780 Datei: 3745780 Felix Mächtle, Nils Loose, Jan-Niclas Serr, Jonas Sander, and Thomas Eisenbarth, AutoStub: Genetic Programming-Based Stub Creation for Symbolic Execution, in Proceedings of the 18th ACM/IEEE International Workshop on Search-Based and Fuzz Testing, SBFT 2025 , 2025. Jonas Sander, Sebastian Berndt, Ida Bruhns, and Thomas Eisenbarth, Dash: Accelerating Distributed Private Convolutional Neural Network Inference with Arithmetic Garbled Circuits, IACR Transactions on Cryptographic Hardware and Embedded Systems , vol. 2025, pp. 420-449, 2025. IACR. DOI:10.46586/tches.v2025.i1.420-449 Zane Weissman, Thore Tiemann, Thomas Eisenbarth, and Berk Sunar, Microarchitectural Security of Firecracker VMM for Serverless Cloud Platforms, in Information Systems Security , Patil, Vishwas T. and Krishnan, Ram and Shyamasundar, Rudrapatna K., Eds. Springer Nature Switzerland, 2025. pp. 3-24. DOI:10.1007/978-3-031-80020-7_1 ISBN:978-3-031-80020-7 Weblink: https://doi.org/10.48550/arXiv.2311.15999 Bibtex: @inproceedings{weissman2025firecracker, author = {Weissman, Zane and Tiemann, Thore and Eisenbarth, Thomas and Sunar, Berk}, title = {Microarchitectural Security of Firecracker VMM for Serverless Cloud Platforms}, booktitle = {Information Systems Security}, editor = {Patil, Vishwas T. and Krishnan, Ram and Shyamasundar, Rudrapatna K.}, year = {2025}, pages = {3--24}, publisher = {Springer Nature Switzerland}, isbn = {978-3-031-80020-7}, doi = {10.1007/978-3-031-80020-7_1}, } Felix Mächtle, Jan-Niclas Serr, Nils Loose, Jonas Sander, and Thomas Eisenbarth, OCEAN: Open-World Contrastive Authorship Identification, in Applied Cryptography and Network Security (ACNS) 2025 , 2025. Weblink: https://arxiv.org/abs/2412.05049 Bibtex: @misc{maechtle2024oceanopenworldcontrastiveauthorship, title={OCEAN: Open-World Contrastive Authorship Identification}, author={Felix Mächtle and Jan-Niclas Serr and Nils Loose and Jonas Sander and Thomas Eisenbarth}, year={2024}, eprint={2412.05049}, archivePrefix={arXiv}, primaryClass={cs.AI}, url={https://arxiv.org/abs/2412.05049}, } Philipp Schmitz, Tobias Jauch, Alex Wezel, Mohammad R. Fadiheh, Thore Tiemann, Jonah Heller, Thomas Eisenbarth, Dominik Stoffel, and Wolfgang Kunz, Okapi: Efficiently Safeguarding Speculative Data Accesses in Sandboxed Environments, in Proceedings of the 20th ACM Asia Conference on Computer and Communications Security, ASIA CCS 2025 , ACM, 2025. pp. 1203–1218. DOI:10.1145/3708821.3733869 Weblink: https://arxiv.org/abs/2312.08156 Bibtex: @inproceedings{schmitz2025okapi, author = {Philipp Schmitz and Tobias Jauch and Alex Wezel and Mohammad Rahmani Fadiheh and Thore Tiemann and Jonah Heller and Thomas Eisenbarth and Dominik Stoffel and Wolfgang Kunz}, title = {Okapi: Efficiently Safeguarding Speculative Data Accesses in Sandboxed Environments}, booktitle = {Proceedings of the 20th {ACM} Asia Conference on Computer and Communications Security, {ASIA} {CCS} 2025, Hanoi, Vietnam, August 25-29, 2025}, pages = {1203--1218}, publisher = {{ACM}}, year = {2025}, url = {https://doi.org/10.1145/3708821.3733869}, doi = {10.1145/3708821.3733869}, timestamp = {Wed, 15 Oct 2025 19:23:47 +0200} } Felix Mächtle, Ashwath Shetty, Jonas Sander, Nils Loose, Sören Pirk, and Thomas Eisenbarth, Prompt Pirates Need a Map: Stealing Seeds helps Stealing Prompts, 2025. Weblink: https://arxiv.org/pdf/2509.09488 Bibtex: @misc{maechtle2025promptpirates, title={Prompt Pirates Need a Map: Stealing Seeds helps Stealing Prompts}, author={Felix Mächtle and Ashwath Shetty and Jonas Sander and Nils Loose and Sören Pirk and Thomas Eisenbarth}, year={2025}, eprint={2509.09488}, archivePrefix={arXiv}, primaryClass={cs.CR}, url={https://arxiv.org/abs/2509.09488}, } Jeremy Boy, Antoon Purnal, Anna Pätschke, Luca Wilke, and Thomas Eisenbarth, SLasH-DSA: Breaking SLH-DSA Using an Extensible End-To-End Rowhammer Framework, arXiv preprint arXiv:2509.13048 , 2025. Datei: 2509.13048 Felix Mächtle, Nils Loose, Tim Schulz, Florian Sieck, Jan-Niclas Serr, Ralf Möller, and Thomas Eisenbarth, Trace Gadgets: Minimizing Code Context for Machine Learning-Based Vulnerability Prediction, 2025. Weblink: https://arxiv.org/pdf/2504.13676 Bibtex: @article{machtle2025trace, title={Trace Gadgets: Minimizing Code Context for Machine Learning-Based Vulnerability Prediction}, author={M{\\\"a}chtle, Felix and Loose, Nils and Schulz, Tim and Sieck, Florian and Serr, Jan-Niclas and M{\\\"o}ller, Ralf and Eisenbarth, Thomas}, journal={arXiv preprint arXiv:2504.13676}, year={2025} } Anna Pätschke, Jan Wichelmann, and Thomas Eisenbarth, Zebrafix: Mitigating Memory-Centric Side-Channel Leakage via Interleaving, in 28th International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2025) , IEEE, 2025. Datei: 2502.09139 2024 Luca Wilke, Florian Sieck, and Thomas Eisenbarth, TDXdown: Single-Stepping and Instruction Counting Attacks against Intel TDX, in Proceedings of the 2024 ACM SIGSAC Conference on Computer and Communications Security , ACM, Okt.2024. DOI:10.1145/3658644.3690230 Weblink: https://uzl-its.github.io/tdxdown/ Bibtex: @INPROCEEDINGS{tdxdownCCS24, author = {Luca Wilke and Florian Sieck and Thomas Eisenbarth}, booktitle = {Proceedings of the 2024 ACM SIGSAC Conference on Computer and Communications Security, {CCS} 2024, Salt Lake City, UT, USA, October 14--18, 2024}, title = {{TDXdown}: Single-Stepping and Instruction Counting Attacks against Intel {TDX}}, year = {2024}, doi = {10.1145/3658644.3690230} } Jan Wichelmann, Anja Rabich, Anna Pätschke, and Thomas Eisenbarth, Obelix: Mitigating Side-Channels Through Dynamic Obfuscation, in 2024 IEEE Symposium on Security and Privacy (S&P) , ",
  "content_length": 17369,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:27"
}