{
  "name": "Thomas Neele",
  "homepage": "https://tneele.com",
  "status": "success",
  "content": "Thomas Neele Thomas NeeleI am an Assistant Professor at the Eindhoven University of Technology(TU/e) in the group Formal System Analysis. I am the Managing Director of the IPA research school. My research interests are the analysis of concurrent behaviour and its associated scalability problems. In the context of model checking, I study symbolic techniques, syntactic transformations for reduction, and partial-order reduction. My other interests are fixpoint logics, parallel programming and automata learning. To support my research on model checking, I received a Veni personal grant from NWO for the project \"Explainable Formal Methods with Certificates\".Previously, I was a postdoc at Royal Holloway, University of London(RHUL), working on model learning of concurrent automata in the CLeVer project. I carried out my PhD at the TU/e-FSA group; my thesis titled \"Reductions for Parity Games and Model Checking\" received the IPA dissertation award. I finished both my bachelor and master in Computer Science at the University of Twente. As part of the curriculum, I visited the Trustworthy and Intelligent Systems group at Chinese Academy of Sciences for an internship in the summer of 2015.NewsBest paper awardOur paper titled Compositional Active Learning of Synchronizing Systems through Automated Alphabet Refinement received the award for the best paper of CONCUR 2025! Today I received my University Teaching Qualification (Dutch: BKO) certificate. Thanks to all the staff in the TEACH team for sharing their knowledge. Obtained Veni grantI am very happy that my proposal \"Explainable Formal Methods with Certificates\" has been awarded a Veni grant by NWO (the Dutch research council)! Veni is a personal grant for early-carreer researchers in the Netherlands. I am looking forward to doing fundamental research on efficient certifying model checkers! The paper AuDaLa is Turing Complete that I wrote together with Tom Franken has been accepted at FORTE 2024! Today I started as Managing Director of IPA. I am looking forward to many interesting talks and fruitful interactions at one of the IPA events. First on the planning is a course on software engineering. more news  ❯",
  "content_length": 2187,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:46"
}