{
  "name": "Thomas K. Huckle",
  "homepage": "http://www5.in.tum.de/wiki/index.php/Univ.-Prof._Dr._Thomas_Huckle",
  "status": "success",
  "content": "Univ.-Prof. Dr. Thomas Huckle - Sccswiki Univ.-Prof. Dr. Thomas Huckle From Sccswiki Jump to navigation Jump to search Error creating thumbnail: Unable to save thumbnail to destination Address: Institut für Informatik Boltzmannstr. 3 85748 Garching Office: MI 2.5.55 Email: Error creating thumbnail: Unable to save thumbnail to destination Phone: (089) 2 89 18 632 Fax: (089) 2 89 18 607 Contents 1 Bits and Bugs: A Scientific and Historical Review of Software Failures in Computational Science 2 Research Area 3 Collection of Software Bugs 4 Mathematicians during the Third Reich and World War II 5 Music and Computer 6 Fraud and error in Science 7 Paintings from Roman history in \"Il Palazzone\", Cortona 8 Publications and more 9 Recent Publications 10 Some old Publications 11 Folien: Lange Nacht der Universitäten 12 Mathe-Rätsel 2018: Einschulung in Hogwarts (Eigene Farbe herausfinden) 13 Mathe-Rätsel 2017 \"Zahlenfolge\" (Regel zur Bildung einer Zahlenfolge herausfinden) 14 Mathe-Rätsel 2016: \"Code knacken\" 15 Mathe-Rätsel 2015 \"Star Wars\" 16 Mathe-Rätsel 2014 \"Piraten\" (Schatz verteilen und dabei überleben) 17 Mathe-Rätsel \"Die Hüte von Hogwarts\" 2013 18 Mathe-Rätsel \"Das Duell der Zauberer\" 2012 19 Mathe-Rätsel \"Die drei Ringe\" 2011 20 Mathe-Rätsel \"Die geheime Kammer von Askaban\" 2010 21 Vorkurs 22 Wissenschaftlicher Werdegang (CV) Bits and Bugs: A Scientific and Historical Review of Software Failures in Computational Science The Book Bits and Bugs: A Scientific and Historical Review of Software Failures in Computational Science has been published in March 2019: SIAM epub access Softcover at SIAM Bookstore Softcover at EUROSPAN Bookstore Amazon de Review Research Area Numerical Linear Algebra, Parallel Computing Computing Eigendecomposition of matrices Linear systems solver, preconditioning and Multigrid Structured Matrices, Theory and applications Numerical methods in Information Retrieval Numerical methods in image reconstruction, regularisation methods Numerical methods for Quantum Simulation Tensor computations Modified Sparse Approximate Inverse: Links and Software Factorized Sparse Approximate Inverse: Links and Software Collection of Software Bugs The Book Bits and Bugs: A Scientific and Historical Review of Software Failures in Computational Science has been published in March 2019: additional digital material SIAM epub access Softcover at SIAM Bookstore Softcover at EUROSPAN Bookstore Vortrag \"Berühmte Softwarefehler Interview in DRadio Wissen movie or DVD Webpage mit vielen Links und weiteren Informationen Vortrag Kleine Bugs - große GAUs 2003 Vortrag Kleine Bugs - große GAUs 2002 Vortrag Kleine Bugs - große GAUs HTML Seminar Softwarefehler und ihre Folgen Vortrag Kleine Bugs - große GAUs 2014 Talk Little Faults Big Failures 2013 Mathematicians during the Third Reich and World War II Talk: Mathematics 1933-1945 Vortrag: Mathematiker in der NS-Zeit Webpage mit vielen Links und weiteren Informationen neue Webpage Music and Computer Webpage with talk and further references on \"Music and Computer\" Fraud and error in Science Linksammlung zu \"Betrug und Irrtum in der Wissenschaft\" Paintings from Roman history in \"Il Palazzone\", Cortona Webpage with the paintings and links to stories explaining the paintings Publications and more Numerische Methoden, Springer Verlag, Download List of Publications Citations Google Scholar Citations in Mathematics MathSciNet Scientific Citation Index Scopus Mathematics Genealogy Project Recent Publications Parallel Approximate LU Factorizations for Sparse Matrices, preprint April 2019. Accelerated Jacobi Iterations for Bidiagonal and Sparse Triangular Matrices, preprint April 2019. ELPA: A Parallel Solver for the Generalized Eigenvalue Problem, joint work with Hans-Joachim BUNGARTZ, Christian CARBOGNO, Martin GALGON, Simone KOECHER, Hagen-Henrik KOWALSKI, Pavel KUS, Bruno LANG, Hermann LEDERER, Valeriy MANIN, Andreas MAREK, Karsten REUTER, Michael RIPPL, Matthias SCHEFFLER and Christoph SCHEURER, in Proceedings of PARCO19, Prague. Data based regularization matrices for Tikhonov-Phillips regularization, joint work with M. Sedlacek, in PAMM. A Blocked QR-decomposition for the Parallel Symmetric Eigenvalue Problem, joint work with T. Auckenthaler and R. Wittmann, submitted to PARCO. Subspace iteration methods in terms of Matrix Product States, joint work with K. Waldherr, in PAMM. Exploiting Matrix Symmetries and Physical Symmetries in Matrix Product States and Tensor Trains, joint work with K. Waldherr and T. Schulte-Herbrüggen. Tikhonov-Phillips regularization with operator dependent seminorms, joint work with M. Sedlacek. Data based regularization for discrete deconvolution problems, joint work with M. Sedlacek. Computations in Quantum Tensor Networks, joint work with K. Waldherr and T. Schulte-Herbrüggen. Compact Fourier Analysis for Multigrid Methods based on Block Symbols, joint work with Chr. Kravvaritis. Smoothing and Regularization with Modified Sparse Approximate Inverses, joint work with M. Sedlacek. In \"Journal of Electrical and Computer Engineering\", Vol. 2010, Hindawi Press. Matrix exponentials and parallel prefix computation in a quantum control problem, In \"Parallel Computing, Volume 36(5-6), p. 359–369, June 2010. Special issue (PMAA08)\". joint work with T. Auckenthaler, M. Bader, K. Waldherr and A. Spörl An Efficient Parallel Implementation of the MSPAI Preconditioner, Parallel Computing 36, 273-284, joint work with A. Kallischko, A. Roy, M. Sedlacek, T. Weinzierl. Compact Fourier Analysis for Designing Multigrid Methods, SISC 31(1), 2008. Using the HLRB-II Cluster as a Quantum CISC-Compiler, in \"High Performance Computing in Science and Engineering\", Garching 2007, Springer, March 2008 (Proceedings of the HLRB-Workshop Dec. 2007), with T. Schulte-Herbrüggen, A. Spörl, K. Waldherr, S.J. Glaser. Frobenius-Norm Minimization and Probing for Preconditioning, in IJCM 84(8), 1225-1248, 2007, joint work with A. Kallischko Preconditioning Block Toeplitz matrices, in ETNA 29, 31-45, 2007, joint work with D. Noutsos. Some old Publications Multigrid Methods for Strongly Ill-Conditioned Structured Matrices, joint work with R. Fischer, Proceedings of the 8th European Multigrid Conference EMG, ECOMAS TUDelft, 2005. Structured Matrices, Multigrid Methods, and the Helmholtz Equation, joint work with R. Fischer, Copper Mountain Conference on Iterative Methods, 2006, Student Paper Competition. Circulant/Skewcirculant Matrices as Preconditioners for Hermitian Toeplitz Systems, in \"Iterative Methods in Linear Algebra\", Proceedings of the IMACS Conference in Brusselles, 1991. Iterative Methods for Toeplitz-like Matrices, SCCM Preprint 94-5, 1994. Using omega-circulant matrices for the preconditioning of Toeplitz systems, joint work with R. Fischer, in Selcuk J. Appl. Math. 4(2), 2003. Sparse Approximate Inverses for Preconditioning of Linear Equations, in Conferentie van Numerik Wiskunden, Woudschoten, Zeist, 1996. A Look-ahead Algorithm for solving Nonsymmetric Linear Toeplitz Equations, in Proceedings of the Fifth SIAM Conference on Applied Linear Algebra, Snowbird 1994. Folien: Lange Nacht der Universitäten Software Bugs Powerpoint Folien Software Bugs PDF Folien Mathe-Rätsel 2018: Einschulung in Hogwarts (Eigene Farbe herausfinden) Einschulung in Hogwarts Einschulung in Hogwarts 2 Mathe-Rätsel 2017 \"Zahlenfolge\" (Regel zur Bildung einer Zahlenfolge herausfinden) Rätsel 2017: Zahlenfolge Mathe-Rätsel 2016: \"Code knacken\" Code Knacken Mathe-Rätsel 2015 \"Star Wars\" Star Wars Mathe-Rätsel 2014 \"Piraten\" (Schatz verteilen und dabei überleben) Fluch der Karibik Mathe-Rätsel \"Die Hüte von Hogwarts\" 2013 Die Hüte von Hogwarts Mathe-Rätsel \"Das Duell der Zauberer\" 2012 Das Duell der Zauberer Mathe-Rätsel \"Die drei Ringe\" 2011 Die drei Ringe Wichtig: jede Art von Kommunikation der Gefährten nach dem Aufbruch von Legolas und Aragorn ist verboten, da Sauron das merken würde! Mathe-Rätsel \"Die geheime Kammer von Askaban\" 2010 Version für Einsteiger Version für Fortgeschrittene Version für Profis Vorkurs Potenzen und Polynome Logarithmus Logik und Beweisen Mengen Relationen Ordnungsrelationen Abbildungen Folgen Analysis Kombinatorik Lineare Gleichungssysteme Wissenschaftlicher Werdegang (CV) 1973 Abitur am Musikgymnasium der Regensburger Domspatzen 1980 Erste Staatsprüfung für das Lehramt an Gymnasium in Mathematik/Physik an der Universität Würzburg 1982 Mathematik Diplom an der Universität Würzburg 1982/83 Wissenschaftliche Hilfskraft in Informatik an der Universität Würzburg 1983-85 Wissenschaftliche Hilfskraft in Mathematik an der Universität Würzburg 1985 Promotion zum Dr. rer. nat. an der Universität Würzburg 1985-91 Akademischer Rat a.Z. in Mathematik an der Universität Würzburg 1991 Habilitation zum Dr. rer. nat. habil. an der Universität Würzburg 1991-93 Privatdozent in Mathematik an der Universität Würzburg 1993/94 Visitor am Computer Science Department in Stanford im SCCM-Programm, DFG-Stipendium 1994/95 Vertretung einer C3-Professur an der Universität Chemnitz 1995 Berufung auf eine C3-Professur für Ingenieursanwendungen in der Informatik an der TU München 1997 Aufnahme in die Fakultät für Mathematik an der TU München 2000/01 Im Rahmen eines Forschungsfreisemesters Gast am Math. Dep. der UCLA 2006 Im Rahmen eines Forschungsfreisemesters Gast an der School of Computing der University of Leeds 2019 September Ruhestand Retrieved from \"https://www5.in.tum.de/wiki/index.php?title=Univ.-Prof._Dr._Thomas_Huckle&oldid=27014\" Category: Chair Navigation menu Search",
  "content_length": 9562,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:38"
}