{
  "name": "Thomas Olsson 0002",
  "homepage": "https://www.tuni.fi/en/thomas-olsson",
  "status": "success",
  "content": "Thomas Olsson | Tampere universitiesThomas OlssonProfessor, Human-Centered DesignFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universitythomas.olsson [at] tuni.fi (thomas[dot]olsson[at]tuni[dot]fi)phone number+358408490819Hervanta CampusOrcidhttps://orcid.org/0000-0002-1106-2544About meProfessor in Human-Centered Design (of ICT), specializing in: Social Technology — Sustainable Design of ICT — Digital Ethics How to design Information and Communication Technology (ICT) services with a critical voice, mindful of digital ethics, social sustainability, and environmental footprint? I've worked on ICT applications for collaboration, technology-mediated interaction on social media services, new types of \"social technologies\" that aim to support or enhance social interaction, as well as sociotechnical solutions for supporting cultural integration and community building. I want to contribute to building a future where ICT services are imagined, built, and used with consideration of diverse values, cultures, and user groups. I'm a user-centered interaction designer and a computer scientist by training and a great enthusiast of behavioral and social sciences. Please find a short introduction video here (from 2022; presented in Finnish, with subtitles in English). I have the great privilege of leading the Technology x Social Interaction Research group at Tampere University. Please check the page for further info on collaboration opportunities, available thesis topics, etc. For up-to-date publications, please see my Google Scholar profile. ResponsibilitiesResearch: I'm leading the \"Technology x Social Interaction\" research group at Tampere University, working with inspirational scholars across the fields of design, computer science, and behavioral & social sciences. I'm the academic director of the Digital and Sustainability Transitions in Society research platform at TAU, aiming to steer digitalisation work towards a more environmentally and socially sustainable future. Recently, I've been a: Principal investigator in AIdience – How might AI applications for the audience influence journalism and its futures? co-PI in a Strategic Research Council project Trust-M: Creating trustworthy and accessible digital public services for migrants Principal Investigator in Business Finland project Big Match co-PI in the Academy of Finland project Emotions in Digital Media (EmoDiM) a work package leader in ERDF project on Human-Centered AI (KITE) the PI of an internally funded Fairness in Social Matching Systems project and involved in a number of other externally funded projects, such as Future of Remote/Hybrid Work. Teaching: I'm heading the new international Master's Degree Program in Computing Sciences and Electrical Engineering (CSEE) at the ITC faculty, the parent program of more than 12 study tracks and home of more than 200 students. I'm the responsible professor coordinating the Human-Technology Interaction studies (under CSEE). I'm also actively involved in offering and developing the Sustainable Digital Life Master's program. I serve as a supervisor and a planning group member in the Doctoral Programme of Humans and Technologies. I am or have been the responsible teacher for the following courses: SDL.530 Sustainable Design SDL.600 Technologies for Enhancing Social Interactions HTI.311 User Research Methods TAYJ12 Ethics of Technology In addition, I'm participating in the Introduction to Sustainable Digital Life MOOC and a Finnish basic course on information sciences (Johdatus tietojenkäsittelytieteisiin). Thesis supervision: I'm gladly supervising master's and doctoral theses in relation to my research interests. Please see this page for further info and preliminary topic ideas. Affiliations and memberships: I'm affiliated with the Computing Sciences unit, where I'm also serving as a member of the steering group, in the faculty of Information Technology and Communication Sciences. I have been developing my professorial expertise in the nurturing atmosphere of the New Social Research programme at Tampere University. From 2017 to 2021, NSR was a bold endeavour to create interdisciplinary social scientific competence relevant for 21st-century academia. I'm actively involved in Rajapinta, a scientific community focused on digital social sciences and interdisciplinary Internet research. Fields of expertiseThe overarching goals of my research are (1) to understand how Information and Communication Technologies shape and condition social behavior and collaboration; (2) to envision and design novel ICT prototypes that could sustainably enhance various forms of human sociality. I'm a user interface designer and a (very soft) computer scientist by training and a great enthusiast of the social sciences. The fields I mainly publish in are Human-Computer Interaction and Computer-Supported Collaborative Work. I've published over 140 scientific papers in international journals and conferences, including ACM CHI, ACM CSCW, and Communications of the ACM. I regularly serve as an Associate Chair in ACM SIGCHI flagship conferences CHI and CSCW, and I actively serve as a reviewer in journals, such as Human-Computer Interaction, Interacting with Computers, and Human-Computer Studies. Research areas and topics (as keywords): social technologies, computer-supported cooperative work, socio-technical systems design, sustainable HCI, ICT for sustainability, computer-mediated communication, cultural integration of migrant people, professional social matching, enhancing collocated social interaction, people-nearby applications. (Topics I've studied in the past: mobile augmented reality, collective use of user-generated content, early online communities, haptic human-computer interaction, ubiquitous computing, proactive and context-aware systems, playful applications of ICT). Technology: I'm interested in various emerging technologies, particularly People Recommender Systems, new Digital Media services, Recruitment & HR technology, and Artificial Intelligence. Rather than developing such technology, I focus on the user-centric, cultural, and societal requirements as well as designing service concepts and user interfaces. Methodology: my research is mainly qualitative by nature, aiming to make sense of and conceptualize unexplored phenomena and gain user-centric insight into the behavioral and social effects of new ICTs. We often follow the research through design approach, critically investigating existing design conventions in an attempt to design new, more sustainable social user experiences and to encourage ethical and socially sustainable design of technological services. I've also utilized computational social science approaches like network analysis and computational analytics methods based on machine learning. I'm well familiar with both the Centrum and Hervanta campuses of Tampere University. Before the merger of the local universities in 2019, I was an Associate Professor at University of Tampere (centrum campus) and before that an Adjunct Professor and Post-doctoral Researcher at Tampere University of Technology (Hervanta campus). Selected publicationsPlease see my Google Scholar profile at https://scholar.google.fi/citations?user=_4wz2YAAAAAJ Own linksResearchGate",
  "content_length": 7312,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:50"
}