{
  "name": "Thomas Gärtner 0001",
  "homepage": "https://informatics.tuwien.ac.at/people/thomas-gaertner",
  "status": "success",
  "content": "Thomas Gärtner — TU Wien Informatics People Overview Professors Scientific Staff Administrative Staff Student Staff External Lecturers By Responsibilities By Committee By Name Related Guest Professors Honoraries Alumni (LinkedIn) #5qw Thomas Gärtner Univ.Prof. Dipl.-Ing.(BA) Dr.rer.nat. / MSc Research Areas Data Mining, Machine Learning About My main research interests are efficient and effective machine learning and data mining algorithms. Machine learning considers the problem of extracting useful functional or probabilistic dependencies from a sample of data. Such dependencies can then, for instance, be used to predict properties of partially observed data. Data mining is often used in a broader sense and includes several different computational problems, for instance, finding regularites or patterns in data. By efficiency I mean on the one hand the classical computational complexity of decision, enumeration, etc problems but on the other hand also a satisfactory response time that allows for effectiveness. By effectiveness I mean how well an algorithm helps to solve a real world problem. My main research interests are efficient and effective machine learning and data mining algorithms. My recent focus is on challenges relevant to the constructive machine learning setting where the task is to find domain instances with desired properties and the mapping between instances and their properties is only partially accessible. This includes structured output prediction, active learning/search, online learning/optimisation, knowledge-based learning and related areas. I am most interested in cases of this setting where at least one of the involved spaces is not a Euclidean space such as the set of graphs. My approach in many cases is based on kernel methods where I have focussed originally on kernels for structured data, moved to semi-supervised/transductive learning, and am currently looking at parallel/distributed approaches as well as fast approximations. The most recent knowledge-based kernel method was for instance focussing on interactive visualisations for data exploration. Application areas which I am often considering when looking for novel machine learning challenges are chemoinformatics and computer games. Roles Head of Research Unit Machine Learning, E194-06 Full Professor Machine Learning, E194-06 Faculty Council Principal Member Curriculum Commission for Business Informatics Principal Member Contact thomas.gaertner@tuwien.ac.at +43-1-58801-194601 Erzherzog-Johann-Platz 1, Room FB0207 vCard from TISS thomasgaertner.org/ orcid.org/0000-0001-5985-9213 informatics.tuwien.ac.at/people/thomas-gaertner tiss.tuwien.ac.at/person/330800 Courses 2025W Bachelor Thesis in Computer Science / 194.112 / PR Interdisciplinary Project in Data Science / 194.147 / PR Introduction to Machine Learning / 194.025 / VU Machine Learning / 184.702 / VU Machine Learning Algorithms and Applications / 194.101 / PR Project in Computer Science 1 / 194.145 / PR Project in Computer Science 2 / 194.146 / PR Scientific Research and Writing / 193.052 / SE Seminar for Master Students in Data Science / 180.772 / SE Seminar for PhD Students / 194.110 / SE Seminar in Artificial Intelligence (Theoretical Aspects of Machine Learning) / 194.118 / SE Theoretical Foundations and Research Topics in Machine Learning / 194.100 / VU Theoretical Foundations and Research Topics in Machine Learning / 194.201 / VU 2026S Bachelor Thesis in Computer Science / 194.112 / PR Project in Computer Science 1 / 194.145 / PR Seminar for PhD Students / 194.110 / SE Projects AI and Neuroscience 2025 – 2032 / Vienna Science and Technology Fund (WWTF) Publications: 218647 / 218637 Structured Doctoral Program on Automated Reasoning 2025 – 2029 / Austrian Science Fund (FWF) Publication: 219886 NanoX 2024 – 2028 / Austrian Science Fund (FWF) Publications: 208697 / 213928 Doktorand/inn/enprogramm der ÖAW 2024 – 2026 / Austrian Academy of Sciences Towards Trustworthy Recommendation Systems for Online Social Networks 2023 – 2031 / Vienna Science and Technology Fund (WWTF) Structured Data Learning with Generalized Similarities 2023 – 2027 / Vienna Science and Technology Fund (WWTF) Publications: 188226 / 188931 / 188939 / 188937 / 191403 / 193749 / 193748 / 193747 / 199519 / 203813 / 203184 / 204922 / 205365 / 205196 / 208524 / 208697 / 216592 / 212560 / 213928 Modelling Complex Structured Real Biological and Chemical Data using MachineLearning 2022 – 2023 / Austrian Exchange Service (OeAD) Artificial Intelligence for Advanced SAR Processing 2021 – 2023 / Austrian Research Promotion Agency (FFG) Publication: 199834 Publications 2025 Interactive Knowledge-Based Kernel PCA for Solvent Selection / Boobier, S., Heeley, J., Gärtner, T., & Hierst, J. D. (2025). Interactive Knowledge-Based Kernel PCA for Solvent Selection. ACS Sustainable Chemistry & Engineering, 3(11), 4349–4368. https://doi.org/10.1021/acssuschemeng.4c07974 Projects: NanoX (2024–2028) / StruDL (2023–2027) WILTing Trees: Interpreting the Distance Between MPNN Embeddings / Negishi, M., Gärtner, T., & Welke, P. (2025). WILTing Trees: Interpreting the Distance Between MPNN Embeddings. In Proceedings of the 42nd International Conference on Machine Learning (pp. 45852–45876). PMLR. Maximally Expressive GNNs for Outerplanar Graphs / Bause, F., Jogl, F., Indri, P., Drucks, T., Penz, D., Kriege, N., Gärtner, T., Welke, P., & Thiessen, M. (2025). Maximally Expressive GNNs for Outerplanar Graphs. Transactions on Machine Learning Research. http://hdl.handle.net/20.500.12708/218113 2024 Scalable Interactive Data Visualization / Chen, F., & Gärtner, T. (2024). Scalable Interactive Data Visualization. In A. Bifet, P. Daniusis, & J. Davis (Eds.), Machine Learning and Knowledge Discovery in Databases. Research Track and Demo Track : European Conference, ECML PKDD 2024, Vilnius, Lithuania, September 9–13, 2024, Proceedings, Part VIII (pp. 429–433). Springer. https://doi.org/10.1007/978-3-031-70371-3_34 Project: StruDL (2023–2027) Distillation based Robustness Verification with PAC Guarantees / Indri, P., Blohm, P., Athavale, A., Bartocci, E., Weissenbacher, G., Maffei, M., Nickovic, D., Gärtner, T., & Malhotra, S. (2024). Distillation based Robustness Verification with PAC Guarantees. In International Conference on Machine Learning 2024 - Next Generation of AI Safety Workshop. International Conference on Machine Learning 2024 - Next Generation of AI Safety Workshop, Vienna, Austria. http://hdl.handle.net/20.500.12708/200890 Logical Distillation of Graph Neural Networks / Pluska, A., Welke, P., Gärtner, T., & Malhotra, S. (2024). Logical Distillation of Graph Neural Networks. In ICML 2024 Workshop on Mechanistic Interpretability. ICML 2024 Workshop on Mechanistic Interpretability, Vienna, Austria. https://doi.org/10.34726/7099 Download: PDF (309 KB) Project: StruDL (2023–2027) The Expressive Power of Path-Based Graph Neural Networks / Graziani, C., Drucks, T., Jogl, F., Bianchini, M., Scarselli, F., & Gärtner, T. (2024). The Expressive Power of Path-Based Graph Neural Networks. In Proceedings of the 41st International Conference on Machine Learning. International Conference on Machine Learning (2024), Vienna, Austria. PMLR. http://hdl.handle.net/20.500.12708/199519 Download: PDF (1.68 MB) Project: StruDL (2023–2027) Is Expressivity Essential for the Predictive Performance of Graph Neural Networks? / Jogl, F., Welke, P., & Gärtner, T. (2024). Is Expressivity Essential for the Predictive Performance of Graph Neural Networks? In NeurIPS 2024 Workshop on Scientific Methods for Understanding Deep Learning. NeurIPS 2024 The Thirty-Eighth Annual Conference on Neural Information Processing Systems, Vancouver, Canada. Project: StruDL (2023–2027) Reaction rebalancing: a novel approach to curating reaction databases / Phan, T.-L., Klaus Weinbauer, Thomas Gärtner, Merkle, D., Andersen, J., Fagerberg, R., & Stadler, P. F. (2024). Reaction rebalancing: a novel approach to curating reaction databases. Journal of Cheminformatics, 16(1), Article 82. https://doi.org/10.1186/s13321-024-00875-4 Project: StruDL (2023–2027) Logical Distillation of Graph Neural Networks / Pluska, A., Welke, P., Gärtner, T., & Malhotra, S. (2024). Logical Distillation of Graph Neural Networks. In P. Marquis, M. Ortiz, & M. Pagnucco (Eds.), Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning (pp. 920–930). IJCAI Organization. https://doi.org/10.24963/kr.2024/86 Download: PDF (213 KB) Projects: NanoX (2024–2028) / StruDL (2023–2027) 2023 Maximally Expressive GNNs for Outerplanar Graphs / Bause, F., Jogl, F., Indri, P., Drucks, T., Penz, D., Kriege, N., Gärtner, T., Welke, P., & Thiessen, M. (2023). Maximally Expressive GNNs for Outerplanar Graphs. In NeurIPS 2023 Workshop: New Frontiers in Graph Learning. NeurIPS 2023 Workshop: New Frontiers in Graph Learning, New Orleans, LA, United States of America (the). OpenReview.net. https://doi.org/10.34726/5433 Download: PDF (880 KB) Project: StruDL (2023–2027) Maximally Expressive GNNs for Outerplanar Graphs / Bause, F., Jogl, F., Indri, P., Drucks, T., Penz, D., Kriege, N., Gärtner, T., Welke, P., & Thiessen, M. (2023, December 1). Maximally Expressive GNNs for Outerplanar Graphs [Poster Presentation]. Learning-on-Graphs Conference 2023: Local Meetup, München, Germany. https://doi.org/10.34726/5344 Downloads: Paper (880 KB) / Poster (422 KB) Project: StruDL (2023–2027) No PAIN no Gain: More Expressive GNNs with Paths / Graziani, C., Drucks, T., Bianchini, M., Scarselli, F., & Gärtner, T. (2023). No PAIN no Gain: More Expressive GNNs with Paths. In NeurIPS 2023 Workshop: New Frontiers in Graph Learning. NeurIPS 2023 Workshop: New Frontiers in Graph Learning, New Orleans, LA, United States of America (the). OpenReview.net. https://doi.org/10.34726/5429 Download: PDF (1.01 MB) Expressivity-Preserving GNN Simulation / Jogl, F., Thiessen, M., & Gärtner, T. (2023). Expressivity-Preser",
  "content_length": 17761,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:33"
}