{
  "name": "Thomas Schwentick",
  "homepage": "https://ls1-www.cs.tu-dortmund.de/de/kontakt-thomas-schwentick",
  "status": "success",
  "content": "Startseite - LOGIC-IN - TU Dortmund Zur Navigation Zum Schnellzugriff Zum Fuß der Seite mit weiteren Services Zum Inhalt Fakultät für Informatik 29.10.2025 Erfolgreicher DFG-Antrag: Jean Christoph Jung erhält Förderung für innovatives Projekt zur Ontologie- und Anfragenforschung DFG fördert das Projekt „Lernen von Anfragen und Ontologien aus Daten“ – eine Brücke zwischen Logik, Datenbanken und maschinellem Lernen. 18.07.2025 Übersicht der Lehrveranstaltungen im Wintersemester 2025/2026 Die Übersicht der Lehrveranstaltungen für das Wintersemester 2025/2026 ist ab jetzt online. 28.05.2025 Vortrag von Prof. Dr.-Ing. Dr. h.c. Claudio Moraga beim 55. Internationalen Symposium über Mehrwertige Logik Anfang Juni nahm Prof. Dr.-Ing. Dr. h.c. Claudio Moraga am 55. Internationalen Symposium über Mehrwertige Logik an der Mac Gill Universität, in… 31.01.2025 Übersicht der Lehrveranstaltungen im Sommersemester 2025 Die Übersicht der Lehrveranstaltungen für das Sommersemester 2025 ist ab jetzt online. 08.01.2025 Lehrpreis der TU Dortmund an Thomas Schwentick verliehen Auf der akademischen Jahresfeier am 17.12.2024 wurde Thomas Schwentick der Lehrpreis der TU Dortmund in der Kategorie I ‚Vorlesungen über 60 Personen‘… 18.11.2024 2nd Workshop on Craig Interpolation and Beth Definability, Nov 27-28th On November 27-28th, the Knowledge-Based Systems Group of Chair 1 will host the 2nd workshop on Craig Interpolation and Beth Definability. 05.11.2024 Arbeit aus der Arbeitsgruppe Knowledge-Based Systems akzeptiert Eine Arbeit der AG Knowledge-Based Systems wurde bei der KR 2024 angenommen. 18.07.2024 Übersicht der Lehrveranstaltungen im Wintersemester 2024/2025 Die Übersicht der Lehrveranstaltungen für das Wintersemester 2024/2025 ist ab jetzt online. Zum Seitenanfang",
  "content_length": 1777,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:01"
}