{
  "name": "Thomas Franke",
  "homepage": "https://www.imis.uni-luebeck.de/de/institut/team/thomas-franke",
  "status": "success",
  "content": "Univ.-Prof. Dr. rer. nat. Thomas Franke Dipl.-Psych. | IMIS - Universität zu Lübeck Direkt zum Inhalt Institut Professuren Team IMIS Kontakt Anfahrt Forschung Forschungsschwerpunkte Forschungsthemen Forschungsprojekte Publikationen Lehre Lehrbereiche Bachelorarbeiten Masterarbeiten Sonstige Arbeiten Transfer Transferbereiche Wissenstransfer Transferprojekte Weiterbildung Aktuelles News Stellenangebote Search Univ.-Prof. Dr. rer. nat. Thomas Franke Dipl.-Psych. Professor für Ingenieurpsychologie und Kognitive Ergonomie Institut für Multimediale und Interaktive Systeme Universität zu Lübeck , Gebäude 64 , Raum 2.100 Ratzeburger Allee 160 D-23562 Lübeck Tel: +49 451-3101 5111 Fax: +49 451-3101 5104 E-Mail: thomas.franke [at] uni-luebeck.de Professur Engineering Psychology Google Scholar ResearchGate Allgemeines Zur Person Wir leben in einer zunehmend technisierten Umwelt. Das Ziel meiner Forschung ist, zu einer optimalen Gestaltung der Mensch-Technik-Kooperation beizutragen und dabei Theorien und Methoden der Ingenieurpsychologie zu bereichern. Das umfasst sowohl die theoretisch fundierte Charakterisierung von Mensch-Technik-Interaktion als auch die mehrdimensionale Evaluation von Konzepten, Prototypen und Systemen. Meine Forschungsinteressen liegen in Feldern wie Nachhaltigkeit und Energieeffizienz, Gesundheit, Mobilität und Automation. Dabei liegt mein Fokus auf Aspekten der Nutzerakzeptanz, des Nutzererlebens, der Nutzer-System-Interaktion sowie der Interfacegestaltung. Ich freue mich jederzeit über Austausch zu Themen der Mensch-Technik-Interaktion und zur Nutzerperspektive auf technische Systeme! Professur Professur für Ingenieurpsychologie Projekte Geleitete Projekte AKIEMA Adaptive KI-Unterstützung für effiziente Makleranwendungen Kids Bone Checker KI-gestützte Theranostik von Frakturen im Kindes- und Jugendalter für alle Ärztinnen und Ärzte Hansebelt Innovationsmatrix Lübeck Initiieren, entwickeln und unterstützen von Innovationen für Transformationen in der Hansebelt-Region ECO.SHARE Energieoptimiertes Corporate CarSharing von Elektrofahrzeugen in SH Elektroauto-Fahrsimulator Entwicklung Elektroauto-Fahrsimulator AMORi Handlungsintegrierte Modellierung und Optimierung der energiebezogenen Fahrenden–Fahrzeug-Interaktion MASIRI Multi-Agent-Simulation of Intelligent Resource Regulation in Integrated Energy and Mobility CoCharge Mensch-Maschine-Schnittstellen für kooperative Ressourcenregulation bei der intelligenten Elektromobilität 5G-TELK-NF Vermittlung von Technologievertrauen und Technologieverständnis MariData Energie-Interfaces für die Zukunft der energieeffizienten Schifffahrt In2Lübeck CoCoAI Kooperative und kommunizierende KI-Methoden für die medizinische bildgeführte Diagnostik ReNuBiL Reallabor Nutzerzentriertes Bidirektionales Laden ClimateCrafting Unsere Frage ist eigentlich ganz einfach: Warum fällt uns Klimaschutz so schwer? Und wie können wir Klimaschutz kinderleicht machen? E.CarSHare+ Nutzerzentrierte Potenzialsteigerung von E-CarSharing in Schleswig-Holstein NuR.E Nutzerzentriertes Reichweitenmanagement Elektrobusse Laufende Projekte ATI Skala Interaktionsbezogene Technikaffinität Publikationen Publikationen Zoubir, M. , Gruner, M. , Heidinger, J. , Schwarz, B. , Jetter, H. ,  & Franke, T. (2025)Autonomy aweigh: Evaluation metrics and supporting seafarers’ basic psychological needs in energy-efficient route planning DSSApplied Ergonomics, 128. https://doi.org/10.1016/j.apergo.2025.104518Publikation herunterladenZitieren Berg, M. ,  Suchotzki, K. ,  Zimmermann, J. ,  Merz, C. ,  Szota, K. ,  Brandt, H. ,  Hartwigsen, G. ,  Lincoln, T. ,  Mokros, A. ,  Gade, M. ,  Niessen, C. ,  Rauthmann, J. ,  Hoehl, S. ,  Kubiak, T. , Franke, T. ,  Frischlich, L. ,  Degner, J. ,  Matthies, E. ,  Sparfeldt, J. ,  Rief, W. ,  &  Haberkamp, A. (2025)A Hitchhiker’s Guide to Translation – Ideas for Fostering and Disseminating (Clinical) Translational PsychologyEuropean Psychologist, 1-23. https://doi.org/10.1027/1016-9040/a000555Zitieren Attig, C. ,  Flintrop, S. ,  Wiebel-Herboth, C. ,  & Franke, T. (2025)Balancing Autonomy and Automation: Meaningful User Experience in Smart Charging Agent InteractionsTagung experimentell arbeitender Psycholog*innen (TeaP) 2025, Frankfurt, Germany. https://doi.org/10.13140/RG.2.2.36831.78244Zitieren Zoubir, M. , Schwarz, B. , Heidinger, J. , Gruner, M. , Jetter, H. ,  & Franke, T. (2025)Anchoring Autonomy: Understanding Seafarers’ Interaction with Energy Efficiency Decision Support Systems for Route Planning and the Role of Basic Psychological NeedsCognition, Technology & Work. https://doi.org/10.1007/s10111-025-00789-7Zitieren Schwarz, B. , Zoubir, M. , Heidinger, J. , Jetter, H. ,  & Franke, T. (2024)MariData.HEI – Handlungsintegrierte Entscheidungsunterstützung durch nutzerzentrierte Energie-Interfaceshttps://doi.org/10.34657/22648Publikation herunterladenZitieren Zoubir, M. , Gruner, M. , Heidinger, J. , Schwarz, B. ,  & Franke, T. (2024)MariData Online StudyOSF. Zitieren Gruner, M. ,  Lietzke, S. , Schrills, T. ,  Höhnke, C. , Sieger, M. ,  & Franke, T. (2024)Bedürfnisse vs. Bedarfe: Bedürfnisorientierung als Konzept für eine erfolgreiche Integration des On-Demand- Verkehrs in den ÖPNV Lübecks In Gemeinsam in Bewegung: Forschung und Praxis für die Mobilitätswende Beispiele und Erkenntnisse aus den Projekten der BMBF-Fördermaßnahmen MobilitätsWerkStadt 2025 und MobilitätsZukunftsLabor 2050, BeNaMo Sammelband (pp. 5-16). nexus Institut für Kooperationsmanagement und interdisziplinäre Forschung. Zitieren Schrills, T. , Gruner, M. , Sieger, M. ,  & Franke, T. (2024)Perceived Mobility Need Satisfaction (PMNS) Scale - germanOSF. https://doi.org/10.31234/osf.io/w84yqZitieren Zoubir, M. , Gruner, M. , Heidinger, J. , Schwarz, B. , Jetter, H. ,  & Franke, T. (2024)Bridging the Gap on the Bridge: Seafarers' Tasks and Decision-Making with DSS in Energy-Efficient Route PlanningOSF. https://doi.org/10.31234/osf.io/se3yc Zitieren Schrills, T. , Sieger, M. , Gruner, M. ,  & Franke, T. (2024)Evaluation of a Scale to Assess Subjective Information Processing Awareness of Humans in Interaction With Automation & Artificial IntelligenceArtificial Intelligence and Social Computing : Proceedings of the 15th International Conference on Applied Human Factors and Ergonomics and the Affiliated Conferences, Nice, France, 24-27 July 2024, 122, 41-51. https://doi.org/10.54941/ahfe1004635Zitieren Gruner, M. , Schrills, T. , Wrage, M. , Sieger, M. ,  & Franke, T. (2024)Driven by Motivation: Understanding Perceived Mobility Need Satisfaction in On-Demand RidepoolingAutomotiveUI '24: Proceedings of the 16th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, 405-416. https://doi.org/10.1145/3640792.3675733Zitieren Gödker, M. ,  Schmees, S. , Bernhardt, L. , Heidinger, J. ,  Görges, D. ,  & Franke, T. (2024)Driving Simulation for Energy Efficiency Studies: Analyzing Electric Vehicle Eco-Driving With EcoSimLab and the EcoDrivingTestPark16th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI ’24), 32-42. https://doi.org/10.1145/3640792.3675706Zitieren Schwarz, B. , von Elbwart, S. , Zoubir, M. , Heidinger, J. , Franke, T. ,  & Jetter, H. (2024)Design and Evaluation of a Visual Query Interface for Maritime Route PlanningACM NordiCHI Nordic Conference on Human-Computer Interaction (NordiCHI 2024). https://doi.org/10.1145/3677045.3685420Publikation herunterladenZitieren Schrills, T. , Kojan, L. , Gruner, M. , Calero Valdez, A. ,  & Franke, T. (2024)Effects of user experience in automated information processing on perceived usefulness of digital contact-tracing apps: cross-sectional survey studyJMIR Human Factors. https://doi.org/10.2196/53940Zitieren Gödker, M. , Moll, V. ,  & Franke, T. (2024)Energy Consumption Displays in Electric Vehicles: Differential Effects on Estimating Consumption and Experienced Energy Dynamics AwarenessHuman Factors. https://doi.org/10.1177/00187208231222154Zitieren Calero Valdez, A. , Heine, M. , Franke, T. , Jochems, N. , Jetter, H. ,  & Schrills, T. (2024)The European commitment to human-centered technology: the integral role of HCI in the EU AI Act’s successi-com - Journal of Interactive Media, 23(2), 249-261. https://doi.org/10.1515/icom-2024-0014Publikation herunterladenZitieren Gödker, M. , Moll, V. ,  & Franke, T. (2024)Feeling Comfortable? Exploring the Relation Between Personality, Competence, and Range Interaction in Electric VehiclesAdvances in Human Factors of Transportation, 148, 297-306. https://doi.org/10.54941/ahfe1005220Zitieren Gödker, M. ,  & Franke, T. (2024)Assessing Energy-Related Situation Awareness Using Self-Controlled Occlusion During Electric Vehicle Driving ScenesAdvances in Human Factors of Transportation, 148, 286-296. https://doi.org/10.54941/ahfe1005219Zitieren Attig, C. ,  Wollstadt, P. , Schrills, T. , Franke, T. ,  &  Wiebel-Herboth, C. (2024)More than Task Performance: Developing New Criteria for Successful Human-AI Teaming Using the Cooperative Card Game HanabiCHI EA '24: Extended Abstracts of the 2024 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3613905.3650853Zitieren Ali, A. , Schrills, T. ,  Schuldei, A. , Stellbrink, L. , Calero Valdez, A. ,  Leucker, M. ,  & Franke, T. (2024)Multi-agent Simulation of Intelligent Energy Regulation in Vehicle-to-GridInternational Workshop on Multi-Agent Systems and Agent-Based Simulation, 14558, 160-172. https://doi.org/10.1007/978-3-031-61034-9_11Zitieren Schwarz, B. , Schrills, T. ,  & Franke, T. (2023/11)Experiencing Ethics and Values in the Design Process of AI-enabled Medical Devices and SoftwareHCI International 2023. https://doi.org/10.1007/978-3-031-48057-7_15Zitieren Schrills, T. ,  & Franke, T. (2023)How Do Users Experience Traceability of AI Systems? Examining Subjective Information Processing Awareness in Automated Insulin Delivery (AID) SystemsACM Transactions on ",
  "content_length": 42849,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:30"
}