{
  "name": "Thomas Slawig",
  "homepage": "https://www.algopt.informatik.uni-kiel.de/de/team/prof.-dr.-thomas-slawig",
  "status": "success",
  "content": "Algorithmische Optimale Steuerung Unsere Arbeitsgruppe entstand im Exzellenzcluster Ozean der Zukunft der Exzellenzinitiative der Bundesregierung. Die Forschung wird im Rahmen des universitären Schwerpunktes Kiel Marine Science (KMS) und des Future Ocean Netzwerks fortgesetzt.Forschungsschwerpunkt unserer Arbeitsgruppe ist die Simulation und Optimierung physikalischer, biogeochemischer und anderer Systeme, die mathematisch meist durch Differentialgleichungen beschrieben werden. Ein besonderer Fokus liegt auf Anwendungen in Meeres- und Klimaforschung. Wir arbeiten im Grenzbereich zwischen angewandter und numerischer Mathematik, der Informatik und der Klimawissenschaft. Die Arbeiten umfassen sowohl analytische mathematische als auch numerische und algorithmische Aspekte. Dazu gehört auch die Verbindung von klassischen numerischen Simulationsmethoden mit datenbasierten Verfahren des Maschinellen Lernens. Was ist Algorithmische Optimale Steuerung? In vielen wissenschaftlichen und technischen Anwendungen stellen sich Optimierungsprobleme, die durch Differentialgleichungen beschrieben sind. Solche Aufgaben werden als Probleme der Optimalen Steuerung bezeichnet. Sie bieten sowohl in ihrer mathematischen Analysis, der numerischen und algorithmischen Umsetzung eine Vielzahl von Herausforderungen, die das Arbeitsgebiet unserer Gruppe darstellen. Wichtige Forschungsgebiete dabei sind:Mathematische Analysis und Entwicklung von Algorithmen für OptimalsteuerproblemeNichtlineare OptimierungsverfahrenAnalysis und Numerik der zu Grunde liegenden, oft nichtlinearen Gleichungen (z. B. Transport- und Bilanzgleichungen, Gleichungen der Strömungsmechanik)Algorithmische Sensitivitäts- und Gradientenberechnungen (Automatisches Differenzieren).Einsatz von Machine-Learning-Techniken in Kombination von klassischen Simulationsverfahren in der Klimaforschung. Was ist CO2-Aufnahme? Chemische, biologische und physikalische Prozesse sorgen dafür, dass im Ozean atmosphärisches Kohlenstoffdioxid (CO2) gebunden, gespeichert und damit der Atmosphäre zumindest vorübergehend entzogen wird. Der Ozean wirkt damit als große Kohlenstoffdioxidsenke und nimmt etwa ein Drittel des anthropogen verursachten CO2 auf. Diese Eigenschaft spielt im Rahmen der aktuellen Klimadiskussion, in der das Treibhausgas CO2 und seine Auswirkungen auf das globale Klima im Mittelpunkt stehen, eine zentrale Rolle. Besonders wichtig ist, wie sich die CO2-Aufnahme des Meeres bei Klimaänderungen (beispielsweise Temperaturerhöhungen) verhält.Da es sich bei der CO2-Aufnahme um biogeochemische Prozesse handelt, sind wesentliche Ziele des Projektes A3 die Sensitivitätsanalyse und Datenassimilation (d. h. die Anpassung von Modellparametern mit Hilfe von Messdaten) in biogeochemischen Modellen, die an Ozeanzirkulationsmodelle gekoppelt sind. An dieser Stelle kommen die Forschungsbereiche Angewandte Mathematik und Informatik ins Spiel. Prof. Dr. Thomas Slawigthomas.slawig@email.uni-kiel.de+49 431 880-4490Christian-Albrechts-Platz 424118 KielRaum: 1201 (CAP 4) © AG Algorithmische Optimale SteuerungNumerische Simulation ist die approximative Lösung von Gleichungen, die explizit und analytisch nicht zu lösen sind. Dies geschieht mit Hilfe von mathematischen Algorithmen und Computerprogrammen, die diese realisieren. Anwendungen kommen aus den Natur-, Wirtschafts- und Sozialwissenschaften oder der Medizin. Ein Beispiel sind Klimasimulationen zur Untersuchung des Klimawandels und seiner Auswirkungen. Praxisrelevante Probleme sind hochdimensional, so dass Hochleistungsrechner verwendet werden und die Erhöhung der Effizienz eine große Rolle spielt. Wir arbeiten dabei in folgenden Bereichen:reduzierte Modelle oder EmulatorenParallelisierung in der Zeitangepasste Algorithmen für Klimasimulationen © AG Algorithmische Optimale SteuerungWährend bei der Simulation ein vorgegebenes Problem mit gegebenen Parametern gelöst wird, geht es bei der Optimierung darum, Parameter des Modells oder des Problems so zu variieren, so dass ein vorgegebenes Ziel erreicht wird. Bei einem Klimamodell kann das die möglichst gute Widerspiegelung von gegebenen Messdaten durch das Simulationsmodell sein. Dann sprechen wir von Modellkalibrierung, Parameterschätzung oder Datenassimilation. Auch hier treffen in unserer Arbeit mathematische Resultate der nichtlinearen Optimierung mit der effizienten algorithmischen Umsetzung und der Anwendungen zusammen:Optimierung mit reduzierten ModellenSurrogat-basierte OptimierungAlgorithmisches/Automatisches DifferenzierenAbleitungsbasierte und evolutionäre Optimierungsverfahren © AG Algorithmische Optimale SteuerungKlimamodelle und Klimasimulationen Das Klimasystem ist ein komplexes System, und daher sind Klimamodelle und die damit durchgeführten Simulationen entsprechend anspruchsvoll und rechenintensiv. Unsere Arbeitsgruppe ist aus dem Exzellencluster Future Ocean entstanden, daher befassen wir uns vor allem mit Ozeanmodellen und mit Modellen des marinen Ökosystems. Schwerpunkte sind:Mathematische Analyse von biogeochemischen, Ökosystem- und EismodellenNumerik von Strömungsmodellen und Transport-Diffusion-GleichungenSimualtion auf HochleistungsrechnernParallelisierung in der ZeitParameteroptimierungIntegrierte Assessment-Modelle, die Wechselwirkungen des Klimawandels mit der Ökonomie betrachten © AG Algorithmische Optimale SteuerungIn letzter Zeit sind datengetriebene Verfahren zur Lösung komplexer, auch wissenschaftlicher Probleme immer erfolgriecher und populärer geworden. In einigen Bereichen sind Methoden des Maschinellen Lernens und der KI mit klassischen numerischen Simulationsverfahren konkurrenzfähig oder können als Ergänzung, z. B. für Teilmodelle oder bei dr Entwicklung von Parametrisierung kleinskaliger Prozese genutzt werden. Unsere Gruppe hat Interesse an der Kombination beider Ansätze, der wissensbasierten Herangehensweise und der datengetriebenen Sicht des Data Science. Wir arbeiten an:Entwicklung und Nutzung von reduzierten Modellen auf Datenbasis mit Methoden des Maschinellen LernensParameterschätzung mit Neuronalen NetzenModellreduktion und DatenanalysePhysikalisch-informierte Neuronale Netze Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 6687,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:08"
}