{
  "name": "Thomas M. Watson",
  "homepage": "https://www.memphis.edu/accolades/college-awards/ecra.php",
  "status": "success",
  "content": "Early Career Research Awards (ECRA) - Accolades - The University of Memphis Skip to main content SearchX Safety & Security Prospective Students Current Students Parents & Family Alumni Veterans Faculty & Staff College Awards Take Action Home Accolades College Awards Early Career Research Awards (ECRA) 2024 Early Career Research Award (ECRA) Each academic year the College of Arts & Sciences recognizes and rewards faculty members with outstanding research programs in the early stages of their career. Recipients receive $500 to be used for research (not for salary) and a plaque as tokens of this recognition. For consideration, a candidate for one of these awards must be a tenure-track faculty member in the College of Arts & Sciences at the University of Memphis, be employed for no more than five academic years in that position, and be no more than eight years beyond receiving the terminal degree, prior to the semester of application. No past recipient will be eligible to receive the award again. Sarah Leat, School of Social Work Sarah Leat is an assistant professor in the School of Social Work. She came to the University of Memphis in the fall of 2021 after earning her PhD at the University of Texas at Arlington in May 2021. Dr. Leat practice as a social worker for a domestic violence family justice center informs her research agenda. She focuses her research primarily on the public health crisis that is adult experiences of intimate partner violence and explores help-seeking behaviors and barriers and facilitators to accessing social services, the role of transportation networks in accessing services for survivors, and the impact of the built environment on survivors’ outcomes, specifically including domestic violence shelters. Since coming to Memphis, Leat has had the opportunity to serve at Co-PI on a grant with the Public Safety Institute funded by the Tennessee Office of Criminal Justice Programs. The purpose of the grant is to create a strategic plan to formulate a coordinated community of care for survivors of domestic violence in Memphis/Shelby County. Additionally, she is currently PI on a Health Resources and Services Administration (HRSA) grant that provides stipends to individuals with lived experience of substance use to obtain certification through the State of Tennessee to become a peer-support specialist. Her experiences in both community-based research and human service organization leadership inform her teaching in advanced social work courses at the master’s level within the School of Social Work. Mark Mayer, Department of English Mark Mayer joined the University of Memphis in 2020 as an assistant professor in the Creative Writing concentration. His first book, Aerialists (Bloomsbury USA), won the Michener-Copernicus Prize, was shortlisted for the William Saroyan International Prize, and was an American Booksellers Association Indie Next selection. Mayer's current creative projects include: About, Above, Around: 50 Prepositions, a book of experimental short stories that attempt to use the English prepositions to describe the inner movements of emotion, and The Central Fire, a historical fantasy about the Pythagorean cult of the ancient Mediterranean, set within a cosmos governed by Pythagorean physics. His fiction has been published in River Styx, American Short Fiction, Kenyon Review, Guernica, Iowa Review, and Colorado Review and anthologized in the Best American series. His peer-reviewed academic articles on feminist narrative and the racial imaginary have appeared in Twentieth-Century Literature and LIT: Literature Interpretation Theory. His fiction has earned residencies and fellowships from the American Library in Paris, the BAU Institute, the Djerassi Resident Artist Program, Ucross, and Crosstown Arts. Before joining the University of Memphis, he served as a Fiction Writing Fellow at Colby College and the R. P. Dana Writer-in-Residence at Cornell College. He received his Ph.D. in English from the University of Denver and an M.F.A. from the Iowa Writers' Workshop. Daniel Nascimento, Department of Chemistry Daniel Nascimento is an assistant professor in the Department of Chemistry and a UMRF Research professor. He joined the University of Memphis in the Spring of 2021 after holding post-doctoral positions at the Georgia Institute of Technology and the Pacific Northwest National Laboratory. His research focuses on the development and application of computational quantum chemical methods to understand the interaction between light and matter at the molecular scale. Dr. Nascimento is a recipient of the prestigious NSF-CAREER award. As part of the CAREER project, his research group is developing the computational infrastructure (methodologies, algorithms and software) specialized in the simulation of multi-dimensional x-ray spectroscopies from first principles. These simulations will enable a better understanding of molecular systems that are relevant for the development of novel materials and technologies, and will have great potential to impact areas such as medicine (biosensing, photodynamic therapy, DNA photodamage), materials science and engineering (photocatalysis, photosensitizers), and environmental chemistry (atmospheric photochemistry). The project also has a strong educational component that aims to facilitate the recruitment and formation of future theoretical and computational chemists through a summer program targeting undergraduate students from across the Mid-South region.",
  "content_length": 5509,
  "method": "requests",
  "crawl_time": "2025-12-01 14:37:44"
}