{
  "name": "Thomas Thorne",
  "homepage": "https://www.surrey.ac.uk/people/tom-thorne",
  "status": "success",
  "content": "Dr Tom Thorne | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Google Scholar ORCID Dr Tom Thorne Senior Lecturer; Programme Lead of MSc Data Science MA (Cantab), PhD (Imperial), FHEA tom.thorne@surrey.ac.uk Personal website03 BB 02Varies weekly. Please email to book an appointmentAcademic and research departments Centre for Mathematical and Computational Biology, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyI am currently the Programme Lead of the MSc Data Science in the School of Computer Science and Electronic Engineering.I joined Computer Science at the University of Surrey in June 2020 as a Senior Lecturer, having previously been a lecturer at the University of Reading. Prior to that I was a Safra research fellow in the Division of Brain Sciences at Imperial College London and a Chancellors Fellow in the School of Informatics at the University of Edinburgh. I originally studied Computer Science at King's College Cambridge before taking an MSc and PhD in Bioinformatics at Imperial College London.My research applies statistical methods to analysing large biological data sets, especially in learning networks and studying their structure. You can read more about my current research interests under the research section. Expand biography Areas of specialism Systems Biology; Bioinformatics; Bayesian statistics; Statistics of networks University roles and responsibilities Programme lead of the MSc Data ScienceI am open to applications from funded PhD students with interests in statistical methods in Systems Biology. Expand about tab additional information News 13 NOV 2025Top jobs with a masters in computer science ResearchResearch interestsMy research focusses on statistical methods in Systems Biology and Bioinformatics, including the inference of biological networks, and the statistical analysis of networks. I am also interested in the use of approximate Bayesian methods for complex models and large data sets, and the acceleration of statistical methods with GPUs.Recently research has involved developing tools for the analysis of single cell transcriptomic data, which provides information about the heterogeneity of gene expression across a population of cells. Another area of interest is comparing data sets between different conditions to learn differential networks that jointly infer network structures across data sets but also allow differences to be identified. Expand research interests TeachingI am currently leading the teaching team of COMM054 Data Science Principles and Practices on the MSc Data Science at the University of Surrey. This module introduces the fundamental concepts in probability and statistics that provide a solid background for students studying data science. Expand my teaching PublicationsHighlightsThere is an up to date publication list on my personal website.Tom Wilson, Hoang Thuy Duong Vo, Thomas William Thorne (2023)Identifying sub-populations of cells in single cell transcriptomic data – a Bayesian mixture modelling approach to zero-inflation of counts, In: Journal of Computational Biology30(10)pp. 1059-1074 Mary Ann LiebertDOI: 10.1089/cmb.2022.0273In the study of single cell RNA-seq data, a key component of the analysis is to identify sub-populations of cells in the data. A variety of approaches to this have been considered, and although many machine learning based methods have been developed, these rarely give an estimate of uncertainty in the cluster assignment. To allow for this probabilistic models have been developed, but single cell RNA-seq data exhibit a phenomenon known as dropout, whereby a large proportion of the observed read counts are zero. This poses challenges in developing probabilistic models that appropriately model the data. We develop a novel Dirichlet process mixture model which employs both a mixture at the cell level to model multiple populations of cells, and a zero-inflated negative binomial mixture of counts at the transcript level. By taking a Bayesian approach we are able to model the expression of genes within clusters, and to quantify uncertainty in cluster assignments. It is shown that this approach out-performs previous approaches that applied multinomial distributions to model single cell RNA-seq counts and negative binomial models that do not take into account zero-inflation. Applied to a publicly available data set of single cell RNA-seq counts of multiple cell types from the mouse cortex and hippocampus, we demonstrate how our approach can be used to distinguish sub-populations of cells as clusters in the data, and to identify gene sets that are indicative of membership of a sub-population. The methodology is implemented as an open source Snakemake pipeline available from https://github.com/ tt104/scmixture.Tobias Duswald, Lukas Breitwieser, Thomas Thorne, Barbara Wohlmuth, Roman Bauer Calibration of stochastic, agent-based neuron growth models with Approximate Bayesian Computation, In: arXiv (Cornell University)DOI: 10.48550/arxiv.2405.13905Understanding how genetically encoded rules drive and guide complex neuronal growth processes is essential to comprehending the brain's architecture, and agent-based models (ABMs) offer a powerful simulation approach to further develop this understanding. However, accurately calibrating these models remains a challenge. Here, we present a novel application of Approximate Bayesian Computation (ABC) to address this issue. ABMs are based on parametrized stochastic rules that describe the time evolution of small components -- the so-called agents -- discretizing the system, leading to stochastic simulations that require appropriate treatment. Mathematically, the calibration defines a stochastic inverse problem. We propose to address it in a Bayesian setting using ABC. We facilitate the repeated comparison between data and simulations by quantifying the morphological information of single neurons with so-called morphometrics and resort to statistical distances to measure discrepancies between populations thereof. We conduct experiments on synthetic as well as experimental data. We find that ABC utilizing Sequential Monte Carlo sampling and the Wasserstein distance finds accurate posterior parameter distributions for representative ABMs. We further demonstrate that these ABMs capture specific features of pyramidal cells of the hippocampus (CA1). Overall, this work establishes a robust framework for calibrating agent-based neuronal growth models and opens the door for future investigations using Bayesian techniques for model building, verification, and adequacy assessment.Duong H.T. Vo, Thomas Thorne (2024)Shrinkage estimation of gene interaction networks in single-cell RNA sequencing data, In: BMC bioinformatics25339 BioMedCentralDOI: 10.doi.org/10.1186/s12859-024-05946-9BackgroundGene interaction networks are graphs in which nodes represent genes and edges represent functional interactions between them. These interactions can be at multiple levels, for instance, gene regulation, protein-protein interaction, or metabolic pathways. To analyse gene interaction networks at a large scale, gene co-expression network analysis is often applied on high-throughput gene expression data such as RNA sequencing data. With the advance in sequencing technology, expression of genes can be measured in individual cells. Single-cell RNA sequencing (scRNAseq) provides insights of cellular development, differentiation and characteristics at the transcriptomic level. High sparsity and high-dimensional data structures pose challenges in scRNAseq data analysis.ResultsIn this study, a sparse inverse covariance matrix estimation framework for scRNAseq data is developed to capture direct functional interactions between genes. Comparative analyses highlight high performance and fast computation of Stein-type shrinkage in high-dimensional data using simulated scRNAseq data. Data transformation approaches also show improvement in performance of shrinkage methods in non-Gaussian distributed data. Zero-inflated modelling of scRNAseq data based on a negative binomial distribution enhances shrinkage performance in zero-inflated data without interference on non zero-inflated count data.ConclusionThe proposed framework broadens application of graphical model in scRNAseq analysis with flexibility in sparsity of count data resulting from dropout events, high performance, and fast computational time. Implementation of the framework is in a reproducible Snakemake workflow https://github.com/calathea24/ZINBGraphicalModel and R package ZINBStein https://github.com/calathea24/ZINBStein.Ivis Kerama, Thomas Thorne",
  "content_length": 54267,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:05"
}