{
  "name": "Thorsten Staake",
  "homepage": "https://www.uni-bamberg.de/eesys/team/prof-dr-thorsten-staake",
  "status": "success",
  "content": "Prof. Dr. Thorsten Staake - Lehrstuhl für Wirtschaftsinformatik, insbesondere Energieeffiziente Systeme Prof. Dr. Thorsten Staake Raum: WE5/02.057Telefon: +49 951 863 2077Telefax: +49 951 863 5076E-Mail: thorsten.staake(at)uni-bamberg.deSprechstunde: Dienstag, 14:00 - 15:00 Uhr (nach Vereinbarung) Professor für Wirtschaftsinformatik, Universität BambergThorsten Staake ist Inhaber des Lehrstuhls für Wirtschaftsinformatik, insbes. Energieeffiziente Systeme an der Otto-Friedrich-Universität Bamberg und Co-Direktor des Bits to Energy Labs, einer Forschungsinitiative der ETH Zürich und der Universität St. Gallen.Sein Team und er beschäftigen sich mit der digitalen Vernetzung von Produkten mit dem Ziel, Dienstleistungen für das entstehende Internet der Dinge zu entwickeln und Unternehmen bei der Schaffung geeigneter Innovationsprozesse zu unterstützen. Besonderer Schwerpunkt der Forschung ist dabei die Kombination von Methoden des maschinellen Lernens mit Konzepten aus der Verhaltensökonomie.Neben seiner Forschungstätigkeit ist Thorsten Staake Mitgründer und Mitglied des Verwaltungsrates der Cleantech-Unternehmen BEN Energy AG (maschinelle Lernverfahren für Energiedienstleistungen) und Amphiro AG (IoT für Trinkwasser-Armaturen) sowie Mitglied des Verwaltungsrats der Hoval AG (Heizungs- und Klimatechnik) und des Aufsichtsrats der Zumtobel Gruppe (Lichtlösungen, Lichtkomponenten und dazugehörende Dienstleistungen).Mit über 4.000 Zitationen aus über 100 Publikationen (darunter Management Science, MIS Quarterly, Nature Energy, Global Environmental Change, Energy, Energy Policy, Transportation Research etc.) ist Thorsten Staake ein aktives Mitglied der Energieinformatik- und Informationssysteme-Forschung. Für seine Arbeit erhielt er Stipendien des Schweizerischen Nationalfonds und des Zentrums für Interdisziplinäre Technikforschung sowie zahlreiche Gründerpreise. Vor der Annahme des Rufs der Universität Bamberg arbeitete Herr Staake an der ETH Zürich, Lehrstuhl für Informationsmanagement, dem Auto-ID Lab am Massachusetts Institute of Technology, Infineon und Clariant. Er promovierte im Bereich Technologiemanagement an der Universität St. Gallen (Dr. oec.) nach Abschlüssen in Elektro- und Informationstechnik (TU Darmstadt, Dipl.-Ing) und Electrical and Computer Engineering (Worcester Polytechnic Institute, USA, M.Sc.) Ausgewählte ForschungsprojekteEine Beschreibung ausgewählter Forschungsprojekte finden Sie auf www.bits-to-energy.ch  Ausgewählte VeröffentlichungenGraichen, J., Stingl, C., Dangis, G., Pakarinen, A., Rosio, R., Salanterä, S., Terho, K., Günther, S., Siloaho, A., Staake, T. (2025): The effect of digital rewards on the motivation of children to perform everyday health behavior. Computers in Human Behavior Reports, Volume 40, December 2025, doi.org/10.1016/j.chbr.2025.100879Haag, F., Hopf, K., Staake, T. (2025): Validating Explainer Methods: A Functionally Grounded Approach for Numerical Forecasting. Journal of Forecasting, (forthcoming)Hopf, K., Nahr, N., Staake, T., Lehner, F. (2025): The group mind of hybrid teams with humans and intelligent agents in knowledge-intense work. Journal of Information Technology 40(1), DOI 10.1177/02683962241296883.Brudermueller, T., Potthoff, U., Fleisch, E., Staake, T., Wortmann, F. (2025): Estimation of energy efficiency of heat pumps in residential buildings using real operation data. Nature Communications 16 (1), 2834, https://doi.org/10.1038/s41467-025-58014-yKreft, M., Brudermueller, T., Fleisch, E., Staake, T. (2024) : Predictability of electric vehicle charging: Explaining extensive user behavior-specific heterogeneity. Applied Energy, Volume 370, June 2024. https://doi.org/10.1016/j.apenergy.2024.123544Fang, X., Goette, L., Rockenbach, B., Sutter, M., Tiefenbeck, V., Schoeb, S., Staake, T. (2023): Complementarities in behavioral interventions: Evidence from a field experiment on resource conservation. Journal of Public Economics, Volume 228, December 2023. https://doi.org/10.1016/j.jpubeco.2023.105028Brudermüller, T., Kreft, M., Fleisch, E., Staake, T. (2023):Large-scale monitoring of residential heat pump cycling using smart meter data.(2.6 MB)Applied Energy, Volume 350, November 2023. https://doi.org/10.1016/j.apenergy.2023.121734Dangis, G., Terho, K., Graichen, J., Günther, S. A., Rosio, R., Salanterä, S., Staake, T., Stingl, C. (2023):  Hand hygiene of kindergarten children—Understanding the effect of live feedback on handwashing behaviour, self-efficacy, and motivation of young children: Protocol for a multi-arm cluster randomized controlled trial. In: PLOS ONE[link]Hopf, K., Weigert, A., Staake, T. (2022): Value creation from analytics with limited data: a case study on the retailing of durable consumer goods. Journal of Decision Systems, Nr. Published online: 07 Apr 2022: 1–37. doi:10.1080/12460125.2022.2059172Weigert, A., Hopf, K., Günther, S. A., & Staake, T. (2022). Heat pump inspections result in large energy savings when a pre-selection of households is performed: A promising use case of smart meter data. Energy Policy, 169, 113156. https://doi.org/10.1016/j.enpol.2022.113156Stingl, C., Günther, S. A., Staake, T. (2021): A Feedback Information System for Improving Hand Hygiene on a Personal and Organizational Level. International Conference on Wirtschaftsinformatik, Duisburg-Essen, Germany [link], 88-94Günther, S., Staake, T., Schöb, S., Tiefenbeck, V. (2020): The behavioral response to a corporate carbon offset program: A field experiment on adverse effects and mitigation strategies. Global Environmental Change, Volume 64, September 2020, 102123. https://www.sciencedirect.com/science/article/abs/pii/S0959378020307068Günther, S., Stingl, C., Coroamă, V. C., Schöb, S., Staake, T. (2020): Empowering Personalized Feedback on Hot Water Usage: A Field Study with Shower Meters. ACM Symposium on Applied Computing 2020, Brno, Czechia [link], 763 - 766Wenig J., Sodenkamp M., Staake T. (2019). Battery versus infrastructure: Tradeoffs between battery capacity and charging infrastructure for plug-in hybrid electric vehicles. Applied Energy, Volume 255, December 2019. https://doi.org/10.1016/j.apenergy.2019.113787Sodenkamp M., Wenig J., Thiesse F., Staake T. (2019). Who can drive electric? Segmentation of car drivers based on longitudinal GPS travel data. Energy Policy, Volume 130, July 2019, 111-129. https://www.sciencedirect.com/science/article/abs/pii/S0301421519302216?via%3DihubTiefenbeck V., Wörner A., Schöb S., Fleisch E., Staake T. (2018) Real-time feedback promotes energy conservation in the absence of volunteer selection bias and monetary incentives. Nature Energy. https://www.nature.com/articles/s41560-018-0282-1Tiefenbeck, V., Götte, L., Degan, K., Lalive R., Fleisch, E., Staake, T. (2018) Overcoming Salience Bias: How Real-Time-Feedback Fosters Resource Conservation. Management Science 64(3).Schopfer, S., Tiefenbeck, V., Fleisch, E., Staake, T. (2017). Providing primary frequency control with residential scale photovoltaic-battery systems. Computer Science - Research and Development.  (forthcoming)Schöb, S., Günther, S., Regensburger, K., Staake, T. (2017) NIWM: non-intusive water monitoring to uncover heat energy use in households. Computer Science - Research and Development.  (forthcoming)Sodenkamp, M., Kozlovskiy, I., Hopf, K., Staake, T. (2017). Smart Meter Data Analytics for Enhanced Energy Efficiency in the Residential Sector. Wirtschaftsinformatik 2017, St. Gallen, Switzerland, FebruarySodenkamp, M., Kozlovskiy, I., Staake, T. (2016). Supervised classification with interdependent variables to support targeted energy efficiency measures in the residential sector. Decision Analytics 3(1), p.1. SpringerSodenkamp, M., Kozlovskiy, I., Staake, T. (2015) Gaining IS Business Value through Big Data Analytics: A Case Study of the Energy Sector. International Conference on Information Systems (ICIS), Ft. Worth, USA, DecemberWenig, J., Sodenkamp, M., Staake, T. (2015) Data-based Assessment of Plug-in Electric Vehicle Driving. Lecture Notes in Computer ScienceBeckel, C., Sadamoria, L., Staake T., Santini, S., Revealing Household Characteristics from Smart Meter Data, EnergyPaefgen, J., Staake, T., Fleisch, E. (2014) Multivariate exposure modeling of accident risk: Insights from Pay-as-you-drive insurance data. Transportation Research Part A: Policy and Practice (61), 27-40Paefgen, J., Staake, T., Thiesse F. (2013) Evaluation and aggregation of pay-as-you-drive insurance rate factors: A classification analysis approach. Decision Support Systems (56), 192-20Tiefenbeck, V., Staake, T., Roth, K., Sachs, O. (2013) For better or for worse? Empirical evidence of moral licensing in a behavioral energy conservation campaign. Energy Policy (57), 160-171Loock, C., Staake, T., Thiesse, F. (2013) Motivating energy-efficient behavior with Green IS: An investigation of goal setting and the role of defaults. MIS Quarterly 37(4), 1313-A5Tiefenbeck, V., Tasic, V., Staake, T., Goette, L. (2013) Real-time feedback and social dynamics in energy conservation: Evidence from randomized trials with 50,000 showers. Behavior, Energy and Climate Change (BECC), Sacramento, CA, USA, November 18-20Tiefenbeck, V., Tasic, V., Schoeb, S., Staake, T. (2013) Mechatronics to drive environmental sustainability: Measuring, visualizing and transforming consumer patterns on a large scale. Energy Informatics, Vienna, Austria, November 12-13Burger, N., Staake, T., Fleisch, E., Hierold, C. (2013) Managing technology development teams – exploring the case of microsytems and nanosystems. R&D Management (43), 162-186Loock, C., Landwehr, J., Staake, T., Fleisch, E., Pentland, A. (2012) The influence of reference frame and population density on the effectiveness of social normative feedback on electricity consumption. International Conference on Information Systems (ICIS), Orlando, FL, December 16-19Paefgen, J., Staake, T., Thiesse, E. (2012) Resolving the misalignment between consumer privacy concerns and ubi",
  "content_length": 11606,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:15"
}