{
  "name": "Thore Husfeldt",
  "homepage": "https://thorehusfeldt.com",
  "status": "success",
  "content": "Thore Husfeldt Professor, IT University of Copenhagen Ph.D. in Computer Science (Aarhus, 1997) Docent (Lund, 2007) Member of the advisory board of the TheoretiCS journal and the Scientific Council of lex.dk. Research My research is in theoretical computer science, namely algorithms. I began in data structures, but in the last few years the focus has been on combinatorial optimisation (“algorithms for hard problems”, if you want). Most of my recent results are in exponential time algorithms. I am the chair of the Swedish Research Council’s review panel for Computer Science (NT-2). Projects: Basic Algorithms Research Copenhagen (BARC), Villum Foundation. Algebraic graph algorithms (2017–, Swedish Research Council), Exact exponential time algorithms (2013-2015, Swedish Research Council). Earlier: Exact algorithms (2008-2010) I am a member of the Algorithms group at ITU PC member: SODA 2019, IPEC 2015 (co-chair), COCOON 2012, IPEC 2011, FCT 2011, SODA 2010, IWPEC 2009, ICALP 2009, SOFSEM 2009, SWAT 2008 Organiser: Satisfiability Lower Bounds and Tight Results for Parameterized and Exponential-Time Algorithms (Berkeley, CA, Nov 2-6 2015), 20th ARCO (Copenhagen, DK, 29 May 2015). Earlier: Dagstuhl seminar 13331: Exponential Algorithms: Algorithms and Complexity Beyond Polynomial Time, ICALP 2014, Dagstuhl seminar Exact Complexity of NP-hard problems, ALGO 2009, summer school on algorithms for advanced processor architectures (AFAPA). Steering committees: Council of the European Association of Theoretical Computer Science (EATCS), 𝛼Haf – Algorithmic Fairness Copenhagen, PACE, ARCO. Earlier: International Symposium on Parameterized and Exact Computation (IPEC) Invited speaker: Journées Nationales du GDR Informatique Mathématique 2012, China Theory Week 2011 (Aarhus, China), ICALP 2011 (Zürich), Agape Spring School on Fixed Parameter and Exact Algorithms 2009 (Corsica) I enjoy telling people about my research and theoretical computer science in general and am happy to give general audience talks, in Danish, English, German, or Swedish. Contact me if you’re interested. Cast IT, popular science podcast (audio and video format) about foundational questions of IT. Popular science talks Teaching I teach Computer Science courses at all levels, with a bit of maths thrown in. BADS – Algorithms and data structures (ITU, Spring) SAD1 – Algorithm Design (ITU, Fall) 2017, also: Overcoming Bias and Calling Bullshit in the Age of Big Data (ITU, PhD course) EDAN55 – Advanced Algorithms (LU, Fall) EDAF05 – Algoritmer, Datastrukturer och komplexitet (LU, Spring) I am a member of the Lund Science faculty’s Pedagogical Academy and have received a number of recognitions I’m very proud of: Departmental level Datalogernas utbildningsråd’s pedagogical prize 2000. Computer engineering students at Lund University (D-Sektionen) Golden Pointer 2010 Excellence in Teaching, IT University of Copenhagen 2018. Faculty level Lunds Naturvetarekår’s pedagogical prize 2007, Excellent teaching practitioner 2006. University level Lunds Universitets Studentkårer’s pedagogical prize 2007 Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on Reddit (Opens in new window) Reddit Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Pages About Appearances Blog Crossword Solutions Kryptiske krydsord på dansk Publications Recent Posts EATCS Council 2025 Election Statement The Open Society and Its Digital Enemies I: Knowledge (Lex conference on trustworthy knowledge, Copenhagen 2025) Gadfather, Gay Unlocked in Secret Sartre Contact thore@itu.dk thorehusfeldt.com At IT University of Copenhagen IT Universitetet i København Rued Langgaards Vej 7 2300 København S Denmark At home: +46 (0)46 – 14 17 67 Magnus Stenbocksgatan 10 222 24 Lund Sweden RSSRSS - PostsRSS - Comments Search for: Top PostsAboutOrigami, Gift Wrapping, and How to Fold a Road MapArchives September 2025 May 2025 January 2024 April 2023 March 2023 June 2022 December 2021 November 2021 September 2021 February 2021 August 2020 December 2019 August 2019 May 2019 April 2019 November 2018 September 2018 May 2018 January 2018 December 2017 October 2017 September 2017 June 2017 October 2016 September 2016 May 2016 January 2016 December 2015 July 2015 May 2015 April 2015 February 2015 January 2015 November 2014 August 2014 July 2014 June 2014 May 2014 December 2013 September 2013 June 2013 May 2013 January 2013 November 2012 September 2012 June 2012 May 2012 March 2012 February 2012 January 2012 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 January 2011 December 2010 November 2010 October 2010 September 2010 August 2010 July 2010 June 2010 December 2009 September 2009 August 2009 December 2008 November 2008 November 2007 October 2007 August 2007 June 2007 January 2007 January 2005 March 2004 Subscribe Subscribed Thore Husfeldt Join 136 other subscribers Sign me up Already have a WordPress.com account? Log in now. Thore Husfeldt Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... You must be logged in to post a comment.",
  "content_length": 5298,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:10"
}