{
  "name": "Thorsten Grosch",
  "homepage": "https://www.ifi-gdpm.tu-clausthal.de/ueber-uns/personen/leitung/prof-dr-thorsten-grosch",
  "status": "success",
  "content": "Prof. Dr. Thorsten Grosch Zum Inhalt springen Prof. Dr. Thorsten Grosch Stefanie KehlKontakt Tel.: +49-5323 72-7140 Fax: +49-5323 72-7149 E-Mail: stefanie.cronjaeger@tu-clausthal.deAdresse Technische Universität Clausthal Institut für Informatik Julius-Albert-Str. 4, Raum 202 38678 Clausthal Zellerfeld Germany Kontakt Tel.: +49-5323 72-7186 E-Mail: thorsten.grosch@tu-clausthal.de Adresse Technische Universität Clausthal Institut für Informatik Julius-Albert-Str. 4, Raum 204 38678 Clausthal Zellerfeld Germany Hinweis zu Cookies Unsere Webseite verwendet Cookies. Diese haben zwei Funktionen: Zum einen sind sie erforderlich für die grundlegende Funktionalität unserer Website. Zum anderen können wir mit Hilfe der Cookies unsere Inhalte für Sie immer weiter verbessern. Hierzu werden u. a. pseudonymisierte Daten von Website-Besuchern gesammelt und ausgewertet. Mit dem Klick auf Einstellungen können Sie zudem die einzelnen Cookies auswählen, welche Sie akzeptieren wollen. Das Einverständnis in die Verwendung der Cookies können Sie jederzeit, auch teilweise, widerrufen. Weitere Informationen zu Cookies auf dieser Website finden Sie in unserer Datenschutzerklärung und zu uns im Impressum. Einstellungen Erforderlich Zustimmen Diese Cookies werden für eine reibungslose Funktion unserer Website benötigt. Name Zweck Ablauf Typ Anbieter CookieConsent Speichert Ihre Einwilligung zur Verwendung von Cookies. 1 Jahr HTML Website Schrift-Skalierung Zustimmen Name Zweck Ablauf Typ Anbieter FontScaler Aktiviert einige Schaltflächen am oberen Rand der Seite, um die Schriftgröße der Website zu skalieren 1 Monate HTML TU Clausthal Readspeaker Zustimmen Name Zweck Ablauf Typ Anbieter ReadSpeaker Aktiviert die Funktion \"Readspeaker\", die Teile einer Seite oder die ganze Seite vorliest, ohne dass eine zusätzliche Software installiert werden muss 1 Monate HTML TU Clausthal Druck-Schaltfläche Zustimmen Name Zweck Ablauf Typ Anbieter PrintButton Aktiviert eine Schaltfläche zum Ausdrucken der aktuellen Seite per Klick 1 Monate HTML TU Clausthal Marketing Zustimmen Name Zweck Ablauf Typ Anbieter _pk_id Wird verwendet, um ein paar Details über den Benutzer wie die eindeutige Besucher-ID zu speichern. 13 Monate HTML Matomo _pk_ref Wird benutzt, um die Informationen der Herkunftswebsite des Benutzers zu speichern. 6 Monate HTML Matomo _pk_ses Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo _pk_cvar Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo _pk_hsr Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo Alle Cookies ablehnen Speichern Alle Cookies akzeptieren",
  "content_length": 2705,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:17"
}