{
  "name": "Thorsten Joachims",
  "homepage": "http://www.cs.cornell.edu/people/tj",
  "status": "success",
  "content": "Home Page of Thorsten Joachims Home Page of Thorsten Joachims Jacob Gould Schurman Professor Department of Computer Science Department of Information Science Interim Dean Ann S. Bowers College of Computing and Information Science Cornell University Email: tj@cs.cornell.edu Phone: (607)255-5593 Fax: (607)255-5196 Address: 105 Gates Hall, Ithaca, NY 14853-7501 Executive Assistant: Caitlin Fields Bio Thorsten Joachims is a Jacob Gould Schurman Professor in the Department of Computer Science and in the Department of Information Science at Cornell University. He is the Interim Dean for Bowers CIS, and he has served as Associate Dean for Research and as Chair of the Department of Information Science. He is the Director of the Cornell AI Initiative and Radical Collaboration. He has served as Program Chair of the ICML, KDD and RecSys conferences, and he is a member of the IMLS Board and the SIGKDD Executive Committee. Thorsten Joachims joined Cornell in 2001 after finishing his Ph. D. as a student of Prof. Morik at the AI-unit of the University of Dortmund, from where he also received a Diplom in Computer Science in 1997. Between 2000 and 2001 he worked as a PostDoc at the GMD in the Knowledge Discovery Team of the Institute for Autonomous Intelligent Systems. From 1994 to 1996 he spent one and a half years at Carnegie Mellon University as a visiting scholar of Prof. Tom Mitchell. Working with his students and collaborators, his papers won 11 Best Paper Awards and 4 Test-of-Time Awards. Thorsten Joachims is an ACM Fellow, AAAI Fellow, and member of the SIGIR Academy. [Curriculum Vita] Research Topics Machine Learning Methods and Theory Learning from Human Behavioral Data and Implicit Feedback Machine Learning for Search Engines, Recommendation, Education, and other Human-Centered Tasks News, Resources, and Code RecSys 2023 Workshop on Causality, Counterfactuals & Sequential Decision-Making (CONSEQUENCES) ICML 2023 Workshop on Counterfactuals in Minds and Machines KDD 2022 Tutorial on Counterfactual Evaluation and Learning for Interactive Systems RecSys 2021 Tutorial on Counterfactual Evaluation and Learning for Recommender Systems SIGIR 2016 Tutorial on Counterfactual Evaluation and Learning Propensity SVM-Rank - software for learning ranking from partially labeled and biased data POEM - software for batch learning from bandit feedback via counterfactual risk minimization SVM-struct - a software package for predicting complex outputs (e.g. trees, alignments) with Support Vector Machines (access from China) SVM-light - a software package for Support Vector Learning (access from China) Dynamic Ranking - software for Dynamic Ranked Retrieval Spectral Graph Transducer (SGT) - software for transductive learning via spectral graph partitioning NSF Project: ArXiv as an Accessible Large-scale Open Research Platform NSF Project: Designing AI Systems with Steerable Long-Term Dynamics NSF Project: Fairness and Control of Exposure in Ranking NSF Project: Counterfactual Learning and Evaluation for Interactive Information Systems WebWatcher  - a tour guide for the World Wide Web. LASER - a retrieval engine for the Web that learns Teaching CS3780/5780 Introduction to Machine Learning, Fall 2024. CS6780 Advanced Machine Learning, Fall 2023, Spring 2019, Spring 2015. CS7792 Fairness and Dynamics of Learning Systems, Fall 2021. CS4780/5780 Introduction to Machine Learning, Spring 2021, (Fall 2020, Fall 2019, Fall 2014, Fall 2013, Fall 2012, Fall 2009, Spring 2008, Spring 2007, Spring 2006, Spring 2005, Spring 2004). CS7792 Bias and Fairness in Learning Systems, Spring 2020. CS7792 Counterfactual Machine Learning, Fall 2018, (Fall 2016). CS6784 Advanced Topics in Machine Learning, Spring 2014, (Fall 2010). CS/ENGRD2110 Object-Oriented Programming and Data Structures, Spring 2012, (Spring 2011). CS472/473 Foundations of Artificial Intelligence, Fall 2007, (Fall 2005). CS778 Topics in Machine Learning: Learning to Predict Structured Objects, Fall 2006. Ph.D. Students and Postdocs Filip Radlinski (Ph.D. 2008) Thomas Finley (Ph.D. 2008) Benyah Shaparenko (Ph.D. 2009) Chun-Nam Yu (Ph.D. 2010) Yisong Yue (Ph.D. 2010) Ruben Sipos (Ph.D. 2014) Pannaga Shivaswamy (Postdoc 2014) Joshua Moore (Ph.D. 2015) Karthik Raman (Ph.D. 2015) Shuo Chen (Ph.D. 2016) Adith Swaminathan (Ph.D. 2017) Pantelis Analytis (Postdoc 2018) Tobias Schnabel (Ph.D. 2018) Aman Agarwal (Ph.D. 2020) Rahul Kidambi (Postdoc 2020) Ashudeep Singh (Ph.D. 2021) Yi Su (Ph.D. 2021) Luke Lequn Wang (Ph.D. 2023) Aaron Tucker (Ph.D. 2024) Kianté Brantley (Postdoc 2024) Himank Yadav Joyce Zhou Yuta Saito Richa Rastogi Zhaolin Gao Haruka Kiyohara Cornell Cornell AI Initiative and Radical Collaboration Machine Learning at Cornell Artificial Intelligence at Cornell Center for Data Science for Enterprise and Society CS7790 AI Seminar CS7794 NLP Seminar Publications 2025 [Saito/etal/24a] Y. Saito, Yihan Yao, T. Joachims, POTEC: Off-Policy Contextual Bandits for Large Action Spaces via Policy Decomposition, International Conference on Learning Representations (ICLR), 2025. [PDF] [BibTeX] [Rastogi/etal/25a] R. Rastogi, Y. Saito, T. Joachims, MultiScale Contextual Bandits for Long-Term Objectives, Neural Information Processing Systems (NeurIPS), 2025. [PDF] [BibTeX] [Gao/etal/25a] Zhaolin Gao, Joyce Zhou, Yijia Dai, T. Joachims, End-to-end Training for Recommendation with Language-based User Profiles, ACM Conference on Information and Knowledge Management (CIKM), 2025. [PDF] [BibTeX] [Kiyohara/etal/25a] H. Kiyohara, Daniel Cao, Y. Saito, T. Joachims, An Off-Policy Learning Approach for Steering Sentence Generation towards Personalization, ACM Conference on Recommender Systems (RecSys), 2025. [PDF] [BibTeX] [Lee/etal/25a] Jinsook Lee, AJ Alvero, T. Joachims, R. Kizilcec, Poor Alignment and Steerability of Large Language Models: Evidence Using 30,000 College Admissions Essays, COLM Workshop on Social Simulations with LLMs, 2025. [PDF] [BibTeX] [Kiyohara/etal/25b] H. Kiyohara, R. Khanna, T. Joachims, Off-Policy Learning for Diversity-aware Candidate Retrieval in Two-stage Decisions, ACM RecSys Workshop on Causality, Counterfactuals and Sequential Decision Making (CONSEQUENCES), 2025. [PDF] [BibTeX] 2024 [Tucker/etal/24a] A. Tucker, K. Brantley, A. Cahall, T. Joachims, Coactive Learning for Large Language Models using Implicit Feedback, International Conference on Machine Learning (ICML), 2024. [PDF] [BibTeX] [Brantley/etal/24a] K. Brantley, Zhichong Fang, S. Dean, T. Joachims, Ranking with Long-Term Constraints, ACM Conference on Web Search and Data Mining (WSDM), 2024. [PDF] [BibTeX] [Rastogi/Joachims/24a] R. Rastogi, T. Joachims, Fairness in Ranking under Disparate Uncertainty, ACM Conference on Equity and Access in Algorithms, Mechanisms, and Optimization (EAAMO), 2024. [PDF] [BibTeX] [Lee/etal/24a] J. Lee, E. Harvey, Joyce Zhou, N. Garg, T. Joachims, R. Kizilcec, Ending Affirmative Action Harms Diversity Without Improving Academic Merit, ACM Conference on Equity and Access in Algorithms, Mechanisms, and Optimization (EAAMO), 2024. [PDF] [BibTeX] [Guo/etal/24a] Wentao Guo, Andrew Wang, B. Thymes, T. Joachims, Ranking with Slot Constraints, ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD), 2024. [PDF] [BibTeX] [Buchholz/etal/24a] A. Buchholz, B. London, G. Di Benedetto, J. Lichtenberg, Y. Stein, T. Joachims, Counterfactual Ranking Evaluation with Flexible Click Models, ACM Conference on Research and Development in Information Retrieval (SIGIR), 2024. [PDF] [BibTeX] [Gao/etal/24c] Zhaolin Gao, Jonathan Chang, Wenhao Zhan, O. Oertell, G. Swamy, K. Brantley, T. Joachims, A. Bagnell, Jason Lee, Wen Sun, REBEL: Reinforcement Learning via Regressing Relative Rewards, Neural Information Processing Systems (NeurIPS), 2024. [PDF] [BibTeX] [Alvero/etal/24a] A. J. Alvero, Jinsook Lee, A. Regla-Vargas, R. Kizilcec, T. Joachims, A. Antonio, Large Language Models, Social Demography, and Hegemony: Comparing Authorship in Human and Synthetic Text, Journal of Big Data, 11:138, Springer, 2024. [PDF] [BibTeX] [Zhou/etal/24a] Joyce Zhou, Yijia Dai, T. Joachims, Language-Based User Profiles for Recommendation, WSDM Workshop on Large Language Models for Individuals, Groups, and Society, 2024. [PDF] [BibTeX] [Kiyohara/etal/24a] H. Kiyohara, Y. Saito, Daniel Yiming Cao, T. Joachims, Prompt Optimization with Logged Bandit Data., ICLR Workshop on Navigating and Addressing Data Problems for Foundation Models (DPFM), 2024. [PDF] [BibTeX] [Gao/etal/24a] Zhaolin Gao, K. Brantley, T. Joachims, Reviewer2: Optimizing Review Generation Through Prompt Generation, Arxiv Preprint, 2024. [PDF] [BibTeX] [Rastogi/etal/24a] R. Rastogi, Y. Saito, T. Joachims, MultiScale Policy Learning for Alignment with Long Term Objectives, ICML Workshop on Models of Human Feedback for AI Alignment, 2024. [PDF] [BibTeX] [Gao/etal/24b] Zhaolin Gao, Joyce Zhou, Yijia Dai, T. Joachims, End-to-end Training for Recommendation with Language-based User Profiles, RecSys Workshop on Risks, Opportunities, and Evaluation of Generative Models in Recommender Systems (ROEGEN), 2024. [PDF] [BibTeX] 2023 [Gao/etal/23a] Ge Gao, Jonathan Chang, C. Cardie, K. Brantley, T. Joachims, Policy-Gradient Training of Language Models for Ranking, NeurIPS Workshop on Foundation Models for Decision Making, 2023. [PDF] [BibTeX] [Tucker/Joachims/23a] A. Tucker, T. Joachims, Variance-Optimal Augmentation Logging for Counterfactual Evaluation in Contextual Bandits, ACM Conference on Web Search and Data Mining (WSDM), 2023. [PDF] [BibTeX] [Tucker/etal/23a] A. Tucker, C. Biddulph, Claire Wang, T. Joachims, Bandits with Costly Reward Observations, Conference on Uncertainty in Artificial Intelligence (UAI), 2023. [PDF] [BibTeX] [Wang/Joachims/23a] Lequn Wang, T. Joachims, Uncertainty Quantification for Fairness in Two-Stage Recommender Systems, ACM Conference on Web Search and Data Mining (WSDM), 2023. [PDF] [BibTeX] [London/etal/23a] B. London, Levi Lu, T.",
  "content_length": 48199,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:14"
}