{
  "name": "Thu Duc Nguyen",
  "homepage": "https://www.cs.rutgers.edu/~tdnguyen",
  "status": "success",
  "content": "Thu D. Nguyen Thu D. NguyenDean of Mathematical and Physical SciencesSchool of Arts and SciencesRoom 106A, 77 Hamilton St, New Brunswick, NJmpsdean@sas.rutgers.edu(848) 932 6416ProfessorDepartment of Computer ScienceHill Center 409, 110 Frelinghuysen Rd, Piscataway, NJthu.nguyen@rutgers.edu(848) 445 8326 New Data Science Major at Rutgers-New Brunswick October 16, 2023 Rutgers-New Brunswick now offers an undergraduate certificate, minor, and major in Data Science. Article: From “Moneyball” to Medicine, Data Science is Emerging as Hot New Read More » 6th Annual NJ CS Summit on Scalability and Diversity April 25, 2022 The 6th Annual NJ CS Summit on Scalability and Diversity will be held in-person at Rutgers University-New Brunswick on Friday May 13th, 2022. From the Read More » CV | LinkedIn ProfileResearchDatacenters, Sustainability, Computer Systems, Approximate Computing, Computer Science EducationResearch GroupPublicationsHonors and AwardsRutgers Big Ten Academic Alliance Department Executive Officers Fellow, 2018.Environmental Conditions and Disk Reliability in Free-cooled Datacenters. FAST 2016. Best paper award.Designing and Managing Datacenters Powered by Renewable Energy.  IEEE Micro Top Picks 2014PlanetP: Using Gossiping to Build Content Addressable Peer-to-Peer Information Sharing Communities.  HPDC, 2003.  Republished in “Best Papers From The Last 20 Years of HPDC“, 2012.Capping the Brown Energy Consumption of Internet Services at Low Cost.  IGCC 2010.  Best paper award.  Also IEEE Sustainable Computing Register (Newsletter of the Computer Society Technical Community on Sustainable Computing) Pick of the Month, April 2012.CAREER: Recipe for the Taming of a Chimaera: Toward No-Futz Computing.  NSF CNS.  2005-2010.Faculty of the Year Award for Excellence in Teaching. Computer Science Graduate Student Society of Rutgers University, awarded in 2000 and 2002. rutgers.edu SAS CS Home Rutgers is an equal access/equal opportunity institution. Individuals with disabilities are encouraged to direct suggestions, comments, or complaints concerning any accessibility issues with Rutgers websites to accessibility@rutgers.edu or complete the Report Accessibility Barrier / Provide Feedback form. Copyright © , Rutgers, The State University of New Jersey. All rights reserved. Contact webmaster",
  "content_length": 2324,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:19"
}