{
  "name": "Tianyu Jiang 0001",
  "homepage": "https://jiangtianyu.com",
  "status": "success",
  "content": "Tianyu Jiang's Homepage Tianyu Jiang Assistant Professor Computer Science Department University of Cincinnati Office: Digital Futures 510I Email: tianyu.jiahahahahang@uc.edu Home News Lab Publications Teaching I am an Assistant Professor in the Computer Science department at the University of Cincinnati, where I established and direct the CincyNLP Lab. I received my Ph.D. in Computer Science from the University of Utah, advised by Prof. Ellen Riloff. Before that, I got my B.S. in Mathematics from Nanjing University. My main research interests are in the area of natural language processing, specifically in computational semantics, emotion understanding, multimodality, LLM efficiency and interpretability. News 2025-10: Serve as an Area Chair for EACL 2026, LREC 2026. 2025-08: 3 papers accepted to EMNLP 2025. 2025-07: Serve as an Area Chair for EMNLP 2025. 2025-05: 1 paper accepted to ACL 2025. 2025-03: I am honored to receive the 2025 URC Faculty Scholars Award. 2025-02: 1 paper accepted to NAACL 2025. Recent Preprints Sycophancy Is Not One Thing: Causal Separation of Sycophantic Behaviors in LLMs Daniel Vennemeyer, Phan Anh Duong, Tiffany Zhan, Tianyu Jiang arXiv:2509.21305, 2025 A Geometric Lens on LLM Abilities through Joint Embedding Item Response Theory Louie Hong Yao, Nicholas Jarvis, Tiffany Zhan, Saptarshi Ghosh, Linfeng Liu, Tianyu Jiang arXiv:2509.22888, 2025 Evaluating the Impact of Verbal Multiword Expressions on Machine Translation Linfeng Liu, Saptarshi Ghosh, Tianyu Jiang arXiv:2508.17458, 2025 Towards Robust Evaluation of Visual Activity Recognition: Resolving Verb Ambiguity with Sense Clustering Louie Hong Yao, Nicholas Jarvis, Tianyu Jiang arXiv:2508.04945, 2025 Publications GuessingGame: Measuring the Informativeness of Open-Ended Questions in Large Language Models Dylan Hutson, Daniel Vennemeyer, Aneesh Deshmukh, Justin Zhan, Tianyu Jiang To appear in Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025) Do LLMs Encode Frame Semantics? Evidence from Frame Identification Jayanth Krishna Chundru, Rudrashis Poddar, Jie Cao, Tianyu Jiang To appear in Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025) Anatomy of a Feeling: Narrating Embodied Emotions via Large Vision-Language Models Mohammad Saim, Phan Anh Duong, Cat Luong, Aniket Bhanderi, Tianyu Jiang To appear in Findings of the 2025 Conference on Empirical Methods in Natural Language Processing (Findings of EMNLP 2025) CHEER-Ekman: Fine-grained Embodied Emotion Classification Phan Anh Duong, Cat Luong, Divyesh Bommana, Tianyu Jiang In Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025) ConMeC: A Dataset for Metonymy Resolution with Common Nouns Saptarshi Ghosh, Tianyu Jiang In Proceedings of the 2025 Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics (NAACL 2025) My Heart Skipped a Beat! Recognizing Expressions of Embodied Emotion in Natural Language Yuan Zhuang, Tianyu Jiang, Ellen Riloff In Proceedings of the 2024 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL 2024) Commonsense Knowledge of Prototypical Functions for Natural Language Processing Tianyu Jiang Ph.D. Dissertation, University of Utah, 2023 Exploiting Commonsense Knowledge about Objects for Visual Activity Recognition Tianyu Jiang, Ellen Riloff In Findings of the 61st Annual Meeting of the Association for Computational Linguistics (Findings of ACL 2023) Identifying Physical Object Use in Sentences Tianyu Jiang, Ellen Riloff In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022) Learning Prototypical Functions for Physical Artifacts Tianyu Jiang, Ellen Riloff In Proceedings of the Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL 2021) Exploiting Definitions for Frame Identification Tianyu Jiang, Ellen Riloff In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics (EACL 2021) Affective Event Classification with Discourse-enhanced Self-training Yuan Zhuang, Tianyu Jiang, Ellen Riloff In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP 2020) [dataset] Learning Prototypical Goal Activities for Locations Tianyu Jiang, Ellen Riloff In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (ACL 2018) Why is an Event Affective? Classifying Affective Events based on Human Needs Haibo Ding, Tianyu Jiang, Ellen Riloff In AAAI-18 Workshop on Affective Content Analysis (AFFCON 2018) [dataset] Teaching CS 7052: Advanced Topics in Natural Language Processing (Spring 2025), University of Cincinnati CS 5034/6134: Natural Language Processing (Fall 2024), University of Cincinnati CS 5034/6134: Natural Language Processing (Spring 2024), University of Cincinnati",
  "content_length": 5113,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:26"
}