{
  "name": "Tianlong Chen 0001",
  "homepage": "https://tianlong-chen.github.io",
  "status": "success",
  "content": "Tianlong Chen | UNC Chapel Hill Tianlong Chen Assistant Professor, CS@UNC at Chapel Hill Chief AI Scientist, hireEZ tianlong@cs.unc.edu Bio Tianlong Chen starts as an Assistant Professor of Computer Science at The University of North Carolina at Chapel Hill in Fall 2024. He received the Ph.D. degree in Electrical and Computer Engineering from University of Texas at Austin, TX, USA, in 2023. His research focuses on building accurate, trustworthy, and efficient machine learning systems. He received Amazon Research Award (Fall 2024 and Spring 2025), Cisco Faculty Award (2024 and 2025), AAAI'25 New Faculty Highlights, NAIRR Pilot Award, UNC Accelerating AI Award, CPAL Rising Star, AdvML Rising Star, OpenAI Researcher Access Award, Gemma Academic Program GCP Credit Award, IBM Ph.D. Fellowship, Adobe Ph.D. Fellowship, Graduate Dean's Prestigious Fellowship, Low-Resource Methods for NLP SAC Award at NAACL 2025, the Best Paper Award at LoG 2022, Marco Ramoni Distinguished Paper Award at AMIA-IS 2025, the Best Paper Award at GenAI4Health at AAAI 2025, Best Demo Paper Award at GenAI4Health at NeurIPS 2024, and the Best Paper Runners-Up Award at Medicine and Healthcare Bridge at AAAI’25. I am looking for highly motivated students, in terms of RA/TA/externship/internship/visiting students. Interested candidates are strongly encouraged to contact me by email, together with resume and transcripts. News 2025 2024 2023 • Sep., 2025 [HONOR] Honored to be one of the recipients of the Amazon Research Award for Spring 2025. Many thanks for the acknowledgment. • Aug., 2025 [HONOR] Grateful to receive a gift funding from Cisco Research. Many thanks for the acknowledgment. • Aug., 2025 [STATUS] UNITES welcomes 11 new members (8 Ph.D. + 2 Postdoc + 1 M.S.): Mohan Zhang (USTC) + Yuhang Cheng (Wuhan University) + Kangqi Ni (RICE) + Laura Yao (CMU) + Yu-Chao Huang (National Taiwan University) + Zijie Liu (WashU) + Zhuoxuan Zhang (Brown) + Shuqing Luo (PKU) + Jinhao Duan (Drexel) + Gengwei Zhang (UTS) + Zhen Xu (Zhejiang University). Three of them get delayed due to VISA constraints. • Aug., 2025 [PAPER] 9 EMNLP'25 (6 Main + 3 Findings) accepted - Next Agent Prediction + Embodied Reward Model with Test-time Scaling + Bit Flip Error Resilience in LLMs + Instruction-Driven Routing for MoE + Adaptive Resolution for VLLMs + MedHallucinations Benchmark + Large-scale Parameter Generation + Training Strategies for MoE + Efficient Long Context Inference w. LLMs. • Jul, 2025 [PAPER] 1 COLM'25 accepted - Multi-model Safety Alignment. • Jun., 2025 [Workshop] NeurIPS'25 Workshop accepted - Lock-LLM . Call for Papers! • May, 2025 [PAPER] 10 ACL'25 (5 Main + 5 Findings) accepted - Long-term Personalized Dialogue Agents (Intergated in Google Gemini) + Indirect Attack in Multi-Agent Systems + UQ in LLM + Efficient LLM Recommender + Multi-Agent System for Content Analysis + Multi-omics Foundation Model + Spatial2Sentence + UQ-Merging + De-Identification in MLLM + Task-specific Privacy Vulnerabilities in MLLMs. • May, 2025 [PAPER] 1 JBI'25 (Journal of Biomedical Informatics) accepted - Personalized Graph Learning on EHRs. • May, 2025 [PAPER] 2 KDD'25 accepted - Graph Learning w. Missing Features + Trustworthy LLM Agent (Survey + Toturial). • May, 2025 [HONOR] Honored to be selected and attend the 12th Heidelberg Laureate Forum (HLF) 2025 . • May, 2025 [PAPER] 4 ICML'25 accepted - Communication Topology Designs in Multi-Agent System (Spotlight) + New MoE Parallism + Adaptive Multimodal Learning + Interpretable MoE. • Apr., 2025 [HONOR] Honored to be one of the recipients of the Amazon Research Award for Fall 2024. Many thanks for the acknowledgment. • Apr., 2025 [HONOR] Congratulations to Mohan Zhang, Pingzhi Li, and our amazing collaborators for wining the low-resource methods for NLP SAC Award at NAACL 2025. • Mar., 2025 [HONOR] Grateful for receiving two UNC Accelerating AI Awards from Office of The Provost at UNC. Many thanks for the acknowledgment. • Mar., 2025 [HONOR] Congratulations to UNITES and our amazing collaborators for wining the Marco Ramoni Distinguished Paper Award at AMIA-IS 2025. • Mar., 2025 [HONOR] Grateful for receiving the NAIRR Pilot Award in the field of Artificial Intelligence and Intelligent Systems. • Feb., 2025 [PAPER] 1 DMLR accepted - Diagnosis of Viral Infections via scRNA-seq Analysis. • Jan., 2025 [PAPER] 4 NAACL'25 accepted - Collaboration-Constrained Routing for MoE Efficiency + Balanced Preference Optimization in LLM Alignment + LLM-Guided Conversation in Autobiography Interviewing + Affirmative Token Mitigation for Jailbreak Defense. • Jan., 2025 [PAPER] 6 ICLR'25 accepted - Training-Free and Portable LLM Model Patches + Economical Multi-Agent Communication + Lifelong Multimodal Instruction Tuning + Composable LLMs Interventions + Proactive Privacy Amnesia for LLMs + Mixture-of-Graphs. Congratulations to Rana for his first 1st author ICLR paper. • Jan., 2025 [HONOR] I received the 2025 CPAL Rising Star Award and 2025 KAUST Rising Stars Award (Declined Due to VISA Constraints). Many thanks for the acknowledgment. • Jan., 2025 [HONOR] I received the AAAI New Faculty Highlights 2025. Many thanks for the acknowledgment. • Jan., 2025 [HONOR] Congratulations to UNITES and our amazing collaborators for wining the Best Paper Award at GenAI4Health at AAAI 2025. • Jan., 2025 [HONOR] Congratulations to UNITES and our amazing collaborators for wining the Best Paper Runners-Up Award at Medicine and Healthcare Bridge at AAAI 2025. • Jan., 2025 [HONOR] Grateful to receive a gift funding from Cisco Research. Many thanks for the acknowledgment. • Dec., 2024 [HONOR] Congratulations to Xinyu Zhao and our amazing collaborators for wining the Best Demo Paper Award at GenAI4Health at NeurIPS 2024. • Dec., 2024 [PAPER] 6 AAAI'25 accepted - Metacognitive AI in LLM + Visual Prompting Helps Sparsity + Brain Pathway Learning + UQ in LLMs + Disentangled Multimodal Learning + Sparsity Improves Certification. • Dec., 2024 [Workshop] Two ICLR'25 Workshop and One PAKDD'25 Workshop accepted - Sparsity in LLM + Scalable Optimization and Adaptive Foundation Model + Pervasive Computing. Call for Papers! • Nov., 2024 [PAPER] One KDD'25 accepted - C2C Recommendation Datasets (ADS Track). • Oct., 2024 [PAPER] Four NeurIPS'24 accepted - Flexible Modality Learning (Spotlight) + Game-Theoretic Evaluation for LLM Reasoning + Efficient, Fair, Robust Graph Learning + Model-Glue (Dataset and Benchmark Track). • Sep., 2024 [PAPER] Three EMNLP'24 accepted - LLM RAG Vulnerabilities + FFN-SkipLLM + Calibration LLM Pruning; Two EMNLP'24 Findings accepted - Synergized KG and LLM for AD + Cross-Lingual Multi-Hop Knowledge Editing. • Jul., 2024 [PAPER] Two ECCV'24 accepted - Multiplexed Immunofluorescence Image Analysis + Facial Affective Behavior Analysis. Congratulations to Sukwon Yun for his first 1st author ECCV paper. • Jul., 2024 [STATUS] I started my Assistant Professor position at CS@UNC Chapel Hill. • May, 2024 [PAPER] Six ICML'24 accepted - ZO LLM Tuning + Graph Sparsification + Rliabile SMoE + Biologial-informed Protein Representation Learning + Sparse Cocktail + TrustLLM (Position Paper). • Apr., 2024 [PAPER] One Bioinformatics accepted - scRNA Imputation via Bi-level Feature Propagation. • Apr., 2024 [Tutorial] Our tutorial of \"Mixture-of-Experts in the Era of LLMs: A New Odyssey\" has been accepted by ICML'24. See you at Vienna! • Mar., 2024 [PAPER] One NAACL'24 accepted - Multiple LLM Agents Gaming. • Mar., 2024 [STATUS] UNITES welcomes six new Ph.D. students and one new M.S. student: Sukwon Yun (KAIST), Xinyu Zhao (Peking University), Pingzhi Li (USTC), Mufan Qiu (USTC), Huanzhi Qu (USTC), Rana Muhammad Shahroz Khan (Vanderbilt University), and Ruichen Zhang (Shandong University). • Mar., 2024 [PAPER] Two CVPR'24 accepted - Diffusion Quantization + Molecular Data Programming. • Feb., 2024 [PAPER] Two ICLR'24 accepted - SMoE Merging (Spotlight) + Multilingual SMoE. Congratulations to Pingzhi Li and Xinyu Zhao for their first 1st author ICLR papers. • Jan., 2024 [Tutorial] Our tutorial of \"Zeroth-Order Machine Learning: Fundamental Principles and Emerging Applications in Foundation Models\" has been accepted by AAAI'24 and ICASSP'24. • Jan., 2024 [PAPER] One EACL'24 accepted - LLM + Knowledge Graph. • Dec., 2023 [PAPER] One AAAI'24 accepted - Metacognitive Intervention for LLMs via Sparsity. • Nov., 2023 [HONOR] Congratulations to Pingzhi Li and our amazing collaborators for wining the 1st place at 2023 Quantum Computing for Drug Discovery Challenge at ICCAD. • Sep., 2023 [PAPER] Two NeurIPS'23 accepted - Essential Sparsity in LLM + LLM Heavy-Hitter Oracle. • Jul., 2023 [STATUS] I started my PostDoc at CSAIL@MIT and BMI@Harvard. • Jul., 2023 [PAPER] Three ICCV'23 accepted - Adaptive Multi-Task Vision MoE + Robust MoE (Oral) + Generalizable NeRF w. MoE. • Jul., 2023 [PAPER] One QCE'23 accepted - Sparse Circuit Design for Quantum Computing. • Jun., 2023 [HONOR] I received the 2023 AdvML Rising Star Award . Many thanks for the acknowledgment. • May, 2023 [PAPER] One ACL'23 accepted - Sparse LLM Tuning. • May, 2023 [PAPER] Three ICML'23 accepted - Instant Soup (Oral) + Graph Ladling + L2O Game. • May, 2023 [STATUS] I received the Ph.D. degree from ECE@UT Austin. I deeply appreciate all the support and help from my family, advisor (Prof. Atlas Wang) , collaborators, and friends! UNITES Lab University of North Carolina, AI Trustworthiness, Efficiency, and for Science (UNITES) Group is an active research lab at UNC Chapel Hill. Ph.D. PostDoc Master Pingzhi Li, B.E., USTC, Aug. 2024 - Mufan Qiu, B.S., USTC, Aug. 2024 - Huaizhi Qu, B.E., USTC, Aug. 2024 - Xinyu Zhao, M.S., Peking Uiversity, Aug. 2024 - Rana Muhammad Shahroz Khan, B.S., Vanderbilt University, Aug. 2024 - Mohan Zhang, B.E., USTC, Aug. 2025 - Yuhang Chen, B.S., Wuhan University, Aug. 2025 - Kangqi Ni, B.S., Rice University, Aug. 2025 - Laura Yao, B.S., Carnegie Mellon University, Aug. 2025 - Yu-Chao Huan",
  "content_length": 11472,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:22"
}