{
  "name": "Tianshu Yu 0001",
  "homepage": "https://mypage.cuhk.edu.cn/academics/yutianshu",
  "status": "success",
  "content": "Tianshu Yu, 于天舒 Tianshu Yu Home LOGO Lab Publications Rrecruitment Projects Teaching Tianshu Yu, 于天舒 Assistant Professor School of Data Science The Chinese University of Hong Kong, Shenzhen Director LOGO Lab Researcher (affiliated) Shanghai AI Lab Office: TxB 615 Phone: +86 0755-23517067 Email: yutianshu [at] cuhk [dot] edu [dot] cn News I will give a talk on \"AI for Chemical Synthesis\" at department of chemistry, McGill University on 2:00pm Sep 10, 2025. I will be visiting MILA - Quebec AI Institute 4 months (Aug - Nov) 2025. Our paper with ChemLex on AI4Chemistry was accepted by Nature Communications. [2025.5] Brief Intro I joined SDS@CUHKSZ as an assistant professor on Sep, 2021. Previously I got my Ph.D. in computer science at Arizona State University, advised by professor Baoxin Li. My research interest covers several aspects of machine learning and discrete optimization. Generally, I like investigating theory and applications on machine learning of combinatorial problems on graph, and seeking its interpretation under deep learning framework. Currently, I am also interested in applying machine learning to solve traditional problems in science (AI4Science), especially in chemistry and material areas. Experience Oct 2021 - Jan 2024, AIRS, associate researcher (part-time) May 2020 - August 2020, AWS - Seattle, applied scientist intern. My mentors include Hao Li and Gurumurthy Swaminathan. Working on some projects on AutoML. May 2019 - August 2019, Adobe - Seattle, research intern. My mentors include Eli Shechtman, Connelly Barnes and Sohrab Amirghodsi. I was conducting a research of image inpainting via understanding the contextual layout of the scene. May 2017 - August 2017, IBM Research China - Shanghai, research intern (Great mind project). My mentor is Dr. Junchi Yan and my research is about joint cuts and matching of graphs. July 2012 - April 2014, Philips Product Creation Center - Shenyang, full-time Algorithm & Physics Engineer. My responsibility is developping algorithms for CT imaging. Services Editor-in-Chief, Science Digitalization, AIMS Publishing. Area Chair: ACL ARR 2025. Conf PC/reviewer: ICLR, ICML, NIPS, CVPR, ICCV, ECCV, AAAI(SPC), IJCAI. Journal Reviewer: IEEE Transactions on Neural Networks and Learning Systems (TNNLS), IEEE Transactions on Image Processing (TIP), Pattern Recognition, Pattern Recognition Letters Honors and Awards CIDSE Doctoral Fellowship, Arizona State University, Spring 2021 Engineering Graduate Fellowship, Arizona State University, 2018-2021 Alberta Innovates-Technology Futures Scholarship, University of Calgary, 2014-2016",
  "content_length": 2622,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:24"
}