{
  "name": "Tianfang Yao",
  "homepage": "http://bcmi.sjtu.edu.cn/~yaotianfang",
  "status": "success",
  "content": "Tianfang YAO's Homepage Tianfang YAO 姚天昉 ASSOCIATE PROF. Dr. Department of Computer Science and Engineering Email:yao-tf@cs.sjtu.edu.cn Tel.:(+86 - 21) 34205213 (O) Fax: (+86 - 21) 34204728 (O) Address Room 523, SEIEE Building 3, Department of Computer Science and Engineering, Shanghai Jiao Tong University, No. 800 Dong Chuan Rd., Shanghai 200240, China Research Interests · Opinion Mining · Information Retrieval · Information Extraction · Machine Learning ·\t Natural Language Generation · Corpus based NLP System · Machine Translation Education Background School · 1977 - 1978: Practice in a Radio Factory, Shanghai, China · 1974 - 1977: Technical School for Radio Techniques, Jian Guo Road (M), Shanghai, China · 1970 - 1974: Xin-Tian Middle School, Fu Xing Road (M), Shanghai, China · 1964 - 1970: Primary School, Huai Hai Road (M), Shanghai, China Studies and Qualification · Ph.D., Scientific-Technical Faculty I: Mathematics and Computer Science, Saarland University, Saarbrücken, Germany. 2005. · Thesis: A Study of Chinese Named Entity and Relation Identification in a Specific Domain · Supervisor: Prof. Dr. Hans Uszkoreit, Prof. Dr. Wolfgang Wahlster · 1999 – 2004: Ph.D. Candidate in the Department of Computer Science, the University of Saarland, Saarbrücken, Germany. · B.Eng., Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. 1982. · Thesis: The Analysis of PASCAL-S Compiler and Its Transplantation · Supervisor: Prof. Gao Hanqing, Prof. Liang Jinqin · 1978 - 1982: Undergraduate Studies at the Department of Computer Science and Engineering of Shanghai Jiao Tong University, Shanghai, China. Employment · 2009 - present: Associate Professor and Assistant Dean in the Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. · 2004 - 2009: Associate Professor in the Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. · 2001 - 2004: Research Staff in the Department of Computational Linguistics, the University of Saarland, Saarbrücken, Germany. · 1999 - 2001: Visiting Scholar in German Research Center for Artificial Intelligence (DFKI), Saarbrücken, Germany. · 1995 - 1999: Vice Chairman, Associate Professor and Project Leader in the Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. · 1993 - 1995: Associate Professor in the Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. · 1990 - 1993: Lecturer in the Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. · 1988 - 1990: Guest Researcher in China Commission, the University of Constance, Constance, Germany. Leader: Prof. Dr. Wolfgang Thomassen. · 1987 - 1988: Lecturer in the Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. · 1982 - 1987: Assistant in the Department of Computer Science and Engineering, Shanghai Jiao Tong University, Shanghai, China. Publications Opinion Mining · Tianfang Yao and Mosha Chen. Constructing Chinese Opinion-Element Collocation Dataset using Search Engine and Ontology. Chinese Lexical Semantics. Lecture Notes in Computer Science. Vol. 7717, 2013. pp. 332-343. · Tianfang Yao, Jun Liu, Wei Qiu. Mining Space-time Elements of Opinion. Proceeding of 2012 International Conference on Asian Language Processing (IALP 2012). Nov. 13-15, 2012. Hanoi, Vietnam. pp. 89-92. · 顾正甲，姚天昉. 评价对象及其倾向性的抽取. 中文信息学报. 第26卷第4期. 2012年7月. 第91-97页. · 卡哈尔江·阿比的热西提，吐尔根·依布拉音，姚天昉，艾山·吾买尔，艾山·毛力尼亚孜. 一种改进的维吾尔语句子相似度计算方法.中文信息学报. 第25卷第4期. 2011年7月. 第50页-53页. · 刘军，姚天昉，仇伟. 意见时空元素的研究. 中文信息学报. 第25卷第3期. 2011年5月. 第72页-78页. · 李婷玉，葛正荣，姚天昉. 汉语情感问题类型分类研究. 中文信息学报. 第25卷第2期. 2011年3月. 第94页-98页. · 刘全升，姚天昉. 基于关联度模型的文本倾向性检索研究. 中文信息学报. 第25卷第1期. 2011年1月. 第15页-19页. · Hongyan Song and Tianfang Yao. Active Learning Based Opinion Element Identification. Proceeding of the 2010 IRAST International Congress on Computer Application and Computational Science (CACS 2010). Dec. 4-6, 2010, Singapore. pp. 716-719. · 栾家阳，张文波，姚天昉. 基于汽车领域的情感问答系统设计与实现. 第五届全国青年计算语言学研讨会论文集. 武汉. 2010年10月. 第459-465页. · 葛正荣，李婷玉，姚天昉. 汉语情感问题类型分类研究. 第五届全国青年计算语言学研讨会论文集. 武汉. 2010年10月. 第324-330页. · Mosha Chen and Tianfang Yao. Combining Dependency Parsing with Shallow Semantic Analysis for Chinese Opinion-Element Relation Identification. Proceeding of the 2010 4th International Universal Communication Symposium. Oct. 18 - 19, 2010, Beijing, China. pp. 298-304. · 刘军，姚天昉. 利用Wikipedia计算语义相似度. 计算机工程. 第36卷第19期. 2010年10月. 第42-43页. · Hongyan Song and Tianfang Yao. Active Learning Based Corpus Annotation. Proceeding of the CIPS-SIGHAN Joint Conference on Chinese Language Processing. Aug. 28-29, 2010, Beijing, China. pp. 159-166. · 刘全升，姚天昉. 基于关联度模型的文本倾向性检索研究. 第六届全国信息检索学术会议（CCIR 2010）论文集. 镜泊湖. 2010年8月. 第699-706页. · 仇伟，黄高辉，姚天昉. 基于HowNet的汉语情感问句二层分类. 第六届全国信息检索学术会议（CCIR 2010）论文集. 镜泊湖. 2010年8月. 第618-627页. · 黄高辉，姚天昉. 基于CRF算法的汉语比较句识别和关系抽取. 计算机应用研究. 2010年第6或7期. 第27卷第6期. 2010年6月. 第2061-2064页. · Hongyan Song and Tianfang Yao. Improving Chinese Topic Extraction Using Word Sense Disambiguation Information. In Proc of the Fourth International Conference on Innovative Computing, Information and Control. December 7 - 9, 2009, Kaohsiung, Taiwan. · 陈漠沙，王睿，张潇君，仇伟，章毅，李婷玉，张文波，姚天昉. Analysis of the Evaluation Results for our Tasks in COAE2009. 第二届中文倾向性分析评测研讨会（COAE2009）论文集. 上海，2009年11月. 第134-143页. · 许洪波，姚天昉，黄萱菁，唐慧丰，关峰，张瑾. 第二届中文倾向性分析评测技术报告. 第二届中文倾向性分析评测研讨会（COAE2009）论文集. 上海，2009年11月. 第1-23页. · 陈奇哲 刘全升 姚天昉. 汉语意见型语句主题与情感成分及关系抽取的研究. 第五届全国信息检索学术会议（CCIR’2009）论文集. 上海, 2009年11月.第504-512页. · 王睿，章毅，仇伟，陈漠沙，李婷玉，张文波，姚天昉. Combining Data-Driven Constituent and Dependency Parsers for CIPS-ParsEval-2009. 第一届汉语句法分析评测学术研讨会（CIPS-ParsEval-2009）论文集. 北京，2009年11月. 第138-144页. · 姚天昉，张霄凯. 一种网络非规范汉语词汇的识别方法. 全国第十届计算语言学学术会议(CNCCL-2009) 论文集. 烟台, 2009年7月. 第540 - 545页. · 姚天昉，张鑫. 一种基于正例的汉语意见型主观性文本分类方法. 第十二届中国少数民族语言信息处理学术研讨会论文集. 拉萨, 2009年7月. · Tianfang Yao and Linlin Li. A Kernel-based Sentiment Classification Approach for Chinese Sentences. In Proc of the 2009 World Congress on Computer Science and Information Engineering (CSIE 2009). Los Angeles, CA, USA. April 2, 2009. pp 513-518. · 宋鸿彦，刘军，姚天昉，刘全升，黄高辉. 汉语意见型主观性文本标注语料库的构建. 中文信息学报. 第23卷第二期. 2009年 3月. 123-128. · 刘军，刘全升，陈漠沙，宋鸿彦，黄高辉，张潇君，姚天昉. 第一届中文倾向性分析评测结果浅析. 第一届中文倾向性分析评测研讨会论文集. 北京, 2008年11月. 125-141. · 刘全升，姚天昉，黄高辉，刘军，宋鸿彦. 汉语意见型主观性文本类型体系的研究. 中文信息学报. 第22卷第六期. 2008年 11月. 63-68. · 宋鸿彦，刘军，姚天昉，刘全升，黄高辉. 汉语意见型主观性文本标注语料库构建. 全国第四届信息检索与内容安全会议论文集（上卷）. 北京, 2008年11月. 75-81. · Hang Yin and Tianfang Yao. Explicit Topic Identification and Analysis for Chinese Opinioned Sentences. In Proc of the 8th International Workshop for Autonomous System – Self-Organization, Management, and Control. Shanghai, China. Oct. 6, 2008. pp 177-183. · Xiaokai Zhang and Tianfang Yao. A Study of Network Informal Language using Minimal Supervision Approach. In Proc of the 8th International Workshop for Autonomous System – Self-Organization, Management, and Control. Shanghai, China. Oct. 6, 2008. Springer. pp 169-175. · 黄高辉，姚天昉，刘全升. 汉语意见型主观性语句类型分析. 第四届全国学生计算语言学会议论文集. 山西，2008年7月. 208-214. · 刘全升，姚天昉，黄高辉，刘军，宋鸿彦. 汉语意见型主观性文本类型体系的研究. 第四届全国学生计算语言学会议论文集. 山西，2008年7月. 215-221. · 方习文，姚天昉. 汉语极性词词典的设计和实现. 第一届全国知网研讨会（NHW2008）论文集. 北京，2008年5月. 38-46. · 姚天昉，程希文，徐飞玉，汉思?乌思克尔特，王睿. 文本意见挖掘综述. 中文信息学报. 第22卷第三期. 2008年 5月. 71-80. · Tianfang Yao, Decheng Lou, Xiwen Fang. Polarity Distinction for Chinese Sentiment Words. In (Eds.): Recent Advance of Chinese Computing Technologies. Chinese and Oriental Language Information Processing Society, Singapore. March, 2008. pp 118-121. · 姚天昉，彭思崴. 汉语主客观文本分类特征的研究. 计算机科学，第34卷第12期专刊. 2007年 12月. 176-178. · 姚天昉，彭思崴. 汉语主客观文本分类方法的研究. 第三届全国信息检索与内容安全学术会议论文集，苏州，2007年11月. 117-123. · 姚天昉，娄德成. 汉语情感词语义倾向判别的研究. 2007中文信息处理国际会议（ICCC2007）论文集，武汉，2007年10月. 221-225. · 姚天昉，娄德成. 汉语语句主题语义倾向分析方法的研究. 中文信息学报, 第21卷第五期. 2007年 9月. 73-79. · Linlin Li, Tianfang Yao. Kernel-based Sentiment Classification for Chinese Sentence. In Proc. of the 6th International Conference on Advanced Language Processing and Web Information Technology, Luoyang , China . Aug. 22-24, 2007. 27-32. · 姚天昉，娄德成. 汉语语句主题语义倾向分析方法的研究. 全国第九届计算语言学联合学术会议（JSCL-2007）论文集，大连，2007年8月. 582-587. · 娄德成，姚天昉. 汉语句子语义极性分析和观点抽取方法的研究. 计算机应用. 第26卷, 第11期. 2006年11月. 2622-2625. · 姚天昉，聂青阳，李建超，李林琳，娄德成，陈珂，付宇. 一个用于汉语汽车评论的意见挖掘系统. 见：曹右琦，孙茂松主编，中文信息处理前沿进展-中国中文信息学会二十五周年学术会议论文集. 清华大学出版社，北京，2006年11月. 260-281. Information Extraction and Information Retrieval · 杨瑞，胡弘思，张文波，姚天昉. 一种分布式网络爬虫的设计与实现. 第八届全国信息检索学术会议（CCIR 2012）. 南昌. 2012年11月. · Bao Jiana, Li Tingyu, and Yao Tianfang. Event Information Extraction Approach based on Complex Chinese Texts. Proceeding of 2012 International Conference on Asian Language Processing (IALP 2012). Nov. 13-15, 2012. Hanoi, Vietnam. pp. 61-64. · Hu Hongsi, Zhang Wenbo, Yao Tianfang. Paraphrase Extraction from Interactive Q&A Communities. Proceeding of the 8th International Conference on Computing and Networking Technology (ICCNT 2012, INC 2012, ICCIS 2012, ICMIC 2012). Aug. 27-29, 2012. Gyeongju, Korea. pp. 268-272. · 张文波，蒋春华，姚天昉. 基于贝叶斯及多模式串模糊匹配算法的不良短信甄别混合模型. 微型电脑应用. 第28卷第2期，2012年2月. 第31-34页. · Tianfang Yao and Jianchao Li. A Token-based Online Web-Snippet Clustering Approach based on Directed Probability Graph. Journal of Computational Information Systems, Vol. 5, No. 3, 2009. pp 1235-1244. · Tianfang Yao and Jianchao Li. A Token-based Online Web-Snippet Clustering Approach based on Directed Probability Graph. Proc. of NCIRCS’2008(The 2nd Vol.). Beijing, Nov. 2008. pp 194-204. · Jian Zhang and Tianfang Yao. A Study of the Identification of Authorship for Chinese Texts. In Proc. of the 2008 IEEE International Conference on Intelligence and Security Informatics, Taibei, Taiwan. June 17-20, 2008. pp 263-264. · Tianfang Yao and Hans Uszkoreit. Building a Lexical Sports Ontology for Chinese IE Using Reusable Strategy. In the Proceeding of the 4th International Conference on Fuzzy Systems and Knowledge Discovery (FSKD'07) Vol. 2, Haikou, China. 2007. 668-672. · Tianfan",
  "content_length": 34024,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:22"
}