{
  "name": "Tianyi Zhang 0001",
  "homepage": "https://tianyi-zhang.github.io",
  "status": "success",
  "content": "Biography - Tianyi Zhang Tianyi ZhangAssistant Professor, Department of Computer Science, Purdue University Follow West Lafayette, IN Email Twitter Github Google Scholar DBLP ORCIDTianyi Zhang is a Tenure-Track Assistant Professor of Computer Science and Societal Impact Fellow at Purdue University. At Purdue, he leads the Human-Centered Software Systems Lab, where he and his students develop intelligent systems that synergize human expertise with machine intelligence, with a particular focus on improving programming productivity and the robustness and safety of modern software. Prior to that, he was a Postdoctoral Fellow at Harvard University, working with Dr. Elena Glassman. He obtained his Ph.D. in CS from UCLA in 2019 under the supervision of Dr. Miryung Kim. His work has been recognized with an NSF Career Award, an Amazon Research Award, and Best Paper Honorable Mention Awards from SIGCHI and VAHC.ResearchMy research is in the intersection of Software Engineering, Human-Computer Interaction, and AI. I am broadly interested in building interactive intelligent systems that (1) augment human intelligence with data-driven insights and (2) augment machine intelligence with human guidance. Most of my work is designed for people in the programming domain, including software developers, novice programmers, data scientists, and computer end-users.My research today involves a lot of use of Large Language Models (LLMs). I believe LLMs are game changers but need to be guided and regulated by human or through symbolic methods that are more interpretable and controllable. I am actively working on the following topics.LLM for Coding [ICML'25][ICSE'25][CHI'25][EMNLP'24][UIST'24]Software Knowledge Extraction and Representation [ESEC/FSE'23][ASE'23]LLM for Software Safety and Robustness [EMNLP'25][FSE'25][ASE'24]In addition to developing technical approaches, I am also interested in understanding how LLMs work (FSE’24) and where they are limited (ICSE’25, CHI’24, CHI’22 LBW).News[Aug. 2025] SecureChain has been selected for NSF’s National AI Research Resource (NAIRR) Pilot! NSF news, Purdue news[Aug. 2025] Our paper on active contrastive decoding for hallucination mitigation was accepted to EMNLP 2025! Congratulations to Hongxiang![May 2025] Our paper on LLM attention steering for code generation was accepted to ICML 2025! Congratulations to Yuan![Apr. 2025] Our paper on multi-modal traffic scenario generation for autonomous driving testing was accepted to FSE 2025! Congratulations to Zhi![Apr. 2025] Our paper on programming mistakes and fixing patterns in data science was accepted to FSE 2025! Congratulations to Wei-Hao![Jan. 2025] Our paper on a fine-grained analysis of LLM-based code generation errors was accepted to the second round of ICSE 2025! Congratulations to Zhijie, Da, and Zijie![Jan. 2025] Our paper on a mixed-initiative multi-agent system for data wrangling was accepted to CHI 2025! Congratulations to Wei-Hao and Weixi![Dec. 2024] Our paper on mixed-initiative image labeling was accepted to IUI 2025! Congratulations to Shiyuan, Bingxuan, Xiyuan, Zhi, Yiwen, and Yifeng![Dec. 2024] Our paper on text-to-SQL data curation was accepted to IUI 2025! Congratulations to Yuan![Dec. 2024] Our paper on interactive program repair was accepted to the first round of OOPSLA 2025! Congratulations to Ruixin![Oct. 2024] Our paper on bidirectional grounding of LLM-based code generation was accepted to the first round of ICSE 2025! Congratulations to Yifeng![Sept. 2024] Our paper on LLM-as-a-judge for code generation was accepted to EMNLP 2024! Congratulations to Weixi![Aug. 2024] I received an NSF grant to support my research on autonomous driving testing. Thank you NSF![Aug. 2024] Our paper on using LLMs to generate Coq proofs for formal verification was accepted to ASE 2024! Congratulations to Minghai![Aug. 2024] Our paper on grounding text-to-SQL generation with interactive explanations was accepted to UIST 2024! Congratulations to Yuan![Jun. 2024] Prof. Priscilla Ding and I received a Showalter Trust Research Award to support our research on pre-diabetes risk prediction using behavioral determinants of health! Thank you Showalter Trust![Apr. 2024] Our paper on whether LLMs pay similar attention like human programmers when generating code was accepted to FSE 2024! Congratulations to Bonan, Shengmai, and Zhijie![Mar. 2024] I received an NSF Career Award to support my research on safe and reliable LLM-based code generation! Thank you NSF![Mar. 2024] Our paper about automated DL optimization was accepted to ISSTA 2024! Congratulations to Ruixin and Minghai![Feb. 2024] Our invited paper about text-to-SQL generation errors was accepted to TiiS! Congratulations to Zheng N., Yuan, and Zheng Z.![Jan. 2024] Our paper about ChatGPT vs. Stack Overflow was accepted to CHI 2024! Congratulations to Samia, David, and Bonan![Jan. 2024] Our paper about interactive debugging for ML fairness was accepted to CHI 2024! Congratulations to Samia and Lixiang![Jan. 2024] Our paper about prompt engineering for generative AI was accepted to CHI 2024! Congratulations to Zhijie, Yuheng, and Da![Oct. 2023] Our paper about interactive SQL generation was accepted to EMNLP 2023! Congratulations to Yuan![Aug. 2023] I received a $1.5M NSF grant to support our research on constructing a knowledge graph for software supply chain security. Thank you NSF![Jul. 2023] Our paper about noise-robust learning for software entity recognition was accepted to ASE 2023! Congratulations to Tai, Yifeng, and Joohan![Jun. 2023] Our paper about mixed-initiative web automation was accepted to UIST 2023! Congratulations to WeiHao, Xiaoyu, Jiacheng, Zhicheng, Nicole, and Rui![May 2023] Our paper about neuro-symbolic learning for rapid image labeling was accepted to KDD 2023! Congratulations to Yifeng, Zhi, Yiwen, Shiyuan, Xiyuan, and Bingxuan![May 2023] Our paper about knowledge extraction from Stack Overflow for DL version incompatibility detection was accepted to ESEC/FSE 2023! Congratulations to Zhongkai, Bonan, and Yilmaz![Mar. 2023] I received an Amazon Research Award to support my work on human-in-the-loop DL compiler optimization. Thank you Amazon![Jan. 2023] Our paper about state abstraction-based debugging for RNN models was accepted to CHI 2023! Congratulations to Zhijie, Yuheng, and Da![Jan. 2023] Our paper about interactive debugging for out-of-distribution errors in NLP models was accepted to CHI 2023! Congratulations to Da, Zhijie, and Yuheng![Jan. 2023] Our paper about model errors and user repair strategies in NL-based SQL generation models was accepted to IUI 2023! Congratulations to Zheng N., Zheng Z., Tianyi S., and Yuan![Dec. 2022] Our paper about automated summarization of Stack Overflow posts was accepted to ICSE 2023! Congratulations to Bonan![Aug. 2022] Our paper about declarative testing of autonomous driving systems was accepted to TSE 2022! Congratulations to Yao and Guannan![Jul. 2022] I was recognized as a Distinguished Reviewer for ESEC/FSE 2022![Jun. 2022] Our paper about interactive synthesis of tensor transformation programs was accepted to UIST 2022! Congratulations to Zhanhui, Tiger, Qiping, and Shangyin![Jun. 2022] Our paper about concept-annotated examples for library comparsion was accepted to UIST 2022! Congratulations to Litao![Jun. 2022] I received the Ross-Lynn Research Scholar Fund to support my research on knowledge acquisition from Stack Overflow. Thanks Purdue![Jun. 2022] I was selected as a Societal Impact Fellow at Purdue![Jun. 2022] Our paper about test reduction and prioritization for multi-module autonomous driving systems was accepted to ESEC/FSE 2022! Congratulations to Yao and Guannan![Jun. 2022] Our paper about the common practices and needs of testing autonomous driving systems was accepted to ESEC/FSE 2022! Congratulations to Guannan and Yao![Mar. 2022] Our paper about a dataset of Stack Overflow post summaries was accepted to the data/tool showcase track at MSR 2022! Congratulations to Bonan and Yifeng![Feb. 2022] Our paper about the usability of GitHub Copilot was accepted to CHI 2022 Late-Breaking Work! Congratulations to Priyan![Jan. 2022] Our paper about AI-based CPS was accepted to ICSE-SEIP 2022! Congratulations to Jiayang and Deyun![Oct. 2021] Our paper about interactive visual analytics for cohort analysis received an Honorable Mention Award from VAHC 2021![Aug. 2021] Our paper about interactive visual analytics for cohort analysis was accepted to VAHC 2021![Aug. 2021] I will teach a graduate seminar class on Human-AI Interaction this fall! Check the syllabus here![Apr. 2021] I will join Purdue CS as a tenure-track assistant professor this fall![Apr. 2021] I was recognized as a Distinguished Reviewer for ACM TOSEM![Mar. 2021] Our CHI 2021 paper “Visualizing Examples of Deep Neural Networks at Scale” received the Best Paper Honorable Mention Award from SIGCHI![Dec. 2020] Our paper about interpretable program synthesis was accepted to CHI 2021![Dec. 2020] Our paper about visualizing the distribution of design choices such as model structures and hyperparameter settings in a corpus of DNNs was accepted to CHI 2021! Congratulations to Litao![Aug. 2020] Our demo paper on debloating modern java applications was accepted to FSE 2020 Demonstration Track! Congratulations to Konner and Mihir![Aug. 2020] Our paper about example generation was accepted to FSE 2020 Industry Track! Congratulations to Celeste![Jun. 2020] Our paper about interactive program synthesis was accepted to UIST 2020!",
  "content_length": 9553,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:25"
}