{
  "name": "Tianfan Fu",
  "homepage": "https://futianfan.github.io",
  "status": "success",
  "content": "Tianfan Fu's Homepage Tianfan Fu Home Publications Contact Tianfan Fu's Homepage Tianfan Fu Tenure-track Associate Professor Department of Computer Science, Nanjing University (NJU) Email: futianfan@gmail.com Google Scholar CV Brief Introduction Tianfan Fu is an associate professor at Computer Science Department in Nanjing University (南京大学计算机系). He is a member of BigAI (AI with Large Model and Big Data) group led by Prof. Wu-Jun Li. Before that, he was a tenure-track assistant professor at Rensselaer Polytechnic Institute (RPI) Computer Science Department. He obtained PhD degree from the Department of Computational Science and Engineering at Georgia Institute of Technology in 2023, supervised by Prof. Jimeng Sun. He received his B.S. and M.S. degree at Department of Computer Science and Engineering from Shanghai Jiao Tong University in 2015 and 2018, respectively, supervised by Prof. Kai Yu and Prof. Yanmin Qian (2013-2014), Prof. Zhihua Zhang (2014-2018). 2025年秋季计划招收多名硕士研究生，2026年计划招收多名博士和硕士研究生。 Research Interests AI for Drug Discovery and Clinical Trial Large Language Model (LLM) AI for Science (Biology/Chemistry/Pharma/Health) AI for Healthcare News 01/2023 Our AI for Science paper is accepted by Nature. We will release the paper soon. 12/2022 Our 3rd AI for Science Workshop is successfully held in NeurIPS 2022. 09/2022 Reinforced genetic algorithm (drug design) paper is accepted by NeurIPS. 09/2022 Practical Molecule Optimization (PMO) benchmark (drug design) is accepted by NeurIPS Track on Datasets and Benchmarks. 07/2022 Our 2nd AI for Science Workshop is successfully held in ICML 2022. 06/2022 Our AI foundation for therapeutic science paper is accepted by Nature Chemical Biology. 05/2022 Two protein design (antibody design and fixed-backbone design) papers are accepted by KDD. 01/2022 Our differentiable molecular optimization (drug design) paper is accepted by ICLR. 01/2022 Our clinical trial outcome prediction paper is accepted by Cell Patterns and is selected as cover paper. 12/2021 Our 1st AI for Science Workshop is successfully held in NeurIPS 2021. Software DeepProtein for protein sequence learning Practical Molecule Optimization for drug molecule design Therapeutics Data Commons (TDC): AI foundation for therapeutic science DeepPurpose for drug-target interaction, drug repurposing and drug property prediction Textbook Collaborators and I translated Deep Learning (Goodfellow et al) (深度学习中译本) in 2017, which receives 200K+ comments at JD and 30K+ star at github Patents Clinical Trial Outcome Prediction 2023 Mobile authentication system and method based on voiceprint recognition, face recognition and location service 2013 Page generated 2017-09-24 14:52:39 Beijing Standard Time, by jemdoc.",
  "content_length": 2745,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:22"
}