{
  "name": "Tianwei Zhang 0004",
  "homepage": "https://personal.ntu.edu.sg/tianwei.zhang",
  "status": "success",
  "content": "Tianwei Zhang's Homepage Tianwei Zhang Associate Professor College of Computing and Data Science Nanyang Technological University Office: Blk N4, 02a-15, 50 Nanyang Ave, Singapore 639798 Tel: +65 67906277 Email: Biography I am an associate professor of College of Computing and Data Science at Nanyang Technological University. I received my Ph.D in Department of Electrical Engineering at Princeton University, and Bachelor's degree in Physics at Peking University. I have a broad interest in building trustworthy, efficient and intelligent systems. I do research mainly for fun. I find great satisfactory in seeing interesting ideas take shape, being concretely implemented, validated, and well-documented—far more rewarding than simply getting them published. I teach cyber security related courses for undergraduate students and master students at NTU. I am truly enjoying working with a team of brillient PhD students and research staffs, and exploring the unknown world together. I feel much happier seeing them achieve greater success than achieving it myself. In fact, they have indeed accomplished more than I have. Academic Appointments Deputy Director, Cyber Security Research Centre @ NTU (CYSREN), 2024 - Now Associate Director, NTU Centre Computational Technologies for Finance (CCTF), 2023 - Now Honors and Awards Nanyang Research Award (Young Investigator), 2025 Distinguished Artifact Award, CCS, 2024 Stamatis Vassiliadis Best Paper Award Nominee, FPL, 2024 Outstanding Paper Award, ACL, 2024 Distinguished Artifact Award, Usenix Security, 2024 Distinguished Paper Award, AISCC, 2024 Distinguished Paper Award, ASPLOS, 2023 Best Paper Award, BigDataSecurity, 2023 Best Associate Editor Award, IEEE TCSVT, 2023 Best Paper Award, ICDIS, 2022 Most Innovative Paper Award, ISPA, 2021",
  "content_length": 1799,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:26"
}