{
  "name": "Tianqi Chen 0001",
  "homepage": "https://tqchen.com",
  "status": "success",
  "content": "Tianqi Chen Tianqi Chen Teaching Open-Source Group Google Scholar Tianqi Chen Carnegie Mellon University Email: tqchen at cmu dot edu Google Scholar: Tianqi Chen Github: @tqchen Twitter: @tqchenml Office: GHC 8221 I am an Assistant Professor in the Machine Learning Department and Computer Science Department at Carnegie Mellon University . I am also a Distinguished Engineer at NVIDIA. I was the Chief Technologist of OctoAI(acquired by NVIDIA). I recently received my Ph.D. from Paul G. Allen School of Computer Science & Engineering, University of Washington. At UW, I was advised by Carlos Guestrin. I also worked closely with Luis Ceze and Arvind Krishnamurthy. I was a member of SAMPL Lab and MODE Lab. I recieved my Master and Bachelor's degree from Prof. Yong Yu's ACM Honors Class at Shanghai Jiao Tong University (SJTU). Research I am interested in the intersection of machine learning and systems. I like to bring a whole stack view from models, systems down to the low-level hardware backend to solve real world AI and systems problems. We are working on exciting problems across the spectrum together at CMU Catalyst Group. I am a believer of open source and open science. My group involves publishing algorithms in openly accessible mediums and building open-source machine learning systems that are widely adopted. Here are the ML systems that I started: MLC-LLM Universal LLM Deployment Engine with ML Compilation Apache TVM, an Automated End-to-End Optimizing Compiler for Deep Learning. XGBoost, a scalable tree boosting system. Apache MXNet(co-creator) Activity and Services Board President, MLSys Conference. PC Chair, MLSys 2023. Artifact Evaluation Chair, MLSys 2022 PC member of MLSys. Area Chair, ICML, NeurIPS. Information Prospective students FAQ Experience CMU, present Assistant Professor NVIDIA, present Distinguished Engineer OctoAI, 2019 - 2024 Chief Technologist. University of Washington, 2013 - 2019 Ph.D. student with Carlos Guestrin.",
  "content_length": 1969,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:23"
}