{
  "name": "Tianjia Shao",
  "homepage": "http://tianjiashao.com",
  "status": "success",
  "content": "Tianjia Shao, Zhejiang University Tianjia Shao ZJU100 Young Professor State Key Lab of CAD & CG College of Computer Science and Technology Zhejiang University address: Room 505 Mengminwei Building, Zijingang Campus, Zhejiang University, Hangzhou, 310058, China email: tjshao(AT)zju.edu.cn phone: (+86)0571-88206681-535 News & Events • I am looking for strongly-motivated PhD and Master students to join my research team. If you are interested in computer graphics and computer vision, please contact me. • [July 2022] I served as the Technical Papers Committee member of ACM SIGGRAPH 2023 at Los Angeles, USA. • [July 2021] I served as the Technical Papers Committee member of ACM SIGGRAPH 2022 at Vancouver, Canada. • [May 2019] I served as the Program Co-Chair of Computational Visual Media 2022 at Beijing, China. • [September 2020] I served as an associate editor for The Visual Computer. • [August 2019] I left University of Leeds and joined Zhejiang University. • [May 2018] I served as the Organizing Committee Co-Chair of Computational Visual Media 2019 at Bath, UK. Research My research focuses on the acquisition, reconstruction and generation of 3D contents in Computer Graphics and Computer Vision. My recent research includes 3D scene reconstruction (real-time dense SLAM, offline high-quality reconstruction, autonomous reconstruction with robots), digital human creation, and 3D AIGC. Biography Tianjia Shao is a ZJU100 Young Professor in the State Key Laboratory of CAD&CG, Zhejiang University. Previsouly He was a Lecturer in the School of Computing, University of Leeds, UK. He received his PhD in Computer Science from Institute for Advanced Study, Tsinghua University, under the guidance of Prof. Baining Guo, and his B.S. from the Department of Automation, Tsinghua University. During his PhD, he spent one year as a visiting researcher working with Prof. Niloy Mitra in University College London and four years as a research intern in Microsoft Research Asia. After that, he was an Assistant Researcher in the State Key Laboratory of CAD&CG, Zhejiang University. Publications (grouped by year): 2025, 2024, 2023, 2022, Before 2022 2025 High-fidelity 3D Object Generation from Single Image with RGBN-Volume Gaussian Reconstruction Model CVPR 2025 Yiyang Shen, Kun Zhou, He Wang, Yin Yang, Tianjia Shao [paper] [project page] Real-time High-fidelity Gaussian Human Avatars with Position-based Interpolation of Spatially Distributed MLPs CVPR 2025 Youyi Zhan, Tianjia Shao, Yin Yang, Kun Zhou [paper] [project page] EnliveningGS: Active Locomotion of 3DGS CVPR 2025 Siyuan Shen, Tianjia Shao, Kun Zhou, Chenfanfu Jiang, Yin Yang [paper] [project page] Gaussian Splashing: Unified Particles for Versatile Motion Synthesis and Rendering CVPR 2025 Yutao Feng, Xiang Feng, Yintong Shang, Ying Jiang, Chang Yu, Zeshun Zong, Tianjia Shao, Hongzhi Wu, Kun Zhou, Chenfanfu Jiang, Yin Yang [paper] [project page] GenesisTex2: Stable, Consistent and High-Quality Text-to-Texture Generation AAAI, 2025 Jiawei Lu, Yingpeng Zhang, Zengjun Zhao, He Wang, Kun Zhou, Tianjia Shao [paper] Relightable Detailed Human Reconstruction from Sparse Flashlight Images IEEE Transactions on Visualization and Computer Graphics 2025 Jiawei Lu, Tianjia Shao, He Wang, Yong-Liang Yang, Yin Yang, and Kun Zhou [paper] [code] Animatable 3D Gaussians for modeling dynamic humans Frontiers of Computer Science, 2025 Yukun Xu, Keyang Ye, Tianjia Shao, Yanlin Weng [paper] 2024 CPoser: An Optimization-after-Parsing Approach for Text-to-Pose Generation Using Large Language Models ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2024) Yumeng Li, Bohong Chen, Zhong Ren, Yao-Xiang Ding, Libin Liu, Tianjia Shao, Kun Zhou [paper] RTG-SLAM: Real-time 3D Reconstruction at Scale using Gaussian Splatting ACM SIGGRAPH 2024 Zhexi Peng, Tianjia Shao, Yong Liu, Jingke Zhou, Yin Yang, Jingdong Wang, Kun Zhou [project page] [paper] [code] X-SLAM: Scalable Dense SLAM for Task-aware Optimization using CSFD ACM Transactions on Graphics (Proc. of SIGGRAPH 2024) Zhexi Peng, Yin Yang, Tianjia Shao, Chenfanfu Jiang, Kun Zhou [project page] [paper] [code] 3D Gaussian Blendshapes for Head Avatar Animation ACM SIGGRAPH 2024 Shengjie Ma, Yanlin Weng, Tianjia Shao, Kun Zhou [project page] [paper] [code] Pattern Guided UV Recovery for Realistic Video Garment Texturing IEEE Transactions on Visualization and Computer Graphics 2024 Youyi Zhan, Tuanfeng Y. Wang, Tianjia Shao, Kun Zhou [project page] [paper] Personalized Audio-Driven 3D Facial Animation via Style-Content Disentanglement IEEE Transactions on Visualization and Computer Graphics 2024 Yujin Chai, Tianjia Shao, Yanlin Weng, Kun Zhou [project page] [paper] [code] PIE-NeRF: Physics-Based Interactive Elastodynamics with NeRF CVPR 2024 Yutao Feng, Yintong Shang, Xuan Li, Tianjia Shao, Chenfanfu Jiang, Yin Yang [project page] [paper] [code] SynTalker: Enabling Synergistic Full-Body Control in Prompt-Based Co-Speech Motion Generation ACM Multimedia 2024 Bohong Chen, Yumeng Li, Yao-Xiang Ding, Tianjia Shao, Kun Zhou [project page] [paper] [code] Understanding the vulnerability of skeleton-based Human Activity Recognition via black-box attack Pattern Recognition 2024 Yunfeng Diao, He Wang, Tianjia Shao, Yongliang Yang, Kun Zhou, David C. Hogg, Meng Wang [project page] [paper] 2023 A Locality-Based Neural Solver for Optical Motion Capture ACM SIGGRAPH Asia 2023 Xiaoyu Pan, Bowen Zheng, Xinwei Jiang, Guanglong Xu, Xianli Gu, Jingxiang Li, Qilong Kou, He Wang, Tianjia Shao, Kun Zhou, Xiaogang Jin [project page] [paper] [code] Adaptive Local Basis Functions for Shape Completion ACM SIGGRAPH 2023 Hui Ying, Tianjia Shao, He Wang, Yin Yang, Kun Zhou [paper] [code] Unsupervised image translation with distributional semantics awareness Computational Visual Media 2023 Zhexi Peng, He Wang, Yanlin Weng, Yin Yang, Tianjia Shao [paper] 2022 Predicting Loose-Fitting Garment Deformations Using Bone-Driven Motion Networks ACM SIGGRAPH 2022 Xiaoyu Pan, Jiaming Mai, Xinwei Jiang, Dongxue Tang, Jingxiang Li, Tianjia Shao, Kun Zhou, Xiaogang Jin, Dinesh Manocha [project page] [paper] [code] HoD-Net: High-Order Differentiable Deep Neural Networks and Applications AAAI 2022 Siyuan Shen, Tianjia Shao, Kun Zhou, Chenfanfu Jiang, Feng Luo, Yin Yang [paper] [code] Pose Guided Image Generation from Misaligned Sources via Residual Flow Based Correction AAAI 2022 Jiawei Lu, He Wang, Tianjia Shao, Yin Yang, Kun Zhou [paper] [code] Before 2022 EyelashNet: A Dataset and A Baseline Method for Eyelash Matting ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2021) Qinjie Xiao, Hanyuan Zhang, Zhaorui Zhang, Yiqian Wu, Luyuan Wang, Xiaogang Jin, Xinwei Jiang, Yongliang Yang, Tianjia Shao, Kun Zhou [project page] [paper] High-order Differentiable Autoencoder for Nonlinear Model Reduction ACM Transactions on Graphics (Proc. of SIGGRAPH 2021) Siyuan Shen, Yang Yin, Tianjia Shao, He Wang, Chenfanfu Jiang, Lei Lan, Kun Zhou [paper] [video] Unsupervised Image Generation with Infinite Generative Adversarial Networks ICCV 2021 Hui Ying, He Wang, Tianjia Shao, Yin Yang, Kun Zhou [paper] [code] BASAR:Black-box Attack on Skeletal Action Recognition CVPR 2021 Yunfeng Diao, Tianjia Shao, Yongliang Yang, Kun Zhou, He Wang [project page] [paper] [supplementary] [video] [code] Understanding the Robustness of Skeleton-based Action Recognition under Adversarial Attack CVPR 2021 He Wang, Feixiang He, Zhexi Peng, Tianjia Shao, Yongliang Yang, Kun Zhou, David Hogg [project page] [paper] [supplementary] [video] [code] Structure-aware Person Image Generation with Pose Decomposition and Semantic Correlation AAAI 2021 Jilin Tang, Yi Yuan, Tianjia Shao, Yong Liu, Mengmeng Wang, Kun Zhou [paper] One-shot Face Reenactment Using Appearance Adaptive Normalization AAAI 2021 Guangming Yao, Tianjia Shao, Yi Yuan, Shuang Li, Shanqi Liu, Yong Liu, Mengmeng Wang, Kun Zhou [paper] In-game Residential Home Planning via Visual Context-aware Global Relation Learning AAAI 2021 Lijuan Liu, Yin Yang, Yi Yuan, Tianjia Shao, He Wang, Kun Zhou [paper] EmbedMask: Embedding Coupling for Instance Segmentation IJCAI 2021 Hui Ying, Zhaojin Huang, Shu Liu, Tianjia Shao, Kun Zhou [paper] [code] Mesh Guided One-shot Face Reenactment Using Graph Convolutional Networks ACM MM 2020 Guangming Yao, Yi Yuan, Tianjia Shao, Kun Zhou [paper] Dynamic Future Net: Diversified Human Motion Generation ACM MM 2020 Wenheng Chen, He Wang, Yi Yuan, Tianjia Shao, Kun Zhou [paper] Towards High-Fidelity 3D Face Reconstruction from In-the-Wild Images Using Graph Convolutional Networks CVPR 2020 Jiangke Lin, Yi Yuan, Tianjia Shao, Kun Zhou [paper] [code] Learning an Intrinsic Garment Space for Interactive Authoring of Garment Animation ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2019) Tuanfeng Y. Wang, Tianjia Shao, Kai Fu, Niloy Mitra [project page] [paper] [code] Accelerated Complex Step Finite Difference for Expedient Deformable Simulation ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2019) Ran Luo, Weiwei Xu, Tianjia Shao, Hongyi Xu, Yin Yang [paper] [video] [code] NNWarp: Neural Network-based Nonlinear Deformation IEEE Transactions on Visualization and Computer Graphics, 2019 Ran Luo, Tianjia Shao, Huaming Wang, Weiwei Xu, Xiang Chen, Kun Zhou, Yin Yang [paper] AutoSweep: Recovering 3D Editable Objects from a Single Photograph IEEE Transactions on Visualization and Computer Graphics, 2018 Xin Chen, Yuwei Li, Xi Luo, Tianjia Shao, Jingyi Yu, Kun Zhou, Youyi Zheng [paper] Automatic Mechanism Modeling from a Single Image with CNNs Computer Graphics Forum (Proc. of PG 2018) Minmin Lin, Tianjia Shao, Youyi Zheng, Zhong Ren, Ying Yang [paper] [video] Warp-Guided GANs for Single-Photo Facial Animation ACM Transactions on Graphics (Proc. of SIGGRAPH Asia 2018) Jiahao Geng, Tianjia Shao, Youyi Zheng, Yanlin Weng, Kun Zhou [paper] H-CNN: Spatial Hashing Based CNN for 3D Shape Analysis IEEE Transactions on Visualization and Computer Graphics, 2018 T",
  "content_length": 12659,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:24"
}