{
  "name": "Tianzheng Wang 0001",
  "homepage": "http://www.cs.sfu.ca/~tzwang",
  "status": "success",
  "content": "Tianzheng Wang - SFU School of Computing Science Home Biography Publications Service Teaching Students Calendar Prospective Students Overview My research centres around the making of database systems in the context of modern hardware, new programming language features, and new applications. The goal of my work is to build systems that both run fast and are easy to implement. My work also extends to related areas such as operating systems, parallel programming and distributed systems. Most work in my lab is open-source and some has been adopted by real products, such as Amazon Redshift which uses the Serial Safety Net, and DragonflyDB which adopts Dash. My lab is part of the Data Science Research Group and Systems Group at SFU. Fall 2026 admission cycle: See details here! Recent Work and Activities Latency/scheduling optimizations in database systems: PreemptDB [SIGMOD '25], MosaicDB [VLDB '24], CoroBase [VLDB '21] Efficient parallel programming for DBMS and beyond: Tabular [VLDB '25], OptiQL [SIGMOD '24] Indexing on disaggregated memory: DEX [VLDB '24] Systems aspects of online schema evolution: Tesseract [VLDB '23] New workshop: Workshop on Hybrid Transactional/Analytical Processing Systems (HTAPSys) at ICDE 2026 Spring 2026 teaching: CMPT 454 Database Systems II (cross-listed with CMPT 984) Awards and Honours ACM SIGMOD Best Paper Award, 2025 (PreemptDB) Distinguished Reviewer, VLDB 2024, VLDB 2023, SIGMOD 2022, SIGMOD 2021 ACM SIGMOD Research Highlight Award, 2023 (Skeena), 2021 (Dash) ACM TODS \"Bests of SIGMOD\" Invitation, 2022 IEEE TCSC Award for Excellence in Scalable Computing (Early Career Researchers), 2019 Prospective Students For PhD studies: Please apply to the SFU CS PhD program and list me as a potential advisor. Thesis MSc offers are made only in very exceptional cases. SFU undergrads: If you liked CMPT 201/295/300/454 and are interested in graduate studies or research (CMPT 415/416/Capstone), feel free to email me. Non-SFU undergrads: We only host research interns through the Undergraduate Student Research Awards (USRA) or Mitacs Globlink Internship. Highschool students: Make sure you have good grasp of topics covered in SFU CMPT 201 and CMPT 295 before contacting. Links Checkout Ktau! A company by colleagues working on generative engine optimization (GEO). Gradschool application advice godbolt.org LaTeX tables generator",
  "content_length": 2378,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:29"
}