{
  "name": "Tianyin Xu",
  "homepage": "https://tianyin.github.io",
  "status": "success",
  "content": "Tianyin Xu's Homepage Tianyin Xu Associate Professor Department of Computer Science (Courtesy appointment by ECE) University of Illinois at Urbana-Champaign 4108 Siebel Center (direction) tyxu at illinois dot edu || @tianyin_xu (huh?) Assistant: Ruth Anders (rutha at illinois dot edu) $ echo \"Join us on UIUC SysNet Slack channels: uiuc-sysnet.slack.com.\" $ echo \"Check out CS CARES and reach out to us, especially when you need help!\" $ echo \"Please consider contributing to SIGOPS Blog.\" $ echo \"I co-organize UIUC Systems Research Seminar.\" $ whoami This is Tianyin, a watchman in the cornfields who tries to do relevant systems research. More professionally, I am an ass prof in the Department of Computer Science at the University of Illinois Urbana-Champaign (UIUC). I'm also affiliated with the Department of Electrical and Computer Engineering at UIUC. I spent a wonderful summer at Microsoft Research Asia in 2025, where I had the opportunity to learn and think more about AI and its implications. In 2017, I spent a year at Facebook's Core Systems, working on dealing with datacenter failures and eating free food (see my interview by Facebook). I spent six wonderful years at sysnet at the University of California San Diego until my rock star advisor kicked me out (I wished to be a tenured grad student1). I worked with NetApp to study production data ontap. I had a short experience at Whova where I learned dedication. I also worked in Germany at Goettingen and backpacked Europe for 1.5 years before starting my grad school. As a \"professor\", my meta-advice is to be serious and sincere to life and work. Winter is coming! Don't fight a fake war or someone else's war. Fight for what matters to the living or the dead. I am a part of CS CARES. If you need help, please don't hesitate to reach out -- you'll never walk alone. 1 I am constantly looking for such a job. Please contact me if you have or know one. $ head research_interests The goal of my research is to make computer systems reliable and secure, especially those operating at the cloud and datacenter scale. My mission is to help today's systems defend against all kinds of errors and defects, such as software bugs, configuration errors, and design flaws. I am very happy that some of our work helps improve reliability of real-world systems (check out bugs we detected/fixed). I am interested in all kinds of black magic. My view of systems research is to build the right swords to fight the dragon (not windmills). $ ls -l publication lrwxrwxrwx 1 tianyin tianyin 4 Feb 30 12:61 publication -> pub.html $ cat teaching # (read this if you are asking me for a letter) CS 598(XU): Reliability of Cloud-Scale Systems (Fall 18) (Spring 19) (Spring 22) CS 523: Advanced Operating Systems (Fall 19) (Fall 20) (Fall 21) (Spring 23) (Spring 24) (Spring 25) CS 423: Operating System Design (Spring 20) (Fall 22) (Fall 23) (Fall 24) (Fall 25) CS 591(SN): Systems Research Seminar (Spring 19) (Fall 19) (Spring 20) (Fall 20) (Spring 21) (Fall 21) (Spring 22) (Fall 22) (Spring 23) (Fall 23) (Spring 24) (Fall 24) (Spring 25) (Fall 25) CS 591(SE): Software Engineering Seminar (Fall 19) (Spring 20) (Fall 20) (Spring 21) (Fall 21) (Spring 22) (Fall 22) $ head awards 2025 First place, GenAI-accelerated TLA+ Challenge (Specula) 2025 Best Paper Award at ASPLOS'25 (cxlfork) 2025 Spotlight (also selected for oral) at ICML'25 (ITBench) 2025 (Spring) UIUC List of Teachers Ranked as Excellent (CS 591SN) 2024 Jay Lepreau Best Paper Award at OSDI'24 (Anvil) 2024 C.W. Gear Outstanding Junior Faculty Award (tribute to Professor C.W. Gear) 2024 Dean's Award for Excellence in Research 2024 (Spring) UIUC List of Teachers Ranked as Excellent (CS 591SN) 2023 Gilles Muller Best Artifact Award at EuroSys'23 (CSI Failures) 2023 (Fall) UIUC List of Teachers Ranked as Excellent (CS 591SN) 2023 (Spring) UIUC List of Teachers Ranked as Excellent (CS 523) 2022 Intel Rising Star Faculty Award 2022 NSF CAREER Award 2021 Facebook Academic of the Month 2021 Best Student Paper Award at SIGCOMM'21 (Cellular Reliability) 2021 SIGSOFT Distinguished Paper Award at FSE'21 (Vet) 2021 SIGSOFT Distinguished Paper Award at ISSTA'21 (Ctest-prio) 2021 (Fall) UIUC List of Teachers Ranked as Outstanding (CS 591DS) 2020 Facebook Distributed Systems Research Award 2020 Best Paper Award at ASPLOS'20 (ECPT) 2020 (Fall) UIUC List of Teachers Ranked as Excellent (CS 523) 2020 Best Paper and Best Student Paper Finalist at SC'20 (KScope) 2019 Best Demo Award at MobiCom'19 (DAOW) 2019 (Fall) UIUC List of Teachers Ranked as Excellent (CS 523) 2019 (Spring) UIUC List of Teachers Ranked as Excellent (CS 598) 2018 (Fall) UIUC List of Teachers Ranked as Excellent (CS 598) 2017 UCSD CSE Doctoral Award for Research 2016 Jay Lepreau Best Paper Award at OSDI'16 (PCheck) 2010 Erasmus Mundus LiSUM Scholarship 2009 Best Paper Award at ICC'09 (DTStream) $ cat impacts Defining System Intelligence at SIGOPS Blog The Next Horizon of System Intelligence at SIGOPS Blog Stratus is spotlighted by IBM Blog. Jinghao presented Rex at Open Source Summit and Linux Plumbers Conference (LPC), 2025 Jackson gave tutorials on benchmarking AI agents for site reliability engineering at DSN, FSE, and SOSP. ITBench is spotlighted by IBM Blog and IBM-Illinois Discovery Accelerator Institute. Tianyin presented the group's efforts on cloud system reliability at Sky Seminar, CMU SDI Seminar, EPFL SuRI, and Cloud Control Workshop. Jinghao and Tyler are invited to present Rex and Acto at IBM Research Day Three USENIX ;login: magazine articles on Anvil, Acto, and Sieve, respectively Wentao and team are giving three talks at LPC 2024 at the Refereed Track, Kernel Testing & Dependability, and Safe Systems with Linux Making Linux Fly: Towards Certified Linux Kernel at the ELISA Seminar and Linux Plumbers Conference (LPC) 2024 Cross-System Interaction Failures: Don't Fail through the Cracks at SREcon24 Americas Acto is spotlighted by CS news and IIDAI newsletter Acto is selected as a solution showcase at KubeCon+CloudNativeCon Europe 2024 Virtual device farm is selected as a 2024 GetMobile Research Highlight article: pdf Advancing Kernel Control Flow Integrity with eBPF at Linux Plumbers Conference (LPC) 2023 The Sieve team is spotlighted by CS news Sieve is covered by VMware Office of CTO Blog and is endorsed by Kit Colbert (VMware CTO) Cozart is selected as a 2022 CACM Research Highlight article: pdf Sieve is selected for presentation at KubeCon and CloudNativeCon North America 2021 Revisiting eBPF Seccomp Filters at Linux Plumbers Conference (LPC) 2022 Sam and Wenyu are spotlighted in CS news YiFei is spotlighted by both ECE news and CS news Draco has been upstreamed to the Linux kernel (RFC, code) (LWN, CSL, IllinoisCS, C3SR, Phoronix) Elastic cuckoo page table is selected as IEEE Micro Top Picks Honorable Mention Illinois CS News on Elastic Cuckoo Page Tables Defusing the Configuration Time Bomb (video) (slides) Validated Configurations with Ciris (slides) (manual) The Morning Paper's coverage of Taiji (article) The Morning Paper's coverage of Maelstrom (article) The Morning Paper's coverage of WebRSync (article) W3C Authentication References count our access-control-misconfiguration paper at CHI'17. The Morning Paper's coverage of PCheck (article) It Will Never Work in Theory on our too-many-knobs paper at FSE'15 (article) $ cat services # (default=PC) Co-lead of Infrastructure for Trusted and Confidential Computing at IIDAI Co-editor of SIGOPS Blog Area Chair on Configuration Management, Journal of Systems Research (Why JSys?) 2026 SOSP, ISCA, EuroSys, NSDI, FSE, ICLR 2025 SOSP, OSDI, OSDI AE (co-chair), EuroSys, ASPLOS, NSDI, HPCA, MICRO (ERC), 2024 EuroSys, USENIX ATC, MICRO (ERC), SEC, eBPF, SESAME, SOSP DW, SOSP Poster, 2023 OSDI, NSDI, SOSP DW, SOSP SRC, SOSP Poster, DSN, Sigmetrics, ESEC/FSE Industry Track, 2022 SYSTOR, Sigmetrics, EdgeSys, ChinaSys, Middleware, ESEC/FSE Industry Track, 2021 HotOS, SOSP (virtual platform chair), EuroSys (sponsorship co-chair), ICSE, Sigmetrics SRC, 2020 OSDI, MobiSys, EdgeSys, FSE Tool/Demo, 2019 SOSP, APSys, SEConfig, EdgeSys 2018 EuroSys DW, EdgeSys, ICDCS 2017 SOSP SRC 2015 USENIX LISA (academic review committee) $ sudo cat gang Jongyul Kim, Postdoc Research Fellow (Fall 2023 - now) Bogdan \"Bo\" Alexandru Stoica, Postdoc Research Fellow (Fall 2025 - now) Siyuan Chai, PhD Candidate (Fall 2021 - now) Yinfang Chen, PhD Candidate (Fall 2021 - now), awarded Mavis Future Faculty Fellow Tyler Gu, PhD Candidate (Fall 2021 - now), awarded Gene Golub Fellowship, Outstanding TA Award Shuai Wang, PhD Candidate (Fall 2021 - now), co-advised by Darko Marinov Jiyuan Zhang, PhD Candidate (Fall 2022 - now), awarded Wing Kai Cheng Fellowship Wentao Zhang, PhD Student (Fall 2023 - now), co-advised by Darko Marinov Cathy Cai, PhD Student (Fall 2024 - now) Jackson Clark, PhD Student (Fall 2024 - now) Yiming Su, PhD Student (Fall 2024 - now) Peizhe Liu, MS Student (Fall 2024 - now) Leshna Balara, MS Student (UW–Madison) (Spring 2025 - now) William Zheng, Undergraduate Student (UIUC) (Summer 2023 - now), awarded Jeffrey P. Blahut Memorial Scholarship Shanbo Zhang, Undergraduate Student (UIUC) (Spring 2025 - now) Saad Mohammad Rafid Pial, Undergraduate Student (BUET) (Summer 2025 - now) Bohan Cui, Undergraduate Student (NJU) (Summer 2025 - now) Jiaqi Huang, Undergraduate Student (NJU) (Summer 2025 - now) Lily Gniedziejko, Undergraduate Student (Summer 2025 - now), CS STARS $ sudo cat alumni # (thesis committees) # Doctors Xudong Sun, PhD 2025 (dissertation), awarded Yunni and Maxine Pao Memorial Fellowship, Mavis Future Faculty Fellow → University of Toronto (assistant professor) Jinghao Jia, PhD 2025 (dissertation), co-advised by Dan Williams, awarded Richard T. Cheng Fellowship, Outstanding TA Award → Meta Wenyu Wang, PhD 2022 (dissertation), co-advised by Tao Xie, awarded 3M Foundation Fellowship → Meta → Stellar Cyber → Meta # Maesters Zhen Tang, MCS 2024 → Univer",
  "content_length": 14008,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:25"
}