{
  "name": "Tianyu Zhang 0001",
  "homepage": "https://cs.uiowa.edu/people/tianyu-zhang",
  "status": "success",
  "content": "Tianyu Zhang, Ph.D. | Computer Science - College of Liberal Arts and Sciences | The University of Iowa Skip to main content Tianyu Zhang, Ph.D. Assistant Professor Biography Tianyu Zhang is an Assistant Professor in Computer Science at the University of Iowa. Prior, he was a postdoc fellow in the Department of Computer Science and Engineering at the University of Connecticut (UConn). Before joining UConn, he worked as a postdoctoral fellow at the Hong Kong Polytechnic University. Research InterestsProfessor Zhang's research is broadly in the area of mission-critical cyber-physical systems. His current focus is on the resource management and scheduling framework design/analysis/implementation for emerging Industrial internet-of-things systems, including industrial 5G, time-sensitive networking (TSN), and wireless sensor-actuator networks (WSANs).Research Interests (Keywords)Industrial IoT; Real-Time Systems; Cyber-Physical Systems; 5G; TSNSelected PublicationsReal-time Scheduling for 802.1 Qbv Time-Sensitive Networking (TSN): A Systematic Review and Experimental Study. Chuanyu Xue, Tianyu Zhang, Yuanbin Zhou, Mark Nixon, Andrew Loveless and Song Han. 2024 IEEE 30th Real-Time and Embedded Technology and Applications Symposium (RTAS 2024).Towards Cost-Effective Real-Time High-Throughput End Station Design for Time-Sensitive Networking (TSN). Chuanyu Xue, Tianyu Zhang and Song Han. 2024 61st ACM/IEEE Design Automation Conference (DAC 2024).Real-Time Flow Scheduling in Industrial 5G New Radio. Tianyu Zhang, Jiachen Wang, X. Sharon Hu and Song Han. 2023 IEEE Real-Time Systems Symposium (RTSS 2023).Contention-Free Configured Grant Scheduling for 5g URLLC Traffic. Tianyu Zhang, X. Sharon Hu and Song Han. 2023 60th ACM/IEEE Design Automation Conference (DAC 2023).Resource Virtualization with End-to-End Timing Guarantees for Multi-Hop Multi-Channel Real-Time Wireless Networks. Jiachen Wang, Tianyu Zhang, X. Sharon Hu and Song Han. 2023 IEEE Real-Time Systems Symposium (RTSS 2023). Research areas Systems Email tianyu-zhang@uiowa.edu Phone 319-467-1995 Website Personal Website, Google Scholar Contact Information Office Address 201F MacLean Hall (MLH) Iowa City, IA 52242 United States",
  "content_length": 2210,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:27"
}