{
  "name": "Tian Li 0005",
  "homepage": "https://cs.uchicago.edu/people/tian-li",
  "status": "success",
  "content": "Tian Li – Department of Computer Science Skip to content Contact Info Email litian@uchicago.edu Tian Li is an Assistant Professor of computer science. Her research centers around distributed optimization, federated learning, and trustworthy ML. She is interested in designing, analyzing, and evaluating principled learning algorithms, taking into account practical constraints, to address issues related to accuracy, scalability, trustworthiness, and their interplays. Tian received her Ph.D. in Computer Science from Carnegie Mellon University. Prior to CMU, she received her undergraduate degrees in Computer Science and Economics from Peking University. She received the Best Paper Award at the ICLR Workshop on Secure Machine Learning Systems, was invited to participate in the EECS Rising Stars Workshop, and was recognized as a Rising Star in Machine Learning/Data Science by multiple institutions. Research AI & Machine Learning Foundations and applications of computer algorithms making data-centric models, predictions, and decisions Data & Databases Systems and algorithms for managing and analyzing data at scale Awards & Honors 2023 First Place, U.S. Privacy-Enhancing Technologies Pandemic Challenge 2022 Rising stars in EECS workshop Rising stars in data science UChicago Top 5% oral presentation at NeurLPS 2021 Best paper award, ICLR Outstanding reviewer award, NeurLPS Top 10% reviewers, ICML Rising stars in machine learning UMD 2020 CMU A. Nico Habermann Educational Service Award 2017 Student summer research fellowship ETHZ 2016 Selected into CS Elite Class at Peking University arrow-down-largearrow-left-largearrow-right-large-greyarrow-right-large-yellowarrow-right-largearrow-right-smallbutton-arrowclosedocumentfacebookfacet-arrow-down-whitefacet-arrow-downPage 1CheckedCheckedicon-apple-t5backgroundLayer 1icon-google-t5icon-office365-t5icon-outlook-t5backgroundLayer 1icon-outlookcom-t5backgroundLayer 1icon-yahoo-t5backgroundLayer 1internal-yellowinternalintranetlinkedinlinkoutpauseplaypresentationsearch-bluesearchshareslider-arrow-nextslider-arrow-prevtwittervideoyoutube",
  "content_length": 2103,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:21"
}