{
  "name": "Tianyue Zheng",
  "homepage": "https://www.sustech.edu.cn/en/faculties/zhengtianyue.html",
  "status": "success",
  "content": "ZHENG Tianyue - Faculty - SUSTech Menu News E-Hall ä¸­æ Academic Calendar Notice News Academic Calendar Notice Library News Admissions Global  ä¸­æ   Â© 2019 All Rights Reserved.ç½ç«è®¾è®¡æ¯æ ç²¤ICPå¤14051456å· ä¸­æ Home News Events About Overview Mission & Vision Leadership The Development Plan University Governance Milestones Facts Gallery Contact us Faculty Overview High-level Talents Talent Program Directory Academics Overview View Programs Undergraduate Education Graduate Education Overseas Studies Schools and Colleges International students Research Overview Research Centers & Facilities Technology Transfer Research News Research Administration Go Global Campus Life Overview Residential College Housing & Dining Clubs & Organizations Email Library Admissions Give University Intranets Old Site Faculty ä¸­æ Go Back Search ZHENG Tianyue Assistant Professor zhengty@sustech.edu.cn Personal Homepage ZHENG Tianyue is an Assistant Professor in the Department of Computer Science and Engineering at Southern University of Science and Technology. He is also a doctoral supervisor. He obtained his Ph.D. degree from Nanyang Technological University in Singapore, master's degree from the University of Toronto in Canada, and bachelor's degree from Harbin Institute of Technology in China. His research mainly focuses on mobile computing, pervasive computing, wireless sensing, sensing security, federated learning, and autonomous driving. He has published multiple papers in top-tier conferences and journals such as ACM MobiCom, CCS, UbiComp, SenSys, IEEE TMC, JSAC, ICCV, and INFOCOM. He serves as TPC/AEC member and reviewer for several top-tier conferences and journals.Publications(* denotes co-first author.)ConferencePassword-Stealing without Hacking: Wi-Fi Enabled Practical Keystroke EavesdroppingJingyang Hu, Hongbo Wang, Tianyue Zheng, Jingzhi Hu, Zhe Chen, and Jun Luo,in Proc. of the 30th ACM CCS, 2023, pp. 1â14. MUSE-Fi: Contactless MUti-person SEnsing Exploiting Near-field Wi-Fi Channel VariationJingzhi Hu*, Tianyue Zheng*, Zhe Chen, Hongbo Wang, and Jun Luo,in Proc. of the 29th ACM MobiCom, 2023, pp. 1â12. OCHID-Fi: Occlusion-Robust Hand Pose Estimation in 3D via RF-VisionShujie Zhang*, Tianyue Zheng*, Zhe Chen, Jingzhi Hu, Abdelwahed Khamis, Jiajun Liu, and Jun Luo,in Proc. of IEEE/CVF ICCV, 2023, pp. 1â10. AutoFed: Heterogeneity-Aware Federated Multimodal Learning for Robust Autonomous DrivingTianyue Zheng, Ang Li, Zhe Chen, Hongbo Wang, and Jun Luo,in Proc. of the 29th ACM MobiCom, 2023, pp. 1â12. Wider is Better? Contact-free Vibration Sensing via Different COTS-RF TechnologiesZhe Chen, Tianyue Zheng, Chao Cai, and Jun Luo,in Proc. of the 42nd IEEE INFOCOM, 2023, pp. 1â10. Quantifying the Physical Separability of RF-based Multi-Person Respiration Monitoring via SINRShujie Zhang*, Tianyue Zheng*, Hongbo Wang, Yanbing Yang, Zhe Chen, and Jun Luoin Proc. of the 20th ACM SenSys, 2022, pp. 47â60. Integrating Monostatic Sensing with Communication for IoTZhe Chen, Tianyue Zheng, Chao Hu, Hangcheng Cao, Yanbing Yang, Hongbo Jiang, and Jun Luoin Proc. of the 1st ACM MobiCom Workshop on Integrated Sensing and Communications Systems, 2022, pp. 43â48. CORE-Lens: Simultaneous Communication and Object REcognition with Disentangled-GAN CamerasZiwei Liu, Tianyue Zheng*, Chao Hu, Yanbing Yang, Yimiao Sun, Yi Zhang, Zhe Chen, Liangyin Chen, and Jun Luoin Proc. of the 28th ACM MobiCom, 2022, pp. 1â14. Sound of Motion: Real-Time Wrist Tracking with A Smart Watch-Phone PairTianyue Zheng, Cai Chao, Zhe Chen, and Jun Luoin Proc. of the 41st IEEE INFOCOM, 2021, pp. 1â10. Can We Obtain Fine-Grained Heartbeat Waveform via Contact-Free RF-Sensing?Shujie Zhang, Tianyue Zheng, Zhe Chen, and Jun Luoin Proc. of the 41st IEEE INFOCOM, 2021, pp. 1â10. MoRe-Fi: Motion-Robust and Fine-Grained Respiration Monitoring via Deep-Learning UWB RadarTianyue Zheng, Zhe Chen, Shujie Zhang, Chao Cai, and Jun Luoin Proc. of the 19th ACM SenSys, 2021, pp. 1â14. SiWa: See into Walls via Deep UWB RadarTianyue Zheng*, Zhe Chen*, Jun Luo, Lin Ke, Chaoyang Zhao, and Yaowen Yangin Proc. of the 27th ACM MobiCom, 2021, pp. 323â336. Octopus: A Practical and Versatile Wideband MIMO Sensing PlatformZhe Chen*, Tianyue Zheng*, and Jun Luoin Proc. of the 27th ACM MobiCom, 2021, pp. 601â614. MoVi-Fi: Motion-Robust Vital Signs Waveform Recovery via Deep Interpreted RF SensingZhe Chen*,Tianyue Zheng*, Chao Cai, and Jun Luoin Proc. of the 27th ACM MobiCom, 2021, pp. 392â405. RF-Net: A Unified Meta-Learning Framework for RF-Enabled One-Shot Human Activity RecognitionShuya Ding, Zhe Chen, Tianyue Zheng, and Jun Luoin Proc. of the 18th ACM SenSys, pp. 517â530. V2iFi: In-Vehicle Vital Sign Monitoring via Compact RF SensingTianyue Zheng*, Zhe Chen*, Chao Cai, Jun Luo, and Xu Zhangin Proc. of the 20th ACM UbiComp, pp. 1-27. JournalHoloFed: Environment-Adaptive Positioning via Multi-band Reconfigurable Holographic Surfaces and Federated LearningJingzhi Hu, Zhe Chen, Tianyue Zheng, Robert Schober, and Jun Luo,IEEE Journal on Selected Areas in Communications, pp. 1â32, 2023. ISACoT: Integrating Sensing with Data Traffic for Ubiquitous IoT DevicesZhe Chen, Tianyue Zheng, Chao Hu, Hangcheng Cao, Yanbing Yang, Hongbo Jiang, and Jun LuoIEEE Communications Magazine, pp. 1â6, 2022. HandKey: Knocking-triggered Robust Vibration Signature for Keyless UnlockingHangcheng Cao, Daibo Liu, Hongbo Jiang, Chao Cai, Tianyue Zheng, John C. S. Lui, and Jun LuoIEEE Transactions on Mobile Computing, pp. 1â14, 2022. Catch Your Breath: Simultaneous RF Tracking and Respiration Monitoring with Radar PairsTianyue Zheng, Zhe Chen, Shujie Zhang, and Jun LuoIEEE Transactions on Mobile Computing, pp. 1â14, 2022. RF-Based Human Activity Recognition Using Signal Adapted Convolutional Neural NetworkZhe Chen, Chao Cai,Tianyue Zheng, Jun Luo, Jie Xiong, and Xin WangIEEE Transactions on Mobile Computing, pp. 1â1, 2021. Enhancing RF Sensing with Deep Learning: A Layered ApproachTianyue Zheng, Zhe Chen, Shuya Ding, and Jun LuoIEEE Communications Magazine, pp. 70â76, 2021. PreprintsAdv-4-Adv: Thwarting Changing Adversarial Perturbations via Adversarial Domain AdaptationTianyue Zheng, Zhe Chen, Shuya Ding, Chao Cai, and Jun LuoarXiv preprint arXiv:2112.00428. PatentsSiWa: See into Walls Via Deep UWB RadarJun Luo, Tianyue Zheng, Yaowen Yang, and Lin KeSingapore Patent Application No. 10202106562P. Human Activity Recognition Method and System based on Radio-Frequency and Signal-Adapted Convolutional Neural NetworkZhe Chen, Zhijun Qin, Tianyue Zheng, Lin Yang, and Wenxin HuangChina Patent No. CN111652040A. In-Vehicle Vital Sign Monitoring System based on Compact Radio-Frequency SensingZhe Chen, Zhijun Qin, Tianyue Zheng, Lin Yang, and Wenxin HuangChina Patent No. CN111568396A. Apply Now Careers@SUSTech Cooperation With SUSTech",
  "content_length": 6895,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:26"
}