{
  "name": "Tianxi Ji",
  "homepage": "http://www.myweb.ttu.edu/tiji",
  "status": "success",
  "content": "Tianxi Ji's Website Brief Biography Tianxi Ji is an Assistant Professor in the Department of Computer Science at Texas Tech University. He obtained his Ph.D. degree, advised by Dr. Pan Li, from CWRU, where he also worked with Dr. Erman Ayday. He received his BS degree from Nanjing Posts & Telecomm. Research Interests My research interests span data security and privacy, wireless communication, data science, and their applications. Students and Opening Shuainan Liu Zhongshuo Fang Selected Publications Check out google scholar for full publication list. Selected Conference Papers Tianxi Ji, Erman Ayday, Emre Yilmaz, and Pan Li, \"Privacy-Preserving Fingerprinting Against Collusion and Correlation Threats in Genomic Data,\" the 24th Privacy Enhancing Technologies Symposium (PETS '24), Bristol, UK, July 15â20, 2024. Tianxi Ji and Pan Li, âLess is More: Revisiting the Gaussian Mechanism for Differential Privacy,â the 33rd USENIX Security Symposium (USENIX Security '24), Philadelphia, PA, August 14-16, 2024. Srinivasan Murali, Wenqiang Jin, Vighnesh Sivaraman, Huadi Zhu, Tianxi Ji, Pan Li, and Ming Li, âContinuous Authentication Using Human-Induced Electric Potential,â the Applied Computer Security Applications Conference (ACSAC '23), Austin, Texas, December 4-8, 2023. Tianxi Ji, Erman Ayday, Emre Yilmaz, Ming Li, and Pan Li. âPrivacy-Preserving Database Fingerprinting,â the Network and Distributed System Security Symposium (NDSS '23), San Diego, California, February 27 - March 3, 2023. Tianxi Ji, Erman Ayday, Emre Yilmaz, and Pan Li. âRobust Fingerprinting of Genomic Databases,â In 30th International Conference on Intelligent Systems for Molecular Biology (ISMB '22), Madison, Wisconsin, July 10-14, 2022. Emre Yilmaz, Tianxi Ji, Erman Ayday, and Pan Li. âGenomic Data Sharing under Dependent Local Differential Privacy,â In ACM Conference on Data and Application Security and Privacy (CODASPY '22), Baltimore-Washington DC Area, April 24 - 26, 2022. Tianxi Ji, Emre Yilmaz, Erman Ayday, Pan Li, \"The Curse of Correlations for Robust Fingerprinting of Relational Databases\", 24th International Symposium on Research in Attacks, Intrusions and Defenses (RAID '21), San Sebastian, Spain, October 6-8, 2021. Tianxi Ji, Pan Li, Emre Yilmaz, Erman Ayday, Yanfang (Fanny) Ye, Jinyuan Sun, âDifferentially Private Binary- and Matrix-Valued Data Query: An XOR Mechanism,â 47th International Conference on Very Large Data Bases (VLDB â21), Copenhagen, Denmark, August 16-20, 2021. Emre Yilmaz, Erman Ayday, Tianxi Ji, and Pan Li, âPreserving Genomic Privacy via Selective Sharing,â In Proceedings of the 19th Workshop on Privacy in the Electronic Society (WPES '20), pp. 163-179. 2020. Tianxi Ji, Changqing Luo, Yifan Guo, Jinlong Ji, Weixian Liao, Pan Li, âDifferentially Private Community Detection in Attributed Social Networks,â the 11th Asian Conference on Machine Learning (ACML '19), Nagoya, Japan, November 17 - 19, 2019. Yifan Guo, Tianxi Ji, Qianlong Wang, Lixing Yu, and Pan Li, âQuantized Adversarial Training: AnIterative Quantized Local Search Approach,â the 18th IEEE International Conference on Data Mining (ICDM '19), Beijing, China, November 8-11, 2019 Selected Journal Papers [corresponding author✉] Lixing Yu and Tianxi Ji✉, \"Efficient Federated Learning with Channel Status Awareness and Devices' Personal Touch\", in IEEE Transactions on Mobile Computing (IEEE TMC) 2024, to appear. Tianxi Ji, Erman Ayday, Emre Yilmaz, and Pan Li. âTowards Robust Fingerprinting of Relational Databases by Mitigating Correlation Attacks,â IEEE Transactions on Dependable and Secure Computing (IEEE TDSC) 2022. Tianxi Ji, Changqing Luo, Lixing Yu, Qianlong Wang, Siheng Chen, Arun Thapa, and Pan Li, âEnergy-Efficient Computation Offloading in Mobile Edge Computing Systems with Uncertaintiesâ, IEEE Transactions on Wireless Communication (IEEE TWC) 2021. Tianxi Ji, Yifan Guo, Qianlong Wang, Xufei Wang, and Pan Li, âECONOMY: Point Clouds-based Energy-efficient Autonomous Navigation for UAVs.â IEEE Transactions on Network Science and Engineering (IEEE TNSE), 2021. Tianxi Ji, Changqing Luo, Yifan Guo, Qianlong Wang, Lixing Yu, and Pan Li, âCommunity Detection in Online Social Networks: A Differentially Private and Parsimonious Approach,â IEEE transactions oncomputational social systems (IEEE TCSS), 2020. Professional Activities Teaching CS6359-Data Privacy and Security: Fall'22 | Fall'23 | Fall'24 CS2413-Data Structures: Spring'23 | Spring'24 CS5331/4331-Special Topic: Security and Privacy in ML & AI: Spring'25 Services Technical Program committee: CCGrid '22, ICDCS '24, IWQoS '24, IWQoS '25 Conference Organizing Committee: IWQoS '24 Publicity Co-Chair",
  "content_length": 4738,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:27"
}