{
  "name": "Tie Luo",
  "homepage": "https://tluocs.github.io",
  "status": "success",
  "content": "Thomas Tie Luo Thomas Tie Luo    (formerly Tony T. Luo) Associate Professor Department of Electrical and Computer Engineering Department of Computer Science (Courtesy Joint Appointment) Stanley and Karen Pigman College of Engineering University of Kentucky 223 Davis Marksbury Building, 329 Rose Street, Lexington, KY 40506, USA Phone: +1 (859) 257-1527 E-mail: t.luo <at> uky.edu Research Teaching Publications Systems Students Services Misc Research Trustworthy Artificial Intelligence for Medicine, Healthcare, and the Internet of Things (IoT). Specific topics include: Explainable AI (XAI) Adversarial and Robust Machine Learning Security and Privacy in Federated Learning Time Series Anomaly Detection Prospective students: I advise PhD students in three programs: CS/EE/CPE. Please read this note before applying to my group. Postdocs: Two fellowship opportunities are currently open, but you must be a US citizen, national, or green card holder to be eligible. Biosketch: I am a tenured Associate Professor in the Department of Electrical and Computer Engineering and Department of Computer Science (courtesy joint appointment) at the University of Kentucky. Prior to that, I was an Associate Professor in the Department of Computer Science at Missouri University of Science and Technology. I received my Ph.D. in Electrical and Computer Engineering from the National University of Singapore (ranked globally #8 by QS, #19 by Times Higher Education (THE), and #22 (CS #3, EE #5) by U.S. News & World Report). My research is driven by the goal of making AI systems trustworthy - transparent and robust. I am a member of AAAI and ACM, and a Senior Member of IEEE. Teaching EE599/699 (UK) - Advances & Practices in Deep Learning, Fall 2025 EE599/699 (UK) - Deep Learning Fundamentals, Fall 2025 EE599/699 (UK) - Advances & Practices in Deep Learning, Spring 2025 EE599/699 (UK) - Deep Learning Fundamentals, Fall 2024 CS5001 (MST) - Introduction to Deep Learning, Spring 2024 CS5420 (MST) - Introduction to Machine Learning, Fall 2023 CS3402 (MST) - Introduction to Data Science, Spring 2023 CS5001 (CS5420 since FA23) - Introduction to Machine Learning, Fall 2022 CS3001 (CS3402 since SP23) - Introduction to Data Science, Spring 2022 CS6407 - Internet of Things with Data Science, Fall 2021 CS6001 (CS6407 since FA21) - Internet of Things with Data Science, Spring 2021 CS6001 (CS6407 since FA21) - Internet of Things with Data Science, Fall 2020 CS5001 - Internet of Things with Applied Data Science, Spring 2020 Publications Full list contains graphic illustrations. Google Scholar DBLP (Download BiBTeX by clicking the 2nd icon in front of each paper) Code associated with papers are open-sourced. Since 2020: [ECAI'25] When Secure Aggregation Falls Short: Achieving Long-Term Privacy in Asynchronous Federated Learning for LEO Satellite Networks [DOI: 10.3233/FAIA250920] M. Elmahallawy and T. Luo 28th European Conference on Artificial Intelligence (ECAI), Oct 2025, vol. 413, pp. 1099-1106. [PAKDD'25w] Unlocking Neural Transparency: Jacobian Maps for Explainable AI in Alzheimer's Detection [arXiv] [slides] Y. Mustafa, M. Elmahallawy, and T. Luo 2025 PAKDD workshop on Pattern mining and Machine learning for Bioinformatics, June 2025. Lecture Notes in Computer Science, vol. 15835, pp. 229–242. Best Paper Award [University News] [PAKDD'25] Enabling Heterogeneous Adversarial Transferability via Feature Permutation Attacks [arXiv] [slides] T. Wu and T. Luo 29th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), June 2025. Lecture Notes in Computer Science, vol. 15873, pp. 39–51. Acceptance rate: overall 24% (168/696); main track 24% (134/557). [BigData'24] Efficient Brain Imaging Analysis for Alzheimer's and Dementia Detection Using Convolution-Derivative Operations [arXiv] [DOI: 10.1109/BigData62323.2024.10825276] Y. Mustafa, M. Elmahallawy, and T. Luo IEEE International Conference on Big Data (BigData), December 2024, pp. 6420-6429. [PAKDD'24] Adversarial-Robust Transfer Learning for Medical Imaging via Domain Assimilation [arXiv] [slides] [DOI: 10.1007/978-981-97-2238-9_26] X. Chen and T. Luo 28th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), May 2024. Lecture Notes in Computer Science, vol. 14648, pp. 335–349. Acceptance rate: 18.5% (133/720) (Oral presentation) Best Paper Runner-Up Award (0.28%; 2/720) [University News] [PAKDD'24] Unmasking Dementia Detection through Masking Input Gradients: A JSM Approach to Model Interpretability and Precision [arXiv] [poster version] [DOI: 10.1007/978-981-97-2259-4_6] Y. Mustafa and T. Luo 28th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), May 2024. Lecture Notes in Computer Science, vol. 14647, pp. 75–90. Acceptance rate: 24.3% (175/720; 133 oral + 42 poster presentations, both published the same in proceedings as full papers) [PerCom'24] Stitching Satellites to the Edge: Pervasive and Efficient Federated LEO Satellite Learning [arXiv] [slides] [DOI: 10.1109/PerCom59722.2024.10494442] M. Elmahallawy and T. Luo 22nd IEEE International Conference on Pervasive Computing and Communications (PerCom), March 2024, pp. 80-89. Acceptance rate: 14.5% (23/158) Among the 158 full submissions, 15 (including ours) were accepted as full papers and 8 accepted as short papers. Best Paper Runner-Up Award (1.3%; 2/158) [AAAI'24] LRS: Enhancing Adversarial Transferability through Lipschitz Regularized Surrogate [arXiv] [poster version] [code] [DOI: 10.1609/aaai.v38i6.28430] T. Wu, T. Luo, and D. C. Wunsch 38th AAAI Conference on Artificial Intelligence (AAAI), vol. 38, no. 6, pp. 6135-6143, February 2024. Acceptance rate: 19% (2342/12100) Among the 12100 submissions to the main track, 2238 were desk-rejected. [AAAI'24] CR-SAM: Curvature Regularized Sharpness-Aware Minimization [arXiv] [poster version] [code] [DOI: 10.1609/aaai.v38i6.28431] T. Wu, T. Luo, and D. C. Wunsch 38th AAAI Conference on Artificial Intelligence (AAAI), vol. 38, no. 6, pp. 6144-6152, February 2024. Acceptance rate: 19% (2342/12100) Among the 12100 submissions to the main track, 2238 were desk-rejected. [JSAC'24] Communication-Efficient Federated Learning for LEO Satellite Networks Integrated with HAPs using hybrid NOMA-OFDM [arXiv] [DOI: 10.1109/JSAC.2024.3365885] M. Elmahallawy, T. Luo, and K. Ramadan IEEE Journal on Selected Areas in Communications (JSAC), vol. 42, no. 5, pp. 1097-1114, May 2024. [Healthcom'23] Diagnosing Alzheimer's Disease using Early-Late Multimodal Data Fusion with Jacobian Maps [arXiv] [slides] [DOI: 10.1109/Healthcom56612.2023.10472348] Y. Mustafa and T. Luo IEEE International Conference on E-health Networking, Application & Services (Healthcom), December 2023, pp. 49-55. [Globecom'23] Secure and Efficient Federated Learning in LEO Constellations using Decentralized Key Generation and On-Orbit Model Aggregation [arXiv] [DOI: 10.1109/GLOBECOM54140.2023.10436841] M. Elmahallawy, T. Luo, and M. I. Ibrahem IEEE Global Communications Conference (GLOBECOM), December 2023, pp. 5727-5732. [ICIP'23] GNP Attack: Transferable Adversarial Examples via Gradient Norm Penalty [arXiv] [DOI: 10.1109/ICIP49359.2023.10223158] T. Wu, T. Luo, and D. C. Wunsch 30th IEEE International Conference on Image Processing (ICIP), October 2023, pp. 3110-3114. [Pattern'23] YOGA: Deep Object Detection in the Wild with Lightweight Feature Learning and Multiscale Attention [arXiv (new)] [code] [DOI: 10.1016/j.patcog.2023.109451] R. Sunkara and T. Luo Pattern Recognition, vol. 139, pp. 109451, July 2023. [MDM'23] One-Shot Federated Learning for LEO Constellations that Reduces Convergence Time from Days to 90 Minutes [arXiv] [DOI: 10.1109/MDM58254.2023.00020] M. Elmahallawy and T. Luo 24th IEEE International Conference on Mobile Data Management (MDM), July 2023, pp. 45-54. [PAKDD'23] TSI-GAN: Unsupervised Time Series Anomaly Detection using Convolutional Cycle-Consistent Generative Adversarial Networks [arXiv] [code] [DOI: 10.1007/978-3-031-33374-3_4] S.S. Saravanan, T. Luo, and M.V. Ngo 27th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), May 2023, pp. 39–54. Acceptance rate: 16.5% (143/869) The initial number 822 quoted in the acceptance email was later corrected to 869 in the Conference Summary Report presented at the conference closing ceremony. [BigData'22] AsyncFLEO: Asynchronous Federated Learning for LEO Satellite Constellations with High-Altitude Platforms [arXiv] [DOI: 10.1109/BigData55660.2022.10021101] M. Elmahallawy and T. Luo IEEE International Conference on Big Data (BigData), December 2022, pp. 5478-5487. Acceptance rate: 19% (122/633; full paper) [ESORICS'22] Long-Short History of Gradients is All You Need: Detecting Malicious and Unreliable Clients in Federated Learning [arXiv] [video] [code] [DOI: 10.1007/978-3-031-17143-7_22] A. Gupta, T. Luo, M. V. Ngo, and S. K. Das The 27th European Symposium on Research in Computer Security (ESORICS), September 2022, pp. 445-465. Acceptance rate: 19% [ECML PKDD'22] No More Strided Convolutions or Pooling: A New CNN Building Block for Low-Resolution Images and Small Objects [arXiv] [video] [code] [DOI: 10.1007/978-3-031-26409-2_27] R. Sunkara and T. Luo European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML PKDD), September 2022, pp. 443-459. Acceptance rate: 26% (242/932) [TIOT'21] Adaptive Anomaly Detection for Internet of Things in Hierarchical Edge Computing: A Contextual-Bandit Approach [video] [DOI: 10.1145/3480172] M.V. Ngo, T. Luo, and Q.S. Quek ACM Transactions on Internet of Things (TIOT). Vol. 3, No. 1, pp. 1-23, October 2021. [AAAI'20] COBRA: Context-aware Bernoulli neural networks for reputation assessment [arXiv] L. Zeynalvand, T. Luo, and J. Zhang 34th AAAI Conference on Artificial Intelligence (AAAI), New York, NY, Feb 2020, pp. 7317-7324. Acceptance rate: 20% [AAAI'20] Mechanism design with predicted task revenue for bike sharing systems [arXiv] H. Lv",
  "content_length": 22906,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:28"
}