{
  "name": "Tieke He",
  "homepage": "https://hetieke.cn",
  "status": "success",
  "content": "Pascal 何铁科 Tieke He, Ph.D. Associate Professor Software Institute, Nanjing University Office: Room 912, FeiYimin Building, Nanjing University, Nanjing, 210093, China Tel: +86-25 83621360 EXT 932 Email: hetieke {AT} nju DOT edu DOT cn or hetieke {AT} gmail DOT com I'm looking for talented and hardworking students interested in Software Engineering, Knowledge Graph and Question Answering, drop me a CV if interested. Teaching Data Management Fundamentals Big Data Analytics Statistical Models: Theory and Practice Publications Conference Papers 14. Yunhui Liu, Y. Liu, Yinfeng Chen, C. Hong, Tao Zheng, T. He. Learning Hierarchical Knowledge in Text-Rich Networks with Taxonomy-Informed Representation Learning. KDD'26 13. Yu Xing, Qizhuo Xie, Yunhui Liu, Qing Gu, Tao Zheng, Bin Chong, T. He. On Modality Weighting and Specificity for Multi-Modal Entity Alignment. AAAI'26 12. Jinwei Shi, Wenxuan Huang, Yu Xing, Yunhui Liu, Tao Zheng, Bin Chong, T. He. EchoEdit: Consistent Multi-Hop QA via Ripple Control in Knowledge Editing. AAAI'26 11. Yunhui Liu, Huaisong Zhang, Xinyi Gao, Liuye guo, Zhen Tao, T. He. Norm-Augmented Graph AutoEncoders for Link Prediction. ICASSP'25 10. Zhen Tao, Y. Cao, Y. Fang, Yunhui Liu, X. Zhao T. He. Dynamic Graph Recommendation via Sparse Augmentation and Singular Adaptation. ICASSP'25 9. Yunhui Liu, T. He, Qing Wu, Tao Zheng, Jianhua Zhao. Scalable and Adaptive Spectral Embedding for Attributed Graph Clustering. CIKM'24 8. Yunhui Liu, Huaisong Zhang, T. He, Tao Zheng, Jianhua Zhao. Bootstrap Latents of Nodes and Neighbors for Graph Self-Supervised Learning. ECML'24 7. Wei Yuan, Q. Nguyen, T. He, Liang Chen, Hongzhi Yin. Manipulating Federated Recommender Systems: Poisoning with Synthetic Users and Its Countermeasures. SIGIR'23 6. Wei Yuan, C. Yang, Q. Nguyen, Lizhen Cui, T. He, Hongzhi Yin. Interaction-level Membership Inference Attack Against Federated Recommender Systems. WWW'23 5. Wei Yuan, Hongzhi Yin, F. Wu, Shijie Zhang, T. He, Hao Wang. Federated Unlearning for On-Device Recommendation. WSDM'23 4. Wei Yuan, Quanjun Zhang, T. He, Chunrong Fang, Q. Nguyen, Xiaodong Hao, Hongzhi Yin. CIRCLE: Continual Repair across Programming Languages. ISSTA'22 3. Wei Yuan, Hongzhi Yin, T. He, Tong Chen, Q. Wang, Lizhen Cui. Unified Question Generation with Continual Lifelong Learning. WWW'22 2. Wei Yuan, T. He, Xinyu Dai. Improving Neural Question Generation using Deep Linguistic Representation. WWW'21 1. Chao Guo, T. He, Wei Yuan, Yue Guo, Rui Hao. Crowdsourced Requirements Generation for Automatic Testing via Knowledge Graph. ISSTA'20 Journal Papers 7. Yunhui Liu, Xinyi Gao, T. He, Jianhua Zhao, Hongzhi Yin. Teaching MLPs to Master Heterogeneous Graph-Structured Knowledge for Efficient and Accurate Inference. TKDE (2025) 6. Zhipeng Wang, T. He, Ruoyu Zhao, Tao Zheng. Exploration and Improvement of Capabilities of LLMs in Code Refinement Task. Journal of Software (2025) 5. Yunhui Liu, T. He, Tao Zheng, Jianhua Zhao. Negative-Free Self-Supervised Gaussian Embedding of Graphs. Neural Networks (2024) 4. Yunhui Liu, Xinyi Gao, T. He, Tao Zheng, Jianhua Zhao, Hongzhi Yin. Reliable Node Similarity Matrix Guided Contrastive Graph Clustering. TKDE (2024) 3. Q. Zhang, Chunrong Fang, W. Sun, Y. Liu, T. He, X. Hao, Zhenyu Chen. APPT: Boosting Automated Patch Correctness Prediction via Fine-Tuning Pre-Trained Models. TSE (2024) 2. Xin Chen, He Jiang, Xiaochen Li, Liming Nie, Dongjin Yu, T. He, Zhenyu Chen. A Systemic Framework for Crowdsourced Test Report Quality Assessment. EMSE (2020) 1. T. He, Lian Hao, Zemin Qin, Zhenyu Chen, Bin Luo. PTM: A Topic Model for the Inferring of the Penalty. JCST (2018) Suggested Readings The Three Golden Rules for Successful Scientific Research Ten Simple Rules to Becoming a Principal Investigator Beng Chin Ooi Speaks Out on Building a Strong Database Group A Letter to the Lab Members from PU A Letter to Research Students Efficient Reading of Paper in Science and Technology How to Read a Paper Some modest advice for graduate students How to Succeed in Graduate School How to do Research At the MIT AI Lab The Task of the Referee The Most Common Habbits from more than 200 English Papers Written by Graduate Chinese Engineering Students Useful Things to Know About Ph.D Thesis Research PhDs from the Faculty's Perspective You and Your Research",
  "content_length": 4344,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:29"
}