{
  "name": "Tien-Tsin Wong",
  "homepage": "https://research.monash.edu/en/persons/tien-tsin-wong",
  "status": "success",
  "content": "Tien Tsin Wong - Monash University View Scopus Profile Tien Tsin Wong Professor Professor, Department of Data Science & AI https://orcid.org/0000-0002-7792-9307 EmailTT.Wongmonashedu Accepting PhD Students 1995 …2025 Research activity per year Personal profile Research interestsGenerative AI, Computer Graphics, Computer Vision, Computational Manga, GPU Techniques, Image-based Rendering, Multimedia Compression Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, PhD, Chinese University of Hong KongAward Date: 1 Aug 1998Computer Science, MPhil, Chinese University of Hong KongAward Date: 1 Jul 1994Computer Science, B.Sc., Chinese University of Hong KongAward Date: 1 Jul 1992 External positionsProfessor, Chinese University of Hong KongAug 1999 → Jun 2024Visiting Assistant Professor, Hong Kong University of Science and TechnologyAug 1998 → Aug 1999 Research area keywordsGenerative AIComputer GraphicsComputer VisionComputational Manga Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1995 2003 2004 2005 2006 2007 2008 2010 2013 2018 2021 2025 125 Article 73 Conference Paper 4 Chapter (Book) 3 Conference article 5 More 2 Chapter (Report) 2 Review Article 1 Comment / Debate Research output per year Research output per year DynamiCrafter: Animating Open-Domain Images with Video Diffusion PriorsXing, J., Xia, M., Zhang, Y., Chen, H., Yu, W., Liu, H., Liu, G., Wang, X., Shan, Y. & Wong, T.-T., 2025, Computer Vision – ECCV 2024 - 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part XLVI. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 399-417 19 p. (Lecture Notes in Computer Science; vol. 15104).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 26 Citations (Scopus) Make-Your-Video: Customized Video Generation Using Textual and Structural GuidanceXing, J., Xia, M., Liu, Y., Zhang, Y., Zhang, Y., He, Y., Liu, H., Chen, H., Cun, X., Wang, X., Shan, Y. & Wong, T.-T., Feb 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 2, p. 1526-1541 15 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 17 Citations (Scopus) Screentone-Preserved Manga RetargetingXie, M., Xia, M., Li, C., Liu, X. & Wong, T. T., May 2025, In: Computer Graphics Forum. 44, 2, 12 p., e70096.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Synchronized Multi-Frame Diffusion for Temporally Consistent Video StylizationXie, M., Liu, H., Li, C. & Wong, T. T., May 2025, In: Computer Graphics Forum. 44, 2, 12 p., e70095.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile LF2MV: Learning an Editable Meta-View Towards Light Field RepresentationXia, M., Echevarria, J., Xie, M. & Wong, T.-T., Mar 2024, In: IEEE Transactions on Visualization and Computer Graphics. 30, 3, p. 1672-1684 13 p.Research output: Contribution to journal › Article › Research › peer-review View all 210 research outputs Prizes 2004 Young Researcher AwardWong, T.-T. (Recipient), 2004Prize: Prize (including medals and awards) 2005 IEEE Transactions on Multimedia Prize Paper AwardWong, T.-T. (Recipient), Fu, C.-W. (Recipient), Heng, P.-A. (Recipient) & Leung, C.-S. (Recipient), 2005Prize: Prize (including medals and awards) 2018 The 46th International Exhibition of Inventions of Geneva, Silver MedalShen, W. (Recipient) & Wong, T. (Recipient), 2018Prize: Prize (including medals and awards) 2019 Asia Exhibition of Inventions Hong Kong, Silver MedalShen, W. (Recipient), Hu, X. (Recipient) & Wong, T. (Recipient), 2019Prize: Prize (including medals and awards) Activities Activities per year 2015 2015 2021 2022 2022 3 Editorial responsibility Activities per year Computer Graphics Forum (Journal)Wong, T.-T. (Associate editor)2022 → 2025Activity: Publication peer-review and editorial work types › Editorial responsibility IEEE Transactions on Visualization and Computer Graphics (Journal)Wong, T.-T. (Associate editor)2021 → …Activity: Publication peer-review and editorial work types › Editorial responsibility Computational Visual Media (Journal)Wong, T.-T. (Associate editor)2015 → …Activity: Publication peer-review and editorial work types › Editorial responsibility",
  "content_length": 4958,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:32"
}