{
  "name": "Tiffany Li",
  "homepage": "https://www.stevens.edu/profile/wli69",
  "status": "success",
  "content": "Tiffany Li | Stevens Institute of TechnologySkip to ContentTiffany LiAssistant ProfessorCharles V. Schaefer, Jr. School of Engineering and ScienceDepartment of Computer ScienceGateway Center S329(201) 216-3751[email protected]EducationPhD (2024) University of Illinois at Urbana-Champaign (Computer Science) BA (2016) Cornell University (Mathematics, Economics) ResearchMy research lies at the intersection of human-computer interaction, educational data mining, and responsible AI. I am passionate about addressing the challenges and establishing meaningful relationships between algorithmic systems and various stakeholders in education. I am also excited to leverage theories and knowledge in human learning to support people's critical use of outputs from algorithmic systems. To achieve this, I conduct human subject experiments, perform quantitative (e.g., Bayesian statistics, causal inference) and qualitative analysis, and build innovative interactive systems.General InformationTiffany joined Stevens' Computer Science Department in Spring 2025. Before that, she obtained her Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign in 2024, and a BA in Mathematics and Economics from Cornell University in 2016.ExperienceAcademic ExperienceAppointmentsAssistant Professor, Department of Computer Science (2025 ~ Present)@Stevens Institute of Technology (SIT) Graduate Research Assistant, Department of Computer Science (2018 ~ 2024) @University of Illinois at Urbana-Champaign (UIUC)Teaching Assistant, Department of Computer Science (2020 ~ 2021)@University of Illinois at Urbana-Champaign (UIUC)ReviewerHuman Factors in Computing Systems Conference (CHI): 2025, 2024, 2023, 2021ACM Conference on Computer Supported Cooperative Work (CSCW): 2025, 2022Transactions on Interactive Intelligent Systems: 2024ACM Special Interest Group on Computer Science Education (SIGCSE): 2020 – 2022Industry ExperienceUX Researcher Intern (Summer 2022) @Meta Platforms, Inc.Technology Advisory Staff, Financial Service Office (2016 ~ 2018) @Ernst & Young, LLPHonors and AwardsGoogle Ph.D. Fellowship (2022 - 2024) In Human-Computer InteractionOutstanding Teaching Assistant Award (Spring 2021)Saburo Muroga Endowed Fellowship (2018)Professional SocietiesASEE – American Society for Engineering Education MemberACM – Association for Computing Machinery MemberSIGCHI – Special Interest Group on Computer-Human Interaction MemberSelected PublicationsConference ProceedingCheng, T.; Li, T.; Karahalios, K.; Sundaram, H. (2025). Budget, Cost, or Both? An Empirical Exploration of Mechanisms in Quadratic Surveys. Proceedings of the ACM Collective Intelligence Conference (pp. 58--70). Li, T.; Song, Y.; Sundaram, H.; Karahalios, K. (2025). Can Learners Navigate Imperfect Generative Pedagogical Chatbots? An Analysis of Chatbot Errors on Learning. Proceedings of the Twelfth ACM Conference on Learning@ Scale (pp. 151--163). Cheng, T.; Zhang, Y.; Chou, Y.; Koshy, V.; Li, T.; Karahalios, K.; Sundaram, H. (2025). Organize, Then Vote: Exploring Cognitive Load in Quadratic Survey Interfaces. Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems (pp. 1--35). Li, T.; Hsu, S.; Fowler, M.; Zhang, Z.; Zilles, C.; Karahalios, K. (2023). Am I wrong, or is the autograder wrong? Effects of AI grading mistakes on learning. Proceedings of the 2023 ACM Conference on International Computing Education Research-Volume 1 (pp. 159--176). Xiao, Z.; Li, T.; Karahalios, K.; Sundaram, H. (2023). Inform the uninformed: improving online informed consent reading with an AI-powered Chatbot. Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (pp. 1--17). Hsu, S.; Li, T.; Zhang, Z.; Fowler, M.; Zilles, C.; Karahalios, K. (2021). Attitudes surrounding an imperfect AI autograder. Proceedings of the 2021 CHI conference on human factors in computing systems (pp. 1--15). Li, T.; Xiao, Z.; Goldstein, M. H.; Philpott, M. L.; Woodard, B. (2021). Evaluating an Intelligent Sketching Feedback Tool for Scalable Spatial Visualization Skill Training. 2021 ASEE Virtual Annual Conference Content Access. Woodard, B. S.; Li, T.; Xiao, Z.; Goldstein, M. H.; Philpott, M. L. (2021). Work in Progress: Spatial Visualization Assessment and Training in the Grainger College of Engineering at the University of Illinois. 2021 Illinois-Indiana Regional Conference. Wauck, H.; Woodard, B. S.; Xiao, Z.; Li, T.; Bailey, B. P. (2020). A data-driven, player-centric approach to evaluating spatial skill training games. Proceedings of the Annual Symposium on Computer-Human Interaction in Play (pp. 349--361). Journal ArticleBhavya, B.; Chen, S.; Zhang, Z.; Li, T.; Zhai, C.; Angrave, L.; Huang, Y. (2022). Exploring collaborative caption editing to augment video-based learning. Educational technology research and development (5 ed., vol. 70, pp. 1755--1779). Springer.Cheng, T.; Li, T.; Chou, Y.; Karahalios, K.; Sundaram, H. (2021). \" I can show what I really like.\" Eliciting Preferences via Quadratic Voting. Proceedings of the ACM on human-computer interaction (CSCW1 ed., vol. 5, pp. 1--43). ACM New York, NY, USA.Li, T.; Karahalios, K.; Sundaram, H. (2021). \" It's all about conversation\" Challenges and Concerns of Faculty and Students in the Arts, Humanities, and the Social Sciences about Education at Scale. Proceedings of the ACM on Human-Computer Interaction (CSCW3 ed., vol. 4, pp. 1--37). ACM New York, NY, USA.Li, T.; Paquette, L. (2020). Erroneous Answers Categorization for Sketching Questions in Spatial Visualization Training.. International Educational Data Mining Society. ERIC.CoursesCS545 Human-Computer Interaction",
  "content_length": 5664,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:34"
}