{
  "name": "Tiffany Tseng",
  "homepage": "https://tifftseng.com",
  "status": "success",
  "content": "Tiffany Tseng tiffany tseng Assistant Professor, Computer Science Barnard College, Columbia University Director of Design Tools Lab I develop design tools that empower beginners to realize their creative potential. My research leverages computational technologies to enable creative expression for the next generation of designers. I have developed design tools in the domains of animation, machine learning modeling, electronics prototyping, and online design communities for makers. My work combines systems building and design-based research; in interdisciplinary teams, we design and build software tools and collaborate with community partners like museums, libraries, and schools to understand how these tools are used by learners in practice. Prior to joining Barnard, I was a research scientist at 🍎 Apple and a Project Assistant Professor at the 🗼 University of Tokyo. I also spent several years as a lead UX designer and design engineer on Tinkercad at 🧰 Autodesk and on online code editors at 🎏 Glitch. I received my PhD from the Lifelong Kindergarten Group at the ✨ MIT Media Lab. In my previous life as a mechanical engineer, I designed at 💡 IDEO, and 👶 Fisher-Price. I will be on leave Fall 2025 For more about Design Tools Lab, please check out our website selected research and publications arXiv preprint Keyframer: Empowering Animation Design using Large Language Models Tiffany Tseng, Ruijia Cheng, Jeffrey Nichols preprint video TOCE 2024 Co-ML: Collaborative machine learning model building for developing dataset design practices Tiffany Tseng, Matt J Davidson, Luis Morales-Navarro, Jennifer King Chen, Victoria Delaney, Mark Leibowitz, Jazbo Beason, R Benjamin Shapiro paper video IDC 2023 Honorable Mention Collaborative Machine Learning Model Building with Families Using Co-ML Tiffany Tseng, Jennifer King Chen, Mona Abdelrahman, Mary Beth Kery, Fred Hohman, Adriana Hilliard, R Benjamin Shapiro paper video IDC 2021 Best Paper PlushPal: Storytelling with interactive plush toys and machine learning Tiffany Tseng, Yumiko Murai, Natalie Freed, Deanna Gelosi, Tung D Ta, Yoshihiro Kawahara paper app guide video DIS 2021 Circuit Assemblies: Electronic Modules for Interactive 3D-Prints Tiffany Tseng, Yoshihiro Kawahara paper blog post glow module tutorial move module tutorial Note: this feature is live on Tinkercad! DIS 2016 Spin: Examining the role of engagement, integration, and modularity in supporting youth creating documentation Tiffany Tseng, Mitchel Resnick paper site assembly instructions video IDC 2015 Spin: A photography turntable system for creating animated documentation Tiffany Tseng, Mitchel Resnick paper Makeology 2016 Build in Progress: Building Process-Oriented Documentation Tiffany Tseng in Makeology: Makerspaces as Learning Environments Fablearn 2015 Making Make-throughs: Supporting young makers sharing design process. Tiffany Tseng Paper Source Code IDETC 2014 Documentation in progress: Challenges with representing design process online. Tiffany Tseng, Maria Yang, Stephen Ruthmann Paper CHI 2013 Design, reflect, explore: Encouraging children's reflections with Mechanix Tiffany Tseng, Coram Bryant Paper IDC 2011 Collaboration through documentation: Automated capturing of tangible constructions to support engineering design Tiffany Tseng, Coram Bryant, Paulo Blikstein Paper TEI 2011 Mechanix: A tangible interactive wall for exploring engineering design Tiffany Tseng, Coram Bryant, Paulo Blikstein Paper C&C 2021 Exquisite Circuits: Collaborative Electronics Design through Drawing Games Jie Qi, Natalie Freed, Tiffany Tseng, Fay Shaw, Barbara Liedahl, Becca Rose Glowacki, Yoshihiro Kawahara paper Dissertation Making Make-throughs: Documentation as stories of design process Tiffany Tseng PDF TEI 2015 Process Products: Capturing design iteration with digital fabrication Tiffany Tseng, Geoff Tsai Paper DIS 2014 Product versus process: Representing and appropriating DIY projects online Tiffany Tseng, Mitchel Resnick Paper ASEE 2011 Early Academic Experiences of Non-Persisting Engineering Undergraduates Tiffany Tseng, Helen L Chen, PE Sheri Sheppard Paper ASEE 2011 The Role of Spatial-Visual Skills in a Project-Based Engineering Design Course Tiffany Tseng, Maria Yang Paper small design tools and resources Stencilfy Create a stencil from any text, using any font app blog post Tinkercad Code Blocks Visual programming for Arduino Blog Post Character design with Microbit Inspired by tamagotchi Blog Post Microbit Web Bluetooth Starter Apps For connecting to the Microbit on the web Starter apps fun stuff I have a snack blog called Tasty Snacking where I've reviewed over 2,000 snacks. I enjoy collecting records and was a former college radio DJ at WMBR. I'm an avid reader and am always looking for book recommendations. I kept a food journal of snacks and food that I ate while living in Tokyo (2020-2021). old version of website (2020)",
  "content_length": 4916,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:33"
}