{
  "name": "Tiffany D. Do",
  "homepage": "https://drexel.edu/cci/about/directory/D/Do-Tiffany-D",
  "status": "success",
  "content": "Tiffany D. Do | Drexel CCI Skip to main content Tiffany D. DoAssistant Professor Pronouns: she/herComputer Science Emailtd848@drexel.eduWebsite(s)zyrcant.github.io Tiffany D. DoAssistant Professor Pronouns: she/herComputer ScienceBiographyTiffany is an Assistant Professor in Computer Science, specializing in Human-Centered AI, augmented reality (AR), virtual reality (VR) and virtual avatars. Her research focuses on the potential of AI to personalize experiences for individuals, placing a premium on their unique identities and perspectives. She aims to create AI systems and virtual avatars that enable people to explore diverse identities and experiences, drawing on her expertise in immersive technologies, applied language models and user design. Previously, Tiffany conducted research at Microsoft Research and Google, where she focused on user experience (UX) and interactions with language applications, particularly large language models (LLMs). Her work examines how identity intersects with and impacts user perceptions and interactions with these technologies.Research AreasAI, Machine Learning, and RoboticsHuman-Centered ComputingResearch InterestsHuman-Centered AI, Virtual Avatars, Virtual RealityAcademic Distinctions PhD, Computer Science, University of Central Florida MS, Computer Science, University of Texas at Dallas BS, Computer Science, University of Texas at Dallas CV Select Publications Tiffany D. Do, Juanita Benjamin, Camille Isabella Protko, Ryan P McMahan (2024). Cultural Reflections in Virtual Reality: The Effects of User Ethnicity in Avatar Matching Experiences on Sense of Embodiment. To Appear in IEEE Transactions on Visualizations and Computer Graphics (TVCG). Tiffany D. Do, Camille Isabella Protko, Ryan P McMahan, \"Stepping into the Right Shoes: The Effects of User-Matched Avatar Ethnicity and Gender on Sense of Embodiment in Virtual Reality,\" in IEEE Transactions on Visualization and Computer Graphics, vol.30, no. 5, pp. 2434-2443, May 2024, doi: 10.1109/TVCG.2024.3372067. Tiffany D. Do, Ryan P. McMahan, and Pamela J. Wisniewski. 2022. A New Uncanny Valley? The Effects of Speech Fidelity and Human Listener Gender on Social Perceptions of a Virtual-Human Speaker. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI '22). Association for Computing Machinery, New York, NY, USA, Article 424, 1–11. https://doi.org/10.1145/3491102.3517564 Tiffany D. Do, Seong Ioi Wang, Dylan S. Yu, Matthew G. McMillian, and Ryan P. McMahan. 2021. Using Machine Learning to Predict Game Outcomes Based on Player-Champion Experience in League of Legends. In Proceedings of the 16th International Conference on the Foundations of Digital Games (FDG '21). Association for Computing Machinery, New York, NY, USA, Article 47, 1–5. https://doi.org/10.1145/3472538.3472579 Research Activities ACM MM – Technical Program Committee Awards & Recognition Best Paper Honorable Mention - 2024 IEEE Virtual Reality and 3D User Interfaces (VR) Professional Activities Volunteer work with Girls Who Code, NCWIT, ACM-W Personal Interests gaming, drawing, tennis",
  "content_length": 3113,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:34"
}