{
  "name": "Tijana Milenkovic",
  "homepage": "http://www3.nd.edu/~tmilenko",
  "status": "success",
  "content": "Home Page Prof. Tijana Milenkovic, Complex Networks (CoNe) Lab PROF. MILENKOVIC CONE LAB MEMBERS RESEARCH PUBLICATIONS SOFTWARE AND DATA OPEN POSITIONS Tijana Milenkovic, Ph.D. Professor (with tenure) Department of Computer Science and Engineering (CSE) University of Notre Dame E-mail: tmilenko [at] nd [dot] edu Office: 381 Fitzpatrick Hall Phone: +1-574-631-8975 Twitter: @ProfMilenkovic Google Scholar: click here CV: click here Ph.D. in Computer Science, University of California Irvine, 2010 M.Sc. in Computer Science, University of California Irvine, 2008 B.Sc. in Electrical Engineering, University of Sarajevo, 2005 Photo credit: Barbara Johnston BIOGRAPHY (As of 07/14/2025) Prof. Milenkovic has been a Notre Dame faculty since 2010, after earning her Ph.D. degree in Computer Science from the University of California Irvine in the same year. She was promoted to an Associate Professor (with tenure) in 2016 and to a Professor in 2021. Milenkovic lab solves challenging problems in the fields of network science, graph algorithms, computational biology, scientific wellness, and social networks. Prof. Milenkovic won NSF CAREER and Air Force Office of Scientific Research Young Investigator Program (AFOSR YIP) awards. Also, she has acted as the sole or lead Principal Investigator on 5 other awards/grants by NSF or NIH and as a co-Investigator or Senior/Key Personnel on 9 additional collaborative awards/grants by multiple government agencies or industry companies. The research awards/grants that Prof. Milenkovic has participated in total to $19.2 million, of which $2.2 million have gone directly to her lab. She has published 60 journal papers (e.g., in Science, PNAS, or Bioinformatics) and 16 conference papers (e.g., in the top tier ISMB/ECCB computational biology conference). Prof. Milenkovic's papers have attracted over 5,600 citations; her i10-index is 58 and h-index is 35. Prof. Milenkovic was elected in 2020 and has been re-elected in 2023 to the Board of Directors of the International Society for Computational Biology (ISCB) to represent the Society’s Communities of Special Interest (COSIs). She was an active organizer of the flagship Network Biology (NetBio) COSI meeting at ISMB/ECCB during 2017-2023, and of the Great Lakes Bioinformatics Conference during 2015-2021. Prof. Milenkovic has served as Proceedings Chair for ISMB 2024 and ISMB/ECCB 2025, and she served as an Area Chair for Systems Biology and Networks at ISMB 2022 and ISMB/ECCB 2023. She has been an Associate Editor of IEEE/ACM TCBB during 2014-2023, of Scientific Reports during 2018-2021, and of Frontiers in Bioinformatics -- Network Bioinformatics since 2020. In terms of teaching, Prof. Milenkovic has offered each of Network Science (an elective graduate- and senior undergraduate-level course), Design/Analysis of Algorithms (a major-required undergraduate-level course), and Discrete Mathematics (a major-required sophomore undergraduate-level course) multiple times, achieving composite student evaluation scores of 4.8, 4.7, and 4.4, respectively, on a 0 (very poor) to 5 (excellent) scale. In addition, she has taught an offering of Complexity and Algorithms (a major-required graduate-level course) and Algorithms for Biological Networks (an elective graduate- and senior undergraduate-level course). Prof. Milenkovic was selected by undergraduate students in her department as a 2025 CSE Outstanding Teacher, and consequently, as the Faculty Speaker at the CSE graduation at the University of Notre Dame in 2025. Prof. Milenkovic is committed to integrating research and education. For example, in addition to supervising a postdoctoral researcher, 10 Ph.D. students, and 5 M.Sc. students, she has also provided research supervision to 28 undergraduate students and a high school student. 7 of the undergraduates continued onto Ph.D. programs at e.g., Stanford, MIT, Carnegie Mellon, or Brown University. 5 of them already earned their Ph.D. degrees, and all 5 continued to academia, 4 as faculty and 1 as a research scientist. Prof. Milenkovic has published 13 journal and 6 conference papers with her undergraduate researchers. During 2014-2018, of all 6 Notre Dame College of Engineering's Steiner Award winners in Prof. Milenkovic's department, 4 (67%) were Prof. Milenkovic's undergraduate researchers. For her student mentorship efforts, Prof. Milenkovic won one of only two CRA-E Undergraduate Research Faculty Mentoring Awards in the US in 2021. Prof. Milenkovic is committed to promoting sense of belonging and creating a welcoming enviroment for everyone in the field of computing. For more details, please see Prof. Milenkovic's CV. For a more personal story on what shaped Prof. Milenkovic as a professor, mentor, and person, feel free to explore this story.",
  "content_length": 4787,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:35"
}