{
  "name": "Till Bretschneider",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/till_bretschneider",
  "status": "success",
  "content": "Till Bretschneider Skip to main content Skip to navigation TitleProfessorContactDepartment of Computer ScienceRoom MB5.30, Mathematical Sciences BuildingAcademic Loop RoadUniversity of Warwick, CV4 7AL, United KingdomE-mail: T.Bretschneider@warwick.ac.ukTel: +44 (0) 24 761 50252Research InterestsMy main research interest is to understand principles of self-organisation in the actin cytoskeleton which drives shape changes in animal cells. I have been predominantly working on cell motility in Dictyostelium amoebae as a biological model system, and more recently on cellular fluid uptake (macropinocytosis) where protrusion of the cell membrane followed by fusion results in internalisation of vesicles (see movie).We combine quantitative image analysis, employing a wide range of machine learning methods, with computational modelling.Current focus is on extending these methods to 3D time series data from fast lattice light sheet microscopy, with neural networks playing an increasing role in feature extraction, and generative modelling to map the complex spatio-temporal dynamics of cellular processes.Current UKRI Funded Projects EPSRC/NSF, Sep 23 - Aug 26, £876,547, with Michael Smutny (PI), Warwick Medical School, and Melikhan Tanyeri, Duquesne University (USA) CMMI-EPSRC: A novel multifunctional platform to study cell and nuclear mechanosensing EPSRC, Mar 22 - Feb 25, £398,041 Machine learning for extracting spatio-temporal biological patterns on evolving domains BBSRC, Mar 22 - Apr 25, £520,833, with Jason King (PI), University of Sheffield Organisation of actin waves and cups by differential GTPase activity MRC, Oct 20 - Sep 24, MRC DTP iCASE PhD studentship for Scott Brooks with industry partner 3i Real-time prediction of cellular states in 3D lattice light sheet microscopy All UKRI grantsPublicationsGoogle Scholar; Scopus; orcid.org/0000-0002-5317-603XFurther AffiliationsI am also a member of the Zeeman Institute for Systems Biology & Infectious Disease Epidemiology Research (SBIDER) and the Centre for Mechanochemical Cell Biology. Office hours Term 3, 2024/25:arrange by email Group members Funding Data download PhD positions are available through MathSys, MIBTP, or MRC DTP @TBatUoW on XLink opens in a new window Follow on X Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 2628,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:35"
}