{
  "name": "Tillmann Miltzow",
  "homepage": "https://sites.google.com/view/miltzow/home",
  "status": "success",
  "content": "Till(mann) MiltzowSearch this siteEmbedded FilesSkip to main contentSkip to navigationTill MiltzowDear Visitor,I am Till. My official name, which I use on my papers, is Tillmann Miltzow. I am from Berlin, where I finished school in Pankow in 2004. Thereafter, I studied Mathematics at the Humboldt Universität zu Berlin. I did my Diploma thesis(=Master thesis) with Stefan Felsner at the Technical University of Berlin. In order to visit all three major universities in Berlin, I worked on my PhD under the guidance of Günter Rote at the Freie Universität Berlin from 2010 to 2015. Thereafter, I did a postdoc in Budapest at MTA SZTAKI in the group of Dániel Marx.  Thereafter, I joined the group of Jean Cardinal and Stefan Langerman. I stayed for another year in Brussels to learn about Combinatorial Optimization in the group of Sam Fiorini. I have been awarded a Veni grant and started in the group of Marc van Kreveld in Utrecht in November 2018. In 2021, I received a permanent contract as Assistant Prof. in Utrecht. In 2022, I switched to the research group of Hans Bodlaender. I will start my Vidi project in January 2023. Among the candidates in my cluster, I was ranked first. :) Let me know if you are interested to work on topics related to my Vidi.My research activity is mainly in Computational Geometry. But I am also more broadly interested in all fields of Algorithms and Computational Complexity. In the last few years, I focus my research on the Existential Theory of the Reals.Note that I made videos for some of my papers. If you are interested in one of my papers, this might help to get a quick overview. Check out my youtube channel!If you consider me as a reviewer for a journal please read my short notes.Recently, I receive many unsolicited applications. Please familiarize yourself with my research at least a bit, before you send me such an email. I update this webpage only every few years or so. Arxiv, google scholar, dblp, and Youtube are better sources to keep up to date with my recent work. I currently have two PhD students, Lucas Meijer and Jeremy Kirn.One of my research lines is to do research on the Dutch housing market. I have written a vision that describes potential research directions on the Dutch housing market in detail.best wishesTillSelected publications:Peeling and Nibbling the Cactus: Subexponential-Time Algorithms for Counting Triangulations and Related Problems (with Daniel Marx, appeared in SoCG 2016)The Art Gallery Problem is ∃R-complete  (with Mikkel Abrahamsen and Anna Adamaszek appeared in STOC 2018 / JACM 2022)Featured Video: Smoothed Analysis of the Art Gallery ProblemMy partner and I recently had the wonderful experience of having our first child. We are overly full of joy. Service to the research community:Socg 2019 PC, Soda 2023 PC, ICSC organizer, Workshop on New Directionsin Geometric AlgorithmsPhD Students:Lucas Meijer, Jeremy KirnGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2961,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:36"
}