{
  "name": "Tim Newman",
  "homepage": "http://www.cs.uah.edu/~tnewman",
  "status": "success",
  "content": "Tim Newman's Home Page Timothy S. Newman Professor Dept. of Computer Science University of Alabama in Huntsville This page is not regularly updated! Education: Bowling Green State University, B.S., Computer Science, Mathematics (dual majors) Michigan State University, M.S., Computer Science Michigan State University, Ph.D., Computer Science, 1993 Other Training: National Institutes of Health, NRC Postdoctoral Fellow, 1993-1994. Interests: Visualization (esp., Volume and Information Visualization), Computer Graphics, Biomedical Visualization and Image Analysis, Automated Visual Inspection, Computer Vision, Pattern Recognition and Data Analysis/Analytics, Imaging, and High Performance Computation. Useful Links: Visit our research group's (Graphics and Visualization Interest Group) Home Page! Visit the Computational Science Resources Home Page (a K-12 teacher's resource) Check out the Gallery of Images from some of our visualization research activities at Viz Image Gallery CompuKids Some Recent Course (Instructional) Information: CS 207 Spring 1999 Syllabus and Info CS 214 Spring 2017 Syllabus and Info CS 490 Spring 2001 Syllabus and Info (Postscript file!) CS 413 Spring 2017 Syllabus and Info (PDF!) CS 545 Spring 2006 Syllabus and Info (includes some OpenGL / GLUT helps) CS 613 Info: Spring 2018 (PDF file!) CS 645 Fall 2004 Syllabus (Postscript file!) CS 646 Summer 2005 Syllabus (PDF file!) and Summer 08 646 Project 3 Data File (ASCII file!) Summer 08 646 Project 3 Engine Data File (gzipped ASCII file!) Summer 08 646 Project 3 Foot Data File (gzipped ASCII file!) Note that all courses use the Department Course Policies Sheet, a version of which is available here: CS Dept. Course Policies Partial Publications List: (sorry that this list is incomplete) \"Dual Marching Squares: Description and Analysis,\" by S. Gong and T. S. Newman, Proc., IEEE Southwest Symp. on Image Analysis and Interpretation (SSIAI) '16, Santa Fe, Mar. 2016, pp. 53-56. \"Examining Classic Color Harmony versus Translucency Color Guidelines for Layered Surface Visualization,\" by S. Einakian and T. S. Newman, Proc., Int'l Symp. on Visual Computing (ISVC) '15, (Lecture Notes in Computer Science Vol. 9474), Las Vegas, Dec. 2015, pp. 318-327. \"More Usable V-EGI for Volumetric Dataset Registration,\" by C. Dong and T. S. Newman, Proc., Int'l Symp. on Visual Computing (ISVC) '15, (Lecture Notes in Computer Science Vol. 9474), Las Vegas, Dec. 2015, pp. 511-520. \"Directional Texture for Visualization--New Technique and Application Study\", by M. Maskey and T. S. Newman, Proc., Int'l Conf. on Information Visualization '15 (iv '15), Barcelona, July 2015, pp. 1-8. \"Isosurface Orientation Estimation in Sparse Grids using Tetrahedral Splines,\" by B. Wood and T. S. Newman, Journal of WSCG, Vol. 23, No. 1, 2015, pp. 73-82. \"A Measure of Texture Directionality,\" by M. Maskey and T. S. Newman, Proc., Int'l Conf. on Computer Vision Theory and Application (VISAPP) '15, Berlin, Mar. 2015, pp. 432-438. \"A Client-Server View-Dependent Isosurfacing Approach with Support for Local View Changes,\" by M. B. Couch and T.S. Newman, Proc., Visualization and Data Analysis (VDA) '15, San Francisco, Feb. 2015, pp. 93970D-1 to 93970D-14. \"On Reliable Estimation of Curvatures of Implicit Surfaces,\" by J. Hauenstein and T.S. Newman, Proc., IEEE Int'l Conf. on 3D Vision (3DV) '14, Tokyo, 2014, pp. 697-704. \"Efficient, GPU-based 2D Mesh Smoothing,\" by S. Dahal and T. S. Newman, Proc., IEEE Southeastcon '14, Lexington, KY, Mar. 2014, 7 pp. (doi: 10.1109/SECON.2014.6950720) \"Effective Color Combinations in Isosurface Visualization\" by S. Einakian and T. S. Newman, Proc., Visualization and Data Analysis (VDA) '13 (Proc., SPIE Vol. 8654), Burlingame, Calif., Feb. 2013, pp. 86540P-1 to 86540P-8. \"Exploring GPU- and Cluster-based Improvements for Over-sampled Volume Ray Casting Opacity Correction,\" by J. K. Lee and T. S. Newman, Int'l J. Image and Graphics, Vol. 12, No. 4, 2012, Article 1250025, 26 pp. \"A Volumetric spin-off EGI for Registration of Volume Datasets\" by C. Dong and T. S. Newman, Proc., First Asian Conf. on Pattern Recognition (ACPR) '11, Beijing, Nov. 2011, pp. 470-474 \"Finding Software Metrics Threshold Values using ROC Curves,\" by R. Shatnawi, W. Li, J. Swain, and T.S, Newman, J. Software Maintenance and Evolution: Research and Practice, Vol. 22, No. 1, 2010, pp. 1-16. \"Self-Scheduled Parallel Isosurfacing using Distributed Span Space on Cell,\" by M. R. Caruso and T. S. Newman, Proc., Eurographics Symp. on Parallel Graphics and Visualization (EGPGV) 2010, Norrkoping, Sweden, May 2010, pp. 73-79. \"Experiments on Effective Color Combinations in Map-based Information Visualization\" by S. Einakian and T. S. Newman, Proc., Visualization and Data Analysis (VDA) '10 (Proc., SPIE Vol. 7530), San Jose, Calif., Jan. 2013, pp. 753005-1 to 753005-12. \"New Shape-based Auroral Oval Segmentation driven by LLS-RHT,\" by C. Cao, T. S. Newman, and G. A. Germany, Pattern Recognition, Vol. 42, No. 5, 2009, pp. 607-618. \"Report on Realignment and Restructuring,\" UAH Faculty Senate Committee on Realignment and Restructuring, by T. Newman (chair), M. Banish, K. Frith, J. Gupta, E. Jovanov, J. Nelson, L. O'Keefe, B. Ong, A. Reeves, J. Schnell, and C. Scholz, 2009. \"Very Fast Ellipse Detection using GPU-Based RHT,\" by J. K. Lee, B. A. Wood, and T. S. Newman, Proc., Int'l Conf. on Pattern Recognition (IPCR) 2008, Tampa, Dec. 2008, 4 pp. \"On Accuracy of Marching Isosurfacing Methods,\" by C. Wang, T. S. Newman, and J. K. Lee, Proc., Symp. on Volume and Point-based Graphics, Los Angeles, 2008, pp.49-56. \"Acceleration of Opacity Correction Mechanisms for Over-Sampled Volume Ray Casting,\" by J. K. Lee and T. S. Newman, Proc., Eurographics Symp. on Parallel Graphics and Visualization (EGPGV) '08, Crete, April 2008, pp. 17-24. \"Evaluation of High Order Approximating Normals for Marching Cubes,\" by J. K. Lee, M. Maskey, T. S. Newman, B.A. Wood, and C. Wang, Proc., IEEE Southeastcon 2008, Huntsville, AL, April 2008, pp. 593-598. \"Plasmapause Equatorial Shape Determination via the Minimum L Algorithm: Description and Evaluation,\" by C. Wang, T. S. Newman and D. Gallagher, Journal of Geophysical Research (Space Physics) , Vol. 112, No. A12, A12201, Dec. 2007 (doi:10.1029/2006JA012202). \"New Hypothesis Distinctiveness Measure for Better Ellipse Extraction,\" by C. Wang, T. S. Newman, and C. Cao, Proc., Int'l Conf. on Image Analysis and Recognition (ICIAR) '07 (Lecture Notes in Computer Science 4633), Montreal, Aug. 2007, pp. 176-186. \"Voxel Averaging-Based Opacity Correction for Oversampled Volume Ray Casting,\" by J. Lee, T. S. Newman, and C. Wang, Proc., Int'l Conf. on Modeling, Simulation, and Visualization Methods '07, Las Vegas, June 2007, 7 pp. \"A New Method for Auroral Oval Detection in FUV Imagery,\" by C. Cao, T. S. Newman, G. A. Germany, and J. F. Spann, Proc., IAPR Conf. on Machine Vision Applications (MVA) '07, Tokyo, May 2007, pp. 583-586. \"Cell-by-Cell Compression for Faster Parallel Isosurfacing of Structured Grid Datasets,\" by B. A. Wood and T. S. Newman, Proc., Short Papers of Eurographics Symp. on Parallel Graphics and Visualization '07, Lugano, Switzerland, May 2007, on CD-ROM (4 pp.). \"New Method for Opacity Correction in Oversampled Volume Ray Casting,\" by J. Lee and T. S. Newman, Journal of WSCG, Vol. 15, 2007, pp. 1-8. \"Techniques for Computerized Cloud Rendering: A User Study,\" by M. Maskey and T. S. Newman, Proc., Graphics and Visualization in Engineering (GVE) '07 , Clearwater, FL, Jan. 2007, pp. 125-130. \"Least-squares-based Fitting of Paraboloids,\" by M. Dai, T. S. Newman, and C. Cao, Pattern Recognition, Vol. 40, 2007, pp. 504-515. \"High Performance on a Budget: Exploiting Embarassingly Parallel Computations in Ionosphere-Magnetosphere Modeling and Analysis Applications\" by T. S. Newman, AGU Fall 06 Abstracts Book , 2006 (abstract). \"Shape-Based Mechanisms for Content-Based Retrieval of Aurora Images,\" by C. Cao, T. Newman, and G. Germany, Proc., Wavelet Apps. in Ind. Proc. IV , (SPIE Vol. 6383,) Boston, Oct. 2006, pp. 63830T-1 to 63830T-12. \"A Survey of the Marching Cubes Algorithm,\" by T. S. Newman and H. Yi, Computers & Graphics, Vol. 30, No. 5, Oct. 2006, pp. 854-879. \"An Angle-Based Optimization Approach for 2D Finite Element Mesh Smoothing,\" by H. Xu and T. S. Newman, Finite Elements in Analysis and Design, Vol. 42, No. 13, Sept. 2006, pp. 1150-1164. \"New RHT-Based Ellipsoid Recovery Method,\" by C. Cao and T. S. Newman, Proc., 18th Int'l Conf. on Pattern Recognition, Hong Kong, Aug. 2006, pp. I-622 to I-625. \"An Analysis of Errors in Feature-Preserving Mesh Simplification,\" by H. Xu and T. S. Newman, Proc., 3D PVT 2006, Chapel Hill, NC, June 2006, pp. 671-678. \"Synthesis of 3D Model of a Magnetic Field-Influenced Body from a Single Image,\" by C. Wang, T. S. Newman, and D. Gallagher, Proc., 3D PVT 2006, Chapel Hill, NC, June 2006, pp. 1018-1025. \"Accurate Workload Estimation for Fast Parallel RMT,\" by T. S. Newman, and W. Ma, Short Papers of EG Symp. on Parallel Graphics and Visualization, Braga, Portugal, May 2006, pp. 13-16. \"Piggybacking for More Efficient Parallel Out-of-Core Isosurfacing,\" by T. S. Newman, and W. Ma, Proc., EG Symp. on Parallel Graphics and Visualization, Braga, Portugal, May 2006, pp. 145-152. \"Dynamic Aperture-based Solar Loop Segmentation,\" by J. Lee, T. S. Newman, and G. A. Gary, Proc., 7th IEEE Southwest Symp. on Image Analysis and Interpretation (SSIAI '06), Denver, Mar. 2006, pp. 91-94. \"2-D Drift Velocities from the IMAGE EUV Plasmaspheric Imager,\" by D. Gallagher and T. S. Newman, 2006 Yosemite Meeting, Feb. 2006 (abstract). \"Oriented Connectivity-based Method for Segmenting Solar Loops,\" by J. Lee, T. S. Newman, and G. A. Gary, Pattern Recognition, Vol. 39, 2006, pp. 246-259. \"Cumulus Cloud Synthetic Rendering Techniques and Their Evaluations,\" by M. Maskey and T. S. Newman, Machine Graphics & Vision , Vol. 14, 2005, pp. 399-425. \"Web-based Tool Suite",
  "content_length": 24905,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:53"
}