{
  "name": "Tim Althoff",
  "homepage": "http://www.timalthoff.com",
  "status": "success",
  "content": "Tim Althoff - Assistant Professor in Computer Science at the University of Washington Tim Althoff The goal of my research is to better understand and empower people through data. My research develops computational methods that leverage large-scale behavioral data to extract actionable insights about our lives, health and happiness through combining techniques from data science, social network analysis, and natural language processing. I direct the Behavioral Data Science Group which works on research related to mental health, misinformation, scientific reproducibility, and public health including informing the COVID-19 response. We are always looking for great postdocs. I am also looking for PhD students, especially in but not limited to neural representation learning, NLP and applications to psychology and mental health, causal inference, data science, and mobile health. If you're interested please apply to the UW Allen School. Go Dawgs! Selected highlights Cognitive Reframing of Negative Thoughts through Human-Language Model Interaction Outstanding Paper Award, ACL 2023 pdf data code Towards Facilitating Empathic Conversations in Online Mental Health Support: A Reinforcement Learning Approach Best Paper, WWW/WebConf 2021 pdf project dataset code video Political Bias and Factualness in News Sharing across more than 100,000 Online Communities Best Paper (Outstanding Analysis), ICWSM 2021 pdf dataset Publications Teaching Biographical Sketch Prospective Students 2023 Making Online Communities 'Better': A Taxonomy of Community Values on Reddit Galen Weld, Amy Zhang, Tim Althoff ICWSM 2024 (accepted) pdf Cognitive Reframing of Negative Thoughts through Human-Language Model Interaction Ashish Sharma, Kevin Rushton, Inna Wanyin Lin, David Wadden, Khendra G. Lucas, Adam S. Miner, Theresa Nguyen, Tim Althoff ACL 2023 Outstanding Paper Award pdf data code Human-AI Collaboration Enables More Empathic Conversations in Text-based Peer-to-Peer Mental Health Support Ashish Sharma, Inna Lin, Adam Miner, David Atkins, Tim Althoff Nature Machine Intelligence 2023 pdf nature project dataset code Homekit2020: A Benchmark for Time Series Classification on a Large Mobile Sensing Dataset with Laboratory Tested Ground Truth of Influenza Infections Mike A Merrill, Esteban Safranchik, Arinbjörn Kolbeinsson, Piyusha Gade, Ernesto Ramirez, Ludwig Schmidt, Luca Foschini, Tim Althoff CHIL 2023 pdf Self-Supervised Pretraining and Transfer Learning Enable Flu and COVID-19 Predictions in Small Mobile Sensing Datasets Mike Merrill, Tim Althoff CHIL 2023 pdf Understanding and Supporting Debugging Workflows in Multiverse Analysis Ken Gu, Eunice Jun, Tim Althoff CHI 2023 pdf Leveraging Mobile Technology For Public Health Promotion: A Multidisciplinary Perspective Jennifer L. Hicks, Melissa A. Boswell, Tim Althoff, Alia J. Crum, James A. Landay, Joy P. Ku, Paula M.L. Moya, Elizabeth L. Murnane, Michael P. Snyder, Abby C. King, Scott L. Delp Annual Review of Public Health 2023 pdf Mapping User Engagement in Digital Psychotherapy: An Integrative Engagement Model James M Zech, Morgan Johnson, Michael D Pullman, Thomas D Hull, Tim Althoff, Sean A Munson, Nicole Fridling, Boris Litvin, Jerilyn Wu, Patricia A Areán JMIR Formative Research 2023 pdf 2022 Disparate impacts on online information access during the COVID-19 pandemic Jina Suh, Eric Horvitz, Ryen W. White, Tim Althoff Nature Communications 2022 pdf Gendered Mental Health Stigma in Masked Language Models Inna Wanyin Lin*, Lucille Njoo*, Anjalie Field, Ashish Sharma, Katharina Reinecke, Tim Althoff, Yulia Tsvetkov EMNLP 2022 pdf GLOBEM: Cross-Dataset Generalization of Longitudinal Human Behavior Modeling Xuhai Xu, Han Zhang, Yasaman Sefidgar, Xin Liu, Woosuk Seo, Jennifer Brown, Yiyi Ren, Kevin Kuehn, Mike Merrill, Paula Nurius, Anne Browning, Shwetak Patel, Tim Althoff, Magaret E. Morris, Eve Riskin, Jennifer Mankoff, Anind K. Dey NeurIPS 2022 pdf data and code GLOBEM: Cross-Dataset Generalization of Longitudinal Human Behavior Modeling Xuhai Xu, Xin Liu, Han Zhang, Weichen Wang, Subgiya Nepal, Kevin S. Kuehn, Jeremy Huckins, Margaret E. Morris, Paula S. Nurius, Eve A. Riskin, Shwetak Patel, Tim Althoff, Andrew Campell, Anind K. Dey, Jennifer C. Mankoff IMWUT/UbiComp 2022 pdf data and code A computational approach to measure the linguistic characteristics of psychotherapy timing, responsiveness, and consistency Adam S Miner, Scott L Fleming, Albert Haque, Jason Fries, Tim Althoff, Denise Wilfley, W Stuart Agras, Arnold Milstein, Jeff Hancock, Steven M Ash, Shannon W Stirman, Bruce A Arnow, Nigam Shah npj Mental Health Research 2022 pdf Large-scale diet tracking data reveal disparate associations between food environment and diet Tim Althoff, Hamed Nilforoshan, Jenna Hua, Jure Leskovec Nature Communications 2022 pdf dataset Estimating the Burden of Influenza on Daily Activity at Population Scale Using Commercial Wearable Sensors Aziz Mezlini, Allison Shapiro, Eric J. Daza, Eamon Caddigan, Ernesto Ramirez, Tim Althoff, Luca Foschini JAMA Network Open 2022 pdf What Makes Online Communities 'Better'? Measuring Values, Consensus, and Conflict across Thousands of Subreddits Galen Weld, Amy Zhang, Tim Althoff ICWSM 2022 pdf Adjusting for Confounders with Text: Challenges and an Empirical Evaluation Framework for Causal Inference Galen Weld*, Peter West*, Maria Glenski, David Arbour, Ryen Rossi, Tim Althoff (* equal contribution) ICWSM 2022 pdf CORAL: COde RepresentAtion Learning with Weakly-Supervised Transformers for Analyzing Data Analysis Ge Zhang, Mike Merrill, Yang Liu, Jeff Heer, Tim Althoff EPJ Data Science 2022 pdf 2021 Same data, different conclusions: Radical dispersion in empirical results when independent analysts operationalize and test the same hypothesis Martin Schweinsberg, ..., Tim Althoff, ..., Eric Luis Uhlmann (179 authors total) Organizational Behavior and Human Decision Processes 2021 pdf MULTIVERSE: Mining Collective Data Science Knowledge from Code on the Web to Suggest Alternative Data Analysis Approaches Mike Merill, Ge Zhang, Tim Althoff KDD 2021 pdf Political Bias and Factualness in News Sharing across more than 100,000 Online Communities Galen Weld, Maria Glenski, Tim Althoff ICWSM 2021 Best Paper Award (Outstanding Analysis Paper) pdf dataset The Effect of Moderation on Online Mental Health Conversations David Wadden, Tal August, Qisheng Li, Tim Althoff ICWSM 2021 Best Paper Award (Outstanding Study Design) pdf Towards Facilitating Empathic Conversations in Online Mental Health Support: A Reinforcement Learning Approach Ashish Sharma, Inna Lin, Adam Miner, David Atkins, Tim Althoff WWW/WebConf 2021 Best Paper Award (single award across all 1736 submissions) pdf project dataset code video Online Mobile App Usage as an Indicator of Sleep Behavior and Job Performance Chunjong Park, Morelle Arian, Xin Liu, Leon Sasson, Jeffrey Khan, Shwetak Patel, Alex Mariakakis, Tim Althoff WWW/WebConf 2021 pdf Daily, weekly, seasonal, and menstrual cycles in female mood, behavior, and vital signs Emma Pierson, Tim Althoff, Daniel Thomas, Paula Hillard, Jure Leskovec Nature Human Behavior 2021 pdf Population-Scale Study of Human Needs During the COVID-19 Pandemic: Analysis and Implications Jina Suh, Eric Horvitz, Ryen White, Tim Althoff WSDM 2021 pdf video poster Characterizing COVID-19 and Influenza Illnesses in the Real World via Person-Generated Health Data Nikki Marinsek, Allison Shapiro, Ieuan Clay, Ben Bradshaw, Ernesto Ramirez, Jae Min, Andrew Trister, Yuedong Wang, Tim Althoff, Luca Foschini Cell Patterns 2021 pdf Efficient and Explainable Risk Assessments for Imminent Dementia: Insights from an Aging Cohort Study Nicasia Beebe-Wang*, Alexandra Okeson*, Tim Althoff§, Su-In Lee§ (*§ equal contribution) IEEE Journal of Biomedical and Health Informatics 2021 pdf Leveraging Community and Author Context to Explain the Performance and Bias of Text-Based Deception Detection Models Galen Weld, Ellyn Ayton, Tim Althoff, Maria Glenski NAACL Workshop on NLP for Internet Freedom: Censorship, Disinformation, and Propaganda 2021 Best Paper Award pdf Estimating the Burden of Influenza on Daily Activity at Population Scale Using Commercial Wearable Sensors Aziz Mezlini, Allison Shapiro, Eric J. Daza, Eamon Caddigan, Ernesto Ramirez, Tim Althoff, Luca Foschini medRxiv 2021 pdf 2020 Assessing the relationship between routine and schizophrenia symptoms with passively sensed measures of behavioral stability Joy He-Yueya, Benjamin Buck, Andrew Campbell, Tanzeem Choudhury, John M Kane, Dror Ben-Zeev, Tim Althoff NPJ Schizophrenia 2020 pdf A Computational Approach to Understanding Empathy Expressed in Text-Based Mental Health Support Ashish Sharma, Adam Miner, David Atkins, Tim Althoff EMNLP 2020 pdf project dataset code Boba: Authoring and Visualizing Multiverse Analyses Yang Liu, Alex Kale, Tim Althoff, Jeff Heer VAST 2020 pdf Data-Driven Implications for Translating Evidence-Based Psychotherapies into Technology-Delivered Interventions Jessica Schroeder, Jina Suh, Chelsey Wilks, Mary Czerwinski, Sean Munson, James Fogarty, Tim Althoff EAI PervasiveHealth 2020 pdf Engagement Patterns of Peer-to-Peer Interactions on Mental Health Platforms: A Case-Study of TalkLife Ashish Sharma, Monojit Choudhury, Tim Althoff, Amit Sharma ICWSM 2020 pdf Paths Explored, Paths Omitted, Paths Obscured: Decision Points & Selective Reporting in End- to-End Data Analysis Yang Liu, Tim Althoff, Jeff Heer CHI 2020 pdf 2019 Passively-sensed Behavioral Correlates of Discrimination Events in College Students Yasaman S. Sefidgar, Woosuk Seo, Kevin S. Kuehn, Tim Althoff,, Anne Browning, Eve Riskin, Paula S. Nurius, Anind K. Dey, Jennifer Mankoff IMWUT/UbiComp 2019 pdf Leveraging Routine Behavior and Contextually-Filtered Features for Depression Detection among College Students Xuhai Xu, Prerna Chikersal, Afsaneh Doryab, Daniella Villalba, Janine M. Dutcher, Michael J. Tumminia, Tim Althoff, Sheldon Cohen, Kasey Creswell, David C",
  "content_length": 17668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:41"
}