{
  "name": "Tim Hickey",
  "homepage": "http://www.cs.brandeis.edu/~tim",
  "status": "success",
  "content": "Tim Hickey's home web page Timothy J. Hickey Professor of Computer Science Instructor in the Transitional Year Program Brandeis University Waltham, MA 02454 tjhickey@brandeis.edu https://orcid.org/0000-0002-4583-686X Scholarworks Profile Academia.edu website Why major in Computer Science? (video) Office Hours: Mon 11:10-12, Wed 4-5, Thu 2:30-3:30 in person in Volen 137 sign up for a meeting time on this link on zoom at https://brandeis.zoom.us/j/994399878 Research: Vita, Publications, Citations, Brandeis faculty guide, DBLP entry, Academic Genealogy, Activity Reports, Grant Support, ORCID 3D Game Design in Blender a 3d game design pipeline into Computer Science Educational Technology Group website Brain Computer Interface Lab CS Diversity Task Force Initiative Recent Publications -- See Full publication list 2025 Grading for Equity in a Hyflex Compiler Design Course Fatima Abu Deeb & Ella Tuson & Timothy Hickey SIGCSE 2025 (to appear) 2024 The Internal Internship: Enabling Novel Opportunities for Undergraduate Data Science Experiential Education Jessica Liebowtiz & Timothy Hickey Virtual SIGCSE 2024 (to appear) 2023 Impact of reflection in auto-graders: an empirical study of novice coders Fatima Abu Deeb & Timothy Hickey Computer Science Education, (2023) DOI: 10.1080/08993408.2023.2262877 (contact me if you want a link to the full article!) Student Talent Helps Brandeis Put Data to Work Jessica Leibovitz and Tim Hickey Trusteeship Magazine, Volume 31, Number 4, July/August 2023 Mastery Learning with Specs Grading for Programming Courses Ella Tuson and Tim Hickey Proceedings of the 54th ACM Technical Symposium on Computer Science Education Vol 1. March 2023 Pages 1049–1054 SIGCSE 2023 https://doi.org/10.1145/3545945.3569853 2022 Mastery Learning and Specs Grading in Discrete Math. Ella Tuson and Tim Hickey Proceedings of the 27th ACM Conference on on Innovation and Technology in Computer Science Education Vol. 1 (ITiCSE '22). Association for Computing Machinery, New York, NY, USA, 19–25. https://doi.org/10.1145/3502718.3524766 EEG4Home: A Human-In-The-Loop Machine Learning Model for EEG-Based BCI. Qu, X., Hickey, T.J. (2022). In: Schmorrow, D.D., Fidopiastis, C.M. (eds) Augmented Cognition. HCII 2022. Lecture Notes in Computer Science(), vol 13310. Springer, Cham. https://doi.org/10.1007/978-3-031-05457-0_14 2021 Reflective Debugging with a Python Web IDE Fatima Abu Deeb, Timothy J Hickey SIGCSE '21: Proceedings of the 52nd ACM Technical Symposium on Computer Science Education March 2021 Pages 1368 https://doi.org/10.1145/3408877.3439556 Reflective Debugging in Spinoza V3. 0 Fatima Abu Deeb, Timothy J Hickey Australasian Computing Education Conference, 125-130 2020 Identifying Clinically And Functionally Distinct Groups Among Healthy Controls And First Episode Psychosis Patients By Clustering On EEG Patterns by Xiaodong Qu, Saran Liukasemsarn, Jingxuan Tu, Amy Higgins, Timothy Hickey, Mei-Hua Hall Frontiers in Psychiatry Using EEG to Distinguish between Writing and Typing for the same Cognitive Task by Xiaodong Qu, Qingtian Mei, Peiyan Liu, Timothy Hickey. Brain-Function Assessmentin Learning (BFAL2020) Heraklion, Crete, Oct 2020 Multi-Class Time Continuity Voting for EEG Classification by Xiaodong Qu, Peiyan Liu, Zhaonan Li, Timothy Hickey. Brain-Function Assessmentin Learning (BFAL2020) Heraklion, Crete, Oct 2020 2019 Teaching Introductory Cryptography using a 3D Escape-the-Room Game by Fatima Abu Deeb and Timothy Hickey 2019 IEEE Frontiers in Education Conference FIE 2019 Refining Skill Classification with Interactive Machine Learning\" by Kristian Kime, Timothy Hickey, and Rebecca Torrey 2019 IEEE Frontiers in Education Conference FIE 2019 21st Century Skill Building with Web-based Games by William DeRusha and Timothy Hickey Proceedings of the 10th International Conference on Computer Supported Education CSEDU 2019 Recursive Pedagogy by Fatima Abu Deeb, Timothy Hickey Proceedings of the 10th International Conference on Computer Supported Education CSEDU 2019 Teaching and assessing debugging, testing, and coding style with Recursive Pedagogy using Spinoza by Fatima Abu Deeb, Timothy Hickey Proceedings of the 50th ACM Technical Symposium on Computer Science Education SIGCSE 2019 2018 MSET: An Optimally Efficient Collaborative Editor with Garbage Collection by Kenroy Granville and Timothy Hickey in preparation ... Using Spinoza Log Data to Enhance CS1 Pedagogy by Fatima Abu Deeb, Antonella DiLillo, Timothy Hickey submitted for publication in Communications in Computer and Information Science (CCIS), Springer International Publishing Switzerland, submitted to CCIS EEG Markers of STEM Learning by Xiaodong Qu, Venux Yixin Sun, Robert Sekuler, Timothy Hickey accepted for publication in Frontiers in Education FIE 2018 Classroom Orchestration with Problem Solving Markov Models by Fatima Abu Deeb and Timothy Hickey accepted for publication in Frontiers in Education FIE 2018 Machine Learning Based Directed Self Study in Calculus with CalcTutor by Kristian Kime, Timothy Hickey, and Rebeccah Torrey accepted for publication in Frontiers in Education FIE 2018 A Personalized Reading Coach using Wearable EEG Sensors:A pilot study of brainwave learning analytics by Xiaodong Qu, Mercedes Hall, Yile Sun, Robert Sekuler, Timothy Hickey A2E 2018 Using Fine Grained Programming Error Data to Enhance CS1 Pedagogy by Fatima Abe Deeb and Timothy Hickey CSEDU 2018 Spinoza -- In-class Python Problem Solving With Classroom Orchestration by Fatima Abu Deeb and Timothy Hickey SIGCSE 2018 2017 The Calculus Dashboard - leveraging intelligent tutor techniques to provide automated fine-grained student assessment by Kristian Kime, Timothy Hickey, and Rebecca Torrey Frontiers in Education FIE 2017 Flipping Introductory Programming Classes using Spinoza and Agile Pedagogy by Fatima Abe Deeb and Timothy Hickey Frontiers in Education FIE 2017 Groupwork: Learning During Collaborative Assessment Activities by William Tarimo and Timothy Hickey CSCL2017 2016 Catching audiovisual interactions with a first-person fisherman video game, by Yile Sun, Barbara Shinn-Cunningham, Timothy Hickey, Robert Sekuler Perception. Measuring and Visualizing Learning with Markov Models by Fatima Abu Deeb, Kristian Kime, Rebecca Torrey, and Timothy Hickey Frontiers in Education (FIE2016). Fully Integrating Remote Students into a Traditional Classroom using Live-Streaming and TeachBack by William Tarimo and Timothy Hickey Frontiers in Education (FIE2016). Early Detection of At-risk Students in CS1 Using Teachback/Spinoza, by William T. Tarimo, Fatima Abu Deeb, Timothy J. Hickey CCSCNE'16 A Flipped Classroom With and Without Computers by William T Tarimo, Fatima Abu Deeb, and Timothy J. Hickey in Computer Supported Education, CCIS vol 583, Springer International Publishing Switzerland, 2016 Building Bridges Between Science Courses Using Honors Organic Chemistry Projects by Timothy J. Hickey and Jason K. Pontrello Journal of College Science Teaching, 46(1), 2016. 2015 Policing Fish at Boston's Museum of Science: Studying Audiovisual Interaction in the Wild by Hannah Goldberg, Yile Sun, Timothy J. Hickey, Barbara Shinn-Cunningham, and Robert Sekuler. i-Perceptions, 2015, 6(3) 1-11. DOI: 10.1177/2041669515599332 CalcTutor: Applying the Teachers Dilemma Methodology to Calculus Pedagogy by Kristian Kime, Rebecca Torrey, and Timothy Hickey pp 646-653 in the FIE'15 Proceedings Computers in the CS1 Classroom by Timothy Hickey, Fatima Abu Deeb, and William Tarimo pp 67-74, DOI:10.5220/0005436600670074 in CSEDU'15 Spinoza: the Code Tutor by Fatima Abu Deeb and Timothy Hickey CIST'15, May 11-12, 2015, Ottawa CA, pp. 132-1 to 132-8, 2015. Adopting a \"Flipped\" Interactive Pedagogy Using Teachback by Timothy J. Hickey and William T. Tarimo Tutorial presented in CCSCNE'15 The Spinoza Code Tutor by Fatima Abu Deeb and Timothy J. Hickey Poster presented in CCSCNE'15 2014 The Affective Tutor by Timothy Hickey and William Tarimo the Journal of Computing Sciences in Colleges, 29(6), pp. 50-56, 2014. 2013 Physics-based 3D Game Design as a First Course in Computing by Timothy Hickey the Journal of Computing Sciences in Colleges, pp. 35-41, vol 28 no 6, 2013, The Entrepreneur’s Bootcamp: A New Model For Teaching Web/Mobile Development and Software Entrepreneurship by Timothy Hickey and Pito Salas SIGCSE’13, March 6–9, 2013, Denver, Colorado, USA. , 2013. PhD Students Graduates Shyam Rajagopal Mudambi (1991) - \"Scheduling Or-Parallelism on Non-Uniform Memory Access Machines\" Don Alan Smith (1993) - \"MultiLog: Data Or-Parallel Logic Programming\" Qun Ju (1998) - \"A Sound Interval Constraint Logic Programming System\" David Karger Wittenburg (2004) \"CLP(F) Modeling of Hybrid Systems\" John T. Langton (2008) - \"Simulation, Visualization and Data Mining: A methodology for interactive scientific discovery.\" Josh E. Introne (2008) -- \"Adaptive Mediation in Groupware\" William T. Tarimo (2016) - \"Computer-Supported Agile Teaching\" Fatima A. Abu Deeb (2018) - \"Problem Solving Markov Models and Recursive Pedagogy\" Kristian Kime (2021) - \"Insightful Learning Systems: Supporting STEM Education with Accessible Cyberlearning\" Xiaodong Qu (2022) - \"Time Continuity Voting for Electroencephelography (EEG) Classification\" Current PhD Students Ella Tuson (expected graduation 5/2025) Teaching and related Activites Guest Lectures How to Rapidly Move Your Brandeis Courses Online Spring 2025 CS29a: Discrete Structures Fall 2024 SABBATICAL Summer 2024 CS10a: Introduction to Problem Solving in Python CS153a: Mobile Application Development Spring 2024 CS150a: Compiler Design Fall 2023 CS29a-1: Discrete Structures CS29a-2: Discrete Structures Summer 2023 CS10a: Introduction to Problem Solving in Python CS153a: Mobile Application Development Spring 2023 CS10a: Introduction to Problem Solving in Python CS103a: Introduction to Software Engineering Fall 2022 CS10a: Introduction to Problem Solving in Python CS164a: Introduction to",
  "content_length": 15330,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:49"
}