{
  "name": "Tim Wilhelm Nattkemper",
  "homepage": "http://ekvv.uni-bielefeld.de/pers_publ/publ/PersonDetail.jsp?personId=11602",
  "status": "success",
  "content": "Tim Wilhelm Nattkemper - PEVZ - Universität Bielefeld Zum Hauptinhalt springen Universität Bielefeld Play rectangle-plus PEVZ Personen- und Einrichtungssuche Weitere Links Startseite Funktionsträger Meine Personendaten Einrichtungen einbinden Meine Uni App Verlauf Nattkemper, Tim Wilhelm, Prof. Dr.-Ing. BIS Links Hilfe & Kontakt Zur BIS Homepage Personen- und Einrichtungssuche Weitere Links Startseite Funktionsträger Meine Personendaten Einrichtungen einbinden Meine Uni App Verlauf Nattkemper, Tim Wilhelm, Prof. Dr.-Ing. BIS Links Hilfe & Kontakt Zur BIS Homepage Personen- und Einrichtungssuche Herr Prof. Dr.-Ing. Tim Wilhelm Nattkemper Kontakt 1. Technische Fakultät / Arbeitsgruppen / AG Biodata Mining E-Mail tim.nattkemper@uni-bielefeld.de Homepage Öffnen Telefon +49 521 106-6059 Telefon Sekretariat +49 521 106-6882 − Sekretariat zeigen Büro UHG V10-111 − Lage-/Raumplan Erreichbarkeit Mo: 13:00-14:00 Kontakt im Adressbuch speichern 2. Centrum für Biotechnologie - CeBiTec / AG Biodata Mining Leiter der AG \"Biodata Mining\" E-Mail tnattkem@techfak.uni-bielefeld.de Homepage Öffnen Telefon +49 521 106-6059 Telefon Sekretariat +49 521 106-8662 − Sekretariat zeigen Büro UHG V10-111 − Lage-/Raumplan Kontakt im Adressbuch speichern 3. Technische Fakultät / Kommissionen und Ausschüsse / Auswahlkommission für das Bundesstipendienprogramm E-Mail tnattkem@techfak.uni-bielefeld.de Kontakt im Adressbuch speichern 4. Technische Fakultät / Kommissionen und Ausschüsse / Fakultätskonferenz / Hochschullehrerinnen und Hochschullehrer pers. Stellvertreter für Prof. Dr. Philipp Cimiano E-Mail tim.nattkemper@uni-bielefeld.de Kontakt im Adressbuch speichern 5. Institut für Bioinformatik-Infrastruktur (BIBI) 6. Institut für Bioinformatik-Infrastruktur (BIBI) / DILS-Faculty 7. Technische Fakultät / Kommissionen und Ausschüsse / Gleichstellungskommission stellvertretendes MitgliedGruppe der Hochschullehrerinnen und Hochschullehrer E-Mail tim.nattkemper@uni-bielefeld.de Kontakt im Adressbuch speichern 8. Technische Fakultät / Kommissionen und Ausschüsse / Habilitationsausschuss Mitglied E-Mail tim.nattkemper@uni-bielefeld.de Kontakt im Adressbuch speichern 9. Technische Fakultät / Kommissionen und Ausschüsse / Lenkungsausschuss Promotionsstudiengang Bioinformatik MitgliedGruppe der Hochschullehrerinnen und Hochschullehrer 10. Technische Fakultät / Kommissionen und Ausschüsse / Prüfungsausschüsse / Naturwissenschaftliche Informatik (Master) Mitglied (Vorsitz)Gruppe der Hochschullehrer*innen Modulverantwortlicher für 39-IBM-IX Erweiterungsmodul 39-IBM-VIII-FME Forschungsmodul extern 39-IBM-VIII-FMI Forschungsmodul Intern 39-Inf-IV Information Visualization 39-Inf-WP-IS Informationssysteme (Basis) 39-Inf-WP-IS-x Informationssysteme (Schwerpunkt) 39-MBT6 Einführung in die Bioinformatik 39-MBT6a Einführung in die Bioinformatik (5 LP) 39-M-Inf-VBD Visualisierungsansätze für Biodaten Aktuelle Forschungsthemen Biodata Mining, Image Processing, Bioimage Informatics, Underwater Image Analysis, Visualization, Information Visualization Seitenleiste Forschung Mein Forschungsprofil Publikationen Aktuelle Forschungsthemen Lehre Lehrveranstaltungen Wochenplan Modulverantwortlichkeiten Fehler gefunden? Kontaktpersonen für Korrekturwünsche Mein PEVZ Anrufumleitung einrichten Curriculum Vitae eingeben Bild ersetzen / löschen Aktuelle Forschungsthemen, Mitgliedschaften und Funktionen bearbeiten Meine E-Mailverteiler Visitenkarten und Türschilder Quicklinks Verlinkung / Einbindung Seite zum Handy schicken Scannen Sie den QR-Code: Zum Seitenanfang",
  "content_length": 3564,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:56"
}