{
  "name": "Tim Finin",
  "homepage": "http://umbc.edu/~finin",
  "status": "success",
  "content": "Tim Finin, UMBC Computer Science and Electrical Engineering Tim Finin Willard and Lillian Hackerman Chair in Engineering Computer Science and Electrical Engineering 329 ITE, University of Maryland, Baltimore County 1000 Hilltop Circle, Baltimore MD 21250 finin@umbc.edu, https://umbc.edu/~finin/ voice: +1.410.455.3522,  fax: +1.410.455.3969 @timFinin Q7803487 m/0g1wrz 0000-0002-6593-1792 A5009972149 home CV papers research teaching calendar SNR>>1 Tim Finin is the Director of the UMBC Center for Artificial Intelligence, the Willard and Lillian Hackerman Chair in Engineering, and a retired professor in the Computer Science and Electrical Engineering department at the University of Maryland, Baltimore County (UMBC). He has over 50 years of experience applying AI to problems in information systems and language understanding. His current research focuses on representing and reasoning with knowledge graphs, analyzing and extracting information from text, and enhancing security and privacy in information systems. He is an ACM Fellow, an AAAI Fellow, and a recipient of the IEEE Technical Achievement Award. He was selected as the UMBC Presidential Research Professor in 2012. Finin received an S.B. degree in Electrical Engineering from MIT and a Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign. He has held positions at UMBC, Unisys, the University of Pennsylvania, Johns Hopkins University, and the MIT AI Laboratory. He has chaired the UMBC Computer Science department, served on the Computing Research Association board of directors, been a AAAI councilor, and chaired many major research conferences. He is a former editor-in-chief of the Elsevier Journal of Web Semantics. Recent classes: Spring 2023: CMSC 471 Artificial Intelligence Fall 2022: CMSC 491/691 Knowledge Graphs Spring 2022: CMSC 471 Artificial Intelligence Fall 2021: CMSC 671 Principles of Artificial Intelligence Spring 2021: CMSC 471 Artificial Intelligence Fall 2020: CMSC 671 Principles of Artificial Intelligence Spring 2020: CMSC 471 Artificial Intelligence Fall 2019: CMSC 491/691 Knowledge Graphs Ebiquity lab | UMBC AI | CSEE | UMBC | ISWC 2024",
  "content_length": 2164,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:50"
}