{
  "name": "Tim Oates 0001",
  "homepage": "http://www.csee.umbc.edu/people/faculty/tim-oates",
  "status": "success",
  "content": "Tim Oates – Department of Computer Science and Electrical Engineering – UMBC Skip to main content Department of Computer Science and Electrical Engineering Menu Apply Search Search Context This Site All of UMBC Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn Position Professor of Computer Science and Electrical Engineering Office 336 Information Technology and Engineering (ITE) Building Contact Information University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 phone: (410) 455-3082 email: oates@cs.umbc.edu website: http://coral-lab.umbc.edu Education Ph.D., Computer Science, U.Massachusetts, Amherst, 2000 M.S., Computer Science, U. Massachusetts, Amherst, 1997 B.S., Computer Science, B.S., Electrical Engineering, 1989 Research Areas Dr. Oates’ recent work has explored deep neural networks for weakly supervised EEG denoising for brain-machine interfaces, human-in-the-loop deep reinforcement learning to train robots using video demonstrations, and learning declarative representations of the functionality of “found” hardware using black box methods.  Ongoing efforts include novel methods for learning semantically rich compositional sentence embeddings, learning policies for monitoring and updating deployed deep learning models to maintain performance in the face of domain shifts, and unsupervised methods for learning grounded, relational policies for understanding and control of real and simulated environments. To learn more about Dr. Oates’ research pursuits, read his research profile. Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2604,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:53"
}