{
  "name": "Tim Baldwin",
  "homepage": "https://mbzuai.ac.ae/study/faculty/timothy-baldwin",
  "status": "success",
  "content": "Timothy Baldwin - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Timothy Baldwin Timothy Baldwin Provost and Professor of Natural Language Processing Research Interests Professor Baldwin’s primary research focus is on natural language processing (NLP), including deep learning, algorithmic fairness, computational social science, and social media analytics. Email Share Tim Baldwin is Provost and Professor of Natural Language Processing at Mohamed bin Zayed University of Artificial Intelligence, in addition to being a Melbourne Laureate Professor in the School of Computing and Information Systems, The University of Melbourne, and Chief Scientist of LibrAI, a start-up focused on AI safety. Professor Baldwin is the author of around 500 peer-reviewed publications across diverse topics in natural language processing and AI, with over 25,000 citations, in addition to being the recipient of a number of prestigious awards at top NLP conferences. He is also a co-developer of widely used LLMs for languages including Arabic, English, and Indonesian, with over 1m downloads on Huggingface. He has been featured in media outlets including MIT Tech Review, Bloomberg, Reuters, The Economist, CNN, Financial Times, IEEE Spectrum, The Times, and ABC News, and his research has been funded by organizations including the National Science Foundation, Australian Research Council, Google, Microsoft, Xerox, ByteDance, NTT, and Fujitsu. Ph.D. in computer science from the Tokyo Institute of Technology, Japan. Master of Engineering in computer science from the Tokyo Institute of Technology, Japan. Bachelor of Science (Computer Science/Mathematics) from The University of Melbourne, Australia. Bachelor of Arts (Linguistics/Japanese) from The University of Melbourne, Australia. Baldwin is the author of more than 450 peer-reviewed publications across diverse topics in natural language processing and AI. Outstanding Paper Award, EACL 2023 Best Paper Award, EMNLP 2021 Workshop on Multilingual Representation Learning 2021 Research Field Leader in Computational Linguistics, The Australian Outstanding Reviewer Award, EACL 2021 Best Paper Award Honorable Mention, ACL 2020 2020 Research Field Leader in Computational Linguistics, The Australian Outstanding Reviewer Award, EMNLP 2020 2020 MSE Excellence Award for Outstanding Graduate Researcher Supervision, Melbourne School of Engineering Best Paper Award, ALTW 2019 Outstanding Reviewer Award, EMNLP-IJCNLP 2019 2019 Research Field Leader in Computational Linguistics, The Australian Outstanding Reviewer Award, NAACL HLT 2019 Best Paper Award Runner-up, AGILE 2019 Outstanding Reviewer Award, NAACL HLT 2018 Best Short Paper Award, ICTIR 2018 Best Short Paper Award, ALTW 2018 Outstanding Paper Award, ACL 2017 Best Paper Award, ALTW 2017 IBM Faculty Award 2016 2015 Honorary Member, Australian Computer Society Outstanding Reviewer Award, ACL 2015 Outstanding Reviewer Award, NAACL HLT 2015 Outstanding Reviewer Award, ACL 2014 2014 Erasmus Mundus Scholar (invited scholar at Saarland University) 2014—   Permanent Member of the International Committee on Computational Linguistics (ICCL) 2013—2016 ARC Future Fellow 2012 Best Paper Award Runner-up, PACLIC 2012 2011—2012 Erasmus Mundus Scholar (invited scholar at Saarland University) Google Plenary Highlight Paper Award, The 2011 Conference on Empirical Methods in Natural Language Processing (EMNLP 2011) Best Paper Award, ALTW 2009 2008 Erasmus Mundus Scholar (invited scholar at Saarland University) 2008 Teaching Excellence Award (School of Engineering, The University of Melbourne) 2008 JSPS Short-term Fellow (invited fellow at University of Tokyo) 2008 Elsevier Grand Challenge Semi-finalist 2006 Teaching Award (Department of Computer Science and Software Engineering, University of Melbourne) Best Poster Award, 12th Australasian World Wide Web Conference: AusWeb06 2005 Teaching Award Commendation (Department of Computer Science and Software Engineering, University of Melbourne) 2005 Research Excellence Award (Department of Computer Science and Software Engineering, University of Melbourne) 2002 Best Paper Award, Eighth Annual Meeting of the Association of Natural Language Processing, Japan Chairing/executive positions: President, Association for Computational Linguistics (2022) Permanent Member of the International Committee on Computational Linguistics (2014—) Advisory Board for ACL SIGLEX (Special Interest Group on the Lexicon) (2014—) Advisory Board for ACL SIGDAT (Special Interest Group for linguistic data and corpus-based approaches to NLP) (2014—) Editorial board of Transactions of the Association for Computational Linguistics (2015—) and ACL Rolling Review (2021—) General Chair of the 10th CCF International Conference on Natural Language Processing and Chinese Computing (NLPCC2021) Tutorial Chair for AACL-IJCNLP 2020 Tutorial Chair for EMNLP-IJCNLP 2019 Workshop Chair for COLING 2018 Local Chair for ACL 2018 Workshop Chair for COLING 2014 Australasian Language Technology Association President (2011—2012) and Secretary (2013—2014) Programme co-chair for EMNLP 2013 Programme co-chair for *SEM 2013 Editorial board of Computational Linguistics (2006—2008) Workshop Chair for IJCNLP 2008 Local Chair for PACLING 2007 Publicity Chair for COLING/ACL 2006 Publication Timothy Baldwin He is the author of more than 400 peer-reviewed publications across diverse topics in natural language processing and AI. Subramanian, Shivashankar, Afshin Rahimi, Timothy Baldwin, Trevor Cohn and Lea Frermann (2021) Fairness-aware Class Imbalanced Learning, In Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing (EMNLP 2021), Online and Punta Cana, Dominican Republic, pp. 2045—2051. Subramanian, Shivashankar, Xudong Han, Timothy Baldwin, Trevor Cohn and Lea Frermann (2021) Evaluating Debiasing Techniques for Intersectional Biases , In Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing (EMNLP 2021), Online and Punta Cana, Dominican Republic, pp. 2492—2498. Aji, Alham Fikri , Genta Indra Winata, Fajri Koto, Samuel Cahyawijaya, Ade Romadhony, Rahmad Mahendra, Kemal Kurniawan, David Moeljadi, Radityo Eko Prasojo, Timothy Baldwin, Jey Han Lau, Sebastian Ruder (to appear) One Country, 700+ Languages: NLP Challenges for Underrepresented Languages and Dialects in Indonesia, In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022). Han, Xudong, Timothy Baldwin and Trevor Cohn (2021) Diverse Adversaries for Mitigating Bias in Training, In Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics (EACL 2021), virtual, pp. 2760—2765. Bhatia, Shraey, Jey Han Lau and Timothy Baldwin (2021) Automatic Classification of Neutralization Techniques in the Narrative of Climate Change Scepticism, In Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics – Human Language Technologies (NAACL HLT 2021), virtual. Koto, Fajri, Jey Han Lau and Timothy Baldwin (2021) Top-down Discourse Parsing via Sequence Labelling, In Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics (EACL 2021), virtual, pp. 715-726. Google Scholar Related Wednesday, November 26, 2025 MBZUAI opens applications for first master’s and Ph.D. cohorts in computational biology The Computational Biology program is part of MBZUAI’s School of Digital Public Health, which will integrate computational… AI computational biology master's phd Computational Biology Program Read more Wednesday, November 26, 2025 How many queries does it take to break an AI? We put a number on it. MBZUAI researchers propose a universal ruler for jailbreak risk, measuring bits per query to forecast an attacker’s… research conference neurips llms paper jailbreaking queries Read more Friday, October 31, 2025 MBZUAI to demonstrate AI as a driving force in energy transformation at ADIPEC 2025 The University will discuss and demonstrate some of the AI technologies it is developing to help shape… research innovation energy robots K2 Think ADIPEC infrastructure Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 9873,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:43"
}