{
  "name": "Tim Blackwell",
  "homepage": "https://www.gold.ac.uk/computing/staff/t-blackwell",
  "status": "success",
  "content": "Dr Tim Blackwell | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Senior Lecturer Department Computing Email tim.blackwell (@gold.ac.uk) Links Websitetimblackwell.com I am interesting in all things swarming and musical. My research interests include swarm intelligence, computer music, cellular autonoma, music complexity and the multiverse Academic qualifications BSc Physics 1980 DPhil Theoretical Physics 1984 MSc Computer Science 2001 Featured publications 2002: Improvised music with swarms 2006: Multiswarms, exclusion, and anti-convergence in dynamic environments 2007: Particle Swarm Optimization: an overview 2012: A Study of Collapse in Bare Bones Particle Swarm Optimization 2018: Impact of Communication Topology in Particle Swarm Optimization Publications and research outputs Book SectionOn the Optimization of Systems Using AI Metaheuristics and Evolutionary Algorithms Tkach, Itshak; and Blackwell, Tim . 2023. On the Optimization of Systems Using AI Metaheuristics and Evolutionary Algorithms. In: Chin-Yin Huang and Sang Won Yoon, eds. Systems Collaboration and Integeration. Cham, Switzerland: Springer, pp. 253-271. ISBN 9783031443725 Correlation Between Human Aesthetic Judgement and Spatial Complexity Measure Javaheri Javid, Mohammad Ali ; Blackwell, Tim ; al-Rifaie, Mohammad Majid ; and Zimmer, Robert . 2016. Correlation Between Human Aesthetic Judgement and Spatial Complexity Measure. In: UNSPECIFIED, ed. Evolutionary and Biologically Inspired Music, Sound, Art and Design. Springer Berlin Heidelberg. Binary Tomography Reconstruction by Particle Aggregation al-Rifaie, Mohammad Majid ; and Blackwell, Tim . 2016. Binary Tomography Reconstruction by Particle Aggregation. In: UNSPECIFIED, ed. Evolutionary Computation in Image Analysis, Signal Processing and Pattern Recognition (EvoIASP). Springer Berlin Heidelberg. Show more information Spatial Complexity Measure for Characterising Cellular Automata Generated 2D Patterns Javaheri Javid, Mohammad Ali ; Blackwell, Tim ; Zimmer, Robert ; and Al-Rifaie, Mohammad Majid . 2015. Spatial Complexity Measure for Characterising Cellular Automata Generated 2D Patterns. In: UNSPECIFIED, ed. Progress in Artificial Intelligence. Springer, pp. 201-212. Resource Allocation and Dispensation Impact of Stochastic Diffusion Search on Differential Evolution Algorithm al-Rifaie, Mohammad Majid ; Bishop, Mark (J. M.) ; and Blackwell, Tim . 2012. Resource Allocation and Dispensation Impact of Stochastic Diffusion Search on Differential Evolution Algorithm. In: UNSPECIFIED, ed. Nature Inspired Cooperative Strategies for Optimization (NICSO 2011). 387 Springer Berlin Heidelberg, pp. 21-40. An Investigation Into the use of Swarm Intelligence for an Evolutionary Algorithm Optimisation al-Rifaie, Mohammad Majid ; Bishop, Mark ; and Blackwell, Tim . 2011. An Investigation Into the use of Swarm Intelligence for an Evolutionary Algorithm Optimisation. In: UNSPECIFIED, ed. International Conference on Evolutionary Computation Theory and Application (ECTA 2011). IJCCI. Social Learning and Evolution in a Structured Environment Jones, Daniel ; and Blackwell, Tim . 2011. Social Learning and Evolution in a Structured Environment. In: Tom Lenaerts; Hugues Bersini; Mario Giacobini; Paul Bourgine; Marco Dorigo and René Doursat, eds. Advances in Artificial Life, ECAL 2011 Proceedings of the Eleventh European Conference on the Synthesis and Simulation of Living Systems. Massachusetts: MIT Press, pp. 380-387. ISBN 978-0-262-29714-1 A Sound You Can Touch, Generative Arts Practice Blackwell, Tim ; and Jefferies, Janis K. . 2005. A Sound You Can Touch, Generative Arts Practice. In: UNSPECIFIED, ed. Art work shown at Beta space, Powerhouse Museum. Sydney, Australia: , pp. 125-133 Tech-tiles: Exploring Texture Blackwell, Tim ; and Jefferies, Janis K. . 2005. Tech-tiles: Exploring Texture. In: UNSPECIFIED, ed. Creativity & Cognition: Proceedings 2005, 12-15 April, Goldsmiths' College, London. London: Creativity and Cognition Studios, pp. 248-252. ISBN 978-1595930255 ArticleImpact of communication topology in particle swarm optimization Blackwell, Tim ; and Kennedy, James. 2019. Impact of communication topology in particle swarm optimization. IEEE Transactions on Evolutionary Computation, 23(4), pp. 689-702. ISSN 1089-778X Information-Theoretic Measures Predict the Human Judgment of Rhythm Complexity de Fleurian, Remi ; Blackwell, Tim ; Ben-Tal, Oded; and Müllensiefen, Daniel . 2017. Information-Theoretic Measures Predict the Human Judgment of Rhythm Complexity. Cognitive Science, 41(3), pp. 800-813. ISSN 0364-0213 Reduced projection angles for binary tomography with particle aggregation al-Rifaie, Mohammad Majid ; and Blackwell, Tim . 2016. Reduced projection angles for binary tomography with particle aggregation. Evolutionary Intelligence, 9(3), pp. 67-79. ISSN 1864-5909 Show more information Correlation Between Human Aesthetic Judgement and Spatial Complexity Measure Javaheri Javid, Mohammed Ali; Blackwell, Tim ; Zimmer, Robert ; and al-Rifaie, Mohammad Majid . 2016. Correlation Between Human Aesthetic Judgement and Spatial Complexity Measure. Lecture Notes in Computer Science, 9596, pp. 79-91. ISSN 0302-9743 Binary Tomography Reconstruction by Particle Aggregation Blackwell, Tim ; and al-Rifaie, Mohammad Majid . 2016. Binary Tomography Reconstruction by Particle Aggregation. Lecture Notes in Computer Science, 9597, pp. 754-769. ISSN 0302-9743 Analysis of information gain and Kolmogorov complexity for structural evaluation of cellular automata configurations Javaheri Javid, Mohammad Ali ; Blackwell, Tim ; Zimmer, Robert ; and al-Rifaie, Mohammad Majid . 2016. Analysis of information gain and Kolmogorov complexity for structural evaluation of cellular automata configurations. Connection Science, 28(2), pp. 155-170. ISSN 0954-0091 Cognitive Bare Bones Particle Swarm Optimisation with Jumps al-Rifaie, Mohammad Majid ; and Blackwell, Tim . 2016. Cognitive Bare Bones Particle Swarm Optimisation with Jumps. International Journal of Swarm Intelligence Research (IJSIR), 7(1), pp. 1-31. Cognitive Bare Bones Particle Swarm Optimisation with Jumps Blackwell, Tim ; and al-Rifaie, Mohammad Majid . 2016. Cognitive Bare Bones Particle Swarm Optimisation with Jumps. International Journal of Swarm Intelligence Research, 7(1), pp. 1-31. ISSN 1947-9263 Spatial Complexity Measure for Characterising Cellular Automata Generated 2D Patterns Javaheri Javid, Mohammad Ali ; Blackwell, Tim ; Zimmer, Robert ; and al-Rifaie, Mohammad Majid . 2015. Spatial Complexity Measure for Characterising Cellular Automata Generated 2D Patterns. Progress in Artificial Intelligence: 17th Portuguese Conference on Artificial Intelligence, EPIA 2015, Coimbra, Portugal, September 8-11, 2015. Proceedings, pp. 210-212. Information gain measure for structural discrimination of cellular automata configurations Blackwell, Tim . 2015. Information gain measure for structural discrimination of cellular automata configurations. Computer Science and Electronic Engineering Conference (CEEC), 2015 7th, pp. 47-52. Comparing Perceptual and Computational Complexity for Short Rhythmic Patterns Blackwell, Tim ; and Müllensiefen, Daniel . 2014. Comparing Perceptual and Computational Complexity for Short Rhythmic Patterns. Procedia - Social and Behavioral Sciences, 126, pp. 111-112. ISSN 1877-0428 Congestion Control in Wireless Sensor Networks based on Bird Flocking Behaviour Antoniou, Pavlos; Pitsillides, Andreas; Blackwell, Tim ; Engelbrecht, Andries; and Michael, Loizos. 2013. Congestion Control in Wireless Sensor Networks based on Bird Flocking Behaviour. Computer Networks, 57(5), pp. 1167-1191. ISSN 1389-1286 Resource Allocation and Dispensation Impact of Stochastic Diffusion Search on Differential Evolution Algorithm al-Rifaie, Mohammad Majid ; Bishop, Mark (J. M.) ; and Blackwell, Tim . 2012. Resource Allocation and Dispensation Impact of Stochastic Diffusion Search on Differential Evolution Algorithm. Nature Inspired Cooperative Strategies for Optimisation, Studies in Computational Intelligence, 387, pp. 21-40. ISSN 1860-949X Information sharing impact of stochastic diffusion search on differential evolution algorithm al-Rifaie, Mohammad Majid ; Bishop, Mark (J. M.) ; and Blackwell, Tim . 2012. Information sharing impact of stochastic diffusion search on differential evolution algorithm. Memetic Computing, 4(4), pp. 327-338. ISSN 1865-9284 A Study of Collapse in Bare Bones Particle Swarm Optimization Blackwell, Tim . 2011. A Study of Collapse in Bare Bones Particle Swarm Optimization. IEEE Transactions on Evolutionary Computation, 16(3), pp. 354-372. ISSN 1089-778X An Investigation Into the use of Swarm Intelligence for an Evolutionary Algorithm Optimisation; The Optimisation Performance of Differential Evolution Algorithm Coupled with Stochastic Diffusion Search al-Rifaie, Mohammad Majid ; Bishop, Mark (J. M.) ; and Blackwell, Tim . 2011. An Investigation Into the use of Swarm Intelligence for an Evolutionary Algorithm Optimisation; The Optimisation Performance of Differential Evolution Algorithm Coupled with Stochastic Diffusion Search. International Conference on Evolutionary Computation Theory and Application (ECTA 2011)(3), pp. 1-6. An Investigation into the Merger of Stochastic Diffusion Search and Particle Swarm Optimisation al-Rifaie, Mohammad Majid ; Bishop, Mark (J. M.) ; and Blackwell, Tim . 2011. An Investigation into the Merger of Stochastic Diffusion Search and Particle Swarm Optimisation. GECCO-2011: Proceedings of the 13th Annual Conference on Genetic and Evolutionary Computation, pp. 37-44. A Simplified Recombinant PSO Bratton, Daniel ; and Blackwell, Tim . 2008. A Simplified Recombinant PSO. Journal of Artificial Evolution and Applications, 2008, pp. 1-10. ISSN 1687-6229 Examination of Particle Tails Blackwell, Tim ; and Bratton, Daniel . 2008. Examination of Particle Tails. Journal of Artificial",
  "content_length": 14840,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:47"
}