{
  "name": "Tim Beißbarth",
  "homepage": "http://bioinformatics.umg.eu",
  "status": "success",
  "content": "Medical Bioinformatics | University Medical Center Göttingen (UMG) JavaScript scheint in Ihrem Browser deaktiviert zu sein. Sie müssen JavaScript in Ihrem Browser aktivieren um alle Funktionen der Seite nutzen zu können. Department of Medical Bioinformatics at the University Medical Center Göttingen Dear visitors, welcome to the homepage of the Department of Medical Bioinformatics at the University Medical Center Göttingen. The research focus of the department is on methods in Medical Bioinformatics and applications in Systems Medicine. We aim to develop methods to statistically analyze and understand especially high-dimensional data sets coming from biomedical research and applications.Especially, genomics, transcriptomics, proteomics and other omics as well as the integrative analysis and meaningful interpretation of such different data types pose major challenges for method development, where the methods have to be tailored towards the specific applications. We therefore apply methods from the area of machine learning as well as statistical computing.Like our research, our teaching in bioinformatics is focused on methods for high-throughput data analysis and interpretation. We teach a wide range of students from different fields such as in medicine, biology, biochemistry, molecular medicine, applied statistics, computer sciences and data science.On our homepage you can find more information about our research activities, our research groups, publications, teaching activities and ressources and services we provide. If you have any questions feel free to contact us.Best regards, Prof. Dr. rer. nat. Tim Beißbarth and the Medical Bioinformatics team. News from the Department of Medical Bioinformatics Current PhD PositionsThe Department of Medical Bioinformatics participates in the search for PhD candidates as part of the International Max Planck Research School for Genome Science (IMPRS-GS). Open PositionProf. Dr. Kerstin Lenhof (Group AI and Omics Data) is looking for an intern, student research assistant, or master’s thesis candidateNew Group: AI and Multi Omics DataWe welcome Prof. Dr. Kerstin Lenhof as new member and group leader in our departmentChemoinformatics and Imaging: New publicationPlasma Lipidomic Patterns Associated with Disease Activity in Chronic Inflammatory Demyelinating Polyradiculoneuropathy (LIPID-CIDP). Journal of Lipid Research 2025, 100903. Brinke, K. A. D.; Borsch, L.-M.; Klose, C.; Zschüntzsch, J.; Vinhoven, L.; Nietert, M.; Justus Lattau, S. S.; Fitzner, D. https://doi.org/10.1016/j.jlr.2025.100903.New publication about Onkopus framework for interpretation of genetic variants:Nadine S Kurz, Kevin Kornrumpf, Tim Tucholski, Klara Drofenik, Alexander König, Tim Beißbarth, Jürgen Dönitz: Onkopus: precise interpretation and prioritization of sequence variants for biomedical research and precision medicine Nucleic Acids Research, 2025;, gkaf376, https://doi.org/10.1093/nar/gkaf376Conference \"Prevention of eoCRC\"As part of our research project PerMiCCion, the Beißbarth research group participated in the scientific conference “Prevention of eoCRC 2025,” held in Lübeck from March 24 to 26, 2025.New Project: PANDAOur new project PANDA: Personalized ANalysis for Drug Activity in Pancreatic Cancer is funded by the BMBF and starts in October 2024. This project aims to analyze existing drug screening data from pancreatic cancer cell lines to identify personalized treatment strategies for patientsNew Project: Resolve-PCCIn cooperation with Prof. Dr. rer. nat. Markus Scholz from the University of Leipzig, Institute for Medical Informatics, Statistics and Epidemiology, and Partners, our ne project Resolve, funded by the BMBF, will begin in January 2025.New Project: TRR 274 Checkpoints of Central Nervous RecoveryIn the second funding period we are joining the TRR274 research consortium (Munich and Göttingen), which aims to comprehend and investigate the biology of the intricate mechanisms that determine recovery after a CNS injury.Medical Data Science: New PublicationSpatial Cellular Networks from omics data with SpaCeNet Schrod S, Lück N, Lohmayer R, Solbrig S, Völkl D, Wipfler T, Shutta KH, Ben Guebila M, Schäfer A, Beißbarth T, Zacharias HU, Oefner P, Quackenbush J, Altenbuchinger M Genome Res. 2024 SepChemoinformatics and Imaging: New publicationDynamic Brain Lipid Profiles Modulate Microglial Lipid Droplet Accumulation and Inflammation Under Ischemic Conditions in Mice. Wei W, Lattau SSJ, Xin W, Pan Y, Tatenhorst L, Zhang L, Graf I, Kuang Y, Zheng X, Hao Z, Popa-Wagner A, Gerner ST, Huber S, Nietert M, Klose C, Kilic E, Hermann DM, Bähr M, Huttner HB, Liu H, Fitzner D, Doeppner TR.Medical Data Science: New PublicationTitle: Human leukocyte antigen (HLA) class I expression on Hodgkin-Reed-Sternberg cells is an EBV-independent major determinant of microenvironment composition in classic Hodgkin lymphoma. Authors: Müller-Meinhard B, Seifert N, Grund J, Reinke S, Yalcin F, Kaul H, Borchmann S, von Tresckow B, Borchmann P, Plütschow A, Richter J, Engert A, Altenbuchinger M, Bröckelmann PJ, Klapper W. In: Hemasphere. 2024 Jun 3;8(6):e84. doi: 10.1002/hem3.84. PMID: 38836098; PMCID: PMC11145947.Chemoinformatics and Imaging: New publicationRenal tumor segmentation, visualization, and segmentation confidence using ensembles of neural networks in patients undergoing surgical resection. Bachanek S, Wuerzberg P, Biggemann L, Janssen TY, Nietert M, Lotz J, Zeuschner P, Maßmann A, Uhlig A, Uhlig J.Knowledge Management: New Publication Title: SeqCAT: Sequence Conversion and Analysis Toolbox. Authors: Kornrumpf K, Kurz NS, Drofenik K, Krauß L, Schneider C, Koch R, Beißbarth T, Dönitz J. In: Nucleic Acids Res. 2024 May 27:gkae422. doi: 10.1093/nar/gkae422. PMID: 38801081.Mukoviszidose: Better diagnostics for rare hereditary diseaseEuropean joint project \"Stracyfic\" to improve the diagnosis of the rare hereditary disease cystic fibrosis started on 1 June 2023. The three-year research project led by the University Medical Centre Göttingen (UMG) is being funded with more than 1.3 million euros. The Federal Ministry of Health is providing partial funding of 300,000 euros for research at the UMG. The most important contact details at a glance Phone : +49 (0)551 - 39 61781Mail: office@bioinf.med.uni-goettingen.de Follow us",
  "content_length": 6333,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:45"
}