{
  "name": "Tim Dwyer",
  "homepage": "https://research.monash.edu/en/persons/tim-dwyer",
  "status": "success",
  "content": "Tim Dwyer - Monash University Tim Dwyer public CV View Scopus Profile Tim Dwyer Professor Professor, Department of Human Centred Computing https://orcid.org/0000-0002-9076-9571 EmailTim.Dwyermonashedu 1997 …2025 Research activity per year Personal profile Research interestsPlease see my research homepage. My research concerns many different aspects of Information Visualisation and Visual Analytics. In other words, I am interested in visual interfaces for the exploration and communication of data. An area of key interest for me is network visualization, which I believe has a critical role to play in helping people to understand complex, interlinked data. Network visualisation is already widely used in disciplines like software engineering, biology and social network analysis; however, I believe it can play a greater role in many other areas of our lives if we can present complex information to people in an understandable and engaging way. Much of my work has focused on the problem of finding high-quality layout for network diagrams. To create such diagrams automatically, we must compute positions for nodes and paths for links that are both readable and aesthetically pleasing. This computation is a significant optimisation challenge that tests the limits of current technologies. I am also interested in the development of novel representations of data and all aspects of interaction design for data exploration. Another aspect of my research is the exploration of how we can effectively use emerging display technologies—such as large interactive surfaces and augmented and virtual reality—to help people perform data analysis. We are bringing data \"out of computers and into the world around us\". We call this research initiative Immersive Analytics.BiographyI received my PhD on \"Two and a Half Dimensional Visualisation of Relational Networks\" from the University of Sydney in 2005. I was a post-doctoral Research Fellow at Monash University from 2005 to 2008, then a Visiting Researcher at Microsoft Research, USA in 2008-2009. From 2009 to 2012 I worked as a Senior Software Development Engineer with the Visual Studio product group at Microsoft, USA. A highlight of this period was shipping the Code Map software dependency visualisation tool with Visual Studio 2012. In late 2012 I returned to Monash University as a Larkins Fellow where I now lead the Immersive Analytics Lab.Monash teaching commitmentDr Tim Dwyer has experience as the Chief Examiner for the following units in the Faculty of IT: FIT2102 - Programming paradigms FIT3020 - Information Visualisation FIT2079 - Data Visualisation FIT2071 - Foundations of C++ Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, University of SydneyAward Date: 1 Jun 2005Computer Science, Bachelor of Computer Science Honours, University of MelbourneAward Date: 1 Mar 2001Science, Bachelor of Science, University of MelbourneAward Date: 1 Jul 1995 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2007 2014 2017 2029 1 Not started 2 Active 18 Finished Projects per year Next Gen: Augmented Human OperationsChinthammit, W. (Primary Chief Investigator (PCI)), Billinghurst, M. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Cordeil, M. (Chief Investigator (CI)), Bai, Q. (Chief Investigator (CI)), Raimondo, T. (Chief Investigator (CI)), Kang, B. (Chief Investigator (CI)), Herbert, N. (Chief Investigator (CI)), Sambrooks, L. (Chief Investigator (CI)), Knibbe, J. (Associate Investigator (AI)), Dobbins, C. (Associate Investigator (AI)), Lee, G. A. (Associate Investigator (AI)), Cunningham, A. (Associate Investigator (AI)) & Chiera, B. (Associate Investigator (AI))7/08/24 → 30/06/29Project: Research Building 4.0 CRC: Better buildings, new efficiencies through technology and collaborationAitchison, M. (Primary Chief Investigator (PCI)), Ngo, T. D. (Chief Investigator (CI)), Maxwell, D. (Chief Investigator (CI)), Couper, R. (Chief Investigator (CI)), Breen Lovett, S. (Chief Investigator (CI)), Cumarasamy, S. (Project Manager), Blue, K. (Project Manager), Laverty, C. (Project Manager), Gerber, P. (Chief Investigator (CI)), Merkoulova, Y. (Chief Investigator (CI)), Sohal, A. (Chief Investigator (CI)), Dare, R. (Chief Investigator (CI)), Moehler, R. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Grundy, J. (Chief Investigator (CI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), McCormack, J. (Chief Investigator (CI)), Vu, L. H. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Murray, S. (Chief Investigator (CI)), Kulic, D. (Chief Investigator (CI)), Bai, Y. (Chief Investigator (CI)), Davies, C. (Chief Investigator (CI)), Zhou, J. (Chief Investigator (CI)), Duffield, C. (Chief Investigator (CI)), Singh, P. J. (Chief Investigator (CI)), Bridge, A. (Chief Investigator (CI)), Erol, I. (Chief Investigator (CI)), Drogemuller, R. (Chief Investigator (CI)) & Mahendran, M. (Chief Investigator (CI))10/09/20 → 30/06/27Project: Research Immersive Analytics - Extension (Data61 CRP 31)Marriott, K. (Primary Chief Investigator (PCI)), Dwyer, T. (Chief Investigator (CI)), Jenny, B. (Chief Investigator (CI)), Cordeil, M. (Chief Investigator (CI)), Engelke, U. (Partner Investigator (PI)), Nguyen, H. (Partner Investigator (PI)), Watkins, D. (Partner Investigator (PI)), Chen, H. (Partner Investigator (PI)) & Knight, K. (Project Manager)Project: Research Real-time EH&S Intervention to Improve Site Safety (Scoping Study) Delir Haghighi, P. (Primary Chief Investigator (PCI)), Ens, B. (Primary Chief Investigator (PCI)), Dwyer, T. (Chief Investigator (CI)), Tag, B. (Chief Investigator (CI)), Wang, T. (Chief Investigator (CI)) & Rezatofighi, H. (Chief Investigator (CI))15/03/23 → 30/06/25Project: Research Paul Ramsay Foundation: Tracking media and parliamentary narratives around cycles of disadvantage in AustraliaWebb, G. (Primary Chief Investigator (PCI)), Angus, S. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Smith, L. (Chief Investigator (CI)), Bragge, P. (Chief Investigator (CI)), Batstone, J. (Chief Investigator (CI)) & Shareghi Nojehdeh, E. (Chief Investigator (CI))29/09/22 → 30/08/23Project: Research View all 21 projects Research output Research output per year 1997 2017 2018 2019 2021 2022 2023 2025 76 Conference Paper 55 Article 5 Chapter (Book) 5 Editorial 8 More 3 Foreword / Postscript 2 Commissioned Report 2 Comment / Debate 1 Review Article Research output per year Research output per year AlphaPIG: The Nicest Way to Prolong Interactive Gestures in Extended RealityLi, Y., Fischer, F., Dwyer, T., Ens, B., Crowther, R., Kristensson, P. O. & Tag, B., 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Lee, B., Chetty, M. & Toups-Dugas, P. (eds.). New York NY USA: Association for Computing Machinery (ACM), 14 p. 627Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) Embedding Human Values in the Design of Mixed-Reality TechnologiesLi, M., Alshehri, T., Dwyer, T., Goodwin, S. & Evans, J., May 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 5, p. 2374-2383 10 p.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) Precise Embodied Data Selection with Haptic Feedback while Retaining Room-Scale Visualisation ContextDai, S., Li, Y., Ens, B., Besancon, L. & Dwyer, T., 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 1, p. 602-612 11 p.Research output: Contribution to journal › Article › Research › peer-review The Presenter in the Browser: Design and Evaluation of Human Interactive Overlays with Web ContentCordeil, M., Servais, A., Truong, G., Dwyer, T., Vyas, D. & Hurter, C., 27 Jan 2025, In: Multimodal Technologies and Interaction. 9, 2, 18 p., 10.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) AR-Facilitated Safety Inspection and Fall Hazard Detection on Construction SitesLiu, J., Rao, A. S., Ke, F., Dwyer, T., Tag, B. & Haghighi, P. D., 2024, Proceedings - 2024 IEEE International Symposium on Mixed and Augmented Reality, ISMAR-Adjunct 2024. Eck, U., Sra, M., Stefanucci, J., Sugimoto, M., Tatzgern, M. & Williams, I. (eds.). IEEE, Institute of Electrical and Electronics Engineers, p. 12-14 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 2 Citations (Scopus) View all 149 research outputs Prizes IEEE InfoVis 2015 best paper awardKieffer, S. A. (Recipient), Dwyer, T. (Recipient), Marriott, K. (Recipient) & Wybrow, M. (Recipient), 2015Prize: Prize (including medals and awards) IEEE InfoVis Best Paper Honorable Mention AwardYang, Y. (Recipient), Dwyer, T. (Recipient), Goodwin, S. (Recipient) & Marriott, K. (Recipient), 2016Prize: Prize (including medals and awards) Activities Activities per year 2014 2014 2016 2023 2023 2 Contribution to conference 2 Patents Activities per year IEEE VisualizationGoodwin, S. (Organiser), Dwyer, T. (Organiser) & Wybrow, M. (Organiser)Oct 2023Activity: Participating in or organising an event types › Contribution to conference IEEE Visualization and Visual Analytics (VIS) 2023Dwyer, T. (Organiser), Goodwin, S. (Organiser) & Wybrow, M. (Or",
  "content_length": 10786,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:47"
}