{
  "name": "Tim Landgraf",
  "homepage": "https://www.mi.fu-berlin.de/inf/groups/ag-ki/members/Professoren/Tim_Landgraf.html",
  "status": "success",
  "content": "Prof. Dr. Tim Landgraf • Dahlem Center for Machine Learning and Robotics • Fachbereich Mathematik und Informatik Springe direkt zu Inhalt Fachbereich Mathematik und Informatik/Informatik/Dahlem Center for Machine Learning and Robotics PfadnavigationStartseiteInformatikArbeitsgruppenDahlem Center for Machine Learning and RoboticsMembersProfessorenProf. Dr. Tim LandgrafProf. Dr. Tim Landgraf KontaktLehreForschungPublikationenDahlem Center for Machine Learning and RoboticsInstitut für InformatikFachbereich Mathematik und InformatikProfessorAdresseArnimallee 7Raum 11114195 BerlinTelefon+49 30 838 75114Fax+49 30 838 465301E-Mailtim.landgraf@fu-berlin.deHomepageDahlem Center for Machine Learning & RoboticsSommersemester 2024 Softwareprojekt Continual Learning Softwareprojekt Open Hardware Forschungsseminar Artificial and Collective Intelligence Wintersemester 2023/2024 VL/Ü Self-Supervised Learning Seminar/Proseminar: Multi-Agent Reinforcement Learning Forschungsseminar Artificial and Collective Intelligence Sommersemester 2023 Seminar Unsupervised Learning Softwareprojekt Überwachtes und Unüberwachtes Lernen in der Verhaltensforschung Forschungsseminar Artificial and Collective Intelligence Wintersemester 2022/2023 Sabbatical / Forschungssemester Sommersemester 2022 Softwareprojekt Überwachtes und Unüberwachtes Lernen in der Verhaltensforschung Forschungsseminar Artificial and Collective Intelligence Wintersemester 2021/2022 VL/Ü Computer Vision Forschungsseminar Artificial and Collective Intelligence Sommersenester 2021 Softwareprojekt Überwachstes und unüberwachtes Lernen in der Verhaltensforschung Forschungsseminar Artificial and Collective Intelligence Wintersemester 2020/2021 VL/Ü Mustererkennung Forschungsseminar: Artificial and Collective Intelligence Sommersemester 2020 Softwareprojekt Überwachtes und unüberwachtes Lernen in der Verhaltensforschung Forschungsseminar: Artificial and Collective Intelligence Wintersemester 2019/2020 VL/Ü Computer Vision Forschungsseminar: Artificial and Collective Intelligence Sommersemester 2019 VL/Ü Deep Learning Softwareprojekt: Überwachtes und unüberwachtes Lernen in der Verhaltensforschung Forschungsseminar: Artificial and Collective Intelligence Wintersemester 2018/2019 VL/Ü Mustererkennung Forschungsseminar Artificial and Collective Intelligence Sommersemester 2018 Softwareprojekt Kollektive Intelligenz in autonomen Fahrzeugen Forschungsseminar Artificial and Collective Intelligence Wintersemester 2017/2018 VL/Ü Computer Vision Deep Learning und Monte-Carlo-Methoden für das Brettspiel Go Forschungsseminar Artificial and Collective Intelligence Sommersemester 2017 Softwareprojekt Data Science Forschungsseminar Artificial and Collective Intelligence Wintersemester 2016/2017 Computervision Forschungsseminar: Artificial and Collective Intelligence Sommersemester 2016 Bildverarbeitung (Ü) Softwareprojekt Data Science Wintersemester 2015/2016 Computervision (VL/Ü) Sommersemester 2015 Wissenschaftskommunikation Seminar Künstliche Intelligenz - Biorobotik Softwareprojekt: Algorithmen der Computer-Vision: Automatische Feature-Extraktion Wintersemester 2014/2015 Softwareprojekt Bildverarbeitung in der Verhaltensbiologie Betriebssysteme Forschungsseminar Intelligente Systeme und Robotik Sommersemester 2014 Mimicry, Spoofing and a new way of thinking about Biology and Robotics Leiter und Gründer des  Biorobotik-Labs. Siehe auch Robots Communicating with Fish H2020 - Hiveopolis RoboFish: Gemischte Schwärme lebender Fische und interaktiver Roboter für die Analyse des kollektiven Verhaltens von Fischen (abgelaufen) Robotik in der Neurobiologie: Ziele finden mit einem winzigen Gehirn. Die neuronalen Grundlagen der Navigation (abgelaufen) siehe  ResearchGate  und  GoogleScholarFür eine optimale Darstellung dieser Seite aktivieren Sie bitte JavaScript. DatesZur Anzeige dieser Inhalte wird JavaScript benötigt.Übersicht NewsZur Anzeige dieser Inhalte wird JavaScript benötigt.Übersicht",
  "content_length": 3978,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:51"
}