{
  "name": "Tim Storer",
  "homepage": "http://www.dcs.gla.ac.uk/~tws",
  "status": "success",
  "content": "Tim Storer I am a Senior Lecturer in Software Engineering at the School of Computing Science, University of Glasgow, where I lead the Systems Engineering Group. Contact Information School of Computing Science University of Glasgow Sir Alwyn Williams Building Lilybank Gardens Glasgow G12 8QQ SCOTLAND Tel: 0141 330 4970 email timothy.storer@glasgow.ac.uk Research Interests I have research interests broadly in system, software and security engineering. Specifically: Modelling and simulation of large scale, complex, heterogeneous socio-technical systems. Applying principles, methods and tools from agile software engineering to security and digital investigation processes. Integrating agile and safety critical software engineering processes. Methods and tools for supporting software engineering practices in scientific programming development efforts. Data mining and linking software team project repositories. I'm particularly keen to work with external partners in industry and encourage my students to do so as well. I find software engineering research is best informed by the needs and challenges experienced by practitioners. Research Papers Robbie Simpson and Tim Storer. Experimenting with Realism in Software Engineering Team Projects: An Experience Report. The 30th IEEE Conference on Software Engineering Education and Training, Savannah, Georgia, 87-96, November, 2017. George Grispos, William B. Glisson, and Tim Storer. Enhancing security incident response follow-up efforts with lightweight agile retrospectives. Digital Investigation, 22, 62-73, 2017. Tim Storer. Bridging the Chasm: A Survey of Software Engineering Practice in Scientific Programming. ACM Computing Surveys, 50, 4, 47:1-47:32, 2017. William B. Glisson, Tim Storer, Andrew Blyth, George Grispos, and Matt Campbell. In-the-Wild Residual Data Research and Privacy. Journal of Digital Forensics, Security and Law, 11, 1, 77-91, 2016. George Grispos, William B. Glisson, and Tim Storer. Security Incident Response Criteria: A Practitioner's Perspective. 20th Conference on Advanced Information Systems, Puerto Rico, August, 2015. Robbie Simpson and Tim Storer. Formalising responsibility modelling for automatic analysis. EOMAS 2015 11th International Workshop on Enterprise & Organizational Modeling And Simulation, 2015. George Grispos, William B. Glisson, and Tim Storer. Recovering Residual Forensic Data from Smartphone Interactions with Cloud Storage Providers. The Cloud Security Ecosystem: Technical, Legal, Business and Management Issues, 347-382, 2015. George Grispos, William B. Glisson, and Tim Storer. Rethinking Security Incident Response: The Integration of Agile Principles. 20th Americas Conference on Information Systems (AMCIS 2014), Savannah, Georgia, Usa, August, 2014. Stephen Marsh, Natasha Dwyer, Anirban Basu, Tim Storer, Karen Renaud, Khalil El-Khatib, Babak Esfandiari, Sylvie Nöel, and Mehmet V. Bicakci. Foreground Trust as a Security Paradigm: Turning Users into Strong Links. Information Security in Diverse Computing Environments, 2014. William B. Glisson and Tim Storer. Investigating Information Security Risks of Mobile Device Use Within Organizations. 19th American Conference on Information Systems, Chicago, Us, Paper 18, August, 2013. Tim Storer, Stephen Marsh, Sylvie Nöel, Babak Esfandiari, Khalil El-Khatib, Pam Briggs, Karen Renaud, and Mehmet V. Bicakci. Encouraging Second Thoughts: Obstructive User Interfaces for Raising Security Awareness. Proceedings of the Eleventh Annual Conference on Privacy, Security and Trust, Tarragona, Catalonia, Spain., July, 2013. George Grispos, William B. Glisson, and Tim Storer. Cloud security challenges: investigating policies, standards, and guidelines in a Fortune 500 organization. 21st European Conference on Information Systems, University Of Utrecht, Utrecht, The Netherlands, Paper 29., June, 2013. Heather Crawford, Karen Renaud, and Tim Storer. A Framework for Continuous, Transparent Mobile Device Authentication. Computers & Security, 39, 127-136, 2013. William B. Glisson, Tim Storer, and Joe Buchanan-Wollaston. An empirical comparison of results from mobile forensic toolkits in the wild. Digital Investigation, 10, 1, 44-55, 2013. Joe Buchanan-Wollaston, Tim Storer, and William B. Glisson. Comparison of the Data Recovery Function of Forensic Tools. Advances in Digital Forensics IX: : Ninth Annual IFIP WG 11.9 International Conference on Digital Forensics), 331-347, 2013. George Grispos, William B. Glisson, and Tim Storer. Using Smartphones as a Proxy for Forensic Evidence contained in Cloud Storage Services. 46th Hawaii International Conference on System Sciences, HICSS 2013, Wailea, Hi, Usa, 4910-4919, January, 2013. Stefan Raue, Chris W. Johnson, and Tim Storer. (SMA) - A Social Media Audience Sharing Model for Authorities to Support Effective Crisis Communication. Proceedings of the 7th IET Conference on Systems Safety and CyberSecurity, Edinburgh, Scotland, October, 2012. George Grispos, Tim Storer, and William B. Glisson. Calm before the Storm: The Emerging Challenges of Cloud Computing in Digital Forensics. International Journal of Crime and Digital Forensics, 4, 2, 28-48, 2012. Tim Storer, William B. Glisson, and Karen Renaud. Patterns of Information Security Postures in Large Scale Socio-Technical Systems. Cyberpatterns 2012. The First International Workshop on Cyber Patterns: Unifying Design Patterns with Security, Attack and Forensic Patterns, Abingdon, Oxfordshire, Uk., 30-34, July, 2012. Ian Sommerville, Russell Lock, and Tim Storer. Information Requirements for Enterprise Systems. 17Monterey Workshop, 266-282, March, 2012. Stephen Marsh, Sylvie Nöel, Tim Storer, Yao Wang, Pam Briggs, Lewis Robart, John Stewart, Babak Esfandiari, Khalil El-Khatib, Mehmet V. Bicakci, Manh C. Dao, Michael Cohen, and Daniel D. Silva. Non-Standards for Trust: Foreground Trust and Second Thoughts for Mobile Security. Security and Trust Management 7th International Workshop, STM 2011, Revised Selected Papers, Copenhagen, Denmark, 28-39, 2012. George Grispos, Tim Storer, and William B. Glisson. A Comparison of Forensic Evidence Recovery Techniques for a Windows Mobile Smart Phone. Digital Investigation, 8, 1, 23-36, 2011. William B. Glisson, Tim Storer, Gavin Mayall, Iain Moug, and George Grispos. Electronic Retention: What does your mobile phone reveal about you?. International Journal of Information Security, 10, 6, 337-349, 2011. Russell Lock, Tim Storer, and Ian Sommerville. Responsibility Modelling for Risk Analysis. Proceedings of European SREL (ESREL) 2009, Prague, Czech Republic, 1103-1109, September, 2009. Ian Sommerville, Russell Lock, Tim Storer, and John Dobson. Deriving Information Requirements from Responsibility Models. Advanced Information Systems Engineering, 21st International Conference, CAiSE 2009, Amsterdam, Netherlands, 515-529, June, 2009. Tim Storer and Russell Lock. Accuracy: The Fundamental Requirement for Voting Systems. Proceedings of the The Third International Conference on Availability, Reliability and Security, ARES 2008, Fukuoka, Japan, 374-379, March, 2009. Ian Sommerville, Tim Storer, and Russell Lock. Responsibility Modelling for Civil Emergency Planning. Risk Management, 11, 3-4, 179-207, 2009. Linda Little, Tim Storer, Pam Briggs, and Ishbel Duncan. E-Voting in a Ubicomp World: Trust, Privacy, and Social Implications. Social Science Computer Review, 26, 1, 44-59, 2008. Russell Lock, Tim Storer, Natalie Harvey, Conrad Hughes, and Ian Sommerville. Observations of the Scottish elections 2007. Transforming Government: People, Process and Policy, 2, 2, 104-118, 2008. Russell Lock, Tim Storer, Natalie Harvey, Conrad Hughes, and Ian Sommerville. Observations of the Scottish Elections 2007. eGov 2007, Third e-Government Workshop, Leeds, Uk, September, 2007. Tim Storer and Ishbel Duncan. 3D Animation of Java Program Execution for Teaching Object Oriented Concepts. Proceedings of the Seventh IASTED International Conference on Visualisation, Imaging and Image Processing, Palma De Mallorca, Spain, 76-81, August, 2007. Colin Allison, Tim Storer, Stuart Purdie, and Rosa Michelson. An Evaluation Framework for Grid-based Learning Technologies. Proceedings of the The 7th IEEE International Conference on Advanced Learning Technologies, Niigata, Japan, July, 2007. Ian Sommerville, Tim Storer, and Russell Lock. Responsibility Modelling for Contingency Planning. Workshop on Understanding Why Systems Fail, Contingency Planning and Longer Term Perspectives on Learning from Failure in Safety Critical Systems, June, 2007. Tim Storer, Linda Little, and Ishbel Duncan. An exploratory study of Voter Attitudes towards a Pollsterless Remote Voting System. IaVoSS Workshop on Trustworthy Elections (WOTE 06) Pre-Proceedings, Robinson College, University Of Cambridge, England, 77-86, June, 2006. Ishbel Duncan and Tim Storer. Agent Testing in an Ambient World. Pervasive 2006 Workshop Proceedings, Dublin, Eire, 757-764, May, 2006. Tim Storer and Ishbel Duncan. Electronic Voting in the UK: Current Trends in Deployment, Requirements and Technologies. Proceedings of the Third Annual Conference on Privacy, Security and Trust, St Andrews, New Brunswick, Canada., 249-252, October, 2005. Tim Storer and Ishbel Duncan. Two Variations of the mCESG Pollsterless e-Voting Scheme. COMPSAC 05 The 29th Annual International Computer Software & Applications Conference, Edinburgh, Scotland, 425-430, July, 2005. Tim Storer and Ishbel Duncan. Practical Remote Electronic Elections for the UK. Privacy, Security and Trust 2004 Proceedings of the Second Annual Conference on Privacy, Security and Trust, Fredericton, New Brunswick, Canada, 41-45, October, 2004. Tim Storer and Ishbel Duncan. Polsterless Remote Electronic Voting. Journal of E-Government, 1, 1, 75-103, 2004. Tim Storer and Ishbel Duncan. Modelling Context for the Design of Remote Electronic Voting Schemes. IADIS International Conference e-Society 2004, Avila, Spain., 1001-1",
  "content_length": 11998,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:57"
}