{
  "name": "Tim Fernando",
  "homepage": "https://www.scss.tcd.ie/Tim.Fernando",
  "status": "success",
  "content": "Tim Fernando School of Computer Science and Statistics, Trinity College Dublin Tim Fernando No Word Attachments E-mail: Tim.Fernando at tcd.ie Telephone: +353 1 896 3800 (353=Ireland, 1=Dublin, 896=Trinity, 3800=college extension) Postal address: Tim Fernando, Computer Science Dept, Trinity College, Dublin 2, Ireland Office: ORI LG 17 (ORI=O'Reilly Institute, LG=lower ground floor) Status: Lecturer Qualifications: BS, PhD (here's my CV in PDF) Research Areas: Natural language semantics and Knowledge representation Research Group: Computational Linguistics Group (CLG) Papers on-line (since arriving in Dublin, October 1999) Finite automata as multimodal semantic representations, probably Formal Linguistic Approaches to MultiModality, Dublin, Dec 2025 ( 2 page abstract, poster) Between min cost search and least action, Theorem Proving and Machine Learning in the age of LLMs: SoA and Future Perspectives, Edinburgh, April 2025 (2 page abstract, poster, slides for 10 minute talk) Triadic temporal representations and deformations, NALOMA IV (Natural Logic meets Machine Learning), Nancy, June 2023 (slides) (ACL anthology) Action signatures and finite-state variations, AREA II (Annotation, Recognition and Evaluation of Actions), ESSLLI 2022 Workshop, August 2022 Strings from neurons to language, NALOMA III (Natural Logic meets Machine Learning), ESSLLI 2022 Workshop, August 8-12 2022 (ACL anthology) String iconicity and granularity, 22nd Amsterdam Colloquium, Dec 2019, pages 122--131 Corrigendum: in page 123, t+ should be t* (slides) MSO with tests and reducts, with David Woods, Carl Vogel, FSMNLP 2019, Dresden, Sep 2019 (slides, 2 per page) Pictorial narratives and temporal refinement, SALT 2019, UCLA, May 2019 (3-min talk, poster) Projecting temporal properties, events and actions, IWCS 2019, Gothenburg, May 2019 (slides, 2 per page) Prior probabilities of Allen interval relations over finite orders, with Carl Vogel, NLP in AI 2019, Prague, February 2019 (slides, 2 per page) Finite-state Methods Featuring Semantics, Tokens of Meaning: Papers in Honor of Lauri Karttunen (C. Condoravdi and T.H. King, eds.), pages 527-544, CSLI Publications, Stanford, 2019, ISBN (Paperback): 1-68400-048-3 (9781684000487) Temporal representations with and without points, in Logic and Algorithms in Computational Linguistics 2018 (R. Loukanova ed.), Springer Studies in Computational Intelligence Vol 860, pages 45-66, 2020. DOI (supersedes Intervals and events with and without points, Symposium on Logic and Algorithms in Computational Linguistics 2018, Stockholm, August 2018, slides) Predications, fast and slow, Commonsense-2017, London, November 2017 (slides, 2 per page) Intensions, types and finite-state truth-making, Modern Perspectives in Type-Theoretical Semantics, 223--243, 2017 On regular languages over power sets (Journal of Language Modelling 4(1):29--56, 2016) Negation and events as truthmakers, 20th Amsterdam Colloquium, 2015, pages 109--118 (slides) The semantics of tense and aspect: a finite-state perspective, In S. Lappin and C. Fox (eds.), The Handbook of Contemporary Semantic Theory, Second edition, Wiley, 2015, pages 203--236 Types from frames as finite automata, 20th Formal Grammar (Barcelona), August 2015, pages 18--38 (LNCS 9804, 2016, pp 19--40) (slides) Two perspectives on changes and institutions, workshop on Formal Ontologies for AI, July 2015 (slides) Prior and temporal sequences for natural language, Synthese 193(11):3625--3637, 2016 (doi:10.1007/s11229-015-0902-2, presented at the Arthur Prior Centenary, August 2014, slides) Incremental semantic scales by strings, TTNLS, Gothenburg, 2014, pages 63--71 (ACL Archive, slides) Partitions representing change homogeneously, A festschrift for Jeroen Groenendijk, Martin Stokhof, and Frank Veltman, 2013 (pages 91--95) Dowty's aspect hypothesis segmented, Amsterdam Colloquium 2013 (pages 107--114, slides) Segmenting temporal intervals for tense and aspect, MOL 2013, Sofia, pages 30--40 (ACL Archive) Finite state methods and description logics, FSMNLP 2013, St Andrews, pages 63--71 (ACL Archive) A finite-state temporal ontology and event-intervals, FSMNLP 2012, Donostia/San Sebastian, pages 80--89 (ACL Archive) Compositionality in discourse from a logical perspective, Chapter 13 (pages 279--304), The Oxford Handbook of Compositionality, 2012 Editorial Preface (Ruth Kempson, Tim Fernando and Nicholas Asher), Handbook of Philosophy of Linguistics, 2012 Steedman's temporality proposal and finite automata, Amsterdam Colloquium 2011, LNCS 7218, pages 301-310, 2012 (Earlier version presented in the Amsterdam Colloquium, December 2011) Strings over intervals, Proceedings of TextInfer 2011, Workshop on Textual Entailment, EMNLP 2011, pages 50--58, Edinburgh, July 30, 2011 (ACL Archive) Finite-state representations embodying temporal relations, 9th International Workshop on Finite State Methods and Natural Language Processing, pages 12--20, Blois, 2011 (ACL Archive) Regular relations for temporal propositions (Natural Language Engineering 17(2): 163--184, 2011) Constructing situations and time (J. Philosophical Logic 40(3):371--396, 2011) Temporal propositions as vague predicates (M. Aloni et al. eds., Amsterdam Colloquium 2009, Springer LNAI 6042, pages 143-152, 2010) Situations as indices and as denotations (Linguistics and Philosophy 32(2):185--206, 2009) Situations in LTL as strings (Information and Computation 207(10): 980--999, 2009) Situations from events to proofs (in Meaning, Intentions, and Argumentation, edited by K. Korta and J. Garmendia, CSLI Lecture Notes Number 186, pages 113--129, 2008) Branching from inertia worlds (Journal of Semantics 25(3):321--344, 2008) Temporal propositions as regular languages (Finite-State Methods and Natural Language Processing, 6th International Workshop, Potsdam, pages 132--148, Universitaetsverlag Potsdam 2008) Observing events and situations in time (Linguistics and Philosophy 30(5):527--550, October 2007) Representing events and discourse: comments on Hamm, Kamp and van Lambalgen (pre-final copy; Theoretical Linguistics, 32(1), 2006, pages 57--64) Finite-state temporal projection (CIAA 2006, LNCS 4094, Springer, 2006, pages 230--241) Situations as strings (for WoLLIC 2006, Electronic Notes in Theoretical Computer Science Volume 165 , 22 November 2006, Pages 23--36) Comic relief for anankastic conditionals (Proceedings 15th Amsterdam Colloquium, pages 71--76) Events from temporal logic to regular languages with branching (for FG-MOL 2005) Entailments in finite-state temporality, with Rowan Nairn (for IWCS-6; comments welcome) + related work by Lauri Karttunen on the Yale Shooting Problem Compositionality inductively, co-inductively and contextually (in The Compositionality of Meaning and Content, edited by M. Werning, E. Machery, G. Schurz. Volume 1: Foundational Issues, pages 87--96, 2005) Inertia in temporal modification (SALT 14, Northwestern University, pages 56--73, 2004) Reichenbach's E, R and S in a finite-state setting (Sinn und Bedeutung 2003, Frankfurt, pages 111--122; supersedes `The progressive and perfect in pieces', presented at ESSLLI 03, Workshop on Conditional and Unconditional Modality, Vienna) Schedules in a temporal interpretation of modals (J. Semantics 22:211--229, 2005; supersedes `Between events and worlds under historical necessity') Finite-state descriptions for temporal semantics (to appear Computing Meaning, Volume 3, Kluwer; supersedes paper with the same title in the proceedings of IWCS-5, Tilburg, January 2003) A finite-state approach to events in natural language semantics (J. Logic and Computation 14(1):79--92, 2004; extends section 2 of my TIME-02 paper below) Corrigendum: add \"intersected with Sigma\" to the end of Proposition 5, noted by Rowan Nairn A finite-state approach to event semantics (Proc. 9th International Symp on Temporal Representation and Reasoning, TIME-02, Manchester, IEEE Computer Society Press, 2002, pages 124-131) Conservative generalized quantifiers and presupposition (Semantics and Linguistic Theory XI, NYU/Cornell, 2001, pages 172-191) Three processes in natural language interpretation (In Reflections on the Foundations of Mathematics: Essays in Honor of Solomon Feferman, W. Sieg, R. Sommer and C. Talcott, eds., Association for Symbolic Logic, LNiL 15, Natick, Massachusetts, 2002, pages 208-227) Towards a many-dimensional modal logic for semantic processing (In Advances in Modal Logic, Volume 3, World Scientific, Singapore, 2002, pages 139-151) A type reduction from proof-conditional to dynamic semantics (J. Philosophical Logic 30(2):121-153, 2001) Ambiguous discourse in a compositional context (J. Logic, Language and Information 10(1):63-86, 2001) Six papers before 2000 Ambiguous propositions typed (Proc. Ninth European Association for Computational Linguistics, Bergen, 1999) Labeled representations, underspecification and disambiguation, with Nicholas Asher (Computing Meaning, Kluwer, 1999) In conjunction with qualitative probability (Annals of Pure and Applied Logic 92(3):217-234, 1998) Ambiguity under changing contexts (Linguistics and Philosophy 20(6):575-606, 1997) Expecting many, with Hans Kamp (Semantics and Linguistic Theory VI, Rutgers/Cornell, 1996, pages 53-68) Bisimulations and predicate logic (J. Symbolic Logic 59(3):924-944, 1994) Some meetings ESSLLI XXIX (July 2017, Toulouse), Predication via Finite-State Methods ESSLLI XXVII (August 2015, Barcelona), Finite-state methods for sub-atomic semantics Workshop on Natural Language Metaphysics (12-14 April 2011, Dublin) Formal Semantics Workshop (6-8 July 2010, Westport) ESSLLI XVII (August 2005, Edinburgh) Natural Language Semantic Representations as Types: course webpage Language under Uncertainty: Modals, Evidentials, and Conditionals (21-23 January 2005, Kyoto University), my hand-out North American Summer School in Logic, Language and Information (21 - 25 June 2004, UCLA), my course New Aspects of Compositionality, ",
  "content_length": 10609,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:48"
}