{
  "name": "Timothy W. Bickmore",
  "homepage": "http://www.ccs.neu.edu/home/bickmore",
  "status": "success",
  "content": "Timothy W. Bickmore Timothy Bickmore, Ph.D. Professor Khoury College of Computer Sciences Northeastern University 360 Huntington Avenue Boston, Massachusetts 02115 Office: EXP 770B My office is in a secured area. If you are visiting, please contact me in advance to meet you in a public space. Rules and Regulations for EXP Building (617) 373-5477 email:t.bickmore at northeastern.edu Research Overview I'm interested in the development and study of Relational Agents, which are computer agents designed to build and maintain long-term, social-emotional relationships with people. In order to use the same myriad cues that people use when relating to each other, I build agents that are capable of emulating face-to-face interaction with people, including the use of hand gestures, facial expressions, and body posture, in addition to speech. These agents are particularly effective for tasks in which long-term interactions and personal relationships are known to be important, such as in education, sales and marketing, and the helping professions. Of these, I have focused my recent work within the healthcare domain on health education and health behavior change applications. In order to accomplish this, I conduct communication studies of health provider-patient interactions, develop new approaches to dialogue planning that can address both the behavioral intervention and social aspects of the interactions, and develop animated agents that can use appropriate nonverbal behavior in their simulated conversations with patients, as well as conduct clinical trials to evaluate the efficacy of the resulting systems. Lab: Relational Agents Group Current Research Projects Recent Publications photo Glenn Kulbako Curriculum Vitae Older Publications Courses IS2000 Principles of Information Science (F2018) IS4800/CS6350 Empirical Research Methods (S2018) IS4300 Human-Computer Interaction (F2016) More recent courses in Canvas. Other Stuff AAAI Fall '04 Symposium on Dialogue Systems for Health Communication AAAI Fall '05 Symposium on Caring Machine: AI in Eldercare AAAI Spring '06 Symposium on Argumentation for Consumers of Healthcare SBM'11 Course on Towards Standardization and Reuse in Behavioral Informatics IVA'14 Fourteenth International Conference on Intelligent Virtual Agents",
  "content_length": 2293,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:08"
}