{
  "name": "Timo Kehrer",
  "homepage": "https://www.informatik.hu-berlin.de/de/forschung/gebiete/mse",
  "status": "success",
  "content": "Modellgetriebene Software EntwicklungMehr KontrastWeniger Kontrast Direkt zum InhaltDirekt zur SucheDirekt zur Navigation Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Modellgetriebene Software Entwicklung Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Modellgetriebene Software Entwicklung Navigation « Dezember 2025 » month-12 Mo Di Mi Do Fr Sa So 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 1 2 3 4 Termine Promotionsvortrag: Niklas Giesa 01.12.2025 Disputation: Frau Parmida Geranmayeh, M.Sc. 10.12.2025 Disputation: Herr Pascal Sebastian Kunz, M.Sc. 12.12.2025 Promotionsvortrag Fabian Lehmann 18.12.2025 Termine - More… Impressum Humboldt-Universität zu Berlin - Mathematisch-Naturwissenschaftliche Fakultät - Modellgetriebene Software Entwicklung Prof. Dr. Timo Kehrer Willkommen am Lehr- und Forschungsgebiet für Modellgetriebene Softwareentwicklung Modellbildung ist ein Mittel zur Abstraktion auf nahezu allen Gebieten der Informatik. In der Softwaretechnik spielen Modelle eine zunehmend zentrale Rolle, um die stetig wachsende Komplexität softwareintensiver Systeme zu beherrschen. Modellgetriebene Softwareentwicklung, also die Generierung von Teilen eines Systems aus Modellen, hat sich für eingebettete Systeme und einige andere Domänen bereits teilweise etabliert. Das Paradigma stellt ferner einen vielversprechenden Ansatz für die Entwicklung und den Betrieb zukünftiger Cyber-physischer Systeme in einer digital vernetzten Welt dar, für die mit einem weiteren exponentiellen Anstieg der Komplexität zu rechnen ist. Modellgetriebene Entwicklung löst jedoch nicht alle softwaretechnischen Herausforderungen, tatsächlich werden auch neue geschaffen, welche durch den Lehrstuhl für Modellgetriebene Softwareentwicklung in Lehre und Forschung adressiert werden. News Timo Kehrer, Thomas Thüm, Alexander Schultheiß, and Paul Maximilian Bittner published a paper in which they present their ongoing research project VariantSync at the International Conference for Software Engineering 2021 (ICSE 2021). You can find a video of the corresponding ICSE talk on Youtube. Timo Kehrer is program co-chair of the 13th International Conference on Graph Transformation (ICGT 2020), taking place in June 2020 in Bergen, Norway. Please consider to submit your research paper until February 2020. Timo Kehrer is program comittee member of the ToCaMS 2020 Workshop on Testing of Configurable and Multi-variant Systems, which is being held in conjunction with ICST 2020, from 23rd to 27th March 2020 in Porto, Portugal. Please consider to submit your research paper until 12th January 2020. Timo Kehrer is programme committee member of the 14th International Working Conference on Variability Modelling of Software-Intensive Systems (VaMoS 2020), taking place in February 2020 in Magdeburg, Germany. Timo Kehrer is co-organizing the International Workshop on Software Engineering for Science, held in conjunction with ICSE 2019 in Montreal, Canada. Please consider to submit your research paper, see Call for Papers. The workshop aims, amongst others, to bring communities together to discuss issues of common interest, to identify key subjects which have a lack of existing data or studies and to support the building of a common research agenda to address the complex software development issues typical of research software. Timo Kehrer is programme committee member of the 34th IEEE/ACM Conference on Automated Software Engineering (ASE 2019), taking place in Nov. 2019 in San Diego, California, United States. Please consider to submit your paper to the premier research forum for automated software engineering, s. Call for Research Papers. Die 16. Humboldt Informatik GONG SHOW (HIGS'19): Es ist wieder soweit, der diesjährige Tag der Informatik (TdI) wird am 02. Mai 2019 stattfinden und eine Gong-Show ist fest eingeplant. Weitere Informationen hier. Timo Kehrer is programme committee member of the 23rd International Systems and Software Product Line Conference (SPLC 2019), taking place in Sept. 2019 in Paris, France. Please consider to submit your paper to the premier forum in the area of software and system product lines, s. Call for Research Papers. The DFG (German Research Foundation) has accepted the research proposal \"VariantSync: Automating the Synchronization of Software Variants (2019-2022)\". The research project will be led by Prof. Kehrer in collaboration with Dr. Thomas Thüm from Technical University of Braunschweig. Timo Kehrer is co-organizing the Challenge Track at the 23rd International Systems and Software Product Line Conference (SPLC 2019), taking place in Sept. 2019 in Paris, France. The track is now seeking your interesting challenge descriptions, s. Call for Challenge Cases. Timo Kehrer is co-organizing the Dagstuhl Seminar 19191: Software Evolution in Time and Space - Unifying Version and Variability Management, taking place in May 2019. Timo Kehrer is co-organizing the HU-KCL Workshop on Search-Based Model Engineering, taking place in London from 7th-9th of August 2018. Die 15. Humboldt Informatik GONG SHOW (HIGS'18): Es ist wieder soweit, der diesjährige Tag der Informatik (TdI) wird am 14. Juni 2018 stattfinden und eine Gong-Show ist fest eingeplant. Weitere Informationen hier. See all DE EN Mehr KontrastMehr Kontrast Weniger KontrastWeniger Kontrast Humboldt-Universität zu Berlin Institut für Informatik Rudower Chaussee 25 12489 Berlin-Adlershof Die Humboldt-Universität bei Facebook Die Humboldt-Universität bei BlueSky Die Humboldt-Universität bei Instagram Die Humboldt-Universität bei YouTube Die Humboldt-Universität bei LinkedIn Die RSS-Feeds der Humboldt-Universität Seite bearbeiten Barrierefreiheit Datenschutz Impressum",
  "content_length": 5778,
  "method": "requests",
  "crawl_time": "2025-12-01 14:38:59"
}