{
  "name": "Timothy M. Jones 0001",
  "homepage": "https://www.cl.cam.ac.uk/~tmj32",
  "status": "success",
  "content": "Department of Computer Science and Technology: Timothy M. Jones Skip to content | Access key help Search Advanced searchA–ZContact us Department of Computer Science and Technology Computer LaboratoryComputer Architecture GroupTimothy M. Jones Timothy M. Jones I'm Professor of Computer Architecture and Compilation at the University of Cambridge Department of Computer Science and Technology (The Computer Laboratory) and Fellow and Director of Studies for Computer Science at Gonville and Caius college. My research focuses on extracting the many different forms of parallelism from applications to increase performance and address energy-efficiency and reliability challenges within compilers, binary translators and microarchitectures. Current strands of work consider novel ways of prefetching data into caches, contemporary schemes for extracting thread-level parallelism and advanced prediction within the core, amongst others. I'm Director of the Computer Architecture and Semiconductor Design Centre (CASCADE). We're performing ground-breaking research that addresses some of the grand challenges in computer architecture, design automation and semiconductors. I am a Fellow of the IET, organiser of the REACH conference and program co-chair of CGO 2026. I have an Erdős Number of 4, apparently. PhD positions for 2026: I'm currently accepting applicants to start a PhD with me in October 2026 and will likely take on one or two students. Consider applying through CASCADE to meet the challenges we've posed for future microprocessors and systems. Please see my notes on PhD applications as well as my research overview for the areas that I'm interested in. Research Overview Research Group Code and Data Style Guide Blog Professional Service CASCADE PhD Applications Caius students' information Part II, Part III & ACS projects Undergraduate Applications at Caius Publications MASCOT memory-dependence prediction (HPCA2025) Scalar Vector Runahead (MICRO 2024) OptiWISE profiling (CGO 2024) Decoupled Vector Runahead (MICRO 2023) MineSweeper: Temporal Memory Safety (ASPLOS 2022) Contact Background, Outreach, Other © 2025 Computer Laboratory, University of CambridgeInformation provided by Timothy M. Jones",
  "content_length": 2215,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:04"
}