{
  "name": "Timothy J. Norman",
  "homepage": "https://www.ecs.soton.ac.uk/people/tjn1f15",
  "status": "success",
  "content": "Professor Tim Norman | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Tim Norman Head of School Research interests Learning and reasoning under uncertainty AI safety Human-AI collaboration More research Accepting applications from PhD students. Connect with Tim Email: T.J.Norman@soton.ac.uk Tel: +44 23 8059 7681 ORCID On this page About Research Publications Biography About Research Publications Biography About I am an expert in Artificial Intelligence with a 30-year publication track record in core AI and Data Science venues. Throughout my career, my research has been strongly interdisciplinary and informed by practical problems where innovations in core AI methods may have significant impact. The first EPSRC award I received, for example, enabled a colleague and me to organise the Symposium on Argument and Computation held in Pitlochry, Perthshire in July 2000. This week-long event involved experts from across the world in computer science, law, linguistics, philosophy, and classics with interests in argumentation. This was the first time that these disparate disciplines were brought together, and the event and resulting publication (Reed & Norman (2003), “Argumentation Machines”, Springer) helped forge a new interdisciplinary area of research. I have held at least one externally funded research grant or contract each year since 1999 with total actual (non FeC) funding approx. £27M awarded to the institution at which I was working at the time. Highlights include: PI of the DoD/MoD funded Network and Information Sciences International Technology Alliance (NIS ITA) (£2.9M), a programme highlighted by the Obama Whitehouse in a press release; the UKRI dot.rual Digital Economy Research Hub (£11.8M) (three Hubs funded in the UK) as one of a core cross-disciplinary team of four initiating and leading the project; and PI of the UKRI MINDS Centre for Doctoral Training (£5.82M) one of 16 interdisciplinary centres for research training in Artificial Intelligence established as part of UK strategy. In addition to leading underpinning research, I have led work to develop non-academic impact. The Collaborative Intelligence Spaces (CISpaces) toolkit, which was developed and evaluated with professional analysts in the US and UK (see Toniolo et al. (2023) “Human-machine collaboration in intelligence analysis: An expert evaluation”) has influenced the development of the UK Single Intelligence Environment, the UK’s initiative to enable better decision making across Government. The same thread of research is continuing to have impact, again through interdisciplinary collaboration, but with experts in politics at Southampton, local and regional government, and charities in the development of democratic innovations. Research Research groups Member of: Agents, Interaction and Complexity Centre for Democratic Futures Centre for Robotics Research interests Learning and reasoning under uncertainty AI safety Human-AI collaboration Reinforcement learning Research projects Active projects UKRI Centre for Doctoral Training in Machine Intelligence for Nano-electronic Devices and Systems Researchers: Professor Tim Norman Professor Stuart Middleton , Professor Harold Chong , Professor Rob Maunder , Doctor Bahar Rastegari , Doctor Reena Pau , Professor Dimitra Georgiadou , Doctor Christine Evers Completed projects Rebooting Democracy: Democratic Innovation for the Information Age Researchers: Professor Matt Ryan Professor Tim Norman Gendered body language and speech styles in UK Parliament using machine learning Researchers: Doctor Rafael Mestre , Doctor Jessica Smith Professor Stuart Middleton , Professor Matt Ryan , Professor Tim Norman Publications Client-master multiagent deep reinforcement learning for task offloading in mobile edge computing Tesfay Zemuy Gebrekidan, Sebastian Stein & Tim Norman, 2025, ACM Transactions on Autonomous and Adaptive Systems DOI: 10.1145/3768579 Type: article HAVA: hybrid approach to value-alignment through reward weighing for reinforcement learning Kryspin Varys, Federico Cerutti, Adam Sobey & Tim Norman, 2024 Type: conference Speaking your language: spatial relationships in interpretable emergent communication Olaf Lipinski, Adam Sobey, Federico Cerutti & Tim Norman, 2024 Type: conference Source detection and tracking for underwater distributed acoustic sensing Konstantinos Theofilos Drylerakis, Mohammad Belal, Rafael Mestre, Timothy J. Norman & Christine Evers, 2024 DOI: 10.23919/EUSIPCO63174.2024.10715378 Type: conference Explaining an agent’s future beliefs through temporally decomposing future reward estimators Mark Towers, Yali Du, Chris Freeman & Tim Norman, 2024 DOI: 10.3233/FAIA240814 Type: conference Multi-trainer binary feedback interactive reinforcement learning Zhaori Guo, Timothy J. Norman & Enrico H. Gerding, 2024, Annals of Mathematics and Artificial Intelligence DOI: 10.1007/s10472-024-09956-4 Type: article Temporal explanations for deep reinforcement learning agents Mark Towers, Yali Du, Chris Freeman & Tim Norman, 2024 DOI: 10.1007/978-3-031-70074-3_6 Type: conference Ethical alignment in citizen-centric AI Jayati Deshmukh, Vahid Yazdanpanah, Sebastian Stein & Timothy Norman, 2024 Type: conference Combinatorial client-master multiagent deep reinforcement learning for task offloading in mobile edge computing: extended abstract Tesfay Zemuy Gebrekidan, Sebastian Stein & Tim Norman, 2024 Type: conference Deep reinforcement learning with coalition action selection for online combinatorial resource allocation with arbitrary action space Tesfay Zemuy Gebrekidan, Sebastian Stein & Timothy J. Norman, 2024 Type: conference Biography Having read Electronic and Electrical Engineering at the University of Wales, Swansea, I moved disciplines to Computer Science graduating with a PhD in Artificial Intelligence from University College London in 1997. After postdoctoral research I spent 17 years at the University of Aberdeen and was promoted to Professor in 2009. Following long-term research collaborations with colleagues in Electronics and Computer Science (ECS), I joined the University of Southampton in 2016. I am currently Head of ECS, a thriving school with a strong collaborative and interdisciplinary research culture that provides an excellent environment for high-quality research. I am also Director of the UKRI MINDS Centre for Doctoral Training (CDT), working with colleagues to deliver on our vision, building the CDT community and helping develop exceptional young researchers. My research expertise is in multi-agent systems, specifically in the development of novel methods for learning and reasoning under uncertainty, enabling us to develop safe and trustworthy autonomous systems that work effectively with people. Prizes Best Abstract Spotlight (2021) Blue Sky Ideas Award (Special Mention) at the 20th International Conference on Autonomous Agents and Multiagent Systems (AAMAS-2021) (2021) Best Abstract Spotlight (2021) Blue Sky Ideas Award (Special Mention) at the 20th International Conference on Autonomous Agents and Multiagent Systems (AAMAS-2021) (2021) Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students ",
  "content_length": 30891,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:08"
}