{
  "name": "Timothy A. Gonsalves",
  "homepage": "http://www.cse.iitm.ac.in/~tag",
  "status": "success",
  "content": "Timothy A. Gonsalves's Homepage Timothy A. Gonsalves Professor Ph.D., Stanford, 1986 M.S., Rice, Houston, 1979 B.Tech., IIT, Madras, 1976 Interests: Design and performance of computer and telecom networks. With emphasis on innovative and low-cost product and technology development for Indian and international industry. Fostering software development in small towns and rural areas. Selected Publications: (Recent Publications First) A. Ramasamy, Hema A. Murthy & T.A. Gonsalves \"Linear Prediction for Traffic Management and Fault Detection\" Proc. Int'l. Conf. Info. Tech., Bhuvaneshwar, Dec. 2000, 4 pp. D. Venkatesulu & T.A. Gonsalves \"On the Performance of Distributed Objects\" Jour. Systems Architecture, Elsevier Science, (46) 5 (2000), pp.411-428. T.A. Gonsalves, Ashok JhunJhunwala, Hema A. Murthy, et al. \"CygNet: An Integrated Management for Modern Telecom Networks\" Proc. NCC-2000 Nat'l. Conf. Commun., Jan. 2000. E. Elwin Stelzer & T.A. Gonsalves \"Embedding RMON in Large LAN Switches\" IEEE Network, vol. 13, no. 1, Jan./Feb. 99, pp. 63-72. D. Venkatesulu & T.A. Gonsalves \"Efficient Fault-tolerant Reliable Broadcast in a Multi-switch Extended LAN\" Computer Communications, vol. 22, no. 3, 25 Feb. 99, pp. 266-278. A. Jhunjhunwala, B. Ramamurthi & T.A. Gonsalves \"The Role of Technology in Telecom Expansion in India\" IEEE Communications Mag., vol. 36, no. 11, Nov. 98, pp. 88-94. B. Sain & T.A. Gonsalves \"KeRTESy: A Real-Time Event-driven Microkernel\" Dr. Dobb's Jour., Mar. 97, pp. 48--58. S. Mahesh, C. Sivaram Murthy, T.A. Gonsalves & C. Pandurangan \"Modeling and Simulation of Dynamic Job Scheduling in Multiprocessor Systems\" Int'l. J. Comp. Maths, v 58, 1995, pp. 221--247. A. Jhunjhunwala, M. Archana Rao, B. Murugesh, T.A. Gonsalves, & B. Ramamurthi \"A Reliable Fibre-Optic Ring Network for Process Control\" Int'l J. Optoelectronics, v 8, n 4, 93, pp. 477--491. T.A. Gonsalves \"High-Speed Transport Protocols: Design and Implementation Issues\" Jour. IETE, v 39, n 2, May--June 93, pp.99--109. T.A. Gonsalves & F.A. Tobagi \"Comparative Performance of Voice/Data Local Area Networks\" IEEE J. Selected Areas Commun., v 7, n 5, Jun. 89, pp. 657--669.",
  "content_length": 2169,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:00"
}