{
  "name": "Timothy M. Hospedales",
  "homepage": "http://homepages.inf.ed.ac.uk/thospeda",
  "status": "success",
  "content": "Timothy M. Hospedales Dr. T. Hospedales Home About Publications Research Group Code & Datasets Teaching Vacancies Professor Timothy Hospedales Professor of Artificial Intelligence Institute of Perception, Action and Behaviour School of Informatics The University of Edinburgh t.hospedales at ed.ac.uk VP AI, Head of Samsung AI Research Europe Fellow, IEEE I am a Professor within IPAB in the School of Informatics at the University of Edinburgh, where I head the Machine Intelligence Research group; ELLIS fellow; and Head of Centre, Samsung AI Research Centre, Cambridge where I also direct the Machine Learning & Data Intelligence Programme. Previously I was Alan Turing Institute Fellow, Reader ('16-'20) at Edinburgh and Senior Lecturer/Lecturer ('12-16) at QMUL within the Risk and Information Management (RIM) group and Centre for Intelligent Sensing, where I founded the Applied Machine Learning Lab. I recieved my PhD in Neuroinformatics from Edinburgh in 2008, working with Sethu Vijayakumar in the Statistical Machine Learning and Motor Control group, and my BA in Computer Science from the University of Cambridge in 2002. My research focuses on efficient and robust AI using techniques such as meta-learning and lifelong transfer-learning, in both probabilistic and deep learning contexts. I have looked at a variety of application areas including computer vision, vision and language, reinforcement learning for robot control, finance and beyond. News 10/2017: Program co-chair of BMVC2018! 02/2018: Nine papers accepted at CVPR'18! 07/2018: Our Meta Learning Active Learning paper awarded Best Paper Prize at ICML AutoML'18! 08/2018: Congratulations Kunkun Pang! Dynamic Ensemble Active Learning wins Best Student Paper Award @ ICPR2018! 06/2019: Congratulations Carl Allen! Analogies Explained paper wins Honorable Mention @ ICML'19! 08/2019: TuckER model for fast and effective knowledge graph completion accepted at EMNLP2019! 12/2019: Joining T-PAMI as AE! 02/2020: Four papers at CVPR'20! 04/2020: Check out our new Survey on meta-learning! 07/2020: Four papers in ECCV'20! 08/2020: Promoted to Full Professor. 09/2020: Paper in Siggraph Asia 2020! 09/2020: Paper on online meta-RL in NeurIPS'20! 02/2021: Our MetaQDA achieves 3rd place in AAAI Meta-Learning competition. 02/2021: Four papers at CVPR'21! 07/2021: Associate Program Co-Chair of AAAI'22! 11/2021: Tim recognised as an ELLIS fellow. 12/2021: Our PMF places second in NeurIPS Meta-learning competition! 01/2022: Three papers in ICLR'22! 04/2022: Check out our new book, Visual Adaptation in the Deep Learning Era! 05/2022: Check out our SPM tutorial on self-supervision! 01/2023: Five papers at ICLR'23! 07/2023: New multi-task meta-learning benchmark at CVPR23: Meta-Omnium. 09/2023: Best Paper Prize at AutoML'23! Congratulations Linus and Da! 08/2016: Co-chairing BMVA symposium on Transfer Learning in Computer Vision 09/2016: Guest Editor - IET CV - Special Issue on Deep Learning for Computer Vision 10/2016: Keynote on transfer learning with paramaterised tasks and domains at ECCV 2016 TASK-CV workshop! 10/2016: Giving the zero-shot learning part of ACM Multimedia '16 tutorial Emerging topics in learning from noisy and missing data. 10/2017: Program co-chair of BMVC 2018 11/2017: Hiring one 3.5yr Postdoc on Machine Learning for Robotics & AI. Closing date: 14th Dec 2017. Advert. Apply. 03/2018: Keynote at Vision & Language Conference. 03/2018: Talk on sanity guarantees for deep learning at Deep Learning in Finance Summit London 2018. 09/2018: Hiring a postdoc research associate on deep learning, 2.5yr post, international applicants welcome. Closing date 4th October 2018. Apply. 05/2019: Teaching the Advanced Topics in Deep Learning Summer School, May 2019 in Verona. 05/2020: Keynote @ DIRA workshop in CVPR2020 08/2020: Tutorial on Domain Adaptation @ ECCV2020 09/2020: Open positions for PhD and Postdoc researchers. 10/2020: Check out our Special Issue on Learning with Fewer Labels in IEEE PAMI. 12/2020: Invited Talk at the Meta Learning Workshop in NeurIPS-20 02/2021: Co-organizing learning-to-learn workshop at ICLR-21! Submission deadline Feb 26. 02/2021: Co-organizing learning-to-learn workshop at ICRA-21! 01/2022: Talk at IBM Neuro-symbolic AI workshop 2022. 10/2022: Seminar on meta-learning at Deep Learn 2022 Summer School. 12/2022: Co-organizing Domain Generalisation Workshop at ICLR23. 06/2023: Keynote at IbPRIA 2023. 12/2024: Keynote at ICPR 2024. Sample code for active learning & discovery (PAKDD'11,TKDE'11,ECCV'12) Unsegmented sports news dataset available (ICDM'11). Includes reference extracted STIP features and ground-truth multi-label annotation. Sample code for MCTM (ICCV'09, IJCV'11) and WSJTM (ACCV'10, PAMI'11) Attribute Dataset for Heterogeneous Face Recognition (ACCV'14) Code and Data for BMVC04 Fine-grained SBIR paper. 02/2015: Code for the famous ELF descriptor in re-id. First ever public release! 06/2015: Ground-truth Anomaly Annotation for ICCV'09 and IJCV'11 papers. 07/2015: Code for Sketch-a-Net BMVC'15 paper. 09/2015: Code for our ICLR'15 Multi-Task/Multi-domain paper 09/2015: Multi-camera video surveillance dataset from our TCSVT'15 paper 03/2016: 800K image+social metadata dataset from our ACM DH'16 paper 05/2017: LIMA dataset for re-id and tracking at CVPR'17 01/2018: Demo code CVPR'18 learning to compare few-shot learning 07/2018: Neural Decision tree Example Code. 05/2019: Hypernetwork KB Completion Code. 05/2019: Tucker Decomposition Link Prediction Code. 06/2021: How Well do Self-Supervised models Transfer? Code. 12/2021: Meta Channel Coding. A new benchmark for meta-learning! 04/2022: P>M>F: State of the art Few-Shot Learning Code. 09/2022: Meta-audio blog and code. Check if your meta-learner works outside of computer vision! 07/2023: Meta-Omnium multi-task meta-learning benchmark. Publications Visit my Google Scholar Profile. Date Topic 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 Meta Learning Lifelong and Transfer Learning Zero-Shot Learning Learning for Robotics and Control Finance Active Learning Visual Attribute Learning Deep Learning Machine Learning Zero-shot learning, Vision and Language Sketches Computer Vision Neuroscience Research Group Senior Members Dr. Yongxin Yang Machine Learning, Finance Dr. Henry Gouk Reliable Machine Learning, ML Theory Dr. Da Li Meta-Learning, Domain Generalisation PhD Students Raman Dutt (CDT) Medical Image Analysis, Cross-Domain Yongshuo Zhong (CDT) Multi-view self-supervision Ruchika Chavhan Multi-Task Meta-Learning Ondrej Bohdal (CDT) Meta-Learning, Data Distillation, Cross-Domain Linus Ericsson (CDT) Meta-Learning, Self-Supervised Learning Panagiotis Eustratiadis Reinforcement Learning, Adversarial Robustness Boyan Gao Unsupervised Deep Learning, Meta-Learning Visitors Yinbing Tian Few-shot regression. PhD Students, Co-supervisor Taha Kocyigit Multi-View Learning. With Hakan Bilen. Calum Heggan Meta-learning. Anomaly detection. Postdocs, Alum Ryan Layne Person Re-identification, Transfer Learning Dr. Chenyang Zhao Lifelong learning for Robotics and Control Kunkun Pang Active Learning & Perception PhD Students, Graduated Carl Allen (2017-21) Theoretical Analysis of Embedding Models → ETH Yongxin Yang (2013-17) Lifelong Learning, Deep Learning → Postdoc @ Edinburgh → Faculty @ Surrey → Faculty @ QMUL Ivana Balazevic (2017-21) Knowledgebases, Link Prediction → Deep Mind Tanmoy Mukherjee (2015-20) Vision & Language, Semantic Embeddings → Postdoc at University of Cambridge Kunkun Pang (2015-19) Active Perception, Active Learning → Postdoc at University of Edinburgh Marija Jegorova (2016-20) Generative Adversarial Networks → Postdoc at University of Edinburgh → FAIR Chenyang Zhao (2015-19) Lifelong learning for Robotics and Control → Postdoc at Edinburgh Xueting Zhang (2017-21) Few Shot, Continual Learning Miguel Jaques (2018-21) Physics Informed Deep Networks Yanwei Fu Transfer Learning, Zero-shot Learning, Attributes, Learning to Rank → Faculty at Fudan University, PRC Ryan Layne Person Re-identification, Attributes Yun Zhou Transfer Learning in Bayesian Networks → Goldsmiths \t→ Faculty at NUDT, PRC Zhiyuan (Patrick) Shi Weakly Supervised Learning, Attributes → Imperial College London (Alex) Xun Xu Action Recognition, Transfer Learning→ National University of Singapore Conghui Hu Cross-domain, Sketches, Face Recognition. With Yi-Zhe Song. Past Visitors Gabriel B. P. Costa Structured Video Analysis, Generative Adversarial Nets Jia Jieru Person Identification Yuting Qiang Generative, Graphical Models in Vision Yiying Li Domain Generalisation. Deep RL. Teaching Classes 2018/19: Semester A Introduction to Vision and Robotics, Image and Vision Computing 2017/18: Semester A Introduction to Vision and Robotics, Image and Vision Computing 2016/17: Semester B Inf1 - Object Oriented Programming 2015/16: Semester A Data Mining, Machine Learning, Procedural Programming 2014/15: Semester A Data Mining, Procedural Programming 2014/15: Semester B Java (BUPT) 2013/14: Semester A Data Mining 2013/14: Semester B Semantic Web 2012/13: Semester A Information Systems 2012/13: Semester B Semantic Web",
  "content_length": 9207,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:06"
}