{
  "name": "Timothy B. Brecht",
  "homepage": "https://cs.uwaterloo.ca/~brecht",
  "status": "success",
  "content": "Tim Brecht Home Publications Supervision Committtees Teaching Projects Biography Artifacts Directions Partners Opportunities Tips & Misc. Tim Brecht Professor Emeritus Davis Center, Room 3508 David R. Cheriton School of Computer Science University of Waterloo 200 University Ave. West Waterloo, ON N2L 3G1, Canada E-mail: brecht AT uwaterloo DOT ca Research Interests: Performance Evaluation; Sports Analytics (especially hockey); The Internet of Things; Wireless Networking; High-Performance Internet Systems, Services and Applications; Parallel and Distributed Systems; Operating Systems. Prospective students: I am NOT currently looking for new students More information about the School's graduate program and requirements can be found here. News: I have retired and haven't updated this page in a long time. I'm still doing some research but I'm not taking any new students. Oct, 2022: Ali Abedi has joined Stanford as a postdoctoral researcher. Oct, 2022: Ali Abedi has joined Stanford as a postdoctoral researcher. Sept, 2022: Charlie Liu has joined the group for a co-op work term. Sept, 2022: My graduate student, David Radke, has also joined the Chicago Blackhawks in a part-time position as Hockey Research and Analytics Advisor. Sept, 2022: My graduate student, David Radke, has started an internship as Research Scientist at SonyAI. Sept, 2022: I will be teaching a graduate course this fall term Experimental Performance Evaluation July, 2022: I've been promoted to Full Professor (official as of July 1). It's pretty humbling and gratifying to think of all the great students, colleagues and industrial partners I've been able to work with over the years. June, 2022: Our LINHAC 2022 paper on models for passing in Hockey was awarded best paper. June, 2022: I gave an invited talk at LINHAC 2022 titled \"Puck Tracking Data: Opportunities and Challenges\" May, 2022: Tin Le has joined the group as an Undergraduate Research Fellow and is working on Hockey analytics using puck and player tracking data. April, 2022: David Radke has been awarded a prestigious NSERC Postgraduate Doctoral Scholarship. April, 2022: Our paper on the advantages of using teams in multi-agent reinforcement learning (MARL) systems has been accepted to IJCAI-ECAI 2022 and was among the 25% of the accepted papers selected for a full-length talk. David Radke will be presenting in person. March, 2022: Our paper on using credo and teams in multi-agent reinforcement learning has been accepted to ALA 2022. Sept, 2021: I will be teaching an online graduate course this fall term Experimental Performance Evaluation Sept, 2021: David Radke presented our paper \"Passing and Pressure Metrics in Ice Hockey\" He also created an excellent 15 minute video describing the work. August, 2021: David Radke present our paper \"Passing and Pressure Metrics in Ice Hockey\" at the IJCAI, AI for Sports Analytics (AISA) workshop. May, 2021: Our paper \"Passing and Pressure Metrics in Ice Hockey\" has been accepted to the AI for Sports Analytics (AISA) workshop. Jan, 2021: We've had our paper that studies whether or not WiFi backscatter might be a replacement for RFID accepted to MobiCom November, 2020: my Ph.D. student David Radke and his team finished in first place in the \"Sportsnet Hockey Hack Powered by Rogers 5G\". Oct, 2020: We've had our RFire paper on the potential for using millimeter wave wireless signals for the early detection of indoor fires accepted to BuildSys. Sept, 2020: We've had two papers accepted to MSWiM. One is about NeuRA (using neural networks for rate adapatation in WiFI networks) and the other is PNOFA (which is about optimizing the number of frames to aggregate in WiFi transmissions). Sept, 2020: Kamran Nishat has joined our group as a postdoc. August, 2020: Midul Jacob has completed his M.Math thesis. Congratulations Midul! August, 2020: Shervin Khastoo has completed his M.Math thesis. Congratulations Shervin! June, 2020: I have joined the SOSP Steering Committee May, 2020: We've had our paper on our WiFi backscatter technology accepted to SIGCOMM. May, 2020: Our full paper on \"RocketBufs\" has been accepted to DEBS 2020. December 4, 2019: My group has an opening for a Research Associate. If you or someone you know might be interested please contact me. November 22, 2019: Huy Hoang presented his M.Math thesis work on software for building message oriented middleware. Oct 2019: The Cheriton School of Computer Science is hiring. Click for info. September 13, 2019: Our paper \"Wi-LE: Can WiFi Replace Bluetooth?\" has been accepted to HotNets 2019. August 13, 2019: Ben Cassell has successfully defended his Ph.D thesis. Congrats Ben! June 14, 2019: Our RocketStreams paper has been accepted to APSys, 2019 June 6, 2019: Our WiTAG work was featured in TechDaily Feb 18, 2019: Our WiTAG work was featured in Digital Journal Feb 13, 2019: Our WiTAG work was featured in ACM TechNews. (See the headline: Making Homes Smart Could Become Easier.) Feb 8, 2019: Our WiTAG work was featured on Science and Technology Research News Feb 8, 2019: Our WiTAG work was featured on WiFi HiFi Nov, 2018: Omid Abari presented our WiTAG work at Hotnets. Oct, 2018: Our paper on WiFi backscatter communication (WiTAGs) has been accepted to HotNets. Sept, 2018: I'm teaching a graduate seminar course on Performance Evaluation. Here is a link to that course. August 15, 2018: We have had a poster accepted to Mobicomm, \"Analyzing Bitrates in Modern Wi-Fi Networks\" (which includes some data from Google WiFi access points) July 6, 2018: I did a phone interview on 570 News on the Jennifer Campbell show about our work with Netflix. For audio, click on the Friday July 6th, 2018 show then skip ahead to 5:18. July 6, 2018: I did a phone interview on CHML 900 (radio) about our work with Netflix. I don't have a link to that audio. July 4, 2018: The Record has run a story about our work with Netflix. July 2, 2018: we've had a paper accepted to TOMPECS, \"Quantifying Cloud Performance and Dependability: Taxonomy, Metric Design, and Emerging Challenges\" April 2018: Our work on RaMP has been accepted to HotCloud. March 2018: Our work on Carousel has been accepted to SIGMOD. December 2017: I've received funding from Google to support our WiFi research. Thanks Google! Nov 17, 2017: The significantly extended version of our Libception paper has been accepted to TOMPECS (this was a fast-tracked best paper award nomination from ICPE 2017). Oct 23, 2017: Carey Williamson and I will be general co-chairs of SOSP 2019. Sept 29, 2017: I gave a talk on our WiFi characterization work at the Cheriton Symposium. The recorded video is available here on YouTube. August 21, 2017: Ali Abedi succesfully defended his Ph.D. thesis. Aug 11, 2017: The signficantly extended version of our T-SIMn paper has been accepted for publication in the journal Computer Communications (this was a fast-tracked best paper award nomination from MSiM 2016). Jul 14, 2017: Our paper on Nessie our RDMA-based Key-Value Store has been accepted for publications in IEEE Transactions on Parallel and Distributed Systems. June 20, 2017: I gave a talk on our WiFi work at Qualcomm in San Jose. June 19, 2017: I gave a talk on our WiFi work at Google in Mountain View. Apr 25, I presented our paper Conducting Repeatable Experiments in Highly Variable Cloud Computing Environments at ICPE 2017. Apr 24, 2017: Ben presented our Libception paper at ICPE 2017. Apr 5, 2017: Our Libception paper has been selected as one of four best paper award candidates at ICPE 2017. Mar 31, 2017: David Pariag presented our paper at PAM 2017, in Sydney, Australia Dec 16, 2016: David Pariag and I have had our paper ``Application Bandwidth and Flow Rates from 3 Trillion Flows Across 45 Carrier Networks'' accepted to PAM. Nov 30, 2016: Jim Summers was the runner up for the 2016 SPEC Kaivalya Dixit Distinguished Dissertation Award. Nov 28, 2016: my postdoc Kamal Rahimi Malekshan started work at Siemen's Canada. Nov 23, 2016: I have been awarded a three year Cheriton Faculty Fellowship. Nov 19, 2016: Our Libception and RMIT paper submissions have been accepted to ICPE. Nov 16, 2016: Ali Abedi presented our 802.11n network characterization work at MSWiM in Malta. Nov 14, 2016: Ali Abedi presented our T-SIMn work with Andrew Heard at MSWiM in Malta. Sept 26, 2016: Jim Summers presented our work on characterizing Netflix server workloads at IISWC in Providence. Sept 20, 2016: I've been chosen to co-chair the MASCOTS 2017 program committee with David M. Nichol. It will be held in Banff! Sept 9, 2016: Jim Summers has successfully defended his Ph.D. thesis. Home Publications Supervision Committtees Teaching Projects Biography Artifacts Directions Partners Opportunities Tips & Misc. Last modified: Tue Nov 25 07:23:24 PM EST 2025",
  "content_length": 8796,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:00"
}