{
  "name": "Timothy Wiley",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/w/wiley-dr-timothy",
  "status": "success",
  "content": "Timothy Wiley - RMIT University Timothy Wiley SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Timothy Wiley Dr. Timothy Wiley Lecturer in Computer Science See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia timothy.wiley@rmit.edu.au ORCID: 0000-0002-5424-2537 Google Scholar Open to Masters Research or PhD student supervision Industry Projects Media enquiries About Dr. Timothy Wiley has a passion for Artificial Intelligence and Robotics. Timothy's expertise and passion is in Artificial Intelligence and Autonomous Robotics. His research interests include online learning (learning on-board autonomous robot in real-time as they operates) including online deep reinforcement learning, Human-Robot Interaction (methods for improving the relationship and trust between humans and robots intended to work with humans), Explainable AI in Autonomous Robotics leveraging Augmented Reality, and Qualitative Modelling and Reasoning (symbolic representations of robot numeric dynamics, and application of these models for determining robot dynamics). Applications of his research include food waste prevention in macadamia nut harvesting, augmented reality for explaining autonomous robot decision in RoboCup soccer, online learning of UAV control, real-time prediction of CFD in aviation, and fatigue crack growth modelling in aircraft. He is a lecturer in Computer Science & Software Engineering. Timothy heads the RMIT RoboCup Soccer Standard Platform League team, and serves on the Technical Committee for the league. He teaches in robotics, machine learning, and a variety of software development courses. Research Keywords: Autonomous Robotics Applied Artificial Intelligence Data Efficient Machine Learning Online Learning Reinforcement Learning Qualitative Modelling and Qualitative Reasoning Cognitive Robotics Uncrewed Ariel Systems/Vehicles (UAS/UAVs) Expand for full bio Collapse bio Media Research fields 460205 Intelligent robotics 4602 Artificial intelligence 461105 Reinforcement learning 460209 Planning and decision making UN sustainable development goals 9 Industry, Innovation and Infrastructure 11 Sustainable Cities and Communities Supervisor projects Project 2: Use of and co-existence with AI tools in communication and media work (How AI shapes media work and communication) 29 Sep 2025 Enhancing Underwater Exploration: Multimodal Optical Information Fusion Techniques 15 May 2025 Learning optimal control of games and machines in real-time 10 Feb 2025 Enhanced Collaborative Situational Awareness in Robotic Teaming through Multi-Object Tracking with Intermittent Communication 4 Jun 2024 Digital Twin of the Wind Environment in a City for AAM Applications 6 May 2024 Development of diffusion-based photorealistic augmented reality engine for outdoor training 16 Feb 2024 Studying Bird Flight in Turbulence 2 Feb 2024 Development of Socially Adaptive Robot to lessen anxiety through two-channel data sources and Reinforcement Learning 3 Jan 2024 Update and revision of dynamic transportation networks using Geo AI 21 Nov 2023 Automatic Flight Control System for Micro Air Vehicle inside Turbulent Urban Environment 31 Jul 2023 Policy Transfer for Deep Reinforcement Agents Using Game Entity Substitution – Applied to Infinite Mario 15 Dec 2022 Fixed-Wing UAV System for Aerial Tethered Delivery of Small to Medium Packages 16 Nov 2022 The Enhancement of Crack Growth Predictions in an Aerospace Aluminium Alloy with Novel Short Crack Growth Data Combined with a Machine Learning Optimisation Methodology 1 Sep 2022 Simultaneous Road Objects and Lane Detection Models in Autonomous Vehicles 18 Aug 2022 Teaching interests Timothy;s current teaching roles are: Course Co-ordinator: COSC2781/COSC2814 - Programming Autonomous Robots COSC2803 - Programming Studio 1 Cohort lead: COSC2803 - Programming Studio 1 COSC2804 - Programming Studio 2 Timothy is the designer of RMIT's cousrse Programming Auotnomous Robots, which is a core course in our Master's of Artificial Intgelligence program. The course launched in 2021, originally in partnership with AWS RoboMaker, focuses on practical applications of technologies and algoirithms in AI to real-world robotics systems, with a key drive for hands on programming with real robot platforms. The course currently features a fleet of Husarion ROSBot robots as part of the main application platform. The course also features a wide range of application platforms including the Husarion Panther, the Cobot UR5e, the Boston Dynamics Spot, and various UAVs. Timothy is the lead architect for the School of Comptuing Technologies (SCT) first year Programming Studios, as part of SCT's innovative Bootcamp2Studio first year education experience. He additionally desgined Programming Studio 1 couse as part of the Bootcamp2Studio teaching model, which launched in 2021. Programming Studio 1 showcases to students the end-to-end of software development, where they develop a data-driven fully functional website by the end of their first semester. It features concepts across user experience design, database concepts, and web programming. Research interests Timothy has two primary research interests. Firstly, in using autonomous robots as a platform for efficient machine learning. Secondly in investigating explainable artificial intelligence with applications in human-robot interaction. Keywords: Autonomous Robotics Applied Artificial Intelligence Data Efficient Machine Learning Online Learning Reinforcement Learning Qualitative Modelling and Qualitative Reasoning Cognitive Robotics Uncrewed Ariel Systems/Vehicles (UAS/UAVs) Research Projects: His research projects include: Easigrow | Defence structures and materials experimentation collaborative program - Easigrow is a program developed by the DST (Australian Defence Science and Technology) to model fatigue crack growth, specialises in calculating model coefficients that best fit crack growth data. This project extends and improves the capabilities of Easigrow with Machine Learning techniques for more accurate predictions. DimSim (Deep Intelligence Machine Simulator) - DimSim research is focused on developing a physically accurate, virtual simulation environment, able to simulate the function and performance of autonomous vehicles and related systems. Our partner is Rheinmetall Defence Australia (RDA). Initiatives and links Home Website Acknowledgement of Country RMIT University acknowledges the people of the Woi wurrung and Boon wurrung language groups of the eastern Kulin Nation on whose unceded lands we conduct the business of the University. RMIT University respectfully acknowledges their Ancestors and Elders, past and present. RMIT also acknowledges the Traditional Custodians and their Ancestors of the lands and waters across Australia where we conduct our business - Artwork 'Sentient' by Hollie Johnson, Gunaikurnai and Monero Ngarigo. More information News Events Library Maps Careers Contacts Study with Us Levels of study Online courses and degrees Single courses Applying to RMIT International students Parents Careers advisers Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Research Our research Centres and collaborations Partnerships Research degrees Find researchers Research contacts Partner Workforce development Staff development and training Research partnerships Facilities and equipment services Giving About Our strategy Governance and management Values Sustainability Schools and colleges Our locations and facilities Copyright © 2025 RMIT University | Terms | Privacy | Accessibility | Website feedback | Complaints | ABN 49 781 030 034 | CRICOS provider number: 00122A | TEQSA provider number: PRV12145 | RTO Code: 3046 | Open Universities Australia | RMIT Training Pty Ltd, trading as RMIT University Pathways (RMIT UP), CRICOS Provider Code: 01912G",
  "content_length": 9441,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:09"
}