{
  "name": "Timothy Cribbin",
  "homepage": "https://www.brunel.ac.uk/people/timothy-cribbin",
  "status": "success",
  "content": "Dr Timothy Cribbin | Introduction | Brunel University London Skip to Content Home People Dr Timothy Cribbin Dr Timothy CribbinSenior Lecturer Wilfred Brown Building 215 Email: timothy.cribbin@brunel.ac.uk Tel: +44 (0)1895 266046 Computer Science College of Engineering, Design and Physical Sciences Summary I am an information scientist with interests and expertise in information visualisation, interactive search UIs and text analytics. I was awarded a BSc (Hons) Psychology from the University of Portsmouth in 1994 and an MSc Industrial Psychology from the University of Hull in 1996. In 2006, I was awarded a PhD from Brunel University London for research exploring the use of spatial-semantic interfaces for exploratory document search. After working as a researcher for several years, I was appointed as a lecturer here at the Department of Computer Science (formerly DISC) in 2001. I have taught a wide range of subjects, at undergraduate and postgraduate level, including information visualization, human-computer interaction, statistics, databases and programming. I have worked on a number of funded projects during my career, primarily researching new methods and applications of visual text analytics in diverse areas such as requirements elicitation for end-user medical devices and the online development of radical/extremist group identities. I am a founder and lead programmer on the Chorus Twitter analytics project. I have published widely over a number of topics including document similarity modelling and visualization, social media analytics, citation-based search user interfaces and science mapping. I regularly act as reviewer for many conferences and journals in the areas of information science, social media analytics and information visualisation. Qualifications 2007 - PGCert Learning and Teaching in Higher Education, Brunel University 2005 - PhD Information Science, Brunel University \"Classifying complex topics using spatial-semantic document visualization: an evaluation of an interaction model to support open-ended search tasks\" 1996 - MSc Industrial Psychology, University of Hull Awarded Tom Hoyes Memorial Prize 1994 - Bsc (Hons) Psychology, University of Portsmouth Responsibility Deputy Senior Tutor (Misconduct) Newest selected publications Holmes, I., Cribbin, T. and Ferenczi, N. (2023) 'Style over substance: A psychologically informed approach to feature selection and generalisability for author classification'. Computers in Human Behavior Reports, 9. pp. 1 - 13. ISSN: 2451-9588 Open Access Link Journal article Smith, LGE., Wakeford, L., Cribbin, TF., Barnett, J. and Hou, WK. (2020) 'Detecting psychological change through mobilizing interactions and changes in extremist linguistic style'. Computers in Human Behavior, 108. pp. 1 - 12. ISSN: 0747-5632 Open Access Link Journal article Brooker, P., Barnett, J. and Cribbin, TF. (2016) 'Doing social media analytics'. Big Data & Society, 3 (2). pp. 1 - 12. ISSN: 2053-9517 Open Access Link Journal article Brooker, P., Barnett, J., Cribbin, T. and Sharma, S. (2015) 'Have we even solved the first 'big data challenge?' Practical issues concerning data collection and visual representation for social media analytics', in Snee, H., Hine, C., Morey, Y., Roberts, S. and Watson, H. (eds.) Digital Methods for Social Science: An Interdisciplinary Guide to Research Innovation. London : Palgrave Macmillan. pp. 34 - 50. ISBN 10: 1-137-45366-4. ISBN 13: 978-1-137-45365-5. Open Access Link Book chapter Beretta, V., Cribbin, TF., Maccagnola, D. and Messina, E. (2015) 'An interactive method for inferring demographic attributes in Twitter'.26th ACM Conference on Hypertext and Social Media (Hypertext 2015). Guzelyurt, Northern Cyprus. 24 - 4 September. ACM Press. pp. 113 - 122.Open Access Link Conference paper More publications(26)",
  "content_length": 3830,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:02"
}