{
  "name": "Tingting Mu",
  "homepage": "https://www.research.manchester.ac.uk/portal/tingting.mu.html",
  "status": "success",
  "content": "Tingting Mu - Research Explorer The University of Manchester Tingting Mu Dr Senior Lecturer in Machine Learning, Machine Learning and Robotics https://orcid.org/0000-0001-6315-3432 Personal profile BiographyI received my B.Eng. degree from School of the Gifted Young, University of Science and Technology of China in 2004, and Ph.D. degree from Department of Electrical Engineering and Electronics, University of Liverpool in 2008. Before I joined the Department of Computer Science, Universtiy of  Manchester in 2016, I was a lecturer in Department of Electrical Engineering and Electronics, University of Liverpool. My research is focused on developing advanced mathematical modelling and large-scale optimisation techniques to (1) simulate human intelligence and (2) analyse real-world complex data. For (1), I aim at  constructing effective machine learning models to automate tasks such as matching, recognition, prediction, ranking, inference, characterisation, language and vision understanding, etc. For (2), I aim at developing algorithms to discover latent structure and extract information from large-scale, noisy and unstructured data, e.g., text, image, video, signal, network data, supporting development of text mining systems and other related research areas such as scientific data analytics.TeachingCOMP24112 Machine Learning COMP34111 Natural Language Systems COMP24111 Machine Learning and Optimisation (2017-2020) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital FuturesSustainable FuturesKeywordsMachine LearningComputer VisionText MiningNatural Language ProcessingScientific data analytics Fingerprint Dive into the research topics where Tingting Mu is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Experimental Result Computer Science 100% Neural Network Computer Science 99% Machine Learning Computer Science 81% Dimensionality Reduction Computer Science 81% Data Visualization Computer Science 81% Interpretability Computer Science 81% Regularization Computer Science 81% Superior Performance Computer Science 79% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 51 Article 15 Conference contribution Research output per year Research output per year 4D CardioSynth: Synthesising Dynamic Virtual Heart Populations Through Spatiotemporal DisentanglementDou, H., Huang, J., Zakeri, A., Zhou, Z., Mu, T., Duan, J. & Frangi, A. F., 2026, Medical Image Computing and Computer Assisted Intervention , MICCAI 2025 - 28th International Conference, 2025, Proceedings. Gee, J. C., Hong, J., Sudre, C. H., Golland, P., Alexander, D. C., Iglesias, J. E., Venkataraman, A. & Kim, J. H. (eds.). Springer Nature, p. 3-12 10 p. (Lecture Notes in Computer Science; vol. 15962 LNCS).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Motion Pattern 100% Temporal Information 100% Variational Approach 100% Cardiovascular System 100% Motion 100% Group-Agent Reinforcement Learning with Heterogeneous AgentsWu, K., Zeng, X. & Mu, T., 21 Aug 2025, Proceedings of the Forty-First Conference on Uncertainty in Artificial Intelligence, UAI. ACM Digital Library, p. 4597 - 4617 203Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Reinforcement Learning 100% Speed-up 25% Knowledge Sharing 25% Superior Performance 25% Learning Performance 25% 5 Downloads (Pure) Precise, Fast, and Low-cost Concept Erasure in Value Space: Orthogonal Complement MattersWang, Y., Li, O., Mu, T., Hao, Y., Liu, K., Wang, X. & He, X., 10 Jun 2025, The IEEE/CVF Conference on Computer Vision and Pattern Recognition, CVPR.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Diffusion Model 100% Orthogonal Complement 100% Experimental Result 50% Shift Factor 50% Image Synthesis 50% 43 Downloads (Pure) Iterative Semantic Transformer by Greedy Distillation for Community Question AnsweringWu, J., Mu, T., Thiyagalingam, J., Hong, H., Hao, Y., Zhang, T. & Goulermas, J. Y., 19 Jun 2024, (E-pub ahead of print) In: IEEE/ACM Transactions on Audio, Speech, and Language Processing. p. 1-13Research output: Contribution to journal › Article › peer-review Open AccessFile Stack-Exchange 100% 95 Downloads (Pure) LoopGaussian: Creating 3D Cinemagraph with Multi-view Images via Eulerian Motion FieldLi, J., Cheng, L., Wang, Z., Mu, T. & He, J., 28 Oct 2024, ACM Multimedia 2024. p. 476 - 485 Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Depth Information 100% Feature Space 100% Regularization Term 100% Point Cloud 100% Estimation Method 100% 42 Downloads (Pure) View all 66 research outputs Projects 1 Not started 1 Active Projects per year MCAIF: Centre for AI FundamentalsKaski, S. (PI), Alvarez, M. (Researcher), Pan, W. (Researcher), Mu, T. (Researcher), Rivasplata, O. (PI), Sun, M. (PI), Mukherjee, A. (PI), Caprio, M. (PI), Sonee, A. (Researcher), Leroy, A. (Researcher), Wang, J. (Researcher), Lee, J. (Researcher), Parakkal Unni, M. (Researcher), Sloman, S. (Researcher), Menary, S. (Researcher), Quilter, T. (Researcher), Hosseinzadeh, A. (PGR student), Mousa, A. (PGR student), Glover, E. (PGR student), Das, A. (PGR student), DURSUN, F. (PGR student), Zhu, H. (PGR student), Abdi, H. (PGR student), Dandago, K. (PGR student), Piriyajitakonkij, M. (PGR student), Rachman, R. (PGR student), Shi, X. (PGR student), Keany, T. (PGR student), Liu, X. (PGR student), Jiang, Y. (PGR student), Wan, Z. (PGR student), Harrison, M. (Support team), Machado, M. (Support team), Hartford, J. (PI), Kangin, D. (Researcher), Harikumar, H. (PI), Dubey, M. (PI), Parakkal Unni, M. (PI), Dash, S. P. (PGR student), Mi, X. (PGR student) & Barlas, Y. (PGR student)1/10/21 → 30/09/26Project: Research Reinforcement Learning 100% Neural Network 71% Approximation (Algorithm) 62% Machine Learning 61% Artificial Intelligence 56% Fusion21 Ltd - Knowledge Exchange PartnershipMu, T. (PI), Embury, S. (CoI), Jay, C. (CoI) & Chowdhury, I. N. (PI)Project: Research Knowledge Exchange 100%",
  "content_length": 6771,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:19"
}