{
  "name": "Ting Zhu 0001",
  "homepage": "https://engineering.osu.edu/people/zhu.3445",
  "status": "success",
  "content": "Zhu, Ting | College of Engineering Skip to main content Ting Zhu Associate Professor, Computer Science and Engineering Dreese Laboratories2015 Neil Ave Columbus, OH 43210-1210 zhu.3445@osu.edu HomePage Biography Ting Zhu is an Associate Professor in the Department of Computer Science and Engineering at The Ohio State University (OSU). He received his B.E. and M.S. from Zhejiang University in Electrical Engineering, and an M.S. and Ph.D. from University of Minnesota in computer science and engineering. He worked as a CI Fellow at the University of Massachusetts Amherst for one year. He is a recipient of the 2017 National Science Foundation (NSF) Faculty Early Career Development Program (CAREER) award, 2018 SenSys Best Paper Runner-up award, 2016 Elsevier Journal of Network and Computer Applications Best Research Paper award, and 2014 BuildSys Best Paper Runner-up award. His research interests include machine learning, big data, wireless networks, cybersecurity and privacy, quantum networking and distributed computing, cyber-physical systems, autonomous vehicles and UAVs, renewable energy and sustainable technologies, smart health and smart communities. He has publishes more than 140 peer-reviewed papers in top conferences and journals. Five of his papers have been selected in the best paper award finalist in SenSys ’19, SenSys ’18, SenSys ’10, e-Energy ’13, and BuildSys ’14, respectively. He is an Associate Editor of ACM/IEEE Transactions on Networks, ACM Transactions on Sensor Networks, and IEEE Transactions on Mobile Computing. Recruiting: Dr. Zhu's lab is looking for PhD, Master, and undergraduate students with full financial support. Please send your transcript and CV to this email: zhu.3445@osu.edu. Expertise Big Data and Machine Learning Wireless Networking and Mobile Computing Cybersecurity and Privacy Smart Health and Smart Community Autonomous Driving and Cyber-Physical Systems Quantum Networking and Distributed Computing Renewable Energy and Sustainable Technologies",
  "content_length": 2009,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:13"
}