{
  "name": "Ting Wang 0006",
  "homepage": "https://alps-lab.github.io",
  "status": "success",
  "content": "Ting Wang | Stony Brook University About Me I am Associate Professor and Empire Innovation Scholar in the Department of Computer Science at Stony Brook University. I conduct research at the intersection of machine learning, privacy and security, and aim to develop safe and trustworthy artificial intelligence (AI) technologies. My recent work focuses on improving AI along three major thrusts: Security Assurance – resilient against malicious manipulations Privacy Preservation – respectful for individual privacy Decision-Making Transparency – interpretable to human perception Before joining Stony Brook, I was Associate Professor in the College of IST at Penn State. I finished my Ph.D. at Georgia Tech and my undergrad study at Zhejiang University. Team I lead the Algorithmic Learning, Privacy, and Security (ALPS) lab, where I am privileged to work alongside a team of exceptional talents, both in the past and present: Current Members – Tanqiu Jiang, Jiacheng Liang, Yuhui Wang, Rongyi Zhu, Ziyi Yin (co-supervised with Fenglong Ma), Guangke Chen Alumni – Changjiang Li (» Palo Alto Networks) Ren Pang (» Amazon), Tianyu Du (» Zhejiang University), Zhaohan Xi (» Binghamton), Xinyang Zhang (» Amazon), Tinghao Xie (» Princeton), Zheng Zhang (» Northwestern), Ningfei Wang (» Meta), Yujie Ji (» Amazon), Sam Nguyen (» Google), Yifan Huang (» Bloomberg) Join Us! – We are ALWAYS looking for motivated and bright (under)grad students and postdocs. If you know how to build/hack AI systems, we should talk! Please email me your resume and set up a time to discuss your potential fit to our team. Recent Publications (Full List) GraphRAG under Fire! Jiacheng Liang, Yuhui Wang, Changjiang Li, Rongyi Zhu, Tanqiu Jiang, Neil Gong, Ting Wang IEEE Symposium on Security and Privacy (S&P’26) Watch the Watchers! On the Security Risks of Robustness-Enhancing Diffusion Models Changjiang Li, Ren Pang, Bochuan Cao, Jinghui Chen, Fenglong Ma, Shouling Ji, Ting Wang USENIX Security Symposium (USENIX’25) You Can’t Steal Nothing: Mitigating Prompt Leakages in LLMs via System Vectors Bochuan Cao, Yuanpu Cao, Changjiang Li, Yameng Ge, Ting Wang, Jinghui Chen ACM Conference on Computer and Communications Security (CCS’25) RobustKV: Defending Large Language Models against Jailbreak Attacks via KV Eviction Tanqiu Jiang, Zian Wang, Jiacheng Liang, Changjiang Li, Yuhui Wang, Ting Wang International Conference on Learning Representations (ICLR’25) RAPID: Retrieval Augmented Training of Differentially Private Diffusion Models Tanqiu Jiang, Changjiang Li, Fenglong Ma, Ting Wang International Conference on Learning Representations (ICLR’25) SongBsAb: A Dual Prevention Approach against Singing Voice Conversion based Illegal Song Covers Guangke Chen, Yedi Zhang, Fu Song, Ting Wang, Xiaoning Du, Yang Liu Network and Distributed System Security Symposium (NDSS’25) Waterpark: A Robustness Assessment of Language Model Watermarking Jiacheng Liang, Zian Wang, Lauren Hong, Shouling Ji, Ting Wang The Conference on Empirical Methods in Natural Language Processing (EMNLP’25) Teaching Stony Brook Computer System Security (Fall 2025) Adversarial Machine Learning (Spring 2024, Spring 2025) Penn State CYBER 366: Malware Analytics (Spring 2023, Spring/Fall 2022) IST 597: Adversarial Machine Learning (Spring 2020, Spring 2021) DS 300: Data Privacy and Security (Fall 2019, Fall 2020) Powered by Jekyll and Minimal Light theme.",
  "content_length": 3418,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:12"
}