{
  "name": "Ting Bai",
  "homepage": "https://tbbaby.github.io/baiting_index.html",
  "status": "success",
  "content": "Ting Bai - Renmin Univ. Of China About Me Ting Bai baiting AT bupt.edu.cn I am now an Assistant Professor in School of Computer Science, Beijing University of Posts and Telecommunications. I got my PhD degree in Renmin University of China in July 2019, supervised by Prof. Ji-Rong Wen and Prof. Xin Zhao . My major research interests are in Recommender systems, Human behavior analysis on large social and information networks. I had been a Visiting Research Student at University of Montreal, Canada, supervised by Prof. Jian-Yun Nie . I have published several papers as the First Author on SIGIR, KDD, CIKM, WSDM, TKDE, NAACL, JCST and so on, three of them won the Best Paper/ Best Paper Runner Up Awards on KDD'19 workshop, CIKM'17 and Big Data'15 respectively. And I was invited as Reviewers of TKDE,SIGIR,JCST, AAAI, AIRS and so on. I also serve as the Publicity Chair in IEEE ICDM 2020. Professional Activities I serve as Publicity Chair of IEEE ICDM (2020) I serve as Publicity Chair of IEEE ICKG (2022) Invited Reviewer for IEEE Transactions on Knowledge and Data Engineering (TKDE) Invited Reviewer for Journal of Computer Science and Technology (JCST) I serve as PC of SIGIR I serve as PC of KDD I serve as PC of WWW I serve as PC of IJCAI I serve as PC of AAAI I serve as PC of WSDM I serve as PC of CIKM Selected Publications EMNLP'22 (Accept) A Multi-Modal Knowledge Graph for Classical Chinese Poetry. [Paper] WWW'22 A Contrastive Sharing Model for Multi-Task Recommendation. [Paper] Ting Bai, Yudong Xiao, Bin Wu, Guojun Yang, Hongyong Yu, Jian-Yun Nie DASFAA'22 Learning Social Influence from Network Structure for Recommender Systems. [Paper] Ting Bai , Yanlong Huang, Bin Wu DASFAA'22 Semi-Supervised Graph Learning with Few Labeled Nodes. [Paper] Cong Zhang, Ting Bai, Bin Wu ICMR'21 Relation-aware Hierarchical Attention Framework for Video Question Answering. [Paper] Fangtao Li,Ting Bai ,Chenyu Cao, Zihe Liu, Chenghao Yan, Bin Wu 计算机学报'21 基于图像和视频信息的社交关系理解研究综述. [Paper] 王正, 吴斌,王文哲,滕一阳,帅杰,肖云鹏 白婷 IEEE Big Data'21 Temporal Graph Neural Networks for Social Recommendation. [Paper] Ting Bai ,Youjie Zhang, Bin Wu, Jian-Yun Nie KSEM'21 A Time Interval Aware Approach for Session-Based Social Recommendation. [Paper] Youjie Zhang,Ting Bai ,Bin Wu, Bai Wang WWW'20 Deep Adversarial Completion for Sparse Heterogeneous Information Network Embedding. [Paper] Kai Zhao*,Ting Bai* , Bin Wu, Bai Wang, Youjie Zhang, Yuanyu Yang and Jian-Yun Nie Journal of Computer Research and Development'20 The Construction and Analysis of Classical CTohinese Poetry Knowledge Graph. [Paper] Liu Yutong, Wu Bin, Ting Bai WSDM'20 Pseudo Dyna-Q: A Reinforcement Learning Framework for Interactive Recommendation. [Paper] Lixin Zou，Long Xia, Pan Du, Zhuo Zhang, Ting Bai, Weidong Liu, Jian-Yun Nie, Dawei Yin. KDD Workshop'19 An End-to-End Neighborhood-based Interaction Model for Knowledge-enhanced Recommendation. [ Best Paper Award] [Paper] Yanru Qu,Ting Bai* (Co-First Author), Weinan Zhang, Jianyun Nie and Jian Tang. SIGIR'19 CTRec: A Long-Short Demands Evolution Model for Continuous-Time Recommendation [Paper] Ting Bai, Lixin Zou, Xin Zhao, Pan Du, Weidong Liu, Jian-Yun Nie and Ji-Rong Wen CIKM'19 News Graph: An Enhanced Knowledge Graph for News Recommendation. [Paper] Danyang Liu,Ting Bai* (Corresponding Author), Jianxun Lian, Guangzhong Sun, Wayne Xin Zhao, Ji-Rong Wen, Xing Xie. NAACL'19 SC-LSTM: Learning Task-Specific Representations in Multi-Task Learning for Sequence Labeling [Paper] Peng Lu,Ting Bai* (Co-First Author), Philippe Langlais SIGIR'18 An Attribute-aware Neural Attentive Model for Next Basket Recommendation [Paper] [Code] [Poster] Ting Bai, Jian-Yun Nie, Wayne Xin Zhao, Yutao Zhu, Pan Du, Ji-Rong Wen TKDE'18 Predicting Early Reviewers for Effective Product Marketing on E-Commerce Websites [Paper] [Slides] Ting Bai, Wayne Xin Zhao, Yulan He, Ji-Rong Wen AIRS'18 A Neural Labeled Network Embedding Approach to Product Adopter Prediction Qi Gu,Ting Bai, Wayne Xin Zhao,Ji-Rong Wen CIKM'17 A Neural Collaborative Filtering Model with Interaction-based Neighborhood [ Best Short Paper Runner-up Award] [Paper] [Code(Pytorch)] [(Keras)] [Slides] Ting Bai, Wayne Xin Zhao, Jun Zhang, Ji-Rong Wen JCST'17 An Experimental Study of Text Representation Methods for Cross-Site Purchase Preference Prediction Using the Social Text Data [Paper] Ting Bai, Hongjian Dou, Wayne Xin Zhao, Ji-Rong Wen Journal of Chinese Processing'17 Connecting Social Media to E-commerce: Long-tail Purchase Behaviors using Multiple Additive Regression Tree (Chinese) Ting Bai, Ji-Rong Wen, Wayne Xin Zhao, Bohua Yang CCF BIG DATA'15 Leveraging Online Social Media Information for Predicting the Long-tail Purchase Behaviors [ Best Paper Runner-up Award ] Ting Bai, Bohua Yang, Wayne Xin Zhao, Ji-Rong Wen Awards 2019Best Paper Award in KDD workshop 2017 Best Short Paper Runner Up Award in CIKM 2015 Best Paper Runner Up Award in CCF BigData Conference 2018 Merit Scholarship Program for Foreign Students (given by Canada Government) 2015, 2017,2018 National Scholarship for PhD students 2016,2017,2018 Outstanding Innovative Talents Cultivation Funded Programs of Renmin University of China 2016 Merit Student of Renmin University of China 2016 Social Work and Volunteer Service Award 2014 Bao Gang Education Scholarship，Given to 5/38700. 2013 The First Prize in National Competition of Information Technology Application Contest Contact Ting Bai Assistant Professor, School of Computer Science Beijing University of Posts and Telecommunications Email: baiting AT bupt.edu.cn Address: 3-816 room, No 10, Xitucheng Road, Haidian District, Beijing, China, 100876 Copyright © Ting Bai. 2018",
  "content_length": 5688,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:11"
}