{
  "name": "Tingzhu Huang",
  "homepage": "http://www.csee.umbc.edu/~zt",
  "status": "success",
  "content": "Ting Zhu's Home Home Projects Publications Teaching Activities Ting Zhu Associate Professor Department of Computer Science and Electrical Engineering University of Maryland Baltimore County, 1000 Hilltop Circle, Baltimore, MD, 21250 Office: ITE 360 Email: zt@umbc.edu Phone: 410-455-3315 (The best way to reach me is Email) Fax: +1-410-455-3969 General I am an associate professor in the Department of Computer Science and Electrical Engineering (CSEE) at University of Maryland Baltimore County. I received NSF CAREER award in 2017. I have dual appointments and am advising students in both the Electrical and Computer Engineering (ECE) program and Computer Science (CS) program. I'm looking for visiting scholars, Master's, and Ph.D. students to work in Energy, Systems, Big Data, Communications and Networking. Please contact me if you are interested. News Our paper \"VMscatter: A Versatile MIMO Backscatter\" was accepted in USENIX NSDI 2020. Our paper \"Parallel Inclusive Communication for Connecting Heterogeneous IoT Devices at the Edge\" was selected as Best Paper Award Candidate in ACM SenSys'19. Our paper \"CRF: Coexistent Routing and Flooding using WiFi Packets in Heterogeneous IoT Networks\" has been accepted in INFOCOM'19. Our paper \"Simultaneous Bi-directional Communications and Data Forwarding using a Single ZigBee Data Stream\" has been accepted in INFOCOM'19. Our paper \"Passive-ZigBee: Enabling ZigBee Communication in IoT Networks with 1000X+ Less Power Consumption\" was awarded Best Paper Runner-Up Award ACM SenSys'18. Our paper \"ECT: Exploiting Cross-Technology Concurrent Transmission for Reducing Packet Delivery Delay in IoT Networks\" has been accepted in INFOCOM'18. Our paper \"Aegis: An Interference-Negligible RF Sensing Shield\" has been accepted in INFOCOM'18. Papers accepted in ICNP'17 and INFOCOM'17 can be found here. Our paper \"EMF: Embedding Multiple Flows of Information in Existing Traffic for Concurrent Communication among Heterogeneous IoT Devices\" has been accepted in INFOCOM'17. Our paper \"PMC: Parallel Multi-protocol Communication to Heterogeneous IoT Radios within a Single WiFi Channel\" has been accepted in ICNP'17. The camera-ready version of our SenSys'16, ICNP'16, RTSS'16, IPSN'16, AsiaCCS'16 papers can be found here. Eight papers accepted in top conferences (i.e., SenSys'16, ICNP'16, INFOCOM'16, RTSS'16, IPSN'16, BigData'16, AsiaCCS'16) in 2016. Congratulations to my visiting scholars, undergrad and grad students! Our Microgrid paper selected as one of top three best papers at BuildSys '14. Our e-Energy 2013 paper was a finalist for the best paper award. Awards and Honors Best Paper Award Candidate, SenSys 2019 Distinguished Member of INFOCOM 2019 TPC, INFOCOM 2019 Best Paper Runner-up Award, SenSys 2018 CAREER Award, NSF, 2017 IEEE Senior Member, 2017 Best Research Paper Award, Elsevier Journal of Network and Computer Applications, 2016 Summer Faculty Fellowship, UMBC, 2015 Best Paper Runner-up Award, BuildSys 2014 Visiting Faculty Research Program Award, Air Force Research Lab, 2014 Finalist for Best Paper Award, e-Energy 2013 The New York State/United University Professions Individual Development Award, 2011 NSF/CRA Computing Innovation Fellow (47 out of all recent Ph.D. graduates in U.S.), 2010 Nominee for Best Paper Award, SenSys 2010 Research Interests Networking [Representative Work: ICNP'09, INFOCOM'09, NSD'10, ICNP'11, INFOCOM'14, ICNP'14, ICNP'15, ICNP'16, INFOCOM'16, AsiaCCS'16, SenSys'16, INFOCOM'17, INCP'17, INFOCOM'18, INFOCOM'19 SenSys'19,] Internet of Things, Wireless and Sensor Networks, Network Protocols, Social Networks, Spectrum Access, and Security Systems [Representative Work: MobiSys'09, INFOCOM'12, ICCPS'13, SenSys'13, SECON'14, INFOCOM'15, ICCPS'15b, IPSN'16, RTSS'16, ACM SenSys’18, IEEE MobiSys’18] Embedded Systems, Cyber-Physical Systems, Mobile Systems, Distributed Systems, and Operating Systems Energy [Representative Work: SenSys'10, BuildSys'11, e-Energy'12, e-Energy'13, BuildSys'14, e-Energy'15, ICCPS'15a, ICC'17, ICC'18, ICC'19] Renewable and Sustainable Energies, Power Electronics, Energy Transmission and Storage, and Power Systems Misc [Representative Work: ICDE'14, BigData'14, BigData'16a, BigData'16b] Big Data, Health/Bioinformatics, and Human-Computer Interaction Selected Publications: [Full List] Journals [TOSN] Wei Wang, Yao Yao, Xin Liu, Tiantian Xie, Ting Zhu. ECT: Exploiting Cross-Technology Transmission for Reducing Packet Delivery Delay in IoT Networks. In ACM Transactions on Sensor Networks, Vol. 15, No. 2, Article 20, 2019. [pdf] [Bibtex] [TOSN] Qingquan Zhang, Yao Yao, Ting Zhu, Ziqiao Zhou, Wei Xu, Ping Yi, Sheng Xiao. Dynamic Enhanced Field Division: an Advanced Localizing and Tracking Middleware. In ACM Transactions on Sensor Networks, Vol. 15, No. 1, Article 2, 2018. [pdf] [Bibtex] [TMC] Junghyun Jun, Liang He, Yu Gu, Wenchao Jiang, Gaurav Kushwaha, A Vipin, Long Cheng, Cong Liu, Ting Zhu. Low-Overhead WiFi Fingerprinting. In IEEE Transactions on Mobile Computing, Vol. 17, No. 3, 2017. [pdf] [Bibtex] [IJDSN] Jianwen Xu, Ping Yi, Wei Wang, and Ting Zhu. A Power Storage Station Placement Algorithm for Power Distribution based on Electric Vehicle. In International Journal of Distributed Sensor Networks, Vol. 13, No. 2, 2017.[pdf] [Bibtex] [TMC] Liang He, Guozhu Meng, Yu Gu, Cong Liu, Jun Sun, Ting Zhu, Yang Liu, and Kang Shin. Battery-Aware Mobile Data Service. In IEEE Transactions on Mobile Computing, Vol. 16, No. 6, 2017. [pdf] [Bibtex] [TCPS] Zhichuan Huang, Ting Zhu, David Irwin, Aditya Mishra, Daniel Menasche, and Prashant Shenoy. Minimizing Transmission Loss in Smart Microgrids by Sharing Renewable Energy. In ACM Transactions on Cyber-Physical Systems, Vol. 1, No. 2, Article 5, 2016. [pdf] [Bibtex] [TMC] Liang He, Linghe Kong, Yu Gu, Jianping Pan, and Ting Zhu. Evaluating the On-Demand Mobile Charging in Wireless Sensor Networks. In IEEE Transactions on Mobile Computing, Vol. 14, No. 9 2015. [pdf] [Bibtex] [TECS] Yu Gu, Liang He, Ting Zhu, and Tian He. Achieving Energy Synchronized Communication in Energy-Harvesting Wireless Sensor Networks. In the ACM Transactions on Embedded Computing Systems, Vol. 13, No. 2s, Article 68, 2014.[pdf] [Bibtex] [TON] Ting Zhu, Ziguo Zhong, Tian He, and Zhi-Li Zhang. Achieving Efficient Flooding by Utilizing Link Correlation in Wireless Sensor Networks. In the IEEE/ACM Transactions on Networking, Volume 21, Issue 1, Pages 121 - 134, 2013. [pdf] [Bibtex] [J-SAC] Aditya Kr Mishra, David Irwin, Prashant Shenoy, Jim Kurose, and Ting Zhu. GreenCharge: Managing Renewable Energy in Smart Buildings. In IEEE Journal on Selected Areas in Communications: Smart Grid Communications Series, Vol. 31, No. 7, July 2013. [pdf] [Bibtex] [TOSN] Ting Zhu, Yu Gu, Tian He, and Zhi-Li Zhang. Achieving Long-Term Operation with a Capacitor-Driven Energy Storage and Sharing Network. In ACM Transactions on Sensor Networks, Vol. 8, No. 3, Aug. 2012. [pdf] [Bibtex] Conferences [USENIX NSDI ’20]Xin Liu, Zicheng Chi, Wei Wang, Yao Yao, and Ting Zhu. VMscatter: A Versatile MIMO Backscatter. To appear in the 17th USENIX Symposium on Networked Systems Design and Implementation, Santa Clara, CA, USA, February, 2020.. [pdf] [Bibtex] Acceptance Rate: 17.45% [ACM SenSys '19]Zicheng Chi, Yan Li, Xin Liu, Yao Yao, Yanchao Zhang, and Ting Zhu. Parallel Inclusive Communication for Connecting Heterogeneous IoT Devices at the Edge. To appear in the 17th ACM Conference on Embedded Networked Sensor Systems, New York, USA, November, 2019. [pdf] [Bibtex] Acceptance Rate: 19.4% [INFOCOM '19]Wei Wang, Xin Liu, Yao Yao, Yan Pan, Zicheng Chi, and Ting Zhu. CRF: Coexistent Routing and Flooding using WiFi Packets in Heterogeneous IoT Networks. To appear in the 38th Annual IEEE International Conference on Computer Communications, Paris, France, April 2019. [pdf] [Bibtex] Acceptance Rate: 19.2% [INFOCOM '19]Zicheng Chi, Yan Li, Zhichuan Huang, Hongyu Sun, and Ting Zhu. Simultaneous Bi-directional Communications and Data Forwarding using a Single ZigBee Data Stream. To appear in the 38th Annual IEEE International Conference on Computer Communications, Paris, France, April 2019. [pdf] [Bibtex] Acceptance Rate: 19.2% [SenSys '18] Yan Li, Zicheng Chi, Xin Liu, and Ting Zhu. Passive ZigBee: Enabling ZigBee Communication in IoT networks with 1000x Less Power Consumption. To appear in 16th ACM Conference on Embedded Networked Sensor System, Shenzhen, China, November, 2018. [pdf] [Bibtex] Acceptance Rate: 15.6%. Best Paper Runner-up Award [SenSys '18] Zicheng Chi, Yao Yao, Tiantian Xie, Xin Liu, Zhichuan Huang, Wei Wang, and Ting Zhu. EAR: Exploiting Uncontrollable Ambient RF Signals in Heterogeneous Networks for Gesture Recognition. To appear in 16th ACM Conference on Embedded Networked Sensor System, Shenzhen, China, November, 2018. [pdf] [Bibtex] Acceptance Rate: 15.6% [MobiSys '18] Yan Li, Zicheng Chi, Xin Liu, and Ting Zhu. Chiron: Concurrent High Throughput Communication for IoT Devices. To appear in the 16th ACM International Conference on Mobile Systems, Applications, and Services, Munich, Germany, June 2018. [pdf] [Bibtex] [INFOCOM '18] Yao Yao, Yan Li, Xin Liu, Zicheng Chi, Wei Wang, Tiantian Xie, and Ting Zhu. Aegis: An Interference-Negligible RF Sensing Shield. To appear in the 37th Annual IEEE International Conference on Computer Communications, Honolulu, HI, April, 2018. [pdf] [Bibtex] Acceptance Rate: 19.2% [INFOCOM '18] Wei Wang, Tiantian Xie, Xin Liu, and Ting Zhu. ECT: Exploiting Cross-Technology Concurrent Transmission for Reducing Packet Delivery Delay in IoT Networks. To appear in the 37th Annual IEEE International Conference on Computer Communications, Honolulu, HI, April, 2018. [pdf] [Bibtex] Acceptance Rate: 19.2% [INFOCOM '17] Zicheng Chi, Zhichuan Huang, Yao Yao, Tiantian Xie, Hongyu Sun, and Ting Zhu. EMF: Embedding Multiple Flows of Information in Existing Traffic for Concurrent Communication among Heterogeneous IoT Devices. To appear in the 36th",
  "content_length": 20697,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:19"
}