{
  "name": "Ting-Hao (Kenneth) Huang",
  "homepage": "https://crowd.ist.psu.edu",
  "status": "success",
  "content": "Ting-Hao 'Kenneth' Huang Ting-Hao 'Kenneth' Huang 黃挺豪 Associate Professor College of Information Sciences and Technology (IST) Pennsylvania State University (University Park) Visiting Professor Cornell Information Science (Ithaca) I create technologies that help users. Combining Natural Language Processing (NLP) and Human-Computer Interaction (HCI), I build interactive systems to help people achieve their creative and social goals in day-to-day activities. From June 2025 to summer 2026, I'm taking a sabbatical leave from Penn State to visit Cornell Information Science in Ithaca, NY. I have limited capacity for requests and am avoiding morning meetings (ET)---but if you're in Ithaca, come say hi! Office (Cornell): 275 Cornell Bowers CIS Office Hours (Cornell): Weekly on Thursday 2-5pm in my office. No appointment needed! Email: txh710@psu.edu Google Scholar Curriculum Vitae (CV) Twitter: @windx0303 Website: KennethHuang.cc ORCID iD: 0000-0001-7021-4627 News Sep 2025 Giving a talk at Cornell Information Science Colloquium. August 2025 One paper accepted at EMNLP 2025 Findings! June 2025 The 3rd SciCap Challenge is launched! (Deadline: Aug 11). May 2025 One long paper is accepted by ACL 2025 main track. May 2025 Attending CCC Computing Futures Symposium on May 15-16 in Washington, DC. May 2025 Invited talk at Dr. Nathan Schneider's group, Georgetown University, on May 14. May 2025 Attending the In2Writing Workshop, as part of NAACL 2025. April 2025 Attending CHI 2025 in Yokohama, Japan. April 2025 My group is presenting two main conference papers, one LBW paper, and one workshop paper at CHI 2025. Our Red Note paper won the Best Paper Honorable Mention! April 2025 PSU Crowd-AI Lab PhD #3, Dr. Ting-Yao (Edward) Hsu, successfully defended his dissertation! April 2025 PSU Crowd-AI Lab PhD #1, Dr. Hua Shen, is starting a new faculty position at NYU Shanghai! April 2025 Invited talk at JHU's Center for Language and Speech Processing (CLSP). April 2025 Leading the organization of MASC-SLL 2025 at Penn State, with over 100 participants attending in person! March 2025 Receiving the Best Paper Award at the AAAI 2025 AI4Research workshop! March 2025 Invited talk at the CTO Data Science Speaker Series at Bloomberg in NYC. December 2024 Receiving a research grant from Sloan Foundation to foster scientific figure caption writing! Research Highlights Teaching Spring 2025 IST261: Application Development Design Studio I Spring 2025 IST261: Application Development Design Studio I (World Campus) Spring 2024 IST526: Development Tools and Visualizations for Human-Computer Interaction (Th 2:30PM-5:30PM, Westgate Bldg E206) Spring 2024 IST261: Application Development Design Studio I (Tu/Th 10:35AM-11:50AM, Business Bldg 208) Fall 2023 IST597: Intelligent and Interactive Writing Assistants (Th 2:30PM-5:30PM, Westgate Bldg W219) Fall 2023 IST402: Crowdsourcing & Crowd-AI Systems (Tu/Th 9:05AM-10:20AM, Westgate Bldg E206) Spring 2023 IST402: Crowdsourcing and Crowd-AI Systems (Mon/Wed 14:30-15:45, Willard Bldg 064) Fall 2022 IST261: Application Development Design Studio I (Tu/Th 15:05-16:20, Waring Hall 108) Spring 2022 IST361: Application Development Design Studio II (Tu/Th 14:30-15:45, Westgate E201) Spring 2022 IST261: Application Development Design Studio I (Mon/Wed/Fri 13:25-14:15, Westgate E205) Fall 2021 IST597: Crowdsourcing & Crowd-AI Systems (Tue 14:30-17:30, Westgate E210) Spring 2021 IST361: Application Development Design Studio II (Tu/Th 9:05-10:20, Zoom) Fall 2020 IST261: Application Development Design Studio I (Mon/Wed 16:00-17:15, Zoom) Spring 2020 IST402: Crowdsourcing and Crowd-AI Systems (Tue/Thu 10:35-11:50, Boucke 112) Fall 2019 IST361: Application Development Design Studio II (Tue 18:00-21:00, Westgate E165) Spring 2019 IST597: Crowdsourcing & Crowd-AI Systems (Thu 14:30-17:30, Westgate E210) Honors Dean's Circle of Teaching Excellence for 2023 Best Paper Award (For Receiving the Highest Score from Expert Reviewers), AsianCHI 2021. Outstanding Paper Award (2.5%, 7 out of 282 submissions), IUI 2019. Best Paper Honorable Mention Award (101/2500 = 5%), CHI 2018. Best Paper Honorable Mention Award (14/281 = 5%), CHI LBW 2016. Yahoo! Fellowship of the InMind project at CMU, 2014 – Present. Best Poster Award, LTI Student Research Symposium 2013.",
  "content_length": 4321,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:15"
}