{
  "name": "Tjark Weber",
  "homepage": "http://user.it.uu.se/~tjawe125",
  "status": "success",
  "content": "Tjark Weber Dr. Tjark Weber Associate Professor, Docent, Director of Studies Uppsala University Department of Information Technology Box 337 751 05 Uppsala Sweden E-mail: tjark.weber@it.uu.se (PGP key) Phone: +46 18 471 1099 Office: Lägerhyddsvägen 1, hus 10, rum 105144 I am a member of the Concurrency research group at the Department of Information Technology, Uppsala University. My research interests include automated and interactive theorem proving, formal verification, programming languages, digital security and computational logic. Publications Talks Teaching Events Misc Links Teaching I am looking for outstanding students who would like to do a thesis project (exjobb) in the area of formal methods. Please take a look at current project ideas. Please contact the Student Office for questions related to course admission or (re-)exam registration. Functional Programming 1 See here for Uppsala University term dates, and here for my previous courses and seminars. Events CPP 2023 (PC member) SYNASC 2020 (PC member) SMT 2020 (PC chair) LFMTP 2020 (PC member) SYNASC 2019 (PC member) CPP 2019 (PC member) SMT-COMP 2018 (chair) PxTP 2017 (PC member) SMT-COMP 2017 (chair) SMT-COMP 2016 (chair) SMT-COMP 2015 (chair) LSFA 2014 (PC member) SMT-COMP 2014 (co-organizer) SMT 2014 (PC member) ITP 2014 (PC member) SMT-EVAL 2013 (co-organizer) PxTP 2013 (PC member) PxTP 2012 (PC co-chair) PxTP 2011 (PC member) Misc Par is a portfolio SMT solver. It participated in SMT-COMP 2019 as Par4, where it won 90 scoring schemes in the single query track. Poly/ML Monitor: A graphical monitoring application for Poly/ML processes. pigeonhole.c: A small C program to create DIMACS CNF files that encode the pigeonhole problem (i.e., placing n+1 pigeons into n holes). tag-system.c: A small C program to emulate Post tag systems. My Erdős number is (at most) 4, via James L. Caldwell - John R. Cowles - Sarvadaman D. S. Chowla - Paul Erdős. Links How to write a great research paper How to Write an Informatics Paper About Computing Science Research Methodology Last modified: 2025-09-05",
  "content_length": 2084,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:23"
}