{
  "name": "Tobias Dürschmid",
  "homepage": "https://tobiasduerschmid.github.io",
  "status": "success",
  "content": "Tobias Dürschmid News 01 Oct. 2025 I have become the faculty advisor of UCLA's student clum \"Bruin Software Engineers\" 01 Aug. 2025 I started working for UCLA! I am looking forward to teaching CS 35L Software Construction 20 Mar. 2025 I accepted a position as Assistant Teaching Professor at UCLA. I am very excited to join a great department this Fall! 30 Apr. 2024 I am on the Software Engineering Teaching Job Market! After co-creating and co-instructing two software engineering courses at CMU I am looking for teaching-focused faculty positions in software engineering that start in Fall 2025. If you know anyone who is hiring teaching faculty in SE, please send me an email 10 Apr. 2024 I will be presenting our paper \"ROSInfer: Statically Inferring Behavioral Component Models for ROS-based Robotics Systems\" at ICSE in Lisbon. 15 Dec. 2023 Our paper \"ROSInfer: Statically Inferring Behavioral Component Models for ROS-based Robotics Systems\" has been accepted to ICSE 2024! 19 Oct. 2023 I will give a short lightning talk on our project ROSInfer at ROSCon. 10 Oct. 2023 In Spring 2023, I will be an instructor for our newly developed course 17-423/723 Designing Large-scale Software Systems. 13 May. 2023 I will give a talk at ICRA in London on our past, current, and ongoing work on Architectural Model Inference From Code For ROS-Based Robotics Systems. You can find the slides here. Publications 2024 ROSInfer: Statically Inferring Behavioral Component Models for ROS-based Robotics Systems Tobias Dürschmid, Chris Timperley, David Garlan, and Claire Le Goues ICSE '24: 46th International Conference on Software Engineering 2024 Abstract, BibTeX, Tool, Paper (Open Access) Robotics systems are complex, safety-critical systems that can consist of hundreds of software components that interact with each other dynamically during run time. Software components of robotics systems often exhibit reactive, periodic, and state-dependent behavior. Incorrect component composition can lead to unexpected behavior, such as components passively waiting for initiation messages that never arrive. Model-based software analysis is a common technique to identify incorrect behavioral composition by checking desired properties of given behavioral models that are based on component state machines. However, writing state machine models for hundreds of software components manually is a labor-intensive process. This motivates work on automated model inference. In this paper, we present an approach to infer behavioral models for systems based on the Robot Operating System (ROS) using static analysis by exploiting assumptions about the usage of the ROS API and ecosystem. Our approach is based on searching for common behavioral patterns that ROS developers use for implementing reactive, periodic, and state-dependent behavior using the ROS framework API.We evaluate our approach and our tool ROSInfer on five complex real-world ROS systems with a total of 532 components. For this purpose we manually created 155 models of components from the source code to be used as a ground truth and available data set for other researchers. ROSInfer can infer causal triggers for 87 % of component architectural behaviors in the 532 components. Copy to Clipboard @inproceedings{Duerschmid2024ROSInfer, author = {D\\\"{u}rschmid, Tobias and Timperley, Christopher Steven and Garlan, David and {Le~Goues}, Claire}, title = {ROSInfer: Statically Inferring Behavioral Component Models for ROS-based Robotics Systems}, year = {2024}, isbn = {9798400702174}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, url = {https://doi.org/10.1145/3597503.3639206}, doi = {10.1145/3597503.3639206}, booktitle = {Proceedings of the IEEE/ACM 46th International Conference on Software Engineering}, articleno = {144}, numpages = {13}, location = {Lisbon, Portugal}, series = {ICSE '24} } 2022 ROSDiscover: Statically Detecting Run-Time Architecture Misconfigurations in Robotics Systems Chris Timperley, Tobias Dürschmid, Bradley Schmerl, David Garlan, and Claire Le Goues ICSA '22: 19th IEEE International Conference on Software Architecture 2022 Abstract, BibTeX, DOI, Tool, Talk, Replication Package Robot systems are growing in importance and complexity. At the same time, it is becoming more important for them to be free of errors. Ecosystems for robot software, such as the Robot Operating System (ROS), provide libraries of reusable software components that can be configured and composed into larger systems. To support compositionality, ROS uses late binding and architecture configuration via “launch files” that describe how to initialize the components in a system. However, late binding often leads to systems failing silently due to misconfiguration, for example by misrouting or dropping messages entirely. In this paper we present ROSDiscover, which statically recovers the run-time architecture of ROS systems to find such architecture misconfiguration bugs. First, ROSDiscover constructs component level architectural models (ports, parameters) from source code. Second, architecture configuration files are analyzed to compose the system from these component models and derive the connections in the system. Finally, the reconstructed architecture is checked against architectural rules described in first-order logic to identify potential misconfigurations. We present an evaluation of ROSDiscover on real world, offthe-shelf robotic systems, measuring the accuracy, effectiveness, and practicality of our approach. To that end, we collected the first data set of architecture configuration bugs in ROS from popular open-source systems and measure how effective our approach is for detecting configuration bugs in that set. Copy to Clipboard @inproceedings{Timperley2022ROSDiscover, author = {Timperley, Christopher S. and D\\\"{u}rschmid, Tobias and Schmerl, Bradley and Garlan, David and {Le~Goues}, Claire}, title = {ROSDiscover: Statically Detecting Run-Time Architecture Misconfigurations in Robotics Systems}, booktitle = {Proceedings of the 19th IEEE International Conference on Software Architecture.}, series = {ICSA '22}, year = {2022}, numpages = {12}, location = {Honolulu, HI, USA}, publisher = {IEEE}, pages={112-123}, doi={10.1109/ICSA53651.2022.00019} } 2020 Synthesis-Based Resolution of Feature Interactions in Cyber-Physical Systems Ben Gafford, Tobias Dürschmid, Gabriel Moreno, and Eunsuk Kang ASE '20: IEEE/ACM International Conference on Automated Software Engineering 2020 Abstract, BibTeX, DOI, Paper (PDF) The feature interaction problem arises when two or more independent features interact with each other in an undesirable manner. Feature interactions remain a challenging and important problem in emerging domains of cyber-physical systems (CPS), such as intelligent vehicles, unmanned aerial vehicles (UAVs) and the Internet of Things (IoT), where the outcome of an unexpected interaction may result in a safety failure. Existing approaches to resolving feature interactions rely on priority lists or fixed strategies, but may not be effective in scenarios where none of the competing feature actions are satisfactory with respect to system requirements. This paper proposes a novel \u001bmph{synthesis-based} approach to resolution, where a conflict among features is resolved by \u001bmph{synthesizing} an action that best satisfies the specification of desirable system behaviors in the given environmental context. Unlike existing resolution methods, our approach is capable of producing a desirable system outcome even when none of the conflicting actions are satisfactory. The effectiveness of the proposed approach is demonstrated using a case study involving interactions among safety-critical features in an autonomous drone. Copy to Clipboard @inproceedings{Gafford2020FeatureResolution, author = {Gafford, Benjamin and D\\\"{u}rschmid, Tobias and Moreno, Gabriel A. and Kang, Eunsuk}, title = {Synthesis-Based Resolution of Feature Interactions in Cyber-Physical Systems}, booktitle = {Proceedings of the 35th IEEE/ACM International Conference on Automated Software Engineering.}, series = {ASE '20}, year = {2020}, numpages = {13}, location = {Virtual Event, Australia}, publisher = {ACM}, doi = {10.1145/3324884.3416630}, address = {New York, NY, USA}, } 2019 Trade-off-Oriented Development - Making Quality Attribute Trade-offs First-Class Tobias Dürschmid, Eunsuk Kang, and David Garlan ICSE-NIER '19: ICSE New Ideas and Emerging Results 2019 Abstract, BibTeX, DOI, Preprint (PDF), Poster (PDF), Slides Implementing a solution for a design decision that precisely satisfies the trade-off between quality attributes can be extremely challenging. Further, typically trade-offs are not represented as first-class entities in development artifacts. Hence, decisions might be suboptimal and lack requirements traceability as well as changeability. We propose Trade-off-oriented Development (ToD), a new concept to automate the selection and integration of reusable implementations for a given design decision based on quality attribute trade-offs. Implementations that vary in quality attributes and that solve reoccurring design decisions are collected in a design decision library. Developers declaratively specify the quality attribute trade-off, which is then used to automatically select the best fitting implementation. We argue that thereby, software satisfies the trade-offs more precisely, requirements are traceable and changeable, and advances in implementations automatically improve existing software. Copy to Clipboard @inproceedings{Duerschmid2019TOD, author = {D\\\"{u}rschmid, Tobias and Kang, Eunsuk and Garlan, David}, title = {Trade-off-Oriented Development -- Making Quality Attribute Trade-offs First-Class}, booktitle = {Proceedings of the 41st International Conference on Software Engineering: New Ideas and Emerging Results}, location = {Montreal, Quebec, Canada}, pages = {109--112}, series = {ICSE-NIER '19}, year = {2019}",
  "content_length": 37786,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:21"
}