{
  "name": "Tobias Knopp",
  "homepage": "https://www.tuhh.de/ibi/people/tobias-knopp-head-of-institute.html",
  "status": "success",
  "content": "IBI: Tobias Knopp (Head of Institute) Institute for Biomedical Imaging Institute for Biomedical Imaging EN EN IBI > People > Tobias Knopp (Head of Institute) Prof. Dr.-Ing. Tobias KnoppUniversitätsklinikum Hamburg-Eppendorf (UKE) Sektion für Biomedizinische Bildgebung Lottestraße 55 2ter Stock, Raum 209 22529 Hamburg- Postanschrift -Technische Universität Hamburg (TUHH) Institut für Biomedizinische Bildgebung Gebäude E, Raum 4.044 Am Schwarzenberg-Campus 3 21073 HamburgTel.: 040 / 7410 56794 Fax: 040 / 7410 45811 E-Mail: t.knopp(at)uke.de E-Mail: tobias.knopp(at)tuhh.de ORCID: https://orcid.org/0000-0002-1589-8517 RolesHead of the Institute for Biomedical ImagingEditor-in-chief of the International Journal on Magnetic Particle Imaging (IJMPI) Consulting HoursOn appointment Research InterestsTomographic ImagingImage ReconstructionSignal- and Image ProcessingMagnetic Particle Imaging Curriculum VitaeTobias Knopp received his Diplom degree in computer science in 2007 and his PhD in 2010, both from the University of Lübeck with highest distinction. For his PHD on the tomographic imaging method Magnetic Particle Imaging (MPI) he was awarded with the Klee award from the DGBMT (VDE) in 2011. From 2010 until 2011 he led the MAPIT project at the University of Lübeck and published the first scientific book on MPI. In 2011 he joined Bruker Biospin to work on the first commercially available MPI system. From 2012 until 2014 he worked at Thorlabs in the field of Optical Coherence Tomography (OCT) as a software developer. In 2014 he has been appointed as Professor for experimental Biomedical Imaging at the University Medical Center Hamburg-Eppendorf and the Hamburg University of Technology. Journal Publications 2025 P. Jürß, T. Knopp, B. Busse, F.N. von Brackel, and M. Boberg (2025). Optimization-based motion estimation in HR-pQCT. 2025 IEEE International Symposium on Biomedical Imaging (ISBI). 1-4 \t[Abstract] [Abstract] [doi] [www] S. Reiss, F. Thieben, J. Faltinath, T. Knopp, M. Boberg (2025). Model-Based Reconstruction in MPI accounting for Field Imperfections. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 \t[Abstract] [Abstract] [doi] [www] D. Durán, K. Scheffler, M. Möddel, and T. Knopp (2025). Efficient Iterative Reconstruction for an MPI Equilibrium Model with Anisotropy. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 [doi] P. Suskin, F. Foerger, P. Jürß, M. Boberg, T. Knopp, and M. Möddel (2025). Power-Efficient Control of Non-LinearMagnetic Field Generators for MPI. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 \t[Abstract] [Abstract] [doi] [www] J. Faltinath, F. Mohn, F. Foerger, M. Möddel, and T. Knopp (2025). Natural Frequency Dependence of Magneto-Mechanical Resonators on Magnet Distance. IEEE Sensors Journal. 25. (20), 38073-38081 \t[Abstract] [Abstract] [doi] [www] K. Scheffler, F. Foerger, and T. Knopp (2025). Experimental Study on Efficient Field Measurement using Ellipsoidal Harmonics. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 [doi] A. Tsanda, S. Benders, M. Adrian, A. Penn, and T. Knopp (2025). Chemically Resolved MRI with Field Inhomogeneity Correction. [www] N. Hackelberg, J. Ackers, F. Mohn, M. Graeser, and T. Knopp (2025). Software Implementation of Greedy Optimized MPS Sequences. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 \t[Abstract] [Abstract] [doi] [www] N. Hackelberg, M. Boberg, and T. Knopp (2025). GPU Accelerated Multi-Patch Reconstruction. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 \t[Abstract] [Abstract] [doi] [www] J. Dora, M. Möddel, S. Flenner, J. Reimers, B. Zeller-Plumhoff, C. G. Schroer, T. Knopp, and J. Hagemann (2025). Model-based autofocus for near-field phase retrieval. Optics Express. 33. (4), 6641-6657 \t[Abstract] [Abstract] [doi] [www] M. Boberg, T. Knopp, and M. Möddel (2025). Unique compact representation of magnetic fields using truncated solid harmonic expansions. European Journal of Applied Mathematics. 1-28 \t[Abstract] [Abstract] [doi] [www] K. Scheffler, L. Meyn, F. Foerger, M. Boberg, M. Möddel, and T. Knopp (2025). Efficient measurement and representation of magnetic fields in tomographic imaging using ellipsoidal harmonics. Communications Physics. 8. (112), [Abstract] [Abstract] [doi] A. Tsanda, K. Scheffler, S. Reiss, and T. Knopp (2025). Denoising the system matrix with deep neural networks for better MPI reconstructions. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), [Abstract] [Abstract] [doi] [www] L. Nawwas, M. Möddel, and T. Knopp (2025). Multi-Contrast MPI Matrix Compression. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 \t[Abstract] [Abstract] [doi] [www] P. Jürß, C. Droigk, M. Boberg, and T. Knopp (2025). TrainingPhantoms.jl: Simple and Versatile Image Phantom Generation. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 \t[Abstract] [Abstract] [doi] [www] F. Foerger, P. Jürß, M. Boberg, T. Hau, T. Knopp, and M. Möddel (2025). Current-to-Field Prediction for Non-Linear Magnetic Systems via Neural Networks. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), 1-2 \t[Abstract] [Abstract] [doi] [www] A. Tsanda, S. Khalid, M. Möddel, and T. Knopp (2025). Neural implicit representations for grid-agnostic MPI reconstructions. International Journal on Magnetic Particle Imaging. 11. (1 Suppl 1), [Abstract] [Abstract] [doi] [www] T. Merbach, F. Kexel, J. Faltinath, M. Möddel, M. Schlüter, T. Knopp, F. Mohn (2025). Wireless and passive pressure detection using magneto-mechanical resonances in process engineering. Measurement Science and Technology. 36. (8), 085109 \t[Abstract] [Abstract] [doi] [www] 2024 A. Tsanda, H. Nickisch, T. Wissel, T. Klinder, T. Knopp, and M. Grass (2024). Learning CT Segmentation from Label Masks Only. Medical Imaging with Deep Learning (MIDL 2024). [Abstract] [Abstract] [www] A. Tsanda, H. Nickisch, T. Wissel, T. Klinder, T. Knopp, and M. Grass (2024). Dose robustness of deep learning models for anatomic segmentation of computed tomography images. Journal of Medical Imaging. 11. (4), 044005 \t[Abstract] [Abstract] [doi] [www] T. Kluth, H. Albers, M. Maass, C. Droigk, M. Boberg, F. Thieben, K. Scheffler, and T. Knopp (2024). Recent Progress in Model-Based Reconstruction using Approximate Particle Models and low Calibration Effort. 13th International Workshop on Magnetic Particle Imaging (IWMPI 2024). 10. (1 Suppl 1), 1-1 \t[Abstract] [Abstract] [www] N. Hackelberg, M. Grosser, A. Tsanda, F. Mohn, K. Scheffler, M. Möddel, and T. Knopp (2024). RegularizedLeastSquares.jl: Modality Agnostic Julia Package for Solving Regularized Least Squares Problems. International Journal on Magnetic Particle Imaging. 10. (1 Suppl 1), 1-4 \t[Abstract] [Abstract] [doi] M. Möddel, L. Jensen, M. Boberg, and T. Knopp (2024). Comparison of Reconstruction Methods for Elongated Multi-Patch Sequences in Magnetic Particle Imaging. 13th International Workshop on Magnetic Particle Imaging (IWMPI 2024). 10. (1 Suppl 1), 1-1 \t[Abstract] [Abstract] [www] M. Maass, C. Droigk, H. Albers, K. Scheffler, A. Mertins, T. Kluth, and T. Knopp (2024). Magnetic particle imaging with non-oriented immobilized particles. International Journal on Magnetic Particle Imaging. 10. (1 Suppl 1), 1-4 \t[Abstract] [Abstract] [doi] M. Grosser, M. Möddel, and T. Knopp (2024). Exploiting the Fourier Neural Operator for Parameter Identification in MPI. International Journal on Magnetic Particle Imaging. 10. (1 Suppl 1), 1-4 \t[Abstract] [Abstract] [doi] L. Nawwas, M. Möddel, and T. Knopp (2024). Multi-contrast MPI channel leakage reduction using a two-step measurement and reconstruction method. International Journal on Magnetic Particle Imaging. 10. (1 Suppl 1), 1-4 \t[Abstract] [Abstract] [doi] [www] L. Nawwas, M. Möddel, and T. Knopp (2024). Influence of the System Matrix on Channel Leakage Artifacts in Multi-Contrast MPI. International Journal on Magnetic Particle Imaging. 10. (1 Suppl 1), 1-4 \t[Abstract] [Abstract] [doi] [www] K. Scheffler, L. Meyn, F. Foerger, M. Boberg, M. Möddel, and T. Knopp (2024). Ellipsoidal Harmonic Expansions for Efficient Approximation of Magnetic Fields in Medical Imaging. International Journal on Magnetic Particle Imaging. 10. (1 Suppl 1), 1-4 \t[Abstract] [Abstract] [doi] F. Thieben, F. Foerger, F. Mohn, N. Hackelberg, M. Boberg, J.-P. Scheel, Möddel, M. Graeser, and T. Knopp (2024). System Characterization of a Human-Sized 3D Real-Time Magnetic Particle Imaging Scanner for Cerebral Applications. Communications Engineering. 3. (1), 47 \t[Abstract] [Abstract] [doi] F. Mohn, P. Szwargulski, M. G. Kaul, M. Graeser, T. Mummert, K. M. Krishnan, T. Knopp, G. Adam, J. Salamon, and C. Riedel (2024). In Vitro Detection of Gastrointestinal Bleeding Using Single- and Multi-Contrast MPI. 10. (1 Suppl 1), [Abstract] [Abstract] [doi] F. Mohn, K. Scheffler, J. Ackers, A. Weimer, F. Wegner, F. Thieben, M. Ahlborg, P. Vogel, M. Graeser, and T. Knopp (2024). Characterization of the Clinically Approved MRI Tracer Resotran for Magnetic Particle Imaging in a Comparison Study. Physics in Medicine & Biology. 69. (13), 135014 \t[Abstract] [Abstract] [doi] F. Mohn, F. Foerger, F. Thieben, M. Möddel, T. Knopp, and M. Graeser (2024). Trade-off between Power Consumption and Receive Signal Strength for Inductively Coupled Transmit-Receive Circuits in MPI. 10. (1 Suppl 1), [Abstract] [Abstract] [doi] F. Mohn, F. Foerger, F. Thieben, M. Möddel, I. Schmale, T. Knopp and M. Graeser (2024). Resonant Inductive Coupling Network for Human-Sized Magnetic Particle Imaging. Review of Scientific Instruments. 95. (4), 044701 \t[Abstract] [Abstract] [doi] F. Foerger, N. Hackelberg, M. Boberg, M. Möddel, F. Thieben, F. Mohn, and T. Knopp (2024). Single-Shot Magnetic Field Measurements for MPI. 13th International Workshop on Magnetic Particle Imaging (IWMPI 2024). 10. (1 Suppl 1",
  "content_length": 27322,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:27"
}