{
  "name": "Tobias Scheffer",
  "homepage": "https://www.uni-potsdam.de/en/cs-ml/staff/contacts/scheffer",
  "status": "success",
  "content": "Prof. Tobias Scheffer - Staff - Machine Learning Group - Universität Potsdam JavaScript is not activated in your browser. Please activate JavaScript to use the whole functionality of this website! Skip to main contentInstitut Willkommen Kontakte und Gremien Alle Mitarbeitenden Services Informationen für Mitarbeitende Studium am Institut Übersicht Für Studierende Für Studieninteressierte Lehramt Informatik Für Alumni Forschungsgruppen Gesamtübersicht Architekturen eingebetteter Systeme für die Signalverarbeitung Betriebssysteme und Verteilte Systeme Design- und Testmethodik Didaktik der Informatik Digital Bioeconomy Komplexe Multimediale Anwendungsarchitekturen Künstliche Intelligenz in den Wissenschaften Maschinelles Lernen Maschinelles Lernen und Datenkompression Middleware, Operating Systems, and Computer Networks Sichere digitale Identitäten Software Engineering Theoretische Informatik Wissensverarbeitung und Informationssysteme Arbeitsgruppe Fehlertolerantes Rechnen Internationales Übersicht Im Ausland studieren Nach Potsdam kommen Dozentenaustausch Uni-Startseite Intranet Notfall Uni A-Z Gebärdensprache Leichte Sprache Sitemap Close Close EnglishProf. Tobias SchefferProf. Tobias SchefferProf. Tobias SchefferCloseStudiumStudieren an der UPStudienangebotBewerbung und ImmatrikulationStudium konkretBeratungs- und ServiceeinrichtungenTermine und FristenForschungForschen an der UPProfile, Programme und ProjekteForschungsförderungOpen ScienceForschungsdatenKooperationen und PartnerschaftenWissenschaftlicher NachwuchsUniversitätUP entdeckenOrganisationWirtschaft, Transfer und GesellschaftCampus InternationalFörderinstrumenteArbeiten an der UPOnline-DiensteAccount.UPBI.UPMail.UP (Webmailbox)PULSMoodleUniversitätsbibliothekEvaluationsportal (PEP)PraxisportalZIM – Zentrum für IT und MedienCloseProf. Dr. Tobias Scheffertelephone:+49 331 977 3020E-Mail:schefferucs.uni-potsdampdeaddress: Campus Golm University of Potsdam Department of Computer Science Building 70, Office 2.07 An der Bahn 2 14476 Potsdam, Germany Research InterestsI am interested in machine learning. My work spans a diverse range of applications, including biometrics, precision medicine, computational neuroscience, and computer security. Through my research, I strive to advance the field of machine learning and its applications, contributing to new solutions and insights for real-world problems.TeachingOur group offers courses on machine learning. If you are a student of the master program Data Science and have a question regarding this program, please visit this information page where you will find general information as well as contact information of the counsellor. If you have a question regarding a particular course, please visit the Moodle page of your course where you will find announcements as well as a contact.Curriculum VitaeI am a Professor of Computer Science at the University of Potsdam. From 2007 to 2008 I was the head of the Machine Learning Group at the Max Planck Institute of Computer Science in Saarbrücken. Between 2003 and 2006, I was Assistant Professor at Humboldt-Universität zu Berlin. I was awarded an Emmy Noether Fellowship of the German Science Foundation DFG in 2003 and an Ernst von Siemens Fellowship by Siemens AG in 1996. I received a Master's Degree in Computer Science (Diplominformatiker) in 1995 and a Ph.D. (Dr. rer nat.) in 1999 from Technische Universität Berlin.Service to the Scientific CommunityAssociate Editor, IEEE Transactions on Pattern Recognition and Machine Intelligence, 2013-2015.I have served as Program Co-Chair of the International Conference on Machine Learning 2011.I have frequently served on the Program Committee of the International Conference on Machine Learning.Editorial Boards: Machine Learning Journal, Data Mining and Knowledge Discovery, Journal of Artificial Intelligence Research.General Chair 2009 and  Program Co-Chair 2008, Conference on Email and Anti-Spam.Action Editor, Journal of Data Mining and Knowledge Discovery, 2007-2010.Program and Local Co-Chair, European Conference on Machine Learning and European Conference on Principles and Practice of Knowledge Discovery in Databases 2006.Selected Publications",
  "content_length": 4196,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:28"
}