{
  "name": "Tobias Fischer 0001",
  "homepage": "https://research.qut.edu.au/qcr/people/tobias-fischer",
  "status": "success",
  "content": "Tobias Fischer - QUT Centre for Robotics Skip to content Dr Tobias Fischer Home Our People Dr Tobias Fischer Please enable JavaScript Please enable JavaScript Find Tobias Fischer onTobias Fischer's full profile, contact information and publications are available on:Recent tweetsFollow @TobiasRobotics Senior Lecturer (Intelligent robotic systems, Robotic vision, Autonomous vehicles, SLAM) Doctor of Philosophy (Imperial College, London), M.Sc. (University of Edinburgh), B.Sc. (Other)Research Overview Dr Tobias Fischer conducts interdisciplinary research at the intersection of computer vision, cognitive robotics and computational cognition. His research goal is to provide robots with perceptional abilities that allow interactions with humans in a human-like manner. To develop these perceptional abilities, Tobias believes that it is useful to study the principles used by the animal visual system. He uses these principles to develop new computer vision algorithms and validates their effectiveness in intelligent robotic systems.Research Experience Dr Fischer is the Principal Investigator of a grant entitled \"Spike-based Visual Place Recognition using Intel's Loihi\" funded by the Intel Neuromorphic Computing Lab. He is further co-investigator of an Amazon Research Award on \"Complementarity-Aware Multi-Process Fusion for Long Term Localization\". Dr Fischer was a co-author and named lead researcher of two applications for the Samsung Global Research Outreach program, which resulted in 200,000 USD commercial funding. In addition, he has been working on major research projects funded by European Union FP7 and H2020 programs, and the Multidisciplinary University Research Initiative (MURI). His papers have received two best poster awards:Samsung AI Forum 2018 for the paper entitled \"Context-aware Deep Feature Compression for High-speed Visual Tracking\" (appeared at CVPR2018)IEEE International Conference on Computer Vision 2019 Workshop on Gaze Estimation and Prediction in the Wild for the paper entitled \"RT-BENE: A Dataset and Baselines for Real-Time Blink Estimation in Natural Environments\"Career History Before joining QUT as a Research Fellow in January 2020, Dr Fischer was a postdoctoral researcher in the Personal Robotics Lab at Imperial College London. He received a PhD from Imperial College with the thesis topic: \"Perspective Taking in Robots: A Framework and Computational Model\" in January 2019. The thesis has been awarded the Queen Mary UK Best Thesis in Robotics Award 2018 and the Eryl Cadwaladr Davies Prize for the best thesis in the Electrical and Electronic Engineering Department at Imperial College 2018. Since September 2020, Tobias is a professionally registered Chartered Engineer. Dr Fischer received the M.Sc. degree in Artificial Intelligence from The University of Edinburgh, in August 2014, and a B.Sc. degree in Computer Engineering from Ilmenau University of Technology, Germany, in 2013. He wrote his Bachelor thesis in John Tsotsos' Lab for Active and Attentive Vision, at the York University, Canada. From February 2012 until August 2014, he was a scholarship holder at the prestigious German National Academic Foundation (Studienstiftung des Deutschen Volkes).Web LinksPersonal websiteGoogle Scholar profileLinkedInTwitter @TobiasRoboticsPublication highlightsHausler, Garg, Xu, Milford & Fischer: Patch-NetVLAD: Multi-Scale Fusion of Locally Global Descriptors for Place Recognition (IEEE Conference on Computer Vision and Pattern Recognition 2021)Fischer & Milford: Event-Based Visual Place Recognition With Ensembles of Temporal Windows (IEEE Robotics and Automation Letters 2020)Fischer & Demiris: Computational Modelling of Embodied Visual Perspective-taking (IEEE Transactions on Cognitive and Developmental Systems)Fischer, Chang & Demiris: RT-GENE: Real-Time Eye Gaze Estimation in Natural Environments (European Conference on Computer Vision ECCV2018)Choi et al.: Context-aware Deep Feature Compression for High-speed Visual Tracking (IEEE Conference on Computer Vision and Pattern Recognition CVPR2018)Chang, Fischer, Petit, Zambelli and Demiris: Learning Kinematic Structure Correspondences Using Multi-Order Similarities (IEEE Transactions on Pattern Analysis and Machine Learning TPAMI2018 & CVPR2016) Projects (Chief investigator)Active, adaptive & predictive robot localizationAdaptive and Efficient Robot Positioning Through Model and Task FusionContinously updating place descriptorsEvent-based localisation for ultra-fast systemsImplicit representations for place recognition and robot localisationNeuro-Autonomy: Neuroscience-Inspired Perception, Navigation, and Spatial Awareness for Autonomous Robots: AUSMURI projectNeuromorphic computingNeuromorphic sensors and engineering for place recognitionRe-Evolving Nature’s Best Positioning Systems for People and Their Machines: Australian Research Council Laureate Fellowship 2022-2027 ProjectsAUSMURI: Neuro-Autonomy: Neuroscience-Inspired Perception, Navigation, and Spatial Awareness for Autonomous RobotsComplementarity-Aware Multi-Process Fusion for Long Term LocalizationNVIDIA Applied Research Accelerator ProgramRe-Evolving Nature’s Best Positioning Systems for People and Their MachinesSpike-based Visual Place Recognition using Intel’s LoihiWeakly Supervised Segmentation of Underwater Imagery Additional information Awards TypeAcademic Honours, Prestigious Awards or PrizesReference year2023DetailsMy first author paper \"Computational Modeling of Embodied Visual Perspective Taking\" has received the 2023 IEEE Transactions on Cognitive & Developmental Systems Outstanding Paper Award.TypeAcademic Honours, Prestigious Awards or PrizesReference year2021DetailsI am the senior author of the winning contribution (Patch-NetVLAD: Multi-Scale Fusion of Locally-Global Descriptors for Place Recognition; CVPR2021) at the ECCV 2020 Workshop on Long-Term Visual Localization under Changing Conditions.TypeAcademic Honours, Prestigious Awards or PrizesReference year2019DetailsOur Cortacero, Fischer and Demiris 2019 paper (RT-BENE: a dataset and baselines for real-time blink estimation in natural environments) won the best poster award at the ICCV Gaze Estimation and Prediction in the Wild workshop.TypeFellowshipsReference year2019DetailsI am a Fellow of the Higher Education AcademyTypeAcademic Honours, Prestigious Awards or PrizesReference year2018DetailsMy thesis has been recognised with the Eryl Cadwaladr Davies prize for the best thesis 2017-2018 in the Electrical and Electronic Engineering Department at Imperial College London.TypeAcademic Honours, Prestigious Awards or PrizesReference year2018DetailsI have been awarded the renowned Queen Mary UK Best PhD in Robotics Award 2018. The competition is open to all PhD students in the field of robotics within the UK.TypeFellowshipsReference year2012DetailsI have been awarded a scholarship by the German National Merit Foundation (Studienstiftung des Deutschen Volkes), Germany's largest, oldest and most prestigious scholarship organisation. The scholarship included tuition fees, travel grants and a living allowance. The foundation supports less than 0.5% of German students. Current Supervisions Robust Visual Place Recognition and 3D Scene Reconstruction Using Events and FramesPhD, Associate Supervisor Other supervisors: Professor Michael MilfordBio-inspired Neural Networks for Visual Place RecognitionPhD, Principal Supervisor Other supervisors: Professor Michael MilfordBio-inspired SLAM using Continuous Attractor NetworksPhD, Associate Supervisor Other supervisors: Professor Michael MilfordLearning Local and Global Place Representations for Visual Place RecognitionPhD, Associate Supervisor Other supervisors: Professor Michael MilfordAutonomous 3D Neural Scene ReconstructionPhD, Associate Supervisor Other supervisors: Professor Niko Suenderhauf, Professor Michael MilfordData Pre-Processing for Visual Localization TasksPhD, Principal Supervisor Other supervisors: Professor Michael Milford, Dr Alejandro Fontan VillacampaWeakly supervised segmentation of underwater imageryPhD, Principal Supervisor Other supervisors: Dr Ross Marchant, Dr Frederic Maire, Professor Niko Suenderhauf Completed Supervisions (Doctorate) Bridging the divide between Visual Place Recognition and SLAM (2023)Appearance and Viewpoint Invariant Visual Place Recognition Using Multi-scale and Multi-modality Systems (2021) NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 8722,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:25"
}