{
  "name": "Todd A. Proebsting",
  "homepage": "http://proebsting.cs.arizona.edu",
  "status": "success",
  "content": "Todd Proebsting Todd A. Proebsting Professor Emeritus Email: Prospective Students I retired from the university in 2025. While I am continuing doing research, I do not have funding to support students. Research My efforts in deploying prediction markets at Microsoft made me very interested in information aggregation and incentives. How do we elicit information from people (or machines), and aggregate it in a way that rewards good information sources? How do we help decision makers to seriously consider the forecasts they receive? I recently worked on research reproducibility in Computer Science with Christian Collberg. The work began with a simple effort to measure the repeatability of CS research. Our efforts culminated in creating a public database of recent CS publications AND their associated digital artifacts: www.findresearch.org. I currently have projects related to the following topics: Ranked-Choice Voting Evaluating congressional redistricting (aka gerrymandering) Effective Computer Science pedagogy (paused) Past papers, mostly on programming language topics, can be found on Google Scholar. Non-Academic History Before coming to the University of Arizona in August 2012, I was at Microsoft for 14 years. In 2003 at Microsoft, I founded and managed Microsoft's initial efforts in using prediction markets to help forecast future events. This project was named, \"Information Forecasting Exchange\", because its acronym, \"IFE\", was pronounced \"iffy...\" IFE culminated in markets that accurately predicted a serious delay in shipping an extremely important product. In addition to some great war stories, IFE also led to a few patents on betting interfaces for prediction markets, as well as a comprehensive paper on implementing Robin Hanson's automated market maker (each done in collaboration with Henry Berg): User interface for expressing forecasting estimates Continuous betting interface to prediction market Combined estimate contest and prediction market Hanson's Automated Market Maker I was a founding member of Microsoft's cloud computing project, which ultimately became Windows Azure. I was a member of Microsoft's C# Design Team, where I spearheaded the addition of CLU-style iterators to C#. The team won the Microsoft Outstanding Technical Achievement Award in 2007. Teaching 2024 Fall: CSC 453, Compilers 2024 Spring: CSC 352, C and System Software 2024 Spring: CSC 496, Undegraduate Seminar (Computational Election/Voting) 2023 Fall: CSC 453, Compilers 2023 Spring: CSC 453, Compilers 2022 Fall: CSC 453, Compilers 2022 Spring: CSC 110, Introduction to Programming 2017 Spring: CSC 453, Compilers 2016 Spring: Programming Workshop 2015 Fall: Programming Workshop 2015 Spring: CSC 352, C and System Software 2013 Fall: CSC 630, System Software 2013 Spring: CSC 553, Compilers Patents Beyond the prediction markets patents listed above, I patented a variety of programming language-y things, some of which are kind of cool. The full list is here. Vanity I may be best known for \"Proebsting's Law\", which asserts that compiler optimizations have yielded annual performance gains an order of magnitude worse than hardware performance gains. The law probably would have gone unnoticed had it not been for the protests by those receiving funds to do compiler optimization research. I am also known for \"Proebsting's Paradox\", which is an unexpected result in a provably optimal gambling strategy. Unlike Proebsting's Law, I did not name this one after myself, but rather Dr. Ed Thorp (of Beat The Dealer fame) named it after me. (See Wikipedia for details.) Amused at the ridiculousness of having things named after myself, I was hoping for \"Proebsting's Folly\", where I was going to convince the United States Government to buy the sovereign nation of Iceland to get them out of their banking troubles during the 2008 financial collapse. (This was based on the premise that every US purchase of a really cold territory is a \"folly\".) Unfortunately (for me), Iceland was able to recover.",
  "content_length": 4022,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:31"
}