{
  "name": "Todor P. Stefanov",
  "homepage": "https://liacs.leidenuniv.nl/~stefanovtp",
  "status": "success",
  "content": "Todor Stefanov home page Todor Stefanov Leiden Embedded Research Center (LERC) Leiden Institute of Advanced Computer Science (LIACS) - Leiden University Einsteinweg 55 Phone: +31-71-5275776 2333 CC Leiden Fax:     +31-71-5276985 The Netherlands E-mail: t.p.stefanov@liacs.leidenuniv.nl Position: Associate Professor Research interests: System-level Design Automation for Distributed Deep Learning at the Edge Deep Learning on Heterogeneous Resource-constrained Embedded Systems System-Level Design Automation for Embedded Systems-On-Chip Multiprocessor Embedded Systems-On-Chip Design Hardware/Software Co-Design Reconfigurable Computing and FPGA Design Parallel Computing Short Bio: I obtained the Dipl.Ing. and M.S. degrees in computer engineering from the Technical University of Sofia, Bulgaria, in 1998 and the Ph.D. degree in computer science from Leiden University, The Netherlands, in 2004. From 1998 until May 2000, I was a Research and Development Engineer with Innovative Micro Systems, Ltd., Sofia, where I worked on designing application specific microprocessor IP cores as well as on the development of a reconfigurable MicroSystems-on-Silicon In-Circuit Emulator based on FPGAs. From June 2000 until Aug. 2007, I was a Research Assistant (PhD candidate) and a PostDoc Researcher in the Leiden Embedded Research Center (LERC) of the Leiden Institute of Advanced Computer Science (LIACS) at Leiden University. From Sept. 2007 until Sept. 2008, I was a Senior Researcher at the Computer Engineering Lab, Delft University of Technology, The Netherlands. From Oct. 2008 until March 2014, I was an assistant professor at LIACS. Currently, I am an Associate Professor at LIACS and the Head of LERC which is a medium-size research group with a strong track record in the area of system-level design automation, system modeling and analysis, scheduling and synthesis, programming, and implementation of heterogeneous embedded and cyber-physical systems. This is demonstrated by my active participation in a large number of national and international big research projects in this area. I am (co-)author of more than 100 scientific papers. I am the recipient of two very prestigious awards: The 2022 ACM/IEEE/ESWEEK TEST-OF-TIME AWARD for the paper entitled \"A Framework for Rapid System-level Exploration, Synthesis, and Programming of Multimedia MP-SoCs\" that was published in 2007 at the IEEE/ACM International Conference on Hardware/Software Codesign and System Synthesis (CODES+ISSS). This Test-of-Time award is handed out, after a rigorous selection process, to a paper that has demonstrated to have had a major and long-lasting impact on the research field. The 2009 IEEE TCAD DONALD O. PEDERSON BEST PAPER AWARD for the journal article entitled \"Systematic and Automated Multi-processor System Design, Programming, and Implementation\" that was published in 2008 in the IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD). This award is presented by the IEEE Council on Electronic Design Automation and recognizes the best paper published in the IEEE TCAD journal. I have been an editorial board member of the Springer Journal on Embedded Systems and the International Journal of Reconfigurable Computing as well as a guest associate editor of the ACM Transactions on Embedded Computing Systems (2013). I have been General Chair of ESTIMedia 2015 and Local Organization Co-Chair of ESWeek 2015. Moreover, I serve (have served) on the organizational committees of several leading conferences, symposia, and workshops, such as DATE, ACM/IEEE CODES+ISSS, RTSS, IEEE ICCD, FPL, LCTES, IEEE/IFIP VLSI-SoC, ESTIMedia, SAMOS, EUC (as TPC member), and IEEE ESTIMedia, ACM SCOPES (as Program Chair). Open Positions: No open positions at the moment ... My CV Publications Projects Research Team/Students Teaching Professional Activities",
  "content_length": 3871,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:34"
}