{
  "name": "Tolga Ayav",
  "homepage": "http://ceng.iyte.edu.tr/people/tolga-ayav",
  "status": "success",
  "content": "Tolga Ayav - Computer Engineering Department Computer Engineering Department Izmir Institute of Technology Search Computer Engineering Department Izmir Institute of Technology Home About People Research Research Focus Projects Publications Collaborations Education Undergraduate Program MS Programs CENG MS Program SEDS MS Program PhD Program Minor Program Contact lidya multisite > Computer Engineering Department > Tolga Ayav Tolga Ayav Tolga Ayav Professor Tolga Ayav received his B.Sc. (1995) in Electronics Engineering, M.Sc. (1999) and Ph.D. (2004) degrees in Computer Engineering from 9 Eylül University, İzmir Institute of Technology and Ege University, respectively. He worked as research fellow in INRIA Rhone-Alpes in 2005. In addition to his administrative duties, he also manages the Dependable Components and Systems Lab in our department. His current research interests are: Formal Methods for Software Testing Testing of Hardware Components and System-on-Chip Real-Time and Fault-Tolerant Embedded Systems B.Sc. : Electrical and Electronics Engineering, Dokuz Eylul University (1995) M.Sc. : Computer Engineering, Izmir Institute of Technology (1999) Ph.D. : Computer Engineering, Ege University (2004) CoursesPublicationsProjectsCourses CENG 215 - Circuits and Electronics CENG 312 - Computer Networks CENG 383 - Real-Time Systems CENG 523 - Advanced Topics of Real Time Systems CENG 525 - Fault Tolerant Computing Publications 2021 Uras Tos; Riad Mokadem; Abdelkader Hameurlain; Tolga AyavAchieving query performance in the cloud via a cost-effective data replication strategy Journal Article Soft Computing, 25 (7), pp. 5437–5454, 2021.BibTeX@article{tos2021achieving, title = {Achieving query performance in the cloud via a cost-effective data replication strategy}, author = { Uras Tos and Riad Mokadem and Abdelkader Hameurlain and Tolga Ayav}, year = {2021}, date = {2021-01-01}, journal = {Soft Computing}, volume = {25}, number = {7}, pages = {5437--5454}, publisher = {Springer}, keywords = {}, pubstate = {published}, tppubtype = {article} } Close Deniz Kavzak Ufuktepe; Tolga Ayav; Fevzi BelliTest input generation from cause--effect graphs Journal Article Software Quality Journal, 29 (4), pp. 733–782, 2021.BibTeX@article{kavzak2021test, title = {Test input generation from cause--effect graphs}, author = { Deniz Kavzak Ufuktepe and Tolga Ayav and Fevzi Belli}, year = {2021}, date = {2021-01-01}, journal = {Software Quality Journal}, volume = {29}, number = {4}, pages = {733--782}, publisher = {Springer}, keywords = {}, pubstate = {published}, tppubtype = {article} } Close Melike Kaptan; Emrah Tomur; Tolga Ayav; Yusuf M ErtenSecure IoT Update Using Blockchain Inproceedings 2021 2nd International Informatics and Software Engineering Conference (IISEC), pp. 1–6, IEEE 2021.BibTeX@inproceedings{kaptan2021secure, title = {Secure IoT Update Using Blockchain}, author = { Melike Kaptan and Emrah Tomur and Tolga Ayav and Yusuf M Erten}, year = {2021}, date = {2021-01-01}, booktitle = {2021 2nd International Informatics and Software Engineering Conference (IISEC)}, pages = {1--6}, organization = {IEEE}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Mehmet İsmet Can Dede; Gökhan Kiper; Tolga Ayav; Barbaros Özdemirel; Enver Tatlıcıoğlu; Sahin Hanalioglu; İlkay Işıkay; Mustafa BerkerHuman--robot interfaces of the NeuRoboScope: A minimally invasive endoscopic pituitary tumor surgery robotic assistance system Journal Article Journal of Medical Devices, 15 (1), 2021.BibTeX@article{dede2021human, title = {Human--robot interfaces of the NeuRoboScope: A minimally invasive endoscopic pituitary tumor surgery robotic assistance system}, author = { Mehmet \\.{I}smet Can Dede and G\\\"{o}khan Kiper and Tolga Ayav and Barbaros \\\"{O}zdemirel and Enver Tatlıcıo\\u{g}lu and Sahin Hanalioglu and \\.{I}lkay I\\c{s}ıkay and Mustafa Berker}, year = {2021}, date = {2021-01-01}, journal = {Journal of Medical Devices}, volume = {15}, number = {1}, publisher = {American Society of Mechanical Engineers Digital Collection}, keywords = {}, pubstate = {published}, tppubtype = {article} } Close 2020 Osman Sönmeztürk; Tolga Ayav; Yusuf M ErtenLoyalty program using blockchain Inproceedings 2020 IEEE International Conference on Blockchain (Blockchain), pp. 509–516, IEEE 2020.BibTeX@inproceedings{sonmezturk2020loyalty, title = {Loyalty program using blockchain}, author = { Osman S\\\"{o}nmezt\\\"{u}rk and Tolga Ayav and Yusuf M Erten}, year = {2020}, date = {2020-01-01}, booktitle = {2020 IEEE International Conference on Blockchain (Blockchain)}, pages = {509--516}, organization = {IEEE}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Berkay Saydam; Tolga AyavEvaluation of scheduling architectures for OSEK/VDX compliant hard real-time operating systems Inproceedings 2020 Turkish National Software Engineering Symposium (UYMS), pp. 1–6, IEEE 2020.BibTeX@inproceedings{saydam2020evaluation, title = {Evaluation of scheduling architectures for OSEK/VDX compliant hard real-time operating systems}, author = { Berkay Saydam and Tolga Ayav}, year = {2020}, date = {2020-01-01}, booktitle = {2020 Turkish National Software Engineering Symposium (UYMS)}, pages = {1--6}, organization = {IEEE}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Savaş Takan; Tolga AyavMutant selection by using Fourier expansion Journal Article Turkish Journal of Electrical Engineering and Computer Sciences, 28 (5), pp. 2750–2767, 2020.BibTeX@article{takan2020mutant, title = {Mutant selection by using Fourier expansion}, author = { Sava\\c{s} Takan and Tolga Ayav}, year = {2020}, date = {2020-01-01}, journal = {Turkish Journal of Electrical Engineering and Computer Sciences}, volume = {28}, number = {5}, pages = {2750--2767}, keywords = {}, pubstate = {published}, tppubtype = {article} } Close Projects A Dedicated Server Design for Physical Web Applications, BAP Interference Prevention and Feedback Channel Design for Spectral Efficient Small Cell Base Stations, TÜBİTAK TEYDEB B.Sc. : Electrical and Electronics Engineering, Dokuz Eylul University (1995) M.Sc. : Computer Engineering, Izmir Institute of Technology (1999) Ph.D. : Computer Engineering, Ege University (2004) Courses Publications Projects CENG 215 - Circuits and Electronics CENG 312 - Computer Networks CENG 383 - Real-Time Systems CENG 523 - Advanced Topics of Real Time Systems CENG 525 - Fault Tolerant Computing Journal Article Ayav, T., “IEEE 802.11 Kablosuz Ağları için Bir Gerçek Zamanlı İletişim Protokolü - A Real-Time Communication Protocol for IEEE 802.11 Wireless Networks,” DEÜ Fen ve Mühendislik Dergisi, vol.19, no.55, pp.1-15, January 2017. Ayav, T., “Prioritizing MCDC test cases by spectral analysis of boolean functions,” Software Testing, Verification and Reliability, August 2017. Ayav, T., Sözer, H., “Identifying critical architectural components with spectral analysis of fault trees,” Applied Soft Computing, vol.49, pp.1270-1282, 2016. Uzun, B., Ayav, T., Dede, M.İ.C., Berker, M., Işıkay, İ., Hanalioğlu, Ş., Özdemirel, B., Kiper, G., Tatlıcıoğlu, E., Maaroof, O.W., Işıtman, O., Ateş, G., Yaşır, A., “Neuroboscope Sisteminin Model Tabanlı Sınaması,” Otomatik Kontrol Ulusal Toplantısı, TOK, 2016. Ayav, T., Sözer, H., “Moving Switching Functions to Continuous Domain,” Workshop on Model-based Verification and Validation, MVV, 2016. Tos, U., Mokadem, R., Hameurlain, A., Ayav, T., Bora S., “A Performance and Profit Oriented Data Replication Strategy for Cloud Systems,” The IEEE International Conference on Cloud and Big Data Computing, CBDCom, 2016. Kavzak, D., Ayav, T., Belli, F., “Neden-sonuç çizgelerinden test girişlerinin oluşturulması – Test Case Generation Based on Cause - Effect Graphs,” Turkish National Conference on Software Engineering, 2016. Ayav, T., Tuğlular, T., Belli, F., “Transforming VHDL to Timed Automata,” Technical Report, IYTE-COMPENG, 2015. Ayav, T., Ergenç, B., “Full-Exact Approach for Frequent Itemset Hiding,” International Journal of Data Warehousing and Mining, vol.11, no.4, pp.49-63, November 2015. Tos, U., Mokadem, R., Hameurlain, A., Ayav, T., Bora, S., “Dynamic replication strategies in data grid systems: a survey,” The Journal of Supercomputing, 2015. Ayav, T., “Yazılım Yapısal Kapsama Analizinde Testlerin Önceliklendirilmesi,” Ulusal Yazılım Mühendisliği Sempozyumu, UYMS, 2015. Ayav, T., “Birleşimsel Devreler için Otomatik Test Örüntüsü Oluşturma,” IEEE Sinyal İşleme ve İletişim Uygulamaları Kurultayı, SIU, 2015. Ayav, T., Belli, F., “Boolean Differentiation for Formalizing Myers' Cause-Effect Graph Testing Technique,” Workshop on Model-based Verification and Validation, MVV, 2015. Ayav, T., Tuğlular, T., Belli, F., “Model Based Testing of VHDL Programs,” IEEE International Workshop on Software Test Automation, STA, 2015. Takan, S., Güler, B., Ayav, T., “Model Checker-Based Delay Fault Testing of Sequential Circuits,” Workshop on Dependability and Fault Tolerance, VERFE 2015. Leloğlu, E., Ayav, T., Ergenç, B., “Coefficient-Based Exact Approach for Frequent Itemset Hiding,” International Conference on Information, Process, and Knowledge Management, eKNOW, 2014. Leloğlu, E., Ayav, T., Aslan, B.G., “A review of cloud deployment models for e-learning systems,” IEEE/IFIP International Conference on Dependable Systems and Networks, DSN, 2013. Özbek, B., Ayav, T., Yatır, M.N., Kirişken, B., “Television Rating Measurement System Design,” EMO The Journal of Electrical, Electronics, Computer and Biomedical Engineering, vol.1, no.2, pp.89-94, December 2011. Tos, U., Ayav, T., “Adaptive RTP Rate Control Method,” Proceedings of COMPSAC, 2011. Toker, A., Ayav, T., “Design of a Secure Microprocessor,” International Security and Criptology Conference, ISC, 2010. Ayav, T., Tuğlular, T., Belli, F., “Towards Test Case Generation for Synthesizable VHDL Programs Using Model Checker,” Workshop on Model-based Verification and Validation, MVV, 2010. Aycan, ",
  "content_length": 12596,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:46"
}