{
  "name": "Tom Heskes",
  "homepage": "https://www.cs.ru.nl/~tomh",
  "status": "success",
  "content": "Tom Heskes Tom Heskes Professor of Artificial Intelligence Data Science Institute for Computing and Information Sciences (iCIS) Faculty of Science Radboud University Nijmegen tom.heskes_at_ru.nl Phone numbers: +31 (0)24 3652696 (work) +31 (0)24 3652727 (secretary) Postal address: Postbus 9010 6500 GL Nijmegen The Netherlands Visiting address: Mercator I Toernooiveld 212 6525 EC  Nijmegen room 5.09 on the fifth floor News News See the group website for latest news. Publications Projects Group Research My research is on data science and artificial intelligence, in particular machine learning. In a nutshell, we use probability calculus and statistics to develop and understand computing systems that can learn from data. See my Google scholar page for recent and older results. In 2006, I received a prestigious Vici grant and in 2014 a TOP grant, both from NWO. Besides that, I am involved in several projects that concern applications in other sciences (e.g., biology, healthcare, physics, astronomy) and industry. My research group is part of iCIS, the computer science institute within the Netherlands with the highest quality and viability (according to this official report, the successor of this one, in which iCIS also came out on top). I was research director of iCIS from 2009 until 2014. Our group is further part of the Nijmegen ELLIS unit and I am one of the ELLIS fellows. We are involved in various ICAI labs; I am one of the co-directors of the AI for Parkinson lab. Thesis projects Bachelor CS Teaching I teach several courses in computer science and artificial intelligence. People from our group put together several suggestions for Master and Bachelor thesis projects that students from the Radboud University can do under our guidance. Between February 2017 and February 2020, I was director of education for computing science and information sciences. Our bachelor programme is the only Topopleiding in computer science within the Netherlands (source: Keuzegids 2020). Future bachelor students: check out our websites to see why you should study computing science or artificial intelligence in Nijmegen. For master students, the Data Science and AI specialization in the Computing Science master is highly recommended, since closest to my research interests. We do not have any (summer) internships for external students available, nor PhD positions, unless explicitly advertised. Radboud AI Machine2Learn Other I initiated Radboud AI and co-founded the spin-off Machine2Learn, which in 2023 has been acquired by Silo AI and in 2024 by AMD. If you really have to, you can check out my (short, not really up-to-date) cv. On October 9, 2009, I held my inaugural speech. I am currently vice dean of the Faculty of Science.",
  "content_length": 2748,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:43"
}