{
  "name": "Tom La Porta",
  "homepage": "http://www.cse.psu.edu/~tfl12",
  "status": "success",
  "content": "Tom La Porta Tom La Porta Director, School of Electrical Engineering and Computer Science Evan Pugh Professor, \t\tComputer Science and Engineering and Electrical Engineering Penn State University tlp@cse.psu.edu Office Hours: by appointment My research interests include the design of resilient interconnected networks, distributed analytics, resource allocation, mobility management, mobile data systems including networks, and applications, and secure signaling and control protocols for telecommunication networks. For a more complete biography click here. Students For a list of my current and graduated students, please click here. Professional Activities General Chair, ACM Workshop on Mission Oriented Sensor Networks, 2013 General Co-Chair, IEEE ICNP, 2011 Program Co-Chair, IEEE SECON, 2010 General Chair, IEEE MASS, 2008 Member, Board of Governors, IEEE Communications Society, 2007-2009- Director of Magazines, IEEE Communications Society, 2006-2008 General Co-Chair, Mobiquitous, 2006 Next Gen Networks Task Force for the President's National Security Telecommunications Advisory Panel, 2005 General Co-Chair, ACM Mobicom, 2005 Program Co-Chair, IEEE International Conference on Network Protocols (ICNP), 2004 Steering Committee, IEEE Transactions on Mobile Computing (Chair, 2009-2010) Steering Committee, IEEE/ACM Transactions on Networking, 2003-2010 Founding Editor-in-Chief, IEEE Transactions on Mobile Computing, 2001-2004 Editor-in-Chief for IEEE Wireless Communications Magazine, 1997-2000 For a list of publications, click here. Education B.E. and M.E. in Electrical Engineering from The Cooper Union, New York, New York Ph.D. in Electrical Engineering from Columbia University, 1992 - Advisor: Mischa Schwartz. Awards Evan Pugh Professor, 2016 Faculty Teaching Award, 2014, Dept. of Computer Science and Engineering William E. Leonhard Chair in Engineering, 2012 Thomas Alva Edison Patent Award, 2009 Distinguished Professor, 2007 IEEE Computer Society, Meritorious Service Award, 2005 IEEE Computer Society, Golden Core Member, 2005 Thomas Alva Edison Patent Award, 2005 IEEE Fellow, 2002 Bell Labs Fellow, 2000 An Eta Kappa Nu Outstanding Young Electrical Engineer, 1996 Bell Labs Distinguished Technical Staff Award, 1996 Thomas F. La Porta / tlp@cse.psu.edu Last updated 2/21",
  "content_length": 2300,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:48"
}