{
  "name": "Tom M. Mitchell",
  "homepage": "http://www.cs.cmu.edu/~tom",
  "status": "success",
  "content": "Tom Mitchell's Home Page Tom Mitchell Founders University Professor Machine Learning Department Block Center for Technology and Society School of Computer Science Carnegie Mellon University Resume / Curriculum Vitae Tom.Mitchell@cmu.edu, 412 268 2611, GHC 8203 Assistant: Jami Teets, 412 268 4622 What about ChatGPT and related large AI Systems? How will they impact us all? As a longtime researcher in AI, I'm excited about the ways in which these new AI systems can improve our healthcare, education, climate and more. At the same time, we need to think carefully about how to use them and how to prevent their misuse. I oppose recent suggestions that we simply ban their development, but I support and participate in efforts to anticipate their possible uses and impacts, and to help our leaders think through how governments should react. It will be useful to regulate AI, but primarily at the application level. For example, AI applications to medical diagnosis should be regulated very differently from AI applications to self-driving cars. U.S. National Academies report on AI and the Future of Work, study co-chairs Tom Mitchell and Erik Brynjolfsson, November 2024. Whitepaper \"How Can AI Accelerate Science, and How Can Our Government Help?\", Tom Mitchell, July 2024. Overview paper Artificial Intelligence: History, Status, and Futures , Eric Horvitz and Tom Mitchell, October, 2024. Slides from my presentation to the senior Repulican Senate staff, Washington D.C., July 17, 2023. A short fireside chat I had with Reid Hoffman, moderated by Ryan Heath about what is next for Generative AI, from the SCSP Global Emerging Technology Summit, Washington D.C., September 21, 2023. I currently chair a task force for the non-partisan, non-profit SCSP, to make recommendations to the U.S. government on the technology of Large Language Models, their impact on society, and actions the government might want to take in response. Current Research How can AI improve education? Watch my 2025 UCL Peter Kirstein lecture: Where Can AI Take Education by 2030?. My thesis: this is the decade when AI will truly revolutionize online education. Why? Because (1) for the first time we have finally have online education sites that have taught millions of students, providing more training data showing how students learn, than a human teacher could ever see in a 100-year teaching career, and (2) recent AI advances in machine learning, large natural language models, and reasoning give us the right tools to build AI agents that tutor online students. ... Show More Here are some problems I've been working on with my collaborators: Using Large Language Models like GPT-4 to build new online education systems. Ruffle and Riley: Towards the Automated Induction of Conversational Tutoring Systems, R. Schmucker, M. Xia, A. Azaria, T. Mitchell, NeurIPS 2023 Workshop on Generative AI for Education (GAIED), December, 2023. Tracing the knowledge state of students as they work through the online curriculum. Assessing the Knowledge State of Online Students -- New Data, New Approaches, Improved Accuracy, Robin Schmucker, Jingbo Wang, Shijia Hu, and Tom M. Mitchell, arXiv:2109.01753, September, 2021. Journal of Educational Data Mining. Transferable Student Performance Modeling for Intelligent Tutoring Systems, Robin Schmucker, Tom M. Mitchell. arXiv preprint arXiv:2202.03980, February 2022. Learning which teaching actions produce best learning outcomes. In January 2023 we deployed our trained model on the CK12.org platform, and it has now been used well over a million times to choose the right hint for students struggling to answer specific questions. Learning to Give Useful Hints: Assistance Action Evaluation and Policy Improvements R. Schmucker, N. Pachapurkar, S. Bala, M. Shaw, T. Mitchell, EC-TEL 2023, September 2023. How does the brain represent language meaning? We collect images of brain activity while human subjects read text, then use machine learning to analyze how observed brain activity represents language meaning. ... Show More Relating Simple Sentence Representations in Deep Neural Networks and the Brain, S. Jat, P. Talukdar, and T. Mitchell, Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (ACL 2019), pp. 5137--5154, 2019. The Lexical Semantics of Adjective-Noun Phrases in the Human Brain, A. Fyshe, G. Sudre, L. Wehbe, N. Rafidi, and T. Mitchell, Human Brain Mapping, DOI: 10.1002/hbm.24714, pp. 4457--4469, 2019. \"Predicting Human Brain Activity Associated with the Meanings of Nouns,\" T. M. Mitchell, S. V. Shinkareva, A. Carlson, K.M. Chang, V. L. Malave, R. A. Mason, and M. A. Just, Science, 320, 1191, May 30, 2008. DOI: 10.1126/science.1152876. Supporting Online Material. Supporting website. How will AI change the future of work? ... Show More U.S. National Academies report on AI and the Future of Work, study co-chairs Tom Mitchell and Erik Brynjolfsson, November 2024. 2017 U.S. National Academy report on Information Technology and the Future of Work. Study co-Chairs Erik Brynjolfsson, Tom Mitchell. What Can Machine Learning Do? Workforce Implications, Erik Brynjolfsson and Tom M. Mitchell, Science, December 22, 2017 358:6370. Track how Technology is Transforming Work, Tom M. Mitchell and Erik Brynjolfsson, Nature, April 20, 2017 544:290-292. Textbook: Machine Learning Machine Learning, Tom Mitchell, McGraw Hill, 1997. (free download) Publications Selected publications Colleagues Current and former students and visiting researchers",
  "content_length": 5525,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:47"
}