{
  "name": "Tom Zimmermann 0001",
  "homepage": "https://thomas-zimmermann.com",
  "status": "success",
  "content": "Thomas Zimmermann Thomas Zimmermann Chancellor’s Professor and Bren Chair at UC Irvine. Co-Editor In Chief of the Empirical Software Engineering Journal. AAAS Fellow. ACM Fellow. IEEE Fellow. Publications: DBLP | Google Scholar. Pre‑prints: ArXiv.org Orcid: 0000-0003-4905-1469 Email: tzimmer@uci.edu Follow Twitter LinkedIn Welcome to my personal homepage! News Spring 2025: Honored to receive the ESEC/FSE Test of Time Award for the 2015 paper How Practitioners Perceive the Relevance of Software Engineering Research April 2025: Honored to receive an IEEE Software Distinguished SEIP Paper Award for the ICSE 2025 paper Time Warp: The Gap Between Developers’ Ideal vs Actual Workweeks in an AI-Driven Era March 2025: Honored to be recognized as a AAAS Fellow for “distinguished contributions to the field of software engineering, particularly in mining software repositories, defect prediction, and developer productivity and experience through innovative empirical research.” January 2025: After 16 unforgettable years at Microsoft, I am excited to start a new position as Chancellor’s Professor and Bren Chair at the University of California, Irvine. My new contact email is tzimmer@uci.edu September 2024: The slides for my keynote at MODELS 2024 are online: The Fellowship of Trust in AI July 2024: The slides for my keynote at FSE 2024 are online: The Incredible Machine 3: Developer Productivity and the Impact of AI Publications For my publications, please visit my DBLP entry or Google Scholar profile. For pre-prints, please visit ArXiv.org page. If you need copies of any of my papers, please send me an email! I am very happy to send you copies of my papers! Talks For a selected list of presentations, please visit my Speaker Deck profile (talks since 2014) or my SlideShare profile (talks until 2013). Books I have co-edited several books, most recently Rethinking Productivity in Software Engineering, a free open access e-book (get the book on Amazon.com).",
  "content_length": 1974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:49"
}