{
  "name": "Tom Jenkins",
  "homepage": "https://pure.itu.dk/portal/da/persons/tom-jenkins",
  "status": "success",
  "content": "Tom Jenkins - IT-Universitetet i København Tom Jenkins Lektor, Human-Computer Interaction and DesignCenter for Climate IT Center for Digital VelfærdAkademisk Ansvarlig, IxD Lab https://orcid.org/0000-0001-6135-410X E-mailtomjeitudk 20182025 Publikationer pr. år Personlig profil EmneordCivic engagementCritical designCultural probesDesign ethnographyDesign researchFormgivingHCI: human-computer interactionInteraction designIoT: Internet of ThingsMakingMaterial computingParticipatory designPhysical computingSpeculative designSustainabilityTangible interaction Fingeraftryk Dyk ned i forskningsemnerne, hvor Tom Jenkins er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 6 Lignende profiler Interaction Design Computer Science 100% Design Research Computer Science 94% Human-Computer Interaction Computer Science 74% Research through Design Keyphrases 63% Internet-Of-Things Computer Science 52% Biodata Keyphrases 47% Case Study Computer Science 44% Self-tracking Keyphrases 41% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2018 2020 2022 2023 2025 2025 24 Konferencebidrag i proceedings 2 Tidsskriftartikel 2 Andet bidrag 1 Konferenceabstrakt i proceedings Publikationer pr. år Publikationer pr. år Hidden Layer Interaction: A Technique to Explore the Material of Generative AIGrabe, I. & Jenkins, T., 2025, ACM DIS '25: Proceedings of the 2025 ACM Designing Interactive Systems Conference. Association for Computing Machinery, s. 1913-1927 Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Generative AI 100% Hidden Layer 100% Interlayer Interaction 100% Layer Interaction 100% Generative Artificial Intelligence 100% Imagining a Soft and Relational Smart HomeJenkins, T., Tsaknaki, V. & Jørgensen, S. M. H., 6 aug. 2025, Nordic Design Research Conference. Design Research Society, 14 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Smart Home 100% Internet-Of-Things 100% Real Time 100% Humidity Sensor 100% Domestic Context 25% Re-Imagining the Landscape of Future FarmingPadalak, M. A. & Jenkins, T., 6 aug. 2025, Nordic Design Conference. Design Research Society, 14 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Denmark 100% Imagining 100% Future Agriculture 100% Agricultural Futures 100% Techno 50% Research Products and Time: When, For How Long, And Then What?Berger, A., Hildebrandt, S., Kurze, A., Odom, W., Jenkins, T., Pierce, J., Chatting, D., Oogjes, D., Nabil, S., Boucher, A. & Gaver, W., 26 apr. 2025, ACM Conference on Computer Human Interaction. Association for Computing Machinery, 6 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Temporal Aspects 100% Time Impact 100% Collaborative Session 100% Duction 100% Human Computer Interaction 100% Mapping Futures and Futuring in HCI/DesignJenkins, T., Tsaknaki, V., Boer, L., Kun, P., Howell, N., Wong, R., Campo Woytuk, N. & Søndergaard, M. L. J., 1 jul. 2024, Proceedings of the Designing Interactive Systems Conference 2024. Association for Computing Machinery, s. 458-461 4 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferenceabstrakt i proceedings › Forskning › peer review Åben adgangFil HCI Design 100% Human-Computer Interaction 100% Design Artefacts 50% Geographical Location 50% Design Researchers 50% Se alle 29 publikationer Projekter Projekter pr. år 2023 2023 2024 1 Afsluttet Projekter pr. år NORDICFAB: Speculating and intervening in Nordic Technological Wellbeing ImaginariesTsaknaki, V. (PI), Boer, L. (CoI) & Jenkins, T. (CoI)NordForsk01/01/2023 → 31/12/2024Projekter: Projekt › Forskning Imaginaries 100% Well-being 100% Speculating 100% Fabulation 100% Occupational Career 100%",
  "content_length": 4395,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:44"
}