{
  "name": "Tom Deakin",
  "homepage": "https://research-information.bris.ac.uk/en/persons/tom-deakin",
  "status": "success",
  "content": "Tom Deakin - University of Bristol View Scopus Profile Dr Tom Deakin PhD, MSci, PGDip Senior Lecturer in Advanced Computer Systems, School of Computer Science https://orcid.org/0000-0002-6439-4171 Emailtom.deakinbristol.acuk BS8 1UB Personal profile Research interestsI'm interested in understanding and achieving the performance limiting factors of massively parallel High Performance simulation codes. This means conducting performance analysis on parallel codes to understand what performance is possible on existing and future many-core processors. I then use this model to understand how performance portable the implemenations are across different processors and programming languages. Research Groups and ThemesHigh Performance ComputingKeywordsHigh Performance ComputingPerformance PortabilityPerformance AnalysisParallel Programming ModelsMany-core Architectures Fingerprint Dive into the research topics where Tom Deakin is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Graphics Processing Unit Computer Science 100% Many-Core Computer Science 69% Benchmarking Computer Science 45% Performance Portability Computer Science 39% Parallelism Computer Science 36% Parallel Programming Model Computer Science 34% Supercomputer Computer Science 31% Memory Bandwidth Computer Science 25% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 31 Conference Contribution (Conference Proceeding) 4 Conference Poster 4 Special issue (Academic Journal) 3 Preprint 6 More 2 Other Conference Contribution 2 Article (Academic Journal) 1 Conference Abstract 1 Software Research output per year Research output per year AI-Assisted Design-Space Analysis of High-Performance Arm ProcessorsMoore, J. S., Deakin, T. & McIntosh-Smith, S. N., 8 Jan 2025, Proceedings of SC 2024-W: Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis. Institute of Electrical and Electronics Engineers (IEEE), p. 1455-1467 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open AccessFile Machine Learning 100% Learning System 100% Artificial Intelligence 100% Search Space 50% Hardware Design 50% 42 Downloads (Pure) A Metric for HPC Programming Model ProductivityLin, T., Deakin, T. & McIntosh-Smith, S. N., 8 Jan 2025, SC24-W: Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis. Institute of Electrical and Electronics Engineers (IEEE), p. 1192-1205 14 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open AccessFile Programming Model 100% Fortran 50% Benchmarking 25% Analysis Framework 25% Lines of Code 25% 1 Citation (Scopus) 44 Downloads (Pure) Classifying Performance Bounds Using Machine LearningLittman, L. & Deakin, T., 21 Nov 2025.Research output: Contribution to conference › Conference Poster Open AccessFile Learning System 100% Roofline Model 33% Application Benchmark 33% View all 48 research outputs Projects 4 Finished Projects per year UKRI Benchmarking Framework InvestigationDeakin, T. (Principal Investigator)1/01/25 → 31/03/25Project: Research ExCALIBUR H&ES Benchmarking for Performance Portable ExCALIBUR ApplicationsDeakin, T. (Principal Investigator)1/01/23 → 31/07/23Project: Research ExCALIBUR H&ES Benchmarking for Performance Portable ExCALIBUR ApplicationsDeakin, T. (Principal Investigator)1/01/23 → 31/07/23Project: Research, Parent View all 4 projects Activities 1 Invited talk 1 Editorial activity 1 Publication peer-review 1 Advisory work for/on national or international committee or working group Activities per year Workshop on Memory Centric High Performance Computing (Event)Deakin, T. J. (Peer reviewer)2018Activity: Publication peer-review and editorial work types › Publication peer-review AWE Student ColloquiumDeakin, T. J. (Speaker)15 Apr 2016Activity: Participating in or organising an event types › Invited talk Programming Models and Co-Design Meeting (Event)Deakin, T. J. (Speaker)3 Feb 2016Activity: Membership types › Advisory work for/on national or international committee or working group View all 4 activities Thesis Leveraging Many-Core Technology for Deterministic Neutral Particle Transport at Extreme ScaleDeakin, T. (Author), Mcintosh-Smith, S. N. (Supervisor), 8 May 2018Student thesis: Doctoral Thesis › Doctor of Philosophy (PhD) File",
  "content_length": 4841,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:40"
}