{
  "name": "Tom Rodden",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/tom.rodden",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Thomas RoddenPro-Vice-Chancellor of Research & Knowledge Exchange, Faculty of VC's Office Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom B03 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/atom.rodden@nottingham.ac.ukhttps://rodden.info/ Research SummaryInterest in the development of novel interactive devices and arrangements. The development of interactive cooperative systems as part of multidisciplinary teams.Recent Publications LACHLAN URQUHART and TOM RODDEN, 2017. New Directions in Information Technology Law: Learning from HCI: Learning from Human Computer Interaction International Review of Law, Computers and Technology. 31(2), 150-169 (In Press.)JOEL FISCHER, ANDY CRABTREE, JAMES COLLEY, TOM RODDEN and ENRICO COSTANZA, 2017. Data Work: How Energy Advisors and Clients Make IoT Data Accountable Computer Supported Cooperative Work: The Journal of Collaborative Computing and Work Practices. 26(4-6), 597-626FISCHER, JOEL E., GREENHALGH, CHRIS, JIANG, WENCHAO, RAMCHURN, SARVAPALI D., WU, FENG and RODDEN, TOM, 2017. In-the-loop or on-the-loop? Interactional arrangements to support team coordination with a planning agent Concurrency and Computation: Practice and Experience. e4082-n/aLACHLAN URQUHART and TOM RODDEN, 2016. A Legal Turn in Human Computer Interaction?: Towards ‘Regulation by Design’ for the Internet of Things Social Science Research Network. Available at: <http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2746467> (In Press.) View all publications LACHLAN URQUHART and TOM RODDEN, 2017. New Directions in Information Technology Law: Learning from HCI: Learning from Human Computer Interaction International Review of Law, Computers and Technology. 31(2), 150-169 (In Press.)JOEL FISCHER, ANDY CRABTREE, JAMES COLLEY, TOM RODDEN and ENRICO COSTANZA, 2017. Data Work: How Energy Advisors and Clients Make IoT Data Accountable Computer Supported Cooperative Work: The Journal of Collaborative Computing and Work Practices. 26(4-6), 597-626FISCHER, JOEL E., GREENHALGH, CHRIS, JIANG, WENCHAO, RAMCHURN, SARVAPALI D., WU, FENG and RODDEN, TOM, 2017. In-the-loop or on-the-loop? Interactional arrangements to support team coordination with a planning agent Concurrency and Computation: Practice and Experience. e4082-n/aLACHLAN URQUHART and TOM RODDEN, 2016. A Legal Turn in Human Computer Interaction?: Towards ‘Regulation by Design’ for the Internet of Things Social Science Research Network. Available at: <http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2746467> (In Press.)SKATOVA A., BEDWELL B., SHIPP V., HUANG Y., YOUNG A., RODDEN T. and BERTENSHAW E., 2016. The Role of ICT in Office Work Breaks In: CHI'16 Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems Pages 3049-3060. JOEL FISCHER, ANDY CRABTREE, TOM RODDEN, JAMES COLLEY, ENRICO CONSTANZA, MIKE JEWELL and SARVAPALI RAMCHURN, 2016. “‘Just whack it on until it gets hot’ - working with IoT data in the home” In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 5933-5944PETER TOLMIE, ANDY CRABTREE, TOM RODDEN, JAMES COLLEY and LUGER, E., 2016. “‘This has to be the cats’ - personal data legibility in networked sensing systems” In: Proceedings of the 19th Conference on Computer Supported Cooperative Work. 491-502FISCHER, JOEL E., CRABTREE, ANDY, RODDEN, TOM, COLLEY, JAMES A., COSTANZA, ENRICO, JEWELL, MICHAEL O. and RAMCHURN, SARVAPALI D., 2016. 'Just Whack It on Until It Gets Hot': Working with IoT Data in the Home In: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5933-5944CARTER, CHRIS JAMES, KOENE, ANSGAR, PEREZ, ELVIRA, STATACHE, RAMONA, ADOLPHS, SVENJA, O'MALLEY, CLAIRE, RODDEN, TOM and MCAULEY, DEREK, 2016. Understanding academic attitudes towards the ethical challenges posed by social media research ACM SIGCAS Computers and Society. 45(3), 202-210VALLEJOS, ELVIRA PEREZ, KOENE, ANSGAR, CARTER, CHRIS JAMES, STATACHE, RAMONA, RODDEN, TOM, MCAULEY, DEREK, CANO, MONICA, ADOLPHS, SVENJA, O'MALLEY, CLAIRE, POTHONG, KRUAKAE and OTHERS, 2016. Juries: acting out digital dilemmas to promote digital reflections ACM SIGCAS Computers and Society. 45(3), 84-90KOENE, ANSGAR, PEREZ, ELVIRA, CARTER, CHRISTOPHER J, STATACHE, RAMONA, ADOLPHS, SVENJA, O'MALLEY, CLAIRE, RODDEN, TOM and MCAULEY, DEREK, 2016. Privacy concerns arising from internet service personalization filters ACM SIGCAS Computers and Society. 45(3), 167-171VALLEJOS, ELVIRA PEREZ, POTHONG, KRUAKAE, COLEMAN, STEPHEN, KOENE, ANSGAR, CARTER, CHRIS JAMES, STATACHE, RAMONA, RODDEN, TOM, MCAULEY, DEREK, CANO, MONICA, ADOLPHS, SVENJA and OTHERS, 2016. Juries AVSAR HUSEYIN, FISCHER JOEL E. and RODDEN TOM, 2016. Mixed method approach in designing flight decks with touch screens: A framework In: Digital Avionics Systems Conference (DASC), 2016 IEEE/AIAA 35th. 1-10AVSAR HUSEYIN, FISCHER JOEL E. and RODDEN TOM, 2016. Designing touch screen user interfaces for future flight deck operations In: Digital Avionics Systems Conference (DASC), 2016 IEEE/AIAA 35th. 1-9SARVAPALI D RAMCHURN, TRUNG DONG HUYNH, FENG WU, YUKKI IKUNO, JACK FLANN, LUC MOREAU, JOEL E FISCHER, WENCHAO JIANG, TOM RODDEN, EDWIN SIMPSON, STEVEN REECE, STEPHEN ROBERTS and NICHOLAS R JENNINGS, 2016. A Disaster Response System based on Human-Agent Collectives Journal of Artificial Intelligence Research (JAIR). 57, 661-708ALAN, ALPER T., COSTANZA, ENRICO, RAMCHURN, SARVAPALI D., FISCHER, JOEL, RODDEN, TOM and JENNINGS, NICHOLAS R., 2016. Tariff Agent: Interacting with a Future Smart Energy System at Home ACM Trans. Comput.-Hum. Interact.. 23(4), 25:1-25:28BENFORD, STEVE, CALDER, MUFFY, RODDEN, TOM and SEVEGNANI, MICHELE, 2016. On lions, impala, and bigraphs: Modelling interactions in physical/virtual spaces ACM Transactions on Computer-Human Interaction (TOCHI). 23(2), 9CLARK, LEIGH, OFEMILE, ABDULMALIK, ADOLPHS, SVENJA and RODDEN, TOM, 2016. A Multimodal Approach to Assessing User Experiences with Agent Helpers ACM TRANSACTIONS ON INTERACTIVE INTELLIGENT SYSTEMS. 6(4), BACHOUR, KHALED, WETZEL, RICHARD, FLINTHAM, MARTIN, HUYNH, TRUNG DONG, RODDEN, TOM A and MOREAU, LUC, 2015. Provenance for the People: A User-Centered Look at the W3C PROV Standard through an Online Game In: ACM CHI Conference on Human Factors in Computing Systems 2015, Seoul, South Korea, 18 - 23 Apr 2015. JOEL FISCHER, STUART REEVES, TOM RODDEN, STEVE REECE AND\tSARVAPALI RAMCHURN and DAVID JONES, 2015. Building a Birds Eye View: Collaborative work in disaster\tresponse In: Proceedings of the SIGCHI Conference on Human Factors in\tComputing Systems. ANDY CRABTREE, TOM RODDEN, PETER TOLMIE, RICHARD MORTIER, TOM LODGE, PAT BRUNDELL and NADIA PANTIDI, 2015. House Rules: The Collaborative Nature of Policy in Domestic Networks Personal and Ubiquitous Computing. 19(1), 203-215JOEL FISCHER, STUART REEVES, TOM RODDEN, STEVE REECE, SARVAPALI RAMCHURN and DAVID JONES, 2015. Building the Birds Eye View: Collaborative work in disaster response In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. EWA LUGER, LACHLAN URQUHART, TOM RODDEN and MIKE GOLEMBEWSKI, 2015. Playing the Legal Card: Using Ideation Cards to Raise Data Protection Issues within the Design Process In: CHI '15 Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 457-466KOENE, A., PEREZ, E., CARTER, C., STATACHE, R., ADOLPHS, S., O'MALLEY, C., RODDEN, T. and MCAULEY, D., 2015. Ethics of Personalized Information Filtering Internet Science (INSCI 2015): Lecture Notes in Computer Science. 9089, 123-132KOENE, A, PEREZ, EJ, CARTER, C, STATACHE, R, ADOLPHS, S, O'MALLEY, C, RODDEN, T and MCAULEY, D, 2015. Research ethics and public trust: Preconditions for continued growth of internet mediated research In: 1st International Conference on Information Systems Security and Privacy (ICISSP-2015). 163-168KHER HUI NG, VICTORIA SHIPP, RICHARD MORTIER, STEVE BENFORD, MARTIN FLINTHAM and TOM RODDEN, 2015. Understanding Food Consumption Lifecycles Using Wearable Cameras Personal and Ubiquitous Computing. 19(7), 1183-1195PEREZ VALLEJOS, E., KOENE, A., CARTER, C., STATACHE, R., RODDEN, T., MCAULEY, D., CANO, M., ADOLPHS, S., O'MALLEY, C., POTHONG, K. and COLEMAN, S., 2015. Juries: Acting out digital dilemmas to promote digital reflections SIGCAS: Computers & Society. 45(3), 84-90KOENE, A., PEREZ, E., CARTER C., STATACHE, R., ADOLPHS, S., O'MALLEY, C., RODDEN, T. and MCAULEY, D., 2015. Privacy concerns arising from internet service personalization filters SIGCAS: Computers & Society. 45(3), 167-171CARTER, C., KOENE, A., PEREZ, E., STATACHE, R., ADOLPHS, S., O'MALLEY, C., RODDEN, T. and MCAULEY, D., 2015. Understanding academic attitudes towards the ethical challenges posed by social media research SIGCAS: Computers & Society. 45(3), 202-210AVSAR HUSEYIN, FISCHER JOEL E. and RODDEN TOM, 2015. Target size guidelines for interactive displays on the flight deck In: Digital Avionics Systems Conference (DASC), 2015 IEEE/AIAA 34th. 3C4-1 - 3C4-15CRABTREE, ANDY, RODDEN, TOM, TOLMIE, PETER, MORTIER, RICHARD, LODGE, TOM, BRUNDELL, PAT and PANTIDI, NADIA, 2015. House rules: the collaborative nature of policy in domestic networks Personal and Ubiquitous Computing. 19(1), 203-215HUANG, YITONG, SKATOVA, ANYA, BEDWELL, BENJAMIN, RODDEN, TOM, SHIPP, VICTORIA and BERTENSHAW, EMMA, 2015. Designing for Human Sustainability In: Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct - MobileHCI '15. 1042-1045HUANG Y., SKATOVA A.,",
  "content_length": 40885,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:48"
}