{
  "name": "Tom J. Viering",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/pattern-recognition-bioinformatics/pattern-recognition-bioinformatics/people/tom-viering",
  "status": "success",
  "content": "Tom Viering Zoeken Sluit zoek Tom Viering I am an assistant prof in the Pattern Recognition and Bio-Informatics research group of Intelligent Systems with a focus on education. I am teaching two courses for the new AI minor program which started in September 2021. The courses are 'Introduction to Machine Learning' (TI3145TU) and 'Capstone Applied AI project' (TI3150TU). In this program engineers with various backgrounds learn the basics of AI and machine learning, and apply the learned techniques in the field for their major. I am also involved in the Master elective Fundamentals of Artificial Intelligence, and am working to develop two Massive open online courses (MOOCs) related to Machine Learning (the series AI for Engineers on EdX). I like to employ interactive Python widgets in my class to stimulate students' understanding and am interested in developing more interactive education. My research focusses on theoretical and empirical aspects of machine learning, for example on questions like how much data is necessary for learning. Other research interests are: statistical learning theory and its application to problems such as active learning, domain adaptation, and semi-supervised learning. Lately I am working on the non-monotonicity of learning curves, where surprisingly more data can lead to worse performance. What interests me is to develop learning algorithms that are guaranteed to improve with more data. Other interests are: meta learning, interpretable machine learning, generative models, online learning and deep learning. Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina Tom Viering +31 (0)15 278 4698 T.J.Viering@tudelft.nl Faculty of Electrical Engineering Mathematics and Computer Science Intelligent Systems Room 6.E.160 (6th floor) Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands linkedin",
  "content_length": 1864,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:44"
}