{
  "name": "Tomas Petricek 0001",
  "homepage": "http://tomasp.net",
  "status": "success",
  "content": "Tomas Petricek - New ways of thinking about programming Critical architecture/software theory Post-modern architects use architecture to ask critical questions about their discipline. Is it possible to embed similar criticism into the language of software? Technical dimensions We know how to study programming languages, but how to study stateful, interactive and graphical programming systems? We developed a quantitative framework for doing this. Reconstructing Commodore 64 BASIC I reconstruct the programming experience of a past system to learn what we've lost in modern programming environments. And write a simple Breakout game you can play! Histogram programming environment What if we represented programs as lists of interactions with programming environment, rather than as the final source code? Find out in this experimental data exploration environment! Data exploration for non-programmers Simple tools for data exploration that result in open and trans­parent data analyses. Also check out sample data analyses that we built at The Alan Turing Institute! Composable data visualizations Compost.js lets you compose rich interactive data visualizations from a small number of basic primitives. It is implemented in F# using Fable, but usable from plain JavaScript. Context-aware programming languages An interactive introduction to my PhD work on coeffects, a programming language abstraction for understanding how programs access the environment in which they run. Research and teaching I have a programming languages group at Charles University, lecture about programming language design and programming systems and supervise great student projects. Recent blog posts Mostly longer articles that may eventually become something bigger covering my research, F#, history and philosophy and more. See the blog archive for a complete list. Choose Your Own Adventure Calculus Sunday, 2 February 2025 What can routers at Centre Pompidou teach us about software evolution? Friday, 8 December 2023 Where programs live? Vague spaces and software systems Saturday, 11 February 2023 The Timeless Way of Programming Thursday, 1 September 2022 No-code, no thought? Substrates for simple programming for all Thursday, 28 April 2022 Pop-up from Hell: On the growing opacity of web programs Friday, 8 October 2021 Software designers, not engineers: An interview from alternative universe Monday, 19 April 2021 Is deep learning a new kind of programming? Operationalistic look at programming Wednesday, 7 October 2020 Creating interactive You Draw bar chart with Compost Friday, 17 July 2020 Data exploration calculus: Capturing the essence of exploratory data scripting Tuesday, 21 April 2020 On architecture, urban planning and software construction Wednesday, 8 April 2020 What to teach as the first programming language and why Tuesday, 3 December 2019 What should a Software Engineering course look like? Friday, 8 February 2019 Write your own Excel in 100 lines of F# Monday, 12 November 2018 Programming as interaction: A new perspective for programming language research Monday, 8 October 2018 Would aliens understand lambda calculus? Tuesday, 22 May 2018 The design side of programming language design Wednesday, 13 September 2017 Getting started with The Gamma just got easier Wednesday, 14 June 2017 Papers we Scrutinize: How to critically read papers Wednesday, 12 April 2017 The mythology of programming language ideas Wednesday, 8 March 2017 Academic papers to read I work on programming systems, data science and philosophy of computing. This list includes a couple of top papers for each category. My publications page gives a complete list. Denicek: Computational Substrate for Document-Oriented End-User Programming Tomas Petricek and Jonathan Edwards, UIST 2025 Don't Call Us, We'll Call You: Towards Mixed-Initiative Inte­ractive Proof Assistants for Programming Language Theory Human Aspects of Types and Reasoning Assistants, 2024 Schema Evolution in Interactive Programming Systems The Art, Science, and Engineering of Programming, 2024 AI Assistants: A Framework for Semi-Automated Data Wrangling IEEE Transactions on Knowledge and Data Engineering, 2023 Technical Dimensions of Programming Systems The Art, Science, and Engineering of Programming, 2023 The Gamma: Programmatic Data Exploration for Non-programmers In Proceedings of VL/HCC 2022. Linked Visualisations via Galois Dependencies In Proceedings of POPL 2022 Programming as Architecture, Design, and Urban Planning In Proceedings of Onward! Essays 2021 Composable data visualizations Journal of Functional Programming, 2021 Foundations of a live data exploration environment The Art, Science, and Engineering of Programming, 2020 What we talk about when we talk about monads The Art, Science, and Engineering of Programming, 2018 Data exploration through dot-driven development In proceedings of ECOOP 2017. Types from data: Making structured data first-class citizens in F# In Proceedings of PLDI 2016 Drafts and work in progress Various academic texts that have not been published yet. If you have any feedback on these, please let me know! The Choose-Your-Own-Adventure Calculus Tuesday, 6 May 2025 Open substrates for transparent, accessible programming Tuesday, 6 May 2025 The Rise and Fall of Extensible Programming Languages Thursday, 19 October 2023 Cultures of programming: Understanding the history of programming through controversies and technical artifacts Tuesday, 2 April 2019 I enjoy traveling and add one new picture each month. See 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024 and the first photos of 2025.",
  "content_length": 5683,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:50"
}