{
  "name": "Tomer Galanti",
  "homepage": "https://tomergalanti.github.io",
  "status": "success",
  "content": "Tomer Galanti | Deep Learning Fundamentals Lab Skip to content About & Research We are the Deep Learning Fundamentals group at Texas A&M, led by Prof. Tomer Galanti. We connect rigorous theory with practical algorithms to understand and improve modern deep learning and large language models. Theory of LLM reasoning: Which architectures, objectives, and training procedures reliably improve multi-step reasoning in LLMs? LLM-ERM [1] Auto-regressive decision trees [1] DisCO: constrained optimization for reasoning [1] Rare-token depreciation bias [1] Deep representation learning: What representations do neural networks actually learn, and which ones support strong generalization? Understanding pre-training: Supervised [1, 2, 3], and self-supervised [1, 2, 3] Representation properties: Low-rank bias [1], CRH [1], and intermediate neural collapse [1, 2] See the full list of publications. Contact: galanti@tamu.edu ·  GitHub: DLFundamentals ·  Google Scholar: Profile Texas A&M University · Department of Computer Science & Engineering Group Achleshwar Luthra Ph.D. student Deepak Suresh Master's student Shivam Singhal Master's student Rahul Pillalamari Master's student Ajay Jagannath Master's student Yash Salunkhe Master's student Aarya Bookseller Undergraduate student Priyadarsi Mishra Undergraduate student Join the Lab PhD applicants: Apply through the TAMU CSE PhD program. In your statement, describe your fit with our research areas and mention Prof. Galanti as a potential advisor. Master's & undergraduates: We welcome motivated undergraduate and Master's students to volunteer for research. Please email a short CV, transcripts, and a paragraph about your interests and skills. Teaching Special Topics in Recent Developments in Deep Learning and Large Language Models Texas A&M University, Fall 2025. Introduction to Machine Learning Texas A&M University, Spring 2025. Special Topics in Recent Developments in Deep Learning and Large Language Models Texas A&M University, Fall 2024. Statistical Learning Theory and its Applications Massachusetts Institute of Technology, Fall 2023. Statistical Learning Theory and its Applications Massachusetts Institute of Technology, Fall 2022. Deep Convolutional Neural Networks Tel Aviv University, Spring 2020. Deep Convolutional Neural Networks Tel Aviv University, Spring 2019. ↑ Top",
  "content_length": 2343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:54"
}