{
  "name": "Tommy Kaplan",
  "homepage": "http://www.cs.huji.ac.il/~tommy",
  "status": "success",
  "content": "Tommy Kaplan - תומי קפלן Prof. Tommy Kaplan - פרופ׳ תומי קפלן פרופסור בית הספר להנדסה ולמדעי המחשב בית הספר לרפואה האוניברסיטה העברית בירושלים Professor School of Computer Science and Engineering Faculty of Medicine The Hebrew University of Jerusalem, Israel Computational Biology DNA Methylation, cell-free DNA, Computational Epigenomics, Enhancers and Gene Regulation, Machine Learning Contact Information: Prof. Tommy Kaplan School of Computer Science and Engineering The Hebrew University Jerusalem 9190401 Israel E-mail: tommy.kaplan@mail.huji.ac.il Office: Rothberg B-529 Phone/Fax: +972-2-5494506 CV of Tommy (Tomer) Kaplan | Google Scholar | ORCiD Selected Publications: Jonathan Rosenski*, Ofra Sabag*, Eitan Marcus, Netanel Loyfer, Yuval Dor, Howard Cedar*, and Tommy Kaplan* The genetic basis for DNA methylation variation across tissues and development bioRxiv, 2025 Bracha-Lea Ochana*, Daniel Nudelman*, Daniel Cohen, Ayelet Peretz, Sheina Piyanzin, Ofer Gal Rosenberg, Amit Horn, Netanel Loyfer, Miri Varshavsky, Ron Raisch, Ilona Shapiro, Yechiel Friedlander, Benjamin Glaser, Hagit Hochner, Yuval Dor*, Tommy Kaplan*, and Ruth Shemer* Time is encoded by methylation changes at clustered CpG sites Cell Reports, 2025 Jonathan Rosenski, Ayelet Peretz, Judith Magenheim, Netanel Loyfer, Ruth Shemer, Benjamin Glaser, Yuval Dor*, and Tommy Kaplan* Atlas of imprinted and allele-specific DNA methylation in the human body Nature Communications, 2025 [ PR | GEN | הידען ] Genome browser session of a human genomic imprinting atlas: hg19 | Software: imprint atlas Netanel Loyfer*, Judith Magenheim*, Ayelet Peretz*, Gordon Cann, Joerg Bredno, Agnes Klochendler, Ilana Fox-Fisher, Sapir Shabi-Porat, Merav Hecht, Tsuria Pelet, Joshua Moss, Zeina Drawshy, Hamed Amini, Patriss Moradi, Sudharani Nagaraju, Dvora Bauman, David Shveiky, Shay Porat, Gurion Rivkin, Omer Or, Nir Hirshoren, Einat Carmon, Alon Pikarsky, Abed Khalaileh, Gideon Zamir, Ronit Grinbaum, Machmud Abu Gazala, Ido Mizrahi, Noam Shussman, Amit Korach, Ori Wald, Uzi Izhar, Eldad Erez, Vladimir Yutkin, Yaacov Samet, Devorah Rotnemer Golinkin, Kirsty L. Spalding, Henrik Druid, Peter Arner, A.M. James Shapiro, Markus Grompe, Alex Aravanis, Oliver Venn, Arash Jamshidi, Ruth Shemer, Yuval Dor*, Benjamin Glaser*, and Tommy Kaplan* A DNA methylation atlas of normal human cell types Nature, 2023 [GEO GSE186458 | poster | הארץ | הידען | Research Highlight] Genome browser sessions: hg19 | hg38 Software: wgbstools | UXM fragment-level deconvolution Netanel Loyfer, Jonathan Rosenski, and Tommy Kaplan wgbstools: A computational suite for DNA methylation sequencing data representation, visualization, and analysis bioRxiv, 2024 Yoel Goldstein, Ora T. Cohen, Ori Wald, Danny Bavli, Tommy Kaplan, and Ofra Benny Particle uptake in cancer cells can predict malignancy and drug resistance using machine learning Science Advances, 2024 Aleks Danov, Inbal Pollin, Eric Moon, Mengfei Ho, Brenda A. Wilson, Philippos A. Papathanos, Tommy Kaplan, and Asaf Levy Identification of novel toxins associated with the extracellular contractile injection system using machine learning Molecular Systems Biology, 2024 Miri Varshavsky, Gil Harari, Benjamin Glaser, Yuval Dor, Ruth Shemer, and Tommy Kaplan Accurate age prediction from blood using a small set of DNA methylation sites and a cohort-based machine learning algorithm Cell Reports Methods, 2023 [GP-age epigenetic clock | poster | GEO GSE207605] Megan E. McNamara*, Netanel Loyfer*, Amber J. Kiliti, Marcel O. Schmidt, Sapir Shabi-Porat, Sidharth Jain, Sarah Martinez Roth, A. Patrick McDeed IV, Nesreen Shahrour, Elizabeth Ballew, Yun-Tien Lin, Heng-Hong Li, Anne Deslattes Mays, Sonali Rudra, Anna T. Riegel, Keith Unger*, Tommy Kaplan*, and Anton Wellstein* Circulating cell-free methylated DNA reveals tissue-specific, cellular damage from radiation treatment JCI Insight, 2023 Software: wgbstools | fragment-level Markov-model deconvolution Ayelet Peretz*, Netanel Loyfer*, Sheina Piyanzin, Bracha Lea Ochana, Daniel Neiman, Judith Magenheim, Agnes Klochendler, Zeina Drawshy, Ilana Fox-Fisher, Ori Fridlich, Joshua Moss, Daniel Cohen, Hai Zemmour, Gordon Cann, Joerg Bredno, Oliver Venn, Batia Avni, Tural Alekberli, Yaacov Samet, Amit Korach, Ori Wald, Vladimir Yutkin, Uzi Izhar, Nir Pillar, Markus Grompe, Zvi Fridlender, Ariel Rokach, David Planer, Giora Landesberg, Benjamin Glaser, Ruth Shemer, Tommy Kaplan and Yuval Dor The DNA methylome of human vascular endothelium and its use in liquid biopsies Med, 2023 Jonathan Rosenski, Sagiv Shifman, and Tommy Kaplan Predicting gene knockout effects from expression data BMC Medical Genomics, 2023 [github] Aleks Danov, Ofir Segev, Avi Bograd, Yedidya Ben Eliyahu, Noam Dotan, Tommy Kaplan*, and Asaf Levy* Toxinome - The Bacterial Protein Toxin Database mBio, 2023 [Toxinome: the Bacterial toxin database] Mohammad Jaber*, Ahmed Radwan*, Netanel Loyfer*, Mufeed Abdeen, Shulamit Sebban, Thorsten Kolb, Marc Zapatka, Kirill Makedonski, Aurelie Ernst, Tommy Kaplan*, and Yossi Buganim* Comparative Parallel Multi-Omics Analysis During the Induction of Pluripotent and Trophectoderm States Nature Communications, 2022 [GEO GSE171127 | הארץ | הידען ] Asael Lubotzky, Hai Zemmour, Daniel Neiman, Marc Gotkine, Netanel Loyfer, Sheina Piyanzin, Bracha-Lea Ochana, Roni Lehmann-Werman, Daniel Cohen, Joshua Moss, Judith Magenheim, Maureen F. Loftus, Lauren Brais, Kimmie Ng, Raul Mostoslavsky, Brian M. Wolpin, Aviad Zick, Myriam Maoz, Albert Grinshpun, Anatoli Kustanovich, Chen Makranz, Jonathan E. Cohen, Tamar Peretz, Ayala Hubert, Mark Temper, Azzam Salah, Shani Avniel-Polak, Simona Grozinsky-Glasberg, Kirsty L. Spalding, Ariel Rokach, Tommy Kaplan, Benjamin Glaser, Ruth Shemer, and Yuval Dor Liquid biopsy reveals collateral tissue damage in cancer JCI Insight, 2022 Ilana Fox-Fisher, Sheina Piyanzin, Bracha Lea Ochana, Agnes Klochendler, Judith Magenheim, Ayelet Peretz, Netanel Loyfer, Joshua Moss, Daniel Cohen, Yaron Drori, Nehemya Friedman, Michal Mandelboim, Marc E Rothenberg, Julie M Caldwell, Mark Rochman, Arash Jamshidi, Gordon Cann, David Lavi, Tommy Kaplan, Benjamin Glaser, Ruth Shemer, and Yuval Dor Remote immune processes revealed by immune-derived circulating cell-free DNA eLife, 2021 Megan E. Barefoot, Netanel Loyfer, Amber J. Kiliti, A. Patrick McDeed IV, Tommy Kaplan, and Anton Wellstein Detection of Cell Types Contributing to Cancer From Circulating, Cell-Free Methylated DNA Frontiers in Genetics, 2021 Naomi Habib, Cristin McCabe, Sedi Medina, Miriam Varshavsky, Daniel Kitsberg, Raz Dvir-Szternfeld, Gilad Green, Danielle Dionne, Lan Nguyen, Jamie L. Marshall, Fei Chen, Feng Zhang, Tommy Kaplan, Aviv Regev, and Michal Schwartz Disease-associated astrocytes in Alzheimer’s disease and aging Nature Neuroscience, 2020 [GEO GSE143758] Yifat Brill-Karniely, Dvir Dror, Tal Duanis-Assaf, Yoel Goldstein, Ouri Schwob, Talya Millo, Natalie Orehov, Tal Stern, Mohammad Jaber, Netanel Loyfer, Margarita Vosk-Artzi, Hadar Benyamini, Diane Bielenberg, Tommy Kaplan, Yosef Buganim, Meital Reches and Ofra Benny Triangular correlation (TrC) between cancer aggressiveness, cell uptake capability, and cell deformability Science Advances, 6(3):eaax2861, 10.1126/sciadv.aax2861 [GEO GSE137316, GSE135193] Ronen Sadeh, Israa Sharkia, ... , Tommy Kaplan, Ruth Shemer, David Planer, Eithan Galun, Benjamin Glaser, Aviad Zik, Yuval Dor, and Nir Friedman ChIP-seq of plasma cell-free nucleosomes identifies gene expression programs of the cells of origin Nature Biotechnology, 2021 [הארץ] Hana Benchetrit, Mohammad Jaber, Valery Zayat, Shulamit Sebban, Avital Pushett, Kirill Makedonski, Zvi Zakheim, Ahmed Radwan, Noam Maoz, Rachel Lasry, Noa Renous, Michal Inbar, Oren Ram, Tommy Kaplan, and Yosef Buganim Direct Induction of the Three Pre-implantation Blastocyst Cell Types from Fibroblasts Cell Stem Cell, 2019, 10.1016/j.stem.2019.03.018 [GEO ] Joshua Moss, Judith Magenheim, Daniel Neiman, Hai Zemmour, Netanel Loyfer, Amit Korach, Yaacov Samet, Myriam Maoz, Henrik Druid, Peter Arner, Keng-Yeh Fu, Endre Kiss, Kirsty L. Spalding, Giora Landesberg, Aviad Zick, Albert Grinshpun, AM James Shapiro, Markus Grompe, Avigail Dreazan Wittenberg, Benjamin Glaser, Ruth Shemer*, Tommy Kaplan*, and Yuval Dor* Comprehensive human cell-type methylation atlas reveals origins of circulating cell-free DNA in health and disease Nature Communications, 2018, 9:5068 [GEO | github meth atlas] Dikla Cohn, Or Zuk*, and Tommy Kaplan* Enhancer Identification using Transfer and Adversarial Deep Learning of DNA Sequences bioRxiv, 2018 [enhancer_CNN github | enhancer datasets] Gil Ron, Yuval Globerson, Dror Moran, and Tommy Kaplan Promoter-Enhancer Interactions Identified from Hi-C Data using Probabilistic Models and Hierarchical Topological Domains Nature Communications, 2017, 8(1):2237 [PSYCHIC github | poster] Yuval Malka, Avital Steiman-Shimony, Eran Rosenthal, Leonor Cohen-Daniel, Eliran Arbib, Liron Argaman, Hanah Margalit, Tommy Kaplan* and Michael Berger* Post-transcriptional 3'-UTR cleavage of mRNA transcripts generates thousands of stable uncapped autonomous RNA fragments Nature Communications, 2017, 8(1):2029 [GEO ] Michael Klutstein*, Joshua Moss*, Tommy Kaplan, and Howard Cedar Contribution of epigenetic mechanisms to variation in cancer risk among tissues PNAS, 2017 Xiao-Yong Li, Melissa M. Harrison, Jacqueline E. Villalta, Tommy Kaplan*, and Michael B. Eisen* Establishment of regions of genomic activity during the Drosophila maternal to zygotic transition eLife, 2014;3:e03737 [Digest | GEO | Genome Browser] Axel Visel,... Dalit May,... Tommy Kaplan,... Edward M. Rubin, Ivan Ovcharenko, Len A. Pennacchio, John L. R. Rubenstein A High-Resolution Enhancer Atlas of the Developing Telencephalon Cell, 2013, 10.1016/j.cell.2012.12.041 Tommy Kaplan and Nir Friedman Gene Expr",
  "content_length": 19207,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:02"
}