{
  "name": "Tommaso d'Orsi",
  "homepage": "https://tommasodorsi.github.io",
  "status": "success",
  "content": "Tommaso D'Orsi Tommaso D'Orsi Assistant Professor Computing Sciences, Bocconi Email: tommaso (dot) dorsi (at) unibocconi (dot) it Office: 2-C1-17, Via Roentgen 1, 20136 Milan, Italy Research Interests Semidefinite Programming, Spectral Methods, Random Matrices, Robust Statistics, High Dimensional Statistics, Differential Privacy, Augmented-Learning. Recent & Upcoming Events [Sep. 2025] Theory Seminar, Rutgers [Sep. 2025] Workshop on Combinatorial Optimization, Cargese [Apr. 2025] Charles River Symposium on Privacy, Harvard [Mar. 2025] Theory Seminar, University of Milan [Oct. 2024] LucaFest, Simons Institute, Berkeley [Sep. 2024] Google Research Recent & Representative Papers [All Papers] Tight Differentially Private PCA via Matrix Coherence with Gleb Novikov, SODA 2026. Sparsest cut and eigenvalue multiplicities on low degree Abelian Cayley graphs [arXiv] with Chris Jones, Jake Ruotolo, Salil Vadhan and Jiyu Zhang, APPROX 2025, invited to the special issue of Theory of Computing. Private graphon estimation via sum-of-squares [arXiv] with Hongjie Chen, Jingqiu Ding, Yiding Hua, Chih-Hung Liu and David Steurer, STOC 2024. Private estimation algorithms for stochastic block models and mixture models [arXiv] with Hongjie Chen, Vincent Cohen-Addad, Alessandro Epasto, Jacob Imola, David Steurer, and Stefan Tiegel, NeurIPS 2023 (spotlight). Higher degree sum-of-squares relaxations robust against oblivious outliers [arXiv] with Rajai Nasser, Gleb Novikov and David Steurer, SODA 2023. Fast algorithm for overcomplete order-3 tensor decomposition [arXiv] with Jingqiu Ding, Chih-Hung Liu, David Steurer and Stefan Tiegel, COLT 2022. Robust Recovery for Stochastic Block Models [arXiv] with Jingqiu Ding, Rajai Nasser and David Steurer, FOCS 2021. Sparse PCA: Algorithms, Adversarial Perturbations and Certificates [arXiv] with Pravesh Kothari, Gleb Novikov and David Steurer, FOCS 2020.",
  "content_length": 1901,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:56"
}