{
  "name": "Tomoaki Otsuki",
  "homepage": "https://www.ohtsuki.ics.keio.ac.jp/home",
  "status": "success",
  "content": "Ohtsuki Lab Keio Univ.Search this siteEmbedded FilesSkip to main contentSkip to navigationOhtsuki Labwith more than 332 journal papers, 550 international conference papers, and more than 810 domestic and general conferences33 graduated Ph.D. studentsPickup News大槻教授が，Nanjing University of Posts and TelecommunicationsのVisiting Professorに就任しました．大槻教授が，University of HoustonのAdjunct Professorに就任しました．大槻教授が，APCC2025/ICETC2025にて \"Wi-Fi Sensing for Human Activity Recognition: Leveraging Deep Learning\"と題したキーノート講演及び”Semantic Communications Based on Generative AI\"と題した招待講演をしました（2025年11月28日）大槻教授が，IEEE ICDM2025 WS DM-AISC2025にて \"Wi-Fi Sensing for Human Activity Recognition: Leveraging Deep Learning and Data Mining\"と題したキーノート講演をします（2025年11月12日）以下の論文が採録決定C. Wang, X. Guan, N. Wang, H. Chen, T. Ohtsuki, and Z. Han, \"Optimal Carbon Emission Reduction Modeling Considering Energy Consumer Satisfaction in Cyber-Physical Energy System,\" IEEE Internet of Things Journal, Accepted, Nov. 2025.F. Miao, J. Lu, L. Shan, Z. Lu, O. Takyu T. Ohtsuki, and G. Gui, \"Lightweight Regularized Network for Indoor Human Multi-Task CSI Signal Recognition with Uncertainty Quantification,\" IEEE Internet of Things Journal, Accepted, Nov. 2025.Y. Huang, Z. Wang, T. Tang, T. Ohtsuki, and G. Gui, \"Dual-Stream Multi-Modal Fusion with Local-Global Attention for Remote Sensing Object Detection,\" IEEE  Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2025 (accepted)A. A. Masud, X. Shi, M. Bouazizi, and T. Ohtsuki, \"PCFEx: Point Cloud Feature Extraction for Graph Neural Networks,\" IEEE Internet of Things Journal, 2025 (accepted)Z. Li, M. Bouazizi, T. Ohtsuki, and G. Gui, \"Self-Supervised Federated Learning for UAV-IoT Systems with Dynamic Non-IID Data via Model Correlation,\" IEEE Internet of Things Journal, Accepted, Nov. 2025.L. Li, X. Yang, W. Wu, H. Wang, T. Ohtsuki, X. Fu, M. Pan, and X. Shen, \"MobiLLM: Enabling On-Device Fine-Tuning of Billion-Sized LLMs via Server-Assisted Side-Tuning,\" IEEE Journal of Selected Topics in Signal Processing, 2025 (accepted)Q. Zhu, Y. Wang, T. Ohtsuki, S. Mao, D. Niyato and G. Gui, \"Bio-Inspired Dendritic Liquid Neural Network for Robust Near-Field Positioning in B5G/6G,\" in IEEE Wireless Communications Letters, 2025 (accepted)J. Sun, H. Huang, X. Shen, H. Zhao, Y. Yin, T. Ohtsuk, and G. Gui, \"DFusion-SLAM: A Lightweight Semantic Fusion Framework for Robust Visual SLAM in Dynamic Environments,\" in IEEE Internet of Things Journal, 2025 (accepted)Z. Xiao, Y. Cao, M. Bouazizi, T. Ohtsuki and S. Mumtaz, \"A Deep Transfer Learning-Based Low-overhead Beam Prediction in Vehicle Communications,\" in IEEE Wireless Communications Letters, 2025 (accepted)以下の国際会議論文がThe 40th Annual AAAI Conference on Artificial Intelligence (AAAI-26)に採択決定L. Yao, C. Huang, S. Wang, J. Xue, H. Guo, J. Liu, P. Lin, T. Ohtsuki and M. Pan, \"Yours or Mine? Overwriting Attacks against Neural AudioWatermarking,\" AAAI-26, Singapore, Jan. 2026 (Accepted).大槻教授が，IEEE MobiCom2025 WS MobiArch2025にて \"Semantic Communications Based on Generative AI\"と題したキーノート講演をします（2025年11月8日）大槻教授が，CEATEC2025の5G/6GスペシャルデーII Day２　―5G高度化、6G最新状況と展望―　セッション5　～６G and AI～で講演します（2025年10月16日）大槻教授が，IEEE ComSoc eHealth Technical Committee PhD Schoolにて \"Beyond Noise: Generative AI-Powered Signal Processing for Accurate and Reliable Sensing\"と題したキーノート講演をします（2025年10月14日）大槻教授が，The 2025 7th International Conference on Big Data Engineering (BDE 2025) にて \"Semantic Communications Based on Generative AI\"と題したキーノート講演をします（2025年9月25日）以下の論文が採録決定Z. Xing,M. Bouazizi,and T. Ohtsuki, \"Beyond Contact: An Open-Set Biometric Identification System Using Radar-Extracted Heart Signals,\" IEEE Journal of Biomedical and Health Informatics, 2025 (accepted)M. Bouazizi, S. Yang, L. Zhaojie, Y. Yin, and T. Ohtsuki, \"Reinforcement Learning with Clustering Optimization for Antenna Parameter Adjustment in HAPS Networks,\" IEEE Access,  2025 (accepted)大槻教授が， International Conference on Trustworthy Big Data and Artificial Intelligence (ICTBAI2025)にて\"Semantic Communications Based on Generative AI\"と題したキーノート講演をしました（2025年8月23日）大槻教授が，21st IEEE VTS Asia Pacific Wireless Communications Symposium (APWCS)にて\"Semantic Communications Based on Generative AI\"と題したキーノート講演をしました（2025年8月21日）大槻教授が，2025 5th International Conference on Intelligent Communications and Computing (ICICC 2025)にてBest Paper Awardを受賞しました．以下の国際会議論文がIEEE Global Communications Conference (GLOBECOM2025)に採択決定 Z. He, M. Bouazizi, Y. Yin, and T. Ohtsuki, \"A Cross-scenario Wireless Sensing Method Based on Incremental Learning and EWCLoss Using WiFi CSI,'' IEEE Global Communications Conference (GLOBECOM2025), Taipei, Taiwan, Dec. 2025. (Accepted).M. Bouazizi, S. Mehmoof, Y. Yin, and T. Ohtsuki, \"Human Activity Recognition Using Infrared Array Sensors: A Multi-Modal Approach,'' IEEE Global Communications Conference (GLOBECOM2025), Taipei, Taiwan, Dec. 2025. (Accepted).A.E. Kalor and T. Ohtsuki, \"Reliable Real-Time Edge AI via Conformal Model Selection,'' IEEE Global Communications Conference (GLOBECOM2025), Taipei, Taiwan, Dec. 2025. (Accepted).J. Luo, Z. Li, M. Bouazizi, and T. Ohtsuki, \"Prototype-Based Clustered Federated Learning: An Efficient Framework for Non-IID Data,'' IEEE Global Communications Conference (GLOBECOM2025), Taipei, Taiwan, Dec. 2025. (Accepted).大槻教授が，電子情報通信学会RISING研究会にて\"深層学習に基づくセマンティック通信\"と題した招待講演をしました（2025年7月30日）大槻教授が，中国総合通信局及び一般社団法人電子情報通信学会中国支部主催「ICT利活用セミナー ～AI×ICTによる地域社会DXの推進～」にて，「画像生成AIに基づくセマンティック通信」と題した基調講演をしました（2025年7月24日）大槻教授とBouazizi特任准教授が，The Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC) にて\"Beyond Noise: Generative AI-Powered Signal Processing for Accurate and Reliable Sensing\"と題したワークショップを開催しました（2025年7月16日）大槻教授が，2025 7th International Artificial Intelligence Technology Conferenceにて\"Semantic Communications Based on Generative AI\"と題したキーノート講演をしました（2025年7月17日）大槻教授が，2025 7th International Conference on Computer Communication and the Internet (ICCCI)にて\"Semantic Communications Based on Generative AI\"と題したキーノート講演をしました（2025年6月28日）大槻教授が，IEEE Vehicular Technology Conference (VTC2025 Spring WS) にて\"Introduction of 6G Radio Technology Project and Activities in XGMF\"と題したキーノート講演をしました（2025年6月17日）大槻教授の電子情報通信学会誌の巻頭言「芸術」が公開されました．（2024年8月1日）大槻教授が電子情報通信学会IEICE ICT PIONEERS WEBINARシリーズで「スマートヘルスケア最前線～生体信号検出から認知症検出まで～」と題した講演をしました（2024年5月28日（火）14:00～15:00）．ご興味のある方は，こちらで御覧ください．大槻教授による巻頭言「文化財を身近にする無線伝送技術への期待」が掲載されているNHK技研R&D春号「イマーシブコンテンツ制作のための無線伝送技術 特集号」が発刊されました．大槻知明慶應義塾大学教授, University of Houston, Adjunct Professor, Nanjing University of Posts and Telecommunications, Visiting Professor1990年慶應義塾大学工学部電気工学科卒業1992年慶應義塾大学大学院工学研究科電気工学専攻修士課程修了1994年慶應義塾大学大学院工学研究科電気工学専攻博士課程修了（博士（工学））専門は通信工学，医用工学，データサイエンス等．1997年井上研究奨励賞1997年安藤博記念若手工学賞2000年エリクソン若手科学者賞2002年船井情報科学奨励賞2001年the IEEE 1st Asia-Pacific Young Researcher Award 2001第5回国際コミュニケーション財団（ICF）研究賞2011年IEEE SPCE Outstanding Service Award第27回TELECOMシステム技術賞ETRIジャーナル2012年最優秀査読者賞第9回International Conference on Communications and Networking in China 2014（CHINACOM '14），最優秀論文賞2020年矢上賞The 26th Asia-Pacific Conference on Communications (APCC2021)，最優秀論文賞Big Data Mining and Analytics, 2021 Excellent Paper AwardInternational Conference on Internet of Things, Communication and Intelligent Technology（IoTCIT）2024, 最優秀論文賞The 2024 6th International Conference on Robotics, Intelligent Control and Artificial Intelligence (RICAI2024)，最優秀論文賞The 2024 4th International Conference on Artificial Intelligence, Virtual Reality and Visualization (AIVRV 2024)，最優秀論文賞2025 5th International Conference on Intelligent Communications and Computing (ICICC 2025)，Best Paper Awardこれまでに332編以上の学術誌論文，550編以上の国際会議論文を発表．IEEE ComSoc, Asia Pacific Board, Director，電子情報通信学会通信ソサイエティ副会長，会長， IEEE Communications Society, Signal Processing for Communications and Electronics Technical Committee，委員長，電子情報通信学会無線通信システム研究会委員長，電子情報通信学会知的環境とセンサネットワーク研究会委員長，映像情報メディア学会放送技術研究会委員長, IEEE上級講師, IEEE Wireless Communications Magazine, Technical Editor, Elsevier Physical Communications, Editor等を歴任．現在，IEEE Transactions on Vehicular TechnologyのArea Editor, IEEE Communications Surveys and Tutorials, Editor．IEEE GLOBECOM 2008, SPC, IEEE ICC 2011, CTS, IEEE GLOBECOM 2012, SPC, IEEE ICC 2020, SPC, IEEE APWCS, IEEE SPAWC, IEEE VTCなど，多くの国際会議でGeneral Co-Chair, Symposium Co-Chair, TPC Co-Chair等を務める．IEEE VTC, IEEE PIMRC, IEEE WCNCなど多くの国際会議でチュートリアルや基調講演を行う．現在，国立研究開発法人科学技術振興機構（JST）戦略的国際共同研究プログラム研究主幹，総務省 情報通信審議会 情報通信技術分科会 放送システム委員会　専門委員，電子情報通信学会フェロー，Asia-Pacific Artificial Intelligence Association (AAIA)フェロー，日本工学アカデミー会員．Tomoaki Otsuki (Ohtsuki) received the B.E., M.E., and Ph.D. degrees in Electrical Engineering from Keio University, Yokohama, Japan in 1990, 1992, and 1994, respectively. He is now a professor at Keio University, an Adjunct Professor of University of Houston, and a Visiting Professor at Nanjing University of Posts and Telecommunications. From 1998 to 1999, he was at the Department of Electrical Engineering and Computer Science, University of California, Berkeley. His research interests include wireless communications, optical communications, signal processing, and information theory. Dr. Ohtsuki is the recipient of the 1997 Inoue Research Award for Young Scientist, the 1997 Hiroshi Ando Memorial Young Engineering Award, the 2000 Ericsson Young Scientist Award, the 2002 Funai Information and Science Award for Young Scientist, the IEEE 1st Asia-Pacific Young Researcher Award 2001, the 5th International Communication Foundation (ICF) Research Award, the 2011 IEEE SPCE Outstanding Service Award, the 27th TELECOM System Technology Award, the ETRI Journal's 2012 Best Reviewer Award, the 9th International Conference on Communications and Networking in China 2014 (CHINACOM '14) Best Paper Award, the 2020 Yagami Award, the 26th Asia-Pacific Conference on Communications (APCC2021) Best Paper Award, Big Data Mining and Analytics, 2021 Excellent Paper Award, the International Conference on Internet of Things, Communication and Intelligent Technology (IoTCIT) Best Pap",
  "content_length": 11767,
  "method": "requests",
  "crawl_time": "2025-12-01 14:39:59"
}