{
  "name": "Tong Xu 0001",
  "homepage": "http://staff.ustc.edu.cn/~tongxu",
  "status": "success",
  "content": "Welcome to Tong Xu's HomePage Tong Xu Ph.D, Professor School of Computer Science University of Science and Technology of China (USTC) Email: tongxu AT ustc.edu.cn Room 207, Science and Technology Laboratory Building, West Campus, USTC, Hefei, Anhui, China, 230027 Tong Xu is a Professor at USTC, China. He received the Ph.D degree of Computer Science in Jul. 2016 under the supervision of Prof. Enhong Chen. Before that, he once stayed as a visiting student co-supervised by Prof. Hui Xiong at Management Science and Information Systems Department of Rutgers, the State University of New Jersey. His research interests include Social Media Analysis, Multimodal Intelligence and other data mining related techniques. Currently, Tong serves as a senior member of China Computer Federation, and the director of Youth Working Committee for CIPS. Education Sep. 2010 ~ Jul. 2016 Ph.D Student, School of Computer Science and Technology, USTC, China. Sep. 2013 ~ Sep. 2014 Visiting Student, MSIS, Rutgers Business School, Rutgers University, USA. Sep. 2006 ~ Jun. 2010 B.S Student, Department of Mathematics, Zhejiang University, China. Major: Information and Computing Science Minor: Public Administration, Cho Kochen Honor College Industrial Experience Aug. 2017 ~ Mar. 2018 Senior Visiting Scholar, Baidu Inc., Beijing, China. Aug. 2011 ~ Dec. 2012 Research Intern, Nokia Research Center GEL, Beijing, China. Mar. 2010 ~ Aug. 2010 Development Engineer, Alibaba Technology Co., Ltd., Hangzhou, China. Teaching Experience Web Information Processing & Application (011179), Fall Semester, 2019-2024 Social Computing (COMP6223P), Spring Semester, 2021-2023 Introduction to Data Science (DS05001), Spring Semester, 2020 Introduction to Data Science (DSCI6001P), Fall Semester, 2020 Honors & Awards 2025, COLING 2025 Outstanding Paper Award 2024, IIP 2024 Best Paper Award 2023, ACL 2023 Area Chair Award (NLP Application Track) 2022, ACF Award for Outstanding Young Scientist 2021, CICAI 2021 Best Student Paper Finalist 2020, KSEM 2020 Best Paper Award 2018, Final List of CAAI Doctoral Dissertation Award 2016, ACM (Hefei) Doctoral Dissertation Award 2013, Tencent Innovation Scholarship, Grand Prize 2013, Scholarship granted by China Scholarship Council Selected Publications Survey & Benchmark Papers Chaoyou Fu, Yuhan Dai, Yondong Luo, Lei Li, Shuhuai Ren, Renrui Zhang, Zihan Wang, Chenyu Zhou, Yunhang Shen, Mengdan Zhang, Peixian Chen, Yanwei Li, Shaohui Lin, Sirui Zhao, Ke Li, Tong Xu, Xiawu Zheng, Enhong Chen, Rongrong Ji, Xing Sun, Video-MME: The First-Ever Comprehensive Evaluation Benchmark of Multi-modal LLMs in Video Analysis, In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition 2025 (CVPR'25), Nashville TN, USA, 2025. [Link] Yuanjie Lyu, Zhiyu Li, Simin Niu, Feiyu Xiong, Bo Tang, Wenjin Wang, Hao Wu, Huanyong Liu, Tong Xu*, Enhong Chen, CRUD-RAG: A Comprehensive Chinese Benchmark for Retrieval-Augmented Generation of Large Language Models, ACM Transactions on Information Systems, Accepted, 2024. [Link] Derong Xu, Wei Chen, Wenjun Peng, Chao Zhang, Tong Xu*, Xiangyu Zhao, Xian Wu, Yefeng Zheng, Enhong Chen, Large Language Models for Generative Information Extraction: A Survey, Frontiers of Computer Science, 18(186357), 2024. [Link] Shukang Yin, Chaoyou Fu, Sirui Zhao, Ke Li, Xing Sun, Tong Xu, Enhong Chen, A Survey on Multimodal Large Language Models, National Science Review, Accepted, 2024. [Link] Ziqi Wang, Boye Niu, Zipeng Gao, Zhi Zheng, Tong Xu, Linghui Meng, Zhongli Li, Jing Liu, Yilong Chen, Chen Zhu, Hua Wu, Haifeng Wang, Enhong Chen, A Survey on Parallel Reasoning, ArXiv, 2025. [Link] Conference Papers Deqiang Huang, Xinjiang Lu, Jingbo Zhou, Nijia Lu, Lifu Xin, Bo Hong, Chuanming Zhang, Tong Xu*, Enhong Chen, Uncertainty-Aware Planning for Disambiguating User Intent in Interactive LLM Agents: Application to Baidu Maps, In Proceedings of the 32nd ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD'26), San Francisco, CA, USA, 2026, Accepted. Shuochen Liu, Pengfei Luo, Chao Zhang, Yuhao Chen, Haotian Zhang, Qi Liu, Xin Kou, Tong Xu*, Enhong Chen, Look As You Think: Unifying Reasoning and Visual Evidence Attribution for Verifiable Document RAG via Reinforcement Learning, In Proceedings of the 40th Annual AAAI Conference on Artificial Intelligence (AAAI'26), Singapore, 2026, Accepted. Bo Peng, Pi Bu, Keyu Pan, Xinrun Xu, Yingxiu Zhao, Miao Chen, Yang Du, Lin Li, Jun Song, Tong Xu*, How Foundational Skills Influence VLM-based Embodied Agents: A Native Perspective, In Proceedings of the 40th Annual AAAI Conference on Artificial Intelligence (AAAI'26), Singapore, 2026, Accepted. Zenan Ying, Zhi Zheng, Huijun Hou, Tong Xu, Qi Liu, Jinke wang, Wei Chen, From Long Videos to Engaging Clips: A Human-Inspired Video Editing Framework with Multimodal Narrative Understanding, In Proceedings of the Thirty-ninth Annual Conference on Neural Information Processing Systems (NeurIPS'25), San Diego, CA, USA, 2025, Accepted. Xiangfeng Wang, Xiao Li, Yadong Wei, Xueyu Song, Yang Song, Xiaoqiang Xia, Fangrui Zeng, Zaiyi Chen, Liu Liu, Gu Xu, Tong Xu*, From Long Videos to Engaging Clips: A Human-Inspired Video Editing Framework with Multimodal Narrative Understanding, In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP'25), Suzhou, China, 2025, Accepted. Yuhao Chen, Yuanjie Lyu, Shuochen Liu, Chao Zhang, Junhui Lv, Tong Xu*, Think Wider, Detect Sharper: Reinforced Reference Coverage for Document-Level Self-Contradiction Detection, In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP'25), Suzhou, China, 2025, Accepted. Jinke Wang, Zenan Ying, Qi Liu, Wei Chen, Tong Xu*, Huijun Hou, Zhi Zheng, Think and Recall: Layer-Level Prompting for Lifelong Model Editing, In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP'25), Suzhou, China, 2025, Accepted. Wei Chen, Zhi Zheng, Lili Zhao, Huijun Hou, Tong Xu, Following Occam’s Razor: Dynamic Combination of Structured Knowledge for Multi-Hop Question Answering using LLMs, In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP'25), Suzhou, China, 2025, Accepted. Fangyuan Liu, Sirui Zhao, Kang Yin, Tong Xu, Enhong Chen, DepFormer: A Unified Framework with Bimodal Collaborative Transformer for Depression Detection, In Proceedings of the 33rd ACM International Conference on Multimedia (ACM MM'25), Dublin, Ireland, 2025, Accepted. Zheyong Xie, Shaosheng Cao, Zuozhu Liu, Zheyu Ye, Zihan Niu, Chonggang Lu, Tong Xu, Enhong Chen, Zhe Xu, Yao Hu, Wei Lu, iPET: An Interactive Emotional Companion Dialogue System with LLM-Powered Virtual Pet World Simulation, In Proceedings of the 63th Annual Meeting of the Association for Computational Linguistics (ACL'25), Vienna, Austria, 2025, Accepted. Yuanjie Lyu, Chao Zhang, Yuhao Chen, Yong Chen, Tong Xu*, Streamlining the Collaborative Chain of Models into A Single Forward Pass in Generation-Based Tasks, In Proceedings of the 63th Annual Meeting of the Association for Computational Linguistics (ACL'25), Vienna, Austria, 2025, Accepted. Qi Liu, Jingqing Ruan, Hao Li, Haodong Zhao, Desheng Wang, Jiansong Chen, Wan Guanglu, Xunliang Cai, Zhi Zheng, Tong Xu*, AMoPO: Adaptive Multi-objective Preference Optimization without Reward Models and Reference Models, In Proceedings of the 63th Annual Meeting of the Association for Computational Linguistics (ACL'25), Vienna, Austria, 2025, Accepted. Zihan Niu, Zheyong Xie, Shaosheng Cao, Chonggang Lu, Zheyu Ye, Tong Xu*, Zuozhu Liu, Yan Gao, Jia Chen, Zhe Xu, Yi Wu, Yao Hu, PaRT: Enhancing Proactive Social Chatbots with Personalized Real-Time Retrieval, In Proceedings of the 48th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR'25), Padua, Italy, 2025, Accepted. Guoqing Zhao, Qi Zhang, Shaopeng Zhai, Dazhong Shen, Tianyi Zhang, Yu Qiao, Tong Xu*, I-Lora: Iterative Merging of Routing-Tuned Low-Rank Adapters for Multi-task Learning, In Proceedings of the IEEE International Conference on Multimedia&Expo 2025 (ICME'25), Nantes, France, 2025, Accepted. Fangyuan Liu, Sirui Zhao, Tong Xu, Yu Sun, Hao Wang, Suojuan Zhang, Enhong Chen, PhysFFTFormer: A Frequency Domain-based Vision Transformer for Efficient Remote Physiological Measurement, In Proceedings of the IEEE International Conference on Multimedia&Expo 2025 (ICME'25), Nantes, France, 2025, Accepted. Songbo Yang, Ziwei Zhao, Zihang Chen, Haotian Zhang, Tong Xu, Mengxiao Zhu, Continuous Dynamic Modeling via Neural ODEs for Popularity Trajectory Prediction, In Proceedings of the 30th International Conference on Database Systems for Advanced Applications (DASFAA'25), Singapore, 2025, Accepted. Pengfei Luo, Jingbo Zhou, Tong Xu*, Yuan Xia, Linli Xu, Enhong Chen, ImageScope: Unifying Language-Guided Image Retrieval via Large Multimodal Model Collective Reasoning, In Proceedings of the Web Conference 2025 (WWW'25), Sydney, Australia, 2024, Accepted. Derong Xu, Xinhang Li, Ziheng Zhang, Zhenxi Lin, Zhihong Zhu, Zhi Zheng, Xian Wu, Xiangyu Zhao, Tong Xu*, Enhong Chen, Harnessing Large Language Models for Knowledge Graph Question Answering via Adaptive Multi-Aspect Retrieval-Augmentation, In Proceedings of the 39th Annual AAAI Conference on Artificial Intelligence (AAAI'25), Philadelphia, PA, USA, 2025, Accepted. Zipeng Gao, Qingrong Xia, Tong Xu*, Xinyu Duan, Zhi Zheng, Zhefeng Wang, Enhong Chen, Multi-branch Self-Drafting for LLM Inference Acceleration, In Proceedings of the 39th Annual AAAI Conference on Artificial Intelligence (AAAI'25), Philadelphia, PA, USA, 2025, Accepted. Tong Bao, Che Liu, Derong Xu, Zhi Zheng, Tong Xu*, MLLM-I2W: Harnessing Multimodal Large Language Model for Zero-Shot Composed Image Retrieval, In Proceedings of the 31st International Conference on Computational Linguistics (COLING'25), Abu Dhabi, UAE, 2025, Accepted. (Outstanding ",
  "content_length": 66090,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:05"
}