{
  "name": "Tongwei Ren",
  "homepage": "https://software.nju.edu.cn//rentw/index.html",
  "status": "success",
  "content": "软件学院 Tongwei REN Software Institute 电话：+86-25-83621360 EXT 915 邮箱：rentw@nju.edu.cn 地址： 办公地址：Room 915, FeiYimin Building, Nanjing University, Nanjing, 210093, China 邮编：210093 CareerWork Experience●  Professor                       Software Institute, Nanjing University, China (Jan. 2022 - present)●  Associate Professor      Software Institute, Nanjing University, China (Jun. 2014 - Dec. 2021)●  Assistant Researcher    Software Institute, Nanjing University, China (Dec. 2010 - Jun. 2014)Visting●  Visiting Scholar             School of Computing, National University of Singapore, Singapore (Jul. 2016 - Jul. 2017) ●  Research Assistant       Department of Computing, The Hong Kong Polytechnic University, China (Apr. 2008 - Dec. 2008)Education●  Doctor       Department of Computer Science and Technology, Nanjing University, China (Sep. 2006 - Jun. 2010)●  Master       Software Institute, Nanjing University, China (Sep. 2004 - Jun. 2006)●  Bachelor    Department of Computer Science and Technology, Nanjing University, China (Sep. 2000 - Jun. 2004)  ActivityCommittee Member●  ACM SIGMM China Chapter●  CCF Technical Committee on Computer Vision●  CCF Technical Committee on Multimedia Technology●  CSIG Technical Committee on Big Visual Data●  CSIG Technical Committee on Multimedia●  Jiangsu Province Society for Information Technology ApplicationConference Service●  Program Chair    International Conference on Internet Multimedia Computing and Service (2018)●  Training Chair    Global Artificial Intelligence Technology Conference (2019)●  Publicity Chair    Pacific-Rim Conference on Multimedia (2017)●  Special Session Chair    International Conference on Internet Multimedia Computing and Service (2015)●  Challenge Organizer      Video Relation Understanding Challenge in ACM Multimedia (2020)TeachingCourse●  Computer organization and architecture. Regular course for undergraduates, 2011 - present. (co-instructed with Prof. Zhiquan Jin, Haijun Wu, and Bohan Liu)●  Computer vision. Regular course for undergraduates & postgraduates, 2020 - present.●  Introduction to cloud computing. Regular course for undergraduates & postgraduates, 2010 - 2019. (co-instructed with Prof. Chuanyi Li)Textbook●  Bin Luo, Dong Shao, and Tongwei Ren. Software engineering and computing (Volume 1): Programming fundamentals of software development. China Machine Press, 2012.Excellent Student Thesis●  \"Object trajectory proposal via hierarchical volume grouping\" by Xu Sun is awarded Excellent Undergraduate Thesis of Nanjing University (the special prize) in 2018.●  \"Hashtag-centric immersive search on social media\" by Yuqi Gao is awarded Excellent Undergraduate Thesis of Nanjing University (the second prize) in 2017.●  \"Depth-aware layered edge for elastic RGB-D object proposal\" by Jing Liu is awarded Excellent Undergraduate Thesis of Jiangsu Province (the third prize) and Excellent Undergraduate Thesis of Nanjing University (the special prize) in 2016.●  \"Salient object detection in RGB-D image based on saliency fusion and propagation\" by Jingfan Guo is awarded Excellent Undergraduate Thesis of Nanjing University (the second prize) in 2015.●  \"Research on image retargeting methods selection based image features\" by Muyang Song is awarded Excellent Undergraduate Thesis of Nanjing University (the second prize) in 2013.Technique Challenge●  Xu Sun and Yuan Zi, as the primary members of Team MAGUS.Gamma, win the first place of VRU Challenge (VRD track) in MM 2019.●  Chun Tao, Haobin Guo and Xin Tan, as the primary members of Team MAGUS.EMBisPower, win the second place of CBVRP Challenge (Movie track) in MM 2019.●  Chun Tao, as a primary member of Team MAGUS.EMBisPower, wins the second place of SVU Challenge in ICME 2019.●  Ao Zhang and Haobin Guo, as the primary members of Team MAGUS.ZinG, win the top performance award (the second place tied with RNFETL) of MI3DOR Challenge in SHREC 2019 of EG 2019.●  Fan Yu and Xin Tan, as the primary members of Team MaskTransE, win the first place of PIC Challenge in ECCV 2018.●  Xin Tan, as a primary member of Team oktk1, wins the top performance award (the tenth place) of Person Counting Challenge in Baidu A*Star 2018.●  Yuqi Gao, as a primary member of Team NLPR_MMC Passerby, wins the third place of SMP Challenge in MM 2017.Innovation Competition●  Andi Li, Yuchen Qian and Yuting Zhang, as the primary members of Team MAGUS.Pi, win the second prize of the Creative Group in China University Intelligent Robot Creative Competition 2019.●  Yuting Zhang, Andi Li, and Yuchen Qian, as the primary members of Team MAGUS.Pi, win the excellence prize of the AI season in OPPO TOP University Innovation and Technology Competition 2019.ResearchInterestMy main research interest is in multimedia computing. Currently I am interested in the technological innovation and applications in media recognition and understanding.Selected Publication [ full list ]●  Xingyu Liu, Zongxing Ji, Piao Huang, and Tongwei Ren*. Real-time arbitrary video style transfer. ACM MM Asia, 2021. (Best Paper Candidate)●  Yuqi Gao, Jitao Sang, Chengpeng Fu, Zhengjia Wang, Tongwei Ren, and Changsheng Xu. Metadata connector: Exploiting  hashtag and tag for cross-OSN event search. IEEE TMM, 2021, 23: 510-523.●  Xu Sun, Xinwen Hu, Tongwei Ren*, and Gangshan Wu. Human object interaction detection via multi-level conditioned network. ACM ICMR, 2020.（Best Paper Candidate）●  Fan Yu, Haonan Wang, Tongwei Ren*, Jinhui Tang, and Gangshan Wu. Visual relation of interest detection. ACM MM, 2020.●  Xiangnan He, Jinhui Tang, Xiaoyu Du, Richang Hong, Tongwei Ren, and Tat-Seng Chua. Fast matrix factorization with non-uniform weights on missing data. IEEE TNNLS, in press.●  Sheng-hua Zhong, Yuantian Wang, Tongwei Ren*, Mingjie Zheng, Yan Liu, and Gangshan Wu. Steganographer detection via multi-scale embedding probability estimation. ACM TOMM, 2019, 15(4): 1-23.●  Xu Sun, Yuan Zi, Tongwei Ren*, Jinhui Tang and Gangshan Wu. Hierarchical visual relationship detection. ACM MM, 2019.●  Fan Yu, Haonan Wang, Tongwei Ren*, Jinhui Tang and Gangshan Wu. Instance of interest detection. ACM MM, 2019.●  Xin Tan, Chun Tao, Tongwei Ren*, Jinhui Tang and Gangshan Wu. Crowd counting via multi-layer regression. ACM MM, 2019.●  Tongwei Ren, and Ao Zhang. RGB-D salient object detection: a review. Chapter of book \"RGB-D image analysis and processing\", edited by Paul Rosin, Yu-Kun Lai, Ling Shao, and Yonghuai Liu, 2019.●  Yuqi Gao, Jitao Sang, Tongwei Ren*, and Changsheng Xu. Hashtag-centric immersive search on social media. ACM MM, 2017.●  Xindi Shang, Tongwei Ren*, Jingfan Guo, Hanwang Zhang, and Tat-Seng Chua. Video visual relation detection. ACM MM, 2017.●  Hangke Song, Zhi Liu, Huan Du, Guangling Sun, Olivier Le Meur, and Tongwei Ren. Depth-aware salient object detection and segmentation via multiscale discriminative saliency fusion and bootstrap learning. IEEE TIP, 2017, 26(9):4204-4216.●  Ran Ju, Tongwei Ren, and Gangshan Wu. StereoSnakes: Contour based consistent object extraction for stereo images. IEEE ICCV, 2015.●  Sheng-hua Zhong, Yan Liu, Feifei Ren, Jinghuan Zhang, Tongwei Ren. Video saliency detection via dynamic consistent spatio-temporal attention modelling. AAAI, 2013.●  Tongwei Ren, Yan Liu, and Gangshan Wu. Video summary quality evaluation based on 4C assessment and user interaction. Chapter of book \"Multimedia Interaction and Intelligent User Interfaces: Principles, Methods and Applications\", edited by Ling Shao, Caifeng Shan, Jiebo Luo and Minoru Etoh, 2010, 243-269.●  Tongwei Ren, Yan Liu, and Gangshan Wu. Image retargeting based on region relation graph. Chinese JOS, 2010, 21(9):2237-2249. (in Chinese)Patent●  Tongwei Ren, Jia Bei, Jingfan Guo. A salient object detection method based on saliency fusion and propogation. Patent number: 201510435772.2. (in Chinese)●  Jia Bei, Tongwei Ren, You Liang, Wei Ma, Zhongyuan Ren. Channel traffic information prediction method and application based on multidata fusion. Patent number: 201410337925.5. (in Chinese)●  Jia Bei, Tongwei Ren, Zhihong Zhao, Zhongyan Qiu, Tong Yu, and Zhongyuan Ren. Target tracking method based on soft distribution BoF. Patent number: 201410141636.8. (in Chinese)●  Tongwei Ren, Gangshan Wu, Xu Sun, and Yuantian Wang. A object trajectory proposal method based on hierarchical spatio-temporal region grouping. Appliction number: 201810569130.5. (in Chinese)●  Tongwei Ren, Gangshan Wu, and Yuantian Wang. A saliency cuts method with adaptive inputs. Appliction number: 201810191703.5. (in Chinese)●  Lei Huang, Tongwei Ren, Yuantian Wang. An object proposal method by combining region grouping and depth connectivity. Appplication number: 201711112598.3. (in Chinese)●  Jia Bei, Tongwei Ren, Heng Zhang, Yujie Yang, Qiangming Xu, Liming She, and Haolun Cai. A method and a device for content based storage, matching and restoration of web notes. Application number: 201710350594.2. (in Chinese)●  Tongwei Ren, Jia Bei, and Jing Liu. An object proposal method by combining widow scoring and super-pixel grouping. Appplication number: 201510888926.3. (in Chinese)●  Tongwei Ren, Gangshan Wu, Shuzhen Li, Ran Ju. A salient object segmentation method based on adaptive triple thresholding. Tongwei Ren Application number: 201510615075.5. (in Chinese)Team(click me ↑)",
  "content_length": 9311,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:06"
}