{
  "name": "Tong Yang 0003",
  "homepage": "https://yangtonghome.github.io",
  "status": "success",
  "content": "Tong Yang | Homepage Homepage Talks News! Photos! Tong Yang Tong Yang (杨仝) (Google Scholar) received his PHD degree in Computer Science from Tsinghua University in 2013. He visited Institute of Computing Technology, Chinese Academy of Sciences (CAS) China from 2013.7 to 2014.7. Now he is an associate professor in School of Computer Science, Peking University. Research Area: LLM, New Data Structures in Network Measurement, Databases, Data Mining, Machine Learning, and etc. 实验室长期招收本校及外校优秀本科生进行科研实习。同时常年招聘博士后研究人员。每年均有硕士与博士研究生名额，尤其硕士名额较多，欢迎联系申请！ Email: yangtongemail@gmail.com News: 09/2025: 联合360研究团队发布 TinyR1-32B 模型——以仅20k数据实现安全性能里程碑式突破：超同尺寸 Qwen3-32B 25分、超 DeepSeek-R1-0528 17分，推理性能达后者的93%；提出 Control Token 动态安全控制，打破安全与可用二选一困境，同步推出轻量安全模型 TinyR1-Safety-8B。[模型链接-32B] [模型链接-8B] [新闻链接] 08/2025: 研究团队发布 iFairy ——首个将全部参数约束在 {±1, ±i} 的 2-bit 复数量化大模型，实现无乘法、仅加法的高效推理与约1/8存储压缩，并在语言建模与下游任务上超越同尺寸全精度 LLaMA；相关论文及代码全面开源，进一步为低功耗与边缘部署提供新路径。[GitHub链接] [模型链接] [论文链接] [新闻链接] [报告视频] 08/2025: 研究团队发布 Proof2Hybrid，为首个全自动数学基准合成架构。该架构以多大语言模型流水线为核心，实现数学评测集的自动、高效构建；并据此推出首个专注于代数几何领域的基准 AlgGeoTest。[论文链接] [数据集链接] 07/2025: 受邀担任 CCF Computility 2025 “智算集群创新与实践” 论坛主席，论坛将于2025年7月在甘肃兰州举行，聚焦大模型训练推理中的智算基础设施发展与挑战。[链接] 06/2025: 研究团队发布 ScholarSearch 数据集，为首个专注于评估大语言模型在学术研究中复杂信息检索能力的基准。结果显示，即便是最强搜索增强模型 GPT-4o-search-preview 的准确率也仅为 18.83%。[论文链接] [数据集链接] 05/2025: 研究团队发布 FairyR1-32B 模型，采用“分合蒸馏”思路，实现在仅 5% 参数量下，数学与代码能力超越 DeepSeek-R1 满血版，充分探索在有限资源下实现高性能模型的可行性。[模型链接] 02/2025: 联合360研究团队发布 Tiny-R1-32B-Preview 模型，以仅 5% 参数逼近 DeepSeek-R1-671B 的性能，在数学、代码、科学三大领域全面领先 Deepseek 70B模型。[模型链接] Research: Preprint Papers Yuemeng Xu, Haoran Chen, Jiarui Guo, Mingwei Cui, Qiuheng Yin, Cheng Dong, Daxiang Kang, Xian Wu, Chenmin Sun, Peng He, Yang Gao, Lirong Lai, Kai Wang, Hongyu Wu,  Tong Yang, Xiyun Xu. Zephyrus: Scaling Gateways Beyond the Petabit-Era with DPU-Augmented Hierarchical Co-Offloading. arxiv preprint 2025. Link Liya Zhu, Peizhuang Cong, Aowei Ji, Wenya Wu, Jiani Hou, Chunjie Wu, Xiang Gao, Jingkai Liu, Zhou Huan, Xuelei Sun, Yang Yang, Jianpeng Jiao, Liang Hu, Xinjie Chen, Jiashuo Liu, Jingzhe Ding, Tong Yang, Zaiyuan Wang, Ge Zhang, Wenhao Huang. LPFQA: A Long-Tail Professional Forum-based Benchmark for LLM Evaluation. arxiv preprint 2025. Link Haozhe Wang, Haoran Que, Qixin Xu, Minghao Liu, Wangchunshu Zhou, Jiazhan Feng, Wanjun Zhong, Wei Ye, Tong Yang, Wenhao Huang, Ge Zhang, Fangzhen Lin. Reverse-Engineered Reasoning for Open-Ended Generation. arxiv preprint 2025. Link Qinyan Zhang, Xinping Lei, Ruijie Miao, FU YU, Haojie Fan, Le Chang, Jiafan Hou, Dingling Zhang, Zhongfei Hou, ZiqiangYang, puchangxin, FEI HU, Jingkai Liu, Jiaheng Liu, Tong Yang, Zaiyuan Wang, Ge Zhang, Xinjie Chen, Jianpeng Jiao, Wenhao Huang. Inverse IFEval: Can LLMs Unlearn Stubborn Training Conventions to Follow Real Instructions?. arxiv preprint 2025. Link Tongxuan Liu, Tao Peng, Peijun Yang, Xiaoyang Zhao, ... , Zirui Liu, Yanshu Wang, Tong Yang, et al. xLLM Technical Report. arxiv preprint 2025. Link | PDF Download Qinyan Zhang, Xinping Lei, Ruijie Miao, Yu Fu, Haojie Fan, Le Chang, Jiafan Hou, Dingling Zhang, Zhongfei Hou, Ziqiang Yang, Changxin Pu, Fei Hu, Jingkai Liu, Mengyun Liu, Yang Liu, Xiang Gao, Jiaheng Liu,  Tong Yang, Zaiyuan Wang, Ge Zhang, Wenhao Huang. Inverse IFEval: Can LLMs Unlearn Stubborn Training Conventions to Follow Real Instructions? arxiv preprint 2025. Link Feiyu Wang, Guoan Wang, Yihao Zhang, Shengfan Wang, Weitao Li, Bokai Huang, Shimao Chen, Zihan Jiang, Rui Xu,  Tong Yang. Fairy±i: the First 2-bit Complex LLM with All Parameters in {±1, ±i}. arxiv preprint 2025. Link | Video(中文讲解) Lin Sun, Guangxiang Zhao, Xiaoqi Jian, Yuhan Wu, Weihong Lin, Yongfu Zhu, Change Jia, Linglin Zhang, Jinzhu Wu, Junfeng Ran, Sai-er Hu, Zihan Jiang, Junting Zhou, Wenrui Liu, Bin Cui,  Tong Yang, Xiangzheng Zhang. TinyR1-32B-Preview: Boosting Accuracy with Branch-Merge Distillation. arxiv preprint 2025. Link | PDF Download Guoqi Yu, Yaoming Li, Xiaoyu Guo, Dayu Wang, Zirui Liu, Shujun Wang,  Tong Yang. LiNo: Advancing Recursive Residual Decomposition of Linear and Nonlinear Patterns for Robust Time Series Forecasting. arxiv preprint 2024. Link Shimao Chen, Zirui Liu, Zhiying Wu, Ce Zheng, Peizhuang Cong, Zihan Jiang, Yuhan Wu, Lei Su,  Tong Yang. INT-FlashAttention: Enabling Flash Attention for INT8 Quantization. arxiv preprint 2024. Link Yanshu Wang, Wenyang He,  Tong Yang. Athena: Efficient Block-Wise Post-Training Quantization for Large Language Models Using Second-Order Matrix Derivative Information. arxiv preprint 2024. Link Yanshu Wang, Wang Li, Zhaoqian Yao,  Tong Yang. QET: Enhancing Quantized LLM Parameters and KV cache Compression through Element Substitution and Residual Clustering. arxiv preprint 2024. Link Yanshu Wang,  Tong Yang, Xiyan Liang, Guoren Wang, Hanning Lu, Zhe Xu, Yaoming Li, Weitao Li. Art and Science of Quantizing Large-Scale Models: A Comprehensive Overview. arxiv preprint 2024. Link Peizhuang Cong, Aomufei Yuan, Shimao Chen, Yuxuan Tian, Bowen Ye,  Tong Yang. Prediction Is All MoE Needs: Expert Load Distribution Goes from Fluctuating to Stabilizing. arxiv preprint 2024. PDF Download Papers in 2026 Zhuochen Fan, Zhongxian Liang, Zirui Liu, Dayu Wang, Dong Wen, Wenjun Li,  Tong Yang, Yuzhou Liu, Weizhe Zhang. PBSketch: Finding Periodic Burst Items in Data Streams. SIGKDD 2026. Yuanpeng Li, Xian Niu, Yikai Zhao,  Tong Yang, Yannan Hu, Yuchao Zhang, Xiangwei Deng, Qiuheng Yin, Ziyun Zhang, Ruwen Zhang, Yisen Hong, Kaicheng Yang, Ruijie Miao, Kun Meng, Dahui Wang, Yong Cui. TitanLog: Hierarchical and Elastic Logging for High-speed Network Data Stream. IEEE/ACM Transactions on Networking (ToN) 2026. PDF Download Mengbo Wang, Zhuochen Fan, Dayu Wang, Guorui Xie, Qing Li, Zeyu Luan, Yong Jiang,  Tong Yang, Mingwei Xu. RatioSketch: Towards More Accurate Frequency Estimation in Data Streams via a Lightweight Neural Network. AAAI 2026. Papers in 2025 Ce Zheng, Zhouran Shi, Ruijie Miao, Wenpu Liu,  Tong Yang, Bin Cui, Steve Uhlig. Answering Subset Query over Multi-Attribute Data Streams using Hyper-USS. IEEE Transactions on Knowledge and Data Engineering (TKDE) 2025. PDF Download Yuhan Wu, Fenghao Dong, Qizhi Chen, Aomufei Yuan, Kaicheng Yang, Hanglong Lv,  Tong Yang, Wenrui Liu, Gaogang Xie. PipHeap: Approximate Heap in the Pipeline Empowering Network Measurement. IMC 2025. PDF Download Yuhan Wu, Hanbo Wu, Xilai Liu, Yuxuan Tian, Yikai Zhao,  Tong Yang, Rui Qiu, Kaicheng Yang, Sha Wang, Tao Li, Lihua Miao, Gaogang Xie. Approaching 100% Confidence in Stream Summary through ReliableSketch. IMC 2025. PDF Download Zhuochen Fan#, Ruixin Wang#, Zihan Jiang# (# co-first authors), Ruwen Zhang,  Tong Yang, Sha Wang, Yuhan Wu, Ruijie Miao, Kaicheng Yang, Bui Cui. SandwichSketch: A More Accurate Sketch for Frequent Object Mining in Data Streams. IEEE Transactions on Knowledge and Data Engineering (TKDE) 2025. PDF Download Peizhuang Cong, Yuchao Zhang, Jun Wang, Wendong Wang,  Tong Yang, Dan Li, and Ke Xu. I2BGP: A Privacy-Preserving Intra-AS State-Assisted Inter-AS Routing Scheme. IEEE Transactions on Networking (ToN) 2025. Peizhuang Cong,  Tong Yang, Yuchao Zhang, Wendong Wang, Ke Xu. MICO: Efficient Query Scheduling for Multi-Cloud Deployed LLM Inference Service. SCIENCE CHINA Information Science (SCIS) 2025. PDF Download Ping Gong, Jiawei Yi, Shengnan Wang, Juncheng Zhang, Zewen Jin, Ouxiang Zhou, Ruibo Liu, Guanbin Xu, Youhui Bai, Bowen Ye, Kun Yuan,  Tong Yang, Gong Zhang, Renhai Chen, Feng Wu, Cheng Li. HATA: Trainable and Hardware-Efficient Hash-Aware Top-k Attention for Scalable Large Model Inference. ACL 2025. PDF Download Zirui Liu, Zihan Jiang, An Zhang, Zhouran Shi, Yuxuan Tian,  Tong Yang. Measuring Item Freshness in Data Streams. SIGKDD 2025. PDF Download Zhuochen Fan, Yalun Cai, Siyuan Dong, Qiuheng Yin, Tianyu Bai, Hanyu Xue, Peiqing Chen, Yuhan Wu,  Tong Yang, Bin Cui. Per-Flow Quantile Estimation using M4 Framework. IEEE Transactions on Knowledge and Data Engineering (TKDE) 2025. PDF Download Peizhuang Cong, Qizhi Chen, Haochen Zhao,  Tong Yang. Baton: Enhancing Batch-wise Inference Efficiency for Large Language Models via Dynamic Re-batching. The Web Conf (WWW) 2025. PDF Download | Link Zirui Liu, Hailin Zhang, Boxuan Chen, Zihan Jiang, Yikai Zhao, Yangyu Tao,  Tong Yang, Bin Cui. CAFE+: Towards Compact, Adaptive, and Fast Embedding for Large-scale Online Recommendation Models. ACM TOIS 2025. PDF Download Yikai Zhao, Wei Zhou, Wenchen Han, Zheng Zhong, Yinda Zhang, Xiuqi Zheng,  Tong Yang, Bin Cui. Achieving Top-K-fairness for Finding Global Top-K Frequent Items. IEEE TKDE 2025. PDF Download Qilong Shi, Xirui Li, Hanyue Zheng,  Tong Yang, Yangyang Wang, Mingwei Xu. HeavyLocker: Lock Heavy Hitters in Distributed Data Streams. ACM SIGKDD 2025. PDF Download Jiarui Guo, Boxuan Chen, Kaicheng Yang,  Tong Yang, Zirui Liu, Qiuheng Yin, Sha Wang, Yuhan Wu, Xiaolin Wang, Bin Cui, Tao Li, Xi Peng, Renhai Chen, Gong Zhang. HourglassSketch: An Efficient and Scalable Framework for Graph Stream Summarization. IEEE ICDE 2025. PDF Download Zirui Liu, Xian Niu, Wei Zhou, Yisen Hong, Zhouran Shi,  Tong Yang, Yuchao Zhang, Yuhan Wu, Yikai Zhao, Zhuochen Fan, Bin Cui. Extendible RDMA-based Remote Memory KV Store with Dynamic Perfect Hashing Index. IEEE ICDE 2025. PDF Download Zhuochen Fan, Yalun Cai, Zirui Liu, Jiarui Guo, Xin Fan,  Tong Yang, Bin Cui. CuckooGraph: A Scalable and Space-Time Efficient Data Structure for Large-Scale Dynamic Graphs. IEEE ICDE 2025. PDF Download Yanshu Wang, Jianan Ji, Chao-Hsuan Liu, Hengyang Zhou,  Tong Yang. DaVinci Sketch: A Versatile Sketch for Efficient and Comprehensive Set Measurements. IEEE ICDE 2025. PDF Download Ruijie Miao, Xiangwei Deng, Zicang Xu, Ziyun Zhang,  Tong Yang. LETFramework: Let the Universal Sketch be Accurate. IEEE ICDE 2025. PDF Download Selected Publications Tong Yang, Jie Jiang, Peng Liu, Qun Huang, Junzhi Gong, Yang Zhou, Rui Miao, Xiaoming Li, Steve Uhlig. Elastic Sketch: Adaptive and Fast Network-wide Measurements. AC",
  "content_length": 49393,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:05"
}