{
  "name": "Toni Lasilla",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/1542/dr-toni-lassila",
  "status": "success",
  "content": "Dr Toni Lassila | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Dr Toni Lassila Position: Lecturer Areas of expertise: numerical algorithms; computational fluid dynamics; reduced order models; cardiovascular modelling; generative deep learning; virtual in-silico trials; physics-informed neural neural networks Email: T.Lassila@leeds.ac.uk Phone: +44(0)113 343 3724 Location: 3.35 Sir William Henry Bragg Building Website: Googlescholar | Researchgate | ORCID Profile Toni has a doctoral degree in Mathematics with expertise in numerical methods in cardiovascular modelling, reduced order models, and uncertainty quantification. He has previously worked at the Ecole Polytechnique Federale de Lausanne and the University of Sheffield, before joining the University of Leeds in August 2018. He has co-supervised five PhD students in the past, and has been involved with several European projects (ERC and FP7/H2020). Responsibilities Lead for Industrial Placement Year in School of Computer Science Research interests Toni's research interests are in the field of numerical methods for partial differential equations, specifically within the topics of reduced order models and uncertainty quantification. Applications of these methods can be found in the computational fluid dynamics simulations for the diagnosis and treatment of cardiovascular and cerebrovascular diseases. In the past, he has worked on the modelling of cardiovascular system, both in terms of the electrophysiology and the ventricular fluid dynamics. His current work focuses on combining patient-specific imaging and sensing with mathematical modelling to enhance the diagnosis and treatment of vascular diseases, while taking into account the physiological variability of vascular flow and its effects in the simulation model predictions. More recently, he is working on techniques for in-silico trials, meaning the generation of evidence through computational simulations on virtual patients to support the medical device R&D and approval process. He is also interested in deep learning generative models in synthetic image generation, and physics-informed neural networks for accelerating the simulation of cardiovascular problems. <h4>Research projects</h4> <p>Some research projects I'm currently working on, or have worked on, will be listed below. Our list of all <a href=\"https://eps.leeds.ac.uk/dir/research-projects\">research projects</a> allows you to view and search the full list of projects in the faculty.</p> Deep Learning with Simulated Data Qualifications M.Sc. DSc. (Tech.) Professional memberships IEEE (Institute of Electrical and Electronics Engineers) Student education I am available to supervise self-funded or externally-funded PhD projects e.g. on the following topics (details to be discussed with the candidate): “Generative machine learning models for the cerebral vasculature from large-scale imaging and clinical studies” “Physics-informed neural networks and model discovery for cardiac mechanics” “Vascular flow simulation directly from medical images to support automated workflows for in-silico trials” If you are motivated student with a computer science MSc and a strong track record and are looking for funding to do a PhD project, please contact me to discuss possible funding sources that you could apply for. Research groups and institutes Computing in Biology, Medicine and Health Artificial Intelligence Computational Science and Engineering Current postgraduate researchers Michael MacRaild <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Projects <li><a href=\"//phd.leeds.ac.uk/project/2358-medical-image-synthesis-using-generative-machine-learning-models-for-testing-public-health-hypotheses-related-to-ischemic-stroke-risk-(csc-only)\">Medical image synthesis using generative machine learning models for testing public health hypotheses related to ischemic stroke risk (CSC ONLY)</a></li> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 4837,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:09"
}