{
  "name": "Tony Nowatzki",
  "homepage": "http://www.cs.ucla.edu/~tjn",
  "status": "success",
  "content": "Overview · Tony Nowatzki Tony Nowatzki Associate Professor of Computer Science @UCLA Home PolyArch Research Publications Teaching Contact Blog Linked In -- CV -- DBLP About I am an associate professor of Computer Science at the University of California, Los Angeles. In my research group, we design next generation computer architectures and their supporting compilers. Broadly, my research is about breaking and reforming traditional abstractions across applications, programming languages, compilers, the hardware/software interface, and microarchitectures, with the goal of enabling high productivity and performance in an increasingly parallel and heterogeneous computing landscape. Please see the PolyArch Research website for more details. Recruiting I am actively recruiting new Ph.D. students. I am looking for highly motivated, hard-working students with experience in architecture design, RTL, compilers, architecture simulators, and more. See the recruiting page on the PolyArch website for more details. Bio Tony Nowatzki is an associate professor of computer science at the University of California, Los Angeles, where he leads the PolyArch Research Group. He joined UCLA in 2017 after completing his PhD at the University of Wisconsin â Madison. His research interests include computer architecture, microarchitecture, hardware specialization, and compiler codesign. His work has been recognized with four IEEE Micro Top Picks awards, CACM Research Highlights, a PLDI Distinguished Paper Award, HPCA Best Paper runner up award, and an IEEE Best of CAL award. More About Me I joined UCLA in January 2017. Before that I worked in the Vertical research group at the University of Wisconsin - Madison (wisconsin webpage). My thesis research studied modularized processor cores, which are high-performance cores separated into specialized processors or accelerators towards broad program behaviors. I designed new accelerators, created novel architectural modeling techniques, and developed an optimization based instruction scheduler for this hardware. I have google to thank for the 2014 Fellowship in Computer Architecture, which supported me tremendously through grad school. I did my undergraduate studies at the University of Minnesota (my home state <3) in both Computer Science and Computer Engineering, and was a research assistant at the Laboratory for Computational Science and Engineering (LCSE).",
  "content_length": 2419,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:13"
}