{
  "name": "Tony Field",
  "homepage": "http://wp.doc.ic.ac.uk/ajf",
  "status": "success",
  "content": "Tony Field | Reader in Performance Engineering Department of Computing Tony Field Reader in Performance Engineering Home Research Publications Teaching The Haskell Tests Fly Fishing I am a Reader in Performance Engineering in the Department of Computing at Imperial College London. I have recently (partially) retired, having spent more than 15 years as Director of Undergraduate Studies. My main research interest is performance engineering, with an emphasis on software performance analysis and optimisation using  performance models. I am also interested in high-level languages, formalisms and tools that can be used to build performant software whilst reducing the software engineering burden. Related to this I maintain a keen interest in the Haskell programming language and its many applications. I am currently developing a system called Morse, a system written in Haskell for automatically solving cryptic crossword puzzles, with explanation of the wordplays. For example (Spectator 2407, 11a, solution time 0.27s): The clue is: After hint turned up, end of match had leftist outwitted (7) I think the solution is \"EUCHRED\" Let me explain... I think the answer is supposed to mean \"outwitted\" I think \"after\" indicates a charade (juxtaposition) of two sub-clues: 1: I think \"turned up\" indicates a reversal The text \"hint\" resolves to \"cue\" Reversing this gives \"euc\" 2: I think \"had\" indicates a charade (juxtaposition) of two sub-clues: 1: I think \"end of\" indicates 'take last letter(s)' \"match\" is verbatim text The result is then \"h\" 2: The text \"leftist\" resolves to \"red\" So, the two components to be juxtaposed are \"h\" and \"red\" The result is \"hred\" The two components to be juxtaposed are \"euc\" and \"hred\" The result is \"euchred\" Print Email to a Friend Email to a Friend Page URL: http://wp.doc.ic.ac.uk/ajf/ Your Information: Your Name Your Email Friend’s Information: Friend’s Name Friend’s Email Close Login Main campus address: Imperial College London, South Kensington Campus, London SW7 2AZ, tel: +44 (0)20 7589 5111 Home Research Publications Teaching The Haskell Tests Fly Fishing © Copyright 2014 – Imperial College London",
  "content_length": 2151,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:10"
}