{
  "name": "Tony P. Pridmore",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/tony.pridmore",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Tony PridmoreHead of School of Computer Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom C32 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKwork0115 84 66510fax0115 95 14254tony.pridmore@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~tpp BiographyTony Pridmore is Professor and Head of the School of Computer Science at the University of Nottingham. He holds a BSc in Computer Science from the University of Warwick and a PhD in Computer Vision from the Department of Psychology, University of Sheffield. Before returning to Computer Science in 1999 he held academic posts in both Information and Manufacturing Engineering.Expertise SummaryBuilding on his theoretical and applied work in computer vision, Tony's current focus is the development of large-scale infrastructures supporting research in plant phenomics - the automatic, objective measurement of the structural and functional properties of large numbers of (usually food-producing) plants. He is Director of PhenomUK, the UK national plant phenotyping network, UK Scientific Representative on the General Assembly of the ESFRI supported, pan-European infrastructure EMPHASIS and a member of the Scientific and Industrial Advisory Board of ELIXIR. Tony is co-founder and a member of the management board of the Hounsfield Facility, a unique installation providing automated extraction of 3D structural descriptions of plants from X-ray data.Research SummaryMy research interests centre on the establishment and maintenance of large scale, distributed research infrastructures making plant phenotyping facilities available nationally and internationally.Selected Publications MICHAEL POUND, ALEXANDRA J BURGESS, MICHAEL H WILSON, JONATHAN A ATKINSON, MARCUS GRIFFITHS, AARON S JACKSON, ADRIAN BULAT, GEORGIOS TZIMIROPOULOS, DARREN M WELLS, ERIK H MURCHIE, TONY P PRIDMORE and ANDREW P FRENCH, 2016. Deep Machine Learning provides state-of-the-art performance in image-based plant phenotyping Biorxiv. Available at: <http://biorxiv.org/content/early/2016/05/12/053033> POUND, MICHAEL P.AND FRENCH, ANDREW P.AND FOZARD, JOHN A.AND MURCHIE, ERIK H.AND PRIDMORE, TONY P., 2016. A patch-based approach to 3D plant shoot phenotyping Machine Vision and Applications. 1-13LOBET, GUILLAUME, POUND, MICHAEL P, DIENER, JULIEN, PRADAL, CHRISTOPHE, DRAYE, XAVIER, GODIN, CHRISTOPHE, JAVAUX, MATHIEU, LEITNER, DANIEL, MEUNIER, FELICIEN, NACRY, PHILIPPE, PRIDMORE, TONY P and SCHNEPF, ANDREA, 2015. Root system markup language: toward a unified root architecture description language. Plant physiology. 167(3), 617-27WANG, XIAOMENG, VALSTAR, MICHEL, MARTINEZ, BRAIS, HARIS KHAN, MUHAMMAD and PRIDMORE, TONY, 2015. TRIC-track: Tracking by Regression With Incrementally Learned Cascades In: The IEEE International Conference on Computer Vision (ICCV). View all publications Past ResearchPrevious work has addressed issues in binocular stereo, knowledge-based image interpretation (particularly the interpretation of images of mechanical and other drawings), visual tracking and bioimage analysis. All my work has mixed the development of novel methods with their application to real-world problems. DIETRICH D, PANG L, KOBAYASHI A, FOZARD JA, BOUDOLF V, BHOSALE R, ANTONI R, NGUYEN T, HIRATSUKA S, FUJII N, MIYAZAWA Y, BAE TW, WELLS DM, OWEN MR, BAND LR, DYSON RJ, JENSEN OE, KING JR, TRACY SR, STURROCK CJ, MOONEY SJ, ROBERTS JA, BHALERAO RP, DINNENY JR, RODRIGUEZ PL, NAGATANI A, HOSOKAWA Y, BASKIN TI, PRIDMORE TP, DE VEYLDER L, TAKAHASHI H and BENNETT MJ, 2017. Root hydrotropism is controlled via a cortex-specific growth mechanism. Nature plants. 3, 17057GIBBS, JONATHON A., POUND, MICHAEL, FRENCH, ANDREW P., WELLS, DARREN M., MURCHIE, ERIK and PRIDMORE, TONY, 2017. Approaches to three-dimensional reconstruction of plant shoot topology and geometry FUNCTIONAL PLANT BIOLOGY. 44(1), 62-75LUENGO, IMANOL, DARROW, MICHELE C., SPINK, MATTHEW C., SUN, YING, DAI, WEI, HE, CYNTHIA Y., CHIU, WAH, PRIDMORE, TONY, ASHTON, ALUN W., DUKE, ELIZABETH M. H., BASHAM, MARK and FRENCH, ANDREW P., 2017. SuRVoS: Super-Region Volume Segmentation workbench JOURNAL OF STRUCTURAL BIOLOGY. 198(1), 43-53DALY, KEITH R, TRACY, SAOIRSE R, CROUT, NEIL M J, MAIRHOFER, STEFAN, PRIDMORE, TONY P, MOONEY, SACHA J and ROOSE, TIINA, 2017. Quantification of root water uptake in soil using X-ray computed tomography and image-based modelling. Plant, cell & environment. TARDIEU F, CABRERA-BOQUET L, PRIDMORE T and BENNETT MJ, 2017. Plant Phenomics, From Sensors to Knowledge Current Biology. 27, R770-R783MICHAEL POUND, JONATHAN ATKINSON, ALEXANDRA TOWNSEND, MICHAEL WILSON, MARCUS GRIFFITHS, AARON JACKSON, ADRIAN BULAT, GEORGIOS TZIMIROPOULOS, DARREN WELLS, ERIK MURCHIE, TONY PRIDMORE and ANDREW FRENCH, 2017. Deep Machine Learning provides state-of-the-art performance in image-based plant phenotyping Gigascience. gix083POUND, MICHAEL P.AND FRENCH, ANDREW P.AND FOZARD, JOHN A.AND MURCHIE, ERIK H.AND PRIDMORE, TONY P., 2016. A patch-based approach to 3D plant shoot phenotyping Machine Vision and Applications. 1-13MICHAEL POUND, ALEXANDRA J BURGESS, MICHAEL H WILSON, JONATHAN A ATKINSON, MARCUS GRIFFITHS, AARON S JACKSON, ADRIAN BULAT, GEORGIOS TZIMIROPOULOS, DARREN M WELLS, ERIK H MURCHIE, TONY P PRIDMORE and ANDREW P FRENCH, 2016. Deep Machine Learning provides state-of-the-art performance in image-based plant phenotyping Biorxiv. Available at: <http://biorxiv.org/content/early/2016/05/12/053033> BURGESS, ALEXANDRA J., RETKUTE, RENATA, PRESTON, SIMON P., JENSEN, OLIVER E., POUND, MICHAEL P., PRIDMORE, TONY P. and MURCHIE, ERIK H., 2016. The 4-Dimensional Plant: Effects of Wind-Induced Canopy Movement on Light Fluctuations and Photosynthesis Frontiers in Plant Science. 7, 1392KRISTAN, MATEJ, LEONARDIS, ALES, MATAS, JIRI, FELSBERG, MICHAEL, PFLUGFELDER, ROMAN, CEHOVIN, LUKA, VOJIR, TOMAS, HAGER, GUSTAV, LUKEZIC, ALAN, FERNANDEZ, GUSTAVO, GUPTA, ABHINAV, PETROSINO, ALFREDO, MEMARMOGHADAM, ALIREZA, GARCIA-MARTIN, ALVARO, MONTERO, ANDRES SOLIS, VEDALDI, ANDREA, ROBINSON, ANDREAS, MA, ANDY J., VARFOLOMIEIEV, ANTON, ALATAN, AYDIN, ERDEM, AYKUT, GHANEM, BERNARD, LIU, BIN, HAN, BOHYUNG, MARTINEZ, BRAIS, CHANG, CHANG-MING, XU, CHANGSHENG, SUN, CHONG, KIM, DAIJIN, CHEN, DAPENG, DU, DAWEI, MISHRA, DEEPAK, YEUNG, DIT-YAN, GUNDOGDU, ERHAN, ERDEM, ERKUT, KHAN, FAHAD, PORIKLI, FATIH, ZHAO, FEI, BUNYAK, FILIZ, BATTISTONE, FRANCESCO, ZHU, GAO, ROFFO, GIORGIO, SUBRAHMANYAM, GORTHI R. K. SAI, BASTOS, GUILHERME, SEETHARAMAN, GUNA, MEDEIROS, HENRY, LI, HONGDONG, QI, HONGGANG, BISCHOF, HORST, POSSEGGER, HORST, LU, HUCHUAN, LEE, HYEMIN, NAM, HYEONSEOB, CHANG, HYUNG JIN, DRUMMOND, ISABELA, VALMADRE, JACK, JEONG, JAE-CHAN, CHO, JAE-IL, LEE, JAE-YEONG, ZHU, JIANKE, FENG, JIAYI, GAO, JIN, CHOI, JIN YOUNG, XIAO, JINGJING, KIM, JI-WAN, JEONG, JIYEOUP, HENRIQUES, JOAO F., LANG, JOCHEN, CHOI, JONGWON, MARTINEZ, JOSE M., XING, JUNLIANG, GAO, JUNYU, PALANIAPPAN, KANNAPPAN, LEBEDA, KAREL, GAO, KE, MIKOLAJCZYK, KRYSTIAN, QIN, LEI, WANG, LIJUN, WEN, LONGYIN, BERTINETTO, LUCA, RAPURU, MADAN KUMAR, POOSTCHI, MAHDIEH, MARESCA, MARIO, DANELLJAN, MARTIN, MUELLER, MATTHIAS, ZHANG, MENGDAN, ARENS, MICHAEL, VALSTAR, MICHEL, TANG, MING, BAEK, MOOYEOL, KHAN, MUHAMMAD HARIS, WANG, NAIYAN, FAN, NANA, AL-SHAKARJI, NOOR, MIKSIK, ONDREJ, AKIN, OSMAN, MOALLEM, PAYMAN, SENNA, PEDRO, TORR, PHILIP H. S., YUEN, PONG C., HUANG, QINGMING, MARTIN-NIETO, RAFAEL, PELAPUR, RENGARAJAN, BOWDEN, RICHARD, LAGANIERE, ROBERT, STOLKIN, RUSTAM, WALSH, RYAN, KRAH, SEBASTIAN B., LI, SHENGKUN, ZHANG, SHENGPING, YAO, SHIZENG, HADFIELD, SIMON, MELZI, SIMONE, LYU, SIWEI, LI, SIYI, BECKER, STEFAN, GOLODETZ, STUART, KAKANURU, SUMITHRA, CHOI, SUNGLOK, HU, TAO, MAUTHNER, THOMAS, ZHANG, TIANZHU, PRIDMORE, TONY, SANTOPIETRO, VINCENZO, HU, WEIMING, LI, WENBO, HUEBNER, WOLFGANG, LAN, XIANGYUAN, WANG, XIAOMENG, LI, XIN, LI, YANG, DEMIRIS, YIANNIS, WANG, YIFAN, QI, YUANKAI, YUAN, ZEJIAN, CAI, ZEXIONG, XU, ZHAN, HE, ZHENYU and CHI, ZHIZHEN, 2016. The Visual Object Tracking VOT2016 Challenge Results COMPUTER VISION - ECCV 2016 WORKSHOPS, PT II. 9914, 777-823LOBET, GUILLAUME, POUND, MICHAEL P, DIENER, JULIEN, PRADAL, CHRISTOPHE, DRAYE, XAVIER, GODIN, CHRISTOPHE, JAVAUX, MATHIEU, LEITNER, DANIEL, MEUNIER, FELICIEN, NACRY, PHILIPPE, PRIDMORE, TONY P and SCHNEPF, ANDREA, 2015. Root system markup language: toward a unified root architecture description language. Plant physiology. 167(3), 617-27NGUYEN T and PRIDMORE TP, 2015. Adaptive tracking via multiple appearance models and multiple linear searches In: 10th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications. (VISAPP 2015). BURGESS, A.J., RETKUTE, R., POUND, M.P., PRESTON, S.P., PRIDMORE, T.P., FOULKES, J., JENSEN, O.E. and MURCHIE, E.H., 2015. High-resolution 3D structural data quantifies the impact of photoinhibition on long term carbon gain in wheat canopies in the field. Plant physiology. MAIRHOFER, STEFAN, STURROCK, CRAIG, WELLS, DARREN M., BENNETT, MALCOLM J., MOONEY, SACHA J. and PRIDMORE, TONY P., 2015. On the evaluation of methods for the recovery of plant root systems from X-ray computed tomography images FUNCTIONAL PLANT BIOLOGY. 42(5), 460-470MAIRHOFER S, STURROCK C, BENNETT MJ, MOONEY SJ and PRIDMORE T, 2015. Extracting Multiple Interacting Root Systems using x-ray Micro Computed Tomography The Plant Journal. 84(5), 1034-43MAIRHOFER, STEFANAND JOHNSON, JAMESAND STURROCK, CRAIG J.AND BENNETT, MALCOLM J.AND MOONEY, SACHA J.AND PRIDMORE, TONY P., 2015. Visual tracking for ",
  "content_length": 42487,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:12"
}