{
  "name": "Tony Russell-Rose",
  "homepage": "https://www.gold.ac.uk/computing/staff/t-russell-rose",
  "status": "success",
  "content": "Dr Tony Russell-Rose | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Reader in Computer Science Department Computing Email t.russell-rose (@gold.ac.uk) Links X@tonygrr Lab/researchuxlabs.co.uk/rd LinkedInlinkedin.com/in/tonyrussellrose Research gate Google scholar Blogisquared.wordpress.com Tony's research focuses on the intersection of natural language processing, information retrieval and user experience. Tony Russell-Rose began his career with a PhD investigating the use of statistical and knowledge-based language modelling to improve the accuracy of handwriting recognition systems. He was then awarded a Royal Academy of Engineering Fellowship at HP Labs working on speech recognition interfaces and a further fellowship at BT Labs working on intelligent agents for information retrieval. He then joined Canon Research Centre Europe as Senior Research Scientist, where he was promoted to Head of Information Retrieval R&D. He was then appointed Leader of Language Technology at Reuters, where he established a global centre of excellence for NLP. After a period heading up software development at the Advanced Computation Lab of CR-UK, he was approached by Oracle to lead their European UX practice. He is now Director of UXLabs and also Royal Academy of Engineering Visiting Professor at Essex University. He was promoted to Reader in Computer Science in September 2022. Academic qualifications PhD Computer Science, Nottingham Trent University MSc Cognition, Computing & Psychology, Warwick University BEng (2:1) Production Engineering & Production Management, Nottingham University Teaching and supervision Human-computer interaction & user experience AI and natural language processing Search & information retrieval Research interests Tony's research interests centre on human information interaction; in particular the challenges involved in understanding and modelling the context in which people interact with information and social systems and in developing novel interaction metaphors and technologies that apply that understanding. His approach combines theory with experimentation, in analyzing existing practices, building novel interactive technologies and systems, and studying their impact on real users in naturalistic settings. Much of his recent work has focussed on the challenges involved in searching, navigating and sense-making within complex information spaces. This has three primary facets: investigation of novel NLP methods for extracting structure and meaning from unstructured information sources development of new interaction and visualisation techniques for exploring complex information spaces empirical studies of human information-seeking behaviour, in particular the user experience of exploratory search and knowledge discovery applications. Tony has ongoing research collaborations with a variety of organisations, including City University’s School of Informatics, Essex University’s NLP group, Glasgow University’s Information Retrieval group and Sheffield University’s Information Retrieval group. Publications and research outputs Book SectionMining search logs for usage patterns Russell-Rose, Tony ORCID logo ; and Clough, Pauk. 2015. Mining search logs for usage patterns. In: Markus Hofmann and Andrew Chisholm, eds. Text Mining and Visualization: Case Studies using Open-Source Tools. 40 Boca Raton, Florida: CRC Press, pp. 153-172. ISBN 9781482237573 Designing the Search Experience Russell-Rose, Tony ORCID logo ; and Tate, Tyler. 2013. Designing the Search Experience. In: Tony Russell-Rose and Tyler Tate, eds. Designing the Search Experience. Waltham, MA: Morgan Kaufmann, pp. 23-45. ISBN 9780123969811 The Role of Natural Language Processing in Information Retrieval: Searching for Meaning and Structure Russell-Rose, Tony ORCID logo ; and Stevenson, Mark. 2009. The Role of Natural Language Processing in Information Retrieval: Searching for Meaning and Structure. In: A. Göker and J. Davies, eds. Information Retrieval: Searching in the 21st Century. Wiley, pp. 215-232. ISBN 9780470027622 ArticleExploring the Cognitive and Emotional Impact of Deceptive Patterns: An EEG, Eye-Tracking, and Sentiment Analysis of User Experience Jamalifard, Marzieh ORCID logo ; and Russell-Rose, Tony ORCID logo . 2025. Exploring the Cognitive and Emotional Impact of Deceptive Patterns: An EEG, Eye-Tracking, and Sentiment Analysis of User Experience. Interacting with Computers, ISSN 0953-5438 Think outside the search box: A comparative study of visual and form-based query builders Svarre, Tanja; and Russell-Rose, Tony ORCID logo . 2025. Think outside the search box: A comparative study of visual and form-based query builders. Journal of Information Science, 51(2), pp. 354-367. ISSN 0165-5515 An evaluation of a visual interface for supporting query formulation in scholarly searching Svarre, Tanja; and Russell-Rose, Tony ORCID logo . 2024. An evaluation of a visual interface for supporting query formulation in scholarly searching. Journal of Librarianship and Information Science, ISSN 0961-0006 Show more information Crisis talk: analysis of the public debate around the energy crisis and cost of living Panchendrarajan, Rrubaa ; Popova, Gergana ; and Russell-Rose, Tony ORCID logo . 2024. Crisis talk: analysis of the public debate around the energy crisis and cost of living. Social Network Analysis and Mining, 14, 74. ISSN 1869-5450 Search strategy formulation for systematic reviews: Issues, challenges and opportunities MacFarlane, Andrew; Russell-Rose, Tony ORCID logo ; and Shokraneh, Farhad. 2022. Search strategy formulation for systematic reviews: Issues, challenges and opportunities. Intelligent Systems with Applications, 15, 200091. ISSN 2667-3053 Interactive query expansion for professional search applications Russell-Rose, Tony ORCID logo ; Gooch, Philip; and Kruschwitz, Udo. 2021. Interactive query expansion for professional search applications. Business Information Review, 38(3), pp. 127-137. ISSN 0266-3821 Technological solutions for reproducibility and “showing of work”: a response to “Redundancy of Terms Is Not an Error but Plays a Positive Role in Composing Search Strategies” Russell-Rose, Tony ORCID logo . 2020. Technological solutions for reproducibility and “showing of work”: a response to “Redundancy of Terms Is Not an Error but Plays a Positive Role in Composing Search Strategies”. Journal of the Medical Library Association, 108(3), pp. 498-499. ISSN 1536-5050 Lessons from COVID-19 to Future Evidence Synthesis Efforts: First Living Search Strategy and Out of Date Scientific Publishing and Indexing Industry Shokraneh, Farhad; and Russell-Rose, Tony ORCID logo . 2020. Lessons from COVID-19 to Future Evidence Synthesis Efforts: First Living Search Strategy and Out of Date Scientific Publishing and Indexing Industry. Journal of Clinical Epidemiology, 123, pp. 171-173. ISSN 0895-4356 Designing the Structured Search Experience: Rethinking the Query-Builder Paradigm Russell-Rose, Tony ORCID logo ; and Shokraneh, Farhad. 2020. Designing the Structured Search Experience: Rethinking the Query-Builder Paradigm. Weave: Journal of Library User Experience, 3(1), ISSN 2333-3316 First International Workshop on Professional Search Verberne, Suzan; He, Jiyin; Kruschwitz, Udo; Wiggers, Gineke; Larsen, Birger; Russell-Rose, Tony ORCID logo ; and de Vries, Arjen. 2019. First International Workshop on Professional Search. ACM SIGIR Forum, 52(1), pp. 153-162. ISSN 0163-5840 Information retrieval in the workplace: A comparison of professional search practices Russell-Rose, Tony ORCID logo ; Chamberlain, Jon; and Azzopardi, Leif. 2018. Information retrieval in the workplace: A comparison of professional search practices. Information Processing & Management, 54(6), pp. 1042-1057. ISSN 0306-4573 Expert search strategies: the information retrieval practices of healthcare information professionals Russell-Rose, Tony ORCID logo ; and Chamberlain, Jon. 2017. Expert search strategies: the information retrieval practices of healthcare information professionals. JMIR Medical Informatics, 5(4), e33. ISSN 2291-9694 Searching for talent: The information retrieval challenges of recruitment professionals Russell-Rose, Tony ORCID logo ; and Chamberlain, Jon. 2016. Searching for talent: The information retrieval challenges of recruitment professionals. Business Information Review, 33(1), pp. 40-48. ISSN 0266-3821 An ontological approach to modelling tasks and goals Fox, John; Alabassi, Alyssa; Patkar, Vivek; Russell-Rose, Tony ORCID logo ; and Black, Elizabeth. 2006. An ontological approach to modelling tasks and goals. Computers in biology and Medicine, 36(7-8), pp. 837-856. ISSN 0010-4825 Usability Testing using Paper Prototypes Russell-Rose, Tony ORCID logo ; and Oettinger, Ayelet. 2005. Usability Testing using Paper Prototypes. Interfaces(64), pp. 20-22. ISSN 1351-119X Rcv1: A new benchmark collection for text categorization research Lewis, David D; Yang, Yiming; Russell-Rose, Tony ORCID logo ; and Li, Fan. 2004. Rcv1: A new benchmark collection for text categorization research. Journal of Machine Learning Research, 5(Apr), pp. 361-397. ISSN 1532-4435 A natural language system for retrieval of captioned images Elworthy, David; Russell-Rose, Tony ORCID logo ; Clare, Amanda; and Kotcheff, Aaron. 2001. A natural language system for retrieval of captioned images. Natural Language Engineering, 7(2), pp. 117-142. ISSN 1351-3249 CS-Web: A Lightweight Summarizer for HTML Russell-Rose, Tony ORCID logo ; and Wrigley, Ave. 1999. CS-Web: A Lightweight Summarizer for HTML. The Perl Journal, Conference or Workshop ItemExploring Deceptive Patterns: Insights from Eye Tracking, EMG and Sentiment Analysis Jamalifard, Marzieh ; Russell-Rose, Tony ORCID logo ; and Brignull, Harry. 2024. 'Exploring Deceptive Patterns: Insights from Eye Tracking, EMG and Sentiment Analysis'. In: 37th International BCS Human-Computer Interaction C",
  "content_length": 21441,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:15"
}