{
  "name": "Tony J. Prescott",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/tony-prescott",
  "status": "success",
  "content": "Professor Tony Prescott | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Tony Prescott MA, MSc, PhD, CPsychol FBPsS School of Computer Science Professor of Cognitive Robotics Open staff member portrait in a modal window T.J.Prescott@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Tony Prescott School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-4927-5390 Google Scholar Tony Prescott Linkedin Tony Prescott Youtube Researchgate Profile Tony Prescott is Professor of Cognitive Robotics at the University of Sheffield, UK, and the co-founder and former director of Sheffield Robotics, a cross-disciplinary research institute across both Universities in Sheffield.  He is also an active member of the Sheffield Neuroscience Institute.  He is a fellow of the British Psychological Society, was a Sage Centre for the Study of Mind Distinguished Fellow in 2018, and a finalist in the 2022 Ana Avatar competition for telepresence robotics.Tony’s research mixes robotics and artificial intelligence with psychology, brain theory and philosophy and aims at answering questions about the human condition by creating synthetic entities with animal or human-like capacities such as perception, memory, emotion and sense of self.  His approach takes a posthuman perspective, examining the ever-deepening relationship between our species and the technologies we create. He also regularly speaks and writes about the societal and cultural impacts of future robotic, AI, virtual reality and telepresence technologies.Tony has published over 240 articles and conference papers at the interface of robotics, AI, psychology, and neuroscience, and has received £10M in grant funding from UKRI, InnovateUK, the European Framework and Horizon Europe programmes and the Wellcome Trust. He is the co-creator of the award-winning animal-like robots Scratchbot, Shrewbot and MiRo-e, and the lead editor of The Scholarpedia of Touch, published by Springer, and of Living Machines: A Handbook of Research in Biomimetic and Biohybrid Systems published by Oxford University Press.  He co-founded and co-chairs the annual international Living Machines conference.Tony has co-founded two robotics spin-out companies, Consequential Robotics, developing education and assistive living technologies, and Bettering Our Worlds (BOW), who develop software that makes it easier to program robots.  He is also passionate about the use of robots in STEM education and founded the Skills and Education in Robotics and AI network. Tony’s research is regularly featured in online and print media and has been covered by the BBC One Show, BBC Breakfast, Tomorrow’s World Live, BBC Sunday Morning, Sky News and BBC Radio 4 Today, World at One, Costing the Earth, Inside Science and Material World. International coverage has included the Discovery Channel, Arte Channel, and CNN.Tony maintains profiles on ResearchGate and Linkedin, and a Youtube Channel with links to online interviews, talks and movies about his robots and research.  He has authored several shorter pieces of general interest, about artificial intelligence and robotics, for the online magazine The Conversation. Qualifications MA Psychology (Edinburgh)MSc Applied Artificial Intelligence (Aberdeen)PhD Machine Learning (Sheffield)CPsychol FBPsS. Research interests My research is within the areas of cognitive neuroscience, artificial intelligence and bio-inspired robotics. A particular focus is on the investigation of biomimetic and biohybrid systems: an example of the former would be an animal-like or humanoid robot, of the latter a human-machine interface.Current research is directed towards:social cognition for humanoid robots including the possibility synthetic autobiographical memory and of a robot \"sense of self”;active touch sensing for attention, orienting, and spatial memory;assistive and companion robotic technologies;haptic interfaces for sensory augmentation;telepresence robotics, andsocietal and ethical issues in technology.Some of my research is done under the auspices of the Department's Adaptive Behaviour Research Group and the Active Touch Laboratory. Publications Books Prescott T (2024) The psychology of artificial intelligence. Routledge. View this article in WRRO (2018) Living machines. Oxford University Press. Lepora NF, Mura A, Verschure PFMJ & Prescott TJ (2013) Living Machines 2012: the First International Conference on Biomimetic and Biohybrid Systems.. Edited books Engel AK, Friston KJ & Kragic D (Eds.) (2016) The Pragmatic Turn. The MIT Press. Prescott TJ, Ahissar E & Izhikevich E (Eds.) (2015) Encyclopedia: Touch. Scholarpedia Corporation. View this article in WRRO (Ed.) (2014) Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics): Preface.. Prescott TJ, Lepora NF, Mura A & Verschure PFMJ (Eds.) (2012) Biomimetic and Biohybrid Systems - First International Conference, Living Machines 2012, Barcelona, Spain, July 9-12, 2012. Proceedings. Springer. Seth A, Prescott T & Bryson J (Eds.) (2011) Modelling Natural Action Selection. Cambridge Univ Pr. Groß R, Alboul L, Melhuish C, Witkowski M, Prescott TJ & Penders J (Eds.) (2011) Towards Autonomous Robotic Systems - 12th Annual Conference, TAROS 2011, Sheffield, UK, August 31 - September 2, 2011. Proceedings. Springer. Groß R, Alboul L, Melhuish C, Witkowski M, Prescott T & Penders J (Eds.) (2011) Towards Autonomous Robotic Systems. Springer. Journal articles Nkhumise RM, Basu D, Prescott TJ & Gilra A (2025) Studying exploration in RL: An optimal transport analysis of occupancy measure trajectories. Transactions on Machine Learning Research. View this article in WRRO Prescott TJ & Jimenez-Rodriguez A (2025) Understanding the layered brain architecture for motivation: Dynamical systems, computational neuroscience, and robotic approaches. Psychology of Learning and Motivation - Advances in Research and Theory, 82, 45-96. View this article in WRRO Lithoxoidou EE, Stamos A, Triantafyllidis A, Georgiadis C, Altsitsiadis E, Giakoumis D, Votis K, Dewitte S, Tzovaras D, Eleftherakis G & Prescott T (2025) Exploring the influence of perceived extroversion in embodied virtual agents on trust and likability. User Modeling and User-Adapted Interaction, 35(2). View this article in WRRO Kabacińska K, Dosso JA, Vu K, Prescott TJ & Robillard JM (2025) Influence of user personality traits and attitudes on interactions with social robots: systematic review. Collabra: Psychology, 11(1). View this article in WRRO Prescott T, Robillard JM & Murray S (2025) Towards a critical posthumanist perspective on participatory design. Medical Humanities, 50, 715-716. View this article in WRRO Prescott TJ, Vogeley K & Wykowska A (2024) Understanding the sense of self through robotics. Science Robotics, 9(95). View this article in WRRO Prescott TJ & Dominey PF (2024) Synthesizing the temporal self: robotic models of episodic and autobiographical memory. Philosophical Transactions of the Royal Society B: Biological Sciences, 379(1913). View this article in WRRO Prescott TJ, Montes González FM, Gurney K, Humphries MD & Redgrave P (2024) Simulated dopamine modulation of a neurorobotic model of the basal ganglia. Biomimetics, 9(3). View this article in WRRO Belkaid M, Metta G, Prescott T & Wykowska A (2023) Editorial of the special issue on human-like behavior and cognition in robots. International Journal of Social Robotics, 15(8), 1261-1263. View this article in WRRO Prescott TJ & Wilson SP (2023) Understanding brain functional architecture through robotics. Science Robotics, 8(78). View this article in WRRO Whelan MT, Jimenez-Rodriguez A, Prescott TJ & Vasilaki E (2023) A robotic model of hippocampal reverse replay for reinforcement learning. Bioinspiration & Biomimetics, 18(1). Dosso JA, Bandari E, Malhotra A, Hoey J, Michaud F, Prescott TJ & Robillard JM (2022) Towards emotionally aligned social robots for dementia: perspectives of care partners and persons with dementia. Alzheimer's & Dementia: The Journal of the Alzheimer's Association, 18(S2), e059261-e059261. View this article in WRRO Waterstone R, Robillard JM & Prescott TJ (2022) Robot telepresence as a practical tool for responsible and open research in Trustworthy Autonomous Systems. Journal of Responsible Technology, 12. Dosso JA, Bandari E, Malhotra A, Guerra GK, Hoey J, Michaud F, Prescott TJ & Robillard JM (2022) User perspectives on emotionally aligned social robots for older adults and persons living with dementia. Journal of Rehabilitation and Assistive Technologies Engineering, 9. Wilson SP & Prescott TJ (2022) Scaffolding layered control architectures through constraint closure : insights into brain evolution and development. Philosophical Transactions of the Royal Society B: Biological Sciences, 377(1844). View this article in WRRO Kabacińska K, Prescott TJ & Robillard JM (2021) Socially assistive robots as mental health interventions for children : a scoping review. International Journal of Social Robotics, 13(5), 919-935. Watson M, Gladwin D & Prescott T (2021) Collinear mecanum drive: modelling, analysis, partial feedback linearisation, and nonlinear control. IEEE Transactions on Robotics, 37(2), 642-658. View this article in WRRO Sarda Gou M, Webb TL & Prescott T (2021) The effect of direct and extended contact on attitudes towards social robots. Heliyon, 7(3). View this article in WRRO Prescott TJ & Robillard JM (2021) Are friends electric? The benefits and risks of human-robot relationships. iScience, 24(1). Naneva S, Sarda Gou M, Webb TL & Prescott TJ (2020) A systematic review of attitudes, anxiety, acceptance, and trust towards social robots. International Journal of Social Robotics, 12, 1179-1201. Robillard JM, Goldman IP, Prescott TJ & Michaud F (2020) Addressing ",
  "content_length": 78019,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:15"
}