{
  "name": "Tor-Arne S. Nordmo",
  "homepage": "https://uit.no/ansatte/tor-arne.s.nordmo",
  "status": "success",
  "content": "Nordmo, Tor-Arne Schmidt | UiT Tor-arne.s.nordmo – Institutt for informatikk | UiT Gå til hovedinnhold Enheten Ansatte Tor-Arne Schmidt Nordmo Førsteamanuensis Institutt for informatikk tor-arne.s.nordmo@uit.no +4777644125 Tromsø Her finner du meg Tor-Arne Schmidt Nordmo Om Forskning og undervisning Her finner du meg Arbeider i Cristin Vitenskapelige artikler og bokkapitler Bøker og antologier Andre Bjørn Aslak Juliussen, Aril Bernhard Ovesen, Tor-Arne Schmidt Nordmo, Dag Johansen : Chapter 7: Digital Evidence in Times of Manipulation and Deepfakes – A Compliant and Integrity-Preserving File System 2025 Aril Bernhard Ovesen, Tor-Arne Schmidt Nordmo, Michael Alexander Riegler, Pål Halvorsen, Dag Johansen : Sustainable Commercial Fishery Control Using Multimedia Forensics Data from Non-trusted, Mobile Edge Nodes 2024 DOI / ARKIV Tor-Arne Schmidt Nordmo, Michael Riegler, Håvard Johansen Dagenborg, Dag Johansen : Arctic HARE: A Machine Learning-Based System for Performance Analysis of Cross-Country Skiers 2023 DOI / ARKIV Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Håvard Dagenborg, Pål Halvorsen, Michael Alexander Riegler, Dag Johansen : Fishing Trawler Event Detection: An Important Step Towards Digitization of Sustainable Fishing 2023 DOI / ARKIV André Pedersen, Erik Smistad, Tor Vikan Rise, Vibeke Grotnes Dale, Henrik P Sahlin Pettersen, Tor-Arne Schmidt Nordmo m.fl.: H2G-Net: A multi-resolution refinement approach for segmentation of breast cancer region in gigapixel histopathological images Frontiers in Medicine 2022 DOI / ARKIV Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Bjørn Aslak Juliussen, Steven Hicks, Vajira L B Thambawita, Håvard D. Johansen m.fl.: Njord: a fishing trawler dataset 2022 DOI / ARKIV Tor-Arne Schmidt Nordmo, Ove Kvalsvik, Svein Ove Kvalsund, Birte Hansen, Pål Halvorsen, Steven Hicks m.fl.: FishAI: Sustainable Commercial Fishing Challenge Nordic Machine Intelligence (NMI) 2022 DOI / ARKIV Enrico Tedeschi, Tor-Arne Schmidt Nordmo, Dag Johansen, Håvard D. Johansen : On Optimizing Transaction Fees in Bitcoin using AI: Investigation on Miners Inclusion Pattern ACM Transactions on Internet Technology (TOIT) 2022 DOI / ARKIV Joakim Aalstad Alslie, Aril Bernhard Ovesen, Tor-Arne Schmidt Nordmo, Håvard D. Johansen, Pål Halvorsen, Michael Riegler m.fl.: Áika: A Distributed Edge System for AI Inference Big Data and Cognitive Computing 2022 DOI / ARKIV Tor-Arne Schmidt Nordmo, Martine Espeseth, Bjørn Aslak Juliussen, Michael Alexander Riegler, Dag Johansen : Detection of Commercial Fishing-related Slipping Events using Multimodal Data 2022 DOI Aril Bernhard Ovesen, Tor-Arne Schmidt Nordmo, Håvard D. Johansen, Michael Alexander Riegler, Pål Halvorsen, Dag Johansen : File system support for privacy-preserving analysis and forensics in low-bandwidth edge environments Information 2021 DOI / ARKIV Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Håvard D. Johansen, Michael Riegler, Pål Halvorsen, Dag Johansen : Dutkat: A Multimedia System for Catching Illegal Catchers in a Privacy-Preserving Manner 2021 DOI Enrico Tedeschi, Tor-Arne Schmidt Nordmo, Dag Johansen, Håvard D. Johansen : Predicting Transaction Latency with Deep Learning in Proof-of-Work Blockchains IEEE International Conference on Big Data and Smart Computing 07. desember 2019 DOI / ARKIV Tor-Arne Schmidt Nordmo : Dutkat - A Privacy-Preserving Edge-based System for Automatic Catch Documentation and Detection of Illegal Events UiT Norges arktiske universitet 2023 Tor-Arne Schmidt Nordmo : KI-ekspert: Dette gikk galt da kommunen brukte ChatGPT 25. september 2025 DOI Tor-Arne Schmidt Nordmo : Slik gjorde de KI-feilene 31. mars 2025 Tor-Arne Schmidt Nordmo : Åsne er ekspert på kildearbeid: - Dette hadde man ikke bestått eksamen med 27. mars 2025 Tor-Arne Schmidt Nordmo : Utdanning og KI 2023 Tor-Arne Schmidt Nordmo : Arctic HARE: A Machine Learning-Based System for Performance Analysis of Cross-Country Skiers 2023 Aril Bernhard Ovesen, Tor-Arne Schmidt Nordmo, Dag Johansen : Compliant multimedia storage and data extraction from the untrusted and privacy-sensitive edge 2023 Tor-Arne Schmidt Nordmo : Presentasjon av eget arbeid for journalister 2023 Tor-Arne Schmidt Nordmo : Maritime Internet of Things - Architecture and machine learning techniques for ship intelligent decision support systems 2023 Tor-Arne Schmidt Nordmo : Dutkat - A Privacy-Preserving Edge-based System for Automatic Catch Documentation and Detection of Illegal Events 2023 Tor-Arne Schmidt Nordmo : Introduksjon til KI 2023 Håvard D. Johansen, Dag Johansen, Bjørn Aslak Juliussen, Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Pål Halvorsen m.fl.: Sustainable commercial fishing: Digital inspectors to the rescue 2022 Michael Alexander Riegler, Dag Johansen, Bjørn Aslak Juliussen, Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Pål Halvorsen m.fl.: Njord: An out-in-the-wild real world fish vessel catch analysis dataset 2022 Dag Johansen, Bjørn Aslak Juliussen, Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Pål Halvorsen, Håvard D. Johansen m.fl.: Sustainable commercial fishing: Digital inspectors to the rescue Arctic Frontiers : Abstracts 2022 Michael Alexander Riegler, Dag Johansen, Bjørn Aslak Juliussen, Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Pål Halvorsen m.fl.: Njord: An out-in-the-wild real world fish vessel catch analysis dataset Arctic Frontiers : Abstracts 2022 Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Bjørn Aslak Juliussen, Steven A. Hicks, Vajira Thambawita, Håvard D. Johansen m.fl.: Njord: A Fishing Trawler Dataset 2022 Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Bjørn Aslak Juliussen, Steven A. Hicks, Vajira Thambawita, Håvard D. Johansen m.fl.: Njord: A Fishing Trawler Dataset 2022 Enrico Tedeschi, Tor-Arne Schmidt Nordmo, Dag Johansen, Håvard D. Johansen : Predicting Transaction Latency with Deep Learning in Proof-of-Work Blockchains 2019 Tor-Arne Schmidt Nordmo, Robert Pettersen, Dag Johansen : Arctic HARE - Poster 2018 De 50 siste resultatene fra Cristin vises på siden. Se alle arbeider i Cristin her → Forskningsinteresser Kunstig intelligens Undervisning INF-2600 Artificial Intelligence, Methods and Applications (Emneansvarlig og Foreleser) INF-1600 Introduction to Artificial Intelligence (Emneansvarlig og Foreleser) Forskerprofil i Cristin ResearchGate Forskning og undervisning Medlem i forskningsgruppe Cyber Security Group (CSG) Medlem i prosjekt Edge Computing Sports Technology Systems Support for AI Forcasting tipping point in human health Realfagbygget A142 Klikk for større kart",
  "content_length": 6568,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:19"
}