{
  "name": "Torsten Söderström",
  "homepage": "http://user.it.uu.se/~ts",
  "status": "success",
  "content": "Torsten Söderström, Department of Systems and Control, Uppsala UniversityStaff at syscon Torsten Söderström's home page Background I have a M Sc in engineering physics (Civilingenjör teknisk fysik), 1969, and a PhD in automatic control (Tekn Dr i reglerteknik), both from Lund Institute of Technology. I moved to Uppsala University in 1974, where I am a professor of automatic control. I was the head of the Department of Systems and Control 1975-1999. I am an IEEE Fellow. Research interests My main research interests are in the fields of system identification, statistical signal processing, and adaptive systems. More recent interests include also identification of continuous-time models, parameter estimation in infinite-dimensional systems, numerical algorithms in control and signal processing, and modelling and control of mechanical systems. Teaching Undergraduate teaching Fall 2003: Control design (F4, IT4) Computer-controlled systems (W4, STS4) More information Fall 2002: Control design (F4, IT4) Computer-controlled systems (W4) More information Spring 2002: Adaptive systems (F4) Fall 2001: Control design (F4, IT4) Computer-controlled systems (W4) More information Spring 2001: Adaptive systems (F4) Fall 2000: Sampled-data control systems (F4) Computer-controlled systems (W4) More information Teaching in the PhD programs Spring 2003: Stochastic dynamic systems, 10 units Fall 2001: Stochastic dynamic systems, 10 units Spring 2001: Recursive identification, 7 units Fall 1999: Stochastic dynamic systems, 10 units Research projects * Identification of continuous-time systems (part of the multiproject Statistical signal processing) * Errors-in-variables modelling * Identification of nonlinear systems (part of the multiproject Statistical signal processing) * Identification of viscoelastic materials (a previous progress report for this project) * Parameter estimation in heat conduction and diffusion (a previous progress report for this project) * Control of waves, vibrations and stability in mechanical structures * Numerical algorithms in systems and control PhD students currently working in these projects: Emad Abd-ElRady, Mei Hong,Peter Karlsson, Hans Norlander, Agnes Runqvist. Recently graduated PhD's  engaged in these projects: Bharath Bhikkaji, Erik K. Larsson, Kaushik Mahata. Some other professional activities Editor of Automatica, subject area System Parameter Estimation, 1992-present. Within IFAC, International Federation of Automatic Control, I was a Council member 1996-2002, Executive Board member 1999-2002, and Chair of the Awards Committee 1999-2002. Within EUCA, European Union Control Association, I am a council member, 2001-present. Selected recent publications Books T. Söderström: Discrete-Time Stochastic Systems - Estimation and Control. Second edition, Springer-Verlag, London, UK, 2002. (375 pp) A new printing of the textbook T. Söderström and P. Stoica: System Identification, originally published by Prentice Hall International, has been arranged. Details on how to order copies from us. If you have other questions, contact Ingegerd Wass. Papers (For a more complete list, visit the total publication list of the group): E. Abd-Elrady, T. Söderström and T. Wigren: Periodic signal modeling.l IEEE Transactions on Automatic Control, to appear. E. Abd-Elrady, T. Söderström and T. Wigren: Periodic signal analysis using orbits of nonlinear ODEs based on Markov estimate. IFAC Workshop on Control Systems (PSWYCO 04), Yokohama, Japan, August 31-September 01, 2004. K. Mahata and T. Söderström: Improved estimation performance using known linear constraints. Automatica, vol 40, no 8, pp 1307-1318, August 2004. K. Mahata and T. Söderström: Large sample properties of separable nonlinear least squares estimators. IEEE Transactions on Signal Processing, vol 52, no 6, pp 1650-1658, June 2004. K. Mahata and T. Söderström: ESPRIT like estimation of real-valued sinusoidal frequencies. IEEE Transactions on Signal Processing, vol 52, no 5, pp 1161-1170, May 2004. T. Söderström and M. Hong: Identification of dynamic errors-in-variables systems with periodic data. Reglermöte 2004, (National Conference on Control), Gothenburg, Sweden, May 26-27, 2004. P. Karlsson, H. Norlander, A. Jansson and T. Söderström: Modeling and control of a viscoelastic piezolaminated beam. Reglermöte 2004, (National Conference on Control), Gothenburg, Sweden, May 26-27, 2004. K. Mahata, T. Söderström and L. Hillström: Computationally efficient estimation of wave propagation functions from 1-D wave experiments on viscoelastic materials. Automatica, vol 40, no 5, pp 713-727, May 2004. T. Söderström: Identification of linear systems in time domain. Encyclopedia of Life Support Systems (EOLSS), developed under the auspices of Unesco, EOLSS publishers, Oxford, UK, 2003. [http://www.eolss.net] T. Söderström: Prediction error methods. Encyclopedia of Life Support Systems (EOLSS), developed under the auspices of Unesco, EOLSS publishers, Oxford, UK, 2003. [http://www.eolss.net] K. Mahata, S. Mousavi, T. Söderström, M. Mossberg, U. Valdek and L. Hillström: On the use of flexural wave propagation experiments for identification of complex modulus. IEEE Transactions on Control Systems Technology, vol 11, no 6, pp 863-874, November 2003. T. Söderström: Why are errors-in-varibles problems often tricky? European Control Conference, ECC 2003, September 01-04, 2003, Cambridge, UK. K. Mahata, T. Söderström and L. Hillström: Computationally efficient estimation of wave propagation functions of viscoelastic materials. 13th IFAC Sympoisum on System Identification, SYSID 2003, August 27-29, 2003,  Rotterdam, The Netherlands T. Wigren, E. Abd-Elrady and T. Söderström: Least squares harmonic signal analysis using periodic orbits of ODEs. 13th IFAC Sympoisum on System Identification, SYSID 2003, August 27-29, 2003, Rotterdam, The Netherlands. B. Bhikkaji, T. Söderström and K. Mahata: A recursive algorithm for estimating parameters in a one dimensional diffusion system. 13th IFAC Sympoisum on System Identification, SYSID 2003, August 27-29, 2003, Rotterdam, The Netherlands. K. Kumamaru, K. Inoue, Y. Hosoyamada and  T. Söderström: Fault detection of nonlinear systems based on multi-form quasi-ARMAX modeling and its application to the ship benchmark. 13th IFAC Sympoisum on System Identification, SYSID 2003, August 27-29, 2003, Rotterdam, The Netherlands. T. Wigren, E. Abd-Elrady and T. Söderström: Harmonic signal analysis with Kalman filters using periodic orbits of nonlinear ODEs. ICASSP 2003, IEEE International Conference on Acoustics, Speech and Signal Processing, April 6-10, 2003, Hongkong. T. Söderström, K. Mahata and U. Soverini: Identification of dynamic errors-in-variables model: Approaches based on two-dimensional ARMA modelling of the data. Automatica, vol 39, no 5, 929-935, May 2003. T. Söderström: System identification techniques for estimating material functions from wave propagation experiments. Inverse Problems in Engineering, vol 10, no 5, 413-439. October 2002. T. Söderström, U.Soverini and K. Mahata: Perspectives on errors-in-variables estimation for dynamic systems. Signal Processing, vol 82, no 8, 1139-1154, August 2002. T. Söderström, M. Sebek, J. Jezek, V. Kucera and D. Henrion: An evaluation of algorithms for computing the covariance function of a multivariable ARMA process. European Journal of Control, vol 8, no 4, 315-325, 2002. T. Söderström, K. Mahata and U. Soverini: Identification of dynamic errors-in-variables model using a frequency domain Frisch scheme. Proc. 15th IFAC World Congress, Barcelona, Spain, July 21-26, 2002. K. Mahata and T. Söderström: Identification of dynamic errors-in-variables model using prefiltered data. Proc. 15th IFAC World Congress, Barcelona, Spain, July 21-26, 2002. B. Bhikkaji and T. Söderström: Bias and variance of the parameter estimates for a one dimensional diffusion system. Proc. 15th IFAC World Congress, Barcelona, Spain, July 21-26, 2002. E. K. Larsson and T. Söderström: Continuous-time AR parameter estimation by using properties of sampled systems. Proc. 15th IFAC World Congress, Barcelona, Spain, July 21-26, 2002. M. Simandl, J. Kralovec and T. Söderström: Aspects of point-mass approach to nonlinear state estimation and anticipative grid design. IEEE Transactions on Automatic Control, vol 47, no 4, pp 699-702, April 2002. T. Söderström: Using system identification for estimating material functions from wave propagation experiments. Invited keynote address, Proc. of 3rd International Conference on Identification in Engineering Systems, Swansea, Wales, April 15-17, 2002. K. Mahata, T. Söderström,  M. Mossberg, L. Hillström and  S. Mousavi: Identification of complex elastic modulus from flexural wave experiments, Proc. 3rd International Conference on Identification in Engineering Systems, Swansea, Wales, April 15-17, 2002. T. Söderström and K. Mahata: On instrumental variable and total least squares approaches for identification of noisy systems. International Journal of Control, vol 75, no 6, pp 381-389, April 2002. E. K. Larsson and T. Söderström: Identification of continuous-time AR processes from unevenly sampled data. Automatica, vol 38, pp 709-718, no 4, April 2002. T. Söderström: Model validation and model structure determination. Circuits, Systems and Signal Processing (special tutorial issue on System Identification), vol 21, no 1, pp 83-90, 2002. T. Söderström and P. Stoica: Instrumental variable methods for system identification. Circuits, Systems and Signal Processing (special tutorial issue on System Identification), vol 21, no 1, pp 1-9, 2002. B. Bhikkaji and T. Söderström: Reduced order models for diffusion systems. International Journal of Control, vol 74, no 15, 1543-1557, 2001. T. Söderström, M. Sebek, J. Jezek, V. Kucera and D. Henrion: An evaluation of algorithm for computing the covariance function of a multivariable ARMA process. In invited session, European Control Conference, ECC 01,  Porto, ",
  "content_length": 13345,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:36"
}