{
  "name": "Torsten Sattler",
  "homepage": "https://tsattler.github.io",
  "status": "success",
  "content": "Torsten Sattler Torsten Sattler I am a senior researcher at the Czech Institute of Informatics, Robotics and Cybernetics (CIIRC) at the Czech Technical University in Prague (CTU), where I am heading the Spatial Intelligence group. My work is in the intersection of 3D computer vision and machine learning, with the goal of making 3D computer vision algorithms such as 3D reconstruction and visual localization more robust and reliable through scene understanding while using 3D computer vision methods to train machine learning models. Before joining CIIRC in July 2020, I was an associated professor (tenured) in the Department of Electrical Engineering at Chalmers University of Technology. I joined Chalmers in January 2019 after 5 years, first as a PostDoc and then as a senior researcher, in Marc Pollefey's Computer Vision and Geometry Group in the Department of Computer Science at ETH Zurich. Between July 2016 and June 2018, I was Marc's deputy, tasked with the day-to-day operation of the group, during his sabbatical. I obtained a PhD from RWTH Aachen University under the supervision of Leif Kobbelt and Bastian Leibe. I am an ELLIS scholar and will be a program chair for ECCV 2024. I am a co-organizer of the 3DGV Seminar series. Email  / CV  / Bio  / Google Scholar  / Twitter  / Github Research My research interests include (large-scale) image-based localization, real-time localization, 3D mapping and reconstruction, implicit neural scene representations and neural rendering, learning local features, machine learning for 3D computer vision, and camera calibration, with applications in self-driving cars and other autonomous robots as well as augmented and virtual reality. My current work focuses on making algorithms for localization and mapping \"smarter\" (and thus more robust and reliable) by incorporating higher-level scene understanding into the process. News August 2022: 1 paper accepted to WACV 2023 July 2022: 3 papers accepted to ECCV 2022 March 2022: 1 paper accepted to CVPR 2022; I am ranked among the top-10 computer scientists in the Czech Republic by Research.com February 2022: I will be a General Chair for 3DV 2022, taking place in Prague between September 12th and 15th December 2021: Talk in the Tartan SLAM Series November 2021: I will be Area Chair for CVPR 2022 October 2021: 3 papers (1 oral), 3 workshops, 2 tutorials at ICCV 2021, I was also Area Chair for ICCV 2021 September 2021: New long-term research project August 2021: I will give a keynote at IROS 2021 June 2021: 4 papers (2 orals), Best Paper Candidate, Outstanding Reviewer Award at CVPR 2021 November 2020: 3 papers at 3DV 2020, I will be a Workshop Chair for CVPR 2021 September 2020: Program chair for DAGM GCPR 2020 August 2020: 5 papers, 3 workshops at ECCV 2020 July 2020: I joined CIIRC, CTU as a senior researcher Awards & Recognition Outstanding Reviewer Awards: CVPR 2021, ICLR 2021, CVPR 2020, ICCV 2019, CVPR 2019, CVPR 2017, ECCV 2016, ICCV 2015, CVPR 2015 2021: Best Paper Candidate at CVPR 2021: our paper was among 32 out of 1661 accepted papers that were shortlisted as candidates. 2019: Best Paper Award at Photogrammetric Image Analysis 2019 for the paper Image-to-image translation for enhanced feature matching, image retrieval and visual localization\". Best Paper Honorable Mention at IEEE Winter Conference on Applications of Computer Vision 2019 for the paper \"DGC-Net: Dense Geometric Correspondence Network\". 2018: Best Industrial Paper Award at the Swedish Symposium on Image Analysis, awarded for the presentation of the CVPR 2018 paper \"Benchmarking 6DOF Outdoor Visual Localization in Changing Conditions\". 2015: Best Systems Paper Finalist at Robotics: Science and Systems 2015, nominated with the paper Get Out of My Lab: Large-scale, Real-Time Visual-Inertial Localization\". 2013: Best Paper Award at the ICCV 2013 Workshop on Big Data in 3D Computer Vision, awarded for the paper \"A Scalable Collaborative Online System for City Reconstruction\". PhD Students Since 2020: Kunal Chelani at Chalmers University of Technology, co-supervised with Fredrik Kahl Vojtěch Pánek at CIIRC, CTU Since 2021: ‪Jonáš Kulhánek at CIIRC, CTU Varun Burde at CIIRC, CTU, co-supervised with Pavel Burget Maxime Pietrantoni at CIIRC, CTU, co-supervised with Martin Humenberger and Gabriela Csurka Khedari Publications For an up-to-date list of my publications, please see my Google Scholar profile. Teaching Lectures 2021-: Geometry of Computer Vision and Graphics, co-taught with Tomas Pajdla, CTU 2020: Image Analysis, Chalmers University of Technology 2019: Image Analysis, Chalmers University of Technology 2018: 3D Vision, co-taught with Martin R. Oswald, ETH Zurich 2017: 3D Vision, co-taught with Andreas Geiger, ETH Zurich 2016: 3D Vision, co-taught with Marc Pollefeys, ETH Zurich 2015: 3D Photography, co-taught with Marc Pollefeys, ETH Zurich Master Theses Note: At Chalmers, students can write theses in pairs. 2020: Admir Alihodza, Jonas Hejderup: Indoor static 2D map generation and object detection using deep learning and computer vision, academic supervisor and examiner at Chalmers University of Technology for an industrial Master thesis at Volvo Philip Anderberg, Fanny Liesén Gullmander: Segmentation of Image Sequences using SuperPixel Sampling Networks, academic supervisor and examiner at Chalmers University of Technology for an industrial Master thesis at Volvo Zongshang Pang: Using Stylization to Improve Visual Localization, Chalmers University of Technology Ara Jafarzadeh: Localization in Changing Environments: A More Robust Semantic Visual Localization Approach, Chalmers University of Technology Celine Back, Ivana Pepic: Simulating medical image data using generative adversarial networks (GANs), academic supervisor and examiner at Chalmers University of Technology for an industrial Master thesis at QRTECH Filip Franson, Max Wedenmark: Quality inspection using machine learning techniques for pose estimation, academic supervisor and examiner at Chalmers University of Technology for an industrial Master thesis at Volvo Adam Breitholz: Understanding the Limitations of PoseNet, jointly supervised with Laura Leal-Taix\\'{e} (TU Munich), Chalmers University of Technology 2019: Jonas Garsten, Ivar Wikenstedt: 6DOF camera localization through a short image sequence, Chalmers University of Technology Rasmus Lundin, John Wedin: Scalable deep visual localization, jointly supervised with Eric Brachmann (TU Dresden), Chalmers University of Technology Earl Fernando Panimayam Fernando: Prioritized 2D-3D Matching for Visual Localization Revisited, Chalmers University of Technology Guoxiang Zhou: Visual Semantic Odometry in Dynamic Environments, jointly supervised with Zhaopeng Cui (ETH Zurich), ETH Zurich Tomasz Jerzy Firynowicz: Visual localization under challenging conditions, jointly supervised with Zhaopeng Cui (ETH Zurich) and Marcel Geppert (ETH Zurich), ETH Zurich 2018: Antoni Rosinol Vidal: Exploiting Regular Structures in SLAM, jointly supervised with Luca Carlone (MIT), MIT Qixuan Zhang: Global Structure-from-Motion from Learned Relative Poses, jointly supervised with Johannes L. Schönberger (ETH Zurich), ETH Zurich 2017: Qunjie Zhou: Learning Relative Pose Estimation for Visual Localization, jointly supervised with Laura Leal-Taix\\'{e} (TU Munich), TU Munich Nektarios Lianos: Semantic Simultaneous Localization and Mapping, jointly supervised with Johannes L. Schönberger (ETH Zurich), ETH Zurich Krzysztof Lis: Learning Viewpoint Invariant Patches, jointly supervised with Johannes L. Schönberger (ETH Zurich), ETH Zurich Benjamin Steger: Building Virtual Scenes from the Real-World for Virtual Reality, jointly supervised with Filip Srajer (ETH Zurich), ETH Zurich Marcel Geppert: Simultaneous Localization and Mapping using Generalized Cameras, jointly supervised with Johannes L. Schönberger (ETH Zurich), ETH Zurich Andrin Jenal: 3D Tree Net, jointly supervised with Nikolay Savinov (ETH Zurich) and Gaurav Chaurasia (Disney Research Zurich), Disney Research Zurich 2016:Hans Hardmeier: Comparison of handcrafted vs. learned feature descriptors for Structure-from-Motion, jointly supervised with Johannes L. Schönberger (ETH Zurich), ETH Zurich 2015:Ioannis Marrigis: Incremental and Adaptive 3D Reconstruction in the Large, jointly supervised with Amael Delaunoy (ETH Zurich), ETH Zurich 2014:Andreas Haese: 2.5D Capture to Go, RWTH Aachen University 2013:Guoyu Lu: Large-scale image-based localization using learnt projection for local features, RWTH Aachen University Sven Middelberg: Hybrid Server-Client Image-Based Localization and Tracking for Mobile Devices, at RWTH Aachen University Bachelor Theses 2017: Niklaus Bamert: Efficient Matching Via Hashing for (Close-to) Real-Time Dense 3D Reconstruction, ETH Zurich 2016: Luzi Sennhauser: Image-Based Localization using Deep Learning, jointly supervised with Johannes L. Schönberger (ETH Zurich), ETH Zurich 2012: Andre Tebart: Augmented Reality Game on Android Tablets, jointly supervised with Dominik Sibbing (RWTH Aachen University), RWTH Aachen University Ole Untzelmann: City-Reconstructions by crowdsourcing, RWTH Aachen University 2011: Falk Pollok: Real-Time Object Tracking for Augmented Reality on Mobile Devices, RWTH Aachen University 2009: Eduard Feicho: Real-Time Feature Extraction and Matching on Mobile Devices, RWTH Aachen University Semester Theses 2018: Niklaus Bamert: Two-stage (semi-)dense real-time 3D depth estimation, ETH Zurich Nadja Kämpf: Two-stage (semi-)dense real-time 3D depth estimation, Studies in Mecha- tronics Thesis, ETH Zurich 2017: Matteo Ruello: SemanticPaint on HoloLens, co-supervised with Filip Srajer (ETH Zurich), ETH Zurich 2016: Nadine Rüegg: Synchronizing Cameras from Motion, ETH Zurich Commissions of Trust General Chair: 3DV: 2022 Program Chair: DAGM GCPR: 2020 ECCV: 2024 Area Chair: CVPR: 2018, 2022 ECCV: 2020 ICCV: 2019, 2021 3DV: 2018, 2019, 2020, 2021 ACCV: 2020 WACV: 2021 Associate Editor: I",
  "content_length": 10550,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:31"
}