{
  "name": "Torsten Eymann",
  "homepage": "https://www.bwl7.uni-bayreuth.de/de/team/eymann_torsten/index.php",
  "status": "success",
  "content": "Prof. Dr. Torsten Eymann Druckansicht der Internetadresse: Team > Prof. Dr. Torsten Eymann zurück zur Übersicht zurück zur Übersicht Prof. Dr. Torsten Eymann Person Schwerpunkte Publikationen Kontakt Rechts- und Wirtschaftswissenschaftliche FakultätLehrstuhl für Wirtschaftsinformatik und Digitale Gesellschaft PortraitProf. Dr. Torsten Eymann ist seit 2004 Inhaber des Lehrstuhls für Wirtschaftsinformatik & digitale Gesellschaft. Weiterhin ist er in leitender Funktion am Institutsteils Wirtschaftsinformatik des Fraunhofer-Instituts für Angewandte Informationstechnik FIT beschäftigt und Direktor des FIM Forschungsinstitut für Informationsmanagement. Seit 2015 ist er CIO der Universität Bayreuth und Sprecher der CIO-Runde der bayerischen Hochschulen e.V., in der er beispielsweise die Leitlinien für die künftige Weiterentwicklung der IT-Infrastruktur an bayerischen Hochschulen mitgestaltete. Darüber hinaus war er von 2015 bis 2021 Vizepräsident der Universität Bayreuth für Digitalisierung und Innovation. 2013 bis 2016 war er Sprecher des Fachbereichs Wirtschaftsinformatik der deutschen Gesellschaft für Informatik (GI). Von 2009 bis 2015 engagierte er sich als Präsident des Betriebswirtschaftlichen Forschungsinstituts für Fragen der mittelständischen Wirtschaft an der Universität Bayreuth e.V. (BF/M). Seine Forschungsschwerpunkte liegen in der Erforschung der digitalen Gesellschaft, insbesondere in den Themenfeldern Gesundheit (Digital Health), Bildung (Digital Education) und Sport (Digital Sports). Unter Einsatz von gestaltungs- und verhaltensorientierten Forschungsmethoden setzt er sich unter anderem mit der digitalen Transformation im Gesundheitswesen und an Hochschulen, dem Mittelstand und im öffentlichen Sektor auseinander und evaluiert dabei unter anderem den digitalen Reifegrad der betrachteten Akteure. Weiterhin untersucht er die Nutzerakzeptanz und das Nutzungsverhalten von digitalen Technologien und sicheren Informationssystemen im privaten sowie beruflichen Kontext und setzt sich mit der Entwicklung digitaler Geschäftsmodelle auseinander. Prof. Eymann ist Autor mehrerer Bücher und von mehr als 300 Journal- und Konferenzbeiträgen, von denen einige als Best Paper ausgezeichnet wurden. Daneben arbeitete er in Forschungsprojekten u.a. der Europäischen Kommission, der Bundesministerien für Wissenschaft und für Wirtschaft und der Deutschen Forschungsgemeinschaft. International publiziert hat er ebenso zur vertrauenswürdigen Steuerung komplexer und risikobehafteter IT-Umgebungen, insbesondere im Cloud Computing und Software-as-a-Service, Ubiquitous Computing und Ambient Intelligence im Gesundheitswesen. Seit seiner Promotion im Jahr 2000 beschäftigt er sich mit dem Thema der Realisierung und Akzeptanz von Technologien der Verteilten Künstlichen Intelligenz, insbesondere Software Agenten und Multiagentensystemen. Zu längeren Forschungsaufenthalten besuchte er die Hitachi System Development Labs in Japan, die British Telecom Labs in Großbritannien sowie die Universität Politecnica de Catalunya de Barcelona. Er ist weiterhin Organisator verschiedener Workshops und Konferenzen in der Wirtschaftsinformatik. seit 08/2015Vizepräsident der Universität Bayreuth für Informationstechnologie und Entrepreneurship sowie Chief Information Officer (CIO)seit 2004Universitätsprofessor (C4) an der Universität Bayreuth, Lehrstuhl für Betriebswirtschaftslehre, insb. Wirtschaftsinformatik (BWL VII).2010Ruf an die Universität Mannheim.04/2008 – 07/2008Visiting Researcher, Universitat Politècnica de Catalunya, Barcelona, Spanien.2004Lehrstuhlvertretung an der Universität Bayreuth, Lehrstuhl für Betriebswirtschaftslehre, insb. Wirtschaftsinformatik (BWL VII).2001 – 2004Wissenschaftlicher Assistent am Institut für Informatik und Gesellschaft, Abteilung Telematik (Direktor: Prof. Dr. Günter Müller), der Albert-Ludwigs-Universität, Freiburg.2000Promotion (Dr. rer. pol., summa cum laude) an der Wirtschaftswissenschaftlichen Fakultät der Albert-Ludwigs-Universität Freiburg. Dissertationspreis 2001 der Alcatel SEL Stiftung, Stuttgart.02/2000Visiting Researcher, British Telecom Research, Martlesham Heath, UK.1996 – 2001Wissenschaftlicher Mitarbeiter am Institut für Informatik und Gesellschaft der Albert-Ludwigs-Universität, Freiburg.1991 – 1996Geschäftsführer, später Vorstandsmitglied der studentischen Unternehmensberatung INTEGRA GbR/e.V.1990 – 1996Studium zum Diplom-Wirtschaftsinformatiker, Universität Mannheim.1987 – 1990Ausbildung zum Wirtschaftsinformatiker (BA), Wirtschaftsakademie Schleswig-Holstein, Kiel, und Drägerwerke AG, Lübeck.1986 – 1987Wehrdienst.1986Allgemeine Hochschulreife (Abitur), Katharineum zu Lübeck.Ehemalige Mitarbeiter*innen:Dr. Tina Balke​​Dr. Christoph BuckSimone BursterLuisa Funke-BarjakDr. Claudia DettweilerDr. Sebastian HudertDr. Stefan KönigDr. Christopher KühnSigrid MandelDr. Raimund MatrosDr. Christoph NiemannKathrin NitscheMatthias OttDr. Michael ReinickeBeatrix SembaDr. Werner StreitbergerDr. Dagmar Piotr TomanekMonika ViehmannAndreas VölklDr. Sebastian WaltherChristian WeideDr. Falk Zwicker Rechts- und Wirtschaftswissenschaftliche FakultätLehrstuhl für Wirtschaftsinformatik und Digitale Gesellschaft ForschungDigital LifeDigitalisierung der HochschuleDigitalisierung des GesundheitswesensPrivacy und SecurityVerteilte Künstliche IntelligenzDigitale GeschäftsmodelleLehre    Aktuelle Lehrveranstaltungen finden Sie hier: CAMPUSonline Rechts- und Wirtschaftswissenschaftliche FakultätLehrstuhl für Wirtschaftsinformatik und Digitale Gesellschaft Publikationen 2025 Hennrich, Jasmin; Doctor, Eileen; Körner, Marc-Fabian; Lederman, Reeva; Eymann, Torsten Enabling Physicians to Make an Informed Adoption Decision on Artificial Intelligence Applicatio ... In: Journal of Medical Internet Research Bd. 27 (2025) doi:10.2196/63668 ... Schreiter, Melina; Hennrich, Jasmin; Wolf, Anna Lina; Eymann, Torsten The Influence of Previous Experience on Virtual Reality Adoption in Medical Rehabilitation and ... In: Journal of Medical Internet Research Bd. 27 (2025) doi:10.2196/62649 ... 2024 Wolf, Anna Lina; Schreiter, Melina; Stark, Jeannette; Eymann, Torsten Overcoming Resistance : Understanding the Dynamics of the Digital Transformation Process Proceedings of the 32th European Conference on Information Systems (ECIS) Paphos, Cyprus , 2024 Hennrich, Jasmin; Fuhrmann, Hannah; Eymann, Torsten Accelerating the Adoption of Artificial Intelligence Technologies in Radiology : A Comprehensiv ... Proceedings of the 57th Hawaii International Conference on System Sciences (HICSS) Honolulu, Hawaii , 2024 https://www.fim-rc.de/Paperbibliothek/Veroeffentli ... 2023 Buck, Christoph; Eymann, Torsten; Jelito, Dennis; Schlatt, Vincent; Schweizer, André; Strobel, Jacqueline; Weiß, Florian Cyber-Sicherheit für kritische Energieinfrastrukturen : Handlungsempfehlungen zur Umsetzung ein ... In: HMD Praxis der Wirtschaftsinformatik Bd. 60 (2023) . - S. 494-509 doi:10.1365/s40702-023-00944-6 ... Diel, Sören; Doctor, Eileen; Reith, Riccardo; Eymann, Torsten; Buck, Christoph Examining Supporting and Constraining Factors of Physicians’ Acceptance of Telemedical Online C ... In: BMC Health Services Research Bd. 23 (2023) doi:10.1186/s12913-023-10032-6 ... Doctor, Eileen; Eymann, Torsten; Fürstenau, Daniel; Gersch, Martin; Hall, Kristina; Kauffmann, Anna Lina; Schulte-Althoff, Matthias; Schlieter, Hannes; Stark, Jeannette; Wyrtki, Katrin A Maturity Model for Assessing the Digitalization of Public Health Agencies : Development and E ... In: Business & Information Systems Engineering Bd. 65 (2023) . - S. 539-554 doi:10.1007/s12599-023-00813-y ... Kauffmann, Anna Lina; Neubauer, Maria; Reinsch, Felix; Reuther, Melina; Schick, Doreen; Stark, Jeannette; Bley, Katja; Heidmann, Nick; Eymann, Torsten Navigating Within the Digitalization Journey : Results and Implications of the First Maturity A ... Proceedings of the 18th International Conference on Wirtschaftsinformatik (WI) Paderborn, Germany , 2023 https://aisel.aisnet.org/wi2023/64 Storz, Sandra; Diel, Sören; Eymann, Torsten; Kollenda, Matthias; Sommer, Friedrich Online-Klausuren : Rahmenbedingungen, Implementierung, Weiterentwicklung und Evaluation an der ... Wie Corona die Hochschullehre verändert : Erfahrungen und Gedanken aus der Krise zum zukünftigen Einsatz von eLearning. 2. Auflage Wiesbaden : Springer Gabler, 2023. - S. 311-352 doi:10.1007/978-3-658-40163-4_18 ... Eymann, Torsten; Fürstenau, Daniel; Gersch, Martin; Kauffmann, Anna Lina; Neubauer, Maria; Schick, Doreen; Schlömer, Nina; Schulte-Althoff, Matthias; Stark, Jeannette; von Welczeck, Laura Das Reifegradmodell für den Öffentlichen Gesundheitsdienst : Ein Instrument zur Erfassung und V ... In: Bundesgesundheitsblatt : Gesundheitsforschung - Gesundheitsschutz Bd. 66 (2023) . - S. 136-142 doi:10.1007/s00103-022-03643-7 ... 2022 Amend, Julia; Eymann, Torsten; Kauffmann, Anna Lina; Münch, Tobias; Troglauer, Patrick Deriving Facilitators for Electronic Health Record Implementation : A Systematic Literature Rev ... Proceedings of the 30th European Conference on Information Systems (ECIS) Timisoara, Romania , 2022 https://aisel.aisnet.org/ecis2022_rp/81 Buck, Christoph; Doctor, Eileen; Hennrich, Jasmin; Jöhnk, Jan; Eymann, Torsten General Practitioners' Attitudes Toward Artificial Intelligence-Enabled Systems : Interview Stu ... In: Journal of Medical Internet Research Bd. 24 (2022) Heft 1 doi:10.2196/28916 ... Hall, Kristina; Richter, Fabian; Schmidt, Tina; Eymann, Torsten How one small step for occupational health management leads to many steps for employees : an ex ... Proceedings of the 30th European Conference on Information Systems (ECIS) Timisoara, Romania , 2022 https://aisel.aisnet.org/ecis2022_rp/11/ Ifland, Sebastian; Buck, Christoph; Eymann, Torsten; Stähle, Philipp; Thorwarth, Harald Künstliche Intelligenz : Ein theoretisches Werkzeug zur praxisorientierten Konzeption In: Energiewirtschaftliche Tagesfragen Bd. 72 (2022) Heft 3. - S. 57-61 Hennrich",
  "content_length": 79825,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:37"
}