{
  "name": "Torsten Braun",
  "homepage": "http://www.iam.unibe.ch/~braun",
  "status": "success",
  "content": "News: Prof. Dr. Torsten Braun - Communication and Distributed Systems Communication and Distributed Systems Team Prof. Dr. Torsten Braun Head of CDS research group Phone +41 31 684 49 94 E-Mail torsten.braun@unibe.ch Office N201 Postal Address Neubrückstrasse 10 CH-3012 Bern CV Lectures Research Activities Students CV 1970-1983: school at Grundschule and Hans-Furler-Gymnasium, Oberkirch, Germany, award for best physics exam 1984-1990: study of Computer Science at University of Karlsruhe (T.H.) 1990-1994: research assistant at Institute of Telematics (Prof. Dr. Dr. h.c. mult. G. Krüger), Department of Computer Science, University of Karlsruhe (T.H.) 1993: Ph.D. in Computer Science at Department of Computer Science, University of Karlsruhe (T.H.), award for best Ph.D. thesis , Fachgruppe Kommunikation und Verteilte Systeme, Gesellschaft für Informatik, Germany 1994-1995: visiting scientist at INRIA - Rodeo, Sophia-Antipolis, France 1995-1997: guest scientist / senior consultant at IBM European Networking Center, Heidelberg, Germany since 1998: Professor of Computer Science, Communication and Distributed Systems, Institute of Computer Science and Applied Mathematics, University of Bern, Switzerland 2004: visiting scientist at INRIA - Planete Sophia-Antipolis (France) and SICS, Kista, Sweden 2010: Sabbatical: visiting scientist at Bell Labs, Holmdel NJ, USA, guest professor at Infolab21 Department of Lancaster University, UK and Universidade de São Paulo in São Carlos, Brazil 2007-2011: Director of Institute of Computer Science at University of Bern 2011-2019: Vice President of SWITCH foundation 2017: Research Scholar at University of California Los Angeles and Boston University 2017-2019: Member of Faculty Board, Faculty of Science, University of Bern 2019-2021: Director of Institute of Computer Science at University of Bern Lectures Bachelor Courses Master Courses Computernetze Advanced Networking and Future Internet Betriebssysteme Mobile Communications Internet of Things Network Security Research Research Interests Information-Centric Wireless Networks Network Softwarization Indoor Localization and Tracking Internet of Things and Services Publications Publications Error: HTTP Error 410: Gone Activities Society Memberships IEEE with IEEE Communications Society Association for Computing Machinery (ACM) Schweizer Informatik Gesellschaft (SI) Gesellschaft für Informatik with KuVSwith MMB Board Memberships ERCIM eMobility Working Group, Chair KuVS ELG Ausschuss SWITCH Stiftungsrat Editorial Boards Computer Communications Informatik Spektrum Journal on Internet Engineering Networks Programme Committees ACM Conext Asia Pacific Network Operations and Management Symposium IEEE Broadband Wireless Access Workshop CFIP 2009 Internationla Conference on Energy-Efficient Computing and Networking IEEE LAN/MAN Workshop IEEE Annual Conference on Local Computer Networks IEEE International Workshop on Bandwidth on Demand IEEE CQR Workshop IEEE Workshop on advanced EXPerimental activities ON WIRELESS networks and systems IEEE Globecom IEEE International Conference on Communications IEEE Wireless Communications and Networking Conference IFIP/IEEE Network Operations and Management Symposium IFIP Networking IFIP Conference on Wireless Sensor and Actor Networks Kommunikation in Verteilten Systemen International Workshop on Services and Applications in Wireless Networks Workshop on Advanced Internet Charging Technology Wired / Wireless Internet Communications EuroMicro European conference on Wireless Sensor Networks International Conference on Next Generation Teletraffic and Wired/Wireless Advanced Networking International Conference and Exhibition on Next Generation Mobile Applications, Services and Technologies RealWSN International Conference on Telecommunications and Multimedia International Conference on Wireless Communication and Sensor Networks Workshop über Mobile Ad-Hoc Netzwerke Conference on Wireless On demand Network Systems and Services Students PhD Students Alisson Medeiros Dimitris Xenakis Eric Samikwa Patric Hammler Jakob Schaerer Jesutofunmi Ajayi Negar Emami Allan Souza Diego Oliveira Rodrigues Hugo Santos Lucas Pacheco Share Facebook E-Mail LinkedIn Print Top",
  "content_length": 4230,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:36"
}