{
  "name": "Torsten Höfler",
  "homepage": "https://htor.inf.ethz.ch",
  "status": "success",
  "content": "Torsten Hoefler's Home Page Discamus continentiam augere, luxuriam coercere Home -> Research Home  Publications  Awards  Research    NB Collectives    MPI Topologies    MPI Datatypes    Netgauge    Network Topologies    Ethernet BTL eth    ORCS    DFSSSP    Older Projects    cDAG    LogGOPSim    CoMPIler  Teaching  Miscellaneous  Full CV [pdf]  BLOG  bio Events Past Events Torsten Hoefler's Home Page Torsten Hoefler [2016] Professor Scalable Parallel Computing Lab Computer Science Department ETH Zürich Andreasstrasse 5 OAT V 15 8050 Zürich, Switzerland Torsten Hoefler is a full professor at ETH Zurich where directs the Scalable Parallel Computing Laboratory (SPCL). He is also the Chief Architect for Machine Learning at the Swiss National Supercomputing Center and a Long-term Consultant to Microsoft in the areas of large-scale AI and networking. He received his PhD degree in 2007 at Indiana University and started his first professor appointment in 2011 at the University of Illinois at Urbana-Champaign. Torsten is an ACM Fellow, IEEE Fellow, and Member of Academia Europaea. He received the ACM Gordon Bell Prize in 2019. He is the the youngest recipient of the IEEE Sidney Fernbach Award, the oldest career award in High-Performance Computing. He was the first recipient of the ISC Jack Dongarra Award in 2023. He has received many other career awards such as ETH Zurich's Latsis Prize in 2015, the SIAM SIAG/Supercomputing Junior Scientist Prize in 2012, the best student award of the Chemnitz University of Technology in 2005, the IEEE TCSC Young Achievers in Scalable Computing Award in 2013, the IEEE TCSC Award of Excellence in 2019, and both the Young Alumni Award 2014 and the Distinguished Alumni Award in 2023 from Indiana University. He also received the Max Planck-Humboldt Medal of Germany. He has published more than 300 papers in peer-reviewed international conferences and journals and co-authored the the MPI 3 specification. He has received six best paper awards at the ACM/IEEE Supercomputing Conference in 2010, 2013, 2014, 2019, 2022, 2023, and 2024 (SC10, SC13, SC14, SC19, SC22, SC23, SC24). Other best paper awards include IPDPS'15, ACM HPDC'15 and HPDC'16, ACM OOPSLA'16, and other conferences. Torsten was elected into the first steering committee of ACM's SIGHPC in 2013 and he was re-elected in 2016, 2019, and 2022. His Erdős number is two (via Amnon Barak) and he is an academic descendant of Hermann von Helmholtz. Torsten has served as the lead for performance modeling and analysis in the US NSF Blue Waters project at NCSA/UIUC. Since 2013, he is professor of computer science at ETH Zurich and has held visiting positions at Argonne National Laboratories, Sandia National Laboratories, and Microsoft in Redmond. Dr. Hoefler's research aims at understanding the performance of parallel computing systems ranging from parallel computer architecture through parallel programming to parallel algorithms. He is also active in the application areas of Weather and Climate simulations as well as Machine Learning with a focus on Distributed Deep Learning. In those areas, he has coordinated tens of funded projects and both an ERC Starting Grant and an ERC Consolidator Grant on Data-Centric Parallel Programming. If you would like to work with Torsten, please consult the SPCL Jobs page. Hoefler's biography information and photos. SPCL @ ETH Overview In this video, I summarize the Scalable Parallel Computing Laboratory at ETH Zurich: I recently presented a keynote at the DISC conference to overview parts of the HPC landscape for an audience in the distributed systems community. You can watch the whole video at DISC Keynote. Selected Publications [click here for full list] FCRC'23[1] Torsten Hoefler: Scalable and Efficient AI: From Supercomputers to Smartphones (Presentation) presented in Orlando, FL, USA, Jun. 2023, Keynote talk at the 2023 Federated Computing Research Conference ICLR'23[2] Langwen Huang, Torsten Hoefler: Compressing multidimensional weather and climate data into neural networks In The Eleventh International Conference on Learning Representations, May 2023, Notable Top 5% (Oral) SC'22[3] Maciej Besta, Cesare Miglioli, Paolo Sylos Labini, Jakub Tětek, Patrick Iff, Raghavendra Kanakagiri, Saleh Ashkboos, Kacper Janda, Michal Podstawski, Grzegorz Kwasniewski, Niels Gleinig, Flavio Vella, Onur Mutlu, Torsten Hoefler: ProbGraph: High-Performance and High-Accuracy Graph Mining with Probabilistic Set Representations In Proceedings of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC'22), Nov. 2022, SC22 Best Paper (1/82) CCS'22[4] Konstantin Taranov, Benjamin Rothenberger, Daniele De Sensi, Adrian Perrig, Torsten Hoefler: NeVerMore: Exploiting RDMA Mistakes in NVMe-oF Storage Applications In Proceedings of the 2022 ACM SIGSAC Conference on Computer and Communications Security (CCS '22), Nov. 2022, Best Paper Honorable Mention IEEE Computer[5] Torsten Hoefler, Ariel Hendel, Duncan Roweth: The Convergence of Hyperscale Data Center and High-Performance Computing Networks IEEE Computer. Vol 55, Nr. 7, pages 29-37, Jul. 2022, Cover Feature Technology Predictions MLSys'21[6] Andrei Ivanov, Nikoli Dryden, Tal Ben-Nun, Shigang Li, Torsten Hoefler: Data Movement Is All You Need: A Case Study on Optimizing Transformers In Proceedings of Machine Learning and Systems 3 (MLSys 2021), Apr. 2021, (acceptance rate: 23.5% (52/221)) Outstanding Paper Award (5/52) SC19[7] Grzegorz Kwasniewski and Marko Kabić and Maciej Besta and Joost VandeVondele and Raffaele Solcà and Torsten Hoefler: Red-Blue Pebbling Revisited: Near Optimal Parallel Matrix-Matrix Multiplication In Proceedings of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC19), Nov. 2019, (acceptance rate: 22.7% (78/344)) Best Paper Finalist, SC19 Best Student Paper (1/87) CACM[8] Robert Gerstenberger, Maciej Besta, Torsten Hoefler: Enabling Highly-Scalable Remote Memory Access Programming with MPI-3 One Sided In Communications of the ACM, ACM, Oct. 2018, Research Highlights OOPSLA'16[9] Andrei Marian Dan, Patrick Lam, Torsten Hoefler, Martin Vechev: Modeling and Analysis of Remote Memory Access Programming In Proceedings of the 2016 ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications, presented in Amsterdam, Netherlands, pages 129--144, ACM, ISBN: 978-1-4503-4444-9, Nov. 2016, Outstanding Paper Award at OOPSLA'16 (4/52) HPDC'16[10] P. Schmid, Maciej Besta, Torsten Hoefler: High-Performance Distributed RMA Locks In Proceedings of the 25th Symposium on High-Performance Parallel and Distributed Computing (HPDC'16), Jun. 2016, (acceptance rate: 16% (20/129)) Karsten Schwan Best Paper Award at HPDC'16 (1/20) serving: 178.249.213.185:10484© Torsten Hoefler",
  "content_length": 6859,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:29"
}