{
  "name": "Toshiya Hachisuka",
  "homepage": "https://cs.uwaterloo.ca/~thachisu",
  "status": "success",
  "content": "Toshiya Hachisuka at UWaterloo Toshiya Hachisuka (Google Scholar) Associate Professor David R. Cheriton School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1 (affiliated with Computer Graphics Lab, Computational Mathematics, and Scientific Computation Group) Co-director of the Computing and Financial Management Program toshiya.hachisuka@uwaterloo.ca Pronunciation of my name: \"Hachisuka\" has silent \"u\" (e.g., \"Ha-chee-ska\"). \"Toshiya\" has stress on \"To\" (e.g., \"Toe-she-ya\", *not* like \"Toshiba\", but like \"Joshua\"). I may consider accepting a new student starting in Fall 2026 (or a bit earlier if needed). If you are a current student at UWaterloo and would like to work with me, feel free to contact me. By default, I will decline to write a recommendation letter for graduate school applications if you just took my courses and never worked with me outside of it (i.e., I am just an instructor for you) because my letter would be likely useless for your application. If you are interested in working with me as a new graduate student, please first read this and contact me by stating your interest in rendering or relevant subjects within computer graphics. You may also want to check out this to see what I care about when working with students. Please be concrete as possible. For example, \"I am interested in global illumination\" is not concrete enough and I may dismiss it as non-interest. Due to the number of such emails, I may auto-delete your email if it is apparent that you are not particularly interested in working with me. Applications without any contact in advance may not be given full consideration. RESEARCH INTERESTS Rendering Light transport simulation Numerical analysis Computational statistics Physics simulation TEAM Ege Ciklabakkal (PhD) Maxwell Fang (PhD) Xiaochun Tong (PhD) Wenyou Wang (PhD) Weijie Zhou (PhD) Haochen Gan (MMath) Tianyu Huang (Visiting undergrad from Tsinghua University) Mark Ma (Undergrad RA) Melody Mao (Undergrad RA) Enming Yang (Undergrad RA) Xunqing Xue (Undergrad RA) ALUMNI (each \"(...)\" refers to a position in my group back then) UWaterloo Ryan Zhu (MMath co-advised, primary advisor: Shlomi Steinberg) Ryusuke Sugimoto (PhD) Ethan Dobrowolski (Undergrad RA) Euan Hughes (Undergrad RA) Duc Minh Tran (Visiting PhD from Technical University of Denmark) Sissy He (Undergrad RA) Logan Mosier (MMath) Matthew Georgy (Undergrad RA) Hongfei Huang (Undergrad RA) Alex Wang (Undergrad RA) Mengyu Yuan (Undergrad RA) Sean Zhang (Undergrad RA) Ryan Zhu (Undergrad RA) Jack Cui (Undergrad RA) Terry Chen (Undergrad RA) Aryan Abed-Esfahani (Undergrad RA) Sina Hojjati (MMath) Wesley Chang (Undergrad RA) Yiti Jiang (Undergrad RA) Leo Wang (Undergrad RA) Naoharu Shimada (PhD) Linwan Song (Undergrad RA) Ben Zhang (Undergrad RA) Eve Li (Undergrad RA) Ji Ho Yoo (MS) UTokyo Daniel Meister (Postdoc) Sabyasachi Mukherjee (MS then PhD) Rex West (MS then PhD) Lan Gao (MS) Miyu Hashimoto (MS) Yuki Kaji (MS) Yuji Moroto (MS) Yuki Tanaka (MS) Aaryaman Vasishta (MS) Weijie Zhou (MS) Nobuo Nakagawa (PhD) Jamorn Sriwasansak (MS then PhD) Ronan Cailleau (Visiting MS Student from the University of Rennes 1) Masayuki Honda (MS) Kazuhiro Kobayashi (MS) Taiga Mizuide (MS) Haruka Otake (MS) Hiroshi Takano (MS) Binh-Son Hua (Postdoc) Haokun Yang (Research Student) Kentaro Hirai (MS) Maria Ximena Bastidas Rodriguez (Visiting PhD Student from the National University of Colombia) Adrien Gruson (Postdoc) Hui Liu (Research Student) Hisanari Otsu (PhD) Shin Fujieda (MS) Masafumi Yamamoto (MS) Igor Zavialov (Research Student) Kevin Galim (Visitng MS Student from the Technical University in Munich) Sadashige Ishida (Visiting Researcher from Nikon) Chaitanya Reddy (Visiting PhD student from McGill University) Alessandro Dal Corso (Visiting PhD Student from Technical University of Denmark) Yuanming Hu (Visitng Student from Tsinghua University) Sigurd Ofstad (Visitng MS Student from Norwegian University of Science and Technology) Issei Takarada (MS) Pierre Poulin (Visiting Professor from Université de Montréal) AarhusU Jacob Toft Pedersen (PhD) Stig Rohde Døssing (MS) Heine Stokholm (MS) Troels Mortensen (MS) Kristian Theilgaard Hansen (MS) Troels Ugilt Jensen (MS) Marc Ilsø Poulsen (MS) Nikolaj Kobek Thorsen (MS) Tommy de Blanck (MS) Lasse Staal (MS) Horea Ioan Trinca (Visiting PhD Student from Babeș-Bolyai University) TEACHING UWaterloo Introduction to Graphics Programming (CS398), F2025 Supercollaborative Research in Computer Graphics (CS888), W2025 Numerical Computation (CS370), F2024 Advanced Topics in Computer Graphics - Rendering (CS888), F2023 Introduction to Computer Graphics (CS 488/688), S2023 Advanced Topics in Computer Graphics - Rendering (CS888), W2023 Numerical Computation (CS370), S2022 Introduction to Computer Graphics (CS 488/688), F2021 Advanced Topics in Computer Graphics - Rendering (CS888), W2021 UTokyo Realistic Image Synthesis, S2020 Introduction to Computer Graphics, S2020 Physically Based Animation, S2018 Introduction to Computer Graphics, S2018 Realistic Image Synthesis, S2017 Introduction to Computer Graphics, S2017 Physically Based Animation, S2016 Introduction to Computer Graphics, S2016 Realistic Image Synthesis, S2015 Introduction to Computer Graphics, S2015 AarhusU Advanced Graphics Effects, S2013 Rendering Algorithms, W2013 Rendering Algorithms, W2012 PUBLICATIONS AND PRESENTATIONS \"Gaussian Integral Linear Operators for Precomputed Graphics\" [project] H. Lu, Y. Belhe, G. Singh, T. Li, and T. Hachisuka ACM Transactions on Graphics (SIGGRAPH Asia 2025), 2025 (Precomputed integral linear operators based on analytic integrals of Gaussians.) \"Segment Based Light Transport Simulation\" [project] W. Wang, R. West, and T. Hachisuka ACM Transactions on Graphics (SIGGRAPH 2025), 2025 (Fundamental reformulation of light transport simulation based on segments than paths.) \"Practical Stylized Nonlinear Monte Carlo Rendering\" [code] X. Tong and T. Hachisuka ACM SIGGRAPH 2025 (Conference Track), 2025 (First practical method for solving the stylized rendering equation with nonlinear MC.) \"Galerkin Method of Regularized Stokeslets for Procedural Fluid Flow with Control Curves\" [project] R. Sugimoto, J. Lait, C. Batty, and T. Hachisuka ACM SIGGRAPH Asia 2024 (Technical Communications), 2024 (Procedurally defining an incompressible velocity field with curves.) \"Efficient Image-Space Shape Splatting for Monte Carlo Rendering\" X. Tong and T. Hachisuka ACM Transactions on Graphics (SIGGRAPH Asia 2024), 2024 (Making a sampled path in MC rendering contribute to multiple pixels with a sublinear cost.) \"Projected Walk on Spheres: A Monte Carlo Closest Point Method for Surface PDEs\" [project] R. Sugimoto, N. King, T. Hachisuka, and C. Batty ACM SIGGRAPH Asia 2024 (Conference Track), 2024 (Monte Carlo surface PDE solver.) \"Lossless Basis Expansion for Gradient-Domain Rendering\" M. Fang and T. Hachisuka Eurographics Symposium on Rendering 2024 (CGF paper), 2024 (Generalizing the albedo factorization trick to many more for gradient-domain rendering.) \"Velocity-based Monte Carlo Fluids\" [supplemental] [project] R. Sugimoto, C. Batty, and T. Hachisuka ACM SIGGRAPH North America 2024 (Conference Track), 2024 (Monte Carlo framework for solving Navier-Stokes equations with velocity fields.) \"Quantum Ray Marching for Reformulating Light Transport Simulation\" [supplemental] [code] L. Mosier, M. McGuire, and T. Hachisuka ACM SIGGRAPH Asia 2023 (Conference Track), 2023 (First scalable light transport algorithm on quantum computers.) \"Input-Dependent Uncorrelated Weighting for Monte Carlo Denoising\" [supplemental] [project] J. Back, B. Hua, T. Hachisuka, and B. Moon ACM SIGGRAPH Asia 2023 (Conference Track), 2023 (Intrinsically low-bias denoising for Monte Carlo rendering.) \"A Practical Walk-on-Boundary Method for Boundary Value Problems\" [project] R. Sugimoto, T. Chen, Y. Jiang, C. Batty, and T. Hachisuka ACM Transactions on Graphics (SIGGRAPH North America 2023), 2023 (Versatile Monte Carlo ray tracing solver for boundary value problems.) \"Parameter-Space ReSTIR for Differentiable and Inverse Rendering\" [project] W. Chang, V. Sivaram, D. Nowrouzezahrai, T. Hachisuka, R. Ramamoorthi, and T. Li ACM SIGGRAPH North America 2023 (Conference Track), 2023 (Resampled path reuse for differentiable rendering.) \"A Monte Carlo Method for Fluid Simulation\" [project] D. Rioux-Lavoie*, R. Sugimoto* (* joint first authors), T. Özdemir, N. H. Shimada, C. Batty, D. Nowrouzezahrai, and T. Hachisuka ACM Transactions on Graphics (SIGGRAPH Asia 2022), 2022 (Monte Carlo framework for solving Navier-Stokes equations.) \"Marginal Multiple Importance Sampling\" [supplemental] R. West, I. Georgiev, and T. Hachisuka ACM SIGGRAPH Asia 2022 (Conference Track), 2022 (Unbiased approximation of MIS when one or more of the sampling techniques has an intractable marginal PDF.) \"Surface-Only Dynamic Deformables using a Boundary Element Method\" [project] R. Sugimoto, C. Batty, and T. Hachisuka ACM SIGGRAPH/Eurographics Symposium on Computer Animation 2022 (received \"Best Paper Award\"), 2022 (A practical extension of BEM for surface-only deformables.) \"Single-pass Stratified Importance Resampling\" [project] E. Ciklabakkal, A. Gruson, I. Georgiev, D. Nowrouzezahrai, and T. Hachisuka Eurographics Symposium on Rendering 2022 (CGF track), 2022 (Stratification made available within resampled importance sampling.) \"Lightweight Multidimensional Adaptive Sampling for GPU Ray Tracing\" D. Meister and T. Hachisuka Journal of Computer Graphics Techniques, 2022 (GPU-friendly MDAS.) \"Regression-based Monte Carlo Integration\" [project] C. Salaun, A. Gruson, B. Hua, T. Hachisuka, and G. Singh ACM Transactions on Graphics (SIGGRAPH North America 2022), 2022 (Connecting regression and MC integration to have a drop-in improvement of MC integration.) \"Self-Supervised Post-Correction for Monte Carlo Denoising\" [project] J. Back, B. Hua, T. Hachisuka, and B. Moon ACM SIGG",
  "content_length": 33255,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:39"
}