{
  "name": "Toshio Endo",
  "homepage": "http://www.el.gsic.titech.ac.jp/~endo/index.html.en",
  "status": "success",
  "content": "Toshio ENDO's page Japanese page Toshio ENDO, PhD. old older w/ guitar Google Scholar, ORCID, Research Map, Github, X(Twitter) [Affiliation] Professor Supercomputing Research Center, Institute of Integrated Research, Institute of Science Tokyo [Publication] Publication list [Short Bio] [Research Projects] Fujitsu Next Generation Computing Infrastructure Collaborative Research Cluster (Oct 2022-) [Activities] Conference Chairs IEEE International Conference on Cluster Computing (CLUSTER 2025) Proceedings Co-chair IEEE International Conference on Cluster Computing (CLUSTER 2024) Proceedings Co-chair IEEE International Conference on Cluster Computing (CLUSTER 2020) Proceedings Chair 48th International Conference on Parallel Processing (ICPP 2019) Workshop Co-chair IEEE Non-Volatile Memory Systems and Applications Symposium (NVMSA 2018) General Co-chair International Conference on High Performance Computing in Asia-Pacific Region (HPC Asia 2018) Proceedings Chair, PC Vice-Chair IEEE Non-Volatile Memory Systems and Applications Symposium (NVMSA 2017) Program Co-chair ACM International Symposium on High-Performance Parallel and Distributed Computing (HPDC'16) Sponsorship Chair Workshop Chairs The Third International Workshop on Accelerators and Hybrid Exascale Systems (ASHES 2013) Journal Editor Conference Committee Members IEEE NVMSA Steering Committee (2019-) HPCAsia Program Committee (2026) IEEE BigData Program Committee (2019, 2021, 2022, 2023, 2024, 2025) ICPP Program Committee (2013, 2021, 2024) Euro-Par Program Committee (2023, 2024) PDCAT Program Committee (2022) IEEE/ACM SC Techincal Program Committee (2019) IEEE HPCC Program Committee (2017) IEEE IPDPS Program Committee (2015, 2017) IEEE HiPC Program Committee (2014, 2016) IEEE/ACM CCGrid\tProgram Committee (2007, 2011, 2015) IEEE ISPA program committee (2008) Workshop Committee Members GCA Program Committee (2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024, 2025) HeteroPar Program Committee (2009, 2012, 2013, 2014, 2015, 2018, 2020, 2021, 2022, 2023, 2024, 2025) EE HPC SOP Program Committee (2022) LHAM Program Committee (2015, 2016, 2017, 2018, 2020, 2021) SEPS Program Committee (2015) CMPP Program Committee (2011) [Old Research Projects] NEDO: Project for Innovative AI Chips and Next-Generation Computing Technology Development: Development of Next-Generation Computing Technologies: Exploring technologies of general-purpose and high-performance computing architectures and their their system software which are expected to achieve relatively x100 times higher performance in 2028 (2018-2022) [NEDO web page] AIST- Tokyo Tech Real World Big-Data Computation Open Innovation Laboratory (RWBC-OIL) (2017-2022) Ultra Green Supercomputing and Cloud Infrastructure Technology Advancement TSUBAME-KFC: a Modern Liquid Submersion Cooling Prototype towards Exascale Becoming the Greenest Supercomputer in the World, presented at IEEE ICPADS 2014. [paper] JST-CREST, \"Software Technology that Deals with Deeper Memory Hierarchy in Post-petascale Era\" (2012-2018, PI), (JST page) Project Overview and Results(2017) Heterogeneous Linpack on large scale heterogeneous supercomputers with accelerators/GPUs 87.01TFlops heterogeneous Linpack execution with Tesla GPUs, ClearSpeed, Opteron and Xeon CPUs, presented at IEEE IPDPS 2010. paper Parallel scalable garbage collector (ancient project) SC97 paper [Links] Endo Lab. Supercomputing Research Center, IIR (old GSIC) TSUBAME4.0 Supercomputer [Contact Address] Endo Laboratory Dept. of Mathematical and Computing Sciences, School of Computing, Institute of Science Tokyo (G2 Building Room 1112) 4259-G2-14 Nagatsuta-cho, Midori-ku, Yokohama, Kanagawa 226-0026, Japan Last update: October 2, 2025 Copyright (C) 2004-2025 Toshio ENDO. All rights reserved.",
  "content_length": 3790,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:38"
}