{
  "name": "Tovi Grossman",
  "homepage": "http://www.tovigrossman.com",
  "status": "success",
  "content": "ï»¿ Tovi Grossman News Team Publications Alumni Press Teaching Contact ☰ Back to Top Tovi Grossman, Ph.D. Chief Scientist, AXL Professor, University of Toronto Alfred P. Sloan Research Fellow (2021) NSERC E.W.R. Steacie Memorial Fellow (2020) NSERC/Autodesk Industrial Research Chair in Human-Computer Interaction (2019-2024) tovi@dgp.toronto.edu CV I am Professor in the Department of Computer Science at University of Toronto, and Co-Founder and Chief Scientist at AXL. My research lies in the general area of Human-Computer Interaction, with a primary focus on understanding how emerging technologies and machine intelligence can be leveraged to develop enhanced and compelling user experiences. My work has led to a number of technologies that are now in commercial products used by millions of users, such as Autodesk Screencast and Autodesk Sketchbook Motion - selected as Apple's 2016 iPad App of the Year . I received my Ph.D. in Human-Computer Interaction from the Department of Computer Science at the University of Toronto. Prior to Joining University of Toronto I was a Distinguished Research Scientist at Autodesk Research. I have authored over 180 peer-reviewed scientific articles, over 100 patents, and have received eighteen best paper awards and nominations at the ACM UIST and CHI conferences. I served as the Technical Program Co-Chair for the 2014 ACM CHI Conference on Human Factors in Computing Systems, the Program Committee Co-Chair for the 2015 ACM UIST Symposium on User Interface Software and Technology, and the vice-chair of the ACM CHI Steering Committee from 2019 to 2022. I collaborate closely with several Toronto industry HCI research labs, please use the form below to inquire about internship opportunties. Research Interests: Intelligent User Interfaces; Computer Science Education; Human-Robot Interaction; Mixed Reality Interaction; Technology-Assisted Learning; Input Techniques. Research Opportunties! If you are interested in working with me as a Post-Doc, undergaduate resaerch assistant, or visiting graduate student, Complete This Form. Team Sangho Suh Post-Doctoral Fellow Majeed Kazemitabaar Ph.D. Student Laura (Di) Chen Ph.D. Student Blaine Lewis Ph.D. Student Karthik Mahadevan Ph.D. Student Jiankai (Kevin) Pu Ph.D. Student Leping Qiu Ph.D. Student (to begin) PUBLICATIONS Filter: Show All Show all Intelligent UIs Mixed Reality Computing Education and Support Interactive Robotics Mobile and Wearable Input Touch Input Interactive Help and Tutorials Pen Computing Animation Interactive Video Interactive Fabrication Physical Learning Pointing Models and Techniques Awards Show all Intelligent UIs Mixed Reality Computing Education and Support Interactive Robotics Mobile and Wearable Input Touch Input Interactive Help and Tutorials Pen Computing Animation Interactive Video Interactive Fabrication Physical Learning Pointing Models and Techniques Awards Full Conference Papers GI 2025 GI 2025 [C.177] Dishita Turakhia, Mark Parent, Tovi Grossman, Michael Glueck, and Ben Lafreniere. 2025. Investigating Augmented Reality for Adaptive Motor-Skill Training. ACM GI Graphics Interface Conference. 10 pages. Paper GI 2025 GI 2025 [C.176] Ben Lafreniere, Zachary Davis, Michelle Li, Junmeng Han, Tovi Grossman, Stephanie Santosa, and Daniel Wigdor. 2025. Investigating Aggregated vs. Sequential Command Recommendation in Graphical User Interfaces. ACM GI Graphics Interface Conference. 13 pages. Paper CHI 2025 CHI 2025 [C.175] Leping Qiu, Erin Seongyoon Kim, Sangho Suh, Ludwig Sidenmark, Tovi Grossman. 2025. Marginalia: Enabling In-person Lecture Capturing and Note-taking Through Mixed Reality. ACM CHI Conference on Human Factors in Computing Systems. Paper CHI 2025 CHI 2025 [C.174] Naveen Sendhilnathan, Ting Zhang, David Bethge, Michael Nebeling, Tovi Grossman, Tanya R. Jonker. 2025. A multimodal approach for targeting error detection in virtual reality using implicit user behavior. ACM CHI Conference on Human Factors in Computing Systems. Paper CHI 2025 CHI 2025 [C.173] Joanne Leong, David Ledo, Thomas Driscoll, Tovi Grossman, George Fitzmaurice, Fraser Anderson. 2025. Paratrouper: Exploratory Creation of Character Cast Visuals Using Generative AI. ACM CHI Conference on Human Factors in Computing Systems. Paper CHI 2025 CHI 2025 [C.172] Kevin Pu, K. J. Kevin Feng, Tovi Grossman, Tom Hope, Bhavana Dalvi Mishra, Matt Latzke, Jonathan Bragg, Joseph Chee Chang, Pao Siangliulue. 2025. IdeaSynth: Iterative Research Idea Development Through Evolving and Composing Idea Facets with Literature-Grounded Feedback. ACM CHI Conference on Human Factors in Computing Systems. Paper CHI 2025 CHI 2025 [C.171] Kevin Pu, Daniel Lazaro, Ian Arawjo, Haijun Xia, Ziang Xiao, Tovi Grossman, Yan Chen. 2025. Assistance or Disruption? Exploring and Evaluating the Design and Trade-offs of Proactive AI Programming Support. ACM CHI Conference on Human Factors in Computing Systems. Paper IUI 2025 IUI 2025 [C.170] Violet Yinuo Han, Tianyi Wang, Hyunsung Cho, Kashyap Todi, Ajoy Savio Fernandes, Andre Levi, Zheng Zhang, Tovi Grossman, Alexandra Ion, Tanya R. Jonker. 2025. A Dynamic Bayesian Network Based Framework for Multimodal Context-Aware Interactions. ACM Conference on Intelligent User Interfaces. Paper IUI 2025 IUI 2025 [C.169] Hai Dang, Ben Lafreniere, Tovi Grossman, Kashyap Todi, Michelle Li. 2025. Authoring LLM-Based Assistance for Real-World Contexts and Tasks. ACM Conference on Intelligent User Interfaces. Paper IUI 2025 IUI 2025 [C.168] Majeed Kazemitabaar, Oliver Huang, Sangho Suh, Austin Z Henley, Tovi Grossman. 2025. Exploring the Design Space of Cognitive Engagement Techniques with AI-Generated Code for Enhanced Learning. ACM Conference on Intelligent User Interfaces. Paper HRI 2025 HRI 2025 [C.167] Karthik Mahadevan, Blaine Lewis, Jiannan Li, Bilge Mutlu, Anthony Tang, Tovi Grossman. 2025. ImageInThat: Manipulating Images to Convey User Instructions to Robots. HRI 2025 Best Paper Award Advanced Copy UIST 2024 UIST 2024 [C.166] Majeed Kazemitabaar, Jack Williams, Ian Drosos, Tovi Grossman, Austin Henley, Carina Negreanu, Advait Sarkar. 2024. Improving Steering and Verification in AI-Assisted Data Analysis with Interactive Task Decomposition. ACM UIST Symposium on User Interface Software and Technology. Article 92, 1-19. Paper UIST 2024 UIST 2024 [C.165] Ludwig Sidenmark, Tianyu Zhang, Leen Al Lababidi, Jiannan Li, Tovi Grossman. 2024. Desk2Desk: Optimization-based Mixed Reality Workspace Integration for Remote Side-by-side Collaboration. ACM UIST Symposium on User Interface Software and Technology. Article 44, 1 - 15. Paper DIS 2024 DIS 2024 [C.164] Adwait Sharma, Alexander Ivanov, Frances Lai, Tovi Grossman, Stephanie Santosa. 2024. GraspUI: Seamlessly Integrating Object-Centric Gestures within the Seven Phases of Grasping. ACM DIS Designing Interactive Systems Conference. 1275â1289. Paper | Video DIS 2024 DIS 2024 [C.163] Liwei Wu, Ben Lafreniere, Tovi Grossman, Thomas White, Stephanie Santosa. 2024. Body Language for VUIs: Exploring Gestures to Enhance Interactions with Voice User Interfaces. ACM DIS Designing Interactive Systems Conference. 133-150. Paper DIS 2024 DIS 2024 [C.162] Joannes Chan, Chris De Paoli, Michelle Li, Tovi Grossman, Stephanie Santosa, Daniel Wigdor, Michael Glueck. 2024. Fidgets: Building Blocks for a Predictive UI Toolkit. ACM DIS Designing Interactive Systems Conference (Peer Reviewed Pictorial). 1290-1305. Paper GI 2024 GI 2024 [C.161] Rawan Alghofaili, Naveen Sendhilnathan, Ting Zhang, Tovi Grossman, Michael Glueck, Tanya R. Jonker and Ben Lafreniere. 2024. Interactive Mediation Techniques for Error-Aware Gesture Input Systems. ACM GI Graphics Interface Conference. 12 Pages. Paper | Video CHI 2024 CHI 2024 [C.160] Majeed Kazemitabaar, Runlong Ye, Xiaoning Wang, Austin Henley, Paul Denny, Michelle Craig, Tovi Grossman. 2024. CodeAid: Evaluating a Classroom Deployment of an LLM-based Programming Assistant that Balances Student and Educator Needs. ACM CHI Conference on Human Factors in Computing Systems. Article 650. 1-20. Paper | Presentation Globe and Mail Article CHI 2024 CHI 2024 [C.159] Fengyuan Zhu, Mauricio Sousa, Ludwig Sidenmark, Tovi Grossman. 2024. PhoneInVR: An Evaluation of Spatial Anchoring and Interaction Techniques for Smartphone Usage in Virtual Reality. ACM CHI Conference on Human Factors in Computing Systems. Article 639. 1-16. Paper | Video | Presentation CHI 2024 CHI 2024 [C.158] Mohi Reza, Nathan M Laundry, Ilya Musabirov, Peter Dushniku, Zhi Yuan \"Michael\" Yu, Kashish Mittal, Tovi Grossman, Michael Liut, Anastasia Kuzminykh, Joseph Jay Williams. 2024. ABScribe: Rapid Exploration & Organization of Multiple Writing Variations in Human-AI Co-Writing Tasks using Large Language Models. ACM CHI Conference on Human Factors in Computing Systems. Article 1024. 1-18. Paper | Video | Presentation Montreal AI Ethics Article CHI 2024 CHI 2024 [C.157] Johann Wentzel, Fraser Anderson, George Fitzmaurice, Tovi Grossman, Daniel Vogel. 2024. SwitchSpace: Understanding Context-Aware Peeking Between VR and Desktop Interfaces. ACM CHI Conference on Human Factors in Computing Systems. Article 801. 1-16. Paper | Video | Presentation CHI 2024 CHI 2024 [C.156] Shan Xu, Sarah Sykes, Parastoo Abtahi, Tovi Grossman, Daylon Walden, Michael Glueck, Carine Rognon. 2024. Designing Haptic Feedback for Sequential Gestural Inputs. ACM CHI Conference on Human Factors in Computing Systems. Article 711. 1-17. Paper | Presentation CHI 2024 CHI 2024 [C.155] Jiahao Nick Li, Yan Xu, Tovi Grossman, and Stephanie Santosa, Michelle Li. 2024. OmniActions: Predicting Digital Actions in Response to Real-World Multimodal Sensory Inputs with LLMs. ACM CHI Conference on Human Factors in Computing Systems. Article 8. 1-22. Paper | Video | Presentation IUI 2024 IUI 2023 [C.154] Stephen Brade, Bryan Wang, Mauricio Sousa, Gregory Lee Newsome, Sageev Oore, Tovi Grossman. 2024. SynthScribe: Deep Multimodal Tools for Synthesizer Sound Retrieval a",
  "content_length": 71580,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:43"
}