{
  "name": "Tran Cao Son",
  "homepage": "http://www.cs.nmsu.edu/~tson",
  "status": "success",
  "content": "Tran Cao Son Tran Cao Son's Home Page Professor in Computer Science, New Mexico State University, Las Cruces, New Mexico My Short CV Research Interest Reasoning about Actions and Changes, Planning, Scheduling Knowledge Representation and Reasoning (Argumentation, Logic Programming, Nonmonotonic Reasoning) Autonomous Agents, Robotics, and Control Theory Web Agents Activities: PC/General Chair/Local Organizer 20th International Conference on Principles of Knowledge Representation and Reasoning. Rhodos. Greece 2023. 18th International Conference on Principles of Knowledge Representation and Reasoning. Hanoi. Vietname 2021 (virtual). 35th International Conference on Logic Programming. Las Cruces, New Mexico. USA. 2019. 19th Principles and Practice of Multi-Agent Systems conference agent-based modeling programming. Tokyo. Japan. August 2018. 33rd International Conference on Logic Programming. Melbourne. Australia. 2017. 19th Principles and Practice of Multi-Agent Systems conference agent-based modeling programming. Phuket Thailand. August 2016. 12th International Conference on Logic Programming and NonMonotonic Reasoning. Coruna. Spain. 2013. 14th International Workshop on Computational Logic and Multi-Agent Systems. Books (Edited) Proceedings of the 12th International Conference on Logic Programming and NonMonotonic Reasoning LNAI 8148 - Springer Verlag, 2013 (with Pedro Cabalar) LPNMR 2013 Proceedings of the 14th International Workshop on Computational Logic and Multi-Agent Systems LNAI 8143 - Springer Verlag, 2013 (with Leite, J.; Torroni, P.; van der Torre, L.; Woltran, S.) CLIMA XIV Logic Programming, Knowledge Representation, and Nonmonotonic Reasoning Essays Dedicated to Michael Gelfond on the Occasion of His 65th Birthday LNAI 6565 - Springer Verlag, 2011 (with Marcello Balduccini) Declarative Agent Languages and Technologies VI (Revised Selected and Invited Papers) LNAI 5397 - Springer Verlag, 2008 (with Matteo Baldoni, Birna van Riemsdijk, and Michael Winikoff) Declarative Agent Languages and Technologies V (Revised Selected and Invited Papers) LNAI 4897 - Springer Verlag, 2007 (with Matteo Baldoni, Birna van Riemsdijk, and Michael Winikoff) Publications, Students, Systems, and Tutorials Publications (See Google scholar or DBLP server). Systems -- developed mainly by my students Students Tutorials Knowledge representation, Logic, and Advanced Programming Laboratory (KLAP) Other Stuffs Some pictures of my family My sister's art work Travel to Vietnam For Vietnamese students: A note on TA/RA (from my perspective) Favorite Links My Advisors: Chitta Baral, Phan Minh Dung, Michael Gelfond My Home Town: Nam Dinh (English). Vietnamese Lunar Calnder (by Ho Ngoc Duc) Last modified: Fri Sep 16 14:03:34 MDT 2011",
  "content_length": 2755,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:45"
}