{
  "name": "Tran Trung Duy",
  "homepage": "http://www.trantrungduy.edu.vn",
  "status": "success",
  "content": "TRAN TRUNG DUYSearch this siteEmbedded FilesSkip to main contentSkip to navigationHome PagePROFILEHe received the B.E. degree in Electronics and Telecommunications Engineering from the French-Vietnamese training program for excellent engineers (PFIEV), HoChiMinh City University of Technology, Vietnam in 2007. In 2013, he received the Ph.D degree in electrical engineering from University of Ulsan, South Korea. In 2013, he joined Posts and Telecommunications Institute of Technology, HoChiMinh city campus (PTIT-HCM). From 2022, he is an associate Professor of Wireless Communications at PTIT-HCM. He received the prestigious ‘Exemplary Reviewer’ Certificates of IEEE Communications Letters for 2016, 2017, and IEEE Transactions on Communications for 2016. He has been a member of Technical Program Committee for conferences such as SigTelCom, ComManTel, ATC, NICS, ISCE ... From 2017, he is an associate editor for EAI Endorsed Transactions on Industrial Networks and Intelligent Systems Journal. From 2023, he is an associate editor for Advances in Electrical and Electronic Engineering Journal. His major research interests are cooperative communications, cooperative multi-hop, cognitive radio, physical-layer security, energy harvesting, hardware impairments and Fountain codes.CONTACTPosts and Telecommunications Institute of Technology (PTIT), Ho Chi Minh Campus.Address: 11 Nguyen Dinh Chieu Street., Dakao Ward, District 1, Ho Chi Minh City, 700000, Viet NamEmail: trantrungduy@ptithcm.edu.vn (trantrungduynhatrang@gmail.com)Website: www.trantrungduy.edu.vn (https://sites.google.com/site/trungduytrannhatrang)IEEE Membership Number: 94275899ORCID: 0000-0002-3947-2174 (trantrungduy@ptithcm.edu.vn)My CV - Personal Information - Important QĐ - Personal Certificate - My Photo - Personal Contact THESES- PhD. Dissertation: Cooperative Relaying Protocols With Relay Selection For Wireless Networks Over Rayleigh Fading ChannelsAdviser: Prof. Hyung-Yun Kong, Ulsan Univeristy, Korea, 2013. File  Link 1  Link 2  Link 3   Certificate  Transcript - Graduated Thesis: A Study About Concatenated Code of Reed-Solomon Codes and Convolutional Codes, Simulating by Matlab Adviser: Prof. Do Hong Tuan, Ho Chi Minh University of Technology, Viet Nam, 2007Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2327,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:44"
}