{
  "name": "Travis D. Breaux",
  "homepage": "https://www.cs.cmu.edu/~breaux",
  "status": "success",
  "content": "Travis D. Breaux | Home Travis D. Breaux Associate Professor of Computer Science Software and Societal Systems Department School of Computer Science 4665 Forbes Avenue, Pittsburgh, PA 15213 Office: Tel: Fax: E-mail: S3D - TCS Hall 346 412-268-7334 412-268-3455 Links: Home | Research | Teaching | Publications | Biography | Vitae Research Overview Keywords: Privacy, Security, Requirements and Software Engineering; Risk and Legal Compliance Dr. Breaux is the Director of the CMU Requirements Engineering Lab, where his research program investigates how to specify and design software to comply with policy and law in a trustworthy, reliable manner. His work historically concerned the empirical extraction of legal requirements from policies and law, and has recently studied how to use formal specifications to reason about privacy policy compliance, how to measure and reason over ambiguous and vague policies, and how security and privacy experts and novices estimate the risk of system designs. To learn more, read about his ongoing research projects or contact him. Recent Events 10 Jun 2025 Breaux elected General Chair of the 2026 IEEE 34th International Requirements Engineering Conference by the RE Steering Committee. 20 May 2025 Sharfuddin and Breaux had their paper, entitled Generative Goal Modeling, accepted to the IEEE 33rd International Requirements Engineering Conference. The paper investigates goal generation and comprehension using large language models with the replication package available online. 20 May 2025 S3D SE PhD student Anmol Singhal had his paper, entitled Legal Requirements Translation from Law and Requirements Elicitation Follow-up Question Generation accepted to the IEEE 33rd International Conference on Requirements Engineering. 18 Nov 2024 Breaux (CMU) and Albiston (Berkely) co-organize the NSF Workshop on Designing Accountable Software Systems (DASS), held in Warrenton, Virginia. The workshop hosted 85 participants in a program designed by a diverse representation of steering committee members over two days. A draft of the final workshop report is available online. 21 Mar 2024 S3D SE PhD student Sarah Santos, in collaboration with Thomas Norton (Fordham Law School) and Sara Haghighi and Sepideh Ghanavati (U. Maine), had their research paper, entitled Requirements Satisfiability with In-Context Learning, accepted to the 32nd IEEE Requirements Engineering Conference. 15 Nov 2023 Breaux's new course, 17-630 Prompt Engineering, is now open for enrollment in Spring 2024. You can learn about the course here. 7 Sep 2023 Breaux receives Distinguished Reviewer Award for his service to RE 2023. 30 May 2023 CMU INI student Tianjian Huang and MSE-SS student Vaishnavi Kualagi had their research paper, entitled Mobile Application Privacy Risk Assessments from User-authored Scenarios accepted to the 2023 IEEE International Requirements Engineering Conference. 29 Jun 2022 Breaux's joint paper Consent Verification Monitoring, in collaboration with Marco Robol, Elda Paja and Paolo Giogini, appears in ACM TOSEM. The paper provides a provable guarantee that data collection and use does not violate GDPR consent under multiple, overlapping and changing privacy policies. 9 Sep 2020 Breaux and Andrea Zisman completed their service as PC Co-Chairs for the 28th IEEE International Requirements Engineering Conference. The RE 2020 conference received 82 papers that independently reviewed, among which 20 papers are accepted (24%). The proceedings are available online. 1 Apr 2019 Breaux appointed Director of the Masters of Software Engineering (MSE) Professional Programs. The MSE programs have a 30-year history and were the first masters degrees offered in the CMU School of Computer Science. 8 Jan 2019 Breaux and Bhatia introduce their new course 17-649 Artificial Intelligence for Software Engineering offered in Spring and Fall 2019 23 Aug 2018 Bhatia and Breaux received the RE 2018 Distinguished Paper Award for their paper, entitled Semantic Incompleteness in Privacy Goals 1 Aug 2018 Bhatia and Breaux had their paper, entitled Empirical Measurement of Privacy Risk, accepted to ACM Transactions on Human Computer Interaction (TOCHI). A pre-publication version of this work was presented at the 2018 Federal Trade Commission (FTC) PrivacyCon 30 May 2018 Breaux receives Distinguished Reviewer Award for his service to ICSE 2018. 7 May 2018 Breaux joined the Editorial Board of the ACM Transactions on Software Engineering Methology (TOSEM) 15 Sep 2016 Breaux, Vail and Antón's 2006 RE paper, entitled \"Towards Regulatory Compliance: Extracting Rights and Obligations to Align Requirements with Regulations,\" receives Honorable Mention for 2016 IEEE RE Most Influential Paper Award (Press Release). Copyright © 2003-, Travis D. Breaux,",
  "content_length": 4794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:45"
}