{
  "name": "Tristan Henderson",
  "homepage": "https://tnhh.org",
  "status": "success",
  "content": "Tristan Henderson 1.08 Jack Cole Building School of Computer Science University of St Andrews St Andrews, Fife KY16 9SX Scotland, UK tnhh@st-andrews.ac.uk Welcome to my website. I am a Senior Lecturer in the School of Computer Science at the sunny University of St Andrews in Scotland. Once upon a time I was interested in economics, then various types of networks (wired, wireless, opportunistic, social), but these days I am mostly interested in the intersection of ethics, technology law and privacy. Basically I am interested in lots of things! Before coming to St Andrews, I was at Dartmouth, along with the actual scientist in our household. Before that, I was a student at UCL and Cambridge. Before that, I grew up in Singapore (and you will find that I use this for many teaching examples if you ever take one of my modules!). And at some point along the way I disappeared from St Andrews for a year to study a wee bit further south. Answers to common queries: If you are interested in doing a PhD with me, see here. If you need a reference, see here. If you see “computer science” and think that I can help to fix your computer, please look elsewhere! My special powers mean that I can break it without even touching it. If you are wondering why I haven’t replied to your e-mail about your doctor’s appointment or purchase order for medical equipment, it is because you are looking for ynhh.org rather than tnhh.org (T is very close to Y on a QWERTY keyboard). If you are visiting me (or someone near me), then here are some ideas for things to do. news Oct 6, 2025 I somehow managed a half-marathon personal best in the Great Scottish Run in Glasgow. Most surprising! Jul 3, 2025 We have launched a new research theme at work on Responsible and Sustainable Computing. We will be holding a number of interesting seminars on ethics, law, sustainability and more so if you are interested more then please sign up to our mailing list. Nov 20, 2024 I am trying out the Bluesky social network. I am still looking for people, so I know you, then please say hello at https://bsky.app/profile/tnhh.org. Aug 19, 2024 New role: I am now Director of the SICSA Graduate Academy which offers training, support and funding to postgraduate research students across Scotland. May 28, 2024 I am briefly mentioned in this BBC article about one of Elon Musk’s twitter spats (it can be hard to keep up with all of them, but this one is about WhatsApp and privacy). Nov 21, 2023 Thank you to everyone who donated to my running campaign. You helped me raise a remarkable £1,640 for the Campaign Against Living Miserably. Oct 12, 2023 Congratulations to my PhD student Adamu who has recently had his first two papers published. The first was on the use of data subject rights for improving democracy and appeared at an INTERACT workshop. The second was a systematic literature review on the use of data subject rights for research, and will shortly appear in the Journal of Responsible Technology. You can find links on my publications page. Mar 16, 2023 I am running nine races this year to raise money for the Campaign Against Living Miserably in memory of a university friend. If you would like to support me, or join me in a race, please visit my JustGiving page. Thanks! Jan 31, 2023 My student Dr Janis Wong has won the Council of Europe’s Stefano Rodotà Award for best data protection PhD thesis. Well done Janis! Nov 3, 2022 Like a number of others, I have found myself migrating from Twitter to the fediverse. I first dabbled in mastodon, but can currently be found on my personal pleroma instance here. (apologies in advance as I tend to be slow to reply)",
  "content_length": 3665,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:49"
}