{
  "name": "Trond Aalberg",
  "homepage": "https://www.ntnu.edu/employees/trondaal",
  "status": "success",
  "content": "Trond Aalberg - NTNU Trond Aalberg Download press photo Download press photo Foto: Close Trond Aalberg Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering trond.aalberg@ntnu.no +4773597952 +4797631088 IT-bygget, 213, Gløshaugen, Sem Sælands vei 9 About Professor in the Department of Computer and Information Science, Data and Artificial Intelligence Group. My main research is on methods and techniques to make content available, searchable and accessible in the context of user needs. Current research is on metadata and ontologies, covering semantic descriptions of contents, search services and search strategies, and crowdsourcing and collaborative creation. Additionally, I have a focus on learning technologies and innovative learning activities environments. I have been teaching various courses at the bachelor and master level specialization. Many students know me from the introductory course in C++, but currently I am responsible for a course in Web Development (IT2810) and a continuing education course in programming for teachers (IT6201). In the period 2013-2016 I have been deputy head of the Department of Computer and Information Science with responsibility for teaching and education and I have been head of Computer and Information Science study program board and leader of the study programs in Informatics, Computer Science and Information Systems in the period 2009-2017. Currently, I am participating in the nationally funded Excited SFU as leader for the project \"Projects of becoming\" and leader for NTNU Beta project on early adoptation of innovative learning technologies. Competencies Digital Library Informasjonsadferd Information Science Information retrieval Information search Metadata Ontology Semantic Web Publications 2024 Esfandani, Somayeh Bayat; Aalberg, Trond. (2024) Students' Perceptions of Features and Qualities in Peer Code Assessment Tools. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Pløhn, Trygve; Aalberg, Trond. (2024) Exploring Player Engagement in Social and Pervasive Learning Games. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Farrokhnia, Maliheh; Aalberg, Trond. (2024) What Information Are Researchers Looking for? Patterns of users’ Information Needs in CIDOC CRM. Cataloging & Classification Quarterly Academic article Skaug, Johanna; Aalberg, Trond. (2024) The Concept of Work in Theater Performances. Cataloging & Classification Quarterly Academic article Aalberg, Trond; Riva, Pat; Zumer, Maja. (2024) Presenting Compounds to End Users in Search Results. Cataloging & Classification Quarterly Academic article 2022 Lorås, Madeleine; Sindre, Guttorm; Trætteberg, Hallvard; Aalberg, Trond. (2022) Study Behavior in Computing Education—A Systematic Literature Review. ACM Transactions on Computing Education Academic article Aalberg, Trond; Duchateau, Fabien; Hall, Mark; Merc̆un, Tanja; Risse, Thomas. (2022) Current Research on Theory and Practice of Digital Libraries: Best Papers from TPDL 2019 & 2020. International Journal on Digital Libraries Editorial 2021 Lorås, Madeleine; Aalberg, Trond. (2021) Creating Learning Environments Within the Constraints of Higher Education - a Case Study of a First-Year Computing Program. IEEE Global Engineering Education Conference, EDUCON Academic article Aalberg, Trond; O´Neill, Ed; Zumer, Maja. (2021) Extending the LRM Model to Integrating Resources. Cataloging & Classification Quarterly Academic article Lorås, Madeleine; Aalberg, Trond. (2021) Understanding the Relation Between Study Behaviors and Educational Design: Research in Computing Education. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Aalberg, Trond. (2021) Den Eksterne Sensoren – akademias superhelt?. Universitetsavisa Reader opinion piece Haugse, Åsmund; Aalberg, Trond. (2021) Git in an Educational Context. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Lorås, Madeleine; Aalberg, Trond. (2021) Characteristics of the Student-Driven Learning Environment in Computing Education: A Case Study on the Interaction between Educational Design and Study Behavior. Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE Academic article 2020 Pløhn, Trygve; Iversen, Kjærand; Aalberg, Trond. (2020) A Dynamic Bonus System to Increase Player Participation in Pervasive Learning Games. Proceedings of the European Conference on Games Based Learning (ECGBL) Academic article Lorås, Madeleine; Aalberg, Trond. (2020) First Year Computing Study Behavior: Effects of Educational Design. Proceedings - Frontiers in Education Conference Academic article 2019 Aalberg, Trond; Tallerås, Kim; Massey, David. (2019) The impact of new bibliographic models on the search experience. Information research Academic article Aalberg, Trond. (2019) Branch Filtering of Tree-Structured Search Results. Academic chapter/article/Conference paper Doucet, Antoine; Isaac, Antoine; Golub, Koraljka; Aalberg, Trond; Jatowt, Adam. (2019) Digital Libraries for Open Knowledge : 23rd International Conference on Theory and Practice of Digital Libraries, TPDL 2019, Oslo, Norway, September 9-12, 2019, Proceedings. Springer Nature Springer Nature Academic anthology/Conference proceedings 2018 Vennesland, Audun; Aalberg, Trond. (2018) False-positive reduction in ontology matching based on concepts? domain similarity. Lecture Notes in Computer Science (LNCS) Academic article Duchateau, Fabien; Lumineau, Nicolas; Aalberg, Trond. (2018) Impact des données ouvertes et liées sur les catalogues bibliographiques. Ingénierie des Systèmes d'Information Academic article Lorås, Madeleine; Sindre, Guttorm; Aalberg, Trond. (2018) First year computer science education in Norway. NOKOBIT: Norsk konferanse for organisasjoners bruk av informasjonsteknologi Academic article Salaba, Athena; Mercun, Tanja; Aalberg, Trond. (2018) Complexity of Work Families and Entity-Based Visualization Displays. Cataloging & Classification Quarterly Academic article Aalberg, Trond; Lorås, Madeleine. (2018) Active learning and student peer assessment in a web development course. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Sindre, Guttorm; Giannakos, Michail; Krogstie, Birgit Rognebakke; Munkvold, Robin Isfold; Aalberg, Trond. (2018) Project-based learning in IT education : definitions and qualities. Uniped - Tidsskrift for universitets- og høgskolepedagogikk Academic article Lorås, Madeleine; Aalberg, Trond. (2018) Informatics study day: helping CS students become better students. Academic chapter/article/Conference paper Aalberg, Trond; Duchateau, Fabien; Takhirov, Naimdjon; Decourselle, Joffrey; Lumineau, Nicolas. (2018) Benchmarking and evaluating the interpretation of bibliographic records. International Journal on Digital Libraries Academic article 2017 Giannakos, Michail; Aalberg, Trond; Divitini, Monica; Jaccheri, Maria Letizia; Mikalef, Patrick; Pappas, Ilias. (2017) Identifying Dropout Factors in Information Technology Education: A Case Study. IEEE Global Engineering Education Conference, EDUCON Academic article Aalberg, Trond; Mercun, Tanja; Zumer, Maja. (2017) Interactive displays for the next generation of entity-centric bibliographic models. Lecture Notes in Computer Science (LNCS) Academic article 2016 Giannakos, Michail; Krogstie, John; Aalberg, Trond. (2016) Video-based learning ecosystem to support active learning: application to an introductory computer science course. Smart Learning Environments Academic article Aalberg, Trond; Mercun, Tanja; Zumer, Maja. (2016) BIBSURF - Discover bibliographic entities by searching for units of interest, ranking and filtering. Proceedings of the ACM/IEEE Joint Conference on Digital Libraries (JCDL) Academic article Merčun, Tanja; Žumer, Maja; Aalberg, Trond. (2016) Presenting bibliographic families: Designing an FRBR-based prototype using information visualization. Journal of Documentation Academic article Merčun, Tanja; Žumer, Maja; Aalberg, Trond. (2016) Presenting bibliographic families using information visualization: Evaluation of FRBR-based prototype and hierarchical visualizations. Journal of the Association for Information Science and Technology Academic article Decourselle, Joffrey; Duchateau, Fabien; Aalberg, Trond; Takhirov, Naimdjon; Lumineau, Nicolas. (2016) Open datasets for evaluating the interpretation of bibliographic records. Proceedings of the ACM/IEEE Joint Conference on Digital Libraries (JCDL) Academic article Pappas, Ilias; Aalberg, Trond; Giannakos, Michail; Jaccheri, Maria Letizia; Mikalef, Patrik; Sindre, Guttorm. (2016) Gender Differences in Computer Science Education: Lessons Learnt from an Empirical Study at NTNU. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Decourselle, Joffrey; Duchateau, Fabien; Aalberg, Trond; Takhirov, Naimdjon; Lumineau, Nicolas. (2016) BIB-R: A benchmark for the interpretation of bibliographic records. Lecture Notes in Computer Science (LNCS) Academic article Farrokhnia, Maliheh; Aalberg, Trond. (2016) Finding user need patterns in the world of complex semantic cultural heritage data. Communications in Computer and Information Science (CCIS) Academic article 2015 Giannakos, Michail; Krogstie, John; Aalberg, Trond. (2015) Toward a learning ecosystem to support flipped classroom: A conceptual framework and early results. Lecture Notes in Educational Technology Academic article Pløhn, Trygve; Louchart, Sandy; Aalberg, Trond. (2015) Dynamic Pervasive Storytelling in Long Lasting Learning Games. The Electronic Journal of e-Learning (EJEL) Academic article Pløhn, Trygve; Aalberg, Trond. (2015) Using Gamification to Motivate Smoking Cessation. Academic chapter/article/Conference paper Aalberg, Trond; Vennesland, Audun; Farrokhnia, Maliheh. (2015) A pattern-based framework for best p",
  "content_length": 42722,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:52"
}