{
  "name": "Troy Bruggemann",
  "homepage": "https://research.qut.edu.au/qcr/people/troy-bruggemann",
  "status": "success",
  "content": "Troy Bruggemann - QUT Centre for Robotics Skip to content Dr Troy Bruggemann Home Our People Dr Troy Bruggemann Please enable JavaScript Please enable JavaScript Find Troy Bruggemann onTroy Bruggemann's full profile, contact information and publications are available on: Senior Lecturer PhD (Queensland University of Technology), Master of Engineering (Queensland University of Technology)Has over 15 year’s experience in aerospace engineering research developing solutions for aerospace and defence industries. Has an educational background in precision navigation and timing, multi-sensor fusion and sensor fault detection for aerospace (aircraft, rockets, satellites). Past work includes researching, developing and commercialising flight automation technology that has enabled significant economic, societal, and environmental benefits in critical asset inspection and maintenance in Australia and globally. The technology led to the world's largest and most advanced remote asset inspection and monitoring programme (Fugro ROAMES) in 2012. Since 2014, it has operated 30,000+ hours in monitoring >1M km of infrastructure across North America, Europe, and Asia-Pacific with 100% uptime due to its robust design. It has saved millions of dollars a year and contributed to improved rapid assessment and response to natural disasters while promoting sustainable and effective management of encroaching vegetation enabling reduced bushfire risk. Recent work includes research to help decide capability purchases considering quantification of uncertainties in complex engagements, capability requirements and risk communication. Currently researching and developing algorithms and prototype software for remotely piloted aircraft flight around controlled airports, which is being used in CASA and Airservices Australia’s digital airspace authorisation trial. ProjectsAerospace AutonomyUnmanned Traffic Management (UTM) Additional information Experience Research Experience Senior Research Fellow, QUT (2018-2020) -  Uncertainty Quantification and Complex Systems.  Collaborators: Defence Science and Technology Group Senior Research Fellow, QUT (2018) -  Data Analytics for Irrigation Agriculture.  Topics: Data Analytics. Collaborators: The Yield Technology Solutions Pty Ltd Senior Research Fellow, QUT (2017) -  Investigating how bees track and intercept moving targets. Topics: Flight control, optimization Research Fellow, QUT (2017) - Academic lead on flight planning evaluation. Topics: Flight planning, optimization. Collaborators: Fugro ROAMES, Cooperative Research Centre for Spatial Information Research Fellow, QUT (2014-2017) - a QLD State Government Science and Innovation Accelerate Fellowship grant to research solutions to the problem of safely scaling up multi-UAV operations to one human operating many UAVs for applications benefiting society. Topics: Unmanned Aircraft Systems, multi-UAV control and planning, swarming. Collaborators: Boeing Defence Australia Research Fellow, QUT (2009-2014)  - researching powerline inspection with UAVs and highly automated manned aircraft for inspecting Ergon Energy's entire 150,000 km long powerline network in Queensland. Topics: Unmanned Aircraft Systems, general aviation, aircraft flight control and path planning, powerline inspection. Collaborators: Ergon Energy, Fugro ROAMES, Cooperative Research Centre for Spatial Information PhD, QUT (2005-2009) – investigating sole-means aircraft-based GPS augmentation for high integrity navigation. Topics: general aviation, GPS augmentation systems, aerodynamics, multi-sensor fusion, fault detection and isolation. Collaborators: Airservices Australia, GPSat Systems Pty Ltd Masters, QUT (2003-2004) – developing GPS receivers to enable cm-precision navigation and timing for highly dynamic applications including satellites and rockets. Collaborators: Cooperative Research Centre for Satellite Systems, Australian Space Research Institute, Ukrainian Youth Aerospace Association Professional Experience Senior Project Officer, Australian Research Centre for Aerospace Automation (2014)  - Unmanned Aircraft Systems Technical Consultant, Cooperative Research Centre for Spatial Information (2014) - intellectual property, patents Project Officer, Australian Research Centre for Aerospace Automation (2007) - Space-based augmentation systems, cost benefit analysis Teaching Experience Senior Lecturer, QUT (2020) - Unmanned Aircraft, Mechatronics Lecturer, QUT (2013, 2016-2019) - Autonomous Systems, Aviation Systems, Aircraft Systems and Flight, Unmanned Aircraft, Mechatronics Sessional Academic, QUT (2003-2009) - Aircraft Navigation Systems Awards TypeAcademic Honours, Prestigious Awards or PrizesReference year2015DetailsVice Chancellors Performance AwardTypeFellowshipsReference year2014DetailsQueensland Government Department of Science, Information Technology and Innovation Accelerate Fellowship AwardTypeAcademic Honours, Prestigious Awards or PrizesReference year2013DetailsVice Chancellors Performance AwardTypeAcademic Honours, Prestigious Awards or PrizesReference year2011DetailsVice Chancellor's Team Award for Excellence in recognition of outstanding achievements in research, partnerships and engagement Publications Crofts, D., Bruggemann, T. & Ford, J. (2017). A behaviour tree-based robust decision framework for enhanced UAV autonomy. Proceedings of the 17th Australian International Aerospace Congress (AIAC), 412–417. https://eprints.qut.edu.au/106017Bruggemann, T. & Campbell, D. (2017). Analysing the reliability of multi UAV operations. Proceedings of the 17th Australian International Aerospace Congress, 406–411. https://eprints.qut.edu.au/104726Bruggemann, T. & Campbell, D. (2017). Leveraging industry automation techniques for enhanced UAS system of systems. Proceedings of the 17th Australian International Aerospace Congress, 400–405. https://eprints.qut.edu.au/104724Bruggemann, T. & Ford, J. (2016). Coordinated change detection for UAV formations. Proceedings of the 2016 Australian Control Conference (AUCC 2016), 110–113. https://eprints.qut.edu.au/98549Mejias Alvarez, L., Lai, J. & Bruggemann, T. (2015). Sensors for missions. Handbook of unmanned aerial vehicles, 385–399. https://eprints.qut.edu.au/60605 Completed Supervisions (Doctorate) Design Methodologies and Architectures of Hardware-Based Evolutionary Algorithms for Aerospace Optimisation Applications on FPGAS (2014) NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 6742,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:55"
}