{
  "name": "Trung Thanh Huynh",
  "homepage": "https://thanhtrunghuynh93.github.io",
  "status": "success",
  "content": "Huynh Thanh Trung About I currently a lecturer in VinUniversity. I received the B.E. degree and M.E degree in Information System from Hanoi University of Science and Technology, Vietnam, in 2016 and 2017, respectively. I earned my PhD in Artificial Intelligence from Griffith University, Australia, in June 2022. Then, I were a Postdoctoral Researcher in Swiss Federal Institute of Technology Lausanne (EPFL) from 2022 to 2025. Having studied and worked in Japan, Australia, and Switzerland, joining VinUni has been a meaningful way to return and contribute to Vietnam’s development. I’m excited to be part of a young, world-class university that blends global standards with a strong local mission. VinUni offers an inspiring environment for early-career researchers like me to build an academic career, conduct impactful research, and grow with passionate colleagues and students. I’m proud to be part of this transformative journey. Lecturer & Researcher Research Interest: Deep Learning, Large Language Model, Edge Computing, Quant & Financial Analysis, Social Network Analysis, Fake News Detection I have authored or co-authored in 20+ papers published in international journals and conference proceedings, attracted 1400+ citations with h-index of 16. I have served as a reviewer for many top-tier international journals and conference, such as WWW, WSDM, TKDE, ICDE, VLDB, IJCAI. Birthday: 09 May 1993 Phone: +84899220128 Email: trung.ht@vinuni.edu.vn City: Hanoi, Vietnam I am looking for self-motivated Postdocs, Ph.D. students, Research Assistants and Interns, who are interested in machine/deep learning and large language models. You can reach me via email or meet me in-person at VinUni Campus for further discussion. Remote collaboration is also welcome! Scientific Projects Scientific Publications Citations H-index Skills Python & ML Development 100% Research 90% Web Development 75% CI&CD 80% Server 80% Quant 90%",
  "content_length": 1930,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:53"
}