{
  "name": "Tse-Hsun Peter Chen",
  "homepage": "http://petertsehsun.github.io",
  "status": "success",
  "content": "Tse-Hsun (Peter) Chen's website Tse-Hsun (Peter) Chen Associate Professor Department of Computer Science and Software Engineering, Concordia University, Montreal I lead the Software PErformance, Analysis, and Reliability (SPEAR) lab at Concordia University. My research focuses on improving the quality of large-scale software systems. Specifically, I work on areas such as log analysis and AIOps, software performance analysis, software testing, and mining software repositories. My research group has extensive collaboration with companies such as ERA Environmental, Ericsson, Microsoft, and BlackBerry. The research tools developed by myself and my students were integrated into industrial practice for ensuring the quality of large-scale enterprise systems. My research has received multiple prestigious awards and I am ranked as one of the most active software engineering researchers around the world by an independent study published in JSS. Several graduated PhD/PostDoc from the SPEAR lab are now tenure-track assistant professors around the world (e.g., York University, University of Alberta, DePaul University, and IIT Gandhinagar). In particular, my research aims to solve challenges such as: Can we leverage Large-Language Models (LLM) to assist developers with development, debugging, and maintenance? Can we quickly help developers debug production systems by utilizing rich software data? Can we provide suggestions on how to optimize the software system by analyzing user usage data? How to improve software quality assurances in DevOps environments by analyzing test results from continuous integration? Can we provide useful suggestions to developers by mining software development history? To perspective graduate students: Concordia has a very strong research presence in Software Engineering. Concordia’s Software Engineering is currently ranked as the 8th in the world. Concordia is also ranked as one of the top 100 universities under 50 years old in the world . Montreal is the second largest city in Canada and is ranked as the best city for students in the world. Interests Software Engineering DevOps & AIOps Software Testing Mining Software Repositories Software Performance Education PhD in Computer Science Queen's University MSc in Computer Science Queen's University BSc in Computer Science University of British Columbia News [Oct 2025] One EMSE paper accepted! Congrats to Lorena, Nakhla, and the co-authors! [Aug 2025] One ASE paper accepted! Congrats to Wei and the co-authors! [July 2025] One COLM-AIA paper accepted! Congrats to Linqiang and the co-authors! [Jan 2025] One ICSE-SEIP paper accepted! Congrats to Wei and the co-authors! [Jan 2025] One MSR paper accepted! Congrats to Nakhla and the co-authors! [Dec 2024] Congrats to Wei Liu on successfully defending his PhD! [Nov 2024] One JSS paper accepted! Congrats to Zehao and the co-authors! [Nov 2024] Two ICSE papers accepted! Congrats to Feng, Zeyang, and the co-authors! [Aug 2024] One paper accepted at ASE! Congrats to Arthur! [Aug 2024] One paper accepted at TOSEM! Congrats to Azmain and the co-authors! [June 2024] Congrats to Zhenhao! He is joining York University as a tenure-track assistant professor! [June 2024] Congrats to DJ! He is joining DePaul University as a tenure-track assistant professor! [June 2024] Congrats to DJ on the acceptance of our ICSME paper! [May 2024] Congrats to Wei and Shouvick on the acceptance of our TOSEM paper! [April 2024] Congrats to Nakhla and the co-authors on the acceptance of our FSE paper! [April 2024] Congrats to Shahla and the co-authors on the acceptance of our IST paper! [Jan 2024] Congrats to Zeyang, Dong Jae, and the co-authors on the acceptance of 2 ICSE papers! [Jan 2024] Congrats to Lorena and the co-authors on the acceptance of our CAIN paper! [Jan 2024] Congrats to Zeyang and the co-authors on the acceptance of an EMSE paper! [Aug 2023] Congrats to Zhenhao, An Ran, and the co-authors on the acceptance of our ASE paper Are They All Good? Studying Practitioners’ Expectations on the Readability of Log Messages! [July 2023] Congrats to my PhD student An Ran Chen! He will join the University of Alberta as a tenure-track assistant professor in the fall! [June 2023] I will serve as a PC on the Research Track of FSE and MSR! [June 2023] Congrats to Tianlei and Shaowei on the acceptance of our JSS paper Study the Correlation Between the readme File of GitHub Projects and Their Popularity! [Feb 2023] Congrats to Wei on the acceptance of our TSE paper SLocator: Localizing the Origin of SQL Queries in Database-Backed Web Applications! [Dec 2022] Papers accepted at TSE, ICSE, and ICSE-SEIP! [Aug 2022] I will serve as a PC on the Research Track of AAAI 2023 [Aug 2022] Congratulations to Zehao, Haoxiang, and Shaowei on the acceptance of our JSS paper An Empirical Study on the Challenges that Developers Encounter When Developing Apache Spark Applications! [July 2022] Congratulations to An Ran on the acceptance of our ASE paper How Useful is Code Change Information for Fault Localization in Continuous Integration?! [June 2022] Congratulations to Tarek and DJ on the acceptance of our ICSME paper An Empirical Study on Performance Bugs in Deep Learning Frameworks! [June 2022] Congratulations to the co-authors on the acceptance of our ICSME-NIER paper A First Look at Information Highlighting in Stack Overflow Answers! [June 2022] I will serve on the DEMO and Student Research Track of FSE 2022. Please consider submitting your papers there! [May 2022] Congratulations to Zhenhao Li on receiving the prestigious FRQNT PhD Scholarship! [April 2022] Congratulations to DJ Kim on receiving the prestigious NSERC PhD Scholarship! [Feb 2022] I am happy to share that I have received the Gina Cody Research award, which is given to outstanding researchers in GCS. [Aug 2021] Congratulations to Steve Locke on successfully defending his MSc thesis!! [June 2021] I am ranked as one of the most active SE researchers in the world by a paper published in JSS! [June 2021] I will serve on the program committee of AIOPS 2021 [June 2021] I am co-editing a special issue in JISE on Software Engineering and DevOps. Please consider submitting your papers! [May 2021] We have two papers accepted in FSE! Congrats to my students Zehao and Dong Jae and the co-authors. [May 2021] Congratulations to Zehao Wang on successfully defending his MSc thesis! He will continue in the SPEAR lab as a PhD student. [Apr 2021] We have 1 paper accepted in TSE and 3 papers accepted in EMSE! [Mar 2021] I will serve on the program committee of the Software Engineering Education and Training Track@ICSE 2022. [Mar 2021] I will serve on the program committee of APSEC 2021. [Feb 2021] Our paper A Study of C/C++ Code Weaknesses on Stack Overflow has been accepted in TSE! Congrats to Zhenhao, Shaowei, Heng, and Ahmed! [Jan 2021] Our paper Studying Duplicate Logging Statements andTheir Relationships with Code Clones has been accepted in TSE! Congrats to Zhenhao, Jinqiu, and Weiyi! [Jan 2021] I am co-editing a special issue in EMSE on Software Performance. Please consider submitting your papers to EMSE! [Dec 2020] Two papers have been accepted in ICSE! Congrats to my students Dong Jae, Zhenhao, and all the co-authors! [Dec 2020] Our paper Revisiting Test Impact Analysis in Continuous Testing From the Perspective of Code Dependencies has been accepted in TSE! Congrats to Zi and Jinqiu! [Nov 2020] Our paper Demystifying the Challenges and Benefits of Analyzing User-Reported Logs in Bug Reports has been accepted in EMSE! Congrats to An Ran and Shaowei! [Nov 2020] Our paper Are Comments on StackOverflow Well Organized for Easy Retrieval by Developers? has been accepted in TOSEM! Congrats to Haoxiang, Shaowei, and Ahmed! [Aug 2020] Congratulations to Zi Peng on defending her MSc! [July 2020] Our paper A First Look at the Integration of Machine Learning Models in Complex Autonomous Driving Systems - A Case Study on Apollo has been accepted in FSE! Congrats to Peng, Jinqiu, and Lei! [July 2020] Our paper Where Shall We Log? Studying and Suggesting Logging Locations in Code Blocks has been accepted in ASE! Congrats to Zhenhao and Weiyi! [July 2020] I am co-editing a special issue in EMSE on Collective Knowledge in Software Engineering. Please consider submitting your papers to EMSE! [June 2020] Our paper Logram: Efficient Log Parsing Using n-Gram Dictionaries has been accepted in TSE! Congrats to Hetong, Heng, Che-Shao, and Weiyi! [June 2020] I will serve on the program committee of the Late-Breaking Results@ASE 2020. [April 2020] I will serve on the program committee of ICPE 2021. [April 2020] Our paper A3: Assisting Android API Migrations Using Code Examples has been accepted in TSE! Congrats to Max Lamothe and Weiyi! [April 2020] I will serve on the program committee of CASCON 2020. [Feb 2020] I will serve on the program committee of the Tool Demo track@ESEC/FSE 2020. [Feb 2020] I will serve on the program committee of SCAM 2020. [Feb 2020] Two of our papers Studying the Characteristics of Logging Practices in Mobile Apps: A Case Study on F-Droid and An Empirical Study of Obsolete Answers on Stack Overflow are accepted for presentation in ICSE 2020! [Jan 2020] I will serve on the program committee of ICSME 2020. [Nov 2019] Our paper Reading Answers on Stack Overflow: Not Enough! has been accepted in TSE! [Nov 2019] I will serve on the program committee of ICPC 2020. [Oct 2019] I am co-organizing LTB 2020. Please consider submitting papers to the workshop. [Aug 2019] Congratulations to An Ran Chen on defending his MSc. He is now a PhD student at SPEAR! [Aug 2019] Congratulations to Zhenhao Li on defending his MSc. He is now a PhD student at SPEAR! Publications More Publications For the most up-to-date list of my publications, please see my Google Scholar page. Venues: 13 TSE (A*), 15 ICSE (A*), 5 FSE (A*), 1 FSE-SEIP (A*), 4 TOSEM (A*), 4 ASE (A*), 11 EMSE (A), 3 ICSME (A), 1 TR (A), 3 JSS (A), 5 MSR (A",
  "content_length": 19874,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:55"
}