{
  "name": "Tsui-Wei Lily Weng",
  "homepage": "https://lilyweng.github.io",
  "status": "success",
  "content": "Welcome to Tsui-Wei (Lily) Weng’s Homepage! | Lily’s homepage Welcome to Tsui-Wei (Lily) Weng’s Homepage! I am an assistant professor in Halıcıoğlu Data Science Institute with affiliation to Computer Science and Engineering Department at UC San Diego. My research vision is to make the next generation AI systems and deep learning algorithms more robust, reliable, trustworthy and safer. I’m open to collaborations with highly motivated students and post-doc researchers with strong machine learning and mathematical backgrounds! Please contact me with your CV and research experience once you have completed the form: For UCSD students: If you are a current/admitted UCSD student, please fill out this form For Visiting scholars: If you are interested in visiting opportunities, please fill out this form Education Ph.D in Massachusetts Institute of Technology, Cambridge, MA, 2020 Electrical Engineering and Computer Science Advisor: Prof. Luca Daniel Thesis: Evaluating robustness of neural networks M.S. in National Taiwan University, Taiwan, 2013 Graduate Institue of Communication Engineering Advisor: Prof. Tzong-Lin Wu Thesis: Design of Broadband Common-Mode Filters B.S. in National Taiwan University, Taiwan, 2011 Major: Electrical Engineering Graduated at class rank in the top 5% Work experience MIT-IBM Watson AI Lab, Cambridge, MA Research Staff Member, 2020-2021 Google DeepMind, London, UK Research Scientist Intern, Summer 2019 Project: Evaluating robustness of deep reinforcement learning agents with continuous control tasks Results published in ICLR 2020 IBM Research, Yorktown Heights, NY Research Intern, Summer 2018 Project: Evaluating robustness of neural networks IBM Research, Yorktown Heights, NY Research Intern, Summer 2017 Project: Trajectory data mining and anomaly detection Mitsubishi Electric Research Lab, Cambridge, MA Research Intern, Summer 2015 Project: Irregular bin-packing on 2D objects Institute of Mathematics, Academia Sinica, Taipei, Taiwan Research Intern, Summer 2009 Project: Combinatorics Research on Enhancing robustness of deep neural networks & AI safety Robust Deep Reinforcement Learning through Adversarial Loss T. Oikarinen, W. Zhang, A. Megretski, L. Daniel and T.-W. Weng NeurIPS 2021 On Fast Adversarial Robustness Adaptation in Model-Agnostic Meta Learning R. Wang, K. Xu, S. Liu, P.-Y. Chen, T.-W. Weng, G. Chuang and M. Wang ICLR 2021 Fast Training of Provably Robust Neural Networks by SingleProp A. Boopathy, T.-W. Weng, S. Liu, P.-Y. Chen, G. Zhang and L. Daniel AAAI 2021 Neural Network Control Policy Verification with Persistent Adversarial Perturbations Y.-S. Wang, T.-W. Weng, and L. Daniel, ICML 2020 Robust Deep Reinforcement Learning through Adversarial Loss T. Oikarinen, T.-W. Weng and L. Daniel ICML 2020, Uncertainty and Robustness in Deep Learning workshop Toward Evaluating Robustness of Deep Reinforcement Learning with Continuous Control T.-W. Weng, K. Dvijotham2, J. Uesato2, K. Xiao2, S. Gowal2, R. Stanforth2, Pushmeet Kohli ICLR 2020 Research on Neural network robustness, Deep learning theory, and Foundation models Revisiting Contrastive Learning through the Lens of Neighborhood Component Analysis: an Integrated Framework C.-Y. Ko, J. Mohapatra, S. Liu, P.-Y. Chen, L. Daniel and T.-W. Weng Preprint On the Equivalence between Neural Network and Support Vector Machine Y. Chen, W. Huang, L. M. Nguyen and T.-W. Weng NeurIPS 2021 Research on Neural network robustness verification and certification (with provable guarantees) Hidden Cost of randomized smoothing J. Mohapatra, C.-Y. Ko, T.-W. Weng, P.-Y. Chen, S. Liu and L. Daniel AIstats 2021 Higher order certification for randomized smoothing J. Mohapatra, C.-Y. Ko, T.-W. Weng, P.-Y. Chen, S. Liu and L. Daniel NeurIPS 2020 Certified Interpretability Robustness for Class Activation Mapping A. Gu, T.-W. Weng, P.-Y. Chen, S. Liu and L. Daniel NeurIPS 2020, ML4AD workshop [Video] Towards Verifying Robustness of Neural Networks Against a Family of Semantic Perturbations J. Mohapatra, T.-W. Weng, P.-Y. Chen, S. Liu and L. Daniel CVPR 2020 [Video] Towards Certificated Model Robustness Against Weight Perturbations T.-W. Weng1, P. Zhao1, S. Liu, P.-Y. Chen and X. Lin, L. Daniel AAAI 2020 Verification of Neural Network Control Policy Under Persistent Adversarial Perturbation Y.-S. Wang, T.-W. Weng and L. Daniel NeurIPS 2019, Safety and Robustness in Decision Making Workshop PROVEN: Verifying Robustness of Neural Networks with a Probabilistic Approach T.-W. Weng, P.-Y. Chen2, L. M. Nguyen2, M. S. Squillante2, A. Boopathy, I. Oseledets, and L. Daniel ICML 2019 POPQORN: Quantifying Robustness of Recurrent Neural Networks C.-Y. Ko1, Z. Lyu1, T.-W. Weng, L. Daniel, N. Wong, and D. Lin ICML 2019 CNN-Cert: An Efficient Framework for Certifying Robustness of Convolutional Neural Networks A. Boopathy, T.-W. Weng, P.-Y. Chen, S. Liu and L. Daniel AAAI 2019 Efficient Neural Network Robustness Certification with General Activation Functions H. Zhang1, T.-W. Weng1, P.-Y. Chen, C.-J. Hsieh and L. Daniel NeurIPS 2018 Toward Fast Computation of Certified Robustness for ReLU Networks T.-W. Weng1, H. Zhang1, H. Chen, Z. Song, C.-J. Hsieh, D. Boning, I. S. Dhillon and L. Daniel ICML 2018 Research on Neural network robustness evaluation and estimation Evaluating the Robustness of Neural Networks: An Extreme Value Theory Approach T.-W. Weng1, H. Zhang1, P.-Y Chen, J. Yi, D. Su, Y. Gao, C.-J. Hsieh and L. Daniel ICLR 2018 On extensions of clever: A neural network robustness evaluation algorithm T.-W. Weng1, H. Zhang1, P.-Y Chen, A. Lozano, C.-J. Hsieh and L. Daniel IEEE GlobalSIP 2018 Research on Robust Regression and Robust PCA Robust PCA through Robust Optimization Tsui-Wei Weng and Luca Daniel NeurIPS 2017, Women in Machine Learning Workshop (WiML) Computing Least Trimmed Squares Regression to Certifiable Optimality Tsui-Wei Weng, Rahul Mazumder and Luca Daniel NeurIPS 2017, Women in Machine Learning Workshop (WiML) Research on Uncertainty Quantification in silicon photonics Uncertainty Quantification of Silicon Photonic Devices with Correlated and Non-Gaussian Random Parameters Tsui-Wei Weng1, Zheng Zhang1, Zhan Su, Youssef Marzouk, Andrea Melloni and Luca Daniel Optics Express, vol. 23, Issue 4, pp.4242-4254, 2015 Stochastic Simulation and Robust Design Optimization of Integrated Photonic Filters Tsui-Wei Weng, Daniele Melati, Andrea Melloni and Luca Daniel Nanophotonics, vol. 6, Issue 1, pp. 299-308, July 2016 A Big-Data Approach to Handle Process Variations: Uncertainty Quantification by Tensor Recovery Zheng Zhang, Tsui-Wei Weng, and Luca Daniel IEEE Components, Packaging and Manufacturing Technology, Dec. 2016 (Best paper award) Research on Microwave circuits and Signal Integrity A Novel Miniaturized Bandstop Filter Using Defected Ground on System in Package(SiP) Tsui-Wei Weng and Tzong-Lin Wu IEEE EPEPS, Tempe, Arizona, USA, Oct. 2012 Synthesis Model and Design of a Common-Mode Bandstop Filter (CM-BSF) with An All-Pass Characteristic for High-Speed Differential Signals Tsui-Wei Weng, Chung-Hao Tsai, Chung-Hao Chen, Don-Ho Han and Tzong-Lin Wu IEEE Trans. Microw. Theory Tech., vol. 62, no.8, pp.1647-1656, Aug. 2014 Research on Combinatorics Hyperbolic Expressions of Polynomial Sequences and Parametric Number Sequences Defined by Linear Recurrence Relations of Order 2 Tian-Xiao He, Peter J.-S. Shiue, Tsui-Wei Weng Journal of Concrete and Applicable Mathematics, vol. 12, 63-85, 2014 Sequences of Numbers Meet the Generalized Gegenbauer-Humbert Polynomials Tian-Xiao He, Peter J.-S. Shiue, Tsui-Wei Weng ISRN Discrete Mathematics, vol. 2011, Article ID 674167, 16 pages, 2011 On relations of Chebyshev polynomial, Morgan-Voyce polynomial, Fibonacci number, Pell number and Lucas number (in Chinese) Tsui-Wei Weng Mathmedia, v.34, no. 4, p.31-42, 2010",
  "content_length": 7841,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:57"
}