{
  "name": "Tsung-Wei Huang",
  "homepage": "https://tsung-wei-huang.github.io/team",
  "status": "success",
  "content": "TW's Research Group - Team Toggle navigation TW@UW-Madison News Team Research Courses Publications Talks Life Open Positions! We are looking for highly self-motivated PhD, MS, and undergraduate students joining us, doing research on heterogeneous computing, computer-aided design, quantum computing, and machine learning systems. Please email Prof Huang your resume and research interest (see our Research and Why Join Our Team?). Faculty Tsung-Wei (TW) Huang Associate Professor, Department of ECE and CS (affiliate) University of Wisconsin at Madison, Madison, WI, USA, 53706 Office: Engineering Hall (EH) 3423 BS/MS (NCKU-CS@Taiwan), PhD (UIUC-ECE@USA) Bio Dr. Huang is an Associate Professor in ECE at the University of Wisconsin-Madison (UW-Madison), with an affiliate appointment in CS. Previously, he was an Assistant Professor at UW-Madison (2023–2025) and University of Utah (2019–2023). He earned his PhD in ECE from UIUC (2017) and BS/MS in CS from Taiwan’s NCKU (2011). His research focuses on building software systems for performance-critical applications, including CAD, machine learning, and quantum computing. His tools, such as Taskflow and OpenTimer, are widely used in industry and academia. Dr. Huang has received several awards, including ACM SIGDA Outstanding PhD Dissertation Award, NSF CAREER Award, Humboldt Research Fellowship, ACM SIGDA Outstanding New Faculty Award, ICCAD 10-Year Most Influential Paper Award (OpenTimer), DAC Under-40 Innovator Award, and Vilas Early-career Investigator Award. Beyond research, he is passionate about software performance and has won top 3 in multiple programming contests, such as ACM SIGDA CADathlon, TAU Timing Contest, IEEE HPEC Graph Challenge, ICCAD CAD Contest, and ACM PPoPP FCPC. Dr. Huang has served on the TPC in DAC, ICCAD, MICRO, ASPLOS, HPCA, SC, IPDPS, etc. PhD Students Wan-Luan Lee Spring 2022–present Research: Parallel and heterogeneous graph analytics Experience: Synopsys (summer’22), Cadence (summer’25) Che Chang (Randy) Spring 2022–present Research: Static timing analysis, GPU acceleration Experience: Intel (summer’22), Google (summer’24) Jiang Shui Spring 2022–present (co-supervised with Prof Tsung-Yi Ho at CUHK) Research: DNN compression and quantum computing Chih-Chun Chang Spring 2023–present Research: Statistical static timing analysis, GPU acceleration Experience: Cadence (summer’24, summer’25) Boyang Zhang Spring 2023–present Research: Parallel and heterogeneous computing algorithms for EDA Experience: Cadence (summer’24) Yi-Hua Chung Fall 2023–present Research: GPU-acceleration for testing and verification algorithms Experience: Synopsys (summer’24) Aditya Das Sarma Fall 2024–present Research: Differential optimization Experience: Synopsys (summer’25) This could be you ! Please email Prof Huang your resume and research interest. Master Students Aswin Kumar Spring 2025–present Research: LLM-assisted parallel computing Ting-Kuo Chen Spring 2024–present Research: Quantum physics This could be you ! Please email Prof Huang your resume and research interest. Undergraduate Students Saksham Dhuria Spring 2024–present Research: Task-parallel scheduler optimization This could be you ! Please email Prof Huang your resume and research interest. Alumni PhD 🎉🎉🎉 Jie Tong UW-Madison ECE PhD 2025 Research: Compiler-guided GPU-accelerated RTL simulation Dissertation: Towards Scalable and Efficient Parallel RTL and Network Simulation Systems First appointment: Software Engineer at Nvidia (since 2025) Cheng-Hsiang Chiu UW-Madison ECE PhD 2025 Research: Task-parallel programming system design Dissertation: Asynchronous Many-task System with Intelligent Scheduling First appointment: TBD Dian-Lun Lin (Aaron) UW-Madison ECE PhD 2024 Research: GPU-accelerated logic simulation and machine learning Dissertation: Task-Parallel Heterogeneous Programming System for Logic Simulation First appointment: Research Scientist at Intel Labs (since 2024) Guannan Guo UIUC ECE PhD 2023 (co-supervised with Prof Martin Wong at UIUC) Research: static timing analysis, heterogeneous computing Dissertation: Parallel and heterogeneous computing for static timing analysis First appointment: Software Engineer at Huawei (since 2023) MS 🎉🎉 Manu Maheshwari UW-Madison ECE Master 2025 Research: GPU task graph optimization First appointment: Senior Deep Learning Performanc Architect at Nvidia (since 2025) McKay Mower UofU ECE Master 2023 Research: Graph neural network, performance modeling First appointment: Software Engineer at Trident Sensing (since 2023) Luke Majors UofU ECE Master 2023 Research: Graph algorithms First appointment: Software Engineer at Trident Sensing (since 2023) Yasin Zamani UofU ECE Master 2021 Research: GPU programming, static timing analysis First appointment: Data Scientist at Variant (since 2022) BS 🎉 Shawn Zhu UW-Madison ECE Bachelor 2024 Research: GPU computing and algorithms First appointment: Software Engineer at Epic (since 2025) Elmir Dzaka UofU ECE Bachelor 2024 Research: Parallel logic simulation algorithms First appointment: PhD student at the University of Utah (since 2024) Why Join Our Team? The code of conduct in our group is to respect and support each other. Hierarchy does exist but only for project management. We solve real-world problems that matter to the society. You will find plenty of research opportunities for a BS/MS/PhD thesis. Specifically, in our group you will learn to: Apply ECE/CS knowledge to solve scientific computing problems Create impactful research projects and software systems Become a good programmer and an independent researcher We collaborate with many people from industry, academia, and government agencies. You can work with people around the world to explore different research ideas. After you leave our group, you will be ready for many job opportunities in both software and hardware companies. For instance, my students have been working in Nvidia, Intel, Cadence, Synopsys, IBM, Google, Huawei, etc. According to 2024 US News, the ECE Department of UW-Madison is ranked #9 among public universities and #15 among all universities. You will find plenty of resources to help you grow and advance your research career in our department and UW-Madison! © 2019-2025 Dr. Tsung-Wei Huang Department of Electrical and Computer Engineering University of Wisconsin at Madison, Madison, WI Contact: tsung-wei.huang at wisc dot edu 1415 Engineering Dr, Madison, WI 53706 (Campus Maps)",
  "content_length": 6457,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:58"
}