{
  "name": "Tsuyoshi Murata",
  "homepage": "http://www.net.c.titech.ac.jp/index.html",
  "status": "success",
  "content": "﻿ Murata Laboratory (Institute of Science Tokyo) Home Research Members Publications Join Us Access Japanese Murata Laboratory is doing research on artificial intelligence, especially network science, machine learning and Web mining. News Murata will give a talk (title: \"Machine Learning of Structured Data with Graph Neural Networks\") as an invited speaker of 136th SIG-KBS meeting of JSAI. (2025.12.3) A paper (Title:\"Oldie but Goodie: Re-illuminating Label Propagation on Graphs with Partially Observed Features\") written by Mr. Yun Suk Won (international visiting student from KAIST in 2022-2023) is accepted by KDD 2025. (2025.5.15) A pamphlet of our lab is available (English version and Japanese version). (2025.4.14) If you want to apply for Science Tokyo IGP(C), please read this site, and send the following documents to Murata by email: (i) your CV, (ii) your grade transcript(s), (iii) research proposal, (iv) list of publications, and (v) your thesis for graduating master/undergraduate course (if it is not written in English, please send any English technical papers/documents written by you). We will think about the possibilities of accepting you based on these documents. We will accept extraordinary excellent applicants only. Information about the briefing of our department is availabe in the following site (written in Japanese). https://admissions.isct.ac.jp/ja/013/graduate/open-campus-and-briefing-sessions/briefing-sessions Announcements from the Department of Computer Science are as follows (written in Japanese). https://educ.titech.ac.jp/cs/eng/ \"Graduate School Admissions FAQ\" is in the following site. https://www.titech.ac.jp/english/admissions/prospective-students/admissions/faq Application Guideline of Tokyo Tech Graduate School is available online (for the applicants of master course)(written in Japanese). Doctor course applicants have to request printed version of the guideline. https://admissions.isct.ac.jp/ja/013/graduate/guideline Master course applicants who wish to join Murata laboratory do not have to send emails in advance. (except Science Tokyo IGP(C) applicants) Doctor course applicants who wish to join Murata laboratory have to send the following documents by email in advance: (i) your CV, (ii) your grade transcript(s), (iii) research proposal, (iv) list of publications, and (v) your thesis for graduating master/undergraduate course (if it is not written in English, please send any English technical papers/documents written by you). Master / doctor course applicants who still have no English proficiency test score are strongly requested to take TOEIC or TOEFL as soon as possible. (except IGP(C) applicants) (2025.4.18) A paper (Title:\"Influence maximization on temporal networks: a review\") written by Dr. Eric Yanchenko (Akita International University, JSPS Researcher in 2023), Murata and Prof. Petter Holme (Aalto University) is accepted by Applied Network Science. (2024.5.14) Mr. Naoya Miyazaki (an alumnus of our lab) will receive JSAI Incentive Award for his presentation (title: \"Masked Graph Self-supervised Learning for Point Cloud\" (in Japanese)) at the 131st SIG meeting on Knowledge Base Systems. (2024.4.23) A paper (Title:\"DEGNN: Dual Experts Graph Neural Network Handling Both Edge and Node Feature Noise\") written by Mr. Tai Hasegawa (second grade of master course student) is accepted by PAKDD 2024. (2024.1.29) Murata gave a lecture titled \"Machine Learning for Structural Data with Graph Neural Networks\" at AIST AI seminar (in Japanese) (slides available in AIST site). (2023.10.17) A paper (Title:\"Predicting Potential Real-time Donations in YouTube Live Streaming Services via Continuous-time Dynamic Graph\") written by Mr. Jin Ruidong (3rd grade of doctoral student) is accepted by Machine Learning. (2023.10.10) A paper (Title:\"Class-Incremental Learning using Diffusion Model for Distillation and Replay\") written by Mr. Quentin Jodelet (3rd grade of doctoral student) won the Best Paper Award in 1st Workshop on Visual Continual Learning. (2023.10.2) A paper (Title:\"Link prediction for ex ante influence maximization on temporal networks\") written by Mr. Eric Yanchenko (North Carolina State University, JSPS Researcher in 2023), Murata and Prof. Petter Holme (Aalto University) is accepted by Applied Network Science. (2023.9.14) Admission: Application period for International Grauduate Program (C) (IGP(C)) has started. If you are interested in our laboratory and want to apply for Tokyo Tech IGP(C) program to be a master/doctor student, please read this site carefully, and send necessary documents to Murata by email. Application deadline for April 2024 admission is October 15, 2023. (2023.9.2) We explained our lab activities at Open Campus 2023 for high school students (in Japanese) (slides in Japanese). (2023.8.10) A paper written by Dr. Sunil Kumar Maurya (title:\"Feature Selection: Key to Enhance Node Classification with Graph Neural Networks\") is selected as a cover story of CAAI Transactions on Intelligence Technology (photo). (2023.4.6) A paper (Title:\"Strengthening Robustness under Adversarial Attacks using Brain Visual Codes\") written by Ms. Zarina Rakhimberdina (3rd grade of doctoral student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by IEEE Access (impact factor : 3.476). (2022.9.5) A paper (Title:\"Not All Neighbors are Friendly: Learning to Choose Hop Features to Improve Node Classification\") written by Mr. Sunil Kumar Maurya (third grade of doctoral course student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted as a short paper of CIKM 2022. (2022.8.2) Murata published a book titled \"Graph Neural Networks: implementation with PyTorch\" (Ohmsha (publisher) / Amazon / additional information). (2022.7.20) A paper (Title:\"Leaping Through Time with Gradient-based Adaptation for Recommendation\") written by Mr. Nuttapong Chairatanakul (3rd grade of doctoral students), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by AAAI 2022. (2021.12.1) A paper (Title:\"CVPR 2020 Continual Learning in Computer Vision Competition: Approaches, Results, Current Challenges and Future Directions\") written by Mr. Quentin Jodelet (2nd grade of doctoral student) is accepted by Artificial Intelligence. (2021.11.26) A paper (Title:\"Natural Image Reconstruction from fMRI using Deep Learning: A Survey\") written by Ms. Zarina Rakhimberdina (3rd grade of doctoral student), Mr. Quentin Jodelet (2nd grade of doctoral student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by Frontiers in Neuroscience, section Brain Imaging Methods. (2021.11.24) Murata gave a talk as an invited speaker of International Conference on Data Science and Official Statistics (ICDSOS 2021). (slides) (2021.11.13) Murata gave an online lecture to the students of Maebashi High School in Gunma Prefecture (Title: \"Understanding friendship and infectious disease spread in networks\"). (slides) (2021.11.9) Graduate School Admissions FAQ is available in the following site. https://www.titech.ac.jp/english/graduate_school/admissions/faq.html Murata gave a talk as an invited speaker of FAN 2021 Online (Title: \"Graph Neural Networks\"). (slides) (2021.9.21) A paper (Title:\"Cross-lingual Transfer for Text Classification with Dictionary-based Heterogeneous Graph\") written by Mr. Nuttapong Chairatanakul (3rd grade of doctoral student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by EMNLP 2021 as Findings of EMNLP. (2021.8.26) Murata delivered an online lecture for study of university departments at Toshin preparatory school. (2021.8.7) A paper (Title: \"PGRA: Projected Graph Relation-Feature Attention Network for Heterogeneous Information Network Embedding\") written by Mr. Nuttapong Chairatanakul (3rd grade of doctoral student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by Information Sciences (impact factor : 5.910). (2021.4.21) Murata and other 16 professors have received Education Award of Tokyo Tech (2019) for the implementation of Progressive Graduate Minor in Data Science and Artificial Intelligence. (2021.3.2) Murata's dialogue at Mirai Dining appeared in TechTech, Tokyo Tech PR magazine (written in Japanese). It also appeared in Prospective Students of Tokyo Tech Web site. (2021.1.6) A paper (Title: \"Predicting Emergency Medical Service Demand with Bipartite Graph Convolutional Networks\") written by Mr. Ruidong Jin (1st grade of doctoral student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by IEEE Access (impact factor : 3.745). (2021.1.5) Murata gave a lightening talk (Title:\"Network Analysis and Visualization by Google Colaboratory\") at Data Visualization meetup 2020. (slides) (2020.12.28) A paper (Title:\"Graph Neural Networks for Fast Node Ranking Approximation\") written by Mr. Sunil Kumar Maurya (second grade of doctoral course student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by ACM Transactions on Knowledge Discovery from Data (impact factor : 3.290). (2020.12.27) A paper (Title: \"Graph convolutional networks for graphs containing missing features\") written by Mr. Hibiki Taguchi (2nd grade of master student), Dr. Liu Xin (AIRC, AIST) and Murata is accepted by Future Generation Computer Systems (impact factor : 6.125). (2020.12.5) Murata gave a talk as an invited speaker of WCTP 2020 (Title:\"Networks, Deep Learning (and COVID-19)\"). (slides) (2020.11.21) Murata gave a talk in Educational Innovation Symposium 2020 (Title:\"An Attempt of On-Demand Classes by T2SCHOLA\") slides and videos (available inside of Tokyo Tech) (2020.11.13) A paper (Title:\"Active Learning on Graphs via Meta Learning\") written by Mr. Kaushalya Madhawa (fourth grade of doctoral student) is accepted by ACML 2020 (acceptance rate:31%). (2020.8.26) Murata wrote two Japanese articles (\"COVID-19 and Networks\" and \"Web Intelligence\" (co-authored with Prof. Yasufumi Takama)) to JSAI Journal Vol.35, No.5 (Sep. 2020) (2020.9.2) Mr. Quentin Jodelet (a doctoral student of our laboratory) was in the top 4 challenge winners (among 79 teams) of CVPR Challen",
  "content_length": 17203,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:59"
}