{
  "name": "Tsz-Chiu Au",
  "homepage": "https://chiuau.github.io",
  "status": "success",
  "content": "Welcome to Chiu's Home Page Tsz-Chiu Au Associate Professor Department of Computer Science Texas State University My goal is to study the scientific foundations and the real-world applications of AI-based robotic systems, specifically multiagent and multirobot systems, using both classical and modern AI techniques such as deep learning, heuristic search, dynamic programming, motion planning, domain-independent planning, automated reasoning, logic, and game theory. [CV] [Google Scholar] Open positions: If you are interested in joining my lab as a PhD student, please send me an email with your CV and transcripts. In the email, please tell me which research projects in my lab you like the most and explain how you can contribute to these projects. Alternatively, you are welcome to propose any interesting research topics in AI and robotics. Since most applicants are familiar with deep learning and data science, I shall be most interested in your skills and experience beyond machine learning. I apologize for only replying to applicants who have the potential to fit into my lab at this moment. Breaking news! We received the Catalyst Innovation Seed Award from Texas State University Center for Analytics and Data Science (TXST CADS) in 2025. The research topic is Optimization of Flood-Responsive Traffic Management for Emergency Evacuation. We were awarded a 5-year research grant by National Research Foundation of Korea, South Korea. The research topic is the optimal design of high-density parking lots for autonomous and semi-autonomous vehicles. I gave a talk on AI at the 2022 World Science Culture Forum in Daejeon. Here is the slides of my talk. We have released our software package for locating injured people in RoboCup Rescue Simulation (RCRS). For more information, please watch this video. The software was developed by Sangwoo Ha. Tune Mixer is an online tool for generating new tunes by mixing tunes. You can use Tune Mixer to explore different ways of combining tunes so as to create new tunes with new musical styles. This webapp was created by Temirlan Amangeldin and I using MusicVAE. We have released the online Iterated Prisoner's Dilemma simulation. This website was created by Thuy Nguyen Bui. Our drone team placed fourth in the Autonomous Drone Racing Competition at IEEE International Conference on Intelligent Robots and Systems (IROS) 2018. This video shows a test run of our drone in the competition. Our team members are Haeryang Kim and Minhyuk Park. I helped organize the Third Machine Learning in Planning and Control of Robot Motion Workshop at IEEE International Conference on Robotics and Automation (ICRA) 2018. Our IEEE Intelligent Systems-Special issue on Multi-Robot Systems is scheduled to be released in 2017. Dohee Lee received the Naver Fellowship in 2016. Ty Nguyen was awarded the prestigious VEF fellowship in 2016. Current Students: MD. Sameer Iqbal Chowdhury Ph.D., Computer Science, Texas State University. Research area: machine learning in robotics and autonomous systems. Minhyuk Park Ph.D., Computer Science, Texas State University. Research area: autonomous drones and robotics. Former Students: Minhyuk Park, 2024 M.S., Computer Science, UNIST. Research area: autonomous drones and robotics. Position after M.S. degree: Graduate Student at Texas State University Dohee Lee, 2022. Ph.D., Computer Science, UNIST. Research area: robotics. Position after Ph.D. degree: Senior Researcher at Korea Institute of Fusion Energy Jaebak Hwang, 2021. M.S., Computer Science, UNIST. Research area: reinforcement learning and intelligent transportation systems. Position after M.S. degree: Graduate student at UNIST Sangwoo Ha, 2019. M.S., Computer Science, UNIST. Research area: deep learning. Position after M.S. degree: AI researcher at Deepnoid, South Korea Dung Nguyen, 2018. M.S., Computer Science, UNIST. Research area: robotics. Position after M.S. degree: Graduate student at Deakin University, Australia Ty V. Nguyen, 2016. M.S., Computer Science, UNIST. Research area: autonomous vehicles control and planning. Position after M.S. degree: Graduate student at University of Pennsylvania, USA Lab Members (former and current): Miras Nagashbek, UNIST, 2023. Research area: automated planning. Alisher Karim, UNIST, 2022. Research area: web technology. Kaiyrly Mukhametkarim, UNIST, 2022. Research area: web technology. Mursultan Kobeisinov, UNIST, 2022. Research area: web technology. Temirlan Amangeldin, UNIST, 2020. Research area: deep learning. Muhammetmyrat Yarmatov, UNIST, 2020. Research area: autonomous drones. Sapar Charyyev, UNIST, 2019. Research area: autonomous drones. Kiyoung Kwon, UNIST, 2018. Research area: virtual/augmented reality and deep learning. Kanybek Asanbekov, UNIST, 2018. Research area: machine learning. Damir Kairzhanov, UNIST, 2018. Research area: autonomous vehicle. Uyoung Jeong, UNIST, 2018. Research area: transportation engineering. Eunchul Song, UNIST, 2017. Research area: machine learning. Minhyuk Park, UNIST, 2016. Research area: autonomous drones. Thuy Nguyen Bui, UNIST, 2015. Research area: game theory. Haeryang Kim, UNIST, 2015. Research area: autonomous vehicles and drones. Yisak Park, UNIST, 2014. Research area: computational economics. Giyoung Jeon, UNIST, 2013. Research area: robotics. Olzhas Kaiyrakhmet, UNIST, 2013. Research area: artificial intelligence. Ahmed Mukhtar, UNIST, 2013. Research area: artificial intelligence. Summer interns (former and current): Deeason Sitaula, Texas State University, 2025. Samrakshan Rijal, Texas State University, 2025. Miras Nagashbek, UNIST, 2023. Funda Hatice Oztoklu, UNIST, 2022. Tural Usubov, UNIST, 2022. Man Mai, UNIST, 2019. Yifan Ding, UC Berkeley, 2018. Carl Martin Krokeide, Norwegian University of Science and Technology (NTNU), 2018. Carlos Pérez Muñoz, University of Málaga, 2018. Minh Duc Tran, Lehigh University, 2018. Hyeok Sung Kwon, Chungbuk National University, 2018. Geunil Song, Kyungpook National University, 2018. Aybek Smagulov, UNIST, 2018. Sanzhar Aubakir, UNIST, 2018. Tomàš Kello, Czech Technical University in Prague, 2017. Sebastian Golos, Cardiff University, 2017. Alibek Taalaibek uulu, UNIST, 2017. Teaching: Artificial Intelligence (Fall 2022) Artificial Intelligence Programming II (Fall 2021) Autonomous Robots (Fall 2023) Advanced Robotics and Autonomous Systems (Fall 2025) Data Structures (Spring 2018) Data Structures and Algorithms (Spring 2025) Intelligent Robots (Spring 2021) Machine Learning / Deep Learning (Fall 2020) Special Topics on Web Technology (Fall 2023) Previous Affiliations: Learning Agents Research Group (LARG) and the AI Lab in the University of Texas at Austin. AI planning group and Laboratory for Computational Cultural Dynamics (LCCD) in the Department of Computer Science at the University of Maryland, College Park and the University of Maryland Institute for Advanced Computer Studies (UMIACS). Selected Projects: Interactive Drone Light Shows. The surge of drone light shows around the globe has proved its popularity as an entertainment platform for the masses. We consider using drone swarms as video game platforms and utilize planning techniques to display pixels in animations correctly while providing a fast response to user inputs. We define a contingency formation planning problem for interactive drone light shows, which aims to find a contingency formation plan such that drones can always move to the correct positions to display every possible future frame regardless of the user inputs in the future. A video about our interactive drone light show system Selected publications: Contingency Formation Planning for Interactive Drone Light Shows. ICRA 2025. Wind Field Modeling for Formation Planning in Multi-Drone Systems. ICRA 2024. Environment Design for Goal Recognition. Goal recognition design (GRD) is the task of modifying environments to aid observers in recognizing the objectives of agents during online observations. GRD can be used to identify intruders in public facilities such as airports and hospitals or discover a user’s intent when navigating a website. We propose a new GRD framework called extended goal recognition design (EGRD) for multiple goal recognition. Moreover, we describe a hierarchical design model that enforces some design constraints in environment design to speed up the redesign process. We present a new pruning rule called design subtree pruning rule for pruning some branches in the hierarchical and non-hierarchical design space. Slides of the talk in AAAI 2022 Selected publications: Block-Level Goal Recognition Design. AAAI 2024. Extended Goal Recognition Design with First-Order Computation Tree Logic. AAAI 2022. High-Density Parking for Autonomous Vehicles. Many cities suffer from a shortage of parking spaces. Research in high-density parking (HDP) focuses on how to increase the capacity of parking lots by allowing vehicles to block each other but temporarily give way to other vehicles by driving autonomously upon request. We propose the design of autonomous parking lots, which allows the deployment of different parking strategies in different regions in a parking lot while avoiding gridlock. Our simulation shows that autonomous parking lots can hold 60% more vehicles given the same amount of space. Introduction to Autonomous Parking Lots Demonstration video A video about formation planning in autonomous parking lots Selected publications: A Dynamic Programming Algorithm for Grid-based Formation Planning of Multiple Vehicles. IROS 2023. Gridlock-free Autonomous Parking Lots for Autonomous Vehicles. IROS 2021. Dynamic Robot Chains. When a team of robots moves many objects continuously, carrying objects from one place to another by individual robots may not be the most efficient way of transportation. We design new kinds of mobile robots that can pass objects at a distance (e.g., mobile conveyor robots) and program them to form robot chains that connect the initial location of objects t",
  "content_length": 27579,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:59"
}