{
  "name": "Tsz Hon Yuen",
  "homepage": "https://research.monash.edu/en/persons/john-yuen",
  "status": "success",
  "content": "John Yuen - Monash University View Scopus Profile John Yuen Assoc Professor Associate Professor, Department of Software Systems & CybersecurityImpact Labs https://orcid.org/0000-0002-0629-6792 EmailJohn.TszHonYuenmonashedu Accepting PhD Students 20052026 Research activity per year Personal profile BiographyDr John Tsz Hon Yuen is an associate professor and the Director of Research in the Department of Software Systems & Cybersecurity at Monash University. His expertise is in the area of cryptography, security, privacy, blockchain and FinTech. He is a member of the Central Bank Digital Currency (CBDC) Expert Group of the Hong Kong Monetary Authority. Dr Yuen published 80+ research papers including top tier conferences and journals in the area of cryptography and cybersecurity (CRYPTO, EUROCRYPT, CCS, SP, USENIX). Recent research highlight: CCS '23: Efficient threshold ECDSA signature for sharing the signing capability to multiple parties. Useful for securing digital wallet, by delegating some signing power to a custodian for security purpose.USENIX '23: Efficient unbalanced private set intersection cardinality, which allows two party to securly find the intersction of their own private set without leaking further information. Useful for cases like private COVID contact tracing (a set of user contact history vs. a set of infected patients)SP '23. Bitcoin-compatible privacy-preserving payment channel hubs supporting variable amounts. Useful for building private payment channel in Bitcoin.Crypto '21. DualRing: A generic construction of ring signature scheme, which gives the most efficient ring signature in both the DL and lattice-based settings. A variant of ring signature is used in privacy-preserving cryptocurrency Monero. Before joining Monash, Dr Yuen was an assistant professor in the Department of Computer Science at the University of Hong Kong. He had 4 years of industrial expereince at Huawei Singapore Research Centre and was a member of the Cryptography Expert Group in Huawei. He invented 10+ patents. He received his Ph.D. degree from the University of Wollongong in 2010.Research interestsCryptography (460401)Data security and protection (460403)Data and information privacy (460402)CybersecurityBlockchainFinanical TechnologyMonash teaching commitmentDr Yuen currently teaches system design and analysis in Monash. He delivered lectures in electronic commerce, blockchain and financial technology in the past.Supervision interestsDr Yuen is interested to supervise students in the area of cryptograhpy, cybersecurity and privacy. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformatics, Ph.D., University of WollongongAward Date: 1 Jul 2010Information Engineering, M.Phil, Chinese University of Hong KongAward Date: 1 Jul 2006Information Engineering, B.Eng., Chinese University of Hong KongAward Date: 1 Jul 2004 Research area keywordsCryptographyBlockchain securityPrivacy Enhancing TechnologyData security and protection:Data and information privacy Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2024 2024 2025 2026 2027 1 Not started 2 Active Projects per year Signature: Efficient Weighted Threshold SignatureCui, S. (Primary Chief Investigator (PCI)), Liu, J. (Chief Investigator (CI)) & Yuen, J. (Chief Investigator (CI))22/09/25 → 21/09/26Project: Research More Efficient: More Efficient and Scalable Post-Quantum Multi-SignaturesEsgin, M. (Primary Chief Investigator (PCI)), Steinfeld, R. (Chief Investigator (CI)), Yuen, J. (Chief Investigator (CI)) & Liu, J. (Chief Investigator (CI))1/08/24 → 31/12/25Project: Research Building Cyber Resilience in Fiji: Securing the Nation’s Digital FutureLiu, J. (Primary Chief Investigator (PCI)), Rudolph, C. (Chief Investigator (CI)), Boorman, J. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuen, J. (Chief Investigator (CI)), Ma, X. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)) & Liu, D. (Chief Investigator (CI))2/02/26 → 29/01/27Project: Other Research output Research output per year 2005 2006 2012 2013 2016 2019 2020 2021 2022 2023 2024 2025 2025 73 Conference Paper 22 Article 2 Foreword / Postscript Research output per year Research output per year DIDO+: Data Provenance from Restricted TLS 1.3 Websites with Selective DisclosureChan, K. Y., Cui, H., Yuen, T. H. & Yiu, S. M., Nov 2025, In: IEEE Transactions on Dependable and Secure Computing. 22, 6, p. 7107-7124 18 p.Research output: Contribution to journal › Article › Research › peer-review Message control for Blockchain rewritingLi, Y., Sengupta, B., Tian, Y., Yuan, J. & Yuen, T. H., May 2025, In: IEEE Transactions on Dependable and Secure Computing. 22, 3, p. 1864-1876 13 p.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) SoK: A Deep Dive Into Anti-money Laundering Techniques for Blockchain CryptocurrenciesFu, Q., Liu, J. K., Pan, S. & Yuen, T. H., 2025, Information Security and Privacy - 30th Australasian Conference, ACISP 2025, Proceedings. Susilo, W. & Pieprzyk, J. (eds.). Singapore Singapore: Springer, p. 310-330 21 p. (Lecture Notes in Computer Science; vol. 15658 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Threshold Ring Signatures: From DualRing to the t+1RingsYuen, T. H. & Pan, S., 1 Feb 2025, Provable and Practical Security - 18th International Conference, ProvSec 2024 Gold Coast, QLD, Australia, September 25–27, 2024 Proceedings, Part I. Liu, J. K., Chen, L., Sun, S.-F. & Liu, X. (eds.). Singapore Singapore: Springer, p. 269-288 20 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Using ChatGPT for medical education: the technical perspectiveChan, K. Y., Yuen, T. H. & Co, M., 7 Feb 2025, In: BMC Medical Education. 25, 1, 29 p., 201.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile View all 97 research outputs",
  "content_length": 6551,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:00"
}