{
  "name": "Tsz Nam Chan",
  "homepage": "https://edisonchan-szu.github.io",
  "status": "success",
  "content": "Homepage of Chan Tsz Nam Prof. Tsz Nam Chan (Edison) Distinguished Professor College of Computer Science and Software Engineering Shenzhen University Office: Zhiteng Building 618-3 my email: edisonchan2013928@gmail.com or edisonchan@szu.edu.cn Remember: \"Try our best and prepare for the worst\" Biography Tsz Nam Chan (Edison) is currently a Distinguished Professor in the database group of the Big Data Institute in Shenzhen University (SZU). He is a data engineering researcher (for handling the efficiency issues in big data settings). He published several research papers in prestigious conferences and journals (CCF: A, CSRankings, and top ranking in Google scholar) in both database (data engineering) and data mining areas, including SIGMOD, VLDB, ICDE, SIGKDD, and TKDE. Prior to joining the SZU, he was a Research Assistant Professor in the Hong Kong Baptist University from Sep 2020 to Aug 2023 and a postdoctoral researcher in The University of Hong Kong from Sep 2018 to Aug 2020. He received the PhD degree in computing and the BEng degree in electronic and information engineering from The Hong Kong Polytechnic University in 2019 and 2014, respectively. He is an IEEE senior member and an ACM member. Major Research-Oriented Awards Spatial Data Intelligence Rising Star Scholar from ACM SIGSPATIAL China (Awarded in 2025) IEEE Senior Member (Awarded in 2024) National Science Fund for Excellent Young Scientists (Overseas) (国家海外优青) (Awarded in 2023) Recruitment Tsz Nam Chan can recruit an assistant professor (subject to the final decision from SZU), an associate researcher (副研究员), postdoctoral researchers, postgraduate students (including master and PhD students), and software developers. If you are interested in developing efficient software packages/systems (like LIBKDV and KDV-Explorer) or complexity-reduced algorithms (like SLAM, SWS, SAFE, and PLAME) that are related to spatial/multi-dimensional databases, GIS, and statistical models, please contact me. To all potential students: Suppose that you want to join our research group (https://szu-dbgroup.github.io/) as a PhD student/MSc student. You need to send me your CV and your transcript. Note that our research group (1) mainly focuses on algorithm development with non-trivial guarantees (e.g., time complexity reduction/accuracy guarantees) for spatiotemporal data management/graph data management, (2) aims for publishing papers in top-tier venues (e.g., SIGMOD, VLDB, ICDE, SIGKDD, TODS, VLDBJ, and TKDE), and (3) needs highly motivated students. Therefore, those students who do not fulfill the above three conditions should not join this group. To all potential postdoctoral researchers/associate researchers: If you want to join our research group (https://szu-dbgroup.github.io/) as a postdoctoral researcher/associate researcher, you (1) must publish some papers in top-tier venues (e.g., SIGMOD, VLDB, ICDE, SIGKDD, TODS, VLDBJ, and TKDE) before as a first author and (2) must work on database/data mining/visualization/theoretical computer science areas. Those applicants who mainly want to apply machine learning models to improve the accuracy of some tasks should not apply for the postdoctoral researcher/associate researcher position in our group. Research Interests Algorithm and software development for statistical models (with non-trivial accuracy and time complexity guarantees) Spatial and temporal data analysis/management (develop efficient algorithms for GIS) Large-scale data visualization Low-altitude GIS Kernel methods, similarity measures, similarity search, and pattern matching Long-term Goal My long-term goal aims to develop the GIS (or spatial analysis), visualization, statistical, and machine learning software packages, like QGIS, ArcGIS, CrimeStat, Seaborn, Scikit-learn, Scipy, and LIBSVM, which are based on our theoretically efficient algorithms (e.g., reduce the time complexity) with non-trivial accuracy guarantees (e.g., achieve exact results or approximate results with approximation ratio). With the lower time complexity of our solutions, our software packages should be the fastest in the world. Research Grants PI: Guangdong Province Startup Grant for NSFC Excellent Young Scientists (Overseas), 500,000 RMB PI: NSFC (General Program) 2025 \"快速路网分析算法研究\" (Efficient Algorithms for Road Network Analytics), 500,000 RMB PI: Shenzhen University Internal Grant 2024 (研究生优秀教材建设项目) \"如何调整心态去撰写计算机科学论文？\" (How to Change Your Mindset to Write Academic Papers in Computer Science?), 200,000 RMB PI: Start-up grant from Shenzhen City (B-grade) 2024 (孔雀计划科研启动经费B档) \"快速地理信息系统算法\" (Fast Algorithms for Geographic Information Systems), 5,000,000 RMB PI: SZU Additional Start-up Grant 2024 \"大时空数据可视化\" (Large-scale Spatiotemporal Data Visualization), 700,000 RMB PI: NSFC (Excellent Young Scientists (Overseas)) 2023 \"地理时空大数据分析\" (Large-scale Spatiotemporal Data Analytics), 1,000,000 - 3,000,000 RMB PI: SZU Start-up Grant 2023 \"快速密度估计算法\" (Fast Algorithms for Density Estimation), 300,000 RMB PI: NSFC 2022 \"基于超快速算法的核密度估计\" (Efficient Algorithms for Kernel Density Estimation), 300,000 RMB PI: HKBU Internal Grant, 100,000 HKD PI: HKBU Start-up Grant, 120,000 HKD Research Students and Research Assistants Hongwei Ye, PhD student in SZU (My master student in SZU previously, cosupervised with Prof. Joshua Zhexue Huang) Yue Zhong, master student in SZU (Cosupervised with Prof. Joshua Zhexue Huang) Bojian Zhu, undergraduate research assistant in HKBU (From June 2023 to August 2024) (Coauthored two VLDB papers with me) Rui Zang, undergraduate research assistant in HKBU (From May 2023 to July 2023) (Coauthored one VLDB paper and one SIGMOD demo paper with me) Software/System Development Fast Line Density Analysis: A fast QGIS plug-in for supporting Line Density Visualization. (Accepted in SIGMOD 2025, demo track) Fast Density Analysis: A fast QGIS plug-in for supporting Kernel Density Visualization, Network Kernel Density Visualization, and Spatial-temporal Kernel Density Visualization. Rlibkdv: A fast R library for supporting Kernel Density Visualization, Network Kernel Density Visualization, and Spatial-temporal Kernel Density Visualization. PyNKDV: A fast python library for supporting Network Kernel Density Visualization. (Accepted in SIGMOD 2023, demo track) LIBKDV: A fast python library for supporting Kernel Density Visualization and Spatial-temporal Kernel Density Visualization. (Accepted in VLDB 2022, demo track) KDV-Explorer: A fast online system for supporting Kernel Density Visualization and Spatial-temporal Kernel Density Visualization. (Accepted in VLDB 2021, demo track) Book Tsz Nam Chan, Dingming Wu. Mastering the Academic Writing Mindset: A Guide to Crafting Computer Science Papers Springer Nature (To appear) Research Publications [DBLP][Google Scholar] (* indicates my student) Yue Zhong*, Tsz Nam Chan, Leong Hou U, Dingming Wu, Wei Tu, Ruisheng Wang, Joshua Zhexue Huang. A Fast and Accurate Block Compression Solution for Spatiotemporal Kernel Density Visualization Proceedings of ACM Conference on Knowledge Discovery and Data Mining (SIGKDD), 2025. (Code) (Powerpoint Presentation) (Poster Presentation) Siyue Wu, Dingming Wu, Sinhong Check, Tsz Nam Chan, Kezhong Lu. GREAT: Generalized Reservoir Sampling based Triangle Counting Estimation over Streaming Graphs Proceedings of the VLDB Endowment (PVLDB), 2025. Tsz Nam Chan, Pak Lon Ip, Bojian Zhu, Leong Hou U, Dingming Wu, Jianliang Xu, Christian S. Jensen. Large-scale Spatiotemporal Kernel Density Visualization IEEE International Conference on Data Engineering (ICDE), 2025. (Code) (Powerpoint Presentation) (Poster Presentation) Weike Tang, Dingming Wu, Tsz Nam Chan, Kezhong Lu. Spatially Compact Dense Block Mining in Spatial Tensors Proceedings of ACM Conference on Knowledge Discovery and Data Mining (SIGKDD), 2025. Zhiling Wang, Ruisheng Wang, Yujun Liu, Bo Guo, Tsz Nam Chan, Yibin Tian. Enhancing Few-Shot Point Cloud Semantic Segmentation via Superpoint Semantics IEEE International Geoscience and Remote Sensing Symposium (IGARSS), 2025. Bo Guo, Zhihai Huang, Haitao Luo, Perpetual Hope Akwensi, Ruisheng Wang, Bo Huang, Tsz Nam Chan. An Enhanced Network for Extracting Tunnel Lining Defects using Transformer Encoder and Aggregate Decoder International Journal of Applied Earth Observation and Geoinformation (IJAEOG). Tsz Nam Chan, Bojian Zhu, Dingming Wu, Yun Peng, Leong Hou U. LARGE: A Length-Aggregation-based Grid Structure for Line Density Visualization Proceedings of the VLDB Endowment (PVLDB), 2024. (Presented in VLDB 2025) (Code) (Powerpoint Presentation) (Poster Presentation) Siyue Wu, Dingming Wu, Junyi Quan, Tsz Nam Chan, Kezhong Lu. Efficient and Accurate PageRank Approximation on Large Graphs Proceedings of ACM Conference on Management of Data (SIGMOD), 2025. Appear in the new ACM journal \"Proceedings of the ACM on Management of Data (PACMMOD)\". Pak Lon Ip, Shenghui Zhang, Xuekai Wei, Tsz Nam Chan, Leong Hou U. HFGNN: Efficient Graph Neural Networks using Hub-Fringe Structures IEEE International Conference on Data Mining (ICDM), 2024. Renchi Yang, Yidu Wu, Xiaoyang Lin, Qichen Wang, Tsz Nam Chan, Jieming Shi. Effective Clustering on Large Attributed Bipartite Graphs Proceedings of ACM Conference on Knowledge Discovery and Data Mining (SIGKDD), 2024. Tsz Nam Chan, Rui Zang, Bojian Zhu, Leong Hou U, Dingming Wu, Jianliang Xu. LION: Fast and High-Resolution Network Kernel Density Visualization Proceedings of the VLDB Endowment (PVLDB), 2024. (Code) (Powerpoint Presentation) (Poster Presentation) Shunran Zhang, Xiubo Zhang, Tsz Nam Chan, Shenghui Zhang, Leong Hou U. A Computation-aware Shape Loss Function for Point Cloud Completion Annual AAAI Conference on Artificial Intelligence (AAAI), 2024. (Poster Presentation) Tsz Nam Chan, Zhe Li, Leong Hou U, Reynold Cheng. PLAME: Piecewise-Linear Approximate Measure for Additive Kernel SVM IEEE Transactions on Knowledge and Data Engineering (TKDE). (Code) Extended abstract in IEEE Internatio",
  "content_length": 24317,
  "method": "requests",
  "crawl_time": "2025-12-01 14:40:59"
}