{
  "name": "Tullio Vardanega",
  "homepage": "https://www.math.unipd.it/~tullio",
  "status": "success",
  "content": "Home Page di Tullio Vardanega (in costruzione) Tullio Vardanega Università di Padova (University of Padua) Dipartimento di Matematica (Dept. of Mathematics) Via Trieste 63, 35121 Padova, Italia. Telefono (Phone): +39 049 827 1359 Posta elettronica (Email): tullio.vardanega at unipd.it Short Bio Publons Academy Mentor Certificate Aree di ricerca (Research Areas) Sviluppo ed analisi di sistemi software in tempo reale di tipo embedded (Development of real-time embedded systems) Soluzioni di scalabilità nel Cloud (scalable service design in the Cloud) Processi e metodologie per lo sviluppo di sistemi software a elevata criticità (Processes and methodologies for the engineering of software-intensive high-integrity systems) Tecniche innovative di insegnamento (active learning methods in computer science education) e introduzione al pensiero computazionale (computational thinking primers) Progetti di ricerca internazionali ed eventi di interesse (International Research Projects and Events) PROXIMA (EC FP7, 2013-2016, Grant ID: 611085) CONCERTO (ARTEMIS, 2013-2016, Grant ID: JTI-333053) TACLe (COST, 2012-2016, Grant ID: IC1202) PROARTIS (EC FP7, 2010-2013, Grant ID: 249100) CHESS (ARTEMIS, 2009-2012, Grant ID: 100022) CHESS technology in Eclipse ASSERT (EC FP6, 2004-2008, Grant ID: 004033) HRT-UML/RCM Tutorial Eventi di interesse ACM SIGCSE 2020, ACM Symposium on Computer Science Education (Portland, OR, March 2020) Ada-Europe 2020, 24th Int'l Conference on Reliable Software Technologies (Santander, Spain, June 2020) ECRTS 2020, 32nd Euromicro Conference on Real-Time Systems (Modena, IT, July 2020) SafeComp 2020, 39th Int'l Conference on Computer Safety, Reliability and Security (Lisbon, PT, September 2020) Insegnamenti nei Corsi di Laurea in Informatica (Teaching assignments - Computer Science) Anno Accademico (academic year) 2020/2021 Ingegneria del Software. III anno laurea, 6+7 CFU, annuale (Software Engineering Foundations. 3rd year, 13.0 points Runtimes for Concurrency and Distribution. I anno laurea magistrale, 6 CFU, II semestre (4th year, 6.0 points) Real-Time Systems and Kernels. II anno laurea magistrale, 6 CFU, II semestre (5th year, 6.0 points) Anno Accademico (academic year) 2019/2020 Ingegneria del Software. III anno laurea, 6+7 CFU, annuale (Software Engineering Foundations. 3rd year, 13.0 points Sistemi Concorrenti e Distribuiti. I anno laurea magistrale, 6 CFU, II semestre (Concurrent and Distributed Systems, 4th year, 6.0 points) Sistemi Real-Time. II anno laurea magistrale, 6 CFU, II semestre (Real-Time Systems, 5th year, 6.0 points) Anno Accademico (academic year) 2018/2019 Ingegneria del Software. III anno laurea, 6+7 CFU, annuale (Software Engineering Foundations. 3rd year, 13.0 points Sistemi Concorrenti e Distribuiti. I anno laurea magistrale, 6 CFU, II semestre (Concurrent and Distributed Systems, 4th year, 6.0 points) Sistemi Real-Time. II anno laurea magistrale, 6 CFU, II semestre (Real-Time Systems, 5th year, 6.0 points) Anno Accademico (academic year) 2017/2018 Ingegneria del Software. III anno laurea, 6+7 CFU, annuale (Software Engineering Foundations. 3rd year, 13.0 points Sistemi Concorrenti e Distribuiti. I anno laurea magistrale, 6 CFU, II semestre (Concurrent and Distributed Systems, 4th year, 6.0 points) Sistemi Real-Time. II anno laurea magistrale, 6 CFU, II semestre (Real-Time Systems, 5th year, 6.0 points) Anni Precedenti 2001/2002 - 2016/2017 (Previous Years 2001/2002 - 2016/2017)",
  "content_length": 3476,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:06"
}