{
  "name": "Tuomas Sandholm",
  "homepage": "http://www.cs.cmu.edu/~sandholm",
  "status": "success",
  "content": "Tuomas W. Sandholm Tuomas Sandholm Angel Jordan University Professor Carnegie Mellon University Computer Science Department 5000 Forbes Avenue Pittsburgh, PA 15213 Co-Director, CMU AI Director, Electronic Marketplaces Laboratory Affiliated Professor Machine Learning Department Ph.D. Program in Algorithms, Combinatorics, and Optimization (ACO) Carnegie Mellon/University of Pittsburgh Joint Ph.D. Program in Computational Biology sandholm AT cs.cmu.edu (412) 268-8216 (office) Office: Gates Hillman Center room 9205 Executive Assistant: Pat Loring sawako AT andrew.cmu.edu, (412) 268-5628, Gates Hillman Center room 7025 Biography Tuomas Sandholm is Angel Jordan University Professor of Computer Science at Carnegie Mellon University and a serial entrepreneur. His research focuses on the convergence of artificial intelligence, economics, and operations research. He is Co-Director of CMU AI. He is the Founder and Director of the Electronic Marketplaces Laboratory. He has published over 500 peer-reviewed papers, holds 29 US patents, and his h-index is 98. In addition to his main appointment in the Computer Science Department, he holds appointments in the Machine Learning Department, Ph.D. Program in Algorithms, Combinatorics, and Optimization (ACO), and CMU/UPitt Joint Ph.D. Program in Computational Biology. He has built optimization-powered electronic marketplaces since 1989, and has fielded several of his systems. In parallel with his academic career, he was Founder, Chairman, first CEO, and CTO/Chief Scientist of CombineNet, Inc. from 1997 until its acquisition in 2010. During this period the company commercialized over 800 of the world's largest-scale generalized combinatorial multi-attribute auctions, with over $60 billion in total spend and over $6 billion in generated savings. Sandholm has developed the leading algorithms for several general classes of game with his students. The team that he leads is the multi-time world champion in computer heads-up no-limit Texas hold’em, which is the main benchmark and decades-open challenge problem for testing application-independent algorithms for solving imperfect-information games. Their AI Libratus became the first and only AI to beat top humans at that game. Then their AI Pluribus became the first and only AI to beat top humans at the multi-player game. That is the first superhuman milestone in any game beyond two-player zero-sum games. He is Founder and CEO of Strategy Robot, Inc., which focuses on defense, intelligence, and other government applications. He is also Founder and CEO of Strategic Machine, Inc., which provides solutions for strategic reasoning under imperfect information in a broad set of applications ranging from poker to other recreational games to business strategy, negotiation, strategic pricing, finance, cybersecurity, physical security, auctions, political campaigns, and medical treatment planning. Since 2010, his algorithms have been running the national kidney exchange for the United Network for Organ Sharing, where they autonomously make the kidney exchange transplant plan for 80% of U.S. transplant centers together each week. He also co-invented never-ending altruist-donor-initiated chains and his algorithms created the first such chain. Such chains have become the main modality of kidney exchange worldwide and have led to around 10,000 life-saving transplants. He invented liver lobe and multi-organ exchanges, and the first liver-kidney swap took place in 2019. He is Founder and CEO of Optimized Markets, Inc., which is bringing a new optimization-powered paradigm to advertising campaign sales, pricing, and scheduling - in TV (linear and nonlinear), Internet display, streaming (video and audio), mobile, game, and cross-media advertising. He served as the redesign consultant of Baidu’s sponsored search auctions and display advertising markets 2009-2011; within two years Baidu’s market cap increased 5x to $50 billion due to doubled monetization per user. He has served as consultant, advisor, or board member for Yahoo!, Google, Chicago Board Options Exchange, swap.com, Granata Decision Systems (now part of Google), Rare Crowds (now part of Media Math), and others. He holds a Ph.D. and M.S. in computer science and a Dipl. Eng. (M.S. with B.S. included) with distinction in Industrial Engineering and Management Science. Among his honors are the Vannevar Bush Faculty Fellowship, AAAI Award for AI for the Benefit of Humanity, IJCAI John McCarthy Award, Robert S. Engelmore Award, Minsky Medal, Computers and Thought Award, inaugural ACM Autonomous Agents Research Award, CMU’s Allen Newell Award for Research Excellence, Sloan Fellowship, NSF Career Award, Carnegie Science Center Award for Excellence, and Edelman Laureateship. He is Fellow of the ACM, AAAI, INFORMS, and AAAS. He holds an honorary doctorate from the University of Zurich. Research interests: Artificial intelligence; optimization (search and integer programming, combinatorial optimization, stochastic optimization, and convex optimization); game theory; equilibrium finding; algorithms for solving games; opponent modeling and exploitation; automated algorithm configuration; market design; mechanism design; electronic commerce; multiagent systems; auctions and exchanges; automated negotiation and contracting; advertising markets; computational advertising; kidney exchange; prediction markets; (automated) market making; voting; coalition formation; safe exchange; preference elicitation; normative models of bounded rationality; resource-bounded reasoning; fairness, privacy; multiagent learning; and machine learning. Curriculum vitae (including full list of publications) List of publications on DBLP Google Scholar profile Awards (some; full list, including best paper and classic paper awards, is on the CV) Vannevar Bush Faculty Fellowship, 2023. AAAI Award for AI for the Benefit of Humanity, 2023. “For outstanding scientific and software contributions to the design and implementation of organ exchanges, and their direct impact on both practice and policy.” Award talk “Modern Organ Exchanges: Market Designs, Algorithms, and Opportunities”. IJCAI John McCarthy Award, 2021. “For his significant research contributions to multiagent systems, computational economics, optimization and game playing, and their application in real-world settings.” Award talk “Developing and Using Superhuman AIs: What can Humans Contribute?” Robert S. Engelmore Award, 2021. “For outstanding research contributions in Artificial Intelligence, its application to electronic marketplaces, the highly original use of AI in strategic multi-player games, and the application of AI to optimize organ exchanges.” Award talk “What Can and Should Humans Contribute to Superhuman AI”. Fellow, American Association for the Advancement of Science (AAAS), 2021. “For distinguished contributions at the intersection of artificial intelligence, economics and operations research, especially in the context of organ exchanges and imperfect information games.” University Professor, 2020. 100 Most Intriguing Entrepreneurs award from Goldman Sachs, 2020. IJCAI Marvin Minsky Medal, 2019. Science Breakthrough of the Year Runner-Up, Science, 2019. Alumnus of the Year, Aalto University School of Science, 2019. Angel Jordan Professor of Computer Science (endowed chair), 2018. CMU’s Allen Newell Award for Research Excellence, 2018. Annual Supercomputing Award for Best use of AI, Supercomputing Conference (SC), 2018. One of the scientific breakthroughs of 2017, La Recherche. One of 12 runner-ups for Scientific Breakthrough of the Year 2017, Science. Annual Supercomputing Award for Best use of AI, Supercomputing Conference (SC), 2017. Honorary Doctorate, University of Zurich, 2016 INFORMS Fellow, 2014. “For contributions to research in computational economics, including market design, combinatorial auctions, and game theory, and for contributions to practice through companies that create new markets using optimization methods.” HPCWire Supercomputing Awards: Readers' Choice - Best Data-Intensive Application/Use, 2014. Outstanding Achievement in Research, UMass Outstanding Achievement and Advocacy Awards, 2009. Fellow of the ACM, 2008. “For contributions to combinatorial auctions and mechanism design.” Association for the Advancement of AI (AAAI) Fellow, 2008. “For significant contributions to the foundations of multiagent systems and computational game theory, pioneering work in combinatorial auctions, multiagent preference elicitation, and automated mechanism design, and principles and large-scale application of electronic marketplaces.” One of the three most influential academics in the business world, The Brilliant Issue: 73 Biggest Brains in Business, Conde Nast Portfolio Magazine, 2008. AAAI Deployed Application Award, 2006. Edelman Laureate, 2005. NIST ATP Gems and Success Stories, 2005. Carnegie Science Center Award for Excellence, 2004. IJCAI Computers and Thought Award, 2003. (Award talk writeup: “Making Markets and Democracy Work: A Story of Incentives and Computing” in Proceedings of the International Joint Conference on Artificial Intelligence (IJCAI-03), p. 1649-1671. Award talk (.ppt, 87MB with audio). Alfred P. Sloan Research Fellow, 2003-2005. Ernst & Young Entrepreneur of the Year Award finalist, Western PA, 2003. Inaugural ACM Autonomous Agents Research Award, 2001. National Science Foundation Career Award, 1997. Recent placement of PhD students into tenured or tenure-track positions: MIT EECS (Gabriele Farina), Stanford (Ellen Vitercik), CMU CSD (Vincent Conitzer) News HIRING! For Fall 2026, I will have one or two PhD student Graduate Research Assistant openings. Apply through CMU’s Computer Science Department. Here in our department, individual professors do not admit students to the program. Rather, admissions are done by the Graduate Admissions Committee. The application deadline is around the beginning of December. Make sure to mention that yo",
  "content_length": 75080,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:08"
}