{
  "name": "Turgay Korkmaz",
  "homepage": "http://www.cs.utsa.edu/~korkmaz",
  "status": "success",
  "content": "Welcome to Turgay Korkmaz's Home Page Professor Department of Computer Science The\tUniversity of Texas at San Antonio One UTSA Circle San Antonio, TX 78249 Office: NPB 3.330 Email: korkmaz [at] cs.utsa.edu Phone: (210) 458-7346 Fax: (210) 458-4437 Vital Statistics (Biography) (Resume) In 1994, I graduated with the first ranking from the Department of Computer Science & Engineering , Hacettepe University, Ankara, Turkey. In the same year, I started my graduate study in the Department of Computer Engineering and Information Science at Bilkent University, Ankara. In 1995, I was awarded with a government scholarship to study in USA. Then, I completed my studies at Bilkent University, and came to USA in June 1996. Since it was a requirement of my scholarship, I started MS again and received second MS degree, in December 1997, from the Department of Computer and Information Science at Syracuse University, Syracuse, NY. In January 1998, I started PhD in the Department of Elec. & Computer Eng. at the University of Arizona, Tucson, AZ. I have received my PhD degree in December 2001. My dissertation title was \"QoS routing in packet networks.\" I worked with Dr. Marwan Krunz who is the director of Broadband Networking Laboratory at the University of Arizona. Since January 2002, I am associated with the Dept. of Computer Science, University of Texas at San Antonio. Teaching Frequently taught courses Previous terms and classes Research Interests I work in the general area of computer networks and direct Next Generation Networks Laboratory (NGNL) at CS-UTSA. Specifically, I am interested in quality-of-services (QoS)-based networking issues in both wireline and wireless networks. Some of the specific topics I worked on include QoS-based routing, multiple constrained path selection under both exact and inaccurate information, efficient dissemination of network-state information, topology aggregation in hierarchical networks, performance evaluation of QoS-based routing protocols, IP-traceback, topology control and neighbor verification in wireless networks, intersection characteristics of the Internet path and trees. Recently I also start working on network security, network measurement and modeling. I am also interested in Distributed Systems, Internet Related Technologies, and Multimedia Applications. Grants NSF S-STEM, Supporting Student Scuccess and Increasing Diversity in Comuter Science, by Increasing Financial Opportunities and Co-curricular Utilities for Siccess in Computer Scince (I-FOCUS-CS) ~$1M, April 2018-March 2023. PI ( Grant Web Page) Department of Defense, Prioritization-based QoS Support with Attack Resilience in Wireless Ad Hoc Networks, DoD Infrastructure Support Program for HBCU/MI, $587,872, Oct 2008--Aug 31, 2012, (PI) (Grant Web Page). CIAS Research Support, Integrated QoS and security mechanisms to support mission critical applications in MANETs, $78,291 for Dec 2006--Dec 2007 (PI) (Grant Web Page). NSF CRI: Experimental Research in High-Performance Computing and Wireless Networking, Award Number: 0551501 $556,817, 6/1/2006--5/31/2012. (Co-PI) CIAS Research Support, Power-efficient mechanisms for detecting replay-based intruders in wireless ad hoc networks, $31,542 for 6/1/2004--12/31/2004 (PI), and $24,250 for 9/1/2005-8/31/2006 (PI). (Grant Web Page). NSF High Performance Network Connections (HPNC) Award ANI-0228927 HPNC: Internet 2 Connectivity for UTHSCSA and UTSA, Award Number: 0228927 $150,000. 9/15/2002 -- 8/31/2004. (Co-PI) Theses and Dissertations Supervised Ongoing Sharvari Komajwar, PhD student Completed Erdal Akin, PhD, October 2018 (Assistan Prof. in Turkey) Drew Wichmann, PhD, April 2015 (NSA) Xinran Yu, PhD, April 2015 (MosaixSoft) Rehan Akbani, PhD, Aug 2009 (MD Anderson, Houston) Wei Zhou, MS, Summer 2006 (Real Networks) Did some research Navid Pustchi, PhD student Burcu Demirelli Okkalioglu, MS student Mark Griffin, MS student Charles Zinsmeyer, MS, May 2012 Husnu Narman, MS, May 2011 Justin Chester, PhD student Craig Fenrich, MS student Salvador Rodriguez, MS student Morteza Shahriari Nia, MS student Faranak Sorooshian, MS student Darin Reed, Undergrad student Brian D. Kendall, Undergrad student Juan C. Martinez, Undergrad student Jason Cochetti, MS student Tommy Nguyen, MS student Jyothi Guntaka, PhD student Publications Please see my Resume Professional Activities Please see my Resume This page certified up-to-date on March 31, 2020 by Turgay Korkmaz.",
  "content_length": 4461,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:11"
}