{
  "name": "Tushar Krishna",
  "homepage": "http://tusharkrishna.ece.gatech.edu",
  "status": "success",
  "content": "Tushar Krishna – Personal Website Skip to main navigation Skip to content Now in main content Associate Professor School of Electrical and Computer Engineering School of Computer Science  (Adjunct) Georgia Institute of Technology Contact Office: Klaus Advanced Computing Center, Room 2318 Mailing Address: 266 Ferst Drive, Atlanta, GA 30332 Email: tushar <at> ece <dot> gatech <dot> edu Education PhD in Electrical Engineering and Computer Science, MIT, 2014 MSE in Electrical Engineering, Princeton University, 2009 B.Tech in Electrical Engineering, IIT Delhi, 2007 Brief Bio Tushar Krishna is an Associate Professor in the School of Electrical and Computer Engineering (ECE) at Georgia Institute of Technology, with a courtesy appointment in Computer Science. He held the ON Semiconductor (Endowed) Junior Professorship in ECE at Georgia Tech from 2019-2021. He has also been a visiting professor at MIT EECS + CSAIL, Harvard University CS and a researcher at Intel’s VSSAD group. He has a Ph.D. in Electrical Engineering and Computer Science from MIT (2014), a M.S.E in Electrical Engineering from Princeton University (2009), and a B.Tech in Electrical Engineering from the Indian Institute of Technology (IIT) Delhi (2007). Dr. Krishna’s research spans computer architecture, interconnection networks, networks-on-chip (NoC), and AI/ML accelerator systems – with a focus on optimizing data movement in modern computing platforms. His research is funded via multiple awards from NSF, DARPA, IARPA, SRC (including JUMP2.0), Department of Energy, Intel, Google, Meta/Facebook, Qualcomm and TSMC. His papers have been cited over 17,000 times. Three of his papers have been selected for IEEE Micro’s Top Picks from Computer Architecture, one more received an honorable mention, and four have won best paper awards. Dr. Krishna was inducted into the HPCA Hall of Fame in 2022. At Georgia Tech, he has been honored by the “Class of 1940 Course Survey Teaching Effectiveness Award” in 2018, the “Roger P. Webb Outstanding Junior Faculty Award” from the School of ECE in 2021, the “Richard M. Bass/Eta Kappa Nu Outstanding Junior Teacher Award” in 2023, and the “Roger P. Webb Outstanding Mid-career Faculty Award” from the School of ECE in 2024. Dr. Krishna currently serves as an Associate Director for the Center for Research into Novel Computing Hierarchies (CRNCH) – a cross-disciplinary research center at Georgia Tech. He is also a co-chair of the Chakra Execution Traces and Benchmarks Working group within ML Commons. Research Interests Computer System Architecture Interconnection Networks and On-Chip Networks AI/ML Inference Accelerators AI/ML Distributed Training Platforms ML-assisted System Design Reconfigurable Computing Edge Computing Quick Links Synergy Lab Latest News Publications Released Tools Distributed AI/ML Training Platforms: ASTRA-sim, Chakra AI/ML Accelerator Design-Space Exploration: MAESTRO,  SCALE-sim, STONNE NoC: Garnet2.0, OpenSMART DNN Accelerator RTL: MAERI Teaching Spring 2025: Hardware-Software Co-Design for Machine Learning Systems Spring 2024: Hardware-Software Co-Design for Machine Learning Systems Fall 2022: Architecture, Systems, Concurrency, and Energy in Computation Spring 2022: Interconnection Networks for High-Performance Systems Fall 2021: Architecture, Systems, Concurrency, and Energy in Computation Spring 2021: Interconnection Networks for High-Performance Systems Spring 2021: Architecture, Systems, Concurrency, and Energy in Computation Spring 2020: Interconnection Networks for High-Performance Systems Spring 2020: Architecture, Systems, Concurrency, and Energy in Computation Fall 2019: Advanced Computer Architecture Spring 2019: Hardware Acceleration for Machine Learning Spring 2019: Interconnection Networks for High-Performance Systems Fall 2018: Architecture, Concurrency, and Energy in Computation Spring 2018: Architecture, Concurrency, and Energy in Computation Spring 2018: Interconnection Networks for High-Performance Systems Summer 2017: Networks-on-Chip @ ACACES Summer School Spring 2017: Interconnection Networks Fall 2016: Advanced Computer Architecture Spring 2016: Interconnection Networks Fall 2015: Advanced Computer Architecture Professional Service Conference Organization Program Vice-Chair: ISCA 2023 Artifacts Evaluation Co-Chair: HPCA 2022 General Chair: NOCS 2021 Tutorials and Workshops Chair: ISPASS 2021 Program Co-Chair: NOCS 2020 Co-Chair: RISC-A 2019 Special Sessions Co-Chair: NOCS 2019 Co-Chair: Inaugural RISC-A 2018 Publicity Co-Chair: NOCS 2018 Student Travel Grants Co-Chair: PACT 2018 Student Travel Grants Co-Chair: ISCA 2017 Tutorials and Workshops Chair: ASPLOS 2016 Technical Program Committee MICRO 2025 ASPLOS 2025 IEEE Micro Top Picks 2025 ISCA 2025 MLSys 2025 Rising Stars in MLSystems 2025 MICRO 2024 ISCA 2024 MLSys 2024 MICRO 2023 IEEE Micro Top Picks 2023 MLSys 2023 ASPLOS 2023 DATE 2023 TPC topic co-chair for “Design Methodologies for Machine Learning Architectures” MICRO 2022 SC 2022 MLSys 2022 IEEE Micro Top Picks 2022 HPCA 2022 DATE 2022 TPC topic co-chair for “Design Methodologies for Machine Learning Architectures” MICRO 2021 ISCA 2021 ISCAS 2021 DATE 2021 TPC topic co-chair for “Design Methodologies for Machine Learning Architectures” HPCA 2021 MICRO 2020 ISCA 2020 IEEE Micro Top Picks 2020 DATE 2020 Hot Interconnects 2019 MICRO 2019 PACT 2019 ISCA 2019 DAC 2019 TPC track chair for “In-Package and On-Chip Communication and Networks-on-Chip” DATE 2019 AISTECS 2019 MICRO 2018 DAC 2018 IPDPS 2018 ISPASS 2018 DATE 2018 DAC 2017 DATE 2017 MICRO 2016 Hot Interconnects 2016 DAC 2016 Extended Review Committee (ERC) HPCA 2025 HPCA 2023 ASPLOS 2019 HPCA 2019 MICRO 2017 ISCA 2017 PACT 2016 &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;img alt=”Clicky” width=”1″ height=”1″ src=”//in.getclicky.com/101000119ns.gif” /&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;/p&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt; &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;p&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt; Back to top",
  "content_length": 7376,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:11"
}