{
  "name": "Tyge Tiessen",
  "homepage": "https://orbit.dtu.dk/en/persons/jens-tyge-tiessen",
  "status": "success",
  "content": "Tyge Tiessen - Welcome to DTU Research Database View Scopus Profile Tyge Tiessen Associate Professor, Department of Applied Mathematics and Computer ScienceCybersecurity EngineeringCenter for Quantum Technologies https://orcid.org/0000-0003-1189-9528 EmailtytidtudkWebsitehttp://www.compute.dtu.dk Richard Petersens Plads, 322, 2082800 Kgs. LyngbyDenmark Fingerprint Dive into the research topics where Tyge Tiessen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 4 Similar Profiles Block Cipher Mathematics 100% Cryptanalysis Mathematics 86% Probability Theory Mathematics 55% Differential Cryptanalysis Mathematics 50% Data Complexity Computer Science 41% Design Strategy Computer Science 41% Cryptographic Primitive Computer Science 41% AES Mathematics 36% View full fingerprint Publications 8 Article in proceedings 3 Journal article 1 Ph.D. thesis Research output per year Research output per year Is this your USB? No, but check this QR code for a free meal! Assessing awareness against dropped USBs and malicious QR codesNordskov, J., Tiessen, T. & Vasilomanolakis, E., 2025, Proceedings of the 7th Workshop on Attackers and Cyber-Crime Operations (WACCO 2025) : Co-located with the 10th IEEE European Symposium on Security and Privacy (Euro S&PW) . IEEE, 13 p.Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile Targeted Environment 100% Activation Rate 100% USB Drive 33% Making the News 16% Total Activation 16% 201 Downloads (Orbit) Formal Analysis of Boomerang ProbabilitiesKidmose, A. B. & Tiessen, T., 2022, In: IACR Transactions on Symmetric Cryptology. 2022, 1, p. 88-109Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile Formal Analysis 100% Probability Theory 100% Boomerang Attack 80% Nonzero Probability 50% Boomerangs 40% 160 Downloads (Orbit) Finding Integral Distinguishers with EaseEskandari, Z., Kidmose, A. B., Kölbl, S. & Tiessen, T., 1 Jan 2019, Selected Areas in Cryptography – SAC 2018 . Cid, C. & Jacobson, M. J. (eds.). Springer, p. 115-138 (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 11349 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile Cryptographic Primitive 100% Design Strategy 100% Block Cipher 100% Data Complexity 100% Data Encryption 100% 279 Downloads (Orbit) Cryptanalysis of low-data instances of full LowMCv2Rechberger, C., Soleimany, H. & Tiessen, T., 1 Jan 2018, In: IACR Transactions on Symmetric Cryptology. 2018, 3, p. 163-181Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile group signature 100% Group Signature Scheme 40% Picnic 40% Enumeration Techniques 40% 159 Downloads (Orbit) From Higher-Order Differentials to Polytopic CryptyanalysisTiessen, T., 2017, Paradigms in Cryptology . Springer, Vol. 10311. p. 544-552 (Lecture Notes in Computer Science, Vol. 10311).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Cryptanalysis 100% Higher Order Differential 100% Block Cipher 50% Data Complexity 50% Cryptographic Technique 50% View all 12 publications Projects 3 Finished Projects per year IDS for CAV: IDS for CAV: A Deep Learning and Blockchain-secured Intrusion Detection System (IDS) for Connected and Autonomous Vehicles (CAVs) in Smart CitiesKidmose, B. E. (PhD Student), Tiessen, T. (Main Supervisor), Jensen, C. D. (Supervisor), Meng, W. (Supervisor), Düdder, B. (Examiner) & Zeng, G. (Examiner)01/11/2022 → 31/10/2025Project: PhD Connected Vehicles 100% Intrusion Detection System 100% Autonomous Vehicles 100% Deep Learning 100% Smart City 100% Long-Term Security for Big DataKidmose, A. B. (PhD Student), Boura, C. (Examiner), Johansson, T. (Examiner), Meng, W. (Main Supervisor), Andersen, B. (Supervisor) & Tiessen, T. (Supervisor)Technical University of Denmark15/01/2018 → 12/09/2022Project: PhD Block Cipher 100% Cryptographic Algorithm 100% Symmetric Cryptographic Algorithm 100% Internet of Things 16% Reidentification 16% Trusted CryptographyTiessen, T. (PhD Student), Rechberger, C. (Main Supervisor), Jensen, C. D. (Examiner), Daemen, J. (Examiner), Johansson, T. (Examiner) & Knudsen, L. R. (Supervisor) Eksternt finansieret virksomhed01/07/2013 → 25/08/2016Project: PhD Block Cipher 100% Cryptanalysis 100% Symmetric Cipher 33% Differential Cryptanalysis 33% AES 33%",
  "content_length": 4625,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:15"
}