{
  "name": "Tyler Derr",
  "homepage": "https://tylersnetwork.github.io",
  "status": "success",
  "content": "Tyler Derr Tyler Derr Home CV(pdf) Openings Research Publications Google Scholar DBLP Students Awards Professional Teaching Services Community Outreach Talks Social Media LinkedIn Twitter NDS Twitter NDS Github Links NDS Lab @VU DSE Lab @MSU Tyler Derr Assistant Professor Department of Computer Science, College of Connected Computing Vanderbilt University Network and Data Science (NDS) Lab Email: (first).(last)@vanderbilt.edu Office: 4030 Sony Building Mail: 400 24th Ave S Rm 254, Nashville, TN 37212 Google Scholar Linkedin Follow @tylersnetwork Short Bio Dr. Tyler Derr is an Assistant Professor of Computer Science at Vanderbilt University and Director of the Network and Data Science Lab. His research develops new methods in graph machine learning, large language models and AI agents, and data-centric & trustworthy AI, which are applied to domains including social networks, recommender systems, and computational drug discovery. He has published 60+ papers in top AI/DM/ML venues, received the NSF CAREER Award and other research distinctions, and is active in the research community through major conference leadership, tutorials, and mentorship of award-winning students. (Extended bios can be found here.) Selected Highlights (see full CV for complete details) Awards & Recognition NSF CAREER Award (2023) NVIDIA Academic Grant Program Award (2024) Young Investigator Best Paper Award - KDD'25 Health Day Best Paper Award - GLFrontiers Workshop at NeurIPS'23 Teaching Innovation Award - VU Engineering Fall'20 Vanderbilt Career Catalyst Impact Award (2025) Leadership & Service Associate Editor: ACM TKDD, IEEE TBD, Tsinghua Science and Technology Organizing Committees: KDD, CIKM, SDM, DSAA, WSDM Tutorials at AAAI, KDD, CIKM, SDM 40+ invited talks at leading universities, institutes, and industry labs worldwide Research Interests Data mining; machine learning; deep learning on graphs; network science; large language models and AI agents; data-centric AI; responsible and trustworthy AI; social network analysis; recommender systems; and AI for scientific and societal applications, including computational drug discovery [Open positions] I am recruiting PhD students to work with us in the NDS Lab on topics in our general interests (see NDS Lab research interests to the right). Master's and undergraduate students within Vanderbilt University and visiting scholars are also welcome. Please feel free to email me. Please see here for position details. Recent News (before 2025 can be seen here) 2025 11/2025: Our paper SAVE-TAG: Semantic-Aware Vicinal Risk Minimization for Long-Tailed Text-Attributed Graphs is accepted at KDD2026 11/2025: Honored to receive Vanderbilt's Provost Immersion Grant for Faculty to support our work ‘‘Building Trustworthy AI: Ensuring Privacy and Security in Language Models’’ 11/2025: Our paper ‘‘Graph2Video: Leveraging Video Models to Model Dynamic Graph Evolution’’ is accepted at AAAI2026 11/2025: Our paper ‘‘SuperWater as a Generative AI Framework to Predict Water Molecule Positions on Protein Structures’’ is accepted at Communications Chemistry 10/2025: Preprint Scaffold-Aware Generative Augmentation and Reranking for Enhanced Virtual Screening 10/2025: Invited to serve as a member of the IEEE Task Force on Learning for Graphs 10/2025: Recognized on the 2025 Stanford/Elsevier list of the World's Top 2% Scientists 9/2025: Preprint Large Language Models for Conversational User Simulation: A Comprehensive Survey 8/2025: Preprint Mitigating Distribution Shift in Graph-Based Android Malware Classification via Function Metadata and LLM Embeddings 8/2025: Preprint Defining and Benchmarking a Data-Centric Design Space for Brain Graph Construction 8/2025: Preprint Inverse-LLaVA: Eliminating Alignment Pre-training Through Text-to-Vision Mapping 8/2025: Invited to serve as Editorial Board Member for ACM AI Letters, a newly launched, first-of-its-kind rapid-publication journal for impactful AI reserach – check it out here 8/2025: Honored to receive a Young Investigator Best Paper Award (3rd) from KDD’25 Health Day for my Blue Sky paper ‘‘Referral Required: When AI Blocks Access to Human Doctors’’ 8/2025: Former PhD Yu Wang receives 2025 ACM SIGKDD Dissertation Award Honorable Mention 8/2025: Preprint ‘‘Towards Bridging Review Sparsity in Recommendation with Textual Edge Graph Representation’’ 8/2025: Honored to serve as Senator in Vanderbilt's Faculty Senate as a School of Engineering representative 7/2025: Honored to receive an NSF grant for the project Towards Well-Rounded Graph Retrieval for Retrieval-Augmented Generation 7/2025: Our paper ‘‘Explanation Difference: Bridging Procedural and Distributional Fairness’’ is accepted at AAAI/ACM Conference on AI, Ethics, and Society (AIES) 6/2025: Invited to give a KDD’25 Health Day Blue Sky Spotlight talk ‘‘Referral Required: When AI Blocks Access to Human Doctors’’ 6/2025: Recognized as a 2024 Top Scholar by ScholarGPS, ranking in the top 0.5% worldwide overall and ranked top 50 in Data Mining over the past five years 6/2025: Our paper ‘‘Edges Matter: An Analysis of Graph Time-Series Representations for Temporal Networks’’ is accepted in IEEE Transactions on Network Science and Engineering (TNSE) 5/2025: Our paper ‘‘Personalization of Large Language Models: A Survey’’ is accepted in Transactions on Machine Learning Research (TMLR) 5/2025: Our paper ‘‘BTS: A Comprehensive Benchmark for Tie Strength Prediction’’ is accepted at KDD2025 5/2025: Honored to be selected as one of the inaugural Vanderbilt CARE Fellows to work towards enhancing student well-being and fostering a more supportive campus environment. 5/2025: Preprint ‘‘Amplifying Your Social Media Presence: Personalized Influential Content Generation with LLMs’’ 5/2025: Preprint ‘‘SimAug: Enhancing Recommendation with Pretrained Language Models for Dense and Balanced Data Augmentation’’ 4/2025: Our paper Advancements in Ligand-Based Virtual Screening through the Synergistic Integration of Graph Neural Networks and Expert-Crafted Descriptors is accepted in the Journal of Chemical Information and Modeling (JCIM) 4/2025: Honored to be selected as the sole recipient of Vanderbilt’s 2025 Career Catalyst Impact Award 4/2025: Awarded NSF grant to support student travel for US-based students to attend SDM2025 3/2025: Xin (Allen) Wang successfully defended his MS thesis ‘‘Data-Centric AI for Small Molecule Drug Discovery’’ – congratulations! Next Position: PhD in Computational Biology & Biomedical Informatics at Yale University 3/2025: Xueqi Cheng successfully defended his MS thesis ‘‘Edge-Centric Network Analytics’’ – congratulations! Next Position: PhD in Computer Science at Florida State University 3/2025: Qinwen Ge successfully defended her MS thesis ‘‘Enhanced Brain Graph Construction in Neuroimaging: A Data-Centric AI Approach’’ Next Position: staying for her PhD in Computer Science at Vanderbilt University 3/2025: Yuying Zhao successfully defended her PhD dissertation ‘‘Learning Beyong Utility: Fairness, Explainability, and Diversity’’ – congratulations, Dr. Zhao! Next Position: Advanced AI Research Scientist Senior Manager at Accenture 3/2025 Our work SuperWater: Predicting Water Molecule Positions on Protein Structures by Generative AI was accepted and presented at NVIDIA GTC AI Conference 3/2025: Our demo paper Real-Time Freeway Traffic Anomalous Event Detection System via Radar Detector Sensors is accepted at ACM/IEEE International Conference on Cyber-Physical Systems (ICCPS2025) 2/2025: Our workshop Machine Learning on Graphs in the Era of Artificial General Intelligence is accepted at KDD2025 1/2025: Our paper Signed Network Dataset Repository: Extracting Signed Relations from Social Networks is accepted at IEEE ICC2025 1/2025: Our paper A Large-scale Training Paradigm for Graph Generative Models is accepted at ICLR2025 1/2025: Our paper ‘‘Demystifying the Power of Large Language Models in Graph Generation’’ is accepted at NAACL2025 Findings Page generated 2025-11-24 23:22:40 CST, by jemdoc.",
  "content_length": 8045,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:12"
}