{
  "name": "Tze-Yun Leong",
  "homepage": "https://www.comp.nus.edu.sg/~leongty",
  "status": "success",
  "content": "Home LEONG, Tze-Yun PhD, FACMI, FIAHSI Professor of Practice of Computer ScienceSchool of ComputingNational University of Singapore O:  COM2-03-53M: Computing 1, 13 Computing Drive, Singapore 117417E:  leongty[at]nus[dot]edu[dot]sg Hello! I am a faculty member of the Department of Computer Science at the School of Computing (SoC), National University of Singapore (NUS). I direct the Medical Computing Laboratory, a multidisciplinary research program at the School. I was formerly Director of AI Technology at AI Singapore, a national research initiative on Artificial Intelligence (AI).My research interests include decision-theoretic and responsible AI, cognitive modelling and causal reasoning, transfer and reinforcement learning, human-aware and adaptive computing, and biomedical and health informatics.I teach undergraduate and graduate courses in AI and general computing methodologies, including AI planning and decision making, and uncertainty modelng in AI. I also participate in national and international policy advisory work on Computing Education, general AI, Responsible AI - including Ethics, Governance, and Regulatory Considerations for AI, especially AI in Health. Teaching News [July 2021]Positions available:â¢ Teaching assistantsCS4246/CS5446 AI Planning and Decision Making (Sem 1, 2021-22). Requirements: Graduate GAP or NSWS or undergraduate NSWS applicants who have taught or taken the course before. Research News [July 2021]Positions available:â¢ Research Fellowâ¢ Research EngineerRequirements: Strong background and interests in AI planning and decision making, responsible AI[May 2021]News about our work: Creating Human-aware AI Policy and Outreach News [28 June 2021] World Health Organization (WHO) Guidance on Ethics and Governance in Artificial Intelligence for Health. [April 2021] Digital health during covid-19: Informatics dialogue with the World Health Organization.",
  "content_length": 1913,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:14"
}