{
  "name": "Tzu-Chien Hsiao",
  "homepage": "https://sites.google.com/site/labview704/About-Us/TC",
  "status": "success",
  "content": "labview705 — Virtual Biomedical Management Lab - TCSearch this siteEmbedded FilesSkip to main contentSkip to navigationProfessor Tzu-Chien Hsiao, Ph. D. 蕭 子 健 博士Hsiao, Tzu-Chien Associate Professor Department of Computer Science,Hsinchu, Taiwan 30010Tel: +886-3-5712121#54786Fax: +886-3-5721490E-mail: labview@cs.nycu.edu.tw or labview@g2.nctu.edu.tw學經歷現職國立陽明交通大學 資訊工程學系 2021/02-迄今專任副教授國立陽明交通大學 生醫工程研究所(電機學院) 2021/02-迄今合聘副教授 主要學歷國立陽明大學 醫學工程研究所 1996/09-2003/07 博士 與專長相關之經歷國立交通大學 資訊工程學系 2015/08-2021/01 專任副教授 國立交通大學 人體與行為研究倫理治理中心 2015/08-2021/01(兼任)主任國立交通大學 生醫工程研究所(電機學院) 2018/02-2021/01合聘副教授 工研院生醫與醫材所 2017/07-2018/12特聘研究(所長室) 國立交通大學 資訊工程學系 2006/08-2015/07 專任助理教授國立台灣大學(借調) 新竹生物醫學園區 2004/08-2006/07生醫研究規劃組 副組長 私立義守大學 生物醫學工程學系 2003/08-2006/01專任助理教授 國立陽明大學 醫學工程研究所 2001/08-2003/07專任物理教學助教 研究專長研究領域與興趣在醫學工程領域中生醫光電訊號分析、神經網路架構分析與規劃、醫用虛擬儀器設計與建構、生醫機電系統整合規劃與認證法規之測試、非線性動力學與多變數生醫光電訊號之分析等；人體實驗與理論並行。 1.開發多變數生醫光電訊號之分析方法； 2.探討神經網路架構分析與規劃及其應用性； 3.醫用虛擬儀器之設計與建構； 4.生醫機電系統整合規劃與認證法規之測試； 5.圖控程式 LabVIEW 之教育推廣。發表文章(五年內資料)(A) 期刊論文/原始創作(journal paper/original contributions)57. (ESCI) P.-C. Lin, C.-C. Chang, H.-Y. Hsu, and T.-C. Hsiao*, “Frequency domain analysis for assessing fluid responsiveness by using instantaneous pulse ratevariability”, International Journal of Advanced Computer Science and Applications (IJACSA), 7(2): 229-233, 2016.58. (SCI) D.-L. Hsieh and T.-C. Hsiao*, “Respiratory sinus arrhythmia reactivity of internet addiction abusers in negative and positive emotional states using film clips stimulation”, BioMedical Engineering OnLine, 15(69), doi: 10.1186/s12938-016-0201-2, 2016. 59. (SCI) Y.-C. Chen and T.-C. Hsiao*, “Instantaneous phase difference analysis between thoracic and abdominal movement signals based on complementary ensemble empirical mode decomposition”, BioMedical Engineering OnLine, 15(112) doi: 10.1186/s12938-016-0233-7, 2016.60. P.-H. Huang, C.-C. Chang, C.-Y. Huang, and T.-C. Hsiao*, “Can very high frequency instantaneous pulse rate variability serve as obvious indicator of peripheral circulation?”, Journal of Communication and Computer, 14: 65-72, 2017. 61. D.-L. Hsieh and T.-C. Hsiao*, “Emotional response of Internet gaming disorder gamer among Taiwan college students,” Advanced Science Letters, 23(4): 3782-3785, https://doi.org/10.1166/asl.2017.9012, 2017, 62. 蕭子健*、謝景旭, “呼吸量測裝置之簡介”, 科儀新知(生醫工程專題), 213: 30-38, 2017.12.63. Y.-M. Wu, P.-M. Lee, and T.-C. Hsiao*, “Searching for target audience based on Facebook demographics”, Biometrics & Biostatistics International Journal, 6(5): 001179. doi: 10.15406/bbij.2017.06.00179, 2017.12.64. (SCI) Y.-C. Chen and T.-C. Hsiao*, “Towards estimation of respiratory muscle effort with respiratory inductance plethysmography signals and complementary ensemble empirical mode decomposition”, Medical & Biological Engineering & Computing, doi: 10.1007/s11517-017-1766-z, 2017.65. (EI) J.-H. Lee, T.-C. Hsiao*, C.-C. Chang, and H.-Y. Hsu, “Magnitude variation of arterial blood pressure measured using Holo-Hilbert spectral analysis”, Advances in Data Science and Adaptive Analysis, 10(3), 1850007, doi: 10.1142/S2424922X18500079, Sep., 2018.66. (SCI) S.-C Jin, C.-J. Hsieh, J.-C. Chen, S.-H. Tu, Y.-C. Chen, T.-C. Hsiao, Angela Liu, W.-H. Chou, W.C. Chu, and C.-W. Kuo, “Development of limited-angle iterative reconstruction algorithms with context encoder-based sonogram completion for Micro-CT Applications”, Sensor, 18(12), 4458, doi: 10.3390/s18124458, Dec. 2018.67. (SCI Q2) H.-M. Ji and T.-C. Hsiao*, “A novel cue-induced abdominal reaction analysis for Internet gaming disorder”, Journal of Medical Systems, 43:94, doi: 10.1007/s10916-019-1221-9, Feb. 2019.68. (EI) C.-H. Huang, and T.-C. Hsiao*, “Toward T-wave recognition of ECG signals through modulated ensemble empirical mode”, Advances in Data Science and Adaptive Analysis, 10(3), 1850007, doi: 10.1142/S2424922X21500029, Jan., 2021.(B) 研討會論文(conferences paper, meeting abstract)125. (EI) P.-C. Lin, C.-C. Chang, H.-Y. Hsu, and T.-C. Hsiao*, “A short-term assessment of cardiac output by using instantaneous pulse rate variability,” The 8th International Conference on eHealth, Telemedicine, and Social Medicine, Venice, Italy, Apr. 24-28, 2016. (Oral) (Best Paper Award)126. (EI) P.-H. Huang, C.-C. Chang, and T.-C. Hsiao*, “The analysis of youngster with fever by using instantaneous pulse rate variability,” The 8th International Conference on eHealth, Telemedicine, and Social Medicine, Venice, Italy, Apr. 24-28, 2016. (Oral)127. D.-L. Hsieh and T.-C. Hsiao, “Emotional response of Internet Gaming Disorder gamer among Taiwan college students”, The 2016 International Conference on Internet Economics and Psycho-Informatics, Bandung, Indonesia, July. 23-24, 2016. (Oral) 128. (EI) H.-M. Ji, D.-L. Hsieh, and T.-C. Hsiao, “Emotional responses of Internet Gaming Disorder by doing abdominal breathing”, The 2016 3rd International Conference on Biomedical Engineering, Hanoi, Vietnam, Oct. 5-6, 2016. (Oral)129. (EI) D.-L. Hsieh and T.-C. Hsiao, “Heart rate variability of Internet Gaming Disorder addicts in emotional states”, The 2016 3rd International Conference on Biomedical Engineering (BME-HUST 216), Hanoi, Vietnam, Oct. 5-6, 2016. (Oral)130. (EI) P.-H. Huang, C.-C. Chang, and T.-C. Hsiao*, “The ultra-band study of pulse rate variability of homecare by using instantaneous pulse rate variability,” The 9th International Conference on eHealth, Telemedicine, and Social Medicine, Nice, France, Mar. 19-23, 2017. (Oral) 131. (EI) J.-H. Lee, Y.-C. Chen, and T.-C. Hsiao*, “Application of Holo-Hilbert spectral analysis on human breathing movement with isovolume maneuver” The 9th International Conference on eHealth, Telemedicine, and Social Medicine, Nice, France, Mar. 19-23, 2017. (Oral)132. (B class) L.-Y. Chen, Y.-L. Yang, and T.-C. Hsiao*, “ZCSR for targeting the optimal impedance in digital radio frequency matching box”, Proceedings of the 18th International Conference on Genetic and Evolutionary Computation Conference, Berlin, Germany, Jul. 15-19, 2017.133. C.-N. Wang, H.-M. Ji, D.-L. Hsieh, and T.-C. Hsiao*, “Analysis of facial expression on Internet gaming disorder”, 8th WACBE World Congress on Bioengineering, Hong Kong, China, Jul. 30-Aug. 2, 2017. (Oral)134. H.-M. Ji, L.-Y. Chen, and T.-C. Hsiao*, “Psychometric properties of Chen Internet addiction scale using zeroth-level classifier system”, 8th WACBE World Congress on Bioengineering, Hong Kong, China, Jul. 30-Aug. 2, 2017. (Oral)135. P.-H. Huang and T.-C. Hsiao*, “A pilot study of the comparison of the heart rate recovery after step test between before and after learning abdominal breathing by using IVM method”, Annual Symposium on Biomedical Engineering and Technology, Taoyuan, Taiwan, Nov. 11, 2017. (Oral)136. S.-C. Jin, J.-C. Chen, S.-H. Tu, Y.-C. Chen, T.-C. Hsiao, and Angela Liu, “Limited-angle iterative reconstruction (LAIR) as a new approach to reducing radiation dose without sacrificing image quality: context-encoder based sinogram completion and image-quality based stopping-criteria applied to a laboratory micro-CT system”, 2018 IERI International Conference on Medical Physics, Medical Engineering and informatics (ICMMI 2018), Macau China, Sep. 7-9, 2018.137. P.-H. Huang, C.-F. Yeh, Y.-F. Luo, and T.-C. Hsiao*, “Towards instantaneous phase difference on the COPD pre-discrimination”, IEEE International Conference on Digital Signal Processing (DSP 2018), Shanghai, China, Nov. 19-21, 2018. (Oral)138. H.-M. Ji and T.-C. Hsiao*, “The prolonged effect on respiratory sinus arrhythmia response of individual with Internet gaming disorder via breathing exercise”, The 3rd International Conference on Biomedical and Health Informatics (ICBHI 2019), Taipei, Taiwan, Apr. 17-20, 2019. (Oral) (also in K.-P. Lin, R. Magjarevic, P. de Carvalho (eds) Future Trends in Biomedical and Health Informatics and Cybersecurity in Medical Devices. IFMBE Proceeding, v.74, Springer)139. H.-M. Ji and T.-C. Hsiao*, “Instantaneous respiratory phase response of individual with Internet gaming disorder during watching game video”, The 3rd International Conference on Biomedical and Health Informatics (ICBHI 2019), Taipei, Taiwan, Apr. 17-20, 2019. (Oral) (also in K.-P. Lin, R. Magjarevic, P. de Carvalho (eds) Future Trends in Biomedical and Health Informatics and Cybersecurity in Medical Devices. IFMBE Proceeding, v.74, Springer)140. (B class) L.-Y. Chen, J.-H. Lee, Y.-L. Yang, M.-T. Yeh, and T.-C. Hsiao*, “Predicting the remaining useful life of plasma equipment through XCSR”, 1263-1270, GECCO’19- Proceedings of the Genetic and Evolutionary Computation Conference Companion, Prague, Czech Republic, Jul. 13-17, 2019. ACM 2019, ISBN 978-1-4503-6748-6141. (B class) H.-M. Ji, L.-Y. Chen, and T.-C. Hsiao*, “Real-time detection of internet addition using reinforcement learning system”, 1280-1288, GECCO’19- Proceedings of the Genetic and Evolutionary Computation Conference Companion, Prague, Czech Republic, Jul. 13-17, 2019. ACM 2019, ISBN 978-1-4503-6748-6142. (EI) H.-M. Ji and T.-C. Hsiao*, “Instantaneous respiratory response of gamer with high-risk Internet gaming disorder during game-film stimuli by using complementary ensemble empirical mode decomposition”, 42th Annual International Conference of the IEEE-EMBS, Montreal, Canada, Jul. 20-24, 2020.143. H.-M. Ji and T.-C. Hsiao*, “Instantaneous pulse rate variability of Taiwan college students with gaming disorder during online game film stimuli”, 4th Global Conference on Biomedical Engineering & Annual Meeting of TSBME, Taipei, Taiwan, Nov. 20-24, 2020.144. (EI) W.-C. Lai, P.-H. Huang, and T.-C. Hsiao*, “Relationship between breath regulation and stroke volume with exercise intensity: A pilot study”, The 12th International Conference on eHealth, Telemedicine, and Social Medicine (eTELEMED 2020), Valencia, Spain, Nov. 21-25, 2020. (Oral)145. (EI) C.-T. Liu, P.-H. Huang, and T.-C. Hsiao*, “Pilot study-Towards estimations of continuous cardiac output with impedance cardiography”, The 12th Int",
  "content_length": 11658,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:15"
}