{
  "name": "Tülay Adali",
  "homepage": "http://www.csee.umbc.edu/~adali",
  "status": "success",
  "content": "Tulay Adali, Machine Learning for Signal Processing Lab, University of Maryland Baltimore County (UMBC) Tülay Adali received the Ph.D. degree in Electrical Engineering from North Carolina State University, Raleigh, NC, USA, in 1992 and joined the faculty at the University of Maryland Baltimore County (UMBC), Baltimore, MD, the same year. She is currently a Distinguished University Professor in the Department of Computer Science and Electrical Engineering at UMBC and is the director of the Machine Learning for Signal Processing Lab (MLSP Lab). Prof. Adali assisted in the organization of a number of international conferences and workshops including the IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP), the IEEE International Workshop on Neural Networks for Signal Processing (NNSP), and the IEEE International Workshop on Machine Learning for Signal Processing (MLSP). She was the General Co-Chair, NNSP (2001–2003), MLSP 2023, Technical Chair, MLSP (2004–2008); Program Chair, MLSP (2008, 2009, and 2014), International Conference on Independent Component Analysis and Source Separation (2009); Publicity Chair, ICASSP (2000 and 2005); and Publications Chair, ICASSP 2008. She was the Technical Program Co-Chair for ICASSP 2017 and Special Sessions Chair for ICASSP 2018, ICASSP 2024, and EUSIPCO 2020. She is the Technical Program and Workshops Co-Chair for ICASSP 2026. Prof. Adali is currently the editor-in-chief of the Signal Processing Magazine, and has served as the Chair of the IEEE Brain Technical Community, and Vice President-Technical Directions of the IEEE Signal Processing Society (SPS) for the period 2019-2022. She chaired the IEEE SPS MLSP Technical Committee (2003–2005, 2011–2013), and served or currently serving on a number of committees/boards including the SPS Conference Board (1998–2006, 2017-Present), IEEE SPS Fellow Reference Committee (2011-2014), IEEE SPS Signal Processing Theory and Methods (2010-2015) Technical Committee, and the IEEE SPS Bio Imaging and Signal Processing Technical Committee (2004–2007, 2018-Present). She was an Associate Editor for IEEE Transactions on Signal Processing (2003–2006), IEEE Transactions on Biomedical Engineering (2007–2013), IEEE Journal of Selected Areas in Signal Processing (2010-2013), and Elsevier Signal Processing Journal (2007–2010), and served on the Editorial Board of the Proceedings of the IEEE (2013-2019). She is currently serving on the Senior Editorial Board of IEEE Journal of Selected Topics in Signal Processing and the Editorial Board of Journal of Signal Processing Systems for Signal, Image, and Video Technology. Prof. Adali is a Fellow of the IEEE, AIMBE, AAIA, a Fulbright Scholar, and an IEEE Signal Processing Society Distinguished Lecturer. She is the recipient of a 2020 Humboldt Research Award, 2013 University System of Maryland Regents' Award for Research, an NSF CAREER Award, and a number of paper awards including the 2010 IEEE Signal Processing Society Best Paper Award. Her current research interests are in the areas of statistical signal processing, machine learning, and applications in medical image analysis and fusion.",
  "content_length": 3175,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:19"
}