{
  "name": "U Kang",
  "homepage": "https://datalab.snu.ac.kr/~ukang",
  "status": "success",
  "content": "U Kang U Kang Professor Department of Computer Science and Engineering Interdisciplinary Program in Artificial Intelligence Data Mining Lab Seoul National University 1 Gwanak-ro, Gwanak-gu, Seoul, Republic of Korea 08826 Email: ukang at snu.ac.kr Office: Room 301-502 I am a Professor in the Department of Computer Science and Engineering at Seoul National University. I am also a Head Professor in the Interdisciplinary Program in Artificial Intelligence at Seoul National University. Here is my short biography and full Curriculum Vitae. I lead the Data Mining Lab in Department of Computer Science and Engineering. I advise DeepTrade, a company providing state-of-the-art financial AI technologies. (Announcement) If you are interested in an internship in our lab, please read this before sending an application. What's New (May 2022) Our paper \"DPar2: Fast and Scalable PARAFAC2 Decomposition for Irregular Dense Tensors\" won the Best Research Paper Award (Honorable Mention) at ICDE 2022. (Aug. 2021) Our paper \"Fast and Memory-Efficient Tucker Decomposition for Answering Diverse Time Range Queries\" won the Best Research Paper Award at KDD 2021. (May 2020) Our paper \"Accurate News Recommendation Coalescing Personal and Global Temporal Preferences\" won the Best Student Paper Award at PAKDD 2020. (Feb 2019) I gave a tutorial on Lightweight Deep Learning with Model Compression in IEEE BigComp 2019. (Nov 2018) I won the 10-Year Highest Impact Paper Award from IEEE International Conference on Data Mining (ICDM). (Feb 2018) PegasusN, a new version of Pegasus graph mining system is released. (Dec 2016) I won the 1st Young Information Scientist Award from Korean Institute of Information Scientists and Engineers. (Aug 2013) I won the 2013 SIGKDD Doctoral Dissertation Award, Honorable Mention. (Mar 2013) I won the 2013 New Faculty Award from Microsoft Research Asia. Courses Current Semester Fall 2025, M1522.001400: Introduction to Data Mining Previous Semesters Spring 2025, M1522.000900: Data Structure Fall 2024, M1522.001400: Introduction to Data Mining Spring 2024, M1522.000900: Data Structure Spring 2024, M2177.008600: Introduction to AI Fall 2023, M3309.000200: Reinforcement Learning Spring 2023, M1522.000900: Data Structure Spring 2023, M2177.004900: Introduction and Practice of IoT, AI, and Big Data Fall 2022, M2177.003000: Advanced Data Mining Fall 2022, M1522.001400: Introduction to Data Mining Spring 2021, M3309.000200: Reinforcement Learning Spring 2021, M1522.001400: Introduction to Data Mining Fall 2020, M2177.003000: Advanced Data Mining Fall 2020, M1522.000900: Data Structure Spring 2020, M2177.004900: Introduction and Practice of IoT, AI, and Big Data Fall 2019, M1522.000900: Data Structure Fall 2019, M2177.003000: Advanced Data Mining Spring 2019, M1522.001400: Introduction to Data Mining Spring 2019, M1522.001600: Reinforcement Learning (Topics in Big Data Analytics) Fall 2018, M1522.000900: Data Structure Fall 2018, M1522.001600: Advanced Deep Learning (Topics in Big Data Analytics) Spring 2018, M1522.001400: Introduction to Data Mining Spring 2018, 4190.773: Optimization for Machine Learning (Topics in Artificial Intelligence) Fall 2017, M1522.000900: Data Structure Fall 2017, M1522.001600: Advanced Deep Learning (Topics in Big Data Analytics) Spring 2017, M1522.001400: Introduction to Data Mining Spring 2017, M1522.001600: Deep Learning (Topics in Big Data Analytics) Fall 2016, M1522.000900: Data Structure Fall 2016, 4190.209: Computer Engineering Seminar Spring 2016, M1522.001400: Introduction to Data Mining Fall 2015, M1522.000900: Data Structure Research Interests My research interests are large-scale Data Mining and Machine Learning. I develop core methods in AI and data science for 1) predictive modeling and anaylyzing real world data (e.g., graphs, tensors, time series, text, etc.), and 2) fast/adaptive inference and learning. Applications include recommender system, financial AI, industrial machine learning, social network, and anomaly detection. Deep Learning and Machine Learning Model compression (Lightweight model construction, LLM (large language model) compression, and On-device AI) Reinforcement learning for real-world problems Graphs and Tensors Graph neural network Patterns/models from graphs/tensors, and scalable analysis using GPU and distributed systems Recommender / Question-Answering (QA) Systems Diversified and accurate recommendation for news, videos, e-commerce, and finance Personalized QA system, AI agent with LLM, and trustworthy LLM Financial Artificial Intelligence (AI) Time series prediction and classification Portfolio management and optimal trading strategy Awards and Honors (My Awards) Shinyang Engineering Academic Award, 2022 Best Research Paper Award (Honorable Mention), at ICDE, 2022 Best Research Paper Award, at KDD, 2021 Second Prize Award, at MIND News Recommendation Competition, 2020 Best Student Paper Award, at Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2020 10-Year Highest Impact Paper Award, IEEE International Conference on Data Mining (ICDM), 2018 Young Information Scientist Award, Korean Institute of Information Scientists and Engineers, 2016 SIGKDD Doctoral Dissertation Award, Honorable Mention, 2013 New Faculty Award from Microsoft Research Asia, 2013 Best Application Paper Award, at Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2011 Open Source Software Award, Silver, at Open Source Software World Challenge, 2010 Best Application Paper Award, Runner-up, at IEEE International Conference on Data Mining (ICDM), 2009 (My Students' Awards) Minjun Kim, Yulchon AI Research Fellowship, Sep. 2024 Huiwen Xu, Etnews ICT Best Paper Award, Nov. 2023 Hyunsik Jeon, Best Ph.D. Thesis Award in SNU CSE, Aug. 2023 SeungCheol Park, Yulchon AI Star Fellowship, 2023 Hyunsik Jeon, Sejong Science Fellowship for Postdoctoral Research, 2023 Jun-Gi Jang, Postdoctoral Research Award from NRF, 2023 Jun-Gi Jang, Best Ph.D. Thesis Award in SNU CSE, Feb. 2023 Hyojin Jeon, Best MS Thesis Award in SNU CSE, Feb. 2023 Yong-chan Park, SNU BK21 Star Student Researcher Award, 2023 Hyunsik Jeon, CIKM Travel Award, 2022 Jun-Gi Jang, ICDE Best Research Paper Award (Honorable Mention), 2022 Jaemin Yoo, Best Ph.D. Thesis Award in SNU CSE, Feb. 2022 Jun-Gi Jang, Gauss Labs Future Gauss Lecture Award, 2022 Jun-Gi Jang, BK21 Best Graduate Student Award, 2022 Jun-Gi Jang, Naver Ph.D. Fellowship, 2021 Jun-Gi Jang, Qualcomm Innovation Fellowship, 2021 Jun-Gi Jang, Yulchon AI Star Fellowship, 2021 Jun-Gi Jang, KDD Best Research Paper Award, 2021 Jongjin Kim, SNU BK21 Top Talent Fellowship, 2021 Jaemin Yoo, SDM Travel Award, 2021 Jaemin Yoo, BK21 Plus Star Researcher Award, 2021 Jaehun Jung, Best Undergraduate Thesis Award in SNU CSE, 2021 Jaemin Yoo, Qualcomm Innovation Fellowship, 2020 Hyunsik Jeon, SeungCheol Park, Yuna Bae, Second Prize Award, at MIND News Recommendation Competition, 2020 Jaemin Yoo, Yulchon AI Star Fellowship, 2020 Bonhun Koo and Hyunsik Jeon, Best Student Paper Award, at Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2020 Hyunsik Jeon, HumanTech Award (honorable mention; 4rd in Computer Science), 2019 SeungCheol Park, Google Travel Award, 2019 Hyunsik Jeon, BigData Travel Award, 2019 Jaemin Yoo, Google PhD Fellowship, 2019 Chun Quan, Best Master's Thesis Award in SNU CSE, Aug. 2019 Jaemin Yoo, HumanTech Award (honorable mention; 4rd in Computer Science), 2018 Sejoon Oh, Best Undergraduate Thesis Award in SNU CSE, Aug. 2018 Jinhong Jung, BK21 Plus Excellent Research Award, 2018 Sejoon Oh, HumanTech Award (gold; 1st in Computer Science), 2017 Jun-gi Jang, HumanTech Award (honorable mention; 4rd in Computer Science), 2017 Jaemin Yoo, Google Travel Award, 2017 Jinhong Jung, HumanTech Award (silver; 2nd in Computer Science), 2016 Jungwoo Lee, HumanTech Award (bronze; 3rd in Computer Science), 2016 Hamyung Park, Google Travel Award, 2016 Jinhong Jung, Global Ph.D. Fellowship, 2016 Jinhong Jung, Naver Ph.D. Fellowship, 2016 Hamyung Park, HumanTech Award (silver; 2nd in Computer Science), 2015 Kijung Shin and Jinhong Jung, HumanTech Award (gold; 1st in Computer Science), 2014 Ho Lee, HumanTech Award (honorable mention; 4th in Computer Science), 2014 Inah Jeon, Qualcomm Innovation Award (fellowship), 2014 Hamyung Park, HumanTech Award (bronze; 3rd in Computer Science), 2013 Software I lead the development of PEGASUS (Peta-Scale Graph Mining System), an award-winning open-source software for mining very large graphs in Hadoop and Spark platforms. Talks and Tutorials Compressing Large Langauge Models, DASFAA 2024, July 2024 Compressing Large Langauge Models, BigComp 2024, Feb 2024 Predicting Stock Market with AI, SWCS 2023, Apr. 2023 Financial AI, Inha University, Dec. 2022 Graph Neural Networks: Theory and Applications, DB Society, Aug. 2022 Recommender system, Posco ICT, Nov. 2021. Financial AI, Naver TV, Oct. 2021. Data mining, Naver TV, Sep. 2021. Stock prediction with AI, NC Soft, July 2021. Time series analysis, LG AI Research, March 2021. Lightweight deep learning, Kakao Enterprise, Feb. 2021. Designing lightweight deep learning model, SNU AI Summer School, August 2020. Recent Advancement in Recommendation and Model Compression, GIST AI Summer School, July 2020. AI Technologies for Finance, KCC, July 2020. Financial AI, KTB Security, Feb. 2020. Knowledge Extraction with No Observable Data, KCC, Dec. 2019. Deep Recommender System, KIBME Workshop, July 2019. Lightweight Deep Learning with Model Compression, IEEE BigComp 2019, Kyoto, Japan, Feb. 2019. Large Scale Tensor Analysis, 21st Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD) 2017, Jeju, Korea, May 2017. BigTensor: Mining Billion-Scale Tensor Made Easy, Intel Labs, Santa Clara, CA, USA, Aug. 2016. Fast Random Walk with Restart for Ranking in Large Graphs, Oracle Labs, Redwood City, CA, USA, Aug. 2016. BEAR: Block Elimination Approach for Rando",
  "content_length": 50841,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:16"
}