{
  "name": "Udantha R. Abeyratne",
  "homepage": "http://researchers.uq.edu.au/researcher/1182",
  "status": "success",
  "content": "Dr Udantha Abeyratne | UQ Experts Skip to menu Skip to content Skip to footer Dr Udantha Abeyratne Email: udantha@eecs.uq.edu.au Positions Honorary Associate Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Recent News August, 2019: Post Doctoral Researchers/Resercah Associates/PhD Candidates A/Prof Abeyratne is accepting (2021) post-doctoral researchers/covering the areas of: pattern recognition, machine learning, respiratory sound analysis, digital signal processing and smart phone programming. Qualified students are invited to apply for PhD scholarships on a competitve basis. June 2021: Snore sound based Sleep Apnea diagnostics intellectual property developed by Dr. Udantha Abeyratne and his team are available for commercialisation. The technology is the culmination of 20 years of ground breaking work leading to four patent applications including two granted ones in the USA (the rest are under examination at various stages) and a large portfolio of peer reviewed publications in international scholarly journals. A Matlab implementation of re-trainable technology and performance comparions against American Academy of Sleep Medicine scoring critera of 2007 (AASM 2007) are available. Prior comparisons on Chicago Criteria (\"AASM 1999\") are also available via peer-reviewed literature. Our software models indicate that the technology can diagnose sleep apnea at a sensitivity and specificity approching that of a standard facility-based polysomnography (sensitivity, specificity around 90%, 90%-- cross validation studies). Note that the model development data sets available to us (n=100 approx) had been scored per AASM 2007 clinical criteria. Thus, the resulting models require a straight-forward re-training (re-calibration) process on AASM 2012 data before they can be used on subjects diagnosed under AASM 2012 criteria (which is the clinical scoring standard in effect since 2012). ----------------------------------------------------------------------------------------------------------------------- Assoc./Prof. Udantha Abeyratne is the inventor of the cough-sound based respiratory diagnosis technology (ResApp Health Ltd. (ASX: RAP)) and snore sound based sleep apnea diagnosis technology SnoreSounds. He earned a PhD (Biomedical Engineering) from Drexel University, USA, and MEng and BScEE degrees in Electrical & Electronic Engineering from Tokushima U, Japan and U Peradeniya, (video here) Sri Lanka respectively. He also received formal post-graduate training in Higher Education (Grad Cert , U of Queensland, Australia) and Paediatric Sleep Science (Grad Cert., U of Western Australia, Australia). He is a Senior Member of the Institute of Electrical & Electronic Engineers (IEEE, USA), and a full Member of the American Academy of Sleep Medicine (AASM). ​Dr. Abeyratne started his research career with a paper on coding techniques for low-bandwidth communication channels. His master's thesis was on a machine learning approach to the human brain activity analysis using electroencephalography (EEG, Brain Waves) and evoked potentials. This approach won the best paper award in ISBET Brain Topography Conference (Osaka, Japan, 1990) and also placed Dr. Abeyratne as a finalist at the Young Investigators' Competition in IFMBE World Congress on Medical Physics and Biomedical Engineering, 1991 (Kyoto, Japan). He completed his PhD (1996) with Prof. Athina Petropulu as the advisor, working on Higher-Order-Spectra and medical ultrasound imaging. The thesis developed slice-based low-complexity algorithms for blind signal identification, tumor detection in ultarsound images, and image deconvolution. Teaching Activities: Assoc/Prof. Abeyratne has designed and taught university level courses on digital signal processing, electronic circuits, medical and general instrumentation, medical signal processing, medical imaging, control systems, project management and electromagnetic waves. He has supervised both undergraduate and postgraduate dissertation thesis projects in these areas. Within the last decade five students supervised by him won competitive awards at the UQ Innovation Expo. Current Research Profile: Assoc./Prof. Abeyratne's research interests encompass digital signal processing, machine learning, medical instrumentation, medical imaging, electrophysiology, bio-signal analysis and electronics. Over the last two decades A/Prof. Abeyratne has conceptualized, initiated and led the development of a number of innovative technologies funded by prestigious granting agencies such as the Bill & Melinda Gates Foundation, Australian Research Council and the A*-Star Singapore. His research programmes are characteristic of unorthodox approaches resulting in pioneering outcomes that produced spin-off companies, patents and scholarly publications. His research has recieved multiple peer accolades at the international level. 1. Electronic Instrument Design: hand-held ultrasound devices for medical, agricultural and industrial use; stethoscopes for the 21st century (The \"Magithescope(c)\", winner of two UQ Expo awards in 2013, 2014); biomimetic sensing devices (e.g. electronic nose, e-tongue), low-cost, portable electronic devices (\"Tricoders\") for diagnosing diseases such as apnea, asthma, pneumonia; wearable electrophysiological devices; real-time fatigue measurement and warning systems; hand-held instruments for the condition monitoring of machinery such as power transformers. Development of diagnostic and treatment devices for sleep apnea. Dr. Abeyratne is especially interested in developing accurate, multi-purpose and low-cost in-situ decision devices for applications in resource-poor regions of the world. 2. Diagnostic and Treatment Technology for Sleep Disorders: speech-like analysis of snore and breathing sounds; sleep diagnostic instrument design; sleep polysomnography, brain wave (EEG) analysis in sleep, quantification of fatigue and sleepiness; sleep apnea; design of apnea treatment devices (CPAP, dental devices); interaction of apnea and chronic diseases. mHealth approaches in sleep diagnostics. A/Prof. Abeyratne pioneered speech-like processing of respiratory sounds, leading to patents, papers and a spin-off company. He conceptualized and led the development of EEG based technology to quantifiy sleepiness in real-time in actual work environments. Outcomes of this program have recieved wide coverage in international media outlets due to its groundbreaking nature and the potential impact. 3. Respiratory Diagnostic Technology: diagnostic instrumentation and algorithm design for respiratory illnesses such as pneumonia, bronchiolitis, asthma, bronchiectasis and COPD; cough sound analysis in respiratory medicine; imaging technology for respiratory diagnosis; Portable diagnostic technologies and mHealth approaches for remote resource-poor areas of the world. About 1 million children below the age of 5 yrs die every year of pneumonia alone, mainly in remote resource-poor areas of the world. Poor access to diagnostics and medical treatment are the major reasons for pneumonia fatalities. A/Prof. Abeyratne proposed a ground-breaking new technology to diagnose pneumonia centred about cough sound analysis. For this research Dr. Abeyratne received funding from UQ, UniQuest and the Bill & Melinda Gates Foundation, which lauded the project (Page 4) as an exmaple for an innovative idea with high impact. Outcomes led to scholarly publications and contributed to patents as well as a spinoff company by UQ. 4. Signal Processing and Machine Intelligence: the analysis of bio-signals such as electroencephalography (EEG), electromyography (EMG); speech and industrial sound analysis, bowel sound analysis and the characterisation of inflammatory bowel disease; cardiovascular signal processing, source localization and blind source separation, higher order spectra, wavelets, pattern recognition, classifier design. Developing technology for monitoring the condition of Left Ventricular Assist Devices (LVAD). 5. mHealth: research on smart phone and other consumer devices as a platform for healthcare delivery. A/Prof Abeyratne is actively engaged in developing mHealth diagnostic solutions, including translating and customising sleep and respiratory technologies. He is also in the process of expanding the work to include meaningful deployment of the technology in both the developed and developing worlds, in collaboration with international NGOs, experts in community medicine, and the UQ spin-off companies resulting from the research program. New national and international collaborations are currently being negotiated to fund and facilitate this work. The Research Team, Past & Present: Associate professor Udantha Abeyratne, Dr. Keegan Kosasih (Past PhD graduate); Dr Duleep Herath (past PhD gradute, )Dr. Shahin Akhter (Past PhD graduate), Dr. Vinayak Swarnkar (Past PhD graduate ); Dr. Yusuf Amrulloh (Past PhD graduate); Dr. Shaminda de Silva (Past PhD graduate); Dr. Samantha Karunajeewa (Past PhD graduate); Dr. Suren Rathnayake (Past PhD graduate), Dr. Xiao Di (Past PhD graduate), Dr. T. Emoto (Past PhD work in UQ while at UT), ; Mrunal Markendeya (Current PhD Student); Karen McCloy (current PhD student), Ajith Wakwella (Past MPhil graduate); Lee Teck Hock (Past MPhil Graduate), Tang Xiaoyan (Past MPhil Graduate), Dr. Zhang Guanglan (Past MPhil Graduate), Dr. Syed Adnan (Past MPhil Graduate) and many past and present dissertation thesis students. Research Collaborators: Dr. Craig Hukins & Brett Duce (Princess Alexandra Hospital), Prof. Y. Kinouchi & Dr. T. Emoto (U of Tokushima, Japan), Dr. Sarah Biggs (Monash), Dr.Simon Smith (QUT), Dr. Chandima Ekanayake (Griffith U), Dr. Paul Porter (PMH Hospital), Prof. Anne Chang (Menzies School of Health Reserach, CDU), Dr. Scott Mckenzie (Princess Charles Hospital), Dr. Nirmal Weeresekera (JKMRC, UQ), Dr. Rina Triasih (Gadjah Mada U, In",
  "content_length": 34060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:23"
}