{
  "name": "Uday P. Khedker",
  "homepage": "https://www.cse.iitb.ac.in/~uday",
  "status": "success",
  "content": "Bio-Data Uday Khedker (Many documents spell my name as Khedkar) Professor Department of Computer Science & Engg., IIT Bombay Formerly, Reader, Department of Computer Science, University of Pune For those who want to do a summer/ winter project with me My book on data flow analysis A review of the book Indian reprint is also available General Information Resources Selected Talks PLATO (Programming Languages, Analysis, Translation, and Optimization) group Teaching Research , Publications , Students, An overview of my research External Interaction (projects, trainings etc.) Contact, Academic Background, Professional Interests Resume Tutorial on Introduction to Points-to Analysis Online Lectures of cs618 Program Analysis Bottom-Up Points-to Analysis using the Generalized Points-to Graphs Implementation of  VASCO: Interprocedural analysis using value sensitive contexts for Java GCC Resource Center Talks on GCC Some Useful Reading Material and latex resources Higher Education: Myths and Reality (A talk addressed to UGs) Challenges in Compiling What is Research (Part I)? , a video of the talk What is Research (Part II: How to Write a Good Paper? So You Want to Do a Ph.D?) How to Make Good Presentations? Early History of Fortran: The Making of a Wonder. A video of the talk at Persistent Systems CompuCast interview on liveness analysis and introductory video clip on YouTube Contact Office (Directions to reach my office/lab) Room 306, CC/CSE Building, IIT Bombay, Powai, Mumbai 400 076. India Phone : 91 (22) 2576 7717 (Direct),  91 (22) 2572 2545 x 7717 Fax      : 91 (22) 2572 0290 Email   : uday[AT]cse.iitb.ac.in Homepage  : http://www.cse.iitb.ac.in/~uday Academic Background Ph.D. in Computer Science & Engineering (1995) Department of Computer Science & Engineering, IIT Bombay Thesis : A Generalised Theory of Bit Vector Data Flow Analysis. Click here for a pdf copy and here for a postscript copy M.Tech. in Computer Science (1989) Department of Computer Science, University of Pune B.E. in Electronics & Telecommunication Engineering (1986) Government Engineering College, Jabalpur H.S.S.C. (1981) M. P. Board of Secondary Education with 6th rank in Merit. Received the National Talent Search Scholarship awarded by the NCERT, New Delhi (1981). Professional Interests Area of Work : Programming Languages, Compilers, Program Analysis Type of Work : Teaching, Research, Consultancy Back to top of the page Back to the Department Homepage",
  "content_length": 2460,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:22"
}