{
  "name": "Udit Gupta [Tech]",
  "homepage": "https://ugupta.com",
  "status": "success",
  "content": "Document Udit Gupta Assistant Professor Cornell Tech [ECE] [CSL] [Jacobs Technion-Cornell Institute] [Atkinson Center for Sustainability] ugupta@cornell.edu I am an Assistant Professor in the Department of Electrical and Computer Engineering at Cornell Tech. My research interests lie at the intersection of computer architecture, systems, machine learning and environmental sustainability. The central theme to my research is co-designing solutions across the computing stack (applications, algorithms, systems and architecture, circuits and devices) to design and implement computer systems and hardware in new ways to improve the performance, efficiency, and environmental sustainability of emerging applications. Through research, I am driven to realizing practical impact, building interdisciplinary research communities, and pathfinding. I led the characterization of industry scale neural personalized recommendation models, outlining paths for future AI hardware design and academic research into specialized systems for AI. Based on the key insights we built open-source systems' benchmarks and tools that have been standardized as part of the community efforts such as MLPerf. Using these benchmarks I developed specialized hardware/software systems by co-designing solutions across the computing stack to enable high performance, efficient, and scalable AI at-scale; these solutions have been evaluated in real-world industry scenarios saving significant AI cycle and infrastructure resources. Going beyond performance and efficiency, my research also demonstrates the critical need to incorporate environmental sustainability as a first-order design principle in systems design, development, and deployment. My research identifies fundamental bottlenecks towards enabling environmentally sustainability computing, opening new research opportunities across the computing stack from applications to algorithms and from systems and hardware to circuits and devices. Honors/Awards: My work has been featured in venues such as Bloomberg Green, The Guardian, and CNBC. My work has been awarded an IEEE MICRO Top Picks (2022 and 2023) and IEEE MICRO Top Picks Honorable Mention (2021), as well as received Best Paper Nominations at the Parallel Architectures and Compilation Techniques (PACT 2019) and Design Automation Conference (DAC 2018). My dissertation received the SIGARCH Outstanding Ph.D. Dissertation Honorable Mention in 2023 as well as the MICRO Outstanding Ph.D. Dissertation Honorable in 2023. I received my Ph.D. in Computer Science at Harvard University and BSc in Electrical and Computer Engineering from Cornell University. Prospective students: I am actively looking for motivated, ambitious, and passionate graduate students, postdoctoral scholars, and undergraduate. If you are interested in working with me please read the following page. Research Interests My current research interests include: Designing software and hardware to enable environmentally sustainable computing. Specializing hardware and systems for Agentic AI at-scale. Democratizing access to intelligent systems by co-designing AI and hardware for energy efficient and resource constrained deployment. Designing systems specialized for personalized recommendation engines. News Nov. 2024 Received Google's Academic Research Award (GARA) on ``Life Cycle Carbon Footprint of AI Inference'' ($100K) Oct. 2024 Paper on energy-/carbon-aware optimization of 3D IC's published at JXCDC. Congratulations to Hyung Joon Boon Sep. 2024 Paper on architectural evaluation of 3D IC's published at ISLPED. Congratulations to Hyung Joon Boon Jun. 2024 Three papers accepted to HotCarbon workshop! Come see our work on sustainable computing. Congratulations to Leo Han, Anvita Bhagvatula, Yueying Li, Jash Kakadia, and Omer Graif! Jun. 2024 Served on the HotCarbon program committee. May 2024Received an NSF Expeditions grant with Harvard University, University of Pennsylvania, Ohio State, and Yale ($12M total), for Carbon Connect: An Ecosystem for Sustianable Computing Apr. 2024Attended and scribed at the NSF Workshop for Sustainable Computing for Sustainability Mar. 2024Served on the ISCA 2024 program committee Feb. 2024Launched the second iteration of the ML Sys Rising Stars workshop 2024! Nov. 2023Received the IEEE MICRO Outstanding Dissertation Award Honorable mention Oct. 2023Received an NSF grant ($2M) with Geogia Tech and Harvard Unviersity for Life-time aware design for sustainable edge devices Sept. 2023Received gift from Google ($30K) towards investigating Understanding and Mitigating the Environmental Footprint of AI At Scale Sept. 2023Received our first NSF grant ($300K) to develop, Cloud Infrastructures for Designing Sustainable Electronics! Aug. 2023Leo Han, Zhanqiu (Summer) Hu, and Michael Shen join the lab as first year PhD students! Aug. 2023Hosted the inaugural ML and Systems Rising Stars workshop, sponored by MLCommons and Google Jul. 2023Started new role as an Assistant Professor at Cornell Tech! Jun. 2023Received the SIGARCH/TCCA Outstanding Dissertation Award Honorable mention Mar. 2023Launched the new ML and Systems Rising Stars program! Feb. 2023Co-organized the NSF NetZero Carbon workshop at HPCA 2023.",
  "content_length": 5232,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:21"
}