{
  "name": "Ugur Dogrusoz",
  "homepage": "http://www.cs.bilkent.edu.tr/~ugur",
  "status": "success",
  "content": "Ugur Dogrusoz Ugur Dogrusoz Professor, Computer Engineering Head, i-Vis Research Lab Bilkent University, Ankara 06800, Turkey +90 (312) 290 1612 Schedule STUDENTS WANTED for on-going projects Highlights Amazon uses our layout and complexity management technologies to build Amazon Perspective to visually analyze AWS Cloud workloads >> and Graph Explorer to enable users to visualize both property graph and RDF ata and explore connections between data without having to write graph queries Reactome, BioModels and WikiPathways now connect to our Newt editor for viewing and editing in SBGN. Examples: Reactome>> BioModels >> Wikipathways >> Our scientific research engineer wins 1st place award in TigerGraph's Graphathon >> i-Vis releases version 3 of its web based pathway editor Newt >> i-Vis releases PathwayMapper version 2 to collaboratively analyze and edit cancer pathways >> i-Vis participates in development of the first standard graphical notation for biology >> i-Vis provides network visualization for cBio Cancer Genomics Portal of Memorial Sloan-Kettering Cancer Center >> i-Vis adds support for compound graphs as well as numereous extensions to Cytoscape.js i-Vis' layout and complexity management algorithms are used for building various tools including an AWS visualization tool named CloudMapper and a search application for Pathway Commons i-Vis' pathway editor is used to build a Real-Time Collaborative Pathway Curation Platform Videos highlighting algorithms and technologies developed by i-Vis can be found here Personal [CV] I joined Bilkent in the fall of 1998, before which I worked for Tom Sawyer Software for three years. M.S., Ph.D. in Computer Science, 1991, 1995, resp., Rensselaer Polytechnic Institute, Troy, NY. B.S. in Computer Engineering, 1989, Middle East Technical Univ., Ankara, Turkey. >> ResearchPublications My interests fall into the areas of big data visualization and analytics (esp. biological pathways and social networks), bioinformatics (pathway informatics), graph algorithms (esp. graph layout algorithms and query algorithms for graph databases) and machine learning (detecting fraud/anomaly in telecom and financial networks). I lead the i-Vis Research Lab; projects conducted or participated in include Newt, PathwayMapper, cBio Cancer Genomics Portal, Cytoscape.js, ChiBE, Chisio, and PATIKA. >> Professional Editor, SBGN (Systems Biology Graphical Notation), 2022-2025 & 2016-2019; Co-founder and Director, BCBI (Bilkent Center for Bioinformatics), 2002-2010; National Young Scientist Career Development Award, TUBITAK (The Scientific and Technical Research Council of Turkey), 2005-2011; Conference Chair and Program Committee Member, (Combinatorial Pattern Matching) CPM 2004. >> Teaching Nowadays I teach Algorithms & Programming I, Fundamentals of Algorithms II and Algorithms I. >> Other Miscellenaous forms for application for summer internship and request for a reference letter and information on senior term projects can be obtained here. Favorite Quotes \"If you ask me what makes me most happy, number one would be somebody saying (I learned something from you). Number two would be somebody saying (I used your software).\"  D. KNUTH \"Simplicity is a great virtue but it requires hard work to achieve it and education to appreciate it. And to make matters worse: complexity sells better.\"  E.W. DIJKSTRA \"My life got better when I realized I didn't have to be nice. Nice got me used, stressed out and disrespected. I'm not nice. I'm a good person. There's a difference. You don't have to be nice to be a good person. Being good means being honest, setting boundaries, taking care of yourself without compromising your values. Being nice may give you temporary approval, but it rarely earns you respect or helps you build genuine connections. Honor your truth. You won't regret it.\"  SOME GRANDPA/MA \"Most people want 'nice' people in their lives, not 'good' ones unfortunately.\"  UD \"Societies that want to live comfortably without working, getting tired, or producing; They are doomed to lose first their dignity, then their freedom, and then their independence and future.\"  M.K. ATATURK",
  "content_length": 4159,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:29"
}