{
  "name": "Ujjwal Maulik",
  "homepage": "https://sites.google.com/site/drujjwalmaulik",
  "status": "success",
  "content": "Prof. Ujjwal MaulikSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeProf. Ujjwal Maulik, Ph.D., Fellow - FNAE, FNASc, FIAPR, FAAIA, FIEEE  Fulbright Fellow, USA, Distinguish Member ACM, AvH - Humboldt Fellow, Germany, Senior Associate, ICTP, Italy,  Distinguish Lecturer, IEEE CIS,   Distinguish Speaker,  ACMEmail: umaulik@stanford.edu, ujjwal.maulik@jadavpuruniversity.in, umaulik1965@gmail.com, ujjwal_maulik@yahoo.comDr. Ujjwal Maulik is a Professor in the Dept. of Comp. Sc. and Engg., Jadavpur University since 2004. He was also the former Head of the same Department. Dr. Maulik has worked in many universities and research laboratories around the world as visiting Professor/ Scientist including Los Alamos National Lab., USA in 1997, Univ. of New South Wales, Australia in 1999, Univ. of Texas at Arlington, USA in 2001, Univ. of Maryland at Baltimore County, USA in 2004,  Fraunhofer Institute for Autonome Intelligent Systems, St. Augustin, Germany in 2005, Tsinghua Univ., China in 2007, Sapienza Univ., Rome, Italy in 2008, Univ. of Heidelberg, Germany in 2009, German Cancer Research Center (DKFZ), Germany in 2010, 2011 and 2012,  Grenoble INP, France in 2010, 2013 and 2016, University of Warsaw in 2013 and 2019, University of Padova, Italy in 2014 and 2016, Corvinus University, Budapest, Hungary in 2015 and 2016,  University of Ljubljana, Slovenia in 2015 and 2017, International Center for Theoretical Physics (ICTP), Trieste, Italy in 2014, 2017 and 2018 and Stanford University, 2025. He is the recipient of Alexander von Humboldt Fellowship during 2010, 2011 and 2012 and Senior Associate of ICTP, Italy during 2012-2018 and Fulbright Fellowship in 2024-2025. He is the Fellow of  Indian National Academy of Engineers (INAE), India, National Academy of  Science India (NASI), International Association for Pattern Recognition (IAPR),  USA, The Institute of Electrical and Electronics Engineers (IEEE), USA and Asia-Pacific Artificial Intelligence Association (AAIA), Hongkong. He is also the Distinguish Member of  the ACM. He is a Distinguish Speaker of IEEE as well as  ACM. His research interest include  Machine Learning, Pattern Analysis,  Data Science, Bioinformatics, Multi-objective Optimization, Social Networking, IoT and Autonomous Car. In these areas he has published ten books, more than four hundred papers, mentoring several start-ups, filed several patents and  already guided twenty five doctoral students. His other interest include mentoring young students, traveling extensively around the globe, outdoor Sports and  Music. Google Scholar     DBLPSome recent publications:Decoding critical long non-coding RNA in Ovarian cancer Epithelian-to-Mesenchymal Transition - Nature Communications 1604, 2017. Discovering Perturbation of Modular Structure in HIV Progression by Integrating Multiple Data Sources Through Non-Negative Matrix Factorization - IEEE/ACM Transactions on Computational Biology and Bioinformatics, 15(3), pp. 869-877, 2018.Identifying protein complexes in PPI network using non-cooperative sequential game - Scientific Reports, pp. 19-25, 12(1), 2018. Understanding Deep Learning Techniques for Image Segmentation - ACM Computing Surveys, 52(4), pp.1-35, 2019. Network Mapping of the Conformational Heterogeneity of SOD1 by Deploying Statistical Cluster Analysis of FTIR Spectra - Cellular and Molecular Life Sciences, PP.1-10, 2019. Mutational landscape of the BAP1 locus reveals an intrinsic control to regulate the miRNA network and the binding of protein complexes in Uveal Melanoma - Cancers, 11(10), 2019.A Survey on Fuzzy Deep Neural Network - ACM Computing Surveys, 53(3), 54:1-54:25, 2020. Unveiling SARS-COV-2 associated Organ Specific Cell Types and Cell Specific Pathway Cascade - Briefings in Bioinformatics (accepted). Molecular docking study of potential phytochemicals and their effects on the complex of SARS-CoV2 spike protein and human ACE2 -  Scientific Reports (accepted).Study of Transcription Factor Druggabilty for Prostate Cancer Using Structure Information, Gene Regulatory Networks, and Protein Moonlighting, Briefings in Bioinformatics (accepted).Modeling expression ranks for noise-tolerant differential expression analysis of scRNA-Seq data, Genome Research (accepted).Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4330,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:28"
}