{
  "name": "Ulf Leser",
  "homepage": "https://www.informatik.hu-berlin.de/forschung/gebiete/wbi",
  "status": "success",
  "content": "Wissensmanagement in der BioinformatikMehr KontrastWeniger Kontrast Direkt zum InhaltDirekt zur SucheDirekt zur Navigation Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Wissensmanagement in der Bioinformatik Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Wissensmanagement in der Bioinformatik Navigation « Dezember 2025 » month-12 Mo Di Mi Do Fr Sa So 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 1 2 3 4 Termine Promotionsvortrag: Niklas Giesa 01.12.2025 Disputation: Frau Parmida Geranmayeh, M.Sc. 10.12.2025 Disputation: Herr Pascal Sebastian Kunz, M.Sc. 12.12.2025 Promotionsvortrag Fabian Lehmann 18.12.2025 Termine - More… Impressum Humboldt-Universität zu Berlin - Mathematisch-Naturwissenschaftliche Fakultät - Wissensmanagement in der Bioinformatik Prof. Dr. Ulf Leser News 20.11.2025: Open research position (4 years, PhD student or PostDoc) 29.05.2024: The German Research Councal has approved funding for a second 4-year period of the Collaborative Research Center FONDA - Foundations of Workflow Systems for Large-Scale Scientific Data Analysis. 15.1.2024: We are delighted that Humboldt-Universität decided to fund a new Interdisciplinary Center on \"Greencompute - saving energy in large-scale data analysis\", led by Ulf Leser (Computer Science) and Claudia Draxl (Physics). We will soon open an E13 position for organizing the IC. 20.11.2023: Was wir forschen: Large Language Models in der Präzisionsmedizin Für Studierende Alle Lehrveranstaltungen des Lehrstuhls Laufende und abgeschlossene (2025, 2024, 2023, 2022, 2021, 2020, früher) Studien- und Diplomarbeiten Offene Themen und Bewerbung für Abschlussarbeiten Lehrbuch Informationsintegration (inklusive Folien und Errate). Auswertung der Studentenbefragung vom Dezember 2004 Research Running projects Finished projects Software and downloads Finished dissertations in the group All publications; latest: De Mecquenem et al.: Domain-Specific Data Compression for Workflow Engines with COMET-FLOW, IWBDR@IEEE Big Data Bountris et al.: HyProv: Hybrid Provenance Management for Scientific Workflows, IEEE Big Data Lehmann et al.: WONDERS: Integrating WOW, PONDER, and SCALE for Enhanced Scheduling Performance, Supercomputing (poster paper) Sänger and Leser: Knowledge-augmented Pre-trained Language Models for Biomedical Relation Extraction, BMC Bioinformatics Science Communications 2024: Weiß der Adler: Big data, big science (Podcast) 2024: Die Zukunft der KI nicht Big Tech überlassen 2023: Large Language Models in der Präzisionsmedizin 2023: The Elephant in the Data Center - energy consumption of workflow executions. 2022: Calculating the \"fingerprints\" of molecules with artificial intelligence. 2021: Knowledge Management for Precision Medicine 2021: Schnelle Erdbebenwarnung mit künstlicher Intelligenz 2018: KI in der Krebstherapie. 2018: Suchmaschinen für die personalisierte Onkologie Auszeichnungen für Abschlussarbeiten am Lehrstuhl Helmholtz Dissertationspreis 2023, Dr. J. Münchmeyer Adlershofer Dissertationspreis 2022, Dr. J. Münchmeyer Best Master thesis Humboldt-Universität 2022, L. Clauß Best dissertation Humboldt-Universität 2022, Dr. M. Zehlike Best Master thesis Computer Science 2022, L. Clauß Best Master thesis Computer Science 2018, L. Weber Best Master thesis Computer Science 2016, M. Sänger Best Diploma thesis Computer Science 2013, T. Rocktäschel DE EN Mehr KontrastMehr Kontrast Weniger KontrastWeniger Kontrast Humboldt-Universität zu Berlin Institut für Informatik Rudower Chaussee 25 12489 Berlin-Adlershof Die Humboldt-Universität bei Facebook Die Humboldt-Universität bei BlueSky Die Humboldt-Universität bei Instagram Die Humboldt-Universität bei YouTube Die Humboldt-Universität bei LinkedIn Die RSS-Feeds der Humboldt-Universität Seite bearbeiten Barrierefreiheit Datenschutz Impressum",
  "content_length": 3884,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:32"
}