{
  "name": "Uli Wagner 0001",
  "homepage": "https://ist.ac.at/research/research-groups/wagner-group",
  "status": "success",
  "content": "ISTA | Wagner Group HomeResearchWagner Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Wagner Group Discrete and Computational Geometry and Topology How and when can a geometric shape be embedded in n-dimensional space without self-intersections? What restrictions does it place on the shape? These and other questions in combinatorial and computational geometry and topology are central to the Wagner group’s research program.A simplicial complex is a description of how to represent a geometric shape by gluing together points, edges, triangles, and their n-dimensional counterparts in a “nice” way. Simplicial complexes are a natural way to represent shapes for the purposes of computation and algorithm design, and the Wagner group explores both their topological properties, such as embeddability, as well as what can be proved about their combinatorics – e.g. bounds on the number of simplices – given a particular geometric or topological constraint. More generally, they take classically topological questions and consider them from a combinatorial point of view, and conversely, they use techniques and ideas from topology to approach questions in combinatorics. They are moreover interested in the computational aspects of such problems, in particular questions of decidability (does an algorithm exist?) and complexity (if so, what are the costs in terms of time or space?). Group Leader Uli Wagner Professor +43 2243 9000 5501 uli@ist.ac.at Administrative Support Christine Ostermann Assistant to Professors +43 2243 9000 1071 Christine.Ostermann@ist.ac.at Team Daniel Bedats PhD Student Daniel.Bedats@ist.ac.at Valentina Disarlo Postdoc Valentina.Disarlo@ist.ac.at Chris Fillmore PhD Student christopher.fillmore@ist.ac.at Irene Pisapia PhD Student Irene.Pisapia@ist.ac.at Elizaveta Streltsova PhD Student Elizaveta.Streltsova@ist.ac.at Raphaël Tinarrage Postdoc Raphael.Tinarrage@ist.ac.at Current Projects Embeddings of simplicial complexes | Topological Tverberg-type problems and multiple self-intersections of maps | Discrete isoperimetric inequalities and higher-dimensional expanders Publications Ennes H, Tinarrage R. 2025. LieDetect: Detection of representation orbits of compact Lie groups from point clouds. Foundations of Computational Mathematics. View Tasinato G. 2025. Topological methods in discrete geometry and theoretical computer science : Measure partitioning and constraint satisfaction problems. Institute of Science and Technology Austria. View Streltsova E, Wagner U. 2025. Levels in arrangements: Linear relations, the g-matrix, and applications to crossing numbers. 41st International Symposium on Computational Geometry. SoCG: Symposium on Computational Geometry, LIPIcs, vol. 332, 75. View Avvakumov S, Filakovský M, Opršal J, Tasinato G, Wagner U. 2025. Hardness of 4-colouring G-colourable graphs. Proceedings of the 57th Annual ACM Symposium on Theory of Computing. STOC: Symposium on Theory of Computing, 72–83. View Aronov B, Basit A, Ramesh I, Tasinato G, Wagner U. 2025. Eight-partitioning points in 3D, and efficiently too. Discrete and Computational Geometry. View View All Publications ReX-Link: Uli Wagner Career Since 2018 Professor, Institute of Science and Technology Austria (ISTA)2013 – 2018 Assistant Professor, Institute of Science and Technology Austria (ISTA)2012 – 2013 SNSF Research Assistant Professor, Institut de Mathématiques de Géométrie et Applications, EPFL, Lausanne, Switzerland2008 – 2012 Senior Research Associate, Institute of Theoretical Computer Science, ETH Zurich, Switzerland2006 – 2008 Postdoctoral Researcher, Institute of Theoretical Computer Science, ETH Zurich, Switzerland2004 – 2006 Postdoc, Einstein Institute for Mathematics, The Hebrew University of Jerusalem, Israel2004 Postdoc, Univerzita Karlova, Prague, Czech Republic2003 Postdoc, Mathematical Sciences Research Institute, Berkeley, USA2004 PhD, ETH Zurich, Switzerland Selected Distinctions 2018 Best Paper Award at the Symposium on Computational Geometry (SoCG)2014 Best Paper Award at the Symposium on Computational Geometry (SoCG)2012 Research Assistant Professorship Grant of Swiss National Science Foundation (SNSF)2012 Best Paper Award at Symposium of Discrete Algorithms (SODA)2004 Richard Rado Prize Additional Information Download CVMathematics at ISTA Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6751,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:32"
}