{
  "name": "Ulrich Ultes-Nitsche",
  "homepage": "https://www.unifr.ch/inf/en/all/people/11657/f10e7",
  "status": "success",
  "content": "Ulrich Ultes-Nitsche | Department of Informatics | University of Fribourg Ulrich Ultes-Nitsche ulrich.ultes-nitsche@unifr.ch +41 26 300 8451 https://orcid.org/0000-0002-5835-9572 Professor, Department of Informatics PER 13 bu. 1.17Ch. du Musée 81700 Fribourg PER 13, 1.17 +41 26 300 8451 Research and publications Publication List 124 publications 2023 2022 2018 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1991 1988 Universality of Büchi Automata: Analysis With Graph Neural Networks IEEE Access\t(2023) | Journal article Analyzing Büchi Automata with Graph Neural Networks Stammet, C. and Dotti, P. and Ultes-Nitsche, U. and Fischer, A. , arXiv\t(2022) | Other A Simple and Optimal Complementation Algorithm for BüChi Automata Allred, Joel D. and Ultes-Nitsche, Ulrich, New York, NY, USA: Association for Computing Machinery (2018) | Conference Complementing Büchi Automata with a Subset-tuple Construction Allred, Joel and Ultes-Nitsche, Ulrich , Department of Informatics, University of Fribourg (2015) | Other Structure Comparison of Binary and Weighted Niche-Overlap Graphs Nayla Sokhn and Richard Baltensperger and Louis-Félix Bersier and Ulrich Ultes-Nitsche and Jean Hennebert, Complex Networks V - Proceedings of the 5th Workshop on Complex Networks CompleNet 2014, Bologna, Italy, March 12-14, 2014: (2014) | Conference Structural Network Properties of Niche-Overlap Graphs Nayla Sokhn and Richard Baltensperger and Louis-Félix Bersier and Ulrich Ultes-Nitsche and Jean Hennebert, International Conference on Signal-Image Technology & Internet-Based Systems, SITIS 2013, Kyoto, Japan, December 2-5, 2013: (2013) | Conference Structure analysis of niche-overlap graphs: NetSci2013 Sokhn, Nayla and Baltensperger, Richard and Hennebert, Jean and Ultes-Nitsche, Ulrich and Bersier, Louis-Félix, NetSci2013: (2013) | Conference Identification of Chordless Cycles in Ecological Networks Nayla Sokhn and Richard Baltensperger and Louis-Felix Bersier and Jean Hennebert and Ulrich Ultes-Nitsche, COMPLEX 2012: (2012) | Conference k-Counting Automata Rairo Journal of Theoretical Informatics and Applications\t(2012) | Journal article Proceedings of the 4th International Workshop on Non-Classical Models of Automata and Applications (NCMA 2012) Freund, Rudolf, Holzer, Markus, Truthe, Biance, Ultes-Nitsche, Ulrich (2012) | Book cPLC - A cryptographic programming language and compiler Bangerter, E. and Krenn, S. and Seifriz, M. and Ultes-Nitsche, U., 2011 Information Security for South Africa - Proceedings of the ISSA 2011 Conference: (2011) | Conference k-Counting Automata Allred, Joël, Ultes-Nitsche, Ulrich, Proceedings of the 3rd International Workshop on Non-Classical Models of Automata and Applications (NCMA 2011): (2011) | Conference A Proof of Concept Implementation and Evaluation of a Zero Configuration Authentication Option for EAP-TLS Latze, Carolin and Ultes-Nitsche, Ulrich, Essen, Germany: (2010) | Conference Transport Layer Security (TLS) Extensions for the Trusted Platform Module (TPM) Latze, Carolin, Ultes-Nitsche, Ulrich, Baumgartner Florian (2009) | Book Extensible Authentication Protocol Method for Trusted Computing Groups (TCG) Trusted Platform Modules Latze, Carolin, Ultes-Nitsche, Ulrich, Baumgartner Florian (2009) | Book Java NIO framework introducing a high-performance I/O framework for Java Standtke, R. and Ultes-Nitsche, U., ICSOFT 2008 - Proceedings of the 3rd International Conference on Software and Data Technologies: (2008) | Conference Modelling, Simulation, Verification and Validation of Enterprise Information Systems - Proceedings of the 6th International Workshop on Modelling, Simulation, Verification and Validation of Enterprise Information Systems, MSVVEIS 2008; In Conjunction with ICEIS 2008: Foreword Ultes-Nitsche, U. and Moldt, D. and Augusto, J.C., Modelling, Simulation, Verification and Validation of Enterprise Information Systems (MSVVEIS)- Proc. 6th Int. Workshop on MSVVEIS 2008; In Conjunction with ICEIS 2008: (2008) | Conference Weakly Continuation Closed Homomorphisms on Automata Nicola, Thierry and Ultes-Nitsche, Ulrich, Barcelona, Spain: INSTICC Press (2008) | Conference Checking Inherently Fair Linear-Time Properties in a Non-Naïve Way Nicola, Thierry and Nießner, Frank and Ultes-Nitsche, Ulrich, Barcelona, Spain: INSTICC Press (2008) | Conference Proceedings of the 6th International Workshop on Modelling, Simulation, Verification, and Validation of Enterprise Information Systems (MSVVEIS 2008) Ultes-Nitsche, Ulrich, Moldt, Daniel, Augusto, Juan Carlos, ed. by Ultes-Nitsche, Ulrich and Moldt, Daniel and Augusto, Juan Carlos (Barcelona, Spain: INSTICC Press, 2008) | Book Immune System Based Intrusion Detection Christoph Ehret and Ulrich Ultes-Nitsche, Johannesburg, South Africa: (2008) | Conference A Proof-of-Concept Implementation of EAP-TLS with TPM support Carolin Latze, Ulrich Ultes-Nitsche, Proceedings of the ISSA 2008 Innovative Minds Conference (ISSA 2008): (2008) | Conference Towards a Zero Configuration Authentication Scheme for 802.11 Based Networks Carolin Latze and Ulrich Ultes-Nitsche and Florian Baumgartner, Montreal, Canada: (2008) | Conference Roaming, Accounting and Seamless Handover in EAP-TLS Authenticated Networks Carolin Latze and Ulrich Ultes-Nitsche and Florian Baumgartner, Split, Dubrovnik, Croatia: (2008) | Conference Visual Correlation in the Context of Post-Mortem Analysis Michael Hayoz and Ulrich Ultes-Nitsche, Johannesburg, South Africa: (2008) | Conference Proceedings of the 5th International Workshop on Modelling, Simulation, Verification and Validation of Enterprise Information Systems - MSVVEIS 2007; In Conjunction with ICEIS 2007: Foreword Augusto, J.C. and Barjis, J. and Ultes-Nitsche, U., Proceedings of the 5th International Workshop on Modelling, Simulation, Verification and Validation of Enterprise Information Systems - MSVVEIS 2007; In Conjunction with ICEIS 2007: (2007) | Conference Stronger authentication in e-commerce: How to protect even Naïve user against Phishing, pharming, and MITM attacks Latze, C. and Ultes-Nitsche, U., Proceedings of the IASTED International Conference on Communication Systems, Networks, and Applications, CSNA 2007: (2007) | Conference Using a Trusted Platform Module to enable a Secure Usage of Nodes in Company Networks. An extension of the AEGIS approach Carolin Latze and Ulrich Ultes-Nitsche, Bern, Switzerland: (2007) | Conference RVS Retreat at Quarten Torsten Braun, Ulrich Ultes-Nitsche, Marc Brogle, Dragan Milic, Patrick Lauer, Thomas Staub, Gerald Wagenknecht, Markus Anwander, Markus Waelchli, Markus Wulff, Carolin Latze, Michael Hayoz, Christoph Ehret, Thierry Nicola, (2007) | Working paper A power-set construction for reducing Büchi automata to non-determinism degree two Information Processing Letters (IPL)\t(2007) | Journal article A Complete Characterization of Deterministic Regular Liveness Properties Theoretical Computer Science (TCS)\t(2007) | Journal article A role model to cope with the complexity of network configuration David Buchmann and Dominik Jungo and Ulrich Ultes-Nitsche, Spa, Belgium: (2007) | Conference Improving Network Reliability by avoiding Misconfiguration David Buchmann and Dominik Jungo and Ulrich Ultes-Nitsche, La Rochelle, France: (2007) | Conference Proceedings of the 5th International Workshop on Modelling, Simulation, Verification, and Validation of Enterprise Information Systems (MSVVEIS 2007) Augusto, Juan Carlos, Barjis, Joseph, Ulrich Ultes-Nitsche, ed. by Augusto, Juan Carlos and Barjis, Joseph and Ulrich Ultes-Nitsche (Funchal, Madeira, Portugal: INSTICC Press, 2007) | Book Strong Mutual Authentication in a User-Friendly Way in EAP-TLS Carolin Latze and Ulrich Ultes-Nitsche and Florian Baumgartner, Split, Dubrovnik, Croatia: (2007) | Conference Towards more adequate EIS Science of Computer Programming\t(2007) | Journal article Assessment of code quality through classification of unit tests in VeriNeC Jungo, D. and Buchmann, D. and Ultes-Nitsche, U., Proceedings - 21st International Conference on Advanced Information Networking and Applications Workshops/Symposia, AINAW'07: (2007) | Conference Case Study of the Usage of an Authentication and Authorization Infrastructure (AAI) in an E-learning Project Aurelius Baier and Thomas Bernoulli and Torsten Braun and Christoph Graf and Ulrich Ultes-Nitsche, Sandton, South Africa: (2006) | Conference Environmental acquisition in mobile network simulation Buchmann, D. and Jungo, D. and Ultes-Nitsche, U., WINSYS 2006 - International Conference on Wireless Information Networks and Systems, Proceedings: (2006) | Conference Foreword Barjis, J. and Ultes-Nitsche, U. and Augusto, J.C., Proceedings of the 4th International Workshop on Modelling, Simulation, Verification and Validation of Enterprise Information Systems, MSVVEIS 2006 - In Conjunction with ICEIS 2006: (2006) | Conference Proceedings of the 4th International Workshop on Modelling, Simulation, Verification, and Validation of Enterprise Information Systems (MSVVEIS 2006) Barjis, Joseph, Ulrich Ultes-Nitsche, Augusto, Juan Carlos, ed. by Barjis, Joseph and Ulrich Ultes-Nitsche and Augusto, Juan Carlos (Paphos, Cyprus: INSTICC Press, 2006) | Book Non-Signature Based Virus Detection: Towards Establishing Unknown Virus Detection Technique Using SOM Journal in Computer Virology\t(2006) | Journal article Testing of Semantic Properties in XML Documents Dominik Jungo and David Buchmann and Ulrich Ultes-Nitsche, Paphos, Cyprus: (2006) | Conference Non-signature based virus detection: Towards establishing a unknown virus detection technique using SOM Journal in Computer Virology\t(2006) | Journal article Model-checking Inherently Fair Linear-time Properties Thierry Nicola and Fank Nießner and Ulrich Ultes-Nitsche, Miami, Florida, USA: (2005) | Conference Proceedings of the 3rd International Workshop on Modelling, Simulation, Verification and Validation of ",
  "content_length": 25299,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:45"
}