{
  "name": "Ulrike Sattler",
  "homepage": "http://www.cs.man.ac.uk/~sattler",
  "status": "success",
  "content": "Homepage of Uli Sattler Homepage of Uli Sattler I live in Manchester, where I am a professor in the Information Management Group within the Department of Computer Science of the University of Manchester, a Deputy Head of Department, and a Senior Mentor. My address is: Department of Computer Science (building 39 on this map), University of Manchester, Oxford Road, Manchester M13 9PL, UK Office: Room 2.121 Voice (+44-161) 275-6176 Fax (+44-161) 275-6236 uli.sattler@manchester.ac.uk - please note that my very old email address sattler@cs.man.ac.uk no longer works and fails silently! Scientific Interests My general research interests are in logics for knowledge representation and automated deduction. More specifically, I am interested in Description, Modal, and Dynamic Logics, the corresponding inference problems, their complexity, and decision procedures for these problems. Description Logics are a family of knowledge representation formalisms with several nice properties such as high expressive power, well-defined semantics, decidable inference problems, and practicable inference algorithms for these problems. I work on Description Logics as the logical underpinning of ontology languages such as OWL and OWL 2; their usage, for example, in molecular biology; practical inference algorithms for highly expressive Description Logics; and on the complexity of and inference algorithms for Description, Modal, and Dynamic Logics, using e.g., automata-based and tableau-based techniques. Have a look at our OWL in Manchester web site, with a list of DL reasoners. Announcements and news: The wonderful new Transactions on Graph Data and Knowledge is a truely Open Access journal on all things related to knowledge graphs, ontologies, knowledge representation, etc. We have published our textbook on Description Logic, An Introduction to Description Logic, also available as paperback. I have given courses at WebST2016, ESSLLI 2016 (together with Thomas Schneider), NASSLLI 2016, and the Reasoning Web Summer School 2013. I will give a course at ESSAI 2024 with Jiaoyan Chen. Ontogenesis is a Knowledge Blog for descriptive, tutorial and explanatory material about building, using and maintaining ontologies, as well as the social processes and technology that support this. So far, I have contributed, with Robert Stevens, blogs on trees and what you can and can't say in OWL, disjointness in OWL, OWL, GCIs, pre- and post-coordination, when to use a classes versus objects in OWL, (un)satisfiability, multidimensional modelling, and translating graphics into OWL. the Journal of Logic and Computation has a corner on Logic for Ontology Engineering , and you are cordially invited to submit a paper Publications and talks Here is a shiny DBLP Publication List and google scholar is so kind to maintain my citations. Teaching and Supervision If you consider doing your Ph.D. in logic-based knowledge representation, ontologies, or Description or Modal Logics, and would like to do it within our great, cross-disciplinary IMG group and under my supervision, please have a look at the departmental web page for future Ph.D. students and let me know. I teach, together with Bijan Parsia and the friendly support of <oXygen/> XML editor, COMP60411 on modelling data on the Web. I also teach, with Stewart Blakeway, Aphrodite Galata , and Duncan Hull, COMP10120 First Year Team Project. Currently, I am co-supervising the following PhD students: Eleanor Turner The following is a list of people with a PhD that I have had the great pleasure to co-supervise in the past: Lei Li, Birte Glimm, Matthew Horridge, Peihong Ke , Pavel Klinov, Chiara Del Vescovo, Samantha Bail, Rafael Goncalves, Nico Matentzoglu, Kody Moodley, Tahani Alsubait, Jared Leo, Viachaslau (Slava) Sazonau, Ghader Kurdi, Chris Kindermann, Mirantha Jayathilaka, Deborah Mendes Fereira, Haoruo Zhao, Jake Saunders, Yulia Rozanova, and Ruba Alassaf. and Disclaimer and Privacy Statement and Copyright Notice. Uli Sattler",
  "content_length": 3994,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:46"
}