{
  "name": "Ulrich Endriss",
  "homepage": "https://staff.science.uva.nl/u.endriss",
  "status": "success",
  "content": "Home | Ulle Endriss Ulle Endriss ulle cv publications teaching activities media group illc Institute for Logic, Language and Computation University of Amsterdam Postbus 94242 1090 GE Amsterdam The Netherlands Tel: +31 (0)20 525 6511 Email: ulle.endriss@uva.nl Room: L6.33 (Science Park 900) (download) (download) Affiliation. I'm Professor of Artificial Intelligence and Collective Decision Making at the Institute for Logic, Language and Computation (ILLC) at the University of Amsterdam, where I lead the COMSOC Group. I'm a member of the Theoretical Computer Science research unit of the ILLC and we are part of the broader Theory community in Amsterdam (theory.amsterdam). I'm also a member of our Centre for Explainable, Responsible and Theory-driven AI (CERTAIN). Research. My research concerns the use of formal methods in AI, specifically in multiagent systems and knowledge representation. I'm particularly interested in problems at the interface of AI with economics and political science, and much of my work in this area falls under the heading of computational social choice. All of my papers are available from this website. Most of them are also open-access publications in the formal sense of that term (and hopefully one day all of them will be). Teaching. I regularly teach courses on Computational Social Choice and Game Theory for our MSc Logic and MSc AI programmes, and in the past I also taught a very cool course on Problem Solving and Search for the first-year students in our BSc AI programme. I make a point of making all of the teaching materials I developed over the years openly available to everyone who might be interested (just as I do for my research output). I keep a list of (most of) the Master's theses I supervised, many of which have led to great published research. Advertisements. Please find below a few examples of recent and ongoing activities as well as reading suggestions: Working paper of the nature of axioms in social choice theory. Feedack welcome! The ADDI project on digital democracy has started. I will advertise PhD positions in early 2026 (to start around September/October). Game-Academy.org: Integrate interactive games into your game theory classes or outreach events! Pabuviz.org: What's the best voting rule for participatory budgeting in your city? Outreach: Algorithms for Democracy, Explaining voting outcomes with AI, Why no voting system is fair, When residents design their city Seminars: COMSOC Video Seminar, Dutch Social Choice Colloquium, COMSOC Seminar at the ILLC, FOAM Seminar Survey papers: MARA Survey, Fair Division, COMSOC Short Intro, Combinatorial Preferences, Logic and Social Choice, COMSOC FET Pamphlet, COMSOC MAS Chapter, Judgment Aggregation Computational Social Choice community: COMSOC Workshops, PhD thesis collection Computational logic tools: WinKE (teaching logic), CIFF (abductive logic programming), Wellington (description logics) Recommended reading for my fellow academics: Bibliometric Evaluation of Computer Science (Mattern, 2008), The Fall of the Faculty (Ginsberg, 2011), What are Universities for? (Collini, 2012) Unsolicited advice: how to write a paper, how to give a talk, how to write a review last modified on Wednesday, 24-Sep-2025 15:36:53 CEST(ue)",
  "content_length": 3260,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:37"
}