{
  "name": "Ulrik Schroeder",
  "homepage": "http://learntech.rwth-aachen.de/schroeder",
  "status": "success",
  "content": "RWTH Aachen University | Rheinisch-Westfälische Technische Hochschule | EN Copyright: © Fabian Erler Copyright: © Martin Braun Copyright: © Christian van't Hoen - birdsonaplane.de Copyright: © Mario Irrmischer Studying at RWTH Welcome to Aachen, Welcome to RWTH Explore Academics Im Modul herunter scrollen Copyright: © Mario Irrmischer What Defines Excellent, Modern University Teaching?“There are many elements involved, but if I had to boil it down to one word, it would be flexibility,” says Professor Joost-Pieter Katoen, RWTH’s Vice Rector for Teaching and Learning. “That means giving students – both undergraduate and graduate – the opportunity to spend a semester at another university, typically abroad.” See More Research at RWTH A Laboratory of Ideas, a Workshop for Tomorrow Explore Research Im Modul herunter scrollen Copyright: © Peter Winandy The Marathon to the SummitClassic supercomputers are reaching the limits of their computing power. In the race to create the first quantum computer suitable for practical applications, RWTH researchers at the ML4Q Cluster of Excellence are making significant strides. The goal is ambitious, but the path is long, as Professor Hendrik Bluhm explains. See More Technology Transfer From Research to Real-World Solutions Explore Technology Transfer Im Modul herunter scrollen Copyright: © Heike Lachmann Pioneering Spirit, Determination, and a Whole Lot of HeartDr. Thorsten Sieß, CTO of Johnson & Johnson MedTech | Heart Recovery, was honored with the 2025 Aachen Engineering Award. See More Who We Are International and Interdisciplinary by Design Explore RWTH Im Modul herunter scrollen Copyright: © Heike Lachmann RWTH Reaffirmed as a Family-Friendly UniversityIn recognition of its ongoing commitment to creating family-friendly working and learning environments, RWTH has once again been confirmed as a “Family-Friendly University” by the Board of Trustees of berufundfamilie Service GmbH. See More Academics Research Transfer About RWTH Teaser Copyright: © Heike Lachmann How Does Mining 4.0 Work? Mining is leaving behind its dusty, industrial image and stepping into a digital, sustainable high-tech future. Professor Elisabeth Clausen explains why the coal phase-out doesn’t spell the end of mining—and what the future of raw-material extraction will look like. Read More: How Does Mining 4.0 Work? Copyright: © Peter Winandy La Traviata in the Flame Tube It hissed and glowed, banged and flashed—and yes, there was even a hint of smoke in the air. At RWTH Aachen University’s annual Science Night, experiments, shows, lectures, and hands-on stations drew some 8,000 visitors to campus. Read More: La Traviata in the Flame Tube Recent Highlights 27/11/2025 Digital Infrastructure Twins Read Article 27/11/2025 RWTH Late Night at Oecher Lab: “The Future on Prescription” Read Article 26/11/2025 Working Together for a More Sustainable University Read Article Explore All News Research with Purpose. Answers with Impact. Read More Copyright: © Peter Winandy Copyright: © Martin Braun Excellence We treat change as a mandate to innovate –  transforming RWTH into a next-generation university that forges new paths in science, industry, and society through excellence, responsibility, and a strong sense of community. Excellence Strategy Copyright: © Martin Braun Sustainability At RWTH, we are committed to advancing sustainability across all areas of the University – by minimizing our environmental impact, working toward climate neutrality, and fostering a culture of responsibility, inclusion, and stewardship. Sustainability Copyright: © Valerie Hartmann Diversity At RWTH, gender equity, equal opportunity, and a deep appreciation for diversity are core values that shape our culture – across research, teaching, learning, careers, and leadership. Gender & Diversity Copyright: © Kurt Beyer Internationalization With more than 15,000 international students, researchers, educators, and staff from over 140 countries, RWTH Aachen University thrives as a hub of international collaboration. Internationalization Previous item Excellence Sustainability Diversity Internationalization Next item Upcoming Events 30/11/2025 Art Meets Science – AVT FOYER: Exhibition “Tanja Elmazovic and Suat Sensoy – Movement” View Details 30/11/2025 IGMR Seminar: Kinematics, Dynamics and Mechatronics in Motion Technology View Details 30/11/2025 SSD Seminar Series 2025/2026 View Details View All Events Why I love studying here? RWTH is tackling real challenges that will shape the future, the teaching is fresh and hands-on, and the University has an outstanding reputation. Plus, Aachen is a great place to live and study! Sevval Bayram, Student Image © Heike Lachmann Working at RWTH Start Your Journey, Advance Your Career Copyright: © Martin Braun",
  "content_length": 4801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:46"
}