{
  "name": "Ulrich Rüde",
  "homepage": "https://www.cs10.tf.fau.de/person/ulrich-ruede",
  "status": "success",
  "content": "Prof. Ulrich Rüde - Chair for Computer Science 10 – System Simulation Simulate organization breadcrumb open Simulate organization breadcrumb close Prof. Ulrich Rüde Prof. Ulrich Rüde Prof. Dr. Ulrich RüdeProfessor im RuhestandDepartment of Computer ScienceChair of Computer Science 10 (System Simulation)Room: Room 00.143Cauerstrasse 1191058 ErlangenPhone number: +49 9131 85-28923Fax number: +49 9131 85-28928Email: ulrich.ruede@fau.deWebsite: https://cs10.tf.fau.de/ulrich-ruede Functions, (honorary) activities, memberships Functions, (honorary) activities, memberships Editorial Activities From January 2005 until December 2010 I served as editor-in-chief of the SIAM J. Scientific Computing. I am also member of the editorial board of  International Journal of Parallel and Emergent Distributed Systems, International Journal of Computational Science and Engineering (IJCSE) und des neuen Elsevier Science Journal on Computational Science (JoCS). I am also a member of the SIAM books committee. Speaker and Consultant Activities Since 2011 I am chairing the Zentralinstituts für Scientific Computing , and since 2012 I am director of the Indo-German Winter Academy. From 2012 until 2017 I was appointed to be member of the Forschungsbeirat der TU Kaiserslautern . Since 2012 I am spokesperson of the GAMM-Fachausschusses Computational Science and Engineering (CSE) , and since  2013 I am member of the DFG-Kommission für IT-Infrastruktur (KfR) . Conference Program Committees I currently serve on the programme commitees of Workshop Parallel Systems and Algorithms (PASA 2006, 2008 , 2010) , ASIM Symposium on Simulation Techniques (2005, 2006, 2008) , Copper Mountain Conference on Multigrid Methods (2005, 2007,2009, 2011), International Supercomputing Conference (ISC’07) , (ISC’08), Supercomputing 2007 (SC 07), 2008 (SC 08), 2010 (SC 10), 2011 (SC 11) , ACM International Conference on Computing Frontiers 2008, Euro-Par Advisory Committee, 2008 IEEE 11th International Conference on Computational Science and Engineering, SIAM Conference on Computational Science and Engineering (CSE09, CSE11) </A> IEEE International Conference on High Performance Computing (HiPC’09, HiPC’10) First International Workshop on New Frontiers in High-performance and Hardware-aware Computing (HipHaC’08) Erlangen High-End-Computing Symposium (2006, 2007, 2008, 2009). Siehe auch das GSCI Konferenz-Archiv. International Parallel and Distributed Processing Symposium IPDPS 2012 Memberships Deutsche Mathematikervereinigung (DMV ) Gesellschaft für Informatik (GI ) Gesellschaft für Angewandte Mathematik und Mechanik (GAMM ) Society for Industrial and Applied Mathematics (SIAM ) Research Projects Publications 2025 Böhm F., Bauer D., Kohl N., Alappat C., Thönnes D., Mohr M., Köstler H., Rüde U.:Code Generation and Performance Engineering for Matrix-Free Finite Element Methods on Hybrid Tetrahedral GridsIn: SIAM Journal on Scientific Computing 47 (2025), p. B131-B159ISSN: 1064-8275DOI: 10.1137/24M1653756 Dumitrasc A., Kruse C., Rüde U.:GENERALIZED GOLUB-KAHAN BIDIAGONALIZATION FOR NONSYMMETRIC SADDLE-POINT SYSTEMSIn: Siam Journal on Matrix Analysis and Applications 46 (2025), p. 370-392ISSN: 0895-4798DOI: 10.1137/23M160760X Kemmler S., Rettinger C., Rüde U., Cuéllar P., Köstler H.:Efficiency and scalability of fully-resolved fluid-particle simulations on heterogeneous CPU-GPU architecturesIn: International Journal of High Performance Computing Applications (2025)ISSN: 1094-3420DOI: 10.1177/10943420241313385 Leleux P., Schwarz C., Kühn MJ., Kruse C., Rüde U.:Complexity analysis and scalability of a matrix-free extrapolated geometric multigrid solver for curvilinear coordinates representations from fusion plasma applicationsIn: Journal of Parallel and Distributed Computing 205 (2025), Article No.: 105143ISSN: 0743-7315DOI: 10.1016/j.jpdc.2025.105143 Suffa P., Kemmler S., Holzer M., Köstler H., Rüde U.:Large-Scale Lattice Boltzmann Simulations on Modern HPC Systems with the waLBerla FrameworkNIC Symposium 2025 (Jülich Supercomputing Centre (JSC) Institute for Advanced Simulation (IAS) Forschungszentrum Jülich GmbH 52425 Jülich, Germany, 6. March 2025 - 7. March 2025) Suffa P., Kemmler S., Köstler H., Rüde U.:Large-scale simulations of fully resolved complex moving geometries with partially saturated cellsIn: Physics of Fluids 37 (2025), Article No.: 055141ISSN: 1070-6631DOI: 10.1063/5.0268021 2024 Alt C., Lanser M., Plewinski J., Janki A., Klawonn A., Köstler H., Selzer M., Rüde U.:A continuous benchmarking infrastructure for high-performance computing applicationsIn: International Journal of Parallel, Emergent and Distributed Systems (2024)ISSN: 1744-5760DOI: 10.1080/17445760.2024.2360190 Dumitrasc A., Kruse C., Rüde U.:DEFLATION FOR THE OFF-DIAGONAL BLOCK IN SYMMETRIC SADDLE POINT SYSTEMSIn: Siam Journal on Matrix Analysis and Applications 45 (2024), p. 203-231ISSN: 0895-4798DOI: 10.1137/22M1537266 Holzer M., Mitchell TR., Leonardi CR., Rüde U.:Development of a central-moment phase-field lattice Boltzmann model for thermocapillary flows: Droplet capture and computational performanceIn: Journal of Computational Physics 518 (2024), Article No.: 113337ISSN: 0021-9991DOI: 10.1016/j.jcp.2024.113337 Plewinski J., Alt C., Köstler H., Rüde U.:Performance analysis of the free surface lattice Boltzmann implementation in waLBerlaIn: Proceedings in Applied Mathematics and Mechanics (2024)ISSN: 1617-7061DOI: 10.1002/pamm.202400196 Schottenhamml H., Anciaux Sedrakian A., Blondel F., Köstler H., Rüde U.:waLBerla-wind: A lattice-Boltzmann-based high-performance flow solver for wind energy applicationsIn: Concurrency and Computation-Practice & Experience 36 (2024)ISSN: 1532-0626DOI: 10.1002/cpe.8117 Suffa P., Kemmler S., Köstler H., Rüde U.:Highly Parallel Complex Moving Geometries on CPU and GPU using the Partially Saturated Cells Method33rd Discrete Simulation of Fluid Dynamics (DSFD) Conference (ETH Zürich Rämistrasse 101 8092 Zürich Schweiz, 9. July 2024 - 12. July 2024) 2023 Bourne E., Leleux P., Kormann K., Kruse C., Grandgirard V., Güçlü Y., Kühn MJ., Rüde U., Sonnendrücker E., Zoni E.:Solver comparison for Poisson-like equations on tokamak geometriesIn: Journal of Computational Physics 488 (2023), p. 112249ISSN: 0021-9991DOI: 10.1016/j.jcp.2023.112249 Hennig F., Holzer M., Rüde U.:Advanced Automatic Code Generation for Multiple Relaxation-Time Lattice Boltzmann MethodsIn: SIAM Journal on Scientific Computing 45 (2023), p. C233-C254ISSN: 1064-8275DOI: 10.1137/22M1531348 Holzer M., Staffelbach G., Rocchi I., Badwaik J., Herten A., Vavrik R., Vysocky O., Riha L., Cuidard R., Rüde U.:Scalable Flow Simulations with the Lattice Boltzmann Method20th ACM International Conference on Computing Frontiers, CF 2023 (Bologna, 9. May 2023 - 11. May 2023)In: Proceedings of the 20th ACM International Conference on Computing Frontiers 2023, CF 2023 2023DOI: 10.1145/3587135.3592176 Kemmler S., Schwarzmeier C., Rettinger C., Plewinski J., Núñez-González F., Köstler H., Rüde U., Vowinckel B.:Geometrically Resolved Simulation of Upstream Migrating Antidune Formation and Propagation40th IAHR World Congres (Wien, 21. August 2023 - 25. August 2023) Kohl N., Bauer D., Böhm F., Rüde U.:Fundamental data structures for matrix-free finite elements on hybrid tetrahedral gridsIn: International Journal of Parallel, Emergent and Distributed Systems (2023)ISSN: 1744-5760DOI: 10.1080/17445760.2023.2266875 Rettinger C., Tabesh M., Rüde U., Vollmer S., Frings RM.:On the use of packing models for the prediction of fluvial sediment porosityIn: Earth Surface Dynamics 11 (2023), p. 1097-1115ISSN: 2196-6311DOI: 10.5194/esurf-11-1097-2023 Schuster D., Climent E., Rüde U.:Particle laden flows around a circular cylinder from the hydrodynamic to granular regimeIn: International Journal of Multiphase Flow 165 (2023), Article No.: 104487ISSN: 0301-9322DOI: 10.1016/j.ijmultiphaseflow.2023.104487 Schwarzmeier C., Holzer M., Mitchell T., Lehmann M., Häusl F., Rüde U.:Comparison of free-surface and conservative Allen–Cahn phase-field lattice Boltzmann methodIn: Journal of Computational Physics 473 (2023), Article No.: 111753ISSN: 0021-9991DOI: 10.1016/j.jcp.2022.111753 Schwarzmeier C., Rettinger C., Kemmler S., Plewinski J., Núñez-González F., Köstler H., Rüde U., Vowinckel B.:Particle-resolved simulation of antidunes in free-surface flowsIn: Journal of Fluid Mechanics 961 (2023), p. R1ISSN: 0022-1120DOI: 10.1017/jfm.2023.262 Schwarzmeier C., Rettinger C., Kemmler S., Plewinski J., Núñez-González F., Köstler H., Rüde U., Vowinckel B.:Particle-resolved simulations of antidune migration in supercritical flowsEGU General Assembly (Wien, 23. April 2023 - 28. April 2023)URL: https://www10.cs.fau.de/publications/posters/2023/Kemmler_EGU_2023.pdf Schwarzmeier C., Rüde U.:Analysis and comparison of boundary condition variants in the free‐surface lattice Boltzmann methodIn: International Journal For Numerical Methods in Fluids (2023)ISSN: 0271-2091DOI: 10.1002/fld.5173 Suffa P., Rüde U.:Generated domain-specific sparse data kernels for high-performance Lattice Boltzmann Methodsnternational Conference on Data-Integrated Simulation Science (SimTech2023) (Universität Stuttgart Keplerstraße 7 70174 Stuttgart Deutschland, 4. October 2023 - 6. October 2023) Thönnes D., Rüde U.:Model-Based Performance Analysis of the HyTeG Finite Element FrameworkDOI: 10.1145/3592979.3593422 2022 Ambekar AS., Rüde U., Buwa VV.:Forces governing the dynamics of liquid spreading in packed bedsIn: Journal of Fluid Mechanics 948 (2022)ISSN: 0022-1120DOI: 10.1017/jfm.2022.665 Ambekar AS., Rüde U., Buwa VV.:Particle-resolved simulations of local liquid spreading in packed beds: Effect of wettability at varying particle sizeIn: Physics of Fluids 34 (2022), Article No.: 062111ISSN: 1070-6631DOI: 10.1063/5.0096157 Ambekar AS., Schwarzmeier C., Rüde U., Buwa V.:Particle‐resolved turbulent flow in a packed bed: RANS, LES, and DNS simulationsIn: AIChE Journal (2022)ISSN: 000",
  "content_length": 138506,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:39"
}