{
  "name": "Ulug Bayazit",
  "homepage": "http://web.itu.edu.tr/ulugbayazit",
  "status": "success",
  "content": "Ulug Bayazit webpage ITU Computer Engineering Department Homepage Uluð BAYAZIT Professor Department of Computer Engineering address: Istanbul Teknik Üniversitesi Bilgisayar Mühendisliði Bölümü Bilgisayar ve Biliþim Fakültesi Ayazaga Kampusu Maslak Istanbul 34469, Turkey e-mail:mailto:ulugbayazit@itu.edu.tr office no.: 305 phone: +90 212 285 7742 fax     : +90 212 285 3679 GRADUATION DESIGN PROJECT TOPICS LIST(NEW! 2025-2026) Research Interests: - Data Compression. - Deep Learning. - Computer Vision. - Computer Graphics. - Image, Video, Multimedia Coding and Processing. Recent Publications : o  Semih Çelik, Uluð Bayazýt, Gesture detection from sEMG signals based on similarity learning, Neural Computing and Applications, June 2025 (pdf) o  Eren Berk Edinç, Uluð Bayazýt, Assessing the Generalization Ability of a Global Model for Rapid Building Damage Assessment in Real-world Disaster Scenarios, INISTA, September 2024 (pdf) o  Derya Uysal, Uluð Bayazýt, Learning Weight of Losses in Multi-Scale Crowd Counting, INISTA, September 2023 (pdf) o Uluð Bayazýt, Deniz Turgay Altýlar, Nilgün Güler Bayazýt, Classification and phenological staging of crops from in situ image sequences by deep learning, Turkish Journal of Electrical Engineering and Computer Sciences, Vol. 30, No. 4, 2022 (pdf) o Canan Gülbak Bahçe, Uluð Bayazýt, Compression of geometry videos by 3D-SPECK wavelet coder, The Visual Computer, Vol. 37, 973-991, 2021 (pdf) Teaching Activities : Current: - BBF 102E Linear Algebra and Applications (Fall 2025) - BLG 538E Data Compression  (Fall 2025) Past: MAT 271E Probability and Statistics ISE 306 Computer Networks KOM 505E Probability and Stochastic Processes BLG 443E Discrete Event Simulation BLG433 Bilgisayar Haberleþmesi TEL366 Haberleþme Temelleri ve Sistem Education : Institution: Rensselaer Polytechnic Institute, Troy, NY. Degree Awarded: Ph.D. Field: Electrical Engineering. Year: 1996 Institution: Rensselaer Polytechnic Institute, Troy, NY. Degree Awarded: MS. Field: Mathematics. Year: 1995 Institution: Rensselaer Polytechnic Institute, Troy, NY Degree Awarded: MS. Field: Electrical Engineering. Year: 1993 Institution: Bogazici University, Istanbul, Turkey Degree Awarded: BS. Field: Electrical Engineering. Year: 1991",
  "content_length": 2268,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:49"
}