{
  "name": "Ulugbek S. Kamilov",
  "homepage": "https://cigroup.wustl.edu",
  "status": "success",
  "content": "Home | Computational Imaging Group | Washington University in St. Louis Skip to content Skip to search Skip to footer Washington University in St. Louis Welcome to WashU CIG! Computational Imaging is a dynamic and rapidly evolving field at the intersection of artificial intelligence, computer vision, image reconstruction, applied mathematics, and the physical sciences. The Computational Imaging Group (CIG) develops cutting-edge algorithms and theoretical frameworks for fast, robust, and high-fidelity acquisition, processing, and interpretation of imaging data—ranging from 2D images to 3D volumes and 4D dynamic sequences. Our work addresses challenges across a range of applications, including biomedical imaging, materials science, remote sensing, space exploration, industrial inspection, and consumer imaging. We specialize in deep learning, large-scale optimization, inverse problems, and statistical inference, with a strong emphasis on the development of principled methods that generalize across tasks and domains. CIG’s research is deeply interdisciplinary, with active collaborations spanning optics, medicine, physics, materials science, and biology. Our goal is to advance the foundational algorithms and systems that will power the next generation of imaging and sensing technologies. Interested in doing research in CIG? Multiple opportunities at all levels. Overview of research opportunities. Research Projects for WashU Students. International Student Research Internship Program. CSE Research Experience for Undergraduates (REU). Summer Engineering Fellowship Program (WUSEF). 2023 – 2022 – 2021 – 2019 – 2018 Latest News May 2025: Plug-and-Play Priors as a Score-Based Method was accepted to IEEE ICIP 2025. May 2025: Welcome to Xiao Shi, Emily Seligson, Eugene Joo, Sam Kang, Dijkstra Liu, and Mingi Kang, who have joined CIG as summer research interns. May 2025: New paper Measurement Score-Based Diffusion Model. May 2025: New paper Unsupervised Detection of Distribution Shift in Inverse Problems using Diffusion Models. May 2025: Stochastic Deep Restoration Priors for Imaging Inverse Problems was accepted to ICML 2025. [see more] Follow @washucig",
  "content_length": 2178,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:49"
}