{
  "name": "Umang Bhaskar",
  "homepage": "http://www.tcs.tifr.res.in/~umang",
  "status": "success",
  "content": "Umang's page Hi, I'm Umang Bhaskar. I am a faculty member in the School of Technology and Computer Science at the Tata Institute of Fundamental Research. My primary research is on algorithmic game theory, the study of computational problems that arise when multiple rational agents interact, each trying to optimize its own objective. I'm further interested in problems in combinatorial optimization, especially online and approximation algorithms. Before joining TIFR, I was: a postdoctoral scholar at UWaterloo and Caltech; a PhD student at Dartmouth College; an MTech student at IIT, Bombay; and an undergrad at NIT, Allahabad Somewhere in between, I worked for two years with Tata Consultancy Services. Stuff Rohit Vaish and I are co-organising a pre-FSTTCS workshop on information in games and mechanisms in BITS Pilani, Goa, on December 16th, 2025. It should be a great program, with a fantastic set of speakers. If you're interested in the role of information and learning in games, do consider attending. Previous workshops: Workshop on algorithmic mechanism design on December 19th and 20th, 2024, at IIT Gandhinagar, prior to FSTTCS 2024, with Meghana Nasre. Workshop on the Algorithmic Frontiers of Fairness on December 16th and 17th, at IIIT Hyderabad, prior to FSTTCS 2023, with Siddharth Barman. Workshop on Complexity in Algorithmic Game Theory on December 10th, 2019, at IIT Bombay prior to FSTTCS 2019, with Siddharth Barman. VV 2024: Resources for the Algorithms on Graphs course. In memoriam: Phani Raj Lolakapuri Contact Mailing address:A-211, School of Technology and Computer Science, Tata Institute of Fundamental Research, Colaba, Mumbai - 400 005, India. Office phone:+91-22-2278 2288 Email:u@tifr.res.in, with 'u' replaced by 'umang' Recent Teaching 2023: Computational Social Choice 2023: Algorithms and Data Structures 2024: Algorithms and Data Structures 2025: Algorithmic Game Theory Publications For a list of publications, please see my DBLP page. If you would like a copy of a paper, please send me an email. Students & Internships If you are not a student at TIFR and would like to work with me, please apply to the TIFR VSRP. Note that entrance to this programme is very competitive. I typically do not take students outside of VSRP, and prefer students that have completed three years of undergraduate education. If your research interests are aligned with mine, send me an email with details. I may not respond if this is not the case. Personal My interests include hiking, traveling to new countries and places, board games, reading and (very occasionally) writing.",
  "content_length": 2603,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:59"
}