{
  "name": "Umar Farooq 0002",
  "homepage": "https://csc.lsu.edu/~ufarooq",
  "status": "success",
  "content": "Umar Farooq Umar Farooq Assistant Professor Computer Science & Engineering 3209M Patrick F. Taylor Hall ufarooq at lsu.edu | | | | | Short Bio: I am an Assistant Professor in Computer Science & Engineering at Louisiana State University, where I focus on enhancing the reliability, security, and efficiency of software systems. This involves developing program analysis techniques, addressing software engineering challenges in quantum computing, including the transition to Post-Quantum Cryptography (PQC) and its readiness, and investigating the application of LLMs to automate and improve the software development lifecycle. Prior to joining LSU in Fall 2023, I gained valuable industry experience as a software engineer for compiler infrastructure at ByteDance/TikTok, contributing to high-performance computing solutions. I earned my Ph.D. from the University of California, Riverside (UCR), under the guidance of Dr. Zhijia Zhao. I have been honored with a Best Paper Runner-up Award at MobiSys’18, an inclusion in the ACM SIGMOBILE Research Highlights (2018), and a Best Paper Award at IEEE QSW’25. Research Interests Program Analysis and Optimization for Software Reliability: Developing novel techniques to automatically detect and prevent software defects, improve system stability, and enhance overall software quality [MobiSys’18(Best Paper Runner-up), OOPSLA’20, CC’23, AST’23, ICS’25]. Software Engineering for Quantum Computing: Exploring software engineering challenges and solutions for quantum computing, including the transition to Post-Quantum Cryptography (PQC) and the development of reliable quantum software [IEEE QSW’25(Best Paper Award), IEEE S&P’25]. AI for Software Engineering (AI4SE/SE4AI): Investigating the application of Artificial Intelligence, particularly Large Language Models (LLMs), to automate and enhance various aspects of the software development lifecycle, from code generation and testing to debugging and maintenance. In parallel, I also focus on applying software engineering principles to build reliable, robust, and explainable AI systems [BigData’20, BigData’22, SIGIR’23, ICSC’25, BigData’25]. Current Students Moshood A Fakorede (PhD student) Vinaik Chhetri (PhD student) Krishna Upadhyay (PhD student) Samrat Acharya (MS student) Daniel Liu (Undergraduate student) Joseph K. Strauss (Undergraduate student) Joseph M. Huynh (Undergraduate student) News Aug 1, 2025 Received NSF SaTC funding for Personalized and Trustworthy App Recommendations. Jul 11, 2025 Krishna’s paper received the Best Paper Award at IEEE QSW’25. Selected Publications 2025 BigData’25 Large-Scale Analysis of User Feedback on AI-Powered Mobile Apps Vinaik Chhetri, Krishna Upadhyay, A. B. Siddique, and Umar Farooq In Proceedings of the 2025 IEEE International Conference on Big Data (Big Data), 2025 Abs Bib @inproceedings{bigdata25, author = {Chhetri, Vinaik and Upadhyay, Krishna and Siddique, A. B. and Farooq, Umar}, booktitle = {Proceedings of the 2025 IEEE International Conference on Big Data (Big Data)}, title = {Large-Scale Analysis of User Feedback on AI-Powered Mobile Apps}, year = {2025}, doi = {}, url = {}, publisher = {IEEE Computer Society}, address = {Los Alamitos, CA, USA} } QSW’25 Analyzing the Evolution and Maintenance of Quantum Software Repositories Best Paper Award Krishna Upadhyay, Vinaik Chhetri, AB Siddique, and Umar Farooq In Proceedings of the 2025 IEEE International Conference on Quantum Software (QSW), 2025 Abs Bib HTML PDF Quantum computing is rapidly advancing, but quantum software development faces significant challenges, including a steep learning curve, high hardware error rates, and a lack of mature engineering practices. This study conducts a large-scale mining analysis of over 21,000 GitHub repositories, containing 1.2 million commits from more than 10,000 developers, to examine the evolution and maintenance of quantum software. We analyze repository growth, programming language and framework adoption, and contributor trends, revealing a 200% increase in repositories and a 150% rise in contributors since 2017. Additionally, we investigate software development and maintenance practices, showing that perfective commits dominate (51.76%), while the low occurrence of corrective commits (18.54%) indicates potential gaps in bug resolution. Furthermore, 34% of reported issues are quantum-specific, highlighting the need for specialized debugging tools beyond conventional software engineering approaches. This study provides empirical insights into the software engineering challenges of quantum computing, offering recommendations to improve development workflows, tooling, and documentation. We are also open-sourcing our dataset to support further analysis by the community and to guide future research and tool development for quantum computing. The dataset is available at: https://github.com/kriss-u/QRepoAnalysis-Paper @inproceedings{qsw2025, author = {Upadhyay, Krishna and Chhetri, Vinaik and Siddique, AB and Farooq, Umar}, booktitle = {Proceedings of the 2025 IEEE International Conference on Quantum Software (QSW)}, title = {Analyzing the Evolution and Maintenance of Quantum Software Repositories}, year = {2025}, pages = {173-184}, award = {Best Paper Award}, doi = {10.1109/QSW67625.2025.00029}, url = {https://doi.ieeecomputersociety.org/10.1109/QSW67625.2025.00029}, publisher = {IEEE Computer Society}, address = {Los Alamitos, CA, USA} } ICS’25 GraCFL: A Holistically Designed Vertex-Centric Graph System for CFL Reachability Sakib Fuad, Amir Hossein Nodehi Sabet, Umar Farooq, and Zhijia Zhao In Proceedings of the 2025 International Conference on Supercomputing, 2025 Abs Bib HTML PDF Many program analyses can be formulated as context-free language (CFL) reachability problems on an edge-labeled graph. While graph systems have been proposed recently for large-scale CFL reachability analysis of system software, the design space has not yet been systematically explored, leading to sub-optimal performance. This workpresents GraCFL, a holistically designed graph system for CFL reachability. Inspired by the vertex-centric processing paradigm, we formalize CFL reachability using a multi-directional vertex-centric model. We then analyze this model in terms of computation redundancy, strategies for deriving new reachability, data locality, and parallelism. The analysis reveals a set of insights that guide the design of new techniques and optimizations to improve system performance. As a result of the systematic design, GraCFL demonstrates superior performance compared to state-ofthe-art graph systems, with an average 14.14× speedup over Graspan and 8.33× speedup over POCR. Its source code is available at https://github.com/AutomataLab/GraCFL. @inproceedings{ics2025, author = {Fuad, Sakib and Sabet, Amir Hossein Nodehi and Farooq, Umar and Zhao, Zhijia}, title = {GraCFL: A Holistically Designed Vertex-Centric Graph System for CFL Reachability}, year = {2025}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, booktitle = {Proceedings of the 2025 International Conference on Supercomputing}, numpages = {15}, location = {Salt Lake City, UT, USA}, series = {ICS '25}, doi = {10.1145/3721145.3725762} } S&P’25 Assessing and Enhancing Quantum Readiness in Mobile Apps Joseph Strauss, Krishna Upadhyay, AB Siddique, Ibrahim Baggili, and Umar Farooq In 46th IEEE Symposium on Security and Privacy, 2025 Abs Bib HTML PDF Quantum computers threaten widely deployed cryptographic primitives such as RSA, DSA, and ECC. While NIST has released post-quantum cryptographic (PQC) standards (e.g., Kyber, Dilithium), mobile app ecosystems remain largely unprepared for this transition. We present a large-scale binary analysis of over 4,000 Android apps to assess cryptographic readiness. Our results show widespread reliance on quantum-vulnerable algorithms such as MD5, SHA-1, and RSA, while PQC adoption remains absent in production apps. To bridge the readiness gap, we explore LLM-assisted migration. We evaluate leading LLMs (GPT-4o, Gemini Flash, Claude Sonnet, etc.) for automated cryptographic migration. All models successfully performed simple hash replacements (e.g., SHA-1 to SHA-256). However, none produced correct PQC upgrades due to multi-file changes, missing imports, and lack of context awareness. These results underscore the need for structured guidance and system-aware tooling for post-quantum migration. @inproceedings{sp2025, author = {Strauss, Joseph and Upadhyay, Krishna and Siddique, AB and Baggili, Ibrahim and Farooq, Umar}, booktitle = {46th IEEE Symposium on Security and Privacy}, title = {Assessing and Enhancing Quantum Readiness in Mobile Apps}, year = {2025}, volume = {}, issn = {}, doi = {10.48550/arXiv.2506.00790}, url = {https://doi.org/10.48550/arXiv.2506.00790} } 2023 SIGIR’23 MobileRec: A Large Scale Dataset for Mobile Apps Recommendation MH Maqbool, Umar Farooq, Adib Mosharrof, AB Siddique, and Hassan Foroosh In Proceedings of the 46th International ACM SIGIR Conference on Research and Development in Information Retrieval, 2023 Abs Bib HTML PDF Recommender systems have become ubiquitous in our digital lives, from recommending products on e-commerce websites to suggesting movies and music on streaming platforms. Existing recommendation datasets, such as Amazon Product Reviews and MovieLens, greatly facilitated the research and development of recommender systems in their respective domains. While the number of mobile users and applications (aka apps) has increased exponentially over the past decade, research in mobile app recommender systems has been significantly constrained, primarily due to the lack of high-quality benchmark datasets, as opposed to recommendations for products, movies, and news. To facilitate research for app recommendation systems, we introduce a large-scale dataset, called MobileRec. We constructed MobileRec ",
  "content_length": 22415,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:47"
}