{
  "name": "Umberto Nanni",
  "homepage": "http://www.diag.uniroma1.it/users/umberto%20nanni",
  "status": "success",
  "content": "Umberto Nanni | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Umberto Nanni Umberto Nanni Professore ordinariopagina personalestanza: B220telefono: +39 0677274015email uniroma1: umberto.nanni@uniroma1.it Biografia POSITION & APPOINTMENTS November 2005--: full professor (Information Management Systems), University of Rome \"La Sapienza\" Previous Positions & Appointments 2015--2022: Director of the Research Center for Distance Learning and Technologies for Learning, Telematic University Unitelma Sapienza 2014--2020: President of the Area Council in Information Engineering (Latina location), University of Rome \"La Sapienza\" 1994--2005: associate professor, Sapienza University of Rome, Faculty of Engineering 1992--1994: associate professor, University of L'Aquila, Faculty of Sciences 1989--1992: university researcher, University of L'Aquila, Faculty of Sciences 2003-2015: co-founder and member of CTL - \"Research Center in Transport and Logistics\" (\"Sapienza\") 2012-2015: member of the directorial board of CTL (http://www.ctl.uniroma1.it) 2007-2014: coordinator of the Interfaculty Teaching Laboratories in via Tiburtina (\"Sapienza\") Visiting Research Institutions He has been visiting several research institutions, including: - International Computer Science Institute (ICSI) (Berkeley, CA) - Max Planck Institut für Informatik (Saarbrücken, Germany) - University of Utrecht (Utrecht, the Netherlands) - Technion of Haifa (Haifa, Israel) TEACHING Current courses at Università di Roma “La Sapienza”: Data Bases, Digitalization of Human Resources Management Previous courses: Enterprise Information Systems (Management Engineering) - Software and Services for the Information Society (Computer Engineering),  Networks and Operating Systems Advisor Over 400 Thesis (MS and BA), and 2 PhD Thesis. Editorial Activity He is reviewer for various national and international journals and conferences Recent Program Committee Memberships ● KMIS 2025 - 17th International Conference on Knowledge Management and Information Systems, Oct 20-22, 2025 - Marbella, Spain ● eLmL 2025 - 17th International Conference on Mobile, Hybrid, and On-line Learning, May 18-22, 2025 - Nice, France. ● VISUAL 2025 - 10th International Conference on Applications and Systems of Visual Paradigms, March 09-13, 2025 - Lisbon, Portugal Interessi di ricerca Main areas of scientific work and project initiatives: 1. Algorithm Engineering (path algorithms and other combinatorial problems) 2. Health IT 3. Information Systems (Transport and Logistics, Cultural Heritage) 4. Technology Enhanced Learning -------------- He (co)authored more than 100 scientific papers (h-index=27). The main publications can be found at: https://scholar.google.it/scholar?q=\"umberto+nanni\" https://www.ncbi.nlm.nih.gov/pubmed/?term=umberto+nanni MAIN PROJECTS ● 2023--2025: Scientific Lead (for Univ. “La Sapienza” - DIAG) of the project “Artificial Intelligence algorithms to track and detect Covid-19 vaccine-related infodemic on social media” (Prot. 2022REWNTE) - on the call “PRIN 2022 - RESEARCH PROJECTS OF RELEVANT NATIONAL INTEREST” - PI: Prof. Fidelia Cascini. ● 2021--2023: Scientific Lead (for Univ. “La Sapienza” - DIAG) of the project “ADCATER - Advanced Digital Solutions for Professional Food and Nutrition Catering Service” - on the call “ICT-AGRI-FOOD 2019 Joint Call”. The project (total budget 1.5 ME), coordinated by an Israeli industrial catering company and with the participation of Fraunhofer-Gesellschaft Institute, and The Hebrew University of Jerusalem, aims to use computer vision to estimate the actual food intake of bedridden patients. ● 2015-2017: Unit Coordinator of the European Project PRIDE - Profiling Relations In Drug trafficking in Europe - no. JUST/2014/JDRU/AG/DRUG/7074, DG HOME - Migration and Home Affairs. Project objective: \"Web-based system on drug-profiling and drug-tracking in real time\". ● 2016-2017: Coordinator for ICT Area - Ancient Law (ALIR). Information Retrieval and semantic indexing techniques for studying legal texts: sources, lexicons, contexts, written traditions. Multidisciplinary project at the University. ● 2014-2015: Coordinator for ICT Area - Archaic - Roman Law, Archeology & ICT: The Case of the Forum. Multidisciplinary project at the University. ● 2013-2014: Scientific Coordinator (for Univ. \"La Sapienza\") of a project on “Food Traceability” – an industrial innovation project funded by \"Sviluppo Lazio\" for the joint use of genetic markers and RFID technologies to ensure the traceability of agro-industrial products . ● 2013-2014: Scientific Coordinator (for Univ. \"La Sapienza\") of the SPRECware project - Labeling of human biological samples using the Standard PREanalytical Code. This industrial innovation project funded by \"Lazio Development\" is aimed at the realization of ICT tools and solutions developed to promote the adoption of the \"SPREC\" coding for the collection and exchange of samples between biological banks networks and research centers. More information at: http://www.sprecware.org ● 2011-2014 (39 months): Principal Investigator of the research project funded by EACEA Education, Audiovisual and Culture Executive Agency): eLF-eLearning Fitness, no. 511669-2010-LLP-KA3-KA3MP. The project, which will last three years, has a budget of 667 KEuro co-financed 75% by the Education, Audiovisual and Culture Executive Agency ( EACEA ) under the Lifelong Learning Programme - Call for Proposals 2010 Key Activity 3, Information and Communication Technologies. The ELF project, with 19 partners and 42 associated partners, has the following objectives: 1. the realization of an eLearning platform for fitness instructors based on EQF (European Qualification Framework) 2. the establishment of a National Registry of Certifications in 10 European countries. http://www.elearningfitness.eu ● 2012: Coordinator of a “technical table” on \"Information Technologies\" within an initiative for the Lazio Region, promoted by University \"La Sapienza\" of Rome to provide stakeholders with research, technological development and innovative ideas for the good governance of waste disposal for the protection of public health, the environment and cultural heritage. The results of this initiative are published in a monograph [NP13]. http://www.aracneeditrice.it/aracneweb/index.php/pubblicazione.html?item=9788854860018 ● 2011-2012: Member of two working groups of the Italian chapter of BBMRI - Biobanking and Biomolecular Resources Research Infrastructure, coordinated by the Istituto Superiore di Sanità. http://www.bbmri-eric.it ● 2010: Participation – Study for supporting the preparation of the impact assessment on “e-Maritime Initiative”, developed for the European Commission, Directorate - General Energy And Transport (Tenders No MARE/2010/05) ● 2006 -- 2010: Participation – FREIGHTWISE – Management Framework for Intelligent Intermodal Transport, EC contract no: TREN-06-FP6TR-S07-60148, DG Transport and Energy (TREN): the project aims at creating a support tool for integrated multimodal supply-chain planning and definition of European freight transport policies. https://cordis.europa.eu/project/rcn/85651_en.html ● 2008-2010: Participation – Project “Osservambiente”. The project, promoted by Nergal s.r.l., with a grant from Regione Campania, has the goal of developing an Environmental Monitoring System, which integrates territorial and urban elements in order to provide an innovative tool for the governance of the territory monitoring, planning of interventions and verification of results. ● 2008-: He cooperates with IRCCS “San Raffaele Pisana” of Rome in several projects efforts concerning interoperability and sustainable quality management in Biobanks. ● 2006-2009: A Portal for the Technological District of the Aerospace, funded by Filas (Finanziaria Lazio) ● 2004 -- 2008: Participation – SAFETYNET – Building the European Road Safety Observatory, EC contract no: TREN-04-FP6TR-S12.395465/506723, DG Transport and Energy (TREN): the objective of the project is to build the framework of a European Road Safety Observatory, which will be the primary focus for road safety data and knowledge. http://www.erso.eu/ ● 2006-2008: Coordinator of a Research Unit of the MIUR Project (PRIN-2005) entitled “Model for Multidisciplinary Collaborative Design in Architecture” on the specific topic “A Software Platform to support the Collaborative Architectural Design”. ● 2007: Member of the Technical Group that contributes to the “Regional Plan for Infomobility” for AREMOL, Department of Mobility, Regione Lazio. http://www.aremol.it/userfiles/file/P_R_Infomob.pdf ● 2006-2007: Participation – Logistics Outsourcing in an Industrial Districts, funded by ICE – Istituto Nazionale per il Commercio Estero (National Institute for Foreign Trade) ● 2006: Scientific Coordinator of a contract funded by IRPPS-CNR (Institute for Research on Population and Social Policies, of the National Research Council) as part of the “Scenario” Project. This project, funded by MIUR (Ministry of Instruction, University and Research) in the Special Fund for Applied Research, developed a system that provides tools for decision support in order to plan action on the ground and assess the cultural, social, economic, environmental impact and priorities. ● 2000-2003: ALCOM-FT (Algorithms and Complexity for Future Technologies), 5FP IST-FET Programme, no. IST-1999-14186. ● 1997-1999: ALCOM-IT  (Algorithms and Complexity - Information Technology), Esprit Long Term Research Project no. 20244. ● 1995-1998: Coordinator of a Research Unit in a Special Project funded by CNR (National Research Council) on “Mobility, security, allocation of resources in telecommunications networks”. ● 1995-1998: Coordinator of three contracts funded by National Agency ENEA (Ente Nazionale Energie e Ambiente), Centro Ricerche della Casaccia (Department ERG-SIRE - Integrated Systems for Energy Saving), on",
  "content_length": 12514,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:51"
}