{
  "name": "Umesh Bellur",
  "homepage": "https://www.cse.iitb.ac.in/~umesh",
  "status": "success",
  "content": "index.html Umesh Bellur Professor, Department of Computer Science Indian Institute of Technology Bombay email: umesh[DT]bellur[AT]iitb[DT]ac[DT]in (Replace the [AT] with @, yada yada) DBLP Google Scholar Citations Education Research Teaching Patents Grants Recognition Other Stuff Background B.E. in Electronics Engineering, Bangalore University, Bangalore, India, 1989 Ph.D. in Computer Engineering,  Syracuse University, Syracuse N.Y.,  1994 Thesis: Clustering Fine-grained Active objects on Distributed Systems. Advisor:  Dr.Doug Lea Research Interests I am interested in anything distributed - my current research interests revolve around virtualization and cloud computing where I am looking at problems in derivative clouds and serverless computing, VM provisioning, placement and migration.  I am also looking into auto provisioning for Spark applications and distributed learning mechanisms as it relates to IoT applications. I have started dabbling in performance modeling of Blockchain and adaptive consensus in large scale distributed applications. For those interested in working with me, please click here to learn what I expect from you! Awards MW4SOC 2010, Most Promising Research Paper Award SAP Research and Innovation Award for work in QoS based routing in Overlays 2008 IBM Faculty Award for work in Autonomic Computing 2006 Research Grants Informatica grant for research into Distributed Complex Event Processing, $10000, June 2012 IBM CAS grant for research into server consolidation in infrastructure clouds via interference aware VM placement, $20,000 with Profs. Puru Kulkarni and Varsha Apte, Feb 2010 Yahoo research labs grant for research into characterizing interference amongst VMs running different types of workloads in clouds. Rs 5 lakh with Prof. Puru Kulkarni, Dec 2009 Department of Science and Technology grant for setting up a lab in the area of Geo spatial Information Science and engineering, Co PI with Prof. N.L. Sarada, Rs 12 Cr, Sept 2009 Motorola Research grant for research into seamless mobility in service oriented environments., $14000 for 2006-2007, Sept 2006. Intel IT Research Council, Grant for research into Self healing and Performance Modeling of Enterprise Applications,  $24000 along with Prof. Varsha Apte of CSE, IITB, January 2006 Intel Corp, Linux Based Video Learning Solution for Distance Education, US $60,000 along with Prof. Deepak Phatak, January 2005 Department of Science and Technology, Govt. of India - Service Oriented Architectures for NRDMS Applications, Rs 15 Lakh, April 2005 Intel IT Research Council, Follow up grant for research into Autonomic Computing issues,  $24000 along with Prof. Varsha Apte of CSE, IITB, March 2005 L&T Infotech - Enterprise Integration Architectures with Service Orientation, Rs 12 Lakh, June 2004 Intel IT Research Council, Dynamic Determination of Topology for Distributed enterprise applications,  $12000 along with Prof. Varsha Apte of CSE, IITB, July 2004 IRCC at IIT Bombay - Autonomic Computing Infrastructure, Rs 2 Lakh, Seed Grant, July 2003 Courses Taught I teach courses on systems topics such as Distributed Systems (CS451), Distributed Event Based Systems (CS707), Advanced Distributed Computing â Engineering a Cloud (CS733) and Software lab (CS699). Professional Activities I usually serve on the PC of IC2E, ICPE, ICDCS, ICDCN and other distributed systems conferences. I was the associate editor for the IEEE TRansactions on Cloud Computing from 2011-2016. Invited Talks Keynote speaker at the Redhat Service Oriented Architectures summit, Mumbai, India, Dec 2008. Keynote Speaker at Economic Times Intelligence Group  Knowledge Forum  - Business Process Management event at Chennai and Mumbai,  India, July 2007 Keynote speaker at the CIO Club, Computer Society of India, Mumbai, India June 2007 Department Colloquim talk at Department of Computer Science, Ohio State University, Columbus, OH, USA,  May 28th 2007 Keynote Speaker at IDC Two City Knowledge Conference on Service Oriented Architectures, New Delhi and Mumbai, India, February 2007 Invited Speaker at SAIG conference of Siemens Research, Mumbai, India, Jan 2007 Keynote Speaker at ADCOM 2006, Suratkal, India, Dec 2006 Department Colloquim talk at Marquette University, Dept of MSCS,  Milwaukee, WI, USA, Sept 2006 L&T Infotech Presentation on JavaSpaces, Mumbai, India,  June 2005 Stochastic Methods in Autonomic Computing, Talk at IBM IRL, New Delhi  May 2005 SAP Innovation Congress,   Autonomic Computing - problems and approach. Florida, USA,  March 2004, Seminar on Oss for Broadband Networks and Services.  WIPRO, Bangalore, India  Oct 2003. Hewlett Packard Labs, , Lights out Management of Distributed Applications, Palo Alto, CA, USA, June 2003 Fourth IITB-Persistent Workshop on Data Management, Security Technologies underlying Databases, 2003, IITB, India - Seminar on Security in eBusiness Environments Marcus Evans Telecom CIO Summit, Lake Geneva, May 2001. Panel chair for OSS at new generation networks at OSS Summit,  Miami, Feb 2001. Enterprise Application Integration at Next Generation OSS, Denver, Sept 2000 Workshop on Compositional Software Architectures, 1998, Monterey, CA - The Role of Components & Standards in Software Reuse. Patents Granted 1 7,337,184 Topology mapping of a multitier compute infrastructure 2 7,281,046 Application program interface for automating high speed network access ordering and provisioning processes 3 7,243,306 Service descriptor for a multitier compute infrastructure 4 7,210,143 Deployment of applications in a multitier compute infrastructure 5 6,463,079 Processing orders for high bandwidth connections",
  "content_length": 5651,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:51"
}