{
  "name": "Unaizah Hanum Binti Obaidellah",
  "homepage": "https://umexpert.um.edu.my/unaizah",
  "status": "success",
  "content": "UMEXPERT - DR. UNAIZAH HANUM BINTI OBAIDELLAH DR. UNAIZAH HANUM BINTI OBAIDELLAH Department of Artificial Intelligence Faculty of Computer Science and Information Technology unaizahum.edu.my View CV View 1-Page CV Publons Scopus Link Collaborator azahnorman norhafizan zuraidahab nahrizuladib amir azli erma myaz rjry angtf farah fidah lohsch nazean sameem yamani norisma View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status Emotion Recognition of Learners? during Online Learning Assessments end Empowering Quran Lessons Among The Special Needs Children end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Chapter in book Proceeding 2025 Pigment network detection and classification in dermoscopic images using directional imaging algorithms and convolutional neural networks 2024 Integrating color histogram analysis and convolutional neural networks for skin lesion classification 2024 Bluish veil detection and lesion classification using custom deep learnable layers with explainable artificial intelligence (XAI) 2024 Exploring Malaysian schoolchildren's perception of the advantages and disadvantages of the ToothPoly board game: a qualitative study 2021 Challenges and Issues in Augmented Reality with Community and Education 2019 Gamifying the Computer Programming Course: An approach to Enhance Problem Solving and Programming Skills among Undergraduate Computer Science Student 2018 Chapter 3 : Group-based Assessment 2022 Web-Based Dental Game for Primary Schoolchildren 2022 Development Of Web-Based Dental Snake And Ladder Game As A Supplementary Tool In Oral Health Education 2021 Development of Oral Health Education Board Game for Primary Schoolchildren. 2019 Classification of Strategies for Solving Programming Problems using AoI Sequence Analysis",
  "content_length": 2086,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:53"
}