{
  "name": "Unnikrishnan Cheramangalath",
  "homepage": "https://unnikrishnan-c.github.io",
  "status": "success",
  "content": "Unnikrishnan Cheramangalath, Dept of CSE, IIT Palakkad Unnikrishnan Cheramangalath Assistant ProfessorComputer Science and EngineeringIndian Institute of Technology Palakkad Kerala - 678623 Research | Teaching | Recent Publications | Students | Alumni | Services Research Compilers and Programming Languages High Performance Computing Reconfigurable Computing Machine Learning: GNN, Knowledge Graph etc. Teaching:Core Courses Compiler Design (CS3040): Jan 2020, Jan 2023,Jan 2024, Jan 2025 Compiler Design Laboraroty (CS3140): Jan 2020, Jan 2021, Jan 2023, Jan 2024, Jan 2025 Systems Programming (CS 2013): Aug 2024 Introduction to Programming (CS1020): Jan 2022 Data Structures and Algorithms (CS2030): Aug 2020, Aug 2022 Data Structures and Algorithms Laboratory (CS2130): Aug 2020, Aug 2022 Paradigms of Programming Laboratory (CS3130) : Aug 2019, Aug 2022, Aug 2023. Teaching:Elective Courses Parallel Programming (CS5005): Aug 2020,Jan 2022, Aug 2023, Aug 2024. Real Time Systems (CS5618): Jan 2021 Compiler Optimization (CS5510): Aug 2019, Aug 2021, Jan 2024. GPU Programming (CS5658): Aug 2025 Students PhD: Kevin Jude Concessao, Rajesh R, Nandakumar Edamana Recent Publications [C] Heterogeneous Continuous-Time Dynamic Graph Representation Learning using Neighbor-store with Restart. N Debnath, U Cheramangalath.IJCNN 2025 Preprint. [J] Meerkat: A Framework for Dynamic Graph Analytics on GPUs. K J Concessao, U Cheramangalath, R M J Dev , R Nasre. IJPP,2024. Artifact [C] STGraph: A Framework for Temporal Graph Neural Networks, N P Manoj, J Cherian, K J Concessao, U Cheramangalath. GrAPL@IPDPS 2024. Artifact [C] Optimizing Machine Learning Operators and Models for Specific Hardware Using Apache-TVM. Kausthub T M, Abhinav Durgar, N. Patil, U. Cheramangalath. ICCNT 2023. [C] Memory Leak Detection using Heap Object Flow Graph, H. Madhav, U. Cheramangalath, ISEC2023 [C] Custom Code generation for a Graph DSL, B.Gogoi, U.Cheramangalath, and R.Nasre GPGPU@PPoPP 2020 [J] CIMA: Compiler-Enforced Resilience Against Memory Safety Attacks in Cyber-Physical Systems. E. G. Chekole, S. Chattopadhyay, M.Ochoa, H.Guo, and U. Cheramangalath. Computers & Security, Vol.94, July 2020. [Book] Distributed Graph Analytics: Programming, Languages and Their Compilation June,2020. ISBN 978-3-030-41885-4 Alumni MS: Haritha Madhav C ( AMD Compiler team, Bangalore), Nilanjana Debnath( Aviso AI, Hyderabad) M.Tech (Selected List): Ravi Kumar Choudary (Pursing PhD at IIT Bombay). B.Tech (Selected List): NIT Calicut: Vishal Chebrolu(Nvidia Compiler Team), Joel Mathew Cherian (Pursuing MS CSE at GeorgiaTech, USA), Nithin P Manoj ( Pursuing M.Tech AI, at IISc, Bangalore). B.Tech (Selected List): NIT Suratkal: Kausthub Thekke Madathil(Mathworks), Abhinav Dugar (Oracle) Services PC Member: PPoPP 2025, HiPC (2021, 2022,2024), PPoPP 2023 AE, ISEC (2024,2025), EduHiPC (2021,2022,2023,2024). Organizing Committe: LLVM Performance Workshop @CGO 2021, SERI2024 . Program Co-chair SERI 2025 . Teaching at: HPC Shiksha, NSM HPC Workshop. Tutorial at: ACM Summer school on Programming Languages.",
  "content_length": 3087,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:51"
}