{
  "name": "Uri J. Wilensky",
  "homepage": "https://ccl.northwestern.edu/Uri.shtml",
  "status": "success",
  "content": "Uri Wilensky Projects Publications NetLogo NetLogo home Resources Media Mentions Press Educational Resources People Jobs The Center for Connected Learning and Computer-Based Modeling Uri Wilensky - CCL Director Uri Wilensky is the Lorraine H. Morton professor of Learning Sciences, Computer Science and Complex Systems at Northwestern University. He is the co-director of the joint PHD program in Computer Science and Learning Sciences (CSLS) . He is the author of the award-winning NetLogo agent-based modeling software, which his lab actively maintains and improves. It is the most widely used agent-based modeling software, and has hundreds of thousands of users worldwide using it for both research and education. Wilensky has published more than 300 scientific articles and more than 500 agent-based models. Wilensky is a fellow of the National Academy of Education and the American Academy of Arts and Sciences. He is the founder and current director of the Center for Connected Learning and Computer-Based Modeling(CCL) and a co-founder of the Northwestern Institute on Complex Systems(NICO). He is also a faculty member (by courtesy) in Cognitive Science, Philosophy, the program in Technology and Social Behavior, and the Segal Design Center research council. Wilensky has received numerous awards, including the 2025 Yidan Prize for educational research, the NSF career award, and the 2016 ISDDE prize for excellence in design for his work on NetLogo. Quick navigation Bio, Textbook, Current Research, Previous & Ongoing Research, Courses, Colleagues & Students, Contact Info, Personal Stuff Textbook Wilensky, U., & Rand, W. (2015). An introduction to agent-based modeling: Modeling natural, social and engineered complex systems with NetLogo. Cambridge, MA: MIT Press. Current Main Endeavors Research Overview CCL Papers & Publications Current Active Projects: NetLogo modeling tool. NIH NIDA. Center for Prevention Implementation Methodology for Drug Abuse and HIV NSF-Funded Research Projects: NSF STEM+C.A Whole-School Model for Integrating Computational Thinking in High School Science and Mathematics. NSF ITEST. Group-Based Cloud Computing for STEM Education. NSF EAGER: MAKER: A Cultural Framework for Equity in Maker Practices NSF STEM+C. CT-ifying the high school science curriculum to broaden participation in computational science NSF STEM+C. Engaging students in building theories of scientific phenomena: A comparison of aggregate pattern-based and agent-based approaches Previously Funded Research: Lyle-Spencer Foundation Award. Broadening Participation in a Computational Future: Casting a Wide Net. NSF CyberLearning: LevelSpace: Modeling in Levels NSF EAGER: A low-cost integrated agent-based modeling and physical NSF-CNS-#1138461: CT-STEM: Casting a Wide Net: Embedded Computational Thinking NSF-DRL-#1109834: BEAGLE: Simulated Evolution Participatory Simulations: Network-Based Design for Systems Learning in Classrooms NSF-CISE: Computational Thinking in STEM NSF CyberLearning: InquirySpace: Technologies in Support of Student Experimentation NSF-DRL: Emerging Research-Empirical--Simulated Evolution: Developing a Framework for Computer-Based Modeling and Simulation Activities in the Classroom NSF-CE21: Casting a Wide Net: Computational Thinking ABMPLUS: Enabling Modeling and Simulation-Based Science in the Classroom NSF-DRK12: Enabling Modeling and Simulation-based Seience in the classroom: Integrating agent-based models, real world sensing and collaborative networks NSF-REC-#0003285: Connected Mathematics: Making Sense of Complex Phenomena through Building Object-Based Parallel Models NSF-DRL-#1020101: ABMPLUS: Enabling Modeling and Simulation-Based Science in the Classroom NSF-DRL-#1020101: InquirySpace: Integrating Agent-Based Models with Statistical Analyses NSF-DRL-#1109834: Learning Evolution through Model-Based Inquiry BEAGLE: Simulated Evolution CT-STEM: Casting a Wide Net: Embedded Computational Thinking InquirySpace: Integrating Agent-Based Models with Statistical Analyses Integrated Simulation and Modeling Environment Learning Evolution through Model-Based Inquiry Modeling Across the Curriculum NAE/Spencer Project -- Developing Reasoning About Parallel Processes StarLogoT modeling tool NSF Curricular Projects ProbLab: Simulation-based curriculum on Probability & Statistics The GasLab Project: Simulation-based curriculum on kinetic theory of gases ConnectedChemistry: Simulation-based curriculum on introductory Chemistry The EACH Project: Understanding the evolution of cooperation Mind the Gap: An agent-based participatory simulation (ABPS) curricular unit on wealth inequality GenEvo: A computational systems biology curriculum for high school students to engage with cutting-edge ideas in modern biology Courses Currently Being Taught Constructionist Learning The design of Technological tools for thinking and learning: A Constructionist Approach Designing and Constructing Models with Multi-Agent Languages Images from class poster session Past Courses Complexity Science Turtle Geometry Practicum in Learning Environment Design Advanced Technology Design Technological Tools for Thinking and Learning Mathematics Learning Environments Mathematics & Science Learning Environments Mathematics Practices Intellectual Development Learning through Computer-Based Projects Structure and Interpretation of Computer Programs Colleagues & Students Seymour Papert Tribute Panel Colleagues Students Personal Stuff Passions Photos By date Adventures Daniel Ethan Contact Info Email: uri@northwestern.edu Phone: 847-467-3818 Fax: 847-491-8999 Offices: Annenberg Hall 337 CCL Lab Phone: 847-467-7593 Mailing Address/Map: Uri Wilensky 2120 Campus Drive Evanston, IL, 60208 The Center for Connected Learning and Computer-Based Modeling Annenberg Hall Rm 225, 2120 Campus Drive, Evanston IL, 60208 Phone: 847-467-7593 | Fax: 847-491-8999| Email: ccl-website@ccl.northwestern.edu Affiliated with: Learning Sciences Department, Computer Science Department, and The Northwestern Institute on Complex Systems",
  "content_length": 6066,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:53"
}