{
  "name": "Ursula Martin",
  "homepage": "https://www.cs.ox.ac.uk/people/ursula.martin",
  "status": "success",
  "content": "Ursula Martin | Mathematical Institute Skip to main content Prof. Ursula Martin CBE FREng FRSE DSc Status Emeritus Contact form https://people.maths.ox.ac.uk/martinu ORCID iD https://orcid.org/0000-0002-1908-5927 Research groups History of Mathematics Address Mathematical Institute University of Oxford Andrew Wiles Building Radcliffe Observatory Quarter Woodstock Road Oxford OX2 6GG Highlighted books Ada Lovelace: The Making of a Computer Scientist Hollings, C Martin, U Rice, A (2018) Recent publications The ACM-W Chairs Rendering History: The Women of ACM-W 91-136 (08 Apr 2024) Enabling mathematical cultures: introduction Löwe, B Martin, U Pease, A Synthese volume 198 issue Suppl 26 6225-6231 (21 Nov 2021) Using crowdsourced mathematics to understand mathematical practice Pease, A Martin, U Tanswell, F Aberdein, A ZDM – Mathematics Education volume 52 issue 6 1087-1098 (18 Nov 2020) Further details Professor Dame Ursula Martin is an Emeritus Professor in Oxford Mathematics (2018 - ) and a Fellow of Wadham College Oxford.  She is also a Professor Emerita at the University of Edinburgh (2022 - ), and a Distinguished Honorary Fellow of the Department of Computer Science and Technology at the University of Cambridge (2023 - ).She is a Dame Commander of the Order of the British Empire,  a Fellow of the Royal Academy of Engineering,  a Fellow of the  Royal Society of Edinburgh,  and a Fellow of the Institute of Mathematics and its Applications.  She is a Doctor of Science Honoris Causa of the University of London,  and an Honorary Fellow of Royal Holloway University of London. She holds a PhD and MSc from the University of Warwick,  and an MA and BA from the University of Cambridge.  Before joining Oxford,  she was Professor of Computer Science at Queen Mary University of London (2003 - 2013), where she was Vice-Principal for Science and Engineering (2005 - 2009),  and Director of the impactQM project (2009 - 2012),  an innovative knowledge transfer initiative.   Earlier in her career she held appointments at St Andrews, Manchester and Urbana-Champaign.  Numerous policy roles have included the UK Defence Science Advisory Council;  the 2001 and 2008  UK HEFCE Research Assessment Exercise Panels for Computer Science;   UKRI's Interdisciplinary Advisory Panel for the 2021 Research Excellence Framework;   the 2017 UKRI Bond Review of Mathematics Knowledge Transfer (which heavily cited her own research on impact); and service on committees of the Royal Academy of Engineering and other UK and international public bodies and professional organisations.For more details please see her personal website.Contact email Ursula.Martin_AT_ maths.ox.ac.ukThe extraordinary walker and author Ursula Martin is  different person. Highlighted publications Explanation in mathematical conversations: an empirical investigation Pease, A Aberdein, A Martin, U Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences volume 377 issue 2140 (21 Jan 2019) The Lovelace--De Morgan mathematical correspondence: A critical re-appraisal Hollings, C Martin, U Rice, A Historia Mathematica volume 44 issue 3 202-231 (09 May 2017) Slightly dirty maths: the richly textured mechanisms of impact Meagher, L Martin, U Research Evaluation volume 26 issue 1 15-27 (18 Jan 2017) A general framework for sound and complete Floyd-Hoare logics Arthan, R Martin, U Mathiesen, E Oliva, P ACM Transactions on Computational Logic volume 11 issue 1 1-31 (06 Oct 2009) The automorphism group of a finite p-group is almost always a p-group Helleloid, G Martin, U Journal of Algebra volume 312 issue 1 294-329 (Jun 2007) Research interests Her research,  initially in algebra,  logic and the use of computers to create mathematical proofs,  broadened to encompass wider social and cultural approaches to understanding the circulation and impact of foundational research in computer science and mathematics.  With international partners ranging from defence companies to computer museums, her unique collaborative research portfolio spans mathematics, computer science, and the humanities, with wide-ranging academic, practical, and cultural impact. She is particularly known for leading the first scholarly investigation of the mathematics of Ada Lovelace.Throughout her career she has been involved in many activities for women in science,  including establishing the pioneering Women@CL project at the University of Cambridge; serving on the UK Royal Society's Diversity Committee; and chairing ACM-W, the Committee on Women of the ACM.  Her research has been supported by UK and European funding agencies, and companies including Intel, Qinetiq and Microsoft.  She held a UKRI/EPSRC Established Career Fellowship (2014 - 2023), and currently holds an Emeritus Fellowship from the Leverhulme Trust (2024 - 2026).For more details please see her personal  website. sfy39587stp18",
  "content_length": 4912,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:58"
}