{
  "name": "Usman Naseem",
  "homepage": "http://usmaann.github.io",
  "status": "success",
  "content": "Biography - Usman Naseem Usman NaseemLecturer (~Asst. Prof.) Macquarie University, Australia Follow Sydney, Australia Email LinkedIn Github Google Scholar ORCID ${\\color{red}{Looking\\ for\\ motivated \\ MS\\ (Research)\\ and\\ PhD\\ students. \\ Get\\ in\\ touch\\ if \\ you \\ are\\ intrested\\ !}}$ see details here$\\color{blue}{Visiting\\ and\\ Honours\\ students\\ in\\ the\\ areas\\ of NLP\\,and\\ AI\\ for\\ Social\\ Good\\ are\\ also\\ welcomed}$I am currently a lecturer (~Assistant Professor) in the School of Computing at Macquarie University. Previously, I held a lecturer position in the College of CSE at James Cook University and worked as a research fellow at the University of Sydney and the University of South Australia. I earned my PhD from the University of Sydney, Australia. Before transitioning to academia, I worked in the industry for over 10 years in various technical and leadership roles.My research in Natural Language Processing (NLP) is structured around three interconnected themes: (i) Trust and Safety, (ii) LLM Alignment, and (iii) NLP for Social Good. A central focus of my current work is LLM Alignment with Human Preferences, Values, Cultures, and Safety, exploring how large language models can reason more reliably, reflect diverse worldviews, and operate responsibly in real-world contexts. This involves developing frameworks for value-sensitive, safety-aware, pluralistic, and culturally aligned modeling, ensuring that systems behave in ways that are ethical, contextually appropriate, and aligned with human intentions. I lead the NLP for Social Good Lab - SocialNLP, where we develop safe, aligned, and socially impactful language technologies with real-world applications. I actively publish and contribute to the academic community by serving on program committees, including as Program Co-Chair (WebConf 2026 Web4Good), Senior Area Chair (EMNLP 2025, EACL 2026), and Area Chair for ACL, EMNLP, AAAI, and ACM MM, as well as reviewing for top journals and funding agencies. I am honored to be the recipient of several national and international awards and fellowships, including 5 Best Paper Awards and the DAAD AINet fellowship (2023–2024). My work has been adopted by industry and covered in Australian media. Research Grants/FundingsResearch Grant: JCU Sandpit2seed funding to develop new tools using LLMResearch Grant: Awarded OpenAI’s Researcher Access Program.Research Grant: MQU Data Horizons Research Support Grant focused on LLM safety in online trust and safety.Research Grant: Macquarie University Research Acceleration Scheme (MQRAS) grant focused on LLM safety and health misinformation.DIN PhD Scholarship: Defense Innovation Network (DIN) fully-funded PhD scholarship for Australian citizens, focused on AI-generated misinformation (Hiring Australian citizen).Research Grant: ASCA (Department of Defence) ~ $3MResearch Grant: SafeOnline Initiative ~ $238,289 Honours and AwardsAndrew P. Sage Best Transactions paper 2022 award by IEEE SMC SocietyNBMLHD Board Chair’s Quality Award in Research and Innovation 2021, “Understanding Patients’ Sentiments in remote care settings”, Nepean Blue Mountains Local Health District (NBMLHD), Sydney, NSW, Australia.Scholarships, RTPS (2018-2023), USYD suppl. (2021 & 2022)Google Research: Selected for participation in graduate symposium hosted by Google Research India, 2021.SIGIR 2022 and EMNLP 2022: Student Volunteer AwardRising Star in AI, KAUST AI InitiativeDAAD AINet Fellowship 2023Top 2% Global Scientists 2023 published by StanfordBest Paper Award at EMNLP 2023 BLP workshopWSDM 2024: Travel Award (includes registration and travel)AJCAI 2024 Best Student paper awardDAAD Fellowship (Research Stay in Germany) 2023 - 2024Secured funding for a joint PhD student with the University of GroningenWon Best Paper and presentation Award at CASE RANLP 2025Recent NewsNov-2025: 2 papers (1 Main and 1 Demo) have been accepted at AAAi 2026. Congratulations to everyone!Nov-2025: Received the Outstanding Senior Area Chair Award at EMNLP 2025!Oct-2025: “We will be presenting two papers at ALTA 2025 and will be delivering a tutorial on LLM Alignment. See details hereOct-2025: Received FSE Travel Grant and listed in Top 2% research scientist listSep-2025: Congrats to Afrozah for winning the Best Paper and Best Presentation Awards at CASE @ RANLP 2025 for work on mitigating political stance bias in LLMs, advancing our mission to align AI with human values.Aug-2025: 10 papers (3 Main, 4 Findings, 2 Industry Track, 1 Workshop) have been accepted at EMNLP 2025. Congratulations to everyone!Aug-2025: I will be delivering two tutorials this year on AI Alignment with Human Values and Preferences—at ALTA 2025 and AJCAI 2025July-2025: I am serving as the PC Co-chair of The Web Conference (Web4Good Track), 2026.Jul-2025: Our proposal for the SemEval-2026 Shared Task on Detecting Multilingual, Multicultural, and Multievent Online Polarization has been accepted! See details here: SemEval2026May-2025: 3 papers have been accepted at ACL (Main) 2025. Congratulations to everyone!April-2025: 4 papers have been accepted at IJCAI 2025. Congratulations to everyone!April-2025: A paper is accepted at ICWSM 2025.April-2025: Awarded DAIRNET EMCR Research Collaboration GrantApril-2025: A paper is accepted at ICWSM 2025.March-2025: A paper is accepted at SIGIR 2025.Feburary-2025: Hiring multiple exceptional PhD students. Apply now! see details hereJanuary-2025: 5 papers have been accepted at WebConf, 2 in AAAi and 1 in NAACL. Congratulations to everyone!December-2024: 2 papers are accepted at COLING 2025November-2024: We won the “Best Student Paper” award at AJCAI 2024November-2024: Our workshop (MM4SG) has been accepted at The WebConf and ACL 2025November-2024: 1 paper is accepted at ATLA (Australasian Language Technology Association) 2024September-2024: One paper is accepted at EMNLP 2024 (Main)September-2024: Selected as one of World’s Top 2% Scientists 2024 in Standford and Elsevier’s reportAugust-2024: Awarded DAAD Research Stay FellowshipJuly-2024: 3 papers accepted at ACM MM 2024 (CORE A*)July-2024: 1 paper accepted at CIKM 2024June-2024: Invited to serve as an AC @ COLING 2025June-2024: Received multiple research fundings including a fully-funded PhD scholarship.May-2024: Invited Research talks: NTU, A*Star (Singapore), ISI Foundation (Italy), MBZUAI (UAE)April-2024: My application to OpenAI’s API Researcher Access Program has been accepted.April-2024: We have a total of 4 papers in LREC-COLING (1x main confernece and 3x workshops). Congrats to all authors!April-2024: In addition to organising a workshop at Webconf (WWW), we have a total of 5 papers in Webconf (2x main confernece and 3x workshops). Congrats to all authors!March-2024 3 more papers (workshop) accepted at Webconf 2024.March-2024 1 paper accepted at LREC-COLING.Feburary-2024 2 papers accepted at Webconf (1x Main track and 1xWeb4Good track).Feburary-2024 Joined Macquarie University as a lecturer (~Assistant Prof). Please visit my Google Scholar page for a detailed list of my publications, including citations count.ContactFeel free to contact me at usman.naseem@mq.edu.au if you are interested in working with me or have any questions.Want to schedule a meeting? Click here to schedule a 30 Minute Meeting Tweets by UsmanNaseem87",
  "content_length": 7301,
  "method": "requests",
  "crawl_time": "2025-12-01 14:41:56"
}