{
  "name": "Ute Schmid",
  "homepage": "https://www.uni-bamberg.de/en/cogsys/schmid",
  "status": "success",
  "content": "Schmid, Ute - Cognitive Systems Prof. Dr. Ute Schmid Prof. Dr. Ute Schmid Head of Cognitive Systems GroupLehrstuhl für Kognitive SystemeExecutive Director of the Bamberg Center of Artificial Intelligence (BaCAI)Geschäftsführende Direktorin des Bamberger Zentrums für Künstliche Intelligenz (BaCAI)Office: WE5/05.043Office hours: by appointmentPhone: +49-951-863 2860Email: ute.schmid(at)uni-bamberg.deUte Schmid is head of the chair for Cognitive Systems at University of Bamberg and executive director of the Bamberg Center for Artificial Intelligence. She holds diplomas (master of science) in psychology and a diploma in computer science, both from Technical University Berlin (TUB), Germany. She received her doctoral degree (Dr. rer.nat.) in computer science from TUB in 1994 and her habilitation in computer science in 2002. From 1994 to 2001 she was assistant professor (wissenschaftliche Assistentin) at the Methods of AI/Machine Learning group, Department of Computer Science, TUB, and spent a year as post-doc at Carnegie Mellon University. Afterwards she worked as lecturer (akademische Rätin) for Intelligent Systems at the Department of Mathematics and Computer Science at University Osnabrück and was member of the Cognitive Science Institute. In 2004 she became professor of Applied Computer Science/Cognitive Systems at the University of Bamberg and is full professor since 2022. Ute Schmid  has been head of the Fraunhofer IIS project group Comprehensible AI (CAI) 2020-2025. Since 2020 she is member of the board of directors of the Bavarian Research Institute of Digital Transformation (bidt). Ute Schmid is also a member of the Bavarian AI Council (Bayerischer KI-Rat) and  fortiss research fellow. In 2022 Ute Schmid was elected as EurAI fellow, in 2023 as GI fellow, and since 2025 she is an elected member of acatech , the National Academy of Science and Engineering. Ute Schmid is co-speaker of working group 1 `Technologies and Data Science ‘ of Germany’s Platform for Artificial Intelligence, and chair of the task force AI in Education of the German Computer Science Society (GI). She is member of various scientific  advisory boards, among them KI Campus and AI Grid, Ute Schmid dedicates a significant amount of her time to measures supporting women in computer science and to promote computer science as a topic in elementary, primary, and secondary education. She won the Minerva Gender Equality Award of Informatics Europe 2018 for her university and the Award for outstanding equality and diversity work of the Faculty Association for Computer Science (FTI) in 2024.Since many years, Ute Schmid is engaged in educating the public about artificial intelligence in general and machine learning and she gives workshops for teachers as well as high-school students about AI and machine learning (see Talks). For her outreach activities she has been awarded with the Rainer-Markgraf-Preis 2020.[Short CV German][linkedin] Research Publications Activities Teaching Talks Research interests of Ute Schmid are mainly in the domain of comprehensible machine learning, explainable AI, and high-level learning on relational data, especially inductive programming. Research topics are generation of visual, verbal and example-based explanations, intelligent tutor systems, interactive (human-in-the-loop) learning, combining deep learning and symbolic learning (neuro-symbolic AI), knowledge level learning from planning, learning structural prototypes, analogical problem solving and learning. Main application domains are image based diagnostics in medicine and industrial quality control as well as education. A further area of research is cognitive science with a focus on empirical and experimental work on high-level cognitive processes. Ute Schmid is a pioneer of Computer Science for Primary School (FELI) and is engaged in the domain of AI education.Research Page of the CogSys GroupWebpage of the Fraunhofer IIS project group Comprehensible AI Orcidsee DBLP, Scholar, Semantic Scholar or the research information system of University of Bamberg FISyou can also find me at research gate and ACM DLuntil 2020: publication list generate by univis,My Erdös Number is 4Printable list by category [PDF]Selected talks Selected ActivitiesFor media coverage and other miscellaneous information see NewsFor outreach talks about AI and machine learning see TalksMember of the Bavarian AI Council (Bayerischer KI-Rat)Board member of the Bavarian Institute of Digital Transformation (bidt)Head of the Fraunhofer IIS project group Comprehensible Artificial Intelligence (CAI), 2020-2025fortiss research fellow with special topic inductive programming and code generation (see Robust AI project)Contact person for the AK KI in Schules (KiS) of the GI FBKI, see also AI & Education pageHead of working group 1 -- Technologies and Data Science -- of  Plattform Lernende Systeme (since 2022)Member of \"Zentrum für vertrauenswürdige KI\" (ZVKI)Member of the Executive Committee of AI GridMember of the advisory board of KI CampusMember of the taskforce “KI in der Hochschullehre”, Allianz für Future Skills, StifterverbandGörz, Braun, Schmid, 2021, Handbuch für Künstliche Intelligenz, 6. AuflageOrganizer of the 1st \"Workshop KI und Bildung zusammen mit dem Praxistag KI an Schulen\", Universität Bamberg, 31.10.2024Organizer of the seminar series Approaches and Applications of Inductive Programming (AAIP)AAIP 2025 as Dagstuhl Seminar 25491AAIP @ IJCLR 2023AAIP 2023 as Dagstuhl Seminar 23442AAIP @ IJCLR 2022AAIP @ IJCLR 2021AAIP 2021 as Dagstuhl Seminar 21192AAIP 2019 as Dagstuhl Seminar 19202AAIP 2017 as Dagstuhl Seminar 17382AAIP 2015 as Dagstuhl Seminar 15442AAIP 2013 as Dagstuhl Seminar 13502AAIP 2011 at LOPSTR in Odense, DenmarkAAIP 2009 at ICFP in Edinburgh, ScotlandAAIP 2007 at ECML in Warsaw, PolandAAIP 2005 at ICML in Bonn, GermanySteering Committee member of the International Joint Conference on Learning and Reasoning (IJCLR)4th IJCLR, Sep. 19-22 2024, Nanjing, China,3rd IJCLR, Nov. 13th-15th 2023, Bari, Italy2nd IJCLR, Sept. 28-30 2022, Cumberland Lodge, England1st IJCLR (originally planned for Sept. 2020 in Athens, realized Oct. 25-27, 2021 as virtual event)and guest editor for Machine Learning Journal, Special Issues on Learning and Reasoning (since 2021)Workshop and Tutorial Chair at KI 2024Co-organizer of AI4AI in Education Workshops at ECAI 2023 and KI 2024Special Issue on Explainable and Interpretable Machine Learning and Data Mining(87.5 KB) in Data Mining and Knowledge Discovery (2021,2022)Explainable AI in Medicine (expert statement für SMC 8/2021)Chair of KI 2020, University of Bamberg [Proceedings]Co-Organiser of the XI-ML Workshop at KI 2020Chair of KogWis 2012, University of Bamberg [Proceedings]Organizer of the First European Workshop on Cognitive Modeling (1996), now International Conference on Cognitive Modeling (ICCM)Member of the EU TAILOR networkBoard member of EPSRC funded Human-Like Computing Network+Dean of the Faculty (Oct 2017-Sept 2019)Elected women's representative of the Dept. of Information Systems and Applied Computer Science, Bamberg University (since January 2005, during time as dean vice representative) -- winner of the Minvera Award of Informatics Europe 2018 and the Fakultätentag Informatik (FTI) award for outstanding equality and diversity work 2024, [Interview for the university's equal opportunity office 2024]Head of the Elementary Computer Science Research Group (Computer Science for Kids, FELI), since 2015, see also Teaching AI to Kids and Non-experts (AI and Education)Initiation, organization and execution of annual Girls and Computer workshops (MuT), Organizer of GirlsDayInitiation, organization and execution of the childern and high-school students program of the faculty: WIAI-Nachwuchs (since 2008)Former speaker of the SIG Cognition of the Artificial Intelligence Section (FBKI, in German: GI-Fachbereich Künstliche Intelligenz) within the German Informatics Society (GI)Former board member of the German Cognitive Science SocietyFormer member of the editorial board of Künstliche Intelligenz, now member of the advisory boardUte Schmid has teaching experience in artificial intelligence, algorithms and programming languages, human-computer interaction, cognitive science, and cognitive psychology. Since 2004 she holds lectures in artificial intelligence, machine learning and cognitive modeling. She offers a special course \"Kognitive Informatik\" for students of psychology, as well as a seminar on gender aspects in computer science. In seminar courses and projects she covers topics of inductive programming, human-level learning, and explainable AI.Current TeachingAdvised ThesesTeaching at Uni Osnabrück (until 2004)Teaching at TUB (until 2001)Advised Theses at Uni OsnabrückAdvised Theses at TUB Selected Talks - Ute Schmid You find a mix of invited talks at scienctific conferences, outreach talks about AI and Machine Learning as well as about AI and School. For talks about Computer Science for Primary School check the FELI website. Talks about AI and Education can be found at the KI und Schule website. For talks about Women@CS check the website of the women's representative.If you are interested in slides for specific talks, please contact me by e-mail.Keynote, 18th International Conference on the Simulation of Adaptive Behavior (SAB), Berlin, 19-22 Oct 2026Wie lernt der Mensch? Herausforderungen und Perspektiven im digitalen Zeitalter, gemeinsame Veranstaltung der evangelischen Stadtakademie München und acatech, München, 7.7.2026Keynote Human AI Alignment in Joint Decision Making and Problem Solving, Women in Data Science Conference (WIDS 2026), Regensburg, 18.6.2026Künstliche Intelligenz in der Medizinischen Versorgung, medatixx Tagung KI-Einsatz im Versorgungsalltag, 13.5.2026Keynote Requirements for Human AI Alignment in Joint Decision Making and Problem Solving, Co-Creating with Generative AI: Visions for a New Enlightenment, Interdisciplinary Symposi",
  "content_length": 45326,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:02"
}