{
  "name": "Utpal Chandra De",
  "homepage": "https://ksca.kiit.ac.in/profiles/utpal-chandra-de",
  "status": "success",
  "content": "Utpal Chandra De – School of Computer Applications Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Utpal Chandra De Utpal Chandra De Utpal Chandra De Assistant ProfessorMr. Utpal Chandra De is an M.Tech. in Comp. Sc. & Engg. Persuing his Ph. D. in Comp. Sc. & Engg. from KIIT University. He has more than 15 years of experience in teaching at UG and PG level. He joined KIIT University in June 2009. He has various publications to his credit in leading journals and conferences indexed in Scopus. Profile LinksEmail :[email protected]Google Scholar :https://scholar.google.com/citations?hl=en&user=7rMPNtUAAAAJ Social LinksProfileRecent PublicationsProfileEducational QualificationM. Tech. (CSE), Ph.D. (Continuing)Administrative ResponsibilityAsst. Superintendent, KP-4 (Boys Hostel) Recent PublicationsJournals/Conferences :1.\tDe, Utpal, M.N, Das, and Debashis, Mishra. \"\"Threshold based brain tumor image segmentation\"\".International Journal of Engineering & Technology 7 (2018): 1801. 2. Debashis Mishra, Isita Bose, Utpal Chandra De and Bishwojyoti Pradhan, “PSO Based Thresholding for Medical Images\"\", Eighth International Conference on Data Mining and Warehousing (ICDMW-2014), Published by Elsevier., India 3.\tDebashis Mishra, Isita Bose, U.C. De and M.N. Das, Medical Image Thresholding Using Particle Swarm Optimization\"\", ICCD-14, Advances in Intelligent System and Computing, Springer, 2015. 4.\tDebashis Mishra, Isita Bose, U.C. De and B. Pradhan, A Multilevel Image Thresholding Using Particle Swarm Optimization\"\", International Journal Of Engineering and Techology(IJET), volume 6(2), pp.1204 -1211, April 2014. . 5.\tDebashis Mishra, Isita Bose, U.C. De and B. Pradhan, “Fish School Search Approach to Find Optimized Thresholds in Gray-Scale Image\"\", Fifth International Conference on Computing, Communications and Networking Technologies (ICCCNT), IEEE. sachi2020-05-22T20:29:02+05:30 Page load link Go to Top",
  "content_length": 1986,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:07"
}