{
  "name": "Uwe Naumann",
  "homepage": "https://www.stce.rwth-aachen.de/people/uwe-naumann",
  "status": "success",
  "content": "Uwe Naumann — i12: STCE I am a professor for Computer Science at RWTH Aachen University, Germany, and Principal Scientist at the Numerical Algorithms Group (NAG) Ltd., Oxford, UK. My research is inspired by Algorithmic Differentiation (AD) including - combinatorial problems in AD [e.g.]- integration of AD into / application to numerical methods [e.g.]- AD software development [e.g.]- AD in parallel high-performance computing [e.g.] - static and dynamic program analysis, transformation and optimization [e.g.]- adjoint methods in computational science, engineering and finance [e.g.] As a fundamental enabling methodology AD not only yields a wide range of intellectual and technical challenges. It also fosters interdisciplinarity as the most promising approach to problem solving based on mathematical modelling and numerical simulation. Its practical relevance helps to generate and to sustain links between academia and industry. CV Born on June 24, 1969 in Rodewisch, Germany Education [02/99] Dr. rer. nat. (equiv. Ph.D., Mathematics), TU Dresden, Germany [05/96] Diplom (equiv. M.Sc., Mathematics), TU Dresden, Germany [07/88] Abitur (equiv. A-levels), EOS Friedrich Engels, Chemnitz, Germany Employment [since 05/22] Principal Scientist at NAG Ltd. [01/21-12/22] Program Director, SIAM Activity Group on Applied and Computational Discrete Algorithms (ACDA) [10/08-04/22] Member and Technical Consultant at NAG Ltd. [04/17-07/17] Visiting Lecturer for Mathematics, University of Oxford, UK [since 07/04] Professor for Computer Science, RWTH Aachen, Germany [01/02-06/04] Postdoctoral Researcher / Assistant Computer Scientist, Argonne National Laboratory, USA [10/01-12/01] Visiting Researcher, MIT, USA [01/00-09/01] Senior Lecturer in  Computer Science, University of Hertfordshire, UK [01/99-12/99] Postdoctoral Researcher, INRIA Sophia-Antipolis, France Publications Google Scholar profile Teaching Algorithmic Differentiation Combinatorial Problems in Scientific Computing Numerical Methods and Software Programming with C++ Simulation Software Engineering Contact Work: +49 (0)241/80 28920 E-Mail: naumann@stce.rwth-aachen.de Visitors:  IT Center, Room 230, Seffenter Weg 23, 52074 Aachen, Germany",
  "content_length": 2214,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:08"
}