{
  "name": "Uwe D. Hanebeck",
  "homepage": "https://isas.iar.kit.edu/de/Mitarbeiter_Hanebeck.php",
  "status": "success",
  "content": "KIT - ISAS - Mitarbeiter Intelligente Sensor-Aktor-Systeme (ISAS) StartseiteMitarbeiter ISASForschungLehreMitarbeiterJobsKontaktMitarbeiterLeitungSekretariatWissenschaftliche MitarbeiterTechnische MitarbeiterAlumni Prof. Dr.-Ing. Uwe Hanebeck Univ.-Prof. Dr.-Ing. habil.140CS 50.20+49 721 608-43909+49 721 608-45340uwe hanebeck ∂does-not-exist.kit eduisas.iar.kit.edu/hanebeck/ Adenauerring 2 Gebäude 50.20 D-76131 Karlsruhe (StM'89-M'91-SM'13-F'17) Fellow (F) 01/04/2017 Senior Member (SM) 04/08/2013 01/03/2017 Member (M) 06/01/1991 04/07/2013 Student Member (StM) 10/01/1989 05/31/1991 IEEE Robotics and Automation Society IEEE Aerospace and Electronic Systems Society IEEE Signal Processing Society IEEE Control Systems Society Gemeinsame Normdatei GND: 1037855256 Virtual International Authority File VIAF: 272692088 Curriculum Vitae Download Curriculum Vitae (PDF status: 09/14/2020) Curriculum Vitae (short, text) Uwe D. Hanebeck is a chaired professor of Computer Science at the Karlsruhe Institute of Technology (KIT) in Germany and director of the Intelligent Sensor-Actuator-Systems Laboratory (ISAS). He obtained his Ph.D. degree in 1997 and his habilitation degree in 2003, both in Electrical Engineering from the Technical University in Munich, Germany. His research interests are in the areas of information fusion, nonlinear state estimation, stochastic modeling, system identification, and control with a strong emphasis on theory-driven approaches based on stochastic system theory and uncertainty models. He is author and coauthor of more than 500 publications in various high-ranking journals and conferences and an IEEE Fellow. Curriculum Vitae (long, text) Uwe D. Hanebeck (IEEE, StM'89-M'91-SM'13-F'17) is a chaired professor of Computer Science at the Karlsruhe Institute of Technology (KIT) in Germany and director of the Intelligent Sensor-Actuator-Systems Laboratory (ISAS). From 2005 to 2015, he was the chairman of the Research Training Group RTG 1194 'Self-Organizing Sensor-Actuator-Networks' financed by the German Research Foundation. Prof. Hanebeck obtained his Ph.D. degree in 1997 and his habilitation degree in 2003, both in Electrical Engineering from the Technical University in Munich, Germany. His research interests are in the areas of information fusion, nonlinear state estimation, stochastic modeling, system identification, and control with a strong emphasis on theory-driven approaches based on stochastic system theory and uncertainty models. Research results are applied to various application topics like localization, human-robot-interaction, assistive systems, sensor-actuator-networks, medical engineering, distributed measuring systems, and extended range telepresence. He is author and coauthor of more than 500 publications in various high-ranking journals and conferences. Uwe D. Hanebeck was the General Chair of the '2006 IEEE Intl. Conf. on Multisensor Fusion and Integration for Intelligent Systems (MFI 2006)', Program Co-Chair of the '11th Intl. Conf. on Information Fusion (Fusion 2008)', Program Co-Chair of the '2008 IEEE Intl. Conf. on Multisensor Fusion and Integration for Intelligent Systems (MFI 2008)', Regional Program Co-Chair for Europe for the '2010 IEEE/RSJ Intl. Conf. on Intelligent Robots and Systems (IROS 2010)', General Chair of the '19th Intl. Conf. on Information Fusion (Fusion 2016)', General Chair of the '2016 IEEE Intl. Conf. on Multisensor Fusion and Integration for Intelligent Systems (MFI 2016)', and Program Co-Chair of the '2017 IEEE Intl. Conf. on Multisensor Fusion and Integration for Intelligent Systems (MFI 2017)', Technical Co-Chair of the '21th Intl. Conf. on Information Fusion (FUSION 2018), Publicity Chair of the '21st IFAC World Congress 2020', General Chair of the '2020 IEEE Intl. Conf. on Multisensor Fusion and Integration for Intelligent Systems (MFI 2020)', and General Chair of the '2021 IEEE Intl. Conf. on Multisensor Fusion and Integration for Intelligent Systems (MFI 2021)'. Prof. Hanebeck is a Member of the Board of Directors of the 'Intl. Society of Information Fusion (ISIF)', was Editor-in-chief of its 'Journal of Advances in Information Fusion (JAIF)' for six years, and was an associate editor for the letter category of the 'IEEE Transactions on Aerospace and Electronic Systems (TAES)' for six years. He is a Fellow of the IEEE. Professional Activities Date Activity 01/2024 - 12/2024 President Intl. Society of Information Fusion (ISIF) 01/2023 - 12/2023 President Intl. Society of Information Fusion (ISIF) 01/2022 - 12/2022 Vice-president Intl. Society of Information Fusion (ISIF) 01/2021 - 12/2023 Elected Member of Board of Directors, Intl. Society of Information Fusion (ISIF) 01/2014 - 12/2019 Editor-in-Chief of the Journal of Advances in Information Fusion (JAIF) and Member of Board of Directors, Intl. Society of Information Fusion (ISIF) 01/2012 - 12/2013 Vice President for Conferences and Member of Board of Directors, Intl. Society of Information Fusion (ISIF) 10/2010 - 12/2016 Technical Editor for Letters: IEEE Transactions on Aerospace and Electronic Systems (TAES) 05/2010 - 06/2022 Member of Board of Trustees of the Fraunhofer Institute for Communication, Information Processing and Ergonomics (FKIE), Wachtberg, Germany 12/2009 - 12/2013 Associate Editor-in-chief of the Journal of Advances in Information Fusion (JAIF) and Member of Board of Directors, Intl. Society of Information Fusion (ISIF) 01/2009 - 12/2011 Secretary and Member of Board of Directors, Intl. Society of Information Fusion (ISIF) 01/2009 - 12/2013 Full member of the admissions committee of the German Academic Exchange Service (DAAD) for the ''Siemens/DAAD Post Graduate Program'' 05/2007 - 04/2010 Member of the Scientific Advisory Board for the Research Institute for Communication, Information Processing and Ergonomics (FKIE) within the Research Establishment for Applied Science (FGAN), Wachtberg, Germany Since 12/2006 Scientific Advisor of the Fraunhofer Institute for Information and Data Processing (IITB), now Fraunhofer Institute of Optronics, System Technologies and Image Exploitation (IOSB), Karlsruhe, Germany 10/2006 - 11/2010 Chairman of the examination board for the Master Program in Computer Science, Universität Karlsruhe (TH) 10/2005 - 09/2015 Chairman of the Research Training Group RTG 1194 ''Self-organizing Sensor-Actuator-Networks'' financed by the German Research Foundation (DFG) 10/2004 - 10/2006 Dean of Study Affairs for the Computer Science Program, Universität Karlsruhe (TH), Germany Since 01/2003 Member of the assembly of representatives of Studierendenwerk Karlsruhe Research Awards Date Award 07/2020 Best Paper Award (Susanne Radtke, Benjamin Noack, Uwe D. Hanebeck) of the ''23rd Intl. Conf. on Information Fusion (Fusion 2020)'', Virtual for the paper ''Fully Decentralized Estimation Using Square-Root Decompositions'' 07/2017 ISIF Conference Technical Contributions Award for contributing 50 or more FUSION Papers from 1998 to 2017 (presented at the ''20th Intl. Conf. on Information Fusion (Fusion 2017)'' in Xi'an, China) 07/2017 ISIF Conference Service Award for Contributions to FUSION Conference Organizations in the period from 1998 to 2017 (presented at the ''20th Intl. Conf. on Information Fusion (Fusion 2017)'' in Xi'an, China) 01/2017 Fellow IEEE for contributions to nonlinear estimation and control 10/2014 Best Paper Award (Antonio Zea, Florian Faion, Uwe D. Hanebeck) of the ''IEEE ISIF Workshop on Sensor Data Fusion: Trends, Solutions, Applications (SDF 2014)'', Bonn, Germany for the paper ''Tracking Extended Objects using Extrusion Random Hypersurface Models'' 07/2014 Best Paper Award (Gerhard Kurz, Igor Gilitschenski, Uwe D. Hanebeck) of the ''17th Intl. Conf. on Information Fusion (Fusion 2014)'', Salamanca, Spain for the paper ''Deterministic Approximation of Circular Densities with Symmetric Dirac Mixtures Based on Two Circular Moments'' 07/2014 Best Student Paper Award, First Runner-Up (Igor Gilitschenski, Gerhard Kurz, Simon J. Julier, Uwe D. Hanebeck) of the ''17th Intl. Conf. on Information Fusion (Fusion 2014)'', Salamanca, Spain for the paper ''A New Probability Distribution for Simultaneous Representation of Uncertain Position and Orientation'' 07/2013 Best Paper Award (Gerhard Kurz, Uwe D. Hanebeck) of the ''16th Intl. Conf. on Information Fusion (Fusion 2013)'', Istanbul, Turkey for the paper ''Recursive Fusion of Noisy Depth and Position Measurements for Surface Reconstruction'' 07/2013 Best Student Paper Award, First Runner-Up (Gerhard Kurz, Igor Gilitschenski, Simon J. Julier, Uwe D. Hanebeck) of the ''16th Intl. Conf. on Information Fusion (Fusion 2013)'', Istanbul, Turkey for the paper ''Recursive Estimation of Orientation Based on the Bingham Distribution'' 07/2011 Best Student Paper Award (Marcus Baum, Uwe D. Hanebeck) of the ''14th Intl. Conf. on Information Fusion (Fusion 2011)'', Chicago, Illinois for the paper ''Shape Tracking of Extended Objects and Group Targets with Star-Convex RHMs'' 08/2008 Best Paper Award of the ''IEEE Intl. Conf. on Multisensor Fusion and Integration for Intelligent Systems (MFI 2008)'' to Felix Sawo, Thomas C. Henderson, Christopher Sikorski, and Uwe D. Hanebeck for their paper ''Sensor Node Localization Methods based on Local Observations of Distributed Natural Phenomena'' 07/1997 Rohde \\& Schwarz Award for an excellent dissertation 04/1996 Anton Philips Prize, ''1996 IEEE Intl. Conf. on Robotics and Automation (ICRA 1996)'', Minneapolis, Minnesota 10/1994 Student Best Paper Award, ''1994 Intl. Conf. on Neural Information Processing (ICONIP 1994)'', Seoul, Korea 11/1992 Award of the Ruhr-Universität Bochum of the year 1992 for the outstanding diploma thesis ''Investigations on the Use of Markov Processes for the Generation of Speech Model Signals'' 09/1989 - 05/1990 Grant of the German Academic Exchange Service (DAAD) for studying at Purdue University, West Lafayette, Indiana, US Supervised Doctoral Dissertatio",
  "content_length": 24248,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:05"
}