{
  "name": "Uwe M. Borghoff",
  "homepage": "https://www.unibw.de/inf2/personen/professoren/borghoff",
  "status": "success",
  "content": "Prof. Dr. Uwe M. Borghoff — Inf2 Skip to main content Prof. Dr. Uwe M. Borghoff Homepage Prof. Dr. Dr. rer. nat. habil. Uwe M. Borghoff Chair for Information Management Address:Institute for Software Technology / Department of Computer ScienceUniversity of the Bundeswehr Munich, 85577 Neubiberg, GermanyOffice: Building 41/400 Room 2401Phone: +49 89 6004 -2274Email: uwe.borghoff@unibw.de Uwe M. Borghoffstudied computer science and mathematics and received his diploma and doctorate from the Technical University of Munich (TUM), Germany. He habilitated in Computer Science at TUM in 1993. He worked as a research scientist at TUM for seven years before joining Xerox Research Center Europe at the Grenoble Laboratory, France, in 1994. At Xerox, he was a senior scientist, project manager and group leader of the Coordination Technology area. He co-invented the Constraint-Based Knowledge Brokers, a novel search engine architecture that could search and cross-reference heterogeneous and multilingual databases using signed feature constraints. This underlying technology was marketed by Xerox from around 1999 under the name Ask Once and was acquired by Documentum in 2004. In 1998, he joined the Faculty of the University of the Bundeswehr Munich, where he is a full professor of Computer Science at the Institute for Software Technology. At the Institute, he works on digital long-term archiving, i.e. the special challenges of electronic archiving over long periods of time. Methods of migration and emulation as well as the so-called computer museum approach are used. In cooperation with John G. Zabolitzky and his team from the Vintage Computing Lab (formerly Computermuseum München), he runs such a \"museum\" under the name datArena on the university campus. From 2002 to 2004, he was Dean of the Faculty of Computer Science. He then served an impressive seven terms as Vice President of the University of the Bundeswehr Munich, where he held a variety of responsibilities. Initially, he held the position of Vice President for the University Sector, later transitioning to Vice President of Academic Affairs, where he played a pivotal role in the implementation of bachelor's and master's programs for intensive study. Under his leadership, the university received a new corporate design, a new internet presence, and continued to evolve as a \"federal university\". Most recently, he held the dual role of Vice President for Digitalization and Chief Information Officer (CIO) of the university until the end of 2024. Since 2008, he has been the founding director of the Campus Advanced Study Center (CASC) – the University’s center for professional education. From 2017 to 2023, he was the founding director of the Center for Intelligence and Security Studies (CISS) and, together with Jan-Hendrik Dietrich, program director of the Master of Intelligence and Security Studies (MISS), which is offered jointly by the Federal University of Administrative Sciences and the University of the Bundeswehr Munich. To date, this is the only intelligence studies program in Germany that brings together all intelligence services and the Bundeswehr. On October 10, 2024, during the Dies Academicus, the President of the University awarded him the Grand University Medal for more than 20 years as Vice President and for his outstanding service to the University. The really important stuff Bibliography datArena Patents Books The Full Bibliography List",
  "content_length": 3451,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:05"
}