{
  "name": "V. Krishna Nandivada",
  "homepage": "http://www.cse.iitm.ac.in/~krishna",
  "status": "success",
  "content": "V. Krishna Nandivada V. Krishna Nandivada Professor, Senior Member IEEE, Senior Member ACM Dept of CSE, IIT Madras, Chennai, Tamil Nadu, India, 600036 Office: SSB 406, Email: nvk@iitm.ac.in, Phone: +91-44-2257-4380 CV, Brief Bio Associated lab: PACE lab. Research interests : Compilers, Program Analysis, Programming Languages, High Performance Computing. Research Research Scholars Teaching Service Openings Docs Research Projects, Publications, Patents, DBLP, Software Research Scholars Currently active PhD: Ramya Kasaraneni, Omkar Dhawal, Yuvraj Talukdar, Rahul Utkoor MS: Arun Prabhakar, Rohit Kanteti, Sudeep Chowdhary. Graduated PhD: Manas Thakur (Faculty - IIT Bombay), Jyothi Vedurada (Faculty - IIT Hyderabad), Aman Nougrahiya (Meta) MS: Suyash Gupta, Abhilash Bhandari, Rahul Shrivastava, Indu K, Arun T, Anchu R S, Aditya Agrawal, Shashin Halalingaiah, Prasoon Mishra, Amit Tiwari. Teaching Paradigms of Programming CS3100 (O22) Modern Compilers - Theory and Practice CS6013 (O12, O13, E15, E16,E17, E20, O21, O22, E24) Introduction to Programming CS1100 (O15, E21, O24) Introduction to Research - dept module CS6021 (O20) Analysis of Parallel Programs CS6235 (E21, E22, E23, E25) Compiler Design CS3300 (O12, O13, O14, O16, O17, O19, O23, O25**) Concurrent Programming (CS6868) (E18) Selected topics in compiler design CS591-5 (at IIT Mandi) (E18) Industrial Lectures CS4880 (E17) Principles of Programming Languages CS6848 (E12, E13, E14, O15) Recent topics in Compilers (E15, O23) Software Engineering CS3400 (E11, E12) Advanced Compilers (at IIT-Delhi) (E07) Service Journals: Associate Editor ACM TACO. Recent Conferences: PC Member and Doctoroal Symposium Chair ISEC 2023. PC Member CASES 2023. PC Member SC 2023. PC Member EVOKE CASCON 2023. Publicity co-Chair ASPLOS 2024. PC Member CGO 2024. PC Member ISEC 2024. PC Member PLDI 2024. PC Member CASCON 2024. PC Member CASES 2024. RC Member OOPSLA 2024-25. PC Member APLAS 2025. PC Member MPLR 2025. PC Member CASES 2025. PC Member LCTES 2025. PC Member CASCON 2025. PC Member CGO 2026. PC Member PPoPP 2026. PC Member PLDI 2026. Openings Postdoc: One opening. MS: One opening in 2026. PhD: One opening in 2027. Interns: None in 2025/26. Have a top resume and interested to work with me? Write to me with your CV. But read this note first. Documents Presentation 101. pdf Brief Bio",
  "content_length": 2350,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:12"
}