{
  "name": "V. K. Prasanna Kumar",
  "homepage": "http://ceng.usc.edu/~prasanna",
  "status": "success",
  "content": "Viktor K. Prasanna – University of Southern California Skip to content Home Viktor K. Prasanna Charles Lee Powell Chair in Engineering Director, Center for Energy Informatics (CEI) Professor of Electrical and Computer Engineering and Professor of Computer Science Viktor K. Prasanna (V. K. Prasanna Kumar) is Charles Lee Powell Chair in Engineering and is Professor of Electrical Engineering and Professor of Computer Science at the University of Southern California (USC) and serves as the director of the Center for Energy Informatics (CEI). His research interests include Parallel and Distributed Computing, Reconfigurable Computing, Accelerator Design and Systems for and applications of ML. He received his BS in Electronics Engineering from the Bangalore University, MS from the School of Automation, Indian Institute of Science, and Ph.D. in Computer Science from the Pennsylvania State University. Prasanna is the Steering Committee Chair of the International Parallel & Distributed Processing Symposium (IPDPS) and the International Conference on High- Performance Computing (HiPC). He serves on the editorial boards of the Journal of Parallel and Distributed Computing, IEEE Transactions on Sustainable Computing and the ACM Transactions on Reconfigurable Technology and Systems. He was the founding chair of the IEEE Computer Society Technical Committee on Parallel Processing. He currently serves as the Editor-in-Chief of the Journal of Parallel and Distributed Computing (JPDC). Prasanna received the W. Wallace McDowell Award from the IEEE Computer Society in 2015 for his contributions to reconfigurable computing.  He received an Outstanding Engineering Alumnus Award from the Pennsylvania State University in 2009, the Distinguished Alumnus Award from the University Visveswaraya College of Engineering (UVCE) of Bangalore University in 2017 and a 2019 Distinguished Alumnus Award from the Indian Institute of Science (IISc). He is a Fellow of the IEEE, the Association for Computing Machinery (ACM) and the American Association for Advancement of Science (AAAS). He is an elected member of Academia Europaea. University of Southern California Logo University of Southern California",
  "content_length": 2200,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:12"
}