{
  "name": "V. N. Venkatakrishnan",
  "homepage": "https://www.cs.uic.edu/~venkat",
  "status": "success",
  "content": "V.N. Venkatakrishnan's Web Site - Home Page V.N. (Venkat) Venkatakrishnan Home “ The teacher who walks in the shadow of the temple, among his followers, gives not of his wisdom but rather of his faith and his lovingness. If he is indeed wise he does not bid you enter the house of his wisdom, but rather leads you to the threshold of your own mind. ” :- Kahlil Gibran in The Prophet Greetings!! Affiliations Professor of Computer Science University Scholar Director of Research and Chief Scientist, Discovery Partners Institute Research Interests My research areas broadly span topics in Computer Systems Security, with use of ideas from compilers, operating systems and formal methods for defending cyber attacks.My complete publication list available here. My CV is available here. Research Support My work is sponsored by grants from NSF, US Department of Defense, US Department of Energy, US Economic Development Administration. Recent and Ongoing Professional Activities Program Committees 2024: USENIX Security 2024, CCS 2024. 2020: ACM CCS 2020. 2019: ACM CCS 2019. 2018:WWW'18 (Security, Privacy Track) 2017:NDSS'17. 2016: NDSS'16, AsiaCCS'16 Education I graduated with a Ph.D in Computer Science in December 2004, from Stony Brook University (formerly, SUNY @ StonyBrook). My advisor was R. Sekar. Students I've been fortunate to work with a group of outstanding students and postdocs, who have gone one to establish themsleves in academia / industry ! Current Student Advisees Sutanu Kumar Ghosh (Ph.D.) Kiavash Satvat (Ph.D.) Neil Thimmaiah (Ph.D) Past Mike Ter Louw (Ph.D) (now at CACI / LGS innovations) Prithvi Bisht (Ph.D) (now at Amazon Lab126) Kalpana Gondi (Ph.D) (co-advised with Prof. Prasad Sistla) (now at Google) Tim Hinrichs (post-doc) (co-advise with Lenore Zuck) (now at Styra) Phu H. Phung (post-doc) (now Asst. Professor of Computer Science at Univ of Dayton) Maliheh Monshizadeh (Ph.D) , now at Bulwark Abeer Alhuzali (Ph.D)(now Asst. Professor of Computer Science at King AbdulAziz University) Birhanu Mekuria, Now Assistant Professor at Univ of Michigan, Dearborn Rigel Gjomemo , now Research Assistant Professor at UIC Computer Science. Sadegh Momemi (Ph.D) (Software Engineer, Google Enterprise Security) Teaching Taking a break from teaching, now at DPI. Fun stuff I am a member of the following Chicago-area organizations: Lincoln Park Zoo The Morton Arboretum Home Research Teaching Publications Vita Security Lab RITES@UIC Personal Contact Me News Chicago has a lot of nice restaurants. See where I have eaten lately! Resources for biking in Chicago. ContentÂ©CopyrightV.N. Venkatakrishnan",
  "content_length": 2626,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:12"
}