{
  "name": "V. S. Subrahmanian",
  "homepage": "https://vssubrah.github.io",
  "status": "success",
  "content": "Home | VS Subrahmanian V.S. Subrahmanian is the Walter P. Murphy Professor of Computer Science at the McCormick School of Engineering, Northwestern University and Buffett Faculty Fellow at the Northwestern Roberta Buffett Institute for Global Affairs. He is also the head of the Northwestern Security and AI Laboratory (NSAIL). Prior to this, Subrahmanian was The Dartmouth College Distinguished Professor in Cybersecurity, Technology, and Society at Dartmouth College with tenure in the Computer Science Department and Director of the Institute for Security, Technology and Society (ISTS). Prior to joining Dartmouth, he was a tenured Professor in the University of Maryland's Computer Science Department. He served a 6.5 year stint as Director of the University of Maryland's Institute for Advanced Computer Studies where he co-founded the Lab for Computational Cultural Dynamics and founded the Center for Digital International Government. His work stands squarely at the intersection of data-driven AI for increased security, policy, and business needs. Prof. Subrahmanian has been an invited speaker at the United Nations, Capitol Hill, the Mumbai Stock Exchange, and numerous other prestigious forums. Prof. Subrahmanian is a world leader in artificial intelligence including logical reasoning with uncertainty, probabilistic logics, temporal probabilistic logics, and managing huge, heterogeneous databases with incomplete and inconsistent information, and multimedia databases. In recent years, he has developed scalable methods to apply probabilistic models to a wide variety of real-world scenarios. He created the field of machine learning based models of terror group behaviors and applied them to making forecasts and suggesting policies to shape behaviors of groups like Hezbollah, Lashkar-e-Taiba, Indian Mujahideen, Boko Haram, and JNIM. The Northwestern Terror Early Warning System has, since October 2024, released monthly forecasts about the future behavior of 6 terror groups: Abu Sayyaf, Al Shabaab, Boko Haram, Indian Mujahideen, JNIM, and Lashkar-e-Taiba. Approximately 60 entities including the UN, Interpol, DHS, as well as companies such as United Airlines, Exxon Mobil, Ford, and others receive these forecasts. To receive these forecasts, you can sign up here. Prof. Subrahmanian's work includes protecting rhinos from poaching, predicting the stability of nations, predicting systemic banking crises in countries, predicting if and when a cyber-vulnerability will be exploited and how severe it will be, predicting spread of malware in countries, and more. In combination with social network analysis, these methods have also been used to identify bad actors on social media, forecast diffusion in social media, and suggest methods to influence social networks. Prof. Subrahmanian led the team that won DARPA's Twitter Influence Bot Detection Challenge under their SMISC program and was a member of the team that won the NIMH-funded Harvard Med School/SUNY Albany NGRID Challenge to automatically quantify the intensity of psychological symptoms in clinical notes. Prof. Subrahmanian has led the development of the Global Online Deepfake Detection System (GODDS) that, since July 8 2024, has provided an audio, video, and image deepfake detection service for journalists. Over 70 journalists have used this service including ones from CNN, Wall Street Journal, New York Times, Agence France Presse, and others. Prof. Subrahmanian is one of the world leaders in the design, analysis, and application of big data analytics to real world problems so that optimal decisions can be made by governments and companies. In cyber-security, Prof. Subrahmanian developed some of the first secure query processing algorithms, flexible authentication frameworks, unexplained behavior detection and scalable detection of known threats. His Global Cyber-Vulnerability Report published in January, 2016, characterizes the cyber-risk of 44 countries by studying data across 44 hosts per year and over 20 Billion telemetry and malware reports. In addition to his academic work, Prof. Subrahmanian has served for 2 years (2013, 2014) on the US-India Strategic Dialog (track 2), the India-Israel track 2 forum (2013, 2014), the US Air Force Science Advisory Board, and DARPA’s Executive Advisory Council on their Advanced Logistics Program. He serves currently on the Research Advisory Board of Tata Consultancy Services (India’s biggest software firm) and the Board of Directors of Sentimetrix, Inc., a big data analytics firm. He previously served on the Board of Directors of the Development Gateway (created by the World Bank in 1999). He serves or has served on the boards of numerous journals including Science, ACM Transactions on Intelligent Systems & Technology, ACM Transactions on Computational Logic, and IEEE Transactions on Computational Social Systems. Academic Appointments Northwestern University (Sept 2021–Present) Walter P. Murphy Professor of Computer Science - McCormick School of Engineering, 9/21 to Present Northwestern Buffet Faculty Fellow - Northwestern Roberta Buffett Institute of Global Affairs, 9/21 to Present Dartmouth College (Aug 1 2017–Aug 2021) The Dartmouth College Distinguished Professor in Cybersecurity, Technology, and Society, 8/17 to 8/21 Professor (with tenure), Computer Science Dept., 8/17 to 8/21 University of Maryland College Park Professor (with tenure), CS Dept. 7/00 to 7/17 Associate Professor (with tenure), CS Dept., 8/95 to 6/00 Assistant Professor, CS Dept., 8/95 to 6/00 Administrative Appointments Director, U. Md. Inst. for Advanced Computer Studies, 10/04 to 6/10 Interim Director, U. Md. Inst. for Advanced Computer Studies, 02/04 to 09/04 Director, Center for Digital International Government 10/05 to 7/17 Director, Lab for Computational Cultural Dynamics 2007 to 7/17 Other Positions Plumer Fellow, Oxford University, 1 month: June-July 2008 Institut de Recherche en Informatique de Toulouse, 4 months: Apr-July 2006 Educational Background PhD, Computer Science, Syracuse University, 1989 M.S., Computer Science, Syracuse University, 1987 M.Sc. (Tech.) Computer Science, Birla Inst. of Tech. and Sci., India, 1985 Past Major Research Accomplishments (Collaboratively With Students and Colleagues) Include: Handbook on Android Malware . The first book that combines the power of both manual and machine learning based prediction of Android malware. Written jointly with expert in academia as well as at Google and Meta. Deepfake Equities Process. Jointly with researchers from the Brookings Institution, developed one of the first comprehensive reviews of how deepfakes would be used in international conflict and proposed the need for a Deepfakes Equities Process that governs how governments use deepfakes to further their ends. Predictive Modeling of Review Fraud for Online Marketplaces. First to develop models to understand how adversaries will evolve their “game” in order to commit review fraud that evades today’s detectors, and how e-businesses can catch such fraud before it occurs. Deep Game-Theoretic Models of Chinese Border Incursions into India. First to develop models of when China will seeks to claim Indian territory via border incursions. Predicting Severity & Timing of Cyber-Vulnerabilities. First to develop models to predict when a cyber-vulnerability will be exploited and how severe it will be. Automated Methods to Deter IP Theft. First to propose the concept of automatically generating fake versions of technical documents to deter IP theft. Mitigating Gray-Box Attacks on Phishing Detectors. Developed the first ever models to mitigate gray-box attacks on phishing detection engines. Predicting Deception, Dominance, and Like/Dislike from Video. Developed some of the most effective models to date to automatically predict deceptive behavior, dominant vs. deferential behavior, and impressions from video data. Improving Airline Profitability through Machine Learning. The first to develop ensemble machine learning and game theoretic methods to predict market share and demand of airlines in the US and to use these models to help improve expected profits. Behavioral Analysis of Insider Threats. One of the first to predict who in an organization is likely to leak or steal sensitive information. Pareto Optimal Defense of Enterprise Systems. The first to develop optimal algorithms to protect an enterprise by helping a security officer decide what combination of patches to apply and what vulnerable software products to de-activate Anti-Poaching Engine. The first to develop algorithms to learn behavioral models of both rhinos and poachers in Oliphants West Game Park (S. Africa). Showed how to optimally deploy a suite of drones and a set of ranger patrols on the ground to maximize expected number of protected rhinos. Destabilizing Terrorist Groups. The first to measure how terrorist network structure is linked to lethality of the group and methods to destabilize it. Identifying Bad Actors in Social Media. One of the first to develop algorithms to identify trolls on Slashdot, bots on Twitter, vandals on Wikipedia, sockpuppet accounts in online discussion forums (Disqus), review fraud in online e-commerce platforms (Twitter). Identifying Activities in High Throughput Observation Streams. First to develop methods to identify high level activities (e.g. suspicious ones) in video streams and cybersecurity data. Global Cyber-Vulnerability Report. First to characterize the cyber-vulnerability of 44 countries by examining billions of malware reports over 2 years covering over 4M hosts per year. First to develop data models and algorithms to reason about inconsistent databases. Invented generalized annotated programs (GAPs) as a formalism for reasoning about diverse forms of uncertainty, time, and more. First to develop a probabilistic logic rule language and temporal probabilistic rule language. First to develop probabilistic relational database models without independ",
  "content_length": 203229,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:13"
}