{
  "name": "V. Wiktor Marek",
  "homepage": "https://www.cs.uky.edu/~marek",
  "status": "success",
  "content": "Victor's Page Victor W. Marek's page Here is current time for your convenience I am a Professor Emeritus at: University of Kentucky Computer Science Department My current office is located at: 304E1 Davis Marksbury Building Lexington, KY 40506 Phone: (859) 257-3496 (office) Phone: (859) 257-3961 (Department) Fax: (859) 257-1505 (Departmental FAX) e-mail: marek AT cs DOT uky DOT edu Here's my vitae (sorry, pdf only) (app. 165K) Research Current interests include: artificial intelligence, logic (including nonmonotonic logics), SAT, hardware verification, constraint programming, databases, and distributed computing. ON-LINE PAPERS LINKS TO TALKS, SLIDES, AND OTHER SCIENCE-RELATED DOCUMENTS. Personal For additional visual information visit our Picture Gallery (Science- and Teaching- related). And some photos related to my family Picture Gallery (Family-related). There is also some genealogical information. For those who do not doubt that the time is passing Photos of the special session at the 2008 ISAIM. For an inspirational poem visit our Poetry Corner. For those in need of scientific inspiration: The shoes of Alfred Tarski. And here is our Cabinet of Curiosities. US Census Bureau found 13 individuals in United States named Victor Marek. For instance, I am aware of two individuals in Schwertner, TX, named Victor Marek. There are also other notable individuals with the same last name and first name, not necessarily in the United States. One, from France, has a page on Facebook. For those that got to this page by error and really look for the German rock-singer Viktor Marek (also known as Victor Marek), the author of a remix of a piece \"Random Access Memory (Lost my Head)\", here is a page that may help. Applications in gaming My colleagues, Raphael Finkel, Mirek Truszczynski and myself use an FD-CSP solver (in this case ASP solver) to generate Sudoku puzzles. The puzzles we generate are instrumented with the clue sequence (and solution, of course). Moreover, we can create Sudoku and similar puzzles of very different degree of difficulty; very easy as those of Dell's Number Place puzzles, up to puzzles extremely hard for humans (even though still 9x9). We can also generate puzzles in different sizes, for instance 16x16. True amateurs of superhuman puzzles (25x25 or 36x36 - yes, we can produce these monsters as well) are kindly requested to contact us directly. Recently, we started to offer \"Über-puzzle'' based on the following idea: a collection of sudoku, or sudoku-like puzzle determines a message. Solving the entire collection creates an encoded text, and once this text is decoded (the code is provided), the message can be retrieved. Everything can be adjusted in this puzzle: sizes of the individual puzzles, their difficulty and, of course, the message. Kids can train in Sudoku too; we offer 4x4 and 5x5 puzzles especially designed for kids. As a service to the community we publish a daily Sudoku puzzle (actually, two) 365/365. The puzzle is available here for your puzzle enjoyment. A book resulting from this effort is available at the independent publisher location: Puzzles Galore Volume I (Sudoku and other puzzles) or on Amazon.com A page (pretty old) with resources for sudoku designers is available here. It is a work in progress, please visit and contribute. Weather in Lexington right now available at Weather Underground: See it for yourself Finally, read a thought that strikes me as particularly profound: Before you speak, ask yourself: is it kind, is it necessary, is it true, does it improve on the silence? It is claimed that it was formulated by Sai-Baba; it looks more like Epictetus to me. Last modified: February 4, 2020",
  "content_length": 3691,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:15"
}