{
  "name": "Vaanathi Sundaresan",
  "homepage": "https://sites.google.com/view/dr-vaanathi-sundaresan/ABOUT",
  "status": "success",
  "content": "Dr. Vaanathi SundaresanSearch this siteEmbedded FilesSkip to main contentSkip to navigationI am an Assistant Professor at the Department of Computational and Data Sciences (CDS) , Indian Institute of Science (IISc), Bangalore. I am the convenor of Biomedical image Analysis (BioMedIA) laboratory at CDS, IISc.Prior to this, I was working as a postdoctoral research fellow at Athinoula A. Martinos Centre, Department of Radiology, Harvard Medical School and Massachusetts General Hospital. I received my doctorate degree at FMRIB, Wellcome Centre for Integrative Neuroimaging (WIN), University of Oxford. Email  /  Google Scholar  /  ORCiD  /  Scopus  /  LoopEXPERIENCEAssistant Professor (2022 – present) Department of Computational and Data Sciences, Indian Institute of Science, IndiaPostdoctoral Research Fellow Athinoula A. Martinos Centre, Massachusetts General Hospital and Harvard Medical School, United StatesPostdoctoral Researcher Wellcome Centre for Integrative Neuroimaging (WIN), University of Oxford, United KingdomDPhil (PhD) in Biomedical Imaging FMRIB, Nuffield Department of Clinical Neurosciences (NDCN), University of Oxford, United Kingdom     M.S. in Electrical Engineering Indian Institute of Technology Madras (IITM), IndiaRESEARCH Codes related to my research projects: Github, BioMedIA Github and WIN Gitlab pages.FELLOWSHIPS / AWARDS/ FUNDINGSCSIR - ASPIRE: Development of Novel Artificial Intelligence Algorithms for Detection of Structural Anomalies in Medical Images (2025 - 2028)India Alliance DBT-Wellcome Trust Early Career Fellowship: Development and evaluation of Imaging-based biomarkers for quantitative assessment of Vascular Cognitive Impairment using Artificial Intelligence (2024 - 2028)SERB - SRG: Explainable Artificial Intelligence methods for studying structural variations in ageing brain (2024 - 2026)CDS - Siemens Healtineers Collaborative Laboratory on Artificial Intelligence in Precision Medicine (2023-2026)Pratiksha Trust Young Investigator Award (2023 - 2025)Oxford Indira Gandhi Graduate Scholarship (2018 - 2019)Awarded by Somerville College, University of Oxford, UK.     Awarded to up to 3 Indian students annually to pursue graduate studies at the Universityof oxford.Prem-Suki Foundation Scholarship (2015 - 2018)Awarded by Somerville College, University of Oxford, UK.Awarded to an Indian student annually to pursue graduate studies in Biomedical/Healthcaresciences at University of  Oxford.Guarantors of Brain Travel Award (2019, 2017)Awarded by Organisation for Human Brain Mapping (OHBM) board for attending Annualmeetings of OHBM at Vancouver in 2017 & Italy in 2019.Best Poster Award (2018)Won for poster titled \"Improvements in the white Matter Hyperintensities Detection Algorithm using local adaptive threshold\" at the Wellcome centre integrative neuroimagingNeurodegeneration Day, University of  Oxford, UK.TEACHINGDS 216 (JAN-APR, 2025): Machine learning for data science (ongoing): Course webpage DS 216o (JAN-APR, 2025): Applied AI in Healthcare (ongoing)DS 261 (AUG-DEC, 2024): AI for medical imagingDS 216 (JAN-APR, 2024): Machine learning for data science: Course webpage DS 216o (JAN-APR, 2024): Applied AI in HealthcareDS 261 (AUG-DEC, 2023): AI for medical imagingDS 261o (JAN-APR, 2023): AI for medical imagingRECENT PUBLICATIONS2021 -  202616. Ramananda S.H., Sundaresan, V*. \"Label-efficient Sequential model-based Weakly supervised Intracranial Hemorrhage Segmentation in Low-data Non-Contrast CT imaging.\" Medical Physics (Accepted in 2025, in press) [Preprint]15. Sundaresan, V*, Zamboni G, Dineen R.A, Auer D.P., Sotiropoulos S.N, Sprigg N, Jenkinson M, and Griffanti L. \"Automated characterisation of cerebral microbleeds using their size and spatial distribution on brain MRI.\" European radiology experimental 9, no. 1 (2025): 5. [Paper]14. Narayanan, R, and Sundaresan, V*. \"MedLesSynth-LD: Lesion synthesis using physics-based noise models for robust lesion segmentation in low-data medical imaging regimes.\" Pattern Recognition Letters 188 (2025): 155-163. [Paper]13. Soren V.N., Prajwal, H.S., Sundaresan, V.*, Automated grading of diabetic retinopathy and Radiomics analysis on ultra-wide optical coherence tomography angiography scans. Image and Vision Computing 151, 105292 (2024).  [Paper]12. Sundaresan, V.*, Arthofer, C., et al, Automated Detection of Cerebral Microbleeds on MR images using Knowledge Distillation Framework.Frontiers in Neuroinformatics, 17, p.1204186. (2023). [Paper]11. Dinsdale, N.K.*, Bluemke, E., Sundaresan, V. et al. Challenges for machine learning in clinical translation of big data imaging studies. Neuron (2022). [Preprint  /  Paper]10. Sundaresan, V.* et al.Automated Detection of Candidate Subjects with Cerebral Microbleeds using Machine Learning. Front. Neuroinform. 15, 80 (2022). [Paper]9. Sundaresan,V.* et al. Comparison of domain adaptation techniques for white matter hyperintensity segmentation in brain MR images. Med Image Anal. 74, 102215 (2021). [Paper]8. Campello, V.M.*, Gkontra, P., Izquierdo, C., Martín-Isla, C., Sojoudi, A., Full, P.M., Maier-Hein, K., Zhang, Y., He, Z., Ma, J., Parreño, M., Albiol, A., Kong, F., Shadden, S. C., Acero, J, C., Sundaresan, V. et al. Multi-Centre, Multi-Vendor and Multi-Disease Cardiac Segmentation: The M&Ms Challenge. IEEE Trans Med Imaging 40 (12), 3543-3554 (2021). [Paper]7. Sundaresan,V.*, Zamboni,G., Rothwell,P.M., Jenkinson,M., & Griffanti,L. Triplanar ensemble U-Net model for white matter hyperintensities segmentation on MR images. Med Image Anal. 73, 102184 (2021). [Paper]6. Bordin, V.*, Bertani, I., Mattioli, I., Sundaresan, V. et al. Integrating large-scale neuroimaging research datasets: harmonisation of white matter hyperintensity measurements across Whitehall and UK Biobank datasets. NeuroImage 237, 118189 (2021). [Paper]5. Melazzini, L.*, Mackay, C.E., Bordin, V., S Suri, Zsoldos, E., Filippini, N., Mahmood, A., Sundaresan, V. et al. White matter hyperintensities classified according to intensity and spatial location reveal specific associations with cognitive performance. NeuroImage Clin. 30, 102616 (2021). [Paper]2015 -  20204. Gentile, G.*, Battaglini, M., Luchetti, L., Giorgio, A., Griffanti, L., Sundaresan, V. et al.BIANCA for an automatic detection of multiple sclerosis lesions using machine learning. Multiple Sclerosis Journal 25, 681 SAGE publications (2019). [Paper] 3. Sundaresan, V.* et al. Automated lesion segmentation with BIANCA: impact of population-level features, classification algorithm and locally adaptive thresholding. NeuroImage 202, 116056 (2019). [Paper]2. Sundaresan, V.*, L Griffanti., P Kindalova., F Alfaro-Almagro, G Zamboni., Modelling the distribution of white matter hyperintensities due toageing on MRI images using Bayesian inference (2019). [Paper]1. Griffanti, L.*, Zamboni, G., Khan, A., Li, L., Bonifacio, G., Sundaresan, V. et al. BIANCA (Brain Intensity AbNormality Classification Algorithm): a new tool for automated segmentation of white matter hyperintensities. NeuroImage 141, 191-205 (2016). [Paper]CONFERENCE PAPERS AND ABSTRACTS12. Vivek SD, Sundaresan, V*. 'Inter-class separability loss for weakly supervised mutually exclusive multiclass segmentation of brain tumor lesions' MICCAI 2025 [early accept].11. Patra A*, Wu J, Sundaresan V, Wu H, Scordis P. Attentive latent replay for continual learning in pathology.International Symposium on Biomedical Imaging, 2025. ISBI 2025 (accepted, in press).10. Sundaresan,V.*, Dinsdale, N.K., Jenkinson,M. & Griffanti,L. Omni-supervised domain adversarial training for white matter hyperintensity segmentation in the UK Biobank. International Symposium on Biomedical Imaging, 2022. ISBI 2022. 1-4 IEEE (2022). *Shared first authorship. [Paper]9. R Jones*., C Maffei., Q Tian., S Huang., Sundaresan, V., A Yendiki In Vivo demonstration of generalised anisotropy profiles for resolving boundaries between subcortical gray and white matter. 8. Sundaresan, V.*, M Jenkinson, G Zamboni and L Griffanti. “Detection of white matter hyperintensities using Triplanar U-Net  network” - Annual Meeting of International Society for Magnetic Resonance in Medicine (ISMRM) (2020), France. [Abstract]7. Sundaresan, V.*, Jenkinson, M., Zamboni, G. & Griffanti, L. Detection of white matter hyperintensities using Triplanar U-Net ensemble network. International Society for Magnetic Resonance in Medicine, (2020). ISMRM 2020. [Abstract]6. Sundaresan V*, C Arthofer, G Zamboni, S Sotiropoulos, P Rothwell, R Dineen, D Auer, M Jenkinson, and L Griffanti “Identifying Subjects with Cerebral Microbleeds in Big Datasets: A Pipeline for    Candidate Selection” - Annual meeting of Organization for Brain Mapping (OHBM) (2019), Italy.5. Sundaresan V*,M Jenkinson, G Zamboni and L Griffanti. “Local Intensity Guided Spatially Adaptive Thresholding of White Matter Lesion Probabilities” - Annual meeting of Organization for Human Brain Mapping (OHBM) (2018), Singapore.4. Sundaresan, V.*, Bridge, C.P., Ioannou, C. & Noble, J. A. Automated characterization of the fetal heart in ultrasound images using fully convolutional neural networks. International Symposium on Biomedical Imaging, 2017. ISBI 2017. 1-4 IEEE (2017). [Paper] 3. Sundaresan, V.*, Ram, K., Joshi, N., Sivaprakasam, M. & Gandhi, R. Computer-assisted grading of diabetic macular edema on retinal color fundus images, in Engineering in Medicine and Biology Society, 2015. EMBS 2015. 4330-4333. IEEE (2015). [Paper]2. Sundaresan, V.*, Ram, K., Joshi, N., Sivaprakasam, M & Gandhi, R. Integrated approach for accurate localization of optic disc and macula, in Ophthalmic Medical Image Analysis International Workshop, 2014. OMIA MICCAI (2014). [Paper]1.Sundaresan, V.*, Ram, K., Selvaraj, K., Joshi, N. & Sivaprakasam, M. Adaptive super-candidate based approach for detection and classification of drusen on retinal fundus images. OMIA MICCAI (2015). [Paper].BOOK CHAPTERS5. Sundaresan, V.*, NK Dinsdale., Automated quality assessment using appearance -",
  "content_length": 11575,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:14"
}