{
  "name": "Vadim Shcherbakov",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/vadim-shcherbakov",
  "status": "success",
  "content": "Vadim Shcherbakov - Royal Holloway Research Portal Vadim Shcherbakov Dr Reader, Department of Mathematics https://orcid.org/0000-0001-9175-5238 Phone+44 1784 276528EmailVadim.Shcherbakovrhul.acuk TW20 0EX Personal profile Research interestsMy research is in the area of  probability, stochastic processes and their applications. My current research mainly concerns the long term behaviour of Markov  processes with interaction, such as interacting birth-and-death processes, competition processes and growth processes with graph-based interaction. I am also interested in applications of probability to finance. Educational backgroundMSc  and PhD (Faculty of Mechanics and Mathematics, Moscow State University) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 35 Article 1 Working paper Research output per year Research output per year A diffusion limit for Markov chains with log-linear interaction on a graphPuhalskii, A. & Shcherbakov, V., 11 Oct 2025, In: Markov Processes and Related Fields. 31, 2, p. 127-142 16 p.Research output: Contribution to journal › Article › peer-review Open Access Explicit local volatility formula for Cheyette-type interest rate modelsGairat, A., Gorovoy, V. & Shcherbakov, V., 30 Jun 2025, 19 p.Research output: Working paper Extreme ATM skew in a local volatility model with discontinuity: joint density approachGairat, A. & Shcherbakov, V., Oct 2024, In: Finance and Stochastics. 28, 4, p. 1179-1202Research output: Contribution to journal › Article › peer-review Open Access Superdiffusive planar random walks with polynomial space-time driftsda Costa, C., Menshikov, M., Shcherbakov, V. & Wade, A., Oct 2024, In: Stochastic Processes and Their Applications. 176, 17 p., 104420.Research output: Contribution to journal › Article › peer-review Open AccessFile 31 Downloads (Pure) Balls-in-bins models with asymmetric feedback and reflectionShcherbakov, V. & Menshikov, M., 15 Jan 2023, In: ALEA, Latin American Journal of Probability and Mathematical Statistics. 20, p. 1-19 19 p.Research output: Contribution to journal › Article › peer-review View all 36 research outputs Projects 1 Not started 4 Finished Projects per year Near-Critical Stochastic Systems: A Workshop in Celebration of M.Menshikov's 70 birthdayShcherbakov, V. (PI)Project: Research Super-diffusive random walksShcherbakov, V. (PI)London Mathematical Society9/01/24 → 12/01/24Project: Research Near Critical Stochastic Systems: A workshop in Celebration of M Menshikov’s 70th BirthdayShcherbakov, V. (PI)London Mathematical Society1/03/18 → 31/03/18Project: Research Research in Pairs -- Collaboration with Prof. M. MenshikovShcherbakov, V. (PI)3/10/16 → 7/10/16Project: Research Asymptotic behaviour and stationary distributions of locally interacting birth-and-death processesShcherbakov, V. (PI)27/07/15 → 15/08/15Project: Research",
  "content_length": 3436,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:18"
}