{
  "name": "Vadim Zaytsev",
  "homepage": "https://grammarware.net",
  "status": "success",
  "content": "Dr. Vadim Zaytsev [V. Zaytsev] ::= [About] [Research] [Teaching] [Practice] ; I am an Associate Professor of software evolution at the University of Twente, working in software analysis, modelling and restructuring since 2004; before that I was a machine code hacker and a railway engineer. My past affiliations include Dutch, Belgian, German and Russian companies and research institutions, as well as volunteer participation at Wikimedia activities. My research interests gravitate towards elicitation of structure in software and improving it by taking advantage of whatever structure is present. At my previous job as a Chief Science Officer, my day to day activities involved developing compilers, writing metaprograms and analysing migration projects. My current focus is on doing industrially relevant research from the academia, teaching several courses, supervising students and developing prototype software. Research Highlights Two recent papers in 2025 on automated program repair with large language models at SAC and GPCE. The first Zorro WP4 paper is in print: Modelling of CPS through DSL: Decision, Analysis, Design, co-authored with three BSc students of TCS. Unified Assessment Pipeline for Learning-by-Doing was a successful incentive grant that I co-authored with Angelika Mader from the HMI group at UTwente, it started in September 2024 and already has some publications, in particular at ICST and ITiCSE. Teaching Highlights After considerable effort after the event, the post-proceedings version for (A)ISoLA on generative AI in project-based education is in print. My MSc course Software Evolution runs on BabyCobol in April through July. 2025 is the re-accreditation year for BSc TCS and MSc CS at UT. Practice Highlights GPL-licensed CFG to VPG converter is out for true grammarware fans who know about visually pushdown automata. Our recent JSS paper on modernity signatures covered PHP and Python, and since then we also experimented on C♯ and Rust. Apollo++ is a tool for automated assessment of learning outcomes in programming projects, its author Arthur Rump started his PhD in September 2024. Social Highlights Shonan Seminar №231 on Bidirectional Transformations: Foundations and Applications ran on 26–29 May in Japan. I am collecting the bits for the report as we speak. The next SLE was co-located with STAF in June 2025! I serves as the Programme (Co-)Chair. Check out the proceedings! The next ICT.OPEN took place in April 2025. I served as the Programme Co-Chair with Mitra Nasri from TU/e. Last updated: 2024. All material on this website is created by Vadim Zaytsev unless stated otherwise.",
  "content_length": 2640,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:16"
}