{
  "name": "Vadim E. Levit",
  "homepage": "http://ariel.academia.edu/VadimLevit",
  "status": "success",
  "content": "Vadim Levit - Ariel University Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Vadim LevitAriel University, Mathematics, Faculty MemberaddFollowdoneFollowingFollowers199Following34Co-authors7Public ViewsI am a professor of Mathematics and Algorithmics.lessRelated Authors Steven J. MillerWilliams College James ElkinsSchool of the Art Institute of Chicago Julita VassilevaUniversity of Saskatchewan Sebastián VenturaUniversidad de Córdoba David Pierre LeibovitzCarleton University Andrej DujellaUniversity of Zagreb Thomas BritzThe University of New South Wales Marc ChampagneKwantlen Polytechnic University Ramesh Chander SharmaAmbedkar University Delhi Remo CaponiUniversity of CologneInterestsView All (17) CVUploadsPapers by Vadim LevitOn Computing of Independence Polynomials of TreesRecent Research in Polynomials [Working Title]An independent set in a graph is a set of pairwise non-adjacent vertices. Let $\\alpha(G)$ denote ... more An independent set in a graph is a set of pairwise non-adjacent vertices. Let $\\alpha(G)$ denote the cardinality of a maximum independent set in the graph $G = (V, E)$. Gutman and Harary defined the independence polynomial of $G$ \\[ I(G;x) = \\sum_{k=0}^{\\alpha(G)}{s_k}x^{k}={s_0}+{s_1}x+{s_2}x^{2}+...+{s_{\\alpha(G)}}x^{\\alpha(G)}, \\] where $s_k$ denotes the number of independent sets of cardinality $k$ in the graph $G$. A comprehensive survey on the subject is due to Levit and Mandrescu, where some recursive formulas are allowing computation of the independence polynomial. A direct implementation of these recursions does not bring about an efficient algorithm. In 2021, Yosef, Mizrachi, and Kadrawi developed an efficient way for computing the independence polynomials of trees with $n$ vertices, such that a database containing all of the independence polynomials of all the trees with up to $n-1$ vertices is required. This approach is not suitable for big trees, as an extensive databas...Download On Clique Corona Graphs - A Short SurveyMatemática Contemporânea, 2017Let H = {H v : v ∈ V (G)} be a family of complete graphs indexed by the vertex set of a graph G. ... more Let H = {H v : v ∈ V (G)} be a family of complete graphs indexed by the vertex set of a graph G. The clique corona graph G • H of G and H is the disjoint union of G and H v , v ∈ V (G), with additional edges joining each vertex v ∈ V (G) to all the vertices of H v . In this paper, we survey interconnections between clique coronas, wellcovered graphs and independence polynomials.Download Inequalities Connecting the Annihilation and Independence NumbersarXiv (Cornell University), Aug 2, 2023Given a graph G, the number of its vertices is represented by n(G), while the number of its edges... more Given a graph G, the number of its vertices is represented by n(G), while the number of its edges is denoted as m(G). An independent set in a graph is a set of vertices where no two vertices are adjacent to each other and the size of the maximum independent set is denoted by α(G). A matching in a graph refers to a set of edges where no two edges share a common vertex and the maximum matching size is denoted by µ(G). If α(G) + µ(G) = n(G), then the graph G is called a König-Egerváry graph. Considering a graph G with a degree sequence d1 ≤ d2 ≤ • • • ≤ dn, the annihilation number a(G) is defined as the largest integer k such that the sum of the first k degrees in the sequence is less than or equal to m(G) (Pepper, 2004). It is a known fact that α(G) is less than or equal to a(G) for any graph G. Our goal is to estimate the difference between these two parameters. Specifically, we prove a series of inequalities, including a for trees, a(G)-α(G) ≤ 2+µ(G)-2 1 + µ(G) for bipartite graphs and a(G) -α(G) ≤ µ(G) -2 for König-Egerváry graphs. Furthermore, we demonstrate that these inequalities serve as tight upper bounds for the difference between the annihilation and independence numbers, regardless of the assigned value for µ(G).Download Recognizing $$\\mathbf {W_2}$$ GraphsGraphs and combinatorics, May 23, 2024Let G be a graph. A set S ⊆ V (G) is independent if its elements are pairwise nonadjacent. A vert... more Let G be a graph. A set S ⊆ V (G) is independent if its elements are pairwise nonadjacent. A vertex v ∈ V (G) is shedding if for every independent set S ⊆ V (G) \\N [v] there exists u ∈ N (v) such that S ∪ {u} is independent. An independent set S is maximal if it is not contained in another independent set. An independent set S is maximum if the size of every independent set of G is not bigger than |S|. The size of a maximum independent set of G is denoted α(G). A graph G is well-covered if all its maximal independent sets are maximum, i.e. the size of every maximal independent set is α(G). The graph G belongs to class W 2 if every two disjoint independent sets in G are included in two disjoint maximum independent sets. If a graph belongs to the class W 2 , then it is well-covered. Finding a maximum independent set in an input graph is a well-known NP-hard problem. Recognizing well-covered graphs is co-NPcomplete. Recently, it was proved that deciding whether an input graph belongs to the class W 2 is co-NP-complete. However, when the input is restricted to well-covered graphs, the complexity status of recognizing graphs in W 2 is still not known. In this article, we investigate the connection between shedding vertices and W 2 graphs. On the one hand, we prove that recognizing shedding vertices is co-NP-complete. On the other hand, we find polynomial solutions for restricted cases of the problem. We also supply polynomial characterizations of several families of W 2 graphs.Download Crowns in bipartite graphsElectronic Notes in Discrete Mathematics, 2016Abstract A set S ⊆ V ( G ) is stable (or independent) if no two vertices from S are adjacent. Let... more Abstract A set S ⊆ V ( G ) is stable (or independent) if no two vertices from S are adjacent. Let Ψ ( G ) be the family of all local maximum stable sets [V. E. Levit, E. Mandrescu, A new greedoid: the family of local maximum stable sets of a forest, Discr. Appl. Math. 124 (2002) 91–101] of graph G, i.e., S ∈ Ψ ( G ) if S is a maximum stable set of the subgraph induced by S ∪ N ( S ) , where N(S) is the neighborhood of S. If I is stable and there is a matching from N(I) into I, then I is a crown of order | I | + | N ( I ) | , and we write I ∈ Crown ( G ) [F. N. Abu-Khzam, M. R. Fellows, M. A. Langston, W. H. Suters, Crown structures for vertex cover kernelization, Theory of Comput. Syst. 41 (2007) 411–430]. In this paper we show that Crown ( G ) ⊆ Ψ ( G ) holds for every graph, while Crown ( G ) = Ψ ( G ) is true for bipartite and very well-covered graphs. For general graphs, it is NP-complete to decide if a graph has a crown of a given order [C. Sloper. Techniques in Parameterized Algorithm Design. Ph.D. thesis, Department of Computer Science, University of Bergen, Norway, 2005]. We prove that in a bipartite graph G with a unique perfect matching, there exist crowns of every possible even order. Fair Division Algorithms for Electricity DistributionarXiv (Cornell University), May 28, 2022In many developing countries, the total electricity demand is larger than the limited generation ... more In many developing countries, the total electricity demand is larger than the limited generation capacity of power stations. Many countries adopt the common practice of routine load shedding-disconnecting entire regions from the power supply-to maintain a balance between demand and supply. Load shedding results in inflicting hardship and discomfort on households, which is even worse and hence unfair to those whose need for electricity is higher than that of others during load shedding hours. Recently, Oluwasuji et al. [2020] presented this problem and suggested several heuristic solutions. In this work, we study the electricity distribution problem as a problem of fair division, model it using the related literature on cake-cutting problems, and discuss some insights on which parts of the time intervals are allocated to each household. We consider four cases: identical demand, uniform utilities; identical demand, additive utilities; different demand, uniform utilities; different demand, additive utilities. We provide the solution for the first two cases and discuss the novel concept of q-times bin packing in relation to the remaining cases. We also show how the fourth case is related to the consensus k-division problem. One can study objectives and constraints using utilitarian and egalitarian social welfare metrics, as well as trying to keep the number of cuts as small as possible. A secondary objective can be to minimize the maximum utility-difference between agents.Download On Computing of Independence Polynomials of TreesIntechOpen eBooks, Mar 7, 2023An independent set in a graph is a set of pairwise nonadjacent vertices. Let α G ðÞ denote the ca... more An independent set in a graph is a set of pairwise nonadjacent vertices. Let α G ðÞ denote the cardinality of a maximum independent set in the graph G ¼ V, E ðÞ .In 1983, Gutman and Harary defined the independence polynomial of GI G; x ðÞ ¼ P α G ðÞ k¼0 s k x k ¼ s 0 þ s 1 x þ s 2 x 2 þ … þ s α G ðÞ x α G ðÞ , where s k denotes the number of independent sets of cardinality k in the graph G. A comprehensive survey on the subject is due to Levit and Mandrescu, where some recursive formulas are allowing computation of the independence polynomial. A direct implementation of these recursions does not bring about an efficient algorithm. In 2021, Yosef, Mizrachi, and Kadrawi developed an efficient way for computing the independence polynomials of trees with n vertices, such that a database containing all of th",
  "content_length": 23288,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:16"
}