{
  "name": "Vagelis Hristidis",
  "homepage": "http://www.cs.ucr.edu/~vagelis",
  "status": "success",
  "content": "Vagelis Hristidis, Professor, UC Riverside Vagelis Hristidis (official name: Evangelos Christidis), Professor Computer Science & Engineering University of California, Riverside 900 University Ave. Riverside, CA 92521 office: Winston Chung Hall 317 office tel.: (951) 827-2478 fax: (951) 827-4643 BIOGRAPHICAL SKETCH My key areas of expertise are Databases Systems and Information Retrieval. I work on optimizing the performance of NoSQL database systems. I am also interested to make the information in databases easily accessible and useful, in various application domains. My research has strong emphasis on interdisciplinary topics, mainly healthcare and social networks. My key achievements include the NSF CAREER award, a Google Research Award, an IBM Scalable Data Analytics for A Smarter Planet Innovation Award, the FIU SCIS Excellence in Research Award (twice), the FIU University Faculty Award and the Kauffmann Entrepreneurship Award. My work has been funded by NSF, IARPA, DHS, DTRA, Samsung, Google and IBM. Our work on correlating Twitter and financial data in 2012 was featured by many mainstream media like The New York Times, Forbes and Yahoo!. In 2016, I co-founded SmartBot360, which is a cloud-based chatbot platform, funded by two NSF SBIR grants. Curriculum Vitae Google Scholar Profile ORCID RECENT Research INTERESTS NoSQL storage and querying big data analytics presentation and navigation of query results, web search social networks online reviews analysis text classification AI chatbots UCR Database Lab RECENT CLASSES CS 172: Introduction to Information Retrieval, Spring 2018, Spring 2019, Spring 2020, Spring 2021, Spring 2022, Spring 2023, Spring 2024 CS 242: Information Retrieval & Web Search, Winter 2014, Spring 2015, Fall 2016, Winter 2018, Winter 2019, Winter 2020 CS 179G: Project in Computer Science, Fall 2013, Spring 2016, Winter 2017 CS 260: Computer Science Seminar, Spring 2012, Spring 2013, Fall 2013, Fall 2014, Fall 2015, Fall 2017 CS 10C (former 014) Introduction to Data Structures and Algorithms, Winter 2013, Winter 2018, Fall 2019, Fall 2020 CS 235: Data Mining Techniques, Winter 2012, Fall 2012 STUDENTS Current: Taukir Azam Chowdhury, PhD student Zabir Al Nazi (Nabil), PhD student Jannat Meem, PhD student Alumni: Shihab Rashid, PhD 2024, Amazon AWS Merlin Mao, PhD 2022, Bytedance Abu Bakar Siddique, PhD 2021, Assistant Professor at University of Kentucky Ryan Rivas, PhD 2021, SmartBot360 Le Xuan Thong Nhat, PhD 2019, at Facebook Mohiuddin Abdul Qader, PhD 2018, at eBay Shouq Sadah, PhD 2017, PostDoc at UCLA Moloud Shahbazi, PhD 2017, at Apple Matthew Wiley, PhD 2016 Shiwen Cheng, PhD 2015, at Facebook Eduardo Ruiz, PhD 2013, at Amazon, then at Google Abhijith Kashyap, PhD 2013 Fernando Farfan, PhD 2010, PostDoc at University of Michigan, Ann Arbor Ramakrishna Varadarajan, PhD 2009, at HP (formerly: PostDoc at University of Wisconsin, Madison) PROJECTS NoSQL Storage, supported by NSF Joint Modeling and Querying of Social Media and Video, supported by NSF Crowdtagger, Collaborative labeling and classification CareHeroes, supported by the Florida Department of Health High-School Outreach, supported by NSF Past Projects Social Health Analytics, Social and News Analytics, Twitter Geospatial Search, partially supported by NSF Collaborative Adaptive Data Sharing, supported by NSF, Google Domain Graph Information Discovery, supported by NSF Disaster Information Management, supported by DHS, IBM Search patent, Patent Analytics, Find Experts, supported by the Kauffmann Entrepreneurship Center PUBLICATIONS List of Publications Publications from DBLP RECENT PROFESSIONAL ACTIVITIES Applied Track Co-Chair: 26th IEEE International Conference on Data Mining (ICDM) 2026 Area Chair: ACM Special Interest Group on Knowledge Discovery and Data Mining (SIGKDD) 2025 Local Arrangements Co-Chair, IEEE International Conference on Data Engineering (ICDE) 2023 Recent Program Committee Member: Area Chair SIGKDD 2025, Area Chair SIGKDD 2024, SIGMOD 2025, EDBT 2024, SPC SIGKDD 2023, SIGMOD 2024 SELECTED PRESENTATIONS Analysis of Online Health-Related User-Generated Content, Keynote talk at the KDD bigdas 2017 Workshop, Halifax, 2017 Collaborative Tagging for Web Item Design and Health Data Management Research, Microsoft Research, Redmond, 2012 PatentsSearcher: A Novel Portal to Search and Explore Patents. 3rd International Workshop on Patent Information Retrieval, at ACM CIKM 2010, Toronto An Access Cost-Aware Approach for Object Retrieval over Multiple Sources, VLDB 2010, Singapore Information Discovery on Vertical Domains, Invited talk, University of Waterloo, Canada, June 2010. Variants of this talk also given at Free University of Bolzano, Roma University Tre, University of Athens, Yahoo! Research Barcelona, and other places. Searching and Exploring Biomedical Data, Invited talk, Indiana University Medical School, June 2010 CADS: A Collaborative Adaptive Data Sharing Platform. VLDB Workshop on Personalized Access, Profile Management, and Context Awareness in Databases (PersDB 2009), Lyon, France, August 2009 Experiences on Processing Spatial Data with MapReduce. 21st International Conference on Scientific and Statistical Database Management (SSDBM), New Orleans, 2009 IN THE NEWS July 2023: Our JMIR paper on ChatGPT vs. Google for Dementia Patients  was featured in: UCR News, Science Daily, News Nine, Bizz Buzz, Newswise June 2021: Our JMIR paper on dementia chatbots was covered by UCR News, MedicalXpress, HealthITAnalytics. November 2019: Our JMIR paper on e-cigarettes was covered by UCR News, SciTechDaily, Leafly. August 2019: A story on our new NSF grant on joint search on multimodal data sources: https://news.ucr.edu/articles/2019/08/20/when-disaster-strikes-search-website-first-responders-will-save-lives, EMS1 February 2019: Our work on the effect of universities and hospitals to the real estate market was featured in UCR News, Eureka Alert, Study International News. October 2018: Vagelis Hristidis featured in the list of the 45 top scientists of Greek origin under 45 years old, by the most popular Greek newspaper. October 2017: A Reuters article mentions our work on patient online reviews vs. insurance plan ratings. June 2016: Our paper on the analysis of the content of social media along demographic groups was featured in: UCR News, Health Data Management, Science Daily, MedicalXpress. August 2015: Our paper on the demographics of health-related social media users was presented on several media outlets such as: Fox 10 TV (including video), technology.org, FierceHealthcare.com, EndoNurse and ScienceDaily. June 2015: Twitter and Stock Trading: A Real Strategy? at Investopedia.com August 2014: Interesting Twitter aggregate findings on the 2014 Brazil World Cup: Phys.Org June 2014: Our Health Social Analytics and Social Predictor sites are up and running, and are extensively described in several online media: NSF News, Communications of the ACM, Science X, HealthCanal, The Mary Sue, Science 2.0 May 2014: Our work on analyzing drugs-related chatter on social media: Press-News, Medical Express, Redorbit, AccessRX, Times of India, Science Blog March 2012: Our research on the relationship between Twitter and financial data: Forbes, The Washington Post, The NY Times, Yahoo!, Press-Enterprise, The Times, The Telegraph, The Independent, Daily Mail (UK), La Republicca (Italy), Univision TV, NewsTalk 92.5 FM and AM 1530 KFBK, Univision TV, NewsTalk 92.5 FM and AM 1530 KFBK, Computing Research Association OTHER Check out a new cool company (ktau.ai) from my friends doing interesting work on Generative Engine Optimization (GEO).",
  "content_length": 7657,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:16"
}