{
  "name": "Vaggos Chatziafratis",
  "homepage": "https://cs.stanford.edu/~vaggos",
  "status": "success",
  "content": "Vaggos Chatziafratis Vaggos (Evangelos) Chatziafratis vaggos at cs.stanford.edu OR vaggos at ucsc.edu (check also my Google Scholar) As of July 2021, I've joined UC Santa Cruz as an Assistant Professor in the CSE department. During the academic year 2021-2022 (on leave), I was a postdoc at Northwestern mentored by Samir Khuller, Aravindan Vijayaraghavan and Kostya Makarychev. In January 2022, I joined MIT/Northeastern as a FODSI fellow. Prior to this, I had spent a wonderful year at Google Research in New York hosted by Mohammad Mahdian and Vahab Mirrokni. I received my PhD in Computer Science from Stanford University, where I had the privilege to be advised by Tim Roughgarden and co-advised by Moses Charikar. My thesis was on Hierarchical Clustering. Prior to Stanford, I received my Diploma in EECS from the National Technical University of Athens, Greece. Recent News/Talks January'23: Paper accepted to ICLR as an oral presentation (top 5%). January'23: Teaching CSE102: Introduction to Analysis of Algorithms. September'22: Teaching CSE290A: Topics in Algorithms (Clustering, SDPs, Hierarchical Clustering, Hardness). April'22: Invited talk at IDEAL Clustering Workshop, on Hierarchical Clustering (Video) . March'22: Talk at Piotr Indyk's group at MIT, on Hierarchical Clustering. November'21: Talk at Northwestern CS Seminar, on Deep Learning through the lens of Dynamical Systems. October'21: Talk at UC Irvine CS Seminar, on Hierarchical Clustering. October'21: Talk at Northwestern CS Seminar, on Hierarchical Clustering. July'21: Joined UC Santa Cruz. If you like my research, apply to our MS/PhD program. Older News/Talks October'20: Invited talk at Harvard's CS for Mathematicians seminar. October'20: Invited lecture based on ICLR'20 and ICML'20 at Northeastern's Special Topics in Deep Learning class. October'20: Presenting recent work on Aggregating Inconsistent Information at the Michigan-Purdue Theory seminar. September'20: New paper at NeurIPS'20 on Hyperbolic Hierarchical Clustering. July'20: Talk at Stanford's Theory/ML groups for our ICLR'20 and ICML'20 papers on depth/width tradeoffs. July'20: Started at Google Research New York as a Visiting Faculty Researcher in the market algorithms group. January'20: Talk at Google Zurich (host: Silvio Lattanzi) on DNN's depth separation results via dynamical systems. September'19: PapaFest is coming to Columbia for us to celebrate Christos Papadimitriou 70th birthday. June'19: Visit to Phoenix, Arizona for FCRC and to present our COLT paper. April'19: AISTATS and visit to Tokyo Institute of Technology to present our paper to their AI & Web Mining lab. March'19: Excited to present our work at Columbia's Theory Seminar. March'19: Excited to present our work at Corelab's Theory Seminar, NTUA, Greece. February/March'19: Visiting Ioannis Panageas at Singapore's SUTD to present our recent results. February'19: Talk on Hierarchical Clustering in Facebook's Computer Vision group, Menlo Park. February'19: Talk on the Computational Power of Online Gradient Descent in Stanford's Theory and ML groups. Summer'19: Joined Google NY for a summer internship under Mohammad Mahdian and Vahab Mirrokni. December'18: Talk on Hierarchical Clustering at Google Zurich and ETH Zurich algorithms seminar. Ph.D. Dissertation Hierarchical Clustering with Global Objectives: Approximation Algorithms and Hardness Results Evangelos (Vaggos) Chatziafratis, Stanford University, June 2020 Committee: Tim Roughgarden (Adviser), Moses Charikar (Co-Adviser), Li-Yang Tan, Greg Valiant, Jan Vondrak (Chair) Working Papers Learning on Trees with Ordinal Constraints. Vaggos Chatziafratis, Tasos Sidiropoulos. work in progress. Hierarchical Clustering with Geometric Diversity via Greedy Volume Minimization. Vaggos Chatziafratis, Insu Han. work in progress. All Publications (also see my Google Scholar) The Complexity of Finding Local Optima in Contrastive Learning. Jingming Yan*, Yiyuan Luo*, Vaggos Chatziafratis, Ioannis Panageas, Parnian Shahkar, Stelios Andrew Stavroulakis.NeurIPS 2025, 39th Conference on Neural Information Processing Systems, San Diego, CA, December 2025. Accelerating data-driven algorithm selection for combinatorial partitioning problems. Vaggos Chatziafratis, Ishani Karmarkar, Yingxi Li, Ellen Vitercik.NeurIPS 2025 (Spotlight), 39th Conference on Neural Information Processing Systems, San Diego, CA, December 2025. Welfare Approximation in Additively Separable Hedonic Games. Martin Bullinger, Vaggos Chatziafratis, Parnian Shahkar.AAMAS 2025, 24th International Conference on Autonomous Agents and Multiagent Systems, Detroit, Michigan, May 2025. Embedding Dimension of Contrastive Learning and k-Nearest Neighbors. Dmitrii Avdiukhin, Vaggos Chatziafratis, Orr Fischer, Grigory Yaroslavtsev.NeurIPS 2024, 38th Conference on Neural Information Processing Systems, Vancouver, Canada, December 2024. Approximation Scheme for Weighted Metric Clustering via Sherali-Adams. Dmitrii Avdiukhin, Vaggos Chatziafratis, Konstantin Makarychev, Grigory Yaroslavtsev.AAAI 2024 (Oral talk), 38th AAAI Conference on Artificial Intelligence, Vancouver, Canada, February 2024. Dimension-Accuracy Tradeoffs in Contrastive Embeddings for Triplets, Terminals & Top-k Nearest Neighbors. Vaggos Chatziafratis, Piotr Indyk. SOSA@SODA 2024, 7th ACM-SIAM Symposium on Simplicity in Algorithms, Alexandria, Virginia, January 2024. Triplet Reconstruction and all other Phylogenetic CSPs are Approximation Resistant. Vaggos Chatziafratis, Konstantin Makarychev. FOCS 2023, 64th IEEE Symposium on Foundations of Computer Science, Santa Cruz, California, November 2023. Efficiently Computing Nash Equilibria in Adversarial Team Markov Games. Fivos Kalogiannis, Ioannis Anagnostides, Ioannis Panageas, Manolis Vlatakis, Vaggos Chatziafratis, Stelios Stavroulakis. ICLR 2023 (Oral talk), 11th International Conference on Learning Representations, Kigali, Rwanda, May 2023. On Scrambling Phenomena for Randomly Initialized Recurrent Networks. Vaggos Chatziafratis, Ioannis Panageas, Clayton Sanford, Stelios Andrew Stavroulakis. NeurIPS 2022, 36th Conference on Neural Information Processing Systems, New Orleans, Louisiana, December 2022. Hierarchical Clustering in Graph Streams: Single-Pass Algorithms and Space Lower Bounds. Sepehr Assadi, Vaggos Chatziafratis, Jakub ÅÄ cki, Vahab Mirrokni, Chen Wang. COLT 2022, 35th Annual Conference on Learning Theory, London, UK, July 2022. Expressivity of Neural Networks via Chaotic Itineraries beyond Sharkovsky's Theorem. Clayton Sanford, Vaggos Chatziafratis. AISTATS 2022, 25th International Conference on Artificial Intelligence and Statistics, virtual. Adversarially Robust Low Dimensional Representations. Pranjal Awasthi, Vaggos Chatziafratis, Xue Chen, Aravindan Vijayaraghavan. COLT 2021, 34th Annual Conference on Learning Theory, Boulder, Colorado, August 2021. Maximizing Agreements for Ranking, Clustering and Hierarchical Clustering via MAX-CUT. Vaggos Chatziafratis, Mohammad Mahdian, Sara Ahmadian. AISTATS 2021, 24th International Conference on Artificial Intelligence and Statistics, virtual. Hierarchical Clustering via Sketches and Hierarchical Correlation Clustering. Danny Vainstein*, Vaggos Chatziafratis*, Gui Citovski, Anand Rajagopalan, Mohammad Mahdian, Yossi Azar. AISTATS 2021, 24th International Conference on Artificial Intelligence and Statistics, virtual. From Trees to Continuous Embeddings and Back: Hyperbolic Hierarchical Clustering. Ines Chami, Vaggos Chatziafratis, Albert Gu, Christopher Re. NeurIPS 2020, 34th Conference on Neural Information Processing Systems, virtual, December 2020. Inapproximability for Local Correlation Clustering and Dissimilarity Hierarchical Clustering. Vaggos Chatziafratis, Neha Gupta, Euiwoong Lee. IPL 2020, (Journal), Information Processing Letters (minor revision). Better Depth-Width Trade-offs for Neural Networks through the lens of Dynamical Systems. [15min ICML Talk] Vaggos Chatziafratis, Sai Ganesh Nagarajan, Ioannis Panageas. ICML 2020, 37th International Conference on Machine Learning, virtual, July 2020. Bisect and Conquer: Hierarchical Clustering via Max-Uncut Bisection. Sara Ahmadian, Vaggos Chatziafratis, Alessandro Epasto, Euiwoong Lee, Mohammad Mahdian, Konstantin Makarychev, Grigory Yaroslavtsev. AISTATS 2020, 23rd International Conference on Artificial Intelligence and Statistics, Palermo, Italy, June 2020. Depth-Width Trade-offs for ReLU Networks via Sharkovsky's Theorem. [5min ICLR Spotlight] Vaggos Chatziafratis, Sai Ganesh Nagarajan, Ioannis Panageas, Xiao Wang. ICLR 2020 (Spotlight talk), 8th International Conference on Learning Representations, Addis Ababa, Ethiopia, April 2020. Bilu-Linial stability, Certified Algorithms and the Independent Set problem. Haris Angelidakis, Pranjal Awasthi, Avrim Blum, Vaggos Chatziafratis, Chen Dan. ESA 2019, 27th European Symposium on Algorithms, Munich, Germany, September 2019. On the Computational Power of Online Gradient Descent. Vaggos Chatziafratis, Tim Roughgarden, Joshua R. Wang. COLT 2019, 32nd Annual Conference on Learning Theory, Phoenix, Arizona, June 2019. Hierarchical Clustering for Euclidean Data. Moses Charikar, Vaggos Chatziafratis, Rad Niazadeh, Grigory Yaroslavtsev. AISTATS 2019, 22nd International Conference on Artificial Intelligence and Statistics, Naha, Okinawa, Japan, April 2019. Hierarchical Clustering better than Average-Linkage. Moses Charikar, Vaggos Chatziafratis, Rad Niazadeh. SODA 2019, 30th ACM-SIAM Symposium on Discrete Algorithms, San Diego, California, January 2019. Hierarchical Clustering with Structural Constraints. [10min ICML Talk] Vaggos Chatziafratis, Rad Niazadeh, Moses Charikar. ICML 2018, 35th International Conference on Machine Learning, Stockholm, Sweden, July 2018. Attack vulnerability of power systems under an equal load redistribution model. Talha Cihad Gulcu, Vaggos Chatziafratis, Yingrui Zhang, and Osman Yağan. ToN 2018 (Journal), IEEE/ACM Transactions on Networking, 26(",
  "content_length": 12631,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:16"
}