{
  "name": "Vahid Tarokh",
  "homepage": "https://people.duke.edu/~vt45",
  "status": "success",
  "content": "Vahid Tarokh's Home Page Vahid Tarokh's Home Page Contact Information: Vahid Tarokh The Rhodes Family Professor of Electrical and Computer Engineering Wilkinson Engineering Building Room 425 305 Teer Engineering Building Box 90271 Durham, NC 27708 U.S.A. E-mail: vahidtarokhacademic (at) gmail (dot) com Short Biography Advising Information: Current Students and Postdocs Former Postdoctoral Fellows and Their Positions Former PhD Students and Their Positions Former M.S./M.Eng. Students Undergrad Thesis Students and Summer High School Students Supervised Graduate Students Supervised in Other Capacity Theses Examined My Lab, Open Positions Postdoctoral Positions Available at My Lab Information for Perspective Graduate Students Research Our current research is in Foundations of AI (pursuing new mathematical formulations and approaches to getting the most out of datasets). We invent new mathematical methodologies, and demonstrate them (by numerical simulations) in various scenarios of interest. Although our research is mainly mathematical, nevertheless we look for mathematical nuggets that may lead to new applications. In other words, we may not necessarily build any systems, but make algorithms/mathematical constructions that may be used in future systems. I note that, over years, I and my group have worked and published in diverse areas such as communications and networking, machine learning, statistics, signal processing, material science, astronomy, applied and pure mathematics, and neuroscience as evident from samples of our published work below. Current projects are focused on representation, modeling, inference and prediction from data such as predicting rare events from small amounts of data, formulation and calculation of limits of learning from observations, and determining how the insects brains represent and encode their environments for agile decision making. You need to know and be willing to learn more math if you want to join our group. Some members of our group have no electrical engineering or any engineering degrees at all. We have members with backgrounds in astronomy, applied mathematics, pure mathematics, statistics, physics, electrical engineering and aero-astro engineering. So in every way, we are diverse! Our typical papers usually include theorems and proofs. But we do not call ourselves \"pure mathematicians\". That said in some cases, we have invented new pure mathematical results in the past. Some of Our Recent Papers (by area) Machine Learning Statistics and Modeling Signal Processing Optimization and Control Material Science/Physics Astronomy Mathematics Neuroscience Some of Our Older Papers (by area) Compressed Sensing and Sparse Representation Biomedical Engineering Communications Netwroks Wireless Communications Shannon Theory",
  "content_length": 2801,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:19"
}