{
  "name": "Vaibhav V. Unhelkar",
  "homepage": "https://unhelkar.github.io/index.html",
  "status": "success",
  "content": "Vaibhav Unhelkar Vaibhav V. Unhelkar Assistant Professor of Computer Science at Rice University vaibhav.unhelkar@rice.edu I am an Assistant Professor of Computer Science at Rice University. My vision is to develop computational foundations for designing artificially intelligent systems (e.g., robots and decision-support aids) that enhance human capability. Towards this vision, I lead the Human-Centered AI and Robotics (HCAIR) group at Rice CS. The HCAIR group conducts research in the areas of human-robot interaction (HRI), interactive machine learning, and human-AI collaboration. Ongoing research in the group includes development of learning algorithms and interactive systems to model human behavior, train human-robot teams, and explain behavior of AI-enabled systems. My computational research is informed by the opportunities of introducing artificially intelligent systems in the real world. In collaboration with industry partners, I co-designed and deployed the first mobile robot capable of working alongside humans on the conveyor belts of automotive factories. During my academic training, I have worked on a nano-satellite and autonomous aerial vehicles. In my ongoing research, I am working on applications of robotics and human-AI collaboration in healthcare and disaster response. For more details, please see my research group’s webpage and publications. If you are a prospective student or post-doctoral researcher: First, thanks for your interest in my research. Please read this page for more information. Highlights Prospective Students and Post-Doctoral Researchers: We are hiring! Please read this page for more information. Stay tuned for our recently accepted paper at the International Conference on Autonomous Agents and Multi-agent Systems (AAMAS 2023) on automated interventions to improve teamwork. I am serving as the program co-chair for the IEEE International Conference on Advanced Robotics and its Social Impacts (ARSO 2023). Please submit your best work on the social impacts of robotics soon; papers are due on January 31. I am leading a panel on Challenges and Opportunities of Robotics in Healthcare at the 4th IFAC Workshop on Cyber-Physical Human Systems (CPHS 2022). Please register at the earliest and join us in Houston on December 1, 2022 for the discussions.",
  "content_length": 2310,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:17"
}