{
  "name": "Vaibhav Bajpai",
  "homepage": "https://vaibhavbajpai.com",
  "status": "success",
  "content": "Vaibhav Bajpai | Homepage Prof. Dr. Bajpai home . people . papers . teaching Prof. Dr. Vaibhav Bajpai Hasso Plattner Institute 14482 Potsdam, Germany [email protected] Secretariat: Svenja Fenn [email protected] Google Scholar People Postdoctoral Fellows: Dr. Newton Masinde . Dr. Sonal Khosla . Dr. Vasilis Ververis PhD Students: Robert Richter . Jan Riedler Student Assistants: Kahira Kalbhor . Johannes Peters Jannis Hajda . Felix Hoffmann . Ingunn Fløvig Masters Students: Kevin Klein . Jakob Bork Leadership Lead Organiser: 2021 Dagstuhl #21272 2018 Dagstuhl #18412 PC Chair: 2024 PAM 2021 TMA Recent Service PC Member: 2026 IMC 2025 IMC 2024 IMC 2024 USENIX NSDI complete list → Recent Teaching 2025/26 Lecture Course: Introduction to Internet Measurements 2025/26 Lecture Course: Technical and Legal Responses to Internet Hate Crimes 2025/26 Project Seminar: Reproducing Internet Measurement Research 2025/26 Masters Project: Detecting and Countering Online Hate Speech 2025 Lecture Course: Modern and Secure Internet: Design and Operations 2025 Project Seminar: Trends in Internet Measurements complete list → Tools doe-hunter → A tool to discover, query, and analyze DDR and encrypted DNS protocols. aviator → A drone traffic generator. dtube-app → An Android app to compare the video streaming performance of a decentralised video streaming service (DTube) and YouTube wepr → A tool designed for the SamKnows probes to measure web latency and web complexity metrics. It offloads Javascript execution to a parsing server to measure rendering performance. weblar → A tool designed for the MONROE probes to measure web latency, above the fold (ATF) and rendering performance. youtube → A tool to measure youtube performance on the command line. simweb → A tool to measure similarity of webpages delivered over IPv4 and IPv6 nfql → An implementation of the network flow query language (NFQL) happy → A happy eyeballs [RFC 6555] probing tool ncclient → A Python library for NETCONF clients. I am looking for Postdocs and PhD Students. Hasso Plattner Institute + University of Potsdam, Germany Professor and Head of the Research Group: Data-intensive Internet Computing Co-Speaker of the Research School: Secure Distributed Computing timeline → Research Awards 2023IFIP Networking 2023 Best Paper Award 2019Best of CCR award at ACM SIGCOMM 2019 2018ACM SIGCOMM 2018 Best Paper Award 2017IEEE CNOM Best Dissertation Award at IM 2017 Teaching Awards 2020 Preis für die beste Lehre 2019 (Award for Best Teaching) Awarded by the Faculty of Computer Science, Technische Universität München Research Themes Internet Architecture TON'19 SIGCOMM CCR'17 NETWORKING'15 PAM'15 Secure and Privacy-Enhancing Technologies IMC'22 PETS'25 TNSM'24 PAM'26 SIGCOMM CCR'23 PAM'22 PAM'21 Internet Resiliency SIGCOMM CCR'22 TNSM'24 NETWORKING'23 Digital Sovereignty TOIT'22 IC-CS'22 NETWORKING'21 NETWORKING'20 Internet Routing and Congestion SIGCOMM'18 COMMAG'19 NETWORKING'22 PAM'18 Web and Video Content Delivery INFOCOM'20 TNSM'22 TNSM'19 PAM'19 NETWORKING'24 NETWORKING'18 Networked Mobility IMC'22 MOBICOM'18 INFOCOM'21 COMST'22 TMC'21 T-ITS'22 Internet Infrastructure, Operations and Management SIGCOMM CCR'17 TNSM'21 TNSM'17 NETWORKING'23 NETWORKING'22 Internet Sustainability and Reproducibility SIGCOMM CCR'19 SIGCOMM CCR'22 SIGCOMM CCR'18 Internet Measurement Platforms and IETF Standardisation COMST'15 SIGCOMM CCR'15 RFC 8194 Recent Publications The Future of DNS Privacy: A Comparison of DNS over QUIC and DNS over HTTP/3 P Bielefeld, F. Hoffmann, S.Sassalla, V.Ververis, V.Bajpai Passive and Active Measurement Conference Online, March 2026 [31%, 18/57] PAM '26 pdf slides Path to Encrypted DNS with DDR: Adoption, Configuration Patterns, and Privacy Implications V.Ververis, S.Sassalla, V.Bajpai Privacy Enhancing Technologies Symposium Washington DC, July 2025 [26%, 169/644] PETS '25 pdf slides ietf Breaking Through the Clouds: Performance Insights into Starlink's Latency and Packet Loss R.Richter, V.Ververis, V.Bajpai IFIP Networking Conference, June 2025 IFIP NETWORKING '25 pdf slides A First Look on Discovery of Designated Resolvers S.Sassalla, V.Ververis, V.Bajpai IFIP Networking Conference, June 2025 IFIP NETWORKING '25 full list by year → Recent Talks The Critical Connection: Internet Measurements and Digital Health Digital Health Partnership Workshop Hasso Plattner Institute, Potsdam, November 2025 Keynote Talk video Building Data-Intensive Foundations of a Modern Internet Hasso Plattner Institute, Potsdam, June 2025 Hasso Plattner Institute New York, USA, July 2024 GI SYS Meeting, Stuttgart, October 2024 Inaugural Lecture pdf video Measuring the State of DNS Privacy: Past, Present and Future DENOG, Berlin, November 2024 Coseners House, UK, July 2024 pdf Towards Digital Sovereignty in the Age of Hyper-giants TMA Keynote Enschede, June 2022 Keynote Talk pdf video Towards Digital Sovereignty in the Age of Hyper-giants University of Cambridge, UK Remote, March 2022 complete list → Selected Publications pdf ietf A Longitudinal View of Dual-stacked Website: Failures, Latency and Happy Eyeballs Vaibhav Bajpai, Jürgen Schönwälder IEEE/ACM Transactions on Networking April 2019 [Impact Factor: 3.11] TON '19 IEEE CNOM Best Dissertation Award pdf slides Inferring Persistent Interdomain Congestion A. Dhamdhere, D. Clark, A. Gamero-Garrido, M. Luckie, R. Mok, G. Akiwate, K. Gogia, V. Bajpai, A. Snoeren, k. claffy ACM SIGCOMM Conference Budapest, August 2018 [18%, 40/222] SIGCOMM '18 Best Paper Award pdf slides The Dagstuhl Beginners Guide to Reproducibility for Experimental Networking Research V.Bajpai, A.Brunstrom, A.Feldmann, W.Kellerer, A.Pras, H.Schulzrinne, G.Smaragdakis, M.Wählisch, K.Wehrle ACM Computer Communication Review (CCR), January 2019 (Editorial) SIGCOMM CCR '19 Best of CCR pdf slides ietf ripe Web Privacy by Design: Evaluating Cross-Layer Interactions of QUIC, DNS and H/3 J.Sengupta, M.Kosek, J.Fries, P.Dikshit, V.Bajpai IFIP Networking Conference (Extended to TNSM 2024) Barcelona, June 2023 [27.8%, 53/190] IFIP NETWORKING '23 Best Paper Award pdf video ietf ripe DNS Privacy with Speed? Evaluating DNS over QUIC and its Impact on Web Performance M. Kosek, L. Schumann, TV. Doan, R. Max, V.Bajpai ACM Internet Measurement Conference (IMC) October 2022 [26.4%, 56/212] IMC '22 pdf slides Path to Encrypted DNS with DDR: Adoption, Configuration Patterns, and Privacy Implications V.Ververis, S.Sassalla, V.Bajpai Privacy Enhancing Technologies Symposium Washington DC, July 2025 [26%, 169/644] PETS '25 pdf video Analyzing Real-time Video Delivery over Cellular Networks for Remote Piloting Aerial Vehicles A. Baltaci, H. Cech, N. Mohan, F. Geyer, V. Bajpai, J. Ott, D. Schupke ACM Internet Measurement Conference (IMC) October 2022 [26.4%, 56/212] IMC '22 pdf Measuring DNS over TCP in the Era of Increasing DNS Response Sizes: A View from the Edge M. Kosek, TV. Doan, S. Huber, V.Bajpai ACM SIGCOMM Computer Communication Review (CCR) April 2022 [Impact Factor: 2.71] SIGCOMM CCR '22 pdf Recommendations for Designing Hybrid Conferences V.Bajpai O.Hohlfeld, J.Crowcroft, S.Keshav, H.Schulzrinne, J.Ott, S.Ferlin-Reiter, G.Carle, A.Hines, A.Raake ACM SIGCOMM Computer Communication Review (CCR) April 2022 (Editorial) SIGCOMM CCR '22 pdf video Measuring YouTube Content Delivery over IPv6 Vaibhav Bajpai, Saba Ahsan, Jürgen Schönwälder, Jörg Ott ACM SIGCOMM Computer Communication Review (CCR) October 2017 [Impact Factor: 3.81] coverage by APNIC labs → SIGCOMM CCR '17 pdf Dissecting Last-mile Latency Characteristics Vaibhav Bajpai, Steffie Jacob Eravuchira, Jürgen Schönwälder ACM SIGCOMM Computer Communication Review (CCR) October 2017 [Impact Factor: 3.81] SIGCOMM CCR '17 pdf Experience: Implications of Roaming in Europe A. Mandalari, A. Lutu, A. Custura, A. Safari, O. Alay, M. Bagnulo, V. Bajpai, A. Brunstrom, J. Ott, M. Mellia, G. Fairhurst ACM MOBICOM Conference (Experience Paper) New Delhi, October 2018 [22.5%, 42/187] MOBICOM '18 pdf video A Longitudinal View of Netflix: Content Delivery over IPv6 and Content Cache Deployments Trinh Viet Doan, Vaibhav Bajpai, Sam Crawford IEEE INFOCOM Conference Online, April 2020 [19.8%, 268/1354] coverage by APNIC labs → INFOCOM '20 pdf Experimental UAV Data Traffic Modeling and Network Performance Analysis A.Baltaci, M.Klügel, F.Geyer, S.Duhovnikov, V.Bajpai, J.Ott, D.Schupke IEEE INFOCOM Conference Online, July 2021 [19.9%, 252/1266] INFOCOM '21 pdf video Lessons Learned from using the RIPE Atlas Platform for Measurement Research Vaibhav Bajpai, Steffie Jacob Eravuchira, Jürgen Schönwälder ACM Computer Communication Review (CCR), July 2015 (Editorial) SIGCOMM CCR '15 pdf A Survey on Cooperative Architectures and Maneuvers for Connected and Automated Vehicles Bernhard Häfner, Vaibhav Bajpai, Jörg Ott, Georg Schmitt IEEE Communications Surveys & Tutorials February, 2022 [Impact Factor: 25.25] COMST '22 pdf A Survey on Internet Performance Measurement Platforms and Related Standardization Efforts Vaibhav Bajpai, Jürgen Schönwälder IEEE Communications Surveys & Tutorials April, 2015 [Impact Factor: 17.2] COMST '15 pdf Measuring Roaming in Europe: Infrastructure and Implications on Users’ QoE. A.Lutu, M.Trevisan, A.Khatouni, A.Mandalari, A.Custura, M.Mellia, Ö.Alay, M.Bagnulo, A.Brunstrom, V.Bajpai, J.Ott, G.Fairhurst IEEE Transactions on Mobile Computing (TMC) February 2021 [Impact Factor: 5.11] TMC '21 pdf Beyond QUIC v1 – A First Look at Recent Transport Layer IETF Standardization Efforts Mike Kosek, Tanya Shreedhar, Vaibhav Bajpai IEEE Communications Magazine April 2021 [Impact Factor: 11.05] COMMAG '21 pdf video Tracing the Path to YouTube - A Quantification of Path Lengths and Latencies towards Content Caches Trinh Viet Doan, Ljubica Pajević, Vaibhav Bajpai, Jörg Ott IEEE Communications Magazine January 2019 [Impact Factor: 10.44] COMMAG '19 pdf On Cross-Layer Interactions of QUIC, Encrypted DNS and HTTP/3: Design, Evaluation and Dataset J.Sengupta, ",
  "content_length": 11909,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:17"
}