{
  "name": "Valerio Pascucci",
  "homepage": "http://www.pascucci.org",
  "status": "success",
  "content": "homepage of Valerio Pascucci Director, Center for Extreme Data Management Analysis and Visualization, Professor, Scientific Computing and Imaging Institute, School of Computing, University of Utah DOE Laboratory Fellow at the Pacific Nothwest National Laboratory, Computational Sciences & Mathematics Division Fax: (801) 585-6513 Email: pascucci@acm.org Web: www.pascucci.org Research interests include: data analysis, topological methods for image segmentation, progressive and multi-resolution techniques for scientific visualization, combinatorial topology, geometric compression, computer graphics, computational geometry, geometric programming, and solid modeling. Erdös number: 3 (via Janos Pach and Herbert Edelsbrunner) Short Bio (full-curriculum-here) Valerio Pascucci is the founding Director of the Center for Extreme Data Management Analysis and Visualization (CEDMAV) of the University of Utah. Valerio is also a Faculty of the Scientific Computing and Imaging Institute, a Professor of the School of Computing, University of Utah, and a DOE Laboratory Fellow, of the Pacific Northwest National Laboratory. Previously, Valerio was a Group Leader and Project Leader in the Center for Applied Scientific Computing at the Lawrence Livermore National Laboratory, and Adjunct Professor of Computer Science at the University of California Davis. Prior to his CASC tenure, he was a senior research associate at the University of Texas at Austin, Center for Computational Visualization, CS and TICAM Departments. Valerio earned a Ph.D. in computer science at Purdue University in May 2000, and a EE Laurea (Master), at the University \"La Sapienza\" in Roma, Italy, in December 1993, as a member of the Geometric Computing Group. Valerio came to the U.S. in 1995 after having grown up in Roma, Italy. Publications (see also on Google Scholar a longer list of my papers and citations of my papers.) Interactive editing of massive imagery made simple: Turning Atlanta into Atlantis. B. Summa, G. Scorzelli, M. Jiang, P.-T. Bremer, and V. Pascucci, ACM Transactions on Graphics (TOG) TOG, Volume 30 Issue 2, 2011, pp. 7:1-7:13. To be presented at SIGGRAPH 2011. Paper. Edge Maps: Representing Flow with Bounded Error. H. Bhatia, S. Jadhav, P.-T. Bremer, G. Chen, J.A. Levine, L.G. Nonato, V. Pascucci, Proceedings of IEEE Pacific Visualization 2011, pp. 75-82,winner of the best paper award. Paper. Parallel Gradient Domain Processing of Massive Images. S. Philip, B. Summa, P.-T. Bremer, and V. Pascucci, Proceedings of the Eurographics Symposium on Parallel Graphics and Visualization 2011, pp. 11-19. Paper. Visual Exploration of High Dimensional Scalar Functions . S. Gerber, P.-T. Bremer, v. Pascucci, and R. Whitaker, IEEE Transactions on Visualization and Computer Graphics 16(6), pp. 1271-1280, 2010. Paper. Interactive Exploration and Analysis of Large Scale Simulations Using Topology-based Data Segmentation. P.-T. Bremer, G. Weber, J. Tierny, V. Pascucci, M. Day, and J. Bell, IEEE Transactions on Visualization and Computer Graphics 99, 2010. Paper. Analyzing and Tracking Burning Structures in Lean Premixed Hydrogen Flames. P.-T. Bremer, G. Weber, V. Pascucci, M. Day, and J. Bell, IEEE Transactions on Visualization and Computer Graphics 16(2), 2010. Paper. Streaming-Enabled Parallel Dataflow Architecture for Multicore Systems. H. T. Vo, D. K. Osmari, B. Summa, J. L. D. Comba, V. Pascucci, and C. T. Silva, Comput. Graph. Forum, 29(3), pp. 1073-1082, 2010, Proceedings of IEEE/VGTC EuroVis 2010. Paper. Topologically Clean Distance Fields. A. Gyulassy, V. Natarajan, Mark Duchaineau , Valerio Pascucci, Eduardo M. Bringa, Andrew Higginbotham, and Bernd Hamann, IEEE Transactions on Visualization and Computer Graphics 13(6), pp. 1432-1439, Proceedings of VIS 2007. Paper. Efficient Computation of Morse-Smale Complexes for Three-dimensional Scalar Functions. A. Gyulassy, V. Natarajan, Valerio Pascucci, and Bernd Hamann, IEEE Transactions on Visualization and Computer Graphics 13(6), pp. 1440-1447, Proceedings of VIS 2007. Paper. Genus Oblivious Cross Parameterization: Robust Topological Management of Intersurface Maps. Janine Bennett, Valerio Pascucci, and Ken Joy, Proceedings of Pacific Graphics 2007 pp. 238-247, IEEE Computer Society, 2007. Paper. Topological Landscapes: A Terrain Metaphor for Scientific Data. Gunther Weber , P.-T. Bremer, and Valerio Pascucci, IEEE Transactions on Visualization and Computer Graphics to appear, Proceedings of VIS 2007. Paper. Robust On-line Computation of Reeb Graphs: Simplicity and Speed. V. Pascucci, G. Scorzelli, P.-T. Bremer, and A. Mascarenhas, ACM Transactions on graphics, pp. 58.1-58.9, 2007, Proceedings of SIGGRAPH 2007. Paper. Abstract. Find undesired tunnels in a 3D model using the Reeb graph (106MB video). Reeb graph of a running horse (7.7MB video). Understanding the Structure of the Turbulent Mixing Layer in Hydrodynamic Instabilities. D. Laney, P.-T. Bremer, A. Mascarenhas, P. Miller, and V. Pascucci, IEEE Transactions on Visualization and Computer Graphics Vol. 12, No. 5, pp. 1053-1060, 2006. Proceedings of IEEE VIS 2006, winner of the best application paper award. Paper. Tracking Bubbles in a Rayleigh-Taylor Instability (48MB video). Invited talk at the Workshop on Ultra-Scale Visualization, Supercomputing 2006. Progressive Volume Rendering of Large Unstructured Grids. S. Callahan, L. Bavoil, V. Pascucci, and C. Silva, IEEE Transactions on Visualization and Computer Graphics Vol. 12, No. 5, pp. 1307-1314, 2006. Proceedings of IEEE VIS 2006. (pdf-paper) Spectral surface quadrangulation. S. Dong, P.-T. Bremer, M. Garland, V. Pascucci, and J. Hart, ACM Transactions on Graphics, Volume 25 , Issue 3, pp.1057-1066qs (July 2006). Proceedings of SIGGRAPH 2006 (pdf-paper) Persistence-Sensitive Simplification of Functions on 2-Manifolds. H. Edelsbrunner, D. Morozov, and V. Pascucci, In Proceeding of the 22-th ACM Symposium on Computational Geometry (SoCG), 2006. (pdf-paper) Streaming Simplification of Tetrahedral Meshes. H. Vo, S. Callahan, P. Lindstrom, V. Pascucci, and C. Silva, IEEE Transactions on Visualization and Computer Graphics, to appear. Topology-based Simplification for Feature Extraction from 3D Scalar Fields A. Gyulassy, V. Natarajan, V. Pascucci, P.-T. Bremer, and Bernd Hamann, IEEE Visualization 2005, pages 275-280, 2005. (pdf-paper) Cache-Oblivious Mesh Layouts S.-E. Yoon, P. Lindstrom, V. Pascucci, and D. Manocha, SIGGRAPH 2005, (ACM Transactions on Graphics), vol 24, n. 3,pages 886--893, 2005. (pdf-paper) (web-page) (source code) Multi-Resolution computation and presentation of Contour Trees V. Pascucci, K. Cole-McLaughlin, and G. Scorzelli, LLNL Technical Report number UCRL-PROC-208680. Preliminary version appeared in the proceedings of the IASTED conference on Visualization, Imaging, and Image Processing (VIIP 2004), 2004, pp.452-290. (pdf-paper) (Linux and windows demo) Local and Global Comparison of Continuous Functions H. Edelsbrunner, J. Harer, V. Natarajan, and V. Pascucci, IEEE Conference on Visualization, 2004, pages 275-280. (pdf-paper) Implicit Occluders S. Pesco, P. Lindstrom, V. Pascucci, and C. Silva, IEEE/SIGGRAPH Symposium on Volume Visualization, 2004, pages 47-54. (pdf-paper) Encoding Volumetric Grids For Streaming Isosurface Extraction A. Mascarenhas, M. Isenburg, V. Pascucci, and J. Snoeyink, In Proceeding of the 2-nd International Symposium on 3D Data Processing, Visualization and Transmission (3DPVT), 2004, to appear. (pdf-paper) Progressive Dimension-Independent Boolean Operations A. Paoluzzi, V. Pascucci, and G. Scorzelli, In Proceeding of the 9-th ACM Symposium on Solid Modeling and Applications (SM04), 2004, pages 203-211. (pdf-paper) (mechanical-piece-avi-animation) (temple-avi-animation) Time-varying Reeb Graphs for Continuous Space-Time Data H. Edelsbrunner, J. Harer, A. Mascarenhas, and V. Pascucci, In Proceeding of the 20-th ACM Symposium on Computational Geometry (SoCG), 2004, pages 366-372. (pdf-paper) Topology Diagram of Scalar Fields in Scientific Visualization V. Pascucci, Chapter 8 in Topological Data Structures for Surfaces, March, 2004. (book-website) Contour Trees and Small Seed Sets for Isosurface Generation M. van Kreveld, R. van Oostrum, C. Bajaj, V. Pascucci and D. Schikore Chapter 5 in Topological Data Structures for Surfaces, March, 2004. (book-website) Isosurface Computation Made Simple: Hardware Acceleration, Adaptive Refinement and Tetrahedral Stripping V. Pascucci, Joint Eurographics - IEEE TVCG Symposium on Visualization (VisSym), 2004, pages 293-300. (pdf-paper) A Multi-resolution Data Structure for Two-dimensional Morse Functions P.-T. Bremer, H. Edelsbrunner, Bernd Hamann, and V. Pascucci, IEEE Conference on Visualization, 2003, pages 139-146. (pdf-paper) (avi-animation, may require Vidomi Player) A Multi-Layered Image Cache for Scientific Visualization E. LaMar, and V. Pascucci, IEEE Symposium on Parallel and Large-DataVisualization and Graphics (PVG), 2003, pages 61-68. (pdf-paper) (pdf-presentation) Geometric Programming for Computer Aided Design A. Paoluzzi, with contributions from V. Pascucci, M.Vicentino, C. Baldazzi, and S. Portuesi John Wiley and Sons, 2003. (pdf-table-of-contetnts) (buy-the-book) (visit-the-PLASM-site) (vrml-S._Stefano_Rotondo) Parallel Computation of the Topology of Level Sets V. Pascucci, K. Cole-McLaughlin, Algorithmica, vol. 38, n. 2, October 2003, pages 249-268. (pdf-paper) Loops in Reeb Graphs of 2-Manifolds K. Cole-McLaughlin, H. Edelsbrunner, J. Harer, V. Natarajan, and V. Pascucci. In Proceeding of the 19-th ACM Symposium on Computational Geometry (SoCG), 2003, pages 344-350. (pdf-paper) (pdf-presentation) Morse Complexes for Piecewise Linear 3-Manifolds H. Edelsbrunner, J. Harer, V. Natarajan, and V. Pascucci,. In Proceeding of the 19-th ACM Symposium on Computational Geometry (SoCG), 2003, pages 361-370. (pdf-paper) (pdf-presentation) Using Graphs for Fast Error Term Approximation of Time-varying Datasets C. Nub",
  "content_length": 25021,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:25"
}