{
  "name": "Valentina Boeva",
  "homepage": "http://boevalab.inf.ethz.ch",
  "status": "success",
  "content": "Boeva Lab | Computational Cancer Genomics | ETH Zurich Our Mission We develop machine learning approaches to explore the transcriptional heterogeneity and plasticity in cancer. Our research bridges computational innovation and cancer biology with a focus on chromatin, transcription, and cancer evolution under treatment. Research Focus Multiscale models for DNA Investigating effects of non-coding variants in cancer. Integration and representation learning AI-driven integration of heterogeneous data for biomarker discovery. Deconvolution of tumor signals Getting insights into tumor heterogeneity from bulk data. Multiomics survival models Predicting patient outcome from multi-model data. Highlighted Projects Modeling Effects of Non-coding Variants Predicting the effects of non-coding variants on chromatin accessibility and enhancer-promoter interactions. [ASAP, UniversalEPI] Cancer-Specific Foundation Model Developing a foundation model for single-cell transcriptomics in cancer. [CancerFoundation] Discovery of Shared Transcriptional States Evaluating methods for discovering common transcriptional states in tumors. [CanSig] Tumor Cell States in EAC Mapping transcriptional states in esophageal adenocarcinoma. [Cell Reports Medicine, 2025] On Filtering Cells with High MT RNA in Cancer Studies Showing that MT RNA-high cells in scRNA-seq are a viable, metabolically altered cell population. [Genome Biology, 2025] DNA Methylation as a Field Cancerization Marker Discovering DNA methylation changes in healthy tissue near colorectal polyps. [JNCI, 2024] Survival Modeling with Knowledge Distillation Fitting sparse survival models using deep model distillation. [Bioinformatics, 2024] Multi-omics Model Robustness Revealing the vulnerability of survival models to data noise. [Cell Reports Methods, 2023] We offer Bachelor's and Master's student projects in machine learning, bioinformatics, and cancer research. See opportunities →",
  "content_length": 1945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:23"
}