{
  "name": "Valencia Koomson",
  "homepage": "https://engineering.tufts.edu/cs/people/faculty/valencia-koomson",
  "status": "success",
  "content": "Valencia Koomson | Department of Computer Science Advanced Integrated Circuits and Systems Lab Full Profile Career Highlights / Publications Research Professional Activities Courses / Teaching Activities Valencia Koomson Associate Professor, Electrical and Computer Engineering Associate Professor, Tisch College Associate Professor, Computer Science (617) 627-2291 valencia.koomson@tufts.edu 171 College Avenue Full Profile (facultyprofiles.tufts.edu) Advanced Integrated Circuits and Systems Lab Full Profile Career Highlights / Publications Research Professional Activities Courses / Teaching Activities Research/Areas of Interest design of silicon-based mixed-mode VLSI systems (analog, digital, RF, optical), analog signal processing, and optoelectronic system-on-chip modeling and integration for applications in optical wireless communication and biomedical imaging Education Ph.D., University of Cambridge, Cambridge, United Kingdom, 2003M.Phil., University of Cambridge, United Kingdom, 2000M.Eng., Massachusetts Institute of Technology, Cambridge, United States, 1999B.S., Massachusetts Institute of Technology, Cambridge, United States, 1998 Biography Valencia Koomson is an associate professor in the Department of Electrical and Computer Engineering at Tufts School of Engineering. Prior to joining Tufts, she held an appointment as a VLSI research engineer at the University of Southern California's Information Sciences Institute (USC/ISI), where she performed research on the design of radiation-hardened analog/mixed signal VLSI systems in CMOS for military and space applications. Koomson is a former Marshall Scholar, Intel Foundation Scholar, National Science Foundation Graduate Research Fellow, and recipient of the NSF Faculty Early Career Development (CAREER) Award.Valencia Koomson's research interests include the design of silicon-based mixed-mode VLSI systems (analog, digital, RF, optical), analog signal processing, and optoelectronic system-on-chip modeling and integration for applications in optical wireless communication and biomedical imaging.",
  "content_length": 2079,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:22"
}