{
  "name": "Valeria Bertacco",
  "homepage": "http://web.eecs.umich.edu/~valeria",
  "status": "success",
  "content": "Valeria Bertacco research teaching Bertacco lab press software Mary Lou Dorf Professor Arthur F. Thurnau Professor Computer Science & Engineering BBB4645 - Computer Engineering Lab Bob and Betty Beyster Building University of Michigan 2260 Hayward Avenue Ann Arbor, MI 48109-2121 734 615.4047 Executive Assistant: Alice Melloni, alicemel@umich.edu 734 936.8875, BBB4644 Highlighted Presentations DATE 2022 Opening Keynote - Valeria Bertacco - What is Beyond AI Democratizing Computer Hardware Design 2020 SJTU Commencement Address ISCA 2020 Keynote Research Centers Valeria is the Director of the Applications Driving Architectures (ADA) Research Center. Brief Biography Valeria Bertacco is Thurnau Professor of Electrical Engineering and Computer Science at the University of Michigan, and Adjunct Professor of Computer Engineering at the Addis Ababa Institute of Technology. Her research interests are in the area of computer design, with emphasis on specialized architecture solutions and design viability, in particular reliability, validation, and hardware-security assurance. Her research endeavors are supported by the Applications Driving Architectures (ADA) Research Center, which Valeria directs. The ADA Center, supported by a consortium of semiconductor companies, has the goal of reigniting computing systems design and innovation for the 2030-2040s decades, through specialized heterogeneity, domain-specific language abstractions and new silicon devices that show benefit to applications. Valeria joined the University of Michigan in 2003. She currently serves as the Vice Provost for Engaged Learning at the University of Michigan, supporting all co-curricular engagements and international partnerships for the institution, and facilitating the work of nine central units, whose goals range from promoting environmental sustainability, to journalism, and to the promotion of the arts in research universities. Research interests Valeria's research interests are centered in the creation of novel solutions that enable the sustainable development of silicon systems, by making them more energy-efficient, performant and significantly cheaper to design and manufacture. Throughout her career she has worked on algorithmic and heuristic solutions to deliver low-cost and effective functional and formal correctness in the design of complex digital systems, reliability from silicon failures, and protection from hardware security attacks. Her solutions span both design-time methodologies and runtime solutions that augment the system with small hardware components monitoring and detecting situations of concern. Most recently her research focus has been on the design of specialized hardware to accelerate key future applications, ranging from map-reduce applications, to graph-based applications, and to explainable artificial intelligence kernels, with operating frameworks spanning both server and server-edge distributed computation. Her work on hardware security has gained focus in augmenting her solutions with data privacy guarantees. Extended Biography Valeria Bertacco is Thurnau Professor of Electrical Engineering and Computer Science at the University of Michigan, and Adjunct Professor of Computer Engineering at the Addis Ababa Institute of Technology. Her research interests are in the area of computer design, with emphasis on specialized architecture solutions and design viability, in particular reliability, validation, and hardware-security assurance. She joined the University of Michigan in 2003, after working with the Advanced Technology Group of Synopsys, which she joined via the acquisition of Systems Science Inc. Her research endeavors are supported by the Applications Driving Architectures (ADA) Research Center, which Valeria directs. The ADA Center's goal is to reignite computing systems design and innovation for the 2030-2040s decades, through specialized heterogeneity, domain-specific language abstractions and new silicon devices that show benefit to applications. The Center is a multi-institutional endeavor engaging 20 faculty members and over 120 graduate students. It is supported by SRC, a consortium of semiconductor companies. In her service to the research community, she has served as the Program Chair of the Design Automation Conference (DAC), Track Chair of the Design Automation and Test in Europe (DATE) Conference, and as Associate Editor of the IEEE Transactions on Computer-Aided Design. Valeria currently serves as the Vice Provost for Engaged Learning at the University of Michigan, supporting all co-curricular engagements and international partnerships for the institution, and facilitating the work of nine central units, whose goals range from promoting environmental sustainability, to journalism, and to the promotion of the arts in research universities. The University of Michigan is the top institution among the Big Ten conference, and the fourth nationally, for the number of students pursuing international experiences. Domestically, the primary partners reside within the State of Michigan, and especially within the City of Detroit. Valeria received her M.S. and Ph.D. degrees in Electrical Engineering from Stanford University in 1998 and 2003; and a Computer Engineering degree (\"Dottore in Ingegneria\") summa cum laude from the University of Padova, Italy in 1995. She is the recipient of the IEEE CEDA Early Career Award, NSF CAREER award, the Air Force Office of Scientific Research's Young Investigator award and the IBM Faculty Award. From the University of Michigan, she received the Vulcans Education Excellence Award, the Herbert Kopf Service Excellence Award, the Sarah Goddard Power Award for contribution to the betterment of women, the Rackham Faculty Recognition Award and the Harold Johnson Diversity Service Award. From the University of Padova she received the Elvira Poli Engineering Alumni Award in 2021. Valeria is an ACM Distinguished Scientist and an IEEE Fellow. Current time in Michigan: Thursday, 19-Sep-2024 12:48:00 EDT",
  "content_length": 6037,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:24"
}