{
  "name": "Valeriia Haberland",
  "homepage": "https://www.brunel.ac.uk/people/valeriia-haberland",
  "status": "success",
  "content": "Dr Valeriia Haberland | Introduction | Brunel University London Skip to Content Home People Dr Valeriia Haberland Dr Valeriia HaberlandLecturer in Computer Science Email: valeriia.haberland@brunel.ac.uk Google Scholar LinkedIn ResearchGate Scopus Web of science Computer Science College of Engineering, Design and Physical Sciences Summary I have been appointed as Lecturer in Computer Science in 2023. My research interests lie in the intersection of computing and biological sciences. Currently, I'm interested in modelling and predicting cancer aggressiveness based on the available molecular profiles using the state-of-the-art machine learning techniques. My other interests also include epidemiological causal inference to find associations between genetically translatable factors and disease outcomes. Developing the web applications and underlying infrastructure to support further research in these areas are also of interest. Qualifications PhD in Computer Science, King's College London (2015) Fellow HEA (FHEA) - awarded in Oct 2023. Newest selected publications Buhigas, C., Warren, AY., Leung, WK., Whitaker, HC., Luxton, HJ., Hawkins, S., Kay, J., Butler, A., Xu, Y., Woodcock, DJ., Merson, S., Frame, FM., Sahli, A., Abascal, F., Gihawi, A., Lambert, A., Thompson, A., Futreal, A., Menzies, A., Baddage, A., Ng, A., Sahil, A., Kremeyer, B., Al-Lazikani, B., Massie, C., Greenman, C., Ogden, C., Verrill, C., Fisher, C., Berney, D., Burns, D., Leongamornlert, D., Jones, D., Nicol, D., Wedge, D., Cahill, D., Easton, D., Rowe, E., Riabchenko, E., Bancroft, E., Mayer, E., Anokian, E., Hamdy, F., Park, G., Pelvender, G., Leeman, G., Gundem, G., Zhang, H., Mills, IG., Zhang, J., Teague, J., Zamora, J., Karaszi, K., Raine, K., Matthews, L., Stebbings, L., Alexandrov, LB., Marsden, L., Ahmed, M., Nykter, M., Ghori, M., Livni, N., Dennis, N., Van As, N., Camacho, N., Shah, N., Kumar, P., Van Loo, P., Lach, R., Edwards, S., Pita, S., Field, SJ., Thomas, S., Tavaré, S., Scalabrino, S., Hazell, S., McLaren, S., Visakorpi, T., Mitchell, TJ., Dudderidge, T., Dadaev, T., McDermott, U., Bo, V., Haberland, V., Gnanapragasam, V., Khoo, V., Howat, W., Jie-Lu, Y., Yu, Y., Kote-Jarai, Z., Martincorena, I., Bova, GS., Foster, CS., Campbell, P., Maitland, NJ., Neal, DE., Massie, CE., Lynch, AG., Eeles, RA. and Cooper, CS. et al. (2022) 'The architecture of clonal expansions in morphologically normal tissue from cancerous and non-cancerous prostates'. Molecular Cancer, 21 (1). pp. 1 - 13. ISSN: 1476-4598 Open Access Link Journal article Liu, Y., Elsworth, B., Erola, P., Haberland, V., Hemani, G., Lyon, M., Zheng, J., Lloyd, O., Vabistsevits, M. and Gaunt, TR. et al. (2020) 'EpiGraphDB: A database and data mining platform for health data science'. Bioinformatics, 37 (9). pp. 1304 - 1311. ISSN: 1367-4803 Open Access Link Journal article Zheng, J., Haberland, V., Baird, D., Walker, V., Haycock, PC., Hurle, MR., Gutteridge, A., Erola, P., Liu, Y., Luo, S., Robinson, J., Richardson, TG., Staley, JR., Elsworth, B., Burgess, S., Sun, BB., Danesh, J., Runz, H., Maranville, JC., Martin, HM., Yarmolinsky, J., Laurin, C., Holmes, MV., Liu, JZ., Estrada, K., Santos, R., McCarthy, L., Waterworth, D., Nelson, MR., Smith, GD., Butterworth, AS., Hemani, G., Scott, RA. and Gaunt, TR. et al. (2020) 'Phenome-wide Mendelian randomization mapping the influence of the plasma proteome on complex diseases'. Nature Genetics, 52 (10). pp. 1122 - 1131. ISSN: 1061-4036 Open Access Link Journal article Lightbody, G., Haberland, V., Browne, F., Taggart, L., Zheng, H., Parkes, E. and Blayney, JK. et al. (2019) 'Review of applications of high-throughput sequencing in personalized medicine: Barriers and facilitators of future progress in research and clinical application'. Briefings in Bioinformatics, 20 (5). pp. 1795 - 1811. ISSN: 1467-5463 Open Access Link Journal article Hatzikotoulas, K., Tachmazidou, I., Southam, L., Esparza-Gordillo, J., Haberland, V., Zheng, J., Johnson, T., Koprulu, M., Zengini, E., Steinberg, J., Wilkinson, J., Bhatnagar, S., Hoffman, J., Buchan, N., Süveges, D., Yerges-Armstrong, L., Davey-Smith, G., Gaunt, T., Scott, R., McCarthy, L. and Zeggini, E. et al. (2019) 'Genome-wide analyses using UK biobank data povide new therapeutic targets for osteoarthritis'. Elsevier BV. pp. S58 - S59. ISSN: 1063-4584 Conference paper More publications(20)",
  "content_length": 4384,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:25"
}