{
  "name": "Vana Kalogeraki",
  "homepage": "http://www2.cs.aueb.gr/~vana",
  "status": "success",
  "content": "Vana Kalogeraki Picture Next to Multiple Lines of Text Vana Kalogeraki Dean, School of Information Sciences and Technology Professor, Department of Informatics Director, Computer Systems and Communications Lab Athens University of Economics and Business Address: Patission 76, 10434 Athens, Greece Office: Troias 2, 5th Floor, Office 509 Phone: +30-210-8203510 Email: vana@aueb.gr Home Bio Awards Publications Projects Students Teaching Short Bio I am a Professor in the Computer Science Department and the Director of the Computer Systems and Communications Laboratory at Athens University of Economics and Business. Prior to coming to AUEB I was an Associate Professor at the Department of Computer Science at the University of California, Riverside and a Research Scientist at Hewlett-Packard Labs in Palo Alto, CA. I received my PhD from the University of California, Santa Barbara. I hold an M.S. and a B.S. from the University of Crete, Greece. Prof. Kalogeraki has been working in the field of distributed and real-time systems, big data systems, cloud computing, human-centered systems, participatory sensing, crowdsourcing, resource management and fault-tolerance for over 25 years. She has published over 200 papers with students and colleagues, at top Journals in her area (IEEE TPDS, ACM TOS, IEEE TKDE, ACM TOSN, JSS, ISJ, with average impact factor 3), as well as at the most prestigious and selective conferences in her area (RTSS, DSN, IPDPS, ICDCS, VLDB, Middleware, MDM), including co-authoring the OMG CORBA Dynamic Scheduling Standard. She has published 4 patents. These publications have been widely cited. She has developed real systems that are being used by other researchers and practitioners. She has been invited to give keynote talks at CLOSER2023, PerFoT2018, MoVid2015, DNCMS 2012, SN2AE 2012, PETRA 2011, DBISP2P 2006 and MLSN 2006 in the areas of Edge Computing, IoT, participatory sensing systems and sensor middleware and delivered tutorials and seminars on peer-to-peer computing. She has served as the General Chair or co- Chair of EuroSys 2024, GEC 2023, GEC 2022, MDM 2021, SEUS 2009 and WPDRTS 2006 and as a Program co-Chair of Mobiquitous 2023, ACSOS 2021, DASFAA 2021, Middleware 2019, MDM 2017, DEBS 2016, MUD 2014, MDM 2011, ISORC 2009, ISORC 2007, ICPS 2005, WPDRTS 2005 and DBISP2P 2003, a Tutorial Chair for IEEE ICDE 2020, ACM DEBS 2015, a Workshops Chair for IEEE SRDS 2015, a Demo Chair for IEEE MDM 2012, in addition to other roles such as Area Chair (IEEE ICDCS 2016, 2012). Finally, she has provided extensive service and leadership in the technical community, through her very frequent participation in program committees of the premier conferences in the field and as program committee member on over 200 conferences. She has also served as Editor in four journals. Prof. Kalogeraki was also awarded a Marie Curie Fellowship, three best paper awards at the 11th ACM International Conference on Distributed Event-Based Systems (DEBS 2017), 24th IEEE In-ternational Parallel and Distributed Processing Symposium (IPDPS 2009) and the 9th IEEE Annual International Symposium on Applications and the Internet (SAINT 2008), a best poster award at EuroSys 2024, a best technical paper award at ACM PETRA 2018, a Best Student Paper Award at the 11th IEEE/IPSJ International Symposium on Applications and the Internet (SAINT 2011), an IBM best student paper award runner up at MDM 2014, a UC Regents Fellowship Award, UC Academic Senate Research Awards and a research award from HP Labs. She has received an Award for Excellence in Teaching (academic year 2018-2019) from the Department of Informatics, Athens University of Economics and Business. Her research has been supported by an ERC Starting Independent Researcher Grant, the European Union, joint EU/Greek \"Aristeia\" grant, a joint EU/Greek \"Thalis\" grant, NSF and gifts from SUN and Nokia. Prof. Kalogeraki has led or participated in 25 Research Awards and Projects. Her research has been supported by an ERC Starting Independent Researcher (Consolidator) Grant, the European Union, joint EU/Greek \"Aristeia\" grant, a joint EU/Greek \"Thalis\" grant, NSF and gifts from SUN and Nokia. Currently she is supervising 4 PhD students, 6 MS students and 2 Undergraduates. She has graduated 10 Ph.D. students (hold academic positions in Europe or work at top industry and research labs including IBM, Google, Microsoft and Akamai) and has served on PhD/MS Committee for over 60 MS and PhD students. Here is my detailed CV Here is my short bio in Greek CV Awards Best Poster Award, “Energy-Award Scheduling for Serverless Computing”, Michail Tsenos, Aristotelis Peri, Vana Kalogeraki, EuroSys 2024, Athens, Greece, April 2024. Invited Keynote Talk, \"Towards Real-Time Reliable Edge AI\", 13th International Conference on Cloud Computing and Services Science (CLOSER), Prague, Czech Republic, April 2023. Award for Excellence in Teaching for the 2018-2019 Academic Year, Department of Computer Science, Athens University of Economics and Business. ERC Starting Independent Researcher Grant (Consolidator), 2013-2019 Best Technical Paper award, \"A Framework for Programming a Swarm of UAVs\", Dimitris Dedousis, Vana Kalogeraki, Proceedings of the 11th ACM PETRA, Corfu, Greece, June 2018 Invited Keynote Talk, \"Real-Time Reliable Internet of Things\", PerFoT 2018, Athens, Greece, March 2018 Best paper award, \"Maximizing Determinism in Stream Processing Under Latency Constraints\", Nikos Zacheilas, Vana Kalogeraki, Yiannis Nikolakopoulos, Vincenzo Gulisano, Marina Papatriantafillou, Philippas Tsigas,DEBS 2017: 112-123, Barcelona, Spain, 18-23 June 2017 Best student paper award, \"Complete Coverage Path Planning for arbitrary number of Unmanned Aerial Vehicles\", D. Dedousis, V. Kalogeraki, 9th International Conference on Pervasive Technologies Related to Assistive Environments (PETRA 2016), Corfu Island, Greece, June-July 2016 IBM best student paper award runner-up, \"Using Location-based Social Networks for Time-Constrained Information Dissemination\", Iouliana Litou, Ioannis Boutsis, Vana Kalogeraki, MDM 2014, Brisbane, Australia, July 2014 Invited Keynote Talk, \"Real-Time Reliable Crowdsourcing Techniques for the Mobile Urban Crowd\", MoVid 2015, Portland, OR, March 2015 Invited Keynote Talk, \"Reliable Real-time Human-Centered Mobile Systems\", Workshop on Social Networks and Sensor Networks in Assistive Environments (SN2AE 2012), Crete, Greece, June 2012 Invited Keynote Talk, \"Reliable Real-Time Human-Centered Sensor Middleware\", SN2AE 2012, Crete, Greece, June 2012 Best Student Paper Award, The 2011 IEEEE/IPSJ International Symposium on Applications and the Internet (SAINT 2011), Munich, Germany, July 2011 Invited Keynote Talk, \"Real-Time Reliable Sensor Middleware for Emergency Response Applications\", 4th PETRA 2011, Crete, Greece, May 2011 Our work on \"Misco: A MapReduce Framework for Mobile Systems\" has been featured at various sources (MIT Technology Review, ReadWriteWeb, HighScalability as a prominent technology for developing clouds of smartphones Best Paper Award, 23rd IEEE International Parallel and Distributed Processing Symposium (IPDPS 2009), Rome, Italy, May 2009 (out of 440 papers submitted) Best Paper Award, The 2008 International Symposium on Applications and the Internet (SAINT 2008), Turku, Finland, July 2008 Keynote Speaker, \"Middleware for Reliable Real-Time Sensor Data Management\", DBISP2P 2006, Seoul, Korea, September 2006 Keynote Speaker, \"Reliable Real-time Sensor Networks\", Workshop on Mobile Location-Aware Sensor Networks (MLASN 2006), Nara, Japan, May 2006 UC Academic Senate Research Funds, 2008, 2007, 2006, 2005, 2003 UC Regents Fellowship Award, 2008, 2003 Hewlett-Packard Research Award, 2002 Students Dimitrios Tomaras, PhD 2023 Stathis Maroulis, PhD 2023, currently at Beat Iouliana Litou, PhD 2019, currently at Meta Nikos Zacheilas, PhD 2018, currently at Shazam/Apple Ioannis Boutsis, PhD 2017, currently at Amazon Kyriakos Karenos, PhD 2008, IBM. T. J. Watson Research (PhD: Traffic Management in Wireless Sensor Networks) Thomas Repantis, PhD 2008, Akamai (PhD: Synergy: Quality of Service Support for Distributed Stream Processing Systems) Yannis Drougas, PhD 2008, ESRI (PhD: Rate Allocation in Distributed Stream Processing Systems) Demetris Zeinalipour-Yazti (co-advisor), PhD 2005, Professor, University of Cyprus Ji (Adam) Dou, 2009, Google Fang Chen, PhD 2005, Oracle Corp. Ioannis Tzouros, PhD Advisor, ongoing Michalis Tsenos, PhD Advisor, ongoing Aris Peri, PhD Advisor, ongoing Nikos Karagkounis, MS 2019 Victor Kostopoulos MS 2019 Thanasis Priovolos, MS 2019 Thanasis Gkikas, MS Advisor Miltiadis Laskaris, MS 2017 Garyfallia Dimitrios, MS 2017 Elena Mitsopoulou, MS 2016 Dimitrios Dedousis, MS 2016 Evita Bakopoulou, MS 2016 Stathis Maroulis, MS 2015 Stavroula Karanikolaou, MS 2014 Sotiris Antoniadis, MS 2014 Manolis Minadakis, MS 2014 Evangelos Antypas, MS 2014 Dimitrios Tomaras, MS 2014 Panagiota Nikoletarou, MS 2014 Mavra Drakouli, MS 2014 Dimitris Mourmouras, MS 2013 Iouliana Litou, MS 2013 Nikos Zacheilas, MS 2013 Giannis Hiladakis, MS 2011 Ioannis Boutsis, MS 2011 Nikos Nakas, MS 2011 Voula Doulgeraki, MS 2011 Michalis Karagiannis, MS 2011 Spyros Tzoras, MS 2011 Paris Carbone, MS 2009 Jessica Browdus, 2006 Dung Vu, 2006 Nelson Perez, MS 2005 - IBM Almaden Research Amir Soheili, MS 2005 - ESRI Nan Xiao, MS 2005 Jorge Mena, MS 2005 Teaching I regularly teach the following courses (graduate/undergraduate): Distributed Systems, Cloud Computing, Big Data Distributed Systems Compilers",
  "content_length": 9585,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:35"
}