{
  "name": "Vandana Pursnani Janeja",
  "homepage": "https://userpages.umbc.edu/~vjaneja",
  "status": "success",
  "content": "UMBC: IS Department : Data Science: Professor Vandana Pursnani Janeja Dr. Vandana Janeja Professor, Information Systems Department, Associate Dean for Research and Faculty Development, COEIT University of Maryland, Baltimore County (UMBC), ITE 408A, 1000 Hilltop Circle Baltimore, MD, 21250, USA Email: vjaneja at umbc dot edu Lab: https://mdata.umbc.edu/ ​Institute: https://iharp.umbc.edu/ Biography Vandana Janeja is Associate Dean for Research and Faculty Development in the College of Engineering and Information Technology, Professor of Information Systems department at the University of Maryland Baltimore County (UMBC). She is the director of iHARP, an NSF HDR Institute for Harnessing Data and Model Revolution in the Polar Regions. Her research with a current $15 Million grant portfolio is centered in the area of data science with a focus on spatio-temporal mining, data heterogeneity across multiple domain datasets. She heads the Multi Data lab at UMBC which brings together important societal projects such as climate change, ethics in data science, misinformation detection and security through the lens of her research in data science. She is member of the UMBC ADVANCE Executive committee focusing on diversity in STEM and is a member of the ADVANCE leadership cohort (2020-2021), and an ELATES at Drexel leadership fellow (2021-2022). She is a UMBC innovation fellow (2020-2022) advancing the ideas of including ethics in data science. She served as an expert at NSF supporting data science activities in the CISE directorate (2018-2021). She also served as AAAS S&TP fellow in the Office of the Assistant Director in the Directorate of Computer Information Systems and Engineering (CISE) at NSF (2017-2018). During the fellowship, she helped with the visioning and coordination of cross directorate activities for Harnessing the Data Revolution Big Idea at NSF including Data Science Corps and Open Knowledge Network among others and, related activities in the CISE directorate including Cloud Access. She has published in various refereed conferences such as ACM SIGKDD, SIAM Data Mining, IEEE ICDM, IEEE ISI and journals such as IEEE TKDE, DMKD, KAIS and IDA. Her research has been funded through federal, state and private organizations including NSF, U.S. Army Corps of Engineers, MD State Highway Administration, CISCO. She holds a Ph.D. in Information Technology from Rutgers University. She completed her MBA from Rutgers University and MS in Computer Science from New Jersey Institute of Technology. More at MData Lab Publications @DBLP Book",
  "content_length": 2574,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:33"
}