{
  "name": "Vandana Bharti",
  "homepage": "https://sites.google.com/iitdh.ac.in/vandana",
  "status": "success",
  "content": "Dr. Vandana BhartiSearch this siteEmbedded FilesSkip to main contentSkip to navigationVandana BhartiAssistant Professor and Associate HeadComputer Science and EngineeringIIT DharwadOffice: A1 - 406, Engineering Block, PCEmail: vandana@iitdh.ac.in  |  Mobile: +91 75430xxxxx Research Interests:  Machine Learning | Deep Learning | Generative AI | Computer Vision | Evolutionary Multiobjective Optimization | Quantum-Inspired Optimization Through these diverse areas, I aim to contribute to the advancement of artificial intelligence, optimization, and computer vision, and explore innovative algorithms and techniques to address real-world challenges. About MeI am an Assistant Professor and Associate Head in the Department of Computer Science and Engineering at the esteemed Indian Institute of Technology Dharwad. Our campus boasts a vibrant atmosphere, surrounded by the tranquility of lush greenery. The harmonious coexistence of birds and trees provides a serene backdrop that never fails to uplift our spirits, while the natural beauty of Dharwad fosters inner peace and nourishment.My journey in academia began with pursuing a PhD at the renowned IIT BHU, Varanasi. This experience instilled in me the core values of hard work, patience, and determination, which continue to shape my academic pursuits.Throughout my life, I have had the privilege of dwelling amidst captivating forests and cascading waterfalls in Ranchi (Home Town). I have also experienced the spiritual essence of Varanasi, residing in close proximity to the revered Nagri of Baba Viswanath during my Ph.D. These experiences have enriched my perspective and imbued me with a profound appreciation for the beauty and diversity of our world.Besides my passion for computer science, I have a keen interest in exploring intriguing mathematical problems, engaging in the ancient art of Yoga for holistic well-being, and indulging in my love for travel. Embracing these diverse interests enables me to maintain a balanced and fulfilling life beyond the academic realm.As an Assistant Professor, I am dedicated to fostering a conducive learning environment for my students, encouraging them to develop critical thinking skills and a passion for innovation. Through my research and teaching endeavors, I aim to contribute to the advancement of knowledge in the field of computer science and empower the next generation of technologists and problem solvers.I am excited about the opportunities that lie ahead, and I eagerly look forward to making a positive impact in both the academic community and society at large. Together, let us embark on a journey of growth and discovery.Report abusePage detailsPage updated Report abuse",
  "content_length": 2695,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:32"
}