{
  "name": "Vaneet Aggarwal",
  "homepage": "https://www.cs.purdue.edu/people/faculty/vaneet.html",
  "status": "success",
  "content": "Vaneet Aggarwal - Department of Computer Science - Purdue University Skip to content Home People Faculty Vaneet Aggarwal Faculty & Lecturers Staff Offices Vaneet Aggarwal Professor of Industrial Engineering (courtesy) Vaneet Aggarwal is currently a Professor and University Faculty Scholar at Purdue University, where he has been since Jan 2015. His research interests are in Reinforcement Learning; Generative AI; LLM Alignment; Quantum Machine Learning; Applications of ML. Prior to joining Purdue, he was a Senior Member of the Technical Staff - Research for five years with AT&T Labs Research, Florham Park, NJ, USA (2010-2014). Dr. Aggarwal has been Adjunct Assistâ¦ âMore Joined department: Spring 2015 Education PhD, Princeton University, EE, CS (minors) (2010) Vaneet Aggarwal is currently a Professor and University Faculty Scholar at Purdue University, where he has been since Jan 2015. His research interests are in Reinforcement Learning; Generative AI; LLM Alignment; Quantum Machine Learning; Applications of ML. Prior to joining Purdue, he was a Senior Member of the Technical Staff - Research for five years with AT&T Labs Research, Florham Park, NJ, USA (2010-2014). Dr. Aggarwal has been Adjunct Assistant Professor in the Department of Electrical Engineering at Columbia University (2013-2014), a VAJRA Adjunct Professor in the Department of Electrical Communications Engineering at IISc Bangalore (2018-2019), Visiting Professor at Plaksha University (2022-2023), Adjunct Professor in CS at IIIT Delhi (2022-2023), and Visiting Professor in CS Program at KAUST, Saudi Arabia (2022-2023). Dr. Aggarwal received the Princeton University's Porter Ogden Jacobus Honorific Fellowship in 2009, AT&T Vice President Excellence Award in 2013, AT&T Senior Vice President Excellence Award in 2014, and Purdue University's Most Impactful Faculty Innovator award in 2020. In addition, he received IEEE Jack Neubauer Memorial Award in 2017 (recognizing the best systems paper published in the IEEE Transactions on Vehicular Technology), IEEE Infocom Workshop Best paper award in 2018, Neurips Workshop Best paper award in 2021, and IEEE William R. Bennett Prize in 2024 (recognizing outstanding original papers published in IEEE/ACM Transactions on Networking). He was an Associate Editor for the IEEE Transactions on Green Communications and Networking (2017-2020) and IEEE Transactions on Communications (2017-2022). He is a senior member of IEEE since 2015. He is currently serving on the Editorial Board of the IEEE/ACM Transactions on Networking (2019-current) and is co-Editor-in-Chief of the ACM Journal on Transportation Systems (2022-current). He is 2024-2025 IEEE Comsoc Distinguished Lecturer. He has Erdos Number 3, Hawking Number 3, and Einstein Number 4. Selected Publications Mohammad Pedramfar and Vaneet Aggarwal, \"From Linear to Linearizable Optimization: A Novel Framework with Applications to Stationary and Non-stationary DR-submodular Optimization,\" NeurIPS, Dec 2024.Â Washim Uddin Mondal and Vaneet Aggarwal, \"Sample-Efficient Constrained Reinforcement Learning with General Parameterization,\" NeurIPS, Dec 2024.Â Swetha Ganesh and Vaneet Aggarwal, \"An Accelerated Multi-level Monte Carlo Approach for Average Reward Reinforcement Learning with General Policy Parametrization,\" arXiv, Jul 2024. Aditya Malusare, Harish Kothandaraman, Dipesh Tamboli, Nadia A. Lanman, andÂ Vaneet Aggarwal, \"Understanding the Natural Language of DNA using Encoder-Decoder Foundation Models with Byte-level Precision,\" Bioinformatics Advances,Â Volume 4, Issue 1, vbae117, Aug 2024 Fanglin Bao, Xueji Wang,Â Shree Hari Sureshbabu, Gautam Sreekumar, Li-Ping Yang,Â Vaneet Aggarwal,Â Vishnu Boddeti, and Zubin Jacob, \"Heat Assisted Detection and Ranging,\" Nature, 619, pages 743â748, Jul 2023 (Featured on the NatureÂ Cover Page) Contact Info vaneet@purdue.edu GRIS 260 Websites My Homepage Google Scholar",
  "content_length": 3919,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:35"
}