{
  "name": "Vangelis Metsis",
  "homepage": "http://cs.txstate.edu/~v_m137",
  "status": "success",
  "content": "Vangelis Metsis Comal Bldg, Room 307F 601 University Drive San Marcos, TX 78666 Phone: 512-245-7509 Dr. Vangelis Metsis is an Associate Professor in the Department of Computer Science at Texas State University and the Director of the Intelligent Multimodal Computing and Sensing (IMICS) Lab. He joined the department in August 2014. Dr. Metsis earned his Ph.D. in Computer Science from the University of Texas at Arlington (UTA) in 2011, focusing on human-centered multimodal data analysis. He holds a B.S. with honors in Computer Science from the Department of Informatics at the Athens University of Economics and Business (AUEB) in Greece. Dr. Metsis’ interests span the areas of Machine Learning and Computer Vision with a focus on AI-powered applications of Smart Health, Pervasive Computing, Affective Computing, and Human-AR/VR Interaction. He develops and uses methods and tools to analyze and extract meaningful information from time-series sensor data and human physiological and behavioral data using non-invasive wearable sensors. He has secured numerous research grants as both Principal Investigator and Co-Principal Investigator, with funding from the NSF, U.S. Department of Education, and industry partners. Dr. Metsis has published extensively in peer-reviewed journals and conferences, with over 70 publications to his name. Dr. Metsis is actively involved in the academic community, serving on program committees for various conferences and as a referee for multiple prestigious journals. He has also chaired and organized several workshops and special sessions at international conferences. Recognized for his dedication to teaching and mentoring, Dr. Metsis has advised multiple Ph.D. and Master’s students, as well as numerous undergraduate researchers. His teaching experience spans a wide range of computer science courses, from introductory programming to advanced topics in machine learning and computer vision. He was named an Alpha Chi Favorite Professor in 2020. selected publications DSP Geometric Knowledge Distillation via Procrustes Analysis for Efficient Motion Sequence Classification Bikram De, Kostas Blekos, Vasilis Pikoulis, Dimitrios Kosmopoulos, and Vangelis Metsis In 2025 25th International Conference on Digital Signal Processing (DSP), 2025 DOI Bib PDF Code @inproceedings{de2025geometric, title = {Geometric Knowledge Distillation via Procrustes Analysis for Efficient Motion Sequence Classification}, author = {De, Bikram and Blekos, Kostas and Pikoulis, Vasilis and Kosmopoulos, Dimitrios and Metsis, Vangelis}, booktitle = {2025 25th International Conference on Digital Signal Processing (DSP)}, pages = {1--5}, year = {2025}, organization = {IEEE}, doi = {10.1109/DSP65409.2025.11074953}, } Bioengineering Biodiffusion: A versatile diffusion model for biomedical signal synthesis Xiaomin Li, Mykhailo Sakevych, Gentry Atkinson, and Vangelis Metsis Bioengineering, 2024 DOI Bib PDF Code @article{li2024biodiffusion, title = {Biodiffusion: A versatile diffusion model for biomedical signal synthesis}, author = {Li, Xiaomin and Sakevych, Mykhailo and Atkinson, Gentry and Metsis, Vangelis}, journal = {Bioengineering}, volume = {11}, number = {4}, pages = {299}, year = {2024}, publisher = {MDPI}, doi = {10.3390/bioengineering11040299}, } AIME Recurrence and Self-attention vs the Transformer for Time-Series Classification: A Comparative Study Alexander Katrompas, Theodoros Ntakouris, and Vangelis Metsis In 20th International Conference on Artificial Intelligence in Medicine, 2022 DOI Bib PDF Code @inproceedings{katrompas2022recurrence, title = {Recurrence and Self-attention vs the Transformer for Time-Series Classification: A Comparative Study}, author = {Katrompas, Alexander and Ntakouris, Theodoros and Metsis, Vangelis}, booktitle = {20th International Conference on Artificial Intelligence in Medicine}, pages = {99--109}, year = {2022}, organization = {Springer}, doi = {10.1007/978-3-031-09342-5_10}, } AIME TTS-GAN: A Transformer-Based Time-Series Generative Adversarial Network Xiaomin Li, Vangelis Metsis, Huangyingrui Wang, and Anne Hee Hiong Ngu In 20th International Conference on Artificial Intelligence in Medicine, 2022 DOI Bib PDF Code @inproceedings{li2022ttsgan, author = {Li, Xiaomin and Metsis, Vangelis and Wang, Huangyingrui and Ngu, Anne Hee Hiong}, title = {TTS-GAN: A Transformer-Based Time-Series Generative Adversarial Network}, booktitle = {20th International Conference on Artificial Intelligence in Medicine}, year = {2022}, publisher = {Springer International Publishing}, doi = {10.1007/978-3-031-09342-5_13}, } PETRA Classification of emotional arousal during multimedia exposure Adam Anderson, Thomas Hsiao, and Vangelis Metsis In Proceedings of the 10th International Conference on PErvasive Technologies Related to Assistive Environments, 2017 DOI Bib PDF @inproceedings{anderson2017classification, title = {Classification of emotional arousal during multimedia exposure}, author = {Anderson, Adam and Hsiao, Thomas and Metsis, Vangelis}, booktitle = {Proceedings of the 10th International Conference on PErvasive Technologies Related to Assistive Environments}, pages = {181--184}, year = {2017}, doi = {10.1145/3056540.3064956}, } IEEE Internet Things J. IoT middleware: A survey on issues and enabling technologies Anne H Ngu, Mario Gutierrez, Vangelis Metsis, Surya Nepal, and Quan Z Sheng IEEE Internet of Things Journal, 2016 DOI Bib PDF @article{ngu2016iot, title = {IoT middleware: A survey on issues and enabling technologies}, author = {Ngu, Anne H and Gutierrez, Mario and Metsis, Vangelis and Nepal, Surya and Sheng, Quan Z}, journal = {IEEE Internet of Things Journal}, volume = {4}, number = {1}, pages = {1--20}, year = {2016}, publisher = {IEEE}, doi = {10.1109/JIOT.2016.2615180}, } IEEE/ACM TCBB DNA copy number selection using robust structured sparsity-inducing norms Vangelis Metsis, Fillia Makedon, Dinggang Shen, and Heng Huang IEEE/ACM transactions on computational biology and bioinformatics, 2013 DOI Bib PDF @article{metsis2013dna, title = {DNA copy number selection using robust structured sparsity-inducing norms}, author = {Metsis, Vangelis and Makedon, Fillia and Shen, Dinggang and Huang, Heng}, journal = {IEEE/ACM transactions on computational biology and bioinformatics}, volume = {11}, number = {1}, pages = {168--181}, year = {2013}, publisher = {IEEE}, doi = {10.1109/tcbb.2013.141} } Pers. Ubiquitous Comput. Non-invasive analysis of sleep patterns via multimodal sensor input Vangelis Metsis, Dimitrios Kosmopoulos, Vassilis Athitsos, and Fillia Makedon Personal and Ubiquitous Computing, 2014 DOI Bib PDF @article{metsis2014non, title = {Non-invasive analysis of sleep patterns via multimodal sensor input}, author = {Metsis, Vangelis and Kosmopoulos, Dimitrios and Athitsos, Vassilis and Makedon, Fillia}, journal = {Personal and Ubiquitous Computing}, volume = {18}, number = {1}, pages = {19--26}, year = {2014}, publisher = {Springer London}, doi = {10.1007/s00779-012-0623-1} } Telemat. Inform. Digital cities of the future: Extending@ home assistive technologies for the elderly and the disabled Charalampos Doukas, Vangelis Metsis, Eric Becker, Zhengyi Le, Fillia Makedon, and Ilias Maglogiannis Telematics and Informatics, 2011 DOI Bib PDF @article{doukas2011digital, title = {Digital cities of the future: Extending@ home assistive technologies for the elderly and the disabled}, author = {Doukas, Charalampos and Metsis, Vangelis and Becker, Eric and Le, Zhengyi and Makedon, Fillia and Maglogiannis, Ilias}, journal = {Telematics and Informatics}, volume = {28}, number = {3}, pages = {176--190}, year = {2011}, publisher = {Pergamon}, doi = {10.1016/j.tele.2010.08.001}, } CEAS Spam filtering with naive bayes-which naive bayes? Vangelis Metsis, Ion Androutsopoulos, and Georgios Paliouras In Third Conference on Email and Anti-Spam (CEAS), 2006 Bib PDF @inproceedings{metsis2006spam, title = {Spam filtering with naive bayes-which naive bayes?}, author = {Metsis, Vangelis and Androutsopoulos, Ion and Paliouras, Georgios}, booktitle = {Third Conference on Email and Anti-Spam (CEAS)}, volume = {17}, pages = {28--69}, year = {2006}, } You can reach me via email or visit my lab page for more information.",
  "content_length": 8254,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:40"
}