{
  "name": "Vania G. Dimitrova",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/184/professor-vania-dimitrova",
  "status": "success",
  "content": "Professor Vania Dimitrova | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Vania Dimitrova Position: Professor of Human-Centred AI Areas of expertise: knowledge capture; text analysis; ontological modelling; information exploration; user/group modelling; user-adapted interactive systems; decision support systems; intelligent learning environments Email: V.G.Dimitrova@leeds.ac.uk Location: 2.29 Bragg Building Website: Googlescholar | Researchgate | ORCID | White Rose Profile Vania Dimitrova leads research activity on human-centred artificial intelligence which builds intelligent systems that help people make sense of data, take decisions in complex settings, expand their knowledge, learn from experience, and develop self-regulation skills. Her research explores the use of data and knowledge models to get insights into user-generated content, understand users and influence behaviour, capture knowledge and support information exploration. Her research is conducted in cross-disciplinary collaboration with researchers from Medicine and Health, Engineering, Social Science, Education and Psychology, and actively involving end users. She is currently President of the International AI in Education Society and Co-Director of the UKRI Centre for Doctoral Training in AI for Medical Diagnosis and Care. She was Co-Director of the Leeds Research Centre in Digital Learning and was Director of Technology Enhanced Learning Strategy at the Leeds Institute of Medical Education. She is Associate Editor of the International Journal of AI in Education, and Frontiers of AI: AI for Human Learning and Behavior Change. She was Associate Editor of IEEE Transactions on Learning Technologies (IEEE-TLT) and a member of the editorial boards for the personalisation journal (UMUAI). She chaired the premier international conference on user modelling (ACM UMAP) and key conferences in intelligent learning environments (AIED, ECTEL, ICCE), as well as a series of international workshops on key topics related to intelligent mentoring, user modelling, social systems, intelligent exploration. Responsibilities Deputy Head of School, Computer Science Co-director of the UKRI Centre for Doctoral Training in AI for Medical Diagnosis and Care Research interests Short text analysis – analysis of user-generated content (comments, reviews, questionnaire responses) to gather insights about user opinions, behaviour, interaction, interests. Areas of application: patients voice, digital learning, behaviour change. Knowledge capture - ontological modelling and capturing tacit knowledge; my recent work focuses on combining ontologies and machine learning for knowledge capture in ill-defined domains (decision making, sensemaking, advising/mentoring). Areas of application: urban infrastructures, digital learning. User and group/community modelling – unique work on interactive user modelling and community modelling; my recent work focuses on modelling collectives and exploring diversity (e.g. age, experience, status, culture). Areas of application: knowledge sharing, learning. Interactive information exploration – interactive exploration of semantic data; my recent work develops mechanisms for semantic nudges taking into account the user profile and the interaction utility (e.g. increase knowledge, stimulate curiosity, inspire). Areas of application: learning, decision making, exploratory search. Qualifications BSc/MSc in Mathematics PhD in Applied Artificial Intelligence Professional memberships User Modelling Inc International Artificial Intelligence in Education Society ECTEL steering committee Student education I currently teach: 3rd year undergraduate module on User-adaptive intelligent systems (COMP3771). Student project supervision: I regularly supervise undergraduate and masters students whose projects relate to the research streams listed above. Research groups and institutes Artificial Intelligence Current postgraduate researchers Alaa Altammami Anna-Grace Linton Abrar Mohammed Shazeea Masud Zuzanna Wójcik Arpita Saggar <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 5033,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:36"
}