{
  "name": "Varsha Dani",
  "homepage": "https://www.rit.edu/directory/vxdvcs-varsha-dani",
  "status": "success",
  "content": "Varsha Dani | RIT RIT Logo with Text Varsha Dani Assistant Professor Department of Computer Science Golisano College of Computing and Information Sciences varsha.dani@rit.edu Varsha Dani Assistant Professor Department of Computer Science Golisano College of Computing and Information Sciences varsha.dani@rit.edu Currently Teaching CSCI-261Analysis of Algorithms3 CreditsThis course provides an introduction to the design and analysis of algorithms. It covers a variety of classical algorithms and data structures and their complexity and will equip students with the intellectual tools to design, analyze, implement, and evaluate their own algorithms.CSCI-716Computational Geometry3 CreditsComputational Geometry is a subfield of algorithm theory that involves the design and analysis of efficient algorithms for problems involving geometric input and output. In this course the focus will be largely on problems in 2-dimensional space (lines, line segments, polygons, planes, polyhedral, curved objects, etc.) with occasional inclusion of higher dimensional problems. There are many fields of computer science that deal with solving problems of a geometric nature. These include computer graphics, computer vision and image processing, robotics, computer-aided design and manufacturing, computational fluid-dynamics, and geographic information systems, to name a few. One of the goals of this computational geometry course is to provide the basic geometric tools necessary to solve problems in these fields. Note: Programming projects are required.CSCI-761Topics in Advanced Algorithms3 CreditsThis course focuses on advanced algorithms and data structures in a specialized area of computer science or in a specific scientific domain. Both practical and theoretical aspects of algorithms will be explored to provide coverage of the state of the art and shortcomings of computing in the specialized area. This includes proofs of correctness and complexity analysis of the algorithms. Students will write a term paper that explores the current state of research in the area or reports on the student's implementation and experiments with algorithms for a chosen problem. Students will also be required to make presentations. The instructor will post the specifics of each course offering before the registration. With the approval of the program coordinator, this course can be taken for credit more than once, provided each instance concerns a different specialized area or domain. Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 2685,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:40"
}