{
  "name": "Varun Dutt",
  "homepage": "https://faculty.iitmandi.ac.in/~varun",
  "status": "success",
  "content": "Dr. Varun Dutt << IIT Mandi Dr. Varun Dutt Designation: Professor Phone: +91-1905-267150 E-Mail: varun[at]iitmandi[dot]ac[dot]in Address: School of Computing and Electrical Engineering IIT Mandi, VPO Kamand Mandi, India - 175075 Curriculum Vitae: Download Curriculum Vitae (updated on 14 Nov 2024) About Dr. Dutt works as a Full Professor in the School of Computing and Electrical Engineering at Indian Institute of Technology Mandi. He is also the Dean, Resource Generation and Alumni Relations, IIT Mandi. In the past, he served as the Chair of the Indian Knowledge System and Mental Health Applications (IKSMHA) Centre at IIT Mandi. Dr. Dutt has applied his knowledge and skills in the fields of psychology, public policy, and computer science to explore how humans make decisions on social, managerial, and environmental issues. Dr. Dutt's Ph.D. thesis focused on answering the question: why do we want to defer actions on climate change and he has investigated the question by applying literature on people’s risk-preferences, time-preferences, social-cultural dilemmas, and linear thinking. Dr. Dutt has used lab-based methods involving experiments with human participants and cognitive models to investigate his research questions. Dr. Dutt serves as a senior member of IEEE and as the Principal Investigator at Applied Cognitive Science (ACS) Lab. He is currently serving as an Academic Editor of PloS Computational Biology journal, Associate Editor of Frontiers in Cognitive Science journal, a Review Editor of Frontiers in Decision Neuroscience journal, and a member of the editorial boards of the International Journal on Cyber Situational Awareness and the Journal of Dynamic Decision Making. Also, Dr. Dutt serves on the Board of Directors of Intiot Services Pvt. Ltd., India. In the recent past, Dr. Dutt served as a special topics editor in Frontiers in Psychology (Cognitive Science) journal for special issues on “Application of Cognitive Approaches to Cyber Security,” “Human Decision-Making in Combat Situations Involving Traditional and Immersive Visual Technologies,” and “Highlights in Psychology for Clinical Settings: Military Personnel and Veteran Mental Health.” He was also a lead author on IPCC WG III's 5th Assessment Report. For more information on research, please visit ACS Lab and IKSMHA Centre You may also visit the following pages: Varun Dutt's IRINS page, Varun Dutt's Research Gate page, and Varun Dutt's Google Scholar page For technology commercialization, please visit the following page: Intiot Services Pvt. Ltd. Research interests Artificial intelligence and cognitive modeling (modeling human behavior in dynamic tasks through computer algorithms) Human-Computer Interaction (the study of interaction between people and computers) Environmental decision making (understanding human behavior in environmental problems) Judgment and decision making (understanding human behavior in problems involving risk and uncertainty) Cognitive Science (understanding how human brain represents and manipulates knowledge) Education Ph.D., Engineering and Public Policy, Carnegie Mellon University, USA, 2011 (Title: Why do we want to defer actions on Climate Change? A Psychological Perspective) M.S., Engineering and Public Policy, Carnegie Mellon University, USA, 2010 M.S., Software Engineering, Carnegie Mellon University, USA, 2006 B. E., Computer Science and Engineering, Thapar University, India, 2004 Work Experience Academic Research Experience Full Professor, School of Computing and Electrical Engineering, Indian Institute of Technology Mandi, India, Nov 2024 – Present Associate Professor, School of Computing and Electrical Engineering, Indian Institute of Technology Mandi, India, April 2019 – Nov 2024 Assistant Professor, School of Computing and Electrical Engineering and School of Humanities and Social Sciences, Indian Institute of Technology Mandi, India, June 2012 – March 2019 Post-doctoral Fellow, Dynamic Decision Making Lab, Carnegie Mellon, Pittsburgh, PA, USA, August 2011 – May 2012 Graduate Research Assistant, Dynamic Decision Making Lab, Carnegie Mellon, Pittsburgh, PA, USA, August 2007 – August 2011 Research Programmer, Dynamic Decision Making Lab, Carnegie Mellon, Pittsburgh, PA, USA, May 2006 – July 2007 Graduate Committees Ms. Neha Sharma, Advisor in Ph.D. Doctoral Committee (Graduated) Ms. Palvi Aggarwal, Advisor in Ph.D. Doctoral Committee (Graduated) Mr. Abhijeet Seth, Advisor in M. Tech. Thesis Committee (Graduated) Mr. Shivendra Sangar, Co-Advisor in Ph.D. Doctoral Committee (Graduated) Ms. Medha Kumar, Advisor in Ph.D. Doctoral Committee (Graduated) Mr. Pratik Chaturvedi, Advisor in Ph.D. Doctoral Committee (Graduated) Mr. Akash K Rao, Advisor in M.S. Academic Progress Committee (Graduated) Mr. Zahid Maqbool, Advisor in Ph.D. Doctoral Committee (Graduated) Mr. Abhinav Choudhury, Advisor in Ph.D. Doctoral Committee (Graduated) Ms. Shruti Kaushik, Advisor in Ph.D. Doctoral Committee (Graduated) Mr. Praveen Kumar, Advisor in M.S. Academic Progress Committee (Graduated) Mr. Ankush Pathania, Advisor in M.S. Academic Progress Committee (Graduated) Mr. Tushar Saini, Advisor in M.S. Academic Progress Committee (Graduated) Mr. Harsh Katakwar, Advisor in M.S. Academic Progress Committee (Graduated) Mr. Shashank Uttrani, Advisor in M.S. Academic Progress Committee (Graduated) Mr. Keshav Tadia, Advisor in MA Development Studies (Graduated) Ms. Akanksha, Advisor in MA Development Studies (Graduated) Mr. Darshil Shah (FU Berlin), Advisor in MS Academic Progress Committee (Graduated) Mr. Rakesh Somerwal, Advisor in MSc Physics (Graduated) Mr. Apoorav Singh Deo, Advisor in MSc Physics (Graduated) Ms. Gulshan, Advisor in MSc Physics (Graduated) Mr. Himanshu Soam, Advisor in MSc Applied Mathematics (Graduated) Ms. Simrat, Advisor in MSc Physics (Graduated) Mr. Apurav, Advisor in MSc Physics (Graduated) Ms. Sucheta Panda, Advisor in M. Tech. (CSE) Academic Progress Committee (Graduated) Mr. Aditya Kumar, Advisor in M. Tech. (CSE) Academic Progress Committee (Graduated) Mr. Ravi Yadav, Advisor in M. Tech. (CSE) Academic Progress Committee (Graduated) Mr. Srijan Singh, Advisor in M. Tech. (CSE) Academic Progress Committee (Graduated) Mr. Harsh Gahlot, Advisor in M. Tech. (CSE) Academic Progress Committee (Graduated) Ms. Megha Sharma, Advisor in M.S. Academic Progress Committee (Synopsis Submitted) Mr. Aadhaar Gupta, Advisor in M.S. Academic Progress Committee (Synopsis Submitted) Ms. Priyanka, Advisor in M.S. Academic Progress Committee (Synopsis Submitted) Mr. Gitanshu Choudhary, Advisor in Ph.D. Doctoral Committee (Jan 2020 – Present) Mr. Praveen Kumar, Advisor in Ph.D. Doctoral Committee (Jan 2021 – Present) Mr. Akash K Rao, Advisor in Ph.D. Doctoral Committee (Jan 2022 – Present) Mr. Shashank Kapoor, Advisor in M.S. Academic Progress Committee (Aug 2022 – Present) Mr. Yashwant Kumar, Advisor in M.S. Academic Progress Committee (Aug 2022 – Present) Ms. Ankita Garg, Advisor in Ph.D. Doctoral Committee (Aug 2022 – Present) Mr. Shashank Uttrani, Advisor in Ph.D. Doctoral Committee (Feb 2023 – Present) Mr. Sahil Sankhayan, Advisor in Ph.D. Doctoral Committee (Feb 2023 – Present) Ms. Sakshi Chauhan, Advisor in Ph.D. Doctoral Committee (Feb 2023 – Present) Mr. Ankush Arya, Co-Advisor in Ph.D. Doctoral Committee (Feb 2023 – Present) Mr. Rohit Kumar Roy, Advisor in M.S. Academic Progress Committee (Feb 2023 – Present) Mr. Shubham Kumar, Co-Advisor in M.S. Academic Progress Committee (Feb 2023 – Present) Mr. Sagnik Ghosh, Co-Advisor in M. Tech. (R) Academic Progress Committee (Aug 2023 – Present) Mr. Tushar Vasudev, Advisor in M. Tech. (R) Academic Progress Committee (Aug 2023 – Present) Mr. Mani S., Advisor in M. Tech. (EV) Academic Progress Committee (Aug 2023 – Present) Mr. Sandeep, Advisor in M. Tech. (CSE) Academic Progress Committee (Aug 2022 – Present) Mr. Abbas Hussain, Advisor in M. Tech. (CSE) Academic Progress Committee (Aug 2023 – Present) Mr. Sachin Bahuleyan, Advisor in M. Tech. (CSE) Academic Progress Committee (Aug 2023 – Present) Ms. Arti Devi, Advisor in M. Tech. (R) Academic Progress Committee (Aug 2023 – Present) Mr. Akash Singh, Advisor in M. Tech. (R) Academic Progress Committee (Aug 2023 – Present) Ms. Shivani, Advisor in M. Tech. (R) Academic Progress Committee (Aug 2023 – Present) Ms. Malika Nagpal, Advisor in Ph.D. Doctoral Committee (Aug 2023 – Present) Mr. Ankit Singh, Advisor in Ph.D. Doctoral Committee (Aug 2023 – Present) Ms. Aditi Ghosh, Advisor in MA Development Studies (Aug 2022 – Present) Academic Administrative Experience Chair, Ranking Cell, Indian Institute of Technology Mandi, India, Oct 2023 - Present Chair, Indian Knowledge System and Mental Health Applications Centre, Indian Institute of Technology Mandi, India, Dec 2022 – Present Associate Dean, Resource Generation and Alumni Relations, Indian Institute of Technology Mandi, India, Apr 2021 – Present Project Director, IIT Mandi iHub and HCI Foundation, Indian Institute of Technology Mandi, India, Jan 2021 – Present Advisor, WING (Website), Indian Institute of Technology Mandi, India, Feb 2020 – Nov 2021 Lead Coordinator, TIH (HCI foundation), Indian Institute of Technology Mandi, India, May 2020 – Jan 2021 Advisor, Alumni Affairs Cell, Indian Institute of Technology Mandi, India, Feb 2020 – Nov 2021 Advisor, Training and Placement Cell, Indian Institute of Technology Mandi, India, Nov 2018 – Feb 2020 Associate Dean, International Relations, Indian Institute of Technology Mandi, India, Aug 2015 – Apr 2020 SCEE Member, Senate, Indian Institute of Technology Mandi, India, Nov 2012 – Apr 2020 Chief Warden, Indian Institute of Technology Mandi, India, Feb 2015 – Nov 2017 Faculty Advisor, B. Tech. Students, Indian Institute of Technology Mandi, India, Aug 2012 – Aug 2016 Member, SHSS Purchases, Indian Institute of Technology Mandi, India, Jan 2013 – Aug 201",
  "content_length": 95768,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:42"
}