{
  "name": "Vasant G. Honavar",
  "homepage": "https://www.eecs.psu.edu/departments/directory-detail-g.aspx?q=vuh11/vuh14",
  "status": "success",
  "content": "EECS Directory | Penn State Engineering Penn State   |    College of Engineering Directory Apply Search this site Search Penn State Search PSU People Search PSU Depts. Web Research Centers Center for Machine Learning and Applications Center for Computational Biology and Bioinformatics Institute of Networking and Security Research Labs Applied Optoelectronics & Photonics Lab Biomedical Sensing Systems Laboratory Blockchain Innovation Lab Chu Electronics Research Group Computer Systems Lab Computational Electromagnetics and Antennas Research Lab Ebrahimi Lab: Bioanalytical and Biosensor Engineering High Performance Computing Lab Information Processing and Algorithms Lab Integrated Circuits and Systems Lab Jackson Electronics Research Group Laboratory for Perception, Action and Cognition Labs Machine Learning and Optimization Lab Mobile Computing and Networking Lab Microsystems Design Lab Multidimensional Image Processing Lab Nanophotonics and Optoelectronics Lab Natural Language Processing Lab Neuromorphic Computing Lab Scalable Computing Lab Smart Networking and Computing (SNeC) Lab Research Areas Biomedical Devices and Systems Communications, Information Theory, and Coding over Networked Systems Computational Science Computer Architecture Control and Decision Systems Data Science and Artificial Intelligence Electromagnetics Electronic Materials and Devices Integrated Circuits and Systems Research Areas Network and Mobile Systems Operating Systems and Cloud Computing Optical Materials, Devices, and Systems Power and Energy Systems Programming Languages and Compilers Remote Sensing and Space Systems Security and Privacy Signal and Image Processing Theoretical Computer Science Departments Electrical Engineering About Strategic Plan for EE B.S. in Electrical Engineering Undergraduate Frequently Asked Questions EE Graduate Degree Programs Safety in EE Student Job Opportunities IT Resources Contact Us Computer Science and Engineering About Strategic Plan for CSE B.S. in Artificial Intelligence Engineering B.S. in Computer Engineering B.S. in Computer Science B.S. in Data Sciences Minors Undergraduate Frequently Asked Questions CSE Graduate Degree Programs CSE Academic Integrity Statement Contact Us IT Resources School of EECS About the School Director's Welcome Facts and Figures Employment Opportunities College-level Communications Resources People Faculty CSE Faculty EE Faculty Emeritus Faculty Adjunct Faculty Staff CSE Staff EE Staff Graduate Students CSE Master’s Degree Students CSE PhD Students EE Master’s Degree Students EE PhD Students Academics Undergraduate Prospective Students B.S. in Artificial Intelligence Engineering B.S. in Computer Engineering B.S. in Computer Science B.S. in Data Sciences B.S. in Electrical Engineering Minors Frequently Asked Questions Research Opportunities Organizations Study Abroad Diversity Programs Scholarships and Financial Aid The Learning Factory Graduate Prospective Students Current Students Admission to EE Admission to CSE Research Areas EE Graduate Degree Programs CSE Graduate Degree Programs Funding Opportunities Application Requirements EE Colloquia CSE Colloquia Resources Forms Mentoring Academic Plans Advising Undergraduate Frequently Asked Questions Organizations Facilities Career Resources Global Programs Academic Calendar Office for Research Protection Workshops (SARI) Quick Links Canvas LionPath Apply Now (Undergraduate Degree Programs) Apply Now (Computer Science and Engineering Graduate Degree Programs) Apply Now (Electrical Engineering Graduate Degree Programs) Industry Support Sponsorships EECS affiliates/Engineering Program Giving Partnerships IPAC Research Recruiting Events Opportunities Resources Partner with Us! How to Give Alumni Community Who We Are Events Publications Recognitions Awards Computer Science and Engineering Summer Camp Electrical Engineering Summer Camp Support Electrical Engineering and Computer Science Alumni Society Penn State Engineering Alumni Society Penn State Alumni Association Giving Volunteer EECS Faculty & Staff All Faculty and Staff CSE Faculty EE Faculty CSE Staff EE Staff Adjunct Faculty Emeritus Faculty All Research Areas Biomedical Devices Communications, Information Theory, and Coding over Networked Systems Computational Science Computer Architecture Control and Decision Systems Data Science and Artificial Intelligence Electromagnetics Electronic Materials and Devices Integrated Circuits and Systems Interfaces and Surfaces Network and Mobile Systems Operating Systems and Cloud Computing Optical Materials, Devices, and Systems Power and Energy Systems Power Electronics - Converter Design, Control, and Reliability Programming Languages and Compilers Remote Sensing and Space Systems Renewable Energy Integration Security and Privacy Signal and Image Processing Theoretical Computer Science Wide-Bandgap Semiconductor Applications Search Result Muhammad Rizwan Akram Assistant Research Professor 121 Electrical Engineering East mja7191@psu.edu Mohamed Almekkawy Associate Research Professor 322 Leonhard Building 814-863-5141 mka9@psu.edu Victoria Appleman Academic Program Coordinator W209 Westgate Building 814-863-8103 vhv5013@psu.edu Christos Argyropoulos Associate Professor 203 Electrical Engineering East 814-865-2355 cfa5361@psu.edu Manushanker Balasubramanian Assistant Research Professor 121 Electrical Engineering East 814-865-7667 mxb839@psu.edu Anton Bankevich Assistant Professor W204A Westgate Building 814-863-8113 aqb6554@psu.edu Ishan Behoora Assistant Teaching Professor W109 Westgate Building iub5@psu.edu Lyndsey Biddle Marketing and Communications Specialist 128 Electrical Engineering East lrb5765@psu.edu Sven Bilén Director of the Doctor of Engineering in Engineering Program 223 Engineering Design and Innovation Building 814-863-1526 sgb100@psu.edu Antonio Blanca Associate Professor W311 Westgate Building 814-865-6817 azb1015@psu.edu Sawyer Campbell Associate Professor 327 Electrical Engineering East 814-865-2212 sdc22@psu.edu Guohong Cao Distinguished Professor W326 Westgate Building 814-863-1241 gxc27@psu.edu Nilanjan Ray Chaudhuri Professor 315 Electrical Engineering East 814-865-2359 nuc88@psu.edu Kyusun Choi Teaching Professor 325 Leonhard Building 814-863-1268 kxc104@psu.edu Roger Christman Lecturer W109L Westgate Building 814-865-7493 dvl@psu.edu Robert Collins Associate Professor W327 Westgate Building 814-863-1944 rtc12@psu.edu David Cubanski Associate Teaching Professor 318 Electrical Engineering East 814-863-9559 djc24@psu.edu Daniel Cullina Assistant Professor 111H Electrical Engineering West 814-863-9885 dqc5596@psu.edu Chitaranjan Das Distinguished Professor W349 Westgate Building 814-865-0194 cxd12@psu.edu Debarati Das Assistant Professor W310 Westgate Building 814-865-3600 dxd5606@psu.edu Alexandar Devic Assistant Teaching Professor W209K Westgate Building amd6185@psu.edu April Dodson Financial Assistant 128 Electrical Engineering East 814-863-2971 ajd7237@psu.edu John Doherty Professor and Director of Graduate Studies 227B Electrical Engineering West 814-863-8102 jfd6@psu.edu Taylor Doksa Education Program Coordinator W209 Westgate Building 814-865-9191 tce5018@psu.edu John Domico Director of Technology and Lecturer W114 Westgate Building 814-865-3757 jad230@psu.edu Donald Ebeigbe Assistant Professor 313 Electrical Engineering East 814-865-2998 dee5127@psu.edu Aida Ebrahimi Thomas and Sheila Roell Early Career Associate Professor 209H Electrical Engineering West 814-865-6177 sue66@psu.edu Olivia Ewing Financial Assistant W209 Westgate Building 814-865-7320 omm5039@psu.edu Humaira Farid Assistant Teaching Professor W109H Westgate Building hvf5180@psu.edu Mahfuza Farooque Associate Teaching Professor W307 Westgate Building 814-863-5103 mff5187@psu.edu Junichiro Fukuyama Assistant Teaching Professor W109G Westgate Building 814-865-6479 jxf140@psu.edu Martin Furer Professor W356 Westgate Building 814-863-1857 fhs@psu.edu Oren Gall Associate Teaching Professor 314C Leonhard Building 814-863-5142 ozg1@psu.edu Lance Galloway Academic Adviser W108 Westgate Building 814-863-9088 lmg21@psu.edu Swaroop Ghosh Professor 227E Electrical Engineering West 814-865-1298 szg212@psu.edu Mahanth Gowda Associate Professor W314 Westgate Building 814-863-0608 mkg31@psu.edu Heather Gummo EECS Program and Events Coordinator 207 Electrical Engineering West 814-863-8143 hdg10@psu.edu Adam Hackenberg Systems Administrator 11A Electrical Engineering West 814-865-5567 ajh31@psu.edu Sean Hallgren Professor W350 Westgate Building 814-863-1265 sjh26@psu.edu Ting He Associate Professor W334 Westgate Building 814-865-1265 tzh58@psu.edu William Higgins Distinguished Professor 214 Electrical Engineering West 814-865-0186 weh2@psu.edu Christine Hinton Administrative Support Assistant W209 Westgate Building 814-867-2360 cla199@psu.edu Diane Hockenberry Administrative Support Coordinator W209D Westgate Building 814-863-2071 dtb115@psu.edu Vasant Honavar Professor and Edward Frymoyer Chair of Information Sciences and Technology E335 Westgate Building 814-865-3141 vuh14@psu.edu Gregory Huff Professor 303 Electrical Engineering East 814-863-2226 guh234@psu.edu Syed Rafiul Hussain Assistant Professor W305 Westgate Building 814-865-6454 hussain1@psu.edu Thomas Jackson Robert E. Kirby Chair Professor 216 Electrical Engineering West 814-863-8570 tnj1@psu.edu Krishna Kambhampaty Assistant Teaching Professor W109N Westgate Building kvk6012@psu.edu Mahmut Kandemir Interim Department Head of Computer Science and Engineering W209F Westgate Building 814-863-4888 mtk2@psu.edu Morteza Kayyalha Assistant Professor 111G Electrical Engineering West 814-865-0776 mzk463@psu.edu George Kesidis Professor W367 Westgate Building 814-865-9190 gik2@psu.edu Arslan Khan Assistant Professor W209 Westgate Building abk6349@psu.edu Iam-Choon Khoo William E. Leonhard Professor 216 Electrical Engineering East 814-863-2299 ick1@psu.edu Daniel Kifer Professor W333 Westgate Building",
  "content_length": 19891,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:47"
}