{
  "name": "Vasa Curcin",
  "homepage": "https://www.kcl.ac.uk/people/vasa-curcin",
  "status": "success",
  "content": "Vasa Curcin | King's College London Skip to main contentProfessor Vasa Curcin Professor of Health Informatics Joint Head of Department, Population Health SciencesResearch interestsBiomedical and life sciencesContact detailsvasa.curcin@kcl.ac.uk+44 (0)20 7848 1579VasaCurcinBiographyAbout Dr Vasa Curcin is a Professor  in Health Informatics at King’s College London and leads the Digital Health Group, focusing on reproducibility solutions based on data provenance, embedding clinical trials into routine practice, decision support systems as means of implementing Learning Health Systems in practice, and machine learning methods for detecting depression and anxiety disorders from social network behaviours. Vasa completed his PhD at Imperial College London on semantics of scientific workflow systems. While working as a Bioinformatics Product Manager at InforSense Ltd, the application of his thesis to large real-world patient databases resulted in one of the earliest workflow-based phenotyping tools that has been used in both academic and industrial settings. He was a Farr Future Leader, is the King's lead for Health Data Research UK network’s Phenomics and Clinical Trial Informatics themes. He is a co-director of the DRIVE-Health Centre for Doctoral Training in Data-Driven Health. Teaching 4CCS1DBT - Database Technologies PublicationsResearchResearchDistributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesCONSULTWellness sensors to support patient decisions in managing their healthcareProject status: OngoingAgeing Research at King's (ARK)Cross faculty consortium addressing ageing and healthy longevity. Stroke Research GroupWe are a multidisciplinary group (epidemiologists, stroke physicians, GPs, social scientists, statisticians, health informaticians and health economists) focused on stroke and with a wider interest in vascular long-term conditions and analytics.Digital HealthDigital Health Research Group is a multidisciplinary group of informaticians, clinicians, psychologists and computer scientists, researching the role of data and knowledge in medical research and practice. Improving the lives of stroke survivors with dataWe aim to improve the lives of stroke survivors through a programme of stakeholder engagement, data collection, analysis and modelling, and use in practice.Project status: OngoingHealth Inequalities, Societies and SystemsCentral to our research is understanding and tackling the systemic and intersecting drivers of disparities in health over the life course such as racism, gender, crime, precarious livelihoods, environmental pollution, and inaccessible health care. We work collaboratively across the School of Life Course and Population Sciences to strengthen the theoretical aspects of population health research.KingsCAT: Capture and Analysis Tool for Social Media Research at King’s College LondonKingsCAT is an instance of the open source 4CAT: Capture and Analysis Toolkit set up to support interdisciplinary and collaborative social media research.Project status: OngoingNewsNews01 November 2024AI tackles huge problem of antimicrobial resistance in intensive careArtificial intelligence (AI) can provide same-day assessments of antimicrobial resistance for patients in intensive care – critical to preventing...HealthTechnology & Science11 October 2024New Nobel Prize winner comes to King's to speak with studentsDr John Jumper, one of the winners of the 2024 Nobel Prize for Chemistry, came to King’s College London the day after the announcement to talk to students. Technology & ScienceStudent17 July 2024King's EPSRC Centre for Doctoral Training in Data-Driven Health partners with online banking start-upTwo new projects at the EPSRC Centre for Doctoral Training in Data-Driven Health (DRIVE-Health) at King’s College London will help harness healthcare data for...HealthTechnology & ScienceUniversity12 March 2024King's Centre for Doctoral Training in Data-Driven Health awarded multi-million EPSRC fundingThe Engineering & Physical Sciences Research Council (EPSRC) has awarded £7.9 million to King’s Centre for Doctoral Training (CDT) in Data-Driven Health...HealthTechnology & Science27 May 2022Patient-level factors predominantly influence women's uptake of GP health checksNon-uptake of health checks amongst women in ethnically diverse South London are more likely to result from patient level rather than GP practice level factorsHealth01 December 2021King's College London joins ELIXIR-UKBy joining the intergovernmental organisation King’s will be more meaningfully involved in discussions around access to bioinformatics resourcesInternationalHealthTechnology & ScienceUniversity21 January 2019Interdisciplinary King's team win Best Demo for CONSULT healthcare projectAn interdisciplinary team from King’s, led by academic staff from the Department of Informatics, has won Best Demo at the 6th International Conference on...Technology & ScienceEventsEvents18OctInaugural Lecture: Professor Vasa Curcin18 October 2023 16:45 to 17:30Inspiring talks with some of our brightest mindsPlease note: this event has passed.FeaturesFeatures10 May 2024Professor Wendy Hall and Professor Vasa Curcin: What makes a good work-life balance?Professor Wendy Hall, Deputy Head of the Department of Nutrition & Dietetics, and Professor Vasa Curcin, Joint Head of Department, Population Health Sciences,...HealthSpotlightSpotlight21 July 2022Where does data come from?The origin, or 'provenance' of data is important to gaining trust in policies and processes that are data driven. HealthTechnology & SciencePublicationsResearchNewsEventsFeaturesSpotlightResearchDistributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesCONSULTWellness sensors to support patient decisions in managing their healthcareProject status: OngoingAgeing Research at King's (ARK)Cross faculty consortium addressing ageing and healthy longevity. Stroke Research GroupWe are a multidisciplinary group (epidemiologists, stroke physicians, GPs, social scientists, statisticians, health informaticians and health economists) focused on stroke and with a wider interest in vascular long-term conditions and analytics.Digital HealthDigital Health Research Group is a multidisciplinary group of informaticians, clinicians, psychologists and computer scientists, researching the role of data and knowledge in medical research and practice. Improving the lives of stroke survivors with dataWe aim to improve the lives of stroke survivors through a programme of stakeholder engagement, data collection, analysis and modelling, and use in practice.Project status: OngoingHealth Inequalities, Societies and SystemsCentral to our research is understanding and tackling the systemic and intersecting drivers of disparities in health over the life course such as racism, gender, crime, precarious livelihoods, environmental pollution, and inaccessible health care. We work collaboratively across the School of Life Course and Population Sciences to strengthen the theoretical aspects of population health research.KingsCAT: Capture and Analysis Tool for Social Media Research at King’s College LondonKingsCAT is an instance of the open source 4CAT: Capture and Analysis Toolkit set up to support interdisciplinary and collaborative social media research.Project status: OngoingNews01 November 2024AI tackles huge problem of antimicrobial resistance in intensive careArtificial intelligence (AI) can provide same-day assessments of antimicrobial resistance for patients in intensive care – critical to preventing...HealthTechnology & Science11 October 2024New Nobel Prize winner comes to King's to speak with studentsDr John Jumper, one of the winners of the 2024 Nobel Prize for Chemistry, came to King’s College London the day after the announcement to talk to students. Technology & ScienceStudent17 July 2024King's EPSRC Centre for Doctoral Training in Data-Driven Health partners with online banking start-upTwo new projects at the EPSRC Centre for Doctoral Training in Data-Driven Health (DRIVE-Health) at King’s College London will help harness healthcare data for...HealthTechnology & ScienceUniversity12 March 2024King's Centre for Doctoral Training in Data-Driven Health awarded multi-million EPSRC fundingThe Engineering & Physical Sciences Research Council (EPSRC) has awarded £7.9 million to King’s Centre for Doctoral Training (CDT) in Data-Driven Health...HealthTechnology & Science27 May 2022Patient-level factors predominantly influence women's uptake of GP health checksNon-uptake of health checks amongst women in ethnically diverse South London are more likely to result from patient level rather than GP practice level factorsHealth01 December 2021King's College London joins ELIXIR-UKBy joining the intergovernmental organisation King’s will be more meaningfully involved in discussions around access to bioinformatics resourcesInternationalHealthTechnology & ScienceUniversity21 January 2019Interdisciplinary King's team win Best Demo for CONSULT healthcare projectAn interdisciplinary team from King’s, led by academic staff from the Department of Informatics, has won Best Demo at the 6th International Conference on...Technology & ScienceEvents18OctInaugural Lecture: Professor Vasa Curcin18 October 2023 16:45 to 17:30Inspiring talks with some of our brightest mindsPlease note: this event has passed.Features10 May 2024Professor Wendy Hall and Professor Vasa Curcin: What makes a good work-life balance?Professor Wendy Hall, Deputy Head of the Department of Nutrition & Dietetics, and Professor Vasa Curcin, Joint Head of Department, Population Health Sciences,...HealthSpotlight21 July 2022Where does data come from?The origin, or 'provenance' of data is important to gaining trust in policies and processes that are data driven. HealthTechnology & Science3.07,",
  "content_length": 10228,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:43"
}