{
  "name": "Vasco M. Manquinho",
  "homepage": "http://sat.inesc-id.pt/~vmm",
  "status": "success",
  "content": "Vasco Manquinho | Researcher & Developer Research Interests Boolean Optimization Algorithms and tools for SAT, MaxSAT, and Pseudo-Boolean Optimization. SAT MaxSAT PBO Combinatorial Optimization Solving complex optimization problems with multiple conflicting objectives. Multi-Objective Optimization Software Engineering Program synthesis, automated repair, and fault localization. Synthesis Repair Testing DBLP Profile Google Scholar ORCID Selected Projects Combinatorial Optimization Open-WBO State-of-the-art MaxSAT and Pseudo-Boolean solver. Supports various algorithms for solving optimization problems. MaxSAT Pseudo-Boolean C++ View on GitHub → sat4jMOCO Multi-Objective Combinatorial Optimization solver. Built on top of Sat4j for solving multi-objective problems. Multi-Objective Java Sat4j View on OW2 GitLab → MOCO Multi-Objective Combinatorial Optimization solver. A solver for multi-objective problems developed at INESC-ID. Multi-Objective C++ Optimization View on INESC-ID GitLab → UpMax User partitioning for MaxSAT. A tool for solving MaxSAT instances by partitioning the problem based on user input. MaxSAT Partitioning Python View on GitHub → Program Synthesis CUBES SQL query synthesis from examples. Automatically generates SQL queries that satisfy a set of input-output examples. SQL Synthesis Java View on GitHub → SQUARES A SQL and R Synthesizer Using Query Reverse Engineering. Synthesizes queries from examples using a reverse engineering approach. SQL R Reverse Engineering View on GitHub → SOAR Synthesis for Open-Source API Refactoring. Automated tool for refactoring APIs in open-source projects. Refactoring API Java View on GitHub → UnchartIt An Interactive Framework for Program Recovery from Charts. Recovers data transformations from chart images. Charts Synthesis Data Recovery View Website → Fault Localization and Repair CFaults Model-Based Diagnosis for Fault Localization in C with Multiple Test Cases. A formula-based technique addressing multiple faults. C Fault Localization MaxSAT View on GitHub → GitSEED Automated assessment tool for Programming Education backed by GitLab, providing personalized feedback on assignments. Education GitLab Assessment View on GitLab → FormHe Automatic Fault Localization and Repair of Answer Set Programming (ASP). Leverages Large Language Models for repairing ASP programs. LLM Repair ASP View on GitHub → Teaching Algorithms for Computational Logic Professor 1st Sem 2025/2026 Automated Reasoning and Computational Logic Professor 1st Sem 2025/2026",
  "content_length": 2527,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:44"
}