{
  "name": "Vasco T. Vasconcelos",
  "homepage": "https://ciencias.ulisboa.pt/perfil/vmvasconcelos",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo VASCO THUDICHUM VASCONCELOS Contactos Departamento de Informática Sala/Gabinete 6.3.12 Ext. Principal 26312 Telefone Direto 217500608 Email vmvasconcelos@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Catedrático Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Currículo Resumido Vasco T. Vasconcelos is a full professor at the Department of Informatics, Faculty of Sciences, University of Lisbon where he has been lecturing since March 1996. He is currently the director of the LASIGE research lab. He received the M.Sc. and Ph.D. degrees in computer science from Keio University (1992, 1995), and the habilitation title in informatics from New University of Lisbon (2003). Spent a sabbatical semester at Kyoto University in Autumn 2016 and a year at University of Sussex in 2002-03, was at New University of Lisbon, first as a post doc, then as teaching assistant in 1995-96, and worked at Sony Computer Science Laboratory, Tokyo, in 1993-94 while a Ph.D. student. Vasconcelos is a founding member of the Gloss research team at Lasige. His research work centers on programming languages for concurrent and distributed programming, type systems, process calculi, and specification and verification of computer systems. Download currículo completo Interesses Científicos Especificação e verificação e de sistemas computacionais, linguagens de programação, sistemas de tipos. Scientific Interests Specification and verification of computer systems, programming languages, type systems. Publicações selecionadas K. Honda, VT. Vasconcelos, and M. Kubo. Language primitives and type discipline for structured communication-based programming. LNCS, 1381:122–138, Springer, 1998 Modular session types for distributed object-oriented programming SJ Gay, VT Vasconcelos, A Ravara, N Gesbert, AZ Caldeira ACM Sigplan Notices 45 (1), 299-312. 2010 VT. Vasconcelos. Typed concurrent objects. LNCS, 821:100–117, Springer, 1994 K. Honda, VT. Vasconcelos, and N. Yoshida. Secure information flow as typed process behaviour. LNCS1872:188–199, Springer, 2000 Linear type theory for asynchronous session types SJ Gay, VT Vasconcelos Journal of Functional Programming 20 (1), 19-50. 2010 Ver todas as Publicações",
  "content_length": 2411,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:51"
}