{
  "name": "Vasco Brattka",
  "homepage": "http://theory.cca-net.de/vasco.php",
  "status": "success",
  "content": "Theoretical Computers Science and Mathematical Logic - Prof. Dr. Vasco Brattka Vasco Brattka Professor for Theoretical Computer Science and Mathematical Logic Institut for Theoretical Computer Science, Mathematics and OR Faculty of Computer Science Universität der Bundeswehr München Werner-Heisenberg-Weg 39 85577 Neubiberg, Germany +49 89 6004 2243 +49 89 6004 2876 Office 1403, Building 41-400 (teaching) (research) Honorary Research Associate Research Interests Laboratory of Discrete Mathematics & Theoretical Computer Science Department of Mathematics & Applied Mathematics University of Cape Town Private Bag X3 Rondebosch 7701, South Africa Computable Analysis Computability Theory Effective Descriptive Set Theory Algorithmic Randomness Complexity and Logic Weihrauch Complexity Memberships Network Computability and Complexity in Analysis (CCA) Association Computability in Europe (CiE) Resource for Computability Theorists (Computability) European Association for Theoretical Computer Science (EATCS) Deutsche Vereinigung für Mathematische Logik und für Grundlagen der Exakten Wissenschaften (DVMLG) Association for Symbolic Logic (ASL) American Mathematical Society (AMS) Awards Shoenfield Prize of the Association for Symbolic Logic 2022 Silver Medal of the Kurt Gödel Research Prize Fellowship 2008 Professional Activities Editor-in-Chief of Computability - The Journal of the Association CiE, published by IOS Press in Amsterdam Chair of the Steering Committee of the international conference series Computability and Complexity in Analysis (CCA) Member of the Editorial Board of the book series Theory and Applications of Computability, published by Springer in Heidelberg in cooperation with CiE Member of the Editorial Board of the Journal of Universal Computer Science Member of the Committee on Logic in Europe of the Association for Symbolic Logic (ASL) Co-Organizer of the online seminar on Computability Theory and Applications Member of the Advisory Committee for Transformation and Strategy of the South African Mathematical Society (SAMS) Recent Publications Brattka, Vasco and Rauzy, Emmanuel, Effective second countability in computable analysis, in: Beckmann, Arnold and Oitavem, Isabel and Manea, Florin (eds.), Crossroads of Computability and Logic: Insights, Inspirations, and Innovations, vol. 15764 of Lecture Notes in Computer Science, Springer, Cham, 2025, pages 19-33 Brattka, Vasco and Smischliaew, Hendrik, Computability of Initial Value Problems, in: Beckmann, Arnold and Oitavem, Isabel and Manea, Florin (eds.), Crossroads of Computability and Logic: Insights, Inspirations, and Innovations, vol. 15764 of #LNCS#, Springer, Cham, 2025, pages 191-206 Brattka, Vasco, On the complexity of learning programs, in: Della Vedova, Gianluca and Dundua, Besik and Lempp, Steffen and Manea, Florin (eds.), Unity of Logic and Computation, vol. 13967 of #LNCS#, Springer, Cham, 2023, pages 166-177 Brattka, Vasco, The Discontinuity Problem, Journal of Symbolic Logic 88:3 (2023) 1191-1212 Brattka, Vasco, Weihrauch complexity and the Hagen school of computable analysis, in: Löwe, Benedikt and Sarikaya, Deniz (eds.), 60 Jahre DVMLG, vol. 48 of Tributes, College Publications, London, 2022, pages 13-44 Brattka, Vasco and Greenberg, Noam and Kalimullin, Iskander and Soskova, Mariya (eds.), Special issue: Oberwolfach Workshop on Computability Theory 2021, vol. 11 of Computability - The Journal of the Association CiE, IOS Press, 2022 Brattka, Vasco, Stashing-Parallelization Pentagons, Logical Methods in Computer Science 17:4 (2021) 20:1-20:29 Brattka, Vasco and Gherardi, Guido, Completion of Choice, Annals of Pure and Applied Logic 172:3 (2021) 102914 Brattka, Vasco and Gherardi, Guido and Pauly, Arno, Weihrauch Complexity in Computable Analysis, in: Brattka, Vasco and Hertling, Peter (eds.), Handbook of Computability and Complexity in Analysis, Theory and Applications of Computability, Springer, Cham, 2021, pages 367-417 Brattka, Vasco and Greenberg, Noam and Kalimullin, Iskander and Soskova, Mariya, Computability theory, Oberwolfach Reports 18:2 (2021) 1149-1190 Brattka, Vasco and Hertling, Peter (eds.), Handbook of Computability and Complexity in Analysis, Theory and Applications of Computability, Springer, Cham, 2021 Brattka, Vasco and Gherardi, Guido, Weihrauch Goes Brouwerian, The Journal of Symbolic Logic 85:4 (2020) 1614-1653 Brattka, Vasco and Dzhafarov, Damir and Marcone, Alberto and Pauly, Arno (eds.), Special issue: Dagstuhl Seminar on Measuring the Complexity of Computational Content 2018, vol. 9 of Computability - The Journal of the Association CiE, IOS Press, 2020 Brattka, Vasco and Le Roux, Stéphane and Miller, Joseph S. and Pauly, Arno, Connected Choice and the Brouwer Fixed Point Theorem, Journal of Mathematical Logic 19:1 (2019) 1-46 Brattka, Vasco and Downey, Rod G. and Knight, Julia F. and Lempp, Steffen (eds.), Special issue: Oberwolfach Workshop on Computability Theory 2018, vol. 8 of Computability - The Journal of the Association CiE, IOS Press, 2019 Brattka, Vasco and Dzhafarov, Damir D. and Marcone, Alberto and Pauly, Arno (eds.), Measuring the Complexity of Computational Content: From Combinatorial Problems to Analysis (Dagstuhl Seminar 18361), vol. 8 of Dagstuhl Reports, Schloss Dagstuhl-Leibniz-Zentrum für Informatik, Dagstuhl, Germany, 2019 Brattka, Vasco, A Galois connection between Turing jumps and limits, Logical Methods in Computer Science 14:3:13 (2018) 1-37 Brattka, Vasco and Downey, Rod and Knight, Julia F. and Lempp, Steffen, Computability theory, Oberwolfach Reports 15:1 (2018) 5-41 Brattka, Vasco and Hendtlass, Matthew and Kreuzer, Alexander P., On the Uniform Computational Content of the Baire Category Theorem, Notre Dame Journal of Formal Logic 59:4 (2018) 605-636 Brattka, Vasco and Pauly, Arno, On the Algebraic Structure of Weihrauch Degrees, Logical Methods in Computer Science 14:4:4 (2018) 1-36 arXiv Preprints All Publications Bibliographic Information Web of Science (Clarivate) Scopus (Elsevier) Mathematical Reviews (AMS) Digital Library (ACM) Computer Science Bibliography (dblp) Google Scholar ORCID Current Events Oberwolfach Workshop, Mathematical Logic: Proof Theory, Constructive Mathematics, Oberwolfach, Germany, 15-20 November 2026 (Invited participant) CCA 2026, Twenty-Third International Conference on Computability and Complexity in Analysis, Trier, Germany, 29-31 July 2026 (Chair of the steering committee) CiE 2026, Computability in Europe, Trier, Germany, 27-31 July 2026 (Co-chair of the programme committee) 13th Annual Conference of the Iranian Association for Logic, Logic in AI, virtual, 16-17 February 2026 (Invited talk) CCA 2025, Twenty-Second International Conference on Computability and Complexity in Analysis, Kyoto, Japan, 24-26 September 2025 (Chair of the steering committee) CiE 2025, Computability in Europe, Lisbon, Portugal, 14-18 July 2025 (Contributed talk) Dagstuhl Seminar, Weihrauch Complexity: Structuring the Realm of Non-Computability, Dagstuhl, Germany, 23-28 March 2025 (Co-Organizer) CT 2024, Seminar on Computable Topology, Kochel am See, Germany, 13-15 September 2024 (Co-organizer) CCA 2024, Twenty-First International Conference on Computability and Complexity in Analysis, Swansea, UK, 15-18 July 2024 (Chair of the steering committee) Oberwolfach Workshop, Mathematical Logic: Proof Theory, Constructive Mathematics, Oberwolfach, Germany, 12-18 November 2023 (Invited participant) CCA 2023, Twentieth International Conference on Computability and Complexity in Analysis, Dubrovnik, Croatia, 7-9 September 2023 (Chair of the steering committee ) CiE 2023, Computability in Europe, Batumi, Georgia, 24-28 July 2023 (Member of the programme committee) CCR 2023, 16th International Conference on Computability, Complexity and Randomness, Kochel am See, Germany, 10-14 July 2023 (Co-organizer) Online Machine Learning Seminar, The University of Nottingham, Nottingham, UK, 14 June 2023 (Invited seminar talk) Logic Colloquium 2023, ASL European Summer Meeting, Milano, Italy, 5-9 June 2023 (Special session organizer) Séminaire Général de Logique, Institut de Mathématiques de Jussieu-Paris Rive Gauche, Paris, France, 27 March 2023 (Seminar presentation) 10th Annual Conference of the Iranian Logic Association, Tehran, Iran, 22-23 February 2023 (Invited talk) UNESCO World Logic Day Seminar, Cross-Alps Logic Seminar, Università degli Studi di Torino, Italy, online, 13 January 2023 (Invited presentation) Colloquium Logicum, Konstanz, Germany, 26-28 September 2022 (Contibuted talk) DiL 2022, Days in Logic, Faro, Portugal, 30 June - 2 July 2022 (Invited tutorial speaker) All Events",
  "content_length": 8662,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:42"
}