{
  "name": "Vasiliki Tsaknaki",
  "homepage": "https://pure.itu.dk/portal/en/persons/vasiliki-tsaknaki(805cae2a-3462-4130-88de-cc7d94aec0a5).html",
  "status": "success",
  "content": "Vasiliki Tsaknaki - IT-University of Copenhagen Vasiliki Tsaknaki Associate Professor, Human-Computer Interaction and DesignAcademic Responsible, ETHOS LabAIR Lab https://orcid.org/0000-0003-2235-6078 Emailvatsitudk 20202025 Research activity per year Personal profile CurriculumVasiliki Tsaknaki is an Associate Professor in Interaction Design at the IT University of Copenhagen, working in the Digital Design department. She is affiliated to the AIR Lab, IxD Lab and ETHOS Lab at ITU. Her research includes working with smart and craft materials for designing interactive and tangible artefacts, studying new approaches for designing with and for the body in HCI aiming to create rich somatic experiences with technologies, and designing with data. She is also working with exploratory and critical perspectives on movement-based interactions, biosensing technologies, and felt and intimate experiences evoked through wearable technologies. In her PhD dissertation titled Making Preciousness: Interaction Design through Studio Crafts, she studied the concept of preciousness through crafts for interaction design, including how to design for value- Additionally, she studied the concepts of impermanence, incompleteness and imperfection for interaction design, through the wabi-sabi Japanese philosophy. KeywordsBiodatacritical designCultural probesDesign researchDigital activismDigital aestheticsElectronicsembodied interactionExperience designFormgivingHCI: human-computer interactionHealthcareInput/output devicesInteraction designMakingMaterial computingMobile devicesQualitative methodsshape-changing interfacesTangible interactionWearable HCIArt & technology Fingerprint Dive into the research topics where Vasiliki Tsaknaki is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Soma Design Keyphrases 100% Biodata Keyphrases 68% Designer Arts and Humanities 65% Human-Computer Interaction Computer Science 55% More-than-human Keyphrases 47% Human Body Keyphrases 46% Reproductive Organs Keyphrases 46% Soma Keyphrases 43% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2020 2021 2022 2023 2025 20 Article in proceedings 5 Journal article 4 Paper 3 Book chapter 2 More 2 Conference abstract in proceedings Research output per year Research output per year Imagining a Soft and Relational Smart HomeJenkins, T., Tsaknaki, V. & Jørgensen, S. M. H., 6 Aug 2025, Nordic Design Research Conference. Design Research Society, 14 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Smart Home 100% Internet-Of-Things 100% Real Time 100% Humidity Sensor 100% Domestic Context 25% The Centers and Margins of Modeling Humans in Well-being TechnologiesZhu, J., Sanches, P., Tsaknaki, V., van der Maden, W. & Kaklopoulou, I., 25 Apr 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. New York: Association for Computing Machinery, p. 1-16 16 p. 518Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Machine Learning 100% Learning System 100% Machine Learning Modeling 100% Case Study 100% Learning Model 100% Knotting data as a feminist approach to data materializationTsaknaki, V., Reime, L., Cohn, M. & Pérez-Bustos, T., 2024, DRS2024. 19 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Feminist Approach 100% Data Materialization 100% Academic Institution 100% Technology Data 100% Pandemic 100% Mapping Futures and Futuring in HCI/DesignJenkins, T., Tsaknaki, V., Boer, L., Kun, P., Howell, N., Wong, R., Campo Woytuk, N. & Søndergaard, M. L. J., 1 Jul 2024, Proceedings of the Designing Interactive Systems Conference 2024. Association for Computing Machinery, p. 458-461 4 p.Research output: Conference Article in Proceeding or Book/Report chapter › Conference abstract in proceedings › Research › peer-review Open AccessFile HCI Design 100% Human-Computer Interaction 100% Design Artefacts 50% Geographical Location 50% Design Researchers 50% Collision DesignMarshall, J., TENNENT, P., Li, C., Núñez Pacheco, C., Garrett, R., Tsaknaki, V., HÖÖK, K., Caleb-Solly, P. & Benford, S., 2023, CHI EA '23: Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing SystemsApril 2023Article No.: 411. Pages 1–9. Association for Computing MachineryResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile View all 34 research outputs Projects Projects per year 2023 2023 2024 1 Finished Projects per year NORDICFAB: Speculating and intervening in Nordic Technological Wellbeing ImaginariesTsaknaki, V. (PI), Boer, L. (CoI) & Jenkins, T. (CoI)NordForsk01/01/2023 → 31/12/2024Project: Research Imaginaries 100% Well-being 100% Speculating 100% Fabulation 100% Occupational Career 100% Activities Activities per year 2022 2022 2022 1 Lecture and oral contribution Activities per year Materializing Bodily Relations to Data Worlds through KnottingTatjana Reime, L. (Speaker), Tsaknaki, V. (Speaker), Cohn, M. (Speaker) & Pérez-Bustos, T. (Speaker)1 Jul 2022Activity: Talk or presentation types › Lecture and oral contribution",
  "content_length": 5761,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:51"
}