{
  "name": "Vasilis Vassalos",
  "homepage": "https://www.aueb.gr/en/faculty_page/vassalos-vasilios",
  "status": "success",
  "content": "Vassalos Vasilios | Athens University of Economics and Business Vassalos Vasilios Department of Informatics E-mail: vassalos@aueb.gr Office Address: 2, Troias, Kimolou & Spetson Str., 4th Floor, Office 401 Phone: +30 210 - 8203 124 Vasilis Vassalos is leading the Information Processing Lab and is the Director of the MSc in Data Science. He serves in AUEB since 2004, and before that he served as Assistant Professor in the Stern School of Business at NYU and the founder and CTO of a venture-funded data integration startup company acquired by a multinational public software company. In 2013 he was a visiting professor of the Information and Communication School of EPFL. During the 2007-2008 academic year he was a Marie Curie Outgoing International Fellow of the European Commission and a Visiting Scholar at the CSE Department of UC San Diego for fall-winter 2007. Professor Vassalos is the recipient of numerous awards and has been Principal Investigator for over 15 funded research and advanced development projects since his arrival at AUEB in 2004. He is the author of over 70 technical publications and two US patents. Vassalos is the cofounder of the pioneering software company Enosys Software, maker of the first XQuery based data integration platform and distributed XQuery engine. Enosys Software was sold to BEA Systems in 2003. He is a PI of the FET Flaghship Human Brain Project since the beginning, and was a member of the Stakeholder Board of the Project in 2016-2018. He was member of the Board of Directors of the Observatory of the Greek Information Society, a member of the advisory board of the US-based high technology company Lingospot, and an advisor and consultant to industry and public sector entities, as well as a mentor and investor in technology startups. He received a Diploma in Electrical and Computer Engineering from the National Technical University of Athens in 1994, and his MS and PhD in Computer Science from Stanford University in 1998 and 2000 respectively. His current research interests include Machine Learning applications to large scale business problems, Declarative Machine Learning, Query Processing and Optimization of Complex, Heterogeneous Data, and large-scale Data Integration/Data Cleaning. Full CV:[pdf] * Το Οικονομικό Πανεπιστήμιο Αθηνών δεν φέρει καμία ευθύνη όσον αφορά στην ακρίβεια των στοιχείων του συνοπτικού και του πλήρους βιογραφικού των μελών του προσωπικού, όπως αυτά αναρτώνται στην ιστοσελίδα του. Η ευθύνη ανήκει αποκλειστικά και μόνο στους συντάκτες των βιογραφικών σημειωμάτων. Contact 76, Patission Str. GR-10434, AthensMap Contact Education: diekp@aueb.gr Administrative Services: protocol@aueb.gr Webpage: webmaster@aueb.gr Digital Services: support@aueb.gr Sitemap Sitemap CONNECT WITH US © Copyright 1996 - 2025 | Οικονομικό Πανεπιστήμιο Αθηνών © Copyright 1996 - 2025 | Athens University of Economics and Business THE UNIVERSITY Rector's Welcome University Leadership Strategy Campus & Facilities 100 Years of AUEB History International Recognition & Rankings Collaborations Social Impact Quality Assurance Ethics and Good Practice EDUCATION SCHOOL OF ECONOMIC SCIENCES Department of International & European Economic Studies Department of Economics SCHOOL OF BUSINESS Department of Management Science and Technology Department of Business Administration Department of Accounting and Finance Department of Marketing and Communication SCHOOL OF INFORMATION SCIENCES AND TECHNOLOGY Department of Informatics Department of Statistics BACHELOR FOR INTERNATIONAL STUDENTS Bachelor in International Business & Technology GRADUATE STUDIES Master's Programs Doctoral Studies DOUBLE DEGREE PROGRAMS ERASMUS+ LIFELONG LEARNING (KEDIVIM/OPA) TEACHER EDUCATION PROGRAMME AUEB IN THE WORLD Internationalisation UNIVERSITY LIFE AUEB Student Club Library Life in Athens Student Clubs Volunteer Program Gender Equality EMPLOYMENT & CAREER Athens Center for EntrePreneurship & Innovation (ACEin) Employment and Career Services Jobs ALUMNI Alumni Network Alumni Stories CONNECT WITH US myAUEB app Contact Library Web-Outlook OLD-Webmail e-Secretariat U-Register E-class All Network Services AUEB-Shop Complaints Electronic Services Support CHOOSE LANGUAGE ΕΛΛΗΝΙΚΑ ENGLISH Search for:",
  "content_length": 4254,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:53"
}