{
  "name": "Vasile Rus",
  "homepage": "https://www.memphis.edu/cs/people/faculty_pages/vasile-rus.php",
  "status": "success",
  "content": "Vasile Rus - Computer Science - The University of Memphis Skip to main content SearchX Safety & Security Prospective Students Current Students Parents & Family Alumni Veterans Faculty & Staff People Take Action Follow Us Online FacebookLinkedIn Home Computer Science People Faculty Pages Vasile Rus Vasile Rus Jack and Jane Morris Professor Phone 901.678.5259 Email vrus@memphis.edu Fax 901.678.1506 Office Dunn Hall 323/STEM 304 Office Hours Call for hours Degree: PhD, Computer Science, Southern Methodist University, 2002 Research Interests:Artificial intelligence/intelligent systems, data science, natural language processing Personal Website:http://www.cs.memphis.edu/~vrus/ Google Scholar Dr. Vasile Rus joined the Department of Computer Science at the University of Memphis in 2004. He is also a member of the Institute for Intelligent Systems at the University of Memphis. Before that, Dr. Rus was an Assistant Professor at Indiana University (2003-2004). Dr. Rus conducts state-of-the-art research and teaching in the area of language and information processing. He has been exploring fundamental topics such as natural language based knowledge representations, semantic similarity, and question answering as well as applications such as intelligent tutoring systems and software defect knowledge management. Dr. Rus has received research awards to support his work from the National Science Foundation, Institute for Education Sciences, Office of Naval Research, and other federal agencies. He has been a Principal Investigator or co-Principal Investigator on awards totaling more than $20 million. For his work on automated methods to handle software defect reports in large-scale software development projects, Dr. Rus has been named a Systems Testing Research Fellow of the FedEx Institute of Technology. Dr. Rus has published more than 150 scientific articles in premier peer-reviewed international conferences and journals, as well as book chapters. He has received several best paper awards at international conferences, and all of his PhD students have earned research awards for their work under him. Furthermore, his students have received summer internships at prestigious research labs such as Stanford Research Institute, AT&T Research Labs, Vulcan, and IBM. Among other accomplishments, Dr. Rus is an Associate Editor of the International Journal of Artificial Intelligence Tools and has been coordinating the local chapter of the North American Computational Linguistics Olympiad, which involves working with high-school students and teachers. In 2011, one of the local high-school students made it to Team USA and won a silver and gold medal at the International Linguistics Olympiad.",
  "content_length": 2710,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:44"
}