{
  "name": "Vasileios Karakostas",
  "homepage": "https://www.di.uoa.gr/~vkarakos",
  "status": "success",
  "content": "Vasileios Karakostas home page Vasileios Karakostas Assistant Professor National and Kapodistrian University of Athens Department of Informatics and Telecommunications e-mail: vkarakos _at_ di.uoa.gr [About] [News] [Publications] [Supervision] [Teaching] [Service] [Google Scholar] [DBLP] [Twitter] [Contact] About me Welcome to my home page! My name is Vasileios (Vasilis) Karakostas. I am an Assistant Professor at the Department of Informatics and Telecommunications of the National and Kapodistrian University of Athens. I am member of the Computer Architecture Lab. My research interests lie in the areas of computer architecture, memory systems, hardware/OS interaction, operating systems, resource management, and parallel systems. Before joining the University of Athens, I was a postdoctoral researcher at the Computing Systems Lab of the School of Electrical and Computer Engineering of the National Technical University of Athens. I received my PhD degree in Computer Architecture from Universitat Politecnica de Catalunya and Barcelona Supercomputing Center. If you are interested in doing research on topics related to computer architecture, HW/OS interaction, and systems, feel free to reach out! I am looking for students at all levels; undergraduate, master, and PhD students. Research Interests I am working on topics related to memory systems, and particularly on virtual memory, memory management, cache management, and recently on non-volatile memories. I am also working on topics related to resource management and resource efficiency in data centers, and I am particularly interested in exploring challenges related to serverless computing. My PhD thesis focused on analyzing and improving the performance and energy-efficiency of virtual memory. EU Projects I am currently working on the Vitamin-V, Neuropuls, and REBECCA Horizon Europe research projects. During my postdoctoral research at CSLab, I worked on the DAPHNE and the ACTiCLOUD EU H2020 research projects. Publications 2024 BypassD: Enabling fast userspace access to shared SSDs Sujay Yadalam, Chloe Alverti, Vasileios Karakostas, Jayneel Gandhi, Michael Swift 29th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2024) Distinguished Artifact Award [PDF] [slides] [lightning talk] [code] gem5-MARVEL: Microarchitecture-Level Resilience Analysis of Heterogeneous SoC Architectures Odysseas Chatzopoulos, George Papadimitriou, Vasileios Karakostas, and Dimitris Gizopoulos 30th IEEE International Symposium on High-Performance Computer Architecture (HPCA 2024) [PDF] [slides] 2023 Impact of Voltage Scaling on Soft Errors Susceptibility of Multicore Server CPUs Dimitris Agiakatsikas, George Papadimitriou, Vasileios Karakostas, Dimitris Gizopoulos, Mihalis Psarakis, Camille Belanger-Champagne, and Ewart Blackmore 56th IEEE/ACM International Symposium on Microarchitecture (MICRO 2023) [PDF] [slides] DAPHNE Runtime: Harnessing Parallelism for Integrated Data Analysis Pipelines Aristotelis Vontzalidis, Dimitrios Tsoumakos, Stratos Psomadakis, Constantinos Bitsakos, Mark Dokter, Kevin Innerebner, Patrick Damme, Matthias Boehm, Florina Ciorba, Ahmed Eleliemy, Vasileios Karakostas and Aleš Zamuda Posters & Demos in 29th International European Conference on Parallel and Distributed Computing (Euro-Par 2023) [PDF] [code] Vitamin-V: Virtual Environment and Tool-boxing for Trustworthy Development of RISC-V based Cloud Services Ramon Canal, Cristiano Chenet, Angelos Arelakis, José Maria Arnau, Josep Ll. Berral, Aaron Call, Stefano Di Carlo, Juan José Costa, Dimitris Gizopoulos, Vasileios Karakostas, Francesco Lubrano, Konstantinos Nikas, Yiannis Nikolakopoulos, Beatriz Otero, George Papadimitriou, Ioannis Papaefstathiou, Dionisios Pnevmatikatos, Daniel Raho, Alvise Rigo, Eva Rodríguez, Alessandro Savino, Alberto Scionti, Nikolaos Tampouratzis, and Alex Torregrosa 26th Euromicro Conference Series on Digital System Design (DSD 2023) & Poster in RISC-V Summit Europe 2023 [PDF] [Extended abstract] Enabling Design Space Exploration of RISC-V Accelerator-rich Computing Systems on gem5 Odysseas Chatzopoulos, George Papadimitriou, Vasileios Karakostas, and Dimitris Gizopoulos Poster in RISC-V Summit Europe 2023 [PDF] [poster] Validation, Verification, and Testing (VVT) of future RISC-V powered cloud infrastructures: the Vitamin-V Horizon Europe Project perspective Marti Alonso, David Andreu, Ramon Canal, Stefano Di Carlo, Cristiano Pegoraro Chenet, Juanjo Costa, Andreu Girones, Dimitris Gizopoulos, Vasileios Karakostas, Beatriz Otero, George Papadimitriou, Eva Rodríguez, and Alessandro Savino 28th IEEE European Test Symposium (ETS 2023) [PDF] NEUROPULS: NEUROmorphic energy-efficient secure accelerators based on Phase change materials aUgmented siLicon photonicS Fabio Pavanello, Cédric Marchand, Ian O'Connor, Régis Orobtchouk, Fabien Mandorlo, Xavier Letartre, Sébastien Cueff, Elena Ioana Vatajelu, Giorgio Di Natale, Benoit Cluzel, Aurelien Coillet, Benoît Charbonnier, Pierre Noe, Frantisek Kavan, Martin Zoldak, Michal Szaj, Peter Bienstman, Thomas Van Vaerenbergh, Ulrich Rührmair, Paulo F. Flores, Luís Guerra e Silva, Ricardo Chaves, Luís Miguel Silveira, Mariano Ceccato, Dimitris Gizopoulos, George Papadimitriou, Vasileios Karakostas, Axel Brando, Francisco J. Cazorla, Ramon Canal, Pau Closas, Adria Gusi-Amigo, Paolo Crovetti, Alessio Carpegna, Tzamn Melendez Carmona, Stefano Di Carlo, and Alessandro Savino 28th IEEE European Test Symposium (ETS 2023) [PDF] FaaSCell: A Case for Intra-node Resource Management: Work-In-Progress Christos Katsakioris, Chloe Alverti, Konstantinos Nikas, Stratos Psomadakis, Vasileios Karakostas, and Nectarios Koziris 1st Workshop on SErverless Systems, Applications and MEthodologies (SESAME 2023) - held in conjunction with EuroSys 2023 [PDF] 2022 DaxVM: Stressing the Limits of Memory as a File Interface Chloe Alverti, Vasileios Karakostas, Nikhita Kunati, Georgios Goumas, and Michael Swift 55th IEEE/ACM International Symposium on Microarchitecture (MICRO 2022) [PDF] [slides] [code] FaaS in the Age of (sub-)μs I/O: A Performance Analysis of Snapshotting Christos Katsakioris, Chloe Alverti, Vasileios Karakostas, Konstantinos Nikas, Georgios Goumas, and Nectarios Koziris 15th ACM International System and Storage Conference (SYSTOR 2022) [PDF] [slides] [video] [code] DAPHNE: An Open and Extensible System Infrastructure for Integrated Data Analysis Pipelines Patrick Damme, Marius Birkenbach, Constantinos Bitsakos, Matthias Boehm, Philippe Bonnet, Florina Ciorba, Mark Dokter, Pawel Dowgiallo, Ahmed Eleliemy, Christian Faerber, Georgios Goumas, Dirk Habich, Niclas Hedam, Marlies Hofer, Wenjun Huang, Kevin Innerebner, Vasileios Karakostas, Roman Kern, Tomaž Kosar, Alexander Krause, Daniel Krems, Andreas Laber, Wolfgang Lehner, Eric Mier, Marcus Paradies, Bernhard Peischl, Gabrielle Poerwawinata, Stratos Psomadakis, Tilmann Rabl, Piotr Ratuszniak, Pedro Silva, Nikolai Skuppin, Andreas Starzacher, Benjamin Steinwender, Ilin Tolovski, Pınar Tözün, Wojciech Ulatowski, Yuanyuan Wang, Izajasz Wrosz, Aleš Zamuda, Ce Zhang, and Xiao Xiang Zhu 12th Annual Conference on Innovative Data Systems Research (CIDR 2022) [PDF] [slides] [video] [code] 2021 Exploiting Page Table Locality for Agile TLB Prefetching Georgios Vavouliotis, Lluc Alvarez, Vasileios Karakostas, Konstantinos Nikas, Nectarios Koziris, Daniel A. Jimenez, and Marc Casas 48th International Symposium on Computer Architecture (ISCA 2021) [PDF] [slides (pdf)] [lightning talk] [poster] [video] SynCron: Efficient Synchronization Support for Near-Data-Processing Architectures Christina Giannoula, Nandita Vijaykumar, Nikela Papadopoulou, Vasileios Karakostas, Ivan Fernandez, Juan Gómez Luna, Lois Orosa, Nectarios Koziris, Georgios Goumas, and Onur Mutlu 27th IEEE International Symposium on High-Performance Computer Architecture (HPCA 2021) [PDF] [slides] [lightning talk] [video] 2020 A Configurable TLB Hierarchy for the RISC-V Architecture Nikolaos Charalampos Papadopoulos, Vasileios Karakostas, Konstantinos Nikas, Nectarios Koziris, and Dionisios N. Pnevmatikatos 30th International Conference on Field-Programmable Logic and Applications (FPL 2020) [PDF] [slides] [video] [code] Enhancing and Exploiting Contiguity for Fast Memory Virtualization Chloe Alverti, Stratos Psomadakis, Vasileios Karakostas, Jayneel Gandhi, Konstantinos Nikas, Georgios Goumas, and Nectarios Koziris 47th International Symposium on Computer Architecture (ISCA 2020) [PDF] [slides] [lightning talk] [video] [code] Enabling Virtual Memory Research on RISC-V with a Configurable TLB Hierarchy for the Rocket Chip Generator Nikolaos Charalampos Papadopoulos, Vasileios Karakostas, Konstantinos Nikas, Nectarios Koziris, and Dionisios N. Pnevmatikatos Fourth Workshop on Computer Architecture Research with RISC-V (CARRV 2020) [PDF] [slides] [video] [code] 2019 ACTiManager: An end-to-end interference-aware cloud resource manager Stratos Psomadakis, Stefanos Gerangelos, Dimitrios Siakavaras, Ioannis Papadakis, Marina Vemmou, Aspa Skalidi, Vasileios Karakostas, Konstantinos Nikas, Nectarios Koziris, and Georgios Goumas. Demo & Poster in 20th International Middleware Conference (Middleware 2019) [PDF] [poster] [demo] [code] DICER: Diligent Cache Partitioning for Efficient Workload Consolidation Konstantinos Nikas, Nikela Papadopoulou, Dimitra Giantsidi, Vasileios Karakostas, Georgios Goumas, and Nectarios Koziris. 48th International Conference on Parallel Processing (ICPP 2019) [PDF] [slides] 2018 Performance Prediction of NUMA Placement: A Machine-Learning Approach Fanourios Arapidis, Vasileios Karakostas, Nikela Papadopoulou, Konstantinos Nikas, Georgios Goumas, and Nectarios Koziris. 1st International Workshop on Next Generation Clouds for Extreme Data (XtremeCLOUD 2018) - held in conjunction with CloudCom 2018 [PDF] [slides] Efficient Resource Management for Data Centers: The ACTiCL",
  "content_length": 16043,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:57"
}