{
  "name": "Vasilis Gkatzelis",
  "homepage": "https://www.cs.drexel.edu/~gkatz",
  "status": "success",
  "content": "Vasilis Gkatzelis Vasilis Gkatzelis Home Research CV Vasilis Gkatzelis I am an associate professor of computer science at the College of Computing & Informatics of Drexel University and a member of the Drexel EconCS research group. I am also an affiliate researcher at Archimedes/Athena RC, Greece. Previous Appointments: Jan. 2024 -Jun. 2025 [sabbatical+part time appointment]: faculty visitor at Google Research in NYC Spring 2016: postdoc at UC Berkeley hosted by Christos Papadimitriou and Eric Friedman Fall 2015: research fellow at the Simons Institute for the Theory of Computing at UC Berkeley 2013-2015: postdoc at Stanford University hosted by Tim Roughgarden Education: PhD (2013): Courant Institute of New York University (advised by Richard Cole) Diploma (2007): Computer Engineering and Informatics of University of Patras Recent Conference Publications Procurement Auctions with Predictions: Improved Frugality for Facility Location (with E. Balkanski, N. DeFilippis, and X. Tan) NeurIPS 2025 Simultaneously Satisfying MXS and EFL (with A. Ashuri) EC 2025 Optimal Metric Distortion for Matching on the Line (with A. Filos-Ratsikas, M. Latifian, E. Rewinski, and A.A. Voudouris) IJCAI 2025 Procurement Auctions with Best and Final Offers (with R.P. McAfee and R. Paes Leme) WWW 2025 EF2X Exists For Four Agents (with A. Ashuri and A. Sgouritsa) AAAI 2025 Clock Auctions Augmented with Unreliable Advice (with D. Schoepflin and X. Tan) SODA 2025 Randomized Strategic Facility Location with Predictions (with E. Balkanski and G. Shahkarami) NeurIPS 2024 Learning-Augmented Metric Distortion via (p,q)-Veto Core (with B. Berger, M. Feldman, and X. Tan) EC 2024 Online Mechanism Design with Predictions (with E. Balkanski, X. Tan, and C. Zhu) EC 2024 Getting More by Knowing Less: Bayesian Incentive Compatible Mechanisms for Fair Division (with A. Psomas, X. Tan, and P. Verma) IJCAI 2024 EFx Budget-Feasible Allocations with High Nash Welfare (with M. Garbea and X. Tan) ECAI 2023 Best of Both Distortion Worlds (with M. Latifian and N. Shah) EC 2023 Proportionally Fair Online Allocation of Public Goods with Predictions (with S. Banerjee, S. Hossain, B. Jin, E. Micha, and N. Shah) IJCAI 2023 Optimal Data Acquisition with Privacy-Aware Agents (with R. Cummings, H. Elzayn, E. Pountourakis, and J. Ziani) SaTML 2023 Strategyproof Scheduling with Predictions (with E. Balkanski and X. Tan) ITCS 2023 Learning-Augmented Mechanism Design (with P. Agrawal, E. Balkanski, T. Ou, and X. Tan) EC 2022 Bayesian and Randomized Clock Auctions (with M. Feldman, N. Gravin, and D. Schoepflin) EC 2022 Improved Price of Anarchy via Predictions (with K. Kollias, A. Sgouritsa, and X. Tan) EC 2022 Beyond Cake Cutting: Allocating Homogeneous Divisible Goods (with I. Caragiannis, A. Psomas, and D. Schoepflin) AAMAS 2022 Optimal Deterministic Clock Auctions and Beyond (with G. Christodoulou and D. Schoepflin) at ITCS 2022 Online Nash Social Welfare Maximization with Predictions (with S. Banerjee, A. Gorokh, and B. Jin) at SODA 2022 Deterministic Budget-Feasible Clock Auctions (with E. Balkanski, P. Garimidi, D. Schoepflin, and X. Tan) at SODA 2022 Prior-Free Clock Auctions for Bidders with Interdependent Values (with R. Patel, E. Pountourakis, and D. Schoepflin) at SAGT 2021 Resource-Aware Cost-Sharing Mechanisms with Priors (with E. Pountourakis and A. Sgouritsa) at EC 2021 PROPm Allocations of Indivisible Goods to Multiple Agents (with A. Baklanov, P. Garimidi, and D. Schoepflin) at IJCAI 2021 Fair and Efficient Online Allocations with Normalized Valuations (with A. Psomas and X. Tan) at AAAI 2021 Achieving Proportionality up to the Maximin Item with Indivisible Goods (with A. Baklanov, P. Garimidi, and D. Schoepflin) at AAAI 2021 Resolving the Optimal Metric Distortion Conjecture (with D. Halpern and N. Shah) at FOCS 2020 Resource-Aware Protocols for Network Cost-Sharing Games (with G. Christodoulou, A. Sgouritsa, and M. Latifian) at EC 2020 A Truthful Cardinal Mechanism for One-Sided Matching (with R. Abebe, R. Cole, and J. Hartline) at SODA 2020 Service Journal Editorial Boards: Games and Economic Behavior (GEB) ACM Transactions on Economics and Computation (TEAC) Conference Program Committees: ACM-SIAM Symposium on Discrete Algorithms (SODA: 2022) ACM Conference on Economics & Computation (EC: 2025, 2024, 2023, 2022, 2021, 2020, 2019, 2018, 2017, 2016, 2015) Conference on Web and Internet Economics (WINE: 2024, 2023, 2021, 2020, 2019, 2018, 2017, 2016, 2015, 2014) Conference on Artificial Intelligence (AAAI: 2026, 2025, 2024, 2022, 2021, 2020, 2018, 2017) International Joint Conference on Artificial Intelligence (IJCAI: 2024, 2023, 2022, 2021, 2020, 2018, 2017, 2016) International World Wide Web Conference (WWW: 2019, 2018, 2017) International Symposium on Algorithmic Game Theory (SAGT: 2018) International Conference on Autonomous Agents & Multiagent Systems (AAMAS: 2025, 2017) AAAI/ACM Conference on Artificial Intelligence, Ethics, and Society (AEIS: 2019) Workshop on the Economics of Networks, Systems and Computation (NetEcon: 2019) Teaching Drexel Computer Science Theory reading group (since 2018) CS621 \"Approximation Algorithms\" (Spring 2020) CS618 \"Algorithmic Game Theory\" (Spring 2019) CS457 \"Data Structures and Algorithms I\" (every Fall from 2016 to 2025, except 2022) CS525 \"Theory of Computation\" (Spring 2018 and Winter 2023) CST680 \"Economics and Computation\" (Spring 2017) PhD Students Daniel Schoepflin (graduated in 2023, currently a postdoctoral fellow at DIMACS) Xizhi Tan (graduated in 2025, currently a postdoctoral fellow at Stanford University) Josh Ascher Emma Rewinski NSF Funding (CCF-AF) CAREER: \"Optimal Mechanism Design without Monetary Transfers\" (2/2021-1/2026) SMALL: \"Mechanisms with Predictions\" (10/2022-10/2025) SMALL: \"The Efficiency of Clock Auctions\" (7/2020-7/2023) CRII: \"Practical Auction Design Using the Deferred-Acceptance Framework\" (2/2018-1/2020) Contact gkatz@drexel.edu Tel: +1 (215) 895-5875 3675 Market Street, Office 1176 https://www.cs.drexel.edu/~gkatz/",
  "content_length": 6058,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:51"
}