{
  "name": "Vasileios Koutavas",
  "homepage": "https://www.scss.tcd.ie/Vasileios.Koutavas",
  "status": "success",
  "content": "Dr. Vasileios Koutavas Dr. Vasileios Koutavas Assistant Professor in Software Systems School of Computer Science and Statistics Trinity College Dublin Member of Lero, the Science Foundation Ireland Research Centre for Software School of Computer Science and Statistics Trinity College Dublin, Dublin 2, Ireland Room G37, O'Reilly Institute map +353 1 896 1115 @ Open Positions PhD Position in Programming Languages and Concurrency Teaching CSU22011 - Algorithms and Data Structures I [blackboard] CSU44004/CSU55004 - Formal Verification [blackboard] Publications all publications DBLP Research Programming Languages and Concurrency: I study the mathematical/logical foundations of programming languages and concurrent systems to create models and proof techniques which can be used to weed out bugs from code. I'm particularly interested in programs and systems combining higher-order features (e.g., callbacks and code transmission) with side-effects (e.g., state and communication). I am also interested in next-generation programming paradigms that can make multicore and distributed systems manageable to program. I am currently working on the foundational and practical aspects of a novel transactional construct called Communicating Transactions and on type systems which can express the communication patterns of software, callled Session Types. Some Active Projects Communicating Transactions (received funding from Microsoft Research and Science Foundation Ireland) Higher-Order Concurrency (received funding from Science Foundation Ireland) Behavioural Types (received funding from EU COST Action IC1201) Students Current: Aimee Borda (PhD Student) Former: Carlo Spaccasassi (PhD student) Jan Scherbaum (PhD Student) Maxime Lesourd (Summer 2015 intern) Filipe Belatti (Summer 2014 intern) Laércio Andrade Guimarães (Summer 2014 intern) Jan Scherbaum (Summer 2012 intern) Conferences & Workshops Combined 25th International Workshop on Expressiveness in Concurrency and 15th Workshop on Structural Operational Semantics (EXPRESS/SOS 2018) -- PC Member 33rd ACM Symposium on Applied Computing - Service-Oriented Architecture and Programming Track (SOAP 2018) -- PC Member 32nd ACM Symposium on Applied Computing - Service-Oriented Architecture and Programming Track (SOAP 2017) -- PC Member 31st ACM Symposium on Applied Computing - Service-Oriented Architecture and Programming Track (SOAP 2016) -- PC Member 7th Interaction and Concurrency Experience Workshop (ICE 2014) -- PC Member Second International Workshop on Behavioural Types (BEAT2 2013) -- PC Member Dublin Concurrency Workshop 2011 -- Co-organiser Miscellanea The TotCount LaTeX package for counting the number of items in a latex document. How to make Coq and ProofGeneral work with GNU Emacs on Windows. Last modified at Dec 01, 2021 - 11:36:01",
  "content_length": 2820,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:49"
}