{
  "name": "Vasileios P. Kemerlis",
  "homepage": "https://cs.brown.edu/~vpk",
  "status": "success",
  "content": "Vasileios P. Kemerlis Vasileios P. Kemerlis Email: echo @cs.brown.edu | sed 's/^/vpk/' Voice: +1 (401) 863-5787 X (Twitter): @vkemerlis Bluesky: @vkemerlis.bsky.social Mastodon: @vkemerlis@infosec.exchange Google Scholar – DBLP – ORCID – LinkedIn Department of Computer Science Brown University CIT 505 115 Waterman Street, Box 1910 Providence, RI 02912, USA I am an Associate Professor of Computer Science at Brown University. I'm interested in software, hardware, and systems security, with a focus on OS kernel protection, software hardening, fuzz testing, and information flow tracking. I'm also the director of the Secure Systems Lab (SSL) and recipient of the NSF CAREER Award. [Curriculum Vitae] Teaching CSCI 1650: Software Security and Exploitation (Fall 2016 -- 2025) CSCI 2951U: Topics in Software Security (Spring 2016 – 2018, 2020, 2021, 2024, 2025) Publications Conference Papers A. D. Kellas, N. Christou, W. Jiang, P. Li, L. Simon, Y. David, V. P. Kemerlis, J. C. Davis, and J. Yang. \"PickleBall: Secure Deserialization of Pickle-based Machine Learning Models\". 32nd ACM Conference on Computer and Communications Security (CCS). Taipei, Taiwan, October 2025. [Software] M. Momeu, A. J. Gaidis, J. v.d. Heidt, and V. P. Kemerlis. \"IUBIK: Isolating User Bytes in Commodity Operating System Kernels via Memory Tagging Extensions\". 46th IEEE Symposium on Security and Privacy (S&P). San Fransisco, CA, USA, May 2025. [Software] N. Christou, A. J. Gaidis, V. Atlidakis, and V. P. Kemerlis. \"Eclipse: Preventing Speculative Memory-error Abuse with Artificial Data Dependencies\". 31st ACM Conference on Computer and Communications Security (CCS). Salt Lake City, Utah, USA, October 2024. [Software] M. Momeu, S. Schnuckel, K. Angnis, M. Polychronakis, and V. P. Kemerlis. \"Safeslab: Mitigating Use-After-Free Vulnerabilities via Memory Protection Keys\". 31st ACM Conference on Computer and Communications Security (CCS). Salt Lake City, Utah, USA, October 2024. [Software] D. Jin, A. J. Gaidis, and V. P. Kemerlis. \"BeeBox: Hardening BPF against Transient Execution Attacks\". 33rd USENIX Security Symposium (USENIX Sec). Philadelphia, PA, USA, August 2024. [Software] M. Momeu, F. Kilger, C. Roemheld, S. Schnuckel, S. Proskurin, M. Polychronakis, and V. P. Kemerlis. \"ISLAB: Immutable Memory Management Metadata for Commodity Operating System Kernels\". 19th ACM Asia Conference on Computer and Communications Security (ASIA CCS). Singapore, July 2024. [Software] Y. David, N. Christou, A. D. Kellas, V. P. Kemerlis, and J. Yang. \"QUACK: Hindering Deserialization Attacks via Static Duck Typing\". 31st Network and Distributed System Security (NDSS) Symposium. San Diego, CA, USA, February 2024. [Software] A. J. Gaidis, V. Atlidakis, and V. P. Kemerlis. \"SysXCHG: Refining Privilege with Adaptive System Call Filters\". 30th ACM Conference on Computer and Communications Security (CCS). Copenhagen, Denmark, November 2023. [Software] A. J. Gaidis, J. Moreira, K. Sun, A. Milburn, V. Atlidakis, and V. P. Kemerlis. \"FineIBT: Fine-grain Control-flow Enforcement with Indirect Branch Tracking\". 26th International Symposium on Research in Attacks, Intrusions and Defenses (RAID). Hong Kong, HK, October 2023. [Software] N. Christou, D. Jin, V. Atlidakis, B. Ray, and V. P. Kemerlis. \"IvySyn: Automated Vulnerability Discovery for Deep Learning Frameworks\". 32nd USENIX Security Symposium (USENIX Sec). Anaheim, CA, USA, August 2023. [Software] D. Jin, V. Atlidakis, and V. P. Kemerlis. \"EPF: Evil Packet Filter\". 29th USENIX Annual Technical Conference (USENIX ATC). Boston, MA, USA, July 2023. [Software] G. Christou, G. Ntousakis, E. Lahtinen, S. Ioannidis, V. P. Kemerlis, and N. Vasilakis. \"BinWrap: Hybrid Protection against Native Node.js Add-ons\". 18th ACM Asia Conference on Computer and Communications Security (ASIA CCS). Melbourne, Australia, July 2023 (Distinguished Paper Award). [Software] N. Roessler, L. Atayde, I. Palmer, D. McKee, J. Pandey, V. P. Kemerlis, M. Payer, A. Bates, A. DeHon, J. M. Smith, and N. Dautenhahn. \"µSCOPE: A Methodology for Analyzing Least-Privilege Compartmentalization in Large Software Artifacts\". 24th International Symposium on Research in Attacks, Intrusions and Defenses (RAID). San Sebastian, Spain, October 2021. [Software] M. T. I. Ziad, M. Arroyo, E. Manzhosov, V. P. Kemerlis, and S. Sethumadhavan. \"EPI: Efficient Pointer Integrity for Securing Embedded Systems\". 1st IEEE International Symposium on Secure and Private Execution Environment Design (SEED). Worldwide Virtual Event, September 2021. N. DeMarinis, K. Williams-King, D. Jin, R. Fonseca, and V. P. Kemerlis. \"sysfilter: Automated System Call Filtering for Commodity Software\". 23rd International Symposium on Research in Attacks, Intrusions and Defenses (RAID). San Sebastian, Spain, October 2020. [Software] S. Proskurin, M. Momeu, S. Ghavamnia, V. P. Kemerlis, and M. Polychronakis. \"xMP: Selective Memory Protection for Kernel and User Space\". 41st IEEE Symposium on Security and Privacy (S&P). San Fransisco, CA, USA, May 2020. [Software] D. Williams-King, H. Kobayashi, K. Williams-King, G. Patterson, F. Spano, Y. J. Wu, J. Yang, and V. P. Kemerlis. \"Egalito: Layout-Agnostic Binary Recompilation\". 25th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS). Lausanne, Switzerland, March 2020. [Software] I. Agadakos, D. Jin, D. Williams-King, V. P. Kemerlis, and G. Portokalidis. \"Nibbler: Debloating Binary Shared Libraries\". 35th Annual Computer Security Applications Conference (ACSAC). San Juan, Puerto Rico, December 2019. [Software] N. DeMarinis, S. Tellex, V. P. Kemerlis, G. Konidaris, and R. Fonseca. \"Scanning the Internet for ROS: A View of Security in Robotics Research\". 36th IEEE International Conference on Robotics and Automation (ICRA). Montreal, Canada, May 2019. H. Koo, Y. Chen, L. Lu, V. P. Kemerlis, and M. Polychronakis. \"Compiler-assisted Code Randomization\". 39th IEEE Symposium on Security and Privacy (S&P). San Fransisco, CA, USA, May 2018. [Software] K. Sinha, V. P. Kemerlis, and S. Sethumadhavan. \"Reviving Instruction Set Randomization\". 9th IEEE International Symposium on Hardware Oriented Security and Trust (HOST). McLean, VA, USA, May 2017. M. Pomonis, T. Petsios, A. D. Keromytis, M. Polychronakis, and V. P. Kemerlis. \"kR^X: Comprehensive Kernel Protection against Just-In-Time Code Reuse\". 12th European Conference on Computer Systems (EuroSys). Belgrade, Serbia, April 2017. [Software] P. Sarbinowski, C. Giuffrida, V. P. Kemerlis, and E. Athanasopoulos. \"VTPin: Practical VTable Hijacking Protection for Binaries\". 32nd Annual Computer Security Applications Conference (ACSAC). Los Angeles, LA, USA, December 2016. [Software] D. Williams-King, G. Gobieski, J. P. Blake, X. Yuan, P. Colp, K. Williams-King, M. Zheng, V. P. Kemerlis, J. Yang, and W. Aiello. \"Shuffler: Fast and Deployable Continuous Code Re-Randomization\". 12th USENIX Symposium on Operating Systems Design and Implementation (OSDI). Savannah, GA, USA, November 2016. E. Athanasopoulos, V. P. Kemerlis, G. Portokalidis, and A. D. Keromytis. \"NaClDroid: Native Code Isolation for Android Applications\". 21st European Symposium on Research in Computer Security (ESORICS). Heraklion, Greece, September 2016. W. Cui, M. Peinado, S. K. Cha, Y. Fratantonio, and V. P Kemerlis. \"RETracer: Triaging Crashes by Reverse Execution from Partial Memory Dumps\". 38th International Conference on Software Engineering (ICSE). Austin, TX, USA, May 2016. T. Petsios, V. P. Kemerlis, M. Polychronakis, and A. D. Keromytis. \"DynaGuard: Armoring Canary-based Protections against Brute-force Attacks\". 31st Annual Computer Security Applications Conference (ACSAC). Los Angeles, LA, USA, December 2015. [Software] Y. Oren, V. P. Kemerlis, S. Sethumadhavan, and A. D. Keromytis. \"The Spy in the Sandbox: Practical Cache Attacks in JavaScript and their Implications\". 22nd ACM Computer and Communications Security Conference (CCS). Denver, CO, USA, October 2015. K. Lu, Z. Li, V. P. Kemerlis, Z. Wu, L. Lu, C. Zheng, Z. Qian, W. Lee, and G. Jiang. \"Checking More and Alerting Less: Detecting Privacy Leakages via Enhanced Data-flow Analysis and Peer Voting\". 22nd Network and Distributed System Security (NDSS) Symposium. San Diego, CA, USA, February 2015. V. P. Kemerlis, M. Polychronakis, and A. D. Keromytis. \"ret2dir: Rethinking Kernel Isolation\". 23rd USENIX Security Symposium (USENIX Sec). San Diego, CA, USA, August 2014. [Software] K. Jee, V. P. Kemerlis, A. D. Keromytis, and G. Portokalidis. \"ShadowReplica: Efficient Parallelization of Dynamic Data Flow Tracking\". 20th ACM Conference on Computer and Communications Security (CCS). Berlin, Germany, October 2013. V. Pappas, V. P. Kemerlis, A. Zavou, M. Polychronakis, and A. D. Keromytis. \"CloudFence: Data Flow Tracking as a Cloud Service\". 16th International Symposium on Research in Attacks, Intrusions and Defenses (RAID). Saint Lucia, October 2013. M. V. Barbera, V. P. Kemerlis, V. Pappas, and A. D. Keromytis. \"CellFlood: Attacking Tor Onion Routers on the Cheap\". 18th European Symposium on Research in Computer Security (ESORICS). Egham, UK, September 2013. A. Zavou, V. Pappas, V. P. Kemerlis, M. Polychronakis, G. Portokalidis, and A. D. Keromytis. \"Cloudopsy: an Autopsy of Data Flows in the Cloud\". 15th International Conference on Human-Computer Interaction (HCI). Las Vegas, NV, USA, July 2013. D. Geneiatakis, G. Portokalidis, V. P. Kemerlis, and A. D. Keromytis. \"Adaptive Defenses for Commodity Software through Virtual Application Partitioning\". 19th ACM Conference on Computer and Communications Security (CCS). Raleigh, NC, USA, October 2012. V. P. Kemerlis, G. Portokalidis, and A. D. Keromytis. \"kGuard: Lightweight Kernel Protection against Return-to-user Attacks\". 21st USENIX Security Symposium (USENIX Sec). Bellevue, WA, USA, August 2012. [Software] E. Athanasopoulos, V. P. Kemerlis, M. Polychronakis, and E. P. Markatos. \"ARC: Protecting against ",
  "content_length": 16734,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:48"
}