{
  "name": "Vasiliki Baka",
  "homepage": "https://pure.itu.dk/portal/en/persons/vasiliki-baka(4e33d926-364b-47b8-97d7-409c16b62db9).html",
  "status": "success",
  "content": "Vasiliki Baka - IT-University of Copenhagen Vasiliki Baka Associate Professor, Digitalization, Democracy, and GovernanceHead of Research Group, REFLACT https://orcid.org/0000-0001-7738-7846 Emailvasbitudk 20142024 Research activity per year Personal profile KeywordsOpen innovationDigital innovationCrowd-based economyDigital platformsAlgorithmic agencyCooperativesCollaborative entrepreneurshipPractice lens Fingerprint Dive into the research topics where Vasiliki Baka is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles User-Generated Content Computer Science 100% User-generated Content Keyphrases 83% Open-Innovation Social Sciences 83% Open Innovation Keyphrases 77% Collaborative Governance Keyphrases 66% Zambia Keyphrases 66% Employee-owned Business Keyphrases 66% Travel Sector Social Sciences 66% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2014 2014 2015 2016 2017 2022 2023 2024 2024 6 Paper 5 Journal article 2 Article in proceedings 2 Conference abstract for conference 3 More 1 Anthology 1 Report 1 Book chapter Research output per year Research output per year A case of action research with a focus on collective learning about organisational challenges and solutions for democratically owned businessesNielsen, L., Nicolajsen, H. W. & Baka, V., 2024, Action Research Booklet. Wang, C. & Juncker-Jensen, L. (eds.). Copenhagen: RSS Press, p. 1-4 4 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open Access Action Research BookletWang, C. (Editor), Juncker-Jensen, L. (Editor), Wang, C., Østerlund, C. S., Nicolajsen, H. W., Christensen, L. R., Juncker-Jensen, L., Nielsen, L., Marttila, S.-M., Finken, S., Jiang, Q., Baka, V., Guo, V. & Dittrich, Y., May 2024, 1 ed. Copenhagen: Really Simple Syndication Press. 114 p.Research output: Book / Anthology / Report › Anthology › Research › peer-review Open AccessFile Action Research 100% Digital Technology 66% Intervention Research 66% Digitization 66% Organizational Context 33% Designing IT for Governance - The Case of Employee-Owned Businesses. The Case of Employee-Owned BusinessesNielsen, L., Nicolajsen, H. W. & Baka, V., 9 Jul 2024, Design for Equality and Justice: Interact 2023. Springer, p. 13-26 14 p. (Lecture Notes in Computer Science, Vol. 14536).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Employee-owned Business 100% Group Decision-Making 100% Business Software 100% Bricolage 66% Digital Resources 66% Enacting cooperative governance in the digital eraNicolajsen, H. W., Baka, V. & Nielsen, L., 10 Jul 2023. 3 p.Research output: Contribution to conference - NOT published in proceeding or journal › Conference abstract for conference › Research Digital Age 100% Collaborative Governance 100% Employee-owned Business 100% Cooperative 100% Decision-Making 100% Innovation Ecosystems as a Service: Exploring the Dynamics between Corporates & Start-ups in the Context of a Corporate Coworking SpaceWagner, S. A. & Baka, V., Jun 2023, In: Scandinavian Journal of Management. 39, 2Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Corporate 100% Innovation Ecosystem 100% Coworking Spaces 100% Interdisciplinary Research 100% Denmark 100% View all 18 research outputs Projects Projects per year 2021 2021 2022 1 Finished Projects per year COOPs: Iværksætteri med demokratisk islæt: analyse af forholdene i DanmarkNielsen, L. (PI), Nicolajsen, H. W. (CoI), Baka, V. (CoI), Victor, F. F. (CoI), Stana, R. A. (CoI) & Sivertsen, S. (CoI)Danish Business Authority01/11/2021 → 31/12/2022Project: Research Press/Media Konkurrence: Danske bud på rumforskningBaka, V.24/04/20161 item of Media coveragePress/Media: Press / Media Jetpacks, astroideforsvar og raketter: NASA-hackathon kommer til DanmarkBaka, V.06/04/20161 item of Media coveragePress/Media: Press / Media Activities Activities per year 2014 2014 2023 2023 1 Membership in review committee 1 Lecture and oral contribution Activities per year Collaborative Technologies in The Era of Open InnovationBaka, V. (Speaker)15 Oct 2014Activity: Talk or presentation types › Lecture and oral contribution Hiring committee for recruitment of associate professor in Organizational Transformation and Digital Innovation (Event)Fischer, L. H. (Member), Baka, V. (Member), Maguire, J. (Member) & Pries-Heje, L. (Chair)1 Jan 2023 → 31 May 2023Activity: Membership types › Membership in review committee",
  "content_length": 5007,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:50"
}