{
  "name": "Vasileios Klimis",
  "homepage": "https://www.seresearch.qmul.ac.uk/cfcs/people/vklimis",
  "status": "success",
  "content": "Dr Vasileios Klimis: Centre for Fundamentals of AI and Computational Theory Skip to main content FIND AN EXPERT Faculty of Science and Engineering - Research Centre for Fundamentals of AI and Computational Theory School of Electronic Engineering and Computer Science Centre for Fundamentals of AI and Computational Theory  |  People  |  Dr Vasileios Klimis  | People menu Centre for Fundamentals of AI and Computational Theory  |  People  |  Dr Vasileios Klimis  | Dr Vasileios KlimisLecturer in Computer ScienceSchool of Electronic Engineering and Computer ScienceQueen Mary University of Londonv.klimis@qmul.ac.ukwww.qmul.ac.uk/eecs/people/profiles/vasileiosklimis.htmlCentre for Fundamentals of AI and Computational Theory Research Publications Research Group News ResearchFormal Methods/ Fuzz Testing/ Verification/ Validation/, Programming Languages/ Networking Implementations/ Weak Memory Models/ RDMA (Remote Direct Memory Access)/ Quantum ComputingInterestsI explore novel ways to apply formal methods, logical frameworks, and programming language technology to advance fuzz testing, verification, and validation across a range of systems — including networking stacks, GPU compilers, weak memory models, RDMA configurations, and quantum computing environments. PublicationsPublications of specific relevance to the Centre for Fundamentals of AI and Computational Theory2025A Low-Latency Control Fabric for Distributed Quantum Error Correction using RDMA: A Timed Event Structure ModelKlimis V IEEE International Conference on Pervasive Intelligence and Computing (PICom). DOI 10.1109/PICom68402.2025.00043 QMRO21-10-2025Shaking Up Quantum Simulators with Fuzzing and Rigour Proceedings of The Conference on Object-Oriented Programming Systems, Languages, and Applications, Oopsla, Association For Computing Machinery (Acm) vol. 9 DOI 10.1145/3763100 QMRO09-10-20252024Semantics of Remote Direct Memory Access: Operational and Declarative Models of RDMA on TSO ArchitecturesKlimis V The ACM SIGPLAN International Conference on Systems, Programming, Languages and Applications: Software for Humanity (SPLASH) / OOPSLA. DOI 10.1145/3689781 QMRO21-10-2024Lost in Interpretation: Navigating Challenges in Validating Persistency Models Amid Vague Specs and Stubborn Machines, All with a Sense of HumourKlimis V Donaldson AF Vafeiadis V Wickerson J Raad A QMRO28-05-2024Challenges in Empirically Testing Memory Persistency ModelsKlimis V Donaldson AF Vafeiadis V Wickerson J Raad A Proceedings of the 2024 ACM/IEEE 44th International Conference on Software Engineering: New Ideas and Emerging Results., 82-86. DOI 10.1145/3639476.3639765 QMRO14-04-2024Chasing Unicorns and Not Losing Hope in Validating Weak Memory Persistency ModelsKlimis V QMRO15-01-20242023Taking Back Control in an Intermediate Representation for GPU ComputingKlimis V Clark J Baker A Neto D Wickerson J Donaldson AF Proceedings of The Acm on Programming Languages, Association For Computing Machinery (Acm) vol. 7 (POPL), 1740-1769. DOI 10.1145/3571253 QMRO09-01-20232020Model Checking Software-Defined Networks with Flow Entries that Time OutKlimis V Parisis G Reus B Formal Methods in Computer-Aided Design – FMCAD. DOI 10.34727/2020/isbn.978-3-85448-042-6_25 QMRO05-10-2020Model Checking Software-Defined Networks with Flow Entries that Time Out (version with appendix)Klimis V Parisis G Reus B QMRO14-08-2020Towards Model Checking Real-World Software-Defined Networks (version with appendix)Klimis V Parisis G Reus B QMRO24-04-2020A Compositional Approach to Quantitative Verification of Software-defined NetworksKlimis V QMRO13-04-2020Towards Model Checking Real-World Software-Defined NetworksKlimis V Parisis G Reus B Lecture Notes in Computer Science. vol. 12225, 126-148. DOI 10.1007/978-3-030-53291-8_8 QMRO01-01-2020Artifact for Taking Back Control in an Intermediate Representation for GPU ComputingKlimis V Donaldson A Clark J Baker A Neto D Wickerson J QMROShouting at Memory: Where Did My Write Go? Ecoop QMRO Research Group News No news items found.",
  "content_length": 4040,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:46"
}