{
  "name": "Vasiliki Kalavri",
  "homepage": "https://cs-people.bu.edu/vkalavri",
  "status": "success",
  "content": "Prof. Vasiliki (Vasia) Kalavri Vasiliki (Vasia) Kalavri Assistant Professor, Department of Computer Science email: vkalavri[at]bu.edu Office: CCDS 713 (7th floor) Office hours (Fall'25): Mon-Wed 4pm-5:30pm About I am an Assistant Professor of Computer Science at Boston University, where I co-lead the Complex Analytics and Scalable Processing (CASP) Systems lab. I enjoy doing research on multiple aspects of data-centric systems. Recently, my team and I have been focusing on designing self-managed systems for data stream processing, scaling graph Machine Learning training on modern storage, and developing practical solutions for private collaborative analytics with Multi-Party Computation. Before joining BU, I was a postdoctoral fellow at ETH Zurich, where I was awarded the ETH Zurich Postdoctoral Fellowship. I received my PhD from KTH, Stockholm, and UCL, Belgium, after completing a joint doctoral program as an EMJD-DC fellow. News If you are interested in PhD positions starting Fall'26, check the application instructions and deadlines of the Computer Science department. This cycle, we are particularly looking for students with strong background in systems and cryptography. I will not be posting any news on my personal website. For news related to the activities of the CASP Systems lab, check our lab webpage and follow us on Twitter. Students I am very lucky to advise the following PhD students: Muhammad Faisal Yuanli Wang Lei Huang (Co-advised with Abraham Matta) Sakshi Sharma (Co-advised with John Liagouris) Naima Abrar Shami Yuhang Song For a full list of students working with me, visit the CASP Systems Lab webpage. Selected Publications Data Stream Processing Systems Yuan Mei, Zhaoqian Lan, Lei Huang, Yanfei Lei, Han Yin, Rui Xia, Kaitian Hu, Paris Carbone, Vasiliki Kalavri, Feng Wang. \"Disaggregated State Management in Apache Flink 2.0.\" In Proceedings of the VLDB Volume 18 (VLDB'25). Wang, Yuanli, Lei Huang, Zikun Wang, Vasiliki Kalavri, and Ibrahim Matta. \"CAPSys: Contention-aware task placement for data stream processing.\" In Proceedings of the Twentieth European Conference on Computer Systems (EuroSys'25). [pdf] [Code] Fragkoulis, Marios, Paris Carbone, Vasiliki Kalavri, and Asterios Katsifodimos. \"A survey on the evolution of stream processing systems.\" In the VLDB Journal. 2024. [pdf] [BibTeX] Asyabi, Esmail, Yuanli Wang, John Liagouris, Vasiliki Kalavri, and Azer Bestavros. \"A new benchmark harness for systematic and robust evaluation of streaming state stores.\" In Proceedings of the Seventeenth European Conference on Computer Systems (EuroSys'22). [pdf] [BibTeX] [Code] Systems for Secure Computation Eli Baum, Sam Buxbaum, Nitin Mathai, Muhammad Faisal, Vasiliki Kalavri, Mayank Varia, and John Liagouris. \"ORQ: Complex analytics on private data with strong security guarantees.\" In The 31st Symposium on Operating Systems Principles (SOSP 2025). [doi] [Code] Faisal, Muhammad, Jerry Zhang, John Liagouris, Vasiliki Kalavri, and Mayank Varia. \"TVA: A multi-party computation system for secure and expressive time series analytics.\" In 32nd USENIX Security Symposium (Security'23). [pdf] [BibTeX] [Code] Liagouris, John, Vasiliki Kalavri, Muhammad Faisal, and Mayank Varia. \"Secrecy: Secure collaborative analytics in untrusted clouds.\" In 20th USENIX Symposium on Networked Systems Design and Implementation (NSDI'23). [pdf] [BibTeX] [Code] Systems for Graph Analytics and Machine Learning Qixuan Chen, Yuhang Song, Melissa Martinez, and Vasiliki Kalavri. \"RingSampler: GNN sampling on large-scale graphs with io_uring.\" In the 17th ACM Workshop on Hot Topics in Storage and File Systems (HotStorage'25). [pdf] [BibTeX] [Code] Naima Abrar Shami and Vasiliki Kalavri. \"Bridging GNN Inference and Dataflow Stream Processing: Challenges and Opportunities.\" In the 8th Joint Workshop on Graph Data Management Experiences & Systems (GRADES) and Network Data Analytics (NDA). (GRADES-NDA'25, co-located with SIGMOD'25). [pdf] [BibTeX] [Code] Horchidan, Sonia, Emmanouil Kritharakis, Vasiliki Kalavri, and Paris Carbone. \"Evaluating model serving strategies over streaming data.\" In Proceedings of the Sixth Workshop on Data Management for End-To-End Machine Learning, pp. 1-5. 2022. [pdf] [BibTeX] [Code] For my full list of publications, visit my Google Scholar profile Teaching CS 351: Distributed Systems Fall 2025 CS 351 covers fundamental concepts of distributed computing (logical clocks, causal order, snapshots, consensus, atomic commit), communication and synchronization primitives, concurrency control, task and data parallelism, data consistency, replication, and fault tolerance. Prerequisites: CAS CS 210. Syllabus: You can find the Fall 2025 Syllabus here. CS 551: Streaming and Event-based Systems Spring 2025 Modern data-driven applications increasingly require continuous, low-latency processing of large-scale, rapid data events such as clicks, search queries, online interactions, financial transactions, traffic records, and sensor measurements. Distributed stream processing has become highly relevant to industry and academia due to its capabilities to both improve established data processing tasks and to facilitate novel applications with real-time requirements. In this course, you will learn how to design, implement, and evaluate scalable and reliable stream processing and event-driven applications. Prerequisites: CAS CS 112 and CAS CS 210; CAS CS 451 and CAS CS 460 or consent of instructor. Syllabus: You can find the Spring 2025 Syllabus here. CS 210: Computer Systems Fall 2023 Important notice: I do not have access to the registration system and I cannot add you to a waitlist or help you change discussion sections. See the registration process information here and contact csadvise[at]bu.edu with further questions. Prerequisites: CAS CS 111, CS 112. CS 131 or MA 293 is important for the material on Boolean logic and data representation. Syllabus: The Fall 2023 Syllabus will be published soon. We will closely follow the material and structure of the Spring 2023 edition of the course . Service Recent external service 2026 NSDI, EuroSys, SIGMOD 2025 USENIX ATC, ACM DEBS, VLDB, TKDE, Mentorship Co-Chair at OSDI/ATC 2024 USENIX ATC, ACM DEBS, ApSys, VLDB, TKDE 2023 ACM Student Research Competition @ SOSP, USENIX ATC, VLDB, ACM DEBS, CIDR 2022 ACM Student Research Competition @ SIGMOD (co-Chair), ACM SoCC, IEEE ICDE (Area Chair), ACM SIGMOD (Research, Demos, Reproducibility), VLDB, ACM DEBS Recent service at BU Faculty advisor for the BU-ACM Women student chapter, 2020-2023. Chair of the CS Graduate Awards Committee, 2022-2024. CS Faculty Search AY22/23 Committee member. Co-organizer of the Computer Systems Seminar and RedHat Colloquium, 2023.",
  "content_length": 6748,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:48"
}