{
  "name": "Vassilios V. Dimakopoulos",
  "homepage": "https://cs.uoi.gr/~dimako",
  "status": "success",
  "content": "V. V. Dimakopoulos Vassilios V. Dimakopoulos Professor Dept. of Computer Science & Engineering, University of Ioannina, Greece Vassilios V. Dimakopoulos Professor Dept. of Computer Science & Engineering University of Ioannina, Greece ≡ » Home » Teaching » Research » Various Sections HOMEÎÏÏÎ¹ÎºÎ® TEACHINGÎÎ¹Î´Î±ÏÎºÎ±Î»Î¯Î± RESEARCHÎÏÎµÏ Î½Î± VARIOUSÎÎ¹Î¬ÏÎ¿ÏÎ± ÎÎ­Î¼Î±ÏÎ± ÎÎ¹ÏÎ»ÏÎ¼Î±ÏÎ¹ÎºÏÎ½ ÎÏÎ³Î±ÏÎ¹ÏÎ½ VASSILIOS V. DIMAKOPOULOS -- ÎÎÎ£ÎÎÎÎÎÎ£ Î. ÎÎÎÎÎÎÎ ÎÎ¥ÎÎÎ£ Professor, former Dean of the School of Engineering Dept. of Computer Science & Engineering, School of Engineering, University of Ioannina P.O. Box 1186, Ioannina, Greece GR-45110 Office: +30-26510-08809, Fax: +30-26510-08899 Email: dimako (at) cse (dot) uoi (dot) gr ÎÎ±Î¸Î·Î³Î·ÏÎ®Ï, ÏÎ­ÏÏ ÎÎ¿ÏÎ¼Î®ÏÎ¿ÏÎ±Ï ÏÎ·Ï Î Î¿Î»Ï ÏÎµÏÎ½Î¹ÎºÎ®Ï Î£ÏÎ¿Î»Î®Ï Î¤Î¼Î®Î¼Î± ÎÎ·ÏÎ±Î½Î¹ÎºÏÎ½ Î/Î¥ ÎºÎ±Î¹ Î Î»Î·ÏÎ¿ÏÎ¿ÏÎ¹ÎºÎ®Ï, Î Î¿Î»Ï ÏÎµÏÎ½Î¹ÎºÎ® Î£ÏÎ¿Î»Î® , Î Î±Î½ÎµÏÎ¹ÏÏÎ®Î¼Î¹Î¿ ÎÏÎ±Î½Î½Î¯Î½ÏÎ½ Î¤.Î. 1186, 45110 IÏÎ¬Î½Î½Î¹Î½Î± ÎÏÎ±ÏÎµÎ¯Î¿: 26510-08809, Î¦Î±Î¾: 26510-08899 Email: dimako (at) cse (dot) uoi (dot) gr Vassilios V. Dimakopoulos is a Professor of Parallel Processing in the Department of Computer Science and Engineering, University of Ioannina, Ioannina, Greece. He serves as the Dean of the School of Engineering since 2017. He was formerly Deputy Chairman and Director of Graduate Studies of the CSE Department. His research interests evolve around parallel and distributed systems, parallel programming models, embedded systems, computer architecture and performance analysis. He heads the Parallel Processing Group. Education PhD: Department of Electrical and Computer Engineering, University of Victoria, Canada MASc: Department of Electrical and Computer Engineering, University of Victoria, Canada Diploma: Department of Computer Engineering and Informatics, University of Patras, Greece Research List of publications The Parallel Processing Group The DMoD Lab Teaching Undergraduate: MYY502 / Î ÎÎ¥-410: Systems Programming » 2025-26, 2024-25, 2023-24, 2022-23, 2021-22, 2020-21, 2019-20, 2018-19, 2017-18, earlier MYE023 / Î ÎÎ-079: Parallel Systems and Programming » 2024-25, 2023-24, 2022-23, 2021-22, 2020-21, 2019-20, 2018-19, 2017-18, 2016-17, earlier 4-34: Computer Architecture (1998 - 2011) E-06: Parallel Processing (1998 - 2011) 4-45: Operating Systems (2001) E-19: Graph Theory (1999 - 2001) E-XX: File Organization (1998) Graduate: Î8: High Performance Systems and Software (Spring 2025, Spring 2023, Spring 2021) Î0: Introduction to Software Systems (Fall 2022, Fall 2021, Fall 2020, Fall 2019, Fall 2018) Y-7: Parallel Systems (Spring 2018, Spring 2016, Spring 2005, Fall 2013, Spring 2012, Fall 2003, Spring 2003) L-10: Parallel and Distributed Programming (Fall 2009, Spring 2009) Y-12: Topics on Parallel Architectures: Interconnection Networks (Spring 2008, Spring 2006)",
  "content_length": 2943,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:54"
}