{
  "name": "Vassilis Christophides",
  "homepage": "https://www.csd.uoc.gr/index.jsp?custom=vassilis_christophides",
  "status": "success",
  "content": "Βασίλης Χριστοφίδης | Τμήμα Επιστήμης Υπολογιστών - Πανεπιστήμιο Κρήτης Επικοινωνία Ανακοινώσεις | Νέα Τρίπτυχο του Τμήματος GR EN webmailelearneduportal Αρχική Σελίδα Άνθρωποι Ακαδημαϊκό Προσωπικό Βασίλης Χριστοφίδης Βασίλης Χριστοφίδης A+ A- Καθηγητής Επιστήμης Υπολογιστών, Πανεπιστήμιο Κρήτης Τμήμα Πληροφορικής, Πανεπιστήμιο Κρήτης Τ.Θ. 2208 71409 Ηράκλειο Κρήτη, Ελλάδα Συνεργαζόμενο Μέλος ΔΕΠ Ινστιτούτο Πληροφορικής (ΙΠ) Ίδρυμα Τεχνολογίας και Έρευνας (ΙΤΕ) Ν. Πλαστήρα 100, Βασιλικά Βουτών Τ.Θ. 1385 Τ.Κ. 70013 Ηράκλειο, Κρήτη Phone: +30 2810 391628 Fax: +30 2810 391638 E-mail: christopATics.forth.gr Ο Βασίλης Χριστοφίδης είναι καθηγητής του Τμήματος Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης και συνεργαζόμενος ερευνητής στο Εργαστήριο Πληροφοριακών Συστημάτων (ΕΠΣ) του Ινστιτούτου Πληροφορικής , ΙΤΕ. Ερευνητικά Ενδιαφέροντα Βάσεις Δεδομένων και Πληροφοριακά Συστήματα για τον Παγκόσμιο Ιστό: Σχήματα Αποθήκευσης και Ευρετηρίασης XML/RDF, Μοντέλα και Γλώσσες Επερωτήσεων Δεδομένων και Γνώσεων, Ολοκλήρωση Ετερογενών Πληροφοριών, Διαχείριση Αλλαγών XML/RDF, Γραφικές Γλώσσες Επερωτήσεων. Ψηφιακές Βιβλιοθήκες: Προσωποποίηση Πληροφορίας και Διαχείριση Προτιμήσεων, Διομότιμα Συστήματα Διαχείρισης Δεδομένων και Γνώσεων, Συστήματα διομησεύσεων συνδρομών, Εξόρυξη Δεδομένων Γράφων και Κανόνες Δύναμης. Συστήματα Επιστημονικών Δεδομένων: Συστήματα Διαχείρισης Ροής Εργασιών, Περιγραφή και Σύνθεση Ηλεκτρονικών Υπηρεσιών, Προέλευση Δεδομένων και Διαχείριση Υπομνηματισμών Βραβεία και Διακρίσεις ISWC 2009 Βραβείο Καλύτερης Φοιτητικής Εργασίας (για την Β. Παπαβασιλείου) (Best Student Paper Award) ISWC 2007 Βραβείο Καλύτερης Εργασίας (Best Paper Award) SIGMOD 2004 Βραβείο Καλύτερης προ-δεκαετίας Δημοσιευμένης Εργασίας (Test of Time Award) ISWC 2003 Βραβείο Καλύτερης Εργασίας (Best Paper Award) Μεταδιδακτορική Υποτροφία (1996-1997), Ινστιτούτο Πληροφορικής, ΙΤΕ Ηράκλειο Κρήτης. Διδακτορική Υποτροφία (1992-1995) του Γαλλικού Υπουργείου Έρευνας και Παιδείας στο Institut National de Recherche en Informatique et Automatique (I.N.R.I.A), Παρίσι, Γαλλία. Μεταπτυχιακή Υποτροφία (1991-1992) του Ιδρύματος Υποτροφιών Μποδοσάκη στο Universite Pierre et Marie Curie (Paris VI), Παρίσι, Γαλλία Συμμετοχή σε Χρηματοδοτούμενα Ερευνητικά και Αναπτυξιακά Προγράμματα APARSEN - Alliance Permanent Access to the Records of Science in Europe Network, (NoE 269977, total budget 8.687.572€), FORTH-ICS budget 310.240€ (with G. Antoniou, Y. Tzitzikas) GNM - Documentation Management System V2.0 for the Germanische Nationalmuseum Nuremberg, FORTH-ICS budget 140.000€ (with M. Doerr) plugIT - Business and IT Alignment using a Model-based Plug-in Framework, (CP 231430, total budget 3.657.935€), FORTH-ICS budget 265.480€ (with D. Plexousakis) Greek Archive of Monuments, Digitization of archival material at the Greek Archive of Monuments, FORTH-ICS budget 367.080€ (with M. Doerr) KPLab - Developing Knowledge Practices Laboratory, Integrated Project, (IP 27490, total budget 14.241.444€) Member of Project Management Board and FORTH-ICS Scientific Coordinator with budget 939.132€ (with D. Kotzinos, G Flouris) CASPAR - Cultural, Artistic and Scientific Knowledge for Preservation, Access and Retrieval Integrated Project, (IP 33572, total budget 15.078.563€) FORTH-ICS Scientific Coordinator with budget 665.400€ (with Y. Tzitzikas, G Flouris) Beyond-the-Horizon - Anticipating Future and Emerging Information Society Technologies, FET Programme (IST-FP6-006622), FORTH-ICS budget 139.200€ (with D. Plexousakis, C. Stephanidis) DELOS - Network of Excellence in Digital Libraries, (NoE 507618, total budget 15.700.000€), FORTH-ICS budget 434.400€ (with C. Stephanidis, M. Doerr) Standards for cultural documentation and support technologies for the integration of digital cultural repositories and systems interoperability: Studies, Prototypes and Best-practices guides, Greek Operational Progamme \"Information Society\", FORTH-ICS budget 110.000€ (with M. Doerr) GNM - Documentation Management System for the Germanische Nationalmuseum Nuremberg, FORTH-ICS budget 150.000€ (with M. Doerr) DIAVATIS – Interactive System for Improving the Promotion of Touristic & Historical Aspects, (GSRT - Op. Pr. Competitiveness, total budget 840.393€), FORTH-ICS budget 291.589€ (with P. Constantopoulos) ubi-erat-lupa, European Culture 2000 (Project No 2002 - 0462/001-001 CLT-CA22 , total budget 900.000€) , FORTH-ICS budget 187.500€ (with M. Doerr) CRISATEL - Conservation Restoration Innovation Systems for image capture and digital Archiving to enhance Training, Education and longlife Learning, European (IST-1999-20163, total budget 2.669.820€), FORTH-ICS budget 230.000€ (with M. Doerr) SeLeNe - Self e-Learning Networks, (IST 39045, total budget 283.000€) FORTH-ICS Scientific Coordinator budget 59.000€ (with D. Kotzinos) QuestionHow - Quality Engineering Solutions via Tools, Information and Outreach for the New Highly-enriched Offerings from W3C: Evolving the Web in Europe (IST- 2000-28767) FORTH-ICS - ISL budget 20.000€ (with E. Markatos) SIS-TMS, Semantic Index System – Thesaurus Management System (with M. Doerr) OntoWeb - Network of Excellence on Ontology-based Information Exchange for Knowledge Management and Electronic Commerce, (IST-2000-29243, total budget 1.866.332€), FORTH-ICS Scientific Coordinator with budget 51.600€ (with D. Plexousakis) MESMUSES - Metaphors for Science Museums, (IST-26074, total budget 2.386.166€) FORTH-ICS Scientific Coordinator with budget 304.988€ (with D. Plexousakis) Telematics Centre, Information Highway linking organizations in Crete, Cyprus and south-eastern Mediterranean : Cultural telematics Applications, Region of Crete, INTERREG II, FORTH-ICS-ISL budget 676.200€ (with P. Constantopoulos) C-Web - A Generic Platform Supporting Community Webs, (IST 13479, total budget 342.401€) FORTH-ICS Scientific Coordinator with budget 79.200€ ECTourism - An Electronic Commerce System for the Provision of Tourism Services over Internet, General Secretariat of Research and Technology, Greek Ministry of Development, total budget 1.115.187€, FORTH-ICS budget 358.034€ (with D. Plexousakis) ARION - An Advanced Lightweight Architecture for Accessing Scientific Collections, (IST 25289, total budget 860.000€) FORTH-ICS budget 280.000€ (with C. Houstis) Thetis - A Data Management and data Visualization System for Supporting Coastal Zone Management for the Mediterranean Sea (F0069, total budget 550.000€) FORTH-ICS budget 250.000€ (with C. Houstis) Aquarelle - Sharing Cultural Heritage through Multimedia Telematics (IE-2005, total budget 6.009.756 Ecus) FORTH-ICS budget 344.622Ecus (with P. Constantopoulos, M. Doerr) CIMI Z39.50 - Testbed, FORTH-ICS budget 2000$. Σύντομο βιογραφικό Είναι Καθηγητής του Τμήματος Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης και συνεργαζόμενος ερευνητής στο Εργαστήριο Πληροφοριακών Συστημάτων του Ινστιτούτου Πληροφορικής του Ιδρύματος Τεχνολογίας και Έρευνας. Έλαβε το πτυχίο του Ηλεκτρολόγου Μηχανικού από το Εθνικό Μετσόβιο Πολυτεχνείο, Ιούλιος 1988, το μεταπτυχιακό δίπλωμα εξειδίκευσης από το Information Systems, Universite Pierre et Marie Curie (Paris VI), Γαλλία, Ιούνιος 1992, και το διδακτορικό δίπλωμα από το Πανεπιστήμιο CNAM του Παρισιού,Οκτώβριος 1996. Διαθέτει μεγάλη ερευνητική εμπειρία ως συνεργαζόμενος ερευνητής στο εργαστήριο Πληροφοριακών Συστημάτων του Ινστιτούτου Πληροφορικής του ΙΤΕ τα τελευταία 15 χρόνια ενώ έχει συμμετάσχει σε περισσότερα από 10 ερευνητικά ελληνικά και ευρωπαϊκά προγράμματα. Έχει διατελέσει πρόεδρος και μέλος επιστημονικών επιτροπών πληθώρας συνεδρίων ενώ είναι μέλος επιτροπής, κριτής και προσκεκλημένος εκδότης σε μια σειρά από επιστημονικά περιοδικά. Έχει συγγράψει πάνω από 100 επιστημονικές δημοσιεύσεις και το ερευνητικό του έργο έχει αναγνωρισθεί με περισσότερες από 3925 αναφορές σύμφωνα με το Google Scholar με δείκτη h-index 31 (ή 1731 αναφορές σύμφωνα με το Microsoft Academic Research με δείκτη h-index 20). Το μεγαλύτερο μέρος της ερευνητικής του έργου έχει παραχθεί σε συνεργασία με μεταπτυχιακούς και διδακτορικούς φοιτητές του Τμήματος Επιστήμης Υπολογιστών (έχει επιβλέψει περισσότερες από 30 μεταπτυχιακές εργασίες) με την οικονομική υποστήριξη του Ινστιτούτου Πληροφορικής στο ΙΤΕ. Έχει τιμηθεί με το βραβείο καλύτερης εργασίας δημοσιευμένης πριν από 10 χρόνια (ACM/SIGMOD 2004 Test of Time Award) καθώς και με το βραβείο καλύτερης εργασίας το 2007 και 2003 στο ISWC. Έχει τέλος διευθύνει ή συμμετάσχει σε πολυάριθμες επιστημονικές επιτροπές συνεδρίων (ACM SIGMOD, VLDB, EDBT, WWW, ISWC, ICWE, ICWS, ECDL, ESWC) και εργαστηρίων (PersDB, MMGPS, SCC, WebDB, SemWeb). Κατάλογος Δημοσιεύσεων Copyright © 2025, Τμήμα Επιστήμης Υπολογιστών - Συντελεστές - Σχόλια για Ιστότοπο",
  "content_length": 8718,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:55"
}