{
  "name": "Vassilis Zikas",
  "homepage": "https://faculty.cc.gatech.edu/~vzikas",
  "status": "success",
  "content": "Homepage of Vassilis Zikas Vassilis Zikas JPMorgan Chase Associate Professor Georgia Tech School of Cybersecurity and Privacy School of Computer Science (by courtesy) CODA S0919 Atlanta, GA 30308 email: vzikas gatech.edu My research interests include: Blockchain and Cryptocurrencies Game Theory Cryptography Privacy and AI Muli-Party Computation Distributed Computing I am looking for motivated PhD students with interest in cryptography, blockchain technologies, security, and/or fault-tolerant distributed computing. If you are already a CoC student send me an email. Otherwise, if you are interested in working with me please apply through the official Georgia Tech process and make sure you include the above areas and my name in your application. Latest news: Our paper on f-DP estimators was accepted at Usenix Security 2025. Our paper on fuzzy PSI was accepted at CCS 2025. Excited to have three papers accepted at TCC 2024. Our paper on blockchain security against adversaries with temporary majority control of the underlying resourse was accepted at CSF 2024. Our paper on adaptor sibnagures was accepted at ASIACRYPT 2024. Our paper on black-box differential privacy estimators was accepted at S&P 2024. Excited and honored to be awarded an AnlytiXIN Fellowship! Professional Activities Program Committee Chair SCN 2016 Program Committee Member EUROCRYPT 2025, TCC 2025, CRYPTO 2024, PKC 2023, AFT 2023, CRYPTO 2022, CCS 2022, PODC 2022, ICDCS 2022, SCN 2022, CSCML 2022, PODC 2021, PKC 2021, AFT 2021, ACM CCS 2020 (Area Chair for Blockchain and Distributed Systems), CSCML 2020, SCN 2020, CCSW 2019, EUROCRYPT 2019, ISC 2019, TCC 2018, INDOCRYPT 2018, CRYPTO 2017, FC 2017, PKC 2017, PODC 2016, TCC 2016-A, ASIACRYPT 2015, INSCRYPT 2015, CRYPTO 2014, CANS 2014 Conference Organization PKC 2020 (general co-chair) EUROCRYPT 2013 (finances chair) TCC 2010 (local organizing committee member) Steering Committee Member Theory and Practice of Blockchains— TPBC Editorial Board Member IACR Journal of Cryptology ACM Transactions on Privacy and Security Teaching and Advising Courses Introduction to Cryptography, 2023, 2021 Cryptography, 2022 Algorithm design, Analysis, and Implementation, 2021 Decentralized Cryptography, 2021 Introduction to Modern Cryptography, 2019 Cryptography and Network Security I, 2017 Cryptography and Network Security II, 2016, 2017 Security Topics, 2016 PhD Students Current Adya Agrawal Yanxin Pand Gary Song Yu Wei Past Muhammad Ishaq (last known position: CTO of Sunday Group, Inc.) Yun Lu (last known position: assistant professor (tenure track) at University of Victoria, Canada) Postdocs Current Jaspal Singh Past Wonseok Choi (2023-2025; last known position: assistant professor (tenure track) at DGIST, Korea) Daniel Collins (2023-2024; last known position: postdoctoral researcher at NYU) Xiangyu Liu (2023-2025; last known position: postdoctoral researcher at CISPA, Germany) Michele Ciampi (2018 - 2020; last known position: Chancellor's Fellow (tenured faculty) at the University of Edinburgh) Christian Badertscher (2018-2019; last known position: IOHK) Master's Students Konstantinos Mitropoulos (graduated 2019) Connor Hadlec (graduated 2018) Mike Macceletti (graduated 2017) Publications Önder Askin, Holger Dette, Martin Dunsche, Tim Manfred Kutta, Yun Lu, Yu Wei, and Vassilis Zikas General-Purpose f-DP Estimation and Auditing in a Black-Box Setting Usenix Security 2025 (to appear) A preliminary full version is available here: [PDF] Privacy and AI Lucas Piske, Vladimir Kolesnikov, Jaspal Singh, Ni Trieu, and Vassilis Zikas Distance-Aware OT with Application to Fuzzy PSI ACM Conference on Computer and Communications Security — CCS 2025 (to appear) A preliminary full version is available here: [PDF] Cryptography MPC Michele Ciampi, Xiangyu Liu, Ioannis Tzannetos, and Vassilis Zikas Universal Adaptor Signatures from Blackbox Multi-party Computation {RSA} Conference, Cryptographers' Track — CT-RSA 2025 (to appear). A preliminary full version is available here: [ PDF] Cryptography  MPC  Blockchain & Cryptocurrencies Nishanth Chandran, Juan Garay, Ankit Misra, Rafail Ostrovsky, and Vassilis Zikas Adaptive Security, Erasures, and Network Assumptions in Communication-Local MPC Theory of Cryptography Conference — TCC 2024 (to appear). A preliminary full version is available here: [ PDF ] MPC Jaspal Singh, Yu Wei, and Vassilis Zikas Information-Theoretic Multi-Server Private Information Retrieval with Client Preprocessing Theory of Cryptography Conference — TCC 2024 (to appear). A preliminary full version is available here: [ PDF ] Cryptography MPC Konstantinos Brazitikos and Vassilis Zikas General Adversary Structures in Byzantine Agreement and Multi-Party Computation with Active and Omission Corruption Theory of Cryptography Conference — TCC 2024 (to appear). A preliminary full version is available here: [ PDF ] MPC Distributed Computing Xiangyu Liu, Ioannis Tzannetos, and Vassilis Zikas Adaptor Signatures: New Security Definition and A Generic Construction for NP Relations Advances in Cryptology — ASIACRYPT 2024 (to appear). A preliminary full version is available here: [ PDF ] Blockchain & Cryptocurrencies Cryptography Timothé Albouy, Davide Frey, Ran Gelles, Carmit Hazay, Michel Raynal, Elad Michael Schiller, François Taïani, and Vassilis Zikas Near-Optimal Communication Byzantine Reliable Broadcast under a Message Adversary Conference on Principles of Distributed Systems — OPODIS 2024 (to appear). A preliminary full version is available here: [ PDF ] Distributed Computing Yun Lu, Malik Magdon-Ismail, Yu Wei, and Vassilis Zikas Eureka: A General Framework for Black-box Differential Privacy Estimators IEEE Symposium on Security and Privacy — S&P 2024, IEEE, pp 913–931, 2024. A preliminary full version is available here: [ PDF ] Privacy and AI Christian Badertscher, Peter Gazi, Aggelos Kiayias, Alexander Russell, and Vassilis Zikas: Consensus Redux: Distributed Ledgers in the Face of Adversarial Supremacy IEEE Computer Security Foundations Symposium —CSF 2024, IEEE, pp 143–158, 2024. A preliminary full version is available here: [ PDF ] Blockchain and Cryptocurrencies Ran Cohen, Pouyan Forghani, Juan Garay, Rutvik Patel, and Vassilis Zikas Concurrent Asynchronous Byzantine Agreement in Expected-Constant Rounds, Revisited Theory of Cryptography Conference — TCC 2023, LNCS, Springer, vol 14372, pp 422–451, 2023. A preliminary full version is available here: [ PDF ] Cryptography  Distributed Computing Lindsey Kennard, Muhammad Ishaq, Benjamin Levy, Ana Milanova, Ben Sherman, and Vassilis Zikas. COMBINE: COMpilation and Backend-INdependent vEctorization for Multi-Party Computation ACM Conference on Computer and Communications Security — CCS 2023, ACM, pp 2531–2545, 2023. A preliminary full version is available here: [ PDF ] MPC Ran Cohen, Juan Garay, and Vassilis Zikas. Completeness Theorems for Adaptively Secure Broadcast Advances in Cryptology — CRYPTO 2023, LNCS, Springer, vol 14081, pp 3–38, 2023 A preliminary full version is available here: [ PDF ] Cryptography  Distributed Computing Michele Ciampi, Rafail Ostrovsky, Hendrik Waldner, and Vassilis Zikas Round-Optimal and Communication-Efficient Multiparty Computation Advances in Cryptology — EUROCRYPT 2022, LNCS, Springer, vol 13275, pp 65–95, 2022. A preliminary full version is available here: [ PDF ] MPC Michele Ciampi, Yun Lu, and Vassilis Zikas Collusion-Preserving Computation without a Mediator IEEE Computer Security Foundations Symposium —CSF 2022, IEEE, pp 211–226, 2022. A preliminary full version is available here: [ PDF ] MPC  Game Theory  Blockchain and Cryptocurrencies John Andrews, Michele Ciampi, and Vassilis Zikas Etherless Ethereum Tokens: Simulating Native Tokens in Ethereum Symposium on Cyber Security, Cryptology and Machine Learning —CSCML 2022, LNCS, Springer, vol 13301, pp 388–407, 2022. (Best Paper Award) A preliminary full version is available here: [ PDF ] Blockchain and Cryptocurrencies Michele Ciampi, Muhammad Ishaq, Malik Magdon-Ismail, Rafail Ostrovsky and Vassilis Zikas FairMM: A Fast and Frontrunning-Resistant Crypto Market-Maker Symposium on Cyber Security, Cryptology and Machine Learning —CSCML 2022, LNCS, Springer, vol 13301, pp 428–466, 2022. A preliminary full version is available here: [ PDF ] Blockchain and Cryptocurrencies Nishanth Chandran, Pouyan Forghani, Juan A. Garay, Rafail Ostrovsky, Rutvik Patel, and Vassilis Zikas Universally Composable Almost-Everywhere Secure Computation. Conference on Information-Theoretic Cryptography —ITC 2022, LIPIcs, vol 230, pp 14:1–14:25, 2022. A preliminary full version is available here: [ PDF ] MPC Christian Badertscher, Yun Lu, and Vassilis Zikas A Rational Protocol Treatment of 51% Attacks Advances in Cryptology — CRYPTO 2021, LNCS, Springer, vol 12827, pp 3–32, 2021. A preliminary full version is available here: [ PDF ] Blockchain and Cryptocurrencies  Game Theory Christian Badertscher, Peter Gazi, Aggelos Kiayias, Alexander Russell, and Vassilis Zikas Dynamic Ad Hoc Clock Synchronization via Proof of Stake Advances in Cryptology — EUROCRYPT 2021, LNCS, Springer, vol 12698, pp 399–428, 2021. A preliminary full version is available here: [ PDF ] Blockchain and Cryptocurrencies Christian Badertscher, Julia Hesse, and Vassilis Zikas On the (Ir)Replaceability of Global Setups, or How (Not) to Use a Global Ledger Theory of Cryptography Conference — TCC 2021, LNCS, Springer, vol 13043, pp 626–657, 2021. A preliminary full version is available here: [ PDF ] Cryptography Blockchain and Cryptocurrencies Christian Badertscher, Ran Canetti, Julia Hesse, Björn Tackmann, and Vassilis Zikas Universal Composition with Global Subroutines: Capturing Global Setup within Plain UC Theory of Cryptography Conference — TCC 2020, LNCS, Springer, vol 12552, pp 1–30, 2020. A preliminary full version is available here: [ PDF ] Cryptography Ao Liu, Yun Lu, Lirong Xia, and Vassilis Zikas How Private Is Your Voting? A Fram",
  "content_length": 21910,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:57"
}