{
  "name": "Vasso Stylianou",
  "homepage": "https://www.unic.ac.cy/stylianou-vasso",
  "status": "success",
  "content": "Dr Vasso Stylianou - University of Nicosia Skip to content APPLY Dr Vasso Stylianou Dr Vasso Stylianou Associate Professor School of Sciences and Engineering, Department of Computer Science 22841647 [email protected] Central Building, 2nd Floor, B217 Brief CV Research Profile https://orcid.org/0000-0001-7557-3071 Google Scholar Dr. Vasso Stylianou is an Assistant Professor of Computer Science and Management Information Systems, and the Program Coordinator for the undergraduate program of Computer Science, at the University of Nicosia, Cyprus. She received a Doctorate Degree from the Middlesex University, UK, for research work in the area of Knowledge Management. She also holds an MBA degree with concentration on Information Systems from the MSM Maastricht School of Management, the Netherlands, a BSc in Computer Science from Intercollege, Cyprus and an ASc in Business Data Processing from the University of Indianapolis, USA. She is a dedicated academic, with a long experience in tertiary education, and researcher with a number of publications in book chapters, academic journals and international conference proceedings. She has attended and presented her work in several international conferences. She has also served as a reviewer and a member of the organizing and scientific committees of international conferences and journals. Her research interests include Knowledge Management, ICT in Education, E-Learning, Databases, and Computer Graphics. She is currently researching issues relating to Creative Thinking and Learning, Gamification in Education, and Knowledge Management. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 2227,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:00"
}