{
  "name": "Vassilis J. Tsotras",
  "homepage": "http://www.cs.ucr.edu/~tsotras",
  "status": "success",
  "content": "VASSILIS J. TSOTRAS Distinguished Professor and UC Presidential Chair Department of Computer Science and Engineering Bourns College of Engineering University of California - Riverside Riverside, CA 92521 Co-Director, RAISE@UCR Institute Director, MS in Computational Data Science Co-Director, Data Science Major Office: Multidisciplinary Research Building (MRB), Room 3126 Tel: 951-827-2888, Fax: 951-827-4643 Email: tsotrasATcs.ucr.edu EDUCATION-WORK Ph.D. (1991), Columbia University, NY M.Sc. (1986), M.Phil. (1988), Columbia University, NY B.Sc. (1985), National Technical University of Athens, Greece Professor (2001-present) Associate Professor (1997-2001)       Department of Computer Science & Engineering,       University of California, Riverside, CA Associate Professor (tenured; 1996-97) Assistant Professor (1990-96)       Department of Computer and Information Science,       Polytechnic University, Brooklyn, NY (now part of NYU) RESEARCH INTERESTS - FUNDED RESEARCH Database management, access methods, evolving databases, temporal databases, spatiotemporal databases, spatiotemporal knowledge management, spatiotemporal change management, sensor data, querying complex objects, evolving systems design, multi-version schema evolution, querying trajectories of physical artifacts, data dissemination, FPGA-based publish/subscribe systems, querying spatiotemporal patterns using accelerators, semantic spatiotemporal queries, scalable data management (ASTERIX), Big Active Data management. List of NSF funded research grants appears here. PUBLICATIONS DBLP, Google Scholar DATABASE LAB Lab's Web Page AWARDS/HONORS Research Initiation Award, National Science Foundation, 1991. Teaching Excellence Award,College of Engineering, UCR, 1999-00. Keynote Speaker, 10th International Symposium on Spatial and Temporal Databases (SSTD), Boston, MA, 2007. Keynote Speaker, 7th International ACM Workshop on Data Engineering for Wireless and Mobile Access (MobiDE), Vancouver, Canada, 2008. Keynote Speaker, 2010 Redlands GISWeek, ESRI, February 22-26, 2010, Redlands, CA. Keynote Speaker, 16th International ACM Workshop On Data Warehousing and OLAP (DOLAP), San Francisco, CA, 2013. Best Poster Runner-Up: \"TS2-tree - an efficient similarity based organization for trajectory data\", by Petko Bakalov, Eamonn J. Keogh, Vassilis J. Tsotras, 15th ACM International Symposium on Geographic Information Systems, (SIGSPATIAL), November 7-9, 2007, Seattle, Washington. Best Student Paper: \"Online Identification of Dwell Regions for Moving Objects\", by M Reaz Uddin, Chinya Ravishankar, and Vassilis J. Tsotras, 13th IEEE International Conference on Mobile Data Management (MDM), July 23-26, 2012, Bengaluru, India. Best Paper: \"Stream-Mode FPGA Acceleration of Complex Pattern Trajectory Querying\", by Roger Moussalli, Marcos Vieira, Walid Najjar and Vassilis J. Tsotras, 13th International Symposium on Spatial and Temporal Databases (SSTD), August 21-23, 2013, Munich, Germany. Top-3 Paper (Curriculum Initiatives Track): \"Developing an Interdisciplinary Data Science Program\", by Mariam Salloum, Daniel R. Jeske, Wenxiu Ma, Vagelis Papalexakis, Christian R. Shelton, Vassilis J. Tsotras and Shuheng Zhou, 52nd ACM Technical Symposium on Computer Science Education (SIGCSE), March 13 - 20, 2021. Best Paper Runner-up: \"Revisiting Runtime Dynamic Optimization for Join Queries in Big Data Management Systems\", by Christina Pavlopoulou, Michael J. Carey and Vassilis J. Tsotras, 25th International Conference on Extending Database Technology (EDBT), March 29 - April 1, 2022. Best Paper Runner-up: \"DDCEL: Efficient Distributed Doubly Connected Edge List for Large Spatial Networks\", by Laila Abdelhafeez, Amr Magdy and Vassilis J. Tsotras, 24th IEEE International Conference on Mobile Data Management (MDM), Singapore, July 3-6, 2023. Top-5 paper: \"Scalable Overlay Operations over DCEL Polygon Layers\", by Andrés Calderón Romero, Vassilis J. Tsotras and Amr Magdy, 18th International Symposium on Spatial and Temporal Data, (SSTD), Calgary, Canada, August 23-25, 2023. 2023 SIGMOD Research Highlight Award: \"Revisiting Runtime Dynamic Optimization for Join Queries in Big Data Management Systems\", by Christina Pavlopoulou, Michael J. Carey and Vassilis J. Tsotras BOOK Advanced Database Indexing, by Yannis Manolopoulos, Yannis Theodoridis and Vassilis J. Tsotras. Advances in Database Systems, Kluwer Academic Publishers (now part of Springer), ISBN 0-7923-7716-8, November 1999; ISBN: 978-1-4613-4641-8 (Print) 978-1-4419-8590-3 (Online); 2000. PROFESSIONAL ACTIVITIES Co-Editor in Chief, International Journal of Cooperative Information Systems (IJCIS), World Scientific, January 2008 - 2022. Associate Editor, The VLDB Journal, Sept. 2003 - Sept. 2009. Associate Editor, IEEE Transactions on Knowledge and Data Engineering (TKDE), Sept. 2002 - Sept. 2006. General Co-Chair: 26th International Conference on Data Engineering (ICDE) 2010, Los Angeles, CA. Demos Co-Chair: 25th International Conference on Data Engineering (ICDE) 2009, Shanghai, China. Program Chair (DB Track): 15th Conference on Information and Knowledge Management (CIKM 2006). General Chair: 7th International Symposium on Spatial and Temporal Databases (SSTD'01). Program Co-Chair: 5th International Workshop on Multimedia Information Systems (MIS'99). PhD STUDENTS Anil Kumar (1998; Bloomberg Corp., NY) George Kollios (2000; Boston University, Boston, MA) Donghui Zhang (2002; Paradigm4, Waltham, MA) Marios Hadjieleftheriou (2004; AT&T Research, NJ)) Zografoula Vagena (2005; LogicBlox, Atlanta, GA) Mirella Moro (2007; Universidade Federal de Minas Gerais - UFMG, Brazil) Petko Bakalov (2008; ESRI, Redlands, CA) Theodoros Lappas (2011; co-supervised with D. Gunopulos; Stevens Institute of Technology, NJ) Mariam Salloum (2011; UCR) Marcos R. Vieira (2011; Hitachi Big Data Lab, Santa Clara, CA) Wenyu Huo (2013; LinkedIn, San Francisco, CA) Michael Rice (2013; Amazon, CA) Jarod Wen (2013; Oracle Labs, NH) Md. Mahbub Hasan (2014; Teradata, CA) M. Reaz Uddin (2014; co-supervised with C.V. Ravishankar; Microsoft, Redmond, WA) Steven Jacobs (2018, Amazon) Ildar Absalyamov (2018, Google) Elena Strzheletska (2018, UCR) Vasileios Zois (2019, Microsoft Research) Preston Carman Jr. (2020, Walla Walla University) Christina Pavlopoulou (2020, Oracle) Pritom Ahmed (2020, eBay) Andres Calderon (2024, Pontificia Universidad Javeriana, Colombia) Mehnaz Tabassum Mahin (2025, Amazon Redshift) Shahrzad Shirazi (2025, Couchbase) James Fang (in progress) Shamima Hossain (in progress, co-advised with Hyoseung Kim) MSc STUDENTS Nickolas Kangelaris (1994; Oracle, Greece) Lifei Tan (1999; Lam Research, CA) Theodore Folias (2003) Anil Musku (2003; Amazon, CA) Priya Mandawat (2005; Google, CA) Yunzhu (Julie) Shi (2006; ESRI, CA) Adam Woss (2008; JAAL Llc, CA) Wanxing Xu (2009; Microsoft, WA) Ali Mirzabeigi (2011; ESRI, CA) Badrunnisa Begum (2012; InfoSys, CA) Rishita Singh (2012; MarkMonitor, CA) Sanjay Kulhari (2012; Juniper Networks, CA) Theodoros Ioannou (2013) Fuxin (Daisy) Yu (2014; Amazon, CA) Zhang Zhaosheng (2014; Electronic Arts, CA) Bryan Marsh (2015) Tomal Majumder (in progress, co-advised with Ahmed Eldawy)",
  "content_length": 7201,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:55"
}