{
  "name": "Vedran Sekara",
  "homepage": "https://pure.itu.dk/portal/en/persons/vedran-sekara(db64c222-0674-4eab-9f09-7f9ea1c483e3).html",
  "status": "success",
  "content": "Vedran Sekara - IT-University of Copenhagen Vedran Sekara Associate Professor, Data ScienceNEtwoRks, Data, and Society https://orcid.org/0000-0003-4490-3757 Emailvsekitudk 20202024 Research activity per year Personal profile KeywordsData ScienceNetwork ScienceComputational Social ScienceData MiningSocial NetworksAlgorithmic Auditing Fingerprint Dive into the research topics where Vedran Sekara is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Wealth Index Keyphrases 100% Philippines Keyphrases 100% U.S. Congress Keyphrases 100% Facebook Keyphrases 100% Mobility Science Keyphrases 100% Socio-economic Indicators Keyphrases 100% Climate Change Keyphrases 100% Social Media Advertising Keyphrases 100% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2020 2023 2024 2024 5 Journal article 2 Article in proceedings 1 Report Research output per year Research output per year Failing Our Youngest: On the Biases, Pitfalls, and Risks in a Decision Support Algorithm Used for Child ProtectionHansen, T. M., Sinatra, R. & Sekara, V., 2024, FAccT '24: Proceedings of the 2024 ACM Conference on Fairness, Accountability, and Transparency. p. 290-300 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Decision Algorithm 100% Maltreatment 100% Child Protection 100% Decision Support System 100% Freedom of Information 100% The Opportunities, Limitations, and Challenges in Using Machine Learning Technologies for Humanitarian Work and DevelopmentSekara, V., Karsai, M., Moro, E., Kim, D., Delamonica, E., Cebrian, M., Luengo-Oroz, M., Jiménez, R. M. & Garcia-Herranz, M., 2024, In: Advances in Complex Systems. 27, 3, 16 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Machine Learning 100% Artificial Intelligence 100% Data Management Tools 100% Machine Learning Technology 100% Learning System 100% Algorithmic Fairness: Learnings From a Case That Used AI For Decision SupportSekara, V., Thorsen, T. S. S. & Sinatra, R., 2023, #6 ed. 5 p.Research output: Book / Anthology / Report › Report › Communication Open Access Tech Policy 100% Future directions in human mobility sciencePappalardo, L., Manley, E., Sekara, V. & Alessandretti, L., 2023, In: Nature Computational Science. 3, 7, p. 588-600Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Human Mobility 100% Mobility Science 100% Behavior (Neuroscience) 100% Face 100% Spatial Cognition 100% How Do US Congress Members Advertise Climate Change: An Analysis of Ads Run on Meta’s PlatformsAisenpreis, L., Gyrst, G. & Sekara, V., 2023, Proceedings of the International AAAI Conference on Web and Social Media.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Climate Change 100% Advertise 100% U.S. Congress 100% Democrats 100% Political Communication 100% View all 8 research outputs Projects Projects per year 2020 2020 2022 2025 2 Finished Projects per year DIREC : Understanding Biases and Diversity of Big Data used for Mobility AnalysisSekara, V. (PI) & Barkhuus, L. (CoI)Innovation Fund Denmark01/07/2022 → 01/07/2023Project: Research DIREC: Digital Research Centre DenmarkGodskesen, J. C. (PI), Barkhuus, L. (PI), Bonnet, P. (PI), Brabrand, C. (PI), Schürmann, C. (PI), Sekara, V. (PI), David, B. M. (PI), Husfeldt, T. (PI), Curticapean, R.-C. (PI), Limaye, N. (PI), Aumüller, M. (PI), Jacob, R. (PI), Risi, S. (PI), Wasowski, A. (PI), Okkels, C. B. (CoI), Berthelsen, K. H. (CoI), Larsen, M. K. (CoI), Schmidt, M. D. (CoI) & Ghaffari, M. (CoI)Innovation Fund Denmark01/10/2020 → 30/09/2025Project: Research Digital Research 100% Denmark 100% Research Centre 100% Danish 83% Industry Organization 33% Press/Media Nu vil regeringen og opruste mod cyberangrebSekara, V.09/06/20211 Media contributionPress/Media: Press / Media Hvordan påvirker algoritmer?Sekara, V.27/04/20211 Media contributionPress/Media: Press / Media HØR OM ALGORITMERSekara, V.23/04/20211 Media contributionPress/Media: Press / Media PRM / Hvordan påvirker algoritmer vores samfund?Sekara, V.08/04/20211 Media contributionPress/Media: Press / Media Prizes Årets Forskningsmiljø 2022Szell, M. (Recipient), Sinatra, R. (Recipient), Aiello, L. M. (Recipient), Coscia, M. (Recipient), Rossi, L. (Recipient), Sekara, V. (Recipient), Cunha, T. O. (Recipient), Kostic, B. (Recipient), Sousa, S. (Recipient), Vierø, A. R. (Recipient), Vybornova, A. (Recipient), Xing, Y. (Recipient) & Zappalà, C. (Recipient), 1 Jun 2022Prize: Prizes, scholarships, distinctions Spar 100%",
  "content_length": 5147,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:00"
}