{
  "name": "Veelasha Moonsamy",
  "homepage": "https://www.veelasha.org",
  "status": "success",
  "content": "Veelasha Moonsamy's Homepage Veelasha Moonsamy Home Publications Teaching About Me Latest News Two papers accepted at IEEE S&P 2025 Daniel's paper (baseband firmware) and Stefan's paper (privacy-compliant implementation)) will appear at IEEE S&P 2025, San Francisco. ACM TOPS article now online Hamid's work on robust Android malware detection is now available as an ACM TOPS journal article. Two papers accepted at NDSS 2025 Daniel's paper (chipset vulnerabilities) and Philipp's paper (wireless jamming)) will appear at NDSS 2025, San Diego. PC chair for ACNS 2025, DIMVA 2025-2026 I will serve as PC chair for ACNS 2025 and DIMVA 2025, 2026. Keynote DIMVA 2024 I will give a keynote at DIMVA 2024 (17-19 July) in Lausanne. Looking forward to it! CASA WISC 2023 I was co-organizer of the 2nd edition of the Women in Security and Cryptography workshop in June 2023. This article nicely summarises the event. Paper acceptance at USENIX Security 2023 Daniel will present his paper at USENIX SEC 2023 (more...) I am a Professor at the Faculty of Computer Science at Ruhr University Bochum, where I lead the Chair for Security and Privacy of Ubiquitous Systems (UbiSys) and serve as Vice Dean for Outreach, Knowledge Transfer and Internationalization. I am also a member of the Horst Görtz Institute for IT Security, and a Principal Investigator and Dean of Graduate School in the Excellence Cluster CASA . Previously, I was affiliated as tenure-track Assistant Professor with the Digital Security group at Radboud University and Software Systems group at Utrecht University, both in The Netherlands. I was also a postdoctoral researcher in the Digital Security Group at Radboud University. I received my PhD from Deakin University, Australia. Research Interests Security and privacy for IoT/Embedded devices User data privacy Privacy engineering; privacy compliance Applications of machine learning for security & privacy Adversarial machine learning UbiSys Group Postdoc Tarini Saka (Ruhr University Bochum) PhD students Ramya Kandula (Ruhr University Bochum) Felix Kalinowski (Ruhr University Bochum) Agata Stanczyk (Ruhr University Bochum) Philipp Mackensen (Ruhr University Bochum) Dimitri Mankowski (Ruhr University Bochum) Daniel Klischies (Ruhr University Bochum) Hamid Bostani (Radboud University) Mindy Tran (MPI-SP, daily supervisor: Dr. Yixin Zou) Yulian Sun (Ruhr University Bochum (external), daily supervisor: Prof. Dr. Asja Fischer) Stefan Horstmann (Ruhr University Bochum, daily supervisor: Prof. Dr. Alena Naiakshina) Lukas Stennes (Ruhr University Bochum, daily supervisor: Prof. Dr. Gregor Leander) Contact Information Office: MC 4/127 Phone: (+49) (0) 234 32  15748 Email: email(at)veelasha.org (preferred) veelasha.moonsamy(at)rub.de Socials: @veelasha_m, @veelasha.bsky.social PGP: public key Fingerprint: 3226 DB6D DE6E 9C87 8F55  7FED 1927 F6DF 1C2A B489 Postal Address Ruhr University Bochum Chair for Security & Privacy of Ubiquitous Systems MC 4/127 Universitätsstraße 140 44799 Bochum Germany Information for visitors For directions, see here Copyright © design from HTML5 Web Templates Last modified on 2025/05/04",
  "content_length": 3142,
  "method": "requests",
  "crawl_time": "2025-12-01 14:42:59"
}