{
  "name": "Veena Goswami",
  "homepage": "https://ksca.kiit.ac.in/profiles/veena-goswami",
  "status": "success",
  "content": "Veena Goswami – School of Computer Applications Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Veena Goswami Veena Goswami Veena Goswami Director General, School of Computer ApplicationsVeena Goswami is currently a Professor in the School of Computer Applications, Kalinga Institute of Industrial Technology, Bhubaneswar, India. She received her Ph.D degree from Sambalpur University, India, in the year 1994 and then worked as post-doctoral fellow at Indian Institute of Technology, Kharagpur for two years. Her research interests include continuous- and discrete-time queues. She has published research articles in INFORMS Journal of computing, Computers and Operations Research, Applied Mathematical Modelling, Performance Evaluation, Computers and Mathematics with Applications, Computers and Industrial Engineering, Applied Mathematics and Computation, Methodology and Computing in Applied Probability, etc. Profile LinksEmail :[email protected] Social LinksProfileRecent PublicationsProfileRecent PublicationsJournals/Conferences :Kalinga Institute of Industrial Technology, Bhubaneswar, School of Computer Application, Odisha, India Author ID: 6602575757 Chaudhry, M. L., & Goswami, V. (2018). The Queue Geo/G/1/N+ 1 Revisited. Methodology and Computing in Applied Probability, 1-14. Goswami, V., & Panda, G. (2018). Optimal information policy in discrete-time queues with strategic customers. Journal of Industrial & Management Optimization, 665-688. Goswami, V., & Panda, G. (2018). Mixed equilibrium and social joining strategies in Markovian queues with Bernoulli-schedule-controlled vacation and vacation interruption. Quality Technology & Quantitative Management, 1-29. Goswami, V., & Mund, G. B. (2017). Computational analysis of multi-server discrete-time queueing system with balking, reneging and synchronous vacations. RAIRO-Operations Research, 51(2), 343-358. Panda, G., Goswami, V., & Banik, A. D. (2017). Equilibrium behaviour and social optimization in Markovian queues with impatient customers and variant of working vacations. RAIRO-Operations Research, 51(3), 685-707. Panda, G., Goswami, V., & Banik, A. D. (2016). Equilibrium and socially optimal balking strategies in Markovian queues with vacations and sequential abandonment. Asia-Pacific Journal of Operational Research, 33(05), 1650036. Goswami, V. (2016). Relationship between randomized F-policy and randomized N-policy in discrete-time queues. Opsearch, 53(1), 131-150. Guha, D., Goswami, V., & Banik, A. D. (2016). Algorithmic computation of steady-state probabilities in an almost observable GI/M/c queue with or without vacations under state dependent balking and reneging. Applied Mathematical Modelling, 40(5-6), 4199-4219. Guha, D., Goswami, V., & Banik, A. D. (2015). Equilibrium balking strategies in renewal input batch arrival queues with multiple and single working vacation. Performance Evaluation, 94, 1-24. Banerjee, A., Gupta, U. C., & Goswami, V. (2014). Analysis of finite-buffer discrete-time batch-service queue with batch-size-dependent service. Computers & Industrial Engineering, 75, 121-128. Goswami, V., & Mund, G. B. (2011). Analysis of discrete-time batch service renewal input queue with multiple working vacations. Computers & Industrial Engineering, 61(3), 629-636. sachi2024-11-09T16:06:25+05:30 Page load link Go to Top",
  "content_length": 3397,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:04"
}