{
  "name": "Veit Hagenmeyer",
  "homepage": "https://www.iai.kit.edu/Ansprechpersonen_1213.php",
  "status": "success",
  "content": "KIT - IAI - Institut - Ansprechpersonen Institut für Automation und angewandte Informatik StartseiteInstitutAnsprechpersonen Institut für Automation und angewandte Informatik (IAI)InstitutForschungStudium und LehreStellenangeboteInstitutKontakt/AnfahrtFachgebieteGruppenAnsprechpersonenTeamAnsprechpersonen Prof. Dr. Veit Hagenmeyer InstitutsleiterGruppenleiter Optimierung und Regelung (OC)334CN 449+49 721 608-29200veit hagenmeyer ∂does-not-exist.kit edu Karlsruher Institut für Technologie (KIT) Institut für Automation und angewandte Informatik (IAI) Hermann-von-Helmholtz-Platz 1 76344 Eggenstein-Leopoldshafen Fax: +49 721 608 22602 Gebäude-Nr.: 445 / 449 / 668 KIT - STS - Medien/Public Relations - Presseservice - Expertinnen und Experten des KIT - ...zu aktuellen Themen - KIT-Expertinnen und -Experten zum Wissenschaftsjahr 2025 – Zukunftsenergie (17.06.2025) KIT - STS - Medien/Public Relations - Presseservice - Expertinnen und Experten des KIT - Energiesystem - Prof. Veit Hagenmeyer sprungmarken_marker_4645 Publikationen 2026 Buchaufsätze Towards ICT-Enabled Multi-agent Based Operations in Local Energy Communities: A Proof of ConceptHuang, H.; Fernengel, N.; Xhonneux, A.; Holtwerth, A.; Hehemann, M.; Hoppe, E.; Waczowicz, S.; Förderer, K.; Hagenmeyer, V.; Müller, D.2026. Energy Informatics – First Nordic Energy Informatics Academy Conference, EIA Nordic 2025, Stockholm, Sweden, August 20–22, 2025, Proceedings, Part I. Ed.: I. Martinac, 323–340, Springer Nature Switzerland. doi:10.1007/978-3-032-03101-3_23 Proceedingsbeiträge Utilizing ER Model Extraction for an Industry Data Validation Use CaseSchmurr, P.; Schmidt, A.; Friedrich, M.; Stucky, K.-U.; Suess, W.; Hagenmeyer, V.2026. Knowledge Discovery, Knowledge Engineering and Knowledge Management – 16th International Joint Conference, IC3K 2024, Porto, Portugal, November 17–19, 2024, Revised Selected Papers. Ed.: J. Bernardino, 301–325, Springer Nature Switzerland. doi:10.1007/978-3-032-06878-1_14 OniOn: An RGCN-Based Ontology Alignment Approach for Energy Data IntegrationLiu, N.; Schmidt, A.; Stucky, K.-U.; Suess, W.; Hagenmeyer, V.2026. The Semantic Web: ESWC 2025 Satellite Events, Portoroz, SLO, June 1–5, 2025, Proceedings. Ed.: E. Curry, 87–92, Springer Nature Switzerland. doi:10.1007/978-3-031-99554-5_16 2025 Buchaufsätze On the Art of Electric Power System Modelling and Simulation for Integrated Transmission-Distribution AnalysisKühnapfel, U.; Hagenmeyer, V.2025. Modelling the Energy Transition. Ed.: R. Erdbeer, 117–133, Springer Nature Switzerland. doi:10.1007/978-3-031-69031-0_7 Bücher Modelling the Energy Transition – Cultures, Visions, NarrativesErdbeer, R. M.; Hagenmeyer, V.; Stierstorfer, K. (Hrsg.)2025. Palgrave Macmillan. doi:10.1007/978-3-031-69031-0 Dissertationen Methods for Robust and Efficient Deep Learning and Improved Data Utilization in Large-Scale Data Generation Settings. DissertationRettenberger, L.2025, November 27. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000187577 Flat Hybrid Automata for Automation and Control of Hybrid Systems. DissertationZahn, F.2025, November 26. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000187515 Investigation of sample preparation and imaging methods for structural characterization of samples from micro- and nanotechnology. DissertationHuang, L.2025, November 10. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000186595 Ein neues Verfahren zur Detektion von Cyber-Angriffen auf zukünftige Energiesysteme unter Nutzung physikalischer Modellansätze. DissertationReibelt, K. B.2025, Juli 29. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000183407 Investigation of Moisture Influence and Solution Processable Encapsulation Strategies for Flexible Printed Electronics. DissertationChen, Z.2025, Juli 15. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000183133 Generation of Synthetic Data for Large-Scale Image Analysis with Generative Adversarial Networks. DissertationBöhland, M.2025, Mai 21. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000181806 Automated machine learning for time series forecasting in smart grid applications. DissertationMeisenbacher, S.2025, Mai 5. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000181215 Addressing Low-Quality Domain Knowledge in Knowledge-Guided Machine Learning. DissertationBielski, P.2025, März 25. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000180298 Cross-Machine Multi-Phase Advanced Persistent Threat Detection and Investigation via Provenance Analytics. DissertationLiu, Q.2025, Februar 28. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000179480 Messtechnische Methoden zur Identifikation von Modellparametern in Niederspannungsnetzen. DissertationJumar, R.2025, Januar 8. Karlsruher Institut für Technologie (KIT). doi:10.5445/IR/1000177786 Occupant-Oriented Demand Response with Model Predictive Heating Control in a Multi-Zone Residential Building. DissertationFrahm, M.2025. KIT Scientific Publishing. doi:10.5445/KSP/1000174319 Zeitschriftenaufsätze Commander: A robust cross-machine multi-phase Advanced Persistent Threat detector via provenance analyticsLiu, Q.; Bao, K.; Hagenmeyer, V.2025. Journal of Information Security and Applications, 91, Art.-Nr.: 104057. doi:10.1016/j.jisa.2025.104057 A Global Analysis of Cyber Threats to the Energy Sector: “Currents of Conflict” from a geopolitical perspective\"Sanchez Collado, G.; Elbez, G.; Hagenmeyer, V.2025. atp magazin, 67 (9), 56–66. doi:10.17560/atp.v67i9.2797 Nonstandard power grid frequency statistics across continentsWen, X.; Anvari, M.; Rydin Gorjão, L.; Yalcin, G. C.; Hagenmeyer, V.; Schäfer, B.2025. Scientific Reports, 15 (1), 38470. doi:10.1038/s41598-025-25334-4 Understanding novel district concepts: A structured exploration of interdisciplinary clustering in urban energy systemsGalenzowski, J.; Waczowicz, S.; Çakmak, H. K.; Tajalli-Ardekani, E.; Beichter, S.; Ekin, Ö.; Mikut, R.; Hagenmeyer, V.2025. Energy Reports, 14, 3673–3689. doi:10.1016/j.egyr.2025.10.021 Decentralized Control of DC Microgrids: Introducing the State-of-Grid Concept: How the Principles of Communicating Vessels Could Be Used in DC Microgrid ControlEkin, Ö.; Carne, G. D.; Hagenmeyer, V.2025. IEEE Industrial Electronics Magazine, 2–13. doi:10.1109/MIE.2025.3607070 Characterization of grid-oriented control of heat pumps via SG-ReadyBeichter, S.; Süß, A.-C.; Galenzowski, J.; Dillmann, J.; Dietze, S.; Mikut, R.; Waczowicz, S.; Hagenmeyer, V.2025. IET Conference Proceedings, 2025 (14), 2081–2085. doi:10.1049/icp.2025.1999 On autoregressive deep learning models for day-ahead wind power forecasts with irregular shutdowns due to redispatchingMeisenbacher, S.; Selzer, S. A.; Dado, M.; Beichter, M.; Martin, T.; Zdrallek, M.; Bretschneider, P.; Hagenmeyer, V.; Mikut, R.2025. at - Automatisierungstechnik, 73 (10), 752–766. doi:10.1515/auto-2024-0171 Leveraging unlabeled SEM datasets with self-supervised learning for enhanced particle segmentationRettenberger, L.; Szymanski, N. J.; Giunto, A.; Dartsi, O.; Jain, A.; Ceder, G.; Hagenmeyer, V.; Reischl, M.2025. npj Computational Materials, 11 (1), 289. doi:10.1038/s41524-025-01802-3 Non-linear active disturbance rejection control for buck and boost DC/DC convertersKorompili, A.; Ekin, O.; Hagenmeyer, V.; Monti, A.2025. IEEE Journal of Emerging and Selected Topics in Power Electronics, 1. doi:10.1109/JESTPE.2025.3594635 HADES: Detecting and Investigating Active Directory Attacks via Whole Network Provenance AnalyticsLiu, Q.; Bao, K.; Hassan, W. U.; Hagenmeyer, V.2025. IEEE Transactions on Dependable and Secure Computing, 1–18. doi:10.1109/TDSC.2025.3611866 Averaging-based energy balancing controller for modular multilevel converters; [Mittelungsbasierter Energiebalanceregler für modulare Multilevel-Umrichter]Kastner, A.; Katzenburg, N.; Gröll, L.; Hagenmeyer, V.2025. at - Automatisierungstechnik, 73 (8), 636 – 646. doi:10.1515/auto-2025-0048 Experimental evaluation of model predictive control and fuzzy logic control for demand response in buildingsLangner, F.; Kovačević, J.; Spatafora, L.; Dietze, S.; Waczowicz, S.; Çakmak, H. K.; Matthes, J.; Hagenmeyer, V.2025. Applied Energy, 401, Article no: 126666. doi:10.1016/j.apenergy.2025.126666 A Survey on the Current State of Demand Response Implementations: Models and ApproachesLi, C.; Langner, F.; Förderer, K.; Matthes, J.; Hagenmeyer, V.2025. ACM SIGEnergy Energy Informatics Review, 5 (1), 12–24. doi:10.1145/3757888.3757890 Probabilistic Day-Ahead Battery Scheduling based on Mixed Random Variables for Enhanced Grid OperationPinter, J.; Zahn, F.; Beichter, M.; Mikut, R.; Hagenmeyer, V.2025. Sustainable Energy, Grids and Networks, 44, 101813. doi:10.1016/j.segan.2025.101813 Open energy services: forecasting and optimization as a service for energy management applications at scaleWölfle, D.; Förderer, K.; Riedel, T.; Fernengel, N.; Landwich, L.; Mikut, R.; Hagenmeyer, V.; Schmeck, H.2025. Data-Centric Engineering, 6, e35. doi:10.1017/dce.2025.14 Optimal BESS Management for Peak Load Shaving and Battery Health Under Prediction UncertaintyLi, L.; Kappler, T.; Schwarz, B.; Munzke, N.; Dai, X.; Hagenmeyer, V.; Hiller, M.2025. IEEE Transactions on Sustainable Energy, 1–13. doi:10.1109/TSTE.2025.3586064 Validation of the smart readiness indicator on real test buildings - energy efficiency of heat generatorsPerson, L.; Emich, T.; Spatafora, L.; Hagenmeyer, V.; Lennerts, K.2025. Energy and Buildings, 346, Article no: 116128. doi:10.1016/j.enbuild.2025.116128 A Novel Digital Twin – based Framework and Methodology for Enhancing the Contribution of Loads to Frequency ControlAraúz, J.; Labonne, A.; Besanger, Y.; Wurtz, F.; Waczowicz, S.; Hagenmeyer, V.2025. IEEE Access, 13, 128475–128491. doi:10.1109/ACCESS.2025.3590215 Decision-focused fine-tuning of time series foundation models for dispatchable feeder optimizationBeichter, M.; Friederich, N.; Pinter, J.; Werling, D.; ",
  "content_length": 192827,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:02"
}