{
  "name": "Veli Mäkinen",
  "homepage": "https://www.helsinki.fi/en/researchgroups/genome-scale-algorithmics/people/veli-makinen",
  "status": "success",
  "content": "Veli Mäkinen | Genome-scale algorithmics | University of Helsinki Skip to main content Veli Mäkinen Professor Veli Mäkinen works in the areas of algorithmic bioinformatics and succinct data structures. Most recently prof. Mäkinen has focused on extending sequence analysis to different pan-genome representations such as directed acyclic graphs. Frequently used techniques include dynamic programming, reductions, stringology, and data compression. Professor Veli Mäkinen I am Professor of Computer Science at the Department of Computer Science of the University of Helsinki and Vice Head of Department. I mostly teach advanced computer science courses on algorithms and on bioinformatics. I am leading a research group on Genome-Scale Algorithmics. The group is part of Algorithmic Bioinformatics lab. Publications Recent publications from the university database: I publish mainly in bioinformatics venues. Some algorithmic results of more general flavor are offered to theoretical computer science venues. Occasionally the tools developed enable new ways of analysis of biological measurement data, and then a molecular biology venue will be primary choice. Teaching , Autumn 2021 , Spring 2021 , Autumn 2020 , Autumn 2020 , Spring 2020 , Autumn 2019 ... My courses typically follow a weekly schedule of lecture, study group, and exercise session. I prefer blackboard demonstration lectures that give extra insights on top of (self-study) lecture material.  Study groups often are about guided online problem solving. Exercises are independent homework and on small courses I use them as mini-exams. I'm happy to supervise Master's theses and discuss PhD study opportunities on the topics of my courses and seminars: algorithms and data structures, algorithmic bioinformatics, data compression, string processing, etc. Activities Activities from the university database: Contact and biography Veli Mäkinen is Professor of Computer Science at the University of Helsinki and Vice Head of Department. He heads the Genome-scale algorithmics group at the Algorithmic Bioinformatics lab. He has supervised seven PhD theses and over fifty Master's theses. He is currently supervising one PhD student. Veli Mäkinen started his career in string algorithms and compressed data structures. He defended his PhD thesis at the University of Helsinki in 2003. After a postdoctoral visit to Bielefeld University 2004-2005, he returned to Helsinki with the support of Postdoctoral Fellow (2005-2007) and Academy Research Fellow (2007-2009) grants from the Academy of Finland. He started in his current position as Professor in 2010. As of 2024, Veli Mäkinen has 128 peer-reviewed publications on the aforementioned topics, with the focus being shifted towards algorithmic bioinformatics, where different high-throughput sequencing data analysis scenarios make near-linear time algorithms that work in small space an appealing target of study. Inspired by this new angle to bioinformatics algorithms, Veli Mäkinen co-authored a textbook on Genome-scale Algorithm Design: Bioinformatics in the Era of High-Throughput Sequencing, 2nd edition published by Cambridge University Press, 2023. The new textbook works as the main material for algorithmic bioinformatics courses taught frequently by Veli Mäkinen. He also teaches the general algorithms courses Design and Analysis of Algorithms, String Processing Algorithms, Data Compression Techniques, and projects and seminars related to these topics. Some current research interests include studying algorithms and computational complexity when moving from sequences to variation graphs in (pan-)genomics, and studying applications of different index structures related to the variants of the Burrows-Wheeler transform. Funding for these research endeavours by Veli Mäkinen are provided through EU projects (2019-2024) and TeamPerMed (2023-2029). Earlier research projects of Veli Mäkinen include consortium \"Massively Parallel Algorithms and Analysis for Metagenomics and Pangenomics (MAPAMEPA)\" (2022-2024), \"Sequence analysis revisited and extended\" (2017-2021), and membership in CoE in Cancer Genomics Research (2012-2017), all funded by the Academy of Finland. Besides research and teaching, Veli Mäkinen has an active role in the research community. Some recent activities include co-chairing CPM 2025, co-chairing IWOCA 2016 and guest editing a special issue for Theory of Computing Systems, program committee memberships (ESA 2022, WABI 2023, ISMB 2025, RECOMB 2025), and keynote/invited talks e.g. at the ECCB 2016 workshop on Computational Pan-Genomics, SPIRE 2019, and Genome Informatics meeting at Cold Spring Harbor Laboratory, 2023. Home People Veli Mäkinen P.O. Box 3 (Fabianinkatu 33) 00014 University of Helsinki Switchboard: +358 (0) 2941 911 (mobile call charge / local network charge)",
  "content_length": 4836,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:06"
}