{
  "name": "Venkata L. Raju Chinthalapati",
  "homepage": "https://www.gold.ac.uk/computing/people/chinthalapati-raju",
  "status": "success",
  "content": "Dr Raju Chinthalapati | Goldsmiths, University of London Main menu Staff & students In this section Raju’s research focuses on Financial Technologies, Big Data Analysis, Computational Finance, Financial Econometrics and Operations Research. Staff details Position Reader in Financial Technologies Department Computing Email V.Chinthalapati (@gold.ac.uk) Raju is an experienced academic, researcher and consultant with research background in finance, economics, statistics, mathematics, computer science and engineering.  Raju’s main research objective is bridging the gap between computer science and social science by developing computational techniques and software tools and brining more scientific approach to economics and finance.  Raju’s research focus is on 1) understanding the market microstructure, the associated liquidity risk in high frequency financial markets, 2) democratising financial access/advice and designing frictionless financial markets using FinTech, 3) developing algorithms for big data analysis in finance and 4) applications of AI/Machine Learning in business analytics. On practical side, Raju is interested in developing software tools for 1) algorithmic trading, 2) risk monitoring and 3) automation in financial world. Raju is a Reader in Financial Technologies in the Department of Computing, Goldsmiths, University of London. Before joining University of London, Raju was Assistant Professor in Finance at University of Southampton. Previously, he worked for Deutsche Bank, London as FX strategy researcher and for AlixPartners as consultant in competition economics. Publications and research outputs ArticleNowcasting directional change in high frequency FX markets Tsang, Edward P. K.; Ma, Shuai; and Chinthalapati, V. L. Raju . 2024. Nowcasting directional change in high frequency FX markets. Intelligent Systems in Accounting, Finance and Management, 31(1), e1552. ISSN 1055-615X International trade network and stock market connectedness: Evidence from eleven major economies You, Kefei; Chinthalapati, V. L. Raju ; Mishra, Tapas; and Patra, Ramakanta. 2024. International trade network and stock market connectedness: Evidence from eleven major economies. Journal of International Financial Markets, Institutions and Money, 91, 101939. ISSN 1042-4431 On the laplace transforms of the first hitting times for drawdowns and drawups of diffusion-type processes Gapeev, Pavel; Rodosthenous, Neofytos; and Chinthalapati, V. L. Raju . 2019. On the laplace transforms of the first hitting times for drawdowns and drawups of diffusion-type processes. Risks, 7(3), pp. 1-15. ISSN 2227-9091 Research Interests Financial TechnologiesQuantitative and Computational FinanceBig Data and AnalyticsFinancial EconometricsMarket MicrostructureAgent-based ModelsComplexity ScienceOperations Research",
  "content_length": 2825,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:06"
}