{
  "name": "Venkat Chandrasekaran",
  "homepage": "http://users.cms.caltech.edu/~venkatc",
  "status": "success",
  "content": "Venkat Chandrasekaran Venkat Chandrasekaran Kiyo and Eiko Tomiyasu Professor Computing and Mathematical Sciences & Electrical Engineering Division of Engineering and Applied Science California Institute of Technology Email: alpha@beta.edu, alpha = venkatc, beta = caltech Research Interests I am an applied mathematician with research interests in optimization and the information sciences. Specific areas of focus include convex optimization, statistical inference, inverse problems, graphs and combinatorial optimization, and applied algebra and geometry. My research group studies the mathematical foundations of these topics to develop principled methods for applications in science and engineering. A full list of publications can be found here. Research Group Current members Eray Atay (Ph.D. student) Eitan Levin (Ph.D. student) Elvira Moreno (Ph.D. student) Kevin Shu (Postdoc) Alumni (in reverse chronological order) Oscar Leong; Assistant Professor, UCLA Eliza O'Reilly; Assistant Professor, Johns Hopkins University Mateo Diaz; Assistant Professor, Johns Hopkins University Riley Murray; Staff Scientist, Sandia National Laboratory Armeen Taeb; Assistant Professor, University of Washington Utkan Candogan; Applied Scientist, Uber Yong Sheng Soh; Assistant Professor, National University of Singapore Quentin Berthet; Research Scientist, Google Teaching Mathematical Optimization [Winter 2014, Fall 2014-2024] Mathematics of Electrical Engineering [Fall 2020, 2022, 2024] Great Ideas in Data Science [Fall 2023] Topics in Optimization [Spring 2013, Spring 2016, Fall 2019] Statistical Inference [Spring 2014, Winter 2015, Spring 2017, Fall 2018] Bio (third-person) Venkat Chandrasekaran is on the faculty at Caltech in Computing and Mathematical Sciences and in Electrical Engineering. He received a Ph.D. in Electrical Engineering from MIT (2011) and undergraduate degrees in Mathematics and in Electrical Engineering from Rice University (2005). His research interests lie in optimization and the information sciences. Contact Mail: 1200 E. California Blvd., Mail Code 305-16, Pasadena, CA 91125 Phone: (626) 395-6568 Office: Annenberg 300 Last updated: July 2025",
  "content_length": 2176,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:04"
}