{
  "name": "Venkata Gandikota",
  "homepage": "https://sites.google.com/view/gvenkata",
  "status": "success",
  "content": "GVSearch this siteEmbedded FilesSkip to main contentSkip to navigationVenkata Gandikota (GV)Address: CST 4-125,  Syracuse University, Syracuse, NY 13210E-mail:  <lastname>[dot]<firstname>[at]gmail[dot]comAssistant ProfessorElectrical Engineering  and Computer Science Department, Syracuse University.Affiliate Faculty at EnCORE: Institute for Emerging CORE Methods of Data Science.Senior Member, IEEE. Research overview: My research develops efficient, noise-resilient algorithms for the fundamental reconstruction problems that aim to reliably recover signals (also graphs, matrices, or quantum states) from limited, noisy, or corrupted data. The central approach is the use of structured redundancy, where I leverage insights from combinatorics to strategically extract structure from limited observations. This creates robust, efficient algorithms for applications spanning machine learning, distributed learning, sparse recovery, and secure communications. This work also extends to property testing, which allows for the efficient identification of specific properties or anomalies in large-scale datasets without requiring full data inspection.Research Interests: Foundations of Machine LearningAlgorithms for Big DataCoding Theory & LatticesInformation TheoryNote: I am not currently in a position to take on new students, interns, RAs, or postdocs.Links:Foundations of Data Science Virtual Talk SeriesEncore Institute Biography: I am an Assistant Professor in the Department of Electrical Engineering and Computer Science at Syracuse University, and an affiliate faculty member at EnCore: Institute for Emerging CORE Methods in Data Science. I am also a Senior Member of the IEEE.My research lies at the intersection of coding theory, point lattices, and foundational problems in machine learning. I am particularly interested in how algebraic and geometric structures can be leveraged to design efficient, robust algorithms for modern data-driven tasks. Parts of my work are supported by the CUSE and SOURCE RA grants.Prior to joining Syracuse, I held postdoctoral research positions at the University of Massachusetts Amherst and Johns Hopkins University. I received my Ph.D. in Computer Science from Purdue University, and earned dual undergraduate degrees in Mathematics (M.Sc.) and Computer Science (B.E.) from the Birla Institute of Technology & Science, Goa, India.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2428,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:03"
}