{
  "name": "Venu Govindaraju",
  "homepage": "https://cubs.buffalo.edu/about-the-director",
  "status": "success",
  "content": "About the Director - Center for Unified Biometrics and Sensors - University at Buffalo About the Director Dr. Venu Govindaraju, UB Senior Vice President for Research, Innovation and Economic Development, is the founding director of the Center for Unified Biometrics and Sensors. Dr. Venu Govindaraju Senior Vice President for Research, Innovation and Economic Development, University at Buffalo SUNY Distinguished Professor, Department of Computer Science and EngineeringPhone: 716-645-1558; Fax: 716-645-2377 Email: govind@buffalo.eduDr. Govindaraju received his Bachelor’s degree with honors from the Indian Institute of Technology (IIT) in 1986, and his Ph.D. from UB in 1992. His research focus is on  machine learning and pattern recognition in the domains of Document Image Analysis and Biometrics.Research Projects previous next Multilingual OCR3/30/22Our objective is to automatically recognize handwritten and mixed-type documents in multiple languages. Our current focus is on pre-processing of documents and development of novel features for handwriting recognition.Historical Documents3/30/22We are exploring the development of computational methodologies and applications that will enable user-friendly digital access to literary and historical document images in Sanskrit.Tablet and PDA Interfaces11/9/19We are investigating a new kind of scientiﬁc information interface which involves the use of a touch screen device such as a tablet, supporting sketching and handwriting input to access, annotate, store and retrieve research material. Personal research materials can therefore be organized and shared selectively in a reliable social networking environment by academic researchers.Medical Informatics11/9/19Emergency Medical Systems (EMS) agencies, as first responders in medical emergency scenarios, are uniquely positioned to provide valuable data for surveillance and early warning systems.Web Security11/9/19We are developing new technologies to beat the spambots by exploiting the difficulty that computers have with recognizing joined-up handwriting. The hope is that switching from text-based verification systems to systems that use computer-generated handwriting will make many web services more secure.Writer Accent11/9/19We are exploring two hypotheses with respect to analysis of an individual’s handwriting: (i) analogous to speech, accent is a trait that is also present in handwriting and can potentially be used as a novel soft biometric, (ii) an individual’s handwriting is a mixture of writing style influences (right to left versus left to right, short strokes with rapid pen lifts, curves, etc.) and can be decomposed into the constituents.Face and Facial Expressions3/30/22We are creating a new composite biometric that includes the static face appearance features as well as the behavioral expression features that will, in remote authentication applications, verify the humanness, liveness, and the identity of a user in a single interaction.Cancelable Biometrics3/30/22Our focus is on Integrating Privacy Preserving Biometric Templates and Efficient Indexing Methods. While people are usually willing to submit their biometric information to government agencies, they are less likely to do so for commercial companies without a guarantee of privacy protection. See More Research Projects",
  "content_length": 3329,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:10"
}