{
  "name": "Vered Shwartz",
  "homepage": "https://www.cs.ubc.ca/~vshwartz",
  "status": "success",
  "content": "Vered Shwartz - Department of Computer Science - UBC Search Computer ScienceDr. Vered Shwartz Home Group Research Publications Book Talks Teaching Contact CV Blog UBC NLP Computer Science / Vered Shwartz / Home Photo by Ian Redd [high resolution photos] I am an Assistant Professor of Computer Science at the University of British Columbia, and a CIFAR AI Chair at the Vector Institute. My research interests focus on natural language processing, with the fundamental goal of building models capable of human-level understanding of natural language. My lab is currently working on testing and improving the capabilities of large language models and vision and language models, developing culturally-competent AI, and responsible NLP applications in sensitive domains (e.g., legal, medical). Before joining UBC, I was a postdoctoral researcher at the Allen Institute for AI (AI2) and the Paul G. Allen School of Computer Science & Engineering at the University of Washington. Prior to that, I did my PhD (2019), M.Sc. (2015), and B.Sc. (2013) in Computer Science in Bar-Ilan University. I was part of the Natural Language Processing lab where I worked on lexical and compositional semantics. I'm a member of the UBC NLP Group, CAIDA, Language Sciences, and ICICS. Updates October 2025 Check out my interview in the Energy Sector Heroes podcast on AI, job applications, and the future of work! October 2025 Check out my interview in the WiAIR podcast about cultural competence in AI! October 2025 Lost in Automatic Translation is now available in print, ebook, and as an audiobook! February 2025 My nonfiction book Lost in Automatic Translation is coming out this summer! December 2024 Invited talk at the Workshop on Large Foundation Models for Educational Assessment, NeurIPS August 2024 Invited talk at the Human-Centered Large Language Modeling Workshop, ACL June 2024 Invited talk at the Workshop on Figurative Language Processing, NAACL May 2024 Invited talk at the Workshop on Reference, Framing, and Perspective, LREC-COLING August 2023 New blog post: Tips for Writing NLP Papers July 2023 Invited talk at the Workshop on Narrative Understanding, ACL May 2023 Invited talk at the Workshop on Insights from Negative Results in NLP, EACL October 2022 I have been appointed as Canada CIFAR AI Chair! February 2022 In-person (!!) talk at UCSB January 2022 Invited talk at the MLOps Vancouver Summit November 2021 Invited talk at the Workshop on Non-Monotonic Reasoning, KR August 2021 Invited talk at the Multiword Expressions (MWE) workshop, ACL June 2021 Invited talk at the Natural Logic Meets Machine Learning (NALOMA) workshop, IWCS June 2021 Invited talk at the Deep Learning Inside Out (DeeLIO) workshop, NAACL Media November 2025 The Canadian Press: Fact File: X's AI chatbot claims Carney isn't PM, Russian video set in Toronto October 2025 Energy Sector Heroes podcast: Vered Shwartz on AI, Job Applications, and the Future of Work October 2025 WiAIR: Why AI Doesn't Understand Your Culture? Dr. Vered Shwartz on Cultural Bias in LLMs October 2025 CTV National News: Is using AI for medical advice potentially harmful? October 2025 CP24: Why ‘empathetic’ AI can be too persuasive for Canadians to resist October 2025 CTV News: Why ‘empathetic’ AI can be too persuasive for Canadians to resist October 2025 The Last Show with David Cooper: Dr. Vered Shwartz: How Persuasive Is AI? October 2025 CKNW: Mornings with Simi (about LLM persuasion) October 2025 CTV News: People more influenced by advice from AI than fellow humans, UBC study finds October 2025 UBC Science: Can AI persuade you to go vegan—or harm yourself? September 2025 Cambridge News: A mind for language: Lost in Automatic Translation author Vered Shwartz on meaning and machines September 2025 CBC News: N.W.T. fire officials warn of AI-generated images, misinformation circulating online August 2025 Dazed Magazine: What does AI know about a ‘glow-up’? June 2025 The Tyee: AI May End Some Jobs. It Will Create Others June 2025 The Globe and Mail: Strengths and weaknesses of generative AI June 2025 Canadian Family Offices: Large language models are the human ‘face’ of the AI revolution. But are they ready for prime time? June 2025 UBC Language Sciences: Q&A with Vered Shwartz – Lost in Automatic Translation March 2025 FOCUS Magazine, UBC Science: Mind the InfoGap: Uncovering cultural bias in Wikipedia January 2025 Johns Hopkins News: Finding hidden biases in Wikipedia’s multilingual content January 2025 Tech Xplore: New tool finds hidden biases in Wikipedia's multilingual content November 2024 UBC Language Sciences: The LangSci Meets AI series #3: Dr. Vered Shwartz on AI biases -- causes and solutions November 2024 UBC CS: Four papers by UBC Natural Language Processing group accepted at major conference November 2024 WIRED: AI Will Understand Humans Better Than Humans Do August 2024 AI Purity Podcast: Algorithmic Bias and How To Prevent Them with Dr. Vered Shwartz June 2024 Fashion Magazine: Is AI Racist? April 2024 Toronto Star: Shepherd’s pie sushi? Green curry lasagna? AI-generated cookbooks sprinkle recipes with a dash of the deranged February 2024 ABC Radio Australia, Weekend Evenings with Sirine Demachkie, about LLMs and cultural bias February 2024 The Conversation Canada: Artificial intelligence needs to be trained on culturally diverse datasets to avoid bias February 2024 Global News: B.C. ruling on AI ‘hallucinated’ fake legal cases could set precedent, experts say February 2024 OMNI TV: Reasoning for AI (Facebook post) February 2024 L'Obs (France): ChatGPT, une intelligence artificielle pleine de biais (mais ça se soigne) January 2024 CBC News Vancouver: Understanding the world of AI January 2024 Radio-Canada: Même après avoir lu presque tout le web, l’intelligence artificielle a des préjugés January 2024 Mehar Bhatia was live on Global News: Solving diversity issues in artificial intelligence models January 2024 UBC News: ChatGPT has read almost the whole internet. That hasn't solved its diversity issues January 2024 The Globe and Mail: Will AI enable a three-day workweek? Certain billionaires think so, but some experts disagree December 2023 iNFOnews: How AI broke the news identifying TRU car crash victim July 2023 CTV News: Dr. AI and personal assistants? Here's what Canada could look like in 2050 June 2023 CBC Radio: about Duolingo (min. 40) May 2023 CBC Radio: On The Coast, Separating fact from fiction when it comes to ChatGPT May 2023 Sher-E-Punjab Radio: Dr. Jasbir Romana show, about ChatGPT and education May 2023 Vancouver Sun: B.C. educators prepare for the 'problems and promise' of AI apps like ChatGPT May 2023 Business in Vancouver: AI: Artificial intelligence can learn but it’s not ready to teach, experts say April 2023 Beyond: How to compete with AI and win in the job market April 2023 Beyond: Could AI help bring about the four-day workweek? February 2023 CBC News: AI tool raises cheating concerns January 2023 CTV News: B.C. educators concerned that students may be tempted to cheat through AI, ChatGPT (TV version) November 2022 UBC Science: A common sense approach to machine learning October 2022 CIFAR: CIFAR, Amii and the Vector Institute name eight new Canada CIFAR AI Chairs October 2022 UBC CS News: Dr. Jeff Clune and Dr. Vered Shwartz appointed Canada CIFAR AI Chairs May 2022 UBC Language Sciences: Good Night at 4 pm?! Time Expressions in Different Cultures: Q&A with Dr. Vered Shwartz October 2021 UBC CS News: Introducing Dr. Vered Shwartz, Natural Language Processing researcher May 2021 Freethink: You Can Now Live Forever. (Your AI-Powered Twin, That Is). March 2021 TWIML AI Podcast: Common Sense Reasoning in NLP October 2018 Lionbridge.ai: Why Lexical Problems are the Key to NLP?",
  "content_length": 7795,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:08"
}