{
  "name": "Vernelle A. A. Noel",
  "homepage": "https://vaanoel.com",
  "status": "success",
  "content": "Vernelle A. A. Noel – Assistant Professor | Computational Design | Carnegie Mellon University Skip to content Call for Abstracts! We are excited to invite submissions for our panel: “Embodied Knowledge(s), Technological Distancing, and Experience” at 4S Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... December 2024 – I am excited to share the publication of “Critical Computational Relations in Design, Architecture and the Built Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... December 2024 – My paper, “Repairing Code, Craft, and Computation,” was published in the Technology|Architecture + Design (TAD) journal. Cite Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... Dr. Noel was an invited speaker at the AI Actioning Summit at Columbia University on Nov. 1st, 2024. The one-day Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... Dr. Noel was one of 96 architects commissioned to produce ONE drawing and write about it as a site of Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... August 2024 – Our paper, “A mindful body approach to creating architecture: movement, models and spatial experiences,” was published in Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... 2024 – Dr. Noel’s interview with Galo Canizares about the framework and concept of “situated computation” she developed was published Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... The Situated Computation + Design Lab, led by Dr. Vernelle A. A. Noel at Carnegie Mellon University  (Pittsburgh, PA.), is looking for a PhD Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... On February 2-3, I led a workshop titled, “Tradigital Wire-Bending: Conversations Between Craft Practices and Machines” at CMU’s School of Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... On February 2nd, 2024, I gave a talk titled “Craft, Culture + Computing” at CMU’s Human-Computer Interaction Institute (HCII) Seminar Continue reading Share this: Click to share on X (Opens in new window) X Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to share on Facebook (Opens in new window) Facebook Click to print (Opens in new window) Print Like this:Like Loading... _ Artificial Intelligence (3) Awards (5) Books (1) Exhibitions (10) News (89) Projects (24) Publications (22) Talks and Events (52) Teaching (13) Workshops (8) Short Bio Vernelle A. A. Noel, Ph.D. is an architect, design scholar, artist, TED Speaker, and Director of the Situated Computation + Design Lab where she investigates traditional and automated practices, and their intersections with society. Using interdisciplinary approaches, she builds new frameworks, methodologies, and tools to explore social, cultural, and political aspects of computation and emerging technologies for new reconfigurations of practice, pedagogy, and publics. Her research has been supported by the Graham Foundation for Advanced Studies in the Fine Arts, the Mozilla Foundation, and ideas2innovation (i2i), among others. Dr. Noel is a recipient of the DigitalFUTURES Young Award for exceptional research and scholarship in the field of critical computational design. She has a TEDx Talk titled, “The Power of Making: Craft, Computation, and Carnival.” Dr. Noel holds a Ph.D. from The Pennsylvania State University, a Master of Science in Architecture Studies from MIT, a Bachelor of Architecture from Howard University, and a Diploma in Civil Engineering from the John S. Donaldson Technical Institute (Trinidad & Tobago). CV Noel_CV Contact email: vnoel@andrew.cmu.edu or vernelleaanoel@gmail.com Search for: Search Vernelle A. A. Noel Proudly powered by WordPress Theme: Maxwell. Loading Comments... Write a Comment... Email (Required) Name (Required) Website %d",
  "content_length": 6173,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:11"
}