{
  "name": "Vern Paxson",
  "homepage": "http://www.icir.org/vern",
  "status": "success",
  "content": "Vern Paxson at ICSI Networking Vern Paxson Information Email: vern@icir.org / vern@berkeley.edu / vern@corelight.com Papers and slides from various presentations. I am a Professor of the Graduate School at UC Berkeley, based out of the EECS Department (where I also have a web presence), and was the leader of the Networking and Security Group at ICSI. I am also a founder of Corelight, a startup that grew out of the Zeek Project. At UCB I taught undergraduate Computer Security and Introduction to Communication Networks, graduate Internet/Network Security, and an experimental course, Empirical Analysis. I'm currently advising one Ph.D. student, Julien Piet, and in the past I served as a Ph.D. advisor or co-advisor for students at a number of institutes: Shehar Bano (Characterization of Internet censorship from multiple perspectives, Cambridge; now at Facebook) Weidong Cui (Automating Malware Detection by Inferring Intent, UC Berkeley; now at Microsoft Research) Holger Dreger (Operational Network Intrusion Detection: Resource-Analysis Tradeoffs, Technical University of Munich, now at Siemens) Jose Maria (\"Chema\") Gonzalez (Efficient Filtering Support for High-Speed Network Intrusion Detection, UC Berkeley; now at Facebook) Grant Ho (Thwarting Sophisticated Enterprise Attacks: Data-Driven Insights and Methods, UC Berkeley; now at University of Chicago) Mobin Javed (Detecting Credential Compromise in Enterprise Networks, UC Berkeley; now on the faculty at LUMS) Jaeyeon Jung (Real-Time Detection of Malicious Network Activity Using Stochastic Models, MIT; now at Samsung) Frank Li (Remedying Security Concerns at an Internet Scale, UC Berkeley; now at Georgia Tech) Gregor Maier (Residential Broadband Internet Traffic: Characterization and Security Analysis, Technical University of Berlin; now at NetDebug) Bill Marczak (Defending Dissidents from Targeted Digital Surveillance, UC Berkeley; now at CitizenLab) Austin Murdock (Internet-Wide IPv6 Scanning, UC Berkeley; now at SixMap) Ruoming Pang (Towards Understanding Application Semantics of Network Traffic, Princeton; now at Apple) Paul Pearce (Methods and Systems for Understanding Large-Scale Internet Threats, UC Berkeley; now at Georgia Tech) Philipp Richter (Empirical Analysis of the Effects and the Mitigation of IPv4 Address Exhaustion, Technical University of Berlin; now at Akamai) Justin Samuel (UC Berkeley; now at his startup Less Bits) Robin Sommer (Viable Network Intrusion Detection in High-Performance Environments, Technical University of Munich, now at our startup Corelight) Kurt Thomas (The Role of the Underground Economy in Social Network Spam and Abuse, UC Berkeley; now at Google) Matthias Vallentin (Scalable Network Forensics, UC Berkeley; now at his startup Tenzir) Yin Zhang (Characterizing end to end Internet Performance, Cornell; now at UT Austin) Biography I received my M.S. and Ph.D. degrees from the University of California, Berkeley, and have been (and continue to be) a staff scientist with the Lawrence Berkeley National Laboratory's Network Research Group for many years. I began at the networking group of the International Computer Science Institute (ICSI) in 1999. Some of my main active research projects are CESR and Bro. The former reflects a continuation of my extensive collaboration with Stefan Savage, Geoff Voelker, and their research group at UC San Diego. My professional activities include: Steering committee member for USENIX ENIGMA and the USENIX Workshop on Free and Open Communications on the Internet. Program committee member for ACM CCS '15, USENIX ENIGMA '16 USENIX FOCI '15 and ACM SIGCOMM Workshop on Crowdsourcing and crowdsharing of Big (Internet) Data (C2B(I)D) 2015. Some former activities: Chair of the IRTF, 2001-2005 Vice-chair of ACM SIGCOMM, 2003-2007 Co-founder and steering committee member for the Internet Measurement Conference 2001-2004 Co-founder and steering committee member of USENIX Workshop on Large-Scale Exploits and Emergent Threats. Program co-chair for HotNets 2007 Program co-chair of the 2005 and 2006 IEEE Symposia on Security and Privacy Program chair for the 2nd Workshop on Rapid Malcode (WORM) Co-founder and steering committee member of Workshop on Rapid Malcode Invited talks co-chair for USENIX Security 2004 Organizer, 2003 DIMACS Workshop on Large-Scale Internet Attacks (some viewgraphs from the workshop) Program chair for USENIX Security 2003 Program co-chair for SIGCOMM 2002 Editorial board, IEEE/ACM Transactions on Networking, 2000-2004 Member of the IESG 1998-2000 glish, a language, interpreter, and C++ class library for building loosely-coupled distributed systems. flex, a lex replacement. My winning entry in the 1992 IOCCC contest. My most excellent Star Trek: The Next Generation script that Paramount was too stupid to buy. Last modified: February 2017",
  "content_length": 4846,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:12"
}