{
  "name": "Veronika A. Vanden Abeele",
  "homepage": "https://iiw.kuleuven.be/onderzoek/emedia/people/verovandenabeele",
  "status": "success",
  "content": "Vero Vanden Abeele — e-Media Vero Vanden Abeele Professor Vero Vanden Abeele is Associate Professor of Human-Computer Interaction, within the Faculty of Engineering Technology and the Department of Computer Science at the KU Leuven, where she heads the Research Unit of Human-Computer Interaction. Professor Vanden Abeele's research expertise encompasses a broad spectrum of topics, including user experience design, human-centered design, motivational design, games user research, gamification, and persuasive systems design. Her work holds a particular emphasis on health and wellbeing, where she has significantly contributed to understanding how to leverage meaningful play and gamified applications, within health contexts and with vulnerable user groups. Her commitment to the international human-computer interaction and games research community is also evident through her longstanding involvement in the ACM SIGCHI PLAY steering committee, currently acting as Vice-Chair. Beyond her academic pursuits, Professor Vanden Abeele is a co-founder of TinkerList, a startup specializing in a SaaS platform for live media production, distinguished by its superior user experience. Professor Vanden Abeele earned her Master's degree in Industrial Design ('Productontwikkeling') from the University of Antwerp. She further advanced her knowledge in Interaction Design as a Fulbright scholar at Carnegie Mellon University. Her doctoral studies culminated in a Ph.D. from the Faculty of Social Sciences at KU Leuven. Vero is also a Principal Investigator (PI) and active member of the e-Media Research Lab, the Leuven Centre for Affordable Health Technology and the KU Leuven Digital Society Institute, and PI for Augment, as a core embedded imec research group. Current PhD students Yu Chen Penelope Rekkas Post-Docs Robin De Croon Graduated Phd students Maarten Van Mechelen Jonas Geuens Karsten Gielis Ine D'Haeseleer Hanne Huygelier Esmael Nida Kedir Hannelore Strauven Aqeel Haider OnLine Publications Linkedin KU Leuven Who is Who Contact mail_outline Vero Vanden Abeele call +32 (0) 495 244 304 Affiliations KU Leuven Department of Computer Science Human-Computer Interaction (HCI) Group T Leuven Campus Andreas Vesaliusstraat 13 - box 2600 3000 Leuven eMedia pi keyboard_arrow_up To homepage kuleuven.be",
  "content_length": 2308,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:14"
}