{
  "name": "Verónica Pérez-Rosas",
  "homepage": "https://cs.txst.edu/people/faculty.html",
  "status": "success",
  "content": "Faculty : Department of Computer Science : Texas State University Skip to Content Department of Computer Science College of Science and Engineering / Department of Computer Science Faculty Welcome to the new People page. Please use the filters on the left side of the page to reduce the amount of scrolling you will have to do. Search People Clear Search Text Start Search Showing ## Results Grid List Filter Panel CLOSE Filter by: Faculty Advisors Faculty Adjunct Faculty Reset Filters 14 of 101 results Apply Filters Scroll left Scroll right Click to use this tag to refine your search in the filters menu. Show more about Dr. Isayas Adhanom Dr. Isayas Adhanom Assistant Professor Email Dr. Isayas Adhanom at ido25@txstate.edu ido25@txstate.edu The phone number for Dr. Isayas Adhanom is 512.245.2638 512.245.2638 Office for Dr. Isayas Adhanom located at Comal 307E Comal 307E Personal Website ,Dr. Isayas Adhanom Faculty Profile,Dr. Isayas Adhanom Show more about Dr. Shibbir Ahmed Dr. Shibbir Ahmed Assistant Professor Email Dr. Shibbir Ahmed at hij19@txstate.edu hij19@txstate.edu Office for Dr. Shibbir Ahmed located at Comal 311F Comal 311F Personal Website ,Dr. Shibbir Ahmed Faculty Profile,Dr. Shibbir Ahmed Show more about Moonis Ali Dr. Moonis Ali Professor Email Dr. Moonis Ali at ma04@txstate.edu ma04@txstate.edu The phone number for Dr. Moonis Ali is (512) 245-8050 (512) 245-8050 Office for Dr. Moonis Ali located at CMAL 301B CMAL 301B Faculty Profile for Dr. Moonis Ali Faculty Profile Personal Website,Dr. Moonis Ali Show more about Dr. Vicki Almstrum Dr. Vicki Almstrum Assistant Professor of Instruction Email Dr. Vicki Almstrum at vla37@txstate.edu vla37@txstate.edu The phone number for Dr. Vicki Almstrum is 512.245.6670 512.245.6670 Office for Dr. Vicki Almstrum located at Comal 207J Comal 207J Faculty Profile ,Dr. Vicki Almstrum Show more about Dr. Tsz-Chiu Au Dr. Tsz-Chiu Au Associate Professor Email Dr. Tsz-Chiu Au at qvz19@txstate.edu qvz19@txstate.edu The phone number for Dr. Tsz-Chiu Au is 512.245.4876 512.245.4876 Office for Dr. Tsz-Chiu Au located at Comal 309K Comal 309K Personal Website,Dr. Tsz-Chiu Au Faculty Profile,Dr. Tsz-Chiu Au Show more about Dr. Jishnu Banerjee Dr. Jishnu Banerjee Assistant Professor of Instruction Email Dr. Jishnu Banerjee at j_b890@txstate.edu j_b890@txstate.edu The phone number for Dr. Jishnu Banerjee is Email Only Email Only Office for Dr. Jishnu Banerjee located at Collin College Campus - A130H Collin College Campus - A130H Faculty Profile,Dr. Jishnu Banerjee Show more about Dr. Keshav Bhandari Dr. Keshav Bhandari Assistant Professor of Instruction Email Dr. Keshav Bhandari at k_b459@txstate.edu k_b459@txstate.edu The phone number for Dr. Keshav Bhandari is 512.245.3436 512.245.3436 Office for Dr. Keshav Bhandari located at Comal 207H Comal 207H Faculty Profile ,Dr. Keshav Bhandari Show more about Dr. Aniruddha Bora Dr. Aniruddha Bora Assistant Professor Email Dr. Aniruddha Bora at qvx13@txstate.edu qvx13@txstate.edu The phone number for Dr. Aniruddha Bora is 512.245.7528 512.245.7528 Office for Dr. Aniruddha Bora located at Comal 301D Comal 301D Personal Website,Dr. Aniruddha Bora Show more about Barrett Bryant Dr. Barrett Bryant Dean, Science & Engineering Email Dr. Barrett Bryant at barrett.bryant@txstate.edu barrett.bryant@txstate.edu The phone number for Dr. Barrett Bryant is (512) 245-2119 (512) 245-2119 Office for Dr. Barrett Bryant located at CENT 201 CENT 201 Faculty Profile for Dr. Barrett Bryant Faculty Profile Show more about Dr. Martin Burtscher Dr. Martin Burtscher Professor Email Dr. Martin Burtscher at mb92@txstate.edu mb92@txstate.edu Office for Dr. Martin Burtscher located at Comal 309C Comal 309C Personal Website,Dr. Martin Burtscher Faculty Profile ,Dr. Martin Burtscher Show more about Dr. Alberto Castro-Hernandez Dr. Alberto Castro-Hernandez Associate Professor of Instruction Email Dr. Alberto Castro-Hernandez at gxy16@txstate.edu gxy16@txstate.edu Office for Dr. Alberto Castro-Hernandez located at Comal 301G Comal 301G Faculty Profile ,Dr. Alberto Castro-Hernandez Show more about Xiao Chen Dr. Xiao Chen Associate Professor Email Dr. Xiao Chen at xc10@txstate.edu xc10@txstate.edu The phone number for Dr. Xiao Chen is (512) 245-3873 (512) 245-3873 Office for Dr. Xiao Chen located at CMAL 311A CMAL 311A Faculty Profile for Dr. Xiao Chen Faculty Profile Personal Website,Dr. Xiao Chen Show more about Dr. David Cheung Dr. David Cheung Lecturer Email Dr. David Cheung at d_c426@txstate.edu d_c426@txstate.edu The phone number for Dr. David Cheung is (512) 245-2288 (512) 245-2288 Office for Dr. David Cheung located at Avery 464F Avery 464F Faculty Profile ,Dr. David Cheung Show more about Ju Gao Dr. Byron Gao Associate Professor Email Dr. Byron Gao at bgao@txstate.edu bgao@txstate.edu The phone number for Dr. Byron Gao is (512) 245-0348 (512) 245-0348 Office for Dr. Byron Gao located at CMAL 311D CMAL 311D Faculty Profile for Dr. Byron Gao Faculty Profile Personal Website,Dr. Byron Gao Show more about Husain Gholoom Husain Gholoom Senior Lecturer Email Husain Gholoom at hag10@txstate.edu hag10@txstate.edu Office for Husain Gholoom located at Comal 301F Comal 301F Faculty Profile , Husain Gholoom Show more about Mina Guirguis Dr. Mina S Guirguis Professor Email Dr. Mina S Guirguis at msg@txstate.edu msg@txstate.edu The phone number for Dr. Mina S Guirguis is (512) 245-6384 (512) 245-6384 Office for Dr. Mina S Guirguis located at CMAL 311E CMAL 311E Faculty Profile for Dr. Mina S Guirguis Faculty Profile Personal Website,Dr. Mina S Guirguis Show more about Caneo Hwang Dr. C Hwang Professor Email Dr. C Hwang at cjhwang@txstate.edu cjhwang@txstate.edu The phone number for Dr. C Hwang is (512) 245-3407 (512) 245-3407 Office for Dr. C Hwang located at CMAL 301D CMAL 301D Faculty Profile for Dr. C Hwang Faculty Profile Show more about Dr. Tanzima Islam Dr. Tanzima Islam Associate Professor Email Dr. Tanzima Islam at tanzima@txstate.edu tanzima@txstate.edu Office for Dr. Tanzima Islam located at Comal 307A Comal 307A Faculty Profile ,Dr. Tanzima Islam Personal Website,Dr. Tanzima Islam Show more about Dr. I-Lung Kao Dr. I-Lung Kao Lecturer Email Dr. I-Lung Kao at cgc137@txstate.edu cgc137@txstate.edu The phone number for Dr. I-Lung Kao is Email Only Email Only Office for Dr. I-Lung Kao located at Avery 464F Avery 464F Faculty Profile ,Dr. I-Lung Kao Show more about Rick King Rick King Lecturer Email Rick King at charles.king@txstate.edu charles.king@txstate.edu The phone number for Rick King is (512) 245-3447 (512) 245-3447 Office for Rick King located at Comal 301A Comal 301A Faculty Profile , Rick King Show more about Dr. Randy Klepetko Dr. Randy Klepetko Assistant Professor of Practice Email Dr. Randy Klepetko at sox16@txstate.edu sox16@txstate.edu The phone number for Dr. Randy Klepetko is Email Only Email Only Office for Dr. Randy Klepetko located at Comal 307G Comal 307G Faculty Profile ,Dr. Randy Klepetko Show more about Lee-Song Koh Dr. Lee-Song Koh Senior Lecturer Email Dr. Lee-Song Koh at lk04@txstate.edu lk04@txstate.edu The phone number for Dr. Lee-Song Koh is (512) 245-7438 (512) 245-7438 Office for Dr. Lee-Song Koh located at CMAL 309A CMAL 309A Faculty Profile for Dr. Lee-Song Koh Faculty Profile Personal Website,Dr. Lee-Song Koh Show more about Dr. Oleg V Komogortsev Dr. Oleg V Komogortsev Regents' Professor, Denise M. Trauth Endowed Presidential Research Professor Email Dr. Oleg V Komogortsev at ok@txstate.edu ok@txstate.edu The phone number for Dr. Oleg V Komogortsev is (512) 245-0349 (512) 245-0349 Office for Dr. Oleg V Komogortsev located at Comal 309D Comal 309D Personal Website,Dr. Oleg V Komogortsev Faculty Profile ,Dr. Oleg V Komogortsev Show more about Gregory Lakomski Gregory Lakomski Lecturer Email Gregory Lakomski at greg@txstate.edu greg@txstate.edu The phone number for Gregory Lakomski is (512) 245-0347 (512) 245-0347 Office for Gregory Lakomski located at Comal 210B Comal 210B Faculty Profile , Gregory Lakomski Show more about Dr. Chul-Ho Lee Dr. Chul-Ho Lee Associate Professor Email Dr. Chul-Ho Lee at chulho.lee@txstate.edu chulho.lee@txstate.edu The phone number for Dr. Chul-Ho Lee is (512) 245-6580 (512) 245-6580 Office for Dr. Chul-Ho Lee located at Comal 311G Comal 311G Faculty Profile ,Dr. Chul-Ho Lee Personal Website,Dr. Chul-Ho Lee Show more about Dr. Ted Lehr Dr. Ted Lehr Associate Professor of Practice Email Dr. Ted Lehr at ted.lehr@txstate.edu ted.lehr@txstate.edu The phone number for Dr. Ted Lehr is 512.245.3666 512.245.3666 Office for Dr. Ted Lehr located at Comal 211 Comal 211 Faculty Profile ,Dr. Ted Lehr Show more about Hantang Li Hantang Li Assistant Professor of Instruction Email Hantang Li at hgv16@txstate.edu hgv16@txstate.edu The phone number for Hantang Li is 512.245.8036 512.245.8036 Office for Hantang Li located at Comal 210B Comal 210B Faculty Profile , Hantang Li Show more about Dr. Xiaomin Li Dr. Xiaomin Li Assistant Professor of Instruction Email Dr. Xiaomin Li at xminli@txstate.edu xminli@txstate.edu The phone number for Dr. Xiaomin Li is (512) 245-3430 (512) 245-3430 Office for Dr. Xiaomin Li located at Round Rock Campus - Avery 464A Round Rock Campus - Avery 464A Faculty Profile ,Dr. Xiaomin Li Show more about Mr. Mohandesi Manouchehr Mr. Mohandesi Manouchehr Assistant Professor of Instruction Email Mr. Mohandesi Manouchehr at tgo10@txstate.edu tgo10@txstate.edu The phone number for Mr. Mohandesi Manouchehr is (512) 716-4072 (512) 716-4072 Office for Mr. Mohandesi Manouchehr located at Round Rock Campus - Avery 464E Round Rock Campus - Avery 464E Faculty Profile ,Mr. Mohandesi Manouchehr Show more about Dr. Vangelis Metsis Dr. Vangelis Metsis Associate Professor Email Dr. Vangelis Metsis at v_m137@txstate.edu v_m137@txstate.edu The phone number for Dr. Vangelis Metsis is (512) 245-7509 (512) 245-7509 Office for Dr. Vangelis Metsis located at Comal 307F Comal 307F Personal Website,Dr. Vangelis Metsis Faculty P",
  "content_length": 16445,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:15"
}