{
  "name": "Vicente Moret-Bonillo",
  "homepage": "https://pdi.udc.es/en/File/Pdi/HV99E",
  "status": "success",
  "content": "Vicente Moret Bonillo File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Investigación y Desarrollo en Inteligencia Artificial Research lines INTELIGENCIA ARTIFICIAL INFORMATICA BIOMEDICA MONITORIZACION INTELIGENTE Keywords INTELIGENCIA ARTIFICIAL INFORMATICA BIOMEDICA MONITORIZACION INTELIGENTE Contacto UDC directory Orcid id0000-0002-9435-3151 ResearcherIDK-1049-2017 Scopus7004317776 VICENTE MORET BONILLO. (Valencia, 1962). Degree in Chemistry (B.Sc. Fundamental Chemistry, Major in Physical Chemistry, University of Santiago de Compostela, Spain, 1984). Doctor in Physics (Ph.D. Applied Physics, University of Santiago de Compostela, Spain, 1988). Post-Doctoral Research Fellow Biomedical Engineering Department (Medical College of Georgia, USA, 1988-1990). Senior Member IEEE (Biomedical Engineering, since 2006). Award of Merit for Significant Contribution in the Field of Clinical Engineering (Quest Publishing Eds, USA, 1990). Principal investigator of more than 30 projects funded on a competitive basis. Director 9 doctoral theses related to various aspects of Artificial Intelligence. Author of more than 145 scientific publications in international journals and congresses (JCR, Scopus, PubMed,…). Recognized specialist in Medical Applications of Artificial Intelligence, Intelligent Monitoring Medicine, Imprecise Reasoning Models in Medicine and Intelligent Systems Validation. Areas of current interest: Intelligent Monitoring of Sleep Apnea Syndrome and Quantum Computing. Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 1.5 Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 14 Introduction to Quantum Computing Master's Degree in Quantum Information Science and Technology Compulsory 0 10.5 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 14 Knowledge Representation and Reasoning Degree in Artificial Intelligence Compulsory 0 20 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 1.5 Quantum Computing Degree in Nanoscience and Nanotechnology Optional 0 29 Quantum Computing Architectures Master's Degree in Quantum Information Science and Technology Optional 0 8.5 Reasoning and Planning Master's Degree in Artificial Intelligence Compulsory 0 10.5 Rule-Based Quantum Systems Master's Degree in Quantum Information Science and Technology Optional 0 12.5 Subject and involved studies Type Distance hours Total hours Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 42 Knowledge and Reasoning under Uncertainty Master's Degree in Artificial Intelligence Optional 0 7 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 70 Master's Dissertation Master's in Complex Materials: Thermal Analysis and Rheology Compulsory 0 5 Reasoning and Planning Master's Degree in Artificial Intelligence Compulsory 0 10.5 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 8 Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 42 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Master's in Computer Engineering Compulsory 0 21 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 56 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 8 Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 36 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 21 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 42 Subject and involved studies Type Distance hours Total hours Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 42 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 20 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 56 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 12 Foundations of Artificial Intelligence Master in Bioinformatics for Health Sciences Optional 0 42 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 30 Knowledge Representation and Automatic Reasoning Degree in Computer Engineering Optional 0 56 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2016/2017 2015/2016 Benchmarking digital classic system, simulated quantic system and real quantic system Comparison of metrics between machine learning models and explainability of them for the early detection of MCI (Mild Cognitive Impairment) Development of a knowledge-based model for the staging of invasive ductal breast cancer Metodologic study of quatum representation of fuzzy knowledge Web application for quantum rule-based systems management Design of Polyurethanes using fuzzy logic Machine learning and quantum computing Quantum modeling of uncertainty in classical rule-based systems Computing learning for the detection of influential genes in pathologies. Breast Cancer Application Quantum teleportation Design, development, implementation and testing of a quantum simulator for Simon's algorithm Quantic Fourier transformation simulator Quantum computing applied to secure cryptographic key exchange Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2024 2022 2020 2019 2014 ... 2012 2011 2009 2008 2007 2006 2005 2004 2003 2001 1999 1997 1996 1995 1994 1993 1991 1990 1988 1985 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Eduardo Mosqueira Rey (IP1) / Diego Álvarez Estévez Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Consellería de Educación Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity FUNDACIÓN INSTITUTO TECNOLÓXICO DE GALICIA Main researches Vicente Moret-Bonillo, Eduardo Mosqueira-Rey Type Contrato Dates From 01/12/2022 to 31/12/2022 Funding entity Ministerio de Ciencia e Innovación Main researches Eduardo Mosqueira Rey, Elena Hernández Pereira Type Proyecto Programas Nacionales Dates From 01/06/2020 to 31/05/2023 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Ministerio de Economía y Competitividad Main researches Vicente Moret Bonillo Type Proyecto Programas Nacionales Dates From 01/01/2014 to 31/12/2016 Funding entity Xunta de Galicia Main researches Ricardo Cao Abad Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 31/12/2013 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2011 to 31/12/2013 Type Proyecto Otros Programas Dates From 01/01/2009 to 30/06/2010 Funding entity Consellería de Economía e Industria Main researches Vicente Moret Bonillo Type Proyecto Programas Autonomicos Dates From 02/12/2009 to 01/12/2012 Funding entity SIDECU GESTIÓN, S.A. Main researches Eduardo Mosqueira Rey Type Contrato Dates From 01/07/2009 to 30/06/2012 Funding entity Dirección Xeral de Investigación, Desenvolvemento e Innovación Type Proyecto Otros Programas Dates From 11/10/2008 to 10/10/2011 Type Proyecto Otros Programas Dates From 31/08/2007 to 15/11/2010 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2007 to 31/12/2010 Funding entity SIDECU GESTIÓN, S.A. Main researches Eduardo Mosqueira Rey Type Contrato Dates From 30/06/2006 to 30/06/2009 Funding entity MINISTERIO DE EDUCACIÓN Y CIENCIA Main researches Vicente Moret Bonillo Type Proyecto Otros Programas Dates From 31/12/2005 to 30/12/2008 Funding entity Xunta de Galicia Type Proyecto Otros Programas Dates From 09/08/2005 to 08/08/2008 Funding entity Xunta de Galicia Type Proyecto Otros Programas Dates From 09/08/2005 to 08/08/2008 Funding entity Xunta de Galicia Main researches Richard J. Duro Fernández Type Proyecto Programas Autonomicos Dates From 12/07/2005 to 11/07/2006 Funding entity Comisión Interministerial de Ciencia y Tecnología Type Proyecto Programas Nacionales Dates From 01/01/2005 to 31/12/2007 Funding entity Dirección Xeral de Investigación e Desenvolvemento Type Proyecto Otros Programas Dates From 04/06/2004 to 03/06/2007 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 24/10/2003 to 23/10/2006 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 20/07/2001 to 20/07/2004 Type Proyecto Otros Programas Dates From 28/12/2001 to 28/12/2004 Funding entity Fondo Europeo de Desarrollo Regional (FEDER) Type Proyecto UE Dates From 01/01/2001 to 31/12/2001 Funding entity Secre",
  "content_length": 40008,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:22"
}