{
  "name": "Victor de Boer",
  "homepage": "http://www.victordeboer.com",
  "status": "success",
  "content": "Victor de Boer | Semantic Web, Digital Humanities, Cultural AI and ICT for Development Skip to content 11/06/201619/11/2025 ~ Victor I am an Associate Professor (UHD) at the Vrije Universiteit Amsterdam (VU), where I co-lead the User-Centric Data Science group of the Computer Science department. I am also a co-director of the Cultural AI Lab. In my research, I combine (Semantic) Web technologies with Human-Computer Interaction, Knowledge Representation and Information Extraction to tackle research challenges in various domains. These include Cultural Heritage, Digital Humanities and ICT for Development (ICT4D). I am currently involved in the following research projects: HEDGE-IoT (2024-2027). HEDGE-IoT is a HorizonEurope project that proposes a novel Digital Framework which aims to deploy IoT assets at different levels of the energy system. We collaborate with TNO and Arnhems Buiten on IoT data conversion and enrichment; user-centric and explainable machine learning. Pressing Matter: Our role in this NWO project is about developing data models to support societal reconciliation with the colonial past and its afterlives. HAICu: In this NWO project we investigate perspective-aware AI to make digital heritage collections more accessible. Hybrid Intelligence: Augmenting Human Intellect. In this project, I am involved in various sub-projects: Knowledge acquisition methods for polyvocal knowledge graphs (w/ Shenghui Wang, UTwente) Knowledge Representation Formalisms for Hybrid Intelligence,(w/ Stefan Schlobach, VU) Knowledge Representation and Reasoning for Personal Agents, (w/ Birna van Riemsdijk, UTwente) How can AI support human moral judgements? (w/ prof. Ibo van der Poel, TUD) Mapping Missionaries is a Network Institute Academy Assistant project that seeks to improve access to information about Dutch missionaries in the former colonies. For other and older research projects, see the “research” tab. 26/11/202521/11/2025 ~ Victor ~ Leave a comment [This post is based on Yitong Tang‘s Master Information Science thesis, conducted in an internship project with 2CoolMonkeys B.V] In her master’s thesis, Yitong Tang presents the design, implementation, and evaluation of a hybrid information retrieval system that integrates structured filtering with LLMs to enhance partner matching within the B Corporations ecosystem. B Corporations are companies that have undergone verification to meet high standards of social and environmental performance, transparency, and accountability. As value-driven business networks continue to grow, organizations increasingly face the challenge of identifying suitable strategic partners within vast, unstructured datasets. This thesis introduces a partner-matching system built on a hybrid information retrieval framework. Following a Design Science Research methodology, she iteratively developed and refined the system across four prototypes. The final architecture combines the efficiency of a traditional search engine (Elasticsearch) for structured data filtering with the deep semantic capabilities of an advanced LLM used to interpret unstructured text, such as company descriptions and mission statements. Screenshot of the recommender system (see demonstration on youtube). To evaluate the system, she employed a mixed-methods approach that included quantitative performance metrics—precision, recall, and response time—as well as qualitative interviews with B Corp stakeholders. The findings show that the final hybrid model significantly outperforms baseline approaches, offering more accurate, contextually relevant, and well-reasoned recommendations. Its strengths are particularly evident in interpreting complex natural-language queries and incorporating geographical constraints. Overall, this research contributes a validated and transferable blueprint for developing intelligent partner-matching systems within private or domain-specific knowledge bases. It demonstrates that combining traditional search technologies with modern LLMs provides a powerful approach for transforming raw organizational data into meaningful and actionable partnership opportunities—an approach with broad potential for mission-driven and complex business networks. The thesis can be found below. A demonstration video can be found at https://www.youtube.com/watch?v=tcowqxA41p4 Master_IS_Research_Thesis__Yitong-TangDownload Share This: 21/11/2025 ~ Victor ~ Leave a comment [This post is based on Mohamad Fernanda‘s Master Information Science thesis] Cultural heritage event annotation often lacks diverse perspectives, resulting in incomplete or biased historical records. Master Information Science student Mohamad Fernanda’s research addresses that gap by examining how crowdsourcing can support polyvocality—bringing a broader range of viewpoints into the annotation process. His central research question is: How can annotations for cultural heritage events be sourced effectively and ethically to achieve polyvocality? To explore this, he conducted a study in which he: gathered qualitative survey responses from 22 participants across three groups with different cultural backgrounds: a) native Dutch individuals, b) native Indonesians, and c) people of Dutch-Indonesian heritage; investigated how Large Language Models can recognize and synthesize polyvocal data. The findings show that crowdsourcing can successfully capture multiple perspectives, resulting in a richer and more nuanced historical narrative. While LLMs offer promising support for analyzing such data, their use demands careful oversight and ethical consideration. Overall, this study demonstrates that a collaborative, ethically informed approach—combining crowdsourcing with LLM assistance—can help produce more balanced and representative accounts of cultural history. The figure below shows the results of the coding done by the LLM of choice (Gemini 2.0 Flash). It recognizes five themes in the participants responses on questions about the representation of colonialism in Dutch museums: Figure from Fernanda (2025) The thesis, including the exact surveys and prompts used can be found below Master-IS-Research-Thesis_Mohamad-FernandaDownload Share This: 30/06/2025 ~ Victor ~ Leave a comment Output of scientific projects come in many forms: papers, talks, posters, datasets etc. But one of the wonderful things about the Pressing Matter project is that one of the types of output is especially spectacular: an exhibition in Amsterdam’s Wereldmuseum. The exhibition “Unfinished Pasts” brings together the questions and results of our scientific research as well as the results of the provenance research into the various collections associated with the project. The amazing results of the Pressing Matter Artist in Residence project are also displayed, as are the discussions with the project’s so-called critial friends. Through these lenses, the exhibition looks at the question of restitution and repair: should museums return collections to their countries of origin? How did these colonial objects end up in their collections? And who do they actually belong to? The exhibition colofon A small part of the exhibition: the result of an Indonesian art collective Share This: 24/06/202510/06/2025 ~ Victor ~ Leave a comment [This post is based on Givannah Noor‘s Master Information Science Thesis] Dashboards are essential for data-driven decisions, but effective design, especially for smart building and energy management, is often overlooked. Givannah Noor’s thesis, “Brick by Brick: A Human-Centered Approach to Effective Dashboard Design for Smart Building and Energy Management,” tackles this gap head-on. At Arnhems Buiten, an IoT pilot site and part of the HEDGE-IoT project, a specialized dashboard was developed to monitor various devices. Givannah took a human-centered approach, conducting stakeholder interviews to uncover pain points and key needs. These insights informed the development of a high-fidelity prototype. To that end, she conducted several interviews with stakeholders, developed personas, scenarios and prototypes. The overview page in the hi-fi prototype The insights page in the hi-fi prototype The prototype was then evaluated with stakeholders using a think-aloud technique. The findings revealed that effective dashboard design goes beyond typical UI/UX principles, emphasizing the crucial role of storytelling and designing for predictive analytics. This research offers valuable insights for creating dashboards that truly meet the complex needs of smart building and energy management, and improve how we visualize future trends. All sources can be found on this Zenodo online appendix: https://zenodo.org/records/14678478 A live version of the hi-fi prototype can be found here: https://www.figma.com/proto/uDu4BT5JZGKBW8j8Ra90Mv/HiFi-Master-Thesis-UI-Design?page-id=0%3A1&node-id=2-519&node-type=frame&viewport=304%2C76%2C0.23&t=vY8dYMPQH9C05un2-1&scaling=contain&content-scaling=fixed&starting-point-node-id=2%3A519 Master_Thesis_Givannah_Noor_VU_compressedDownload Share This: 17/06/202510/06/2025 ~ Victor ~ Leave a comment [This post is based on Bella Abelardo‘s Master Information Science thesis, “Designing a User Interface for Provenance Reporting of Objects with Colonial Heritage”] Bella’s thesis addresses a critical challenge in cultural institutions: representing multiple perspectives for colonial heritage items. Current systems often create a “singular truth” in provenance reports, and unstructured data hinders discoverability. Bella’s goal was to create a user interface to help provenance researchers holistically document the “polyvocal knowledge” often present in colonial heritage objects. Her research intended to explore improvements to the popular TMS content management system. To this end, she conducted interviews with various domain experts to gather design requirements and built a prototype, CultureSource. two figures showing the lo-fi design of the improved user interface (imgs: ",
  "content_length": 19806,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:30"
}