{
  "name": "Victor B. Zordan",
  "homepage": "http://www.cs.ucr.edu/~vbz",
  "status": "success",
  "content": "Victor Zordan AboutDr. Victor Zordan is an (adjunct) research faculty in Visual Computing within the School of Computing at Clemson University. Victor also works full time as a Principle Research Scientist at Roblox. Victor works on developing techniques in graphics, fabrication, and animation with focii in physically based modeling, interfaces, and human animation. He has been an enthusiast and graphics programmer for 25 years and a researcher investigating animation techniques for more than twenty. His interests are in physical simulation, motion capture, and algorithms used to create believable (and unbelievable) motion and to explore novel uses for animation in electronic games, medical and training applications, and virtual worlds. Dr. Zordan received his PhD from Georgia Tech at GVU. Dr. Victor Zordan is former faculty in the department of Computer Science and Engineering at University of California Riverside where he directed the Riverside Graphics Lab. He also worked at Clemson as director for the DPA program until 2021 and chair for the division of Visual Computing until he left for Roblox in 2022. Select Research Projects Soft-body Locomotion Benchekroun, O., Xie, K., Liu, D., Grinspun, E., Andrews, S., Zordan, V. Actuators A La Mode: Modal Actuations for Soft Body Locomotion, ACM SIGGRAPH Asia 2024 Conference Papers 2024. PDF Bibtex Soft Booleans Liu, D., Agrawala, M., Yuksel, C., Omernick, T., Misra, V., Corazza, S., McGuire, M., Zordan, V., A Unified Differentiable Boolean Operator with Fuzzy Logic, ACM SIGGRAPH 2024 Conference Papers 2024. PDF Bibtex Character Control Xu, P., Xie,K., Andrews, S., Kry, P., Neff, M., McGuire, M., Karamouzas, I., Zordan, V., AdaptNet: Policy adaptation for physics-based character control, ACM SIGGRAPH Transactions on Graphics (TOG) 2023. PDF Movie Bibtex Xu, P., Shang, X., Zordan, V., Karamouzas, I., Composite motion learning with task control, ACM SIGGRAPH Transactions on Graphics (TOG) 2023. PDF Movie Bibtex Motor Babble Ranganath, A., Biswas, A., Karamouzas, I., Zordan, V., Motor Babble: Morphology-Driven Coordinated Control of Articulated Characters, ACM Siggraph Symposium on Motion, Interaction & Games (MIG) 2021 (BEST PAPER). PDF Movie Bibtex Dynamic Skinning Rohmer, D., Tarini, M., Kalyanasundaram, N., Moshfeghifar, F., Cani, M., Zordan, V., Velocity Skinning for Real-time Stylized Skeletal Animation, Computer Graphics Forum, 40: pp. 549-561, 2021. (BEST PAPER HONORABLE MENTION) PDF Movie Bibtex Demo Motion Capture Processing Schreiner, P. Perepichka, M., Lewis, H. Darkner, S., Kry, P., Erleben, K., Zordan, V., Global Position Prediction for Interactive Motion Capture, In ACM Siggraph Symposium on Computer Animation (SCA '21). Proceedings of the ACM on Computer Graphics and Interactive Techniques . PDF Movie Bibtex Virtual Hands Jörg, S., Ye, Y., Neff, M., Mueller, F., Zordan, V., Virtual hands in VR: motion capture, synthesis, and perception, In ACM SIGGRAPH 2020 Courses (SIGGRAPH '20). Association for Computing Machinery, New York, NY, USA, Article 16, pp. 1-145, 2020. PDF Bibtex Motor Skill Learning Ranganath, A., Xu, P., Karamouzas, I., Zordan, V., Low Dimensional Motor Skill Learning Using Coactivation, In Motion, Interaction and Games (MIG '19). Association for Computing Machinery, New York, NY, USA, Article 20, pp. 1-10, 2019. PDF Movie Bibtex Real-time Locomotion Bermudez, L., Tessendorf, J., Zimmermann, D., Zordan, V., Real-time locomotion with character-fluid interactions, In Proceedings of the 11th Annual International Conference on Motion, Interaction, and Games (MIG '18). Association for Computing Machinery, New York, NY, USA, Article 18, pp. 1-8, 2018. PDF Movie Bibtex Coupling Simulations Akbay, M., Nobles, N., Zordan, V., Shinar T., An Extended Partitioned Method for Conservative Solid-Fluid Coupling, SIGGRAPH 2018, ACM Trans. Graph., Vol. 37, No. 4, Article 86, 2018. PDF Movie Bibtex Digital Fabrication Moore, E. Porter, M., Karamouzas, I., Zordan, V., Precision control of tensile properties in fabric for computational fabrication, ACM SIGGRAPH Symposium on Computational Fabrication (SCF), 2018. PDF Bibtex MechVR: Physics in VR Zordan, V., Welter, J., Hindlekar, S. Smith, J.E., McKay, W.G., Lowe, K., Marti, C., Taylor, R., MechVR: a physical proxy for locomotion and interaction in a virtual environment, ACM SIGGRAPH Symposium on Motion in Games (MIG), 2017. (BEST PRESENTATION) PDF Movie Bibtex Rotation Control for Dynamic Simulation Zordan, V., Brown, D., Macchietto, A., Yin, K., Control for Rotational Dynamics for Ground and Aerial Behaviors, TVCG, 2014. PDF Movie Bibtex Brown, D., Macchietto, A., Yin, K., Zordan, V., Control of Rotational Dynamics for Ground Behaviors, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), 2013. (BEST PAPER) PDF Movie Bibtex Modal Control Nunes, R., Cavalcante-Neto, J., Vidal, C., Kry, P., Zordan, V., Using Natural Vibrations to Guide Control for Locomotion, ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games (I3D), 2012. PDF Movie Bibtex Momentum Control for Balance Macchietto, A., Zordan, V., Shelton, C.R., Momentum Control for Balance, Transactions on Graphics/ACM SIGGRAPH, 2009. PDF Movie Bibtex Anatomically Inspired Torso DiLorenzo, P., Zordan, V., Sanders, B., Laughing Out Loud: Control for Modeling Anatomically Inspired Laughter using Audio, Transactions on Graphics/ACM SIGGRAPH Asia, 2008. PDF Movie Bibtex Dynamic Response for Motion Capture Zordan, V., Majkowska, A., Chiu, B., Fast, M., Dynamic Response for Motion Capture Animation, ACM SIGGRAPH, 2005. PDF Movie Bibtex Zordan, V., Macchietto, A., Medina, J., Soriano, M., Wu, C.C., Interactive Dynamic Response for Games, ACM SIGGRAPH Sandbox Symposium, 2007. PDF Movie Bibtex arrow_upward Publications Copyright Notice: This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and all rights therein are retained by authors or by other copyright holders. All persons copying this information are expected to adhere to the terms and constraints invoked by each author's copyright. These works may not be reposted without explicit permission. Conferences public P. Boursin, Y. Kedadry, V. Zordan, P. Kry, M.P. Cani. ReGAIL: Toward Agile Character Control from a Single Reference Motion, ACM SIGGRAPH Conference on Motion, Interaction, and Games (MIG), 2024. PDF Bibtex public H. Shi, V. Zordan, Y. Yang, S. Andrews. Adaptive Distributed Simulation of Fluids and Rigid Bodies, ACM SIGGRAPH Conference on Motion, Interaction, and Games (MIG), 2024. PDF Bibtex public O. Benchekroun, K. Xie, D. Liu, E. Grinspun, S. Andrews, V. Zordan. Actuators A La Mode: Modal Actuations for Soft Body Locomotion, ACM SIGGRAPH Asia 2024 Conference Papers, 2024. PDF Bibtex public D. Liu, M. Agrawala, C. Yuksel, T. Omernick, V. Misra, S. Corazza, M. McGuire, V. Zordan. A Unified Differentiable Boolean Operator with Fuzzy Logic, ACM SIGGRAPH 2024 Conference Papers, 2024. PDF Bibtex public C. Lao, Y. Zhang, D. Vogel, C. Kaplan, M. McGuire, V. Zordan. A Preliminary Study of World Customizability for Virtual Reality Co-Play, ACM CHI Conference on Human Factors in Computing Systems Extended Abstract, 2023. PDF Bibtex public L. Dugan, A. Wadhawan, K. Spence, C. Callison-Burch, M. McGuire, V. Zordan. Learning When to Speak: Latency and Quality Trade-offs for Simultaneous Speech-to-Speech Translation with Offline Models, Interspeech, 2023. PDF Bibtex public I. Navarro, D. Kneubuehler, T. Verhulsdonck, E. Du Bois, W. Welch, C. Shang, I. Sachs, M. Mcguire, V. Zordan, K. Bhat. Audiovisual Inputs for Learning Robust, Real-time Facial Animation with Lip Sync, ACM SIGGRAPH Conference on Motion, Interaction, and Games (MIG), 2023. PDF Bibtex public N. Kalyanasundaram, D. Rohmer, V. Zordan. Acceleration Skinning: Kinematics-Driven Cartoon Effects for Articulated Characters, Graphics Interface, 2022. (BEST PAPER) PDF Bibtex public A. Sati, I. Karamouzas, V. Zordan, DIGISEW: Anisotropic Stitching for Variable Stretch in Textiles, ACM Siggraph Symposium on Computational Fabrication (SCF), 2021. PDF Bibtex public A. Ranganath, A. Biswas, I. Karamouzas, V. Zordan, Motor Babble: Morphology-Driven Coordinated Control of Articulated Characters, ACM Siggraph Symposium on Motion, Interaction & Games (MIG) (BEST PAPER), 2021. PDF Bibtex public Nche, O. M., Boulware, R., Che, S. M., Kraemer, E. T., Sitaraman, M., Zordan, V., Basic Code Understanding Challenges for Elementary School Children, 2020 Research on Equity and Sustained Participation in Engineering, Computing, and Technology (RESPECT), pp. 1-2, 2020. PDF Bibtex public Ranganath, A., Xu, P., Karamouzas, I., Zordan, V., Low Dimensional Motor Skill Learning Using Coactivation, In Motion, Interaction and Games (MIG '19), Association for Computing Machinery, New York, NY, USA, Article 20, pp. 1-10, 2019. PDF Movie Bibtex public Nche, O. M., Welter, J., Che, M., Kraemer, E. T., Sitaraman, M., Zordan, V., CodeTracesure-Combining Gaming, CS Concepts, and Pedagogy, 2019 Research on Equity and Sustained Participation in Engineering, Computing, and Technology (RESPECT), pp. 1-2, 2019. PDF Bibtex public Bermudez, L., Borisko, S., Mcaninch, E., Smith, C., Kuksenok, O., Zordan, V., Simulated fatigue and wrinkle synthesis for clothing appearance design, 2019 (Technical Brief). PDF Bibtex public Nche, O. M., Colbert-Bucsh, E., Sitaraman, M., Zordan, V., Presenting CS Concepts through Multiple Representations to Engage African-American Elementary School Children, In CoNECD. ASEE, 2019. PDF Bibtex public Bermudez, L., Tessendorf, J., Zimmermann, D., Zordan, V., Real-time locomotion with character-fluid interactions, In Proceedings of the 11th Annual International Conference on Motion, Interaction, and Games (MIG '18). Association for Computing Machinery, New York, NY, USA, Article 18, pp. 1-8, 2018. PDF Movie Bibtex public Moore, E., Porter, M., Karamouzas, I., Zordan, V., Precision control of tensilie properties ",
  "content_length": 24618,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:24"
}