{
  "name": "Victoria Kostina",
  "homepage": "http://vkostina.caltech.edu",
  "status": "success",
  "content": "Victoria Kostina Home Victoria Kostina About Me My work operates at the intersection of information theory, communications, control, and learning — particularly in regimes where classical asymptotic analysis fails to capture the demands of modern systems. I am especially focused on delay‑sensitive, finite‑blocklength, and feedback‑driven operational scenarios.Communications: I study non‑asymptotic fundamental limits for sources, channels, and networks, including variable-length and feedback codes, multiple-access and random-access channels, and systems with cost or delay constraints. Since bitrate limitations are often interpreted as proxies for energy or computational complexity constraints, my work provides a unified perspective on efficiency in resource-constrained systems.Control and Dynamical Systems: I investigate how information constraints — such as limited bits, intermittent feedback, or packet drops — affect stabilization, tracking, estimation, and control performance. A central goal is quantifying exactly how much information or feedback is needed to meet a control or estimation objective, and how these limits relate to energy and computational efficiency.Learning and Inference: I examine how constraints on information, energy, or communication shape learning efficiency, convergence, and robustness in both centralized and distributed settings. This includes understanding learning under limited, delayed, or noisy feedback, and designing algorithms that are both statistically effective and resource-efficient.Broadly, I am interested in how the classic paradigms of Shannon theory and control must be extended or reinterpreted to meet the demands of emerging systems. This includes ultra-low-latency connectivity (Internet of Things), distributed sensing and control, real-time decision-making, and learning in resource-constrained environments. My work aims to provide fundamental insight and practical guidance for systems where communication, control, and learning are tightly coupled under stringent constraints. By developing tight non-asymptotic bounds and designing practically meaningful coding, estimation, control, and learning schemes, I aim to inform the design of next-generation, resource-efficient systems.Currently, I am a Professor of Electrical Engineering and Computing and Mathematical Sciences at Caltech. Prior to joining Caltech in the fall of 2014, I had received a Bachelor's degree from Moscow Institute of Physics and Technology, a Master's degree from University of Ottawa, and a PhD degree from Princeton University.",
  "content_length": 2579,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:29"
}