{
  "name": "Victor Fay Wolfe",
  "homepage": "https://web.uri.edu/cs/meet/victor-fay-wolfe",
  "status": "success",
  "content": "Victor Fay-Wolfe – Department of Computer Science and Statistics Skip to content Professor Computer Science Email: vfaywolfe@uri.edu Office Location: Tyler 258 Research Real-time systems, distributed systems, real-time data distribution, real-time sensor networks, real-time middleware, quality of service, real-time databases, semantic concurrency control, object-oriented programming. Computer and Digital Forensics Real-Time Distributed Object Computing Sensor Networks Education 1991 Ph.D. University of Pennsylvania Philadelphia, Pennsylvania Computer and Information Science 1983 B.S.E. Tufts University Medford, Massachusetts Electrical Engineering Selected Publications Lisa, DiPippo, Fay-Wolfe, Victor, et. al. “Real-Time CORBA”. Transactions on Parallel and Distributed Systems. October, 2000. DiPippo, Lisa, Fay-Wolfe, Victor, Squadrito, Michael, et. al.. “The Affected Set Priority Ceiling Protocols for Concurrency Control in Real-Time Object-Oriented Systems”. The International Journal of Computer Systems Science and Engineering. July, 1999. Fay-Wolfe, Victor, Fortier, Paul, Prichard, JJ. “RTSQL: Extending the SQL Standard to Support Real-time Databases”. Computer Standards and Interfaces. January, 1997. DiPippo, Lisa, Fay-Wolfe, Victor. “Expressing and Enforcing Timing Constraints in a Dynamic Real-Time CORBA System”. IEEE Transactions on Knowledge and Data Engineering. Jan – Feb, 1997. DiPippo, Lisa, Fay-Wolfe, Victor. “Object-Based Semantic Real-Time Concurrency Control with Bounded Imprecision”. IEEE Transactions on Knowledge and Data Engineering. Jan – Feb, 1997. Fay-Wolfe, Victor, Thurasingham, Bhavani, et. al. “Real-Time Object-Oriented Systems for Military Command and Control”. IEEE Computer. February, 2000. Selected Grants and Funding “Real-Time Data Distribution in Asynchronous Network Communications (Real-Time Data DANCE)” for $600,000 from National Science Foundation, 9/1/04 – 8/30/07. Lisa DiPippo and Timothy Henry. “Capacity Building: Computer and Network Forensics” for $300,000 from National Science Foundation, 7/1/04 – 6/30/07. “Real-Time Object-Oriented Databases for Distributed Environments” for $505,000 from Office of Naval Research, 2/1/96 – 9/30/99. Lisa DiPippo. “VbN Backbone High-Speed Internet Connection” for $350,000 from National Science Foundation, 1998 – 2001. Paul Gandel and others. “Distributed Real-Time Collaborative Services” for $200,000 from Office of Naval Research, 10/1/99 – 9/30/02. Lisa DiPippo. “Distributed Real-Time Combat Systems” for $300,000 from Office of Naval Research, 10/1/98 – 9/30/01. Lisa DiPippo. “Distributed Real-Time Data Replication in C2 and Combat Systems” for $950,000 from Office of Naval Research, 10/1/02 – 9/30/05. Lisa DiPippo. “Providing End-to-End Predictability through Prioritized Network Traffic” for $155,000 from Office of Naval Research, 10/1/02 – 9/30/05. Lisa DiPippo. “Distributed Scheduling Aspects for Time-Critical Targeting” for $482,562 from Defense Advanced Research Projects Agency, 10/1/02 – 9/30/04. C. Gill (Washington University), L. Welch (Ohio University), D. Niehaus (University of Kansas). Previous Teaching Positions 1991 - Present Professor University of Rhode Island Department of Computer Science and Statistics Kingston, Rhode Island Other Experience 1998 - 2001 Chief Technical Officer WebMachines, Inc. North Kingstown, Rhode Island 1995 - Present President Real-Time Research West Kingston, Rhode Island 1983 - 1986 Computational Design Engineer General Electric, Inc. Philadelphia, Pennsylvania Founder and Director URI Digital Forensics Program Kingston, Rhode Island Co-Lead Distributed Real-Time Research Lab Kingston, Rhode Island Awards Graduated Magna Cum Laude URI Golden Key Teaching Award Finalist URI Staff Excellence URI Honors Faculty, 1997 - Present Course Information CSC101 - Computing Concepts CSC486 - Network Forensics CSC499 - Project in Computer Science CSC586 - Topics in Network Forensics ConnectApplyTourGive",
  "content_length": 3974,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:21"
}