{
  "name": "Victor W. Zue",
  "homepage": "https://www.csail.mit.edu/user/1522",
  "status": "success",
  "content": "Victor Zue | MIT CSAIL Skip to main content PI Core/Dual Victor Zue Professor- Post Tenure Email zue@csail.mit.edu Phone 253-8513 Victor Zue is the Delta Electronics Professor of Electrical Engineering and Computer Science at MIT. In the early part of his career, Victor conducted research in acoustic phonetics and phonology, codifying the acoustic manifestation of speech sounds in American English. Subsequently, his research interest shifted to the development of spoken language interfaces to make human-computer interactions easier and more natural. Between 1989 and 2001, he headed the Spoken Language Systems Group at the MIT Laboratory for Computer Science, which has pioneered the development of many systems that enable a user to interact with computers using spoken language. After a ten-year tenure serving as Director of the Lab for Computer Science (LCS), and the Co-Director and Director of the Computer Science and Artificial Intelligence Lab (CSAIL), Victor had returned to teaching and research in 2011. His main responsibilities are to manage CSAIL's relationships with sponsors in Taiwan. Victor is a Fellow of the Acoustical Society of America, a Fellow of the International Speech Communication Association, and a Fellow of the American Association fr the Advancement of Science. He is also a member of the U.S. National Academy of Engineering, and an Academician of the Academia Sinica in Taiwan. He received the Okawa Prize in 2012, and the IEEE James L. Flanagan Speech and Audio Processing Award in 2013. Related Links Website Last updated Nov 26 '24 Research Areas AI & ML Human-Computer Interaction Impact Areas Education Health Care Related Links Website Groups Research Group Spoken Language Systems Group Our goal is to create technology that makes it possible for everyone in the world to interact with with computers via natural spoken language. +3 Jim Glass Leads Jim Glass Research Areas AI & ML Human-Computer Interaction Impact Areas Big Data Education Entertainment Health Care Internet of Things Lead Jim Glass +3 Jim Glass",
  "content_length": 2063,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:29"
}