{
  "name": "Victor Carneiro",
  "homepage": "https://pdi.udc.es/en/File/Pdi/H299E",
  "status": "success",
  "content": "Víctor Manuel Carneiro Díaz File. Department Computer Science and Information Technologies Knowledgment area Telecommunications Software Engineering Research Research group Telemática Research lines Sistemas Recomendadores. Recuperación de Información. Big Data. Monitorización y seguridad en Redes. Keywords Early detection. Collaborative Filtering, Machine Learning. Cibersecurity. Contacto UDC directory Orcid id0000-0002-7536-9422 ResearcherIDC-7016-2015 Scopus6602131429 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Computing as a Service Master's in Computer Engineering Compulsory 0 13 Cybersecurity Business and Entrepreneurship Master in Cibersecurity Compulsory 0 20 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 1.5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 2.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8.5 Infrastructure Management Degree in Computer Engineering Compulsory 0 109.5 Master`s Dissertation Master in Cibersecurity Compulsory 0 30 Master's Dissertation Master's in Computer Engineering Compulsory 0 4 Subject and involved studies Type Distance hours Total hours Computing as a Service Master's in Computer Engineering Compulsory 0 13 Cybersecurity Business and Entrepreneurship Master in Cibersecurity Compulsory 0 20 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 9.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2.5 Infrastructure Management Degree in Computer Engineering Compulsory 0 93.5 Master's Dissertation Master's in Computer Engineering Compulsory 0 4.5 Subject and involved studies Type Distance hours Total hours Computing as a Service Master's in Computer Engineering Compulsory 0 13 Cybersecurity Business and Entrepreneurship Master in Cibersecurity Compulsory 0 30 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 32 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 3 Infrastructure Management Degree in Computer Engineering Compulsory 0 82.5 Master's Dissertation Master's in Computer Engineering Compulsory 0 3.5 Master's Dissertation Master in Cibersecurity Compulsory 0 2.5 Subject and involved studies Type Distance hours Total hours Computing as a Service Master's in Computer Engineering Compulsory 0 13 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 8 Infrastructure Management Degree in Computer Engineering Compulsory 0 88 Master's Dissertation Master's in Computer Engineering Compulsory 0 10 Security Business Master in Cibersecurity Compulsory 0 21 Subject and involved studies Type Distance hours Total hours Computing as a Service Master's in Computer Engineering Compulsory 0 13 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 28 Infrastructure Management Degree in Computer Engineering Compulsory 0 95 Security Business Master in Cibersecurity Compulsory 0 21 Subject and involved studies Type Distance hours Total hours Computing as a Service Master's in Computer Engineering Compulsory 0 13 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 16 Infrastructure Management Degree in Computer Engineering Compulsory 0 85.5 Security Business Master in Cibersecurity Compulsory 0 21 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Monday 13:30 a 16:30 Despacho 1.03 1st quarter Wednesday 14:30 a 17:30 Despacho 1.03 2nd quarter Tuesday 15:30 a 18:30 Despacho 1.03 2nd quarter Thursday 17:00 a 20:00 Despacho 1.03 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2017/2018 2016/2017 2014/2015 Container monitoring with Zabbix and Prometheus Detection and Classification of Cyberattacks Using Machine Learning Techniques Development of a social web application destined the organization of sports matches Development of a financial expense control application Methodology for the implementation of the ANSI/TIA-942 standard in Data Centers using asset management tools Security in MQTT-based IoT networks: secure channel mechanisms Security in wireless networks through software-defined networks (SDN) Automated Defined OpenDaylight Software-Defined Networking Environment analysis intended for deployment, traffic simulation and manipulation of Software Defined Network (SDN) Risk analysis of connection to public networks. Traffic analiysis in Software Defined Networks (SDN) using Deep Learning techniques Applicationdevelopment to detect anomalous flows in software-definednetworks Tools for the generation of traffic oriented to the detection of anomalies Generation of a Dataset based on CoAP traffic in a IoT environment Machine learning techniques for network trafic management Machine learning techniques for optimizing characteristics of a data network Misogynist and xenophobic language detection in social networks through machine learning Distributed architecture to generate a semisynthetic DATASET of IoT traffic Implementation of an Information Security Management System in a Secondary School, following the UNE-ISO/IEC 27001 standard Implementation of a recommendation algorithm k-Nearest Neighbors (kNN) on Spark OpenStack's Heat orchestration templates graphic editor Virtual laboratory using docker containers Cloud Platform for building virtual laboratories Cloud Platform for building virtual laboratories Implementation and implantation of a recommender algorithm over Spark Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books PhD theses directed Conference papers 2024 2023 2022 2021 2020 ... 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2001 1999 1997 1996 Funding entity INCIBE - Instituto Nacional de Ciberseguridade Main researches Francisco Javier Nóvoa de Manuel / Daniel Garabato Míguez Type Proyecto Programas Nacionales Dates From 01/01/2024 to 31/12/2025 Funding entity AEI, Agencia Estatal de Investigación Main researches Cacheda Seijo, Fidel (IP1) / Carneiro Díaz, Víctor Manuel (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Consellería de Educación, Ciencia, Universidades e Formación Profesional Main researches Fidel Cacheda Seijo Type Proyecto Programas Autonomicos Dates From 01/01/2024 to 20/11/2026 Funding entity Consellería de Educación, Ciencia, Universidades e Formación Profesional Main researches F. Cacheda-Seijo Type Proyecto Programas Autonomicos Dates From 01/01/2024 to 31/12/2026 Funding entity Xunta de Galicia (Consellería de Política Social e Xuventude) Main researches Javier Andrade Garda y Víctor Manuel Carneiro Díaz Type Proyecto Programas Autonomicos Dates From 01/12/2023 to 30/09/2024 Funding entity Ministerio de Ciencia e Innovación Main researches Francisco Javier Nóvoa Manuel (IP1) / José Carlos Dafonte Vázquez (IP2) Type Proyecto Programas Nacionales Dates From 01/12/2022 to 29/09/2025 Funding entity financiado por la Comisión Europea en el marco del Call HORIZON-CL3-2021-FCT-01-08 Main researches Arianna Traviglia Type Proyecto UE Dates From 01/09/2022 to 31/12/2025 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Manuel Carneiro Díaz Type Contrato Dates From 15/04/2021 to 01/11/2021 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Carneiro Díaz Type Contrato Dates From 01/11/2021 to 28/02/2022 Funding entity AUTORIDAD PORTUARIA DE A CORUÑA Main researches Víctor Manuel Carneiro Díaz y Javier Andrade Garda Type Contrato Dates From 02/03/2020 to 01/03/2021 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Carneiro Díaz Type Contrato Dates From 20/04/2020 to 30/09/2020 Funding entity Ministerio de Ciencia e Innovación Main researches V. Carneiro, F. Cacheda Type Proyecto Programas Nacionales Dates From 01/06/2020 to 31/05/2023 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Carneiro Díaz Type Contrato Dates From 15/06/2020 to 15/03/2021 Funding entity AYUNTAMIENTO DE A CORUÑA Main researches Víctor Manuel Carneiro Diaz Type Contrato Dates From 01/02/2020 to 31/07/2020 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Carneiro Díaz Type Contrato Dates From 01/09/2020 to 31/12/2020 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Carneiro Díaz Type Contrato Dates From 01/08/2020 to 30/04/2021 Funding entity AUTORIDAD PORTUARIA DE A CORUÑA Main researches Víctor Manuel Carneiro Díaz y Javier Andrade Garda Type Contrato Dates From 07/12/2020 to 06/12/2021 Funding entity AT Sistemas - Aplicaciones y Tratamientos de Sistemas S.A. Main researches Jose Carlos Dafonte Vázquez y Víctor Carneiro Díaz Type Contrato Dates From 01/01/2019 to 30/06/2019 Funding entity Aplicaciones y Tratamientos de Sistemas S.A. (ATSistemas) Main researches José Carlos Dafonte Vázquez y Víctor Manuel Carneiro Díaz Type Contrato Dates From 01/04/2018 to 30/09/2018 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Manuel González Penedo Type Proyecto Programas Nacionales Dates From 01/01/2018 to 31/12/2019 Funding entity AUTORIDAD PORTUARIA DE A CORUÑA Ma",
  "content_length": 37162,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:25"
}