{
  "name": "Victoria G. Crawford",
  "homepage": "https://people.tamu.edu/~vcrawford",
  "status": "success",
  "content": "Victoria G. Crawford Victoria G. Crawford I am an Assistant Professor in the Computer Science & Engineering Department at Texas A&M University. I started as an Assistant Professor in the Fall of 2022. Before that, I received my PhD in Computer Engineering, my MS in Mathematics, and my BS in Mathematics all from the University of Florida. My research interests include scalable algorithms for large data sets, theoretical data mining, combinatorial optimization problems that arise in machine learning, approximation algorithms, and submodular optimization. Contact me at vcrawford@tamu.edu Download my CV I am an Assistant Professor in the Computer Science & Engineering Department at Texas A&M University. I started as an Assistant Professor in the Fall of 2022. Before that, I received my PhD in Computer Engineering, my MS in Mathematics, and my BS in Mathematics all from the University of Florida. My research interests include scalable algorithms for large data sets, theoretical data mining, combinatorial optimization problems that arise in machine learning, approximation algorithms, and submodular optimization. Contact me at vcrawford@tamu.edu Download my CV Publications Wenjing Chen, Shuo Xing, Samson Zhou, Victoria G. Crawford. Fair Submodular Cover. International Conference on Learning Representation (ICLR), 2025. Wenjing Chen, Victoria G. Crawford. Linear Submodular Maximization with Bandit Feedback. International Conference on Artifical Intelligence and Statistics (AISTATS), 2025. Wenjing Chen, Shuo Xing, Victoria G. Crawford. A Threshold Greedy Algorithm for Noisy Submodular Maximization. arXiv, 2023. Wenjing Chen, Victoria G. Crawford. Bicriteria Approximation Algorithms for the Submodular Cover Problem. Advances in Neural Information Processing Systems (NeurIPS), 2023. Victoria G. Crawford. Scalable Bicriteria Algorithms for Non-Monotone Submodular Cover. International Conference on Artificial Intelligence and Statistics (AISTATS), 2023. Oral presentation (top 1.9% of submissions). Victoria G. Crawford. Faster Guarantees of Evolutionary Algorithms for Maximization of Monotone Submodular Functions. International Joint Conference on Artifical Intelligence (IJCAI), 2021. Victoria G. Crawford. An Efficient Evolutionary Algorithm for Minimum Cost Submodular Cover. International Joint Conference on Artifical Intelligence (IJCAI), 2019. Victoria G. Crawford, Alan Kuhnle, My T. Thai. Submodular Cost Submodular Cover with an Approximate Oracle. International Conference on Machine Learning (ICML), 2019. Alan Kuhnle, Victoria G. Crawford, My T. Thai. Scalable Approximations to k-Cycle Transversal Problems on Dynamic Networks. Knowledge and Information Systems (KAIS). Springer 2018. Victoria G. Crawford*, Alan Kuhnle*, Christina Boucher, Rayan Chikhi, Travis Gagie. Practical Dynamic De Bruijn Graphs. Bioinformatics, 2018. *These authors contributed equally to this work. Alan Kuhnle, Victoria G. Crawford, My T. Thai. Network Resilience and the Length-Bounded Multicut Problem: Reaching the Dynamic Billion-Scale with Guarantees. Journal Proc. ACM Meas. Anal. Comput. Syst., , 2018. Alan Kuhnle, J. David Smith, Victoria G. Crawford, My T. Thai. Fast Maximization of Non-submodular, Monotonic Functions on the Integer Lattice. International Conference on Machine Learning (ICML), 2018. Victoria G. Crawford, Alan Kuhnle, Md Abdul Alim, My T. Thai. Space-Efficient and Dynamic Caching for D2D Networks of Heterogeneous Users. IEEE International Conference on Mobile Adhoc and Sensor Systems (MASS), 2018. Alan Kuhnle, Victoria G. Crawford, My T. Thai. Network Resilience and the Length-Bounded Multicut Problem: Reaching the Dynamic Billion-Scale with Guarantees. International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), ACM 2018. Alan Kuhnle, Victoria G. Crawford, My T. Thai. Scalable and Adaptive Algorithms for the Triangle Interdiction Problem on Billion-Scale Networks. International Conference on Data Mining (ICDM), IEEE 2017 (Invited to KAIS Journal Special Issue: ICDM Best Papers) A. Kuhnle, T. Pan, Victoria G. Crawford, M. A. Alim, and My T. Thai. Pseudo-Separation for Assessment of Structural Vulnerability of a Network. ACM SIGMETRICS, Extended abstract, 2017.",
  "content_length": 4248,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:28"
}