{
  "name": "Victor S. Frost",
  "homepage": "http://www.ittc.ku.edu/~frost",
  "status": "success",
  "content": "The Home Page of Professor Victor S. Frost. Victor S. Frost Dan F. Servey Distinguished Professor Electrical Engineering & Computer Science Room 2054: Eaton Hall The University of Kansas Lawrence, Kansas 66045 phone: (785) 864-1028 e-mail vsfrost@ku.edu Best way to contact me is by e-mail (vsfrost@ku.edu). Classes EECS 562 - Introduction to Communications Systems EECS 861 - Random Signals and Noise EECS 863 - Network Analysis, Simulation, and Measurements EECS 563 - Introduction to Communication Networks EECS 361 - Signals and Systems EECS 864 - Multiwavelength Optical Networks EECS 802 - EECS Colloquium and Seminar on Professional Issues EECS 766 Resource Sharing for Broadband Access Networks Homework Format Resume of Victor S. Frost Resume Highlights 2024 - KU EECS Distinguished Service (KEDS) Award Teaching the Basic Concepts of Communications Systems Using Interactive Graphics and Calculations, V. S. Frost, Best Paper Award at 2021 ASEE Midwest Section Conference 1998 - Fellow IEEE 1997- Present; Dan F. Servey Distinguished Professor EECS, University of Kansas 2014- 2019; Chair EECS, University of Kansas 1984 - National Science Foundation Presidential Young Investigator Award 2014 Louise Byrd Graduate Educator Award (The award honors KU faculty members who have demonstrated extraordinary devotion to graduate students and graduate education and who have distinguished themselves as scholars.) 2012 - H.O.P.E. Award Finalist (Honor for an Outstanding Progressive Educator -- recognizes outstanding teaching and concern for students and is the only honor for teaching excellence given exclusively by seniors on the KU Lawrence campus through a ballot-and-interview process.) Feb 2009 – Feb 2011; Program Director at the National Science Foundation in CISE/CNS 2011-2014; Associate Chair for Graduate Studies EECS, University of Kansas 2000 - 2008; Director, Information and Telecommunications Technology Center, ITTC was one of the largest research centers at the University of Kansas, with approximately 150 faculty, staff, and students, and external expenditures averaging $5.4 Million/year from FY1998-FY2007. (Acting Director, 1997 - 1999) 1987 – 1996; Director, Telecommunications and Information Sciences Laboratory (TISL), University of Kansas 2008 – 2011; Elected to the IEEE Communications Society Board of Governors as a Member at Large Spring 2007 Visiting Erskine Fellow University of Canterbury, Christchurch, New Zealand July – Dec. 1981; Visiting Scientist at the German Aerospace Research Establishment (DFVLR) Institute for High Frequency, Oberpfaffenhofen, West Germany. Research Interests: Communication Systems and Networks; Network Analysis, Measurement and Simulation Publications ebook: Introduction to Communications Systems: An Interactive Approach Using the Wolfram Language, Version 6 by Victor S. Frost Google Scholar Page Past Research Projects Covert Communications Networking-Exploiting Adaptive Protocols in Packet-Based Broadband Wireless Networks SensorNet Quantifying the Temporal Characteristics of Congestion Events in the Internet PRISM (Polar Radar for Ice Sheet Measurements) Experiences with 4 Modem Multi-Link Iridium Satellite Data Communication System-2003 Experiences with 8 Modem Multi-Link Iridium Satellite Data Communication System-2004 TCP Performance over Multilink PPP in Wireless Networks: Theory and Field Experiences Rapidly Deployable Radio Networks ACTS ATM Internetwork MAGIC Gigabit Network ENABLE Former PhD. Students 1 Petr, David University of Kansas 2 Wang, Quinglin Prodea Systems 3 LaRue, William Cadence Design Systems 4 Bush, Stephen GE Research 5 Oliva, Steve Retired 6 Beard, Cory University of Missouri, Kansas City 7 Lazarou, Georgious Lockheed Martin 8 Nyirenda-Jere, Towela New Partnership for Africa’s Development 9 Mao, XueJun unknown 10 Alanqar, Wesam Consultant/Entrepreneur 11 Bali, Soshant Meta 12 Fokum, Daniel University of the West Indies 13 Kuehnahausen, Martin Balance Innovations 14 Hijaz, Zaid Ericsson 15 Modarresi, Amir California State University, Northridge. 16 Nguyen, Truc Anh unknown 17 Shabsigh, Shaith Qualcomm List of Former MS Students and Research Topics Hand-book on STATISTICAL DISTRIBUTIONS for experimentalists Table of Integrals, Series, and Products I.S. Gradshteyn and I.M. Ryzhik Seventh Edition, Academic Press, 2007 Advice on Research and Writing How to Grade a Dissertation Hello World Video",
  "content_length": 4423,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:25"
}