{
  "name": "Victor Y. Pan",
  "homepage": "http://comet.lehman.cuny.edu/vpan",
  "status": "success",
  "content": "Victor Y. Pan - Lehman College CUNY Dr. Victor Pan, an internationally recognized leader in the field of computer science research, has been appointed to the rank of Distinguished Professor at Lehman College, where he has taught since 1988. The appointment, which becomes effective September 1, 2000, was approved at a meeting on June 26 of The City University of New York Board of Trustees. Dr. Pan becomes the fifth member of the current Lehman faculty to achieve this rank, which is reserved for a very small group of highly influential scholars and artists. In congratulating Dr. Pan on this honor, Dr. Ricardo R. Fernandez, president of Lehman College, noted that 28 renowned scientists from around the world had written letters to the Trustees in support of his appointment. \"Time and again over the course of his career, Dr. Pan's original thinking has led to significant breakthroughs in theoretical computer science and numerical analysis. We are very pleased to see him achieve this special recognition.\" Dr. Pan emigrated to the U.S. in the late 1970s from the former Soviet Union. He earned his Ph.D. at Moscow University, where he also began his research, which he then continued in a Research Institute of the Soviet Academy of Science. During that time, he published a number of significant papers and became known informally as \"polynomial Pan\" for his pioneering work in the area of polynomial computations. Since then, his research has been supported for over 20 years by the National Science Foundation and has resulted in the publication of three books and over 200 research papers in leading computer science and applied mathematics journals, as well as in the refereed proceedings of the most respected and competitive conferences in these fields. He is regularly asked to lecture all over the world - most recently in Italy, Greece, Bulgaria, France, Germany, Canada, China, India, the Czech Republic, and Russia. In his research, Dr. Pan focuses on numerical and algebraic algorithms, which are the backbone of present-day computations in the sciences, engineering and communications. One of his major efforts involves devising effective new computational methods that combine the techniques of faster numerical computations with bounded precision and slower algebraic techniques for error-free symbolic computing. He has been responsible for several major breakthroughs, including new algorithms that greatly shortened the time needed to perform some fundamental computer computations. Research Vita CUNYGraduate CenterSeminar Ph.D. Defenses Lehman CollegeMathematicsandComputer Science",
  "content_length": 2611,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:27"
}