{
  "name": "Vidya Muthukumar",
  "homepage": "https://vmuthukumar.ece.gatech.edu",
  "status": "success",
  "content": "Vidya Muthukumar | Assistant Professor, Schools of ECE and ISyE, Georgia Tech Skip to primary navigation Skip to content Skip to primary sidebarI am the Harold R. and Mary Anne Nash Early Career Professor and Assistant Professor in the School of Electrical and Computer Engineering and H. Milton Stewart School of Industrial and Systems Engineering at Georgia Institute of Technology. I received the B.Tech (with honors) degree from the Indian Institute of Technology, Madras and the Ph.D. degree in Electrical Engineering from University of California, Berkeley. Before joining Georgia Tech, I spent a semester at the Simons Institute for the Theory of Computing as a research fellow for the program “Theory of Reinforcement Learning.” My broad interests are in game theory, online and statistical learning. I am particularly interested in designing learning algorithms that provably adapt in strategic environments, fundamental properties of overparameterized models, and the foundations of multi-agent decision-making. In my spare time, I enjoy singing Carnatic vocal music, playing the piano, and long-distance cycling. See here for a more formal bio in the third person. Recent News October 2025: Our faster rates for generic and adversarially robust optimization methods, achieved through an online learning/game approach and led by Guanghui Wang, are published in Mathematical Programming Series B (special issue on Optimization for Machine Learning). Congratulations, Guanghui! July 2025: My former postdoc Rohan Ghuge presented our work on improved and oracle-efficient online $\\ell_1$ multicalibration at ICML 2025. Congratulations, Rohan! July 2025: I had a really nice time presenting our work on the impact of general training losses and out-of-distribution error analysis at the Youth in High Dimensions workshop in Trieste, Italy. July 2025: My student Milind Nakul presented work that he led on estimating the stationary mass of a distribution on a mixing sequence frequency by frequency at COLT 2025. Congratulations, Milind! June 2025: I presented our work on optimal estimation of stationary missing mass on a mixing sequence at the International Indian Statistical Association conference in Lincoln, Nebraska. June 2025: A big congratulations to Rohan Ghuge, who has started his position as an Assistant Professor at UT Austin’s McCombs School of Business! May 2025: My students Tyler LaBonte and Kuo-Wei Lai will be presenting work that they co-led on formulating and characterizing a notion of “task shift” between classification and regression at AISTATS 2025. Congratulations, Tyler and Kuo-Wei! April 2025: I had a great time presenting our work on the impact of general training losses and out-of-distribution error analysis at Arizona State University, and our work on adaptive oracle-efficient online learning at Northwestern University. April 2025: I am honored to have received the ECE Roger Webb Outstanding Junior Faculty Award. March 2025: Congratulations to Guanghui Wang for receiving the Apple ML/AI Scholars PhD Fellowship! December 2024: I presented our work on the impact of general training losses in high dimensions at the International Indian Statistical Association conference in Kochi. December 2024: My students Chiraag Kaushik and Tyler LaBonte are presenting their work on precise asymptotics of iteratively reweighted least-squares algorithms on linear diagonal networks and nuances in the impacts of class balancing and model scaling on group robustness at NeurIPS 2024. Congratulations, Chiraag and Tyler! November 2024: Our work on optimal estimation of missing mass in a stationary Markov sequence (joint with Ashwin Pananjady and Andrew Thangaraj) was published in Journal of Machine Learning Research. November 2024: Congratulations to Kuo-Wei Lai for receiving the ARC-ACO Fellowship (Spring 2025 cycle)! November 2024: Our work on the impossibility of convergence of mixed strategies arising from no-regret learning (joint with Soham Rajesh-Phade and Anant Sahai) was published in Mathematics of Operations Research. October 2024: I presented our work on comparison and transfer between tasks in overparameterized learning at the Institute for Pure and Applied Mathematics Workshop on “Theory and Practice of Deep Learning”. Primary Sidebar Vidya Muthukumar Assistant Professor Schools of ECE and ISyE Georgia Institute of Technology vmuthukumar8 [at] gatech [dot] edu Coda S1139Google Scholar Education Ph.D. Electrical Engineering and Computer Sciences (2020), University of California Berkeley B.Tech. (with honors), Electrical Engineering (2014), Indian Institute of Technology Madras",
  "content_length": 4644,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:30"
}