{
  "name": "Vignesh Narayanan",
  "homepage": "https://vigsnar.github.io",
  "status": "success",
  "content": "Dynamical Systems and AI Research Group Research Overview We study dynamical systems, complex networks, and build ML tools that facilitate dynamic data analysis and learning Reach Us Updates 11/21/25 - We will be organizing a special session at the WCCI 2026. Details & flyer 10/30/25 - Bharath Muppasani, Ritirupa Dey, Biplav Srivastava, and Vignesh Narayanan, ``OMEGA: An Ontology-Driven Tool for Explaining Multi-Agent Path Finding,\" AAAI 2026 (accepted for publication in demo track). 10/24/25 - New paper \"Safe Data-enabled Control of Human-in-the-Loop Robotic Manipulator Systems,\" accepted for publication in IEEE Transactions on Industrial Informatics. 07/15/25 - We will be presenting our work titled \"Online Pseudospectral Approach for System Identification and State Estimation\" at the IEEE Conference on Decision and Control, 2025. 05/14/25 - New paper featured on the cover of Physical Chemistry Chemical Physics (PCCP), published by the Royal Society of Chemistry (RSC): Check out the cover and the paper. 04/01/25 - Erik Connerty has been offered the DoD SMART scholarship! 03/13/25 - We will be attending the 11th International Conference on Engineering of Chemical Complexity. 03/01/25 - New paper \"Iterative Reservoir Computing Networks for Reconstructing Irregular Time Series,\" accepted for publication in IEEE Transactions on Neural Networks and Learning Systems. 1/30/25 - We will be organizing a minisymposium - Systems-Theoretic Approaches to Learning: Applications to Estimation and Control 3.0- at the SIAM Conference on Applications of Dynamical Systems (DS25). 1/16/25 - We will be attending the Americal Control Conference, IEEE, to present our work \"A Novel Online System Identification Using Chebyshev Polynomial Basis of the Second Kind\". 1/14/25 - Sebastian Gaviria joined our team. 12/09/24 - We will be attending AAAI 2025. We will be presenting \"Predicting Chaotic Systems with Quantum Echo-state Networks\" and \"On Generalized Planning for Controlling Opinion Networks: Interpreting Human-AI Dialog States and Beliefs\". 12/05/24 - We will be organizing a special session - Systems-Theoretic Approaches to Learning 2.0: Applications to System Identification, State Estimation and Control-at the upcoming IJCNN 2025. 10/22/24 - We will be presenting our work \"Building a Plan Ontology to Represent and Exploit Planning Knowledge and Its Applications,\" at CODS-COMAD, 2024. 10/20/24 - We will be attending NeurIPS 2024 to present our work \"Towards Effective Planning Strategies for Dynamic Opinion Networks\". 10/01/24 - Risha Patel joined our team. 10/01/24 - New paper \"Duality of Ensemble Systems Through Moment Representations,\" published in IEEE Transactions on Automatic Control. 09/13/24 - We will be attending IEEE Conference on Decision and Control to present our work \"Aperiodic Sensing and Data-Driven System Identification of Nonlinear Systems Using Chebyshev Pseudospectral Approach\". 09/05/24 - New paper \"Moment-Based Reinforcement Learning for Ensemble Control,\" published in IEEE Transactions on Neural Networks and Learning Systems. 08/24/24 - Ayush Parambath joined our team. 08/22/24 - Check out the MCEC article on our recently funded NSF project. 07/10/24 - We will be organizing a minisymposium at SIAM Conference on Mathematics of Data Science (MDS24) - Systems-Theoretic Approaches to Learning: Applications to Estimation and Control 07/05/24 - New project funded - Vulnerability Characterization of Learning-Based Controllers in Networked Cyber-Physical Systems (Sponsor: NSF, PI: Vignesh Narayanan) (click here for details) 06/20/24 - Check out the new book with codes - `Optimal Event-Triggered Control Using Adaptive Dynamic Programming` (Publisher's page) 05/29/24 - Dr. Narayanan gave a talk on ``Event-triggered Control,” at the Workshop on Machine Learning and Deep Learning: Basics to Research Perspectives, Madras Institute of Technology Campus, Anna University, India, 2024. Photos -1, 2 04/25/24 - Check out this article: CEC Article 03/19/24 - New project funded - Learning-Enabled Collaborative Autonomy for Networked CPS (Sponsor: AFOSR, DoD) 03/09/24 - Dr. Narayanan joined the editorial team of IEEE Transactions on Cybernetics 03/03/24 - We will be presenting our research at the AAAI Spring Symposium on Empowering Machine Learning and Large Language Models with Domain and Commonsense Knowledge (AAAI-MAKE 2024) 02/29/24 - Congrats, Bharath and team for winning the \"Best Technical Demonstration Award\" at AAAI 2024! 01/22/24 - Maxwell Geiger, Vignesh Narayanan, Sarangapani Jagannathan, ``Optimal Tracking of Uncertain Linear Discrete-time Systems using Time-varying Lifelong Q-learning,\" in IEEE American Control Conference (ACC), 2024 (accepted for publication) 12/15/23 - Bharath Muppasani, Vignesh Narayanan, Michael Huhns, and Biplav Srivastava, ``Expressive and Flexible Simulation of Information Spread Strategies in Social Networks Using Planning,\" AAAI '24 (accepted for publication in Demo track) 08/15/23 - New project funded - EAGER: Knowledge-guided neurosymbolic AI with guardrails for safe virtual health assistants (Sponsor: NSF, PI: Dr. Amit Sheth and Co-PI: Vignesh Narayanan) (click here for details) 08/15/23 - Rae Jones joined our team! 08/15/23 - Protik joined our team! 08/01/23 - Some of our recent works were presented in IEEE Conference on Artificial Intelligence, KDD Workshop on Knowledge Augmented Methods for NLP, and KDD Workshop on Knowledge-infused Learning and a work on process knowledge-infused learning is selected for presentation in AAAI Second Symposium on Human Partnership with Medical Artificial Intelligence 07/20/23 - Panel on #Ask Us Anything 07/20/23 - HBM 2023, Poster by Deepa - Poster 07/01/23 - Dr. Narayanan joined the editorial team of IEEE Transactions on Neural Networks and Learning Systems 06/15/23 - We will be attending SMC'23 Accepted paper 05/15/23 - Erik joined our team! 05/01/23 - New project funded - Collaborative autonomy in uncertain environments:Exploring vistas beyond consensus (Sponsor: NEEC, NSWC, Panama city, DoD, USC will be collaborating with UAH) 01/20/23 - We will be attending SIAM DS23 (May 14-18) at Portland, Oregon! 12/14/22 - Our work on cooperative deep Q-networks is accepted for publication in IEEE Transactions on Neural Networks and Learning Systems! 11/28/22 - Our work on building chatbots is selected for presentation in AAAI-23, AI4CE Workshop in Feb, 2023! 11/22/22 - Our work on the relationship between iterative function learning and ensemble control is selected for presentation in AAAI-23, MLmDS Workshop in Feb, 2023! 11/19/22 - Our work on learing to control CPS in the presence of time delays is accepted for publication in IEEE Transactions on Systems, Man, and Cybernetics: Systems! 10/28/22 - AIISC retreat - Check out the posters 09/15/22 - Undergrad interns - Austin and Erik joined our team! 08/16/22 - Bharath joined our team! 05/15/22 - Summer internship - Peyton joined our team! 05/01/22 - Teja joined our team! 05/01/22 - New project funded - Information Competition Simulator (Sponsor: UMD, ARLIS, DoD, PI: Dr. Michael Huhns and Co-PI: Vignesh Narayanan) 12/15/22 - Special session accepted! WCCI 2022 Data-Efficient Multi-Agent Reinforcement Learning for Control, Automation, and Population Systems Optimization 10/15/21 - New course on Optimization will be offered this Spring - CSCE 590 07/27/21 - New course will be offered this fall - CSCE 790: Neural Networks and Their Applications to Intelligent Systems Show More Current Funded Projects Information Competition Simulator Examining the dynamics of information dissemination and the formation of opinions within networks holds significant importance. The overarching goal of this project is to construct a versatile and authentic simulator (i.e., a \"digital twin\"), designed to comprehend the propagation of information in dynamic environments. The project integrates theories of multi-agent systems and dynamic planning with knowledge graphs to build an interpretable and dynamic information environment. Collaborative Autonomy in Uncertain Environments: Exploring Vistas Beyond Consensus The overall objective of this project is to design efficient aperiodic communication protocols, privacy-preserving and scalable learning algorithms for inference and filtering, and resource-conscious control strategies for networked autonomous, heterogeneous agents in a distributed setting. EAGER: Knowledge-guided Neurosymbolic AI with Guardrails for Safe Virtual Health Assistants The overall objective of this project is to enhance the safety and reliability of generative AI systems, specifically virtual health assistants (VHAs) in healthcare, by integrating clinical process knowledge through Knowledge Graphs (KGs). The project aims to produce safety-constrained VHAs that adhere to medical guidelines, providing understandable explanations for users. Beyond healthcare, the research contributes to the broader field of AI by advancing neurosymbolic AI techniques, fostering collaboration between humans and AI, and promoting transferability to safety-critical domains. Learning-Enabled Collaborative Autonomy for Networked CPS The principal objective of this research is to advance methodologies for modeling, learning, and controlling networked cyber-physical systems (CPS), specifically those incorporating human users or operators in their feedback loop, through a systematic emphasis on data- and knowledge- driven approaches. Vulnerability Characterization of Learning-Based Controllers in Networked Cyber-Physical Systems The primary goals of the collaborative project are to develop a) a real-time reward manipulation scheme for learning-based controllers, b) multi-level attack schemes on reward signals in a distributed control architecture for CPS, and c) data-enabled strategies for their detection. Selected Previous Works Nested two-stage clustering algorithm for dietary pattern analysis Reservoir networks: Interpretable design Game-the",
  "content_length": 13374,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:30"
}