{
  "name": "Vijay Kumar 0001",
  "homepage": "http://www.kumarrobotics.org",
  "status": "success",
  "content": "Vijay Kumar Lab Home Research Current Projects Past Projects Videos Publications Education Teaching Outreach Y-Prize Group Dr. Vijay Kumar Current Members Alumni News Contact WelcomeVIJAY KUMAR is the Nemirovsky Family Dean of Penn Engineering with appointments in the Departments of Mechanical Engineering and Applied Mechanics, Computer and Information Science, and Electrical and Systems Engineering at the University of Pennsylvania. Kumar's group works on creating autonomous ground and aerial robots, designing bio-inspired algorithms for collective behaviors, and on robot swarms. They have won many best paper awards at conferences, and group alumni are leaders in teaching, research, business and entrepreneurship. Kumar is a fellow of ASME and IEEE and has been elected to the National Academy of Engineering, American Philosophical Society, and the American Academy of Arts and Sciences. He is the founder of Exyn Technologies, an advisor to Treeswift, and serves on the board of WeRobotics and O2Micro. Vijay Kumar has held many administrative positions in the School of Engineering and Applied Science, including director of the GRASP Laboratory, chair of Mechanical Engineering and Applied Mechanics, and the position of the Deputy Dean. He served as the assistant director of robotics and cyber physical systems at the White House Office of Science and Technology Policy. More information about Kumar’s research can be found in his TED talks.Click here for bio and images for download. News Oct 23, 2022 Fernando Cladera was the keynote speaker for ROSCon 2022. Fernando Cladera was the keynote speaker for ROSCon 2022. Watch here (from the 13 min mark) for an excellent overview of our autonomy stack and our open source repository. Jan 31, 2022 We are looking forward to hosting and celebrating ICRA 2022 in Philadelphia. Congratulations to Ian Miller, Laura Jarin-Lipschitz, Xu Liu, Siddarth Mayya, Daniel Mox, Senthil Kumar, Yuezhan Tao, Dinesh Thakur, Walker Gosrich, and Lifeng Zhou, as well as lab alums Rebecca Li, Jimmy Paulos, and Ke Sun for ICRA 2022 paper acceptances. Jan 30, 2022 Congratulations to Anusha Srikanthan and Siddarth Maya for an Excellent Paper Award  at IROS 2021 “Cognitive and Social Aspects of Human Multi-Robot Interaction” Dec 29, 2021 Dr. Arbaaz Khan is now an Autonomous Driving Software Engineer at Rivian. Dec 21, 2021 Dr. Siddarth Mayya joins Amazon as a research scientist. Recent Highlights Recent PublicationsDaniel Mox and Vijay Kumar and Alejandro RibeiroLearning Connectivity-Maximizing Network Configurations (article)Siddharth Mayya and Ragesh K. Ramachandran and Lifeng Zhou and Vinay Senthil and Dinesh Thakur and Gaurav S. Sukhatme and Vijay KumarAdaptive and Risk-Aware Target Tracking for Robot Teams With Heterogeneous Sensors (article)Xu Liu and Guilherme V. Nardari and Fernando Cladera Ojeda and Yuezhan Tao and Alex Zhou and Thomas Donnelly and Chao Qu and Steven W. Chen and Roseli A. F. Romero and Camillo J. Taylor and Vijay KumarLarge-Scale Autonomous Flight With Real-Time Semantic SLAM Under Dense Forest Canopy (article)Laura Jarin-lipschitz and Xu Liu and Yuezhan Tao and Vijay KumarExperiments in Adaptive Replanning for Fast Autonomous Flight in Forests (inproceedings)Ke Sun and Stephen Chaves and Paul Martin and Vijay KumarRTGNN: A Novel Approach to Model Stochastic Traffic Dynamics (misc)Daniel Mox and Vijay Kumar and Alejandro RibeiroLearning Connectivity-Maximizing Network Configurations (article) Contact Vijay Kumar Ph.D Vijay Kumar Lab Department of Mechanical Engineering and Applied Mechanics School of Engineering and Applied Science University of Pennsylvania Towne 107, 220 S. 33rd StreetPhiladelphia, PA 19104-6315 Lab GRASP Laboratory at PERCH Pennovation Works 3401 Grays Ferry Philadelphia, PA 19146 Home Research Current Projects Past Projects Videos Publications Education Teaching Outreach Y-Prize Group Dr. Vijay Kumar Current Members Alumni News Contact © 2025 Vijay Kumar Lab. All rights reserved. Site By Academic Web Pages. Top",
  "content_length": 4037,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:38"
}