{
  "name": "Vijay Ganesh 0001",
  "homepage": "https://vganesh1.github.io",
  "status": "success",
  "content": "Vijay Ganesh Vijay Ganesh Professor, Georgia Institute of Technology, Atlanta, USA Home | Brief Bio/CV | Publications | Research | Teaching | Research Group|Awards|Software|Invited Talks |Interests/Links Professor, SCS, GeorgiaTech (2023-) Associate Director, IDEaS Institute (2025-) Co-Founder, Center for Math AI @ Fields (2025-) Co-Director, Waterloo AI Institute (2021-2023) Associate Professor, Waterloo (2018-2023) Assistant Professor, Waterloo (2012-2018) Research Scientist, MIT (2007-2012) PhD, Stanford University (2007) News AI4Science Tutorial @ Georgia Tech 2025 AAAI Tutorial on ML for Solvers 2025 Joined GeorgiaTech, September 2023 Waterloo.AI Workshop on AI for Science 2022 SAT Seminar 2021-present SAT Program @ Simons, Berkeley 2021 ML+Logic online seminar 2020-2021 Book chapter on SAT solvers released 2020 ISSTA Keynote + Impact Award 2019 Waterloo AI Institute featured project 2018 Two Silver medals at SAT 2017 Article on our research 2016 ACM Test of Time Award 2016 Best Paper Award at ACSAC 2016 Two Gold medals at SAT 2016 Early Researcher Award 2016 Fields Institute Workshop 2016 St. Petersburg Special Semester on Computational Complexity 2016 Won IBM Faculty Award 2015 CAV paper among best @ CAV '15 CADE paper among best @ CADE '15 Won best paper award at SPLC 2015 Latest STP Solver 2015 released MathCheck Tool 2015 released Z3str2 string solver 2015 released IBM PL Day 2014 Speaker Best Student Paper Award 2014 Heidelberg Laureate Forum 2013 Google Faculty Awards 2013 & 2011 Vijay Ganesh is a professor of computer science at Georgia Tech and the associate director of the IDEaS (AI for Science and Engineering) Institute. Additionally, he is a co-founder and steering committee member of the Center for Mathematical AI at the Fields Institute, and an AI Fellow at the BSIA. Prior to joining Georgia Tech in 2023, Vijay was a professor at the University of Waterloo from 2012 to 2023, where he also served as a Co-Director of the Waterloo AI Institute from 2021 to 2023. From 2007 to 2012, Vijay was a research scientist at MIT. Vijay completed his computer science PhD from Stanford University in 2007. The primary focus of Vijay's research is the theory and practice of SAT/SMT solvers and their applications in software engineering, security, AI, mathematics, and physics. Vijay currently leads the following projects: 1. Machine Learning (ML) for Logic (Solvers) MapleSAT: Machine learning based SAT Machine learning based parallel SAT (AlphaMapleSAT) Machine learning based SMT (Z3alpha, MachSMT, Meta-solving) Z3str* string solvers 2. Logic for ML Neurosymbolic AI for scientific discovery Neurosymbolic AI for math NeuroSymbolic AI for code 3. Proof Complexity Theory Proof complexity-theoretic analysis of SAT/SMT solvers and formal methods 4. Software Engineering and Security BanditFuzz: RL-guided performance fuzzer for SMT solver Pierce: Performance testing of neural network verifiers Security of blockchain technologies Attack Resistance of Security Defense Mechanisms STP bitvector and array solver (2005-2012) Profile: CV (June 2025), Google Scholar, DBLP, LinkedIn, Math Genealogy, Simons Institute @ Berkeley, MathSciNet, ORCID Notable Awards, Honors, Medals, and Distinctions Below find a list of notable awards that Dr. Ganesh has received in his career. A complete list is available on his awards page. Z3-alpha won several divisions at SMT-COMP 2024 and SMT-COMP 2025 Bronze medal at SAT 2023 Competition (main track) NeurIPS Spotlight Poster 2023 University of Waterloo Engineering Research Excellence Award (EREA) 2022 ACM ISSTA Impact Paper Award 2019 (Best paper in 10 years at ACM ISSTA conference) Silver medal at SAT 2017 Competition (main track) Silver medal at SAT 2017 Competition (no-limits track) ACM Test of Time Award at CCS 2016 (Best paper in 10 years at ACM CCS conference) Best Paper Award at ACSAC 2016 Ontario Early Researcher Award 2016, Canada Gold medal at the SAT Competition 2016 (Main Track) Gold medal at the SAT Competition 2016 (Application Track) IBM Faculty Award 2015 Paper on MathCheck conjecture verifier selected for the JAR Journal Special Issue on Best Papers at CADE 2015 Paper on Z3str2 String Solver selected for FMSD Journal Special Issue on the Best Papers at CAV 2015 Google Faculty Research Award 2013 (Only 6 winners worldwide in software engineering in 2013) Google Faculty Research Award 2011 (Only 9 winners worldwide in software engineering in 2011) ACM Distinguished SIGSOFT Paper Award 2009 (for the HAMPI string solver paper) Ten-year most influential paper citation at DATE 2008 (Best paper in 10 years at the DATE conference) Professional Service Editorial and Steering Committees Editor-in-chief: Springer book series titled \"Progress in Computer Science and Applied Logic\" (PCSAL). 2018-2023 Associate Editor: Maple Transactions. 2021-present Member of Editorial Board: Journal of Satisfiability (JSAT). 2018-present CSTVA Steering Committee Member 2017-2018, The International SAT/SMT/AR Summer School Steering Committee Member 2017-present, SMT Steering Committee Member 2014-2015 Conference/Workshop Co-chair and Organizer Co-chair: CAV 2024 Co-organizer: Dagsuthl seminar on \"Machine Learning and Logical Reasoning: The New Frontier\" 2022 Co-organizer: Dagstuhl seminar on \"Theory and Practice of SAT and Combinatorial Solving\" 2022 Co-chair: ATVA 2021 Co-organizer: Berkeley Simons Institute for Theory of Computing Workshop on Boolean SATisfiability 2021 Co-organizer: Dagstuhl seminar on Bringing CP, SAT and SMT together: Next Challenges in Constraint Solving 2019 Lead Organizer: Waterloo Workshop on Blockchain + Security 2019 Lead Organizer: Waterloo Workshop on Machine Learning + Security + Verification 2019 Co-chair: Association of Symbolic Logic (ASL) Special Session on Computer-aided Proofs 2017 Co-chair: SC^2 Workshop (Symbolic Computation + Satisfiability Checking) 2017 Co-chair: David Dill @ 60 Workshop at CAV 2017 Lead Organizer: Fields Institute workshop on Theoretical Foundations of SAT Solving 2016 Co-organizer: Dagstuhl seminar on Theory and Practice of SAT Solving 2015 Co-chair: SMT 2015 Co-chair: CSTVA 2014 Co-organizer: Dagstuhl seminar on Symbolic Execution and Constraint Solving 2014 Lead Organizer:  Summer School on SAT/SMT Solvers 2011 at MIT from June 12-17, 2011. (Reviews by Sean Heelan) Lead Organizer:  Summer School on Combination of Decision Procedures 2004 at Stanford University from Aug 6-12, 2004 Program Committee Member: AAAI 2026 (Super PC member), VMCAI 2026, CAV 2025, CADE 2025, ICLR 2025, ICML 2025, NeurIPS 2025, NeSy 2025, CompAI 2025, SAIV 2025, CAV 2024 (PC Co-Chair), IJCAI 2024, AAAI 2024, ICLR 2024, PLDI 2024, SAT 2024, CP 2024, NeSym 2024, NeurIPS 2023, NeSym 2023, AAAI 2022, ATVA 2022, SAT 2022, ATVA 2021 (PC Co-chair), IJCAI 2021 (Senior PC), CAV 2021, PLDI 2021, AAAI 2021, FM 2021,  SOCS 2021, AAAI-XAI 2021, POPL 2020, AAAI 2020, IJCAI 2020, ICTAI 2020, IJCAI 2019, ICTAI 2019, ICISS 2019, CP 2018, IJCAI 2018, SAT 2018, CAV 2018, FM 2018, IJCAR 2018, FSCD 2018, PoS 2018, FroCos 2017, SYNASC 2017, CP 2017, Association of Symbolic Logic (ASL) Special Session 2017, ICSE (NIER) 2017, PLDI (ERC) 2017, SC^2 2017, Fields Institute SAT Workshop 2016, USE 2016, SC^2 Workshop 2016, Formal Methods 2016, VSTTE 2016, PAAR 2016, ICCS 2016, ISAIM 2016, POPL (ERC) 2016, ICDCIT 2016, SPSM 2015, ASSESS 2015, CSTVA 2015, VSTTE 2015, SMT 2015, Formal Methods 2015, AAAI 2015, USE 2015, CSTVA 2014, ASSESS 2014, FroCos 2013, CSTVA 2013, SMT 2012, IEEE NCA 2012, SMT 2011, IEEE NCA 2011 Contact Information School of Computer Science Klaus Advanced Computing Building, Room 2320 266 Ferst Dr NW, Atlanta, GA 30332, United States Phone: +1-404-385-6362",
  "content_length": 7734,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:31"
}