{
  "name": "Vijaya Ramachandran",
  "homepage": "https://www.cs.utexas.edu/~vlr",
  "status": "success",
  "content": "Vijaya Ramachandran Vijaya Ramachandran Blakemore Regents Professor of Computer Science The University of Texas at Austin Ph.D. Princeton University Research Interests My research interests are in theoretical computer science, in the areas of algorithm design and analysis, data structures, graph theory and algorithms, and parallel and distributed computation. You can access copies of recent papers of mine. A complete listing of my publications is available in my vita. [vita in Adobe pdf] Research Opportunities Current Graduate students: Contact me if you are interested in a CS395 independent research course with me. Current Undergraduate students: Contact me if you are interested in an independent research course with me on algorithms and data structures with an emphasis on theory. Prospective graduate students: Instructions and online application link can be found at the department's graduate admissions website. If you have interest in doing research with me, you are welcome to send me email detailing your background and your research interests. Note that admissions are determined by a committee. No External Internships: I do not have external research or internship opportunities available. I regret that I will be unable to respond personally to such requests. Ph.D. Students and Postdoctoral Associates Udit Agarwal, ``Algorithms, Parallelism and Fine-Grained Complexity for Shortest Path Problems in Sparse Graphs'', Ph.D., University of Texas at Austin, December 2019. Matteo Pontecorvi, ``Algorithms for Dynamic and Distributed Networks: Shortest Paths, Betweenness Centrality and Related Problems'', Ph.D., University of Texas at Austin, December 2017. Rezaul Alam Chowdhury, ``Cache-efficient Algorithms and Data Structures: Theory and Experimental Evaluation,'' Ph.D., University of Texas at Austin, August 2007. Dan Fernholz, ``Sparse Random Graphs: Methods, Structure, and Heuristics,'' Ph.D., University of Texas at Austin, December 2007. Ganeshkumar Ganapathy, ``Algorithms and Heuristics for Combinatorial Optimization in Phylogeny,'' Ph.D., University of Texas at Austin, August 2006. Seth Pettie, ``On the Shortest Path and Minimum Spanning Tree Problems,'' Ph.D., University of Texas at Austin, August 2003. Chung Keung Poon, Postdoctoral Associate, September 1995 to August 1996. Philip D. MacKenzie , Postdoctoral Associate, September 1992 to August 1994. Co-supervised by Greg Plaxton. Tsan-sheng Hsu , ``Graph Augmentation and Related Problems: Theory and Practice,'' Ph.D., University of Texas at Austin, December 1993. Pierre Kelsen , ``Efficient Computation of Extremal Structures in Graphs and Hypergraphs,'' Ph.D., University of Illinois at Urbana-Champaign, Summer 1992. Arkady Kanevsky, ``Vertex Connectivity of Graphs: Algorithms and Bounds,'' Ph.D., University of Illinois at Urbana-Champaign, Summer 1988. Classes FALL 2020: CS388G: Algorithms: Techniques and Theory SPRING 2020: CS331H: Algorithms and Complexity (Honors) FALL 2019: CS388G: Algorithms: Techniques and Theory SPRING 2019: CS331: Algorithms and Complexity FALL 2018:: CS388G: Algorithms: Techniques and Theory SPRING 2018: CS331H: Algorithms and Complexity (Honors) SPRING 2017: CS331: Algorithms and Complexity FALL 2016: CS388P: Parallel Algorithms Contact Information Email: vlr \"at\" cs \"dot\" utexas \"dot\" edu Phone:(512) 471-7316 Fax:(512) 471-8885 Postal: Department of Computer Science 2317 Speedway, Stop D9500 The University of Texas at Austin Austin, TX 78712-1188",
  "content_length": 3489,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:36"
}