{
  "name": "Vijay V. Vazirani",
  "homepage": "https://ics.uci.edu/~vazirani",
  "status": "success",
  "content": "Vijay V. Vazirani Vijay V. Vazirani Distinguished Professor Computer Science Department University of California, Irvine Director, ACO Center @ UCI Ph.D., University of California, Berkeley S.B., Massachusetts Institute of Technology Three Recent Talks: 1). Online Bipartite Matching and Adwords Talk at Institute of Advanced Studies, Princeton, March 2022.. 2). A Theory of Alternating Paths and Blossoms, from the Perspective of Minimum Length Two-talk sequance, Simons Institute, October, 2023. 3). LP-Duality and the Cores of Games Online and Matching-Based Market Design, Simons Institute Workshop, October, 2023 From the Sun Temple, Gujarat, India, January 2025 ‎ Some Interesting Asides: 1). My father's books 2). John von Neumann Theory Prize Citation. 3). TCS: Looking into the Future 4). A worthy cause Research Interests Algorithmic problems in mathematical economics and game theory, design of efficient exact and approximation algorithms, computational complexity theory. Books 1). Approximation Algorithms, Springer-Verlag, Berlin, 2001. Preface, Table of Contents, and Chapter 1. Translations: Japanese Polish French Chinese 2). Algorithmic Game Theory, Noam Nisan, Tim Roughgarden, Eva Tardos, and Vijay V. Vazirani, editors, Cambridge University Press, Cambridge, 2007. Non-printable version on the web and DIMAP Workshop (Warwick University) introducing the book. 3). Online and Matching-Based Market Design, Federico Echenique, Nicole Immorlica and Vijay V. Vazirani, editors, Cambridge University Press, Cambridge, 2023. Available for free download here. The password is OMBMD_CUP (A word about the origins of this area -- please see my contribution here.) Selected Recent Papers Matching-Based Papers ``A Theory of Alternating Paths and Blossoms, from the Perspective of Minimum Length'', Math. of Operations Research, 49(3) (2024). Two-talk sequance, Simons Institute, October, 2023. ``Arctic Auctions, Linear Fisher Markets, and Rational Convex Programs'', arXiv, 2025. ``Fair Core Imputations for the Assignment Game: New Solution Concepts and Efficient Algorithms'', arXiv, 2025. ``Fair Rent Division: New Budget and Rent Constraints'', with R. Gangam and S. Tehrijam, FSTTCS, 2025. ``Cardinal-Utility Matching Markets: The Quest for Envy-Freeness, Pareto-Optimality, and Efficient Computability'', with T. Trobst, Math. of Operations Research (to appear). ``A Generalization of von Neumann's Reduction from the Assignment Problem to Zero-Sum Games'', with I. Adler and M. Bullinger, Games and Economic Behavior (to appear). ``Leximin and Leximax Fair Core Imputations for the Max-Flow, MST, and Bipartite b-Matching Games'', arXiv, 2024. ``Matching Markets with Chores'', with J. Garg and T. Trobst, AMAS, 2025. ``The Investment Management Game: Extending the Scope of the Notion of Core'', SAGT, 2024. ``LP-Duality Theory and the Cores of Game'', arXiv, 2023. \"Towards a Practical, Budget-Oblivious Algorithm for the Adwords Problem under Small Bids\", FSTTCS, 2023. ``The General Graph Matching Game: Approximate Core'', Games and Economic Behavior, vol 132 (2022). ''The Stable Matching Lattice under Changed Preferences, and Associated Algorithms'', with R. Gangam, T. Mai and N. Raju, arXiv, 2023. ``Cores of Games via Total Dual Integrality, with Applications to Perfect Graphs and Polymatroids'', arXiv, 2022. ``New Characterizations of Core Imputations of Matching and b-Matching Games'', FSTTCS, 2022. ''A Structural and Algorithmic Study of Stable Matching Lattices of ``Nearby'' Instances, with Applications'', with R. Gangam, T. Mai and N. Raju, FSTTCS, 2022. ``Online Bipartite Matching and Adwords'', Mathematical Foundations of Computer Sceince, 2022. ``Time-Efficient Algorithms for Nash-Bargaining-Based Matching Market Models'', with I. Panageas and T. Trobst, WINE, 2024. ``Nash-Bargaining-Based Models for Matching Markets: One-Sided and Two-Sided; Fisher and Arrow-Debrew'', with M. Hosseini, ITCS, 2022. ``One-Sided Matching Markets with Endowments: Equilibria and Algorithms'', with J. Garg and T. Trobst, AAMAS, 2022. ``An Extension of the Birkhoff-von Neumann Theorem to Non-Bipartite Graphs'', arXiv, 2020. ``Stability-Preserving, Time-Efficient Mechanisms for School Choice in Two Rounds'', with K. Gajulapalli,, J. Liu and T. Mai, FSTTCS, 2020. ``Computational Complexity of the Hylland-Zeckhauser Mechanism for One-Sided Matching Markets'', with M. Yannakakis, ITCS, 2021; to appear in SIAM J. Computing. ``A Real Polynomial for Bipartite Graph Minimum Weight Perfect Matchings'', with T. Trobst, Information Processing Letters, 2022. ``Matching is as Easy as the Decision Problem, in the NC Model'', with N. Anari, ITCS, 2020. ``Planar Graph Perfect Matching is in NC''. with N. Anari, FOCS, 2018. Journal of ACM 67(4), 2020. ``NC Algorithms for Perfect Matching and Maximum Flow in One-Crossing-Minor-Free Graphs''. with D. Eppstein, SIAM J. COMPUT 50(3), 2021. ``Finding Stable Matchings that are Robust to Errors in the Input''. with T. Mai, ESA, 2018. Algorithms for Markets and Bargaining ``Nash Social Welfare for Indivisible Items under Separable, Piecewise-Linear Concave Utilities''. with N. Anari, T. Mai and S. Oveis Gharan, SODA, 2018. ``A Performance-Based Scheme for Pricing Resources in the Cloud''. with K. Jain and T. Mai, WINE, 2017. ``Settling the Complexity of Arrow-Debreu Markets under Leontief and PLC Utilities, using the Classes FIXP and ∃R''. with J. Garg, R. Mehta and S. Yazdanbod, STOC, 2017. ``Convex Program Duality, Fisher Markets, and Nash Social Welfare''. with R. Cole, N. Devanur, V. Gkatzelis, K. Jain, T. Mai and S. Yazdanbod, ACM EC, 2017. ``A New Class of Combinatorial Markets with Covering Constraints: Algorithms and Applications''. with N. Devanur, J. Garg, R. Mehta and S. Yazdanbod, SODA, 2017. ``Allocation of Divisible Goods under Lexicographic Preferences'', with L. Schulman, FSTTCS (2015). ``Dichotomies in Equilibrium Computation, and Complementary Pivot Algorithms for a New Class of Non-Separable Utility Functions'', with J. Garg and R. Mehta, STOC (2014). ``An Incentive Compatible, Efficient Market for Air Traffic Flow Management, with R. Mehta, Theoretical Computer Science (2020). ``On Computability of Equilibria in Markets with Production'', with J. Garg, SODA (2014). ``A Complementary Pivot (Practical) Algorithm for Markets Under Separable, Piecewise-Linear Concave Utilities'', with J. Garg, R. Mehta and M. Sohoni, STOC (2012). ``The Notion of a Rational Convex Program, and an Algorithm for the Arrow-Debreu Nash Bargaining Game'', Journal of ACM, vol. 59(2) (2012). ``Market Equilibrium under Separable, Piecewise-Linear, Concave Utilities'', with M. Yannakakis, Journal of ACM, vol. 58(3) (2011). ``Equilibrium Pricing of Semantically Substitutable Digital Goods'', with K. Jain, in arXiv, (2012). ``How Many Tiers? Pricing in the Internet Transit Market'', with V. Valancius, C. Lumezanu, N. Feamster and R. Johari, SIGCOMM (2011). ``Non-Separable, Concave Utilities are Easy -- in a Perfect Price Discrimination Market Model'', SIAM J. Discrete Math, 27(1) (2013). ``Rational Convex Programs and Efficient Algorithms for 2-Player Nash and Nonsymmetric Bargaining Games'', SIAM J. Discrete Math, 26(3) (2012). ``A Perfect Price Discrimination Market Model with Production, and a Rational Convex Program for it'', with G. Goal, Math of Operations Research, 36: 762-782 (2011). ``Continuity Properties of Equilibrium Prices and Allocations in Linear Fisher Markets'', with N. Megiddo, WINE (2007). ``Spending Constriant Utilities, with Applications to the Adwords Market'', Math of Operations Research 35(2), 2010. ``New Results on Rationality and Strongly Polynomial Solvability in Eisenberg-Gale Markets with Two Agents'', with D. Chakrabarty and N. Devanur, SIAM J. Discrete Math, 24(3), 2010. ``Eisenberg-Gale Markets: Algorithms and Game-Theoretic Properties'', with K. Jain, Games and Economic Behavior, 70(1), 2010. ``Adwords and Generalized Online Matching'', with A. Mehta, A. Saberi and U. Vazirani, Journal of ACM 54(5), 2007. SIAM News article by Sara Robinson on this work. ``Market Equilibria for Homothetic, Quasi-Concave Utilities and Economies of Scale in Procudtion'', with K. Jain and Y. Ye, SODA (2005). ``An Improved Approximation Scheme for Computing Arrow-Debreu Prices for the Linear Case'', with N. Devanur, FSTTCS, (2003). ``Rate Control as a Market Equilibrium'', with F. P. Kelly, unpublished note (2002). ``Market Equilibrium via a Primal-Dual Algorithm for a Convex Program'', with N. Devanur, C. Papadimitriou, and A. Saberi, Journal of ACM, vol. 55(5) (2008). Other Recent Papers ``Cycles in Zero-Sum Differential Games and Biological Diversity'', with T. Mai, M. Mihail, I. Panageas, W. Ratcliff and P. Yunker, ACM EC, 2018. ``Mutation, Sexual Reproduction and Survival in Dynamic Environments'', with R. Mehta, I. Panageas, G. Piliouras and P. Tetali, ITCS, 2017. ``Settling Some Open Problems on 2-Player Symmetric Nash Equilibria'', with R. Mehta and S. Yazdanbod, SAGT (2015). ``ETR-Completeness for Decision Versions of Multi-Player (Symmetric) Nash Equilibria'', with J. Garg, R. Mehta and S. Yazdanbod, ICALP (2015). ``New Geometry-Inspired Relaxations and Algorithms for the Metric Steiner Tree Problem'', with D. Chakrabarty and N. Devanur, Math Programming, Series A (2009). ``Solvency Games'', with N. Berger, N. Kapur, and L. Schulman, FSTTCS 2008. ``Design is as Easy as Optimization'', with D. Chakrabarty and A. Mehta, SIAM Journal on Discrete Math, 24(1) (2010). ``Equitable Cost Allocations via Primal-Dual-Type Algorithms'', with K. Jain, SIAM Journal on Computing, 38(1) (2008). ``Diversity in Times of Adversity: Probabilistic Strategies in Microbial Survival Games'', with D. Wolf and A. Arkin, Journal of Theoretical Biology, vol. 234, 2005. Reviewed in Faculty of 1000. ``A Microbial Modified Prisoner's Dilemma Game: How Frequency-Dependent Selection can Lead to Random Phase Variation'', with D. Wolf and A. Arkin,",
  "content_length": 14869,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:35"
}