{
  "name": "Vijay Chidambaram",
  "homepage": "http://www.cs.utexas.edu/~vijay",
  "status": "success",
  "content": "Home - Vijay Chidambaram Welcome! I lead the UT Systems and Storage Lab. My group builds the next generation of data systems with a focus on performance and reliability. We open-source our software and collaborate closely with industry. I am also part of the UT Data Sytems group and the LASR research group at UT Austin. Research group out at lunch in 2018! Recent Publications Faster-than-light coordination for networked systems with quantum non-local games Venkat Arun, Vijay Chidambaram, Scott Aaronson 24th ACM Workshop on Hot Topics in Networks (HotNets 2025) PDF SLIDES BIB @inproceedings{arun2025quantum, title = {Faster-than-light coordination for networked systems with quantum non-local games}, author = {Arun, Venkat and Chidambaram, Vijay and Aaronson, Scott}, booktitle = {\"24th ACM Workshop on Hot Topics in Networks (HotNets 2025)\"}, year = {2025}, month = nov, address = {College Park, Maryland, USA}, group = {workshop}, keywords = {quantum}, pdf = {https://www.cs.utexas.edu/~vijay/papers/hotnets25-quantum.pdf}, slides = {https://www.cs.utexas.edu/~vijay/slides/hotnets25-quantum-slides.pdf} } GPEmu: A GPU Emulator for Faster and Cheaper Prototyping and Evaluation of Deep Learning System Research Meng Wang, Gus Waldspurger, Naufal Ananda, Yuyang Huang, Kemas Wiharja, John Bent, Swaminathan Sundararaman, Vijay Chidambaram, Haryadi S Gunawi Proceedings of the VLDB Endowment, Volume 18, Issue 6 PDF SLIDES BIB CODE @inproceedings{wang2025gpemu, title = {{GPEmu: A GPU Emulator for Faster and Cheaper Prototyping and Evaluation of Deep Learning System Research}}, author = {Wang, Meng and Waldspurger, Gus and Ananda, Naufal and Huang, Yuyang and Wiharja, Kemas and Bent, John and Sundararaman, Swaminathan and Chidambaram, Vijay and Gunawi, Haryadi S}, journal = {Proceedings of the {VLDB} Endowment}, volume = {18}, number = {6}, pages = {1919--1932}, year = {2025}, month = sep, pdf = {https://vldb.org/pvldb/vol18/p1919-wang.pdf}, keywords = {ML}, software = {https://github.com/mengwanguc/gpemu}, slides = {https://www.cs.utexas.edu/~vijay/slides/vldb25-gpemu-slides.pdf} } Tigon: A Distributed Database for a CXL Pod Yibo Huang, Haowei Chen, Newton Ni, Yan Sun, Vijay Chidambaram, Dixin Tang, Emmett Witchel 19th USENIX Symposium on Operating Systems Design and Implementation (OSDI 25) PDF SLIDES BIB CODE @inproceedings{huang25tigon, author = {Huang, Yibo and Chen, Haowei and Ni, Newton and Sun, Yan and Chidambaram, Vijay and Tang, Dixin and Witchel, Emmett}, title = {{Tigon: A Distributed Database for a CXL Pod}}, booktitle = {19th USENIX Symposium on Operating Systems Design and Implementation (OSDI 25)}, year = {2025}, pdf = {https://www.usenix.org/system/files/osdi25-huang-yibo.pdf}, publisher = {USENIX Association}, month = jul, keywords = {CXL, databases}, slides = {https://www.cs.utexas.edu/~vijay/slides/osdi25-huang-yibo-slides.pdf}, software = {https://github.com/ut-datasys/tigon} } Vijay Chidambaram Ph.D. University of Wisconsin–Madison M.S University of Wisconsin–Madison B.E Computer Science, CEG News Sep 2025 Our work on using quantum systems for coordination in distributed systems was accepted to HotNets 25! Aug 2025 I will be serving on the PC for OSDI 2026. Aug 2025 Four new students (Minh, Talia, Nitin, and Shurang) are joining the group. Welcome! ... see all News About Vijay Chidambaram Associate Professor, Department of Computer Science The University of Texas at Austin Contact Contact Vijay via email Use this site as a template! Coordinates GDC 6.436 2317 Speedway Austin, TX 78712 © 2025 Vijay Chidambaram",
  "content_length": 3578,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:34"
}