{
  "name": "Vijay V. Raghavan 0001",
  "homepage": "https://people.cmix.louisiana.edu/vijay",
  "status": "success",
  "content": "Profile - Vijay Raghavan | people.cmix.louisiana.edu Skip to main content Image Vijay Raghavan Emeritus ProfessorAAIA Fellow, Asia-Pacific Artificial Intelligence AssociationWIA Founding Fellow, Web Intelligence AcademyIEEE Life Senior MemberACM Distinguished Scientist & Life Member School of Computing and InformaticsUniversity of Louisiana at Lafayette. Email: vijay.raghavan@louisiana.edu Biography AAIA Fellow, Asia-Pacific Artificial Intelligence Association, since 2025Honored Listee, Marquis Who's Who, since 2024Emeritus Professor, since 2023WIA Founding Fellow, Web Intelligence Academy; ACM Lifetime Member, since 2023ACM Distinguished Scientist, since July 2012IEEE Life Senior Member, since 2017Around 335 research publications that have over 11,500 citations in Google Scholar (h-index of 46, Last accessed, Feb. 25, 2025).Mentor of 35 Ph.D. (25 % female), 14 M.Sc. students in computer science.Researcher, innovator and team builder who led more than 35 research projects funded by the National Science Foundation, US Department of Defense, DoE, The State of Louisiana Board of Regents and Industrial Sponsors.Founding Director of the Center for Visual and Decision Informatics (CVDI), a multi-institutional, 2012-2023; NSF funded center with research sites located at UL Lafayette, Drexel Univ., Univ. of Virginia, Univ. of Stony Brook, Univ. of North Carolina- Charlotte and Tampere University of Technology, Finland.C. G. Khatri Memorial Lecturer, 2015 Rao Prize Conf., “For innovative and pioneering work on Information Retrieval and Extraction”, Pennsylvania State University.  Previous awardees included Profs. Thomas Kailath, C. R. Rao and John F. Nash, among others.Co-chaired an Invitational Workshop on Future Directions in Text Analysis, Retrieval and Understanding, 1991, via the NSF award 9114210.It subsequently culminated in the National Science Foundation (NSF)/Defense Advanced Research Projects Agency (DARPA)/National Aeronautics and Space Administration (NASA) Research in Digital Libraries Initiative announced in late 1993.Technical Program Committee co-chair of top conferences: IEEE ICDM (New Orleans;2017) and ACM SIGIR (Montreal;1985 & Chicago;1991), ACM/IEEE WI-IAT (Toronto;2010 & Atlanta, 2013).Co-Chair, NSF-CISE and SBE Advisory Committee’s Subcommittee on Discovery in a Research Portfolio: Tools for Structuring, Analyzing, Visualizing and Interacting with Proposal and Award Portfolios, 2009 -11.ACM Distinguished Lecturer Program, 1993-2006.Co-founder and Steering Committee Member of the top conference on big data (IEEE Big Data Conferences), starting in 2013.Conference chair or co-chair of top conferences such as IEEE ICDM (Houston, 2005), IEEE Big Data (San Jose, 2013 & Japan, 2022).Co-editor-in-Chief, Web Intelligence Journal (2015- 2020); Associate Editor, ACM Transactions on Internet Technology (2014-2023); Member or former member of the editorial boards of ten international journals.Co-editor of two books published by Elsevier:       i). V. Govindaraju, V. V. Raghavan, C. R. Rao (Editors), Big Data Analytics: Handbook of Statistics (Volume 33), July 2015,       ii). V. N. Gudivada, V. V. Raghavan, V. Govindaraju, C. R. Rao (Editors), Cognitive Computing Theory and Applications:                    Handbook of Statistics (Volume 35), September 2016 . Innovator award, UL Lafayette, 2014-17 (3 patents granted and 2 patents filed).Member, NSF-CISE Directorate Advisory Committee (NSF- CISE AC), 2008-10.Dozens of invited lectures and keynotes in more than 40 venues of 10 countries. Education 1978    Ph.D.  Computing Science, University of Alberta1970    M.B.A. McMaster University1968    B. Tech.       Mechanical Engineering, Indian Institute of Tech., Madras Organizations Association of Computing MachineryIEEE Computer SocietyIEEE Big Data Conference Steering CommitteeWeb Intelligence Consortium (WIC) Steering and Technical CommitteesInternational Rough Set Society (IRSS) Advisory Board.Executive Committee, IEEE TC on Intelligent Informatics",
  "content_length": 4020,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:34"
}