{
  "name": "Vijay K. Sood",
  "homepage": "https://engineering.ontariotechu.ca/people/ecse/vijay.sood.php",
  "status": "success",
  "content": "Dr. Vijay K. Sood, P.Eng., Ph.D., LFIEEE, Emeritus FCAE, FEIC Chair | Faculty of Engineering and Applied Science About Us Mission and Vision Dean's Welcome Technology-Enriched Learning Environment (TELE) Health and safety Administrative Code Governance Alumni Profiles Natalie Prole (Maheu) Mohamd Imad Mert Temiz Mert Temiz Mert Temiz Mert Temiz Ignite Magazine Letters to a Young Engineer Future Students Explore Undergraduate Labs Women in Engineering Campus Services Undergraduate Admission information Tuition information Undergraduate Programs Engineering Co-Op Pre-Engineering Graduate Admission Information Tuition Information Financial Aid Graduate Programs Your Main Points of Contact Frequently Asked Questions Graduate Faculty Current Students First-Year zone First-Year Engineering Success Program Peer Mentorship Program GEARS First-Year FAQ Engineering Orientation Survival Guide Undergraduate Academic Advising Program Maps Electives List Frequently Asked Questions (FAQ) Registration Guidelines Specializations Minors Capstone Design 2025 Capstone Projects 2024 Capstone Projects 2023 Capstone Projects 2022 Capstone Projects 2021 Capstone Projects 2020 Capstone Projects 2019 Capstone Projects Clubs and Societies ASME Engineering Students' Society IEEE Student Branch Ontario Tech Racing Ri3D (Robot in 3 Days) Women in Engineering Sub-Society RoboMaster Ontario Tech Space and Rocketry NAYGN Canadian Nuclear Society Ontario Tech Branch Engineering Co-Op Program Details Job Search Assistance Registration Information Frequently Asked Questions Employer Information Reverse Career Fair Engineering Co-op Annual Report Experiential Learning Innovation and Design Studio Experiential Learning Workshop Series Student Competitions Women in Engineering About Us Women in Engineering Sub-Society Scholarships Women in Engineering Peer Mentoring Career Mentorship Events Volunteer Opportunities Future Students Campus Services Graduate Your Main Points of Contact Deadlines and Procedures MEng Project MASc Thesis Thesis Deadlines Thesis Procedures Important Graduate Resources Seminar Courses & Workshops Graduate Academic Calendar Important Dates Student Forms FEAS Graduate Student Forms Registration Guides Student Finances Frequently Asked Questions Campus Services Departments Automotive, and Mechatronics Engineering Electrical, Computer, and Software Engineering Energy and Nuclear Engineering Mechanical and Manufacturing Engineering Research The Research Rundown Podcast Research Labs Aerodynamic & Energy Research Group (AER) Aerodynamic and Climatic Adaptation Research (AeroClimar) Centre Automotive Centre of Excellence Borehole Thermal Energy Storage System Energy Research Centre Power Electronics and Drives Applications Laboratory (PEDAL) Weather Adaptation Lab Research Day Automotive Systems Communications and Signal Processing Electric Power Systems and Smart Electric Grid Internet of Things Manufacturing and Materials and Mechanics of Solids and Structures Noise, Vibration, and Harshness Nuclear and Energy Systems Robotics, Automation and Controls Software Systems Thermo-fluids and Heat Transfer Speaker Spotlight People Dean's Office Department of Automotive, and Mechatronics Engineering Dr. Greg Rohrauer Dr. Haoxiang Lang Dr. Jaho Seo Dr. Moustafa El-Gindy Dr. Nasim Moallemi Dr. Scott Nokleby Dr. Xianke Lin Dr. Yuping He Dr. M. Aydin Dr. Zeinab El-Sayegh Dr. Meaghan Charest-Finn Dr. Shabnam Pejhan Dr. Aaron Yurkewich Dr. Mitchell Rushton Department of Electrical, Computer and Software Engineering Dr. Akramul Azim Dr. Anwar Abdalbari Dr. Jing Ren Dr. Khalid Abdel Hafeez Dr. Khalid Elgazzar Dr. Masoud Makrehchi Dr. Mikael Eklund Dr. Min Dong Dr. Mohamed El-Darieby Dr. Mohamed Youssef Dr. Namdar Saniei Dr. Nasim Beigi-Mohammadi Dr. Qusay Mahmoud Dr. Ramiro Liscano Dr. Ruth Milman Dr. Sanaa Alwidian Dr. Shahram ShahbazPanahi Dr. Sheldon Williamson Dr. Tarlochan Sidhu, PEng, CEng Dr. Vijay K. Sood Dr. Walid Morsi Ibrahim Dr. Ying Wang Department of Energy and Nuclear Engineering Dr. Akira Tokuhiro Dr. Anthony Waker Dr. Brian Ikeda Dr. Daniel Hoornweg Dr. Edward Waller Dr. Eleodor Nichita Dr. Filippo Genco Dr. George Bereznai Dr. Glenn Harvel Dr. Hossam Gaber Dr. Igor Pioro Dr. Jennifer McKellar Dr. Kirk Atkinson Dr. Lixuan Lu Dr. Matthew Kaye Dr. Rachid Machrafi Department of Mechanical and Manufacturing Engineering Dr. Jana Abou-Ziki Dr. Martin Agelin-Chaab Dr. Eda Aydin Dr. Ahmad Barari Dr. Ibrahim Dincer Dr. Naglaa Elagamy Dr. Horia Hangan Dr. Ali Hosseini Dr. Dima Jawad Dr. Amirkianoosh Kiani Dr. Hossam Kishawy Dr. Tao Liu Dr. Brendan MacDonald Dr. Atef Mohany Dr. Remon Pop-Iliev Dr. Bale Reddy Dr. Ghaus Rizvi Dr. Marc Rosen Dr. Ebrahim Esmailzadeh Dr. Zia Saadatnia Samuel Yousefi Administrative Services Personnel Stephan Anthonipillai Janette Banga Zahraa Bassyouni Candace Chard Michelle Cholak Kelly Crocker Hunter Johnson David Kim Cherry Lam Shari Martin Nicole Mullins Alex Piliounis Nabil Saleh Sydney Smith Melanie Stryde Laura Thursby Kailey Tinline Sarah Wedge Teaching Faculty, Laboratory and Technical Services Hidayat Shahid Govind Rehal Peter Kahr Russell Papadimitriou Ali Ismail Masoud Farzam Qi Shi Leon Wu Sharman Perera Robert Ulrich Megha Verma Engineers in Residence Outreach Experiential Learning Skip to main content Home People Department of Electrical, Computer and Software Engineering Dr. Vijay K. Sood Vijay K. Sood BSc, MASc, PhD (Bradford, UK), PEng, FIEEE, FEIC Chair Professor Emeritus Department of Electrical, Computer and Software Engineering Faculty of Engineering and Applied Science Contact information 2000 Simcoe Street North Oshawa, Ontario L1G 0C5 Office: ACE 3023 905.721.8668 ext. 5478 905.721.3370 (fax) vijay.sood@ontariotechu.ca Research topics HVDC and FACTS Controllers for power transmission systems Modeling of Power Electronics Converters Control and protection of power systems Education PhD (Power Electronics), Bradford University, UK, 1977 MASc (Electrical Machines), Strathclyde University, Scotland, UK, 1969 BSc (Electrical Engineering), Nairobi University, Kenya, 1967 Courses Electrical Machines Electric Power Systems Power System Protection and Relaying Grid Integration of Renewable Energies Research and expertise Honours and awards Member of the Professional Engineers of Ontario Life Fellow of the Institute of Electrical and Electronic Engineers (IEEE) Emeritus Fellow of the Canadian Academy of Engineers Fellow of the Engineering Institute of Canada (EIC) 1998 Outstanding Service Award from IEEE Canada 1999 Meritas Award from the Ordre des ingènieurs du Québec IEEE Regional Activities Board Achievement Awards for 2001 & 2006 2000 IEEE Third Millennium Medal 2002 Canadian Pacific Railway Engineering Award from the EIC Publications and presentations Selected publications and presentations Haytham Abdelgawad and Vijay Sood, \"Average Model of Boost Converter, including Parasitics, operating in Discontinuous Conduction Mode (DCM)\", 7th World Congress on Power Engineering and Energy , WCPEE’2015 Dec, 28-31, 2015, Cairo, Egypt. And International Journal on Power Engineering and Energy (IJPEE), Vol.7, No.2, April 2016. ISSN Print 2314-7318, And Online 2314-730X, Library of Congress (Control Number: 2009937569) Haytham Abdelgawad and Vijay Sood, \"Boost Converter Controller Design based on Particle Swarm Optimisation (PSO)\", 7th World Congress on Power Engineering and Energy, WCPEE’2015 Dec, 28-31, 2015, Cairo Egypt. And International Journal on Power Engineering and Energy (IJPEE), Vol.7, No.2, April 2016. ISSN Print 2314-7318, And Online 2314-730X, Library of Congress (Control Number: 2009937569). Ref No. W15-P-0021 Omar Kotb, Mehrdad Ghandhari, Robert Eriksson, Vijay K. Sood, \"On Small Signal Stability of an AC/DC Power System with a Hybrid MTDC Network\" Electric Power Systems Research, Paper no. EPSR-D-15-00981R1. Vol.136, July 2016, pp. 79-88. Titus Okathe, Shahram Shah Heydari, Vijay Sood, Khalil El-Khatib and Orane Cole, \"Middleware for Smart Critical Infrastructure Networks Intercommunication\", International Journal On Smart Sensing and Intelligent Systems Vol. 9, No. 3, September 2016. ISSN 1178-5608. www.s2is.org Kunwar Aditya, Vijay Sood, Sheldon Williamson, \"Magnetic Characterization of Unsymmetrical Coil Pairs Using Archimedean Spirals for Wider Misalignment Tolerance in IPT Systems, IEEE Transactions on Transportation Electrification, Volume: 3, Issue: 2, June 2017, pp454 - 463 Omar Kotb, Mehrdad Ghandharia, Robert Erikssonb, Rujiroj Leelarujic, Vijay K. Sood, \"Stability Enhancement of an Interconnected AC/DC Power System through VSC-MTDC Operating Point Adjustment\", Int. Journal of Electric Power Systems Research, vol. 151, pp 308-318, October 2017 EPSR-D-16-02398R1 Tan, Bin Wu, Vijay Sood, Dewei Xu, Mehdi Narimani, Zhongyuan Cheng, and Navid Reza Zargari, \"A Simplified Space Vector Modulation for Four-Level Nested Neutral-Point Clamped Inverters with Complete Control of Flying-Capacitor Voltages\" IEEE Transactions on Power Electronics, Vol.33, No.3, pp1997-2006, March 2018. Benasla Mokhtar; Allaoui Tayeb; Brahami Mostefa; Denaï Mouloud; Vijay K Sood, \"HVDC links between North Africa and Europe: Impacts and benefits on the dynamic performance of the European system\", Elsevier Journal: Renewable & Sustainable Energy Reviews. Feb 2018. Vol. 82 (P3), pp 3981-3991. Harold R. Chamorro, 1, Andres C. Sanchez, Andres Pantoja, Ivan Zelinka, Francisco Gonzalez-Longatt, Vijay K. Sood, \"A Network Control System for Hydro Plants to Counteract the Non-Synchronous Generation Integration\", International Journal of Electrical Power and Energy Systems, 105: 404-419, Feb. 2019 Harold R.Chamorro, Ivan Ria, Reinhard~Gernd, Ivan Zelinka, Francisco Gonzalez-Longatt, Vijay K. Sood \"Synthetic Inertia Control based on Fuzzy Adaptive Differential Evolution\" Int. Journal of Electric Power and Energy Systems, Vol.105, 2019, pp 803-813 Haytham Abdelgawad and Vijay Sood, \"Kalman Filter-based maximum power point ",
  "content_length": 26456,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:32"
}