{
  "name": "Vijay Nagarajan",
  "homepage": "https://users.cs.utah.edu/~vijay",
  "status": "success",
  "content": "Vijayanand \"Vijay\" Nagarajan Vijay Nagarajan Professor Kahlert School of Computing The University of Utah Warnock Engineering Building 2897 72 Central Campus Drive Salt Lake City, Utah, 84112 Office Phone: (+1) 801 581-7026 E-mail: vijay at cs.utah.edu (FREE E-book) Publications CAPS Research Group Teaching Personal CV Open PhD Positions: You have a good background in computer architecture or programming languages or computer systems with good programming skills. Email your CV! Research Our research broadly spans computer architecture, programming languages, and computer systems. We embrace the constructive, specification-directed approach to system design where possible. We've found the approach not only leads to correctness but also to efficiency. A full list of publications can be found here. Code can be found here. We work on hardware/software support for: Research area Recent Publications Consistency & Availability of Key-value-stores [VLDB'25] [EDBT'25] [DSN'23] [EuroSys'21] [PPoPP'20] [ASPLOS'20] [EuroSys'18] Persistent memory [ASPLOS'20] [ISCA'18] [HPCA'17] [MICRO'15] Synthesis of coherence protocols [PACT'24] [ISCA'24] [Top Picks'23] [PLDI'23] [LATTE'23] [HPCA'22] [PaPoC'21] [ISCA'20] [ISCA'18] [DATE'18] Consistency & Coherence of Multicores [HotOS'25] [ISCA'21] [Synthesis Lectures] [FMCAD'17] [HPCA'16] [TACO'15] [HPCA'14] [PLDI'13] [ASPLOS'12] CAPS Research Group PhD Students An Qi Zhang Soham Bagchi Wei Siew Liew Hastin Kapoor PhD Alumni Bharghava Rajaram (First: Assistant Professor, VIT University; Current: Assistant Professor, Mahindra Ecole Centrale, India) Andrew J. McPherson (First: IBM Research; Current: Senior Data Scientist, Credit Suisse) Marco Elver (Software Engineer, Google, Mountain View) Cheng-Chieh Huang (First: Senior Software Development Engineer, Mentor Graphics; Current: Software Engineer, Google) Arpit Joshi (NVIDIA) Saumay Dublish (NVIDIA) Vasileios Gavrielatos (Huawei Research) Antonis Katsarakis (Huawei Research) Nicolai Oswald(NVIDIA Research) Adarsh Patil (Senior Research Engineer, ARM) Mahesh Dananjaya(Huawei Research) Post-doc Alumni Jose Cano Reyes (Assistant Professor, University of Glasgow) Rakesh Kumar (Associate Professor, NTNU) Chris Banks (Permanent Research Scientist, Roslin Institute and School of Veterinary studies, Edinburgh Sukarn Agarwal (Assistant Professor, IIT Mandi) Andres Goens (Assistant Professor, University of Amsterdam) Teaching Advanced Computer Architecture (Modern Distributed Memory Systems) Graduate Computer Architecture Professional Activities Organizing Committees:ISCA'25 (Program Vice-Chair) WAMS 18 LCTES 17 (General Chair) PLDI 14 (Finance Chair) PACT 13 (Registration Chair) Program Committees: ISCA'24 PLDI 24 PPoPP'24 PLDI 22 ISCA 20 MICRO 19 HPCA 19/17 CC 18 SC 16 RTCSA 14/15/16 NAS 14/15 NVMSA 15/16/17 ICCD 14/15 WODA 14 External Review Committees: HPCA 24 HPCA 22 MICRO 21 ISCA 21 ASPLOS 2019 PACT 18/14 ICS 14 PLDI 14 ASPLOS Doctoral Workshop 12 (mentor) Membership: NAIS, ACM, IEEE, HiPEAC",
  "content_length": 3013,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:33"
}