{
  "name": "Vikas Kumar 0003",
  "homepage": "http://people.du.ac.in/~vkumar1",
  "status": "success",
  "content": "Vikas Kumar Vikas Kumar Assistant Professor Department of Computer Science Faculty of Mathematical Sciences University of Delhi E-mail : vikas@cs.du.ac.in Vikas Kumar Toggle navigation Vikas Kumar Home Education Experience Teaching Publications Funded Projects Education 2014 - 2019 PhD. in Computer Science University of Hyderabad Dissertation title: Collaborative Filtering and Multi-Label Classification with Matrix Factorization. 2011 - 2014 Master of Computer Applications Pondicherry University 2007 - 2010 Bachelors of Computer Application IGNOU Experience 08 Dec 2020 - Assistant Professor Department of Computer Science Faculty of Mathematical Sciences University of Delhi 28 Sep 2019 - 07 Dec 2020 Assistant Professor Department of Data Science and Analytics Central University of Rajasthan 11 July 2019 - 27 Sep 2019 Assistant Professor Department of Data Science and Analytics Central University of Rajasthan 11 July 2018 - 09 July 2019 Assistant Professor Department of Data Science and Analytics Central University of Rajasthan Teaching Aug 2021 – Dec 2021 MCAO 302: Data Mining, University of Delhi Apr 2021 – Aug 2021 MCAC 202: Database Systems, University of Delhi MCAC 202: Database Applications, University of Delhi Dec 2020 – Mar 2021 MCAC 103: Mathematical Techniques for Computer Science Applications, University of Delhi MCSC 103: Information Security, University of Delhi Sep 2020 – Nov 2020 MBD 415: Database Management, Central University of Rajasthan Jan 2020 – Jun 2020 MBD 421: Foundations of Data Science, Central University of Rajasthan Jul 2019 – Dec 2019 MBD 511: Modelling in Operations Management, Central University of Rajasthan MBD 513: Data Mining, Central University of Rajasthan Jan 2019 – Jun 2019 MBD 421: Foundations of Data Science, Central University of Rajasthan Jul 2018 – Dec 2018 MBD 511: Modelling in Operations Management, Central University of Rajasthan MBD 513: Data Mining, Central University of Rajasthan Publications 2022 Venkateswara Rao Kagita, Arun K. Pujari, Vineet Padmanabhan, and Vikas Kumar. \"Inductive Conformal Recommender System.\" Knowledge-Based Systems (2022). Sowmini Devi Veeramachaneni, Arun K. Pujari, Vineet Padmanabhan, and Vikas Kumar. \"A hinge-loss based codebook transfer for cross-domain recommendation with non-overlapping data.\" Information Systems 107 (2022): 102002. Abhishek Majumder, Joy Lal Sarkar, Bibudhendu Pati, Ramasamy V, Chhabi Rani Panigrahi, Sudipta Roy, Vikas Kumar. \"MERIT: Multi-Itinerary Tourist Recommendation Engine for Industrial Internet of Things.\" A4E, INFOCOM, 2022. 2021 Nitesh Sukhwani, Venkateswara Rao Kagita, Vikas Kumar, and Sanjaya Kumar Panda. \"Efficient Computation of Top-K Skyline Objects in Data Set With Uncertain Preferences.\" International Journal of Data Warehousing and Mining (IJDWM) 17, no. 3 (2021): 68-80. Venkateswara Rao Kagita, Arun K. Pujari, Vineet Padmanabhan, Haris Aziz, and Vikas Kumar. \"Committee Selection using Attribute Approvals.\" In Proceedings of the 20th International Conference on Autonomous Agents and MultiAgent Systems, pp. 683-691. 2021. Rasmikanta Pati, Arun K Pujari, Padmavati Gahan, and Vikas Kumar. \"Independent Component Analysis: A Review, with Emphasis on Commonly used Algorithms and Contrast Function.\" Computación y Sistemas 25, no. 1 (2021). 2019 Sowmini Devi Veeramachaneni, Arun K Pujari, Vineet Padmanabhan, and Vikas Kumar. \"A maximum margin matrix factorization based transfer learning approach for cross-domain recommendation.\" Applied Soft Computing 85 (2019): 105751. Prasad Bhavana, Vikas Kumar, and Vineet Padmanabhan. \"Block based singular value decomposition approach to matrix factorization for recommender systems.\" arXiv preprint arXiv:1907.07410 (2019). Venkateswara Rao Kagita, Arun K. Pujari, Vineet Padmanabhan, and Vikas Kumar. \"Skyline recommendation with uncertain preferences.\" Pattern Recognition Letters 125 (2019): 446-452. Vikas Kumar, Arun K. Pujari, Vineet Padmanabhan, and Venkateswara Rao Kagita. \"Group preserving label embedding for multi-label classification.\" Pattern Recognition 90 (2019): 23-34. Arun K Pujari, Ansh Mittal, Anshuman Padhi, Anshul Jain, Mukesh Jadon, and Vikas Kumar. \"Debiasing gender biased hindi words with word-embedding.\" In Proceedings of the 2019 2nd International Conference on Algorithms, Computing and Artificial Intelligence, pp. 450-456. 2019. Rasmikanta Pati, Vikas Kumar, and Arun K. Pujari. \"Gradient-based swarm optimization for ICA.\" In Progress in Advanced Computing and Intelligent Engineering, pp. 225-235. Springer, Singapore, 2019. 2018 Vikas Kumar, Arun K. Pujari, Vineet Padmanabhan, Sandeep Kumar Sahu, and Venkateswara Rao Kagita. \"Multi-label classification using hierarchical embedding.\" Expert Systems with Applications 91 (2018): 263-269. 2017 Venkateswara Rao Kagita, Arun K. Pujari, Vineet Padmanabhan, Sandeep Kumar Sahu, and Vikas Kumar. \"Conformal recommender system.\" Information Sciences 405 (2017): 157-174. Vikas Kumar, Arun K. Pujari, Sandeep Kumar Sahu, Venkateswara Rao Kagita, and Vineet Padmanabhan. \"Collaborative filtering using multiple binary maximum margin matrix factorizations.\" Information Sciences 380 (2017): 1-11. Vikas Kumar, Arun K. Pujari, Sandeep Kumar Sahu, Venkateswara Rao Kagita, and Vineet Padmanabhan. \"Proximal maximum margin matrix factorization for collaborative filtering.\" Pattern Recognition Letters 86 (2017): 62-67. 2016 Venkateswara Rao Kagita, Arun K. Pujari, Vineet Padmanabhan, Vikas Kumar, and Sandeep Kumar Sahu. \"Threshold-based direct computation of skyline objects for database with uncertain preferences.\" In Pacific Rim International Conference on Artificial Intelligence, pp. 193-205. Springer, Cham, 2016. K. H. Salman, Arun K. Pujari, Vikas Kumar, and Sowmini Devi Veeramachaneni. \"Combining swarm with gradient search for maximum margin matrix factorization.\" In Pacific Rim International Conference on Artificial Intelligence, pp. 167-179. Springer, Cham, 2016. 2015 Sandeep Kumar Sahu, Arun K Pujari, Venkateswara Rao Kagita, Vikas Kumar, and Vineet Padmanabhan. \"GP-SVM: Tree structured multiclass SVM with greedy partitioning.\" In 2015 International Conference on Information Technology (ICIT), pp. 142-147. IEEE, 2015. Sandeep Kumar Sahu, Arun K Pujari, Vikas Kumar, Venkateswara Rao Kagita, and Vineet Padmanabhan. \"Greedy partitioning based tree structured multiclass SVM for Odia OCR.\" In 2015 Fifth National Conference on Computer Vision, Pattern Recognition, Image Processing and Graphics (NCVPRIPG), pp. 1-4. IEEE, 2015. Funded Projects Project Title: Hybrid Deep Architecture for Semi-Supervised Recommender System Project Duration: 2 years Funding Agency: Science and Engineering Research Board Role: Principal Investigator Status: Ongoing *Soon I will advertise for a Junior Research Fellow (JRF) position. Project Title: Latent Factor Transfer for Cross-Domain Recommendation Project Duration: 2 years Funding Agency: University Grants Commission Role: Principal Investigator Status: Sanctioned Project Title: Semi-Supervised Recommender System Project Duration: 1 year Funding Agency: Faculty Research Programme Grant - IoE, University of Delhi Role: Principal Investigator Status: Ongoing Contact Me Get in Touch If you are interested in collaboration, want to exchange ideas, or have any other professional inquiries, feel free to send me a message! Email Me vikas@cs.du.ac.in Contact Form Send Message Your message has been sent. Thank you! Sorry your message can not be sent.",
  "content_length": 7498,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:38"
}