{
  "name": "Vikas K. Garg 0001",
  "homepage": "https://research.aalto.fi/en/persons/vikas-garg",
  "status": "success",
  "content": "Vikas Garg - Aalto University's research portal Contact expert Vikas Garg Assistant Professor, Department of Computer ScienceAssistant Professor, Computer Science ProfessorsAssistant Professor, Computer Science - Artificial Intelligence and Machine Learning (AIML) - Research areaAssistant Professor, Professorship Garg Vikas Phone+358 50 4639449 20092025 Research activity per year Personal profile Artistic and research interestsMy research interests span both theoretical and applied aspects of Quantum Computing & Artificial Intelligence (AI)/Machine Learning (ML)/Deep Learning (DL). Current focus is on applications in Computational Biology and Healthcare (with an emphasis on protein and drug design), Weather modeling, Material synthesis,  LLMs, and Computer Vision. See https://people.csail.mit.edu/vgarg/ for details and publications. We collaborate widely with academic and industrial experts. In the last few years, I've worked closely with several amazing researchers:List of collaboratorsTommi Jaakkola: PhD supervisor (MIT)Cynthia Rudin: SM supervisor (now at Duke University)Raquel Urtasun:  MS supervisor (now at University of Toronto/Waabi) Regina Barzilay and Stefanie Jegelka (MIT) Adam Kalai and David Alvarez-Melis (Microsoft Research New England)Steven Wu (CMU)Katrina Ligett (Hebrew University and Caltech)John Ingraham (now at Generate Biomedicines)Inderjit Dhillon and Hsiang-Fu Yu (Amazon Research)Lin Xiao (now at Facebook AI Research)Ofer Dekel (Microsoft Research Redmond) Sukrit Shankar and Roberto Cipolla (University of Cambridge)Risi Kondor (University of Chicago)John Lafferty (now at Yale)I'm also Co-Founder and Chief Scientist at YaiYai Oy, a company that provides cutting-edge AI-powered software.Leadership in research workTwo decades of experience in research, teaching, engineering, product development, and supply chain management including stints at leading academic institutes, business schools, and companies such as Amazon Search (A9), Microsoft Research, and IBM Research. Also, Energy Fellow at MIT as well as an active research member of the Machine Learning for Pharmaceutical Discovery and Synthesis Symposium  (https://mlpds.mit.edu/) Some recent innovations have led to advances in diverse domains such as protein design,  physics-informed weather modeling, multi-attribute visual search, fast inference on IoT devices such as smartphones, query recommendation and auto-completion for e-commerce platforms, drug discovery, strategic decision making in multi-agent systems, global supply chain dynamics, and design of smart grids and next generation wireless systems. Multiple patents and publications at premier venues in AI, ML, NLP, Computer Vision, Automation, Energy, etc. (e.g., NeurIPS, ICML, CVPR, AISTATS, UAI, AAAI, IJCAI, TKDE, CIKM, e-Energy, and SmartGridComm). Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationGraduate Research Assistant, MIT CSAIL, Massachusetts Institute of Technology (MIT) External positionsChief Scientist and Co-Founder, YaiYai Oy Fingerprint Dive into the research topics where Vikas Garg is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Graph Neural Network Computer Science 100% Generative Model Engineering 34% Message Passing Computer Science 34% Persistent Homology Computer Science 33% Clustering Algorithm Computer Science 27% on-line algorithm Computer Science 27% Learning Problem Computer Science 25% Parallel Algorithm Computer Science 25% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2009 2024 2025 2025 37 Conference article in proceedings 10 Conference article 4 Article 1 Paper 1 More 1 Review Article Research output per year Research output per year Algebraic Positional EncodingsKogkalidis, K., Bernardy, J.-P. & Garg, V., 2025, Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Globerson, A., Mackey, L., Belgrave, D., Fan, A., Paquet, U., Tomczak, J. & Zhang, C. (eds.). Curran Associates Inc., (Advances in Neural Information Processing Systems; vol. 37).Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open Access Scheme 100% source domain 100% Orthogonal 100% Positional Encoding 100% Structural Property 33% Compositional PAC-Bayes: Generalization of GNNs with persistence and beyondBrilliantov, K., Garg, V. & Souza, A. H., 2025, Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Globerson, A., Mackey, L., Belgrave, D., Fan, A., Paquet, U., Tomczak, J. & Zhang, C. (eds.). Curran Associates Inc., (Advances in Neural Information Processing Systems; vol. 37).Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open Access Graph Neural Network 100% Persistent Homology 100% Vectorization 20% Generalization Performance 20% Topological Feature 20% Diffusion Models as Cartoonists: The Curious Case of High Density RegionsKarczewski, R., Heinonen, M. & Garg, V., 2025, 13th International Conference on Learning Representations, ICLR 2025. Curran Associates Inc., p. 74332-74365 34 p.Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open AccessFile Tracking Process 100% Computational Cost 100% 5 Downloads (Pure) Diffusion Twigs with Loop Guidance for Conditional Graph GenerationMercatali, G., Verma, Y., Freitas, A. & Garg, V., 2025, Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Globerson, A., Mackey, L., Belgrave, D., Fan, A., Paquet, U., Tomczak, J. & Zhang, C. (eds.). Curran Associates Inc., (Advances in Neural Information Processing Systems; vol. 37).Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open Access Performance Gain 100% Diffusion Process 100% Dependent Variable 100% Conditional Generation 100% Molecular Design 100% E(3)-equivariant models cannot learn chirality: Field-based molecular generationDumitrescu, A., Korpela, D., Heinonen, M., Verma, Y., Iakovlev, V., Garg, V. & Lähdesmäki, H., 2025, 13th International Conference on Learning Representations, ICLR 2025. Curran Associates Inc., p. 59765-59799 35 p.Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open AccessFile Benchmarking 100% Point Cloud 100% Parametrization 100% Graph Neural Network 100% Chirality 100% 17 Downloads (Pure) View all 53 research outputs Projects Projects per year 2021 2021 2023 2026 1 Finished 2 Active Projects per year -: Finnish Center for Artificial IntelligenceGarg, V. (Principal investigator)01/01/2023 → 31/12/2026Project: Academy of Finland: Other research funding -: Finnish Center for Artificial IntelligenceGarg, V. (Principal investigator)01/01/2023 → 31/12/2026Project: Academy of Finland: Other research funding Tracking Process 100% Graph Neural Network 100% Computational Cost 100% Neural Network 100% Generative Model 50% HEALED/Garg: Human-steered next-generation machine learning for reviving drug designGarg, V. (Principal investigator), Bickford Smith, F. (Project Member), Mirzaie, N. (Project Member), Verma, Y. (Project Member), Andrzejewski, M. (Project Member), Jain, E. (Project Member), Cunha, T. (Project Member), Laabid, N. (Project Member), Ghaznavi, M. (Project Member), Soltan Mohammadi, N. (Project Member) & Hemmann, L. (Project Member)01/09/2021 → 31/08/2025Project: RCF Academy Project Graph Neural Network 100% Message Passing 46% Persistent Homology 34% Diffusion Model 34% Limitations 23% Press/Media Solujemme sotkuisia ”lankakeriä” avataan nyt helposti – tutkijat löytävät proteiinien avulla lääkkeitä ja entsyymejäGarg, V. & Rousu, J.15/06/20231 item of Media coveragePress/Media: Media appearance Your message has successfully been sent. Your message was not sent due to an error. x Contact Vikas Garg Subject:* Message:* Your name:* Your email:* Send me a copy of this message *required field See privacy policy in the footer of the page Cancel Send",
  "content_length": 8765,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:39"
}