{
  "name": "Vikram Iyer",
  "homepage": "https://homes.cs.washington.edu/~vsiyer",
  "status": "success",
  "content": "Vikram Iyer Vikram Iyer Email: vsiyer@uw.edu Office: Allen Center 648 Mailing Address: Paul G. Allen School of Computer Science and Engineering 185 E Stevens Way NE, Campus Box 352350 Seattle, WA 98195-2350 Google Scholar About Me I am an assistant professor in the Paul G. Allen School of Computer Science and Engineering and co-director of the CS for Environment Initiative. I also have an adjunct appointment in Mechanical Engineering. My group takes an interdisciplinary approach to connect ideas between different engineering domains to build end-to-end systems that push the boundaries of technology, with a particular focus on environmental sustainability. This includes biodegradable and recyclable circuitboards, battery-free robots, batteryless sensors that can disperse in the wind and change shape in mid-air, streaming cameras small enough to ride on the back of live insects, and design tools to evaluate the environmental impact of these devices. A few years ago I also worked closely with the Washington Department of Agriculture to wirelessly track the invasive \"murder\" hornets, which resulted in the destruction of the first nest in the US (featured on Discovery). My work has been recognized by an NSF CAREER Award, a SIGMOBILE Dissertation Award, a Marconi Society Paul Baran Young Scholar award, and best paper awards. Recent News New work on recyclable circuitboards out now in Nature Sustainability Come see our work at CHI'24 on improving crowdsourced labels, AI tools for embedded systems, and Ecological HCI Thanks to Amazon for supporting our work on sustainable polymers Amazon Research Award! Received an NSF CAREER Award for designing battery-free robots DeltaLCA takes a new approach to estimate the environmental impact of circuitboard designs Smart temperature sensing earrings in the news NSF S&CC grant is supporting our work on smart agriculture for community farms We're building tiny robots that can drive without batteries, see the talk at Mobicom 2023 Come see our work on miniaturized flybars for stabilizing tiny helicopters at IROS 2023 New work on battery-free origami microfliers that change shape in mid-air out in Science Robotics Can AI tools like GPT-4 reason about designing and debugging hardware? Turns out they're surprisingly good:https://arxiv.org/abs/2307.03817 Thanks to Google for their support through a Google Research Scholar Award! Thanks to Amazon for supporting our work on designing sustainable electronics and computing devices with an Amazon Research Award! Hornet tracking work published in theJournal of Hymenoptera Research Received SIGMOBILE Dissertation Award Check out our work on circular fabrication and food supply chain sensing at Sensys'22 Dandelion inspired sensors featured in Nature's collection on AI and robotics See our new tiny wireless motion trackers at ICRA 2022 Vicente Arroyos to present our work on designing a sustainable computer mouse with biodegradable materials at CHI New work on battery-free wireless sensors that float in the wind like dandelion seeds published in Nature Featured in \"Attack of the Murder Hornets\", now streaming on Discovery+ Check out our efforts to help the Washington Dept. of Agricalture track invasive Asian Giant Hornets Received the Marconi Society Young Scholar Award Science Robotics paper and focus article on insect-scale steerable wireless cameras (NPR, CNN, CNBC) Publications Recyclable vitrimer-based printed circuit boards for sustainable electronics Zhihan Zhang, Agni K. Biswal, Ankush Nandi, Kali Frost, Jake A. Smith, Bichlien H. Nguyen, Shwetak Patel, Aniruddh Vashisth, Vikram Iyer. Nature Sustainability 2024 [full text] [full text] DeltaLCA: Comparative Life-Cycle Assessment for Electronics Design Zhihan Zhang*, Felix Hähnlein*, Yuxuan Mei*, Zachary Englhardt, Shwetak Patel, Adriana Schulz, Vikram Iyer Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) 2024 [paper] *Co-primary student authors Thermal Earring: Low-power Wireless Earring for Longitudinal Earlobe Temperature Sensing Qiuyue Shirley Xue, Yujia Liu, Joseph Breda, Mastafa Springston, Vikram Iyer, Shwetak Patel Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) 2024 [paper] MilliMobile: An Autonomous Battery-free Wireless Microrobot Kyle Johnson*, Zachary Englhardt*, Vicente Arroyos*, Dennis Yin, Shwetak Patel, Vikram Iyer Mobicom 2023 [paper] *Co-primary student authors Solar-powered shape-changing origami microfliers Kyle Johnson*, Vicente Arroyos*, Amélie Ferran, Raul Villanueva, Dennis Yin, Tilboon Elberier, Alberto Aliseda, Sawyer Fuller, Vikram Iyer, Shyam Gollakota Science Robotics 2023 [paper][preprint] *Co-primary student authors Toward Sub-gram Helicopters: Designing a Miniaturized Flybar for Passive Stability Kyle Johnson*, Vicente Arroyos*, Raul Villanueva*, Adriana Schulz, Sawyer Fuller, Vikram Iyer IROS 2023 [paper] *Co-primary student authors Exploring and Characterizing Large Language Models For Embedded System Development and Debugging Zachary Englhardt, Richard Li, Dilini Nissanka, Zhihan Zhang, Girish Narayanswamy, Joe Breda, Xin Liu, Shwetak Patel, Vikram Iyer [arXiv preprint] Detection and description of four Vespa mandarinia (Hymenoptera, Vespidae) nests in western North America Chris Looney, Brant Carman, Jenni Cena, Cassie Cichorz, Vikram Iyer, Jessica Orr, Nathan Roueché, Karla Salp, Jacqueline M. Serrano, Landon Udo, Paul van Westendorp, Telissa M. Wilson, Rian Wojahn, Sven-Erik Spichiger Journal of Hymenoptera Research Circularity in Energy Harvesting Computational \"Things\" Nivedita Arora, Vikram Iyer, Hyunjoo Oh, Gregory Abowd, Josiah Hester ENSsys 2022 Smart Pallets: Toward Self-Powered Pallet-level Environmental Sensors for Food Supply Chains Ali Saffari, Vikram Iyer, Vaishnavi Ranganathan AgSys 2022 Bio-inspired source seeking and obstacle avoidance on a palm-sized drone Nishant Elkunchwar, Vikram Iyer, Melanie Anderson, Krishna Balasubramanian, Jessica Noe, Yash Talwekar, Sawyer Fuller ICUAS 2022 Towards Sensor Autonomy in Sub-Gram Flying Insect Robots: A Lightweight and Power-Efficient Avionics System Yash Talwekar, Andrew Adie, Vikram Iyer, Sawyer Fuller ICRA 2022 [paper] Eclipse: An End-to-End Platform for Low-Cost, Hyperlocal Environmental Sensing in Cities Madeleine Daepp, Alex Cabral, Vaishnavi Ranganathan, Vikram Iyer, Scott Counts, Paul Johns, Asta Roseway, Charlie Catlett, Gavin Jancke, Darren Gehring, Chuck Needham, Curtis von Veh, Tracy Tran, Lex Story, Gabriele D'Amone, Bichlien Nguyen IPSN 2022 [paper] [air quality map] [video] [demo] A Tale of Two Mice: Sustainable Electronic Design and Prototyping Vicente Arroyos Maria Viitaniemi, Nicholas Keehn, Vaidehi Oruganti, Winston Saunders, Karin Strauss, Vikram Iyer, Bichlien Nguyen CHI 2022 [paper] [poster] [presentation] [video] Wind dispersal of battery-free wireless devices Vikram Iyer, Hans Gaensbauer, Tom Daniel, Shyam Gollakota Nature, March 2022 Closed-loop wearable naloxone injector system Justin Chan, Vikram Iyer, Anran Wang, Alexander Lyness, Preetma Kooner, Jacob Sunshine, Shyam Gollakota Scientific Reports, November 2021 Toward battery-free flight: Duty cycled recharging of small drones Nishant Elkunchwar, Suvesha Chandrasekaran, Vikram Iyer, Sawyer Fuller, IROS, September 2021 Airdropping sensor networks from drones and insects Vikram Iyer, Maruchi Kim, Qiuyue Xue, Anran Wang, Shyam Gollakota Mobicom, September 2020 [paper] [code] Wireless steerable vision for live insects and insect-scale robots Vikram Iyer, Ali Najafi, Johannes James, Sawyer Fuller, Shyam Gollakota Science Robotics, July 2020 [paper][code] TinySDR: Low power SDR Platform for Over-the-Air-Programmable IoT Testbeds Mehrdad Hessar, Ali Najafi, Vikram Iyer, Shyam Gollakota NSDI 2020 [paper] [slides] [code] Living IoT: A Flying Wireless Platform on Live Insects Vikram Iyer, Rajalakshmi Nandakumar, Anran Wang, Sawyer Fuller, Shyam Gollakota Mobicom 2019 [paper] [slides] 3D Localization for Sub-Centimeter Sized Devices Rajalakshmi Nandakumar, Vikram Iyer, Shyam Gollakota Sensys, Nov 2018 [paper] [slides] (Best Paper Award) Wireless Analytics for 3D Printed Objects Vikram Iyer, Justin Chan, Ian Culhane, Jennifer Mankoff, Shyam Gollakota UIST, Oct 2018 [paper] [slides] Liftoff of a 190 mg Laser-powered Aerial Vehicle: The Lightest Wireless Robot to Fly Johannes James, Vikram Iyer, Yogesh Chukewad, Shyam Gollakota, Sawyer Fuller ICRA, May 2018 [paper] Charging a Smartphone Across a Room Using Lasers Vikram Iyer, Elyas Bayati, Rajalakshmi Nandakumar, Arka Majumdar, Shyam Gollakota IMWUT, Dec 2017 [paper] 3D Printing Wireless Connected Objects Vikram Iyer, Justin Chan, Shyam Gollakota SIGGRAPH Asia, 2017 [paper] FM Backscatter: Enabling Connected Cities and Smart Fabrics Anran Wang, Vikram Iyer, Vamsi Talla, Josh Smith, Shyam Gollakota NSDI, 2017 [paper] [slides] Enabling On-Body Transmissions with Commodity Devices Mehrdad Hessar, Vikram Iyer, Shyam Gollakota UBICOMP, 2016 [paper] [slides] Inter-Technology Backscatter: Towards Internet Connectivity for Implanted Devices Vikram Iyer, Vamsi Talla, Bryce Kellogg, Josh Smith, Shyam Gollakota SIGCOMM, 2016 [paper] [slides] (Best Paper Award) FingerIO: Using Active Sonar for Fine-Grained Finger TrackingRajalakshmi Nandakumar, Vikram Iyer, Desney Tan, Shyam Gollakota CHI, 2016 [paper] [slides] (Honorable Mention) Encapsulation of integrated circuits in plastic microfluidic systems using hot embossing Vikram Iyer, Pramod Murali, Jacob Paredes, Dorian Liepmann, Bernhard Boser Transducers, 2015 Students and Mentorship PhD Students Kyle Johnson (NSF Fellowship, Google Scholarship, GEM Fellowship, co-advised with Sawyer Fuller) Vicente Arroyos (GEM Fellowship, Clean Energy Institute Fellowship) Qiuyue (Shirley) Xue (co-advised with Shwetak Patel) Zhihan Zhang (co-advised with Shwetak Patel, Clean Energy Institute Fellowship) Zachary Englhardt (co-advised with Shwetak Patel) Yash Talwekar (advised ",
  "content_length": 10996,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:38"
}