{
  "name": "Viktoria Koscinski",
  "homepage": "https://compsci.colostate.edu/person/?id=06A41A050A82C5D25418B60BAFE4DEEA&sq=t",
  "status": "success",
  "content": "Directory Page – Department of Computer Science | CSU Viktoria Koscinski Assistant Professor Office: Computer Science Building 376 Phone: (000) 000-0000 Website: https://viktoriakoscinski.github.io/Google Scholar: https://scholar.google.com/citations?user=9yMjN7AAAAAJ&hl=en&oi=ao Education PhD, Computing and Information Sciences, Rochester Institute of Technology, 2025MS, Computer and Information Science, SUNY Polytechnic Institute, 2019BS, Computer and Information Science, SUNY Polytechnic Institute, 2018 About My research focuses on improving software security at various stages. From the early development stages, I focus on secure software design within requirements engineering. My work integrates formal methods with machine learning and natural language processing to support rigorous and scalable security analysis. At the later stages, I work on the empirical evaluation of vulnerability management systems and their impact on risk-informed decision-making. Through this interdisciplinary work, I aim to reduce the gap between software engineering and cybersecurity by enabling better secure-by-design and vulnerability management practices. Department of Computer ScienceDepartment Contact Details Map279 Computer Science Building1873 Campus DeliveryFort Collins, Colorado 80523-1873 In-person HoursIn-person Hours:  Mon - Fri: 8:00a - 4:45p TelephoneTelephone: 970-491-6512 EmailEmail: compsci_info@colostate.edu Stay Connected Facebook Instagram Youtube College of Natural SciencesContact Details www.natsci.colostate.edu Departments Biochemistry & Molecular Biology Biology Chemistry Computer Science Mathematics Physics Psychology Statistics Support the College GIVE NOW Contact CSU Apply to CSU Accessibility Statement Disclaimer Equal Opportunity Privacy Statement © Colorado State University - College of Natural Sciences, Fort Collins, CO 80523",
  "content_length": 1868,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:46"
}