{
  "name": "Viktoria Pammer-Schindler",
  "homepage": "https://viktoriapammer.wordpress.com",
  "status": "success",
  "content": "Viktoria Pammer-Schindler | Designing interactive systems from a socio-technical and learning perspective Analia Cicchinelli and Viktoria Pammer-Schindler (Graz University of Technology & Know-Center GmbH) Professional Technology-Enhanced Learning is concerned with technology-enhanced learning for professionals, i.e. people in employed jobs. Other terms used instead of professional learning are sometimes workplace learning or work-related learning; and there is a large overlap with research that focusses on informal, situated, or lifelong learning. To support my own research on professional technology-enhanced learning (e.g., Pammer-Schindler, 2019; Pammer-Schindler & Rosé, 2021; Wolfbauer et al., 2022; , I have set out to systematically collect academic publications in the field, together with Analia Cicchinelli (first author of this post). We have collected academic publications that discuss professional technology-enhanced learning, following essentially Kitchenham and Charter’s (2007) method for systematic literature reviews. We have published the resulting data as a collection (list) of academic papers here as a CSV file and additionally as a PDF file for better human readability: https://zenodo.org/record/7957206 This CSV file contains all above details on data collection, and contains 58 papers, for which we list authors (one, two or three author surnames fully shown, for more authors, only the first author name is shown with the extension “et al.”), title, DOI or permanent link, the citation as given by the source, and the abstract as separate columns. We hope that others find this data useful, and if they do so reference this data collection, referring to it as follows: Cicchinelli and Pammer-Schindler (2023). Professional Technology Enhanced Learning: A Systematically Collected Dataset of Academic Publications in the Field. https://viktoriapammer.wordpress.com/2023/03/28/professional-tel-systematically-collected-dataset/ Further, I am maintaining for now a living document version of this data at Google Docs. If you know of a paper that you think fits our above criteria, please contact me by email. I will then review the paper (not content-wise, just regarding the above criteria), and if it fits, will include it. Reference: Kitchenham, B., & Charters, S. (2007). Guidelines for performing Systematic Literature Reviews in Software Engineering. 2. Pammer-Schindler, V. Designing Data-Driven and Adaptive Technologies for Reflective Learning in the Workplace. Habilitation thesis, Graz University of Technology, 2019 Pammer-Schindler, V. & Rosé, C. Data-Related Ethics Issues in Technologies for Informal Professional Learning. International Journal of Artificial Intelligence in Education, 2021. DOI: https://doi.org/10.1007/s40593-021-00259-x Wolfbauer, I., Pammer-Schindler, V., Maitz, K. & Rosé, C. A Script for Conversational Reflection Guidance: A Field Study on Developing Reflection Competence with Apprentice. IEEE Transactions on Learning Technologies, 2022, Vol. 15, No. 5, p. 554-566. DOI: https://doi.org/10.1109/TLT.2022.3207226 This is to document that I’ve arranged my web-presence, such that https://www.staff.tugraz.at/viktoria.pammer-schindler is my personal professional Website.https://viktoriapammer.wordpress.com is my (irregular) blog.My professional Twitter presence is @viktoriapammer . Designing technologies for workplace learning is the absolutely major part of my research. But what can technologies do for learning? I don’t know of authoritative literature that categorises the different roles and functions of technologies in learning activities – so over time I’ve created a brief overview for myself. The below listed categories of technologies are not completely mutually exclusive. For instance, technologies that support the consumption of digital learning materials might as well be game technologies; and simulations may also support communication, etc. Additionally, while categories are intended to be exhaustive, in detail one could argue about additions: For instance, open learner modeling is now subsumed in both data analytics and intelligent systems, as open learner modeling in the end has been decided to be a more fine-granular term than the others in the list. Another example is e-Assessment, which has been left out as simple question-based assessment is technologically not research-intensive, although it may be very much from a learning sciences perspective!; and task-based or implicit assessment fits into multiple categories such as game technologies or virtual simulations or data analytics. Finally, infrastructure and device technology necessary to actually access content and run software for learning, such as network infrastructures or mobile devices have not been listed at all. Nonetheless, these of course play a key role in enabling technology-enhanced learning. References, where included, have been selected to be relatively modern and introductory to the category. Technologies support the documentation of learning activities and resultsTechnologies support the distribution and consumption of digital learning materials (including learning management systems, MOOCs)Communication technologies and social software featuressupport discussions between learners as well as between learners and teachers (cp. Stahl et al., 2014).Virtual simulations support experimentation that is safer, sometimes cheaper, or even impossible in reality (cp. de Jong, 1991).Data analytics are used to derive insights about learning activities and results from all kinds of sources for a wide variety of stakeholders. This includes learners, who shall be supported in learning; teachers, who shall be supported in teaching; and institutions, who shall be supported in institutional decision making thereby impacting learning (cp. Siemens, 2013). Intelligent technologies proactively recommend learning materials and relevant people and guide learning activities in complement or as substitute to human teachers (recommender systems – cp. Manouselis et al., 2010; intelligent tutoring – see Baker, 2016 for a critical discussion that includes an overview of intelligent tutoring literature).Gaming technologies finally design for learning in a playful environment (serious games or learning games – cp. van Eck , 2006 for an overview). (Baker, 2016) Baker, R. Stupid Tutoring Systems, Intelligent Humans. International Journal of Artificial Intelligence in Education, 2016, Vol. 26/2, p.600-614. (de Jong, 1991) De Jong, T. Learning and instruction with computer simulations. Education and Computing, 1991, Vol. 6/3, p. 217-229. (Manouselis et al., 2010) Manouselis, N.; Drachsler, H.; Vuroikari, R.; Hummel, H. & Koper, R. Recommender Systems in Technology Enhanced Learning. Recommender Systems Handbook, Springer, 2010, p. 387-415. (Siemens, 2013) Siemens, G. Learning Analytics: The Emergence of a Discipline. American Behavioral Scientist, 2013, Vol. 57, No. 10, p. 1380-1400. (Stahl et al., 2014) Stahl, G., Koschmann, T. & Suthers, D. Computer-Supported Collaborative Learning. The Cambridge Handbook of the Learning Sciences, Cambridge University Press, Ch.24, p. 479-500, 2014. (van Eck, 2006) Van Eck, R. Digital Game-Based Learning: It’s Not Just the digital Natives Who Are Restless. Educause Review, 2006, Vol 41/2, p.16-30. Yesterday I held a keynote in the Digital Business Trends Event Series. My talk drew strongly from activity theory and communities of practice as theoretical background of understanding human activity and the role of tools, and of human development, and embedding in social contexts. Key points of my talk are described (in German) in the DBT Blog: http://www.dbt.at/Site/We_are_designers___Wir_gestalten_unser_Leben_mit_und.de.html. In short, I think that we need to frame the discussion around artificial intelligence as starting from the question: What are our goals and values – as individuals, as organisations, and as society. Secondly, we need to create – at all these levels – an understanding of how artificial intelligence can contribute to these goals. This necessitates both a technical understanding (without everyone of us needing to become artificial intelligence experts, data analysts or data scientists), a business understanding of what these technologies could mean for an organisation, and a societal understanding of wider implications. Finally, we need to understand technologies in their social context – so we need to consider and keep an eye open on impact on the whole sociotechnical system. At all levels, we therefore need to develop on the one hand self-efficacy in relationship to artificial intelligence technologies; and leading towards this, we need to develop the competence to understand artificial intelligence in relationship to our goals and values. We will not be able to solve everything at either level: individual, organisation or society – but we are designers of our life with artificial intelligence (or without it) at all these levels; not only as software developers and developing organisations, but also as users and user organisations. What is Activity Theory? Activity Theory was originally developed by Russian psychologists; first and foremost Vygotsky and Leontjew. Activity Theory is a descriptive, theoretical framework; it provides a terminology and structure for thinking about human activities, taking some particular philosophical stances. Activity Theory explores human activities; it explores “practice”, how things are done. As computer technology pervades humans´ lives; having come out of the laboratories and backrooms since quite some time now, human-computer interaction becomes relevant – with the actual usage, usefulness, and integration of techology into the practice of humans taking an important place in HCI discourse. What is an activity? Activities are the central unit of analysis and thought in activity theory. An activity is directed towards an object or objective. The object is wha",
  "content_length": 26361,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:47"
}