{
  "name": "Viktor Leis",
  "homepage": "https://www.cs.cit.tum.de/dis/team/prof-dr-viktor-leis",
  "status": "success",
  "content": "Prof. Dr. Viktor Leis - Decentralized Information Systems and Data Management Prof. Dr. Viktor Leis Address: Boltzmannstr. 3, 85748 Garching Room: 01.06.054 Phone: +49 (89) 289 - 19452 E-Mail: leis(at)in.tum.de   Photo: Astrid Eckert / TUM Bio Viktor Leis is a professor in the Computer Science Department at TUM, leading the chair for Decentralized Information Systems and Data Management. His research revolves around designing cost-efficient data systems for the cloud and includes core database systems topics such as query processing, query optimization, transaction processing, index structures, and storage. He contributed to the development of the main-memory database system Hyper (acquired by Tableau/Salesforce) and the NVMe-optimized storage engine LeanStore. Viktor Leis earned his doctoral degree from TUM in 2016 and was a professor at the universities in Jena and Erlangen before returning to TUM in 2022. His work has been recognized with the ACM SIGMOD dissertation award, the VLDB Early Career Research Contribution Award, and an ERC Starting Grant. Selected Papers Virtual-Memory Assisted Buffer ManagementViktor Leis, Adnan Alhomssi, Tobias Ziegler, Yannick Loeck, Christian DietrichSIGMOD 2023Towards Cost-Optimal Query Processing in the CloudViktor Leis, Maximilian KuschewskiPVLDB 2021LeanStore: In-Memory Data Management beyond Main MemoryViktor Leis, Michael Haubenschild, Alfons Kemper, Thomas NeumannICDE 2018How Good Are Query Optimizers, Really?Viktor Leis, Andrey Gubichev, Atanas Mirchev, Peter A. Boncz, Alfons Kemper, Thomas NeumannPVLDB 2015The Adaptive Radix Tree: ARTful Indexing for Main-Memory DatabasesViktor Leis, Alfons Kemper, Thomas NeumannICDE 2013 New Papers AnyBlox: A Framework for Self-Decoding DatasetsMateusz Gienieczko, Maximilian Kuschewski, Thomas Neumann, Viktor Leis, Jana GicevaVLDB 2025SQLStorm: Taking Database Benchmarking into the LLM EraTobias Schmidt, Leis Viktor, Peter Boncz, Thomas NeumanVLDB 2025SSD-iq: Uncovering the Hidden Side of SSD Performance Gabriel Haas, Bohyun Lee, Philippe Bonnet, Viktor LeisVLDB 2025OLTP in the Cloud: Architectures, Tradeoffs, and CostMichael Haubenschild, Viktor LeisVLDB Journal 2025Cloud-Native Database Systems and Unikernels: Reimagining OS Abstractions for Modern HardwareViktor Leis, Christian DietrichVLDB 2024A Critique of Modern SQL and a Proposal Towards a Simple and Expressive Query LanguageThomas Neumann, Viktor LeisCIDR 2024Incremental Fusion: Unifying Compiled and Vectorized Query ExecutionBenjamin Wagner, Andre Kohn, Peter Boncz, Viktor LeisICDE 2024Efficient and Portable Einstein Summation in SQLMark Blacher, Joachim Giesen, Julien Klaus, Christoph Staudt, Sören Laue, Viktor LeisSIGMOD 2023 Links Google Scholar profile DBLP profile Blog (Database Architects, with Thomas Neumann) To top I13/DIS - Chair for Decentralized Information Systems and Data Management Prof. Dr. Viktor Leis Technical University of Munich Boltzmannstr. 3 85748 Garching Germany sekretariat@dis.cit.tum.de phone: +49 (89) 289 18486",
  "content_length": 3028,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:46"
}