{
  "name": "Vili Lehdonvirta",
  "homepage": "https://www.aalto.fi/en/people/vili-lehdonvirta",
  "status": "success",
  "content": "Vili Lehdonvirta | Aalto University People Vili Lehdonvirta Professor Department of Computer Science Full researcher profile https://research.aalto.fi/... Email vili.lehdonvirta@aalto.fi Postal address Konemiehentie 2 02150 Espoo Finland Phone number +358504702707 Research groups Computer Science Professors, Professor Professorship Lehdonvirta Vili, Professor Publications Compute North vs. Compute South : The Uneven Possibilities of Compute-based AI Governance Around the Globe Vili Lehdonvirta, Boxi Wu, Zoe Hawkins 2025 Proceedings Of The Seventh AAAI/ACM Conference On AI, Ethics, And Society, AIES 2024 Weaponised interdependence in a bipolar world : how economic forces and security interests shape the global reach of US and Chinese cloud data centres Vili Lehdonvirta, Boxi Wú, Zoe Hawkins 2025 Review of International Political Economy Resolving disputes in mediated “gig” work : How marketplace structure influences the impartiality of dispute handling by labor market intermediaries Greetje F. Corporaal, Vili Lehdonvirta 2024 New Technology, Work and Employment Social Media, Web, and Panel Surveys Pekka Räsänen, Atte Oksanen, Vili Lehdonvirta, Grant Blank 2024 Advanced Research Methods for Applied Psychology The future of unpaid work Ekaterina Hertog, Setsuya Fukuda, Rikiya Matsukura, Nobuko Nagase, Vili Lehdonvirta 2023 Technological Forecasting and Social Change The future(s) of unpaid work Vili Lehdonvirta, Lulu P. Shi, Ekaterina Hertog, Nobuko Nagase, Yuji Ohta 2023 PloS One Labour market digitalization and social class Nicholas Martindale, Vili Lehdonvirta 2023 Socio-Economic Review Dynamics of contention in the gig economy Alex J. Wood, Nicholas Martindale, Vili Lehdonvirta 2023 New Technology, Work and Employment Platforms Disrupting Reputation Alex J. Wood, Vili Lehdonvirta 2023 Sociology ICTs and the urban-rural divide Fabian Braesemann, Vili Lehdonvirta, Otto Kässi 2022 Information Communication and Society",
  "content_length": 1949,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:50"
}