{
  "name": "Ville Mustonen",
  "homepage": "https://researchportal.helsinki.fi/en/persons/ville-mustonen",
  "status": "success",
  "content": "Ville Mustonen - University of Helsinki Ville Mustonen Professor Professor, Organismal and Evolutionary Biology Research ProgrammeProfessor, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿Bioinformatics https://orcid.org/0000-0002-7270-1792 Phone+358503116206, +358294159602Emailv.mustonenhelsinkifi FinlandPL 56 (Viikinkaari 9)00014Finland 20172025 Research activity per year Personal profile Fields of Science113 Computer and information sciencesBioinformaticsEvolutionMachine learning1181 Ecology, evolutionary biologyPopulation geneticsExperimental evolution1184 Genetics, developmental biology, physiologyDrug resistance Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2017 2020 2025 34 Article 2 Review Article 1 Letter Research output per year Research output per year Pre-exposure of abundant species to disturbance improves resilience in microbial metacommunitiesCairns, J., Hogle, S., Alitupa, E., Mustonen, V. & Hiltunen, T., Mar 2025, In: Nature Ecology & Evolution. 9, 3, p. 395-405Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Turnover shapes evolution of birth and death ratesKuosmanen, T., Särkkä, S. & Mustonen, V., Aug 2025, In: Evolution. 79, 8, p. 1456-1468 13 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Using FFPEsig to Remove Formalin-Induced Artifacts and Characterize Mutational Signatures in CancerGuo, Q., Baker, A. M., Mustonen, V. & Graham, T. A., 2025, In: Methods in molecular biology (Clifton, N.J.). p. 125-136 12 p.Research output: Contribution to journal › Article › Scientific › peer-review Crowd-sourced benchmarking of single-sample tumor subclonal reconstructionPCAWG Evolution and Heterogeneity Working Group, SMC-Het Participants, Salcedo, A., Tarabichi, M., Buchanan, A., Espiritu, S. M. G., Zhang, H., Zhu, K., Ou Yang, T. H., Leshchiner, I., Anastassiou, D., Guan, Y., Jang, G. H., Mootor, M. F. E., Haase, K., Deshwar, A. G., Zou, W., Umar, I., Dentro, S. & Wintersinger, J. A. & 32 others, Chiotti, K., Demeulemeester, J., Jolly, C., Sycza, L., Ko, M., Van Loo, P., Wedge, D. C., Spellman, P. T., Morris, Q. D., Wang, W., Zhu, H., Yuan, K., Yao, X., Yang, T. P., Wheeler, D. A., Vembu, S., Vázquez-García, I., Spiro, O., Stein, L. D., Shin, S. J., Shi, R., Sengupta, S., Schumacher, S., Schlesner, M., Sahinalp, S. C., Rosebrock, D., Raphael, B. J., Peto, M., Peifer, M., Oesper, L., Mustonen, V. & Mitchell, T. J., May 2024, In: Nature Biotechnology.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Quantifying massively parallel microbial growth with spatially mediated interactionsBorse, F., Kičiatovas, D., Kuosmanen, T., Vidal, M., Cabrera-Vives, G., Cairns, J., Warringer, J. & Mustonen, V., Jul 2024, In: PLoS Computational Biology. 20, e1011585.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile View all 37 research outputs Projects Projects per year 2024 2024 2026 1 Active Projects per year AMR CoE: Multidisciplinary center of excellence in antimicrobial resistance researchMustonen, V. (Project manager), Cairns, J. (Participant), Kiciatovas, D. (Participant), Kivikoski, M. (Participant), Kuosmanen, T. V. (Participant), Lau, C. W. (Participant) & Sun, T. A. (Participant)Academy of Finland01/01/2024 → 31/12/2026Project: Research Council of Finland: Centre of Exellence",
  "content_length": 3834,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:50"
}