{
  "name": "Vimala Balakrishnan",
  "homepage": "https://umexpert.um.edu.my/vimala-balakrishnan",
  "status": "success",
  "content": "UMEXPERT - PROF. TS. DR. VIMALA A/P BALAKRISHNAN PROF. TS. DR. VIMALA A/P BALAKRISHNAN Department of Information System Faculty of Computer Science and Information Technology vimala.balakrishnanum.edu.my View CV View 1-Page CV Publons Scopus Link Biography Ts Dr. Vimala Balakrishnan is a Professor affiliated with the Faculty of Computer Science and Information Technology, Universiti Malaya since 2010. She earned her PhD in Ergonomics from Multimedia University, complementing her academic journey that commenced with Master's and Bachelor's degrees obtained from the University of Science Malaysia. Dr. Balakrishnan's primary research focus lies in the domains of machine learning and deep learning, particularly in data analytics, with a specialized emphasis on social media applications. Her research interests span across diverse sectors, including healthcare and critical social issues like cyberbullying, suicide and misinformation propagation. She has published more than 100 articles in top indexed journals, 60 conference proceedings and eight book chapters, has three patents and sixteen copyrights. She is a Fulbright Research Scholar (2018) and a recipient of the Leadership in Innovation Fellowship (by the Royal Academy of Engineering, UK) award. Others include Malaysia Scopus Excellence Research Award 2024 -Societal Impact, Excellent Service Award 2017 & 2024, Cardiff Incoming Visiting Fellowship Scheme 2017, Best Elsevier Reviewer Award 2018 (Computer in Human Behavior), and awards won both at local and international competitions (three diamonds, 22 golds, 8 silvers and 4 bronze). Dr Balakrishnan is an advocate for women in science, and acts as the founder of HeRDS: Heels and Rouge in Data Science and co-founder of the Community of Practice in Research (Hello@UM). She was also listed as one of the top 2% world scientists by the Stanford University in five consecutive years (2020 - 2024), both in the single year and career categories. Dr Balakrishnan was recently recognized as one of the Successful People in Malaysia in the June 2022 issue as part of the British Media Publishing House publication. She teaches both the undergraduate and post-graduate students at the faculty. She has supervised ten PhD students, three Master by Research and 22 Master by Mixed-mode students to completion. Dr. Balakrishnan is currently supervising five PhD students, and two Master by Research students. She also supervises Master of Data Science students, and has served as the Program Coordinator for four consecutive years (2017 - 2021). Dr. Balakrishnan serves as the Editor-in-Chief to the Malaysian Journal of Computer Science. She serves as an active reviewer for several International journals, and as an external examiner for PhD thesis (e.g. International University of Malaya-Wales, Kolej Damansara Penang, Maynooth University Ireland, Modi Institute India, etc.). Dr. Balakrishnan also acts as the Program Assessor for HELP University (Master in Data Science and Bachelor in IT Data Analytics), Monash University (Bachelor in Applied Data Science), Multimedia University (Bachelor in Digital Analytics Management) and International Medical University Malaysia (Bachelor in Digital Health). She has given guest lectures at Yale University (2022), University of Georgia (2018), and Georgia Technology of Institute (2018), USA, Cardiff University (2017), UK, Soongsil University (2016), Korea, and as a Keynote Speaker at the Artificial Intelligence and Data Engineering 2019 Conference (India). She has appeared in the local media (BFM Radio Malaysia, TV3), local newspapers and magazine (The Star, Berita Harian, Her World), podcasts, YouTube and served as an expert advisor in a round table session (Communications and Multimedia Content Forum Malaysia) on cyberbullying detection mechanisms. Currently, she is actively working on innovative solution-based projects related to digital health platforms including developing an integrated VOT enabled app for Tuberculosis management, MyTBCompanion through her Projek Celik TB (funded by the Research and Innovation for Development in ASEAN UK & Fulbright Alumni Engagement Fund 2024) and a chatbot for HIV minority communities with her international collaborators from Yale University (funded by Gilead Inc. amounting to 499,000 USD). Other on-going studies include developing and detecting digital fraud/scam (funded by the Fundamental Research Grant Scheme 2023 (Ministry of Higher Education Malaysia) and SATU Joint-Research Scheme 2023). Hide Collaborator azahnorman liyanashuib sitihafizah raida sdevi tehyw azy_mn lohsch rumana yinkia norisma saaidal fazmidar maizatul mdnazari View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status A Holistic Cyber Scam Susceptibility Model Based On Psychological Individual Differences on going Digital Literacy, Misinformation And Scamming: An Asian Perspective end Revolutionizing Tuberculosis Care Among Low-income Patients In Southeast Asia Through A Multi-lingual Asynchronous Video Observed Therapy Integrated Mhealth Application end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Chapter in book Proceeding 2025 Emotionally Tough, Sexting Rough: Relationship Between Callous Unemotional Traits and Aggravated Sexting in 11 Countries 2025 A two-stage forecasting model using random forest subset-based feature selection and BiGRU with attention mechanism: Application to stock indices 2025 Personal, environmental and behavioral predictors associated with online fraud victimization among adults 2025 A decade's overview of artificial intelligence in diagnosing: a scoping review 2021 Women&#39;s emotional health and support in a time of crisis 2019 Collaboration Made Easy with the Collaborators in Action Tool: A Case Study on the Probability and Statistics Course 2017 SentI-Cal: Sentiment Intensity Calculator 2016 Mobile Technology and Interactive Lectures: The Key Adoption Factors, 2020 ICITS 2020 6th International Conference on Information Technology & Society 2020 Socio-demographic Impact on Digital Payment Adoption among Malaysian Users 2020 Sentiment and Emotion Analyses for Malaysian Mobile Digital Payment Applications 2019 SSA-SDA: Subjectivity and Sentiment Analysis of Sudanese Dialect Arabic",
  "content_length": 6559,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:52"
}