{
  "name": "Vinayak Abrol",
  "homepage": "https://www.iiitd.ac.in/vabrol",
  "status": "success",
  "content": "IIIT-Delhi Skip to main content -A A A+ AA Vinayak Abrol Vinayak Abrol Assistant Professor (CSE) PhD (2018), IIT Mandi Contact Details 011-26907543 abrol@iiitd.ac.in Web Profile B-409 (R&D Block) Profile Prior to this he held Oxford-Emirates data science fellowship at Mathematical Institute, University of Oxford (10/2018-12/2020), position of Academic Advisor at Kellogg college Oxford (7/2019-12/2020) and SNSF funded postdoctoral position at IDIAP research Institute, Switzerland (2/2018-10/2018). He received his TCS Innovation Labs funded Ph.D from School of Computing and Electrical engineering, IIT Mandi, India in 2018; following M.E and B.E in electronics and communication engineering from Panjab University Chandigarh, India in 2013 and 2011, respectively. His research focuses on the design, and analysis of numerical algorithms for information inspired applications, which is multi-disciplinary and lies at an intersection of Engineering, Maths and Computer Science. On the theoretical front he is currently working on developing theories of deep learning using tools from random matrix theory, and information theory, where as on the applied front his research interest is in area of speech/audio analytics on problem such as acoustic modelling and coding, voice biometrics, pathological speech and audio categorization. His research has been disseminated in several internationally reputed journals and conferences, including JASA, IEEE TASLP/TMM, Elsevier Speech Communication/CSL/PRL, ICML, NIPS, INTERSPEECH, and ICASSP. Network: Infosys Centre for AILab: Cross-Caps - https://bit.ly/38UqDk1 Research Interests Acoustic modelling and coding Voice biometrics Pathological speech and audio categorization Teaching Interests Theories of Deep Learning Machine Learning Speech and Audio Processing Affiliated Centres & Labs",
  "content_length": 1837,
  "method": "requests",
  "crawl_time": "2025-12-01 14:43:59"
}