{
  "name": "Vincent P. Wade",
  "homepage": "https://www.tcd.ie/research/profiles/?profile=vwade",
  "status": "success",
  "content": "Vincent Wade'Trinity Research - Trinity College Dublin Professor Vincent Wade Professor of Computer Science (1990), Computer Science vincent.wade@tcd.ie +353 1896 2091 people.tcd.ie/vwade Biography Prof Vincent Wade Resume Vincent holds the established Professorial Chair of Professor Computer Science (Est. 1990) and a personal Professorial Chair in Artificial Intelligence in the School of Computer Science and Statistics, in Trinity College Dublin (TCD), University of Dublin. He was awarded a BSc (Hons) in Computer Science (UCD), an MSc (by research) from (TCD) and PhD (TCD 2006). In 2002, he was awarded Fellowship of Trinity College (FTCD) for his contribution to research in the areas of web based personalisation and AI driven adaptive technologies. In 2018, Vincent was awarded the prestigious \"Provost Innovation Award\" in TCD which is the highest accolade the university can bestow on an academic for outstanding contribution to research and innovation throughout their career. Vincent co-founded the Centre of Next Generation Language Technology (CNGL) in 2007, and was its Director from 2011-2015. In 2015 Vincent co-founded the ADAPT SFI Research Centre for AI driven Digital Media Technology (which encapsulated CNGL). He was Director of the Centre from its inception in 2015 until 2021 (https://www.adaptcentre.ie/). Under his direction, the ADAPT SFI Research, has become a world leading multi-institutional, inter-disciplinary research centre focusing on Human Centric AI and Media Technologies In 2010, Vincent founded the Learnovate Centre (Centre for Applied research in Learning Technology), funded under Enterprise Ireland Applied Research Centre Programme, where he was acting Director (2010-2012) and the Academic Director (2011-2018) where he was responsible for its research strategy and direction (https://www.learnovatecentre.org/). Research Interests Vincent's research focuses on knowledge and data driven AI models, generative AI and personalisation of all forms of digital media (text, multimedia, dialog). His research employs different machine learning and reasoning techniques across different facets or dimensions of the user and his/her context. His research includes aspect such as dynamic media generation and personalisation, personalised conversational agents, intelligent data analytics. His research has been applied in key areas such as Education and Healthcare. Distinctions and Awards He has authored over three hundred and fifty scientific papers in peer reviewed research journals and international conferences and has received seven best paper awards at international conferences (IEEE, ACM, AACE). Other awards include the European Language Label Award for innovation in Language Learning Technology 2010 and European Language Label Award for AILO (2020). He holds two international patents in the areas of web based personalisation and AI driven media generation. He has won over EURO 150M in research grants from SFI, EI, EU and industry awards. He co-founded EmpowerTheUser (ETU) in 2010 based on his research in personalisation and educational technology which was recently acquired by an international investment company for approx $50M. Vincent has served as editor for many international journals e.g. IEEE Communications and has been General & Scientific Programme Chair for many international conferences including IEEE/IFIP Integrated Management Symposium 2011, ACM Adaptive Hypermedia 2006. He has served in leadership positions (Workshop Chair, Tutorial Chair etc.) in over forty international conference organising committees and approximately ninety scientific programme committees. He is regularly invited as keynote speaker at international conferences (e.g. ACM UMAP 2009, ICWL 2012) as well as a keynote/guest speaker at multiple industry/research conferences. Research Supervision Vincent has supervised to successful completion 40 postgraduate research students, 27 PhD and 13 MSc (solely by research). He has supervised over 60 MSc dissertations across seven postgraduate taught programmes. Publications and Further Research Outputs Peer-Reviewed Publications Non-Peer-Reviewed Publications Peer-Reviewed Publications Xiao, Q., Pitt, B., Johnston, K., Wade, V. , Multi-dimensional Learner Profiling by Modeling Irregular Multivariate Time Series with Self-supervised Deep Learning, Artificial Intelligence in Education AIED 2023, The International Conference on Artificial Intelligence in Education (AIED), Tokyo, Japan, July 3-7, 2023, edited by Wang, N., Rebolledo-Mendez, G., Matsuda, N., Santos, O.C., Dimitrova, V. (eds) , 13916, Springer, Cham, 2023, pp674 - 680 Conference Paper, 2023 DOI McFarlane R, Galvin M, Heverin M, Mac Domhnaill É, Murray D, Meldrum D, Bede P, Bolger A, Hederman L, Impey S, Stephens G, O'Meara C, Wade V, Al Chalabi A, Chiò A, Corcia P, van Damme P, Ingre C, McDermott C, Povedanos M, van den Berg L, Hardiman O., PRECISION ALS-an integrated pan European patient data platform for ALS., Amyotroph Lateral Scler Frontotemporal Degener., 2023 Journal Article, 2023 Soni, M. and Cowan, B.R. and Wade, V., Enhancing Self-disclosure In Open-Domain Dialogue By Candidate Re-ranking, Lecture Notes in Electrical Engineering, 943, 2022, p243-252 Journal Article, 2022 DOI Bleakley, A. and Rough, D. and Edwards, J. and Doyle, P. and Dumbleton, O. and Clark, L. and Rintel, S. and Wade, V. and Cowan, B.R., Bridging social distance during social distancing: exploring social talk and remote collegiality in video conferencing, Human-Computer Interaction, 2021 Journal Article, 2021 DOI Yousuf, B., Conlan, O., Wade, V., Assessing the impact of the combination of self-directed learning, immediate feedback and visualizations on student engagement in online learning, Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 12315 LNCS, 2020, p274-287 Journal Article, 2020 Bleakley, A. and Wade, V. and Cowan, B.R., Finally a Case for Collaborative VR?: The Need to Design for Remote Multi-Party Conversations, (3406144), 2020 Conference Paper, 2020 TARA - Full Text DOI Spillane, Brendan and Hoe, Isla and Brady, Mike and Wade, Vincent and Lawless, Séamus, Tabloidization versus Credibility: Short Term Gain for Long Term Pain, CHI - The ACM Conference on Human Factors in Computing Systems, Honolulu, Hawai'i, USA, 25-30 April 2020, ACM, 2020 Conference Paper, 2020 TARA - Full Text URL DOI Spillane, Brendan and Saam, Christian and Gilmartin, Emer and Cowan, Benjamin R. and Wade, Vincent, ADELE: Evaluating and Benchmarking an Artificial Conversational Care Agent, CHI 2020 Workshop - Conversational Agents for Health and Wellbeing, Honolulu, Hawai'i, USA, 26 April 2020, 2020, pp5 Conference Paper, 2020 URL TARA - Full Text Spillane, Brendan and Lawless, Séamus and Wade, Vincent, The Impact of Increasing and Decreasing the Professionalism of News Webpage Aesthetics on the Perception of Bias in News Articles, HCII 2020 - The 22nd International Conference on Human-Computer Interaction, Copenhagen, Denmark, 19-24 July 2020, Springer, 2020 Conference Paper, 2020 TARA - Full Text Clark, L. and Pantidi, N. and Cooney, O. and Doyle, P. and Garaialde, D. and Edwards, J. and Spillane, B. and Gilmartin, E. and Murad, C. and Munteanu, C. and Wade, V. and Cowan, B.R., What makes a good conversation? Challenges in designing truly conversational agents, 2019 Conference Paper, 2019 TARA - Full Text URL DOI Braca, Annye and Spillane, Brendan and Wade, Vincent and Dondio, Pierpaolo, Pilot Data Collection Survey and Analytical Techniques for Persuasion Engineering Systems},, DiGo - Dialog for Good - Workshop on Speech and Language Technology Serving Society, Stockholm, Sweden, 10 September 2019, 2019 Conference Paper, 2019 TARA - Full Text URL Eamon Costello, Keith Johnston & Vincent Wade, Crowded house: an analysis of how the Virtual Learning Environment Moodle is built via bug tracker participants, Interactive Learning Environments , 31, (5), 2019, p2583 - 2593 Journal Article, 2019 DOI Clarke R.S, Wade V, Distributed intelligent client-centric personalisation, LNCS, International Conference on Web Engineering, 2019, pp1- Conference Paper, 2019 DOI URL Spillane, Brendan and Gilmartin, Emer and Saam, Christian and Wade, Vincent, Issues Relating to Trust in Care Agents for the Elderly, Conversational User Interfaces, Dublin Ireland, 22-23 August 2019, ACM, 2019, pp1 - 3 Conference Paper, 2019 DOI TARA - Full Text Other URL Gilmartin, Emer and Maria O'Reilly and Christian Saam and Benjamin Cowan and Carl Vogel and Nick Campbell and Vincent Wade, Silence and overlap in chat and chunk phases of multiparty casual conversation, 9th International Conference on Speech Prosody 2018, Poznań, Poland, 13-16 June 2018, 2018, pp379-838 Conference Paper, 2018 URL DOI TARA - Full Text Spillane, Brendan and Lawless, Séamus and Wade, Vincent, Increasing and Decreasing Perceived Bias by Distorting the Quality of News Website Design, Proceedings of the 32nd British HCI Group Annual Conference on People and Computers:, British HCI 2018, Belfast, Northern Ireland, 2-6 July 2018, BCS Learning & Development Ltd, 2018, pp1 - 13 Conference Paper, 2018 TARA - Full Text DOI URL Brendan Spillane, Séamus Lawless, Vincent Wade, Increasing and Decreasing Perceived Bias by Distorting the Quality of News Website Design, 32nd British Human Computer Interaction Conference, BCS HCI 2018, Belfast, Northern Ireland, 2nd-6th July, 2018 Conference Paper, 2018 TARA - Full Text Spillane B, Gilmartin E, Saam C, Cowan B.R, Wade V, ADELE: Care and companionship for independent aging, CEUR Workshop Proceedings, 2018, 2338, 2018, pp18 - 24 Conference Paper, 2018 Other TARA - Full Text URL URL Gilmartin, Emer and Brendan Spillane and Christian Saam and Carl Vogel and Nick Campbell and Vincent Wade, Stitching together the conversation - considerations in the design of extended social talk, 9th INTERNATIONAL WORKSHOP ON SPO",
  "content_length": 94842,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:11"
}