{
  "name": "Vincent Danos",
  "homepage": "http://www.di.ens.fr/~danos",
  "status": "success",
  "content": "Vincent Danos Vincent Danos - ENS homepage Directeur de Recherches at CNRS, at the Departement d'Informatique of ENS (DI-ENS, UMR 8548), at Team Antique Chair of Computational Systems Biology at the School of Informatics, at the University of Edinburgh (on leave of absence) I was: Director of Synthsys the Centre for Synthetic and Systems Biology at Edinburgh (2012-2013); external faculty member of the Santa Fe Institute (2007-2009); and visiting Professor at the Harvard Medical School (2006-2009) at the Fontana lab. I work on clean and scaleable domain-specific modeling/programming languages, mostly, but not only, for systems and synthetic biology. I have a research interest in cross-disciplinary activities and convergence on algorithmic/mathematical structures for modelling (social systems, economical systems, climate, multi-scale plant growth, etc). Publications (google scholar). Academic Activities (Keynotes, invitations, courses, PCs, since 2002). Research projects I am involved in: 2015-2019: SBRC centre for mammalian synthetic biology at SynthSys 2014-2018: Big Mechanism programme (DARPA): Executable Knowledge (consultant). 2013-2018: ERC Advanced Fellowship RULE on Rule-based modelling 2012-2017: EPSRC Flowers Consortium: Platform for Synthetic Biology 2016-2019: ANR REPAS Former PhD students (since 2010): - John Wilson-Kanamori - Ricardo Honorato-Zimmer - Milana Filatenkova - Guoli Yang - Matthias Sachs (with Ben Leimkuhler, School of Mathematics) - Andreea Beica (ENS) - William Waites (Edinburgh) Current PhD students: - Guillaume Terradot (Edinburgh, School of Biological Sciences, co-supervision) - Brian Coyle (Edinburgh, School of Computer Science, co-supervision) About Kappa The Kappa modelling approach, which I co-invented (with Cosimo Laneve), was featured twice in Nature in 2009, and hailed as one of the future \"mainstream components of modern quantitative biology\" in a 2011 paper in Nature Methods. The Edinburgh entry to the prestigious international iGEM synthetic biology competition used Kappa as a modelling language and was twice awarded the Best Model Prize (2010, 2011). The 2014-2018 DARPA \"Big Mechanism\" programme on cancer biology has incorporated Kappa in a list of only three target formalisms (together with the standard SBML and SRI's Pathway Logic). It forms part of the material of a series of lectures at College de France by Walter Fontana, Fall 2019. Here is a short intro to rule-based modelling: Agile modelling of cellular signalling (SOS'08) A longer one: Rule-based modelling of cellular signalling (CONCUR'07) Our modelling language has an open-source implementation currently under active development.",
  "content_length": 2677,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:04"
}