{
  "name": "Vincent Conitzer",
  "homepage": "https://users.cs.duke.edu/~conitzer",
  "status": "success",
  "content": "Vincent (Vince) Conitzer I recently moved to CMU; in a few seconds you will be automatically redirected to my new page there. Vincent Conitzer Kimberly J. Jenkins Distinguished University Professor of New Technologies Professor of Computer Science, Professor of Economics, and Professor of PhilosophyLevine Science Research Center, office D207 Box 90129, Duke University Durham, NC 27708, USAemail: (I try to reply to as much as I reasonably can; my apologies if I am unresponsive or brief)andHead of Technical AI Engagement, Institute for Ethics in AIProfessor of Computer Science and Philosophy Visiting Fellow at Pembroke College University of Oxfordemail: (if you have no particular reason to use this address, better to use the above one) You can follow me on Twitter (@conitzer) (or Facebook or Linkedin). Note: after 15+ wonderful years at Duke, I will move to Carnegie Mellon University (Computer Science Department). If you are a prospective student interested in working with me specifically, please apply there. (But do check out my amazing Duke colleagues as well!) Note also this call for postdoc applications. I will still be at Oxford in summers. I will eventually set up my new website here. Jump to: ANNOUNCEMENTS | BRIEF BIO | RESEARCH GROUP | PUBLICATIONS by date | PUBLICATIONS by topic | TEACHING | MISCELLANEOUS | HUMOR ANNOUNCEMENTS RESEARCH GROUP: Check out our new Foundations of Cooperative AI Lab (FOCAL)! I am one of the organizers of a Fall 2023 MSRI program on Algorithms, Fairness, and Equity. Caspar Oesterheld's paper with me, Extracting Money from Causal Decision Theorists, was listed under Oxford University Press' \"Best of Philosophy\" for 2021. Our (with Tuomas Sandholm) EC 2006 paper, Computing the Optimal Strategy to Commit To, is receiving the 2022 IFAAMAS Influential Paper Award! I will serve as a conference chair for the AAAI/ACM AI, Ethics, and Society (AIES'22) conference. I am the chair-elect of the standing committee of the One Hundred Year Study on Artificial Intelligence (AI100). Hanrui Zhang was named a finalist for the 2021 Economics and Computation Facebook Fellowship. Yuan Deng received an honorable mention for the 2020 IFAAMAS Victor Lesser Distinguished Dissertation Award and an honorable mention for the SIGecom Dissertation Award. I received the 2021 ACM/SIGAI Autonomous Agents Research Award. Using Human Cognitive Limitations to Enable New Systems was awarded Best Blue Sky Idea at the HCOMP 2020 conference. Hanrui Zhang received the best student paper award at the ESA 2020 conference. Rupert Freeman started a faculty position at the University of Virginia (Darden School of Business) in 2020. Yuan Deng started as a Research Scientist in the Market Algorithms Group at Google Research NYC in 2020. Our entry Theory of Conscious Experience received the Meritorious Prize in the NSF 2026 Idea Machine. Yu Cheng started a faculty position at the University of Illinois at Chicago (Department of Mathematics, Statistics, and Computer Science) in 2019. Michael Albert started a faculty position at the University of Virginia (Darden School of Business + SEAS) in 2018. Rupert Freeman started a postdoc at Microsoft Research NYC in 2018. Catherine Moon started as an Economist at Keystone Strategy in 2018. Seyed Majid Zahedi (whose primary advisor is Ben Lee) started a faculty position at the University of Waterloo (ECE) in 2018. Yuan Deng was named one of the 2018 Google PhD Fellows. Fei Sha and I served as program chairs of AAAI 2020. Rachel Freedman received the Outstanding Student Paper Honorable Mention at AAAI 2018 for our paper Adapting a Kidney Exchange Algorithm to Align with Human Values. We received a CCC Blue Sky Award for our paper Moral Decision Making Frameworks for Artificial Intelligence at AAAI 2017. Rupert Freeman was named one of the 2017 Facebook PhD Fellows. csrankings.org ranks Duke sixth in the US for artificial intelligence and fourth in the US for economics & computation (June 9, 2018; with all the necessary caveats about such rankings). USEFUL LINKS (LOCAL): Check out our Bass Connections project on moral AI! Current teaching: COMPSCI 323 / 590.08 (Spring 2022): Computational Microeconomics. Recent teaching: COMPSCI 570 (Fall 2021): Artificial Intelligence. COMPSCI 590.7 (Fall 2020): Computational Microeconomics: Game Theory, Social Choice, and Mechanism Design. COMPSCI 323 (Spring 2020): Computational Microeconomics. COMPSCI 270 (Spring 2019): Introduction to Artificial Intelligence. COMPSCI 590.2 (Fall 2018): Computational Microeconomics: Game Theory, Social Choice, and Mechanism Design. Moral Artificial Intelligence (Fall 2018). COMPSCI 570 (Fall 2017): Artificial Intelligence. Philosophy 590.3 (Fall 2017) / 590.1 (Spring 2018): Ethics and AI. COMPSCI 590.2 (Spring 2017): Computation, Information, and Learning in Market Design. Less recent teaching: COMPSCI 290.4/590.4 (Spring 2015): Crowdsourcing Societal Tradeoffs. Please subscribe to the moral_ai mailing list if you are at Duke (or in the vicinity) and interested in topics in moral artificial intelligence. (The list is mostly used for local talk announcements.) Please subscribe to the cs-econ mailing list if you are at Duke (or in the vicinity) and interested in topics in the intersection between computer science and economics. (The list is mostly used for local talk announcements.) Also see our cs-econ website. We now have an MS in Economics and Computation at Duke. Other local activities at Duke: DRIV (Duke Robotics Intelligence and Vision), Machine Learning, Algorithms seminar, Microeconomic Theory, Decision Sciences, DNAC (Duke Network Analysis Center), Duke CTMS (Center for Theoretical and Mathematical Sciences). USEFUL LINKS (GLOBAL): I am giving a tutorial on Designing Agents' Preferences, Beliefs, and Identities at AAAI'21, AAMAS'21, EC'21, and IJCAI-ECAI'22. We completed the Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (freely available!). Here is our moral AI website. I gave a tutorial on Computational Social Choice and Moral Artificial Intelligence at AAMAS/ICML/IJCAI'18. Please subscribe to the computational social choice mailing list if you are interested in computational aspects of social choice (voting, mechanism design, ...). Preston McAfee and I completed our two terms as editors-in-chief of ACM TEAC (Transactions on Economics and Computation). The journal is now in the capable hands of Dave Pennock and Ilya Segal. SIGecom Exchanges is now in Yiling's Ariel's Shaddin's Hu's capable hands. BRIEF BIO Professional (for talk anouncements etc.): Vincent Conitzer is the Kimberly J. Jenkins Distinguished University Professor of New Technologies and Professor of Computer Science, Professor of Economics, and Professor of Philosophy at Duke University. He is also Head of Technical AI Engagement at the Institute for Ethics in AI, and Professor of Computer Science and Philosophy, at the University of Oxford. He received Ph.D. (2006) and M.S. (2003) degrees in Computer Science from Carnegie Mellon University, and an A.B. (2001) degree in Applied Mathematics from Harvard University. Conitzer works on artificial intelligence (AI). Much of his work has focused on AI and game theory, for example designing algorithms for the optimal strategic placement of defensive resources. More recently, he has started to work on AI and ethics: how should we determine the objectives that AI systems pursue, when these objectives have complex effects on various stakeholders? Conitzer has received the 2021 ACM/SIGAI Autonomous Agents Research Award, the Social Choice and Welfare Prize, a Presidential Early Career Award for Scientists and Engineers (PECASE), the IJCAI Computers and Thought Award, an NSF CAREER award, the inaugural Victor Lesser dissertation award, an honorable mention for the ACM dissertation award, and several awards for papers and service at the AAAI and AAMAS conferences. He has also been named a Guggenheim Fellow, a Sloan Fellow, a Kavli Fellow, a Bass Fellow, an ACM Fellow, a AAAI Fellow, and one of AI's Ten to Watch. He has served as program and/or general chair of the AAAI, AAMAS, AIES, COMSOC, and EC conferences. Conitzer and Preston McAfee were the founding Editors-in-Chief of the ACM Transactions on Economics and Computation (TEAC). Personal: I grew up in Amsterdam, the Netherlands. Besides working and spending time with my wife and kids, I enjoy sports, in the past mostly tennis and judo, and more recently mostly soccer and running, all very much at a recreational level... For more information: please see my CV. RESEARCH GROUP (More people can be found on the cs-econ website.) Information for students applying to my group. Advice/opinions for students in my group. I consider myself very fortunate to work and have worked with some extremely talented individuals. Current Ph.D. students: Caspar Oesterheld (Computer Science), Hanrui Zhang (Computer Science). Alumni: Anilesh K. Krishnaswamy (postdoc 2019-2021, now at Google) Yuan Deng (Computer Science Ph.D. 2020, now a Research Scientist at Google Research New York City) Yu Cheng (postdoc 2017-2019, now an Assistant Professor of Computer Science at Brown University) Rupert Freeman (Computer Science Ph.D. 2018, now an Assistant Professor at the University of Virginia - Darden School of Business) Michael Albert (postdoc 2016-2018, now an Assistant Professor at the University of Virginia - Darden School of Business and SEAS) Catherine Moon (Economics PhD. 2018, now an Economist at Keystone) Aaron Kolb (Economics Ph.D. 2016, briefly a postdoc in CS in 2016, now an Assistant Professor of Business Economics and Public Policy (BEPP) at Indiana University Kelley School of Business) Yuqian Li (Computer Science Ph.D. 2016, now at Google) Markus Brill (postdoc 2013-2015, now an Assistant Professor and Emmy Noether Research Group Leader at the Institute of Software Engineering and Theoretical Computer Science at TU Berlin) Angelina Vidali (postdoc 2",
  "content_length": 104799,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:02"
}