{
  "name": "Vincent Liu 0001",
  "homepage": "http://vincen.tl",
  "status": "success",
  "content": "Vincent LiuVincent Liuliuv (at) seas.upenn.edu [ liuv (at) seas.upenn.edu ]Associate Professor @ Penn CISLevine Hall North Rm 5743330 Walnut StreetPhiladelphia, PA 19104-6389I am actively looking for motivated, passionate PhD students! If you are interested, please apply here.About MeI am an associate professor in the Department of Computer and Information Science at the University of Pennsylvania, where I am the director of the Distributed Systems Lab (DSL) and also lead the PennNetworks group. My work has been recognized by an NSF CAREER Award, a VMWare Early Career Faculty Award, a Facebook Faculty Research Award, a Google Research Award, and several best paper awards at SIGCOMM and NSDI.Prior to Penn, I received my Ph.D. from the University of Washington working (primarily) with Tom Anderson and Arvind Krishnamurthy. Prior to that, my undergraduate research at the University of Texas at Austin was in the area of compilers and parallel systems.My research interests are in the broad areas of distributed systems and networking, and my projects have touched on programmable networks, fault-tolerance, security, data centers, wireless networks, clean-slate Internet architecture, routing/addressing, and the economic aspects of the Internet. In each, my focus is on solving important, long-standing problems by introducing creative new approaches and bridging disciplines.All of this research is made possible by my fantastic students:StudentsTao Luo (with Boon Thau Loo)Yinda ZhangSpyros PavlatosXuting LiuJiaheng LuGraduated StudentsXinyi ChenResearch Scientist at Meta (2025).Kelvin K.W. NgApplied Scientist at AWS (2025).Liangcheng YuSenior Researcher at Microsoft Research Redmond and the Office of the CTO, Azure for Operators (2024).Winner of the 2024 Rubinoff award for best Computer Science thesis at the University of Pennsylvania.Winner of the 2021 Penn Presidential Ph.D. Fellowship.Haoran Zhang (with Sebastian Angel)Research Scientist at Meta (2024).Nominated for VLDB 2025 Best Paper Award.Qizhen Zhang (with Boon Thau Loo)Assistant Professor at University of Toronto (2023).Gap-year Postdoc at Microsoft Research (2022).Winner of the 2022 Rubinoff award for best Computer Science thesis at the University of Pennsylvania.Winner of the 2019 Jonathan M. Smith Fellowship.Nofel YaseenResearch Scientist at Meta (2022).Winner of the 2020 Facebook Fellowship in Networking and Connectivity.I also worked closely with Jaewan Hong (student of Ion Stoica), Charles Kazer (now a Instructor at Swarthmore College), John Sonchack (student of Johnathan Smith, now at Princeton), João Sedoc (student of Lyle Ungar, now at NYU Stern), and Max Demoulin (student of Boon Thau Loo and Linh T. X. Phan, now at DBOS).",
  "content_length": 2730,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:03"
}