{
  "name": "Vincenzo Iovino",
  "homepage": "https://sites.google.com/site/vincenzoiovinoit",
  "status": "success",
  "content": "Vincenzo IovinoSearch this siteEmbedded FilesSkip to main contentSkip to navigationVincenzo IovinoI have been CTO at Virtual Labs and previously researcher and co-founder at Aragon ZK Researcher and previously assistant professor at University of Salerno and research associates at the Universities of Luxembourg and Warsaw.My main research interests include cryptography, cybersecurity and e-voting.Publications and works.A list of my publications can be obtained from my DBLP's or Google Scholar's page. More recent publications, works and software contributions follow.V. Iovino. Bank3: enabling deposits and withdrawals from Wallets, DAOs and real-world identities in a private and decentralized way. EthPrague, 2024. V. Iovino.  League of Identity: distributed identity-based encryption and authentication from Google and other poviders with applications to Anonymous Id-based Crypto Payments. 2024.V. Iovino.  Implementation of a Timelock Cryptographic Service.  https://github.com/aragonzkresearch/tlcs, 2023.A. Grigor, V. Iovino, G. Visconti,  The Referendum Problem in Anonymous Voting for Decentralized Autonomous Organizations. In 5th Distributed Ledger Technology Workshop (DLT 2023).V. Botta, V. Iovino, I. Visconti.  Towards Data Redaction in Bitcoin . In IEEE Transactions on Network and Service Management,  Special Issue on Recent Advances on Blockchain for Network and Service Management, 2022.Di Pietro, R., Trieu, N. and Iovino, V. COVID-19 and cybersecurity. IET Information Security, 2022.G. Avitabile, V. Botta, V. Iovino, I. Visconti. Privacy and Integrity Threats in Contact Tracing Systems and Their Mitigations. In IEEE Internet Computing, 2022.V. Iovino. MINI-FE. An implementation of a powerful crypto primitive that I developed for the CryptoHackaton 2021 (the project ranked 4th).Antoine Boutet, Claude Castelluccia, Mathieu Cunche, Alexandra Dmitrienko, Vincenzo Iovino, Markus Miettinen, Thien Nguyen, Vincent Roca, Ahmad-Reza Sadeghi, Serge Vaudenay, Ivan Visconti, Martin Vuagnoux.  Contact Tracing by Giant Data Collectors: Opening Pandora's Box of Threats to Privacy, Sovereignty and National Security, 2021.V. Iovino, S. Vaudenay, M. Vuagnoux.  On the Effectiveness of Time Travel to Inject COVID-19 Alerts. In CT-RSA 2021.  Video. See also Presentation at Chaos Communication Congress 2020. G. Avitabile, V. Botta, V. Iovino, I. Visconti. Towards Defeating Mass Surveillance and SARS-CoV-2: The Pronto-C2 Fully Decentralized Automatic Contact Tracing System. In CoronaDef workshop of NDSS '21.Z. A. Genç, V. Iovino, A. Rial. The \"Simplest Protocol for Oblivious Transfer\" Revisited. In Information Processing Letters Journal, 2020.V. Iovino, A. Rial, P. B. Rønne, P. Y. A. Ryan.  (Universal) Unconditional Verifiability in E-Voting without Trusted Parties. In IEEE CSF 2020.N. Soroush, V. Iovino, A. Rial, P. Ronne, P. Ryan. Verifiable Inner Product Encryption Scheme.  in PKC 2020, Springer.G. Drevon, V. Iovino, A. Kampa. Itugen: Transparent and Anonymous voting without Tallying Authorities.  Presented at ITASEC 2020.Vincenzo Iovino, Ivan Visconti. Non-interactive Zero Knowledge Proofs in the Random Oracle Model. In C2SI 2019, Springer. V. Iovino.  Efficient Perfectly Sound One-message Zero-Knowledge Proofs via Oracle-aided SimulationA. De Caro, V. Iovino, A. O'Neill. Receiver- and sender-deniable functional encryption. In IET Information Security Journal, 2018. V. Iovino, Q. Tang, K. Żebrowski.  Power of Public-key Function-Private Functional Encryption. In IET Information Security Journal, 2018. J. Becerra, V. Iovino, D. Ostrev, P. Sala, M. Skrobot.  Tightly-Secure PAK(E). To appear in CANS 2017, Springer LNCS.V. Iovino, K. Żebrowski. Mergeable Functional Encryption. In PROVSEC 2017, Springer LNCS.J. Becerra, V. Iovino, D. Ostrev, M. Skrobot. On the Relation Between SIM and IND-RoR Security Models for PAKEs. In SECRYPT 2017.  R. Giustolisi, V. Iovino, G. Lenzini. Privacy-Preserving Verifiability: A Case for an Electronic Exam Protocol. In SECRYPT 2017.Y. Desmedt, V. Iovino, G. Persiano, I. Visconti. Controlled Homomorphic Encryption: Definition and Construction. In Financial Cryptography 2017 - WAHC, Springer LNCS.P. Rønne, Vincenzo Iovino, A. Rial, P. Ryan. Using Selene to Verify your Vote in JCJ. In Financial Cryptography - VOTING 2017, Springer LNCS.A. Arriaga, V. Iovino, Q. Tang. Updatable Functional Encryption. In Mycrypt 2016, Springer LNCS, Volume 10311, 2016.G. Gallegos-Garcia, V. Iovino, A. Rial, P. B. Rønne, P. Y. A. Ryan. (Universal) Unconditional Verifiability in E-Voting without Trusted Parties. Manuscript, 2016.V. Iovino, Q. Tang, K. Żebrowski. On the power of Public-key Functional Encryption with Function Privacy. In CANS 2016, Springer LNCS, Volume 10052, pages 585-593, 2016. A. De Caro, V. Iovino. On the Power of Rewinding Simulators in Functional Encryption. In Design, Codes and Cryptography (2016), Springer. DOI: 10.1007/s10623-016-0272-x.A. De Caro, V. Iovino, A. O'Neill. Deniable Functional Encryption. In PKC 2016, Springer LNCS, Volume 9614, pages 196-222, 2016.R. Giustolisi, V. Iovino, P. B. Rønne. On the possibility of non-interactive voting in the public-key setting. In Financial Cryptography and Data Security - FC 2016 International Workshops - VOTING 2016, Springer LNCS, Volume 9604, pages 193-208.P.  Y. A. Ryan, P. B. Rønne, V. Iovino. Selene: Voter Friendly, Coercion Mitigating, Verifiable Voting. In Financial Cryptography and Data Security - FC 2016 International Workshops - VOTING 2016, Springer LNCS, Volume 9604, pages 176-192.V. Iovino and K. Żebrowski. Simulation-based Secure Functional Encryption in the Random Oracle Model. In Progress in Cryptology - LATINCRYPT 2015, Springer LNCS, Volume 9230, pages 21–39, 2015.A. De Caro, Vincenzo Iovino, A. Jain, A. O'Neill, G. Persiano. On the Achievability of Simulation-Based Security for Functional Encryption. In CRYPTO 2013, Springer LNCS, Volume 8043, pages 519-535, 2013.Scientific service.Program committee member of CANS 2016, PROVSEC 2017, CANS 2017, CANS 2018, INSCRYPT 2018, PENCIL '19., C2SI '23, DPSC '24., SECITC '24  General Chair of CANS 2018.Invited panelist at MAL-IoT - CF '18. Special issues.I edited, along with Prof. Di Pietro and Prof. Ni Trieu, a Special Issue titled  COVID19 and Cybersecurity for IET Information Security that focuses on all technologies related to COVID-19 digitalization and response to the pandemic. Contact me for more info.Media Coverage & COVID App hacksDuring COVID-19 I hacked the Google&Apple exposure notification systems and the  Covid Apps after discovering the time travel attack (see my publication list) that was covered in Italian mainstream media (see also publication above).Contact Information.v1nc10v1n0@gm41l.com (replace numbers with letters)Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 6827,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:10"
}