{
  "name": "Vincent Cheng-Siong Lee",
  "homepage": "https://research.monash.edu/en/persons/vincent-lee",
  "status": "success",
  "content": "Vincent Lee - Monash University Cheng-Siong Lee public CV View Scopus Profile Vincent Lee Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0001-5976-4601 EmailVincent.CS.Leemonashedu Accepting PhD StudentsPhD projects1) Development of Efficient Secure multiparty computation algorithms for privacy preserving;2) Development of hybrid models for Anomaly detection in multidimensional multimedia data streams;3) Reinforcement learning algorithms for real time moving target tracking and detection and communications;4) AI and IoT analytics for decision management in precision medicine and patient engagement data;5) Real time object detection and tracking using 3D CNNs6) Optimising distributed energy resources in smart microgrid.7) Mitigating Bias in big Data-Driven Artificial Intelligence Systems 20012025 Research activity per year Personal profile BiographyVincent CS Lee (PhD) is currently an Associate Professor at Machine learning and Deep Learning Discipline of the Department of Data Science and Artificial Intelligence, Faculty of IT, Monash University, Australia. He received Australia Federal Government scholarship to pursue PhD from 1988 through to 1991 at The University of New Castle, NSW, in Australia. In 1973 to 1974, he was awarded a joint research scholarship by Ministry of Defence (Singapore) and Ministry of Defence (UK) for postgraduate study at Royal Air Force College, UK in aircraft electrical and instrument systems. He was a visiting academic to Tsinghua University in Beijing at the School of Economics and Management from Nov 2006 to March 2007; and was also a Visiting Professor to Information Communication Institute of Singapore from July 1994 through June 1995. Lee has 35 (13 years with MNC and public sector establishments in Singapore, and 22 years with four universities in Australia and Singapore) years of experience in applied and fundamental research, business enterprise system development, engineering and ICT system integration, and university teaching. Lee is a Fellow Institute of Engineers, Australia (Fellow, IEAust); CPEng (ITEE), he is also a registered professional electrical engineer in Singapore; Licensed Electrical Engineer (High voltage 22KV switching authorisation) in Singapore; Chartered Engineer (UK), Senior members of IEEE USA. Lee published 200+ peer-reviewed international (high impact factor SCI and SSCI) Q1 journals articles and A and A* peer-reviewed international conference proceedings. His publications appear in IEEE Transactions on Knowledge and Data Engineering; IEE Proceeding on Generation, Transmission and Utilisation; IEEE Transactions on Neural Networks and linear Systems, IEEE Transactions on Signal Processing; IEEE Selected Areas in Communications; IEEE Security and Privacy; European Journal of Operational Research; Applied Mathematics and Computation; Neuro-computing; Accounting and Finance; Journal of Wealth Management; and in AAAI, ICDM, NeurIPS, ICDE, ICWS, ICIS proceedings. He has chaired/co-chaired more than a dozen of IEEE international conference technical program committees: conference chair KICSS2012; general chair ICDIM2011; co-chair workshop on Intelligent Environment (IE2010); conference chair ICSSSM2008, and special sessions of IEEE International Conference on Service Computing, senior program committee members of IJCAI2020 Fintech special track, PC members of IJCNN2019, PAKDD2020, invited co-chair and speaker IEEE ICET2021, Beijing, etc. Lee has been awarded 22 internationally competitive research grants in signal processing, decision support systems, AI/ML, Digital health informatics, and financial engineering research projects. Lee's current research interests are multidisciplinary spreading across signal processing; adaptive knowledge representation and information engineering; data, text, and graph mining for knowledge discovery; decision theory; information system research based on design science paradigm; and Neuro-financial engineering, ICU patient health support systems, Thyroid cancer prognostic and treatment analytics. He has attracted research grants from ARC DP and LPs, A*STAR, and Swift Institute, UK. Dr Lee is the sole recipient of Monash University, Dean of IT, 2016 excellence Award for Higher Degree supervision. He has todate supervised to the award of 30 PhDs and 35 Research Masters students in signal processing, power systems quality, e-commerce, financial engineering, Digital healthcare support systems, Secured digital networking, and innovation management from commencement to the final award of thesis during his employ with Nanyang Technological University in Singapore, Swinburne University of Technology and Monash University both in Melbourne, Australia. Currently he is the principal supervisor of 7 PhDs in Machine Learning and Artificial Intelligence, ICU patient vital sign health monitoring, extrem learning system for Thyroid cancer patient diagnostic and treatment quality; and cosupervisors for 6 PhDs in deep learning for health modelling of smart infrastructure transport network, multiparty computation using cryptography techniques, and educational data mining research. Monash teaching commitmentProfessor Vincent Lee has experience as the Chief Examiner for the following units in the Faculty of IT: FIT3030 Financial ModellingFIT3051 Decision Support Systems for FinanceFIT5133 Enterprise architecture and managementFIT5159 IT for Financial DecisionFIT5163 Computer and Information SecurityFIT5166 Information Retrieval SystemsFIT5183/FIT5046 Mobile and Distributed ComputingFIT5187 Wireless NetworksFIT5197 Statistical Data Modelling Vincent has also taught the following units in the Faculty of IT: FIT3051 Decision support systems for financeFIT5133 Enterprise architecture and managementFIT5186 Intelligent systemsFIT5187 Wireless networksFIT9006 Information technology management Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationEconomics and Finance, BBus (Hons I) in Economics and Finance, Intelligent Financial Trading indicators & Systems, RMIT UniversityAward Date: 6 Dec 2002Accountancy, MBus(Accounting), Towards Corporate Social Responsibility framework, RMIT UniversityAward Date: 1 Jul 1997Computer System Engineering, Doctor of Philosophy, University of NewcastleAward Date: 3 May 1992Business Administration, Master of Business Administration, Brunel University LondonAward Date: 28 Oct 1991Electrical Engineering, Master of Science, National University of Singapore (NUS)Award Date: 5 Aug 1984Electrical and Electronic Engineering, Bachelor of Engineering, National University of Singapore (NUS)Award Date: 5 May 1972 Research area keywordsBig Data AnalyticsCollaborative NetworksComplex Problem OptimisationDisruptive/Radical/Business Model InnovationsMicrobloggingNeural NetworksEvolutionary and Fuzzy ComputationPattern RecognitionData MiningTerrorism InformaticsTwitterDeep machine learningArtificial Intelligence and Image Processing Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2004 2004 2005 2007 2008 2013 2014 2018 2020 2021 2022 2023 2025 12 Finished Projects per year ESV-ML OCR: ESV Machine learning based OCR real time pipeline architecture design & developmentLee, V. (Primary Chief Investigator (PCI))Energy Safe Victoria (ESV)13/11/23 → 31/03/25Project: Research ESV: ESV online Gas Equipment Safety Audit-Stage 1Lee, V. (Primary Chief Investigator (PCI))21/06/22 → 22/06/22Project: Research Tokopedia : TokoNOW Forecasting Project and Review-based Recommendation Systems development-Tokopedia Bergmeir, C. (Primary Chief Investigator (PCI)), Schmidt, D. (Chief Investigator (CI)), Saputra, R. (Chief Investigator (CI)), Wilson, C. (Chief Investigator (CI)), Taniar, D. (Chief Investigator (CI)) & Lee, V. (Chief Investigator (CI))27/07/21 → 19/09/22Project: Research Data Analytics and Visualisation for Engineering Workflows and Business IntelligenceTan, C. (Primary Chief Investigator (PCI)), Lee, V. (Supervisor) & Marusic, S. (Supervisor)11/01/21 → 11/06/21Project: Research Online Sales_ESV: Online Sales Research for Energy Safe Victoria: A Pilot StudyLee, V. (Primary Chief Investigator (PCI)) & Taniar, D. (Chief Investigator (CI))Energy Safe Victoria (ESV)1/10/20 → 31/05/22Project: Research View all 12 projects Research output Research output per year 2001 2002 2003 2004 2006 2007 2008 2009 2010 2011 2012 2019 2020 2021 2022 2023 2024 2025 111 Conference Paper 38 Article 12 Chapter (Book) 6 Other 9 More 3 Editorial 3 Review Article 2 Foreword / Postscript 1 Edited Book Research output per year Research output per year Computational Intelligence for Optimizing UAV Positioning and Task Scheduling in UAV-Assisted MEC SystemsYi, M., Lee, V. C. S., Zhang, Y., Li, P. & Yang, P., 2025, Neural Information Processing - 31st International Conference, ICONIP 2024 Auckland, New Zealand, December 2–6, 2024 Proceedings, Part IV. Mahmud, M., Doborjeh, M., Wong, K., Leung, A. C. S., Doborjeh, Z. & Tanveer, M. (eds.). Singapore Singapore: Springer, p. 59-73 15 p. (Lecture Notes in Computer Science; vol. 15289).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Dynamic Ensemble Transfer Learning with Multi-view Ultrasonography for Improving Thyroid Cancer Diagnostic ReliabilityZhang, X., Liu, F., Lee, V. C. S., Jassal, K., Di Muzio, B. & Lee, J. C., 15 Sept 2025, (Accepted/In press)",
  "content_length": 12994,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:01"
}