{
  "name": "Vincenzo D'Andrea",
  "homepage": "https://webapps.unitn.it/du/en/Persona/PER0004834/Curriculum",
  "status": "success",
  "content": "Vincenzo D'Andrea | CV | University of Trento Vincenzo D'Andrea Associate professor Department of Information Engineering and Computer Science Associate professor: Centre for Medical Sciences - CISMED Via Sommarive, 9 - 38123 Povo tel. 0461 282084 vincenzo.dandrea[at]unitn [dot] it | https://disi.unitn.it/~dandrea/ Expertise: Active aging Collaborative computing Human Computer Interaction (HCI) Human-centered computing Information & Communication Technology (ICT) Information systems Information technology Innovation studies Intellectual property Participatory design Science and technology studies Social computing Social informatics Social innovation Education September 1994: PhD in Information Technology, University of Parma (Italy), Department of Computer Engineering. Title of the dissertation: “Cellular Automata and Image Processing”. Supervisors: Prof. Gianni Conte and Gianni Adorni.December 1989: Laurea in Physics, University of Trento (Italy). Title of the dissertation: “Computer vision and Material Science”. Advisor: Prof. Gianni Jacucci1981 - 1992: Summer Schools and other courses:La Visione delle Macchine, 28-09-1992 to 2-10-1992, IAPR and Università di Firenze, Firenze, Italy. Summer School:Progress in Picture Processing, 10-08-92 to 4-09-92, NATO-ASI, Les Houches, France.Course on the Structure of Parallel Machines, 17-06-1991 to 21-061991, Fibonacci Institute, IRST, Trento, Italy.Designing and Programming Massively Parallel Computers, 30-04-1991 to 10-05-1991, DIS, Pavia, Italy.Introduzione all'uso della Connection Machine CM-2, 13-12-1990 to 15-12-1990, Facoltà di Ingegneria, Parma, Italy.Administering the Connection Machine System, 17-10-90, Thinking Machines, Cambridge, Ma, USA.Advanced Summer Course on Neural Networks, 5-06-1989 to 10-06-1989, Genova Ricerche, Genova, Italy.ISPRA-Course: Computer Simulation in Physical Metallurgy 21-05-1984 to 25-05-1984, JRC, Ispra, Italy.Data Acquisition in High Energy Physics, 27-07-81 to 7-09-81, Intl. School for Physics “E. Fermi”, Varenna, Italy. Academic career and teaching activities Posizione: 2005-01 -- oggi: professore associato presso l'Università degli Studi di Trento, Dipartimento di Ingegneria e Scienza dell'Informazione. 2001-11 -- 2005-01: ricercatore presso ll'Università degli Studi di Trento, Sociologia 1995-11 -- 2001-10: ricercatore presso ll'Università degli Studi di Trento, Ingegneria. Affiliazione: 2002-01 -- oggi: Dipartimento di Ingegneria e Scienza dell'Informazione 1995-11 -- 2001-12: Dipartimento di Informatica e Studi Aziendali E' membro del Collegio Docenti del ICT Doctoral School. E' stato membro del Collegio Docenti della Scuola di Dottorato in Sociologia e del Dottorato in Information Systems and Organizations. Corsi attualmente insegnati: Anno Accademico 2015-2016 -- oggi: docente di \"Participatory Design\", modulo del corso di Design Experience (Laurea magistrale in \"Human-Computer Interaction\", Dipartimento di Psicologia e Scienze Cognitive e Dipartimento di Ingeneria e Scienza dell'Informazione, Università degli Studi di Trento). Anno Accademico 2014-2015 -- oggi: docente di \"Participatory Design\" (Laurea magistrale in \"Informatica\", Dipartimento di Ingeneria e Scienza dell'Informazione, Università degli Studi di Trento). Anno Accademico 2013-2014 -- oggi: docente di \"Privacy and Intellectual Property Rights\" (Laurea magistrale in \"Informatica\", Dipartimento di Ingeneria e Scienza dell'Informazione, Università degli Studi di Trento). Anno Accademico 2003-2004 -- oggi: docente di \"Laboratorio di ricerca su Sistemi Informativi\"  presso il Dipartimento di Sociologia, Università degli Studi di Trento (Laurea Magistrale in \"Gestione delle Organizzazioni e del Territorio\", in precedenza per Laurea Specialistica in \"Lavoro, Organizzazione e Sistemi Informativi\"). Anno Accademico 2003-2004 -- oggi: docente di \"Sistemi Informativi\"  presso il Dipartimento di Sociologia, Università degli Studi di Trento (Laurea Magistrale in \"Gestione delle Organizzazioni e del Territorio\", in precedenza per Laurea Specialistica in \"Lavoro, Organizzazione e Sistemi Informativi\"). Corsi precedenti: Anno Accademico 2008-2009: docente di \"Progettazione partecipata dell'uso sostenibile di tecnologie dell'informazione\"  (laurea triennale in Sociologia, Facoltà di Sociologia, Università degli Studi di Trento). Anno Accademico 2004-2005 -- 2008-2009 : docente di \"Strumenti e Metodi di Internet\" (laurea triennale in Sociologia, Facoltà di Sociologia, Università degli Studi di Trento). Anno Accademico 2005-2006 -- 2008-2009: docente di \"Information Technology e Proprietà Intellettuale\" (Laurea specialistica in \"Informatica, Facoltà di Scienza, Università degli Studi di Trento). Anno Accademico 2001-2002 -- 2003-2004: incarico di supplenza per il corso di Informatica: Modulo A, Fondamenti del Web; Modulo B, Internet - Le problematiche, (Corso di Laurea in Sociologia, Facoltà di Sociologia, Università degli Studi di Trento). Anno Accademico 2001-2002 -- 2007-2008: incarico di supplenza per il corso di Programmazione ad Oggetti 1 (Corso di Laurea in Ingegneria dell'Informazione e dell'Organizzazione, Facoltà di Ingegneria, Università degli Studi di Trento). Dall'Anno Accademico 1998-1999 -- 2001-2002: incarico di supplenza per il corso di Fondamenti di Informatica - Sdoppiato (Primo anno dei corsi di Laurea in Ingegneria, Università degli Studi di Trento). Anno Accademico 1999-2000 -- 2000-2001: incarico di supplenza per il corso di Sistemi Informativi III (Terzo anno del corso di Diploma Universitario in Ingegneria Informatica, Università degli Studi di Trento). Negli anni 1993,1994,1995: Professore a contratto per i corsi di Teoria dei Sistemi, Automazione Industriale e Fondamenti di Informatica (presso l'Università degli Studi di Trento e presso l'Università degli Studi di Parma). Relatore di più di cinquanta tesi di Laurea, presso più atenei e in diversi corsi di laurea, di dottorato e di diploma universitario. Research interests Participatory DesignIn the last 20 years, my research focus has been within Participatory Design. In particular, participatory design of information technology. Participatory design questions the separation of roles of designers and users, involving the latter in the design process and decision-making. Since it does not require ‘technical’ skills on the part of the users, methodologies are used that allow needs and problems to emerge (interviews, focus groups, workshops, observation, etc.). This is a markedly interdisciplinary area of research (and practice), requiring ICT skills linked to methodologies typical of research in the human and social sciences.In 2006 I coordinated the local organization of the Participatory Design Conference, in Trento. The PDC is a bi-annual conference, which is the reference conference for the study of participatory methodologies, in particular in the area of Information Systems. In 2008 the conference will be held in Bloomington, IN, USA. I'm collaborating in the organization of PDC as a member of the conference Steering Committee.Service Oriented ComputingSince 2003 I am actively involved in this research area. I am a co-founder of the series of conferences \"International Conference on Service Oriented Computing\", being part of the organization of each edition (general chair in 2008). I am also the coordinator of a Research Unit in the EU-founded Research Project COMPAS. This project is focusing on the problem of compliance within Service Oriented Systems. I am also involved in the Working Group of ODRL-S, a language for the description of service licenses. I have been co-editor for two issues of the International Journal of Cooperative Information Systems, on theme of Service Oriented Computing.Virtual Communities of PracticeFrom 2001 to 2007 I was the coordinator of a Research Unit in a research project on technology mediated collaboration and on learning within virtual communities of practice. These project were founded by the National Ministry for Research.Free and Open Source SoftwareIn this area, my research interest are the communities of FOSS developers, and the socio-technical process that appear within these communities. Besides being involved in several conferences and seminars on this subject, I am supervising four PhD students working in this area.Collaborative Software DevelopmentI have a long standing collaboration with colleagues which run a small software company in Indianapolis, IN, USA. The company, IIT (Intelligent Information Technology) has a significant research interest in the area of collaborative software development and in modeling software systems and frameworks. A joint paper on this subject receive the best paper award at the 2007 edition of IEEE-CTS (Collaborative Technologies and Systems).Previous workDuring my PhD in Computer Engineering I focused my research on computer vision. The context of the work was the development of support systems for car driving. The technology was based on massively parallel architectures, more precisely on Cellular Automata. I later focused my work on the use of multimedia and other technologies as mediators for communication. This work has been focused in a variety of contexts, such as remote concurrent design in the automotive sector, teaching support systems, and web-based business collaboration.Research periods abroad2003 (January and August – September): Intelligent Information Technologies and Butler University (Indianapolis, IN, USA). Research with A. Baskin and P. Linos on software development methodologies.2002 (February): Tilburg University (The Netherlands). Visiting with Prof. M. Papazoglou to setup the research agenda for the newly built group on Service Oriented Computing in Trento.2001 (August): Intelligent Information Technologies and Butler University (Indianapolis, IN, USA). Research with A. Baskin and P. Linos on software development methodologies.2000 (October to January 2001): Boston University (Boston, Ma, USA). Visi",
  "content_length": 16950,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:09"
}