{
  "name": "Vincent Bindschaedler",
  "homepage": "https://vbinds.ch",
  "status": "success",
  "content": "vbinds.ch | Vincent Bindschaedler's Website Skip to main content News & Announcements AsiaCCS 2024 Paper(2024-07) — Check out our paper on ASR defenses against signal processing attacks. This work was recently presented at AsiaCCS 2024. CODASPY 2024 Paper(2024-06) — New CODASPY 2024 research paper about the security and systems challenges of implementing covert messaging with LLMs. Associate Professor at the University of Florida Selected (Recent) Publications Self-Supervised Fine-Tuning of Automatic Speech Recognition Systems against Signal Processing Attacks [PDF (ACM DL)]In ACM Asia Conference on Computer and Communications Security (2024)Oshan Jayawardena, Dilmi Caldera, Sandani Jayawardena, Avishka Sandeepa, Vincent Bindschaedler, Subodha Charles Leveraging Generative Models for Covert Messaging: Challenges and Tradeoffs for \"Dead-Drop\" Deployments [PDF]In ACM Conference on Data and Application Security and Privacy (2024)Luke A. Bauer, James K. Howes IV, Sam A. Markelon, Vincent Bindschaedler, Thomas Shrimpton DP-Mix: Mixup-based Data Augmentation for Differentially Private Learning [PDF]In Neural Information Processing Systems (2023)Wenxuan Bao, Francesco Pittaluga, Vijay Kumar B G, Vincent Bindschaedler SoK: Memorization in General-Purpose Large Language Models [PDF]In arXiv preprint (2023)Valentin Hartmann, Anshuman Suri, Vincent Bindschaedler, David Evans, Shruti Tople, Robert West EMI-LiDAR: Uncovering Vulnerabilities of LiDAR Sensors in Autonomous Driving Setting using Electromagnetic Interference [PDF (External Link)]In ACM Conference on Security and Privacy in Wireless and Mobile Networks (2023)Sri Hrushikesh Varma Bhupathiraju, Jennifer Sheldon, Luke A. Bauer, Vincent Bindschaedler, Takeshi Sugawara, Sara Rampazzi Enhanced Membership Inference Attacks against Machine Learning Models [PDF]In ACM SIGSAC Conference on Computer and Communications Security (2022)Jiayuan Ye, Aadyaa Maddi, Sasi Kumar Murakonda, Vincent Bindschaedler, Reza Shokri Analyzing the Monetization Ecosystem of Stalkerware [PDF]In Privacy Enhancing Technologies Symposium (2022)Cassidy Gibson, Vanessa Frost, Katie Platt, Washington Garcia, Luis Vargas, Sara Rampazzi, Vincent Bindschaedler, Patrick Traynor, Kevin Butler Tweets by @vbindsch Wordcloud Research Interests Data PrivacyMachine Learning + Security and PrivacyApplied CryptographyDifferential PrivacySide-Channel Threats",
  "content_length": 2398,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:00"
}