{
  "name": "Vincent Aleven",
  "homepage": "http://www.cs.cmu.edu/~./aleven",
  "status": "success",
  "content": "Vincent Aleven About me My research goals are to advance the science of how people interact and learn with adaptive, AI-based learning technologies, and to advance the design and engineering of these technologies. Practically, I aim to help realize the smart classroom with great synergy between learners, those who facilitate learning (teachers, instructors, peers, tutors, parents), and novel AI applications. In this context, I am excited to help a new generation of scientists and professionals develop interest and skill in research and development. For urgent matters Please contact: Jo Bodnar, Administrative Associate Send email to Jo Fall 2023: Students interested in getting involved in research For a list of available projects for independent studies or research assistantships, please go here. Overview of research The CATS Lab's focus is to help develop the smart classoom, that is, dynamic learning environments that leverage complementary strengths of humans and AI. The work lies at the intersection of the learning sciences, human-computer interaction, artificial intelligence, and education. We envision a future in which students, teachers, and AI work together in newly-designed partnerships to co-orchestrate and support personalized learning. Students carry out a dynamic, personalized mix of individual and collaborative learning activities. They learn in new domains, become better at regulating their learning and collaborating with peers, and develop their own personal motivation to learn. As we work towards realizing this vision, we collaborate with teachers, students, and other stakeholders. We work to understand their needs, preferences and boundaries. We design, prototype, and pilot-test new technologies with them. We investigate how the new technologies we create affect educational processes and outcomes in real educational settings. Although the work focuses often on middle-school mathematics, the technologies work in other task domains as well. AI-based tutoring software We have created AI-based tutoring software for individual and collaborative learning and found them to be effective in classrooms in domains like middle-school mathematics equation solving and elementary school fractions learning. This software is available for free for teachers, students, and parents at the Mathtutor website. AI-based tutoring support for self-regulated learning We have also created tutoring software that simultaneously supports students' learning at the domain level (e.g., mathematics) and learning to become self-regulated learners (e.g., help seeking, self-assessment, self-directed mastery learning). Orchestration tools We have designed, implemented, and evaluated a range of AI-based co-orchestration tools for teachers, for use in conjunction with AI-based tutoring software. Different projects have created and evaluated a dashboard for lesson planning, a real-time, AI-based, mixed-reality teacher awareness tool, a dashboard for real-time monitoring and helping students, and an AI-based orchestration tool so teachers can dynamically pair up students so they can work collaboratively with AI-based tutoring software, Authoring tools for AI-based tutoring software We have over many years created tools for creating AI-based tutoring software, namely the Cognitive Tutor Authoring Tools (CTAT)/Tutorshop. Tutors built with these tools support students in practicing complex problems with many solution steps and strategies. CTAT significantly lowers barriers to creating such software. It supports two different paradigms for AI-based tutoring systems, one for programmers, one for non-programmers. Creating favorable conditions for math homework for middle-schoolers How might homework with AI-based tutors be most effective? We are investigating the effectiveness of three factors: 1. running the tutors on smartphones, with an offline mode so they can be used wherever the user is, 2. data-driven redesign of targeted tutor units so students get more out of the time they spend practicing, and 3. nudges for parents to be involved in their child's homework, so students spend more time practice. We conduct design-based research, data mining, tutor redesign, and classroom evaluation studies. Opportunities for future research Across these projects, we face many open questions. To name just a few: How can novel AI applciations could support tutors and parents in helping students? How can learning self-regulatory skill be balanced with domain-level learning? How can we best support teachers and students in authoring their own AI-based tutoring software? We are looking for students at all levels, but also for schools and teachers, who might be interested in jointly exploring these questions. If interested in joining the research lab or to use our technologies for free, please feel to reach out.",
  "content_length": 4855,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:00"
}