{
  "name": "Vineeth Nallure Balasubramanian",
  "homepage": "http://www.iith.ac.in/~vineethnb",
  "status": "success",
  "content": "Vineeth N B: Home Vineeth N Balasubramanian Home Home Bio/Contact Open Positions Research About Publications Patents Books Media Code/Resources Teaching Courses Tutorials Talks Students Current Alumni Misc Service Awards News Archive Professor, Department of Computer Science and Engineering Affiliate Faculty, Department of Artificial Intelligence Fellow, Indian National Academy of Engineering I am currently on long leave from IIT-H, working at Microsoft Research India Indian Institute of Technology, Hyderabad CS 310, Department of Computer Science and Engineering Kandi, Sangareddy 502 284 Telangana, INDIA Email: (First name)(Middle Initial)(Last Name Initial)-at-(domain) Research Interests Deep/Machine Learning, Computer Vision, Multimodal Foundation Models, Reasoning, Explainable AI If you want to know moreâ¦. NPTEL Online Course on “Deep Learning for Computer Vision” All lectures, videos and code companions of NPTEL Course on “Deep Learning for Computer Vision” are available on https://dl4cv-nptel.github.io/DL4CVBK/intro.html, thanks to our wonderful course TAs. This course is being re-offered from July 2024. Please see this course landing page for more details. Recent News (Oct 2025): Honored to give a keynote talk at AIMLSys’25. (Sep 2025): Our work on using learnable memories via Hopfield networks to address multiple downstream tasks is accepted at NeurIPS 2025. Many congratulations to Susmit, Krishn, Swarnima and Saksham! (Sep 2025): Hari Chandana selected for the IBM Research Maitreyi showcase, and Deepika selected for the competitive research internship at Vector Institute (Canada). Many congratulations to both of them. (Sep 2025): Immensely grateful and humbled to receive the National Award to Teachers from the Hon'ble President of India on Teachers’ Day. Credit goes to all my teachers/mentors, students/alumni, colleagues, collaborators and importantly, family for their sacrifices. (Aug 2025): Honored to give a keynote talk at CoLLAs’25 at UPenn (Philadelphia). (May 2025): Joint work between researchers at IIT-H and Microsoft Research India on teaching transformers causal reasoning through axiomatic training accepted at ICML 2025. (May 2025): Our work on analyzing the capabilities of Vision-Language Models (VLMs) accepted at ACL 2025. Joint work with researchers at UBC, Vancouver. (Mar 2025): Two papers accepted at CVPR 2025. Congratulations to Akshay and all our collaborators at KLA and Sony Research! Please see details here. (Feb 2025): Joint work between researchers at IIT-H and Microsoft Research India on causal order being the medium of using LLMs for causal inference accepted at ICLR 2025. (Jan 2025): Our work on training concept-based models in continual learning settings with transformer architectures accepted at AAAI 2025. Congratulations to Susmit, Deepika and Siddarth! (Dec 2024): Our IJCV Special Issue on Visual Domain Generalization in Real-World Applications is accepting submissions. Please consider submitting your work. (Dec 2024): Honoured and humbled to be an INAE Fellow from 2024. Grateful to all my students, mentors and collaborators. (Dec 2024): Our work on aligning prompts with semantic attributes in VLMs accepted at TMLR. Congratulations to Hari Chandana, Sai Srinivas and Gowtham. (Oct 2024): Our work on detecting and measuring confounding using causal mechanism shifts is accepted at NeurIPS 2024. Congratulations, Gowtham! (Oct 2024): Grateful and honoured to be coordinating the AI CoE efforts at IIT-Hyderabad. Please see https://aiswaryam.ai.iith.ac.in for more details. Our efforts have been selected for Phase 2 of the CoE, coordinated by IIT-Kanpur. (Aug 2024): Grateful to be recognized as among the Best Reviewers at ICML 2024. (Jul 2024): Sai Srinivas K receives the competitive Microsoft Research India PhD Award 2024. Congratulations to Srinivas, well-deserved! (Jul 2024): Two papers accepted at ECCV 2024. Congratulations to Aveen, Rishabh, Joseph and Prachi! One of the papers is joint work with CMU. Please see details here. (Jul 2024): Our work on explaining pedestrian intent on roads is accepted at IROS 2024. Congratulations, Vaishnavi! This is joint work with Jawahar (IIIT-H), Chetan (IIT-D) and Anbu (Intel). (Jun 2024): Grateful to share our research as invited talks at the Continual Learning (CLVISION) and XAI workshops at CVPR. (May 2024): Honoured and humbled to be an INSA Associate Fellow of 2024. Grateful to all my students, mentors and collaborators. (Feb 2024): Our work on drone-to-drone detection using Vision Transformers is accepted at ICRA 2024. Congratulations, Sairam and Pranoy! (Jan 2024): Joseph's PhD thesis on continual learning received the Runner-up Award for the competitive ACM IKDD Doctoral Dissertation in Data Science. This is the second year in a row our students have featured in the dissertation awards; congratulations to Joseph for this well-deserved honour! (Dec 2023): Three papers accepted at AAAI 2024. Congratulations to Gowtham, Sandesh, Saketh, Harsharaj and Benin! One of the papers is joint work with Honeywell, and another with Microsoft Research India. Please see details here. (Dec 2023): Dr Arghya Pal, our PhD alumnus, received the Excellence in Academics and Technology Development award at the 2023 IIT-H Institute Alumni Awards. Congratulations, Arghya, we are proud of you, hope you soar higher! (Oct 2023): Grateful for the Microsoft Research Accelerating Foundation Models Research grant award to access Azure credits for our research! (Sep 2023): Two papers accepted at NeurIPS 2023. Congratulations to Gaurav, Deepayan, Aveen and Vimal! One of the papers is joint work with Prof Leonid Sigal at UBC. (Jul 2023): Two papers accepted at ICCV 2023. Congratulations to Vimal, Saketh, Tanmay and Joseph! One of the papers is joint work with the Human Sensing Lab at CMU. (Jul 2023): Dr Joseph receives his PhD degree at the IIT-H Convocation. Very well-deserved! Congratulations also to the various medal-winnners from our group: Karthik Balaji (BTech CSE), Krishn Vishwas Kher (BTech ES), Tarun Ram Menta (BTech AI), Vaasudev Narayanan (MTech CSE), Vimal K B (MTech AI), and Amlan Jyoti (MTech in Data Science)! (Apr 2023): Congratulations to Krishn Vishwas Kher on being awarded the prestigious Prime Minister's Research Fellowship (PMRF), the 5th PMRF Fellow in our group! (Apr 2023): Humbled to receive the Research Excellence Award at the IIT-H Foundation Day. Grateful to all my students, mentors and collaborators. (Feb 2023): Elevated as Senior Member of AAAI (one of 15 globally in Class of 2023). Grateful and humbled. (Jan 2023): Anirban Sarkar's PhD thesis won the highly competitive ACM IKDD Doctoral Dissertation in Data Science Award. Congratulations to Anirban for this honour! (Dec 2022): Asian Conference on Machine Learning (ACML) came to India for the first time – and was successfully held at Hyderabad from Dec 12-14, 2022. Honored to have served as the General Co-chair. (Oct 2022): Congratulations to Deepika Vemuri on being awarded the prestigious Prime Minister's Research Fellowship (PMRF), the 4th PMRF Fellow in our group! (Oct 2022): Grateful to be in the world's top 2% scientists list released by Stanford University in Oct 2022. (Aug 2022): Grateful for the NASSCOM AI Gamechanger award under AI Research (DL Algorithms and Architecture) category (both winner and runner-up). Congratulations to Joseph, Anirban, Aditya and all our co-authors and collaborators. (Jul 2022): Our course on Deep Learning for Computer Vision on NPTEL is being offered from Jul-Oct 2022; here is the link for those interested to register. Thanks to our course TAs, we have a code companion for the lectures this year. Please see this link for more. (Jul 2022): 3 papers accepted at ECCV 2022, please see details here. Congratulations to Joseph, Arjun, Surgan, Yash and Arghya! (Jun 2022): Dr Arghya Pal receives tenure-track Assistant Professor position at Monash University. Congratulations, Arghya! (Jun 2022): Grateful for the Best Paper Award Honorable Mention recognition at the Continual Learning (CLVISION) workshop at CVPR 2022. Congratulations to Joseph and our collaborators at Google Research – Gaurav, Sujoy, Piyush, Soma, Kai. (Jun 2022): Grateful for the Microsoft Academic Partnership Grant (MAPG), and the Adobe Research Gift. (May 2022): Our work on integrating causal domain priors into training of neural networks is accepted at ICML 2022. Congratulations, Srinivas and Gowtham! This was joint work with Amit Sharma from Microsoft Research. (Apr 2022): Completed my 3-year term as Head of AI department at IIT-H. Grateful for the opportunity and the experience to serve and contribute. (Mar 2022): 4 papers accepted at CVPR 2022, please see details here. Congratulations to Anirban, Joseph, Anindya, Monish, Sriranjani, Nishant, Hari Chandana, Sumitra and Shivam! (Jan 2022): Our work on ensembling attribution methods for explainability is accepted at AISTATS 2022. Congratulations, Piyushi and Tarun! This was joint work with Dr Saketha Nath, IIT-H. (Jan 2022): Grateful for the Best Paper Award in the research track at CODS-COMAD 2022. Congratulations to Dr Sandesh. Credit to our collaborators, Amit Deshpande (MSR) and K V Subrahmanyam (CMI). (Jan 2022): Grateful for the Google exploreCSR award support to host interns in our group for summer 2022. Please use this link to apply if you are interested. Last date: 24 Jan 2022. (Dec 2021): Our work on a dataset and new metrics for causal disentanglement accepted at AAAI 2022. Congratulations, Gowtham and Benin! (Nov 2021): 7 papers accepted at WACV 2022. (Oct 2021): Our work on incremental object detection accepted at PAMI. Congratulations to Joseph, this is joint work with MBZUAI, Abu Dhabi. (Sep 2021): Two papers accepted at NeurIPS 2021, please see details here. Congratulations to Sandesh, Anindya, Anirban and Sowrya! (Jul 2021): Our course on Deep Learning for Computer Vision on NPTEL is being re-offered from Jul-Oct 2021; here is ",
  "content_length": 12991,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:20"
}