{
  "name": "Vineet R. Kamat",
  "homepage": "https://robotics.umich.edu/profile/vineet-kamat",
  "status": "success",
  "content": "Affiliate Faculty | Michigan Robotics Affiliate Faculty The Robotics Department is fortunate to have a strong network of affiliate faculty members who contribute to our research and educational programs. These individuals are experts in various fields related to robotics and are dedicated to advancing the field through collaboration and mentorship. Shorya Awtar Mechanical Engineering Affiliate Faculty Research Interests Precision engineering; mechatronics; flexure mechanisms; high-precision high-bandwidth motion systems for applications in nanometrology and nanomanufacturing; MEMS sensors and actuators; minimally invasive surgery. Shan Bao Industrial and Manufacturing Systems Engineering and Transportation Research Institute Affiliate Faculty Research Interests Connected and Automated Vehicle Technologies, Human Factors, Bid Data, Driver Behavior Modeling, Vulnerable Road Users, and User Interface. Daniel Bruder Mechanical Engineering Affiliate Faculty Research Interests Design, modeling, and control of soft and other non-traditional robotic systems with the goal of actualizing robots that are capable of safely assisting humans in real-world unstructured environments. Sophia Brueckner Stamps School of Art & Design and School of Information Affiliate Faculty Research Interests Science fiction and speculative prototyping, tangible interfaces/haptics, biomimetic and social robotics, social interfaces/networks, generative/algorithmic art and design, and technology ethics. Joyce Chai Computer Science and Engineering Affiliate Faculty Research Interests Natural language processing, Human-robot communication, Artificial Intelligence. James Cutler Aerospace Engineering Affiliate Faculty Research Interests Robotic exploration of space with emphasis on design optimization, sensor systems, communication networks, and novel nanosatellite missions. Bogdan Epureanu Mechanical Engineering Affiliate Faculty Research Interests Dynamics & Vibrations, Mechatronics & Robotics, Multi-scale Computation. Tulga Ersal Mechanical Engineering Affiliate Faculty Research Interests Autonomous vehicles, teleoperation, system dynamics and control, multibody dynamics, energy management, mathematical modeling. Ryan Eustice Naval Architecture and Marine Engineering Affiliate Faculty Research Interests Computer vision and image processing, Bayesian filtering and smoothing, simultaneous localization and mapping. Jean-Baptiste Jeannin Aerospace Engineering Affiliate Faculty Research Interests Formal verification of cyber-physical systems, aerospace software systems, logics and semantics of programming languages, programming with coinductive types, software security. Judy Jin Industrial and Operations Engineering Affiliate Faculty Research Interests Statistical methods for quality and reliability engineering with the focus on distributed sensing, dynamic system modeling, online monitoring and diagnosis, and optimal decision-making for improving system design, operations, and maintenance strategies. Vineet Kamat Civil and Environmental Engineering and Electrical Engineering and Computer Science Affiliate Faculty Research Interests Collaborative autonomous robots for construction, inspection, and maintenance of civil infrastructure. Chandramouli Krishnan Physical Medicine & Rehabilitation (Kinesiology) and Biomedical Engineering Affiliate Faculty Research Interests Rehabilitation robotics, passive robots, wearable and mobile devices, low-cost technologies, neural plasticity, motor control. Arpan Kusari Transportation Research Institute Affiliate Faculty Research Interests Robust Sensing, Uncertainty Quantification, Sensor Calibration, LiDAR Data Processing, AV Perception and Localization, Out-of-Distribution Detection, Reinforcement Learning in AVs, Explainable AI, Simulation-based Validation, Multi-Sensor Data Fusion, Autonomous Vehicles, Scalable Mapping, Scenario Generation, Environmental Effects on Sensing. Stephane Lafortune Electrical Engineering and Computer Science Affiliate Faculty Research Interests System and control theory; discrete event systems; cyber-physical systems. Supervisory control, fault diagnosis, security and privacy in control systems. Formal methods of control. Application to automated and autonomous systems, multi-agent systems, software systems, and computer systems. SangHyun Lee Civil and Environmental Engineering Affiliate Faculty Research Interests Human Robot Collaboration in Construction, Markerless Motion Capture, Brain Robot Interface Honglak Lee Computer Science and Engineering Affiliate Faculty Research Interests Artificial intelligence, signal and image processing, robotics and computer vision. Wes McGee Architecture and Material Performance Affiliate Faculty Research Interests Robotic applications in architecture and construction, large-scale digital fabrication, offline simulation tool development, online control and sensing, algorithmic and parametric design workflows. Carol Menassa Civil and Environmental Engineering Affiliate Faculty Research Interests Automation and robotics, particularly as it applies to building sciences and construction engineering. Deploying autonomous robots for environmental data collection in buildings to facilitate automated control of building HVAC systems. Automated construction of built infrastructure in unstructured conditions with large tolerances and weak metrology, enabling human-robot collaboration in complex collaborative tasks. Rada Mihalcea Electrical Engineering and Computer Science Affiliate Faculty Research Interests Natural language processing, computational social sciences, multimodal tracking and understanding of human behavior. Human-Robot interaction. Mark Moldwin Climate and Space Sciences and Engineering Affiliate Faculty Research Interests Magnetometer and integrated sensor development for localization and navigation, with applications for indoor, underground, underwater and other GPS denied environments. Emily Mower Provost Computer Science and Engineering Affiliate Faculty Research Interests Audio-visual modeling of human behavior focusing on emotion. Focus on assistive speech-based technologies. Lauro Ojeda Mechanical Engineering Affiliate Faculty Research Interests Mobile robotics, position estimation, sensor fusion, simulation, adaptive systems, control systems and digital signal processing. This research enables projects in the fields of accurate localization and tracking systems for mobile robots and humans. Chinedum Okwudire Mechanical Engineering Affiliate Faculty Research Interests Manufacturing Automation: with key applications in 3-D printing, nano-positioning, machining, and smart manufacturing systems; Vehicle Automation: with key applications in electric power assist steering, steer-by-wire, and electric vehicle charging. Kenn Oldham Mechanical Engineering Affiliate Faculty Research Interests Design, fabrication, dynamics, sensing, and control of microscale systems, including autonomous, millimeter-scale micro-robots. Edwin Olson Computer Science and Engineering Affiliate Faculty Research Interests Machine perception, clustering and classification, tracking, navigation, planning, and map building. Gabor Orosz Mechanical Engineering and Civil and Environmental Engineering Affiliate Faculty Research Interests Nonlinear dynamics and control, time delay systems, reinforcement learning, connected and automated vehicles, traffic flow, biological networks. Andrew Owens Electrical Engineering and Computer Science Affiliate Faculty Research Interests Computer vision, multimodal learning, tactile sensing Alan Papalia Naval Architecture and Marine Engineering Affiliate Faculty Research Interests Robot navigation and perception; localization and mapping; autonomous environmental monitoring; marine robotics. Abdon Pena-Francesch Materials Science and Engineering Affiliate Faculty Research Interests Bioinspired materials for robotics, adaptive soft materials, small-scale actuation, soft robotics, self-healing robots, biodegradable microrobots Matthew Reed Transportation Research Institute and Industrial and Operations Engineering Affiliate Faculty Research Interests Human motion tracking and simulation; grasp modeling; computational modeling of perception, cognition, and motor action; driving monitoring and simulation. Shai Revzen Electrical and Computer Engineering Affiliate Faculty Research Interests Study of bio-inspired robotics and new methods and mechanisms for control. Scientific study of animal and human locomotion based on nonlinear dynamical systems, and application to design of legged robotic vehicles and other devices. Peter Seiler Electrical Engineering and Computer Science Affiliate Faculty Research Interests Robust control theory which focuses on the impact of model uncertainty on systems design. Co-author of the Robust Control Toolbox in Matlab. Developing theoretical and numerical algorithms to assess the robustness of systems on finite time horizons and use of robust control techniques to better understand optimization algorithms and model-free reinforcement learning methods. Includes advanced control techniques for wind turbines, fault-detection methods for safety-critical systems and robust control of disk drives. Satinder Singh Baveja Computer Science and Engineering Affiliate Faculty Research Interests Reinforcement learning and planning approaches to building artificial agents that can learn from experience to act autonomously in complex, stochastic, and partially-known environments. Vasileios Tzoumas Aerospace Engineering Affiliate Faculty Research Interests Perception, control, and online learning, as well as online combinatorial and distributed optimization, with applications to robotics, cyber-physical systems, and self-reconfigurable aerial systems. Brian Umberger Movement Science Affiliate Faculty Research Interests Bipedal locomotion, biomechanics, energetics, optimal control, computer modeling and simulation, motion analysis. Ja",
  "content_length": 11265,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:17"
}