{
  "name": "Vinny Cahill",
  "homepage": "https://www.scss.tcd.ie/Vinny.Cahill",
  "status": "success",
  "content": "Prof Vinny Cahill : Trinity College Dublin, the University of Dublin, Ireland Trinity College Dublin Skip to main content. Search TCD Your query: Top Level TCD Links TCD Home Faculties & Schools Courses Research Services Contact A – Z Prof Vinny Cahill School of Computer Science and Statistics Search Your query: You are here: Home Site map Home Research Research Students Teaching Publications Professional Activities Sitemap Contact Home Prof Vinny Cahill holds a Personal Chair in Computer Science at Trinity College Dublin. Prof Cahill has previously served as the University's Dean & Vice-President for Research, Dean of the Faculty of Engineering, Mathematics and Science - one of the University's three faculties, and in a number of other roles. Prof. Cahill's research addresses many aspects of distributed systems, in particular, middleware and programming models for mobile, ubiquitous and autonomic computing with application to optimization of urban resource usage and service delivery in order to improve the quality of life and sustainability of cities. Open Research Positions Together with my colleagues I am currently recruiting for the following positions: Postdoctoral Research Fellowship to investigate the use of deep reinforcement learning and swarm intelligence techniques to optimize urban and highway traffic in the presence of autonomated and conventional vehicles (Applications currently being accepted while the post remains unfilled). Postdoctoral Research Fellowship to investigate the use of machine learning to support the delivery of personalized mobility services at scale, in particular, enabling collaborative journey planning in the context of limited transportation capacity (Applications currently being accepted while the post remains unfilled). Last updated 3 November 2025 by Vinny Cahill (Email). Trinity College Dublin, College Green, Dublin 2. Central Switchboard: +353 1 896 1000. Accessibility Privacy Disclaimer Contact",
  "content_length": 1968,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:20"
}