{
  "name": "Vinnie Monaco",
  "homepage": "http://www.vmonaco.com",
  "status": "success",
  "content": "Home | Vinnie Monaco I’m a researcher and engineer. My work and interests span security, privacy, machine learning, artificial intelligence, human-computer interaction, and biologically-inspired computing. Some of my open source projects include: kloak, a privacy tool that obfuscates keystroke and mouse input event timings, making keystroke biometrics and device fingerprinting less effective. frailtySurv, an R package for simulating and fitting semiparametric shared frailty models. pohmm, a Python package that implements the partially observed hidden Markov model (POHMM). I currently work on data privacy at OpenAI. Previously, I was a Lead Data Scientist at Visa, Assistant Professor at the Naval Postgraduate School, and Computer Scientist at the U.S. Army Research Laboratory. News I joined OpenAI (July 2022) Old news I joined Visa Inc. as a lead data scientist (November 2021) Paper on device fingerprinting accepted to S&P’22 Program Co-Chair of the 2021 SADFE Workshop Best Paper @ CHI’20 for work in covert impairments in HCI Member of the SecureComm’20 Program Committee Paper on scaling up keystroke biometrics accepted to IJCB’20 Member of the WTMC’20 Program Committee Invited talk for the Rotary Club of Corral de Tierra (July 2020) Paper on covert impairments in human computer interaction accepted to CHI’20 Invited talk at the Sunset Center (Carmel, CA), hosted by the Carmel Public Library Foundation (February 2020) [slides] Autocomplete side channel paper accepted to USENIX’19 Member of the WTMC’19 Program Committee Invited talk at the 20th Monterey Workshop on Cyber (November 2018) Joined NPS as an Assistant Professor of Computer Science (August 2018) SoK paper on keylogging side channels accepted to S&P’18 Best Paper @ ISCAS’17 for work on factoring integers with a neuromorphic processor See also old press. Students See Calhoun for a list of theses I advised. Awards Best paper, CHI’20 Best Paper, ISCAS’17 Best Paper, UEMCON’17 Runner-up Neuromorph of the Year, Telluride NCEW’16 1st Place, Keystroke Biometrics Ongoing Competition 3rd Place, Look & Click Competition 1st Place, The Second Eye Movements Verification and Identification Competition One of Westchester’s Top Professionals Under 30 Select publications See the full list and Google Scholar. Device Fingerprinting with Peripheral Timestamps John V. Monaco 43rd IEEE Symposium on Security and Privacy (S&P 2022) [pdf] Bug or Feature? Covert Impairments to Human Computer Interaction John V. Monaco 2020 ACM Conference on Human Factors in Computing Systems (CHI 2020) Best Paper Award (top 1%) [pdf] What Are You Searching For? A Remote Keylogging Attack on Search Engine Autocomplete John V. Monaco 28th USENIX Security Symposium (USENIX 2019) [pdf] [code] SoK: Keylogging Side Channels John V. Monaco 39th IEEE Symposium on Security and Privacy (S&P 2018) [pdf] Factoring Integers with a Brain-Inspired Computer John V. Monaco, Manuel M. Vindiola IEEE Transactions on Circuits and Systems I, 2017 [pdf] The Partially Observable Hidden Markov Model and its Application to Keystroke Dynamics John V. Monaco, Charles C Tappert Pattern Recognition, 2017 [pdf]",
  "content_length": 3154,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:19"
}