{
  "name": "Vipin Kumar 0001",
  "homepage": "http://www-users.cs.umn.edu/~kumar",
  "status": "success",
  "content": "Vipin Kumar's Home Page.. Vipin Kumar's Home Page Affiliations and Address: kumar001 at umn.edu http://www.cs.umn.edu/~kumar/ Assistant: Bobbie (Barbara) Scott kradmin@umn.edu> Phone (612) 626 7514, Fax (612) 625 0572 Regents Professor and William Norris Endowed Chair Department of Computer Science and Engineering Director, CSE Data Science Initiative 5-225C, Keller Hall University of Minnesota Minneapolis, MN 55455 Phone (612) 624 8023 [short bio], [full vita], [honors], [research], [books], [publications], [Google Scholar Link], [h-index Link], [software packages], [talks], [news], [alumni], [professional activities], Short Biography Vipin Kumar is a Regents Professor at the University of Minnesota, where he holds the William Norris Endowed Chair in the Department of Computer Science and Engineering. Kumar received the B.E. degree in Electronics & Communication Engineering from Indian Institute of Technology Roorkee (formerly, University of Roorkee), India, in 1977, the M.E. degree in Electronics Engineering from Philips International Institute, Eindhoven, Netherlands, in 1979, and the Ph.D. degree in Computer Science from University of Maryland, College Park, in 1982. He also served as the Head of the Computer Science and Engineering Department from 2005 to 2015 and the Director of Army High Performance Computing Research Center (AHPCRC) from 1998 to 2005. Kumar's research spans data mining, high-performance computing, and their applications in Climate/Ecosystems and health care. His research has resulted in the development of the concept of isoefficiency metric for evaluating the scalability of parallel algorithms, as well as highly efficient parallel algorithms and software for sparse matrix factorization (PSPASES) and graph partitioning (METIS, ParMetis, hMetis). He has authored over 300 research articles, and has coedited or coauthored 10 books including two text books ``Introduction to Parallel Computing'' and ``Introduction to Data Mining'', that are used world-wide and have been translated into many languages. Kumar's current major research focus is on bringing the power of big data and machine learning to understand the impact of human induced changes on the Earth and its environment. Kumar served as the Lead PI of a 5-year, $10 Million project, \"Understanding Climate Change - A Data Driven Approach\", funded by the NSF's Expeditions in Computing program that is aimed at pushing the boundaries of computer science research. Kumar has served as chair/co-chair for many international conferences in the area of data mining, big data, and high performance computing, including 25th SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2019), 2015 IEEE International Conference on Big Data, IEEE International Conference on Data Mining (2002), and International Parallel and Distributed Processing Symposium (2001). Kumar co-founded SIAM International Conference on Data Mining and served as a founding co-editor-in-chief of Journal of Statistical Analysis and Data Mining (an official journal of the American Statistical Association). Currently, Kumar serves on the steering committees of the SIAM International Conference on Data Mining and the IEEE International Conference on Data Mining, and is series editor for the Data Mining and Knowledge Discovery Book Series published by CRC Press/Chapman Hall. Kumar has been elected a Fellow of the Association for Advancement of Artificial Intelligence (AAAI), the American Association for Advancement for Science (AAAS), Association for Computing Machinery (ACM), Institute of Electrical and Electronics Engineers (IEEE), and Society for Industrial and Applied Mathematics (SIAM). He received the Distinguished Alumnus Award from the Indian Institute of Technology (IIT) Roorkee (2013), the Distinguished Alumnus Award from the Computer Science Department, University of Maryland College Park (2009), and IEEE Computer Society's Technical Achievement Award (2005). Kumar's foundational research in data mining and high performance computing has been honored by the ACM SIGKDD 2012 Innovation Award, which is the highest award for technical excellence in the field of Knowledge Discovery and Data Mining (KDD), the 2016 IEEE Computer Society Sidney Fernbach Award, one of IEEE Computer Society's highest awards in high-performance computing, and Test-of-time award from 2021 Supercomputing conference (SC21). Complete Vita For a full vita with complete list of publications click here. Recent Professional Activities.. Conference Co-Chair, 25th SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2019) Series Editor, Data Mining and Knowledge Discovery - CRC Press Book Series Founding Editor, Statistical Analysis and Data Mining Steering Committee Member, SIAM International Conference on Data Mining Steering Committee Member, IEEE International Conference on Data Mining Research Projects.. Curent Projects NSF BIGDATA : Advancing Deep Learning to Monitor Global Change see this article for more information NSF INFEWS : Innovations for Sustainable Food, Energy, And Water Supplies In Intensively Cultivated Regions: Integrating Technologies, Data, And Human Behavior DARPA World Modeler: Model Integration through Knowledge-Rich Data and Process Composition GOPHER: Global Observatory for Planetary Health and Ecosystem Resources Recently Completed Projects NSF Expedition in Computing : Understanding Climate Change - A Data Driven Approach See NSF news item that highlights this project. Books.. Introduction to Data Mining Pang-Ning Tan, Michael Steinbach, Vipin Kumar Addison-Wesley, 2005. ISBN : 0321321367. Introduction to Parallel Computing, (Second Edition) Ananth Grama, Anshul Gupta, George Karypis, and Vipin Kumar. Addison-Wesley, 2003. ISBN 0-201-64865-2. International Chinese Edition 2003, Chinese translation, China Machine press, 2004. Computational Approaches for Protein Function Prediction by Gaurav Pandey, Chad L. Myers, Michael Steinbach and Vipin Kumar, 2008<.br> Managing Cyber Threats: Issues, Approaches and Challenges, edited by V. Kumar, J. Srivastava, and A. Lazarevic, Springer, ISBN 0-387-24226-0, May 2005. Data Mining for Scientific and Engineering Applications, edited by R. Grossman, C. Kamath, W. P. Kegelmeyer, V. Kumar, and R. Namburu, Kluwer Academic Publishers, 2001. ISBN: 1-4020-0033-2. Introduction to Parallel Computing: Design and Analysis of Algorithms by Vipin Kumar, Ananth Grama, Anshul Gupta and George Karypis, Benjamin-Cummings Publishing Company, November 1993. Parallel Processing for Artificial Intelligence, Volume 1, edited by Laveen Kanal, Vipin Kumar, Hiroaki Kitano and Christian B. Suttner, North-Holland, June 1994. Parallel Processing for Artificial Intelligence, Volume 2, edited by Hiroaki Kitano, Vipin Kumar, and Christian B. Suttner, North-Holland, July 1994. Search in Artificial Intelligence, edited by Laveen Kanal and Vipin Kumar, Springer-Verlag, 1988. Parallel Algorithms for Machine Intelligence and Vision edited by V. Kumar, P.S. Gopalkrishnan, and L. Kanal, Springer-Verlag, March 1990. Software Packages METIS/ParMETIS/hMETIS - Serial and Parallel Graph Partitioning Libraries PSPASES - A Scalable Parallel Direct Solver Library for Sparse SPD Systems",
  "content_length": 7253,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:24"
}