{
  "name": "Vir V. Phoha",
  "homepage": "https://news.syr.edu/faculty-experts/vir-v-phoha",
  "status": "success",
  "content": "Home | Syracuse University Today Home | Syracuse University Today Search Search STEM STEM Transforming Cancer Treatment With Ultrasound University chemists are testing a novel method of using sound waves to activate chemotherapy drugs precisely where they're needed while sparing healthy cells. Nov. 25, 2025 × Video Player Featured Stories View All How Much Do We Trust Virtual Influencers? Nov. 25, 2025 How to Embrace Your First Winter on Campus Nov. 24, 2025 Groundbreaking Talk Show Series Brings Indigenous Voices to the Mainstream Nov. 19, 2025 × Syracuse University Impact View All Orange Student-Athletes Giving Back Is a Win-Win Nov. 20, 2025 How Syracuse University Courses in High School Change Lives Nov. 17, 2025 Hendricks Chapel Awarded $500K for Leadership Program Nov. 14, 2025 × Campus & Community View All Giving Thanks Through Community Outreach Abroad Nov. 26, 2025 Connecting the Orange Network Nov. 26, 2025 Syracuse Stage Named Recipient of Indigenous Theatermaker Award Nov. 24, 2025 × Featured Media Business & Entrepreneurship Business & Entrepreneurship ’CUSE50 2025 in Photos The University community came together to celebrate entrepreneurship and ingenuity during the annual ’CUSE50 Alumni Entrepreneur Awards and Student Summit. Health, Sport & Society Health, Sport & Society Jim Boeheim’s New Play: Teaching Leadership at Syracuse Legendary men's basketball coach Jim Boeheim trades the hardwood for the classroom as an adjunct professor in the Falk College of Sport. Campus & Community Campus & Community Syracuse Views Fall 2025 The latest views from every corner of Syracuse University's vibrant campus community. Campus & Community Campus & Community Costumes and Camaraderie: Halloween at Syracuse University community members showcased creativity with themed costumes and festive activities across campus. STEM STEM What Happens When the Sun Burps? Physics expert Sam Sampere breaks down solar maximum, coronal mass ejections and why even the biggest solar eruption is a drop in the cosmic bucket. × Video Player Upcoming Events View All Events Giving 'Cuseday Dec. 2, 11 a.m.|Schine Student Center Open Houses and Receptions What's Brewing with the Chaplains? Dec. 1, 2 p.m.|Bird Library Lectures, Seminars and Discussions Community Writing Workshop Dec. 1, 6 p.m.|Community Folk Art Center Club and Intramural Sports Canoe Battleship Dec. 2, 8 p.m.|Barnes Center at The Arch Information Sessions 2026-27 Resident Advisor Info Session Dec. 3, 5 p.m.|Schine Student Center Syracuse University in the News View All Bloomberg Law DOJ Memo Draws Doubts on Military Lawyers as Immigration Judges William Banks, professor emeritus in the College of Law, explains how constitutional and impartiality issues could come into play. Financial Times Japan and China Spar Over Taiwan as Donald Trump Tilts Global ‘Chessboard’ Margarita Estévez-Abe, associate professor in the Maxwell School, says both Japan and China feel emboldened after recent wins, which is making their rhetoric tougher. L’Orient-Le Jour Dick Cheney’s Policies Continue to Haunt American Power. Osamah Khalil, professor in the Maxwell School, says Cheney’s post-9/11 policies left a deep, lasting impact on U.S. politics. The Associated Press Flight Cuts From Government Shutdown Strain Supply Chain That’s Already Stretched Thin Patrick Penfield, professor in the Whitman School, explains how the recent reduction in air traffic created a one-two punch for consumer goods. The New York Times Who Pays When A.I. Is Wrong? Nina Brown, associate professor in the Newhouse School, provides an analysis of the legal implications surrounding AI-generated content. Sportsology The NHL and Syracuse University Come Together for Higher Learning Jeremy Jordan, dean of the Falk College of Sport, examines the significance of a new partnership between the National Hockey League and Syracuse University.",
  "content_length": 3893,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:24"
}