{
  "name": "Virendra Singh",
  "homepage": "https://www.cse.iitb.ac.in/~viren",
  "status": "success",
  "content": "Virendra Singh Virendra Singh, Ph.D(NAIST, Japan) PROFESSOR Department of Electrical Engineering, and Department of Computer Science & Engineering Indian Institute of Technology Bombay Powai, Mumbai 400076 India E-mail : viren@ee.iitb.ac.in, viren@cse.iitb.ac.in singhv@iitb.ac.in, virendra@computer.org Tel : +91-22-2576-9432 (O) +91-22-2576-8432 (R) Fax : +91-22-2572-3707 Office : 122 D, EE Building My Calendar ________________________________________________________________________________________________________ Publications . Teaching . Funding . Professional Activities . Students . Visitors . RASDAT . IWPVTD . WHF _____________________________________________________________________________________________________ Research Lab.: Computer Architecture and Dependable Systems Lab. (CADSL) Coordinator: Indo-Japanese Joint Laboratory for Intelligent Dependable Cyber Physical Systems (IDCPS) Coordinator (PI): Information Security Research and Development Centre (ISRDC) Associated Lab: Gigabit Networking Lab. (GNL), CSE Associated Lab: Centre of excellence for Blockchain research Affiliation: Centre for Machine Intelligence and Data Science Affiliation: IEEE Computer Society Bombay chapter New: Requirements: PDFs, Ph.D Aspirants, Project Associates/Assistants (experience in Cyber Security) New Project: AI powered adaptive cyber defence framework (sponsored by NSCS, GoI), Trustable cyber physical cognitive system, Security of Futuristic technologies (AI/ML/AR/VR) Announcements: Funding: DST-JST funding, DRDO funding, SRC funding, NSCS funding Papers: ISCAS`21 paper Conferences: VDAT`22, ITC-India`22, RASDAT`22, ICISS-22 Received SP Sukhatme excellence in teaching award in 2021 Courses: [Current Semester- Spring 2022]: CS-230: Digital Logic Design & Computer Architecture, CS-232: Digital Logic Design & Computer Architecture Lab., EE-739: Processor Design, EE-309: Microprocessors [Last Semester- Autumn 2021]: EE-748: Advanced Topics in Computer Architecture, CS-683: Advanced Computer Architecture, EE-677: Foundation of VLSI CAD Debates at EE-748: End to VN Architecture, Is Microarchitecture dead ? A note for students _____________________________________________________________________________________________________ Research Interest: Cyber security Computer architecture Compiler support for modern architectures Fault-tolerant computing Formal verification Trusted computing Cyber physical cognitive systems Software defined networking (SDN) Blockchain Technology Education: Ph.D (Computer Science) - (2002-2005) Nara Institute of Science and Technology (NAIST) Kansai Science City, Nara, Japan Advisor: Prof. Hideo Fujiwara Co-Advisors: Prof. Kewal K. Saluja (Univ. of Wisconsin-Madison, USA) and Prof. Michiko Inoue (NAIST) Thesis: Instruction-Based Self-Testing of Performance Oriented Faults in Modern Processors M.E (Electronics & Communication) - (1994-1996) Malaviya National Institute of Technology (MNIT) Jaipur (Rajasthan) India Advisor: Prof. MS Gaur Thesis: Simulation of ATM Networks with Heavy Tail Traffic Distribution B.E (Hons) in Electronics & Communication - (1990-1994) Malaviya National Institute of Technology (MNIT) Jaipur (Rajasthan) Professional Experience: Faculty member, Indian Institute of Technology Bombay (Since Dec 2011) Faculty member, SERC (presently CDS dept.), Indian Institute of Science (IISc), Bangalore (May 2007 - Dec 2011) Scientist, Central Electronics Engg. Research Institute (CEERI), Pilani (Mar 1997 - May 2007) Faculty member, Banasthali University (Jun 1996 - Mar 1997) Current Major Research Projects: Security of Futuristic technology (AI/ML/AR/VR etc.) (2024 - 2029) Sponsor: Ministry of Electronics & Information Technology Funding: INR 4.7 Crores Using natural language for aligning reinforcement learning agents Agency: Amazon (2024 - 2026) Architecting Trustable Cyber Physical Cognitive Systems (with Tokyo University, Japan) (2023-27) Sponsor: DST (India), and JST (Japan) Funding: INR 6 Crores AI Powered Adaptive Cyber Defence Framework (2021  2023) Sponsor: National Security Council Secretariat (NSCS), Govt. of India, Funding: USD 16M (INR 1.2 Arab) Architecting Intelligent Dependable Cyber Physical System Targeting IoTs and Mobile Big Data Analysis (2017-2022) Sponsor: JST & DST, Funding: INR 12.5 Crores (IITB: INR 5.1 Crores, and Tokyo Univ.: Yen 14.8 Crores) Analyzing vulnerabilities in applications and device drivers in Linux and Windows OS platforms using symbolic execution (with IIT Jammu and MNIT Jaipur) Publications: List of my publications Recent Publications: Papers in 2025 · Raghunandana K, Yogesh Prasad R, Matteo Sonza Reorda, and Virendra Singh, `GPD: Predictive control flow error detection leveraging data flow error detection methods`, Proc. of 31st International Symposium on Online Testing and Robust System Design (IOLTS-25), Ischia, Italy, July, 2025. · Rushikesh Kawale, Sonali Shukla, Makoto Ikeda, Masahiro Fujita and Virendra Singh, `HiPeR-SM: High Performance Reconfigurable Scalar Multiplier over NIST-P256 and CURVE25519`, 34th International Workshop on Logic & Synthesis (IWLS 2025), Verona, Italy, June, 2025. · Varun Venkitaraman, Rishabh Ravi, Tejeshwar Thorawade, Nirmal Boran, and Virendra Singh, `SCAM: Secure shared cache partitioning to enhance throughput of CMPs`, Proc. of 22nd International Conference on Security and Cryptography (SECRYPT 2025), Bilboa, Spain, June, 2025 · Nikhil Kumar Parida, Sarath Babu, Neeraj Pawar, and Virendra Singh, `EDQKD: Enhanced-Dynamic Quantum Key Distributions with Improved Security and key rate`, Proc. of 22nd International Conference on Security and Cryptography (SECRYPT 2025), Bilboa, Spain, June, 2025 · Rushikesh Kawale, Sarath Babu, and Virendra Singh, `Stegoslayer: A robust browser integrated approach for Thwarting Stegomalware`, Proc. of 22nd International Conference on Security and Cryptography (SECRYPT 2025), Bilboa, Spain, June, 2025 Varun Venkitaraman, Shrasti Bhargava, Tejeshwar Bhagatsing Thorawade, Keerthisagar Kokkiligadda, Rahul Kumar, Virendra Singh, `RRR: Robust Runtime Reconfigurable Shared Cache Management Scheme for GPGPUs`, Proc. of 58th IEEE International Symposium on Circuits and Systems 2025 (ISCAS 2025), London, UK, May 2025 Anjum Riaz, Gaurav Kumar, Yamuna Prasad, Satyadev Ahlawat, and Virendra Singh, `A New Hardware Trojan Attack on Scan-obfuscated Logic-locked Circuits`, Proc. of 58th IEEE International Symposium on Circuits and Systems 2025 (ISCAS 2025), London, UK, May 2025. Yogesh Gholap, Prajakta Yeola, Virendra Singh, `On Developing a Hybrid Cyber-Physical Testbed for Cyber-Secure Industrial Control System`, Proc. of IEEE Latin American Conference on Internet of Things (LatinIoT-2025), Forateza, Brazil, April 2025 · Prakhar Diwan, Nirmal Kumar Boran, and Virendra Singh, `Li-chen: Leveraging Coupled Heterogeneity`, Proc. of 38th International Conference on VLSI Design (VLSID-2025), Bangalore, India, Jan 2025 · Aditi Gupta, Adeiza James Onumanyi, Satyadev Ahlawat, Yamuna Prasad, and Virendra Singh, `B-CAVE: A robust online time series change point detection algorithm based on between-class average and variance evaluation approach`, IEEE Trans. on Knowledge and Data Engineering (TKDE), vol. 37, no. 1, Jan 2025 Selected Publications (Before 2025): · Suma Sri Mandru, Srikanth Yadav Chakka, Tikaram Sanyasi, and Virendra Singh, `MALAI: ML-based attack on learning with error (LWE) problem`, Proc. of 20th International Conference on Information Systems Security (ICISS 2024), Jaipur, India, Dec 2024 · Tarun Bisht, Sarath Babu, and Virendra Singh, `Critical behaviour sequence monitoring for early malware detection`, Proc. of 17th International Conference on Security of Information Networks (SINConf-2024), Sydney, Australia, Dec 2024 · Tejeshwar Thorawade, Prajakta Yeola, Varun Venkitaraman, and Virendra Singh, `S-Cflush: Securing against flush-based cache timing side channel attacks`, Proc. of 36th IEEE International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD 2024), Hawaii, USA, Nov 2024 · Samiksha Verma, and Virendra Singh, `SMS: Solving many RowHammer`, Proc. of 11th International Symposium on Memory Systems (MEMSYS-24), Washington DC, Oct 2024 · Tikaram Sanyasi, Nirmal Kumar Boran, and Virendra Singh, `Secure KNN Computation on Cloud`, Proc. of 19th International Conference on Information Systems Security (ICISS 2023), Raipur, India, Dec 2024 · Neha Hooda and Virendra Singh, Brutector: A probabilistic detection model for Bruteforce attacks in SSH servers, Proc. of 16th International Conference on Security of Information Networks (SINConf-2023), Jaipur, India, Dec 2023 · Varun Venkitaraman, Ashok Sathyan, Shrihari Deshmukh, and Virendra Singh, Novel efficient synonym handling mechanism for virtual real cache hierarchy, Proc. of IEEE Design Automation and Test in Europe (DATE23), Antwerp, Belgium, April 2023 Ashwin Lele, Srivastava Jandhyala, Saurabh Gangurde, Virendra Singh, Srinivas Subramoney, and Udayan Ganguly, `Disrupting low-write energy vs fast-read dilemma in RRAM to enable L1 instruction cache`, 26th International Symposium on VLSI Design and Test (VDAT22), Jammu, India, July 2022 · Chandramani Chaudhary, Nirmal Kumar Boran, N Sangeeth, and Virendra Singh, GNNDLD: Graph neural network with directional label distribution, Proc. of 16th International Conference on Agents and Artificial Intelligence (ICAART 2024), Feb 2024. Jaynarayan Tudu, Satyadev Ahlawat, Sonali Shukla, and Virendra Singh, `A framework for configurable for joint-scan design-for-test architecture`, Journal of Electronic Testing: Theory and Application, 2021 Arindam Sarkar, Newton Singh, Varun Venkitaraman, and Virendra Singh, `DAM: Deadlock aware migration techniques for STT-RAM based hybrid caches`, IEEE Computer Architecture Letters (CAL), 20(1), 2021 Nirmal Kumar Boran, Shubhankit Rathore, Meet Udeshi, and Virendra Singh, `Fine-grained scheduling in heterogeneous-ISA architectures`, IEE",
  "content_length": 29644,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:26"
}