{
  "name": "Virginia Mato",
  "homepage": "https://pdi.udc.es/en/File/Pdi/SW2CH",
  "status": "success",
  "content": "Virginia Mato Abad File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Ingeniería del Software Research lines Procesado de imagen, machine-learning Contacto UDC directory Orcid id0000-0001-7161-4382 ResearcherIDD-5253-2013 Scopus56659428400 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Engineering Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2.5 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 30 Programming I Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 15 Quality, Information Security and Computing Audit Master's in Computer Engineering Compulsory 0 5 Software Process Degree in Computer Engineering Compulsory 0 150 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 0.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 3 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 10 Programming I Degree in Computer Engineering Core 0 5 Quality, Information Security and Computing Audit Master's in Computer Engineering Compulsory 0 5 Software Process Degree in Computer Engineering Compulsory 0 214 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Programming I Degree in Computer Engineering Core 0 30 Software Development Projects Degree in Computer Engineering Optional 0 62 Software Process Degree in Computer Engineering Compulsory 0 120 Subject and involved studies Type Distance hours Total hours Programming I Degree in Computer Engineering Core 0 30 Software Development Projects Degree in Computer Engineering Optional 0 41 Software Process Degree in Computer Engineering Compulsory 0 126 Subject and involved studies Type Distance hours Total hours Programming I Degree in Computer Engineering Core 0 30 Software Development Projects Degree in Computer Engineering Optional 0 41 Software Process Degree in Computer Engineering Compulsory 0 146 Subject and involved studies Type Distance hours Total hours Programming I Degree in Computer Engineering Core 0 40 Software Development Projects Degree in Computer Engineering Optional 0 49 Software Process Degree in Computer Engineering Compulsory 0 181 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Wednesday 11:00 a 14:00 Despacho 3.05 Edificio Área Científica 1st quarter Thursday 09:30 a 12:30 Despacho 3.05 Edificio Área Científica 2nd quarter Tuesday 11:00 a 14:00 Despacho 3.05 Edificio Área Científica 2nd quarter Wednesday 09:30 a 12:30 Despacho 3.05 Edificio Área Científica EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2021/2022 Android mobile application for creating and managing amateur football leagues Design implementation of a platform for hiring freelance professionals A Web Application for an official support website for an online game Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Book chapters Conference papers 2024 2022 2021 2018 2017 ... 2013 2012 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Enrique Peña González (IP1) / Juan Ramón Rabuñal Dopico (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Consellería de Cultura, Educación, Formación Profesional e Universidades - Xunta de Galicia Type Proyecto Programas Autonomicos Dates From 30/04/2024 to 31/12/2027 Funding entity Cátedra ALDABA-WIB Type Contrato Dates From 01/02/2022 to 01/10/2022 Funding entity Ministerio de Ciencia e Innovación Main researches Peña González, Enrique- Rabuñal Dopico, Juan Ramón Type Proyecto Programas Nacionales Dates From 01/09/2021 to 31/08/2024 Funding entity MINISTERIO DE DEFENSA Main researches Alejandro Pazos Sierra Type Contrato Dates From 24/06/2021 to 30/12/2024 Funding entity Ministerio de Economía, Industria y Competitividad Main researches Enrique Peña González y Juan R. Rabuñal Dopico Type Proyecto Programas Nacionales Dates From 01/01/2018 to 31/12/2020 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 25/10/2017 to 31/12/2019 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 25/10/2017 to 31/12/2019 Funding entity MINISTERIO DE DEFENSA Main researches Alejandro Pazos Sierra Type Contrato Dates From 20/12/2017 to 20/12/2020 Funding entity Ministerio de Defensa Main researches Alejandro Pazos Sierra Type Contrato Dates From 03/01/2013 to 03/01/2015 Funding entity Comunidad de Madrid, Consejería de Educación Main researches Celso Arango Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 31/12/2015 2011 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Alejandro Pazos Sierra, Javier Pereira, Jorge Pintos Ruiz, Virginia Mato Abad, Manuel Cajaraville Martinez, Thais Pousada Garcia, Betania Groba, Nieto-Riveiro, L, Jose Manuel Vázquez Naya, Francisco J. Nóvoa, Marcos Martínez Romero, José Antonio Seoane Fernández Application date 26/10/2011 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Javier Pereira, Manuel Cajaraville Martinez, Thais Pousada Garcia, Betania Groba, Nieto-Riveiro, L, Virginia Mato Abad, Jose Manuel Vázquez Naya, Francisco J. Nóvoa, Marcos Martínez Romero, Dorado, L., Juan Ramón Rabuñal Dopico, Ana Belen Porto Pazos, José Antonio Seoane Fernández, Jorge Pintos Ruiz Application date 26/10/2011 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Alejandro Pazos Sierra, Javier Pereira, Jorge Pintos Ruiz, Virginia Mato Abad, Manuel Cajaraville Martinez, Thais Pousada Garcia, Betania Groba, Nieto-Riveiro, L, Jose Vázquez-Naya, Francisco J. Nóvoa, Marcos Martínez Romero, José Antonio Seoane Fernández Application date 26/10/2011 2021 2020 2019 2018 2016 ... 2015 2014 2013 2011 2010 2008 Authors Carlos Fernandez-Lozano, Pablo Hervella, Virginia Mato Abad, Manuel Rodríguez-Yáñez, Sonia María Suárez Garaboa, Iria López-Dequidt, Ana Estany-Gestal, Tomás Sobrino, Francisco Campos, José Castillo, Santiago Rodríguez-Yáñez, Ramón Iglesias-Rey Journal SCIENTIFIC REPORTS Vol. 11 Num. 10071 (pages 1 to 12) Authors Ángela Domingo-Santos, Andrés Labiano-Fontcuberta, Yolanda Aladro-Benito, M Luisa Martínez-Ginés, Lucía Ayuso-Peralta, Verónica Puertas-Martín, Marta Cerezo-García, Yolanda Higueras-Hernández, Virginia Mato-Abad, Juan Álvarez-Linera, Juan Antonio Hernández-Tamames, Julián Benito-León Journal Multiple Sclerosis and Related Disorders Vol. 49 DOI https://doi.org/10.1016/j.msard.2021.102749 Authors Marta Varela-Eirín, Paula Carpintero-Fernández, Agustín Sánchez-Temprano, Adrián Varela-Vázquez, Antonio Casado-Díaz, Alfonso Calañas Continente, Virginia Mato Abad, Eduardo Fonseca, Mustapha Kandouz, Alfonso Blanco, José Ramón Caeiro, María D. Mayán Journal Aging Vol. 12 Num. 16 (pages 15882 to 15905) DOI https://doi.org/10.18632/aging.103801 Authors Virginia Mato Abad, Labiano-Fontcuberta, Andres, Santiago Rodríguez Yáñez, Rafael Carlos García Vázquez, C. R. Munteanu, Javier Andrade Garda, Angela Domingo-Santos, Victoria Galán Sánchez-Seco, Aladro, Yolanda, Luisa Martínez-Ginés, Ayuso, Lucia, Benito-Leon, Julian Journal EUROPEAN JOURNAL OF NEUROLOGY Vol. 26 Num. 7 (pages 1000 to 1005) DOI https://doi.org/10.1111/ene.13923 Authors Julián Benito-León, Elan D. Louis, Virginia Mato-Abad, Alvaro Sánchez-Ferro, Juan P. Romero, Michele Matarazzo, J. Ignacio Serrano Journal Annals of Clinical and Translational Neurology Vol. 6 Num. 12 (pages 15882 to 15905) DOI https://doi.org/10.1002/acn3.50947 Authors Julián Benito-León, Juan P. Romero, Elan D. Louis, Alvaro Sánchez-Ferro, Michele Matarazzo, José A. Molina-Arjona, Virginia Mato-Abad Journal Annals of Clinical and Translational Neurology Vol. 6 Num. 11 (pages 2212 to 2222) DOI https://doi.org/10.1002/acn3.50916 Authors Benito-Leon, Julian, Mato-Abad, Virginia, Louis, Elan D., Antonio Hernandez-Tamames, Juan, Alvarez-Linera, Juan, Bermejo-Pareja, Felix, Domingo-Santos, Angela, José Luis Bouza Collado, Pablo Romero, Juan Journal SCIENTIFIC REPORTS Vol. 8 DOI https://doi.org/10.1038/s41598-018-22516-1 Authors Virginia Mato Abad, Isabel Jiménez, Rafael Carlos García Vázquez, José M. Aldrey, Rivero, D., Purificación Cacabelos, Javier Andrade Garda, Juan M. Pías Peleteiro, Santiago Rodríguez Yáñez Journal Applied Sciences Vol. 8 Num. 9 (pages 1629:1 to 1629:13) DOI https://doi.org/10.3390/app8091629 Authors Wilmer Rivas Asanza, Jennifer Célleri Pacheco, Javier Andrade Garda, Rafael Carlos García Vázquez, Virginia Mato Abad, Santiago Rodríguez Yáñez, Sonia María Súarez Garaboa Journal Sustainability Vol. 10 Num. 12 (pages 4792:1 to 4792:25) Authors Marta Varela-Eirin, Adrián Varela-Vázquez, Amanda Guitián-Caamaño, Carlos Luis Paíno, Virginia Mato Abad, Raquel Largo, Trond A",
  "content_length": 18251,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:30"
}