{
  "name": "Virgil D. Gligor",
  "homepage": "https://users.ece.cmu.edu/~virgil",
  "status": "success",
  "content": "Virgil D. Gligor Virgil D. Gligor Professor Department of Electrical and Computer Engineering Carnegie Mellon University Education B.Sc ('72),  M.Sc. ('73), Ph.D ('76),  University of California, Berkeley Teaching Spring 2008: 18733: Applied Cryptography Fall 2008: 18730: Introduction to Security Research Interests Network and Distributed Systems Security Distributed systems Applied Cryptography Recent Research MiniSec: A Secure Sensor Network Communication Architecture (.pdf) (In Proceedings of Sixth International Conference on Information Processing in Sensor Networks (IPSN), Cambridge, Massachusetts, April 2007) Distributed Detection of Node Replication Attacks in Sensor Networks (.pdf) (In Proceedings of the IEEE Symposium on Security and Privacy, Oakland CA, May 2005) Security of Emergent Properties in Ad-Hoc Networks (.ps) (.pdf) (Proc. of the Security Protocols Workshop, Sidney Sussex College, Cambridge, UK, April, 2004. To appear in Lecture Notes in Computer Science, Springer-Verlag, 2005.) Guaranteeing Access in Spite of Service-Flooding Attacks (.ps) (.pdf) (Proc. of the Security Protocols Workshop, Sidney Sussex College, Cambridge, UK, April 2-4, 2003. To appear in Lecture Notes in Computer Science, Springer-Verlag, 2004.) A Key-Management Scheme for Distributed Sensor Networks (.ps) (Proc. of the 9th ACM Conference on Computer and Communication Security, Washington D.C., November 2002.) Bootstrapping Security Associations for Routing in Mobile Ad-Hoc Networks (.ps) Institute for Systems Research, ISR Technical Report 2002-44, May 2002.(also available at http://bellatrix.isr.umd.edu/TechReports/ISR/2002/TR_2002-44/TR_2002-44.pdf) On Trust Establishment in Mobile Ad-Hoc Networks (.ps) (Proc. of the Security Protocols Workshop, Cambridge, UK, April 2002. To appear in Lecture Notes in Computer Science, Springer-Verlag, 2003.) Reasoning about Joint Administration of Access Policies for Coalition Resources (.pdf) (Proc. of IEEE Int. Conf. On Distr. Computing (ICDCS), pp. 429, Vienna, Austria, July 2002) On Message Integrity in Symmetric Encryption (.ps) (unpublished manuscript) February 2002. A Note on NSA's Dual Counter Mode of Encryption (.ps) (.pdf) Specification of Dual Counter Mode (.pdf) and NSA's response (.html) On Message Integrity in Symmetric Encryption (.ps) (Presented at the NIST Workshop on AES Modes of Operation, Baltimore, Maryland, October 20, 2000) Fast Encryption and Authentication: XCBC Encryption and XECB Authentication Modes (.ps) (Presented at the 2nd NIST Workshop on AES Modes of Operation, Santa Barbara, CA, August 24, 2001) On the Negotiation of Access Control Policies (.ps) (Proc. of the Security Protocols Workshop, Cambridge, UK, April 2001. Lecture Notes in Computer Science, Springer-Verlag, 2002.) Enforcing Dependencies between PKI Certificates in ad-hoc Networks, (.ps) (IEEE International Conference on Telecommunications, Bucharest, Romania, June 2001, pp. 293-298.) Review and Revocation of Access Privileges Distributed with PKI Certificates (.ps)  (Proc. of the Security Protocols Workshop, Cambridge, UK, April 2000, Lecture Notes in Computer Science vol. 2133, Springer-Verlag, 2001.) Application-Oriented Security Policies and their Composition (.ps) (Proc. of the Security Protocols Workshop, Cambridge, UK, April 1998, Lecture Notes in Computer Science vol 1550, Springer-Verlag 1999) On the Formal Definition of Separation of Duty Policies and their Composition (.ps) (Proc. of the 1998 IEEE Symposium on Security and Privacy, Berkeley, CA. May 1998.) Recent Projects ARO MURI: Designing Reliable and Secure Tactical MANET's PROJECTS: DARPA IA&S - Dynamic Coalition Management Mailing Address: Virgil D. Gligor 2123 CIC 4720 Forbes Avenue Pittsburgh, PA 15213 Phone: (412) 268-9833 gligor@cmu.edu http://www.ece.cmu.edu/~gligor Last Update 12 August 2008",
  "content_length": 3852,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:26"
}