{
  "name": "Vishal Garg",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-vishal-garg",
  "status": "success",
  "content": "Dr. Vishal Garg | Director, Indorama Ventures Center for Clean Energy, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Vishal Garg Vishal Garg Director, Indorama Ventures Center for Clean Energy Professor, Plaksha University PhD, Centre for Energy Studies (IIT Delhi) Area of Expertise: Energy Efficient and Smart Buildings Select About Research Awards Publications Patents Professional Committees About Vishal Garg Dr. Vishal Garg is a University Chair Professor and the Director of Indorama Ventures Center for Clean Energy. He works on various aspects of energy efficiency in buildings, such as building energy simulation for designing energy-efficient buildings and automation and controls for efficient operations. His current focus is on Smart Energy Homes. He is developing and field testing a Smart Home Energy Management System (SHEMS) to understand its impact on energy savings and demand reduction. This work also includes psychological evaluations and sociological approaches to understanding people’s energy behaviour. He is also involved in policy-making and market research of smart energy homes and is incubating a start-up to facilitate lab to market. Prof Garg is enthusiastic about cool surfaces for mitigating the impact of Urban Heat Islands, thereby reducing cooling energy consumption, offsetting global warming, and saving the lives of the urban poor, especially during heatwaves. He has impacted the deployment of over one million square feet of cool surfaces in the country and is currently supporting the development of a cool roof policy for Telangana with a target of 100 sq. km of cool roofs in Hyderabad. He is the recipient of the inaugural Dr Arthur Rosenfeld Urban Cooling Achievement Award - an award established by the Global Cool Cities Alliance to honour the legacy of Dr Rosenfeld’s advocacy for cooler buildings, cooler cities and a cooler planet. He serves on the editorial board of well-known journals, is a member of several national and international academic committees, was the founding president and board member of the International Building Performance Simulation Association’s (IBPSA) Indian affiliate, is an executive committee member of Alliance for an Energy-Efficient Economy and is a panellist for a chapter on sustainability in the National Building Code of India. As a task force member of ISHRAE, he has contributed to the Covid-19 guidelines on air conditioning and ventilation for healthcare facilities. He is also a project committee voting member in the ASHRAE’s Standing Standard Project Committee 90.2: Energy Efficient Design of Low-Rise Residential Buildings. He is a Fellow of IBPSA-world, the Indian Green Building Council (IGBC) and the Indian Society of Lighting Engineers. Garg also has a US patent for his research on Transactive-Energy based Task Controls which he plans to productise. He teaches Building Energy Simulation, Green Buildings, and Illumination Engineering. He is a lead author of a workbook on building energy simulation. Research Research Projects: ●   Residential building energy demand reduction in India (RESIDE), PI, 2018-2022. The Indo-UK project – RESIDE, in partnership with OBU UK, supports the improvement of living conditions for millions of Indian citizens through establishing the knowledge base to develop a residential code for high-quality, low-energy housing across all five climatic zones in India. Leading the following work packages: Large-scale monitoring campaign and field survey using low-cost data collection methods; Design, trial, evaluate and refine Smart Home Energy Management System for monitoring, disaggregating, communicating and managing electricity demand; Residential building energy code, compliance tool and implementation roadmap. ●   Development and performance analysis of double pane semi-transparent solar photovoltaic window/facade system, Co-PI, 2017-2020. The objective of this project is to develop a new semi-transparent solar photovoltaic (STPV) and spectrally selective glass-based window/façade system. The novelty of this project is the development of a new window system to facilitate maximum power generation along with minimum energy consumption for visual and thermal comfort in a built environment. Leading the development of control algorithms for external/internal blinds that optimize the performance of the proposed new system and at the same time utilize maximum daylighting and minimizing energy consumption of the internal task lighting. ●   Center for Building Energy Research and Development (CBERD), Co-PI, 2012-2017. The overall objective of CBERD was to build a solid foundation for technologies research and development, knowledge, workforce development, and collaboration to position both the U.S. and India toward a future of clean energy economy and high-performance energy-efficient buildings. Lead the tasks related to Simulation and Modelling, Integrated Sensor and Controls, and Cool roof. ●   Controlled experiment for estimating the energy-saving potential and indoor thermal comfort improvement by use of high albedo surfaces on pitched concrete roof, Co-PI, 2015-2017. The objective of this project was to develop a test platform to understand the effects of high albedo roofs and to test future materials and technologies developed by industry. Performance monitoring of cool roofs in test huts was undertaken in two different climatic zones of India. Using this ground data, a simulation model was created using the EnergyPlus energy simulation program which can then be used to update the cool roof calculator. ●   “Cool Roofs for Rural Poor: Saving Energy, Beating the Heat Affordably” under World Bank Innovation Challenge Program, PI, 2014. ●   Earth System Cooling with Reflective Roofs: Experimental Verification and Model-based Evaluation for Selected Cities, Co-PI, 2011-2012. Policy Support: ●      Supporting the development of a section on Smart Home for Eco Niwas Samhita 2021 Part -II (a national level energy conservation building code for residences) for Bureau of Energy Efficiency (BEE) ●      Technical Assistance in development of ‘Making Telangana a Cool State - State-Wide Cool Roofs Program’ ●      Providing technical assistance in the development and implementation of ECBC at the national level and state level. AP and Telangana are the first states to implement ECBC in India. ●      Supporting the development of standards on Smart Technology (IoT) in the field of Refrigeration and Air-conditioning for the Bureau of Indian Standards MED 03 ●      Supporting the development and implementation of Green Building Rating Systems (eg. Green Homes, Green Factories) by Indian Green Building Council Awards •    Fellow, International Building Performance Simulation Association (",
  "content_length": 14259,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:31"
}