{
  "name": "Vishnu Naresh Boddeti",
  "homepage": "http://vishnu.boddeti.net",
  "status": "success",
  "content": "Vishnu's Homepage Vishnu’s Homepage Vishnu's Homepage Vishnu Boddeti Associate Professor Email Twitter Google Scholar LinkedIn Github Lab Webpage Vishnu Naresh Boddeti is an Associate Professor in the Department of Computer Science and Engineering at Michigan State University (MSU) and the Director of the Human Analysis Lab Research Interests: Modern machine learning systems are critically dependent on data representations. My research in this area focuses on designing computationally and statistically efficient algorithms for learning such representations and understanding their behavior through concepts such as convergence, complexity, privacy, fairness, and security. I am specifically interested in developing novel modeling paradigms that afford explicit control over the semantic information content in a representation. My research agenda is directly motivated by and contributes to applications in machine learning, computer vision, biometric recognition, and medical imaging. Hiring: I am always looking for motivated students with strong mathematical backgrounds. Please read this before sending me an email. Otherwise, do not expect a reply. I value people who are attentive to details. News: 10/25/2024 Mechanics-informed autoencoder enables automated detection and localization of unforeseen structural damage was published in Nature Communications and received a Editor Highlight. 09/15/2024 Towards Transmission-friendly and Robust CNN Models over Cloud and Device won the 2024 IEEE-CCF Best Paper Award 10/02/2023 Discovering Adaptable Symbolic Algorithms from Scratch was a Best Paper Award Finalist at IROS 2023. 08/01/2023 HERS: Homomorphically Encrypted Representation Search was chosen as the Best Student Paper Award by TBIOM for 2022-2023. 07/27/2023 Paper on HADAR: Heat-Assisted Detection and Ranging appeared on the cover of Nature. Video Description 03/20/2023 Workshop on International Workshop on Federated Learning for Distributed Data Mining: Methods and Applications is accepted to KDD 2023. 02/15/2023 Tutorial on Multi-Objective Optimization for Deep Learning is accepted to CVPR 2023. 02/20/2023 Dr. Boddeti will be an Area Chair at AutoML 2023 02/01/2023 Congratulations to Bashir Sadeghi, whose paper On Characterizing the Trade-off in Invariant Representation Learning received a Featured Certification at Transactions on Machine Learning Research (TMLR). Update: The paper was a finalist for outstanding certification. 10/15/2022 Congratulations to Luke Sperling, whose paper HEFT: Homomorphically Encrypted Fusion of Biometric Templates received the Best Student Paper Award at IJCB 2022. 10/01/2022 Congratulations to Xuyang Li, whose paper Methods For The Rapid Detection Of Boundary Condition Variations in Structural Systems received the Student Best Paper Award at SMASIS 2022. 06/01/2022 Dr. Boddeti will be a Web Chair for FG 2023 05/01/2022 Dr. Boddeti will be an Area Chair at IJCB 2022 02/20/2022 Dr. Boddeti will be an Area Chair at AutoML 2022 01/01/2021 Received a Facebook Research Grant on Multi-objective Co-evolutionary Leaning along with Prof. Kalyanmoy Deb. 07/17/2019 Congratulations to Zhichao Lu, whose paper NSGA-NET: A Multi-Objective Genetic Algorithm for Neural Architecture Search received the Best Paper Award (EML Track) at GECCO 2019. 02/21/2019 Dr. Boddeti will be a Tutorial Chair at IJCB 2020 12/05/2018 Congratulations to Rahul Dey, whose paper RankGAN: A Maximum Margin Ranking GAN for Generating Faces received the Best Student Paper Award at ACCV 2018. 02/01/2018 Dr. Boddeti will be an Area Chair at BTAS 2018",
  "content_length": 3595,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:33"
}