{
  "name": "Vishal Patel 0001",
  "homepage": "https://engineering.jhu.edu/faculty/vishal-patel",
  "status": "success",
  "content": "Vishal Patel - Johns Hopkins Whiting School of Engineering Contact (704) 502-3775 vpatel36@jhu.edu Location 211 Barton Hall Connect Google Scholar Website Research Areas Computer vision machine learning image processing biometrics medical image analysis. Vishal M. Patel is an associate professor of electrical and computer engineering and a member of the Vision and Image Understanding Lab. His research interests are focused on biomedical image analysis, biometrics, computer vision, machine learning, and signal and image processing. Patel is an associate editor of the IEEE Transactions on Pattern Analysis and Machine Intelligence journal and serves on the Machine Learning for Signal Processing (MLSP) Committee of the IEEE Signal Processing Society. He serves as the vice president of conferences for the IEEE Biometrics Council. He has received a number of awards including the 2021 IEEE Signal Processing Society (SPS) Pierre-Simon Laplace Early Career Technical Achievement Award, the 2021 NSF CAREER Award, the 2021 IAPR Young Biometrics Investigator Award (YBIA), the IEEE ICIP in 2021, the Best Paper Award at IEEE AVSS in 2019 and 2017, the IAPR ICB in 2018, two Best Student Paper Awards at IAPR ICPR in 2018, the 2016 ONR Young Investigator Award, the 2016 Jimmy Lin Award for Invention, the A. Walter Tyson Assistant Professorship Award, and the Best Paper Award at IEEE BTAS in 2015. He was also named a Fellow of the International Association for Pattern Recognition in 2024. Prior to joining Hopkins, he was an A. Walter Tyson Assistant Professor in the Department of ECE at Rutgers University and a member of the research faculty at the University of Maryland Institute for Advanced Computer Studies (UMIACS). He completed his PhD in electrical engineering at the University of Maryland, College Park in 2010. Related News View All News Making AI Video Generators Smarter About Physics Categories Research AI/Data Science New system keeps videos from defying gravity and breaking the laws of reality Face to Face with AI: Evaluating Machines’ Ability to Recognize and Analyze Faces Categories AI/Data Science New tool tests AI models on everything from identifying faces to detecting biases in facial data Gates Foundation Awards $1.7 Million for Researchers' Anemia Diagnostic Tool Categories Translation \"Back-illumination Capillary Analysis\" technology an ideal solution for diverse and low-resource populations Site Menu Search Submit Close ﻿",
  "content_length": 2467,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:32"
}