{
  "name": "Vishnu Chalavadi",
  "homepage": "https://vish9u.github.io",
  "status": "success",
  "content": "Chalavadi Vishnu Biodata Chalavadi Vishnu Email (Official) : chalavadivishnu@iittp.ac.in Email (Personal) : chalavadivishnu@gmail.com Assistant Professor Deep Learning, CSE Dept. IIT Tirupati - LinkedIn Others - Google Scholar | Semantic Scholar | ResearchGate | ORCID Teaching Courses (CS5XXL) Adversarial Deep Learning. Jul-Dec [2025] (CS518L) Deep Learning. Jan-Jun [2025, 2024] (CS204L) Data Structures and Algorithms with Lab. Jul-Dec [2024] (ES104M) Introduction to Programming with Lab. Jul-Dec [2024] (CS101P) Object Oriented Programming Lab. Jan-Jun [2024] Patents Method and System for Detection of Crime Events in Surveillance Videos Debaditya Roy, C. Vishnu, Dinesh Singh, and C. Krishna Mohan Patent No. : 516052. Issued - Feb 27, 2024 - Link A Method and System for Real-time Detection of Traffic Violation by Two-wheeled Riders C. Vishnu, Dinesh Singh, Debaditya Roy, and C. Krishna Mohan Patent No. : 414669. Issued - Dec 15, 2022 - Link Method and System for Detection of Accident in Traffic Surveillance Videos Dinesh Singh, C. Vishnu, Debaditya Roy, and C. Krishna Mohan Patent No. : 410755. Issued - Nov 2, 2022 - Link Publications Journals K. Naveen Kumar, Debaditya Roy, T. Ashutosh Suman, Chalavadi Vishnu, and C. Krishna Mohan. \"TSANet: Forecasting traffic congestion patterns from aerial videos using graphs and transformers,\" In Elsevier Pattern Recognition Journal, vol. 155, pp. 1-10, Nov. 1, 2024, doi: 10.1016/j.patcog.2024.110721 - Link Y. Sravani, Chalavadi Vishnu, and C. Krishna Mohan. \"Adaptive temporal aggregation for table tennis shot recognition,\" In Elsevier Neurocomputing Journal, vol. 584, pp. 1-10, June 1, 2024, doi: https://doi.org/10.1016/j.neucom.2024.127567 - Link Peketi Divya, Y. Sravani, Chalavadi Vishnu, C. Krishna Mohan, and Yen Wei Chen. \"Memory Guided Transformer with Spatio-Semantic Visual Extractor for Medical Report Generation,\" In IEEE Journal of Biomedical and Health Informatics, vol. 18, no. 1, pp. 1-10, February 29, 2024, doi: 10.1109/JBHI.2024.3371894 - Link Madhavi Kondapally, K. Naveen Kumar, Chalavadi Vishnu, and C. Krishna Mohan. \"Towards a Transitional Weather Scene Recognition Approach for Autonomous Vehicles,\" In IEEE Transactions on Intelligent Transportation Systems, pp. 1-10, November 20, 2023, doi: 10.1109/TITS.2023.3331882 - Link G. Swetha, Rajeshreddy Datla, Chalavadi Vishnu, and C. Krishna Mohan. \"M^2-APNet: A multimodal deep learning network to predict major air pollutants from temporal satellite images,\" In Journal of Applied Remote Sensing, vol. 18, no. 1, pp. 1-10, November 1, 2023, doi: 10.1117/1.JRS.18.012005 - Link Chalavadi Vishnu, Jayesh Khandelwal, Lingareddy Cenkeramaddi, and C. Krishna Mohan. \"EVAA - Exchange Vanishing Adversarial Attack on LiDAR Point Clouds in Autonomous Vehicles,\" In IEEE Transactions on Geoscience and Remote Sensing, vol. 61, no. 5, pp. 2708-2715, July 05, 2023, doi: 10.1109/TGRS.2023.3292372 - Link Chalavadi Vishnu, Vineel Abhinav, Debaditya Roy, Sobhan Babu, and C. Krishna Mohan. \"Improving Multi-Agent Trajectory Prediction Using Traffic States on Interactive Driving Scenarios,\" In IEEE Robotics and Automation Letters, vol. 8, no. 5, pp. 2708-2715, March. 17, 2023, doi: 10.1109/LRA.2023.3258685 - Link Chalavadi Vishnu, Prudviraj Jeripothula, Rajeshreddy Datla, Sobhan Babu, and C. Krishna Mohan. \"mSODANet: A Network for Multi-Scale Object Detection in Aerial Images using Hierarchical Dilated Convolutions,\" In Elsevier Pattern Recognition Journal, vol. 126, pp. 1-10, Jan. 23, 2022, doi: 10.1016/j.patcog.2022.108548 - Link Chalavadi Vishnu, Rajeshreddy Datla, Debaditya Roy, Sobhan Babu, and C. Krishna Mohan. \"Human Fall Detection in Surveillance Videos using Fall Motion Vector Modeling,\" In IEEE Sensors Journal, vol. 21, no. 15, pp. 17162-17170, Aug. 1, 2021, doi: 10.1109/JSEN.2021.3082180 - Link Conferences D. Rambabu, Swetha G, Rajeshreddy Datla, Chalavadi Vishnu, and C. Krishna Mohan. \"RSZero-CSAT: Zero-Shot Scene Classification in Remote Sensing Imagery using a Cross Semantic Attribute-guided Transformer,\" In Proceedings of 2024 International Joint Conference on Neural Networks (IJCNN), Yokohama, Japan, pp. 1-8, June 2024 - Link A. Soumya, Chalavadi Vishnu, and Lingareddy Cenkeramaddi. \"Multi-class object classification using deep learning models in automotive object detection scenarios,\" In Proceedings of 16th International Conference on Machine Vision (ICMV), Yerevan, Armenia, vol. 13072, pp. 1-8, Nov. 2023 - Link Dinesh Singh, C. Vishnu, and C. Krishna Mohan. \"Real-Time Detection of Motorcyclist without Helmet using Cascade of CNNs on Edge-device,\" In Proceedings of 2020 IEEE 23rd International Conference on Intelligent Transportation Systems (ITSC), Rhodes, Greece, pp. 1-8, 2020 - Link C. Vishnu, Dinesh Singh, C. Krishna Mohan, and Ch. Sobhan Babu. \"Detection of Motorcyclists without Helmet in Videos using Convolutional Neural Network,\" In Proceedings of 2017 International Joint Conference on Neural Networks (IJCNN), Anchorage, Alaska, USA, pp. 3036-3041, 2017 - Link Dinesh Singh, C. Vishnu, and C. Krishna Mohan. \"Visual Big Data Analytics for Traffic Monitoring in Smart City,\" In Proceedings of 15th IEEE International Conference on Machine Learning and Applications (ICMLA), Anahiem, California, USA, pp.886-891, 2016 - Link Projects Currently Working Smart/Robust Edge Computing in Autonomous Vehicles and Drones Adversarial Attacks & Defense on Autonomous Vehicles Small & Tiny Object Detection in Aerial Imagery & Autonomous Vehicles Continual Learning for Object Tracking Federated Learning for Object Detection/Segmentation Understanding the Flow of Crowd/Vehicle Traffic Vehicle/Person Re-Identification in Traffic/Processions for Indian Scenarios Graph Representation for Yoga Poses Graph Representation for Action Recognition in Surveillance Videos Completed Graph Representation for Object Detection & Tracking from Drones (Data from Ahmedabad Traffic) Deep Learning for Biologically-inspired Visual Control Algorithms (Ph.D Programme with Swinburne University, Australia) Fall Detection using Video Cameras without taking help of Physical Sensors Real time Cloud Classification & Segmentation (Project with WeatherNews, Japan) Real Time Action Generation (Project @ RIKEN & UTokyo, Japan) Highly Optimised Object Detection with & without Blur on Smart Phones (Project with OPPO) Helmet-less Rider Detection on Motorcycles in Dense Traffic (Project with Hyderabad Traffic Police) Advertisment Understanding & Suggestion of Content based on Context Understanding (Project with Hook's third party company) Intrusion Detection (Master's Introduction Project) Class Attendance application using Bluetooth (Bachelor's Final Project) Awards 2nd Prize with CKM Vigil Pvt. Ltd. in National Level Project Competition of Innovation in Manufacturing Processes (IMP 2021) organized by the National Frontiers of Engineering Symposium (NATFOE-2021). - July, 2021 Finalist in NVIDIA AI Hackathon organized by the Centre for Development of Advanced Computing (C-DAC). - December, 2019. Best Essay in National Essay Writing Competition. - June, 2016 Education Teaching Assistance (CS6880) Multimedia Content Analysis. Jul-Dec [2021] (CS6170) CV for Autonomous Vehicle Technology. Jul-Dec [2020] (CS6870) Surveillance Video Analytics. Jan-Jul [2020] (CS6210) Advanced Machine Learning. Jul-Dec [2019] (CS6140) Video Content Analysis. Jan-Jul [2019] Post-Doctoral Research (PostDoc) Thesis Title : Adversarial Federated Analysis in Aerial and Autonomous Systems Institution : University of Agder (UiA), Grimstad, Norway Duration : Sep, 2022 - Sep, 2023 Doctor of Philosophy (PhD) Thesis Title : Towards Robust Indoor and Outdoor Smart Environments Institution : IIT Hyderabad & Swinburne University of Technology Australia (SUT) Duration : Jan, 2018 - Sep, 2022 GPA : 8.9 Master of Technology (MTech) Thesis Title : Surveillance Video Analytics Institution : IIT Hyderabad Duration : July, 2016 - Jan, 2018 GPA : 8.6 Bachelor of Technology (BTech) Institution : JNTU Hyderabad Affiliated (JNTUH) Duration : June, 2012 - July, 2016 GPA : 7.7 Skills Libraries PyTorch Tensorflow/Keras FoolBox/Avalanche OpenCV/dlib scikit-learn/mlpack Caffe Programming Languages C/C++ Python Shell Scripting/Powershell MATLAB/R Hobbies Artificial Intelligence, Football, Penetration Testing, and Contributing to FOSS",
  "content_length": 8374,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:32"
}