{
  "name": "Vishwanathan Mohan",
  "homepage": "https://www.essex.ac.uk/people/mohan05903/vishwanathan-mohan",
  "status": "success",
  "content": "Vishwanathan Mohan | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Vishwanathan Mohan People Dr Vishwanathan Mohan Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email vishwanathan.mohan@essex.ac.uk Location 1NW.3.21, Colchester Campus Academic support hours 10-13 Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography https://vishwanathanmohan.com/ Qualifications PhD Appointments University of Essex Lecturer, CSEE, University of Essex (4/10/2016 - present) Senior Lecturer, School of Computer Sciecne and Electronic Engineering, University of Essex (1/10/2021 - present) Research and professional activities Research interests Cognitive Robotics Open to supervise Computational Neuroscience Open to supervise Industrial Manufacturing Open to supervise Current research Funtional Reuse at the level of Perception, Action, Memory and Social cognition in brains and cognitive machines Interplay between learning, memory and prospection in cumulativley developing systems (humans, robots) Unified computational basis for action generation, imagination and understanding Cognitive technologies and solutions especially in assistive robotics, industrial manufacTURING. Conferences and presentations 2015 Cognitive architectures for Humanoid robots (2015), NSF workshop on Neuromotor Rehabilitation, Arenzano, Italy. Arenzano, Italy, 2015 2014 Humanoid robots as a mirror into human cognition, (2014), Keynote at IEEE Computational Intelligence workshop, IIIT Allahabad, India. Hyderabad, India, 2014 2014 Cumulatively learning and using knowledge of Causal relations, Simple experiments with iCub humanoid, Biologically Inspired Cognitive architectures 2014, MIT Boston, USA. Cambridge, United States, 2014 2013 On the interplay between learning, memory, prospection and abstraction in cumulatively learning baby humanoids, Invited talk at IJCNN in the memory of Professor John G Taylor (Kings College London), Dallas, Texas, USA. Dallas, United States, 2013 2012 Towards Acting , Learning, Reasoning humanoids: Darwin@1.5 (2012), Invited lecture at US Army NATICK soldier research centre, coinciding with the Kick Off meeting of the US DoD grant, Boston, MA, USA. 2012 2012 Combining past experience, imitation and exploration to swiftly learn to use new tools, Speaker at Living Machines 2012, International Conference on Biomimetic and Biohybrid Systems, La Pedera, Barcelona. Barcelona, Spain, 2012 What does learning to draw a circle have to do with driving, cycling, unwinding and screwing? Vishwanathan Mohan IEEE Intl conference on development and learning (IEEE ICDL-EPIROB 2011) Frankfurt, Germany (2011.8) Frankfurt, Germany, 2011 Teaching Humanoids to Imitate Shapes of Movements. Vishwanathan Mohan Morasso Proceedings of 20th International conference on Artificial neural networks ICANN, Thessaloniki, Greece (2010.9). Thessaloniki, Greece, 2010 Teaching baby humanoid iCub to write iCub and beyond. Vishwanathan Mohan Fourth International Conference on Cognitive Science, pp. 1-3, Tomsk , Russia. (2010.6) Tomsk, Russian Federation, 2010 Composing and Coordinating body models of arbitrary connectivity and redundancy: A Biomimetic, field computing approach. Vishwanathan Mohan IROS'2009 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) at St. Louis, MO, USA. (2009.10) St. Louis, United States, 2009 Reaching Extended: Using computational force fields for Real and Mental Action Generation in Cognitive Robots. Vishwanathan Mohan (60%) Third Intl Conf on Cognitive Science. Moscow, Russia. (2008.6) Moscow, Russian Federation, 2008 Neural Network of a Cognitive Crow: An interacting map based architecture. Vishwanathan Mohan (70%), Morasso P (2007) First IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO), Boston, Mass., USA. (2007.8) Boston, United States, 2007 A Forward / Inverse Motor Controller for Cognitive Robotics. Vishwanathan Mohan (60%), Morasso P Int Conf on Artificial Neural Networks (ICANN 06). Athens, Greece (2006.9). Athens, Greece, 2006 Studies on an Electronic analog of a Recurrent Neural Network with retrieval Phase weight adaptations, Vishwanathan Mohan Proceedings of Joint IInd Intl. Conf. On soft computing and Intelligent Informatics, Yokohama, Japan. (2004.09) Yokohama, Japan, 2004 Inevitable Energy Costs of Storage Capacity Enhancement in an Oscillatory Neural Network. Vishwanathan Mohan 46th IEEE International Midwest Symposium on Circuits and Systems, Cairo Egypt. (2003.12) Egypt, 2003 Link between Energy and Computation in a Physical Model of Hopfield Network, Vishwanathan Mohan 9th International Conference on Neural Information processing, Singapore (2002.11) Singapore, 2002 Teaching and supervision Current teaching responsibilities Team Project Challenge (CE201) Individual Capstone Project Challenge (CE301) Current supervision Patricia Preda Degree subject: Computer Science Degree type: Doctor of Philosophy Farhan Mahmood Degree subject: Computer Science Degree type: Doctor of Philosophy Eduardo Daniel Cedillo Hernandez Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Roberto Mendivil Castro Thesis title: Scarlett: Towards Scalable, Structured and Resource Efficient Harvesting of Lettuce with Collaborative Biomimetic Robots Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 19/3/2025 Antonios Porichis Thesis title: Reaping the Rewards of Autonomous Robotic Harvesting: Imitation Learning of Picking Motions Directly From Video Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 24/2/2025 Konstantinos Vasios Thesis title: Bridging the Simulation to Reality Gap in Robotics Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 21/2/2025 Penelope Amelia Roberts Thesis title: Context Aware Proactive Robotic Companions for Home Care and Communities Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 27/6/2024 Fuli Wang Thesis title: Abc: Adaptive, Biomimetic, Configurable Robots for Smart Farms - From Cereal Phenotyping to Soft Fruit Harvesting Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 13/7/2023 Francesca Bianco Thesis title: Theory of Mind Across Biological and Artificial Embodiment: Theory, Experiments and Computational Models Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 6/7/2022 Publications Journal articles (17) Mohan, V. and Morasso, P., Passive Motion Paradigm: An Alternative to Optimal Control. Frontiers in Neurorobotics. 5 Wang, F., Mohan, V. and Tiwari, A., (2025). Passive motion paradigm implementation via deep neural networks: analysis and verification. Robotica. 43 (5), 1766-1784 Porichis, A., Inglezou, M., Kegkeroglou, N., Mohan, V. and Chatzakos, P., (2024). Imitation learning from a single demonstration leveraging vector quantization for robotic harvesting. Robotics. 13 (7), 98-98 Wang, F., Cuan Urquizo, R., Roberts, P., Mohan, V., Newenham, C., Ivanov, A. and Dowling, R., (2023). Biologically inspired robotic perception-action for soft fruit harvesting in vertical growing environments. Precision Agriculture. 24 (3), 1072-1096 Wang, F., Li, F., Mohan, V., Dudley, R., Gu, D. and Bryant, R., (2022). An unsupervised automatic measurement of wheat spike dimensions in dense 3D point clouds for field application. Biosystems Engineering. 223, 103-114 Morasso, P. and Mohan, V., (2021). The body schema: neural simulation for covert and overt actions of embodied cognitive agents. Current Opinion in Physiology. 19, 219-225 Mohan, V., Bhat, A. and Morasso, P., (2019). Muscleless Motor synergies and actions without movements: From Motor neuroscience to cognitive robotics. Physics of Life Reviews. 30, 89-111 Mohan, V., Morasso, P. and Bhat, A., (2019). The complementarity of ‘Muscleless’ motor synergies with motor control strategies in humans and robots. Physics of Life Reviews. 30, 130-133 Mohan, V. and Bhat, AA., (2018). Joint Goal Human Robot collaboration-From Remembering to Inferring. Procedia Computer Science. 123, 579-584 Sandini, G., Mohan, V., Sciutti, A. and Morasso, P., (2018). Social Cognition for Human-Robot Symbiosis—Challenges and Building Blocks. Frontiers in Neurorobotics. 12 Bhat, AA. and Mohan, V., (2018). Goal-Directed Reasoning and Cooperation in Robots in Shared Workspaces: an Internal Simulation Based Neural Framework. Cognitive Computation. 10 (4), 558-576 Bhat, AA., Akkaladevi, SC., Mohan, V., Eitzinger, C. and Morasso, P., (2017). Towards a learnt neural body schema for dexterous coordination of action in humanoid and industrial robots. Autonomous Robots. 41 (4), 945-966 Bhat, AA., Mohan, V., Sandini, G. and Morasso, P., (2016). Humanoid infers Archimedes' principle: understa",
  "content_length": 15259,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:34"
}