{
  "name": "Vita Lanfranchi",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/vitaveska-lanfranchi",
  "status": "success",
  "content": "Professor Vitaveska Lanfranchi | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Vitaveska Lanfranchi PhD School of Computer Science Professor of Digital Health and Pervasive Computing Director of School - One University Member of the Pervasive Computing research group Open staff member portrait in a modal window v.lanfranchi@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Vitaveska Lanfranchi School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Vitaveska Lanfranchi personal website Profile Prof Vitaveska Lanfranchi is Professor of Digital Health and Pervasive Computing and a member of the Pervasive Computing research group.Her research field is highly interdisciplinary, focusing on the intersection between ubiquitous computing, data analysis and user-centred decision making in healthcare. She specialised in participatory design methods to develop novel methodologies and interfaces for ubiquitous and mobile computing, by employing sensing and tracking technologies to record users activities and analyse the data to reveal patterns and create intelligent systems that could influence users’ decision making and behaviour.Vita has a long academic history and industry experience: from 2014 till 2017, whilst on secondment from her research position, she has held the post of CEO in K-Now, a University of Sheffield spin-out company focused on research and commercialization of knowledge management technologies. Currently she is PI for Sheffield for several research projects, UK or EU funded.She has a first degree in Communication Science from the University of Turin, Italy and a PhD in Computer Science from the University of Turin, Italy. Research interests Activity/mobility recording via wearable technologies and contextual factors detectionHuman behavioural monitoring and understandingAI technologies for modelling and predicting disease progressionContext awarenessDigital twins and generation of realistic synthetic data from real datasetsInteraction with pervasive technologies and related research into acceptability, trust and ethicsInclusivity and accessibility Publications Journal articles Webb TL, Baird HM, Maikore FS, West R, Hastings J, Mazumdar S, Lanfranchi V & Michie S (2025) A method for evaluating the interoperability of ontology classes in the behavioural and social sciences [version 1; peer review: awaiting peer review]. Wellcome Open Research, 10. View this article in WRRO Roychowdhury S, Lanfranchi V & Mazumdar S (2025) Evaluating explanation performance for clinical decision support systems for non-imaging data: a systematic literature review. Computers in Biology and Medicine, 197, Part A. View this article in WRRO Wang X, Zhang Y, Liu T, Yuan Z, Liu K, Lanfranchi V & Yang P (2025) SPOT: An efficient training-free task similarity quantification method for continual learning. Pattern Recognition Letters. View this article in WRRO Brennaf M, Yang P & Lanfranchi V (2025) Secured cost-effective anonymous federated learning with proxied privacy enhancement for personal devices. IEEE Internet of Things Journal. View this article in WRRO Rodriguez AM, Kellehear A, Lanfranchi V, McSherry W, Tatterton M, Watts MBE L, Yaziji N & Smith J (2025) The qualitative DIGNISPACE study: the co-design of a life review, meaning-making and legacy leaving digital intervention for young people with life-limiting conditions. Illness, Crisis & Loss, 33(1), 172-197. View this article in WRRO Ardle RM, Wales JL, Hamilton CA, Ryan LJ, McCarthy L, Din SD, Bayat S, Tangen GG, Ireson N, Lanfranchi V , Farina N et al (2024) Feasibility and acceptability of a continuous remote activity monitoring protocol in older adult dyads: A mixed methods pilot study. Alzheimer's & dementia : the journal of the Alzheimer's Association, 20(Suppl 7). Ardle RM, Wales JL, Hamilton CA, Ryan LJ, McCarthy L, Din SD, Bayat S, Tangen GG, Ireson N, Lanfranchi V , Farina N et al (2024) Feasibility and acceptability of a continuous remote activity monitoring protocol in older adult dyads: A mixed methods pilot study. Alzheimer's & dementia : the journal of the Alzheimer's Association, 20(Suppl 10). Roychowdhury S, Mazumdar S, Thakker D, Checco A, Lanfranchi V & Goodchild B (2024) Integrating virtual walkthroughs for subjective urban evaluations: a case study of neighbourhoods in Sheffield, England. Land, 13(6). View this article in WRRO Kirk C, Küderle A, Micó-Amigo ME, Bonci T, Paraschiv-Ionescu A, Ullrich M, Soltani A, Gazit E, Salis F, Alcock L , Aminian K et al (2024) Mobilise-D insights to estimate real-world walking speed in multiple conditions with a wearable device. Scientific Reports, 14(1). View this article in WRRO Ardle RM, Ryan LJ, McCarthy L, Wilson C, Hamilton CA, Tangen GG, Farina N, Ireson N, Lanfranchi V, Hicks B & Bayat S (2023) Investigating the social and environmental contexts of habitual walking ACTIVities in older adult DYADs: A mixed methods protocol for the ActivDyad study. Alzheimer's & Dementia, 19(S11). Ardle RM, Ryan LJ, McCarthy L, Wilson C, Hamilton CA, Tangen GG, Farina N, Ireson N, Lanfranchi V, Hicks B & Bayat S (2023) Investigating the social and environmental contexts of habitual walking ACTIVities in older adult DYADs: A mixed methods protocol for the ActivDyad study. Alzheimer's & Dementia, 19(S23). Zhang Y, Liu T, Lanfranchi V & Yang P (2022) Explainable tensor multi-task ensemble learning based on brain structure variation for Alzheimer's disease dynamic prediction. IEEE Journal of Translational Engineering in Health and Medicine, 11, 1-12. View this article in WRRO Sproson L, Mills N, Pryde L, Adebajo A, Coyle D, Preston J, Blackburn D, Christensen H & Lanfranchi V (2022) Keeping patient and public partnership at the heart of medical technology development during Covid-19 : examples of adaptive practice. Journal of Medical Engineering & Technology, 46(6). View this article in WRRO Lanfranchi V, Jones N, Read J, Fegan C, Field R, Simpson E, Revitt C, Cudd P & Ciravegna F (2022) User attitudes towards virtual home assessment technologies. Journal of Medical Engineering & Technology, 46(6), 536-546. View this article in WRRO Yang P, Yang C, Lanfranchi V & Ciravegna F (2022) Activity graph based convolutional neural network for physical activity recognition using acceleration and gyroscope data. IEEE Transactions on Industrial Informatics, 18(10), 6619-6630. View this article in WRRO Jones N, Read J, Field R, Fegan C, Simpson E, Revitt C, Lanfranchi V & Ciravegna F (2022) Remote home visits: Exploring the concept and applications of remote home visits within health and social care settings. British Journal of Occupational Therapy, 85(1), 50-61. View this article in WRRO Mazzà C, Alcock L, Aminian K, Becker C, Bertuletti S, Bonci T, Brown P, Brozgol M, Buckley E, Carsin A-E , Caruso M et al (2021) Technical validation of real-world monitoring of gait : a multicentric observational study. BMJ Open, 11(12). View this article in WRRO Field B, Read J, Jones N, Fegan C & Lanfranchi V (2021) Occupational therapists need to be involved in developing and evaluating technological solutions to support remote working. British Journal of Occupational Therapy, 84(2), 69-71. View this article in WRRO Sproson L, Lanfranchi V, Collins A, Chhetri SK, Daly N, Ennis M, Glennon L, Gorrie G, Jay E, Marsden R , McCarthy AD et al (2020) Fit for purpose? A cross-sectional study to evaluate the acceptability and usability of HeadUp, a novel neck support collar for neurological neck weakness. Amyotrophic Lateral Sclerosis and Frontotemporal Degeneration, 22(1-2), 38-45. Masood A, Yang P, Sheng B, Li H, Li P, Qin J, Lanfranchi V, Kim J & Feng DD (2019) Cloud-based automated clinical decision support system for detection and diagnosis of lung cancer in chest CT. IEEE Journal of Translational Engineering in Health and Medicine, 8. View this article in WRRO Mazumdar S, lanfranchi V, Ireson N, Wrigley S, Bagnasco C, wehn U, McDonagh R, Ferri M, McCarthy S, Huwald H & Ciravegna F (2016) Citizens observatories for effective Earth observations: the WeSenseIt Approach. Environmental Scientist, 25(2), 56-61. View this article in WRRO Wehn U, McCarthy S, Lanfranchi V & Tapsell S (2015) CITIZEN OBSERVATORIES AS FACILITATORS OF CHANGE IN WATER GOVERNANCE? EXPERIENCES FROM THREE EUROPEAN CASES. Environmental Engineering and Management Journal, 14(9), 2073-2086. Wehn U, Rusca M, Evers J & Lanfranchi V (2015) Participation in flood risk management and the potential of citizen observatories: A governance analysis. Environmental Science & Policy, 48, 225-236. Mazumdar S, Petrelli D, Elbedweihy K, Lanfranchi V & Ciravegna F (2015) Affective graphs: The visual appeal of Linked Data. Semantic Web, 6(3), 277-312. Lanfranchi V & Kauppinen T (2014) Preface. Ceur Workshop Proceedings, 1329, 29-30. Petrelli D, Lanfranchi V, Ciravegna F, Begdev R & Chapman S (2011) Highly focused document retrieval in aerospace engineering: User interaction design and evaluation. Aslib Proceedings New Information Perspectives, 63(2-3), 148-167. Mazumdar S, Varga A, Lanfranchi V & Ciravegna F (2011) A knowledge dashboard for manufacturing industries. Ceur Workshop Proceedings, 748, 51-63. Petrelli D, Dadzie AS & Lanfranchi V (2009) Mediating between AI and Highly Specialized Users. AI MAG, 30(4), 95-102. Dadzie AS, Lanfranchi V & Petrelli D (2009) Seeing is believing: Linking data with knowledge. INFORM VISUAL, 8(3), 197-211. Dadzie AS, Bhagdev R, Chakravarthy A, Chapman S, Iria J, Lanfranchi V, Magalhaes J, Petrelli D & Ciravegna F (2009) Applying semantic web technologies to knowledge sharing in aerospace engineering. J INTELL MANUF, 20(5), 611-623. Baravalle A & Lanfranchi V (2003) Remote Web usability testing.. Behav Res Methods Instrum Comput, 35(3), 364-368. Fadlian MF, Ireson N & Lanfranchi V () Generating Realistic Passe",
  "content_length": 25929,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:36"
}