{
  "name": "Vitaliy A. Kurlin",
  "homepage": "https://www.liverpool.ac.uk/computer-science/staff/vitaliy-kurlin",
  "status": "success",
  "content": "Professor Vitaliy Kurlin | Our people | University of Liverpool Skip to main content Close Search Find courses, people, research, information and more. Please ignore What types of page to search? All Courses Academic staff News Events Search Popular pages: Undergraduate Postgraduate PhD Accommodation Research International students Alternatively use our A-Z index. About Professor Vitaliy Kurlin is a universal scientist: mathematician by training with PhD in Geometry and Topology earned at Moscow State University in 2003. Since 2017 he leads of the Data Science Theory and Applications group in the Materials Innovation Factory at the University of Liverpool, UK. Since 2020 our Data Science Theory and Applications group (http://kurlin.org/index.php#group) is developing a new area of Geometric Data Science to crystallography, materials science, and structural biology. The recent PI's funding includes the following prestigious grants. 2022 - 2024 UKRI New Horizons grant \"Inverse design of periodic crystals\", https://gow.epsrc.ukri.org/NGBOViewGrant.aspx?GrantRef=EP/X018474/1 2021 - 2023 Royal Academy of Engineering Industry Fellowship \"Data Science for Next Generation Engineering of Solid Crystalline Materials\", https://raeng.org.uk/programmes-and-prizes/programmes/uk-grants-and-prizes/support-for-research/industrial-fellowships/awardees/awardees-2021. Prizes or Honours Lead co-I at Liverpool in the 5-year grant \"Application-driven Topological Data Analysis\" (with Oxford and Swansea), Liverpool budget over £715K (EPSRC, 2018) International Exchanges programme with IST Austria for bilaterial visits (£12K) (Royal Society, 2017) Main organiser of the network Applied Algebraic Topology (London Mathematical Society, 2017) Leader of the Intel Parallel Computing Centre (Intel Corporation, 2017) EPSRC grant \"Persistent Topological Structures in Noisy Images\" (EP/I030328/1) (EPSRC, 2011) Funded Fellowships Royal Society APEX ellowship (Royal Society, 2023 - 2025) EPSRC New Horizons grant \"Inverse design of periodic crystals\" (Engineering and Physical Sciences Research Council (EPSRC), 2022 - present) Marie Curie Research Fellowship 007477 (European Union, 2005)",
  "content_length": 2185,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:39"
}