{
  "name": "Vito De Feo",
  "homepage": "https://www.essex.ac.uk/people/defeo60201/vito-de-feo",
  "status": "success",
  "content": "Vito De Feo | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Vito De Feo People Dr Vito De Feo Lecturer School of Computer Science and Electronic Engineering (CSEE) Email vito.defeo@essex.ac.uk Telephone +44 (0) 1206 874946 Location 5A.521, Colchester Campus Academic support hours My Academic Support Hours will be 15-17 on Friday in my office 5A.521 or via zoom. The zoom link for this is available from my profile on my CE701 course Moodle page. Please wait in the waiting room until I can admit you. Profile Teaching and supervision Publications Grants and funding Contact Profile Teaching and supervision Publications Grants and funding Contact Profile Biography Vito De Feo is a lecturer of Intelligent Systems for Brain and Mental Health in CSEE. His research interests include embedded neuromorphic control systems for bidirectional closed-loop Brain-Machine Interfaces (BMIs), application of machine learning, and statistics to neural signal encoding/decoding, state-dependent neural encoders and decoders, technology-mediated rehabilitation and assistive technologies, neuromarketing, and novel measures of information transfer in the brain. He holds a MSc in Electronic Engineering from Politecnico di Torino (Italy). He obtained a PhD in Telecommunication from Politecnico di Torino (Italy). During his PhD, he spent 14 months at the University of Stanford (US). He also studied Neuropsychology at the University of Turin (Italy). In 2009 he was a senior researcher at Trinity College Dublin (Ireland) on optical communication. From 2013, he worked at the Clinical University of Hamburg-Eppendorf specializing in signal processing and causal analysis of biological signals. From 2015 he worked at the Italian Institute of Technology specializing in neural population coding, neuroelectronic, and information theory. He has successfully coordinated and led the Covid-19 efforts of the faculty, having established research links in the East Suffolk and North Essex NHS Foundation Trust (ESNEFT). Recently he co-funded the Essex Neuromarketing Research Cluster. Qualifications PhD in Electronics and Communications Polytechnic University of Turin, MsC in Electronic Engineering Polytechnic University of Turin, Appointments University of Essex Lecturer, Computer Science and Electrical Engineering, University of Essex (4/11/2019 - present) Other academic External Examiner, Royal Holloway University of London (1/6/2021 - present) Professor, Lingue e Letterature Straniere, University of Turin (26/6/2022 - present) Teaching and supervision Current teaching responsibilities Advanced Embedded Systems Design (CE323) Theory of Signals and Communication Systems (CE701) Machine Learning (CE802) Advanced Embedded Systems Design (CE860) Current supervision Ismael Hayden Thesis title: Creating an App Outline and Co-Design Guidelines for Artificially Intelligent Driven Software to Support Cbtp Practitioners Working with Clients Experiencing First Episode Psychosis. Degree subject: Clinical Psychology (D Clin Psych) Degree type: Professional Doctorate Cristina Del Prete Degree subject: Computer Science Degree type: Doctor of Philosophy Domiziana Falaschi Degree subject: Psychology Degree type: Doctor of Philosophy Ashish Bhatia Thesis title: Explainability and Efficiency in Fuzzy Logic: Frameworks for Temporal Classification, Monotonicity, and Hybrid Predictive Modelling Degree subject: Computer Science Degree type: Doctor of Philosophy Akashdeep Kaur Nijjar Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Zeel Mahendrakumar Pansara Thesis title: Automated Emotion Detection Using Multi-Modal Physiological Signals: A Path Towards Clinical Applications Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 13/10/2025 Ellis Pooley Thesis title: Exploring Clinicians' Experiences of Implementing Assistive Technology for Cognition in Neurorehabilitation: Insights and Challenges Degree subject: Clinical Psychology (D Clin Psych) Degree type: Professional Doctorate Awarded date: 6/6/2025 Penelope Amelia Roberts Thesis title: Context Aware Proactive Robotic Companions for Home Care and Communities Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 27/6/2024 Isabella Ciuta Thesis title: Chromatin Reorganisation and Differential Transcription Factor Binding in Breast Cancer Degree subject: Molecular Medicine Degree type: Master of Science (by Dissertation) Awarded date: 20/5/2024 Publications Publications (3) Pansara, Z., Navyte, G., Freitas-Mendes, T., Bottger, C., Franco, E., Citi, L., Jacobi, ES., Poerio, GL., Gillmeister, H., Cinel, C. and Feo, VD., (2025). Quantifying Emotional Arousal through Pupillary Response: A Novel Approach for Isolating the Luminosity Effect and Predicting Affective States Celotto, M., Bím, J., Tlaie, A., De Feo, V., Lemke, S., Chicharro, D., Nili, H., Bieler, M., Hanganu-Opatz, IL., Donner, TH., Brovelli, A. and Panzeri, S., (2023). An information-theoretic quantification of the content of communication between brain regions Bím, J., De Feo, V., Chicharro, D., Bieler, M., Hanganu-Opatz, IL., Brovelli, A. and Panzeri, S., (2019). A Non-negative Measure Of Feature-Related Information Transfer Between Neural Signals Journal articles (11) Bhattacharya, S., De Feo, V. and Bourazeri, A., (2024). GreenMate: A Serious Game Educating Children about Energy Efficiency. IEEE Transactions on Games. 17 (1), 196-209 Gay, D. and De Feo, V., (2019). Political communication and critical skills: A statistical analysis. Synergies Italie (15), 79-90 Piazza, M., De Feo, V., Panzeri, S. and Dehaene, S., (2018). Learning to focus on number.. Cognition. 181, 35-45 De Feo, V., Boi, F., Safaai, H., Onken, A., Panzeri, S. and Vato, A., (2017). State-Dependent Decoding Algorithms Improve the Performance of a Bidirectional BMI in Anesthetized Rats.. Frontiers in Neuroscience. 11 (MAY), 269- Boi, F., Moraitis, T., De Feo, V., Diotalevi, F., Bartolozzi, C., Indiveri, G. and Vato, A., (2016). A Bidirectional Brain-Machine Interface Featuring a Neuromorphic Hardware Decoder.. Frontiers in Neuroscience. 10, 563- Hartung, H., Cichon, N., De Feo, V., Riemann, S., Schildt, S., Lindemann, C., Mulert, C., Gogos, JA. and Hanganu-Opatz, IL., (2016). From Shortage to Surge: A Developmental Switch in Hippocampal-Prefrontal Coupling in a Gene-Environment Model of Neuropsychiatric Disorders.. Cerebral Cortex. 26 (11), 4265-4281 Panzeri, S., Safaai, H., De Feo, V. and Vato, A., (2016). Implications of the Dependence of Neuronal Activity on Neural Network States for the Design of Brain-Machine Interfaces.. Frontiers in Neuroscience. 10 (APR), 165- Hartung, H., Brockmann, MD., Pöschel, B., De Feo, V. and Hanganu-Opatz, IL., (2016). Thalamic and Entorhinal Network Activity Differently Modulates the Functional Development of Prefrontal-Hippocampal Interactions.. The Journal of Neuroscience. 36 (13), 3676-3690 Domnick, N-K., Gretenkord, S., De Feo, V., Sedlacik, J., Brockmann, MD. and Hanganu-Opatz, IL., (2015). Neonatal hypoxia-ischemia impairs juvenile recognition memory by disrupting the maturation of prefrontal-hippocampal networks.. Experimental Neurology. 273, 202-214 Antonino, A., Bianco, A., Bianciotto, A., De Feo, V., Finochietto, JM., Gaudino, R. and Neri, F., (2008). WONDER: A resilient WDM packet network for metro applications. Optical Switching and Networking. 5 (1), 19-28 Carena, A., De Feo, V., Finochietto, JM., Gaudino, R., Neri, F., Piglione, C. and Poggiolini, P., (2004). RingO: An experimental wdm optical packet network for metro applications. IEEE Journal on Selected Areas in Communications. 22 (8), 1561-1571 Show all Conferences (10) De Feo, V., Bianciotto, A., Carena, A., Finochietto, J., Gaudino, R., Neri, F., Piglione, C. and Poggiolini, P., Experimental WDM Packet Networks for Metro Applications: the RingO and Wonder Projects De Feo, V., Pansara, Z., Cinel, C., Gillmeister, H. and Navyte, G., (2024). Towards an Accurate Measure of Emotional Pupil Dilation Responses: A Model for Removing the Effect of Luminosity Celotto, M., Bim, J., Tlaie, A., De Feo, V., Toso, A., Chicharro, D., Lemke, SM., Nili, H., Bieler, M., Donner, TH., Hanganu-Opatz, IL., Brovelli, A. and Panzeri, S., (2023). An information-theoretic quantification of the content of communication between brain regions Antonino, A., De Feo, V., Finochietto, JM., Gaudino, R., La Porta, A., Petracca, M. and Neri, F., (2008). Toward feasible all-optical packet networks: Recent results on the WONDER experimental testbed Antonino, A., Birke, R., De Feo, V., Finocchietto, JM., Gaudino, R., La Porta, A., Neri, F. and Petracca, M., (2007). The WONDER testbed: Architecture and experimental demonstration Bianciotto, A., De Feo, V., Gaudino, R., la Porta, A., Neri, F. and Petracca, M., (2007). Experimentation of single-hop WDM rings for metro and distributed switching applications (2003). Next Generation Optical Network Design and Modelling Carena, A., Ferrero, V",
  "content_length": 12555,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:36"
}