{
  "name": "Vittorio Limongelli",
  "homepage": "http://search.usi.ch/persone/cff80567d5ca6aab629d458d8a2a3be5/Limongelli-Vittorio",
  "status": "success",
  "content": "Limongelli, Vittorio | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Vittorio Limongelli http://usi.to/kjy Biography Professor Limongelli took his PhD degree in Drug Sciences in 2007 and did his PostDoc at ETH Zurich (Switzerland), working in the field of enhanced sampling simulations applied to study drug/target binding interaction. In 2013 he was awarded the “Premio Scrocco” conferred by the Division of Theoretical and Computational Chemistry of the Italian Chemical Society for his original contribution to the study of biological phenomena by applying advanced computational methods. In 2016 he received the Young Researcher in Medicinal Chemistry award from the French Medicinal Chemistry Society and in 2017 the award as a most meritorious runner-up of the EFMC (the European Federation of Medicinal Chemistry) Prize for a Young Medicinal Chemist in Academia. In 2020 he was nominated top 5 scientist in physical/chemical sciences for the USERN prize. He is author of more than 70 publications, many of them on high impact scientific journals such as Nature Communications, Nature Protocols, Nature Methods, PNAS, JACS, Angewandte Chemie and Nucleic Acids Research. In 2020, he received an ERC (European Research Council) consolidator grant. More information can be found on his website. Competence areas Computational Biology Computational Chemistry Drug Design Molecular Simulations Pharmacology Contact vittorio.limongelli@usi.ch tel +41 58 666 4293 East Campus, Sector D, Office D5.07 (Level P5) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Biomedical Sciences Full Professor Euler Institute (EUL) Links Website or personal page Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2405,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:45"
}