{
  "name": "Vivek Kumar Singh 0007",
  "homepage": "https://wp.comminfo.rutgers.edu/vsingh",
  "status": "success",
  "content": "Vivek Singh, Rutgers University | Universitywide Main Vivek K. Singh, Ph.D. Associate Professor, School of Communication and Information, Rutgers University. Email: v.singh@rutgers.edu Phone: +1 848 932 7588 Office: 4 Huntington St., New Brunswick, NJ 08901 Homepage: http://sites.comminfo.rutgers.edu/vsingh I direct the Behavioral Informatics Lab at Rutgers University. Our lab works at the intersection of human behavior and information technology. We develop new algorithms, interfaces, and frameworks that aim to maximize the good of technology (e.g., predicting mental health issues) while minimizing the potential harms (e.g., privacy loss). Two major themes of research are: (1) AI for health and wellness: Developing theory-aware algorithms that use multimodal data (e.g., phone logs, social media) to model mental health, wellbeing, trust, etc. Projects: Rutgers Well-being Study (2015-2020); Rutgers Wellness Study (2021-ongoing). (2) Reducing harm in digital environments: Developing algorithms, interfaces, and frameworks that reduce harm in digital environments (e.g., cyberbullying, privacy loss, misinformation, algorithmic bias). News Oct 2025: Sample recent publications: JAMIA, JMIR-Medical Informatics, Health Informatics J., CSCW, AACL, AAAI. Kudos to the amazing team. Oct 2024: Grateful for the ASIS&T SIG-Social Media Senior Researcher Award, 2024. Jun 2024: iSchool Doctoral Doctoral Dissertation Award (Runner Up) won by Jinkyung Park for dissertation titled “Design Intervention to Reduce Online Incivility”. May 2024: Best Paper Award from the ACM Web Science Conference, 2024 for the paper “Accuracy and Fairness for Web-Based Content Analysis under Temporal Shifts and Delayed Labeling” Dec 2023: Best Paper Award from IEEE Intelligent Systems, 2022 for the paper “Intelligent Pandemic Surveillance via Privacy-Preserving Crowdsensing“. May 2023: New research paper and dataset on the importance of journalistic article coding in misinformation research presented at WebSci’23. Media reports (a), (b), (c). Aug 2022: Congratulations to the lab members on a productive academic year. 10 articles published/ accepted. Selected venues: JASIST (a,b), CSCW, ICWSM, FAccT, JMIR-FR. May 2020: Grateful to the NSF for two COVID-19 related research grants. Vivek Singh promoted to Associate Professor (with tenure) effective July 1. June 2019: Grateful for the NSF funding on reducing bias in information algorithms. Sep 2018: Recent publications presented/accepted: CSCW 2018 ; IEEE Trans. Big Data; Online Information Review; J. Comp. Soc. Sci. Mar 2018: Recent publications presented/accepted: CHI 2018; ACM UbiComp/IMWUT 2018; PLOSONE Sep 2017: Recent publications presented/accepted: CHI 2017 (a,b); ICWSM 2017; ACM MM 2017; IEEE Trans. Intell. Syst. & Tech.; CSCW 2018. Mar 2016: Grateful to Google Research for funding our research project on Sensor-based understanding of information seeking behavior. Details. May 2015: Intrigued to find the US Court of Appeals cite our recent Science paper in it’s judgement (page 9) on the NSA case. Mar 2015: Grateful to National Science Foundation for funding our research project on cyberbullying detection. Daily Targum report. Feb 2015: Our study on uniqueness of credit card spending data came out in Science magazine. Media coverage includes New York Times, Wall Street Journal, Nature News, Harvard Business Review , and The Telegraph. CV for Dr. Vivek Singh",
  "content_length": 3432,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:42"
}