{
  "name": "Vivek Kumar Singh 0001",
  "homepage": "https://www.viveksingh.in",
  "status": "success",
  "content": "Prof. Vivek Kumar Singh Courses Taught Artificial Intelligence Computer Organization & Architecture Data Structures Information Retrieval Introduction to Computer Programming in C Operating Systems Quantitative Science Studies Systems Analysis & Design Text Analytics Research Interests Research Projects Research Supervision Publications Text Analytics In Text Analytics, I work primarily on tasks like Sentiment Analysi and Social Media Text Analytics (such as algorithms and techniques for Hate Speech, Hope Speech, Emotion analysis, mental health and online well-being, etc.). I have a Text Analytics research group which focuses on these tasks. See www.textanalytics.in for details. Scientometrics My interest in Scientometrics is on analysis of scholarly databases, computational analysis of bibliometric data for mapping research competence of institutions/ countries, international research collaboration, identifying thematic research trends in different disciplines, altmetric studies, mining scientific publications, etc. I have special interest in analysis of STI data for India. My research group has designed a Research Mapping system for India, though a bit old data but still an interesting visit, available at: Indian Science Reports (www.indianscience.net). Artificial and Collective Intelligence My interest in Artificial & Collective Intelligence is aimed at analyzing the structural and dynamic properties of collective systems exhibiting intelligent behaviours. I have designed agent-based simulations to model complex social processes and structures and used them to understand & analyze the dynamics of collective intelligence in social groups and organizations. 1. Pattern Analysis and Impact Assessment of NCSTC funded projects through Statistical, Text-based, Scientometric and Altmetric approaches. Funding Agency: Department of Science & Technology, India. Period: 02 years (2021-23). 2. Skill Development of youth in Digital Technologies in Tier-II & Tier-III cities in Uttar Pradesh and Uttarakhand. Funding Agency: Ministry of Electronics & Information Technology, India. Period: 18 months (2021-23). 3. AI-based Predictive Analytics of Visitors to Public Places and its Applications for Better People Management. Funding Agency: Department of Science & Technology, India. Period: 03 years (2021-24). 4. Quantitative Analysis of Bibliometric and Altmetric Data of Scientific Articles. Funding Agency: Science and Engineering Research Board, India. Period: 03 years (2021-24). 5. HPE-Aruba Centre for Research in Information Systems. Funding Agency: Research Centre in project mode funded by HPE India (Aruba Business Unit). Period: 03 years (2020-23). 6. Design of a Computational Framework for Discipline-wise and Thematic Mapping of Research Performance of Indian Higher Educational Institutions. Funding Agency: Department of Science & Technology, India. Period: 02 years (2019-21). 7. Indo-German (DST-DAAD) Joint Research Project on Design of a Sciento-text Computational Framework for Retrieval and Contextual Recommendations of High Quality Scholarly Articles. Funding Agency: DST-India & DAAD-Germany. Period: 02 years from July 2017. 8. Indo-Mexican (DST-CONACYT) Joint Research Project on Machine Learning Techniques for Context Aware Recommender Systems. Funding Agency: DST-India & CONACYT-Mexico. Period: 03 years from June 2013. 9. Supervised and Unsupervised Machine Learning Techniques for Classification, Clustering and Sentiment Labeling of Web Documents. Funding Agency: University Grants Commission, India. Period: 03 years from July 2013. Post-Doctoral Anurag Kanaujia Since 2022, First at Banaras Hindu University and then at University of Delhi, till June 2025. Hiran H lathabai @Banaras Hindu University, Varanasi, during 2020-21. Doctoral Madhavi Devraj : On Algorithmic Formulation for Information Extraction and Sentiment Analysis, @ U.P. Technical University, Lucknow, Degree Awarded in 2016. Pranav Waila : Computational Matchmaking and Recommender Systems, @Banaras Hindu University, Varanasi, Degree Awarded in 2017. Ashraf Uddin : A Text Analytics and Network Theoretic Framework for Quantitative Characterization of Scholarly Data, @ South Asian University, New Delhi. Degree Awarded in 2018. Marisha : Algorithmic and Model-based Analysis in Scientometrcs, @ Banaras Hindu University, Varanasi. Degree awarded in 2019. Rajesh Piryani : Opinion Mining and Sentiment Analysis of Social Media Texts, @ South Asian University, New Delhi. Degree awarded in 2019. Vedika Gupta : Linguistic Approaches for Sentiment Analysis of Social Media Data, @ National Institute of Technology, Delhi, As Co-supervisor, Degree awarded in 2020. Tanu Solanki : Computational Analysis of Research Performance and Collaboration Patterns in Higher Education Institutions of India, , @ U.P. Technical University, Lucknow, Degree Awarded in 2021. Sumit Kumar Banshal : An Analysis of Metrics for Scholarly Articles Derived from Bibliometric and Social Media Data, @ South Asian University, New Delhi, Degree Awarded in 2021. Jyoti Paswan : Measuring and Characterizing Gender Distribution in Research Publishing, , @ Banaras Hindu University, Varanasi, Awarded, 2023. Prashasti Singh : Scholarly databases: A Computational Analysis of Coverage, Retrieval Quality and Metadata and Subject Classifcation, @ Banaras Hindu University, Varanasi, Awarded, 2023. Mousumi Karmakar : Computational Analysis of Social Media Activity Around Scholarly Articles, @ Banaras Hindu University, Varanasi, Awarded, 2023. Jyoti Dua : Computational Analysis of Patterns in International Research Collaboration, @ Banaras Hindu University, Varanasi, Awarded 2024. Aakash Singh : Computational Methods and Resources for Analysis of Multimodal Social Media Data Towards Online Well-Being, @ Banaras Hindu University, Varanasi, Awarded 2024. Deepawali Sharma : Computational Methods and Datasets for detection of hateful and offensice content in social media data, @ Banaras Hindu University, Varanasi, Awarded 2024. Abhirup Nandy : Algorithmic frameworks for identifying research expertise of institutions and their applications, @ Banaras Hindu University, Varanasi, Awarded 2024. Solanki Gupta : Computational Analysis of statistical Laws in scholarly Communications, @ Banaras Hindu University, Varanasi, Awarded 2024. 2025 Prashasti Singh, Vivek Kumar Singh, Anurag Kanaujia, Abhirup Nandy, “Linking Research Publications to SDGs: Exploring the SDG Mapping in Web of Science, Scopus and OpenAlex”, Proceedings of 20th International Conference on Scientometrics and Informetrics (ISSI2025), 23-27 June, 2025, Yerevan, Armenia. DOI: 10.51408/issi2025_068 Prashasti Singh, Vivek Kumar Singh, Abhirup Nandy, Hiran H Lathabai, “Boost Formalism- A New Framework to Assess the Impact of Collaborations at Institutional Level”, Proceedings of 20th International Conference on Scientometrics and Informetrics (ISSI2025), 23-27 June, 2025, Yerevan, Armenia. DOI: 10.51408/issi2025_067 Aakash Singh, Deepawali Sharma, Vivek Kumar Singh, “EmoGif: A Multimodal Approach to Detect Emotional Support in Animated GIFs”, IEEE Transactions on Computational Social Systems, Online First. IEEE. DOI: 10.1109/TCSS.2025.3544263 (ISSN: 2329-924X, IF: 4.5) Solanki Gupta, Vivek Kumar Singh, “Exploring Distributional Characteristics and Similarities of Scholarly Keywords: A Comparative Study of Web of Science Keywords Plus and Dimensions Concepts”, Performance Measurement and Metrics, Online First. Emerald. DOI: 10.1108/PMM-12-2024-0060 (ISSN: 1467-8047, IF: 1.8) Tanusree Nath, Vivek Kumar Singh, Vedika Gupta, “BongHope: An annotated corpus for Bengali hope speech detection”, International Journal of Information Technology, Online First. Springer. DOI: 10.1007/s41870-025-02484-2 (ISSN: 2511-2112,Cite Score: 2.6) Deepawali Sharma, Tanusree Nath, Vedika Gupta, Vivek Kumar Singh, “Hate Speech Detection Research in South Asian Languages: A Survey of Tasks, Datasets and Methods”, ACM Transactions on Asian and Low-Resource Language Information Processing, Online First. ACM. DOI: 10.1145/371171 (ISSN: 2375-4702, IF: 2.0) Deepawali Sharma, Vedika Gupta, Vivek Kumar Singh, Bharathi Raja Chakravarthi, “Stop the Hate, Spread the Hope: An Ensemble Model for Hope Speech Detection in English and Dravidian Languages”, ACM Transactions on Asian and Low-Resource Language Information Processing, Online First. ACM. DOI: 10.1145/3716383 (ISSN: 2375-4702, IF: 2.0) 2024 Hiran H Lathabai, Prashasti Singh, Satya Swarup Srichandan, Vivek Kumar Singh, “Two fast Algorithms for Computation of h-index”, Journal of Information Science, Online First. Sage. DOI: 10.1177/01655515241293 (ISSN: 0165-5515, IF: 2.4) Abhirup Nandy, Aakash Singh, Vedika Gupta, Vivek Kumar Singh, “Bibliographic Coupling and Conceptual Similarity: Are the bibliographically coupled papers also conceptually similar?”, Journal of Scientometric Research, Vol. 13, No. 03, pp. 706-714. Springer. DOI: 10.5530/jscires.20041115 (ISSN: 2320-0057, IF: 0.8) Prashasti Singh, Vivek Kumar Singh, Anurag Kanaujia, “Exploring the publication metadata fields in Web of Science, Scopus and Dimensions: Possibilities and ease of doing scientometric analysis”, Journal of Scientometric Research, Vol. 13, No. 03, pp. 715-731. Springer. DOI: 10.5530/jscires.20041144 (ISSN: 2320-0057, IF: 0.8) Deepawali Sharma, Vivek Kumar Singh, Vedika Gupta, “TABHATE: A Target-based Hate Speech Detection Dataset in Hindi”, Social Network Analysis and Mining, Vol. 14, article number 190. Springer. DOI: 10.1007/s13278-024-01355-1 (ISSN: 1869-5469, IF: 2.3) Deepawali Sharma, Vedika Gupta, Vivek Kumar Singh, David Pinto, “Should we stay silent on violence? An ensemble approach to detect violent incidents in Spanish”, Natural Language Processing, Cambride University Press, Online First. DOI: 10.1017/nlp.2024.25 (ISSN: 1469-8110, IF: 2.5) Vivek Kumar Singh, Prashasti Singh, Anurag Kanaujia, “Open access ava",
  "content_length": 71869,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:41"
}