{
  "name": "Vivek Gupta 0001",
  "homepage": "https://vgupta123.github.io",
  "status": "success",
  "content": "Vivek Gupta Home Main About Publications Publications Master Thesis Ph.D. Thesis Experience Internships Miscellaneous Talks Awards Services Mentees Contact Vivek Gupta Vivek Gupta Incoming Assistant Professor (Fall 2024) School of Computing and Augmented Intelligence Arizona State Univeristy Curriculum Vitae, Google Scholar Postdoctoral Researcher Cognitive Computation Group Computer and Information Science University of Pennsylvania Host: Prof. Dan Roth Research Statement, Presentation Ph.D. Computer Science Utah NLP Group Kahlert School of Computing, University of Utah Advisor: Prof. Vivek Srikumar Bloomberg Fellowship 2021-23: (Mentor: Dr. Shuo Zhang) Committee: Prof. Vivek Srikumar, Prof. Jeff Phillips, Prof. Ellen Riloff, Prof. William Wang, Prof. Mohit Bansal Dissertation, Defense PPT Welcome to my homepage! Here, you'll discover a selection of my articles, talks, and contact information. To explore, simply use the links in the left-hand menu. Joining ASU : I'll be joining Arizona State University as an Assistant Professor in the School of Computing and Augmented Intelligence starting Fall 2024. I am seeking 1-2 motivated students to join my research lab in 2024. If you're interested in developing trustworthy AI systems for complex multimodal data (tables, charts, maps, flowcharts etc.), please email me. Interested in Collaboration? If you are a student (BS, MS, Ph.D.) and want to work with me, then familiarize yourself with my research and fill this interest form. Others, please refer to my availability on the calendar for suitable meeting times. Feel free to contact me via email at [reverseFirstName]9@gmail.com. My Research Journey : For inquiries related to Ph.D. applications, my research path, or general academic and career advice, please review my vlog beforehand. You can access the full video here on YouTube and the official vlog archive here. Explore my Ph.D. struggles in this blog post, a candid reflection on my academic journey. For grad school application advice check this awesome repository. Make a difference : Support our Winter Clothing Distribution Campaign!. Check out past campaign COVID-19 relief efforts and other social works done by Raj. Bhanwar Welfare Trust. Help needed for CSR proposal writing, check details here. Together, let's make a positive impact in the lives of those in need. Selective Publications For full publication list refer to Google Scholar or Publication Page. TempTabQA: Temporal Question Answering for Semi-Structured Tables, Vivek Gupta, Pranshu Kandoi, Mahek Bhavesh Vora, Shuo Zhang, Yujie He, Ridho Reinanda, Vivek Srikumar published at EMNLP 2023, [Paper] [Project Page] [PPT] [Media] InfoSync: Information Synchronization across Multilingual Semi-structured Tables, Sidharth Khincha, Chelsi Jain, Vivek Gupta*, Tushar Kataria*, Shuo Zhang published at ACL 2023, presented at Matching@ACL 2023 [Project Page][Paper] [Video] [Poster] [PPT] Right for the Right Reason: Evidence Extraction for Trustworthy Tabular Reasoning, Vivek Gupta, Shuo Zhang, Alakananda Vempala, Yujie He, Temma Choji, Vivek Srikumar published at ACL 2022 [Paper] [Poster] [PPT] [Video] [Media] [LinkedIn] Is My Model Using The Right Evidence? Systematic Probes for Examining Evidence-Based Tabular Reasoning, Vivek Gupta, Riyaz A. Bhat, Atreya Ghosal, Manish Srivastava, Maneesh Singh, Vivek Srikumar published at TACL 2022, presented at ACL 2022 [Paper][Preprint] [Poster] [PPT] [Video] Incorporating External Knowledge to Enhance Tabular Reasoning, J. Neeraja*, Vivek Gupta*, and Vivek Srikumar Published at NAACL 2021 [Paper] [Project Page] [Code] [Video] [Poster] [PPT] InfoTabS: Inference on Tables as Semi-structured Data, Vivek Gupta, Maitrey Mehta, Pegah Nokhiz, Vivek Srikumar Published at ACL 2020 [Paper] [Project Page] [Video] [Data] [Code] News [June 21, 2024] Welcome Aadit to the CogComp Group. Through AOEP internship programs. [June 17, 2024] Welcome Harshavardhan and Mike to the CogComp Group. [Jun 6, 2024] Excited to join SCAI at ASU as an Assistant Professor from Fall 2024! [May 27, 2024] Talk to high school students on “Impact of AI in today world”, interviewer: Mihir Garimella, access the full video here. [May 15, 2024] Three paper accepted in ACL 2024 (findings). Research on Flowcharts QA, Chart FactChecking, and Finance QA. [May, 2024] Welcome Athrav, Kushagra to the CogComp group. [April, 2024] Giving invited talk on “AI for Complex Data” at Google Gemini, Microsoft Research, Adobe Research, SCAI at ASU, Samsung Research, National Research Council Canada. [Mar 8, 2024] Thank you, Adobe, for the unrestricted gift supporting our table understanding research. [Jan 18, 2024] Read my latest blog, 'A Candid Reflection at My PhD Struggles and Challenges’ - insightful, raw, and real. Click here to read. [Jan 6, 2024] Athrav will be spending summer 2024 in Cognitive Computation Group at UPenn. Congrats Athrav. [Jan 5, 2024] Abhilash is looking for MS position, Dibyakanti is looking for Ph.D. position in DL theory. Keep an eye on their application. [Jan 1, 2024] Mahika joined as a RA in Cognitive Computation Group at UPenn, working on catalogue exapansion. Welcome Mahika!! more ..",
  "content_length": 5183,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:38"
}