{
  "name": "Vivek Deulkar",
  "homepage": "https://plaksha.edu.in/faculty-details/vivek-deulkar",
  "status": "success",
  "content": "Dr. Vivek Deulkar | Assistant Professor, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Vivek Deulkar Vivek Deulkar Assistant Professor, Plaksha University PhD, IIT Bombay Area of Expertise: Computation Energy Systems Applied Reinforcement Learning Select About About Vivek Deulkar Dr. Vivek Deulkar is an Assistant Professor at Plaksha University. Before joining Plaksha, he was a postdoctoral research associate at Manning College of Information and Computer Sciences, University of Massachusetts, Amherst, where he developed Artificial Intelligence (AI) solutions for sustainable energy systems, renewable integration, along with battery storage, electricity markets, and energy arbitrage. He did his PhD in Electrical Engineering at the Indian Institute of Technology Bombay. His PhD research was in the space of smart grid, managing uncertainties in renewable generation using battery storage, drawing on tools from stochastic modeling, applied probability, sequential decision-making, optimization, control, and reinforcement learning. Dr. Deulkar has an MTech in Control and Computing from Electrical Engineering, IIT Bombay, and a BTech in Electronics and Communication Engineering from Visvesvaraya National Institute of Technology (VNIT) Nagpur. He also has experience working with the Engineering Research Centre, Tata Motors Ltd., Pune, where he worked in the Auto-Electric Embedded Systems design group towards software development of embedded controllers used for various automotive applications. Research Interests Computational Energy Systems Battery Scheduling Optimization Reinforcement Learning Control Classical Electromagnetics Past Associations Postdoctoral Research Associate, College of Information and Computer Sciences (CICS), University of Massachusets (UMass), Amherst Manager, Engineering Research Center, Tata Motors Ltd. Education PhD, Electrical Engineering, IIT Bombay MTech, Control and Computing, IIT Bombay BTech, Electronics and Communication, VNIT Nagpur Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 5263,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:39"
}