{
  "name": "Vivek Srikumar",
  "homepage": "http://svivek.com",
  "status": "success",
  "content": "Vivek Srikumar I am an associate professor in the Kahlert School of Computing at the University of Utah, where I co-lead the Utah NLP group and am a member of the Utah Center for Data Science and AI. My research asks: How do we build AI systems when we canât just scale up? I study how we can create reliable AI solutions for constrained environments where data or resources are inherently limited. This involves developing neuro-symbolic methods and data resources applicable: mental health applications with limited data, multilingual systems without massive corpora, and high-stakes deployments that may have limited hardware infrastructure. My work combines domain knowledge with rigorous evaluation to reveal where models fail and how to fix them systematically. My research has been applied to real-world problems, such as work with SafeUT, Utahâs statewide text-based crisis hotline for high schoolers. I publish in core NLP, ML and AI venues including ACL, EMNLP, ICML, NeurIPS and AAAI, and was recognized with the best paper award at EMNLP 2014 and best paper honorable mention at CoNLL 2019. I served as program co-chair for ACL 2024. Read more about my work â Teaching I have taught courses on machine learning, neuro-symbolic modeling, structured prediction, and deep learning for NLP. All my course materials are publicly available with lectures for the larger classes livestreamed and archived on YouTube. Here is a catalog of class lectures on various topics on machine learning and NLP. I also co-organized the Upskilling in AI program for Utah faculty in 2024-25. Currently teaching CS 6964 — Neuro-symbolic Modeling, Fall 2025 More teaching â Research Patrons My research has been supported by the US National Science Foundation (NSF), the US-Israel Binational Science Foundation (BSF) and the National Institute for Health (NIH). In addition, the following companies have generously supported by work either via awards and compute gifts: Intel, Google, Verisk, Bloomberg, and Nvidia. Contact Email svivek at cs dot utah dot edu Â Â Prospective students Contact form (see note below) Â Â Office Room 3126 in Merrill Engineering Building Â Â Mailing address 50 S. Central Campus Drive, Room 3126 Â Salt Lake City, UT 84112. Elsewhere: Google scholar, DBLP, arXiv, Semantic Scholar Prospective students I am always interested in working with motivated students. However, due to high email volume, I cannot respond to general admissions questions (contact the department), templated emails sent to multiple faculty or requests without specific research focus. To help me respond thoughtfully to serious inquiries, please use the contact form. I will respond to inquiries that demonstrate familiarity with my work and clear alignment with my research directions.",
  "content_length": 2785,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:42"
}