{
  "name": "Vladimir Filkov",
  "homepage": "http://www.cs.ucdavis.edu/~filkov",
  "status": "success",
  "content": "Vladimir Filkov's Home Page Research Papers Service Teaching Students Funding Software CV Vladimir Filkov ACM Distinguished Member Professor, Computer Science Dept DECAL Lab Director AI for Health Lab Director UC Davis Address: Academic Surge, 2077 1 Shields Ave Davis, CA 95618, USA Phone: 530-752-8393 Email: vfilkov at ucdavis dot edu NEWS: August 2025: We released OSSPREY, our sustainability tracker tool that offers actionable help for OSS projects. Here's a blog on it from the UC OSPO web. Spring 2025: Joined CodeLab as Faculty Advisor. Excited to work with these extraordinary tech savvy young engineers, coders, and designers to create opportunities for our students and soilutions for companies. February 2025: It was a great honor to give a Distinguished Lecture at CMU CS/S3D, on our ongoing work on OSS Sustainability. Video is available here. October 2024: I was the General Chair of ASE 2024, which took place Oct 28 - Nov 1, 2024, in Sacramento. It was a year's worth of work by a lot of volunteers. Great to see all my friends, collaborators and meet new people during the event. September 2024: Raiyan Jahangir joined our lab, as a PhD student. Welcome Raiyan! May 2024: New grant on Multimodal AI Models for Atrial Fibrilation MM-Afib. May 2024: New grant on UC-wide OSPO! Many thanks to the SLOAN foundation for funding this collaboration with 5 other UCs. UC-OSPO. Apil 2024: Our paper on researched actionables in SE has been accepted at FSE IVR. June 2023: The website for our project \"Jumpstarting Nascent OSS Projects\" is now active. May 2023: I visited 3 campuses of Amrita University in Kochi, Comibatore, and Amritapuri. Thank you for the wonderful experiences! March 2023: Our OSS Sustainability Forum was an unqualified success. Check out our blog here. January 2023: Many thanks to Google for the gift that will help us organize a forum on OSS Sustainability. November, 2022: Our paper \"On the Self-Governance and Episodic Changes in Apache Incubator Projects: An Empirical Study\" has been accepted for presentation at ICSE 2023. Congrats Likang Yin and coauthors! Final version is here. August, 2022: Our NSF GCR grant, to study OSS Sustainability using socio-technical and governance data, was approved for Phase II. Thank you to all our hard working students, postdocs, and PIs. And manythanks to NSF. May, 2022: Our paper \"Code, Quality, and Process Metrics in Graduated and Retired ASFI Projects\" has been accepted for presentation at FSE 2022. Congrats Stefan and Likang Yin! Final version is here. November, 2021: Announcing a new postdoc position! Application review begins December 15, 2021. For additional details and how to apply see here. October, 2021: Our work on COVID admission models was featured on DataLab and Dateline. Check it out here. August, 2021: We did a podcast for the CHAOSS Community, on our work on OSS Sustainability forecasting. Check it out here. June, 2021: Dr. Stefan Stanciulescu joins our sustainability project. Welcome Stefan! May, 2021: Our paper \"Sustainability Forecasting for Apache Incubator Projects\" has been accepted for presentation at FSE 2021. Congrats Likang Yin and coauthors! Final version is here. October 1, 2020: New grant (Phase I) (thanks NSF!), to study OSS Sustainability using socio-technical and governance data. September 21, 2020: Likang Yin wins a Distinguished ACM SIGSOFT Distinguished Paper Award. CS Dept post.",
  "content_length": 3413,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:47"
}