{
  "name": "Vladimir Kolmogorov",
  "homepage": "http://pub.ist.ac.at/~vnk",
  "status": "success",
  "content": "Vladimir Kolmogorov's homepage Vladimir Kolmogorov Professor Institute of Science and Technology (IST), Austria For Postdocs: I have postdoc openings in the area of discrete optimization. You can also check the ISTfellow  program. For prospective PhD students: Please visit the IST Austria Graduate School page for details on our graduate program. For Interns: I am not accepting intern applications at the moment. About me: I received the M.S. degree in Applied Mathematics and Physics from the Moscow Institute of Physics and Technology, and the Ph.D. degree in Computer Science from Cornell University. After spending two years as an Associate Researcher at Microsoft Research in Cambridge, England, I joined University College London as a Lecturer. In 2006-2011 I held the Royal Academy of Engineering/EPSRC Research Fellowship. In September 2011 I moved to IST Austria. My main research area is discrete optimization. Specific topics include the following: Complexity classifications, in particular in the framework of Valued Constraint Satisfaction Problems. Designing algorithms for combinatorial optimization problems (maximum flow, minimum cost perfect matching, etc). Designing algorithms for MAP inference in Markov Random Fields. Previously, I was also working on applications of discrete optimization algorithms (such as \"graph cuts\") in computer vision. Links: Curriculum Vitae Software that I wrote Workshop on Optimization in Machine Learning, May 2020, IST Austria (cancelled due to coronavirus) ERC Consolidator grant (2014-2020). European Laboratory for Learning and Intelligent Systems (ELLIS) Personal Current team members: Mikhail Karapetyants (postdoc) Martin Dvořák (PhD student) Jeferson Zapata (PhD student) Pavel Arkhipov (PhD student) Asaf Lev-Ran (PhD student) Former team members: Rustem Takhanov (postdoc) Alexandr Kazda (postdoc) K S Sesh Kumar (postdoc) Paul Swoboda (postdoc) Sharareh Alipour (postdoc) Yekini Shehu (postdoc) Nasim Samei (postdoc) Ivan Sergeev (postdoc) Michal Rolínek (PhD student) Publications: Greedy matroid base packings with applications to dynamic graph density and orientations Pavel Arkhipov, Vladimir Kolmogorov. arXiv technical report, November 2025. Faster algorithms for packing forests in graphs and related problems Pavel Arkhipov, Vladimir Kolmogorov. In ACM-SIAM Symposium on Discrete Algorithms (SODA), January 2026. Composition Direction of Seymour's Theorem for Regular Matroids -- formally verified Martin Dvorak, Tristan Figueroa-Reid, Rida Hamadani, Byung-Hak Hwang, Evgenia Karunus, Vladimir Kolmogorov, Alexander Meiburg, Alexander Nelson, Peter Nelson, Mark Sandey, Ivan Sergeev. arXiv technical report, September 2025. Duality theory in linear optimization and its extensions -- formally verified Martin Dvorak, Vladimir Kolmogorov. Accepted to Annals of Formalized Mathematics (AFM), 2025. A new notion of commutativity for the algorithmic Lovasz Local Lemma David G. Harris, Fotis Iliopoulos and Vladimir Kolmogorov. Theory of Computing (ToC), 21:1-34, 2025. Preliminary version appeared in Approximation, Randomization, and Combinatorial Optimization (RANDOM), August 2021. A simpler and parallelizable O( √ log n)-approximation algorithm for Sparsest Cut Vladimir Kolmogorov. ACM Transactions on Algorithms (TALG), 21(4):1-22, 2025. Preliminary version appeared in ACM Symposium on Parallelism in Algorithms and Architectures (SPAA), June 2024. Simple parallel estimation of the partition ratio for Gibbs distributions David G. Harris, Vladimir Kolmogorov. arXiv technical report, May 2025. Certifying solutions of degenerate semidefinite programs Vladimir Kolmogorov, Simone Naldi, Jeferson Zapata. SIAM Journal on Optimization (SIOPT), 235(3):1630-1654, 2025. Parameter estimation for Gibbs distributions David G. Harris and Vladimir Kolmogorov. ACM Transactions on Algorithms (TALG), 21(1):1-39, 2024. Preliminary versions appeared in COLT 2018 (V. Kolmogorov, \"A Faster Approximation Algorithm for the Gibbs Partition Function\") and ICALP 2023 (D. Harris, V. Kolmogorov, \"Parameter estimation for Gibbs distributions\"). Generalized minimum 0-extension problem and discrete convexity Martin Dvorak and Vladimir Kolmogorov. Mathematical Programming (MP), 209:279-322, March 2024. Solving relaxations of MAP-MRF problems: Combinatorial in-face Frank-Wolfe directions Vladimir Kolmogorov. In IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June 2023. OrderedCuts: A new approach for computing Gomory-Hu tree Vladimir Kolmogorov. arXiv technical report, August 2022. A computational study of Gomory-Hu construction tree algorithms Vladimir Kolmogorov. arXiv technical report, August 2022. One-sided Frank-Wolfe algorithms for saddle problems Vladimir Kolmogorov and Thomas Pock. In International Conference on Machine Learning (ICML), July 2021. A Local Lemma for Focused Stochastic Algorithms Dimitris Achlioptas, Fotis Iliopoulos and Vladimir Kolmogorov. In SIAM Journal on Computing (SICOMP), 48(5), 1583-1602, 2019. Function Norms for Neural Networks Amal Rannen-Triki, Maxim Berman, Vladimir Kolmogorov and Matthew B. Blaschko. In ICCV workshop: Statistical Deep Learning for Computer Vision, October 2019. Testing the complexity of a valued CSP language Vladimir Kolmogorov. In 46th International Colloquium on Automata, Languages and Programming (ICALP), July 2019. MAP inference via Block-Coordinate Frank-Wolfe Algorithm Paul Swoboda and Vladimir Kolmogorov. In IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June 2019. Efficient Optimization for Rank-based Loss Functions Pritish Mohapatra, Michal Rolínek, C.V. Jawahar, Vladimir Kolmogorov and M. Pawan Kumar. In IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), June 2018 (best paper honorable mention award). Even Delta-Matroids and the Complexity of Planar Boolean CSPs Alexandr Kazda, Vladimir Kolmogorov and Michal Rolínek. In Transactions on Algorithms (TALG), 15(2), December 2018. Preliminary version appeared in ACM-SIAM Symposium on Discrete Algorithms (SODA), January 2017. Commutativity in the Algorithmic Lovasz Local Lemma Vladimir Kolmogorov. In SIAM Journal on Computing (SICOMP), 47(6):2029-2056, 2018. Preliminary version appeared in IEEE Symposium on Foundations of Computer Science (FOCS), October 2016. On the Complexity of Scrypt and Proofs of Space in the Parallel Random Oracle Model Joël Alwen, Binyi Chen, Chetan Kamath, Vladimir Kolmogorov, Krzysztof Pietrzak and Stefano Tessaro. In EUROCRYPT, May 2016. Total Variation on a Tree Vladimir Kolmogorov, Thomas Pock and Michal Rolínek. In SIAM Journal on Imaging Sciences (SIIMS), 9(2):605-636, 2016. Inference algorithms for pattern-based CRFs on sequence data Vladimir Kolmogorov and Rustem Takhanov. In Algorithmica, September 2016, 76(1):17-46. Preliminary version (R. Takhanov, V. Kolmogorov \"Inference algorithms for pattern-based CRFs on sequence data\") appeared in International Conference on Machine Learning (ICML), June 2013. Effectiveness of Structural Restrictions for Hybrid CSPs Vladimir Kolmogorov, Michal Rolínek and Rustem Takhanov. In 26th International Symposium on Algorithms and Computation (ISAAC), December 2015. The Complexity of General-Valued CSPs Vladimir Kolmogorov, Andrei Krokhin and Michal Rolínek. In SIAM Journal on Computing (SICOMP), 46(3), 1087-1110, 2017. Preliminary version appeared in IEEE Symposium on Foundations of Computer Science (FOCS), October 2015. Proofs of Space Stefan Dziembowski, Sebastian Faust, Vladimir Kolmogorov and Krzysztof Pietrzak. In Advances in Cryptology (CRYPTO), August 2015. A Multi-Plane Block-Coordinate Frank-Wolfe Algorithm for Training Structural SVMs with a Costly max-Oracle Neel Shah, Vladimir Kolmogorov and Christoph H. Lampert. In IEEE Conference on Computer Vision and Pattern Recognition (CVPR), June 2015. The power of linear programming for general-valued CSPs Vladimir Kolmogorov, Johan Thapper and Stanislav Zivny. In SIAM Journal on Computing (SICOMP), 44(1):1-36, 2015. A new look at reweighted message passing Vladimir Kolmogorov. In IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), May 2015, 37(5):919-930. Superconcentrators of Density 25.3 Vladimir Kolmogorov and Michal Rolínek. arXiv technical report, May 2014. Accepted to Ars Combinatoria. Potts model, parametric maxflow and k-submodular functions Igor Gridchyn and Vladimir Kolmogorov. In International Conference on Computer Vision (ICCV), December 2013. Partial Enumeration and Curvature Regularization Carl Olsson, Johannes Ulen, Yuri Boykov and Vladimir Kolmogorov. In International Conference on Computer Vision (ICCV), December 2013. The power of linear programming for finite-valued CSPs: a constructive characterization Vladimir Kolmogorov. In International Colloquium on Automata, Languages and Programming (ICALP), July 2013. Optimal Coalition Structures in Cooperative Graph Games Yoram Bachrach, Pushmeet Kohli, Vladimir Kolmogorov and Morteza Zadimoghaddam. In AAAI Conference on Artificial Intelligence (AAAI), July 2013. Computing the M most probable modes of a graphical model Chao Chen, Vladimir Kolmogorov, Yan Zhu, Dimitris Metaxas and Christoph H. Lampert. In International Conference on Artificial Intelligence and Statistics (AISTATS), April-May 2013. A Dual Decomposition Approach to Feature Correspondence Lorenzo Torresani, Vladimir Kolmogorov and Carsten Rother. In IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), February 2013, 35(2):259-271.Preliminary version (\"Feature Correspondence via Graph Matching: Models and Global Optimization\") appeared in European Conference on Computer Vision (ECCV), October 2008. Generalized sequential tree-reweighted message passing Thomas Schoenemann and Vladimir Kolmogorov. To appear in Advanced Structured Prediction, eds. Sebastian Nowozin, Peter V. Gehler, Jeremy Jancsary and Christoph Lampert, MIT Press. Approximating Marginals Using Discrete Energy M",
  "content_length": 19232,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:50"
}