{
  "name": "Vladimir Braverman",
  "homepage": "https://www.cs.jhu.edu/~vova",
  "status": "success",
  "content": "Vladimir (Vova) Braverman Links: [News][Publications][Code][Open Positions][Students][Teaching][Funding][Service][Short Bio] Vladimir Braverman Address: Malone Hall, 3400 North Charles Street Baltimore, MD 21218 Phone: 713-348-0000 Email: LinkedIn I am a Professor and an Associate Head for Faculty at the Department of Computer Science with a secondary appointment at the Department of Biomedical Enginnering at the Johns Hopkins Whiting School of Engineering. Research Interests: My current research interests include machine learning and algorithms with applications to digital health and computer systems. In the past, I worked on cosmological simulations. Additional Affiliations: Researcher at Google Research. Network Programming Initiative Adjunct Professor, Department of Computer Science, Rice University. Adjunct Professor, Department of Diagnostic and Interventional Imaging, UTHealth Houston. The Johns Hopkins Mathematical Institute for Data Science (MINDS) The Institute for Data Intensive Engineering and Science (IDIES) Past Affiliations: Victor E. Cameron Professor of Computer Science and Electrical and Computer Engineering, Rice University, July 2022- January 2025 Researcher at HyperRoll (acquired by Oracle.) Service: Program Committee: Area Chair for NeurIPS 2021, 2022, 2023, ICML 2023, INFOCOM 2024, ICDT 2024, SIGMETRICS 2023, 2022, APOCS 2022, ICDT 2021, ICALP 2020, SOSA 2020, PODS 2020, CSR 2019, LATIN 2018, SODA 2018 , FOCS 2017, MASSIVE 2016, COCOON 2015 Associate Editor for Journal of Computer and System Sciences (JCSS) Co-organizer of NSF workshop on programmable networks, NYC, 2018 Co-organizer of Joint PI Meeting: NSF BIGDATA and Big Data Hubs and Spokes, 2018 Co-organizer of Capital Theory Day, Baltimore, MD, 2016 Co-organizer of Sublinear Algorithms Workshop, Baltimore, MD, 2016 Co-organizer of Processing Big Data Streams, Shonan Village Center, Japan, 2017 Funding: My research has been supported in part by NSF, ONR, Google , DARPA , Cisco , Nvidia , IDIES , KIAT(Korea Institute for Advancement of Technology) Open Positions: I am looking for outstanding students and postdocs who are interested to work on algorithmic challenges of modern machine and deep learning. If you are interested, please send me an email.",
  "content_length": 2264,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:46"
}