{
  "name": "Vlado Keselj",
  "homepage": "https://www.cs.dal.ca/~vlado",
  "status": "success",
  "content": "Vlado Keselj: Home page Computer Science Vlado Keselj Professor of Computer Science, Director of MDI program (Master of Digital Innovation) Faculty of Computer Science Dalhousie University E-mail: vlado @ dnlp. ca or vlado @ cs. dal. ca WWW: https://web.cs.dal.ca/~vlado/ https://vlado.ca Other contact information, Campus maps Shortcuts: NLP Software DFA DT DNLP Blog DPC DalCode NACLO Supervision Publications Teaching CSCI 6509: Advanced Topics in Natural Language ProcessingCSCI 4152: Natural Language Processing DGIN 5201: Digital Transformation CSCI 1108: Introduction to Experimental Robotics CSCI 2132: Software Development CSCI 2133: Rapid Programming Techniques for Innovation CSCI 1110: Computer Science I and II Research Research Interests: I have research interest in many areas of Computer Science. The following list of areas is sorted from more to less relevant areas, and from newer to older: Natural Language Processing, Data and Text Mining, Behavioural Analytics, Machine Learning, Information Retrieval, Algorithmics, Programming Languages, Computational Number Theory, Multi-Agent Systems. Student Supervision Publications Software Research Groups and some Projects: DNLP - Dalhousie Natural Language Processing Group (DalTREC Project) MALNIS - Machine Learning and Networked Information Spaces Some previous or non-active groups are listed in the archive page. Sponsors Research Links and Resources dalthesis - LaTeX template for theses at Dal About research in Computer Science Links related to Graduate Studies at Dalhousie Selected Conferences NLP Research Links Data Mining Research Links Programming Languages TeX (LaTeX) Dalhousie Software Links Administration (2023 Jan-Jun) on a 6-months sabbatical (2020-2022) Director of MDI Program (Master of Digital Innovation) (2018-2022) Director of MEC Program (Master of Electronic Commerce) (2016-) DFA Travel Fund administration (2020-2021) Chair of the MDI Search Committee (2019-2022) Graduate Committee member more administrative and service information is listed below Programming Competitions (2016-2020) Dalhousie Programming Contests, Coach of the Dalhousie ACM programming team (2016-2020) DPC/H – Dalhousie Programming Contest for High-school and Junior-high Students (2019) Organizer of the ICPC Preliminary Atlantic Canadian Programming Contest 2019 (2004-2017) Canadian Computing Competitions (for highschools), Junior Committee (2009-15) Co-organizer of NACLO (Dalhousie site) -- North American Computational Linguistics Olympiad for high-school and junior-high students (2003-15) Dalhousie Programming Contests, Coach of the Dalhousie ACM programming team (2011-15) DPC/H – Dalhousie Programming Contest for High-school and Junior-high Students (2009) Organizer of the ACM Preliminary Programming Contest APICS 2009 (2006-8) Co-Organizer of the Dalhousie Software Competition for High-schools in 2006/7 and 2007/8. Administration, Service, and Other Activities Research-related Organizational Activities (2010) Publicity Co-Chair for IEEE/WIC/ACM WI/IAT 2010 (2010) Program Co-Chair for AI'2010 (2005-2009) Treasurer of CAIAC - Canadian Artificial Intelligence Association (was CSCSI - Canadian Society for the Computational Studies of Intelligence) More listed in the archive page Committees (at Dalhousie) (2009-2015) Director of Electronic Commerce (2010-2015) Outreach and Engagement Committee (2009-2015) Electronic Commerce Committee (chair) (2009-2015) Dean's Executive Committee More listed in the archive page Conference organization: (2019) General Co-chair of the 2019 Science Atlantic Conference for Mathematics, Statistics and Computer Science (2016) Faculty sponsor of the DCSI 2016 Conference (Sep 28-30, 2016) Archive © 1996-2024 Vlado Keselj, last update: 11-Aug-2023",
  "content_length": 3773,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:54"
}