{
  "name": "Vojislav B. Misic",
  "homepage": "https://www.scs.torontomu.ca/~vmisic",
  "status": "success",
  "content": "Dr. Vojislav B. Mišić: Info Page home : research : teaching : Welcome! I am a Professor of Computer Science at the Ryerson University, which I have joined in 2009.My previous posts include University of Manitoba in Winipeg, MB, where I worked from 2003 to 2009; The Hong Kong University of Science and Technology, Hong Kong, China (Department of Information and Systems Management), from 1998 to 2003; and University of Belgrade, Serbia (Faculty of Electrical Engineering, Department of Computer Science), from 1994 to 1998. I received my PhD in Computer Science from the University of Belgrade, Serbia (then part of Yugoslavia), in 1993. The thesis entitled Automatic Generation of Database Applications from Formal Specifications was done under the supervision of Prof. Branislav Lazarević and Prof. Dušan Velašević. What's New: - The paper \"Modeling of Bitcoin's blockchain delivery network\", co-authored by Prof. Jelena Mišić, Prof. Xiaolin Chang from Beijing Jiaotong University, our student Saeideh Gholamrezazadeh, and our alumnus Dr. M. Zulfiker Ali, to be published in IEEE Transactions on Network Science and Engineering. - The paper \"Towards a Blockchain-Based Healthcare Information System\", co-authored by Prof. Jelena Mišić and Prof. Xiaolin Chang from Beijing Jiaotong University, will be presented as invited paper at the 2019 IEEE/CIC International Conference on Communications in China (ICCC), in August 2019 in Changchun, China. - The paper \"Data lifetime estimation in a multicast-based CoAP proxy\", co-authored by Prof. Jelena Mišić and Prof. Xiaolin Chang from Beijing Jiaotong University, will be presented as invited paper at the International Workshop on Very Large Internet of Things (VLIoT 2019), to be held in conjunction with VLDB 2019 in Los Angeles, CA in August 2019. - The paper \"Kernel based estimation of domain parameters at IoT proxy\", co-authored by Prof. Jelena Mišić and Prof. Xiaolin Chang from Beijing Jiaotong University, was awarded The Best Paper Award at the 2018 IEEE Global Telecommunications Conference (Globecom 2018) in Abu Dhabi, UAE. contact information email vmisicatryersonfullstopca phone: (416) 979-5000 ext. 6697, fax: (416) 979-5064 office: ENG-279, George Vari Engineering and Computing Centre 245 Church Street Department of Computer Science Ryerson University Toronto, ON, Canada M5B 2K3",
  "content_length": 2349,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:55"
}