{
  "name": "Vojtech Forejt",
  "homepage": "https://www.cs.ox.ac.uk/people/vojtech.forejt",
  "status": "success",
  "content": "Vojtěch Forejt | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyVojtěch ForejtVojtěch Forejt Dr Vojtěch Forejt Associate ProfessorGoverning Body Fellow, Kellogg CollegeLeaving date: 17th January 2017Themes:Automated VerificationCompleted Projects:more…InterestsI mainly pursue research in probabilistic verification. More broadly, I study systems that have some stochastic behaviour and/or involve decision making. I develop methods for formally proving properties of such systems, measuring their performance, or assessing their reliability. The systems I study are usually described as Markov chains, Markov decision processes, or their extensions.BiographyI am an Associate Professor in Computer Science (Software Engineering). I am also affiliated with Institute for Theoretical Computer Science at my alma mater. I hold a PhD in computer science from Masaryk University in Brno, and a LLB (Hons) in English law from Open University. Prospective students and postdocs I am always happy to talk to prospective applicants. Please send me your full CV with a short outline of a proposed project. Publications See here. Current Teaching Performance modelling Robust programming Software engineering mathematics Past Teaching Lectures on Software Verification at Oxford University, and Programming for .NET Framework at Masaryk University. Teaching assistant for various subjects (Reasoning about Information Update, Probabilistic model-checking, Foundations of Computer Science, Mathematical Logic, Probability in Computer Science, Automata and Grammars, and Introduction to Functional Programming) Other I am interested in consultancies and in acting as an expert witness within my area of expertise. Please contact me with your queries.ActivitiesPRISMProbabilistic Model CheckingQuantitative Analysis and VerificationCompleted ProjectsTowards comprehensive verification of stochastic systemsAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2193,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:55"
}