{
  "name": "Volker Blanz",
  "homepage": "http://www.grk1564.uni-siegen.de/de/blanz-volker",
  "status": "success",
  "content": "Prof. Dr. rer. nat. Volker Blanz | GRK Universität Siegen Direkt zum Inhalt Für eine korrekte Darstellung dieser Seite benötigen Sie einen XHTML-standardkonformen Browser, der die Darstellung von CSS-Dateien zulässt. Startseite Forschung Mitarbeiter Projekte Phase 1 Projekte Phase 2 Publikationen Promotionsprogramm Kurse Abschlussveranstaltung Kontakt Webmail UNISONO mehr... Fakultät I Fakultät II Fakultät III Fakultät IV Kontakt Wegweiser Suche Erweiterte Suche Personensuche Name Vorname Veranstaltungssuche Nummer Titel Lehrender Katalog der UB Siegen News weitere News DAAD Deutscher Akademischer Austausch Dienst GRK 1564 in Deutscher Akademischer Austausch Dienst Department Elektrotechnik und Informatik Naturwissenschaftlich–Technische Fakultät Zentrum für Sensorsysteme Sie sind hierStartseite » Blanz, Volker Prof. Dr. rer. nat. Volker Blanz Raum: HC-6312Telefon: +49 (271) 740-2035E-Mail: blanz@informatik.uni-siegen.de Anschrift: Universität Siegen Lehrstuhl Medieninformatik 57076 Siegen Note: The list of publications contains only papers that have been published within the active period of the Research Training Group 1564, i.e. between Oct. 2009 and Oct. 2018. ﻿2018Begutachtete Konferenzbeiträge[bib] - Mai Lan Ha, Gianni Franchi, Michael Möller, Andreas Kolb, Volker Blanz - Segmentation and Shape Extraction from Convolutional Neural NetworksIn IEEE Winter Conf. on Applications of Computer Vision (WACV), 2018, pages 1509-1518 - [pdf]2016Begutachtete Konferenzbeiträge[bib] - Shida Beigpour, Mai Lan Ha, Sven Kunz, Andreas Kolb, Volker Blanz - Multi-view Multi-illuminant Intrinsic DatasetIn Proc. British Machine Vision Conference (BMVC), 2016 - [pdf][bib] - Davoud Shahlaei, Marcel Piotraschke, Volker Blanz - Lighting design for portraits with a virtual light stageIn Image Processing (ICIP), 2016 IEEE International Conference on, 2016, pages 1579-1583[bib] - Marcel Piotraschke, Volker Blanz - Automated 3D Face Reconstruction From Multiple Images Using Quality MeasuresIn Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, 2016, pages 3418-34272015Artikel in Zeitschriften[bib] - Matthaeus Schumacher, Marcel Piotraschke, Volker Blanz - Hallucination of facial details from degraded images using 3D face modelsIn Image and Vision Computing, 40, 2015, pages 49 - 64 - [pdf]Begutachtete Konferenzbeiträge[bib] - Miguel Heredia Conde, Davoud Shahlaei, Volker Blanz, Otmar Loffeld - Efficient and Robust Inverse Lighting of a Single Face Image Using Compressive SensingIn The IEEE International Conference on Computer Vision (ICCV) Workshops, 2015[bib] - D. Shahlaei, V. Blanz - Realistic inverse lighting from a single 2D image of a face, taken under unknown and complex lightingIn Automatic Face and Gesture Recognition (FG), 2015 11th IEEE International Conference and Workshops on, 1, 2015, pages 1-8[bib] - M. Schumacher, V. Blanz - Exploration of the correlations of attributes and features in facesIn Automatic Face and Gesture Recognition (FG), 2015 11th IEEE International Conference and Workshops on, 1, 2015, pages 1-82012Artikel in Zeitschriften[bib] - M. Schumacher, V. Blanz - Which facial profile do humans expect after seeing a frontal view? a comparison with a linear face modelIn j-TAP, 9(3), 2012, pages 11:1--11:162011Begutachtete Konferenzbeiträge[bib] - M. Strickert, B. Labitzke, V. Blanz - Partial generalized correlation for hyperspectral dataIn IEEE Symposium on Computational Intelligence and Data Mining, 2011, pages 325-3302008Begutachtete Konferenzbeiträge[bib] - Breuer, P., Kim, K.-I., Kienzle, W., Schoelkopf, B., Blanz, V. - Face Reconstruction from Single Images or Video.In Proc. Of Int. Conf. on Automatic Face and Gesture Recognition FG 2008, 2008[bib] - Bargmann, R., Blanz, V., Seidel, H.-P. - A Nonlinear Viseme Model for Triphone-Based Speech Synthesis.In Proc. Of Int. Conf. on Automatic Face and Gesture Recognition FG 2008, 20082007Artikel in Zeitschriften[bib] - F. Jiang, V. Blanz, A. J. O'Toole - The role of familiarity in three-dimensional view transferability of face identity adaptationIn Vision Research 47(4) 525-531, 2007 - [pdf][bib] - M. Fuchs, V. Blanz, H. Lensch, H.-P. Seidel - Adaptive sampling of reflectance fieldsIn ACM Trans. Graph. 26(2), 2007[bib] - Akiko Yoshida, Volker Blanz, Karol Myszkowski, Hans-Peter Seidel - Testing Tone Mapping Operators with Human-Perceived RealityIn Journal of Electronic Imaging, 16(1), pp. 013004-1 - 013004-14, Springfield, VA, USA, 2007 - [pdf]Buchbeiträge[bib] - V. Blanz - A Learning-Based High-Level Human Computer Interface for Face Modeling and AnimationIn Artifical Intelligence for Human Computing, Springer LNAI 4517, 2007, pages 296-315Begutachtete Konferenzbeiträge[bib] - V. Blanz, K. Scherbaum, H.-P. Seidel - Fitting a Morphable Model to 3D Scans of FacesIn Proc. Of Int. Conf. on Computer Vision ICCV, 2007 - [pdf][bib] - M. Fuchs, H.Lensch, V. Blanz, H.-P. Seidel - Superresolution Reflectance Fields: Synthesizing Images for Intermediate Light DirectionsIn Computer Graphics Forum 26(3) Eurographics 2007, 2007 - [pdf][bib] - K. Scherbaum, M. Sunkel, H.-P. Seidel, V. Blanz - Prediction of Individual Non-Linear Aging Trajectories of FacesIn In Computer Graphics Forum 26(3) Eurographics 2007, 2007 - [pdf][bib] - V. Blanz - Computing Human Faces for Human Viewers: Automated Animation in Photographs and PaintingsIn Int. Conf on Multimodal Interfaces ICMI 06., 2007 - [pdf]Technische Berichte[bib] - P. Breuer, K.I. Kim, W. Kienzle, V. Blanz, B. Schölkopf - Automatic 3D Face Reconstruction from Single Images or VideoIn Technical Report , Max-Planck-Institut für Biologische Kybernetik, 20072006Artikel in Zeitschriften[bib] - V. Blanz, I. Albrecht, J. Haber, H.-P. Seidel - Creating Face Models from Vague Mental ImagesIn Proc. Eurographics, 25(3), 2006, pages 645-654[bib] - F. Jiang, V. Blanz, A.J. O'Toole - Probing the Visual Representation of Faces With Adaption. A View From the Other Side of the MeanIn Psychological Science 17(6), 2006, pages 493-500[bib] - X. Jiang, E. Rosen, T. Zeffiro, J. VanMeter, V. Blanz, M. Riesenhuber - Evaluation of a Shape-Based Model of Human Face Dicrimination Using fMRI and Behavorial TechniquesIn Neuron 50, 2006, pages 159-172Begutachtete Konferenzbeiträge[bib] - V. Blanz - Face Recognition based on a 3D Morphable ModelIn Proc. of the 7th Int. Conference of Automatic Face and Gesture Recognition, 2006, pages 617-622[bib] - R. Bargmann, V. Blanz, H.-P. Seidel - Learnig-Based Facial Rearticulation Using Streams of 3D ScansIn Proceedings of PACIFIC GRAPHICS, 2006[bib] - E. Learned-Miller, Q. Lu, A. Paisley, P. Trainer, V. Blanz, K. Dedden, R. E. Miller - Detecting acromegaly: Screening for disease with a morphable modelIn Medical Image Computing and Computer-Assisted Intervention (MICCAI), 20062005Artikel in Zeitschriften[bib] - M. Fuchs, V. Blanz, H. Lensch, H.-P. Seidel - Reflectance from Images: A Model-Based Approach for Human FacesIn IEEE Trans on Visualization and Comp. Graphics 11(3), 2005, pages 296-305[bib] - A. Mehl, V. Blanz, R. Hickel - Biogeneric Tooth - A New Mathematical Representation for Tooth Morphology in Case of Lower First MolarsIn Eur. J.Oral Sci, 2005[bib] - V. Blanz, T. Vetter, A. Mehl - A New Approach for Automatic Reconstruction of Occlusal Surfaces with the Biogeneric Tooth ModelIn Int. J. Comp. Dent 8, 2005, pages 13-25[bib] - A. Mehl, V. Blanz, R. Hickel - Was ist der \"Durchschnittszahn\"? - Ein mathematischer Ansatz fuer die automatische Berechnung einer repraesentativen Kauflaeche.In Dtsch. Zahnaerztl. Z, 2005Buchbeiträge[bib] - S. Romdhani, V. Blanz, C. Basso, T. Vetter - Morphable Models of FacesIn Handbook of Face Recognition, Springer New York, 2005, pages 217-245Begutachtete Konferenzbeiträge[bib] - V. Blanz, P. Grother, J. Phillips, T. Vetter - Face Recognition based on Frontal Views generated from Non-Frontal ImagesIn IEEE Conf. on Computer Vision and Pattern Recognition CVPR, 2005[bib] - M. Fuchs, V. Blanz, H.-P. Seidel - Bayesian RelightingIn Eurographics Symp. on Rendering EGSR, 2005[bib] - F. Steinke, B. Schoelkopf, V. Blanz - Support Vector Machines for 3D Shape ProcessingIn Computer Graphics Forum 24(3) Eurographics, 2005[bib] - B. Schoelkopf, F. Steinke, V. Blanz - Object Correspondence as a Machine Learning ProblemIn Int. Conf on Machine Learning ICML, 2005[bib] - A. Yoshida, V. Blanz, K. Myszkowski, H.-P. Seidel - Perceptual Evaluation of Tone Mapping Operators with Real-World ScenesIn IS&T /SPIE Annual Symp. on Electronic Imaging, 2005Technische Berichte[bib] - M. Fuchs, V. Blanz, H. Lensch, H.-P. Seidel - Reflectance from Images: A Model-Based Approach for Human FacesIn Technical Report , Max-Planck Institut Informatik, 2005Verschiedenes[bib] - I. Albrecht, V. Blanz, J. Haber, H.-P. Seidel - Creating Face Models from Vague Mental ImagesIn , 20052004Begutachtete Konferenzbeiträge[bib] - V. Blanz, K. Scherbaum, T. Vetter, H.-P. Seidel - Exchanging Faces in ImagesIn Proc. of EUROGRAPHICS 2004, Grenoble, France, 2004[bib] - B. Weyrauch, J. Huang, B. Heisele and V. Blanz - Component-Based Face recognition with 3D Morphable ModelsIn IEEE Workshop on Face processing in Video, FPIV04, Washington, D.C., 2004[bib] - V. Blanz, A. Mehl, T. Vetter, H.-P. Seidel - A Statistical Method for Robust 3D Surface Reconstruction from Sparse DataIn Int. Symp. on 3D Data Processing, Visualization and Transmission, Thessaloniki, Greece, 20042003Artikel in Zeitschriften[bib] - V. Blanz, T. Vetter - Face Recognition Based on Fitting a 3D Morphable ModelIn IEEE Transactions on Pattern Analysis and Machine Intelligence, 25(9), 2003, pages 1063 - 1074Begutachtete Konferenzbeiträge[bib] - V. Blanz, C. Basso, T. Poggio, T. Vetter - Reanimating Faces in Images and VideoIn Proceedings of EUROGRAPHICS 2003, Granada, Spain, 2003[bib] - J. Huang, B. Heisele, V. Blanz - Component-based Face Recognition with 3D Morphable ModelsIn Proc. of the 4th Int. Conf. on Audio- and Video-Based Biometric Person Auth",
  "content_length": 14610,
  "method": "requests",
  "crawl_time": "2025-12-01 14:44:56"
}