{
  "name": "Volker Heun",
  "homepage": "https://www.bio.ifi.lmu.de/mitarbeiter/volker-heun/index.html",
  "status": "success",
  "content": "Prof. Dr. Volker Heun - Lehr- und Forschungseinheit Bioinformatik - LMU München Suche Hinweise zur Datenübertragung bei der Google™ Suche Login Logout Links und Funktionen www.lmu.de Institut für Informatik Studiengang Bioinformatik Sitemap Navigationspfad Startseite MitarbeiterPeople Volker Heun Hauptnavigation AktuellesNews MitarbeiterPeople Caroline Friedel Armin Hadziahmetovic Volker Heun ForschungsgruppeResearch Group LehreTeaching SkriptenNotes Grundlegende Algorithmen Markus Joppich Samuel Klein Felix Offensperger Katharina Reinisch Evi Sinn Frank Steiner Elena Weiß Ralf Zimmer Alumni StudiumStudies PublikationenPublications ForschungResearch DrittmittelprojekteFunded Projects Software/Services Intern FAQ KontaktContact druckenprint Inhaltsbereich Prof. Dr. Volker Heun E-Mail: Telefon: Phone: +49-89-2180-4341 (E-Mail bevorzugt) (E-Mail preferred) Fax: +49-89-2180-99-4341 Adresse: Address: LFE Bioinformatik Institut für Informatik, Fakultät 16 Ludwig-Maximilians-Universität Amalienstr. 17, 80333 München Bioinformatics Institut für Informatik, Fakultät 16 Ludwig-Maximilians-Universität Amalienstr. 17, 80333 Munich, Germany Raum: Office: A 303 (Vordergebäude 3. Etage) A 303 (Front Building, 3rd floor) Kontaktaufnahme wird per E-Mail empfohlen. Please contact me by e-mail. Akademische Funktionen Academic Positions Mitglied des Fakultätsrates Member of the Faculty Council Studiengangskoordination Bioinformatik Academic Coordination Bioinformatics Fachstudienberatung Bioinformatik Academic Advisory for Bioinformatics Bafög-Beauftragter Bioinformatik Bafög Coordination Bioinformatics ERASMUS-Koordination Bioinformatik ERASMUS Coordination Bioinformatics Sprechstunden Office Hours Allgemeine Sprechstunde: momentan nur nach Vereinbarung General Office Hours: currently by appointment only Fachstudienberatung: momentan nur nach Vereinbbarung Student Advisory: currently by appointment only Die Sprechstunden finden in der Regel per Videokonferenz statt. In general, Office Hours will take place via video conferencing system. Forschung Research siehe Forschung see Research Lehre Teaching WS 2025/26 Algorithmische Bioinformatik II WS 2025/26 Programmierpraktikum Bioinformatik SS 2025 &WS 2025/26 Seminar Problembasiertes Lernen Bioinformatik SS 2025 Algorithmische Bioinformatik I Übersicht der Lehre Teaching Overview Skripten und Bücher Lecture Notes and Books Volker Heun: Algorithmische Bioinformatik I & II. Manuscript (in German) Erste Auflage1st edition: xii+378, 2002; Zweite Auflage2nd edition: xii+457, 2006; Dritte Auflage3rd edition: xii+468, 2009. Vierte Auflage4th edition: xii+498, 2011. Fünfte Auflage5th edition: xiv+504, 2013. Sechste Auflage6th edition: xiv+508, 2015. Siebte Auflage7th edition: xiv+514, 2017. Achte Auflage8th edition: xiv+518, 2020. Neunte Auflage9th edition: xiv+518, 2023. Zehnte Auflage10th edition: xiv+518, 2026. Volker Heun: Algorithmische Bioinformatik: Bäume und Graphen. Manuscript (in German) Erste Auflage1st edition: vi+136, 2003; Zweite Auflage2nd edition: vi+226, 2004; Dritte Auflage3rd edition: vi+233, 2006; Vierte Auflage4th edition: viii+241, 2009. Fünfte Auflage5th edition: viii+243, 2014. Sechste Auflage6th edition: viii+249, 2015. Siebte Auflage7th edition: viii+255, 2020. Achte Auflage8th edition: viii+261, 2023. Neunte Auflage9th edition: viii+261, 2024. Volker Heun: Algorithmen auf Sequenzen. Manuscript (in German) Erste Auflage1st edition: x+272 2005; Zweite Auflage2nd edition: x+294, 2007; Dritte Auflage3rd edition: x+308, 2008. Vierte Auflage4th edition: x+316, 2010. Fünfte Auflage5th edition: x+318, 2014. Sechste Auflage6th edition: x+342, 2016. Siebte Auflage7th edition: x+346, 2018. Achte Auflage8th edition: x+346, 2019. Neunte Auflage9th edition: x+346, 2021. Zehnte Auflage10th edition: x+346, 2024. Elfte Auflage11th edition: x+346, 2025. Volker Heun: Efficient Embeddings of Treelike Graphs into Hypercubes, Reihe Informatik, Shaker-Verlag, Aachen, ISBN 978-3-8265-1901-7, 1996. [Link] Volker Heun: Grundlegende Algorithmen — Einführung in den Entwurf und die Analyse effizienter Algorithmen, Vieweg Verlag, Erste Auflage1st edition: xii+346, ISBN 978-3-528-03140-9, 2000. [Link] Zweite durchgesehene und überarbeitete Auflage:2nd edition xiv+370, ISBN 978-3-528-13140-1, 2003. [Link] Publikationen Publications 2012PapersBenjamin Albrecht, Volker Heun, Space Efficient Modifications to Structator - a Fast Index-Based Search Tool for RNA Sequence-Structure Patterns, Proceedings of the 11th International Symposium on Experimental Algorithms (SEA 2012) (Ralf Klasing, ed.), Springer Verlag, vol. 7276, Bordeaux, France, June 7-9, 2012, pp. 27-38, 2012. DOIBiBTex 2011PapersJohannes Fischer, Volker Heun, Space-Efficient Preprocessing Schemes for Range Minimum Queries on Static Arrays, SIAM Journal on Computing, vol. 40, no. 2, pp. 465-492, 2011. DOIBiBTex 2010PapersJohannes Fischer, Volker Heun, Range Median of Minima Queries, Super-Cartesian Trees, and Text Indexing, Proceedings of the International Workshop on Combinatorial Algorithms (IWOCA’08) (Mirka Miller, Koichi Wada, eds.), College Publications, vol. 12, September 13-15, 2008, Nagoya, Japan, pp. 239-252, 2010. BiBTex Johannes Fischer, Volker Heun, Finding Range Minima in the Middle: Approximations and Applications, Mathematics in Computer Science, vol. 3, no. 1, pp. 17-30, 2010. DOIBiBTex 2009PapersSimon W. Ginzinger, Marko Skocibusic, Volker Heun, CheckShift Improved: Fast Chemical Shift Reference Correction with High Accuracy, Journal of Biomolecular NMR, vol. 44, no. 4, pp. 207-211, 2009. DOIBiBTex 2008PapersJohannes Fischer, Volker Heun, Range Median of Minima Queries, Super-Cartesian Trees, and Text Indexing, Local Proceedings of the 19th International Workshop on Combinatorial Algorithms (IWOCA’08) (Mirka Miller, Koichi Wada, eds.), Nagoya, Japan, September 13-15, 2008, pp. 239-252, 2008. BiBTex Johannes Fischer, Volker Heun, Horst Martin Stühler, Practical Entropy-Bounded Schemes for O(1)-Range Minimum Queries, Proceedings of the 2008 Data Compression Conference (DCC’08) (J.A. Storer, M.W. Marcellin, eds.), IEEE Computer Society, Snowbird, Utah, U.S.A., March 25-27, 2008, pp. 272-281, 2008. DOIBiBTex Volker Heun, Analysis of a Modification of Gusfield’s Recursive Algorithm for Reconstructing Ultrametric Trees, Information Processing Letters, vol. 108, no. 4, pp. 222-225, 2008. DOIBiBTex 2007PapersJohannes Fischer, Volker Heun, A New Succinct Representation of RMQ-Information and Improvements in the Enhanced Suffix Array, Proceedings of the International Symposium on Combinatorics, Algorithms, Probabilistic and Experimental Methodologies (ESCAPE’07) (Bo Chen, Mike Paterson, Guochuan Zhang, eds.), Springer-Verlag, vol. 4614, Hangzhou, China, April 7-9, 2007, pp. 459-470, 2007. DOIBiBTex Simon W. Ginzinger, Thomas Gräupl, Volker Heun, SimShiftDB: Chemical-Shift-Based Homology Modeling, Proceedings of the First International Conference on Bioinformatics Research and Development (BIRD’07) (Sepp Hochreiter, Roland Wagner, eds.), Springer, vol. 4414, Berlin, Germany, March 12-14, pp. 357-370, 2007. DOIBiBTex Simon W. Ginzinger, Volker Heun, SimShiftDB: Chemical-Shift-Based Homology Modeling, 15th Annual International Conference on Intelligent Systems for Molecular Biology (ISMB) and 6th European Conference on Computational Biology (ECCB), Vienna, Austria., 2007. BiBTex Simon W. Ginzinger, Fabian Gerick, Murray Coles, Volker Heun, CheckShift: Automatic Correction of Inconsistent Chemical Shift Referencing, Journal of Biomolecular NMR, vol. 39, no. 3, pp. 223-227, 2007. DOIBiBTex 2006PapersJohannes Fischer, Volker Heun, Theoretical and Practical Improvements on the RMQ-Problem with Applications to LCA and LCE, Proceedings of the 16th Annual Symposium on Combinatorial Pattern Matching (CPM’06) (Moshe Lewenstein, Gabriel Valiente, eds.), Springer-Verlag, vol. 4009, Barcelona, Spain, July 5-7, 2006, pp. 36-48, 2006. DOIBiBTex Johannes Fischer, Volker Heun, Stefan Kramer, Optimal String Mining Under Frequency Constraints, Proceedings of the 10th European Conference on Principles and Practice of Knowledge Discovery in Databases (PKDD’06) (J. Fürnkranz, T. Scheffer, M. Spiliopoulou, eds.), Springer-Verlag, vol. 4213, Berlin, Germany, September 18-22, 2006, pp. 139-150, 2006. DOIBiBTex 2005PapersJohannes Fischer, Volker Heun, Stefan Kramer, Fast Frequent String Mining Using Suffix Arrays, Proceedings of the 5th IEEE International Conference on Data Mining (ICDM’05), IEEE Computer Society, Houston, TX, USA, November 27-30, 2005, pp. 609-612, 2005. DOIBiBTex Johannes Fischer, Volker Heun, Stefan Kramer, Fast Frequent String Mining Using Suffix Arrays, TUM-I0512, Institut für Informatik der Technischen Universität München, no. TUM-I0512, 2005. tum-i0512.pdfBiBTex 2003PapersVolker Heun, Approximate Protein Folding in the HP Side Chain Model on Extended Cubic Lattices, Discrete Applied Mathematics, vol. 127, no. 1, pp. 163-177, 2003. DOIBiBTex Volker Heun, Approximate Protein Folding in the HP Side Chain Model on Extended Cubic Lattices, Computational Molecular Biology (S. Istrail, P. Pevzner, R. Shamir, eds.), North Holland, vol. 12, 2003. LinkBiBTex BooksWerner Mewes, Dmitrij Frishman, Volker Heun, Stefan Kramer, Proceedings of the German Conference on Bioinformatics, GCB 2003 (Neuherberg and Garching, Germany, October 12-14, 2003), belleville Verlag München, 2003. BiBTex Volker Heun, Grundlegende Algorithmen - Einführung in den Entwurf und die Analyse effizienter Algorithmen, Vieweg Verlag, 2003. ErrataBiBTex 2003PapersVolker Heun, Ernst W. Mayr, Efficient Embeddings into Hypercube-Like Topologies, The Computer Journal, vol. 46, no. 6, pp. 632–644, 2003. DOIBiBTex 2002PapersJens Ernst, Volker Heun, Ulrich Voll, Generalized Clustering of Gene Expression Profiles — A Spectral Approach, Proceedings of the International Conference of Bioinformatics (INCOB’02), Bangkok, Thailand, February 06–08, 2002, 2002. BiBTex Volker Heun, Ernst W. May",
  "content_length": 17540,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:01"
}