{
  "name": "Volker Rodehorst",
  "homepage": "https://www.uni-weimar.de/de/medien/professuren/medieninformatik/computer-vision",
  "status": "success",
  "content": "Bauhaus-Universität Weimar: Professur Computer Vision in Engineering Kontakt und Infos Prof. Dr.-Ing. Volker Rodehorst · <a href=\"/de/medien/struktur/fachbereich-medieninformatik/\">Medieninformatik</a> & <a href=\"https://www.uni-weimar.de/de/bauingenieurwesen/\">Bau und Umwelt</a> Die Professur Computer Vision in Engineering beschäftigt sich mit der automatisierten Auswertung von bildbasierten Informationen. Die rasante Entwicklung von flexiblen, leichten und preiswerten Sensoren führt zu immer größer und komplexer werdenden Datenmengen. Eine wichtige Herausforderung ist es, diese Datenflut für unterschiedliche Anwendungsbereiche exakt und effizient auszuwerten. Wir entwickeln Sensor-Plattformen und innovative Computeralgorithmen, um räumliche Objektinformation aus digitalen Bildern abzuleiten. So kann z. B. in dynamischen Videosequenzen die Eigenbewegung der Kamera bestimmt und aus Stereobildern die Oberflächenform von Gegenständen rekonstruiert werden. Für die Objekterkennung und Modellierung der realen Welt kommen schließlich Methoden aus der modellbasierten Bildanalyse zum Einsatz. Computer Vision in Engineering Bauhaus-Universität WeimarFakultäten Medien & Bau und UmweltBauhausstraße 1199423 Weimar Web: www.uni-weimar.de/medien/cvE-Mail: volker.rodehorst[at]uni-weimar.deTelefon: +49 (0) 36 43/58 37 73 AktuellesPersonenLehreGeodäsieForschungPublikationen Barrierefreiheit  Leichte Sprache Informationen über die Bauhaus-Universität Weimar. Kontrast-Einstellungen lesen Sie mehr über diese Einstellung Wechsel zwischen Farb- und Schwarz-Weiß-Ansicht Kontrastansicht aktiv Kontrastansicht nicht aktiv Anschalten Kontrastansicht einschalten Ausschalten Kontrastansicht ausschalten Darkmode für lichtsensitive Augen lesen Sie mehr über diese Einstellung Wechsel der Hintergrundfarbe von Weiß zu Schwarz Darkmode aktiv Darkmode nicht aktiv Ausschalten Darkmode deaktivieren Anschalten aktiviere Darkmode Klick- und Fokus-Feedback lesen Sie mehr über diese Einstellung Fokussierte Elemente werden schwarz hinterlegt und so visuell hervorgehoben. Feedback aktiv Feedback nicht aktiv Ausschalten Feedback ausschalten Anschalten Feedback einschalten Animationen auf der Website lesen Sie mehr über diese Einstellung Beendet Animationen auf der Website Animationen aktiv Animationen nicht aktiv Ausschalten Animationen abschalten Anschalten Animationen anschalten Schließen",
  "content_length": 2389,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:01"
}