{
  "name": "Volker Brendel",
  "homepage": "http://brendelgroup.org",
  "status": "success",
  "content": "Brendel Group, Indiana University Back to Top Skip to main content Skip to top navigation bar Skip to What's New The Group Volker Brendel Post-Doctoral Associates Graduate Students Rotation Students Undergraduate Students Group Meetings Openings Alumni Collaborators The Group Research Teaching Resources Bioinformatics2Go Contact Branch Out! What's New Recent papers: Daniel S Standage, Tim Lai & Volker P Brendel (2022) iLoci: Robust evaluation of genome content and organization for provisional and mature genome assemblies. Nucleic Acids Research Genomics and Bioinformatics 4, Issue 1, March 2022, lqac013, https://doi.org/10.1093/nargab/lqac013 [PubMed ID: 35211671] [online article] [PDF] Morandin, C., Brendel, V.P., Sundström, L.; Helanterä, H. & Mikheyev, A. (2019) Changes in gene DNA methylation and expression networks accompany caste specialization and age-related physiological changes in a social insect methylation. Molecular Ecology, 28, 1975-1993. [PubMed ID: 30809873] [online article] [PDF] The future of computational genomics: Brendel, V.P. (2018) From small RNA discoveries to a new paradigm in computational genomics? New Phytol. 220, 659-660. [PubMed ID: 30324739] [online article] [PDF] Check out our github site! Group: PlantGDB News: The Brendel Group @ Indiana University a Computational Genome Science Laboratory If you want to find out why a bouncy octopus is our group logo, you have come to the right place. In fact, there is a lot of other information on these pages. Please navigate using the menus above and to the left. For up to date descriptions and download options of our computational genomics software you may want to jump over to our github site. For a quick start to using our software with (almost) no installation effort on your part see our SingularityHub. The Brendel Group is an energetic, friendly, and grateful team of faculty, staff, and students enjoying the privilege of working together. Our areas of interest span research topics in genome informatics, in particular as related to plant transcriptional control and pre-mRNA splicing, and computational infrastructure (cyberinfrastructure) for genome studies. You can find out more about our research, software development, and Prof. Brendel's teaching following the links on the top navigation bar. The world bestows its big prizes, both in money and honors, for but one thing. And that is Initiative. What is Initiative? I'll tell you: It is doing the right thing without being told. (Opening lines of \"Initiative\" by Elbert Hubbard) Can you carry a message to Garcia? I have no data yet. It is a capital mistake to theorize before one has data. Insensibly one begins to twist facts to suit theories, instead of theories to suit facts. (Sherlock Holmes, in \"A Scandal in Bohemia\" by Sir Arthur Conan Doyle) [Picture credit: https://www.basilrathbone.net/films/shadventures/] Copyright © 2024 - Brendel Group, Indiana University Bloomington",
  "content_length": 2948,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:00"
}