{
  "name": "Volkan Atalay",
  "homepage": "https://blog.metu.edu.tr/vatalay",
  "status": "success",
  "content": "M. Volkan Atalay | Middle East Technical University, Ankara (1993-2023) Skip to content I served as a professor of Computer Engineering at the Middle East Technical University (METU), Ankara, Turkey.My research interests lie in the areas of – machine learning for bioinformatics, – data stream analysis and clustering, and – machine learning applications. RECENT SELECTED PUBLICATIONS CROssBAR: comprehensive resource of biomedical relations with knowledge graph representations Nucleic Acids Research 49:e96 [article][WebPage][WebService] MDeePred: novel multi-channel protein featurization for deep learning-based binding affinity prediction in drug discovery  Bioinformatics 37:693-704   [article] [GitHub] Data stream clustering: a review  Artificial Intelligence Review 54:1201–1236   [article] iBioProVis: interactive visualization and analysis of compound bioactivity space  Bioinformatics 36:4227–4230   [article] [WebService] DEEPScreen: high performance drug–target interaction prediction with convolutional neural networks using 2-D structural compound representations  Chemical Science 11:2531-2557 [article][GitHub] list of all publicationsGoogle Scholar SOFTWARE MDeePred [GitHub] pairwise input deep neural network regressor for drug-target affinity prediction for virtual screening CROssBAR [WebService] Comprehensive Resource of Biomedical Relations with Deep Learning and Knowledge Graph RepresentationsiBioProVis [WebService] visualization of compounds on 2D space in the context of their cognate targetsDEEPScreen [GitHub] virtual screening with deep convolutional neural networks using compound images DEEPred  [GitHub] automated function predictionECPred  [WebService][GitHub] Enzyme Commission (EC) number prediction Other tools and services PROJECTS CROssBAR    [WebPage]    we developed a comprehensive computational resource by linking various biomedical resources, generating relation predictions using machine/deep learning, and developing information-rich knowledge graphs that incorporate available and predicted biomedical relationships with the aim of providing aid to biomedical researchers to further understand disease mechanisms and to discover/develop new drugs SmartHome ConsortiumA consortium of 18 companies and 5 universities lead by Arcelik/BEKO to develop and implement a platform for smart homes. We are interested in data stream analytics and data stream clustering. We have developed a data stream clustering algorithm using UMAP to detect and adopt concept drifts that are changes in data. More about research CURRENT GRADUATE STUDENTS Alperen Dalkıran, Ph.D. candidate Serkan Özen, Ph.D. candidate Gökhan Özsarı, Ph.D. candidate Ahmet Atakan, Ph.D. candidate Samet Özdilek, M.Sc. candidate Ali İlker Sığırcı, M.Sc. candidate Leyla Helin Çetin, M.Sc. candidate Deniz Germen, M.Sc. candidate Ardan Yılmaz, M.Sc. candidate Alumni EDUCATION Diplôme de Docteur dans la spécialité Informatique (Ph.D. in Computer Science), 1993, Université Paris Descartes (Paris V), Paris, FranceDiplôme d’Etudes Approfondies en Informatique, 1991, Université Paris Descartes (Paris V), Paris, FranceMaster of Science in Electrical and Electronics Engineering, 1990, METU, Ankara, TurkeyBachelor of Science in Electrical and Electronics Engineering, 1987, METU, Ankara, Turkey PROFESSIONAL POSITIONS Professor, METU, Ankara, Turkey, 2005-2023Associate Professor, METU, Ankara, Turkey, 1998-2005Visiting Research Associate Professor, Virginia Bioinformatics Institute, Virginia Tech, VA, USA, Jan. 2004-Jan. 2005Assistant Professor, METU, Ankara, Turkey, 1993-1998Instructor, Université Paris Descartes (Paris V), Paris, France, 1993Visiting Scholar, New Jersey Institute of Technology, NJ, USA, 1991-1992 MAJOR ADMINISTRATIONAL POSITIONS Vice President for research, METU, 2010-2016Chairman of Board, ODTÜ TEKNOKENT (METU Technopolis), 2010-2016Member of University Senate, METU, 2010-2016Assistant to President, METU, 2008-2010Board Member, Informatics Association of Turkey, 2009-2011Department Chairperson, METU Dep. of Computer Eng., 2007-2008 TEACHING CEng 310 Algorithms and Data Structures with Python CEng 232 Logic Design CEng 301 Algorithms and Data Structures CEng 336 Introduction to Embedded Systems Development CEng 574 Statistical Data Analysis CONSULTANCY Member, International Technical Advisory Board of Arcelik (Research and Development Directorate), 2011-2022 Member, Board of Directors of Izmir Biomedicine and Genome Institute (iBG-izmir), 2018-2020 Member, Technology Advisory Board of Turkish Aerospace Industries (TAI), 2011-2018 CONTACT vatalay AT metu.edu.tr Insert/edit link Close Enter the destination URL URL Link Text Open link in a new tab Or link to existing content Search No search term specified. Showing recent items. Search or use up and down arrow keys to select an item. Cancel",
  "content_length": 4843,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:01"
}