{
  "name": "Volodya Vovk",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/vladimir-vovk_74ed8b21-d9d7-4ab6-8dbf-6f177b91b945.html",
  "status": "success",
  "content": "Vladimir Vovk - Royal Holloway Research Portal View Scopus Profile Vladimir Vovk Professor Professor, Department of Computer ScienceCentre for Machine LearningCentre for Intelligent SystemsCentre for Reliable Machine LearningCentre for Robust Inference in a Digital Economy (RIDE) Phone+44 1784 443426EmailV.Vovkrhul.acuk TW20 0EX Personal profile Research interestsSee http://vovk.net Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 96 Article 76 Working paper 75 Chapter (peer-reviewed) 16 Conference contribution 35 More 11 Chapter 7 Editorial 4 Book 4 Abstract 3 Other 1 Foreword/postscript 1 Comment/debate 1 Software 1 Other contribution 1 Patent 1 Doctoral Thesis Research output per year Research output per year Probability and Finance: It's Only a Game!Shafer, G. & Vovk, V., 2001, New York: Wiley-Interscience.Research output: Book/Report › Book Algorithmic Learning in a Random WorldVovk, V., Gammerman, A. & Shafer, G., 2005, Springer.Research output: Book/Report › Book On-line predictive linear regressionVovk, V., Nouretdinov, I. & Gammerman, A., Jun 2009, In: The Annals of Statistics. 37, 3, p. 1566-1590 25 p.Research output: Contribution to journal › Article › peer-review Prediction With Expert Advice For The Brier GameVovk, V. & Zhdanov, F., Nov 2009, In: Journal of Machine Learning Research. 10, p. 2445-2471 27 p.Research output: Contribution to journal › Article › peer-review A tutorial on conformal predictionShafer, G. & Vovk, V., Mar 2008, In: Journal of Machine Learning Research. 9, p. 371-421 51 p.Research output: Contribution to journal › Article › peer-review View all 298 research outputs Projects 9 Finished Projects per year Conformal Martingales for Change-Point DetectionGammerman, A. (PI) & Vovk, V. (CoI)Amazon1/06/20 → 31/05/21Project: Research Machine Learning for Chemical SynthesisGammerman, A. (PI), Toccaceli, P. (Researcher), Vovk, V. (CoI) & Luo, Z. (CoI)AstraZeneca1/05/17 → 30/06/18Project: Research Semantic Completions: Unifying the Wave and the Particle Views of InformationFiadeiro, J. L. (PI), Vovk, V. (CoI) & Pavlovic, D. (CoI)Air Force Office of Scientific Research1/01/16 → 31/12/16Project: Research Exascale Compound Activity Prediction EngineGammerman, A. (PI), Vovk, V. (CoI) & Luo, Z. (CoI)European Union1/09/15 → 31/08/18Project: Research Semantic Completions: Unifying the wave and the Particle Views of InformationPavlovic, D. (PI), Fiadeiro, J. L. (CoI) & Vovk, V. (CoI)1/04/14 → 31/03/17Project: Research View all 9 projects",
  "content_length": 3092,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:05"
}