{
  "name": "Vítek Jelínek",
  "homepage": "https://iuuk.mff.cuni.cz/~jelinek",
  "status": "success",
  "content": "Vít Jelínek Doc. RNDr. Vít Jelínek Ph.D. Contact Computer Science Institute Charles University Malostranské náměstí 25 Prague 1, 118 00 Czech Republic My publications e-mail: jelinek < at > iuuk.mff.cuni.cz Výuka (teaching) Vypsal jsem několik témat ročníkových projektů. Témata jsou spíše teoreticky zaměřena a jsou vhodná i pro případnou bakalářskou práci. Zimní semestr 2025/26 Combinatorics and Graphs 3 (lecture + tutorial, Monday 9:00 in S5, Thursday 12:20 in S11). More information is available in Moodle. Seminář Matematické dovednosti (pondělí 15:40 v N7, čtvrtek 9:00 v N4). Bližší informace jsou k dispozici v Moodle. Letní semestr 2024/25 Přednáška Matematická analýza I (čtvrtek od 14:00 v N1). Informace a materiály k přednášce i cvičením budou průběžně zveřejňovány v systému Moodle. Analytic combinatorics (lecture + tutorial session): the first lecture will take place on Monday, February 17, at 9:00 in S10. The tutorials will be scheduled at the lecture. More information will be available in Moodle. Problémový seminář (spolu s Pavlem Valtrem). Místo a čas budou dohodnuty e-mailem. Zimní semestr 2024/25 Přednáška Kombinatorika a grafy I (čtvrtek od 14:00 v N1) a několik cvičení k ní (středa 15:40 v S6, čtvrtek 10:40 v S10, pátek 9:00 v N4). Informace a materiály k přednášce i cvičením budou průběžně zveřejňovány v systému Moodle. Letní semestr 2023/24 Přednáška Matematická analýza 1 (pondělí 10:40 v N1) Informace a materiály k přednášce budou průběžně zveřejňovány v systému Moodle. Přednáška Geometrické reprezentace grafů 2 (čtvrtek 10:40 v S7) Informace a materiály k přednášce budou průběžně zveřejňovány v systému Moodle. Zimní semestr 2023/24 Přednáška Kombinatorika a grafy I (středa 15:40 v N1) a několik cvičení k ní (pondělí 12:20 v S6, pondělí 14:00 v S10, pátek 12:20 v S6). Informace a materiály k přednášce i cvičením budou průběžně zveřejňovány v systému Moodle. Letní semestr 2022/23 Combinatorics and Graphs 2 (lecture + tutorial, Wednesday 14:00 - 15:30 S9, 15:40-17:10 S9). More information is available in Moodle. Analytic combinatorics (lecture + tutorial session): the first lecture will take place on Friday March 17, at 15:40 in S6. The tutorials will be scheduled at the lecture. More information will be available in Moodle. Zimní semestr 2022/23 Přednáška Diskrétní matematika (úterý 9:00 v M1) a tři cvičení k ní (středa 10:40 v N6, středa 12:20 v N6 a čtvrtek 17:20 v N5). Informace a materiály k přednášce i cvičením budou postupně zveřejňovány v systému Moodle. Letní semestr 2021/22 Přednáška Kombinatorika a grafy II (úterý 12:20 v S5) a cvičení k ní (úterý 10:40 v S4), viz stránka předmětu v systému Moodle. Přednáška Geometrické reprezentace grafů II. Přednáška se koná ve středu od 15:40 v místnosti S5. První přednáska bude 23. února. I tento předmět má svou stránku v Moodle. Zimní semestr 2021/22 Přednáška Kombinatorika a grafy III (NDMI073) a cvičení k ní. Termín bude určen na hromadné úmluvě KAM+IÚUK. Informace a materiály k přednášce i cvičení budou průběžně zveřejňovány v systému Moodle. Cvičení k předmětu Lineární algebra I (NMAI057), ve čtvrtek od 17:20 v posluchárně N2. Materiály ke cvičení budou přístupné v Moodle. Letní semestr 2020/21 Přednáška Matematická analýza I: bližší informace najdete na příslušné stránce Moodle. Analytic combinatorics (lecture + tutorial session): the first lecture will take place on Wednesday March 10, at 15:40. We will meet over Zoom (I'll send the details by email). The form of the tutorials will be decided at the first lecture. More info can be found on the course's Moodle page. Zimní semestr 2020/21 Přednáška Diskrétní matematika (pátek 12:20) a tři cvičení k ní (útery 15:40, středa 12:20 a středa 14:00). Informace a materiály k přednášce i cvičením budou postupně zveřejňovány v systému Moodle. Seminář Matematické dovednosti (pondělí 14:00). Seminář bude probíhat přes Zoom. Bližší informace jsou k dispozici v Moodle. Letní semestr 2019/20 Přednáška Matematická analýza 1 (úterý 10:40 v S9) Přednáška Geometrické reprezentace grafů II Zimní semestr 2019/20 Přednáška Kombinatorika a grafy II (středa 15:40 v S3) a dvě cvičení k ní (pondělí 9:00 v S1 a pátek 9:00 v T9) Přednáška Geometrické reprezentace grafů I (spolu s J. Kratochvílem, v úterý 14:00 v S11) Letní semestr 2018/19 Přednáška Kombinatorika a grafy I (středa 12:20 v S5) a jedno cvičení k ní (úterý 14:00 v S10) Přednáška Analytic combinatorics a cvičení k ní Zimní semestr 2018/19 The lecture Combinatorics and Graph Theory II (in English) Cvičení z Diskrétní matematiky (středa 12:20 v M5) Letní semestr 2017/18 Přednáška Kombinatorika a grafy I v úterý od 10:40 v S3 Cvičení k přednášce Kombinatorika a grafy I ve středu od 14:00 v S10 Přednáška Geometrické reprezentace grafů II ve čtvrtek od 15:40 v S6 Zimní semestr 2017/18 The lecture Combinatorics and Graph Theory II (in English) Dvě cvičení k přednášce Kombinatorika a grafy II (úterý 10:40 v S5 a středa 12:20 v S6) Dva semináře z matematických dovedností (úterý 14:00 v T7 a úterý 15:40 v T9) Letní semestr 2016/17 Přednáška Analytická kombinatorika a cvičení k ní (termín bude dohodnut na úmluvě KAM+IÚ UK) Dvě cvičení z Lineární algebry II (pondělí 14:00 v T6 a pondělí 15:40 v T10) Zimní semestr 2016/17 Přednáška Kombinatorika a grafy II (pondělí 12:20 v S4) a dvě cvičení k ní (pondělí 15:40 v S10 a úterý 12:20 v S5) Cvičení z Diskrétní matematiky (čtvrtek 12:20 v M6) Letní semestr 2015/16 Přednáška Kombinatorika a grafy I  (středa 12:20 v S9) a dvě cvičení k ní (úterý 15:40 v S10 a pátek 10:40 v S11) Přednáška Geometrické reprezentace grafů I (spolu s J. Kratochvílem). Co se zatím předneslo. Zimní semestr 2015/16 Přednáška Kombinatorika a grafy II (pátek 12:20 v S9) a dvě cvičení k ní (středa 12:20 v S6 a pátek 10:40 v S9) Letní semestr 2014/15 Přednáška Analytická kombinatorika (místo a čas bude umluveno, v případě zájmu mi pošlete mail) Přednáška Kombinatorika a grafy I (pátek 9:00 v S3) a dvě cvičení k ní (úterý 12:20 v S10 a úterý 14:00 v S10) Zimní semestr 2014/15: Přednáška Kombinatorika a grafy II (středa 10:40 v S3) a dvě cvičení k ní (úterý 12:20 v S6 a středa 12:20 v S6) Letní semestr 2013/14: Cvičení z kombinatoriky a grafů I (ve středu 14:00 v S7, ve čtvrtek 12:20 v S11 a ve čtvrtek 17:20 v S10) Přednáška Geometrické reprezentace grafů II (čtvrtek 9:00 v S1) Zimní semestr 2013/14: Přednáška Kombinatorika a grafy II (úterý od 14:00 v S3) a dvě cvičení k ní (úterý 12:20 v S6 a středa 17:20 v S11) Přednáška Diskrétní matematika (středa 14:00 v S5) Přednáška Geometrické reprezentace grafů I (čtvrtek 9:00 v S1, spolu s J. Kratochvílem) Letní semestr 2012/13: Přednáška Kombinatorika a grafy I (v úterý od 9:00 v S5, spolu s O. Pangrácem), a cvičení k ní (úterý 10:40 v S7, středa 14:00 v S10, čtvrtek 14:00 v S6) Zimní semestr 2012/13: Matematické dovednosti (v úterý od 14:00 v S1 a ve čtvrtek od 15:40 v S10) Kombinatorika a grafy II (v pátek od 10:40 v S3) Analytická kombinatorika (ve čtvrtek od 12:20 na chodbě KAM ve třetím patře, nedomluvíme-li se na první přednášce jinak) Letní semestr 2011/12: Matematická analýza II (pondělí 12:20 v T6) Teorie grafů a algoritmy pro matematiky (cvičení v pondělí od 17:20 v K9 a v pátek od 9:00 v K12) Zimní semestr 2011/12: Matematické dovednosti (pondělí 15:40 v S6) Matematické dovednosti (středa 17:20 v S7) Matematická analýza III Starší výuka: Přednáška o analytické kombinatorice (léto 2008/09) Cvičení k přednášce \"Lineární algebra II\" (léto 2008/09) Matematické dovednosti (zima 2008/09) Cvičení z kombinatoriky a grafů 2 (léto 2007/08) Cvičení z kombinatoriky a grafů 1 (léto 2006/07) Cvičení z diskrétní matematiky (zima 2005/06)",
  "content_length": 7676,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:09"
}