{
  "name": "W. Eric Wong",
  "homepage": "http://www.utdallas.edu/~ewong",
  "status": "success",
  "content": "W. Eric Wong Home Page Home Research Funding Publication Activity Teaching Awards Special Links NSF I/UCRC NSF REU NSF TUES IEEE QRS RS Tutorial W. Eric Wong received his M.S. and Ph.D. in Computer Science from Purdue University, West Lafayette, Indiana, USA. He is a Full Professor, the Director of International Outreach, and the Founding Director of Advanced Research Center for Software Testing and Quality Assurance in Computer Science at the University of Texas at Dallas (UTD). He also has an appointment as a guest researcher at the National Institute of Standards and Technology, an agency of the U.S. Department of Commerce. Prior to joining UTD, he was with Telcordia Technologies (formerly Bellcore) as a senior research scientist and the project manager in charge of Dependable Telecom Software Development. Professor Wong is the Editor-in-Chief of IEEE Transactions on Reliability (TRel aka TR). The journal was first launched in 1955 as IRE Transactions on Reliability and Quality Control, and was renamed to its current title in 1962. TRel is the flagship journal of the IEEE Reliability Society and is considered to be one of the most prestigious journals in the area of reliability. Refer to the news announcement at [UTD CS Website] & [IEEE RS Website] He has served as special issue guest editor for IEEE TRel, JSS, SPE, IST, SQJ, IJSEKE, etc. Professor Wong's research focuses on helping practitioners improve software quality while reducing production cost. In particular, he is working on software testing, debugging, risk analysis/metrics, safety, and reliability. He has very strong experience developing real-life industry applications from his research results. Professor Wong has received research funding from such organizations as NSF, NASA, NIST, Avaya, IBM, Texas Instruments, Raytheon, Lockheed Martin Aeronautics, HP, NEC (Japan), and Hyundai Motor Company among others. Professor Wong has published more than 180 papers and co-edited two books: Mutation Testing for the New Century and Adaptive Control approach for Software Quality Improvement. He is currently working on the third book Handbook of Software Fault Localization: Foundations and Advances, which is going to be published by IEEE-Wiley Press in December 2016. Professor Wong is the recipient of the 2014 IEEE Reliability Society Engineer of the Year, one of the most prestigious awards by the society. This award recognizes his contributions in software testing and quality assurance. He is also a recipient of the Quality Assurance Special Achievement Award from Johnson Space Center, NASA (1997) and two Best Paper Awards from COMPSAC (2007) and ACM SAC (2011). In the fall of 2014, as the Founding Director, Professor Wong and his colleagues established an Advanced Research Center for Software Testing and Quality Assurance (STQA). The primary objective is to conduct research and develop advanced cutting-edge technologies, with user-friendly tool support, for technology transfer. The major focus is on closing the gap between the state-of-art research conducted in an academic setting and the state-of-practice techniques used in the field, and making the center a leading research facility on software testing and quality assurance in the north Texas area. Professor Wong is also the Founding Steering Committee Chair of the IEEE International Conference on Software Security and Reliability (SERE) and the IEEE International Workshop on Program Debugging (IWPD) In 2015, the SERE conference and the International Conference on Quality Software (QSIC) merged into one large conference, QRS, with Q representing Quality, R for Reliability, and S for Security. Professor Wong continues to be the Steering Committee Chair of this new conference. Professor Wong has served on the IEEE Reliability Society's Administrative Committee since 2008 and Executive Committee since 2012, as well as the Vice President for Technical Activities (2012-2013), Secretary (2014), and Vice President for Publications (2015). NSF REU (Research Experiences for Undergraduates on Software Safety) NSF TUES (Incorporating Software Testing into Undergraduate Curriculum) IEEE Tutorial on Systems and Software Reliability IEEE International Conference on Software Quality, Reliability and Security (QRS) About My Research Reducing the cost of software production and improving software dependability, reliability, safety, and quality at the same time. Research interests can be divided into the following two major areas Program-Based Testing, Debugging, Reliability, Safety, and Analysis Architecture/Design-Based Testing, Debugging, Metrics, and Analysis Developing real-life industry applications from academic research results Professor Eric Wong's Research Funding since 2002 NSF Texas Instruments NASA Avaya Research Labs NIST IBM HP Raytheon NEC, Japan Hyundai Motor Company ETRI, Korea ITRC, Korea QUEST Macao High Tech Foundation Ongoing Projects NIST: (National Institute of Standards and Technology), Combinatorial Decision Coverage: Metrics, Algorithms, and Case Studies PI: W. Eric Wong, 07/15/2015-07/14/2016 NIST: (National Institute of Standards and Technology), A Framework for Effective Software Testing using Combinatorial Design and MC/DC Coverage PI: W. Eric Wong, 09/01/2014-06/30/2016 NEC, Japan: A Cost-Effective Approach using Genetic Algorithm to Test a Family of Products, PI: W. Eric Wong, 05/10/2015-03/31/2016 NSF REU: Software Safety: Research, Practice and a Path Forward, PI: W. Eric Wong, co-PI: S. Kim, 03/01/2015-02/28/2018 (Click here to visit our REU website) Completed Projects NSF REU: Software Safety: Methodology, Practice and Research, PI: W. Eric Wong, co-PI: S. Kim, 03/01/2012-02/28/2015 NSF REU: Verification and Validation for Software Safety, PI: W. Eric Wong, co-PI: W. Wu, 04/01/2009-03/31/2012 NEC, Japan: Developing an Automated and Cost-Effective Framework using Asset-Based Testing for High Quality Software Assurance, PI: W. Eric Wong, 07/16/2014-03/31/2015 Hyundai Motor Company: Using Functional Requirements and Risk Analysis to Improve Software Testing, PI: W. Eric Wong, 04/01/2012-03/31/2013 NSF CORBI: Risk Analysis for Real-Time Embedded Software, PI: W. Eric Wong, 08/01/2011-02/28/2013 NSF TUES/CCLI: Incorporating Software Testing into Multiple Computer Science and Software Engineering Undergraduate Courses, PI: W. Eric Wong, co-PI: G. Gupta, S. Kim, and L. Khan, 09/01/2010-08/31/2013 (Click here to visit our CCLI website) NSF I/UCRC (HP): Foundational Requirements for Competency in Software Safety, PI: W. Eric Wong, 05/01/2009-01/31/2012 NSF I/UCRC (Raytheon): Risk Analysis-Based Fault-Proneness Identification for Multi-Threaded Embedded Software, PI: W. Eric Wong 06/01/2011-05/31/2012 NSF TF-SING: Reliable Spatial-Temporal Coverage with Minimum Cost in Wireless Sensor Network Deployments, PI: W. Wu, co-PI: W. Eric Wong, 09/01/2008-08/31/2011 NSF SGER: Optimization Problems in Next Generation Networks, Co-PI: W. Eric Wong, PI: W. Wu, 09/15/2007-08/31/2008 A Testing Framework for Reproducible Execution and Race Condition Detection in Real-Time Embedded Systems, co-PI: W. Eric Wong, PI: Y. H. Lee (Arizona State University), NASA, 01/01/2005-12/31/2007 Testing for Software Safety PI: W. Eric Wong, Co-PI: Y. H. Lee (Arizona State University) and Dianxiang Xu (North Dakota State University), NASA, 01/01/2007-12/31/2007 Timing and Race Condition Verification of Real-Time Systems, co-PI W. Eric Wong, PI: Y. H. Lee (Arizona State University), co-PI: G. Gannod(Arizona State University) and K. Chatha(Arizona State University), NASA, 01/01/2003-12/31/2003 Software Analysis to aid in Probabilistic Risk Assessment, PI: W. Eric Wong, Johnson Space Center, NASA, 08/01/2003-07/31/2004 Engineering Education Process Improvement Research, PI: W. Eric Wong, co-PI: D. Simmons, IBM, 01/01/2007-12/31/2007 A Framework for Measuring and Improving Code Coverage for Embedded Software, PI: W. Eric Wong, Texas Instruments, 10/01/2004-08/31/2005 Improving System Quality by Effective Analysis of Defects, PI: W. Eric Wong, Texas Instruments, 10/01/2004-08/31/2005 Visual-Aid Novel Testing for Software Applications in C, C++, and Java, PI: W. Eric Wong, Avaya Research Labs, (formerly part of Lucent Bell Labs) 06/01/2004-05/31/2006 Service Oriented Architecture for Converged Communication, PI: W. Eric Wong, Avaya Research Labs, (formerly part of Lucent Bell Labs), 09/10/2004-10/31/2005 Service Broker Architecture for SIP-based Multimodal Applications, PI: W. Eric Wong, Avaya Research Labs , (formerly part of Lucent Bell Labs), 10/01/2002-06/30/2003 Effective Coverage Testing: A Software Cybernetics Perspective, PI: W. Eric Wong, Long Capital International, 07/17/2006-08/31/2008 Orthogonal Defect Classification for Analyzing Software Defects, PI: W. Eric Wong, QUEST (Quality Excellence for Suppliers of Telecommunications Forum), 07/01/2004-12/31/2004 Software Product Line Architecture: A Formal Evaluation Model, PI: W. Eric Wong, Electronics and Telecommunications Research Institute (ETRI), The Academic Equipment Grant Program, PI: W. Eric Wong, Sun Microsystems, A Framework for Quantitative Evaluation of Software Verification and Validation Processes, PI: Byoungju Choi (Ewha Woman's University, Seoul, Korea), W. Eric Wong (Project Advisor/Collaboration Partner), Information Technology Research Center (ITRC) sponsored by the Korean Government, 09/01/2002-12/31/2008 A Framework for Optimizing Software Metrics Models Constructed Using Maximum Likelihood Methods, PI: Victor K.Y. Chan (Macao Polytechnic Institute), W. Eric Wong (Project Advisor/Collaboration Partner), Macao High Tech Foundation, 07/01/2005-06/30/2008 Professor Eric Wong's Selected Publications after 2002 Journal Conference Edited Books Book Chapters Technical Report For an updated list of conference publications, please contact Professor Eric Wong. Journal Publications MSeer - An Advanced Technique for Locating Multiple Bugs in Parallel, Ruizhi Gao an",
  "content_length": 54909,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:11"
}