{
  "name": "W. Keith Edwards",
  "homepage": "http://www.cc.gatech.edu/~keith",
  "status": "success",
  "content": "W. Keith Edwards W. Keith Edwards Welcome! I'm a Professor of Interactive Computing at the Georgia Tech College of Computing. My research interests focus on rethinking various aspects of computing infrastructure to enable new types of experiences and, conversely, understanding how current computing infrastructures too often “show through” in the user experience. I'm exploring this theme through a number of projects, which currently include investigating the social impacts of computing (including new technological systems to empower nonprofits and the urban homeless), looking at computer networking through a human-centered lens to understand how to create networking infrastructures that better support domestic use, and exploring more usable and useful approaches to computer security. Most recently, I have begun to explore the role that technology can play in building stronger communities and increasing civic engagement. Broadly, I work at the intersection of Human-Computer Interaction and systems and networking technologies, but consider myself primarily an HCI person. I direct the Pixi Lab, and am fortunate to work with some amazing students. My current Ph.D students are: Yuxi Wu (co-advised with Sauvik Das) Clayton Feustel (co-advised with Beth Mynatt and Craig Zimring) Former graduate students, postdocs, and visiting researchers: Fereshteh Shahmiri (CS Ph.D. 2022, co-advised with Omer Inan), now research scientist at Apple Arielle Schlesinger Gabriel Reyes (CS Ph.D. 2012), now research scientist at Apple Christina Masden Jennifer Stoll (HCC Ph.D., 2012), now research scientist at Oak Ridge National Labs Craig Tashman (CS Ph.D., 2012), now entrepreneur and founder of LiquidText Chris Le Dantec (HCC Ph.D. 2011), now Assistant Professor at Georgia Tech, School of Literature, Communications and Culture Erika S. Poole (HCC Ph.D. 2010), now Assistant Professor at Penn State University Jeonghwa Yang (CS Ph.D. 2009), now Senior UX Manager at LG Advanced Research Institute Marshini Chetty (former postdoc, now Assistant Professor, University of Maryland) Young-Sung Son (former visiting researcher, ETRI) Derek Reilly (former postdoc, now Assistant Professor, Computer Science, Dalhousie) Tony Tang (former postdoc, now Assistant Professor, Computer Science, University of Calgary) Past Lives Before joining Georgia Tech I was a Principal Scientist at the Palo Alto Research Center (PARC) Computer Science Lab, and managed the Ubiquitous Computing group there. I spent about nine years at PARC in total. My old page there may still be up as well. Going further back, I've worked at Sun Microsystems Labs, SunSoft, and the now-defunct Olivetti Research Center (all on internships), and a bunch of places (including NeXT Computer, Lockheed, BellSouth, SecureWare, and others) as a consultant. I got doctorized at Georgia Tech in the venerable discipline of computer science, where my Ph.D. work was on Intermezzo, a toolkit for building context-aware collaborative applications (I worked on a ton of other stuff during that period too; check out my research page for more details). I did Ph.D. and undergrad specializations in experimental psychology, and also did a fair amount of microcontroller-based design work in the EE department, although the latter seems to have been largely repressed. I also occasionally taught classes on VAX assembler, played on the university lacrosse team, learned to cook, never learned to play the banjo, and was a DJ at WREK, the greatest radio station on Planet Earth. Book Stuff I'm the author of Core Jini and co-author of Jini Example by Example from the Sun Microsystems Press Java Series. If you’ve got either of the books, or are just Jini-curious, please visit Jini Planet, which has updates and bug fixes for the book, a more detailed overview, tips on troubleshooting Jini apps, pointers to downloadable code, and a few articles. All Work and No Play... I like to cook a lot. Especially if it involves potential loss of life and limb, or obscene amounts of oil. I'm a typography and typesetting geek, and while I was in San Francisco did a fair bit of letterpress (handset cold metal type) printing, using the resources at the excellent San Francisco Center for the Book, including their Vandercook presses and great metal type library. Since moving to Atlanta I'm in the market for my own press (probably a tabletop platten press, since a Vandercook would likely require a new foundation for my house). Let me know if you have any leads... Raccoons are my favorite animal. Giant squids are are a close second though. I like to read a lot. Some favorites include The Sot-Weed Factor (John Barth), A Confederacy of Dunces (John Kennedy O'Toole), Pale Fire (Vladimir Nabokov), Towing Jehovah (James Morrow), Possession (A.S. Byatt), Love in the Time of Cholera (Gabriel Garcia Marquez), and Galapagos (Kurt Vonnegut). The world is blessed that I have so little musical talent that I generally never touch a musical instrument. Nevertheless, I listen to a lot of stuff. My current top-shelf musical selections are the Complete Recordings of Robert Johnson, the Crumb soundtrack, Information (by Toenut, a great Atlanta band), Puta’s Fever (Mano Negra, a great French band with a Spanish name), Rollin’ (Rebirth Brass Band), Bachelor No. 2 (Aimee Mann), Bone Machine (Tom Waits), Stratosphere Boogie (Speedy West and Jimmy Bryant: great early speed-death-country), Whip-Smart (Liz Phair), and just about any damned thing ever recorded by James Brown, the Pixies, Patsy Cline, or Etta James. Contact Info: W. Keith Edwards keith at cc dot gatech dot edu GVU Center - Technology Square Research Building 85 Fifth Street NW Atlanta, GA  30332-0760 (please use ZIP 30308 for FedEx and other direct deliveries) tel: 404.385.6783 fax: 404.894.3146",
  "content_length": 5808,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:13"
}