{
  "name": "Wagner M. Nunan Zola",
  "homepage": "https://www.inf.ufpr.br/wagner",
  "status": "success",
  "content": "Wagner Zola's Home Page . Wagner M. Nunan Zola Doutor, Universidade Federal do Paraná, Brasil Áreas de interesse: Computação em GPUs, Computação Paralela, Sistemas Operacionais, Computação de Alto Desempenho, Aplicações Paralelas e Distribuídas em Inteligência Artificial e Cyber Security Endereço: Departamento de Informática Universidade Federal do Paraná Tel: +55 (41) 3361-3031 (DInf/UFPR) e-mail: Orientações: [clique aqui] Disciplinas: Pós-graduação/PPGINF Info7057 - Tópicos em Arquiteturas Paralelas - Computação Paralela com GPUs: 2025 Segundo Semestre Info7057 - Tópicos em Arquiteturas Paralelas - Computação Paralela com GPUs: 2021 Período especial (Set-Dez) Info7072b - Tópicos Especiais III - Computação Paralela com GPUs: 2020 Período especial 2 Info7072 - Tópicos Especiais III - (Computação Paralela com GPUs): 2019/2 Info7044 - Processamento Paralelo (Computação Paralela com GPUs): 2018/2 CI853 - Tópicos Especiais III (Computação Paralela com GPUs): (2016/2) Graduação/BCC ci1009 - Computação Paralela com GPUs: 2021 Período especial Set-Dez (2020/PE2 2019/2) CI318 - Tópicos em Computação Paralela (Computação Paralela com GPUs): 2021 Período especial Set-Dez (2020/PE2 2019/2 2018/2 2016/2) Tópicos em Sistemas Distribuídos (ci088): (Computação Paralela): 2007/1 Programação Paralela (ci086): (2004/2 2002/1) Protocolos de Redes e Aplicações em Multimídia (ci097) : (2003/1 2002/2) Sistemas Operacionais: 2019/1 ( 2018/1 2017/1 2016/1 2015/2 2015/1 2014/2 2013/2 2013/1 2012/2 2011/2 2010/2 2009/2 2008/2 2006/2 2006/1 2005/2 2005/1 2002/1 ) Arquitetura de Computadores: 2005/1 Teoria da Computação: 2015/2 ( 2014/1 2012/1 2011/1 2010/1 2009/1 2008/1 2007/1 2006/2 2006/1 2005/2 2004/1 ) Programação de Computadores (CI208 e CI180): 2019/1 ( 2017/1 2012/1 2011/2 2011/1 2010/1 2009/2 2009/1 2008/2 2008/1 2007/2 2007/1 ) \"Research is what I'm doing when I don't know what I'm doing.\" -- Wernher von Braun _________________________________ Wagner M. N. Zola ( )",
  "content_length": 2045,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:15"
}