{
  "name": "Wai-Kei Mak",
  "homepage": "http://www.cs.nthu.edu.tw/~wkmak",
  "status": "success",
  "content": "Homepage of Wai-Kei Mak I will say of the Lord, \"He is my refuge and my fortress, my God, in whom I trust.\" Psalm 91:2 麥偉基 Wai-Kei Mak Professor Department of Computer Science National Tsing Hua University 101 Kuan Fu Rd. Sec. 2 Hsinchu Taiwan 300 R.O.C. wkmak[at]cs.nthu.edu.tw Teaching Graduate Courses VLSI Design for Manufacturability FPGA Architecture and CAD Undergradate Courses Discrete Mathematics Logic Design Introduction to Computer-Aided Design of Integrated Circuits Computer Architecture Hardware Lab Research My research interests are in computer-aided design of VLSI circuits and systems, and combinatorial optimization. Students interested in joining my lab may check the Link to My Research Lab Awards & Honors 優等: 2023國際積體電路電腦輔助設計(CAD)軟體製作競賽 定題組 Best Paper Award Nomination: 2018 ACM International Symposium on Physical Design (ISPD) for the paper “Pin Assignment Optimization for Multi-FPGA Systems”. Best Paper Award Nomination: 2017 ACM International Symposium on Physical Design (ISPD) for the paper “Pin Accessibility-Driven Detailed Placement Refinement”. Best Paper Award Recipient: 2014 IEEE/ACM Asia and South Pacific Design Automation Conference (ASP-DAC) for the paper “Flexible Packed Stencil Design with Multiple Shaping Apertures for E-Beam Lithography”. Best Paper Award nomination: 2010 ACM International Symposium on Physical Design (ISPD) for the paper “FOARS: FLUTE Based Obstacle-Avoiding Rectilinear Steiner Tree Construction”. Best Paper Award nomination: 2010 ACM International Symposium on Physical Design (ISPD) for the paper “SafeChoice: A Novel Clustering Algorithm for Wirelength-Driven Placement”. Best Paper Award nomination: 2003 IEEE Asia and South Pacific Design Automation Conference for the paper “Efficient LUT-Based FPGA Technology Mapping for Power Minimization”. 2nd Place: TAU 2013 Variation Aware Timing Analysis Contest 3rd Place: IEEE CEDA 2011 PATMOS Timing Analysis Contest 1st Place: 2008 International Conference on Field Programmable Technology Design Contest 特優: 教育部99學年度大學校院積體電路電腦輔助設計軟體製作競賽定題組 優等: 教育部98學年度大學校院積體電路電腦輔助設計軟體製作競賽馬拉松組 佳作: 教育部93學年度大學校院積體電路設計競賽FPGA組 佳作: 教育部92學年度大學校院積體電路電腦輔助設計軟體製作競賽定題組 國立清華大學2006年新進人員研究獎 國立清華大學電機資訊學院94學年度新進人員研究獎 Invited Presentation: Invited session on graph theory and its application in VLSI CAD at the 50th IEEE International Symposium on Circuits and Systems, 1999. Selection by the Argonne National Laboratory of the U.S. Department of Energy for inclusion in its NEOS Server, 2000, for research work on stochastic linear optimization. Professional Services Guest Editor: Journal of VLSI Signal Processing Systems General Chair: 2008 International Conference on Field-Programmable Technology TPC Chair: 2006 International Conference on Field-Programmable Technology TPC Vice-Chair: 2022 IEEE Asia South Pacific Design Automation Conference Publication Chair: 2010 IEEE Asia South Pacific Design Automation Conference; 2006 VLSI Design/CAD Symposium, Taiwan R.O.C. TPC Members: International Conference on Computer Aided Design (2020-2024), Design Automation Conference (2019), IEEE Asia South Pacific Design Automation Conference (2005, 2008-2009, 2011, 2016-2017), International Conference on Field Programmable Logic and Applications (2007-present), International Conference on Field-Programmable Technology (2006-2011) Steering Committee:  International Conference on Field-Programmable Technology (2009-present) Session Chair: IEEE Asia South Pacific Design Automation Conference (2005), International Conference on Field-Programmable Technology (2007), VLSI Design/CAD Symposium, Taiwan R.O.C (2004, 2013). International Education Forum Reviewer, ACM Special Interest Group on Design Automation PhD Forum at Design Automation Conference, 2002. 國科會工程處「前瞻晶片設計軟體技術開發計畫」共同召集人 第33屆超大型積體電腦設計暨計算機輔助設計技術研討會(VLSI Design/CAD Symposium) 議程主席 教育部顧問室EDA聯盟94年度CAD產學合作座談會協同主辦人 教育部顧問室DAT聯盟95、96、97年度CAD產學合作座談會主辦人 Publications Journal Papers M.Y. Chan, F. Chin, C.N. Chu, and W.K. Mak, \"Dilation-5 Embedding of 3-Dimensional Grids into Hypercubes\", Journal of Parallel and Distributed Computing, 33(1), pp.98-106, 1996. W.K. Mak and D.F. Wong, \"On Optimal Board-Level Routing for FPGA-based Logic Emulation\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.16(3), pp.282-289, March 1997. W.K. Mak and D.F. Wong, \"Board-Level Multi-Terminal Net Routing for FPGA-based Logic Emulation\", ACM Transactions on Design Automation of Electronic Systems, vol.2(2), pp.151-167, April 1997. W.K. Mak and D.F. Wong, \"Minimum Replication Min-Cut Partitioning\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.16(10), pp.1221-1227, Oct. 1997. W.K. Mak, D. Morton, and K. Wood, \"Monte Carlo Bounding Techniques for Determining Solution Quality in Stochastic Programs\", Operations Research Letters, vol.24(1-2), pp.47-56, Feb. 1999. W.K. Mak and D.F. Wong, \"A Fast Hypergraph Min-Cut Algorithm for Circuit Partitioning\", Integration, The VLSI Journal, vol.30(1), pp.1-11, Nov. 2000. W.K. Mak, \"Min-Cut Partitioning with Functional Replication for Technology Mapped Circuits using Minimum Area Overhead\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.21(4), pp.491-497, April 2002. W.K. Mak and E.F.Y. Young, \"Temporal Logic Replication for Dynamically Reconfigurable FPGA Partitioning\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.22(7), pp.952-959, July 2003. H. Li, W.K. Mak, and S. Katkoori, \"Power Minimization Algorithms for LUT-based FPGA Technology Mapping\", ACM Transactions on Design Automation of Electronic Systems, vol.9(1), pp.33-51, Jan. 2004. W.K. Mak, \"I/O Placement for FPGAs with Multiple I/O Standards\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.23(2), pp.315-320, Feb. 2004. W.K. Mak and C.L. Lai, \"On Constrained Pin Mapping for FPGA-PCB Co-Design\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.25(11), pp.2393-2401, Nov. 2006. W.C. Chao and W.K.Mak, \"Low Power Gated and Buffered Clock Network Construction\", ACM Transactions on Design Automation of Electronic Systems, vol.13(1), pp.20.1-20.20, Jan. 2008. G. Ajwani, C. Chu, and W.K. Mak, \"FOARS: FLUTE Based Obstacle-Avoiding Rectilinear Steiner Tree Construction\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.30(2), pp.194-204, Feb. 2011. J.Z. Yan, C. Chu, and W.K. Mak, \"SafeChoice: A Novel Approach to Hypergraph Clustering for Wirelength-Driven Placement\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.30(7), pp.1020-1033, July 2011. S.H. Wang, Y.Y. Liang, T.Y. Kuo, and W.K. Mak, \"Power-Driven Flip-Flop Merging and Relocation\", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.31(2), pp.180-191, Feb. 2012. Y.Y. Liang, T.Y. Kuo, S.H. Wang, and W.K. Mak, “ALMmap: Technology Mapping for FPGAs with Adaptive Logic Modules”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.31(7), pp.1134-1139, July 2012. W.K. Mak, Y.C. Lin, C. Chu, and T.C. Wang, “Pad Assignment for Die-Stacking System-in-Package Design”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.31(11), pp.1711-1722, Nov. 2012. W.K. Mak and C. Chu, “Rethinking the Wirelength Benefit of 3D Integration”, IEEE Transactions on Very Large Scale Integration Systems, vol.20(12), pp.2346-2351, Dec. 2012. C.R. Li, W.K. Mak, and T.C. Wang, “Fast Fixed-Outline 3-D IC Floorplanning with TSV Co-placement”, IEEE Transactions on Very Large Scale Integration Systems, vol.21(3), pp.523-532, March 2013. F.Y. Chang, R.S. Tsay, W.K. Mak, and S.H. Chen, “MANA: A Shortest Path MAze Algorithm under Separation and Minimum Length NAnometer Rules”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.32(10), pp.1557-1568, Oct. 2013. S.I. Lei and W.K. Mak, “Simultaneous Constrained Pin Assignment and Escape Routing Considering Differential Pairs for FPGA-PCB Co-design”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.32(12), pp.1866-1878, Dec. 2013. W.K. Mak and C. Chu, “E-Beam Lithography Character and Stencil Co-Optimization”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.33(5), pp.741-751, May 2014. C. Chu and W.K. Mak, “Flexible Packed Stencil Design with Multiple Shaping Apertures and Overlapping Shots for E-Beam Lithography”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.34(10), pp.1652-1663, Oct. 2015. J.H. Chang, H.I. Wu, H.L. Pai, R.S. Tsay, and W.K. Mak, “Highly Efficient and Effective Approach for Synchronization-Function-Level Parallel Multicore Instruction-Set Simulations”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.34(11), pp.1822-1835, Nov. 2015. S.I. Lei and W.K. Mak, “Optimizing Pin Assignment and Escape Routing for Blind-via-Based PCBs”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.35(2), pp.246-259, Feb. 2016. P.Y. Wu, W.K. Mak, T.C. Wang, C. Zhuo, K. Unda, and Y. Shi, “A routing framework for technology migration with bump encroachment”, Integration, the VLSI Journal, vol.58, pp.1-8, June 2017. W.K. Mak, W.S. Kuo, S.H. Zhang, S.I. Lei, and C. Chu, “Minimum Implant Area-Aware Placement and Threshold Voltage Refinement”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.36(7), pp.1103-1112, July 2017. Y. Ding, C. Chu, and W.K. Mak, “Self-Aligned Double Patterning Lithography Aware Detailed Routing With Color Preassignment”, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol.36(8), pp.1381-1394, Aug. 2017. Y. Ding, C. Chu, and W.K. Mak, “Self-Aligned Double Patterning-Aware Detailed Routing With Double Via Insertion and Via Manufacturability Consideration”, IEEE",
  "content_length": 25388,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:14"
}