{
  "name": "Wai Lam Hoo",
  "homepage": "https://umexpert.um.edu.my/wlhoo.html",
  "status": "success",
  "content": "CURRICULUM VITAE Curriculum Vitae AREAS OF EXPERTISE EXPERT SYSTEMS AND MACHINE LEARNINGApplied Science And Technology, Information And Communication Technology (ict), Artificial Intelligence And Machine LearningPATTERN AND IMAGE RECOGNITIONApplied Science And Technology, Information And Communication Technology (ict), Computer Graphics, Image Processing, Multimedia And E-games ACADEMIC QUALIFICATION COMPUTER SCIENCE (IMAGE PROCESSING), (Computer Science)Universiti Malaya (um)BCompSc(Artificial Intelligence), (ARTIFICIAL INTELLIGENCE)Universiti Malaya (um) ADMINISTRATIVE DUTIES Head of Department01 Jan 2025 - present (Department of Information System, Faculty of Computer Science and Information Technology)Committee Members01 Jan 2022 - 31 Dec 2027 (Dean Office, Faculty of Computer Science and Information Technology)Committee Members01 Jan 2022 - 31 Dec 2027 (Dean Office, Faculty of Computer Science and Information Technology)Committee Members18 Aug 2023 - 17 Aug 2026 (Dean Office, Faculty of Computer Science and Information Technology)Programme Coordinator01 Oct 2022 - 01 Oct 2025 (Dean Office, Faculty of Computer Science and Information Technology)Task Force Leader03 Mar 2023 - 04 Mar 2025 (Dean Office, Faculty of Computer Science and Information Technology)Head Coordinator08 Feb 2022 - 08 Sep 2024 (Dean Office, Faculty of Computer Science and Information Technology)Committee Members01 Sep 2022 - 31 Aug 2024 (International)Course Coordinator01 Jan 2023 - 31 Dec 2023 (Dean Office, Faculty of Computer Science and Information Technology)Coordinator20 Apr 2022 - 31 Dec 2023 (Dean Office, Faculty of Computer Science and Information Technology)Committee Members12 Apr 2023 - 31 Dec 2023 (Dean Office, Faculty of Computer Science and Information Technology)Committee Members12 Apr 2023 - 31 Dec 2023 (Dean Office, Faculty of Computer Science and Information Technology)Committee Members09 Oct 2022 - 17 Sep 2023 (Dean Office, Faculty of Computer Science and Information Technology)Coordinator01 Aug 2021 - 30 Jun 2023 (Department)Committee (Internal Audit)11 Apr 2018 - 31 Jul 2021 (Department of Information System, Faculty of Computer Science and Information Technology)Committee (Academic Collaboration Programme)19 Aug 2019 - 21 Aug 2019 (Department of Information System, Faculty of Computer Science and Information Technology)Chairman09 Apr 2018 - 09 Apr 2018 (Department of Information System, Faculty of Computer Science and Information Technology)Committee06 Apr 2018 - 08 Apr 2018 (Department of Information System, Faculty of Computer Science and Information Technology) MEMBERSHIPS IEEE COMPUTATIONAL INTELLIGENCE SOCIETY MALAYSIA CHAPTER, PRESIDENT/ CHIEF2023 to 2023 (National)LOCAL ARRANGEMENT CO-CHAIR, IEEE INTERNATIONAL CONFERENCE OF IMAGE PROCESSING (ICIP), COMMITTEE MEMBER2023 to 2023 (International)INSTITUTE OF ELECTRICAL AND ELECTRONICS ENGINEERS (IEEE), MEMBER2016 to 2019 (International) AWARD AND STEWARDSHIP Excellence Service Award2023, Universiti MalayaCertificate of Excellent Service2022, Universiti Malaya PUBLICATIONS Article in Journal WoS Xu, Wenbo; Mahmud, Rohana; Hoo, Wai Lam (2025). A Systematic Literature Review: Are Automated Essay Scoring Systems Competent in Real-Life Education Scenarios? (vol 12, pg 77639, 2024), IEEE ACCESS. 13, 29738-29738. doi:10.1109/ACCESS.2025.3541480 Others Mujtaba, G., Shuib, L., Idris, N., Hoo, W. L., Raj, R. G., Khowaja, K., Shaikh, K., & Nweke, H. F. (2018). Clinical Text Classification Research Trends: Systematic Literature Review and Open Issues. Expert Systems with Applications, 116, 494-520. Hoo, W. L. & Chan, C. S. 2015. Zero-Shot Object Recognition System Based on Topic Model. IEEE Transactions on Human- Machine Systems. 45(4) : 518-525 (Tier 2, Impact Factor = 1.982) Hoo, W. L., & Chan, C. S. (2015). Recognizing unknown objects with attributes relationship model. Expert Systems with Applications, 42(23), 9279-9283. Hoo, W.L., Lim, C.H. & Chan, C.S. 2015. Keybook: Unbias Object Recognition using Keywords. Expert Systems with Applications 42(8) : 3991-3999 (Tier 1, Impact Factor = 2.240) Lee, H. Y., Hoo, W. L. & Chan, C. S. 2015. Color video denoising using epitome and sparse coding. Expert Systems with Applications 42(2) : 751-759 (Tier 1, Impact Factor = 2.240) Article in Proceeding Hoo, W. L., & Chan, C. S. (2018). Anisotropic Partial Differential Equation Based Video Saliency Detection. IEEE International Conference on Image Processing (ICIP), pp. 2311-2315. Hoo, W. L., Miron, A., Badii, A., & Chan, C. S. (2015, September). Skin-based privacy filter for surveillance systems. In Systems, Signals and Image Processing (IWSSIP), 2015 International Conference on (pp. 269-272). IEEE. Hoo, W. L., Kim, T. K., Pei, Y., & Chan, C. S. (2014, August). Enhanced random forest with image/patch-level learning for image understanding. In Pattern Recognition (ICPR), 2014 22nd International Conference on (pp. 3434-3439). IEEE. Hoo, W.L. & Chan, C.S. (2013) PLSA-based Zero-Shot Learning, IEEE International Conference on Image Processing, pp. 4297-4301 RESEARCH PROJECT National 2018 - 2020, Bantuan Kecil Penyelidikan (BKP)Sport analytics - structural analysis in sports data ( Principal Investigator(PI))2018 - 2020, RU Geran - Fakulti ProgramPerson - Oriented Image Retrieval Using Natural Language Description ( Principal Investigator(PI)) PAPER PRESENTED INVITED SPEAKER Big Data Management using Hadoop, International Workshop on Data Analytics (IWDA) 2018, FSKTM (National) (28 Aug 2018 - 29 Aug 2018) PRESENTER Anisotropic Partial Differential Equation Based Video Saliency Detection, 25th IEEE International Conference on Image Processing (ICIP), IEEE (International) (07 Oct 2018 - 10 Oct 2018) SAP Analytics Cloud, SAP Analytics Cloud Training Session, FSKTM (University) (17 May 2018 - 17 May 2018) Skin-based privacy filter for surveillance systems. In Systems, International Conference In Systems, Signals and Image Processing (IWSSIP), School of Mathematics, Computer Science and Engineering at City, University of London (International) (10 Sep 2015 - 12 Sep 2015) OTHERS Data Analytics and Its Applications, Data Science Research Symposium (DSRS 2018), FSKTM (University) (12 Jul 2018 - 12 Jul 2018) ACADEMIC/ PROF. SERVICES Evaluation (2023) Panel for Proposal Defense, University, (Internal Examiner) (2023) Master of Data Science Research Project Evaluation as Panel (rose Tiong), University, (Internal Examiner) (2023) Master of Data Science Research Project Evaluation as Panel (sim Lin Zheng), University, (Internal Examiner) (2023) Master of Data Science Research Project Evaluation as Panel (jing Zhang), University, (Internal Examiner) (2023) Master of Data Science Research Project Evaluation as Panel (rahman Karimiyazdi), University, (Internal Examiner) (2023) Master of Data Science Research Project Evaluation as Panel (lee Mei Tee), University, (Internal Examiner) (2023) Master of Data Science Research Project Evaluation as Panel (ng Boon Jane), University, (Internal Examiner) (2023) Master of Data Science Research Project Evaluation as Panel (chin Chee Teng), University, (Internal Examiner) (2018) Journal reviewer for IEEE/CAA Journal of Automatica Sinica and Malaysian Journal of Computer Science, (Reviewer) (2018) Data Science Research Symposium (DSRS 2018), (Session chair) (2018) Reviewer for conference - Visual Communications and Image Processing (VCIP), (Reviewer) (2018) Internal examiner for Master of Data Science (Coursework) , (Internal Examiner) (2018) Internal examiner for Master of Computer Science (Research), (Internal Examiner) Contribution to external organisation (2018) Session Chair, Data Science Research Symposium (DSRS 2018), University (2018) Treasurer, IEEE Computational Intelligence Society Malaysia Chapter SUPERVISION Under Graduate Students (2023) WIH3001 Data Science Project (2023) Final Year Projects for WIA3002 and WIA3003 (2023) Industrial Training, SARAH BINTI FAUZI, AMIR FIRDAUS BIN ABDUL HADI, NUR IZZATI BINTI SHALAHUDIN, NURIN BATRISYIA BINTI MOHD AZMI, THEEVEEYAN RAJ A/L KRISHNAKUMAR, CHIN SHAN HONG, NG JUN JING, NURSARA AIN BINTI HARZANY, DARYL GAN EN-WEI, TEH KAI KEAT, PIRVINNESH A/L SUNTHARAM, MUHAMMAD AMIRUL MUKMININ BIN MOHD ZAMRI, LEOW JIA SHENG, LIM JING YAO, YEO JIE HUI, EZRA TAN EN ZHONG, TAN YI YUNG, CHIM TINGSHING, TAN WAN HAN Postgraduate Student PhD/ Doctoral (2018) IMAGE CAPTIONING BASED ON LSTM, TAN YING HUA (2018) ENHANCING MULTILINGUAL SENTIMENT ANALYSIS USING COMBINED CLASSIFICATION APPROACHES, MUWANEI SINYINDA Master (2018) THE IMPACT OF DOMINANT COLOR IN ONLINE ADVERTISEMENT ON PURCHASE INTENTION:, FATEMEH BAKHSHIAN TEACHING Master (2023) WQD7007 - Big Data Management (2018) WQD7007 - Big Data Management Bachelor (2023) WIH3002 - Data Science Industrial Training (2023) WIA1002 - Data Structure (2023) WIB1002 - Data Structure (2023) WIA3001 - Industrial Training (2023) WIB3001 - Industrial Training (2023) WIA2003 - Probability and Statistics (2018) WIA2003 - Probability and Statistics (2018) WIE3008 - Business Analytics and Intelligence SOCIAL RESPONSIBILITY ACTIVITIES Organising Committee for The Asean Data Science Explorer (adse) National Finals, (13 Sep 2018 - 13 Sep 2018)Speaker for International Workshop On Data Analytics 2018, (28 Aug 2018 - 29 Aug 2018)Judge for Open Category: National Robotics Competition (nrc) 2018, (05 Jul 2018 - 05 Jul 2018)Chair - Sap Analytics Cloud Enablement Session in University of Malaya, (09 Apr 2018 - 09 Apr 2018)",
  "content_length": 9502,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:18"
}