{
  "name": "Wail Mardini",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=mardini",
  "status": "success",
  "content": "Wail Elias Mardini × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content wail elias mardini • Department of Computer Science - Faculty Member 22666 Engineering building A1 L3 Department of Computer Science mardini@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from University of Ottawa, 2006 Msc. of Computer Science from University of New Brunswick, 2001 Bsc. of Applied Mathematics from Jordan University of Science and Technology, 1997 Publications Wail E. Mardini, Protection of Unicast and Multicast Traffic in WDM Mesh Networks: A Survey, Nova Science Publishers , 2011, Book Wail Mardini, Mai Abu Alfool, \"Modified WRR Scheduling Algorithm for WiMAX Networks,\" Journal of Network Protocols and Algorithms, vol. 3, no. 2, pp. 24-53, 2011 Wail Mardini, Yaser Khamayseh, Muneer Bani Yasin, Ghadeer Obiedat,, \"Survey of Latest WiMAX Technologies and Techniques,\" Journal of International Review on Computers and Software, vol. 6, no. 4, pp. 0-0, 2011 Wail Mardini, Muneer Bani Yassein, Zainab AbuTaye', \"A NEW BACKOFF ALGORITHM FOR IEEE 802.11 DCF MAC PROTOCOL IN MOBILE AD HOC NETWORKS,\" Ubiquitous Computing and Communication Journal (UBICC), vol. 6, no. 3, pp. 907-916, 2011 Yaser M Khamayseh, Abdulraheem Bader, Wail Mardini, Muneer BaniYasein, \"A New Protocol for Detecting Black Hole Nodes in Ad Hoc Networks,\" International Journal of Communication Networks and Information Security (IJCNIS), vol. 3, no. 1, pp. 36-47, 2011 Wail Mardini; Yaser Khamayseh; Shorouq AL-Eide,, \"Optimal Number of Relays in Cooperative Communication in Wireless Sensor Networks,\" Communications and Network, vol. 4, no. 2, pp. 0-0, 2012 Wail Mardini, Musab Q. Al-Ghadi, Ismail M. Ababneh,, \"Distance-Based Scheme for Vertical Handoff in Heterogeneous Wireless Networks,\" Journal of Emerging Technologies in Web Intelligence, vol. 4, no. 1, pp. 0-0, 2012 Yaser Khamayseh, Wail Mardini, Shadi Aljawarneh, Muneer Bani Yassein, \"Integration of Wireless Technologies in Smart University Campus Environment: Framework Architecture,\" International Journal of Information and Communication Technology Education (IJICTE), vol. 11, no. 1, pp. 74-89, 2015 Wail Mardini, Yaser Khamayseh, Abdalrhman Alshakh, Ehab Elmaleh, \"Adaptive RSSI-based localization scheme for wireless sensor networks,\" Peer-to-Peer Networking and Applications, vol. 2015, no. , pp. 1-14, 2015 Yaser Khamayseh, Wail Mardini, Rana Al-Hijjawi, Reem Jaradat, Huessin Mouftah, \"Prediction-based Schemes for Coexistence in Personal Wireless Networks,\" Journal of Ad Hoc & Sensor Wireless Networks, vol. 26, no. 1-4, pp. 259-285, 2015 YASER KHAMAYSEH, WAIL MARDINI, HADEEL TBASHATE, \"Leveraging The Data Gathering and Analysis Phases to Gain Situational Awareness,\" Intelligent Automation and Soft Computing, vol. 21, no. 4, pp. 1-20, 2015 Wail Mardini, Abdulaziz Alraddadi, \"Adaptive Algorithm for Beacon and Superframe Values in IEEE802.15.4 Based Networks,\" Journal of International Review on Computers and Software, vol. 9, no. 9, pp. 1637-1644, 2014 Wail Mardini,  Muneer Bani Yassein, Yaser Khamayseh, Barraq Ghaleb, \"Rotated Hybrid, Energy-Efficient and Distributed (R-HEED) Clustering Protocol in WSN,\" WSEAS Transactions on Communications, vol. 13, no. , pp. 275-290, 2014 Ismail Ababneh, Wail Mardini, Asmahan Abu al-Hassan, \"ADAPTIVE VELOCITY-BASED BROADCASTING IN MOBILE AD HOC NETWORKS,\" Journal of Parallel and Distributed Computing and Networks , vol. 3, no. 1, pp. 0-0, 2013 Khamayseh, Yaser and Mardini, Wail and Atwood, J William and Aldwairi, Monther, \"{Dynamic framework to mining Internet of Things for multimedia services},\" Expert Systems, vol. , no. , pp. 0-0, 2019 Yassein, Muneer Bani and Hmeidi, Ismail and Shehadeh, Haneen and Yaseen, Waed Bani and Masadeh, Esraa and Mardini, Wail and Khamayseh, Yaser and Baker, Qanita Bani, \"{Performance Evaluation of\" Dynamic Double Trickle Timer Algorithm\" in RPL for Internet of Things (IoT)},\" , vol. , no. , pp. 0-0, 2019 Yassein, Muneer Bani and Hmeidi, Ismail and Shatnawi, Farah and Mardini, Wail and Khamayseh, Yaser, \"{Smart Home Is Not Smart Enough to Protect You-Protocols, Challenges and Open Issues},\" Procedia Computer Science, vol. 160, no. , pp. 134-141, 2019, Elsevier Aldwairi, Monther and Mardini, Wail and Alhowaide, Alaa, \"{Anomaly payload signature generation system based on efficient tokenization methodology},\" International Journal on Communications Antenna and Propagation (IRECAP), vol. , no. , pp. 0-0, 2018 Yassein, Muneer Bani and Khamayseh, Yaser and Mardini, Wail and {Al Bataineh}, Manar, \"{Enhanced Home Energy Management Scheme (EHEM) in Smart Grids},\" International Journal of Communication Networks and Information Security, vol. 10, no. , pp. 85-90, 2018, Kohat University of Science and Technology (KUST) Khamayseh, Yaser M and Mardini, Wail and Halima, Nadhir Ben, \"{Evolutionary Algorithm for Scheduling in Wireless Sensor Networks.},\" JCP, vol. 13, no. , pp. 262-270, 2018 Mardini, Wail and Khamayseh, Yaser and Yassein, Muneer Bani and Khatatbeh, Montaha Hani, \"{Mining Internet of Things for intelligent objects using genetic algorithm},\" Computers and Electrical Engineering, vol. 66, no. , pp. 423-434, 2018 MARDINI, WAIL and KHAMAYSEH, YASER and AL-ZARO, SAMAH JAWAD, \"{SPECTRUM MANAGEMENT IN COGNITIVE RADIO NETWORKS},\" ICIC express letters. Part B, Applications: an international journal of research and surveys, vol. 9, no. , pp. 887-898, 2018, ICIC International Mardini, Wail and Khamayseh, Yaser and Salayma, Marwa and Yassien, Muneer Bani and Mouftah, Hussien, \"{Adaptive Duty Cycle (ADC) energy efficient algorithm for ZigBee networks},\" Computer Systems Science and Engineering, vol. 32, no. , pp. 5-19, 2017 Mardini, Wail and Ebrahim, Maad and Al-Rudaini, Mohammed, \"{Comprehensive performance analysis of RPL objective functions in IoT networks},\" International Journal of Communication Networks and Information Security, vol. 9, no. , pp. 323-332, 2017 Mardini, Wail and Albalas, Firas and Obeidat, Qusai and Yassein, Muneer Masadeh Bani and Joseph, Shibily and Jasmin, E A and Hoque, M Robiul and Kabir, M Humayun and Yang, Sung-Hyun and Ying-nan, Liu and Others, \"{Improved home energy management techniques for smart grids},\" International Journal of Smart Home, vol. 11, no. , pp. 1-20, 2017 Yassein, Muneer Bani and Shatnawi, Mohammed Q. and Mardini, Wail and Al-zoubi, Dua, \"{Internet of things' business impact and its application layer protocol in embedded systems},\" International Journal of Intelligent Enterprise, vol. 4, no. , pp. 143-154, 2017 Albalas, Firas and Mardini, Wail and Bani-Salameh, Dua'a, \"{Optimized job scheduling approach based on genetic algorithms in smart grid environment},\" International Journal of Communication Networks and Information Security, vol. 9, no. , pp. 172-176, 2017 Mardini, Wail and Khamayseh, Yaser and Almodawar, Abdalrhman Abdalkareem and Elmallah, Ehab, \"{Adaptive RSSI-based localization scheme for wireless sensor networks},\" Peer-to-Peer Networking and Applications, vol. 9, no. , pp. 991-1004, 2016 {Al Balas}, Firas A and Mardini, Wail and Khamayseh, Yaser and Bani-Salameh, Dua'a Ah K, \"{Improved appliance coordination scheme with waiting time in smart grids},\" International Journal of advanced computer science and applications, vol. 7, no. , pp. 16-30, 2016 Al-Ayyoub, Mahmoud and Husari, Ghaith and Mardini, Wail, \"{Improving vertical handoffs using mobility prediction},\" International Journal of Advanced Computer Science and Applications (IJACSA), vol. 7, no. , pp. 0-0, 2016 Wail, Mardini and Yaser, Khamayseh and Abdalkareem, Almodawar Abdalrhman and Others, \"{Adaptive RSSI-based localization scheme for wireless sensor networks [J]},\" Peer-to-Peer Networking and Applications, vol. , no. , pp. 1-14, 2015 Khamayseh, Yaser and Mardini, Wail and Aljawarneh, Shadi and Yassein, Muneer Bani, \"{Integration of wireless technologies in Smart University Campus environment: Framework architecture},\" International Journal of Information and Communication Technology Education, vol. 11, no. , pp. 60-74, 2015 Khamayseh, Yaser and Mardini, Wail and Tbashate, Hadeel, \"{Leveraging The Data Gathering and Analysis Phases to Gain Situational Awareness},\" Intelligent Automation and Soft Computing, vol. 21, no. , pp. 523-542, 2015 Khamayseh, Yaser and Mardini, Wail and Al-Hijjawi, Rana and Jaradat, Reem and Mouftah, Hussein, \"{Prediction-based schemes for coexistence in personal wireless networks},\" Ad-Hoc and Sensor Wireless Networks, vol. 26, no. , pp. 259-285, 2015 Mardini, Wail and Alraddadi, Abdulaziz, \"{Adaptive algorithm for beacon and superframe values in IEEE802.15.4 based networks},\" International Review on Computers and Software, vol. 9, no. , pp. 1637-1644, 2014 Mardini, Wail and Yassein, Muneer Bani and Khamayseh, Yaser and Ghaleb, Barraq A, \"{Rotated hybrid, energy-efficient and distributed (R-HEED) clustering protocol in WSN},\" wseas transactions on communications, vol. 13, no. , pp. 275-290, 2014 Ababneh, Ismail and Mardini, Wail and Al-Hassan, Asmahan Abu, \"{ADAPTIVE VELOCITY-BASED ROUTE DISCOVERY IN MOBILE AD HOC NETWORKS},\" arallel and Distributed Computing and Networks, vol. , no. , pp. 0-0, 2013 Salayma, Marwa and Mardini, Wail and Khamayseh, Yaser and Yasin, Muneer Bani, \"{Optimal beacon and superframe orders in WSNs},\" topology, vol. 6, no. , pp. 0-0, 2013 Yassein, Muneer Bani and Hameed, Balqees Abd and Mardini, Wail and Khamayseh, Yaser, \"{Performance Analysis of Adjusted Counter Based Broadcasting in Mobile Ad Hoc Networks},\" Communications and Network, vol. 5, no. , pp. 0-0, 2013, Scientific Research Publishing Yassein, Muneer Bani and Al-Ameri, Amera and Khamayseh, Yaser M and Mardini, Wail E, \"{Routing Discovery Algorithm Using Parallel Chase Packet},\" Editorial Preface, vol. 4, no. , pp. 0-0, 2013 Mardini, Wail and Khamayseh, Yaser M, \"{Algorithms and Protocols in Information and Communication Syste",
  "content_length": 25144,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:20"
}