{
  "name": "Wallapak Tavanapong",
  "homepage": "http://www.cs.iastate.edu/people/wallapak-tavanapong-0",
  "status": "success",
  "content": "Wallapak Tavanapong | Department of Computer Science Skip to main content Wallapak Tavanapong Position Professor Kingland Systems Professor in Data Analytics or Cognitive Machine Learning PI of Dependable Data Driven Discovery Traineeship Wallapak Tavanapong received the B.S. degree in Computer Science from Thammasat University, Thailand in 1992 and the M.S. and Ph.D. degrees in Computer Science from the University of Central Florida in 1995 and 1999, respectively. She joined Iowa State University in 1999 and is currently a Professor of Computer Science. She is a co-founder and a Chief Technology Officer of EndoMetric, a software company that offers computer-aided technology for colonoscopy. She received a National Science Foundation Career grant, the 2006 American College of Gastroenterology Governors Award for Excellence in Clinical Research for “The Best Scientific Paper”, and a US patent on Colonoscopy Video Processing for Quality Metrics Determination. Her current research interests include multimedia in healthcare, high performance multimedia computing, multimedia and databases, multimedia and communications, electronic medical records, and databases. Her research has been supported by National Science Foundation, Agency for Healthcare Research and Quality, the National Institute of Diabetes and Digestive and Kidney Diseases, Mayo Clinic Rochester, Iowa Department of Economic Development, and EndoMetric. She has served as an editorial board member for ACM SIGMOD Digital Symposium Collection, an NSF panel reviewer, a program committee member for international conferences, and a referee for conferences and reputable journals. Contact Email tavanapo@iastate.edu Phone +1 515 294 2987 106 Atanasoff Ames, IA 50011-1041 Download CV Social Media and Websites Computational Media Lab Dependable Data-Driven Discovery Research Area AI, ML, and Data Science Systems and Networking Education Ph.D. University of Central Florida 1999 M.S. University of Central Florida 1995 B.S. Thammasat University, Thailand 1992 Current GrantsNRT-HDR: Dependable data-driven discovery, National Science Foundation. W. Tavanapong (PI), Surya Mallapragada (Co-PI), Eric Weber (Co-PI), Dan Nettleton (Co-PI), Hridesh Rajan (Co-PI), Iddo Friedberg, Baskar Ganapathysubramanian, Qi Li, and Thomas Nelson Laird. $2,998,973.00, 07/01/2022- 06/30/2027. Award No. 2152117.Real-Time Feedback to Improve Colonoscopy. National Institutes of Health. Piet C. de Groen (PI, University of Minnesota Twin Cities), Felicity Boyd Enders (Co-investigator, Mayo Clinic, Rochester), W. Tavanapong (Co-investigator, Iowa State University), Johnny Wong (Co-investigator, Iowa State University), JungHwan Oh (Co-investigator, University of North Texas), John Inadomi (Co-investigator, University of Washington), and Mark Lazarev (Co-investigator, Johns Hopkins University) 12/01/2016-6/30/2020. Total budget: $2,827,593 with ISU budget of $460,896. Grant No. 1R01DK106130-01A1.Awards/PatentsTop Teaching Award, Advertising Division. The Association of Education in Journalism and Mass Communication 2017 Conference.United States Patent No. 7,894,648 “Colonoscopy Video Processing for Quality Metrics Determination,” February 22, 2011.One of the three finalists for the 2009 Iowa Women of Innovation in Research Innovation and Leadership award.LAS Early Achievement in Research Award 2008, College of Liberal Arts and Sciences (LAS), Iowa State University.Objective Quality Control for Colonoscopy: Automated Extraction of Endoscopic Metrics from Video Files. 2006 American College of Gastroenterology Governors Award for Excellence in Clinical Research for “The Best Scientific Paper,” with P. C. de Groen (first author), J. Oh, and J. Wong, October 2006.Publications (last four years)See Tavanapong's Google Scholar ProfileResearch areas:Risk Management for Responsible Artificial Intelligence/Data ScienceTraining methods, active learning, self-supervised learning, interpretation, and explanationsApplied computer vision in biomedical domains: AI for colonoscopy, AI for stem cell researchOutreach activities:Workshops for high schools in IowaScience Bound's Computer Cyence Recent Publications There was an error when fetching publications.",
  "content_length": 4228,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:21"
}