{
  "name": "Walter J. Scheirer",
  "homepage": "http://www.wjscheirer.com",
  "status": "success",
  "content": "Walter J. Scheirer Walter J. Scheirer Essays Publications Projects Talks GitHub Scholar CV walter.scheirer@nd.edu, @wjscheirer, @wjscheirer.bsky.social Dennis O. Doughty Collegiate Professor of EngineeringDepartment of Computer Science and Engineering University of Notre Dame Research Overview My technical research is primarily focused around the problem of recognition, including the representations and algorithms supporting solutions to it. I am particularly interested in features and learning-based methods that apply to both vision and language, thus breaking away from the persistent compartmentalization of recognition tasks (something hinted at by David Marr over 40 years ago). This has led to some intriguing and often unconventional approaches that can be applied to a broad set of areas within artificial intelligence including computer vision, machine learning, and human biometrics. Specifically, my work is looking at open world recognition, extreme value theory models for visual recognition, and biologically-inspired learning algorithms. I'm also a cultural critic and historian, commenting on the social context of emerging technologies from the realistic perspective of a computer scientist. Curriculum Vitae PDF Format Postdoctoral Fellows Steve Cruz (Co-Advised with Jonathan Hauenstein) Graduate Students Louisa Conwill Arturo Russell Bernal (Co-Advised with Jane Cleland-Huang) Abigail Swenor Samuel Webster Rex Stayer-Suprick (Master's Student) Teaching Fall 2025: CSE 40175 Ethical & Professional Issues Spring 2025: CSE 40535 Special Studies: Computer Vision Fall 2024: CSE 40175 Ethical & Professional Issues Spring 2024: CSE 20176 The Archeology of Hacking Books Virtue in Virtual Spaces (Liturgical Press) with Louisa Conwill and Megan Levis A History of Fake Things on the Internet (Stanford University Press) A Unifying Framework for Formal Theories of Novelty (Springer-Nature) edited with Terry Boult Quantitative Intertextuality: Analyzing the Markers of Information Reuse (Springer-Nature) with Christopher W. Forstall Extreme Value Theory-based Methods for Visual Recognition (Morgan & Claypool Publishers) Recent Publications (see all) \"COSTARR: Consolidated Open Set Technique with Attenuation for Robust Recognition,\" Ryan Rabinowitz, Steve Cruz, Walter Scheirer, Terrance Boult, Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV), October 2025. [pdf] [bibtex] @inproceedings{Rabinowitz2025, title={COSTARR: Consolidated Open Set Technique with Attenuation for Robust Recognition}, author={Ryan Rabinowitz and Steve Cruz and Walter J. Scheirer and Terrance Boult}, booktitle={Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV)}, year={2025}, } \"Design Patterns for the Common Good: Building Better Technologies Using the Wisdom of Virtue Ethics,\" Louisa Conwill, Megan Levis, Karla Badillo-Urquiola, Walter Scheirer, Proceedings of the ACM CHI Conference on Human Factors in Computing Systems, April 2025. [pdf] [bibtex] @inproceedings{conwill2025, title={Design Patterns for the Common Good: Building Better Technologies Using the Wisdom of Virtue Ethics}, author={Louisa Conwill and Megan Levis and Karla Badillo-Urquiola and Walter J. Scheirer}, booktitle={Proceedings of the ACM CHI Conference on Human Factors in Computing Systems}, year={2025}, } \"Open Issues in Open World Learning,\" Steve Cruz, Katarina Doctor, Christopher Funk, Walter Scheirer, AAAI AI Magazine, April 2025. [pdf] [bibtex] @article{Cruz2025, title={Open Issues in Open World Learning}, author={Cruz, Steve and Doctor, Katarina and Funk, Christopher and Scheirer, Walter}, journal={AAAI AI Magazine}, volume={46}, number={2}, year={2025} } \"Psych-Occlusion: Using Visual Psychophysics for Aerial Detection of Occluded Persons during Search and Rescue,\" Arturo Russell Bernal, Jane Cleland-Huang, Walter Scheirer, Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), March 2025. [pdf] [bibtex] @inproceedings{russell2025psych, title={Psych-Occlusion: Using Visual Psychophysics for Aerial Detection of Occluded Persons during Search and Rescue}, author={Russell Bernal, Arturo Miguel and Scheirer, Walter and Cleland-Huang, Jane}, booktitle={Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV)}, year={2025} } \"Human Activity Recognition in an Open World,\" Derek Prijatelj, Samuel Grieggs, Jin Huang, Dawei Du, Ameya Shringi, Christopher Funk, Adam Kaufman, Eric Robertson, Walter Scheirer, Journal of Artificial Intelligence Research, December 2024. [pdf] [code] [bibtex] @article{PrijateljJAIR2024, author = {Prijatelj, Derek S. and Grieggs, Samuel and Huang, Jin andi Du, Dawei and Shringi, Ameya and Funk, Christopher and Kaufman, Adam and Robertson, Eric and Scheirer, Walter J.}, title = {Human Activity Recognition in an Open World}, journal = {Journal of AI Research}, volume = {81}, pages = {935--971}, year = {2024} } \"This Probably Looks Exactly Like That: An Invertible Prototypical Network,\" Zachariah Carmichael, Timothy Redgrave, Daniel Gonzalez Cedre, Walter Scheirer, Proceedings of the European Conference on Computer Vision (ECCV), October 2024. [pdf] [code] [bibtex] @InProceedings{Carmichael2024, author = {Carmichael, Zachariah and Redgrave, Timothy and Cedre, Daniel Gonzalez and Scheirer, Walter J}, title = {This Probably Looks Exactly Like That: An Invertible Prototypical Network}, booktitle = {European Conference on Computer Vision (ECCV)}, year = {2024} } \"Has the Virtualization of the Face Changed Facial Perception? A Study of the Impact of Augmented Reality on Facial Perception,\" Louisa Conwill, Samuel Anthony, Walter Scheirer, Proceedings of the ACM CHI Conference on Human Factors in Computing Systems, May 2024. [pdf] [bibtex] @InProceedings{conwill2024virtualization, title={Has the Virtualization of the Face Changed Facial Perception? A Study of the Impact of Augmented Reality on Facial Perception}, author={Louisa Conwill and Samuel Anthony and Walter Scheirer}, year={2024}, booktitle={Proceedings of the ACM CHI Conference on Human Factors in Computing Systems} } \"Informing Machine Perception With Psychophysics,\" Justin Dulay, Sonia Poltoratski, Till Hartmann, Samuel Anthony, Walter Scheirer, Proceedings of the IEEE, February 2024. [pdf] [code] [bibtex] @article{dulay2024informing, title={Informing Machine Perception With Psychophysics}, author={Dulay, Justin and Poltoratski, Sonia and Hartmann, Till S and Anthony, Samuel E and Scheirer, Walter J}, journal={Proceedings of the IEEE}, volume={112}, number={2}, pages={88--96}, year={2024}, publisher={IEEE} } \"Pixel-Grounded Prototypical Part Networks,\" Zachariah Carmichael, Suhas Lohit, Anoop Cherian, Michael Jones, Walter Scheirer, Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), January 2024. [pdf] [code] [bibtex] @inproceedings{carmichael2024pixel, title={Pixel-grounded Prototypical Part Networks}, author={Carmichael, Zachariah and Lohit, Suhas and Cherian, Anoop and Jones, Michael J and Scheirer, Walter J}, booktitle={Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV)}, pages={4768--4779}, year={2024} } \"The Paleographer’s Eye ex machina: Using Computer Vision to Assist Humanists in Scribal Hand Identification,\" Samuel Grieggs, Cai Henderson, Sebastian Sobecki, Alexandra Gillespie, Walter Scheirer, Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), January 2024. [pdf] [bibtex] @inproceedings{grieggs2024paleographer, title={The Paleographer's Eye ex machina: Using Computer Vision To Assist Humanists in Scribal Hand Identification}, author={Grieggs, Samuel and Henderson, CEM and Sobecki, Sebastian and Gillespie, Alexandra and Scheirer, Walter}, booktitle={Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV)}, pages={7177--7186}, year={2024} } New Research in arXiv / bioRxiv \"The Challenges and Benefits of Bringing Religious Values Into Design\" Louisa Conwill, Megan Levis, Karla Badillo-Urquiola, Walter Scheirer, February 2025. [pdf] [bibtex] @misc{conwill2025challenges, title={The Challenges and Benefits of Bringing Religious Values Into Design}, author={Louisa Conwill and Megan K. Levis and Karla Badillo-Urquiola and Walter J. Scheirer}, year={2025}, eprint={2502.17293}, archivePrefix={arXiv}, primaryClass={cs.HC}, url={https://arxiv.org/abs/2502.17293}, } \"Story Grammar Semantic Matching for Literary Study,\" Abigail Swenor, Neil Coffee, Walter Scheirer, February 2025. [pdf] [bibtex] @misc{swenor2025storygrammarsemanticmatching, title={Story Grammar Semantic Matching for Literary Study}, author={Abigail Swenor and Neil Coffee and Walter Scheirer}, year={2025}, eprint={2502.12276}, archivePrefix={arXiv}, primaryClass={cs.CL}, url={https://arxiv.org/abs/2502.12276}, } \"Identifying Information from Observations with Uncertainty and Novelty,\" Derek Prijatelj, Timothy Ireland Walter Scheirer, January 2025. [pdf] [bibtex] @misc{prijatelj2025y, title={Identifying Information from Observations with Uncertainty and Novelty}, author={Derek S. Prijatelj and Timothy J. Ireland and Walter J. Scheirer}, year={2025}, eprint={2501.09331}, archivePrefix={arXiv}, primaryClass={cs.LG}, url={https://arxiv.org/abs/2501.09331}, } \"N-Modal Contrastive Losses with Applications to Social Media Data in Trimodal Space,\" William Theisen, Walter Scheirer, March 2024. [pdf] [bibtex] @article{theisen2024n, title={N-Modal Contrastive Losses with Applications to Social Media Data in Trimodal Space}, author={Theisen, William and Scheirer, Walter}, journal={arXiv preprint arXiv:2403.12747}, year={2024} } \"On the Effectiveness of Image Manipulation Detection in the Age of Social Media,\" Rosaura G. VidalMata, Priscila Saboia, Daniel Moreira, Grant Jensen, Jason Schlessman, Walter Scheirer, April 2023. [pdf] [bibtex] @misc{vidalmata2023effectiveness, title={On the Effect",
  "content_length": 15446,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:24"
}