{
  "name": "Walter Quattrociocchi",
  "homepage": "https://sites.google.com/view/walterquattrociocchi",
  "status": "success",
  "content": "Walter Quattrociocchi, Ph.DSearch this siteEmbedded FilesSkip to main contentSkip to navigationBioWalter Quattrociocchi is head of the of the Data and Complexity for Society Lab at Sapienza Università di Roma, where he is Associate Professor in Computer Science. His research interests include data science, network science, cognitive science, and data-driven modeling of dynamic processes in complex networks. His activity focuses on the data-driven modeling of social dynamics such as (mis)information spreading and the emergence of collective phenomena. Walter has published extensively in peer reviewed conferences and journals including PNAS. The results of his research in misinformation spreading have informed the Global Risk Report 2016 and 2017 of the World Economic Forum and have been covered extensively by international media including Scientific American, New Scientist, The Economist, The Guardian, New York Times, Washington Post, Bloomberg, Fortune, Poynter and The Atlantic). He published two books: “Misinformation. Guida alla società dell’informazione e della credulità” (Franco Angeli) and “Liberi di Crederci. Informazione, Internet e Post Verità” with Codice Edizioni for the dissemination of his results.In 2017 Professor Quattrociocchi was the coordinator of the round table on Fake News and the role of Universities and Research to contrast fake news chaired by the President of Italy's Chamber of Deputies Mrs Laura Boldrini and is Scientific Advisor of the Italian Communication Authority (AGCOM). Professor Quattrociocchi is regularly invited for keynote speeches and guest lectures at major academic and other organizations, having presented among others at CERN, European Commission, the University of Cambridge, Network Science Institute, L’Oréal, Global Security Forum.A summary of his main findings is available at:How does misinformation spread online? World Economic Forum Agenda https://www.weforum.org/agenda/2016/01/q-a-walter-quattrociocchi-digital-wildfires/Here the link to the Personal Blog (in Italian) https://www.agi.it/blog-italia/autore/walter_quattrociocchi/Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2156,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:24"
}