{
  "name": "Walter O. Krawec",
  "homepage": "https://walterkrawec.org",
  "status": "success",
  "content": "Walter O. Krawec Walter O. Krawec University of ConnecticutStorrs CT, USA Email: walter.krawec@uconn.edu walter.krawec@gmail.com Last Update: September 29, 2025 I am an Associate Professor of Computer Science at the University of Connecticut. My primary research interests are in quantum cryptography and quantum information theory. I am very interested in studying the quantum resources required to gain an advantage over a classical protocol in cryptographic applications. I am also interested in studying entropic uncertainty relations, and their applications to quantum cryptography. I am currently looking for motivated students at all levels to join my research group. If you are interested, please feel free to contact me. Project Software | Students | Publications | CV Project Software Publications Submitted (under review) R. Barreiro, W.O. Krawec, P. Mateus, N. Paunkovic, and A. Souto. Semi-Quantum Conference Key Agreement with GHZ-type states. pre-print available online: arXiv:2503.05045 Refereed Papers 2025 T.N. Thomas and W.O. Krawec. New Key Rate Bound for High-Dimensional BB84 with Multiple Basis Measurements. To appear: Proc. IEEE QCE 2025. Pre-print available online: arXiv:2504.11315 N. Rodrigues, W.O. Krawec, B. Lackey, D. Mukhopadhyay, and B. Wang. Quantum Public Key Encryption for NISQ Devices. To appear: Proc. IEEE QCE 2025. Pre-print available online: arXiv:2509.17758 W.O. Krawec. Quantum Conference Key Agreement with Classical Advantage Distillation. To appear: Discover Networks (Springer). Pre-print available online: arXiv:2503.24318 M. Bae, N. Panigrahy, P. Dhara, Md.Z. Hossain, W.O. Krawec, A. Russell, D. Towsley, and B. Wang. Blockwise Key Distillation in Satellite-based Quantum Key Distribution. IEEE Network. pre-print available online: arXiv:2307.04300 A. Harkness, W.O. Krawec, and B. Wang. Security of Partially Corrupted Repeater Networks. Quantum Science and Technology. 10(1):015005 pre-print available online: arXiv:2406.16651 S. Oslovich, B. Wang, W.O. Krawec, and K. Goodenough. Efficient Multiparty Quantum Key Distribution over Quantum Networks. To appear: Proc IEEE QCNC 2025. pre-print available online: arXiv:2404.19720 2024 R. Maule, N.K. Panigrahy, N.L. Anipeddi, P. Dhara, D. Kilbane, Md.Z. Hossain, W.O. Krawec, D. Towsley, and B. Wang. Fair and Efficient Scheduling Strategies for Satellite Assisted Quantum Key Distribution Systems. Proc IEEE QCE 2024, pp. 1788-1798. W.O. Krawec, B. Wang, and R. Brown. Finite Key Security of Simplified Trusted Node Networks. Proc IEEE QCE 2024, pp. 1777-1787. pre-print available online: arXiv:2404.17420 H. Iqbal and W.O. Krawec. New Security Proof of a Restricted High-Dimensional QKD Protocol. Proc. IEEE ISIT 2024, pp. 3118-3123. pre-print available online: arXiv:2307.09560 O. Amer, W.O. Krawec, V.U. Manfredi, and B. Wang. Dynamic Routing and Post-processing Strategies for Hybrid Quantum Key Distribution Networks. Proc. ICDCS 2024, pp. 1224-1235. pre-print available online: arXiv:2212.03144 M. Gado, M. Ismail, and W.O Krawec. Upgrading the Cyber Layer of Power Systems to Support Semi-Quantum Key Distribution. 2024 IEEE Power & Energy Society Innovative Smart Grid Technologies Conference (ISGT). 2023 W.O Krawec. A New Security Proof for Twin Field QKD. MDPI Applied Sciences, Invited Paper for Special Edition on Recent Development and Application of Quantum Communication and Security Protocols, Volume II. W.O Krawec. Entropic Uncertainty for Biased Measurements. Proc. IEEE QCE 2023. Pages 1220-1230. pre-print available online: arXiv:2305.09753 J. Guskind and W.O Krawec. Semi-Quantum Random Number Generation. Proc. IEEE QCE 2023. Pages 1211-1219 pre-print available online: arXiv:2210.16427 W.O Krawec, R. Liss, T. Mor. Security Proof Against Collective Attacks for an Experimentally Feasible Semi-Quantum Key Distribution Protocol. IEEE Transactions on Quantum Engineering, 2023. pre-print available online: arXiv:2012.02127 W. O. Krawec. Improving Bit Generation Rates for Quantum Random Number Generators. Proc. SPIE Quantum Information Science, Sensing, and Computation XV. Vol. 12517, pages 68-77, 2023. 2022 W. O. Krawec. Security of a High Dimensional Two-Way Quantum Key Distribution Protocol. Advanced Quantum Technologies, vol. 5 (10), pp. 2200024. pre-print available online: arXiv:2203.02989 O. Amer, W. O. Krawec, and V. Garg. A Standardized Design for Sifting in Quantum Key Distribution Software. Proc. IEEE Globecom Workshop on 6G-Quantum Communication Networks, 2022. Pages 808-813. S. Mutreja and W.O. Krawec. Improved Semi-Quantum Key Distribution with Two Almost-Classical Users. Quantum Information Processing, vol. 21 (9), pp. 319. pre-print available online: arXiv:2203.10567 Z. Tang, P. Zhang, W. O. Krawec. Enabling Resilient Quantum-Secured Microgrids through Software-Defined Networking. IEEE Transactions on Quantum Engineering, vol. 3, pp. 1-11. 2022 F. Massa, P. Yadav, A. Moqanaki, W. O. Krawec, P. Mateus, N. Paunkovic, A. Souto, and P. Walther. Experimental Quantum Cryptography With Classical Users. Quantum. Volume 6, pp. 819. pre-print available online: arXiv:1908.01780 J. Guskind and W.O. Krawec. Mediated Semi-Quantum Key Distribution with Improved Efficiency. Quantum Science and Technology. Volume 7(3) 035019. pre-print available online: arXiv:2111.01627 O. Amer and W.O. Krawec. High-Dimensional Quantum Conference Key Agreement. Proc. IEEE International Symposium on Information Theory (ISIT), 2022. pp. 1874-1879. pre-print available online: arXiv:2202.00140 Z. Tang, P. Zhang, W. O. Krawec, and L. Wang. Quantum Networks for Resilient Power Grids: Theory and Simulated Evaluation. IEEE Transactions on Power Systems, vol. 38 (2), pp. 1189-1204. 2022 W. O. Krawec. Quantum Random Number Generation with Practical Device Imperfections. Proc. SPIE Quantum Information Science, Sensing, and Computation XIV (12093) pp. 44-52. 2022 K. Yao, W.O. Krawec., and J. Zhu. Quantum Sampling for Finite Key Rates in High Dimensional Quantum Cryptography. IEEE Transactions on Information Theory, 68 (5) 2022, pp 3144-3163. pre-print available online: arXiv:2012.04151 2021 H. Iqbal and W.O. Krawec. Analysis of a High-Dimensional Extended B92 Protocol. Quantum Information Processing, 20 (344). 2021 pre-print available online: arXiv:2106.11460 M. Bae and W.O. Krawec. Source Independent Quantum Walk Random Number Generation. Proc. IEEE Information Theory Workshop (ITW) 2021 pp 1-6. Pre-print available online: arXiv:2102.02252 O. Amer, V. Garg, and W.O. Krawec. An Introduction to Practical Quantum Key Distribution. IEEE Aerospace and Electronic Systems Magazine 36 (3), 30-55. 2021 (PDF) Z. Tang, P. Zhang, and W. O. Krawec. A Quantum Leap in Microgrids Security: The Prospects of Quantum-Secure Microgrids. IEEE Electrification Magazine, vol. 9 (1), pp. 66-73, 2021 2020 O. Amer, W.O. Krawec., and B. Wang. Efficient Routing for Quantum Key Distribution Networks. Proc. IEEE International Conference on Quantum Computing and Engineering (QCE), pp. 137-147. 2020. pre-print available online: arXiv:2005.12404 H. Iqbal and W.O. Krawec. High-Dimensional Semi-Quantum Cryptography. IEEE Transactions on Quantum Engineering, vol. 1, pp. 1-17, 2020. pre-print available online: arXiv:1907.11340 S. Han, W.O. Krawec, and F. Miao. A Game Theoretic Security Framework for Quantum Cryptography: Performance Analysis and Application. Quantum Information Processing 19, 349 (2020). pre-print available online: (PDF) Z. Tang, P. Zhang, W. O. Krawec and Z. Jiang, Programmable Quantum Networked Microgrids. IEEE Transactions on Quantum Engineering, vol. 1, pp. 1-13, 2020. Z Tang, Y Qin, Z Jiang, W.O. Krawec, P Zhang. Quantum-Secure Microgrid. IEEE Transactions on Power Systems, vol. 36 (2), pp. 1250-1263, 2020. pre-print available online: arXiv:2001.02301 O. Amer and W.O. Krawec. Finite Key Analysis of the Extended B92 Protocol. Proc. IEEE International Symposium on Information Theory (ISIT), 2020, pp. 1944-1948. pre-print available online: arXiv:2001.05940 W. O. Krawec. A New High-Dimensional Quantum Entropic Uncertainty Relation with Applications. Proc. IEEE International Symposium on Information Theory (ISIT), 2020, pp. 1978-1983. pre-print available online: arXiv:2005.04773 W.O. Krawec and S.A. Markelon. A Semi-Quantum Extended B92 Protocol and its Analysis. Proc. SPIE 11391, Quantum Information Science, Sensing, and Computation XII, 113910G (24 April 2020) H. Iqbal and W.O. Krawec. Semi-Quantum Cryptography. Quantum Information Processing (2020) 19 (3), 97. pre-print available online: arXiv:1910.05368 Z. Tang, Y. Qin, Z. Jiang, W. O. Krawec, P. Zhang. Quantum-Secure Networked Microgrids. Proc. IEEE PES General Meeting, Aug. 2020 2019 W. O. Krawec. Quantum Sampling and Entropic Uncertainty. Quantum Information Processing (2019) 18 (12), 368. pre-print available online: arXiv:1804.08788 W. O. Krawec. Multi-Mediated Semi-Quantum Key Distribution. IEEE Globecom QCIT Workshop (GC Wkshps). 2019, pp. 1-6. (PDF) O. Amer and W.O. Krawec. Semi-Quantum Key Distribution with High Quantum Noise Tolerance. Physical Review A 100 (2) 022319. pre-print available online: arXiv:1812.04144 A. Gagliano, W.O. Krawec, and H. Iqbal. From Classical to Semi-Quantum Secure Communication. Proc. IEEE ISIT 2019, Paris France, pages 1707-1711. pre-print available online: arXiv:1901.01611 W.O. Krawec, S. Picek, and D. Jakobovic. Evolutionary Algorithms for the Design of Quantum Protocols. In Applications of Evolutionary Computation (EvoApplications) 2019. Lecture Notes in Computer Science, vol. 11454, Springer. 2018 C. Vlachou, W.O. Krawec, P. Mateus, N. Paunkovic, and A. Souto. Quantum Key Distribution with Quantum Walks. Quantum Information Processing (2018) 17:288. Pre-print available online: arXiv:1710.07979 W.O. Krawec and F. Miao. Game Theoretic Security Framework for Quantum Key Distribution. International Conference on Decision and Game Theory for Security. Springer, 2018. pp. 38-58. (PDF | Slides) W.O. Krawec and E. Geiss. S",
  "content_length": 15870,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:23"
}