{
  "name": "Walter Guttmann",
  "homepage": "http://www.cosc.canterbury.ac.nz/walter.guttmann",
  "status": "success",
  "content": "Walter Guttmann - Academic Staff - People - Computer Science and Software Engineering - University of Canterbury - New Zealand Study Why UC Admissions and Entry Courses, Subjects andQualifications Enrol at UC myUC Scholarships Learn (Moodle) Library Publications Courses Courses, Subjects andQualifications Subject list A-Z Bachelor's degrees Timetable Preparation courses Departments All Departments College of Arts College of Business and Law School of Business and Economics College of Education, Health and Human Development College of Engineering UC Health School of Law College of Science Service Areas Students Future Students International Students Postgraduate Students Current Students Research Research & Innovation Find an expert in UC SPARK Research Institutes and Research Centres Postgraduate Studies at UC NZi3 National ICT Innovation Institute UC High Performace Computing Library Teaching Learning and Teaching Library UC Teaching Awards Key Dates Learn (Moodle) Contact All University Contacts Media Contacts University Officers Liaison Computer Science and Software Engineering UC Home > Departments > College of Engineering > Computer Science and Software Engineering Study Courses Course Advice Grants and Scholarships For Prospective Students Undergraduate Students Postgraduate Students Visitors and Community About Computer Science and Software Engineering Contacts People Research Resources Seminars Conferences Occupational Safety and Health (OSH) Help! Walter Guttmann Position Associate Professor Qualifications Dipl.-Inf., Dr. rer. nat., PD Contact details Room: Erskine 300 Email: walter.guttmann@canterbury.ac.nz Phone: +64 3 36 92451 Fax: +64 3 364 2569 Postal address Computer Science and Software Engineering University of Canterbury Private Bag 4800 Christchurch 8140 New Zealand Courses COSC121 (2018-S2, 2017-S2, 2016-S2, 2015-S1, 2013-S2, 2012-S2) COSC261 (2025, 2024, 2023, 2022, 2021, 2020, 2019, 2018, 2017, 2016, 2015, 2014, 2013) COSC262 (2025, 2024, 2023, 2022, 2019, 2017) COSC366 (2014) COSC367 (2018, 2017) COSC432 (2025, 2024, 2022, 2021, 2020, 2018, 2017, 2016, 2014, 2013 as COSC473) COSC460 (2016, 2015, 2014, 2013) COSC461 (2017) COSC469 (2021) COSC470 (2024) MATH230 (2021, 2020) SENG365 (2014, 2013, 2012) SENG402 (2025, 2024, 2022, 2021, 2020, 2018) Course coordination COSC261 (2025, 2024, 2023, 2022, 2021, 2020, 2019, 2018, 2017, 2016, 2015, 2014, 2013) COSC432 (2025, 2024, 2022, 2021, 2020, 2018, 2017, 2016, 2014, 2013 as COSC473) COSC460 (2014, 2013) COSC461 (2018) COSC470 (2024, 2022, 2021, 2020) Research interests Algebra of Computing correctness and verification of software models formal methods of software engineering program transformation semantics of specification and programming languages Theoretical Computer Science ... information for prospective research students Programme committee memberships 22nd International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2026) 21th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2024) 20th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2023) 19th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2021) 18th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2020) 7th International Symposium on Unifying Theories of Programming (UTP 2019) 17th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2018), co-chair 16th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2017) 6th International Symposium on Unifying Theories of Programming (UTP 2016) 15th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2015) 5th International Symposium on Unifying Theories of Programming (UTP 2014) 14th International Conference on Relational and Algebraic Methods in Computer Science (RAMiCS 2014) Recent publications ... all publications Modal Algebra of multirelations (with H. Furusawa, G. Struth), JLC 35:3:exae023, 2025 An example of a goal-directed, calculational proof (with R. C. Backhouse, M. Winter), JFP 34:e13, 2024 Relation-Algebraic Verification of Disjoint-Set Forests, Fundamenta Informaticae 192(1):77-120, 2024 Determinism of multirelations (with H. Furusawa, G. Struth), JLAMP 139:100976, 2024 Cardinality and Representation of Stone Relation Algebras, AFP, 2023 Inner structure, determinism and modal algebra of multirelations (with G. Struth), AFP, 2023 Dependences between Domain Constructions in Heterogeneous Relation Algebras, RAMiCS 2023 Relation-algebraic verification of Borůvka's minimum spanning tree algorithm (with N. Robinson-O'Brien), LNCS 13027:225-240, RAMiCS 2021 Second-order properties of undirected graphs, LNCS 13027:209-224, RAMiCS 2021 Algebras for iteration, infinite executions and correctness of sequential computations, AFP, 2021 Relational Forests, AFP, 2021 Relational Minimum Spanning Tree Algorithms (with N. Robinson-O'Brien), AFP, 2020 Relational Characterisations of Paths (with R. Berghammer, H. Furusawa, P. Höfner), JLAMP 117:100590, 2020 Relational Disjoint-Set Forests, AFP, 2020 Relational Characterisations of Paths (with P. Höfner), AFP, 2020 Reasoning about Algebraic Structures with Implicit Carriers in Isabelle/HOL, LNCS 12167:251-268, IJCAR 2020 A Hierarchy of Algebras for Boolean Subsets (with B. Möller), LNCS 12062:152-168, RAMiCS 2020 Verifying the Correctness of Disjoint-Set Forests with Kleene Relation Algebras, LNCS 12062:134-151, RAMiCS 2020 A Hierarchy of Algebras for Boolean Subsets (with B. Möller), AFP, 2020 Connecting Fixpoints of Computations with Strict Progress, LNCS 11185:62-79, UTP 2019 Verifying Minimum Spanning Tree Algorithms with Stone Relation Algebras, JLAMP 101:132-150, 2018 Relational and Algebraic Methods in Computer Science, LNCS 11194, RAMiCS 2018 An Algebraic Framework for Minimum Spanning Tree Problems, TCS 744:37-55, 2018 Aggregation Algebras, AFP, 2018 Stone-Kleene Relation Algebras, AFP, 2017 Stone Relation Algebras, LNCS 10226:127-143, RAMiCS 2017 An Algebraic Approach to Multirelations and their Properties (with R. Berghammer), JLAMP 88:45-63, 2017 A Framework for Automating Security Analysis of the Internet of Things (with M. Ge, J. B. Hong, D. S. Kim), JNCA 83:12-27, 2017 Stone Relation Algebras, AFP, 2017 Relation-algebraic verification of Prim's minimum spanning tree algorithm, LNCS 9965:51-68, ICTAC 2016 Stone Algebras, AFP, 2016 An Algebraic Approach to Computations with Progress, JLAMP 85(4):520-539, 2016 Kleene Algebras with Domain (with V. B. F. Gomes, P. Höfner, G. Struth, T. Weber), AFP, 2016 Closure, Properties and Closure Properties of Multirelations (with R. Berghammer), LNCS 9348:67-83, RAMiCS 2015 A Relation-Algebraic Approach to Multirelations and Predicate Transformers (with R. Berghammer), LNCS 9129:50-70, MPC 2015 Infinite executions of lazy and strict computations, JLAMP 84(3):326-340, 2015 Programming contests International Collegiate Programming Contest ICPC South Pacific Competitive Programming Association SPCPA Internet Problem Solving Contest IPSC (1999-2018) Phone:Â +64 3 369 2777 Fax:Â +64 3 364 2569 CSSEadministration@canterbury.ac.nz Computer Science and Software Engineering University of Canterbury Private Bag 4800, Christchurch New Zealand Follow us © University of Canterbury Copyright and Disclaimer Privacy Feedback Help and Accessibility A-Z of University Websites",
  "content_length": 7553,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:24"
}