{
  "name": "Walter A. Kosters",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/walter-kosters#tab-2",
  "status": "success",
  "content": "Walter Kosters - Leiden University Skip to main content Walter Kosters Associate professor Name Dr. W.A. Kosters Telephone 071 5272727 E-mail w.a.kosters@liacs.leidenuniv.nl ORCID iD 0000-0001-8860-0390 I am an associate professor in computer science at LIACS, the Computer Science department of Universiteit Leiden. Current research interests include: neural networks, genetic algorithms, analysis of algorithms, concrete mathematics, NP-completeness, bioinformatics — so, data mining and artificial intelligence. More information about Walter Kosters PhD Candidates Hanjo Boekhout Visiting researcher News 23 November 2020 BNAIC/Benelearn conference big success 08 July 2017 Leiden University hosts world championship computer chess See also Personal website Former PhD candidates Mark van den Bergh Douwe Joost Broekens Tim Kristian Cocx Jiadong Lin Siegfried Nijssen Frank Takes Edgar Hubert de Graaf From 1976 until 1981 I studied Mathematics at Universiteit Leiden; during this period I also attended courses in Physics and Astronomy. My PhD Thesis in the field of mathematics (1985, supervised by Professor Gerrit van Dijk from Universiteit Leiden) is entitled \"Harmonic analysis on symmetric spaces\"; some keywords: Lie groups, Plancherel formulas, Fourier analysis, spherical distributions, special functions.  Later on I became interested in computer science, in particular analysis of algorithms and artificial intelligence. Associate professor Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact 071 5272727 w.a.kosters@liacs.leidenuniv.nl Publications No relevant ancillary activities Share on Facebook Share by Bluesky Share on LinkedIn Share by WhatsApp Share by Mastodon Organisation Science Leiden Institute of Advanced Computer Science (LIACS) Theory This website uses cookies. More information. Accept cookies Reject cookies",
  "content_length": 1920,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:26"
}