{
  "name": "Wangdong Yang",
  "homepage": "http://csee.hnu.edu.cn/people/yangwangdong",
  "status": "success",
  "content": "阳王东-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 阳王东 我的位置在： 首页 > 学院概况 > 师资力量 > 阳王东 教师介绍 博士，二级教授，博士生导师，入选国家高层次人才计划，湖南大学“岳麓学者”，主要研究领域为高性能计算、并行数值算法和程序性能优化，长期在天河一号，二号、三号国产超算平台以及鲲鹏、飞腾、MT、海光DCU、寒武纪和景嘉微GPU等国产处理器上进行并行算法的设计和应用，主持研制了一系列的基础数值算法函数库和性能优化工具。获的华为火花奖2项（线性方程组迭代方法与预条件的自动选择，面向ARM64平台应用源码矩阵化检测及优化工具），获得湖南省自然科学一等奖（面向人工智能的异构并行算法设计理论与方法）、二等奖（异构并行与分布式系统的任务调度理论和并行算法设计方法）、中国产学研合作创新成果一等奖（面向人工智能的大数据并行处理平台与应用）各1项。主持国家自然科学基金面上项目2项，国家自科基金重点项目1项，国家重点研发计划课题3项，湖南省重点研发计划项目等科研项目10多项，主持曙光、华为等企业合作项目6项。获得发明专利授权10多项，发表SCI/EI收录论文40多篇，其中SC、ICDE、TC、TPDS等CCF推荐的A类会议和期刊12篇。 中文名： 阳王东 英文名： 学历： 博士 职称： 教授 联系电话： 电子邮件： yangwangdong@hnu.edu.cn,yangwangdong@163.com 研究方向： 高性能计算，异构并行编程，并行数值算法，机器学习。团队与华为有着长期深入的合作，为硕士和博士提供华为多个部门直接的项目实习岗位；与国外多个大学和超算中心有着良好的合作关系，可以推荐访学与联培。 联系地址： 所属机构： 计算机科学系 学院教师 个人简历 一、主要研究领域1、基础数学库的研究1）建立了大规模稀疏矩阵非零元素分布的概率模型，提供了一个针对稀疏矩阵运算的局部性定量描述方法，克服了稀疏矩阵向量乘（SpMV）并行算法可扩展性低的实质困难。研制的SpMV算法在GPU上并行效率优于TOP 500 排名发起者、美国工程院院士JackDongarra 团队发表在Parallel Computing 的算法和NVIDIA 公司的CUDA 函数库cuSparse。并且完成了在申威26010和飞腾处理器上的适配和优化。2）研制了基于国产处理器平台的基础代数运算函数库BLAS和矩阵扩展运算库（LAPACK），可实现对国外开源或商业软件库的替代，性能整体达到部分超越国外开源或商业软件库。基于飞腾、鲲鹏、申威26010等国产处理器研制了基础数学函数库BLAS和LAPACK。在鲲鹏920处理器上的性能强于开源库OpenBLAS、AtlasBLAS和SuiteSparse，与目前最好的商业库Intel公司的MKL库齐平。3）研制了面向国产高性能计算系统的的张量运算库。在国产新一代高性能计算机部署了研制的并行张量运算库，性能较开源的张量库splatt有显著的性能提升，已经在国产新一代高性能计算机系统上完成张量库的大规模测试。4）基于国产超级计算系统研制了大规模线性方程组的异构并行求解算法。提供大规模线性方程组的异构并行求解算法，能够支撑百万核的国产自主高性能计算平台上的数值模拟仿真的并行计算。2、异构并行计算框架和并行程序优化1）基于鲲鹏、FT和MT等国产处理器研制了并行计算框架。该计算框架能够充分适配鲲鹏、FT和MT处理器的体系结构，在飞腾和鲲鹏处理器上的并行任务调度性能显著好于目前使用最广泛的OpenMP，同时相对于Intel公司的商业并行框架TBB也具有一定的性能优势。已经将研制的并行计算框架移植到国产E级新一代高性能计算机上，实现了大规模分布式异构计算资源的高效调度与负载平衡。2）面向NUMA结构的内存优化技术。针对具有NUMA结构的计算机系统，研制了能线程亲和及数据亲和的自适应机制，减少数据在NUMA节点之间的移动和远端数据访问，性能较C语言提供的标准内存分配函数有明显的性能提升。3）编译辅助的循环结构的并行优化。通过前端编译技术实现源代码中循环语句结构的自动识别，并且在IR中实现对循环结构转换为标准矩阵计算格式，然后针对不同处理器结构和指令系统进行并行代码转换和优化，以实现从源代码到不同处理器和指令系统的自动并行优化。3、智慧城市数值模拟计算与应用系统研制的共性算法库应用到城市大规模、高分辨率的数值模拟计算和交通视频、流量统计分析以及城市多源信息融合处理上，大幅提高系统的处理性能，并提高了交通违法行为自动识别率和路口流量预测精准性，达到国内领先水平。基于共性算法库和物联网+云计算技术开发了一系列智慧城市应用软件系统，应用于长沙、常德、益阳、南宁等多个城市，产生了显著的社会和经济效益。二、主持的主要项目1、横向项目1）华为公司委托项目《线性方程组迭代方法与预条件的自动选择》，2023.1-2023.12，主持。2）岳麓山大科城核心技术攻关揭榜挂帅项目《面向国产自主GPU的高性能基础软件栈》，2022.8-2024,7，主持。3）曙光公司委托项目，ghfund202107013482，CPU+GPU异构计算平台上张量运算库的移植和优化，2021.8-2022.7，主持。4）华为海思委托项目，YBN2019115120，LAPACK性能优化项目，2019.12-2020.12，主持。5）2018-2019，华为2012实验室委托项目，大规模城市混合交通视频处理，主持。6）2017-2018，华为2012实验室委托项目，基于华为AI处理器的多通道&高通量视频AI处理，主持。7）2013-2014，益阳市税务局委托项目，税务征管一体化数据分析平台，主持。8）2024-2027，华为公司委托项目，多级存储性能优化，主持。2、纵向项目1）国家自然科学基金委员会，重点项目，U21A20461，离子注入碳化硅半导体掺杂过程的高精度模拟仿真并行计算方法研究，2022.1至2025.12，主持。2） 科技部，国家重点研发计划课题，2019YFB2103004，城市群环保一体化物联网在线平台，2020.1-2022.12，主持。3）中国工程物理研究院，国防基础科研核科学挑战专题，TZZT2019-B2.1，模式驱动的自主CPU-加速器数值内核浮点优化方法，2019.11至2020.12，主持4）国家自然科学基金委员会，面上项目，61872127，面向高维数据空间的张量异构并行计算方法研究与探索，2019.1至2022.12，主持。5） 科技部，重点研发计划项目子课题，2018YFB1003401，面向大数据集的数据流编程模型及示范应用，2018.5至2020.4，主持。6）国家自然科学基金委员会，面上项目，61572175，高阶广义k-对角线性系统的异构协同并行求解算法研究与探索，2016.1至2019.12，主持。7）国家自然科学基金委员会，重点项目，61432005  ，面向激光聚变模拟的大规模异构众核系统可扩展并行算法与优化方法，2015.1至2019.12，参加。8）2015-2017，湖南省重点研发计划项目，城市汽车尾气扩散高分辨率数值模拟技术及对雾霾的影响度分析，主持。9）2018-2020，湖南省自然科学基金项目，大规模稀疏张量运算的异构并行算法研究与探索，主持。10）2013-2015，湖南省高校科研重点项目，城市交通流量预测的并行计算技术研究，主持。11）2023-2025，广东省核心软件攻关项目，面向安世亚太基于结构刚度矩阵的迭代法预处理AI优化融合新场景新技术，主持。三、主要研究成果1、主要论文列表：https://dblp.org/pid/84/8385.html2、发明专利：1）基于局部敏感哈希的并行矩阵分解计算实现方法，专利号：ZL201910428131.2；2）多物理耦合应用处理方法、装置、计算机设备以及存储介质，专利号：ZL201910526239.5；3）一种基于Flink的矩阵分解隐式反馈推荐方法和系统,专利号：ZL201910426635.0；4）基于博弈论的闲置云资源调度方法和装置,专利号：201910461609.1.5）分布式计算平台下基于QoS约束的视频流处理方法和系统，专利号：ZL202011303293.2。3、软件著作权：1）基于CORBA的交通信息集成中间件（2011SR009269）；2）基于GIS的城市交通业务综合管理客户端软件（2011SR050323）；3）基于Web的城市交通信息实时发布软件（2011SR050328）；4）城市道路交通流量监测和分析软件（2015SR144249）；5）面向大数据集的数据流编程工具（2021SR0498048）。4、获奖：1）2023，华为火花奖，面向ARM64平台应用源码矩阵化检测及优化工具；2）2022，华为火花奖，线性方程组迭代方法与预条件的自动选择；3）2023年，国家科技进步二等奖，《超算与智算融合计算关键技术及应用》4）2022，中国计算机学会科技成果特等奖，《面向多AI并发的高效异步并行处理技术及其超声影像实时智能判读应用》；5）2022，湖南省教学成果二等奖，《面向自主计算生态的多学科复合型人才培养体系构建和实践》；6）2021，湖南省自然科学二等奖，《异构并行与分布式系统的任务调度理论和并行算法设计方法》；7）2020，湖南省自然科学一等奖，《面向人工智能的异构并行算法设计理论与方法》；8）2019， 产学研合作创新成果一等奖，《面向人工智能的大数据并行处理平台与应用》；9）2017，湖南省科技进步三等奖，《城市智慧交通智能信息处理和数据融合关键技术》。 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 4555,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:27"
}