{
  "name": "Warut Suksompong",
  "homepage": "https://www.comp.nus.edu.sg/~warut",
  "status": "success",
  "content": "Warut Suksompong - NUS Computer Science Warut Suksompong NUS Presidential Young Professor School of Computing, National University of Singapore Email: warut at comp.nus.edu.sg [CV] I am an assistant professor in the School of Computing at the National University of Singapore. Previously, I was a postdoctoral researcher in computer science at the University of Oxford, hosted by Edith Elkind. I completed my PhD at Stanford University, where my advisor was Tim Roughgarden, and received my bachelor's and master's degrees from the Massachusetts Institute of Technology. My research interests include algorithmic game theory, computational social choice, mechanism design, and other problems at the interface between computer science, economics, mathematics, and operations research. News: I will be presenting a survey on \"Voting in Divisible Settings\" in the Senior Member Presentation Track of AAAI 2026. Please feel free to join! I received a Faculty Teaching Excellence Award in the NUS School of Computing in 2023, 2024, and 2025, and have been placed on the Honor Roll. I received an Outstanding Program Committee Member Award at ECAI 2025 (29 out of 2253 program committee members). PhD students: Karen Frilya Celine (current), Sheung Man Yuen (graduated) Postdocs: Jannik Peters (current), Xinhang Lu (former) Surveys and Overview Papers Voting in Divisible Settings: A Survey Warut Suksompong and Nicholas Teh In Proceedings of the 40th AAAI Conference on Artificial Intelligence (AAAI), Senior Member Presentation Track, January 2026, Forthcoming. [PDF] Weighted Fair Division of Indivisible Items: A Review Warut Suksompong Information Processing Letters, Vol. 187, January 2025, Article 106519. Special issue on Economics and Computation. [Journal] Expanding the Reach of Social Choice Theory Warut Suksompong In Proceedings of the 33rd International Joint Conference on Artificial Intelligence (IJCAI), Early Career Track, August 2024, pp. 8571-8576. [PDF] Constraints in Fair Division Warut Suksompong ACM SIGecom Exchanges, Vol. 19, No. 2, November 2021, pp. 46-61. [PDF] Tournaments in Computational Social Choice: Recent Developments Warut Suksompong In Proceedings of the 30th International Joint Conference on Artificial Intelligence (IJCAI), Survey Track, August 2021, pp. 4611-4618. [PDF] Publications On Multi-Level Apportionment Ulrike Schmidt-Kraepelin, Warut Suksompong, and Steven Wijaya Theory and Decision, Forthcoming. [Journal] [PDF] Discrepancy Beyond Additive Functions with Applications to Fair Division Alexandros Hollender, Pasin Manurangsi, Raghu Meka, and Warut Suksompong In Proceedings of the 17th Innovations in Theoretical Computer Science Conference (ITCS), January 2026, Forthcoming. The paper was accepted to the conference as a full paper but will be published as an abstract. [Conference] [PDF] Reconfiguring Proportional Committees Chris Dong, Fabian Frank, Jannik Peters, and Warut Suksompong In Proceedings of the 40th AAAI Conference on Artificial Intelligence (AAAI), January 2026, Forthcoming. [Conference] [PDF] Fair Allocation of Indivisible Goods with Variable Groups Paul Gölz, Ayumi Igarashi, Pasin Manurangsi, and Warut Suksompong In Proceedings of the 40th AAAI Conference on Artificial Intelligence (AAAI), January 2026, Forthcoming. [Conference] [PDF] Coordinating Charitable Donations with Leontief Preferences Felix Brandt, Matthias Greger, Erel Segal-Halevi, and Warut Suksompong Journal of Economic Theory, Vol. 230, December 2025, Article 106096. An abstract titled \"Balanced Donor Coordination\" appeared in Proceedings of the 24th ACM Conference on Economics and Computation (EC), July 2023, p. 299. The paper was accepted to the conference as a full paper. [Journal] [Conference] [PDF] Weighted Envy-Freeness for Submodular Valuations Luisa Montanari, Ulrike Schmidt-Kraepelin, Warut Suksompong, and Nicholas Teh Social Choice and Welfare, Vol. 65, No. 4, December 2025, pp. 983-1016. A preliminary version appeared in Proceedings of the 38th AAAI Conference on Artificial Intelligence (AAAI), February 2024, pp. 9865-9873. [Journal] [Conference] [PDF] Reforming an Unfair Allocation by Exchanging Goods Sheung Man Yuen, Ayumi Igarashi, Naoyuki Kamiyama, and Warut Suksompong In Proceedings of the 36th International Symposium on Algorithms and Computation (ISAAC), December 2025, pp. 54:1-54:21. [Conference] [PDF] Two-Sided Fairness in Many-to-One Matching Ayumi Igarashi, Naoyuki Kamiyama, Yasushi Kawase, Warut Suksompong, Hanna Sumita, and Yu Yokoi In Proceedings of the 21st Conference on Web and Internet Economics (WINE), December 2025, Forthcoming. The paper was accepted to the conference as a full paper but will be published as an abstract. [Conference] [PDF] Asymptotic Analysis of Weighted Fair Division Pasin Manurangsi, Warut Suksompong, and Tomohiko Yokoyama Theoretical Computer Science, Vol. 1054, November 2025, Article 115533. A preliminary version appeared in Proceedings of the 34th International Joint Conference on Artificial Intelligence (IJCAI), August 2025, pp. 3979-3987. [Journal] [Conference] [PDF] Differentially Private Fair Division Pasin Manurangsi and Warut Suksompong Artificial Intelligence, Vol. 347, October 2025, Article 104385. A preliminary version appeared in Proceedings of the 37th AAAI Conference on Artificial Intelligence (AAAI), February 2023, pp. 5814-5822. [Journal] [Conference] [PDF] Complexity of Round-Robin Allocation with Potentially Noisy Queries Zihan Li, Pasin Manurangsi, Jonathan Scarlett, and Warut Suksompong Information and Computation, Vol. 306, September 2025, Article 105332. A preliminary version appeared in Proceedings of the 17th International Symposium on Algorithmic Game Theory (SAGT), September 2024, pp. 520-537. [Journal] [Conference] [PDF] The Proportional Veto Principle for Approval Ballots Daniel Halpern, Ariel D. Procaccia, and Warut Suksompong In Proceedings of the 34th International Joint Conference on Artificial Intelligence (IJCAI), August 2025, pp. 3900-3907. [Conference] [PDF] Asymptotic Fair Division: Chores Are Easier Than Goods Pasin Manurangsi and Warut Suksompong In Proceedings of the 34th International Joint Conference on Artificial Intelligence (IJCAI), August 2025, pp. 3988-3995. [Conference] [PDF] Discrete Budget Aggregation: Truthfulness and Proportionality Ulrike Schmidt-Kraepelin, Warut Suksompong, and Markus Utke In Proceedings of the 34th International Joint Conference on Artificial Intelligence (IJCAI), August 2025, pp. 4040-4047. [Conference] [PDF] Ordinal Maximin Guarantees for Group Fair Division Pasin Manurangsi and Warut Suksompong Theoretical Computer Science, Vol. 1036, May 2025, Article 115151. A preliminary version appeared in Proceedings of the 33rd International Joint Conference on Artificial Intelligence (IJCAI), August 2024, pp. 2922-2930. [Journal] [Conference] [PDF] On the Fairness of Additive Welfarist Rules Karen Frilya Celine, Warut Suksompong, and Sheung Man Yuen In Proceedings of the 24th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), May 2025, pp. 454-462. [Conference] [PDF] Dividing a Graphical Cake Xiaohui Bei, Edith Elkind, Erel Segal-Halevi, and Warut Suksompong SIAM Journal on Discrete Mathematics, Vol. 39, No. 1, 2025, pp. 19-54. A preliminary version by Bei and Suksompong appeared in Proceedings of the 35th AAAI Conference on Artificial Intelligence (AAAI), February 2021, pp. 5159-5166. [Journal] [Conference] [PDF] Truthful Cake Sharing Xiaohui Bei, Xinhang Lu, and Warut Suksompong Social Choice and Welfare, Vol. 64, No. 1-2, February 2025, pp. 309-343. Special issue on Fair Public Decision Making: Allocating Budgets, Seats, and Probability. A preliminary version appeared in Proceedings of the 36th AAAI Conference on Artificial Intelligence (AAAI), February-March 2022, pp. 4809-4817. [Journal] [Conference] [PDF] Reachability of Fair Allocations via Sequential Exchanges Ayumi Igarashi, Naoyuki Kamiyama, Warut Suksompong, and Sheung Man Yuen Algorithmica, Vol. 86, No. 12, December 2024, pp. 3653-3683. A preliminary version appeared in Proceedings of the 38th AAAI Conference on Artificial Intelligence (AAAI), February 2024, pp. 9773-9780. [Journal] [Conference] [PDF] Approximate Envy-Freeness in Graphical Cake Cutting Sheung Man Yuen and Warut Suksompong Discrete Applied Mathematics, Vol. 357, November 2024, pp. 112-131. A preliminary version appeared in Proceedings of the 32nd International Joint Conference on Artificial Intelligence (IJCAI), August 2023, pp. 2923-2930. [Journal] [Conference] [PDF] Weighted Fairness Notions for Indivisible Items Revisited Mithun Chakraborty, Erel Segal-Halevi, and Warut Suksompong ACM Transactions on Economics and Computation, Vol. 12, No. 3, September 2024, Article 9. A preliminary version appeared in Proceedings of the 36th AAAI Conference on Artificial Intelligence (AAAI), February-March 2022, pp. 4949-4956. [Journal] [Conference] [PDF] The Price of Justified Representation Edith Elkind, Piotr Faliszewski, Ayumi Igarashi, Pasin Manurangsi, Ulrike Schmidt-Kraepelin, and Warut Suksompong ACM Transactions on Economics and Computation, Vol. 12, No. 3, September 2024, Article 11. A preliminary version appeared in Proceedings of the 36th AAAI Conference on Artificial Intelligence (AAAI), February-March 2022, pp. 4983-4990. [Journal] [Conference] [PDF] [Code] Fair Division with Two-Sided Preferences Ayumi Igarashi, Yasushi Kawase, Warut Suksompong, and Hanna Sumita Games and Economic Behavior, Vol. 147, September 2024, pp. 268-287. A preliminary version appeared in Proceedings of the 32nd International Joint Conference on Artificial Intelligence (IJCAI), August 2023, pp. 2756-2764. [Journal] [Conference] [PDF] Welfare Loss in Connected Resource Allocation Xiaohui Bei, Alexander Lam, Xinhang Lu, and Warut Suksompong In Proceedings of the 33rd International Joint Conference on Artificial Intelligence (IJCAI), August 2024, pp. 2660-2668. [Conference] [PDF] Optim",
  "content_length": 31057,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:31"
}