{
  "name": "Wayne Wobcke",
  "homepage": "http://www.cse.unsw.edu.au/~wobcke",
  "status": "success",
  "content": "Wayne Wobcke's Home Page Contact Office: Building K17, Room 401F Postal address: School of Computer Science and Engineering University of New South Wales Sydney NSW 2052 Australia E-mail: w.wobcke@unsw.edu.au About Wayne Wobcke is an Associate Professor in the School of Computer Science and Engineering at the University of New South Wales, specializing in Artificial Intelligence and Data Science. His research ranges from theory (intelligent agents, data mining, agent-based modelling), to practice (dialogue management, personal assistants, recommender systems, computational social science). He has over 100 publications and has received over $6 million in research funding, winning a PAKDD best paper runner up award and a AAAI deployed application award for work on people-to-people recommender systems. He has served as Programme Committee Chair of two major Artificial Intelligence conferences (Australasian AI and PRIMA) and two keynote addresses at international workshops, on intelligent agents in healthcare and social media analytics. His industry experience began at British Telecom Labs in the UK where he was part of a team that won a British Computer Society Medal for Innovation in Information Technology. Since joining UNSW in 2002, he has collaborated extensively with industry, serving for over 10 years as Programme Manager and Project Leader in two CRCs (Smart Internet Technology CRC and Smart Services CRC), leading a team of seven academic and research staff. A highlight of Smart Internet Technology CRC was the development in 2004 of a voice controlled mobile application for interaction with e-mail and calendar (a precursor to Apple's Siri). A major achievement through Smart Services CRC was the deployment of a people-to-people recommender system for suggesting suitable matches in online dating, fielded in 2012 on one of Australia's largest online dating sites. Subsequently, he worked with Data to Decisions CRC, leading a multi-disciplinary team of data scientists and social scientists researching: (i) efficient methods for extracting information from high velocity streams of text data (such as social media and news feeds) to build up a knowledge base of information about entities, places and events, and (ii) methods to determine sentiment and stance (orientation towards political issues) from social media posts. His current work focuses on the use of data science in humanitarian contexts and the use of machine learning in official statistics, in collaboration with BPS (Statistics Indonesia) and STIS (Politeknik Statistika, Indonesia). Qualifications Ph.D. Computer Science, University of Essex, 1989: A Logical Approach to Schema-Based Inference. M.Sc. Computer Science, University of Queensland, 1985: Logic Programming and Language Specification. B.Sc. (Hons) Mathematics/Computer Science, University of Queensland, 1984. Awards Best Paper Nomination, 11th Workshop on Argument Mining, 2024. UNSW Arc Postgraduate Research Supervisor Award, 2017, 2018. Data to Decisions CRC Recognition Award, 2016, 2017. AAAI Deployed AI Application Award, Twenty-Sixth Annual Conference on Innovative Applications of Artificial Intelligence, 2014. Best Application Paper Runner up, 17th Pacific-Asia Conference on Knowledge Discovery and Data Mining, 2013. British Computer Society Medal for Innovation in Information Technology, 1998. Visiting Positions Senior Specialist – Quantitative Analysis and Modelling, United Nations Development Programme, 2019. Fellow, Department of Computer Science, University of Essex, 1998–1999. Honorary Institute Fellow, Microsoft Institute of Advanced Software Technology, 1992–1999. Visiting Scholar, Department of Computer Science, Queen Mary and Westfield College, 1998. Visiting Scholar, Center for the Study of Language and Information, Stanford University, 1993. Highlights Machine Learning for Official Statistics Machine Learning for Poverty Targeting (2025) UN ESCAP Project on Rice Production Estimation (Video) (2025) Computational Social Science Gendered Biases in Australian Family Law Court Judgments (2025) Event Extraction for Conflict Analysis (2025) Stance Detection for Facebook Groups (2022) Recommender Systems Online Dating Recommender System (2015) Link Prediction for Recommendation in Social Networks (2012) Intelligent Agent Theory Logic of Intention and Action for BDI Agents (2015) Risk Assessment in Sociotechnical Systems (2011) Intelligent Personal Assistants Smart Personal Assistant on a PDA (Video) (2006) Agent-Based Approach to Dialogue Management (2005) Logic and Knowledge Representation Two Logical Theories of Plan Recognition (2002) Information-Based Theory of Conditionals (2000) Belief Revision, Conditional Logic and Nonmonotonic Reasoning (1995) Research Grants Australian Research Council Discovery Project, 2018–2023 (F. Johns, W. Wobcke and D. Nelken): Data Science in Humanitarianism: Confronting Novel Law & Policy Challenges, $536 973. Linkage Project, 2007–2009 (E. Coiera, J. Westbrook, W. Wobcke and F. Magrabi): Agent-Based Methods for Communication System Design in Complex Organisations, $554 194. Discovery Project, 2003–2005: Reasoning about Rational Agents from a Programming Languages Perspective, $172 473. Linkage Project, 2002–2004 (with R. Johnston, R. Rönnquist and E. Sonenberg): Agent-Based Frameworks for Coordinated Activities in E-Business: Supply Chain Management and Workflow Applications, $112 725. Large Grant, 1996–1998 (A. Sattar, W. Wobcke and A. Rao): Dynamics of Mental States in Rational Agent Architectures, $167 000. Small Grant, 1994–1995: Modelling Rational Agency and Communication using Situation Semantics, $14 000. Small Grant, 1992–1993: Nonmonotonic Reasoning in a Belief Revision System, $33 500. Small Grant, 1990: A First-Order Theory of Knowledge for a Modal Database, $19 009. Data to Decisions CRC Knowledge Mining, 2016–2019 (with M. Bain and S. Schmeidl): $939 319. Text Analytics, 2015 (with M. Bain): $146 055. Smart Services CRC Data Markets, 2014 (with M. Bain): $125 957. Personalisation, 2008–2014 (with M. Bain, A. Mahidadia and P. Compton): $1 452 724. Smart Internet Technology CRC Interim Personalisation Project, 2007–2008: $45 829. Evaluation of E-Mail Management Assistant, 2007: $14 950. Dialogue Construction with Ripple Down Rules, 2006: $21 357. Adaptive Mobile Personal Assistants, 2005–2007 (with P. Compton): $903 895. Document Categorization with Ripple Down Rules, 2004–2005: $15 000. An Agent Architecture for the Coordination of Personal Assistants, 2003–2004: $344 000. Other External Funding UNSW Science Social Good Seed Fund and LexisNexis, 2022–2023 (Y. Fan et al.): Detecting Gender Bias in Language Used in Legal Judgments and Proceedings, $35 000. John T. Reid Charitable Trusts, 2021–2022 (S. Onie et al.): Natural Language Processing for Psychological Assessment Triage (Oracle), $34 500. CSIRO Division of Information Technology Collaborative Research Grant, 1990 (N. Foo, W. Wobcke, M. Wise and S. Sevinc): Knowledge Processing, $41 000. University Internal Schemes UNSW VC Strategic Research Seed Fund, 2025 (with S. Mariyah, N. Tzavidis and C. Lloyd): Empirically Evaluating the Reliability of WorldPop Poverty Maps, $44 785. UNSW Research Infrastructure Scheme, 2017 (J. Xue et al.): High-Performance Computing for Security Analysis, Data Analytics, IoT and Machine Learning, $134 429. Schools of Social Sciences and Computer Science and Engineering Joint Research Seed Fund, 2015 (with S. Schmeidl): Machine Learning for Classifying Conflict Drivers, $10 000. UNSW Major Research Equipment and Infrastructure Initiative, 2014 (A. Sowmya, M. Ryan, N. Marcus, C. Sammut and W. Wobcke): Visualisation and Human-Machine Interaction Laboratory, $99 420. Publications Machine Learning for Official Statistics Mariyah, S. & Wobcke, W. (2025) Selective Guided Domain Adaptation for Improving the Proxy Means Test for Poverty Targeting. International Journal of Data Science and Analytics, 20, 5999–6017. Mariyah, S. & Wobcke, W. (2025) Evaluating Area-Level Features for Proxy Means Test Models: Evidence from Rural, Semi-Urban and Urban Districts in Poverty Targeting. Journal of Computational Social Science, 8, 74. Mariyah, S. & Wobcke, W. (2024) WeightedMMoE: Weighted Multi-Gate Mixture of Experts for Multi-Source Unsupervised Domain Adaptation. Proceedings of the 2024 IEEE International Conference on Big Data, 2188–2196. Mariyah, S. & Wobcke, W. (2024) Domain Adaptation with Joint Loss for Consistent Regression and Ordinal Classification in the Proxy Means Test for Poverty Targeting. Proceedings of the Thirty-Third International Joint Conference on Artificial Intelligence, 7403–7411. Wobcke, W. & Mariyah, S. (2023) Machine Learning and Data Augmentation in the Proxy Means Test for Poverty Targeting. Statistical Journal of the IAOS, 39, 961–977. Wobcke, W., Compton, C., Johns, F., Lamchek, J. & Mariyah, S. (2023) Nowcasting for Hunger Relief: A Study of Promise and Perils. Information Technology for Development, 29, 27–47. Computational Social Science Akand, E., Fan, Y., Wobcke, W., Sisson, S.A. & San Roque, M. (2025) Diversity on the Bench: An Analysis of Gendered Biases in the Language of Australian Family Law Court Judgments. PLOS One, 20(8), e0331841. Calvo Martinez, J. & Wobcke, W. (2025) Stream Mining with Integrity Constraint Learning for Event Extraction in Evolving Data Streams. Knowledge and Information Systems, 67, 2595–2618. Wobcke, W. & Krzywicki, A. (2022) Empirical Software Engineering for Evaluating Adaptive Task-Oriented Personal Assistants: A Case Study in Human/Machine Event Extraction and Coding. International Journal of Agent-Oriented Software Engineering, 7, 184–216. Kannangara, S. & Wobcke, W. (2022) Determining Political Interests of Issue-Motivated Groups on Social Media: Joint Topic Models for Issues, Sentiment and Stance. Journal of Computational Social Science, 5, 811–840. Kannangara, S. & Wobcke, W. (2019) Weakly Supervised Joint",
  "content_length": 35719,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:40"
}