{
  "name": "Wee Sun Lee",
  "homepage": "https://www.comp.nus.edu.sg/~leews",
  "status": "success",
  "content": "Lee Wee Sun's Homepage Lee Wee Sun Professor Department of Computer Science Computing 1 13 Computing Drive Singapore 117417 Republic of Singapore Biography Office: COM3 02-28 Phone: +65 6516 4526 Fax: +65 6779 4580 Email: dcsleews@nus.edu.sg Calendar Teaching CS3263 Foundations of Artificial Intelligence CS3244 Machine Learning Research Interests Machine Learning Planning Under Uncertainty Software Factor Graph Neural Networks Tensor Belief Propagation POMDP Higher Order CRF Conference Organization Algorithmic Learning Theory and Discovery Science 2013 Asian Conference on Machine Learning 2012 Machine Learning Summer School 2011 Publications Google Scholar Tutorials Message Passing in Machine Learning Group Members Muhammad Rizki Aulia Rahman Maulana (PhD Student) Siddharth Aravindan (PhD Student) Mohammed Haroon Dupty (PhD Student) Dixant Mittal (PhD Student) Chong Yihui (PhD Student) Goh Yong Liang (PhD Student) Dong Yanfei (PhD Student) Zhao Zirui (PhD Student) Zhou Yang (Postdoc) Ishant Shanu (Postdoc) Previous Group Members Zhang Zhen (Postdoc) University of Adelaide He Ruidan (PhD Student) NLP Scientist at Alibaba DAMO Academy Neha Garg (PhD Student) Rehablitation Research Institute of Singapore Li Juekun (PhD), XYZ Robotics Lim Zhan Wei (PhD), Grab Nguyen Viet Cuong (PhD), Applied Scientist, Amazon Web Services Ankit Goyal (MSc) Philip Beh (MSc) Ye Nan (PhD), Lecturer, University of Queensland Nguyen Dinh Truong Huy (PhD), Software Engineer, Google Wang Yi (Postdoc), Principal Technologist, Rolls-Royce Ngo Anh Vien (Postdoc), Lecturer, Queen's University Belfast Sylvie Ong (Postdoc), Research Engineer, Nuance Communication Wu Dan (PhD), Assistant Vice President, Citibank Lu Wei (PhD), Assistant Professor, Singapore University of Design and Technology Chieu Hai Leong (PhD), Principal Member of Technical Staff, DSO National Laboratories. Lim Yew Jin (PhD), Principal Software Engineer, Google Mountain View. Teh Yee Whye (LKY Postdoc), Professor, University of Oxford Yin Xinyi (PhD), Founder and CEO, Mozat Pte. Ltd. Upali Kohomban (PhD), Head of Research, Codegen Zhang Xinhua (MSc), Researcher, NICTA Dell Zhang (Postdoc), Reader, Birbeck College, University of London. Yu Xiaoxue (MEng) Wang Yun Yan (MSc)Cen Cen (MSc)Wu Haoran (MSc) Last modified: 6 Sept 2015",
  "content_length": 2301,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:43"
}