{
  "name": "Wei-Long Zheng",
  "homepage": "https://weilongzheng.github.io",
  "status": "success",
  "content": "Wei-Long Zheng Search Wei-Long Zheng Associate Professor, PhD advisor Shanghai Jiao Tong University Biography Always looking for highly-motivated students and postdocs to join our team to work on understanding how the brain works! Feel free to email me if you are interested! Hi, I am currently a Tenured-Track Associate Professor in Department of Computer Science and Engineering, Shanghai Jiao Tong University. My lab is Center for Brain-like Computing and Machine Intelligence (BCMI). My research interests cover the broad areas of affective brain-computer interfaces, computational neuroscience, machine learning, AI, clinical healthcare, and biomedical engineering. Prior to SJTU, I was a Postdoc Associate in Department of Brain and Cognitive Science at Massachusetts Institute of Technology (MIT). I worked with Michael Halassa and Robert Yang on developing computational models for thalamocortical interactions in cognition. I was also a research fellow in Department of Neurology, Massachusetts General Hospital, Harvard Medical School, working with M Brandon Westover, MD, PhD. I obtained my PhD degree in the Center for Brain-Like Computing and Machine Intelligence, Department of Computer Science, Shanghai Jiao Tong University, China, supervised by Bao-Liang Lu.I obtained my Bachelor degree from Talented Student Program in Department of Electronic and Information Engineering, South China University of Technology, China. I was a visiting researcher in The Cichocki Laboratory for Advanced Brain Signal Processing, Brain Science Institute, RIKEN, Japan, and in Intelligent Systems Group, Department of Computer Science and Artificial Intelligence, University of the Basque Country, Spain. Interests Affective Computing Brain-Computer Interactions Computational Neuroscience Artificial Intelligence Machine Learning Clinical Healthcare Education Postdoc Associate, 2021 Massachusetts Institute of Technology, USA Research Fellow, 2020 Massachusetts General Hospital, USA PhD in Computer Science, 2018 Shanghai Jiao Tong University, China BE in Electrical Engineering, 2012 South China University of Technology, China Featured Publications List of all publications >> Yiting Wang, Jia-Wen Liu, Bao-Liang Lu, Wei-Long Zheng (2024). From EEG to Eye Movements: Cross-modal Emotion Recognition Using Constrained Adversarial Network with Dual Attention. IEEE Transactions on Affective Computing. PDF Cite Wei-Long Zheng, Zhongxuan Wu, Ali Hummos, Guangyu Robert Yang, Michael M Halassa (2024). Rapid context inference in a thalamocortical model using recurrent neural networks. Nature Communications. PDF Cite Code Xuanhao Liu, Yan-Kai Liu, Yansen Wang, Kan Ren, Hanwen Shi, Zilong Wang, Dongsheng Li, Bao-liang Lu, Wei-Long Zheng (2024). EEG2Video: Towards Decoding Dynamic Visual Perception from EEG Signals. The Thirty-eighth Annual Conference on Neural Information Processing Systems. PDF Cite Rui Li, Yiting Wang, Wei-Long Zheng, Bao-Liang Lu (2022). A Multi-view Spectral-Spatial-Temporal Masked Autoencoder for Decoding Emotions with Self-supervised Learning. Proceedings of the 30th ACM International Conference on Multimedia. PDF Cite Xun Wu, Wei-Long Zheng, Ziyi Li, Bao-Liang Lu (2022). Investigating EEG-based functional connectivity patterns for multimodal emotion recognition. Journal of Neural Engineering. PDF Cite Wei-Long Zheng*, Edilberto Amorim*, Jin Jing, Ona Wu, Mohammad Ghassemi, Jong Woo Lee, Adithya Sivaraju, Trudy Pang, Susan T. Herman, Nicolas Gaspard, Barry J. Ruijter, Marleen C. Tjepkema-Cloostermans, Jeannette Hofmeijer, Michel J.A.M. van Putten, M. Brandon Westover (2021). Predicting Neurological Outcome from Electroencephalogram Dynamics in Comatose Patients after Cardiac Arrest with Deep Learning. IEEE Transactions on Biomedical Engineering (*contributed equally as joint first authors). PDF Cite Code DOI Wei-Long Zheng*, Edilberto Amorim*, Jin Jing, Wendong Ge, Shenda Hong, Ona Wu, Mohammad Ghassemi, Jong Woo Lee, Adithya Sivaraju, Trudy Pang, Susan T. Herman, Nicolas Gaspard, Barry J. Ruijter, Jimeng Sun, Marleen C. Tjepkema-Cloostermans, Jeannette Hofmeijer, Michel J.A.M. van Putten, M. Brandon Westover (2021). Predicting Neurological Outcome in Comatose Patients after Cardiac Arrest with Multiscale Deep Neural Networks. Resuscitation (*contributed equally as joint first authors). PDF Cite Code DOI Jennifer A. Kim, Wei-Long Zheng, Jonathan Elmer, Jin Jing, Sahar F. Zafar, Manohar Ghanta, Valdery Moura Junior, Emily J. Gilmore, Lawrence J. Hirsch, Aman Patel, Eric Rosenthal, M. Brandon Westover (2021). High epileptiform discharge burden predicts delayed cerebral ischemia after subarachnoid hemorrhage. Clinical Neurophysiology. PDF Cite DOI Wei-Long Zheng, Haoqi Sun, Oluwaseun Akeju, M Brandon Westover (2019). Adaptive Sedation Monitoring from EEG in ICU Patients with Online Learning. IEEE Transactions on Biomedical Engineering. PDF Cite DOI Wei-Long Zheng, Kunpeng Gao, Gang Li, Wei Liu, Chao Liu, Jing-Quan Liu, Guoxing Wang, Bao-Liang Lu (2019). Vigilance Estimation Using a Wearable EOG Device in Real Driving Environment. IEEE Transactions on Intelligent Transportation Systems. PDF Cite Dataset Project DOI Wei-Long Zheng (2018). Affective Brain-Computer Interactions. Ph.D. Thesis, Shanghai Jiao Tong University, China. PDF Cite Project Wei-Long Zheng, Wei Liu, Yifei Lu, Bao-Liang Lu, Andrzej Cichocki (2018). Emotionmeter: A multimodal framework for recognizing human emotions. IEEE Transactions on Cybernetics. PDF Cite Dataset Project DOI Wei-Long Zheng, Jia-Yi Zhu, Bao-Liang Lu (2017). Identifying stable patterns over time for emotion recognition from EEG. IEEE Transactions on Affective Computing. Preprint PDF Dataset Project Poster DOI Wei-Long Zheng, Bao-Liang Lu (2017). A multimodal approach to estimating vigilance using EEG and forehead EOG. Journal of Neural Engineering. Preprint PDF Cite Dataset Project DOI Wei-Long Zheng, Bao-Liang Lu (2016). Personalizing EEG-based affective models with transfer learning. Twenty-Fifth International Joint Conference on Artificial Intelligence. PDF Cite Project Yifei Lu*, Wei-Long Zheng*, Binbin Li, Bao-Liang Lu (2015). Combining eye movements and EEG to enhance emotion recognition. Twenty-Fourth International Joint Conference on Artificial Intelligence (*contributed equally as joint first authors). PDF Cite Project Wei-Long Zheng, Bao-Liang Lu (2015). Investigating critical frequency bands and channels for EEG-based emotion recognition with deep neural networks. IEEE Transactions on Autonomous Mental Development (2018 IEEE TAMD Outstanding Paper Award). PDF Cite Dataset Project DOI Wei-Long Zheng, Jia-Yi Zhu, Yong Peng, Bao-Liang Lu (2014). EEG-based emotion classification using deep belief networks. IEEE International Conference on Multimedia and Expo (ICME). PDF Cite Code Project Poster DOI Projects Affective Brain-Comouter Interactions Multimodal emotion recognition using EEG and eye movements. Building and Understanding the Brain Develop recurrent neural networks with a thalamus-like component and synaptic plasticity rules to model the thalamocortical interactions in cognitive flexibility. Critical Care Neurophysiology Continuous brain monitoring to identify neural dynamics and predict neuological outcomes for critically ill patients. Delayed Cerebral Ischemia Prediction Predict delayed cerebral ischemia after subarachnoid hemorrhage with quantitative EEG. Clinical Healthcare Time series signal analysis and machine learning to improve clinical healthcare. Coma Prognostication Investigate the relationship between various EEG patterns and coma outcomes for patients after cardiac arrest. Vigilance Estimation Multimodal Vigilance Estimation using EEG and EOG: From Simulated To Real Environments. Transfer Learning Transfer learning algorithms are used to tackle individual differences across subjects and sessions and non-stationary characteristics of EEG. Datasets SEED-DV We build a new dataset SEED-DV, recording 20 subjects EEG data when viewing 1400 video clips of 40 concepts for dynamic visual perception decoding. SEED-VII SJTU Emotion EEG Dataset (SEED) of seven emotions: positive, neutral, negative, disgust, fear, surprise, and anger. I-CARE I-CARE: International Cardiac Arrest REsearch consortium Database for Predicting Neurological Recovery from Coma After Cardiac Arrest. SEED-V SJTU Emotion EEG Dataset (SEED-V) of five emotions: happy, sad, fear, disgust and neutral. SEED-IV SJTU Emotion EEG Dataset (SEED-IV) of four emotions: happy, sad, fear, and neutral. SEED-VIG A Multimodal Dataset with EEG and Forehead EOG for Vigilance Estimation (SEED-VIG). SEED SJTU Emotion EEG Dataset (SEED) of three emotions: positive, neutral, and negative. Professional Services Program Committee ACII 2023, IJCAI 2023 AAAI 2021 IJCAI-PRICAI 2020 AAAI 2020 IJCAI 2019 IJCAI 2018 Editorial Board Associate Editor of IEEE Transactions on Affective Computing Associate Editor of Frontiers in Human Neuroscience Review Editor of Frontiers in Neuroergonomics Membership IEEE Member (2019-) IEEE Student Member (2014-2018) Journal Reviewer Nature Computational Science IEEE Transactions on Affective Computing IEEE Transactions on Cognitive and Developmental Systems IEEE Transactions on Neural Networks and Learning Systems Journal of Neural Engineering IEEE Transactions on Biomedical Engineering Journal of Biomedical and Health Informatics IEEE Transactions on Intelligent Transportation Systems Conference External Reviewer ICLR 2025, IJCAI 2023, CHI 2023, AAAI’21, IJCAI’20, AAAI’20, IJCAI’19, ISNN’19, IJCAI’18, ACII’17, ICONIP’16, ICONIP’15, ICONIP’14 Teaching Neural Network Theory and Applications Artificial Intelligence Foundation of Data Science Honors and Awards NSFC Excellent Young Scientists Fund Overseas Program 2022 Shanghai Pujiang Program 2022 MSRA Star Track Program 2022 ACM Multimediea Top Paper Award 2022 Wu Wen Jun AI Science and Technology Award, First Prize 2021 Outstanding Reviewer Award for Journal of ",
  "content_length": 10925,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:50"
}