{
  "name": "Wei-Chung Hsu",
  "homepage": "https://sds.cuhk.edu.cn/en/teacher/1029",
  "status": "success",
  "content": "HSU, Wei Chung | School of Data Science SEARCH SDSÂ Portal Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes SDSÂ Portal CUHK-Shenzhen ç®ä½ä¸­æ HSU, Wei Chung ProfessorCourse Coordinator - Computer Science and Engineering Education Background Ph.D. University of WisconsinâMadison Academic Area Computer Science, Machine Learning and Artificial Intelligence, Computer Systems and Cloud Computing Research Field Optimizing Compilers, Dynamic Binary Translation and Optimization, Virtualization and Virtual Machines, High Performance Computer Architectures Email hsuweichung@cuhk.edu.cn Office Room 509a, Daoyuan Building Biography Wei Chung Hsu received his PhD degree in computer science from the University of Wisconsin, Madison, in 1987. Prior to joining the SDS, CUHKSZ, he was working at Intel, USA. From 2021 to 2022, he was a consultant at the Andes Technology. From 2013 to 2021, he was a professor at the department of Computer Science and Information Engineering, at the National Taiwan University. From 2009 to 2013, he was a professor and director at the National Chiao-Tung University, Taiwan, China. From 1999 to 2009, he was a professor at the Computer Science and Engineering Department, at University of Minnesota, Twin Cities. From 1997 to 1999, he was a runtime optimization architect in the California Language Lab, at Hewlett Packard Company. From 1993 to 1997, he was a technical lead in the compiler team which developed and released an optimizing compiler for the HP PA-8000 systems. Prior to joining HP, he was a senior architect at Cray Research, in Chippewa Falls, Wisconsin. Academic Publications Selected Conference PapersYi You, Pangfeng Liu, Ding-Yong Hong, Jan-Jan Wu and Wei-Chung Hsu âAccelerating Convolutional Neural Networks via Inter-operator Schedulingâ, IEEE ICPADS, 2022, (Best Paper runner up).Yu-Ping Liu, Ding-Yong Hong, Jan-Jan Wu, Sheng-Yu Fu, and Wei-Chung Hsu, âExploiting Asymmetric SIMD Register Configurations in ARM-tox86 Dynamic Binary Translationâ,26th IEEE International Conference on Parallel Architectures and Compilation Techniques (PACT), Portland, Oregon, USA, 2017Ding-Yong Hong, Sheng-Yu Fu, Yu-Ping Liu, Jan-Jan Wu, Wei-Chung Hsu, âExploiting Longer SIMD Lanes in Dynamic Binary Translationâ, IEEE ICPADS, 2016. (Best Paper Award).Yu-Ju Huang, Hsuan-Heng Wu, Yeh-Ching Chung, Wei Chung Hsu, âBuilding A KVM- based Hypervisor for A Heterogeneous System Architecture Compliant Systemâ, ACM Virtual Execution Environment, VEEâ2016, Atlanta, USA, 2016, (Outstanding Paper Award).James R. Goodman and Wei-Chung Hsu: âAuthor retrospective for code scheduling and register allocation in large basic blocksâ. the International Conference on Supercomputing, (ICS) 25th Anniversary 2014Ding-Yong Hong, Jan-Jan Wu, Pen-Chung Yew, Wei-Chung Hsu, Chun-Chen Hsu, Pangfeng Liu, Chien-Min Wang, and Yeh-Ching Chung,â HQEMU: A Multi-Threaded and Retargetable Dynamic Binary Translator on Multicoresâ, Proceedings of the Tenth Annual IEEE/ACM International Symposium on Code Generation and Optimization, (CGO-2012), Apr. 2012Jiun-Hung Ding, Po-Chun Chang, Wei-Chung Hsu, Yeh-Ching Chung, âPQEMU: A Parallel System Emulator Based on QEMUâ,IEEE International Conference on Parallel and Distributed Systems, ICPADS 2011, Dec., 2011 (Best Paper Award)Yangchun Luo, Venkatesan Packirisamy, Nikhil Mungre, Ankit Tarkas, Antonia Zhai, and Wei Chung Hsu, âDynamic Performance Tuning for Speculative Threadsâ, Proceedings of the International Symposium on Computer Architecture, (ISCA'09), June, 2009.Jiwei Lu, Abhinav Das, Wei-Chung Hsu, Khoa Ngyuan, Santosh Abraham, \"Dynamic Helper Threaded Prefetching on the SUN Ultra SPARC CMP Processor\", in Proceedings of the 38th Annual IEEE/ACM International Symposium on Microarchitecture, (MICRO-38) , 2005Jiwei Lu, Howard Chen, Rao Fu, Wei Hsu, Pen-Chung Yew, D. Chen \"The Performance of Runtime Data Cache Prefetching in a Dynamic Optimization System\" in Proceedings of the 36th Annual IEEE/ACM International Symposium on Microarchitecture, (MICRO-36), San Diego, California, Dec. 3-5, 2003Jin Lin,Tong Chen,Wei Hsu,Pen-Chung Yew,Roy Ju \"A Compiler Framework for Speculative Analysis and Optimizations\" In Proceedings of the SIGPLAN'03 Conference on Programming Language Design and Implementation (PLDI-2003), June, 2003Vatsa Santhenam, Eddie Gornish, and Wei Hsu, \"Data Prefetch on the HP-PA8000\", Proceedings of the International Symposium on Computer Architecture, (ISCA'97), June, 1997.Dave Dunn and Wei Hsu, \"Instruction Scheduling for the HP-PA8000\", Proceedings of the 29th Annual International Symposium on MicroArchitecture, (MICRO-29), Dec., 1996.Wei Hsu and Jim Smith, \"Performance of Cached DRAM in Vector Supercomputers\", Proceedings of the International Symposium on Computer Architecture (ISCA'93), 1993Sriram Vayapeyam and Wei Hsu, \"On the Instruction-Level Characteristics of Inherently Scalar Code in Highly-Vectorized Scientific Applications\", Proceedings of the 25th Annual International Symposium on MicroArchitecture, (MICRO-25), 1992Jim Smith and Wei Hsu, \"Prefetching in Supercomputer Instruction Caches\", Supercomputing, (SC'92), Nov., 1992.Sriram Vajapeyam, Wei Hsu and Guri Sohi, \"An Empirical Study of the Cray Y-MP processor using the Perfect Club Benchmarks\", Proceedings of the International Symposium on Computer Architecture, (ISCA'91), 1991.J. Goodman and Wei Chung Hsu, \"Code Scheduling and Register Allocation in Large Basic Blocks\" the International Conference on Supercomputing, (ICS'88), 1988.A. Pleszkun, J. Goodman, Wei Chung Hsu, ate. al., \"WISQ: A Restartable Architecture Using Queues\" Proceedings of the International Symposium on Computer Architectures, (ISCA'87), 1987.J. Goodman and Wei Chung Hsu, \"On the Use of Registers vs. Cache to Minimize Memory Traffic\", Proceedings of the International Symposium on Computer Architectures, (ISCA'86), 1986 Address: 3 - 6 Floor, Dao Yuan Building, 2001 Longxiang Road, Longgang District, ShenzhenE-mail: sds@cuhk.edu.cnWechat Account: cuhksz-sdssds.cuhk.edu.cnCopyright Â© CUHK-Shenzhen School of Data Science",
  "content_length": 8565,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:50"
}