{
  "name": "Wei Wei Sun",
  "homepage": "http://www.cl.cam.ac.uk/~ws390",
  "status": "success",
  "content": "Weiwei Sun  —  A Computational Linguist Weiwei home paper talk part-ii projects acs projects student Teaching NLP Semantics Syntax Weiwei Sun  —  A Computational Linguist I am a computational linguist. I am a senior lecturer/associate professor at the Department of Computer Science and Technology of Cambridge University. I was an associate professor at Peking University. I completed my PHD at Saarland University under the supervision of Prof Hans Uszkoreit. I obtained my BA in Linguistics, and my BS and MS in Computer Science from Peking University. Here is my group's website. Here is my CV. Prospective students who might be interested in working with me: please read this. Research The scientific study of language requires a blend of quantitative and symbolic computational approaches, combined with theoretical interest and expertise. Theoretically, the exploration of quality computational models of human language gives insights into the explanation of linguistic phenomena. Empirically, well-implemented computational models play an essential role in testing the validity of linguistic as well as psycholinguistic hypotheses. Furthermore, fruits of computational inquiry of human language benefit language technology and help create highly reliable automatic systems that master some aspects of human language use. Motivated by the above functions, my research is strongly interdisciplinary, leveraging computational models to investigate fundamental linguistic questions and developing linguistically-motivated technologies to advance Natural Language Processing applications. I believe that the scientific and engineering goals of computational linguistics share a common ground — modeling the complexity of natural languages in sophisticated linguistic representations precisely. My research concentrates on applying graphs to encode syntactic and semantic analyses and exploiting graph-centric formalisms and algorithms to formulate linguistic theories explicitly. In order to build a mathematical model for linguistic analysis, we need precise formalisms and sound algorithms to manipulate graphs in a principled way. To extend the work to an empirical domain, we need comprehensive resource grammars and additional high-quality corpora. I study all of these topics. Precisely characterising linguistic competence allow us to precisely characterising language variation. I am particularly interested in modeling language acquisition and language change and now working on translating generative parameter theories to computational models. I am super happy to co-supervise students on this direction with Theresa Biberauer! Teaching I currently teach two courses at Cambridge University: ACS L98 Introduction to Computational Semantics. I am super happy to build this new course with Simone Teufel! PART II & ACS L90: Overview of Natural Language Processing. I teach Chinese (the language and the culture) and programming to kids. Super fun!! I taught six courses at Peking University: Empirical Methods in Natural Language Processing Programming and Linguistic Analysis Compilers Language, Logic and Computation Introduction to Formal Syntax Syntactic Theories and Grammar Engineering I taught a tutorial on Graph-Based Meaning Representations: Design and Processing with Alexander Koller and Stephan Oepen at ACL 2019. Page generated 2022-09-28 14:48:15 BST, by jemdoc.",
  "content_length": 3389,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:49"
}