{
  "name": "Wei Wang 0028",
  "homepage": "http://cs.nju.edu.cn/wangwei",
  "status": "success",
  "content": "Wei Wang Wei Wang, Ph.D., Professor Mail: National Key Laboratory for Novel Software Technology Nanjing University, Xianlin Campus Mailbox 603 163 Xianlin Avenue, Qixia District Nanjing 210023, China 南京市栖霞区仙林大道163号南京大学仙林校区603信箱，邮编210023 Office: Room 915, Computer Science and Technology Building Tel(Fax): +86-25-89681608 Email: wangw at nju.edu.cn   or   wangw at lamda.nju.edu.cn [Resume] [Research Interest] [Activities] [Publication] [Awards] [Teaching] Resume I received my Ph.D. degree from Department of Computer Science and Technology of Nanjing University in 2012, M.Sc. degree from Department of Computer Science and Technology of Nanjing University in 2008, and B.Sc.degree from Department of Mathematics of Nanjing University in 2005. I am a member of LAMDA Group led by Prof. Zhi-Hua Zhou. Research Interest My research interest mainly includes collaborative learning, weakly supervised learning, and machine learning in open environment. Activities Journal Reviewer: IEEE Transactions on Pattern Analysis and Machine Intelligence IEEE Transactions on Neural Networks and Learning Systems Machine Learning Journal Science China: Information Sciences Frontiers of Computer Science ... Conference Reviewer: IJCAI, AAAI, ICML, NeurIPS, KDD ... Publication Wujun Zhou, Shu Ding, Zelin Li, Wei Wang. Enhancing the performance of global model by improving the adaptability of local models in federated learning. In: Proceedings of the 34nd International Joint Conference on Artificial Intelligence (IJCAI’25), 2025. Lefan Zhang, Zhang-Hao Tian, Wujun Zhou, Wei Wang. Learning from long-tailed noisy data with sample selection and balanced loss.In: Proceedings of the 33rd International Joint Conference on Artificial Intelligence (IJCAI’24), Jeju, Korea, 2024, 5471-5480. Lei Zhang, Ji-Fu Li, Wei Wang. Semi-supervised domain generalization with known and unknown classes. In: Advances in Neural Information Processing Systems 36 (NeurIPS’23), New Orleans, LA, 2023. Chiyu Cai, Wei Wang, Yuan Jiang. Adaptive clustered federated learning with representation similarity. In: Proceedings of the 10th IEEE International Conference on Data Science and Advanced Analytics (DSAA’23), Thessaloniki, Greece, 2023. Yi-Xuan Sun, Ya-Lin Zhang, Wei Wang, Longfei Li, Jun Zhou. Treatment effect estimation across domains. In: Proceedings of the 32nd ACM International Conference on Information and Knowledge Management(CIKM’23), Birmingham, UK, 2023, 2352-2361. Ya-Lin Zhang, Yi-Xuan Sun, Fangfang Fan, Meng Li, Yeyu Zhao, Wei Wang, Longfei Li, Jun Zhou, Jinghua Feng. A framework for detecting frauds from extremely few labels. In: Proceedings of the 16th ACM International Conference on Web Search and Data Mining(WSDM’23), Singapore, 2023, 1124-1127. Yi Zhang, Yu Zhang, Wei Wang. Learning linear and nonlinear low-rank structure in multi-task learning. IEEE Transactions on Knowledge and Data Engineering, 2023, 35(8): 8157-8170. Zhongyi Han, Le-Wen Cai, Wang-Zhou Dai, Yu-Xuan Huang, Benzheng Wei, Wei Wang, Yilong Yin. Abductive subconcept learning. Science China: Information Sciences, 2023, 66(2): 122103. Shu Ding, Wei Wang. Collaborative learning by detecting collaboration partners. In: Advances in Neural Information Processing Systems 35 (NeurIPS’22), New Orleans, LA, 2022. Yi-Xuan Sun, Wei Wang. Exploiting mixed unlabeled data for detecting samples of seen and unseen out-of-distribution classes. In: Proceedings of the 36th AAAI Conference on Artificial Intelligence (AAAI’22), Virtual, 2022, 8386-8394. Yi Zhang, Yu Zhang, Wei Wang. Multi-task learning via generalized tensor trace norm. In: Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD’21), Virtual, 2021, 2254-2262. Xian-Jin Gui, Wei Wang, Zhang-Hao Tian. Towards understanding deep learning from noisy labels with small-loss criterion. In: Proceedings of the 30th International Joint Conference on Artificial Intelligence (IJCAI’21), Virtual, 2021, 2469-2475. Cheng Hang, Wei Wang, De-Chuan Zhan. Multi-modal multi-instance multi-label learning with graph convolutional network. In: Proceedings of 2020 International Joint Conference on Neural Networks (IJCNN’21), Virtual, 2021, 1-8. Shu Li, Wei Wang, Wen-Tao Li, Pan Chen. Multi-view representation learning with manifold smoothness. In: Proceedings of the 35th AAAI Conference on Artificial Intelligence (AAAI’21), Virtual, 2021, 8447-8454. Shu Li, Wen-Tao Li, Wei Wang. Co-GCN for multi-view semi-supervised learning. In: Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI’20), New York City, NY, 2020, 4691-4698. Zhi-Hao Tan, Teng Zhang, Wei Wang. Coreset stochastic variance-reduced gradient with application to optimal margin distribution machine. In: Proceedings of the 33th AAAI Conference on Artificial Intelligence (AAAI’19), Honolulu, HI, 2019, 5083-5090. Xiangyu Guo, Wei Wang. Towards making co-training suffer less from insufficient views. Frontiers of Computer Science, 2019, 13(1):99-105. Dongdong Chen, Wei Wang, Wei Gao, Zhi-Hua Zhou. Tri-net for semi-supervised deep learning. In: Proceedings of the 27th International Joint Conference on Artificial Intelligence (IJCAI’18), Stockholm, Sweden, 2018, 2014-2020. Wei Wang, Xiang-Yu Guo, Shao-Yuan Li, Yuan Jiang, Zhi-Hua Zhou. Obtaining high-quality label by distinguishing between easy and hard items in crowdsourcing. In: Proceedings of the 26th International Joint Conference on Artificial Intelligence (IJCAI’17), Melbourne, Australia, 2017, 2964-2970. Wei Wang, Zhi-Hua Zhou. Theoretical foundation of co-training and disagreement-based algorithms. CORR abs/1708.04403, 2017. Wei Wang, Zhi-Hua Zhou. Crowdsourcing label quality: A theoretical analysis. Science China: Information Sciences, 2015, 58(11): 112103. Wei Wang, Zhi-Hua Zhou. Co-training with insufficient views. In: Proceedings of the 5th Asian Conference on Machine Learning (ACML’13), Canberra, Australia, 2013, 467-482. Wei Wang, Zhi-Hua Zhou. Learnability of multi-instance multi-label learning. Chinese Science Bulletin, 2012, 57(19): 2488-2491. Bo Wang, Jiayan Jiang, Wei Wang, Zhi-Hua Zhou, Zhuowen Tu. Unsupervised metric fusion by cross diffusion. In: Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR’12), Providence, RI, 2012, 2997-3004. Quannan Li, Xinggang Wang, Wei Wang, Yuan Jiang, Zhi-Hua Zhou, Zhuowen Tu. Disagreement-Based Multi-system Tracking. In: Proceedings of the ACCV Workshop on Detection and Tracking in Challenging Environments (DTCE’12), Daejeon, Korea, 2013, 320-334. Wei Wang, Zhi-Hua Zhou. Multi-view active learning in the non-realizable case. In: Advances in Neural Information Processing Systems 23 (NIPS’10), Vancouver, Canada, 2010, 2388-2396. Wei Wang, Zhi-Hua Zhou. A new analysis of co-training. In: Proceedings of the 27th International Conference on Machine Learning (ICML’10), Haifa, Israel, 2010, 1135-1142. Ming Li, Wei Wang, Zhi-Hua Zhou. Exploiting remote learners in internet environment with agents. Science China: Information Sciences, 2010, 53(1): 64-76. Wei Wang, Zhi-Hua Zhou. On multi-view active learning and the combination with semi-supervised learning. In: Proceedings of the 25th International Conference on Machine Learning (ICML’08), Helsinki, Finland, 2008, 1152-1159. Wei Wang, Zhi-Hua Zhou. Analyzing co-training style algorithms. In: Proceedings of the 18th European Conference on Machine Learning (ECML’07), Warsaw, Poland, 2007, 454-465. Book Chapter 王魏, 周志华. 多视图在利用未标记数据学习中的效用. 见: 张长水, 杨强 主编, 机器学习及其应用2013, 北京: 清华大学出版社, 2013, 27-45. PhD Thesis Theoretical analysis on the utility of multi-views in exploiting unlabeled data. Department of Computer Science and Technology, Nanjing University, 2012. Awards Outstanding Doctoral Dissertation Award of Jiangsu Province, 2013 Outstanding Doctoral Dissertation Award of Nanjing University, 2013 Outstanding Doctoral Dissertation Award of CCF, 2012 Microsoft Fellowship Award, 2009 Teaching 机器学习理论研究导引（研究生，2018-2025年春季） 数字信号处理（本科生，2022-2025年秋季） 数字图像处理（本科生，2015-2019年春季、2021年秋季） 数据结构（本科生，2013年春季）",
  "content_length": 8074,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:46"
}