{
  "name": "Wei Zhang 0056",
  "homepage": "https://weizhangltt.github.io",
  "status": "success",
  "content": "Wei Zhang (张伟) Wei Zhang Home Biography Publications Teaching Services Pictures Wei Zhang (张伟) [CV] [中文简介] Wei Zhang, Ph.D., Professor School of Computer Science and Technology East China Normal University (ECNU) Address: B903, Science Building, East China Normal University, No.3663, North Zhongshan Road, 200062 Shanghai, P.R. China Email: zhangwei.thu2011@gmail.com We are looking for highly-motivated students with strong programming ability or mathematical ability to work with us as Ph.D. students, master students, and intern students. 研究组常年招收自驱力强的博士生（可推荐进入上海创智学院联合培养）、硕士生和实习生，尤其欢迎编程能力或者数学能力强的同学。[请希望26年入学博士生和硕士生提早联系沟通] We are also hiring associate researchers and postdocs in DM/ML/AIED. If interested, please email me with your CV. 研究组招聘数据挖掘、大语言模型、机器学习、智能教育方向的副研究员、博士后。如果有兴趣，请通过邮箱发送简历，将即时联系沟通。 Research Interests Data Mining, Large Language Model, Machine Learning, AI for Education Data Mining Recommender System, User Behavior Modeling, User-Generated Content Mining Large Language Model (LLM) LLM Reasoning, Efficient LLM, Personalized LLM Machine Learning Interpretable Machine Learning, Knowledge Distillation, Graph Neural Network AI for Education Adaptive Learning, Knowledge Tracing, Cognitive Diagnosis (Co-)Supervised Students Jiajun Cui (PhD, graduated in 2025, work @ Meituan) Zihan Liao (PhD, graduated in 2025, work @ Ant Financial) Kun Ma (master, graduated in 2025, work @ Alibaba) Xiaodong Wu (master, graduated in 2025, work @ Ele.me) Shijie Liu (master, graduated in 2025, work @ ByteDance) Yuang Liu (PhD, graduated in 2024, work @ State Grid) Renrong Shao (PhD, graduated in 2024, work @ The Second Military Medical University) Junbing Yan (master, graduated in 2024, work @ Alibaba) Linfeng Shi (master, graduated in 2024, work @ Minsheng Bank) Yongxiang Liu (master, graduated in 2024, work @ PSBC) Chengliang Zhang (master, graduated in 2023, work @ Meituan) Xuxiang Jiang (master, graduated in 2023, work @ Ctrip) Quanxiu Wang (master, graduated in 2023, work @ Transsion) Zhiyuan Wang (master, graduated in 2023, work @ Beijing Polytechnic) Nai Zhang (master, graduated in 2023, work @ Ant Financial) Zeyuan Chen (master, graduated in 2022, work @ Ant Financial) Xinlei Cao (master, graduated in 2022, work @ Xiaohongshu) Xudong Tang (master, graduated in 2022, work @ ByteDance) Cong Chen (master, graduated in 2022, work @ PDD) Xue Liu (master, graduated in 2022, work @ Intel) Wen Wang (PhD, graduated in 2021, work @ Baidu) Yue Ying (master, graduated in 2021, work @ Alibaba) Xing Lai (master, graduated in 2021, work @ Alibaba) Qianming Xue (master, graduated in 2021, work @ Microsoft) Yihong Zhang (master, graduated in 2021, work @ Meituan) Wenwei Liang (master, graduated in 2020, work @ PDD) Chao Dong (master, graduated in 2020, work @ PDD) Yang Li (master, graduated in 2020, work @ CETC) Huizhe Wu (master, graduated in 2019, work @ PingAn Technology) Jialing Song (master, graduated in 2019, work @ PDD) Yan Feng (master, graduated in 2019, work @ PDD) Page generated by jemdoc.",
  "content_length": 3028,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:49"
}