{
  "name": "Wei Wang 0030",
  "homepage": "https://www.cse.ust.hk/~weiwa",
  "status": "success",
  "content": "Wei Wang Wei Wang Home People Publications Teaching News Links Wei Wang (çå¨) Associate Professor Department of Computer Science & Engineering The Hong Kong University of Science & Technology Clear Water Bay, Kowloon, Hong Kong Associate Director HKUST Big Data Institute HKUST-Alibaba Joint Lab on Big Data and AI Contact Office: Room 2531, Main Academic Building Tel: +852 2358 6972 E-mail: weiwa [at] cse [dot] ust [dot] hk Web: https://cse.hkust.edu.hk/~weiwa About Me I am an Associate Professor in the Department of Computer Science and Engineering and an Associate Director of HKUST Big Data Institute. I joined HKUST in 2015 after receiving the Ph.D. degree from the Department of Electrical and Computer Engineering, University of Toronto. Prior to that, I obtained the B.Eng. and M.Sc. degrees from Shanghai Jiao Tong University. My research interests cover the broad area of networking and distributed systems, with a special focus on distributed machine learning systems (MLSys) and AI cloud infrastructure. I am particularly interested in identifying fundamental system design issues and optimization opportunities for emerging AI workloads (e.g., LLM pre-training, reinforcement learning, generative inference) on large-scale cloud infrastructure and searching for solutions that are generally applicable, efficient, and easily implementable. Wei's Curriculum Vitae. To Perspective Graduate Students and Research Assistants I am looking for highly motivated graduate students and research assistants (RAs) to work on measuring, analyzing, designing, and implementing large-scale distributed systems, including next-generation serverless AI systems, distributed machine learning frameworks for training and inference, and intelligent cluster management systems using AI technologies. Students with strong hands-on system building skills and/or mathematical background are especially welcome. If you are interested in working with me, please feel free to drop me an email along with your CV, transcripts, standard test reports (e.g., TOEFL, GRE, IELTS, etc.), and any other documents that you believe can well demonstrate your research capability and potential. Professional Services Current Membership of Technical Program Committee IEEE ICNP 2025 IEEE HiPC 2025 Current Membership of Journal Editorial Board Associate Editor, IEEE Transactions on Parallel and Distributed Systems News 11/2025: ZipServe accepted to ACM ASPLOS ’26. 09/2025: ZipBatch accepted to ACM SoCC ’25. 09/2025: One paper accepted to NeurIPS ’25. 09/2025: Congratulations to Suyi for successfully defending his PhD thesis! 08/2025: FlashPS and GRouter accepted to ACM EuroSys ’26. 08/2025: Congratulations to Lingyun for successfully defending his PhD thesis! 07/2025: PipeMorph accepted to NSDI ’26. 06/2025: Excited to release ROLL, Alibaba's optimized framework for large-scale reinforcement learning! 05/2025: Peng's paper accepted to COLT 2025. 04/2025: Four papers accepted to USENIX ATC ’25. 04/2025: Joined the Editorial Board of IEEE Transactions on Parallel and Distributed Systems as an Associate Editor. 04/2025: SpInfer honored with the Best Paper Award at ACM EuroSys ’25. Congratulations to Ruibo and all other co-authors! 01/2025: SpInfer accepted to ACM EuroSys ’25. 12/2024: One paper accepted to IEEE TDSC. 12/2024: One paper accepted to USENIX NSDI ’25. 12/2024: One paper accepted to IEEE INFOCOM ’25. 11/2024: Appointed as the Associate Director of HKUST-Alibaba Joint Laboratory on Big Data and AI. More… Personal I enjoy swimming and playing basketball. I am also an NBA fan. Page generated 2025-11-26 10:14:48 HKT, by jemdoc.",
  "content_length": 3639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:46"
}