{
  "name": "Wei Lu 0015",
  "homepage": "http://iir.ruc.edu.cn/~luwei",
  "status": "success",
  "content": "Lu Wei's Home Page Lu Wei (å¢å«) Associate Professor 501a, Information Building Key Laboratory of Data Engineering and Knowledge Engineering, Ministry of Education Renmin University of China, Beijing, 100872 Email: lu-wei[at]ruc.edu.cn SDMA 2017 Short Biography Research Interests Publications Services Awards Short Biography Dr. Lu Wei is an associate professor of Computer Science Department at Renmin University. Before joining Renmin University, Dr. Lu worked as a research follow of Computer Science Department at NUS during July, 2011 to Sept. 2014. He was a research assistant of DKE group at university of Queesland, Australia during Dec. 2007 to Dec. 2008 and of Database group at National University of Singapore, during June, 2010 to Dec. 2010. Dr. Lu got his Ph.D degree from Renmin University, Master and Bachelor Degrees from both China University of Geoscience (Beijing). Research Interests Data Mining and Big Data Analysis Cloud database systems Spatial and textual data management Mining social network and social media Selected Publications Conferences Chuitian Rong, Chunbin Lin, Yasin N. Silva, Jianguo Wang, Wei Lu, Xiaoyong Du, Fast and Scalable Distributed Set Similarity Joins for Big Data Analytics, ICDE 2017 [ paper] å¼ æè¹, å¢å«,ç¨ä¸è°ï¼èµµå±æµ©ï¼æå°å, é¢åæ è¯¾çå¨çº¿SQLèªå¨è¯æµç³»ç»ååºç¨ï¼ç¬¬åå±å ¨å½é«ç­å­¦æ ¡è®¡ç®æºå®è·µæå­¦è®ºåæ¨ç¬¬ä¸å±ä¸­å½è®¡ç®æºå®è·µæè²å­¦æ¯ä¼è®®ï¼2017 [ paper] Qian Yan, Hao Huang, Yunjun Gao, Wei Lu, Qinming He, Group-Level Influence Maximization with Budget Constraintï¼DASFAA 2017 [ paper] Wei Lu, Tongtong Wang, Min Jiao, Xiaoying Zhang, Shan Wang, Xiaoyong Du, and Hong Chen, Predicting Student Examinee Rate in Massive Open Online Courses, DASFAA Workshop 2016 [ paper] Hao Huang, Song Wang, Shuangke Wu, Yunjun Gao, Wei Lu*, Qinming He, Shi Ying, Mining Arbitrary Shaped Clusters and Outputting a High Quality DEXA 2016 [ paper] Yanyan Shen, Gang Chen, H.V. Jagadish, Wei Lu, Beng Chin Ooi, Bogdan Marius Tudor, Fast Failure Recovery in Distributed Graph Processing Systems, VLDB 2015 [ paper] Jingyang Gao, H.V. Jagadish, Wei Lu, Beng Chin Ooi, Data Sensitive Hashing for High-dimensional KNN Search, SIGMOD 2014, pages: 1127-1138. [paper] Wei Lu, Gang Chen, Anthony KH Tung, Feng Zhao, Efficiently extracting frequent subgraphs using MapReduce, the 2013 IEEE International Conference on Big Data (BigData 2013, 45/259=17.37%), pages:639-647. [paper] Wei Lu, Yanyan Shen, Su Chen, Beng Chin Ooi, Efficient processing of k nearest neighbor joins using MapReduce, PVLDB 2012, pages: 1016-1027. [paper] Chuitian Rong, Wei Lu, Xiaoyong Du, Xiao Zhang, Efficient duplicate detection on cloud using a new signature scheme, WAIM 2011, pages: 251-263. [paper] Wei Lu, ChuiTian Rong, Xiaoyong Du, Gabriel Fung and Xiaofang Zhou, Efficient Common Items Extraction from Multiple Sorted Lists, APWeb 2010, pages:219-225. [paper] Gabriel Fung, Wei Lu, Jing Yang, Xiaoyong Du and Xiaofang Zhou, Extract Interesting Skyline Points in High Dimension Space, DASFAA 2010, pages: 94-108. [paper] Gabriel Fung, Wei Lu, Xiaoyong Du, Dominant and K Nearest Probabilistic Skylines, DASFAA 2009, pages: 263-277. [paper] Lijiang Chen, Bin Cui, Hengtao Shen, Wei Lu, Xiaofang Zhou, Efficient Information Retrieval in Mobile Peer-to-Peer Networks, CIKM 2009, pages:967-976. [paper] Journals Zhanhao Zhao, Feiran Huang, Xiaoli Wang,Wei Lu, Xiaoyong Du, A SQL-Based Solution for Fast Graph Similarity Search, Journal Of Software, 2018 [paper] (to appear) Tongtong Wang, Chuitian Rong,Wei Lu*, Xiaoyong Du, A Survey on Distributed Graph Processing Systems, Journal Of Software, 2018 [paper] (to appear) Peng Zhe, Tongtong Wang,Wei Lu*, Hao Huang, Xiaoyong Du, Feng Zhao, Anthony K. H. Tung, Mining frequent subgraphs from tremendous amount of small graphs using MapReduce, KAIS, 2018 [paper] (to appear) Wei Lu, Jiajia Hou, Ying Yan, Meihui Zhang, Xiaoyong Du, Thomas Moscibroda, MSQL:efficient similarity search in metric spaces using SQL, VLDB Journal, 2017 [paper] Hao Huang, Qian Yan, Yao Zhao, Wei Lu*, Zhenguang Liu, Zongpeng Li, False data separation for data security in smart grids, KAIS, 2017 [paper] å¢å«, æå°å, MOOCæ¨¡å¼ä¸æ°æ®åºç³»ç»æ¦è®ºè¯¾ç¨å®éªå¹³å°çå»ºè®¾ä¸å®è·µ, è®¡ç®æºæè², 2017 [paper] æå°åå¢å«, SPOCæ¥åï¼æä»¬çå®è·µä¸æµ è§ï¼è®¡ç®æºæè², 2017 [paper] Yanyan Shen, Qingchao CaiWei Lu, Dalie Sun, Zhongle Xie, Big Data Research, 2016 [paper] Wei Lu, Xiaoyong Du, Marios Hadjieleftheriou, Beng Chin Ooi, Efficiently Supporting Edit Distance based String Similarity Search Using B+-trees, IEEE Transactions on Knowledge and Data Engineering, 2014. [paper] Chuitian Rong, Wei Lu, Xiaoli Wang, Xiaoyong Du, Yueguo Chen, Anthony K. H. Tung, Efficient and Scalable Processing of String Similarity Join, IEEE Transactions on Knowledge and Data Engineering, 2013, 25(10): 2217-2230. [paper] Chuitian Rong, Wei Lu, Xiaoyong Du, Xiao Zhang, Efficient and exact duplicate detection on cloud, Journal of CONCURRENCY AND COMPUTATION: PRACTICE AND EXPERIENCE, 2013, 25(15): 2187-2206. [paper] Jing Yang, Gabriel Fung, Wei Lu, Xiaofang Zhou, Hong Chen and Xiaoyong Du, Finding Superior Skyline Points for Multidimensional Recommendation Applications, WWW Journal, 2012, 15(1): 33-60. [paper] Wei Lu, Jinchuan Chen, Xiaoyong Du, Efficient Top-K Approximate Searches Against a Relation with Multiple Attributes, WWW Journal, 2011, 14(5-6): 573-597. [paper] Wei Lu, Gabriel Fung, Xiaoyong Du, Xiaofang Zhou, Lijiang Chen, Ke Deng, Approximate Entity Extraction in Temporal Databases, WWW Journal, 2011, 14(2): 157-186. [paper] Jieping Wang, Xiaoyong Du, Jiaheng Lu, Wei Lu, Bucket-based Authentication For Outsourced Databases, Journal of CONCURRENCY AND COMPUTATION: PRACTICE AND EXPERIENCE, 2009, 22(9): 1160-1180. [paper] Services Reviewer for Journals IEEE TKDE Infomation Systems PC Members for Conferences VLDB 2018 WISE 2017 External Reviewer ICDE 2018, SIGMOD 2014, SIGMOD 2013, VLDB 2014, VLDB 2013, ICDE 2015, ICDE 2014, ICDE 2013 Awards The CCF Outstanding Doctoral Dissertation Award, 2012 The Renmin University Outstanding Doctoral Dissertation Award, 2012",
  "content_length": 6212,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:43"
}