{
  "name": "Wei Yu 0002",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/wyu.html",
  "status": "success",
  "content": "Wei Yu | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Wei Yu Professor & Director, Doctoral Program Contact Info Phone: 410-704-5528 Office: YR-438 Email: wyu@towson.edu https://wp.towson.edu/wyu/ Education Ph.D., Computer Engineering, Texas A&M University, Texas, USA, 2008 \t\t\t\t\t\t\t\t\tM.S., Electrical Engineering, Tongji University, Shanghai, China, 1995 \t\t\t\t\t\t\t\t\tB.S., Electrical Engineering, Nanjing University of Technology, Nanjing, China, 1992 Areas of Expertise Cybersecurity and privacy, Cyber-Physical Systems/Internet of Things, Data Science, and Machine Learning Driven Applications Biography Dr. Wei Yu is a Full Professor with the Department of Computer and Information Sciences, Towson University, Towson, MD, U.S. He has been the Ph.D. program director in Information Technology since January 2023. Dr. Wei Yu received the Ph.D. degree in Computer Engineering from Texas A&M University, College Station, TX, U.S., in 2008. His research interests include cybersecurity and privacy, cyber-physical systems/Internet of Things, data and machine learning applications. Scholarship, Creative Activity: The Wilson H. Elkins Professorship, University System of Maryland (USM), 2016. University System of Maryland (USM) Regents’ Faculty Award for Excellence in Scholarship, Research, or Creative Activity, 2015. NSF Faculty CAREER Award: Towards Secured and Efficient Energy-based Critical Infrastructure, 09/2014 – 08/2021. 2012 Excellence in Scholarship Award, Fisher College of Science and Mathematics at Towson University. Best Paper Awards: 2020 IEEE Cyber Science and Technology Congress (CyberSciTech), 2020 IEEE International Conference on Dependable, Automatic and Secure Computing (DASC), 2016 IEEE International Performance Computing and Communication Conference (IPCCC), 2013 IEEE International Conference on Communication (ICC) — Communication and Information Security Symposium, and 2008 IEEE International Conference on Communication (ICC) — Information and Network Security Symposium. Scholarly Papers | Synopsis: Chen, P. Tian, W. Liao, X. Chen, G. Xu, and W. Yu, “Resource-aware Knowledge Distillation for Federated Learning,” to appear in IEEE Transactions on Emerging Topics in Computing, 2023. Qian, X. Liu, C. Ripley, M. Qian, F. Liang, and W. Yu, “Digital Twin - Cyber Replica of Physical Things: Architecture, Applications and Future Research Directions,” Journal of Future Internet, 14(2), 2022. Tian, W. Liao, and W. Yu, “An Asynchronous Federated Denoising Autoencoder based Anomaly Detection System,” Journal of Computer and Security, 108(C), September 2021. Xu, X. Liu, W. G. Hatcher, G. Xu, W. Liao, and W. Yu, “Priority-aware Reinforcement Learning-Based Integrated Design of Networking and Control for Industrial Internet of Things,” IEEE Internet of Things Journal, 8(6), 4668-4680, March 2021. Chen, P. Tian, W. Liao, and W. Yu, “Zero Knowledge Clustering Based Adversarial Mitigation in Heterogeneous Federated Learning,” IEEE Transactions on Network Science and Engineering, 8(2): 1070-1083, April-June 2021. Gao, W. Yu, F. Liang, W. G. Hatcher, and C. Lu, “Privacy-Preserving Big Data Auction Using Homomorphic Encryption,” IEEE Transactions on Network Science and Engineer, 7(2): 776-791, 2020. Gao, J. Nguyen, Y. Wu, W. G. Hatcher, and W. Yu, “Routing in Large-Scale Dynamic Networks: A Bloom Filter-Based Dual-Layer Scheme,” ACM Transactions on Internet Technology (TOIT), 20 (4): 1-24, 2020. Liang, W. G. Hatcher, W. Liao, W. Gao, and W. Yu, “Machine Learning for Security and the Internet of Things: the Good, the Bad, and the Ugly,” IEEE Access, 7: 158126-158147, December 2019. Liang, C. Qian, W. G. Hatcher, and W. Yu, “Search Engine for the Internet of Things: Lessons from Web Search, Vision, and Opportunities,” IEEE Access, 7: 104673-104691, July 2019. G. Hatcher and W. Yu, “A Survey of Deep Learning: Applications and Emerging Research Trends,” IEEE Access, 6: 24411 – 24432, April 2018. Lin, W. Yu, N. Zhang, X. Yang, H. Zhang, and W. Zhao, “A Survey on Internet of Things: Architecture, Enabling Technologies, Security and Privacy, and Applications,” IEEE Internet-of-Things (IoT) Journal, 4(5): 1125 - 1142, October 2017. Yu, F. Liang, X. He, W. G. Hatcher, C. Lu, J. Lin, and X. Yang, “A Survey on the Edge Computing for the Internet of Things,” IEEE Access, 6: 6900 - 6919, November 2017. Xu, W. Yu, Z. Chen, H. Zhang, P. Moulema, X. Fu, and C. Lu, “A Cloud Computing Based System for Network Security Management,” International Journal of Parallel, Emergent and Distributed Systems (IJPEDS) – Taylor & Francis, 30(1):29-45, 2015. Yang, J. Yang, W. Yu, D. An, N. Zhang, and W. Zhao, “On False Data-Injection Attacks against Power System State Estimation: Modeling and Countermeasures,” IEEE Transactions on Parallel and Distributed System (TPDS), 25(3): 717-729, 2014. Ling, J. Luo, W. Yu, X. Fu, D. Xuan, and W. Jia, “A New Cell Counter Based Attack Against Tor,” in Proc. of 16th ACM Conference on Computer and Communications Security (CCS), August 2009. Yu, X. Fu, S. Graham, D. Xuan, and W. Zhao, “DSSS-Based Flow Marking Technique for Invisible Traceback,” in Proc. of IEEE Symposium on Security and Privacy (S&P), May 2007 (Acceptance ratio=8.3%) Professional Service: Senior Area Editor, IEEE Transactions on Information Forensics and Security, 2021 – ongoing Associate Editor, IEEE Internet of Things Journal, 2020 – ongoing Associate Editor, IEEE Transactions on Information Forensics and Security, 2017 – 2021 Associate Editor, IEEE Access, 2017 – ongoing Lead Guest Editor, Special Issue on AI-Enabled Internet of Dependable and Controllable Things, IEEE Internet of Things Journal, 2020 Lead Guest Editor, Special Issue on Distributed Computing Infrastructure for Cyber Physical Systems, IEEE Access, 2019 Co-Lead Guest Editor, Special Issue on Security and Privacy in Cyber-Physical Systems, IEEE Internet of Things Journal, 2016-2017 Program Symposium/Track-Chair, Internet of Things (ICCCN 2019), MLCN (ICNC 2019), COG (ICNC 2018 and 2014), MRN (ICCCN 2015), WN (CCNC 2013) Publicity Chair, IEEE Wireless Communication and Networking Conference (WCNC), 2017 and 2013 Web Chair, IEEE/ACM Cyber-Physical System (CPS) Week, 2012 Keynote Talk: 2019 IEEE SmartCityCom Workshop (ICCCN), 2016 IEEE International Workshop on IoT/CPS-security (ICC) TPC member: INFOCOM, ICC & GLOBECOM, 2012-present; WCNC 2013-present; MILCOM 2011-present; etc. Memberships / Affiliations: Member of Institute of Electrical and Electronics Engineers (IEEE) Member of Association for Computing Machinery (ACM) Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 9794,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:53"
}