{
  "name": "Wei Wang 0002",
  "homepage": "https://cs.nju.edu.cn/ww",
  "status": "success",
  "content": "Wei Wang's Homepage Wei Wang Professor State Key Laboratory for Novel Software and Technology Department of Computer Science and Technology Nanjing University Room 606, CS building, No.163 Xianlin Avenue, Nanjing, China, 210023 Office Hours: Every Thursday 8:00 - 12:00 ww AT nju.edu.cn News Apr 2023 Haoran has been admitted by Princeton. Congratulations to Haoran! Jan 2023 Our deep learning compilation paper, ALT, has been accepted by EuroSys 2023. Congratulations to Zhiying! Apr 2019 Ke Sun has been admitted by UCSD. Congratulations to Ke Sun! May 2017 We have released the iOS ultrasound gesture system. You can download the source code from Github. Biography Wei Wang received his BS and MS degree from the ESE Department of Nanjing University in 1997 and 2000, respectively. He received Ph.D. degree from the ECE department of National University of Singapore (NUS) in 2008. He joined the Computer Science and Technology Department of Nanjing University in 2012. Before that, he has worked at Microsoft Research Asia (MSRA) as an associate researcher in 2009. His research interests are in the areas of wireless networking, including Device-free Sensing, Software Defined Radio, and Mobile Cellular Networks. Research Interests Device-free Sensing Device-free sensing use wireless signals or ultrasound to sense surrounding movements. The users do not need to wear any device, such as sensors or RFID tags. WiFi CSI based Human Detection and Authentication Ultrassound based Gesture Recognition Software Defined Radio Software Defined Radios use software running on CPU or GPU to process the wireless signal rather than specific ASICs. Therefore, they are more flexiable and can be changed on the fly. Wireless Baseband Signal Processing Localization with PHY Information Mobile Cellular Network Mobile Traffic Offloading Cellular Network Measurements Network System Deep Learning System Optimization In-network Computing Selected Publications Full publication list at [Google Scholar] and [DBLP] Conferences DEWS: A Distributed Measurement Scheme for Efficient Wireless Sensing Abstract: One of the key challenges for wireless sensing systems is how to efficiently enable wireless sensing capabilities for multiple devices while leveraging existing wireless communication resources. In this paper, we propose DEWS, a distributed channel measurement scheme that allows multiple transmitters to perform sensing tasks simultaneously, which considers three key issues in wireless sensing tasks: multi-device sensing resolution, multi-device sensing reliability, and multi-device sensing accuracy. First, we use a carefully designed distributed Resource Unit (dRU) allocation scheme based on OFDMA to ensure that multiple devices perform sensing tasks simultaneously with the entire bandwidth, thereby improving the sensing resolution. Then, a subcarrier linear phase shift scheme is designed to avoid signal interference between different transmitting devices and improve the reliability of multi-device sensing. This scheme realizes the fine-grained Time Division Multiplexing (TDM) of multiple devices, which can also increase the number of simultaneous access of sensing devices. Finally, a sensing accuracy improvement algorithm combining a single antenna-based motion recovery method utilizing Independent Component Analysis (ICA) and sampling frequency offset (SFO) correction is proposed, to further help DEWS to break the inherent bandwidth limits and recover different motions at similar distances. We verify the effectiveness of DEWS through extensive experimental testing using commercial USRPs. Mingzhi Pang, Kaiying Li, Xun Wang, Wei Wang, Wen Cheng, Dongxu Liu, Yuqing Yin, Pengpneg Chen ACM IMWUT/UbiComp, 2025 (to appear) UbiComp '25 Security Attacks on LLM-based Code Completion Tools Abstract: The rapid development of large language models (LLMs) has significantly advanced code completion capabilities, giving rise to a new generation of LLM-based Code Completion Tools (LCCTs). Unlike general-purpose LLMs, these tools possess unique workflows, integrating multiple information sources as input and prioritizing code suggestions over natural language interaction, which introduces distinct security challenges. Additionally, LCCTs often rely on proprietary code datasets for training, raising concerns about the potential exposure of sensitive data. This paper exploits these distinct characteristics of LCCTs to develop targeted attack methodologies on two critical security risks: jailbreaking and training data extraction attacks. Our experimental results expose significant vulnerabilities within LCCTs, including a 99.4% success rate in jailbreaking attacks on GitHub Copilot and a 46.3% success rate on Amazon Q. Furthermore, We successfully extracted sensitive user data from GitHub Copilot, including 54 real email addresses and 314 physical addresses associated with GitHub usernames. Our study also demonstrates that these code-based attack methods are effective against general-purpose LLMs, such as the GPT series, highlighting a broader security misalignment in the handling of code by modern LLMs. These findings underscore critical security challenges associated with LCCTs and suggest essential directions for strengthening their security frameworks. The code and attack samples from our research are provided in the appendix. Disclaimer. This paper contains examples of harmful language. Reader discretion is recommended. Wen Cheng, Ke Sun, Xinyu Zhang, Wei Wang AAAI, 2025 (to appear) AAAI '25 MINA: Fine-grained In-network Aggregation Resource Scheduling for Machine Learning Service Abstract: In-network aggregation (INA) offloads gradient aggregation onto switches, and thus effectively reduces the aggregation latency and the volume of traffic. However, INA resources are limited due to the high cost of on-chip memory, which imposes distinct challenges to the effective scheduling of these resources in multi-job MLaaS scenarios. In this paper, we explore the scheduling of INA resources in spatial and temporal dimensions, specifically focusing on its impact on the average job completion time (JCT) and the efficiency of INA resources. We propose MINA, an innovative co-design of algorithm and system that intelligently assigns INA resources to each job and effectively schedules these resources among multiple jobs. Our experiments show that MINA attains an INA efficiency score of 0.9998, implying that almost all jobs run nearly as efficiently as they would with exclusive INA acceleration. Shichen Dong, Zhixiong Niu, Mingchao Zhang, Zhiying Xu, Chuntao Hu, Pengzhi Zhu, Qingchun Song, Lei Qu, Peng Cheng, Can-Tu Nguyen, Shaoling Sun, Xiaohu Xu, Yongqiang Xiong, Wei Wang, Xiaoliang Wang IEEE INFOCOM, 2025 (to appear) INFOCOM '25 USee: Ultrasound-based Device-free Eye Movement Sensing Abstract: Detecting eye movements has become a hot topic in human-computer interaction and serves as an overall health indicator, making it both appealing and challenging. In this paper, we present a system named USee that achieves high-precision capture of weak and aperiodic eye movements by utilizing fine-grained and ubiquitous ultrasound signals, capturing both blinking and more subtle saccades. We initially identify signal changes associated with eye movements by leveraging the distinctive impact of blinking on signals. Pioneeringly, we reveal the relationship between the residuals of signal decomposition and subtle eye movements. Utilizing innovative signal processing architectures, we mitigate interference and extract eye movement features. Subsequently, we employ one-dimensional convolutional operations in place of signal cross-correlation, designing filters for motion category identification and a lightweight convolutional neural network for saccade direction classification. This capability allows our system to serve as a foundational sensing layer for eye movements, making it applicable to various applications. We implement USee on both a research-purpose platform and a commodity Raspberry Pi. Extensive experimental results validate the effectiveness of our system, demonstrating a saccade recognition accuracy of 91% and a blinking recognition accuracy of 94%. The system exhibits robustness, persisting even in challenging scenarios with strong interference, such as the presence of a moving pedestrian. Wen Cheng, Mingzhi Pang, Haoran Wan, Shichen Dong, Dongxu Liu, Wei Wang IEEE SECON, 2024 Best Paper Award SECON '24 mP-Gait: Fine-grained Parkinson’s Disease Gait Impairment Assessment with Robust Feature Analysis Abstract: Patients with Parkinson’s disease (PD) often show gait impairments including shuffling gait, festination, and lack of arm and leg coordination. Quantitative gait analysis can provide valuable insights for PD diagnosis and monitoring. Prior work has utilized 3D motion capture, foot pressure sensors, IMUs, etc. to assess the severity of gait impairment in PD patients These sensors, despite their high precision, are often expensive and cumbersome to wear which makes them not the best option for long-term monitoring and naturalistic deployment settings. In this paper, we introduce mP-Gait, a millimeter-wave (mmWave) radar-based system designed to detect the gait features in PD patients and predict the severity of their gait impairment. Leveraging the high frequency and wide bandwidth of mmWave radar signals, mP-Gait is able to capture high-resolution reflected signals from different body parts during walking. We develop a pipeline to detect walking, extract gait features using signal analysis methods, and predict patients’ UPDRS-III gait scores with a machine learning model. As gait features from PD patients with gait impairment are correctly and robustly extracted, mP-Gait is able to observe the fine-grained gait impairment severity fluctuation caused by medication response. To evaluate mP-Gait, we collected gait features from 144 participants (with UPDRS-III gait scores betwee",
  "content_length": 89316,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:46"
}