{
  "name": "Wei Ding 0003",
  "homepage": "http://www.cs.umb.edu/~ding",
  "status": "success",
  "content": "Wei Ding@The University of Massachusetts Boston Puerto Rico Charles River, Boston University of Houston Clear Lake Dana-Farber Cancer Institute Acadia National Park, Maine Campus Center, UMass Boston University of Houston KDLab Hiking, Mt. Major, NH Welch and Dicky Trail, NH Courtyard, Science Bulding, UMass Boston IT Lab, Science Building, UMass Boston UMass Boston University of Houston Campus Center, UMass Boston CRA-W Workshop University of Houston Previous Next Wei Ding Professor of Computer Science, Fellow of IEEE, AAIA Research Interests knowledge discovery, data mining, and machine learning, with applications to bioinformatics, health sciences, astronomy, geosciences, and environmental sciences. Contact Phone: 617-287-6428 Fax: 617-287-6438 Email: wei.ding@umb.edu Office Location M-3-201-7 Mailing Address Department of Computer Science University of Massachusetts Boston ATTN: Wei Ding 100 Morrissey Blvd. Boston, MA 02125-3393 News 2023, IEEE Fellow 2023, Fellow of Asia-Pacific Artificial Intelligence Association 2022, Director's Award, CISE, National Science Foundation 2022 Spring, NIH PI Award, R01, Use of accelerometer and gyroscope data to improve precision of estimates of physical activity type and energy expenditure in free-living adults has been selected for funding. May 2019 - May 2023, on leave, served as Program Director of the Division of Information and Intelligent Systmes (IIS), National Science Foundation 2019 Spring, WISAY Distinguished Woman in Science Award, Yale University 2018 Fall, Outstanding Alumni Award, Computer Science Department, University of Houston 2018 Spring, AI for Earth Award 2018 Summer, WINS hosted the Tech-Savvy Camp 2017 Summer, NSF PI Award, EAGER: Advanced Machine Learning Techniques to Discover Disease Subtypes in Cancer. 2016 Spring, NIH PI Award, R01, Novel Approaches for Predicting Free-Living Physical Activities in Youth has been selected for funding. Biography Wei Ding earned her Ph.D. in Computer Science from the University of Houston in 2008. She has been a Professor of Computer Science at the University of Massachusetts Boston since then. She served as a Program Director at the National Science Foundation's Division of Information Intelligent Systems from 2019 to 2023. Her responsibilities included overseeing Information Integration and Informatics, Smart Health and Biomedical Research, Formal Methods in the Field, Mathematical and Scientific Foundations of Deep Learning, and Principles and Practice of Scalable Systems. Wei's research interests encompass data mining, machine learning, artificial intelligence, computational semantics, with applications in health sciences, astronomy, geosciences, and environmental sciences. Her contributions consist of over 140 referenced research papers, a published book, and three patents. She serves as an Associate Editor for ACM Transactions on Knowledge Discovery from Data (TKDD), ACM Transactions on Intelligent Systems and Technology (TIST), and Knowledge and Information Systems (KAIS). Wei also served on the editorial boards of Journal of Information System Education (JISE), Journal of Big Data, and Social Network Analysis and Mining Journal. She received the NSF Director's Award in 2022, the Best Paper Award at the 2011 IEEE International Conference on Tools with Artificial Intelligence (ICTAI), the Best Paper Award at the 2010 IEEE International Conference on Cognitive Informatics (ICCI), and the Best Poster Presentation award at the 2008 ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (SIGSPAITAL GIS). Wei was honored with the 2019 WISAY Distinguished Woman in Science Award from Yale University, the 2018 Outstanding Alumni Award, and the Best PhD Work Award between 2007 and 2010 from the University of Houston. Her research projects have been funded by NSF, NIH, NASA, and DOE. She is an IEEE Fellow, AAIA Fellow, and an ACM Senior Member. PhD Students Matthew D Almeida Machine Learning, Time-Series Modeling, and Domain Generalization Electric Guitar KDLab Member since 2016 Yong Zhuang Machine Learning and Spatio-Temporal Data Mining Loves Badminton KDLab Member since 2015 Tianyu Kang Machine Learning Loves Badminton KDLab Member since 2015 Zihan Li Machine Learning Loves Badminton KDLab Member since 2015 Chengjie Zheng Machine Learning Loves Badminton KDLab Member since 2015 Former PhD Students Dr. Joseph Cohen Postdoctoral Fellowi advised by Prof. Yoshua Bengio Univeristy of Montreal PhD, 2016, UMass Boston Dr. Yahui Di Data Scientist Monsanto/Climate Crop PhD, 2017, UMass Boston Dr. Henry Lo Consultant McKinsey & Company PhD, 2016, UMass Boston Dr. Yang Mu Research Scientist Facebook PhD, 2015, UMass Boston Dr. Dawei Wang Manager, Applied Science Amobee PhD, 2016, UMass Boston Dr. Chung-Hsien (Jacky) Yu Machine Learning Engineer PlayStation PhD, 2016, UMass Boston Former Visiting Scholars, Master Students, and Undergraduate Students Vikram Venaktesh Gopalan 2018-2019, UMass Boston Dr. Jipeng Qiang Soochow University, China, Visiting Scholar, 2015-2016, UMass Boston Tingting Lu, Beihang University, Visiting Scholar, 2015-2016, UMass Boston Ira Ceka, PhD student, Columbia University, 2022; Undergraduate Student, 2016-2019, UMass Boston Daniel Manning Software Developer, IBM, 2016, UMass Boston Melissa Cruz, PhD Student, Tufts University, Undergraduate Student, 2015, UMass Boston Nicole Cote Developer, Cervello, Undergraduate Student, 2013, UMass Boston Alena Bertash, Business Intelligence Consultant, TriCore Solutions, Undergraduate Student, 2012, UMass Boston Timmy Mbaya Undergraduate Student, 2011, UMass Boston Veronica Carrillo Marquez, Co-Founder, F1V, Undergraduate Student, 2009, UMass Boston Dr. Kui Yu, University of South Australia, Visiting Scholar, 2011-2012, UMass Boston Kevin Amaral PhD Student, UMass Boston, Undergraduate Student, 2012-2013, UMass Boston Caitlin Kuhlman, PhD Student, WPI, Undergraduate Student, 2013-2014, UMass Boston Vy Nguyen Software Engineer, Google, Undergraduate Student, 2013, UMass Boston Anna Gavrilman, Software Engineer, Undergraduate Student, 2013-2014, UMass Boston Dr. Yin Li Associate Professor, Northwest A&F University, China, Visiting Scholar, 2013-2014, UMass Boston Dr. Ren Xiang, Importing Analyst, Evergreen Enterprises, Visiting Scholar, 2013-2014, UMass Boston Dr. Xu Yuan Associate Professor, School of Software Technology, Dalian University of Technology, Visiting Scholar, 2013-2014, UMass Boston Dr. Pei Yang, Lecturer, Nanjing University, China, Visiting Scholar, 2013-2014, UMass Boston Dr. Min Yang Associate Professor, Wuhan University, China, Visiting Scholar, 2013-2014, UMass Boston Dr. Ana Gonzalez Marcos, Associate Professor, University of La Rioja, Spain, Visiting Scholar, 2012, UMass Boston Siyi Liu Senior Software Engineer, PayPal, Master's Student, 2011, UMass Boston Pradnya Khutafale, Software Engineer, PatientKeeper, Master's Student, 2011, UMass Boston Max Choly Software Engineer, VMware, Undergraduate Student, 2010, UMass Boston William Isaac Miller, PhD Student, In Memoriam, 1985 - 2010, Miller's page Jue Wang Lead Quality Engineer, Cvent, Master's Student, 2010, UMass Boston Kartik Panjabi, Vice President, Goldman Sachs, Master's Student, 2010, UMass Boston Anshul Jain Master's Student, 2010, UMass Boston Susan Ngai Master's Student, 2010, UMass Boston Joshua A. Reyes Software Engineer, KAYAK, Master's Student, 2009, UMass Boston",
  "content_length": 7462,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:42"
}