{
  "name": "Wei Zeng 0004",
  "homepage": "https://zeng-wei.com",
  "status": "success",
  "content": "Zeng Wei's Homepage I'm an assistant professor at Thrust of Computational Media and Arts (CMA), and jointly appointed at Thrust of Data Science and Analytics (DSA) in Information Hub, the Hong Kong University of Science and Technology (Guangzhou), and also affiliated with Department of Computer Science and Engineering, HKUST. My research focuses on data visualization and visual analytics, VR/AR, and creative design. Before joining HKUST(GZ), I worked as an associate professor at Shenzhen Institute of Advanced Technology, Chinese Academy of Sciences, adjunct associate professor at BNU-HKBU United International College, and a senior researcher at Future Cities Laboratory, ETH Zurich. I received both the bachelor and Ph.D. degrees in computer sciences from the Nanyang Technological University. I'm leading the Collaborative Interactive Visualization & Analysis Laboratory (CIVAL) @ HKUST (GZ). Find more information about CIVAL here. Now looking for!! I'm actively looking for PostDocs, PhDs, masters, and RAs. Drop an email with your resume and research plan if you are hardworking, creative, and well-motivated for high-quality research! Prospective students: Please take a look at my research profile and interests, and write a concrete research plan accordingly. I will not respond to your email if the content is generic in any research area, for example, \"I would like to do research in data visualization\" or \"in deep learning.\" I do have a wide spectrum of research interests, but that does not mean that I am dedicated to or capable of doing any research. It is fine if you know nothing about my research, in case that you are willing to and be able to do the research assigned to you! Recent News Sept. '25: Our paper 'Latent Space Map for Visual Utilization of Generated Data' got accepted to IEEE Transactions on Visualization and Computer Graphics. Congrats to Yang Zhang and Prof. Jie Li. Aug. '25: Two papers got accepted to VINCI'25 as full paper. 'SceneWeaver: A Multi-Agent Collaborative System for 3D Scene Creation in Video Games\t' accepted as a full paper in the Technical Paper track. Congrats to Rong Huang. 'HeritageExplorer: Interactive Visualization and Dialogue System for Multi-modal Architectural Heritage Exploration\t' accepted as a full paper in the Cultural Heritage track. Congrats to Yusong Wang. Aug. '25: Our paper 'C2Views: Knowledge-based Colormap Design for Multiple-View Consistency' got accepted to Pacific Graphics 2025. Congrats to Yihan Hou. July '25: Invited to serve as Associate Editor for IEEE Computer Graphics & Applications. Welcome to submit papers.",
  "content_length": 2609,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:48"
}