{
  "name": "Wei Wang 0012",
  "homepage": "https://weiwangup.github.io",
  "status": "success",
  "content": "Wei Wang Wei Wang (王伟) I am Dr. Wei Wang, a full professor in the School of Computer Science and Technology at Beijing Jiaotong University, China. I earned my Ph.D. degree from Xi'an Jiaotong University in 2006. From 2005 to 2006, I was a Post-Doctoral Researcher at the University of Trento, Italy, from 2005 to 2006. I worked as a Post-Doctoral Researcher with TELECOM Bretagne and INRIA, France, from 2007 to 2008. I was an European ERCIM Fellow at the Norwegian University of Science and Technology (NTNU) in Norway, and Interdisciplinary Centre for Security, Reliability, and Trust (SnT) at University of Luxembourg, Luxembbourg, from 2009 to 2011. I hold visiting positions at King Abdullah University of Science and Technology, and NYU. I serve as an Associate Editor for IEEE Transactions on Dependable and Secure Computing. I am also Editorial Board member for Computers & Security and Frontiers of Computer Science. I am vice-chair of ACM SIGSAC China. My recent research interests focus on Blockchain and privacy-preserving computation. I have authored or co-authored over 100 peer-reviewed articles in various journals and international conferences, including IEEE TDSC, IEEE TIFS, IEEE TSE, ACM CCS, AAAI, Ubicomp and IEEE INFOCOM. I was awarded ACM CCS 2023 Distinguished Paper Award. I have been listed as an Elsevier \"highly cited Chinese Researcher.\" News Our work was accepted by ACM CCS 2024. Our work received ACM CCS 2023 Distinguished Paper Award. I was invited to serve as Associate Editor for IEEE Transactions on Dependable and Secure Computing. I have been vice-chair of ACM SIGSAC since December 2023. I was elected as vice-director of CCF Technical Committee on BlockChain. Publications (30 major publications in the past 5 years) [google scholar] [dblp] Not One Less: Exploring Interplay between User Profiles and Items in Untargeted Attacks against Federated Recommendation Yurong Hao, Xihui Chen, Xiaoting Lyu, Jiqiang Liu, Yongsheng Zhu, Zhiguo Wan, Sjouke Mauw, Wei Wang\\(^\\dagger\\) ACM CCS 2024, Salt Lake City, October 14-18, 2024 How Hard is Takeover in DPoS Blockchains? Understanding the Security of Coin-based Voting Governance Chao Li, Balaji Palanisamy, Runhua Xu, Li Duan, Jiqiang Liu, Wei Wang\\(^\\dagger\\) ACM CCS，2023(ACM CCS 2023 Distinguished Paper Award)[2023 Outstanding paper in the field of Chinese blockchain technology (in English)]. Memory-Efficient and Secure DNN Inference on TrustZone-enabled Consumer IoT Devices Xueshuo Xie, Haoxu Wang, Zhaolong Jian and Li Tao, Wei Wang\\(^\\dagger\\), Zhiwei Xu, Guiling Wang IEEE Conference on Computer Communications (IEEE INFOCOM 2024),Vancouver, Canada, 20–23 May 2024. Poisoning with Cerberus: Stealthy and Colluded Backdoor Attack against Federated Learning. Xiaoting Lyu, Yufei Han, Wei Wang\\(^\\dagger\\), Jingkai Liu, Bin Wang, Jiqiang Liu, Xiangliang Zhang. Proceedings of Thirty-Seventh AAAI Conference on Artificial Intelligence (AAAI 2023).Feb 7-14, 2023 Washington DC (Acceptance rate 1721/8777 = 19.6%).[PDF] Multi-misconfiguration Diagnosis via Identifying Correlated Configuration Parameters Yingnan Zhou, Xue Hu, Sihan Xu, Yan Jia, Yuhao Liu, Junyong Wang, Guangquan Xu, Wei Wang\\(^\\dagger\\), Shaoying Liu, Thar Baker IEEE Transactions on Software Engineering, 2023 CGIR: Conditional Generative Instance Reconstruction Attacks against Federated Learning Xiangrui Xu, Pengrui Liu, Wei Wang\\(^\\dagger\\), Hong-Liang Ma, Bin Wang, Zhen Han, and Yufei Han, IEEE Transactions on Dependable and Secure Computing(TDSC),2023.(early access) Automatically Identifying CVE Affected Versions with Patches and Developer Logs Yongzhong He, Yiming Wang, Sencun Zhu, Wei Wang\\(^\\dagger\\), Yunjia Zhang, Qiang Li, Aimin Yu, IEEE Transactions on Dependable and Secure Computing (TDSC), 2023. Attacks against Cross-chain Systems and Defense Approaches: A Contemporary Survey Li Duan, Yangyang Sun, Wei Ni, Weiping Ding, Jiqiang Liu, Wei Wang\\(^\\dagger\\) IEEE/CAA Journal of Automatica Sinica, 2023. FedComm: A Privacy-Enhanced and Efficient Authentication Protocol for Federated Learning in Vehicular Ad-hoc Networks Xiaohan Yuan, Jiqiang Liu, Bin Wang, Wei Wang\\(^\\dagger\\), Bin Wang, Tao Li, Xiaobo Ma, Witold Pedrycz IEEE Transactions on Information Forensics and Security, 2023 (to appear). LEA2: A Lightweight Ensemble Adversarial Attack via Non-overlapping Vulnerable Frequency Regions Yaguan Qian, Shuke He, Chenyu Zhao, Jiaqiang Sha, Wei Wang\\(^\\dagger\\), Bin Wang International Conference on Computer Vision (ICCV 2023), Paris, October 2023. Easy Peasy: A New Handy Method for Pairing Multiple COTS IoT Devices Heng Ye, Qiang Zeng, Jiqiang Liu, Xiaojiang Du, Wei Wang\\(^\\dagger\\) IEEE Transactions on Dependable and Secure Computing (TDSC), 2022(early access). HGATE: Heterogeneous Graph Attention Auto-Encoders Wei Wang\\(^\\dagger\\), Xiaoyang Suo, Xiangyu Wei, Bin Wang, Hao Wang, Hong-Ning Dai, Xiangliang Zhang IEEE Transactions on Knowledge and Data Engineering, 2023,(ESI highly cited paper). A Data-Driven Network Analysis Approach to Identifying Compromised Mobile Devices with Graph-Inference Euijin Choo, Mohamed Nabeel, Mashael Al Sabah, Issa Khalil, Ting Yu, Wei Wang\\(^\\dagger\\) ACM Transactions on Privacy and Security, 2022 (early access). DNS Rebinding Threat Modelling and Security Analysis for Local Area Network of Maritime Transportation Systems Xudong He, Jian Wang, Jiqiang Liu, Weiping Ding, Zhen Han, Bin Wang, Jamel Nebhen, Wei Wang\\(^\\dagger\\) IEEE Transactions on Intelligent Transportation Systems, 2022 (to appear). Efficient and Secure Outsourcing of Differentially Private Data Publishing with Multiple Evaluators Jin Li, Heng Ye, Tong Li, Wei Wang\\(^\\dagger\\), Wenjing Lou, Y. Thomas Hou, Jiqiang Liu, Rongxing Lu IEEE Transactions on Dependable and Secure Computing (TDSC), Vol. 19, Issue: 1, pp. 67-76, 2022 (ESI highly cited paper). ContractWard: Automated Vulnerability Detection Models for Ethereum Smart Contracts Wei Wang\\(^\\dagger\\), Jingjing Song, Guangquan Xu, Yidong Li, Hao Wang, Chunhua Su IEEE Transactions on Network Science and Engineering 8(2): 1133-1144 (2021) (ESI highly cited paper). Rise and Fall of the Global Conversation and Shifting Sentiments During the COVID-19 Pandemic Xiangliang Zhang*, Qiang Yang, Somayah Albaradei, Xiaoting Lyu, Hind Alamro, Adil Salhi, Changsheng Ma, Manal Alshehri, Inji Ibrahim Jaber, Faroug Tifratene, Wei Wang\\(^\\dagger\\), Takashi Gojobori, Carlos M. Duarte*, Xin Gao* Nature’s Humanities and Social Sciences Communications. 8, Article number: 120 (2021)[PDF]. Demystifying the Vetting Process of Voice-controlled Skills on Markets, Proc. ACM on Interactive, Mobile Dawei Wang, Kai Chen*, Wei Wang\\(^\\dagger\\) Wearable and Ubiquitous Technologies (IMWUT) (UbiComp 2021), 5(3): 130:1-130:28 (2021) Detecting Anomalies in Intelligent Vehicle Charging and Station Power Supply Systems with Multi-head Attention Models Yidong Li, Li Zhang, Zhuo Lv, Wei Wang\\(^\\dagger\\) IEEE Transactions on Intelligent Transportation Systems, 22(1): 555-564 (2021). Account Guarantee Scheme: Making Anonymous Accounts Supervised in Blockchain Lichen Cheng, Jiqiang Liu, Yi Jin, Yidong Li, Wei Wang\\(^\\dagger\\) ACM Transactions on Internet Technology (TOIT), Volume 21, Issue 1, Article No.: 11, pp. 1–19, 2021. Street View Text Recognition with Deep Learning for Urban Scene Understanding in Intelligent Transportation Systems Chongsheng Zhang, Weiping Ding, Guowen Peng, Feifei Fu, Wei Wang\\(^\\dagger\\) IEEE Transactions on Intelligent Transportation Systems, 22(7): 4727-4743 (2021). CoEvil: A Co-Evolutionary Model for Crime Inference Based on Fuzzy Rough Feature Selection Xiaoming Liu, Chao Shen, Wei Wang\\(^\\dagger\\), Xiaohong Guan IEEE Transactions on Fuzzy Systems, 28(5): 806-817, 2020(to appear). BotMark: Automated botnet detection with hybrid analysis of flow-based and graph-based traffic behaviors Wei Wang\\(^\\dagger\\), Yaoyao Shang, Yongzhong He, Yidong Li, Jiqiang Liu Information Sciences, 511: 284-296 (2020).(ESI highly cited paper) Privacy Risk Analysis and Mitigation of Analytics Libraries in the Android Ecosystem Xing Liu, Jiqiang Liu, Sencun Zhu, Wei Wang\\(^\\dagger\\), Xiangliang Zhang IEEE Transactions on Mobile Computing, vol. 19, no. 5, pp. 1184-1199, 2020.(ESI highly cited paper) SCTSC: A Semi-centralized Traffic Signal Control Mode with Attribute-based Blockchain in IoVs Lichen Cheng, Jiqiang Liu, Guangquan Xu, Zonghua Zhang, Hao Wang, Hong-Ning Dai, Yulei Wu, and Wei Wang\\(^\\dagger\\) IEEE Transactions on Computational Social Systems, 6(6):1373-1385 (2019). Using Sparse Representation to Detect Anomalies in Complex WSNs Xiaoming Li, Guangquan Xu, Xi Zheng, Kaitai Liang, Emmanouil Panaousis, Tao Li, Wei Wang\\(^\\dagger\\), Chao Shen ACM Transactions on Intelligent Systems and Technology (TIST), 10(6): 64:1-18(2019). Effective android malware detection with a hybrid model based on deep autoencoder and convolutional neural network Wei Wang\\(^\\dagger\\), Mengxue Zhao, Jigang Wang Journal of Ambient Intelligence and Humanized Computing, 10(8): 3035-3043 (2019).(ESI highly cited paper) CreditCoin: A Privacy-Preserving Blockchain-based Incentive Announcement Network for Communications of Smart Vehicles Lun Li, Jiqiang Liu, Lichen Cheng, Shuo Qiu, Wei Wang\\(^\\dagger\\), Xiangliang Zhang, Zonghua Zhang IEEE Transactions on Intelligent Transportation Systems, 19(7): 2204-2220 (2018), one of the 50 most frequently accessed documents for this Transaction! (6000+ full text views since 2018).(ESI highly cited paper, has been cited 540+ times since 2018) Detecting Android Malicious Apps and Categorizing Benign Apps with Ensemble of Classifiers Wei Wang\\(^\\dagger\\), Yuanyuan Li, Xing Wang, Jiqiang Liu, Xiangliang Zhang Future Generation Computer Systems, vol.78, pp. 987–994 (2018).(ESI highly cited paper) Identity-Based Private Matching over Outsourced Encrypted Datasets Shuo Qiu, Jiqiang Liu, Yanfeng Shi, Ming Li, Wei Wang\\(^\\dagger\\) IEEE Transactions on Cloud Computing, 6(3):747-759 (2018)",
  "content_length": 10572,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:46"
}