{
  "name": "Wei Meng 0001",
  "homepage": "https://www.cse.cuhk.edu.hk/~wei",
  "status": "success",
  "content": "Wei Meng About Openings Teaching Experience Publications Services WeiMENG Associate Professor Department of Computer Science & Engineering The Chinese University of Hong Kong wei @ cse.cuhk.edu.hk Room 109, HSH Eng. Bldg. I founded and lead the CUHK Computer Security Lab. I am generally interested in all problems related to computer security and privacy, including the ones intersecting with other areas in computer science and other disciplines. Most recently, I have been focusing on protecting the applications/services and the end users on the Internet. I received my Ph.D. in Computer Science from Georgia Institute of Technology in 2017, and my B.Eng. in Computer Science from Tsinghua University in 2012. OPENINGS If you are interested in working with me on research in computer security or computer systems (e.g., programming languages, software engineering, operating systems, computer networks, etc.), please find the information about our vacancy HERE. TEACHING ENGG 5105/CSCI 5470 Computer and Network Security: Fall 2018, Fall 2019, Spring 2021, Fall 2021, Fall 2022, Fall 2023, Fall 2024, Fall 2025. CSCI 4140 Open-Source Software Project Development: Spring 2018, Spring 2019, Spring 2020, Spring 2024. CSCI 4130 Introduction to Cyber Security: Fall 2019, Fall 2020, Spring 2022, Spring 2023, Spring 2024, Spring 2025. EXPERIENCE PUBLICATIONS My Google Scholar profile is here. The full list can be found here. SERVICES Organizing Committee Member Publication Chair, International Symposium on Research in Attacks, Intrusions, and Defenses 2023 Panel Co-Chair, EAI International Conference on Security and Privacy in Communication Networks 2023 Program Committee Member ACM Conference on Computer and Communications Security 2021, 2022, 2023, 2024, 2025 USENIX Security Symposium 2025 The Web Conference (Security and Privacy Track) 2020, 2021, 2022, 2024, 2025, 2026 IEEE Symposium on Security and Privacy 2023, 2024 ACM Workshop on Secure and Trustworthy Superapps 2023 SecWeb Workshop 2023, 2024 The Annual Computer Security Applications Conference 2023 EAI International Conference on Security and Privacy in Communication Networks 2023 ACM Asia Conference on Computer and Communications Security 2021, 2022 International World Wide Web Conference (Security and Privacy Track) 2017 Journal Reviewer IEEE Transactions on Software Engineering (2025) Science of Computer Programming (2024) IEEE/ACM Transactions on Networking (2022) ACM Transactions on Software Engineering and Methodology (2017, 2020) Elsevier Computers & Security (2019) ACM Transactions on the Web (2018) ACM Computing Surveys (2016) Other Services Preliminary Judge, CSAW Applied Research Competition 2017, 2018, 2019, 2020",
  "content_length": 2712,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:44"
}