{
  "name": "Wei Wang 0050",
  "homepage": "https://metaiot.group/weiwang.html",
  "status": "success",
  "content": "Wei Wang's Homepage Wei Wang (王巍) Professor, Ph.D Advisor (教授、博导) School of Computer Science Wuhan University （武汉大学计算机学院） Office: Room B404, Leijun Technology Building, Wuhan University (雷军科技楼) Email: wangw@whu.edu.cn Wei Wang is a professor in School of Computer Science, Wuhan University. During Jun. 2019 to Aug. 2019, he was a Visiting Scholar in Department of Electrical and Computer Engineering University of California San Diego. He received his Ph.D. degree in Department of Computer Science and Engineering from Hong Kong University of Science and Technology (HKUST), where his Ph.D. advisor is Prof. Qian Zhang. Before he joined HKUST, he received his bachelor degree in Electronics and Information Engineering from Huazhong University of Science& Technology in June 2010. 长期招收：博士后、全日制工学博士、全日制工程博士、非全日制工程博士、学术硕士、工程硕士、本科生实习 欢迎有意到武汉大学计算机学院直接攻读博士/硕士（2024年入学）的硕士生、本科生联系本人。 欢迎本校大二、大三的有志出国/参加大创项目或科研竞赛的本科生加入本人实验室从事科研实践工作。已推荐学生去向：Cornell University、CMU、UCLA、UIUC、UMass、美国东北大学、加拿大滑铁卢大学、香港科技大学、香港中文大学 研究方向：智能无人系统与物联网 （AIoT） 机器人/无人机自主导航、多源传感器融合感知与定位 无源物联网 Looking For Students/PostDocs I am currently looking for highly motivated graduate (Ph.D. and master) and undergraduate students to work on research projects in wireless networking and mobile computing. Candidates are expected to have solid background in network/mobile systems, and strong motivation towards academic excellence. Hands-on system implementation and/or strong mathematical background is a big plus. If interested and have the right background, please email me at weiwangw@hust.edu.cn. Highlights [2025.06] One paper about GPS Soil Sensing accepted by ACM MobiCom (CCF A) [2025.06] One paper about mmwave localization accepted by ICCV (CCF A) [2025.04] One paper about mmwave radar perception accepted by IJCAI (CCF A) [2024.12] One paper about BLE Backscatter accepted by ACM MobiCom (CCF A) [2024.12] Two papers, PDStream and MMatch are accepted by IEEE INFOCOM (CCF A) [2024.06] One paper about GPS sensing accepted by ACM MobiCom (CCF A) [2023.03] One paper about backscatter localization accepted by ACM MobiCom (CCF A) [2023.02] Invited by Huawei to give a talk about integrated sensing and communication in F5.5G C-WAN conference. [2023.01] One paper about federated learning accepted by DASFAA (CCF B) [2022.11] One paper about backscatter IoT authentication accepted by ACM IMWUT (CCF A). [2022.09] Xinyi Wu and Junyao Peng's project awarded as Silver/Bronze awards for Innovation and Entrepreneurship Competition （创青春、互联网+）. [2022.06] Xinyi Wu's graduation project awarded as Outstanding Graduation Project. [2022.04] Junyao Peng's project selected in the National College Students Innovation and Entrepreneurship Training Program. [2022.03] Received Huawei Spark Award for resolving their challenging problems. [2022.02] One paper about mmWave automotive radar accepted by IEEE ICRA (one of the Top 2 conferences in robotics) [2021.12] One paper about deep-learning based edge-assisted video segmentation accepted by IEEE INFOCOM 2022. Acceptance Rate: 19.9% (252 out of 1129) [2021.11] One paper on UAV MU-MIMO rate adaptation accepted by IEEE/ACM Transactions on Networking (ToN) (One of the three CCF rank-A journals in network/communication area). [2021.03] One paper about RF-referenced Monocular Vision accepted by IEEE ICRA (one of the Top 2 conferences in robotics) [2021.02] Awarded as Marie Skłodowska-Curie Fellowship, European Union, 2020. (ranked top 0.4% among all candicates). [2020.12] One paper on learning-based robot authentication accepted by IEEE/ACM Transactions on Networking (ToN) (One of the three CCF rank-A journals in network/communication area). [2020.11] One paper about deep-learning based video forgery detection accepted by IEEE INFOCOM 2021. Acceptance Rate: 19.9% (252 out of 1266) [2020.07] One paper about P2P localization accepted by ACM IMWUT (UbiComp) 2020 (One of the three CCF rank-A venues in pervasive computing/HCI). [2020.03] In the Press: our wireless-IMU based UAV SLAM work is covered by TechXplore. [2020.03] One paper about wireless-IMU based UAV SLAM accpeted by IEEE Trans. Ind. Electron. (Impact factor: 7.503). [2020.02] Elevated to the grade of IEEE Senior member. [2020.01] One paper on low power IoT accepted by IEEE/ACM Transactions on Networking (ToN) (One of the three CCF rank-A journals in network/communication area). [2019.12] Three papers about backscatter communications, security and UAV SLAM accepted by IEEE INFOCOM 2020. Acceptance Rate: 19.8% (268 out of 1354) [2019.11] Our paper about generating adversarial ECG diagnosis system accepted by AAAI 2020. Acceptance Rate: 20.6% (1591 out of 7737). [2019.09] Our paper about deep learning based UAV video streaming accpeted by IEEE Trans. Multimedia (Tier-1 journal about multimedia). [2019.08] Invited to serve as an Editor of IEEE Access (Impact factor: 4.098). [2019.07] Invited to visit UCSD, hosted by Prof. Dinesh Bharadia. [2019.06] Awarded as HUST Academic New Star Scholar Award (华中科技大学“学术新人奖”，全校2019年度28个院系青年教师中仅10人获得) [2019.05] Our paper about deep learning based wearable authentication received IEEE ICC 2019 Best Paper Award (0.6%, 16 out of 2590; 通信领域旗舰会议，1965年举办以来华科首次获奖). [2018.12] One paper about VLC localization accepted by ACM IMWUT (UbiComp) 2019 (One of the three CCF rank-A venues in pervasive computing/HCI). [2018.11] Awarded as Young Elite Scientist Sponsorship Program, China Association for Science and Technology, 2018-2020. (中国通信学会2019年度2人获得） [2018.09] One paper about learning-based backscatter security accpeted by ACM SenSys 2018. Acceptance Rate: 15.6% (23 out of 147). (该年度大陆唯一一篇第一单位长文论文；2003年举办以来华科首次). News report: Link. [2018.08] One paper about backscatter security accpeted by ACM IMWUT (UbiComp) 2018 (One of the three CCF rank-A venues in pervasive computing/HCI). [2018.02] One paper about wearable computing accepted by IEEE Trans. Mobile Comput. (One of the three CCF rank-A journals in network/communication area). [2018.01] Awarded as Hundred Talents Program, Hubei Province, China. [2017.12] One paper about IoT security accepted by IEEE JSAC (Impact factor: 8.085). (One of the three CCF rank-A journals in network/communication area). [2017.11] Two papers about low power IoT and vision piracy accepted by IEEE INFOCOM 2018. Acceptance Rate: 19.2% (309 out of 1606). [2017.10] Supported by the Dawnlight Program (湖北省青年科技晨光计划A类), Hubei Province, China, 2017. [2017.05] Awarded as CHUTIAN Scholar (湖北省“楚天学者”计划) of communication and information system, Hubei Province, China. [2016.11] One paper on wearable computing accepted by IEEE INFOCOM 2017. Acceptance Rate: 20.93% (292 out of 1395). [Research][Students][Publications][Awards][Activities][Miscellaneous] Research Interests Wireless SLAM, mmWave 3D Perception Backscatter Communication/Sensing Video Compression/Transmission for Edge IoT; Students (where do our students go) Postdoc Xianan Zhang (2025-present) PhD Students Kun Zhang (PhD student, 2021) Shengpeng Wang (PhD student, 2022) Chunshen Li (PhD student, 2022) Yijie Wu (PhD student, 2024) Ning Wang (PhD student, 2024) Lehuan Yang (PhD student, 2024) Shuo Ding (PhD student, 2025) Xiaoman Wei (PhD student, 2025) Zhongming Lei (PhD student, 2025) Xin Luo (PhD student, 2025) Master Students Ruijie Zhang (EIC, 2023, 狼牙) Zhongye Cao (EIC, 2023) Zhongcheng Jiang (EIC, 2023, 电工基地) Bixin Zeng (WHU, 2023) Yingying He (XDU, 2023) Yueyao Wang (EIC, 2024, 狼牙) Weiming Li (EIC, 2024, 狼牙) Feiyu Li (WUT, 2024) Jiayi Sun (HUST, 2024) Xin Chen (HUST, 2024) Ze Chen (NWPU, 2024) Yuxuan Wei (WUT, 2024) Fanyuan Yan (WUT, 2024) Zhaoying Huang (WUT, 2024) Cong Liu (HUST, 2025) Undergraduate Students Jingqi Lin (EIC, 2021, 电工基地，国家级大创) Lingyu Jing (EIC, 2022) Renyi Zhi (EIC, 2022, 电工基地) PhD Student Alumni Huixin Dong (PhD student, 2020-2025; Now with HKUST as a postdoctoral researcher, Hong Kong) Xuedou Xiao (PhD student, 2019-2023; Now with WUT as a postdoctoral researcher, Wuhan) Zhiqing Luo (PhD student, 2018-2022; Now Postdoc@HUST) Yong Huang (PhD student, 2017-2021; now with Zhengzhou University as an associate professor, Zhengzhou) Wenyuan Ma (PhD student,2017-2022; now with Southwest Jiaotong University as a lectuer, Chengdu) Shengkai Zhang (Co-supervised PhD student, 2017-2021; now with WUT as an associate professor, Wuhan) Guochao Song (Co-supervised PhD student, 2015-2019; now with CAICT (special offer), Beijing) Zhiang Niu (Co-supervised PhD student, 2017-2023) Shiyue He (PhD student, 2018-2023; Now with Huawei) Xianan Zhang (PhD student, 2017-2023; Now with Huawei (special offer)) Master Student Alumni Xinyi Wu (Master student, 2022; Previously@HUST, now with Huawei, Shanghai ) Liu Yang (Master student, 2022; Previously@HUST, now with Shokz, Shenzhen ) Yi Wang (Master student, 2022; Previously@XDU, now is a financial practitioner) Yulong Xie (Master student, 2022; Previously@CUG, now with China Southern Power Grid ) Mingxuan Yan (Master student, 2021; Previously@WHUT, 2017; now Ph.D atUniversity of California, Merced, USA) Wei Kuang (Master student, 2021; Previously@HUST, 2017; now with Hubei Academy of Aerospace Technology, Wuhan) Yingying Zuo (Master student, 2021; Previously@SDU, 2017; now with ByteDance, Shanghai) Haoyu Xiong (Master student, 2021; Previously@CQU, 2017; now with Huawei, Chengdu ) Lieke Chen (Master student, 2020; Previously@Seed Class & 电工基地, HUST; now with Huawei 2012) Yirong Xie (Master student, 2020; Previously@Seed Class & 电工基地, HUST; now with Pingtouge) Pengen Gao (Master student, 2020; Previously@HUST(电工基地); Now collaborating with Dr. Xiaoxuan Lu@Oxford; now with DJI) Juecheng Zhang(Master student, 2019-2021; Previously@Jilin Univ., 2015; now with Ant Group) Wenqin Wang (Master student, 2019-2021; Previously@CSU, 2015; now with TP-Link) Mengnian Xu (Master student, 2018-2020; Previously@WUT, 2014; now with ByteDance, Beijing) Chao Liu (Master student, 2019-2020; Previously@HUST, 2015; now a math teacher in Shenzhen Honglin Middle School) Hang Yang (Master student,",
  "content_length": 40828,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:52"
}