{
  "name": "Wei Pan 0004",
  "homepage": "https://www.research.manchester.ac.uk/portal/en/researchers/wei-pan(7543834f-4e4d-4596-9038-11ce2d879f9e).html",
  "status": "success",
  "content": "Wei Pan - Research Explorer The University of Manchester Wei Pan Dr Senior Lecturer in Machine Learning, Machine Learning and Robotics https://orcid.org/0000-0003-1121-9879 Emailwei.panmanchester.acukWebsitehttps://panweihit.github.io/ Accepting PhD Students Personal profile OverviewI am a Senior Lecturer (Associate Professor) in Machine Learning at the Department of Computer Science. Before joining Manchester, I was an Assistant Professor at the Department of Cognitive Robotics, TU Delft, Netherlands, and a Project Leader at DJI, China. I received a PhD degree from Imperial College London. I have a broad interest in robot control using Bayesian machine learning and the principles of dynamic control. More details can be found on my personal website.Research interestsControlMachine LearningRobotics Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital FuturesInstitute for Data Science and AISustainable FuturesKeywordsMachine LearningRoboticsControl Theory Fingerprint Dive into the research topics where Wei Pan is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Reinforcement Learning Computer Science 100% Robot Computer Science 43% Deep Reinforcement Learning Computer Science 30% Neural Network Computer Science 25% Sparsity Engineering 23% Learning Approach Computer Science 17% Measurement Noise Engineering 17% Experimental Result Computer Science 16% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 40 Article 25 Conference contribution 10 Preprint 5 Conference article 3 More 1 Paper 1 Letter 1 Other contribution Research output per year Research output per year Aermani-vlm: Structured Prompting and Reasoning for Aerial Manipulation with Vision Language ModelsMishra, S., Yadav, R. D., Das, A., Gupta, S., Pan, W. & Roy, S., 3 Nov 2025, (In preparation).Research output: Preprint/Working paper › Preprint File Language Modeling 100% Task Completion 16% Manipulator 16% Visual Feedback 16% Physical Action 16% 1 Downloads (Pure) Bayesian Natural Gradient Fine-Tuning of CLIP Models via Kalman FilteringAbdi, H., Sun, M. & Pan, W., 3 Nov 2025.Research output: Preprint/Working paper › Preprint File 4 Downloads (Pure) DroneDiffusion: Robust Quadrotor Dynamics Learning with Diffusion ModelsDas, A., Yadav, R. D., Sun, S., Sun, M., Kaski, S. & Pan, W., 2025, 2025 IEEE International Conference on Robotics and Automation, ICRA 2025. Ott, C., Admoni, H., Behnke, S., Bogdan, S., Bolopion, A., Choi, Y., Ficuciello, F., Gans, N., Gosselin, C., Harada, K., Kayacan, E., Kim, H. J., Leutenegger, S., Liu, Z., Maiolino, P., Marques, L., Matsubara, T., Mavromatti, A., Minor, M., O'Kane, J., Park, H. W., Park, H.-W., Rekleitis, I., Renda, F., Ricci, E., Riek, L. D., Sabattini, L., Shen, S., Sun, Y., Wieber, P.-B., Yamane, K. & Yu, J. (eds.). IEEE, p. 1604-1610 7 p. (Proceedings - IEEE International Conference on Robotics and Automation).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Trajectory Tracking 100% Adaptive Control Systems 100% From Grunts to Lexicons: Emergent Language from Cooperative ForagingPiriyajitakonkij, M., Charakorn, R., Tao, W., Pan, W., Sun, M., Tan, C. & Zhang, M., 19 May 2025.Research output: Preprint/Working paper › Preprint File 1 Downloads (Pure) Hierarchical Physics-Informed Neural Network for Rotor System Health AssessmentLiu, X., Cheng, W., Xing, J., Chen, X., Zhao, Z., Gao, L., Zhang, R., Huang, Q., Zhou, H., Zheng, W. X. & Pan, W., 1 Jan 2025, In: IEEE Transactions on Automation Science and Engineering.Research output: Contribution to journal › Article › peer-review Rotor System 100% Physics Informed Neural Network 100% Operators (Mathematics) 100% Neural Network 100% Noise Measurement 28% View all 83 research outputs Projects 1 Not started 1 Active Projects per year MCAIF: Centre for AI FundamentalsKaski, S. (PI), Alvarez, M. (Researcher), Pan, W. (Researcher), Mu, T. (Researcher), Rivasplata, O. (PI), Sun, M. (PI), Mukherjee, A. (PI), Caprio, M. (PI), Sonee, A. (Researcher), Leroy, A. (Researcher), Wang, J. (Researcher), Lee, J. (Researcher), Parakkal Unni, M. (Researcher), Sloman, S. (Researcher), Menary, S. (Researcher), Quilter, T. (Researcher), Hosseinzadeh, A. (PGR student), Mousa, A. (PGR student), Glover, E. (PGR student), Das, A. (PGR student), DURSUN, F. (PGR student), Zhu, H. (PGR student), Abdi, H. (PGR student), Dandago, K. (PGR student), Piriyajitakonkij, M. (PGR student), Rachman, R. (PGR student), Shi, X. (PGR student), Keany, T. (PGR student), Liu, X. (PGR student), Jiang, Y. (PGR student), Wan, Z. (PGR student), Harrison, M. (Support team), Machado, M. (Support team), Hartford, J. (PI), Kangin, D. (Researcher), Harikumar, H. (PI), Dubey, M. (PI), Parakkal Unni, M. (PI), Dash, S. P. (PGR student), Mi, X. (PGR student) & Barlas, Y. (PGR student)1/10/21 → 30/09/26Project: Research Reinforcement Learning 100% Neural Network 71% Approximation (Algorithm) 62% Machine Learning 61% Artificial Intelligence 56% RAI: Centre for Robotics and Artificial IntelligenceCangelosi, A. (PI), Lennox, B. (PI), Weightman, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Fisher, M. (CoI), Herrmann, G. (CoI), Dickson, A. (CoI), Lanzon, A. (CoI), Stancu, A. (CoI), Miller, A. (CoI), Freitas, A. (CoI), Nini, A. (CoI), Voronkov, A. (CoI), Brass, A. (CoI), Vijayaraghavan, A. (CoI), Parslew, B. (CoI), crowther, W. (CoI), Grieve, B. (CoI), Adorno, B. (CoI), Jay, C. (CoI), Wang, C. C. L. (CoI), Todd, C. (CoI), Soutis, C. (CoI), Arsene, C. (CoI), Dresner, D. (CoI), Barrett, E. (CoI), Gowen, E. (CoI), Arvin, F. (CoI), Podd, F. (CoI), Brown, G. (CoI), Reger, G. (CoI), Cooper, G. (CoI), Mairs, H. (CoI), Yin, H. (CoI), Kinloch, I. (CoI), Eleftheriou, I. (CoI), Li, J. (CoI), Carrasco Gomez, J. (CoI), Ainsworth, J. (CoI), Sinha, J. (CoI), Ozanyan, K. (CoI), Smith, K. (CoI), Twomey, K. (CoI), Margetts, L. (CoI), Ren, L. (CoI), Zhang, L. (CoI), Cordeiro, L. (CoI), Rattray, M. (PI), Bissett, M. (CoI), Elliot, M. (CoI), Alvarez, M. (CoI), Luján, M. (CoI), Nabawy BSc, MSc, PhD, MRAeS, SMAIAA, FHEA, M. (CoI), Peek, N. (CoI), Marjanovic, O. (CoI), Dorn, O. (CoI), Dudek, P. (CoI), Green, P. (CoI), Connolly, P. (CoI), Da Silva Bartolo, P. J. (CoI), Gardner, P. (CoI), Martin, P. (CoI), Potluri, P. (CoI), Curtis, R. (CoI), Schmidt, R. (CoI), Banach, R. (CoI), Batista-Navarro, R. T. (CoI), Kaski, S. (CoI), Midson, S. (CoI), Watson, S. (CoI), Holm, S. (CoI), Furber, S. (CoI), Schlegel, V. (CoI), Mirihanage, W. (CoI), Mansell, W. (CoI), Pan, W. (CoI), Sampson, B. (CoI), Sellers, W. (CoI), Yang, W. (CoI), Cai, P. (CoI), Sun, Y. (CoI), Alharthi, A. (Researcher), Macario Rojas, A. (Researcher), Serhan, B. (Researcher), Yu, C. (Researcher), Abara, D. (Researcher), Lopez Pulgarin, E. (Researcher), Faruq, F. (Researcher), Tavella, F. (Researcher), Semeraro, F. (Researcher), Liu, G. (Researcher), Fang, G. (Researcher), Niu, H. (Researcher), Taylor, H. (PI), Zhu, H. (PGR student), Collenette, J. (Researcher), Amano, K. (Researcher), Lo, K. C. J. (PGR student), Raggioli, L. (Researcher), Romeo, M. (Researcher), Ruocco, M. (PGR student), Ghaffari Saadat, M. (Researcher), Walmsley, M. (Researcher), Mubarik, A. (Researcher), Vinanzi, S. (Researcher), Su, Y.-H. (PGR student), McAleese, H. (PGR student), Stringer, P. (PGR student), Stoican, R. (PGR student), Ye, R. (PGR student), Kurawa, S. S. (PGR student), Zhang, T. (PGR student), Krywonos, W. (PGR student), Xu, Y. (PGR student), Tian, Y. (PGR student), Henderson, A. (Technical team), Morley, D. (Support team), Tallentire, J. (Support team), Smith, J. (Support team), Hawthornthwaite, S. (Support team), Carlson, J. (Support team) & Baniqued, P. D. (Researcher)Project: Research Robot 100% Human Robot Interaction 22% Digital Twin 20% Cognitive Architecture 17% Autonomous System 17%",
  "content_length": 8462,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:46"
}