{
  "name": "Wei Wang 0010",
  "homepage": "http://www.cs.ucla.edu/~weiwang",
  "status": "success",
  "content": "Wei Wang's Home Page Wei Wang, Fellow of ACM, IEEE (CV) Ph.D. UCLA Computer Science Leonard Kleinrock Chair Professor Department of Computer Science University of California, Los Angeles Los Angeles, CA 90095-1596 USA Office: 3531-G Boelter Hall Email: weiwang@cs.ucla.edu Voice: 1 (310) 794-0009 Fax: 1 (310) 825-7578 Project Manager: Sim-Lin Lau Office: 3531-J Boelter Hall Email: simlin@cs.ucla.edu Voice:1 (310) 825-2303 Fax: 1 (310) 206-2273 Secretary: Osanna Kazarian Office: 498 Engineering VI Email: osannak@cs.ucla.edu Voice:1 (310) 825-1322 Fax: 1 (310) 206-2273 Wei Wang is the Leonard Kleinrock Chair Professor in Computer Science and Computational Medicine at University of California, Los Angeles and the director of the Scalable Analytics Institute (ScAi). She is also a member of the UCLA Jonsson Comprehensive Cancer Center, Institute for Quantitative and Computational Biology, and Bioinformatics Interdepartmental Graduate Program. She received her PhD degree in Computer Science from the University of California, Los Angeles in 1999. She was a professor in Computer Science and a member of the Carolina Center for Genomic Sciences and Lineberger Comprehensive Cancer Center at the University of North Carolina at Chapel Hill from 2002 to 2012, and was a research staff member at the IBM T. J. Watson Research Center between 1999 and 2002. Dr. Wang's research interests include big data analytics, data mining, machine learning, natural language processing, bioinformatics and computational biology, computational medicine, and AI for science. She has filed seven patents, and has published one monograph and more than four hundred research papers in international journals and major peer-reviewed conference proceedings, including multiple best paper awards. Dr. Wang received the IBM Invention Achievement Awards in 2000 and 2001. She was the recipient of an NSF Faculty Early Career Development (CAREER) Award and was named a Microsoft Research New Faculty Fellow in 2005. She was honored with the 2007 Phillip and Ruth Hettleman Prize for Artistic and Scholarly Achievement. She was recognized with an IEEE ICDM Outstanding Service Award in 2012, an Okawa Foundation Research Award in 2013, and an ACM SIGKDD Service Award in 2016. Dr. Wang has been an associate editor of the IEEE Transactions on Knowledge and Data Engineering, IEEE Transactions on Big Data, ACM Transactions on Knowledge Discovery in Data, Journal of Knowledge and Information Systems, Data Mining and Knowledge Discovery, Journal of Computational Biology, IEEE/ACM Transactions on Computational Biology and Bioinformatics, International Journal of Knowledge Discovery in Bioinformatics, and an editorial board member of the International Journal of Data Mining and Bioinformatics and the Open Artificial Intelligence Journal. She serves on the organization and program committees of international conferences including ACM SIGMOD, ACM SIGKDD, ACM BCB, VLDB, ICDE, EDBT, ACM CIKM, IEEE ICDM, SIAM DM, SSDBM, ISMB, RECOMB, BIBM. She is the Chair of the ACM Special Interest Group on Knowledge Discovery in Data (SIGKDD). Dr. Wang is a fellow of ACM and IEEE. Research List of Publications Sorted in Chronological Order List of Publications from the Google Scholar List of Publications from the DBLP Bibliography Software Scalable Analytics Institute (ScAI) Postdoctoral Fellows Xiao Luo (November 2024 - now) Ph.D. Students Alexander Pelletier (September 2019 - now) Derek Xu (September 2020 - now) Alexander Taylor (September 2021 - now) Anthony Cuturrufo (September 2022 - now) Jeehyun Hwang (September 2022 - now) Xiaoxuan Wang (September 2022 - now) Yijia Xiao (September 2022 - now) Yanqiao Zhu (September 2022 - now) Chenchen Ye (September 2023 - now) Yuanzhou Chen (January 2024 - now) Jingru Gan (April 2024 - now) Yihe Deng (April 2024 - now) Junkai Zhang (April 2024 - now) Renliang Sun (September 2024 - now) Han Zhang (September 2024 - now) Alumni Teaching Fall 2025: CS245: Big Data Analytics Fall 2025: CS245-80: Big Data Analytics (MSOL course) Past Course Offerings Professional Services Steering Committee Member of the ACM WSDM Conference (2022 - present) Member of ACM SIG Governing Board (SGB), 2025 - 2027. Chair of ACM Special Interest Group on Knowledge Discovery in Data (SIGKDD), 2021 - 2025. Guest Editor NPJ Artificial Intelligence Special Issue on AI for Biology, 2025. Editorial Board Member of the Journal of Computational Biology, 2017 - present. Steering Committee Member of the IEEE Big Data Conference, 2017 - present. Associate Editor of the International Journal of Knowledge Discovery in Bioinformatics, 2009 - present. Associate Editor of the Journal of Data Mining and Knowledge Discovery, 2010 - present. Associate Editor of the open access journal on Health Information Science and Systems, 2011 - present. Editorial Board Member of the Open Artificial Intelligence Journal, 2007 - present. Editorial Board Member of the International Journal of Data Mining and Bioinformatics, 2005 - present. Action Editor of the Data Mining and Knowledge Discovery, 2014 - present. Senior Area Chair of the 42nd International Conference on Machine Learning, Vancouver, Canada, July 13 - 19, 2025. Co-organizer of the ICML Workshop on Multi-modal Foundation Models and Large Language Models for Life Sciences, 2025. Area Chair of the 39th AAAI Conference on Artificial Intelligence, Philadelphia, PA, U.S.A., February 25 - March 4, 2025. Past Professional Services",
  "content_length": 5483,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:48"
}