{
  "name": "Wei Zhang 0173",
  "homepage": "https://sduzhangwei.github.io",
  "status": "success",
  "content": "Wei Zhang Wei Zhang (张伟) I am currently an associate professor at the School of Cyber Science and Technology, Shandong University, Qingdao, China. I received my Ph.D. degree from The Hong Kong Polytechnic University, supervised by Dr. Nan Guan. My research interests include: analysis, optimization and design for energy harvesting systems static timing analysis and optimization for real-time tasks optimization for Blockchain systems Google scholar page: https://scholar.google.com/citations?user=uJ65n8MAAAAJ&hl=zh-CN DBLP page: https://dblp.org/pid/10/4661-173.html EMAIL: sduzhangwei [at] sdu.edu.cn News: I am selected into the Young Scholars Future Program of Shandong University in 2022 I will give an invited talk \"Reducing backup overhead for intermittent computing\" on MCS@ESWEEK 2022. Our work got supported by \"CCF-Huawei Populus Grove Fund\" in 2022 Our work got supported by Shandong Provincial Natural Science Foundation Our work got supported by the National Natural Science Foundation of China (NSFC) Young Scholar Program Our work got supported by a sub-project of the NSFC Key Project Our work got supported by \"CCF-Huawei Populus Grove Fund\" in 2025 Recent Publications: Yilan Zhu, Honghui You, Wei Zhang, Jiming Xu, Qian Lou, Shoumeng Yan and Lei Ju. DAHE: Parameter-adaptive and memory efficient FPGA acceleration of homomorphic encryption. IEEE Transactions on Computers(TC), 2025. Wei Zhang, Yunlong Yu, Xiao Jiang, Nan Guan, Naijun Zhan and Lei Ju. WCET Estimation for CNN Inference on FPGA SoC With Multi-DPU Engines. IEEE Transactions on Parallel and Distributed Systems(T-PDS), 2025. Juxin Niu, Yunlong Yu, Wei Zhang, Nan Guan. Data-Dependent WAR Analysis for Efficient Task-Based Intermittent Computing. International Symposium on Dependable Software Engineering: Theories, Tools, and Applications(SETTA), 2024. Shangshang Xiao, Mengxia Sun, Wei Zhang, Naijun Zhan and Lei Ju. Cache Behavior Analysis with SP-Relative Addressing for WCET Estimation. International Symposium on Dependable Software Engineering: Theories, Tools, and Applications(SETTA), 2024. Juxin Niu, Yunlong Yu, Wei Zhang, Naijun Zhan. Adaptive Checkpointing Method for Intermittent Computing Systems. IEEE 14th International Symposium on Industrial Embedded Systems(SIES), 2024. Juxin Niu, Wei Zhang, Chun Jason Xue, Nan Guan. RTiL: Real-Time Inference of Large Language Models on Memory-Constrained GPU Devices. IEEE 30th International Conference on Embedded and Real-Time Computing Systems and Applications(RTCSA, best paper candidate), 2024. Shuo Xu, Wei Zhang, Mengying Zhao, Zimeng Zhou and Lei Ju. Cache-aware Task Decomposition for Efficient Intermittent Computing Systems. accepted to Design Automation Conference (DAC), 2024. Ling Lin, Lei Ju, Chun Jason Xue, Mingliang Zhou, Wei Zhang, Zimeng Zhou. Work or Sleep: Freshness-Aware Energy Scheduling for Wireless Powered Communication Networks with Interference Consideration. Design Automation Conference (DAC), 2023. Zelin Du, Wei Zhang, Zimeng Zhou, Zili Shao, and Lei Ju. Accelerating DNN Inference with Heterogeneous Multi-DPU Engines. Design Automation Conference (DAC), 2023. Songran Liu, Mingsong Lv, Wei Zhang, Wei Zhang, Xu Jiang, Chuancai Gu, Tao Yang, Wang Yi and Nan Guan. Light flash write for efficient firmware update on energy-harvesting IoT devices. Design, Automation & Test in Europe Conference & Exhibition (DATE, best paper candidate), 2023. Zimeng Zhou, Chenchen Fu, Chun Jason Xue, Song Han, Wei Zhang and Lei Ju. Optimizing worst case data freshness in rf-powered networked embedded systems. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2023. Wei Zhang, Qianling Zhang, Mingsong Lv, Songran Liu, QiuLin Chen, Nan Guan and Lei Ju. Adaptive Task-based Intermittent Computing System with Parallel State Backup. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2022. Wei Zhang, Mingsong Lv, Wanli Chang and Lei Ju. Precise and Scalable Shared Cache Contention Analysis for WCET Estimation. Design Automation Conference (DAC), 2022. Wei Zhang, Songran Liu, Mingsong Lv, QiuLin Chen and Nan Guan. Intermittent Computing with Efficient State Backup by Asynchronous DMA. Design Automation and Test in Europe (DATE), 2021. Songran Liu, Wei Zhang, Mingsong Lv, QiuLin Chen and Nan Guan. Surviving Transient Power Failures with SRAM Data Retention. Design Automation and Test in Europe (DATE), 2021. Songran Liu*, Wei Zhang*, Mingsong Lv, Qiulin Chen, Nan Guan. LATICS: A Low-overhead Adaptive Task-based Intermittent Computing System. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD ), as proceedings of International Conference on Embedded Software (EMSOFT), 2020. (*Contributed equally) Wei Zhang, Jiangshan Yu, Qingqiang He, Nan Zhang and Nan Guan. TICK: Tiny Client for Blockchains. IEEE Internet of Things Journal (IoTJ), 2020. He Du, Wei Zhang, Nan Guan and Wang Yi. Scope-aware Data Cache Analysis for OpenMP Programs on Multi-core Processors. Journal of System Architectures (JSA), 2019. Wei Zhang, Nan Guan, Lei Ju, Yue Tang, Weichen Liu and Zhiping Jia. Scope-Aware Useful Cache Block Calculation for Cache-Related Preemption Delay Analysis with Set-Associative Data Caches. IEEE Transactions on Computer-Aided Design of IntegratedCircuits and Systems (TCAD), 2019. Wei Zhang, Nan Guan, Lei Ju, Weichen Liu. Analyzing Data Cache Related Preemption Delay with Multiple Preemptions. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), as proceedings of International Conference on Compilers, Architecture, and Synthesis for Embedded Systems (CASES), 2018. Wei Zhang, Fan Gong, Lei Ju, Nan Guan, Zhiping Jia. Scope-aware Useful Cache Block Analysis for Data Cache Related Preemption Delay. The 23rd IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), 2017. Service: IEEE RTSS 2023, Artifact Evaluation Chair IEEE RTCSA 2023, TPC IEEE DependSys 2022, TPC ISORC 2022, TPC IEEE RTCSA 2021, TPC",
  "content_length": 6039,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:49"
}