{
  "name": "Wei Niu 0002",
  "homepage": "https://niuwei.info",
  "status": "success",
  "content": "Wei Niu @ UGASearchWei NiuAssistant Professor,wniu (AT) uga (DOT) edu,University of Georgia423 Boyd Research and Education CenterSeveral RA positions available for highly motivated Ph.D. candidates. Check details.Wei Niu is an assistant professor in the School of Computing at the University of Georgia. He obtained his Ph.D. degree from the Department of Computer Science at William & Mary, under the supervision of Dr. Bin Ren. Prior to that, he earned a B.S. Degree in Software Engineering from Beihang University in 2016 and worked as a mobile-platform software developer at Bytedance Ltd. from 2016 to 2018. His research interests include:Real-time machine learning systemsAGI on embedded devicesCompiler optimization and parallel computingHis work has been published in some high-impact conferences (PLDI, ASPLOS, MICRO, ICS, ICCV, CVPR, AAAI, NIPS, ECCV, DAC, ASP-DAC, GLSVLSI) and journals (TPAMI, TACO, CACM).Realtime AI Application on Mobile DevicesWei Niu also designed several creative real-time AI-applications on mobile devices based on his research, here are some examples:Network style transferYOLO-V3/YOLO-V4 object detectionSuper resolutionBlack-white image/video coloring3D object detection (based on R2+1D, C3D, S3D models)More video information can be found on our Youtube channel or Bilibili Channel.Selected Publications* means equal contributionSmartMem: Layout Transformation Elimination and Adaptation for Efficient DNN Execution on MobileWei Niu, Md Musfiqur Rahman Sanim, Zhihao Shu, Jiexiong Guan, Xipeng Shen, Miao Yin, Gagan Agrawal, Bin RenInternational Conference on Architectural Support for Programming Languages and Operating Systems ASPLOS'24 SoD²: Statically Optimizing Dynamic Deep Neural Network ExecutionWei Niu, Gagan Agrawal, Bin RenInternational Conference on Architectural Support for Programming Languages and Operating Systems ASPLOS'24 GCD²: A Globally Optimizing Compiler for Mapping DNNs to Mobile DSPsWei Niu, Jiexiong Guan, Xipeng Shen, Yanzhi Wang, Gagan Agrawal, Bin RenThe 55th IEEE/ACM International Symposium on Microarchitecture MICRO'22 MEST: Accurate and Fast Memory-Economic Sparse Training Framework on the EdgeYuan, G., Ma, X., Niu, W., Li, Z., Kong, Z., Liu, N., Gong, Y., Zhan, Z., He, C., Jin, Q., Wang, S., Qin, M., Ren, B., Wang, Y., Liu, S., Lin, X.The 35th Conference on Neural Information Processing Systems NeurIPS'21 Achieving on-Mobile Real-Time Super-Resolution with Neural Architecture and Pruning SearchZ. Zhan, Y. Gong, P. Zhao, G. Yuan, W. Niu, Y. Wu, T. Zhang, M. Jayaweera, D. Kaeli, B. Ren, X. Lin, Y. WangInternational Conference on Computer Vision, 2021 ICCV'21 GRIM: A General, Real-Time Deep Learning Inference Framework for Mobile Devices based on Fine-Grained Structured Weight SparsityWei Niu, Zhengang Li, Xiaolong Ma, Peiyan Dong, Gang Zhou, Xuehai Qian, Xue Lin, Yanzhi Wang, Bin RenIEEE Transactions on Pattern Analysis and Machine Intelligence, 2021 TPAMI'21 ClickTrain: Efficient and Accurate End-to-End Deep LearningTraining via Fine-Grained Architecture-Preserving PruningC. Zhang, G. Yuan, W. Niu, J. Tian, S. Jin, D. Zhuang, Z. Jiang, Y. Wang, B. Ren, S. Song, D. TaoThe 35th ACM International Conference on Supercomputing (acceptance rate: 39/157) ICS'21 DNNFusion: Accelerating Deep Neural Networks Execution with Advanced Operator FusionWei Niu, Jiexiong Guan, Yanzhi Wang, Gagan Agrawal, Bin RenThe 42nd ACM SIGPLAN Conference on Programming Language Design and Implementation, 2021 (acceptance rate: 87/320) PLDI'21 NPAS: A Compiler-aware Framework of Unified Network Pruning and Architecture Search for Beyond Real-Time Mobile AccelerationZ. Li*, G. Yuan*, W. Niu*, P. Zhao*, Y. Li, Y. Cai, X. Shen, Z. Zhan, Z. Kong, Q. Jin, Z. Chen, S. Liu, K. Yang, B. Ren, Y. Wang, X. LinIEEE/CVF Conference on Computer Vision and Pattern Recognition, 2021 (oral paper: top 5%, acceptance rate: 1593/7500) CVPR'21 Neural Pruning Search for Real-Time Object Detection of Autonomous VehiclesPu Zhao, Geng Yuan, Yuxuan Cai, Wei Niu, Qi Liu, Wujie Wen, Bin Ren, Yanzhi Wang, Xue LinThe 58th Annual Design Automation Conference, 2021 DAC'21 Real-Time Mobile Acceleration of DNNs: From Computer Vision to Medical ApplicationsHongjia Li, Geng Yuan, Wei Niu, Yuxuan Cai, Mengshu Sun, Zhengang Li, Bin Ren, Xue Lin, and Yanzhi WangProceeding of Asia and South Pacific Design Automation Conference, 2021 ASP-DAC'21 Achieving Real-Time Execution of 3D Convolutional Neural Networks on Mobile DevicesWei Niu*, Mengshu Sun*, Zhengang Li*, Jou-An Chen, Jiexiong Guan, Xipeng Shen, Yanzhi Wang, Xue Lin, Bin RenThe 35th AAAI Conference on Artificial Intelligence, 2021 AAAI'21 YOLObile: Real-Time Object Detection on Mobile Devices via Compression-Compilation Co-DesignYuxuan Cai, Hongjia Li, Geng Yuan, Wei Niu, Yanyu Li, Xulong Tang, Bin Ren, Yanzhi WangThe 35th AAAI Conference on Artificial Intelligence, 2021 AAAI'21 CoCoPIE: Enabling Real-Time AI on Off-the-Shelf Mobile Devices via Compression-Compilation Co-DesignHui Guan, Shaoshan Liu, Xiaolong Ma, Wei Niu, Bin Ren, Xipeng Shen, Yanzhi Wang, Pu Zhao (author in alphabet order)Communications of the ACM, 2021 (Featured Article) CACM'21 An Image Enhancing Pattern-based Sparsity for Real-Time Inference on Mobile DevicesX. Ma*, W. Niu*, T. Zhang, S. Liu, S. Lin, H. Li, X. Chen, J. Tang, K. Ma, B. Ren, and Y. WangProceeding of European Conference on Computer Vision, 2020 ECCV'20 A Privacy-Preserving-Oriented DNN Pruning and Mobile Acceleration FrameworkY. Gong, Z. Zhan, Z. Li, W. Niu, X. Ma, W. Wang, B. Ren, C. Ding, X. Lin, X. Xu, Y. WangProceedings of the 2020 on Great Lakes Symposium on VLSI (Special Session Paper), Sep. 2020 GLSVLSI'20 RTMobile: Beyond Real-Time Mobile Acceleration of RNNs for Speech RecognitionP. Dong, S. Wang, W. Niu, C. Zhang, S. Lin, Z. Li, Y. Gong, B. Ren, X. Lin, and D. TaoThe 57th Annual Design Automation Conference, July, 2020 DAC'20 PCONV: The Missing but Desirable Sparsity in DNN Weight Pruning for Real-time Execution on Mobile DevicesXiaolong Ma, Fu-Ming Guo, Wei Niu, Xue Lin, Jian Tang, Kaisheng Ma, Bin Ren, Yanzhi WangThe 34th AAAI Conference on Artificial Intelligence, February, 2020 AAAI'20 PatDNN: Achieving Real-Time DNN Execution on Mobile Devices with Pattern-based Weight PruningWei Niu, Xiaolong Ma, Sheng Lin, Shihao Wang, Xuehai Qian, Xue Lin, Yanzhi Wang, Bin RenThe 25th International Conference on Architectural Support for Programming Languages and Operating Systems, March, 2020 ASPLOS'20 Full Publication ListCite × Copy Download",
  "content_length": 6531,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:45"
}