{
  "name": "Wei Gao 0008",
  "homepage": "http://www.lamda.nju.edu.cn/gaow",
  "status": "success",
  "content": "Wei Gao's HomePage@LAMDA Wei Gao Ph.D. Professor LAMDA Group School of Artificial Intelligence Nanjing University , Nanjing, China Email: gaow(at)nju(dot)edu(dot)cn Sections: [ Biography ] [ Research Interest ] [ Publication ] Biogeraphy Currently I am a Professor of School of Artificial Intelligence in Nanjing University and a member of LAMDA Group, led by professor Zhi-Hua Zhou. Before that, I received my M.Sc. degree in the Center for Combinatorics, Nankai University in June 2009 and I received my Ph.D. degree from Nanjing University in June 2014. Research Interest My research interests include: Learning Theory. Publication [* denotes my student] M.-J. Yuan*, X.-T. Bai, K.-R. Zhang and W. Gao. On the Encryption for Graph Foundation Model Inference of Sparse Graph. Science China: Information Sciences 68:160104, 2025. J.-Q. Guo*, M.-Z. Qian, W. Gao and Z.-H. Zhou. On the Diversity of Adversarial Ensemble Learning. In: Proceedings of the 42nd International Conference on Machine Learning  (ICML'25), Vancouver, Canada, 2025. C.-Y. Xing*, M.-Z. Qian, W.-Y. Chen, W. Gao and Z.-H. Zhou. One-Pass Feature Evolvable Learning with Theoretical Guarantees. In: Proceedings of the 42nd International Conference on Machine Learning  (ICML'25), Vancouver, Canada, 2025. F. Xu*, W.-Y. Chen and W. Gao. On the Learning with Augmented Class via Forests. In: Proceedings of the 34th International Joint Conference on Artificial Intelligence  (IJCAI'25), Montreal, Canada, 2025. F. Xu*, Z.-J. Zhou, J. Ni and W. Gao. Interpretation with Baseline Shapley Value for Feature Groups on Tree Models. Frontiers of Computer Science 19(5): 195316, 2025. M.-J. Yuan*, Z. Zou and W. Gao. Bi-CryptoNets: Leveraging Different-Level Privacy for Encrypted Inference. In: Proceedings of the 28th Pacific-Asia Conference on Knowledge Discovery and Data Mining  (PAKDD'24), Taipei, China, 2024. X.-R. Xie*, M.-J. Yuan, X.-T. Bai, W. Gao and Z.-H. Zhou. On the Gini-impurity Preservation for Privacy Random Forests. Advances in Neural Information Processing Systems 37 (NeurIPS'23), New Orleans, LA, 2023. Z.-J. Zhou*, J. Ni, J.-H. Yao and W. Gao. On the Exploration of Local Significant Differences for Two-Sample Test. Advances in Neural Information Processing Systems 37 (NeurIPS'23), New Orleans, LA, 2023. W. Gao, F. Xu and Z.-H. Zhou. Towards convergence rate analysis of random forests for classification. Artificial Intelligence 313: 103788, 2022. J.-Q. Guo*, M.-Z. Teng, W. Gao and Z.-H. Zhou. Fast provably robust decision trees and Boosting. In: Proceedings of the 39th International Conference on Machine Learning  (ICML'22), Maryland, MD, 2022. M.-Z. Qian*, Z. Ai, T. Zhang and W. Gao. On the optimization of margin distribution. In: Proceedings of the 31st International Joint Conference on Artificial Intelligence  (IJCAI'22), Vienna, Austria, 2022. M.-J. Yuan* and W. Gao. Learning with Interactive Models over Decision-Dependent Distributions. In: Proceedings of the 14th Asian Conference on Machine Learning  (ACML'22), Hyderabad, India, 2022. J. Li*, J.-Q. Guo and W. Gao. Data removal from an AUC optimization model. Proceedings of the 26th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD'22), Chengdu, China, 2022. W. Gao, T. Zhang, B.-B. Yang and Z.-H. Zhou. On the Noise Estimation Statistics. Artificial Intelligence 293: 103451, 2021. W. Gao and Z.-H. Zhou. Towards convergence rate analysis of random forests for classification. Advances in Neural Information Processing Systems 33 (NeurIPS'20), Vancouver, Canada, 2020. S.-Q. Shen*, B.-B. Yang and W. Gao. AUC Optimization with a Reject Option. In: Proceedings of the 34th AAAI Conference on Artificial Intelligence (AAAI'20), New York, NY, 2020. B.-B. Yang*, W. Gao and M. Li. On the Robust Splitting Criterion of Random Forest. In: Proceedings of the 19th IEEE International Conference on Data Mining ((ICDM'19), Beijing, China, 2019. B.-B. Yang*, S.-Q. Shen and W. Gao. Weighted Oblique Decision Trees. In: Proceedings of the 33rd AAAI Conference on Artificial Intelligence (AAAI'19), Honolulu, HW, 2019. M. Pang, W. Gao, M. Tao, Z.-H. Zhou. Unorganized malicious attacks detection. In: Advances in Neural Information Processing Systems 31 (NIPS'18), Montreal, Canada, 2018. W. Gao and Z.-H. Zhou. Dropout radermacher complexity of deep neural networks. Science China: Information Sciences 59:072104(12) 2016. W. Gao and Z.-H. Zhou. One-Pass AUC Optimization. Artificial Intelligence 236:1-29 2016. W. Gao, L. Wang, Y.-F. Li and Z.-H. Zhou. Risk minimization in the presence of label noise. In: Proceedings of the 30th AAAI Conference on Artificial Intelligence  (AAAI'16), Phoenix, AZ 2016. W. Gao and Z.-H. Zhou. On the consistency of AUC pairwise optimization. In: Proceedings of the 24th International Joint Conference on Artificial Intelligence  (IJCAI'15), Buenos Aires, Argentina 2015. W. Gao and Z.-H. Zhou. On the doubt about margin explanation of boosting. Artificial Intelligence 203:1-18 2013. W. Gao and Z.-H. Zhou. On the Consistency of Multi-label learning. Artificial Intelligence 199-200:22-44 2013. W. Gao, R. Jin, S. Zhu and Z.-H. Zhou. One-pass AUC optimization. In: Proceedings of the 30th Annual Conference on machine Learning  (ICML'13), Atlanta GA 2013. W. Gao and Z.-H. Zhou. Uniform convergence, statiliby and learnability for ranking problems. In: Proceedings of the 23rd International Joint Conference on Artificial Intelligence  (IJCAI'13), Beijing, China. [Best presentation] W. Gao and Z.-H. Zhou. On the consistency of multi-label learning. In: Proceedings of the 24th Annual Conference on Learning Theory  (COLT'11), Budapest, Hungary, 2011. W. Gao and Z.-H. Zhou. Approximation Stability and Boosting. In: Proceedings of the 21st International Conference on Algorithmic Learning Theory (ALT'10), Canberra, Australia, 2010. W. Gao, Q.-H. Hou and G. Xin. On P-partitions related to ordinal sums of posets. European Journal of Combinatorics, 30:1370-1381 2009. last modified@2020-11",
  "content_length": 5996,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:39"
}