{
  "name": "Wei Pang 0001",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/wei-pang",
  "status": "success",
  "content": "Wei Pang - Heriot-Watt Research Portal View Scopus Profile Wei Pang Prof. Professor, School of Mathematical & Computer SciencesProfessor, School of Mathematical & Computer Sciences, Computer Science https://orcid.org/0000-0002-1761-6659 EmailW.Panghw.acuk EH14 4ASUnited Kingdom Accepting PhD StudentsPhD projectsI am interested in supervising projects related to bio-inspired approaches to machine learning and data mining. Willing to speak to media 20022026 Research activity per year Personal profile Research interestsMachine Learning and Data Mining Data clusteringBio-inspired Machine Learning, including immune-inspired neural architecture searchExplainable and accountable AIgraph neural networks as applied in molecular property predictionDeep learning as applied in health, medical domains, and biology. Bio-inspired Computation Swarm IntelligenceArtificial Immune SystemsPhysarum-inspired ComputingEvolutionary Computation Qualitative Reasoning Learning Qualitative Differential EquationsQualitative and Semi-quantitative Simulation BiographyPlease see my personal webpage and lab page for more information:  https://pangweijlu.github.io/ I am leading the BCML Lab @Heriot-Watt:   https://bioml.eu.org/ I am also a member of Edinburgh Centre for Robotics: https://www.edinburgh-robotics.org/academics/wei-pangPress ProfileMy work in collaboration with Bristol was featured in Nature as a technology features article on 18 February 2025. We explored how we could use machine learning and whole-cell modelling to facilitate the design of E. coli genomes. Nature Article  Our WorkThe team of MSc students that I supervised won Data Lab's Innovation Challenge in 2020, featured in The National, digit.fyi, and Circular Glasgow.Featured on the Cover Page of Royal Society of Edinburgh ResourceE: https://www.rse.org.uk/publication/resource-autumn-2015/The EPSRC project “Manufacturing Immortality” was mentioned by BBC Radio 4 Today: https://www.bbc.co.uk/programmes/b09kq1grMentioned by the CRUK Oxford Centre for the Endo.AI project: https://www.oxcode.ox.ac.uk/news/early-detection-sandpit-artificial-intelligence-in-medical-image-analysisMentioned by Oxford Centre for Early Cancer Detection for the Hame-AI project: https://www.oxcode.ox.ac.uk/news/early-detection-artificial-intelligence-and-digital-pathology-sandpit Scottish Crucible Reflections: https://scottishcrucible.org.uk/dr-wei-pang-scottish-crucible-2015/ Speak for the MSc AI program and Data Lab scholarships when I was Director of MSc AI and Data Lab Coordinator at Aberdeen: 2019: https://theorkneynews.scot/2019/05/02/msc-artificial-intelligence-ai-scholarships-at-aberdeen-university/   2018: https://www.energyvoice.com/other-news/175874/aberdeen-university-secures-75600-worth-of-ai-scholarships/Data Lab Award at Aberdeen:  https://www.abdn.ac.uk/ncs/news/12039/   https://www.abdn.ac.uk/ncs/news/12967/ DeepSwarm: 1)Best Paper Award: https://www.abdn.ac.uk/ncs/news/13396/  2)Towards Data Science Tutorial: https://towardsdatascience.com/ants-can-tell-you-how-to-wire-your-neurons-7cb9462b83bbKey Research Words/PhrasesMachine Learning, Artificial Intelligence, Data Mining, Modelling and Simulation, Computational Intelligence, Artificial Immune Systems, Swarm Intelligence, Explainable AI, Accountable AI Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Wei Pang is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles algorithms INIS 100% learning INIS 84% data INIS 63% optimization INIS 47% information INIS 37% datasets INIS 36% images INIS 35% Experimental Result Computer Science 30% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2002 2015 2016 2018 2019 2020 2021 2022 2023 2024 2025 2026 93 Article 57 Conference contribution 9 Paper 9 Conference article 12 More 3 Preprint 2 Book 2 Chapter 2 Working paper 1 Other report 1 Meeting abstract 1 Review article Research output per year Research output per year Accelerated design of Escherichia coli reduced genomes using a whole-cell model and machine learningGherman, I. M., Sharma, K., Rees-Garbutt, J., Pang, W., Abdallah, Z. S., Gorochowski, T. E., Grierson, C. S. & Marucci, L., 15 Oct 2025, In: Cell Systems. 16, 10, 101392.Research output: Contribution to journal › Article › peer-review Open AccessFile genes 100% design 100% escherichia coli 100% machine learning 100% Machine Learning 100% 1 Downloads (Pure) A deep learning based approach for automatic cardiac events identificationLi, Y., Hong, K., Shi, X., Pang, W., Xiao, Y., Zhao, P., Xu, D., Song, C., Zhou, X. & Zhou, Y., Feb 2025, In: Biomedical Signal Processing and Control. 100, Part 2, 107164.Research output: Contribution to journal › Article › peer-review prediction 100% learning 100% classification 100% assessments 100% Deep Learning Method 100% 1 Citation (Scopus) A generalized neural solver based on LLM-guided heuristic evoluation framework for solving diverse variants of vehicle routing problemsChi, M., Pang, W., Wu, X., Zhao, P., Li, Y., Wang, T., Qian, J., Xiao, Y., Wang, L. & Zhou, Y., 15 Jan 2026, In: Expert Systems with Applications. 296, Part A, 128876.Research output: Contribution to journal › Article › peer-review vehicles 100% routing 100% Vehicle Routing 100% Large Language Model 100% populations 40% A Lightweight Model LGCSPNet for Sitting Posture Risk Management ApplicationsWang, D., Pang, W., Cao, Z., Song, L., An, L., Wu, X., Zhao, P., Wang, L. & Zhou, Y., 1 Oct 2025, In: Expert Systems with Applications. 291, 128486.Research output: Contribution to journal › Article › peer-review risks 100% applications 100% graphs 100% management 100% Risk Management 100% An Efficient Diffusion-based Non-Autoregressive Solver for Traveling Salesman ProblemWang, M., Zhou, Y., Cao, Z., Xiao, Y., Wu, X., Pang, W., Jiang, Y., Yang, H., Zhao, P. & Li, Y., 20 Jul 2025, KDD '25: Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining V.1. Association for Computing Machinery, p. 1469-1480 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Diffusion Model 100% solutions 100% diffusion 100% Traveling Salesman Problem 100% One Step 50% 2 Citations (Scopus) View all 180 research outputs Datasets Public Attention Text Dataset on Circular Economy for Topic ModellingSong, J. (Creator), Yuan, Y. (Creator), Chang, K. (Creator), Xu, B. (Creator), Xuan, J. (Creator) & Pang, W. (Creator), Heriot-Watt University, 25 Jun 2025DOI: 10.17861/85bf3f9d-dc42-4b5c-8e29-47ddd0f0f687Dataset PRIME Survey Dataset of Minoritised Ethnic People’s Engagement with Online ServicesNetto, G. (Creator), Baillie, L. (Creator), Pang, W. (Creator), Shahandashti, S. (Creator), Rizvi, M. (Creator), Yuan, Y. (Creator), Lewinska, P. (Creator), Dodd, C. (Creator), Islam, F. (Creator), Hasan, S. (Creator), Whyte, L. J. (Creator) & Song, J. (Data Manager), Heriot-Watt University, 7 Apr 2025DOI: 10.17861/db813826-e45d-4274-b4c3-7ecdbf2336a5Dataset Prizes 2015 Scottish Crucible project awarded by President of Royal Society of EdinburghPang, W. (Recipient), 2015Prize: Prize (including medals and awards) crucibles 100% ADMA 2016 Best Paper Runner UpPang, W. (Recipient), 2016Prize: Prize (including medals and awards) data 100% applications 100% mining 100% conferences 100% Data Mining 100% Best Paper Presentation Award, ICOSP 2025Pang, W. (Recipient), Yuan, Y. (Recipient), Kefan, C. (Recipient) & Rizvi, M. (Recipient), Dec 2024Prize: Prize (including medals and awards) awards 100% User Experience 100% User Modeling 100% Graph Neural Network 100% data 50% Best Presentation Award in The 10th International Conference on Signal ProcessingPang, W. (Recipient), 21 Dec 2024Prize: Prize (including medals and awards) data 100% modeling 100% graphs 100% processing 100% neural networks 100% Excellent Oral Presentation Award at the 5th International Conference on Artificial Intelligence, Big Data and AlgorithmsPang, W. (Recipient), Yuan, Y. (Recipient), Rizvi, M. (Recipient), Baillie, L. (Recipient), Kefan, C. (Recipient) & Edmondson, A. (Recipient), 2025Prize: Prize (including medals and awards) View all 7 prizes Press/Media Work mentioned in Nature Technology FeaturesPang, W.18/02/251 item of Media coveragePress/Media: Research Courses F20ML: Statistical Machine LearningBatatia, H. & Pang, W.1/09/23 → 31/08/24Course F21BC: Biologically Inspired ComputationBatatia, H., Lones, M. A. & Pang, W.1/09/21 → …Course F90AM: Advanced Machine LearningBatatia, H., Pang, W. & Yoo, W. W.1/09/24 → …Course",
  "content_length": 9213,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:46"
}