{
  "name": "Wei Hu 0007",
  "homepage": "http://ws.nju.edu.cn/~whu",
  "status": "success",
  "content": "Websoft: Wei Hu apachejspωiki G’day (anonymous guest) User Preferences Log inRegister a new user! For full search, hit enter... Recent Searches Wei Hu ☰ Info 2 Version : 14 Date Modified : 31-May-2024 19:09 Author : 胡伟 More Info... Attachments2 Reading time: 1.9 mins, 427 words Edit More... View Page Source Show Reader View 中文版本 For more information, please visit my group website E-mail: whu (at) nju.edu.cn Address: 163 Xianlin Ave., Nanjing, Jiangsu, China Zipcode: 210023 Office: CS Bldg. 405; Mengminwei Bldg. 2611 Phone: +86-25-89681523 Bio# I am a full professor and Ph.D. supervisor at the Department of Computer Science and Technology, Nanjing University, China. I obtained my Ph.D. in Computer Software and Theory in 2009 and my B.S. in Computer Science and Technology in 2005, both from Southeast University. I joined the faculty of Nanjing University in Dec. 2009. From Nov. 2007 to May 2008, I was appointed as visiting student at Vrije Universiteit Amsterdam, advised by Prof. Frank van Harmelen. From Sep. 2008 to Dec. 2008, I interned at IBM Research - China. From Sep. 2014 to Sep. 2015, I was appointed as visiting scholar at Stanford University, working with Prof. Michel Dumontier, From Nov. 2016 to May 2017, I was appointed as visiting scholar at the University of Texas at Arlington, working with Prof. Chengkai Li, From Jun. 2017 to Nov. 2017, I was appointed as visiting professor at the University of Toronto, working with Prof. Sheila McIlraith. Research Interests# At present, my research mainly focuses on artificial intelligence, databases, and cross-research in medicine. Specifically, Knowledge graph, including representation learning and foundation models Database, including entity alignment, crowdsourcing, and blockchain Digital medicine: with the National Institute of Health Data Science at Nanjing University Courses# For undergraduates: Introduction to Databases For Postgraduates: Knowledge Engineering with Semantic Web Technologies Publications# Please visit the following links directly: Google Scholar DBLP Fundings and Awards# Continual Learning based Knowledge Graph Fact Checking, NSFC 62272219 Representation Learning based RDF Data Linkage, NSFC 61872172 Crowdsourcing Entity Linkage for the Semantic Web, NSFC 61370019 Object Coreference Resolution on the Semantic Web, NSFC 61003018 ... CHIP Best Paper Award 2021 CCKS Best English Paper Award 2018 Awardee of Nanjing University Study and Research Abroad Program 2013 Outstanding Instructor for Nanjing University Undergraduate Innovation Program 2012 JIST Best Paper Award 2011 IBM China Excellent Student 2008 ISWC Best Paper Nominee 2007 Professional Services# Member of CCF Technical Committee on Databases Member of CIPSC Technical Committee on Language and Knowledge Computation Member of JSCS Technical Committee on Big Data Member of JSAI Technical Committee on Knowledge Engineering and Intelligent Services W3C Advisory Committee Representative of Nanjing University Associate Editor of Transactions on Graph Data and Knowledge Editorial Board Member of Big Data Research Editorial Board Member of Data Intelligence Secretary of CS Department for Foreign Affairs Students# Please visit my group website This page (revision-14) was last changed on 31-May-2024 19:09 by 胡伟Top /*hide the default jspwiki logo */ a.logo { border:none; text-indent:-99em;} a.logo b:before { content:\"\"; } /* put the new logo, attached to this page */ a.logo { background: url(); background-size: contain; background-repeat: no-repeat; background-position: center; height: 60px; width: 60px; /* add a fancy button like effect */ /* box-shadow:0 0 .25em white; */ /* border-radius:2em; */ /* background-color: rgba(255,255,255,0.15); */ } 首页 成员 项目 论著 内部 Home Members Publications GitHub 欢迎访问万维网软件研究组 Welcome to Websoft JSPWiki v2.11.2",
  "content_length": 3825,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:40"
}