{
  "name": "Wei Tsang Ooi",
  "homepage": "http://www.comp.nus.edu.sg/~ooiwt",
  "status": "success",
  "content": "Wei Tsang Ooi's Home Page Wei Tsang Ooi Associate Professor, Department of Computer Science, National University of Singapore Co-Director, IPAL, a Franco-Singaporean Joint Research Lab Home Publications Talks Services Courses Students Goodies research interest Multimedia Systems / Networking / Interaction My main research work falls under three major areas: multimedia, networking, and interaction. Current topics of research include 3D streaming, zoomable video streaming, and networked virtual environments. My side interest includes building efficient, robust, and human-friendly interactive intelligent systems. I am a member of IPAL, a Franco-Singaporean International Research Lab, currently serving as its NUS co-director. recent papers QUETRA: A Queuing Theory Approach to DASH Rate Adaptation with Praveen Kumar Yadav and Arash Shafiei, MM'17 [PDF] QUETRA is a simple rate adaptation algorithm for DASH based on an analytical model that relates the throughput, buffer, and bitrate. Unlike many existing methods, QUETRA does not require any \"magic numbers\" (weights or thresholds). We show that QUETRA perform better than BBA and BOLA, two state-of-the-art methods in a wide range of settings. If you work on DASH rate adaptation, checkout this work! more publications.. recent courses Programming Methodology I and II Since 2017, I have the pleasure of co-teaching first year students CS2030/S, an introductory module to OOP and FP using Java, as well as CS1010, an introductory programming module in C. I have also developed a set of open notes for these modules. I previously taught CS2105, an introductory course on computer networking, CS4344, an advanced course on networking and systems support for multi-player games, CS5229, a graduate-level course where we look into classic papers on the Internet, CS2106 an introductory undergraduate course on operating systems, and CS3283/4 a project class where students work in teams to build cool applications, applying sound software engineering practices and principles. (not so) recent talks The Best Interactive System is a Non-Interactive System A keynote given at The 1st International Workshop on Interactive Content Consumption (WSICC), June 2013. You can download the slides as PDF. more talks.. current activities none more services.. biography About Me I received my B. Sc. (Hon.) degree from the Department of Information Systems and Computer Science (now School of Computing), NUS in 1996, and Ph. D. from Cornell University, Ithaca, NY in 2001. I spent a year as postdoc at Berkeley Multimedia Research Center in U.C. Berkeley, before re-joining NUS in 2002. I came from Alor Setar, Malaysia. View C.V. in PDF format (last updated: April 2025) Contact AS6, #05-14, Department of Computer Science, National University of Singapore, Singapore 117417. dcsooiwt@nus.edu.sg TEL: +65 6516 4463 FAX: +65 6779 1610",
  "content_length": 2880,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:45"
}