{
  "name": "Wei Shen 0002",
  "homepage": "https://shenwei1231.github.io",
  "status": "success",
  "content": "Wei Shen - Wei Shen （沈为） Wei ShenProfessor Shanghai Jiao Tong University Follow Email Github Google ScholarProfessor Artificial Intelligence Institute, Shanghai Jiao Tong University 800 Dongchuan Road, Software Building, Shanghai 200240 ChinaI'm looking for self-motivated students working with me on computer vision and medical image analysis for 2026. For prospective students, please send me an email with your CV and transcript.Research InterestsMy research interests lie in the fields of computer vision, machine learning, deep learning, and medical image analysis, particularly in image segmentation, 3D vision and their application to medical image analysis.Short BioWei Shen is a professor at the Artificial Intelligence Institute, Shanghai Jiao Tong University. He was an Assistant Research Professor at the Department of Computer Science, Johns Hopkins University, worked with Bloomberg Distinguished Professor Alan Yuille. He received his B.S. and Ph.D. degrees from Huazhong University of Science and Technology in 2007 and in 2012, respectively. In 2012, he joined Shanghai University, served as a Lecturer and then an Associate Professor until Oct 2018. He also worked as a research intern with Prof. Zhuowen Tu at Microsoft Research Asia. He has over 80 peer-reviewed publications in computer vision and machine learning related areas, including IEEE Trans. PAMI, IEEE Trans. Image Processing, IEEE Trans. Medical Imaging, NeurIPS, ICML, ICCV, CVPR, ECCV and MICCAI. He is an Area Chair for ICML 2025/2026, ICCV 2025, NeurIPS 2023/2024/2025 and CVPR 2022/2023/2026. He is an Associate Editor for Pattern Recognition and SCIENCE CHINA Information Sciences. He receives the MICCAI Young Scientist Award in 2023 and CSIG Young Scientist Award in 2025.Recent NewsI was awarded CSIG Young Scientist Award.I will serve as an Area Chair for ICML 2026.One paper has been accepted to JBHI.Five papers have been accepted to AAAI 2026, where one is oral.Two papers have been accepted to NeurIPS 2025, where one is oral.HyperET: Efficient Training in Hyperbolic Space for Multi-modal Large Language ModelsOPMapper: Enhancing Open-Vocabulary Semantic Segmentation with Multi-Guidance InformationI will serve as an Area Chair for CVPR 2026.Two papers have been accepted to ICCV 2025.Generalized Tensor-based Parameter-Efficient Fine-Tuning via Lie Group TransformationsA Token-level Text Image Foundation Model for Document UnderstandingMy PhD student Chen Yang passed his doctoral oral defense. Congratulations!One paper has been accepted to ICML 2025.Tackling View-Dependent Semantics in 3D Language Gaussian SplattingMy computer vision textbook Hands On Computer Vision was published, which is now available for purchase at JD and other booksellers.One paper has been accepted to IJCV.Segment Anything in 3D with Radiance FieldsFive papers have been accepted to CVPR 2025.I will serve as an Area Chair for NeurIPS 2025.One paper has been accepted to IEEE TPAMI.CCDPlus: Towards Accurate Character to Character Distillation for Text RecognitionTwo papers have been accepted to ICLR 2025.I will serve as an Area Chair for ICML 2025.Two papers have been accepted to AAAI 2025.Segment Any 3D GaussiansI will serve as an Area Chair for ICCV 2025.One paper has been accepted to ACM Trans. Graphics (Siggraph Asia 2024).GaussianObject: High-Quality 3D Object Reconstruction from Four Views with Gaussian SplattingFour papers have been accepted to ECCV 2024.Bridging Synthetic and Real Worlds for Pre-training Scene Text DetectorsTendency-driven Mutual Exclusivity for Weakly Supervised Incremental Semantic SegmentationPosFormer: Recognizing Complex Handwritten Mathematical Expression with Position Forest TransformerUniProcessor: A Text-induced Unified Low-level Image ProcessorTwo papers have been accepted to MICCAI 2024.EndoGSLAM: Real-Time Dense Reconstruction and Tracking in Endoscopic Surgeries using Gaussian SplattingMissing as Masking: Arbitrary Cross-modal Feature Reconstruction for Incomplete Multimodal Brain Tumor SegmentationI serve as an Associate Editor for Pattern Recognition from 2024.I will serve as an Area Chair for NeurIPS 2024.One paper has been accepted to IEEE TMI.Efficient Deformable Tissue Reconstruction via Orthogonal Neural PlaneOne paper has been accepted to CVPR 2024.Parameter Efficient Fine-tuning via Cross Block Orchestration for Segment Anything ModelThree papers have been accepted to AAAI 2024.SAM-PARSER: Fine-tuning SAM Efficiently by Parameter Space ReconstructionViTree: Single-Path Neural Tree for Step-Wise Interpretable Fine-Grained Visual CategorizationPartial Label Learning with a PartnerOur MICCAI 2023 paper receives Young Scientist Award.Neural LerPlane Representations for Fast 4D Reconstruction of Deformable TissuesOne paper has been accepted to NeurIPS 2023.Segment Anything in 3D with NeRFsI will serve as an Area Chair for WACV 2024.Three papers have been accepted to ICCV 2023.I will serve as an Area Chair for NeurIPS 2023.Four papers have been accepted to CVPR 2023.One paper has been accepted to IEEE TPAMI.A Survey on Label-efficient Deep Segmentation: Bridging the Gap between Weak Supervision and Dense PredictionI will serve as an Area Chair for CVPR 2023.One paper has been accepted to NeurIPS 2022.Video-based Human-Object Interaction Detection from Tubelet TokensThree papers have been accepted to ECCV 2022.CP2: Copy-Paste Contrastive Pretraining for Semantic SegmentationIwin: Human-Object Interaction Detection via Transformer with Irregular WindowsBézierPalm: A Free Lunch for Palmprint RecognitionTwo papers have been accepted to ACM MM 2022.Skeleton2Humanoid: Animating Simulated Characters for Physically-plausible Motion In-betweeningSaliency in Augmented RealityI will serve as an Area Chair for ACCV 2022.Two papers have been accepted to CVPR 2022.ContrastMask: Contrastive Learning to Segment Every ThingEnd-to-End Human-Gaze-Target Detection with TransformersOne paper has been accepted to ICLR 2022.iBOT: Image BERT Pre-Training with Online TokenizerOne paper has been accepted to NeurIPS 2021.Glance-and-Gaze Vision TransformerI will serve as a Senior Program Committee (SPC) Member for AAAI 2022.I will serve as an Area Chair for CVPR 2022.One paper has been accepted to ICCV 2021.Looking Here or There? Gaze Following in 360-Degree ImagesTwo papers have been accepted to CVPR 2021, where one is oral.Deeply Shape-guided Cascade for Instance SegmentationDual Attention Guided Gaze Target Detection in the WildOne paper has been accepted to TMI.Learning Inductive Attention Guidance for Partially Supervised Pancreatic Ductal Adenocarcinoma PredictionTwo papers have been accepted to ICLR 2021.CO2: Consistent Contrast for Unsupervised Visual Representation LearningShape-Texture Debiased Neural Network Training",
  "content_length": 6798,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:44"
}