{
  "name": "Wei Zhao 0033",
  "homepage": "https://www.abdn.ac.uk/people/wei.zhao",
  "status": "success",
  "content": "Dr Wei Zhao | The University of Aberdeen Dr Wei Zhao Dr Wei ZhaoLecturer Accepting PhDs About Email Addresswei.zhao@abdn.ac.ukSchool/DepartmentSchool of Natural and Computing Sciences Personal Website Biography I am a researcher, a lecturer and a PI in NLP at the University of Aberdeen. I also teach a seminar course at Heidelberg University, Germany. Research Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Accepting PhDsView Research Area Publications Page 1 of 1 Results 1 to 6 of 6 Exploring Diachronic and Diatopic Changes in Dialect Continua: Tasks, Datasets and Challenges 2024 - PublishedÇelikkol, M., Körber, L., Zhao, W. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/2024.lchange-1.2[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/b770ac22-b64a-43d4-a427-24c3a3112a46/download[ONLINE] View publication in ScopusExploring Sound Change Over Time: A Review of Computational and Human Perception 2024 - PublishedHe, S., Zhao, W. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/2024.lchange-1.17[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/2b712149-28bf-4967-a2cc-aacf8183d133/download[ONLINE] View publication in ScopusPresence or Absence: Are Unknown Word Usages in Dictionaries? 2024 - PublishedMa, X., Schlechtweg, D., Zhao, W. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/2024.lchange-1.5[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/4707fb7f-7619-4060-92d9-682d06740612/download[ONLINE] View publication in ScopusNormed Spaces for Graph Embedding 2024 - PublishedTaha, D., Zhao, W., Riestenberg, M. J., Strube, M. Transactions on Machine Learning Research, vol. 2024, no. 5, 1984Contributions to Journals: Articles[ONLINE] https://openreview.net/pdf?id=4E2XLydJiv[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/9d42c031-3e4e-4521-95e7-ac1d4a062350/download[ONLINE] https://openreview.net/forum?id=4E2XLydJivGraph-based Clustering for Detecting Semantic Change Across Time and Languages 2024 - PublishedMa, X., Strube, M., Zhao, W. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2024.eacl-long.93/[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/29baa9b8-49fc-4241-8c08-3156c277ed20/downloadTowards Explainable Evaluation Metrics for Machine Translation 2024 - PublishedLeiter, C., Lertvittayakumjorn, P., Fomicheva, M., Zhao, W., Gao, Y., Eger, S. Journal of Machine Learning Research, vol. 25, no. 75, pp. 1-49Contributions to Journals: Articles[ONLINE] http://jmlr.org/papers/v25/22-0416.html[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/40397f40-7e2a-47ad-95fc-3f3796ecefad/download Refine Chapters in Books, Reports and Conference Proceedings Conference Proceedings (4) Contributions to Journals Articles (2) Update",
  "content_length": 3059,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:51"
}