{
  "name": "Weichen Liu",
  "homepage": "https://personal.ntu.edu.sg/liu",
  "status": "success",
  "content": "Welcome to Dr. Weichen Liu's Page Short Biography Dr. Weichen Liu is an Associate Professor at the College of Computing and Data Science (CCDS) (formerly known as the School of Computer Science and Engineering), Nanyang Technological University (NTU), Singapore. He was a Nanyang Assistant Professor (NAP) during 2018-2023. He received his PhD degree from the Hong Kong University of Science and Technology, and the MEng and BEng degrees from Harbin Institute of Technology, China. Dr. Liu serves as an Associate Editor of IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), an Associate Editor of IEEE Embedded Systems Letters (ESL), and a Subject Area Editor of Elsevier Journal of Systems Architecture (JSA). He served as a General Chair of the 25th IEEE International Symposium on Real-Time Computing (ISORC 2020), a Program Chair of ISORC 2019, a Track Chair of ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED 2021, 2022), IEEE International Symposium on Embedded Multicore/Many-core Systems-on-Chip (MCSoC 2023), and a chair, technical program committee member, organizing committee member and guest editor of over 20 premier international conferences, workshops, forums and journals, including DAC, ICCAD, ASP-DAC, CODES+ISSS, RTSS, RTAS, ISLPED, GLSVLSI, MSC@ESWEEK, SRF@ASP-DAC, EAI@ICDCS, etc. Dr. Liu authored and co-authored more than 180 research papers in peer-reviewed journals, conferences and books, and received the best paper candidate awards from DAC 2024, DATE 2023, GLSVLSI 2022, ASP-DAC 2020, 2019 and 2016, CASES 2015, CODES+ISSS 2009, and the best poster paper awards from SRF@ASP-DAC 2020 and 2017, RTCSA 2017, AMD-TFE 2010. His research was supported by leading industrial partners including Intel, AMD, Xilinx, MediaTek, Huawei and HP. Research Interests Embedded and Real-Time Systems Many-Core Systems Electronic/Photonic Network-on-Chip Machine Learning Acceleration Edge Intelligence Honors & Awards Special Mention, Singapore Open Research Awards, Singapore, 2024 Best Paper Candidate Award, DAC, US, 2024 HiPEAC Paper Award, for the paper published at DAC 2023, Europe, 2023 Best Paper Candidate Award, DATE, Belgium, 2023 Best Research Award, STCAI, Singapore, 2022 Best Paper Candidate Award, GLSVLSI, US, 2022 Publicity Paper, DAC, US, 2022 3rd Place, IEEE EDAthon EDA Programming Competition, Hong Kong, 2020 Best Poster Award (Presentation), ACM SIGDA Student Research Forum at ASP-DAC, China, 2020 Best Paper Candidate Award, ASP-DAC, China, 2020 Best Paper Candidate Award, ASP-DAC, Japan, 2019 Founding Investigator, HP-NTU Digital Manufacturing Corporate Lab, Singapore, 2018 (News: 1, 2) Nanyang Assistant Professorship Award, Nanyang Technological University, Singapore, 2018 A. Richard Newton Young Student Advisor Award, DAC, US, 2017 Best Poster Paper Award, RTCSA, Taiwan, 2017 Best Poster Award (Most Popular), ACM SIGDA Student Research Forum at ASPDAC, Japan, 2017 Best Paper Candidate Award, ASP-DAC, Macau, 2016 Best Paper Candidate Award, CASES, Amsterdam, The Netherlands, 2015 Best Paper Candidate Award, CODES+ISSS, Grenoble, France, 2009 Best Poster Award, AMD Technical Forum and Exhibition (AMD-TFE), Taiwan, 2010 100-Outstanding-Scholar Award, Chongqing University, China, 2013 Chongqing Outstanding Talents, Chongqing Government, China, 2014 MediaTek Inc. & Wu Ta-You Scholar Award, MediaTek Inc., Taiwan, 2005 About Updates MSC@ESWEEK is online. SRF@ASP-DAC 2021 is online. I am looking for self-motivated PhD students who have strong academic background and plan to pursue PhD/Master degree at NTU. Please send me your CV if interested! I am looking for postdoctoral fellows in the broad areas of machine learning acceleration, in-memory computing, electronic/photonic network-on-chip, many-core systems, scheduling, real-time systems and embedded systems. Please feel free to drop me an email if interested! I am looking for exchange PhD students for 6-12 months visiting at NTU. Please feel free to drop me an email if interested!",
  "content_length": 4060,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:53"
}