{
  "name": "Weidan Xiong",
  "homepage": "https://dianaxiong.github.io",
  "status": "success",
  "content": "Weidan Xiong Search 熊卫丹 Weidan Xiong Assistant Professor Shenzhen University Biography I am currently an Assistant Professor within VCC, Shenzhen University. Before that, I was an Associate Researcher in Guangdong Laboratory of Artificial Intelligence and Digital Economy (SZ), a Research Fellow in HP-NTU Digital Manufacturing Corporate Lab under the supervision of Prof. Jianmin Zheng, and a R&D engineer in Tencent (SSP offer). I obtained my Ph.D. degree in Electronic and Computer Engineering from The Hong Kong University of Science and Technology, under the supervision of Prof. Pedro V. Sander and Prof. Ajay Joneja. And I received my B. Engineering. in Software Engineering from Huazhong University of Science and Technology. My research interests include computer graphics, architectural geometry, and artificial intelligence. In particular, our group focus on topics related to texture generation/design with AI, 3D reconstruction with UAV, or rapid prototyping with 3D printing. I’m looking for Master and MPhil students with passion in graphics, good coding skill and strong curiosity. Reach me if you are interested. Email: xiongweidan@gmail.com Office: Shenzhen University (Cang Hai), Zhizhen Building, 804B Publications Aerial Path Planning for Urban Geometry and Texture Co-Capture ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2025) Weidan Xiong, Bochuan Zeng, Ziyu Hu, Jianwei Guo, Ke Xie, Hui Huang* PDF Video DiffTex: Differentiable Texturing for Architectural Proxy Models ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2025) Weidan Xiong, Yongli Wu, Bochuan Zeng, Jianwei Guo, Dani Lischinski, Daniel Cohen-Or, Hui Huang* PDF LightUrban: Similarity Based Fine-grained Instancing for Lightweighting Complex Urban Point Clouds Computer Graphics Forum (Pacific Graphics 2024) Ziang Lu, Weidan Xiong, Peng Ren, Jinyuan Jia* PDF TwinTex: Geometry-aware Texture Generation for Abstracted 3D Architectural Models ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2023) Weidan Xiong, Hongqian Zhang, Botao Peng, Ziyu Hu, Yongli Wu, Jianwei Guo, Hui Huang* PDF Code Video Digital Product Design and Engineering Analysis Techniques, Chapter 2 Elsevier, Digital Manufacturing Tianyu Zhou, Weidan Xiong, Yuki Obata, Carlos Lange, Yongsheng Ma Source Document ShapeArchit: Shape-inspired Architecture Design with Space Planning Computer-Aided Design Weidan Xiong, Pengbo Zhang, Pedro V. Sander*, Ajay Joneja* PDF Video Rationalizing Architectural Surfaces Based on Clustering of Joints IEEE Transactions on Visualization and Computer Graphics Weidan Xiong, Chong Mo Cheung, Pedro V. Sander*, Ajay Joneja* PDF Video Shape-inspired Architecture Design ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games 2018 Weidan Xiong, Pengbo Zhang, Pedro V. Sander*, Ajay Joneja* PDF Video Patents “一种无人机路径规划方法、装置、终端及存储介质”, 发明专利, 2024. “用于重建结构化模型几何与纹理的无人机路径规划软件”, 软件著作权, 2024. “一种建筑纹理重建方法、系统、设备及存储介质”, 发明专利, 2024. “基于可微分渲染的建筑纹理重建软件”, 软件著作权, 2024. “Design Element Placement on 3D Surfaces”, US Patent, 2024. “图像补全方法、装置、计算机设备和存储介质”, 发明专利, 2023. “基于扩散模型的建筑纹理贴图补全软件”, 软件著作权, 2023. “一种用于纹理贴图的视角选择和纹理对齐方法及相关设备”, 发明专利, 2023. “纹理贴图的视角选择和纹理对齐软件”, 软件著作权, 2023. Talks “面向城市场景的超真实感模型构建”, 第二十五届中国虚拟现实大会 ChinaVR, Nov 2025, 青岛 “面向城市场景的三维建模与几何优化”, 中国计算机协会CCF图形学启明星夏令营, Aug 2025, 深圳 “面向大规模场景的细粒度模型轻量化技术”, 中国计算机图形学大会 ChinaGraph, Oct 2024, 黄山 “Intelligent Part Design”, in HP-NTU Corp Lab quarterly workshop, 2020-2021, Singapore. “Architectural Design from Sketches”, in Virtuos & NTU workshop, Sep 2021, Singapore. “Advances in Part Design with Additive Manufacturing”, the webinar on Disrupting Manufacturing with 3D Printing and Digital Technology, Nov 2020, Singapore. Meet the Group Mphil Students 屈恺杰 Kaijie Qu 2025 - present 董颖佳 Yingjia Dong 2025 - present Master Students 曾博川 Bochuan Zeng 2023 - present (looking for job opportunity) 刘俊麟 Junlin Liu 2023 - present (looking for job opportunity) 张明启 Mingqi Zhang 2023 - present (looking for job opportunity) 陈培华 Peihua Chen 2023 - present (looking for job opportunity) 李浩 Hao Li 2024 - present 冯仕豪 Shihao Feng 2024 - present 郝佳宁 Jianing Hao 2025 - present Gallery Moments Alumni Masters: 2022-2025: Yongli Wu (FP: RoboScience) 2022-2025: Ziyu Hu (FP: Ping An Bank) 2021-2024: Hongqian Zhang (Co-advised by Prof. Hui Huang from 2022, FP: Shenzhen Rural Commercial Bank) 2021-2024: Botao Peng (Co-advised by Prof. Hui Huang from 2022, FP: China Merchants) Others Hobbies: Oil painting, Jazz dance, bamboo flute. Language: Chinese (native), English (fluent), Cantonese (fluent). Cite × Copy Download",
  "content_length": 4571,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:53"
}