{
  "name": "Weifa Liang",
  "homepage": "https://www.cs.cityu.edu.hk/~weliang",
  "status": "success",
  "content": "Weifa Liang's Homepage Home Publication Research Weifa Liang (梁维发) Professor Dept of Computer Science City University of Hong Kong Office: YEUNG-G6510 Phone: +(852)-3442-4390 Fax: +(852)-3442-0503 Email: weifa dot liang at cityu dot edu dot hk I am a Professor in the Department of Computer Science at City University of Hong Kong. I received my BSc degree from Wuhan University, Master of Engineering degree from University of Science and Technology of China (USTC) in 1984 and 1989, respectively, and Ph.D degree from The Australian National University (ANU) in 1998, all in Computer Science. Prior to joining City University of Hong Kong, I was a Professor at The Australian National University. My research interests include wireless sensor networks, Mobile Edge Computing (MEC), Network Function Virtulization (NFV), Internet of Things (IoT), design and analysis of approximation algorithms and online algorithms, parallel and distributed algorithms, combinatorial optimization and graph theory. I have been actively publishing papers in the prestigious journals (e.g., TON, TMC, TPDS, TC, TCOM, TWC, JPDC, Theoretical Computer Science) and conferences (e.g., INFOCOM, ICDCS, IPDPS, ICPP, PerCom). I am an associate editor of IEEE Transactions on Communication. Current Research Interests Wireless sensor networks and Internet of Things (IoT) Mobile Edge Computing (MEC) and cloud computing Software Defined Networking (SDN) and Network Function Virtualization (NFV) Approximation and online algorithms Design and analysis of parallel and distributed algorithms Social networks and graph databases Graph theory Professional Services Associate Editor, IEEE Transactions on Communications Recruitment I am recruiting Ph.D students who have excellent background in computer science and are passionate about developing new technologies for next generation networks and distributed computing. If you are interested in the above mentioned research areas, please contact me by sending me an email to express your research interest. Also, please send me your CV, all academic transcripts (both undergraduate and postgraduate transcripts), 1-3 representative published conference and/or journal papers if you have, and one-page research statement as attachments in your email. Note that both undergraduates with BS degree and postgraduates are eligible for PhD study admissions at CityU. CityU application information: https://www.cityu.edu.hk/pg/research-degree-programmes/apply-now Copyright (c) 2021 Weifa Liang. All rights reserved.",
  "content_length": 2532,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:54"
}