{
  "name": "Weiguo Zheng",
  "homepage": "https://weiguozheng.github.io/index-en.html",
  "status": "success",
  "content": "Weiguo Zheng @ FDU Weiguo Zheng (中文主页) Associate Professor School of Data Science Fudan University Email: zhengweiguo@fudan.edu.cn Bio Dr. Weiguo Zheng is currently an Associate Professor in the School of Data Science, Fudan University. He was a postdoctoral research fellow in Department of Systems Engineering and Engineering Management, The Chinese University of Hong Kong, working with Prof. Hong Cheng and Prof. Jeffrey Xu Yu. He received the Ph.D. from School of Electronics Engineering and Computer Science, Peking University in 2015, advised by Prof. Dongyan Zhao and Prof. Lei Zou. He served as a visiting scholar in University of Texas Rio Grande Valley (former name: University of Texas - Pan American), working with Prof. Xiang Lian. I'm looking for highly-motivated students to work with me as Master students or Ph.D. students. If interested, please email me with your CV. Research Interests Weiguo Zheng has a broad interest in data management and understanding . His research focuses on graph data , such as knowledge graphs, natural language question answering, and social networks. More specifically, he is now conducting research into techniques that can make it easier to explore and query large-scale graphs. Beyond that, he is interested in the joint management and mining of neural and symbolic knowledge, aiming to deliver a comprehensive and integrated knowledge service. One significant benefit is to mitigate model illusions, promoting transparency, and facilitating knowledge updates for Large Language Models. Selected Publications * indicates corresponding author BEE: Towards Redundancy Reduction via Block-Separator Decomposition for Subgraph Matching Zhijie Zhang, Weiguo Zheng* SIGMOD 2026, in ACM SIGMOD International Conference on Management of Data (SIGMOD). Hi-PNG: Efficient Interval-Filtering ANNS via Hierarchical Interval Partition Navigating Graph Ming Yang, Yuzheng Cai, Weiguo Zheng* KDD 2025, in ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). SimGRAG: Leveraging Similar Subgraphs for Knowledge Graphs Driven Retrieval-Augmented Generation Yuzheng Cai，Zhenyue Guo, Yiwen Pei, Wanrui Bian, Weiguo Zheng* ACL 2025, in the Association for Computational Linguistics (ACL Findings). Revisiting the Inner Product Method: Optimizing Sparse Matrix Multiplication via Set Intersection Zheng Hu，Boyu Yang, Weiguo Zheng* CIKM 2025, in the 34th ACM International Conference on Information and Knowledge Management (CIKM). Accelerating Subgraph Matching through Fine-grained and Powerful Equivalences Yujie Lu, Zhijie Zhang, Weiguo Zheng*, Lei Zou VLDB 2025, in 51st International Conference on Very Large Data Bases (VLDB), PVLDB. A Comprehensive Survey and Experimental Study of Learning-based Community Search Xiaoxuan Gou, Weiguo Zheng*, Yuxiang Wang, Xiaoliang Xu, Zhiyuan Yu VLDB 2025, in 51st International Conference on Very Large Data Bases (VLDB), PVLDB. Space-Efficient Compact Representations for Graph Analytics Boyu Yang, Weiguo Zheng*, Xiang Lian, Lingfei Zheng ICDE 2025, in the 41st IEEE International Conference on Data Engineering (ICDE). Scalable GNN Training via Parameter Freeze and Layer Detachment Chang Gong, Boyu Yang, Weiguo Zheng*, Xing Huang, Weiyi Huang, Jie Wen, Shijie Sun, Bohua Yang DASFAA 2025, in International Conference on Database Systems for Advanced Applications (DASFAA). Accelerating DeepWalk via Context-Level Parameter Update and Huffman Tree Pruning (short paper) Chang Gong, Weiguo Zheng*, Hongwei Feng DASFAA 2025, in International Conference on Database Systems for Advanced Applications (DASFAA). Generating k-hop-constrained s-t Path Graphs Yuzheng Cai, Siyuan Liu, Weiguo Zheng*, Xuemin Lin, Chengbo Zhang, Xuecang Zhang IEEE TKDE, in IEEE Transactions on Knowledge and Data Engineering (TKDE), 2025. BⓈX: Subgraph Matching with Batch Backtracking Search Yujie Lu, Zhijie Zhang, Weiguo Zheng* SIGMOD 2025, in ACM SIGMOD International Conference on Management of Data (SIGMOD). Navigating Labels and Vectors: A Unified Approach to Filtered Approximate Nearest Neighbor Search Yuzheng Cai, Jiayang Shi, Yizhuo Chen, Weiguo Zheng* SIGMOD 2025, in ACM SIGMOD International Conference on Management of Data (SIGMOD). Answering Min-Max Resource-Constrained Shortest Path Queries over Large Graphs Haoran Qian, Weiguo Zheng*, Zhijie Zhang, Bo Fu IEEE TKDE, in IEEE Transactions on Knowledge and Data Engineering (TKDE), 2025. A Powerful Reducing Framework for Accelerating Set Intersections over Graphs Zheng Hu, Cong Xu, Weiguo Zheng* VLDB Journal, in The International Journal on Very Large Data Bases (VLDB J), 2024. CSPG: Crossing Sparse Proximity Graphs for Approximate Nearest Neighbor Search Ming Yang, Yuzheng Cai, Weiguo Zheng* NeurIPS 2024, in the 38th Annual Conference on Neural Information Processing Systems, NeurIPS. FSM: A Fine-grained Splitting and Merging Framework for Dual-balanced Graph Partition Chengjun Liu, Zhuo Peng, Weiguo Zheng*, Lei Zou VLDB 2024, in the 50th International Conference on Very Large Data Bases (VLDB), PVLDB. Accelerating Maximal Clique Enumeration via Graph Reduction Wen Deng, Weiguo Zheng*, Hong Cheng VLDB 2024, in the 50th International Conference on Very Large Data Bases (VLDB), PVLDB. HERO: A Hierarchical Set Partitioning and Join Framework for Speeding up the Set Intersection Over Graphs Boyu Yang, Weiguo Zheng*, Xiang Lian, Yuzheng Cai, X. Sean Wang SIGMOD 2024, in ACM SIGMOD International Conference on Management of Data (SIGMOD). A Comprehensive Survey and Experimental Study of Subgraph Matching: Trend, Unbiasedness, and Interaction Zhijie Zhang, Yujie Lu, Weiguo Zheng*, Xuemin Lin SIGMOD 2024, in ACM SIGMOD International Conference on Management of Data (SIGMOD). Triangular Stability Maximization by Influence Spread over Social Networks Zheng Hu, Weiguo Zheng*, Xiang Lian VLDB 2023, in the 49th International Conference on Very Large Data Bases (VLDB), PVLDB. Locality Sensitive Hashing for Optimizing Subgraph Query Processing in Parallel Computing System Peng Peng, Shengyi Ji, Zhen Tian, Hongbo Jiang, Weiguo Zheng, Xuecang Zhang KDD 2023, in ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) . Near-optimal Steiner Tree Computation Powered by Node Embeddings Boyu Yang，Weiguo Zheng* KAIS 2023, in Knowledge and Information System (KAIS). Controlling Styles in Neural Machine Translation with Activation Prompt Yifan Wang，Zewei Sun, Shanbo Cheng, Weiguo Zheng*, Mingxuan Wang ACL 2023, in the Association for Computational Linguistics (ACL Findings). Subgraph Reconstruction via Reversible Subgraph Embedding Boyu Yang，Weiguo Zheng* DASFAA 2023, in International Conference on Database Systems for Advanced Applications (DASFAA). Answering Label-Constrained Reachability Queries via Reduction Techniques Yuzheng Cai，Weiguo Zheng* DASFAA 2023, in International Conference on Database Systems for Advanced Applications (DASFAA). Question Answering over Knowledge Graphs via Machine Reading Comprehension Weidong Han, Zhaowu Ouyang, Yifan Wang，Weiguo Zheng* DASFAA 2023, in International Conference on Database Systems for Advanced Applications (DASFAA). MACRE: Multi-hop Question Answering over Knowledge Graphs via Contrastive Relation Embedding (short paper) Man Xu, Weiguo Zheng*, Deqing Yang DASFAA 2023, in International Conference on Database Systems for Advanced Applications (DASFAA). Towards Generating Hop-constrained s-t Simple Path Graphs Yuzheng Cai, Siyuan Liu, Weiguo Zheng*, Xuemin Lin SIGMOD 2023, in ACM SIGMOD International Conference on Management of Data (SIGMOD). Fast Continuous Subgraph Matching over Streaming Graphs via Backtracking Reduction Rongjian Yang, Zhijie Zhang, Weiguo Zheng*, Jeffrey Xu Yu SIGMOD 2023, in ACM SIGMOD International Conference on Management of Data (SIGMOD). Multi-document Question Answering Powered by External Knowledge Zhenting Yan, Weiguo Zheng* WISE 2022, in the 23rd International Conference on Web Information Systems Engineering (WISE). Evaluating Knowledge Graph Accuracy Powered by Optimized Human-machine Collaboration Yifan Qi, Weiguo Zheng*, Liang Hong, Lei Zou KDD 2022, in ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). Hybrid Subgraph Matching Framework Powered by Sketch Tree for Distributed Systems Yuejia Zhang, Weiguo Zheng*, Zhijie Zhang, Peng Peng, Xuecang Zhang ICDE 2022, in the 38th IEEE International Conference on Data Engineering (ICDE). Querying Maximum Quasi-independent Set by Pay-and-Recycle Xiaochen Liu, Weiguo Zheng*, Zhenyi Chen, Zhenying He, X. Sean Wang ICDE 2022, in the 38th IEEE International Conference on Data Engineering (ICDE). Towards Combinational Relation Linking over Knowledge Graphs Weiguo Zheng, Mei Zhang, Deqing Yang, Zeyang Zhang, Weidong Han, WWWJ 2021, in World Wide Web. Automated Query Graph Generation for Querying Knowledge Graphs Weiguo Zheng, Mei Zhang CIKM 2021, in 30th ACM International Conference on Conference on Information and Knowledge Management (CIKM). Accelerating Set Intersections over Graphs by Reducing-Merging Weiguo Zheng, Yifan Yang, Chengzhi Piao KDD 2021, in ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). Towards Computing A Near-Maximum Weighted Independent Set on Massive Graphs Jiewei Gu, Weiguo Zheng*, Yuzheng Cai, Peng Peng KDD 2021, in ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD). ESTI: Efficient k-Hop Reachability Querying over Large General Directed Graphs (workshop paper) Yuzheng Cai, Weiguo Zheng* DASFAA 2021, in the 26th International Conference on Database Systems for Advanced Applications (DASFAA). Incrementally Finding the Vertices Absent from the Maximum Independent Sets Xiaochen Liu, Weiguo Zheng*, Zhenyi Chen, Zhenying He, X. Sean Wang, PAKDD 2021, in the 25th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD). Maximizing the Reduction Ability for Near-maximum Independent Set Computation Chengzhi Piao, Weiguo Zheng*, Yu Rong, Hong Cheng, VLDB 2020, in the 46th I",
  "content_length": 14667,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:54"
}