{
  "name": "Weihang Wang 0001",
  "homepage": "https://weihang-wang.github.io",
  "status": "success",
  "content": "Weihang Wang @ University of Southern California Weihang Wang WiSE Gabilan Assistant Professor Department of Computer Science University of Southern California GCS 505K, 1031 Downey Way, Los Angeles, CA 90089, USA weihangw /at/ usc.edu Home Publications Teaching Students Services Menu I am a WiSE Gabilan Assistant Professor of Computer Science at the University of Southern California. I am broadly interested in artificial intelligence and software engineering, with a growing passion for using AI to bridge computational and biomedical sciences and help accelerate drug discovery and repurposing. I'm grateful that my research has been recognized with several awards, including N2Women Rising Stars in Networking and Communications (2024), University at Buffalo Exceptional Scholar - Young Investigator Award (2022), NSF CAREER Award (2021), Facebook Testing and Verification Research Award (2019), Mozilla Research Award (2019), and Maurice H. Halstead Memorial Research Award (2018). Updates 01/2025: Two papers accepted to WWW 2025. 08/2024: Really honored to be recognized as one of the 10 N2Women Rising Stars in Networking and Communications. 07/2024: Many thanks to NSF for supporting our research on developing a static analysis framework for WebAssembly! 05/2024: One paper accepted to ICML 2024. 01/2024: One paper accepted to WWW 2024. Publications WWW'25 WaSCR: A WebAssembly Instruction-Timing Side Channel Repairer. Liyan Huang, Junzhou He, Chao Wang, and Weihang Wang. In Proceedings of the 34th International World Wide Web Conference. [ Paper ] WWW'25 WBSan: Webassembly Bug Detection for Sanitization and Binary-Only Fuzzing. Xiao Wu, Junzhou He, Liyan Huang, Cai Fu, and Weihang Wang. In Proceedings of the 34th International World Wide Web Conference. [ Paper ] TIFS FG-SAT: Efficient Flow Graph for Encrypted Traffic Classification Under Environment Shifts. Susu Cui, Xueying Han, Dongqi Han, ZhiliangWang, Weihang Wang, Bo Jiang, Baoxu Liu, and Zhigang Lu. In IEEE Transactions on Information Forensics and Security (TIFS). vol. 20, pp. 5326-5339, May 2025. [ Paper ] ICML'24 StackSight: Unveiling WebAssembly through Large Language Models and Neurosymbolic Chain-of-Thought Decompilation. Weike Fang, Zhejian Zhou, Junzhou He, and Weihang Wang. In Proceedings of the 41st International Conference on Machine Learning. [ Paper ] SecureComm'24 Is This the Same Code? A Comprehensive Study of Decompilation Techniques for WebAssembly Binaries. Wei-Cheng Wu*, Yutian Yan*, Hallgrimur David Egilsson, David Park, Steven Chan, Christophe Hauser, and Weihang Wang. In the 20th EAI International Conference on Security and Privacy in Communication Networks. *Equal Contribution. A short version of this paper appeared in the CCS 2024 Workshop on Programming Languages and Analysis for Security (PLAS 2024). [ Paper ] WWW'24 WEFix: Intelligent Automatic Generation of Explicit Waits for Efficient Web End-to-End Flaky Tests. Xinyue Liu, Zihe Song, Weike Fang, Wei Yang, and Weihang Wang. In Proceedings of the 33rd International World Wide Web Conference. [ Paper ] FSE'23 When Function Inlining Meets WebAssembly: Counterintuitive Impacts on Runtime Performance. Alan Romano and Weihang Wang. In Proceedings of the 31st ACM SIGSOFT International Symposium on the Foundations of Software Engineering. [ Paper ] [ Slides ] [ Code ] WWW'23 Automated WebAssembly Function Purpose Identification With Semantics-Aware Analysis. Alan Romano and Weihang Wang. In Proceedings of the 32nd International World Wide Web Conference. [ Paper ] [ Slides ] ICSE'23 AdHere: Automated Detection and Repair of Intrusive Ads. Yutian Yan, Yunhui Zheng, Xinyue Liu, Nenad Medvidovic, and Weihang Wang. In Proceedings of the 45th ACM/IEEE International Conference on Software Engineering. [ Paper ] [ Slides ] [ Code ] ICSE'23 BFTDetector: Automatic Detection of Business Flow Tampering for Digital Content Service. I Luk Kim, Weihang Wang, Yonghwi Kwon, and Xiangyu Zhang. In Proceedings of the 45th ACM/IEEE International Conference on Software Engineering. [ Paper ] ASE'22 Jasmine: A Static Analysis Framework for Spring Core Technologies. Miao Chen, Tengfei Tu, Hua Zhang, Qiaoyan Wen, and Weihang Wang. In Proceedings of the 37th ACM/IEEE International Conference on Automated Software Engineering. [ Paper ] ACSAC'22 Poster Automated WebAssembly Function Purpose Identification. Alan Romano and Weihang Wang. In Proceedings of the 38th Annual Computer Security Applications Conference, Poster. [ Paper ] Best Poster Award S&P'22 Wobfuscator: Obfuscating JavaScript Malware via Opportunistic Translation to WebAssembly. Alan Romano, Daniel Lehmann, Michael Pradel, and Weihang Wang. In Proceedings of the 43rd IEEE Symposium on Security and Privacy. [ Paper ] [ Slides ] [ Video ] ICSE'22 Hiding Critical Program Components via Ambiguous Translation. Chijung Jung, Doowon Kim, An Chen, Weihang Wang, Yunhui Zheng, Kyu Hyung Lee, and Yonghwi Kwon. In Proceedings of the 44th ACM/IEEE International Conference on Software Engineering. [ Paper ] IVS Topology-Aware Space Distortion for Structured Visualization Spaces. Weihang Wang, Sriram Karthik Badam, Niklas Elmqvist. In the Information Visualization Journal 21(2): 166-181 (2022). [ Paper ] IMC'21 Understanding the Performance of WebAssembly Applications. Yutian Yan, Tengfei Tu, Lijian Zhao, Yuchen Zhou, and Weihang Wang. In ACM Internet Measurement Conference 2021. [ Paper ] [ Slides ] [ Code ] ASE'21 An Empirical Study of Bugs in WebAssembly Compilers. Alan Romano, Xinyue Liu, Yonghwi Kwon, and Weihang Wang. In Proceedings of the 36th ACM/IEEE International Conference on Automated Software Engineering. [ Paper ] [ Slides ] [ Dataset ] ASE'21 NIER Empowering Web Applications with WebAssembly: Are We There Yet? Weihang Wang. In Proceedings of the 36th ACM/IEEE International Conference on Automated Software Engineering, New Ideas and Emerging Results Track. [ Paper ] ASE'21 NIER Defeating Program Analysis Techniques via Ambiguous Translation. Chijung Jung, Doowon Kim, Weihang Wang, Yunhui Zheng, Kyu Hyung Lee, and Yonghwi Kwon. In Proceedings of the 36th ACM/IEEE International Conference on Automated Software Engineering, New Ideas and Emerging Results Track. [ Paper ] ICSE'21 An Empirical Analysis of UI-based Flaky Tests. Alan Romano, Zihe Song, Sampath Grandhi, Wei Yang, and Weihang Wang. In Proceedings of the 43rd ACM/IEEE International Conference on Software Engineering. [ Paper ] [ Slides ] [ Code ] [ Dataset ] [ Video ] NDSS'21 C2SR: Cybercrime Scene Reconstruction for Post-mortem Forensic Analysis. Yonghwi Kwon, Weihang Wang, Jinho Jung, Kyu Hyung Lee, and Roberto Perdisci. In the 28th Network and Distributed System Security Symposium. [ Paper ] ASE'20 MinerRay: Semantics-Aware Analysis for Ever-Evolving Cryptojacking Detection. Alan Romano, Yunhui Zheng, and Weihang Wang. In Proceedings of the 35th ACM/IEEE International Conference on Automated Software Engineering. [ Paper ] [ Slides ] [ Code ] [ Video ] ASE'20 Demo WASim: Similarity-Based Classification for WebAssembly. Alan Romano and Weihang Wang. In Proceedings of the 35th ACM/IEEE International Conference on Automated Software Engineering, Tool Demonstrations Track. [ Paper ] [ Slides ] [ Code ] [ Video ] ICSE'20 Demo WasmView: Visual Testing for WebAssembly Applications. Alan Romano and Weihang Wang. In Proceedings of the 42nd ACM/IEEE International Conference on Software Engineering, Tool Demonstrations Track. [ Paper ] [ Code ] [ Video ] ICSE'20 Finding Client-side Business Flow Tampering Vulnerabilities. I Luk Kim, Yunhui Zheng, Hogun Park, Weihang Wang, Wei You, Yousra Aafer, and Xiangyu Zhang. In Proceedings of the 42nd ACM/IEEE International Conference on Software Engineering. [ Paper ] ICSE'19 AdJust: Runtime Mitigation of Resource Abusing Third-Party Online Ads. Weihang Wang, I Luk Kim, and Yunhui Zheng. In Proceedings of the 41st ACM/IEEE International Conference on Software Engineering. [ Paper ] WWW'18 AdBudgetKiller: Online Advertising Budget Draining Attack. I Luk Kim, Weihang Wang, Yonghwi Kwon, Yunhui Zheng, Yousra Aafer, Weijie Meng, and Xiangyu Zhang. In Proceedings of the 27th International World Wide Web Conference. [ Paper ] NDSS'18 MCI: Modeling-based Causality Inference in Audit Logging for Attack Investigation. Yonghwi Kwon, Fei Wang, Weihang Wang, Kyu Hyung Lee, Wen-Chuan Lee, Shiqing Ma, Xiangyu Zhang, Dongyan Xu, Somesh Jha, Gabriela Ciocarlie, Ashish Gehani, and Vinod Yegneswaran. In Proceedings of the 25th Network and Distributed System Security Symposium. [ Paper ] NDSS'18 Trojaning Attack on Neural Networks. Yingqi Liu, Shiqing Ma, Yousra Aafer, Wen-Chuan Lee, Juan Zhai, Weihang Wang, and Xiangyu Zhang. In Proceedings of the 25th Network and Distributed System Security Symposium. [ Paper ] ASE'17 PAD: Programming Third-party Web Advertisement Censorship. Weihang Wang, Yonghwi Kwon, Yunhui Zheng, Yoursra Aafer, I Luk Kim, Wen-Chuan Lee, Yingqi Liu, Weijie Meng, Xiangyu Zhang, and Patrick Eugster. In Proceedings of the 32nd IEEE/ACM International Conference on Automated Software Engineering. [ Paper ] ISSTA'17 CPR: Cross Platform Binary Code Reuse via Platform Independent Trace Program. Yonghwi Kwon, Weihang Wang, Yunhui Zheng, Xiangyu Zhang, and Dongyan Xu. In Proceedings of the 26th ACM SIGSOFT International Symposium on Software Testing and Analysis. [ Paper ] FSE'16 WebRanz: Web Page Randomization For Better Advertisement Delivery and Web-Bot Prevention. Weihang Wang, Yunhui Zheng, Xinyu Xing, Yonghwi Kwon, Xiangyu Zhang, and Patrick Eugster. In Proceedings of the 24th ACM SIGSOFT International Symposium on the Foundations of Software Engineering. [ Paper ] ISSTA'16 ARROW: Automated Repair of Races on Client-Side Web Pages. Weihang Wang, Yunhui Zheng, Peng Liu, Lei Xu, Xiangyu Zhang, and Patrick Eugster. In Proceedings of the 25th ACM SIGSOFT International Symposium on Software Testing and Analysis. [ Paper ] TPDS'15 Subscription Normalization for Effective ",
  "content_length": 12472,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:54"
}