{
  "name": "Weiming Xiang 0001",
  "homepage": "https://xiangweiming.github.io",
  "status": "success",
  "content": "Weming Xiang About Home CV News Research AI-CPS Lab Projects Publications Professional Services Openings PhD Students (Apply!) Postdoc Undergraduate/Master Teaching CSCI 1301 CENG 2001 CSCI 3370 CSCI 3371 CSCI 7710 Links Google Scholar Research Gate Departmental Site Weming Xiang Weiming Xiang, Ph.D. Associate Professor School of Computer and Cyber Sciences Augusta University, GA Georgia Cyber Center Riverfront Campus 100 Grace Hopper Lane RV 2815 Augusta, Georgia 30901 Email: wxiang@augusta.edu Openings: Fully funded PhD student positions are currently available, please send your request with CV to wxiang@augusta.edu. Brief Bio: Dr. Weiming Xiang is currently an Associate Professor in the School of Computer and Cyber Sciences at Augusta University. Before joining Augusta University, Dr. Xiang worked as a Postdoctoral Research Scholar in the Department of Electrical Engineering and Computer Science at Vanderbilt University (Sep 2016–Jul 2019), and worked as a Postdoctoral Research Associate in the Department of Computer Science and Engineering at the University of Texas at Arlington (Nov 2015–Aug 2016), a Research Associate in the Department of Mechanical Engineering at the University of Hong Kong (May 2015–Oct 2015). Dr. Xiang completed his Ph.D. at Southwest Jiaotong University in 2014 with a Ph.D. thesis on formal methods for hybrid traffic systems awarded the Outstanding Ph.D. Dissertation of Southwest Jiaotong University 2014. Dr. Xiang is an Associate Editor of IEEE Control Systems Letters (L-CSS) (2023–present), an Associate Editor of IET Control Theory and Applications (2020–present), an Associate Editor of Electronics (2021–present), and was an Associate Editor of Neurocomputing (2014–2019), and Associate Editors or PC Members in a number of international conferences in CPS, control, and formal methods. Dr. Xiang received the National Science Foundation CAREER Award, 2022. Dr. Xiang is a Senior Member of IEEE (2017–present). You can find Dr. Xiang's CV here. Research: Dr. Xiang's research interest is developing formal synthesis and verification techniques and software tools for cyber-physical systems (CPS). Dr. Xiang's current research centers on formal methods on safety, security and reliability of learning-enabled CPS. He is also broadly interested in methods and applications across CPS domains, such as control synthesis, stability analysis, reachable set computation, hybrid systems, power and energy, transportation, fuzzy logic, and neural networks. A full list of papers is available here. News Tweets by xiangweiming Page generated 2023-08-17 20:55:59 Eastern Daylight Time, by jemdoc+MathJax.",
  "content_length": 2651,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:56"
}