{
  "name": "Weinan Zhang 0001",
  "homepage": "http://wnzhang.net",
  "status": "success",
  "content": "Weinan Zhang - SJTU Weinan ZHANG Professor, Ph.D. Advisor School of Computer Science Shanghai Jiao Tong University 3-518，SEIEE Building, 800 Dongchuan Road Shanghai, 200240, China Email: wnzhang [AT] sjtu.edu.cn 张伟楠博士现任上海交通大学计算机学院教授、博士生导师、院长助理。科研领域包括强化学习、智能体、具身智能，相关研究成果在CCF-A类国际会议和期刊上发表100余篇学术论文，谷歌学术引用3万余次，爱思唯尔中国高被引学者，获得5个最佳论文奖项，出版教材《动手学强化学习》和《动手学机器学习》等销量约5万册。张伟楠长期担任NeurIPS、ICML、ICLR、KDD等会议领域主席和TPAMI期刊编委，主持国家自然科学基金优秀青年项目和科技部2030新一代人工智能重大项目课题，入选中国科协青年人才托举工程和上海市科委英才扬帆计划，获得吴文俊人工智能优秀青年奖和达摩院青橙奖。张伟楠于2011年获得上海交通大学计算机系ACM班学士学位，于2016年获得伦敦大学学院计算机系博士学位。 Weinan Zhang is currently a Professor, Ph.D. Advisor, and Assistant to the Dean at the School of Computer Science, Shanghai Jiao Tong University. His research areas include reinforcement learning, agentic AI, and embodied AI. He has published over 200 research papers at prestigious international conferences and journals, accumulating over 30k citations on Google Scholar, been selected as Elsevier China Highly Cited Researcher. He has been serving as an area chair at ICML, NeurIPS, ICLR, KDD, etc. and an associate editor at TPAMI. He was granted the ACM Rising Star Award 2017 and the Alibaba DAMO Young Scholar Award 2018. His research won five best paper awards at international conferences and workshops, including the Best Paper Honorable Mention Award at SIGIR 2017 and the Best System Paper Award at CoRL 2020. Weinan earned his Ph.D. from the Computer Science Department of University College London in 2016 and his B.E. from the ACM Honored Class of Shanghai Jiao Tong University in 2011. Prospective Ph.D. students: I am looking for outstanding and highly motivated Ph.D. students to work together on agentic AI, agentic Web, deep reinforcement learning, robot learning, and various AI application topics. Please email me with your CV and transcripts. Notices: Please participate DAI 2025, London! 书籍出版 动手学机器学习 张伟楠、赵寒烨、俞勇 人民邮电出版社，2023 ISBN: 978-7115-61820-7 动手学强化学习 张伟楠、沈键、俞勇 人民邮电出版社，2022 ISBN: 978-7-115-58451-9 Teaching link Machine Learning ACM Class, Zhiyuan College, Shanghai Jiao Tong University 2017-now link Reinforcement Learning ACM Class, Zhiyuan College (and AI Class, SEIEE until 2022), Shanghai Jiao Tong University 2020-now link Big Data Mining SEIEE, Shanghai Jiao Tong University 2018-2020 Tutorials link 3小时强化学习入门教程 Weinan Zhang RLChina 2022-2024. link Muti-Agent Reinforcement Learning Jun Wang, Weinan Zhang SJTU 2-day tutorial, Oct. 2018. link Generative Adversarial Nets for Information Retrieval: Fundamentals and Advances Weinan Zhang SIGIR 3-hour tutorial, Jul. 2018. link Learning, Prediction and Optimisation in RTB Display Advertising Weinan Zhang, Jian Xu CIKM, Oct. 2016. pdf Real-Time Bidding based Display Advertising: Mechanisms and Algorithms Jun Wang, Shuai Yuan, Weinan Zhang ECIR, Mar. 2016. link Paper Collection of Real-Time Bidding Weinan Zhang Github 2015. Featured Open Source Projects link MALib: A Parallel Framework for Population-based Multi-agent Reinforcement Learning Ming Zhou, Ziyu Wan, Hanjing Wang, Muning Wen, Runzhe Wu, Ying Wen, Yaodong Yang, Weinan Zhang, Jun Wang 2021. link SMARTS: Scalable Multi-Agent Reinforcement Learning Training School for Autonomous Driving Ming Zhou, Jun Luo, Julian Villela, Yaodong Yang, David Rusu, Jiayu Miao, Weinan Zhang et al. CoRL 2020. link CityFlow: A Multi-Agent Reinforcement Learning Environment for Large Scale City Traffic Scenario Huichu Zhang, Siyuan Feng, Chang Liu, Yaoyao Ding, Yichen Zhu, Zihan Zhou, Weinan Zhang, Yong Yu, Haiming Jin, Zhenhui Li Demo in WWW 2019. link MAgent: A Many-Agent Reinforcement Learning Platform for Artificial Collective Intelligence Lianmin Zheng, Jiacheng Yang, Han Cai, Weinan Zhang, Jun Wang, Yong Yu Demos in NIPS 2017 & AAAI 2018. link Texygen: A Benchmarking Platform for Text Generation Models Yaoming Zhu, Sidi Lu, Lei Zheng, Jiaxian Guo, Weinan Zhang, Jun Wang, Yong Yu SIGIR 2018. link SVDFeature: A Toolkit for Feature-based Collaborative Filtering Tianqi Chen, Weinan Zhang, Qiuxia Lu, Kailong Chen, Zhao Zheng, Yong Yu JMLR 2013. Paper Publications [Google Scholar] pdf AgentNet: Decentralized Evolutionary Coordination for LLM-based Multi-Agent Systems Yingxuan Yang, Huacan Chai, Shuai Shao, Yuanyi Song, Siyuan Qi, Renting Rui, Weinan Zhang NeurIPS 2025. pdf Unified Reinforcement Learning through Implicit Value Regularization Haoran Xu, Liyuan Mao, Hui Jin, Weinan Zhang, Xianyuan Zhan, Amy Zhang NeurIPS 2025. pdf MobileUse: A Hierarchical Reflection-Driven GUI Agent for Autonomous Mobile Operation Ning Li, Xiangmou Qu, Jiamu Zhou, Jun Wang, Muning Wen, Kounianhua Du, Xingyu Lou, Qiuying Peng, Jun Wang, Weinan Zhang NeurIPS 2025. pdf Information-Theoretic Reward Decomposition for Generalizable RLHF Liyuan Mao, Haoran Xu, Amy Zhang, Weinan Zhang, Chenjia Bai NeurIPS 2025. pdf GenPO: Generative Diffusion Models Meet On-Policy Reinforcement Learning Shutong Ding, Ke Hu, Shan Zhong, Haoyang Luo, Weinan Zhang, Jingya Wang, Jun Wang, Ye Shi NeurIPS 2025. pdf KungfuBot: Physics-Based Humanoid Whole-Body Control for Learning Highly-Dynamic Skills Weiji Xie, Jinrui Han, Jiakun Zheng, Huanyu Li, Xinzhe Liu, Jiyuan Shi, Weinan Zhang, Chenjia Bai, Xuelong Li NeurIPS 2025. pdf ReMA: Learning to Meta-Think for LLMs with Multi-agent Reinforcement Learning Ziyu Wan, Yunxiang LI, Xiaoyu Wen, Yan Song, Hanjing Wang, Linyi Yang, Mark Schmidt, Jun Wang, Weinan Zhang, Shuyue Hu, Ying Wen NeurIPS 2025. pdf Flexible Realignment of Language Models Wenhong Zhu, Ruobing Xie, Weinan Zhang, Rui Wang NeurIPS 2025. pdf ThinkBench: Dynamic Out-of-Distribution Evaluation for Robust LLM Reasoning Shulin Huang, Linyi Yang, Yan Song, Shuang Chen, Leyang Cui, Ziyu Wan, Qingcheng Zeng, Ying Wen, Kun Shao, Weinan Zhang, Jun Wang, Yue Zhang NeurIPS 2025. pdf Stop DDoS Attacking the Research Community with AI-Generated Survey Papers Jianghao Lin, Rong Shan, Jiachen Zhu, Yunjia Xi, Yong Yu, Weinan Zhang NeurIPS 2025. pdf RethinkMCTS: Refining Erroneous Thoughts in Monte Carlo Tree Search for Code Generation Qingyao Li, Wei Xia, Xinyi Dai, Kounianhua Du, Weiwen Liu, Yasheng Wang, Ruiming Tang, Yong Yu, Weinan Zhang EMNLP 2025. pdf NL-Debugging: Exploiting Natural Language as an Intermediate Representation for Code Debugging Weiming Zhang, Qingyao Li, Xinyi Dai, Jizheng Chen, Kounianhua Du, Weinan Zhang, Weiwen Liu, Yasheng Wang, Ruiming Tang, Yong Yu EMNLP 2025. pdf LLM4CD: Leveraging Large Language Models for Open-World Knowledge Augmented Cognitive Diagnosis Weiming Zhang, Lingyue Fu, Qingyao Li, Kounianhua Du, Jianghao Lin, Jingwei Yu, Wei Xia, Weinan Zhang, Ruiming Tang, Yong Yu CIKM 2025. pdf AdvKT: An Adversarial Multi-Step Training Framework for Knowledge Tracing Lingyue Fu, Ting Long, Jianghao Lin, Wei Xia, Xinyi Dai, Ruiming Tang, Yasheng Wang, Weinan Zhang, Yong Yu ECMLPKDD 2025. pdf Fast Second-Order Online Kernel Learning through Incremental Matrix Sketching and Decomposition Dongxie Wen, Xiao Zhang, Zhewei Wei, Chenping Hou, Shuai Li, Weinan Zhang IJCAI 2025. pdf Efficiency Unleashed: Inference Acceleration for LLM-based Recommender Systems with Speculative Decoding Yunjia Xi, Hangyu Wang, Bo Chen, Jianghao Lin, Menghui Zhu, Weiwen Liu, Ruiming Tang, Zhewei Wei, Weinan Zhang and Yong Yu SIGIR 2025. pdf Action First: Leveraging Preference-Aware Actions for More Effective Decision-Making in Interactive Recommender Systems Renting Rui, Yunjia Xi, Weiwen Liu, Jianghao Lin, Bo Chen, Ruiming Tang, Weinan Zhang and Yong Yu SIGIR 2025. pdf DebateCoder: Towards Collective Intelligence of LLMs via Test Case Driven LLM Debate for Code Generation Jizheng Chen, Kounianhua Du, Xinyi Dai, Weiming Zhang, Xihuai Wang, Yasheng Wang, Ruiming Tang, Weinan Zhang, Yong Yu ACL 2025. pdf Leveraging Dual Process Theory in Language Agent Framework for Real-time Simultaneous Human-AI Collaboration Shao Zhang, Xihuai Wang, Wenhao Zhang, Chaoran Li, Junru Song, Tingyu Li, Lin Qiu, Xuezhi Cao, Xunliang Cai, Wen Yao, Weinan Zhang, Xinbing Wang, Ying Wen ACL 2025. pdf CodePRM: Execution Feedback-enhanced Process Reward Model for Code Generation Qingyao Li, Xinyi Dai, Xiangyang Li, Weinan Zhang, Yasheng Wang, Ruiming Tang, Yong Yu ACL Findings 2025. pdf Retrieval-Augmented Process Reward Model for Generalizable Mathematical Reasoning Jiachen Zhu, Congmin Zheng, Jianghao Lin, Kounianhua Du, Ying Wen, Yong Yu, Jun Wang, Weinan Zhang ACL Findings 2025. pdf Boost, Disentangle, and Customize: A Robust System2-to-System1 Pipeline for Code Generation Kounianhua Du, Hanjing Wang, Jianxing Liu, Jizheng Chen, Xinyi Dai, Yasheng Wang, Ruiming Tang, Yong Yu, Jun Wang, Weinan Zhang ACL Findings 2025. pdf HammerBench: Fine-Grained Function-Calling Evaluation in Real Mobile Assistant Scenarios Jun Wang, Jiamu Zhou, Muning Wen, Xiaoyun Mo, Haoyu Zhang, Qiqiang Lin, jincheng, Xihuai Wang, Weinan Zhang, Qiuying Peng, Jun Wang ACL Findings 2025. pdf Diffusion Models for Recommender Systems: From Content Distribution To Content Creation Jianghao Lin, Yang Cao, Yong Yu, Weinan Zhang KDD 2025. pdf An Automatic Graph Construction Framework based on Large Language Models for Recommendation Rong Shan, Jianghao Lin, Chenxu Zhu, Bo Chen, Menghui Zhu, Kangning Zhang, Jieming Zhu, Ruiming Tang, Yong Yu, Weinan Zhang KDD 2025. pdf Bursting Filter Bubble: Enhancing Serendipity Recommendations with Aligned Large Language Models Yunjia Xi, Muyan Weng, Wen Chen, Yi Chao, Dian Chen, Gaoyang Guo, Mao Zhang, Wu Jian, Yuning Jiang, Qingwen Liu, Yong Yu, Weinan Zhang KDD 2025. pdf Why Not Together? A Multiple-Round Recommender System for Queries and Items Jiarui Jin, Xianyu Chen, Weinan Zhang, Yong Yu, Jun Wang KDD 2025. pdf Large Language Models are Demonstration Pre-Selectors for Themselves Jiarui Jin, Yuwei Wu, Xiaoting He, Haoxuan Li, Weinan Zhang, Yiming Yang, Yong Yu, Jun Wang, Mengyue Yang ICML 2025. pdf Score-Based Diffusion Policy Compatible with Reinforcement Learning via Optimal Transport Mingyang Sun, Pengxiang Ding, Weinan Zhang, Donglin Wang ICML 2025. pdf Eff",
  "content_length": 53641,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:57"
}