{
  "name": "Weiran Huang 0001",
  "homepage": "https://www.weiranhuang.com",
  "status": "success",
  "content": "Weiran Huang - MIFA Lab - Shanghai Jiao Tong University Weiran Huang About Me Publications Talks Group Recruitment Links Conf Deadlines FAI Seminar About Me Weiran Huang (é»ç»´ç¶) Associate Professor, PhD Advisor MIFA Lab @ SJTU Shanghai Jiao Tong University Shanghai Innovation Institute [Google Scholar] / [DBLP] / [ç¥ä¹ä¸æ ] / [Talk Bio] I am an Associate Professor at both Shanghai Jiao Tong University and Shanghai Innovation Institute, and the Principal Investigator of MIFA Lab. I also serve as a Research Consultant at Shanghai AI Lab. My research interests include machine learning, encompassing both the theory and applications of algorithms, such as pre-training and foundation models, data-efficient fine-tuning, continual learning, and multimodal learning. I earned my PhD in Computer Science from Tsinghua University, where I had the honor of being supervised by Turing Award Laureate Prof. Andrew Yao and IEEE/ACM Fellow Prof. Wei Chen. Prior to that, I received my bachelor's degree in Electronic Engineering from Tsinghua University. Additionally, I was a visiting scholar hosted by Prof. Yaron Singer at Harvard SEAS. To Prospective Students (æç) Our lab is actively seeking self-motivated students, as well as visitors and postdocs, who are interested in joining our lab. If you're interested, please email me your CV. Before reaching out, please carefully read our latest guidelines (æçé¡»ç¥). Latest News Sep 2025: Our paper “First SFT, Second RL, Third UPT: Continual Improving Multi-Modal LLM Reasoning via Unsupervised Post-Training” has been accepted by NeurIPS 2025! Sep 2025: Our paper “PANTHER: Generative Pretraining Beyond Language for Sequential User Behavior Modeling” has been accepted by NeurIPS 2025! Jun 2025: I will be giving a talk on a A Matrix Information-Theoretic Perspective on Representation Learning at VALSE 2025 and JCSDS 2025! May 2025: Our paper “Generalized Category Discovery via Reciprocal Learning and Class-Wise Distribution Regularization” has been accepted by ICML 2025! Feb 2025: I will be giving a talk on a Deep Learning-Based Approach for Crystal Structure Analysis at the Global Developer Conference 2025 (2025 å ¨çå¼åè å éå¤§ä¼)! Feb 2025: Our paper “FinLLM-B: When Large Language Models Meet Financial Breakout Trading” has been accepted by NAACL 2025! Dec 2024: I will be giving a talk on a Large Language Model for Diabetes at the CSIG Youth Scientists Conference 2024 (ç¬¬äºåå±ä¸­å½å¾è±¡å¾å½¢å­¦å­¦ä¼éå¹´ç§å­¦å®¶ä¼è®®)! Sep 2024: Our paper “Diff-eRank: A Novel Rank-Based Metric for Evaluating Large Language Models” has been accepted by NeurIPS 2024! Sep 2024: Our paper “SAFE: Slow and Fast Parameter-Efficient Tuning for Continual Learning with Pre-Trained Models” has been accepted by NeurIPS 2024! Jul 2024: Our paper “AutoEval-Video: An Automatic Benchmark for Assessing Large Vision Language Models in Open-Ended Video Question Answering” has been accepted by ECCV 2024! May 2024: Our paper “Provable Contrastive Continual Learning” has been accepted by ICML 2024! May 2024: Our paper “OTMatch: Improving Semi-Supervised Learning with Optimal Transport” has been accepted by ICML 2024! May 2024: Our paper “Unveiling the Dynamics of Information Interplay in Supervised Learning” has been accepted by ICML 2024! May 2024: Our paper “A Statistical Theory of Regularization-Based Continual Learning” has been accepted by ICML 2024! May 2024: Our paper “Information Flow in Self-Supervised Learning” has been accepted by ICML 2024! May 2024: Our paper “Matrix Information Theory for Self-Supervised Learning” has been accepted by ICML 2024! Apr 2024: I am honored to have been chosen as one of the 17 Microsoft Research Asia StarTrack Scholars for the year 2024 from around the globe! Dec 2023: Our team achieved first place in the Foundation Model Prompting for Medical Image Classification Challenge 2023 at the NeurIPS 2023 Competition! Oct 2023: Our paper “When Noisy Labels Meet Long Tail Dilemmas: A Representation Calibration Method” was among the ICCV 2023 Best Paper Finalists (Top 0.2%)! Sep 2023: Our paper “DiffKendall: A Novel Approach for Few-Shot Learning with Differentiable Kendall's Rank Correlation” has been accepted by NeurIPS 2023! Sep 2023: Our paper “FD-Align: Feature Discrimination Alignment for Fine-tuning Pre-Trained Models in Few-Shot Learning” has been accepted by NeurIPS 2023! Sep 2023: I am honored to have been selected as one of the 26 recipients of 2023 CCF-Baidu Open Fund! Aug 2023: Our paper “InstructionGPT-4: A 200-Instruction Paradigm for Fine-Tuning MiniGPT-4” has been covered by AI media Jiqi Zhixin (æºå¨ä¹å¿)! Jul 2023: Our paper “When Noisy Labels Meet Long Tail Dilemmas: A Representation Calibration Method” has been accepted by ICCV 2023 as an oral presentation! Apr 2023: Our paper “Rethinking Weak Supervision in Helping Contrastive Representation Learning” has been accepted by ICML 2023! Jan 2023: Our paper “Towards the Generalization of Contrastive Self-Supervised Learning” has been accepted by ICLR 2023! Jan 2023: Our paper “ArCL: Enhancing Contrastive Learning with Augmentation-Robust Representations” has been accepted by ICLR 2023! Jan 2023: Our paper “Your Contrastive Learning Is Secretly Doing Stochastic Neighbor Embedding” has been accepted by ICLR 2023! Education & Work Experience 2012–2018: PhD in Computer Science, IIIS, Tsinghua University (Advisor: Andrew Yao) 2009–2012: BSc in Electronic Engineering, Dept. of EE, Tsinghua University 2008–2009: Fundamental Science Class (æ°çåºç§ç­), Tsinghua University 2022/12–Present: Associate Professor at Shanghai Jiao Tong University 2025/03–Present: Associate Professor at Shanghai Innovation Institute (ä¸æµ·åæºå­¦é¢) 2024/04–Present: Research Consultant at Shanghai AI Lab 2018/07–2022/11: Research Scientist at Noah's Ark Lab (Director: Jun Yao) 2018/03–2018/06: Research Intern at Microsoft Research Asia (Mentor: Wei Chen) 2017/11–2018/02: Visiting Scholar at Harvard University (Advisor: Yaron Singer) 2015/08–2017/10: Research Intern at Microsoft Research Asia (Mentor: Wei Chen) Awards & Honors SJTU Teaching Achievement Award (ä¸æµ·äº¤éå¤§å­¦ 2025 å¹´åº¦æå­¦ææå¥), 2025. ACM China Rising Star (Shanghai Chapter) (ACM ä¸æµ·å°åºæ°æå¥), 2024. Microsoft Research Asia StarTrack Scholar (å¾®è½¯äºæ´²ç ç©¶é¢é¸æå­¦è ), 2024. The 1st Winner Prize, Foundation Model Prompting for Medical Image Classification Challenge, NeurIPS 2023 Competition, 2023. ICCV 2023 Best Paper Finalist for “When Noisy Labels Meet Long Tail Dilemmas: A Representation Calibration Method”, 2023. Innovation Pioneer (1st Prize), 2020. Excellence in the Microsoft Research Asia Internship Program, 2018. Outstanding Graduate Student, 2018. The Inaugural President of the IIIS Graduate Student Union, 2012. Gold medal in the 24th Chinese Physics Olympiad (CPhO), Member of National Training Team (å½å®¶éè®­é, 31 people in China), 2007. Teaching Artificial Intelligence Theory and Applications (ISE3308): Spring 2025, Autumn 2024. Machine Learning (CS7336): Spring 2025, Spring 2024 (with Prof. Yang Yang). Advanced Neural Network Theory and Applications (CS7352): Spring 2024 (with Prof. Zhijie Deng and Prof. Yong-Lu Li). Machine Learning Theory (CS3968): Spring 2024 (with Prof. Shiyu Liang). Services Area Chair: NeurIPS (2025). Reviewer: ICML (2022-2025), NeurIPS (2019-2024), ICLR (2022-2025). Page generated 2025-11-11. Site Map. æ²ªäº¤ ICP å¤ 20240087 å·.",
  "content_length": 7508,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:59"
}