{
  "name": "Weiran Shen",
  "homepage": "https://www.weiran-shen.info",
  "status": "success",
  "content": "Weiran Shen 中文 Weiran Shen Tenure-Track Associate Professor Gaoling School of Artificial Intelligence Renmin University of China Address: 59 Zhongguancun St. Haidian District Beijing, China Email: shenweiran AT ruc DOT edu DOT cn About me I am an tenure-track associate professor at Gaoling School of Artificial Intelligence, Renmin University of China. Before joining Renmin University, I was a post doctoral researcher at ISR, Carnegie Mellon University, working with Fei Fang. I obtained my Ph.D. at IIIS, Tsinghua University, advised by Pingzhong Tang, and my B.E. at Department of Electronic Engineering, Tsinghua University. My research interest lies in the interface of economics and computation, especially auction and mechanism design, game theory, multi-agent systems and machine learning. Publications 2025 [PDF] Multiplayer General Lotto Game. WINE-2025 Yan Liu, Bonan Ni, Weiran Shen, Zihe Wang, Jie Zhang. [PDF] Stackelberg vs. Nash in the Lottery Colonel Blotto Game. IJCAI-2025 Yan Liu, Bonan Ni, Weiran Shen, Zihe Wang, Jie Zhang. [PDF] Public Signaling in Markets with Information Asymmetry Using a Limited Number of Signals. IJCAI-2025 Xu Zhao, Ren Liu, Weiran Shen. [PDF] Optimizing Revenue through User Coupon Recommendations in Truthful Online Ad Auctions. WWW-2025 Xiaodong Liu, Yiming Ding, Xiao Lin, Changcheng Li, Peng Jiang, Weiran Shen. [PDF] Two-stage Auction Design in Online Advertising. WWW-2025 Zhikang Fan, Lan Hu, Ruirui Wang, Zhongrui Ma, Yue Wang, Qi Ye, Weiran Shen. [PDF] Balancing Revenue and Privacy with Signaling Schemes in Online Ad Auctions. WSDM-2025 Hongtao Liu, Luxi Chen, Yiming Ding, Changcheng Li, Han Li, Peng Jiang, Weiran Shen. 2024 [PDF] [Online version] LTP-MMF: Towards Long-term Provider Max-min Fairness Under Recommendation Feedback Loops. ACM Transactions on Information Systems (TOIS) Chen Xu, Xiaopeng Ye, Jun Xu, Xiao Zhang, Weiran Shen, Ji-Rong Wen. [PDF] SRAP-agent: Simulating and Optimizing Scarce Resource Allocation Policy with LLM-based Agent. EMNLP-2024 (Findings) Jiarui Ji, Yang Li, Hongtao Liu, Zhicheng Du, Zhewei Wei, Qi Qi, Weiran Shen, Yankai Lin. [PDF] [Online version] An Extensive Study of Security Games with Strategic Informants. Artificial Intelligence (AIJ) Subsumes the IJCAI conference version. Weiran Shen, Minbiao Han, Weizhe Chen, Taoan Huang, Rohit Singh, Haifeng Xu, Fei Fang. [PDF] Optimal Auction Design with User Coupons in Advertising Systems. IJCAI-2024 Xiaodong Liu, Zhikang Fan, Yiming Ding, Yuan Guo, Lihua Zhang, Changcheng Li, Dongying Kong, Han Li, Weiran Shen. [PDF] [Online version] A mechanism design approach for multi-party machine learning. Theoretical Computer Science (TCS) Subsumes the IJTCS-FAW conference version. Mengjing Chen, Yang Liu, Weiran Shen, Yiheng Shen, Pingzhong Tang, Qiang Yang. [PDF] A Fast Algorithm for k Memory Messaging Scheme Design in Dynamic Environments with Uncertainty. ICAPS-2024 Zhikang Fan, Weiran Shen. [PDF] Simultaneous Optimization of Bid Shading and Internal Auction for Demand-Side Platforms. AAAI-2024 Yadong Xu, Bonan Ni, Weiran Shen, Xun Wang, Zichen Wang, Yinsong Xue, Pingzhong Tang. 2023 [PDF] Auto-bidding with Budget and ROI Constrained Buyers. IJCAI-2023 Xiaodong Liu, Weiran Shen. [PDF] Revenue Maximization Mechanisms for an Uninformed Mediator with Communication Abilities. IJCAI-2023 Zhikang Fan, Weiran Shen. [PDF] Deep Generative Modeling on Limited Data with Regularization by Nontransferable Pre-trained Models. ICLR-2023 Yong Zhong, Hongtao Liu, Xiaodong Liu, Fan Bao, Weiran Shen, Chongxuan Li. [PDF] P-MMF Provider Max-min Fairness Re-ranking in Recommender System. WWW-2023 Chen Xu, Sirui Chen, Jun Xu, Weiran Shen, Xiao Zhang, Gang Wang, Zhenhua Dong. 2022 [PDF] Inverse Game Theory for Stackelberg Games: the Blessing of Bounded Rationality. NeurIPS-2022 Jibang Wu, Weiran Shen, Fei Fang, Haifeng Xu. [PDF] A Mechanism Design Approach for Multi-Party Machine Learning. IJTCS-FAW-2022 Mengjing Chen, Yang Liu, Weiran Shen, Yiheng Shen, Pingzhong Tang, Qiang Yang. [PDF] Optimal pricing policy design for selling cost-reducing innovation in Cournot games. Theoretical Computer Science (TCS) Mengjing Chen, Haoqiang Huang, Weiran Shen, Pingzhong Tang, Zihe Wang, Jie Zhang. 2021 [PDF] [Online version] Coalitional permutation manipulations in the Gale-Shapley algorithm. Artificial Intelligence (AIJ) Subsumes the AAMAS conference version. Weiran Shen, Yuan Deng, Pingzhong Tang. [arXiv version] Optimal Pricing of Information. EC-2021 Shuze Liu, Weiran Shen, Haifeng Xu. [PDF] Coupon Design in Advertising Systems. AAAI-2021 Weiran Shen, Pingzhong Tang, Xun Wang, Yadong Xu, Xiwang Yang. 2020 [PDF] Harnessing the Power of Deception in Attack Graph-Based Security Games. GameSec-2020 Stephanie Milani, Weiran Shen, Kevin S. Chan, Sridhar Venkatesan, Nandi O. Leslie, Charles Kamhoua and Fei Fang. [PDF] When to Follow the Tip: Security Games with Strategic Informants. IJCAI-2020 Weiran Shen, Weizhe Chen, Taoan Huang, Rohit Singh and Fei Fang. [PDF] Green Security Game with Community Engagement. AAMAS-2020 Taoan Huang, Weiran Shen, David Zeng, Tianyu Gu, Rohit Singh and Fei Fang. [PDF] Learning to Design Coupons in Online Advertising Markets. AAMAS-2020 Weiran Shen, Xun Wang, Yadong Xu, Xiwang Yang and Pingzhong Tang. [PDF] Bayesian Nash Equilibrium in First-Price Auction with Discrete Value Distributions. AAMAS-2020 Zihe Wang, Weiran Shen and Song Zuo. [PDF] Reinforcement Mechanism Design: With Applications to Dynamic Pricing in Sponsored Search Auctions. AAAI-2020 Weiran Shen, Binghui Peng, Hanpeng Liu, Michael Zhang, Ruohan Qian, Yan Hong, Zhi Guo, Zongyao Ding, Pengjun Lu and Pingzhong Tang. 2019 [PDF] Dispatching through pricing: modeling ride-sharing and designing dynamic prices. IJCAI-2019 Mengjing Chen, Weiran Shen, Pingzhong Tang and Song Zuo. [PDF] Learning to clear the market. ICML-2019 Weiran Shen, Sébastien Lahaie and Renato Paes Leme. [PDF] [arXiv version] Automated mechanism design via neural networks. AAMAS-2019 Weiran Shen, Pingzhong Tang and Song Zuo. [PDF] Buyer signaling games in auctions. AAMAS-2019 Weiran Shen, Pingzhong Tang and Yulong Zeng. [PDF] Learning optimal strategies to commit to. AAAI-2019 Binghui Peng, Weiran Shen, Pingzhong Tang and Song Zuo. 2018 [PDF] Ex-post IR dynamic auctions with cost-per-action payments. IJCAI-2018 Weiran Shen, Zihe Wang and Song Zuo. [PDF] Coalitional permutation manipulations in the Gale-Shapley algorithm. AAMAS-2018 Yuan Deng, Weiran Shen and Pingzhong Tang. [PDF] A closed-form characterization of buyer signaling schemes in monopoly pricing. AAMAS-2018 Weiran Shen, Pingzhong Tang and Yulong Zeng. [PDF] Buyer-optimal distribution. AAMAS-2018 Weiran Shen, Pingzhong Tang and Yulong Zeng. [PDF] Coalition manipulation of Gale-Shapley algorithm. AAAI-2018 Yuan Deng, Weiran Shen and Pingzhong Tang. 2017 [PDF] Practical versus optimal mechanisms. AAMAS-2017 Weiran Shen, Pingzhong Tang. [PDF] Hotelling-Downs model with limited attraction. AAMAS-2017 Weiran Shen, Zihe Wang.",
  "content_length": 7034,
  "method": "requests",
  "crawl_time": "2025-12-01 14:45:59"
}