{
  "name": "Weiran Wang",
  "homepage": "https://cs.uiowa.edu/people/weiran-wang",
  "status": "success",
  "content": "Weiran Wang | Computer Science - College of Liberal Arts and Sciences | The University of Iowa Skip to main content Weiran Wang, Ph.D. Assistant Professor Biography Weiran Wang is an Assistant Professor in Computer Science at the University of Iowa. He was most recently a Staff Research Scientist at Google. He was a Senior Research Scientist at Salesforce Research from 2019 to 2020, and a Senior Applied Scientist at Amazon Alexa from 2017 to 2019. He spent 2014 to 2017 as a postdoc researcher at Toyota Technological Institute at Chicago, after obtaining his PhD at University of California at Merced in 2013. Research InterestsHis research interests lie in machine learning, speech processing, and optimization.Research Interests (Keywords)Machine Learning; Speech Processing; Artificial IntelligenceSelected PublicationsContextual Biasing with the Knuth-Morris-Pratt Matching Algorithm. Weiran Wang, Zelin Wu, Diamantino Caseiro, Tsendsuren Munkhdalai, Khe Chai Sim, Pat Rondon, Golan Pundak, Gan Song, Rohit Prabhavalkar, Zhong Meng, Ding Zhao, Tara Sainath, Pedro Moreno Mengibar. Interspeech, 2024.Massive End-to-end Speech Recognition Models with Time Reduction. Weiran Wang, Rohit Prabhavalkar, Haozhe Shan, Zhong Meng, Dongseong Hwang, Qiujia Li, Khe Chai Sim, Bo Li, James Qin, Xingyu Cai, Adam Stooke, Chengjian Zheng, Yanzhang He, Tara Sainath, Pedro Moreno Mengibar. NAACL, 2024.Deliberation of Streaming RNN-Transducer by Non-autoregressive Decoding. Weiran Wang, Ke Hu, and Tara Sainath. ICASSP, 2022.Latent Correlation-Based Multiview Learning and Self-Supervision: A Unifying Perspective. Qi Lyu, Xiao Fu, Weiran Wang, and Songtao Lu. ICLR, 2022.Contrastively Disentangled Sequential Variational Autoencoder. Junwen Bai, Weiran Wang, and Carla Gomes. NeurIPS, 2021.Representation Learning for Sequence Data with Deep Autoencoding Predictive Components. Junwen Bai, Weiran Wang, Yingbo Zhou, and Caiming Xiong. International Conference on Learning Representations (ICLR), 2021.An investigation of phone-based subword units for end-to-end speech recognition. Weiran Wang, Guangsen Wang, Aadyot Bhatnagar, Yingbo Zhou, Caiming Xiong, and Richard Socher. Interspeech, 2020.Stochastic Canonical Correlation Analysis. Chao Gao, Dan Garber, Nathan Srebro, Jialei Wang, Weiran Wang (by α-β order). Journal of Machine Learning Research, 2020. Research areas Artificial Intelligence, Machine Learning, and Pattern Recognition Email weiran-wang@uiowa.edu Phone 319-467-1886 Website Personal Website, Google Scholar Contact Information Office Address 201L MacLean Hall (MLH) Iowa City, IA 52242 United States",
  "content_length": 2617,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:00"
}