{
  "name": "Weiren Yu",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/weiren_yu",
  "status": "success",
  "content": "Weiren Yu Skip to main content Skip to navigation News 05/2025, Our work \"UPPR+\" is accepted by SIGIR 2025. 04/2025, Joined PC for IEEE ICDM 2025. 03/2025, Two papers have been accepted by AAAI 2025, and WWW 2025. 02/2025, Joined PC for ACM SIGIR 2025, and EDBT 2026. 09/2024, Welcome two new PhD students, Xiaoyu and Yuxin, to the team! 07/2024, Joined Distinguished Reviewer Board in ACM Trans on The Web. 06/2024, Joined PC for WWW 2025. 05/2024, Five papers accepted by WWW 2024, ICDM 2024, CIKM 2024, and EDBT 2024. 04/2024, Congrats to Sima on securing a Lecturer position at Birmingham City University. 03/2024, Congrats to Ruby and Xiaoyu on receiving PhD scholarships. 10/2023, Will be the Web Chair for VLDB 2025. 08/2023, Joint papers with Hunan University accepted by IEEE TMC and IEEE TITS. 10/2022, Joined the PC of VLDB 2022. 07/2022, I will be the Data Science Course Director at Warwick. 05/2022, Three papers accepted by SIGMOD, WWW, ACM TOIS. Brief BiographyWeiren is an Associate Professor in the Department of Computer Science at the University of Warwick. He is the Data Science Course Director and a member of the Zeeman Institute for Systems Biology and Infectious Disease Epidemiology Research (SBIDER). He was awarded an Honorary Visiting Fellow by the Department of Computing at Imperial College. He received his Ph.D. degree from the School of Computer Science and Engineering at the University of New South Wales (UNSW, Sydney). During his years at UNSW, he was also a Research Assistant at the Commonwealth Scientific and Industrial Research Organisation (CSIRO), and National ICT Australia (NICTA). After that, he spent two years as a Postdoctoral Researcher at the Adaptive Embedded Systems Engineering (AESE) Laboratory in the Department of Computing at Imperial College. He collaborated with NEC Europe Ltd and the Department of Civil and Environmental Engineering at Imperial, working on an IoT project “Big Data Technologies for Smart Water Systems”.Weiren is a recipient of seven Best Paper Awards, including one Best Research Paper Award for ECSA 2016, two CiSRA (Canon Information Systems Research Australia) Best Research Paper Awards for ICDE 2014 and VLDB 2013 respectively, one of the Best Papers of ICDE in 2013, and three Best (Student) Paper Awards for APWEB 2010, WAIM 2010 and WAIM 2011, respectively. He is a member of the IEEE and the ACM.Research InterestsWeiren is interested in effective and efficient data analysis techniques for novel data-intensive applications. His current research interests span the area of Big Data analytics, including: Large-scale Graph Mining Information Retrieval (e.g., web search, hyperlink analysis, recommendation systems, social networks) AI, Deep Learning, and Neural Computing in DB Spatio-temporal Analytics and Big Data Mining Professional ServicesWeiren has been serving on various editorial boards and program committees (e.g., VLDB 2022 PC) and is an active reviewer of many top international journals and conferences.Journal Reviewer IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE) IEEE Transactions on Information Forensics and Security (IEEE TIFS) IEEE Transactions on Neural Networks and Learning Systems (IEEE TNNLS) ACM Transactions on Information Systems (ACM TOIS) ACM Transactions on Knowledge Discovery from Data (ACM TKDD) ACM Transactions on Networks (ACM TON) The VLDB Journal (VLDB J.) World Wide Web Journal (WWW J.) Information Systems (IS) Data Mining and Knowledge Discovery (DMKD) International Journal of Software and Informatics (IJSI) Conference TPC and Reviewer ACM SIGIR International Conference (SIGIR) ACM SIGMOD International Conference (SIGMOD) International Conference on Very Large Data Base (VLDB) International Conference on Data Mining (ICDM) Conference on Information and Knowledge Management (CIKM) Database Systems for Advanced Applications (DASFAA) Australian Database Conference (ADC) International Conference on Extending Database Technology (EDBT) Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD) Data Warehousing and Knowledge Discovery (DaWak) International Conference on Advances in Geographic Information Systems (SIGSPATIAL) International Conference on Web-Age Information Management (WAIM) Some Selected Publications [Full in DBLP]Link opens in a new window M. Zhang, and W. Yu. UPPR+: Scaling Uncertain Personalised PageRank Computation on Billion-Sized Graphs with Mutually Exclusive Edges. ACM SIGIR 2025. W. Yu. SimEdge: A Scalable Transitivity-Aware Graph-Theoretic Similarity Model for Capturing Edge-to-Edge Relationships, WWW, 2025. J. Jiang, H. Tang, Z. Jiang, W. Yu, D. Wu. ARNet: Self-Supervised FG-SBIR with Unified Sample Feature Alignment and Multi-Scale Token Recycling. AAAI, 2025 X. Xu and W. Yu. I-CoSim: Efficient Dynamic CoSimRank Retrieval on Evolving Networks. The Web Conference (WWW '24), Singapore, 2024. L. Yan, and W. Yu. Non-Negative Matrix Factorization for Link Prediction: Preserving Row and Column Spaces. IEEE ICDM, 2024. M. Zhang, and W. Yu. P-Rank+: A Scalable Efficient P-Rank Search Algorithm. ACM CIKM, 2024, Boise, Idaho, USA. M. Zhang, and W. Yu. CSR+: A Scalable Efficient CoSimRank Search Algorithm with Multi-Source Queries on Massive Graphs. ACM EDBT, 2024. Paestum, Italy R. Zhang, and W. Yu. GSim+: Efficient Retrieval of Node-to-Node Similarity Across Two Graphs at Billion Scale. ACM EDBT, 2024. Paestum, Italy J. Ouyang, M. Yu, W. Yu, Z. Qin, A. Regan, D. Wu, TPGraph: A Spatial-Temporal Graph Learning Framework for Accurate Traffic Prediction on Arterial Roads, IEEE Transactions on Intelligent Transportation Systems, 2023. X Li, H Deng, J Ouyang, H Wan, W Yu, D Wu. Act as What You Think: Towards Personalized EEG Interaction through Attentional and Embedded LSTM Learning. IEEE Transactions on Mobile Computing. 2023 X. Ren, L. Shi, W. Yu, S. Yang, C. Zhao, and Z. Xu. LDP-IDS: Local Differential Privacy for Infinite Data Stream. InProceedings of the 2022 International Conference on Management of Data (ACM SIGMOD '22), Philadelphia, PA, USA, 2022. W. Yu, J. Yang, M. Zhang, and D. Wu. CoSimHeat: An Effective Heat Kernel Similarity Measure Based on Billion-Scale Network Topology. The Web Conference (WWW '22). 2022. W. Yu, J. McCann, C. Zhang, and H. Ferhatosmanoglu. Scaling High-Quality Pairwise Link-Based Similarity Retrieval on Billion-Edge Graphs. ACM Transactions on Information System (ACM TOIS). 40(4): 1-45 (2022) D. Wu, H. Xu, Z. Jiang, W. Yu, X. Wei, J. Lu. EdgeLSTM: Towards Deep and Sequential Edge Computing for IoT Applications. IEEE/ACM Transactions on Networking (IEEE/ACM TON). 29(4): 1895-1908 (2021) D. Wu, Z. Jiang, X. Xie, X. Wei, W. Yu, R. Li. LSTM Learning With Bayesian and Gaussian Processing for Anomaly Detection in Industrial IoT. IEEE Trans. Ind. Informatics (IEEE. TII) 16(8): 5244-5253 (2020) W. Yu, X. Lin, W. Zhang, J. Pei, J. McCann. SimRank*: Effective and scalable pairwise similarity search based on graph topology. The VLDB Journal, 28(3), pp. 401-426, 2019 W. Yu, J. McCann, C. Zhang. Efficient Pairwise Penetrating-rank Similarity Retrieval. ACM Transactions on Web (ACM TWEB). 13(4): 21:1-21:52 (2019) W. Yu, X. Lin, W. Zhang, and J. McCann. Dynamical SimRank Assessment on Time-Varying Networks. The VLDB Journal. 79-104. 2018. X. Ren, C. Yu, W. Yu, S. Yang, X. Yang, J. McCann, and P. S. Yu. LoPub: High-Dimensional Crowdsourced Data Publication with Local Differential Privacy. IEEE Transactions on Information Forensics & Security (IEEE TIFS), pp. 2151-2166, 2018. W. Yu, and F. Wang. Fast Exact CoSimRank Search on Evolving and Static Graphs. The 27th International World Wide Web Conference (WWW '18). Lyon, France, pp. 599-608, 2018. W. Yu, and J. McCann. Random Walk with Restart over Dynamic Graphs. The 15th IEEE International Conference on Data Mining (IEEE ICDM '16). Barcelona, Spain, pp.589-598, 2016. W. Yu, and J. McCann. Efficient Partial-Pairs SimRank Search on Large Graphs. The 41st International Conference on Very Large Data Base (VLDB '15). Hawaii, USA, pp. 569-580, 2015. W. Yu, and J. McCann. High-Quality Graph-Based Similarity Search. The 38th ACM SIGIR International Conference (ACM SIGIR '15). Santiago, Chile, pp. 83-93, 2015. W. Yu, and J. McCann. Co-Simmate: Quick Retrieving All Pairwise Co-Simrank Scores. The 53rd Annual Meeting of the Association for Computational Linguistics. (ACL '15). Beijing, China, pp. 327-334, 2015. W. Yu, X. Lin, and W. Zhang. Fast Incremental SimRank on Link-Evolving Graphs. The 30th IEEE International Conference on Data Engineering (IEEE ICDE '14), Chicago, USA, pp. 304-315, 2014. W. Yu, and J. McCann. Sig-SR: SimRank Search over Singular Graphs.The 37th ACM SIGIR International Conference (ACM SIGIR '14), Brisbane, Australia, 2014. W. Yu, X. Lin, W. Zhang, and J. McCann. Fast All-Pairs SimRank Assessment on Large Graphs and Bipartite Domains. IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE), 27(7): 1810-1823, 2014. W. Yu, X. Lin, and W. Zhang. Towards Efficient SimRank Computation on Large Networks. The 29th IEEE International Conference on Data Engineering (IEEE ICDE '13), Brisbane, Australia, pp. 601-612, 2013. W. Yu, X. Lin, W. Zhang, L. Chang, and J Pei. More is Simpler: Effectively and Efficiently Assessing Node-Pair Similarities Based on Hyperlinks. The 40th International Conference on Very Large Data Base (VLDB '13), Hangzhou, China, pp. 13-24, 2013. W. Yu, and X. Lin. IRWR: Incremental Random Walk with Restart. The 36th ACM SIGIR International Conference (ACM SIGIR '13), Dublin, Ireland, 2013. W. Yu, X. Lin, W. Zhang, Y. Zhang, and J. Le. SimFusion+: Extending SimFusion Towards Efficient Estimation on Large and Dynamic Networks. The 35th ACM SIGIR International Conference (ACM SIGIR '12), Portland, USA, pp. 365-374, 2012. Technical Report W. Yu, J. McCann, C. Zhang, and H. Ferhatosmanoglu. Scaling High-Quality Pairwise Link-Based Similarity Retrieval on Billion-Edge Graphs. (A complete version with proofs ",
  "content_length": 11046,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:00"
}