{
  "name": "Weisong Shi",
  "homepage": "http://weisongshi.org",
  "status": "success",
  "content": "ï»¿ Weisong Shi's Homepage Weisong Shi Alumni Distinguished Professor and Chair Department of Computer and Information Sciences Department of Mechanical Engineering (Joint Appointment) University of Delaware Director, Connected and Autonomous Research Laboratory (CAR) Contact: weisong@udel.edu | (302) 831-7603 [CV] [Publications] [Highlights] [Students] [Books] [News] Research Interests Edge Computing, Vehicle Computing, Autonomous Driving, and Connected Health New Book (October 2025) Short Bio Weisong Shi is an Alumni Distinguished Professor and Chair of the Department of Computer and Information Sciences at the University of Delaware (UD), where he leads the Connected and Autonomous Research (CAR) Laboratory. He currently serves as the honorary director of the National Science Foundation (NSF) eCAT Industry-University Cooperative Research Center (IUCRC) (2023â2028), which focuses on advancing electric, connected, and autonomous mobility technologies. A globally recognized expert in edge computing, autonomous driving, and connected health, Dr. Shi authored the pioneering paper âEdge Computing: Vision and Challenges,â which has garnered over 9,000 citations. Prior to joining UD, he held the position of professor at Wayne State University (2002-2022). During his tenure, he held various administrative roles, including Associate Dean for Research and Graduate Studies at the College of Engineering and Interim Chair of the Computer Science Department. Additionally, Dr. Shi served as a National Science Foundation (NSF) program director (2013-2015). Dr. Shi currently holds the positions of Editor-in-Chief of IEEE Internet Computing Magazine and Elsevier Smart Health. He is also the founding steering committee chair of three conferences, including the ACM/IEEE Symposium on Edge Computing (SEC), the IEEE/ACM International Conference on Connected Health (CHASE), and the IEEE International Conference on Mobility (MOST). Notably, he is the General Chair of ACM MobiComâ24, the flagship conference on Mobile Computing and Wireless Networking. He is a fellow of the Institute of Electrical and Electronics Engineers (IEEE), a distinguished scientist of the Association for Computing Machinery (ACM), a former member of the National Science Foundation (NSF) Computer and Information Science Engineering (CISE) Advisory Committee, and a council member of the Computing Community Consortium (CCC) under the Computer Research Association (CRA). Highlighted Articles A Vision for Transformative Intersections, IEEE Computer Magazine, Vol. 57, No. 12, December 2024. pp. 58-68. VPI: Vehicle Programming Interface for Vehicle Computing, Journal of Computer Science and Technology, Vol. 39, No.1, pp. 22-44, January 2024. Vehicle Computing: Vision and Challenges, Journal of Information and Intelligence, Vol. 1, No. 1, May. 2023. pp.23-35. Computing Systems for Autonomous Driving: State-of-the-Art and Challenges, IEEE Internet of Things Journal (IoTJ), Vol. 8, No. 8, April 2021. pp. 6469-6486. (500+ citations) Edge Computing for Autonomous Driving: Opportunities and Challenges, Proceedings of the IEEE (PIEEE), Vol. 107, No. 8, August 2019. pp. 1697-1716. (900+ citations) Edge Computing: Vision and Challenges, IEEE Internet of Things Journal (IoTJ), Vol. 3, No. 5, October 2016, pp. 637-646.(9,000+ citations) Awards and Honors Clarivate Highly Cited Researchers (2025) Alumni Distinguished Professor (2024) Crain's Notable Leaders in EV (2022) IEEE TCI Distinguished Service Award (2020) IEEE Fellow (2016) NSF CAREER Award (2007) National Distinguished Ph.D. Dissertation Award of China (2002) Microsoft Research Asia Fellowship (1999) Professional Leadership and Services CCC Council  2024 - NSF CISE Advisory Committee  2023 - 2025 Fellow Evaluation Committee of IEEE Computer Society 2025, 2024, 2023, 2019, 2018, 2017 Chair of IEEE Special Technical Community on Autonomous Driving Technologies (2020 - 2023) Chair of IEEE Technical Committee on the Internet (2012 - 2016) Editor-In-Chief, IEEE Internet Computing, 2024 - Editor-In-Chief, Elsevier Smart Health Journal, 2016 - Editorial board member of ACM Journal of Autonomous Transportation Systems (JATS), 2024 - Editorial board member of ASME Journal of Autonomous Vehicles and Systems, 2024 - Editorial board member of ACM Transactions on Internet Technologies (TOIT), 2024 - Editorial board member of ACM Computing Surveys, 2023 - Editorial board member of ACM Transactions on Internet of Things, 2018 - Editorial board member of Journal of Computer Science and Technology, 2010 - Guest Editor of IEEE Internet Computing: Vehicle Computing (2023) Guest Editor of IEEE Internet Computing: Connected Living (2023) Guest Editor of IEEE Internet Computing: Toward Fully Autonomous and Networked Vehicles Guest Editor (Lead) of Proceedings of the IEEE: Edge Computing (2019) Steering committee chair of ACM/IEEE Symposium on Edge Computing (SEC 2016 - ) Steering committee chair of IEEE/ACM Connected Health (CHASE 2016 - ) Steering committee chair of IEEE International Conference on Mobility: Operations, Services, and Technologies (MOST, 2022 - ) Steering committee member of CCC Computing Futures Symposium 2025 Steering committee member of CCC/IEEE CS Computing on Fly Vision Workshop Chair, NSF 2018 CSR PI Meeting Co-Chair, NSF Workshop on Grand Challenges in Edge Computing, October 2016 General Chair:MOST25, MobiCom24, CHASE24, IC2E24, IoTDI23, ICMLA21, MetroCAD21, SEC18, CHASE18 Program Chair: MOST23, IoTDI22,MetroCAD20, IGSC16, CoolDC16 Track Chair: CVPR'24 (AC), ICDCS23 on \"Edge Computing\" Recent Invited Talks 7/8/24 Invited talk at Ford Greenfield Labs @ Silicon Valley on \"Vehicle Computing: A New Era of Autonotive Industry\" 5/22/24 Invited talk at AutoSens on \"Vehicle Computing: A New Era of Automotive Industry\" 5/21/24 Tutorial at AutoSens on \"ICAT: Indoor Connected and Autotonomous Testbed\" 1/10/24 Invited talk at TRB Edge Computing Subcommittee on \"Vehicle Computing: Vision and Challenges\" 10/20/23 Invited talk at the Ohio State University on \"Vehicle Computing: Vision and Challenges\" 10/16/23 Lead a breakout session at 2023 NSF Computer Systems Research PI meeting 9/8/23 Invited talk at Nio Academy on \"Vehicle Computing: Vision and Challenges\" 2/8/23 Invited talk at PennEngineering's Autoware Safe Autonomy Seminar on \"Vehicle Computing: Vision and Challenges\" 12/08/22 Keynote at IEEE International Conference on Uitility and Cloud Computing (UCC) on \"Vehicle Computing: Vision and Challenges\" 9/22/22 Invited talk at Uber on \"Vehicle Computing: Vision and Challenges\" In the News [Bloomberg]: Chinese Robotaxis Race Waymo to Take Driverless Cars Global [WIRED]: Self-Driving Cars Are Beiing Put on a Data Diet [UDEngineering]: Named Computer and Information Sciences Chair at UD [Today@wayne]: Leader in Electric Vehicle Revolution [Computerworld]: The cutting edge of healthcare: How edge computing will transform medicine [Today@Wayne]: Wayne State researchers receive NSF funding to develop COVID-19 risk-prediction system [Today@Wayne]: Wayne State researchers tabbed for Michigan Mobility Challenge at NAIAS [HealthTech Magazine]: Will Edge Computing Transform Healthcare? [IEEE ITS]: Featured on IEEE Intelligent Transportation Systems [Bio.IT World]: On The Edge: Technologies Driving Edge Computing And Challenges Ahead [dbusiness]: Wayne State Researchers Secure nearly $1M for Microplastics Pollution Research [WSU Faculty Impact]: Wayne State Professor Uses Edge Computing to Shore Up Big Data [DrivenDetroit]: Wayne State CAR Lab innovates edge computing and open platform [Today@Wayne] Facebook awards Wayne State University's edge computing research [Facebook] Announcing Winners of Facebook Resarch Award [Today@Wayne] Wayne State research team receives Microsoft Azure Research Award [Healthcare Analytics News] How Edge Computing Can Advance Healthcare [China Science Daily] The Rise of Edge Computing [Engineering]: Computer Science Professor appointed to Editorial Positions [Today@Wayne]: Wayne State University joins the OpenFog Consortium [Today@Wayne]: WSU program to innovate in Detroit \"Internet of Things\" [Engineering]: Two College of Engineering Professors named IEEE Fellows [NewsWise]: Sustainable Computing and Computer Systems Expert to Serve as NSF Program Director [Popular Science]: How Will We Keep Track of Our Robot Minions? [Robotics Tomorrow]: LOBOT Technique Provides Accurate, Real-Time, 3-D Positions for Robotic Vehicles Want stay tuned? please follows us on LinkedIn. Contact Professor Weisong Shi Department of Computer and Information Sciences University of Delaware 101J Smith Hall, 18 Amstel Ave Newark, DE 19716",
  "content_length": 8685,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:01"
}