{
  "name": "Weisi Lin",
  "homepage": "https://www3.ntu.edu.sg/home/wslin",
  "status": "success",
  "content": "Home Weisi Lin BSc, MSc, PhD FIEEE, FIET, CEng, Hon. FSIET Professor  President's Chair in Computer Science Associate Dean (Research) College of Computing and Data Science Nanyang Technological University50 Nanyang Avenue, Singapore 639798Email: wslin@ntu.edu.sg âScience is not only a dsciple of reason but, also, one of romance and passion.â -- Stephen Hawking Postdoc/RA positions open for visual signal modeling for human/machine intelligence, scent signal  representation, neural network compression, and AI-driven climate/environmental monitoring. contact me at wslin@ntu.edu.sg. A few words about myself... I received a Bachelor's degree in Electronics and then a Master's degree in Digital Signal Processing from Sun Yat-Sen University, Guangzhou, China. I obtained my Ph.D. in Computer Vision from Kingâs College, London University, UK. I taught and researched in Sun Yat-Sen University, Shantou University (China), Bath University (UK), National University of Singapore, Institute of Microelectronics (Singapore), and Institute for Infocomm Research (Singapore). In February 2007, I joined the faculty of Nanyang Technological University. I am a Fellow of IEEE, a Fellow of IET, a Chartered Engineer, and Honorary Fellow of SIET (Singapore Institute of Engineering Technologists). My research deals with image processing, perception-based modeling, video compression, and multimedia communication. I believe that good theory is practical and effective teamwork can achieve the goal of \"1+1>2\"; I have kept a balance of academic research and industrial deployment in my working life, and also managed over ten successfully-delivered major projects for external customers. It has been my good fortune to have the chances to work with many colleagues and students in various organizations. I always look forward to collaborating with more researchers who think alike, and am eager to meet new students with an interest in image processing, visual understanding and multimedia communication, as well as modeling the relevant physiological, cognitive and psychological findings. We have built a COVID-19 Test Strip Reader (video) (report) with colleagues in School of Chemical and Biomedical Engineering. We have also built a Retargeted Image Subjective Quality Database and a database for Perceptual Quality Assessment of Screen Content Images (SIQAD). Some other past research can be seen here. At leisure, I like reading and taking walks. The books I like include: The Seven Habits of Highly Effective People, by Stephen R. Covey; Fishing Lessons-Insights, Fun, and Philosophy from a Passionate Angler, by Paul Quinnett; A Brief History of Time, by Stephen Hawking; Bounce: Mozart, Federer, Picasso, Beckham, and the Science of Success,  by Matthew Syed; The Happy Student: 5 Steps to Academic Fulfillment and Success, by Daniel Wong; LETTERS TO HIS SON, by the EARL OF CHESTERFIELD; Tan Swie Hian Fables; Teacher Man, by Frank McCourt; Tuesdays with Morrie, by Mitch Albom; The 38 Letters from J.D. Rockefeller to his son: Perspectives, Ideology, and Wisdom. I also like Prof Randy Pausch's Last Lecture, and the transcription of \"You and Your Research'' by Dr. Richard W. Hamming. My current research team members: Mr Chen Zhuo B. Eng Project: Deep-learnt visual feature codingResearch interests: deep learning and visual feature coding Personal website link Congratulations for being selected into Lean LaunchPad Singapore - a governmental innovation and commercialisation platform- with technology in  collaborative intelligence, 2020! Mr Hou Jingwen B.Eng, MSc Project: Blind image quality assessmentResearch interests: deep learning-based perceptual quality assessment Congratulations for leading toward Second Runner-up for the 5-Minute Video Clip Contest at IEEE ICIP 2020 ! Mr Hu Zhi B. Eng Project: Point-cloud segmentation and applicationsResearch interests: 3D segmentation, Semantic SLAM, Deep Learning Dr Zhao Baoquan B. Eng, PhD Project: 3D Point Cloud CompressionResearch interests: 3D Point Cloud Processing and Coding, Multimedia Content Analysis Dr Zhang Guoqing B.Sc, MSc, PhD Project: Intelligent visual analysis with pedestrian tracking & person re-identificationResearch interests: Person re-identification, pattern recognition and machine learning Dr Lv Chenlei B.Eng, PhD Project: Point Cloud SimplificationResearch interests: Discrete differential geometry, Non-rigid retrieval & registration, Point cloud processing, 3D Face modelling & Recognition Personal website link Dr Jin Jian B. Eng, M. Eng, PhD Project: Perceptual image/video codingResearch interests: 2D/3D image/video coding, 3D scene rendering, computer vision, and deep learning Personal website link Mr Teerawat Piriyatharawet Project: Lightweight Deep Learning for Image Processing and UnderstandingResearch interests:   image processing, Just-noticeable difference models, deep learning Mr Koh Jun Hao Project: Intelligent visual analysis with pedestrian tracking & person re-identificationResearch interests:  super-resolution reconstruction, machine learning It is my pleasure to have had the chances to work substantially with many researchers since 2007. Dr Yang Sheng B.Eng, PhD Project:  Visual Saliency and Quality Evaluation via Machine LearningResearch interests:  Visual Attention, Image Quality Assessment, Machine Learning Personal website link Dr Cheng Wentao B.Eng, PhD Project: Simplification, Filtering and Image-based Localization of 3D Point Clouds Research interests: Tone Mapping, Image-Based Rendering, Real Time Graphics Congratulations to Wentao for award of  ICCV 2019 Travel Grant! Dr Xinfeng Zhang B.Eng, Ph.D Assistant Professor, University of Chinese Academic of Sciences, China Personal website link Dr Zhang Yabin B.Eng, PhD Senior Researcher, Tencent, Shenzhen, China Personal website link Dr Gu Ke B.Sc, PhD Professor, Beijing University of Technology , China Personal website link Dr Vinit Jakhetiya B.Eng, PhD Assistant Professor, Indian Institute of Technology (IIT), Jammu, India Personal website link Dr Wang Shiqi B.Eng, PhD Assistant Professor, City University of Hong Kong Personal website link Dr Prakhya Sai Manoj B.Eng, PhD Systems Engineer, Aptiv, Wuppertal, Germany Personal website link Congratulations to Sai for Best Paper Award in Robotics domain, TENCON 2017!Congratulations for Sai's obtaining the Student Travel Grant,  for both  IEEE ICRA2015 and IAPR MVA 2015! Dr Jiang Qiuping B.Eng, PhD Assoc Professor, Ningbo University, China Dr Issac Niwas Swamidoss B.Eng., M. Eng., PhD Research Specialist, Tawazun Technology and Innovation (Tawazun Economic Council), Abu Dhabi, UAE Dr Xu Long B.Eng, M. Eng, Ph.D Professor, National Astronomical Observatories of the Chinese Academy of Sciences (NAOC), China Congratulations to Long's being selected into the 100-Talents Plan, Chinese Academy of Sciences, 2014! Dr Li Leida B.Sc, Ph.D Professor,  School of Artificial Intelligence, Xidian University, China Personal website link Dr Yuming Fang B.Sc., M. Sc., PhD Professorï¼Jiangxi University of Finance and Economics, China Personal website link Congratulations to Yuming for the 2012 Dragon Venture â NTU Award! Dr Qiaohong Li B.Sc., PhD Research Fellow, National University of Singapore (NUS) Dr Huan Yang B.Sc., M. Sc., PhD Assoc Professor, Qingdao University, China Personal website link Dr Jinjian Wu B.Eng, PhD Professor, School of Electronic Engineering, Xidian University, China Personal website link Congratulations to Jinjian's  IEEE International Symposium on Circuits and Systems  (ISCAS2013) Student Best Paper Award! Dr Sharath Chandra Guntuku B.E (Hons), PhD Research Assistant Professor, School of Engineering and Applied Science, University of Pennsylvania, USA Personal website link Congratulations  for Sharath's obtaining the Student Travel Grants, ACM Multimedia Conference (ACM MM), 2015! Dr Yuan Yuan B.Eng, PhD Senior Algorithm Engineer, Huawei, Singapore Personal website link Dr Cong Runmin B.Sc, PhD Associate Professor, School of Computer and Information Technology, Beijing Jiaotong University, China Personal website link Dr Tsung-Jung Liu B. S., M.S., PhD Associate Professor, EE & GICE, National Chung Hsing University, Taiwan Personal website link Dr Lu Dong B.Sc., PhD Teaching & Research Supervisor, Jiangsu EDUBOT Education Technology Group Co. Ltd, China Mr Narasimhan Rajesh B.Tech - IT, MSc Congratulations to Rajesh for winning the 2nd prize for the ST Electronics Security Apps Challenge (2014, Singapore)! Dr Lin Ma B.E., M.E., PhD Principal Researcher, Tencent AI Lab Personal website link Dr Xu Qianqian B.Eng, M.Eng, PhD Associate Professor, Institute of Computing Technology (ICT), Chinese Academy of Sciences Personal website link Dr Manish Narwaria B.Tech.,  PhD Assistant Professor, Indian Institute of Technology (IIT),  Jodhpur, India Personal website link Dr Lining Zhang B.Eng, M.Eng, PhD Senior Research Scientist,  I2R, A*STAR, Singapore Dr Zhouye Gu B.Sc., M. Sc., PhD Researcher, Apple Inc,  USA Dr Anmin Liu B.Sc., PhD Senior Researcher, Panasonic, Singapore Dr Chenwei Deng Ph.D Professor, Beijing Institute of Technology, China Dr Feng Shao PhD Professor, Ningbo University, China Dr Manoranjan Paul B.Sc.Eng. (hons.), PhD Professor,  Charles Sturt University, Australia Personal website link Congratulations to Ranjan's obtaining of Research Excellence Award 2011 from School of Computing and Mathematics, Charles Sturt University! Dr Fan Zhang B. Eng, PhD Researcher, Lenovo Cooperation Research, Hong Kong Congratulations to Fan for winning the ITU-T Study Group 12 competition in June 2012, with the visual quality metrics! Dr Guangtao Zhai B.Eng, M.Eng, PhD Professor,  Shanghai Jiao Tong University, China Congratulations to Guangtao for the TOP 100 PhD Theses in China 2012! Dr Wei Liu Ph.D Associate Professor, South China Normal University, China Mr Kng Poh Leong, Vincent B.Eng Research Engineer,  Institute for Inforcomm Research, Singapore Dr Nevrez ImamoÄlu B.Sc. (Dou",
  "content_length": 10238,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:00"
}