{
  "name": "Weitao Xu",
  "homepage": "https://www.weitaoxu.com",
  "status": "success",
  "content": "HomepageSearchWeitao XuAssociate Professor, Department of Computer ScienceCity University of Hong Kong (CityU)BiographyI'm a tenured Associate Professor at the Department of Computer Science at City University of Hong Kong. I worked as a Postdoctoral Research Associate at University of New South Wales (UNSW) from June 2017 to August 2019. I obtained my PhD degree from the University of Queensland in 2017 (advised by Prof. Neil Bergmann and Prof. Wen Hu). I received my B.E. degree in Communication Engineering and M.E. degree in Communication and Information System both from the School of Information Science and Engineering, Shandong University (SDU) , China, in 2010 and 2013, respectively. I'm an IEEE Senior Member and a ACM Member.[Recruitment] I'm leading the Smart Sensing and Mobile Computing (S2MC) group at CityU and continuously looking for self-motivated PhD/Postdoc/RA to join us. I have relatively broad research interests, but generally my previous research focuses on Internet-of-Things (IoT) such as smart sensing, IoT security, wearables/AR/VR, application of LLM in IoT, wireless network etc (please visit our group website for more details). For current available PhD positions in my group. please visit Recruitment for more information. My principle of PhD supervision is “to help every single student become the best that they can be.”Email: weitaoxu@cityu.edu.hkInterestsInternet of Things (IoT)Mobile ComputingIoT SecurityWearables/AR/VRLarge Language Model (LLM)Low-power Wide-area Network (LPWAN)EducationPhD in Computer Science, 2017University of QueenslandMEng in Information System, 2013Shandong UniversityBEng in Communication Engineering, 2010Shandong UniversityExperience     Associate ProfessorCity University of Hong KongJul 2025 – Present Hong Kong     Assistant ProfessorCity University of Hong KongAug 2019 – Jun 2025 Hong Kong     PostdocUniversity of New South WalesJun 2017 – Aug 2019 Sydney, Australia     PhD candidateUniversity of QueenslandOct 2013 – May 2017 Brisbane, AustraliaNews*2024.08 Our paper “Medusa3D: The Watchful Eye Freezing Illegitimate Users in Virtual Reality Interactions” received the Honorable Mention Award in MobileHCI 2024. Congrats to Aochen nd Di Duan!*2024.08 Our paper entitled “Seeing the Invisible: Recovering Surveillance Video with COTS mmWave Radar” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Mingda!*2024.06 Our paper entitled “InaudibleKey2.0: Deep Learning-empowered Mobile Device Pairing Protocol based on Inaudible Acoustic Signals” has been accepted by IEEE/ACM Transactions on Networking. Congrats to Huanqi!*2024.06 Our paper entitled “Scenario-Adaptive Key Establishment Scheme for LoRa-enabled IoV Communications” has been accepted by IEEE Transactions on Mobile Computing. Congrats to Huanqi!*2024.06 Our paper entitled “REHSense: Towards Battery-Free Wireless Sensing via Radio Frequency Energy Harvesting” has been accepted by MobiHoc 2024. Congrats to Tao Ni!*2024.02 Our paper entitled “RF-Egg: An RF Solution for Fine-Grained Multi-Target and Multi-Task Egg Incubation Sensing” has been accepted by MobiCom 2024. Congrats to Zehua Sun!*2023.10 Our paper entitled “XGait: Cross-Modal Translation via Deep Generative Sensing for RF-based Gait Recognition” has been accepted by SenSys 2023. Congrats to Huanqi Yang!*2023.03 Our paper entitled “EMGSense: A Low-Effort Self-Supervised Domain Adaptation Framework for EMG Sensing” received the IEEE PerCom 2023 Best Paper Award (1 out of the 27 accepted papers). Big congrats to Di Duan!*2022.12 Our paper entitled “EMGSense: A Low-Effort Self-Supervised Domain Adaptation Framework for EMG Sensing” has been accepted by Percom 2023. Congrats to Di Duan!*2022.12 Our paper entitled “Uncovering User Interactions on Smartphones via Contactless Wireless Charging Side Channels” was accepted by S&P 2023. Congrats to Tao Ni!*2022.12 Our paper entitled “ChirpKey: A Chirp-level Information-based Key Generation Scheme for LoRa Networks via Perturbed Compressed Sensing” was accepted by INFOCOM 2023. Congrats to Huanqi!*2022.12 Our paper entitled “WashRing: An Energy-efficient and Highly Accurate Handwashing Monitoring System via Smart Ring” was accepted by IEEE TMC!*2022.09 Congrats to Zehua who recevied the Outstanding Academic Performnace Award and Huanqi who received the Research Tuition Scholarship!*2022.07 We paper entitled “Eavesdropping Mobile App Activity via Radio Frequency Energy Harvesting” has been conditionally accepted by USENIX Security!, Congrats, Tao Ni!*2022.06 We paper entitled “SwipePass: Acoustic-based Second-factor User Authentication for Smartphones” has been conditionally accepted by IMWUT 2022!, Congrats, Yongliang!*2022.05 Our paper entitled “Recent Advances in LoRa: A Comprehensive Survey” has been accepted by ACM TOSN!, Congrats, Zehua!*2022.04 Our paper entitled “Vehicle-Key: A Secret Key Establishment Scheme for LoRa-enabled IoV Communications” has been accepted by ICDCS 2022! Congrats, Huanqi!*2022.03 Our paper entitled “Time-constrained Ensemble Sensing with Heterogeneous IoT Devices in Intelligent Transportation Systems” has been accepted by IEEE TITS!*2022.02 Our paper entitled “i^2Key: A Cross-sensor Symmetric Key Generation System using Inertial Measurements and Inaudible Sound” has been accepted by IPSN 2022!*2021.12 Our paper entitled “GASLA: Enhancing the Applicability of Sign Language Translation” has been accepted by INFOCOM 2022!Cite ×Copy Download",
  "content_length": 5483,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:00"
}