{
  "name": "Weiwen Jiang",
  "homepage": "https://www.gmu.edu/profiles/wjiang8",
  "status": "success",
  "content": "Weiwen Jiang | George Mason University Skip to content Weiwen Jiang Titles and Organizations Tenure-track Assistant Professor, Department of Electrical and Computer Engineering Contact Information Campus: FairfaxBuilding: Nguyen Engineering BuildingRoom 3247Mail Stop: 1G5Phone: (703)-993-5083Email: wjiang8@gmu.edu In the News George Mason researcher gets CAREER award for quantum leaps in computing, with the help of AIFebruary 13, 2025 Quantum conundrums: Navigating noise and enhancing expertise August 23, 2023 Weiwen Jiang wins IEEE Best Paper AwardDecember 13, 2021 Personal Websites Lab Website Biography Weiwen Jiang joined Mason in 2021. Prior to this, he was a post-doctoral research associate at the University of Notre Dame. He received his PhD from Chongqing University in 2019. From 2017 to 2019, he conducted research at the University of Pittsburgh and was co-advised by the professor there for his PhD thesis. He works on Quantum Computing, AI Accelerators, and Hardware-Software Co-Design. Jiang has published more than 80 research articles in refereed international conferences and premier journals, including 10+ IEEE/ACM Transactions papers. He is the recipient of the NSF CAREER AWARD 2025, ACM Sigda Meritorious Service Award 2024, the Best Paper Award in IEEE QuantumWeek 2023, IEEE TCAD 2021, NVMSA’15 and ICCD’17, the Best Paper Nomination in ASP-DAC’16, DAC’19, CODES+ISSS’19, and ASP-DAC’20 Best Poster Award in ORNL’s Quantum Computing User Forum 2023, First Place of the 31st ACM SIGDA University Demonstration at DAC 2021, Second Place of the 32nd ACM SIGDA University Demonstration at DAC 2022, and Top Winning Awards at IEEE Services Hackathon 2020. His works are supported by variance funding sources including NSF, DoE, ARO, Meta, and Leidos. Jiang served as the Technical Track Co-Chair at IEEE QuantumWeek (2023-2025) Associate Editor at IEEE Transactions on Circuits and Systems - II: Express Briefs (2022-2023). He created the Quantum System Stability and Reproducibility Workshop (StableQ) and Tiny and Fair ML Design Competition at IEEE/ACM ESWEEK 2023. Degrees PhD, Computer Science, Chongqing University Joint PhD, Electrical and Computer Engineering, University of Pittsburgh",
  "content_length": 2220,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:01"
}