{
  "name": "Weiwei Liu 0003",
  "homepage": "https://sites.google.com/site/weiweiliuhomepage",
  "status": "success",
  "content": "Weiwei Liu's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationWELCOME!Weiwei Liu, Professor Email: liuweiwei863 AT gmail.com                                              Weiwei Liu (刘威威)Since January 2019, I am a full professor at the School of Computer Science, Wuhan University, China.                                                                    April 2017- August 2018, I was a postdoctoral scholar at the School of Computer Science and Engineering in the University of New South Wales (UNSW). Before joining the UNSW, I obtained my PhD from the Faculty of Engineering and Information Technology, University of Technology Sydney (UTS) in Aug. 2017,  where I was fortunate to be supervised by Prof. Ivor W. Tsang.I received my Master's degree in Software Engineering from Peking University in 2013 and got the Bachelor's double degree in Transport Engineering and English Literature from Tianjin University of Technology in 2010.I am a KungFu lover and spent many years in playing KungFu at Guoyang County of  Anhui Province before entering high school in 2003. Here is my CV.                        \"The soul without imagination is what an observatory would be without a telescope.\"                                                                                                                                                          ------Henry Ward BeecherResearch InterestsMy primary research interest is machine learning. Particularly, I focus on Robust Machine Learning, High Dimensional Analysis, Learning theory, etc.Publications My Google Scholar Citations Page Conference Papers（* denotes the corresponding author ）Xin Zou, Zhengyu Zhou, Jingyuan Xu, Weiwei Liu*: A Boosting-Type Convergence Result for AdaBoost.MH with Factorized Multi-Class Classifiers. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2024. (Solves a COLT 2014 open problem).   Xiyuan Li, Youjun Wan, Weiwei Liu*: The Reliability of OKRidge Method in Solving Sparse Ridge Regression Problems. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2024.    Xiyuan Li, Weiwei Liu*: Error Analysis of Spherically Constrained Least Squares Reformulation in Solving the Stackelberg Prediction Game. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2024.  Zhengyu Zhou, Weiwei Liu*: Sequential Kernel Goodness-of-fit Testing. International Conference on Machine Learning (ICML), 2024.  Boqi Li, Weiwei Liu*: A Theoretical Analysis of Backdoor Poisoning Attacks in Convolutional Neural Networks. International Conference on Machine Learning (ICML), 2024. (Spotlight, 3.5% acceptance rate).  Xinsong Ma, Xin Zou, Weiwei Liu*: A Provable Decision Rule for Out-of-Distribution Detection. International Conference on Machine Learning (ICML), 2024.Zekai Wang, Zhengyu Zhou, Weiwei Liu*: DRF: Improving Certified Robustness via Distributional Robustness Framework. AAAI Conference on Artificial Intelligence (AAAI), 2024.Xin Zou, Weiwei Liu*: Coverage-guaranteed Prediction Sets for Out-of-distribution Data.AAAI Conference on Artificial Intelligence (AAAI), 2024.Lianghe Shi, Weiwei Liu*: A Closer Look at Curriculum Adversarial Training: From an Online Perspective. AAAI Conference on Artificial Intelligence (AAAI), 2024.  Kun Li, Weiwei Liu, Yong Luo, Xiantao Cai, Jia Wu and Wenbin Hu: Zero-shot Learning for Preclinical Drug Screening. International Joint Conference on Artificial Intelligence (IJCAI), 2024. Weiwei Liu: Improved Bounds for Multi-task Learning with Trace Norm Regularization. Annual Conference on Learning Theory (COLT) 2023: 700-714. (First COLT paper in Hubei Province, Sole author).Xin Zou, Weiwei Liu*: On the Adversarial Robustness of Out-of-distribution Generalization Models. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2023.Jingyuan Xu, Weiwei Liu*: Characterization of Overfitting in Robust Multiclass Classification. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2023.Yanbo Chen, Weiwei Liu*: A Theory of Transfer-Based Black-Box Attacks: Explanation and Implications. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2023.Lianghe Shi, Weiwei Liu*: Adversarial Self-Training Improves Robustness and Generalization for Gradual Domain Adaptation. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2023. Chenglin Yu, Xinsong Ma, Weiwei Liu*: Delving into Noisy Label Detection with Clean Data. International Conference on Machine Learning (ICML) 2023: 40290-40305. (Short Live Presentation). Rui Gao, Weiwei Liu*: DDGR: Continual Learning with Deep Diffusion-based Generative Replay. International Conference on Machine Learning (ICML) 2023: 10744-10763.  Zekai Wang, Tianyu Pang, Chao Du, Min Lin, Weiwei Liu*,Shuicheng Yan: Better Diffusion Models Further Improve Adversarial Training. International Conference on Machine Learning (ICML) 2023: 36246-36263.Boqi Li, Weiwei Liu*: WAT: Improve the Worst-class Robustness in Adversarial Training. AAAI Conference on Artificial Intelligence (AAAI) 2023: 14982-14990.Xiaobo Shen, Yinfan Chen, Shirui Pan, Weiwei Liu, Yuhui Zheng: Graph Convolutional Incomplete Multi-modal Hashing. ACM International Conference on Multimedia (MM), 2023.Haobo Wang, Shisong Yang, Gengyu Lyu, Weiwei Liu, Tianlei Hu, Ke Chen, Songhe Feng, Gang Chen: Deep Partial Multi-Label Learning with Graph Disambiguation. International Joint Conference on Artificial Intelligence (IJCAI) 2023: 4308-4316.Xinsong Ma, Zekai Wang, Weiwei Liu*: On the Tradeoff Between Robustness and Fairness. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2022.  Xiyuan Li, Xin Zou, Weiwei Liu*: Defending Against Adversarial Attacks via Neural Dynamic System. Advances in Neural Information Processing Systems (NIPS/NeurIPS),2022.  Jingyuan Xu, Weiwei Liu*: On Robust Multiclass Learnability. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2022.Zekai Wang, Weiwei Liu*: Robustness Verification for Contrastive Learning. International Conference on Machine Learning (ICML), 2022: 22865-22883. (Long Presentation, 2% acceptance rate). Yuren Mao, Zekai Wang, Weiwei Liu*, Xuemin Lin, Pengtao Xie: MetaWeighting: Learning to Weight Tasks in Multi-Task Learning. Annual Conference of the Association for Computational Linguistics (ACL) Findings, 2022: 3436-3448.Yuren Mao, Zekai Wang, Weiwei Liu*, Xuemin Lin, Wenbin Hu: BanditMTL: Bandit-based Multi-task Learning for Text Classification. Annual Conference of the Association for Computational Linguistics (ACL), 2021: 5506-5516.Yuren Mao, Weiwei Liu*, Xuemin Lin: Adaptive Adversarial Multi-task Representation Learning. International Conference on Machine Learning (ICML), 2020: 6724-6733.Yuren Mao, Shuang Yun, Weiwei Liu*, Bo Du: Tchebycheff Procedure for Multi-task Text Classification. Annual Conference of the Association for Computational Linguistics (ACL), 2020: 4217-4226.Xinjian Huang, Bo Du, Weiwei Liu*: Multichannel Color Image Denoising via Weighted Schatten p-norm Minimization. International Joint Conference on Artificial Intelligence (IJCAI), 2020: 637-644.Pinghua Xu, Wenbin Hu, Jia Wu, Weiwei Liu*: Opinion Maximization in Social Trust Networks. International Joint Conference on Artificial Intelligence (IJCAI), 2020: 1251-1257.Haobo Wang, Zhao Li, Jiaming Huang, Pengrui Hui,Weiwei Liu*, Tianlei Hu, Gang Chen: Collaboration Based Multi-Label Propagation for Fraud Detection. International Joint Conference on Artificial Intelligence (IJCAI), 2020: 2477-2483.Haobo Wang, Weiwei Liu*, Yang Zhao, Tianlei Hu, Ke Chen, Gang Chen: Learning From Multi-Dimensional Partial Labels. International Joint Conference on Artificial Intelligence (IJCAI), 2020: 2943-2949.  Code.Zhenyu Qiu, Wenbin Hu, Jia Wu, Weiwei Liu*, Bo Du, Xiaohua Jia: Temporal Network Embedding with High-Order Nonlinear Information. AAAI Conference on Artificial Intelligence (AAAI), 2020: 5436-5443.Haobo Wang, Chen Chen, Weiwei Liu, Ke Chen, Tianlei Hu, Gang Chen: Incorporating Label Embedding and Feature Augmentation for Multi-Dimensional Classification. AAAI Conference on Artificial Intelligence (AAAI), 2020: 6178-6185.Weiwei Liu: Copula Multi-label Learning. Advances in Neural Information Processing Systems (NIPS/NeurIPS), 2019: 6334-6343.Pinghua Xu, Wenbin Hu, Jia Wu,Weiwei Liu, Bo Du, Jian Yang: Social Trust Network Embedding. IEEE International Conference on Data Mining (ICDM), 2019: 678-687.Haobo Wang, Weiwei Liu, Yang Zhao, Chen Zhang, Tianlei Hu: Discriminative and Correlative Partial Multi-Label Learning. International Joint Conference on Artificial Intelligence (IJCAI), 2019: 3691-3697.Weiwei Liu, Xiaobo Shen: Sparse Extreme Multi-label Learning with Oracle Property. International Conference on Machine Learning (ICML), 2019: 4032-4041.Chen Chen, Haobo Wang, Weiwei Liu, Xingyuan Zhao, Tianlei Hu, Gang Chen: Two-Stage Label Embedding via Neural Factorization Machine for Multi-Label Classification. AAAI Conference on Artificial Intelligence (AAAI), 2019: 3304-3311.Xiaobo Shen, Weiwei Liu*, Yong Luo, Yew Soon Ong, Ivor W.Tsang: Deep Binary Prototype Multi-label Learning. International Joint Conference on Artificial Intelligence (IJCAI), 2018: 2675-2681.Xiaobo Shen, Shirui Pan, Weiwei Liu, Yew Soon Ong, Quan-Sen Sun: Discrete Network Embedding. International Joint Conference on Artificial Intelligence (IJCAI), 2018: 3549-3555.Jing Wang, Feng Tian, Weiwei Liu, Xiao Wang, Wenjie Zhang, Kenji Yamanishi: Ranking Preserving Nonnegative Matrix Factorization. International Joint Conference on Artificial Intelligence (IJCAI), 2018: 2776-2782.Weiwei Liu, Zhuanghua Liu, Ivor W.Tsang, Wenjie Zhang, Xuemin Lin: Doubly Approximate Nearest Neighbor Classification. AAAI Conference on Artificial Intelligence (AAAI), 2018: 3683-3690. Slides.Xiaobo Shen, Weiwei Liu, Ivor W.Tsang, Quan-Sen Sun, Yew Soon Ong: Compact Multi-label Learning. AAAI Conference on Artificial Intelligence (AAAI), 2018: 4066-4073.Weiwei Liu, Xiaobo Shen, Ivor W.Tsang: Sparse",
  "content_length": 21776,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:00"
}