{
  "name": "Weiyi Meng",
  "homepage": "http://www.cs.binghamton.edu/~meng",
  "status": "success",
  "content": "Weiyi Meng's Home page Weiyi Meng SUNY Distinguished Service Professor School of Computing Room P08, Engineering Building Phone: (607) 777-4311 Watson College of Engineering and Applied Science Binghamton University Binghamton, NY 13902 Email: meng@binghamton.edu Weiyi Meng is a SUNY Distinguished Service Professor. He was the director (previously chair) of the School of Computing (formerly known as Department of Computer Science) at Binghamton University from August 2016 to August 2025. He served as an Associate Dean for Research and Graduate Studies of the Thomas J. Watson College of Engineering and Applied Science from August 2014 to June 2016. He received his Ph.D. in computer science from University of Illinois at Chicago in 1992 and joined the School as a faculty member in the same year. His research interests include metasearch engines, Web database integration, Internet-based information retrieval, Web data quality, Web information extraction, sentiment analysis, and database management systems. He has done pioneering work in large-scale metasearch engines. He is the co-author of three books (Principles of Database Query Processing for Advanced Applications, Advanced Metasearch Engine Technology and Deep Web Query Interface Understanding and Integration). He has published over 150 papers and many of them in top conferences and journals in his research areas, including ACM SIGMOD, VLDB, IEEE ICDE, WWW, KDD, ACM SIGIR, ACM TODS, ACM TOIS, ACM TWEB, and IEEE TKDE. His publications have been cited more than 9,500 times according to Google Scholar and his H-Index is 48. He is recognized as a top computer scientist in the United States (Research.com). He has served as a member of the program/organizing committees of more than 100 international conferences, as a conference/program committee chair for some of them. He has also served on the editorial boards of several journals. Research Interests Metasearch Engines, Web Database Integration, Internet-based Information Retrieval, Information Trustworthiness Analysis, Web Data Quality, Web Information Extraction, Topic Sentiment Analysis, Database Management Systems Active Research Projects Social Media Data Analytics Efficient and Effective Metasearch Integrated Access to Web Databases Truthfulness Analysis of Web Information Sentiment Analysis and Topic Sentiment Change Analysis Top-N Query Processing Education Ph.D., Computer Science, 1992, University of Illinois at Chicago M.S., Computer Science, 1988, University of Illinois at Chicago B.S., Mathematics, 1982, Sichuan University, China Student Supervision Weiyi Meng has supervised 12 PhD dissertations and 71 Masters theses/projects. Books Clement Yu, Weiyi Meng. Principles of Database Query Processing for Advanced Applications. Morgan Kaufmann Publishers, 1998. Weiyi Meng, Clement Yu. Advanced Metasearch Engine Technology. Morgan & Claypool Publishers, December 2010. Click here to download this book. This book was translated into Chinese in 2017. Eduard Dragut, Weiyi Meng, Clement Yu. Deep Web Query Interface Understanding and Integration. Morgan & Claypool Publishers, 2012. Click here to download this book. Selected Recent Publications (click here for complete list) Yongquan Dong, Eduard Dragut, Weiyi Meng. Normalization of Duplicate Records from Multiple Sources. IEEE Transactions on Knowledge and Data Engineering, 31(4), pp.769-782, April 2019. Abdullah Aljebreen, Eduard Dragut, and Weiyi Meng. Segmentation of Tweets with URLs and its Applications to Sentiment Analysis. Proc. of the 35th AAAI Conference on Artificial Intelligence (AAAI-21), pp.12480-12488, February 2021. Satadisha Saha Bhowmick, Eduard Dragut, and Weiyi Meng. Boosting Entity Mention Detection for Targetted Twitter Streams with Global Contextual Embedding. Proc. of the 38th IEEE International Conference on Data Engineering (ICDE), pp.1085-1097, May 2022. Zhijia Chen, Weiyi Meng, and Eduard Dragut. Web Record Extraction with Invariants, Proc. of the VLDB Endowment, 16(4):959-972, December 2022. Satadisha Saha Bhowmick, Eduard Dragut, and Weiyi Meng. TwiCS: Lightweight Entity Mention Detection in Targeted Twitter Streams. IEEE Transcations on Knowledge and Data Engineering (TKDE), 35(1):1043-1057, January 2023. Satadisha Saha Bhowmick, Eduard Dragut, and Weiyi Meng. Globally Aware Contextual Embeddings for Named Entity Recognition in Social Media Streams. Proc. of the 39th IEEE International Conference on Data Engineering (ICDE), pp.1544-1557, April 2023. Ulugbek Ergashev, Eduard Dragut, and Weiyi Meng. Learning to Rank Resources with GNN. Proc. of 2023 ACM Web Conference (WWW), pp.3247-3256, April 2023. Abdullah Aljebreen, Weiyi Meng, and Eduard Dragut. Analysis and Detection of \"Pink Slime\" Websites in Social Media Proc. of 2024 ACM Web Conference (WWW), pp.2572-2581, May 2024. Ulugbek Ergashev, Geon Lee, Kijung Shin, Eduard Dragut, and Weiyi Meng. Resource2Box: Learning to Rank Resources in Distributed Search Using Box Embedding. Proc. of 2024 IEEE International Conference on Data Mining (ICDM), pp.101-110, Abu Dhabi, December 2024. Zhijia Chen, Weiyi Meng, and Eduard Dragut. ComCrawler: General Crawling Solution for Article Comments. Proc. of the 28th International Conference on Extending Database Technology (EDBT), pp.1023-1031, Barcelona, March 2025. My Google Scholar Citation Result Some Interesting WWW Sites Last change: August 10, 2025 / meng@binghamton.edu",
  "content_length": 5436,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:02"
}