{
  "name": "Weiyan Shi",
  "homepage": "https://wyshi.github.io",
  "status": "success",
  "content": "Weiyan Shi Weiyan Shi we.shi@northeastern.edu Google Scholar & Twitter ECE & Khoury Computer Science Northeastern University Home CHATS Lab Publications Teaching I am an assistant professor at Northeastern University, jointly appointed by ECE and Khoury Computer Science. I am broadly interested in NLP, Human-AI Interaction, and AI safety. Specifically, I investigate AI-driven persuasion, aiming to harness its societal benefits while mitigating its potential harm. Research Projects How AI Persuades Humans: PersuasionForGood, Cicero in Diplomacy, Anti-scam Chatbot, Movie Recommendation How to Persuade AI for Safety: Persuasive Jailbreaker, LLMs Encodes Harm and Refusal Separately AI's Societal Impact: Donation Persuasion, CultureBank Conversational AI: Learning through Interaction, User Sentiment Adaptation Privacy in AI: Selective Differential Privacy, Privacy Awareness in AI Agents News [2025.11] Honored to be recognized as an AI2050 Early Career Fellow! [2025.10] New paper on \"Verbalized Sampling: How to Mitigate Mode Collapse and Unlock LLM Diversity\" released! [2025.10] Another grant to build AI agents for coastal risk assessment awarded. Thanks, Massachusetts AI Hub! [2025.10] Two grants to advance AI safety supported by Open Philanthropy. Thanks so much! [2025.09] Paper on \"LLMs Encode Harmfulness and Refusal Separately\" accepted to NeurIPS. See you in San Diego! [2025.08] We are organizing the 1st Workshop on Multi-Turn Interactions in Large Language Models at NeurIPS. Thanks to our sponsor, Meta and Orby AI, we offer free student workshop registration. About Me Assistant Professor, ECE & CS, Northeastern University, Present Postdoc, Stanford NLP, Stanford University, 2024 Ph.D. in Computer Science, Columbia University, 2023 Data Scientist, [24]7.ai, 2018 M.A. in Statistics, University of California, Berkeley, 2016 B.S. in Mathematics, Remin University of China, 2015 Awards/Honors AI2050 Early Career Fellow MIT Tech Review 35 Innovators under 35, 2024 Best Social Impact Paper, ACL 2024 Outstanding Paper, ACL 2024 Rising Stars in EECS, 2023 Rising Stars in Machine Learning, 2022 Best Paper Nomination, ACL 2019 Dean's Distinguished PhD Fellowship Department Citation (top 1), UC Berkeley, 2016 Speaker at Department Commencement (top 1), UC Berkeley, 2016 Recent Service Area Chair, NAACL 2025 Area Chair, EMNLP 2024 Area Chair, ACL 2024 Area Chair, NAACL 2024 Area Chair, EMNLP 2023 Area Chair, 17th Women in Machine Learning Workshop (WiML 2022) Workshop Organizer: Workshop on Social Influence in Conversations, ACL 2023 & EMNLP 2024 Workshop Organizer: Workshop for Conversational AI, ACL 2022",
  "content_length": 2639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:00"
}