{
  "name": "Wen-Chih Peng",
  "homepage": "https://sites.google.com/site/wcpeng",
  "status": "success",
  "content": "Wen-Chih PengSearch this siteEmbedded FilesSkip to main contentSkip to navigationWen-Chih Peng (彭文志)ProfessorEC542 Department of Computer ScienceNational Chiao Tung University1001 Ta Hsueh Road Hsinchu 300 TaiwanTel:886-3-5712121 ext.54807E-mail:wcpeng@cs.nctu.edu.twBiosketchWen-Chih Peng is currently a professor in the Department of Computer Science at Ying Ming Chiao Tung University, Taiwan. He has held various leadership positions within his university. From August 2019 to July 2022, Dr. Peng served as the Chair of the Department of Computer Science and simultaneously as the Associate Dean of the College of Computer Science at National Chiao Tung University, Taiwan. Following this, from February 2021 to July 2022, Dr. Peng took on the role of Vice Director of the Digital Medicine Center at National Ying Ming Chiao Tung University.During the period from August 2016 to July 2019, he served as the Director of the Institute of Multimedia Engineering at National Chiao Tung University. Dr. Peng's research interests span a diverse range, including data mining, machine learning, big data analysis, databases, and sports data analysis. He has contributed significantly to academia, with over 170 research papers published in reputable journals and conferences.Dr. Peng's impactful work has earned him several accolades, including the Best Paper Award at AAAI the 3rd International Workshop on Modeling Uncertainty in the Financial World, the Best Paper Award at the ACM Workshop on Location-Based Social Network in 2009, and the Best Student Paper Award at the IEEE International Conference on Mobile Data Management in 2011. He has also actively participated as a chair and program committee member in prestigious international conferences related to data mining and artificial intelligence, such as KDD, ICDM, PAKDD, ICDE, CIKM, AAAI, and IJCAI.Recognized for his contributions, Dr. Peng has received numerous awards in Taiwan, including the Y. Z. Hsu Scientific Paper Award in the category of Artificial Intelligence, the Future Tech Breakthrough Award, Outstanding Professor of Electrical Engineering (Chinese Institute of Electrical Engineering) in 2020, the K. T. Li Breakthrough Award from the Institute of Information & Computing Machinery in 2019, and the Ta-You Wu Memorial Award in 2012. He is ACM member and IEEE Senior Member. Professional Experiences 2014/8~Now, Professor of Dept. of Computer Science, National Ying Ming Chiao Tung University, Taiwan2023/8~2024/1, Researcher at Mechanical and Mechatronics Systems Research Laboratory of Industrial Technology Research Institute, Taiwan (工研院機械與機電系統研究所)2021/2~2022/7, Chair of Dept. of Computer Science, National Ying Ming Chiao Tung University, Taiwan2021/2~2022/7, Vice director of Digital Medicine Center, National Ying Ming Chiao Tung University, Taiwan  2021/8~2024/3, Director of E-SUN-NCTU Fintech and AI center, Taiwan 2020/8-2022/7, Senior Review Committee Members of the Ministry of Science and Technology in the field of Artificial Intelligence, Taiwan (科技部智慧計算學門複審委員)2019/8~2021/1, Chair of Dept. of Computer Science, National Chiao Tung University, Taiwan2019/8~2021/1, Associate Dean, College of Computer Science, National Chiao Tung University, Taiwan2018/1~2018/2, Visiting professor at LARC, Singapore Management University, Singapore2016/8-2018/7, Senior Review Committee Members of the Ministry of Science and Technology in the field of Artificial Intelligence, Taiwan (科技部智慧計算學門複審委員)2016/8~2019/7, Director of Institute of Multimedia Engineering, National Chiao Tung University, Taiwan2014/8~now, Board Members of Taiwanese Association for Artificial Intelligence, Taiwan (中華民國人工智慧學會 理事)2014/7~2015/7, Visiting professor,  University of Queensland, school of Information Technology and Electrical Engineering, Australia2014/6~ 2016/7, Technical consult, Cloud Computing Association in Taiwan  2009/8~2013/8, Associate professor, Dept. of Computer Science, National Chiao Tung University, Taiwan 2009/7~2009/11, Visiting professor, University of Illinois at Urban-Champion, Dept. of Computer Science, USA 2010/1~2011/12 , Technical consult, Industrial Technology Research Institute, Taiwan2003/8~2009/8, Assistant professor, Dept. of Computer Science, National Chiao Tung University, Taiwan EducationPh.D., Department of Electrical Engineering, National Taiwan University, 1997/9-2001/9.M.S., Department of Computer Science and Information Engineering, National Chiao Tung University, 1995/9-1997/6.B.S., Department of Computer Science and Information Engineering, National Chiao Tung University, 1991/9-1995/6.Research InterestsData mining, big data analytics, sport data analysis, deep learning and databasesLeadership roles at NYCU/NCTU CS Wen-Chih served as the chairman of NYCU/NCTU CS dept. from 2019/8 to 2022/7 and made some contributions: To consolidate the centripetal force among graduated alumni and accomplish the fundraising for celebrating 50th anniversity of NCTU CS and the 40th anniversity of NCTU CIS at National Chiao Tung University, and to establish the Beyond Computing meseum.        News https://ctee.com.tw/industrynews/cooperation/624161.html Podcast interview (https://reurl.cc/mDqrEG)News video clip (https://www.youtube.com/watch?v=TEEJPesx_UA) To establish a fan page for the NCTU Department of Computer Science, enhance the visibility of the department through the fan page, and create a platform for graduated alumni, current students, and faculty members (https://www.facebook.com/csnctu). In recent years,  NYCU/CS has been recruiting excellent teachers and students. From August 2019 to July 2022, a total of 7 teachers were recruited. We aim to attract outstanding undergraduate students and strive to make NCTU CS  one of the top two choices in entrance examination (in CS field). My videos for recruiting undergraduate students (https://youtu.be/Ie_q3qR_rO0 and https://youtu.be/d7hNVv0u0S0) Leading the Department of Computer Science through Covid-19, including digital transformation, conducting departmental administrative meetings and committee meetings online, transitioning student affairs to online platforms, and implementing epidemic prevention tasks. Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 6267,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:03"
}