{
  "name": "Wen-Qi Fan",
  "homepage": "https://wenqifan03.github.io",
  "status": "success",
  "content": "Wenqi Fan Wenqi Fan Home Research Members Publications Tutorials Workshops Openings Professional Activities Services Experience Teaching Others Links Google Scholar DBLP ORCID OpenReview LinkedIn Semantic DSE Lab@MSU Wenqi Fan Assistant Professor Department of Computing (COMP), Faculty of Computer and Mathematical Sciences (FCMS) Department of Management and Marketing (MM), Business School The Hong Kong Polytechnic University (PolyU) Email: wenqifan03(at)gmail(dot)com, wenqi.fan(at)polyu(dot)edu(dot)hk Office: PQ817, Mong Man Wai Building, Hung Hom, Kowloon, Hong Kong SAR. Short Bio Prof. Wenqi Fan is currently an Assistant Professor of the Department of Computing (COMP) & Department of Management and Marketing (MM), The Hong Kong Polytechnic University (PolyU). Before that, he was a Research Assistant Professor and a Postdoctoral Fellow at PolyU (2020-2023). He received his Ph.D. degree in computer science from the City University of Hong Kong (2017-2020), under the supervision of Prof. Qing LI and Prof. Jianping WANG. From 2018 to 2021, he was a research scholar of Data Science and Engineering (DSE) Lab at Michigan State University (MSU), under the supervision of Prof. Jiliang Tang. He is recognized as the AI 2000 Most Influential Scholar Honorable Mention (2022, 2023, 2024, 2025) , and one of the World’s Top 2% Scientists by Stanford University (2023, 2024, 2025). His research has been supported by multiple government research fund agencies, including Hong Kong Research Grants Council (RGC-GRF), National Natural Science Foundation of China (NSFC), Hong Kong Innovation and Technology Commission (ITF), etc. He has published his research in highly ranked journals and top conference proceedings [Google Scholar]. >>> Welcome to contact me if you are interested in interdisciplinary research (collaborating with our group) using Data Mining/Machine Learning/Artificial Intelligence! Research Interests [Google Scholar] Data Mining, Machine Learning, and Artificial Intelligence, with a particular focus on: Recommender Systems (RecSys) and Management Information Systems (MIS) Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG) Agentic AI Trustworthy AI: Safety (Adversarial Attacks & Robustness); Fairness; Explainability, etc. Graph Machine Learning: Graph Neural Networks; Graph Foundation Models AI/ML/DM + X: Business; Science; Healthcare. >>>Openings: Our research group are actively recruiting self-motivated Postdoc, Ph.D. students, MPhil/Msc, and Research Assistants, etc. Visiting scholars, interns, and self-funded students are also welcome. Send me an email if you are interested (Year-round Recruitment). [Please click here for position details.] News 2025 11/2025: Gratefully receive a donation as the PC to support our research on AI4Healthcare. Multiple PhD/Postdoc/RA positions are available (Year-round Recruitment). [Please click here for position details.] 10/2025: Two papers get accepted by ACM WSDM 2026. Congratulations to Chengyi and Jiani. 10/2025: One paper (Damba-ST: Domain-Adaptive Mamba for Efficient Urban Spatio-Temporal Prediction) got accepted by IEEE ICDE 2026. Congratulations to AnRui, Yifeng, Ziran. 10/2025: I was honored to receive the Early Career Researcher (Individual) Award in Research and Scholarly Activities for Outstanding Achievement 2025 (Faculty Awards). A heartfelt thank you to my supervisors, students, colleagues, collaborators, and friends. 10/2025: One paper (SSD4Rec: A Structured State Space Duality Model for Efficient Sequential Recommendation) got accepted by ACM TOIS. Congratulations to Yifeng, Haohao, iangbo. 09/2025: I am ranked as the World’s Top 2% most-cited scientists 2025 by Stanford University. 08/2025: One paper got accepted by EMNLP 2025 (Finding). Congratulations to Yunqing. 08/2025: Two papers got accepted by IEEE TKDE. Congratulations to Haohao and Chengyi. 05/2025: Three ACL papers (two Mains and one Finding) have been accepted. 05/2025: Our survey paper&tutorial (A Survey of WebAgents: Towards Next-Generation AI Agents for Web Automation with Large Foundation Models) got accepted by KDD 2025. Congratulations to Liangbo Ning, Ziran Liang, Zhuohang Jiang, Haohao Qu, and Yujuan Ding. 04/2025: Check out our papers “Generative Recommendation with Continuous-Token Diffusion”, “Exploring Backdoor Attack and Defense for LLM-empowered Recommendations”, “Investigating and Mitigating Stereotype-aware Unfairness in LLM-based Recommendations”, “Retrieval-Augmented Purifier for Robust LLM-Empowered Recommendation”. 03/2024: Our survey papers Graph Machine Learning in the Era of Large Language Models (LLMs) has been accepted by ACM TIST. Congratulations to Shijie, Jiani, and our collaborators. 03/2025: Check out our paper on “Towards Next-Generation Recommender Systems: A Benchmark for Personalized Recommendation Assistant with LLMs”, “Towards Graph Foundation Models: A Transferability Perspective”, “Exploring Graph Tasks with Pure LLMs: A Comprehensive Benchmark and Investigation”. 01/2025: One paper (How Do Large Language Models Understand Graph Patterns? A Benchmark for Graph Pattern Comprehension) got accepted by ICLR 2025. Congratulations to Xinnan and Haohao. 01/2025: Check out our survey on “Computational Protein Science in the Era of Large Language Models (LLMs)”. 01/2025: Our new preprint “Knowledge Graph Retrieval-Augmented Generation for LLM-based Recommendation” is online. 2024 12/2024: Our tutorial on “Towards Retrieval-Augmented Large Language Models: Data Management and System Design” is accepted by ICDE 2025. Congratulations to Pengjing, Yujuan, Shijie, and Liangbo. More 10/2024: Jiahao Zhang has successfully passed the MPhil Oral Examination and will be pursuing his PhD at The Pennsylvania State University (PSU). Congratulations! 10/2024: Our new preprint “How Do Large Language Models Understand Graph Patterns? A Benchmark for Graph Pattern Comprehension” is online. 09/2024: One paper (Multi-agent Attacks for Black-box Social Recommendations) got accepted by ACM TOIS 2024. Congratulations to Shijie. 09/2024: Our new preprint “SSD4Rec: A Structured State Space Duality Model for Efficient Sequential Recommendation” is online. 08/2024: Check out our survey on A Survey of Mamba. 06/2024: Gratefully receive a grant (RGC-GRF) as the PI to support our research on Large Language Models and Recommender Systems. Multiple PhD/Postdoc/RA positions are available (Year-round Recruitment). [Please click here for position details.] 06/2024: Our new preprint “TokenRec: Learning to Tokenize ID for LLM-based Generative Recommendation” is online. 05/2024: Our survey paper&tutorial (A Survey on RAG Meets LLMs: Towards Retrieval-Augmented Large Language Models) got accepted by KDD 2024. Congratulations to Yujuan, Liangbo and Shijie. [Website] 05/2024: One paper got accepted by KDD 2024. Congratulations to Liangbo and Shijie. 05/2024: Gratefully receive a grant (Intra-Faculty Interdisciplinary Project) as the PC/Co-PI to support our research. 05/2024: Check out our survey on A Survey on RAG Meets LLMs: Towards Retrieval-Augmented Large Language Models. 04/2024: Check out our survey on Graph Machine Learning in the Era of Large Language Models (LLMs). 04/2024: Our survey paper (“Recommender Systems in the Era of Large Language Models (LLMs)”) got accepted by IEEE TKDE 2024. 04/2024: Our tutorial on “Recommender Systems in the Era of Large Language Models (LLMs)” is accepted by IJCAI 2024. Congratulations to Yujuan, Shijie, and Liangbo. More 03/2024: I was recognized as the “2024 AI 2000 Most Influential Scholar Honorable Mention” in the field of IR and Recommendation by the AMiner. 03/2024: One demo paper (“FashionReGen: LLM-Empowered Fashion Report Generation”) and one short paper (“Interpretation-Empowered Neural Cleanse for Backdoor Attacks”) got accepted by ACM TheWeb Conference (WWW) 2024. Congratulations to Yujuan and Liangbo. 01/2024: Two papers (“Linear-Time Graph Neural Networks for Scalable Recommendations” and “Fast Graph Condensation with Structure-based Neural Tangent Kernel”) got accepted by ACM TheWeb Conference (WWW) 2024. Congratulations to Jiahao ZHANG, Lin WANG, and Jiatong LI. 01/2024: One paper (“Revisiting Link Prediction: A data perspective”) got accepted by ICLR 2024. 2023 12/2023: Two students received PolyU Presidential PhD Fellowship Scheme (PPPFS) to support their PhD study. 11/2023: Our workshop on “Large Language Models (LLMs) for Graph Learning” is accepted by The Web Conference 2024 (WWW 2024). More 09/2023: Our tutorial on “Recommender Systems in the Era of Large Language Models (LLMs)” is accepted by ICDM 2023. Congratulations to Jiatong, Zihuai, and Yunqing. More 07/2023: Our new preprint “Certified Robustness for Large Language Models with Self-Denoising” is online. 07/2023: Our new preprint “Exploring the Potential of Large Language Models (LLMs) in Learning on Graphs” is online. 07/2023: Our new preprint “Recommender Systems in the Era of Large Language Models (LLMs)” is online. 06/2023: Gratefully receive a grant (RGC-GRF) as the Co-I to support our research. 06/2023: Our new preprint “Empowering Molecule Discovery for Molecule-Caption Translation with Large Language Models: A ChatGPT Perspective” is online. 05/2023: Our tutorial on “Trustworthy Recommender Systems: Foundations and Frontiers” is accepted by KDD 2023 [Website]. 04/2023: Our tutorial on “Trustworthy Recommender Systems: Foundations and Frontiers” is accepted by IJCAI 2023 [Website]. 04/2023: Our survey paper (“Generative Diffusion Models on Graphs: Methods and Applications”) got accepted by IJCAI 2023. Congratulations to Chengyi, Yunqing, and Jiatong for their first paper with PolyU. 04/2023: Our paper (“Adversarial Attacks for Black-box Recommender Systems via Copying Transferable Cross-domain User Profiles”) got accepted by IEEE TKDE 2023. 04/2023: One paper got accepted by SIGIR 2023. 02/2023: Our new preprint “Generative Diffusion Models on Graphs: Methods and Ap",
  "content_length": 15139,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:04"
}