{
  "name": "Wenbing Zhao 0001",
  "homepage": "https://academic.csuohio.edu/zhao_w",
  "status": "success",
  "content": "Zhao, Wenbing – Just another Cleveland State University Academic Multisite Sites site Skip to content Dr. Wenbing Zhao Professor of Electrical and Computer EngineeringDepartment of Electrical and Computer EngineeringCollege of Engineering, Cleveland State University Ph.D., University of California, Santa Barbara (under the supervision of Professors Louise Moser and Michael Melliar-Smith), 2002 M.S. (in Electrical and Computer Engineering), University of California, Santa Barbara, 1998 M.S. (in Physics), Peking University (also known as Beijing University), China,1993 (Winner of the National Yeh Chi-Sun Thesis Award on Experimental Physics) B.S. (in Physics), Peking University (also known as Beijing University), China, 1990 Brief Bio Vita Highlight December 2022: I received a grant from the US Department of Education as a co-PI with a group of colleagues to develop a new program on data-driven modeling and simulation. August 2022: I received an NSF MRI grant as a co-PI with a few colleagues for Smart City Research. Jan 2022: I gave a 4.5 hours Tutorial for IEEE CCNC on Blockchain. May 2021: My second research monograph was published. The book lay the foundation to truly understand the blockchain technology. The most important innovation of the blockchain technology is not the data structure, but an emergent probabilistic peer-to-peer distributed consensus! One simply cannot appreciate this transformative innovation without deep knowledge of distributed algorithms and fault tolerance. May 3, 2021: I gave a Tutorial on Proof of Stake in Public Blockchains at the IEEE International Conference on Blockchain and Cryptocurrency. April 6, 2021: I was selected to receive the 2020 IEEE Access Outstanding Associate Editor Award. The criteria for becoming an Outstanding Associate Editor is to be among the top 3% of IEEE Access Associate Editors based on the number of articles handled throughout the year in a thorough and rigorous manner, as well as being active and in good standing with the IEEE and IEEE Access. February 1, 2020: I’m member of a team that received a grant to fight the Opioid epidemic from the Ohio Department of Higher Education. My teammates are Ilya from Psychology,  Sandra from Math, Cathleen from Social Works. (News release). September 1, 2019: I received a DoE grant on using blockchain technology to secure sensor systems in fossil fuel power plants in collaboration with Florida International University. (News release). August 27, 2019: I delivered a keynote talk in International Conference on Vision, Image and Signal Processing at Vancouver, Canada August 22, 2019: I delivered a keynote talk in IEEE SmartWorld Congress about my work on smart health at Leicester, UK July 28 – August 2, 2019: I was very fortunate to have to opportunity to attend the 2019 NIH mHealth Training Institute at UCLA. I learned so much! July 14, 2019: I delivered a keynote talk on blockchain in IEEE International Conference on Knowledge Innovation and Invention, Seoul, South Korea May 3, 2019: Congratulations to my senior design team: Parth, Eric, Keisi, and Isaiah for winning the second place of the 2019 senior design competition! April 2019: My team has been accepted to the 2019 Ohio i-Corps program. We will be testing if our idea on technology enhanced human patient simulation will have a market. March 2019: My US patent has been approved by the USPTO! Link to my patent is here. November 1-2, 2018: Thanks for the invitation from Tony Giroti, Founder & Chairman of Energy Blockchain Consortium, and the support from Provost Zhu, I attended the Global Power and Energy Blockchain Conference. I gained first-hand experiences on how the blockchain technology can be used in this sector. October 6-11, 2018: I traveled to Miyazaki, Japan to attend the IEEE SMC Annual Conference. I presented a tutorial on healthcare prediction and intervention, and two research papers. August 10, 2018: Congratulations on Deepa and Elham for successfully defending their Masters’ thesis and completing their study at CSU! June 22, 2018: My tutorial proposal and two papers submitted to IEEE SMC 2018 have all been accepted! This will be the second year in the row for me to give a tutorial at this flagship conference under the IEEE SMC Society. June 21, 2018: Congratulations on Akshat Hans for successfully defending his Master’s thesis and completing his study at CSU! May 15, 2018: I was very honored to be appointed as the sole associate editor for the journal Computers with MDPI: http://www.mdpi.com/journal/computers/editors May 12, 2018: Congratulations on Roanna, Jonathan, and Sachin for successfully defending their thesis/dissertation and completing their study at CSU! May 3-4, 2018: Drove to IEEE EIT 2018 to present four papers. April 20, 2018: Went to Zhangjiagang, China, to make a pitch for the technology I developed, hoping to attract investment. https://mp.weixin.qq.com/s/YQw9QV36zBh-Xe5vZYlLbQ April 14, 2018: I gave a keynote talk on reducing lower back injuries at IEEE ICASI 2018, Chiba, Japan. This is my first trip to Japan. Very much impressed by the country! April 8, 2018: The biggest newspaper in Cleveland, Ohio, the Plain Dealer, reported my work on helping state tested nursing aids (STNAs) to reduce lower back injuries using technology. January 18, 2018: I gave a talk at the ASSE chapter meeting on PACTS. December 18-24, 2017: I visited 北京化工大 学 (Beijing University of Chemical Technology). The host is Professor and Department Chair, Juan Chen. I had a wonderful trip there. The weather was also fantastic. December 6, 2017: I was appointed to the Editorial Board of MDPI Computers. November 23, 2017: I was invited to give a keynote speech at the 2018 International Conference on Computing and Big Data, College of Charleston, South Carolina, USA, September 8-10, 2018. November 21, 2017: Two more FRD-IoT projects where I am a co-PI were funded, one with a team in CLASS, and the other with Dr. Xiongyi Liu in College of Education. Out of the seven FRD-IoT grants awarded, I’m involved with three. November 12, 2017: I have been invited to give a keynote speech at the 4th International Conference on Applied System Innovation 2018 (ICASI 2018), April 13-17, 2018, Chiba (千葉) , Tokyo, Japan. October, 2017: I am serving as the lead Guest Editor for a special issue on Healthcare System Innovation with MDPI Applied System Innovation. The special issue is due March 31, 2018. October, 2017: The 2017 ISCSIC that I chaired was a great success. All speakers were very serious. The sessions were quite intense. The attitude and the attendance rate exceeded some of the flagship conferences I attended. Furthermore, Budapest is such a beautiful city! I received a 2017 CSU FRD-IOT grant to carry out pilot study on using technology to study human behaviors and emotions. I received the CSU Golden Apple Award in 2017. Thank you Ravi Duttaluru for nominating me! I won the 2017 CSU Distinguished Faculty Award in Teaching. I gave a tutorial on Human Activity and Emotion Tracking with Microsoft Kinect and Wearable Devices for the 2017 IEEE Cyber Science and Technology Congress (CyberSciTech 2017). I also organized a special session on Cyber-Enabled Smart Environment and Healthcare for the conference. I helped secure sponsorship for the conference from MDPI. I will also be leading the effort in creating a special issue for the conference with MDPI Applied Sciences. I organized a special session with a group of friends for IEEE SMC 2017, held in Banff, Canada, October 5-8, 2017. I have four papers accepted by IEEE SMC 2017! Furthermore, I gave an invited tutorial on Building Human-Centered Systems with Depth Cameras and Wearable Sensors on October 5, 2017. I am serving as the lead editor for a special section for IEEE Access on Human-Centered Smart Systems and Technologies. The due date is December 31, 2017. IEEE Access has an impact factor 3.224 in 2017. I am serving as the lead Guest Editor for a Special Collection on Intelligent Sensing and Decision Making in Smart Technologies for International Journal of Distributed Sensor Networks. The special issue is due February 1, 2018. The journal is indexed by JCR with an impact factor of 1.239. I received an i-Corps@Ohio grant for training and conducting a marketability study this summer (2017) for the compliance tracking technology called PACTS that I developed. We just completed the training on July 12, 2017. I served as the general chair for the 2017 International Conference on Vision, Image and Signal Processing, held in Osaka, Japan, 22-24 September, 2017, and the 2017 International Symposium on Computer Science and Intelligence Controls, held at the beautiful city of Budapest, Hungary, 20-22 October, 2017. The proceedings of both conferences will be published by IEEE CPS. We have arranged at least one journal special issue with each conference (ICVISP for MDPI Journal of Imaging, and ISCSIC for MDPI Computers). I served as a conference chair for the 2017 International Conference on Digital Technology in Education (ICDTE 2017), and I will also be delivering a keynote speak. The conference will be help in Taipei, Taiwan, August 6-8, 2017. I am serving as the lead Guest Editor for a special issue on Programming Foundations for Scientific Big Data Analytics with Hindawi journal Scientific Programming. The due date is submission is 25 August 2017. I have been appointed to the Associate Editor position for IEEE Access as of November 2016. I am serving as the lead guest editor for a special issue on smart healthcare with MDPI’s Applied Sciences journal (JCR impact factor = 1.726). My paper on a novel technology that can be used to promote healthier workplaces has been accepted by IEEE Transactions on Human Machine Systems: A Human-Centered Activity Tracking System: Toward a Healthier Workplace I served as a Conference Chair for the 2016 4th International Conference on Behaviours, Education and Psychology (ICBEP 2016), which was held i",
  "content_length": 14560,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:07"
}