{
  "name": "Wenbin Zhang 0002",
  "homepage": "https://users.cs.fiu.edu/~wbzhang",
  "status": "success",
  "content": "Wenbin Zhang | Florida International University < Wenbin Zhang Assistant Professor Knight Foundation School of Computing and Information Sciences Florida International University 11200 SW 8th Street, INV 449Miami, Florida, USA 33199 +1 305-348-4249 11200 SW 8th Street, INV 449Miami, Florida, USA 33199 +1 305-348-4249 11200 SW 8th Street, INV 449Miami, Florida, USA 33199 +1 305-348-4249 11200 SW 8th Street, INV 449Miami, Florida, USA 33199 +1 305-348-4249 Hello, my name is Wenbin Zhang (pronounced: Wuhn-bin Jahng). I am a Hakka born Assistant Professor at Florida International University, and an Associate Member at the Te Ipu o te Mahara Artificial Intelligence Institute. The main focus of my research is on designing machine learning algorithms that not only provide theoretical performance guarantees but also behave in ways aligned with human values and societal goals. I am particularly interested in combining the aspect of gaining machine learning knowledge with an orientation towards making machine learning usable and useful for high-stakes decision-making, such as healthcare, digital forensics, finance, climate, policy, and law. To this end, I have been exploring complex real-world data (e.g., EHR, MODIS, supply chain data), under multifarious contexts (e.g., censorship, imbalance, distribution shift), subject to different metrics (e.g., fairness, regime centroids, c-index), through joyful collaboration and team work with computational scientists and domain experts. Supporting and recognizing my work, I was invited to deliver a New Faculty Highlights talk at AAAI’24, received the NSF CRII Award, was named to the Stanford/Elsevier Top 2% Scientists List, and earned distinctions including the Leibniz Fellowship, Distinguished Area Chair Award at ECML PKDD'25, Outstanding Senior Program Committee Member Award at ECAI'25, and Distinguished Senior Program Committee Award for IJCAI'23, along with best paper awards/candidates at ECML PKDD’25, FAccT’23, ICDM’23, DAMI, and ICDM’21. Incidentally, my Erdős number is 3 (Me -> Alan Evans -> David Avis -> Erdős) as a result of the enjoyed interdisciplinary collaboration. In line with this collaborative spirit, I also contribute to the research community by serving on conference organizing committees and journal editorial boards across computer science and interdisciplinary venues—including roles such as Sponsorship Chair for AAAI'26, Travel Award Chair for AIES'25, Associate Editor for ACM Computing Surveys, and Action Editor for Data Mining and Knowledge Discovery. I southwarded all the way to Miami from the Upper Peninsula where I held the same role at Michigan Technological University. Prior to that, I was a Postdoctoral Researcher at Carnegie Mellon University after receiving a Ph.D. degree from the University of Maryland, Baltimore County. I also spent time at multiple global research centers and institutions, including L3S Research Center, University of Milano-Bicocca, King Abdullah University of Science and Technology, Télécom Paris, George Mason University and National Institutes of Health. I had four Stendhal syndrome years in Beijing and Tianjin before starting my study abroad in Newfoundland, where it snowed in June (not anymore due to global warming). Aside from my obvious interest in research, I enjoy watching and playing all kinds of sports especially soccer. I had the experience of my life at Kaliningrad Stadium cheering the 2018 World Cup. I ran my very first Marathon at Virginia Beach credit to November Project. Finally, I believe Manchester is red as I thought David Beckham was cool when I was young. Him growing up, me supporting United till date. Last but not least, I appreciate you taking the time to surf the internet this far to check up on and to read a bit of my story. Presuming I am not that boring, I encourage you to say hello before you leave for our interesting conversations to come. News Highlights Current If you’re interested in reviewing for leading AI/ML and interdisciplinary conferences and journals (e.g., healthcare), I’m always seeking reviewers year-round — please reach out. • If you’re interested in reviewing for leading AI/ML and interdisciplinary conferences and journals (e.g., healthcare), I’m always seeking reviewers year-round — please reach out. Nov 2025 Humbled to receive the Distinguished Area Chair Award at ECML PKDD 2025. • Humbled to receive the Distinguished Area Chair Award at ECML PKDD 2025. Oct 2025 Humbled to receive the Outstanding Senior Program Committee Member Award at ECAI 2025. • Humbled to receive the Outstanding Senior Program Committee Member Award at ECAI 2025. Sep 2025 Named to the Stanford/Elsevier Top 2% Scientists List. • Named to the Stanford/Elsevier Top 2% Scientists List. Honored to be appointed to a four-year term on the ECML PKDD Steering Committee. • Honored to be appointed to a four-year term on the ECML PKDD Steering Committee. Aug 2025 I am an action editor for Machine Learning and am awaiting your submissions. • I am an action editor for Machine Learning and am awaiting your submissions. Panelist at the Responsible AI Day at KDD 2025, discussing the intersection of AI, ethics, and society. • Panelist at the Responsible AI Day at KDD 2025, discussing the intersection of AI, ethics, and society. Appointed to the ACCESS Researcher Advisory Committee to provide guidance on advancing the national cyberinfrastructure ecosystem and researcher support. • Appointed to the ACCESS Researcher Advisory Committee to provide guidance on advancing the national cyberinfrastructure ecosystem and researcher support. Jul 2025 Zichong and Zhipeng won the Best Student Paper Award at ECML PKDD 2025. • Zichong and Zhipeng won the Best Student Paper Award at ECML PKDD 2025. Area Chair/Senior Program Committee at IJCAI, AISTATS, ICDM, ECML PKDD, ECAI, AAMAS, ICPR, CHI, AAAI, and TheWebConf. • Area Chair/Senior Program Committee at IJCAI, AISTATS, ICDM, ECML PKDD, ECAI, AAMAS, ICPR, CHI, AAAI, and TheWebConf. May 2025 We launch the competition on fairness in AI face detection and look forward to your participation in advancing responsible AI research. • We launch the competition on fairness in AI face detection and look forward to your participation in advancing responsible AI research. Apr 2025 I will be serving as the Sponsorship Chair for AAAI 2026—see you in Singapore! • I will be serving as the Sponsorship Chair for AAAI 2026—see you in Singapore! I am an associate editor for ACM Computing Surveys and am awaiting your submission. • I am an associate editor for ACM Computing Surveys and am awaiting your submission. Jan 2025 I am an action editor for Data Mining and Knowledge Discovery and am awaiting your submissions. • I am an action editor for Data Mining and Knowledge Discovery and am awaiting your submissions. Nov 2024 I am the Program Co-Chair for IEEE IDS and look forward to receiving your submission. • I am the Program Co-Chair for IEEE IDS and look forward to receiving your submission. Co-chairing a Special Session at IJCNN'25 and looking forward to your submission. • Co-chairing a Special Session at IJCNN'25 and looking forward to your submission. Oct 2024 Founding student member Zichong has passed his proposal defense, successfully outsmarting his committee—at least for now! • Founding student member Zichong has passed his proposal defense, successfully outsmarting his committee—at least for now! Sep 2024 Co-PI on an NIH R01 project focusing on social drivers of health. • Co-PI on an NIH R01 project focusing on social drivers of health. I am an action editor for Neural Networks and am awaiting your submissions. • I am an action editor for Neural Networks and am awaiting your submissions. Aug 2024 Founding Member of the TRUST-IoT Working Group, dedicated to making AI in communications accessible to a broad audience. • Founding Member of the TRUST-IoT Working Group, dedicated to making AI in communications accessible to a broad audience. Jul 2024 Our work on fairness in LLMs is featured in the ACM showcase. Check it out here and explore our repository. • Our work on fairness in LLMs is featured in the ACM showcase.Check it out here and explore our repository. Area Chair/Senior Program Committee at IJCAI, ICDM, ECML PKDD, ECAI, AAMAS, ICPR, CHI, AAAI, SDM and TheWebConf. • Area Chair/Senior Program Committee at IJCAI, ICDM, ECML PKDD, ECAI, AAMAS, ICPR, CHI, AAAI, SDM and TheWebConf. Jun 2024 Hosting high school students Ayesha and Matthew as part of the Summer Youth Internship Program. • Hosting high school students Ayesha and Matthew as part of the Summer Youth Internship Program. May 2024 Participated in CRA's Grand Challenges Roundtable Discussion to identify key themes for societal impact and technological advancement. • Participated in CRA's Grand Challenges Roundtable Discussion to identify key themes for societal impact and technological advancement. I will serve as the Student Program Chair for AIES 2024 and Travel Award Chair for AAAI 2025. • I will serve as the Student Program Chair for AIES 2024 and Travel Award Chair for AAAI 2025. Apr 2024 CAHSI Expanding Participation in AI meeting, in discussions concerning opportunities, policies, and actions for broadening participation in AI. • CAHSI Expanding Participation in AI meeting, in discussions concerning opportunities, policies, and actions for broadening participation in AI. Feb 2024 Andres, our talented undergraduate, secured Gilman Scholarships to pursue studies at IE University Madrid, following his recognition as the 2023 AEASP Scholar and the 2022 Gilman Scholar. • Andres, our talented undergraduate, secured Gilman Scholarships to pursue studies at IE University Madrid, following his recognition as the 2023 AEASP Scholar and the 2022 Gilman Scholar. Jan 2024 Back in Bethesda at the NIH, discussing community engagement and guidelines for transparent and ethical AI. Check our report. • Back in Bethesda at the NIH, discussing community engagement",
  "content_length": 15226,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:07"
}