{
  "name": "Wenbo Guo 0002",
  "homepage": "https://henrygwb.github.io",
  "status": "success",
  "content": "Wenbo Guo's Homepage Wenbo Guo Assistant professor and Zhu Chair CS@UC Santa Barbara E-mail: henrygwb@ucsb.edu Office: 2163 Harold Frank Hall, Santa Barbara, CA 93106 Papers / Surfi Lab / Teaching & Service / Posts Short bio: I am an assistant professor and Zhu Chair at UCSB CS. I completed my Postdoc at UC Berkeley as part of the RDI center and BAIR Lab, under the mentorship of Prof. Dawn Song. I received my Ph.D. from Penn State with Prof. Xinyu Xing and my master's degree from Shanghai Jiao Tong University. Outside of research, I am also leading the Agent Security R&D at Virtue AI, as well as serving a Faculty advisor at Google DeepMind. My current research centers around: LLM agents and agentic RLs for software engineering and security LLM reasoning and post-training for coding AI agents security and safety My previous works studied the trustworthiness of DRL and DNN via statistical modeling (e.g., Deep GP, Gaussian process models) and learning (e.g., variational inference, MCMC, empirical bayes), and designing DNNs for security applications with a focus on noisy learning and OOD. Academic Senate Faculty Research Award, UCSB, 2025 Google ML and Systems Junior Faculty Award, Google, 2025 Berkeley RDI AI & Decentralization Innovation Award, UC Berkeley, 2025 Amazon Research Award (with Christopher Kruegel), Amazon, 2024 FAR AI Research Award, FAR AI, 2024 IBM Fellowship Award, IBM, 2020 Facebook Fellowship Finalist, Facebook, 2020 Baidu AI Fellowship Finalist, Baidu, 2020 CCS Outstanding Paper Award, ACM, 2018 Black Hat Student Scholarship, Black Hat, 2018-2020 Multiple Conference Travel Grants (e.g., USENIX Security, CCS, NeurIPS, ICML), 2018-2021 DARPA AIxCC Top 5, August, 2025 ( Press release: Washington post ) SWE-bench-Verfied: PatchPilot ranked in the top five open source tools; PatchPilot+co-PatcheR ranked second in the open weighted model (May 2025) Google SBFT Fuzzing Tool Competition Top 1, April, 2024 Geekpwn Competition on Data Tracing CTF Top 10, August, 2018 Geekpwn Competition on Advesarial Attacks and Defenses CTF Finalist (Top 6 worldwide), August, 2018 Kanxue AI CTF Competition Question Maker, June, 2018 I am actively recruiting Ph.D. students. If you have a solid background in LLMs, DRL, or software analysis skills (static analysis, fuzzing, symbolic execution) and are interested in working with me, please do not hesitate to contact me through email. [Ad in Chinese for Fall'26] Copyright © Wenbo Guo",
  "content_length": 2463,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:06"
}