{
  "name": "Wenbo Shen",
  "homepage": "https://wenboshen.org",
  "status": "success",
  "content": "Short Bio - Wenbo Shen(申文博) Wenbo ShenTenured Associate Professor, Zhejiang University Follow Hangzhou, China Email ORCIDShort BioDr. Wenbo Shen is a tenured associate professor at Zhejiang University. His research interests are operating system security, container security, and software supply chain security. He has published over 60 research papers at top-tier academic conferences. Dr. Wenbo Shen is a recipient of four distinguished paper awards (ESORICS 24, ACSAC 22, AsiaCCS 17, NDSS 16). His research work on Real-time Kernel Protection (RKP) has been deployed on hundreds of millions of devices.ResearchDr. Wenbo Shen and his research team concentrate on two primary areas. [Full paper list]Operating System Kernel Security: 1) performing OS kernel analysis to discover and eliminate new attack surfaces and vulnerabilities; 2) utilizing current hardware capabilities to develop innovative software-based protection strategies for the kernel; 3) leveraging software-hardware co-design to create new hardware features for system and software security.S&P 26: Demystifying and Exploiting ASLR on NVIDIA GPUsTOCS 25: RegVault II: Achieving Hardware-Assisted Selective Kernel Data Randomization for Multiple ArchitecturesISSTA 25: Type-Alias Analysis: Enabling LLVM IR with Accurate Types ACM CCS 24: CrossFire: Fuzzing macOS Cross-XPU Memory on Apple SiliconUSENIX SEC 24: DMAAUTH: A Lightweight Pointer Integrity-based Secure Architecture to Defeat DMA AttacksESORICS 24 [Distinguished Paper (1/535)]: Interp-flow Hijacking: Launching Non-control Data Attack via Hijacking eBPF Interpretation FlowBlack Hat USA 24: PageJack: A Powerful Exploit Technique With Page-Level UAFUSENIX SEC 23: Demystifying Pointer Authentication on Apple M1USENIX SEC 23: A Hybrid Alias Analysis and Its Application to Global Variable Protection in the Linux KernelBlack Hat USA 23: Apple PAC, Four Years Later: Reverse Engineering the Customized Pointer Authentication Hardware Implementation on Apple M1TDSC 23: kCPA: Towards Sensitive Pointer Full Life Cycle Authentication for OS KernelsTDSC 22: Automatic Permission Check Analysis for Linux KernelDAC 22: RegVault: Hardware Assisted Selective Data Randomization for Operating System KernelsUSENIX SEC 19: PeX: A Permission Check Analysis Framework for Linux KernelNDSS 16 [Distinguished Paper]: SKEE: A lightweight Secure Kernel-level Execution Environment for ARMACM CCS 14: Hypervision Across Worlds: Real-time Kernel Protection from the ARM TrustZone Secure WorldContainer and Software Security: 1) conducting both static and dynamic analysis to enhance the security of container and cloud-native systems; 2) analyzing and securing software dependencies and programming language features to improve software supply chain security.ACM CCS 25: Dangers Behind Access Control: Understanding and Exploiting Implicit Permissions in KubernetesTSE 25: Demystifying Rust Unstable Features at Ecosystem Scale: Evolution, Propagation, and MitigationICSE 25: Understanding and Detecting Peer Dependency Resolving Loop in npm EcosystemS&P 25: My Model is Malware to You: Transforming AI Models into Malware by Abusing TensorFlow APIsTDSC 24: Towards Understanding and Defeating Abstract Resource Attacks for Container PlatformsICSE 24: ModuleGuard: Understanding and Detecting Module Conflicts in Python EcosystemICSE 24: Demystifying Compiler Unstable Feature Usage and Impacts in the Rust EcosystemACM CCS 23: Take Over the Whole Cluster: Attacking Kubernetes via Excessive Permissions of Third-party ApplicationsUSENIX SEC 23: Attacks are Forwarded: Breaking the Isolation of MicroVM-based Containers Through Operation ForwardingTDSC 23: Ambush from All Sides: Understanding Security Threats in Open-Source Software CI/CD PipelinesACSAC 22 [Distinguished Paper (3/303)]: Making Memory Account Accountable: Analyzing and Detecting Memory Missing-account bugs for Container PlatformsACM CCS 21: Demons in the Shared Kernel: Abstract Resource Attacks Against OS-level Virtualization, ACM CCS 2021Background2025 - Now, Zhejiang University (China), College of Computer Science and Technology, Tenured Associate Professor2019 - 2025, Zhejiang University (China), College of Computer Science and Technology, Assistant Professor2015 - 2019, Samsung Research America (USA), Tech Lead of Real-time Kernel Protection (RKP)2010 - 2015, North Carolina State University (USA), Ph.D of Computer Science2006 - 2010, Harbin Institute of Technology (China), B.Eng of Software EngineeringAwardsDistinguished Paper Award by European Symposium on Research in Computer Security (ESORICS), 2024 (1/535)Distinguished Paper Award by Annual Computer Security Applications Conference (ACSAC), 2022, (3/303)Distinguished Paper Award by ACM Asia Conference on Computer and Communications Security (ASIACCS), ACM SIGSAC, 2017Distinguished Paper Award by Network and Distributed System Security Symposium (NDSS), 2016",
  "content_length": 4920,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:07"
}