{
  "name": "Wendy Ju [Tech]",
  "homepage": "https://wendyju.com",
  "status": "success",
  "content": "Wendy Ju Associate Professor, Information Science Jacobs Technion-Cornell Institute Cornell Tech Technion-Israel Institute of Technology [ Curriculum Vitae ] [ 10014 citations, according to Google Scholar ] NEWS I am thrilled to have been inducted into the ACM CHI Academy, class of 2025. My book, The Design of Implicit Interactions, is available online from Springer Nature. INTERESTS Interaction with Automation Interaction Design Research Human Robot Interaction Automotive Interaction Design PUBLICATIONS Rachel DiPirro, Rosalyn Devonport, Dan Calderone, Mario Yang, Wendy Ju, Meeko Oishi. Characterizing Human Feedback-Based Control in Naturalistic Driving Interactions via Gaussian Process Regression with Linear Feedback. To be published in IEEE International Conference on Intelligent Transportation Systems (ITSC 2025), Nov 18-21, 2025, Gold Coast, Australia. Dorin Ruinsky Shapira, Matt Franchi, Wendy Ju. Fingerprinting NYC's Scaffolding Problem with Longitudinal Dashcam Data. In 19th International Conference on Computational Urban Planning and Urban Management (CUPUM). University College London, London, England. Digital-Era Urban Transformations: Advancements in Data Science, Analytics and Technology. October 21, 2025, Springer. PRE-PRINT AVAILABLE Hauke Sandhaus, Angel Hsing-Chi Hwang, Wendy Ju, Qian Yang. My Precious Crash Data: Barriers and Opportunities in Encouraging Autonomous Driving Companies to Share Safety-Critical Data. Proceedings of the ACM, HCI, and presented at ACM Computer Supported Cooperative Work, Bergen, Norway. October 18-22, 2025. Xiaoyu Chang, Fan Zhang, Kexue Fu, Carla Diana, Wendy Ju, Ray LC. A Constructed Response: Designing and Choreographing Robot Arm Movements in Collaborative Dance Improvisation. In Proceedings of the ACM, HCI, and presented at ACM Computer Supported Cooperative Work, Bergen, Norway. October 18-22, 2025. Natalie Friedman, Alexandra Bremers, Adelaid Nyanyo, Ian Clark, Yasmine Kotturi, Laura Dabbish, Wendy Ju, Nikolas Martelaro. Understanding the Challenges of Maker Entrepreneurship. In Proceedings of the ACM, HCI, and presented at ACM Computer Supported Cooperative Work, Bergen, Norway. October 18-22, 2025. Kenshikimyo Terao, Ilan Mandel, Matt Franchi, Mario Yang, Mark Colley, Wendy Ju. Evaluating Interfaces for Non-Driving Related Tasks While Operating an E-Scooter. In in ACM AutoUI 2025, Sept 22-25, Brisbane Australia. JiHyun Jeong, David Goedicke, Wendy Ju, Guy Hoffman. Simulating Multiple Road User Perspectives on Autonomous Vehicle Behaviors. In in ACM AutoUI 2025, Sept 22-25, Brisbane Australia. Stacey Li, Debargha Dey, Claudia Santacruz, Wendy Ju. What Researchers Need from Driving Simulator Systems: A Thematic Analysis of Expert Interviews In in ACM AutoUI 2025, Sept 22-25, Brisbane Australia. Chishang \"Mario\" Yang, Xiang Chang, Debargha Dey, Zhuoqi Xu, Avi Parush, Wendy Ju. Socially Adaptive Autonomous Vehicles: Effects of Contingent Driving Behavior on Drivers' Experiences. In in ACM AutoUI 2025, Sept 22-25, Brisbane Australia. Hauke Sandhaus, Qiuquan Gu, Maria Teresa Parreira, Wendy Ju. Co-Designing with Transformers: Unpacking the Complex Role of GenAI in Interactive System Design Education. In ACM DIS 2025. July 5-9, 2025. Madeira, Portugal. Matt Franchi, Hauke Sandhaus, Madiha Zahrah Choksi, Severin Engelmann, Wendy Ju, Helen Nissenbaum}, Privacy of Groups in Dense Street Imagery. In ACM FAccT'25. June 23-26, 2025. Athens, Greece. Matthew Franchi, Maria Teresa Parreira, Fanjun Bu, Wendy Ju. The Robotability Score: Enabling Harmonious Robot Navigation on Urban Streets. In ACM CHI 2025. Yokohama, Japan. April 26-May 1, 2025. Hannah Pelikan, Fanjun Bu, Wendy Ju. The People Behind the Robots: How Wizards Wrangle Robots in Public Deployments. In ACM CHI 2025. Yokohama, Japan. April 26-May 1, 2025. Mohammad Faramarzian, Jorge Pardo, Ilan Manel, Andry Rakotonirainy, Wendy Ju, Ronald Schroeter. Decoding Driver Intention Cues: Exploring Non-verbal Communication for Human-Centered Automotive Interfaces. In ACM CHI 2025. Yokohama, Japan. April 26-May 1, 2025. Fanjun Bu, Kerstin Fischer, and Wendy Ju. 2025. Making Sense of Robots in Public Spaces: A Study of Trash Barrel Robots. J. Hum.-Robot Interact. April 2025. Debargha Dey, Ara Habibovic, Wendy Ju. Operationalizing Dyadic Urban Traffic Interaction Studies: From Theory to Practice. In Applied Science Special Issue on Human-Vehicle Interactions: 15(7):3738. 28 March 2025 Micol Spitale, Maria Teresa Parreira, Maia Stiber, Minja Axelsson, Neval Kara, Garima Kankariya, Chien-Ming Hung, Malte Jung, Wendy Ju, Hatice Gunes. ERR@HRI 2024 Challenge: Multimodal Detection of Errors and Failures in Human-Robot Interactions. In ACM International Conference on Multimodal Interaction (ICMI 2024) November 4-8, 2024. Costa Rica. Rachel DiPirro, Hauke Sandhaus, David Goedicke, Dan Calderone, Meeko Oishi, Wendy Ju. Characterizing Cultural Differences in Naturalistic Driving Interactions. In IEEE International Conference on Intelligent Transportation Systems (ITSC 2024), Sept 24-27, 2024, Edmonton, Canada. Navit Alalouf Klein, Hauke Sandhaus, David Goedicke, Avi Parush, and Wendy Ju. Modeling Social Situation Awareness in Driving Interactions. In ACM Automotive User Interfaces and Interactive Vehicular Applications (AutoUI2024), Sept 22-25, 2024. Stanford, California. DATASET AVAILABLE Matthew Franchi, Debargha Dey, Wendy Ju. Towards Instrumented Fingerprinting of Urban Traffic: A Novel Methodology using Distributed Mobile Point-of-View Cameras. In ACM Automotive User Interfaces and Interactive Vehicular Applications (AutoUI2024), Sept 22-25, 2024. Stanford, California. Honorable Mention Award DATASET AVAILABLE Maria Teresa Parreira, Sukruth Gowdru Lingaraju, Adolfo Ramirez-Artistizabal, Alexandra Bremers, Manaswi Saha, Michael Kuniavsy, Wendy Ju. \"Bad Idea, Right?\" Exploring Anticipatory Human Reactions for Outcome Prediction in HRI. In IEEE International Conference on Robot and Human Interactive Communication (RO-MAN 2024), Aug 26-30, 2024. Pasadena, CA. Sharon Yavo-Ayalon, Adam Yuzhen Zhang, Albert Ruixiang Han, Swapna Joshi, Fanjun Bu, Cooper Murr, Lunshi Zhou, Wendy Ju. Behind the scenes of CXR: Designing a Geo-Synchronized Communal eXtended Reality System. DIS 2024, July 1-5, 2024. Copenhagen, Denmark. Honorable Mention Award Ilan Mandel, Wendy Ju. Designing with What Remains. Designing Interactive Systems 2024. July 1-5, 2024. Copenhagen, Denmark. Fanjun Bu, Stacey Li, David Goedicke, Mark Colley, Gyanendra Sharma, Wendy Ju. Portobello: Extending Driving Simulation from the Lab to the Road. CHI 2024, May 11-16, 2024. Honolulu, HI. Honorable Mention Award Barry Brown, Fanjun Bu, Ilan Mandel, Wendy Ju. Trash in Motion: Emergent Interactions with a Robotic Trashcan. CHI 2024, May 11-16, 2024. Honolulu, HI. Debargha Dey, Toros Ufuk Senan, Bart Hengeveld, Azra Habibovic, Wendy Ju. Multi-Modal eHMIs: The Relative Impact of Light and Sound in AV-Pedestrian Interaction. CHI 2024, May 11-16, 2024. Honolulu, HI. Natalie Friedman, Zhi Ming Tan, Micah Haskins, Wendy Ju, Diane Bailey, Louis Longchamps. Understanding Farmers' Data Collection Practices on Small-to-Medium Farms for the Design of Future Farm Management Information Systems. Proc. ACM Hum.-Comput. Interact. 8, CSCW1, Article 139 (April 2024). Yuzhen Zhang, Ruixiang Han, Ran Zhou, Peter Gyory, Clement Zheng, Patrick C. Shih, Ellen Yi-Luen Do, Malte Jung, Wendy Ju, Daniel Leithinger. Wizard of Props: Mixed Reality Prototyping with Physical Props to Design Responsive Environments. In ACM Tangible Embedded Embodied Interaction 2024, Feb 11-14, 2024. Cork, Ireland. Alexandra Bremers, Natalie Friedman, Sam Lee, Tong Wu, Eric Laurier, Malte Jung, Jorge Ortiz and Wendy Ju. \"(Social) Trouble on the Road: Understanding and Addressing Social Discomfort in Shared Car Trips.\" November 7, 2023. arXiv preprint arXiv:2311.04456 (2023). Alexandra Bremers, Maria Teresa Parreira, Xuanyu Fang, Natalie Friedman, Adolfo Ramirez-Aristizabal, Alexandria Pabst, Mirjana Spasojevic, Michael Kuniavsky, and Wendy Ju. \"The Bystander Affect Detection (BAD) Dataset for Failure Detection in HRI.\" IROS 2023. October 1-4, 2023. Detroit USA. DATASET AVAILABLE Saki Suzuki, Ilan Mandel, Stacey Li, Wen-Ying Lee, Mark Colley, Wendy Ju. AdVANcing Design: Customizing Spaces for Vanlife. In Automotive User Interfaces 2023. September 18-21, 2023. Ingolstadt, Germany. Meredith Davis, Luke Feast, Jodi Forlizzi, Ken Friedman, Ali Ilhan, Wendy Ju, Gerd Korteum, Maria Hellström Reimer, Carlos Teixiera, Responding to the Indeterminacy of Doctoral Research in Design. In She Ji: The Journal of Design, Economics, and Innovation. 9(2), Summer 2023, 283-307. Ilan Mandel, Wendy Ju. Recapturing Product as Material Supply: A Case Study around Hoverboards. In Designing Interactive Systems 2023. July 10-14, 2023. Pittsburgh.Honorable Mention Award Matthew Franchi, JD Zamfirescu-Pereira, Wendy Ju, Emma Pierson. Detecting disparities in police deployments using dashcam data. In Fairness, Accountability, and Transparency. June 12-15, 2023. Chicago DATASET AVAILABLE Sharon Yavo-Ayalon, Swapna Joshi, Yuzhen (Adam) Zhang, Ruixiang (Albert) Han, Narges Mahyar, and Wendy Ju. 2023. \"Building Community Resiliency through Immersive Communal Extended Reality (CXR)\" Multimodal Technologies and Interaction 7, no. 5: 43. Best Paper Award Hauke Sandhaus, Wendy Ju, Qian Yang. Towards Prototyping Driverless Vehicle Behaviors, City Design, and Policies Simultaneously. arXiV preprint arXiv:2304.06639v1 (2023) Ilan Mandel, Wendy Ju, Frankenstein's Toolkit: Prototyping Electronics Using Consumer Products. arXiV preprint arXiv:2303.13618 (2023) Alexandra Bremers, Alexandria Pabst, Maria Teresa Parreira, and Wendy Ju. \"Using Social Cues to Recognize Task Failures for HRI: A Review of Current Research and Future Directions.\" arXiv preprint arXiv:2301.11972 (2023). Fanjun Bu, Ilan Mandel, Wen-Ying Lee, and Wendy Ju. 2023. Trash Barrel Robots in the City. In C",
  "content_length": 44796,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:10"
}