{
  "name": "Wenfei Wu",
  "homepage": "http://wenfei-wu.github.io",
  "status": "success",
  "content": "Homepage of Wenfei Wu PKU Github Wenfei Wu Assistant Professor School of Computer Science Peking University Wechat ID I lead the NetLab of the School of Computer Science at Peking University. Our lab work on the information infrastructure for distributed applications, such as machine learning, cloud computing, high performance computing, and big data. We invent new architectures and management methodologies for these information infrastructures. I am recruiting Ph.D./master/postdoctoral/intern students. You are welcome to join us. 研究组在网内计算方向的阶段性研究总结【下载】 Highlights [CCPC24] Best Paper Award (中国算力大会), In-Network Aggregation with Transport Transparency for Distributed Training. [ASPLOS23] Distinguished Paper Award, A Generic Service to Provide In-network Aggregation for Key-value Streams. [NSDI21] Best Paper Award, ATP: In-network Aggregation for Multi-tenant Learning. [IPCCC19] Best Paper Runner-up, Sphinx: A Transport Protocol for High-Speed and Lossy Mobile Networks. [SoCC13] Best Student Paper Award, Virtual Network Diagnosis as a service. [SIGCOMM10] Best Paper Runner-up, Generic and Automatic Address Configuration for Data Center Networks. News 09/2025: DNF accepted in ToN 2025! 09/2025: MPCCS accepted in EuroSys 2026! 06/2025: SGLB accepted in SIGCOMM 2025! 09/2023: NetPack (INA job placement) accepted in ASPLOS 2024! 08/2023: DSA (INA policy design) accepted in ICNP 2023. 05/2023: ClickINC (INC as a service for application developers) accepted in SIGCOMM 2023! 05/2023: MimoSketch accepted in KDD 2023. 03/2023: ASK won Distinguished Paper Award in ASPLOS 2023! … Research Recent Focus In-Network Computing for Distributed Systems:\tATP, SwRL, NetRPC, ASK Past Projects Model-Driven DevOps for Network Functions: \t\tNFD, NFReducer, NF-SE, Alembic, NFactor Cloud Network Diagnostics:\t\t\t\t\t\tVND, PerfSight, MPA, CTF Publications List Papers Google Scholar Teaching Introduction to Computation, F22, F23, F24, F25 Computer Networks, S24, S25 Advanced Computer Networks, F22, F23, S25 Introduction to Computer Systems (Seminar), F22, F23, F24 Fundamentals of Cryptography, F17, F18, F19, F20 Security Technologies in Cyberspace, S18, S19, S20 Students Nengyuan Zhang Ruizhe Zhou Tianyu Bai Jianglong Nie Junkai Chen Jiaqi Sun Chenqi Zhao Yitao Yuan Yuchen Xu Weize Gao Shaoke Fang Alumni Ph.D. Hongyi Huang, then at Huawei Yongchao He, then at Ubiquant Investment Master Bohan Zhao, then Ph.D. at Tsinghua Ming Sun, then at Optiver Yixi Chen ChonLam Lao, then Ph.D. at Harvard Bangwen Deng, then at Tencent Intern Harsha Sharma (coauthored a paper in MASCOTS20), then to join MIT Qingxiu Liu (coauthored a paper in ICCCN20), then at CAS Qi-An Fu (coauthored a paper in APSys18), then Master at Tsinghua Services Technical Program Committee TPC: ICNP25/24/23/22/21, LANMAN25, APNet21, IM21, SIGCOMM20/19 Poster and Demo, etc. Reviewer: TON, TNSM, TOC, etc. Organizing Committee LANMAN26, SIGMETRICS21, SOSR20, SIGCOMM19, SOSR19, etc.",
  "content_length": 2954,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:10"
}