{
  "name": "Wengong Jin",
  "homepage": "https://wengong-jin.github.io",
  "status": "success",
  "content": "Wengong Jin Office 907 177 Huntington Ave Boston, MA 02115 Wengong Jin is an assistant professor at Khoury College of Computer Sciences at Northeastern University. He is also a visiting research scientist in the Eric and Wendy Schmidt Center at Broad Institute. He obtained his PhD at MIT CSAIL, advised by Prof. Regina Barzilay and Prof. Tommi Jaakkola. His research focuses on geometric and generative AI models for drug discovery and biology. His work has been published in journals including ICML, NeurIPS, ICLR, Nature, Science, Cell, and PNAS, and covered by such outlets as the Guardian, BBC News, CBS Boston, and the Financial Times. He is the recipient of the BroadIgnite Award, Dimitris N. Chorafas Prize, and MIT EECS Outstanding Thesis Award. I am recruting postdoc and PhD students who are interested in 1) AI for drug discovery, protein folding and design 2) AI agent for scientific discovery For prospective postdoc applicants, please send me an email with your CV. For prospective Ph.D. applicants, please submit your material to Khoury Ph.D. application portal.** Research highlights Algorithmic innovation Equivariant neural networks: FAFormer (NeurIPS 2024) Diffusion models for binding energy prediction: Neural Euler’s Rotation Equation (NeurIPS 2023), DSMBind (in review) Generative models for antibody/enzyme/RNA design: RefineGNN (ICLR 2022), HERN (ICML 2022), SurfPro (ICML 2024), EnzyGen (ICML 2024), RNAFlow (ICML 2024) Generative models for chemical perturbation prediction: Mol2Image (CVPR 2021) Domain generalization: RGM (arxiv 2020) Generative models for molecular design: Junction tree VAE (ICML 2018), Graph2Graph (ICLR 2019), Hierarchical graph VAE (ICML 2020), RationaleRL (ICML 2020) Graph neural networks: Weisfeiler-Lehman Network (ICML 2017), ChemProp (JCIM 2019) Impact: drug discovery Discovery of novel antibiotics: Cell 2025, Cell 2020, Nature Chemical Biology 2022, Nature 2023 Discovery of synergistic drug combinations: PNAS 2021, Nature Communcations (in review) Impact: chemical engineering Automated chemical synthesis lab: Science 2023 Chemical reaction outcome prediction at chemist-level accuracy: NeurIPS 2017, Chemical Science 2019 Teaching I will be teaching a Ph.D. seminar on AI for science. Please check out the course website:",
  "content_length": 2286,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:11"
}