{
  "name": "Weng-Huang Cheng",
  "homepage": "https://www.csie.ntu.edu.tw/~wenhuang",
  "status": "success",
  "content": "ï»¿ Wen-Huang Cheng Home  |  Professional Activities  |  Projects  |  Publications  |  ä¸­æç Wen-Huang Cheng  é­æç NTU Distinguished Chair Professor Department of Computer Science and Information Engineering Graduate Institute of Networking and Multimedia National Taiwan University (NTU) Scientific Advisor Taipei City Government Laboratory: Artificial Intelligence and Multimedia (AIMM) Research Group Communications and Multimedia Laboratory (CMLab) Contact Information Add:No. 1, Sec. 4, Roosevelt Rd., Taipei 10617, Taiwan Deaprtment of Computer Science and Information Engineering, National Taiwan University Tel:+886-(0)2-33664888 ext 420 Email:wenhuang Autobiography Wen-Huang Cheng received the B.S. and M.S. degrees in computer science and information engineering from National Taiwan University, Taipei, Taiwan (R.O.C.), in 2002 and 2004, respectively, where he received the Ph.D. degree from the Graduate Institute of Networking and Multimedia in 2008. He is a Professor with the Department of Computer Science and Information Engineering, Graduate Institute of Netwo and Multimedia, National Taiwan University (NTU), Taipei, Taiwan, where he is the Founding Director with the Artificial Intelligence and Multimedia (AIMM) Research Group. Before joining NTU, he was a Distinguished Professor with the Institute of Electronics, National Yang Ming Chiao Tung University (NYCU), Hsinchu, Taiwan, from 2018 to 2023 and led the Multimedia Computing Research Group at the Research Center for Information Technology Innovation (CITI), Academia Sinica, Taipei, Taiwan, from 2010 to 2018. His research interest includes artificial intelligence, multimedia, computer vision, machine learning, digital transformation, and financial technology. Education 2004-2008, Ph.D., Graduate Institute of Networking and Multimedia, National Taiwan University (with highest honors) 2002-2004, M.S., Department of Computer Science and Information Engineering, National Taiwan University 1998-2002, B.S., Department of Computer Science and Information Engineering, National Taiwan University Honors & Awards Outstanding Engineering Professor Award, Chinese Institutes of Engineers, 2024 IEEE Fellow (Class of 2024 for contributions to intelligent multimedia computing and applications), 2023 Fellow, Asia-Pacific Artificial Intelligence Association (AAIA), 2023 NTU-Fubon Distinguished Chair Professorship Award, 2023 Worldâs Top 2% Scientists by Stanford University, 2023 NYCU EE College Distinguished Teaching Award, 2022 Fellow, British Computer Society (BCS), 2022 2021 Future Tech Award, MOST (Ministry of Science and Technology of Taiwan), 2021 National Innovation Award, 2021 Outstanding Associate Editor Award, IEEE Transactions on Multimedia, 2021 Best Associate Editor Award, Multimedia Systems, 2021 Chief Artificial Intelligence Scientist of Taiwan FamilyMart, 2021 Best Paper Award, IEEE International Conference on Multimedia & Expo (ICME), 2021 Third Place Winner (out of 56), Chalearn 3D High-Fidelity Mask Face Presentation Attack Detection Challenge of IEEE International Conference on Computer Vision (ICCV), 2021 IEEE Distinguished Lecturer, 2021-2022 NYCU EE/CS Young Scholar Outstanding Contribution Award, 2021 NYCU Distinguished Mentor Award, 2022 Outstanding Associate Editor Award, IEEE Transactions on Multimedia, 2020 ACM Distinguished Member, 2020 Fellow, Institute of Engineering and Technology (IET), 2020 First Place Winner, Look Into Person (LIP) Challenge (Track: Image-based Multi-pose Virtual Try-on Challenge) of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2020 Third Place Winner (out of 272), GigaVision Challenge of European Conference on Computer Vision (ECCV), 2020 MOE Excellent Course Award for Training Program on AIoT Technology and Applications, MOE (Ministry of Education of Taiwan), 2020 Best Paper Award, IPPR Conf. Computer Vision, Graphics & Image Processing (CVGIP), 2019 MSRA Collaborative Research Award, 2018 Outstanding Reviewer Award, IEEE International Conference on Multimedia & Expo (ICME), 2018 Ta-Yu Wu Memorial Award, MOST (Ministry of Science and Technology of Taiwan), 2017 Significant Research Achievements of Academia Sinica, 2017 Top Social Media Article, Journal of Network and Computer Applications, 2017 APSIPA Distinguished Lecturer, 2016-2017 Y. Z. Hsu Scientific Paper Award, 2016 Outstanding Young Scholar Award, MOST (Ministry of Science and Technology of Taiwan), 2016 ACM MM TPC Meeting Travel Award, 2016 Best Paper Nomination Award, National Conference on Multimedia Technology (NCMT), 2016 Presidential Achievement Award of Rotary International, 2015-2016 Outstanding Youth Electrical Engineer Award, CIEE (Chinese Institute of Electrical Engineering), 2015 Top 10% Paper Award, IEEE International Workshop on Multimedia Signal Processing (MMSP), 2015 Outstanding Reviewer Award, ACM International Conference on Internet Multimedia Computing and Service (ICIMCS), 2015 K. T. Li Young Researcher Award, ACM Taipei/Taiwan Chapter, 2014 Grand Challenge 2nd Prize, ACM International Conference on Multimedia (MM), 2014 Outstanding Young Scholar Award, MOST (Ministry of Science and Technology of Taiwan), 2014 Outstanding Social Youth of Taipei Municipal, 2014 Outstanding Research Talent Award, MOST (Ministry of Science and Technology of Taiwan), 2011-2014, 2016 Best Reviewer Award, Pacific-Rim Conference on Multimedia (PCM), 2013 Outstanding Young Scholar Award, NSC (National Science Council of Taiwan), 2012 Best Poster Paper Award, International Conference on 3D Systems and Applications (3DSA), 2012 Grand Challenge Finalist, ACM International Conference on Multimedia (MM), 2011 IPPR Ph.D. Dissertation Award, 2010 IICM Ph.D. Dissertation Award, 2008 Member of the Phi Tau Phi Scholastic Honor Society, 2008 TITDEF (Taiwan Information Technology Developing Educational Foundation) Scholarship, 2007 CyberLink Technical Elite Fellowship, 2006 Acer Long-term Smile Contest Award, 2006 Best Paper Award, IPPR Conf. Computer Vision, Graphics & Image Processing (CVGIP), 2005 Inventec OKWAP Educational Scholarship, 2004 Best Student Paper Award, Workshop on CE & Signal Processing (WCEsp), 2004 Work Experience Professor, Department of Computer Science and Information Engineering & Graduate Institute of Networking and Multimedia, National Taiwan University, 2023.02-present. Director, Institute of Artificial Intelligence Innovation, National Yang Ming Chiao Tung University, 2022.02-2023.01. Distinguished Professor, Department of Electronics Engineering & Institute of Electronics, National Yang Ming Chiao Tung University, 2021.02-2023.01. Deputy Director, Wistron-NCTU Embedded Artificial Intelligence Research Center, National Yang Ming Chiao Tung University, 2020.11-2023.01. Scientific Advisor, Taipei City Government, 2020.09-present. Director, Artificial Intelligence Graduate Program, National Yang Ming Chiao Tung University, 2019.08-present. Technical Advisor, Office of Research and Development, National Chiao Tung University, 2019.08-present. Associate Specialist, National Council of Advisor's on Science and Technology, Board of Science and Technology, Executive Yuan, R.O.C., 2018.10-present. Professor, Department of Electronics Engineering & Institute of Electronics, National Chiao Tung University, 2018.08-2021.01. Research Consultant, Computational Intelligence Technology Center (CITC), Industrial Technology Research Institute (ITRI), 2017.11-present. Chair Professor, Land Bank of Taiwan â AI in FinTech Lecture, 2017.11-present. Technical Advisor, Institute for Information Industry (III), 2017.03-2017.08. Adjunct Associate Professor, CSIE, National Taiwan University of Science & Technology, 2016.08-present. Technical Advisor, EXXXentTek Inc., 2016.05-2017.11. Associate Research Fellow, CITI, Academia Sinica, 2014.11-2018.07. Associate Research Fellow (Joint appointment), IIS, Academia Sinica, 2014.11-2018.07. Technical Advisor, AXXXnTek Inc., 2014.01-2015.12. Faculty, Taiwan International Graduate Program (TIGP): Social Network and Human-Centered Computing (SNHCC), 2013.11-2018.07. Faculty, Academia Sinica â National Cheng Kung University: Multimedia System and Intelligent Computing Ph.D. Program, 2013.09-2018.07. Assistant Research Fellow (Joint appointment), IIS, Academia Sinica, 2011.03-2014.11. Assistant Research Fellow, CITI, Academia Sinica, 2010.07-2014.11. Pr. Researcher, MagicLabs, HTC Corp., 2009.12-2010.07. Postdoctoral Research Fellow, CITI, Academia Sinica, 2009.08-2009.12. Corporal, R.O.C. Army, 2008.09-2009.08. Research Intern, IBM Thomas J. Watson Research Center, 2007.06-2007.09. Recruitment 1. Postdoc Researcher Job Description: The Artificial Intelligence and Multimedia (AIMM) Research Group at National Taiwan University, is currently seeking candidates able to make research advances in the various areas of muiltimedia technologies. Required: Ph.D. degree in CS/EE/Math or other related fields. Analytic background and software prototyping skills. Salary: $26,000-$36,000 USD per year. How to Apply: Please email me your resume, bio, transcripts, and other supporting materials for further scheduling interviews. Note that only qualified applicants will be notified. 2. Full-time/Part-time Research Assistants Job Description: The The Artificial Intelligence and Multimedia (AIMM) Research Group at National Taiwan University, is currently seeking candidates to participate in our on-going research in the various areas of muiltimedia technologies. Required: M.S. (or B.S.) degree/student in CS/EE/Math or other related fields. Programming skill at intermediate level or above. Paper survey and reading skills. Willingness to write and publish papers. Preferred: with a plan or desire to pursue Ph.D. degrees. Salary: Full-time: $16,000+ USD per year; Part-time: by negotiation. How to Apply: Please email me your resume, bio, transcripts, and other supporting materials for further scheduling interviews. Note th",
  "content_length": 10101,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:10"
}