{
  "name": "Wenhu Chen",
  "homepage": "https://wenhuchen.github.io",
  "status": "success",
  "content": "Wenhu Chen Home Publication Teaching TIGER Lab Talks Miscellaneous Wenhu Chen [陈文虎 in Chinese] Researcher in LLM/Agents/Multimodality Email: wenhuchen [at] uwaterloo [dot] ca | hustchenwenhu [at] gmail [dot] com Google Scholar  / CV (updated in July 25)  / Github  / Twitter Biography Wenhu Chen is an assistant professor at the University of Waterloo (on Leave). He obtained the Canada CIFAR AI Chair Award in 2022. He worked at Google DeepMind from 2021 to 2025, where he contributed to the Gemini multimodel and evaluation efforts. Before that, he obtained his PhD from the CS department of the University of California, Santa Barbara. His research interest lies in natural language processing, deep learning, and multimodal learning. He aims to design models that handle complex reasoning scenarios, such as math problem-solving and knowledge grounding. He is also interested in building more powerful multimodal models to bridge different modalities. He won the prestigious Golden Jubilee Research Excellence Award at the University of Waterloo in 2025. He received the Area Chair Award in AACL-IJCNLP 2023, the Best Paper Honorable Mention in WACV 2021, and the UCSB CS Outstanding Dissertation Award in 2021. Research Interest My research interest covers the following aspects: Reasoning Information Retrieval Benchmarks and Evaluation Generative AI Research Highlights You might have heard of me because of the following work I conducted. 1. Natural Language Processing (LLMs) Program-of-Thoughts: A prompting strategy to use tools to solve complex reasoning tasks MAmmoTH/MAmmoTH2/General Reasoner: Advancing reasoning model to solve complex reasoning tasks OpenCoderInterpreter/AceCoder: Advanced coding language models for complex tasks 2. Multimodal Understanding (Image & Video) MuRAG/UniIR/MagicLens/VLM2Vec/VLM2Vec-V2: the framework to enable unified and compositional multimodal information retrieval Mantis/MAmmoTH-VL/MAmmoTH-VL2: advanced vision-language models with better reasoning skills VL-Rethinker/Pixel-Reasoner: advanced vision-language models with better reasoning skills 3. Multimodal Generation (Image & Video) Re-Imagen/SuTI/Kosmos-G/Instruct-Imagen: the most effective and efficient and controllable image generation models T2V-Turbo/T2V-Turbo-v2: efficient text-to-video generation models MagicBrush/OmniEdit/AnyV2V: powerful image and video editing models 4. Benchmarks & Evaluation MMMU/MMLU-Pro/TheoremQA/MEGA-Bench:: the commonly used language model and vision-language model evaluation suite TabFact/HybridQA/OTT-QA: Table and text reasoning evaluation benchmarks 5. Others MERT/ChatMusician/YuE: Foundation models for understanding and composing music MAP-Neo/Fine-FineWeb: Fully open-source language models with high-quality pre-training datasets KB-BINDER/TableCoT/StructLM: Grounding foundation models on structured knowledge TheoremExplainAgent: Building agents for composing education videos TIGER Lab I direct the Text and Image GEnerative Research (TIGER) lab. My lab is focused on studying different generative models in different modalities including text, images, videos and music. We are committed to building powerful state-of-the-art models for various domains. Our lab is always looking for talented and self-motivated students. Awards 2025: Math Golden Jubilee Award 2024: CVPR Best Paper Finalist 2023: AACL-IJCNLP23 Area Chair Award 2022: Canada CIFAR AI Chair 2021: UCSB CS Outstanding Dissertation Award 2021: WACV21 Best Student Paper Honorable Mention Fundings CIFAR AI Chair: Accessing Diverse Web Knowledge with Natural Language Interface (2022 - 2027) NSERC Discovery: Building Semiparametric Models to Decouple Knowledge from Computation (2023 - 2028) Mitacs Accelerate: Question Answering over Long Clinical Documents (2024 - 2026) CIFAR AI Catalyst: Generating Images with Multimodal Instruction (2024 - 2026) National Research Council Canada - AI4D Funding: Accelerating Scientific Discovery with Foundation Models (2024 - 2026) National Research Council Canada - New Beginning: Building More Efficient Visual Generative Models (2025 - 2026) CIAFR Solution Network - Safer AI for the Global South: A Citizen-Centered Co-Creating Dialect Bias Benchmarks, Mitigation Tools, and Policy Solutions (2026 - 2028) CFI-JELF: Enriching the linguistic diversity of open language models (2026)",
  "content_length": 4348,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:12"
}