{
  "name": "Wenhao Luo",
  "homepage": "https://www.cs.uic.edu/~wenhao",
  "status": "success",
  "content": "Wenhao Luo - University of Illinois Chicago Wenhao Luo Department of Computer Science College of Engineering University of Illinois Chicago Chicago, IL 60607, USA Office: SEO 1118 Email: wenhao@uic.edu [Google Scholar] Biography I am actively looking for self-motivated students at all levels (BS/MS/PhD) with relevant backgrounds. If you are interested in working with me, feel free to reach out! I am an Assistant Professor in Computer Science at University of Illinois Chicago. My research interests are at the intersection of robotics, control theory, artificial intelligence, and machine learning. Specifically, my research focuses on principled methods for robust and interactive autonomy that enable robots to safely and effectively collaborate with each other and with humans in the physical world. Prior to joining UIC, I served as an Assistant Professor at UNC Charlotte, and completed my PhD in Robotics at Robotics Institute, Carnegie Mellon University in 2021. I also spent two summers in 2019 and 2020 as a research intern at Microsoft Research. Research Interests I am broadly interested in robotics, control theory and artificial intelligence. Within robotics, my subdisciplinary interests lie in planning, coordination and learning for autonomous and adaptive robotic systems, such as multi-robot systems and human-robot systems, with emphasis on safety, robustness, trustworthiness and adversaries in the systems. Teaching Spring 2025: CS494 Special Topics: Mobile Robotics (Syllabus, Schedule) Fall 2024: ITCS-4150/5150 Mobile Robotics Spring 2024: ITCS-6151/8151 Intelligent Robotics Fall 2023: ITCS-4150 Mobile Robotics Spring 2023: ITCS-6152/8152 Robot Motion Planning Fall 2022: ITCS-3153 Introduction to Artificial Intelligence Spring 2022: ITCS-6151/8151 Intelligent Robotics Fall 2021: ITSC-8699 Graduate Research Seminar News May. 2025: Our paper on Distributed Multi-Robot Source Seeking received the Best Conference Paper Award Finalist & Best Paper Award Finalist on Multi-Robot Systems at ICRA 2025 May. 2025: I am co-organizing the RSS 2025 workshop on Large Foundation Model for Interactive Robot Learning Jan. 2025: Four papers accepted to ICRA 2025 Jan. 2025: After three wonderful years at UNC Charlotte, I am joining Department of Computer Science at University of Illinois Chicago as an Assistant Professor Jan. 2025: I am serving as an associate editor for IROS 2025 Dec. 2024: I served as a panelist for an NSF Program Oct. 2024: Our paper on Risk-based Socially-Compliant Behavior Planning received the Best Paper Award at IROS 2024 Workshop on Building and Evaluating Ethical Robotic Systems (ERS) Sept. 2024: I am serving as an associate editor for ICRA 2025 and PC member for WAFR 2024, AAAI 2025, and AAMAS 2025 Jul. 2024: I received an NSF BPC Supplement award for current project on Safe Multi-Vehicle Coordination In Mixed-Autonomy Traffic Jul. 2024: One paper on Online Learning for Communication-Aware Multi-Robot Systems accepted to IROS 2024 Jul. 2024: Three papers accepted to ITSC 2024 and MECC 2024 on Courteous MPC, Risk Assessment, and Driver Modeling for planning and prediction in autonomous driving. May 2024: One paper on Decentralized Multi-Robot Line-of-Sight Connectivity Maintenance accepted to RSS 2024 May 2024: I received the 2024 College of Computing and Informatics Outstanding Faculty Research Award from UNC Charlotte Feb. 2024: I served as a panelist for an NSF Program Feb. 2024: I received an NSF REU Supplement award for current project on Safe Multi-Vehicle Coordination In Mixed-Autonomy Traffic Jan. 2024: Two papers on Safety-Critical Control with Uncertainty Quantification and Socially-Compliant Behavior Planning for Autonomous Driving accepted to ACC 2024 Jan. 2024: I received the 2024-25 Faculty Research Grant Award from UNC Charlotte for project on Safe Control for Learning-enabled Systems show more Jan. 2024: I am serving as an associate editor for IROS 2024 Sept. 2023: I received an NSF ERI grant as PI for project on Communication-Aware Multi-Robot Coordination Sept. 2023: I am serving as an associate editor for ICRA 2024 Jul. 2023: I served as a panelist for an NSF Program Jul. 2023: I received an NSF CPS grant as lead PI for collaborative project on Safe Multi-Vehicle Coordination In Mixed-Autonomy Traffic Jun. 2023: One paper on Risk-aware Safe Multi-agent Systems with Dynamic Responsibility Allocation accepted to IROS 2023, and also received the Best TAS Paper Award at ICRA 2023 Workshop on Multidisciplinary Approaches to Co-Creating Trustworthy Autonomous Systems (MACTAS) Jun. 2023: Our paper on Decentralized Safe and Risk-aware Multi-agent Navigation received the Best Student Paper Runner Up Award at AAMAS 2023 Mar. 2023: One paper on Occlusion-free Image-Based Visual Servoing accepted to IFAC 2023 Jan. 2023: One paper on CBF-Inspired Distributed Collision Avoidance accepted to ACC 2023 Jan. 2023: One paper on Multi-Robot Line-of-Sight Connectivity Maintenance accepted to ICRA 2023 Jan. 2023: Two papers accepted to AAMAS 2023 Jan. 2023: I am serving as an associate editor for IROS 2023 Nov. 2022: I was selected for the 2023 AAAI New Faculty Highlights Program Sept. 2022: One paper on Pedestrian Intent Prediction using Control Theoretic Approaches accepted to IFAC CPHS 2022 and nominated as Best Student Paper Award Sept. 2022: I am serving as an associate editor for ICRA 2023 Aug. 2022: I gave an invited talk on Safe and Resilient Autonomy in Multi-Robot Systems under Uncertainty in the Robotics and Controls Seminar at UNC Charlotte Jul. 2022: I am serving on AAAI-23 Conference Committee as co-chair for AAAI-23 Student Abstract and Poster Program and PC member Jul. 2022: One paper on Noncooperative Robotic Herding accepted to CDC 2022 Jun. 2022: One paper on Bio-Inspired Fast Emergency Reaction for Multi-Robot Systems accepted to RA-L and IROS 2022 Jun. 2022: One paper on Social Preference-Aware Multi-Agent Collision Avoidance accepted to ITSC 2022 Jun. 2022: I am serving as a local chair for RSS Pioneers Workshop 2022 May. 2022: Two papers on Feasibility-assured Safe Control and Adaptive Safe Merging for Autonomous Vehicles accepted to IV 2022 with one of them as oral presentation (selection rate 10%) April. 2022: I received Highlighted Reviewer Award at ICLR 2022 Mar. 2022: I received the 2022-23 Faculty Research Grant Award from UNC Charlotte Mar. 2022: One paper on Sample-efficient Safe Reinforcement Learning accepted to WAFR 2022 Feb. 2022: One paper on Adaptive Safe Behavior Generation for Autonomous Vehicles accepted to AAAI-22 Student Abstract and Poster Program and selected as Best Student Paper Finalist Feb. 2022: I am serving as an associate editor for IROS 2022 Feb. 2022: I am serving as co-chair for AAAI-22 Student Abstract and Poster Program` Oct. 2021: I gave an invited keynote talk in the Workshop Safe Control and Learning under Uncertainty in MECC 2021 Sept. 2021: I am co-organizing the IROS 2021 workshop on Cognitive and Social Aspects of Human Multi-Robot Interaction Aug. 2021: I joined CS@UNC Charlotte as an Assistant Professor Aug. 2021: Our paper on Probabilistic Safe Control for Autonomous Driving received the Best Paper Runner-Up Award at the IJCAI 21 Workshop on AI4AD Jul. 2021: I defended my PhD on Safe and Resilient Multi-Robot Systems. My thesis is available here Jul. 2021: I was selected as a 2021 RSS Pioneer Jun. 2021: Two papers accepted to IROS 2021 Feb. 2021: I am serving as Expert Reviewer for ICML 2021 Jan. 2021: Three papers accepted to ICRA 2021 Sept. 2020: Our paper on Multi-Robot Collision Avoidance with Probabilistic Safety Barrier Certificates accepted to NeurIPS 2020 as spotlight presentation (Selection rate 4.1%) Sept. 2020: I received Top 33% reviewer award at ICML 2020 Jul. 2020: Two papers accepted to IROS 2020 Jan. 2020: Our paper on Multi-Robot Behavior Mixing with Connectivity Maintenance accepted to ICRA 2020 Journal Articles Collective Conditioned Reflex: A Bio-Inspired Fast Emergency Reaction Mechanism for Designing Safe Multi-Robot Systems Zhenting Zhao, Bowei He, Wenhao Luo, and Rui Liu Robotics and Automation Letters (RA-L) with presentation at IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2022 Paper A suboptimal and analytical solution to mobile robot trajectory generation amidst moving obstacles Jun Peng*, Wenhao Luo*, Weirong Liu, Wentao Yu, and Jing Wang (* indicates equal contribution) Autonomous Robots (AURO), vol. 39, no. 1, pp. 1–23, 2015 Paper Refereed Conference Publications Computationally and Sample Efficient Safe Reinforcement Learning Using Adaptive Conformal Prediction Hao Zhou, Yanze Zhang, and Wenhao Luo IEEE International Conference on Robotics and Automation (ICRA), 2025 Paper Adaptive Deadlock Avoidance for Decentralized Multi-Agent Systems via CBF-inspired Risk Measurement Yanze Zhang, Yiwei Lyu, Siwon Jo, Yupeng Yang, and Wenhao Luo IEEE International Conference on Robotics and Automation (ICRA), 2025 Paper Integrating Multi-Robot Adaptive Sampling and Informative Path Planning for Spatiotemporal Natural Environment Prediction Siva Kailas, Srujan Deolasee, Wenhao Luo, Woojun Kim, and Katia Sycara IEEE International Conference on Robotics and Automation (ICRA), 2025 PDF Coming Soon Distributed Multi-robot Source Seeking in Unknown Environments with Unknown Number of Sources Lingpeng Chen, Siva Kailas, Srujan Deolasee, Wenhao Luo, Katia Sycara, and Woojun Kim IEEE International Conference on Robotics and Automation (ICRA), 2025 Best Conference Paper Award Finalist & Best Paper Award Finalist on Multi-Robot Systems Paper Integrating Online Learning and Connectivity Maintenance for Communication-Aware Multi-Robot Coordination Yupeng Yang, Yiwei Lyu, Yanze Zhang, Ian Gao, and Wenhao Luo IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2024 Paper Project Page Courteous MPC for Autonomous Driving with CBF-inspired Risk Assessment Yanze Zhang, Yiwei Lyu, Sude",
  "content_length": 21721,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:12"
}