{
  "name": "Wenjing Lou",
  "homepage": "http://www.cnsr.ictas.vt.edu/WJLou.html",
  "status": "success",
  "content": "CNSR@VT -- Complex Networks and Security Research at Virginia Tech Skip Menu Skip to Main Navigation Skip to Main Content Skip to Footer Return to Skip Menu Main Navigation Home News Archive People Faculty Students Visitors Alumni/Alumnae Openings Research Thrusts Demo Resources Useful Links Opportunities Publication By Year By Area By Type Education Courses Mentoring Return to Skip Menu Main Content Wenjing Lou W. C. English Endowed Professor of Computer ScienceProfessor of Electrical and Computer Engineering (by Courtesy)IEEE Fellow, ACM Fellow Department of Computer Science Virginia Tech, Northern Virginia Center 7054 Haycock Road Falls Church, VA 22043 Office: 304 NVC Tel: 703-538-3774 eMail: wjlou at vt dot edu Link to my Google Scholar profile About Me Wenjing Lou is the W. C. English Professor of Computer Science at Virginia Tech and a Fellow of the IEEE, and ACM. She holds a Ph.D. in Electrical and Computer Engineering from the University of Florida. Her research interests cover many topics in the cybersecurity field, with her current research interest focusing on privacy protection techniques in networked information systems and cross-layer security enhancement in wireless networks. Prof. Lou is currently on the editorial boards of ACM/IEEE Transactions on Networking, IEEE Transactions on Mobile Computing, and Journal of Computer Security. She is the Steering Committee Chair of IEEE Conference on Communications and Network Security (IEEE CNS), which is a conference series in IEEE Communications Society (ComSoc) core conference portfolio and the only ComSoc conference focusing solely on cybersecurity. Prof. Lou served as a program director at the US National Science Foundation (NSF) from August 2014 to August 2017. At NSF, her responsibilities included the Networking Technology and Systems (NeTS) program, a core program of the Computer and Network Systems (CNS) division within the Directorate for Computer & Information Science & Engineering (CISE), and the Secure and Trustworthy Cyberspace (SaTC) program, a cross-cutting security program led by CISE/CNS. Honors and Awards IEEE INFOCOM Achievement Award, 2025 Virginia Tech College of Engineering Dean's Award for Research Excellence, 2024 ACM Fellow for contributions to information and network security, 2023 Virginia Tech Alumni Award for Research Excellence, 2018 Technical Recognition Award for contribution to Information Security and Privacy in Cloud Computing and Wireless Networks, from IEEE Communications Society, Technical Committee on Communications & Information Security, 2016 Virginia Tech College of Engineering Dean's Award for Research Excellence, 2015 IEEE Fellow for contributions in Network and Information Security, 2015 VT College of Engineering Dean's Award for Faculty Fellow, in recognition of extraordinary performance in research, 2014 WPI Sigma Xi Outstanding Junior Faculty Researcher Award, 2009 NSF Faculty Early Career Development (CAREER) Award, 2008 WPI Joseph Samuel Satin Distinguished Fellow for the 2006-07 academic year in recognition of her outstanding accomplishments and promise for future contributions in both teaching and scholarship Paper Awards Best Paper Award for paper \"ProFLingo: A Fingerprinting-based Intellectual Property Protection Scheme for Large Language Models\", by Heng Jin, Chaoyu Zhang, Shanghao Shi, Wenjing Lou, Y. Thomas Hou, in IEEE CNS 2024, Sept 30-Oct 3, 2024, Taipei, Taiwan. Dr. Vanu Bose Best Paper Award from The National Spectrum Consortium for paper \"Out-of-Band Interference Management to Protect Radio Astronomy,\" by Naru Jai, Yi Shi, Luiz DaSilva, Y. Thomas Hou and Wenjing Lou, in IEEE MILCOM 2024 Best Paper Award for paper \"mCore: Achieving Sub-millisecond Scheduling for 5G MU-MIMO Systems\", by Yongce Chen, Yubo Wu, Thomas Hou and Wenjing Lou, in IEEE INFOCOM 2021, May 10-13, 2021, Virtual Conference. IEEE INFOCOM Test-of-Time Paper Award, 2020. IEEE INFOCOM Test of Time Paper Award recognizes papers published between 10 to 12 years ago (a three-year window) in the INFOCOM proceedings that have been most cited and widely recognized to have a significant impact on the research community. Our paper \"Achieving Secure, Scalable, and Fine-Grained Data Access Control in Cloud Computing,\" by S. Yu, C. Wang, K. Ren, and W. Lou in the Proc. of IEEE INFOCOM 2010, was selected to receive this award in 2020. The Fred W. Ellersick MILCOM Award for the Best Paper in the Unclassified Technical Program for paper \"Optimal power control with Channel uncertainty in ad hoc networks,\" authored by S. Li, Y.T. Hou, W. Lou, B. Jalaian, S. Russel, and B. MacCall, in IEEE/AFCEA Military Communications Conference, (MILCOM), Nov 12-14, 2019, Norfolk, VA. Best Student Paper Award for paper \"SHARK-IA: An interference alignment algorithm for multi-hop underwater acoustic networks with large propagation delays,\" co-authored by H. Zeng, Y.T. Hou, Y. Shi, W. Lou, S. Kompella, and S. F. Midkiff, in ACM International Conference on Underwater Networks and Systems (ACM WuWNet'14), Nov. 12â14, 2014, Rome, Italy. Best Student Paper Award for paper \"A secure three-party computational protocol for triangle area,\" co-authored by L. Liu, X. Chen, and W. Lou, in the 19th Australasian Conference on Information Security and Privacy (ACISP 2014), Wollongong, Australia, July 7-9, 2014. Best Paper Award for paper \"Privacy-preserving multi-keyword text search in the cloud supporting similarity-based ranking\", co-authored by W. Sun, B. Wang, N. Cao, M. Li, W. Lou, Y.T. Hou, and H. Li, in the 8th ACM Symposium on Information, Computer and Communications Security (ASIACCS 2013), Hangzhou, China, May 7-10, 2013. This is a very competitive conference, with acceptance rate = 35/216 = 16% in year 2013. Best Paper Award for paper \"On broadcast authentication in wireless sensor networks\", co-authored by Kui Ren, Kai Zeng, Wenjing Lou, and Patrick J. Moran, in the International Conference on Wireless Algorithms, Systems, and Applications (WASA 2006), Xi'an, China, August 15-18, 2006. Best Paper Runner-up Award for paper \"On throughput efficiency of geographic opportunistic routing in multihop wireless networks\", co-authored by Kai Zeng, Wenjing Lou, Jie Yang, and D. Richard Brown III, in the Fourth International Conference on Heterogeneous Networking for Quality, Reliability, Security, and Robustness (QShine 2007), Vancouver, British Columbia, Canada, August 14-17, 2007. Professional Activities Membership IEEE Fellow, 2015 ACM Fellow, 2023 Member of ACM, Tau Beta Pi, and Sigma Xi Journal Editorship Steering Committee Member, IEEE Transactions on Mobile Computing, Jan 2019 ~ Dec 2021 Editor, IEEE Transactions on Dependable and Secure Computing, March 2018 ~ Dec 2022 Editor, IEEE/ACM Transactions on Networking, July 2017 ~ Dec 2020 Editor, IEEE Transactions on Mobile Computing, July 2014 ~ Jan 2019 Editor, Journal of Computer Security, Jan 2014 ~ Dec 2019 Editor, IEEE Wireless Communications Letters, Aug 2011 ~ Dec 2014. Editor, IEEE Transactions on Parallel and Distributed Systems, Jan 2012 ~ Jun 2014. Editor, Wireless Networks, Jan 2011 ~ April 2013. Editor, Computer Networks, Nov 2009 ~ Oct 2012. Editor, IEEE Transactions on Smart Grid, March 2010 ~ Feb 2012. Editor, IEEE Transactions on Wireless Communications, Jan 2007 ~ Dec 2011. Guest Editor, International Journal of Wireless Information Networks, special issue on Mobile Ad-hoc and Sensor Systems, 2006. Conference Steering or Organizing Committee TPC Chair, ACM WiSec 2020 TPC Chair, SecureComm 2019, October 23-25, 2019, Orlando, FL, USA. TPC Chair, IEEE INFOCOM 2019, April 29-May 02, 2019, Paris, France. Steering Committee Chair, IEEE Conference on Communications and Network Security (IEEE CNS). Steering Committee Member, International Workshop on Security and Privacy in Cloud Computing (SPCC). TPC Vice Chair, Networking and Mobile Computing Track, International Conference on Parallel Processing (ICPP 2014), September 8-13, 2014, Minneapolis, MN, USA.Panel Chair, IEEE INFOCOM 2014, April 27-May 2, 2014, Toronto, CanadaTPC Chair, First IEEE Conference on Communications and Network Security (IEEE CNS), October 14-16, 2013, Washington DC, USA. Mini-Conference Chair, IEEE INFOCOM 2013, April 14-19, 2013, Turin, Italy TPC Symposium Chair, Communication and Information System Security Symposium, IEEE Global Telecommunications Conference (GLOBECOM 2012), December 3-7, 2012, Anaheim, CA, USA. TPC Co-Chair, International Conference on Security and Cryptography (SECRYPT 2012), July 24-27, Rome, Italy. TPC Symposium Chair, Cloud Computing and Networking Symposium, International Conference on Computing, Networking and Communications (ICNC 2012), Jan 30 - Feb 2, Maui, Hawaii, USA TPC Track Chair, Security and Localization Track, 22nd Annual IEEE International symposium on Personal, Indoor and Mobile Radio Communications (PIMRC 2011), September 11-14, Toronto, Canada. Student Travel Award Chair, IEEE SECON 2011, June 27-30, 2011, Salt Lake City, Utah, USA. TPC Chair, First ICDCS Workshop on Security and Privacy in Cloud Computing (ICDCS-SPCC 2010, in conjunction with ICDCS 2010), June 25, 2010, Genoa, Italy . TPC Symposium Chair, Communication and Information System Security Symposium, IEEE International Conference on Communications (ICC 2010), May 23-27, 2010, Cape Town, South Africa. TPC Track Chair, Network Security and Privacy Track, 18th International Conference on Computer Communications and Networks (ICCCN 2009), August 2-6, 2009, San Francisco, CA. TPC Symposium Chair, General Symposium, IEEE Global Telecommunications Conference (GLOBECOM 2007), Nov 26-30, 2007, Washington DC, USA. Publicity Chair, International Conference on Broadband Communications, Networks, and Systems (BroadNets 2006), October 9-13, 2006, San Jose, CA, USA. TPC Vice Chair, International Conference on Embedded Software and Systems (ICESS-2005), December 16-18, 2005, Xi'an, P.R.China. Finance/Registration Chair, IEEE International Conferen",
  "content_length": 20353,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:18"
}