{
  "name": "Wenjia Li",
  "homepage": "https://site.nyit.edu/bio/wli20",
  "status": "success",
  "content": "Wenjia Li | New York Tech Staff & Faculty Directory Wenjia Li Associate Professor; Computer Science, College of Engineering & Computing Sciences Education Credentials: Ph.D.Expertise: Cybersecurity, Networking, Mobile ComputingJoined New York Tech: 2014 Wenjia Li has been a tenure-track assistant professor of computer science at New York Institute of Technology since fall 2014. Prior to joining New York Tech, Li was a tenure-track assistant professor at Georgia Southern University. He obtained his Ph.D. in computer science from University of Maryland Baltimore County in August 2011. His master’s degree in computer science (2005) and a bachelor’s degree in telecommunications engineering (2002) are from Hunan University, China. Li’s main research areas are cybersecurity, networking, and mobile computing. He studies trust management policies in wireless networks; cyber-physical systems (such as intelligent transportation systems); the internet of things; and Android mobile devices. Li has published over 70 research papers in peer-reviewed journals and conference proceedings. His research is supported by the U.S. National Institutes of Health (NIH); the U.S. Department of Transportation; and Northrop Grumman Corporation. He is a recipient of the 2019 IEEE Region 1 Technological Innovation (Academic) Award. Li has served his profession in various ways. A member of both the Association for Computing Machinery (ACM) and the Institute of Electrical and Electronics Engineers (IEEE), he has been a U.S. National Science Foundation panelist since 2015. He has served on organizing committees for conferences including ACM WiSec, IEEE Sarnoff Symposium, IEEE IPCCC, IEEE MDM, IEEE DySPAN, and IEEE CyberSciTech. He also served on program committees for well-known conferences IEEE INFOCOM, IEEE GLOBECOM, IEEE ICC, IEEE WCNC, IEEE IPCCC, IEEE VTC, IEEE MDM, and others. In addition, Li has reviewed papers for many top-tier peer-reviewed journals (IEEE Transactions on Parallel and Distributed Systems, IEEE Transactions on Wireless Communications, IEEE Transactions on Dependable and Secure Computing, IEEE Internet of Things, and IEEE Transactions on Information Forensics and Security, among others). Recent Research Projects (Externally Funded) “Development of LC/MS-Based Direct RNA Sequencing with Concomitant Basecalling and Modification Analysis Capability,” $568,800, NIH Exploratory/Developmental Research Grant Award (R21), PI (with contact PI Shenglong Zhang, associate professor in Biological and Chemical Sciences, New York Institute of Technology), 2017–2020 “Security Analysis of Mobile Applications Based on Text Mining and Analytics,” $15,000, Northrop Grumman Mini Grant, PI, 2017–2018 “Securing Inter-Vehicular Networks with Time and Driver Identity Considerations,” $75,000, U.S. Department of Transportation Region II University Transportation Research Center, PI, 2016–2018 “Secure and Private Sensing for Driver Authentication and Transportation Safety,” $77,430, U.S. Department of Transportation Region II University Transportation Research Center, co-PI (with PI Jonathan Voris), 2015–2017. Selected Publications Ning Zhang, Shundi Shi, Tony Z Jia, Ashley Ziegler*, Barney Yoo, Xiaohong Yuan, Wenjia Li, Shenglong Zhang, “A general LC-MS-based RNA sequencing method for direct analysis of multiple-base modifications in RNA mixtures,” Nucleic Acids Research, Oxford University Press, September 3, 2019 (2018 SCI Impact Factor: 11.147). Feng Zeng, Yongzheng Ren, Xiaoheng Deng, Wenjia Li, “Cost-effective edge server placement in wireless metropolitan area networks,” Sensors, Multidisciplinary Digital Publishing Institute, Vol. 19, No. 1, January 2019 (2018 SCI Impact Factor: 3.031). Wenjia Li, Houbing Song, Feng Zeng, “Policy-based Secure and Trustworthy Sensing for Internet of Things in Smart Cities,” IEEE Internet of Things, vol. 5, no. 2, pp. 716–723, April 2018 (2018 SCI Impact Factor: 9.515). Yupeng Hu, Yonghe Liu, Wenjia Li, Nong Xiao, Zheng Qin, Shu Yin, “Unequal Failure Protection Coding Technology for Distributed Cloud Storage Systems,” IEEE Transactions on Could Computing, published online in December 2017 (2018 SCI Impact Factor: 5.967). Wenjia Li, Houbing Song, “ART: An Attack-Resistant Trust Management Scheme for Securing Vehicular Ad Hoc Networks,” IEEE Transactions on Intelligent Transportation Systems, vol.17, no. 4, pp. 960–969, April 2016 (2018 SCI Impact Factor: 5.744). Honors and Awards 2019 IEEE Region 1 Technological Innovation (Academic) Award, September 2019 Best Poster Award, 2014 IEEE 11th International Conference on Mobile Ad Hoc and Sensor Systems (MASS 2014), Philadelphia, Penn., October 2014 Courses Taught at New York Tech CSCI 125: Computer Programming I (Undergraduate) CSCI 185: Computer Programming II (Undergraduate) CSCI 260: Data Structures (Undergraduate) CSCI 318: Programming Language Concepts (Undergraduate) CSCI 621: Programming Languages (Graduate) CSCI 651: Algorithm Concepts (Graduate) CSCI 665: Software Engineering (Graduate) Contact Information Email: wli20@nyit.edu Phone: 646.273.6016 Office: New York, NY Website: https://scholar.google.com/citations?hl=en&user=DDsDx6UAAAAJ&view_op=list_works&sortby=pubdate By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 5343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:15"
}