{
  "name": "Wenjing Zhang 0002",
  "homepage": "https://www.uoguelph.ca/computing/people/wenjing-zhang",
  "status": "success",
  "content": "Wenjing Zhang | School of Computer Science Wenjing Zhang Assistant ProfessorEmail: wzhang25@uoguelph.caOffice: Reynolds 3319Website links: AI SecurityGoogle ScholarLinkedIn Research StatementResearch KeywordsSelected Publications My research interests are centered around cybersecurity and machine learning, with a strong focus on the cross-disciplinary areas combining security, privacy, and machine learning. My research is twofold: on one hand, I explore the application of machine learning to address security and privacy issues; on the other, I am dedicated to developing secure and privacy-preserving machine learning models. Cybersecurity Federated Learning Reinforcement Learning Generative Adversarial Networks (GANs) Data Security & Privacy Information-Theoretic Privacy Privacy Enhancing Technologies Conference Papers 1. Haonan Yan, Wenjing Zhang, Qian Chen, Xiaoguang Li, Wenhai Sun, Hui Li and Xiaodong Lin, “RECESS Vaccine for Federated Learning: Proactive Defense Against Model Poisoning Attacks,” 37th Conference on Neural Information Processing Systems (NeurIPS 2023). Accepted. Journal Papers 1. Wenjing Zhang, Bo Jiang, Ming Li, and Xiaodong Lin, “Privacy-Preserving Aggregate Mobility Data Release: An Information Theoretic Deep Reinforcement Learning Approach,” IEEE Transactions on Information Forensics and Security (TIFS), 17, pp. 849-864, 2022. 2. Wenjing Zhang, Ming Li, Ravi Tandon, and Hui Li, “Online Location Trace Privacy: An Information Theoretic Approach,” IEEE Transactions on Information Forensics and Security (TIFS), 14(1), pp. 235-250, 2018. 3. Haonan Yan, Xiaoguang Li, Wenjing Zhang, Qian Chen, Hui Li, and Xiaodong Lin, “CODER: Protecting Privacy in Image Retrieval with Differential Privacy,” IEEE Transactions on Dependable and Secure Computing (TDSC), Accepted, 2024. 4. Jie Feng, Wenjing Zhang, Qingqi Pei, Jinsong Wu, and Xiaodong Lin, “Heterogeneous Computation and Resource Allocation for Wireless Powered Federated Edge Learning Systems,” IEEE Transactions on Communications, 70(5), pp. 3220-3233, 2022. 5. Haonan Yan, Xiaoguang Li, Wenjing Zhang, Rui Wang, Hui Li, Xingwen Zhao, Fenghua Li, and Xiaodong Lin, “Automatic Evasion of Machine Learning-based Network Intrusion Detection Systems,” IEEE Transactions on Dependable and Secure Computing (TDSC), 2023. 6. Qian Chen, Zilong Wang, Wenjing Zhang, and Xiaodong Lin, “PPT: A Privacy-Preserving Global Model Training Protocol for Federated Learning in P2P Networks,” Computers & Security, 124, 2023, Art. no. 102966. 7. Wenjing Zhang, Bo Jiang, Ming Li, Ravi Tandon, Qiao Liu, and Hui Li, “Aggregation-based Location Privacy: An Information Theoretic Approach,” Computers & Security, 97, 2020, Art. no. 101953. Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 2797,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:18"
}