{
  "name": "Wenjuan Tang",
  "homepage": "http://csee.hnu.edu.cn/people/tangwenjuan",
  "status": "success",
  "content": "唐文娟-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 唐文娟 我的位置在： 首页 > 学院概况 > 师资力量 > 唐文娟 教师介绍 唐文娟，博士，副教授。目前主要研究方向为边缘智能安全攻防、网络计算安全、物联网安全和应用密码学等。以第一作者及通信作者 IEEE INFOCOM、 IEEE TMC、IEEE TMM、IEEE IoT-J等国际权威期刊发表论文20余篇。先后担任 IEEE Globecom 2018、IEEE IoP 2018及IEEE UIC 2018等国际会议的TPC Member，担任 IEEE TMC、IEEE TIFS、IEEE TDSC、IEEE IoT-J、IEEE TVT及INFOCOM等国际权威期刊和会议的审稿人。 中文名： 唐文娟 英文名： 学历： 博士 职称： 副教授 联系电话： 电子邮件： wenjuantang@hnu.edu.cn 研究方向： 边缘智能安全；数据安全；物联网安全；应用密码学等 联系地址： 湖南大学信息科学与工程学院351室 所属机构： 网络空间安全系 学院教师 教育背景 [1]  中南大学                 本硕博                   指导老师：张尧学[2]  加拿大滑铁卢大学    联合培养               指导老师：沈学民 学术论文 W. Huang, Wenjuan Tang*, H. Jiang, and Y. Zhang. Recognizing Voice Spoofing Attacks Via Acoustic Nonlinearity Dissection for Mobile Devices”, IEEE TMC,DOI: 10.1109/TMC.2024.3411791, 2024.(CCF A 类期刊)X.Li, L.Wang, Wenjuan Tang, Y. Wang, X. Liao, X. Yang, “Segmented Hash-based Privacy-Preserving Image Retrieval Scheme in Cloud-Assisted IoT”, IEEE Internet of Things Journal, 2024.(SCI，中科院一区期刊)W. Chen, Wenjuan Tang*, Y. Meng, Y. Zhang, “An HASM-Assisted Voice Disguise Scheme for Emotion Recognition of IoT-enabled Voice Interface”, IEEE Internet of Things Journal, 2024.(SCI，中科院一区期刊)P.Xi, Wenjuan Tang, S. Peng, “Fighting Fire with Fire: Medical AI Models Defend Against Backdoor Attacks via Self-Learning”, In ISBRA, 2024.P. Xi, Wenjuan Tang*, K. Xie, X. Liu, P. Zhao, S. Peng*, \"RobustHealthFL: Robust Strategy Against Malicious Clients in Non-iid Healthcare Federated Learning\", IEEE BIBM, 2023. (CCF B 类会议)W. Huang, Wenjuan Tang*, H. Chen, H. Jiang, Y. Zhang. “Unauthorized Microphone Access Restraint Based on User Behavior Perception in Mobile Devices”, IEEE TMC, 2022. (CCF A 类期刊)W. Huang, Wenjuan Tang*, K. Zhang, H. Zhu,, and Y. Zhang. “Thwarting Unauthorized Voice Eavesdropping via Touch Sensing in Mobile Systems.”, IEEE INFOCOM, 2022.(CCF A 类会议)W. Huang, Wenjuan Tang*, H. Jiang, J. Luo, and Y. Zhang. “Stop deceiving! aneffective defense scheme against voice impersonation attacks on smart devices.” IEEE Internet of Things Journal, DOI: 10.1109/JIOT.2021.3110588, 2021.(SCI，中科院一区期刊)Hao, Jialu, Cheng Huang, Wenjuan Tang, Yang Zhang, and Shuai Yuan. “Smart Contract-based Access Control through Off-chain Signature and On-chain Evaluation.” IEEE Transactions on Circuits and Systems II: Express Briefs，DOI: 10.1109/TCSII.2021.3125500，2021.J. Hao, Wenjuan Tang*, C. Huang, J. Liu, H. Wang, and M. Xian.  “Secure Data Sharing with Flexible User Access Privilege Update in Cloud-assisted IoMT,”  IEEE Transactions on Emerging Topics in Computing, DOI:10.1109/TETC.2021.3052377, 2021. Wenjuan Tang, Kuan Zhang, Ju Ren, Yaoxue Zhang, and Xuemin (Sherman) Shen.“Flexible and Efficient Authenticated Key Agreement Scheme for BANs Based on Physiological Features”, IEEE Transactions on Mobile Computing, 2019, 18(4): 845-856. (SCI, CCF A类期刊)Wenjuan Tang, Ju Ren,and Yaoxue Zhang. “Enabling Trusted and Privacy-preserving Healthcare Services in Social Media Health Networks”, IEEE Transactions on Multimedia, 2019, 21(3): 579 – 590. （CCF B，中科院一区期刊）Wenjuan Tang, Kuan Zhang, Ju Ren, Yaoxue Zhang, and Xuemin (Sherman) Shen. “Privacy-preserving Task Recommendation with Win-win Incentives for Mobile Crowdsourcing”, Information Sciences, DOI：10.1016/j.ins.2019.02.011. (SCI，中科院一区期刊)Wenjuan Tang, Ju Ren, Kun Deng, Yaoxue Zhang. “Secure Data Aggregation of Lightweight E-healthcare IoT Devices with Fair Incentives”, IEEE Internet of Things Journal, 2019, 6(5), 8714-8726. (SCI, 中科院一区期刊)Wenjuan Tang, Ju Ren, Kuan Zhang, Deyu Zhang, Yaoxue Zhang and Xuemin (Sherman) Shen, “Efficient and Privacy-preserving Fog-assisted Health Data Sharing Scheme”, ACM Transactions on Intelligent Systems and Technology, 2019, 10(6), p.68. Wenjuan Tang, Kuan Zhang, Deyu Zhang, Ju Ren, Yaoxue Zhang and Xuemin (Sherman) Shen, “Fog-enabledSmart Health: Towards Cooperative and Secure Healthcare Service Provision”, IEEE Communications Magazine, 2019, 57(5):42–48. (SCI, 中科院一区)Feng Lyu, Ju Ren, Peng Yang, Nan Cheng, Wenjuan Tang*, Yaoxue Zhang, and Xuemin (Sherman) Shen, “Fine-Grained TDMA MAC Design Towards Ultra-Reliable Broadcast for Autonomous Driving”, IEEE Wireless Communications, 2019, 26(4):46–53. (SCI, 中科院一区)Wenjuan Tang, Kuan Zhang, Ju Ren, Yaoxue Zhang, Xuemin (Sherman) Shen. “Lightweight and Privacy-preserving Fog-assisted Information Sharing Scheme for Health Big Data”, In Proc. of IEEE Globecom, 2017. Kaichuan Zhao, Yuezhi Zhou, Wenjuan Tang, Shuang Li, and Yaoxue Zhang. “A Game Theoretic D2D Local Caching System under Heterogeneous Video Preferences and Social Reciprocity”, In Proc. of ICA3PP, 2018. 科研状况 2023-2025，面向物联网联动安全的数据最小约束关键技术研究，国家自然科学基金，主持。2021-2023，端边云协同的数据安全关键技术研究，湖南省自然科学基金，主持。2019–2024，物联网系统中的协作安全机制研究，中央高校基本科研业务项目，主持。 学生培养 团队成员正在招募中！热烈欢迎对信息安全方向感兴趣，尤其是有志于大数据安全、人工智能安全、网络计算安全、物联网安全及应用密码学研究的同学积极与我联系，开展科研学术合作。希望你对科研有热情，学习刻苦有进取心，爱钻研爱思考。如有本科生对安全相关课题感兴趣的，也可以加入团队。将为学生提供完善的实验室环境，开放和谐友爱的科研氛围以及科研助研津贴。对于发表高水平论文等取得一定科研成果的学生，将提供额外科研奖励。对于发表国际高水平学术会议论文的学生，极力资助出国开会。对于想出国继续深造的学生，将通过多种渠道极力争取并推荐其往国外一流大学深造。 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 5545,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:16"
}