{
  "name": "Wenjie Zhang 0001",
  "homepage": "http://www.cse.unsw.edu.au/~zhangw",
  "status": "success",
  "content": "Wenjie Zhang - Wenjie Zhang Wenjie Zhang Professor, ARC Future Fellow Head of Data and Knowledge Research Group Deputy Head of School (Research) at School of Computer Science and Engineering The University of New South Wales Follow Email LinkedIn Google Scholar Wenjie Zhang is a Professor, ARC Future Fellow, Head of the Data and Knowledge Research GroupÂ and Deputy Head of School (Research) in the School of Computer Science and Engineering, the University of New South Wales, Australia. Her research interests include spatial-temporal data analysis, uncertain data analysis and graph data processing. Since 2008, she has published more than 160Â papers in top venues such asÂ TKDE, TODS, VLDBJ, SIGMOD, VLDB, and ICDE. She received the Australian Research Council Future Fellowship (FT3) in 2021 and Discovery Early Career Researcher Award in 2011. In 2019, she received the Chris Wallace Award for her significant contributions to large-scale graph data processing. Her research has been well supported by 12 Australian Research Council grants and several industry funded projects. Wenjie is an Associate Editor for IEEE Transactions on Knowledge and Data Engineering and The VLDB Journal, as served as the PC Chair for ICDE 2025 and area chair for VLDB 2022/2023 and ICDE 2019/2023.Â Her work received more than 18 Best Papers from international conferences including Best Papers of SIGMOD 2020, ICDE 2013/2012/2010, and ACM Research Highlight Award 2021.Â Wenjie is a Fellow of the ACS (Australian Computer Society).Â Mutiple PhD scholarships (living allowance around \\$35k-\\$40k/year plus tuition fee waive) available. Send me an email (wenjie.zhang at unsw.edu.au) with your CV if you would like to pursue PhD degree in the area of large-scale dynamicÂ data analytics and processing.Â Current undergraduate students or master by course students in UNSW are encouraged to contact me if you are interested in research degrees (Master by research or PhD) or research projects (honors thesis project or master research project).Â I serve as a PC Chair for ICDE 2025.",
  "content_length": 2071,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:17"
}