{
  "name": "Wenjie Pei",
  "homepage": "https://wenjiepei.github.io",
  "status": "success",
  "content": "Wenjie Pei (裴文杰) About Me Wenjie Pei is a Professor with the Harbin Institute of Technology, Shenzhen, China. He got his Ph.D. at Pattern Recognition and Computer Vision Lab, Delft University of Technology and worked with Prof. David Tax (TU Delft) and Dr. Laurens van der Maaten (Facebook AI Research). Before joining Harbin Institute of Technology, he was a Senior Researcher on Computer Vision at Tencent Youtu X-Lab. In 2016, he was a visiting scholar with the Carnegie Mellon University (CMU). His research interests lie in Computer Vision and Pattern Recognition including sequence modeling, deep learning, image synthesis, few-shot learning, etc. Download my [CV] for more information. Collaborations: I am always looking for highly self-motivated students, including undergraduate, graduate and PhD students, for research collaborations on Computer Vision and Machine Learning. Feel free to contact me with your CV. News 06/2025, three paper was accepted by ICCV. 03/2025, two paper was accepted by CVPR. 07/2024, three paper was accepted by ECCV. 07/2023, one paper was accepted by ICCV. 07/2023, three paper was accepted by ACM MM. 03/2023, one paper was accepted by TVCG. 12/2022, one paper was accepted by TNNLS. 09/2022, one paper was accepted by NeurIPS. 07/2022, one paper was accepted by IJCV. 07/2022, three papers were accepted by ECCV. 06/2022, two paper were accepted by ACM MM (one oral). 06/2022, one paper was accepted by TIP. 03/2022, one paper was accepted by CVPR. 02/2022, one paper was accepted by ACL. 12/2021, one paper (on speech separation) was accepted by TASLP. 07/2021, two papers were accepted by ICCV. 04/2021, one paper (on image background restoration, including reflection/raindrop/haze removal) was accepted by TIP. 04/2021, one paper (on visual tracking) was accepted by TMM. 10/2020, one paper (on person Re-ID) was accepted by TIP. 07/2020, one paper is accepted by ACM MM, 2020. 07/2020, two papers are accepted by ECCV (one spotlight), 2020. 01/2020, I joined Harbin Institute of Technology, Shenzhen. 10/2019, one paper (on age estimation) was accepted by TIP. 07/2019, two papers were accepted by ICCV (one oral), 2019. 07/2019, one paper was accepted by BMVC (oral), 2019. 03/2019, one paper was accepted by CVPR, 2019. 07/2018, I joined Tencent Youtu X-Lab. 06/2018, I successfully defended my Ph.D. Thesis and became Dr.! 08/2017, one full paper was accepted by CIKM, 2017. 07/2017, I participated in Doctoral Consortium in CVPR 2017, mentored by Dr. Kaiming He. 03/2017, one paper was accepted by CVPR, 2017. 01/2017, one paper was accepted by TNNLS. Education Background 10/2013 - 10/2017: Delft University of Technology (TU Delft), the Netherlands. PhD candidate in Pattern Recognition and Computer Vision Lab. Research area: Machine Learning and Computer Vision, supervised by Prof. David Tax and Dr. Laurens van der Maaten. 08/2011 - 08/2013: Eindhoven University of Technology (TU/e), the Netherlands. Master of Computer Science and Engineering. Research area: Data Mining, supervised by Prof. Toon Calders. 09/2008 - 03/2011: ZheJiang University (ZJU), China. Master of Computer Science and Technology in State Key Lab of CAD&CG. Research area: Computer Graphics and Visualization, supervised by Prof. Jin Huang and Prof. Hujun Bao. 09/2004 - 06/2008: Shanghai JiaoTong University (SJTU), China. Bachelor of Computer Science and Engineering. Bachelor of Business Administration. Experience 01/2024 - present, Harbin Institute of Technology, Shenzhen. Professor. 01/2022 - 12/2023, Harbin Institute of Technology, Shenzhen. Associate Professor. 01/2020 - 12/2021, Harbin Institute of Technology, Shenzhen. Assistant Professor. 07/2018 - 12/2019, Tencent Youtu X-Lab. Senior Researcher. 07/2016 - 12/2016, Carnegie Mellon University. Visiting Scholar in Language Technolgy Institute (LTI). Supervisors: Prof. Louis-Philippe Morency and Dr. Tadas Baltrušaitis. 03/2013 - 08/2013, Philips Research Eindhoven. Intern. Research Interest Few-shot Learning Large vision models Image Synthesis video/image captioning Sequence (Time Series) Modelling Object tracking Publications PhD Thesis Wenjie Pei. Models for Supervised Learning On Sequence Data. Delft University of Technology, 2018. * denotes corresponding author while # indicates equal contribution. Wenjie Pei#*, Qizhong Tan#, et al. D2ST-Adapter: Disentangled-and-Deformable Spatio-Temporal Adapter for Few-shot Action Recognition. ICCV, 2025. Yanchen Liu, Yanan Sun, Wenjie Pei*, et al. MotionShot: Adaptive Motion Transfer across Arbitrary Objects for Text-to-Video Generation. ICCV, 2025 Zhenhua Ning, Zhuotao Tian, Wenjie Pei*, et al. Enhancing Spatial Reasoning in Multimodal Large Language Models through Reasoning-based Segmentation. ICCV, 2025 Zhengyao Fang, Pengyuan Lv, Jingjing Wu, Chengquan Zhang, Jun Yu, Wenjie Pei*. Recognition-Synergistic Scene Text Editing. CVPR, 2025. Yushuai Sun, Zikun Zhou, Dongmei Jiang, Yaowei Wang, Jun Yu, Guangming Lu, Wenjie Pei*. Learning Compatible Multi-Prize Subnetworks for Asymmetric Retrieval. CVPR, 2025. Jiapeng Su, Qi Fan, Guangming Lu, Fanglin Chen, Wenjie Pei*. Domain-Rectifying Adapter for Cross-Domain Few-Shot Segmentation. CVPR, 2024. Wenjie Pei#, Weina Xu#, Zongze Wu, Weichao Li, Jinfan Wang, Guangming Lu, Xiangrong Wang*. Saliency-Aware Regularized Graph Neural Network. Artificial Intelligence (AIJ), 2024. Honghu Pan, Wenjie Pei, Xin Li, Zhenyu He. Unified Conditional Image Generation for Visible-Infrared Person Re-Identification. IEEE Transactions on Information Forensics and Security (TIFS), 2024. Zikun Zhou, Kaige Mao, Wenjie Pei, Hongpeng Wang, Yaowei Wang, Zhenyu He. Reliability-Hierarchical Memory Network for Scribble-Supervised Video Object Segmentation. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2024. Jing Xu, Xinglin Pan, Jingquan Wang, Wenjie Pei, Qing Liao, Zenglin Xu. CORE: CORrelation-guided Feature Enhancement for Few-shot Image Classification. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2024. Jingjing Wu, Zhengyao Fang, Pengyuan Lyu, Chengquan Zhang, Fanglin Chen, Guangming Lu, Wenjie Pei*. WeCromCL: Weakly Supervised Cross-Modality Contrastive Learning for Transcription-only Supervised Text Spotting. ECCV, 2024. Shuang Wu, Songlin Tang, Guangming Lu, Jianzhuang Liu, Wenjie Pei*. UniVoxel: Fast Inverse Rendering by Unified Voxelization of Scene Representation. ECCV, 2024. Yanan Sun, Yanchen Liu, Yinhao Tang, Wenjie Pei, Kai Chen. AnyControl: Create Your Artwork with Versatile Control on Text-to-Image Generation. ECCV, 2024. Wenjie Pei#, Tongqi Xia#, Fanglin Chen, Jiandong Tian, Guangming Lu*. Spatially Aligned-and-Adapted Visual Prompting. AAAI, 2024. Jingwen Zhang#, Zikun Zhou#, Guangming Lu, Jiandong Tian, Wenjie Pei*. Robust 3D Tracking with Quality-Aware Shape Completion. AAAI, 2024. Xin Feng, Yifeng Xu, Guangming Lu*, Wenjie Pei*. (*corresponding authors.) Hierarchical Contrastive Learning for Pattern-Generalizable Image Corruption Detection. ICCV, 2023. Songlin Tang, Wenjie Pei*, Xin Tao, Tanghui Jia, Guangming Lu, Yu-Wing Tai. (*corresponding author.) Scene-generalizable Interactive Segmentation of Radiance Fields. ACM MM, 2023. Zhenhua Ning, Zhuotao Tian, Guangming Lu, Wenjie Pei*. (*corresponding author.) Boosting Few-shot 3D point cloud segmentation via query-guided enhancement. ACM MM, 2023. Huimin Zeng, Weinong Wang, Xin Tao, Zhiwei Xiong, Yu-Wing Tai, Wenjie Pei*. (*corresponding author.) Feature Decoupling-Recycling Network for Fast Interactive Segmentation. ACM MM, 2023. Jing Li, Di Kang, Wenjie Pei, Xuefei Zhe, Ying Zhang, Linchao Bao, Zhenyu He. Audio2Gestures: Generating Diverse Gesturesfrom Audio. TVCG, 2023 (extended from ICCV 2021). Jing Xu, Xu Luo, Xinglin Pan, Wenjie Pei, Yanan Li and Zenglin, Xu. Alleviating the Sampling Bias of Few Shot Data by Removing Projection to the Centroid. NeurIPS, 2022. Wenjie Pei#, Xin Feng#, Canmiao Fu, Qiong Cao, Guangming Lu and Yu-wing Tai. (#both authors contributed equally). Learning Sequence Representations by Non-local Recurrent Neural Memory. International Journal of Computer Vision (IJCV), 2022. Xin Li#, Wenjie Pei#, _Zikun Zhou, Zhenyu He, Huchuan Lu, Ming-Hsuan Yang. (#both authors contributed equally) Self-Supervised Tracking via Target-Aware Data Synthesis. TNNLS, 2022. Shuang Wu, Wenjie Pei*, Dianwen Mei, Fanglin Chen, Jiandong Tian, Guangming Lu*. (*corresponding authors.) Multi-Faceted Distillation of Base-Novel Commonality for Few-shot Object Detection. ECCV, 2022. Wenjie Pei#, Shuang Wu#, Dianwen Mei, Fanglin Chen, Jiandong Tian, Guangming Lu. (#both authors contributed equally). Few-Shot Object Detection by Knowledge Distillation Using Bag-of-Visual-Words Representations. ECCV, 2022. Qi Fan, Wenjie Pei*, Yu-Wing Tai, Chi-Keung Tang. (*corresponding authors.) Self-Support Few-Shot Semantic Segmentation. ECCV, 2022. JingJing Wu, Pengyuan Lyu, Guangming Lu, Chengquan Zhang, Kun Yao and Wenjie Pei*. (*corresponding authors.) Decoupling Recognition from Detection: Single Shot Self-Reliant Scene Text Spotter. ACM MM, Oral, 2022. Fengjun Li, Xin Feng, Fanglin Chen, Guangming Lu, and Wenjie Pei*. (*corresponding authors.) Learning Generalizable Latent Representations for Novel Degradations in Super-Resolution. ACM MM, 2022. Zebin Lin, Wenjie Pei*, Fanglin Chen, David Zhang and Guangming Lu*. (* corresponding author.) Pedestrian Detection by Exemplar-Guided Contrastive Learning. IEEE Transactions on Image Processing (TIP), 2022. Zikun Zhou, Jianqiu Chen, Wenjie Pei*, Kaige Mao, Hongpeng Wang, Zhenyu He*.(*corresponding authors). Global Tracking via Ensemble of Local Trackers. CVPR, 2022. Bin Liang, Chenwei Lou, Xiang Li, Min Yang, Lin Gui, Yulan He, Wenjie Pei, Ruifeng Xu. Multi-Modal Sarcasm Detection via Cross-Modal Graph Convolutional Network. ACL, 2022. Zengwei Yao, Wenjie Pei*, Fanglin Chen, Guangming Lu*, David Zhang. (* corresponding authors.) Stepwise-Refining Speech Separation Network via Fine-Grained E",
  "content_length": 14059,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:14"
}