{
  "name": "Wenliang Chen",
  "homepage": "http://hlt.suda.edu.cn/index.php/Wenliang",
  "status": "success",
  "content": "Wenliang - SUDA-HLT Wenliang 来自SUDA-HLT 跳到导航 跳到搜索 目录 1 陈文亮主页 2 个人简历 3 主要研究领域 4 共享数据/工具 5 最新论文 6 正式发表论文 7 在读学生 8 毕业学生列表(第一次工作去向) 陈文亮主页 苏州大学，计算机科学与技术学院，苏州大学人类语言技术研究所，教授/博士生导师 联系方式：wlchen at suda.edu.cn 常年招收博士生和硕士生/苏州大学人类语言技术研究所招收研究生和本科生说明 最新信息可以访问 个人主页@github 个人简历 2013年1月加入苏州大学计算机科学与技术学院。2005年-2010年在日本国立情报通信研究所担任专家研究员。2011年-2012年在新加坡国立信息通讯研究所担任研究科学家。1995年-2005年在东北大学学习，分别于1999年7月、2002年4月、2005年4月获得学士、硕士、博士学位。 主要研究领域 人工智能->自然语言处理->信息抽取、知识图谱、问答系统。 信息抽取：面向专业领域的实体识别、关系抽取、事件抽取，为知识图谱构建服务。 知识图谱：目标是构建专业领域（如旅游、金融）的知识图谱，为智能问答和推荐系统服务。 问答系统：偏向于基于知识库的问答。 共享数据/工具 文档级事件抽取(速度快、模型小=省时省地方)：PTPCG，论文LINK，代码下载地址 领域情感词典：ECSD，下载地址=https://github.com/zeitiempo/ECSD 人物关系标注数据集：IPRE，下载地址=https://github.com/SUDA-HLT/IPRE 实体关系标注数据集：NYT-H，在NYT远程监督数据基础上，人工对测试集进行标注，可实现准确评价，下载地址=https://github.com/Spico197/NYT-H 中文实体情感知识库：SentiBridge，下载地址=https://github.com/rainarch/SentiBridge 语言分析工具：目标是构建高性能的中英文语言分析工具包。DuDuPlus[开源项目]，下载地址=https://code.google.com/archive/p/duduplus/ 中文CTB语块抽取工具：宾州中文树库抽取中文短语（组块）工具，ChunkLinkCTB，下载地址=https://github.com/rainarch/ChunkLinkCTB 最新论文 Jianxiang Xiang, Zhenhua Liu, Haodong Liu, Yin Bai, Jia Cheng and Wenliang Chen. DiffusionDialog: Diverse Dialog Generation Model with Diffusion in Latent Space. LREC-COLING-2024. Tianwen Tang, Tong Zhu, Haodong Liu, Yin Bai, Jia Cheng and Wenliang Chen. MPPE-DST: Mixture of Prefix Prompt Experts for LLM in Zero-Shot Dialogue State Tracking. LREC-COLING-2024. Junjie Yu, Xing Wang, and Wenliang Chen. Reliable Data Generation and Selection for Low-Resource Relation Extraction. AAAI-2024. (Accepted) 正式发表论文 Tong Zhu, Junfei Ren, Zijian Yu, Mengsong Wu, Guoliang Zhang, Xiaoye Qu, Wenliang Chen, Zhefeng Wang, Baoxing Huai, Min Zhang. Mirror: A Universal Framework for Various Information Extraction Tasks. EMNLP-2023. [ PDF ] and [ CODE ]. 8861–8876. Singapore. Dec. 2023 Mian Zhang, Xiabing Zhou, Wenliang Chen, Min Zhang. Emotion Recognition in Conversation from Variable-Length Context. ICASSP-2023, Rhodes Island, Greece, 2023, pp. 1-5, doi: 10.1109/ICASSP49357.2023.10096161. [PDF] Tong Zhu, Guoliang Zhang, Zechang Li, Zijian Yu, Junfei Ren, Mengsong Wu, Zhefeng Wang, Baoxing Huai, Pingfu Chao and Wenliang Chen. CED: Catalog Extraction from Documents, ICDAR-2023，2023.8, [ PDF and CODE] Mian Zhang, Lifeng Jin, Linfeng Song, Haitao Mi, Wenliang Chen and Dong Yu. SafeConv: Explaining and Correcting Conversational Unsafe Behavior. ACL-2023. [ PDF]. pp22–35, Toronto, Canada. July 2023 Yixin Ji, Jikai Wang, Juntao Li, Qiang Chen, Wenliang Chen and Min Zhang. Early Exit with Disentangled Representation and Equiangular Tight Frame. ACL-2023(Findings).[ PDF]. pp14128–14142, Toronto, Canada. July 2023 陈跃鹤、贾永辉、谈川源、陈文亮、张民. 基于知识图谱全局和局部特征的复杂问答方法, 软件学报, Online，2022.9, [PDF] 谈川源、贾永辉、陈跃鹤、陈文亮. 面向知识图谱问答的查询图生成方法，CCKS-2022 (最佳中文论文奖)，[PDF and CODE] Junjie Yu, Xing Wang, Jiangjiang Zhao, Chunjie Yang and Wenliang Chen. STAD: Self-Training with Ambiguous Data for Low-Resource Relation Extraction. COLING-2022. [PDF] and [CODE] Dan Qiao, Chenchen Dai, Yuyang Ding, Juntao Li, Min Zhang, Wenliang Chen and Qiang Chen. SelfMix: Robust Learning Against Textual Label Noise with Self-Mixup Training. COLING-2022. [PDF and CODE] Yonghui Jia, Chuanyuan Tan, Yuehe Chen, Muhua Zhu, Pingfu Chao and Wenliang Chen. Two-stage Query Graph Selection for Knowledge Base Question Answering. NLPCC-2022. [PDF], pp16–28. Guilin, China. 22 Sep 2022 Tong Zhu, Xiaoye Qu, Wenliang Chen, Zhefeng Wang, Baoxing Huai, Nicholas Yuan, Min Zhang. Efficient Document-level Event Extraction via Pseudo-Trigger-aware Pruned Complete Graph. IJCAI-2022 [PDF], [CODE]. pp4552-4558. Vienna, Austria. 23-29 July 2022 Junjie Yu, Tong Zhu, Wenliang Chen, Wei Zhang and Min Zhang. Improving Relation Extraction with Relational Paraphrase Sentences. COLING2020, pp. 1687-1698. Online, Dec. 2020pdf Tong Zhu, Haitao Wang, Junjie Yu, Xiabing Zhou, Wenliang Chen, Wei Zhang and Min Zhang. Towards Accurate and Consistent Evaluation: A Dataset for Distantly-Supervised Relation Extraction. COLING2020. pp. 6436-6447, Online, Dec. 2020 pdf, 数据下载@github 杨一帆，陈文亮，旅游场景下的实体别名抽取联合模型. 中文信息学报. 2020, 34 (6): 55-63 马进, 杨一帆, 陈文亮, 基于远程监督的人物属性抽取研究. 中文信息学报. 2020, 34 (6): 64-72. 论文和数据下载@github 杨一帆, 马进, 王海涛, 何正球，陈文亮，张民. 基于简介文本的中文人物关系图谱属性补全与纠错. 中国科学-信息科学. V50(7) : 1003-1018(2020) (CCKS-2019 最佳中文论文奖).在线预本 Zhengqiu HE, Wenliang CHEN, Yuyi WANG, Wei ZHANG, Gaochun WANG, Min ZHANG. Improving Neural Relation Extraction with Positive and Unlabeled Learning. Thirty-Third AAAI Conference on Artificial Intelligence (AAAI-2020), pp. 7927-7934. New York, 7-12 Feb. 2020 Haitao Wang, Zhengqiu He, Jin Ma, Wenliang Chen, Min Zhang. IPRE: a Dataset for Inter-Personal Relationship Extraction. NLPCC-2019, pp. 103-115. Dunhuang, China, 9-14 Oct. 2019. pdf@arxiv data@github 周俊佐, 朱宗奎, 何正球, 陈文亮, 张民. 面向人机对话意图分类的混合神经网络模型. 软件学报. 2019,30(11):3313-3325PDF 郁圣卫, 卢奇, 陈文亮. 基于领域情感词典特征表示的细粒度意见挖掘. 中文信息学报. 2019, 33 (2): 112-121.(CCL-2018) 中文信息学报pdf领域情感知识词典+论文下载@github Zhengqiu He, Wenliang Chen, Zhenghua Li, Wei Zhang, Hao Shao, Min Zhang. 2019. Syntax-aware Entity Representations for Neural Relation Extraction. Artificial Intelligence Journal.275(2019):602-617, October 2019.online version Yaosheng Yang, Wenliang Chen, Zhenghua Li, Zhengqiu He and Min Zhang. Distantly Supervised NER with Partial Annotation Learning and Reinforcement Learning, Proceedings of COLING2018, pp.2159–2169, Santa Fe, New Mexico, USA, August 20-26, 2018 (Code and Data) 卢奇, 陈文亮. 大规模中文实体情感知识的自动获取, 中文信息学报, 2018, 32 (8): 32-41 (CCKS-2017,最佳论文提名奖) (论文正式版 数据下载@github) Qi Lu, YaoSheng Yang, Zhenghua Li, Wenliang Chen and Min Zhan. M-CNER: A Corpus for Chinese Named Entity Recognition in Multi-Domains, Proceedings of LREC-2018, pp4458-4461, Japan, May 2018 PDF YaoSheng Yang, Meishan Zhang, Wenliang Chen*, Haofen Wang, Wei Zhang, Min Zhang. Adversarial Learning for Chinese NER from Crowd Annotations, Proceedings of AAAI-2018, pp1627-1634, New Orleans, USA,Feb 2018[C] PDF数据下载@github Zhengqiu He, Wenliang Chen*, Zhenghua Li, Meishan Zhang, Wei Zhang, Min Zhang. SEE: Syntax-aware Entity Embedding for Neural Relation Extraction, Proceedings of AAAI-2018, pp5795-5802, New Orleans, USA,Feb 2018[C] PDF 在读学生 2019博：贾昊 2020博：刘振华（直博） 2021博：朱桐（硕博） 2023博：谈川源（硕博） 2021硕：任俊飞、余子健、项健翔、刘资蕴 2022硕：汤添文、吴孟松、邵文彪 2023硕：韩翰、张翔、熊浩 2024硕：韩泰来、潘豪 毕业学生列表(第一次工作去向) 2017博：郁俊杰（苏州城市学院） 2021硕（2024年）：谈川源（转博）、任俊飞（美团）、余子健（美团）、项健翔（B站）、刘资蕴（百度） 2020硕（2023年）：张智林（美团）、张国梁（OPPO）、陈跃鹤（蚂蚁）、张飞宇（百度）、周沛（南京银行）、张冕（周夏冰老师共同指导，Virginia Tech读博） 2019硕（2022年）：贾永辉（字节）、张世奇（VIVO）、朱桐（转博）、刘振华（直博） 2018硕（2021年）：方晔玮（百度）、马进（美团）、王海涛（华为）、张鹏举（腾讯）、王铭涛（苏大） 2017硕（2020年6月）：郁圣卫、张栋(同花顺)、杨一帆（思必驰）、朱宗奎（华为）、周俊佐（阿里巴巴） 2016硕（2019年6月）：何正球（美团公司）、杨耀晟（阿里巴巴公司） 2015硕（2018年6月）：卢奇(美团公司)、陈伟（爱奇艺公司） 2014硕（2017年6月）：陈志鹏(百度公司)、郁俊杰(苏大读博) 2013硕（2016年6月）：马春平（阿里巴巴公司） 2012本（2016年6月）：何正球（苏大硕）、杨耀晟（苏大硕）、徐执政 取自“http://hlt.suda.edu.cn/index.php?title=Wenliang&oldid=5859” 导航菜单 搜索",
  "content_length": 6838,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:25"
}