{
  "name": "Wenmin Wang 0001",
  "homepage": "https://fie.must.edu.mo/id-1444/person/view/id-536.html",
  "status": "success",
  "content": "創新工程學院 - 學院團隊 - 教研團隊 王文敏 課程主任/教授 所在部門： 計算機科學與工程學院 聯繫電話： 8897 1754 辦公室： A320 電子信箱： wmwang@must.edu.mo Academic QualificationPh.D. in Computer Science and Technology, Harbin Institute of Technology, China, 1989.M.S. in Computer Science and Technology, Harbin Institute of Technology, China, 1986.B.S. in Computer Science and Technology, Harbin University of Science and Technology, China, 1983. Teaching AreaArtificial IntelligenceMachine Learning. Research AreaComputer VisionMultimedia RetrievalArtificial IntelligentMachine Learning. Working Experience2019-Present, Professor/Program Director, School of Computer Science and Engineering, Faculty of Information Technology, Macau University of Science and Technology, Macau, China.2010-2018, Professor/Executive Vice Dean/Dean, School of Electronic and Computer Engineering, Peking University, China; Deputy Director, Guangzhou R&D Center, National Engineering Lab for Video Technology, China; Professor, School of Software Engineering, South China University of Technology, China.2003-2009, Senior Engineer/General Manager, DTV Software Department, Zentek Technology Japan, Inc., Japan.2000-2022, Senior Engineer/Chief Engineer, Liberate Technologies Inc. USA.1992-1999 Section Vice Chief/Staff Engineer, Canotec Co., Inc., Canon Group. Japan.1989-1991, Assistant Professor/Associate Professor, Harbin Institute of Technology, Harbin University of Science and Technology, China. Academic Publication (Selected)1.          Zhibing Wang, Wenmin Wang, Nannan Li, Shenyong Zhang, Qi Chen, Zhe Jiang. \" Multimodal parallel attention network for medical image segmentation.\" Image and Vision Computing, 147, 7, 2024.2.          Li, Ruochen, Wenmin Wang, Huanqiang Hu, Tongbao Chen, and Minglu Zhao. \"Ultrahigh-definition video quality assessment: A New Dataset and Benchmark.\" Neurocomputing, 586, 2024.3.          Tongbao Chen, Wenmin Wang, Minglu Zhao, Ruochen Li, Zhe Jiang, and Cheng Yu. \"SgLFT: Semantic-guided Late Fusion Transformer for video corpus moment retrieval.\" Neurocomputing, 2024.4.          Xinhe Liu, and Wenmin Wang. \"Deep Time Series Forecasting Models: A Comprehensive Survey.\" Mathematics, 12(10), 2024.5.          Honglei Li, Yifan Zhang, and Wenmin Wang. \"Enhanced blind face inpainting via structured mask prediction.\" Pattern Recognition Letters, 179, 2024.6.          Minglu Zhao, Wenmin Wang, Tongbao Chen, Rui Zhang, Ruochen Li. \"TA2V: Text-Audio Guided Video Generation.\" IEEE Trans. on Multimedia (TMM), 26(2), 2024.7.          Yahong Wang, Wenmin Wang, Cheng Yu, Hongbo Sun, and Ruimin Zhang. \"Approximating Partial Differential Equations with Physics-Informed Legendre Multiwavelets CNN.\" Fractal and Fractional, 8(2), 2024.8.          Honglei Li, Yifan Zhang, Wenmin Wang, Shenyong Zhang, and Shixiong Zhang. \"Recovery-Based Occluded Face Recognition by Identity-Guided Inpainting.\" Sensors, 24(2), 2024.9.          Tongbao Chen, Wenmin Wang, Zhe Jiang, Ruochen Li, and Bingshu Wang. \"Cross-Modality Knowledge Calibration Network for Video Corpus Moment Retrieval.\" IEEE Trans. on Multimedia (TMM), 26(1), 2024.10.      Tongbao Chen, Wenmin Wang, Kangrui Han and Huijuan Xu. \"SaGCN: Semantic-aware Graph Calibration Network for Temporal Sentence Grounding.\" IEEE Trans. on Circuits and Systems for Video Technology (TCSVT), 33(6), 2023.11.      Shenyong Zhang, Wenmin Wang, Honglei Li, and Shixiong Zhang. \"Bounding Convolutional Network for Refining Object Locations.\" Neural Computing and Applications, 1-17, 2023.12.      Yahong Wang, Wenmin Wang, Liangcai Mei, Yingzhen Lin, and Hongbo Sun. \"An ε-Approximate Approach for Solving Variable-Order Fractional Differential Equations.\" Fractal and Fractional, 7(1), Jan. 2023.13.      Ruochen Li, Nannan Li and Wenmin Wang. \"Maximizing Mutual Information inside Intra- and Inter-modality for Audio-visual Event Retrieval.\" International Journal of Multimedia Information Retrieval, 12(1). 2023.14.      Shixiong Zhang, Wenmin Wang, Honglei Li, and Shenyong Zhang. \"E-detector: Asynchronous Spatio-temporal for Event-based Object Detection in Intelligent Transportation System.\" ACM Trans. on Multimedia Computing, Communications and Applications, 2023.15.      Shixiong Zhang, Wenmin Wang, Honglei Li, and Shenyong Zhang. \"EventMD: High-Speed Moving Object Detection Based on Event-based Video Frames.\" Pattern Recognition Letter, Accepted, 2023.16.      Cheng Yu, Wenmin Wang, Honglei Li, and Roberto Bugiolacchi. \"Fast 2-step regularization on style optimization for real face morphing.\" Neural Networks, 155, 2022.17.      Honglei Li, Wenming Wang, Cheng Yu, and Shixiong Zhang. \"SwapInpaint: Identity-specific Face Inpainting with Identity Swapping.\" IEEE Trans. on Circuits and Systems for Video Technology (TCSVT), 32(7), 2022.18.      Jianhao Yan, Wenmin Wang, and Cheng Yu. \"Affective word embedding in affective explanation generation for fine art paintings.\" Pattern Recognition Letters, 161, 2022.19.      Shixiong Zhang, Wenmin Wang, Honglei Li, and Shenyong Zhang. \"EVtracker: An Event-Driven Spatiotemporal Method for Dynamic Object Tracking.\" Sensors, 22 (16), 2022.20.      Cheng Yu and Wenmin Wang. \"Fast Transformation of Discriminators into Encoders using Pre-Trained GANs.\" Pattern Recognition Letters, 153, 2022.21.      Xiongtao Chen and Wenmin Wang. “Uni-and-Bi-directional Video Prediction via Learning Object-Centric Transformation.” IEEE Trans. on Multimedia (TMM), 22(6), 2020.22.      Yaxian Xia, Lun Huang, Wenmin Wang, Xiaoyong Wei and Jie Chen. “Exploring Entity-Level Spatial Relationships for Image-Text Matching.” IEEE Int’l Conf. on Acoustics, Speech, and Signal Processing (ICASSP), May 2020.23.      Jinzhuo Wang, Wenmin Wang and Wen Gao. “Fast and Accurate Action Detection in Videos with Motion-Centric Attention Model.” IEEE Trans. on Circuits and Systems for Video Technology (TCSVT), 30(1), 2020.24.      Lun Huang, Wenmin Wang, Yaxian Xia and Jie Chen. “Adaptively Aligned Image Captioning via Adaptive Attention Time.” Advances in Neural Information Processing Systems (NeurIPS), Dec 2019. Vancouver, Canada.25.      Jinzhuo Wang, Wenmin Wang and Wen Gao. “Predicting Diverse Future Frames with Local Transformation-Guided Masking.” IEEE Trans. on Circuits and Systems for Video Technology (TCSVT), 29(12), 2019.26.      Lun Huang, Wenmin Wang, Jie Chen and Xiaoyong Wei. “Attention on Attention for Image Captioning.” IEEE Int’l Conf. on Computer Vision (ICCV), Oct 2019. Seoul, Korea.27.      Jinzhuo Wang, Wenmin Wang and Wen Gao. “Multi-Scale Deep Alternative Neural Network for Large-Scale Video Classification,” IEEE Trans. on Multimedia (TMM), 20(10), 2018.28.      Ruonan Zhang and Wenmin Wang. “Second- and High-order Graph Matching for Correspondence Problem,” IEEE Trans. on Circuits and Systems for Video Technology (TCSVT), 28(10), 2018. BooksWenmin Wang. Principles of Artificial Intelligence (Chinese Edition), Higher Education Press, China. Aug. 2019. PatentsW Wang, M Fan, P Dong, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. Cross-media retrieval method based on deep semantic space. US Patent 11,397,890 (2022)W Wang, Z Li, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. Video action detection method based on convolutional neural network. US Patent 11,379,711 (2022)W Wang, R Zhang, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. MCMC framework-based sub-hypergraph matching method and device. US Patent 11,347,979 (2022)W Wang, Y Zhang, R Wang, G Li, D Shengfu, Z Wang, Y Li, W Gao. Image feature extraction method for person re-identification. US Patent 11,238,274 (2022)W Wang, L Ran, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. Method of bidirectional image-text retrieval based on multi-view joint embedding space. US Patent 11,106,951 (2021)W Wang, Y Zhang, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. Method of using deep discriminate network model for person re-identification in image or video. US Patent 11,100,370 (2021)W Wang, P Dong, M Fan, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. Method for detecting pedestrians in image by using Gaussian penalty. US Patent 11,030,444 (2021)W Wang, H Song, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. Collaborative deep network model method for pedestrian detection. US Patent 10,867,167 (2020)W Wang, L Han, M Fan, R Wang, G Li, D Shengfu, Z Wang, Y Li, H Zhao, W Gao. Cross-media search method. US Patent 10,719,664 (2020)W Wang, R Zhang, R Wang, G Li, D Shengfu, Z Wang, Y Li, W Gao. Method and a device for image matching. US Patent 10,699,156 (2020)W Wang, M Zhen, R Wang, G Li, D Shengfu, Z Wang, Y Li, W Gao. Image representation method and processing device based on local PCA whitening. US Patent 10,424,052 (2019)W Wang, M Zhen, R Wang, G Li, D Shengfu, Z Wang, Y Li, W Gao. Method and a device for extracting local features of a three-dimensional point cloud. US Patent 10,339,409 (2019) Professional Certification and Awards (Selected)National Excellent Online Open Course, China, 2018Teaching Excellence Award, Peking University, China, 2017. Student Awards (Selected)Best Paper Award: Hongmeng Song, Wenmin Wang, Jinzhuo Wang and Ronggang Wang. “Collaborative Deep Networks for Pedestrian Detection,” IEEE Int’l Conf. on Multimedia Big Data (BigMM), 2017. Laguna Hills, California, USA.Best Top 10% Paper Award: Peilei Dong and Wenmin Wang. “Better Region Proposals for Pedestrian Detection with R-CNN,” IEEE Int’l Conf. on Visual Communications and Image Processing (VCIP), 2016. Chengdu, China. Professional Society MembershipSenior Member, Institute of Electrical and Electronics Engineers (IEEE).Senior Member, China Computer Federation (CCF).Member, Association for Computing Machinery (ACM).Member, Chinese Association for Artificial Intelligence (CAAI) TOP",
  "content_length": 9786,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:19"
}