{
  "name": "Wenqi Jiang 0001",
  "homepage": "https://www.comp.nus.edu.sg/cs/people/jiangwq",
  "status": "success",
  "content": "JIANG Wenqi - NUS Computing Skip to content No results JIANG Wenqi Assistant Professor Ph.D. (Computer Science, ETH Zurich, 2025) Wenqi Jiang is an Assistant Professor at the National University of Singapore. Before that, he finished his PhD at ETH Zurich, where he was advised by Gustavo Alonso and Torsten Hoefler. He earned his Master’s degree from Columbia University and his Bachelor’s degree from Huazhong University of Science and Technology. Wenqi works on systems for machine learning, with research spanning the boundaries of data management, computer systems, and computer architecture. Rather than focusing on a single layer of the stack, he works across algorithms, systems, and hardware because the increasing complexity of future machine learning (ML) systems necessitates cross-stack efforts. His research has pioneered several important topics in machine learning systems, including retrieval-augmented generation (RAG), vector search, and recommender systems. He has been recognised as one of the ML and Systems Rising Stars and received the AMD HACC Outstanding Researcher Award. RESEARCH AREAS Database Systems & Networking Artificial Intelligence RESEARCH INTERESTS Systems for ML Data management Computer Architecture Vector Database and Retrieval-Augmented Generation Modern Hardware (CPU, GPU, and FPGA) RESEARCH PROJECTS RESEARCH GROUPS TEACHING INNOVATIONS SELECTED PUBLICATIONS Wenqi Jiang, Suvinay Subramanian, Cat Graves, Gustavo Alonso, Amir Yazdanbakhsh, and Vidushi Dadu \"RAGO: Systematic Performance Optimization for Retrieval-Augmented Generation Serving \" (ISCA'25) Wenqi Jiang, Marco Zeller, Roger Waleffe, Torsten Hoefler, and Gustavo Alonso \"Chameleon: a Heterogeneous and Disaggregated Accelerator System for Retrieval-Augmented Language Models\" (VLDB'25) Wenqi Jiang, Hang Hu, Torsten Hoefler, and Gustavo Alonso \"Fast Graph Vector Search via Hardware Acceleration and Delayed-Synchronization Traversal\" (VLDB'25) Wenqi Jiang, Oleh-Yevhen Khavrona, Martin Parvanov, and Gustavo Alonso \"SwiftSpatial: Spatial Joins on Modern Hardware\" (SIGMOD'25) Wenqi Jiang, Shuai Zhang, Boran Han, Jie Wang, Bernie Wang, and Tim Kraska \"PipeRAG: Fast Retrieval-Augmented Generation via Adaptive Pipeline Parallelism\" (KDD'25) Wenqi Jiang, Shigang Li, Yu Zhu, Johannes de Fine Licht, Zhenhao He, Runbin Shi, Cedric Renggli, Shuai Zhang, Theodoros Rekatsinas, Torsten Hoefler, and Gustavo Alonso \"Co-design Hardware and Algorithm for Vector Search\" (SC'23) Wenqi Jiang, Zhenhao He, Shuai Zhang, Kai Zeng, Liang Feng, Jiansong Zhang, Tongxuan Liu, Yong Li, Jingren Zhou, Ce Zhang, and Gustavo Alonso \"FleetRec: Large-Scale Recommendation Inference on Hybrid GPU-FPGA Clusters\" (KDD'21) Wenqi Jiang, Zhenhao He, Shuai Zhang, Thomas B. Preußer, Kai Zeng, Liang Feng, Jiansong Zhang, Tongxuan Liu, Yong Li, Jingren Zhou, Ce Zhang, and Gustavo Alonso \"MicroRec: Efficient Recommendation Inference by Hardware and Data Structure Solutions\" (MLSys'21) AWARDS & HONOURS ML and Systems Rising Stars (2024) AMD HACC Outstanding Researcher Award (2023) COURSES TAUGHT",
  "content_length": 3079,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:26"
}