{
  "name": "Wenqian Dong",
  "homepage": "https://wdong5.github.io",
  "status": "success",
  "content": "Wenqian's Homepage Home News Papers Awards Working Services Wenqian Dong Assistant Professor in the school of EECS at Oregon State University (starting from Fall 2024). She is the principal investigator of the Parallel Intelligent Computing (PiComp) Lab and a co-leader of the High-Performance Computing and Systems at Oregon State (HipCastor) Lab with three other OSU faculties. Her research interests include high-performance computing (HPC), scientific machine learning, automatic performance tuning, and system-level optimization for large-scale ML models. Her work has been published in multiple top-tier conferences, including SC, HPDC, ASPLOS, ICS, EuroSys, VLDB, etc. Also, she is the recipient of the IEEE Computer Society TCHPC Early Career Researchers Award for Excellence in High-Performance Computing (2023) and the Bobcat Fellowship at UC Merced (2020 and 2018). She earned her Ph.D. from the University of California, Merced, under the supervision of Prof. Dong Li. She worked as a research intern in the High-Performance Computing Group at Pacific Northwest National Laboratory (PNNL), and AI Labs at Hewlett Packard Enterprise (HPE). Her work at PNNL was highlighted at DOE News wise and PNNL website . [News:] If you are interested in applying to the Ph.D. program (open for graduates/senior undergrads) in my group or remote research intern (open for undergrads) from my group, please send your CV and transcript to my OSU email box wenqian.dong[at]oregonstate.edu. wenqian.dong [at] oregonstate.edu Google Scholar OSU faculty website ​ News [09/2025] A paper \"Phoenix: Enabling Unstructured Sparse Fine-Tuning and Inference for Foundation Models on Wafer-Scale Engine\" is accepted in SC'25 ExHetAI workshop. [04/2025] NSF OAC has awarded our project \"OAC Core: AI-Surrogate Enhanced Heterogeneous Acceleration for Large-Scale Power Grid Simulation (OAC:2505118)\". Thanks, NSF! [04/2025] I will serve as a TPC member of the SC'25 . [02/2025] A paper \"Framework for tracking metadata, lineage and model provenance in hybrid simulation-AI HPC exascale workflows\" is accepted in CUG'25. [02/2025] A paper \"HurriCast: Synthetic Tropical Cyclone Track Generation for Hurricane Forecasting\" is accepted to the SSS-25 symposium at AAAI 2025. [12/2024] I will serve as a publicity chair of the ICS'25 . Please check the Call for Paper here. [10/2024] I will serve as a TPC member of the IPDPS'25 . [07/2024] NSF OAC has awarded our project \"CyberTraining: Pioneering a CI Workforce for Sustainable and Transdisciplinary Environmental Science Research (OAC:2514351)\". Thanks, NSF! [06/2024] NSF CNS has awarded our application for the student travel grant for ICPP 2024 (CNS:2422988). This will undoubtedly bring great joy to the students. [05/2024] Our request for resources to advance AI infrastructure has been awarded by the NSF NAIRR Pilot. Thank you to the NSF, DOE, and TACC! [05/2024] A paper \"TimeX++: Learning Time-Series Explanations with Information Bottleneck\" is accepted in ICML'24. [12/2023] Our proposal \"An AI/ML Collaborative for Southeast Florida Coastal Environmental Data and Modeling Center (IIS-2331908)\" has been funded by the NSF. A big thank you to NSF for their support! [12/2023] I will serve as a TPC member of SC'24: The International Conference for High-Performance Computing, Networking, Storage, and Analysis, Area of Programming Frameworks, in Atlanta, GA, USA. [12/2023] I will serve as a TPC member of HPDC'24: The 33rd International Symposium on High-Performance Parallel and Distributed Computing is scheduled on June 3-7, 2024 and will be held in Pisa, Italy. [11/2023] I was very honored to be selected for the 2023 IEEE Computer Society TCHPC Early Career Researchers Award for Excellence in High-Performance Computing (website). The award ceremony will be at SC23 in Denver. See you there! [10/2023] I will serve as a Student Program Co-Chair of the International Conference on Parallel Processing (ICPP'24). [10/2023] I am invited as a panelsit for DOE proposal review. [09/2023] I will serve as a TPC member of the 2024 SIAM International Conference on Data Mining (SDM’24). [09/2023] I will serve as a TPC member of CCGrid'24. See call for papers here. [06/2023] MLbench'23 will be held alongside MLsys on June 8, 2023, in Miami. We cordially invite you to attend our workshop and say 'hi'. [04/2023] A paper \"Auto-HPCnet: An Automatic Framework to Build Neural Network-based Surrogate Models for HPC Applications\" is accepted in HPDC'23. [11/2022] I am invited to be a TPC of IEEE Cloud. [09/2022] Our paper \"Betty: Enabling Large-Scale GNN Training with Batch-Level Graph Partitioning\" is accepted in ASPLOS'23. [08/2022] I am going to teach CEN 5082-Grid Enablement of Scientific Applications at FIU in the Fall semester. [06/2022] I am invited to be a TPC of AI4Science workshop. [04/2022] I will join FIU as a tenure-track assistant professor. Feel free to send me your application if you are interested in my research topics. [01/2022] I am invited as a TPC of MLBench workshop. Selected Publications TimeX++: Learning Time-Series Explanations with Information Bottleneck. Zichuan Liu, Tianchun Wang, Jimeng Shi, Xu Zheng, Zhuomin Chen, Lei Song, Wenqian Dong, Jayantha Obeysekera, Farhad Shirani, Dongsheng Luo In the 41nd International Conference on Machine Learning (ICML'24) (acceptance rate: %) (ICML), 2024 ICML Auto-HPCnet: An Automatic Framework to Build Neural Network-based Surrogate Models for HPC Applications. Wenqian Dong , Gokcen Kestor and Dong Li In the 32nd ACM International Symposium on High-Performance Parallel and Distributed Computing (acceptance rate: %) (HPDC), 2023 HPDC Betty: Enabling Large-Scale GNN Training with Batch-Level Graph Partitioning. Shuangyan Yang, Mingjia Zhang, Wenqian Dong , and Dong Li; In the 28th International Conference on Architectural Support for Programming Languages and Operating Systems (acceptance rate: %) (ASPLOS), 2023 ASPLOS Fauce: Fast and Accurate Deep Ensembles with Uncertainty for Cardinality Estimation. Jie Liu, Wenqian Dong , Qingqing Zhou, and Dong Li In the 47th International Conference on Very Large Data Bases (acceptance rate: 24%) (VLDB), 2021 VLDB MD-HM: Memoization-based Molecular Dynamics Simulations on Big Memory System. Zhen Xie, Wenqian Dong, Jie Liu, Ivy Peng, Yanbao Ma and Dong Li In the 47th International Conference on Very Large Data Bases (acceptance rate: 24%) (ICS), 2021 ICS Tahoe: Tree Structure-Aware High Performance Inference Engine for Decision Tree Ensemble on GPU. Zhen Xie, Wenqian Dong, Jiawen Liu, Hang Liu and Dong Li; ACM 16th European Conference on Computer Systems, 2021 (acceptance rate: 20.9%) (EuroSys), 2021 EuroSys Smart-PGSim: Using Neural Network to Accelerate AC-OPF Power Grid Simulation. Wenqian Dong , Zhen Xie, Gokcen Kestor and Dong Li In 32nd ACM/IEEE International Conference for High Performance Computing (acceptance rate: 22.3%) [Highlighted in Newswise as a DOE science innovation] (SC), 2020 SC arxiv Adaptive Neural Network-Based Approximation to Accelerate Eulerian Fluid Simulation. Wenqian Dong, Jie Liu, Zhen Xie and Dong Li; In the 31st ACM/IEEE International Conference for High Performance Computing (acceptancerate: 22.6%) (SC), 2019 SC arxiv Modeling Application Resilience in Large Scale Parallel Execution. Kai Wu, Wenqian Dong, Qiang Guan, Nathan Debardeleben and Dong Li; In the 47th International Conference on Parallel Processing (acceptance rate: 24%) (ICPP), 2018 ICPP Awards and Funding ❉ 2025: OAC:2505118 (Role: Lead PI) \"OAC Core: AI-Surrogate Enhanced Heterogeneous Acceleration for Large-Scale Power Grid Simulation\" ❉ 2024: OAC:2514351 (Role: Lead PI) \"CyberTraining: Implementation: Medium: EcoTern: Pioneering a CI Workforce for Sustainable and Transdisciplinary Environmental Science Research\" ❉ 2024: CNS:2422988 (Role: Lead PI) \"Travel: NSF Student Travel Grant for 2024 International Conference on Parallel Processing\" ❉ 2023: IIS-2331908 (Role: SI) \"An AI/ML Collaborative for Southeast Florida Coastal Environmental Data and Modeling Center\" ❉ 2023: IEEE CS TCHPC Early Career Researchers Award for Excellence in High Performance Computing ❉ 2020: Bobcat Fellowship at UC Merced ❉ 2018: Bobcat Fellowship at UC Merced ❉ 2019: ASPLOS'19 Student Travel Grant Teaching [OSU] CS/ECS 599: Advanced Topics in Deep Learning & High-Performance Computing (Winter 2025) [Canvas link] [FIU] COP-4520: Parallel Computing (Spring 2024) [FIU] CEN-5082: Parallel Computing System (Spring 2024) [FIU] COP-4520: Parallel Computing (Spring 2023) [FIU] CEN-5082: Parallel Computing System (Fall 2022) [UCM] CSE-179: Parallel computing (Fall 2019, Spring 2021) [UCM] CSE-022: Introduction to Programming (Fall 2020, Fall 2021) [UCM] CSE-020: Introduction to Computing (Spring 2021) Students ❉ Shouwei Gao, Ph.D. student (Fall 2023 -) ❉ Haoyu Zheng, Ph.D. student (Fall 2023 -) ❉ Arunavo Dey, Ph.D. student (Fall 2025 -) ❉ Changqing Li, Ph.D. student (Fall 2025 -) ❉ Chelsi Jain, Master student (Summer 2025 -) ❉ Jiya Pradhan, Undergrad ❉ Ayowade (Wade) Owojori, Undergrad ❉ Meiyan Gao, Alumni, First employment: Neocis Inc. Services ❉ Panel reviewer of NSF and DOE ❉ Student Program Co-Chair of International Conference on Parallel Processing 2024 (ICPP'24) ❉ Organizer for the MLBench'23 workshop ❉ Technical Program Committee (TPC) for the HPDC'25 , IPDPS'25, SC'24, HPDC'24, CCGrid'24, IEEE Cloud'23, AI4S'22, and GPGPU'23 ❉ Student Volunteer at SC’17, SC’18, SC'20 and SC'21 ❉ Assistant of managing HPDC’18 and HPDC’19 travel grants ❉ Member of the Association of Computing Machinery (ACM) ❉ Member of the Association of Computing Machinery (ACM-Women) ❉ Member of the Institute of Electrical and Electronics Engineers (IEEE)",
  "content_length": 9734,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:25"
}