{
  "name": "Wenqing Chen",
  "homepage": "https://chenwq95.github.io",
  "status": "success",
  "content": "Wenqing Chen (陈文清) Menu Home Google Scholar DBLP Wenqing Chen (陈文清) Assistant Professor, School of Software Engineering, Sun Yat-sen University, Zhuhai, China E-mail: chenwq95@mail.sysu.edu.cn About me I am currently an assistant professor of the School of Software Engineering in the Sun Yat-sen University. Previously, I received a doctorate from the Institute of Artificial Intelligence of Shanghai Jiao Tong University in 2022. More recently, I receive a master's degree from Beijing Normal University in 2015 and a bachelor's degree from Huazhong University of Science and Technology in 2012, respectively. My research interests include Natural Language Processing (NLP), Causal Inference, and Code Intelligence. I am looking for self-motivated students. Please drop me an email if you are interested. Research My research interests include: Natural Language Processing Causal Inference Code Intelligence Recent publications (Note: # indicates the authors with equal contributions, and * indicates the corresponding authors.) Zhenjie Xu, Wenqing Chen*, Xuanying Li, Cheng Hu, Zhixuan Chu, Kui Ren, Zibin Zheng, Zhichao Lu. Mitigating Social Bias in Large Language Models: A Multi-Objective Approach within a Multi-Agent Framework. AAAI 2025 (CCF A). Zhuohao Li, Wenqing Chen*, Jianxing Yu, Zhichao Lu. Functional Consistency of LLM Code Embeddings: A Self-Evolving Data Synthesis Framework for Benchmarking. Expert Systems with Applications 2025 (SCI Q1). Weibin Wu, Zitong Wang, Zhengjie Luo, Wenqing Chen*, Zibin Zheng. Detecting Violations of Physical Common Sense in Images: A Challenge Dataset and Effective Model. ACM MM2025 (CCF A).. Jianxing Yu, Shiqi Wang, Hanjiang Lai, Wenqing Chen, Yanghui Rao, Qinliang Su, Jian Yin. Generating Commonsense Reasoning Questions with Controllable Complexity through Multi-step Structural Composition. COLING 2025 (CCF B). Wenqing Chen, Weicheng Wang, Zhixuan Chu, Kui Ren, Zibin Zheng, Zhichao Lu. Self-Para-Consistency: Improving Reasoning Tasks at Low Cost for Large Language Models[C]. ACL 2024 Findings. (CCF A). Wenqing Chen#, Jidong Tian#, Caoyun Fan, Yitian Li, Hao He, Yaohui Jin. Preference-Controlled Multi-Objective Reinforcement Learning for Conditional Text Generation. AAAI 2023 (CCF-A). pdf Jidong Tian#, Wenqing Chen#, Yitian Li, Caoyun Fan, Hao He, Yaohui Jin. Latent Constraints on Unsupervised Text-Graph Alignment with Information Asymmetry. AAAI 2023 (CCF-A). pdf Caoyun Fan#, Wenqing Chen#, Jidong Tian, Hao He, Yaohui Jin. Improving the Out-Of-Distribution Generalization Capability of Language Models: Counterfactually-Augmented Data is not Enough. ICASSP 2023 (CCF-B). [pdf] Caoyun Fan#, Wenqing Chen#, Jidong Tian, Hao He, Yaohui Jin. Accurate use of label dependency in multi-label text classification through the lens of causality. Applied Intelligence (SCI). [pdf] Jidong Tian, Yitian Li, Wenqing Chen, Liqiang Xiao, Hao He, Yaohui Jin. Weakly Supervised Neural Symbolic Learning for Cognitive Tasks. AAAI 2022 (CCF-A). [pdf] Caoyun Fan, Wenqing Chen, Jidong Tian, Yitian Li, Hao He, Yaohui Jin. MaxGNR: A Dynamic Weight Strategy via Maximizing Gradient-to-Noise Ratio for Multi-Task Learning. ACCV 2022. [pdf] Yitian, Li, Jidong Tian, Wenqing Chen, Caoyun Fan, Hao He, Yaohui Jin. To What Extent Do Natural Language Understanding Datasets Correlate to Logical Reasoning? A Method for Diagnosing Logical Reasoning. COLING 2022 (CCF-B). [pdf] Wenqing Chen, Jidong Tian, Yitian Li, Hao He, Yaohui Jin. De-Confounded Variational Encoder-Decoder for Logical Table-to-Text Generation. ACL/IJCNLP 2021 (CCF-A). [pdf] Jidong Tian, Yitian Li, Wenqing Chen, Liqiang Xiao, Hao He, Yaohui Jin. Diagnosing the First-Order Logical Reasoning Ability Through LogicNLI. EMNLP 2021 (CCF-B). [pdf] Wenqing Chen, Jidong Tian, Caoyun Fan, Hao He, Yaohui Jin. Dependent Multi-Task Learning with Causal Intervention for Image Captioning. IJCAI 2021(CCF-A). [pdf] Wenqing Chen, Jidong Tian, Liqiang Xiao, Hao He, Yaohui Jin. A Semantically Consistent and Syntactically Variational Encoder-Decoder Framework for Paraphrase Generation. COLING 2020 (CCF-B). [pdf] Wenqing Chen, Jidong Tian, Liqiang Xiao, Hao He, Yaohui Jin. Exploring Logically Dependent Multi-task Learning with Causal Inference. EMNLP 2020 (CCF-B). [pdf] Honglun Zhang, Wenqing Chen, Jidong Tian, Hao He, Yaohui Jin. RAG: Facial Attribute Editing by Learning Residual Attributes. IEEE Access 2019. [pdf] He Chen, Wenqing Chen, Yan Song, Li Sun, Xiaoli Li. EEG characteristics of children with attention-deficit/hyperactivity disorder. Neuroscience 2019. [pdf] Liqiang Xiao, Honglun Zhang, Wenqing Chen, Yongkun Wang, Yaohui Jin. Learning What to Share: Leaky Multi-Task Network for Text Classification. COLING 2018 (CCF-B). [pdf] Honglun Zhang, Liqiang Xiao, Wenqing Chen, Yongkun Wang, Yaohui Jin. Multi-Task Label Embedding for Text Classification. EMNLP 2018 (CCF-B). [pdf] Liqiang Xiao, Honglun Zhang, Wenqing Chen, Yongkun Wang, Yaohui Jin. MCapsNet: Capsule Network for Text with Multi-Task Learning. EMNLP 2018 (CCF-B).[pdf] Honglun Zhang, Liqiang Xiao, Wenqing Chen, Yongkun Wang, Yaohui Jin. Generative Warfare Nets: Ensemble via Adversaries and Collaborators. IJCAI 2018 (CCF-A).[pdf] Liqiang Xiao, Honglun Zhang, Wenqing Chen, Yongkun Wang, Yaohui Jin. Transformable Convolutional Neural Network for Text Classification. IJCAI 2018 (CCF-A).[pdf] Liqiang Xiao, Honglun Zhang, Wenqing Chen. Gated Multi-Task Network for Text Classification. NAACL-HLT 2018 (CCF-B).[pdf] Full list of publications in Google Scholar. Academic service Reviewer ACL EMNLP AAAI IJCAI Expert Syst App. Education Ph.D., Shanghai Jiao Tong University, 04.2017——06.2022 M.E., Beijing Normal University, 09.2012——06.2015 B.E., Huazhong University of Science and Technology, 09.2008——06.2012",
  "content_length": 5793,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:27"
}