{
  "name": "Wenting Tu",
  "homepage": "http://simecv.sufe.edu.cn/page.aspx?id=76",
  "status": "success",
  "content": "涂文婷 教师介绍 涂文婷 姓名: 涂文婷 最后学位: 博士 职称: 副教授 公共职务: 导师岗位: 博导 办公室: 210 电话: Email: tu.wenting@mail.shufe.edu.cn 个人简介 我目前在上海财经大学的信息管理工程学院担任副教授。进入上财之前，于香港大学的计算机科学系获得博士学位，师从Prof. David Cheung和Prof. Nikos Mamoulis 我的研究兴趣包括机器学习算法以及相关应用，理论上目前主要集中在研究机器学习用于时间序列预测的算法研究；应用上目前主要包括智慧供应链与金融科技。截止到目前，我在上述相关方向上共发表了40余篇学术论文。 教授课程 机器学习（本科生 & 博士生,  本科生课程 & 研究生课程，主讲1/1） 机器学习与深度学习（硕士生，研究生课程，合作主讲1/2） 机器学习基础与应用（全校，通识课程，主讲1/1） 科研项目 基于多源多任务深度学习实现个性化金融推荐的算法研究 （主持，国家级，青年科学基金项目） 基于深度域适应学习框架实现信用风险智能预测的算法研究 （主持，省部级，上海市青年科技英才扬帆计划） 前沿人工智能理论驱动下的金融科技研究 （主持，校级，新进教师科研启动经费） 发表论文 Publications (Google Schorlar) Tags: ML (Machine Learning), NLP (Nature Language Processing), DL (Deep Learning), Recsys (Recommendation Systems), Fintech, BCI (Brain-computer Interface), Time Series Forecasting, * (Corresponding author) 2023: Yi Xiang☆, Haoran Sun☆, Wenting Tu*, Tianze Jin: TSFRN: Integrated Time and Spatial-Frequency domain based on Triple-links Residual Network for Sales Forecasting. IEEE International Conference on Tools with Artificial Intelligence (ICTAI), 2023 (Accepted, ☆: equally contribution) [DL+Time Series Forecasting] Yi Xiang, Yujie Ding, Wenting Tu*:  DLUIO: Detecting Useful Investor Opinions by Deep Learning.International Conference on Artificial Neural Networks (ICANN), 2023 (Accepted) [ML+Fintech] Yi Xiang☆, Haoran Sun☆, Wenting Tu*: HDResNet: Hierarchical-Decomposition Residual Network for Hierarchical Time Series Forecasting. International Joint Conference on Neural Networks (IJCNN), 2023 (Accepted, ☆: equally contribution) [DL+Time Series Forecasting] 2022: Yujie Ding, Wenting Tu, Chuan Qin, Jun Chang: A grouping-based AdaBoost method for factor investing. Proceedings of the 32th IEEE International Conference on Tools with Artificial Intelligence (ICTAI) , 2022 [ML+Fintech] 2021: Hao Li☆, Hao Qiu☆, Shu Sun☆, Jun Chang, Wenting Tu*: Credit Scoring by One-class Classi?cation Driven Dynamical Ensemble Learning.Journal of the Operational Research Society (JORS) , 2021 (Accepted, ☆: equally contribution) [ML+Fintech] 2020: Jun Chang, Wenting Tu*, Changrui Yu, Chuan Qin: Assessing Dynamic Qualities of Investor Sentiments for Stock Recommendation.Information Processing and Management (IPM) , 2020 (Accepted) [ML+Fintech] Jun Chang, Yujie Ding, Wenting Tu*: FollowAKOInvestor: Using Machine Learning to Hear Voices from All Kinds of Investors.Proceedings of the 32th IEEE International Conference on Tools with Artificial Intelligence (ICTAI) , 2020  [ML+Fintech] Min Yang, Weiyi Huang, Wenting Tu, Qiang Qu, Ying Shen, Kai Lei: Multitask Learning and Reinforcement Learning for Personalized Dialog Generation: An Empirical Study.IEEE Transactions on Neural Networks and Learning Systems (TNNLS) , 2020 [DL+NLP] 2019: Hui Li, Yu Liu, Yuqiu Qian, Nikos Mamoulis, Wenting Tu*, David W.Cheung: H2MF: Hidden Hierarchical Matrix Factorization for Recommender Systems.Data Mining and Knowledge Discovery (DMKD),  2019  [Recsys] Min Yang, Qiang Qu, Wenting Tu, Ying Shen, Zhou Zhao, Xiaojun Chen: Exploring Human-Like Reading Strategy for Abstractive Text Summarization.Proceedings of the AAAI Conference on Artificial Intelligence (AAAI) , 2019[DL+NLP] Min Yang, Wenting Tu*, Wei Zhou, Qiao Liu, JiaZhu: Advanced Community Question Answering by Leveraging External Knowledge and Multi-task Learning.Knowledge-Based Systems , 2019 [DL+NLP] 2018: Jun Chang, Wenting Tu*: A Stock-movement Aware Approach for Discovering Investors' Personalized Preferences in Stock Markets.Proceedings of the 30th IEEE International Conference on Tools with Artificial Intelligence (ICTAI), 2018  [Recsys+Fintech] Min Yang, Wenting Tu*, Qiang Qu, Zhou Zhao, Xiaojun Chen, Jia Zhu: Personalized Response Generation by Dual-learning based Domain Adaptation.Neural Networks (IF: 7.197), 2018 [DL+NLP] Wenting Tu, Min Yang, David W.Cheung, Nikos Mamoulis: Investment Recommendation by Discovering High-quality Opinions in Investor based Social Networks.Information Systems (Elsevier) (IF: 2.551), 2018  [ML+Recsys+Fintech] 2017: Wenting Tu, David W.Cheung, Nikos Mamoulis, Min Yang,  Ziyu Lu:  Activity Recommendation with Partners.ACM Transactions on the Web (IF: 1.163), 2017  [Recsys] Wenting Tu, David W.Cheung, Nikos Mamoulis:  More Focus on What You Care About: Personalized Top Reviews Set.Neurocomputing (IF: 3.241), 2017  [NLP+Recsys] 2016: Wenting Tu, David W.Cheung, Nikos Mamoulis, Min Yang,  Ziyu Lu:  Investment Recommendation using Investor Opinions in Social Media.Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR), 2016 (short paper) [ML+Recsys+Fintech] Before 2016: Wenting Tu, David W.Cheung, Nikos Mamoulis, Min Yang,  Ziyu Lu:  Activity Partner Recommendation.Proceedings of the 19th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2015  [Recsys] Wenting Tu, David W.Cheung, Nikos Mamoulis: Time-sensitive Opinion Mining for Prediction. Proceedings of the 29th AAAI Conference on Artificial Intelligence (AAAI), 2015 (poster) [NLP+Fintech] Wenting Tu, David W.Cheung, Nikos Mamoulis:  Improving Microblog Rtrieval from Exterior Corpus by Automatically Constructing Microblogging Corpus. Proceedings of the 29th AAAI Conference on Artificial Intelligence (AAAI), 2015 (poster) [NLP] Wenting Tu, David W.Cheung, Nikos Mamoulis, Min Yang, Ziyu Lu:  Real-time Detection and Sorting of News on Microblogging Platforms. Proceedings of the 29th Pacific Asia Conference on Language, Information and Computing (PACLIC), 2015 (poster) [NLP] Min Yang, Tianyi Cui, Wenting Tu: Order-sensitive and Semantic-aware Topic Modeling Microblogging Corpus.Proceedings of the 29th AAAI Conference on Artificial Intelligence (AAAI), 2015 [NLP] Ziyu Lu, Hao Wang, Nikos Mamoulis, Wenting Tu, David W. Cheung: Personalized Location Recommendation by Aggregating Multiple Recommenders in Diversity.Proceedings of the 9th RecSys Workshop on Location-Aware Recommendations (LocalRec), 2015 [Recsys] Min Yang, Wenting Tu, Wenpeng Yin, Ziyu Lu: Deep Markov Neural Network for Sequential Data Classification.Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics (ACL), 2015 (short paper) [DL+NLP] Min Yang, Wenting Tu, Ziyu Lu, Kam-Pui Chow: A Semi-supervised Model for Sentiment Classification.Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), 2015 [NLP] Wenting Tu, Shiliang Sun: Semi-supervised Feature Extraction for EEG Classification.Pattern Analysis and Applications (PAA), 2013  [ML+BCI] Wenting Tu, Shiliang Sun: Dynamical Ensemble Learning with Model-friendly Classifiers for Domain Adaptation.Proceedings of the 21st International Conference on Pattern Recognition (ICPR), 2012  [ML] Wenting Tu, Shiliang Sun: A Subject Transfer Framework for EEG Classification. Neurocomputing, 2012  [ML+BCI] Wenting Tu, Shiliang Sun: Cross-domain representation-learning framework with combination of class-separate and domain-merge objectives.Workshop on Cross Domain Knowledge Discovery in Web and Social Network Mining (KDD-Workshop), 2012  [ML] Wenting Tu, Shiliang Sun: Transferable Discriminative Dimensionality Reduction. Proceedings of the 23rd IEEE International Conference on Tools with Artificial Intelligence (ICTAI), 2011  [ML] Wenting Tu, Shiliang Sun: Semi-supervised Feature Extraction with Local Temporal Regularization for EEG classification.  Proceedings of the 21st International Joint Conference on Neural Networks (IJCNN), 2011  [ML+BCI] Wenting Tu, Shiliang Sun: Importance Weighted Extreme Energy Ratio for EEG Classification.  Proceedings of the 17th International Conference on Neural Information Processing (ICONIP), 2011  [ML+BCI] Wenting Tu, Shiliang Sun: Spatial Filter Selection with Lasso for EEG Classification.Proceedings of the 6th International Conference on Advanced Data Mining and Applications (ADMA), 2010  [ML+BCI] Shiliang Sun, Feng Jin, Wenting Tu: View construction for multi-view semi-supervised Learning.  Proceedings of the 8th International Symposium on Neural Networks (ISNN), 2010  [ML] 荣誉奖励 上海财经大学第二届青年教师教学竞赛理工组三等奖 上海市研究生优秀成果（学位论文） 香港大学研究生奖学金（全额） 华东师范大学优秀毕业生 华东师范大学一等奖学金 --------------- 感谢我的父母 -------------- ------Deepest gratitude to my parents------ 862ZrMjFUFyq",
  "content_length": 8247,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:28"
}