{
  "name": "Wenxuan Wang 0001",
  "homepage": "https://jarviswang94.github.io",
  "status": "success",
  "content": "Wenxuan Wang HOME PUBLICATION TEAM ABOUT BACK TO TOP Wenxuan Wang 王文轩 Assistant Professor in Computer Science@Renmin University of China I am extremely outgoing. Please feel free to reach me at: Email: jwxwang@gmail.com | Google Scholar | Linkedin | | GitHub | Twitter ｜ | Research Lab: RUC-AIM3 | I am an assistant professor in the Computer Science Department at Renmin University of China (RUC). My research interest lies in the reliability and safety of Large Language Models. Before joining Renmin University of China, I was a PostDoc Fellow at Hong Kong University of Science and Technology (HKUST), working with Prof. Shuai Wang. I obtained my Ph.D. from the Chinese University of Hong Kong (CUHK) in 2024, advised by Prof. Michael R. Lyu. I obtained my B.Sc. from Huazhong University of Science and Technology (HUST). I was a research intern at Tencent AI Lab, working closely with Dr. Wenxiang Jiao and Dr. Zhaopeng Tu, and a visiting Ph.D. student at UCLA, working with Prof. Nanyun Violet Peng . News [Nov. 2025] Three papers are accepted to AAAI'26, with one selected as an Oral ! [Sep. 2025] Five papers are accepted to NeurIPS'25, with one selected as an Spotlight ! [Sep. 2025] One papers is accepted to SP'25! [Aug. 2025] Five papers are accepted to EMNLP'25, with one nominated Best Paper Award and one Oral! [Aug. 2025] Two papers are accepted to ASE'25! [Jun. 2025] One paper is accepted to ACM MM'25! [May. 2025] Five papers are accepted to ACL'25! [May. 2025] One paper is accepted to KDD'25! [May. 2025] One paper is accepted to ICML'25! [Mar. 2025] One paper is accepted to FSE'25! [Jan. 2025] One paper is accepted to ICLR'25! ---- show more ---- [Sep. 2024] One paper is accepted to NeurIPS'24! [Sep. 2024] Two papers are accepted to EMNLP'24! [Jul. 2024] One paper is accepted to ACMMM'24 and selected as an ORAL! [May. 2024] One paper is accepted to ACL'24! [Jan. 2024] Two papers are accepted to ICLR'24! Our PsychoBench will have an ORAL presentation. [Dec. 2023] One paper is accepted to FSE'23! [Oct. 2023] One paper is accepted to Findings of EMNLP'23! [Jul. 2023] One paper is accepted to ISSTA'23! [Jul. 2023] One paper is accepted to ASE'23! [Feb. 2023] One paper is accepted to CVPR'23! [Dec. 2022] One paper is accepted to ICSE'23! [Sep. 2022] We win the first place in WMT'22: Large-Scale Machine Translation Evaluation for African Languages! [May. 2022] One paper is accepted to ACL'22! [Apr. 2022] One paper is accepted to ISSTA'22! Teaching Teaching Assistant of AIST1001: Introduction to Artificial Intelligence. Contact Room 205A Wing Building of Science and Technology Renmin University of China Beijing, P. R. China Website design: ✩",
  "content_length": 2677,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:29"
}