{
  "name": "Wenyao Xu",
  "homepage": "https://cse.buffalo.edu/~wenyaoxu",
  "status": "success",
  "content": "Wenyao Xu - Computer Science and Engineering - SUNY Buffalo Wenyao Xu Home News Research Publications Teaching Links ESC Group Wenyao Xu, PhD Professor Department of Computer Science & Engineering University at Buffalo, the State University of New York (SUNY) Office: 330 Davis Hall Buffalo, NY 14260-2500 Phone: (716)645-4748 ORCID: 0000-0001-6444-9411 Email: wenyaoxu at buffalo dot edu Update: Our team is actively looking for postdoctoral  researchers, doctoral candidates and undergraduate students in the area of AIoT & Wireless Sensing, Digital Health, CyberSecurity and Biometrics. Biography: I am a Professor of Computer Science and Engineering Department in the State University of New York (SUNY) at Buffalo, where I founded and lead the ESC (Embedded Sensing and Computing) Group. My research team has published over 300 technical papers, co-authored 2 books and generated a portfolio of international and U.S. patents advancing embedded sensing, AI-driven health technologies and computing systems. I received the Ph.D. from University of California, Los Angeles (UCLA), and my M.S. and B.S. from Zhejiang University, China. I am also the founder of Auspex Medix - a HealthTech startup developing AI-enabled medical devices and services. I am honored to be a Fellow of IEEE and AIMBE. Research Overview: Google Scholar Our group has focused on exploring novel Embedded Sensing and Computing technologies to build up innovative Internet-of-Things (IoT) systems for high-impact real-world applications in the fields of healthcare, security and advanced manufacturing. Results has been published in peer-reviewed top research venues across multiple disciplines, including Computer Science (e.g., ACM SenSys, MobiSys, MobiCom, UbiComp, ASPLOS, ISCA, HPCA, Oakland, NDSS and CCS), Biomedical Engineering (e.g., IEEE TBME, TBioCAS, and JBHI), and Medicine (e.g., LANCET, Advanced Science). Our group won 20+ best paper awards and nomination and 10+ international best design awards in the field of IoT and smart health. Our inventions have been filed within U.S. and internationally as patents, and have been licensed to industrial players. Our research has been reported in various high-impact media outlets, including the Discovery Channel, Cable News Network, the Wall Street Journal, National Public Radio, Los Angeles Times, and the National Science Foundation's News. Selected research projects are as below: AI and AIoT for Smart Health: mRehab: Scalable mHealth Technologies using 3D Printing for Stroke Rehabilitation (Project Website) EarlySee: Pervasive Autism Screening in Infancy and Toddlerhood (Project Website) mPD: Passive Daily-life Activity Monitoring for Parkinson Disease Screening and Self-management mCalm: Closed-loop and Just-in-time Mental Health Intervention using Mobile and IoT Technologies Advanced Cybersecurity and Biometrics: Emerging Biometrics: Secure (e.g., cancelable) and Practical Biometric Systems in Ecological Environments Biometrics Education: A Research Experiences for Undergraduate Site on Biometrics (Project Website) Secure and Dependable 3D Printing: Investigating the Vulnerabilities of 3D Printing Systems mmWave Radar Security in Autonomous Vehicles: Vulnerability Identification and mitigation",
  "content_length": 3253,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:30"
}