{
  "name": "Wenzel Jakob",
  "homepage": "https://people.epfl.ch/wenzel.jakob",
  "status": "success",
  "content": "Wenzel Jakob — People - EPFL Wenzel Jakob Edit profile Associate Professor wenzel.jakob@epfl.ch +41 21 693 13 29 https://rgl.epfl.ch Associate Professor, Realistic Graphics Lab EPFL IC IINFCOM RGL BC 364 (Bâtiment BC) Station 14 1015 Lausanne +41 21 693 13 29 +41 21 693 52 15 Office: BC 364 EPFL > IC > IINFCOM > RGL Associate Professor, SIN - Teaching EPFL > IC > IC-SIN > SIN-ENS Web site: Web site: https://sin.epfl.ch Associate Professor, SSC - Teaching EPFL > IC > IC-SSC > SSC-ENS Web site: Web site: https://ssc.epfl.ch PhD program committee member, Doctoral Program Computer and communication sciences EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDIC-GE Web site: Web site: https://go.epfl.ch/phd-edic vCard Données administratives Fields of expertise Inverse Graphics, Appearance Modeling, Physically Based Rendering Biography I completed my Ph.D. at the Department of Computer Science at Cornell University, where I was advised by Steve Marschner. Before coming to EPFL, I was a Marie Curie postdoctoral fellow at ETH Zürich's Interactive Geometry Lab working with Olga Sorkine-Hornung.I have received the ACM SIGGRAPH Significant Researcher award, the Eurographics Young Researcher Award, and an ERC Starting Grant. My group develops the Mitsuba renderer, a research-oriented rendering system, and I am one of the authors of the third and fourth editions of Physically Based Rendering: From Theory To Implementation. As part of my research, I have created widely used open source frameworks, including pybind11, Instant Meshes (SGP Software Award recipient), NanoGUI, nanobind, and Enoki. Mission I am an associate professor leading the Realistic Graphics Lab at EPFL. My research revolves around inverse graphics, appearance modeling and physically based rendering algorithms. The motivating idea is easily explained: if one could backpropagate derivatives through a rendering algorithm, then it should be possible to employ a variant of gradient descent to run a rendering algorithm “in reverse” and reconstruct the world from images or other kinds of data. This turns out to be harder than one would think, which makes it an interesting research topic. I also enjoy working on compilers systems and tinkering with optical assemblies in our measurement lab. I would like to build a truly robust and general “TensorFlow” for physically realistic inverse graphics and connect it to useful applications in different scientific domains. Show more Teaching & PhD Teaching Computer Science Communication Systems PhD Students Nuic Lovro, Yilmazer Ekrem Fatih, Zhang Ziyi, Past EPFL PhD Students Nicolet Baptiste Alexandre Marie Philippe Claude , Nimier-David Merlin Eléazar , Vicini Delio Aleardo , Zeltner Tizian Lucien , close All postal addresses and positions EPFL IC IINFCOM RGL Associate Professor Status: Personnel EPFL IC IINFCOM RGL BC 364 (Bâtiment BC) Station 14 1015 Lausanne +41 21 693 13 29 +41 21 693 52 15 Office: BC 364 EPFL > IC > IINFCOM > RGL EPFL IC IC-SIN SIN-ENS Associate Professor Status: Personnel EPFL > IC > IC-SIN > SIN-ENS EPFL IC IC-SSC SSC-ENS Associate Professor Status: Personnel EPFL > IC > IC-SSC > SSC-ENS EPFL VPA-AVP-DLE AVP-DLE-EDOC EDIC-GE PhD program committee member Status: Personnel EPFL > VPA-AVP-DLE > AVP-DLE-EDOC > EDIC-GE",
  "content_length": 3270,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:32"
}