{
  "name": "Wenzhong Li",
  "homepage": "http://cs.nju.edu.cn/lwz",
  "status": "success",
  "content": "Wenzhong Li at Nanjing University Wenzhong Li Ph.D. Professor State Key Laboratory for Novel Software and Technology School of Computer Science Nanjing University 163 Xianlin Street, Nanjing, China Email: lwz#nju.edu.cn (CV)(中文简介)(小组海报) [Teaching] [Research] [Projects] [People] [Service] [Publications] [Links] [Others] Teaching Spring 2025: Computer Networks Fall 2017-2024: Guidance to Distributed Computing Research (For Graduate Students) Spring 2014-2024: Computer Networks Research Interests and Topics AI-Empowered Distributed Systems and Applications, such as MultiModal Large Model, Embodied Intelegence, Edge Computing, etc. Big Data Mining such as Time Series Analysis, Graph Computing, Social Networks Analysis AI-Empowered Networking Systems and Applications Graph Computing for Large-Scale Social Network Deep Learning for Time Series Analysis Large Model Structure Optimization and Cooperative Inference Federated Learning MultiModal Human Activity Recognition AI-Based Distributed Resource Scheduling Please refer to our AINet Group, Sino-German Institute of Social Computing, and MobileCloud homepage for more details of our research and refer to DISLAB for more information of our group. Projects Research Projects (as Principle Investigator) 2026.1-2029.12, \"Research on Optimization Mechanisms for Efficient Large-Scale Graph Neural Network Foundation Model Training\", sponsored by the National Natural Science Foundation of China (No. 62572236) Graph Neural Networks (GNNs) are a type of deep learning-based method for graph data analysis. They perform in-depth modeling of graph-structured data by aggregating node features and neighborhood information, which can capture the intrinsic patterns and deep semantic features of nodes and graph structures within the data. As a result, GNNs have broad application prospects in various fields, including social networks, communication networks, financial technology, and biomedicine. Building graph neural network founding model for large-scale graph data still suffers from the problems of poor scalability, low training efficiency, low generalization ability, and weak robustness. This project studies optimization mechanisms for efficient large-scale graph neural network training, and proposes a number of key technologies including an objective oriented adaptive sampling method and a knowledge distillation based method for graph dataset condensation, a graph partition based distributed cooperative model training mechanism, a few-shot learning based graph neural network multi-domain generalization mechanism, and a scenario-aware GNN robust optimization mechanism. The proposed methods will form a comprehensive large-scale efficient GNN foundation model training methodology, which will be implemented in a distributed machine learning platform and evaluated based on real-world large graph datasets. The outcome of the project will help to promote the development of graph data mining theory, and provides technical and intelligent support for novel AI applications, which has strong scientific significance and application value. 2022.11-2027.10, \"Research on Frontier Basic Theory and Method of Security Defense for Power Systems with High-dimensional Uncertain Factors\", sponsored by the Natural Science Foundation of Jiangsu Province Project (No. BK20222003) For the historical operational state data of large-scale power systems with high dimensionality, establish artificial intelegent theories and methods for dimensionality reduction and feature fusion of heterogeneous multi-modal data. Construct high-performance deep learning models to monitor various events under power system operational states and intelligently infer corresponding control actions. Integrate pre-trained machine learning models with risk assessment models to rapidly develop control strategies for disturbance events in new operating states during power system temporal scenario simulations, thereby providing intelligent decision-making support for continuous risk assessment of power system operations. 2024.6-2026.6, \"Embodied Intelegence and Vision Language Model for Electric Power Robot\", sponsored by the National Power Grid Technology Project Research on multi-modal feature fusion techniques for robot instruction intent understanding, and develop a Retrieval Augmented Generation (RAG) LLM method to address the challenges and inefficiencies in semantic understanding during human-robot interaction. Research on prompt learning methods for robot manipulation, developing a multi-modal chain-of-thought fine-tuning paradigm to generate specific atomic action sequences for electric power robot. 2020.1-2023.12, \"Research on Deep Learning-based Resource Scheduling Optimization in Heterogeneous Wireless Networks\", sponsored by the National Natural Science Foundation of China (No. 61972196) Heterogeneous wireless networks support diverse mobile terminals using multiple network access techniques to form a rich of applications such as crowdsensing, healthcare, and environmental monitoring. One of the most important research questions in heterogeneous wireless networks is to combine artificial intelligence technology with wireless environment to achieve intelligent resource scheduling. Targeting to improve Quality of Service (QoS) and Quality of Experience (QoE), this project focuses on the key technology of deep learning-based resource scheduling optimization in heterogeneous wireless networks. First, based on graph sampling theory and deep learning prediction model, we propose an efficient network measurement mechanism. Then, based on the theories of stochastic optimization, deep reinforcement learning, multi-task deep learning, and asynchronous model training and update, we establish multi-level resource scheduling optimization framework, which makes optimized scheduling decisions from the perspectives of network configuration, data distribution, and resource coordination between mobile terminals and cloud. Finally, we combine the above techniques to form a comprehensive deep learning-based resource scheduling system for heterogeneous wireless networks and evaluate its performance based on a real-deployed testbed. The result of our research can be applied to a wide range of scenarios such as network protocol optimization, distributed data distribution, edge computing, mobile big data processing and analysis. 2017.1-2020.12, \"Research on Cooperative Resource Offloading for Mobile Cloud Computing\", sponsored by the National Natural Science Foundation of China (No. 61672278) 2018.7-2020.6, \"Adaptive System Run-time Environment Sensing based on Deep Learning\", sponsored by the science and technology project from State Grid Corporation of China (Contract No. SGSNXT00YJJS1800031) 2014.1-2017.12, \"Research on Opportunistic Information Sharing in Mobile Social Networks\", sponsored by the National Natural Science Foundation of China (No. 61373128) 2010-2012, \"Data Distribution Strategies in Delay Tolerant Networks\", sponsored by the JiangSu Natural Science Foundation (No. BK2009100) 2009-2011, \"Efficient Cache Management Schemes in Mobile Ad Hoc Networks\", sponsored by the National Natural Science Foundation of China (No. 60803111) Other Research Projects (as Co-Investigator) ( List ) 2014.1-2016.12, \"MobileCloud: Linking Sino-European Research Institutions in the Mobile Cloud Era\", Marie Curie Actions - International Research Staff Exchange Scheme (IRSES), FP7-PEOPLE-2013-IRSES (No. 612212) Mobile cloud computing combines cloud and mobile computing techniques to enable pervasive resource sharing and information access for mobile users via heterogeneous portable devices. To mitigate the needs of mobile devices in computing capacity and resources, the mobile cloud computing paradigm allows the computing, data storage and mass information processing be offloaded to the cloud platform for enhancing the reliability and availability of services while minimizing the energy and computational requirements in mobile devices. 2009-2013, \"Research on Networked Complex Software: QoS Assurance, Development Method, and Runtime Mechanism\", sponsored by the National Basic Research Program of China (973, No. 2009CB320705) 2009-2011, \"Energy Efficient Schemes for Supporting Flexible Cache Consistency in Mobile Ad Hoc Networks\", sponsored by Hong Kong CityU Strategic Research Grant (#7002494) People PhD Students: Xiaobin Hong, Kang Xia, Yi Yang, Gong Chen, Han Zhang, Richa Hu, Xiangkai Ma, Zhiyuan Yu, Junyao Wang, Junjie Wang, Tongzhou Yu, Chuyi Chen Master Students: Yifan Ding, Yimiao Shao, Shijian Xiao, Shaojie Wang, Yi Zhang, Boran Chu, Lekai Xing, Yifan Tian, Jifeng Gao, Zehong Zhang, Wentao Shi, Haoming Li, Junde Yang Undergraduates: Weihong Ren, Ziye Yang, Yulin Qiao, Yiwen Li, Yujiang Li Visiting Students: Shuai Yu (PhD Student, Piere and Marie Curie University, Paris, May 1 - Aug 31, 2015), IDRI MOUAD (Master Student, Piere and Marie Curie University, Paris, Apr 26 - Sep 30, 2015), LAMARA Aymen (Master Student, Piere and Marie Curie University, Paris, Mar 30 - Sep 30, 2015), Senyuan Tan (Master Student, Politecnico di Milano, Apr 1 - Sep 30, 2015), Hong Huang (PhD Student, University of Goettingen, Jan 9 - Apr 9, 2015), Ahlam BEN CHEIKH (PhD Student, Piere and Marie Curie University, Paris, Apr 25 - May 25, 2014) Alumni: Yinke Wang (MS2025, Alibaba@Shanghai), Xu Zhong (MS2025, Alibaba@Guangzhou), Kaijie Lin (MS2025, Alibaba@Hangzhou), Haoran Zong (MS2025, civil servant), Peijie Li (MS2025, civil servant), Hang Yang (MS2025, Intel@Shanghai) Yuchu Fang (PhD2024, Huawei), Mingkai Lin(PhD2024, Nanjing University), Ruichen Li (MS2024, Alibaba), Guohao Li (MS2024, Huawei), Chuanze Zhu (MS2024, civil servant), Ding Li (PhD2023, Hubei University) Qingning Lu(MS2023, Jiangsu Electricity), Yizhou Chen(MS2023, Research Institute), Yeting Xu(MS2023, Microsoft), Derun Zou(MS2023, Alibaba), Jianhui Duan (MS2022, Alibaba), Yao Zeng (MS2022, Alibaba), Zhijie Zhang (",
  "content_length": 58408,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:30"
}