{
  "name": "Werner Purgathofer",
  "homepage": "https://www.cg.tuwien.ac.at/staff/WernerPurgathofer.html",
  "status": "success",
  "content": "Werner Purgathofer | TU Wien – Research Unit of Computer Graphics Skip to main content Werner Purgathofer Details TitleUniv.Prof.i.R. Dipl.-Ing. Dr.techn. Dr.h.c Function: Retired Professor Links Phone+43-1-58801-18655 E-Mailwp [at] cg.tuwien.ac.at TISS Business card ORCID iD 0000-0003-2516-7467 WikidataQ18966310 Function retired Professor of Practical Informatics at TU Wien President of the VRVis Research Center Association Teaching no more teaching due to retirement :-) Research Work Overview Publications Interests Rendering, Virtual Reality, Color, Visualization, Visual Analytics Hobbies orienteering, jogging, skiing, playing piano, reading, trying to learn Spanish, ballroom dancing Other Information My brother Peter also works for TU Wien. The VIDEA story (spam conference) Short Bio <p>Rendering, Virtual Reality, Color, Visualization, Visual Analytics,Graphics Utilities</p> Research Keywords Colors for Computer Graphics Computer Graphics Rendering Visualization Computer Games Awards Honorary Fellow2021 / Eurographics Association / SwitzerlandGuest Professor2017 / Hebei University of Technology / ChinaEurographics Gold Medal2017 / Eurographics Association / SwitzerlandDr. honoris causa2010 / Technische Universität Iasi / RomaniaDistinguished Career Award2006 / Eurographics Association / SwitzerlandMember of the European Academy of Sciences2002 / Europäische Akademie der Wissenschaft und KünsteFellow of the European Association for Computer Graphics \"Eurographics\"1997 / Eurographics Association / Switzerland Attachments CV English 250 Words CV English 150 Words CV English 80 Words CV German 250 Words CV German 150 Words CV German 80 Words News Werner Purgathofer erhält Honorary Fellowship der Eurographicsposted on 11. Mar 2022 Werner Purgathofer retiredposted on 5. Oct 2021 more Publications 277 Publications found: Image Bib Reference Publication Type 2020 Werner Purgathofer VR and Visualization in Industry, 19. October 2020, Nanchang, China Invited Talk Werner Purgathofer The Role of Visual Computing in the Digitization Process, 23. June 2020, Nanjing, China Invited Talk 2018 Werner Purgathofer Best Practice in Technology Transfer, 19. April 2018, Eurographics Industrial Presentations, Delft, NL WorkshopTalk Werner Purgathofer Wolfgang Straßer Memorial Lecture: His Engagement for Vienna and Austria, 15. March 2018, Riezlern, A Invited Talk Andreas Reichinger, H. G. Carrizosa, J. Wood, S. Schröder, C. Löw, Laura R. Luidolt, Maria Schimkowitsch, Anton Fuhrmann, Stefan Maierhofer, Werner Purgathofer Pictures in Your Mind: Using Interactive Gesture-Controlled Reliefs to Explore Art ACM Transactions on Accessible Computing, (2), March 2018. Journal Paper (without talk) 2017 Werner Purgathofer From Visualization to Decision Support, 29. September 2017, Hangzhou, China Invited Talk Werner Purgathofer From Visualization to Decision Support, 28. September 2017, Nanjing, China Invited Talk Werner Purgathofer Visual Computing als Interface zur Entscheidungsunterstützung, 4. July 2017, Wien Invited Talk 2016 Werner Purgathofer Visual Computing — a best practice from Vienna, 8. December 2016, Moskau Invited Talk Andreas Reichinger, Stefan Maierhofer, Anton Fuhrmann, Werner Purgathofer Gesture-Based Interactive Audio Guide on Tactile Reliefs Proceedings of the 18th International ACM SIGACCESS Conference on Computers & Accessibility, October 2016. [image] [Paper] Journal Paper with Conference Talk Andreas Reichinger, Werner Purgathofer Spaghetti, Sink and Sarcophagus: Design Explorations of Tactile Artworks for Visually Impaired People In Proceedings of the 9th Nordic Conference on CHI 2016. October 2016. Conference Paper Andreas Reichinger, Anton Fuhrmann, Stefan Maierhofer, Werner Purgathofer A Concept for Re-Useable Interactive Tactile Reliefs In A Concept for Re-Useable Interactive Tactile Reliefs. 2016. [image] [paper] Conference Paper 2015 Werner Purgathofer, Clemens Arth, Dieter Schmalstieg Industrial Use of Mixed Reality in VRVis Projects In Proceedings of VISIC, pages 19-23. September 2015. Conference Paper Werner Purgathofer Was ist denn Farbe eigentlich?, 2015, Kunst-Volkshochschule Wien Invited Talk Werner Purgathofer Visual Computing in Österreich, 2015, Wien Invited Talk Werner Purgathofer Computer Graphics in Real-World Applications, 2015, Wien Invited Talk Werner Purgathofer Industrial Use of Mixed Reality in VRVis Projects, 2015, Beijing, China Invited Talk Werner Purgathofer Überblick Visual Computing: Teilbereiche und Anwendungsfelder, 2015, Wien [Talk slides ] Invited Talk 2014 Kresimir Matkovic, Denis Gracanin, Rainer Splechtna, M. Jelovic, Benedikt Stehno, Helwig Hauser, Werner Purgathofer Visual Analytics for Complex Engineering Systems: Hybrid Visual Steering of Simulation Ensembles IEEE Transactions on Visualization and Computer Graphics, 20(12):1803-1812, December 2014. Journal Paper with Conference Talk Werner Purgathofer Requirements on the Staff of an Application Oriented Research Organization In Current Issues of Science and Research in the Global World, December 2014 Article in a Book Manuela Waldner, Mathieu Le Muzic, Matthias Bernhard, Werner Purgathofer, Ivan Viola Attractive Flicker: Guiding Attention in Dynamic Narrative Visualizations IEEE Transactions on Visualization and Computer Graphics, 20(12):2456-2465, December 2014. [paper] [Preview video] [Submission video] Journal Paper with Conference Talk Werner Purgathofer, Hans Jürgen Pfisterer A Live Services Marketplace: Telepresence through Remote Humans TR-186-2-14-1, May 2014 Technical Report Werner Purgathofer Application Oriented Research at the VRVis Center, 2014, HS3, Währinger Str. 29, Informatik, Uni Wien Invited Talk Werner Purgathofer Aspects of Scientific Research in Cooperation with Companies, 2014, Zürich, Switzerland Invited Talk Werner Purgathofer Accurate Fast Simulation of Light, 2014, Ankara, Turkey Invited Talk Werner Purgathofer Requirements on the Staff of an Application Oriented Research Organization, 2014, Vienna, Austria Invited Talk Werner Purgathofer Computer Graphics in Vienna and at the VRVis Research Center, 2014, Rio de Janeiro, Brazil Invited Talk 2013 Przemyslaw Musialski, Peter Wonka, Daniel G. Aliaga, Michael Wimmer, Luc van Gool, Werner Purgathofer A Survey of Urban Reconstruction Computer Graphics Forum, 32(6):146-177, September 2013. [draft] Journal Paper (without talk) Irene Reisner-Kollmann, Stefan Maierhofer, Werner Purgathofer Reconstruction of Shape Boundaries with Multimodal Constrains Computer & Graphics, 37(3):137-147, May 2013. [Paper] Journal Paper (without talk) Werner Purgathofer Accurate Fast Simulation of Light, 4. February 2013- 6. February 2013, Hernstein, Austria Invited Talk Werner Purgathofer Visual Computing Research inspired by Applications, 2013, Graz Invited Talk 2012 Gottfried Eibner, Anton Fuhrmann, Werner Purgathofer GPU-based Multi-Resolution Image Analysis for Synthesis of Tileable Textures In Proceedings Intern. Symposium on Visual Computing (ISVC 2012), pages 479-488. July 2012. [Paper] Conference Paper Przemyslaw Musialski, Peter Wonka, Daniel G. Aliaga, Michael Wimmer, Luc van Gool, Werner Purgathofer A Survey of Urban Reconstruction In EUROGRAPHICS 2012 State of the Art Reports, pages 1-28. May 2012. [draft-hires] [draft-lowres] Other Reviewed Publication Kresimir Matkovic, H. Gan, Andreas Ammer, D. Bennett, Werner Purgathofer, Marius Terblanche INTERACTIVE VISUAL ANALYSIS OF INTENSIVE CARE UNIT DATA: Relationship Between Serum Sodium Concentration, its Rate of Change, and Survival Outcome In Proceeding of IVAAP 2012, pages 648-659. February 2012. [Paper] Conference Paper Andreas Reichinger, Florian Rist, M. Neumüller, Stefan Maierhofer, Werner Purgathofer Computer-Aided Design of Tactile Models – Taxonomy and Case-Studies In Computers Helping People with Special Needs, pages 497-504, 2012 [Paper] Article in a Book 2011 Martin Knecht, Christoph Traxler, Werner Purgathofer, Michael Wimmer Adaptive Camera-Based Color Mapping For Mixed-Reality Applications In Proceedings of the 2011 IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2011), pages 165-168. October 2011. [Preprint] [Video] Conference Paper H. Gan, Kresimir Matkovic, Andreas Ammer, Werner Purgathofer, W. Bennett, M. Terblanche Interactive Visual Analysis of a large ICU database - a novel approach to data analysis Poster shown at 31st International Symposium on Intensive Care and Emergency Medicine (22. March 2011-25. March 2011) [Paper] Poster Daniel Scherzer, Michael Wimmer, Werner Purgathofer A Survey of Real-Time Hard Shadow Mapping Methods Computer Graphics Forum, 30(1):169-186, February 2011. [pdf] Journal Paper (without talk) Stephan Mantler, Gerd Hesina, Michael Greiner, Werner Purgathofer GEARViewer: A State of the Art Real-Time Geospatial Visualization Framework In Proceedings of CORP 2011, pages 345-354. 2011. Conference Paper Andreas Reichinger, Stefan Maierhofer, Werner Purgathofer High-Quality Tactile Paintings In Eurographics 2011 - Areas Papers, pages 1-8. 2011. Conference Paper 2010 Przemyslaw Musialski, Christian Luksch, Michael Schwärzler, Matthias Buchetics, Stefan Maierhofer, Werner Purgathofer Interactive Multi-View Façade Image Editing In Vision, Modeling and Visualization Workshop 2010. November 2010. [draft] Conference Paper Martin Knecht, Christoph Traxler, Oliver Mattausch, Werner Purgathofer, Michael Wimmer Differential Instant Radiosity for Mixed Reality In Proceedings of the 2010 IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2010), pages 99-107. October 2010. [paper] Conference Paper Kresimir Matkovic, Andreas Ammer, Denis Gracanin, Werner Purgathofer, Alan Lez Event Line View: Interactive Visual Analysis of Irregular Time-dependent Data In Smart Graphics 2010. June 2010. [Paper] Conference Paper Martin Ilčík, Stefan Fiedler, Werner Purgathofer, Michael Wimmer Procedural Skeletons: Kinematic Extensions to CGA-Shape Grammars In Proceedings of",
  "content_length": 11492,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:32"
}