{
  "name": "Wesley J. Willett",
  "homepage": "http://www.wjwillett.net",
  "status": "success",
  "content": "wesley willett ✕ wesleyjwillett. I am computer scientist specializing in information visualization, social computing, new media, and human computer interaction. I am currently an Associate Professor and Canada Research Chair in Visual Analytics at the University of Calgary where I lead the Data Experience Lab. I am a faculty member in the Computer Science, Computational Media Design, and Data Science programs and a part of the Interactions Lab. From 2012-2014 I was a post-doctoral researcher in the AVIZ group at INRIA-Saclay in Paris. Prior to that, I completed my Ph.D. at UC Berkeley's Department of Computer Science, where I was advised by Maneesh Agrawala and was a member of the Berkeley Institute of Design (BiD) and the Visualization Lab. I also raced mountain bikes with the Cal Cycling team. I'm originally from southern Colorado and completed my undergrad at CU Boulder. info | Google Scholar | Google Scholar | wj {at} wjwillett.net ✕ research For current publications see my research group (the Data Experience Lab) at the University of Calgary. ✕ pre-2015 publications(2k5-2k15) Understanding Digital Note-Taking Practice for Visualization (CG&A Jul/Aug 2015) Lightweight Relief Shearing for Enhanced Terrain Perception on Interactive Maps (CHI '15) Best Paper Award | video Patterns of Physical Design Remixing in Online Maker Communities (CHI '15) Exploring the Placement and Design of Word-Scale Visualizations (InfoVis '14) Eliciting Multi-touch Selection Gestures for Interactive Data Graphics (EuroVis '14) Identifying Redundancy and Exposing Provenance in Crowdsourced Data Analysis (VAST '13) Hybrid-Image Visualization for Large Viewing Environments (InfoVis '13) Illustrative Data Graphic Elements in the 18th-19th Century Style showcase | poster (Expressive '13) poster (VIS '13) Visualizing Gulfs and Streaks - Peripheral Support for Goal-Setting & Habit-Forming in Personal Informatics (CHI Workshops '13) Tools & Strategies for Social Data Analysis (Ph.D. Thesis) Strategies for Crowdsourcing Social Data Analysis (CHI '12) CommentSpace: Structured Support for Collaborative Visual Analysis (CHI '11) Honorable Mention Common Sense Community (Pervasive'10) Best Paper Award Generalized Selection Via Interactive Query Relaxation (CHI '08) Scented Widgets (InfoVis '07) Batch Rekeying in Mykil Key Management System (PDCS '05) ✕ other projects Medley site (a tool to visualize Evernote notes) Cetonia site (VIS 2014 Death of the Desktop) PostCard poster (UCB cnm290) EEL images (design piece) Arithmetic Coding Explorer site (UCB cs270) Envismo poster | paper (UCB cs262A) Generating Hiking Route Maps poster | paper (UCB cs294-10) Motion-Based Control for Guitar Effects Processing paper (UCB is290-13) Next/Last poster (UCB cnm290) Propinquity site (a digital graphic short story) Space Storm images (planetarium show) Fiske Planetarium images (planetarium advertising) Cal Cycling Kit 2008-2012 flickr (jersey and branding)",
  "content_length": 2966,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:33"
}