{
  "name": "Wessel Kraaij",
  "homepage": "https://liacs.leidenuniv.nl/~kraaijw",
  "status": "success",
  "content": "Homepage - Wessel Kraaij I am a full Professor of ‘Applied Data Analytics’ at Leiden University and a Principal Scientist at TNO (The Netherlands Organisation for applied scientic research). My research theme is ‘algorithms for evidence based decision & policy making’.  The key challenge is to make sense of large amounts of often unstructured data. This research area combines aspects from human machine interaction, design of algorithms, signal processing, semantic representations, reasoning, learning and abstraction. I have worked in several domains: natural language and speech interfaces, dialogue systems,  information retrieval in several domains and modalities. In particular I developed some extensions of generative probabilistic models for IR for particular tasks, taking advantage of prior knowledge about the task structure. I also have a keen interest in multimedia information retrieval, another example of unstructured data. More recently I have become interested in topics related to data science. I have been PI of a large project focused on the use of sensor data such as quantified self data as a means for self management for health. Typical challenges here are the interpretation of heterogeneous sensor data, privacy preserving data analysis, causal inference,  personalization and designing studies for effectiveness measurement. I really enjoy the interdisciplinary spirit of data science projects using e.g. behavioural analytics for eHealth and mHealth. Combining behavioural sciences and computational sciences does have a lot of potential, provided proper legal and ethical principles are respected. I try to  initiate and run projects with a clear societal impact. A recent focus of attention is empowering citizens and patients in maintaining and improving their health. behavioural changecontexthealth dataPrana Dataquery expansionsensorsSwelltrecvidvideowork stress Recent Posts Vacancy for a PhD candidate in Knowledge Discovery Media: BNR Beter over Data Science voor gezondheid Inaugurele rede: Data van Waarde / Inaugural lecture: Data of Value Blind late fusion in multimedia event retrieval Evaluation of context-aware recommendation systems for information re-finding Search for: Archives January 2018 March 2017 February 2017 December 2016 September 2016 July 2016 May 2016",
  "content_length": 2317,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:35"
}