{
  "name": "Weverton Cordeiro",
  "homepage": "http://inf.ufrgs.br/~wlccordeiro",
  "status": "success",
  "content": "Weverton Cordeiro – Assistant Professor @ INF/UFRGS Skip to content Welcome to my home page! I am an Assistant Professor (since 2017) at the Institute of Informatics (INF) of the Federal University of Rio Grande do Sul (UFRGS). I hold a Ph.D. degree from UFRGS (2014). I am also member of the Postgraduate Program in Computing (PPGC) at UFRGS (CAPES 7), and Brazil CNPq Research Fellow (PQ-E) since 2018. My curriculum vitae (lattes) can be found at http://lattes.cnpq.br/0458322041606755 My research is broadly focused in the field of networking. I’m currently interested on the following topics: community networks (how to bridge the digital divide, and design low-end devices for networking in the Amazon region); blockchain (secure transaction verification); software defined networking (measurement and monitoring, security); programmable forwarding planes (programmable switch virtualization, data plane monitoring, verification of forwarding plane software); network function virtualization (placement and chaining of virtual functions). I recently began working with machine learning applied to public health (design of smartphone apps for tracking down mosquitoes) and e-commerce (unveiling users behind shared accounts). I’m also working with fault tolerant large in scale experiments. Finally, I have an interest on algorithm analysis and design, and software engineering. news and updates Ou work “Acoustic Identification of Ae. aegypti Mosquitoes using Smartphone Apps and Residual Convolutional Neural Networks” accepted for publication at Springer Biomedical Signal Processing and Control April 8, 2024 Ou work “SPINNER: Enabling In-network Flow Clustering Entirely in a Programmable Data Plane” accepted for IEEE/IFIP NOMS 2024 December 23, 2023 Research project “Programmable Low-End Networks: Powering Internet Connectivity for the Other Three Billion” accepted for funding by Brazilian FAPESP October 11, 2023",
  "content_length": 1928,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:37"
}