{
  "name": "Wheeler Ruml",
  "homepage": "http://www.cs.unh.edu/~ruml",
  "status": "success",
  "content": "Wheeler Ruml's Home Page Wheeler Ruml Greetings! I am a Professor in the Department of Computer Science at the University of New Hampshire. Before joining UNH in 2007, I managed the Embedded Reasoning Area and was a member of the research staff at the Palo Alto Research Center (formerly Xerox PARC). I received my PhD from Harvard University in 2002. A full CV is here. A picture of me when not under attack by a robot is here. Research Interests My main research is in artificial intelligence, although I also have interests in robotics, operations research, data science, information visualization, and cognitive science. Very broadly, my goal is to understand how to build autonomous systems - for example, how a robot should decide what to do next. (Several of my former graduate students work at self-driving car companies.) I'm also interested in decision support systems and in natural examples of cognition, such as humans. My current focus is on methods for heuristic search and planning, especially in robotics. In particular, I am interested in solving problems quickly (rational time-bounded decision-making) and in how on-line learning can inform optimization algorithms. I also enjoy experimental algorithmics. Almost all of my papers are available on-line (also includes some talks and tutorials). Please help yourself! I'm always happy to collaborate with people inside and outside of UNH on topics involving my research interests. Just send me email to set up a time to talk. If you are at UNH, you might want to check out the UNH AI Group wiki and join the group. Information is also available about robotics at UNH and data science at UNH. If you are considering applying to UNH for graduate school or an internship, please consult my information for prospective students. Advertising The Journal of Artificial Intelligence Research (JAIR) serves the public interest by disseminating rigorously peer-reviewed science freely to all. To learn more about open access, here is one place to start. The International Symposium on Combinatorial Search (SoCS) provides a forum for research on combinatorial search and heuristic optimization. While AI is heavily represented, work from robotics, CP, OR, and algorithms is very welcome. The International Conference on Automated Planning and Scheduling (ICAPS) provides a forum for research on all kinds of problems in planning and associated functions such as execution management. Jordan has some nice visualizations of heuristic search, suitable for classroom use. Teaching Spring 2026: CS 730/830 Introduction to Artificial Intelligence. Here are the raw student reviews. Fall 2025: CS 758/858 Algorithms. Here are the raw student reviews. CS 980 Advanced Topics: Planning for Robots If you're looking for an informal way to learn about AI, feel free to drop in at the UNH AI Group meetings. Contact Information Email is definitely the best way to reach me: myfourletterlastname at cs.unh.edu. Unfortunately, I've had to start using a spam filter, so in the unlikely event that I don't respond within a couple of days, please feel free to ping me again or give me a call. Office Phone: +1-603-862-2683 Teams, Zoom, Google Meet, etc are also options - just let me know in advance. Postal mail, express mail, couriers: UNH Computer Science Kingsbury Hall 33 Academic Way Durham, NH 03824-2619 USA UNH CS on Google Maps. If you're on campus, my office is Kingsbury N215D. My office hours for Fall 2024 are Mondays 11am-noon, but feel free to email me to set up an alternate time. I'm open to meeting in-person or via teams/zoom, whatever works best for you. If you're not on campus but wish you were, there are webcams on Route 4 near Newington. Personal My last name is pronounced `RUM-uhl' (rhymes with `pummel'). Here is a list of things I would recommend. Some photographs I've taken are posted here.",
  "content_length": 3865,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:38"
}