{
  "name": "Wieland Schwinger",
  "homepage": "https://www.jku.at/institut-fuer-telekooperation/ueber-uns/team/wieland-schwinger",
  "status": "success",
  "content": "Wieland Schwinger | Institut für Telekooperation Zum Inhalt springen (Accesskey: 1) Zur Suche springen (Accesskey: 2) Assoz.Univ.-Prof. Mag. Dr. Wieland Schwinger Forschung und Lehre Mitarbeiter Science Park 3 - 4. Stock - 0424 +43 732 2468 4685 wieland.schwinger(at)jku.at Zum Forschungsprofil, öffnet eine externe URL in einem neuen Fenster Zum Seitenanfang scrollen Johannes Kepler Universität Linz Altenberger Straße 69 4040 Linz, Österreich T Telefon +43 732 2468 0 Kontakt Hinweis zu Cookies Unsere Website verwendet Cookies, um die grundlegende Funktionalität unserer Website zu gewährleisten sowie die Zugriffe auf unserer Website zu analysieren und um Funktionen für soziale Medien und zielgerichtete Werbung anbieten zu können. Hierzu ist es nötig Informationen an die jeweiligen Dienstanbieter weiterzugeben. Weitere Informationen zu Cookies auf der Website finden Sie in unserer Datenschutzerklärung . Einstellungen Erforderliche Cookies Diese Cookies werden für eine technisch reibungslose Funktion unserer Website benötigt. Name Zweck Ablauf Anbieter CookieConsent Speichert Ihre Einstellungen zur Verwendung von Cookies auf dieser Website. 1 Jahr JKU Webstatistik Cookies Mit Hilfe dieser Cookies können wir unser Angebot laufend verbessern und unsere Website an Ihre Bedürfnisse anpassen. Dabei werden pseudonymisierte Daten über die Websitenutzung gesammelt und statistisch ausgewertet. Name Zweck Ablauf Anbieter _ga Wird verwendet, um Benutzer zu unterscheiden. 2 Jahre Google _gid Wird verwendet, um Benutzer zu unterscheiden und die Nutzung der Website zu analysieren. Es werden anonyme Daten zur Anzahl von Besuchern, die besuchten Seiten und die Quelle des Zugriffes erfasst. 1 Tag Google _gat_UA-112203476-1 Wird zum Drosseln der Anfragerate bei Google Analytics für Websites mit hohen Nutzerzahlen verwendet. 1 Minute Google __Secure-ENID Wird in Zusammenhang mit Google-Diensten verwendet. Das Cookie dient primär der Sicherheit und Authentifizierung. 13 Monate Google AEC Wird verwendet, um unbefugten Zugriff und Cross-Site-Request Forgery (CSRF) Angriffe zu verhindern. 6 Monate Google SOCS Wird verwendet, um die Cookie-Einstellungen des Users zu speichern. 13 Monate Google _pk_id Wird verwendet, um einige Details über den Benutzer zu speichern wie z.B. die eindeutige Besucher-ID. 13 Monate JKU _pk_ses Kurzlebiges Cookie, welches verwendet wird, um Daten für den Besuch vorübergehend zu speichern. 30 Minuten JKU _pk_ref Wird benutzt, um die Informationen der Herkunftswebsite des Benutzers zu speichern. 6 Monate JKU Marketing Cookies Mit Hilfe dieser Cookies können wir unser Angebot für Sie noch attraktiver gestalten und unsere Werbe- und Websiteinhalte optimieren. Dabei werden pseudonymisierte Daten über die Websitenutzung analysiert und beurteilt. Name Zweck Ablauf Anbieter _ga Wird verwendet, um Benutzer zu unterscheiden. 2 Jahre Google _gid Wird verwendet, um Benutzer zu unterscheiden und die Nutzung der Website zu analysieren. Es werden anonyme Daten zur Anzahl von Besuchern, die besuchten Seiten und die Quelle des Zugriffes erfasst. 1 Tag Google _gcl_au Wird verwendet, um zwischen User und Userverhalten zu unterscheiden. 3 Monate Google _gac_UA-112203476-1 Enthält Kampagneninformationen und dient der Messung des Kampagnenerfolges von Google AdWords Kampagnen. 90 Tage Google test_cookie Wird testweise gesetzt, um zu prüfen, ob der Browser das Setzen von Cookies erlaubt. Enthält keine Identifikationsmerkmale. 15 Minuten Google IDE Enthält eine zufallsgenerierte User-ID. Anhand dieser ID kann Google den User über verschiedene Websites domainübergreifend wiedererkennen und personalisierte Werbung ausspielen. 1 Jahr Google _gcl_aw Dieses Cookie wird gesetzt, wenn ein User über einen Klick auf eine Google Werbeanzeige auf die Website gelangt. Es enthält Informationen darüber, welche Werbeanzeige geklickt wurde, sodass erzielte Erfolge wie z.B. Bestellungen oder Kontaktanfragen der Anzeige zugewiesen werden können. 3 Monate Google AMCV_xx Enthält eine zufallsgenerierte User-ID. Anhand dieser ID kann die Adobe Marketing Cloud den User über verschiedene Websites domainübergreifend wiedererkennen und personalisierte Werbung ausspielen. 3 Jahre LinkedIn bcookie Enthält eine ID des Browsers. 2 Jahre LinkedIn bscookie Enthält eine ID des Browsers bei einer sicheren Verbindung. 2 Jahre LinkedIn lang Wird verwendet, um die Spracheinstellung des Besuchers zu speichern. Session LinkedIn lidc Wird verwendet, um Benutzer zu unterscheiden und die Nutzung der Website zu analysieren. Es werden anonyme Daten zur Anzahl von Besuchern, die besuchten Seiten und die Quelle des Zugriffes erfasst. 1 Tag LinkedIn lissc Wird für die Analyse der Nutzung von eingebetteten Dienstleistungen verwendet. 1 Jahr LinkedIn UserMatchHistory Enthält Kampagneninformationen und dient der Messung des Kampagnenerfolges. 30 Tage LinkedIn fr Enthält Kampagneninformationen und dient der Messung des Kampagnenerfolges. 90 Tage Facebook fbp Wird von Facebook genutzt, um eine Reihe von Werbeprodukten anzuzeigen, zum Beispiel Echtzeitangebote dritter Werbetreibender. 90 Tage Facebook sc_at Wird verwendet, um Benutzer über mehrere Domains hinweg zu unterscheiden. 1 Jahr Snap sc-country Dieses Cookie unterscheidet das Land des Benutzers. 1 Tag Snap uid Dieses Cookie enthält eine zufallsgenerierte User-ID und wird für das Ausspielen und die Echtzeitermittlung der Preise für Anzeigen für differenzierte Zielgruppen verwendet. 60 Tage Adform C Identifiziert und speichert ob Nutzer Cookies akzeptieren. Wert 1: Cookies sind erlaubt, Wert 3: Cookies sind nicht erlaubt. 30 Tage Adform _scid_r Wird verwendet, um User anhand einer eindeutigen ID zu identifizieren und maßgeschneiderte Werbung basierend auf den Useraktivitäten zu liefern. Es dient zur Optimierung von Werbeinhalten und Kampagnen. 13 Monate Snapchat _scid Wird verwendet, User anhand einer eindeutigen ID zu identifizieren und über verschiedene Websites hinweg zu verfolgen und gezielte Werbung basierend auf dem Userverhalten anzuzeigen. 13 Monate Snapchat X-AB Cookie steht in Zusammenhang mit Snapchat-Inhalten. 1 Tag Snapchat _ScCbts Wird verwendet, um Werbeanzeigen zu optimieren, Inhalte zu personalisieren, Sicherheitsmaßnahmen zu verbessern und die Nutzung zu analysieren. 7 Tage Snapchat li_gc Wird verwendet, um die Cookie-Einstellungen für User ohne LinkedIn Registrierung zu speichern. 6 Monate LinkedIn Auswahl speichern und zustimmen Allen Cookies zustimmen",
  "content_length": 6474,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:35"
}