{
  "name": "Wil M. P. van der Aalst",
  "homepage": "http://www.vdaalst.com",
  "status": "success",
  "content": "Homepage Wil van der Aalst, RWTH Aachen University and Celonis Wil van der Aalst is full professor at RWTH Aachen University, leading the Process and Data Science group, and chief scientist at Celonis. Check out my publications! More about WvdA More on process mining Check out the latest news! 2024 Publications are available Also visit the PADS site for news Follow on LinkedIn Welcome to my virtual home! If you are interested in process mining, data science, process management, workflow automation, process intelligence, Petri nets, business process simulation, concurrency theory, BPM, machine learning, AI, or anything else related to processes and data, this website is the right place to look. Please check out my publications on these topics and use our software tools. We specialize in process mining. Process mining bridges the gap between traditional model-based process analysis (e.g., simulation and other business process management techniques) and data-centric analysis techniques such as machine learning and data mining. About Wil van der Aalst Prof.dr.ir. Wil van der Aalst is a full professor at RWTH Aachen University, leading the Process and Data Science (PADS) group. He is also the Chief Scientist at Celonis, part-time affiliated with the Fraunhofer FIT. He also has an unpaid professorship position at Queensland University of Technology (since 2003). Currently, he is also deputy CEO of the Internet of Production (IoP) Cluster of Excellence, co-director of the RWTH Center for Artificial Intelligence, and speaker of the RWTH ICT Profile Area. His research interests include process mining, data science, Petri nets, process management, workflow management, process modeling, and process analysis. Wil van der Aalst has published over 300 journal papers, 35 books (as author or editor), 720 refereed conference/workshop publications, and 90 book chapters,. Many of his papers are highly cited (he one of the most cited computer scientists in the world; according to Google Scholar, he has an H-index of 184 and has been cited over 158,000 times) and his ideas have influenced researchers, software developers, and standardization committees working on process support. Next to serving on the editorial boards of over ten scientific journals, he played an advisory role for several companies. He is often called the Godfather of Process Mining and the research he started in the late 1990-ties led to a wave of process mining tools, including commercial tools like Celonis, Disco, Apromore, UiPath Process Mining (ProcessGold), SAP Signavio Process Intelligence, ARIS Process Mining (Software AG), Abbyy Timeline, Appian Process Mining (LanaLabs), IBM Process Mining (myInvenio), Minit (Microsoft), Mehrwerk, QPR Process Mining, Skan, UltimateSuite, Mindzie, Nintex, PuzzleData ProDiscovery, Kofax, LiveJourney, iGrafx, Logpickr, Decisions Process Mining, Synesa, Everflow (Pega), Process Discovery Automation Anywhere (FortressIQ), BusinessOptix, Datricks, PAFnow (Celonis), DCR Process Mining, Oniq, Noreja, Mavim Process Mining, Process Science, Promease, Scout Process Discovery, Workfellow, Stereologic, UpFlux, Worksoft Process Mining, , etc. and open source tools like ProM, ProM Lite, RapidProM, OCPM, OCpi, Cortado, pm4py, PM4knime, bupaR, etc. Van der Aalst received honorary degrees from the Moscow Higher School of Economics (Prof. h.c.), Tsinghua University, and Hasselt University (Dr. h.c.). He is also an IFIP Fellow, IEEE Fellow, ACM Fellow, and elected member of the Royal Netherlands Academy of Arts and Sciences (Koninklijke Nederlandse Akademie van Wetenschappen), Royal Holland Society of Sciences and Humanities (Koninklijke Hollandsche Maatschappij der Wetenschappen), the Academy of Europe (Academia Europaea), the North Rhine-Westphalian Academy of Sciences, Humanities and the Arts (Nordrhein-Westfälische Akademie der Wissenschaften und der Künste), and the German Academy of Science and Engineering (Deutsche Akademie der Technikwissenschaften). In 2018 he was awarded an Alexander-von-Humboldt Professorship, Germany’s most valuable research award (five million euros). Contact Me Postal address: Prof.dr.ir. Wil van der Aalst, Lehrstuhl für Informatik 9 / Process and Data Science, RWTH Aachen University, D-52056 Aachen, Germany Visiting address: Prof.dr.ir. Wil van der Aalst, Lehrstuhl für Informatik 9 / Process and Data Science, Ahornstr. 55, Gebäude E2, Raum 6321, RWTH Aachen University, D-52074 Aachen, Germany Coordinates: 50.77819449526827,6.061220586416312 Phone: +49 241 8021900 (direct) +49 241 8021901 (secretary) E-mail: wvdaalst@pads.rwth-aachen.de Links Lehrstuhl für Informatik 9 / Process and Data Science Celonis Department of Computer Science at RWTH Best Computer Science Scientists (Research.com) Google Scholar Profile Publications in the DBLP Computer Science Bibliography Process Mining (processmining.org) RWTH Aachen University ProM (Process Mining Framework) PM4Py (Process Mining for Python) CPN Tools (Petri nets/Simulation) YAWL (BPM/Workflow system) Researchgate Alexander von Humboldt Foundation Architecture of Information Systems (AIS) Process Mining @ Fraunhofer FIT Data Science Center Eindhoven (DSC/e) Mathematics and Computer Science @ TU/e Eindhoven University of Technology (TU/e) Queensland University of Technology (QUT) Fondazione Bruno Kessler (FBK) International Laboratory of Process-Aware Information Systems (PAIS Lab) Petri Nets BPM Conference Series SIKS Research School Workflow Patterns BPMcenter.org IEEE Task Force on Process Mining BPM Round Table Process Mining: Data science in Action (Coursera) Royal Holland Society of Sciences and Humanities (Koninklijke Hollandsche Maatschappij der Wetenschappen) Academia Europaea (The Academy of Europe) Royal Netherlands Academy of Arts and Sciences (Koninklijke Nederlandse Akademie van Wetenschappen) Personal (In Eersel is 'ne mens content) Publications See my publications page or my DBLP page. Also note the \"process mining bible\" Process Mining: Data Science in Action. Follow on LinkedIn",
  "content_length": 6062,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:41"
}