{
  "name": "Wilfried Elmenreich",
  "homepage": "https://mobile.aau.at/~welmenre",
  "status": "success",
  "content": "Prof. Dr. Wilfried Elmenreich Wilfried Elmenreich Wilfried Elmenreich Professor of Smart GridsAlpen-Adria-Universität Klagenfurt, Austria News About myself Research Publications Serving Projects Programming Univ.-Prof. Dr.techn. Wilfried Elmenreich Smart Grids Group Alpen-Adria-Universität Klagenfurt 9020 Klagenfurt Austria Email: wilfried.elmenreichaau.at Tel: +43-463-2700-3649 Fax: +43-463-2700-993649 Short Biography Wilfried Elmenreich is professor for Smart Grids at the Institute of Networked and Embedded Systems at the Alpen-Adria-Universität Klagenfurt, Austria. His research interests include intelligent energy systems, self-organizing systems and technical applications of swarm intelligence. He is also affiliated with the Lakeside Labs cluster in Klagenfurt, a research and innovation cluster on self-organizing networked systems. He studied computer science at the Vienna University of Technology, where he received his doctoral degree in 2002 with distinction. He was granted venia docendi in the field computer engineering from Vienna University of Technology in 2008. He was a visiting researcher at the Vanderbilt University in 2005 and at the CISTER/IPP-Hurray Research Unit at the Polytechnic Institute of Porto in 2007. In 2007 he moved to Alpen-Adria-Universität Klagenfurt as a senior researcher. In Winter term 2012-2013 he was acting professor for complex systems engineering at the University of Passau. Since April 2013, he holds a professorship for Smart Grids at Alpen-Adria-Universität Klagenfurt. He is author or editor of several books and published over 200 papers in the field of networked and embedded systems. Elmenreich is senate member of Alpen-Adria-Universität Klagenfurt, Senior Member of IEEE and counselor of Klagenfurt's IEEE student branch. His Erdős Number is 3. Blogs, etc. My Blog on self-organized networked systems My Blog on smart grids My Blog on networking embedded systems Some theses I supervised as best-practise examples Links to institutes that crossed my path Institute of Networked and Embedded Systems at the University of Klagenfurt University of Passau Lakeside Labs Institute of Computer Engineering at the Vienna University of Technology CISTER (Research Centre in Real-Time Computing Systems) at the Polytechnic Institute of Porto (IPP) Institute of Software Integrated Systems at Vanderbilt University Real-Time Systems and Communication at Otto-von-Guericke University Magdeburg Wilfried Elmenreich's Profile at Linked In Wilfried Elmenreich on ResearchGate Find me at Upcoming Events The IEEE International Conference on Industry 4.0, Artificial Intelligence, and Communications TechnologyJuly 3-5, 2025, Bali, Indonesia The Genetic and Evolutionary Computation Conference (GECCO 2025)July 14-18, 2025, Malaga, Spain 16th Doctoral Workshop Energy Informatics 2025Co-located with the DACH+ Energy Informatics ConferenceSeptember 17, 2025, Aachen, Germany D-A-CH+ Energieinformatik 2025September 17-19, 2025, Aachen, Germany Energy Informatics.Academy Conference 2025 (EI.A 2025)December 3-5, 2025, Kuala Lumpur, Malaysia © 2011 Wilfried Elmenreich. Website template by Arcsin",
  "content_length": 3147,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:39"
}