{
  "name": "Wilhelm Hasselbring",
  "homepage": "https://www.se.informatik.uni-kiel.de/en/team/prof.-dr.-wilhelm-willi-hasselbring",
  "status": "success",
  "content": "Software Engineering Unsere Hauptinteressen in Forschung und Lehre liegen im Bereich Software Engineering mit den Schwerpunkten Software System Quality, Software Architekturdesign und -evaluierung, Software Visualisierung und Reverse Engineering, Software Monitoring und Profiling, verteilte Systeme, komponentenbasierte Softwareentwicklung, Microservices und DevOps für Continuous Software Engineering, Middleware für Grid-, Cloud- und Enterprise-Systeme, Forschungsdaten- und Softwaremanagement sowie Open Science im Allgemeinen. Start Forschung Publikationen Lehre Themen für studentische Abschlussarbeiten Team Events News Prof. Dr. Wilhelm Hasselbringhasselbring@email.uni-kiel.de+49 431 880-4664Christian-Albrechts-Platz 424118 KielRaum: 1217 (CAP 4) Kontakt © Malte HansenUm große Softwaresysteme zu verstehen, sind fortgeschrittene Analysetechniken unerlässlich. Unsere Forschung konzentriert sich auf dynamische und statische Analysemethoden für Software und Benutzerverhalten. Für die Benutzerinteraktion entwickeln wir innovative Visualisierungstechniken, wie z.B. die Stadtmetapher. Wir arbeiten mit Domänenexperten aus verschiedenen Bereichen zusammen, darunter Meeresforschung, industrielles Internet der Dinge und Landwirtschaft. © Henning SchnoorDamit Software langfristig genutzt und weiterentwickelt werden kann, ist deren Qualität essentiell. Basierend auf den Ergebnissen und Modellen, die wir mit unseren Softwareanalyseverfahren erstellen, wenden wir verschiedene Methoden zur Bewertung der Softwarequalität an. Wir bewerten strukturelle Eigenschaften wie Modularisierung sowie Performanz und Skalierbarkeit. Um die Qualität bestehender Softwaresysteme zu verbessern, setzen wir evolutionäre Algorithmen ein. © Software Sustainability InstituteForschungssoftware wird entworfen und entwickelt, um Forschungsaktivitäten in verschiedenen Bereichen wie Natur- und Geisteswissenschaften zu unterstützen. Research Software Engineering (RSE) ist die Disziplin, die sich mit der Entwicklung von Software für die Forschung beschäftigt. Unsere Arbeit in der RSE-Forschung zielt darauf ab, das wissenschaftliche Verständnis der Entwicklung von Forschungssoftware zu verbessern und Methoden, Techniken und Werkzeuge zu entwickeln, die die RSE-Praxis verbessern. Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 2807,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:51"
}