{
  "name": "William Hawkins",
  "homepage": "https://researchdirectory.uc.edu/p/hawkinwh",
  "status": "success",
  "content": "Expert Profile: William Hawkins III | Research Directory William Howard Hawkins III Asst Professor - Educator Rhodes Hall 804B CEAS - Computer Science - 0030 EmailDownload V-Card PhD Computer Science: University of Virginia Charlottesville, VA, 2018 (Static Binary Rewriting to Improve Software Security, Safety and Reliability) Master of Theological Studies: Wesley Theological Seminary Washington, DC, 2014 (Differences In Degree, Not Kind: The Liberation Theology Of Gustavo Gutierrez, Leonardo Boff, Jon Sobrino, Juan Luis Segundo And The Theology Of Liberation Of Pope John Paul II) BS: Furman University Greenville, SC, 2004 (Computer Science) Peer Reviewed Publications Nguyen-Tuong A.; Melski D.; Davidson J.; Co M.; Hawkins W.; Hiser J.; Morris D.; Nguyen D.; Rizzi E. (03-01-2018. ) Xandra: An Autonomous Cyber Battle System for the Cyber Grand Challenge.IEEE Security and Privacy, , 16 (2 ) ,42-51 More Information Hiser J.; Nguyen-Tuong A.; Hawkins W.; McGill M.; Co M.; Davidson J. (11-03-2017. ) Zipr++: Exceptional binary rewriting.FEAST 2017 - Proceedings of the 2017 Workshop on Forming an Ecosystem Around Software Transformation, co-located with CCS 2017, , 9-15 More Information Hawkins W.; Hiser J.; Nguyen-Tuong A.; Co M.; Davidson J. (11-01-2017. ) Securing Binary Code.IEEE Security and Privacy, , 15 (6 ) ,77-81 More Information Hawkins W.; Nguyen-Tuong A.; Hiser J.D.; Co M.; Davidson J.W. (10-30-2017. ) Mixr: Flexible runtime rerandomization for binaries.MTD 2017 - Proceedings of the 2017 Workshop on Moving Target Defense, co-located with CCS 2017, , 2017-January ,27-37 More Information Hawkins W.H.; Hiser J.D.; Co M.; Nguyen-Tuong A.; Davidson J.W. (08-30-2017. ) Zipr: Efficient Static Binary Rewriting for Security.Proceedings - 47th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN 2017, , 559-566 More Information Davidson J.; Hiser J.; Nguyen-Tuong A.; Coleman C.; Hawkins W.; Knight J.; Rodes B.; Hocking A. (09-22-2016. ) A System for the Security Protection of Embedded Binary Programs.Proceedings - 46th Annual IEEE/IFIP International Conference on Dependable Systems and Networks, DSN-W 2016, , 234-237 More Information Hawkins W.H.; Hiser J.D.; Davidson J.W. (04-05-2016. ) Dynamic canary randomization for improved software security.Proceedings of the 11th Annual Cyber and Information Security Research Conference, CISRC 2016, , More Information",
  "content_length": 2424,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:09"
}