{
  "name": "William C. Regli",
  "homepage": "https://www.cs.umd.edu/people/regli",
  "status": "success",
  "content": "William Regli | UMD Department of Computer Science Skip to main content Explore People People FacultyFaculty Awards In Memoriam Staff Dept. PhonebookFaculty Staff Students As PDF University Directory Search People Overview Name Search by name Title Search by title Location Search by location Apply Reset William Regli Professor Email: regliumd[.dot.]edu Phone: (301) 405-6738 Location: IRB 5206 Website: https://www.linkedin.com/in/william-regli/ Google Scholar: -MSUomIAAAAJ Appointments: CS, ECE, ISR Research Areas: AI and Robotics, Graphics Visualization and VR AR Interest Areas: artificial intelligence, AI Agents, design and evaluation of systems Biography Dr. Regli is a computer scientist who has focused his career on interdisciplinary and use-inspired problems spanning engineering, artificial intelligence and computational modeling and graphics. His most recent activities have deployed cyber-infrastructure systems to capture and curate engineering and science data in order to ensure long-term sustainability. Dr. Regli’s current interests include computational tools to exploit the properties of advanced materials, additive manufacturing systems and enabling new paradigms for design and production.   He has published more than 250 technical articles and his research has spawned two start-up technology companies (one focused on mobile communications for public safety, the other on information management in edge networks) and resulted in five foundational U.S. Patents in the area of 3D CAD search. From 2014 to 2017 Regli served on the leadership team of the Defense Advanced Research Projects Agency (DARPA), as Deputy Director (9/2014-12/2016) and then Acting Director (1/2017-7/2017) of the Defense Sciences Office (DSO).  During his tenure, DSO initiated programs in areas as diverse as artificial intelligence, design and manufacturing, social science, applied mathematics, physical sciences and advanced sensing technologies.  Regli’s other government service includes as a Scientific Adviser to the U.S. Department of Energy's (DoE) National Nuclear Security Administration (NNSA) in the areas of information technology and manufacturing (2010-2014) and as a National Research Council Postdoctoral Fellow at the National Institute of Standards and Technology (NIST) (1995-1997).  For his contributions, Regli received the DARPA Meritorious Public Service Medal (2018). Dr. Regli holds a Ph.D. in Computer Science from the University of Maryland at College Park and Bachelor of Science degree in Mathematics from Saint Joseph's University. He is a Fellow of the American Association for the Advancement of Science (AAAS); an elected senior member of the Association of Computing Machinery (ACM) and of the Association for the Advancement of Artificial Intelligence (AAAI); and a Fellow of the Computer Society of the Institute of Electrical and Electronics Engineers (IEEE) for his “contributions to 3D search, design repositories and intelligent manufacturing. Honors and Awards Year Type Org. Name 2020 Fellow AAAS AAAS Fellow 2017 Fellow IEEE IEEE FellowFor contributions to 3D search, design repositories and intelligent manufacturing. Students Advised Anna Baskin PhD Student Brandon Colelough PhD Student Susan Collins PhD Student Carwyn Collinsworth PhD Student Mike Ledford PhD Student Taylor Paul PhD Student Isabelle Rathbun PhD Student Ian Whitehouse PhD Student Mentions 2021 William Regli Appointed Member of the Computing Community Consortium 2020 Professor and Alumnus William Regli Named 2020 AAAS Fellow",
  "content_length": 3549,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:49"
}