{
  "name": "Will Perkins 0001",
  "homepage": "http://willperkins.org",
  "status": "success",
  "content": "Will Perkins Will Perkins email: math@willperkins.org CV Upcoming visits, conferences, and talks: April 14 - April 17: Phase Transitions in Combinatorics, Amsterdam June 22 - June 26: Analysis of Algorithms 2026, Munich Service/organization: Director, Algorithms and Randomness Center, Georgia Tech Managing editor, Combinatorial Theory Associate editor, Random Structures and Algorithms, SIAM Journal on Discrete Mathematics Videos: Statistical physics approach to asymptotics enumeration, Park City Mathematics Institute Five lectures on statistical mechanics methods in combinatorics, MIPT Laboratory of Combinatorial and Geometric Structures Zero-free regions for repulsive gasses, Simons Institute Sampling from the random cluster model at all temperatures on random graphs, Simons Institute Counting independent sets with the cluster expansion, MIPT Combinatorial and Geometric Structures First-order phase transitions and algorithms, Oxford Discrete Math and Probability Seminar Abstract polymer models and the cluster expansion, Simons Institute Sphere packings, codes, and kissing numbers via hard core models, Georgia Tech ARC workshop An occupancy approach to the hard-core model, Simons Institute Past events: June 2 - June 6: Rocky Mountain Summer Workshop, Bellvue, CO Aug 11-16, 2024: Frontiers of Statistical Mechanics and Theoretical Computer Science, Banff May 13-16, 2024: Summer school on probability, algorithms, and inference, Georgia Tech Sep 9-10, 2023: TetFest60 March 9-11, 2023: ACORN workshop, Georgia Tech May 6, 2023: IDEAL high school teacher workshop, Chicago June 2-4, 2023: IDEAL Get Ready for Research Workshop, Chicago Summer 2022: YSP at UIC, a program for Chicago-area high schoolers 2022:UIC Tripods workshop on probability, inference, and algorithms 2022: 7th Lake Michigan Workshop on Combinatorics 2021: GROW 2021: Graduate Research Opportunities for Women 2021: Frontiers of Statistical Mechanics and Theoretical Computer Science 2021. 2020: Uniqueness methods in statistical mechanics: recent developments and algorithmic applications 2016: Birmingham Student Combinatorics Day 2016 2015: Birmingham Workshop of Probabilistic and Extremal Combinatorics 2015 Teaching: Spring '25 CS 8803: Statistical Physics in Algorithms and Combinatorics Spring '23 CS 3510: Design and Analysis of Algorithms Fall '22 CS 4540: Advanced Algorithms Spring '22 MCS 521: Combinatorial Optimization Spring '22 STAT 461: Applied Probability Models Fall '21 STAT 401: Introduction to Probability Spring '21: MCS 591: Statistical Physics and Applications Fall '20 STAT 401: Introduction to Probability Spring '20 MCS 521: Combinatorial Optimization Fall '19 MATH 215: Introduction to Advanced Mathematics Fall '18 MATH 215: Introduction to Advanced Mathematics Fall '18 MCS 425: Codes and Cryptography Fall '17 2S: Statistics Fall '16 2S: Statistics Spring '16 3COM: Combinatorics Fall '13 Math 4221: Stochastic Processes I Spring '13 Math 6221: Advanced Classical Probability Fall '12 Math 4221: Stochastic Processes I Spring '12 Math 3215: Probability & Statistics Spring '12 CS 8803: Discrete Fourier Analysis Research I'm an associate professor in the School of Computer Science at Georgia Tech. My research interests are in probability, algorithms, and combinatorics. Fixed-magnetization Ising on random graphs up to reconstruction, preprint, (with Reza Gheissari and Corrine Yap). We prove that the free energy density of the fixed-magnetization ferromagnetic Ising model on a random d-regular graph matches the annealed free energy density for inverse temperatures up to the reconstruction threshold. Consequences of this result include showing that the positive-temperature conjecture of Zdeborova and Boettcher holds up to reconstruction. Simple analyticity criteria for repulsive multi-body potentials, preprint, (with Tyler Helmuth and Marcus Pappik). We prove a simple, explicit lower bound on the radius of a zero-free disk for Gibbs point processes defined by finite-range, repulsive multi-body interactions. Our lower bound improves on those previously known, and we demonstrate that it is essentially sharp in the generality with which our arguments apply. On the chromatic number of random triangle-free graphs, preprint, (with Clayton Mizgerd and Yuzhou Wang). We determine the widths of the scaling windows for the transitions between 3- and 4-colorability and 4- and 5-colorability of random triangle-free graphs of density near 1/sqrt(n). The transition from 3- to 4-colorability is determined by the satisfiability of a bipartite random 2-SAT formula derived from the random triangle-free graph. On the evolution of structure in triangle-free graphs, to appear, Advances in Mathematics, (with Matthew Jenssen and Aditya Potukuchi). We study the typical structure and asymptotic numnber of triangle-free graphs on n vertices and m edges in the regime in which almost all triangle-free graphs are not bipartite but align closely with a bipartite graph. The typical structure of dense claw-free graphs, preprint, (with Sam van der Poel). We determine the large deviation rate function for the event that G(n,p) has no induced claws, for all constant p, and solve the analagous problem for G(n,m) at constant edge densities. In both cases, the problems exhibit a phase transition in the sense of a non-analyticity of the rate function. Both problems also exhibit the phenomenon that for certain parameters there are infinitely many optimal solutions to a graphon variational problem determinging the rate function, but just one of these optimal solutions describes the typical structure of a claw-free graph from the given distribution. Lower tails for triangles inside the critical window, preprint, (with Matthew Jenssen, Aditya Potukuchi, and Michael Simkin). We prove a formula for the asymptotics of the logarithm of the probability that G(n,p) is triangle-free when p= c/\\sqrt{n} for c< e^{-1/2}. More generally we compute the large deviation rate function for the lower-tail for triangles in G(n,p) for a range of parameters. Our results prove the existence of a phase transition in the triangle-free case and the non-existence of a phase transition for more moderate lower tails. Pirogov-Sinai theory beyond lattices, preprint, (with Sarah Cannon and Tyler Helmuth). We develop a combinatorial apporach to Pirogov-Sinai theory for the hard-core model on bipartite graphs. Instead of relying on the topology of lattices as in the classical theory, we use a bounded cycle basis to construct contours. We use this machinery to prove results about the phase diagram of the hard-core model on bipartite graphs satisfying various symmetry conditions. Sampling, counting, and large deviations for triangle-free graphs near the critical density, FOCS 2024, (with Matthew Jenssen, Aditya Potukuchi, and Michael Simkin). We give two different efficient sampling algorithms for the random graph G(n,p) conditioned on being triangle-free. The first works when p < c/sqrt{n} and the second works when p > C/sqrt{n}, for constants c, C. The regime p = Theta(sqrt{n}) is the critical density in which global, near-bipartite structure emerges in a typical triangle-free graph, and this structural change is reflected in the two different sampling algorithms. Hardness of sampling for the anti-ferromagnetic Ising model on random graphs, ITCS 2025, (with Neng Huang and Aaron Potechin). We prove that the class of stable sampling algorithms cannot sample from the anti-ferromagnetic Ising model on random graphs of average degree d, for large constant d, for inverse temperatures asymptotically above the replica symmetry breaking transition. Our proof invovles a new interpolation argument comparing the average energy and average squared overlap of the Ising model on sparse random graphs to those of the Sherrington-Kirkpatrick model. Fast and Slow Mixing of the Kawasaki Dynamics on Bounded-Degree Graphs, RANDOM 2024, (with Aiya Kuchukova, Marcus Pappik, and Corrine Yap). We study the dynamical threshold (in terms of worst-case mixing time) of the Kawasaki dynamics for the fixed magnetization Ising model on the class of graphs of maximum degree Delta. Searching for (sharp) thresholds in random structures: where are we now?, Bulletin of the AMS, 2025. This is a survey on thresholds, sharp thresholds, and scaling windows of montone properties in random structures, written to accompany a talk in the Current Events Bulletin at the Joint Mathematics Meetings in 2024. On the hardness of finding balanced independent sets in random bipartite graphs, SODA 2024, (with Yuzhou Wang). We give evidence of a statistical-computational gap for finding balanced independent sets in random bipartite graphs of average degree d, where d is a large constant. While balanced independent sets of density (2+o_d(1)) log d/d exist whp in such graphs, ther best known efficient algorithm (which is very simple) can only find balanced independent sets of half this size. We show that neither local algorithms nor low-degree algorithms can do better. Perfect sampling for hard spheres from strong spatial mixing, RANDOM 2023, (with Konrad Anand, Andreas Gobel, and Marcus Pappik). We provide a perfect sampling algorithm for the hard sphere model with expected running time linear in the volume under the assumption of strong spatial mixing. Geometric barriers for stable and online algorithms for discrepancy minimization, COLT 2023, (with David Gamarnik, Eren Kizildag, and Changji Xu). Using a new variant of the m-OGP property, we provide sharp hardness guarantees against online algorithms for both the symmetric binary perceptron and discrepancy minimization. On the zeroes of hypergraph independence polynomials, Combinatorics, Probability and Computing, 2023, (with David Galvin, Gwen McKinley, Michail Sarantis, and Prasad Tetali). We prove that the independence polynomial of a max degree d hypergraph has no complex zeroes in a disk of radius ~ 1/(e d), nearly matchin",
  "content_length": 43093,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:43"
}