{
  "name": "William Eiers",
  "homepage": "https://william-eiers.github.io",
  "status": "success",
  "content": "William Eiers Gateway North 412 Stevens Institute of Technology Hoboken, New Jersey My name is William Eiers, and I am an Assistant Professor of Computer Science at Stevens Institute of Technology in Hoboken, New Jersey, USA. I work in software engineering and software verification, working on tools and approaches for automatically verifying software, particularly in compute clouds (e.g, AWS, Google Cloud Platform, Microsoft Azure, etc). During my Ph.D., I focused on using quantitative techniques for verifying and repairing access control policies for the cloud using. I am currently looking into how Generative AI (large language models) can be used in the software verification and software engineering. I am always looking to hire bright and motivated graduate students to work with me at Stevens! If you are interested, please send me an email with your C.V. and short bio (weiers at stevens dot edu). news Apr 20, 2025 Our work titled “Neural Theorem Proving: Generating and Structuring Proofs for Formal Verification” has been accepted to appear at the 19th Conference on Neurosymbolic Learning and Reasoning (NeSy 2025)! First author Balaji Rao, myself, and Prof Carlo Lipizzi (all from Stevens Institute of Technology!) showed how large language models can be harnessed to generate HOL/Isabelle code for theorem proving, and applied the approach to build mechanical proofs verifying the correctness of AWS access control policies. Jan 1, 2025 Graduate student Adarsh Vatsa has started his PhD with me! Adarsh just finished is Masters at Stevens Institute of Technology and has just started is PhD under my supervision. Adarsh currently works on investigating how to leverage large language models for enhancing program analysis techniques. Dec 9, 2024 Our work titled “Synthesizing Access Control Policies using Large Language Models” has been accepted to NLBSE 2025! Adarsh Vatsa together with undergraduate student Pratyush Patel investigated the effectiveness of harnessing large language models to generate AWS access control policies. Sep 1, 2024 Graduate student Sachi Shome has started his PhD with me! Apr 1, 2024 Masters student Adarsh Vatsa at Stevens Institute of Technology has joined our research group! He is broadly interested in the intersection of large language models and software engineering. latest posts selected publications Contact me through my email weiers at stevens dot edu",
  "content_length": 2415,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:49"
}