{
  "name": "William S. Cleveland",
  "homepage": "http://www.stat.purdue.edu/~wsc",
  "status": "success",
  "content": "Home - Department of Statistics - Purdue University Skip to main content Department of StatisticsThe Department of Statistics is consistently recognized as one of the top statistics programs in the country. We work to advance the frontiers of statistical sciences and data science both in theory and application. New directions in statistics are often interdisciplinary and encompass bioinformatics and genomics, computational finance, data science, differential privacy, and machine learning. The National Research Council recognizes our faculty as one of the nation's strongest. Our faculty and graduates are leaders in academia and industry who bring the strengths of the statistical sciences to the world’s toughest challenges. Now Hiring FacultyOur FacultyUndergraduate StudentsGraduate StudentsResearchActuarial Science More information News2025-26 Frederick L. Hovde Distinguished Lecturer - Susan Murphy11-24-2025Susan A. Murphy is Mallinckrodt Professor of Statistics and of Computer Science and Associate Faculty at the Kempner Institute, Harvard University. She will present her research to the Purdue University College of Science as a 2025-26 Frederick L. Hovde Distinguished Lecturer.Purdue Actuarial Science Leads AI-Driven Research in Advancing the Profession11-18-2025Faculty in Purdue Universityâs Actuarial Science Program are leading innovative research that applies data science and artificial intelligence (AI) to address some of the most pressing challenges in insurance and risk management today.Purdue Actuarial Science Expands to Indianapolis11-18-2025The Purdue Actuarial Science Program is expanding its reach with a new presence at Purdue University in Indianapolis, bringing Purdueâs top-ranked actuarial education to students in central Indiana.Purdue Statistics Professor Elected Fellow of the Ghana Academy of Arts and Sciences11-12-2025The Ghana Academy of Arts and Sciences (GAAS) elected Atinuke Olusola Adebanji, associate professor of practice in the Department of Statistics at Purdue University, to its Fellowship during its 223rd General Meeting of Fellows Purdue Actuarial Science Recognized as Center of Actuarial Excellence11-11-2025Purdueâs Actuarial Science Program stands at the forefront of actuarial education, blending rigorous academics with real-world relevance.All Departmental News Purdue Department of Statistics, 150 N. University St, West Lafayette, IN 47907 Phone: (765) 494-6030, Fax: (765) 494-0558 © 2025 Purdue University | An equal access/equal opportunity university | Copyright Complaints | DOE Degree Scorecards Trouble with this page? Accessibility issues? Please contact the College of Science.",
  "content_length": 2668,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:12"
}