{
  "name": "William J. Beksi",
  "homepage": "http://ranger.uta.edu/~wjbeksi",
  "status": "success",
  "content": "William J. Beksi CV / ORCID / Google Scholar William J. Beksi I am an Assistant Professor in the Department of Computer Science and Engineering at the University of Texas at Arlington. I'm also the founder and director of the Robotic Vision Laboratory. My research focuses on robot perception, learning, and autonomy. Concretely, my goal is to create intelligent robotic systems that can sense, plan, and act in complex environments while continuously improving over time. Prospective students: If you are a current student at UT Arlington, then please fill out this form. Otherwise, please apply directly to the PhD program and mention my name in your application. I am actively recruiting undergraduate/graduate students, who are U.S. citizens, to work on DoD and USDA projects. Email: william.beksi at uta.edu Office: Engineering Research Building 523, 500 UTA Blvd, Arlington, TX 76019 News I was invited to speak at the 2nd Workshop on Event-Based Vision in the Era of Generative AI at WACV 2026 I received a USDA grant to develop a computer vision system for classifying pecan foliar diseases I will serve as an Associate Editor for ICRA 2026 I was awarded an ONR grant to explore event-based sensing for underwater environmental monitoring I have been elevated to an IEEE Senior Member I was awarded an AFOSR grant to create noise modeling techniques for event-based sensors My PhD students Pritam Karmokar and Md Ahmed Al Muzaddid received the UTA Dissertation Fellowship My PhD student Joe Cloud received the UTA CSE Outstanding Doctoral Dissertation Award My PhD student Jordan James received the UTA CSE John S. Schuchman Outstanding Doctoral Student Award I was awarded a NEEC grant from NSWCDD to investigate mitigating data distribution shifts in machine learning systems I was invited to chair the \"Space Robotics 1\" session at ICRA 2025 I received a grant from Cotton Incorporated to develop machine vision tools for high-throughput cotton phenotyping I'll serve as an Associate Editor for IROS 2025 I was invited to give a technical talk on our event-based vision research to NSWCDD I received the 2024 Rising Star Research Award from the UTA CSE department I was awarded a USDA grant to develop a deep learning framework for in-ground root segmentation I'll serve as an Associate Editor for ICRA 2025 My PhD student Minh (Jerry) Tram received the UTA CSE John S. Schuchman Outstanding Doctoral Student Award My PhD student Nolan Gutierrez was awarded a DoD SMART scholarship I will be a 2024 ONR Summer Faculty Fellow at NSWCDD Our AFRL-sponsored 3D computer vision project was featured as a UTA news release I'll serve as an Associate Editor for IROS 2024 I will serve as a Guest Editor for a Drones special issue on Artificial Intelligence and Machine Learning in UAV Technology I presented my lab's latest work to the AFRL Materials and Manufacturing Directorate I'll serve as an Associate Editor for IEEE Transactions on Automation Science and Engineering I will serve as an Associate Editor for UR 2024 I received a USDA grant to create computer vision tools for automating high-throughput crop phenotyping In collaboration with krtkl, I've been awarded a Phase II contract by AFRL to develop a 3D vision system for advanced manufacturing I'll serve as an Associate Editor for ICRA 2024 Dongchul Kim and I were awarded a grant from Google to explore causal reinforcement learning I will be a 2023 ONR Summer Faculty Fellow at NSWCDD Nick Gans, Katie Skinner, and I will be organizing the first workshop on Photorealistic Image and Environment Synthesis for Robotics at IROS 2023 My PhD student Minh (Jerry) Tram was awarded a DoD SMART scholarship I will serve on the Program Committee of ICVS 2023 I'll serve as an Associate Editor for IROS 2023 I will serve as an Associate Editor for UR 2023 I was invited to give a talk at the First Workshop on Photorealistic Image and Environment Synthesis for Computer Vision at WACV 2023 I will be working with krtkl to create a neuromorphic stereo vision system (Phase 1) for the U.S. Space Force as part of the Orbital Prime program I will be a 2022 ONR Summer Faculty Fellow at NSWCDD I was invited to chair the \"RGB-D Perception I\" session at ICRA 2022 I received a generous donation of tools from Stanley Black & Decker I will serve as an Associate Editor for UR 2022 In collaboration with krtkl, I've been awarded a Phase I contract by AFRL to develop a 3D vision system for advanced manufacturing I've joined the Standard for Measuring Robot Agility (IEEE P2940) working group Our work on thermal image super-resolution was an ICVS 2021 Best Conference Paper Award finalist Our work on probabilistic movement primitive control by control barrier functions was a CASE 2021 Best Conference Paper Award finalist I received a set of Jetson Nano 2GB Developer Kits through the NVIDIA Grant Program I was invited to chair the session \"Stereo Vision Applications\" at ICRA 2021 I'll serve as an Associate Editor for UR 2021 Our work on generating dense and colored 3D point cloud objects was featured as a TACC-enabled science story I will be a Faculty Chair for the IROS 2020 tutorial Space Robotics for In-Situ Resource Utilization: Needs, Challenges, and Approaches I've been awarded an NSF REU Supplement Animesh Chakravarthy and I received a UTA Research Enhancement Program grant to explore vision-based collision avoidance for UAVs I received an NSF CRII Award to investigate topological methods for robotic perception I will serve as an Associate Editor for UR 2020 Show more ... Show less ... Publications Agent Deception via Polynomial Path Planning N.B. Gutierrez, B.M. Sadler, and W.J. Beksi Engineering Applications of Artificial Intelligence, 2025 Paper  • Source Code  • Citation Vision-Based Movement Primitives for Lunar Hazard Avoidance J.M. Cloud, W.J. Beksi, and J.M. Schuler IEEE International Conference on Robotics and Automation (ICRA), 2025 Paper  • Citation Instance Segmentation-Based Hazard Detection with Lunar South Pole Lighting J.M. Cloud, B.C. Buckles, T.J. Muller, W.J. Beksi, and J.M. Schuler IEEE International Conference on Robotics and Automation (ICRA), 2025 Paper  • Citation Secrets of Edge-Informed Contrast Maximization for Event-Based Vision P.P. Karmokar, Q.H. Nguyen, and W.J. Beksi IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2025 Paper  • Supplement  • Preprint  • Source Code  • Citation Semi-Supervised Variational Adversarial Active Learning via Learning to Rank and Agreement-Based Pseudo Labeling Z. Lyu and W.J. Beksi International Conference on Pattern Recognition (ICPR), 2024 Paper  • Supplement  • Preprint  • Source Code  • Citation CitDet: A Benchmark Dataset for Citrus Fruit Detection J.A. James, H.K. Manching, M.R. Mattia, K.D. Bowman, A.M. Hulse-Kemp, and W.J. Beksi IEEE Robotics and Automation Letters, 2024 Paper  • Preprint  • Website  • Citation Few-Shot Fruit Segmentation via Transfer Learning J.A. James, H.K. Manching, A.M. Hulse-Kemp, and W.J. Beksi IEEE International Conference on Robotics and Automation (ICRA), 2024 Paper  • Preprint  • Source Code  • Citation NTrack: A Multiple-Object Tracker and Dataset for Infield Cotton Boll Counting M.A.A Muzaddid and W.J. Beksi IEEE Transactions on Automation Science and Engineering, 2024 Paper  • Preprint  • Website  • Citation LIST: Learning Implicitly from Spatial Transformers for Single-View 3D Reconstruction M.S. Arshad and W.J. Beksi IEEE/CVF International Conference on Computer Vision (ICCV), 2023 Paper  • Supplement  • Preprint  • Source Code  • Citation IPVNet: Learning Implicit Point-Voxel Features for Open-Surface 3D Reconstruction M.S. Arshad and W.J. Beksi Journal of Visual Communication and Image Representation, 2023 Paper  • Preprint  • Source Code  • Citation Lunar Excavator Mission Operations using Dynamic Movement Primitives J.M. Cloud, M.Q. Tram, W.J. Beksi, and M.A. DuPuis IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2023 Paper  • Preprint  • Citation Intuitive Robot Integration via Virtual Reality Workspaces M.Q. Tram, J.M. Cloud, and W.J. Beksi IEEE International Conference on Robotics and Automation (ICRA), 2023 Paper  • Preprint  • Source Code  • Citation MetaMax: Improved Open-Set Deep Neural Networks via Weibull Calibration Z. Lyu, N.B. Gutierrez, and W.J. Beksi IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) Workshops, 2023 Paper  • Supplement  • Preprint  • Citation Single Image Super-Resolution via a Dual Interactive Implicit Neural Network Q.H. Nguyen and W.J. Beksi IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2023 Paper  • Supplement  • Preprint  • Source Code  • Citation Rule-Based Safe Probabilistic Movement Primitive Control via Control Barrier Functions M. Davoodi, A. Iqbal, J.M. Cloud, W.J. Beksi, and N.R. Gans IEEE Transactions on Automation Science and Engineering, 2023 Paper  • Citation Automated Reconstruction of 3D Open Surfaces from Sparse Point Clouds M.S. Arshad and W.J. Beksi IEEE International Symposium on Mixed and Augmented Reality (ISMAR) Workshops, 2022 Paper  • Preprint  • Citation Vision-Based Guidance for Tracking Multiple Dynamic Objects K. Dhal, P. Karmokar, A. Chakravarthy, and W.J. Beksi Journal of Intelligent & Robotic Systems, 2022 Paper  • Source Code  • Citation Safe Robot Trajectory Control using Probabilistic Movement Primitives and Control Barrier Functions M. Davoodi, A. Iqbal, J.M. Cloud, W.J. Beksi, and N.R. Gans Frontiers in Robotics and AI, 2022 Paper  • Citation Variable Rate Compression for Raw 3D Point Clouds M.A.A Muzaddid and W.J. Beksi IEEE International Conference on Robotics and Automation (ICRA), 2022 Paper  • Preprint  • Source Code  • Citation Thermal Image Super-Resolution Using Second-Order Channel Attention with Varying Receptive Fields N.B. Gutierrez and W.J. Beksi International Conference on Computer Vision Systems (ICVS), 2021 Best Conference Paper Award Finalist  • Paper  • P",
  "content_length": 13644,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:55"
}