{
  "name": "William Shoaff",
  "homepage": "http://fit.academia.edu/WilliamShoaff",
  "status": "success",
  "content": "William Shoaff - Florida Institute of Technology Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless William ShoaffFlorida Institute of Technology, Computer Sciences, Faculty MemberaddFollowdoneFollowingFollowers55Following9Co-authors3Public ViewsRelated Authors John Antonio Richard Brent Peter Strazdins Michael E ThomadakisTexas A&M University Kevin BurrageUniversity of Oxford Rohit GuptaUniversität Magdeburg Johnnie BakerKent State University Panagiotis MetaxasWellesley College Ruud van der PasOracle Geoffrey FoxIndiana UniversityInterests UploadsPapers by William ShoaffA parallel algorithm for singular value decomposition as applied to failure tolerant manipulatorsProceedings 13th International Parallel Processing Symposium and 10th Symposium on Parallel and Distributed Processing. IPPS/SPDP 1999The system of equations that govern kinematically redundant manipulators is commonly solved by nd... more The system of equations that govern kinematically redundant manipulators is commonly solved by nding the singular value decomposition SVD of the corresponding Jacobian matrix. This can require c onsiderable amounts of time to compute, thus a parallel SVD algorithm minimizing execution time is sought. The approach employed here lends itself to parallelization by using Givens rotations and information from previous decompositions. The key contributions of this research include the presentation and implementation of a new variation of a parallel SVD algorithm to compute the SVD for a set of post-fault Jacobians. Results from implementation of the algorithm on a MasPar MP-1 and an IBM SP2 are p r ovided. Speci c issues considered for each implementation include how data is mapped to the processing elements, the e ect that increasing the number of processing elements has on execution time, and the type o f p arallel architecture used.Download Spatial and Temporal WorkshopDOMAIN INDEPENDENT TEMPORAL REASONING WITHRECURRINGNumerous examples of temporal reasoning involve a process of abstraction from the number of times... more Numerous examples of temporal reasoning involve a process of abstraction from the number of times an event is to occur, or the number of times events stand in a temporal relation. For example, scheduling a recurring event such as one&#39;s ooce hours may consider things like the relative temporal ordering of the ooce hours and a number of other events in a given work day. The number of times ooce hours will actually be held may be unknown, even irrelevant, at the time of scheduling them. The objective of this paper is to formulate a domain-independent framework for reasoning about recurring events and their relations. To achieve this end, we propose an ontology of recurrence based on the model-theoretic structure underlying collective predication using plural noun phrases. We ooer a calculus of binary temporal relations for temporal collections based on a well-deened transformation of interval temporal relations into recurrence relations. Finally, we describe a reasoning framework b... The design of an intelligent human-computer interface for the test, control and monitor systemThe graphical intelligence and assistance capabilities of a human-computer interface for the Test... more The graphical intelligence and assistance capabilities of a human-computer interface for the Test, Control, and Monitor System at Kennedy Space Center are explored. The report focuses on how a particular commercial off-the-shelf graphical software package, Data Views, can be used to produce tools that build widgets such as menus, text panels, graphs, icons, windows, and ultimately complete interfaces for monitoring data from an application; controlling an application by providing input data to it; and testing an application by both monitoring and controlling it. A complete set of tools for building interfaces is described in a manual for the TCMS toolkit. Simple tools create primitive widgets such as lines, rectangles and text strings. Intermediate level tools create pictographs from primitive widgets, and connect processes to either text strings or pictographs. Other tools create input objects; Data Views supports output objects directly, thus output objects are not considered. Fin...Download Path Consistency in a Network of Non-Convex IntervalsReasoning about time often involves incomplete information about periods and their relationships.... more Reasoning about time often involves incomplete information about periods and their relationships. Varieties of incompleteness include uncertainty about the number of objects involved, the distribution of a set of temporal relations among these objects, and what can be called the participation of a set of objects in a temporal relation. A solution to the problem of representing and reasoning about incomplete temporal information of these kinds is forthcoming if a restricted class of non-convex intervals (called n-tntervals) is added to the temporal domain of discourse. An n-interval corresponds to the common sense notion of a recurring period of time with a (possibly) unspecified number of occurrences. In this paper, we formalize a representation for temporal reasoning problems using n-intervals. The language of the framework is restricted in such a way that tractable techniques from constraint satisfaction can be applied. Specifically, it is demonstrated how the problem of determini...Download The utilization of fuzzy sets in the recognition of imperfect stringsFuzzy Sets and Systems, 1992Fuzzy Sets and Systems 49 (1992) 331337 331 NorthHolland The utilization of fuzzy sets in the rec... more Fuzzy Sets and Systems 49 (1992) 331337 331 NorthHolland The utilization of fuzzy sets in the recognition of imperfect strings M. Schneider, H. Lim and W. Shoaff Department of Computer Science, The Florida Institute of Technology, Melbourne, FL, USA Received November ... The recognition of imperfect strings generated by fuzzy context sensitive grammarsFuzzy Sets and Systems, 1994Abstract In this paper we extend previous work on the recognition of imperfect strings generated ... more Abstract In this paper we extend previous work on the recognition of imperfect strings generated by fuzzy context-free grammars to the recognition of imperfect strings generated by fuzzy context-sensitive grammars. A context-sensitive production rule αAγ → αβγ has both constituent (β) and contexts (α, γ) which can be changed by substituting, deleting or inserting terminal characters. Changed rules derive strings which can be considered to be in the language generated by the original grammar with some certainty. Since some strings may not be recognizable when only one change is made to the grammar, multiple error corrections are described. Identifying Variable Length Multi-pair Palindromic Patterns with Errors in a DNA Sequencebutler.hpl.hp.comPage 1. Identifying Variable Length Multi-pair Palindromic Patterns with Errors in a DNA Sequence... more Page 1. Identifying Variable Length Multi-pair Palindromic Patterns with Errors in a DNA Sequence Hyoung rae Kim Department of Computer Sciences Florida Institute of Technology Melbourne, FL 32901, USA hokim@fit.edu ... NASA/ASEE SUMMER FACULTY RESEARCH FELLOWSHIP PROGRAM 7 _ iV A Parallel Algorithm for the Singular Value Decomposition of Rectangular MatricesPage 94. CHAPTER 14 A Parallel Algorithm for the Singular Value Decomposition of Rectangular Matr... more Page 94. CHAPTER 14 A Parallel Algorithm for the Singular Value Decomposition of Rectangular Matrices William D. Shoaff C. David Chan* Abstract. The classical sequential algorithm for computing the singular value decomposition ... Tchebycheff approximation of continuous functions by harmonic polynomials on conic sectionsJournal of Approximation Theory, 1985 Integrating Literate Programming and Cleanroom Software Engineering to Teach Software Engineering Skillsby Shereef Abu Almaati and William ShoaffAicps, 1996Page 1. Integrating Literate Programming and Cleanroom Software Engineering to Teach Software Eng... more Page 1. Integrating Literate Programming and Cleanroom Software Engineering to Teach Software Engineering Skills Shereef Abu Al-Maati Department of Computer Science Florida Institute of Technology Melbourne, Florida 32901 USA ashereef@cs.fit. edu Abstract ... Parallel Computation of Sturm-Liouville Spectral Density Functions∗ †by William Shoaff and Steven PruessParallel Algorithms and Applications, 1994... STEVEN PRUESS Colorado School of Mines, Department of Mathematical and Computer Sciences, Gol... more ... STEVEN PRUESS Colorado School of Mines, Department of Mathematical and Computer Sciences, Golden, CO 80401-1887, USA WILLIAM SHOAFF Florida Institute of Technology, Deparrment of Computer Science, Melbourne, FL 32901 -6988, USA ... Integrating literate programming and cleanroom software engineering to teach software engineering skillsProceedings of the second Australasian conference on Computer science education - ACSE '97, 1996Page 1. Integrating Literate Programming and Cleanroom Software Engineering to Teach Software Eng... more Page 1. Integrating Literate Programming and Cleanroom Software Engineering to Teach Software Engineering Skills Shereef Abu Al-Maati Department of Computer Science Florida Institute of Technology Melbourne, Florida 32901 USA ashereef@cs.fit. edu Abstract ... Path Consistency in a Network of Non-Convex IntervalsIjcai, 1993Reasoning about time often involves incomplete information about periods and their relation­ ship... more Reasoning about time often involves incomplete information about periods and their relation­ ships. Varieties of incompletenes s include un­ certainty about the number of objects involved, the distributio",
  "content_length": 14418,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:06"
}