{
  "name": "William Allen",
  "homepage": "http://www.fit.edu",
  "status": "success",
  "content": "www.fit.edu | Florida Tech Close April Fools Prank Florida Tech BoundlessOpportunity Apply Request Info See campus for yourself: Visit Us! Reach Beyond the Possible. At Florida Tech, we say “yes” to big ideas. We pursue outrageous dreams and embark on the endeavors most pivotal to the future. Founded to educate the pioneers of the U.S. space program, Florida Tech is deeply, historically rooted in this culture of relentless determination. Today, we carry on this legacy through the rigorous hands-on degree programs we offer in engineering, science, computing, aeronautics, business, psychology and more. Degrees Designed for Careersof the Future. When autocomplete results are available use up and down arrows to review and enter to select. Touch device users, explore by touch or with swipe gestures. Browse All Programs Browse Online Programs Top 10 Student Experience The Wall Street Journal No. 20 in U.S. Graduate Employability Global Employability University Ranking Top 6% Best Return on Investment Payscale Research-Driven. High-Tech. STEM is in our DNA. STEM—science, technology, engineering and math—is the driving force behind who we are, what we do and why we exist. Whether you major in aerospace engineering or biomedical science, business or communications, you’re going to gain valuable, practical experience that puts you ahead of the competition in the job market. Awesome Internships? It’s possible here. Hands-on from Day One. Our rigorous, immersive, career-building programs have you working on your major from day one—no filler classes; no lengthy prerequisites. Want to be a pilot? You’ll be in the cockpit within the first week of classes. A marine biologist? One of the most biodiverse marine ecosystems on the planet is practically in our backyard. Dive right in. You’ve got goals—we’re here to help you reach them. See What We’re Working On An Amazing Location that's also a Classroom. We’re in Melbourne in the heart of Florida’s Space Coast. For you, that translates into amazing job and internship opportunities at places like NASA-Kennedy Space Center, SpaceX, Embraer, Melbourne-Orlando International Airport, National Weather Service, Brevard Zoo, WFIT radio station and many more. With our location right by the Atlantic Ocean and the Indian River Lagoon, in addition to swimming, fishing, surfing, paddle-boarding and countless other recreational water activities, you’ll be swimming in research opportunities, as well. Start exploring. Panther LifeWhat’s it Like at Florida Tech? You're much more than a number here and you'll feel it. Panther Pride goes way beyond school spirit—we’re family. At Florida Tech, you’ll get to know your peers—in and out of your major—as well as your professors. And with an on-campus, undergraduate student body that is about one-third international, you will build a future professional network that spans the globe. Florida Tech is equal parts innovation and sunshine—Did we mention our 360-plus days of sunshine and 72-degree average daily temperature? Trust us, you’re going to love it here. Why Florida Tech? EventsCampus CalendarNews President John Nicklow Describes a University Continuing to Rise in Biannual Remarks to Faculty, Staff Ape Ancestors and Neanderthals Likely Kissed, New Analysis Finds Newsweek: Florida Tech Top Online College in Florida, 10th in Nation in New 2026 Rankings More News Take the Next Step. We don't just talk about the amazing things you can do at Florida Tech. We make sure you get to do them. Connect with us and start reaching beyond the stars. Request Info Edit Page",
  "content_length": 3581,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:49"
}