{
  "name": "William Yang Wang",
  "homepage": "http://www.cs.ucsb.edu/~william",
  "status": "success",
  "content": "William Wang, UC Santa Barbara Computer Science William Wang Bio highlights: * Mellichamp Professor of Artificial Intelligence, UC Santa Barbara, 2019-present * Director, UCSB Center for Responsible Machine Learning, 2019-present * Director, UCSB Mind and Machine Intelligence Initiative, 2019-present * Director, UCSB NLP Group, 2016-present * IEEE SPS Pierre-Simon Laplace Award, 2024 * CRA Undergraduate Research Faculty Mentoring Award, 2023 * British Computer Society - Karen Spärck Jones Award, 2022 * NSF CAREER Award, 2021 * IEEE AI's 10 to Watch, 2020 * CVPR Best Student Paper Award, 2019 * DARPA Young Faculty Award, 2018 Full Biography Director, UCSB NLP Group Director, Center for Responsible Machine Learning Mellichamp Professor of Artificial Intelligence University of California, Santa Barbara Henley Hall, Room 2005 Santa Barbara, CA 93106 william@cs.ucsb.edu Follow @WilliamWangNLP PhD, Carnegie Mellon University Founder and CEO, ChipAgents.ai Research Interests Natural Language Processing Large Language Models Language & Vision Machine Learning Science of Generative AI Science of LLMs Artificial Intelligence Neuro-Symbolic AI & Reasoning Responsible AI PhDs and Postdocs Mentored Wenyue Hua (Postdoc, 2025, Microsoft Research) Weixi Feng (Ph.D., 2025, Amazon) Michael Saxon (Ph.D., 2025, UW) Xinyi Wang (Ph.D., 2025, Princeton) Wenda Xu (Ph.D., 2025, Google) Jiachen Li (Ph.D., 2025, Res. Scientist, xAI) Yujie Lu (Ph.D., 2025, Res. Scientist, Meta GenAI) Liangming Pan (Postdoc, 2024, Asst. Prof. at Arizona) Xianjun Yang (Ph.D., 2024, Meta GenAI) Yi-Lin Tuan (Ph.D., 2024, Startup) Wanrong Zhu (Ph.D., 2024, Res. Scientist at Adobe) Tsu-Jui (Ray) Fu (Ph.D., 2024, Res. Scientist at Apple AI/ML) Alon Albalak (Ph.D., 2024, Res. Scientist at SynthLabs) Sharon Levy (Ph.D., 2023, Asst. Prof. at Rutgers) Zhiyu Chen (Ph.D., 2022, Asst. Prof. at UT-Dallas) Yijun Xiao (Ph.D., 2022, Research Scientist at Meta AI) Wenhu Chen (Ph.D., 2021, Asst. Prof. at Univ. Waterloo) Wenhan Xiong (Ph.D., 2021, Research Scientist at xAI) Xin Eric Wang (Ph.D., 2020, Asst. Prof. at UC Santa Cruz) Mai Elsherief (Ph.D., 2019, Asst. Prof. at Northeastern) Vivek Kulkarni (Postdoc, 2019, Research Scientist at Twitter) News 01/02/2024: Very honored to receive the Pierre-Simon Laplace Award from IEEE SPS. 10/07/2023: Multiple papers accepted to EMNLP and NeurIPS 2023! Congratulations to our fearless students and collaborators. 08/07/2023: Promoted to the rank of Full Professor! 02/10/2023: Over the last 7 years, I was very lucky to work with many talented undergraduates for NLP research. I am thankful that CRA has chosen me for the 2023 CRA-E Undergraduate Research Faculty Mentoring Award. 01/22/2023: Elected to Senior Member of AAAI, ACM, and IEEE. We have 11 new papers at ICLR and EACL. Congratulations to our students and collaborators. 12/06/2022: I'm humbled and deeply honored to receive the British Computer Society / Microsoft - Karen Spärck Jones Award. Many thanks to my students, mentors, and colleagues for their support! 10/11/2022: Congratulations to UCSB NLP Group's 12 accepted papers to EMNLP 2022!",
  "content_length": 3128,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:07"
}