{
  "name": "Willard Rafnsson",
  "homepage": "https://pure.itu.dk/portal/da/persons/willard-rafnsson(9cf737ee-bd9a-4f7e-b865-b6ff6ed01fde).html",
  "status": "success",
  "content": "Willard Rafnsson - IT-Universitetet i København Willard Rafnsson Lektor, Theoretical Computer ScienceProgramming Logic and Semantics https://orcid.org/0000-0003-1482-3094 E-mailwilritudk 20182025 Publikationer pr. år Personlig profil EmneordSecurityProgramming languagesProgram analysisProgram verificationProgram transformationProgram synthesisProgramming language theory Fingeraftryk Dyk ned i forskningsemnerne, hvor Willard Rafnsson er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 6 Lignende profiler Risk Analysis Computer Science 100% Privacy Risk Assessment Keyphrases 75% Genetic Score Keyphrases 50% Data Analytics Keyphrases 50% Quantifying Privacy Keyphrases 50% Genetic Data Keyphrases 50% Good Taste Keyphrases 50% Polygenic Score Keyphrases 50% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2020 2020 2022 2022 5 Konferencebidrag i proceedings 1 Poster Publikationer pr. år Publikationer pr. år How Attacker Knowledge Affects Privacy Risks: An Analysis Using Probabilistic ProgrammingHalvorsen, L., Steffensen, S. L., Rafnsson, W., Kulyk, O. & Pardo, R., 2022, IWSPA '22: Proceedings of the 2022 ACM on International Workshop on Security and Privacy Analytics. Association for Computing MachineryPublikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Privacy with Good Taste: A Case Study in Quantifying Privacy Risks in Genetic ScoresPardo, R., Rafnsson, W., Steinhorn, G., Lavrov, D., Lumley, T., Probst, C., Ziedins, I. & Wasowski, A., 2022, Privacy with Good Taste: A Case Study in Quantifying Privacy Risks in Genetic Scores. Springer, Bind 13619. s. 1-16 16 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Privacy Concerns 100% Quantifying Privacy 100% Good Taste 100% Genetic Score 100% Genetic Data 100% “So I Sold My Soul'': Effects of Dark Patterns in Cookie Notices on End-User Behavior and PerceptionsKulyk, O., Rafnsson, W., Borberg, I. M. & Pedersen, R. H., 2022, Proceedings of 2022 Symposium on Usable Security and Privacy. Internet societyPublikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Privug: Using Probabilistic Programming for Quantifying Leakage in Privacy Risk AnalysisPardo, R., Rafnsson, W., Probst, C. & Wasowski, A., 2021, European Symposium on Research in Computer Security: Computer Security – ESORICS 2021. Springer, Bind 12973. (Lecture Notes in Computer Science, Bind 12973).Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Fil Privacy Risk Assessment 100% Data Analytics 100% Privacy Protection Mechanisms 100% Probabilistic Programming 100% Risk Analysis 100% Assessing Privacy Risks Using Probabilistic ProgrammingJimenez, R. P., Rafnsson, W., Probst, C. W. & Wasowski, A., 2020.Publikation: Konferencebidrag - EJ publiceret i proceeding eller tidsskrift › Poster › Forskning › peer review Se alle 6 publikationer Projekter Projekter pr. år 2018 2018 2019 2022 2023 2024 2025 2026 1 Igangværende 5 Afsluttet Projekter pr. år In-Flo: Practical Static Analysis for Information-Flow Control of JavaScriptRafnsson, W. (PI)Cyber Hub01/07/2022 → 30/06/2023Projekter: Projekt › Forskning JavaScript 100% Information Flow Control 100% Static Analysis 100% Static Program Analysis 100% Project Outcome 50% Full Stack Security Rafnsson, W. (PI) & Hinrichsen, J. K. (Samarbejdspartner)Nationalt Forsvarsteknologisk Center01/01/2025 → 31/12/2026Projekter: Projekt › Forskning Side Channel 100% Software Security 100% Writing Software 50% Secure Hardware 50% Computer Hardware 50% Uddannelsesprojekt for SMV’erGodskesen, J. C. (PI), Debois, S. (CoI) & Rafnsson, W. (CoI)Industriens Fond01/04/2019 → 30/09/2023Projekter: Projekt › Forskning Mange 100% Sammen 100% Mest 66% Professional Courses 66% Online 50% GAMESS: GAMification and Education for Secure SoftwareBruni, A. (PI), Kulyk, O. (PI) & Rafnsson, W. (PI)Styrelsen for Forskning og Uddannelse01/04/2023 → 31/10/2024Projekter: Projekt › Forskning Secure Software 100% Gamification 100% Cybersecurity 100% Capture the Flag 20% Usable Security 20% Decentralized transactions for open digital markets: Exploring the potential of decentralized and open transaction protocols for digital and digitally mediated services and toolsDittrich, Y. (PI), Jørgensen, K. P. (CoI), Rafnsson, W. (CoI), Ibsen, P. (Admin), Oppermann, N. (Admin), Godskesen, J. C. (CoI) & Hinrichsen, J. K. (Samarbejdspartner)Copenhagen Fintech01/01/2024 → 31/12/2024Projekter: Projekt › Forskning Digital Markets 100% Service Provider 100% Decentralized Transactions 100% Digitally Mediated 100% Transaction Protocol 100% Se alle 6 projekter Presse/medier Datatilsynet undersøger EDC efter kæmpelæk af personfølsomme oplysningerRafnsson, W.05/12/20231 MediebidragPresse/medie SMÅ VIRKSOMHEDER HAR STORE HULLER I ITSIKKERHEDENRafnsson, W.02/02/20211 MediebidragPresse/medie Små virksomheder har store huller i it-sikkerhedenRafnsson, W.30/10/2020 → 16/11/20203 MediebidragPresse/medie",
  "content_length": 5598,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:44"
}