{
  "name": "Willem Visser",
  "homepage": "http://www.cs.sun.ac.za/~wvisser",
  "status": "success",
  "content": "Willem Visser - Stellenbosch University Willem Visser - Stellenbosch University Home Publications Projects News archive Computer Science Division Stellenbosch University Private Bag X1 7602 Matieland, South Africa wvisser -at- cs.sun.ac.za visserw -at- sun.ac.za willem -at- gmail.com +27 21 808 4232 Willem Visser is a professor in the Division of Computer Science at Stellenbosch University (from 2009 till 2013 he was the Head of the Division). His research is mostly focussed around finding bugs in software. More specifically he works on testing, program analysis, symbolic execution, probabilistic symbolic execution and model checking. He is probably most well known for his work on Java PathFinder (JPF) and Symbolic PathFinder (SPF). He previously worked at NASA Ames Research Center, and SEVEN Networks. [Full CV] News... Received the SIGSOFT 2020 Impact Paper Award For the 2000 paper published at ASE, entitled Model Checking Programs Received the ISSTA 2018 Retrospective Impact Paper Award For the 2004 paper published at ISSTA, entitled Test Input Generation with Java PathFinder Received the Best Paper Award at SAICSIT 2017 Best paper award for Probabilistic Programming for Java using Symbolic Execution and Model Counting Became Vice-Dean of Research for the Science Faculty at Stellenbosch University Elected to a three-year term: 2017-2019 Received an NRF A Rating in 2016 One of only two researchers to receive an A rating (Leading International Researcher) in CS and IS in South Africa ICSE 2016 Program Co-Chair Co-chair of ICSE 2016 with Laurie Williams. Service ICSE Steering Committee SPIN Steering Committee [Past] NRF IT Ratings Panel (Member: 2011-2014 Convener: 2013-2014) [Past] ASE Steering Committee: 2008 - 2014 [Past] Associate Editor for ACM TOSEM: 2011 - 2017 [Past] Member of the ACM SIGSOFT Executive Committee: 2012-2018 [Past] Vice-Dean of Research for the Science Faculty 2017-2019 [Past] SAICSIT Council 2017-2019 Students Current Phillip van Heerden (MSc) Symbolic Automata Learning David Baker-Effendi (MSc) Graph Databases for Multi-language and Incremental Data-flow Analysis Past Marcel Dunaiski (PhD) Analysing Ranking Algorithms and Publication Trends on Scholarly Citation Networks Heila Botha (PhD) Verifying Android Applications using Java PathFinder Alexander Leid (MSc) Testing Smart Contracts Jan Taljaard (MSc) Optimised Constraint Solving for Real-World Problems Pieter Jordaan Impendulo: A Tool for Analyzing Programmer Behaviour Marcel Dunaiski Analyzing citation graphs Aline Uwimbabazi Extended probabilistic symbolic execution Piet Theron Criteria for the evaluation of private cloud computing Willem Bester Bug-finding and test case generation for java programs by symbolic execution Kevin Durant Investigating the non-termination of affine loops Gideon Redelinghuys Symbolic string execution Pieter Kruger Cellphone banking at the bottom of the pyramid Conferences ICSE 2016 SPIN 2015 SAICSIT 2014 ASE 2014 Teaching RW146 RW334 RW745 Tools Java PathFinder (JPF) Symbolic PathFinder (SPF) Coastal Green Solver Publications (c) W. Visser, 2018 (thanks to Bernd for allowing me to reuse his template)",
  "content_length": 3163,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:46"
}