{
  "name": "William J. Hurley",
  "homepage": "https://www.rmc-cmr.ca/en/mathematics-and-computer-science/wj-hurley-bsc-mba-phd-professor",
  "status": "success",
  "content": "Dr. William Hurley Skip to main content Skip to \"About this site\" Dr. William Hurley Dr. William Hurley Professor Office: Girouard building, room 343 Telephone: (613) 541-6000 ext 6468 Fax: (613) 541-6315 E-mail: hurley_w@rmc.ca Department of Mathematics and Computer Science College Address Royal Military College of CanadaPO Box 17000, Station ForcesKingston, Ontario, CANADAK7K 7B4 Research Interests Operations Research, Analytics, the Technology of Exographics Short Biography I'm married to Debra and we have two boys, David and Matthew, two grandchildren, Alice and Loretta, and a Basset hound, Miss Lily. Education BSc, Queen’s University, 1976 MBA, York University, 1980 PhD, Queen’s University, 1988. Editorial Associate Editor, Military Operations Research Associate Editor, Journal of Defense Modeling and Simulation Editorial Board, Journal of Gambling Business and Economics Research Funding NSERC, 2015-2019, $100,000 ARP, 2014-2016, $16,500 Current Project I am working on a book Catching Unicorns: How Writing Enables Our Imaginations. It will be published by Kendall Hunt early in 2023. It's about the role of the technology of exographics in ideation. Selected Publications Brimberg, J., Ladany, S., and W. J. Hurley (2018). “Choosing a Winning Team for Mixed Medley Events,” International Journal of Operations Research, 31(3), 300–312. W. J. Hurley and J. S. Finan (2017). “Military Operations Research and Digges's Stratioticos,” Military Operations Research, 22(2), 39-46. Hurley, W. J. and Jack Brimberg (2016). “Measuring Ballistic Dispersion for the Purpose of Ammunition Quality Assurance,” in Operations Research, Engineering, and Cyber Security: Trends in Applied Mathematics and Technology, eds: Nicholas J Daras and Themistocles M. Rassias, 317-330. Broadie, M. and W. J. Hurley (2016). “Golf Analytics: Developments in Performance Measurement and Handicapping,” chapter in: The Handbook of Statistical Methods for Design and Analysis in Sports, Chapman & Hall, in the series CRC Handbooks of Modern Statistical Methods, eds: Jim Albert, Mark E. Glickman, Tim B. Swartz, Ruud H. Konig, http://bit.ly/2jbjkvZ. Hurley, W. J. and Ty Sauerbrei (2015). Letter in Response to the Letter of Jim Lackritz, Chance, accepted June 2015. Hurley, W. J. and Jack Brimberg (2015). “A Note on the Sensitivity of the Strategic Asset Allocation Problem,” Operations Research Perspectives,” 2, 133-136. Fisher, B., Brimberg, J., and W. J. Hurley (2015). “An Approximate Dynamic Programming Heuristic to Support Non-Strategic Project Selection for the Royal Canadian Navy,” Journal of Defense Modeling and Simulation, 12(2), 83–90. Hurley, W. J. and Tyler Sauerbrei (2015). “Handicapping Net Best-Ball Team Matches in Golf,” Chance, to appear April 2015. Hurley, W. J. (2015) “Mandatory Drug Testing in the Canadian Workplace: A Note on the Recent Supreme Court Decision and Its Effect on the Misclassification Rate of Non-Drug-Users,” Chance, accepted June 2014. Brimberg, Jack and W. J. Hurley (2014). “Allocating Operating Funding in the Public Sector and the Newsvendor Problem,” accepted at Journal of the Operational Research Society, June 2014. Brimberg, Jack and W. J. Hurley (2014). “The Problem of Lapsed Funding and the Knee-Jerk ‘Better Information System’ Solution: The Case of the Department of National Defence in Canada,” Journal of Public Procurement, 26(1), 81-89. Hurley, W. J., Brimberg, Jack, and Richard Kohar (2014). “Examining a Gambler's Claims: Probabilistic Fact Checking and Don Johnson’s Extraordinary Blackjack Winning Streak,” Chance, 27(1), 31-37. Brimberg, Jack, and W. J. Hurley, W. J. (2013). “Limitations on the ‘Better Information System’ Solution to the Problem of Lapsed Government Operating Funds,” Journal of Defense Modeling and Simulation, 11(4), available at: https://doi.org/10.1177/1548512913509317in press. Hurley, W. J. and R. N. Farrell (2013). “Assessing Small Sample War-Gaming Datasets,” Journal of Defense Resources Management, 4(2), 87-94. Hurley, W. J., Brimberg, Jack, and Brent Fisher (2013). “Risk-Analytic Approaches to the Allocation of Defense Operating Funds,” Journal of Defense Modeling and Simulation, 10(3), 272-279. Hurley, W. J., Brimberg, Jack (2013). “Game Theory to a Friend’s Rescue,” OR Letters, 41(4), 366-369. Hurley, W. J. (2013). “Ammunition Purchase Decisions in the Face of Long Lead Times and Usage Uncertainty,” Journal of Defense Resources Management, 4(1), 77-82. Hurley, W. J. (2013). “Calculating First Moments and Confidence Intervals for Generalized Bernoulli Stochastic Dividend Discount Models,” Journal of Mathematical Finance, 3, 275-279. Hurley, W. J., Brimberg, Jack, and Brent Fisher (2013). “Use It or Lose It: On the Incentives to Spend Annual Defence Operating Budgets,” Defence Economics, 25(4), 401-413. Hurley, W. J. and Lawrence McDonough, (2012). “A Note on the Hayek Hypothesis and the Favourite-Longshot Bias in Parimutuel Betting,” reprinted in The Economics of Gambling and National Lotteries, ed. Leighton Vaughan Williams, Edward Elgar Publishing. Brimberg, Jack and W. J. Hurley (2012). “Do Professional Hockey Teams With A Two-Goal Lead Lose More Often Than They Should?” International Journal of Operations Research, 15(2), 226-233. Brimberg, Jack and W. J. Hurley (2012). “The Role of Chance in Canada's Victory in the 1972 Summit Series,” INFOR: Information Systems and Operational Research, 50(1), 40-43. Hurley, W. J., Pavlov, Andrey, and W. S. Andrews (2012). “A Valuation Model for NFL and NHL Draft Positions,” Journal of the Operations Research Society, 63, 890-898. Hurley, W. J. and Jack Brimberg (2011). “Re-engineering the Canadian Army's Situational Awareness System to Reduce Message Collisions,” Military Operations Research, 16(3), 15-22. The complete list can be obtained by request. An incomplete list is available on Google Scholar. Date modified: 2024-05-31",
  "content_length": 5899,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:53"
}