{
  "name": "Will N. Browne",
  "homepage": "https://research.qut.edu.au/qcr/people/will-browne",
  "status": "success",
  "content": "Will Browne - QUT Centre for Robotics Skip to content Prof Will Browne Home Our People Prof Will Browne Please enable JavaScript Please enable JavaScript Find Will Browne onWill Browne's full profile, contact information and publications are available on: Professor (Artificial Intelligence and Robotics, Digital Twins, Design-led manufacturing, Cobots) Engineering Doctorate (University of Wales)Professor Will Browne's expertise is in Artificial Cognitive Systems with over 27 years of experience in Artificial Intelligence and Robotics. The 'Professor and Chair in Manufacturing Robotics' title is through QUT, the ARM Hub and CSIRO who have jointly invested in this position. This is to further University and Industry collaboration in the development of advanced robotics in a wide range of manufacturing, from aquaculture to factory operations to healthcare.The ARM Hub is an independent not-for-profit agile technology application centre for robotics, artificial intelligence and design-led manufacturing. It is an impactful aggregator of research and development, linking private industry, cutting-edge research and Government to uplift, upskill and transform Australian manufacturing. It draws together skilled teams of scientists, technical specialists, designers, and engineers, to develop commercial, advanced manufacturing solutions. He is co-PI of the $5 million SfTI Robotics Spearhead developing the science necessary for human robot collaboration.Will is leading an Industrial Transformation Research Hub proposal on Flexible, Intelligent, Robust Manufacturing through the use of artificial intelligence for advancing manufacturing, e.g. effective construction and use of digital twins. International links include being the NZ representative on the Australian Robotics and Automation Association council.Will is recognised internationally in the field of Learning Classifier Systems (LCS), being elected by his peers to co-organise the International Workshop on Learning Classifier Systems, invited to serve as co-track chair in the field’s major conference GECCO (Genetic and Evolutionary Computation Conference) 2011, 2012, 2017 & 2018 and serve on Journal editorial boards. He has presented, with international colleagues, multiple introductory tutorials on LCS at international conferences, e.g. Congress on Evolutionary Computation, GECCO and World Congress on Computational Intelligence. He is presenting the first tutorial on advanced LCS in GECCO 2021. Together with Dr Ryan Urbanowicz (University of Pennsylvania, USA) he co-authored the first textbook on LCS. He has 24 years' experience in developing the LCS approach, which as a transparent symbolic learning system is regaining popularity due the need for Explainable AI (XAI). Projects (Chief investigator)Abstraction Reasoning for Mobile RoboticsContinual Learning SystemNeuro-symbolic learning via robotic exploration Additional information Experience 2021 – present: School of Electrical Engineering & Robotics, QUT ARM Hub and CSIRO2009 - 2021: School of Engineering and Computer Science, Victoria University of Wellington2001 - 2009: Lecturer, Cybernetics, School of Systems Engineering, University of Reading, UK1998 - 2001: Post-Doctoral Research Associate in the Control and Instrumentation Research Group, University of Leicester, UK1994 - 1998: Eng.D, University of Wales, Cardiff and British Steel, through the Engineering Doctorate scheme, South Wales. “The development of an industrial learning classifier system for application to a steel hot strip mill”1993 - 1994: MSc in Energy (Distinction), University of Wales, Cardiff1990 - 1993: B. Eng. Mechanical Engineering, Honours, University of Bath, UK NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 4009,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:42"
}