{
  "name": "William H. Sanders",
  "homepage": "https://engineering.cmu.edu/directory/bios/sanders-william.html",
  "status": "success",
  "content": "William Sanders - College of Engineering at Carnegie Mellon University Skip to Main Content Carnegie Mellon College of Engineering Home Page Carnegie Mellon College of Engineering Home Page Search Search Popular Searches Admitted students Master’s of AI Engineering Engineering Magazine graduate programs Manufacturing Futures Institute Rethink the Rink Social Media CMUEngineering College of Engineering CMUEngineering CMUEngineering RSS Feed @CMUEngineering William Sanders is the President of Rochester Institute of Technology and an Adjunct Research Professor at Carnegie Mellon University's CyLab Security and Privacy Institute. Sanders served as the Dr. William D. and Nancy W. Strecker Dean of CMU's College of Engineering from 2020 to 2025. Prior to Carnegie Mellon, Sanders spent 25 years as a tenured professor and held the Herman M. Dieckamp Endowed Chair in Engineering at the University of Illinois. Email sanders@rit.edu Education Ph.D., Computer Science and Engineering, University of Michigan MSE, Computer, Information, and Control Engineering, University of Michigan BSE, Computer Engineering, University of Michigan Research Interests critical infrastructure resiliency metrics and evaluation secure and dependable computing and security smart grid Media mentions Carnegie Mellon University Africa Combining passion with education Arinloye, who graduated this past May, made the most of her time at CMU-Africa through academics, research, clubs, and the exchange program. Carnegie Mellon University Africa 11th graduation ceremony celebrates innovation and excellence CMU-Africa recently graduated the 11th cohort of students, which represented 16 nationalities. CMU Engineering Faculty and alumnus inducted into the National Academy of Engineering College of Engineering dean, professor, and alumnus inducted in the National Academy of Engineering. CMU Engineering Carnegie Mellon awarded $20M for transportation research Congresswoman Summer Lee and U.S. Department of Transportation (USDOT) announce that CMU will lead consortium that will receive $20 million to create Safety21, a University Transportation Center. See More Mentions CMU Engineering Faculty and alumni elected to National Academy of Engineering Carnegie Mellon University’s Bill Sanders, Elias Towe, Anirudh Devgan, and Stefan Savage have received the prestigious honor of election to the National Academy of Engineering (NAE). Tribune-Review Sanders and CMU-Africa students quoted on Mastercard partnership Dean Bill Sanders and CMU-Africa students Junias Bonou and Opelo Tshekiso were quoted in the Tribune-Review about the impact of CMU-Africa and the recently-announced partnership with the Mastercard Foundation. CMU Engineering CMU to lead alliance to explore equitable career advancement in higher ed Carnegie Mellon University will lead an alliance to develop a new career advancement model, Project ELEVATE, through the Alliances for Graduate Education and the Professoriate (AGEP), with Johns Hopkins University and New York University also part of the team. CMU Engineering Gift to advance Electrical and Computer Engineering A lifetime of innovation and leadership in the suburbs of Pittsburgh, Pennsylvania has inspired a Carnegie Mellon alumnus to make a generous gift to support electrical and computer engineering at the institution. CMU Engineering Team builds tools, innovations to support federal investment With major investments in infrastructure and innovation pending, a multi-disciplinary initiative lead by EPP’s Erica Fuchs is building the tools and innovations to inform government decisions. Carnegie Mellon University Africa Carnegie Mellon University Africa Celebrates 8th Graduation The 8th annual CMU-Africa graduation ceremony took place on Sunday, May 23, celebrating this year’s graduating class of 66 graduates from 12 different countries in Africa. CMU Engineering Rethinking the rink for hockey safety Whether 50 pounds or 200, hockey players come in all sizes, and their safety matters. This unique collaboration invites Carnegie Mellon students to explore new ways to make hockey safer. CMU Engineering participates in third annual “Rethink the Rink” CMU Engineering teamed up with the Pittsburgh Penguins and Covestro in the third annual “Rethink the Rink” make-a-thon. Over spring break, teams of students created shoulder and elbow pad designs to better protect hockey players. CMU Engineering Engineering deanship endowed with $15M gift Carnegie Mellon University alumnus William Strecker and his wife, Nancy, have made a transformational $15 million gift to endow the dean’s chair of the College of Engineering. Update your page",
  "content_length": 4662,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:53"
}