{
  "name": "Willem-Paul Brinkman",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/interactive-intelligence/people/current-group-members/willem-paul-brinkman",
  "status": "success",
  "content": "Personal page of Willem-Paul Brinkman Zoeken Sluit zoek Willem-Paul Brinkman Biography In 2003 Willem-Paul Brinkman (1970) received his PhD degree in the area of human-computer interaction from Eindhoven University of Technology, The Netherlands. After that, he obtained his Postgraduate Certificate in Learning and Teaching in Higher Education from Brunel University of West London. Here, he worked for five years as a lecturer before moving to Delft University of Technology in 2007. He now works as an associate professor in the Interactive Intelligence group that works on understanding and engineering human-agent collaboration. Research Brinkman's primary research interests are human-computer interaction, human-centred artificial intelligence, behaviour change support systems, specifically as part of eHealth systems. He is fascinated by artificial social agents (conversational agents) that offer psychological assessment, support, therapy, or training. His ultimate objective is to establish (semi)autonomous eHealth systems with a digital psychologist that can assist individuals in achieving a broad set of behaviour change goals ranging from overcoming mental illness to lifestyle modification for coping with a chronic illness. He is, therefore, determined to build these systems and establish an empirically grounded understanding of them. For this, he works on several research grants that focus on these types of eHealth systems, such as home-based virtual reality therapy systems for patients with social anxiety or post-traumatic stress disorder, and artificial social agents for people with sleeping problems, depression, or nicotine addiction. Academic involvement Over the years, he has been involved in the organisation of several international conferences and workshops and acted as an associate or guest editor of several journals. He has co-authored over 50 journal papers and over 80 peer-reviewed conference and workshop publications. Brinkman is a senior member of the Association for Computing Machinery (ACM). Teaching Brinkman is the director of studies of the MSc Computer Science programme. In this role, he is responsible for the content, organisation and quality of the curricula. Projects Perfect Fit: Targeting key risk factors for cardiovascular disease in at-risk individuals using a personalized and adaptive approach. Netherlands Organization for Scientific Research (NWO) (co-applicant). 2019-2024.Hybrid Intelligence - Design patterns for hybrid intelligent teams (NWO) (co-supervising PhD candidate)Smart Social Systems and Spaces for Living Well (S4). The 4TU research centre Humans & Technology 2016 - 2020 (Virtual Work Coach work package leader)Advanced training simulator: Passive virtual self-experiences in virtual reality. China Scholarship Council (CSC), CSC no 201506090167:2015-2019 (supervisor PhD candidate)Virtual eCoaching and Storytelling technology for post-traumatic stress disorder treatment (VESP), Netherlands Organization for Scientific Research (NWO), Program Creative Industry, NWO no. 314-99-104:2013-2018 (project leader) Sleep Care: Persuasive technology for personalized sleep coaching. Technology Foundation STW, STW no 12040: 2012-2016 (project member)Socio-Geographical Support, Interaction for universal access. COMMIT. P2.WP7: 2012-2016 (project member) Computer Support for anxiety disorder treatment at home (CATCH), Netherlands Organization for Scientific Research (NWO), NWO no. 655.010.207: 2011-2015 (project coordinator)Accommodating of emotion during decisions. Dutch Economic Structure Enhancement Fund, Brain and Cognition: Societal Innovation Program, NWO no. 056-22-010: 2011-2015 (project partner, project website)Effectiveness of virtual reality interventions for enhancement of stress resilience. Dutch Economic Structure Enhancement Fund (FES), Brain and Cognition: Societal Innovation Program, NWO no. 056-25-012: 2010-2016 (project member, website)Assessment of a disease management system with medical devices in renal disease (ADMIRE).  The Netherlands organisation for health research and development (ZonMw), ZonMw no. 300040004: 2010-2015 (project member)Intelligent Internet-delivered Multi-patient VR treatment system, China Scholarship Council (CSC), CSC no. 2010609042:2010-2014 (supervisor PhD candidate)The sense of presence created by display devices and its impact on people’s activities, China Scholarship Council (CSC), CSC no. 2009609048:2009-2014 (supervisor PhD candidate)Life-Like multimodal avatars, China Scholarship Council (CSC), CSC no. 2008609199: 2009-2014 (supervisor PhD candidate) Key Literature Brinkman's publication track record and citations can be found on Google scholar,  DBLP, ORCID, PubMed, and Researchgate  Burger, F., Neerincx, M.A., Brinkman, W.P. (2021) Natural language processing for cognitive therapy: Extracting schemas from thought records. PLoS ONE 16(10): e0257832. paper, data & scriptsDing, D., Brinkman, W. P., & Neerincx, M. A. (2020). Simulated thoughts in virtual reality for negotiation training enhance self-efficacy and knowledge. International Journal of Human-Computer Studies, 102400. online data|scriptBurger F, Neerincx M.A., Brinkman W.P. (2020). Technological State of the Art of Electronic Mental Health Interventions for Major Depressive Disorder: Systematic Literature Review. Journal of Medical Internet Research, 22(1):e12599. open accessHorsch CH, Lancee J, Griffioen-Both F, Spruit S, Fitrianie S, Neerincx MA, Beun RJ, Brinkman WP (2017) Mobile Phone-Delivered Cognitive Behavioral Therapy for Insomnia: A Randomized Waitlist Controlled Trial. Journal of Medical Internet Research;19(4):e70 open accessLing, Y., Nefs, H. T., Morina, N., Heynderickx, I., & Brinkman, W. P. (2014). A meta-analysis on the relationship between self-reported presence and anxiety in virtual reality exposure therapy for anxiety disorders. PloS one, 9(5), e96144. open accessTielman, M.L., Neerincx, M.A., Bidarra, R., Kybartas, B,., Brinkman, W.P. (2017). A Therapy System for Post-Traumatic Stress Disorder Using a Virtual Agent and Virtual Storytelling to Reconstruct Traumatic Memories. Journal of medical systems, 41: 125. open access Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina +31 15 27 83534 W.P.Brinkman@tudelft.nl Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands Room 4W.800 Homepage:  click here",
  "content_length": 6393,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:46"
}