{
  "name": "William L. Scherlis",
  "homepage": "http://www.cs.cmu.edu/~wls",
  "status": "success",
  "content": "William Scherlis - Software and Societal Systems Department - School of Computer Science - Carnegie Mellon University School of Computer Science  › Software and Societal Systems Department › People › core-faculty › William Scherlis Dr. William Scherlis Professor, Software and Societal Systems Contact SEI 3318 scherlis(through)cmu.edu 412-268-8741 Address 5000 Forbes Avenue Pittsburgh, PA 15213 Bio William L. Scherlis is a professor of computer science at Carnegie Mellon and special advisor to the Software Engineering Institute, a DoD FFRDC at CMU. From September 2019 to May 2022 he served as director of DARPA’s Information Innovation Office (I2O), where he led program managers in the development of programs in cybersecurity, artificial intelligence, secure software, and information operations. He subsequently served as a special assistant to the DARPA Director until September 2022. He was awarded the DARPA Superior Public Service Medal. At CMU he served for 12 years as head of the Software and Societal Systems Department (formerly the Institute for Software Research) in the School of Computer Science. S3D hosts research and educational programs related to software development, security and privacy, social network analysis, IoT and mobility, and related topics. He founded the PhD program in Software Engineering in 1999 and led it for its first decade. He also led several larger multi-university projects including the NASA High Dependability Computing Program (HDCP) and CMU's NSA Science of Security Lablet. During 2012 and early 2013 he was the acting Chief Technology Officer for the Software Engineering Institute. Earlier in his career, Scherlis served as a program manager and later in the federal Senior Executive Service at DARPA, developing programs in areas including software technology, computer security, and information infrastructure. At DARPA, he had a leading role in the initiation of the High Performance Computing and Communications program (HPCC, now NITRD) and in defining the concept for CERT-like security organizations, hundreds of which now operate in more than 90 countries. He received a Senior Executive Service Performance Award. Scherlis has led multiple national studies including National Research Council study committees on defense software and on e-government. He served multiple terms as a member of DARPA’s Information Science and Technology (ISAT) study group, and he is currently a member of the Computer Science and Telecommunications Board (CSTB) of the National Academies. He testified before Congress on the federal AI workforce, on federal software sustainment, on computing technology and innovation, and on roles for a Federal CIO. Scherlis served as program chair for a number of technical conferences including the ACM Foundations of Software Engineering Symposium (FSE) and the ACMSymposium on Partial Evaluation and Program Manipulation (PEPM). He has been an advisor to technology firms, venture firms, and start-ups, and was co-founder of Panopto, a CMU spin-off. Scherlis joined the CMU faculty after completing an undergraduate degree in applied mathematics at Harvard, a year in the Department of Artificial Intelligence at the University of Edinburgh as a John Knox Fellow, and a doctorate in computer science at Stanford. His personal research relates to software assurance, cybersecurity, software analysis, and assured safe concurrency. He is a Life Fellow of the IEEE and a Lifetime National Associate of the National Academy of Sciences.",
  "content_length": 3521,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:59"
}