{
  "name": "William H. Hsu",
  "homepage": "http://people.cis.ksu.edu/~bhsu",
  "status": "success",
  "content": "William H. Hsu William H. Hsu Professor Associate Director of Graduate Programs Director, Laboratory for Knowledge Discovery in Databases (KDD) Department of Computer Science - mailing address Kansas State University Office: 2178 Engineering Hall (+1 785 236 8247) KDD Lab: 2221 Engineering Hall (+1 785 380 7422) Publications - Conference Papers | Journal Papers | Book Chapters | Books Need an appointment with me? Please see my calendar (to be embedded below) and these directions, and then please go here (and remember to cc: ahato@ksu.edu on e-mail requests) Schedules - William H. Hsu's weekly schedule (see below) to appear Contact Information Primary office contact Roaming (home and travel) contact E-mail: bhsu [AT] ksu.edu E-mail: banazir [AT] gmail.com Google Talk (GTalk): rizanab GTalk/Skype/Trillian Astra: banazir YIM/MSN/AIM: rizanabsith YIM/MSN/AIM, Facebook: hsuwh ICQ: 191317559 ICQ: 28651394 Office telephone (Google Voice): +1 785 236 8247 Home telephone: +1 785 380 9809 Office fax: +1 785 532 7353 eFax number: +1 707 220 1363 Educational History Ph.D. Computer Science University of Illinois at Urbana-Champaign 1998 M.S.E. Computer Science The Johns Hopkins University 1993 B.S. (double major) Computer Science (first in class) and Math Sciences (departmental honors) The Johns Hopkins University 1993 PGP Public Key Erdös number: 3 (my shortest known Erdös chain) Courses Taught CIS 830: Topics in Artificial Intelligence (Spring 2000, 2001, 2002, 2003, 2004, 2005, 2007, 2008, 2009, 2010, 2011, 2012) CIS 732: Machine Learning and Pattern Recognition (Fall 2001, 2002, 2003, 2005; Spring 2007, 2008, 2009, 2010, 2011, 2012) CIS 736: Computer Graphics (Spring 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2008, 2008, 2009, 2010, 2011, 2012) CIS 560: Database System Concepts (Spring 2006, Fall 2006, Spring 2007, Fall 2007, Spring 2008, Fall 2008, Fall 2009, Fall 2012) CIS 562: Enterprise Information Systems (Fall 2010, 2011) CIS 730: Artificial Intelligence (Fall 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011) CIS 530: Introduction to Artificial Intelligence (Fall 2007, 2008, 2009, 2010, 2011) CIS 490: Introduction to Artificial Intelligence (Fall 2005, 2006) CIS 690: Implementation of High-Performance Data Mining Systems (Summer 2000, 2001, 2002, 2003, 2004, 2005, 2010) CIS 864: Data Engineering (Spring 2000, 2001) CIS 890: Advanced Topics in Intelligent Systems (Fall 2000, Spring 2001, Spring 2002) CIS 798: Topics in Intelligent Systems and Machine Learning (Fall 1999) Professional and Honor Societies Tau Beta Pi Engineering Honor Society - Maryland Alpha Chapter, 1991 Association for Computing Machinery (ACM) - lifetime member since 2016 (member ID 3600937) Association for the Advancement of Artificial Intelligence (AAAI) - member since 1997, lifetime member since 2017 (member ID 39894) Society for Industrial and Applied Mathematics (SIAM) - lifetime member since 2018 (member ID 020860191) American Mathematical Society (AMS) - lifetime member since 2019 (member ID HSWLXC) Linguistic Society of America (LSA) - lifetime member since 2020 (member ID banazir) Society of Women Engineers (SWE) - lifetime member since 2021 (member ID 1152564) Institute of Electrical and Electronics Engineers (IEEE) - member since 1999 (member ID 90455522) International Society for Genetic and Evolutionary Computation (ISGEC) Other Sites Maintained by William Hsu KSU Computers and Technology Movie Series - current season (Season 7) (Facebook) KDD Lab Resource Page The Red Songbook of Westmarch (Tolkien humor: musical parodies) Alumni Associations Severn School The Johns Hopkins University University of Illinois at Urbana-Champaign",
  "content_length": 3693,
  "method": "requests",
  "crawl_time": "2025-12-01 14:46:53"
}