{
  "name": "Wim Martens",
  "homepage": "https://www.theoinf.uni-bayreuth.de/en/team/martens_wim/index.php",
  "status": "success",
  "content": "Druckansicht der Internetadresse: Team > Prof. Dr. Wim Martens Overview Overview Prof. Dr. Wim Martens Person Contact Faculty of Mathematics, Physics & Computer ScienceData-Intensive Computing (AI VII) Prof. Dr. Wim MartensHead of Research GroupResearch InterestsBioWim Martens is professor for Data Intensive Computing at the University of Bayreuth. He is interested in foundational aspects of data management (with a current focus on graph databases and query language design), logic, complexity, and formal language theory. One of his goals is to find a good balance for making programming with data easy, intuitive, precise, and efficient.He was an invited speaker at STOC 2017 and PODS 2022 and his research received several awards (e.g., SIGMOD Best Industry Paper, several SIGMOD research highlight awards, an ICDT best paper and Test-of-Time award, and the Belgian dissertation award for computer science). He was PC chair of PODS and ICDT, and acted as program committee member in major conferences in databases, the Web, theoretical computer science, and logic, such as SIGMOD, PODS, ICDE, ICDT, WWW, ICALP, STACS, and LICS. Currently, he is on the editorial board of ACM Transactions on Database Systems and Transactions on Graph Data and Knowledge, and the advisory board of TheoretiCS. In the past, he chaired the ICDT Council and the SIGMOD Research Highlight Award committee.PublicationsI am working on a book about principles of databases, which can also be found on Github. The book is supposed to be suitable for teaching, but errors will be unavoidable, especially in early versions. You can make comments and point out errors in Github.A list of my publications can be found here or through our local server.The slides for my tutorial at ESSLLI 2007 can be downloaded here.Awards / HonorsSIGMOD Best Industry Paper Award 2023ICDT Test of Time Award 2023Invited speaker at 41st ACM Sympositum on Principles of Database Systems (PODS), 2022Best paper award at the International Conference on Database Theory (ICDT), 2018SIGMOD Research Highlight Awards in 2017, 2019, and 2023Invited speaker at 29th ACM Symposium on the Theory of Computing (STOC), 2017Junior Fellowship, Gesellschaft für Informatik (GI), 2013Emmy-Noether Nachwuchsgruppe, Deutsche Forschungsgemeinschaft (DFG), 2010Admitted to the Junge Kolleg der Nordrhein-Westfälischen Akademie der Wissenschaften und der Künste, 2008Dissertation Award for Computer Science, Belgium (FWO-IBM Award for Computer Science), 2006Industry CollaborationI heard that Uni Bayreuth students like to know which kinds of industry collaborations we have. I have/had collaborations with people in the following companies (alphabetical, incomplete):Amazon Web Services, Seattle, WA, USAdata.world, Austin, TX, USAGoogle, Mountain View, CA, USANeo4J, Munich, GermanyOracle, Redwood City, CA, USARelationalAI, Berkeley, CA, USATigerGraph, Redwood City, CA, USAActivitiesPC Chair: PODS 2024, ICDT 2016PC Memberships (selection):PODS (2026, 2024, 2020, 2018, 2013, 2009)ICDT (2023, 2016, 2014, 2012, 2010)SIGMOD (2026, 2022)VLDB (2026-2027)ICDE (2025, 2019, 2011, 2010, 2008)CIKM (2022, 2011)EDBT (2011)WWW (2009)ICALP (2023, 2017)LICS (2021)STACS (2014)MFCS (2016)FCT (2017)Editorial board member for ACM Transactions on Database Systems and Transactions on Graph Data and Knowledge (TGDK), Advisory board member of TheoretiCS (a new, high quality, diamond open access journal)Journal reviewing: Journal of the ACM, ACM Transactions on Database Systems, Journal of Computer and System Sciences, Information Systems, VLDB Journal, Theoretical Computer Science, Journal of Web Semantics, Semantic Web Journal, Information and Computation, Theory of Computing Systems, ACM Transactions on Programming Languages and Systems, Evolutionary Computation, Acta Informatica, Fundamenta Informatica, Mathematical Structures in Computer Science, Information Sciences, Information Processing Letters, IEEE Transactions on Knowledge and Data Engineering, Logical Methods in Computer Science, etc.Past ActivitiesChair of the SIGMOD Research Highlight Award Committee (2021-2022)Chair of the ICDT Council (2016-2021)Current PhD students:Janik Hammerer, since 2024Christian Birzer, since 2025Former PhD students:Tina Popp, defended 2022Johannes Doleschal, defended 2021Thomas Timm, defended 2020Katja Zeume (formerly: Katja Losemann), defended 2015 Faculty of Mathematics, Physics & Computer ScienceData-Intensive Computing (AI VII) Prof. Dr. Wim Martens Head of Research Group Universität BayreuthAngewandte Informatik VIIUniversitätsstraße 3095447 BayreuthRoom: 2.40, Computer Science Building (INF).Consultation hour: Thurday 14-15pm (except during the semester break).E-mail: firstname.surname@uni-bayreuth.deInternational students: Please do not contact me with questions about your eligibility or the requirements for our MSc in Computer Science. The criteria are explained here.Since we receive 1000+ applications per semester, I cannot even read all the emails that reach me wrt our MSc in Computer Science. Please forgive me if I do not reply to you. Phone: +49 (0)921 / 55-7750 Webmaster: Christian Birzer Facebook Youtube-Kanal Instagram UBT-A Contact",
  "content_length": 5200,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:09"
}