{
  "name": "Wim Vanderbauwhede",
  "homepage": "http://www.dcs.gla.ac.uk/~wim",
  "status": "success",
  "content": "Prof Wim Vanderbauwhede • Wim Vanderbauwhede Prof Dr Wim Vanderbauwhede Professor Wim Vanderbauwhede is the lead of the Low Carbon and Sustainable Computing activity at the School of Computing Science of the University of Glasgow. He received a PhD in Electrotechnical Engineering from the University of Gent, Belgium in 1996. He has been a lecturer in the School of Computing Science at the University of Glasgow since April 2004. His research has resulted in over 150 refereed conference and journal papers as well as several books and book chapters. His research focuses on compilers and runtime systems for energy-efficient heterogenous architectures, as well as the wider issues relating to low carbon and sustainable computing. Before returning to academic research, Prof Vanderbauwhede worked in the electronics industry as a Design Engineer and Technology R&D Engineer. Research highlights My research interests are mainly in the field of programming languages and parallel architectures such as FPGAs, manycore processors and GPGPUs. I am also the lead on the Low Carbon and Sustainable Computing research theme. Low Carbon and Sustainable Computing The Problem: • The current emissions from computing are about 2% of the world total but are projected to rise steeply over the next two decades. By 2040 emissions from computing alone will be close to half the emissions level acceptable to keep global warming below 2°C. This growth in computing emissions is unsustainable: it would make it virtually impossible to meet the emissions warming limit. • The emissions from production of computing devices far exceed the emissions from operating them, so even if devices are more energy efficient producing more of them will make the emissions problem worse. Therefore we must extend the useful life of our computing devices. The Solution: • As a society we need to start treating computational resources as finite and precious, to be utilised only when necessary, and as effectively as possible. We need frugal computing: achieving the same results for less energy. The Vision: • Imagine we can extend the useful life of our devices and even increase their capabilities without any increase in energy consumption. • Meanwhile, we will develop the technologies for the next generation of devices, designed for energy efficiency as well as long life. • Every subsequent cycle will last longer, until finally the world will have computing resources that last forever and hardly use any energy. ➤ Read more about the vision for Low Carbon and Sustainable Computing ➤ Read more about the Low Carbon and Sustainable Computing Theme activities AppControl: Enforcing Application Behaviour through Type-Based Constraints The AppControl project is a £1.5m EPSRC-funded project (2020-2024) that enhances Digital Security By Design for mission-critical Systems-on-Chip. It uses the capabilities provided by the CHERI architecture to enable Design-by-Specification: the Systems-on-Chip has a formal, executable specification (typically created by the system architect), and every software component of the SoC is forced to adhere to this specification. Programs with incompatible specifications cannot run; unspecified run-time behaviour will raise an exception. The practical realisation is through the extension of programming languages to supports expressive specifications and a toolchain which ensures that the specifications are enforced at run time on Capability hardware. ➤ Read more about the AppControl project Border Patrol: Improving Smart Device Security through Type-Aware Systems Design Border Patrol, a £1.75m EPSRC-funded project (2017-2023), addresses the increasing concerns about the safety and security of critical infrastructure such as nuclear power plants, the electricity grid and other utilities in the face of possible cyber attacks. Smart devices based on Field-Programmable Gate Arrays (FPGAs) and embedded microprocessors carry the very real risk of malicious functionality hidden in the silicon or in software binaries, dormant and waiting to be activated. Border Patrol closely connects the system design specification with the actual implementation through the use of a formal design methodology based on type systems with static and dynamic type checking. The type system is used as a formal language to encode the design specification so that the actual implementation will automatically be checked against the specification. ➤ Read more about the Border Patrol project Acceleration of Weather and Climate Modelling Collaboration with atmospheric scientists at the Kyoto University and the University of Aizu, to accelerate weather simulations and climate modelling using GPUs, FPGAs and supercomputers. ➤ Read more about acceleration of weather and climate modelling ➤ Read more about my research",
  "content_length": 4825,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:11"
}