{
  "name": "Wing Kwong Chan",
  "homepage": "https://www.cs.cityu.edu.hk/~wkchan",
  "status": "success",
  "content": "Dr. Wing-Kwong Chan's homepage Wing-Kwong (Ricky) Chan BEng MPhil PhD HKU Associate Professor Department of Computer Science City University of Hong Kong Tat Chee Avenue, Kowloon Tong Hong Kong Office: Room G7309 (near lift 7, 7/f, green zone of Yeung (AC1) Building) Phone: +852 3442 9684 Fax: +852 3442 0503 Email: wkchan  [at] cityu.edu.hk Web: http://www.cs.cityu.edu.hk/~wkchan Dr. Chan worked as a software engineer and then returned to academica. He is currently an associate professor. He received all three degrees from The University of Hong Kong. His first degree was in Computer Engineering, which was quite hardware-oriented, and then he moved to the software side to study software engineering in his MPhil and PhD degrees. Dr Chan's current research and teaching disciplines are software engineering, particularly the technical side of software engineering and its interface with emerging technologies like machine learning, blockchain, and GPU. He is interested in addressing technical challenges in program analysis and concurrency. Dr Chan published more than 100 papers in various venues such as TOSEM, TSE, TRel, TSC, TPDS, CACM, JSS, IST, STVR, SQJ, ICSE, ESCE/FSE, ASE, ISSTA, COMPSAC, QSIC, QRS, ICWS, AST, and WWW. He received the best paper awards from COMPSAC'04, COMPSAC'08, COMPSAC'10, QSIC'11, QRS'16, and ISET'18. He was one of the awardees of the CityU President's Awards 2017. His published work can be found at his CityU Scholar page or his Google Scholar page. Preprints of articles can also be found on his website or obtained from him on request. Dr Chan is on the editorial board of the Journal of Systems and Software, Software Testing, Verification and Reliability, Array, and the International Journal of Creative Computing. He is serving or has served as PC member of some conferences such as ICSE, ESEC/FSE, ISSTA, ASE, COMPSAC, QRS, AST, MM, ICMR, ICWS, and ICSOC. Research Interests: Software engineering (SE), SE side of deep learning, SE side of blockchain systems, program analysis, and program testing I am looking for one self-motivating PhD student to join in 2024 Fall. If you are interested, put my name in the CityU PhD application form and contact me for matching. MSc in E-Commerce (MSEC) is a master's progremme jointly offered by the CS Department and IS Department of City University of Hong Kong. I am the program leader from the CS Department. You may find more information about MSEC programme from our departmental homepage, and here is a leaflet that summarizes the key structure of the programme. His current PhD students are shown below: Qilin Zhou (topic: certified patch robustness) Zhou Wang Alumni Dr. Haipeng Wang (CityU PhD, 2025) Dr. Jiaxin Wu (CityU PhD, 2024), co-supervised with Prof Chong-Wah Ngo Dr. Zhengyuan Wei (CityU PhD, 2023) Dr. Imran Ashraf (CityU PhD, 2023) Dr. Zhijian Hou (CityU PhD, 2023), co-supervised with Prof Chong-Wah Ngo Dr. Xiaoxue Ma (CityU PhD, 2023) Dr. Thanh Nguyen-Huu (CitytU PhD, 2022), co-supervised with Chong-Wah Ngo Mr. Xiupei Mei (CityU MPhil, 2022) Dr. Hao Zhang (CityU PhD, 2021) Dr. Bin Zhu (CityU PhD, 2021), co-supervised with Chong-Wah Ngo Dr. Ernest Bota Pobee (CityU PhD, 2021) Dr. Jialin Yang (CityU PhD, 2018) Dr. Chung man Tang (CityU PhD, 2017), co-supervised with Y.T. Yu Dr. Chunbai Yang (CityU PhD, 2017) Dr. Shangru Wu (CityU PhD, 2016) Dr. Edward Kan (HKU PhD, 2016), co-supervised with T.H. Tse Dr. Changjiang Jia (CityU PhD, 2015) Dr. Yan Cai (CityU PhD, 2014), co-supervised with Y.T. Yu Dr. Ke Zhai (HKU PhD, 2012), co-supervised with T.H. Tse Dr. Bo Jiang (HKU PhD, 2011), co-supervised with T.H. Tse Dr. Lijun Mei (HKU PhD, 2009), co-supervised with T.H. Tse Dr. Zhenyu Zhang (HKU PhD, 2008), co-supervised with T.H. Tse Dr. Heng Lu (HKU PhD, 2006), co-supervised with T.H. Tse Latest research papers. Clover (TOSEM 2025) by Haipeng Wang, Zhengyuan Wei, Qilin Zhou, Wing-Kwong Chan. (Un)likelihood Training for Interpretable Embedding. (ACM ToIS 54(3):394-418, 2024) by Jiaxin Wu, Chong-Wah Ngo, Wing-Kwong Chan, Zhijian Hou. Identifying metamorphic relations: (SPE 54(3): 394-418, 2024) by Chang-Ai Sun, Hui Jin, Siyi Wu, An Fu, Zuoyi Wang, Wing Kwong Chan. Toward AI-facilitated Learning Cycle in Integration Course Through Pair Programming with AI Agents (CSSE&T 2024) by Zhengyuan Wei, Albert T. L. Lee, Victor C. S. Lee, Wing-Kwong Chan. CrossCert (FSE 2024) [DOI][PDF] by Qilin Zhou, Zhengyuan Wei, Haipeng Wang, Bo Jiang, Wing-Kwong Chan. Valid Input Generation for DNN (COMPSAC 2024) [DOI][PDF] by Jingyu Zhang, Jacky Keung, Xiaoxue Ma, Xiangyu Li, Yan Xiao, Yishu Li and Wing Kwong Chan. Improved ITV (ICMR 2024) [DOI][PDF] by Jianxu Wu, C.W. Ngo, and W.K. Chan. MajorCert (ASE 2024) [DOI][PDF] by Qilin Zhou, Zhengyuan Wei, Haipeng Wang, W.K. Chan. Aster (QRS 2023) by Haipeng Wang, Zhengyuan Wei, and W.K. Chan. JITDP (QRS 2023) by Yuxiang Guo, Xiaopeng Gao, Zhenyu Zhang, W.K.Chan, and Bo Jiang. 𝜇MT (Wiley SPE) [DOI] by Chang-ai Sun, Hui Jin, Siyi Wu, An Fu, Zuoyi Wan, and Wing Kwong Chan. accepted FoodMask (Elsevier PR) by Huu-Thanh Nguyen, Yu Cao, Chong-Wah Ngo, and, Wing-Kwong Chan. accepted DeepPatch (ACM TOSEM 2023) by Zhengyuan Wei, Haipeng Wang, Imran Ashraf, Wing Kwong Chan. ECM (CSEET 2023) by W.K. Chan, Y.T. Yu, Jacky W. Keung, and Victor C.S. Lee Cross-domain Food Image-to-Recipe Retrieval by Weighted Adversarial Learning (PDF) (white paper) by Bin Zhu, Chong-Wah Ngo, Jingjing Chen and Wing-Kwong Chan OAT (TASE 2023) by Mengjun Du, Peiyang Li, Lian Song, W.K. Chan and Bo Jiang. CONE (ACL 2023) by Zhijian Hou, Wanjun Zhong, Lei Ji, Difei Gao, Kun Yan, Wing-Kwong Chan, Chong-Wah Ngo, Zheng Shou, and Nan Duan. Davida (IEEE TRel 2022) by Xiaoxue Ma, Imran Ashraf, and W.K. Chann. Cross-lingual Adaptation for Recipe Retrieval with Mixup (ICMR 2022) by Bin Zhu, Chong-Wah Ngo, Jingjing Chen, and Wing-Kwong Chan. I2I (IEEE TMM 2022) by Bin Zhu, Chong-Wah Ngo, and W.K. Chan CONQUER (MM 2021, oral) by Zhijian Hou, Chong-Wah Ngo, and W.K. Chan Plum (DSA 2021, best paper award) by Hao Zhang and W.K. Chan Orchid (DSA 2021) by Haipeng Wang and W.K. Chan FAR (IEEE Access 2021) by Xiupei Mei, . Imran Ashraf, Xiaoxue Ma, Hao Zhang, Zhengyuan Wei, Haipeng Wang, and W.K. Chan DeepEutaxy (IEEE TRel 2021) by Hao Zhang and W.K. Chan RegionTrack (ACM TOSEM 2021) by Xiaoxue Ma, Shangru Wu, Ernest Pobee, Xiupei Mei, Hao Zhang, Bo Jiang, and W.K. Chan CUDAsmith (COMPSAC 2020) by Bo Jiang, Xiaoyan Wang, W.K. Chan, T. H. Tse, Na Li, Yongfeng Yin, and Zhenyu Zhang. Artemis (DSA 2020) by Anqi Wang, Hao Wang, Bo Jiang, and W.K. Chan EOSFuzzer (Internetware 2020) by Yuhe Huang, Bo Jiang, and W.K. Chan SBFL with Historical Structural Inference (IEEE TRel 2020) by Long Zhang, Zijie Li, Yang Feng, Zhenyu Zhang, W.K. Chan, Jian Zhang, and Yuming Zhou. BlockRace (AST 2020) by Xiupei Mei, Zhengyuan Wei, Hao Zhang, and W.K. Chan GasFuzzer (IEEE Access 2020) by Imran Ashraf, Xiaoxue Ma, Bo Jiang, and W.K. Chan Apricot (ASE 2019) by Hao Zhang and W.K. Chan TPlay (ASE 2019) by Ernest Bota, Xiupei Mei, and W.K. Chan AggrePlay (ESEC/FSE 2019) by Ernest Bota and W.K. Chan Fuzzing Android GUI (IEEE TRel 2019) by Bo Jiang, Yaoyue Zhang, W.K. Chan, and Zhenyu Zhang Fuse (poster) by Xiupei Mei, Imran, Ashraf, Bo Jiang, and W.K. Chan ContractFuzzer (ASE 2018) by Bo Jiang, Ye Liu, and W.K. Chan ConRS (COMPSAC 2018) by B. Zhu, R. Meng, B. Jiang, and W.K. Chan Sifter (IEEE TSC journal paper) by Chunyang Ye, S.C. Cheung, and W.K. Chan His ORCid is https://orcid.org/0000-0001-7726-6235 You can also find his published work at DBLP [Part 1, Part 2] His research projects funded by various schemes can be found on his CityU Scholar page. The following summarizes the grants for ease of reference. Hong Kong Research Grants Council GRF/ECS FAVOR: a testing Framework for detecting Atomicity viOlations in concurrent traces (GRF Project No. 11214116, 844,559, Jan 2017 to Dec 2019, PI) X-LAMP: eXposing Latent Races in LArge-scale Multithreaded Programs (GRF Project No. 11200015, CityU internal 9042171, 695,861, Jan 2016 to Dec 2018, PI). LATTE: an object-based oracLe framework for lineArizabiliTy TEsting (GRF Project No. 11201114, $875,000, Jan 2015 to Dec 2017, PI) C-AGENDA: a Constraint-sensitive Approach to GENeration of Deadlock test schedules for multithreaded Applications (GRF Project No. 111313, $836,450, Jan 2014 to Dec 2016, PI) LOBSTER: Localisation of Performance Bugs in Multithreaded Programs (GRF Project No.125113, $645,500, July 2013 - Jun 2016, Co-I). ASPIRATION: A Software Testing Approach to Deadlock Detection for Large-Scale Multithreaded Applications (ECS Project no. 123512, $688,087+$50,000, Jan 2013 to Dec 2015, PI) CARISMA: A Context-sensitive Approach to Race-Condition Test Case Selection for Multithreaded Software Applications (Project no. 716612, $692,000, Jan 2013 to Dec 2015, Co-I) TASTE: Testing of Adaptive Service-based Software (Project no. 717811, $922,500, Oct 2011 to Sep 2014, Co-I) ACTRESS: A Comprehensive Testing fRamEwork for Service-oriented Software (Project no. 111410, $603,000, Oct 2010-Sep 2013, PI) CACTES: a formal framework for CompositionAl Conformance TEsting of Service compositions (Project No. 717308, $491,906, 1 Sep 2008- 30 Aug 2011, Co-I) Data-centric Testing for Pervasive Middleware-based Programs  (Project No. 111107, $421,300, 1 Jul 2007-31 Dec 2009, PI) Flow: Automatic Fault Localization for Wireless Sensor Network Software Applications: a Statistical Fault Divergence Approach (Project No. 716507, $648,000, 6 Sep 2007- 5 Sep 2010, Co-I) Testing of Pattern-deployed Software (Project No. 123207, $375,329, Jan-2008-Dec 2009, Co-I) Hong Kong ITF Grants (for applied R&D) Ethereum Smart Contract Fuzz Testing Service for Security Vulnerability Detections [Project No. ITS/378/18, $1399,998, 1 Aug 2019 - 31 Jan 2021, PI] Blockchain Enhanced Common Platform for Syndicate Mortgage Transactions (co-I) [Project No. ITS/133/17FX, CityU 9440180, $5,900,000] RFID Benchmarking",
  "content_length": 13058,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:10"
}