{
  "name": "Wing-Kai Hon",
  "homepage": "http://www.cs.nthu.edu.tw/~wkhon",
  "status": "success",
  "content": "Wing-Kai's Homepage Wing-Kai Hon Distinguished Professor Department of Computer Science National Tsing Hua University 101 Kuang Fu Road, Section 2 Hsinchu, Taiwan 300 Email:    wkhon @ cs.nthu.edu.tw Office:   +886 3573-1307 Biography Wing-Kai received his bachelor degree in CS (with first class honors) in 1997 from the University of Hong Kong, and continued his graduate studies there under the supervision of Tak-Wah Lam. He completed his master and doctor degrees in 2000 and 2005, respectively. During his PhD studies, he visited National University of Singapore for one year, under the guidance of Wing-Kin Sung. Prior to joining NTHU, Wing-Kai has visited Purdue University as a post-doc under the supervision of Jeff Vitter. His research interests include indexing, data compression, external memory data structures, and combinatorial optimization. In his leisure time, he enjoys bridge games, Japanese dramas, and detective stories (especially those written by Keigo Higashino). He has also been learning Go for a couple of years. Currently, he is busy with his three kids, Violet, Klaus, and Sunny. Teaching ♠ CS1250 Introduction to Data Structure [2017 2015] ♥ CS2336 Discrete Mathematics [2016 2015 2014 (Fall Spring) 2013] ♦ CS2351 Data Structures [2012 2011 2010] ♣ CS4311 Algorithms [2017 2009 2008] ♠ CS5314 Randomized Algorithms [2018 2015 2014 2013 2012 2011 2010 2009 2008 (Fall Spring) 2007] ♥ CS5319 Advanced Discrete Structures [2016 2015 2013 2012 2011 2010 2009] ♦ CS5371 Theory of Computation [2007 2006] Selected Publications ♠ Inverted Indexes for Phrases and Strings   [pdf] with M. Patil, S.V. Thankachan, R. Shah, J.S. Vitter, and S. Chandrasekaran. In ACM SIGIR, 2011. ♥ Breaking a Time-and-Space Barrier for Constructing Full-Text Indices   [pdf] with K. Sadakane and W.K. Sung. In SIAM Journal on Computing, 2009. ♦ Space-Efficient Framework for Top-k String Retrieval Problems   [pdf] with R. Shah and J.S. Vitter. In IEEE FOCS, 2009. ♣ Geometric Burrows-Wheeler Transform: Linking Range Searching and Text Indexing   [pdf] with Y.F. Chien, R. Shah, and J.S. Vitter. In IEEE DCC, 2008. ♠ A Space and Time Efficient Algorithm for Constructing Compressed Suffix Arrays   [pdf] with T.W. Lam, K. Sadakane, W.K. Sung, and S.M. Yiu. In Algorithmica, 2007. ♥ Compressed Indexes for Dynamic Text Collections   [pdf] with H.L. Chan, T.W. Lam, and K. Sadakane. In ACM Transactions on Algorithms, 2007. My other publications can be found in my CV, DBLP or at Google Scholar. Last updated: October 10, 2025",
  "content_length": 2530,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:11"
}