{
  "name": "Wing Lam",
  "homepage": "https://cs.gmu.edu/~winglam",
  "status": "success",
  "content": "Wing Lam's Home Page Home Publications Work Experience Awards&Grants Teaching Lab Home Twitter LinkedIn I am an Assistant Professor at George Mason University. My research interests are in Software Engineering, with a focus on Software Testing and Analysis, AI and Software Engineering, Software Evolution, and Software Dependability. Recent topics include detecting and fixing flaky tests, generating test inputs, testing mobile apps, optimizing continuous integration/deployment, and improving software engineering education. I obtained a PhD from the Department of Computer Science at the University of Illinois at Urbana-Champaign and a Bachelor's in Computer Science with Distinction from the Department of Computer Science & Engineering at the University of Washington. Google Scholar CV Email: winglam@gmu.edu Office: Nguyen Engineering Building Room 4442 I am looking for self-motivated students with a strong academic background in Software Engineering, Machine Learning, or Programming Languages. Please apply to GMU CS and send me your CV as a link. More information can be found here (Chinese version available here). News Delighted to be funded by the NSF for our work on CAREER: Enhanced Reliability and Efficiency of Software Regression Testing in the Presence of Flaky Tests! See [GMU News] for more information. I am honored to have been recently selected to receive the 2024 GMU Computer Science Outstanding Research Rising Star Award! Delighted to be funded by the NSF for our work on Collaborative Research: CCRI: Planning-C: An Infrastructure and Dataset for Research in Android Testing & Analysis! Delighted to find out that I have been selected to be the recipient of this year’s ACM SIGSOFT Outstanding Doctoral Dissertation Award for my dissertation on Detecting, Characterizing, And Taming Flaky Tests! See [GMU News], [SIGSOFT blog], [Weixin post] for more information. Recent & Selected Publications “Ranking Relevant Tests for Order-Dependent Flaky Tests” by Shanto Rahman, Bala Naren Chanumolu, Suzzana Rafi, August Shi, and Wing Lam. In ICSE 2025, Proceedings of the 50th International Conference on Software Engineering, (Ottawa, Ontario, Canada), 2025. Download: PDF. “Takuan: Using Dynamic Invariants To Debug Order-Dependent Flaky Tests” by Nate Levin, Chengpeng Li, Yule Zhang, August Shi, and Wing Lam. In ICSE 2025, Proceedings of the 50th International Conference on Software Engineering, New Ideas and Emerging Results (NIER) track, (Ottawa, Ontario, Canada), 2025. “OptCD: Optimizing Continuous Development” by Talank Baral, Emirhan Oğul, Shanto Rahman, August Shi, and Wing Lam. In ICSE 2025, Proceedings of the 50th International Conference on Software Engineering, Demonstrations track, (Ottawa, Ontario, Canada), 2025. “Can You Mimic Me? Exploring the Use of Android Record & Replay Tools in Debugging” by Zihe Song, S M Hasan Mansur, Ravishka Rathnasuriya, Yumna Fatima, Wei Yang, Kevin Moran, and Wing Lam. In MOBILESoft 2025, Proceedings of 12th International Conference on Mobile Software Engineering and Systems, (Ottawa, Ontario, Canada), 2025. “Optimizing Continuous Development By Detecting and Preventing Unnecessary Content Generation” by Talank Baral, Shanto Rahman, Bala Naren Chanumolu, Basak Balci, Tuna Tuncer, August Shi, and Wing Lam. In ASE 2023, Proceedings of the 38th Annual International Conference on Automated Software Engineering, (Kirchberg, Luxembourg), 2023. Download: PDF, Google slides. “Systematically Producing Test-Orders to Detect Order-Dependent Flaky Tests” by Chengpeng Li, Mahdi Khosravi, Wing Lam, and August Shi. In ISSTA 2023, Proceedings of the 2023 International Symposium on Software Testing and Analysis, (Seattle, WA, USA), 2023. Download: PDF, PowerPoint slides. Recent Service Organizing Committee Co-Chair International Flaky Tests Workshop (FTW) 2025 Program Committee Co-Chair ASE 2024 Journal-First Track Program Committee Co-Chair FSE 2024 Doctoral Symposium Program Committee Co-Chair MOBILESoft 2024 Research Track Program Committee Member ICSE 2025 Research Track Program Committee Member MOBILESoft 2025 Research Track Program Committee Member FSE 2024 Research Track Program Committee Member ISSTA 2024 Research Track Program Committee Member ICST 2024 Research Track Last updated on January 15th, 2025.",
  "content_length": 4306,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:11"
}