{
  "name": "Winston Khoon Guan Seah",
  "homepage": "http://homepages.ecs.vuw.ac.nz/~winston",
  "status": "success",
  "content": "Winston SEAH Last updated: 10 August 2023 SEAH, Khoon Guan Winston (Dr.Eng.) School of Engineering and Computer Science Victoria University of Wellington P.O. Box 600 Wellington 6140 New Zealand Contact: +64 4 463 5233 ext 8493 (Office) +64 4 463 5045 (Fax) Homepage at ECS Winston.Seah (at) ecs.vuw.ac.nz CV(pdf) Current Positions Education Awards, Fellowships & Scholarships Research (Research topics for new graduate students can be found here.) Selected Publications Keynotes, Invited Presentations, Tutorials & Seminars Technical, Professional & Standardization Activities Key Senior/Technical Management Roles Academic Activities & Manpower Training Research Grants Patents ANNOUNCEMENTS Open Calls (Events/special issues of interest to networking researchers): For students: Research topics for students who wish to pursue postgraduate studies under my supervision can be found here -- please read the details carefully and contact me to discuss. Top international students considering PhD studies in the School of Engineering and Computer Science (ECS) in Victoria University of Wellington can refer to VUW PhD Study website for details on the application process. If you are interested in my research areas and would like to work with me, you can indicate that in your application form. See here for details. CURRENT POSITION & PROFESSIONAL MEMBERSHIP Professor of Network Engineering, School of Engineering and Computer Science, Victoria University of Wellington, New Zealand Senior Member, ACM EDUCATION Dr.Eng. in Applied Systems Science, Kyoto University, Kyoto, Japan, 1997. M.Eng. in Electrical Engineering, National University of Singapore, 1993. B.Sc. in Computer and Information Sciences, National University of Singapore, 1987. AWARDS / FELLOWSHIPS / SCHOLARSHIPS 2024 Information Society Innovation Fund (ISIF) Asia Award for Outstanding Research in Digital Development James Cook Research Fellowship, for research on quantum networking protocols and algorithms, Royal Society of New Zealand, 2022. Best Paper Award, 42nd IEEE Conference on Local Computer Networks (LCN), Singapore, October 9-11, 2017. Best Paper Award, 45th Hawaii International Conference on System Sciences (HICSS), Maui, HI, USA, January 4-7, 2012. JSPS Invitation Fellowship Program for Research in Japan, 2011, Kyoto University, Kyoto, Japan. Highly Commended Paper Award, IEEE 22nd International Conference on Advanced Information Networking and Applications (AINA2008), March 25-28, 2008, GinoWan, Okinawa, Japan. Visiting research professor under 21st Century Center of Excellence Program of Japan, March 16-29, 2003, Graduate School of Informatics, Kyoto University, Kyoto, Japan. Monbusho Postgraduate Scholarship awarded by the Government of Japan, 1992-1995. Postgraduate Research Scholarship, Foundation for C&C Promotion (NEC funded), 1996. Postgraduate Research Scholarship, International Communication Foundation (KDD funded), 1996. RESEARCH Today's Internet needs to support untethered communications, mobility, quality of service, sensing and actuation, user-programmability and, most importantly, sustainability through the use of renewable energy. My research aims to meet those needs from the networking protocols perspective, under the following broad areas: 5G/6G Internet of Things (IoT)Today's Internet plays a critical role in 5G and future generation networks, connecting not just computer systems but a plethora of systems, devices, and objects,  collectively referred to as \"Things\", and encompasses technologies for identiﬁcation and tracking, sensing and actuation, both wired and wireless communications, and also, intelligence and cognition. We envisage the current Internet to be extended by the IoT devices, as shown in the following figure: From the core to the IoT gateways, existing network technologies are used with extensions to support new traffic from the IoT. However, the IoT fabric requires new communications and networking technologies, as much as a total re-design of the networking architecture, including following research areas (by no means comprehensive) which are of interest to me: Resource management and network anomaly detection in 5G networks - 3GPP defines three classes of traffic types to be supported in 5G networks, viz. Ultra Reliable and Low Latency Communications (URLLC), enhanced Mobile Broadband (eMBB) and massive Machine Type Communications (eMTC). To meet the requirements of 5G networks, new novel resource management algorithms need to be developed taking into consideration both communication as well as computation resources from the edge to the core networks. Another key characteristic of 5G networks in the virtualization of network functions or NFV. This research theme looks into resource management in mobile edge computing to support 5G network requirements. Due to the introduction of new types of network devices and corresponding traffic types, there is a critical need to detect and handle anomalous traffic types that are constantly introduced into the networks. We adopt machine learning techniques and extend them with the capability to learn on-the-fly in order to respond to new threats promptly. Content and Data Driven Networking (CD2N) aims to route/send packets based on the content rather than the destination address. This is a variant of Named Data Networking and Content Centric Networking, but aims to re-design the entire routing fabric specifically for IoT devices. Wireless Sensor Networks Powered by Ambient Energy Harvesting (WSN-HEAP) Wireless sensor networks (WSNs) are set to form a signiﬁcant part of the IoT. WSNs have traditionally been powered by limited energy sources, viz. batteries, limiting their operational lifetime. To ensure the sustainability of WSNs, researchers have turned to alternative energy sources for power. Harvesting ambient energy from the environment to power WSNs is a promising approach but energy harvesting devices of the same footprint as wireless sensors are unable to provide sufficient energy for sustained operation. More likely, the energy harvested over a period is only enough for a sensor to sense and transmit a few packets. With such a constraint, relaying data over multiple wireless links to remote data acquisition systems is a daunting challenge. My research interests lie in designing coverage algorithms for rare events sensing and reliable data delivery protocols for networks and systems powered by energy harvesting, e.g. Multi-Tier Probabilistic Polling, sink-synchronized polling, event-driven MAC, etc. Earlier, we did studies on how energy harvesting affects the performance of WSN MAC protocols, as well as the impact of power control in such energy-harvesting powered WSNs. Opportunistic routing has also proven to be useful in WSNs powered by energy harvesting by exploiting the broadcast characteristic of wireless media. Applications for such technology include long-term in-situ integrity monitoring of critical infrastructures and buildings using event-powered sensors, natural resources and environmental monitoring, sensing for agricultural applications, etc. Nano-scale Networks (NanoNets) Electromagnetic-based Wireless Nano Sensor Networks (EM-WNSNs) operating in the Terahertz band (0.1~10 THz) form the basis of nano-scale applications and expand the scope of the Internet of Things (IoT) to the Internet of Nano Things (IoNT). EM-WNSNs face two major performance constraints arising from (i) the frequency-selective channel in the THz band due to molecular absorption and (ii) the limited ability to support networking functions due to their small size. To date, limited research on data delivery has been done to address the peculiarities of EM-WNSNs from the networking perspective. Our research aims to develop the efficient data delivery mechanism for EM-WNSNs that also account for the backhaul bandwidth capacity from the IoT, e.g. Adaptive Pulse Scheduling (APIS) as well as efficient on-demand polling and forwarding (cf: Selection Publications below.) Exploiting Radio Irregularity for Detection, Monitoring and Tracking (ERI-DMT) Wireless communications, which is an integral part of IoT, suffers from radio irregularity  a phenomenon referring to radio waves being selectively absorbed, reﬂected or scattered by objects in their paths, e.g., human bodies that comprises liquid, bone and ﬂesh. Radio irregularity is often regarded as a problem in wireless communications but, with the envisioned pervasiveness of IoT, we aim to exploit radio irregularity as a means to detect the presence of people, animals and other objects. Applications for this technology, include motion/intrusion detection for security and surveillance, automated people counting, wildlife detection and tracking for determining absolute abundance or pest control, vehicular traffic monitoring, etc. Wireless Communication Networks in Extreme EnvironmentsThe use of wireless communications is swiftly extending beyond networks for the average person to networks for embedded devices, sensors and autonomous systems, as well as networks for personnel in extreme environmentsunderground, underwater and in disaster situations. Robust End-to-End Data Delivery Algorithms for Harsh Environments (REDDAH) A typical harsh environment is one where there is an abundance of metallic structures, e.g. steel supporting beams, which can adversely affect RF signal propagation. In this work, we conduct extensive field tests to study the effects of radio propagation on the performance of wireless ad hoc routing protocols. After understanding the characteristics of the environment, we then design protocols for the delivery of telemetry data from sensors affixed to critical supporting structures. Such data need to be transmitted to the data acquisition system in realtime and error free. If any of the sensors detect excessive stress, qualified personnel must be notified immediately to investigate. Other supplementary traffic include video streaming ",
  "content_length": 43961,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:18"
}