{
  "name": "Wojciech Matusik",
  "homepage": "http://people.csail.mit.edu/wojciech",
  "status": "success",
  "content": "Wojciech Matusik | The Computational Design & Fabrication Group Homepage Team Research Publications Courses News Contact Wojciech Matusik Cadence Design Systems Professor Department of Electrical Engineering and Computer Science Biography Research Interests Research Highlights Publications Teaching Current Group Join the Group Contact Biography Wojciech Matusik is the Cadence Design Systems Professor of Electrical Engineering and Computer Science at the Computer Science and Artificial Intelligence Laboratory at MIT, where he leads the Computational Design and Fabrication Group and is a member of the Computer Graphics Group. Before coming to MIT, he worked at Mitsubishi Electric Research Laboratories, Adobe Systems, and Disney Research Zurich. He studied computer graphics at MIT and received his PhD in 2003. He also received a BS in EECS from the University of California at Berkeley in 1997 and MS in EECS from MIT in 2001. His research interests are in computer graphics, computational design and fabrication, computer vision, robotics, and hci. In 2004, he was named one of the world’s top 100 young innovators by MIT’s Technology Review Magazine. In 2009, he received the Significant New Researcher Award from ACM Siggraph. In 2012, Matusik received the DARPA Young Faculty Award and he was named a Sloan Research Fellow. In 2014, he received Ruth and Joel Spira Award for Excellence in Teaching. Research Interests Computer Graphics: data-driven methods, physics-based simulation, appearance modeling, computational displays Computional Design and Fabrication: additive manufacturing, textile manufacturing/functional fibers, design/simulation tools, inverse problems, topology optimization Computer Vision: inverse problems, data-driven methods, gaze models, computational photography, multi-modal learning Robotics: computational design/simulation for robotics, soft robotics, tactile sensing/modeling, UAVs Human-Computer Interaction: design tools for fabrication, crowdsourcing Research Highlights MIT News CSAIL Joining the Group We are always looking for talented researchers to join our group. If you would like to apply for a postdoctoral position then send me an email. If you would like to work with me during your PhD, apply directly to the MIT EECS PhD program and indicate my name as a potential advisor. If you are an MIT undergraduate, send me (or other group members) a short note. Publications also Google Scholar Current Group Members & Alumni Teaching 6.01: Introduction to EECS I - Spring 2011, Spring 2012 6.036: Machine Learning (undergraduate) - Spring 2017, Spring 2019, Spring 2020, Spring 2021 6.807: Computational Fabrication (undergraduate) - Spring 2014, Spring 2015, Spring 2016, Fall 2018, Fall 2019 6.837: Computer Graphics - Fall 2011, Fall 2012, Fall 2013, Fall 2015, Fall 2016 6.838: Computational Fabrication (graduate) - Spring 2013 6.839: Advanced Computer Graphics (graduate) - Fall 2018, Fall 2019 Computational Design for Manufacturing: Creating a Pipeline for the Future of Production (professional education) - Summer 2018, 2019, 2020 Contact The Stata Center, Building 32-333 32 Vassar Street Cambridge, MA 02139 Email: wojciech@mit.edu Phone: 617-324-8432 Fax: 617-253-4640 Facebook YouTube Share this page Facebook Twitter LinkedIn Email Homepage Team Research Publications Courses News Contact",
  "content_length": 3356,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:20"
}