{
  "name": "Wolfram Hardt",
  "homepage": "https://www.tu-chemnitz.de/informatik/ce/professur/professor.php",
  "status": "success",
  "content": "Inhaber | Professur | Technische Informatik | Fakultät für Informatik | TU Chemnitz Inhaber | Professur | Technische Informatik | Fakultät für Informatik | TU Chemnitz Technische Informatik Inhaber Prof. Dr. Dr. h. c. Wolfram Hardt Email: hardt@cs.tu-chemnitz.de Telefon: +49 371 531-25550 Adresse: Technische Universität Chemnitz Fakultät für Informatik Professur Technische Informatik Straße der Nationen 62 D-09111 Chemnitz Raum: 1/016a Sprechzeiten: Nach Ankündigung Lebenslauf 09. Mai 1965 Geboren in Soest 1991 Informatik Diplom der Universität Paderborn 1996 Promotion zum Dr.-rer. nat. in Informatik an der Universität Paderborn 2000 Habilitation zum Thema: Integration von Verzögerungszeit-Invarianz in den Entwurf eingebetteter Systeme 2000-2002 Leiter des Informatik- und Prozesslabors der Universität Paderborn 2002-2003 Dozentur an der Professur Betriebssysteme des Fachbereichs Elektrotechnik / Informatik an der Universität Kassel seit 2003 Inhaber der Professur Technische Informatik an der Technischen Universität Chemnitz seit 2006 Direktor des Universitätsrechenzentrums der Technischen Universität Chemnitz 2006 - 2013 Dekan der Fakultät für Informatik 2013 - 2016 Prodekan der Fakultät für Informatik 2016 - 2019 Dekan der Fakultät für Informatik 2019 Doctor honoris causa der Novosibirsk State Technical University (NSTU), Novosibirsk TUCaktuell Spannende Vorweihnachtszeit mit Chemie, Mathe, Physik und Informatik Mit allen Sinnen genießen: TU Chemnitz lädt am 3., 17., 18. und 19. Dezember 2025 zu insgesamt fünf Weihnachtsvorlesungen ein … Exzellente Leistungen im Rampenlicht TU Chemnitz vergab am 27. November 2025 mehrere Preise und würdigte damit herausragende Leistungen ihrer Mitglieder und Angehörigen in den Bereichen Studium, Lehre, Forschung und Transfer sowie im gesellschaftlichen Engagement … TU Chemnitz präsentiert sich als attraktiver außerschulischer Lernort Neu saniertes Kreativzentrum der Universität präsentiert gemeinsam mit den naturwissenschaftlichen und technischen Fakultäten der TU Chemnitz ein breites Portfolio an Lernangeboten für Schülerinnen und Schüler … Doktorandinnen- und Doktorandenvertretung der TU Chemnitz hat ihre Arbeit aufgenommen Mina Raeisi, Tom Hunger und Anna Ulrich bilden Interessenvertretung, welche an der TU Chemnitz die Vernetzung der Doktorandinnen und Doktoranden untereinander weiter stärken möchte … Mehr Artikel anzeigen Alle Artikel anzeigen Veranstaltungen & Tipps Naturwissenschaften 01.12.2025 01 Dez Von Unordnung zur Topologie: Innovationen im Verständnis komplexer Spinsysteme Dieser Workshop wird im Rahmen des SPARC-GIANT-Projekts „Effekte starker … TU Chemnitz 03.12.2025 03 Dez TUCweihnachtsmarkt Stimmen Sie sich mit uns bei einem weihnachtlichen Programm für Groß und Klein auf die Advents- und … TU Chemnitz 10.12.2025 10 Dez Kinderweihnachtsfeier Am 10.12.2025 erwartet alle Kids der Technischen Universität Chemnitz und des Studentenwerks … Naturwissenschaften 10.12.2025 10 Dez TUC erklärt Nobelpreise Im Rahmen dieser Veranstaltung werden die diesjährigen Nobelpreise in Physik und Chemie für die … Mathematik 17.12.2025 17 Dez Weihnachtsvorlesung Mathematik \"Weihnachtliche Strömungen : wenn Mathematik ins … Wie lassen sich beispielsweise winterliche Luftströmungen in der … Naturwissenschaften 18.12.2025 18 Dez Weihnachtsvorlesung der Physik: \"Alles fließt - πάντα ῥεῖ -\" Weihnachtsvorlesung, in der physikalische Sachverhalte mit Hilfe vieler … Veranstaltungskalender Veranstaltungskalender Mehr Artikel anzeigen Alle Artikel anzeigen Soziale Medien 🏆 Die TU Chemnitz ehrte am 27. November herausragende Leistungen ihrer Mitglieder: 28 Preise in den Kategorien Studium, Lehre, Forschung, Transfer und Engagement, die jeweils mit… 💡 Beim 12. Tag des wissenschaftlichen Nachwuchses an der #TUChemnitz kamen zahlreiche Nachwuchsforschende, Promovierende, Promovierte und Interessierte zusammen, um spannende… ♟️ Erfolgreich auf ganzer Linie: Das Team der Fakultät für Mathematik der #TUChemnitz hat beim Firmenschachturnier 2025 erneut den 🥇 1. Platz belegt! Beim von der axilaris GmbH… 🕯️ Die TU Chemnitz setzt am 9. November 2025 einen „Lichtpunkt“ gegen das Vergessen und beteiligt sich an der stadtweiten Gedenkaktion an die Opfer der Reichspogromnacht. Im… Verbinde dich mit uns: Vorschaltseite",
  "content_length": 4302,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:35"
}