{
  "name": "Wolfgang Prinz",
  "homepage": "https://dbis.rwth-aachen.de/dbis/index.php/user/prinz",
  "status": "success",
  "content": "Prof. Wolfgang Prinz | DBIS DBIS Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in Categories Pages - - Courses i5 Jobs Labs Lectures News Projects Research Fields RFC Seminars Theses Uncategorized Working Groups - Home Information Systems & Databases News Projects Staff Job Offers Academics Courses Thesis Projects Research Publications Resources Log in DBIS Prof. Wolfgang Prinz This user account status is Approved This user has not added any information to their profile yet.Contact Information:AddressLehrstuhl Informatik 5 Building: E2 Room: 6212 Ahornstraße 55 52074 Aachen Phone Number+49 2241 14 3111E-mail Addresswolfgang.prinz@fit.fraunhofer.deLinkedInhereShort BioI studied Computer Science in Bonn and received my PhD from the University of Nottingham. My primary occupation is at the Fraunhofer FIT in Sankt Augustin. At FIT I'm leading the cooperations system department that investigates innovative cooperation technologies, mixed reality, 5G as well as Blockchain and Web3 Technologies. Furthermore I'm the deputy chair of the institute. My teaching courses include lectures, labs and seminars on cooperation technologies, blockchain and Web3. If you are intersted in a bachelor, master thesis or HiWi job in the blockchain area, please do not hesitate to contact me. Further information about my activites in FIT can be found here. Research interests: Cooperative Software Systems, CSCW, Groupware, CommunityWare, Social Computing, Enterprise 2.0, Web 2.0, Cooperative Knowledge Management, Pervasive Games, Blockchain Technologies and Applications, Web3Current Teaching:Empathic Computing Lab (WS 2025)Theses:Design Patterns for TEAMS: Tailoring Engagement and Alignment for MLOps Stakeholders (Running)Investigation and Development of Solutions for Verifiable Credential Verification using Decentralized Oracle Networks (Running)Implementation and Evaluation of Programmable Money Using Verifiable Credentials and Zero Knowledge Proofs (Running)LLM-Powered Virtual Reality Agents as Technical Support (Finished)A Mixed Reality Agent as a Navigation Guide (Finished) Entries Comments SearchSearch Quick Links News Staff Job Offers Thesis Projects Resources Featured Videos How to find us ContactProf. Dr. S. DeckerRWTH Aachen UniversityLehrstuhl Informatik 5Ahornstr. 5552074 AachenTel +49/241/80-21509Fax +49/241/80-22321 Recent News Inaugural Meeting of the JUPITER AI Factory (JAIF) Call for Papers: Semantics in Dataspaces (SDS25) @ESWC 2025 Best Academic Reviewer Award at the iLRN 2024 Call for Papers: LLMs4MI2024 Workshop in Dubai Nachruf auf Prof. Dr. rer.pol. Matthias Jarke Recent Publications Loading publications top RWTH Main Page Faculty of Mathematics, Computer Science and Natural Sciences Department of Computer Science Knowledge-Based Systems Group Fraunhofer FIT",
  "content_length": 2893,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:32"
}