{
  "name": "Wolfgang Karl",
  "homepage": "http://capp.itec.kit.edu/~karl/?lang=d",
  "status": "success",
  "content": "KIT - ITEC - CAPP - Mitarbeiter Forschungsgruppe für Rechnerarchitektur und Parallelverarbeitung StartseiteMitarbeiter StartseiteStudium und LehreForschung und ProjekteMitarbeiterJobs und AbschlussarbeitenPublikationenKontaktInternesMitarbeiter Prof. Dr. Wolfgang Karl Raum: B2-315.1Tel.: +49 721 608-43771Fax: +49 721 608-43962wolfgang karl ∂does-not-exist.kit edu Karlsruher Institut für Technologie (KIT) Institut für Technische Informatik (ITEC) Forschungsgruppe für Rechnerarchitektur und Parallelverarbeitung (CAPP) Haid-und-Neu-Str. 7 (Technologiefabrik) 76131 Karlsruhe Prof. Dr. Wolfgang Karl wurde 2003 an das Karlsruher Institut für Technologie (KIT), vormals Universität Karlsruhe (TH), Fakultät für Informatik berufen. Er studierte Informatik mit Nebenfach Mathematik an der Friedrich-Alexander-Universität Erlangen-Nürnberg. Von 1987 - 2003 war er wissenschaftlicher Mitarbeiter am Lehrstuhl  für Rechnertechnik und Rechnerorganisation (Prof. Dr. Arndt Bode) der Technischen Universität München. Er promovierte 1992 und habilitierte 2002 an der Fakultät für Informatik der Technischen Universität München. Sein Forschungsschwerpunkt liegt auf dem Gebiet der Rechnerarchitektur, insbesondere auf heterogenen parallelen Rechnerarchitekturen und deren effiziente Nutzung, adaptiven und selbst-organisierenden Systemen, Approximate Computing. Berufliche Aktivitäten Karlsruher Institut für Technologie (KIT) Leiter der Forschungsgruppe Rechnerarchitektur und Parallelverarbeitung Mitglied im HiPEAC Network of Excellence Gesellschaft für Informatik e.V. (GI) Mitglied (since 1982) Mitglied im erweiterten Vorstand der GI (2010 - 2013 und seit 2020) Mitglied des Präsidiums der GI (2010 - 2015 und seit 2020) Sprecher des Leitungsgremiums des FB Technische Informatik Mitglied im Leitungsgremiums des GI/ITG Fachausschusses Architektur von Rechensystemen (ARCS) Sprecher des Leitungsgremiums der GI/ITG Fachgruppe Parallel-Algorithmen, -Rechnerstrukturen und Systemsoftware PARS Informationstechnische Gesellschaft VDE ITG Sprecher des Fachbereichs Technische Informatik Vorsitzender der Konrad-Zuse-Gesellschaft e.V.",
  "content_length": 2126,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:27"
}