{
  "name": "Wolfgang Slany",
  "homepage": "http://www.ist.tugraz.at/wolfgang_slany.html",
  "status": "success",
  "content": "IST web - Wolfgang_Slany Univ.-Prof. Dipl.-Ing. Dr.techn. Wolfgang Slany Head of the Institute of Software Technology Phone: +43-316-873-5721 Fax: +43-316-873-5706 Email: wolfgang.slany@tugraz.at Room: IC02086   ( map) Address: Institut für Softwaretechnologie Inffeldgasse 16b/II TU Graz A-8010 Graz Austria ( getting here) Visiting hour: By appointment via mailto:wolfgang.slany@tugraz.at Courses and teaching: TUG-Online list of my courses Our institute's Teaching page DE: Themen für Seminararbeiten, Praktika, Bakkalaureatsarbeiten, Magisterarbeiten, Diplomarbeiten und Dissertationen EN: Topics for term papers, internships, bachelor theses, master theses, diploma theses and dissertations Other teaching related stuff Publications: Google Scholar, dblp computer science bibliography, researchgate.net TUG-Online: TUG-Online Visitenkarte Research interests: Theory and applications of algorithms for combinatorial and industrial optimization problems (personnel planning, scheduling) Web- and mobile-based cooperative intelligent information systems and tools (information retrieval, social software, audio and video services) Game theory and applications (Ramsey theory, algorithms for the iterated prisoner's dilemma, flow-inducing computer games with educational side effects, game programming by children) Applied software technology (agile software development methods with a focus on extreme programming and usability engineering) Last Change: 18 Mar 2018, 09:40:35You are here: Home > People list > Wolfgang Slany          Backoffice (requires login)          Copyright © 2002 - 2019 IST, TU Graz  |  Webmaster  |  Impressum Institute of Software Technology Homepage Faculty of Computer Science and Biomedical Engineering Graz University of Technology     » news... Graz/Austria People Publications Projects Teaching Intranet Email Contact us Getting here",
  "content_length": 1868,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:33"
}