{
  "name": "Wolfgang Pree",
  "homepage": "http://www.softwareresearch.net/home",
  "status": "success",
  "content": "Home - Software Research Center Skip to main content Summer School 2003 Gebäude Awards PreviousNextI hope you will find our Web site a useful gateway to information on our research activities which try to advance the state-of-the-art in software construction. Currently, we focus on the domain of cyber-physical systems, in particular those related to autonomous vehicles and energy.© Sela Krobath The best way to predict the future is to invent it. Alan Kay while at Xerox' Palo Alto Research Center (PARC) in the 1970s Those who can – do. Those who can’t – teach. Martin’s Extension: Those who cannot teach – administrate. H. L. Mencken’s Law A year spent in artificial intelligence is enough to make one believe in God. Research is what I’m doing when I don’t know what I’m doing. Wernher von Braun There is only one thing in the world worse than being talked about, and that is not being talked about. Oscar Wilde If you have a procedure with 10 parameters, you probably missed some. Enough research will tend to support your theory. Murphy’s Law of Research People usually get what’s coming to them...unless it’s been mailed. Consultants are mystical people who ask a company for a number and then give it back to them. Enough research will tend to support your theory. Murphy’s Law of Research People usually get what’s coming to them...unless it’s been mailed. Consultants are mystical people who ask a company for a number and then give it back to them. If you can count your money, you don’t have a billion dollars. J. Paul Getty The cost of living hasn’t affected its popularity. Anything free is worth what you pay for it. Any small object that is accidentally dropped will hide under a larger object. The average woman would rather have beauty than brains, because the average man can see better than he can think. Oh don’t the days seem lank and long when all goes right and none goes wrong, and isn’t your life extremely flat with nothing whatever to grumble at! If you can’t learn to do it well, learn to enjoy doing it badly. There cannot be a crisis next week. My schedule is already full. Henry Kissinger I really hate this damned machine, I wish that they would sell it. It never does quite what I want, but only what I tell it. Politician: From the Greek “poly” (“many”) and the French “tete” (“head” or “face”, as in “tete-a-tete”: head to head or face to face). Hence “politetien”, a person of two or more faces. Martin Pitt An unbreakable toy is useful for breaking other toys. Van Roy’s Law My opinions may have changed, but not the fact that I am right. The Roman Rule: The one who says it cannot be done should never interrupt the one who is doing it. “Contrariwise,” continued Tweedledee, “if it was so, it might be, and if it were so, it would be; but as it isn’t, it ain’t. That’s logic!” Lewis Carroll Psychiatrists say that one out of four people are mentally ill. Check three friends. If they’re ok, you’re it. Technology is dominated by two types of people: Those who understand what they do not manage. Those who manage what they do not understand. Putt’s Law Any simple problem can be made insolvable if enough meetings are held to discuss it. Mitchell’s Law of Committees Any simple problem can be made insolvable if enough meetings are held to discuss it. Mitchell’s Law of Committees Just because your doctor has a name for your condition doesn’t mean he knows what it is. Just because your doctor has a name for your condition doesn’t mean he knows what it is. Those who can, do. Those who can’t, simulate. If someone had told me I would be Pope one day, I would have studied harder. Pope John Paul I History doesn’t repeat itself---historians merely repeat each other. First Rule of History You cannot achieve the impossible without attempting the absurd. Washing your car to make it rain doesn’t work. Murphy’s Law is recursive. Adding manpower to a late software project makes it later. Brook’s Law Acting is an art which consists of keeping the audience from coughing. Computers are not intelligent. They only think they are. Lie: A very poor substitute for the truth, but the only one discovered to date. The past always looks better than it was. It’s only pleasant because it isn’t here. Finley Peter Dunne (Mr. Dooley) If the odds are a million to one against something occurring, chances are 50-50 it will. Measure with a micrometer. Mark with chalk. Cut with an axe. Ray’s Rule of Precision The first myth of management is that it exists. Heller’s Law Nobody really knows what is going on anywhere within the organization. Johnson’s Corollary If I travelled to the end of the rainbow as Dame Fortune did intend, Murphy would be there to tell me the pot’s at the other end. Bert Whitney A banker is a fellow who lends you his umbrella when the sun is shining and wants it back the minute it begins to rain. Mark Twain If there are two possible ways to spell a person’s name, you will pick the wrong one. Second Law of Business Meetings Major Premise: Sixty men can do a piece of work sixty times as quickly as one man. Minor Premise: One man can dig a posthole in sixty seconds.Conclusion: Sixty men can dig a posthole in one second. Corollary: If there is only one way to spell a name, you will spell it wrong, anyway. I can resist anything but temptation. Brain: The apparatus with which we think that we think. No man’s life, liberty, or property are safe while the legislature is in session. Jacquin’s Postulate on Democratic Government $100 invested at 7% interest for 100 years will become $100,000, at which time it will be worth absolutely nothing. Please take note: You have the capacity to learn from mistakes. You’ll learn a lot today. San Francisco isn’t what it used to be, and it never was. Any simple idea will be worded in the most complicated way. Malek’s Law There are two ways to write error-free programs. Only the third one works. I like work...I can sit and watch it for hours. First Law of Socio-Genetics: Celibacy is not hereditary. Alone: In bad company. The goal of Computer Science is to build something that will last at least until we’ve finished building it. It is easier to write an incorrect program than to understand a correct one. If enough data is collected, anything may be proven by statistical methods. Williams and Holland’s Law “That must be wonderful! I don’t understand it at all.” The first bug to hit a clean windshield lands directly in front of your eyes. Drew’s Law of Highway Biology When someone says “I want a programming language in which I need only say what I wish done,” give him lollipop. A classic is something that everybody wants to have read and nobody wants to read. Mark Twain “He was so narrow-minded he could see through a keyhole with both eyes...” Genius may have its limitations, but stupidity is not thus handicapped. Elbert Hubbard The probability of someone watching you is proportional to the stupidity of your action. A diplomat is someone who can tell you to go to hell in such a way that you will look forward to the trip. 43rd Law of Computing: Anything that can go wr fortune: Segmentation violation---core dumped The best way to predict the future is to invent it. Those who can – do. Those who can’t – teach. Martin’s Extension: Those who cannot teach – administrate. A year spent in artificial intelligence is enough to make one believe in God. Research is what I’m doing when I don’t know what I’m doing. There is only one thing in the world worse than being talked about, and that is not being talked about. If you have a procedure with 10 parameters, you probably missed some. Enough research will tend to support your theory. People usually get what’s coming to them...unless it’s been mailed. Consultants are mystical people who ask a company for a number and then give it back to them. Enough research will tend to support your theory. People usually get what’s coming to them...unless it’s been mailed. Consultants are mystical people who ask a company for a number and then give it back to them. If you can count your money, you don’t have a billion dollars. The cost of living hasn’t affected its popularity. Anything free is worth what you pay for it. Any small object that is accidentally dropped will hide under a larger object. The average woman would rather have beauty than brains, because the average man can see better than he can think. Oh don’t the days seem lank and long when all goes right and none goes wrong, and isn’t your life extremely flat with nothing whatever to grumble at! If you can’t learn to do it well, learn to enjoy doing it badly. There cannot be a crisis next week. My schedule is already full. I really hate this damned machine, I wish that they would sell it. It never does quite what I want, but only what I tell it. Politician: From the Greek “poly” (“many”) and the French “tete” (“head” or “face”, as in “tete-a-tete”: head to head or face to face). Hence “politetien”, a person of two or more faces. An unbreakable toy is useful for breaking other toys. My opinions may have changed, but not the fact that I am right. The Roman Rule: The one who says it cannot be done should never interrupt the one who is doing it. “Contrariwise,” continued Tweedledee, “if it was so, it might be, and if it were so, it would be; but as it isn’t, it ain’t. That’s logic!” Psychiatrists say that one out of four people are mentally ill. Check three friends. If they’re ok, you’re it. Technology is dominated by two types of people: Those who understand what they do not manage. Those who manage what they do not understand. Any simple problem can be made insolvable if enough meetings are held to discuss it. Any simple problem can be made insolvable if enough meetings are held to discuss it. Just because your doctor has a name for your condition doesn’t mean he knows what it is. Just because your doctor has a name for your condition doesn’t mean he knows what it is. Those who can, do. Those who can’t, simulate. If someone had told me I ",
  "content_length": 14854,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:33"
}