{
  "name": "Wolfram Wingerath",
  "homepage": "https://uol.de/wolle",
  "status": "success",
  "content": "Wolfram Wingerath // Universität Oldenburg Fk. II Department für Informatik Data Science Wolfram Wingerath Leitung Prof. Dr. Wolfram Wingerath wolle@uol.de Sekretariat Claudia Martsfeld claudia.martsfeld@uol.de Anschrift Arbeitsgruppe Data Science Universität Oldenburg Fakultät II – Department für Informatik Escherweg 2, 26121 Oldenburg, Germany data-science@uol.de Wolfram Wingerath Department für Informatik  (» Postanschrift) Carl von Ossietzky Universität Oldenburg Ammerländer Heerstraße 114-118 26129 Oldenburg online (» Adresse und Lageplan)nach Absprache vCard QR-Code Career Since 2022 03: University of Oldenburg (Professor for Data Science) 2018 01 – 2022 02: Baqend GmbH (Head of Data Engineering & Research) 2012 12 – 2017 12: University of Hamburg (Research Assistant at DBIS, Norbert Ritter) Education 2019 05: Dr. rer. nat. Computer Science at the University of Hamburg: Scalable Push-Based Real-Time Queries on Top of Pull-Based Databases 2012 11: M. Sc. Computer Science at the University of Hamburg: Evaluation of Tuple Matching Methods on Generated Probabilistic Data 2010 11: B. Sc. Computer Science at the University of Hamburg: Search-Space Reduction Techniques for Duplicate Detection in Probabilistic Data Selected Talks CodeTalks 2025 in Hamburg, Germany: „It Worked on Staging!“: How to Build, Break, and Fix a Global Real-User Monitoring Data Platform (Slides ) Invited keynote at ICRAIS 2025, Mauritius: What You Say is What You Get: Handsfree Coding in 2025 (Slides ) OUTPUT DAY 2025 at TU Dresden in Dresden, Germany: What You Say is What You Get: Handsfree Coding in 2025 (Slides ) BS2000 & DB/DC 2024 in Munich, Germany (Fujitsu NEXT Expert Communities BS2000 & Database / Data Communication Systems): Most of the Time It Works Every Time: The Mindset Behind Using Probabilistic Data Structures (Website ) Data Science Meetup 2024 in Hamburg, Germany: What You Say is What You Get: Handsfree Coding in 2024 Inaugural lecture in Oldenburg, Germany: Data Science in Echtzeit für mehr Freude im Job (Slides ) CodeTalks 2024 in Hamburg, Germany: Most of the Time It Works Every Time: The Mindset Behind Using Probabilistic Data Structures (Slides , Website ) Techcamp 2024 in Hamburg, Germany: Most of the Time It Works Every Time: The Mindset Behind Using Probabilistic Data Structures (Slides ) Invited Talk at KJC (online) (Kristu Jayanti College, UOL Partner Institution): Big Data Analytics at Scale: Designing Complex Data Pipelines for Continuous Insights DBDC 2023 in Munich, Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): Data Validation at Scale: Managing Data Quality in Complex Data Pipelines CodeTalks 2023 in Hamburg, Germany: Data Validation at Scale: Managing Data Quality in Complex Data Pipelines (Slides , Website ) Web Performance Meetup (2023) in Hamburg, Germany: Data Validation at Scale: Managing Data Quality in Complex Data Pipelines (Slides , Website ) CodeTalks 2023 in Hamburg, Germany: Data Validation at Scale: Managing Data Quality in Complex Data Pipelines (Slides , Website ) IGER 2023 in Bamberg, Germany: What You Say is What You Get: Handsfree Coding in 2023 (Slides , Website ) BTW 2023 in Dresden, Germany: What You Say is What You Get: Handsfree Coding in 2023 (Slides ) Techcamp 2023 in Hamburg, Germany: What You Say is What You Get: Handsfree Coding in 2023 (Slides ) DBDC 2022 (online), Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): Ontologies in the Semantic Web: An Introduction to Knowledge Modeling & Sharing Let’s Agree to Disagree: Why Google’s CrUX Results Are Not Reproducible With Your Real-User Monitoring CodeTalks 2022 in Hamburg, Germany: What You Say is What You Get: Handsfree Coding in 2022 (Slides ) Let's Agree to Disagree: Why Google’s CrUX Results Are Not Reproducible With Your Real-User Monitoring (Slides ) Techcamp 2022 in Hamburg, Germany: Batching was Yesterday: Real-Time Tracking & Analysis For 100+ Million Visitors (Slides ) Informatik 2022 in Hamburg, Germany: Panel: Mehr Frauen in die Informatik! Impulsvortrag: Handsfree Coding als Chance für die Informatik (Slides ) UHH Computer Science Colloquium 2022 (online): Scalable and Fast Cloud Data Management DBDC 2021 (online), Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): What You Say is What You Get: Handsfree Coding in 2021 BIFOLD Colloquium 2021 (online): Scalable and Fast Cloud Data Management Flink Forward Global 2021 (online): Batching was Yesterday! Real-Time Tracking For 100+ Million Visitors (Abstract ) Informatik 2021 in Berlin, Germany: Panel Discussion: Mensch-Technik-Interaktion für eine digitale Souveränität CodeTalks 2021 in Hamburg, Germany: Batching was Yesterday! Real-Time Tracking For 100+ Million Visitors What You Say is What You Get: Handsfree Coding in 2021 WWW 2021 in Ljubljana, Slovenia (The Web Conference 2021): Going for Speed: Full-Stack Performance Engineering in Modern Web-Based Applications (Handout , Slides , Videos ) ARIC Hamburg Remote Brown Bag Sessions 2021, Hamburg (online), Germany: What You Say is What You Get: Handsfree Coding in 2021 DBDC 2020 (online), Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): Not Your Father's Data Stack: Batch-Free Tracking & Analytics for 100+ Million Users AWS Webinar 2020 (online): Batching was Yesterday! Real-Time Tracking For 100+ Million Visitors RWTH Aachen, Germany (guest lecture in the software engineering course): What You Say is What You Get: Handsfree Coding in 2021 VLDB 2020 in Tokyo, Japan (46th International Conference on Very Large Databases): InvaliDB: Scalable Push-Based Real-Time Queries on Top of Pull-Based Databases (Extended) (Paper ) ICDE 2020 in Dallas, Texas/USA (36th IEEE International Conference on Data Engineering): Speed Kit: A Polyglot & GDPR-Compliant Approach For Caching Personalized Content (Paper ) InvaliDB: Scalable Push-Based Real-Time Queries on Top of Pull-Based Databases (Paper ) ARIC Hamburg Remote Brown Bag Sessions 2020, Hamburg (online), Germany: Tracking & Analyzing User Behavior for Online Performance Optimization NoSQL Workshop 2020 in Hamburg, Germany: Mobile Site Speed and the Impact on E-Commerce DBDC 2019 in Munich, Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): Scalable Push-Based Real-Time Queries on Top of Pull-Based Databases CodeTalks 2019 in Hamburg, Germany: Big Data Analytics With AWS Athena (Abstract , Slides ) Panel Discussion: GDPR – Who Cares? BTW 2019 in Rostock, Germany (18. Fachtagung des GI-Fachbereichs Datenbanken und Informationssysteme): NoSQL & Real-Time Data Management in Research & Practice (Paper ) DBDC 2018 in Munich, Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): Datenstromverarbeitung in Forschung & Praxis SCDM at Big Data 2018, Seattle, Washington/USA (7th Workshop on Scalable Cloud Data Management): Push vs. Pull: The Future of Real-Time Databases in the Cloud Techcamp 2018 in Hamburg, Germany: Scalable Stream Explained: Surveying Storm, Samza, Spark & Flink CodeTalks 2018 in Hamburg, Germany: Real-Time Processing Explained: A Survey of Storm, Samza, Spark & Flink EDBT 2018 in Vienna, Austria (21st International Conference on Extending Database Technology): Real-Time Data Management for Big Data (Paper ) DBDC 2017 in Munich, Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): Real-Time Databases: Datenbanken mit automatischer Ergebnisaktualisierung Data Science Meetup (2017) in Hamburg, Germany: Real-Time Databases Explained: Why Meteor, RethinkDB, Parse and Firebase Don't Scale (Slides ) CodeTalks 2017 in Hamburg, Germany: Real-Time Databases Explained: Why Meteor, RethinkDB, Parse & Firebase Don't Scale VLDB 2017 in Munich, Germany (43rd International Conference on Very Large Databases): Quaestor: Query Web Caching for Database-as-a-Service Providers (Paper ) BTW 2017 in Stuttgart, Germany (17. Fachtagung des GI-Fachbereichs Datenbanken und Informationssysteme): Scalable Data Management: An In-Depth Tutorial on NoSQL Data Stores (Paper , Slides ) SCDM at BTW 2017 in Stuttgart, Germany (5th Workshop on Scalable Cloud Data Management): The Case For Change Notifications in Pull-Based Databases (Paper ) Coordinated Omission in NoSQL Database Benchmarking (Paper ) DBDC 2016 in Munich, Germany (Fujitsu NEXT Arbeitskreis Database / Data Communication Systems): Aktuelle Datenbanktechnologien in Theorie und Praxis 12min.IOT (2016) in Hamburg, Germany: Real-Time Queries in Baqend (Slides ) BTW 2015 in Hamburg, Germany (16. Fachtagung des GI-Fachbereichs Datenbanken und Informationssysteme): Who Watches the Watchmen? On the Lack of Validation in NoSQL Benchmarking (Paper ) DMC at Informatik 2014 in Stuttgart, Germany (Workshop on Data Management in the Cloud at the 44th Annual Meeting of the Society for Computer Science): NoSQL OLTP Benchmarking: A Survey (Paper ) Organization of Events & Editorial Roles Organizer of the BTW 2025 Data Science Challenge, 21. Fachtagung des GI-Fachbereichs (DBIS) Member of \"Datenbank-Spektrum\" Editorial Board since 2023, official GI journal (Databases & Information Retrieval groups) Program co-chair of 8th-12th Workshop on Scalable Cloud Data Management (SCDM) Program co-chair of GISP Workshop 2022, 1st GI Startup Platform Community Get Together Co-organizer of BTW 2015, 16. Fachtagung des GI-Fachbereichs (DBIS) Program Committee Memberships PC Member of SIGMOD 2027 Research Paper Track, International Conference on Management of Data 2027 PC Member of ICDE 2026 Research Track, 42nd IEEE International Conference on Data Engineering PC Member of EDBT 2026, 28th International Conference on Extending Database Technology PC Member of EDBT 2025, 28th International Conference on Extending Database Technology PC Member of BTW 2025, 21. Fachtagung des GI-Fachbereichs (DBIS) PC Member of EDBT 2024, 27th International Conference on Extending Database Technology PC Member of SoCC 2024, 14t",
  "content_length": 29549,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:35"
}