{
  "name": "Wolfgang Heidrich",
  "homepage": "http://vccimaging.org/People/heidriw",
  "status": "success",
  "content": "Wolfgang Heidrich -- Home Page Wolfgang Heidrich Professor of Computer Science and Elecrical & Computer Engineering, KAUST King Abdullah University of Science and Technology, Bldg. 1, Rm 2113, Thuwal, 23955-6900, Saudi Arabia. wolfgang.heidrich@kaust.edu.sa Degrees and Employment History: Diplom Informatiker, University of Erlangen (1995); M.Math (Computer Science), University of Waterloo (1996); PhD (with honours), University of Erlangen (1999); Research Associate, Max-Planck-Institute for Computer Science (1999-2000); Assistant Professor, UBC (2000-2004); Associate Professor, UBC (2004-2010); Dolby Research Chair in Computer Science, UBC (2008-2013); Full Professor, UBC (2010-2018); Director, KAUST Visual Computing Center (2014-2021); Professor of CS and ECE, KAUST (since 2014). Selected Awards and Distinctions: Optica Fellow (2025); NAI Fellow (2024); ACM SIGGRAPH Computer Graphics Achievement Award (2023); ACM SIGGRAPH Test-of-Time Award (2023); IEEE Fellow (2021); Humboldt Research Award (2014); Eurographics Fellow (2013); Charles A. McDowell Award for Excellence in Research (2011). Research Interests: my core research interests are in computational imaging and display, an emerging research area within visual computing, which combines methods from computer graphics, machine vision, imaging, inverse methods, optics and perception to develop new sensing and display technologies. Computational imaging is the hardware-software co-design of imaging devices, which aims to optically encode information about the real world in such a way that it can be captured by image sensors. The resulting images represent detailed information such as scene geometry, motion of solids and liquids, multi-spectral information, or high contrast (high dynamic range), which can then be computationally decoded using inverse methods, machine learning, and numerical optimization. Additional details: Bio, Google Scholar, ORCID: 0000-0002-4227-8508 Recent Publications (Full List): 2020- X. Yang, C. Nguyen, W. Wang, K. Kang, W. Heidrich, X. Li: Efficient Depth- and Spatially-Varying Image Simulation for Defocus Deblur ICCV Workshop, 2025 Project page Q. Fu*, M. Souza*, E. Choi, S. Shin, S. Baek, W. Heidrich: Limitations of Data-Driven Spectral Reconstruction: An Optics-Aware Analysis IEEE Transactions on Computational Imaging, 2025 Project page K. Wei*, H. A. Jimenez Romero*, H. Amata*, J. Sun, Q. Fu, F. Heide, W. Heidrich: Large-Area Fabrication-Aware Computational Diffractive Optics ACM Trans. Graphics (Proc. SIGGRAPH Asia), 2025 Project page S. Mao, Y. N. Mishra, W. Heidrich: Fovea Stacking: Imaging with Dynamic Localized Aberration Correction ACM Trans. Graphics (Proc. SIGGRAPH Asia), 2025 Project page Y. Zeng, K. Choi, H. Amata, K. Kang, W. Heidrich, H. Wu, M. Kim: Designing and Fabricating Color BRDFs with Differentiable Wave Optics ACM Trans. Graphics (Proc. SIGGRAPH Asia), 2025 M. Sun, K. Kang, Y. N. Mishra, X. Yang, H. Amata, W. Heidrich: High-throughput space-time Fourier ptychography for motile microorganisms Optics Express, 2025 Project page J. Romero, W. Heidrich, M. Ravasi: Bayesian seismic inversion with implicit neural representations Geophysical Journal International, 2025 Project page J. Sun, K. Wei, T. Eboli, C. Wang, C. Zheng, Z. Zhou, A. Majumdar, W. Heidrich, F. Heide: Collaborative On-Sensor Array Cameras ACM Trans. Graphics (Proc. SIGGRAPH), 2025 Project page H. Wei, X. Liu, Y. Liu, Q. Fu, W. Heidrich, E. Lam, Y. Peng: Learned Off-aperture Encoding for Wide Field-of-view RGBD Imaging ICCP & IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025 M. Souza, Y. Zheng, K. Kang, Y. Mishra, Q. Fu, W. Heidrich: Latent Space Imaging CVPR, 2025 Project page Y. Liu, L. Ou, Q. Fu, H. Amata, W. Heidrich, Y. Peng: Learned Binocular-Encoding Optics for RGBD Imaging Using Joint Stereo and Focus Cues CVPR, 2025 (oral paper) S. Kazim, F. Strasser, M. Løvmo, A. Nehrych, S. Moser, M. Ziemczonok, W. Heidrich, I. Ihrke, M. Ritsch-Marte: Coded wavefront sensing for video-rate quantitative phase imaging and tomography: validation with digital holographic microscopy Optics Express, 2025 S. Kazim, F. Strasser, M. Løvmo, A. Nehrych, S. Moser, M. Ziemczonok, W. Heidrich, I. Ihrke, M. Ritsch-Marte: Performance Validation of Coded Wavefront Sensing for Quantitative Phase Imaging of Static and Dynamic Specimens Using Digital Holographic Microscopy International Symposium on Computational Sensing, 2025 A. Dave*, T. Zhang*, A. Young, R. Raskar, W. Heidrich, A. Veeraraghavan: NeST: Neural Stress Tensor Tomography by Leveraging 3D Photoelasticity ACM Transactions on Graphics, 2025 J. Romero, W. Heidrich, M. Ravasi: B-IntraSeismic: Uncertainty quantification in seismic inversion via implicit neural representations EAGE Annual Conference & Exhibition, 2025 J. Romero, W. Heidrich, L. Casasanta, V. Akcelik, M. Ravasi: High-resolution seismic time-strain estimation EAGE Annual Conference & Exhibition, 2025 X. Yang, M. Souza, K. Wang, P. Chakravarthula, Q. Fu, W. Heidrich: End-to-End Hybrid Refractive-Diffractive Lens Design with Differentiable Ray-Wave Model SIGGRAPH Asia, 2024 Project page N. Mulun*, H. A. Jimenez Romero*, X. Yang, J. Klein, D. Michels, W. Heidrich: End-to-end Optimization of Fluidic Lenses SIGGRAPH Asia, 2024 Project page X. Mei, Y. Li, Q. Fu, W. Heidrich: Progressive Self-Supervised Learning for CASSI Computational Spectral Cameras IEEE Transactions on Computational Imaging, 2024 Project page H. Amata, Q. Fu, W. Heidrich: Comparative Performance Analysis of Multi-level Diffractive Lens and Lens Fabricated by Grayscale Lithography and Soft-imprinting Optica Imaging Congress (Imaging Systems and Applications), 2024 Project page M. Sun, K. Wang, Y. N. Mishra, S. Qiu, W. Heidrich: Dynamic Fourier Ptychography via Space-Time Optimization Optica Imaging Congress (Computational Optical Sensing and Imaging), 2024 Project page J. Romero, W. Heidrich, N. Luiken, M. Ravasi: Seismic Reservoir Characterization With Implicit Neural Representations Journal of Geophysical Research - Machine Learning and Computation, 2024 Project page M. Sun, K. Wang, Y. N. Mishra, S. Qiu, W. Heidrich: Space-time Fourier ptychography for in vivo quantitative phase imaging Optica, 2024 Project page X. Yang, Q. Fu, W. Heidrich: Curriculum Learning for ab initio Deep Learned Refractive Optics Nature Communications, 2024 Project page Z. Shi, I. Chugunov, M. Bijelic, G. Côté, J. Yeom, Q. Fu, H. Amata, W. Heidrich, F. Heide: Split-Aperture 2-in-1 Computational Cameras ACM Trans. Graphics (Proc. SIGGRAPH), 2024 E. Tseng, G. Kuo, S.-H. Baek, N. Matsuda, A. Maimone, F. Schiffers, P. Chakravarthula, Q. Fu, W. Heidrich, D. Lanman, F. Heide: Neural étendue expander for ultra-wide-angle high-fidelity holographic display Nature Communications, 2024 Project page Y. Zheng, Q. Fu, H. Amata, P. Chakravarthula, F. Heide, W. Heidrich: Hexagonal diffractive optical elements Optics Express, 2023 Project page H. Amata, Q. Fu, W. Heidrich: Additive fabrication of SiO2-based micro-optics with lag-free depth and reduced roughness Optics Express, 2023 Project page Y. Wang, R. Idoughi, W. Heidrich: Learning Adaptive Tensorial Density Fields for Clean Cryo-EM Reconstruction NeurIPS, 2023 Project page Y. Wang, R. Idoughi, D. Rückert, R. Li, W. Heidrich: Adaptive Differentiable Grids for Cryo-Electron Tomography Reconstruction and Denoising Bioinformatics Advances, 2023 Project page M. Souza, W. Heidrich: MetaISP – Exploiting Global Scene Structure for Accurate Multi-Device Color Rendition Vision, Modeling, and Visualization (VMV), 2023 Project page N. Chen, C. Wang, W. Heidrich: ∂H: Differentiable Holography Laser & Photonics Reviews, 2023 H. Amata, Q. Fu, W. Heidrich: Additive diffractive optical elements fabrication by PECVD deposition of SiO2 and lift-off process Proc. SPIE 12624, Digital Optical Technologies, 2023 Project page M. Qi, W. Heidrich: Scattering-aware Holographic PIV with Physics-based Motion Priors ICCP, 2023 Project page X. Yang, Q. Fu, M. Elhoseiny, W. Heidrich: Aberration-Aware Depth-from-Focus ICCP & IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2023 Project page S. Qiu, H. Amata, W. Heidrich: MoiréTag: Angular Measurement and Tracking with a Passive Marker SIGGRAPH, 2023 Project page J. Zhang, X. Dun, J. Zhu, Z. Zhang, C. Feng, Z. Wang, W. Heidrich, X. Cheng: Large Numerical Aperture Metalens with High Modulation Transfer Function ACS Photonics, 2023 Y. Li, Q. Fu, W. Heidrich: Extended Depth-of-Field Projector using Learned Diffractive Optics IEEE VR, 2023 Project page J. Li, Y. Li, C. Wang, X. Ye, W. Heidrich: BUSIFusion: Blind Unsupervised Single Image Fusion of Hyperspectral and RGB Images IEEE Transactions on Computational Imaging, 2023 J. Rey Ramirez, P. Rautek, C. Bohak, O. Strnad, Z. Zhang, S. Li, I. Viola, W. Heidrich: GPU Accelerated 3D Tomographic Reconstruction and Visualization from Noisy Electron Microscopy Tilt-Series IEEE Transactions on Visualization and Computer Graphics, 2022 Project page Q. Fu, D. Yan, W. Heidrich: Diffractive lensless imaging with optimized Voronoi-Fresnel phase Optics Express, 2022 Project page C. Wang, N. Chen, W. Heidrich: dO: A differentiable engine for Deep Lens design of computational imaging systems IEEE Transactions on Computational Imaging, 2022 Project page N. Chen, C. Wang, W. Heidrich: HTRSD: Hybrid Taylor Rayleigh-Sommerfeld diffraction Optics Express, 2022 Project page R. Li, D. Rückert, Y. Wang, R. Idoughi, W. Heidrich: Neural Adaptive Scene Tracing (NAScenT) VMV, 2022 Project page G. Qian*, Y. Wang*, J. Gu, C. Dong, W. Heidrich, B. Ghanem,, J. Ren: Rethinking Learning-based Demosaicing, Denoising, and Super-Resolution Pipeline ICCP, 2022 Y. Wang, R. Idoughi, W. Heidrich: Joint Motion-Correction and Reconstruction in Cryo-EM Tomography ICIP, 2022 Project page D. Rückert, Y. Wang, R. Li, R. Idoughi, W. Heidrich: NeAT-Neural Adaptive Tomography ACM Transactions on Graphics (Proc.",
  "content_length": 15507,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:24"
}