{
  "name": "Wolfram Kahl",
  "homepage": "http://www.cas.mcmaster.ca/~kahl",
  "status": "success",
  "content": "Wolfram Kahl home page Wolfram Kahl Professor Dr. rer. nat., M. Sc. OXON Department of Computing and Software McMaster University Research Interests High-level specification and programming formalisms Relational Methods in Computer Science — Graph transformation, especially term graph transformation Mathematically rigorous software design and verification Functional Programming and Program Transformation, Haskell, pattern matching calculus (PMC) Projects CalcCheck, a proof checker for teaching calculational Logics and Discrete Mathematics RATH-Agda, Relation-Algebraic Theories in the dependently-typed programming language Agda Old project: Publications Teaching (Only distinct courses are retained from past terms.) Fall 2025: COMPSCI 2LC3: Logical Reasoning for Computer Science Winter 2025: CAS 707: Formal Specification Techniques Winter 2021: CAS 763: Certified Programming with Dependent Types Fall 2020: COMPSCI&SFWRENG 2DM3: Discrete Mathematics with Applications I Fall 2014: COMP SCI 3EA3: Software Correctness and Specification COMP SCI 2GA3 / SFWR ENG 2GA3 / SFWR ENG 3GA3: Computer Architecture Fall 2012: CAS 781: Advanced Topics --- Category Theory Fall 2010: CAS 706: Programming Languages Fall 2009: CAS 743: Functional Programming Fall 2007: CAS 701: Logic and Discrete Mathematics in Software Engineering Winter 2007: SFWR ENG 3BB4: Software Design III - Concurrent System Design Fall 2006: SFWR ENG 2S03: Principles of Programming SFWR ENG 3E03: Design and Selection of Programming Languages Contact Department of Computing and SoftwareTel.:+1-905-525-9140 ext. 27042 McMaster UniversityFax:+1-905-524-0340 1280 Main Street WestE-mail: kahl@cas.mcmaster.ca Hamilton, Ontario, L8S 4K1 (I do not handle Word or WordPerfect documents) CANADAURL: http://www.cas.mcmaster.ca/~kahl/",
  "content_length": 1803,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:36"
}