{
  "name": "Wolfgang Reif",
  "homepage": "https://www.uni-augsburg.de/de/fakultaet/fai/isse/prof/swtse/team/reif",
  "status": "success",
  "content": "Prof. Dr. Wolfgang Reif Institut für Software & Systems Engineering Universität Fakultäten Fakultät für Angewandte Informatik Institut für Software & Systems Engineering Lehrstühle und Professuren Softwaretechnik Team Prof. Dr. Wolfgang Reif Prof. Dr. Wolfgang Reif Institutsdirektor Institut für Software & Systems Engineering Telefon: +49 821 598 2174 E-Mail: reif@informatik.uni-augsburginformatik.uni-augsburg.de () Raum: 3049 (N) Adresse: Universitätsstraße 6a, 86159 Augsburg Kontakt (.vcf) Publikationen 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | 2002 | 2001 | 2000 | 1999 | 1998 | 1997 | 1996 | 1995 | 1994 | 1993 | 1992 | 1991 | 1990 | 1989 | 1988 | 1987 | 1986 2025 Oliver Kosak, Philipp Kastenmüller, Constantin Wanninger and Wolfgang Reif. 2025. An approach for extended swarm formation flight with drones: PROTEASE 2.0. In Tiziana Margaria, Bernhard Steffen (Eds.). Leveraging applications of formal methods, verification and validation: rigorous engineering of collective adaptive systems: 12th International Symposium, ISoLA 2024, Crete, Greece, October 27–31, 2024, proceedings, part II. Springer, Berlin, 263-280 DOI: 10.1007/978-3-031-75107-3_16PDF | BibTeX | RIS | DOI Julia Reichmann, Julian Hanke, Christian Eymüller, Anna Trauth, Wolfgang Reif and Markus G. R. Sause. 2025. Development of a robot-based test bench for the destructive testing of components. Journal of Testing and Evaluation 53, 1, 42-58. DOI: 10.1520/jte20240091BibTeX | RIS | DOI Christian Lehner, Oliver Kosak, Hella Ponsar and Wolfgang Reif. 2025. Flexible assembly planning for self-organizing production cells. Procedia Computer Science 253, 1860-1869. PDF | BibTeX | RIS Daniel Bermuth, Alexander Poeppel and Wolfgang Reif. 2025. KoARob: towards AI-based safety in human-robot-collaborations. In 2025 IEEE 21st International Conference on Automation Science and Engineering (CASE), August 17–21, 2025, Los Angeles, CA, USA. Institute of Electrical and Electronics Engineers (IEEE), Piscataway, NJ, 837-844 DOI: 10.1109/CASE58245.2025.11164087PDF | BibTeX | RIS | DOI Daniel Bermuth, Alexander Poeppel and Wolfgang Reif. 2025. SimpleDepthPose: fast and reliable human pose estimation with RGBD-images. preprint.PDF | BibTeX | RIS | URL Daniel Bermuth and Wolfgang Reif. 2025. Slungt: even faster spoken language understanding with n-grams and tries. In Bhaskar D. Rao, Isabel Trancoso, Gaurav Sharma, Neelesh B. Mehta (Eds.). ICASSP 2025 - 2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 6-11 April 2025, Hyderabad, India. IEEE, Piscataway, NJ, 1-5 DOI: 10.1109/ICASSP49660.2025.10890387PDF | BibTeX | RIS | DOI Gerhard Schellhorn, Stefan Bodenmüller and Wolfgang Reif. 2025. Verification of forward simulations with thread-local, step-local proof obligations. Science of Computer Programming 241, 103227. DOI: 10.1016/j.scico.2024.103227PDF | BibTeX | RIS | DOI 2024 Carola Lenzen, Vinzenz Löffel and Wolfgang Reif. in press. Handling anomalies in CAD assemblies: detecting anomalous and suggesting alternative parts. In The 2024 International Conference on Computational Science and Computational Intelligence (CSCI 2024), December 11-13, 2024, Las Vegas, Nevada, USA. Springer, BerlinBibTeX | RIS Carola Lenzen and Wolfgang Reif. 2024. Localized recommendation in assembly modeling: employing GNNs for targeted part placement. In M. Arif Wani, Plamen Angelov, Feng Luo, Mitsunori Ogihara (Eds.). 23rd International Conference on Machine Learning and Applications (ICMLA'24), December 18-20, 2024, Miami, Florida, USA. IEEE, Piscataway, NJ, 1804-1809 DOI: 10.1109/ICMLA61862.2024.00278PDF | BibTeX | RIS | DOI Daniel Bermuth, Alexander Poeppel and Wolfgang Reif. 2024. VoxelKeypointFusion: generalizable multi-view multi-person pose estimation. preprint.PDF | BibTeX | RIS | URL 2023 Julian Hanke, Matthias Stueben, Christian Eymüller, Maximilian Müller, Alexander Poeppel and Wolfgang Reif. 2023. CASP: Computer Aided Specimen Placement for robot-based component testing. In Giuseppina Gini, Henk Nijmeijer, Dimitar Filev (Eds.). Proceedings of the 20th International Conference on Informatics in Control, Automation and Robotics (ICINCO), November 13-15, 2023, in Rome, Italy: volume 1. SciTePress, Setúbal, 374-382 DOI: 10.5220/0012155000003543PDF | BibTeX | RIS | DOI Simon Stieber, Leonard Heber, Christof Obertscheider and Wolfgang Reif. 2023. Control of composite manufacturing processes through deep reinforcement learning. In Mihai Boicu, Moamar Sayed-Mouchaweh, Arif Wani (Eds.). 2023 International Conference on Machine Learning and Applications (ICMLA), 15-17 December 2023, Jacksonville, FL, USA. IEEE, Piscataway, NJ, 17-22 DOI: 10.1109/icmla58977.2023.00011PDF | BibTeX | RIS | DOI Simon Stieber, Niklas Schröter, Ewald Fauster, Marcel Bender, Alexander Schiendorfer and Wolfgang Reif. 2023. Inferring material properties from FRP processes via sim-to-real learning. The International Journal of Advanced Manufacturing Technology 128, 3-4, 1517-1533. DOI: 10.1007/s00170-023-11509-8PDF | BibTeX | RIS | DOI Gerhard Schellhorn, Stefan Bodenmüller and Wolfgang Reif. 2023. Refinement and separation: modular verification of wandering trees. Lecture Notes in Computer Science 14300, 214-234. DOI: 10.1007/978-3-031-47705-8_12PDF | BibTeX | RIS | DOI Alexander Poeppel, Christian Eymüller and Wolfgang Reif. 2023. SensorClouds: a framework for real-time processing of multi-modal sensor data for human-robot-collaboration. In Anthony Tzes, Ramesh K. Agarwal, Xin-She Yang, Farshad Khorrami (Eds.). 2023 9th International Conference on Automation, Robotics and Applications (ICARA), 10-12 February 2023, Abu Dhabi, United Arab Emirates. IEEE, Piscataway, NJ, 294-298 DOI: 10.1109/icara56516.2023.10125740PDF | BibTeX | RIS | DOI Gerhard Schellhorn, Stefan Bodenmüller, Martin Bitterlich and Wolfgang Reif. 2023. Separating separation logic – modular verification of red-black trees. Lecture Notes in Computer Science 13800, 129-147. DOI: 10.1007/978-3-031-25803-9_8PDF | BibTeX | RIS | DOI Gerhard Schellhorn, Stefan Bodenmüller and Wolfgang Reif. 2023. Thread-local, step-local proof obligations for refinement of state-based concurrent systems. Lecture Notes in Computer Science 14010, 70-87. DOI: 10.1007/978-3-031-33163-3_6PDF | BibTeX | RIS | DOI Dominik Mueller, Silvan Mertes, Niklas Schroeter, Fabio Hellmann, Miriam Elia, Bernhard Bauer, Wolfgang Reif, Elisabeth André and Frank Kramer. 2023. Towards automated COVID-19 presence and severity classification. In Maria Hägglund, Madeleine Blusi, Stefano Bonacina, Lina Nilsson, Inge Cort Madsen, Sylvia Pelayo, Anne Moen, Arriel Benis, Lars Lindsköld and Parisis Gallos (Ed.). Caring is sharing – exploiting the value in data for health and innovation. IOS Press, Amsterdam (Studies in Health Technology and Informatics ; 302), 917-921. DOI: 10.3233/shti230309PDF | BibTeX | RIS | DOI Christian Eymüller, Julian Hanke, Alexander Poeppel and Wolfgang Reif. 2023. Towards self-configuring plug & produce robot systems based on ontologies. In Anthony Tzes, Ramesh K. Agarwal, Xin-She Yang, Farshad Khorrami (Eds.). ICARA 2023: 2023 9th International Conference on Automation, Robotics and Applications, February 10-12, 2023, Abu Dhabi, United Arab Emirates. IEEE, Piscataway, NJ, 23-27 DOI: 10.1109/ICARA56516.2023.10126075PDF | BibTeX | RIS | DOI Martin Schörner, Constantin Wanninger, Raphael Katschinsky, Simon Hornung, Christian Eymüller, Alexander Poeppel and Wolfgang Reif. 2023. UAV inspection of large components: determination of alternative inspection points and online route optimization. In 2023 IEEE/ACM 5th International Workshop on Robotics Software Engineering (RoSE), 15 May 2023, Melbourne, Australia. IEEE, Piscataway, NJ, 45-52 DOI: 10.1109/RoSE59155.2023.00012PDF | BibTeX | RIS | DOI 2022 Carola Lenzen, Alexander Schiendorfer and Wolfgang Reif. 2022. A recommendation system for CAD assembly modeling based on graph neural networks. In ECML/PKDD 2022: European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases, Grenoble, France, 19-23 September 2022. , 1-17PDF | BibTeX | RIS Daniel Bermuth, Alexander Poeppel and Wolfgang Reif. 2022. Finstreder: simple and fast spoken language understanding with finite state transducers using modern speech-to-text models. preprint. DOI: 10.48550/arXiv.2206.14589PDF | BibTeX | RIS | DOI Carola Lenzen, Alexander Schiendorfer and Wolfgang Reif. 2022. Graph machine learning for assembly modeling. In LoG 2022: The First Learning on Graphs Conference, 9-12 December 2022, virtual event. PDF | BibTeX | RIS | URL Daniel Bermuth, Alexander Poeppel and Wolfgang Reif. 2022. Jaco: an offline running privacy-aware voice assistant. In Daisuke Sakamoto, Astrid Weiss, Masahiro Shiomi, Laura M. Hiatt, Selma Šabanović (Eds.). 2022 17th ACM/IEEE International Conference on Human-Robot Interaction (HRI), 7-10 March 2022, Sapporo, Japan. IEEE, Piscataway, NJ, 618-622 DOI: 10.1109/HRI53351.2022.9889574PDF | BibTeX | RIS | DOI Julian Hanke, Christian Eymüller, Alexander Poeppel, Julia Reichmann, Anna Trauth, Markus Sause and Wolfgang Reif. 2022. Sensor-guided motions for robot-based component testing. In Davide Brugali, Phillip C.-Y. Sheu, Jeffrey Tsai (Eds.). 2022 Sixth IEEE International Conference on Robotic Computing (IRC), 5-7 December 2022, Naples, Italy. IEEE, Piscataway, NJ, 81-84 DOI: 10.1109/irc55401.2022.00021PDF | BibTeX | RIS | DOI Gerhard Schellhorn, Stefan Bodenmüller, Martin Bitterlich and Wolfgang Reif. 2022. Software & system verification with KIV. Lecture Notes in Computer Science 13360, 408-436. DOI: 10.1007/978-3-031-08166-8_20PDF | BibTeX | RIS | DOI Julian Hanke, Christian Eymüller, Julia Reichmann, Anna Trauth, Markus Sause and Wolfgang Reif. 2022. Software-defined testing facility for component testing with industrial robots. In 2022 IEEE 27th I",
  "content_length": 145077,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:32"
}