{
  "name": "Wolfgang Hommel",
  "homepage": "https://www.unibw.de/inf2/personen/professoren/hommel",
  "status": "success",
  "content": "Prof. Dr. Wolfgang Hommel — Inf2 Skip to main content Prof. Dr. Wolfgang Hommel Prof. Dr. Wolfgang Hommel Professur für IT-Sicherheit von Software und Daten Adresse Institut für Softwaretechnologie Fakultät für Informatik Universität der Bundeswehr München D-85577 Neubiberg, Deutschland Büro: Gebäude 41/300, Raum 0324 Telefon: +49 89 6004 2495 (-2505) Fax: +49 89 6004 4447 E-Mail: wolfgang.hommel@unibw.de PGP Key: 0x22313C1DS/MIME Fingerprint: C9 B3 AA 55 5F 76 3F E4 EE F8 52 4E 8A 71 14 8B 10 4A 27 89 00 1D 0A 04 72 2F B0 E2 D3 FE 2B 16 Tätigkeiten Forschung Forschung Forschungsschwerpunkte Forschungsmethodik Anwendungsgebiete Standort- und organisationsübergreifend erbrachte IT-Dienste: Cloud Computing, eScience-Infrastrukturen, Edge Computing Internet of Things Produktions- und Wertschöpfungsketten, Cyberphysical Systems Betriebsumgebungen mit erhöhtem Schutzbedarf: Innentäterprävention Umsetzung sektorenspezifischer Compliance-Anforderungen Vernetzte Operationen im Cyber- und Informationsraum (CIR) Data Centers und Security Operations Centers Publikationen Publikationen Publikationen 2019 Tanja Hanauer, Christoph Wüstner, Wolfgang HommelVESPER - a tool for managing Vulnerabilities and Exploits in Software with Portscan-Endorsed Results26. DFN-Konferenz 2019 \"Sicherheit in vernetzten Systemen\" 2018 Michael Steinke, Iris Adam, Wolfgang Hommel Multi-Tenancy-Capable Correlation of Security Events in 5G Networks IEEE Conference on Network Function Virtualization and Software Defined Networks, International Workshop on Security in NFV-SDN 2018, Verona, Italy Tanja Hanauer, Wolfgang Hommel, Stefan Metzger, Daniela Pöhn A Process Framework for Stakeholder-specific Visualization of Security Metrics The 13th International Conference on Availability, Reliability and Security (ARES 2018), IWSECC Workshop, Hamburg, Germany Michael Grabatin, Wolfgang Hommel Reliability and scalability improvements to identity federations by managing SAML metadata with distributed ledger technology IEEE/IFIP Network Operations and Management Symposium (NOMS 2018), DISSECT Workshop, Taipei, Taiwan Michael Steinke, Wolfgang Hommel A data model for federated network and security management information exchange in inter-organizational IT service infrastructures IEEE/IFIP Network Operations and Management Symposium (NOMS 2018) Taipei, Taiwan Michael Steinke, Wolfgang Hommel Overcoming Network and Security Management Platform Gaps in Federated Software Networks 14th IEEE International Conference on Network and Service Management (CNSM 2018) Rome, Italy Michael Grabatin, Michael Steinke, Wolfgang Hommel Policy-based network and security management in federated service infrastructures with permissioned blockchains 6th International Symposium on Security in Computing and Communications (SSCC 2018) Bangalore, India 2017 Michael Brenner, Nils gentschen Felde, Wolfgang Hommel, Stefan Metzger, Helmut Reiser, Thomas Schaaf Praxisbuch ISO/IEC 27001 - Management der Informationssicherheit und Vorbereitung auf die Zertifizierung 2., vollständig überarbeitete Auflage, ISBN 978-3-446-45139-1, Hanser-Verlag, April 2017 Michael Grabatin, Wolfgang Hommel Blockchain-basiertes Föderiertes Identity Management am Beispiel von Ethereum Smart Contracts In: Proceedings24. DFN-Konferenz \"Sicherheit in vernetzten Systemen\", Hamburg, 2017 Wolfgang Hommel, Michael Grabatin, Stefan Metzger, Daniela Pöhn Level of Assurance Management for Dynamic Identity Federations based on Vectors of Trust In: PIK, Praxis der Informationsverarbeitung und Kommunikation, Vol. 39, Issue 3-4, 2017 2016 Wolfgang Hommel, Stefan Metzger, Michael Steinke VUDEC: A Framework for Vulnerability Management in Decentralized Communication Networks In: Proceedings of 23rdACM Conference on Computer and Communications Security (ACM CCS 2016), Vienna, October 2016 Felix von Eye, Michael Grabatin, Wolfgang Hommel Detecting Stealthy Backdoors and Port Knocking Sequences through Flow Analysis In: PIK 38(3-4); 97-104 (2016) Daniela Pöhn, Wolfgang Hommel Automated User Information Conversion to improve Identity Federation Scalability In: Proceedings of the 22nd congress of the European University Information Systems Organisation (EUNIS 2016), June 2016 Michael Grabatin, Wolfgang Hommel, Stefan Metzger, Daniela Pöhn Improving the Scalability of Identity Federations through Level of Assurance Management Automation In: Proceedings of 9. DFN-Forum Kommunikationstechnologien, Gesellschaft für Informatik, May 2016 Daniela Pöhn, Wolfgang Hommel Management architecture for dynamic federated identity management In: Proceedings of Second International Conference on Cryptography and Information Security (CRIS 2016), March 2016 Fabian Ruffy, Felix von Eye, Wolfgang Hommel A STRIDE-based Security Architecture for Software Defined Networking In: Proceedings of SOFTNETWORKING 2016, February 2016 2015 Daniela Pöhn, Stefan Metzger, Michael Grabatin, Wolfgang Hommel DAME: On-demand Internet-scale SAML Metadata Exchange In: International Journal On Advances in Systems and Measurements, v8 n3&4 2015 Daniel Feuchtinger, Wolfgang Hommel, Helmut Reiser, Bernhard Schmidt Sieben Jahre DNSSEC in der Praxis — ein Erfahrungsbericht In: DFN-Mitteilungen Nr. 89 (11/2015), DFN-Verein, Berlin Daniel Feuchtinger, Wolfgang Hommel, Helmut Reiser, Bernhard Schmidt, Michael Storz DNSSEC — Konzepte und Betriebsaspekte des Domain Name Systems der Zukunft In: PIK - Praxis der Informationsverarbeitung und Kommunikation, Vol. 38 Issue 1-2, De Gruyter, September 2015 Daniel Feuchtinger, Wolfgang Hommel, Helmut Reiser, Bernhard Schmidt, Michael Storz E-Mail made in Science — Sicherheit für den E-Mail Transport mit DANE TLSA In: PIK - Praxis der Informationsverarbeitung und Kommunikation, Vol. 38 Issue 1-2, De Gruyter, September 2015 Wolfgang Hommel, Stefan Metzger, Michael Steinke Information Security Risk Management in Higher Education Institutions: From Processes to Operationalization In: Proceedings of the 21th congress of the European University Information Systems Organisation (EUNIS 2015), June 2015 Felix von Eye, Michael Grabatin, Wolfgang Hommel Netzbasierte Erkennung von mittels Port Knocking versteckten Diensten und Backdoors In: Proceedings des 8. DFN-Forums Kommunikationstechnologien, Lecture Notes in Informatics, Springer, June 2015 Felix von Eye, David Schmitz, Wolfgang Hommel Integrated Tool Support in the Context of Security and Network Management Convergence In: Proceedings of INFOCOMP 2015, June 2015 Felix von Eye, Wolfgang Hommel, Stefan Metzger Aufbau und Betrieb von organisationsweitem Security-Monitoring In: IT-Administrator Magazin, Heinemann Verlag München, March 2015 2014 Felix von Eye, David Schmitz, Wolfgang Hommel A Secure Logging Framework with Focus on Compliance In: International Journal On Advances in Security, vol. 7, no. 3/4, 2014 Daniela Pöhn, Stefan Metzger, Wolfgang Hommel A SAML Metadata Broker for Dynamic Federations and Inter-Federations In: Proceedings of INFOCOMP 2014, Paris, France, July 2014 Daniela Pöhn, Stefan Metzger, Wolfgang Hommel Géant-TrustBroker: Dynamic, scalable management of SAML-based inter-federation authentication and authorization infrastructures In: Proceedings of 29th International Information Security and Privacy Conference (SEC 2014), LNCS, Springer, June 2014 Christian Straube, Wolfgang Hommel, Dieter Kranzlmüller Design Criteria and Design Concepts for an Integrated Management Platform of IT Infrastructure Metrics In: International Journal On Advances in Systems and Measurements, Vol. 7, No. 1&22014 Felix von Eye, Wolfgang Hommel, Stefan Metzger Improving higher education network security by automating scan result evaluation with Dr. Portscan In: Proceedings of the 20th congress of the European University Information Systems Organisation (EUNIS 2014), Umea, Sweden, June 2014 Daniela Pöhn, Stefan Metzger, Wolfgang Hommel Géant-TrustBroker: Simplifying Identity & Access Management for International Research Projects and Higher Education Communities In: Proceedings of the 20th congress of the European University Information Systems Organisation (EUNIS 2014), Umea, Sweden, June 2014 Felix von Eye, Wolfgang Hommel, Helmut Reiser Herausforderungen und Anforderungen für ein organisationsweites Notfall-Passwortmanagement In: Proceedings des 7. DFN-Forums Kommunikationstechnologien, Lecture Notes in Informatics, Springer, June 2014 Daniela Pöhn, Stefan Metzger, Wolfgang Hommel Géant-TrustBroker: Dynamic inter-federation identity management In: Proceedings of TERENA Networking Conference (TNC), Dublin, May 2014 Hao Yu, Feng Liu, Susanne Naegele-Jackson, Tangui Coulouarn, Trupti Kulkarni, Josva Kleist, Wolfgang Hommel, Lars Dittmann GÉANT perfSONAR MDM-based Circuit Monitoring in Multi-Domain Environments In: IEEE Communications Magazine, May 2014 Wolfgang Hommel, Stefan Metzger, Helmut Reiser, Felix von Eye Security Knowledge Management auf Basis einer Dokumentenvorlage für Sicherheitskonzepte In: Sicherheit in vernetzten Systemen: 21. DFN Workshop, ISBN 978-3-7322-9378-0, January 2014 2013 Stefan Metzger, Wolfgang Hommel, Helmut Reiser Grenzen, Chancen und Perspektiven von Security Information & Event Management Systemen In: PIK - Praxis der Informationsverarbeitung und Kommunikation, Vol. 36, Issue 4, November 2013 Vitalian A. Danciu, Wolfgang Hommel, Silvia Knittl Configuration management and monitoring of heterogeneous, inter-organizational cloud infrastructures In: DMTF SVM Workshop 2013 - Systems and Virtualization Management: Standards and the Cloud, Zurich, October 2013 Felix von Eye, Michael Grabatin, Wolfgang Hommel, Stefan Metzger The Doctor Is In: Managing port scan results with Dr. Portscan In: Linux Magazine, Issue 155, October 2013 Felix von Eye, David Schmitz, Wolfgang Hommel SLOPPI — a framework for Secure Logging with Privacy Protection and Integrity In: Proceedings of ICIMP 2013, Rome, Italy, June 2013 Wolfgang Hommel, Stefan Metzger, Helmut Reiser, Felix von Eye IT security con",
  "content_length": 29961,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:25"
}