{
  "name": "Wolfgang Schröder 0002",
  "homepage": "https://www4.cs.fau.de/~wosch",
  "status": "success",
  "content": "Wolfgang Schröder-Preikschat – Lehrstuhl für Informatik 4 Organisationsmenü öffnen Organisationsmenü schließen Friedrich-Alexander-Universität Lehrstuhl für Informatik 4 (Systemsoftware) Wolfgang Schröder-Preikschat Wolfgang Schröder-Preikschat Prof. i. R. Dr.-Ing. habil. Wolfgang Schröder-PreikschatDepartment Informatik (INF)Lehrstuhl für Informatik 4 (Systemsoftware)Raum: Raum 0.054Martensstr. 191058 ErlangenTelefon: +49 9131 85-27278E-Mail: wosch@cs.fau.deWebseite: https://sys.cs.fau.de/~wosch Professor (Ordinarius) im Ruhestand am Lehrstuhl für Informatik 4 (Verteilte Systeme und Betriebssysteme) der Friedrich-Alexander-Universität (FAU) Erlangen-Nürnberg. Mitglied im Schwerpunktprogramm 2377 (Disruptive Hauptspeichertechnologien), mitverantwortlicher Wissenschaftler für das Projekt Stromausfallbewusster byteadressierbarer virtueller nichtflüchtiger Speicher (PAVE). Mitglied im Schwerpunktprogramm 2378 (Resilience in Connected Worlds – Mastering Failures, Overload, Attacks, and the Unexpected (Resilient Worlds)), mitverantwortlicher Wissenschaftler für das Projekt Robuste, stromsparende eingebettete Datenübertragungsstationen (ResPECT). Lehre laufendes Semester Meinen Hobbies nachgehen… vergangenes Semester Meinen Hobbies nachgehen… Archiv Jahr Sommersemester Wintersemester 2002 BST BS VA ERGOO 2003 BST VS ERGOO MEDINF SP1 BS VA ERGOO MEDINF 2004 SOS1 VS ERGOO BS ERGOO 2005 SOS1 VS ERGOO BS EZS ERGOO 2006 SOS1 VS EZS2 ERGOO SPiC BS EZS ERGOO 2007 SOS1 VS EZS2 ERGOO Forschungsfreisemester 2008 BST VS EZS2 ERGOO VSBS SP BS EZS ERGOO 2009 BST VS EZL ERGOO VSBS SP BS EZS ERGOO VSBS 2010 SP BST EZL ERGOO VSBS SP BS EZS ERGOO VSBS 2011 SP BST EZL ERGOO VSBS SP BS EZS ERGOO VSBS 2012 SP BST KSS VEZS ERGOO VSBS KVBK Forschungsfreisemester 2013 SP BST KSS VEZS ERGOO VSBS KVBK SP EZS ERGOO 2014 SP BST KSS VEZS ERGOO KVBK SP CS EZS ERGOO KVBK 2015 SP BST KSS VEZS ERGOO SP CS EZS ERGOO AKSS 2016 SP1 BST VEZS ERGOO SP2 CS PASST ERGOO KVBK 2017 SP1 BST VEZS ERGOO Forschungsfreisemester 2018 SP1 BST VEZS ERGOO AKSS KVBK SP2 CS ERGOO 2019 SP1 BST ERGOO SP2 CS ERGOO 2020 SP1 ERGOO KVBK SP2 CS ERGOO 2021 SP1 ERGOO SP2 VEZS ERGOO 2022 SP1 BST ERGOO SP2 VEZS ERGOO 2023 ERGOO …im Ruhestand 😉 Publikationen 10 ausgewählte Arbeiten (Quelle UnivIS) Schmaus, Florian ; Pfeiffer, Nicolas ; Hönig, Timo ; Nolte, Jörg ; Schröder-Preikschat, Wolfgang: Nowa: A Wait-Free Continuation-Stealing Concurrency Platform. In: IEEE (Veranst.) : 2021 IEEE International Parallel and Distributed Processing Symposium (IPDPS) (35th IEEE International Parallel & Distributed Processing Symposium (IPDPS) Portland, Oregon, USA). 2021, S. nn. [doi>10.1109/IPDPS49936.2021.00044] (BibTeX) Schuster, Simon ; Wägemann, Peter ; Ulbrich, Peter ; Schröder-Preikschat, Wolfgang: Proving Real-Time Capability of Generic Operating Systems by System-Aware Timing Analysis. In: IEEE Computer Society (Veranst.) : In Proceedings of the 25th Real-Time and Embedded Technology and Applications Symposium (RTAS '19) (25th Real-Time and Embedded Technology and Applications Symposium (RTAS '19) Montreal 15.-18.04.2019). 2019, S. 0-0. [doi>10.1109/RTAS.2019.00034] (BibTeX) Wägemann, Peter ; Distler, Tobias ; Janker, Heiko ; Raffeck, Phillip ; Sieh, Volkmar ; Schröder-Preikschat, Wolfgang: Operating Energy-Neutral Real-Time Systems. In: ACM Transactions on Embedded Computing Systems 17 (2017), Nr. 1, S. 11:1-11:25[doi>10.1145/3078631] (BibTeX) Wägemann, Peter ; Distler, Tobias ; Hönig, Timo ; Janker, Heiko ; Kapitza, Rüdiger ; Schröder-Preikschat, Wolfgang: Worst-Case Energy Consumption Analysis for Energy-Constrained Embedded Systems. In: IEEE (Hrsg.) : Proceedings of the 27th Euromicro Conference on Real-Time Systems (ECRTS '15) (Euromicro Conference on Real-Time Systems Lund, Sweden July 7 - 10, 2015). 2015, S. 105-114. (BibTeX) Tartler, Reinhard ; Dietrich, Christian ; Sincero, Julio ; Schröder-Preikschat, Wolfgang ; Lohmann, Daniel: Static Analysis of Variability in System Software: The 90,000 #ifdefs Issue. In: USENIX Association (Hrsg.) : Proceedings of the 2014 USENIX Annual Technical Conference (USENIX 2014) (2014 USENIX ATC Philadelphia, PA, USA June 19-20, 2014). 2014, S. 421-432. - ISBN 978-1-931971-10-2 (BibTeX) Kapitza, Rüdiger ; Behl, Johannes ; Cachin, Christian ; Distler, Tobias ; Kuhnle, Simon ; Mohammadi, Seyed Vahid ; Schröder-Preikschat, Wolfgang ; Stengel, Klaus: CheapBFT: Resource-efficient Byzantine Fault Tolerance. In: European Chapter of ACM SIGOPS (Veranst.) : Proceedings of the EuroSys 2012 Conference (EuroSys '12) (EuroSys 2012 Bern 10-13 April). 2012, S. 295-308. [doi>10.1145/2168836.2168866] (BibTeX) Lohmann, Daniel ; Hofer, Wanja ; Schröder-Preikschat, Wolfgang ; Streicher, Jochen ; Spinczyk, Olaf: CiAO: An Aspect-Oriented Operating-System Family for Resource-Constrained Embedded Systems. In: USENIX Association (Hrsg.) : Proceedings of the 2009 USENIX Annual Technical Conference (USENIX 2009) (2009 USENIX Annual Technical Conference (USENIX 2009) San Diego, CA, USA June 2009). Berkeley, CA, USA : USENIX Association, 2009, S. 215-228. - ISBN 978-1-931971-68-3 (BibTeX) Hofer, Wanja ; Lohmann, Daniel ; Scheler, Fabian ; Schröder-Preikschat, Wolfgang: Sloth: Threads as Interrupts. In: Baker, Theodore P. (Hrsg.) : Proceedings of the 30th IEEE Real-Time Systems Symposium (RTSS 2009) (30th IEEE Real-Time Systems Symposium (RTSS 2009) Washington, D.C., USA December 2009). Los Alamitos, CA, USA : IEEE Computer Society, 2009, S. 204-213. - ISBN 978-0-7695-3875-4[doi>10.1109/RTSS.2009.18] (BibTeX) Cordsen, Jörg ; Garnatz, Thomas ; Gerischer, Anne ; Gubitoso, Marco Dimas ; Haack, Ute ; Sander, Michael ; Schröder-Preikschat, Wolfgang: Vote for Peace - Implementation and Performance of a Parallel Operating System. In: IEEE Concurrency 5 (1997), Nr. 2, S. 16-27 (BibTeX) Schröder-Preikschat, Wolfgang: PEACE - A Software Backplane for Parallel Computing. In: Parallel Computing 20 (1994), S. 1471-1485 (BibTeX) jahresweise (Quelle UnivIS) 2022 Herzog, Benedict ; Reif, Stefan ; Hügel, Fabian ; Schröder-Preikschat, Wolfgang ; Hönig, Timo: Bears: Building Energy-Aware Reconfigurable Systems. In: IEEE (Hrsg.) : Proceedings of the 2022 Brazilian Symposium on Computing Systems Engineering (SBESC '22) (Brazilian Symposium on Computing Systems Engineering Fortaleza, Brazil 21. - 24.11.2022). 2022, S. 1-8. (BibTeX) Bauer, Lars ; Henkel, Jörg ; Hönig, Timo ; Schröder-Preikschat, Wolfgang ; Eichler, Christian ; Jeferson, Gonzalez ; Herzog, Benedict ; Langer, Tobias ; Maier, Sebastian ; Rabenstein, Jonas ; Raffeck, Phillip ; Schmaus, Florian: Invasive Run-Time Support System (iRTSS). In: Teich, Jürgen ; Henkel, Jörg ; Herkersdorf, Andreas (Hrsg.) : Invasive Computing. Erlangen : FAU University Press, 2022, S. 291-315. - ISBN 978-3-96147-571-1[doi>10.25593/978-3-96147-571-1] (BibTeX) Herzog, Benedict ; Reif, Stefan ; Hemp, Judith ; Hönig, Timo ; Schröder-Preikschat, Wolfgang: Resource-Demand Estimation for Edge Tensor Processing Units. In: ACM Transactions on Embedded Computing Systems (Special Issue on Accelerating AI on the Edge) Volume 21 (2022), Nr. 5, S. 58:1-58:24[doi>10.1145/3520132] (BibTeX) Raffeck, Phillip ; Schröder-Preikschat, Wolfgang ; Ulbrich, Peter: Revisiting Migration Overheads in Real-Time Systems: One Look at Not-So-Uniform Platforms. In: Lohmann, Daniel ; Mancuso, Renato (Hrsg.) : Proceedings of the 16th Annual Workshop on Operating Systems Platforms for Embedded Real-Time Applications (OSPERT 2022 Modena). 2022, S. 41-48. (BibTeX) 2021 Schuster, Simon ; Wägemann, Peter ; Ulbrich, Peter ; Schröder-Preikschat, Wolfgang: Annotate Once - Analyze Anywhere: Context-Aware WCET Analysis by User-Defined Abstractions. In: Henkel, Jörg ; Liu, Xu (Hrsg.) : Proceedings of the 22nd ACM SIGPLAN/SIGBED International Conference on Languages, Compilers, Tools and Theory for Embedded Systems (LCTES21) (22nd ACM SIGPLAN/SIGBED International Conference on Languages, Compilers, Tools and Theory for Embedded Systems (LCTES21) Virtual Conference June 20-26, 2021). New York : ACM, 2021, S. 54-66. [doi>10.1145/3461648.3463847] (BibTeX) Gerhorst, Luis ; Herzog, Benedict ; Reif, Stefan ; Schröder-Preikschat, Wolfgang ; Hönig, Timo: AnyCall: Fast and Flexible System-Call Aggregation. In: ACM (Hrsg.) : Proceedings of the 11th Workshop on Programming Languages and Operating Systems (PLOS'21) (11th Workshop on Programming Languages and Operating Systems virtual 2021-10-25). 2021, S. 1-8. [doi>10.1145/3477113.3487267] (BibTeX) Herzog, Benedict ; Hügel, Fabian ; Reif, Stefan ; Hönig, Timo ; Schröder-Preikschat, Wolfgang: Automated Selection of Energy-efficient Operating System Configurations. In: ACM (Hrsg.) : Proceedings of the 2nd International Workshop on Energy-Efficient Learning at the Edge (WEEE'21) (2nd International Workshop on Energy-Efficient Learning at the Edge virtual 2021-06-28). 2021, S. 309-315. (BibTeX) Klaus, Tobias ; Becker, Matthias ; Schröder-Preikschat, Wolfgang ; Ulbrich, Peter: Constrained Data-Age with Job-Level Dependencies: How to Reconcile Tight Bounds and Overheads (Best Student Paper). In: IEEE (Veranst.) : Proceedings of the 27th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS'21) (27th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS'21) virtual May 18-21, 2021). 2021, S. 66-79. [doi>10.1109/RTAS52030.2021.00014] (BibTeX) Reif, Stefan ; Raffeck, Phillip ; Gerhorst, Luis ; Schröder-Preikschat, Wolfgang ; Hönig, Timo: Migration-Based Synchronization. In: IEEE (Hrsg.) : Proceedings of the 11th Brazilian Symposium on Computing Systems Engineering (11th Brazilian Symposium on Computing Systems Engineering online November 22-25, 2021). online : IEEE, 2021, S. 1  8. [doi>10.1109/SBESC53686.2021.9628358] (BibTeX) Schmaus, Florian ; Fischer, Florian ; Hönig, Timo ; Schröder-Preikschat, Wolfgang: Modern Concurrency Platforms Require Modern System-Call Techniques. Erlangen-Nürnberg : Friedrich-Alexander Universität. 2021 (CS-",
  "content_length": 378961,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:38"
}