{
  "name": "Wolfgang Thomas",
  "homepage": "https://www.lics.rwth-aachen.de/cms/LICS/Der-Lehrstuhl/Team/Dozierende/~ocwi/Wolfgang-Thomas/?allou=1",
  "status": "success",
  "content": "Wolfgang Thomas | LICS | RWTH Aachen University | DE Essays und Reden Publikationen Univ.-Prof. i. R. Dr. rer. nat. Wolfgang Thomas Lehrstuhl für Logik und Theorie diskreter Systeme (Informatik 7) Gebäude: E1, 1. Etage Raum: 4108b Ahornstraße 55 52074 Aachen Work Telefon: +49 241 80-21710 Work thomas@cs.rwth-aachen.de Forschungsinteressen Mein Hauptinteresse gilt der Entwicklung der Automatentheorie als ein Rahmenwerk zur Modellierung, Analyse, Verifikation und Synthese von Systemen. Dazu gehören Generalisierte Modelle von Automaten (über Bäumen, Bildern, relationalen Strukturen) Automaten über unendlichen Wörtern und Bäumen Beziehung zwischen Automaten und logischen Systemen Algorithmische Theorie unendlicher Spiele Unendliche Automaten und Anwendungen in der Verifikation von unendlichen Systemen Andere Interessen liegen in Fragen zur Geschichte und Methodik der Informatik. Publikationen Essays und Reden Ausgewählte Publikationen Publikationsliste bei DBLP Aktivitäten Sprecher des DFG-Graduiertenkollegs AlgoSyn (2006-2016) Sprecher des Fachbereichs \"Grundlagen der Informatik\" der GI (2008-2013) Vorsitzender des Senats der RWTH Aachen (2008-2012) Mitglied des Council der EATCS - European Association for Theoretical Computer Science (2003-2010) Mitglied im Herausgebergremium von Zeitschriften u. Konferenzserien Leibniz International Procedings in Informatics (LIPiCS) Logical Methods in Computer Science (2005-2012) RAIRO Theoretical Informatics and Applications (2000-2012) Discrete Mathematics and Theoretical Computer Science (1997-2012) ACM Transactions of Computational Logic (2000-2010) Theoretical Computer Science (1998-2006) Dekan der Fakultät Mathematik, Informatik und Naturwissenschaften (2004-2006) Prodekan der Fakultät Mathematik, Informatik und Naturwissenschaften (2002-2004) Sprecher der Fachgruppe Informatik, RWTH Aachen (2000-2002) Vorsitzender des DFG-Fachgutachterausschusses \"Informatik\" (2000-2004) Vertreter der Informatik der RWTH bei der IDEA-League (2001-2005) Curriculum Vitae 1947 geboren in Naumburg/Saale 1954-66 Schule/Gymnasium in Göttingen, Hannover, Celle 1966-68 Wehrdienst 1968-71 Studium der Mathematik, Physik, Philosophie an der Universität Freiburg 1971-72 M.Sc. Course in Mathematischer Logik, University of Bristol, England M.Sc. (University of Bristol) 1973-82 Wiss. Mitarbeiter an der Universität Freiburg 1975 Promotion zum Dr. rer. nat., Universität Freiburg 1980 Habilitation in Mathematik, Universität Freiburg 1982-89 Professor (C3) für Informatik, RWTH Aachen 1989-98 Professor (C4) für Informatik, Universität Kiel 1998- Professor (C4) für Informatik, RWTH Aachen (Emeritus 2016) 2005 Doctor honoris causa der École Normale Supérieure de Cachan 2006 Mitglied der Academia Europaea 2013 Doctor honoris causa der Université de Mons (Belgien) 2014 Fellow of the EATCS (European Association for Theoretical Computer Science) 2014 Fellow of Gesellschaft für Informatik (GI)",
  "content_length": 2943,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:37"
}