{
  "name": "Wolfgang Hesse",
  "homepage": "https://www.sosy-lab.org/people/hesse",
  "status": "success",
  "content": "Prof. Dr. Wolfgang Hesse, LMU Munich Prof. Dr. Wolfgang Hesse Software and Computational Systems Lab Department of Computer Science Ludwig-Maximilians-Universität München (LMU Munich) Oettingenstraße 67 80538 Munich (Germany) Office hoursBy appointment only E-Maillastname@pst.ifi.lmu.de Forschungsinteressen Modellierung in der Softwaretechnik, speziell Modellierung dynamischer Systeme Interdisziplinäre und gesellschaftliche Aspekte der Informatik Anschlussoptimierung in öffentlichen Verkehrsnetzen Musiktheorie Lehrveranstaltungen WS 2014/15: Seminar \"Modellierung dynamischer und adativer Systeme\" WS 2015/16: Seminar \"Modellierung dynamischer und adaptiver Systeme\" WS 2015/16 (mit Dr. Gerhard Apfelauer): \"Die Variation in der Musik\" (S. 29) WS 2016/17: Seminar \"Modellierung dynamischer und adaptiver Systeme\" WS 2016/17 (mit Dr. Gerhard Apfelauer): \"Musikalische Formen\" (S. 29) WS 2017/18: Seminar \"Modellierung dynamischer und adaptiver Systeme\" WS 2017/18 (mit Dr. Gerhard Apfelauer): \"Epochen und Stilelemente der Musik\" (S. 29) WS 2018/19: Seminar \"Modellierung dynamischer und adaptiver Systeme\" WS 2018/19 (mit Dr. Gerhard Apfelauer): \"Musikmetropole Wien um 1820 und 1920: die kreativen Zwanziger Jahr\" (S. 33) WS 2019/20: Seminar \"Modellierung dynamischer und adaptiver Systeme\" WS 2019/20 (mit Dr. Gerhard Apfelauer): \"Musikalische Querbezüge und Transformationen\" (S. 33/34) SS 2020 (mit Michael Leslie, Konzertpianist): \"Beethoven-Reflexionen\" (S. 4) WS 2020/21: Seminar \"Modellierung dynamischer und adaptiver Systeme\" WS 2021/22: Seminar \"Modellierung dynamischer und adaptiver Systeme\" WS 2021/22 (mit Michael Leslie, Konzertpianist): \"(Halb-)Vergessene Musikalische Schätze III (Seminar)\" (S. 34) Veröffentlichungen (Auszug) M. Bölker, M. Gutmann, W. Hesse (Hrsg): Menschenbilder und Metaphern im Informationszeitalter. LIT Verlag Münster/Berlin 2010 M. Bölker, M. Gutmann, W. Hesse (Hrsg): Information und Menschenbild. Ethics of Science and Technology Assessment. Springer 2010 A. Ruß, W. Hesse, D. Müller: Total computerisiert – Szenarien zur allgegenwärtigen Technik-Gesellschaft. In: M. Bölker, M. Gutmann, W. Hesse (Hrsg.):Information und Menschenbild. Ethics of Science and Technology Assessment. Springer 2010 W. Hesse: Stuttgart: Nullknoten ist möglich – Betriebskonzepte und Integraler Taktfahrplan in der Diskussion. In: Eisenbahn-Revue International, Heft 3/2011, S. 150-152 W. Hesse: Ontologie und Weltbezug. Informatik-Spektrum 37.4, pp. 298-307 (2014) W. Hesse, H. Engesser: Ontologie. Informatik-Spektrum 37.4, pp. 281-282 (2014) W. Hesse: Deutschland-Takt und BMVI-Zielfahrpläne: Chancen, Defizite und Lösungsvorschläge. In: Eisenbahn-Revue International, Heft 7/2019, S. 386-389, Minirex-Verlag, Luzern 2019 W. Hesse: Das Zerstörungspotential von Big Data und Künstlicher Intelligenz für die Demokratie. In: Wiegerling, K., Nerurkar, M., Wadephul, Ch. (Hrsg.): Data­fizierung und Big Data. Ethische, anthropologische und wissenschaftstheoreti­sche Perspektiven. Springer Fachmedien Wiesbaden 2020, S. 213-228 und: Informatik-Spektrum 5/2020, S. 339-346 Frühere Veröffentlichungen, Sonstiges siehe https://www.uni-marburg.de/fb12/arbeitsgruppen/alumni/hesse/",
  "content_length": 3201,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:23"
}