{
  "name": "Wolfgang Kunz",
  "homepage": "https://www.eit.uni-kl.de/eis/people/kunz",
  "status": "success",
  "content": "Prof. Dr.-Ing. Wolfgang Kunz - Fachbereich Elektrotechnik und Informationstechnik an der RPTU HauptnavigationInhalt Fachgebiet Entwurf Informationstechnischer Systeme (EIS) Building/room: 12-555 Tel:  (+49) (631) 205-2603  Fax: (+49) (631) 205-4782E-Mailextended CV Education / DegreesSeptember 26, 1996, Habilitation (Dr.rer.nat.habil.) in Computer Science, University of Potsdam, GermanyDecember 22, 1992, Doctoral degree (Dr.-Ing.), summa cum laude, in electrical engineering, University of Hannover, GermanyAugust 4, 1989, Master's degree (Dipl.-Ing.) in Electrical Engineering, University Fridericiana of Karlsruhe, Germany Positions Since November 2001 Professor at the Department of Electrical & Computer Engineering, University of KaiserslauternSept. 1998 to August 2001 Professor, Vice-Dean and Dean of the Dept. of Computer Science, Johann Wolfgang Goethe-University Frankfurt/MainAugust 1998 to December 1999 Chief Scientist, Verysys Inc. (part time appointment while being professor in Frankfurt)Summer 1995 and Summer 1996 Temporary appointments as Research Assistant Professor, Dept. of Computer Science,Texas A&M University, College Station, TX, USA.January 1997 to February 1998 Research scientist with Dept. of Computer Science, University of Potsdam.April 1993 to December 1996 Research scientist with Max-Planck-Society, Fault-Tolerant Computing Group (Prof. M. Gössel), at the University of Potsdam, Germany.October 1991 to March 1993 Research scientist with Institute for Theory of Electrical Engineering (Prof. J. Mucha), University of Hannover, Germany.September 1989 to September 1991 Research assistant and Ph.D. student at the Dept. of Electrical and Computer Engineering, University of Massachusetts, Amherst, USA AwardsIEEE Transactions on CAD Best Paper Award, IEEE Circuits and Systems Society, 1996Preis der Berlin-Brandenburgischen Akademie der Wissenschaften, 1996Gerhard-Hess Award, Deutsche Forschungsgemeinschaft (DFG), 1997Preis der Informationstechnischen Gesellschaft (ITG) 2005Fellow of the IEEE, 2006TU Kaiserslautern Distinguished Teaching Award, 2016JETTA Best Paper Award, 2018Member of Academia Europaea, 2022IEEE/ACM Design Automation Conference (DAC) Best Paper Award, 2022Intel Hardware Security Academic Award 2022 Professional activitiesMember of the Editorial Board of IEEE Transactions on Computers, since 2019Associate Editor for IEEE Transactions on Computer-Aided Design of Circuits and Systems, 2006 - 2015Associate Editor for ACM Transactions on Design Automation of Electronic Systems, 2011- 2015Member of Editorial Board for Journal VLSI Design, 2006 - 2015Associated editor for Journal of Electronic Testing: Theory and Applications (JETTA), 1996 – 2004TPC Member or Topic Chair in numerous national and international conferences, including ICCAD, DATE, ICCD, ATS, ASP-DAC, VLSI, IWLS, SASIMI, CHARME, FMCADMember of National Science Foundation (NSF) review panels, USAMember of GMM/ITG/GI Leitungsgremium Rechnergestützter Schaltungs- und Systementwurf, since 2001Head of the RSS Group 3 (Verification) in GI/ITG/GMM, 2001 – 2004Technical Director of national research projects on verification methodology of system-on-chips and automotive systems funded by BMBF",
  "content_length": 3223,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:28"
}