{
  "name": "Wolfgang W. Bein",
  "homepage": "http://web.cs.unlv.edu/bein",
  "status": "success",
  "content": "Wolfgang Bein, UNLV Wolfgang Bein Professor Department of Computer Science University of Nevada, Las Vegas 4505 S. Maryland Parkway Las Vegas, NV 89154-4019 Office: TBE B 381 (702) 895-1477 (702) 895 5222 (fax) wolfgang.bein unlv.edu Education and Previous Appointments Professor Bein holds a Ph.D. (Dr. rer. nat.) from the University of Osnabrueck, Germany. He has been on the faculty of Duke University, the University of New Mexico, the University of Texas at Dallas, and was on the technical staff of American Airlines, before joining the faculty at UNLV. At UNLV he is a Co-Director for the Center for Information Technology and Algorithms. Professor Bein also is a Kyoto University Visiting Professor. His Erdös number is 2. (Curriculum Vita (2018) Mastodon Citizenship: .) Research Dr. Bein's research program has a dual objective to pursue research on a broad range of algorithmic topics and to impact real-world issues by applying rigorous methods. Interests Algorithms models: on-line competitive algorithms, greedy algorithms, dynamic programming speed-up; combinatorial optimization: approximations and heuristics. Sensor networks and embeddings; multidimensional star networks, honeycomb meshes; fault tolerance; cloud computing. Algorithmic methods for power management, energy-efficient computing, and smart control for alternative energy. Smart City Traffic Management. Free, Libre and Open Source Software (FLOSS). Publications List of peer reviewed publications. National Science Foundation Online Algorithms and Information Technology, Award 0312093. Final report. Award IIA-1427584 (Current work). Power management, energy-efficient computing, and smart control for alternative energy. Select Collaborators Hiro Ito, The University of Electro-Communication, Tokyo. Alan Hoffman, T. J. Watson Research Center, IBM, Yorktown Heights. Mordecai Golin, Hong Kong University of Science and Technology, Hong Kong. Xin Han, The University of Hong Kong, Hong Kong. Hal Sudborough , University of Texas at Dallas, Richardson, TX. Rudolf Fleischer, German University of Technology in Oman. Rüdiger Reischuk, University of Lübeck, Germany. Matt Stallmann, North Carolina State University, Raleigh, NC. Jose R.Correa, Universidad Adolfo Ibanez, Chile. Lawrence Larmore, University of Nevada, Las Vegas, NV. John Noga, California Satate University, Northridge, CA. Leah Epstein , University of Haifa, Israel. Kazuo Iwama, Kyoto University, Japan. Shahram Latifi , University of Nevada, Las Vegas, NV. Peter Brucker, University of Osnabrück, Germany. Doina Bein, California State University, Fullerton. Stefan Pickl, University of the Federal Armed Forces Munich, Germany. Teaching See catalog Select Current Service Senator from the College of Engineering, Faculty Senate Member, Graduate College Awards Committee Chair, CS Accreditation Committee Chair, CS Colloquium Committee Moderator, TheoryNT Program Committees: ICDCS 2019, IEEE CCWC 2020, ICSOFT 2020, ITNG 2020.",
  "content_length": 2976,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:34"
}