{
  "name": "Won Hwa Kim",
  "homepage": "http://aimi.postech.ac.kr/members",
  "status": "success",
  "content": "Members | Medical Information Processing Professors Won Hwa Kim I am an Assistant Professor (2020 – 2022) Associate Professor (from March 2023) in Graduate School of Artificial Intelligence (GSAI) / Computer Science and Engineering (CSE) / Medical Science and Engineering (MED) at Pohang University of Science and Technology (POSTECH). Prior to joining POSTECH, I was an Assistant Professor at the University of Texas at Arlington (2018 – 2023, last 2 years on leave-of-absence), and was a Researcher in Data Science Team at NEC Labs., America (2017-2018). I obtained my Ph.D in Computer Science from University of Wisconsin – Madison in 2017 thanks to great support from Prof. Vikas Singh (advisor). I got a M.S. in Robotics from KAIST (2010) and a B.S. in Electrical Engineering from Sungkyunkwan University (2008), and I developed Hybrid Vehicles at Hyundai Motors Company in 2010-2011. Please visit my website for more details. Ilwoo Lyu I am an assistant professor of Computer Science and Engineering and Graduate School of Artificial Intelligence at Pohang University of Science and Technology (POSTECH) and an adjoint assistant professor of Computer Science at Vanderbilt University. Prior to joining POSTECH, I was an assistant professor of Computer Science and Engineering at UNIST (2021-2024) and a research assistant professor of Electrical Engineering and Computer Science at Vanderbilt University (2017-2021). I earned my PhD in Computer Science at University of North Carolina at Chapel Hill (2017) and MS (2011) & BS at KAIST (2009). Please see my website. Students (@POSTECH) Hyuna Cho 🏠GSAI, MS/Ph.D studenthyunacho B.E. in Computer Science and Engineering Jaeyoon Sim 🏠GSAI, MS/Ph.D studentsimjy98 B.S. in Convergence IT Engineering Minjae Jeong 🏠 GSAI, MS studentminjaetidtid B.S. in Electrical Engineering and Computer Science Sehyoung CheongCSE, MS/Ph.D studentsehyoung B.S. in Life ScienceB.S. in Computer Science and Engineering Minjae Lee CSE, MS/Ph.D studentlalswo010 B.S. in Computer Science and Engineering Donghyun LeeGSAI, MS studentdongtak B.S. in MathmaticsB.S. in Big Data Soojin Hwang GSAI, MS studentsoojin0622 B.S. in Computer Science and Engineering Jaejin Lee GSAI, MS studentjlee4923 B.S. in Computer Science and Engineering Jihwan Park GSAI, MS/Ph.D studentpjh58110 B.S. in Computer Science and Engineering Changmin Seo GSAI, MS studentcmseo B.S. in Computer Science Jiwon Son GSAI, MS studentjiwonson B.S. in Computer Science Yuyeon KimGSAI, MS studentyuyeonkim B.S. in Computer Science Seunghun Baek 🏠GSAI, MS/Ph.D studenthabaek4 B.S. in Computer Science and Engineering Joonhyuk Park 🏠CSE, MS/Ph.D studentpjh1023 B.S. in Computer Science and Engineering Yechan Hwang 🏠CSE, MS/Ph.D studentyechan99 B.S. in Computer Science and Engineering Sungwoo HurGSAI, Ph.D studenthursungwoo M.S. in Industrial Engineering B.S. in Industrial Engineering Sungyoon Jung CSE, MS studentsyjung B.S. in Computer Science and Engineering Hayoung Ahn GSAI, MS studentahnha B.S. in Computer Science and Engineering B.S. in Statistics Seungjoo Lee CSE, MS studentseungjoo612 B.S. in Computer Science and Engineering Hoseok Lee CSE, MS/Ph.D studenthslee0608 B.S. in Computer Science and Engineering Jongmin Kim GSAI, MS studentjongminkim B.S. in Computer Science Seunghwan Lee 🏠CSE, MS/Ph.D studentshwan B.S. in Computer ScienceB.S. in Mechanical Engineering Kangmin KimCSE, MS studentkangminkim B.S. in Computer Science Alumni Yujee Song (MS in GSAI@POSTECH, 2025) – AI Researcher at Samsung Xin Ma (PhD in CSE@UTA, 2024) – Senior Data Scientist at Walmart/Sam’s Club Research Sooyeon Jeon (MS in GSAI@POSTECH, 2024) Yubin Han (MS in GSAI@POSTECH, 2024) – Researcher at Kia Ellen Jieun Oh (MS in GSAI@POSTECH, 2023) – Researcher at LG CTO Injun Choi (MS in GSAI@POSTECH, 2023) – AI Researcher at Samsung Fan Yang (PhD in CSE@UTA, 2022) – Researcher at GenenTech Vivek Patel (BS in CSE@UTA with Honors College, 2020) – Software Developer at US Bank Debapriya Benergee (MS in CSE@UTA, 2020) – Data Scientist at Master Card Anna Philips (MS in CSE@UTA, 2019) – Software Engineer at Amazon (previously Software Developter at MatMaCorp)",
  "content_length": 4149,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:37"
}