{
  "name": "Wonyeol Lee 0001",
  "homepage": "https://wonyeol.github.io",
  "status": "success",
  "content": "Wonyeol Lee Wonyeol Lee Assistant Professor, Computer Science, POSTECH Foundations of Programming & Computing Lab wonyeol.lee.cs@gmail.com | CV I am actively recruiting motivated students, including undergraduate interns (과제연구, 연구참여 등). Ideal students have a background in programming languages / mathematics, and an interest in programs / computations. If you are interested, please email me. I would be happy to chat! Education 2014–2023: PhD in Computer Science, Stanford University (Advisor: Alex Aiken) 2010–2014: BS in Computer Science and Mathematics, POSTECH Employment 2024–Present: Assistant Professor, POSTECH 2023–2024: Postdoctoral Associate, Carnegie Mellon University (Host: Feras Saad) 2017–2020: Researcher, KAIST (Host: Hongseok Yang) 2017: Research Intern, Microsoft Research India 2016: Research Intern, Microsoft Research Redmond Research Areas Programming Languages Machine Learning Continuous Computations Research Overview I aim to make foundational software more reliable and scalable. To this end, I pursue the following directions: Focus on fundamental programs and computations across diverse areas (e.g., machine learning, scientific computing). Prove their correctness, improve their efficiency, and understand their fundamental limits. For more details, see my group webpage and overview slides. Publications Optimising Density Computations in Probabilistic Programs via Automatic Loop Vectorisation Sangho Lim, Hyoungjin Lim, Wonyeol Lee, Xavier Rival, Hongseok Yang POPL 2026 (ACM Symposium on Principles of Programming Languages) [포스텍 네 번째 POPL 논문] [paper | code] Floating-Point Neural Networks Are Provably Robust Universal Approximators Geonho Hwang*, Wonyeol Lee*, Yeachan Park, Sejun Park, Feras Saad CAV 2025 (International Conference on Computer Aided Verification) [포스텍 첫 번째 CAV 정규논문] [paper | slides | code] Floating-Point Neural Networks Can Represent Almost All Floating-Point Functions Geonho Hwang, Yeachan Park, Wonyeol Lee, Sejun Park ICML 2025 (International Conference on Machine Learning) [paper] Random Variate Generation with Formal Guarantees Feras Saad, Wonyeol Lee PLDI 2025 (ACM Conference on Programming Language Design and Implementation) [포스텍 첫 번째 PLDI 논문] [paper | slides | video | code] Semantics of Integrating and Differentiating Singularities Jesse Michel, Wonyeol Lee†, Hongseok Yang PLDI 2025 (ACM Conference on Programming Language Design and Implementation) [포스텍 첫 번째 PLDI 논문] [paper | slides | video | code] What Does Automatic Differentiation Compute for Neural Networks? Sejun Park, Sanghyuk Chun, Wonyeol Lee ICLR 2024 (Spotlight) (International Conference on Learning Representations) [paper | code] Expressive Power of ReLU and Step Networks under Floating-Point Operations Yeachan Park, Geonho Hwang, Wonyeol Lee, Sejun Park Neural Networks, 2024 [paper] Reasoning About Floating Point in Real-World Systems Wonyeol Lee PhD Dissertation, 2023 [paper | slides] On the Correctness of Automatic Differentiation for Neural Networks with Machine-Representable Parameters Wonyeol Lee, Sejun Park, Alex Aiken ICML 2023 (International Conference on Machine Learning) [paper | slides] Training with Mixed-Precision Floating-Point Assignments Wonyeol Lee, Rahul Sharma, Alex Aiken TMLR, 2023 (Transactions on Machine Learning Research) [paper | code] Smoothness Analysis for Probabilistic Programs with Application to Optimised Variational Inference Wonyeol Lee, Xavier Rival, Hongseok Yang POPL 2023 (ACM Symposium on Principles of Programming Languages) [paper | slides | video | code] On Correctness of Automatic Differentiation for Non-Differentiable Functions Wonyeol Lee, Hangyeol Yu, Xavier Rival, Hongseok Yang NeurIPS 2020 (Spotlight) (Annual Conference on Neural Information Processing Systems) [paper | slides | video] Differentiable Algorithm for Marginalising Changepoints Hyoungjin Lim, Gwonsoo Che, Wonyeol Lee, Hongseok Yang AAAI 2020 (AAAI Conference on Artificial Intelligence) [paper] Towards Verified Stochastic Variational Inference for Probabilistic Programs Wonyeol Lee, Hangyeol Yu, Xavier Rival, Hongseok Yang POPL 2020 (ACM Symposium on Principles of Programming Languages) [카이스트 세 번째 POPL 논문] [paper | slides | video | code] Reparameterization Gradient for Non-Differentiable Models Wonyeol Lee, Hangyeol Yu, Hongseok Yang NeurIPS 2018 (Annual Conference on Neural Information Processing Systems) [paper | slides | code] On Automatically Proving the Correctness of math.h Implementations Wonyeol Lee, Rahul Sharma, Alex Aiken POPL 2018 (ACM Symposium on Principles of Programming Languages) [paper | slides (short) | video] Verifying Bit-Manipulations of Floating-Point Wonyeol Lee, Rahul Sharma, Alex Aiken PLDI 2016 (ACM Conference on Programming Language Design and Implementation) [paper | slides | video] A Proof System for Separation Logic with Magic Wand Wonyeol Lee, Sungwoo Park POPL 2014 (ACM Symposium on Principles of Programming Languages) [포스텍 두 번째 POPL 논문] [paper] CT-IC: Continuously Activated and Time-Restricted Independent Cascade Model for Viral Marketing Wonyeol Lee, Jinha Kim, Hwanjo Yu ICDM 2012 (IEEE International Conference on Data Mining) [paper | journal | slides] Edge Detection Using Morphological Amoebas in Noisy Images Wonyeol Lee, Seyun Kim, Youngwoo Kim, Jaeyoung Lim, Dong Hoon Lim ICIP 2009 (IEEE International Conference on Image Processing) [paper | journal] Services Program Committee: POPL (2026) Artifact Evaluation Committee: POPL (2020), OOPSLA (2024) External Reviewer: POPL (2025, 2022), PLDI (2023), CAV (2019), ESOP (2020) Reviewer: NeurIPS (2025, 2022, 2021), ICML (2024, 2023, 2022) Teaching CSED490: Continuous Computations (Fall 2026, Spring 2025) CSED321: Programming Languages (Spring 2026) CSED331: Algorithms (Fall 2025) trips | last updated: 11/2025",
  "content_length": 5800,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:42"
}