{
  "name": "Woo Chaw Seng",
  "homepage": "https://umexpert.um.edu.my/cswoo",
  "status": "success",
  "content": "UMEXPERT - DR. WOO CHAW SENG DR. WOO CHAW SENG Department of Artificial Intelligence Faculty of Computer Science and Information Technology cswooum.edu.my View CV View 1-Page CV Publons Scopus Link Biography Woo Chaw Seng completed his B.Comp.Sc. and M.Comp.Sc. at the University of Malaya(UM) in 1996 and 1999 respectively. He joined the Faculty of Computer Science and Information Technology at UM in 1999 as a lecturer. A SIRIM patent was granted out of his Masters thesis. Serving as a fellow in the 5th Residential College from 2000 to 2003 provided him lots of management skills and softskills. He received a fully financed Study Leave Award from UM to study PhD at QUT Australia in 2004-2006. UM appointed him to serve as Principal of the 1st Residential College from 2008 to 2012. The university management also appointed him to serve as Head of Artificial Intelligence Department in his faculty from 2009 to 2011. He was awarded a fully financed 9-month sabbatical leave in 2012. Dr Woo has been actively doing research, supervising postgraduates, managing research grants, attending workshops/seminars, and publishing in conferences and journals. His research interests include image processing, computer security, and mobile computing. Hide Collaborator aznulqalid liyanashuib liew.wei.shiung.phd erma zati limck tehyw badrul mawpin sameem cs.chan ckloo.um View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Last 3 Projects Project Title Progress Status Digital Content Development And Virtual Ceramic Museum Experience end Content Classification for Short Video Rating Using Machine Learning end This information is generated from Research Grant Management System View all projects Latest Publications View All Article in Academic Journals Book Chapter in book 2021 A survey on video content rating: taxonomy, challenges and open issues 2020 A survey on video content rating: Taxonomy, Challenges and Open Issues 2017 Practical Application of RSA based on PRNG Method For Cryptography Application (under review) 2017 An improved genetic-fuzzy system for classification and data analysis 2007 Digital image watermarking methods for copyright protection and authentication 2002 Pengenalan Kepada Sistem Pengendalian 2001 Pengenalan kepada Sistem Pengendalian\\\" 2014 Blood Cell Image Retrieval System Using Color, Shape and Bag of Words 2006 Geometric Invariant Domain for Image Watermarking. 2005 System Architecture Analysis of a Hybrid Watermarking Method",
  "content_length": 2647,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:44"
}