{
  "name": "Woongki Baek",
  "homepage": "https://sites.google.com/site/woongkibaek",
  "status": "success",
  "content": "Woongki BaekSearch this siteEmbedded FilesSkip to main contentSkip to navigationWoongki BaekProfessorAffiliations: ISSL, CSE, Graduate School of AI, UNISTE-mail: wbaek [at] unist dot ac dot krTel: +82-52-217-2143Office: Rm. 601-5, Bldg. 106I am a Professor in the Department of Computer Science and Engineering and the Graduate School of Artificial Intelligence at Ulsan National Institute of Science and Technology (UNIST). I lead the Intelligent System Software Lab. (ISSL) at UNIST and mainly work in the areas of system software. My current research interests are in (1) system software for high-performance and efficient machine learning, (2) machine learning-augmented system software, (3) scalable parallel and distributed computing, (4) system software for large-scale and emerging memory systems, and (5) computer systems security. I received a Ph.D. in Electrical Engineering from Stanford University under the supervision of Professor Christos Kozyrakis (advisor) and Professor Kunle Olukotun (co-advisor). I received B.S. and M.S. degrees from Seoul National University and graduated from Seoul Science High School. Prior to joining UNIST, I worked as a software engineer at Microsoft and as a senior researcher at ETRI.Research opportunities: We have fully-funded research positions and are actively looking for brilliant graduate students, undergraduate students, and postdocs. Please do not hesitate to contact us if you are interested in conducting cutting-edge system software research. If you want to join our lab as a graduate student, you can apply to either the Department of CSE or the Graduate School of AI at UNIST.Latest NewsOctober 2025: Prof. Baek is invited to serve on the program committee for ISCA 2026.May 2025: Prof. Baek is invited to serve on the program committee for HPCA 2026.May 2025: Prof. Baek is invited to serve on the program committee for Bench 2025.April 2025: Professors (including Prof. Baek) in the systems research group in CSE and EE at UNIST have been awarded a research grant. Our research on system software support for Spiking Neural Networks (SNNs) will be funded by Institute of Information & communications Technology Planning & Evaluation (IITP) for 4 years (from 2025 to 2028, 6.72B KRW).March 2025: Prof. Baek is invited to serve on the external review committee for MICRO 2025 as a Light PC member.October 2024: Prof. Baek is invited to serve on the program committee for ISCA 2025 as a Light PC member.June 2024: Our paper entitled \"Activation Sequence Caching: High-Throughput and Memory-Efficient Generative Inference with a Single GPU\" has been accepted to PACT 2024. This is collaborative work with Samsung Advanced Institute of Technology (SAIT).June 2024: Prof. Baek has been awarded a research grant by Samsung Advanced Institute of Technology (SAIT).June 2024: Prof. Baek is invited to serve on the program committee for Bench 2024.Archived newsPublicationsSowoong Kim, Eunyeong Sim, Youngsam Shin, YeonGon Cho, and Woongki Baek, “Activation Sequence Caching: High-Throughput and Memory-Efficient Generative Inference with a Single GPU,” in the Proceedings of the 33rd International Conference on Parallel Architectures and Compilation Techniques (PACT), Oct. 2024.Myeonggyun Han, Eunseong Park, Youngsam Shin, Deok-Jae Oh, YeonGon Cho, and Woongki Baek, “COSMOS: Coordinated Management of Cores, Memory, and Compressed Memory Swap for QoS-Aware and Efficient Workload Consolidation for Memory-Intensive Applications,” in IEEE Access, 2023.Sowoong Kim, Myeonggyun Han, and Woongki Baek, “MARF: A Memory-Aware CLFLUSH-Based Intra- and Inter-CPU Side-Channel Attack,” in the Proceedings of the 28th European Symposium on Research in Computer Security (ESORICS), Sep. 2023.Myeonggyun Han and Woongki Baek, “SDRP: Safe, Efficient, and SLO-Aware Workload Consolidation through Secure and Dynamic Resource Partitioning,” in the IEEE Transactions on Services Computing (TSC), July-Aug., 2022.Sowoong Kim, Myeonggyun Han, and Woongki Baek, “DPrime+DAbort: A High-Precision and Timer-Free Directory-Based Side-Channel Attack in Non-Inclusive Cache Hierarchies using Intel TSX,” in the Proceedings of the 28th IEEE International Symposium on High-Performance Computer Architecture (HPCA), Apr. 2022.Myeonggyun Han and Woongki Baek, “HERTI: a Reinforcement Learning-Augmented System for Efficient Real-Time Inference on Heterogeneous Embedded Systems,” in the Proceedings of the 30th International Conference on Parallel Architectures and Compilation Techniques (PACT), Sep. 2021.Jinsu Park, Seongbeom Park, Myeonggyun Han, and Woongki Baek, “PALM: Progress- and Locality-Aware Adaptive Task Migration for Efficient Thread Packing,” in the Proceedings of the 35th IEEE International Parallel and Distributed Processing Symposium (IPDPS), May 2021.Myeonggyun Han, Jinsu Park, and Woongki Baek, “Design and Implementation of a Criticality- and Heterogeneity-Aware Runtime System for Task-Parallel Applications,” in the IEEE Transactions on Parallel and Distributed Systems (TPDS), 2021.Myeonggyun Han, Jihoon Hyun, Seongbeom Park, and Woongki Baek, “Hotness- and Lifetime-Aware Data Placement and Migration for High-Performance Deep Learning on Heterogeneous Memory Systems,” in the IEEE Transactions on Computers (TC), 2020.Myeonggyun Han, Jihoon Hyun, Seongbeom Park, Jinsu Park, and Woongki Baek, “MOSAIC: Heterogeneity-, Communication-, and Constraint-Aware Model Slicing and Execution for Accurate and Efficient Inference,” in the Proceedings of the 28th International Conference on Parallel Architectures and Compilation Techniques (PACT), Sep. 2019.Jinsu Park, Seongbeom Park, Myeonggyun Han, and Woongki Baek, “POSTER: The Performance Impact of Thread Packing on Synchronization-Intensive Applications,” in the Proceedings of the 28th International Conference on Parallel Architectures and Compilation Techniques (PACT), Sep. 2019 (Poster).Jinsu Park, Seongbeom Park, and Woongki Baek, “CoPart: Coordinated Partitioning of Last-Level Cache and Memory Bandwidth for Fairness-Aware Workload Consolidation on Commodity Servers,” in the Proceedings of the 14th European Conference on Computer Systems (EuroSys), Mar. 2019.Jinsu Park and Woongki Baek, “Analyzing and Optimizing the Performance and Energy Efficiency of Transactional Scientific Applications on Large-Scale NUMA Systems with HTM Support,” in the Journal of Parallel and Distributed Computing (JPDC), 2019.Seontae Kim, Nguyen Pham, Woongki Baek, and Young-ri Choi, “Holistic VM Placement for Distributed Parallel Applications in Heterogeneous Clusters,” in the IEEE Transactions on Services Computing (TSC), 2019.Kyu Yeun Kim, Jinsu Park, and Woongki Baek, “Improving the Performance and Energy Efficiency of GPGPU Computing through Integrated Adaptive Cache Management,” in the IEEE Transactions on Parallel and Distributed Systems (TPDS), 2019.Jinsu Park, Seongbeom Park, Myeonggyun Han, Jihoon Hyun, and Woongki Baek, “HyPart: A Hybrid Technique for Practical Memory Bandwidth Partitioning on Commodity Servers,” in the Proceedings of the 27th International Conference on Parallel Architectures and Compilation Techniques (PACT), Nov. 2018.Kyu Yeun Kim and Woongki Baek, “BLPP: Improving the Performance of GPGPUs with Heterogeneous Memory through Bandwidth- and Latency-Aware Page Placement,” in the Proceedings of the 36th IEEE International Conference on Computer Design (ICCD), Oct. 2018.Jihoon Hyun, Jinsu Park, Kyu Yeun Kim, Seongdae Yu, and Woongki Baek, “CEML: a Coordinated Runtime System for Efficient Machine Learning on Heterogeneous Computing Systems,” in the Proceedings of the 24th International European Conference on Parallel and Distributed Computing (Euro-Par), Aug. 2018.Jinsu Park and Woongki Baek, “Quantifying the Performance and Energy-Efficiency Impact of Hardware Transactional Memory on Scientific Applications on Large-Scale NUMA Systems,” in the Proceedings of the 32nd IEEE International Parallel and Distributed Processing Symposium (IPDPS), May 2018.Myeonggyun Han, Seongdae Yu, and Woongki Baek, “Secure and Dynamic Core and Cache Partitioning for Safe and Efficient Server Consolidation,” in the Proceedings of the 18th IEEE/ACM International Symposium on Cluster, Cloud, and Grid Computing (CCGrid), May 2018 (selected as a Best Paper Finalist).Jinsu Park, Seongbeom Park, and Woongki Baek, “RPPC: a Holistic Runtime System for Maximizing Performance under Power Capping,” in the Proceedings of the 18th IEEE/ACM International Symposium on Cluster, Cloud, and Grid Computing (CCGrid), May 2018.Seongdae Yu, Seongbeom Park, and Woongki Baek, “Design and Implementation of Bandwidth-Aware Memory Placement and Migration Policies for Heterogeneous Memory Systems,” in the Proceedings of the 31st International Conference on Supercomputing (ICS), Jun. 2017.Seontae Kim, Nguyen Pham, Woongki Baek, and Young-ri Choi, “Machine Learning-Based Performance Estimation for Distributed Parallel Applications in Virtualized Heterogeneous Clusters,” in the Proceedings of 37th IEEE International Conference on Distributed Computing Systems (ICDCS), Jun. 2017 (Poster).Jihye Seo, Wook-Hee Kim, Woongki Baek, Beomseok Nam, and Sam H. Noh, “Failure-Atomic Slotted Paging for Persistent Memory,” in the Proceedings of the 22nd International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), Apr. 2017.Myeonggyun Han, Jinsu Park, and Woongki Baek, “CHRT: a Criticality- and Heterogeneity-Aware Runtime System for Task-Parallel Applications,” in the Proceedings of the 2017 Design, Automation & Test in Europe Conference & Exhibition (DATE), Mar. 2017.Kyu Yeun Kim, Jinsu Park, and Woongki Baek, “IACM: Integrated Adaptive Cache Management for High-Performance and Energy-Efficient GPGPU Computing,” in the Proceedings of the 34th IEEE International Conference on Computer Design (ICCD), Oct. 2016.Jinsu Park, Eunbi Cho, and Woongki Baek, “RMC: an Integrated Runtime System for Adaptive Many-Core Computing,” in ",
  "content_length": 17279,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:45"
}