{
  "name": "Wouter Swierstra",
  "homepage": "http://www.staff.science.uu.nl/~swier004",
  "status": "success",
  "content": "About · Wouter Swierstra Wouter Swierstra Department of Information and Computing Sciences o.v.v. Buys Ballot Gebouw Winthontlaan 30C 3526 KV Utrecht The Netherlands w.s.swierstra {at} uu.nl © 2025. All rights reserved. About I am an universitair hoofddocent (roughly equivalent to associate professor) in the Software Technology Group of Utrecht University. Brief bio After studying Mathematics and Computer Science at the University of Utrecht, I did my PhD under supervision of Thorsten Altenkirch at the University of Nottingham's Functional Programming Lab. I worked as a post-doc at Chalmers University of Technology, before moving back to the Netherlands to work at Vector Fabrics, a high-tech startup that used functional programming to facilitate the design of embedded systems. After this brief stint in industry, I returned to academia as a postdoc in Foundations Group at the Radboud University Nijmegen. Recent publications A Layered Certifying Compiler Architecture [bib] Jacco O.G. Krijnen, Wouter Swierstra, Manuel Chakravarty, Joris Dral, and Gabriele Keller. FUNARCH 2025. First-Order Laziness [bib] Anton Lorenzen, Daan Leijen, Wouter Swierstra and Sam Lindley. ICFP 2025. Towards type-directed compiler calculation [bib] Wouter Swierstra. JFP, vol 34, 2025. Program logics for ledgers [bib] Orestis Melkonian, Wouter Swierstra and James Chapman. FMBC 2025. On the Correctness of Barron and Strachey’s Cartesian Product Function [bib] Wouter Swierstra and Jason Hemann. TFP 2025. The Functional Essence of Imperative Binary Search Trees [bib] Anton Lorenzen, Daan Leijen, Wouter Swierstra and Sam Lindley. PLDI 2024. More publications... Recent talks Programming with dependent types: beyond evaluating the simply typed lambda calculus IFL invited talk. Nijmegen, the Netherlands. The functional essence of imperative binary search trees IFIP WG 2.8. Utrecht, the Netherlands. A correct by construction conversion to combinators IFIP WG 2.8. Utrecht, the Netherlands. The functional essence of imperative binary search trees IFIP WG 2.1. Neustadt an der Weinstraße, Germany. A well-known representation of monoids and its application to the function “vector reverse” ICFP. Remote presentation. More talks...",
  "content_length": 2226,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:55"
}