{
  "name": "Wray L. Buntine",
  "homepage": "https://bayesian-models.org",
  "status": "success",
  "content": "Bayesian Models | Insights into components of prior research and aspects of latent academia Bayesian Models Insights into components of prior research and aspects of latent academia Wray Buntine Feeling relaxed at the end of a recent holiday! Some stuff on Google Scholar, Semantic Scholar, DBLP, ORCIDResearch Gate, Github (wbuntine), Twitter (wraylb) and Monash page and Vin Uni page Further Subject Categories: artificial intelligenceconferencedata scienceresultssoftwarestudentstalkstheoryuniversity Other Information: Candidate research students find information here, and details of my students.Software I previously managed is up on MLOSS and Github,  though not actively maintained now I am a professor.I love cooking and am a health and food aficionado:  see my thoughts on health living.I give various talks, though have been limited in travel in the past decade and a half due to family.See my Community Service page for conference and tutorial activity.  As a member of the ACML Steering Committee, the Asia-Pacific Machine Learning community is more of a focus for me.I used to be at NICTA in Canberra (since absorbed into CSIRO and called Data61), HIIT in Helsinki, and even time at UC Berkeley, Google, and NASA, where I left a trail of software and reports. About my blog: Blog entries are found at Recent Posts on the right.Use the Categories at the right to get recent papers, slides for talks, etc.This is a back-dated blog, so some entries at time of relevance rather than time of write-up. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook One comment […] Simple unsupervised learning by Wray Buntine [slides]. […] by SEAMLS 2019 Highlights - Elastic AI July 25, 2019 at 2:19 pm Reply Leave a comment Cancel reply Δ Wray Buntine wraylb Professor at Vin University in Hanoi, Director of Computer Science Programs. Recently Professor in Machine Learning at Dept. Data Science and AI, Monash University in Melbourne. I used to maintain software on GitHub, but work on applying Bayesian methods to machine learning and deep learning with lots of great research students and colleagues. View Full Profile → Recent Posts KDD Workshop on Programming Language Processing August 17, 2021 COVID-19 Missives July 21, 2020 Online conferences this year April 11, 2020 Machine Learning Research Tutorials March 8, 2020 Categories artificial intelligence conference data science results software students talks theory university Archives August 2021 July 2020 April 2020 March 2020 February 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 December 2018 October 2018 September 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 November 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 November 2016 July 2016 May 2016 April 2016 March 2016 December 2015 November 2015 October 2015 August 2015 July 2015 June 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 June 2014 February 2014 January 2014 November 2013 July 2013 Blog at WordPress.com. Entries (RSS) and Comments (RSS). Subscribe Subscribed Bayesian Models Sign me up Already have a WordPress.com account? Log in now. Bayesian Models Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 3531,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:50"
}