{
  "name": "Wu-chi Feng",
  "homepage": "http://web.cecs.pdx.edu/~wuchi",
  "status": "success",
  "content": "Wu-chi Feng Home Page Wu-chi Feng Chair and professor, Computer Science Past Administrative Roles Special Advisor to the Provost on Strategic Initiatives, Office of Academic Affairs (2022-2023) Interim Dean, Maseeh College of Engineering and Computer Science (2021-2022) Associate Dean for Research, Maseeh College of Engineering and Computer Science (2020-2021) Chair, Computer Science Department (2007-2010, 2016-2019) Brief Bio: I am a Professor in the Department of Computer Science and am a member of the Intel Systems and Networking Group. Before joining PSU in 2004, I was an Associate Professor at the OGI School of Science and Engineering at OHSU (2001-2004) and an Assistant Professor at The Ohio State University (1996-2001). I received my M.S. and Ph.D. degrees from the University of Michigan in Computer Science and Engineering. I received my B.S. degree from the Pennsylvania State University in Computer Engineering Research My research interests include: Multimedia systems Video streaming protocols Video compression systems Scalable and adaptable video distribution infrastructures I have a number of publications that deal with a number of topics including video streaming and networking. My publications My Ph.D. thesis: Video-On-Demand Services: Efficient Transportation and Decompression of Variable Bit Rate Video [Click for PDF] [Click for Table of Contents] Click here to see the book that I've written on buffering techniques for digital video: Buffering Techniques for Delivery of Compressed Video in Video-on-Demand Systems , Springer, 1997. Teaching I generally teach the following courses: CS 201 - Computer Systems Programming CS 305 - Social, Ethical, and Legal Implications of Computing CS 348U - Digital Media, Technology, and Society (Junior Cluster Course) CS 430P/530 - Internet, Web, and Cloud Systems CS 490/590 - Introduction to Multimedia Computing and Networking CS 410/510 - Advanced Topics in Multimedia Systems I have also taught Intro. to Computer Networking and Intro. to Operating Systems, but not recently. Recent External Service Steering Committee Chair - Multimedia Systems Conference Series (2010-2020) Technical Steering Committee Chair - International Multimedia Telecommunications Consortium (2012-2015) An Editor for the Multimedia Systems Journal (2004 - 2016) Program Committee Member – International Workshop on Network and Operating Systems Support for Digital Audio and Video 2022 (NOSSDAV '22) Program Committee Member – ACM Multimedia Systems Conference 2022 Program Committee Member – International Workshop on Network and Operating Systems Support for Digital Audio and Video 2021 (NOSSDAV '21) Program Committee Member – ACM Multimedia Systems Conference 2021 Program Committee Member – International Workshop on Network and Operating Systems Support for Digital Audio and Video 2020 (NOSSDAV '20) Program Committee Member – ACM Multimedia Systems Conference 2020 Program Committee Member – 29th International Workshop on Network and Operating Systems Support for Digital Audio and Video 2019 (NOSSDAV '19) Program Committee Member – ACM Multimedia Systems Conference 2019 Program Committee Member – 28th International Workshop on Network and Operating Systems Support for Digital Audio and Video 2018 (NOSSDAV '18) Program Committee Member – ACM Multimedia Systems Conference 2018 Program Committee - ACM Multimedia Conference, 2017 Program Committee Member – 27th International Workshop on Network and Operating Systems Support for Digital Audio and Video 2017 (NOSSDAV '17) Program Committee Member – ACM Multimedia Systems Conference 2017 Program Committee Co-Chair – IEEE International Conference on Distributed Computing Systems (ICDCS) 2016 Program Committee Member – 26th International Workshop on Network and Operating Systems Support for Digital Audio and Video 2016 (NOSSDAV '16) Program Committee Member – ACM Multimedia Systems Conference 2016 Program Committee Track Co-chair (Systems and Middleware) - ACM Multimedia Conference, October 2015 Program Committee Co-chair - IEEE/ACM International Symposium on Quality of Service, June 2015 Program Committee Member - International Packet Video Workshop, May/June 2015 Program Committee Co-chair - 25th ACM International Workshop on Network and Operating Systems Support for Digital Audio and Video 2015 Program Committee Co-Chair - ACM Multimedia Systems 2015 Program Committee Member - Mobile Video 2014 Program Committee Member - 24th ACM International Workshop on Network and Operating Systems Support for Digital Audio and Video 2014 Program Committee - ACM Multimedia Systems 2014 Click here for a relatively complete list of my conference service activities. Awards USATF Oregon Association Youth Coach of the Year Award, 2013 [Facebook Blurb] Ohio State University College of Engineering Lumley Research Accomplishment Award, 2001 Ohio State University College of Engineering Annual Research Accomplishment Award, 2000 National Science Foundation - Early CAREER Award, 1999 Ameritech Faculty Fellow Award, 1998-1999 Honorable Mention American Society for Engineering Education Outstanding Graduate Student Instructional Assistant 1995 Honorable Mention for Outstanding EECS Teaching Assistant, 1993 Outstanding EECS Teaching Assistant, 1991 IEEE Computer Society’s Richard E. Merwin Service Scholarship, 1990 William Barnak Outstanding Senior Award, Penn State University, 1990 National Engineering Consortium’s Everitt Student Award of Excellence, 1990 Contact Info: wuchi@cs.pdx.edu Dept. of Comp. Sci. P.O. Box 751 Portland State University Portland, OR 97207-0751 Office: 503-725-2408 Fax: 503-725-3211",
  "content_length": 5677,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:57"
}