{
  "name": "Wu-Jun Li",
  "homepage": "https://cs.nju.edu.cn/lwj",
  "status": "success",
  "content": "Wu-Jun LI Wu-Jun LI (Resume in Chinese) Professor, PhD National Key Laboratory for Novel Software Technology School of Computer Science Nanjing University 163 Xianlin Avenue, Qixia District, Nanjing, 210023, P.R.China Office: Room 402, Computer Science Building Email: liwujun at nju.edu.cn I am also affiliated with Center for Large Models News 招收2026年入学的博士生、直博生和硕士生。请将个人简历和成绩单发送到 liwujun@nju.edu.cn。 长期招收本校计算机、数学、电子相关专业的大二、大三本科生进组实习，要求成绩优异。请将个人简历和成绩单发送到 liwujun@nju.edu.cn。 Wu-Jun Li has been recognized as the AI 2000 Most Influential Scholar (李武军老师获得 AI 2000人工智能全球最具影响力学者奖) Biography Wu-Jun LI is currently a full professor at the School of Computer Science, Nanjing University. From 2010 to 2013, he was a faculty member of the Department of Computer Science and Engineering at Shanghai Jiao Tong University (SJTU) . He received his PhD degree from the Department of Computer Science and Engineering, HKUST in 2010, under the supervision of Prof. Dit-Yan Yeung. Before that, he received his M.Eng. degree and B.Sc. degree from the Department of Computer Science and Technology, Nanjing University in 2006 and 2003, respectively. Research Interests · Artificial Intelligence ·        Machine Learning ·        Big Data ·        Intelligent Medicine ·        AI for Science Students ·       PhD Students: Jun Li, Yan-Shuo Liang, Yu-Hao Huang, Chang-Wei Shi, Jin Han, Mo-Qi Xiang, Jia-Rui Chen, Song-Ming Zhang ·       Master Students: Cheng Chen, Jie Li, Yangyijian Liu, Jia-Hao Zhu, Xi Cheng, Ming-Yang Li, Tian Li, Shi-Shang Wang, Ren-Shu Xing ·       Alumni Teaching ·       Courses in Nanjing University: Data Structures [for UG students, Spring 2014, Fall 2015, Fall 2016, Fall 2017, Spring 2018, Fall 2019, Fall 2020, Spring 2021, Fall 2022, Fall 2023, Fall 2024] Big Data Analytics [for part-time PG students, Fall 2017, Fall 2018, Fall 2019] ·       Former courses in SJTU: Web Search and Mining [for PG students, Fall 2010, Fall 2011, Fall 2012] Mining Massive Datasets [for UG students, Spring 2011, Spring 2012, Spring 2013] Information Retrieval in Practice [for UG students, Spring 2012] Big Data Processing in Practice [for UG students, Fall 2012] Selected Publications (* indicates students under my supervision) [Publication list in DBLP] Technical Report: PIPO: Pipelined Offloading for Efficient Inference on Consumer Devices Yangyijian Liu*, Jun Li*, Wu-Jun Li. [arXiv version] LCQ: Low-Rank Codebook based Quantization for Large Language Models Wen-Pu Cai*, Ming-Yang Li*, Wu-Jun Li. [arXiv version] Hashing for Protein Structure Similarity Search. Jin Han*, Wu-Jun Li. [arXiv version] NumLLM: Numeric-Sensitive Large Language Model for Chinese Finance Huan-Yi Su*, Ke Wu*, Yu-Hao Huang*, Wu-Jun Li. [arXiv version] Global Momentum Compression for Sparse Communication in Distributed SGD. Chang-Wei Shi*, Shen-Yi Zhao*, Yin-Peng Xie*, Hao Gao*, Wu-Jun Li. [arXiv version] Buffered Asynchronous Secure Aggregation for Cross-Device Federated Learning. Kun Wang*, Yi-Rui Yang*, Wu-Jun Li. [arXiv version] FedREP: A Byzantine-Robust, Communication-Efficient and Privacy-Preserving Framework for Federated Learning. Yi-Rui Yang*, Kun Wang*, Wu-Jun Li. [arXiv version] ADASS: Adaptive Sample Selection for Training Acceleration. Shen-Yi Zhao*, Hao Gao*, Wu-Jun Li. [arXiv version] GNNFormer: A Graph-based Framework for Cytopathology Report Generation. Yang-Fan Zhou*, Kai-Lang Yao*, Wu-Jun Li. [arXiv version] TOMA: Topological Map Abstraction for Reinforcement Learning. Zhao-Heng Yin*, Wu-Jun Li. [arXiv version] On the Evaluation Metric for Hashing. Qing-Yuan Jiang*, Ming-Wei Li*, Wu-Jun Li. [arXiv version] Published Papers: Ordered Local Momentum for Asynchronous Distributed Learning under Arbitrary Delays. Chang-Wei Shi*, Shi-Shang Wang*, Wu-Jun Li. Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2026. [pdf] Controllable Financial Market Generation with Diffusion Guided Meta Agent. Yu-Hao Huang*, Chang Xu, Yang Liu, Weiqing Liu, Wu-Jun Li, Jiang Bian. Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2026. [pdf] Gated Integration of Low-Rank Adaptation for Continual Learning of Language Models. Yan-Shuo Liang*, Jia-Rui Chen*, Wu-Jun Li. Advances in Neural Information Processing Systems (NeurIPS), 2025. [arXiv version] Discriminate Weight Approximation for Efficient DSP Packing in LLM Accelerators. Jun Li*, Yangyijian Liu*, Chang-Wei Shi*, Mingyang Li*, Wu-Jun Li. Proceedings of the IEEE/ACM International Conference on Computer-Aided Design (ICCAD), 2025. [pdf] On the Tension between Byzantine Robustness and No-Attack Accuracy in Distributed Learning. Yi-Rui Yang*, Chang-Wei Shi*, Wu-Jun Li. Proceedings of the International Conference on Machine Learning (ICML), 2025. [pdf] UniAP: Unifying Inter- and Intra-Layer Automatic Parallelism by Mixed Integer Quadratic Programming. Hao Lin*, Ke Wu*, Jie Li*, Jun Li*, Wu-Jun Li. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [arXiv version] DrugHash: Hashing based Contrastive Learning for Virtual Screening. Jin Han*, Yun Hong*, Wu-Jun Li. Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2025. [pdf] TimeDP: Learning to Generate Multi-Domain Time Series with Domain Prompts. Yu-Hao Huang*, Chang Xu, Yueying Wu, Wu-Jun Li, Jiang Bian. Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2025. [pdf] Clustered Reinforcement Learning. Xiao Ma*, Shen-Yi Zhao*, Zhao-Heng Yin*, Wu-Jun Li. Frontiers of Computer Science (FCS), 2025. [pdf] Grey-box Adversarial Attack on Communication in Communicative Multi-agent Reinforcement Learning. Xiao Ma*, Wu-Jun Li. IEEE Transactions on Information Forensics & Security (TIFS), 2025. [pdf] Hardware Computation Graph for DNN Accelerator Design Automation without Inter-PU Templates. Jun Li*, Wei Wang, Wu-Jun Li. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 2025. [pdf] An Artificial Intelligence System for Qualified Mucosal Observation Time During Colonoscopic Withdrawal. Wu-Jun Li#, Peng Yan, MuhanNi, Jin-Dong Zhou*, Lin Zhou, Xiang Zhang, Zhenyu Zhang, Ningjing Gao, Zhanwen Ji, Duanming Zhuang, Hao Zhu, Min Chen, Guifang Xu, Xiaoping Zou, Chunyan Peng#, Dehua Tang#, Lei Wang#. npj Digital Medicine, 2025 [# denotes co-corresponding author] [pdf] Deep Learning based Prediction of Individualized Real-time FSH Doses in GnRH Agonist Long Protocols. Na Kong, Yu Xia*, Zhilong Wang, Hui Zhang, Liyan Duan, Yingchun Zhu, Chenyang Huang, Guijun Yan, Jie Mei#, Wu-Jun Li#, Haixiang Sun#. Journal of Translational Medicine, 2025 [# denotes co-corresponding author] [pdf] Ordered Momentum for Asynchronous SGD. Chang-Wei Shi*, Yi-Rui Yang*, Wu-Jun Li. Advances in Neural Information Processing Systems (NeurIPS), 2024. [pdf] Stochastic Normalized Gradient Descent with Momentum for Large-Batch Training. Shen-Yi Zhao*, Chang-Wei Shi*, Yin-Peng Xie*, Wu-Jun Li. SCIENCE CHINA Information Sciences (SCIS), 2024. [pdf] On the Effect of Batch Size in Byzantine-Robust Distributed Learning. Yi-Rui Yang*, Chang-Wei Shi*, Wu-Jun Li. The Twelfth International Conference on Learning Representations (ICLR), 2024. [pdf] InfLoRA: Interference-Free Low-Rank Adaptation for Continual Learning. Yan-Shuo Liang*, Wu-Jun Li. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [pdf][code] Weighting Online Decision Transformer with Episodic Memory for Offline-to-Online Reinforcement Learning. Xiao Ma*, Wu-Jun Li. Proceedings of the IEEE International Conference on Robotics and Automation (ICRA), 2024. [pdf] Re-quantization based Binary Graph Networks. Kai-Lang Yao*, Wu-Jun Li. SCIENCE CHINA Information Sciences (SCIS), 2024. [pdf] Asymmetric Learning for Graph Neural Network based Link Prediction. Kai-Lang Yao*, Wu-Jun Li. ACM Transactions on Knowledge Discovery from Data (TKDD), 2024. [pdf] AdvTTS: Adversarial Text-to-Speech Synthesis Attack on Speaker Identification Systems. Chu-Xiao Zuo*, Zhi-Jun Jia*, Wu-Jun Li. Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2024. [pdf] SUETA: Speaker-specific Utterance Ensemble based Transfer Attack on Speaker Identification System. Chu-Xiao Zuo*, Jia-Yi Leng*, Wu-Jun Li. Computers & Security, 2024. [pdf] Conditional generative adversarial network-assisted system for radiation-free evaluation of scoliosis using a single smartphone photograph: a model development and validation study. Zhong He, Neng Lu*, Yi Chen, Elvis Chun-Sing Chui, Zhen Liu, Xiaodong Qin, Jie Li, Shengru Wang, Junlin Yang, Zhiwei Wang, Yimu Wang, Yong Qiu, Wayne Yuk-Wai Lee, Jack Chun-Yiu Cheng, Kenneth Guangpu Yang, Adam Yiu-Chung Lau, Xiaoli Liu, Xipu Chen, Wu-Jun Li#, and Zezhang Zhu#. eClinicalMedicine (Part of The Lancet Discovery Science), 2024. [# denotes co-corresponding author] [pdf] Loss Decoupling for Task-Agnostic Continual Learning. Yan-Shuo Liang*, Wu-Jun Li. Advances in Neural Information Processing Systems (NeurIPS), 2023. [pdf] Adaptive Plasticity Improvement for Continual Learning. Yan-Shuo Liang*, Wu-Jun Li. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2023. [pdf][code] Buffered Asynchronous SGD for Byzantine Learning. Yi-Rui Yang*, Wu-Jun Li. Journal of Machine Learning Research (JMLR), 2023. [pdf] State-based Episodic Memory for Multi-Agent Reinforcement Learning. Xiao Ma*, Wu-Jun Li. Machine Learning (MLJ), 2023. [pdf] Context Sketching for Memory-efficient Graph Representation Learning. Kai-Lang Yao*, Wu-Jun Li. Proceedings of the International Conference on Data Mining (ICDM), 2023. [pdf] Fooling Speaker Identification Systems with Adversarial Background Music. Chu-Xiao Zuo*, Jia-Yi Leng*, Wu-Jun Li. Proceedings of the Annual Conference of the International Speech Communication Association (INTERSPEECH), 2023. [pdf] A real-time interpretable artificial intelligence model for the cholangioscopic diagnosis",
  "content_length": 22274,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:51"
}