{
  "name": "Wyatt Lloyd",
  "homepage": "https://www.cs.princeton.edu/~wlloyd",
  "status": "success",
  "content": "Wyatt Lloyd Wyatt Lloyd About Me Research Publications Teaching Acknowledgments Distributed Systems Professor C5 accepted to/named Best of VLDB! Dr. Jeff Helt, Dr. Chris Hodsdon, Dr. Zhenyu Song, andDr. Theano Stavrinos completed their PhDs! TurboDB appeared at NSDI '24! Natural Concurrency Control appeared at OSDI '23! I co-lead the S* Network Systems (SNS) group with Mike Freedman, Amit Levy, and Mae Milano in the CS department at Princeton. I am interested in the theory, design, implementation, evaluation, and deployment of large-scale distributed systems. Keywords like consistency, geo-replication, consensus, concurrency control, and fault tolerance pique my interest. One of my research directions looks at the tradeoffs between the guarantees and performance properties of distributed systems. Guarantees like consistency and transactional abilities make systems easier to reason about and program against. Performance properties like latency and throughput affect end user experience and the capital cost of systems. We're exploring what combinations of guarantees and performance are and aren't possible. RSS, PORT, and Gryff are our most recent work in this area, which also includes SNOW, Janus, Occult, Existential Consistency, Consistency Challenges, Rococo, Eiger, and COPS. Another of my research directions looks at content delivery systems get photos, videos, and other content to the users of large-scale applications. LRB and TectonicFS are our most recent work in this area, which also includes the Streaming Video Engine, Chess, RIPQ and extensions from deploying it in practice at Facebook described in this blog post, f4 and a study of the Facebook photo caching stack. Wyatt Lloyd Professor Princeton University wlloyd@princeton.edu All of this research is made possible by my fantastic students: Current Students PhD Dongsheng Yangk Jennifer Lamh Anja Kalabaa Nick Kaashoek Christopher Branner-Augmona Zijian Qin Undergrad Jonathan Mindel (2025) Donna Wang (2025) Austin Li (2026) Past Students PhD Jeffrey Helt (2024) → Databricks Holistic Consistency Models for Faster Applications and Systems Zhenyu Songk (2023) → Amazon Optimizing Content Distribution Network Caches with Machine Learning Chris Hodsdone (2023) → Databricks Stronger Abstractions and Performance Guarantees for Building Strongly Consistent Distributed Services Theano Stavrinose (2023) → UW PostDoc Leopard: Unlocking Better Cache Performance at Lower Cost with Expiration Time-based Flash Caching Khiem Ngo (2021) → Facebook Research Scientist Tolerating Slowdowns in Replicated State Machines Haonan Lu (2019) → Princeton/MSR-NYC PostDoc → U Buffalo Assistant Professor Performance-Optimal Read-Only Transactions MS Oleg Goleva Austin Lia → Cornell PhD Program Jennifer Lam (2020) → Princeton PhD Program Mohsin Alie (USC 2016) → Facebook Abhinav Sharma (USC 2016) → Facebook Jamie Tsaoe (USC 2016) → Google Undergrad Roosevelt Scaggs (2024), Henry Tang (2023), Aaron Wu (2023), Hanna Xu (2023), Alan Kipkorir (2021), Andrew Lin (2021), Colton Bishop (2021), Daniel Jubas (2021), Audrey Cheng (2020) → Berkeley PhD Program, John Suh (2020), Parker Wild (2019), Noah Beattie-Moss (2019), Vignesh Rajendran (2019), Yousif Aldolaijan (USC), Sam Thomas (Cornell, USC visitor), Roberto Gonzalez (East LA College, USC visitor), Matt Burke (USC 2017) → Cornell PhD Program, Trevor Cai (USC 2017), Brian Goodchilde (RU-Camden 2017, USC visitor) → Columbia MS, Cary Jiang (USC), Chris Hodsdon (RU-Camden 2016, USC visitor) → Princeton PhD Program Other Students I have also been privileged to work closely with other great students including: Nanqinqin Li (Princeton PhD), Zahaib Aktar (USC PhD), Jose M. Faleiro (Yale PhD) → Berkeley PostDoc → Microsoft Research, Linpeng Tang (Princeton PhD) → Co-founder and CTO of Moqi, Inc., S. Akbar Mehdi (UT Austin PhD), Xing Xu (USC PhD 2017) → Google, Shuai Mu (Tsinghua PhD 2015) → NYU PostDoc → Assistant Professor at Stony Brook",
  "content_length": 3970,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:55"
}