{
  "name": "Xavier Bresson",
  "homepage": "https://graphdeeplearning.github.io/authors/xavier-bresson",
  "status": "success",
  "content": "Xavier Bresson | Graph Deep Learning Lab Search Xavier Bresson Assoc. Professor of Computer Science National University of Singapore Xavier Bresson (PhD 2005, EPFL, Switzerland) is Associate Professor in Computer Science at NUS, Singapore. He is a leading researcher in the field of Graph Deep Learning, a new framework that combines graph theory and deep learning techniques to tackle complex data domains in natural language processing, computer vision, combinatorial optimization, quantum chemistry, physics, neuroscience, genetics and social networks. In 2016, he received the highly competitive Singaporean NRF Fellowship of $2.5M to develop these deep learning techniques. He was also awarded several research grants in the U.S. and Hong Kong. As a leading researcher in the field, he has published more than 60 peer-reviewed papers in the leading journals and conference proceedings in machine learning, including articles in NeurIPS, ICML, ICLR, CVPR, JMLR. He has organized several international workshops and tutorials on AI and deep learning in collaboration with Facebook, NYU and Imperial such as the 2019 and 2018 UCLA workshops, the 2017 CVPR tutorial and the 2017 NeurIPS tutorial. He has been teaching undergraduate, graduate and industrial courses in AI and deep learning since 2014 at EPFL (Switzerland), NTU (Singapore) and UCLA (U.S.). Interests Graph Neural Networks Spectral Graph Theory Computer Vision Natural Language Processing Quantum Chemistry Combinatorial Optimization Education PhD in Applied Mathematics, 2005 École Polytechnique Fédérale de Lausanne MSc in Information Sciences, 2000 École Supérieure d'Électricité BSc in Theoretical Physics, 1998 Aix-Marseille University Latest Learning TSP Requires Rethinking Generalization Benchmarking Graph Neural Networks Benchmarking Graph Neural Networks Free-hand Sketches Multi-Graph Transformer for Free-Hand Sketch Recognition A Two-Step Graph Convolutional Decoder for Molecule Generation On Learning Paradigms for the Travelling Salesman Problem Graph Convolutional Neural Networks for Molecule Generation Combinatorial Optimization Quantum Chemistry Spatial Graph ConvNets Graph Convolutional Neural Networks for Molecule Generation and Travelling Salesman Problem An Efficient Graph Convolutional Network Technique for the Travelling Salesman Problem GraphTSNE: A Visualization Technique for Graph-Structured Data Convolutional Neural Networks on Graphs An Experimental Comparison of Text Classification Techniques An Experimental Study of Neural Networks for Variable Graphs Residual Gated Graph ConvNets Cite × Copy Download",
  "content_length": 2611,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:56"
}