{
  "name": "Xi Chen 0010",
  "homepage": "https://www.stern.nyu.edu/faculty/bio/xi-chen",
  "status": "success",
  "content": "NYU Stern - Xi Chen - Professor of Technology, Operations, and Statistics Skip to Main Content Home / Experience Stern / Faculty & Research / Faculty Directory / Xi Chen Xi Chen – Professor of Technology, Operations, and Statistics – Andre Meyer Faculty Fellow – Doctoral Program Coordinator, Statistics Joined Stern 2014 Leonard N. Stern School of Business Kaufman Management Center 44 West Fourth Street, 8-50 New York, NY 10012 E-mail xc13@stern.nyu.edu Personal website Biography Research Interests Academic Background Awards & Appointments Biography Professor Xi Chen is a Professor and the Andre Meyer Faculty Fellow at New York University's Stern School of Business. Additionally, he is an affiliated faculty member at the Courant Institute of Mathematical Sciences and the Center for Data Science at NYU. Professor Chen's work extensively explores machine learning and its applications in operations management and quantitative fields, including digital advertising, dynamic pricing, online recommendations, and quantitative finance. Additionally, his research extends into blockchain technology, examining mechanism design, tokenomics, and decentralized finance within this domain. He has authored nearly 100 papers featured in top journals and peer-reviewed conferences. Furthermore, Prof. Chen is a co-editor of “The Elements of Joint Learning and Optimization in Operations Management,” published by Springer. He is also preparing to release his book, “Web3: Blockchain, the New Economy, and the Self-Sovereign Internet,” under Cambridge University Press. Professor Chen's groundbreaking work earned him a spot on the Forbes 30 Under 30 list in 2017, and in 2020, Poets & Quants named him one of the World's Best 40 Under 40 MBA Professors. Dr. Chen has been honored with several other awards: he received the Best Paper Award at the first NeurIPS Workshop on Decentralization and Trustworthy Machine Learning in Web3, earned the COPSS (Committee of Presidents of Statistical Societies) Emerging Leader Award, and was granted the Simons-Berkeley research fellowship. He is also an elected member of the International Statistical Institute (ISI). His collaborative efforts with industry giants such as Google, Facebook, Adobe, JP Morgan, and Bloomberg have addressed a range of technical and business challenges, garnering him outstanding faculty research awards from each. Furthermore, Professor Chen contributed two years as a principal scientist at Amazon Ads, where he spearheaded a science team to advance forecasting and delivery systems in digital advertising. Professor Chen served as the area or associate editor for top journals, such as Management Science, Operations Research, and Annals of Statistics, and has been invited to deliver more than 100 talks at universities and summits. He received his Ph.D. in Machine Learning from Carnegie Mellon University's School of Computer Science and completed postdoctoral training under the guidance of Professor Michael I. Jordan at UC Berkeley. Research Interests Machine learning and Foundation Models Statistics and Business Analytics Pricing and Revenue Management Blockchain, Tokenomics, and Decentralized Finance Quantitative Finance Academic Background Ph.D., Machine Learning Carnegie Mellon University, School of Computer Science M.S., Industrial Administration and Operations Research Carnegie Mellon University, Tepper School of Business Awards & Appointments Area Co-Editor (Machine Learning & Data Science), Operations Research 2023 Andre Meyer Faculty Fellow 2022 COPSS Leadership Academy 2022 Best Paper Award, NeurIPS Workshop on Decentralization and Trustworthy Machine Learning in Web3 2022 Associate Editor, Annals of Statistics 2022 Elected Member, International Statistical Institute (ISI) 2021 The World's Best 40 Under 40 MBA Professors, Poets & Quants 2021 ICSA Outstanding Young Researcher Award 2019 Honorable Mention, INFORMS Junior Faculty Interest Group Paper Award (JFIG) 2019 Associate Editor, Management Science 2019 Forbes 30 Under 30 in Science Forbes 30 Under 30 in Science 2017 2017 Best Paper Award, CSAMSE Annual Conference 2017 Simons-Berkeley Research Fellowship 2013 Areas of Expertise Technology, Operations & Statistics Data Mining Data Science Machine Learning Statistics Stochastic Modeling Back to Top",
  "content_length": 4313,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:01"
}