{
  "name": "Xi Li 0015",
  "homepage": "https://lixi1994.github.io",
  "status": "success",
  "content": "Xi Li (李溪) | Home Xi Li (李溪) she/her/hers Assistant Professor, Ph.D. University of Alabama - Birmingham Bio I am an Assistant Professor in the Department of Computer Science at the University of Alabama at Birmingham (UAB). I received my Ph.D. in Computer Science from Penn State University under the guidance of Dr. George Kesidis and Dr. David Miller. I obtained my M.S. degree in Computer Science from Penn State University in 2018 and my B.S. degree from the School of Information Science and Engineering at Southeast University in Nanjing, China, in 2016. Research Interests: My research broadly focuses on trustworthy AI. Recently, we have been exploring the following topics: Robustness of large language/vision/multi-modal models Machine learning for IoT security and cybersecurity Trustworthy AI + X (e.g., education and healthcare) Check my resume here (Last updated: Oct. 2025). Publications Tutorial Conference Journal Workshop Pre-prints Towards Safe Multi-Modal Learning: Unique Challenges and Future Directions Xi Li, Manling Li, Muchao Ye ICCV Tutorial, 2025 Paper Website Exploitation and Mitigation: Understanding Large-Scale Machine Learning Robustness under Paradigm Shift Xi Li, Ruixiang Tang, Muchao Ye SDM Tutorial, 2025 Paper Slides Chain-of-Scrutiny: Detecting Backdoor Attacks for Large Language Models Xi Li, Ruofan Mao, Yusen Zhang, Renze Lou, Chen Wu, Jiaqi Wang ACL(Findings) 2025 Paper Code PeerGuard: Defending Multi-Agent Systems Against Backdoor Attacks Through Mutual Reasoning Falong Fan, Xi Li Best Paper Award, IEEE IRI 2025 Paper Securing Federated Learning Against Novel and Classic Backdoor Threats During Foundation Model Integration Xiaohuan Bi, Xi Li IEEE IRI 2025 Paper AAAR-1.0: Assessing AI’s Potential to Assist Research Renze Lou, Hanzi Xu, Sijia Wang, Jiangshu Du, Ryo Kamoi, Xiaoxin Lu, Jian Xie, Yuxuan Sun, Yusen Zhang, Jihyun Janice Ahn, Hongchao Fang, Zhuoyang Zou, Wenchao Ma, Xi Li, Kai Zhang, Congying Xia, Lifu Huang, Wenpeng Yin ICML, 2025 Paper Mitigating Image Captioning Hallucinations in Vision-Language Models Fei Zhao, Chengcui Zhang, Runlin Zhang, Tianyang Wang, Xi Li IEEE MIPR, 2025 Paper Backdoor Inversion in Neural-Activation Space Guangmingmei Yang, Xi Li, Hang Wang, David Miller, George Kesidis IEEE MLSP, 2025 Foundation Models in Federated Learning: Assessing Backdoor Vulnerabilities Xi Li, Chen Wu, Jiaqi Wang IJCNN, 2025 Paper Unveiling Backdoor Risks Brought by Foundation Models in Heterogeneous Federated Learning Xi Li, Chen Wu, Jiaqi Wang PAKDD, 2024 Paper Poster Code Temporal-Distributed Backdoor Attack Against Video-Based Action Recognition Xi Li, Songhe Wang, Ruiquan Huang, Mahanth Gowda, George Kesidis AAAI, 2024 Paper Poster Code A BIC-based Mixture Model Defense against Data Poisoning Attacks on Classifiers Xi Li, David Miller, Zhen Xiang, George Kesidis IEEE MLSP, 2023 Test-Time Detection of Backdoor Triggers of Poisoned Deep Neural Networks Xi Li, David Miller, Zhen Xiang, George Kesidis ICASSP, 2022 Paper Poster Detecting Backdoor Attacks Against Point Cloud Classifiers Zhen Xiang, David Miller, Siheng Chen, Xi Li, George Kesidis ICASSP, 2022 Paper A Backdoor Attack against 3D Point Cloud Classifiers Zhen Xiang, David Miller, Siheng Chen, Xi Li, George Kesidis ICCV, 2021 Paper Correcting the distribution of batch normalization signals for Trojan mitigation Xi Li, Zhen Xiang, David Miller, George Kesidis Neurocomputing, 2024 Paper BIC-based Mixture Model Defense against Data Poisoning Attacks on Classifiers: A Comprehensive Study Xi Li, David Miller, Zhen Xiang, George Kesidis IEEE Transactions on Knowledge and Data Engineering (TKDE), 2024 Paper Code Rethinking the Safety Landscape for Foundation Models: A Multi-Modal Perspective Xi Li, Shu Zhao, Fei Zhao, Runlong Yu ICCV 2025 T2FM Workshop Paper Position Paper: Assessing Robustness, Privacy, and Fairness in Federated Learning Integrated with Foundation Models Xi Li, Jiaqi Wang ICCV 2025 T2FM Workshop Paper Backdoor Threats from Compromised Foundation Models to Federated Learning Xi Li, Songhe Wang, Chen Wu, Hao Zhou, Jiaqi Wang FL@FM-NeurIPS'23 Paper Poster Code Survey on Neural Network Parameter Acquisition: from Optimization to Generation Jiaqi Wang, Yusen Zhang, Xi Li, Simeng Han, Zining Zhu, Lingjuan Lyu, Yaqing Wang, Ruiquan Huang, Arman Cohan, Rui Zhang, Sheng Li, Xin (Eric) Wang. NeuroGen: Neural Network Parameter Generation via Large Language Models Jiaqi Wang, Yusen Zhang, Xi Li Under review Paper Highlights 🏆 Best Paper Award – IEEE IRI 2025 📷 Featured in UAB News for research on AI safety – Read more Teaching Instructor UAB CS300/500 Advanced OO Programming in C++2025 Fall CS652/752 Advanced Algorithms and Applications2025 Spring CS685/785 Foundation of Data Science2024-2025 Fall Teaching Assistant PSU CMPSC465 Data Structures and Algorithms 2021 Spring CMPSC/MATH 451 Numerical Computations 2019 Fall - 2024 Spring CMPEN/EE 455 Digital Image Processing I 2018 Fall Experience Associate Scientist | 2025 - present Integrative Center for Aging Research The University of Alabama at Birmingham, School of Medicine Machine Learning Engineer Intern | Summer 2024 Meta, NYC Modern Recommendation System Team Explored early fusion architecture for multimodal understanding. Service Panelist for NSF Program Committee Member: AAAI 2025-2026, SDM 2024 Conference Reviewer: ICCV 2025, ICML 2025, AISTATS 202-2026, ICLR 2025, CVPR 2024–2025, NeurIPS 2024-2025, ICASSP 2022–2025, COLM 2024, KDD 2023–2024 Journal Reviewer: Neurocomputing 2025, Computers & Security (C&S) 2024, IEEE TCSVT 2024 Student Volunteer: NeurIPS 2023 Xi Li (李溪) TrustBrew Lab",
  "content_length": 5639,
  "method": "requests",
  "crawl_time": "2025-12-01 14:47:59"
}