{
  "name": "Xi Peng 0001",
  "homepage": "https://pengxi.me",
  "status": "success",
  "content": "Greetings! I'm Xi Peng Skip to content Xi Peng (彭玺) is leading XLearning Group at the College of Computer Science, Sichuan University as a Cheung Kong Professor. From 2014 to 2017, he was a research scientist at the Institute for Infocomm, Research Agency for Science, Technology, and Research (A*STAR) Singapore. He got his Ph.D. degree from Sichuan University in 2013. His current interests mainly focus on machine learning and its applications in image processing, computer vision, multi-modal analysis, and natural language processing. In these areas, he has tried to provide novel insights to communities, and some major results are briefly highlighted below: i) proving the equivalence between F-norm (L2) and nuclear-norm (L1) under mild conditions. The theoretical results well explain why L2-norm-based representations are competitive with L1-norm-based ones in number of applications (TNNLS'16, TCYB'17a, TCYB'17b); ii) PARTY: one of the FIRST deep clustering methods (arxiv'15, IJCAI'16), which is proposed to group the complex data in an unsupervised way; iii) TELL: the FIRST interpretable unsupervised neural network which is intrinsically explainable and transparent (JMLR'22); iv) CC: it achieves state of the art for online clustering in an elegant contrastive learning fashion (AAAI'21, IJCV'22); v) Noisy Correspondence (NC): A new research DIRECTION of noisy labels learning. NC aims to address the mismatched pairs instead of annotation errors in a number of tasks, e.g., fundamental models, retrieval, Re-ID, QA, dialogue, graph matching, identification, etc. (CVPR'21, NeurIPS'21, CVPR'22, CVPR'23, TPAMI'22, ACMMM'22, AAAI'23, etc; vi) All in One Image/Video Restoration and Enhancement: for the first time, we explored this new direction which aims to handle multiple degradations with one mode (CVPR'21); v) AI4Science: My lab also attempts to explore the core problems in interdiscipline and develop specific solutions. Currently, we are diving into AI4LifeScience (Nature Communications 2023, 2024). News: [Services]: Nov. 20, 2025, I will serve for ICML 2026 as Area Chair. [Publications]: Nov 8, 2025, five AAAI papers (two orals) were accepted! [Services]: Nov. 5, 2025, I will serve for IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (IF: 18.6) as Associate Editor (AE). [Publications]: Sep. 22, 2025, three papers were accepted by the Annual Conference on Neural Information Processing Systems (NeurIPS 2025). [Publications]: May 1, 2025, three IJCAI papers, four ICML papers, and one TPAMI papers were accepted! [Publications]: Apr. 1, 2025, two paper was accepted by IEEE Transactions on Image Processing (TIP)! [Publications]: Feb. 27, 2025, four papers were accepted by the IEEE / CVF Computer Vision and Pattern Recognition Conference (CVPR), acc rate=22.1%. [Services]: Jan. 24, 2025, I am nominated with honor to be an Associate Editor (AE) of IEEE Trans on Image Processing (IF: 10.8).. [Publications]: Jan. 23, 2025, three papers were accepted by International Conference on Learning Representation (ICLR spotlight, acc rate=3.26%), TMM, and TIFS! [Publications]: Jan. 15, 2025, one paper was accepted by Nature Communications!  Congrats to Yunfan and all co-authors! [Services]: Dec. 8, 2024, I will serve for ICCV 2025 and ICML 2025 as Area Chair. [Services]: Nov. 11, 2024, I will serve for IJCAI 2025 as Senior Area Chair. [Publications]: Sep. 26, 2024, four papers were accepted by the Annual Conference on Neural Information Processing Systems (NeurIPS 2024). [Services]: Sep. 14, 2024, I will serve for ICLR 2025 and CVPR 2025 as Area Chair. [Publications]: Jul. 16, 2024, two papers were accepted by ACM Multimedia (ACM MM)! [Publications]: May 3, 2024, two papers were accepted by the International Conference on Machine Learning (ICML 2024), one of which was accepted as Oral (accept rate=1.5%) and the other was accepted as Spotlight (accept rate=3.5%)! [Publications]: Feb. 28, 2024, one paper was accepted by IEEE Transactions on Image Processing (TIP)! [Publications]: Jan. 15, 2024, two papers were accepted by the International Conference on Learning Representation (ICLR) as Oral (accept rate=1.2%) and Poster! [Publications]: Jan. 9, 2024, one paper was accepted by the International Journal of Computer Vision (IJCV)! [Publications]: Jan. 3, 2024, one paper was accepted by the International Journal of Computer Vision (IJCV)! [Publications]: Dec. 12, 2023, two papers were accepted by The AAAI Conference on Artificial Intelligence (AAAI 2023). [Publications]: Nov. 10, 2023, one paper was accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)! [Publications]: Sep. 22, 2023, one paper was accepted by the Thirty-Seventh Annual Conference on Neural Information Processing Systems (NeurIPS 2023) held at the New Orleans, Dec. 10-16, 2023. [Publications]: Sep. 8, 2023, one paper was accepted by Nature Communications!  Big Congrats to Yunfan, Dan, Mouxing, and all co-authors! [News]: Sep. 4, humbly, I was honored as Cheung Kong Professor appointed by the Ministry of Education of China. Sincerely thanks the all who have helped me during past years. [Publications]: Jul. 26, 2023, one paper was accepted by ACM Multimedia (ACM MM 2023)! [Publications]: Jul. 14, 2023, two papers were accepted by the International Conference on Computer Vision (ICCV 2023), Paris, France. Oct. 4-6, 2023. [Services]: Jun. 20, 2023, I have been invited to be an Area Chair for The IEEE / CVF Computer Vision and Pattern Recognition Conference (CVPR 2024), which will be held in Seattle, from June 17th through June 21st, 2024. [Publications]: Apr. 25, 2023, two papers were accepted by the International Conference on Machine Learning (ICML 2023), Honolulu, Hawaii. Jul. 23-29, 2023. [Publications]: Apr. 21, 2023, one paper was accepted by the International Joint Conference on Artificial Intelligence (IJCAI 2023), Macao, China, Aug 19-25, 2023. [Publications]: Mar. 14, 2023, one paper was accepted by IEEE Trans Neural Networks and Learning Systems (TNNLS). [Publications]: Feb. 28, 2023, four papers were accepted by IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2023)! [Publications]: Feb. 20, 2023, one paper was accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)! Congrats to Peng and coauthors. [Services]: Dec. 24, 2022, I was invited to be a TPC member for the 40th International Conference on Machine Learning (ICML 2023). [Publications]: Dec. 18, 2022, one paper was accepted by IEEE TKDE. [Services]: Dec. 1, 2022, I have been invited to be an SPC for the International Joint Conference on Artificial Intelligence (IJCAI-23), which will be held on Aug 19-25, 2023 in Cape Town, South Africa. [Publications]: Nov. 19, 2022, two papers were accepted by The AAAI Conference on Artificial Intelligence (AAAI 2022). [Publications]: Oct. 6, 2022, one paper was accepted by The Conference on Empirical Methods in Natural Language Processing (EMNLP 2022) as Findings. Congrats to Yijie and coauthors. [Publications]: Sep. 15, 2022, one paper was accepted by the Thirty-Sixth Annual Conference on Neural Information Processing Systems (NeurIPS 2022), Hybrid, Nov. 28-Dec.9, 2022. Congrats to Yuanbiao and coauthors. [Publications]: Aug. 2, 2022, one paper was accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)! Congrats to Yijie, Yuanbiao, and coauthors. [Services]: Jul. 8, 2022, I have been invited to be an Area Chair for the AAAI Conference on Artificial Intelligence (AAAI 2023), will be held in Washington, DC, 7-14, 2023. [Publications]: Jun. 30, 2022, one paper about Noisy Correspondence was accepted by ACM Multimedia (ACMMM)! Congrats to Peng and coauthors. [Publications]: Jun. 16, 2022, one paper was accepted by the International Journal of Computer Vision (IJCV)! Congrats to Yunfan and Mouxing. [Services]: May. 25, 2022, I have been invited to be a PC member for the 29th International Conference on Computational Linguistics (COLING 2022), to be held in Gyeongju, the Republic of Korea on Oct. 12-17 2022. [Publications]: May. 11, 2022, one paper was accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)! Congrats to Peng and coauthors. [Publications]: May 5, 2022, one paper was accepted by IEEE Transactions on Image Processing (TIP)! Congrats to boyun and coauthors. [Publications]: May 5, 2022, one paper was accepted by Military Medical Research! Congrats to Han and coauthors. [Publications]: Mar. 2, 2022, two papers were accepted by IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2022)! Congrats to mouxing, boyun, and coauthors. [Services]: Mar. 1, 2022, I have been invited to be a TPC member for the European Conference on Computer Vision (ECCV 2022), to be held Tel-Aviv on Oct. 24-28 2022. [Publications]: Feb. 13, 2022, one paper was accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)! Congrats to mouxing and coauthors. [Services]: Dec. 17, 2021, I have been invited to be a TPC member for the 39th International Conference on Machine Learning (ICML 2022), to be held July 17-23 in Baltimore, USA. [Services]: Oct. 15, 2021, I have been invited to be a TPC member for the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022), to be held online. [Publications]: Oct. 1, 2021, one paper was accepted by the Journal of Machine Learning Research (JMLR), a long, tough, and growing journey! Thanks my coauthors. [Publications]: Sep. 29, 2021, one paper was accepted by the Thirty-Fifth Annual Conference on Neural Information Processing Systems (NeurIPS 2021), virtual, Dec. 6-12, 2021, as Oral presentation (acc rate =0.6%, 55 from 9122 submissions). Congrats to Zhenyu and coauthors. [Services]: Aug. 2, 2021, I have been invited to be a TPC member for the IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2022), which will be held in New Orleans, Louisiana, f",
  "content_length": 28470,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:00"
}