{
  "name": "Xi Wang 0012",
  "homepage": "https://www.sheffield.ac.uk/cs/people/academic/xi-wang",
  "status": "success",
  "content": "Dr Xi Wang | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Xi Wang School of Computer Science Lecturer Course Director for MSc Computer Science with Speech & Language Processing Open staff member portrait in a modal window xi.wang@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Xi Wang School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0001-5936-9919 Google Scholar Personal webpage Profile Xi Wang is a Lecturer of Natural Language Processing at the University of Sheffield. Previously, he obtained his PhD from the University of Glasgow, supervised by Prof. Iadh Ounis and Prof. Craig Macdonald and focused on the research topic of developing review text-based recommender systems. After that, he joined the web intelligence group of University College London (UCL) as a postdoctoral researcher, supervised by Prof. Emine Yilmaz and worked on knowledge-augmented task-oriented dialogue systems. His current research interests are conversational AI, personalisation, and retrieval augmented generation, fairness, as well as relevant topics in the domain of natural language processing (NLP). Research interests Natural Language Processing Conversational AI Retrieval-Augmented Generation Personalisation Fairness Machine Learning Publications Journal articles Liu S, Wang X, Macdonald C & Ounis I (2024) A Social-aware Gaussian Pre-trained model for effective cold-start recommendation. Information Processing & Management, 61(2), 103601-103601. Wang X, Ounis I & Macdonald C (2022) BanditProp: Bandit Selection of Review Properties for Effective Recommendation. ACM Transactions on the Web, 16(4), 1-19. Sen P, Wang X, Xu R & Yilmaz E () Task2KB: A Public Task-Oriented Knowledge Base. Proceedings of the AAAI Conference on Artificial Intelligence, 37(13), 16482-16484. Wang X, Wu Y, Wang X, Macdonald C & Ounis I () University of Glasgow Terrier Team at the TREC 2020 Deep Learning Track. Su T, Wang X, Macdonald C & Ounis I () University of Glasgow Terrier Team at the TREC 2019 Deep Learning Track. Book chapters Parapar J, Perez A, Wang X & Crestani F (2026) Overview of eRisk 2025: Early Risk Prediction on the Internet, Lecture Notes in Computer Science (pp. 242-265). Springer Nature Switzerland Wang X, Fang A, Ounis I & Macdonald C (2019) Evaluating Similarity Metrics for Latent Twitter Topics, Lecture Notes in Computer Science (pp. 787-794). Springer International Publishing Wang X, Ounis I & Macdonald C (2019) Comparison of Sentiment Analysis and User Ratings in Venue Recommendation, Lecture Notes in Computer Science (pp. 215-228). Springer International Publishing Conference proceedings Chatterjee S, Wang X, Zhang S, Ebrahimi S, Ren Z, Ganguly D, Jones G, Yilmaz E & Zamani H (2025) ProActLLM: Proactive Conversational Information Seeking with Large Language Models. Proceedings of the 34th ACM International Conference on Information and Knowledge Management (pp 6894-6897) Wang X, Perez A, Parapar J & Crestani F (2025) TalkDep: Clinically Grounded LLM Personas for Conversation-Centric Depression Screening. Proceedings of the 34th ACM International Conference on Information and Knowledge Management (pp 6554-6558) Deng X, Wang X & Stevenson R (2025) The next phase of scientific fact-checking: advanced evidence retrieval from complex structured academic papers. ICTIR '25: Proceedings of the 2025 International ACM SIGIR Conference on Innovative Concepts and Theories in Information Retrieval (ICTIR). Padua, Italy, 18 July 2025 - 18 July 2025. View this article in WRRO Rahmani HA, Wang X, Yilmaz E, Craswell N, Mitra B & Thomas P (2025) SynDL: A large-scale synthetic test collection for passage retrieval. Companion Proceedings of the ACM on Web Conference 2025 (pp 781-784). Sydney NSW, Australia, 28 April 2025 - 28 April 2025. View this article in WRRO Parapar J, Perez A, Wang X & Crestani F (2025) eRisk 2025: contextual and conversational approaches for depression challenges. Advances in Information Retrieval: 47th European Conference on Information Retrieval, ECIR 2025, Lucca, Italy, April 6–10, 2025, Proceedings, Part V(LNCS 15576) (pp 416-424). Lucca, Italy, 6 April 2025 - 6 April 2025. View this article in WRRO Parapar J, Perez A, Wang X & Crestani F (2025) Overview of eRisk at CLEF 2025: Early Risk Prediction on the Internet (Extended Overview). Ceur Workshop Proceedings, Vol. 4038 (pp 1449-1473) Azzopardi L, Breuer T, Engelmann B, Kreutz C, MacAvaney S, Maxwell D, Parry A, Roegiest A, Wang X & Zerhoudi S (2024) SimIIR 3: A Framework for the Simulation of Interactive and Conversational Information Retrieval. Proceedings of the 2024 Annual International ACM SIGIR Conference on Research and Development in Information Retrieval in the Asia Pacific Region (pp 197-202) Ramos J, Rahmani HA, Wang X, Fu X & Lipani A (2024) Transparent and scrutable recommendations using natural language user profiles. Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics, Vol. 1: Long Papers (pp 13971-13984). Bangkok, Thailand, 11 August 2024 - 11 August 2024. View this article in WRRO Shi Z, Wang X & Lipani A (2024) Self Contrastive Learning for Session-Based Recommendation (pp 3-20) Wang X, Sen P, Li R & Yilmaz E (2024) Simulated Task Oriented Dialogues for Developing Versatile Conversational Agents (pp 157-172) Wang X, Rahmani H, Liu J & Yilmaz E (2023) Improving Conversational Recommendation Systems via Bias Analysis and Language-Model-Enhanced Data Augmentation. Findings of the Association for Computational Linguistics: EMNLP 2023, December 2023 - December 2023. Rahmani HA, Wang X, Feng Y, Zhang Q, Yilmaz E & Lipani A (2023) A Survey on Asking Clarification Questions Datasets in Conversational Systems. Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), July 2023 - July 2023. Yi Z, Wang X, Ounis I & Macdonald C (2022) Multi-modal Graph Contrastive Learning for Micro-video Recommendation. Proceedings of the 45th International ACM SIGIR Conference on Research and Development in Information Retrieval (pp 1807-1811) Ye F, Wang X, Huang J, Li S, Stern S & Yilmaz E (2022) MetaASSIST: Robust Dialogue State Tracking with Meta Learning. Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing, December 2022 - December 2022. Wang X, Ounis I & Macdonald C (2021) Leveraging Review Properties for Effective Recommendation. Proceedings of the Web Conference 2021 (pp 2209-2219) Wang X, Ounis I & Macdonald C (2020) Negative Confidence-Aware Weakly Supervised Binary Classification for Effective Review Helpfulness Classification. Proceedings of the 29th ACM International Conference on Information & Knowledge Management (pp 1565-1574) Meng Z, McCreadie R, Macdonald C, Ounis I, Liu S, Wu Y, Wang X, Liang S, Liang Y, Zeng G , Liang J et al (2020) BETA-Rec: Build, Evaluate and Tune Automated Recommender Systems. Fourteenth ACM Conference on Recommender Systems (pp 588-590) Deng X, Wang X & Stevenson R () +VeriRel: Verification feedback to enhance document retrieval for scientific fact checking. Proceedings of the 34th ACM International Conference on Information and Knowledge Management (CIKM'25). Seoul, Korea, 10 November 2025 - 10 November 2025. View this article in WRRO Research group Natural Language Processing",
  "content_length": 7477,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:01"
}