{
  "name": "Xia Ning",
  "homepage": "https://u.osu.edu/ning.104/members/xia-ning-pi",
  "status": "success",
  "content": "Xia Ning, PI | Ning Lab Ohio State nav bar Skip to main content The Ohio State University Help BuckeyeLink Map Find People Webmail Search Ohio State Xia Ning (宁夏; Ning is the last name), PhD, MS, MS, MBA, FAMIA, FACMI Professor Co-Lead, AI for Health, OSU AI(X) Hub Division Chief of AI in Digital Health Biomedical Informatics (BMI), College of Medicine, OSU Computer Science and Engineering (CSE), College of Engineering, OSU Division of Medicinal Chemistry and Pharmacognosy, College of Pharmacy (courtesy) Core Faculty, Translational Data Analytics Institute (TDAI) Dr. Xia Ning is a tenured Professor at The Ohio State University, holding appointments in the Colleges of Medicine, Engineering, and Pharmacy. She was trained as a Computer Scientist, specializing in Artificial Intelligence (AI) and Machine Learning (ML). A renowned leader in Biomedical Informatics and AI, she focuses on developing cutting-edge AI methodologies with transformative applications in medicine and healthcare, bridging the gap between computational innovation and real-world healthcare challenges. Dr. Ning has published more than 150 peer-reviewed articles in high-impact journals and prestigious venues, with notable breakthroughs highlighted in Nature’s special collection, and long-lasting impacts recognized by several awards. Her research has also received recognition from industry, OSU, the National Science Foundation, research communities, and social media. Her research programs have been extensively funded by the National Institute of Health (NIH), the National Science Foundation (NSF), and industry leaders. Dr. Ning has consistently served the research communities and has been recognized with service awards. In addition, with continued leadership training, education, and practices, Dr. Ning has unique qualifications and insights to develop and lead initiatives for Health AI innovation. She is currently a co-lead of the AI in Health pillar of the newly established OSU AI(X) Hub. Selected Awards and Recognitions Best paper award, COLM LLM for Scientific Discovery workshop 2025 “AutoSDT: Scaling data-driven discovery tasks toward open co-scientists” Best paper award, Chen Institute Symposium for AI Accelerated Science 2025 “LARC: Towards human-level constrained retrosynthesis planning through an agentic framework” National Academy of Inventors Senior Member 2025 WBNS 10TV news report “How Ohio State students are learning to use AI to speed up making medications,” 2025 Sanofi iDEA-TECH Award 2024 Senior Program Committee (SPC) Award, AMIA Informatics Summit 2024 Spotlight speaker in OSU Research and Innovation Showcase 2024 President Research Excellence Award, OSU 2023 FAME Mid-Career Achievement Award, OSU COM 2022 President Research Excellence Award, OSU 2021 Fellow, Inaugural Growing Research Opportunities (GRO) Academy, OSU (cohort of 21) 2021 10-Years-Highest-Impact-Paper Award, IEEE International Conference on Data Mining (ICDM) 2020 AWS Machine Learning Research Award 2020 IUPUI School of Science Pre-Tenure Research Award 2018 NEC Excellent Invention Award 2016 NSF Research Initiation Initiative Award 2016 Research Interests Foundational methodology development in Artificial Intelligence and Machine Learning with transformative applications in medicine and healthcare: AI methodologies: Generative AI: diffusion models, auto-encoders over structured data Foundation models: large-language models (LLMs), multi-module foundation models (MMFMs) Large Language Models (LLMs) and Agentic AI: LLM-based agents, planning, reinforcement learning Deep learning: graph representation learning, deep phenotyping, contrastive learning, knowledge graph Recommendation: conversational recommendation, multi-module recommendation, foundation models, learning to rank AI applications: Healthcare and Biomedicine: clinical decision support, precision medicine, disease onset prediction, risk prediction, EHR predictive analysis, clinical note analysis, clinical trial analysis Drug discovery and development: molecule design, lead optimization, peptide generation, molecule property prediction, drug repurposing, pharmacovigilance, foundation models and agents for drug development and benchmarking E-Commerce: recommender systems, conversational LLMs, e-commerce multi-module foundation models and benchmarking Education PhD, Computer Science & Engineering, University of Minnesota, Twin Cities, USA 2012 MBA, Fisher College of Business, The Ohio State University, USA 2024 MS, Computer Science & Engineering, University of Minnesota, Twin Cities, USA 2009 MS, Statistics, University of Minnesota, Twin Cities, USA 2009 BS with honors, Computer Science, Chu Kochen Honors College, Zhejiang University, China 2005 Log in",
  "content_length": 4740,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:03"
}