{
  "name": "Xiali Sharon Hei",
  "homepage": "http://www.xialihei.com",
  "status": "success",
  "content": "Xiali (Sharon) Hei’s Group | research,teaching,and so on… My primary research interests span broadly across the areas as follows. AI security and privacy Cyber-physical system security LLM model security Hardware Security Acoustic side-channel Captcha attacks and design My other interests include medical informatics, security & privacy of medical data. Google Scholar. Awards and Funds (27) 08/2025 NSF MRI Award 07/2025 NSF IUCRC Planning Award 03/2025 IRI/BORSF Professorship in Digital Security and Resilience 03/2025 Achievement Award in Externally Funded Research 10/2024 NSF/DoE NAIRR Pilot award 05/2024 IEEE Symp. on Security and Privacy Distinguished Paper Award 05/2024 EAI Fellow 2023 05/2024 NSF REU Supplement 2 05/2024 NSF/DoE NAIRR Pilot award 03/2024 NSF REU Supplement 1 10/2023 SmartSP’23 Best Paper Award 06/2023 NSF SaTC Small Award 04/2023 Outstanding Achievement Award in Externally Funded Research 11/2022 NSF RII Track-4 Faculty Fellow Award 08/2022 NSF CVDI Center Award 07/22-06/26 Alfred and Helen M. Lamson Endowed Professorship Award 09/2021 Facebook Award 09/2021 NSF MRI Award 07/2021 LA Broad Regents CEMC Award 07/2021 Two LA Broad Regents SURE Awards 06/2021 NSF CVDI Center Award 12/2020 LA Broad Regents LAMDA cooperation program Award 06/2019 NSF RII Track-1 Award 06/2016 NSF CRII Award 11/2015 Delaware Economic Development Office Award 08/2014 ACM 2014 MobiHoc Best Poster Runner-up Award 12/2013 Dissertation Completion Fellowship 04/2013 The Bronze Award Best Graduate Project in Future of Computing Competition News 11/22/2025: I will serve as a publication chair for USENIX Vehicle Security 2025. 11/22/2025: We have demostrated our robot dogs and attack demos to high school students on the Preview Day. 11/20/2025: Congratulations to my PhD student, Liqun Shan. Her paper “Purified Distillation Slimming (PDS) for Robust Backdoor Defense” has been directly accepted by AsiaCCS 2026. 11/13/2025: Congratulations to my PhD student, Sai Venkatesh Chilukoti, who passed his PhD dissertation defense! He is the 4th PhD graduate from our group. 10/24/2025: will serve as a member of the Technical Program Committee of The 20th USENIX WOOT Conference on Offensive Technologies (WOOT ’26). 10/16/2025: I will serve as a member of the Technical Program Subcommittee for SEC2. Hardware Security: Primitives, Architecture, Design & Test in Design Automation Conference (DAC’26). 9/30/2025: Congratulations to my PhD student Liqun Shan. Her paper ‘AdvOSD: Adversarial One-Step Diffusion for Generalizable and Efficient Fake Image Detection‘ has been accept by Annual Computer Security Applications Conference 2025 (ACSAC’25). The acceptance rate is 20.7%. 7/21/2025: Our NSF MRI proposal “MRI: Track 1 Development of Metal 3D Printing Research Instrument with In-situ Characterization and Closed-loop Control Capability” has been awarded. CMMI-2510512. $650,000. 9/1/2025-8/31/2029. Thanks, NDF and anonymous reviewers! 7/13/2025: Our NSF proposal “IUCRC Planning Grant University of Louisiana at Lafayette (Lead Site): Center for Accessible Healthcare through AI-Augmented Decisions (AHeAD)” has been awarded. CNS-2515284. Thanks, NSF and the anonymous reviewers! Link 5/27/2025: I was awarded the IRI/BORSF Professorship in Digital Security and Resilience. 4/30/2025: I will serve as a member of the Technical Program Committee of the 56th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2026). 4/30/2025: Congratulations to my PhD student Md Imran Hossen, he will join Univ. of Tennessee at Chattanooga as a tenure-track assistant professor in Fall 2025! 3/20/2025: I delivered a Distinguished Lecture on “Investigate and Mitigate the Attacks Caused by Out-of-Band Signals” at Kennesaw State University. 3/20/2025: Congratulations to Liqun Shan! Her paper “LiveGuard: Voice Liveness Detection via Wavelet Scattering Transform and Mel Spectrogram Scaling” has been accepted by The 55th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2025), acceptance rate 20.2%. 2/21/2025: I host a Distinguished Lecture Talk from Dr. Gang Qu at University of Maryland at College Park. The title is “30 Years of Hardware Security Research — from Integrated Circuit and Computer Architecture to Machine Learning and Post-Quantum Cryptography”. Link 2/19/2025: My NAIRR project (Investigating Security Issues in Instruction-Tuned Large Language Code Models) was highlighted in 1st NAIRR PI meeting. long paper. 2/18/2025: I received my Achievement Award in Externally Funded Research at UL Lafayette. 1/28/2025: I will join USENIX WOOT 2025 Program Committee. 11/12/2024: I will join the  IEEE/ACM Workshop on the Internet of Safe Things (SafeThings 2025)  Program Committee. 11/12/2024: I will join the USENIX VehicleSec Symposium 2025 Program Committee. 10/13/2024: I will join the Program Committee of 62nd DAC 2025 in San Francisco, USA. 10/4/2024: Congratulations to Liqun Shan! Her paper “IdentityKD: Identity-wise Cross-modal Knowledge Distillation for Person Recognition via mmWave Radar Sensors” has been accepted by ACM Multimedia Asia 2024. 10/3/2024: Our paper “Injected and Delivered: Fabricating Implicit Control overActuation Systems by Spoofing Inertial Sensors” will be presented at the Top Picks in Hardware and Embedded Security Workshop at ICCAD’24. 10/3/2024: Congratulations to Liqun Shan! Her NAIRR Pilot proposal “Cross-modal Distillation with LLMs and Continuous-time Transformers for Blood Glucose Forecasting” (NAIRR240255) was funded by NSF/DoE. We can access NVIDIA’s cloud for free now. Link 9/5/2024: I delivered a CRII Highlight talk at NSF SaTC PI meeting 2024! Link1 9/4/2024: Alfred Chen, Yuan Tian, and I hosted a breakout session on Safeguarding Cyber-Physical Systems at the NSF SaTC PI Meeting 2024. 8/25/2024: We have two papers been accepted by SmartSP 2024: “Practitioner Paper: Decoding Intellectual Property: Acoustic and Magnetic Side-channel Attack on a 3D Printer” and “Ethical Considerations and Policy Implications for Large Language Models: Guiding Responsible Development and Deployment”. 6/3/2024: I will serve as a new Associate Editor to ACM Transactions on Computing for Healthcare (HEALTH)! Link 5/20/2024: Congratulations to Xingli Zhang and Yazhou Tu! Our paper “From Virtual Touch to Tesla Command: Unlocking Unauthenticated Control Chains From Smart Glasses for Vehicle Takeover” got a Distinguished Paper Award at IEEE SP 2024. Link 5/17/2024: Bing selected as EAI Fellow 2023! 5/10/2024: CFP for EAI SmartSP 2024 – 2nd EAI International Conference on Security and Privacy in Cyber-Physical Systems and Smart Vehicles is released. Link 5/9/2024: Our “REU Supplement: MRI: Development of High-Confidence Medical Cyber-Physical System Research Instrument with Benchmark Security Software” proposal has been awarded. $19,600. Thanks, NSF! 5/6/2024：Congratulations to Md Imran Hossen, his NAIRR Pilot proposal titled “Investigating Security Issues in Instruction-Tuned Large Language Code Models“(NAIRR240007) was funded by NSF/DoE. Only 35 projects were funded across USA. Link News 5/3/2024: Our long paper “Can’t say cant? Measuring and Reasoning of Dark Jargons in Large Language Models” has been accepted by EAI SecureComm 2024. Link 4/29/2024: Our short paper “Assessing Cybersecurity Vulnerabilities in Code Large Language Models” has been released. Link 3/9/2024: Congratulations to Xingli Zhang. Her paper “From Virtual Touch to Tesla Command: Unlocking Unauthenticated Control Chains From Smart Glasses for Vehicle Takeover” has been accepted by the 2024 IEEE Symposium on Security and Privacy (Oakland). Acceptance rate: 17.8%. Her paper won 1st STEM Paper at UL Lafayette competition in Spring 2024. Link 3/8/2024: I will join the editorial board of EAI Endorsed Transactions on Security and Safety, as an Editor-in-Chief (EiC). 3/3/2024: Our “REU Supplement: SATC: CORE: Small: Mitigating Threats of Physical-Domain Signal Injections on Security, Reliability, and Safety of Sensing and Control Systems” proposal has been awarded. $30,000. Thanks, NSF! 2/19/2024: I delivered an invited talk on “Investigate and Mitigate the Attacks Caused by Out-of-Band Signals” to The Johns Hopkins University’s IAA Seminar Series. Thanks for Dr. Cao’s host! Slides Link 2/7/2024: I am invited to give a talk on a biennial forum of the SaTC research community, the 2024 NSF SaTC PI meeting. Link 2/5/2024: Welcome Jason W Woodworth to join our team as a research scientist. 1/29/2024: Welcome Amirhossein Jamarani to join our team as a PhD student. 1/29/2024: Congratulations to Sai. His paper titled “A Reliable Diabetic Retinopathy Grading via Transfer Learning and Ensemble Learning with Quadratic Weighted Kappa Metric” has been accepted by BMC Medical Informatics and Decision Making. 1/29/2024: I will serve as a PC for the USENIX WOOT’24 Conference. 1/26/2024: As a PC, I have reviewed papers for SEED 2024, SDIoTSec’24, MADWeb 2024, VehicleSec’24. 11/13/2023: I delivered an online Distinguished Talk on “Investigate and Mitigate the Attacks Caused by Out-of-Band Signals” to Indiana University at Bloomington at 11 am Eastern Time. Thanks for Dr. Xing’s host. Link, Slides. 11/12/2023: I joined the Student Support Committee of NDSS 2024. Link to apply. 10/19/2023: I will visit The University of Pennsylvania in November 2023 as a visiting associate professor. 10/13/2023: I will serve as a general chair of SmartSP 2024. 10/13/2023: Our paper “ADC-Bank: Detecting Acoustic Out-of-Band Signal Injection on Inertial Sensors” got Best paper award at SmartSP’23. 9/1/2023: One research scientist position is open. Apply for it here: Link. 9/1/2023: Four minors’ free website to fight misinformation generated by AGI models is public now. Link 8/23/2023: Congratulations to Diba. Her paper titled “Securing the Future: Exploring Privacy Risks and Security Questions in Robotic Systems” was accepted by SmartSP’23. Link 8/17/2023: Congratulations to D",
  "content_length": 27029,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:13"
}