{
  "name": "Xiang Zhang 0012",
  "homepage": "https://xiangzhang.info/index.html",
  "status": "success",
  "content": "Xiang Zhang's Homepage ABOUT ME Xiang Zhang Xiang is an Assistant Professor in the Department of Computer Science at the University of North Carolina at Charlotte. Before joining UNC Charlotte, he was a postdoctoral fellow at Harvard University from March 2020 to July 2022. Xiang received his Ph.D. degree (in 2020) in Computer Science from the University of New South Wales (UNSW). His research interests lie in data mining and machine learning with applications in pervasive healthcare, medical time series, and Brain-Computer Interfaces (BCIs). Xiang's research outcomes have been published in prestigious conferences (such as ICLR, NeurIPS, and KDD) and journals (like Nature Computational Science). Recruiting: My team is actively looking for PhD applicants and research interns for research in machine learning, medical time series, and EEG. UNC Charlotte Machine Learning Lab (CharMLab) Xiang is serving as the director of CharMLab. CharMLab has 6 faculty members, 18 PhDs, and 15 MS/UG/K-12 level students, working broadly on Optimization, CV, NLP, Time Series, RL, Graph, Efficient ML, and related applications in healthcare, smart home, brain-computer interface, on-device computing, IoT, etc. Please feel free to contact for any collaboration. Publication Highlights Contrast Everything: A Hierarchical Contrastive Framework for Medical Time-Series (NeurIPS 2023) Keywords: contrastive learning, medical time series, self-supervised Read More Graph-Guided Network for Irregularly Sampled Multivariate Time Series (ICLR 2022) Keywords: graph neural networks, irregular time series, sparse time series, incomplete time series, message passing, ICU, sepsis detection Read More Population-scale identification of differential adverse events before and during a pandemic (Nature Computational Science) Keywords: pandemic, drug side effects, health inequity, demographics, FDA, FAERS Read More MindID: Person Identification from Brain Waves through Attention-based Recurrent Neural Network (Ubicomp 2018) Keywords: EEG, brain-computer interface, non-invasive, person identification, attention mechanism Read More News Stay updated with our latest trends Our work (FORMED) on repurposing backbone foundation Model for domain-specific MedTS analysis, is on arxiv https://arxiv.org/abs/2410.03794 Our paper, a new architecture (Medformer) for multivariate medical time series analysis, is accepted by NeurIPS 2024! Our paper on spatiotemporal heterogeneous learning for time series is accepted by ACM Multimedia 2024! Our paper, working on self-supervised contrastive learning for medical time series, is accepted by NeurIPS 2023! I gave a keynote at Brain-Machine Interface @ IEEE SMC 2023, served as session chair for \"Emerging Topics and applications of BMIs\", and jury for IEEE Brain Best Paper Award. It's my great honor to serve as director of CharMLab (https://charmlab.charlotte.edu). We have 6 faculties, 18 PhDs, and 15 MS/UG/K-12 level students, working broadly on Optimization, CV, NLP, Time Series, RL, Graph, Efficient ML, etc. Served as a panelist on the NSF SMALL Program. Served as a panelist on the AARG Program of the Alzheimer's Association. Thrilled to receive an NSF CRII award on Self-Supervised Contrastive Representation Learning for Medical Time Series! Our paper, working on self-supervised time series transfer learning, is accepted by NeurIPS 2022! Thrilled to serve AAAI2023 as PC member. Thrilled to serve AISTATS2023 as Area Chair. Excited to serve PerCom2023 as Publicity and Social Media Co-Chair. The 21st International Conference on Pervasive Computing and Communications (PerCom 2023) Our paper about irregular time series is accepted by ICLR 2022!!! Our paper about population-scale drug safety is accepted by Nature Computational Science!!! See More I was invited as guest editor at Frointer in Sustainable Cities! We are orgnizaing a Research Topic of \"AI-Powered Smart Healthcare in Smart Cities\"! Our paper is accepted by UbiComp 2021! Exciting to co-orgnize NSF National Symposium on Drug Repurposing for Future Pandemics Our survey about deep learning-based BCI is accepted by Journal of Neural Engineering! Our paper, GNNGuard, is accepted by NeurIPS 2020! I was selected in UNSW Alumni Profile. CSE News Our paper about EEG- and Gait-based user authentication is accepted by ACM TIST. Our paper about neurological diagnosis is accepted by J-BHI. I joined ZitnikLab (Machine Intelligence for Medicine and Science) as a postdoc at Harvard University! We have two papers been accepted by ICONIP 2019. Our paper is accepted by ICDM 2019 as full paper (acceptance rate 9%). I am awarded the Engineering PhD Summit of EPFL 2019 (11 Recipients Worldwide). I am awarded the KDD 2019 Student Travel Grant. I am invited as a reviewer of Artificial Intelligence in Medicine. Our paper is accepted by KDD 2019 Research Track! I am invited as the reviewer of IEEE Access. I am invited as the reviewer of Pattern Recognition Letters. I have received the Google PhD Fellowship 2018 (Only Four Awardee in Australia). Our paper about EEG-based Person Identification is accepted by Ubicomp 2018. Our paper about Multi-modality Sensor Data Classification is accepted by IJCAI 2018. Our paper is accepted by Percom 2018 Ph.D. Forum. Our paper about EEG-based Brain Typing System is accepted by PerCom 2018. Our paper about Brain-Computer Interface is accepted by Mobiquitous 2017. Our paper about smart living is accepted by ICONIP 2017.",
  "content_length": 5466,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:07"
}