{
  "name": "Xiangnan He 0001",
  "homepage": "http://staff.ustc.edu.cn/~hexn",
  "status": "success",
  "content": "Xiangnan He's Homepage News 1 May 2025 Four papers are accepted by ICML on LLM preference alignment and knowledge editing. 23 April 2025 Our ICLR paper \"AlphaEdit: Null-Space Constrained Model Editing for Language Models\" receives Outstanding Paper Award of ICLR 2025! 10 April 2025 Four papers are accepted by SIGIR on recommendation system with LLM fine-tuning, agent learning, and Diffusion model. 23 Jan 2025 Three papers are accepted by ICLR on LLM alignment, model editing, and unlearning. 21 Jan 2025 Three papers are accepted by WWW on LLM model editing, personalized generation, and recommendation. 26 Sep 2024 Two papers are accepted by NeurIPS on DPO for LLM and LLM for Recsys. 26 March 2024 Five full papers are accepted by SIGIR on recommendation topics of LLM, medication, and fairness. 2 Feb 2024 Three papers are accepted by WWW on LLM-based recommendation and graph condensation, and one short paper about proactive recommendation. 16 Jan 2024 Two papers are accepted by ICLR on LLM for molecule and recommendation debiasing. 9 Dec 2023 Two papers are accepted by AAAI on few-shot learning and text-to-image generation. 20 Nov 2023 I am invited to serve as the associate editor for IEEE Transactions on Knowledge and Data Engineering (TKDE). 22 Sep 2023 Six papers are accepted by NeurIPS on generative recsys, fairness, causal rec, ood generalization, gnn explanation, etc. 27 July 2023 One paper is accepted by IEEE Transactions on Big Data (TBD) on uncertainty modeling for recommendation. 26 July 2023 Our SIGIR'23 paper \"Alleviating Matthew Effect of Offline Reinforcement Learning in Recommendation\" receives Best Paper Honorable Mention. 26 July 2023 Two papers are accepted by ACM MM on few shot learning and CLIP-based image captioning. July 2023 Four papers are accepted by Recsys on Large Language Models (LLMs) and Drug Reaction Prediction. May 2023 One paper is accepted by ACL on counterfactual learning for OOD. 20 April 2023 One paper is accepted by IJCAI on invariant learning for unbiased recsys. 9 April 2023 One paper is accepted by ACM TOIS on filter bubble issue in interactive recsys. 6 April 2023 Four papers are accepted by SIGIR 2023 on various topics of recsys, e.g., offline RL, OOD robustness, diffusion models, etc. 31 March 2023 One paper is accepted by IEEE TNNLS on counterfactual prediction. 28 March 2023 One paper is accepted by CVPR on OOD for zero-shot learning. 26 Jan 2023 Four papers are accepted by WWW on graph anomaly detection, graph unlearning, and recsys. 22 Nov 2022 One paper is accepted by AAAI on group theory for knowledge graph reasoning. 18 Oct 2022 Three papers are accepted by WSDM on unbiased recsys distillation, gnn explanation, and graph anomaly detection. 23 Aug 2022 One paper on causal recommendation is accepted by ACM TOIS. 3 Aug 2022 Two dataset papers on recsys are accepted by CIKM. 3 July 2022 Five papers are accepted by ACM Multimedia. 10 June 2022 I serve as the associate editor for ACM Transactions on Recommender Systems (TORS). 19 May 2022 Two papers are accepted by KDD on causal learning for recsys and graph neural net. 16 May 2022 One paper is accepted by ICML on invariant graph learning. 20 April 2022 One paper is accepted by TPAMI on GNN Explanation. 31 March 2022 One paper is accepted by SIGIR on debiased recommendation. 3 March 2022 One paper is accepted by CVPR on video recognition. 24 Feb 2022 One paper is accepted by ACL on causal reasoning. 25 Jan 2022 I serve as the associate editor for IEEE Transactions on Big Data (TBD). 21 Jan 2022 One paper is accepted by ICLR on GNN explanation. 15 Jan 2022 Four papers are accepted by WWW on robustness and fairness of recsys and personalized search. 1 Dec 2021 One paper is accepted by TKDE on GCN for categorical node features. 1 Dec 2021 One paper is accepted by TKDE on GCN for categorical node features. 29 Sep 2021 One paper is accepted by NeurIPS 2021 on graph neural network explanations. 8 Aug 2021 Two papers are accepted by CIKM 2021 on disentangled graph learning and hierarchical community detection. 14 July 2021 Our SIGIR'21 paper \"Causal Intervention for Leveraging Popularity Bias in Recommendation\" receives Best Paper Honorable Mention. 5 July 2021 One paper is accepted by ACM Multimedia 2021 on classifying actions in videos. 6 June 2021 I serve as the associate editor for ACM Transactions on Information Systems (TOIS). 16 May 2021 Two papers are accepted by KDD, on causal inference for recsys. 15 April 2021 Five papers are accepted by SIGIR, on self-supervised, causal inference and debias for recsys and graph learning. 16 Jan 2021 Three papers are accepted by WWW, on gcn vs. label propagation, knowledge graph for recsys and causal embeddings for recsys. 1 Jan 2021 We will give a tutorial Bias Issues and Solutions in Recsys on WWW 2021. 30 Dec 2020 One paper is accepted by TOIS, on conversational recsys for cold users with EE tradeoff. 16 Nov 2020 One full paper is accepted by WSDM, on denoising implicit data for recsys. 16 May 2020 Two full papers are accepted by KDD, on conversational recsys and enterprise competition analysis. 24 April 2020 One tutorial about conversational recsys is accepted by SIGIR!. 23 April 2020 Two full papers from my USTC group are accepted by SIGIR, on GCN and meta-learning for recsys. Congrats to all! 20 April 2020 One paper is accepted by IJCAI about enhancing GCN with neighbor interactions. 9 April 2020 I serve as Editorial Board member of the AI Open journal. Welcome to submit! 11 Jan 2020 Two papers are accepted by WWW about knowledge graph-enhanced negative sampling and sequential recommendation. 28 Nov 2019 Two papers are accepted by TKDE about adversarial training on graph and multi-behavior recommendation. 11 Nov 2019 Two papers are accepted by AAAI 2020 about robust network embedding and unfollow prediction in social network. 11 Oct 2019 One paper is accepted by WSDM 2020 about conversational recommender system. 2 Oct 2019 Two papers are accepted by ICDE 2020 about price-aware recommendation recommendation, and neural relation extraction. 28 July 2019 Two papers are accepted by TKDE about group recommendation, and negative sampler with view data. 26 July 2019 One paper is accepted by TMM about multi-modal social event analysis, and one paper is accepted by ICCV 2019 (oral) about scene graph generation. 26 July 2019 One paper is accepted by TOIS on extending convolutional neural collaborative filtering. 11 May 2019 Three full papers are accepted by ACM Multimedia 2019, on micro-video recommendation, mix-dish recognition, and image subjective attributes. 30 April 2019 Four papers are accepted by KDD 2019 research track, about knowledge graph for recommendation, learning to regularize, sequential set prediction, and time series prediction, respectively. 14 April 2019 Three full papers are accepted by SIGIR 2019, about graph neural network for recommendation, knowledge-based recommendation and interpretable fashion matching, respectively. 23 Feb 2019 I am invited to be an area chair of the ACM Multimedia 2019 conference, of the multimedia search and recommendation track. 21 Jan 2019 Two papers are accepted by WWW 2019, about privacy-preserving cross-domain recommendation and knowledge graph based recommendation. 19 Jan 2019 Two papers are accepted by TOIS, about stock prediction and review-aware recommendation. 1 Jan 2019 One paper is accepted by TNNLS which explores the weights of missing data for matrix factorization. 1 Nov 2018 Two papers are accepted by AAAI 2019. One performs knowledge graph reasoning for explainable recommendation, one explores self-attention for Video QA. 22 Oct 2018 One paper about session-based recommendation is accepted by WSDM 2019. 27 Sep 2018 One paper about using multiple types of user behaviors for recommendation is accepted by ICDE 2019. 2 July 2018 Three full papers are accepted by MM 2018. One paper about multimodal dialog systems is in the Best Paper Final List. 16 May 2018 One full paper is accepted by UAI 2018. 27 April 2018 Two awards from WWW 2018! One short paper receives Best Poster Award, and one long paper receives Best Paper Award Honorable Mention. 23 April 2018 Two papers are accepted by IEEE Transactions on Knowledge and Data Engineering (TKDE)! 22 April 2018 Call for papers: MMSJ Special Issue on Multimedia Recommendation. 21 April 2018 Two full research papers are accepted by ACL 2018! 17 April 2018 Five full research papers are accepted by IJCAI 2018! 12 April 2018 Six full research papers are accepted by SIGIR 2018! 5 March 2018 Two tutorials are accepted by SIGIR 2018! 5 March 2018 I am invited to be a program committee member in MM 2018 and CIKM 2018. 25 Feb 2018 One poster paper advised by me is accepted by WWW 2018, about negative sampler for BPR. 28 Dec 2017 I am invited to be a program committee member in KDD 2018 and SIGIR 2018. 23 Dec 2017 One full paper about entity resolution is accepted by ICDE 2018. 22 Dec 2017 Three full papers advised by me are accepted by WWW 2018! About tree+embedding for explainable recommendation, aesthetic-aware clothing recommendation, and hypergraph learning. 4 Dec 2017 Our tutorial proposal on \"Deep Learning for Matching in Search and Recommendation\" is accepted by WWW 2018. 3 Dec 2017 I am invited to be a program committee member in ACL 2018 and PAKDD 2018. 13 Nov 2017 I am invited to be a program committee member in IJCAI 2018. Xiangnan HE Professor / Vice Dean School of Artificial Intelligence and Data Science University of Science and Technology of China 443 Huangshan Road, Hefei, China 230027 Email: xiangnanhe at gmail.com I lead the USTC Lab for Data Science. My research interests span Information Retrieval, Data Mining, and Artifical General Intelligence. I have over 100 publications appeared in several top conferences such as SIGIR, WWW, and KDD, and journals including TKDE, TOIS, and TNNLS. My work has received the Best Paper Award Honourable Mention in SIGIR (2023, 2021, 2016) and",
  "content_length": 49738,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:10"
}