{
  "name": "Xiang Ao 0001",
  "homepage": "https://aoxaustin.github.io",
  "status": "success",
  "content": "Ao, Xiang-ICT, CAS-Homepage Xiang Ao, Associate Professor Dr. Xiang Ao is a Professor in the State Key Laboratory of AI Safety, Institute of Computing Technology, Chinese Academy of Sciences(ICT, CAS). Before joining ICT, he received Ph.D. degree in Computer Science from the Institute of Computing Technology, CAS in 2015 and B.S. degree in Computer Science from Zhejiang University in 2010. His research interests include AI for Financial Security and AI Safety in Finance. He has authored more than 100 referred publications at prestigious international conferences and journals like The Innovation, IEEE TKDE, KDD, WWW, SIGIR, ACL, ICLR etc., and has served as Area Chair, SPC or PC members over top tier international conferences such as KDD, WWW, ACL, NeurIPS, ICML, AAAI, IJCAI, etc. He is supported by the National Key Research and Development Program of China, National Natural Science Foundation of China, CCF-Tencent Rhino-Bird Young Faculty Open Research Fund, CAAI-MindSpore Open Fund, Ant Financial Research Funds, Alibaba Innovative Research Project, ByteDance Research Funds, Youth Innovation Promotion Association CAS, Beijing Distinguish Young Scientist Program and Beijing Nova Program, etc.I'm always looking for talented and self-motivated interns with a strong interest/background in machine learning, data mining,  and/or mathematics. New: Positions for recruiting Ph.D. and Master students in Fall 2026 are closed. Always welcome the undergraduates who are interested in the position in the School of Future Technology of UCAS to contact me. Send your CV to me :-). Recent News [2025.11]: One paper \"Live or Lie: Action-Aware Capsule Multiple Instance Learning for Risk Assessment in Live Streaming Platforms\" is accepted by KDD2026. Congrats to Yiran![2025.08]: Two papers \"Beyond the Pre-Service Horizon: Infusing In-Service Behavior for Improved Financial Risk Forecasting\" and \"Dilution of Unreliable Information: Learning in Graph with Noisy Structures and Absent Attributes\" are accepted by ICDM2025. Congrats to Senhao and Xinxin![2025.08]: One paper \"Improved Personalized Headline Generation via Denoising Fake Interests from Implicit Feedback\" is accepted by CIKM2025. Congrats to Kejin![2025.05]: One paper \"Gradient-Adaptive Policy Optimization: Towards Multi-Objective Alignment of Large Language Models\" is accepted by ACL2025. Congrats to Chengao![2025.05]: One paper \"GRASP: Differentially Private Graph Reconstruction Defense with Structured Perturbation\" is accepted by KDD2025. Congrats to Zhiyu! Contacts Address: No. 156 Beiqing Rd., Haidian Dist., BJ, CHN Phone: +86 (10) 6260 0537 E-mail: aoxiang [at] ict [dot] ac [dot] cn © Last modified on Nov. 2025 by Xiang Ao ‌Drag and Drop Website Builder",
  "content_length": 2742,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:04"
}