{
  "name": "Xiangnan Kong",
  "homepage": "https://www.wpi.edu/people/faculty/xkong",
  "status": "success",
  "content": "Xiangnan Kong | Worcester Polytechnic Institute Skip to main content Office Unity Hall, Rm 382, Phone (O): 508-831-5860 Phone +1 (508) 8315000 x5860 Homepage Xiangnan Kong Computer Science Associate Professor Affiliated Department or Office Computer Science Data Science Education BS Nanjing University 2006 MS Nanjing University 2009 PhD University of Illinois at Chicago 2014 Professor Kong’s research interests focus on data mining and machine learning, with emphasis on addressing the data science problems in biomedical and social applications. Data today involves an increasing number of data types that need to be handled differently from conventional data records, and an increasing number of data sources that need to be fused together. Dr. Kong is particularly interested in designing algorithms to tame data variety issues in various research fields, such as biomedical research, social computing, neuroscience, and business intelligence. He has been working on mining graph data in the domains of neuroscience, biomedical informatics and social networks, and has published papers in top conferences and journals of data mining, including KDD, ICDM, SDM, WWW, WSDM, CIKM, TKDE. Xiangnan Kong Computer Science Associate Professor Affiliated Department or Office Computer Science Data Science Education BS Nanjing University 2006 MS Nanjing University 2009 PhD University of Illinois at Chicago 2014 Professor Kong’s research interests focus on data mining and machine learning, with emphasis on addressing the data science problems in biomedical and social applications. Data today involves an increasing number of data types that need to be handled differently from conventional data records, and an increasing number of data sources that need to be fused together. Dr. Kong is particularly interested in designing algorithms to tame data variety issues in various research fields, such as biomedical research, social computing, neuroscience, and business intelligence. He has been working on mining graph data in the domains of neuroscience, biomedical informatics and social networks, and has published papers in top conferences and journals of data mining, including KDD, ICDM, SDM, WWW, WSDM, CIKM, TKDE. Office Unity Hall, Rm 382, Phone (O): 508-831-5860 Phone +1 (508) 8315000 x5860 Homepage Research Interests Data Mining Machine Learning Scholarly Work Current list of publications 2022",
  "content_length": 2405,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:11"
}