{
  "name": "Xiang Gao 0012",
  "homepage": "https://gaoxiang9430.github.io",
  "status": "success",
  "content": "Xiang Gao Xiang Gao (高祥) Associate Professor Computer Science Beihang University, China xiang_gao [at] buaa.edu.cn Personal email: gaoxiang9430 [at] gmail.com I am a Pre-tenure Associate Professor at Beihang University. Before joining Beihang, I was a postdoc at National University of Singapore under the supervision of Abhik Roychoudhury. I have been a PhD student in the same group. I got my bachelor degree of Computer Science (Elite Class) from ShanDong University in 2016. My research is focused on using program analysis, test generation and formal method to aid users in fixing software bugs and writing programs. I design techniques to improve the quality of automatically generated programs. Some of my projects have been in collaboration with groups at Fujitsu Laboratories of America with Mukul Prasad, Microsoft Research with Nachiappan Nagappan and Sumit Gulwani. My research interests include: Program Analysis; Software Security; Automated Program Repair; I am looking for self-motivated Ph.D, master, undergraduate students and interns with strong programming skills. If you are interested in my projects, feel free to contact me. Recent Update Sep, 2025 Our ICSME'25 paper Code Property Graph Meets Typestate: A Scalable Framework to Behavioral Bug Detection won IEEE TCSE Distinguished Paper Award. Jun, 2024 Our FSE'24 paper ProveNFix: Temporal Property guided Program Repair won ACM SIGSOFT Distinguished Paper Award. Mar, 2024 Our SANER'24 paper Investigating and Detecting Silent Bugs in PyTorch Programs won IEEE TCSE Distinguished Paper Award. Feb, 2024 Our ICSE'24 paper Modularizing while Training: A New Paradigm for Modularizing DNN Models won ACM SIGSOFT Distinguished Paper Award. Jan, 2024 Our paper ProveNFix: Temporal Property guided Program Repair has been accepted by the FSE'24 research papers track. Dec, 2023 Our paper Investigating White-Box Attacks for On-Device Models has been accepted by the ICSE'24 research papers track. Nov, 2023 Our paper Reusing Convolutional Neural Network Models through Modularization and Composition has been accepted by TOSEM as research paper. Aug, 2023 Our paper Automated Fixing of Web UI Tests via Iterative Element Matching has been accepted by the ASE'23 research papers track. Jun, 2023 Our paper Modularizing while Training: A New Paradigm for Modularizing DNN Models has been accepted by the ICSE'24 research papers track. May, 2023 Our paper ModelObfuscator: Obfuscating Model Information to Protect Deployed ML-based Systems has been accepted by the ISSTA'23 technical papers track. Dec, 2022 Two papers have been accepted by the ICSE'23 research papers track. Sep, 2022 Invited to serve on the program committee of ICSE 2024 research papers track. Aug, 2022 Our paper Patching Weak Convolutional Neural Network Models through Modularization and Composition has been accepted by the ASE'22 research papers track. Apr, 2022 Our paper Program Vulnerability Repair via Inductive Inference has been accepted by the ISSTA'22 technical papers track. Dec, 2021 I joined Beihang University as Pre-tenure Associate Professor. Dec, 2021 Our paper Trust Enhancement Issues in Program Repair has been accepted by the ICSE'22 technical papers track. Sep, 2021 I have successfully defended my phd thesis Overfitting in Program Repair and Program Synthesis Jul, 2021 Our paper \"Scalable Fuzzing of Program Binaries with E9AFL\" has been accepted by ASE'21 demonstration track. Jul, 2021 Our artifact for paper Automated Patch Backporting in Linux (Experience Paper) won the Distinguished Artifact Award. Jul, 2021 Our paper \"APIfix: Output-Oriented Program Synthesis for Combating Breaking Changes in Libraries\" has been conditionally accepted by the OOPSLA'21 technical papers track. Apr, 2021 Our paper Automated Patch Backporting in Linux (Experience Paper) has been accepted by the ISSTA'21 technical papers track.",
  "content_length": 3884,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:05"
}