{
  "name": "Xiang Wang 0010",
  "homepage": "https://xiangwang1223.github.io",
  "status": "success",
  "content": "Xiang Wang, University of Science and Technology of China Xiang Wang Home Research Publications Professor School of Data Science School of Cyber Science and Technology School of Information Science and Technology University of Science and Technology of China Email: xiangwang1223 at gmail.com • Google Scholar Page • GitHub Page Biography I am a Professor in University of Science and Technology of China, where I am a member of Lab of Data Science. With my colleagues, students, and collaborators, we strive to develop trustworthy deep learning and artificial intelligence algorithms with better interpretability, generalization, and robustness. Our research is motivated by, and contributes to, graph-structured applications in information retrieval (e.g., personalized recommendation), data mining (e.g., graph pre-training), security (e.g., fraud detection in fintech, information security in system), and multimedia (e.g., video question answering). Our work has over 50 publications in top-tier conferences and journals. Over 10 papers have been featured in the most cited and influential list (e.g., KDD 2019, SIGIR 2019, SIGIR 2020, SIGIR 2021) and best paper finalist (e.g., WWW 2021, CVPR 2022). Moreover, I have served as the PC member for top-tier conferences including NeurIPS, ICLR, SIGIR and KDD, and the invited reviewer for prestigious journals including JMLR, TKDE, and TOIS. Prospective Ph.D., Master, and Undergraduate Students I am looking for highly motivated students (PhD, master, undergraduate students) to work together on trustworthy deep learning on graph, especially pre-training, interpretability, generalization, and robustness, and their applications in real-world scenarios. Please feel free to send me your CV and transcripts, if you have interest. We are also actively looking for opportunities in research, partnership and commercialization in exciting data science projects. News [New!] 2024/04 Two papers are accepted by TOIS'24! Big congrats to Jiancan Wu, Yunshan Ma and Other Collaborators! On the Effectiveness of Sampled Softmax Loss for Item Recommendation. MultiCBR: Multi-view Contrastive Learning for Bundle Recommendation. [New!] 2024/03 Three papers are accepted by SIGIR'24! Big congrats to An Zhang, Jiayi Liao, Yuyue Zhao and Other Collaborators! On Generative Agents for Recommendation. Llara: Aligning Large Language Models with Sequential Recommenders. Let Me Do It For You: Towards LLM Empowered Recommendation via Tool Learning. [New!] 2024/02 Four papers are accepted by WWW'24! Big congrats to An Zhang, Junfeng Fang, Yuan Gao, Yongduo Sui and Other Collaborators! General Debiasing for Graph-based Collaborative Filtering via Adversarial Graph Dropout. EXGC: Bridging Efficiency and Explainability in Graph Condensation. Invariant Graph Learning for Treatment Effect Estimation from Networked Observational Data. Graph Anomaly Detection with Bi-level Optimization. Selected Papers Neural Graph Collaborative Filtering in SIGIR 2019. The Most-Cited SIGlR Paper in over past five years (2018 - 2023) Xiang Wang , Xiangnan He, Meng Wang, Fuli Feng, Tat-Seng Chua. LightGCN: Simplifying and Powering Graph Convolution Network for Recommendation in SIGIR 2019. The Most-Cited Paper in SIGIR 2020 Xiangnan He, Kuan Deng, Xiang Wang, Yan Li, Yongdong Zhang, Meng Wang. KGAT: Knowledge Graph Attention Network for Recommendation in KDD 2019. The 3rd-Most Cited paper in KDD 2019 Xiang Wang, Xiangnan He, Yixin Cao, Meng Liu, Tat-Seng Chua. Self-supervised Graph Learning for Recommendation in SIGIR 2021. The Most-Cited paper in SIGIR 2021 Jiancan Wu, Xiang Wang*, Fuli Feng, Xiangnan He, Liang Chen, Jianxun Lian, Xing Xie. Learning Intents behind Interactions with Knowledge Graph for Recommendation in WWW 2021. The 3rd-Most Cited Paper in WWW 2021 Xiang Wang, Tinglin Huang, Dingxian Wang, Yancheng Yuan, Zhenguang Liu, Xiangnan He, Tat-Seng Chua. Disentangled Graph Collaborative Filtering in SIGIR 2020. The 5th-Most Cited Paper in SIGIR 2020. Xiang Wang, Hongye Jin, An Zhang, Xiangnan He, Tong Xu, Tat-Seng Chua. Explainable Reasoning over Knowledge Graph Paths for Recommendation in AAAI 2019. The 15th-Most Cited Paper in AAAI 2019. Xiang Wang, Dingxian Wang, Canran Xu, Xiangnan He, Yixin Cao, Tat-Seng Chua. Honors and Awards Elsevier 2023 Most Cited Chinese Researcher, 2024 Frontier of Science Award, International Basic Science Conference, 2023 AI 2000 Most Influential Scholar in AI, ranked 6th in the field of \"Information Retrieval and Recommendation\", 2022, 2023, 2024 Best Paper Award Finalist, CVPR 2022 Best Paper Award Finalist, WWW 2021 Dean's Graduate Research Excellence Award, National University of Singapore 2018 Research Achievement Award, National University of Singapore 2017 National Scholarship (top scholarship for Chinese undergraduates), Beihang University 2014 Background 2021-2022: Senior Research Fellow, NExT++, National University of Singapore Supervisor: Prof Tat-Seng Chua 2019-2021: Research Fellow, NExT++, National University of Singapore Supervisor: Prof Tat-Seng Chua 2014-2019: PhD in Computer Science, NExT++, National University of Singapore Supervisor: Prof Tat-Seng Chua; Mentor: Prof Xiangnan He, Prof Liqiang Nie 2010-2014: Bachelor in Computer Science, Beihang University Webpage template borrows from Prof Xiangnan He and Prof Xia Hu",
  "content_length": 5343,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:06"
}