{
  "name": "Xiang Ren 0001",
  "homepage": "https://shanzhenren.github.io",
  "status": "success",
  "content": "Sean (Xiang) Ren - USC Computer Science Curriculum Vitae / Bio Sean (Xiang) Ren xiangren [at] usc.edu Andrew and Erna Viterbi Early Career Chair Associate Professor, USC Computer Science Research Team Leader, USC ISI Director, USC INK Research Lab Forbes' Asia 30 Under 30 MIT TR Innovator 35 (Asia Pacific) Follow @xiangrenNLP Publications / Group / Research Google Scholar / GitHub I'm an Associate Professor in Computer Science and the Andrew and Erna Viterbi Early Career Chair at USC, where I'm the PI of the Intelligence and Knowledge Discovery (INK) Research Lab. I also hold appointment as a Research Team Leader in Information Sciences Institute (ISI) and serve as a member of the USC NLP Group, USC Machine Learning Center and ISI Center on Knowledge Graphs. Outside of my USC work, I spend time at Allen Institute for AI (AI2) working on machine common sense. Previously I was a Data Science Advisor at Snapchat. Prior to USC, I did my PhD work in computer science at UIUC. I've also spent time with the NLP group and the SNAP group at the Stanford University. My research seeks to build generalizable natural language processing (NLP) systems that can handle a wide variety of language tasks and situations, to broaden the scope of model generality. I work on new algorithms and datasets to make NLP models cheaper to build and maintain, arm AI models with common sense, and improve model's transparency and reliability to build user trust. My group (INK Lab) recently focuses on: (1) creating evaluation methods and datasets that expose the state-of-the-art NLP systems in various human reasoning scenarios; (2) building novel learning algorithms and model architectures to augment NLP systems with commonsense and factual knowledge; (3) developing graph neural network methods for relational reasoning; and (4) verifying and enhancing the robustness of NLP models. We're also interested in extract machine-actionable knowledge from natural language data, perform neural-symbolic knowledge reasoning for intelligent applications, and learning (to adapt and improve) from human explanations and instructions. Please check out the our group website for more information. Our research work is funded by NSF (CAREER award, SciSIP #1829268), DARPA (MCS, KMASS, INCAS, SCORE, GAILA, SAIL-ON), IARPA (HIATUS, BETTER), and gifts from industry partners including Google, Amazon, Meta, JP Morgan, Adobe, Sony, and Snapchat. A summary of my PhD work on label-efficient NLP can be found in the book \"Mining Structures of Factual Knowledge from Text: An Effort-Light Approach\". News 2/ 2024 - Our paper \"Personalized entity recommendation: a heterogeneous information network approach\" (WSDM 2014) received the Test of Time Award at WSDM 2024! 11/ 2023 - Thrilled to receive the 2023 Samsung AI Researcher of the Year! 11/ 2023 - Thrilled to be named as MIT Technology Review Innovators Under 35 (Asia Pacific)! 8/ 2023 - Thrilled to be one of the seven awardees for the 2023 Okawa Research Grant! 6/ 2023 - Thrilled that our paper \"SCOTT: Self-Consistent Chain-of-Thought Distillation\" receives the 2023 ACL Outstanding Paper Award! 3/ 2023 - INK lab has 11 papers accepted to ACL 2023 conference, covering topics on LLM reasoning, explainability, and inference efficiency. 12/ 2022 - Our paper on Grounded Planning for Embodied Tasks with Language Models is accepted to AAAI 2023! 11/ 2022 - Talked about commonsense reasoning challenges for LLM at the UPenn NLP seminar 10/ 2022 - Talked about evaluation methods for commonsense reasoning at the HiTZ (Basque Center for Language Technology). Video can be found here 9/ 2022 - I'm honored to be appointed as the Andrew and Erna Viterbi Early Career Chair at USC. 7/ 2022 - Our paper NewsEdits, led by Alexander, won an Outstanding Paper Award at NAACL 2022 for its contribution to best resource. 5/ 2022 - Serve as senior area chair for EMNLP 2022 on commonsense reasoning 4/ 2022 - Excited to be selected as a Google Research Scholar. 4/ 2022 - Start part time as a visiting research scientist at AI2. 2/ 2022 - Gave a talk at AI2 about commonsense reasoning in the wild. Check out slides for our recent work. 12/ 2021 - Chenguang, Yuchen, Yicong, Meng, Wenhao and I will be giving a tutorial \"Knowledge-Augmented Methods for Natural Language Processing\" at ACL 2022. 12/ 2021 - Excited to start a collaborative project on bias mitigation of NLP models supported by a Facebook Research Award. 11/ 2021 - Excited to co-organize three workshop in 2022 *CL conferences: Workshop on Commonsense Representation and Reasoning and FL4NLP at ACL 2022, and DeepLo at NAACL 2022 10/ 2021 - I will serve as an action editor (area chair) for ACL Rolling Review. 09/ 2021 - INK lab has 3 papers accepted at NeurIPS 2021 (one spotlight, two posters), presenting new results on explanation-based for NLP and continual learning. 08/ 2021 - INK lab has 9 papers accepted at EMNLP 2021 and 3 papers accepted to Findings of EMNLP. Congratulations to all authors! 07/23/ 2021 - Our lab received a research award from USC + Amazon Center on Secure and Trusted Machine Learning to work on federated learning for NLP -- media coverage by Amazon and USC. 07/ 2021 - Serve as area chair for EMNLP 2021, ICLR 2022, and AAAI 2022. 06/ 2021 - USC covers our K-12 outreach activities on explaining to high school kids how AI can be applied to help combat online hate speech. 06/ 2021 - Congratulations to Dongho, Ravi and the other authors for their paper \"AutoTriggER: Named Entity Recognition with Auxiliary Trigger Extraction\" wining the Best Paper Award at NAACL TrustNLP workshop! 05/ 2021 - INK lab has 7 papers accepted to ACL 2021 and its findings, spanning over analysis of language models regarding common sense, question answering, and explanation-based learning. 04/ 2021 - Our group won a NSF CAREER award to support the work on teaching machine through human explanations. 04/ 2021 - Our work on probing languages models (NumerSense) and knowledge-aware graph networks (KagNet) got covered by Communications of the ACM. 04/ 2021 - Giving an invited talk at Amazon Alexa AI. 03/ 2021 - INK lab has 4 papers accepted at NAACL 2021, with topics spanning over bias mitigation, open-ended commonsense reasoning, and cross-lingual learning 03/ 2021 - Very happy to participate at USC Viterbi's K-12 outreach with Theodore Roosevelt High School and STEM Academy Hollywood. 02/ 2021 - Excited to give an invited talk at UIUC NLP Seminar on \"Teaching Machine through Human Explanations\". Slides are available now. 01/ 2021 - Check out our new papers on pre-training for concept-centric common sense and deceiving knowledge graph-augmented models; both accepted to ICLR 2021. 11/ 2020 - Our EMNLP work CommonGen and NumerSense got covered by Tech Xplore, Radio.com, EurekAlert and ScienceDaily. 11/ 2020 - Our team got selected to participate in the 4th Alexa Prize Socialbot Grand Challenge. 10/ 2020 - I'm serving as Area Chair for ACL 2021, NAACL 2021 and IJCAI 2021. 09/ 2020 - INK lab has 12 papers accepted to EMNLP 2020 (7 to the main conference and 5 to Findings of EMNLP). 08/ 2020 - I'm serving as Senior Area Chair for AAAI 2021. 08/ 2020 - I will join a penal in DaSH@KDD 2020 to discuss open challenges in human-computer cooperation in data science, with Azza Adouzied, AnHai Doan, and Marti Hearts. 07/ 2020 - Our ACL work on examining and reducing biases in hate speech detection algorithms is featured by Digital Trends, ScienceDaily, EurekAlert, Unite.AI, and USCViterbi. Jul, 2020 - Will serve as area chair in ICLR 2021. May, 2020 - INK lab members Ryan Moreno and Lily Cao won Undegraduate Outstanding Student Award from USC. Congratulations! May, 2020 - Our paper \"NERO: A Neural Rule Grounding Framework for Label Efficient Relation Extraction\" received Best Paper Award Runner-up at The Web Conference 2020! Apr, 2020 - INK Lab has four papers accepted at ACL 2020. Apr, 2020 - Our LEAN-LIFE system for label-efficient, explanation-based annotation has been accepted to ACL 2020 demo track. Mar, 2020 - Excited to receive a Sony Faculty Research Award to support our work on learning from natural language explanations. Mar, 2020 - Will serve as area chair for ML on NLP in EMNLP 2020. Feb, 2020 - Give invited talk about \"Fast Learning with Explanation and Prior Knowledge\" at CMU LTI colloquium and UT Austin. Dec, 2019 - INK lab has two papers (spotlight & poster) accepted at ICLR 2020. Nov, 2019 - Invited talk at CMU LTI Colloquium in Feb, 2020. Sep, 2019 - Excited to receive a data science research award from Adobe Research to work on neural symbolic learning for recommendation. Aug, 2019 - INK lab members have 10 papers accepted at EMNLP 2019. Congratulations! June, 2019 - We're excited to receive a gift award from Snapchat to work on modular neural networks for interpretable NLP! June, 2019 - We received a DARPA GAILA grant to work on building AI to mimic children language learning. May, 2019 - Serve as area chair for EMNLP 2019, ACL 2019; as senior PC for AAAI 2020. Mar, 2019 - Excited to receive a Google Faculty Award for supporting our research on explainable recommendation. Mar, 2019 - Our research on interpretable knowledge reasoning is funded by JP Morgan AI Research Award. Feb, 2019 - As part of the USC/ISI team, we received DARPA award to work on Machine Commonsense and Learning with Less Data. Jan, 2019 - Our research on neural-symbolic deep learning for NLP is funded by an Amazon Research Award. Dec, 2018 - Organizing the ICLR 2019 LLD Workshop on learning from limited labeled data. Dec, 2018 - Organizing the RepL4NLP Workshop at ACL 2019 on representation Learning for NLP. We're soliciting submissions. Nov, 2018 - Organizing the DeepLo Workshop at EMNLP 2019 on deep learning for low-resource NLP. Talks Upcoming: Previous: Reflex or Reflect: When Do Language Tasks Need Slow Reasoning? [slides], 2023. @UCSD AI seminar, SoCal NLP Symposium, ACL Workshop on Narrative Understanding; World Young Leader Ins",
  "content_length": 13529,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:07"
}