{
  "name": "Xianpei Han",
  "homepage": "http://www.icip.org.cn/team/hanxianpei",
  "status": "success",
  "content": "Xianpei Han – ICIP站点 Xianpei Han hanxianpei 2025-09-22T21:26:53+00:00   韩先培（Professor）Email:   xianpei{at}iscas{dot}ac{dot}cnAddress：Room 1202, 4#  South  Fourth Street, Zhong Guan Cun, Haidian District,BeijingLinksACL AnthologyGoogle ScholarCIPSInformation Retrieval LaboratoryInstitute of Software, Chinese Academy of SciencesBIOGRAPHYI am a Professor (Associate Professor 2012.12-2018.9; Assistant Professor 2010.7-2012.12) of Computer Science in the CIPS Laboratory at the Institute of Software, Chinese Academy of Sciences. I received my PhD degree in Pattern Recognition and Intelligent Systems from National Laboratory of Pattern Recognition(NLPR), Institute of Automation, Chinese Academy of Sciences under the Supervision of Professor Jun Zhao in July, 2010.Chinese Version：韩先培，中科院软件所研究员、博士生导师、中文信息处理实验室副主任，主要研究方向大模型、知识工程和自然语言处理，承担战略先导计划、AI 2030、国家重点研发计划等十余项课题。在ACL、NeurIPS、ICLR、SIGIR等重要国际会议发表论文60余篇，论文入选EDBT 25最佳论文奖亚军、ACL 24领域主席奖、SIGIR、AAAI和ACL等重要会议的年度最具影响力论文。成果应用于阿里Qwen大模型、百度PaddleNLP套件、小米小爱音箱等互联网需求，落地于北京冬奥、中船、兵器等国家需求。入选国家优青、中国科协青年人才托举计划及北京智源青年科学家，担任中国中文信息学会理事及语言与知识计算专业委员会副主任，获中国中文信息学会青年创新奖一等奖及科学技术奖一等奖。Google Scholar: https://scholar.google.com/citations?user=pA88bm4AAAAJDBLP: https://dblp.org/pid/57/2368.htmlACL Anthology: https://aclanthology.org/people/x/xianpei-han/Semantic Scholar: https://www.semanticscholar.org/author/Xianpei-Han/3194601RESEARCH INTERESTSMy research interests center on large language models and its applications in IR, NLP and Science, including:Learning of LLMs: Pretraining, SFT, RLHF, Alignment…Abilities of LLMs: Instruction following, In-context Learning, Reasoning, Planning, …Understanding of LLMs: Interpretability, Evaluation, Safety, Knowledge Probing, …Applications of LLMs: AI4Science, AI4Intelligence, QA, …Current Research Projects自然科学基金重点课题，62536008，大模型情感价值对齐认知及可信决策理论研究，2026.01-2030.12，231万，在研，参与国家重点研发计划课题，2024YFC3308001，跨媒介的证券活动及行为主体感知关键技术，2025.05-2028.04，300万，在研，主持中国科学院稳定支持基础研究领域青年团队（CAS Project for Young Scientists in Basic Research，Grant No.YSBR-040），开放环境下的可信智能算法，2022-2026，~2500万，在研，参与（1/10）中国科学院战略性先导科技专项（A类）课题，面向XXXX的知识推理，2020.7-2025.6，~5000万，在研，主持AI联合体项目，基于大模型的向量检索应用技术研究，2023.12-2025.12, 400万，在研，主持北京市自然科学基金-小米创新联合重点基金，大语言模型知识的表征、学习、记忆和注入机制分析与验证（Beijing Natural Science Foundation（L243006）), 500万, 2024.7 – 2026.6，在研已结题：自然科学基金优秀青年科学基金项目(National Science Fund for Excellent Young Scholars)，62122077，认知启发的自然语言理解(Cognitively Inspired Natural Language Understanding),2022.01 – 2024.12，200万，在研，主持科技部科技创新2030-“新一代人工智能“重大项目课题(AI 2030)，2020AAA0106400，可解释文本生成与语言进化计算，2020.11-2023.10，215万自然科学基金联合重点项目，U1936207，基于认知计算的热点事件分析与推理，2020.01-2023.12，259万国家重点研发计划，2018YFB1005102，知识关联与事件推理类问题求解关键技术与系统(二期)，2018.10-2022.10，237万国家语委重大科研项目，中华经典诗词知识图谱构建技术研究(No. WT135-24, 550K, 2017-2020)科技部国家重点研发计划，”基于大数据的面向开放域的智能问答技术(Open domain Question Answering)(1,690K, No. 2017YFB1002104: 2017.10-2021.09)”自然科学基金面上项目 , “开放域语义关系抽取、表示与计算关键技术研究(Research on Key techniques of open domain relation extraction, representation and computation)(No. 61572477, 760K 2016.01-2019.12)”自然科学基金重点项目 , “汉语认知加工机制与计算模型”(The Research of Cognitive Processing and Computational Model of Chinese)(No. 61433015, 3,500k, 2015.01-2019.12)”科技部863项目”面向基础教育的知识关联与推理类问题求解关键技术与系统(Educational Question Answering)(No. 2015AA015405,2015.01-2017.12)”自然科学基金青年项目, “面向异构Web信息源的语义知识获取和融合关键技术研究(Semantic Knowledge Acquisition from Heterogeneous Web Knowledge Sources)(No. 61100152  2012.01-2014.12)”SELECTED PUBLICATIONS(See Publications – ICIP站点)Shan Wu, Chunlei Xin, Bo Chen, Xianpei Han, and Le Sun. Semantic-aware Contrastive Learning for More Accurate Semantic Parsing. In proceedings of EMNLP 2022.Tianshu Wang, Hongyu Lin, Cheng Fu, Xianpei Han, Le Sun, Feiyu Xiong, Hui Chen, Minlong Lu, Xiuwen Zhu. Bridging the Gap between Reality and Ideality of Entity Matching: A Revisting and Benchmark Re-Constrcution. In proceedings of IJCAI-ECAI 2022.Yaojie Lu, Qing Liu, Dai Dai, Xinyan Xiao, Hongyu Lin, Xianpei Han, Le Sun, Hua Wu. Unified Structure Generation for Universal Information Extraction. In Proceedings of ACL 2022(CCF-A).Fangchao Liu, Hongyu Lin, Xianpei Han, Boxi Cao, Le Sun. Pre-training to Match for Unified Low-shot Relation Extraction. In Proceedings of ACL 2022(CCF-A).Boxi Cao, Hongyu Lin, Xianpei Han, Fangchao Liu, Le Sun. Can Prompt Probe Pretrained Language Models? Understanding the Invisible Risks from a Causal View. In Proceedings of ACL 2022(CCF-A).Jiawei Chen, Qing Liu, Hongyu Lin, Xianpei Han, Le Sun. Few-shot Named Entity Recognition with Self-describing Networks. In Proceedings of ACL 2022(CCF-A).Ruoxi Xu, Hongyu Lin, Meng Liao, Xianpei Han, Jin Xu, Wei Tan, Yingfei Sun, Le Sun. Towards Event-Centric Opinion Mining. In Findings of ACL 2022(CCF-A).Jialong Tang, Hongyu Lin,Meng Liao,Yaojie Lu, Xianpei Han, Le Sun, Wenli Yu, Jin Xu. Procedural Text Understanding via Scene-wise Evolution. In: Proceedings of Thirty-Sixth AAAI Conference on Artificial Intelligence(AAAI 2022, CCF A)Xiaoyang Chen, Kai Hui, Ben He, Xianpei Han, Le Sun and Zheng Ye.Incorporating Ranking Context for End-to-End BERT Re-ranking. In: Proceedings of 44th European Conference on Information Retrieval(ECIR 2022).Yaojie Lu, Hongyu Lin, Jialong Tang, Xianpei Han, Le Sun. End-to-End Neural Event Coreference Resolution. Artificial Intelligence, Volume 303, February 2022, 103632.Lingyong Yan, Xianpei Han and Le Sun. Progressively Adversarial Learning for Bootstrapping: A Case Study on Entity Set Expansion. In: Proceedings of EMNLP 2021 (CCF B).Qing Liu, Hongyu Lin, Xinyan Xiao, Xianpei Han, Le Sun and Hua Wu. Fine-grained Entity Typing via Label Reasoning. In: Proceedings of EMNLP 2021 (CCF B).Jiawei Chen, Hongyu Lin, Xianpei Han and Le Sun. Honey or Poison? Solving the Trigger Curse in Few-shot Event Detection via Causal Intervention. In: Proceedings of EMNLP 2021 (CCF B).Zhi Zheng, Kai Hui, Ben He, Xianpei Han, Le Sun, Andrew Yates, Contextualized query expansion via unsupervised chunk selection for text retrieval, In: Information Processing & Management,Volume 58, Issue 5, 2021.Yaojie Lu, Hongyu Lin, Jin Xu, Xianpei Han, Jialong Tang, Annan Li, Le Sun, Meng Liao, Shaoyi Chen. TEXT2EVENT: Controllable Sequence-to-Structure Generation for End-to-end Event Extraction. In: Proceedings of ACL 2021.Fangchao Liu, Lingyong Yan, Hongyu Lin, Xianpei Han, Le Sun. Element Intervention for Open Relation Extraction. In: Proceedings of ACL 2021.Jialong Tang, Hongyu Lin, Meng Liao, Yaojie Lu, Xianpei Han, Le Sun, Weijian Xie, Jin Xu. From Discourse to Narrative: Knowledge Projection for Event Relation Extraction. In: Proceedings of ACL 2021.Shan Wu, Bo Chen, Chunlei Xin, Xianpei Han, Le Sun, Weipeng Zhang, Jiansong Chen, Fan Yang and Xunliang Cai. From Paraphrasing to Semantic Parsing: Unsupervised Semantic Parsing via Synchronous Semantic Decoding. In: Proceedings of ACL 2021.Boxi Cao, Hongyu Lin, Xianpei Han, Le Sun, Lingyong Yan, Meng Liao, Tong Xue, Jin Xu. Knowledgeable or Educated Guess: Rethinking Masked Language Models as Factual Knowledge Bases. In: Proceedings of ACL 2021.Wenkai Zhang, Hongyu Lin, Xianpei Han, Le Sun. Learning De-biased Distantly Supervised NER with Biased Dictionary via Causal Intervention. In: Proceedings of ACL 2021.Wenkai Zhang, Hongyu Lin, Xianpei Han,Le Sun, Huidan Liu, Jing Yuan, Zhicheng Wei. Denoising distantly supervised named entity recognition via a hypergeometric probabilistic model. In: Proceedings of AAAI 2021.Ning Bian, Xianpei Han, Bo Chen, Le Sun. Benchmarking Knowledge-enhanced Commonsense Question Answering via Knowledge-to-Text Transformation. In: Proceedings of AAAI 2021.Hongyu Lin, Yaojie Lu, Jialong Tang, Xianpei Han, Le Sun, Zhicheng Wei and Nicholas Jing Yuan. A Rigorous Study on Named Entity Recognition: Can Fine-tuning Pretrained Model Lead to the Promised Land? In: Proceedings of EMNLP 2020.Jialong Tang, Yaojie Lu, Hongyu Lin, Xianpei Han, Le Sun, Xinyan Xiao and Hua Wu.Syntactic and Semantic-driven Learning for Open Information Extraction. In: Findings of EMNLP 2020.Lingyong Yan, Xianpei Han, Ben He and Le Sun.Global Bootstrapping Neural Network for Entity Set Expansion. In: Findings of EMNLP 2020.Zhi Zheng, Kai Hui, Ben He, Xianpei Han, Le Sun and Andrew Yates.BERT-QE: Contextualized Query Expansion for Document Re-ranking. In: Findings of EMNLP 2020.Hao Nie, Xianpei Han, Le Sun, Chi Man Wong, Qiang Chen, Wei Zhang, Suhui Wu. Global Structure and Local Semantics-Preserved Embeddings for Entity Alignment. In: the 29th International Joint Conference on Artificial Intelligence and the 17th Pacific Rim International Conference on Artificial Intelligence (IJCAI-PRICAI 2020，CCF-A).Cheng Fu, Xianpei Han, Jiaming He, Le Sun. Hierarchical Matching Network for Heterogeneous Entity Resolution In: the 29th International Joint Conference on Artificial Intelligence and the 17th Pacific Rim International Conference on Artificial Intelligence (IJCAI-PRICAI 2020，CCF-A).Lingyong Yan, Xianpei Han, Ben He, Le Sun. End-to-End Bootstrapping Neural Network for Entity Set. In Thirty-Fourth AAAI Conference on Artificial Intelligence. New York, USA (AAAI 2020) (CCF-A)Bo Chen, Xianpei Han, Ben He, Le Sun. Learning to Map Frequent Phrases to Sub-Structures of Meaning Representation for Neural Semantic Parsing. In: Proc. of the 34th AAAI Conference on Artificial Intelligence. New York, USA (AAAI 2020) (CCF-A)Jinsong Su, Jialong Tang, Ziyao Lu, Xianpei Han, Haiying Zhang. A neural image captioning model with caption-to-images semantic constructor. In: Neurocomputing 367 (2019), pp. 144-151. (CCF-C)Bo An, Bo Chen, Xianpei Han, Le Sun: EUSP: An Easy-to-Use Semantic Parsing PlatForm. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing, Hongkong, China, Nov 3-7, 2019: 67-72 (CCF B)Hongyu Lin, Yaojie Lu, Xianpei Han, Le Sun, Bin Dong, Shanshan Jiang. Gazetteer-Enhanced Attentive Neural Networks for Named Entity Recognition. In: 2019 Conference on Empirical Methods in Natural Language Processing and 9th International Joint Conference on Natural L",
  "content_length": 12597,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:12"
}