{
  "name": "Xiangyang Li 0001",
  "homepage": "http://staff.ustc.edu.cn/~xiangyangli",
  "status": "success",
  "content": "Prof. Xiang-Yang Li Research Project/Award Publication Teaching Students Service Patents Talks æåé³ï¼ææï¼è®¡ç®æºå­¦é¢æ§è¡é¢é¿ Professor (IEEE Fellow, 2015, ACM Distinguished Scientist, 2014, IEEE Senior Member, 2008) Wireless Networking, Mobile Sensing, and Data Innovation Lab (Director) School of Computer Science and Technology(è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢) University of Science and Technology of Chinaï¼ä¸­å½ç§å­¦ææ¯å¤§å­¦ï¼ Ph.D. ( CS @ UIUC, 2001); MS (CS, UIUC, 1999), BS (double major: CS and Business, Tsinghua, 1995) Research Areas: Wireless Networking/Mobile Computing/RFID, Privacy and Security, Cyber-Physical Systems and IoT, Social Computing, and interdisciplinary Research. Links: His CV, His Google Scholar Profile, H-Index List, DBLP Publication List, Selected Publications, and his schedule from Google Calendar. Dr. Xiang-Yang Li is a professor at School of Computer Science and Technology, University of Science and Technology of China. He was elected as IEEE Fellow (class 2015), and ACM Distinguished Scientist (class 2015) in 2014. He was a full professor at Computer Science Department of Illinois Institute of Technology, and served as an EMC Visiting Chair Professor at Tsinghua University (2014.01 to 2015.12), a distinguished visiting scientist at TNLIST (Tsinghua National Laboratory for Information Science and Technology), Tsinghua University from 2009-2011; a visiting professor of Microsoft Research Asia from May, 2007 to August 2008; and was also a visiting professor at HongKong Baptist University, and HongKong University of Science and Technology from 2006-2007. He is recipient of China NSF Outstanding Overseas Young Researcher (B) in 2008 and 2012. Dr. Li received MS (2000) and PhD (2001) degree at Department of Computer Science from University of Illinois at Urbana-Champaign. He received a Bachelor degree at Department of Computer Science and a Bachelor degree at Department of Business Management from Tsinghua University, P.R. China, both in 1995. He was a member of the gifted student class (with 20 students in total) in China prepared for the International Mathematics Olympics (IMO) from 1988 to 1990. Dr. Liâs research interests include wireless networks, mobile computing, privacy and security, cyber physical systems, the social networking, and algorithms. He published a monograph \"Wireless Ad Hoc and Sensor Networks: Theory and Applications\". He also co-edited the book \"Encyclopedia of Algorithms\". The research of Dr. Li has been supported by USA NSF, HongKong RGC, and China NSF, with total support more than 2.5 million US dollars from USA NSF and several millions of RMB from China NSF. He has published more than 100 papers in top-tier journals, and about 200 papers in international conferences. His Google-scholar citation is more than 12,000, and H-index is more than 55. Dr. Li and his students won five best paper awards (IEEE GlobeCom 2015, IEEE HPCCC 2014, ACM MobiCom 2014, COCOON 2001, IEEE HICSS 2001), one best paper award runner-up, one best demo award (ACM MobiCom 2012) and was selected as best paper candidates twice (ACM MobiCom 2008, ACM MobiCom 2005). Dr. Li served or is currently serving as an editor of several journals, including IEEE Transaction on Parallel and Distributed Systems, IEEE Transaction on Mobile Computing. He served at various capacities (conference chair, TPC chair, local arrangement chair, and technical program committee) in a number of conferences, e.g., TPC Co-Chair of ACM MobiHoc 2014, TPC Co-Chair of IEEE MASS 2013, TPC member of ACM MobiCom 2014-2015. Dr. Li has graduated eleven PhD students from 2004 to 2014. Among these PhD students, six of them work in academia as research assistant professor, assistant professor, associate professor, or full professors now at various universities. Dr. Li also co-advised (or collaborated research leads to main portion of PhD thesis) more than fourteen PhD students in several universities in China and most of them are assistant/associate professors now. Also see my academic ancestors: Shang-Hua Teng (ACM Fellow, Godel Prize, Fulkerson Prize)--> Gary Miller (ACM Fellow, Knuth Prize, Paris Kanellakis Award) --> Manuel Blum (Turing Award, 1995; three students won Turing Award) --> Marvin Minsky (Turing Award, 1969; two students won Turing Award) --> Albert W. Tucker (known for KarushâKuhnâTucker conditions) --> Solomon Lefschetz (National Medal of Science, Fellow of the Royal Society) ---> William Edward Story -->   ... ,  --> Poisson --> Lagrange --> Euler --> Bernoulli, .....",
  "content_length": 4577,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:10"
}