{
  "name": "Xiao Huang 0001",
  "homepage": "https://www4.comp.polyu.edu.hk/~xiaohuang",
  "status": "success",
  "content": "Xiao HUANG Homepage Xiao HUANG ☰ × Home People Research Publications GoogleScholar Courses Xiao HUANG Assistant Professor, Department of Computing The Hong Kong Polytechnic University Research: large language models (graph retrieval-augmented generation, LLM-based text-to-SQL), graph learning (knowledge graphs, collaborative filtering), protein design. I am actively recruiting Ph.D. students and postdocs. Feel free to email me your CV. [2025/11] We have three papers accepted by AAAI 2026. [2025/10] Our ITF project Graph RAG has been funded. [2025/10] I serve as an SPC member at AAAI 2026, PAKDD 2026, & EACL 2026. [2025/10] We released three Graph RAG datasets. [2025/09] I am ranked among the World's Top 2% Scientists (Stanford List) for 2023, 2024, and 2025, placing at 4,780 out of 458,615 researchers in the AI & Image Processing subfield in 2025. [2025/09] Our Text-to-SQL Survey has been accepted by TKDE. Selected Publications (more papers) Retrieval-augmented generation A Survey of Graph Retrieval-Augmented Generation for Customized Large Language Models, Qinggang Zhang, Shengyuan Chen, Yuanchen Bei, Zheng Yuan, Huachi Zhou, Zijin Hong, Junnan Dong, Hao Chen, Yi Chang, Xiao Huang, arXiv preprint arXiv:2501.13958, 2025. (GitHub) Retrieval Augmented Zero-Shot Enzyme Generation for Specified Substrate, Jiahe Du, Kaixiong Zhou, Xinyu Hong, Zhaozhuo Xu, Jinbo Xu, Xiao Huang, ICML 2025. KnowGPT: Knowledge Graph based PrompTing for Large Language Models, Qinggang Zhang, Junnan Dong, Hao Chen, Daochen Zha, Zailiang Yu, Xiao Huang, NeurIPS 2024. LLM-based text-to-SQL Knapsack Optimization-based Schema Linking for LLM-based Text-to-SQL Generation, Zheng Yuan, Hao Chen, Zijin Hong, Qinggang Zhang, Feiran Huang, Qing Li, Xiao Huang, IEEE International Conference on Data Engineering, 2026. Structure-Guided Large Language Model for Text-to-SQL Generation, Qinggang Zhang, Hao Chen, Junnan Dong, Shengyuan Chen, Feiran Huang, Xiao Huang, ICML, 2025 (Slides). Next-Generation Database Interfaces: A Survey of LLM-based Text-to-SQL, Zijin Hong, Zheng Yuan, Qinggang Zhang, Hao Chen, Junnan Dong, Feiran Huang, Xiao Huang, IEEE Transactions on Knowledge and Data Engineering, 2025. Graph learning Each Graph is a New Language: Graph Learning with LLMs, Huachi Zhou, Jiahe Du, Chuang Zhou, Chang Yang, Yilin Xiao, Yuxuan Xie, Xiao Huang, ACL (Findings), 2025. (Code) Dirichlet Energy Constrained Learning for Deep Graph Neural Networks, Kaixiong Zhou, Xiao Huang, Daochen Zha, Rui Chen, Li Li, Soo-Hyun Choi, Xia Hu, NeurIPS, 2021. Towards Deeper Graph Neural Networks with Differentiable Group Normalization, Kaixiong Zhou, Xiao Huang, Yuening Li, Daochen Zha, Rui Chen, Xia Hu, NeurIPS, 2020. Protein design Retrieval Augmented Zero-Shot Enzyme Generation for Specified Substrate, Jiahe Du, Kaixiong Zhou, Xinyu Hong, Zhaozhuo Xu, Jinbo Xu, Xiao Huang, ICML, 2025. Knowledge graphs Knowledge Graph Embedding Based Question Answering, Xiao Huang, Jingyuan Zhang, Dingcheng Li, Ping Li, WSDM 2019 (ACM version, Slides, Code). Collaborative filtering LLM Collaborative Filtering: User-Item Graph as New Language, Huachi Zhou, Yujing Zhang, Hao Chen, Qinggang Zhang, Qijie Shen, Feiran Huang, Xiao Huang, AAAI, 2026. Macro Graph Neural Networks for Online Billion-Scale Recommender Systems, Hao Chen, Yuanchen Bei, Qijie Shen, Yue Xu, Sheng Zhou, Wenbing Huang, Feiran Huang, Senzhang Wang, Xiao Huang, TheWebConf, 2024 (ACM version). Graph Cross-Correlated Network for Recommendation, Hao Chen, Yuanchen Bei, Wenbing Huang, Shengyuan Chen, Feiran Huang, Xiao Huang, IEEE Transactions on Knowledge and Data Engineering, 2024. Services Organization committee member: ICDE 2025 (PhD Symposium Chair), PAKDD 2026 (Doctoral Consortium Chair) SPC member/Area Chair: AAAI 2026, PAKDD 2026, EACL 2026 PC member: ICLR 2022-2026, NeurIPS 2021-2025, ICML 2021-2025, IJCAI 2020-2025, AAAI 2021-2023, KDD 2019-2023, TheWebConf 2022-2023, CIKM 2019-2022, WSDM 2021-2023, SDM 2022, ICKG 2020-2021 Reviewer: TPAMI, IEEE TKDE, ACM TKDD, ACM Computing Surveys, ACM TOIS, IEEE Transactions on Cybernetics, IEEE Transactions on Big Data, IEEE TCSS, ACM TIST Session Chair: WSDM 2023, IJCAI 2023 Editorial board member: Computers & Education: X Reality Awards and Patents Best Paper Award Honorable Mention at SIGIR 2023 Best Poster Presentation Award at PolyU Academy for Interdisciplinary Research Conference 2023 BEST PAPER at the International Conference On Web-Based Learning 2022, Tenerife, Spain US Patent, KNOWLEDGE-GRAPH-EMBEDDING-BASED QUESTION ANSWERING, US 2020/0242444 A1 Media Coverage PolyU Research and Innovation Office, Technology Showcase PolyU COMP News, IEEE final year project competition PolyU hosts IEEE ICDE 2025 Biography Dr. Xiao Huang is an Assistant Professor in the Department of Computing at The Hong Kong Polytechnic University. He earned his Ph.D. in Computer Engineering from Texas A&M University in 2020, an M.S. in Electrical Engineering from the Illinois Institute of Technology in 2015, and a B.S. in Engineering from Shanghai Jiao Tong University in 2012. His research interests encompass LLM reasoning, retrieval-augmented generation, text-to-SQL, graph learning, knowledge graphs, and recommender systems. His scholarly contributions are highly regarded within the academic community, amassing over 5,700 citations. He received the Best Paper Award Honorable Mention at SIGIR 2023. He has successfully led or completed seven research projects as Principal Investigator, securing total funding exceeding 5 million HKD. He serves as a PhD Symposium Chair for ICDE 2025 and a Doctoral Consortium Chair for PAKDD 2026. He ranked among the World's Top 2% Scientists (Stanford List) for 2023, 2024, and 2025. Before his appointment at PolyU, he gained valuable experience as a research intern at Microsoft Research and Baidu USA. Last edited on November 9th 2025 09:49PM (Time Zone: CST).",
  "content_length": 5916,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:13"
}