{
  "name": "Xiaoqing Guo",
  "homepage": "https://guo-xiaoqing.github.io",
  "status": "success",
  "content": "About Me - Xiaoqing’s Homepage Dr. Xiaoqing GuoAssistant Professor Follow Hong Kong Email ResearchGate Twitter Google Scholar ORCIDBiographyXiaoqing Guo is an assistant professor in the Department of Computer Science at Hong Kong Baptist University, where she leads UltraVision+ Lab. She is also a visiting researcher affiliated with the Noble Group at the University of Oxford. She was a postdoctoral researcher in the Department of Engineering Science at the University of Oxford, working on the projects VisualAI and Turing AI WLR Fellowship, during 2023-2024. She obtained her Ph.D. degree in the Department of Electrical Engineering at City University of Hong Kong in 2022 and received her B.Eng. degree from Beihang University in 2018. She was a research assistant in the Department of Electrical Engineering at Tsinghua University during 2017-2018. Her research interest is in the interdisciplinary field of AI and healthcare, aiming to create innovative intelligent systems that can support high-quality human-machine interaction/collaboration and trustworthy clinical decision-making. In AI and medical imaging fields, she has published over 40 top journal and conference papers, e.g., Nature Biomedical Engineering, TPAMI, IJCV, CVPR, ICCV, ECCV, TMI, MedIA, MICCAI, IPMI, and Nature. She has been selected as one of World’s Top 80 Chinese Young Female Scholars in AI, the Rising Star of Women in Engineering by Asian Deans’ Forum 2024, and she has received prestigious awards, such as Outstanding Doctoral Research Award, Outstanding Research Thesis Award, and three year consecutive Outstanding Academic Performance Award.🌟 I am looking for PhD students and RA. Please refer to open positions in our lab.Working Experience12/2024-Now Assistant professor, Department of Computer Science, Hong Kong Baptist University, Hong Kong, China12/2024-Now Visiting fellow, Department of Engineering Science, University of Oxford, Oxford, UK01/2023-12/2024 Postdoctoral researcher, Department of Engineering Science, University of Oxford, Oxford, UK (Supervisor: Prof. Alison Noble)09/2022-12/2022 Postdoctoral researcher, Department of Electrical Engineering, City University of Hong Kong, Hong Kong, China09/2017-07/2018 Research Assistant, Department of Electrical Engineering, Tsinghua University, Beijing, ChinaEducation Experience09/2018-08/2022 PhD, Department of Electrical Engineering, City University of Hong Kong, Hong Kong, China (Supervisor: Prof. Yixuan Yuan)09/2014-06/2018 Bachelor, Department of Biomedical Engineering, Beihang University, Beijing, ChinaResearch InterestsMy research interest is in the interdisciplinary field of medical data analysis, computer vision, and machine learning, aiming to create innovative intelligent systems that can support high-quality human-machine interaction/collaboration and trustworthy clinical decision-making.Recently, I am dedicated to (1) multimodal learning with 2D/3D image, video, audio, clinical text report, probe motion modalities, (2) human-machine interaction/collaboration for shared human-machine decision-making in healthcare.Previously, I focused on developing annotation-efficient deep learning solutions, such as data augmentation, semi-supervised learning, domain adaptation, out-of-distribution generalization, and learning with noisy labels, to achieve trustworthy and effective intelligent systems.LinksUltraVision+ LabOxford Noble GroupVisualAI ProjectOxford BioMedIACUHK AIM Group",
  "content_length": 3461,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:42"
}