{
  "name": "Xiaobai Sun",
  "homepage": "https://scholars.duke.edu/person/xiaobai.sun",
  "status": "success",
  "content": "Xiaobai Sun | Scholars@Duke profile Skip to main content Xiaobai Sun Professor of Computer Science Computer Science xiaobai.sun@duke.edu Box 90129, Durham, NC 27708-0129 D107 Lev Sci Res Ctr, Durham, NC 27708 At a Glance Overview Numerical analysis, matrix theory, high-performance scientific computing, and parallel computing. Current Projects: Theory and algorithm development for large matrix computation problems arising in computational science and engineering. Current Appointments & Affiliations Professor of Computer Science · 2009 - Present Computer Science, Trinity College of Arts & Sciences Recent Publications Algebraic Vertex Ordering of a Sparse Graph for Adjacency Access Locality and Graph Compression Conference 2024 IEEE High Performance Extreme Computing Conference Hpec 2024 · January 1, 2024 In this work, we establish theoretical and practical connections between vertex indexing for sparse graph/network compression and matrix ordering for sparse matrix-vector multiplication and variable elimination. We present a fundamental analysis of adjacen ... Full text Cite Parallel Clustering with Resolution Variation Conference 2023 IEEE High Performance Extreme Computing Conference Hpec 2023 · January 1, 2023 We introduce a novel approach for parallel data clustering with resolution variation. Conventional graph clustering is typically governed by a function defined over all possible cluster configurations but at a fixed value of the resolution hyperparameter d ... Full text Cite Corrections to \"iPhantom: A Framework for Automated Creation of Individualized Computational Phantoms and its Application to CT Organ Dosimetry\". Journal Article IEEE J Biomed Health Inform · January 2022 In [1], the dose estimation accuracy using the alternative baseline method under modulated tube current was not correctly calculated due to an unintentional simulation error. ... Full text Link to item Cite View All Publications Recent Grants Hybrid virtual-MRI/CBCT: A new paradigm for image guidance in liver SBRT ResearchCo Investigator · Awarded by National Institutes of Health · 2019 - 2021 A Limited-angle Intra-fractional Verification (LIVE) System for SBRT Treatments ResearchCo Investigator · Awarded by National Institutes of Health · 2014 - 2020 Collaborative Research: Integral Equation-Based Fast Algorithms and Graph-Theoretic Methods for Large-Scale Simulations ResearchPrincipal Investigator · Awarded by National Science Foundation · 2009 - 2015 View All Grants Education, Training & Certifications University of Maryland, College Park · 1991 Ph.D.",
  "content_length": 2578,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:19"
}