{
  "name": "Xiaoguang Niu",
  "homepage": "https://cs.whu.edu.cn/info/1019/2507.htm",
  "status": "success",
  "content": "ï»¿ çæå -æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ EN æ§ç æ­¦å¤§ä¸»é¡µ é¦é¡µ å­¦é¢æ¦åµ å­¦é¢ç®ä» åå²æ²¿é© ç°ä»»é¢å¯¼ ç»ç»æºæ èç³»æä»¬ è®¡ç§æ å å¸èµéä¼ é«å±æ¬¡äººæ ä¸ä»»æå¸ å®éªææ¯äººå è£ä¼æå¸ äººæå¹å » æ¬ç§çæè² ç ç©¶çæè² çå­¦çæè² å½é äº¤æµ ç§å­¦ç ç©¶ ç§ç è¿å± å­¦æ¯äº¤æµ é¡¹ç®ç³æ¥ ç ç©¶å¹³å° å ç¾¤å·¥ä½ å å»ºå·¥ä½ çºªæ£å·¥ä½ å·¥ä¼å·¥ä½ å ±éå¢å·¥ä½ å­¦ä¹ èµæ äººææè å¸èµå²ä½æè åå£«åæè éç¼äººåæè æ ¡åé£é æ°åºæ ¡å æ ¡åå¨æ æ ¡ååº ä¿¡æ¯å ¬å¼ è§ç« å¶åº¦ åäºæµç¨ å¸¸ç¨ä¸è½½ èç³»æ¹å¼ E-mailï¼xgniu@whu.edu.cn åå ¬çµè¯ï¼ 02768775255 åå ¬å°ç¹ï¼C306 çæå  æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ è®¡ç®æºç§å­¦ç³» ç½ç»ç ç©¶æ å§åï¼çæå  ä¸»é¡µï¼ æ§å«ï¼ç· èç§°ï¼ææ (åå¯¼,ç¡å¯¼) å­¦åå­¦ä½ï¼åå£« çµè¯ï¼02768775255 åå ¬å°ç¹ï¼C306 E-mailï¼xgniu â whu.edu.cn è¯·æå·¥æ¿æ¢ç¬¦å· é¢åï¼å¤§æ°æ®ææç®¡çä¸åæ,æºå¨å­¦ä¹ ä¸æºè½äº¤äº,è®¡ç®æºç½ç»,æ¨¡å¼è¯å«,ç½ç»å®å ¨,æ çº¿ç½ç»,ç©èç½,æºè½è®¡ç® æçä¿¡æ¯ï¼2019å¹´åº¦ææ¶ç¡å£«3åï¼ææ¶æ¹åï¼è®¡ç®æºç§å­¦ä¸ææ¯(å­¦ç¡),è½¯ä»¶å·¥ç¨(å­¦ç¡)ã ææ¶åå£«1åï¼ææ¶æ¹åï¼è®¡ç®æºç§å­¦ä¸ææ¯,è½¯ä»¶å·¥ç¨ã ç ç©¶æ¹å å¤§æ°æ®ææç®¡çä¸åæ,æºå¨å­¦ä¹ ä¸æºè½äº¤äº,è®¡ç®æºç½ç»,æ¨¡å¼è¯å«,ç½ç»å®å ¨,æ çº¿ç½ç»,ç©èç½,æºè½è®¡ç® æè²èæ¯ çæå ï¼æ­¦æ±å¤§å­¦è®¡ç®æºå­¦é¢ææï¼CCF/IEEE/ACMä¼åï¼CCFç©èç½ä¸å§ä¼å§åï¼æè²é¨åæ°å¢éæåãç ç©¶é¢åå æ¬ç§»å¨æç¥ä¸æºè½è®¡ç®ãç©èç½ãç©ºé´æºè½è®¤ç¥ä¸ä½ç½®æå¡ãè®¡ç®æºç½ç»ãç½ç»å®å ¨ä¸éç§ä¿æ¤ãæ¨¡å¼è¯å«/äººå·¥æºè½å¨ç§»å¨è®¡ç®/ä½ç½®æå¡æ¹é¢çåºç¨ãä¸»æå½å®¶èªç¶ç§å­¦åºé2é¡¹ï¼å½å®¶éç¹ç åè®¡åé¡¹ç®å­è¯¾é¢2é¡¹ï¼æ¹åçèªç¶ç§å­¦åºé2é¡¹ï¼æ¹åçææ¹é¡¹ç®1é¡¹ï¼æè²é¨éç¹å®éªå®¤å¼æ¾åºé1é¡¹ãä½ä¸ºç ç©¶éª¨å¹²è·ä¸­å½æµç»ç§æè¿æ­¥ç¹ç­å¥1é¡¹ï¼åäº¬å¸ç§æè¿æ­¥ä¸ç­å¥1é¡¹ï¼å¨å½é æååä¼è®®åè¡¨è®ºæ30ä½ç¯(SCI æ£ç´¢21ç¯)ï¼æ ä»»å¤ä¸ªå½é ä¼è®®/SCIæåçå®¡ç¨¿äººã å·¥ä½ç»éª ææè¯¾ç¨ ãè®¡ç®æºç½ç»ãããç©èç½å®ä½ææ¯ãããç©èç½åºç¨ä¸ææ¯ã åè¡¨è®ºæ è¿æè®ºæï¼ [1] Xiaoguang Niu, Kaiyi Zou, Da Shen, Steve Drew, Shaowu Wu, GuangyiGuo, Ruizhi Chen. UltraMotion: High-precision Ultrasonic Arm Tracking for Real-world Exercises. in IEEE Transactions on Mobile Computing, pp. 1-18, doi: 10.1109/TMC.2023.3241077. [2] Yuanzhuo Xuï¼Xiaoguang Niu, Jie Yang, Steve Drew, Jiayu Zhou, Ruizhi Chen. USDNL: Uncertainty-based Single Dropout in Noisy Label Learning. In 37th AAAI Conference on Artificial Intelligence(AAAI), pp. 1-7, AAAI, 2023. (EIæ£ç´¢) [3] Shiwen Gong, Dandan Liu, MdZakirulAlamBhuiyan, and Xiaoguang Niu. OCP: an OLAP-based bus crowdedness smart-perceiving mechanism for urban transportation. Connection Science 34, no. 1 (2022): 2066-2083.(SCIæ£ç´¢) [4] ééå¿,é±é,çæå ,å¾è¯è±ª,éäº®,è£è¶ . åºäºæ°æ®ä¸æ¨¡ååé©±å¨çé³é¢/æ¯æ§ä¼ æå¨è¦åå®ä½æ¹æ³. æµç»å­¦æ¥. 51(7):1160-1171, 2022. (EIæ£ç´¢) [5] Chao Qiu, Yuanzhuo Xu, Yu Zhu, LuyaoXie, Da Shen, Junhui Huang, and Xiaoguang Niu. MAGINS: Neural Network Inertial Navigation System Corrected by Magnetic Information. In 2021 IEEE International Performance, Computing, and Communications Conference (IPCCC), pp. 1-8. IEEE, 2021.(EIæ£ç´¢) [6] XingxingXiong, Shubo Liu, Dan Li, ZhaohuiCai, and Xiaoguang Niu. Real-time and private spatio-temporal data aggregation with local differential privacy. Journal of Information Security and Applications 55 (2020): 102633.(SCIæ£ç´¢) [7] Siyu Chen, Yu Zhu, Xiaoguang Niu, and Zhiyong Hu. Improved window segmentation for deep learning based inertial odometry. 2020 IEEE 39th International Performance Computing and Communications Conference (IPCCC), pp. 1-7. IEEE, 2020.(EIæ£ç´¢) [8] XingxingXiong, Shubo Liu, Dan Li, ZhaohuiCai, and Xiaoguang Niu. A comprehensive survey on local differential privacy. Security and Communication Networks 2020 (2020).(SCIæ£ç´¢) [9] Xiaoguang Niu, LuyaoXie, Jiawei Wang, Haiming Chen, Dandan Liu, and Ruizhi Chen. AtLAS: An activity-based indoor localization and semantic labeling mechanism for residences. IEEE Internet of Things Journal 7, no. 10 (2020): 10606-10622.(SCIæ£ç´¢) [10] Shiyu Li, Dengpan Ye, Shunzhi Jiang, Changrui Liu, Xiaoguang Niu, and Xiangyang Luo. Anti-steganalysis for image on convolutional neural networks. Multimedia Tools and Applications 79, no. 7 (2020): 4315-4331.(SCIæ£ç´¢) [11] XingxingXiong, Shubo Liu, Dan Li, Jun Wang, and Xiaoguang Niu. Locally differentially private continuous location sharing with randomized response. International Journal of Distributed Sensor Networks 15, no. 8 (2019): 1550147719870379.(SCIæ£ç´¢) [12] Fangfang Ma, Shubo Liu, XingxingXiong, and Xiaoguang Niu. Privacy protection based on local differential privacy for numerical sensitive data of wearable devices. Journal of Computer Applications 39, no. 7 (2019): 1985.(SCIæ£ç´¢) [13] Zhibo Wang, Jiahui Hu, Qian Wang, RuizhaoLv, Jian Wei, Honglong Chen, and Xiaoguang Niu. Task-bundling-based incentive for location-dependent mobile crowdsourcing. IEEE Communications Magazine 57, no. 2 (2019): 54-59.(SCIæ£ç´¢) [14] Zheng Li, Jingbin Liu, Fan Yang, Xiaoguang Niu, Leilei Li, Zemin Wang, and Ruizhi Chen. A Bayesian density model based radio signal fingerprinting positioning method for enhanced usability. Sensors 18, no. 11 (2018): 4063.(SCIæ£ç´¢) [15] Xiaoguang Niu, Chun Zhang, Ankang Wang, Jingbin Liu. A Crowdsourcing-based Wi-Fi Fingerprinting Mechanism Using Un-Supervised Learning. International Conference on Wireless Algorithms, Systems, and Applications (WASA2018), pp. 1-9, Mar., 2018.(EIæ£ç´¢) [16] Zhibo Wang, Ran Tan, Jiahui Hu, Jing Zhao, Qian Wang, Feng Xia, and Xiaoguang Niu. Heterogeneous incentive mechanism for time-sensitive and location-dependent crowdsensing networks with random arrivals. Computer Networks, 131(2018), pp.96-109, 2018. (SCIæ£ç´¢) [17] Xiaoguang Niu, Jiawei Wang, Qiongzan Ye, Yihao Zhang. A Privacy-Preserving Incentive Mechanism for Participatory Sensing Systems. Security and Communication Networks (SCN), pp.1-15, 2018. doi:10.1155/2018/2593537. (SCIæ£ç´¢) [18] Xiaoguang Niu, Zhen Wang, Qiongzan Ye, Yihao Zhang, Jiawei Wang. A hierarchical-learning-based crowdedness estimation mechanism for crowdsensing buses. IEEE International Performance Computing and Communications Conference (IPCCC2017), pp. 1-8, Dec., 2017. (EIæ£ç´¢) [19] Xiaoguang Niu, Yihao Zhang, Yalan Yao, Xu Chen*, JosepMiquelJornet, Jin Liu. An Energy-Efficient Source-Anonymity Protocol in Surveillance Systems. Personal and Ubiquitous Computing (PUC), 20(5), pp.771-783, 2016. (SCIæ£ç´¢) [20] Ziwei Liu, Xiaoguang Niu, Xu Lin, Ting Huang, Yunlong Wu, Hui Li. A Task-centric Cooperative Sensing Scheme for Mobile Crowdsourcing Systems. Sensors, 16(5):1-19, 2016. (SCIæ£ç´¢) [21] Xiaoguang Niu, Yihao Zhang, Ting Huang, Xiaoping Wu. OSim: An OLAP-based Similarity Search Service Solver for Dynamic Information Networks. International Conference on Wireless Algorithms, Systems, and Applications (WASA2016), LNCS, Vol. 9798, pp.536-547, Aug. 2016. (EIæ£ç´¢) [22] çæå , é­å·å. æ çº¿ä¼ æç½ä¸­è½éåè¡¡é«æçæºä½ç½®éç§ä¿æ¤åè®®. éä¿¡å­¦æ¥, 37(4):2016069, 2016. (EIæ£ç´¢) [23] Xiaoguang Niu, Ying Zhu, Qingqing Cao, Kun Zheng, Wei Xie. An Online Traffic Prediction Based Routing Service Mechanism for Smart City. International Journal of Distributed Sensor Networks IJDSN, 2015(970256):1-16, 2015. (SCIæ£ç´¢) [24] çæå , é­å·å, å¯ä¸ºæ±, å½­å½å, å¼ çå½. ONSA:ä¼ æç½ä¸­åºäºä¼åéååç»è®¡ç¹æ§çæºå¿ååè®®. éä¿¡å­¦æ¥, 36(6):2015143, 2015. (EIæ£ç´¢) [25] Jin Liu, Juan Li, Xiaohui Cui, Xiaoguang Niu, Xiaoping Sun, Jing Zhou. Social Sensing Enhanced Time Estimation for Bus Service. Concurrency and Computation: Practice and Experience, 27(15), pp. 3961-3981, 2015. (SCIæ£ç´¢) [26] Jin Liu, Juan Li, Xiaoguang Niu, Xiaohui Cui, Yunchuan Sun. GreenOCR: An Energy-efficient Optimal Clustering Routing Protocol. Computer Journal. 58(6), pp.1344-1359, 2015. (SCIæ£ç´¢) [27] Xiaoguang Niu, Meng Li, Qianyuan Chen, Qingqing Cao, Houzhen Wang. EPPI: An E-cent-based Privacy-preserving Incentive Mechanism for Participatory Sensing Systems. IEEE International Performance Computing and Communications Conference (IPCCC2014), pp. 1-8, Dec., 2014. (EIæ£ç´¢) [28] Xiaoguang Niu, Ying Zhu, Xining Zhang. DeepSense: A Novel Learning Mechanism for Traffic Prediction with Taxi GPS Traces. IEEE Global Telecommunications Conference (GLOBECOM2014), pp. 2805-2810, Dec., 2014. (EIæ£ç´¢) [29] Xiaoguang Niu, Meng Li, Jin Liu. WTrack: HMM-based Walk Pattern Recognition and Indoor Pedestrian Tracking Using Phone Inertial Sensors. Personal and Ubiquitous Computing (PUC), 18(8), pp.1901-1915, 2014. (SCIæ£ç´¢) [30] Xiaoguang Niu, Chuanbo Wei, Weijing Feng. OSAP: Optimal-cluster-based Source Anonymity Protocol in Delay-sensitive Wireless Sensor Networks. IEEE Wireless Communications and Networking Conference (WCNC 2014), pp.2880- 2885, Apr., 2014(EIæ£ç´¢) è·å¥æ åµï¼ 2022 ä¸­å½æµç»ç§æè¿æ­¥å¥ç¹ç­å¥ 2018 å ¨å½ç ç©¶çç§»å¨ç»ç«¯åºç¨è®¾è®¡åæ°å¤§èµä¸ç­å¥ - \"ä¼ç§æå¯¼æå¸\" 2018 ä¸­å½é«æ ¡è®¡ç®æºå¤§èµ-\"ä¼ç§æå¯¼æå¸\" 2013 å ¨å½å¤§å­¦çä¿¡æ¯å®å ¨ç«èµä¸ç­å¥ - \"ä¼ç§æå¯¼æå¸\" 2014 åäº¬ç§æè¿æ­¥ä¸ç­å¥ ç§ç è¯¾é¢ ç ç©¶å¢é æ¬è¯¾é¢ç»ææ¶åå£«/ç¡å£«ç ç©¶çåä¼ç§æ¬ç§çï¼å°ä¸ºå­¦çæä¾è¯å¥½çå·¥ä½å­¦ä¹ ç¯å¢ãå¾ éåæå¿çæå¯¼ï¼æ¬¢è¿ææä»äºç©èç½ãç§»å¨æç¥ä¸æºè½è®¡ç®ãç©ºé´æºè½è®¤ç¥ä¸ä½ç½®æå¡ãæ¨¡å¼è¯å«ãç¾¤æºæç¥éç§ä¿æ¤æ¹åç ç©¶çåå­¦ä¸æèç³»ãè¯¾é¢ç»å°åªåå¼å¯¼å­¦çæ¥è§¦ææ°ç",
  "content_length": 10623,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:25"
}