{
  "name": "Xiaohu Guo",
  "homepage": "https://www.utdallas.edu/~xxg061000",
  "status": "success",
  "content": "Xiaohu Guo @ UT-Dallas Xiaohu Guo Professor Department of Computer Science The University of Texas at Dallas Office: ECSS 4.605 Phone: 972-883-4723 Email: xguo \"at\" utdallas.edu Mailing Address: Department of Computer Science MS EC-31, Box 830688 University of Texas at Dallas Richardson, TX 75083-0688 PUBLICATION SOURCE CODES BRIEF BIO: Xiaohu Guo is a Full Professor of Computer Science at The University of Texas at Dallas. He obtained his Ph.D. degree in Computer Science from the Stony Brook University, and a B.S. degree in Computer Science from the University of Science and Technology of China. His research interests include Computer Graphics, Computer Vision, Medical Imaging, with an emphasis on Geometric Modeling and Processing problems. His current researches at UTD are focusing on: 3D/4D generative models, 3D/4D reconstruction, human body and face modeling, medial axis transform, mesh generation, centroidal Voronoi tessellation, spectral geometric analysis, deformable models, medical image analysis, etc. He received the prestigious NSF CAREER Award in 2012, SIGGRAPH Best Paper Award in 2023, and CVM Best Paper Award in 2025. He has been serving as the program co-chairs of the 2026 Symposium on Physical and Solid Modeling (SPM'2026), 2025 Symposium on Physical and Solid Modeling (SPM'2025), and 2016 International Conference on Geometric Modeling and Processing (GMP'2016), served on the journal editorial boards of IEEE Transactions on Visualization and Computer Graphics (TVCG), IEEE Transactions on Multimedia (TMM), IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), Computer Animation and Virtual Worlds (CAVW), Graphical Models (GMOD), and served on the Executive Committee of Solid Modeling Association. Our PhD student Ningna Wang was selected as one of the WiGRAPH's 2025 Rising Stars and one of the MIT EECS Rising Stars 2025! Our paper \"TexHOI: Reconstructing Textures of 3D Unknown Objects in Monocular Hand-Object Interaction Scenes\" received the CVM 2025 Best Paper Award! Our paper \"Globally Consistent Normal Orientation for Point Clouds by Regularizing the Winding-Number Field\" received the ACM SIGGRAPH 2023 Best Paper Award! Our Supervised Team of High School Students Received the 1st Prize CAST STAR Award in 2024 CAST-STEM Bridge Summer Camp! Our Supervised Team of High School Students Received the 2nd Prize CAST STAR Award in 2023 CAST-STEM Bridge Summer Camp! Our Supervised Team of High School Students Received the 1st Prize CAST STAR Award in 2021 CAST-STEM Bridge Summer Camp! Our Supervised Clark Scholars Received the Computer Science Honors Presentation Award in the 2022 Symposium of Summer Platform for Undergrad Research (SPUR)! NSF OAC Project on 4D Human Reconstruction RESEARCH GROUP: PhD Students: Alireza Khatami Yuan Li Zilong Wang Jikai Wang (Co-advised with Dr. Yu Xiang) Group Alumni : Alakh Aggarwal (PhD at UTD 2025). Ningna Wang (PhD at UTD 2025). After graduation: Postdoc at Columbia University. Selected as WiGRAPH's 2025 Rising Star and MIT EECS Rising Star 2025. Steven Hogue (PhD at UTD 2024). After graduation: Apira Technologies Chenxu Zhang (PhD at UTD 2023). After graduation: ByteDance AI Lab Chao Li (PhD at UTD 2019). After graduation: Meta Reality Lab. See his recent interview. Chao Wang (PhD at UTD 2018). After graduation: Matterport, ByteDance AI Lab, Meta Reality Lab Saifeng Ni (PhD at UTD 2018). After graduation: Samsung Research America Yuan Tian (PhD at UTD 2017). After graduation: Midea Robotics, OPPO Research Lab, Meta Reality Lab Yiqi Cai (PhD at UTD 2016). After graduation: Google, Deeproute Liang Shuai (PhD at UTD 2014). After graduation: Apple Zichun Zhong (PhD at UTD 2014). After graduation: Assistant Professor at Wayne State University. Now Tenured Associate Professor at Wayne State University. Received NSF CAREER Award. Yin Yang (PhD at UTD 2013). After graduation: Assistant Professor at The University of New Mexico. Now Tenured Associate Professor at University of Utah. Received NSF CAREER Award. Yang Liu (PhD at UTD 2011). After graduation: NVidia, Facebook, Uber, Toyota Research Institute, NVidia Ziying Tang (PhD at UTD 2011). After graduation: Assistant Professor at Towson University Yifei Huang (Visiting PhD at UTD 2019-2021). After graduation: Intel Shanghai, Qualcomm Xiao Dong (Visiting PhD at UTD 2017-2019). After graduation: Assistant Professor at Beijing Normal University-Hong Kong Baptist University United International College Baorong Yang (Visiting PhD at UTD 2015-2016). After graduation: Assistant Professor at Jimei University Guodong Rong (Postdoc at UTD 2007-2010). After postdoc: NVidia, Samsung Research America, Google, Huawei, Baidu, LG, Meta Reality Lab Thomas Stanley (MS at UTD 2021). After graduation: Software Engineer at Ligo Analytics, LLC. Yeqi Wang (MS at UTD 2020). After graduation: NVidia Yue Zhang (MS at UTD 2019). After graduation: PhD candidate at Clemson University Bipul Tarafdar (MS at UTD 2018). After graduation: Qualcomm Zhanyu Wang (MS at UTD 2011). After graduation: Cerner, Cisco, Amazon Web Services Jeremy Graham (MS at UTD 2011). After graduation: PhD candidate at UNC-Chapel Hill Thomas Symalla (BS at UTD 2022). After graduation: Software Engineer at Stellar Science. Andrew Wilson (BS at UTD 2019). After graduation: Software Engineer at Kitware, Inc. Brandon Stevens (BS at UTD 2015). After graduation: Software Engineer at Computer Human Interaction, LLC. Zachary Adams (BS at UTD 2011). After graduation: Software Engineer at Kasling Aircraft Company Richard Van Der Dys (BS at UTD 2011). After graduation: Software Engineer at Docudesk Corporation Luis Torres (BS at UTD 2010). After graduation: PhD candidate at UNC-Chapel Hill. Now at Waymo Daryl Hansen (BS at UTD 2010). After graduation: PhD candidate at Indiana University Bloomington REPRESENTATIVE PUBLICATIONS (Since 2018) Click Here for the Full List: Zilong Wang, Zhiyang Dou, Yuan Liu, Cheng Lin, Xiao Dong, Yunhui Guo, Chenxu Zhang, Xin Li, Wenping Wang, Xiaohu Guo, \"WonderHuman: Hallucinating Unseen Parts in Dynamic 3D Human Reconstruction\", in IEEE Transactions on Visualization and Computer Graphics, 2025. [paper][source code][project] Weixing Xie, Ying Ye, Qingqi Hong, Junfeng Yao, Shaoqi Wu, Rongzhou Zhou, Xiao Dong, Xiaohu Guo, \"Endo-HDR: Dynamic Endoscopic Reconstruction with Deformable 3D Gaussians and Hierarchical Depth Regularization\", in Knowledge-Based Systems, Vol. 332, pp. 114914, 2025. [paper][video][project] Jikai Wang, Qifan Zhang, Yu-Wei Chao, Bowen Wen, Xiaohu Guo, Yu Xiang, \"HO-Cap: A Capture System and Dataset for 3D Reconstruction and Pose Tracking of Hand-Object Interaction\", in NeurIPS'2025 Datasets & Benchmarks Track. [paper][source code][project] Ningna Wang, Rui Xu, Yibo Yin, Zichun Zhong, Taku Komura, Wenping Wang, Xiaohu Guo, \"MATStruct: High-quality Medial Mesh Computation via Structure-aware Variational Optimization\", in SIGGRAPH Asia'2025 Conference Papers. [paper][project] Mingfeng Tang, Ningna Wang, Ziyuan Xie, Jianwei Hu, Ke Xie, Xiaohu Guo, Hui Huang, \"Aerial Path Online Planning for Urban Scene Updation\", in SIGGRAPH'2025 Conference Papers, Article No. 87. [paper][project] Yuan Li, Cheng Lin, Yuan Liu, Xiaoxiao Long, Chenxu Zhang, Ningna Wang, Xin Li, Wenping Wang, Xiaohu Guo, \"CADDreamer: CAD Object Generation from Single-view Images\", in CVPR'2025, pp. 21448-21457. [paper][source code][project] Alakh Aggarwal, Ningna Wang, Xiaohu Guo, \"TexHOI: Reconstructing Textures of 3D Unknown Objects in Monocular Hand-Object Interaction Scenes\", in IEEE Transactions on Visualization and Computer Graphics (Proceedings of CVM 2025), Vol. 31, No. 10, pp. 8347-8358. [paper][source code][project] CVM 2025 Best Paper Award! Chenxu Zhang, Chao Wang, Jianfeng Zhang, Hongyi Xu, Guoxian Song, You Xie, Linjie Luo, Yapeng Tian, Jiashi Feng, Xiaohu Guo, \"MagicTalk: Implicit and Explicit Correlation Learning for Diffusion-based Emotional Talking Face Generation\", in Computational Visual Media (Proceedings of CVM 2025), Vol. 11, No. 4, pp. 763-779. [paper][project] Sen Peng, Weixing Xie, Zilong Wang, Xiaohu Guo, Zhonggui Chen, Baorong Yang, Xiao Dong, \"RMAvatar: Photorealistic Human Avatar Reconstruction from Monocular Video Based on Rectified Mesh-embedded Gaussians\", in Graphical Models (Proceedings of CVM 2025), Vol. 139, Article No. 101266. [paper][project] Steven Hogue, Chenxu Zhang, Yapeng Tian, Xiaohu Guo, \"Joint Co-Speech Gesture and Expressive Talking Face Generation using Diffusion with Adapters\", in WACV'2025, pp. 4163-4172. [paper][video][source code][project] Mengyuan Ge, Junfeng Yao, Baorong Yang, Zhonggui Chen, Ningna Wang, Xiaohu Guo, \"RBF-MAT: Computing Medial Axis Transform from Point Clouds by Optimizing Radial Basis Functions\", in Computer Aided Geometric Design, Vol. 118, Article No. 102421, 2025. [paper] Ningna Wang, Hui Huang, Shibo Song, Bin Wang, Wenping Wang, Xiaohu Guo, \"MATTopo: Topology-preserving Medial Axis Transform with Restricted Power Diagram\", in ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2024), Vol. 43, No. 6, Article No. 218, 2024. [paper][supplement][video][source code][project] Hongbo Li, Haikuan Zhu, Sikai Zhong, Ningna Wang, Cheng Lin, Xiaohu Guo, Shiqing Xin, Wenping Wang, Jing Hua, Zichun Zhong, \"NASM: Neural Anisotropic Surface Meshing\", in SIGGRAPH Asia 2024 (Conference Paper), Article No. 79. [paper][video][source code][project] Weixing Xie, Junfeng Yao, Xianpeng Cao, Qiqin Lin, Zerui Tang, Xiao Dong, Xiaohu Guo, \"SurgicalGaussian: Deformable 3D Gaussians for High-Fidelity Surgical Scene Reconstruction\", in MICCAI'2024, pp. 617-627. [paper][video][source code][project] Rui Xu, Longdu Liu, Ningna Wang, Shuangmin Chen, Shiqing Xin, Xiaohu Guo, Zichun Zhong, Taku Komura, Wenping Wang, Changhe Tu, \"CWF: Consolidating Weak Features in High-quality Mesh Simplification\", in ACM Transactions on Graphics (Proceedings of SIGGRAPH 2024), Vol. 43, No. 4, Article No. 80, 2024. [paper][video][so",
  "content_length": 17174,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:29"
}