{
  "name": "Xiaoyin Wang",
  "homepage": "http://www.cs.utsa.edu/~xwang",
  "status": "success",
  "content": "Xiaoyin Wang's Homepage Home Research Publications Teaching Students Tools&Resources Services Xiaoyin Wang Associate ProfessorDepartment of Computer Science University of Texas at San Antonio PostDocDepartment of Electrical Engineering and Computer Science University of California, Berkeley Ph.D.(2012)Software Engineering Institute Peking University News Dec. 2022, One paper \"PExReport: Automatic Creation of Pruned Executable Cross-Project Failure Reports\" is accepted in ICSE 2023. Dec. 2022, One paper \"What's (not) working in Programmer User Studies?\" is accepted in TOSEM. Oct. 2022, One paper \"DAISY: Dynamic-Analysis-Induced Source Discovery for Sensitive Data\" is accepted in TOSEM and will be presented in ICSE 2023. Aug. 2022, One paper \"PredART: Towards Automatic Oracle Prediction of Object Placements in Augmented Reality Testing\" is accepted in ASE 2022. May 2022, We receive NSF funding on the security analysis augmented reality apps.. May 2022, Rodney Rodriguez successfully defend his dissertation and will join Accenture. Congratulations to Rodney!!! Dec. 2021, Xueling Zhang successfully defend her dissertation and will join Rochester Institute of Technology as an Assistant Professor. Congratulations to Xueling!!! Dec. 2022, One paper \"Inferring Bug Signatures to Detect Real Bugs\" is accepted in TSE. Short Biography From September 2006 to January 2012, I was a Ph.D. candidate in the Software Engineering Institute (SEI) of Peking Univerisity. My advisor is Prof. Hong Mei, and I also did research under the supervision of Prof. Lu Zhang and Prof. Tao Xie. From Oct 2008 to Sept 2009, I visited Singapore Management University as a research fellow, where I worked with Prof. David Lo. In Jan. 2012, I began to work with Prof. Dawn Song, as a PostDoc in UC Berkeley. In August 2013, I joined the computer science department of University of Texas at San Antonio. CV Honors & Awards President's Research Achievement Award (one award per year for all STEM tenure-track faculty), 2019, UTSA. NSF CAREER Award, 2019, National Science Foundation (NSF) Distinguished PhD Dissertation Award, 2013, Chinese Computer Federation (CCF) Distinguished PhD Dissertation Award, 2012, Peking University Distinguished New Researcher Award, 2010, Chinese Ministry Of Education MSRA Fellowship, 2009, Microsoft Research Asia Second Prize in National Chemistry Contest for High School Students & Winter Camp, 2002 Third Prize in National Biology Contest for High School Students & Summer Camp, 2001 Hobbies Playing Saxphone Swimming Hiking Contact Me Email: xiaoyin.wang AT utsa.edu last modified: 2023.01.31",
  "content_length": 2615,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:45"
}