{
  "name": "Xiaodong Chen",
  "homepage": "http://www.eecs.qmul.ac.uk/~dong",
  "status": "success",
  "content": "Electronic Eng Dept, Queen Mary, University of London Home News/Events Undergraduate Postgraduate PhD Research Staff Contact People > Prof Xiaodong Chen Prof Xiaodong Chen Contact Details Title: Professor Tel: Internal: [13] 7983 National: 020 7882 7983 International: +44 20 7882 7983 Fax: National: 020 7882 7997 International: +44 20 7882 7997 Email: xiaodong.chen@qmul.ac.uk Office: Eng. 354 Research Group: Antennas Research Group Biography Xiaodong Chen, PhD, Fellow of IEEE, Fellow of IET , is a Professor of Microwave Engineering in School of Electronic Engineering and Computer Science. He is the Director of the BUPT-QMUL Joint Research Lab in Beijing . He holds Visiting Professorships at the University of Westminster (UK), Beijing University of Posts and Telecommunications (BUPT) and the University of Electronic Science and Technology of China. Prof Chen received the degree of B.Sc. in Electronic Engineering from the University of Zhejiang, Hangzhou, China in 1983, and the degree of Ph.D. in microwave electronics from the University of Electronic Science and Technology of China, Chengdu in 1988. In September 1988 he joined the Department of Electronic Engineering at King's College, University of London, as a Postdoctoral Visiting Fellow. In September 1990 he was employed by the King’s College London as a Research Associate. In March 1996 he was appointed to an EEV Lectureship at King's College London. In September 1999 he joined the Department of Electronic Engineering at Queen Mary and Westfield College, University of London. He was promoted to a Readership in October 2003 and a Chair of Micrwoave Engineering in October 2006, respectively. His research interests are in microwave devices, antennas, wireless communications and bio-electromagnetics. He has authored and co-authored over 300 publications (book chapters, journal papers and refereed conference presentations). He has involved in the organisation of many international conferences. He is currently a member of UK EPSRC Review College and Technical Panel of IEE Antennas and Propagation Professional Network.",
  "content_length": 2102,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:23"
}