{
  "name": "Xiaojun Chang",
  "homepage": "https://www.xiaojun.ai",
  "status": "success",
  "content": "Prof Xiaojun Chang@UTS Prof Xiaojun Chang@UTS The ReLER Lab EXPERIENCE PROJECTS PUBLICATIONS HOME Dr Xiaojun Chang joined UTS as a Professor in the Australian Artificial Intelligence Institute (AAII) in 2022, bringing his globally renowned expertise in artificial intelligence, computer vision, multimedia, neural networks and machine learning. He is also a Visiting Professor in the Department of Computer Vision at Mohamed bin Zayed University of Artificial Intelligence (MBZUAI). At AAII, he is the Director of the Recognition, Learning and Reasoning Lab (ReLER) where he explores multiple signals (visual, acoustic, textual) for automatic content analysis in unconstrained or surveillance videos. Prior to this, Xiaojun received his PhD in Computer Science from UTS in 2016 before moving to Carnegie Mellon University in the U.S. as a postdoctoral research associate. After being awarded an ARC DECRA in 2018, Xiaojun returned to Australia to take up a lecturer position at Monash University. He was promoted to Senior Lecturer in 2020, then joined RMIT University as an Associate Professor in 2021. With a focus on real-world outcomes, Xiaojun has secured over $3 million in research funding and has made significant contributions to the field of video analysis and multimedia information retrieval, including for health care and management. Xiaojun was named a Clarivate Analytics Highly Cited Researcher in 2019, 2020, 2021 and 2023, and his work has been covered by media from Australia, US, Europe and China, including his ground-breaking work developing an automatic report generation system for critically ill COVID-19 patients using deep learning techniques. His team has won multiple prizes from international grand challenges, hosting competitive teams from MIT, University of Maryland, Facebook AI Research (FAIR) and Baidu VIS. He also won first prize in TrecVID 2019 - Activity Extended Video (ActEV) challenge, held by the National Institute of Standards and Technology in the U.S. Xiaojun engages regularly with industry and has published a total of over 200 peer reviewed research papers and top conference papers. He has also served as an area chair for many prestigious international conferences, such as ACM Multimedia 2019, 2020, 2021 and 2022, IJCAI 2018, and ICPR 2018. Xiaojun has reviewed ARC Discovery Grant applications and served as an Associate Editor and Guest Editor on multiple prestigious journals. Incredibly passionate about his work, Xiaojun’s ultimate aim is to advance the field of artificial intelligence to better serve humanity by creating more accurate and efficient computational models that can understand and interact with the real world in a meaningful way. Research Interests Dr Chang’s research interests revolve around developing structured machine learning models for computer vision and multimedia tasks. His work primarily centers on exploring the information contained within videos and advancing artificial intelligence systems. His recent research topics include: Video Analysis, including event detection, object detection, segmentation. Multi-Modal Foundation Models. Medical Foundation Models. Multi-Agent Reinforcement Learning. News Mar 13rd, 2023 One paper on When Object Detection Meets Knowledge Distillation:A Survey has been accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! [link] Dec 20th, 2022 Congratulations to Mingjie on securing a PostDoc position at Stanford University! Jul 14th, 2022 One paper titled DS-Net++:Dynamic Weight Slicing for Efficient Inference in CNNs and Vision Transformers has been accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! [link] Jun 13rd, 2022 One paper titled TN-ZSTAD:Transferable Network for Zero-Shot Temporal Activity Detection has been accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! [link]. May 31st, 2022 One paper titled Video Pivoting Unsupervised Multi-modal Machine Translation has been accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! [link] March 3rd, 2022 Seven papers accepted by CVPR 2022! Congratulations to my students! December 30th, 2021 One paper on Semantics-Guided Contrastive Network for Zero-Shot Object detection has been accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! [link] December 20th, 2021 Our survey paper A Comprehensive Survey of Scene Graphs:Generation and Application has been accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! [link] November 9th, 2021 Our paper on Differentiable Generative Adversarial Networks Search for Zero-Shot Learning has been accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! [link] October 10th, 2021 Our paper on Medical Report Generation has been accepted by NeurIPS 2021! July 23rd, 2021 Three papers accepted by ICCV 2021! July 4th, 2021 Our paper on Multimodal Compatibility Modeling has been accepted by ACM MM 2021! May 8th, 2021 Our paper on Neural Architecture Search has been accepted by ICML 2021! April 16th, 2021 Our survey paper on Person Search has been accepted by IJCAI 2021 Survey Track. Congratulations to Xiangtan! April 9th, 2021 Our ICCV workshop \"Human Interaction for Robotic Navigation\" has been accepted! March 1st, 2021 Two papers accepted by CVPR 2021! January 18th, 2021 Our survey on Neural Architecture Search has been accepted by ACM Computing Surveys! January 13rd, 2021 One paper on multi-agent reinforcement learning has been accepted by ICLR 2021 as spotlight presentation! [pdf] December 14th, 2020 One paper on large-scale multimedia retrieval has been accepted by IEEE Transactions on Multimedia (T-MM)! October 31st, 2020 One paper on Object Tracking accepted by IEEE Transactions on Image Processing (T-IP)! October 27th, 2020 One paper on Neural Architecture Search (NAS) accepted by IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI)! September 26th, 2020 Two papers on Neural Architecture Search (NAS) accepted by NeurIPS 2020! August 9th, 2020 A survey on Deep Active Learning is released! [pdf] July 29th, 2020 Paper accepted by ACM MM 2020 on scene graph! Paper title - Memory-Based Network for Scene Graph with Unbalanced Relations. July 11th, 2020 Paper accepted by IEEE Transactions on Image Processing on zero-shot object detection! Paper title - Semantics Preserving Graph Propagation for Zero-Shot Object Detection. July 3rd, 2020 Paper accepted by ECCV 2020 on video object detection! Paper title - Mining Inter-Video Proposal Relations for Video Object Detection. June 19th, 2020 Our work on COVID-19 CT Report Generation was covered by [The Australian], [Mirage News], [ResearchNews], [AZoRobotics] and [Monash IT News]! [AI for Social Good] June 6th, 2020 We have released the first public COVID-19 CT Report dataset! [Project Page] | [pdf] June 1st, 2020 A survey on Neural Architecture Search is released! [arXiv] | [pdf] | [专知] May 16th, 2020 Two papers accepted by KDD 2020! May 16th, 2020 One paper accepted by KDD 2020 on Graph Neural Networks and Time Series Preidiction! Paper title - Connecting the Dots. Multivariate Time Series Forecasting with Graph Neural Networks. [pdf] April 20th, 2020 One paper accepted by IJCAI 2020 on graphical model estimation! Paper title - Quadratic Sparse Gaussian Graphical Model Estimation Method for Massive Variables. April 7th, 2020 I am approved to be promoted to Senior Lecturer with effect from 1 July 2020! April 4th, 2020 One paper accepted by ACL 2020 on multimodal neural machine translation! Paper title - Unsupervised Multimodal Neural Machine Translation with Pseudo Visual Pivoting [pdf] April 3rd, 2020 A survey on Person Search is released! [pdf] April 1st, 2020 A survey on Scene Graph is released! [pdf] [Awesome Paper List] Febuary 23rd, 2020 Six papers accepted by CVPR 2020! Febuary 23rd, 2020 Paper accepted by CVPR 2020 on vision-lanuage navigation! Paper title - Vision-Language Navigation with Self-Supervised Auxiliary Reasoning Tasks [pdf] [DEMO] [Oral] Febuary 23rd, 2020 Paper accepted by CVPR 2020 on zero-shot temporal activity detection! Paper title - ZSTAD Zero-Shot Temporal Activity Detection [pdf] Febuary 23rd, 2020 Paper accepted by CVPR 2020 on person re-identification! Paper title - Unity Style Transfer for Person Re-Identification [pdf] Febuary 23rd, 2020 Paper accepted by CVPR 2020 on nueral architecture search! Paper title - Neural Architecture Search by Block-wisely Distilling Architecture Knowledge [pdf] [code] Feburary 23rd, 2020 Paper accepted by CVPR 2020 on visual-dialog navigation! Paper title - Vision Dialogue Navigation by Exploring Cross-modal Memory [pdf] [code] January 11th, 2020 Paper accepted by WWW 2020 on graph convolutional networks! Paper title - Unsupervised Domain Adaptive Graph Convolutional Networks [pdf] November 23rd, 2019 We got the Best Paper Award from The 15th International Conference on Advanced Data Mining and Applications (ADMA 2019)! November 15th, 2019 We achieved first place in the TRECVID 2019 ActEV Challenge! [DEMO] August 29th, 2019 Demo presentation accepted by ICCV 2019! Title - Traffic Danger Recognition With Surveillance Cameras Without Training Data [DEMO] August 12nd, 2019 Paper accepted by EMNLP/IJCNLP 2019 on multi-modal learning! Paper title - Multi-Head Attention with Diversity for Learning Grounded Multilingual Multimodal Representations [pdf] July 1st, 2019 Paper accepted by ACM MM 2019 on multi-modal learning! Paper title - Annotation Efficient Cross-Modal Retrieval with Adversarial Attentive Alignment [pdf] December 3rd, 2018 I have joined the Faculty of Information Technology, Monash University as a Lecturer (tenure-track Asssitant Professor) and a DECRA Fellow! November 28th, 2018 I have been awarded an Australian Research Council (ARC) Discovery Early Career Researcher Award (DECRA) Fellowship! October 15th, 2018 I will join the F",
  "content_length": 10118,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:31"
}