{
  "name": "Xiaolong Zheng 0002",
  "homepage": "https://xiaolongbupt.github.io",
  "status": "success",
  "content": "Xiaolong Zheng - Beijing University of Posts and Telecommunications Xiaolong Zheng | 郑霄龙 Professor & Ph.D. Supervisor | 长聘教授、博士生导师 School of Computer Science & State Key Laboratory of Networking and Switching Technology Beijing University of Posts and Telecommunications Email: zhengxiaolong AT bupt.edu.cn News [Recruitment] I am looking for self-motivated PhD and Master students to work on research projects in wireless networking and ubiquitous computing. Click here for the recruitment information. [2025/09] Our paper \"CrossSense\" on cross-technology sensing was accepted by IEEE TMC! This work presents an interesting first attempt to leverage heterogeneous signals for wireless sensing. [2025/05] Invited to serve on the TPC of IEEE INFOCOM 2026. [2025/04] Our paper \"WiCast\" on parallel CTC from WiFi to heterogeneous IoT devices was accepted by IEEE TMC! [2025/03] Our paper \"PreLoRa\" on UAV-assisted LoRa networks was accepted by IEEE/ACM ToN! [2025/03] Join the Editorial Board of IEEE Internet of Things Journal! Please submit your original research papers! [2025/03] Recognized as Distinguished Member of the INFOCOM 2025 TPC! [2025/02] Our paper on cross-medium communication from water to the air was accepted by IEEE ICC 2025! [2024/12] Our paper on resolving LoRa cross-channel interference was accepted by IEEE INFOCOM 2025! [2024/12] Our paper \"WiCamera\" on WiFi imaging was accepted by IEEE TMC! [2024/11] Invited to serve on the TPC of ACM SenSys 2025. [2024/10] Invited to serve on the TPC of ACM MobiSys 2025. [2024/10] Our paper \"LoRadar\" on efficient cross-channel LoRa activity scanning was accepted by IEEE TMC! [2024/09] Our paper \"WiCAM2.0\" on imperceptible attack on WiFi sensing was accepted by ACM TOSN! [2024/08] Our survey on wireless sensing for material identification was accepted by IEEE COMST! [2024/07] Invited to serve on the TPC of ACM SenSys 2024 and IEEE SECON 2024. [2024/07] Our paper \"BleHe\" on BLE localization was accepted by ACM MobiHoc 2024! [2024/07] Our paper \"CSAdv\" on class-specific adversarial attack on object detection was accepted by ECAI 2024! [2024/06] Our paper \"GPSWindow\" on indoor GPS localization with metasurface was accepted by ACM MobiCom 2024! [2024/06] Join the Youth Editorial Board of Chinese Journal of Electronics! Please submit your original research papers! [2024/05] Invited to serve on the TPC of IEEE INFOCOM 2025. [2024/05] Our paper \"FPCA\" on link authentication for UAVs by FM signals was accepted by IEEE/ACM ToN! [2024/05] Our paper on DRL-based scheduiling for IIoT was accepted by IEEE TETCI! [2024/04] Invited to co-chair the Mobile & Wireless Sensing and Networking Track of IEEE MSN 2024. [2024/04] Invited to serve as Publicity Chair of ACM SenSys 2024. [2024/04] Our paper \"SD-LoRa\" on resolving cross-channel inference was accepted by IEEE ICDCS 2024! [2024/02] Our paper on WiFi sensing with low packet rate was accepted by IEEE TMC! [2024/02] Our paper on transmission control of floating LoRa was accepted by ACM TOSN! [2024/02] Invited to serve on the TPC of IEEE/ACM IWQoS 2024 and IEEE ICDCS 2024. [2024/01] Our paper \"UHead\" on UWB-based dirver head motion was accepted by UbiComp 2024! [2023/12] Our paper on Cross-technology Coexistence was accepted by IEEE TMC! [2023/11] Our paper \"nnPerf\" won the Best Paper Award Runner-up of ACM SenSys 2023! nnPerf is a tool that can profile the kernel-level runtime inference behaviour of DNN models on mobile platforms. You can download the tool and find more details on nnPerf's Homepage. [2023/11] Join the Editorial Board of High-Confidence Computing (HCC). Please consider to submit your original research papers! [2023/11] Our paper \"WiRa\" on CTC from WiFi to LoRa was accepted by IEEE/ACM ToN! [2023/10] Invited to serve as Publicity Chair of EWSN 2024 that is to be held in Adu Dhabi, UAE. EWSN 2024 will have two submission deadlines, one in the winter and one in the summer. The call for papers can be found here. Biography Xiaolong Zheng is currently a professor in School of Computer Science, Beijing University of Posts and Telecommunications. He is also an affiliated member of State Key Laboratory of Networking and Switching Technology. Before joining BUPT, he was a postdoctoral researcher at Tsinghua University. He received his Ph.D. degree from Hong Kong University of Science and Technology in 2015 and his B.E. degree from Dalian University of Technology in 2011. Xiaolong Zheng leads the Wireless Intelligent Networking System (WINS) Group, collaborating with a talented team of students on networking and system research. The networking topics includes satellite LPWAN, cross-technology communication, and cross-medium communication; the system topics encompass OS for AI (mobile AI and embedded AI) and integrated sensing and communication. Selected Publications (Full List) * denotes corresponding author. Journal Articles [TMC] CrossSense: Enabling Cross-Technology Sensing between WiFi and LoRa (PDF) Dan Xia, Guanghui Chen, Fu Yu, Yuxuan Wang, Xiaolong Zheng, Liang Liu, Shanguo Huang, Huadong Ma IEEE Transactions on Mobile Computing, accepted. [TMC] WiCast: Parallel Cross-Technology Transmission for Connecting Heterogeneous IoT Devices (PDF) Dan Xia, Xiaolong Zheng, Liang Liu, Shanguo Huang, Huadong Ma IEEE Transactions on Mobile Computing, vol. 24. no.10, pp. 9506 - 9523, October 2025. [TON] Improving Data Collection Efficiency of UAV-assisted LoRa Networks via Directivity-aware Link Model Jiaqi Zhang, Xiaolong Zheng, Ruinan Li, Liang Liu, Huadong Ma*, Nei Kato IEEE/ACM Transactions on Networking, accepted. [TMC] WiCamera: Vortex Electromagnetic Wave-Based WiFi Imaging (PDF) Leiyang Xu, Xiaolong Zheng*, Xinrun Du, Liang Liu*, Huadong Ma IEEE Transactions on Mobile Computing, vol. 24. no.5, pp. 3633 - 3649, May 2025. [CJE] Vortex EM Wave-Based Rotation Speed Monitoring on Commodity WiFi (PDF) Leiyang Xu, Xiaolong Zheng*, Liang Liu* Chinese Journal of Electronics, accepted. [TMC] LoRadar: An Efficient LoRa Channel Occupancy Acquirer based on Cross-channel Scanning (PDF) Xiaolong Zheng, Fu Yu, Liang Liu, Huadong Ma IEEE Transactions on Mobile Computing, vol. 24, no. 3, pp. 1699-1714, March 2025. [COMST] Wireless Sensing for Material Identification: A Survey (PDF) Yande Chen, Chongzhi Xu, Kexin Li, Jia Zhang, Xiuzhen Guo, Meng Jin, Xiaolong Zheng, Yuan He IEEE Communications Surveys & Tutorials, accepted. [TOSN] WiCAM2.0: Imperceptible and Targeted Attack on Deep Learning based WiFi Sensing (PDF) Leiyang Xu, Xiaolong Zheng, Yucheng Zhang, Liang Liu, Huadong Ma ACM Transactions on Sensor Networks, vol. 20, no. 6, pp. 124:1-22, November 2024. [ToN] FPCA: Parasitic Coding Authentication for UAVs by FM Signals (PDF) Shaopeng Zhu, Xiaolong Zheng, Liang Liu, Huadong Ma IEEE/ACM Transactions on Networking, vol. 32, no. 6, pp. 4570-4584, December 2024. [TETCI] Flow-Shop Scheduling Problem With Batch Processing Machines via Deep Reinforcement Learning for IIoT (PDF) Zihui Luo, Chengling Jiang, Liang Liu, Xiaolong Zheng, Huadong Ma IEEE Transactions on Emerging Topics in Computational Intelligence, vol. 8, no. 5, pp. 3518-3533, October 2024. [TMC] Pushing the Limits of WiFi Sensing with Low Transmission Rates (PDF) Xiaolong Zheng, Kun Yang, Jie Xiong, Liang Liu, Huadong Ma IEEE Transactions on Mobile Computing, vol. 23, no. 11, pp. 10265-10279, November 2024. [TOSN] PolarScheduler: Dynamic Transmission Control for Floating LoRa Networks (PDF) Xiaolong Zheng, Ruinan Li, Yuting Wang, Liang Liu, Huadong Ma ACM Transactions on Sensor Networks, vol. 20, no. 3, pp. 67:1-33, April 2024. [UbiComp/IMWUT] UHead: Driver Attention Monitoring System Using UWB Radar (PDF) Chongzhi Xu, Xiaolong Zheng, Zhiyuan Ren, Liang Liu, Huadong Ma ACM International Joint Conference on Pervasive and Ubiquitous Computing (Ubicomp 2024), vol. 8, no. 1, pp. 25:1-28, 2024. [TMC] Enabling Cross-Technology Coexistence for ZigBee Devices through Payload Encoding (PDF) Junmei Yao, Haolang Huang, Jiongkun Su, Ruitao Xie, Xiaolong Zheng, Kaishun Wu IEEE Transactions on Mobile Computing, vol. 23, no. 8, pp. 8289-8306, December 2023. [ToN] Enabling Cross-Technology Communication From WiFi to LoRa With IEEE 802.11ax (PDF) Xiaolong Zheng, Dan Xia, Fu Yu, Liang Liu, Huadong Ma IEEE/ACM Transactions on Networking, vol. 32, no. 3, pp. 1936-1950, November 2023. [TIFS] GaitReload: A Reloading Framework for Defending Against On-Manifold Adversarial Gait Sequences (PDF) Peilun Du, Xiaolong Zheng, Mengshi Qi, Huadong Ma IEEE Transactions on Information Forensics and Security, vol. 18, pp. 1380-1392, January 2023. [TOSN] Decoding LoRa Collisions via Parallel Alignment (PDF) Yuting Wang, Fanhao Zhang, Xiaolong Zheng*, Liang Liu*, Huadong Ma ACM Transactions on Sensor Networks, vol. 19, no. 3, pp. 62:1-25, March 2023. [TOSN] COFlood: Concurrent Opportunistic Flooding in Asynchronous Duty Cycle Networks (PDF) Zhichao Cao, Xiaolong Zheng, Qiang Ma, Xin Miao ACM Transactions on Sensor Networks, vol. 19, no. 3, pp. 58:1-21, March 2023. [ToN] CSMA/PJ: A Protective Jamming based MAC Protocol to Harmonize the Long and Short Links (PDF) Shaopeng Zhu, Xiaolong Zheng, Liang Liu, Huadong Ma IEEE/ACM Transactions on Networking, vol. 31, no. 1, pp. 118-132, February 2023. [CSUR] Cross-Technology Communication for the Internet of Things: A Survey (PDF) Yuan He, Xiuzhen Guo, Xiaolong Zheng, Zihao Yu, Jia Zhang, Haotian Jiang, Xin Na, and Jiacheng Zhang ACM Computing Surveys, vol. 55, no. 5, pp. 89:1-29, June 2023. [TMC] AirSync: Time Synchronization for Large-scale IoT Networks Using Aircraft Signals (PDF) Shaopeng Zhu, Xiaolong Zheng*, Liang Liu, Huadong Ma IEEE Transactions on Mobile Computing, vol. 22, no. 1, pp. 69-83, January 2023. [TMC] Cross-Technology Communication for Heterogeneous Wireless Devices through Symbol-Level Energy Modulation (PDF) Junmei Yao, Xiaolong Zheng, Ruitao Xie and Kaishun Wu IEEE Transactions on Mobile Computing, vol. 21, no. 11, pp. 3926-3940, November 2022. [ToN] PolarTracker: ",
  "content_length": 24057,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:34"
}