{
  "name": "Xiaojun Zhai",
  "homepage": "https://www.essex.ac.uk/people/zhaix77307/xiaojun-zhai",
  "status": "success",
  "content": "Xiaojun Zhai | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Xiaojun Zhai People Dr Xiaojun Zhai Reader School of Computer Science and Electronic Engineering (CSEE) Email xzhai@essex.ac.uk Location 1NW3.14, Colchester Campus Academic support hours My Academic Support Hours will be 15-16 on Wednesday and Thursday via Zoom/in person. The Zoom link for this is available from my profile on my course MOODLE page. Please wait in the waiting room until I can admit you. Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Xiaojun Zhai is a Reader in the Embedded Intelligent Systems (EIS) Laboratory at the School of Computer Science and Electronic Engineering. He serves as PI/Co-I for external research grants over ~£8.5M, where his primary research focus is on embedded systems and System-on-Chip (SoC) architecture, with focus on intelligence, performance, security, power, and reliability. He has published more than 160 peer-reviewed papers in the area of reconfigurable computing, connected health applications, Internet of Things, image and signal processing and their accelerations using multi-core and FPGAs/GPUs based systems during his career to date. Dr Zhai is Senior Member of IEEE, Fellow of the Higher Education Academy, Member of British Computer Society and ACM. Please visit our Github page (https://balancezhai.github.io/) for more information about current research projects and vacancies. Appointments Other academic Senior Lecturer in Embedded and Intelligent Systems, University of Essex (1/10/2021 - 30/9/2023) Lecturer in Embedded and Intelligent Systems, University of Essex (17/9/2018 - 30/9/2021) Lecturer/Senior Lecturer in Real-time Software Engineering, Department of Electronics, Computing and Mathematics, University of Derby (29/6/2015 - 16/9/2018) Research Associate, University of Leicester, University of Leicester (9/12/2013 - 31/10/2015) Senior Research Officer, University of Essex, University of Essex (1/1/2013 - 31/12/2013) Research and professional activities Research interests System-on-Chip (SoC) design Key words: Embedded Systems Open to supervise Embedded processor architectures Open to supervise Embedded systems Open to supervise Hardware acceleration Open to supervise Teaching and supervision Current teaching responsibilities C Programming and Embedded Systems (CE243) Current supervision Rappy Saha Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Ludovico Poli Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Xuqi Zhu Degree subject: Computer Science Degree type: Doctor of Philosophy Jiacheng Zhu Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Huaizhi Zhang Degree subject: Computer Science Degree type: Doctor of Philosophy Tamim Degree subject: Computer Science Degree type: Doctor of Philosophy Behnam Gholami Degree subject: Sport and Exercise Science Degree type: Doctor of Philosophy Shengyang Huang Degree subject: Computer Science Degree type: Doctor of Philosophy Nelson Tito Kimaro Degree subject: Computer Science Degree type: Doctor of Philosophy Muhammad Fuad Farooqi Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Previous supervision Haidee Sau Man Tang Thesis title: Using Climatic and Imaging Data to Predict Apple Phenology. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 24/11/2025 Michal Borowski Thesis title: Non-Intrusive Hardware-Enhanced Anomaly Detection Systems for Embedded Devices Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 6/10/2025 Issam Mohamed Amine Boukhennoufa Thesis title: Wearable Sensor-Based Rehabilitation Exercise Assessment for Post-Stroke Rehabilitation Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 26/3/2024 Yucheng Wang Thesis title: Dna Methylation Analysis and Age Prediction Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 30/6/2023 Yufan Lu Thesis title: Adaptive Intelligent Systems for Extreme Environments Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 12/4/2023 Publications Publications (4) Waheed, M., Milford, M., Zhai, X., Fasli, M., McDonald-Maier, K. and Ehsan, S., (2024). Employing Universal Voting Schemes for Improved Visual Place Recognition Performance Zhu, X., Zhang, H., Lee, J., Zhu, J., Pal, C., Saha, S., McDonald-Maier, KD. and Zhai, X., (2024). Fast, Scalable, Energy-Efficient Non-element-wise Matrix Multiplication on FPGA Waheed, M., Milford, M., Zhai, X., McDonald-Maier, K. and Ehsan, S., (2023). An Evaluation and Ranking of Different Voting Schemes for Improved Visual Place Recognition Wang, Y., Grant, OA., Zhai, X., McDonald-Maier, KD. and Schalkwyk, LC., (2022). Recalibrating the cerebellum DNA methylation clock: implications for ageing rates comparison Journal articles (84) Pal, C., Saha, S., Zhai, X., Howells, G. and McDonald-Maier, KD., APPARENT: AI-Powered Platform Anomaly Detection in Edge Computing.. IEEE Trans. Sustain. Comput.. 10, 965-981 Yu, W., Guo, Q., Cheng, Y., Liu, L., Hao, F., Zhai, X. and Chen, M., (2025). Formal Modeling and Reliability Analysis of Hybrid System Based on Semi-continuous Colored Petri Net: A Case Study of Adaptive Cruise Control System. Transactions on Embedded Computing Systems. 24 (3), 1-21 Mo, L., Li, X., Kritikakou, A. and Zhai, X., (2025). Contention and Reliability-Aware Energy Efficiency Task Mapping on NoC-Based MPSoCs. IEEE Transactions on Reliability. 74 (1), 2010-2026 Yu, W., Zhang, J., Lu, L., Liu, Y., Zhai, X. and Howlader, R., (2025). A Distributed Data-Driven and Machine Learning Method for High-Level Causal Analysis in Sustainable IoT Systems. IEEE Transactions on Sustainable Computing. 10 (2), 274-286 Sanei, S., Lee, TKM., Boukhennoufa, I., Jarchi, D., Zhai, X. and McDonald-Maier, K., (2025). Evaluating the Effect of Surrogate Data Generation on Healthcare Data Assessment. Big Data and Cognitive Computing. 9 (2), 22-22 Pal, C., Saha, S., Zhai, X. and McDonald-Maier, K., (2025). RENOWNED: A Real-Time Anomaly Detection and Mitigation Framework in Edge-Enabled IoV. IEEE Internet of Things Journal. 12 (12), 20695-20706 Yu, W., Cheng, Y., Fang, X., Zhai, X., Wang, Y. and Jing, H., (2025). Modeling and Risk Analysis of Cooperative Adaptive Cruise Control Systems Based on Petri Nets and Distributed Edge Intelligence. IEEE Internet of Things Journal. 12 (12), 19995-20006 Pal, C., Saha, S., Zhai, X., Howells, G. and McDonald-Maier, KD., (2025). APPARENT: AI-Powered Platform Anomaly Detection in Edge Computing. IEEE Transactions on Sustainable Computing. 10 (5), 1-17 Tang, H., Zhai, X. and Xu, X., (2025). Flowering variation induces apple maturity variation at harvest. Frontiers in Agronomy. 7 Mo, L., Zhang, J., Al-Hasan, TM., Cui, M., Zhai, X., Gao, Q. and He, S., (2025). Reliable and Energy Optimized Task Mapping for Heterogeneous Multi-Core NoC Based on Partial Task Duplication and Multi-Path Routing. IEEE Internet of Things Journal. 12 (23), 51240-51253 Mo, L., Zhang, J., Cui, M., Yan, X., Wang, S. and Zhai, X., (2025). Energy-Aware Task Mapping Combining DVFS and Task Duplication for Multicore Networked Systems. Journal of the Franklin Institute. 362 (16), 108097-108097 Li, Y., He, J., Liew, B., Hollinger, DS., Mei, Q., Gholami, B., Fasli, M., McDonald-Maier, K. and Zhai, X., (2025). Self-supervised learning enhances accuracy and data efficiency in lower-limb joint moment estimation from gait kinematics. Frontiers in Bioengineering and Biotechnology. 13, 1633513- Yu, W., Kong, J., Ding, Z., Zhai, X., Li, Z. and Guo, Q., (2024). Modeling and Analysis of ETC Control System with Colored Petri Net and Dynamic Slicing. ACM Transactions on Embedded Computing Systems. 23 (1), 1-27 Liew, BXW., Pfisterer, F., Rügamer, D. and Zhai, X., (2024). Strategies to optimise machine learning classification performance when using biomechanical features. Journal of Biomechanics. 165, 111998-111998 Liew, BXW., Zhu, X., Zhai, X., McErlain-Naylor, SA. and McManus, C., (2024). Association between fat and fat-free body mass indices on shock attenuation during running.. Journal of Biomechanics. 165, 112025-112025 Yu, W., Feng, J., Liu, L., Zhai, X. and Cheng, Y., (2024). Enhancing security in e-business processes: Utilizing dynamic slicing of Colored Petri Nets for logical vulnerability detection. Future Generation Computer Systems. 158, 210-218 Liu, Y., Yu, W., Zhai, X., Zhang, B., McDonald-Maier, K. and Fasli, M., (2024). Multi-level CEP Rules Automatic Extraction Approach for Air Quality Detection and Energy Conservation Decision Based on AI Technologies. Applied Energy. 372, 123724-123724 Liao, Y., Song, Y., Xia, S., Han, Y., Xu, N., Zhai, X. and Yuan, Z., (2024). Low-latency Data Computation of Inland",
  "content_length": 43203,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:32"
}