{
  "name": "Xiao-Jun Zeng",
  "homepage": "https://www.research.manchester.ac.uk/portal/x.zeng.html",
  "status": "success",
  "content": "Xiaojun Zeng - Research Explorer The University of Manchester Xiaojun Zeng Prof Professor of Machine Learning, Machine Learning and Robotics https://orcid.org/0000-0002-2320-2495 Personal profile BiographyGoogle Scholar Publication and Citation Records Dr Xiao-Jun Zeng received the B.Sc. degree in Mathematics and the M.Sc. degree in Control Theory and Operation Research from Xiamen University, Xiamen, China, respectively and the Ph.D. degree in Computation from the University of Manchester, Manchester, U.K.. He has been with the Department of Computer Science at the University of Manchester since 2002, where he is currently a Professor of Machine Learning and Optimisation. From 1996 to 2002, he was with Knowledge Support Systems, Ltd. (KSS), Manchester, where he was a Scientific Developer, Senior Scientific Developer, and Head of Research, developing intelligent decision support systems which won the European Information Society Technologies (IST) Award in 1999 and Microsoft European Retail Application Developer (RAD) Awards in 2001 and 2003. His current research interests include computational intelligence, machine learning, decision support systems, computational finance and game theory, health Informatics, data mining. He has published nearly 200 journal and conference papers in these areas and taken part in a number of funded research projects including UK EPSRC project “Hierarchical Fuzzy Systems: Method and Its Application to Strategic Pricing Decision Support for Retails”, 6th EU Framework Programme project “QoSIPS (Quality of Service and Pricing Differentiation for IP Services)”, 7th EU Framework Programme project \"Linked2Safety\"  and \"ECO2Clouds\", EU H2020 Project \"Big Data in Finance\", industrial funded research project “Data Mining Approach to Pricing Decision Support and Revenue Management for Retail” and “Pricing Decision Support Systems for Petroleum”. He has served to scholarly and professional communities in various roles including an Associate Editor of the prestigious IEEE Transactions on Fuzzy Systems, Special Session Chair of 2008 IEEE World Congress on Computational Intelligence, Program Chair of 2009, 2011, 2013 IEEE Symposium on Computational Intelligence in Control and Automation, Program Co-Chair of the 9th Int Conference on Fuzzy Systems and Knowledge Discovery, and an elected member of the EPSRC College.  Research interestsComputational intelligenceMachine learningDecision support systemsComputational finance and game theoryEnergy demand side mangementHealth InformaticsData miningMy groupData Science InstituteMachine Learning and OptimisationOther researchEU Project: (IoTrain ERASMUS+) Master of Engineering in Internet of Things The IoTRAIN project is an EU-funded consortium-based project towards capacity building in higher education (see more). IoTRAIN aims to achieve the modernization and internationalization of higher education in Iran and Iraq, taking into account the huge changes introduced by Internet technologies in society and business, and to design, develop and enact teaching, peer-production and continuous improvement processes. The project has started at 15-11-2020 and will end at 14-11-2023. About Project According to the survey of World Economic Forum, IoT aims to train one of the top technological drivers of change for the future of jobs, employment, skills and workforce strategy in the 4th Industrial Revolution. Forbes considers big data, data analytics, embedded smart sensors, remote monitoring systems, and machine learning as top 5 engineering skills in 2020. In order to prepare the society for such an enormous diversity, modernising Higher Education (HE) towards integrating IoT skills for engineers is an extreme need. Consequently, providing a series of educational training that improves competitiveness and employability of engineers by 2025 is a must to address. The technological revolution happening by IoT as well as associated skills and expertise gaps by 2020 are not limited to Europe, but also influencing developing countries. As evidence, the middle-east and Africa is expected to invest USD 14.3 Billion on IoT by 2020 to keep up with the fast pace of development in this regard. The main goal of the IoTRAIN project is to achieve the modernization and internationalization of higher education in Iran, taking into account the huge changes introduced by Internet technologies in society and business, and to design, develop and enact teaching, peer-production and continuous improvement processes. IoTRAIN is particularly designed to target the growing demand of professional IIoT skills by enhancing the IIoT-related trainings in Iranian HE institutions (HEI). In this regard, IoTRAIN covers a careful analysis of existing and future technological gaps in IIoT and provides required trainings towards improving competitiveness of future Iranian engineers. IoTRAIN delivers an IIoT competence model consisting of the state-of-the-art skills in IIoT at the European and international standard levels. The provided model adopts up-to-date training materials of the European partners of the project and provides necessary high-level training with the aim of improving competitiveness of future Iranian. Furthermore, IoTRAIN delivers a Digital Engineering competence model consisting of the state-of-the-art skills in digitalization for engineers and experts following European and international standards. Project Web Site: https://www.iotrain.eu/ Project Team: Prof. Xiao-Jun ZengProf. John KeaneDr Chai Yuan Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsSustainable FuturesDigital FuturesChristabel Pankhurst Institute Fingerprint Dive into the research topics where Xiaojun Zeng is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Decision-Making Computer Science 100% Smart Grid Engineering 68% Fuzzy System Engineering 55% Function Approximation Computer Science 50% Wireless Mesh Network Computer Science 47% Neural Network Computer Science 46% Experimental Result Computer Science 40% Feature Extraction Engineering 39% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 93 Article 35 Conference contribution 4 Paper 2 Poster 1 More 1 Preprint Research output per year Research output per year An online review-driven two-stage hotel recommendation model considering customers’ risk attitudes and personalized preferencesPu, Z., Xu, Z., Zhang, C., Zeng, X.-J. & Gan, W., 1 Feb 2025, In: Omega (United Kingdom). 131, 103197.Research output: Contribution to journal › Article › peer-review Open AccessFile Latent Dirichlet Allocation 100% Historical Review 100% Sentiment Analysis 100% Risk Tolerance 100% Case Study 100% 209 Downloads (Pure) A user-generated content-based social network large-scale group decision-making approach in healthcare service: Case study of General Practitioners selection in UKLiang, Y., Ju, Y., Zeng, X., Li, H., Dong, P. & Ju, T., 1 Feb 2025, In: Expert Systems with Applications. 261, 125542.Research output: Contribution to journal › Article › peer-review Open AccessFile Healthcare Service 100% Adjacency Relation 25% Capacity Parameter 25% 15 Downloads (Pure) Classifying infinite-dimensional data with unified basis functions: An effective machine learning approachShang, J. & Zeng, X.-J., 14 Mar 2025, In: Neurocomputing. 622, 129245.Research output: Contribution to journal › Article › peer-review Open Access Machine Learning Approach 100% Basis Function 100% Dimensional Space 100% Dimensional Data 100% Functional Data 75% Enhancing multi-agent communication through credibility and reward-based optimisationLin, Y.-Y. & Zeng, X.-J., 14 May 2025, (E-pub ahead of print) In: International Journal of General Systems. p. 1-25Research output: Contribution to journal › Article › peer-review Open AccessFile multi agent 100% Regularization 100% Multi Agent Systems 50% Agent Interaction 50% Task Performance 50% 37 Downloads (Pure) Graph-Deep-Reinforcement-Learning-Based Joint Computation Offloading and SFC Deployment in UAV-Assisted Edge ComputingChai, Y., Chen, Q., Cheng, L. & Zeng, X., 21 Oct 2025, (Accepted/In press) In: IEEE Transactions on Cognitive Communications and Networking.Research output: Contribution to journal › Article › peer-review Joints (Structural Components) 100% Unmanned Aerial Vehicle 100% Edge Computing 100% Deep Reinforcement Learning 100% Function Chain 100% View all 135 research outputs Projects 1 Active Projects per year Decomposition based process planning of CNC machiningWang, C. C. L. (PI), Embury, S. (CoI) & Zeng, X. (CoI)1/03/22 → 31/12/25Project: Research Process Planning 100% Smart Manufacturing 25% Milling Machine 25% Machine Learning Technique 25% Realization 25% Prizes Microsoft European Retail Application Developer (RAD) Awards for PriceStratTM (intelligent pricing decision support software system for retails) in 2003 with KSS LtdZeng, X. (Recipient), 2003Prize: Prize (including medals and awards) Impacts Intelligent Pricing Decision Support SystemsZeng, X. (Participant) & Cassaigne, N. (Participant)Impact: Economic, Society and culture",
  "content_length": 9748,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:18"
}