{
  "name": "Xiaokuan Zhang",
  "homepage": "https://mainarke.github.io",
  "status": "success",
  "content": "Xiaokuan Zhang's Homepage Xiaokuan Zhang (Pronounced: siao-kwan-jahng) Assistant Professor Department of Computer Science College of Engineering and Computing George Mason University Office: Research Hall 357 Email: xiaokuan AT gmu DOT edu [Google Scholar] [C.V.] [Github] About Me I am a tenure-track assistant professor in the Department of Computer Science at George Mason University (GMU). Before joining GMU, I spent one year as a postdoc researcher at Georgia Tech, working with Prof. Taesoo Kim. I graduated from The Ohio State University (OSU) with a Ph.D. in Computer Science and Engineering, advised by Prof. Yinqian Zhang. I also work closely with Prof. Zhiqiang Lin. Before coming to OSU, I graduated from Shanghai Jiao Tong University (SJTU) with a Bachelor's degree in Computer Science. I am interested in security problems in emerging systems and technologies, with a recent focus on eXtended Reality (XR), Decentralized Finance (DeFi/Web3) and memory-safe languages (Rust). I am also working on projects related to side channels, confidential computing, and mobile security. I lead the SECSAT (Security of Emerging Computer Systems And Technologies) Lab at GMU. My work have received ACM CCS Distinguished Paper Award, ACM SIGSOFT Distinguished Paper Award and Springer Cybersecurity Award (Best Practical Research Paper). My papers were selected as the top 10 finalists of NYU Cyber Security Awareness Week (CSAW) best applied security paper in 2016, 2018 and 2022, respectively. I received Ethereum Foundation Academic Grants in 2023 and 2024, and the NortonLifeLock Research Group Graduate Fellowship in 2020. I am looking for motivated students to work on cutting-edge security problems with me. If you are interested in working with me at GMU as my Ph.D. student, please read this [advice] and this [note] (Chinese version here). If you are already enrolled in the GMU-CS program (undergrad or MS) and want to do research in my lab, please feel free to reach out as well. Why GMU? As of August 2025: GMU is 34 (Security: 20) in CSRankings News (10/2025)[Award] Our XR security workshop paper on detecting insecure UI properties has received the Best Paper Honorable Mention Award! Congrats to my students, Bertram (undergrad) and Vamsi (PhD)! (10/2025)[Activity] I am invited to join a panel on \"From Risk to Resilience: Securing the Everyday XR Experience\" at the First Workshop on Enhancing Security, Privacy, and Trust in Extended Reality (XR) Systems! (09/2025)[Activity] I am invited to give a talk at the First Workshop on Enhancing Security, Privacy, and Trust in Extended Reality (XR) Systems! (08/2025)[Paper] Our XR security paper has been accepted by the First Workshop on Enhancing Security, Privacy, and Trust in Extended Reality (XR) Systems! Congrats to Bertram and Vamsi! (07/2025)[Award] Our CCS'24 paper on Web3 authentication has received the Springer Cybersecurity Award (Best Practical Research Paper)! Congrats to my student Kailun! (07/2025)[Paper] Our VR firmware security paper has been accepted by ACM CCS 2025! Congrats to my students, Vamsi and Yichang! (06/2025)[Paper] Our web3 security survey paper has been accepted by Foundations and Trends® in Privacy and Security! (06/2025)[Service] I am invited to serve on the program committee of two XR Security Workshops: Trust-XR (co-located with ISMAR 2025) and XR-Security (co-located with ACM MobiHoc 2025). Consider submitting your work! (06/2025)[Activity] I am hosting two high-school students this summer for STEM and cybersecurity education. Welcome to my group! (06/2025)[Activity] I attended the Amazon Security Day hosted at the brand new Virginia Tech Innovation Campus (Alexandria, VA)! (05/2025)[Activity] I co-organized and attended the ACSIC SOFC 2025 (Washington, DC)! (05/2025)[Activity] I attended the 5th High-Performance Computing Security Workshop hosted by NIST (Rockville, MD)! (04/2025)[Service] I am invited to serve on the program committee of USENIX Security 2026. (04/2025)[Paper] Our paper on web3 cross-chain bridge measurement has been accepted to appear in AsiaCCS 2025! (04/2025)[Activity] I attended the CCI Symposium 2025 (Richmond, VA)! (04/2025)[Award] An undergrad researcher (Bertram Liu) from my group received an award from the Undergraduate Research Scholars Program (URSP) in GMU; he will be working on XR security projects with me during the summer. Congrats, Bertram! (03/2025)[Activity] I attended NSF Workshop on Networking and Systems Challenges in Immersive Computing hosted at Mason Square (Arlington, VA)! (03/2025)[Activity] I attended 2025 DMV Security Workshop (Arlington, VA)! (03/2025)[Service] I am invited to serve on the program committee of NDSS 2026. (03/2025)[Service] I am invited to serve on the program committee of ACSAC 2025. (01/2025)[Paper] Our paper on detecting Rust type confusion bugs has been accepted to appear in USENIX Security 2025! (12/2024)[Grant] I received a grant from the Commonwealth Cyber Initiative (CCI) (with Dr. Huajie Shao and Dr. Yue Xiao)! Thank you for supporting our AI for Security research! (11/2024)[Paper] Two papers (one on Rust unit test generation, one on proxy patterns of smart contracts) have been accepted to appear in ICSE 2025! (10/2024)[Award] Our CCS'24 paper on security problems of web3 authentication has received the ACM CCS Distinguished Paper Award!!! Huge congrats to my student Kailun! (10/2024)[Activity] I attended ACM CCS 2024 and served as a session chair. Glad to meet new and old friends at Salt Lake City! (09/2024)[Award] Our CCS'23 paper on using electromagnetic signals to recover fingerprints from in-display fingerprint sensors on smartphones has received the Springer Cybersecurity Award (Best Practical Research Paper)! (09/2024)[Grant] I received an Ecosystem Support Program (ESP) grant from the Ethereum Foundation! Thank you for supporting our web3 security research! (09/2024)[Paper] Our paper on enabling secure I/O via isolation on ARM CCA has been accepted to appear in Oakland 2025! (08/2024)[Paper] Our paper on feasibility of reorganization attacks on Ethereum private transactions has been accepted to appear in ACSAC 2024! (08/2024)[Activity] I am invited to give a talk on XR privacy issues in the NIST Extended Reality (XR) Community of Interest (COI) monthly meeting! (07/2024)[Grant] I received an Academic Grant from the Ethereum Foundation! Thank you for supporting our web3 security research! (07/2024)[Service] I am invited to serve on the program committee of AsiaCCS 2025. (07/2024)[Service] I am invited to serve on the program committee of USENIX Security 2025. (07/2024)[Paper] Our paper on privacy policies of VR apps has been conditionally accepted to appear in ACM CCS 2024! (06/2024)[Paper] Our cross-chain bridge security paper has been accepted to appear in RAID 2024! (06/2024)[Activity] I am hosting five high-school students this summer for STEM and cybersecurity education. Welcome to my group! (05/2024)[Grant] I received a 4-VA Collaborative Research Grant (with Dr. Wenjie Xiong @VT)! Thank you for supporting our VR security research! (04/2024)[Service] I am invited to serve on the best paper selection committee of AsiaCCS 2024. (04/2024)[Service] I am invited to serve on the program committee of NDSS 2025. (04/2024)[Paper] Two papers (one on web3 authentication, one on Android ad fraud) have been conditionally accepted to appear in ACM CCS 2024! (03/2024)[Service] I am invited to serve on the program committee of IEEE Global Blockchain Conference (GBC) 2024. (03/2024)[Paper] One paper on SGX state continuity has been accepted by IEEE Transactions on Dependable and Secure Computing (TDSC)! (03/2024)[Activity] I participated in the first DMV security workshop. (02/2024)[Award] Our ICSE'24 paper on Android clipboard security has received the ACM SIGSOFT Distinguished Paper Award!!! (02/2024)[Service] I am invited to serve as the Web Chair of Information Security Conference (ISC) 2024. It will be held in the DC area. Consider submitting your best work! (02/2024)[Activity] I participated in the Hackfax Hackathon (organized by the GMU CS Club) as a judge. (02/2024)[Service] I am invited to serve on the program committee of ACSAC 2024. (01/2024)[Activity] I participated in the Thomas Jefferson High School for Science and Technology (TJHSST) Science and Engineering Fair as a judge. (01/2024)[Paper] One paper on VR privacy issues has been accepted to appear in USENIX Security 2024! (12/2023)[Grant] I received a grant from the Commonwealth Cyber Initiative (CCI) (with Dr. Ziyu Yao)! Thank you for supporting our research! (12/2023)[Service] I am invited to serve on the program committee of ACM CCS 2024. (11/2023)[Paper] One paper on SGX side-channel defenses has been accepted to appear in NDSS 2024! Congrats to Fan! (09/2023)[Paper] One paper on EM side-channel attacks has been accepted to appear in ACM CCS 2023! Congrats to Tao! (08/2023)[Paper] One paper on Confidential Virtual Machines has been accepted to appear in ASPLOS 2023! Congrats to Adil! (08/2023)[Paper] One paper on Android clipboard security has been accepted to appear in ICSE 2024! Congrats to Yongliang! (08/2023)[Grant] I received a seed grant from the CAHMP center at GMU! Thank you for supporting my XR security research! (08/2023)[Service] I am invited to serve on the program committee of the 2023 ACM Cloud Computing Security Workshop (CCSW). (06/2023)[Paper] One paper has been conditionally accepted to appear in ACM Mobicom 2023! Congrats to Tao! (05/2023)[Service] I am invited to serve on the program committee of USENIX Security 2024. (05/2023)[Grant] I received two Academic Grants from the Ethereum Foundation! Thank you for supporting our smart contract research! (05/2023)[Service] I am invited to serve on the program committee of the 2024 ASIA Conference on Computer and Communications Security (AsiaCCS). (05/2023)[Activity] I attended the 2023 NSF SaTC Aspiring PI Workshop; glad to meet old and new friends there! ",
  "content_length": 26933,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:31"
}