{
  "name": "Xiao Zhang 0016",
  "homepage": "https://xiao-zhang.net",
  "status": "success",
  "content": "Xiao ZhangSearchXiao ZhangTenure-Track FacultyCISPA Helmholtz Center for Information SecurityBio: I am a faculty member at CISPA Helmholtz Center for Information Security, where I lead the AIR-ML Lab. Prior to this, I earned my PhD in Computer Science at the University of Virginia, where I was advised by Prof. David Evans. I also hold an MS degree in Statistics from the University of Virginia and a BS degree in Mathematics and Applied Mathematics from Tsinghua University. I am a member of the European Laboratory for Learning and Intelligent Systems, affiliated with ELLIS Unit Saarbrücken.Research Interest: My research spans a broad range of topics in machine learning (ML), with a primary focus on trustworthy AI, encompassing robustness, safety, privacy, bias, and interpretability. I’m also interested in deep learning theory, generative modeling, and optimization. Ultimately, my goal is to develop principled adversarial ML approaches to tackle the fundamental challenges in building reliable and trustworthy AI systems.I am always looking for self-motivated students interested in machine learning research, including PhD students, HiWis, intern and visiting students. An up-to-date list of my publications is available on Google Scholar. Please visit our lab website for more information about our current research directions and available positions.Featured PublicationsAdvik Raj Basani, Xiao ZhangSeptember 2025 NeurIPS 2025GASP: Efficient Black-Box Generation of Adversarial Suffixes for Jailbreaking LLMsWe introduce Generative Adversarial Suffix Prompter (GASP), a novel framework that combines human-readable prompt generation with Latent Bayesian Optimization (LBO) to improve adversarial suffix creation in a fully black-box setting.PDF Cite Code ArXiv OpenReviewWenshu Fan, Minxing Zhang, Hongwei Li, Wenbo Jiang, Hanxiao Chen, Xiangyu Yue, Michael Backes, Xiao ZhangJanuary 2025 CCS 2025 (Distinguished Paper Award)DivTrackee versus DynTracker: Promoting Diversity in Anti-Facial Recognition against Dynamic FR StrategyWe highlight the importance of using dynamic FR strategies to evaluate AFR methods, and propose DivTrackee as a promising countermeasure.PDF Cite Code ArXivAnshuman Suri, Xiao Zhang, David EvansNovember 2024 TMLR 2024Do Parameters Reveal More than Loss for Membership Inference?We show how prior claims about black-box access sufficing for optimal membership inference do not hold for most useful settings such as SGD, and validate our findings with a new white-box inference attack.PDF Cite Code ArXiv OpenReviewFnu Suya, Xiao Zhang, Yuan Tian, David EvansNovember 2023 NeurIPS 2023What Distributions are Robust to Indiscriminate Poisoning Attacks for Linear Learners?Understand the inherent vulnerabilities to indiscriminate data poisoning attacks for linear learners by studying the optimal poisoning strategy from the perspective of data distribution.PDF Cite ArXivXiao Zhang, David EvansMay 2022 ICLR 2022Understanding Intrinsic Robustness using Label UncertaintyBuilt upon a novel definition of label uncertainty, we develop an empirical method to estimate a more realistic intrinsic robustness limit for image classification tasks.PDF Cite Code ArXiv OpenReviewPublicationsQuickly discover relevant content by filtering publications. Subrat Kishore Dutta, Yuelin Xu, Piyush Pant, Xiao Zhang (2025). GREAT: Generalizable Backdoor Attacks in RLHF via Emotion-Aware Trigger Synthesis. ArXiv.PDF Cite ArXiv Santanu Rathod, Francesco Ceccarelli, Sean B. Holden, Pietro Liò, Xiao Zhang, Jovan Tanevski (2025). ContextFlow: Context-Aware Flow Matching For Trajectory Inference From Spatial Omics Data. ArXiv.PDF Cite Code ArXiv Advik Raj Basani, Xiao Zhang (2025). GASP: Efficient Black-Box Generation of Adversarial Suffixes for Jailbreaking LLMs. NeurIPS 2025.PDF Cite Code ArXiv OpenReview Youngjin Kwon, Xiao Zhang (2025). Controllable Adversarial Makeup for Privacy via Text-Guided Diffusion. ArXiv.PDF Cite Code ArXiv Zhizhen Chen, Zhengyu Zhao, Subrat Kishore Dutta, Chenhao Lin, Chao Shen, Xiao Zhang (2025). Generalizable Targeted Data Poisoning against Varying Physical Objects. ArXiv.PDF Cite Code ArXiv Devansh Srivastav, Xiao Zhang (2025). Safe in Isolation, Dangerous Together: Agent-Driven Multi-Turn Decomposition Jailbreaks on LLMs. ACL 2025 REALM Workshop (Oral).PDF Cite Source DocumentSee all publications ContactName Email Message Send xiao.zhang@cispa.de +49 681 87083 2342 Im oberen Werk 1, St. Ingbert, Saarland 66386 My office is Room 0.28 at CISPA D2 buildingCite × Copy Download",
  "content_length": 4548,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:15"
}