{
  "name": "Xiao Qin 0001",
  "homepage": "http://www.eng.auburn.edu/~xqin",
  "status": "success",
  "content": "Xiao Qin, Professor of Computer Science, Auburn University Home Teaching Research Current Projects Completed Projects Research Funding Research Sponsors Presentations Publications Journal Papers Book Chapters Conference Papers Technical Reports Theses Students Current Students Student Alumni Other Students Photos Awards by Student Publications by Student Software Useful Links Conferences Research Groups Projects People References Papers Tools Software Xiao Qin Professor and Director of Graduate Programs Book time to meet with me If you are wondering how to pronounce my name click here Shelby Center for Engineering Technology, Suite 3101E Department of Computer Science and Software Engineering Samuel Ginn College of Engineering Auburn University, AL 36849-5347 Office: 334-844-6327 Fax: 334-844-6329 xqin@auburn.edu » curriculum vitae Latest News Archive Jiang Defends and Heads to Earlham College In summer 2014, Xunfei Jiang successfully defended her dissertation. Dr. Jiang is an Assistant Professor of Computer Science at Earlham College, IN. read more New paper published in ACM Trans. Storage Our new paper, led by Adam Manzanares, documents an energy-aware prefetching strategy (PRE-BUD) for parallel I/O systems with disk buffers. read more ORCA Source Code Released This offloading library enables users easily applying I/O offloading technology to either an existing or a newly developed I/O-intensive application with minor efforts. read more Al Assaf Defends Dissertation and Joins University of Jordan Al Assaf successfully defended his dissertation on Nov. 9, 2011. He will join the University of Jordan as an assistant professor. read more Auburn moves up Auburn University is ranked 38th among public universities nationwide. read more Focusing on Data Storage Systems BUD: A Buffer-Disk Architecture for Energy-Efficient Parallel Disks data storage system The goal of this research is to develop energy conservation techniques that provide significant energy savings while achieving low-cost and high-performance for parallel storage systems. read more MINT: Mathematical Reliability Models for Energy-Efficient Parallel Disk Systems Mint Model We address the mathematical underpinnings of modeling reliability of energy-efficient parallel disk systems, where fault tolerance and energy-saving techniques are seamlessly integrated together to conserve energy without sacrificing reliability in parallel disk systems. read more Multicore-Based Parallel Disk Systems for Large-Scale Data-Intensive Computing data storage system We investigate active storage systems which data and I/O processing are offloaded to multicore processors embedded in storage nodes. We bridge the technology gap between multicore computing and parallel storage systems by addressing fundamental issues of multicore computing, data processing and performance analysis for data-intensive computing systems. read more Data-Mining-Based Multilayer Prefetching for Hybrid Storage Systems BUD system We develop data-mining-based multilayer prefetching techniques to improve the performance of data centers with hybrid storage systems. The technology results in data being loaded from disks to main memory before it is accessed from the disks, thus improving performance and reliability of hybrid storage systems with solid state disks (SSDs), hard disks (HDDs) and tapes. read more A Brief Biography Xiao Qin is a Professor and the Director of Graduate Programs in the Department of Computer Science and Software Engineering at Auburn University. He received the B.S. and M.S. degrees in Computer Science from Huazhong University of Science and Technology, China, in 1996 and 1999, respectively. He received the Ph.D. in Computer Science from the University of Nebraska-Lincoln in 2004. Prior to joining Auburn University in 2007, he had been an assistant professor with New Mexico Institute of Mining and Technology (New Mexico Tech) for three years. He won an NSF CAREER award in 2009. His research interests include parallel and distributed systems, real-time computing, storage systems, fault tolerance, and performance evaluation. His research is supported by the U.S. National Science Foundation, Auburn University, and Intel Corporation. He had served as a subject area editor of IEEE Distributed System Online (2000-2001). He has been on the program committees of various international conferences, including IEEE Cluster, IEEE IPCCC, and ICPP. download the source code of our data placement module for heterogeneous Hadoop cl Teaching Research Current Projects Completed Projects Research Funding Research Sponsors Presentations Publications Journal Papers Book Chapters Conference Papers Technical Reports Theses Students Current Students Student Alumni Other Students Photos Awards by Students Publications by Students Software Useful Links Conferences Research Groups Projects People References Papers Tools Software Updated on: 8/13/2025 Designed by Hyongwoo Hur",
  "content_length": 4972,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:15"
}