{
  "name": "Xiaoxue Ren",
  "homepage": "https://xiaoxuerens.github.io",
  "status": "success",
  "content": "Xiaoxue Ren (任晓雪)SearchXiaoxue Ren (任晓雪)Assistant Professor(ZJU100 Young Professor)School of Software Technology Zhejiang UniversityBiographyI am currently an assistant professor (ZJU100 Young Professor) in the School of Software Technology at Zhejiang University, China. Before joining Zhejiang University, I was a postdoctoral research fellow at the Chinese University of Hong Kong, working with Prof. Michael R. Lyu. I obtained my Ph.D degree in Computer Science and Technology from Zhejiang University, where I was very fortunate to work under the supervision of Prof. Jianling Sun. During my PhD period, I also had an unforgettable visiting experience at the Australian National University under the supervision of Prof. Zhenchang Xing. My research interests include Software Engineering, Knowledge Graph and Blockchain.I am currently recruiting Masters and PhD students for the September 2026 intake, focusing on the application of artificial intelligence in software engineering (AI4SE). Interested candidates who are keen on academic research please contact me via email.Research InterestsSoftware EngineeringKnowledge GraphBlockchainNews[March, 2025] Invited to work as the PC Member of APSEC 2025.[Feb, 2025] Invited to work as the PC Member of ASE 2025.[Jun, 2024] Invited to work as the PC Member of APSEC 2024.[Jun, 2024] Invited to work as the PC Member of ESEC/FSE 2025.[April, 2024] Invited to work as the PC Member of ICSE 2025.[Jun 5, 2024] Our paper working on Jumpcoder (Code Online Modification) has been accepted by ACL'24.[Jan 24, 2024] Our paper working on Pythonic idioms refactory has been accepted by ESEC/FSE'24.[Jul 23, 2023] Our paper working on knowledge-driven large language model on code generation has been accepted by ASE'23.[Jul 28, 2023] Our paper working on API-knowledge aware search-based software testing has been accepted by ESEC/FSE'23.[Jul 31, 2023] Our paper working on smart contract vulnerability detection has been accepted by ISSRE'23.Publications [TSE'25] Hydra-Reviewer: A holistic multi-agent system for automatic code review comment generation.Xiaoxue Ren, Chaoqun Dai, Qiao Huang, Ye Wang, Chao Liu, Bo Jiang.IEEE Transactions on Software Engineering (TSE). Accepted. [ASE'25] PEACE: Towards Efficient Project-Level Efficiency Optimization via Hybrid Code Editing.Xiaoxue Ren, Jun Wan, Yun Peng, Zhongxin Liu, Ming Liang, Dajun Chen, Wei Jiang, Yong Li.40th ACM/IEEE International Conference on Automated Software Engineering (ASE). Accepted. [ASE'25] Issue Localization via LLM-driven Iterative Code Graph Searching.Zhonghao Jiang, Xiaoxue Ren, Meng Yan, Wei Jiang, Yong Li and Zhongxin Liu.40th ACM/IEEE International Conference on Automated Software Engineering (ASE). Accepted. [ASEJ'25] HMF: Enhancing reentrancy vulnerability detection and repair with a hybrid model framework.Mengliang Li, Qiang Shen, Xiaoxue Ren*, Han Fu, Zhuo Li, Jianling Sun.Automated Software Engineering (ASEJ). Accepted.Pdf [TSC'25] KG4VA: Constructing Vulnerability Knowledge Graph for Software Vulnerability Assessment.Zhenlei Ye, Xiaobing Sun, Lili Bo, Sicong Cao, Xiaoxue Ren, Lianyong QiLe Deng.IEEE Transactions on Services Computing (TSC). Accepted.Pdf [ICSME'25] Bridging Solidity Evolution Gaps: An LLM-Enhanced Approach for Smart Contract Compilation Error Resolution.Likai Ye, Mengliang Li, Dehai Zhao, Jiamou Sun, Xiaoxue Ren*.International Conference on Software Maintenance and Evolution (ICSME). Accepted.Pdf [TSE'25] Enhancing Project-specific Code Completion by Inferring Internal API InformationLe Deng, Xiaoxue Ren, Chao Ni, Ming Liang, David Lo and Zhongxin LiuIEEE Transactions on Software Engineering (TSE). Accepted.Pdf [TSE'25] FlexFL: Flexible and Effective Fault Localization With Open-source Large Language ModelsChuyang Xu, Zhongxin Liu, Xiaoxue Ren , Gehao Zhang, Ming Liang, David LoIEEE Transactions on Software Engineering (TSE). Accepted.Pdf [FSE'25] COFFE: A Code Efficiency Benchmark for Code GenerationYun Peng, Jun Wan, Yichen Li, Xiaoxue Ren*.Distinguished Paper Award 🏆 ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering. Accepted as a Full Paper.[APSEC'24] Enhancing Reentrancy Vulnerability Detection and Repair with a Hybrid Model Framework.Mengliang Li, Xiaoxue Ren*, Han Fu, Zhuo Li, Jianling Sun. Distinguished Paper Award 🏆The Asia-Pacific Software Engineering Conference . Accepted as a Full Paper.[TSE'24] A3-CodGen: A Repository-Level Code Generation Framework for Code Reuse With Local-Aware, Global-Aware, and Third-Party-Library-AwareDianshu Liao, Shidong Pan, Xiaoyu Sun, Xiaoxue Ren, Qing Huang, Zhenchang Xing, Huan Jin.IEEE Transactions on Software Engineering. Accepted.[ACL'24] JumpCoder: Go Beyond Autoregressive Coder via Online ModificationMouxiang Chen, Hao Tian, Zhongxin Liu, Xiaoxue Ren, Jianling Sun.The 62nd Annual Meeting of the Association for Computational Linguistics. Accepted as a Full Paper.[ESEC/FSE'24] Refactoring to Pythonic Idioms: A Hybrid Knowledge-Driven Approach Leveraging Large Language ModelsZejun Zhang, Zhenchang Xing, Xiaoxue Ren*, Qinghua Lu and Xiwei Xu.ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering. Accepted as a Full Paper.[ISSRE'23] ConvMHSA-SCVD: Enhancing Smart Contract Vulnerability Detection through a Knowledge-Driven and Data-Driven FrameworkMengliang Li, Xiaoxue Ren*, Han Fu, Zhuo Li and Jianling Sun.34th IEEE International Symposium on Software Reliability Engineering. Accepted as a Full Paper.[ESEC/FSE'23] API-Knowledge Aware Search-based Software Testing: Where, What and HowXiaoxue Ren, Xinyuan Ye, Yun Lin, Zhenchang Xing, Shuqing Li, Michael R. Lyu.ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering. Accepted as a Full Paper.[ASE'23] From Misuse to Mastery: Enhancing Code Generation with Knowledge-Driven AI ChainingXiaoxue Ren, Xinyuan Ye, Dehai Zhao, Zhenchang Xing, Xiaohu Yang.38th ACM Transactions on Software Engineering and Methodology. Accepted as a Full Paper.PDF[TSE'22] API Usage Recommendation via Multi-View Heterogeneous Graph Representation LearningYujia Chen, Cuiyun Gao, Xiaoxue Ren, Yun Peng, Xin Xia, Michael R. Lyu.IEEE Transactions on Software Engineering. Accepted.[DSN'22] Characterizing and Mitigating Anti-patterns of Alerts in Industrial Cloud SystemsTianyi Yang, Jiacheng Shen, Yuxin Su, Xiaoxue Ren, Yongqiang Yang, and Michael R. Lyu.52nd Annual IEEE/IFIP International Conference on Dependable Systems and Networks. Accepted as a Full Paper.[ESEC/FSE'21] KGAMD: An API-Misuse Detector Driven by Fine-Grained API-Constraint Knowledge GraphXiaoxue Ren, Xinyuan Ye, Zhenchang Xing, Xin Xia, Xiwei Xu, Liming Zhu, Jianling Sun.29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering. Accepted as a tool demo paper.[ICSE'21] Unveiling the Mystery of API Evolution in Deep Learning Frameworks: A Case Study of Tensorflflow 2Zejun Zhang, Yanming Yang, Xin Xia, David Lo, Xiaoxue Ren, John Grundy.43rd ACM/IEEE International Conference on Software Engineering. Accepted as a SEIP Track Full Paper.[ASE'21] Automating Developer Chat MiningShengyi Pan, Lingfeng Bao, Xiaoxue Ren, Xin Xia, David Lo, Shanping Li.36th IEEE/ACM International Conference on Automated Software Engineering. Accepted as a Full Paper.[ASE'20] API-Misuse Detection Driven by Fine-Grained API-Constraint Knowledge GraphXiaoxue Ren, Xinyuan Ye, Zhenchang Xing, Xin Xia, Xiwei Xu, Liming Zhu, Jianling Sun.35th IEEE/ACM International Conference on Automated Software Engineering. Accepted as a Full Paper.[ICSE'20] Demystify Official API Usage Directives with Crowdsourced API Misuse Scenarios, Erroneous Code Examples and PatchesXiaoxue Ren, Jiamou Sun, Zhenchang Xing, Xin Xia, Jianling Sun.42nd ACM/IEEE International Conference on Software Engineering. Accepted as a Full Paper.[ASE'19] Discovering, Explaining and Summarizing Controversial Discussions in Community Q&A SitesXiaoxue Ren, Zhenchang Xing, Xin Xia, Guoqiang Le, Jianling Sun.34th IEEE/ACM International Conference on Automated Software Engineering. Accepted as a Full Paper.[TOSEM'19] Neural Network-based Detection of Self-Admitted Technical Debt: From Performance to ExplainabilityXiaoxue Ren, Zhenchang Xing, Xin Xia, David Lo, Xinyu Wang, John Grundy.ACM Transactions on Software Engineering and Methodology. Accepted.[COMPSAC'18] Characterizing Common and Domain-Specific Package Bugs: A Case Study on UbuntuXiaoxue Ren, Qiao Huang, Xin Xia, Zhenchang Xing, Lingfeng Bao, David Lo.41st Annual International Computers, Software & Applications Conference. Accepted as a Short PaperService32st Asia-Pacific Software Engineering Conference (APSEC 2025), PC member40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), PC member31st Asia-Pacific Software Engineering Conference (APSEC 2024), PC memberACM International Conference on the Foundations of Software Engineering (FSE 2025), PC member47th IEEE/ACM International Conference on Software Engineering (ICSE 2025), PC member14th Asia-Pacific Symposium on Internetware (Internetware 2023), PC memberIEEE Transactions on Software Engineering (TSE), ReviewerACM Transactions on Software Engineering and Methodology (TOSEM), ReviewerEmpirical Software Engineering (EMSE), ReviewerAutomated Software Engineering Journal(AUSE), ReviewerJournal of Software: Evolution and Process ( JSME), ReviewerMSR2021 Conference, Shadow PCAwards32st Asia-Pacific Software Engineering Conference (APSEC 2025), PC member40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), PC member31st Asia-Pacific Software Engineering Conference (APSEC 2024), PC memberACM International Conference on the Foundations of Software Engineering (FSE 2025), PC memberCite × Copy Download",
  "content_length": 9907,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:43"
}