{
  "name": "Xiaojun Shang",
  "homepage": "https://www.xiaojunshang.org",
  "status": "success",
  "content": "AboutSearch this siteEmbedded FilesSkip to main contentSkip to navigationXiaojun Shang, Ph.D.Assistant professorDepartment of Computer Science and EngineeringUniversity of Texas at ArlingtonEmail: xiaojun.shang [at] uta.edu[Google Scholar]  [DBLP]Welcome! I'm Xiaojun Shang, an assistant professor in the Department of Computer Science and Engineering at the University of Texas at Arlington (UTA). My research interests lie in developing practical algorithms and systems to advance computational- and data-intensive applications in distributed computing scenarios. Research interests:Connected and Autonomous VehiclesSoftware Defined NetworkingMachine Learning on Heterogeneous SystemsDistributed Quantum ComputingBefore joining UTA, I received Ph.D. in Computer Engineering at State University of New York at Stony Brook advised by Prof. Yuanyuan Yang, M.S. in Electrical Engineering at Columbia University, and B.E. in Information and Communication Engineering from Chu Kochen Honors College at Zhejiang UniversitySelected publicationsview all publicationsMobile Edge Computing and NetworksMulti-view Spatial-Temporal-Type Learning for Heterogeneous City Service Time Estimation. SIGSPATIAL 2025 (accepted)Practical Reflection Manipulation on mmWave-Based Physical Intrusion Detection. CNS 2025 (accepted)Secured Data Sharing and Storage System for Intelligent Transportation System via Lightweight Blockchain. LCN 2025 (accepted)Object Characterization using Radio Frequency Propagation in Wireless Digital Twin. ICC 2025 (accepted)Provable Approximation Algorithms for Online Traffic-Sensitive SFC Deployment. TON 2025Online Container Scheduling for Data-intensive Applications in Serverless Edge Computing. INFOCOM 2023Enabling QoE support for interactive applications over mobile edge with high user mobility. INFOCOM 2022Reducing the Service Function Chain Backup Cost over the Edge and Cloud by a Self-adapting Scheme. INFOCOM 2020 (Best paper award)Quantum Computing and CommunicationA Nonblocking Multistage Switching Network for Distributed Quantum Computing. TON 2025Multi-User Entanglement Routing Design over Quantum Internets. ICDCS 2024 (Best paper award)Network topology design for distributed quantum computing. ICDCS 2024Performance Analysis of Interconnection Networks for Distributed Quantum Computing. GLOBECOM 2024Lab membersWei Lin (Fall 2023 - present, UTA CSE Ph.D. student)Wentao Dexter Gao (Fall 2024 - present, UTA CSE Ph.D. student)Talha Nayyar (Summer 2025 - present, UTA CSE Ph.D. student)Md. Sazid Reza (Fall 2025 - present, UTA CSE Ph.D. student)Sarthak Wadhawan (Fall 2024 - present, co-advised with Prof. Jiayi Meng)Recent updates[09/2024] Our paper on multi-user entanglement routing design over quantum internets won Best Paper Award at ICDCS 2024.[03/2024] Our paper on mobility-aware seamless virtual function migration was accepted to IEEE Transactions on Mobile Computing[03/2024] Our paper on joint virtual network function placement was accepted to IEEE Transactions on Computers.[07/2023] Our paper on energy-aware online task offloading and resource allocation was accepted to ICDCS. [01/2023] A summary of our recent work published on ACM SIGMETRICS Performance Evaluation Review.[12/2022] Two papers accepted to INFOCOM 2023TeachingUTA CSE 2312 (Computer Organization and Assembly Language)​  Services Adhoc Journal and Conference reviewer:IEEE Conference on Computer Communications (INFOCOM)IEEE Transactions on Parallel and Distributed Systems (TPDS)IEEE/ACM International Symposium on Quality of Service (IWQoS)IEEE Global Communications Conference (GLOBECOM)IEEE/ACM Transactions on Networking (ToN)Oral Presentations:\"Online Container Scheduling for Data-intensive Applications in Serverless Edge Computing\", IEEE Conference on Computer Communications (INFOCOM), New York, USA 2023\"Enabling QoE Support for Interactive Applications over Mobile Edge with High User Mobility\", IEEE Conference on Computer Communications (INFOCOM), 2022\"Greening Reliability of Virtual Network Functions via Online Optimization\", IEEE/ACM International Symposium on Quality of Service (IWQoS), 2020\"Reducing the Service Function Chain Backup Cost over the Edge and Cloud by a Self-adapting Scheme\", IEEE Conference on Computer Communications (INFOCOM), 2020\"Network Congestion-aware Online Service Function Chain Placement and Load Balancing\", International Conference on Parallel Processing (ICPP), Kyoto, Japan, 2019\"Partial Rerouting for High-Availability and Low-Cost Service Function Chain\", IEEE Global Communications Conference (GLOBECOM), Abu Dhabi, UAE 2018Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4648,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:31"
}