{
  "name": "Xiaonan Guo",
  "homepage": "https://mason.gmu.edu/~xguo8",
  "status": "success",
  "content": "Welcome to Xiaonan Guo's Homepage Xiaonan Guo (Ph.D.) Assistant Professor Department of Information Science and Technology Center for Secure Information Systems (CSIS) George Mason University 44511 Patriot Cir Fairfax, VA 22030 Office: Research Hall 432 E-mail: xguo8 AT gmu.edu [Short Bio] [Research] [Publications] [Awards] [Experiences] Short Biography If you are interested in working with me, please send me an email. I am currently recruiting Ph.D. students! Xiaonan Guo is currently a tenure-track Assistant Professor in the Department of Information Science and Technology in the College of Engineering and Computing at George Mason University. Prior that he was an Assistant Professor at Indiana Unviersity-Purdue University, Indianapolis. He received a Ph.D. degree in Computer Science and Engineering from the Department of Computer Science and Engineering, The Hong Kong University of Science and Technology (HKUST). Research Interests Cyber Security and Privacy Security in Mobile Devices IoT security, Intrusion Detection Using WiFi for Smart Homes Mobile Healthcare and Large Data Analysis on Mobile Devices Research News [July 2022] Our paper \"mmFit: Low-Effort Personalized Fitness Monitoring Using Millimeter Wave\" has received the Best Paper Award Runner-up. by the IEEE International Conference on Computer Communications and Networks (IEEE ICCCN), 2022 [Nov. 2019] Our paper \"WiFi-enabled Automatic Eating Moment Monitoring Using Smartphones\" has received the Best Paper Award. by the EAI International Conference on IoT Technologies for HealthCare (EAI HealthyIoT), 2019. [Nov. 2018] Our paper \"WristSpy: Snooping Passcodes in Mobile Payment Using Wrist-worn Wearables\" has been accepted by the IEEE International Conference on Computer Communications (IEEE INFOCOM), 2019. [Nov. 2018] Our poster \"Poster: Personal PIN Leakage from Wearable Devices\" has received the Best Poster Award Runner-up. by the ACM International Conference on Mobile Computing and Networking (ACM MOBICOM), 2018. [July 2017] Our paper \"WiFi-Enabled Smart Human Dynamics Monitoring\" has been accepted by the ACM Conference on Embedded Networked Sensor Systems (ACM SenSys), 2017 . [Nov. 2016] Our paper \"FitCoach: Virtual Fitness Coach Empowered by Wearable Mobile Devices\" has been accepted by the IEEE International Conference on Computer Communications (IEEE INFOCOM), 2017 . [Oct. 2016] Our poster \"Poster: Automatic Personal Fitness Assistance through Wearable Mobile Devices\" has received the Best Poster Award Runner-up. by the ACM International Conference on Mobile Computing and Networking (ACM MOBICOM), 2016. [July 2016] Our work on \"Friend or Foe? Your Wearable Devices Reveal Your Personal PIN\" has been reported by Stevens News, IEEE Spectrum, Fortune, ABC News, USA Today, PHS ORG. [June 2016] Our paper \"Friend or Foe? Your Wearable Devices Reveal Your Personal PIN\" has received the Best Paper Award. in the ACM on Asia Conference on Computer and Communications Security (ASIACCS 2016). [Feb. 2016] Our paper \"Friend or Foe? Your Wearable Devices Reveal Your Personal PIN\" has been accepted by the ACM on Asia Conference on Computer and Communications Security (ASIACCS 2016). Publications  [Google Scholar] Journals: Tianming Zhao, Yucheng Xie, Yan Wang, Jerry Cheng, Xiaonan Guo, Yingying Chen \" A Survey of Deep Learning on Mobile Devices: Applications, Optimizations, Challenges, and Research Opportunities\", Proceedings of the IEEE , 2022. Yilin Yang, Haocong Wang, Ruizhe Jiang, Xiaonan Guo, Jerry Cheng, Yingying Chen \" A Review of IoT-enabled Mobile Healthcare: Technologies, Challenges, and Future Trends\", IEEE Internet of Things Journal , 2022. Yucheng Xie, Ruizhe Jiang, Xiaonan Guo, Yan Wang, Jerry Cheng, Yingying Chen \" mmEat: Millimeter wave-enabled environment-invariant eating behavior monitoring\", ELSEVIER Journal of Smart Health , 2022. Xiaonan Guo, Jian Liu and Yingying Chen \" When your wearables become your fitness mate\", to apear ELSEVIER Journal of Smart Health , 2020. Xiaonan Guo, Jian Liu, Cong Shi, Hongbo Liu, Yingying Chen and Mooi Choo Chuah. \" Device-free Personalized Fitness Assistant Using WiFi \", to appear Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (ACM IMWUT), 2018. Chen Wang, Xiaonan Guo, Yingying Chen, Yan Wang and Bo Liu. \" Personal PIN Leakage from Wearable Devices \", IEEE Transactions on Mobile Computing (IEEE TMC), 2017. Yuanhuai Liu, Dian Zhang, Xiaonan Guo, Min Gao, Zhong Ming, Lei Yang and Lionel M. Ni. \" RSS-based Ranging by Leveraging Frequency Diversity to Distinguish the Multiple Radio Paths\", IEEE Transactions on Mobile Computing (IEEE TMC), 2017. Haochao Li, Eddie C.L. Chan, Xiaonan Guo, Eddie CL Chan, Kaishun Wu and Lionel M. Ni. \" Wi-counter: Smartphone-based People Counter using Crowdsourced WiFi Signal Data \", IEEE Transactions on Human-Machine Systems (IEEE THMS), 2015. Xiaonan Guo, Dian Zhang, Kaishun Wu and Lionel M. Ni. \" MODLoc: Localizing Multiple Objects in Dynamic Indoor Environment \", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), 2014. Dian Zhang, Yunhuai Liu, Xiaonan Guo and Lionel M. Ni. \" Rass: A real-time, Accurate, and Scalable System for Tracking Transceiver-free Objects \", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), 2013. Conferences and Posters: Yucheng Xie, Ruizhe Jiang, Xiaonan Guo, Yan Wang, Jerry Cheng and Yingying Chen. \" mmFit: Low-Effort Personalized Fitness Monitoring Using Millimeter Wave\", in Proceedings of IEEE International Conference on on Computer Communications and Networks (IEEE ICCCN), 2022. --- Best paper Award Runner-up. Yucheng Xie, Ruizhe Jiang, Xiaonan Guo, Yan Wang, Jerry Cheng and Yingying Chen.\" Poster: Universal Targeted A acks against mmWave-based Human Activity Recognition System\", in Proceedings of the ACM International Conference on Mobile Systems, Applications, and Services (ACM MobiSys), 2022. Cong Shi, Tianming Zhao, Yucheng Xie, Tianfang Zhang, Yan Wang, Xiaonan Guo, Yingying Chen\" Environment-independent In-baggage Object Identification Using WiFi Signals\", in Proceedings of International Conference on Mobile Ad Hoc and Smart Systems (IEEE MASS ), 2021. Bin Hu, Tianming Zhao, Yucheng Xie, Yan Wang, Xiaonan Guo, Jerry Cheng, Yingying Chen\" MIXP: Efficient Deep Neural Networks Pruning for Further FLOPs Compression via Neuron Bond\", in Proceedings of International Joint Conference on Neural Networks (IJCNN ), 2021. Cong Shi, Xiaonan Guo, Ting Yu, Yingying Chen and Yucheng Xie\" Mobile Device Usage Recommendation based on User Context Inference Using Embedded Sensors\", in Proceedings of IEEE International Conference on on Computer Communications and Networks (IEEE ICCCN), 2020. Zhenzhe Lin, Yucheng Xie, Xiaonan Guo, Yanzhi Ren, Yingying Chen and Chen Wang\"WiEat: Fine-grained Device-free Eating Monitoring Leveraging Wi-Fi Signals\", in Proceedings of IEEE International Conference on on Computer Communications and Networks (IEEE ICCCN), 2020. Hongbo Liu, Zhihua Li, Yucheng Xie, Ruizhe Jiang, Yan Wang, Xiaonan Guo, Yingying Chen \" LiveScreen: Video Chat Liveness Detection Leveraging Skin Reflection\", in Proceedings of IEEE International Conference on Computer Communications (IEEE INFOCOM), 2020. Xin Yang, Jian Liu Xiaonan Guo, Yingying Chen and Yucheng Xie. \" MU-ID: Multi-user Identification Through Gaits Using Millimeter Wave Radios\", in Proceedings of IEEE International Conference on Computer Communications (IEEE INFOCOM), 2020. Zhenzhe Lin, Yucheng Xie, Xiaonan Guo, Chen Wang, Yanzhi Yan and Yingying Chen. \" WiFi-enabled Automatic Eating Moment Monitoring Using Smartphones\", in Proceedings of EAI International Conference on IoT Technologies for HealthCare (EAI Healthy IoT), 2019. --- Best paper Award. Hongbo Liu, Zhihua Li, Yucheng Xie, Ruizhe Jiang, Yan Wang, Xiaonan Guo and Yingying Chen.\" Poster: Video Chat Scam Detection Leveraging Screen Light Reflection\", in Proceedings of the ACM International conference on Mobile Computing and Networking (ACM MOBICOM)), 2019. Chen Wang, Jian Liu, Xiaonan Guo, Yan Wang and Yingying Chen.\" WristSpy: Snooping Passcodes in Mobile Payment Using Wrist-worn Wearables\", to appear in Proceedings of the IEEE International Conference on Computer Communications (IEEE INFOCOM), 2019. Chen Wang, Jian Liu, Xiaonan Guo, Yan Wang and Yingying Chen.\" Poster: Inferring Mobile Payment Passcodes Leveraging Wearable Devices\", in Proceedings of the ACM International conference on Mobile Computing and Networking (ACM MOBICOM)), 2018. --- Best Poster Award Runner-up. Xiaonan Guo, Bo Liu, Cong Shi, Hongbo Liu, Yingying Chen and Mooi Choo Chuah. \"WiFi-Enabled Smart Human Dynamics Monitoring\", in Proceedings of the ACM Conference on Embedded Network Sensor Systems (ACM SenSys), 2017. Xiaonan Guo, Jian Liu and Yingying Chen. \" FitCoach: Virtual Fitness Coach Empowered by Wearable Mobile Devices\", in Proceedings of the IEEE International Conference on Computer Communications (IEEE INFOCOM), 2017. Xiaonan Guo, Jian Liu and Yingying Chen.\" Poster: Automatic Personal Fitness Assistance through Wearable Mobile Devices\", in Proceedings of the ACM International conference on Mobile Computing and Networking (ACM MOBICOM)), 2016. --- Best Poster Award Runner-up. Chen Wang, Xiaonan Guo, Yan Wang, Yingying Chen and Bo Liu. \" Friend or Foe? : Your Wearable Devices Reveal Your Personal PIN\", in Proceedings of the ACM on Asia Conference on Computer and Communications Security (ACM ASIACCS), 2016. --- Best Paper Award. Xiaonan Guo, Kaishun Wu and Qian Zhang. \" ADAS: Adjust Directional Antenna with Sensor Hints\", in Proceedings of the IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS), 2014. Xiaonan Guo, Eddie CL Chan, Ce Liu, Kaishun Wu, Siyuan Liu and Lionel M. Ni,. \" Shopprofiler: Profiling Shops with Crowdsourcing Data\", in Proceedings of the IEEE International Conference on Computer Communications (IEEE INFOCOM), 2014. Luong Trung Tuan, Youngki Lee, Archa",
  "content_length": 12113,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:37"
}