{
  "name": "Xiaolin Huang",
  "homepage": "http://www.pami.sjtu.edu.cn/En/xiaolin",
  "status": "success",
  "content": "Institute of Image Processing and Pattern Recognition, Shanghai Jiao Tong University JAccount登录 Xiaolin Huang Introduction Monograph Papers Patent ◆ Researchers Faculty Postgraduate ◆ Projects Machine Learning Image Processing and Computer Vision Biomedical Image Analysis ◆ Research Journal Paper Conference Papers Patent Award ◆ Data ◆ Course ◆ News ◆ Cooperation ◆ Recruitment ◆ Graduates ◆ Contact Us ◆ Intranet ◆ 中文版 current location：Home >> Researchers >> Faculty Xiaolin Huang Professor Institue of Image Processing and Pattern Recognition Research Interests: Machine Learning, Optimization, and their Applications Office:  SEIEE 2-429,  Dongchuan Road 800, Shanghai 200240, P.R. China email: xiaolinhuang@sjtu.edu.cn 中文版 My Google Scholar Education 2006-2012 Ph.D.  Tsinghua University 2002-2006 B.S.    Xi'an Jiao Tong University Research Experience 2024- Full Professor, Shanghai Jiao Tong University 2016-2023 Associate Professor, Shanghai Jiao Tong University 2015-2017 Humboldt Fellow, Friedrich-Alexander Universität Erlangen-Nürnberg 2015-2016 Free Researcher, KU Leuven 2012-2015 Postdoctoral Researcher, KU Leuven Project Promoter for 2024-2027 NSFC (regular): Dyanmics Analysis and Reduction of Deep Nerual Networks: Theory, Algorithm, and Applications 2023-2027 State Key Program: Intelligent Analysis for Food and the Applications 2022-2024 Shanghai Municipal Science and Technology Commission: Robustness of DNN based on Randomness and Low-dimensinoal Trajectory 2021-2023 Training Speed Up for Multi-media Search 2021-2022 Misdetection Detection and Optimization for BN (with Huawei) 2020-2023 NSFC (regfular): Multi-layer Kernel Learning: Theory, Algorithm, and Applications 2019-2020 Robustness Enhancement for Classification and Detection (with Huawei) 2018-2021 Key Technique of Intelligent Endoscopy 2017 National Top Talent (Young Program) 2017-2019 National Natural Science Foundation of China（NSFC, Young Program）：Robust one-bit compressive sensing and its applications 2015-2017 Humboldt Foundation: Piecewise linear technology in machine learning and applications on medical engineering 2013-2015 Bilateral scientific cooperation-KU Leuven and Tsinghua University: BIL11/12T Academic Activities Senior Member, IEEE  (S’10-M’12 -SM'18) Senior Member, Chinese Association for Artificial Intelligence (CAAI) Member, Chinese Society of Image and Graphics (CSIG) Editor: Machine Learning Area Chair/Senior TPC member: ICLR, CVPR, ICCV, AAAI, ESANN, etc. People Prof. Shuning Wang，Tsinghua University Prof. Johan A.K. Suykens,  KU Leuven Prof. Andreas Maier, Universität Erlangen-Nürnberg Prof. Li Li，Tsinghua University Prof. Lei Shi，Fudan University Prof. Yipeng Liu，University of Electronic Science and Technology of China Prof. Jun Xu，Harbin Institute of Technology (Shenzhen) Associate Prof. Ming Yan，Chinese University of Hong Kong (Shenzhen) Associate Prof. Yunlong Feng，State University of New York at Albany Associate Prof. Siamak Mehrkanoon,  Utrecht Universit Associate Prof. Chao Shang, Tsinghua University Copyright @2018 Institute of Image Processing and Pattern Recognition, Shanghai Jiao Tong University. Address: 2-427 SEIEE Building, 800 Dong Chuan Rd, Shanghai, 200240, P.R.China",
  "content_length": 3224,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:33"
}