{
  "name": "Xiaoling Luo 0001",
  "homepage": "https://xiaolingluo.github.io",
  "status": "success",
  "content": "Xiaoling Luo (罗笑玲) - Homepage Xiaoling Luo She is currently an assistant professor at Shenzhen University, Shenzhen. She received her PhD from Harbin Institute of Technology, Shenzhen. Shenzhen, China Email DBLP Github Google Scholar ORCID I am currently an assistant professor at Shenzhen University, Shenzhen. In 2023, I received my Doctoral degree from Harbin Institute of Technology, Shenzhen, and my doctoral supervisor was Yong Xu (徐勇). In 2017, I graduated from South China Normal University with a bachelor’s degree in Software Engineering. My research interests include computer vision and medical image processing. News 2025.09: One paper is accepted by NeurIPS 2025! 2025.07: Two papers are accepted by ACM MM 2025! 2025.05: One paper is accepted by ICML 2025! 2025.05: One paper is accepted by IJCAI 2025! 2024.12: Three papers are accepted by AAAI 2025! 2024.07: One paper is accepted by BIB! 2024.06: Two papers are accepted by MICCAI 2024! 2024.04: One paper is accepted by JBHI! 2023.11: Two papers are accepted by AAAI 2024! 2023.09: Our paper is accepted by NeurIPS 2023! 2023.06: Our paper is accepted by TNNLS! 2023.02: We won the AAAI 2023 distinguished paper award! 2022.11: Three papers are accepted by AAAI 2023! Publications Conference Papers AAAI 2025 Like an Ophthalmologist: Dynamic Selection Driven Multi-View Learning for Diabetic Retinopathy Grading, Xiaoling Luo, Qihao Xu, Huisi Wu, Chengliang Liu, Zhihui Lai, Linlin Shen, AAAI 2025 (CCF-A) AAAI 2023 (Oral) MVCINN: Multi-View Diabetic Retinopathy Detection Using a Deep Cross-Interaction Neural Network, Xiaoling Luo, Chengliang Liu, Waikeung Wong, Jie Wen, Xiaopeng Jin, Yong Xu, AAAI 2023 (CCF-A) Hierarchical Information Aggregation for Incomplete Multimodal Alzheimer’s Disease Diagnosis, Chengliang Liu, Que Yuanxi, Qihao Xu, Yabo Liu, Jie Wen, Jinghua Wang, Xiaoling Luo (corresponding author), NeurIPS 2025 (CCF-A) Enhancing Multimodal Protein Function Prediction through Dual-Branch Dynamic Selection with Reconstructive Pre-training, Xiaoling Luo, Peng Chen, Chengliang Liu, Xiaopeng Jin, Jie Wen, Yumeng Liu, Junsong Wang, IJCAI 2025 (CCF-A) Mutual Learning for SAM Adaptation: A Dual Collaborative Network Framework for Source-Free Domain Transfer, Yabo Liu, Jinghua Wang, Waikeung Wong, Xiaoling Luo, Chengliang Liu, Yong Xu, ICML 2025 (CCF-A) PET-GPRA: Rethinking PET with Gradient-Aware Prompting and Router-Free Adapters for Few-shot Class-Incremental Learning, Yishu Liu, Zhiming Chen, Desen Wang, Xiaoling Luo, Bingzhi Chen, Guangming Lu, ACM MM 2025 (CCF-A) CauRDG: Enhancing Domain Generalization with Causal-Driven Semantic Consistency Reasoning, Zongxin Liu, Yishu Liu, Guangming Lu, Xiaoling Luo, Bingzhi Chen, ACM MM 2025 (CCF-A) Deep Hierarchies and Invariant Disease-Indicative Feature Learning for Computer Aided Diagnosis of Multiple Fundus Diseases, Yuxin Lin, Wei Wang, Xiaoling Luo, Zhihao Wu, Chengliang Liu, Jie Wen, Yong Xu, AAAI 2025 (CCF-A) DAMPER: A Dual-Stage Medical Report Generation Framework with Coarse-Grained MeSH Alignment and Fine-Grained Hypergraph Matching, Xiaofei Huang, Wenting Chen, Jie Liu, Qisheng Lu, Xiaoling Luo, Linlin Shen, AAAI 2025 (CCF-A) HACDR-Net: Heterogeneous-Aware Convolutional Network for Diabetic Retinopathy Multi-Lesion Segmentation, Qihao Xu, Xiaoling Luo (corresponding author), Chao Huang, Chengliang Liu, Jie Wen, Jialei Wang, Yong Xu, AAAI 2024 (CCF-A) GEM: Context-Aware Gaze Estimation with Visual Search Behavior Matching for Chest Radiograph, Shaonan Liu, Wenting Chen, Jie Liu, Xiaoling Luo, Linlin Shen, MICCAI 2024 (CCF-B) Simplify Implant Depth Prediction as Video Grounding: A Texture Perceive Implant Depth Prediction Network, Xinquan Yang, Xuguang Li, Xiaoling Luo, Leilei Zeng, Yudi Zhang, Linlin Shen, Yongqiang Deng, MICCAI 2024 (CCF-B) (Oral) DICNet: Deep Instance-Level Contrastive Network for Double Incomplete Multi-View Multi-Label Classification, Chengliang Liu, Jie Wen, Xiaoling Luo, Chao Huang, Zhihao Wu, Yong Xu, AAAI 2023 (CCF-A) AAAI 2023 distinguished paper award (Oral) Incomplete Multi-View Multi-Label Learning via Label-Guided Masked View-and Category-Aware Transformers, Chengliang Liu, Jie Wen, Xiaoling Luo, Yong Xu, AAAI 2023 (CCF-A) Masked Two-channel Decoupling Framework for Incomplete Multi-view Weak Multi-label Learning, Chengliang Liu, Jie Wen, Yabo Liu, Chao Huang, Zhihao Wu, Xiaoling Luo, Yong Xu, NeurIPS 2023 (CCF-A) Journal Papers A Lesion-Fusion Neural Network for Multi-View Diabetic Retinopathy Grading, Xiaoling Luo, Qihao Xu, Zhihua Wang, et al., IEEE Journal of Biomedical and Health Informatics, Early Access, 1-11, 2024. (JCR Q1, Top, IF-7.7) A comprehensive review and comparison of existing computational methods for protein function prediction, Baohui Lin#, Xiaoling Luo#, Yumeng Liu, Xiaopeng Jin, Briefings in Bioinformatics, Volume 25, Issue 4, July 2024, bbae289. (JCR Q1, Top，IF-6.8) RV-ESA: A novel computer-aided elastic shape analysis system for retinal vessels in diabetic retinopathy, Xiaoling Luo, Honggang Zhang, Jingyong Su, Wai Keung Wong, Jinkai L, Yong Xu, Computers in Biology and Medicine, 152: 106406, 2023 (JCR Q1, IF-7.7) A Deep Convolutional Neural Network for Diabetic Retinopathy Detection via Mining Local and Long-Range Dependence, Xiaoling Luo, Wei Wang, Yong Xu, Zhihui Lai, Xiaopeng Jin, Bob Zhang, David Zhang, CAAI Transactions on Intelligence Technology, 2023. (JCR Q2, IF-5.1) Information Recovery-Driven Deep Incomplete Multi-view Clustering Network, Chengliang Liu, Jie Wen, Zhihao Wu, Xiaoling Luo, Chao Huang, Yong Xu, IEEE Transactions on Neural Networks and Learning Systems, 2023. (CCF-B, JCR Q1, IF-10.4) PHR-search: a search framework for protein remote homology detection based on the predicted protein hierarchical relationships, Xiaopeng Jin, Xiaoling Luo, Bin Liu, Briefings in Bioinformatics, 23:2, bbab609, 2022. (JCR Q1, IF-9.5) MVDRNet: Multi-View Diabetic Retinopathy Detection by Combining DCNNs and Attention Mechanisms, Xiaoling Luo, Zuhui Pu, Yong Xu, Wai Keung Wong, Jingyong Su, Xiaoyan Dou, Baikang Ye, Jiying Hu, Lisha Mou, Pattern Recognition, 120: 108104, 2021. (CCF-B, JCR Q1, IF-8.0) Multi-resolution Dictionary Learning for Face Recognition, Xiaoling Luo, Yong Xu, Jian Yang, Pattern Recognition, 93: 283-292, 2019. (CCF-B, JCR Q1, IF-8.0) Honors and Awards 2023.02 AAAI 2023 distinguished paper award. Educations 2017.09 - 2023.09, School of Computer Science of Technology, Harbin Institute of Technology, Shenzhen, China. 2013.09 - 2017.06, School of Software Engineering, South China Normal University, China. Academic Activities Reviewers of IEEE TNNLS, Pattern Recognition, CAAI TRIT, AAAI, NeurIPS, ICML, ICLR, ACM MM, MICCAI Program Committee Members of AAAI",
  "content_length": 6751,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:34"
}