{
  "name": "Xiaoming Wu 0003",
  "homepage": "https://www4.comp.polyu.edu.hk/~csxmwu",
  "status": "success",
  "content": "XM's Homepage WU, Xiao-Ming Associate Professor in DSAI@PolyU HK News We are always seeking motivated and dedicated individuals to join our group! Positions including PhD/MPhil, Postdoc, and Research Assistant/Associate are subject to funding availability. We offer competitive salaries, a positive enviroment for learning and doing research, and opportunities to gain research experience and advance your career. Interested applicants may send their resume to me. Preference will be given to applicants with exposure/experience in machine learning and artificial intelligence, good programming skills, and solid mathematical background. September 2025: Our paper \"Can LLMs Outshine Conventional Recommenders? A Comparative Evaluation\" has been accepted to NeurIPS 2025 Datasets and Benchmarks Track. Congrats to LIU Qijiong and FAN Lu! Find the open-source repository here. August 2025: Our two papers \"GeoEdit: Geometric Knowledge Editing for Large Language Models\" and \"AIMMerging: Leveraging Training Trajectories for Adaptive Iterative Model Merging in Language Model Continual Learning\" have been accepted to EMNLP 2025 Main Conference (long paper track). Congrats to FENG Yujie, ZHAN Liming, DONG Xiaoyu, and LU Zexin! August 2025: Our paper \"GEMeX-ThinkVG: Towards Thinking with Visual Grounding in Medical VQA via Reinforcement Learning\" has been accepted to ACMMM 2025 Dataset Track. Congrats to LIU Bo and ZHAO Xiangyu! July 2025: Our paper \"Understanding Layer Significance in LLM Alignment\" has been accepted to COLM 2025. Congrats to SHI Guangyuan, LU Zexin, DONG Xiaoyu, ZHANG Wenlong, FENG Yujie! June 2025: Our paper \"GEMeX: A Large-Scale, Groundable, and Explainable Medical VQA Benchmark for Chest X-ray Diagnosis\" has been accepted to ICCV 2025. Congrats to LIU Bo, ZHAN Li-Ming, LU Zexin, and DONG Xiaoyu! May 2025: Our paper \"Recurrent Knowledge Identification and Fusion for Language Model Continual Learning\" has been accepted to ACL 2025 Main Conference (long paper track). Congrats to FENG Yujie, LU Zexin, and SHI Guangyuan! May 2025: Our paper \"Can Classic GNNs Be Strong Baselines for Graph-level Tasks? Simple Architectures Meet Excellence\" has been accepted to ICML 2025. Congrats to LUO Yuankai! January 2025: Our three papers \"Node Identifiers: Compact, Discrete Representations for Efficient Graph Learning\", \"WeatherGFM: Learning A Weather Generalist Foundation Model via In-context Learning\", \"Beyond Random Masking: When Dropout meets Graph Convolutional Networks\" have been accepted to ICLR 2025. Congrats to LUO Yuankai, ZHAO Xiangyu, ZHANG Wenlong, and LIU Qijiong! January 2025: Our three papers \"MCNet: Monotonic Calibration Networks for Expressive Uncertainty Calibration in Online Advertising\", \"Legommenders: A Comprehensive Content-Based Recommendation Library with LLM Support\", \"Leveraging Large Language Models (LLMs) to Empower Training-Free Dataset Condensation for Content-Based Recommendation\" have been accepted to TheWebConf 2025 (research, resource, and short paper tracks). Congrats to DAI Quanyu, XIAO Jiaren, LIU Qijiong, and FAN Lu! Dec 2024: Our paper \"Decoy Effect in Search Interaction: Understanding User Behavior and Measuring System Vulnerability\" has been accepted to TOIS . Congrats to CHEN Nuo and LUO Yuankai! Sept 2024: Our two papers \"Classic GNNs are Strong Baselines: Reassessing GNNs for Node Classification\" and \"Enhancing Graph Transformers with Hierarchical Distance Structural Encoding\" have been accepted to NeurIPS 2024 . Congrats to LUO Yuankai! Sept 2024: Our two papers \"Zero-shot Cross-domain Dialogue State Tracking via Context-aware Auto-prompting and Instruction-following Contrastive Decoding\" and \"UniFashion: A Unified Vision-Language Model for Multimodal Fashion Retrieval and Generation\" have been accepted to EMNLP 2024 Main Conference (long paper track) ! Congrats to DONG Xiaoyu, FENG Yujie, ZHAO Xiangyu, and other co-authors in our team! Aug 2024: Our paper \"HiFE: Hierarchical Feature Ensemble Framework for Few-shot Hypotheses Adaptation\" has been accepted to TMLR . Congrats to ZHONG Yongfeng! May 2024: Our paper \"Multimodal Pretraining, Adaptation, and Generation for Recommendation: A Survey\" has been accepted to KDD 2024 (tutorial). Congrats to LIU Qijiong! May 2024: Our two papers \"EasyGen: Easing Multimodal Generation with BiDiffuser and LLMs\" and \"TaSL: Continual Dialog State Tracking via Task Skill Localization and Consolidation\" have been accepted to ACL 2024 Main Conference (long paper track). Congrats to FENG Yujie, ZHAO Xiangyu, and other co-authors in our team! March 2024: Our works \"Benchmarking News Recommendation in the Era of Green AI\" and \"Discrete Semantic Tokenization for Deep CTR Prediction\" have been accepted to TheWebConf 2024 (short paper track). Congrats to LIU Qijiong and DAI Quanyu! Feburary 2024: Our two papers \"How Good Are LLMs at Out-of-Distribution Detection?\" and \"VI-OOD: A Unified Representation Learning Framework for Textual Out-of-distribution Detection\" have been accepted to COLING 2024 (long paper track). Congrats to LIU Bo, ZHAN Li-Ming, FAN Lu, LU Zexin, and FENG Yujie! January 2024: Our work \"Learning Category Trees for ID-Based Recommendation: Exploring the Power of Differentiable Vector Quantization\" has been accepted as TheWebConf 2024 (research track). Congrats to LIU Qijiong, FAN Lu and XIAO Jiaren! January 2024: Our work \"SEAL: A Framework for Systematic Evaluation of Real-World Super-Resolution\" has been accepted for spotlight presentation at ICLR 2024. Congrats to ZHANG Wenlong! December 2023: Our paper \"SelfPromer: Self-Prompt Dehazing Transformers with Depth-Consistency\" has been accepted to AAAI 2024 . Congrats to WANG Cong! October 2023: Our work \"ONCE: Boosting Content-based Recommendation with Both Open- and Closed-source Large Language Models\" has been accepted to \"Towards LLM-driven Dialogue State Tracking\" has been accepted to EMNLP 2023 Main Conference (long paper track). Congrats to FENG Yujie, LU Zexin, LIU Bo, and ZHAN Li-Ming! September 2023: Our work \"Real-World Image Super-Resolution as Multi-Task Learning\" has been accepted to NeurIPS 2023. Congrats to ZHANG Wenlong and SHI Guangyuan! About Me I am currently an associate professor at the Department of Data Science and Artificial Intelligence, The Hong Kong Polytechnic University. Previously, I was affiliated with Department of Computing. I obtained my PhD degree from the Department of Electrical Engineering, Columbia University, advised by Prof. Shih-Fu Chang, with my thesis titled as \"Learning on Graphs with Partially Absorbing Random Walks: Theory and Practice\". An industrial application of my thesis research is App Push Recommendation in Huawei App Store. Prior to that, I studied at the Department of Information Engineering, The Chinese University of Hong Kong and obtained an MPhil degree, advised by Prof. Shuo-Yen Robert Li and Prof. Anthony Man-Cho So. Before coming to Hong Kong, I studied in Peking University, where I received my BSc degree from the School of Mathematical Sciences and my MSc degree from the Instituite of Computer Science and Technology, advised by Prof. Zongming Guo. Research At our research group, we are passionate about exploring the frontiers of artificial intelligence (AI). We are dedicated to advancing both the foundational theories and practical applications of AI. Our current research interests include: Generative AI (e.g., large language models); Trustworthy and Explainable AI (e.g., interpretable models, safety, robustness, and transparency in AI systems); Multimodal AI (e.g., vision-language models and cross-modal retrieval); Sustainable/Green AI (e.g., energy-efficient deep learning and model compression). Recent Research Highlights: Graph Machine Learning: Reassessing and Benchmarking: Can Classic GNNs Be Strong Baselines for Graph-level Tasks? Simple Architectures Meet Excellence (ICML '25), Classic GNNs are Strong Baselines: Reassessing GNNs for Node Classification (NeurIPS '24) Efficient Graph Learning: Node Identifiers: Compact, Discrete Representations for Efficient Graph Learning (ICLR '25) Language Modeling and Adaptation: LLM Trustworthiness and Safety: REAL: Reading Out Transformer Activations for Precise Localization in Language Model Steering (Preprint), How Good Are LLMs at Out-of-Distribution Detection? (COLING '24) LLM Knowledge Editing: GeoEdit: Geometric Knowledge Editing for Large Language Models (EMNLP '25) LLM Alignment: Understanding Layer Significance in LLM Alignment (COLM '25) LLM Continual Learning: KIF: Knowledge Identification and Fusion for Language Model Continual Learning (Preprint), Recurrent KIF (ACL '25), AIMMerging (EMNLP '25) LLM-driven Dialogue State Tracking: LDST (EMNLP '23), TaSL (ACL '24), CAPID (EMNLP '24) LLM-powered Recommender Systems: ONCE (WSDM '24), STORE (Preprint), Legommenders (TheWebConf '25), RecBench (NeurIPS '25) Multimodal Learning and Applications: Earth Science: MSEarth: A Benchmark for Multimodal Scientific Comprehension of Earth Science (Preprint), WeatherGFM: Learning A Weather Generalist Foundation Model via In-context Learning (ICLR '25) Unified Vision-Language Model: UniFashion: A Unified Vision-Language Model for Multimodal Fashion Retrieval and Generation (EMNLP '24), EasyGen: Easing Multimodal Generation with BiDiffuser and LLMs (ACL '24) Selected Publications __ indicates my current or former student, RA, or Postdoc, * indicates equal contribution, and # indicates corresponding author (PI). GeoEdit: Geometric Knowledge Editing for Large Language Models Yujie Feng, Li-Ming Zhan, Zexin Lu, Yongxin Xu, Xu Chu, Yasha Wang, Jiannong Cao, Philip S. Yu, Xiao-Ming Wu# Accepted to the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP) (Long Paper), 2025. [PDF] [Code] GEMeX-ThinkVG: Towards Thinking with Visual Grounding in Medical VQA via Reinforcement Learning Bo Liu, Xiangyu Zhao, Along He, Yidi Chen, Huazhu Fu#, Xiao-Ming Wu# Accepted to the 33rd ACM In",
  "content_length": 33834,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:35"
}