{
  "name": "Xiao Jun Chen",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1058/dr-jessica-chen",
  "status": "success",
  "content": "Dr. Jessica Chen | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Jessica Chen Dr. Jessica Chen Associate Professor 519-253-3000 ext. 3713 xjchen@uwindsor.ca Office: L.T. 8100 Education: BSc from Beijing University PhD from Scuola Normale Superiore di Pisa Research Interests: Multimedia (online video streaming) Data analysis and machine learning Formal specification and verification (temporal logics, model checking) Communication protocols Software design and testing Selected Publications: Jessica Chen, Henry Milner, Ion Stoica, Jibin Zhan. Benchmark of Bitrate Adaptation in Video Streaming. ACM Journal of Data and Information Quality, Vol. 13, Issue 4, No. 22, pp 1-24, 2021. Zahaib Akhtar, Anh Minh Le, Yun Seong Nam, Jessica Chen, Ramesh Govindan, Ethan Katz-Bassett, Sanjay G. Rao, Jibin Zhan. Improving Adaptive Video Streaming through Session Classification. ACM Journal of Data and Information Quality, Vol. 11, Issue 4, No. 21, pp 1-29, 2019. Zahaib Akhtar, Yun Seong Nam, Ramesh Govindan, Sanjay G. Rao, Jessica Chen, Ethan Katz-Bassett, Bruno Ribeiro, Jibin Zhan, Hui Zhang. Oboe: auto-tuning video ABR algorithms to network conditions. ACM SIGCOMM 2018, pages 44-58. Xiao Jun Chen, Rocco De Nicola. Algebraic characterizations of trace and decorated trace equivalences over tree-like structures. Theoretical Computer Science 254(1-2): 337-361, Elsevier, 2001. Xiao Jun Chen, Giuseppe De Giacomo. Reasoning about nondeterministic and concurrent actions: a process algebra approach. Artificial Intelligence 107(1): 63-98, Elsevier, 1999. Meet Dr. Chen! share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 4223,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:14"
}