{
  "name": "Xiaofang Zhou 0001",
  "homepage": "https://cse.hkust.edu.hk/admin/people/faculty/profile/zxf",
  "status": "success",
  "content": "Xiaofang ZHOU | HKUST CSE More about HKUST University News Academic Departments A-Z Life@HKUST Library Map & Directions Careers at HKUST Faculty Profiles About HKUST Intranet School of Engineering Quick Links for Undergraduates Postgraduates Faculty & Staff Alumni Job Seekers Employers & Industry Partners About Welcome Mission & Vision About CSE Fast Facts News & Events Job Openings Contact Us People Faculty Staff Postgraduates Alumni Research Research Themes Research Labs & Centers Research Projects Computing Facilities Academics Undergraduate Postgraduate Enrichment Quality Assurance Admissions Undergraduate Postgraduate PG Early Recruiting Graduate Placements School of Engineering Xiaofang ZHOU Xiaofang ZHOU 周曉方 PhD in Computer Science, The University of Queensland Otto Poon Professor of Engineering and Chair Professor Head of Department Tel: (852) 2358 7009 Email: Office: Room 3531 Links: Personal Webpage Faculty Profile Scholar Profile Google Scholar Telephone (852) 2358 7009 Email Office Room 3531 Personal Webpage https://sites.google.com/view/xiaofang-zhou Research Area Loading ... Data, Knowledge and Information Management Research Interests Spatiotemporal and multimedia databases; Data mining; Data quality management; Big data analytics; Machine learning Biography Prof. Xiaofang Zhou is Otto Poon Professor of Engineering and Chair Professor of Computer Science and Engineering (CSE) at The Hong Kong University of Science and Technology (HKUST). He received his BSc and MSc degrees in Computer Science from Nanjing University in 1984 and 1987 respectively, and PhD in Computer Science from University of Queensland (UQ) in 1994. From 1994 to 1999, he worked as a Senior Research Scientist in Commonwealth Scientific and Industrial Research Organisation (CSIRO) in Australia, leading its Spatial Information Systems group. He joined University of Queensland in 1999 and became a Professor of Computer Science in 2004. From 2006 to 2020, he was Head of UQ Data and Knowledge Engineering (DKE) research group and Data Science discipline. His research focus is to find effective and efficient solutions for managing, integrating, and analysing large-scale complex data for business, scientific and personal applications. He has been working in the area of spatiotemporal and multimedia databases, data mining, data quality management, big data analytics, and machine learning. He received the Best Paper Awards at WISE 2012&2013, ICDE 2015&2019, DASFAA 2016 and ADC 2019. He was a Program Committee Chair of IEEE International Conference on Data Engineering (ICDE 2013), ACM International Conference on Information and Knowledge Management (CIKM 2016), and International Conference on Very Large Databases (PVLDB 2020). He was a General Chair of ACM Multimedia Conference (MM 2015). He was the Chair of IEEE Technical Committee on Data Engineering from 2015-2018. Professor Zhou is a Fellow of IEEE. Navigation Navigation About Welcome Mission & Vision About CSE Fast Facts News & Events Job Openings Contact Us People Faculty Staff Postgraduates Alumni Research Research Themes Research Labs & Centers Research Projects Computing Facilities Academics Undergraduate Postgraduate Enrichment Quality Assurance Admissions Undergraduate Postgraduate PG Early Recruiting Graduate Placements Last updated on 2021-02-24 Privacy Sitemap Copyright © The Hong Kong University of Science and Technology. All rights reserved. Follow us on Facebook LinkedIn Instagram YouTube Contact Us Privacy Sitemap Follow us on Facebook LinkedIn Instagram YouTube Contact Us Copyright © The Hong Kong University of Science and Technology. All rights reserved.",
  "content_length": 3661,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:24"
}