{
  "name": "Xiaowei He",
  "homepage": "http://peridynamics.com/index.html",
  "status": "success",
  "content": "Xiaowei He Xiaowei He | 何小伟 Research Interests: Computer Graphics Computational Physics Fluid Simulation Particle Methods Peridynamics Nonlocal Methods ❮ ❯ Updates [2025-08-11] \"A Stack-Free Parallel h-Adaptation Algorithm for Dynamically Balanced Trees on GPUs\" was conditionally accepted as a Journal Paper to SIGGRAPH Asia 2025. [2025-08-11] \"A Parallel Multiscale FIM Approach in Solving the Eikonal Equation on GPU\" was accepted to Computer-Aided Design(CAD). [2025-08-11] \"An Adaptive Particle Fission-Fusion Approach for Dual-Particle SPH Fluid\" was conditionally accepted as a Conference Paper to Pacific Graphics 2025. [2025-07-01] \"基于GPU的并行自适应笛卡尔网格建模方法与仿真应用研究综述\" was accepted by 《计算机辅助设计与图形学学报》. [2024-12-20] \"A Semi-Implicit SPH Method for Compressible and Incompressible with Improved Convergence\" was conditionally accepted by Eurographics 2025. [2024-10-05] \"机理与数据驱动的物理仿真计算范式及引擎架构\" was accepted by 《图学学报》. [2024-07-30] \"Efficient GPU Cloth Simulation with Non-distance Barriers and Subspace Reuse\" has been provisionally accepted by SIGGRAPH Asia 2024. [2023-10-27] The open source project \"泛动引擎（PeriDyno）\" was awarded as 2023 \"挑战者杯\" 元宇宙开发者大赛总决赛二等奖. [2023-01-15] \"A Dual-Particle Approach for Incompressible SPH Fluids\" has been provisionally accepted by ACM TOG. [2022-12-19] \"Projective Peridynamic Modeling of Hyperelastic Membranes with Contact\" has been accepted by CVM 2022 and recommended to IEEE TVCG. [2022-12-19] \"Algebraic Adaptive Signed Distance Field on GPU\" has been accepted by CVM 2022. [2022-08-01] \"光滑粒子流体动力学（SPH）流体仿真技术综述\" has been accepted by 《软件学报》. [2022-01-25] \"Semi-Analytical Surface Tension Model for Free Surface Flows\" has been accepted by IEEE VR 2022 as a poster. [2021-06-12] \"Towards a non-invasive diagnosis of portal hypertension based on an Eulerian CFD model with diffuse boundary conditions\" is accepted by MICCAI 2021. [2021-01-25] \"Adapted SIMPLE Algorithm for Incompressible SPH Fluids with a Broad Range Viscosity\" is accepted by IEEE TVCG. [2020-08-17] \"Semi-analytical Solid Boundary Conditions for Free Surface Flows\" is accepted by Pacific Graphics 2020. [2019-09-24] \"Shallow Sand Equations: Real-Time Height Field Simulation of Dry Granular Flows\" is accepted by IEEE TVCG. Research Interests: Computer Graphics Computational Physics Fluid Simulation Particle Methods Peridynamics Nonlocal Methods",
  "content_length": 2358,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:40"
}