{
  "name": "Xiaohui Liu 0001",
  "homepage": "https://www.brunel.ac.uk/people/xiaohui-liu",
  "status": "success",
  "content": "Professor Xiaohui Liu | Introduction | Brunel University London Skip to Content Home People Professor Xiaohui Liu Professor Xiaohui LiuProfessor - Computing Wilfred Brown Building 218 Email: xiaohui.liu@brunel.ac.uk Tel: +44 (0)1895 265989 Computer Science College of Engineering, Design and Physical Sciences Summary Xiaohui Liu has held several senior visiting positions, including Honorary Pascal Professor at Leiden University (2004), Visiting Scientist at Harvard Medical School (2005), and Visiting Professor at the Chinese Academy of Sciences (2010).  A long-standing advocate of Intelligent Data Analysis (IDA), he has conducted research in artificial intelligence, data science, and optimisation, as well as their integration to enable effective data interpretation and trustworthy decision-making. His work has delivered real-world impact across diverse domains. Professor Liu has been named a Clarivate Highly Cited Researcher for 11 consecutive years (2014–2024), spanning the fields of Computer Science, Engineering, and Cross-Field research. He has been listed among the world’s top 2% of scientists by Stanford University (2020–2025), and recognised by ScholarGPS as a Highly Ranked Scholar – Lifetime: Neural Network (2022–2025). His recent honours include the Daniel Berg Award (2023), the Research.com United Kingdom Leader Award in Computer Science (2023–2025), and the IDA Founders Award (2025). Newest selected publications Wang, C., Wang, Z., Dong, H., Lauria, S., Liu, W., Wang, Y., Fadzil, F. and Liu, X. et al. (2025) 'Fusionformer: A Novel Adversarial Transformer Utilizing Fusion Attention for Multivariate Anomaly Detection'. IEEE Transactions on Neural Networks and Learning Systems, 36 (8). pp. 14479 - 14492. ISSN: 2162-237X Open Access Link Journal article Xue, Y., Yang, R., Chen, X., Liu, W., Wang, Z. and Liu, X. (2024) 'A Review on Transferability Estimation in Deep Transfer Learning'. IEEE Transactions on Artificial Intelligence, 5 (12). pp. 5894 - 5914.Open Access Link Journal article Islam, T., Miron, A., Nandy, M., Choudrie, J., Liu, X. and Li, Y. (2024) 'Transforming Digital Marketing with Generative AI'. Computers, 13 (7). pp. 1 - 24.Open Access Link Journal article Wen, C., Xue, Y., Liu, W., Chen, G. and Liu, X. (2024) 'Bearing fault diagnosis via fusing small samples and training multi-state Siamese neural networks'. Neurocomputing, 576. pp. 1 - 1. ISSN: 0925-2312 Journal article Shen, Y., Wang, Z., Dong, H., Liu, H. and Liu, X. (2024) 'Joint State and Unknown Input Estimation for a Class of Artificial Neural Networks With Sensor Resolution: An Encoding–Decoding Mechanism'. IEEE Transactions on Neural Networks and Learning Systems, 0 (early access). pp. 1 - 11. ISSN: 2162-237X Journal article More publications(245)",
  "content_length": 2776,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:28"
}