{
  "name": "Xiaojuan Ma",
  "homepage": "https://www.cse.ust.hk/~mxj",
  "status": "success",
  "content": "Xiaojuan Ma Office: Rm3507 (Lift25-26) mxj(at)cse(dot)ust(dot)hk Tel: (852) 2358 6991 Fax: (852) 2358 1477 CV:    English (2024)   中文 (2015) Ph.D. thesis:    English RECENT NEWS scroll for more Oct 2025: \"Rethinking Technological Solutions for Community-Based Older Adult Care: Insights from 'Older Partners' in China\" received the Honorable Mention Award @ CSCW2025! Congrat to Prof. Sun's team (ECNU) Sep 2025: Rethinking Personality Assessment from Human-Agent Dialogues @ EMNLP 2025 Findings Congrat to Baiqiao and Prof. Bian's team (SDU) Aug 2025: Exploring the Evolvement of User Engagement in Online Creative Community under the Surge of Generative AI: A Case Study of DeviantArt @ CSCW 2025 Congrat to Qingyu, Kangyu, and the team Aug 2025: Rethinking Technological Solutions for Community-Based Older Adult Care: Insights from 'Older Partners' in China @ CSCW 2025 Congrat to Prof. Sun's team (ECNU) Aug 2025: When Traditional Medicine Meets AI: Critical Considerations for AI-Empowered Clinical Support in Traditional Medicine @ CSCW 2025 Congrat to Prof. Sun's team (ECNU) Jul 2025: PaperBridge: Crafting Research Narratives through Human-AI Co-Exploration @ UIST 2025 Congrat to Runhua and Prof. Qu (VisLab team) Jul 2025: OceanVive: An ImmersiveVisualization System for CommunicatingComplex Oceanic Phenomena @ IEEE VIS 2025 Short Congrat to Yang, Yuchen, Prof. Li (ShanghaiTech), and CORE Jun 2025: From Platform Migration to Cultural Integration: the Ingress and Diffusion @ CSCW 2025 Poster Congrat to Ziqi, Runhua, Jiehui, Yuanhao, and Yue May 2025: A design space of animating data-driven transitions in data videos @ Journal of Visualization Congrat to Chengbo and Prof. Cao's team (Tongji) Mar 2025: \"Signaling Human Intentions to Service Robots: Understanding the Use of Social Cues during In-Person Conversations\" received the Honorable Mention Award @ CHI2025! Congrat to Hanfang, Xiaoyu, Nandi, Shuai, Qian, Prof. Luo (CityU), and Prof. Tsung (HKUST-GZ) Mar 2025: '\"Let's Resolve Conflicts\": A Human-AI Deliberation Framework for AI-Assisted Decision-Making' received the Honorable Mention Award @ CHI2025! Congrat to Shuai, Qiaoyi, Xinru, Chengbo, Prof. Peng (SYSU), and Prof. Yin (Purdue) Mar 2025: '\"AI Afterlives\" as Digital Legacy: Perceptions, Expectations, and Concerns' received the Honorable Mention Award @ CHI2025! Congrat to Ying, Shuai, and Prof. Sun (ECNU) Mar 2025: InsightBridge: Enhancing Empathizing with Users through Real-Time Information Synthesis and Visual Communication @ CHI2025 Congrat to Junze, Yue, Chengbo, Dingdong, and Zeyu Mar 2025: Scaffolded Turns and Logical Conversations: Designing Humanized LLM-Powered Conversational Agents for Hospital Admission Interviews @ CHI2025 Congrat to Dingdong, Yujing, Bolin, Shuai, and Prof. Shi (SoutheasternU) Mar 2025: Signaling Human Intentions to Service Robots: Understanding the Use of Social Cues during In-Person Conversations @ CHI2025 Congrat to Hanfang, Xiaoyu, Nandi, Shuai, Qian, Prof. Luo (CityU), and Prof. Tsung (HKUST-GZ) Mar 2025: ACKnowledge: A Computational Framework for Human Compatible Affordance-based Interaction Planning in Real-world Contexts @ CHI2025 Congrat to Ziqi, Xiucheng, Zisu, Prof. Peng (SYSU), and Prof. Fan (HKUST-GZ) Mar 2025: CoKnowledge: Supporting Assimilation of Time-synced Collective Knowledge in Online Science Videos @ CHI2025 Congrat to Yuanhao, Yumeng, Xiyuan, and collaborators Mar 2025: \"Let's Resolve Conflicts\": A Human-AI Deliberation Framework for AI-Assisted Decision-Making @ CHI2025 Congrat to Shuai, Qiaoyi, Xinru, Chengbo, Prof. Peng (SYSU), and Prof. Yin (Purdue) Mar 2025: DBox: Assisting Algorithmic Programming Learning with Interactive and Adaptive Decomposition Box @ CHI2025 Congrat to Shuai and Prof. Wang's team (ETH) Mar 2025: Understanding Screenwriters' Practices, Attitudes, and Future Expectations in Human-AI Co-Creation @ CHI2025 Congrat to Yuying, Dr. Li (MSRA), and Prof. Qu's team Mar 2025: \"AI Afterlives\" as Digital Legacy: Perceptions, Expectations, and Concerns @ CHI2025 Congrat to Ying, Shuai, and Prof. Sun (ECNU) Mar 2025: JournalAIde: Empowering Older Adults in Digital Journal Writing @ CHI2025 Congrat to Shixu and Prof. Fan's team (HKUST-GZ) Mar 2025: InteRecon: Towards Reconstructing Interactivity of Personal Memorable Items in Mixed Reality @ CHI2025 Congrat to Prof. Fan's team (HKUST-GZ) Mar 2025: QCM: A Curvature Manipulation Method to Suppress Discomfort in Redirected Walking @ CHI2025 Congrat to Prof. Yang's and Prof Bian's team (ShandongU) Mar 2025: Characterizing LLM-Empowered Personalized Story Reading and Interaction for Children: Insights From Multi-Stakeholders' Perspective @ CHI2025 Congrat to Prof. Sun's team (ECNU) Mar 2025: Live-Streaming-Based Dual-Teacher Classes for Equitable Education: Insights and Challenges From Local Teachers' Perspective in Disadvantaged Areas @ CHI2025 Congrat to Prof. Sun's team (ECNU) Feb 2025: \"I Love The Internet Again\": Interaction Inception of \"TikTok Refugees\" in RedNote @ CHI2025 LBW Congrat to Kangyu and the HKUST team Feb 2025: Ecological Thinking in HCI @ [Book] Digital Futures in Human-Computer Interaction Congrat! Jan 2025: AmplitudeArrow: On-the-Go AR Menu Selection Using Consecutive Simple Head Gestures and Amplitude Visualization @ TVCG Congrat to Prof. Tian's team (GXU) Jan 2025: MetapathVis: Inspecting the Effect of Metapath in Heterogeneous Network Embedding via Visual Analytics @ Computer Graphics Forum Congrat to Prof. Li's team (ShanghaiTech) News in 2024 Oct 2024: Deciphering Explicit and Implicit Features for Reliable, Interpretable, and Actionable User Churn Prediction in Online Video Games @ TVCG Congrat to Prof. Li's team (ShanghaiTech) Aug 2024: \"A Dialogue System Architecture for Humanoid Robots Targeting Patinet Interview Tasks\" won the 3rd place for the Best Industry Application Award (Bronze Price) @ RO-MAN2024 Congrat to Yifan, Dingdong, Yejin, Prof. Shi and the Grace project team Aug 2024: DiscipLink: Unfolding Interdisciplinary Information Seeking Process via Human-AI Co-Exploration @ ACM UIST 2024 Congrat to Chengbo, Yuanhao, Zeyu, Chuhan, and Minrui Aug 2024: SelfGauge: An Intelligent Tool to Support Student Self-assessment in GenAI-enhanced Project-based Learning @ ACM UIST 2024 Poster Congrat to Chengbo, Shuai, and Zeyu Aug 2024: AR Scenic Live-Streaming for an Interactive and Collective Experience @ ISMAR 2024 Poster Congrat to Zeyu, Zuyu, Yuanhao, Chengzhong, Chuhan, and Dr. Zhao's team July 2024: CompositingVis: Exploring Interaction for Creating Composite Visualizations in Immersive Environments @ IEEE Vis 2024 Congrat to Qian, Prof. Yang (GeogiaTech) and the team June 2024: A Design Space of Animating Data-Driven Transitions in Data Videos @ ChinaVis 2024 Congrat to Chengbo, Prof. Cao and the Tongji team May 2024: Exploring Parent's Needs for Children-Centered AI to Support Preschoolers' Storytelling and Reading Activities @ CSCW 2024 Congrat to Prof. Sun (ECNU), Prof. Wang (Northeastern) and the team May 2024: A Dialogue System Architecture for Humanoid Robots Targeting Patinet Interview Tasks @ RO-MAN2024 Congrat to Yifan, Dingdong, Yejin, Prof. Shi and the Grace project team May 2024: Towards Feature Engineering with Human and AIs Knowledge: Understanding Data Workers Perceptions in Human&AI-Assisted Feature Engineering Design @ DIS2024 Congrat to Qian, Prof. Wang and the team May 2024: Exploring Scaffolding Techniques for Agent-Administered Brief Cognitive Screening in Hospital Settings @ DIS2024 WiP Congrat to Dingdong and the Grace project team Apr 2024: \"Technology-Mediated Non-pharmacological Interventions for Dementia\" received the Best Paper Award @ CHI2024! Congrat to Prof. Sun (ECNU) and Prof. Tong (Duke Kunshan) Apr 2024: \"Design Makeup Residue Visualization System for Chinese Traditional Opera (Xiqu) Performers\" received the Honorable Mention Award @ CHI2024! Congrat to Zeyu Xiong and Prof. Fan's team (HKUST-GZ) Mar 2024: Charting the Future of AI in Project-Based Learning @ CHI2024 Congrat to Chengbo, Kangyu, Bingcan, Reza, Shuai, and Prof. Peng Mar 2024: Designing Scaffolding Strategies for Conversational Agents in Dialog Task of Neurocognitive Disorders Screening @ CHI2024 Congrat to Jiaxiong, Junze and the HKUST-CUHK team Mar 2024: DiaryHelper: Exploring the Use of an Automatic Contextual Information Recording Agent for Elicitation Diary Study @ CHI2024 Congrat to Junze, Jiaxiong and our collaborators Mar 2024: \"Are You Really Sure?'' Understanding the Effects of Human Self-Confidence Calibration in AI-Assisted Decision Making @ CHI2024 Congrat to Shuai, Prof. Shi, Prof. Yin and our collaborators Mar 2024: Sharing Frissons among Online Video Viewers: Exploring the design of Affective Communication for Aesthetic Chills @ CHI2024 Congrat to Zeyu, Yuanhao and the team Mar 2024: Make Interaction Situated: Designing User Acceptable Interaction for Situated Visualization in Public Environments @ CHI2024 Congrat to Qian and Prof. Zeng's team (HKUST-GZ) Mar 2024: TypeDance: Creating Semantic Typographic Logos from Image through Personalized Generation @ CHI2024 Congrat to Shishi and Prof. Zeng's team (HKUST-GZ) Mar 2024: Design Makeup Residue Visualization System for Chinese Traditional Opera (Xiqu) Performers @ CHI2024 Congrat to Zeyu Xiong and Prof. Fan's team (HKUST-GZ) Mar 2024: Technology-Mediated Non-pharmacological Interventions for Dementia @ CHI2024 Congrat to Prof. Sun's team (ECNU) Mar 2024: Exploring the Evolvement of Artwork Descriptions in Online Creative Community under the Surge of Generative AI @ CHI2024 LBW Congrat to Qingyu and the team Jan 2024: Problem-solving Analysis Test System, Test Method and Test Software @ Chinese Patent Granted Congrat to Meng and Prof. Qu News in 2023 Dec 2023: FARPLS: A Feature-Augmented Robot Trajectory Preference Labeling System to Assist Human Labelers Preference Elicitation @ IUI 2024 Congrat to Hanfang, Chuhan, Mingfei and the HKPC team Nov 2023: Desi",
  "content_length": 30403,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:30"
}