{
  "name": "Xiaoliang Wang 0001",
  "homepage": "http://cs.nju.edu.cn/wangxiaoliang",
  "status": "success",
  "content": "Xiaoliang Wang Xiaoliang Wang Professor (PhD Supervisor) at Nanjing University. Cloud computing, Networking systems, Distributed computation/storage systems. E-mail: waxili (at) nju.edu.cn Address: CS Building 517, No.163 XianLin Avenue, Jiang Su, Nanjing, 210023, China .: Short CV 2014, Microsoft Research Visiting Scholar 2019~, Consultant, Cloud Network, Tencent TEG/Alibaba Cloud .: Recruitment 目前正在招募博士研究生和硕士研究生。如果你对云/边缘计算，分布式机器学习，分布式存储，网络系统方向感兴趣，欢迎直接通过邮箱 waxili (at) nju (dot) edu (dot) cn 联系 We are searching for passionate students to join our team. Please feel free to contact me (waxili at nju.edu.cn). .: Teaching Data Communication (221580) for Undergraduate Students Ubiquitous Computing for Graduate Students .: Research 分布式机器学习、分布式存储、云与边缘计算网络、系统软件 Building high-performance distributed systems specifically to enhance elasticity and reliability for cloud, AI, and storage workloads News ** One paper is accepted by NeruIPS 2025 ** Two papers are accepted by ATC 2025 ** Cong！EuroSys 2025 paper won the Best Student Paper Award, Cong to Zhaochen, Feiyang ** Two papers are accepted by EuroSys 2025 ** Two papers are accepted by NSDI 2025 ** One paper is accepted by ASPLOS 2025 ** 2023 江苏省科学技术奖 二等奖 ** One paper is accepted by CoNEXT 2024 ** One paper is accepted by OOPSLA 2024 ** One paper is accepted by ACM MM 2024 ** Serve as Keynote Speaker at 2024 SIGCOMM FMANO Workshop ** Serve on NSDI 2025 TPC ** One paper is accepted by SIGCOMM 2024, Cong to Zhenghao ** One paper is accepted by ATC 2024, Cong to Tingting ** One paper is accepted by Eurosys 2024 ** Cong！BIGCOM 2023 paper won the Best Paper Award ** Two papers are accepted by ICNP 2023 ** One paper is accepted by OSDI 2023 ** One paper is accepted by Eurosys 2023 ** One paper is accepted by FAST 2023 ** Two papers are accepted by INFOCOM 2023 ** One paper is accepted by ICNP 2022 ** Cong！HPC-AI亚太区RDMA竞赛一等奖 2021 ** One paper is accepted by SIGCOMM 2021 ** One paper is accepted by NSDI 2021 ** One paper is accepted by INFOCOM 2021 Yi Zhao, Yajuan Peng, Cam-Tu Nguyen, Zuchao Li, Xiaoliang Wang, Hai Zhao, Xiaoming Fu，SmallKV: Small Model Assisted Compensation of KV Cache Compression for Efficient LLM Inference, NeurIPS 2025 (Spotlight) Yuhang Zhou, Zibo Wang, Zhibin Wang, Ruyi Zhang, Chen Tian, Xiaoliang Wang, Wanchun Dou, Guihai Chen, Binqiang Wang, Yonghong Tian, Yan Zhang, Hui Wang, Fuchun Wei, Boquan Sun, Jingyi Zhang, Bin She, Teng Su, Yifan Yao, Chunsheng Li, Ziyang Zhang, Yaoyuan Wang, Bin Zhou, Guyue Liu. Accelerating Model Training on Ascend Chips: An Industrial System for Profiling, Analysis and Optimization, USENIX ATC, 2025. Yajuan Peng, Haoran Wei, Xiaolong Zhong, Junkai Huang, Haohan Xu, Zicheng Wang, Yang Bai, Zhuo Jiang, and Jianxi Ye, Xiaoliang Wang, Xiaoming Fu, Huichen Dai, Barre: Empowering Simplified and Versatile Programmable Congestion Control in High-Speed AI Clusters, USENIX ATC, 2025. Zhaochen Zhang, Feiyang Xue, Keqiang He, Zhimeng Yin, Gianni Antichi, Jiaqi Gao, Yizhi Wang, Rui Ning, Haixin Nan, Xu Zhang, Peirui Cao, Xiaoliang Wang, Wanchun Dou, Guihai Chen, Chen Tian.Enabling Virtual Priority in Data Center Congestion Control. EuroSys 2025, (Best Student Paper) Yanqing Chen, Li Wang, Jingzhi Wang, Songyue Liu, Keqiang He, Jian Wang, Xiaoliang Wang, Wanchun Dou, Guihai Chen, Chen Tian. Marlin: Enabling High-Throughput Congestion Control Testing in Large-Scale Networks. EuroSys 2025. Zibo Wang, Yijia Zhang, Fuchun Wei, Bingqiang Wang, Yanlin Liu, Zhiheng Hu, Jingyi Zhang, Xiaoxin Xu, Jian He, Xiaoliang Wang, Wanchun Dou, Guihai Chen, and Chen Tian. Using Analytical Performance/Power Model and Fine-Grained DVFS to Enhance AI Accelerator Energy Efficiency. ASPLOS 2025. H. Zheng, X. Yan, W. Li, J. Zheng, X. Wang, Q. Zhao, L. He, X. Lai, F. Gao, F. Huang, W. Dou, G. Chen, C. Tian, When P4 Meets Run-to-completion Architecture, USENIX NSDI 2025 K. Liu, Z. Zhang, C. Liu, Y. Wang, V. Addanki, S. Schmid, Q. Wang, W. Chen, X. Wang, J. Zheng, W. Sun, T. Wu, K. Meng, F. Chen, W. Wang, B. Liu, W. Dou, G. Chen, C. Tian, Pyrrha: Congestion-Root-Based Flow Control to Eliminate Head-of-Line Blocking in Datacenter, USENIX NSDI 2025 Shichen Dong, Zhixiong Niu, Mingchao Zhang, Zhiying Xu, Chuntao Hu, Pengzhi Zhu, Qingchun Song, Lei Qu, Peng Cheng, Cam-Tu Nguyen, Shaoling Sun, Xiaohu Xu, Yongqiang Xiong, Wei Wang, Xiaoliang Wang, MINA: Fine-grained In-network Aggregation Resource Scheduling for Machine Learning Service, INFOCOM, 2025 Yiyu Zhang, Tianyi Liu, Yueyang Wang, Yun Qi, Kai Ji, Jian Tang, Xiaoliang Wang, Xuandong Li, and Zhiqiang Zuo, HardTaint: Production-Run Dynamic Taint Analysis via Selective Hardware Tracing, OOPSLA2 2024 Xiaoliang Wang, Penghui Mi, Yong Zhu, Baoyi An, Yinhua Wang, Lixiang Wang, Xuezhi Yu, Qiong Xie, Xiang Huang, Mingliang Yin, Chaoyang Ji, Wei Sun, Yihang Lv, Yuhang Chen, Cam-Tu Nguyen, Chen Tian, and Xiaoming Fu. 2024. EdgeCross: Cloud Scale Traffic Management at Peering Edges. ACM CoNEXT, December 2024 Huang, Chengyuan; Xue, Feiyang; Yu, Peiwen; Wang, Xiaoliang; Chen, Yanqing; Wu, Tao; Han, Lei; Han, Zifa; Wang, Bingquan; Gong, Xiangyu; Tian, Chen; Dou, Wanchun; Chen, Guihai; Yin, Hao, Minimizing Buffer Utilization for Lossless Inter-DC Links, IEEE/ACM Transactions on Networking, November 2024 Chengyuan Huang, Tianfan Zhang, Li Wang, Yibo Xiao, Chao Yang, Chen Tian, Xiaoliang Wang, Dong Zhang, Bingheng Yan, Ahmed M. Abdelmoniem, Wanchun Dou, Guihai Chen, MpScope: Enabling multi-pipeline monitoring inside a switch, Computer Networks, 2024 B. Li, X. Wang, J. Wang, Y. Liu, Y. Gong, H. Lu, W. Dang, W. Zhang, X. Huang, M. Chen, J. Chen, C. He, Y. Liu, X. Hu, C. Liu, X. Ji, Y. Xia, X. Li, Z. He, Y. Wang, X. Zou, TCCL: Co-optimizing Collective Communication and Traffic Routing for GPU-centric Clusters, ACM SIGCOMM Workshop on Networks for AI Computing (NAIC), 2024 Tingting Xu, Bengbeng Xue, Yang Song, Xiaomin Wu, Xiaoxin Peng, Yilong Lyu, Xiaoliang Wang, Chen Tian, Baoliu Ye, Camtu Nguyen, Biao Lyu, Rong Wen, Zhigang Zong, and Shunmin Zhu, CyberStar: Simple, Elastic and Cost-Effective Network Functions Management in Cloud Network at Scale, ATC 2024 Hao Zheng, Chengyuan Huang, Xiangyu Han, Xiaoliang Wang, Jiaqi Zheng, Chen Tian, Wanchun Dou, Guihai Che, μMon: Empowering Microsecond-level Network Monitoring with Wavelets, SIGCOMM 2024 Songyuan Bai, Hao Zheng, Chen Tian, Xiaoliang Wang, Chang Liu, Xin Jin, Fu Xiao, Qiao Xiang, Wanchun Dou, Guihai Chen, Unison: A Parallel-Efficient and User-Transparent Network Simulation Kernel, Eurosys, 2024 Mingtao Ji, Mingxian Zhou, Haodong Zou, Ming Tang, Zhuzhong Qian, Xiaoliang Wang, SAC: Dynamic Caching upon Sketch for In-Memory Big Data Analytics, BigCom, 2023 (Best Paper Award) P. Yu, F. Xue, C. Tian, Xiaoliang Wang, Y. Chen, T. Wu, L. Han, Z. Han, B. Wang, X. Gong, W. Dou, G. Chen, Bifrost: Extending RoCE for Long Distance Inter-DC Links, ICNP, 2023 Qiang Li, Yixiao Gao, Xiaoliang Wang, et al. Flor: An Open High Performance RDMA Framework Over Heterogeneous RNICs, OSDI, 2023 Zhiying Xu, Jiafan Xu, Hongding Peng, Wei Wang, Xiaoliang Wang, Haipeng Dai, Yixu Xu, Hao Cheng, Kun Wang, Guihai Chen, ALT: Breaking the Wall between Data Layout and Loop Optimizations for Deep Learning Compilation, Eurosys 2023 Qiang Li, Lulu Chen, Xiaoliang Wang, et.al, Fisc: A Large-scale Cloud-native-oriented File System, FAST, 2023 Jian Tang, Huichen Dai, Xiaoliang Wang, Scalable RDMA Transport with Efficient Connection Sharing, INFOCOM, 2023 Tingting Xu, Xiaoliang Wang, Chen Tian, Xiong Yun, Yun Lin, Baoliu Ye, CLIP: Accelerating Features Deployment for Programmable Switch, INFOCOM, 2023 Lin Qian, Bin Tang, Baoliu Ye, Jianyu Wu, Xiaoliang Wang, et.al, Stabilizing and boosting I/O performance for file systems with journaling on NVMe SSD, SCIENCE CHINA Information Sciences, Vol. 65 132102:1–132102:15, March 2022 Siyu Yan, Xiaoliang Wang (corresponding author), Xiaolong Zheng, Yinben Xia, Derui Liu, ACC: Automatic ECN Tuning for High-speed Datacenter Networks, ACM SIGCOMM 2021. Hua Shao, Xiaoliang Wang (co-first author), Yuanwei Lu, Yanbo Yu, and Shengli Zheng, Youjian Zhao, Accessing Cloud with Disaggregated Software-Defined Router, USENIX NSDI 2021. Xiaoliang Wang, Hexiang Song, Camtu Nguyen, Dongxu Cheng, Tiancheng Jin, Maximizing the Benefit of RDMA at End Hosts, IEEE INFOCOM 2021. Mingkai Lin, Wenzhong Li, Lynda J. Song, Cam-tu Nguyen, Xiaoliang Wang, Sanglu Lu, SAKE: Estimating Katz Centrality Based on Sampling for Large-Scale Social Networks, ACM Transactions on Knowledge Discovery from Data (TKDD), vol 15, issue 4, August 2021 B. Tang, Xiaoliang Wang, C. Nguyen, B. Ye, et.al, \"Construction of Subexponential-Size Optical Priority Queues With Switches and Fiber Delay Lines,\" in IEEE/ACM Transactions on Networking (TON), vol. 28, no. 1, pp. 336-346, Feb. 2020. Yibo Jin, Lei Jiao, Zhuzhong Qian, Sheng Zhang, Sanglu Lu, Xiaoliang Wang, Minimizing Resource Usage Considering Performance and Iterations in Federated Learning, IEEE International Conference on Distributed Computing Systems (ICDCS 2020) W. Li, H. Zhang, S. Gao, C. Xue, Xiaoliang Wang, et.al, \"SmartCC: A Reinforcement Learning Approach for Multipath TCP Congestion Control in Heterogeneous Networks\", in IEEE Journal on Selected Areas in Communications (JSAC), vol. 37, no. 11, pp. 2621-2633, Nov. 2019. Han Zhang, Wenzhong Li, S.H. Gao, Xiaoliang Wang, Baoliu Ye. ReLeS: A Neural Adaptive Multipath Scheduler based on Deep Reinforcement Learning, IEEE INFOCOM 2019. X. Zhang, Z. Qian, S. Zhang, X. Li, X. Wang, et.al, \"Semi-Clairvoyant Scheduling in Data Analytics Systems,\" IEEE Transactions on Computers, vol. 68, no. 9, pp. 1376-1389, 1 Sept. 2019. Xiaoliang Wang, Mingzhi Chen, et.al, Modeling Geographically Correlated Failures to Assess Network Vulnerability, IEEE Transactions on Communications (TCOM), 2018. Haonan Qiu, Xiaoliang Wang, et al. Toward Effective and Fair RDMA Resource Sharing. 2nd Asia-Pacific Workshop on Networking (APNet, 2018). (Best Paper Aw",
  "content_length": 14250,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:33"
}