{
  "name": "Xiaoxing Ma",
  "homepage": "http://ics.nju.edu.cn/people/xiaoxingma",
  "status": "success",
  "content": "Xiaoxing Ma | Institute of Computer Software 首页 组织 活动 课程 招生 资源 Home People Xiaoxing Ma English 中文 Dr. Xiaoxing Ma Professor State Key Laboratory for Novel Software Technology, Nanjing University Department of Computer Science and Technology, Nanjing University Address: Department of Computer Science, Nanjing University Xianlin Campus (Mailbox 603), 163 Xianlin Avenue, Qixia, Nanjing 210023, Jiangsu, China Office: Computer Science and Technology Building 816 Phone: +86 25 89686068 Fax: +86 25 83593283 Email: Research I am interested in various topics in software engineering, especially LLM-based Formal Reasoning for Math&SE Zenan Li, Zhaoyu Li, Wen Tang, Xian Zhang, Yuan Yao, Xujie Si, Fan Yang, Kaiyu Yang, and Xiaoxing Ma, “Proving Olympiad Inequalities by Synergizing LLMs and Symbolic Reasoning”, in The Thirteenth International Conference on Learning Representations, ICLR 2025, Singapore, April 24-28, 2025 , 2025. Weining Cao, Guangyuan Wu, Tangzhi Xu, Yuan Yao, Hengfeng Wei, Taolue Chen, and Xiaoxing Ma, “Clause2Inv: A Generate-Combine-Check Framework for Loop Invariant Inference”, Proc. ACM Softw. Eng. , 2(ISSTA), 1009–1030, 2025. Guangyuan Wu, Weining Cao, Yuan Yao, Hengfeng Wei, Taolue Chen, and Xiaoxing Ma, “LLM Meets Bounded Model Checking: Neuro-symbolic Loop Invariant Inference”, in Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, ASE 2024, Sacramento, CA, USA, October 27 - November 1, 2024 , 406–417, 2024. Zenan Li, Yifan Wu, Zhaoyu Li, Xinming Wei, Xian Zhang, Fan Yang, and Xiaoxing Ma, “Autoformalize Mathematical Statements by Symbolic Equivalence and Semantic Consistency”, in Advances in Neural Information Processing Systems 38: Annual Conference on Neural Information Processing Systems 2024, NeurIPS 2024, Vancouver, BC, Canada, December 10 - 15, 2024 , 2024. Zenan Li, Zhi Zhou, Yuan Yao, Xian Zhang, Yu-Feng Li, Chun Cao, Fan Yang, and Xiaoxing Ma, “Neuro-Symbolic Data Generation for Math Reasoning”, in Advances in Neural Information Processing Systems 38: Annual Conference on Neural Information Processing Systems 2024, NeurIPS 2024, Vancouver, BC, Canada, December 10 - 15, 2024 , 2024. Software Engineering for/with Machine Learning Zenan Li, Yunpeng Huang, Zhaoyu Li, Yuan Yao, Jingwei Xu, Taolue Chen, Xiaoxing Ma, and Jian Lú, “Neuro-symbolic Learning Yielding Logical Constraints”, in The Thirty-Seventh Annual Conference on Neural Information Processing Systems (NeurIPS 2023) , Article No.: 946, Pages 21635 - 21657, 2023. Zenan Li, Yuan Yao, Taolue Chen, Jingwei Xu, Chun Cao, Xiaoxing Ma, and Lü Jian, “Softened Symbol Grounding for Neuro-symbolic Systems”, in The Eleventh International Conference on Learning Representations (ICLR 2023) , 2023. Zenan Li, Zehua Liu, Yuan Yao, Jingwei Xu, Taolue Chen, Xiaoxing Ma, and Lü Jian, “Learning with Logical Constraints but without Shortcut Satisfaction”, in The Eleventh International Conference on Learning Representations (ICLR 2023) , notable top 25%, 2023. Zenan Li, Maorun Zhang, Jingwei Xu, Yuan Yao, Chun Cao, Taolue Chen, Xiaoxing Ma, and Jian Lü, “Lightweight Approaches to DNN Regression Error Reduction: An Uncertainty Alignment Perspective”, in Proceedings of the 45th International Conference on Software Engineering (ICSE 2023) , 1187–1199, 2023. Shengbin Xu, Yuan Yao, Feng Xu, Tianxiao Gu, Jingwei Xu, and Xiaoxing Ma, “Data Quality Matters: A Case Study of Obsolete Comment Detection”, in Proceedings of the 45th International Conference on Software Engineering (ICSE 2023) , 781–793, 2023. Ji Liu, Zenan Li, Yuan Yao, Feng Xu, Xiaoxing Ma, Miao Xu, and Hanghang Tong, “Fair Representation Learning: An Alternative to Mutual Information”, in Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining , 1088–1097, 2022. Zenan Li, Xiaoxing Ma, Chang Xu, Jingwei Xu, Chun Cao, and Jian Lü, “Operational Calibration: Debugging Confidence Errors for DNNs in the Field”, in Proceedings of the 2020 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2020) , 901–913, 2020. Zenan Li, Xiaoxing Ma, Chang Xu, Chun Cao, Jingwei Xu, and Jian Lü, “Boosting Operational DNN Testing Efficiency Through Conditioning”, in Proceedings of the 2019 27th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering , 499–509, 2019. Zenan Li, Xiaoxing Ma, Chang Xu, and Chun Cao, “Structural Coverage Criteria for Neural Networks Could Be Misleading”, in Proceedings of the 41st International Conference on Software Engineering: New Ideas and Emerging Results , 89–92, 2019. Engineering Self-Adaptive Software Systems Yi Qin, Yanxiang Tong, Yifei Xu, Chun Cao, and Xiaoxing Ma, “Active Monitoring Mechanism for Control-Based Self-Adaptive Systems”, Proc. ACM Softw. Eng. , 1(FSE), 1841–1864, 2024. Yanxiang Tong, Yi Qin, Yanyan Jiang, Chang Xu, Chun Cao, and Xiaoxing Ma, “Timely and Accurate Detection of Model Deviation in Self-Adaptive Software-Intensive Systems”, in Proceedings of the 29th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering , 168–180, 2021. Zelin Zhao, Yanyan Jiang, Chang Xu, Tianxiao Gu, and Xiaoxing Ma, “Synthesizing Object State Transformers for Dynamic Software Updates”, in Proceedings of the 43rd ACM/IEEE International Conference on Software Engineering (ICSE) , 1111–1122, 2021. Xiaoxing Ma, Tianxiao Gu, and Wei Song, “Software Is Not Soft -- Challenges and Approaches to Dynamic Software Update”, in Engineering Trustworthy Software Systems (SETSS 2017) , 11174, 143–175, 2018. Tianxiao Gu, Xiaoxing Ma, Chang Xu, Yanyan Jiang, Chun Cao, and Jian Lu, “Automating Object Transformations for Dynamic Software Updating via Online Execution Synthesis”, in Proceedings of 32nd European Conference on Object-Oriented Programming (ECOOP 2018) , 19:1-28, 2018. Wei Song, Xiaoxing Ma, and Hans-Arno Jacobsen, “Instance Migration Validity for Dynamic Evolution of Data-Aware Processes”, IEEE Transactions on Software Engineering , 45(8), 782–801, 2019. Luciano Baresi, Carlo Ghezzi, Xiaoxing Ma, and Valerio Panzica La Manna, “Efficient Dynamic Updates of Distributed Components through Version Consistency”, IEEE Transactions on Software Engineering , 43(4), 340–358, 2017. Yiling Yang, Yu Huang, Xiaoxing Ma, and Jian Lu, “Enabling Context-Awareness by Predicate Detection in Asynchronous Environments”, IEEE Transactions on Computers , 65(2), 522–534, 2016. Tianxiao Gu, Chengnian Sun, Xiaoxing Ma, Jian Lü, and Zhendong Su, “Automatic Runtime Recovery via Error Handler Synthesis”, in Proceedings of the 31st IEEE/ACM International Conference on Automated Software Engineering (ASE) , 684–695, 2016. Assurance of Non-Functional Software Qualities Tianxiao Gu, Chengnian Sun, Xiaoxing Ma, Chun Cao, Chang Xu, Yuan Yao, Qirun Zhang, Jian Lu, and Zhendong Su, “Practical GUI Testing of Android Applications via Model Abstraction and Refinement”, in Proceedings of the 41st International Conference on Software Engineering , 269–280, 2019. Dongjie Chen, Yanyan Jiang, Chang Xu, Xiaoxing Ma, and Jian Lu, “Testing Multithreaded Programs via Thread Speed Control”, in Proceedings of the 2018 26th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE) , 15–25, 2018. Yuju Shen, Yanyan Jiang, Chang Xu, Ping Yu, Xiaoxing Ma, and Jian Lu, “ReScue: Crafting Regular Expression DoS Attacks”, in Proceedings of the 33rd ACM/IEEE International Conference on Automated Software Engineering (ASE) , 225–235, 2018. Yanyan Jiang, Chang Xu, Du Li, Xiaoxing Ma, and Jian Lu, “Online Shared Memory Dependence Reduction via Bisectional Coordination”, in Proceedings of the 2016 24th ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE) , 822–832, 2016. Yanyan Jiang, Haicheng Chen, Feng Qin, Chang Xu, Xiaoxing Ma, and Jian Lu, “Crash Consistency Validation Made Easy”, in Proceedings of the 2016 24th ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE) , 133–143, 2016. Engineering Socio-Cyber-Physical Systems Sen Wang, Zhuheng Sheng, Jingwei Xu, Taolue Chen, Junjun Zhu, Shuhui Zhang, Yuan Yao, and Xiaoxing Ma, “ADEPT: A Testing Platform for Simulated Autonomous Driving”, in Proceedings of the 37th IEEE/ACM International Conference on Automated Software Engineering (ASE 2022 Tool Demo) , 2022. More publications: In English, In Chinese; or visit DBLP, Google Scholar. Teaching Discrete Mathematics and Its Applications: [2023-, Spring] (ISE) Discrete Mathematics and Its Applications: [2014-2022, Spring] (Dept. CS) Discrete Mathematical Structures: [2014-2019, Autumn] (Inst. Softw.) Concepts of Programming Languages: [2008-2014, Spring] Object-Oriented Software Construction: [Before 2007] Awards 2006: China National Award for Science and Technology Progress, 2nd prize. Dr. Ma is the 2nd awardee of the team. （国家科技进步二等奖，第二完成人） 2011: China National Award for Science and Technology Progress, 2nd prize. Dr. Ma is the 4th awardee of the team. （国家科技进步二等奖，第四完成人） 2010: MOE Award for S&T Research in Universities, 1st class, Ministry of Education. I am the 2nd awardee of the team. （教育部高校优秀科研成果技术发明一等奖，第二完成人） 2009: CVIC SE Award for Software Researchers. （中创软件人才奖） Research Grants (as PI) National Science Fund for Distinguished Young Scholars (国家杰出青年科学基金项目)：Engineering Self-Adaptive Software Systems (软件自适应技术), Grant No. 62025202, 2021-2025. Project supported by the Major Program of the National Nat",
  "content_length": 12560,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:42"
}