{
  "name": "Xiaoyan Zhang 0002",
  "homepage": "https://xyzlaboratory.github.io/xyzlab",
  "status": "success",
  "content": "XYZlab Xiaoyan Zhang Background introduction Xiaoyan Zhang Associate Professor doctor Shenzhen University Research Institute For Future Media Computing xyzhang15@szu.edu.cn Xiaoyan Zhang, Ph.D., associate professor, member of IEEE, member of China Society of image graphics, obtained a bachelor's degree and a master's degree from Shandong University in 2006 and 2009 respectively. In 2014, she obtained her PHD degree from Nanyang Technological University in Singapore. From 2013 to 2015, she was a visiting scholar and postdoctoral fellow at Houston Methodist Research Institute, USA. Xiaoyan Zhang is a high-level overseas talent introduced by Shenzhen - Peacock plan talent. She has presided over 6 scientific research projects, including National Natural Science Foundation Project , and won the scientific research fund project of Tencent \"rhinoceros bird\" young teachers of Shenzhen University. She has published more than 40 high-level academic papers in his research field. The main research fields are: image aesthetics research, 2D / 3D image and video enhancement and editing, 3D human body and face model reconstruction, aesthetics based clothing recommendation system, reinforcement learning, etc. It has established and maintained close scientific research cooperation with universities and research institutions at home and abroad. Personal home page: http://futuremedia.szu.edu.cn/peopleXiaoyanZhang.aspx What We Do Under the general trend of artificial intelligence, we are exploring the future media technology. About team This team is Xiaoyan Zhang's team under the Research Institute For Future Media Computing of Shenzhen University. Research Interests Multimedia content analysis, image and video enhancement and editing, 3D human body and face modeling. Paper list All the articles of our team are as follows for your reference. All the articles of our team are as follows for your reference. Latest research results We will update our work dynamics from time to time for us to learn and communicate. Search",
  "content_length": 2031,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:43"
}