{
  "name": "Xiaoning Ding",
  "homepage": "https://web.njit.edu/~dingxn",
  "status": "success",
  "content": "Ding, Xiaoning's Page Xiaoning Ding Associate Professor Department of Computer Science New Jersey Institute of Technology University Heights, Newark, NJ 07102, USA Office: GITC 4203 Phone: (973)596-3390 Email: xiaoning.ding AT njit DOT edu Xiaoning Ding is an associate professor in Department of Computer Science at New Jersey Institute of Technology. He received his Ph.D. degree in Computer Science and Engineering from the Ohio State University in 2010. His interests are in the area of experimental computer systems, including edge/cloud computing infrastructures, virtualization, edge/cloud systems for AI/DL, parallel and distributed systems, memory and storage systems, operating systems, database systems, and computer architecture. Teaching CS 101: Computer Program and Problem Solving CS 288: Intensive Programming in Linux CS 433: Introduction to Linux Kernel Programming CS 643: Cloud Computing CS 786: Virtualization and Containerization Technologies Recent Publications (Google Scholar and DBLP) Edward Guo, Weiwei Jia, Xiaoning Ding, Jianchen Shan. Optimizing Task Scheduling in Cloud VMs with Accurate vCPU Abstraction. The 20th European Conference on Computer Systems (EuroSys 2025) March 30 - April 3, 2025. Rotterdam, Netherlands. Weiwei Jia, Jiyuan Zhang, Jianchen Shan, Xiaoning Ding. Effective Huge Page Strategies for TLB Miss Reduction in Nested Virtualization. IEEE Transactions on Computers (TC). 73(8): 1983-1996. 2024 Weiwei Jia, Jiyuan Zhang, Jianchen Shan, Yiming Du, Xiaoning Ding, Tianyin Xu. HugeGPT: Storing Guest Page Tables on Host Huge Pages to Accelerate Address Translation. The 32nd International Conference on Parallel Architectures and Compilation Techniques (PACT 2023). Oct 21-25, 2023. Vienna, Austria. Xiaowei Shang, Weiwei Jia, Jianchen Shan, Xiaoning Ding, Cristian Borcea. Reestablishing Page Placement Mechanisms for Nested Virtualization. IEEE Transactions on Cloud Computing (TCC). 11 (3). 2023 Weiwei Jia, Jiyuan Zhang, Jianchen Shan, Xiaoning Ding. Making Dynamic Page Coalescing Effective on Virtualized Clouds. The European Conference on Computer Systems (EuroSys 2023) May 8-12, 2023. Rome, Italy. (Slides) Weiwei Jia, Jiyuan Zhang, Jianchen Shan, Jing Li, Xiaoning Ding. Achieving Low Latency in Public Edges by Hiding Workloads Mutual Interference. ACM Symposium on Cloud Computing (SoCC 2022). November 8-10, 2022. San Francisco, CA. Tong Shu, Yanfei Guo, Justin Wozniak, Xiaoning Ding, Ian Foster, Tahsin Kurc. Bootstrapping In-Situ Workflow Auto-Tuning via Combining Performance Models of Component Applications. The International Conference for High Performance Computing, Networking, Storage, and Analysis (SC 2021). November 14-19, 2021. Xiaowei Shang, Weiwei Jia, Jianchen Shan, Xiaoning Ding. CoPlace: Effectively Mitigating Cache Conflicts in Modern Clouds. The 30th International Conference on Parallel Architectures and Compilation Techniques (PACT 2021) September 26-29, 2021. Stijn Schildermans, Jianchen Shan, Kris Aerts, Jason Jackrel, Xiaoning Ding. Virtualization Overhead of Multithreading in X86 State of the Art & Remaining Challenges. IEEE Transactions on Parallel and Distributed Systems (TPDS). Volume: 32, Issue: 10. March 2021. Weiwei Jia, Jianchen Shan, Tsz On Li, Xiaowei Shang, Heming Cui, Xiaoning Ding. vSMT-IO: Improving I/O Performance and Efficiency on SMT Processors in Virtualized Clouds. USENIX Annual Technical Conference (USENIX ATC 20). July 15-17, 2020. (Source code, Slides) More publications Professional Activities Conference Organization: ICDCS (2024, 2023, 2022, 2018, 2017), ICS (2023, 2022), IEEE BigData (2024, 2023, 2022, 2018~2020, 2014, 2013), ICMR (2022), UCC (2022), IEEE Cloud Summit (2021, 2020), MASS 2020, HPCA 2019, ISCA 2017, Smart Cities 2017, BigData Congress 2017, ICPADS 2016, ICPP 2015, CCGrid (2014, 2013). Panelist and reviewer: National Science Foundation (NSF) and Research Grants Council (RGC) of Hong Kong Technical Review Board (TRB) IEEE Transactions on Parallel and Distributed Systems. Journal reviewers: IEEE Transactions on Parallel and Distributed Systems, IEEE Transactions on Computers, IEEE Transactions on Cloud Computing, ACM Transactions on Embedded Computing Systems, ACM Transactions on Modeling and Performance Evaluation of Computing Systems, Journal of Parallel and Distributed Computing, IEEE Micro, IEEE Access, Journal of Computer Science and Technology, The Computer Journal, Parallel Computing, EURASIP Journal on Advances in Signal Processing Resources Library resources",
  "content_length": 4524,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:37"
}