{
  "name": "Xiaoyu Xia 0001",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/x/xia-dr-xiaoyu",
  "status": "success",
  "content": "Xiaoyu Shaw Xia - RMIT University Xiaoyu Shaw Xia SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Xiaoyu Shaw Xia Dr. Xiaoyu Shaw Xia Lecturer, Cybersecurity & Software Systems See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia xiaoyu.xia@rmit.edu.au ORCID: 0000-0003-3526-3217 Open to Masters Research or PhD student supervision Media enquiries About Dr Xiaoyu Xia received his PhD degree with the Alfred Deakin Medal from Deakin University, Australia. Currently, he is a lecturer at RMIT University, Australia. He has published over 60 peer-reviewed papers in international journals and conferences, including IEEE S&P, ACM WWW, ACM SIGIR, IEEE TPDS, TMC, TDSC, TSC, JSAC, etc. He was selected as one of the World's Top 2% Scientists by Stanford University since 2022. In 2025, he won the RMIT Early Career Researcher Award for Research Excellence. He also serves as an associate editor for IEEE Transactions on Dependable and Secure Computing and a member of the IEEE Transactions on Parallel and Distributed Systems Review Board. More details about his research can be found at https://xiaoyushawxia.github.io/homepage/. Expand for full bio Collapse bio Research fields 4604 Cybersecurity and privacy 4602 Artificial intelligence 4606 Distributed computing and systems software Academic positions Lecturer RMIT University Melbourne, Australia Jan 2023 – Dec 2025 Lecturer University of Southern Queensland Toowoomba, Australia Jul 2022 – Jan 2023 Postdoc Research Fellow The University of Adelaide Adelaide, Australia Jan 2022 – Jul 2022 Supervisor projects Federated Unlearning for the Right to Be Forgotten 30 Sep 2025 A Privacy-Preserving Framework for Large Language Models 28 May 2025 Quantum Neural Networks algorithm for malware detection 19 Aug 2024 Implementation and Optimization of Theorem Prover for PPTL with Indexed Expressions 11 Jun 2024 Practical Defense Against Backdoor Attacks in Spiking Neural Networks 7 May 2024 Machine Unlearning 26 Oct 2023 Privacy-preserving Demand Response at the Network Edge 24 Oct 2023 Privacy-aware Smart Access Control for Internet-of-Things on Blockchain 25 May 2023 Byzantine general problem optimization for decentralized gradient descent 13 Apr 2023 Research interests His research interests include system privacy and security, AI privacy, parallel and distributed computing, sustainable computing, and ML systems. Initiatives and links https://scholar.google.com.au/citations?user=v-6hODoAAAAJ&hl=en https://xiaoyushawxia.github.io/homepage/ Acknowledgement of Country RMIT University acknowledges the people of the Woi wurrung and Boon wurrung language groups of the eastern Kulin Nation on whose unceded lands we conduct the business of the University. RMIT University respectfully acknowledges their Ancestors and Elders, past and present. RMIT also acknowledges the Traditional Custodians and their Ancestors of the lands and waters across Australia where we conduct our business - Artwork 'Sentient' by Hollie Johnson, Gunaikurnai and Monero Ngarigo. More information News Events Library Maps Careers Contacts Study with Us Levels of study Online courses and degrees Single courses Applying to RMIT International students Parents Careers advisers Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Research Our research Centres and collaborations Partnerships Research degrees Find researchers Research contacts Partner Workforce development Staff development and training Research partnerships Facilities and equipment services Giving About Our strategy Governance and management Values Sustainability Schools and colleges Our locations and facilities Copyright © 2025 RMIT University | Terms | Privacy | Accessibility | Website feedback | Complaints | ABN 49 781 030 034 | CRICOS provider number: 00122A | TEQSA provider number: PRV12145 | RTO Code: 3046 | Open Universities Australia | RMIT Training Pty Ltd, trading as RMIT University Pathways (RMIT UP), CRICOS Provider Code: 01912G",
  "content_length": 5573,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:46"
}