{
  "name": "Xiaoyi Lu",
  "homepage": "http://faculty.ucmerced.edu/luxi",
  "status": "success",
  "content": "Xiaoyi Lu Skip to main content Xiaoyi Lu Associate Professor Founder and Director of Parallel and Distributed Systems Laboratory (PADSYS Lab) Department of Computer Science and Engineering School of Engineering University of California, Merced Address: SE2, 5200 N. Lake Road, Merced, CA 95343 Email: FN DOT LN AT ucmerced.edu OR acm.org Bio |  Research |  Publications |  Teaching | People |  Services |  Awards |  PADSYS Lab |  HPCSA Group | AgAID Institute  | Book Short Bio Dr. Xiaoyi Lu is an Associate Professor in the Department of Computer Science and Engineering at the University of California, Merced (UC Merced), where he leads the Parallel and Distributed Systems Laboratory (PADSYS Lab). He has been an affiliated faculty member with the AgAID Institute since 2023. His research interests include parallel and distributed computing, high-performance communication and I/O technologies, big data analytics, cloud computing, deep learning, digital twin technology, and interdisciplinary research (e.g., precision agriculture and biostatistics). Dr. Lu has published more than 170 papers in prestigious international conferences, workshops, and journals, and has received ten Best (Student) Paper Awards or Nominations (e.g., SC 2019, IPDPS 2024). He has delivered over 100 invited talks, tutorials, and presentations around the world. Dr. Lu is actively involved in various professional activities in academic journals and conferences. He has made many of his research outcomes, such as OpenDOTA, SR-APPFL, PMIdioBench, HiBD, MVAPICH2-Virt, and DataMPI, publicly available to the community, and they are currently being used by hundreds of organizations worldwide. Dr. Lu has received the NSF CAREER Award, an Amazon Research Award, a Google Research Award, and a Meta/Facebook Faculty Research Award, and his research has been funded by the NSF and DOE. For more information about Dr. Lu, please visit http://faculty.ucmerced.edu/luxi. UC Merced is ranked #7 in high performance computing (HPC) and #63 in computer science in general by CSRankings. I am always looking for strong postdoc researchers and Ph.D. students who are interested in Parallel and Distributed Computing systems and applications. Research My research interests include: Parallel and Distributed Computing Scalable, Efficient, and Secure Techniques and Systems for HPC, Big Data, AI, Cloud, Edge, and others Novel Communication and I/O Technologies (e.g., RDMA/PMEM/NVMe/GPU/DPU) Scalable and Parallel Algorithms and Applications Interdisciplinary Research for Social Good I am the founder and lead principal investigator (PI) of the following projects: OpenDOTA: Open-Source Data Offloading and Transfer Architecture for DPUs SR-APPFL: Scalable and Resilient Advanced Privacy-Preserving Federated Learning PMIdioBench: Understanding the Idiosyncrasies of Real Persistent Memory Stay tuned—more exciting projects will be announced and released soon. I held roles as founder/co-founder and led the R&D efforts on the following projects: High-Performance Big Data (HiBD) MVAPICH2-Virt: High-Performance MPI Library with Virtualization Support DataMPI: Extending MPI for Big Data with Key-Value based Communication LingCloud: An IaaS Management System for Heterogeneous Applications High-Performance Neuroscience (NeuroHPC) Selected Publications Complete publications list: [by year] [Google scholar] [DBLP] [ICSE'26] CCLInsight: Unveiling Insights in GPU Collective Communication Libraries via Primitive-Centric Analysis Liuyao Dai, Adam Weingram, Weicong Chen, and Xiaoyi Lu. In Proceedings of the 48th IEEE/ACM International Conference on Software Engineering (ICSE), 2026. [HPCA'26] eGPU: Production-Scale Elastic Sharing over 10,000 GPUs Xiaochuan Tang*, Hao Qi*, Jianbo Dong, Yinghao Yu, Zhennan Xue, Zhengyu Zhang, Daocheng Ying, Zheng Cao, and Xiaoyi Lu. In Proceedings of the 32nd IEEE International Symposium on High-Performance Computer Architecture (HPCA), 2026. (* made equal contributions; Industry Track; Acceptance Rate: 20%) [SC'25] HPC-R1: Characterizing R1-like Large Reasoning Models on HPC Adam Weingram*, Duo Zhang*, Zhonghao Chen, Hao Qi, and Xiaoyi Lu. In Proceedings of the 38th International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2025. (* made equal contributions; Acceptance Rate: 21.2%) [SC'25] DPAR: High-Performance, Secure, and Scalable Differential Privacy-based AllReduce Hao Qi, Weicong Chen, Chenghong Wang, and Xiaoyi Lu. In Proceedings of the 38th International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2025. (Acceptance Rate: 21.2%) [HPDC'25] DPU-KV: On the Benefits of DPU Offloading for In-Memory Key-Value Stores at the Edge Arjun Kashyap, Yuke Li, and Xiaoyi Lu In Proceedings of International ACM Symposium on High Performance and Distributed Computing (HPDC), 2025. [ICS'25] Understanding the Idiosyncrasies of Emerging BlueField DPUs Arjun Kashyap, Yuke Li, Darren Ng, and Xiaoyi Lu In Proceedings of the 39th International Conference on Supercomputing (ICS), 2025. [PPoPP'25] SBMGT: Scaling Bayesian Multinomial Group Testing Weicong Chen, Hao Qi, Curtis Tatsuoka, and Xiaoyi Lu. In Proceedings of ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPoPP), 2025. (Acceptance Rate: 20.1%) [IPDPS'25] SPRT2: Scalable, Parallel, and Real-Time fMRI Data Analysis on Heterogeneous Architectures Weicong Chen, Sarah J Carr, Jing Zhang, Curtis Tatsuoka, and Xiaoyi Lu. In Proceedings of the 39th IEEE International Parallel and Distributed Processing Symposium (IPDPS), 2025. [SIGMOD'25] On the Feasibility and Benefits of Extensive Evaluation Yujie Hui*, Miao Yu*, Hao Qi, Yifan Gan, Tianxi Li, Yuke Li, Xueyuan Ren, Sixiang Ma, Xiaoyi Lu, and Yang Wang. In Proceedings of ACM International Conference on Management of Data (SIGMOD), 2025. (* made equal contributions) [SEC'25] FedDES: Discrete Event Based Performance Simulation for Federated Learning Systems Zhonghao Chen*, Weicong Chen*, Duo Zhang, Kibaek Kim, Guanpeng Li, Sheng Di, and Xiaoyi Lu. In Proceedings of the 10th ACM/IEEE Symposium on Edge Computing (SEC), 2025. (* made equal contributions) [SC'24] Versatile Datapath Soft Error Detection on the Cheap for HPC Applications Yafan Huang, Sheng Di, Zhaorui Zhang, Xiaoyi Lu, and Guanpeng Li. In Proceedings of the 37th International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2024. [SC'24] hZCCL: Accelerating Collective Communication with Co-Designed Homomorphic Compression Jiajun Huang, Sheng Di, Xiaodong Yu, Zhaiyu Jia, Jinyang Liu, Zizhe Jian, Xin Liang, Kai Zhao, Xiaoyi Lu, Zizhong Chen, Franck Cappello, Yanfei Guo and Rajeev Thakur. In Proceedings of the 37th International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2024. [IPDPS'24] Accelerating Lossy and Lossless Compression on Emerging BlueField DPU Architectures (Best Paper Award Nomination) Yuke Li, Arjun Kashyap, Weicong Chen, Yanfei Guo, and Xiaoyi Lu. In Proceedings of the 38th IEEE International Parallel and Distributed Processing Symposium (IPDPS), 2024. [IPDPS'24] NVMe-oPF: Designing Efficient Priority Schemes for NVMe-over-Fabrics with Multi-Tenancy Support Darren Ng, Andrew Lin, Arjun Kashyap, Guanpeng Li, and Xiaoyi Lu. In Proceedings of the 38th IEEE International Parallel and Distributed Processing Symposium (IPDPS), 2024. [ICS'24] gZCCL: Compression-Accelerated Collective Communication Framework for GPU Clusters Jiajun Huang, Sheng Di, Xiaodong Yu, Yujia Zhai, Jinyang Liu, Yafan Huang,  Ken Raffenetti, Hui Zhou, Kai Zhao, Xiaoyi Lu, Zizhong Chen, Franck Cappello, Yanfei Guo, and Rajeev Thakur In Proceedings of the 38th International Conference on Supercomputing (ICS), 2024. [IPDPS'23] SBGT: Scaling Bayesian-based Group Testing for Disease Surveillance Weicong Chen, Hao Qi, Xiaoyi Lu, and Curtis Tatsuoka. In Proceedings of the 37th IEEE International Parallel and Distributed Processing Symposium (IPDPS), 2023. [HPDC'22] NVMe-oAF: Towards Adaptive NVMe-oF for IO-Intensive Workloads on HPC Cloud Arjun Kashyap and Xiaoyi Lu. In Proceedings of International ACM Symposium on High Performance and Distributed Computing (HPDC), 2022. (Acceptance Rate: 19%) [VLDB'22] A Study of Database Performance Sensitivity to Experiment Settings Yang Wang, Miao Yu, Yujie Hui, Fang Zhou, Yuyang Huang, Rui Zhu, Xueyuan Ren, Tianxi Li, and Xiaoyi Lu In Proceedings of the VLDB Endowment, the 48th International Conference on Very Large Data Bases (VLDB), 2022. [SEC'21] Characterizing and Accelerating End-to-End EdgeAI Inference Systems for Object Detection Applications Yujie Hui, Jeffrey Lien, and Xiaoyi Lu. In Proceedings of the 6th ACM/IEEE Symposium on Edge Computing (SEC), 2021. [SC'21] HatRPC: Hint-Accelerated Thrift RPC over RDMA Tianxi Li*, Haiyang Shi*, and Xiaoyi Lu. In Proceedings of the 34th International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2021. (*Co-First Authors) [HPDC'21] DStore: A Fast, Tailless, and Quiescent-Free Object Store for PMEM Shashank Gugnani and Xiaoyi Lu. In Proceedings of International ACM Symposium on High Performance and Distributed Computing (HPDC), 2021. (Acceptance Rate: 19%) [VLDB'21] Understanding the Idiosyncrasies of Real Persistent Memory Shashank Gugnani, Arjun Kashyap, and Xiaoyi Lu. In Proceedings of the VLDB Endowment, the 47th International Conference on Very Large Data Bases (VLDB), 2021. [IPDPS'21] NVMe-CR: A Scalable Ephemeral Storage Runtime for Checkpoint/Restart with NVMe-over-Fabrics Shashank Gugnani, Tianxi Li, and Xiaoyi Lu. In Proceedings of the 35th IEEE International Parallel and Distributed Processing Symposium (IPDPS), 2021. [SC'20] INEC: Fast and Coherent In-Network Erasure Coding Haiyang Shi and Xiaoyi Lu. In Proceedings of the 33rd International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2020. (Acceptance Rate: 22.3%) [SC'2",
  "content_length": 24459,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:45"
}