{
  "name": "Xiaoguang Wang 0003",
  "homepage": "https://xiaoguang.wang",
  "status": "success",
  "content": "About me - Xiaoguang Wang (王晓光)’s Home Page Xiaoguang WangA security and system researcher Follow CDRLC (4454), Chicago, IL Email Github Google Scholar ORCIDI am an Assistant Professor in the Department of Computer Science at the University of Illinois Chicago (UIC). My research focuses on systems and software security, with an emphasis on systems support for emerging computer architectures and secure software systems design. Recently, I have been exploring innovative ways to address systems and security challenges using large language models (LLMs). My past projects have spanned areas such as virtualization, operating system kernels, and compilers, aimed at building more secure and efficient systems.I am seeking one highly motivated Ph.D. student interested in computer systems and security to join our research group. If you’re interested, please email me with the subject line: “Prospective Student - [Your Name],” and include your CV and transcript. Learn more about the Ph.D. application process here.Occasionally, I offer funded research opportunities for UIC master’s and undergraduate students. However, I typically prefer working with students I have taught in my classes. If you’re interested, consider enrolling in one of my courses to start a conversation! TeachingCS 461: Operating Systems Design and Implementation: Fall 2025 CS 487: Building Secure Computer Systems: Fall 2024, 2023 CS 594/561: Adv. Linux Kernel Programming: Spring 2025, 2024News[08/2025] Welcome Luyao, Chalmers, and Kenan to our group as graduate research assistants![07/2025] Invited to serve as a PC member for PLOS’25.[05/2025] Congrats to Edoardo and Robert on successfully defending their MS thesis and project—best wishes ahead![02/2025] Invited to serve as a PC member for SYSTOR’25, ASPLOS’26.[11/2024] Our group welcomes Robert David Hernandez, Lily Leith, Edoardo Carlotto, and Edoardo D’Alessio as graduate research assistants![06/2024] We received a gift from Google to improve software security with LLMs. Thanks, Google![04/2024] Our paper on rewriting process states for migrating processes across computer architecture boundaries has been accepted at IEEE ICDCS’24![03/2024] Our paper on optimizing multi-variant execution has been accepted at ACM/IFIP Middleware’24![09/2023] Our paper on dynamic software customization has been accepted at ACM/IFIP Middleware’23![06/2023] Our work on Linux eBPF fuzzing has been accepted at APSys’23![04/2023] I will join the Department of Computer Science at UIC in Fall 2023!… …A list of recent publications.",
  "content_length": 2557,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:26"
}