{
  "name": "Xiaofeng Gao 0001",
  "homepage": "http://www.cs.sjtu.edu.cn/~gao-xf",
  "status": "success",
  "content": "Dr. Xiaofeng Gao Xiaofeng Gao Department of Computer Science and EngineeringShanghai JiaoTong University HomeResearchTeachingProject&AwardActivitiesStudents Professor, Ph.D. Department of Computer Science and Engineering Shanghai Jiao Tong University Office: SEIEE 3-543 800 Dongchuan Road, Minhang District Shanghai 200240, P.R. China Email: gao-xf@cs.sjtu.edu.cn Phone: 86-21-34207407 My profile on Recruiting I am looking for self-motivated Master and PhD students who are strongly committed to research. If you are interested in Data Engineering, Data Mining or Networking, feel free to send me your CV. Recent Publications (Full Publication List) Xiaofeng Gao, Wenyi Xu, Mingding Liao, Guihai Chen, Trust Prediction for Online Social Networks with Integrated Time-Aware Similarity, ACM Transactions on Knowledge Discovery from Data (TKDD), 2021. (Accepted 1/19/2021) Xiaofeng Gao, Xiaosong Jia, Chaoqi Yang and Guihai Chen, Using Survival Theory in Early Pattern Detection for Viral Cascades, IEEE Transactions on Knowledge and Data Engineering (TKDE), 2020. (Accepted 7/31/2020) Xiaofeng Gao, Jiahao Fan, Fan Wu, Guihai Chen, Cooperative Sweep Coverage Problem with Mobile Sensors, IEEE Transactions on Mobile Computing (TMC), 2020. (Accepted 6/29/2020) Xiaofeng Gao, Shenwei Chen, Guihai Chen, MAB-Based Reinforced Worker Selection Framework for Budgeted Spatial Crowdsensing, to appear on IEEE Transactions on Knowledge and Data Engineering (TKDE), 2020. (Accepted 4/30/2020) Xiaofeng Gao, Ailun Song, Luoyao Hao, Junni Zou, Guihai Chen, Shaojie Tang, Towards Efficient Multi-Channel Data Broadcast for Multimedia Streams, IEEE Transactions on Parallel and Distributed Systems (TPDS), Volume 30, Issue 10, pp.2370-2383, October 1 2019. Biography Doctor of Science in Computer Science, The University of Texas at Dallas, USA Master of Science in Operations Research and Control Theory, Tsinghua University, P.R.China Bachelor of Science in Computational Mathematics, Nankai University, P.R.China Research Interest My research interests are in Data Engineering, Database Management, and Network Optimization. In particular, my research includes data mining in crowdsourcing, social network, recommendation system, online advertisement, and general network optimization algorithms. Update News Chaoqi Yang got CCF Best Undergraduate Award! (2019) Haotian Wang got CCF Best Undergraduate Award! (2017) We got DASFAA2017 Best Paper Award! (CCF-B) We got ICPADS2016 Best Paper Award! (CCF-C) Xiaofeng Gao / Homepage | Department of Computer Science and Engineering | Shanghai Jiao Tong University ©Copyright Xiaofeng Gao",
  "content_length": 2622,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:24"
}