{
  "name": "Xiaolin Wang 0001",
  "homepage": "https://cs.pku.edu.cn/info/1230/2031.htm",
  "status": "success",
  "content": "ï»¿ Wang, Xiaolin-åäº¬å¤§å­¦è®¡ç®æºå­¦é¢ Peking University | Meeting Room Reservation | ä¸­æ Current Location: Home Â» People Â» Faculty Â» By Last Name Â» W Â» Content People Academician Faculty Research Scientist POSTDOC STAFF People Academician Faculty Research Scientist POSTDOC STAFF W Wang, Xiaolin Title:Professor Institute:Institute of Networking and Energy-efficient Computingï¼NEECï¼ Research Interests:System virtualization, cloud computing Phone:86-10-6276 3373 E-mail:wxlpku.edu.cn Wang, Xiaolin is a professor in the School of Computer Science. He obtained his B.Sc. and Ph.D. from Peking University in 1996 and 2001 respectively. His research interests include system virtualization and cloud computing. He has published more than 80 research papers, including papers published in top-tier conferences and journals, such as USENIX ATC, ICS,IEEE TOC, IEEE TPDS, and ACM TACO. On program locality theory, he proposed a new model, AET (Average Eviction Time), to accurately predict the behavior of cache via reuse-time instead of widely used reuse-distance. AET makes it possible to sampling memory accesses in prediction with only little accuracy loss. At present, AET is the best model on both time complexity and space complexity. On memory virtualization, he was the first one who proposed to combine hardware features with software features in memory virtualization optimization/ to take advantage of both hardware and software characteristics, which would improve the performance of memory virtualization effectively. He also proposed the method of dynamic memory para-virtualization, eliminating hot spot VM-exits by dynamically altering binary code, without need to modify the source code of kernel, to improve the performance of memory virtualization. The method of dynamic memory para-virtualization had extended the design space of virtualization.",
  "content_length": 1879,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:33"
}