{
  "name": "Xiao Fu 0001",
  "homepage": "http://people.oregonstate.edu/~fuxia",
  "status": "success",
  "content": "Navigation Home Group Biography REU Projects Group Blogs Publications and Code Journal Papers and Code ML Conf. Papers and Code SP Conf. Papers Xiao Fu's Homepage Xiao Fu, Ph.D. Associate Professor School of Electrical Engineering and Computer Science Oregon State University 3003, Kelley Engineering Center Corvallis, OR, 97331, United States (xiao.fu(AT)oregonstate.edu) Links: Google Scholar, OSU AI Program, Signal Processing Group News and Updates Sep 2025: Our feature article on IEEE Signal Processing Magazine has now been online: S. Ibrahim, P. Traganitis, X. Fu, and G. B. Giannakis, ‘‘Learning from crowdsourced noisy labels: A signal processing perspective’’ IEEE Signal Processing Magazine, feature article, Sep. 2025. Sep 2025: Sean (Hoang Son Nguyen) has had his first NeurIPS paper accepted! Hoang Son Nguyen and Xiao Fu, ‘‘Diverse Influence Component Analysis: A Geometric Approach to Nonlinear Mixture Identifiability’’ NeurIPS 2025. In this work, we study using conditions that were proposed for structured matrix factorization (X=AS) to underpin identifiability of nonlinear mixtures (x=f(s)). It turns out that there is an interesting connection: the sufficiently scattered condition often used for SMF corresponds to diverse influence of latents onto the observed features. This enables unique identification by maximizing the volume of the Jacobian of the mixing function. August 2025: We are grateful to receive support from NSF: Collaborative Research: Unregistered Spectral Image Fusion: Foundations and Algorithms. This is a collaborative project with University of Minnesota. OSU is the lead institute. July 2025: Sagar presented our work in ICML 2025 in Vancouver, Canada. Sagar Shrestha and Xiao Fu, “Diversified Flow Matching with Translation Identifiability.” ICML 2025. This work extends our diversified distribution matching method to the flow domain. July 2025: Rajesh's first IEEE Transactions on Signal Processing paper is accepted! R. Shrestha, M. Shao, M. Hong, W.-K. Ma, and X. Fu, ‘‘Downlink MIMO channel estimation from bits: Recoverability and algorithm’’ IEEE Transactions on Signal Processing, Jul. 2025. The paper studies MIMO channel feedback in FDD systems. We proposed an ADMM-based plug-and-play algorithm for this task, using quantized data. Jan. 2025: New paper alert! S. Shrestha and X. Fu, ‘‘Content-Style Learning from Unaligned Domains: Identifiability under Unknown Latent Dimensions’’, ICLR 2025 Sep. 2024: New papers alert! Subash, Sagar, and Tri have their first NeurIPS papers accepted (pre-prints will be shared soon): T. Nguyen, S. Ibrahim, and X. Fu, ‘‘Noisy Label Learning with Instance-Dependent Outliers: Identifiability via Crowd Wisdom’’, NeurIPS 2024, Spotlight. Also check out the GitHub page with code and data. S. Timilsina, S. Shrestha, and X. Fu, “Identifiable Shared Component Analysis of Unpaired Multimodal Mixtures”, NeurIPS 2024. Sep. 2024: Honored to receive the Promising Scholar Award from Oregon State University. Jul. 2024: Check out our new submission on arXiv. This work reviewed the developments of noisy label crowdsourcing from a signal processing perspective, connecting ideas, formulations, and algorithms in this domain to techniques that are widely used in SP, e.g., NMF and tensor decomposition. S. Ibrahim, P. Traganitis, X. Fu, and G. B. Giannakis, ‘‘Learning from crowdsourced noisy labels: A signal processing perspective’’ arXiv:2407.06902, Jul. 2024 Jun. 2024, Dr. Shahana Ibrahim received the 2023/2024 EECS Dissertation Award! Shahana defended her Ph.D. dissertation in summer 2023 and then joined the University of Central Florida as a tenure-track Assistant Professor. Congratulations to Shahana for this well-deserved award! Jan. 2024: Sagar's first ICLR paper was accepted! In this work we revisited the distribution matching based unsupervised domain translation problem (a typical example is CycleGAN) and offered a model identification perspective. We came up with a provable framework called ‘‘diversified distribution matching’’. This framework provably circumvents the content misalignment problem of CycleGAN. Check out the paper! S. Shrestha and X. Fu, ‘‘Towards Identifiable Unsupervised Domain Translation: A Diversified Distribution Matching Approach’’, ICLR 2024 Our framework leverages variable-defined subdomains to avoid translating sources to content-misaligned targets. Nov. 2023: Our paper on quantized spectrum cartography has been accepted to IEEE Transactions on Signal Processing! Congratulations to Subash and Sagar! Check out the paper here: S. Timilsina, S. Shrestha, and X. Fu, ‘‘Quantized Radio Map Estimation Using Tensor and Deep Generative Models’’, IEEE Transactions on Signal Processing, accepted, Nov. 2023 Sep 2023: I am humbled and honored to have received the Engelbrecht Early Career Award from the College of Engineering, Oregon State University. Thank you COE for the recognition. Many thanks to my students, collaborators, mentors and my nominator. Sep 2023: A new paper was accepted to IEEE CAMSAP 2023. The paper was a result of the REU program under the NSF project on crowdsourced data labeling. The lead author of this paper is our CS undergraduate student Daniel Grey Wolnick. Grey has successfully defended his honors college thesis in the Spring of 2023. Check out the paper: D.G. Wolnick, S. Ibrahim, T. Marrinan, and X. Fu ‘‘Deep Learning from Noisy Labels via Robust Nonnegative Matrix Factorization-Based Design\" accepted to IEEE CAMSAP 2023. Sep 2023: Shahana defended her dissertation in July 2023! In Dec. 2023, Shahana will join the AI Initiative of the University of Central Florida as a Tenure-Track Assistant Professor (joint appointment with the Department of ECE and the Department of CS). Congratulations Shahana! We are proud of you and looking forward to seeing more accomplishments of yours. July 2023: Group members attended ICML 2023 in Honolulu, Hawaii. June 2023, I started serving as the Chair of IEEE Signal Processing Society Oregon Chapter. My former chair is Dr. Jinsub Kim. June 2023, I visited KU Leuven, Belgium, hosted by Prof. Aritra Konar and Prof. Lieven De Lathauwer. Gave a talk ‘‘Understanding multiview analysis and self-supervised learning: A nonlinear mixture identification viewpoint’’ YouTube video from an earlier IPAM talk and the ICLR2022 paper June 2023, I visited University of Mons, Belgium, hosted by Prof. Nicolas Gillis. Served on the jury (Ph.D. defense committee) of (soon to be Dr.) Pierre De Handschutter. Gave a talk ‘‘Understanding multiview analysis and self-supervised learning: A nonlinear mixture identification viewpoint’’ YouTube video from an earlier IPAM talk and the ICLR2022 paper June 2023, I attended ICASSP 2023 in Rhodes, Greece. April 2023, Tri and Shahana have their ICML 2023 papers accepted! S. Ibrahim, X. Fu, R. Hutchinson and E. Seo, ‘‘Under-counted tensor completion with neural incorporation of attributes’’. T. Nguyen, S. Ibrahim, and X. Fu, ‘‘Deep Clustering with Incomplete Noisy Pairwise Annotations: A Geometric Regularization Approach’’. Mar. 2023, another work by Sagar has been accepted to IEEE Transactions on Signal Processing: S. Shrestha and X. Fu, ‘‘Communication-Efficient Federated Linear and Deep Generalized Canonical Correlation Analysis’’, IEEE Transactions on Signal Processing, accepted, Mar. 2023 Jan. 2023, Sagar's work has been accepted to IEEE Transactions on Signal Processing: S. Shrestha, X. Fu, and M. Hong, ‘‘Optimal Solutions for Joint Beamforming and Antenna Selection: From Branch and Bound to Graph Neural Imitation Learning’’, IEEE Transactions on Signal Processing, accepted, Jan. 2023 The work studies a graph neural network-based acceleration method for provably solving the joint beamforming and antenna selection problem, under a uni-cast setting. An interesting take-away is that, under reasonable conditions, this mixed integer and nonconvex program optimally and efficiently with the help of neural imitation learning. We showed that the graph neural imitation learning approach can reduce the branch and bound method's computational complexity from an exponential order to a linear one, with high probability. Jan. 2023, Shahana and Tri's paper has been accepted to ICLR 2023: S. Ibrahim, T. Nguyen, and X. Fu ‘‘Deep learning from crowdsourced labels: Coupled cross-entropy minimization, identifiability, and regularization’’, ICLR 2023 Jan. 2023, Our paper has been accepted to IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing: M. Ding, X. Fu, and X.-L. Zhao ‘‘Fast and Structured Block-Term Tensor Decomposition for Hyperspectral Unmixing’’ (Source Code) Jan. 2023, I gave a talk at the Institute of Pure and Applied Mathematics (IPAM) at UCLA. The talk is based on our ICLR2022 work: Q. Lyu, X. Fu, W. Wang, and S. Lu, ‘‘Understanding Latent Correlation-Based Multiview Learning and Self-Supervision: An Identifiability Perspective’’, ICLR 2022 Dec. 2022, our papers received two awards: 2022 IEEE Signal Processing Society Best Paper Award: H. Sun, X. Chen, Q. Shi, M. Hong, X. Fu, and N.D. Sidiropoulos, ‘‘Learning to Optimize: Training Deep Neural Networks for Interference Management,’’ in IEEE Transactions on Signal Processing, vol. 66, no. 20, pp. 5438-5453, 15 Oct.15, 2018. 2022 IEEE Signal Processing Society Donald G. Fink Overview Paper Award: N.D. Sidiropoulos, L. De Lathauwer, X. Fu, K. Huang, E.E. Papalexakis, and C. Faloutsos, ‘‘Tensor Decomposition for Signal Processing and Machine Learning’’, IEEE Transactions on Signal Processing, vol. 65, no. 13, pp. 3551-3582, July 1, 2017 Nov. 2022, I was elected to serve on the Technical Committee of Signal Processing Theory and Methods (SPTM-TC) under the IEEE Signal Processing Society. I will start my term in Jan. 2023. Sep 2022, our paper Q. Lyu and X. Fu, ‘‘Provable subspace identification under post-nonlinear mixtures’’ has been accepted to NeuriPS 2022! The camera-ready version is here. The paper shows that post-",
  "content_length": 39163,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:21"
}