{
  "name": "Xiaozhong Liu",
  "homepage": "https://www.wpi.edu/people/faculty/xliu14",
  "status": "success",
  "content": "Xiaozhong Liu | Worcester Polytechnic Institute Skip to main content Office Unity Hall, #362 Phone +1 (508) 8315000 x5911 Xiaozhong Liu Computer Science Associate Professor Affiliated Department or Office Data Science Associate Professor Education PhD in Information Science and Technology from Syracuse University Dr. Xiaozhong Liu is an Associate Professor at Computer Science and Data Science, WPI. Before that, he was Associate Professor at School of Informatics, Computing and Engineering Indiana University Bloomington. His research interests include natural language processing (NLP), text/graph mining, information retrieval/recommendation, metadata, and computational social science. His dissertation at Syracuse University (advisor Dr. Elizabeth D. Liddy) explored an innovative ranking method that weighted the retrieved results by leveraging dynamic community interests. His recent research is focusing on AI explainability/trustworthiness, natural language generation via deep learning, cybercrime/security, and human-centric data heterogeneity. While active in academia, his research also extends to industry, e.g., he was senior consultant and NLP research director at Alibaba DAMO Academy and led a number of prestigious projects the most cutting-edge and market-driven topics. I'm actively looking for PhD students with good experience in NLP and/or deep learning. Xiaozhong Liu Computer Science Associate Professor Affiliated Department or Office Data Science Associate Professor Education PhD in Information Science and Technology from Syracuse University Dr. Xiaozhong Liu is an Associate Professor at Computer Science and Data Science, WPI. Before that, he was Associate Professor at School of Informatics, Computing and Engineering Indiana University Bloomington. His research interests include natural language processing (NLP), text/graph mining, information retrieval/recommendation, metadata, and computational social science. His dissertation at Syracuse University (advisor Dr. Elizabeth D. Liddy) explored an innovative ranking method that weighted the retrieved results by leveraging dynamic community interests. His recent research is focusing on AI explainability/trustworthiness, natural language generation via deep learning, cybercrime/security, and human-centric data heterogeneity. While active in academia, his research also extends to industry, e.g., he was senior consultant and NLP research director at Alibaba DAMO Academy and led a number of prestigious projects the most cutting-edge and market-driven topics. I'm actively looking for PhD students with good experience in NLP and/or deep learning. Office Unity Hall, #362 Phone +1 (508) 8315000 x5911 Scholarly Work [Neurocomputing] Harvest Shopping Advice: Neural Question Generation from Multiple Information Sources in E-Commerce. 2020 [Scientometrics] A Literature Review of Citation Recommendation: From Textual Content to Enriched Context. 2020 [Data and Information Management] Smartphone and Tablet Application (App) Life Cycle Characterization via Apple App Store Rank. 2020 [BMC bioinformatics] edge2vec: Representation learning using edge semantics for biomedical knowledge discovery. 2019 [PloS one] Analyzing cross-college course enrollments via contextual graph mining. 2017 [IEEE S&P] Bookworm Game: Automatic Discovery of LTE Vulnerabilities Through Documentation Analysis. 2021 Load More News Chev Right Icon of hollow arrow pointing right Arrow Right Icon of arrow pointing right SEE MORE NEWS ABOUT Xiaozhong Liu WPI Selected as Key Partner in National Cybersecurity and AI Training Initiative to Advance U.S. Automotive Innovation August 13, 2025 LISTEN: Play Button Icon of a play button Pause Icon of pause button 00:00 | 05:23 Your browser does not support the audio element. WPI Welcomes More Than 30 New Faculty Members December 07, 2021 Media Coverage Chev Right Icon of hollow arrow pointing right Arrow Right Icon of arrow pointing right See More Media Coverage Lifewire How ChatGPT's new memory feature can help you get things done faster A new ChatGPT feature will let the platform remember conversations. Computer science professor Xiaozhong Liu says that could offer users a more personalized experience.",
  "content_length": 4230,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:53"
}