{
  "name": "Xiaobu Yuan",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1032/dr-xiaobu-yuan",
  "status": "success",
  "content": "Dr. Xiaobu Yuan | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Xiaobu Yuan Dr. Xiaobu Yuan Professor 519-253-3000 ext. 3793 xyuan@uwindsor.ca Office: 8104 LT Education: PhD, University of Alberta, Canada (1993) MSc, Institute of Computing Technology, Chinese Academy of Sciences (1984) BSc, University of Science and Technology of China (1982) Research Interests: Virtual Reality Software Product Line Engineering Service-Oriented Architecture Integration of Human and Computer Intelligence Professional Affiliations: Senior member, Institute of Electrical and Electronics Engineering (IEEE) Selected Publications: Yuan, X., Collaborative Planning of Assembly Sequences with Joint Intelligence, Proc. 2011 IEEE International Conference on Robotics and Automation, pp. 134-140, 2011. X. Yuan, An Approach to Integrating Emotion in Dialogue Management, Lecture Notes in Computer Science, 9142(3):297-308, 2015. X. Yuan and S. Tripathi, An Approach of Dynamically Combining Ontologies for Interactive Requirements Elicitation, Proc. 7th IEEE International Conference on Software Engineering and Service Science, pp.11-16, 2016. X. Yuan, M. Kaler, and V. Mulpuri, Personalized Visualization Based upon Wavelet Transform for Interactive Software Customization, Lecture Notes in Computer Science, Vol. 10358, pp. 361-375, 2017 share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 3976,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:21"
}