{
  "name": "Xiaodong Gu 0002",
  "homepage": "https://guxd.github.io",
  "status": "success",
  "content": "Xiaodong GU's Homepage Xiaodong GU Associate Professor School of Computer Science, Shanghai Jiao Tong University Contact: Room 1208, Software Building, No.800 Dongchuan Road, Shanghai, China Email: Research Interest: My research focuses on large language models for natural and programming languages. I develop efficient machine learning methodologies for software code. My research topics are: Large Language Models Program Generation Intelligent Software Engineering Github Selected Publications [Full List] [Google Scholar] Anti-Adversarial Learning: Desensitizing Prompts for Large Language Models Xuan Li, Zhe Yin, Xiaodong Gu, and Beijun Shen In Proceedings of the 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026). Singapore, Jan 20 - 27, 2026. (CCF-A) [paper] From Code to Correctness: Closing the Last Mile of Code Generation with Hierarchical Debugging Yuling Shi, Songsong Wang, Chengcheng Wan, Min Wang and Xiaodong Gu* In Proceedings of the 48th International Conference on Software Engineering (ICSE 2026). Rio De Janeiro, Brazil, April 12 - 18, 2026. (CCF-A) [paper] [code] LongCodeZip: Compress Long Context for Code Language Models Yuling Shi, Yichun Qian, Hongyu Zhang, Beijun Shen, Xiaodong Gu* In Proceedings of the 40th International Conference on Automated Software Engineering (ASE 2025), Seoul, Korea, Nov. 16-20, 2025 (CCF-A) [paper] [code] Transplant Then Regenerate: A New Paradigm for Text Data Augmentation Guangzhan Wang, Hongyu Zhang, Beijun Shen and Xiaodong Gu* In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025). Suzhou, China, Nov 5 - 9, 2025. (CCF-B) [paper] [code] LastingBench: Defend Benchmarks Against Knowledge Leakage Yixiong Fang, Tianran Sun, Yuling Shi, Min Wang and Xiaodong Gu* In Findings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025 Findings). Suzhou, China, Nov 5 - 9, 2025. (CCF-B) [paper] [code] Between Lines of Code: Unraveling the Distinct Patterns of Machine and Human Programmers Yuling Shi, Hongyu Zhang, Chengcheng Wan and Xiaodong Gu* In Proceedings of the 47th International Conference on Software Engineering (ICSE 2025). Ottawa, Ontario, Canada, April 27 - May 3, 2025. (CCF-A) [paper] [code] [bibtex] On the Effectiveness of Large Language Models in Domain-Specific Code Generation Xiaodong Gu*, Meng Chen, Yalan Lin, Yuhan Hu, Hongyu Zhang, Chengcheng Wan, Zhao Wei, Yong Xu, Juhong Wang ACM Transactions on Software Engineering and Methodology (TOSEM 2024) (CCF-A, ESI Highly Citated Paper) [paper] How Effectively Do Code Language Models Understand Poor-Readability Code? Chao Hu, Yitian Chai, Hao Zhou, Fandong Meng, Jie Zhou and Xiaodong Gu* In Proceedings of the 39th ACM/IEEE International Conference on Automated Software Engineering (ASE 2024). Sacramento, California, United States, Oct 27 - Nov 1, 2024. (CCF-A) [paper] [code] [bibtex] VarGAN: Adversarial Learning of Variable Semantic Representations Yalan Lin, Chengcheng Wan, Shuwen Bai, Xiaodong Gu* IEEE Transactions on Software Engineering (TSE 2024) (CCF-A) [paper] [code] On the Evaluation of Neural Code Translation: Taxonomy and Benchmark Mingsheng Jiao, Tingrui Yu, Xuan Li, Guanjie Qiu, Xiaodong Gu*, Beijun Shen In Proceedings of the 38th International Conference on Automated Software Engineering (ASE 2023), Kirchberg, Luxembourg, Sept. 11-15, 2023 (CCF-A) [paper] [slides] [code] InfeRE: Step-by-Step Regex Generation via Chain of Inference Shuai Zhang, Xiaodong Gu, Yuting Chen, Beijun Shen In Proceedings of the 38th International Conference on Automated Software Engineering (ASE 2023), Kirchberg, Luxembourg, Sept. 11-15, 2023 (CCF-A) [paper] [slides] [code] [bibtex] Self-Supervised Query Reformulation for Code Search Yuetian Mao, Chengcheng Wan, Yuze Jiang, Xiaodong Gu* In Proceedings of the 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2023), San Francisco, California, United States, Dec 3-9, 2023 (CCF-A) [paper] [slides] [code] [bibtex] Diet Code Is Healthy: Simplifying Programs for Pre-Trained Models of Code Zhaowei Zhang, Hongyu Zhang, Beijun Shen, Xiaodong Gu* In Proceedings of the 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2022), Singapore, Nov 14-18, 2022 (CCF-A) [paper] [slides] [code] [bibtex] Cross-Domain Deep Code Search with Meta Learning Yitian Chai, Hongyu Zhang, Beijun Shen and Xiaodong Gu* In Proceedings of the 44th International Conference on Software Engineering (ICSE 2022) (CCF-A) [paper] [code] [slides] [bibtex] Teaching SE3332 Machine Learning (Fall 2020, 2021, 2022, 2023 Spring 2025) SE2324 Mathematic Foundation for Computer Science (Spring 2021, 2022, 2023, 2024, 2025) CS0001W-01 Large Language Model: Foundations and Practice (Fall 2025) Students I am grateful to the wonderful students I have been collaborating with Yuling SHI (PhD, 2022-) Chao HU (Master, 2023-) Guangzhan Wang (Master, 2023-) Wenhao Zeng (Master, 2024-) Yongpan Wang (PhD, 2024-) Han LI (Master, 2024-) Haotian LIN (Master, 2025-) Mengfan LI (Master, 2025-) Mengjie Zhuang (Master, 2025-) Alumni Zhaowei Zhang (Master 2023, Unity), Yitian CHAI (Master 2024, Tencent), Meng CHEN (Master 2024, Xiaohongshu), Yalan Lin (MS 2025, Fujian BigData Group) Grants 上海自然科学基金面上项目，面向复杂场景的程序生成技术，2025.7-2028.6，主持 CCF-华为胡杨林基金，针对问题单解决的Multi-Agent能力提升,2025.1.1-2025.7.31，主持 ，场景知识增强的Java代码自动生成技术，2024.9.1-2025.2.25，主持 宁德时代，基于大模型的软件需求标准化技术，2024.6.1-2025.5.31，主持 宁德时代，基于大模型的测试用例转换技术，2024.6.1-2025.1.31，主持 宁德时代，基于大模型的变量模糊搜索技术，2024.6.1-2025.1.31，主持 国家重点研发计划，面向场景计算的低代码开发方法与环境，2023.12-2026.12，参与 中国航空无线电电子研究所，民机软件研制过程辅助系统，2022.12-2026.6，主持 ，基于大模型的恶意代码样本生成，2023.5.1-2024.4.31，主持 CCF-腾讯犀牛鸟基金，特定领域程序自动生成，2022.10.1-2023.12.31，主持 国家自然科学基金，基于小样本学习的跨语言程序自动生成，2022.1.1-2024.12.31，主持 Services Program Committee ASE (2025), ACL (2023), EMNLP (2021, 2022, 2023), COLING (2020, 2022, 2024), IJCAI (2023), EACL (2023) Reviewer Board Automated Software Engineering (AUSE), Empirical Software Engineering (EMSE) Journal Reviewer TSE, TOSEM, EMSE, IST, JSS, FCS",
  "content_length": 6150,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:22"
}