{
  "name": "Xiaoning Liu 0002",
  "homepage": "https://maggichk.github.io",
  "status": "success",
  "content": "Maggie's Homepage Xiaoning (Maggie) Liu Lecturer School of Computing Technologies RMIT University Email: xiaoning.liu@rmit.edu.au Home / Research / Teaching / Service / People / Talk / Award I am a Lecturer (US Assistant Professor equivalent) at the School of Computing Technologies, RMIT University. I earned my Ph.D. degree in Computer Science from RMIT University under the supervision of Prof. Xun Yi. My research focuses on the design, analysis, and fielding of privacy-enhancing technologies to address data privacy and security issues. [RA/MPhil/Ph.D. Positions Available] I am looking for self-motivated students in AI Privacy and Security, Secure Multi-Party Computation. If interested, please email me your CV and transcripts. [Jul 25] Our paper \"Unsupervised Backdoor Detection and Mitigation for Spiking Neural Networks\" has been accepted by RAID'25. Congrats, Jiachen! [Dec 24] Our paper \"SIGuard: Guarding Secure Inference with Post Data Privacy\" has been accepted by NDSS'25. Congrats, Xinqian! [Dec 24] I have been awarded the sole STEM College Learning and Teaching Award for Excellence – Early Career Educator 2024 [Oct 21] Our paper \"MediSC: Towards Secure and Lightweight Deep Learning as a Medical Diagnostic Service\" has received the Best Paper Award of ESORICS 2021. Research My current research focuses on secure multi-party computation and its applications in privacy-preserving machine learning. My goal is to build impactful work that is expected to push forward the deployment of PPML on practical usages like medical diagnostics and mobile image classification. My design philosophy is: Devising lightweight and fundamental secure computation protocols resort to advanced cryptographic techniques. I am particularly interested in secure multiparty computation, function secret sharing, zero knowledge proof. Building secure and practical PPML systems that harness the insights from computer systems, cryptography, machine learning. I conduct interdisciplinary research empowering versatile real-world service scenarios, like MLaaS (MediSC, CryptMed, OblivGNN), outsourced cloud computation (Sonic, EncSIM), mobile-edge computing (Leia), collaborative computation over distributed data ([ESORICS'19], [TDSC'20]). Useful Links MPC Papers, Tutorials, and Frameworks PPML-Resource: https://github.com/Ye-D/PPML-Resource Awesome-ML-Security-and-Privacy-Papers: https://github.com/gnipping/Awesome-ML-SP-Papers Quality Research Quality Research in Affordable Ways by Dr. Qiang Yan: http://www.mysmu.edu/phdis2008/qiang.yan.2008/Doc/Quality%20Research%20in%20Affordable%20Way.pdf Scientific Writing Skills by Prof. Guanrong Chen: http://www.ee.cityu.edu.hk/~gchen/pdf/Writing.pdf Computer Security Conference Ranking and Statistic http://jianying.space/conference-ranking.html http://faculty.cs.tamu.edu/guofei/sec_conf_stat.htm Security and Privacy Conference Deadline https://sec-deadlines.github.io/ Last update: 2022/08",
  "content_length": 2945,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:36"
}