{
  "name": "Xiaohong Liu 0001",
  "homepage": "https://jhc.sjtu.edu.cn/~xiaohongliu",
  "status": "success",
  "content": "Xiaohong Liu Xiaohong Liu åç¬å® ä¸æµ·å¸é¢åäººæï¼æµ·å¤ï¼Associate Professor at SJTU, Full-time Supervisor at SII Follow Shanghai, China Email GitHub Google Scholar Iâm currently an associate professor at John Hopcroft Center (JHC) for Computer Science of Shanghai Jiao Tong University (SJTU) and a full-time supervisor at Shanghai Innovation Institute. My research interest mainly lies on Computer Vision and Multimedia. I received my Ph.D. degree in Department of Electrical & Computer Engineering at McMaster University, supervised by Prof. Jun Chen. During the Ph.D., I visited Computer Vision Lab at Michigan State University adviced by Prof. Xiaoming Liu. I was selected as the Microsoft Research Asia StarTrack Scholar in 2024. I received the Shanghai Pujiang Talent Program in 2022, the Chinese Government Award for Outstanding Self-financed Students Abroad in 2021, a Canada Graduate Scholarship from Natural Sciences and Engineering Research Council of Canada (NSERC) in 2021, and a Borealis AI Fellowship in 2020. My research has been supported by the Young Scientists Fund of the National Natural Science Foundation of China, and many big tech companies. My research interests mainly lie in the fields of computer vision and multimedia, and particularly in: Image/Video Restoration and Enhancement Image/Video Generation and Editing Image/Video Quality Assessment AI for Healthcare Lab Website: SJTU Multimedia Lab ð¯ Prospective Students I am always looking for enthusiastic and self-motivated students to work together on computer vision and mutimedia related topics. Please email me with your CV and transcripts if you are interested. ð¥ News [2025/9] Â Four papers are accepted by AAAI 2026 (Two orals!) [2025/9] Â  Three papers are accepted by NeurIPS 2025 [2025/8] Â  Five papers are accepted by ACMMM 2025 [2025/6] Â  Six papers are accepted by ICCV 2025 [2025/5] Â  One paper is accepted by ACL 2025 [2025/2] Â  Eight papers are accepted by CVPR 2025 (Two orals! 3.3% of the accepted papers, and two spotlights! 13.5% of the accepted papers) [2025/1] Â  One paper is accepted by ICLR 2025 [2024/12] Â  One paper is accepted by AAAI 2025 [2024/9] Â  Four papers are accepted by NeurIPS 2024 [2024/7] Â  Six papers are accepted by ACM MM 2024 (Three orals! One oral paper was selected as Best Paper Nominees!) [2024/7] Â  Three papers are accepted by ECCV 2024 (One oral) [2024/4] Â  One paper is accepted by IJCAI 2024 [2024/2] Â  Two papers are accepted by CVPR 2024 [2023/7] Â  Three papers are accepted by ACM MM 2023 (Two orals!) [2023/7] Â  One paper is accepted by ICCV 2023 [2023/3] Â  One paper is accepted by CVPR 2023 [2022/9] Â  One paper is accepted by NeurIPS 2022 [2022/3] Â  One paper is accepted by CVPR 2022 ð Selected Publications * Equal contribution, † Corresponding author More on Publications page [ICCV] Lumina-Image 2.0: A Unified and Efficient Image Generative Framework Qi Qin*, Le Zhuo*, Yi Xin*, Ruoyi Du*, Zhen Li*, Bin Fu*, Yiting Lu*, Jiakang Yuan, Xinyue Li, Dongyang Liu, Xiangyang Zhu, Manyuan Zhang, Will Beddow, Erwann Millon, Victor Perez, Wenhai Wang, Conghui He, Bo Zhang, Xiaohong Liu, Hongsheng Li, Yu Qiao, Chang Xu, Peng Gao† IEEE International Conference on Computer Vision (ICCV), 2025. [Paper] [Code] [ICCV] TR-PTS: Task-Relevant Parameter and Token Selection for Efficient Tuning Siqi Luo*, Haoran Yang*, Yi Xin*, Mingyang Yi, Guangyang Wu, Guangtao Zhai, Xiaohong Liu† IEEE International Conference on Computer Vision (ICCV), 2025. [Paper] [Code] [ICCV] Who is a Better Talker: Subjective and Objective Quality Assessment for AI-Generated Talking Heads Yingjie Zhou, Jiezhang Cao†, Zicheng Zhang, Farong Wen, Yanwei Jiang, Jun Jia, Xiaohong Liu†, Xiongkuo Min†, Guangtao Zhai† IEEE International Conference on Computer Vision (ICCV), 2025. [Paper] [Code] [CVPR Oral] Q-Eval-100K: Evaluating Visual Quality and Alignment Level for Text-to-Vision Content Zicheng Zhang*, Tengchuan Kou*, Shushi Wang, Chunyi Li, Wei Sun, Wei Wang, Xiaoyu Li, Zongyu Wang, Xuezhi Cao, Xiongkuo Min, Xiaohong Liu†, Guangtao Zhai IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Paper] [Code] [CVPR Oral] Rethinking Vision-Language Model in Face Forensics: Multi-Modal Interpretable Forged Face Detector Xiao Guo, Xiufeng Song, Yue Zhang, Xiaohong Liu, Xiaoming Liu IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Paper] [Code] [CVPR Spotlight] Samba: A Unified Mamba-based Framework for General Salient Object Detection Jiahao He, Keren Fu†, Xiaohong Liu, Qijun Zhao IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Paper] [Code] [CVPR Spotlight] Image Quality Assessment: From Human to Machine Preference Chunyi Li*, Yuan Tia*, Xiaoyue Ling*, Zicheng Zhang, Haodong Duan, Haoning Wu, Ziheng Jia, Xiaohong Liu, Xiongkuo Min, Guo Lu†, Weisi Lin, Guangtao Zhai† IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Paper] [Code] [CVPR] Learning Hazing to Dehazing: Towards Realistic Haze Generation for Real-World Image Dehazing Ruiyi Wang, Yushuo Zheng, Zicheng Zhang, Chunyi Li, Shuaicheng Liu, Guangtao Zhai, Xiaohong Liu† IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025. [Paper] [Code] [ECCV] GLARE: Low Light Image Enhancement via Generative Latent Feature based Codebook Retrieval Han Zhou*, Wei Dong*, Xiaohong Liu†, Shuaicheng Liu, Xiongkuo Min, Guangtao Zhai, Jun Chen† European Conference on Computer Vision (ECCV), 2024. [Paper] [Code] [ECCV] LightenDiffusion: Unsupervised Low-Light Image Enhancement with Latent-Retinex Diffusion Models Hai Jiang, Ao Luo, Xiaohong Liu, Songchen Han, Shuaicheng Liu† European Conference on Computer Vision (ECCV), 2024. [Paper] [Code] [ECCV Oral] Towards Open-ended Visual Quality Comparison Haoning Wu*, Hanwei Zhu*, Zicheng Zhang*, Erli Zhang, Chaofeng Chen, Liang Liao, Chunyi Li, Annan Wang, Wenxiu Sun, Qiong Yan, Xiaohong Liu, Guangtao Zhai, Shiqi Wang, Weisi Lin European Conference on Computer Vision (ECCV), 2024. [Paper] [Model] [Code] [CVPR] Perception-Oriented Video Frame Interpolation via Asymmetric Blending Guangyang Wu, Xin Tao, Changlin Li, Wenyi Wang, Xiaohong Liu†, Qingqing Zheng† IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Paper] [Project Page] [Code] [CVPR] Text2QR: Harmonizing Aesthetic Customization and Scanning Robustness for Text-Guided QR Code Generation Guangyang Wu, Xiaohong Liu†, Jun Jia, Xuehao Cui, Guangtao Zhai IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Paper] [Project Page] [Code] [ICCV] AccFlow: Backward Accumulation for Long-Range Optical Flow Guangyang Wu, Xiaohong Liu†, Kunming Luo*, Xi Liu*, Qingqing Zheng, Shuaicheng Liu, Xinyang Jiang, Guangtao Zhai, Wenyi Wang† IEEE/CVF International Conference on Computer Vision (ICCV), 2023. [Paper] [Code] [CVPR] Hierarchical Fine-Grained Image Forgery Detection and Localization Xiao Guo, Xiaohong Liu, Zhiyuan Ren, Steven Grosz, Iacopo Masi, Xiaoming Liu IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2023. [Paper] [Code] [CVPR] Video Frame Interpolation Transformer Zhihao Shi*, Xiangyu Xu*, Xiaohong Liu, Jun Chen, and Ming-Hsuan Yang IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2022. [Paper] [Code] [ICCV] GridDehazeNet: Attention based Multi-Scale Network for Image Dehazing Xiaohong Liu*, Yongrui Ma*, Zhihao Shi, and Jun Chen IEEE/CVF International Conference on Computer Vision (ICCV), 2019. [Paper] [Code] Services Professional Service: AAAI 2025 Area Chair NTIRE 2025 XGC Quality Assessment Challenge Organizer ICME 2025 Area Chair ICIP 2024 Session Chair ICICSP 2024 Special Session Chair NTIRE 2024 Quality Assessment of AI-Generated Content Challenge Organizer Serve as an Associate Editor of the ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) from Jan. 2024 NTIRE 2023 Quality Assessment of Video Enhancement Challenge Organizer IC 2023 AI for Medicine Area Organization Committee CGI 2023 Workshops/Special Session Chair VRIH Special issue: 3D Medical Image Processing and Analysis Organizer Reviewer: Journal: IEEE TPAMI, IEEE TIP, IEEE TIFS, IEEE TMM, IEEE TCSVT, IEEE TITS, IEEE TBC, Pattern Recognition Conference: CVPR, ECCV, ICCV, NeurIPS, ICML, ICLR, AAAI, IJCAI Sponsors: Our research is supported by:",
  "content_length": 8422,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:26"
}