{
  "name": "Xiaoming Fu 0001",
  "homepage": "http://www.net.informatik.uni-goettingen.de/?q=people/prof-dr-xiaoming-fu",
  "status": "success",
  "content": "Computer Networks Group | NET Jump to Navigation Menu Search News People Research Publication Courses Positions Events About Us Log in Computer Networks Group You are hereHome » People » Prof. Dr. Xiaoming Fu Prof. Dr. Xiaoming Fu : Head of Group Email: fu@informatik.uni-goettingen.de Phone: +49 551 39-172023 Office: 3.108 Biography: Homepage in EnglishHomepage in ChineseCurriculum Vitae I am a Chair Professor of Computer Science at the Institute of Computer Science, University of Goettingen and leading the Computer Networks Group. I received my bachelor (1994) and master (with distinction, 1997) degrees from Northeastern University, Shenyang, China, and my Ph.D. (2000) degree in Computer Science from Tsinghua University, Beijing, China (supervisor: Professor Yaoxue Zhang). Prior to joining Goettingen, I worked with Prof. Dr.-Ing. Adam Wolisz as a research fellow at the Telecommunications Networks (TKN) group, Technical University Berlin  until September 2002. Between 2003 and 2005 I also served in the European Telecommunications Standards Institute (ETSI) as an Expert in Specialist Task Forces in Internet Protocol (Version 6) Testing. I was/am a visiting scholar at the University of Cambridge (host: Prof. Jon Crowcroft, in 2005 and 2007), Nanjing University (hosts: Prof. Wenzhong Li and Prof. Sanglu Lu, since 2014), Hong Kong Polytechnic University (host: Prof. Jiannong Cao, in 2015), UPMC/Sorbanne University (host: Prof. Stefano Secci, in 2014 and 2016), University of Oregon (host: Prof. Jun Li, in 2020) and University of Sydney (host: Prof. Branka Vucetic, since 2022), a DAAD visiting professor at Columbia University (host: Prof. Henning Schulzrinne, in 2008 and 2009), Uppsala University (host: Prof. Edith Ngai, in 2014 and 2015), Victoria University (host: Prof. Hua Wang and Prof. Yanchun Zhang, in 2018 and 2019), Deakin University (host: Prof. Jianxin Li, in 2023 and 2024) and Hong Kong Baptist University (host: Prof. Yupeng Li, in 2023 and 2024), a Fulbright Scholar Visiting Professor at UCLA (hosts: Prof. Lixia Zhang and Prof. Mario Gerla, in academic year 2009/2010), and a ChangJiang Scholar Visiting Professor at Tsinghua University. I served as Secretary (2008-2010) and Vice Chair (2010-2012) of the Technical Committee on Computer Communications (TCCC), IEEE Communications Society (ComSoc), and  as Chair (2011-2013) of the Internet Technical Committee of the IEEE ComSoc and Internet Society (ISOC). I am a fellow and distinguished lecturer of IEEE, a fellow of IET and Academia Europaea,  a distinguished member of ACM and a member of GI. Publications {REINFORCE:} achieving efficient failure resiliency for network function virtualization based servicesA Cross-Platform Consumer Behavior Analysis of Large-Scale Mobile Shopping DataNFVnice: Dynamic Backpressure and Scheduling for {NFV} Service ChainsEfficient Multi-User Computation Offloading for Mobile-Edge Cloud Computing{D2D} Fogging: An Energy-Efficient and Incentive-Aware Task Offloading Framework via Network-assisted {D2D} CollaborationTriadic Closure Pattern Analysis and Prediction in Social Networks{SOUP:} an online social network by the people, for the peopleDeployment of Unmanned Aerial Vehicles for Anisotropic Monitoring TasksMulti-objective data placement for multi-cloud socially aware servicesBotFinder: finding bots in network traffic without deep packet inspection{COPSS:} An Efficient Content Oriented Publish/Subscribe SystemScaling Microblogging Services with Divergent Traffic DemandsEnd-to-End Versus Hop-by-Hop Soft State Refresh for Multi-hop Signaling SystemsOverhead and performance study of the general internet signaling transport {(GIST)} protocolProbe-Aided MulTCP: an aggregate congestion control mechanismA Survey on Virtual Machine Migration: Challenges, Techniques, and Open IssuesDeepScan: Exploiting Deep Learning for Malicious Account Detection in Location-Based Social NetworksADA: Adaptive Deep Log Anomaly DetectorVSiM: Improving QoE Fairness for Video Streaming in Mobile EnvironmentsCore decomposition and maintenance in weighted graphTowards Exploiting Stakeholder Resources for Data-Driven Resilient Hazard ManagementAlleviating Educational Inequality in Math with the Aid of Online Shadow Education - The impact of equal access and equal quality mechanismsAccDecoder: Accelerated Decoding for Neural-enhanced Video AnalyticsLeveraging Deep Reinforcement Learning with Attention Mechanism for Virtual Network Function Placement and Routing Courses Taught Computer Networks Seminar on Internet Technologies Computer Networks Group Georg-August-Universität Göttingen Institut für Informatik Computer Networks Group Goldschmidtstr. 7 37077 Göttingen Germany Phone: +49 551 39-172032 Fax: +49 551 39-14416 RSS Facebook About Imprint",
  "content_length": 4783,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:36"
}