{
  "name": "Xiaofen Lu",
  "homepage": "http://cse.sustech.edu.cn/faculty/~luxf",
  "status": "success",
  "content": "Xiaofen Lu's Homepage Research Interests My research interesets lie in the areas of Evolutionary Computation and Machine Learning with emphasis on the following topics: Dynamic Optimization Co-evolutionary Optimization Optimization with Costly Function Evaluation Multi-disciplinary Design Optimization Interplay between Machine Learning and Evolutionary Computation Experience 2020-2021, Research Assistant Professor, Southern University of Science and Technology 2018-2019, Research Associate, Southern University of Science and Technology 2016-2018, Visiting Student, Southern University of Science and Technology 2013-2016, EGN Student, Honda Research Institute Europe Education 2013-2018, Computer Science, University of Birmingham, Ph.D 2011-2017, Applied Computer Science and Technology, University of Science and Technology of China, Ph.D 2009-2011, Applied Computer Science and Technology, University of Science and Technology of China, Master 2005-2009, Computer Science and Technology, University of Science and Technology of China, Bachelor Publications [1] Xiaofen Lu, Ke Tang, Stefan Menzel, Xin Yao, \"Dynamic Optimization in Fast-Changing Environments via Offline Evolutionary Search\", IEEE Transactions on Evolutionary Computation, 2021, DOI:10.1109/TEVC.2021.3104343. [2] Chang Cao, Xiaofen Lu*, Yachen Li, Junda Zhu, Ke Tang, \"The Performance Effect of Model Accuracy on Classification-Assisted Evolutionary Algorithms\", the IEEE Congress on Evolutionary Computation, Kraków, Poland, 28th June-1st July, 2021, pp.1527-1536. [3] Bo Yuan, Xiaofen Lu, Ke Tang, Xin Yao, \"Cooperative Coevolution-based Design Space Exploration for Multi-mode Dataflow Mapping\", ACM Transactions on Embedded Computing Systems, 20(3):1-25, 2021. [4] Xiaofen Lu, Ke Tang, Stefan Menzel, Xin Yao, \"A Competitive Co-evolutionary Optimization Method for the Dynamic Vehicle Routing Problem\", IEEE Symposium Series on Computational Intelligence, Canberra, ACT, Australia, 1st-4th December, 2020, pp. 305-312. [5] Xiaofen Lu, Ke Tang, Stefan Menzel, Xin Yao, \"Competitive Coevolution as an Adversarial Approach to Dynamic Optimization\", https://arxiv.org/abs/1907.13529 [6] Haohao, Jinyuan Zhang, Xiaofen Lu, AiminZhou, \"Binary Relation Learning and Classifying for Preselection in Evolutionary Algorithms\", IEEE Transactions on Evolutionary Computation, 24(6):1125-1139, 2020. [7] Xiaofen Lu, Tao Sun, and Ke Tang, \"Evolutionary optimization with hierarchical surrogates,\" Swarm and Evolutionary Computation, 47:21-32, 2019. [8] Xiaofen Lu, Stefan Menzel, Ke Tang, and Xin Yao, \"Cooperative co-evolution-based design optimization: A concurrent engineering perspective,\" IEEE Transactions on Evolutionary Computation, vol. 22, no. 2, pp. 173–188, 2018. [9] Guiying Li, Chao Qian, Chunhui Jiang, Xiaofen Lu, and Ke Tang, \"Optimization based layer-wise magnitudebased pruning for dnn compression.\" in Proceedings of the 2018 International Joint Conference on Artificial Intelligence (IJCAI'18), Stockholm, Sweden, 13th-19th July, 2018, pp. 2383–2389. [10] Yaoyao He, Rui Liu, Haiyan Li, Shuo Wang, Xiaofen Lu, \"Short-term power load probability density forecasting method using kernel-based support vector quantile regression and Copula theory, Applied Energy, vol. 185, part 1, pp. 254-266, 2017. [11] Xiaofen Lu, Ke Tang, and Xin Yao, \"Speciated evolutionary algorithm for dynamic constrained optimisation,\" in Proceedings of the 14th International Conference on Parallel Problem Solving from Nature (PPSN XIV), Edinburgh, UK, 17th-21st Sept., 2016, Lecture Notes in Computer Science, Springer, vol. 9921, pp. 203–213.. [12] Peng Yang, Ke Tang, and Xiaofen Lu, \"Improving estimation of distribution algorithm on multimodal problems by detecting promising areas,\" IEEE Transactions on Cybernetics, vol. 45, no. 8, pp. 1438–1449, 2015. [13] Xiaofen Lu, Ke Tang, Bernhard Sendhoff, and Xin Yao, \"A new self-adaptation scheme for differential evolution,\" Neurocomputing, vol. 146, pp. 2–16, 2014. [14] Xiaofen Lu, Ke Tang, Bernhard Sendhoff, and Xin Yao, \"A review of concurrent optimisation methods,\" International Journal of Bio-Inspired Computation, vol. 6, no. 1, pp. 22–31, 2014. [15] Xiaofen Lu, Stefan Menzel, Ke Tang, and Xin Yao, \"The performance effects of interaction frequency in parallel cooperative coevolution,\" in Proceedings of the 2014 International Conference on Simulated Evolution and Learning (SEAL'14), Dunedin, New Zealand, 15th-18th December, 2014, Springer, pp. 82–93. [16] Xiaofen Lu and Ke Tang, \"Classification-and regression-assisted differential evolution for computationally expensive problems,\" Journal of Computer Science and Technology, vol. 27, no. 5, pp.1024–1034, 2012. [17]Xiaofen Lu, Ke Tang, and Xin Yao, \"Classification-assisted differential evolution for computationally expensive problems,\" in Proceedings of the 2011 IEEE Congress of Evolutionary Computation (CEC'11), New Orleans, LA, USA, 5th-8th June, 2011, 2011, pp. 1986–1993. [18]Xiaofen Lu, Ke Tang, and Xin Yao„ \"Evolving neural networks with maximum auc for imbalanced data classification,\" in Proceedings of the 2010 International Conference on Hybrid Artificial Intelligence Systems (HAIS'10), San Sebastián, Spain, 23th-25th June, 2010, Springer, pp. 335–342. Projects Offline Computation based High-Speed Dynamic Evolutionary Optimization Algorithms, Sponsor: National Natural Science Foundation of China (NSFC), Youth Progam, Duration: 2020/01-2022/12, PI The Interplay between Dynamic Constrained Optimisation and Co-evolution for Evolvable Cooperative System, Sponsor: Honda Research Institute, Duration: 2019/03-2020/02 Guangdong Provincial Key Laboratory of Brain-inspired Intelligent Computation, Sponsor: Guangdong Provincial Department of Science and Technology, Duration: 2020/01-2022/12, Key Member Professional Activities Co-chair of Special Session on \"Meta-Modeling and Surrogate Model\" at 2021 IEEE Congress on Evolutionary Compuation, Online, 30th June 2021. \"Offline Computation based Evolutionary Dynamic Optimization\", Youth Academic Salon, School of Computer Science and Technology, University of Science and Technology, Online, 08th May 2021. \"A Competitive Co-evolutionary Optimization Method for the Dynamic Vehicle Routing Problem\", Conference Report, 2020 IEEE Symposium Series on Computational Intelligence, Online, 2nd Dec. 2020. \"Cooperative co-evolution based design optimization: A concurrent engineering perspective\", Report, SUSTech-VUW Joint Workshop on Evolutionary Optimization and Learning, 10th Nov. 2017. \"Speciated evolutionary algorithm for dynamic constrained optimisation\", Conference Report, PPSN 2016, Edinburgh, United Kingdom, 20th Sept. 2016. \"Cooperative co-evolution based design optimization in concurrent engineering\", Report, Honda Research Institute Europe, Offenbach am Main, Germany, 22nd June 2015.",
  "content_length": 6870,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:24"
}