{
  "name": "Xiao Wang 0036",
  "homepage": "https://xiiaowang.github.io",
  "status": "success",
  "content": "X W Xiao Wang, 王皛(晓) Welcome About I am an (non-tenured) associate professor of Institute for Theoretical Computer Science at SUFE. Before joining SUFE, I did my postdoc at SUTD under supervision of Georgios Piliouras and Ioannis Panageas. I got my B.S. from China University of Geosciences (Beijing) and Ph.D in Mathematics from University at Buffalo, advised by Mohan Ramachandran. Contact Email: wangxiao@sufe.edu.cn Address: Shanghai University of Finance and Economics 100 Wudong Road, Shanghai, China, 200433. Research I am working on machine learning, optimization on manifolds, and game theory. Teaching Fall 2025: Optimization on Manifolds (Graduate). 1:Curves and Surfaces    2:Differentiable Manifolds and Mappings    3:Riemannian Geometry    4:Simplicial and Persistent Homology    5:Riemannian Gradient and Newton's Methods Spring 2025: Linear Algebra (Pilot class). 1:Vectors and Matrices    2:Linear Transformations and Matrix Algebra    3:Theory of Linear Systems    4:Vector Spaces and Dimension    5:Change of Basis and Orthogonality    6:Determinant    7:Eigenvalues and Eigenvectors    8:Quadratic Forms    9:Difference and Differential Equations Publication On Perturbed Natural Adaptive Gradient Descent and its Applications in Portfolio Optimization with Y. Cai, H. Liang, Y. Qiu, T. Xie, and Z. Zhao, ECAI 2025. Continuous-Time Analysis of Heavy Ball Momentum in Min-Max Games with Yi Feng, Kaito Fujii, Stratis Skoulakis, and Volkan Cevher, ICML 2025. Langevin Multiplicative Weights Update with Applications in Portfolio Management with Yi Feng and Tian Xie, AAAI 2025. Prediction Accuracy of Learning in Games : Follow-the-Regularized-Leader meets Heisenberg with Yi Feng and Georgios Piliouras, ICML 2024. Riemannian Accelerated Zeroth-order Algorithm: Improved Robustness and Lower Query Complexity with Chang He, Zhaoye Pan and Bo Jiang, ICML 2024. Last-iterate Convergence Separation between Extra-gradient and Optimisim in Constrained Periodic Game with Yi Feng, Ping Li and Ioannis Panageas, UAI 2024. On the Last-iterate Convergence in Time-varying Zero-sum Games: Extra Gradient Succeeds where Optimism Fails with Yi Feng, Hu Fu, Qun Hu, Ping Li, Ioannis Panageas and Bo Peng, NeurIPS 2023. Embedding Surfaces by Optimizing Neural Networks with Prescribed Riemannian Metric and Beyond, with Yi Feng, Sizhe Li, and Ioannis Panageas, ICML 2023 Workshop Frontiers4LCD. Semi Bandit dynamics in Congestion Games: Convergence to Nash Equilibrium and No-Regret Guarantees, with Ioannis Panageas, Efstratios Panteleimon Skoulakis, Luca Viano and Volkan Cevher, ICML 2023 (Oral). AdaGrad Avoids Saddle Points, with Kimon Antonakopoulos, Panayotis Mertikopoulos and Georgios Piliouras, ICML 2022. (A mistake has been found, correction needed!) Accelerated Multiplicative Weights Update Avoids Saddle Points almost always, with Yi Feng and Ioannis Panageas, IJCAI 2022. Constants of Motion: The Antidote to Chaos in Optimization and Game Dynamics, with Georgios Piliouras, arXiv. Last iterate convergence in no-regret learning: constrained min-max optimization for convex-concave landscapes, with Qi Lei, Sai Ganesh Nagarajan and Ioannis Panageas, AISTATS 2021. Fast convergence of Langevin dynamics on manifold: Geodesics meet log-Sobolev, with Qi Lei and Ioannis Panageas, NeurIPS 2020. Convergence to second-order stationarity for non-negative matrix factorization: Provably and concurrently, with Ioannis Panageas, Stratis Skoulakis and Antonis Varvitsiotis, arXiv. Depth-width trade-offs for ReLU networks via Sharkovsky's theorem, with Vaggos Chatziafratis, Sai Ganesh Nagarajan and Ioannis Panageas, ICLR 2020 (spotlight), Video (Speaker: Ioannis Panageas, MiFODS Workshop, MIT, Jan 27-29, 2020). First-order methods almost always avoid saddle points: the case of vanishing stepsize, with Ioannis Panageas and Georgios Piliouras, NeurIPS 2019, Poster. Multiplicative weights update as a distributed constrained optimization algorithm: converges to second-order stationary points almost always, with Ioannis Panageas and Georgios Piliouras, ICML 2019, Poster, Slides (Speaker: Xiao Wang). Kazhdan's property (T) and structure for locally symmetric spaces, Submitted Ph.D Students Weiming Ou, Fall 2023-present Yi Feng, Fall 2021-Spring 2025, DDSA Postdoc Fellow at Danish Data Science Academy, Denmark Service Conference Review: STOC,SODA,AAAI,ICLR,ICML,NeurIPS,WINE,ISAAC,EC,AISTATS Journal Review: Applied Mathematics and Optimization",
  "content_length": 4466,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:14"
}