{
  "name": "Xiaodong Li 0008",
  "homepage": "https://fie.must.edu.mo/id-1444/person/view/id-541.html",
  "status": "success",
  "content": "創新工程學院 - 學院團隊 - 教研團隊 李曉東 教授 所在部門： 計算機科學與工程學院 聯繫電話： 8897 2195 辦公室： A214 電子信箱： xdli@must.edu.mo Prospective Master/PhD students with background in electrical/electronic engineering, Control plus strong capabilities in English writing/reading/speaking, are welcome to apply for graduate study. Also, diligence and perseverance are highly recognized qualities.Limited research assistant (RA) position with upto MOP12,500/month salary may be provided for competitive candidates. Academic QualificationPh.D., University of Victoria, Canada M.A.Sc., University of Victoria, CanadaB.Eng., Shanghai Jiao Tong University, China Teaching AreaCircuit AnalysisCircuit Analysis LabAnalog ElectronicsAnalog Electronics LabAdvanced Topics in Electronics Engineering Research AreaPower Electronics: high-frequency converter: topology, control and applications in renewable generation, transportation electrification Professional ServicesChair, IEEE Macau Section, 2022-2026 Working Experience2023-now: Assistant Dean, Faculty of Innovation Engineering2019-now: Program Coordinator, School of Computer Science and Engineering2009-now: Lecturer/Assistant Professor/Associate Professor/Professor, Macau University of Science and Technology2002-2009: Research Associate, University of Victoria, British Columbia, Canada1994-2001: Electrical Engineer, HuaDian HongWan Diesel Power Co., ZhuHai, China Academic Publication Citation Information:Google Scholar - https://scholar.google.com/citations?hl=en&user=Y428tq0AAAAJ&view_op=list_worksMUST Scholar Database --- https://scholar.must.edu.mo/scholar/100243 Academic Publication (selected)1.        S. Hu, C. Sun, R. Ding, X. Li, \"Sinusoidal-Ripple-Current Charging Modulation for Semi-Dual-Active-Bridge AC-DC Converter with Full Soft Switching and Power Factor Correction\", IEEE Transactions on Circuits and Systems--II: Express Briefs,71(1), 326-330, Jan. 2024, DOI: 10.1109/TCSII.2023.3303265.2.        D. Xu, H. Chen, X. Wang, V. Pires, J. Martins, A. Anuchin, X. Li, R. Palka, J. Gu, \"Coupling Analysis of Differential Power Processing-based PV system and its Decoupling Implementation of Synchronous MPPT Control\". IEEE Trans. on Industrial Electronics, 70(7), pp. 6973-6983 2023, doi:10.1109/TIE.2022.3201277.3.        S. Zhou, Y. Gong, X. Li, S. Hu and H. Chen, “Operation of a Semi Dual-bridge Resonant Converter with a Tunable Resonant Tank”, International Journal of Electronics and Communications, vol.152, July 2022,154261, https://doi.org/10.1016/j.aeue.2022.154261.4.        H. Chen, J. Liu, X. Wang, X. Li, M. Orabi, Y. Li, Y. Gong, N. Parspour, J. Zhang. \"A Novel Method to Suppress the Force Ripple of a Switched Reluctance Linear Motor\", IEEE Transactions on Industry Applications, 58(4). pp. 4792-4803, 2022, doi: 10.1109/TIA.2022.3177398.5.        F. Yu, H. Chen,  W. Yan, V. Pires, J. Martins, P. Rafajdus, A. Musolino, L. Sani, M. P. Aguirre, M. A. Saqib, M. Orabi  and X. Li, \"Design and Multiobjective Optimization of A Double-stator Axial Flux SRM with Full-pitch Winding Configuration\", IEEE Trans. Transport. Electrific., vol.8, no.4, pp. 4348-4364 2022. DOI:10.1109/TTE.2022.3173938.6.        S. Zhou, X. Li, H. Wang and P. Huang, “Modulation of a Semi Dual-Active-Bridge Resonant Converter with Soft-Switching and Zero Backflow Power”, IET Power Electronics,15, 515–530. (2022). https://doi.org/10.1049/pel2.12246.7.        C. Fang, H. Chen, H. Torkaman, A. Anuchin and X. Li , “Fault Diagnosis for Power Transistors in a Converter of Switched Reluctance Motors Based on Current Features”, IEEE Sensors Journal, VOL. 22, NO. 2, 1414-1423, Jan. 15, 2022. DOI: 10.1109/JSEN.2021.3128487.8.        H. Chen, R. Nie and X. Li, \"A Transverse Flux Single-Phase Tubular Switched Reluctance Linear Machine with 4 poles,\" IEEE Transactions on Applied Superconductivity, 31(8), Art no. 0601704, Nov. 2021. doi: 10.1109/TASC.2021.3096514..9.        S. Hu, X. Li, Q. Zheng, “A Dual-Bridge DC/DC Resonant Converter Using Extended PWM and Phase-shift Control”, IEEE Transactions on Industry Applications, 57(4), pp.4009-4020, 2021.10.    S. Zhou, X. Li, Z.Zhong and X. Zhang, “Wide ZVS operation of a semi dual-bridge resonant converter under variable-frequency-phase-shift control”, IET Power Electronics, 13(9), p. 1746 –1755, 2020.11.    M. Lu, X. Li and G. Chen, “A Hybrid Control of a Semi Dual-Active-Bridge DC-DC Converter with Minimum Current Stress”, IEEE Transactions on Power Electronics, 35(3), pp.3085-3096, 2020..12.    Y. Tang, X. Li, S. Zhou, C. Sun, G. Chen, “Comprehensive study of fast load modulation with volt-second balance in a dual-active-bridge converter”, IET Power Electronics, 12(6), pp: 1357-1367, 2019.13.    S. Hu, X. Li, A.K.S. Bhat, “Operation of a Bidirectional Series-Resonant Converter With Minimized Tank Current and Wide ZVS Range”, IEEE Transactions on Power Electronics, 34(1), pp: 904-915, 2019.14.    C. Sun, X. Li and S.-Z. Zhou, “Transient current control for a step load change in a dual-active-bridge converter”, Electronics Letters, 2018, 54(22), pp.1290-1292..15.    X. Li, S. Hu, C. Sun and Y.-F. Zhang, “Asymmetric double-side modulation for fast load transition in a semi-dual-active-bridge converter”, IET Power Electronics, 10(13), pp:1698-1704, 2017..16.    S.-T. Lin, X. Li, C. Sun and Y. Tang, “Fast transient control for power adjustment in a dual-active-bridge converter”, Electronics Letters, 53(16), 2017, pp.1130-1132..17.    S. Hu, X. Li, “Performance evaluation of a semi-dual-bridge resonant dc/dc converter with secondary phase-shifted control”, IEEE Transactions on Power Electronics,32(10), 2017, pp.7727-7738..18.    X. Li, \"A LLC-type dual-bridge resonant converter: analysis, design, simulation and experimental results,\" IEEE Transactions on Power Electronics, 29(8), pp:4313-4321, 2014..19.    X. Li and A.K.S. Bhat, “A Comparison Study of High-Frequency Isolated DC/AC Converter Employing an Unfolding LCI for Grid-Connected Alternative Energy Applications”, IEEE Transactions on Power Electronics, 29(8), pp:3930-3941, 2014.20.    X. Li and Y.-F. Li, “An optimized phase-shift modulation for fast transient response in a dual-active-bridge converter,\" IEEE Transactions on Power Electronics, 29(6), pp:2661-2665, June 2014..21.    X. Li and A.K.S. Bhat, “A Utility-interfaced phase-modulated High-Frequency Isolated Dual LCL dc/ac Converter”, IEEE Transactions on Industrial Electronics, 59(2), pages: 1008-1019, 2012.22.    X. Li, Q. Wu, S. Nandi, “Performance Analysis of a Three-phase Induction Machine with Inclined Static Eccentricity”, IEEE Transactions on Industry Applications,43(2), pages:531-541, 2007.23.    S. Nandi, H. Toliyat, X. Li, “Condition Monitoring and Fault Diagnosis of Electrical Machines - A Review”, IEEE Transactions on Energy Conversion, 20(4), pages:719-729, 2005. PatentsXiaodong Li, Song Hu, \"Battery charger with power factor correction\", US patent no.:  9,515,504 B2, Australian Innovation Patent, No.2015100179.Xiaodong Li, \"SYSTEM AND METHOD FOR CONTROLLING A CONVERTER CIRCUIT\", US patent no.:  9,935,462 B2, Australian Innovation Patent, No.2016100074.Xiaodong Li, \"CONVERTER CIRCUIT AND OPERATING METHOD THEREOF\", Australian Innovation Patent, No.2016100186.Xiaodong Li, \"Semi-Dual-Active-Bridge Converter System and Methods Thereof\", US patent no.: 9,748,853 B1, Australian Innovation Patent, No.2016101962.Chuan Sun, Xiaodong Li, \"Systems and method for controlling a converter circuit\", US patent no.: 10,658,936 B2, Australian Innovation Patent, No.2017100494. Personal AwardsIPS(Industrial Postgraduate Scholarship) from NSERC (National Science and Engineering Research Council of Canada), 2006 IEEE Power Engineering Society (PES) Best Paper Prize, 2007BOC Excellent Research Award in 2013. Student AwardsThe 11th China Graduate Electronics Design Contest, First-class award in South China Division, Second-class award in Final Tournament, 2016The 12th China Graduate Electronics Design Contest, First-class award in South China Division, 2017The 14th China Graduate Electronics Design Contest, First-class award in Final Tournament, 2019Dr. Song Hu, Graduate Research Award of Macau Science and Technology Award, 2018 Professional Society MembershipSenior Member, IEEE TOP",
  "content_length": 8234,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:22"
}