{
  "name": "Xiaoshuai Sun",
  "homepage": "https://sites.google.com/view/xssun",
  "status": "success",
  "content": "Welcome!Search this siteEmbedded FilesSkip to main contentSkip to navigationDr. Xiaoshuai Sun (孙晓帅)Professor, MAC LabSchool of Informatics, Xiamen UniversityOffice: Room B705, Haiyu Administration Building, XMU Haiyun Campus Email: xssun(at)xmu.edu.cn, xiaoshuaisun.hit[at]gmail.com   Homepage: [English] [Chinese][Google Scholar]Dr. Xiaoshuai Sun is a professor of School of Informatics, Xiamen University, China. He has been working as an assistant professor at School of Computer Science and Technology, Harbin Institute of Technology, from Sep. 2016 to May. 2019. From Sep. 2015 to Dec. 2016, he was a post-doc research fellow with Prof. Heng Tao Shen and Prof. Zi Huang at School of Information Technology and Electrical Engineering, the University of Queensland, Australia. He received his doctoral degree from Harbin Institute of Technology in January 2015 under the supervision of Prof. Hongxun Yao. From September 2012 to June 2013,  he worked as a research intern in  Microsoft Research Asia (MSRA)  mentored by Dr. Xin-Jing Wang. His current research interests include deep learning, computer vision and pattern recognition, multimedia content analysis and retrieval.  He has published over 60 papers as the main author, and most of them have been published in reputed journals and top international conferences including  IEEE TIP, PR, IEEE CVPR, AAAI, ACM Multimedia.Recent News[28 Feb 2023] 2 papers have been accepted by CVPR 2023.AwardsFirst Prize of Science and Technology Progress Award of Fujian Province, 2020First Prize of Xiamen Science and Technology Progress Award, 2020Excellent Ph.D Thesis Award of Harbin Institute of Technology, 2015Best Student Paper Award, Harbin Institute of Technology, 2013National Scholarship for Ph.D Student, Harbin Institute of Technology, 2012Microsoft Fellowship, Microsoft Research Asia, 2011Guanghua & Guorui Scholarship, Harbin Institute of Technology, 2009-2010Excellent Graduate of Harbin Engineering University, 2007Excellent Graduate of Heilongjiang Province, China, 2007 PublicationsPlease visit [DBLP] or  [Google Scholar] for full publication list.Courses and Tutorials认知驱动的视觉-语言协同分析, VALSE 2021, Hangzhou, China, 2021.10.10Multimedia Data Analysis and Mining, APESS 2018 @ HIT, Invited Lecturer, 2018. 7.31Network Information Content Security, Xiamen University, 2022.3 - nowAssembly language programming, Xiamen University, 2020.3 - nowDigital Image Processing, Harbin Institute of Technology, China, Teaching Assistant, 2017.3 - 2019.5Multimedia Technology, Harbin Institute of Technology, China, Teaching Assistant, 2017.3 - 2019.5Information Retrieval (INFS7410), the University of Queensland, Australia, Invited Lecturer & Teaching Assistant, 2016.6 - 2016.9Computational Modeling of Visual Attention, the University of Queensland, Australia, Invited Tutorial Speaker of DKE-Lab@UQ, 2016.4.26-27 Authorized PatentsHongxun Yao, Xiaoshuai Sun, Xue Li, \"Clothes Style Mining and Recommendation Based on Clothes Image Set\", CN 201210104011.5 Hongxun Yao, RongrongJi, Xiaoshuai Sun, et al., “Video Scene Correlation Acquisition with Application to Efficient Video Navigation and Retrieval”, CN 200810137510.8Hongxun Yao, Tianqiang liu, RongrongJi, Xiaoshuai Sun, “An action Categorization Method with Spatial Constraint”, CN 200810137503.8Research Guide - The How SeriesHow to Draft A Paper (PPT 2021-12-28 )How to Prepare A Rebuttal Letter (PPT)Other Useful Links for Graduate StudentsHow to do Research At the MIT AI LabUseful Things to Know About Ph. D. Thesis ResearchHow to succeed in graduate schoolEfficient Reading of Papers in Science and TechnologyThe Task of ReffereeGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3693,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:39"
}