{
  "name": "Xiaodan Liang",
  "homepage": "https://www.cs.cmu.edu/~xiaodan1",
  "status": "success",
  "content": "Xiaodan Liang Currently, I am an Associate Professor at the School of Intelligent Systems Engineering, Sun Yat-sen University. Before that, I was a Project Scientist in Machine Learning Department, Carnegie Mellon University, working with Prof. Eric P. Xing. I obtained my Ph.D. degree in the School of Data and Computer Science at Sun Yat-sen University in June 2016, advised by Prof. Liang Lin. I was a visiting scholar from March, 2014 to March, 2016 in the Department of EECS of the National University of Singapore, working with Prof. Shuicheng Yan. I have closely collarborated with Dr. Xiaohui Shen in Adobe Research and Dr. Jianchao Yang in SnapChat Research from 2014 to 2016. I was a research intern at the Multimedia Analysis Group of NEC Laboratories from June, 2013 to December, 2013, supervised by Dr. Rui Huang. I received my B.S. degrees from the Sun Yat-sen University in June, 2011. Email: xdliang328 AT gmail.comPhone: (86) 13265406280Office: School of Intelligent Systems Engineering, Sun Yat-Sen University (East Campus), Higher Education Mega Center, Guangzhou 510006, China.[Google Scholar] Research Interest My general research interest is to develop structured machine learning techniques for computer vision tasks. I mainly investigate how to exploit the human commonsense and incorporate them to develop the advanced artificial intelligence system. Recently, I focus on Video Analysis, including detection, captioning, summarization and prediction. Medical and Biological image analysis Deep Learning, including Graph LSTM, structure learning Human-centric Analysis, including 2D/3D human pose estimation, human parsing, face analysis Unsupervised Learning News I will serve as Area Chair of ICCV 2019 Five papers are accepted by NIPS 2018, Two papers are accepted by AAAI 2019 Excited to release our text generation toolkit Texar. Checkout the GitHub repo and our Tech Report! I will organize the Tutorial on Structured Deep Learning for Pixel-level Understanding at ACM MM’18. Eight papers are accepted by ECCV 2018 with two orals Our team won the 2nd place in Key Points Detection of Apparel Track of FashionAI Global Challenge 2018-Alibaba Cloud I am organizing the CVPR 2018 Workshop and ChallengeVisual Understanding of Humans in Crowd Scene and the 2nd Look Into Person (LIP) Challenge Three papers are accepted by CVPR 2018 (2 spotlights), one paper is accepted by KDD 2018, one paper is accepted by MICCAI 2018, one paper is accepted by IROS 2018. One paper is accepted by NIPS 2017. Four papers are accepted by ICCV 2017. I am organizing the CVPR 2017 Workshop and ChallengeVisual Understanding of Humans in Crowd Scene and the 1st Look Into Person (LIP) Challenge Professional activities I will serve as Area Chair of ICCV 2019 Guest editors of the journal of Multimedia Tools and Applications Special Issue on MM DataRepresentation Learning and Applications Guest Editor of Pattern Recognition Letters Special Issue on Image/Video Understanding and Analysis. I am a Programm Committee member of CVPR 2017, IJCAI 2017-2018, AAAI 2017-2019. Reviewer for TPAMI, IJCV, TKDE, TMM, TIP, TNNLS, TCSVT, and so on Reviewer for CVPR, ECCV, ACM MM, AAAI, NIPS, IJCAI, and so on Awards and Honors Medium Press ACM China Best Doctoral Dissertation Award, 2018 CCF Best Doctoral Dissertation Award, 2018 National Scholarship, 2015 National Scholarship, 2014 Postgraduate Studentship, Sun Yat-sen University, 2011-2016 Academic Excellence Award, Sun Yat-sen University, 2007- 2011 National Undergraduate mathematical modeling contest, Second Prize, 2009 Flowering Softward Innovation Contest university level, First Prize, 2009",
  "content_length": 3653,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:21"
}