{
  "name": "Xiaonan Zhang",
  "homepage": "https://www.cs.fsu.edu/~xzhang/index.html",
  "status": "success",
  "content": "Xiaonan Zhang's Lab Home News Grants/Awards Publications People Courses Service Contact Assistant Professor Computer Science Department Florida State University Email: xzhang14@fsu.edu Tel: 850-644-1852 About Me I am an Assistant Professor in Computer Science Department at Florida State University. I received my Ph.D. degree from Department of Electrical and Computer Engineering at Clemson University in Aug. 2020, supervised by Dr. Linke Guo. My research interests span over general areas of wireless communication and network, Internet of Things (IoT), and wireless security. My current research focuses on the intelligent next-generation (NextG) wireless systems, with an emphasis on AI-integrated wireless networks, mobile edge computing with distributed intelligence, and deep learning-based wireless communication systems. My publications have appeared in prestigious conferences and journals including but not limited to ACM MobiHoc, ACM CIKM, IEEE INFOCOM, IEEE ICDCS, AsiaCCS, IEEE TDSC, IEEE TON, IEEE TMC, and IEEE TWC. We are hiring students! Interests Future edge computing with distributed intelligence AI-integrated next-generation wireless networks Deep learning-based wireless communication and security Education Ph.D., Clemson University, 2020 M.S., State University of New York - Binghamton, 2017 Hiring for the new Positions Multiple RA positions are always available for highly self-motivated Ph.D. students who are expected to closely work with our research group. TA positions would be recommended if applications are satisfied with the department requirements. If you are interested, please send your resume or CV, TOEFL and GRE scores, and everything else that you believe will help your application to xzhang14@fsu.edu. For more details, please refer to https://www.cs.fsu.edu/admissions/graduate-admissions/. About Florida State University Florida State University (FSU) is a public research university in Tallahassee, the state capital of Florida. Founded in 1851, it is located on the oldest continuous site of higher education in the state of Florida. In the 2026 edition of Best Colleges, Florida State University is ranked No. 51 in National Universities. It's also ranked No. 21 in Top Public Schools. More information can be found at Florida State University and US News Best Colleges.",
  "content_length": 2323,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:36"
}