{
  "name": "Xiaorui Wang",
  "homepage": "http://www2.ece.ohio-state.edu/~xwang",
  "status": "success",
  "content": "College of Engineering Skip to main content Home /news/2025/08/building-future-one-engineer-time Building the future one engineer at a time Points of Pride $207M+ FY24 Research Funding highest total ever 12,155 total students in 2025 a new enrollment record 36 companies launched by faculty (FY2016-2023) double-arrow Explore our Research and Innovation Medicine With world-class experts in close proximity, Ohio State is fertile ground for engineering-healthcare innovation AI Ohio State has become a national leader in artificial intelligence R&D Mobility Leading local, state and national initiatives, Ohio State is a smart mobility testbed Manufacturing Many industries look to Ohio State for advances in manufacturing technology and processes double-arrow News November 26, 2025 Ohio State to hire 100 new faculty with AI expertise AI-focused faculty hires will complement the existing expertise at Ohio State November 24, 2025 From dreams to degrees: Scholarships empower future leaders A scholarship can change the course of a student's life. November 21, 2025 In memoriam: Professor and Ohio Eminent Scholar Joseph Heremans January 8, 1953 - November 18, 2025 News continued November 20, 2025 New AI initiative aims to put wetlands on the global modeling map November 18, 2025 At Lima, tomorrow’s engineers learn at a Ford plant November 17, 2025 Thirteen esteemed alumni honored for impact, achievement November 14, 2025 A new course helps students decode generative AI More News Link List • Faculty Career Opportunities • double-arrow Events Dec 11 Dec. 11 Reading Day Refuel Autumn 2025 Dec 21 Dec. 21 Autumn 2025 Pre-Commencement Celebration Jan 26 Jan. 26 Jan 27 Jan. 27 Engineering Winter Career Fair, sponsored by SWE More Events \"I chose Ohio State for its campus diversity and career resources. Touring the university, I envisioned thriving as an engineering student, and now it feels like home through the relationships I’ve built in courses and leadership roles.\" – Lucy Schneider, Industrial & Systems Engineering double-arrow Supporting the College of Engineering Your support makes it possible for us to be an innovative leader in engineering and architecture education, to create new discoveries across a broad range of applications and disciplines, and to make a difference at home and abroad. WAYS TO GIVE",
  "content_length": 2330,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:39"
}