{
  "name": "Xiaoou Tang",
  "homepage": "https://www.ie.cuhk.edu.hk/people/xotang.shtml",
  "status": "success",
  "content": "TANG Xiaoou, Sean - IE WEB TANG Xiaoou, Sean *SHB = Ho Sin Hang Engineering Building, The Chinese University of Hong Kong Research Interest Pattern Recognition Computer Vision Video Processing Courses Taught Signals and Systems Signal Analysis and Application Image and Video Processing TANG Xiaoou, Sean 湯曉鷗教授 Professor Outstanding Fellow of the Faculty of Engineering 工程學院傑出學人 FIEEE BS (USTC), MS (Rochester), PhD (MIT) (852) 3943-8379 Room 809, SHB* xtang [at] ie.cuhk.edu.hk Website Xiaoou Tang (S’93-M’96-SM’02-F’09) received the B.S. degree from the University of Science and Technology of China, Hefei, in 1990, and the M.S. degree from the University of Rochester, Rochester, NY, in 1991. He received the Ph.D. degree from the Massachusetts Institute of Technology, Cambridge, in 1996. He is a Professor in the Department of Information Engineering and Associate Dean (Research) of the Faculty of Engineering of the Chinese University of Hong Kong. He worked as the group manager of the Visual Computing Group at the Microsoft Research Asia from 2005 to 2008. His research interests include computer vision, pattern recognition, and video processing. Dr. Tang received the Best Paper Award at the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2009. He is a program chair of the IEEE International Conference on Computer Vision (ICCV) 2009 and has served as an Associate Editor of IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) and International Journal of Computer Vision (IJCV). He is a Fellow of IEEE. (http://mmlab.ie.cuhk.edu.hk). Recent / Selected Publications Y. Sun, X. Wang and X. Tang, “Deep Convolutional Network Cascade for Facial Point Detection,” in Proceedings of IEEE Computer Society Conference on Computer Vision and Patter Recognition (CVPR) 2013 X. Wang, S. Qiu, K. Liu, and X. Tang, “Web Image Re-ranking Using Query-Specific Semantic Signatures”, accepted to IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) K. Jia, X. Wang, and X. Tang, “Image Transformation based on Learning Dictionaries across Image Spaces”, IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI),Vol. 35, pp. 367-380, 2013 X. Tang, K. Liu, J. Cui, F. Wen, and X. Wang, “IntentSearch: Capturing User Intention for One-Click Internet Image Search,” IEEE Trans. Pattern Analysis and Machine Intelligence (PAMI), Vol. 34, No. 7, July 2012.[PDF] T. Xue, J. Liu and X. Tang, “Example-Based 3D Object Reconstruction from Line Drawings,” Proc. of IEEE Conf. on Computer Vision and Pattern Recognition(CVPR), 2012. [PDF] B. Zhou, X. Wang and X. Tang, “Understanding Collective Crowd Behaviors:Learning a Mixture Model of Dynamic Pedestrian-Agents,” Prof. of IEEE Conf. on Computer Vision and Pattern Recognition(CVPR), 2012. [PDF] P. Luo, X. Wang, and X. Tang, “Hierarchical Face Parsing via Deep Learning”, Prof. of IEEE Conf. on Computer Vision and Pattern Recognition(CVPR), 2012. [PDF] K. Jia, X. Tang, X. Wang, “Image Transformation based on Learning Dictionaries across Image Spaces”, IEEE Trans. Pattern Anal. Mach. Intell. (PAMI), , 2012. [PDF] T. Xue, J. Liu, X. Tang, “3D Modeling from a Single View of a Symmetric Object”, IEEE Trans. on Image Processing. (TIP), , 2012. K. He, J. Sun, X. Tang, “Single Image Haze Removal Using Dark Channel Prior,” IEEE Trans. Pattern Analysis and Machine Intelligence (PAMI), Vol. 33, No. 12, Dec. 2011. [PDF] W. LUO, X. Wang and X. Tang, “Content-based Photo Quality Assessment”, Proc. International Conference on Computer Vision (ICCV), 2011. [PDF] K. Jia, X. Wang, X. Tang, “Optical flow estimation using learned sparse model”, Proc. International Conference on Computer Vision (ICCV), 2011. [PDF] W. Zhang, X. Wang, and X. Tang, “Coupled Information-Theoretic Encoding for Face Photo-Sketch Recognition,” Prof. IEEE Conf. Computer Vision and Pattern Recognition(CVPR), 2011. [PDF] B. Zhou, X. Wang, X. Tang, “Random Field Topic Model for Semanic Region Analysis in Crowded Scenes from Tracklets,” IEEE Conf. Computer Vision and Pattern Recognition (CVPR), June 2011. [PDF] T. Xue, J. Liu, X. Tang, “Symmetric Piecewise Planar Object Reconstruction from a Single Image,” IEEE Conf. Computer Vision and Pattern Recognition (CVPR), June 2011. [PDF] X. Wang, K. Liu, X. Tang, “Query-Specific Visual Semantic Spaces forWeb Image Re-ranking,” IEEE Conf. Computer Vision and Pattern Recognition (CVPR), June 2011. [PDF] K. He, C. Rhemann, C. Rother, X. Tang, and J. Sun, “A Global Sampling Method for Alpha Matting”, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2011. [PDF] Q. Yin, X. Tang, J. Sun, “An associate-predict model for face recognition”, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2011. [PDF] J. Liu, Y. Chen, X. Tang, “Decomposition of complex line drawings with hidden lines for 3D planar-faced manifold object reconstruction,” IEEE Trans. Pattern Anal. Mach. Intell. (PAMI), vol. 33, no. 1, pp. 3, Jan 2011. [PDF] T. Liu, Z. Yuan, J. Sun, J. Wang, N. Zheng, X. Tang, H. Shum, “Learning to Detect a Salient Object”, IEEE Trans. Pattern Anal. Mach. Intell. (PAMI), vol. 33, no. 2, pp. 353-367, Feb 2011. [PDF] W. Zhang, J. Sun, X. Tang, “From Tiger to Panda: Animal Head Detection,” IEEE Transactions on Image Processing (TIP), vol. 20, no. 6, pp.1696-1708, 2011. [PDF] W. Zhang, Z. Lin, X. Tang, “Learning Semi-Riemannian Metrics for Semisupervised Feature Extraction,” IEEE Trans. Knowl. Data Eng, vol 23, no. 4, pp. 600-611, 2011. [PDF] C. Zhao, X. Wang, and W. Cham, “Background Subtraction via Robust Dictionary Learning,” EURASIP journal on Image and Video Processing, 2011. [PDF] Z. Lin, X. Tang, “Learning Semi-Riemannian Metrics for Semisupervised Feature Extraction”, IEEE Trans. on Knowledge and Data Engineering (TKDE), vol. 23, no. 4, pp. 600-611, 2011. [PDF] Z. Yu, C. Xu, J. Liu, O. C. Au, X. Tang, “Automatic object segmentation from large scale 3D urban point clouds through manifold embedded mode seeking”, Proceedings of the 19th ACM international conference on Multimedia (MM), 2011. [PDF] C. Cao, S. Chen, W. Zhang, X. Tang, “Automatic motion-guided video stylization and personalization”, Proceedings of the 19th ACM international conference on Multimedia (MM), 2011. [PDF] B. Gong, J. Liu, X. Wang, X. Tang, “3D object retrieval with semantic attributes”, Proceedings of the 19th ACM international conference on Multimedia (MM), 2011. [PDF] Q. Zhou, S. Chen, J. Liu, X. Tang, “Edge-preserving single image super-resolution”, Proceedings of the 19th ACM international conference on Multimedia (MM), 2011. [PDF] Research Interest Pattern Recognition Computer Vision Video Processing Courses Taught Signals and Systems Signal Analysis and Application Image and Video Processing",
  "content_length": 6770,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:37"
}