{
  "name": "Xiaowei Gu 0001",
  "homepage": "https://www.surrey.ac.uk/people/xiaowei-gu",
  "status": "success",
  "content": "Dr Xiaowei Gu | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Dr Xiaowei Gu Senior Lecturer PhD xiaowei.gu@surrey.ac.uk21 BB 02Academic and research departments Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyDr. Xiaowei Gu received his PhD in Computer Science from Lancaster University (UK) in 2018. Before joining Surrey, Xiaowei was a Lecturer in Computing at the University of Kent (UK), a Lecturer in Computer Science at Aberystwyth University (UK) and a Senior Research Associate at Lancaster University. Expand biography Areas of specialism Machine Learning; Artificial Intelligence; Data Analytics; Signal Processing University roles and responsibilities School's MSc Employability LeadMy qualifications 2021 Fellow of HEAResearchResearch interestsXiaowei’s research is focused on developing novel machine learning models that 1) have a transparent system structure and human-interpretable reasoning process, and 2) are capable of offering the state-of-the-art performance but with less demand of human expertise involvement. Xiaowei is also interested in developing explainable semi-supervised machine learning models to tackle streaming data problems. Expand research interests Research projects A Human-Trustable Self-Improving Machine Learning Framework for Rapid Disaster Responses Using Satellite Sensor Imagery Xiaowei Gu, New Investigator Award funded by Engineering and Physical Sciences Research Council (EPSRC), funding amount £267,600, 2024-2026 An Explainable Generic Design of Self-Evolving Intelligent Security Systems for Cyber attack DetectionXiaowei Gu and Gareth Howells, research funded by Frazer-Nash Consultancy Ltd. on behalf of the Defence Science and Technology Laboratory (Dstl), funding amount £122,556, 2023-2024 Expand research projects Indicators of esteemAssociate Editor - Neurocomputing, Elsevier, since 2022 Area Editor - Evolving Systems, Springer, since 2025In the Stanford/Elsevier World’s Top 2% Scientists listAssociate Editor - Evolving Systems, Springer, 2020-2024Member of IEEE Computational Intelligence Society Standards Committee, since 2024Program Committee Co-chair of IEEE International Conference on Machine Learning and Applications, Miami, Florida, US, Dec 18-20, 2024Web & Publicity Chair of IEEE Conference on Evolving and Adaptive Intelligent Systems, Madrid, Spain, May 23-24, 2024International Neural Network Society Doctoral Dissertation Award, 2020Chinese Government Award for Outstanding Self-Financed Students Abroad, 2019 Expand indicator of esteem SupervisionPostgraduate research supervisionExceptional PhD applicants/visitors with a proven track record of academic excellence and a strong research background are very welcome! If you are interested, please contact me via email: xiaowei.gu@surrey.ac.uk.To facilitate efficient communication, please ensure your email includes the following two items:A one-page CV highlighting your academic achievements and relevant experience.A one-page document outlining your research idea and its alignment with my research.Due to the high volume of emails received, queries missing these two items may not receive a response. Expand TeachingCOMM072 - Research, Ethics, and Security in Data Science  (2025-now)EEEM005 - AI and AI Programming  (2023-now)COM1027 - Programming Fundamentals (2023-2025) Expand my teaching PublicationsHighlightsMy Google Scholar PageMy ResearchGate PageMy Scopus PageMy GitHub PageHongxing Cui, Danling Tang, Gregory R Foltz, Wei Mei, Hongbin Liu, Ibrahim Hoteit, Chao Li, Han Zhang, Yi Sui, Xiaowei Gu (2025)Drivers of Tropical Cyclone-Induced Ocean Cooling in Different Seasons over the Northwest Pacific from Explainable Machine Learning, In: Journal of Geophysical Research - Machine Learning and Computation WileyThis study develops an interpretable machine learning framework combining extreme gradient boosting (XGBoost) and SHapley Additive exPlanations (SHAP) to explain the seasonal and regional variations in tropical cyclone (TC)-induced sea surface temperature (SST) cooling in the Northwest Pacific. The framework adopts TC characteristics (e.g., intensity, translation speed, size) and pre-storm ocean conditions (e.g., mixed layer depth, ocean thermal structure) as predictors, and skillfully reproduces the spatial structure of cooling in different seasons and regions. The method identifies the drivers of the cooling in both the marginal and the open seas, and quantifies their respective contributions by explicitly accounting for both the seasonal and regional variations. The drivers vary with seasons, with TC characteristics explaining 43-56% of the variance in cooling in the open sea and 47-52% in the marginal sea while oceanic drivers contribute 23-41% and 31-35%, respectively. Our results reveal that the seasonality of TC intensity and mixed layer depth are the most important contributors to the seasonal variations in the cooling over the marginal and open seas.Yucheng Zhang, Yuyan Zheng, Dan Wang, Xiaowei Gu, Michael Zyphur, Xiao Lin, Shudi Liao, Yangyang Deng (2025)Shedding Light on the Black Box: Integrating Prediction Models and Explainability Using Explainable Machine Learning, In: Organizational Research Methods SAGE PublicationsDOI: 10.1177/10944281251323248In contemporary organizational research, when dealing with large heterogeneous datasets and complex relationships, statistical modeling focused on developing substantive explanations typically results in low predictive accuracy. In contrast, machine learning (ML) exhibits remarkable strength for prediction, but suffers from an unexplainable analytical process and output—thus ML is often known as a “black box” approach. The recent development of Explainable Machine Learning (XML) integrates high predictive accuracy with explainability, which combines the advantages inherent in both statistical modeling and ML paradigms. This paper compares XML with statistical modeling and the traditional ML approaches, focusing on an advanced application of XML known as Explanatory Fuzzy System (EFS), which enhances model transparency by clarifying the unique contribution of each modeled predictor. In an illustrative study, we demonstrate two EFS-based XML models and conduct comparative analyses among XML, ML, and statistical models with a commonly-used database in organizational research. Our study offers a thorough description of analysis procedures for implementing XML in organizational research, along with best-practice recommendations for each step as well as Python code to aid future research using XML. Finally, we discuss the benefits of XML for organizational research and its potential development.Xiaowei Gu, Qiang Ni, Qiang Shen (2024)Multilayer Evolving Fuzzy Neural Networks with Self-Adaptive Dimensionality Compression for High-Dimensional Data Classification, In: IEEE Transactions on Fuzzy Systems32(11)pp. 6314-6328 Institute of Electrical and Electronics Engineers (IEEE)DOI: 10.1109/TFUZZ.2024.3446959High-dimensional data classification is widely considered as a challenging task in machine learning due to the so-called \"curse of dimensionality\". In this paper, a novel multilayer jointly evolving and compressing fuzzy neural network (MECFNN) is proposed to learn highly compact multi-level latent representations from high-dimensional data. As a meta-level stacking ensemble system, each layer of MECFNN is based on a single jointly evolving and compressing neural fuzzy inference system (ECNFIS) that self-organises a set of human-interpretable fuzzy rules from input data in a sample-wise manner to perform approximate reasoning. ECNFISs associate a unique compressive projection matrix to each individual fuzzy rule to compress the consequent part into a tighter form, removing redundant information whilst boosting the diversity within the stacking ensemble. The compressive projection matrices of the cascading ECNFISs are self-updating to minimise the prediction errors via error backpropagation together with the consequent parameters, empowering MECFNN to learn more meaningful, discriminative representations from data at multiple levels of abstraction. An adaptive activation control scheme is further introduced in MECFNN to dynamically exclude less activated fuzzy rules, effectively reducing the computational complexity and fostering generalisation. Numerical examples on popular high-dimensional classification problems demonstrate the efficacy of MECFNN.Xiaowei Gu (2024)An Autonomous Centreless Approach to Chunk-Wise Data Partitioning, In: Evolving systems15(6) SpringerDOI: 10.1007/s12530-024-09605-5In this paper, a novel autonomous cent",
  "content_length": 128676,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:43"
}