{
  "name": "Xiaohui Gu",
  "homepage": "https://www.csc2.ncsu.edu/faculty/xgu",
  "status": "success",
  "content": "Prof. Xiaohui (Helen) Gu's Homepage Xiaohui (Helen) Gu (顾晓晖） Professor Department of Computer Science North Carolina State University Ph.D., University of Illinois at Urbana-Champaign, 2004 3274 EB-II, 890 Oval Drive Box 8206 Raleigh, NC 27695 Phone: 919-515-7045, FAX:  919-515-7896 Email: xiaohui.helen.gu AT gmail.com Web: http://www.csc.ncsu.edu/faculty/gu/ Brief Biography Xiaohui (Helen) Gu is a full professor in the Department of Computer Science at the North Carolina State University. She received her PhD degree in 2004 and MS degree in 2001 from the Department of Computer Science, University of Illinois at Urbana-Champaign. She received her BS degree in computer science from Peking University, Beijing, China in 1999. She was a research staff member at IBM T. J. Watson Research Center, Hawthorne, New York, between 2004 and 2007. Dr. Gu received ILLIAC fellowship, David J. Kuck Best Master Thesis Award, and Saburo Muroga Fellowship from University of Illinois at Urbana-Champaign. She also received the IBM Invention Achievement Awards in 2004, 2006, and 2007.  She has filed 9 patents, and has published more than 80 research papers in international journals and major peer-reviewed conference proceedings. Dr. Gu is a recipient of NSF Career Award, four IBM Faculty Awards 2008, 2009, 2010, 2011, and two Google Research Awards 2009, 2011, best paper awards from ICDCS 2012, CNSM 2010, and NCSU Faculty Research and Professional Development Award. She served as program co-chair for IEEE/ACM IWQoS 2013 and USENIX ICAC 2014. She is an associate editor for IEEE Transactions for Parellel and Distributed Systems (TPDS). She is a Senior Member of IEEE and a member of ACM. She was on sabbatical at Google as a visiting scientist in 2015. She also founded InsightFinder, a NCSU startup company commercializaing cloud management technologies invented by her research group. One of the unsupervised machine leaning based anomaly detection technologoies has been licensed to Google. Students: I am looking for self-motivated PhD students with strong system building skills to join my research group. Several RA positions are available. Please send me an email with your CV and TOFEL/GRE scores. Research General research interests: Systems and Networking Current research focus: Autonomic Computing, Cloud Computing, Accoutable Distributed Systems Publications (Full List, DBLP, Google Scholar) Research Group: DANCE (Distributed system research on Autonomy, resilieNce, Collaboration, and Energy) Research Sponsors: NSF, ARO, NSA, IBM, Google, Credit Suisse, CACC, SOSI/ARO, NCSU All Funded Projects Teaching Spring 2021, CSC 724: Advanced Distributed Systems Spring 2021, CSC 246: Concepts of Operating Systems Spring 2020, CSC 724: Advanced Distributed Systems Spring 2020, CSC 501: Operating System Principles Spring 2020, CSC 801: System Group Seminar Spring 2019, CSC 724: Advanced Distirbuted Systems Spring 2019, CSC 501-002: Operating System Principles Spring 2018, CSC 724: Advanced Distributed Systems. Spring 2018, CSC 501-001: Operating System Principles. Spring 2018, CSC 501-601: Operating System Principles (Distance Learning) Spring 2017, CSC 724: Advanced Distributed Systems. Spring 2017, CSC 501: Operating System Principles. Spring 2017, CSC 801: Systems Group Seminar. Spring 2014, CSC 724: Advanced Distributed Systems. Spring 2014, CSC 501: Operating System Principles. Spring 2013, CSC 724: Advanced Distributed Systems. Spring 2013, CSC 501: Operating Systems Principles. Spring 2013, CSC 801: Systems Group Seminar. Spring 2012, CSC 724: Advanced Distributed Systems. Fall 2011, CSC 246: Concepts of Operating Systems. Spring 2011, CSC 724: Advanced Distributed Systems. Fall 2010, CSC 501: Operating Systems Principles. Spring 2010, CSC 724: Advanced Distributed Systems. Spring 2010, CSC 801: Seminar in Computer Science. Fall 2009, CSC 246: Concepts of Operating Systems. Spring 2009, CSC 724: Advanced Distributed Systems. Fall 2008, CSC 246: Concepts of Operating Systems. Fall 2008, CSC 801: Seminar in Computer Science. Spring 2008, CSC591D-006: Special Topics on Distributed Systems. Selected Profesional Service Faculty advsior for Women in Computer Science (WiCS) at NCSU, 2010-present. Associate Editor, IEEE Transactions on Parallel and Distributed Systems (TPDS), 2014 - present. Panelist for NSF and NIH. Program Co-Chair, USENIX International Conference on Autonomic Computing (ICAC), Philadelphia, PA, 2014. (part of USENIX Federated Conference Week) Workshop Chair, IEEE International Conference on Cloud Engineering (IC2E), Boston, MA, 2014. Program Co-Chair, IEEE International Symposium on Quality-of-Service (IWQoS), Montreal, Quebec, Canada, 2013. Proceedings Co-Chair, IEEE International Conference on Cluster Computing (Cluster), Crete, Greece, 2010. Program Co-Chair (work in progress track), IEEE International Conference on Pervasive Computing and Communications(PerCom), New York, 2007. Links Advice Collection for graduate students Teaching Academic calendar  |  CSC courses  |  Wolfware Funding sources CISE deadlines  |  NSF Grant Proposal Guide  |  NSF Fastlane  |  DOE grants | Account reports |  NCSU PINS Daily essential Library |  Registration & Records  |  OISSS  | NCSU Webmail  |  Graduate Database",
  "content_length": 5278,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:30"
}