{
  "name": "Xiaoyuan Xie",
  "homepage": "http://xiaoyuanxie.github.io",
  "status": "success",
  "content": "Xiaoyuan Xie's personal homepage Xiaoyuan Xie | News Interest Awards Publications Services Experience Students English / 中文 version DR. Xiaoyuan Xie Professor, School of Computer Science, Wuhan University xxie@whu.edu.cn School of Computer Science, Wuhan University, E301 Google Scholar Latest News We are recruiting Postdoc Research Fellow! Salary ranges from 300k ~ 400k RMB per year. For more details, please refer to: http://rsb.whu.edu.cn/info/1076/5191.htm. Congratulations to Pengbo Yin for his Master's National Scholarship in 2023 ! Congratulations to Yi Song for his Tencent Scholarship in 2023 ! Congratulations to Zhipeng Cai for his Guotai Junan Scholarship in 2023 ! Congratulations to Songqiang Chen for his Master's National Scholarship in 2022 ! Congratulations to Songqiang Chen for his Master's National Scholarship in 2021 ! Research Interests Software Testing Program Slicing and Analysis Debugging and Fault-localization Search-based Software Engineering Evolutionary Computing Machine Learning Awards ICST 2025 Most Influential 10-years Journal First Paper Award, \"Testing and validating machine learning classifiers by metamorphic testing\", Xiaoyuan Xie, Joshua Wing Kei Ho, Christian Murphy, Gail Kaiser, Baowen Xu, and Tsong Yueh Chen, 2025 18th IEEE International Conference on Software Testing, Verification and Validation (ICST) 2025 ACM SIGSOFT Distinguished Paper Award, \"Do not neglect what’s on your hands: localizing software faults with exception trigger stream\", Xihao Zhang, Yi Song, Xiaoyuan Xie, Qi Xin, Chenliang Xing, 2024 39th IEEE/ACM International Conference on Automated Software Engineering (ASE) 2024 CCF开源创新大赛一等奖 2024 我心目中的好导师, Wuhan University 2023 Top-12 speaker on \"2023 AI Software Development Digital Summit\" 2023 Research Fund for International Excellent Young Scientists from NSFC 2022 ACM SIGSOFT Distinguished Paper Award, \"Boosting the Revealing of Detected Violations in Deep Learning Testing: A Diversity-Guided Method\", Xiaoyuan Xie, Pengbo Yin, and Songqiang Chen, 2022 37th IEEE/ACM International Conference on Automated Software Engineering (ASE) 2022 CCF NASAC Software Innovation Award for Young Researchers 2021 ACM SIGSOFT Distinguished Paper Award, \"Testing Your Question Answering Software via Asking Recursively\", Songqiang Chen, Shuo Jin, and Xiaoyuan Xie, 2021 36th IEEE/ACM International Conference on Automated Software Engineering (ASE) 2021 ACM SIGEVO HUMIES 2017 Silver Medal, \"Human Competitiveness of Genetic Programming in Spectrum Based Fault Localisation: Theoretical and Empirical Analysis\" 2017 Luojia Young Scholar, Wuhan University 2016 Best Paper Award, \"Application of Metamorphic Testing to Supervised Classifiers\", Xiaoyuan Xie, Joshua Ho, Christian Murphy, Gail Kaiser, Baowen Xu and Tsong Yueh Chen, 9th International Conference on Quality Software 2009 Selected Publications Refereed Journals [ASE25] RFMC-CS: a representation fusion based multi-view momentum contrastive learning framework for code searchG. Chen, W. Liu, X. XieAutomated Software EngineeringVol.32, No.1, pp.1-16 (corresponding author) CCF-B [TSE24] Metamorphic Testing of Image Captioning Systems via Image-Level ReductionX. Xie, X. Li, S. ChenIEEE Transactions on Software Engineering(corresponding author) CCF-A [TOSEM24] SURE: A Visualized Failure Indexing Approach using Program Memory SpectrumY. Song, X. Zhang, X. Xie, S. Chen, Q. Liu, R. GaoACM Transactions on Software Engineering and MethodologyVol.33, No.8, pp.1-43 (corresponding author) CCF-A [TOSEM24] Word Closure-Based Metamorphic Testing for Machine TranslationX. Xie, S. Jin, S. Chen, S.C. CheungACM Transactions on Software Engineering and MethodologyVol.33, No.8, pp.1-46 (corresponding author) CCF-A [SCIS24] When Debugging Encounters Artificial Intelligence: State of the Art and Open ChallengesY. Song, X. Xie, B. XuSCIENCE CHINA Information SciencesVol.67, No.4, pp.141101 (co-first and corresponding author) CCF-A [ASE23] QAASKER+: a novel testing method for question answering software via asking recursive questionsX. Xie, S. Jin, S. ChenAutomated Software EngineeringVol.30, No.1, pp.14 (corresponding author) CCF-B [JSS22] A comprehensive empirical investigation on failure clustering in parallel debuggingY. Song, X. Xie, Q. Liu, X. Zhang, X. WuJournal of Systems and SoftwareVol.193, pp.111452 (corresponding author) CCF-B [IST22] Personalizing label prediction for GitHub issuesJ. Wang, X. Zhang, L. Chen, X. XieInformation and Software TechnologyVol.145, pp.106845 CCF-B [TR22] MULA: A Just-In-Time Multi-labeling System for Issue ReportsX. Xie, Y. Su, S. Chen, L. Chen, J. Xuan, B. XuIEEE Transactions on ReliabilityVol.71, No.1, pp.250-263 (corresponding author) SCI二区 [TR20] METTLE: a METamorphic testing approach to assessing and validating unsupervised machine LEarning systemsX. Xie, Z. Zhang, T.Y. Chen, Y. Liu, P-L. Poon, B. XuIEEE Transactions on ReliabilityVol.69, No.4, pp.1293-1322 (corresponding author) SCI二区 [ESE19] How does code style inconsistency affect pull request integration? an exploratory study on 117 github projectW. Zou, J. Xuan, X. Xie, Z. Chen, B. XuEmpirical Software EngineeringVol.24, No.6, pp.3871-3903 CCF-B [TSE19] Metric+: A metamorphic relation identification technique based on input plus output domainsC-A. Sun, A. Fu, P-L. Poon, X. Xie, H. Liu, T. Y. ChenIEEE Transactions on Software Engineering CCF-A [JSS19] Does the fault reside in a stack trace? assisting crash localization by predicting crashing fault residenceY. Gu, J. Xuan, H. Zhang, L. Zhang, Q. Fan, X. Xie, T. QianJournal of Systems and SoftwareVol.148, pp.88-104 CCF-B [JSS19] On the analysis of spectrum based fault localization using hitting setsJ. Tu , X. Xie , T. Y. Chen , B. XuJournal of Systems and SoftwareVol.147, pp.106-123 CCF-B [IST17] Software effort estimation based on open source projects: Case study of Github, Information and Software TechnologyF. Qi, X. Y. Jing, X. Zhu, X. Xie, B. Xu, S. YingInformation and Software TechnologyVol.92, pp.145-157 CCF-B [CI17] Multi-level random walk for software test suite reductionZ. Chi, J. Xuan, Z. Ren, X. Xie, H. GuoIEEE Computational Intelligence MagazineVol.12, No.2, pp.24-33 SCI一区 [TOSEM17] Localisation: Theoretical and Empirical Analysis, ACM Transactions on Software Engineering and MethodologyS. Yoo, X. Xie, F-C. Kuo, T. Y. Chen, M. HarmanACM Transactions on Software Engineering and MethodologyVol.26(1), pp.4:1-4:30 (corresponding author) CCF-A [TSC17] Localizing runtime anomalies in service-oriented systemsQ. He, X. Xie, Y. Wang, D. Ye, F. Chen, H. Jin, Y. YangIEEE Transactions on Services ComputingVol.10, No.1, pp.94-106 CCF-A [JSS16] METRIC: METamorphic Relation Identification based on the Category-choice frameworkT.Y. Chen, P-L. Poon, X. XieJournal of Systems and SoftwareVol.116, pp. 177-190 CCF-B [TOSEM13] A Theoretical Analysis of The Risk Evaluation Formulas for Spectrum-Based Fault LocalizationX. Xie, T. Y. Chen, F.-C. Kuo, B. W. XuACM Transaction on Software Engineering and MethodologyVol. 22, No.4, pp.31:1-31:40 CCF-A [IST13] Metamorphic Slice: An Application in Spectrum-Based Fault X. Xie, W. E. Wong, T. Y. Chen, B. W. XuInformation and Software TechnologyVol.55, No.5, pp.866-879 CCF-B [JSS11] Testing and Validating Machine Learning Classifiers by Metamorphic TestingX. Xie, J. W. K. Ho, C. Murphy, G. Kaiser, B. W. Xu, and T. Y. ChenJournal of Systems and SoftwareMost Influential 10-Years Journal First Paper at ICST 2025Vol.84, No.4, pp.544-558 CCF-B Refereed Conferences [ICSE25] HedgeCode: A Multi-Task Hedging Contrastive Learning Framework for Code SearchG. Chen, X. Xie, D. Tang, Q. Xin, W. LiuIEEE/ACM 47th International Conference on Software Engineeringpp.89-100 (corresponding author) CCF-A [ASE24] Do Not Neglect What's on Your Hands: Localizing Software Faults with Exception Trigger StreamX. Zhang, Y. Song, X. Xie, Q. Xin, C. XingProceedings of the 39th IEEE/ACM International Conference on Automated Software EngineeringACM SIGSOFT Distinguished Paper Awardpp. 982-994 (corresponding author) CCF-A [ISSTA24] FastLog: An End-to-End Method to Efficiently Generate and Insert Logging StatementsX. Xie, Z. Cai, S. Chen, J. XuanProceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysispp. 26-37 (corresponding author) CCF-A [ICSE24] ReClues: Representing and indexing failures in parallel debugging with program variablesY. Song, X. Zhang, X. Xie, Q. Liu, R. Gao, C. XingProceedings of the 46th International Conference on Software Engineeringpp.1-13 (corresponding author) CCF-A [ICPC23] Properly Offer Options to Improve the Practicality of Software Document Completion ToolsZ. Cai, S. Chen, X. XieIEEE/ACM 31st International Conference on Program Comprehensionpp.237-241 (corresponding author) CCF-B [DASFAA23] ML-KGCL: Multi-level Knowledge Graph Contrastive Learning for RecommendationG. Chen, X. XieInternational Conference on Database Systems for Advanced Applicationspp.253-268 (corresponding author) CCF-B [ASE22] Boosting the Revealing of Detected Violations in Deep Learning Testing: A Diversity-Guided MethodX. Xie, P. Yin, S. ChenProceedings of the 37th IEEE/ACM International Conference on Automated Software EngineeringACM SIGSOFT Distinguished Paper Awardpp.1-13 (corresponding author) CCF-A [ASE22] Evolving Ranking-Based Failure Proximities for Better Clustering in Fault IsolationY. Song, X. Xie, X. Zhang, Q. Liu, R. GaoProceedings of the 37th IEEE/ACM International Conference on Automated Software Engineeringpp.1-13 (corresponding author) CCF-A [ISSRE22] Towards the Robustness of Multiple Object Tracking SystemsX. Xie, Y. Duan, S. Chen and J. XuanProceedings of the 33rd IEEE International Symposium on Software Reliability Engineeringpp.402-413 (corresponding author) CCF-B [ASE21] Testing Your Question Answering Software via Asking RecursivelyS. Chen, S. Jin, X. XieProceedings of the 36th IEEE/ACM International Conference on Automated Software EngineeringACM SIGSOFT Distinguis",
  "content_length": 14625,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:44"
}