{
  "name": "Xiao Zhang 0037",
  "homepage": "https://www.zhangxiao.me",
  "status": "success",
  "content": "Xiao Zhang's Homepage Xiao Zhang Office: CIS 212  |  Lab: CIS 108 & ELB 2387 4901 Evergreen Rd, Dearborn, MI 48128 I am an Assistant Professor in the Department of Computer and Information Science at the University of Michigan-Dearborn, where I lead the TAI (Trustworthy AI-driven IoT) Lab and serve as the advisor of the student club ICC (Immersive Computing Club). Before joining UM-Dearborn, I was a Postdoctoral Associate at Duke University. I obtained my Ph.D. degree in the Computer Science and Engineering at Michigan State University, my M.S. degree at Northwestern Polytechnical University and B.E. degree with honor at Taiyuan University of Technology. I am looking for highly self-motivated students (Ph.D., D.Eng., master, undergraduate, visiting, intern, and high school) to join my group. If you are passionate about related research topics, please email me with your CV, transcripts, and several sentences about your research interests. My current research interests are mobile computing, AIoT, Cyber Physical Systems, AI-assisted sensing/localization, and HCI. My previous work focused on exploring spatial-temporal diversities in Optical Wireless Communication (OWC) for its improved communication performance and enabled sensing/localization. My vision is that light can provide the secure and location-aware communication for Internet-of-Things and human-centered mobile computing. With explored OWC's spatial-temporal diversities and machine learning, we can use light as promising medium for next-generation wireless networks with broad applications (e.g., LiFi, V2X networks, underwater navigation, digital health, smart city, smart classroom, smart manufacturing, HCI, AR/VR, and digital twins). Email / Google Scholar / Michigan Experts News 11/2025, invited to serve as local chair of EAI SmartSP 2026. 11/2025, invited to serve as NSF panelist. 11/2025, invited to serve as TPC member of IEEE SECON 2026. 11/2025, invited to serve as TPC member of IEEE MOST 2026. 10/2025, our security paper received Best Paper Award in IEEE DSC 2025, congratulations. 10/2025, invited to serve as TPC member of IEEE ICNC 2026. 10/2025, invited to give a research talk at ASME Detroit Section about next-generation wireless networks. 10/2025, our paper PlaCoB received Best Paper Award in IEEE MASS 2025, congratulations. 10/2025, invited to give guest lecture at MSU about optical wireless communication and sensing. 08/2025, Jaskirat and Ashwin received EXP+ and STG grants to attend IEEE MASS 2025. 08/2025, one paper accepted at IEEE DSC 2025, congratulations. 08/2025, received NAIRR Pilot award to support our visible light positioning for smart manufacturing. 08/2025, one paper accepted at IEEE Trans. on Dependable and Secure Computing, congratulations. 08/2025, one paper accepted at IEEE Trans. on Dependable and Secure Computing, congratulations. 08/2025, ViKey demo accepted at IEEE MASS 2025 as poster, congratulations. 08/2025, invited to serve as TPC of IEEE ICPADS 2025. 07/2025, three papers (ViKey, PlaCoB, and VIOSem) accepted at IEEE MASS 2025, congratulations all. 07/2025, received IHP Research and Engagement Fund, thanks UM. 06/2025, received OE Review grant, thanks OE committee. 05/2025, received OE Creation grant, thanks OE committee. 05/2025, partnered with Universal Academy Learning on K-12 STEM outreach. 04/2025, invited to serve as NSF panelist. 03/2025, received Creative Teaching fund, thanks UM-Dearborn. 01/2025, invited to serve as TPC member of IEEE INFOCOM DeepWireless 2025. 10/2024, invited to serve as TPC member of IEEE ICNC 2025. 09/2024, joined UM-Dearborn as a tenure-track Assistant Professor. 07/2024, invited to serve as TPC member of IEEE ICPADS 2024. 05/2024, invited to serve as TPC member of IEEE MSN 2024. 09/2023, joined Duke University as a Postdoctoral Associate. 05/2023, successfully defended my Ph.D. thesis. 09/2022, passed comprehensive exam. 01/2020, passed qualification exam. 01/2019, started PhD journey. More Research * denotes the student under supervision/mentoring and ^ denotes the co-primary authors. Conference Papers Dissecting Privacy-Exposing Identifiers in 5G/4G Networks Munshi Saifuzzaman, Ke Xie, Tian Xie, Xiao Zhang, and Xinyu Lei DSC 2025 | paper | Best Paper Award ViKey: Secure Door Access Control Using Passive Visible Light Tags Jaskirat Sudan*^, Fatima Qasem*^, Hasky E Fynn*^, Fatima Mohammed*, Ashwin Sarvadey*, Tian Xie, Ang Li, and Xiao Zhang MASS 2025 | paper | teaser PlaCoB: Collaborative Beamforming for Long Range Platoon-to-Platoon Communication Griffin Klevering*, Kanishka P Wijewardena*, Xiao Zhang, and Li Xiao MASS 2025 | paper | Best Paper Award VIOSem: Visual-Inertial Odometry via Semantic Communication-enhanced Modulation Design Kanishka P Wijewardena*, Griffin Klevering*, Xiao Zhang, and Li Xiao MASS 2025 | paper HoloCube: 3D Opitcal IoT Connections via Software Defined Pepper's Ghost Xiao Zhang, Li Xiao, and Matt W. Mutka ICNP 2024 | paper WavePurifier: Purifying Audio Adversarial Examples via Hierarchical Diffusion Models Hanqing Guo, Guangjing Wang, Bocheng Chen, Yuanda Wang, Xiao Zhang, Xun Chen, Qiben Yan, Li Xiao MobiCom 2024 | paper RadCloud: Real-Time High-Resolution Point Cloud Generation Using Low-Cost Radars for Aerial and Ground Vehicles David Hunt, Shaocheng Luo, Amir Khazraei, Xiao Zhang, Spencer Hallyburton, Tingjun Chen, Miroslav Pajic ICRA 2024 | paper RoFin: 3D Hand Pose Reconstructing via 2D Rolling Fingertips Xiao Zhang, Griffin Klevering*, Juexing Wang, Li Xiao, and Tianxing Li MobiSys 2023 | paper PATCH: A Plug-in Framework Of Non-blocking Inference For Distributed Multimodal System Juexing Wang, Guangjing Wang, Xiao Zhang, Li Liu, Huacheng Zeng, Li Xiao, Zhichao Cao, Lin Gu, and Tianxing Li Ubicomp 2023 | paper Boosting Optical Camera Communication via 2D Rolling Blocks Xiao Zhang, Griffin Klevering*, James Mariani, Li Xiao, and Matt Mutka IWQoS 2023 | paper PoseFly: On-site Pose Parsing of Swarming Drones via 4-in-1 Optical Camera Communication Xiao Zhang, Griffin Klevering*, and Li Xiao WoWMoM 2023 | paper U-Star: An Underwater Navigation System based on Passive 3D Optical Identification Tags Xiao Zhang, Hanqing Guo, James Mariani, and Li Xiao MobiCom 2022 | paper LiFOD: Lighting Extra Data via Fine-grained OWC Dimming Xiao Zhang, James Mariani, Li Xiao, and Matt Mutka SECON 2022 | paper Effective Subcarrier Pairing for Hybrid Delivery in Relay Networks Xiao Zhang, Li Xiao MASS 2020 | paper k-Labelsets for Multimedia Classification with Global and Local Label Correlation Yan Yan, Shining Li, Xiao Zhang, et.al MMM 2018 | paper Directional Monitoring of Multiple Moving Targets by Multiple Unmanned Aerial Vehicles Yan Pan, Shining Li, Xiao Zhang, et.al GLOBECOM 2017 | paper Multi-label Learning with Label-Specific Feature Selection Yan Yan, Shining Li, Zhe Yang, Xiao Zhang, et.al ICONIP 2017 | paper Journal Papers Uncovering Risks of Data-Free Feature Vector Inversion Attacks Against Vector Databases Shengyang Qin, Xinyu Lei, Nankun Mu, Hongyu Huang, Tian Xie, and Xiao Zhang IEEE Transactions on Dependable and Secure Computing 2025 | paper Exploiting Fine-grained Dimming with Improved LiFi Throughput Xiao Zhang, James Mariani, Li Xiao, and Matt W. Mutka ACM Transactions on Sensor Networks 2024 | paper The Security in Optical Wireless Communication: A Survey Xiao Zhang, Griffin Klevering*, Xinyu Lei, Yiwen Hu, Li Xiao, and Guan-Hua Tu ACM Computing Surveys 2023 | paper Handling Data Heterogeneity for IoT Devices in Federated Learning: A Knowledge Fusion Approach Xu Zhou, Xinyu Lei, Cong Yang, Yichun Shi, Xiao Zhang, and Jingwen Shi IEEE Internet of Things Journal 2023 | paper Survey for Soil Sensing with IOT and Traditional System Juexing Wang, Xiao Zhang, Li Xiao, and Tianxing Li MDPI Network 2023 | paper Workshop/Poster/Demo Papers A Passive Optical Tagging Approach for Secure and Revocable Entry Systems Hasky E Fynn*, Jaskirat Suda*, Fatima Qasem*, Fatima Mohammed*, and Xiao Zhang MASS Demo 2025 | paper Holographic Optical Tag enabled Omindirectional IoT Connection Xiao Zhang, Li Xiao, and Matt W. Mutka SIGCOMM Poster 2024 | paper Integrated On-site Localization and Optical Camera Communication for Drones Xiao Zhang, Griffin Klevering*, Kanishka Wijewardena*, and Li Xiao WoWMoM Demo 2023 | paper Exploring Rolling Shutter Effect for Motion Tracking with Objective Identification Xiao Zhang, Griffin Klevering*, Li Xiao SenSys Poster 2022 | paper Lighting Extra Data via OWC Dimming Xiao Zhang, Li Xiao CoNEXT Workshop 2020 | paper RainbowRow: Fast Optical Camera Communication Xiao Zhang, Li Xiao ICNP Workshop 2020 | paper Effective Subcarrier Pairing Scheme in mmWave-based Relay System Xiao Zhang, Li Xiao mmWaveRCN Poster 2019 | paper Teaching At UM-Dearborn CIS 400 Programming Languages CIS 437/537 Advanced Networking At MSU CSE 331 Algorithms and Data Structures CSE 260 Discrete Structures CSE 232 Introduction to Programming II Students Ph.D. Deniz Acikbas master Ashwin Sarvadey Selase Doku undergraduate Christian Nwobu （NSF STEM Scholar） Fatima Qasem （NSF STEM Scholar） Fatima Mohammed （NSF STEM Scholar） Zhalgas Tileumuratin intern Hasky Fynn alumni Deniz Acikbas (now Ph.D. at UM-Dearborn) Shamit Dholakiya Syed Gilani （UM SURE Scholar） Jaskirat Sudan Nishaant Madhankumar Rohit Raval Awards 2025, Best Paper Award, IEEE DSC 2025, Best Paper Award, IEEE MASS 2025, IHP Research and Engagement Grant, UM 2025, OE Review Grant, UM-Dearborn 2025, OE Creation Grant, UM-Dearborn 2025, Creative Teaching Fund, UM-Dearborn 2025, SURE Program, UM-Dearborn 2025, NeTS ECI Travel Grant, NSF 2024, Regional I-Corps Fund, NSF 2024, RAG Grant, UM-Dearborn 2023/2021/2019, Graduate Office Fellowship, MSU 2023, Dissertation Completion Fellowship, MSU 2022, Graduate Travel Fellowship, MSU 2019, mmWave-RCN Student Travel Grant, NSF 2016-2018, Postgraduate Scholarship, NPU 2016, Outstanding Graduate, TUT 2015, President Scholarship, Top 10, TUT 2013/2014, National Encouragement Sch",
  "content_length": 10601,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:15"
}