{
  "name": "Xiaolei Ren 0001",
  "homepage": "https://fie.must.edu.mo/id-1444/person/view/id-12435.html",
  "status": "success",
  "content": "創新工程學院 - 學院團隊 - 教研團隊 任小蕾 助理教授 所在部門： 計算機科學與工程學院 聯繫電話： 88973731 辦公室： A304a 電子信箱： xlren@must.edu.mo Homepage: https://websites.uta.edu/xiaoleiren/ Academic QualificationPh.D. in Computer Science, The University of Texas, Arlington, USAM.S. in Software Engineering, The University of Texas, Arlington, USAB.S. in Computer Science, Jilin University, China Teaching AreaEIE 331 Embedded Systems (Undergraduate, Fall 2024, Fall 2025)CS/EIE/SE 471 Computer and Network Security (Undergraduate, Spring 2025)SE 252 Software Project Management (Undergraduate, Spring 2025)MIIE01 Advanced Topics in Information Technology (Master, Fall 2025)DNCZ04 Cybersecurity (PhD level, Spring 2025) Research AreaLarge AI Systems and Models with Privacy and Security AnalysisProgramming Languages and Analysis for SecuritySoftware Understanding and Reverse EngineeringRobotics Motion Planning & ControlSoftware Security Analysis Professional ServicesVice Chair, IEEE Computer Society Macau Chapter, 2025-PresentLocal Co-Chair: IEEE 32nd Asia-Pacific Software Engineering Conference (2025)Secretary of the Research Committee of the School of Computer Science and Engineering at MUST, 2024-PresentEditorial Member: Journal of Cybersecurity and Privacy, since 2025Reviewer, IEEE Transactions on Software Engineering, since 2025Reviewer, IEEE Open Journal of the Computer Society, since 2025Reviewer, Journal of Computer Languages, since 2025Reviewer, Elsevier Computers and Electrical Engineering, since 2024Reviewer, Journal of Systems & Software, since 2024Reviewer, IEEE Transactions on Dependable and Secure Computing, since 2022Reviewer, Elsevier Computers & Security, since 2021Reviewer: ACM Conference on Computer and Communications Security (CCS’19-’20)Reviewer: IEEE/ACM Automated Software Engineering (ASE’20)Reviewer: USENIX Security (’21-’22, ’24) Working ExperienceSep. 2024 ~ present, Assistant Professor, School of Computer Science and Engineering, Faculty of Innovation Engineering, MUST Academic Publication (selected)1.          In Proceedings of the ACM International Conference on the Foundations of Software Engineering (FSE). Trondheim, Norway, 2025. (CCF-A) [FSE ’25] Revisiting Optimization-Resilience Claims in Binary Diffing Tools: Insights from LLVM Peephole Optimization Analysis Xiaolei Ren, Mengfei Ren, Yu Lei, Jiang Ming2.          In ACM Digital Threats: Research and Practice (DTRAP). 2023. (JCR Q1) [DTRAP] Security analysis of ZigBee protocol implementation via device-agnostic fuzzing Mengfei Ren, Xiaolei Ren, Huadong Feng, Jiang Ming, and Yu Lei. 3.          In Proceedings of the 2023 European Symposium on Research in Computer Security (ESORICS). Hague, Netherlands, 2023. (CCF-B) [ESORICS ’23] Intelligent Zigbee Protocol Fuzzing via Constraint-Field Dependency Inference Meng Ren, Haotian Zhang, Xiaolei Ren, Jiang Ming, and Yu Lei4.          In Proceedings of the 16th IEEE International Conference on Software Testing, Verification and Validation (ICST), Dublin, Ireland, 2023. [ICST ’23] MagicMirror: Towards High-Coverage Fuzzing of Smart Contracts Huadong Feng, Xiaolei Ren, Qiping Wei, Yu Lei, Raghu Kacker, Richard Kuhn, and Dimitris Simos 5.          In the IEEE Transactions on Emerging Topics in Computational Intelligence (TETCI), 2022. (JCR Q1) [TETCI] Motion Planning and Cooperative Manipulation for Mobile Robots with Dual Arms Fuchun Sun, Yang Chen, Yangyang Wu, Linxiang Li, and Xiaolei Ren6.          In Proceedings of the ACM SIGPLAN International Conference on Programming Language Design and Implementation (PLDI), 2021. (CCF-A) Unleashing the Hidden Power of Compiler Optimization on Binary Code Difference Xiaolei Ren, Michael Ho, Jiang Ming, Yu Lei, and Li Li7.          ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec), 2021. [WiSec ‘21] Z-Fuzzer: device-agnostic fuzzing of Zigbee protocol implementation Mengfei Ren, Xiaolei Ren, Huadong Feng, Jiang Ming, and Yu Lei Zero-day Vulnerabilities Detected: CVE-2020-27890, CVE-2020-27891, CVE-2020-27892 AwardACM SIGPLAN Distinguished Paper Award (ACM PLDI 2021)  Research Grants  1. PI, Research Project (0011/2025/ITP1) supported by the FDCT, 2025-20272. PI, Research Project (0134/2024/RIB2) supported by the FDCT, 2025-20273. PI, Research Project supported by the Faculty Research Grants of MUST, 2025-2026 Academic Publication Citation Information:Google ScholarMUST Scholar Professional Society MembershipMember, CCF/ACM/IEEE TOP",
  "content_length": 4452,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:32"
}