{
  "name": "Xiaotian Dai 0001",
  "homepage": "https://www.xiaotiandai.com",
  "status": "success",
  "content": "Xiaotian (Steven) Dai Dr. Xiaotian (Steven) Dai[ Google Scholar | ResearchGate | LinkedIn | Twitter | GitHub ]Lecturer (~Assistant Professor)Director of ReFLEX LabReal-Time and Distributed Systems GroupDepartment of Computer ScienceUniversity of York, UKOffice: CSE/136Email: xiaotian.dai (at) york.ac.ukAbout MeI am a Lecturer in the Department of Computer Science at the University of York, UK, where I lead the Real-Time and Flexible Cyber-Physical Systems (ReFLEX) Lab, which is a part of the RTDS Research Group.My research focuses on the scheduling and verification of cyber-physical systems, with a particular emphasis on timing analysis and on improving scheduling flexibility and adaptability in safety-critical systems. My research has been applied to real-world applications including robots, autonomous vehicles, avionics, control systems, 5G base stations, transportation, and many other cyber-physical systems that must meet strict timing constraints.Expertise: My work has contributed to innovative modeling, scheduling, simulation, and analysis techniques; digital twins for feedback-based runtime improvement; and specialized hardware designs for safety-critical real-time & embedded systems. Many of these advancements have been adopted by industry. I am also actively involved in the robotics and autonomous systems (RAS) community, concentrating on ensuring operational safety, robustness, and resilience.Track-record: To date, I have published over 30 papers with 500+ citations and an H-index of 12. I regularly serve as a Technical Program Committee (TPC) member and reviewer for prominent conferences and journals spanning real-time embedded systems, robotics, and design automation. I also serve as an external reviewer for UKRI funding.You can find more about my research interests and projects in the research page. If you are interested in pursuing a PhD in real-time systems or cyber-physical systems, you can find more information on PhD opportunities. I maintain a tracking website for real-time, embedded and robotics systems. You can find my robotics projects here. I am an amateur photographer — here is my photography portfolio.BackgroundFrom 2019 to 2023, I worked as a Research Associate on the MOCHA research project (funded by Huawei), under the supervision of Prof. Iain Bate and Prof. Alan Burns in the Real-Time and Distributed Systems Research Group (RTDS), which is the top real-time research group in the UK. The MOCHA project targets complex many-core architectures with demanding performance and timing requirements, leveraging digital twins and cache-aware scheduling to develop key techniques for next-generation 5G/6G communication base stations.Prior to MOCHA, I contributed to the EU H2020 DEIS project in 2019, collaborating with Prof. Tim Kelly and Prof. Ibrahim Habli. DEIS focused on model-based safety assurance — using the Structured Assurance Case Metamodel (SACM) (now an OMG standard) — and developed corresponding tools for model-based autonomous and cyber-physical systems in partnership with AVL, Siemens, General Motors, and Fraunhofer.I first joined the Real-Time Systems Group at York in 2015 as a PhD student under Prof. Alan Burns, earning my PhD in 2019 with a Best Thesis award. Before that, I completed an MSc (with distinction) in Automatic Control and Systems Engineering at the University of Sheffield in 2014, following a BSc (First Class Honours) in Automatic Control in 2011.News(service) Nov 2025: Invited as a TPC member of ECRTS 2026.(service) Nov 2025: Invited as a TPC member of Ada Europe 2026.(project) Oct 2025: Our proposal to use a humanoid robot for virtual production (RAVEN-G1) was granted (£48k).(project) Oct 2025: Our proposal on imitation training of humanoid robots for filming was granted via Google Cloud Research Credits Program (£3,731).(paper) Sep 2025: Our paper “A Hybrid Approach to Refine WCRT Bounds for DAG Scheduling Using Anomaly Classification” is published in IEEE Transactions on Computers!(talk) Aug 2025: Invited Talk, “Digital Twin for Real-Time Cyber-Physical Systems”, on the Systron Lab Research and Demo day.(service) Aug 2025: Invited as a TPC of IEEE RTSS 2025 (AE and BP sessions).(paper) Aug 2025: Our paper “LEFT-RS: A Lock-Free Fault-Tolerant Resource Sharing Protocol for Multicore Real-Time Systems” is accepted at RTSS 2025 (Outstanding Paper)! Hope to see you all in Boston in December!(service) Aug 2025: Invited as the Publication Chair of IEEE RTAS 2026.(paper) July 2025: Our poster “Criticality-aware Scheduling and Path Planning for Fault-Tolerant Cooperative Multi-Robot Systems” is published at TAROS'25!(service) July 2025: Invited as a TPC member of IEEE MOST 2026.(project) July 2025: Our resident programme proposal was accepted by XR Stories, which will focus on robots and digital twins for virtual production (details can be found here).(paper) Mar 2025: Our paper, “A cache-aware DAG scheduling method on multicores: Exploiting node affinity and deferred executions”, is published in Journal of Systems Architecture [Paper].Please visit News for more news.",
  "content_length": 5101,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:39"
}