{
  "name": "Xiaowei Yang 0001",
  "homepage": "https://users.cs.duke.edu/~xwy",
  "status": "success",
  "content": "Xiaowei Yang's Home Page Home Publications Short Bio Advice Collection Useful Links Xiaowei Yang Contact 450 Research Drive Xiaowei Yang D336 LSRC Building Professor Durham, NC 27708 Department of Computer Science Phone: 919-66O-6536 Duke University Fax: 919-66O-6519 E-mail: xiaowei.yang.AT.duke.edu Research My research interests are focused on large-scale computer systems, including computer networks and distributed systems. As a computer system (such as the Internet) increases in the number of components and distributes across diverse geographical locations, a diverse set of intricate challenges arise. These challenges include the optimal placement of functions within the system and the development of strategies for resilience against failures and potential security threats. My research endeavors are geared towards articulating the foundational principles underlying the design, construction, and operation of computer systems that are scalable, reliable, secure, performant, and manageable. My publications are listed here. I am part of Duke Systems group. Notes I am looking for motivated students to join my research group. The research problems I am currently interested in are 1) how to develop practical ML/AI technologies to improve the reliability and security of networks and distributed systems (AIOps), 2) how to protect the online privacy and security of Internet users, and 3) network and system support for latency-sensitive applications. If you are interested in working on any of the topics, please apply to Duke CS and mention my name in your application. Here are three of my recent publications related to these topics: AIOps related, privacy and security related, and low latency related. Teaching CompSci 210: Introduction to Computer Systems [F'23] CompSci 514: Computer Networks [F'19] [F'20] [F'24] [F'25] CompSci356: Computer Network Architecture [S'19] [S'20] [S'21] [S'22] Advanced topics in network security [F'13] [F'15] [F'21] CPS 114: Introduction to computer networks [S'11] [S'10] CPS 296: Hot Topics in Networked Systems [F'10] CPS 214: Computer Network and Distributed Systems [S'09] [F'09] Last updated 10/2023",
  "content_length": 2160,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:41"
}