{
  "name": "Xiaodong Yu 0001",
  "homepage": "https://xiaodong-yu.github.io",
  "status": "success",
  "content": "Xiaodong Yu - Personal Website Xiaodong Yu 余晓东 Assistant Professor, Computer Science Department @ Stevens Institute of Technology Gateway Center N411 · Hoboken, NJ 07030 · (201) 216-5649 · xyu38@stevens.edu This page is not regularly maintained. For the latest updates, please visit my lab's homepage. I am an enthusiastic computer science researcher. I am fascinated by the challenges in algorithm, system software, middleware, and architecture of High-Performance Computing (HPC), especially the ones raised during the accelerations of real-world scientific and AI applications. I have been working for Argonne since 2019. I got my Ph.D. degree in Computer Science from Virginia Tech. I have authored more than 20 research papers published in highly-regarded conferences and journals, such as HPDC, ICS, IPDPS, CLUSTER, and JSAC. I also have served as the Technical Program Committee (TPC) member, AD/AE Committee member, or reviewer for CS conferences and transactions, including SC, TPDS, ISPASS, HotI, and HPCC. I am moving to The Department of Computer Science at Stevens Institute of Technology in 2023Fall as a tenure-track assistant professor. I am always looking for PhD, Master's, and undergrad students with strong self-motivations to join my lab to work on HPC/large-scale machine learning/AI accelerators. The PhD students will be fully-funded throughout the degree study. Please drop me an email with your CV and a brief self-introduction in the text-body if you are interested. Latest News [Paper] Our paper has been accepted by IEEE IPDPS-2023! Congratulations to Milan! 12/2022 [Service] I will serve as a Technical Program Committee (TPC) member for IEEE IWBDR-3. 11/2022 [Service] I will serve as a Technical Program Committee (TPC) member for IEEE/ACM BDCAT-2022. 09/2022 [Service] I will serve as the Finance Chair for IEEE ISPASS-2023. 08/2022 [Service] I will serve as a Technical Program Committee (TPC) member for IEEE HPCC-2022. 07/2022 [Service] I will serve as a Technical Program Committee (TPC) member for IEEE/ACM BDCAT-2022. 07/2022 [Grant] Our 50k LDRD Expedition project has been funded by Argonne! (my role: lead PI) 06/2022 [Service] I will serve as a Posters Program Committee member for IEEE ISPASS-2022. 03/2022 [Paper] Our paper has been accepted by ACM HPDC-2022! 03/2022 [Service] I will serve as the publicity co-chair for IEEE SiPS-2022. 02/2022 [Paper] Our paper has been accepted by IEEE IPDPS-2022! Congratulations to Cody! 01/2022 [Service] I will serve as a Review Board member for IEEE TPDS. 11/2021 [Service] I will serve as a Technical Program Committee (TPC) member for IEEE HPCC-2021. 08/2021 [Paper] Two papers have been accepted by IEEE CLUSTER-2021! 07/2021 [Service] I will serve as an AD/AE Committee member for SC21. 04/2021 [Paper] Our paper has been accepted by ACM ICS-2021! 03/2021 [Service] I will serve as a Program Committee member for IEEE HotI28. 03/2021 [Service] I will serve as a Technical Program Committee (TPC) member for IEEE HPCC-2020. 10/2020 [Paper] Our paper has been accepted by IEEE IPDPS-2020! 12/2019 Education Virginia Tech Doctor of Philosophy (Ph.D.), Computer Science Advisor: Prof. Danfeng (Daphne) Yao Tentative dissertation title: Challenges, Algorithms, and Frameworks for Accelerating Security Applications on High-Performance Computing Platforms Thesis committee: Prof. Danfeng (Daphne) Yao (Chair), Prof. Michela Becchi (NCSU), Prof. Ali Butt, Prof. Matthew Hicks, Prof. Xinming (Simon) Ou (USF) 2013 - 2019 University of Missouri-Columbia Master of Science (M.S.), Electrical & Computer Engineering Advisor: Prof. Michela Becchi Thesis Title: Deep Packet Inspection on Large Datasets: Algorithmic and Parallelization Techniques for Accelerating Regular Expression Matching on Many-Core Processors. 2010 - 2013 China University of Mining and Technology (CUMT) Bachelor of Science (B.S.), Mathematics & Applied Mathematics 2004 - 2008 Experience Assistant Computer Scientist Argonne National Laboratory Designing benchmark suite for next-generation AI hardware (LDRD and FAIR-SBI). Optimizing data loading for large-scale surrogate training (FAIR-SBI). Designing and implementing fast GPU-based lossy compressors for scientific data (VeloC/SZ). Designing and implementing MPI collective communications with compression (Exascale MPI). Designing and implementing multi-GPU-based ptychographic image reconstruction (RAVEN). 2019 - Present Graduate Research Assistant Virginia Tech YAO Group, under the supervision of Prof. Danfeng (Daphne) Yao. Projects: 1. GPU-assisted Android Static Analysis for Security. Supported by ONR grant: Automatic Generation of Anti-Specifications from Exploits for Scalable Program Hardening 2. Cache Timing Side-Channel Attacks. Supported by NSF CISE CSR #1565314 Synergy Lab, under the supervision of Prof. Wu-chun Feng. Projects: 1. High-Performance Automata Processing. Supported by NSF I/UCRC IIP1266245 2. GPU-based CT Image Reconstruction. Supported by NSF CCF-1337131 2013 - Present Co-op Software Engineer Radeon Technology Group (RTG), AMD Help to develop the GPU Deep learning library (MIOpen). May 2017 - August 2017 Graduate Teaching Assistant Virginia Tech CS2505: Computer Organization I CS2506: Computer Organization II 2013 - 2017 Graduate Research Assistant University of Missouri NPS Lab, under the supervision of Prof. Michela Becchi. Project: GPU-based Automata Processing. Supported by NSF award CNS-1216756 2011 - 2013 Research Areas & Skills HPC Parallel Computing Reconfigurable Computing Algorithm Design Application Acceleration Security Program Analysis Side-Channel Attack Anomaly Detection Deep Learning Neural Network GPU Programming CUDA OpenCL ROCm Reconfig Programming Micron's AP-ANML VHDL General Programming C/C++ SHELL Script MATLAB Publications (latest full list) 2023 Milan Shah, Xiaodong Yu, Sheng Di, Danylo Lykov, Yuri Alexeev, Michela Becchi, Franck Cappello, “GPU-Accelerated Error-Bounded Compression Framework for Quantum Circuit Simulations.” In 2023 IEEE International Parallel and Distributed Processing Symposium (IPDPS), IEEE, 2023 (AR:) 2022 Baixi Sun, Xiaodong Yu, Chengming Zhang, Jiannan Tian, Sian Jin, Kamil Iskra, Tao Zhou, Tekin Bicer, Pete Beckman, Dingwen Tao, “SOLAR: A Highly Optimized Data Loading Framework for Distributed Training of CNN-based Scientific Surrogates.” arXiv preprint arXiv:2211.00224, 2022 Xiaodong Yu, Sheng Di, Kai Zhao, Dingwen Tao, Xin Liang, Franck Cappello, “Ultra-fast Error-bounded Lossy Compression for Scientific Dataset.” In Proceedings of the 31th International Symposium on High-Performance Parallel and Distributed Computing (HPDC), ACM, 2022 (AR:21/108=19.4%) Xiaodong Yu, Viktor Nikitin, Daniel J. Ching, Selin Aslan, Doga Gursoy, Tekin Bicer, “Scalable and accurate multi-gpu based image reconstruction of large-scale ptychography data.” In Scientific reports, 2022 Cody Rivera, Sheng Di, Jiannan Tian, Xiaodong Yu, Dingwen Tao, and Franck Cappello, “Optimizing Huffman Decoding for Error-Bounded Lossy Compression on GPUs.” In 2022 IEEE International Parallel and Distributed Processing Symposium (IPDPS), IEEE, 2022 (AR:132/474=27.8%) 2021 Tekin Bicer, Xiaodong Yu, Daniel J. Ching, Ryan Chard, Mathew J. Cherukara, Bogdan Nicolae, Rajkumar Kettimuthu, Ian T. Foster, \"High-Performance Ptychographic Reconstruction with Federated Facilities,” In Smoky Mountains Computational Sciences and Engineering Conference (SMC), Springer, Cham, 2021 Xiaodong Yu, Sheng Di, Ali Murat Gok, Dingwen Tao, Franck Cappello, “cuZ-Checker: A GPU-Based Ultra-Fast Assessment System for Lossy Compressions.” In 2021 IEEE International Conference on Cluster Computing (CLUSTER), pp. 307-319. IEEE, 2021 (AR:48/163=29.4%) Jiannan Tian, Sheng Di, Xiaodong Yu, Kai Zhao, Sian Jin, Yunhe Feng, Xin Liang, Dingwen Tao, Franck Cappello, “Optimizing Error-Bounded Lossy Compression for Scientific Data on GPUs.” In 2021 IEEE International Conference on Cluster Computing (CLUSTER), pp. 283-293. IEEE, 2021 (AR:48/163=29.4%) Xiaodong Yu, Tekin Bicer, Rajkumar Kettimuthu, Ian T. Foster, “Topology-aware Optimizations for Multi-GPU Ptychographic Image Reconstruction,” In 2021 ACM International Conference on Supercomputing (ICS), June 14 - 17, 2021. Worldwide online event (AR:38/157=24.2%) 2020 Xiaodong Yu, Fengguo Wei, Xinming Ou, Michela Becchi, Tekin Bicer, Danfeng Yao, “GPU-Based Static Data-Flow Analysis for Fast and Scalable Android App Vetting,” In 2020 IEEE International Parallel and Distributed Processing Symposium (IPDPS), May 18 pp. 274-284 (AR:110/446=24.7%) [PDF] 2019 Xiaodong Yu, “Algorithms and Frameworks for Accelerating Security Applications on HPC Platforms,” In Virginia Tech (PhD Dissertation) [PDF] Xiaodong Yu, Ya Xiao, Kirk Cameron, and Danfeng Yao, “Comparative Measurement of Cache Configurations’ Impacts on Cache Timing Side-Channel Attacks,” In 12th USENIX Workshop on Cyber Security Experimentation and Test (CSET) (AR:19/61=31.1%) co-located with USENIX Security '19 [PDF] Xiaodong Yu, Hao Wang, Wu-chun Feng, Hao Gong, and Guohua Cao, “GPU-Based Iterative Medical CT Image Reconstructions,” In Journal of Signal Processing Systems (Springer) (JSPS '18) (IF:1.013) 2018 Thomas C. H. Lux, Layne T. Watson, Tyler H. Chang, Jon Bernard, Bo Li, Xiaodong Yu, Li Xu, Godmar Back, Ali R. Butt, Kirk W. Cameron, Yili Hong, Danfeng Yao, “Novel meshes for multivariate interpolation and approximation,” In Proceedings of the ACMSE 2018 Conference (ACMSE '18), Richmond, KY, USA [PDF] Thomas C. H. Lux, Layne T. Watson, Tyler H. Chang, Jon Bernard, Bo Li, Xiaodong Yu, Li Xu, Godmar Back, Ali R. Butt, Kirk W. Cameron, Yili Hong, Danfeng Yao, “Nonparametric Distribution Models for Predicting and Managing Computational Performance Variability” In the IEEE SoutheastCon 2018 (IEEE SoutheastCon '18), St. Petersburg, FL, USA [PDF] 2017 Xiaodong Yu, Kaixi Hou, Hao Wang, Wu-chun Feng, “Robotomata: A Framework for Approximate Pattern Matching of Big Data on an Automata Processor",
  "content_length": 14217,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:23"
}