{
  "name": "Xiaoning Du 0001",
  "homepage": "https://xiaoningdu.github.io",
  "status": "success",
  "content": "Xiaoning Du xiaoning{dot}du{at}monash{dot}edu Room 214, 20 Exhibition Walk Clayton VIC 3800 Australia I am an ARC DECRA Fellow and Senior Lecturer (equivalent to U.S. Associate Professor) at the Department of Software Systems and Cybersecurity of the Faculty of Information Technology, Monash University. I obtained my Ph.D. degree from Nanyang Technological University under the supervision of Prof. Yang Liu, and received my Bachelor’s degree from Fudan University. My research primarily focuses on the security and quality assurance of intelligent software systems, with a particular emphasis on intelligent software engineering tools. I am best known for my contributions to Devign, BigCodeBench, DeepStellar and SimPy. I am the recepient of 2024 Google Research Scholar Award in Software Engineering, and my work has been recognized with ACM SIGSOFT Distinguished Paper Award and ICLR Oral. I am looking for self-motivated Ph.D. students with strong programming skills and relevant research experience. The position is sponsored by full scholarships. Please send me an email with your CV if you are interested. For Monash undergraduate and master students who wish to do honours or minor thesis with me, please check the available projects and send me a copy of your transcript when expressing interest. news Nov 27, 2025 My DECRA project “Energy-Efficient Models for Sustainable Intelligent Software Engineering” is successfully funded by ARC! Stay tuned for more exicting progress on AI-native Program Languages! Nov 21, 2025 I received the 2025 SSC Research Supervisor Award! Nov 21, 2025 Congratulations to Dangfeng Pan for receiving the 2025 SSC Graduate Student Research Award (Minot Thesis)!! Nov 21, 2025 Congratulations to Terry Yue Zhuo for receiving the 2025 SSC Graduate Student Research Award (PhD)!! Jul 01, 2025 I was invited to join the editorial board of TOSEM as an associate editor! Welcome submissions! Apr 17, 2025 Thrilled to share that I’ve been promoted to Senior Lecturer, effective from 1 July 2025! Mar 17, 2025 I joined the Organizaiton Committee of FSE’26 as Proceeding Co-Chair. Welcome submissions! Feb 11, 2025 Our paper “BigCodeBench: Benchmarking Code Generation with Diverse Function Calls and Complex Instructions” got accepted by ICLR’25 and selected for oral presentation! Jan 01, 2025 Congrats to Terry for receiving the 2024-2025 IBM PhD Fellowship Award! Dec 18, 2024 Congrats to Zhensu for receiving the 2024 Bytedance Scholarship Award! Sep 12, 2024 Our ISSTA’24 paper “AI Coders Are Among Us: Rethinking Programming Language Grammar Towards Efficient Code Generation” received ACM SIGSOFT Distinguished Paper Award (11/143)! Sep 05, 2024 I received the 2024 FIT Dean’s Early Career Researcher of the Year Award! Jul 07, 2024 We released a benchmark “BigCodeBench: Benchmarking Code Generation with Diverse Function Calls and Complex Instructions”! Feel free to try it out and send us your feedback! Apr 21, 2024 I received the 2024 Google Research Scholar Program award! Thank you Google! Apr 09, 2024 I will serve on the Program Committee of ISSTA’25. Welcome submissions! Dec 03, 2023 I will serve on the Program Committee of ASE’24. Welcome submissions! Nov 25, 2023 I will serve on the Program Committee of ICSE’25. Welcome submissions! Oct 10, 2023 Our paper “When Neural Code Completion Models Size up the Situation: Attaining Cheaper and Faster Completion through Dynamic Model Inference” is accepted to ICSE’24! Aug 26, 2023 I will serve on the Program Committee of WWW’24. Welcome submissions! Jul 28, 2023 Our paper “DistXplore: Distribution-guided Testing for Evaluating and Enhancing Deep Learning Systems” is accepted to FSE’23! May 05, 2023 Our paper “CodeMark: Imperceptible Watermarking for Code Datasets against Neural Code Completion Models” is accepted to FSE’23! Apr 27, 2023 I will serve on the Program Committee of ISSTA’24. Welcome submissions! Apr 21, 2023 I received the 2023 FIT ECR Seed Grant! Feb 02, 2023 I was invited to be a Publicity Co-Chair of PRDC 2023. Please consider submitting your papers here! Sep 02, 2022 Our paper “FuzzJIT: Towards Fuzzing JavaScript Engine JIT Compiler” is accepted to USENIX Security’23! Jun 23, 2022 I will serve on the Program Committee of FSE’23 research track. Welcome submissions! Jun 08, 2022 I received the 2022 FIT ECR Seed Grant! May 11, 2022 Our paper ICSE’22 paper “On the Importance of Building High-quality Training Datasets for Neural Code Search” received ACM SIGSOFT distinguished paper award nomination (19/197)! Jan 14, 2022 Our paper “CoProtector: Protect Open-Source Code against Unauthorized Training Usage with Data Poisoning” is accepted to WWW’22! Dec 03, 2021 Our paper “On the Importance of Building High-quality Training Datasets for Neural Code Search” is accepted to ICSE’22! Oct 25, 2021 Our paper “CoProtector: Protect Open-Source Code against Unauthorized Training Usage with Data Poisoning” is online at arXiv! Oct 08, 2021 I was invited to be a Co-Chair of the SCORE contest in ICSE’23! Register your team and win a travel to Melbourne! Aug 30, 2021 I received the 2021 FIT ECR Seed Grant! Feb 15, 2021 I joined the Faculty of Information Technology at Monash University as a lecturer!",
  "content_length": 5230,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:37"
}