{
  "name": "Xiaotian Qiao",
  "homepage": "https://xtqiao.com",
  "status": "success",
  "content": "Xiaotian Qiao Xiaotian Qiao Email LinkedIn Google Scholar Biography I am an associate professor in the Department of Computer Science and Technology, Xidian University. I recevied the Ph.D. degree in Computer Science from City University of Hong Kong. I obtained the B.Eng. and M.Sc. in Information and Communication Engineering from Zhejiang University. I also spent time interning at Adobe Research and CASIA. My research interests lie in the areas of computer vision, computer graphics, and human-computer interaction. Specifically, I focus on enabling computers to understand and reason about multimedia data (e.g., images, videos, and vectors) in both spatial and temporal domains. I am particularly excited about leveraging these capabilities for generative AI applications, including controllable content synthesis/editing, document analysis, and user-centric design tools. Selected Publications Under the Shadow: Exploiting Opacity Variation for Fine-grained Shadow Detection Xiaotian Qiao, Ke Xu, Xianglong Yang, Ruijie Dong, Xiaofang Xia, Jiangtao Cui The Annual Conference on Neural Information Processing Systems (NeurIPS), 2025 PDF Project Less is More: Efficient Image Vectorization with Adaptive Parameterization Kaibo Zhao, Liang Bao, Yufei Li, Xu Su, Ke Zhang, Xiaotian Qiao IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025 PDF Project HDLayout: Hierarchical and Directional Layout Planning for Arbitrary Shaped Visual Text Generation Tonghui Feng, Chunsheng Yan, Qianru Wang, Jiangtao Cui, Xiaotian Qiao The Annual AAAI Conference on Artificial Intelligence (AAAI), 2025 PDF Project CollageNoter: Real-Time and Adaptive Collage Layout Design for Screenshot-Based E-Note-Taking Qiuyun Zhang, Bin Guo, Lina Yao, Xiaotian Qiao, Ying Zhang, Zhiwen Yu The Annual AAAI Conference on Artificial Intelligence (AAAI), 2025 PDF Project Teaching Multimedia Data Processing (Undergraduate), 2024 - 2025 Artificial Intelligence and Pattern Recognition (Postgraduate), 2023 - 2025 Honors Huashan Scholar (XDU) Outstanding Academic Performance Award (CityU) Excellent Graduation Thesis (ZJU)",
  "content_length": 2117,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:39"
}