{
  "name": "Xiaogang Wang 0001",
  "homepage": "http://www.ee.cuhk.edu.hk/~xgwang",
  "status": "success",
  "content": "Welcome to Xiaogang Wang Welcome to Xiaogang Wang's Home Page! (Profile at Google Scholar) Email   xgwang at ee dot cuhk dot edu dot hk Xiaogang Wang received his Bachelor degree in Electronic Engineering and Information Science from the Special Class of Gifted Young at the University of Science and Technology of China, MPhil. degree in Information Engineering from the Chinese University of Hong Kong, and PhD degree in Computer Science from Massachusetts Institute of Technology. He is an associate professor in the Department of Electronic Engineering at the Chinese University of Hong Kong since August 2009. He was the Area Chairs of IEEE International Conference on Computer Vision (ICCV) 2011 and 2015, European Conference on Computer Vision (ECCV) 2014 and 2016, Asian Conference on Computer Vision (ACCV) 2014 and 206. He received the Outstanding Young Researcher in Automatic Human Behaviour Analysis Award in 2011, Hong Kong RGC Early Career Award in 2012, and CUHK Young Researcher Award 2012.  His research interests include deep learning and computer vision Positions for postdoc and research assistant on deep learning and computer vision are available. I am also looking for software engineers. Our department is also recruiting tenure-tracked assistant processor and research assistant professor on computer vision. CV Publications Group Talks Projects Datasets News: Our CUvideo team won the challenge of object detection in videos with provided data in ILSVRC 2015. It required detection 30 object categories from 1000 videos. We achieved the mean Average Precision (mAP) of 67.8%, while the team in the second place obtained the mAP of 35.9%. CUvideo won 28 object categories among 30. The presentation. paper and code are available at  [slides] [pdf] [code]. I am teaching a new deep learning course at CUHK [course website]. My talk at NIPS Deep Learning Symposium 2015. [link] [pdf] My talk at Deep Vision Workshop at CVPR 2015. [pdf] Slides of deep learning tutorial at ICIAP 2015 [pdf] Slides of the invited talk on deep learning for face recognition at ICIAP 2015 [pdf]. Tutorial at ISBA 2015. [Video] CVIU Special Issue on Deep Learning in Computer Vision call for papers",
  "content_length": 2200,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:25"
}