{
  "name": "Xiaojuan Qi 0001",
  "homepage": "https://xjqi.github.io",
  "status": "success",
  "content": "Xiaojuan Qi Xiaojuan Qi Assistant Professor Chow Yei Ching Building, Rm 518 Dept. of Electrical and Electronic Engineering University of Hong Kong Hong Kong Email: xjqi [at] eee.hku.hk [Google Scholar] [CVMI Lab][Lab GitHub] Biography I am currently an assistant professor at the University of Hong Kong and a member of Deep Vision Lab. My research encompasses the broad areas of Computer Vision, Deep Learning, and Artificial Intelligence. My objective is to equip machines with open-world capabilities for perceiving, understanding, and reconstructing the visual world, focusing on the following aspects: 1) 3D reconstruction, generation, and visual environment simulation; 2) Open-world, interactive and reliable visual understanding; 3) Efficient training and inference; 4) Applications on open-ended intelligent agents (e.g., autonomous driving, embodied agents). Besides, I am also interested in utilizing AI to advance scientific and medical research (AI for Science and Medicine). I obtained my Ph.D. degree in Computer Science and Engineering Department, The Chinese University of Hong Kong (CUHK), supervised by Prof. Jiaya Jia in 2018. Before that, I got the B.Eng. degree in Electronic Science and Technology at Shanghai Jiao Tong University (SJTU) supervised by Prof. Ya Zhang in 2014. Please email me if you are interested in joining my lab. We have one Postdoc opening in vision for robotics. Please contact me if you are interested in this opportunity. Experiences Postdoctoral Researcher| Torr Vision Group, University of Oxford, Oxford United Kingdom | Dec. 2018 – Jan. 2020 Advisor: Philip H. S. Torr Research Intern | Intel Visual Computing Lab, Intel, Santa Clara, California, USA | May. 2017 – Nov. 2017 Advisor: Vladlen Koltun Topic: Image Synthesis Visiting Student | Machine Learning Group, University of Toronto, Toronto, Canada | Sep. 2016 – Dec . 2016 Advisor: Raquel Urtasun & Sanja Fidler Topic: RGBD Semantic Segmentation Selected Publications [Google Scholar] *: equal contribution, #: corresponding author 2024 Lowis3d: Language-driven open-world instance-level 3d scene understanding Runyu Ding, Jihan Yang, Chuhui Xue, Wenqing Zhang, Song Bai, Xiaojuan Qi#. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024. [Code]. Diffusion-based deep learning method for augmenting ultrastructural imaging and volume electron microscopy Chixiang Lu, Kai Chen, Heng Qiu, Xiaojun Chen, Gu Chen, Xiaojuan Qi#, Haibo Jiang#. Nature Communications, 2024. [Code]. Tool to Resolve Distortions in Elemental and Isotopic Imaging Chixiang Lu, Gu Chen, Wenxin Song, Kai Chen, Charmaine Hee, Mehran Nikan, Paul Guagliardo, C Frank Bennett, Punit Seth, Killugudi Swaminathan Iyer, Stephen G Young, Xiaojuan Qi#, Haibo Jiang#. Journal of the American Chemical Society (JACS), 2024. [Code]. High-dimensional anticounterfeiting nanodiamonds authenticated with deep metric learning Lingzhi Wang*, Xin Yu*, Tongtong Zhang, Yong Hou, Dangyuan Lei, Xiaojuan Qi#, Zhiqin Chu#. Nature Communications, 2024. [Code]. Object-centric Representation Learning for Video Scene Understanding Yi Zhou, Hui Zhang, Seung-In Park, ByungIn Yoo, Xiaojuan Qi#. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024. [Code]. What Makes CLIP More Robust to Long-Tailed Pre-Training Data? A Controlled Study for Transferable Insights Xin Wen, Bingchen Zhao, Yilun Chen, Jiangmiao Pang, Xiaojuan Qi. Conference on Neural Information Processing Systems (NeurIPS), 2024. [Project Page] Splatter a Video: Video Gaussian Representation for Versatile Processing Yang-Tian Sun*, Yi-Hua Huang*, Lin Ma, Xiaoyang Lyu, Yan-Pei Cao, Xiaojuan Qi. Conference on Neural Information Processing Systems (NeurIPS), 2024. [Project Page] Spec-Gaussian: Anisotropic View-Dependent Appearance for 3D Gaussian Splatting Ziyi Yang, Xinyu Gao, Yangtian Sun, Yihua Huang, Xiaoyang Lyu, Wen Zhou, Shaohui Jiao, Xiaojuan Qi, Xiaogang Jin. Conference on Neural Information Processing Systems (NeurIPS), 2024. [Project Page] Decoupled Kullback-Leibler (DKL) Divergence Loss Jiequan Cui, Zhuotao Tian, Zhisheng Zhong, Xiaojuan Qi, Bei Yu, Hanwang Zhang. Conference on Neural Information Processing Systems (NeurIPS), 2024. [Project Page] BiLLM: Pushing the Limit of Post-Training Quantization for LLMs Wei Huang, Yangdong Liu, Haotong Qin, Ying Li, Shiming Zhang, Xianglong Liu, Michele Magno, Xiaojuan Qi. International Conference on Machine Learning (ICML), 2024. [Project Page]. TEXGen: a Generative Diffusion Model for Mesh Textures Xin Yu, Ze Yuan, Yuan-Chen Guo, Ying-Tian Liu, Jianhui Liu, Yangguang Li, Yan-Pei Cao, Ding Liang Xiaojuan Qi#. ACM Transactions on Graphics (TOG) (also appeared in SIGGRAPH Asia), 2024. [Code] Best Paper Honorable Mention 3DGSR: Implicit Surface Reconstruction with 3D Gaussian Splatting Xiaoyang Lyu, Yang-Tian Sun, Yi-Hua Huang, Xiuzhe Wu, Ziyi Yang, Yilun Chen, Jiangmiao Pang, Xiaojuan Qi#. ACM Transactions on Graphics (TOG) (also appeared in SIGGRAPH Asia), 2024. [Code] Groma: Localized Visual Tokenization for Grounding Multimodal Large Language Models Chuofan Ma, Yi Jiang, Jiannan Wu, Zehuan Yuan, Xiaojuan Qi. European Conference on Computer Vision (ECCV), 2024. [Project Page] Can OOD Object Detectors Learn from Foundation Models? Jiahui Liu, Xin Wen, Shizhen Zhao, Yingxian Chen, Xiaojuan Qi. European Conference on Computer Vision (ECCV), 2024. [Project Page] V-IRL: Grounding Virtual Intelligence in Real Life Jihan Yang, Runyu Ding, Ellis L Brown, Xiaojuan Qi, Saining Xie. European Conference on Computer Vision (ECCV), 2024. [Project Page] 3D-Aware Text-Driven Talking Avatar Generation Xiuzhe Wu, Yang-Tian Sun, Handi Chen, Hang Zhou, Jingdong Wang, Zhengzhe Liu, Xiaojuan Qi. European Conference on Computer Vision (ECCV), 2024. [Project Page] UniDream: Unifying Diffusion Priors for Relightable Text-to-3D Generation Zexiang Liu, Yangguang Li, Youtian Lin, Xin Yu, Sida Peng, Yan-Pei Cao, Xiaojuan Qi, Xiaoshui Huang, Ding Liang*, Wanli Ouyang. European Conference on Computer Vision (ECCV), 2024. [Project Page] Total-Decom: Decomposed 3D Scene Reconstruction with Minimal Interaction Xiaoyang Lyu*, Chirui CHANG*, Peng Dai, Yang-Tian_Sun, Xiaojuan Qi. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Code]. Highlight (3.6% acceptance rate) RegionPLC: Regional Point-Language Contrastive Learning for Open-World 3D Scene Understanding Jihan Yang, Runyu Ding, Weipeng DENG, Zhe Wang, Xiaojuan Qi. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Code][Project Page]. SC-GS: Sparse-Controlled Gaussian Splatting for Editable Dynamic Scenes Yi-Hua Huang, Yang-Tian Sun, Ziyi Yang, Xiaoyang Lyu, Yan-Pei Cao, Xiaojuan Qi. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Code][Project Page]. EscherNet: A Generative Model for Scalable View Synthesis Xin Kong, Shikun Liu, Xiaoyang Lyu, Marwan Taher, Xiaojuan Qi, Andrew Davison. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Project Page]. Oral (0.8% acceptance rate) SaCo Loss: Sample-wise Affinity Consistency for Vision-Language Pre-training Sitong Wu, Haoru Tan, Zhuotao Tian, Yukang Chen, Xiaojuan Qi, Jiaya Jia. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Project Page]. Classes Are Not Equal: An Empirical Study on Image Recognition Fairness Jiequan Cui, Beier Zhu, Xin Wen, Xiaojuan Qi, Bei Yu, Hanwang Zhang. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. [Project Page]. Text-to-3d with classifier score distillation Xin Yu, Yuan-Chen Guo, Yangguang Li, Ding Liang, Song-Hai Zhang,Xiaojuan Qi. International Conference on Learning Representations (ICLR), 2024. [Code][Project Page]. 2023 CoDet: Co-occurrence Guided Region-Word Alignment for Open-Vocabulary Object Detection Chuofan Ma, Yi Jiang, Xin Wen, Zehuan Yuan, Xiaojuan Qi. Conference on Neural Information Processing Systems (NeurIPS), 2023. [Code] Data Pruning via Moving-one-Sample-out Haoru Tan, Sitong Wu, Fei Du, Yukang Chen, Zhibin Wang, Fan Wang, Xiaojuan Qi. Conference on Neural Information Processing Systems (NeurIPS), 2023. [Code] CL-NeRF: Continual Learning of Neural Radiance Fields for Evolving Scene Representation Xiuzhe Wu, Peng Dai, Weipeng DENG, Handi Chen, Yang Wu, Yan-Pei Cao, Ying Shan, Xiaojuan Qi. Conference on Neural Information Processing Systems (NeurIPS), 2023. [Code] EXIM: A Hybrid Explicit-Implicit Representation for Text-Guided 3D Shape Generation Zhengzhe Liu, Jingyu Hu, Ka-Hei Hui, Xiaojuan Qi#, Daniel Cohen-Or, Chi-Wing Fu#. ACM Transactions on Graphics (TOG) (also appeared in SIGGRAPH Asia), 2023. [Code] DreamStone: Image as a Stepping Stone for Text-Guided 3D Shape Generation Zhengzhe Liu, Peng Dai, Xiaojuan Qi#, Chi-Wing Fu#. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2023. [Code]. Vertical Layering of Quantized Neural Networks for Heterogeneous Inference Hai Wu, Ruifei He, Haoru Tan, Xiaojuan Qi, Kaibin Huang#. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2023. [Code]. Parametric Classification for Generalized Category Discovery: A Baseline Study Xin Wen*, Bingchen Zhao*, Xiaojuan Qi. IEEE International Conference on Computer Vision (ICCV), 2023. [Code]. Texture Generation on 3D Meshes with Point-UV Diffusion Xin Yu, Peng Dai, Wenbo Li, Lan Ma, Zhengzhe Liu, Xiaojuan Qi. IEEE International Conference on Computer Vision (ICCV), 2023. [Code]. Oral (2.4 % acceptance rate) Prior-free Category-level Pose Estimation with Implicit Space Transformation Jianhui Liu, Yukang Chen, Xiaoqing Ye, Xiaojuan Qi. IEEE International Conference on Computer Vision (ICCV), 2023. [Code]. Learning a Room with the Occ-SDF Hybrid: Signed Distance Function Mingled with Occupancy Aids Scene Representation Xiaoyang Lyu, Peng Dai, Zizhang Li, Dongyu Yan, Yi Lin, Yifan Peng, Xiaojuan Qi. IEEE International Conference on Computer Vision (ICCV), 2023. [Code]. Speech2L",
  "content_length": 25907,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:30"
}