{
  "name": "Xiao Wang 0017",
  "homepage": "https://wangxiaocs.github.io",
  "status": "success",
  "content": "Homepage of Xiao Wang # Xiao Wang（王啸） Professor School of Software, Beihang University, Beijing, China Email: xiao_wang[AT]buaa[DOT]edu[DOT]cn # Brief Bio He is a Professor at Beihang University, China. Prior to BUAA, he was an Associate Professor at Beijing University of Posts and Telecommunications. His research interests are graph neural networks, data mining and machine learning. He was a postdoc in the Department of Computer Science and Technology at Tsinghua University. He got the Ph.D. in the School of Computer Science and Technology at Tianjin University. He visited Washington University in St. Louis as a visiting student. He has published 100+ peer reviewed papers in top venues in AI, where 7 papers are selected as the most influential papers, 1 paper got WWW 2021 best paper awards nomination, 1 paper got the ICDM 2021 best student paper runner-up, 4 papers are ESI highly cited, and several works are integrated into the standard graph learning platform PyG and DGL. He obtains the Second Prize of National Natural Science Award, the First Prize of Natural Science Award of the Ministry of Education, the First Prize in Technology Progress Award of CIE, the WuWenJun AI Excellent Young Scientist Award of CAAI, and the ACM China Rising Star Nomination. He is the World's Top 2% Scientists by Stanford University from 2021 to 2023, and the AI2000 Most Influential Scholar Honorable Mention by AMiner in 2022-2024. He also serves as SPC/PC in ACM SIGKDD, AAAI, IJCAI, WWW, etc, and AE for IEEE TAI. He has presided the project of National Nature Science Foundation of China (NSFC) and CCF-Tencent Open Research Fund. 王啸，北京航空航天大学教授，博士生导师。研究方向为图神经网络、数据挖掘与机器学习。共发表论文100余篇，谷歌学术引用15000余次，其中CCF A类论文60余篇，7篇入选最有影响力论文榜单，3次获得(提名)CCF A/B类等国际会议论文奖，ESI高被引论文4篇，成果多次被写入业界图学习标准库PyG和DGL等。出版教材一部，专著四部，著作章节一章。曾获得国家自然科学二等奖，教育部自然科学一等奖，中国电子学会科技进步一等奖，吴文俊人工智能优秀青年奖，ACM中国新星提名奖，2021-2023年入选斯坦福大学发布的全球Top 2%顶尖科学家榜单，2022-2024年入选AMiner评选的AI2000最具影响力学者Honorable mention。担任WWW/AAAI/IJCAI的高级程序委员会委员，IEEE TAI期刊编委。CCF高级会员，CCF大数据专委会执行委员，CCFAI专委会执行委员，中文信息学会SMP专委会委员，CCF青工委主任助理，北京智源研究院青源会会员。 主持国家自然科学优秀青年基金、面上项目等。 I am looking for self-motivated candidates who have solid mathematical backgrounds, strong English ability, and strong coding skills, including senior undergraduate and postgraduate. If you are interested, please drop me an e-mail with your detailed CV. # News [05/25] One paper was accepted by ICML 2025. [04/25] One paper was accepted by IJCAI 2025. [04/25] Invited to serve as Area Chair for NeurIPS 2025. [02/25] One paper was accepted by IEEE TNNLS. [12/24] Invited to serve as SPC for IJCAI 2025. [12/24] One paper was accepted by KDD 2025. [12/24] One paper was accepted by AAAI 2025. [10/24] One paper was accepted by IEEE TIP. [09/24] Invited to serve as Associate Editor for Neural Networks. [09/24] One paper was accepted by NeurIPS 2024. [09/24] Top 2% Scientists Worldwide 2024 by Stanford University [07/24] One paper was accepted by ECAI 2024. [05/24] One paper was accepted by ICML 2024. [04/24] One paper was accepted by IEEE TNNLS. [03/24] AI 2000 Most Influential Scholar Honorable Mention in AAAI/IJCAI, IR and Recommendation [01/24] Two papers were accepted by WWW 2024. # Publications [Google Scholar (opens new window)] 2025 [C1] Zhongjian Zhang, Xiao Wang*, Huichi Zhou, Yue Yu, Mengmei Zhang, Cheng Yang, Chuan Shi. Can Large Language Models Improve the Adversarial Robustness of Graph Neural Networks? KDD 2025. (CCF-A) [C2] Zhongjian Zhang, Mengmei Zhang, Xiao Wang, Lingjuan Lyu, Bo Yan, Junping Du, Chuan Shi. Rethinking Byzantine Robustness in Federated Recommendation from Sparse Aggregation Perspective. AAAI 2025. (CCF-A) [C3] Yanbei Liu, Chongxu Wang, Lei Geng, Yanwei Pang, Zhitao Xiao, Xiao Wang*. Self-supervised Heterogeneous Graph Neural Network with Optimal Transport. ICML 2025. (CCF-A) [C4] Yuling Wang, Zihui Chen, Pengfei Jiao, Xiao Wang. HeTa: Relation-wise Heterogeneous Graph Foundation Attack Model. IJCAI 2025. (CCF-A) [J1] Yanbei Liu, Yu Zhao, Lei Geng, Zhitao Xiao, Xiao Wang*, Shuai Ma, Yanwei Pang. Multi-Scale Subgraph Adversarial Contrastive Learning. IEEE TNNLS. 2024 [C1] Yibo Li, Xiao Wang, Hongrui Liu, Chuan Shi. A Generalized Neural Diffusion Framework on Graphs. AAAI 2024. (CCF-A) [C2] Yanhu Mo, Xiao Wang*, Shaohua Fan, Chuan Shi. Graph Contrastive Invariant Learning from the Causal Perspective. AAAI 2024. (CCF-A) [C3] Yibo Li, Xiao Wang*, Yujie Xing, Shaohua Fan, Ruijia Wang, Yaoqi Liu, Chuan Shi. Graph Fairness Learning under Distribution Shifts. WWW 2024 (CCF-A) [C4] Yuling Wang, Changxin Tian, Binbin Hu, Yanhua Yu, Ziqi Liu, Zhiqiang Zhang, Jun Zhou, Liang Pang, Xiao Wang. Can Small Language Models be Good Reasoners for Sequential Recommendation? WWW 2024 (CCF-A) [C5] Yujie Xing, Xiao Wang*, Yibo Li, Hai Huang, Chuan Shi. Less is More: on the Over-Globalizing Problem in Graph Transformers. ICML 2024 (CCF-A) [C6] Zhibiao Wang, Xiao Wang*, Haoyue Deng, Nian Liu, Shirui Pan, Chunming Hu. Uncovering the Redundancy in Graph Self-supervised Learning Models. NeurIPS 2024 (CCF-A) [C7] Zixuan Yang, Xiao Wang, Yanhua Yu, Yuling Wang, Kangkang Lu, Zirui Guo, Xiting Qin, Yunshan Ma, Tat-Seng Chua. Hop-based Heterogeneous Graph Transformer. ECAI 2024. [J1] Pengfei Zhu, Zhe Dong, Jialu, Li, Qinghua Hu, Xiao Wang, Qilong Wang. CCP-GNN: Competitive Covariance Pooling for Improving Graph Neural Networks. IEEE TNNLS. [J2] Siyuan Yao, Hao Sun, Tian-Zhu Xiang, Xiao Wang, Xiaochun Cao. Hierarchical Graph Interaction Transformer with Dynamic Token Clustering for Camouflaged Object Detection. IEEE TIP. (CCF-A) [J3] Yanbei Liu, Lu Yu, Shichuan Zhao, Xiao Wang, Lei Geng, Zhitao Xiao, Shuai Ma, Yanwei Pang. Graph Neural Networks With Adaptive Confidence Discrimination. IEEE TNNLS 2023 [C1] Shaohua Fan, Shuyang Zhang, Xiao Wang, Chuan Shi. Directed acyclic graph structure learning from dynamic graphs. AAAI 2023. (CCF-A) [C2] Yue Yu, Xiao Wang*, Mengmei Zhang, Nian Liu, Chuan Shi. Provable Training for Graph Contrastive Learning. NeurIPS 2023. (CCF-A) Spotlight [C3] Donglin Xia, Xiao Wang*, Nian Liu, Chuan Shi. Learning Invariant Representations of Graph Neural Networks via Cluster Generalization. NeurIPS 2023. (CCF-A) [C4] Xiang Zhuang, Qiang Zhang, Keyan Ding, Yatao Bian, Xiao Wang, Jingsong Lv, Hongyang Chen, Huajun Chen. Learning Invariant Molecular Representation in Latent Discrete Space. NeurIPS 2023. (CCF-A) [C5] Mengmei Zhang, Xiao Wang, Chuan Shi, Lingjuan Lyu, Tianchi Yang, Junping Du. Minimum Topology Attacks for Graph Neural Networks. WWW 2023. (CCF-A) [C6] Yuling Wang, Xiao Wang, Xiangzhou Huang, Yanhua Yu, Haoyang Li, Mengdi Zhang, Zirui Guo, Wei Wu. Intent-aware Recommendation via Disentangled Graph Contrastive Learning. IJCAI 2023. (CCF-A) [C7] Yanbei Liu, Yu Zhao, Xiao Wang*, Geng Lei, Zhitao Xiao. Multi-Scale Subgraph Contrastive Learning. IJCAI 2023. (CCF-A) [C8] Yizhen Zheng, He Zhang, Vincent Lee, Yu Zheng, Xiao Wang, Shirui Pan. Finding the Missing-half: Graph Complementary Learning for Homophily-prone and Heterophily-prone Graphs. ICML 2023. (CCF-A) [C9] Shuyun Gu, Xiao Wang, Chuan Shi. Duplicate Multi-modal Entities Detection with Graph Contrastive Self-training Network. ECML-PKDD 2023. [J1] Meiqi Zhu, Xiao Wang, Chuan Shi, Yibo Li, Junping Du. Towards Adaptive Information Fusion in Graph Convolutional Networks. IEEE TKDE. (CCF-A) [J2] Nian Liu, Xiao Wang, Hui Han, Chuan Shi. Hierarchical Contrastive Learning Enhanced Heterogeneous Graph Neural Network. IEEE TKDE. (CCF-A) [J3] Shaohua Fan, Xiao Wang, Chuan Shi, Peng Cui, Bai Wang. Generalizing graph neural networks on out-of-distribution graphs. IEEE TPAMI arXiv:2111.10657 (opens new window) (CCF-A) [J4] Chuan Shi, Meiqi Zhu, Yue Yu, Xiao Wang*, Junping Du. Unifying Graph Neural Networks with a Generalized Optimization Framework. ACM TOIS. (CCF-A) [J5] Wei Zhou, Hong Huang, Ruize Shi, Xiran Song, Xue Lin, Xiao Wang, Hai Jin. Temporal Heterogeneous Information Network Embedding via Semantic Evolution. IEEE TKDE. (CCF-A) [J6] Yanbei Liu, Lianxi Fan, Xiao Wang, Zhitao Xiao, Shuai Ma, Yanwei Pang, Jerry Chun-Wei Lin. HGBER: Heterogeneous Graph Neural Network with Bidirectional Encoding Representation. IEEE TNNLS. [J7] Yanbei Liu, Shichuan Zhao, Xiao Wang, Lei Geng, Zhitao Xiao, Jerry Chun-Wei Lin. Self-consistent Graph Neural Networks for Semi-supervised Node Classification. IEEE TBD. [J8] Deyu Bo, Xiao Wang, Yang Liu, Yuan Fang, Yawen Li, Chuan Shi. A Survey on Spectral Graph Neural Networks. arXiv. (opens new window) # 2022 [C1] Deyu Bo, Binbin Hu, Xiao Wang, Zhiqiang Zhang, Chuan Shi, Jun Zhou. Regularizing graph neural networks via consistency-diversity graph augmentations. AAAI 2022. (CCF-A) [C2] Mengmei Zhang, Xiao Wang, Meiqi Zhu, Chuan Shi, Zhiqiang Zhang, Jun Zhou. Robust heterogeneous graph neural networks against adversarial attacks. AAAI 2022. (CCF-A) [C3] Nian Liu, Xiao Wang, Lingfei Wu, Yu Chen, Xiaojie Guo, Chuan Shi. Compact Graph Structure Learning via Mutual Information Compression. WWW 2022. (CCF-A) [C4] Hongrui Liu, Binbin Hu, Xiao Wang, Chuan Shi, Zhiqiang Zhang, Jun Zhou. Confidence May Cheat: Self-Training on Graph Neural Networks under Distribution Shift. WWW 2022. (CCF-A) [C5] Yugang Ji, Guanyi Chu, Xiao Wang, Chuan Shi, Jianan Zhao. Prohibited Item Detection via Risk Graph Structure Learning. WWW 2022. (CCF-A) [C6] Yiding Zhang, Chaozhuo Li, Xing Xie, Xiao Wang, Chuan Shi, Yuming Liu, Hao Sun, Liangjie Zhang, Weiwei Deng, Qi Zhang. Geometric disentangled collaborative filtering. SIGIR 2022. (CCF-A) [C7] Tianyu Zhao, Cheng Yang, Yibo Li, Quan Gan, Zhenyi Wang, Fengqi Liang, Huan Zhao, Yingxia Shao, Xiao Wang, Chuan Shi. Space4HGNN: A novel, modularized and reproducible platform to evaluate heterogeneous graph neural network. SIGIR 2022. (CCF-A) [C8] Shuyun Gu, Xiao Wang, Chuan Shi, Ding Xiao. Self-supervised graph neural networks for multi-behavior recommendation. IJCAI 2022. (CCF-A) [C9] Hui Han, Tianyu Zhao, Cheng Yang, Hongyi Zhang, Yaoqi Liu, Xiao Wang",
  "content_length": 26399,
  "method": "requests",
  "crawl_time": "2025-12-01 14:48:14"
}